{"summary": "Le Fanu presents the story as part of the casebook of Dr. Hesselius, whose departures from medical orthodoxy rank him as the first occult doctor in literature.\nLaura, one of the two protagonists, narrates, beginning with her childhood in a \"picturesque and solitary\" castle amid an extensive forest in Styria, where she lives with her father, a wealthy English widower retired from service to the Austrian Empire. When she was six, Laura had a vision of a beautiful visitor in her bedchamber. She later claims to have been punctured in her breast, although no wound was found.\nTwelve years later, Laura and her father are admiring the sunset in front of the castle when her father tells her of a letter from his friend, General Spielsdorf. The General was supposed to bring his niece, Bertha Rheinfeldt, to visit the two, but the niece suddenly died under mysterious circumstances. The General ambiguously concludes that he will discuss the circumstances in detail when they meet later.\nLaura, saddened by the loss of a potential friend, longs for a companion. A carriage accident outside Laura's home unexpectedly brings a girl of Laura's age into the family's care. Her name is Carmilla. Both girls instantly recognize the other from the \"dream\" they both had when they were young.\nCarmilla appears injured after her carriage accident, but her mysterious mother informs Laura's father that her journey is urgent and cannot be delayed. She arranges to leave her daughter with Laura and her father until she can return in three months. Before she leaves, she sternly notes that her daughter will not disclose any information whatsoever about her family, past, or herself, and that Carmilla is of sound mind. Laura comments that this information seems needless to say, and her father laughs it off.\nCarmilla and Laura grow to be very close friends, but occasionally Carmilla's mood abruptly changes. She sometimes makes unsettling romantic advances towards Laura. Carmilla refuses to tell anything about herself, despite questioning by Laura. Her secrecy is not the only mysterious thing about Carmilla; she never joins the household in its prayers, she sleeps much of the day, and she seems to sleepwalk outside at night.\nYoung women and girls in the vicinity have begun dying from an unknown malady. When the funeral procession of one such victim passes by the two girls, Laura joins in the funeral hymn. Carmilla bursts out in rage and scolds Laura, complaining that the hymn hurts her ears.\nWhen a shipment of restored heirloom paintings arrives, Laura finds a portrait of her ancestor, Mircalla, Countess Karnstein, dated 1698. The portrait resembles Carmilla exactly, down to the mole on her neck. Carmilla says she might be descended from the Karnsteins.\nDuring Carmilla's stay, Laura has nightmares of a large cat-like beast entering her room and biting her on the chest. The beast then takes the form of a female figure and disappears through the door without opening it. In another nightmare, Laura hears a voice say, \"Your mother warns you to beware of the assassin,\" and a sudden light reveals Carmilla standing at the foot of her bed, her nightdress drenched in blood. Laura's health declines, and her father has a doctor examine her. He finds a small blue spot on her chest and speaks privately with her father, only asking that Laura never be unattended.\nHer father then sets out with Laura, in a carriage, for the ruined village of Karnstein, three miles distant. They leave a message behind asking Carmilla and one of the governesses to follow once the perpetually late-sleeping Carmilla wakes. En route to Karnstein, Laura and her father encounter General Spielsdorf. He tells them his own ghastly story.\nAt a costume ball, Spielsdorf and his niece Bertha had met a young woman named Millarca and her enigmatic mother. Bertha was immediately taken with Millarca. The mother convinced the General that she was an old friend of his and asked that Millarca be allowed to stay with them for three weeks while she attended to a secret matter of great importance.\n\nBertha fell mysteriously ill, suffering the same symptoms as Laura. After consulting with a specially-ordered priestly doctor, the General realized that Bertha was being visited by a vampire. He hid with a sword and waited until a large black creature crawled onto his niece's bed and to her neck. He leapt from his hiding place and attacked the beast, which took the form of Millarca. She fled through the locked door, unharmed. Bertha died immediately afterward.\nUpon arriving at Karnstein, the General asks a woodman where he can find the tomb of Mircalla Karnstein. The woodman says the tomb was relocated long ago by the hero who vanquished the vampires that haunted the region.\nWhile the General and Laura are alone in the ruined chapel, Carmilla appears. The General and Carmilla both fly into a rage upon seeing each other, and the General attacks her with an axe. Carmilla disarms the General and disappears. The General explains that Carmilla is also Millarca, both anagrams for the original name of the vampire Mircalla, Countess Karnstein.\nThe party is joined by Baron Vordenburg, the descendant of the hero who rid the area of vampires long ago. Vordenburg, an authority on vampires, has discovered that his ancestor was romantically involved with the Countess Karnstein before she died and became one of the undead. Using his forefather's notes, he locates Mircalla's hidden tomb. An Imperial Commission exhumes the vampire's body. Immersed in blood, it seems to be breathing faintly, its heart beating, its eyes open. A stake is driven through its heart, and it gives a corresponding shriek; then the head is struck off. The body and head are burned to ashes, which are thrown into a river.\nAfterwards, Laura's father takes his daughter on a year-long tour through Italy to recover from the trauma and regain her health.\n\n", "full_text": "CARMILLA\n\nJ. Sheridan LeFanu\n\n1872\n\n\n\nPROLOGUE\n\n_Upon a paper attached to the Narrative which follows, Doctor Hesselius\nhas written a rather elaborate note, which he accompanies with a\nreference to his Essay on the strange subject which the MS. illuminates.\n\nThis mysterious subject he treats, in that Essay, with his usual\nlearning and acumen, and with remarkable directness and condensation. It\nwill form but one volume of the series of that extraordinary man's\ncollected papers.\n\nAs I publish the case, in this volume, simply to interest the \"laity,\" I\nshall forestall the intelligent lady, who relates it, in nothing; and\nafter due consideration, I have determined, therefore, to abstain from\npresenting any precis of the learned Doctor's reasoning, or extract from\nhis statement on a subject which he describes as \"involving, not\nimprobably, some of the profoundest arcana of our dual existence, and\nits intermediates.\"\n\nI was anxious on discovering this paper, to reopen the correspondence\ncommenced by Doctor Hesselius, so many years before, with a person so\nclever and careful as his informant seems to have been. Much to my\nregret, however, I found that she had died in the interval.\n\nShe, probably, could have added little to the Narrative _which she\ncommunicates in the following pages, with, so far as I can pronounce,\nsuch conscientious particularity_.\n\n\n\nI\n\n_An Early Fright_\n\nIn Styria, we, though by no means magnificent people, inhabit a castle,\nor schloss. A small income, in that part of the world, goes a great way.\nEight or nine hundred a year does wonders. Scantily enough ours would\nhave answered among wealthy people at home. My father is English, and I\nbear an English name, although I never saw England. But here, in this\nlonely and primitive place, where everything is so marvelously cheap, I\nreally don't see how ever so much more money would at all materially add\nto our comforts, or even luxuries.\n\nMy father was in the Austrian service, and retired upon a pension and\nhis patrimony, and purchased this feudal residence, and the small estate\non which it stands, a bargain.\n\nNothing can be more picturesque or solitary. It stands on a slight\neminence in a forest. The road, very old and narrow, passes in front of\nits drawbridge, never raised in my time, and its moat, stocked with\nperch, and sailed over by many swans, and floating on its surface white\nfleets of water lilies.\n\nOver all this the schloss shows its many-windowed front; its towers,\nand its Gothic chapel.\n\nThe forest opens in an irregular and very picturesque glade before its\ngate, and at the right a steep Gothic bridge carries the road over a\nstream that winds in deep shadow through the wood. I have said that this\nis a very lonely place. Judge whether I say truth. Looking from the hall\ndoor towards the road, the forest in which our castle stands extends\nfifteen miles to the right, and twelve to the left. The nearest\ninhabited village is about seven of your English miles to the left. The\nnearest inhabited schloss of any historic associations, is that of old\nGeneral Spielsdorf, nearly twenty miles away to the right.\n\nI have said \"the nearest _inhabited_ village,\" because there is, only\nthree miles westward, that is to say in the direction of General\nSpielsdorf's schloss, a ruined village, with its quaint little church,\nnow roofless, in the aisle of which are the moldering tombs of the proud\nfamily of Karnstein, now extinct, who once owned the equally desolate\nchateau which, in the thick of the forest, overlooks the silent ruins\nof the town.\n\nRespecting the cause of the desertion of this striking and melancholy\nspot, there is a legend which I shall relate to you another time.\n\nI must tell you now, how very small is the party who constitute the\ninhabitants of our castle. I don't include servants, or those dependents\nwho occupy rooms in the buildings attached to the schloss. Listen, and\nwonder! My father, who is the kindest man on earth, but growing old; and\nI, at the date of my story, only nineteen. Eight years have passed\nsince then.\n\nI and my father constituted the family at the schloss. My mother, a\nStyrian lady, died in my infancy, but I had a good-natured governess,\nwho had been with me from, I might almost say, my infancy. I could not\nremember the time when her fat, benignant face was not a familiar\npicture in my memory.\n\nThis was Madame Perrodon, a native of Berne, whose care and good nature\nnow in part supplied to me the loss of my mother, whom I do not even\nremember, so early I lost her. She made a third at our little dinner\nparty. There was a fourth, Mademoiselle De Lafontaine, a lady such as\nyou term, I believe, a \"finishing governess.\" She spoke French and\nGerman, Madame Perrodon French and broken English, to which my father\nand I added English, which, partly to prevent its becoming a lost\nlanguage among us, and partly from patriotic motives, we spoke every\nday. The consequence was a Babel, at which strangers used to laugh, and\nwhich I shall make no attempt to reproduce in this narrative. And there\nwere two or three young lady friends besides, pretty nearly of my own\nage, who were occasional visitors, for longer or shorter terms; and\nthese visits I sometimes returned.\n\nThese were our regular social resources; but of course there were chance\nvisits from \"neighbors\" of only five or six leagues distance. My life\nwas, notwithstanding, rather a solitary one, I can assure you.\n\nMy gouvernantes had just so much control over me as you might conjecture\nsuch sage persons would have in the case of a rather spoiled girl, whose\nonly parent allowed her pretty nearly her own way in everything.\n\nThe first occurrence in my existence, which produced a terrible\nimpression upon my mind, which, in fact, never has been effaced, was one\nof the very earliest incidents of my life which I can recollect. Some\npeople will think it so trifling that it should not be recorded here.\nYou will see, however, by-and-by, why I mention it. The nursery, as it\nwas called, though I had it all to myself, was a large room in the upper\nstory of the castle, with a steep oak roof. I can't have been more than\nsix years old, when one night I awoke, and looking round the room from\nmy bed, failed to see the nursery maid. Neither was my nurse there; and\nI thought myself alone. I was not frightened, for I was one of those\nhappy children who are studiously kept in ignorance of ghost stories, of\nfairy tales, and of all such lore as makes us cover up our heads when\nthe door cracks suddenly, or the flicker of an expiring candle makes the\nshadow of a bedpost dance upon the wall, nearer to our faces. I was\nvexed and insulted at finding myself, as I conceived, neglected, and I\nbegan to whimper, preparatory to a hearty bout of roaring; when to my\nsurprise, I saw a solemn, but very pretty face looking at me from the\nside of the bed. It was that of a young lady who was kneeling, with her\nhands under the coverlet. I looked at her with a kind of pleased wonder,\nand ceased whimpering. She caressed me with her hands, and lay down\nbeside me on the bed, and drew me towards her, smiling; I felt\nimmediately delightfully soothed, and fell asleep again. I was wakened\nby a sensation as if two needles ran into my breast very deep at the\nsame moment, and I cried loudly. The lady started back, with her eyes\nfixed on me, and then slipped down upon the floor, and, as I thought,\nhid herself under the bed.\n\nI was now for the first time frightened, and I yelled with all my might\nand main. Nurse, nursery maid, housekeeper, all came running in, and\nhearing my story, they made light of it, soothing me all they could\nmeanwhile. But, child as I was, I could perceive that their faces were\npale with an unwonted look of anxiety, and I saw them look under the\nbed, and about the room, and peep under tables and pluck open cupboards;\nand the housekeeper whispered to the nurse: \"Lay your hand along that\nhollow in the bed; someone _did_ lie there, so sure as you did not; the\nplace is still warm.\"\n\nI remember the nursery maid petting me, and all three examining my\nchest, where I told them I felt the puncture, and pronouncing that there\nwas no sign visible that any such thing had happened to me.\n\nThe housekeeper and the two other servants who were in charge of the\nnursery, remained sitting up all night; and from that time a servant\nalways sat up in the nursery until I was about fourteen.\n\nI was very nervous for a long time after this. A doctor was called in,\nhe was pallid and elderly. How well I remember his long saturnine face,\nslightly pitted with smallpox, and his chestnut wig. For a good while,\nevery second day, he came and gave me medicine, which of course I hated.\n\nThe morning after I saw this apparition I was in a state of terror, and\ncould not bear to be left alone, daylight though it was, for a moment.\n\nI remember my father coming up and standing at the bedside, and talking\ncheerfully, and asking the nurse a number of questions, and laughing\nvery heartily at one of the answers; and patting me on the shoulder, and\nkissing me, and telling me not to be frightened, that it was nothing but\na dream and could not hurt me.\n\nBut I was not comforted, for I knew the visit of the strange woman was\n_not_ a dream; and I was _awfully_ frightened.\n\nI was a little consoled by the nursery maid's assuring me that it was\nshe who had come and looked at me, and lain down beside me in the bed,\nand that I must have been half-dreaming not to have known her face. But\nthis, though supported by the nurse, did not quite satisfy me.\n\nI remembered, in the course of that day, a venerable old man, in a black\ncassock, coming into the room with the nurse and housekeeper, and\ntalking a little to them, and very kindly to me; his face was very sweet\nand gentle, and he told me they were going to pray, and joined my hands\ntogether, and desired me to say, softly, while they were praying, \"Lord\nhear all good prayers for us, for Jesus' sake.\" I think these were the\nvery words, for I often repeated them to myself, and my nurse used for\nyears to make me say them in my prayers.\n\nI remembered so well the thoughtful sweet face of that white-haired old\nman, in his black cassock, as he stood in that rude, lofty, brown room,\nwith the clumsy furniture of a fashion three hundred years old about\nhim, and the scanty light entering its shadowy atmosphere through the\nsmall lattice. He kneeled, and the three women with him, and he prayed\naloud with an earnest quavering voice for, what appeared to me, a long\ntime. I forget all my life preceding that event, and for some time after\nit is all obscure also, but the scenes I have just described stand out\nvivid as the isolated pictures of the phantasmagoria surrounded\nby darkness.\n\n\n\nII\n\n_A Guest_\n\nI am now going to tell you something so strange that it will require all\nyour faith in my veracity to believe my story. It is not only true,\nnevertheless, but truth of which I have been an eyewitness.\n\nIt was a sweet summer evening, and my father asked me, as he sometimes\ndid, to take a little ramble with him along that beautiful forest vista\nwhich I have mentioned as lying in front of the schloss.\n\n\"General Spielsdorf cannot come to us so soon as I had hoped,\" said my\nfather, as we pursued our walk.\n\nHe was to have paid us a visit of some weeks, and we had expected his\narrival next day. He was to have brought with him a young lady, his\nniece and ward, Mademoiselle Rheinfeldt, whom I had never seen, but whom\nI had heard described as a very charming girl, and in whose society I\nhad promised myself many happy days. I was more disappointed than a\nyoung lady living in a town, or a bustling neighborhood can possibly\nimagine. This visit, and the new acquaintance it promised, had furnished\nmy day dream for many weeks.\n\n\"And how soon does he come?\" I asked.\n\n\"Not till autumn. Not for two months, I dare say,\" he answered. \"And I\nam very glad now, dear, that you never knew Mademoiselle Rheinfeldt.\"\n\n\"And why?\" I asked, both mortified and curious.\n\n\"Because the poor young lady is dead,\" he replied. \"I quite forgot I had\nnot told you, but you were not in the room when I received the General's\nletter this evening.\"\n\nI was very much shocked. General Spielsdorf had mentioned in his first\nletter, six or seven weeks before, that she was not so well as he would\nwish her, but there was nothing to suggest the remotest suspicion\nof danger.\n\n\"Here is the General's letter,\" he said, handing it to me. \"I am afraid\nhe is in great affliction; the letter appears to me to have been written\nvery nearly in distraction.\"\n\nWe sat down on a rude bench, under a group of magnificent lime trees.\nThe sun was setting with all its melancholy splendor behind the sylvan\nhorizon, and the stream that flows beside our home, and passes under the\nsteep old bridge I have mentioned, wound through many a group of noble\ntrees, almost at our feet, reflecting in its current the fading crimson\nof the sky. General Spielsdorf's letter was so extraordinary, so\nvehement, and in some places so self-contradictory, that I read it twice\nover--the second time aloud to my father--and was still unable to\naccount for it, except by supposing that grief had unsettled his mind.\n\nIt said \"I have lost my darling daughter, for as such I loved her.\nDuring the last days of dear Bertha's illness I was not able to write\nto you.\n\n\"Before then I had no idea of her danger. I have lost her, and now learn\n_all_, too late. She died in the peace of innocence, and in the glorious\nhope of a blessed futurity. The fiend who betrayed our infatuated\nhospitality has done it all. I thought I was receiving into my house\ninnocence, gaiety, a charming companion for my lost Bertha. Heavens!\nwhat a fool have I been!\n\n\"I thank God my child died without a suspicion of the cause of her\nsufferings. She is gone without so much as conjecturing the nature of\nher illness, and the accursed passion of the agent of all this misery. I\ndevote my remaining days to tracking and extinguishing a monster. I am\ntold I may hope to accomplish my righteous and merciful purpose. At\npresent there is scarcely a gleam of light to guide me. I curse my\nconceited incredulity, my despicable affectation of superiority, my\nblindness, my obstinacy--all--too late. I cannot write or talk\ncollectedly now. I am distracted. So soon as I shall have a little\nrecovered, I mean to devote myself for a time to enquiry, which may\npossibly lead me as far as Vienna. Some time in the autumn, two months\nhence, or earlier if I live, I will see you--that is, if you permit me;\nI will then tell you all that I scarce dare put upon paper now.\nFarewell. Pray for me, dear friend.\"\n\nIn these terms ended this strange letter. Though I had never seen Bertha\nRheinfeldt my eyes filled with tears at the sudden intelligence; I was\nstartled, as well as profoundly disappointed.\n\nThe sun had now set, and it was twilight by the time I had returned the\nGeneral's letter to my father.\n\nIt was a soft clear evening, and we loitered, speculating upon the\npossible meanings of the violent and incoherent sentences which I had\njust been reading. We had nearly a mile to walk before reaching the road\nthat passes the schloss in front, and by that time the moon was shining\nbrilliantly. At the drawbridge we met Madame Perrodon and Mademoiselle\nDe Lafontaine, who had come out, without their bonnets, to enjoy the\nexquisite moonlight.\n\nWe heard their voices gabbling in animated dialogue as we approached. We\njoined them at the drawbridge, and turned about to admire with them the\nbeautiful scene.\n\nThe glade through which we had just walked lay before us. At our left\nthe narrow road wound away under clumps of lordly trees, and was lost to\nsight amid the thickening forest. At the right the same road crosses the\nsteep and picturesque bridge, near which stands a ruined tower which\nonce guarded that pass; and beyond the bridge an abrupt eminence rises,\ncovered with trees, and showing in the shadows some grey\nivy-clustered rocks.\n\nOver the sward and low grounds a thin film of mist was stealing like\nsmoke, marking the distances with a transparent veil; and here and there\nwe could see the river faintly flashing in the moonlight.\n\nNo softer, sweeter scene could be imagined. The news I had just heard\nmade it melancholy; but nothing could disturb its character of profound\nserenity, and the enchanted glory and vagueness of the prospect.\n\nMy father, who enjoyed the picturesque, and I, stood looking in silence\nover the expanse beneath us. The two good governesses, standing a little\nway behind us, discoursed upon the scene, and were eloquent upon\nthe moon.\n\nMadame Perrodon was fat, middle-aged, and romantic, and talked and\nsighed poetically. Mademoiselle De Lafontaine--in right of her father\nwho was a German, assumed to be psychological, metaphysical, and\nsomething of a mystic--now declared that when the moon shone with a\nlight so intense it was well known that it indicated a special spiritual\nactivity. The effect of the full moon in such a state of brilliancy was\nmanifold. It acted on dreams, it acted on lunacy, it acted on nervous\npeople, it had marvelous physical influences connected with life.\nMademoiselle related that her cousin, who was mate of a merchant ship,\nhaving taken a nap on deck on such a night, lying on his back, with his\nface full in the light on the moon, had wakened, after a dream of an old\nwoman clawing him by the cheek, with his features horribly drawn to one\nside; and his countenance had never quite recovered its equilibrium.\n\n\"The moon, this night,\" she said, \"is full of idyllic and magnetic\ninfluence--and see, when you look behind you at the front of the schloss\nhow all its windows flash and twinkle with that silvery splendor, as if\nunseen hands had lighted up the rooms to receive fairy guests.\"\n\nThere are indolent styles of the spirits in which, indisposed to talk\nourselves, the talk of others is pleasant to our listless ears; and I\ngazed on, pleased with the tinkle of the ladies' conversation.\n\n\"I have got into one of my moping moods tonight,\" said my father, after\na silence, and quoting Shakespeare, whom, by way of keeping up our\nEnglish, he used to read aloud, he said:\n\n  \"'In truth I know not why I am so sad.\n  It wearies me: you say it wearies you;\n  But how I got it--came by it.'\n\n\"I forget the rest. But I feel as if some great misfortune were hanging\nover us. I suppose the poor General's afflicted letter has had something\nto do with it.\"\n\nAt this moment the unwonted sound of carriage wheels and many hoofs upon\nthe road, arrested our attention.\n\nThey seemed to be approaching from the high ground overlooking the\nbridge, and very soon the equipage emerged from that point. Two horsemen\nfirst crossed the bridge, then came a carriage drawn by four horses, and\ntwo men rode behind.\n\nIt seemed to be the traveling carriage of a person of rank; and we were\nall immediately absorbed in watching that very unusual spectacle. It\nbecame, in a few moments, greatly more interesting, for just as the\ncarriage had passed the summit of the steep bridge, one of the leaders,\ntaking fright, communicated his panic to the rest, and after a plunge or\ntwo, the whole team broke into a wild gallop together, and dashing\nbetween the horsemen who rode in front, came thundering along the road\ntowards us with the speed of a hurricane.\n\nThe excitement of the scene was made more painful by the clear,\nlong-drawn screams of a female voice from the carriage window.\n\nWe all advanced in curiosity and horror; me rather in silence, the rest\nwith various ejaculations of terror.\n\nOur suspense did not last long. Just before you reach the castle\ndrawbridge, on the route they were coming, there stands by the roadside\na magnificent lime tree, on the other stands an ancient stone cross, at\nsight of which the horses, now going at a pace that was perfectly\nfrightful, swerved so as to bring the wheel over the projecting roots\nof the tree.\n\nI knew what was coming. I covered my eyes, unable to see it out, and\nturned my head away; at the same moment I heard a cry from my lady\nfriends, who had gone on a little.\n\nCuriosity opened my eyes, and I saw a scene of utter confusion. Two of\nthe horses were on the ground, the carriage lay upon its side with two\nwheels in the air; the men were busy removing the traces, and a lady\nwith a commanding air and figure had got out, and stood with clasped\nhands, raising the handkerchief that was in them every now and then\nto her eyes.\n\nThrough the carriage door was now lifted a young lady, who appeared to\nbe lifeless. My dear old father was already beside the elder lady, with\nhis hat in his hand, evidently tendering his aid and the resources of\nhis schloss. The lady did not appear to hear him, or to have eyes for\nanything but the slender girl who was being placed against the slope\nof the bank.\n\nI approached; the young lady was apparently stunned, but she was\ncertainly not dead. My father, who piqued himself on being something of\na physician, had just had his fingers on her wrist and assured the lady,\nwho declared herself her mother, that her pulse, though faint and\nirregular, was undoubtedly still distinguishable. The lady clasped her\nhands and looked upward, as if in a momentary transport of gratitude;\nbut immediately she broke out again in that theatrical way which is, I\nbelieve, natural to some people.\n\nShe was what is called a fine looking woman for her time of life, and\nmust have been handsome; she was tall, but not thin, and dressed in\nblack velvet, and looked rather pale, but with a proud and commanding\ncountenance, though now agitated strangely.\n\n\"Who was ever being so born to calamity?\" I heard her say, with clasped\nhands, as I came up. \"Here am I, on a journey of life and death, in\nprosecuting which to lose an hour is possibly to lose all. My child will\nnot have recovered sufficiently to resume her route for who can say how\nlong. I must leave her: I cannot, dare not, delay. How far on, sir, can\nyou tell, is the nearest village? I must leave her there; and shall not\nsee my darling, or even hear of her till my return, three months hence.\"\n\nI plucked my father by the coat, and whispered earnestly in his ear:\n\"Oh! papa, pray ask her to let her stay with us--it would be so\ndelightful. Do, pray.\"\n\n\"If Madame will entrust her child to the care of my daughter, and of her\ngood gouvernante, Madame Perrodon, and permit her to remain as our\nguest, under my charge, until her return, it will confer a distinction\nand an obligation upon us, and we shall treat her with all the care and\ndevotion which so sacred a trust deserves.\"\n\n\"I cannot do that, sir, it would be to task your kindness and chivalry\ntoo cruelly,\" said the lady, distractedly.\n\n\"It would, on the contrary, be to confer on us a very great kindness at\nthe moment when we most need it. My daughter has just been disappointed\nby a cruel misfortune, in a visit from which she had long anticipated a\ngreat deal of happiness. If you confide this young lady to our care it\nwill be her best consolation. The nearest village on your route is\ndistant, and affords no such inn as you could think of placing your\ndaughter at; you cannot allow her to continue her journey for any\nconsiderable distance without danger. If, as you say, you cannot suspend\nyour journey, you must part with her tonight, and nowhere could you do\nso with more honest assurances of care and tenderness than here.\"\n\nThere was something in this lady's air and appearance so distinguished\nand even imposing, and in her manner so engaging, as to impress one,\nquite apart from the dignity of her equipage, with a conviction that she\nwas a person of consequence.\n\nBy this time the carriage was replaced in its upright position, and the\nhorses, quite tractable, in the traces again.\n\nThe lady threw on her daughter a glance which I fancied was not quite so\naffectionate as one might have anticipated from the beginning of the\nscene; then she beckoned slightly to my father, and withdrew two or\nthree steps with him out of hearing; and talked to him with a fixed and\nstern countenance, not at all like that with which she had\nhitherto spoken.\n\nI was filled with wonder that my father did not seem to perceive the\nchange, and also unspeakably curious to learn what it could be that she\nwas speaking, almost in his ear, with so much earnestness and rapidity.\n\nTwo or three minutes at most I think she remained thus employed, then\nshe turned, and a few steps brought her to where her daughter lay,\nsupported by Madame Perrodon. She kneeled beside her for a moment and\nwhispered, as Madame supposed, a little benediction in her ear; then\nhastily kissing her she stepped into her carriage, the door was closed,\nthe footmen in stately liveries jumped up behind, the outriders spurred\non, the postilions cracked their whips, the horses plunged and broke\nsuddenly into a furious canter that threatened soon again to become a\ngallop, and the carriage whirled away, followed at the same rapid pace\nby the two horsemen in the rear.\n\n\n\nIII\n\n_We Compare Notes_\n\nWe followed the _cortege_ with our eyes until it was swiftly lost to\nsight in the misty wood; and the very sound of the hoofs and the wheels\ndied away in the silent night air.\n\nNothing remained to assure us that the adventure had not been an\nillusion of a moment but the young lady, who just at that moment opened\nher eyes. I could not see, for her face was turned from me, but she\nraised her head, evidently looking about her, and I heard a very sweet\nvoice ask complainingly, \"Where is mamma?\"\n\nOur good Madame Perrodon answered tenderly, and added some comfortable\nassurances.\n\nI then heard her ask:\n\n\"Where am I? What is this place?\" and after that she said, \"I don't see\nthe carriage; and Matska, where is she?\"\n\nMadame answered all her questions in so far as she understood them; and\ngradually the young lady remembered how the misadventure came about, and\nwas glad to hear that no one in, or in attendance on, the carriage was\nhurt; and on learning that her mamma had left her here, till her return\nin about three months, she wept.\n\nI was going to add my consolations to those of Madame Perrodon when\nMademoiselle De Lafontaine placed her hand upon my arm, saying:\n\n\"Don't approach, one at a time is as much as she can at present converse\nwith; a very little excitement would possibly overpower her now.\"\n\nAs soon as she is comfortably in bed, I thought, I will run up to her\nroom and see her.\n\nMy father in the meantime had sent a servant on horseback for the\nphysician, who lived about two leagues away; and a bedroom was being\nprepared for the young lady's reception.\n\nThe stranger now rose, and leaning on Madame's arm, walked slowly over\nthe drawbridge and into the castle gate.\n\nIn the hall, servants waited to receive her, and she was conducted\nforthwith to her room. The room we usually sat in as our drawing room is\nlong, having four windows, that looked over the moat and drawbridge,\nupon the forest scene I have just described.\n\nIt is furnished in old carved oak, with large carved cabinets, and the\nchairs are cushioned with crimson Utrecht velvet. The walls are covered\nwith tapestry, and surrounded with great gold frames, the figures being\nas large as life, in ancient and very curious costume, and the subjects\nrepresented are hunting, hawking, and generally festive. It is not too\nstately to be extremely comfortable; and here we had our tea, for with\nhis usual patriotic leanings he insisted that the national beverage\nshould make its appearance regularly with our coffee and chocolate.\n\nWe sat here this night, and with candles lighted, were talking over the\nadventure of the evening.\n\nMadame Perrodon and Mademoiselle De Lafontaine were both of our party.\nThe young stranger had hardly lain down in her bed when she sank into a\ndeep sleep; and those ladies had left her in the care of a servant.\n\n\"How do you like our guest?\" I asked, as soon as Madame entered. \"Tell\nme all about her?\"\n\n\"I like her extremely,\" answered Madame, \"she is, I almost think, the\nprettiest creature I ever saw; about your age, and so gentle and nice.\"\n\n\"She is absolutely beautiful,\" threw in Mademoiselle, who had peeped for\na moment into the stranger's room.\n\n\"And such a sweet voice!\" added Madame Perrodon.\n\n\"Did you remark a woman in the carriage, after it was set up again, who\ndid not get out,\" inquired Mademoiselle, \"but only looked from\nthe window?\"\n\n\"No, we had not seen her.\"\n\nThen she described a hideous black woman, with a sort of colored turban\non her head, and who was gazing all the time from the carriage window,\nnodding and grinning derisively towards the ladies, with gleaming eyes\nand large white eyeballs, and her teeth set as if in fury.\n\n\"Did you remark what an ill-looking pack of men the servants were?\"\nasked Madame.\n\n\"Yes,\" said my father, who had just come in, \"ugly, hang-dog looking\nfellows as ever I beheld in my life. I hope they mayn't rob the poor\nlady in the forest. They are clever rogues, however; they got everything\nto rights in a minute.\"\n\n\"I dare say they are worn out with too long traveling,\" said Madame.\n\n\"Besides looking wicked, their faces were so strangely lean, and dark,\nand sullen. I am very curious, I own; but I dare say the young lady will\ntell you all about it tomorrow, if she is sufficiently recovered.\"\n\n\"I don't think she will,\" said my father, with a mysterious smile, and a\nlittle nod of his head, as if he knew more about it than he cared\nto tell us.\n\nThis made us all the more inquisitive as to what had passed between him\nand the lady in the black velvet, in the brief but earnest interview\nthat had immediately preceded her departure.\n\nWe were scarcely alone, when I entreated him to tell me. He did not need\nmuch pressing.\n\n\"There is no particular reason why I should not tell you. She expressed\na reluctance to trouble us with the care of her daughter, saying she was\nin delicate health, and nervous, but not subject to any kind of\nseizure--she volunteered that--nor to any illusion; being, in fact,\nperfectly sane.\"\n\n\"How very odd to say all that!\" I interpolated. \"It was so unnecessary.\"\n\n\"At all events it _was_ said,\" he laughed, \"and as you wish to know all\nthat passed, which was indeed very little, I tell you. She then said, 'I\nam making a long journey of _vital_ importance--she emphasized the\nword--rapid and secret; I shall return for my child in three months; in\nthe meantime, she will be silent as to who we are, whence we come, and\nwhither we are traveling.' That is all she said. She spoke very pure\nFrench. When she said the word 'secret,' she paused for a few seconds,\nlooking sternly, her eyes fixed on mine. I fancy she makes a great point\nof that. You saw how quickly she was gone. I hope I have not done a very\nfoolish thing, in taking charge of the young lady.\"\n\nFor my part, I was delighted. I was longing to see and talk to her; and\nonly waiting till the doctor should give me leave. You, who live in\ntowns, can have no idea how great an event the introduction of a new\nfriend is, in such a solitude as surrounded us.\n\nThe doctor did not arrive till nearly one o'clock; but I could no more\nhave gone to my bed and slept, than I could have overtaken, on foot, the\ncarriage in which the princess in black velvet had driven away.\n\nWhen the physician came down to the drawing room, it was to report very\nfavorably upon his patient. She was now sitting up, her pulse quite\nregular, apparently perfectly well. She had sustained no injury, and the\nlittle shock to her nerves had passed away quite harmlessly. There could\nbe no harm certainly in my seeing her, if we both wished it; and, with\nthis permission I sent, forthwith, to know whether she would allow me to\nvisit her for a few minutes in her room.\n\nThe servant returned immediately to say that she desired nothing more.\n\nYou may be sure I was not long in availing myself of this permission.\n\nOur visitor lay in one of the handsomest rooms in the schloss. It was,\nperhaps, a little stately. There was a somber piece of tapestry opposite\nthe foot of the bed, representing Cleopatra with the asps to her bosom;\nand other solemn classic scenes were displayed, a little faded, upon the\nother walls. But there was gold carving, and rich and varied color\nenough in the other decorations of the room, to more than redeem the\ngloom of the old tapestry.\n\nThere were candles at the bedside. She was sitting up; her slender\npretty figure enveloped in the soft silk dressing gown, embroidered with\nflowers, and lined with thick quilted silk, which her mother had thrown\nover her feet as she lay upon the ground.\n\nWhat was it that, as I reached the bedside and had just begun my little\ngreeting, struck me dumb in a moment, and made me recoil a step or two\nfrom before her? I will tell you.\n\nI saw the very face which had visited me in my childhood at night, which\nremained so fixed in my memory, and on which I had for so many years so\noften ruminated with horror, when no one suspected of what I\nwas thinking.\n\nIt was pretty, even beautiful; and when I first beheld it, wore the\nsame melancholy expression.\n\nBut this almost instantly lighted into a strange fixed smile of\nrecognition.\n\nThere was a silence of fully a minute, and then at length she spoke; I\ncould not.\n\n\"How wonderful!\" she exclaimed. \"Twelve years ago, I saw your face in a\ndream, and it has haunted me ever since.\"\n\n\"Wonderful indeed!\" I repeated, overcoming with an effort the horror\nthat had for a time suspended my utterances. \"Twelve years ago, in\nvision or reality, I certainly saw you. I could not forget your face. It\nhas remained before my eyes ever since.\"\n\nHer smile had softened. Whatever I had fancied strange in it, was gone,\nand it and her dimpling cheeks were now delightfully pretty and\nintelligent.\n\nI felt reassured, and continued more in the vein which hospitality\nindicated, to bid her welcome, and to tell her how much pleasure her\naccidental arrival had given us all, and especially what a happiness it\nwas to me.\n\nI took her hand as I spoke. I was a little shy, as lonely people are,\nbut the situation made me eloquent, and even bold. She pressed my hand,\nshe laid hers upon it, and her eyes glowed, as, looking hastily into\nmine, she smiled again, and blushed.\n\nShe answered my welcome very prettily. I sat down beside her, still\nwondering; and she said:\n\n\"I must tell you my vision about you; it is so very strange that you and\nI should have had, each of the other so vivid a dream, that each should\nhave seen, I you and you me, looking as we do now, when of course we\nboth were mere children. I was a child, about six years old, and I awoke\nfrom a confused and troubled dream, and found myself in a room, unlike\nmy nursery, wainscoted clumsily in some dark wood, and with cupboards\nand bedsteads, and chairs, and benches placed about it. The beds were,\nI thought, all empty, and the room itself without anyone but myself in\nit; and I, after looking about me for some time, and admiring especially\nan iron candlestick with two branches, which I should certainly know\nagain, crept under one of the beds to reach the window; but as I got\nfrom under the bed, I heard someone crying; and looking up, while I was\nstill upon my knees, I saw you--most assuredly you--as I see you now; a\nbeautiful young lady, with golden hair and large blue eyes, and\nlips--your lips--you as you are here.\n\n\"Your looks won me; I climbed on the bed and put my arms about you, and\nI think we both fell asleep. I was aroused by a scream; you were sitting\nup screaming. I was frightened, and slipped down upon the ground, and,\nit seemed to me, lost consciousness for a moment; and when I came to\nmyself, I was again in my nursery at home. Your face I have never\nforgotten since. I could not be misled by mere resemblance. _You are_\nthe lady whom I saw then.\"\n\nIt was now my turn to relate my corresponding vision, which I did, to\nthe undisguised wonder of my new acquaintance.\n\n\"I don't know which should be most afraid of the other,\" she said, again\nsmiling--\"If you were less pretty I think I should be very much afraid\nof you, but being as you are, and you and I both so young, I feel only\nthat I have made your acquaintance twelve years ago, and have already a\nright to your intimacy; at all events it does seem as if we were\ndestined, from our earliest childhood, to be friends. I wonder whether\nyou feel as strangely drawn towards me as I do to you; I have never had\na friend--shall I find one now?\" She sighed, and her fine dark eyes\ngazed passionately on me.\n\nNow the truth is, I felt rather unaccountably towards the beautiful\nstranger. I did feel, as she said, \"drawn towards her,\" but there was\nalso something of repulsion. In this ambiguous feeling, however, the\nsense of attraction immensely prevailed. She interested and won me; she\nwas so beautiful and so indescribably engaging.\n\nI perceived now something of languor and exhaustion stealing over her,\nand hastened to bid her good night.\n\n\"The doctor thinks,\" I added, \"that you ought to have a maid to sit up\nwith you tonight; one of ours is waiting, and you will find her a very\nuseful and quiet creature.\"\n\n\"How kind of you, but I could not sleep, I never could with an attendant\nin the room. I shan't require any assistance--and, shall I confess my\nweakness, I am haunted with a terror of robbers. Our house was robbed\nonce, and two servants murdered, so I always lock my door. It has become\na habit--and you look so kind I know you will forgive me. I see there is\na key in the lock.\"\n\nShe held me close in her pretty arms for a moment and whispered in my\near, \"Good night, darling, it is very hard to part with you, but good\nnight; tomorrow, but not early, I shall see you again.\"\n\nShe sank back on the pillow with a sigh, and her fine eyes followed me\nwith a fond and melancholy gaze, and she murmured again \"Good night,\ndear friend.\"\n\nYoung people like, and even love, on impulse. I was flattered by the\nevident, though as yet undeserved, fondness she showed me. I liked the\nconfidence with which she at once received me. She was determined that\nwe should be very near friends.\n\nNext day came and we met again. I was delighted with my companion; that\nis to say, in many respects.\n\nHer looks lost nothing in daylight--she was certainly the most beautiful\ncreature I had ever seen, and the unpleasant remembrance of the face\npresented in my early dream, had lost the effect of the first unexpected\nrecognition.\n\nShe confessed that she had experienced a similar shock on seeing me, and\nprecisely the same faint antipathy that had mingled with my admiration\nof her. We now laughed together over our momentary horrors.\n\n\n\nIV\n\n_Her Habits--A Saunter_\n\nI told you that I was charmed with her in most particulars.\n\nThere were some that did not please me so well.\n\nShe was above the middle height of women. I shall begin by describing\nher.\n\nShe was slender, and wonderfully graceful. Except that her movements\nwere languid--very languid--indeed, there was nothing in her appearance\nto indicate an invalid. Her complexion was rich and brilliant; her\nfeatures were small and beautifully formed; her eyes large, dark, and\nlustrous; her hair was quite wonderful, I never saw hair so\nmagnificently thick and long when it was down about her shoulders; I\nhave often placed my hands under it, and laughed with wonder at its\nweight. It was exquisitely fine and soft, and in color a rich very dark\nbrown, with something of gold. I loved to let it down, tumbling with its\nown weight, as, in her room, she lay back in her chair talking in her\nsweet low voice, I used to fold and braid it, and spread it out and\nplay with it. Heavens! If I had but known all!\n\nI said there were particulars which did not please me. I have told you\nthat her confidence won me the first night I saw her; but I found that\nshe exercised with respect to herself, her mother, her history,\neverything in fact connected with her life, plans, and people, an ever\nwakeful reserve. I dare say I was unreasonable, perhaps I was wrong; I\ndare say I ought to have respected the solemn injunction laid upon my\nfather by the stately lady in black velvet. But curiosity is a restless\nand unscrupulous passion, and no one girl can endure, with patience,\nthat hers should be baffled by another. What harm could it do anyone to\ntell me what I so ardently desired to know? Had she no trust in my good\nsense or honor? Why would she not believe me when I assured her, so\nsolemnly, that I would not divulge one syllable of what she told me to\nany mortal breathing.\n\nThere was a coldness, it seemed to me, beyond her years, in her smiling\nmelancholy persistent refusal to afford me the least ray of light.\n\nI cannot say we quarreled upon this point, for she would not quarrel\nupon any. It was, of course, very unfair of me to press her, very\nill-bred, but I really could not help it; and I might just as well have\nlet it alone.\n\nWhat she did tell me amounted, in my unconscionable estimation--to\nnothing.\n\nIt was all summed up in three very vague disclosures:\n\nFirst--Her name was Carmilla.\n\nSecond--Her family was very ancient and noble.\n\nThird--Her home lay in the direction of the west.\n\nShe would not tell me the name of her family, nor their armorial\nbearings, nor the name of their estate, nor even that of the country\nthey lived in.\n\nYou are not to suppose that I worried her incessantly on these subjects.\nI watched opportunity, and rather insinuated than urged my inquiries.\nOnce or twice, indeed, I did attack her more directly. But no matter\nwhat my tactics, utter failure was invariably the result. Reproaches and\ncaresses were all lost upon her. But I must add this, that her evasion\nwas conducted with so pretty a melancholy and deprecation, with so many,\nand even passionate declarations of her liking for me, and trust in my\nhonor, and with so many promises that I should at last know all, that I\ncould not find it in my heart long to be offended with her.\n\nShe used to place her pretty arms about my neck, draw me to her, and\nlaying her cheek to mine, murmur with her lips near my ear, \"Dearest,\nyour little heart is wounded; think me not cruel because I obey the\nirresistible law of my strength and weakness; if your dear heart is\nwounded, my wild heart bleeds with yours. In the rapture of my enormous\nhumiliation I live in your warm life, and you shall die--die, sweetly\ndie--into mine. I cannot help it; as I draw near to you, you, in your\nturn, will draw near to others, and learn the rapture of that cruelty,\nwhich yet is love; so, for a while, seek to know no more of me and mine,\nbut trust me with all your loving spirit.\"\n\nAnd when she had spoken such a rhapsody, she would press me more closely\nin her trembling embrace, and her lips in soft kisses gently glow\nupon my cheek.\n\nHer agitations and her language were unintelligible to me.\n\nFrom these foolish embraces, which were not of very frequent occurrence,\nI must allow, I used to wish to extricate myself; but my energies seemed\nto fail me. Her murmured words sounded like a lullaby in my ear, and\nsoothed my resistance into a trance, from which I only seemed to recover\nmyself when she withdrew her arms.\n\nIn these mysterious moods I did not like her. I experienced a strange\ntumultuous excitement that was pleasurable, ever and anon, mingled with\na vague sense of fear and disgust. I had no distinct thoughts about her\nwhile such scenes lasted, but I was conscious of a love growing into\nadoration, and also of abhorrence. This I know is paradox, but I can\nmake no other attempt to explain the feeling.\n\nI now write, after an interval of more than ten years, with a trembling\nhand, with a confused and horrible recollection of certain occurrences\nand situations, in the ordeal through which I was unconsciously passing;\nthough with a vivid and very sharp remembrance of the main current of\nmy story.\n\nBut, I suspect, in all lives there are certain emotional scenes, those\nin which our passions have been most wildly and terribly roused, that\nare of all others the most vaguely and dimly remembered.\n\nSometimes after an hour of apathy, my strange and beautiful companion\nwould take my hand and hold it with a fond pressure, renewed again and\nagain; blushing softly, gazing in my face with languid and burning eyes,\nand breathing so fast that her dress rose and fell with the tumultuous\nrespiration. It was like the ardor of a lover; it embarrassed me; it was\nhateful and yet over-powering; and with gloating eyes she drew me to\nher, and her hot lips traveled along my cheek in kisses; and she would\nwhisper, almost in sobs, \"You are mine, you _shall_ be mine, you and I\nare one for ever.\" Then she had thrown herself back in her chair, with\nher small hands over her eyes, leaving me trembling.\n\n\"Are we related,\" I used to ask; \"what can you mean by all this? I\nremind you perhaps of someone whom you love; but you must not, I hate\nit; I don't know you--I don't know myself when you look so and talk so.\"\n\nShe used to sigh at my vehemence, then turn away and drop my hand.\n\nRespecting these very extraordinary manifestations I strove in vain to\nform any satisfactory theory--I could not refer them to affectation or\ntrick. It was unmistakably the momentary breaking out of suppressed\ninstinct and emotion. Was she, notwithstanding her mother's volunteered\ndenial, subject to brief visitations of insanity; or was there here a\ndisguise and a romance? I had read in old storybooks of such things.\nWhat if a boyish lover had found his way into the house, and sought to\nprosecute his suit in masquerade, with the assistance of a clever old\nadventuress. But there were many things against this hypothesis, highly\ninteresting as it was to my vanity.\n\nI could boast of no little attentions such as masculine gallantry\ndelights to offer. Between these passionate moments there were long\nintervals of commonplace, of gaiety, of brooding melancholy, during\nwhich, except that I detected her eyes so full of melancholy fire,\nfollowing me, at times I might have been as nothing to her. Except in\nthese brief periods of mysterious excitement her ways were girlish; and\nthere was always a languor about her, quite incompatible with a\nmasculine system in a state of health.\n\nIn some respects her habits were odd. Perhaps not so singular in the\nopinion of a town lady like you, as they appeared to us rustic people.\nShe used to come down very late, generally not till one o'clock, she\nwould then take a cup of chocolate, but eat nothing; we then went out\nfor a walk, which was a mere saunter, and she seemed, almost\nimmediately, exhausted, and either returned to the schloss or sat on one\nof the benches that were placed, here and there, among the trees. This\nwas a bodily languor in which her mind did not sympathize. She was\nalways an animated talker, and very intelligent.\n\nShe sometimes alluded for a moment to her own home, or mentioned an\nadventure or situation, or an early recollection, which indicated a\npeople of strange manners, and described customs of which we knew\nnothing. I gathered from these chance hints that her native country was\nmuch more remote than I had at first fancied.\n\nAs we sat thus one afternoon under the trees a funeral passed us by. It\nwas that of a pretty young girl, whom I had often seen, the daughter of\none of the rangers of the forest. The poor man was walking behind the\ncoffin of his darling; she was his only child, and he looked quite\nheartbroken.\n\nPeasants walking two-and-two came behind, they were singing a funeral\nhymn.\n\nI rose to mark my respect as they passed, and joined in the hymn they\nwere very sweetly singing.\n\nMy companion shook me a little roughly, and I turned surprised.\n\nShe said brusquely, \"Don't you perceive how discordant that is?\"\n\n\"I think it very sweet, on the contrary,\" I answered, vexed at the\ninterruption, and very uncomfortable, lest the people who composed the\nlittle procession should observe and resent what was passing.\n\nI resumed, therefore, instantly, and was again interrupted. \"You pierce\nmy ears,\" said Carmilla, almost angrily, and stopping her ears with her\ntiny fingers. \"Besides, how can you tell that your religion and mine are\nthe same; your forms wound me, and I hate funerals. What a fuss! Why you\nmust die--_everyone_ must die; and all are happier when they do.\nCome home.\"\n\n\"My father has gone on with the clergyman to the churchyard. I thought\nyou knew she was to be buried today.\"\n\n\"She? I don't trouble my head about peasants. I don't know who she is,\"\nanswered Carmilla, with a flash from her fine eyes.\n\n\"She is the poor girl who fancied she saw a ghost a fortnight ago, and\nhas been dying ever since, till yesterday, when she expired.\"\n\n\"Tell me nothing about ghosts. I shan't sleep tonight if you do.\"\n\n\"I hope there is no plague or fever coming; all this looks very like\nit,\" I continued. \"The swineherd's young wife died only a week ago, and\nshe thought something seized her by the throat as she lay in her bed,\nand nearly strangled her. Papa says such horrible fancies do accompany\nsome forms of fever. She was quite well the day before. She sank\nafterwards, and died before a week.\"\n\n\"Well, _her_ funeral is over, I hope, and _her_ hymn sung; and our ears\nshan't be tortured with that discord and jargon. It has made me nervous.\nSit down here, beside me; sit close; hold my hand; press it\nhard-hard-harder.\"\n\nWe had moved a little back, and had come to another seat.\n\nShe sat down. Her face underwent a change that alarmed and even\nterrified me for a moment. It darkened, and became horribly livid; her\nteeth and hands were clenched, and she frowned and compressed her lips,\nwhile she stared down upon the ground at her feet, and trembled all over\nwith a continued shudder as irrepressible as ague. All her energies\nseemed strained to suppress a fit, with which she was then breathlessly\ntugging; and at length a low convulsive cry of suffering broke from her,\nand gradually the hysteria subsided. \"There! That comes of strangling\npeople with hymns!\" she said at last. \"Hold me, hold me still. It is\npassing away.\"\n\nAnd so gradually it did; and perhaps to dissipate the somber impression\nwhich the spectacle had left upon me, she became unusually animated and\nchatty; and so we got home.\n\nThis was the first time I had seen her exhibit any definable symptoms of\nthat delicacy of health which her mother had spoken of. It was the first\ntime, also, I had seen her exhibit anything like temper.\n\nBoth passed away like a summer cloud; and never but once afterwards did\nI witness on her part a momentary sign of anger. I will tell you how\nit happened.\n\nShe and I were looking out of one of the long drawing room windows, when\nthere entered the courtyard, over the drawbridge, a figure of a wanderer\nwhom I knew very well. He used to visit the schloss generally twice\na year.\n\nIt was the figure of a hunchback, with the sharp lean features that\ngenerally accompany deformity. He wore a pointed black beard, and he was\nsmiling from ear to ear, showing his white fangs. He was dressed in\nbuff, black, and scarlet, and crossed with more straps and belts than I\ncould count, from which hung all manner of things. Behind, he carried a\nmagic lantern, and two boxes, which I well knew, in one of which was a\nsalamander, and in the other a mandrake. These monsters used to make my\nfather laugh. They were compounded of parts of monkeys, parrots,\nsquirrels, fish, and hedgehogs, dried and stitched together with great\nneatness and startling effect. He had a fiddle, a box of conjuring\napparatus, a pair of foils and masks attached to his belt, several other\nmysterious cases dangling about him, and a black staff with copper\nferrules in his hand. His companion was a rough spare dog, that followed\nat his heels, but stopped short, suspiciously at the drawbridge, and in\na little while began to howl dismally.\n\nIn the meantime, the mountebank, standing in the midst of the courtyard,\nraised his grotesque hat, and made us a very ceremonious bow, paying his\ncompliments very volubly in execrable French, and German not\nmuch better.\n\nThen, disengaging his fiddle, he began to scrape a lively air to which\nhe sang with a merry discord, dancing with ludicrous airs and activity,\nthat made me laugh, in spite of the dog's howling.\n\nThen he advanced to the window with many smiles and salutations, and\nhis hat in his left hand, his fiddle under his arm, and with a fluency\nthat never took breath, he gabbled a long advertisement of all his\naccomplishments, and the resources of the various arts which he placed\nat our service, and the curiosities and entertainments which it was in\nhis power, at our bidding, to display.\n\n\"Will your ladyships be pleased to buy an amulet against the oupire,\nwhich is going like the wolf, I hear, through these woods,\" he said\ndropping his hat on the pavement. \"They are dying of it right and left\nand here is a charm that never fails; only pinned to the pillow, and you\nmay laugh in his face.\"\n\nThese charms consisted of oblong slips of vellum, with cabalistic\nciphers and diagrams upon them.\n\nCarmilla instantly purchased one, and so did I.\n\nHe was looking up, and we were smiling down upon him, amused; at least,\nI can answer for myself. His piercing black eye, as he looked up in our\nfaces, seemed to detect something that fixed for a moment his curiosity.\nIn an instant he unrolled a leather case, full of all manner of odd\nlittle steel instruments.\n\n\"See here, my lady,\" he said, displaying it, and addressing me, \"I\nprofess, among other things less useful, the art of dentistry. Plague\ntake the dog!\" he interpolated. \"Silence, beast! He howls so that your\nladyships can scarcely hear a word. Your noble friend, the young lady at\nyour right, has the sharpest tooth,--long, thin, pointed, like an awl,\nlike a needle; ha, ha! With my sharp and long sight, as I look up, I\nhave seen it distinctly; now if it happens to hurt the young lady, and I\nthink it must, here am I, here are my file, my punch, my nippers; I will\nmake it round and blunt, if her ladyship pleases; no longer the tooth of\na fish, but of a beautiful young lady as she is. Hey? Is the young lady\ndispleased? Have I been too bold? Have I offended her?\"\n\nThe young lady, indeed, looked very angry as she drew back from the\nwindow.\n\n\"How dares that mountebank insult us so? Where is your father? I shall\ndemand redress from him. My father would have had the wretch tied up to\nthe pump, and flogged with a cart whip, and burnt to the bones with the\ncattle brand!\"\n\nShe retired from the window a step or two, and sat down, and had hardly\nlost sight of the offender, when her wrath subsided as suddenly as it\nhad risen, and she gradually recovered her usual tone, and seemed to\nforget the little hunchback and his follies.\n\nMy father was out of spirits that evening. On coming in he told us that\nthere had been another case very similar to the two fatal ones which had\nlately occurred. The sister of a young peasant on his estate, only a\nmile away, was very ill, had been, as she described it, attacked very\nnearly in the same way, and was now slowly but steadily sinking.\n\n\"All this,\" said my father, \"is strictly referable to natural causes.\nThese poor people infect one another with their superstitions, and so\nrepeat in imagination the images of terror that have infested their\nneighbors.\"\n\n\"But that very circumstance frightens one horribly,\" said Carmilla.\n\n\"How so?\" inquired my father.\n\n\"I am so afraid of fancying I see such things; I think it would be as\nbad as reality.\"\n\n\"We are in God's hands: nothing can happen without his permission, and\nall will end well for those who love him. He is our faithful creator; He\nhas made us all, and will take care of us.\"\n\n\"Creator! _Nature!_\" said the young lady in answer to my gentle father.\n\"And this disease that invades the country is natural. Nature. All\nthings proceed from Nature--don't they? All things in the heaven, in the\nearth, and under the earth, act and live as Nature ordains? I\nthink so.\"\n\n\"The doctor said he would come here today,\" said my father, after a\nsilence. \"I want to know what he thinks about it, and what he thinks we\nhad better do.\"\n\n\"Doctors never did me any good,\" said Carmilla.\n\n\"Then you have been ill?\" I asked.\n\n\"More ill than ever you were,\" she answered.\n\n\"Long ago?\"\n\n\"Yes, a long time. I suffered from this very illness; but I forget all\nbut my pain and weakness, and they were not so bad as are suffered in\nother diseases.\"\n\n\"You were very young then?\"\n\n\"I dare say, let us talk no more of it. You would not wound a friend?\"\n\nShe looked languidly in my eyes, and passed her arm round my waist\nlovingly, and led me out of the room. My father was busy over some\npapers near the window.\n\n\"Why does your papa like to frighten us?\" said the pretty girl with a\nsigh and a little shudder.\n\n\"He doesn't, dear Carmilla, it is the very furthest thing from his\nmind.\"\n\n\"Are you afraid, dearest?\"\n\n\"I should be very much if I fancied there was any real danger of my\nbeing attacked as those poor people were.\"\n\n\"You are afraid to die?\"\n\n\"Yes, every one is.\"\n\n\"But to die as lovers may--to die together, so that they may live\ntogether.\n\n\"Girls are caterpillars while they live in the world, to be finally\nbutterflies when the summer comes; but in the meantime there are grubs\nand larvae, don't you see--each with their peculiar propensities,\nnecessities and structure. So says Monsieur Buffon, in his big book, in\nthe next room.\"\n\nLater in the day the doctor came, and was closeted with papa for some\ntime.\n\nHe was a skilful man, of sixty and upwards, he wore powder, and shaved\nhis pale face as smooth as a pumpkin. He and papa emerged from the room\ntogether, and I heard papa laugh, and say as they came out:\n\n\"Well, I do wonder at a wise man like you. What do you say to\nhippogriffs and dragons?\"\n\nThe doctor was smiling, and made answer, shaking his head--\n\n\"Nevertheless life and death are mysterious states, and we know little\nof the resources of either.\"\n\nAnd so they walked on, and I heard no more. I did not then know what the\ndoctor had been broaching, but I think I guess it now.\n\n\n\nV\n\n_A Wonderful Likeness_\n\nThis evening there arrived from Gratz the grave, dark-faced son of the\npicture cleaner, with a horse and cart laden with two large packing\ncases, having many pictures in each. It was a journey of ten leagues,\nand whenever a messenger arrived at the schloss from our little capital\nof Gratz, we used to crowd about him in the hall, to hear the news.\n\nThis arrival created in our secluded quarters quite a sensation. The\ncases remained in the hall, and the messenger was taken charge of by the\nservants till he had eaten his supper. Then with assistants, and armed\nwith hammer, ripping chisel, and turnscrew, he met us in the hall, where\nwe had assembled to witness the unpacking of the cases.\n\nCarmilla sat looking listlessly on, while one after the other the old\npictures, nearly all portraits, which had undergone the process of\nrenovation, were brought to light. My mother was of an old Hungarian\nfamily, and most of these pictures, which were about to be restored to\ntheir places, had come to us through her.\n\nMy father had a list in his hand, from which he read, as the artist\nrummaged out the corresponding numbers. I don't know that the pictures\nwere very good, but they were, undoubtedly, very old, and some of them\nvery curious also. They had, for the most part, the merit of being now\nseen by me, I may say, for the first time; for the smoke and dust of\ntime had all but obliterated them.\n\n\"There is a picture that I have not seen yet,\" said my father. \"In one\ncorner, at the top of it, is the name, as well as I could read, 'Marcia\nKarnstein,' and the date '1698'; and I am curious to see how it has\nturned out.\"\n\nI remembered it; it was a small picture, about a foot and a half high,\nand nearly square, without a frame; but it was so blackened by age that\nI could not make it out.\n\nThe artist now produced it, with evident pride. It was quite beautiful;\nit was startling; it seemed to live. It was the effigy of Carmilla!\n\n\"Carmilla, dear, here is an absolute miracle. Here you are, living,\nsmiling, ready to speak, in this picture. Isn't it beautiful, Papa? And\nsee, even the little mole on her throat.\"\n\nMy father laughed, and said \"Certainly it is a wonderful likeness,\" but\nhe looked away, and to my surprise seemed but little struck by it, and\nwent on talking to the picture cleaner, who was also something of an\nartist, and discoursed with intelligence about the portraits or other\nworks, which his art had just brought into light and color, while I was\nmore and more lost in wonder the more I looked at the picture.\n\n\"Will you let me hang this picture in my room, papa?\" I asked.\n\n\"Certainly, dear,\" said he, smiling, \"I'm very glad you think it so\nlike. It must be prettier even than I thought it, if it is.\"\n\nThe young lady did not acknowledge this pretty speech, did not seem to\nhear it. She was leaning back in her seat, her fine eyes under their\nlong lashes gazing on me in contemplation, and she smiled in a kind\nof rapture.\n\n\"And now you can read quite plainly the name that is written in the\ncorner. It is not Marcia; it looks as if it was done in gold. The name\nis Mircalla, Countess Karnstein, and this is a little coronet over and\nunderneath A.D. 1698. I am descended from the Karnsteins; that is,\nmamma was.\"\n\n\"Ah!\" said the lady, languidly, \"so am I, I think, a very long descent,\nvery ancient. Are there any Karnsteins living now?\"\n\n\"None who bear the name, I believe. The family were ruined, I believe,\nin some civil wars, long ago, but the ruins of the castle are only about\nthree miles away.\"\n\n\"How interesting!\" she said, languidly. \"But see what beautiful\nmoonlight!\" She glanced through the hall door, which stood a little\nopen. \"Suppose you take a little ramble round the court, and look down\nat the road and river.\"\n\n\"It is so like the night you came to us,\" I said.\n\nShe sighed; smiling.\n\nShe rose, and each with her arm about the other's waist, we walked out\nupon the pavement.\n\nIn silence, slowly we walked down to the drawbridge, where the beautiful\nlandscape opened before us.\n\n\"And so you were thinking of the night I came here?\" she almost\nwhispered.\n\n\"Are you glad I came?\"\n\n\"Delighted, dear Carmilla,\" I answered.\n\n\"And you asked for the picture you think like me, to hang in your room,\"\nshe murmured with a sigh, as she drew her arm closer about my waist, and\nlet her pretty head sink upon my shoulder. \"How romantic you are,\nCarmilla,\" I said. \"Whenever you tell me your story, it will be made up\nchiefly of some one great romance.\"\n\nShe kissed me silently.\n\n\"I am sure, Carmilla, you have been in love; that there is, at this\nmoment, an affair of the heart going on.\"\n\n\"I have been in love with no one, and never shall,\" she whispered,\n\"unless it should be with you.\"\n\nHow beautiful she looked in the moonlight!\n\nShy and strange was the look with which she quickly hid her face in my\nneck and hair, with tumultuous sighs, that seemed almost to sob, and\npressed in mine a hand that trembled.\n\nHer soft cheek was glowing against mine. \"Darling, darling,\" she\nmurmured, \"I live in you; and you would die for me, I love you so.\"\n\nI started from her.\n\nShe was gazing on me with eyes from which all fire, all meaning had\nflown, and a face colorless and apathetic.\n\n\"Is there a chill in the air, dear?\" she said drowsily. \"I almost\nshiver; have I been dreaming? Let us come in. Come; come; come in.\"\n\n\"You look ill, Carmilla; a little faint. You certainly must take some\nwine,\" I said.\n\n\"Yes. I will. I'm better now. I shall be quite well in a few minutes.\nYes, do give me a little wine,\" answered Carmilla, as we approached\nthe door.\n\n\"Let us look again for a moment; it is the last time, perhaps, I shall\nsee the moonlight with you.\"\n\n\"How do you feel now, dear Carmilla? Are you really better?\" I asked.\n\nI was beginning to take alarm, lest she should have been stricken with\nthe strange epidemic that they said had invaded the country about us.\n\n\"Papa would be grieved beyond measure,\" I added, \"if he thought you were\never so little ill, without immediately letting us know. We have a very\nskilful doctor near us, the physician who was with papa today.\"\n\n\"I'm sure he is. I know how kind you all are; but, dear child, I am\nquite well again. There is nothing ever wrong with me, but a\nlittle weakness.\n\n\"People say I am languid; I am incapable of exertion; I can scarcely walk\nas far as a child of three years old: and every now and then the little\nstrength I have falters, and I become as you have just seen me. But\nafter all I am very easily set up again; in a moment I am perfectly\nmyself. See how I have recovered.\"\n\nSo, indeed, she had; and she and I talked a great deal, and very\nanimated she was; and the remainder of that evening passed without any\nrecurrence of what I called her infatuations. I mean her crazy talk and\nlooks, which embarrassed, and even frightened me.\n\nBut there occurred that night an event which gave my thoughts quite a\nnew turn, and seemed to startle even Carmilla's languid nature into\nmomentary energy.\n\n\n\nVI\n\n_A Very Strange Agony_\n\nWhen we got into the drawing room, and had sat down to our coffee and\nchocolate, although Carmilla did not take any, she seemed quite herself\nagain, and Madame, and Mademoiselle De Lafontaine, joined us, and made a\nlittle card party, in the course of which papa came in for what he\ncalled his \"dish of tea.\"\n\nWhen the game was over he sat down beside Carmilla on the sofa, and\nasked her, a little anxiously, whether she had heard from her mother\nsince her arrival.\n\nShe answered \"No.\"\n\nHe then asked whether she knew where a letter would reach her at\npresent.\n\n\"I cannot tell,\" she answered ambiguously, \"but I have been thinking of\nleaving you; you have been already too hospitable and too kind to me. I\nhave given you an infinity of trouble, and I should wish to take a\ncarriage tomorrow, and post in pursuit of her; I know where I shall\nultimately find her, although I dare not yet tell you.\"\n\n\"But you must not dream of any such thing,\" exclaimed my father, to my\ngreat relief. \"We can't afford to lose you so, and I won't consent to\nyour leaving us, except under the care of your mother, who was so good\nas to consent to your remaining with us till she should herself return.\nI should be quite happy if I knew that you heard from her: but this\nevening the accounts of the progress of the mysterious disease that has\ninvaded our neighborhood, grow even more alarming; and my beautiful\nguest, I do feel the responsibility, unaided by advice from your mother,\nvery much. But I shall do my best; and one thing is certain, that you\nmust not think of leaving us without her distinct direction to that\neffect. We should suffer too much in parting from you to consent to\nit easily.\"\n\n\"Thank you, sir, a thousand times for your hospitality,\" she answered,\nsmiling bashfully. \"You have all been too kind to me; I have seldom been\nso happy in all my life before, as in your beautiful chateau, under your\ncare, and in the society of your dear daughter.\"\n\nSo he gallantly, in his old-fashioned way, kissed her hand, smiling and\npleased at her little speech.\n\nI accompanied Carmilla as usual to her room, and sat and chatted with\nher while she was preparing for bed.\n\n\"Do you think,\" I said at length, \"that you will ever confide fully in\nme?\"\n\nShe turned round smiling, but made no answer, only continued to smile on\nme.\n\n\"You won't answer that?\" I said. \"You can't answer pleasantly; I ought\nnot to have asked you.\"\n\n\"You were quite right to ask me that, or anything. You do not know how\ndear you are to me, or you could not think any confidence too great to\nlook for.  But I am under vows, no nun half so awfully, and I dare not\ntell my story yet, even to you. The time is very near when you shall\nknow everything. You will think me cruel, very selfish, but love is\nalways selfish; the more ardent the more selfish. How jealous I am you\ncannot know. You must come with me, loving me, to death; or else hate me\nand still come with me, and _hating_ me through death and after. There\nis no such word as indifference in my apathetic nature.\"\n\n\"Now, Carmilla, you are going to talk your wild nonsense again,\" I said\nhastily.\n\n\"Not I, silly little fool as I am, and full of whims and fancies; for\nyour sake I'll talk like a sage. Were you ever at a ball?\"\n\n\"No; how you do run on. What is it like? How charming it must be.\"\n\n\"I almost forget, it is years ago.\"\n\nI laughed.\n\n\"You are not so old. Your first ball can hardly be forgotten yet.\"\n\n\"I remember everything about it--with an effort. I see it all, as divers\nsee what is going on above them, through a medium, dense, rippling, but\ntransparent. There occurred that night what has confused the picture,\nand made its colours faint. I was all but assassinated in my bed,\nwounded here,\" she touched her breast, \"and never was the same since.\"\n\n\"Were you near dying?\"\n\n\"Yes, very--a cruel love--strange love, that would have taken my life.\nLove will have its sacrifices. No sacrifice without blood. Let us go to\nsleep now; I feel so lazy. How can I get up just now and lock my door?\"\n\nShe was lying with her tiny hands buried in her rich wavy hair, under\nher cheek, her little head upon the pillow, and her glittering eyes\nfollowed me wherever I moved, with a kind of shy smile that I could\nnot decipher.\n\nI bid her good night, and crept from the room with an uncomfortable\nsensation.\n\nI often wondered whether our pretty guest ever said her prayers. I\ncertainly had never seen her upon her knees. In the morning she never\ncame down until long after our family prayers were over, and at night\nshe never left the drawing room to attend our brief evening prayers\nin the hall.\n\nIf it had not been that it had casually come out in one of our careless\ntalks that she had been baptised, I should have doubted her being a\nChristian. Religion was a subject on which I had never heard her speak a\nword. If I had known the world better, this particular neglect or\nantipathy would not have so much surprised me.\n\nThe precautions of nervous people are infectious, and persons of a like\ntemperament are pretty sure, after a time, to imitate them. I had\nadopted Carmilla's habit of locking her bedroom door, having taken into\nmy head all her whimsical alarms about midnight invaders and prowling\nassassins. I had also adopted her precaution of making a brief search\nthrough her room, to satisfy herself that no lurking assassin or robber\nwas \"ensconced.\"\n\nThese wise measures taken, I got into my bed and fell asleep. A light\nwas burning in my room. This was an old habit, of very early date, and\nwhich nothing could have tempted me to dispense with.\n\nThus fortified I might take my rest in peace. But dreams come through\nstone walls, light up dark rooms, or darken light ones, and their\npersons make their exits and their entrances as they please, and laugh\nat locksmiths.\n\nI had a dream that night that was the beginning of a very strange agony.\n\nI cannot call it a nightmare, for I was quite conscious of being asleep.\n\nBut I was equally conscious of being in my room, and lying in bed,\nprecisely as I actually was. I saw, or fancied I saw, the room and its\nfurniture just as I had seen it last, except that it was very dark, and\nI saw something moving round the foot of the bed, which at first I\ncould not accurately distinguish. But I soon saw that it was a\nsooty-black animal that resembled a monstrous cat. It appeared to me\nabout four or five feet long for it measured fully the length of the\nhearthrug as it passed over it; and it continued to-ing and fro-ing with\nthe lithe, sinister restlessness of a beast in a cage. I could not cry\nout, although as you may suppose, I was terrified. Its pace was growing\nfaster, and the room rapidly darker and darker, and at length so dark\nthat I could no longer see anything of it but its eyes. I felt it spring\nlightly on the bed. The two broad eyes approached my face, and suddenly\nI felt a stinging pain as if two large needles darted, an inch or two\napart, deep into my breast. I waked with a scream. The room was lighted\nby the candle that burnt there all through the night, and I saw a female\nfigure standing at the foot of the bed, a little at the right side. It\nwas in a dark loose dress, and its hair was down and covered its\nshoulders. A block of stone could not have been more still. There was\nnot the slightest stir of respiration. As I stared at it, the figure\nappeared to have changed its place, and was now nearer the door; then,\nclose to it, the door opened, and it passed out.\n\nI was now relieved, and able to breathe and move. My first thought was\nthat Carmilla had been playing me a trick, and that I had forgotten to\nsecure my door. I hastened to it, and found it locked as usual on the\ninside. I was afraid to open it--I was horrified. I sprang into my bed\nand covered my head up in the bedclothes, and lay there more dead than\nalive till morning.\n\n\n\nVII\n\n_Descending_\n\nIt would be vain my attempting to tell you the horror with which, even\nnow, I recall the occurrence of that night. It was no such transitory\nterror as a dream leaves behind it. It seemed to deepen by time, and\ncommunicated itself to the room and the very furniture that had\nencompassed the apparition.\n\nI could not bear next day to be alone for a moment. I should have told\npapa, but for two opposite reasons. At one time I thought he would laugh\nat my story, and I could not bear its being treated as a jest; and at\nanother I thought he might fancy that I had been attacked by the\nmysterious complaint which had invaded our neighborhood. I had myself no\nmisgiving of the kind, and as he had been rather an invalid for some\ntime, I was afraid of alarming him.\n\nI was comfortable enough with my good-natured companions, Madame\nPerrodon, and the vivacious Mademoiselle Lafontaine. They both perceived\nthat I was out of spirits and nervous, and at length I told them what\nlay so heavy at my heart.\n\nMademoiselle laughed, but I fancied that Madame Perrodon looked anxious.\n\n\"By-the-by,\" said Mademoiselle, laughing, \"the long lime tree walk,\nbehind Carmilla's bedroom window, is haunted!\"\n\n\"Nonsense!\" exclaimed Madame, who probably thought the theme rather\ninopportune, \"and who tells that story, my dear?\"\n\n\"Martin says that he came up twice, when the old yard gate was being\nrepaired, before sunrise, and twice saw the same female figure walking\ndown the lime tree avenue.\"\n\n\"So he well might, as long as there are cows to milk in the river\nfields,\" said Madame.\n\n\"I daresay; but Martin chooses to be frightened, and never did I see\nfool more frightened.\"\n\n\"You must not say a word about it to Carmilla, because she can see down\nthat walk from her room window,\" I interposed, \"and she is, if possible,\na greater coward than I.\"\n\nCarmilla came down rather later than usual that day.\n\n\"I was so frightened last night,\" she said, so soon as were together,\n\"and I am sure I should have seen something dreadful if it had not been\nfor that charm I bought from the poor little hunchback whom I called\nsuch hard names. I had a dream of something black coming round my bed,\nand I awoke in a perfect horror, and I really thought, for some seconds,\nI saw a dark figure near the chimney-piece, but I felt under my pillow\nfor my charm, and the moment my fingers touched it, the figure\ndisappeared, and I felt quite certain, only that I had it by me, that\nsomething frightful would have made its appearance, and, perhaps,\nthrottled me, as it did those poor people we heard of.\n\n\"Well, listen to me,\" I began, and recounted my adventure, at the\nrecital of which she appeared horrified.\n\n\"And had you the charm near you?\" she asked, earnestly.\n\n\"No, I had dropped it into a china vase in the drawing room, but I shall\ncertainly take it with me tonight, as you have so much faith in it.\"\n\nAt this distance of time I cannot tell you, or even understand, how I\novercame my horror so effectually as to lie alone in my room that night.\nI remember distinctly that I pinned the charm to my pillow. I fell\nasleep almost immediately, and slept even more soundly than usual\nall night.\n\nNext night I passed as well. My sleep was delightfully deep and\ndreamless.\n\nBut I wakened with a sense of lassitude and melancholy, which, however,\ndid not exceed a degree that was almost luxurious.\n\n\"Well, I told you so,\" said Carmilla, when I described my quiet sleep,\n\"I had such delightful sleep myself last night; I pinned the charm to\nthe breast of my nightdress. It was too far away the night before. I am\nquite sure it was all fancy, except the dreams. I used to think that\nevil spirits made dreams, but our doctor told me it is no such thing.\nOnly a fever passing by, or some other malady, as they often do, he\nsaid, knocks at the door, and not being able to get in, passes on, with\nthat alarm.\"\n\n\"And what do you think the charm is?\" said I.\n\n\"It has been fumigated or immersed in some drug, and is an antidote\nagainst the malaria,\" she answered.\n\n\"Then it acts only on the body?\"\n\n\"Certainly; you don't suppose that evil spirits are frightened by bits\nof ribbon, or the perfumes of a druggist's shop? No, these complaints,\nwandering in the air, begin by trying the nerves, and so infect the\nbrain, but before they can seize upon you, the antidote repels them.\nThat I am sure is what the charm has done for us. It is nothing magical,\nit is simply natural.\"\n\nI should have been happier if I could have quite agreed with Carmilla,\nbut I did my best, and the impression was a little losing its force.\n\nFor some nights I slept profoundly; but still every morning I felt the\nsame lassitude, and a languor weighed upon me all day. I felt myself a\nchanged girl. A strange melancholy was stealing over me, a melancholy\nthat I would not have interrupted. Dim thoughts of death began to open,\nand an idea that I was slowly sinking took gentle, and, somehow, not\nunwelcome, possession of me. If it was sad, the tone of mind which this\ninduced was also sweet.\n\nWhatever it might be, my soul acquiesced in it.\n\nI would not admit that I was ill, I would not consent to tell my papa,\nor to have the doctor sent for.\n\nCarmilla became more devoted to me than ever, and her strange paroxysms\nof languid adoration more frequent. She used to gloat on me with\nincreasing ardor the more my strength and spirits waned. This always\nshocked me like a momentary glare of insanity.\n\nWithout knowing it, I was now in a pretty advanced stage of the\nstrangest illness under which mortal ever suffered. There was an\nunaccountable fascination in its earlier symptoms that more than\nreconciled me to the incapacitating effect of that stage of the malady.\nThis fascination increased for a time, until it reached a certain point,\nwhen gradually a sense of the horrible mingled itself with it,\ndeepening, as you shall hear, until it discolored and perverted the\nwhole state of my life.\n\nThe first change I experienced was rather agreeable. It was very near\nthe turning point from which began the descent of Avernus.\n\nCertain vague and strange sensations visited me in my sleep. The\nprevailing one was of that pleasant, peculiar cold thrill which we feel\nin bathing, when we move against the current of a river. This was soon\naccompanied by dreams that seemed interminable, and were so vague that\nI could never recollect their scenery and persons, or any one connected\nportion of their action. But they left an awful impression, and a sense\nof exhaustion, as if I had passed through a long period of great mental\nexertion and danger.\n\nAfter all these dreams there remained on waking a remembrance of having\nbeen in a place very nearly dark, and of having spoken to people whom I\ncould not see; and especially of one clear voice, of a female's, very\ndeep, that spoke as if at a distance, slowly, and producing always the\nsame sensation of indescribable solemnity and fear. Sometimes there came\na sensation as if a hand was drawn softly along my cheek and neck.\nSometimes it was as if warm lips kissed me, and longer and longer and\nmore lovingly as they reached my throat, but there the caress fixed\nitself. My heart beat faster, my breathing rose and fell rapidly and\nfull drawn; a sobbing, that rose into a sense of strangulation,\nsupervened, and turned into a dreadful convulsion, in which my senses\nleft me and I became unconscious.\n\nIt was now three weeks since the commencement of this unaccountable\nstate.\n\nMy sufferings had, during the last week, told upon my appearance. I had\ngrown pale, my eyes were dilated and darkened underneath, and the\nlanguor which I had long felt began to display itself in my countenance.\n\nMy father asked me often whether I was ill; but, with an obstinacy which\nnow seems to me unaccountable, I persisted in assuring him that I was\nquite well.\n\nIn a sense this was true. I had no pain, I could complain of no bodily\nderangement. My complaint seemed to be one of the imagination, or the\nnerves, and, horrible as my sufferings were, I kept them, with a morbid\nreserve, very nearly to myself.\n\nIt could not be that terrible complaint which the peasants called the\noupire, for I had now been suffering for three weeks, and they were\nseldom ill for much more than three days, when death put an end to\ntheir miseries.\n\nCarmilla complained of dreams and feverish sensations, but by no means\nof so alarming a kind as mine. I say that mine were extremely alarming.\nHad I been capable of comprehending my condition, I would have invoked\naid and advice on my knees. The narcotic of an unsuspected influence was\nacting upon me, and my perceptions were benumbed.\n\nI am going to tell you now of a dream that led immediately to an odd\ndiscovery.\n\nOne night, instead of the voice I was accustomed to hear in the dark, I\nheard one, sweet and tender, and at the same time terrible, which said,\n\"Your mother warns you to beware of the assassin.\" At the same time a\nlight unexpectedly sprang up, and I saw Carmilla, standing, near the\nfoot of my bed, in her white nightdress, bathed, from her chin to her\nfeet, in one great stain of blood.\n\nI wakened with a shriek, possessed with the one idea that Carmilla was\nbeing murdered. I remember springing from my bed, and my next\nrecollection is that of standing on the lobby, crying for help.\n\nMadame and Mademoiselle came scurrying out of their rooms in alarm; a\nlamp burned always on the lobby, and seeing me, they soon learned the\ncause of my terror.\n\nI insisted on our knocking at Carmilla's door. Our knocking was\nunanswered.\n\nIt soon became a pounding and an uproar. We shrieked her name, but all\nwas vain.\n\nWe all grew frightened, for the door was locked. We hurried back, in\npanic, to my room. There we rang the bell long and furiously. If my\nfather's room had been at that side of the house, we would have called\nhim up at once to our aid. But, alas! he was quite out of hearing, and\nto reach him involved an excursion for which we none of us had courage.\n\nServants, however, soon came running up the stairs; I had got on my\ndressing gown and slippers meanwhile, and my companions were already\nsimilarly furnished. Recognizing the voices of the servants on the\nlobby, we sallied out together; and having renewed, as fruitlessly, our\nsummons at Carmilla's door, I ordered the men to force the lock. They\ndid so, and we stood, holding our lights aloft, in the doorway, and so\nstared into the room.\n\nWe called her by name; but there was still no reply. We looked round the\nroom. Everything was undisturbed. It was exactly in the state in which I\nhad left it on bidding her good night. But Carmilla was gone.\n\n\n\nVIII\n\n_Search_\n\nAt sight of the room, perfectly undisturbed except for our violent\nentrance, we began to cool a little, and soon recovered our senses\nsufficiently to dismiss the men. It had struck Mademoiselle that\npossibly Carmilla had been wakened by the uproar at her door, and in her\nfirst panic had jumped from her bed, and hid herself in a press, or\nbehind a curtain, from which she could not, of course, emerge until the\nmajordomo and his myrmidons had withdrawn. We now recommenced our\nsearch, and began to call her name again.\n\nIt was all to no purpose. Our perplexity and agitation increased. We\nexamined the windows, but they were secured. I implored of Carmilla, if\nshe had concealed herself, to play this cruel trick no longer--to come\nout and to end our anxieties. It was all useless. I was by this time\nconvinced that she was not in the room, nor in the dressing room, the\ndoor of which was still locked on this side. She could not have passed\nit. I was utterly puzzled. Had Carmilla discovered one of those secret\npassages which the old housekeeper said were known to exist in the\nschloss, although the tradition of their exact situation had been lost?\nA little time would, no doubt, explain all--utterly perplexed as, for\nthe present, we were.\n\nIt was past four o'clock, and I preferred passing the remaining hours of\ndarkness in Madame's room. Daylight brought no solution of the\ndifficulty.\n\nThe whole household, with my father at its head, was in a state of\nagitation next morning. Every part of the chateau was searched. The\ngrounds were explored. No trace of the missing lady could be discovered.\nThe stream was about to be dragged; my father was in distraction; what a\ntale to have to tell the poor girl's mother on her return. I, too, was\nalmost beside myself, though my grief was quite of a different kind.\n\nThe morning was passed in alarm and excitement. It was now one o'clock,\nand still no tidings. I ran up to Carmilla's room, and found her\nstanding at her dressing table. I was astounded. I could not believe my\neyes. She beckoned me to her with her pretty finger, in silence. Her\nface expressed extreme fear.\n\nI ran to her in an ecstasy of joy; I kissed and embraced her again and\nagain. I ran to the bell and rang it vehemently, to bring others to the\nspot who might at once relieve my father's anxiety.\n\n\"Dear Carmilla, what has become of you all this time? We have been in\nagonies of anxiety about you,\" I exclaimed. \"Where have you been? How\ndid you come back?\"\n\n\"Last night has been a night of wonders,\" she said.\n\n\"For mercy's sake, explain all you can.\"\n\n\"It was past two last night,\" she said, \"when I went to sleep as usual\nin my bed, with my doors locked, that of the dressing room, and that\nopening upon the gallery. My sleep was uninterrupted, and, so far as I\nknow, dreamless; but I woke just now on the sofa in the dressing room\nthere, and I found the door between the rooms open, and the other door\nforced. How could all this have happened without my being wakened? It\nmust have been accompanied with a great deal of noise, and I am\nparticularly easily wakened; and how could I have been carried out of my\nbed without my sleep having been interrupted, I whom the slightest stir\nstartles?\"\n\nBy this time, Madame, Mademoiselle, my father, and a number of the\nservants were in the room. Carmilla was, of course, overwhelmed with\ninquiries, congratulations, and welcomes. She had but one story to tell,\nand seemed the least able of all the party to suggest any way of\naccounting for what had happened.\n\nMy father took a turn up and down the room, thinking. I saw Carmilla's\neye follow him for a moment with a sly, dark glance.\n\nWhen my father had sent the servants away, Mademoiselle having gone in\nsearch of a little bottle of valerian and salvolatile, and there being\nno one now in the room with Carmilla, except my father, Madame, and\nmyself, he came to her thoughtfully, took her hand very kindly, led her\nto the sofa, and sat down beside her.\n\n\"Will you forgive me, my dear, if I risk a conjecture, and ask a\nquestion?\"\n\n\"Who can have a better right?\" she said. \"Ask what you please, and I\nwill tell you everything. But my story is simply one of bewilderment and\ndarkness. I know absolutely nothing. Put any question you please, but\nyou know, of course, the limitations mamma has placed me under.\"\n\n\"Perfectly, my dear child. I need not approach the topics on which she\ndesires our silence. Now, the marvel of last night consists in your\nhaving been removed from your bed and your room, without being wakened,\nand this removal having occurred apparently while the windows were still\nsecured, and the two doors locked upon the inside. I will tell you my\ntheory and ask you a question.\"\n\nCarmilla was leaning on her hand dejectedly; Madame and I were\nlistening breathlessly.\n\n\"Now, my question is this. Have you ever been suspected of walking in\nyour sleep?\"\n\n\"Never, since I was very young indeed.\"\n\n\"But you did walk in your sleep when you were young?\"\n\n\"Yes; I know I did. I have been told so often by my old nurse.\"\n\nMy father smiled and nodded.\n\n\"Well, what has happened is this. You got up in your sleep, unlocked the\ndoor, not leaving the key, as usual, in the lock, but taking it out and\nlocking it on the outside; you again took the key out, and carried it\naway with you to some one of the five-and-twenty rooms on this floor, or\nperhaps upstairs or downstairs. There are so many rooms and closets, so\nmuch heavy furniture, and such accumulations of lumber, that it would\nrequire a week to search this old house thoroughly. Do you see, now,\nwhat I mean?\"\n\n\"I do, but not all,\" she answered.\n\n\"And how, papa, do you account for her finding herself on the sofa in\nthe dressing room, which we had searched so carefully?\"\n\n\"She came there after you had searched it, still in her sleep, and at\nlast awoke spontaneously, and was as much surprised to find herself\nwhere she was as any one else. I wish all mysteries were as easily and\ninnocently explained as yours, Carmilla,\" he said, laughing. \"And so we\nmay congratulate ourselves on the certainty that the most natural\nexplanation of the occurrence is one that involves no drugging, no\ntampering with locks, no burglars, or poisoners, or witches--nothing\nthat need alarm Carmilla, or anyone else, for our safety.\"\n\nCarmilla was looking charmingly. Nothing could be more beautiful than\nher tints. Her beauty was, I think, enhanced by that graceful languor\nthat was peculiar to her. I think my father was silently contrasting her\nlooks with mine, for he said:\n\n\"I wish my poor Laura was looking more like herself\"; and he sighed.\n\nSo our alarms were happily ended, and Carmilla restored to her friends.\n\n\n\nIX\n\n_The Doctor_\n\nAs Carmilla would not hear of an attendant sleeping in her room, my\nfather arranged that a servant should sleep outside her door, so that\nshe would not attempt to make another such excursion without being\narrested at her own door.\n\nThat night passed quietly; and next morning early, the doctor, whom my\nfather had sent for without telling me a word about it, arrived to\nsee me.\n\nMadame accompanied me to the library; and there the grave little doctor,\nwith white hair and spectacles, whom I mentioned before, was waiting to\nreceive me.\n\nI told him my story, and as I proceeded he grew graver and graver.\n\nWe were standing, he and I, in the recess of one of the windows, facing\none another. When my statement was over, he leaned with his shoulders\nagainst the wall, and with his eyes fixed on me earnestly, with an\ninterest in which was a dash of horror.\n\nAfter a minute's reflection, he asked Madame if he could see my father.\n\nHe was sent for accordingly, and as he entered, smiling, he said:\n\n\"I dare say, doctor, you are going to tell me that I am an old fool for\nhaving brought you here; I hope I am.\"\n\nBut his smile faded into shadow as the doctor, with a very grave face,\nbeckoned him to him.\n\nHe and the doctor talked for some time in the same recess where I had\njust conferred with the physician. It seemed an earnest and\nargumentative conversation. The room is very large, and I and Madame\nstood together, burning with curiosity, at the farther end. Not a word\ncould we hear, however, for they spoke in a very low tone, and the deep\nrecess of the window quite concealed the doctor from view, and very\nnearly my father, whose foot, arm, and shoulder only could we see; and\nthe voices were, I suppose, all the less audible for the sort of closet\nwhich the thick wall and window formed.\n\nAfter a time my father's face looked into the room; it was pale,\nthoughtful, and, I fancied, agitated.\n\n\"Laura, dear, come here for a moment. Madame, we shan't trouble you, the\ndoctor says, at present.\"\n\nAccordingly I approached, for the first time a little alarmed; for,\nalthough I felt very weak, I did not feel ill; and strength, one always\nfancies, is a thing that may be picked up when we please.\n\nMy father held out his hand to me, as I drew near, but he was looking at\nthe doctor, and he said:\n\n\"It certainly is very odd; I don't understand it quite. Laura, come\nhere, dear; now attend to Doctor Spielsberg, and recollect yourself.\"\n\n\"You mentioned a sensation like that of two needles piercing the skin,\nsomewhere about your neck, on the night when you experienced your first\nhorrible dream. Is there still any soreness?\"\n\n\"None at all,\" I answered.\n\n\"Can you indicate with your finger about the point at which you think\nthis occurred?\"\n\n\"Very little below my throat--here,\" I answered.\n\nI wore a morning dress, which covered the place I pointed to.\n\n\"Now you can satisfy yourself,\" said the doctor. \"You won't mind your\npapa's lowering your dress a very little. It is necessary, to detect a\nsymptom of the complaint under which you have been suffering.\"\n\nI acquiesced. It was only an inch or two below the edge of my collar.\n\n\"God bless me!--so it is,\" exclaimed my father, growing pale.\n\n\"You see it now with your own eyes,\" said the doctor, with a gloomy\ntriumph.\n\n\"What is it?\" I exclaimed, beginning to be frightened.\n\n\"Nothing, my dear young lady, but a small blue spot, about the size of\nthe tip of your little finger; and now,\" he continued, turning to papa,\n\"the question is what is best to be done?\"\n\n\"Is there any danger?\" I urged, in great trepidation.\n\n\"I trust not, my dear,\" answered the doctor. \"I don't see why you should\nnot recover. I don't see why you should not begin immediately to get\nbetter. That is the point at which the sense of strangulation begins?\"\n\n\"Yes,\" I answered.\n\n\"And--recollect as well as you can--the same point was a kind of center\nof that thrill which you described just now, like the current of a cold\nstream running against you?\"\n\n\"It may have been; I think it was.\"\n\n\"Ay, you see?\" he added, turning to my father. \"Shall I say a word to\nMadame?\"\n\n\"Certainly,\" said my father.\n\nHe called Madame to him, and said:\n\n\"I find my young friend here far from well. It won't be of any great\nconsequence, I hope; but it will be necessary that some steps be taken,\nwhich I will explain by-and-by; but in the meantime, Madame, you will\nbe so good as not to let Miss Laura be alone for one moment. That is the\nonly direction I need give for the present. It is indispensable.\"\n\n\"We may rely upon your kindness, Madame, I know,\" added my father.\n\nMadame satisfied him eagerly.\n\n\"And you, dear Laura, I know you will observe the doctor's direction.\"\n\n\"I shall have to ask your opinion upon another patient, whose symptoms\nslightly resemble those of my daughter, that have just been detailed to\nyou--very much milder in degree, but I believe quite of the same sort.\nShe is a young lady--our guest; but as you say you will be passing this\nway again this evening, you can't do better than take your supper here,\nand you can then see her. She does not come down till the afternoon.\"\n\n\"I thank you,\" said the doctor. \"I shall be with you, then, at about\nseven this evening.\"\n\nAnd then they repeated their directions to me and to Madame, and with\nthis parting charge my father left us, and walked out with the doctor;\nand I saw them pacing together up and down between the road and the\nmoat, on the grassy platform in front of the castle, evidently absorbed\nin earnest conversation.\n\nThe doctor did not return. I saw him mount his horse there, take his\nleave, and ride away eastward through the forest.\n\nNearly at the same time I saw the man arrive from Dranfield with the\nletters, and dismount and hand the bag to my father.\n\nIn the meantime, Madame and I were both busy, lost in conjecture as to\nthe reasons of the singular and earnest direction which the doctor and\nmy father had concurred in imposing. Madame, as she afterwards told me,\nwas afraid the doctor apprehended a sudden seizure, and that, without\nprompt assistance, I might either lose my life in a fit, or at least be\nseriously hurt.\n\nThe interpretation did not strike me; and I fancied, perhaps luckily for\nmy nerves, that the arrangement was prescribed simply to secure a\ncompanion, who would prevent my taking too much exercise, or eating\nunripe fruit, or doing any of the fifty foolish things to which young\npeople are supposed to be prone.\n\nAbout half an hour after my father came in--he had a letter in his\nhand--and said:\n\n\"This letter had been delayed; it is from General Spielsdorf. He might\nhave been here yesterday, he may not come till tomorrow or he may be\nhere today.\"\n\nHe put the open letter into my hand; but he did not look pleased, as he\nused when a guest, especially one so much loved as the General,\nwas coming.\n\nOn the contrary, he looked as if he wished him at the bottom of the Red\nSea. There was plainly something on his mind which he did not choose\nto divulge.\n\n\"Papa, darling, will you tell me this?\" said I, suddenly laying my hand\non his arm, and looking, I am sure, imploringly in his face.\n\n\"Perhaps,\" he answered, smoothing my hair caressingly over my eyes.\n\n\"Does the doctor think me very ill?\"\n\n\"No, dear; he thinks, if right steps are taken, you will be quite well\nagain, at least, on the high road to a complete recovery, in a day or\ntwo,\" he answered, a little dryly. \"I wish our good friend, the General,\nhad chosen any other time; that is, I wish you had been perfectly well\nto receive him.\"\n\n\"But do tell me, papa,\" I insisted, \"what does he think is the matter\nwith me?\"\n\n\"Nothing; you must not plague me with questions,\" he answered, with more\nirritation than I ever remember him to have displayed before; and seeing\nthat I looked wounded, I suppose, he kissed me, and added, \"You shall\nknow all about it in a day or two; that is, all that I know. In the\nmeantime you are not to trouble your head about it.\"\n\nHe turned and left the room, but came back before I had done wondering\nand puzzling over the oddity of all this; it was merely to say that he\nwas going to Karnstein, and had ordered the carriage to be ready at\ntwelve, and that I and Madame should accompany him; he was going to see the\npriest who lived near those picturesque grounds, upon business, and as\nCarmilla had never seen them, she could follow, when she came down, with\nMademoiselle, who would bring materials for what you call a picnic,\nwhich might be laid for us in the ruined castle.\n\nAt twelve o'clock, accordingly, I was ready, and not long after, my\nfather, Madame and I set out upon our projected drive.\n\nPassing the drawbridge we turn to the right, and follow the road over\nthe steep Gothic bridge, westward, to reach the deserted village and\nruined castle of Karnstein.\n\nNo sylvan drive can be fancied prettier. The ground breaks into gentle\nhills and hollows, all clothed with beautiful wood, totally destitute of\nthe comparative formality which artificial planting and early culture\nand pruning impart.\n\nThe irregularities of the ground often lead the road out of its course,\nand cause it to wind beautifully round the sides of broken hollows and\nthe steeper sides of the hills, among varieties of ground almost\ninexhaustible.\n\nTurning one of these points, we suddenly encountered our old friend, the\nGeneral, riding towards us, attended by a mounted servant. His\nportmanteaus were following in a hired wagon, such as we term a cart.\n\nThe General dismounted as we pulled up, and, after the usual greetings,\nwas easily persuaded to accept the vacant seat in the carriage and send\nhis horse on with his servant to the schloss.\n\n\n\nX\n\n_Bereaved_\n\nIt was about ten months since we had last seen him: but that time had\nsufficed to make an alteration of years in his appearance. He had grown\nthinner; something of gloom and anxiety had taken the place of that\ncordial serenity which used to characterize his features. His dark blue\neyes, always penetrating, now gleamed with a sterner light from under\nhis shaggy grey eyebrows. It was not such a change as grief alone\nusually induces, and angrier passions seemed to have had their share in\nbringing it about.\n\nWe had not long resumed our drive, when the General began to talk, with\nhis usual soldierly directness, of the bereavement, as he termed it,\nwhich he had sustained in the death of his beloved niece and ward; and\nhe then broke out in a tone of intense bitterness and fury, inveighing\nagainst the \"hellish arts\" to which she had fallen a victim, and\nexpressing, with more exasperation than piety, his wonder that Heaven\nshould tolerate so monstrous an indulgence of the lusts and malignity\nof hell.\n\nMy father, who saw at once that something very extraordinary had\nbefallen, asked him, if not too painful to him, to detail the\ncircumstances which he thought justified the strong terms in which he\nexpressed himself.\n\n\"I should tell you all with pleasure,\" said the General, \"but you would\nnot believe me.\"\n\n\"Why should I not?\" he asked.\n\n\"Because,\" he answered testily, \"you believe in nothing but what\nconsists with your own prejudices and illusions. I remember when I was\nlike you, but I have learned better.\"\n\n\"Try me,\" said my father; \"I am not such a dogmatist as you suppose.\nBesides which, I very well know that you generally require proof for\nwhat you believe, and am, therefore, very strongly predisposed to\nrespect your conclusions.\"\n\n\"You are right in supposing that I have not been led lightly into a\nbelief in the marvelous--for what I have experienced is marvelous--and I\nhave been forced by extraordinary evidence to credit that which ran\ncounter, diametrically, to all my theories. I have been made the dupe of\na preternatural conspiracy.\"\n\nNotwithstanding his professions of confidence in the General's\npenetration, I saw my father, at this point, glance at the General,\nwith, as I thought, a marked suspicion of his sanity.\n\nThe General did not see it, luckily. He was looking gloomily and\ncuriously into the glades and vistas of the woods that were opening\nbefore us.\n\n\"You are going to the Ruins of Karnstein?\" he said. \"Yes, it is a lucky\ncoincidence; do you know I was going to ask you to bring me there to\ninspect them. I have a special object in exploring. There is a ruined\nchapel, ain't there, with a great many tombs of that extinct family?\"\n\n\"So there are--highly interesting,\" said my father. \"I hope you are\nthinking of claiming the title and estates?\"\n\nMy father said this gaily, but the General did not recollect the laugh,\nor even the smile, which courtesy exacts for a friend's joke; on the\ncontrary, he looked grave and even fierce, ruminating on a matter that\nstirred his anger and horror.\n\n\"Something very different,\" he said, gruffly. \"I mean to unearth some of\nthose fine people. I hope, by God's blessing, to accomplish a pious\nsacrilege here, which will relieve our earth of certain monsters, and\nenable honest people to sleep in their beds without being assailed by\nmurderers. I have strange things to tell you, my dear friend, such as I\nmyself would have scouted as incredible a few months since.\"\n\nMy father looked at him again, but this time not with a glance of\nsuspicion--with an eye, rather, of keen intelligence and alarm.\n\n\"The house of Karnstein,\" he said, \"has been long extinct: a hundred\nyears at least. My dear wife was maternally descended from the\nKarnsteins. But the name and title have long ceased to exist. The castle\nis a ruin; the very village is deserted; it is fifty years since the\nsmoke of a chimney was seen there; not a roof left.\"\n\n\"Quite true. I have heard a great deal about that since I last saw you;\na great deal that will astonish you. But I had better relate everything\nin the order in which it occurred,\" said the General. \"You saw my dear\nward--my child, I may call her. No creature could have been more\nbeautiful, and only three months ago none more blooming.\"\n\n\"Yes, poor thing! when I saw her last she certainly was quite lovely,\"\nsaid my father. \"I was grieved and shocked more than I can tell you, my\ndear friend; I knew what a blow it was to you.\"\n\nHe took the General's hand, and they exchanged a kind pressure. Tears\ngathered in the old soldier's eyes. He did not seek to conceal them.\nHe said:\n\n\"We have been very old friends; I knew you would feel for me, childless\nas I am. She had become an object of very near interest to me, and\nrepaid my care by an affection that cheered my home and made my life\nhappy. That is all gone. The years that remain to me on earth may not be\nvery long; but by God's mercy I hope to accomplish a service to mankind\nbefore I die, and to subserve the vengeance of Heaven upon the fiends\nwho have murdered my poor child in the spring of her hopes and beauty!\"\n\n\"You said, just now, that you intended relating everything as it\noccurred,\" said my father. \"Pray do; I assure you that it is not mere\ncuriosity that prompts me.\"\n\nBy this time we had reached the point at which the Drunstall road, by\nwhich the General had come, diverges from the road which we were\ntraveling to Karnstein.\n\n\"How far is it to the ruins?\" inquired the General, looking anxiously\nforward.\n\n\"About half a league,\" answered my father. \"Pray let us hear the story\nyou were so good as to promise.\"\n\n\n\nXI\n\n_The Story_\n\n\"With all my heart,\" said the General, with an effort; and after a short\npause in which to arrange his subject, he commenced one of the strangest\nnarratives I ever heard.\n\n\"My dear child was looking forward with great pleasure to the visit you\nhad been so good as to arrange for her to your charming daughter.\" Here\nhe made me a gallant but melancholy bow. \"In the meantime we had an\ninvitation to my old friend the Count Carlsfeld, whose schloss is about\nsix leagues to the other side of Karnstein. It was to attend the series\nof fetes which, you remember, were given by him in honor of his\nillustrious visitor, the Grand Duke Charles.\"\n\n\"Yes; and very splendid, I believe, they were,\" said my father.\n\n\"Princely! But then his hospitalities are quite regal. He has Aladdin's\nlamp. The night from which my sorrow dates was devoted to a magnificent\nmasquerade. The grounds were thrown open, the trees hung with colored\nlamps. There was such a display of fireworks as Paris itself had never\nwitnessed. And such music--music, you know, is my weakness--such\nravishing music! The finest instrumental band, perhaps, in the world,\nand the finest singers who could be collected from all the great operas\nin Europe. As you wandered through these fantastically illuminated\ngrounds, the moon-lighted chateau throwing a rosy light from its long\nrows of windows, you would suddenly hear these ravishing voices stealing\nfrom the silence of some grove, or rising from boats upon the lake. I\nfelt myself, as I looked and listened, carried back into the romance and\npoetry of my early youth.\n\n\"When the fireworks were ended, and the ball beginning, we returned to\nthe noble suite of rooms that were thrown open to the dancers. A masked\nball, you know, is a beautiful sight; but so brilliant a spectacle of\nthe kind I never saw before.\n\n\"It was a very aristocratic assembly. I was myself almost the only\n'nobody' present.\n\n\"My dear child was looking quite beautiful. She wore no mask. Her\nexcitement and delight added an unspeakable charm to her features,\nalways lovely. I remarked a young lady, dressed magnificently, but\nwearing a mask, who appeared to me to be observing my ward with\nextraordinary interest. I had seen her, earlier in the evening, in the\ngreat hall, and again, for a few minutes, walking near us, on the\nterrace under the castle windows, similarly employed. A lady, also\nmasked, richly and gravely dressed, and with a stately air, like a\nperson of rank, accompanied her as a chaperon.\n\n\"Had the young lady not worn a mask, I could, of course, have been much\nmore certain upon the question whether she was really watching my\npoor darling.\n\n\"I am now well assured that she was.\n\n\"We were now in one of the salons. My poor dear child had been dancing,\nand was resting a little in one of the chairs near the door; I was\nstanding near. The two ladies I have mentioned had approached and the\nyounger took the chair next my ward; while her companion stood beside\nme, and for a little time addressed herself, in a low tone, to\nher charge.\n\n\"Availing herself of the privilege of her mask, she turned to me, and in\nthe tone of an old friend, and calling me by my name, opened a\nconversation with me, which piqued my curiosity a good deal. She\nreferred to many scenes where she had met me--at Court, and at\ndistinguished houses. She alluded to little incidents which I had long\nceased to think of, but which, I found, had only lain in abeyance in my\nmemory, for they instantly started into life at her touch.\n\n\"I became more and more curious to ascertain who she was, every moment.\nShe parried my attempts to discover very adroitly and pleasantly. The\nknowledge she showed of many passages in my life seemed to me all but\nunaccountable; and she appeared to take a not unnatural pleasure in\nfoiling my curiosity, and in seeing me flounder in my eager perplexity,\nfrom one conjecture to another.\n\n\"In the meantime the young lady, whom her mother called by the odd name\nof Millarca, when she once or twice addressed her, had, with the same\nease and grace, got into conversation with my ward.\n\n\"She introduced herself by saying that her mother was a very old\nacquaintance of mine. She spoke of the agreeable audacity which a mask\nrendered practicable; she talked like a friend; she admired her dress,\nand insinuated very prettily her admiration of her beauty. She amused\nher with laughing criticisms upon the people who crowded the ballroom,\nand laughed at my poor child's fun. She was very witty and lively when\nshe pleased, and after a time they had grown very good friends, and the\nyoung stranger lowered her mask, displaying a remarkably beautiful face.\nI had never seen it before, neither had my dear child. But though it was\nnew to us, the features were so engaging, as well as lovely, that it\nwas impossible not to feel the attraction powerfully. My poor girl did\nso. I never saw anyone more taken with another at first sight, unless,\nindeed, it was the stranger herself, who seemed quite to have lost her\nheart to her.\n\n\"In the meantime, availing myself of the license of a masquerade, I put\nnot a few questions to the elder lady.\n\n\"'You have puzzled me utterly,' I said, laughing. 'Is that not enough?\nWon't you, now, consent to stand on equal terms, and do me the kindness\nto remove your mask?'\n\n\"'Can any request be more unreasonable?' she replied. 'Ask a lady to\nyield an advantage! Beside, how do you know you should recognize me?\nYears make changes.'\n\n\"'As you see,' I said, with a bow, and, I suppose, a rather melancholy\nlittle laugh.\n\n\"'As philosophers tell us,' she said; 'and how do you know that a sight\nof my face would help you?'\n\n\"'I should take chance for that,' I answered. 'It is vain trying to make\nyourself out an old woman; your figure betrays you.'\n\n\"'Years, nevertheless, have passed since I saw you, rather since you saw\nme, for that is what I am considering. Millarca, there, is my daughter;\nI cannot then be young, even in the opinion of people whom time has\ntaught to be indulgent, and I may not like to be compared with what you\nremember me. You have no mask to remove. You can offer me nothing in\nexchange.'\n\n\"'My petition is to your pity, to remove it.'\n\n\"'And mine to yours, to let it stay where it is,' she replied.\n\n\"'Well, then, at least you will tell me whether you are French or\nGerman; you speak both languages so perfectly.'\n\n\"'I don't think I shall tell you that, General; you intend a surprise,\nand are meditating the particular point of attack.'\n\n\"'At all events, you won't deny this,' I said, 'that being honored by\nyour permission to converse, I ought to know how to address you. Shall I\nsay Madame la Comtesse?'\n\n\"She laughed, and she would, no doubt, have met me with another\nevasion--if, indeed, I can treat any occurrence in an interview every\ncircumstance of which was prearranged, as I now believe, with the\nprofoundest cunning, as liable to be modified by accident.\n\n\"'As to that,' she began; but she was interrupted, almost as she opened\nher lips, by a gentleman, dressed in black, who looked particularly\nelegant and distinguished, with this drawback, that his face was the\nmost deadly pale I ever saw, except in death. He was in no\nmasquerade--in the plain evening dress of a gentleman; and he said,\nwithout a smile, but with a courtly and unusually low bow:--\n\n\"'Will Madame la Comtesse permit me to say a very few words which may\ninterest her?'\n\n\"The lady turned quickly to him, and touched her lip in token of\nsilence; she then said to me, 'Keep my place for me, General; I shall\nreturn when I have said a few words.'\n\n\"And with this injunction, playfully given, she walked a little aside\nwith the gentleman in black, and talked for some minutes, apparently\nvery earnestly. They then walked away slowly together in the crowd, and\nI lost them for some minutes.\n\n\"I spent the interval in cudgeling my brains for a conjecture as to the\nidentity of the lady who seemed to remember me so kindly, and I was\nthinking of turning about and joining in the conversation between my\npretty ward and the Countess's daughter, and trying whether, by the time\nshe returned, I might not have a surprise in store for her, by having\nher name, title, chateau, and estates at my fingers' ends. But at this\nmoment she returned, accompanied by the pale man in black, who said:\n\n\"'I shall return and inform Madame la Comtesse when her carriage is at\nthe door.'\n\n\"He withdrew with a bow.\"\n\n\n\nXII\n\n_A Petition_\n\n\"'Then we are to lose Madame la Comtesse, but I hope only for a few\nhours,' I said, with a low bow.\n\n\"'It may be that only, or it may be a few weeks. It was very unlucky his\nspeaking to me just now as he did. Do you now know me?'\n\n\"I assured her I did not.\n\n\"'You shall know me,' she said, 'but not at present. We are older and\nbetter friends than, perhaps, you suspect. I cannot yet declare myself.\nI shall in three weeks pass your beautiful schloss, about which I have\nbeen making enquiries. I shall then look in upon you for an hour or two,\nand renew a friendship which I never think of without a thousand\npleasant recollections. This moment a piece of news has reached me like\na thunderbolt. I must set out now, and travel by a devious route, nearly\na hundred miles, with all the dispatch I can possibly make. My\nperplexities multiply. I am only deterred by the compulsory reserve I\npractice as to my name from making a very singular request of you. My\npoor child has not quite recovered her strength. Her horse fell with\nher, at a hunt which she had ridden out to witness, her nerves have not\nyet recovered the shock, and our physician says that she must on no\naccount exert herself for some time to come. We came here, in\nconsequence, by very easy stages--hardly six leagues a day. I must now\ntravel day and night, on a mission of life and death--a mission the\ncritical and momentous nature of which I shall be able to explain to you\nwhen we meet, as I hope we shall, in a few weeks, without the necessity\nof any concealment.'\n\n\"She went on to make her petition, and it was in the tone of a person\nfrom whom such a request amounted to conferring, rather than seeking\na favor.\n\n\"This was only in manner, and, as it seemed, quite unconsciously. Than\nthe terms in which it was expressed, nothing could be more deprecatory.\nIt was simply that I would consent to take charge of her daughter during\nher absence.\n\n\"This was, all things considered, a strange, not to say, an audacious\nrequest. She in some sort disarmed me, by stating and admitting\neverything that could be urged against it, and throwing herself entirely\nupon my chivalry. At the same moment, by a fatality that seems to have\npredetermined all that happened, my poor child came to my side, and, in\nan undertone, besought me to invite her new friend, Millarca, to pay us\na visit. She had just been sounding her, and thought, if her mamma would\nallow her, she would like it extremely.\n\n\"At another time I should have told her to wait a little, until, at\nleast, we knew who they were. But I had not a moment to think in. The\ntwo ladies assailed me together, and I must confess the refined and\nbeautiful face of the young lady, about which there was something\nextremely engaging, as well as the elegance and fire of high birth,\ndetermined me; and, quite overpowered, I submitted, and undertook, too\neasily, the care of the young lady, whom her mother called Millarca.\n\n\"The Countess beckoned to her daughter, who listened with grave\nattention while she told her, in general terms, how suddenly and\nperemptorily she had been summoned, and also of the arrangement she had\nmade for her under my care, adding that I was one of her earliest and\nmost valued friends.\n\n\"I made, of course, such speeches as the case seemed to call for, and\nfound myself, on reflection, in a position which I did not half like.\n\n\"The gentleman in black returned, and very ceremoniously conducted the\nlady from the room.\n\n\"The demeanor of this gentleman was such as to impress me with the\nconviction that the Countess was a lady of very much more importance\nthan her modest title alone might have led me to assume.\n\n\"Her last charge to me was that no attempt was to be made to learn more\nabout her than I might have already guessed, until her return. Our\ndistinguished host, whose guest she was, knew her reasons.\n\n\"'But here,' she said, 'neither I nor my daughter could safely remain\nfor more than a day. I removed my mask imprudently for a moment, about\nan hour ago, and, too late, I fancied you saw me. So I resolved to seek\nan opportunity of talking a little to you. Had I found that you had seen\nme, I would have thrown myself on your high sense of honor to keep my\nsecret some weeks. As it is, I am satisfied that you did not see me; but\nif you now suspect, or, on reflection, should suspect, who I am, I\ncommit myself, in like manner, entirely to your honor. My daughter will\nobserve the same secrecy, and I well know that you will, from time to\ntime, remind her, lest she should thoughtlessly disclose it.'\n\n\"She whispered a few words to her daughter, kissed her hurriedly twice,\nand went away, accompanied by the pale gentleman in black, and\ndisappeared in the crowd.\n\n\"'In the next room,' said Millarca, 'there is a window that looks upon\nthe hall door. I should like to see the last of mamma, and to kiss my\nhand to her.'\n\n\"We assented, of course, and accompanied her to the window. We looked\nout, and saw a handsome old-fashioned carriage, with a troop of couriers\nand footmen. We saw the slim figure of the pale gentleman in black, as\nhe held a thick velvet cloak, and placed it about her shoulders and\nthrew the hood over her head. She nodded to him, and just touched his\nhand with hers. He bowed low repeatedly as the door closed, and the\ncarriage began to move.\n\n\"'She is gone,' said Millarca, with a sigh.\n\n\"'She is gone,' I repeated to myself, for the first time--in the hurried\nmoments that had elapsed since my consent--reflecting upon the folly\nof my act.\n\n\"'She did not look up,' said the young lady, plaintively.\n\n\"'The Countess had taken off her mask, perhaps, and did not care to show\nher face,' I said; 'and she could not know that you were in the window.'\n\n\"She sighed, and looked in my face. She was so beautiful that I\nrelented. I was sorry I had for a moment repented of my hospitality, and\nI determined to make her amends for the unavowed churlishness of my\nreception.\n\n\"The young lady, replacing her mask, joined my ward in persuading me to\nreturn to the grounds, where the concert was soon to be renewed. We did\nso, and walked up and down the terrace that lies under the\ncastle windows.\n\n\"Millarca became very intimate with us, and amused us with lively\ndescriptions and stories of most of the great people whom we saw upon\nthe terrace. I liked her more and more every minute. Her gossip without\nbeing ill-natured, was extremely diverting to me, who had been so long\nout of the great world. I thought what life she would give to our\nsometimes lonely evenings at home.\n\n\"This ball was not over until the morning sun had almost reached the\nhorizon. It pleased the Grand Duke to dance till then, so loyal people\ncould not go away, or think of bed.\n\n\"We had just got through a crowded saloon, when my ward asked me what\nhad become of Millarca. I thought she had been by her side, and she\nfancied she was by mine. The fact was, we had lost her.\n\n\"All my efforts to find her were vain. I feared that she had mistaken,\nin the confusion of a momentary separation from us, other people for her\nnew friends, and had, possibly, pursued and lost them in the extensive\ngrounds which were thrown open to us.\n\n\"Now, in its full force, I recognized a new folly in my having\nundertaken the charge of a young lady without so much as knowing her\nname; and fettered as I was by promises, of the reasons for imposing\nwhich I knew nothing, I could not even point my inquiries by saying that\nthe missing young lady was the daughter of the Countess who had taken\nher departure a few hours before.\n\n\"Morning broke. It was clear daylight before I gave up my search. It was\nnot till near two o'clock next day that we heard anything of my\nmissing charge.\n\n\"At about that time a servant knocked at my niece's door, to say that he\nhad been earnestly requested by a young lady, who appeared to be in\ngreat distress, to make out where she could find the General Baron\nSpielsdorf and the young lady his daughter, in whose charge she had been\nleft by her mother.\n\n\"There could be no doubt, notwithstanding the slight inaccuracy, that\nour young friend had turned up; and so she had. Would to heaven we\nhad lost her!\n\n\"She told my poor child a story to account for her having failed to\nrecover us for so long. Very late, she said, she had got to the\nhousekeeper's bedroom in despair of finding us, and had then fallen\ninto a deep sleep which, long as it was, had hardly sufficed to recruit\nher strength after the fatigues of the ball.\n\n\"That day Millarca came home with us. I was only too happy, after all,\nto have secured so charming a companion for my dear girl.\"\n\n\n\nXIII\n\n_The Woodman_\n\n\"There soon, however, appeared some drawbacks. In the first place,\nMillarca complained of extreme languor--the weakness that remained after\nher late illness--and she never emerged from her room till the afternoon\nwas pretty far advanced. In the next place, it was accidentally\ndiscovered, although she always locked her door on the inside, and never\ndisturbed the key from its place till she admitted the maid to assist at\nher toilet, that she was undoubtedly sometimes absent from her room in\nthe very early morning, and at various times later in the day, before\nshe wished it to be understood that she was stirring. She was repeatedly\nseen from the windows of the schloss, in the first faint grey of the\nmorning, walking through the trees, in an easterly direction, and\nlooking like a person in a trance. This convinced me that she walked in\nher sleep. But this hypothesis did not solve the puzzle. How did she\npass out from her room, leaving the door locked on the inside? How did\nshe escape from the house without unbarring door or window?\n\n\"In the midst of my perplexities, an anxiety of a far more urgent kind\npresented itself.\n\n\"My dear child began to lose her looks and health, and that in a manner\nso mysterious, and even horrible, that I became thoroughly frightened.\n\n\"She was at first visited by appalling dreams; then, as she fancied, by\na specter, sometimes resembling Millarca, sometimes in the shape of a\nbeast, indistinctly seen, walking round the foot of her bed, from\nside to side.\n\n\"Lastly came sensations. One, not unpleasant, but very peculiar, she\nsaid, resembled the flow of an icy stream against her breast. At a later\ntime, she felt something like a pair of large needles pierce her, a\nlittle below the throat, with a very sharp pain. A few nights after,\nfollowed a gradual and convulsive sense of strangulation; then came\nunconsciousness.\"\n\nI could hear distinctly every word the kind old General was saying,\nbecause by this time we were driving upon the short grass that spreads\non either side of the road as you approach the roofless village which\nhad not shown the smoke of a chimney for more than half a century.\n\nYou may guess how strangely I felt as I heard my own symptoms so exactly\ndescribed in those which had been experienced by the poor girl who, but\nfor the catastrophe which followed, would have been at that moment a\nvisitor at my father's chateau. You may suppose, also, how I felt as I\nheard him detail habits and mysterious peculiarities which were, in\nfact, those of our beautiful guest, Carmilla!\n\nA vista opened in the forest; we were on a sudden under the chimneys and\ngables of the ruined village, and the towers and battlements of the\ndismantled castle, round which gigantic trees are grouped, overhung us\nfrom a slight eminence.\n\nIn a frightened dream I got down from the carriage, and in silence, for\nwe had each abundant matter for thinking; we soon mounted the ascent,\nand were among the spacious chambers, winding stairs, and dark\ncorridors of the castle.\n\n\"And this was once the palatial residence of the Karnsteins!\" said the\nold General at length, as from a great window he looked out across the\nvillage, and saw the wide, undulating expanse of forest. \"It was a bad\nfamily, and here its bloodstained annals were written,\" he continued.\n\"It is hard that they should, after death, continue to plague the human\nrace with their atrocious lusts. That is the chapel of the Karnsteins,\ndown there.\"\n\nHe pointed down to the grey walls of the Gothic building partly visible\nthrough the foliage, a little way down the steep. \"And I hear the axe of\na woodman,\" he added, \"busy among the trees that surround it; he\npossibly may give us the information of which I am in search, and point\nout the grave of Mircalla, Countess of Karnstein. These rustics preserve\nthe local traditions of great families, whose stories die out among the\nrich and titled so soon as the families themselves become extinct.\"\n\n\"We have a portrait, at home, of Mircalla, the Countess Karnstein;\nshould you like to see it?\" asked my father.\n\n\"Time enough, dear friend,\" replied the General. \"I believe that I have\nseen the original; and one motive which has led me to you earlier than I\nat first intended, was to explore the chapel which we are now\napproaching.\"\n\n\"What! see the Countess Mircalla,\" exclaimed my father; \"why, she has\nbeen dead more than a century!\"\n\n\"Not so dead as you fancy, I am told,\" answered the General.\n\n\"I confess, General, you puzzle me utterly,\" replied my father, looking\nat him, I fancied, for a moment with a return of the suspicion I\ndetected before. But although there was anger and detestation, at times,\nin the old General's manner, there was nothing flighty.\n\n\"There remains to me,\" he said, as we passed under the heavy arch of\nthe Gothic church--for its dimensions would have justified its being so\nstyled--\"but one object which can interest me during the few years that\nremain to me on earth, and that is to wreak on her the vengeance which,\nI thank God, may still be accomplished by a mortal arm.\"\n\n\"What vengeance can you mean?\" asked my father, in increasing amazement.\n\n\"I mean, to decapitate the monster,\" he answered, with a fierce flush,\nand a stamp that echoed mournfully through the hollow ruin, and his\nclenched hand was at the same moment raised, as if it grasped the handle\nof an axe, while he shook it ferociously in the air.\n\n\"What?\" exclaimed my father, more than ever bewildered.\n\n\"To strike her head off.\"\n\n\"Cut her head off!\"\n\n\"Aye, with a hatchet, with a spade, or with anything that can cleave\nthrough her murderous throat. You shall hear,\" he answered, trembling\nwith rage. And hurrying forward he said:\n\n\"That beam will answer for a seat; your dear child is fatigued; let her\nbe seated, and I will, in a few sentences, close my dreadful story.\"\n\nThe squared block of wood, which lay on the grass-grown pavement of the\nchapel, formed a bench on which I was very glad to seat myself, and in\nthe meantime the General called to the woodman, who had been removing\nsome boughs which leaned upon the old walls; and, axe in hand, the hardy\nold fellow stood before us.\n\nHe could not tell us anything of these monuments; but there was an old\nman, he said, a ranger of this forest, at present sojourning in the\nhouse of the priest, about two miles away, who could point out every\nmonument of the old Karnstein family; and, for a trifle, he undertook\nto bring him back with him, if we would lend him one of our horses, in\nlittle more than half an hour.\n\n\"Have you been long employed about this forest?\" asked my father of the\nold man.\n\n\"I have been a woodman here,\" he answered in his patois, \"under the\nforester, all my days; so has my father before me, and so on, as many\ngenerations as I can count up. I could show you the very house in the\nvillage here, in which my ancestors lived.\"\n\n\"How came the village to be deserted?\" asked the General.\n\n\"It was troubled by revenants, sir; several were tracked to their\ngraves, there detected by the usual tests, and extinguished in the usual\nway, by decapitation, by the stake, and by burning; but not until many\nof the villagers were killed.\n\n\"But after all these proceedings according to law,\" he continued--\"so\nmany graves opened, and so many vampires deprived of their horrible\nanimation--the village was not relieved. But a Moravian nobleman, who\nhappened to be traveling this way, heard how matters were, and being\nskilled--as many people are in his country--in such affairs, he offered\nto deliver the village from its tormentor. He did so thus: There being a\nbright moon that night, he ascended, shortly after sunset, the towers of\nthe chapel here, from whence he could distinctly see the churchyard\nbeneath him; you can see it from that window. From this point he watched\nuntil he saw the vampire come out of his grave, and place near it the\nlinen clothes in which he had been folded, and then glide away towards\nthe village to plague its inhabitants.\n\n\"The stranger, having seen all this, came down from the steeple, took\nthe linen wrappings of the vampire, and carried them up to the top of\nthe tower, which he again mounted. When the vampire returned from his\nprowlings and missed his clothes, he cried furiously to the Moravian,\nwhom he saw at the summit of the tower, and who, in reply, beckoned him\nto ascend and take them. Whereupon the vampire, accepting his\ninvitation, began to climb the steeple, and so soon as he had reached\nthe battlements, the Moravian, with a stroke of his sword, clove his\nskull in twain, hurling him down to the churchyard, whither, descending\nby the winding stairs, the stranger followed and cut his head off, and\nnext day delivered it and the body to the villagers, who duly impaled\nand burnt them.\n\n\"This Moravian nobleman had authority from the then head of the family\nto remove the tomb of Mircalla, Countess Karnstein, which he did\neffectually, so that in a little while its site was quite forgotten.\"\n\n\"Can you point out where it stood?\" asked the General, eagerly.\n\nThe forester shook his head, and smiled.\n\n\"Not a soul living could tell you that now,\" he said; \"besides, they say\nher body was removed; but no one is sure of that either.\"\n\nHaving thus spoken, as time pressed, he dropped his axe and departed,\nleaving us to hear the remainder of the General's strange story.\n\n\n\nXIV\n\n_The Meeting_\n\n\"My beloved child,\" he resumed, \"was now growing rapidly worse. The\nphysician who attended her had failed to produce the slightest\nimpression on her disease, for such I then supposed it to be. He saw my\nalarm, and suggested a consultation. I called in an abler physician,\nfrom Gratz.\n\n\"Several days elapsed before he arrived. He was a good and pious, as well\nas a learned man. Having seen my poor ward together, they withdrew to my\nlibrary to confer and discuss. I, from the adjoining room, where I\nawaited their summons, heard these two gentlemen's voices raised in\nsomething sharper than a strictly philosophical discussion. I knocked at\nthe door and entered. I found the old physician from Gratz maintaining\nhis theory. His rival was combating it with undisguised ridicule,\naccompanied with bursts of laughter. This unseemly manifestation\nsubsided and the altercation ended on my entrance.\n\n\"'Sir,' said my first physician, 'my learned brother seems to think that\nyou want a conjuror, and not a doctor.'\n\n\"'Pardon me,' said the old physician from Gratz, looking displeased, 'I\nshall state my own view of the case in my own way another time. I\ngrieve, Monsieur le General, that by my skill and science I can be of no\nuse. Before I go I shall do myself the honor to suggest something to\nyou.'\n\n\"He seemed thoughtful, and sat down at a table and began to write.\n\n\"Profoundly disappointed, I made my bow, and as I turned to go, the other\ndoctor pointed over his shoulder to his companion who was writing, and\nthen, with a shrug, significantly touched his forehead.\n\n\"This consultation, then, left me precisely where I was. I walked out\ninto the grounds, all but distracted. The doctor from Gratz, in ten or\nfifteen minutes, overtook me. He apologized for having followed me, but\nsaid that he could not conscientiously take his leave without a few\nwords more. He told me that he could not be mistaken; no natural disease\nexhibited the same symptoms; and that death was already very near. There\nremained, however, a day, or possibly two, of life. If the fatal seizure\nwere at once arrested, with great care and skill her strength might\npossibly return. But all hung now upon the confines of the irrevocable.\nOne more assault might extinguish the last spark of vitality which is,\nevery moment, ready to die.\n\n\"'And what is the nature of the seizure you speak of?' I entreated.\n\n\"'I have stated all fully in this note, which I place in your hands upon\nthe distinct condition that you send for the nearest clergyman, and open\nmy letter in his presence, and on no account read it till he is with\nyou; you would despise it else, and it is a matter of life and death.\nShould the priest fail you, then, indeed, you may read it.'\n\n\"He asked me, before taking his leave finally, whether I would wish to\nsee a man curiously learned upon the very subject, which, after I had\nread his letter, would probably interest me above all others, and he\nurged me earnestly to invite him to visit him there; and so took\nhis leave.\n\n\"The ecclesiastic was absent, and I read the letter by myself. At\nanother time, or in another case, it might have excited my ridicule. But\ninto what quackeries will not people rush for a last chance, where all\naccustomed means have failed, and the life of a beloved object is\nat stake?\n\n\"Nothing, you will say, could be more absurd than the learned man's\nletter.\n\n\"It was monstrous enough to have consigned him to a madhouse. He said\nthat the patient was suffering from the visits of a vampire! The\npunctures which she described as having occurred near the throat, were,\nhe insisted, the insertion of those two long, thin, and sharp teeth\nwhich, it is well known, are peculiar to vampires; and there could be no\ndoubt, he added, as to the well-defined presence of the small livid mark\nwhich all concurred in describing as that induced by the demon's lips,\nand every symptom described by the sufferer was in exact conformity with\nthose recorded in every case of a similar visitation.\n\n\"Being myself wholly skeptical as to the existence of any such portent\nas the vampire, the supernatural theory of the good doctor furnished, in\nmy opinion, but another instance of learning and intelligence oddly\nassociated with some one hallucination. I was so miserable, however,\nthat, rather than try nothing, I acted upon the instructions of\nthe letter.\n\n\"I concealed myself in the dark dressing room, that opened upon the poor\npatient's room, in which a candle was burning, and watched there till\nshe was fast asleep. I stood at the door, peeping through the small\ncrevice, my sword laid on the table beside me, as my directions\nprescribed, until, a little after one, I saw a large black object, very\nill-defined, crawl, as it seemed to me, over the foot of the bed, and\nswiftly spread itself up to the poor girl's throat, where it swelled, in\na moment, into a great, palpitating mass.\n\n\"For a few moments I had stood petrified. I now sprang forward, with my\nsword in my hand. The black creature suddenly contracted towards the\nfoot of the bed, glided over it, and, standing on the floor about a yard\nbelow the foot of the bed, with a glare of skulking ferocity and horror\nfixed on me, I saw Millarca. Speculating I know not what, I struck at\nher instantly with my sword; but I saw her standing near the door,\nunscathed. Horrified, I pursued, and struck again. She was gone; and my\nsword flew to shivers against the door.\n\n\"I can't describe to you all that passed on that horrible night. The\nwhole house was up and stirring. The specter Millarca was gone. But her\nvictim was sinking fast, and before the morning dawned, she died.\"\n\nThe old General was agitated. We did not speak to him. My father walked\nto some little distance, and began reading the inscriptions on the\ntombstones; and thus occupied, he strolled into the door of a side\nchapel to prosecute his researches. The General leaned against the wall,\ndried his eyes, and sighed heavily. I was relieved on hearing the voices\nof Carmilla and Madame, who were at that moment approaching. The voices\ndied away.\n\nIn this solitude, having just listened to so strange a story, connected,\nas it was, with the great and titled dead, whose monuments were\nmoldering among the dust and ivy round us, and every incident of which\nbore so awfully upon my own mysterious case--in this haunted spot,\ndarkened by the towering foliage that rose on every side, dense and high\nabove its noiseless walls--a horror began to steal over me, and my heart\nsank as I thought that my friends were, after all, not about to enter\nand disturb this triste and ominous scene.\n\nThe old General's eyes were fixed on the ground, as he leaned with his\nhand upon the basement of a shattered monument.\n\nUnder a narrow, arched doorway, surmounted by one of those demoniacal\ngrotesques in which the cynical and ghastly fancy of old Gothic carving\ndelights, I saw very gladly the beautiful face and figure of Carmilla\nenter the shadowy chapel.\n\nI was just about to rise and speak, and nodded smiling, in answer to her\npeculiarly engaging smile; when with a cry, the old man by my side\ncaught up the woodman's hatchet, and started forward. On seeing him a\nbrutalized change came over her features. It was an instantaneous and\nhorrible transformation, as she made a crouching step backwards. Before\nI could utter a scream, he struck at her with all his force, but she\ndived under his blow, and unscathed, caught him in her tiny grasp by the\nwrist. He struggled for a moment to release his arm, but his hand\nopened, the axe fell to the ground, and the girl was gone.\n\nHe staggered against the wall. His grey hair stood upon his head, and a\nmoisture shone over his face, as if he were at the point of death.\n\nThe frightful scene had passed in a moment. The first thing I recollect\nafter, is Madame standing before me, and impatiently repeating again and\nagain, the question, \"Where is Mademoiselle Carmilla?\"\n\nI answered at length, \"I don't know--I can't tell--she went there,\" and\nI pointed to the door through which Madame had just entered; \"only a\nminute or two since.\"\n\n\"But I have been standing there, in the passage, ever since Mademoiselle\nCarmilla entered; and she did not return.\"\n\nShe then began to call \"Carmilla,\" through every door and passage and\nfrom the windows, but no answer came.\n\n\"She called herself Carmilla?\" asked the General, still agitated.\n\n\"Carmilla, yes,\" I answered.\n\n\"Aye,\" he said; \"that is Millarca. That is the same person who long ago\nwas called Mircalla, Countess Karnstein. Depart from this accursed\nground, my poor child, as quickly as you can. Drive to the clergyman's\nhouse, and stay there till we come. Begone! May you never behold\nCarmilla more; you will not find her here.\"\n\n\n\nXV\n\n_Ordeal and Execution_\n\nAs he spoke one of the strangest looking men I ever beheld entered the\nchapel at the door through which Carmilla had made her entrance and her\nexit. He was tall, narrow-chested, stooping, with high shoulders, and\ndressed in black. His face was brown and dried in with deep furrows; he\nwore an oddly-shaped hat with a broad leaf. His hair, long and grizzled,\nhung on his shoulders. He wore a pair of gold spectacles, and walked\nslowly, with an odd shambling gait, with his face sometimes turned up to\nthe sky, and sometimes bowed down towards the ground, seemed to wear a\nperpetual smile; his long thin arms were swinging, and his lank hands,\nin old black gloves ever so much too wide for them, waving and\ngesticulating in utter abstraction.\n\n\"The very man!\" exclaimed the General, advancing with manifest delight.\n\"My dear Baron, how happy I am to see you, I had no hope of meeting you\nso soon.\" He signed to my father, who had by this time returned, and\nleading the fantastic old gentleman, whom he called the Baron to meet\nhim. He introduced him formally, and they at once entered into earnest\nconversation. The stranger took a roll of paper from his pocket, and\nspread it on the worn surface of a tomb that stood by. He had a pencil\ncase in his fingers, with which he traced imaginary lines from point to\npoint on the paper, which from their often glancing from it, together,\nat certain points of the building, I concluded to be a plan of the\nchapel. He accompanied, what I may term, his lecture, with occasional\nreadings from a dirty little book, whose yellow leaves were closely\nwritten over.\n\nThey sauntered together down the side aisle, opposite to the spot where\nI was standing, conversing as they went; then they began measuring\ndistances by paces, and finally they all stood together, facing a piece\nof the sidewall, which they began to examine with great minuteness;\npulling off the ivy that clung over it, and rapping the plaster with the\nends of their sticks, scraping here, and knocking there. At length they\nascertained the existence of a broad marble tablet, with letters carved\nin relief upon it.\n\nWith the assistance of the woodman, who soon returned, a monumental\ninscription, and carved escutcheon, were disclosed. They proved to be\nthose of the long lost monument of Mircalla, Countess Karnstein.\n\nThe old General, though not I fear given to the praying mood, raised his\nhands and eyes to heaven, in mute thanksgiving for some moments.\n\n\"Tomorrow,\" I heard him say; \"the commissioner will be here, and the\nInquisition will be held according to law.\"\n\nThen turning to the old man with the gold spectacles, whom I have\ndescribed, he shook him warmly by both hands and said:\n\n\"Baron, how can I thank you? How can we all thank you? You will have\ndelivered this region from a plague that has scourged its inhabitants\nfor more than a century. The horrible enemy, thank God, is at\nlast tracked.\"\n\nMy father led the stranger aside, and the General followed. I know that\nhe had led them out of hearing, that he might relate my case, and I saw\nthem glance often quickly at me, as the discussion proceeded.\n\nMy father came to me, kissed me again and again, and leading me from the\nchapel, said:\n\n\"It is time to return, but before we go home, we must add to our party\nthe good priest, who lives but a little way from this; and persuade him\nto accompany us to the schloss.\"\n\nIn this quest we were successful: and I was glad, being unspeakably\nfatigued when we reached home. But my satisfaction was changed to\ndismay, on discovering that there were no tidings of Carmilla. Of the\nscene that had occurred in the ruined chapel, no explanation was offered\nto me, and it was clear that it was a secret which my father for the\npresent determined to keep from me.\n\nThe sinister absence of Carmilla made the remembrance of the scene more\nhorrible to me. The arrangements for the night were singular. Two\nservants, and Madame were to sit up in my room that night; and the\necclesiastic with my father kept watch in the adjoining dressing room.\n\nThe priest had performed certain solemn rites that night, the purport of\nwhich I did not understand any more than I comprehended the reason of\nthis extraordinary precaution taken for my safety during sleep.\n\nI saw all clearly a few days later.\n\nThe disappearance of Carmilla was followed by the discontinuance of my\nnightly sufferings.\n\nYou have heard, no doubt, of the appalling superstition that prevails in\nUpper and Lower Styria, in Moravia, Silesia, in Turkish Serbia, in\nPoland, even in Russia; the superstition, so we must call it, of\nthe Vampire.\n\nIf human testimony, taken with every care and solemnity, judicially,\nbefore commissions innumerable, each consisting of many members, all\nchosen for integrity and intelligence, and constituting reports more\nvoluminous perhaps than exist upon any one other class of cases, is\nworth anything, it is difficult to deny, or even to doubt the existence\nof such a phenomenon as the Vampire.\n\nFor my part I have heard no theory by which to explain what I myself\nhave witnessed and experienced, other than that supplied by the ancient\nand well-attested belief of the country.\n\nThe next day the formal proceedings took place in the Chapel of\nKarnstein.\n\nThe grave of the Countess Mircalla was opened; and the General and my\nfather recognized each his perfidious and beautiful guest, in the face\nnow disclosed to view. The features, though a hundred and fifty years\nhad passed since her funeral, were tinted with the warmth of life. Her\neyes were open; no cadaverous smell exhaled from the coffin. The two\nmedical men, one officially present, the other on the part of the\npromoter of the inquiry, attested the marvelous fact that there was a\nfaint but appreciable respiration, and a corresponding action of the\nheart. The limbs were perfectly flexible, the flesh elastic; and the\nleaden coffin floated with blood, in which to a depth of seven inches,\nthe body lay immersed.\n\nHere then, were all the admitted signs and proofs of vampirism. The\nbody, therefore, in accordance with the ancient practice, was raised,\nand a sharp stake driven through the heart of the vampire, who uttered a\npiercing shriek at the moment, in all respects such as might escape from\na living person in the last agony. Then the head was struck off, and a\ntorrent of blood flowed from the severed neck. The body and head was\nnext placed on a pile of wood, and reduced to ashes, which were thrown\nupon the river and borne away, and that territory has never since been\nplagued by the visits of a vampire.\n\nMy father has a copy of the report of the Imperial Commission, with the\nsignatures of all who were present at these proceedings, attached in\nverification of the statement. It is from this official paper that I\nhave summarized my account of this last shocking scene.\n\n\n\nXVI\n\n_Conclusion_\n\nI write all this you suppose with composure. But far from it; I cannot\nthink of it without agitation. Nothing but your earnest desire so\nrepeatedly expressed, could have induced me to sit down to a task that\nhas unstrung my nerves for months to come, and reinduced a shadow of the\nunspeakable horror which years after my deliverance continued to make my\ndays and nights dreadful, and solitude insupportably terrific.\n\nLet me add a word or two about that quaint Baron Vordenburg, to whose\ncurious lore we were indebted for the discovery of the Countess\nMircalla's grave.\n\nHe had taken up his abode in Gratz, where, living upon a mere pittance,\nwhich was all that remained to him of the once princely estates of his\nfamily, in Upper Styria, he devoted himself to the minute and laborious\ninvestigation of the marvelously authenticated tradition of Vampirism.\nHe had at his fingers' ends all the great and little works upon\nthe subject.\n\n\"Magia Posthuma,\" \"Phlegon de Mirabilibus,\" \"Augustinus de cura pro\nMortuis,\" \"Philosophicae et Christianae Cogitationes de Vampiris,\" by\nJohn Christofer Herenberg; and a thousand others, among which I\nremember only a few of those which he lent to my father. He had a\nvoluminous digest of all the judicial cases, from which he had extracted\na system of principles that appear to govern--some always, and others\noccasionally only--the condition of the vampire. I may mention, in\npassing, that the deadly pallor attributed to that sort of revenants, is\na mere melodramatic fiction. They present, in the grave, and when they\nshow themselves in human society, the appearance of healthy life. When\ndisclosed to light in their coffins, they exhibit all the symptoms that\nare enumerated as those which proved the vampire-life of the long-dead\nCountess Karnstein.\n\nHow they escape from their graves and return to them for certain hours\nevery day, without displacing the clay or leaving any trace of\ndisturbance in the state of the coffin or the cerements, has always been\nadmitted to be utterly inexplicable. The amphibious existence of the\nvampire is sustained by daily renewed slumber in the grave. Its horrible\nlust for living blood supplies the vigor of its waking existence. The\nvampire is prone to be fascinated with an engrossing vehemence,\nresembling the passion of love, by particular persons. In pursuit of\nthese it will exercise inexhaustible patience and stratagem, for access\nto a particular object may be obstructed in a hundred ways. It will\nnever desist until it has satiated its passion, and drained the very\nlife of its coveted victim. But it will, in these cases, husband and\nprotract its murderous enjoyment with the refinement of an epicure, and\nheighten it by the gradual approaches of an artful courtship. In these\ncases it seems to yearn for something like sympathy and consent. In\nordinary ones it goes direct to its object, overpowers with violence,\nand strangles and exhausts often at a single feast.\n\nThe vampire is, apparently, subject, in certain situations, to special\nconditions. In the particular instance of which I have given you a\nrelation, Mircalla seemed to be limited to a name which, if not her real\none, should at least reproduce, without the omission or addition of a\nsingle letter, those, as we say, anagrammatically, which compose it.\n\nCarmilla did this; so did Millarca.\n\nMy father related to the Baron Vordenburg, who remained with us for two\nor three weeks after the expulsion of Carmilla, the story about the\nMoravian nobleman and the vampire at Karnstein churchyard, and then he\nasked the Baron how he had discovered the exact position of the\nlong-concealed tomb of the Countess Mircalla? The Baron's grotesque\nfeatures puckered up into a mysterious smile; he looked down, still\nsmiling on his worn spectacle case and fumbled with it. Then looking\nup, he said:\n\n\"I have many journals, and other papers, written by that remarkable man;\nthe most curious among them is one treating of the visit of which you\nspeak, to Karnstein. The tradition, of course, discolors and distorts a\nlittle. He might have been termed a Moravian nobleman, for he had\nchanged his abode to that territory, and was, beside, a noble. But he\nwas, in truth, a native of Upper Styria. It is enough to say that in\nvery early youth he had been a passionate and favored lover of the\nbeautiful Mircalla, Countess Karnstein. Her early death plunged him into\ninconsolable grief. It is the nature of vampires to increase and\nmultiply, but according to an ascertained and ghostly law.\n\n\"Assume, at starting, a territory perfectly free from that pest. How\ndoes it begin, and how does it multiply itself? I will tell you. A\nperson, more or less wicked, puts an end to himself. A suicide, under\ncertain circumstances, becomes a vampire. That specter visits living\npeople in their slumbers; they die, and almost invariably, in the grave,\ndevelop into vampires. This happened in the case of the beautiful\nMircalla, who was haunted by one of those demons. My ancestor,\nVordenburg, whose title I still bear, soon discovered this, and in the\ncourse of the studies to which he devoted himself, learned a great\ndeal more.\n\n\"Among other things, he concluded that suspicion of vampirism would\nprobably fall, sooner or later, upon the dead Countess, who in life had\nbeen his idol. He conceived a horror, be she what she might, of her\nremains being profaned by the outrage of a posthumous execution. He has\nleft a curious paper to prove that the vampire, on its expulsion from\nits amphibious existence, is projected into a far more horrible life;\nand he resolved to save his once beloved Mircalla from this.\n\n\"He adopted the stratagem of a journey here, a pretended removal of her\nremains, and a real obliteration of her monument. When age had stolen\nupon him, and from the vale of years, he looked back on the scenes he\nwas leaving, he considered, in a different spirit, what he had done, and\na horror took possession of him. He made the tracings and notes which\nhave guided me to the very spot, and drew up a confession of the\ndeception that he had practiced. If he had intended any further action\nin this matter, death prevented him; and the hand of a remote descendant\nhas, too late for many, directed the pursuit to the lair of the beast.\"\n\nWe talked a little more, and among other things he said was this:\n\n\"One sign of the vampire is the power of the hand. The slender hand of\nMircalla closed like a vice of steel on the General's wrist when he\nraised the hatchet to strike. But its power is not confined to its\ngrasp; it leaves a numbness in the limb it seizes, which is slowly, if\never, recovered from.\"\n\nThe following Spring my father took me a tour through Italy. We remained\naway for more than a year. It was long before the terror of recent\nevents subsided; and to this hour the image of Carmilla returns to\nmemory with ambiguous alternations--sometimes the playful, languid,\nbeautiful girl; sometimes the writhing fiend I saw in the ruined church;\nand often from a reverie I have started, fancying I heard the light step\nof Carmilla at the drawing room door.\n\n       *       *       *       *       *\n\nOther books by J. Sheridan LeFanu\n\nThe Cock and Anchor\nTorlogh O'Brien\nThe House by the Churchyard\nUncle Silas\nCheckmate\nCarmilla\nThe Wyvern Mystery\nGuy Deverell\nGhost Stories and Tales of Mystery\nThe Chronicles of Golden Friars\nIn a Glass Darkly\nThe Purcell Papers\nThe Watcher and Other Weird Stories\nA Chronicle of Golden Friars and Other Stories\nMadam Growl's Ghost and Other Tales of Mystery\nGreen Tea and Other Stories\nSheridan LeFanu: The Diabolic Genius\nBest Ghost Stories of J.S. LeFanu\nThe Best Horror Stories\nThe Vampire Lovers and Other Stories\nGhost Stories and Mysteries\nThe Hours After Midnight\nJ.S. LeFanu: Ghost Stories and Mysteries\nGhost and Horror Stories\nGreen Tea and Other Ghost Stones\nCarmilla and Other Classic Tales of Mystery", "title": "Carmilla"}