{"summary": "The story centers on the relationship between Mrs Kitty Warren and her daughter, Vivie. Mrs. Warren, a former prostitute and current brothel owner, is described as \"on the whole, a genial and fairly presentable old blackguard of a woman.\" Vivie, an intelligent and pragmatic young woman who just graduated from university, has come home to get acquainted with her mother for the first time in her life. The play focuses on how their relationship changes when Vivie learns what her mother does for a living. It explains why Mrs. Warren became a prostitute, condemns the hypocrisies relating to prostitution, and criticizes the limited employment opportunities available for women in Victorian Britain.\n\n", "full_text": "MRS WARREN'S PROFESSION\n\n\nby George Bernard Shaw\n\n\n1894\n\n\nWith The Author's Apology (1902)\n\n\n\n\nTHE AUTHOR'S APOLOGY\n\n\nMrs Warren's Profession has been performed at last, after a delay of\nonly eight years; and I have once more shared with Ibsen the triumphant\namusement of startling all but the strongest-headed of the London\ntheatre critics clean out of the practice of their profession. No\nauthor who has ever known the exultation of sending the Press into an\nhysterical tumult of protest, of moral panic, of involuntary and frantic\nconfession of sin, of a horror of conscience in which the power of\ndistinguishing between the work of art on the stage and the real life\nof the spectator is confused and overwhelmed, will ever care for the\nstereotyped compliments which every successful farce or melodrama\nelicits from the newspapers. Give me that critic who rushed from my play\nto declare furiously that Sir George Crofts ought to be kicked. What a\ntriumph for the actor, thus to reduce a jaded London journalist to\nthe condition of the simple sailor in the Wapping gallery, who shouts\nexecrations at Iago and warnings to Othello not to believe him! But\ndearer still than such simplicity is that sense of the sudden earthquake\nshock to the foundations of morality which sends a pallid crowd of\ncritics into the street shrieking that the pillars of society are\ncracking and the ruin of the State is at hand. Even the Ibsen champions\nof ten years ago remonstrate with me just as the veterans of those brave\ndays remonstrated with them. Mr Grein, the hardy iconoclast who first\nlaunched my plays on the stage alongside Ghosts and The Wild Duck,\nexclaimed that I have shattered his ideals. Actually his ideals! What\nwould Dr Relling say? And Mr William Archer himself disowns me because I\n\"cannot touch pitch without wallowing in it\". Truly my play must be more\nneeded than I knew; and yet I thought I knew how little the others know.\n\nDo not suppose, however, that the consternation of the Press reflects\nany consternation among the general public. Anybody can upset the\ntheatre critics, in a turn of the wrist, by substituting for the\nromantic commonplaces of the stage the moral commonplaces of the pulpit,\nplatform, or the library. Play Mrs Warren's Profession to an audience\nof clerical members of the Christian Social Union and of women well\nexperienced in Rescue, Temperance, and Girls' Club work, and no moral\npanic will arise; every man and woman present will know that as long\nas poverty makes virtue hideous and the spare pocket-money of rich\nbachelordom makes vice dazzling, their daily hand-to-hand fight against\nprostitution with prayer and persuasion, shelters and scanty alms,\nwill be a losing one. There was a time when they were able to urge that\nthough \"the white-lead factory where Anne Jane was poisoned\" may be a\nfar more terrible place than Mrs Warren's house, yet hell is still more\ndreadful. Nowadays they no longer believe in hell; and the girls among\nwhom they are working know that they do not believe in it, and would\nlaugh at them if they did. So well have the rescuers learnt that Mrs\nWarren's defence of herself and indictment of society is the thing that\nmost needs saying, that those who know me personally reproach me, not\nfor writing this play, but for wasting my energies on \"pleasant\nplays\" for the amusement of frivolous people, when I can build up such\nexcellent stage sermons on their own work. Mrs Warren's Profession is\nthe one play of mine which I could submit to a censorship without doubt\nof the result; only, it must not be the censorship of the minor theatre\ncritic, nor of an innocent court official like the Lord Chamberlain's\nExaminer, much less of people who consciously profit by Mrs Warren's\nprofession, or who personally make use of it, or who hold the widely\nwhispered view that it is an indispensable safety-valve for the\nprotection of domestic virtue, or, above all, who are smitten with a\nsentimental affection for our fallen sister, and would \"take her up\ntenderly, lift her with care, fashioned so slenderly, young, and SO\nfair.\" Nor am I prepared to accept the verdict of the medical gentlemen\nwho would compulsorily sanitate and register Mrs Warren, whilst leaving\nMrs Warren's patrons, especially her military patrons, free to destroy\nher health and anybody else's without fear of reprisals. But I should be\nquite content to have my play judged by, say, a joint committee of\nthe Central Vigilance Society and the Salvation Army. And the sterner\nmoralists the members of the committee were, the better.\n\nSome of the journalists I have shocked reason so unripely that they will\ngather nothing from this but a confused notion that I am accusing the\nNational Vigilance Association and the Salvation Army of complicity in\nmy own scandalous immorality. It will seem to them that people who would\nstand this play would stand anything. They are quite mistaken. Such\nan audience as I have described would be revolted by many of our\nfashionable plays. They would leave the theatre convinced that the\nPlymouth Brother who still regards the playhouse as one of the gates of\nhell is perhaps the safest adviser on the subject of which he knows so\nlittle. If I do not draw the same conclusion, it is not because I am one\nof those who claim that art is exempt from moral obligations, and deny\nthat the writing or performance of a play is a moral act, to be treated\non exactly the same footing as theft or murder if it produces equally\nmischievous consequences. I am convinced that fine art is the subtlest,\nthe most seductive, the most effective instrument of moral propaganda in\nthe world, excepting only the example of personal conduct; and I waive\neven this exception in favor of the art of the stage, because it works\nby exhibiting examples of personal conduct made intelligible and moving\nto crowds of unobservant, unreflecting people to whom real life means\nnothing. I have pointed out again and again that the influence of the\ntheatre in England is growing so great that whilst private conduct,\nreligion, law, science, politics, and morals are becoming more and\nmore theatrical, the theatre itself remains impervious to common\nsense, religion, science, politics, and morals. That is why I fight the\ntheatre, not with pamphlets and sermons and treatises, but with plays;\nand so effective do I find the dramatic method that I have no doubt I\nshall at last persuade even London to take its conscience and its brains\nwith it when it goes to the theatre, instead of leaving them at home\nwith its prayer-book as it does at present. Consequently, I am the\nlast man in the world to deny that if the net effect of performing Mrs\nWarren's Profession were an increase in the number of persons entering\nthat profession, its performance should be dealt with accordingly.\n\nNow let us consider how such recruiting can be encouraged by the\ntheatre. Nothing is easier. Let the King's Reader of Plays, backed by\nthe Press, make an unwritten but perfectly well understood regulation\nthat members of Mrs Warren's profession shall be tolerated on the stage\nonly when they are beautiful, exquisitely dressed, and sumptuously\nlodged and fed; also that they shall, at the end of the play, die of\nconsumption to the sympathetic tears of the whole audience, or step\ninto the next room to commit suicide, or at least be turned out by their\nprotectors and passed on to be \"redeemed\" by old and faithful lovers who\nhave adored them in spite of their levities. Naturally, the poorer girls\nin the gallery will believe in the beauty, in the exquisite dresses, and\nthe luxurious living, and will see that there is no real necessity for\nthe consumption, the suicide, or the ejectment: mere pious forms, all\nof them, to save the Censor's face. Even if these purely official\ncatastrophes carried any conviction, the majority of English girls\nremain so poor, so dependent, so well aware that the drudgeries of such\nhonest work as is within their reach are likely enough to lead them\neventually to lung disease, premature death, and domestic desertion or\nbrutality, that they would still see reason to prefer the primrose path\nto the strait path of virtue, since both, vice at worst and virtue at\nbest, lead to the same end in poverty and overwork. It is true that the\nBoard School mistress will tell you that only girls of a certain kind\nwill reason in this way. But alas! that certain kind turns out on\ninquiry to be simply the pretty, dainty kind: that is, the only kind\nthat gets the chance of acting on such reasoning. Read the first report\nof the Commission on the Housing of the Working Classes [Bluebook C\n4402, 8d., 1889]; read the Report on Home Industries (sacred word,\nHome!) issued by the Women's Industrial Council [Home Industries of\nWomen in London, 1897, 1s., 12 Buckingham Street, W. C.]; and ask\nyourself whether, if the lot in life therein described were your lot\nin life, you would not prefer the lot of Cleopatra, of Theodora, of the\nLady of the Camellias, of Mrs Tanqueray, of Zaza, of Iris. If you can\ngo deep enough into things to be able to say no, how many ignorant\nhalf-starved girls will believe you are speaking sincerely? To them the\nlot of Iris is heavenly in comparison with their own. Yet our King, like\nhis predecessors, says to the dramatist, \"Thus, and thus only, shall\nyou present Mrs Warren's profession on the stage, or you shall starve.\nWitness Shaw, who told the untempting truth about it, and whom We, by\nthe Grace of God, accordingly disallow and suppress, and do what in Us\nlies to silence.\" Fortunately, Shaw cannot be silenced. \"The harlot's\ncry from street to street\" is louder than the voices of all the kings.\nI am not dependent on the theatre, and cannot be starved into making\nmy play a standing advertisement of the attractive side of Mrs Warren's\nbusiness.\n\nHere I must guard myself against a misunderstanding. It is not the fault\nof their authors that the long string of wanton's tragedies, from Antony\nand Cleopatra to Iris, are snares to poor girls, and are objected to\non that account by many earnest men and women who consider Mrs Warren's\nProfession an excellent sermon. Mr Pinero is in no way bound to suppress\nthe fact that his Iris is a person to be envied by millions of better\nwomen. If he made his play false to life by inventing fictitious\ndisadvantages for her, he would be acting as unscrupulously as any tract\nwriter. If society chooses to provide for its Irises better than for\nits working women, it must not expect honest playwrights to manufacture\nspurious evidence to save its credit. The mischief lies in the\ndeliberate suppression of the other side of the case: the refusal to\nallow Mrs Warren to expose the drudgery and repulsiveness of plying for\nhire among coarse, tedious drunkards; the determination not to let the\nParisian girl in Brieux's Les Avaries come on the stage and drive into\npeople's minds what her diseases mean for her and for themselves. All\nthat, says the King's Reader in effect, is horrifying, loathsome.\n\nPrecisely: what does he expect it to be? would he have us represent it\nas beautiful and gratifying? The answer to this question, I fear, must\nbe a blunt Yes; for it seems impossible to root out of an Englishman's\nmind the notion that vice is delightful, and that abstention from it\nis privation. At all events, as long as the tempting side of it is kept\ntowards the public, and softened by plenty of sentiment and sympathy, it\nis welcomed by our Censor, whereas the slightest attempt to place it in\nthe light of the policeman's lantern or the Salvation Army shelter\nis checkmated at once as not merely disgusting, but, if you please,\nunnecessary.\n\nEverybody will, I hope, admit that this state of things is intolerable;\nthat the subject of Mrs Warren's profession must be either tapu\naltogether, or else exhibited with the warning side as freely displayed\nas the tempting side. But many persons will vote for a complete tapu,\nand an impartial sweep from the boards of Mrs Warren and Gretchen and\nthe rest; in short, for banishing the sexual instincts from the stage\naltogether. Those who think this impossible can hardly have considered\nthe number and importance of the subjects which are actually banished\nfrom the stage. Many plays, among them Lear, Hamlet, Macbeth,\nCoriolanus, Julius Caesar, have no sex complications: the thread of\ntheir action can be followed by children who could not understand a\nsingle scene of Mrs Warren's Profession or Iris. None of our plays rouse\nthe sympathy of the audience by an exhibition of the pains of maternity,\nas Chinese plays constantly do. Each nation has its own particular set\nof tapus in addition to the common human stock; and though each of\nthese tapus limits the scope of the dramatist, it does not make drama\nimpossible. If the Examiner were to refuse to license plays with female\ncharacters in them, he would only be doing to the stage what our tribal\ncustoms already do to the pulpit and the bar. I have myself written a\nrather entertaining play with only one woman in it, and she is quite\nheartwhole; and I could just as easily write a play without a woman in\nit at all. I will even go so far as to promise the Mr Redford my support\nif he will introduce this limitation for part of the year, say during\nLent, so as to make a close season for that dullest of stock dramatic\nsubjects, adultery, and force our managers and authors to find out what\nall great dramatists find out spontaneously: to wit, that people who\nsacrifice every other consideration to love are as hopelessly unheroic\non the stage as lunatics or dipsomaniacs. Hector is the world's hero;\nnot Paris nor Antony.\n\nBut though I do not question the possibility of a drama in which love\nshould be as effectively ignored as cholera is at present, there is not\nthe slightest chance of that way out of the difficulty being taken by\nthe Mr Redford. If he attempted it there would be a revolt in which he\nwould be swept away in spite of my singlehanded efforts to defend him.\nA complete tapu is politically impossible. A complete toleration is\nequally impossible to Mr Redford, because his occupation would be gone\nif there were no tapu to enforce. He is therefore compelled to maintain\nthe present compromise of a partial tapu, applied, to the best of his\njudgement, with a careful respect to persons and to public opinion. And\na very sensible English solution of the difficulty, too, most readers\nwill say. I should not dispute it if dramatic poets really were what\nEnglish public opinion generally assumes them to be during their\nlifetime: that is, a licentiously irregular group to be kept in order\nin a rough and ready way by a magistrate who will stand no nonsense\nfrom them. But I cannot admit that the class represented by Eschylus,\nSophocles, Aristophanes, Euripides, Shakespear, Goethe, Ibsen, and\nTolstoy, not to mention our own contemporary playwrights, is as much in\nplace in Mr Redford's office as a pickpocket is in Bow Street. Further,\nit is not true that the Censorship, though it certainly suppresses Ibsen\nand Tolstoy, and would suppress Shakespear but for the absurd rule that\na play once licensed is always licensed (so that Wycherly is permitted\nand Shelley prohibited), also suppresses unscrupulous playwrights. I\nchallenge Mr Redford to mention any extremity of sexual misconduct which\nany manager in his senses would risk presenting on the London stage that\nhas not been presented under his license and that of his predecessor.\nThe compromise, in fact, works out in practice in favor of loose plays\nas against earnest ones.\n\nTo carry conviction on this point, I will take the extreme course of\nnarrating the plots of two plays witnessed within the last ten years\nby myself at London West End theatres, one licensed by the late Queen\nVictoria's Reader of Plays, the other by the present Reader to the King.\nBoth plots conform to the strictest rules of the period when La Dame aux\nCamellias was still a forbidden play, and when The Second Mrs Tanqueray\nwould have been tolerated only on condition that she carefully explained\nto the audience that when she met Captain Ardale she sinned \"but in\nintention.\"\n\nPlay number one. A prince is compelled by his parents to marry the\ndaughter of a neighboring king, but loves another maiden. The scene\nrepresents a hall in the king's palace at night. The wedding has taken\nplace that day; and the closed door of the nuptial chamber is in view of\nthe audience. Inside, the princess awaits her bridegroom. A duenna is in\nattendance. The bridegroom enters. His sole desire is to escape from a\nmarriage which is hateful to him. An idea strikes him. He will assault\nthe duenna, and get ignominiously expelled from the palace by his\nindignant father-in-law. To his horror, when he proceeds to carry out\nthis stratagem, the duenna, far from raising an alarm, is flattered,\ndelighted, and compliant. The assaulter becomes the assaulted. He flings\nher angrily to the ground, where she remains placidly. He flies. The\nfather enters; dismisses the duenna; and listens at the keyhole of\nhis daughter's nuptial chamber, uttering various pleasantries, and\ndeclaring, with a shiver, that a sound of kissing, which he supposes to\nproceed from within, makes him feel young again.\n\nIn deprecation of the scandalized astonishment with which such a story\nas this will be read, I can only say that it was not presented on the\nstage until its propriety had been certified by the chief officer of the\nQueen of England's household.\n\nStory number two. A German officer finds himself in an inn with a French\nlady who has wounded his national vanity. He resolves to humble her by\ncommitting a rape upon her. He announces his purpose. She remonstrates,\nimplores, flies to the doors and finds them locked, calls for help\nand finds none at hand, runs screaming from side to side, and, after\na harrowing scene, is overpowered and faints. Nothing further being\npossible on the stage without actual felony, the officer then relents\nand leaves her. When she recovers, she believes that he has carried out\nhis threat; and during the rest of the play she is represented as vainly\nvowing vengeance upon him, whilst she is really falling in love with\nhim under the influence of his imaginary crime against her. Finally she\nconsents to marry him; and the curtain falls on their happiness.\n\nThis story was certified by the present King's Reader, acting for the\nLord Chamberlain, as void in its general tendency of \"anything immoral\nor otherwise improper for the stage.\" But let nobody conclude therefore\nthat Mr Redford is a monster, whose policy it is to deprave the theatre.\nAs a matter of fact, both the above stories are strictly in order from\nthe official point of view. The incidents of sex which they contain,\nthough carried in both to the extreme point at which another step would\nbe dealt with, not by the King's Reader, but by the police, do not\ninvolve adultery, nor any allusion to Mrs Warren's profession, nor to\nthe fact that the children of any polyandrous group will, when they grow\nup, inevitably be confronted, as those of Mrs Warren's group are in my\nplay, with the insoluble problem of their own possible consanguinity.\nIn short, by depending wholly on the coarse humors and the physical\nfascination of sex, they comply with all the formulable requirements of\nthe Censorship, whereas plays in which these humors and fascinations are\ndiscarded, and the social problems created by sex seriously faced and\ndealt with, inevitably ignore the official formula and are suppressed.\nIf the old rule against the exhibition of illicit sex relations on stage\nwere revived, and the subject absolutely barred, the only result would\nbe that Antony and Cleopatra, Othello (because of the Bianca episode),\nTroilus and Cressida, Henry IV, Measure for Measure, Timon of Athens,\nLa Dame aux Camellias, The Profligate, The Second Mrs Tanqueray, The\nNotorious Mrs Ebbsmith, The Gay Lord Quex, Mrs Dane's Defence, and\nIris would be swept from the stage, and placed under the same ban as\nTolstoy's Dominion of Darkness and Mrs Warren's Profession, whilst such\nplays as the two described above would have a monopoly of the theatre as\nfar as sexual interest is concerned.\n\nWhat is more, the repulsiveness of the worst of the certified plays\nwould protect the Censorship against effective exposure and criticism.\nNot long ago an American Review of high standing asked me for an article\non the Censorship of the English stage. I replied that such an article\nwould involve passages too disagreeable for publication in a magazine\nfor general family reading. The editor persisted nevertheless; but\nnot until he had declared his readiness to face this, and had pledged\nhimself to insert the article unaltered (the particularity of the pledge\nextending even to a specification of the exact number of words in the\narticle) did I consent to the proposal. What was the result?\n\nThe editor, confronted with the two stories given above, threw his\npledge to the winds, and, instead of returning the article, printed\nit with the illustrative examples omitted, and nothing left but the\nargument from political principles against the Censorship. In doing this\nhe fired my broadside after withdrawing the cannon balls; for neither\nthe Censor nor any other Englishman, except perhaps Mr Leslie Stephen\nand a few other veterans of the dwindling old guard of Benthamism, cares\na dump about political principle. The ordinary Briton thinks that if\nevery other Briton is not kept under some form of tutelage, the more\nchildish the better, he will abuse his freedom viciously. As far as its\nprinciple is concerned, the Censorship is the most popular institution\nin England; and the playwright who criticizes it is slighted as a\nblackguard agitating for impunity. Consequently nothing can really shake\nthe confidence of the public in the Lord Chamberlain's department except\na remorseless and unbowdlerized narration of the licentious fictions\nwhich slip through its net, and are hallmarked by it with the approval\nof the Throne. But since these narrations cannot be made public without\ngreat difficulty, owing to the obligation an editor is under not to\ndeal unexpectedly with matters that are not _virginibus puerisque_, the\nchances are heavily in favor of the Censor escaping all remonstrance.\nWith the exception of such comments as I was able to make in my own\ncritical articles in The World and The Saturday Review when the pieces\nI have described were first produced, and a few ignorant protests by\nchurchmen against much better plays which they confessed they had not\nseen nor read, nothing has been said in the press that could seriously\ndisturb the easygoing notion that the stage would be much worse than it\nadmittedly is but for the vigilance of the King's Reader. The truth is,\nthat no manager would dare produce on his own responsibility the pieces\nhe can now get royal certificates for at two guineas per piece.\n\nI hasten to add that I believe these evils to be inherent in the\nnature of all censorship, and not merely a consequence of the form the\ninstitution takes in London. No doubt there is a staggering absurdity\nin appointing an ordinary clerk to see that the leaders of European\nliterature do not corrupt the morals of the nation, and to restrain Sir\nHenry Irving, as a rogue and a vagabond, from presuming to impersonate\nSamson or David on the stage, though any other sort of artist may daub\nthese scriptural figures on a signboard or carve them on a tombstone\nwithout hindrance. If the General Medical Council, the Royal College of\nPhysicians, the Royal Academy of Arts, the Incorporated Law Society, and\nConvocation were abolished, and their functions handed over to the Mr\nRedford, the Concert of Europe would presumably declare England mad, and\ntreat her accordingly. Yet, though neither medicine nor painting nor\nlaw nor the Church moulds the character of the nation as potently as the\ntheatre does, nothing can come on the stage unless its dimensions admit\nof its passing through Mr Redford's mind! Pray do not think that I\nquestion Mr Redford's honesty. I am quite sure that he sincerely thinks\nme a blackguard, and my play a grossly improper one, because, like\nTolstoy's Dominion of Darkness, it produces, as they are both meant to\nproduce, a very strong and very painful impression of evil. I do not\ndoubt for a moment that the rapine play which I have described, and\nwhich he licensed, was quite incapable in manuscript of producing\nany particular effect on his mind at all, and that when he was once\nsatisfied that the ill-conducted hero was a German and not an English\nofficer, he passed the play without studying its moral tendencies. Even\nif he had undertaken that study, there is no more reason to suppose\nthat he is a competent moralist than there is to suppose that I am a\ncompetent mathematician. But truly it does not matter whether he is a\nmoralist or not. Let nobody dream for a moment that what is wrong with\nthe Censorship is the shortcoming of the gentleman who happens at any\nmoment to be acting as Censor. Replace him to-morrow by an Academy of\nLetters and an Academy of Dramatic Poetry, and the new and enlarged\nfilter will still exclude original and epoch-making work, whilst passing\nconventional, old-fashioned, and vulgar work without question. The\nconclave which compiles the index of the Roman Catholic Church is the\nmost august, ancient, learned, famous, and authoritative censorship in\nEurope. Is it more enlightened, more liberal, more tolerant that the\ncomparatively infinitesimal office of the Lord Chamberlain? On the\ncontrary, it has reduced itself to a degree of absurdity which makes a\nCatholic university a contradiction in terms. All censorships exist\nto prevent anyone from challenging current conceptions and existing\ninstitutions. All progress is initiated by challenging current concepts,\nand executed by supplanting existing institutions. Consequently the\nfirst condition of progress is the removal of censorships. There is the\nwhole case against censorships in a nutshell.\n\nIt will be asked whether theatrical managers are to be allowed to\nproduce what they like, without regard to the public interest. But that\nis not the alternative. The managers of our London music-halls are not\nsubject to any censorship. They produce their entertainments on their\nown responsibility, and have no two-guinea certificates to plead if\ntheir houses are conducted viciously. They know that if they lose their\ncharacter, the County Council will simply refuse to renew their license\nat the end of the year; and nothing in the history of popular art\nis more amazing than the improvement in music-halls that this simple\narrangement has produced within a few years. Place the theatres on the\nsame footing, and we shall promptly have a similar revolution: a whole\nclass of frankly blackguardly plays, in which unscrupulous low comedians\nattract crowds to gaze at bevies of girls who have nothing to exhibit\nbut their prettiness, will vanish like the obscene songs which were\nsupposed to enliven the squalid dulness, incredible to the younger\ngeneration, of the music-halls fifteen years ago. On the other hand,\nplays which treat sex questions as problems for thought instead of as\naphrodisiacs will be freely performed. Gentlemen of Mr Redford's way of\nthinking will have plenty of opportunity of protesting against them\nin Council; but the result will be that the Mr Redford will find his\nnatural level; Ibsen and Tolstoy theirs; so no harm will be done.\n\nThis question of the Censorship reminds me that I have to apologize\nto those who went to the recent performance of Mrs Warren's Profession\nexpecting to find it what I have just called an aphrodisiac. That was\nnot my fault; it was Mr Redford's. After the specimens I have given of\nthe tolerance of his department, it was natural enough for thoughtless\npeople to infer that a play which overstepped his indulgence must be a\nvery exciting play indeed. Accordingly, I find one critic so explicit as\nto the nature of his disappointment as to say candidly that \"such airy\ntalk as there is upon the matter is utterly unworthy of acceptance as\nbeing a representation of what people with blood in them think or do on\nsuch occasions.\" Thus am I crushed between the upper millstone of the Mr\nRedford, who thinks me a libertine, and the nether popular critic, who\nthinks me a prude. Critics of all grades and ages, middle-aged fathers\nof families no less than ardent young enthusiasts, are equally indignant\nwith me. They revile me as lacking in passion, in feeling, in manhood.\nSome of them even sum the matter up by denying me any dramatic power: a\nmelancholy betrayal of what dramatic power has come to mean on our stage\nunder the Censorship! Can I be expected to refrain from laughing at\nthe spectacle of a number of respectable gentlemen lamenting because a\nplaywright lures them to the theatre by a promise to excite their senses\nin a very special and sensational manner, and then, having successfully\ntrapped them in exceptional numbers, proceeds to ignore their senses and\nruthlessly improve their minds? But I protest again that the lure was\nnot mine. The play had been in print for four years; and I have spared\nno pains to make known that my plays are built to induce, not voluptuous\nreverie but intellectual interest, not romantic rhapsody but humane\nconcern. Accordingly, I do not find those critics who are gifted with\nintellectual appetite and political conscience complaining of want of\ndramatic power. Rather do they protest, not altogether unjustly, against\na few relapses into staginess and caricature which betray the young\nplaywright and the old playgoer in this early work of mine.\n\nAs to the voluptuaries, I can assure them that the playwright, whether\nhe be myself or another, will always disappoint them. The drama can do\nlittle to delight the senses: all the apparent instances to the contrary\nare instances of the personal fascination of the performers. The drama\nof pure feeling is no longer in the hands of the playwright: it has been\nconquered by the musician, after whose enchantments all the verbal arts\nseem cold and tame. Romeo and Juliet with the loveliest Juliet is dry,\ntedious, and rhetorical in comparison with Wagner's Tristan, even though\nIsolde be both fourteen stone and forty, as she often is in Germany.\nIndeed, it needed no Wagner to convince the public of this. The\nvoluptuous sentimentality of Gounod's Faust and Bizet's Carmen has\ncaptured the common playgoer; and there is, flatly, no future now for\nany drama without music except the drama of thought. The attempt to\nproduce a genus of opera without music (and this absurdity is what\nour fashionable theatres have been driving at for a long time without\nknowing it) is far less hopeful than my own determination to accept\nproblem as the normal materiel of the drama.\n\nThat this determination will throw me into a long conflict with our\ntheatre critics, and with the few playgoers who go to the theatre as\noften as the critics, I well know; but I am too well equipped for the\nstrife to be deterred by it, or to bear malice towards the losing side.\nIn trying to produce the sensuous effects of opera, the fashionable\ndrama has become so flaccid in its sentimentality, and the intellect\nof its frequenters so atrophied by disuse, that the reintroduction\nof problem, with its remorseless logic and iron framework of fact,\ninevitably produces at first an overwhelming impression of coldness and\ninhuman rationalism. But this will soon pass away. When the intellectual\nmuscle and moral nerve of the critics has been developed in the struggle\nwith modern problem plays, the pettish luxuriousness of the clever ones,\nand the sulky sense of disadvantaged weakness in the sentimental ones,\nwill clear away; and it will be seen that only in the problem play is\nthere any real drama, because drama is no mere setting up of the camera\nto nature: it is the presentation in parable of the conflict between\nMan's will and his environment: in a word, of problem. The vapidness of\nsuch drama as the pseudo-operatic plays contain lies in the fact that\nin them animal passion, sentimentally diluted, is shewn in conflict, not\nwith real circumstances, but with a set of conventions and assumptions\nhalf of which do not exist off the stage, whilst the other half can\neither be evaded by a pretence of compliance or defied with complete\nimpunity by any reasonably strong-minded person. Nobody can feel that\nsuch conventions are really compulsory; and consequently nobody can\nbelieve in the stage pathos that accepts them as an inexorable fate, or\nin the genuineness of the people who indulge in such pathos. Sitting\nat such plays, we do not believe: we make-believe. And the habit of\nmake-believe becomes at last so rooted that criticism of the theatre\ninsensibly ceases to be criticism at all, and becomes more and more a\nchronicle of the fashionable enterprises of the only realities left on\nthe stage: that is, the performers in their own persons. In this\nphase the playwright who attempts to revive genuine drama produces the\ndisagreeable impression of the pedant who attempts to start a serious\ndiscussion at a fashionable at-home. Later on, when he has driven the\ntea services out and made the people who had come to use the theatre as\na drawing-room understand that it is they and not the dramatist who are\nthe intruders, he has to face the accusation that his plays ignore human\nfeeling, an illusion produced by that very resistance of fact and law to\nhuman feeling which creates drama. It is the _deus ex machina_ who, by\nsuspending that resistance, makes the fall of the curtain an immediate\nnecessity, since drama ends exactly where resistance ends. Yet the\nintroduction of this resistance produces so strong an impression of\nheartlessness nowadays that a distinguished critic has summed up the\nimpression made on him by Mrs Warren's Profession, by declaring that\n\"the difference between the spirit of Tolstoy and the spirit of Mr\nShaw is the difference between the spirit of Christ and the spirit of\nEuclid.\" But the epigram would be as good if Tolstoy's name were put in\nplace of mine and D'Annunzio's in place of Tolstoy. At the same time\nI accept the enormous compliment to my reasoning powers with sincere\ncomplacency; and I promise my flatterer that when he is sufficiently\naccustomed to and therefore undazzled by problem on the stage to be able\nto attend to the familiar factor of humanity in it as well as to the\nunfamiliar one of a real environment, he will both see and feel that\nMrs Warren's Profession is no mere theorem, but a play of instincts\nand temperaments in conflict with each other and with a flinty social\nproblem that never yields an inch to mere sentiment.\n\nI go further than this. I declare that the real secret of the\ncynicism and inhumanity of which shallower critics accuse me is the\nunexpectedness with which my characters behave like human beings,\ninstead of conforming to the romantic logic of the stage. The axioms and\npostulates of that dreary mimanthropometry are so well known that it is\nalmost impossible for its slaves to write tolerable last acts to\ntheir plays, so conventionally do their conclusions follow from their\npremises. Because I have thrown this logic ruthlessly overboard, I am\naccused of ignoring, not stage logic, but, of all things, human feeling.\nPeople with completely theatrified imaginations tell me that no girl\nwould treat her mother as Vivie Warren does, meaning that no stage\nheroine would in a popular sentimental play. They say this just as they\nmight say that no two straight lines would enclose a space. They do not\nsee how completely inverted their vision has become even when I throw\nits preposterousness in their faces, as I repeatedly do in this very\nplay. Praed, the sentimental artist (fool that I was not to make him a\ntheatre critic instead of an architect!) burlesques them by expecting\nall through the piece that the feelings of others will be logically\ndeducible from their family relationships and from his \"conventionally\nunconventional\" social code. The sarcasm is lost on the critics: they,\nsaturated with the same logic, only think him the sole sensible person\non the stage. Thus it comes about that the more completely the dramatist\nis emancipated from the illusion that men and women are primarily\nreasonable beings, and the more powerfully he insists on the ruthless\nindifference of their great dramatic antagonist, the external world, to\ntheir whims and emotions, the surer he is to be denounced as blind to\nthe very distinction on which his whole work is built. Far from ignoring\nidiosyncrasy, will, passion, impulse, whim, as factors in human action,\nI have placed them so nakedly on the stage that the elderly citizen,\naccustomed to see them clothed with the veil of manufactured logic about\nduty, and to disguise even his own impulses from himself in this way,\nfinds the picture as unnatural as Carlyle's suggested painting of\nparliament sitting without its clothes.\n\nI now come to those critics who, intellectually baffled by the problem\nin Mrs Warren's Profession, have made a virtue of running away from it.\nI will illustrate their method by quotation from Dickens, taken from the\nfifth chapter of Our Mutual Friend:\n\n\"Hem!\" began Wegg. \"This, Mr Boffin and Lady, is the first chapter of\nthe first wollume of the Decline and Fall off----\" here he looked hard\nat the book, and stopped.\n\n\"What's the matter, Wegg?\"\n\n\"Why, it comes into my mind, do you know, sir,\" said Wegg with an air of\ninsinuating frankness (having first again looked hard at the book), \"that\nyou made a little mistake this morning, which I had meant to set you\nright in; only something put it out of my head. I think you said Rooshan\nEmpire, sir?\"\n\n\"It is Rooshan; ain't it, Wegg?\"\n\n\"No, sir. Roman. Roman.\"\n\n\"What's the difference, Wegg?\"\n\n\"The difference, sir?\" Mr Wegg was faltering and in danger of breaking\ndown, when a bright thought flashed upon him. \"The difference, sir?\nThere you place me in a difficulty, Mr Boffin. Suffice it to observe,\nthat the difference is best postponed to some other occasion when Mrs\nBoffin does not honor us with her company. In Mrs Boffin's presence,\nsir, we had better drop it.\"\n\nMr Wegg thus came out of his disadvantage with quite a chivalrous air,\nand not only that, but by dint of repeating with a manly delicacy,\n\"In Mrs Boffin's presence, sir, we had better drop it!\" turned the\ndisadvantage on Boffin, who felt that he had committed himself in a very\npainful manner.\n\nI am willing to let Mr Wegg drop it on these terms, provided I am\nallowed to mention here that Mrs Warren's Profession is a play for\nwomen; that it was written for women; that it has been performed and\nproduced mainly through the determination of women that it should be\nperformed and produced; that the enthusiasm of women made its first\nperformance excitingly successful; and that not one of these women had\nany inducement to support it except their belief in the timeliness and\nthe power of the lesson the play teaches. Those who were \"surprised to\nsee ladies present\" were men; and when they proceeded to explain that\nthe journals they represented could not possibly demoralize the public\nby describing such a play, their editors cruelly devoted the space saved\nby their delicacy to an elaborate and respectful account of the progress\nof a young lord's attempt to break the bank at Monte Carlo. A few days\nsooner Mrs Warren would have been crowded out of their papers by an\nexceptionally abominable police case. I do not suggest that the police\ncase should have been suppressed; but neither do I believe that regard\nfor public morality had anything to do with their failure to grapple\nwith the performance by the Stage Society. And, after all, there was no\nneed to fall back on Silas Wegg's subterfuge. Several critics saved the\nfaces of their papers easily enough by the simple expedient of saying\nall they had to say in the tone of a shocked governess lecturing a\nnaughty child. To them I might plead, in Mrs Warren's words, \"Well,\nit's only good manners to be ashamed, dearie;\" but it surprises me,\nrecollecting as I do the effect produced by Miss Fanny Brough's delivery\nof that line, that gentlemen who shivered like violets in a zephyr as\nit swept through them, should so completely miss the full width of its\napplication as to go home and straightway make a public exhibition of\nmock modesty.\n\nMy old Independent Theatre manager, Mr Grein, besides that reproach to\nme for shattering his ideals, complains that Mrs Warren is not wicked\nenough, and names several romancers who would have clothed her black\nsoul with all the terrors of tragedy. I have no doubt they would; but\nif you please, my dear Grein, that is just what I did not want to do.\nNothing would please our sanctimonious British public more than to throw\nthe whole guilt of Mrs Warren's profession on Mrs Warren herself. Now\nthe whole aim of my play is to throw that guilt on the British public\nitself. You may remember that when you produced my first play, Widowers'\nHouses, exactly the same misunderstanding arose. When the virtuous young\ngentleman rose up in wrath against the slum landlord, the slum\nlandlord very effectively shewed him that slums are the product, not\nof individual Harpagons, but of the indifference of virtuous young\ngentlemen to the condition of the city they live in, provided they\nlive at the west end of it on money earned by someone else's labor. The\nnotion that prostitution is created by the wickedness of Mrs Warren\nis as silly as the notion--prevalent, nevertheless, to some extent in\nTemperance circles--that drunkenness is created by the wickedness of\nthe publican. Mrs Warren is not a whit a worse woman than the reputable\ndaughter who cannot endure her. Her indifference to the ultimate social\nconsequences of her means of making money, and her discovery of that\nmeans by the ordinary method of taking the line of least resistance to\ngetting it, are too common in English society to call for any special\nremark. Her vitality, her thrift, her energy, her outspokenness, her\nwise care of her daughter, and the managing capacity which has enabled\nher and her sister to climb from the fried fish shop down by the Mint\nto the establishments of which she boasts, are all high English social\nvirtues. Her defence of herself is so overwhelming that it provokes the\nSt James Gazette to declare that \"the tendency of the play is wholly\nevil\" because \"it contains one of the boldest and most specious defences\nof an immoral life for poor women that has ever been penned.\" Happily\nthe St James Gazette here speaks in its haste. Mrs Warren's defence of\nherself is not only bold and specious, but valid and unanswerable.\nBut it is no defence at all of the vice which she organizes. It is\nno defence of an immoral life to say that the alternative offered\nby society collectively to poor women is a miserable life, starved,\noverworked, fetid, ailing, ugly. Though it is quite natural and RIGHT\nfor Mrs Warren to choose what is, according to her lights, the least\nimmoral alternative, it is none the less infamous of society to offer\nsuch alternatives. For the alternatives offered are not morality and\nimmorality, but two sorts of immorality. The man who cannot see\nthat starvation, overwork, dirt, and disease are as anti-social as\nprostitution--that they are the vices and crimes of a nation, and\nnot merely its misfortunes--is (to put it as politely as possible) a\nhopelessly Private Person.\n\nThe notion that Mrs Warren must be a fiend is only an example of the\nviolence and passion which the slightest reference to sex arouses in\nundisciplined minds, and which makes it seem natural for our lawgivers\nto punish silly and negligible indecencies with a ferocity unknown in\ndealing with, for example, ruinous financial swindling. Had my play been\ntitled Mr Warren's Profession, and Mr Warren been a bookmaker, nobody\nwould have expected me to make him a villain as well. Yet gambling is\na vice, and bookmaking an institution, for which there is absolutely\nnothing to be said. The moral and economic evil done by trying to get\nother people's money without working for it (and this is the essence of\ngambling) is not only enormous but uncompensated. There are no two sides\nto the question of gambling, no circumstances which force us to tolerate\nit lest its suppression lead to worse things, no consensus of opinion\namong responsible classes, such as magistrates and military commanders,\nthat it is a necessity, no Athenian records of gambling made splendid by\nthe talents of its professors, no contention that instead of violating\nmorals it only violates a legal institution which is in many respects\noppressive and unnatural, no possible plea that the instinct on which it\nis founded is a vital one. Prostitution can confuse the issue with all\nthese excuses: gambling has none of them. Consequently, if Mrs Warren\nmust needs be a demon, a bookmaker must be a cacodemon. Well, does\nanybody who knows the sporting world really believe that bookmakers are\nworse than their neighbors? On the contrary, they have to be a good deal\nbetter; for in that world nearly everybody whose social rank does not\nexclude such an occupation would be a bookmaker if he could; but the\nstrength of character for handling large sums of money and for strict\nsettlements and unflinching payment of losses is so rare that successful\nbookmakers are rare too. It may seem that at least public spirit\ncannot be one of a bookmaker's virtues; but I can testify from personal\nexperience that excellent public work is done with money subscribed\nby bookmakers. It is true that there are abysses in bookmaking: for\nexample, welshing. Mr Grein hints that there are abysses in Mrs Warren's\nprofession also. So there are in every profession: the error lies in\nsupposing that every member of them sounds these depths. I sit on a\npublic body which prosecutes Mrs Warren zealously; and I can assure Mr\nGrein that she is often leniently dealt with because she has conducted\nher business \"respectably\" and held herself above its vilest branches.\nThe degrees in infamy are as numerous and as scrupulously observed as\nthe degrees in the peerage: the moralist's notion that there are depths\nat which the moral atmosphere ceases is as delusive as the rich man's\nnotion that there are no social jealousies or snobberies among the very\npoor. No: had I drawn Mrs Warren as a fiend in human form, the very\npeople who now rebuke me for flattering her would probably be the\nfirst to deride me for deducing her character logically from occupation\ninstead of observing it accurately in society.\n\nOne critic is so enslaved by this sort of logic that he calls my\nportraiture of the Reverend Samuel Gardner an attack on religion.\n\nAccording to this view Subaltern Iago is an attack on the army, Sir\nJohn Falstaff an attack on knighthood, and King Claudius an attack on\nroyalty. Here again the clamor for naturalness and human feeling, raised\nby so many critics when they are confronted by the real thing on the\nstage, is really a clamor for the most mechanical and superficial sort\nof logic. The dramatic reason for making the clergyman what Mrs Warren\ncalls \"an old stick-in-the-mud,\" whose son, in spite of much capacity\nand charm, is a cynically worthless member of society, is to set up a\nmordant contrast between him and the woman of infamous profession, with\nher well brought-up, straightforward, hardworking daughter. The critics\nwho have missed the contrast have doubtless observed often enough that\nmany clergymen are in the Church through no genuine calling, but simply\nbecause, in circles which can command preferment, it is the refuge\nof \"the fool of the family\"; and that clergymen's sons are often\nconspicuous reactionists against the restraints imposed on them in\nchildhood by their father's profession. These critics must know, too,\nfrom history if not from experience, that women as unscrupulous as Mrs\nWarren have distinguished themselves as administrators and rulers, both\ncommercially and politically. But both observation and knowledge are\nleft behind when journalists go to the theatre. Once in their stalls,\nthey assume that it is \"natural\" for clergymen to be saintly, for\nsoldiers to be heroic, for lawyers to be hard-hearted, for sailors to\nbe simple and generous, for doctors to perform miracles with little\nbottles, and for Mrs Warren to be a beast and a demon. All this is not\nonly not natural, but not dramatic. A man's profession only enters into\nthe drama of his life when it comes into conflict with his nature. The\nresult of this conflict is tragic in Mrs Warren's case, and comic in the\nclergyman's case (at least we are savage enough to laugh at it); but\nin both cases it is illogical, and in both cases natural. I repeat,\nthe critics who accuse me of sacrificing nature to logic are so\nsophisticated by their profession that to them logic is nature, and\nnature absurdity.\n\nMany friendly critics are too little skilled in social questions and\nmoral discussions to be able to conceive that respectable gentlemen like\nthemselves, who would instantly call the police to remove Mrs Warren if\nshe ventured to canvass them personally, could possibly be in any way\nresponsible for her proceedings. They remonstrate sincerely, asking me\nwhat good such painful exposures can possibly do. They might as well ask\nwhat good Lord Shaftesbury did by devoting his life to the exposure\nof evils (by no means yet remedied) compared to which the worst things\nbrought into view or even into surmise by this play are trifles.\nThe good of mentioning them is that you make people so extremely\nuncomfortable about them that they finally stop blaming \"human nature\"\nfor them, and begin to support measures for their reform.\n\nCan anything be more absurd than the copy of The Echo which contains a\nnotice of the performance of my play? It is edited by a gentleman who,\nhaving devoted his life to work of the Shaftesbury type, exposes social\nevils and clamors for their reform in every column except one; and that\none is occupied by the declaration of the paper's kindly theatre critic,\nthat the performance left him \"wondering what useful purpose the play\nwas intended to serve.\" The balance has to be redressed by the more\nfashionable papers, which usually combine capable art criticism with\nWest-End solecism on politics and sociology. It is very noteworthy,\nhowever, on comparing the press explosion produced by Mrs Warren's\nProfession in 1902 with that produced by Widowers' Houses about ten\nyears earlier, that whereas in 1892 the facts were frantically denied\nand the persons of the drama flouted as monsters of wickedness, in\n1902 the facts are admitted and the characters recognized, though it is\nsuggested that this is exactly why no gentleman should mention them in\npublic. Only one writer has ventured to imply this time that the poverty\nmentioned by Mrs Warren has since been quietly relieved, and need\nnot have been dragged back to the footlights. I compliment him on his\nsplendid mendacity, in which he is unsupported, save by a little plea in\na theatrical paper which is innocent enough to think that ten guineas a\nyear with board and lodging is an impossibly low wage for a barmaid. It\ngoes on to cite Mr Charles Booth as having testified that there are\nmany laborers' wives who are happy and contented on eighteen shillings\na week. But I can go further than that myself. I have seen an Oxford\nagricultural laborer's wife looking cheerful on eight shillings a week;\nbut that does not console me for the fact that agriculture in England\nis a ruined industry. If poverty does not matter as long as it is\ncontented, then crime does not matter as long as it is unscrupulous. The\ntruth is that it is only then that it does matter most desperately.\nMany persons are more comfortable when they are dirty than when they are\nclean; but that does not recommend dirt as a national policy.\n\nHere I must for the present break off my arduous work of educating the\nPress. We shall resume our studies later on; but just now I am tired of\nplaying the preceptor; and the eager thirst of my pupils for improvement\ndoes not console me for the slowness of their progress. Besides, I must\nreserve space to gratify my own vanity and do justice to the six artists\nwho acted my play, by placing on record the hitherto unchronicled\nsuccess of the first representation. It is not often that an author,\nafter a couple of hours of those rare alternations of excitement and\nintensely attentive silence which only occur in the theatre when actors\nand audience are reacting on one another to the utmost, is able to step\non the stage and apply the strong word genius to the representation with\nthe certainty of eliciting an instant and overwhelming assent from the\naudience. That was my good fortune on the afternoon of Sunday, the fifth\nof January last. I was certainly extremely fortunate in my interpreters\nin the enterprise, and that not alone in respect of their artistic\ntalent; for had it not been for their superhuman patience, their\nimperturbable good humor and good fellowship, there could have been no\nperformance. The terror of the Censor's power gave us trouble enough to\nbreak up any ordinary commercial enterprise. Managers promised and even\nengaged their theatres to us after the most explicit warnings that the\nplay was unlicensed, and at the last moment suddenly realized that Mr\nRedford had their livelihoods in the hollow of his hand, and backed\nout. Over and over again the date and place were fixed and the tickets\nprinted, only to be canceled, until at last the desperate and overworked\nmanager of the Stage Society could only laugh, as criminals broken on\nthe wheel used to laugh at the second stroke. We rehearsed under great\ndifficulties. Christmas pieces and plays for the new year were being\nproduced in all directions; and my six actor colleagues were busy\npeople, with engagements in these pieces in addition to their current\nprofessional work every night. On several raw winter days stages for\nrehearsal were unattainable even by the most distinguished applicants;\nand we shared corridors and saloons with them whilst the stage was\ngiven over to children in training for Boxing night. At last we had to\nrehearse at an hour at which no actor or actress has been out of bed\nwithin the memory of man; and we sardonically congratulated one another\nevery morning on our rosy matutinal looks and the improvement wrought\nby our early rising in our health and characters. And all this, please\nobserve, for a society without treasury or commercial prestige, for\na play which was being denounced in advance as unmentionable, for an\nauthor without influence at the fashionable theatres! I victoriously\nchallenge the West End managers to get as much done for interested\nmotives, if they can.\n\nThree causes made the production the most notable that has fallen to my\nlot. First, the veto of the Censor, which put the supporters of the play\non their mettle. Second, the chivalry of the Stage Society, which, in\nspite of my urgent advice to the contrary, and my demonstration of the\ndifficulties, dangers, and expenses the enterprise would cost, put my\ndiscouragements to shame and resolved to give battle at all costs to\nthe attempt of the Censorship to suppress the play. Third, the artistic\nspirit of the actors, who made the play their own and carried it through\ntriumphantly in spite of a series of disappointments and annoyances much\nmore trying to the dramatic temperament than mere difficulties.\n\nThe acting, too, required courage and character as well as skill and\nintelligence. The veto of the Censor introduced quite a novel element of\nmoral responsibility into the undertaking. And the characters were very\nunusual on the English stage. The younger heroine is, like her mother,\nan Englishwoman to the backbone, and not, like the heroines of our\nfashionable drama, a prima donna of Italian origin. Consequently she\nwas sure to be denounced as unnatural and undramatic by the critics.\nThe most vicious man in the play is not in the least a stage villain;\nindeed, he regards his own moral character with the sincere complacency\nof a hero of melodrama. The amiable devotee of romance and beauty is\nshewn at an age which brings out the futilization which these worships\nare apt to produce if they are made the staple of life instead of\nthe sauce. The attitude of the clever young people to their elders is\nfaithfully represented as one of pitiless ridicule and unsympathetic\ncriticism, and forms a spectacle incredible to those who, when young,\nwere not cleverer than their nearest elders, and painful to those\nsentimental parents who shrink from the cruelty of youth, which pardons\nnothing because it knows nothing. In short, the characters and their\nrelations are of a kind that the routineer critic has not yet learned\nto place; so that their misunderstanding was a foregone conclusion.\nNevertheless, there was no hesitation behind the curtain. When it went\nup at last, a stage much too small for the company was revealed to an\nauditorium much too small for the audience. But the players, though it\nwas impossible for them to forget their own discomfort, at once made the\nspectators forget theirs. It certainly was a model audience, responsive\nfrom the first line to the last; and it got no less than it deserved in\nreturn.\n\nI grieve to add that the second performance, given for the edification\nof the London Press and of those members of the Stage Society who cannot\nattend the Sunday performances, was a less inspiriting one than the\nfirst. A solid phalanx of theatre-weary journalists in an afternoon\nhumor, most of them committed to irreconcilable disparagement of problem\nplays, and all of them bound by etiquette to be as undemonstrative\nas possible, is not exactly the sort of audience that rises at the\nperformers and cures them of the inevitable reaction after an excitingly\nsuccessful first night. The artist nature is a sensitive and therefore\na vindictive one; and masterful players have a way with recalcitrant\naudiences of rubbing a play into them instead of delighting them with\nit. I should describe the second performance of Mrs Warren's Profession,\nespecially as to its earlier stages, as decidedly a rubbed-in one. The\nrubbing was no doubt salutary; but it must have hurt some of the thinner\nskins. The charm of the lighter passages fled; and the strong scenes,\nthough they again carried everything before them, yet discharged that\nduty in a grim fashion, doing execution on the enemy rather than moving\nthem to repentance and confession. Still, to those who had not seen the\nfirst performance, the effect was sufficiently impressive; and they\nhad the advantage of witnessing a fresh development in Mrs Warren, who,\nartistically jealous, as I took it, of the overwhelming effect of the\nend of the second act on the previous day, threw herself into the fourth\nact in quite a new way, and achieved the apparently impossible feat of\nsurpassing herself. The compliments paid to Miss Fanny Brough by\nthe critics, eulogistic as they are, are the compliments of men\nthree-fourths duped as Partridge was duped by Garrick. By much of her\nacting they were so completely taken in that they did not recognize it\nas acting at all. Indeed, none of the six players quite escaped this\nconsequence of their own thoroughness. There was a distinct tendency\namong the less experienced critics to complain of their sentiments and\nbehavior. Naturally, the author does not share that grievance.\n\nPICCARD'S COTTAGE, JANUARY 1902.\n\n\n\n\n\nMRS WARREN'S PROFESSION\n\n\n[Mrs Warren's Profession was performed for the first time in the theatre\nof the New Lyric Club, London, on the 5th and 6th January 1902, with\nMadge McIntosh as Vivie, Julius Knight as Praed, Fanny Brough as Mrs\nWarren, Charles Goodhart as Crofts, Harley Granville-Barker as Frank,\nand Cosmo Stuart as the Reverend Samuel Gardner.]\n\n\n\n\nACT I\n\n\n[Summer afternoon in a cottage garden on the eastern slope of a hill a\nlittle south of Haslemere in Surrey. Looking up the hill, the cottage is\nseen in the left hand corner of the garden, with its thatched roof and\nporch, and a large latticed window to the left of the porch. A paling\ncompletely shuts in the garden, except for a gate on the right. The\ncommon rises uphill beyond the paling to the sky line. Some folded\ncanvas garden chairs are leaning against the side bench in the porch. A\nlady's bicycle is propped against the wall, under the window. A little\nto the right of the porch a hammock is slung from two posts. A big\ncanvas umbrella, stuck in the ground, keeps the sun off the hammock,\nin which a young lady is reading and making notes, her head towards\nthe cottage and her feet towards the gate. In front of the hammock,\nand within reach of her hand, is a common kitchen chair, with a pile of\nserious-looking books and a supply of writing paper on it.]\n\n[A gentleman walking on the common comes into sight from behind the\ncottage. He is hardly past middle age, with something of the artist\nabout him, unconventionally but carefully dressed, and clean-shaven\nexcept for a moustache, with an eager susceptible face and very amiable\nand considerate manners. He has silky black hair, with waves of grey and\nwhite in it. His eyebrows are white, his moustache black. He seems not\ncertain of his way. He looks over the palings; takes stock of the place;\nand sees the young lady.]\n\nTHE GENTLEMAN [taking off his hat] I beg your pardon. Can you direct me\nto Hindhead View--Mrs Alison's?\n\nTHE YOUNG LADY [glancing up from her book] This is Mrs Alison's. [She\nresumes her work].\n\nTHE GENTLEMAN. Indeed! Perhaps--may I ask are you Miss Vivie Warren?\n\nTHE YOUNG LADY [sharply, as she turns on her elbow to get a good look at\nhim] Yes.\n\nTHE GENTLEMAN [daunted and conciliatory] I'm afraid I appear intrusive.\nMy name is Praed. [Vivie at once throws her books upon the chair, and\ngets out of the hammock]. Oh, pray don't let me disturb you.\n\nVIVIE [striding to the gate and opening it for him] Come in, Mr Praed.\n[He comes in]. Glad to see you. [She proffers her hand and takes his\nwith a resolute and hearty grip. She is an attractive specimen of the\nsensible, able, highly-educated young middle-class Englishwoman. Age 22.\nPrompt, strong, confident, self-possessed. Plain business-like dress,\nbut not dowdy. She wears a chatelaine at her belt, with a fountain pen\nand a paper knife among its pendants].\n\nPRAED. Very kind of you indeed, Miss Warren. [She shuts the gate with a\nvigorous slam. He passes in to the middle of the garden, exercising his\nfingers, which are slightly numbed by her greeting]. Has your mother\narrived?\n\nVIVIE [quickly, evidently scenting aggression] Is she coming?\n\nPRAED [surprised] Didn't you expect us?\n\nVIVIE. No.\n\nPRAED. Now, goodness me, I hope I've not mistaken the day. That would be\njust like me, you know. Your mother arranged that she was to come down\nfrom London and that I was to come over from Horsham to be introduced to\nyou.\n\nVIVIE [not at all pleased] Did she? Hm! My mother has rather a trick of\ntaking me by surprise--to see how I behave myself while she's away, I\nsuppose. I fancy I shall take my mother very much by surprise one of\nthese days, if she makes arrangements that concern me without consulting\nme beforehand. She hasnt come.\n\nPRAED [embarrassed] I'm really very sorry.\n\nVIVIE [throwing off her displeasure] It's not your fault, Mr Praed, is\nit? And I'm very glad you've come. You are the only one of my mother's\nfriends I have ever asked her to bring to see me.\n\nPRAED [relieved and delighted] Oh, now this is really very good of you,\nMiss Warren!\n\nVIVIE. Will you come indoors; or would you rather sit out here and talk?\n\nPRAED. It will be nicer out here, don't you think?\n\nVIVIE. Then I'll go and get you a chair. [She goes to the porch for a\ngarden chair].\n\nPRAED [following her] Oh, pray, pray! Allow me. [He lays hands on the\nchair].\n\nVIVIE [letting him take it] Take care of your fingers; theyre rather\ndodgy things, those chairs. [She goes across to the chair with the books\non it; pitches them into the hammock; and brings the chair forward with\none swing].\n\nPRAED [who has just unfolded his chair] Oh, now do let me take that\nhard chair. I like hard chairs.\n\nVIVIE. So do I. Sit down, Mr Praed. [This invitation she gives with a\ngenial peremptoriness, his anxiety to please her clearly striking her as\na sign of weakness of character on his part. But he does not immediately\nobey].\n\nPRAED. By the way, though, hadnt we better go to the station to meet\nyour mother?\n\nVIVIE [coolly] Why? She knows the way.\n\nPRAED [disconcerted] Er--I suppose she does [he sits down].\n\nVIVIE. Do you know, you are just like what I expected. I hope you are\ndisposed to be friends with me.\n\nPRAED [again beaming] Thank you, my _dear_ Miss Warren; thank you. Dear\nme! I'm so glad your mother hasnt spoilt you!\n\nVIVIE. How?\n\nPRAED. Well, in making you too conventional. You know, my dear Miss\nWarren, I am a born anarchist. I hate authority. It spoils the relations\nbetween parent and child; even between mother and daughter. Now I was\nalways afraid that your mother would strain her authority to make you\nvery conventional. It's such a relief to find that she hasnt.\n\nVIVIE. Oh! have I been behaving unconventionally?\n\nPRAED. Oh no: oh dear no. At least, not conventionally unconventionally,\nyou understand. [She nods and sits down. He goes on, with a cordial\noutburst] But it was so charming of you to say that you were disposed\nto be friends with me! You modern young ladies are splendid: perfectly\nsplendid!\n\nVIVIE [dubiously] Eh? [watching him with dawning disappointment as to\nthe quality of his brains and character].\n\nPRAED. When I was your age, young men and women were afraid of each\nother: there was no good fellowship. Nothing real. Only gallantry copied\nout of novels, and as vulgar and affected as it could be. Maidenly\nreserve! gentlemanly chivalry! always saying no when you meant yes!\nsimple purgatory for shy and sincere souls.\n\nVIVIE. Yes, I imagine there must have been a frightful waste of time.\nEspecially women's time.\n\nPRAED. Oh, waste of life, waste of everything. But things are improving.\nDo you know, I have been in a positive state of excitement about meeting\nyou ever since your magnificent achievements at Cambridge: a thing\nunheard of in my day. It was perfectly splendid, your tieing with the\nthird wrangler. Just the right place, you know. The first wrangler\nis always a dreamy, morbid fellow, in whom the thing is pushed to the\nlength of a disease.\n\nVIVIE. It doesn't pay. I wouldn't do it again for the same money.\n\nPRAED [aghast] The same money!\n\nVIVIE. Yes. Fifty pounds. Perhaps you don't know how it was. Mrs Latham,\nmy tutor at Newnham, told my mother that I could distinguish myself in\nthe mathematical tripos if I went in for it in earnest. The papers were\nfull just then of Phillipa Summers beating the senior wrangler. You\nremember about it, of course.\n\nPRAED [shakes his head energetically] !!!\n\nVIVIE. Well, anyhow, she did; and nothing would please my mother but\nthat I should do the same thing. I said flatly that it was not worth\nmy while to face the grind since I was not going in for teaching; but I\noffered to try for fourth wrangler or thereabouts for fifty pounds. She\nclosed with me at that, after a little grumbling; and I was better than\nmy bargain. But I wouldn't do it again for that. Two hundred pounds would\nhave been nearer the mark.\n\nPRAED [much damped] Lord bless me! Thats a very practical way of looking\nat it.\n\nVIVIE. Did you expect to find me an unpractical person?\n\nPRAED. But surely it's practical to consider not only the work these\nhonors cost, but also the culture they bring.\n\nVIVIE. Culture! My dear Mr Praed: do you know what the mathematical\ntripos means? It means grind, grind, grind for six to eight hours a day\nat mathematics, and nothing but mathematics.\n\nI'm supposed to know something about science; but I know nothing except\nthe mathematics it involves. I can make calculations for engineers,\nelectricians, insurance companies, and so on; but I know next to\nnothing about engineering or electricity or insurance. I don't even know\narithmetic well. Outside mathematics, lawn-tennis, eating, sleeping,\ncycling, and walking, I'm a more ignorant barbarian than any woman could\npossibly be who hadn't gone in for the tripos.\n\nPRAED [revolted] What a monstrous, wicked, rascally system! I knew it!\nI felt at once that it meant destroying all that makes womanhood\nbeautiful!\n\nVIVIE. I don't object to it on that score in the least. I shall turn it\nto very good account, I assure you.\n\nPRAED. Pooh! In what way?\n\nVIVIE. I shall set up chambers in the City, and work at actuarial\ncalculations and conveyancing. Under cover of that I shall do some law,\nwith one eye on the Stock Exchange all the time. I've come down here by\nmyself to read law: not for a holiday, as my mother imagines. I hate\nholidays.\n\nPRAED. You make my blood run cold. Are you to have no romance, no beauty\nin your life?\n\nVIVIE. I don't care for either, I assure you.\n\nPRAED. You can't mean that.\n\nVIVIE. Oh yes I do. I like working and getting paid for it. When I'm\ntired of working, I like a comfortable chair, a cigar, a little whisky,\nand a novel with a good detective story in it.\n\nPRAED [rising in a frenzy of repudiation] I don't believe it. I am an\nartist; and I can't believe it: I refuse to believe it. It's only that\nyou havn't discovered yet what a wonderful world art can open up to you.\n\nVIVIE. Yes I have. Last May I spent six weeks in London with Honoria\nFraser. Mamma thought we were doing a round of sightseeing together; but\nI was really at Honoria's chambers in Chancery Lane every day, working\naway at actuarial calculations for her, and helping her as well as a\ngreenhorn could. In the evenings we smoked and talked, and never dreamt\nof going out except for exercise. And I never enjoyed myself more in my\nlife.\n\nI cleared all my expenses and got initiated into the business without a\nfee in the bargain.\n\nPRAED. But bless my heart and soul, Miss Warren, do you call that\ndiscovering art?\n\nVIVIE. Wait a bit. That wasn't the beginning. I went up to town on an\ninvitation from some artistic people in Fitzjohn's Avenue: one of the\ngirls was a Newnham chum. They took me to the National Gallery--\n\nPRAED [approving] Ah!! [He sits down, much relieved].\n\nVIVIE [continuing]--to the Opera--\n\nPRAED [still more pleased] Good!\n\nVIVIE.--and to a concert where the band played all the evening:\nBeethoven and Wagner and so on. I wouldn't go through that experience\nagain for anything you could offer me. I held out for civility's sake\nuntil the third day; and then I said, plump out, that I couldn't stand\nany more of it, and went off to Chancery Lane. N o w you know the sort\nof perfectly splendid modern young lady I am. How do you think I shall\nget on with my mother?\n\nPRAED [startled] Well, I hope--er--\n\nVIVIE. It's not so much what you hope as what you believe, that I want\nto know.\n\nPRAED. Well, frankly, I am afraid your mother will be a little\ndisappointed. Not from any shortcoming on your part, you know: I don't\nmean that. But you are so different from her ideal.\n\nVIVIE. Her what?!\n\nPRAED. Her ideal.\n\nVIVIE. Do you mean her ideal of ME?\n\nPRAED. Yes.\n\nVIVIE. What on earth is it like?\n\nPRAED. Well, you must have observed, Miss Warren, that people who are\ndissatisfied with their own bringing-up generally think that the world\nwould be all right if everybody were to be brought up quite differently.\nNow your mother's life has been--er--I suppose you know--\n\nVIVIE. Don't suppose anything, Mr Praed. I hardly know my mother. Since\nI was a child I have lived in England, at school or at college, or with\npeople paid to take charge of me. I have been boarded out all my life.\nMy mother has lived in Brussels or Vienna and never let me go to her.\nI only see her when she visits England for a few days. I don't complain:\nit's been very pleasant; for people have been very good to me; and there\nhas always been plenty of money to make things smooth. But don't imagine\nI know anything about my mother. I know far less than you do.\n\nPRAED [very ill at ease] In that case--[He stops, quite at a loss. Then,\nwith a forced attempt at gaiety] But what nonsense we are talking! Of\ncourse you and your mother will get on capitally. [He rises, and looks\nabroad at the view]. What a charming little place you have here!\n\nVIVIE [unmoved] Rather a violent change of subject, Mr Praed. Why won't\nmy mother's life bear being talked about?\n\nPRAED. Oh, you mustn't say that. Isn't it natural that I should have a\ncertain delicacy in talking to my old friend's daughter about her behind\nher back? You and she will have plenty of opportunity of talking about\nit when she comes.\n\nVIVIE. No: she won't talk about it either. [Rising] However, I daresay\nyou have good reasons for telling me nothing. Only, mind this, Mr\nPraed, I expect there will be a battle royal when my mother hears of my\nChancery Lane project.\n\nPRAED [ruefully] I'm afraid there will.\n\nVIVIE. Well, I shall win because I want nothing but my fare to London\nto start there to-morrow earning my own living by devilling for Honoria.\nBesides, I have no mysteries to keep up; and it seems she has. I shall\nuse that advantage over her if necessary.\n\nPRAED [greatly shocked] Oh no! No, pray. Youd not do such a thing.\n\nVIVIE. Then tell me why not.\n\nPRAED. I really cannot. I appeal to your good feeling. [She smiles at\nhis sentimentality]. Besides, you may be too bold. Your mother is not to\nbe trifled with when she's angry.\n\nVIVIE. You can't frighten me, Mr Praed. In that month at Chancery Lane I\nhad opportunities of taking the measure of one or two women v e r y like\nmy mother. You may back me to win. But if I hit harder in my ignorance\nthan I need, remember it is you who refuse to enlighten me. Now, let us\ndrop the subject. [She takes her chair and replaces it near the hammock\nwith the same vigorous swing as before].\n\nPRAED [taking a desperate resolution] One word, Miss Warren. I had\nbetter tell you. It's very difficult; but--\n\n[Mrs Warren and Sir George Crofts arrive at the gate. Mrs Warren is\nbetween 40 and 50, formerly pretty, showily dressed in a brilliant\nhat and a gay blouse fitting tightly over her bust and flanked by\nfashionable sleeves. Rather spoilt and domineering, and decidedly\nvulgar, but, on the whole, a genial and fairly presentable old\nblackguard of a woman.]\n\n[Crofts is a tall powerfully-built man of about 50, fashionably dressed\nin the style of a young man. Nasal voice, reedier than might be expected\nfrom his strong frame. Clean-shaven bulldog jaws, large flat ears, and\nthick neck: gentlemanly combination of the most brutal types of city\nman, sporting man, and man about town.]\n\nVIVIE. Here they are. [Coming to them as they enter the garden] How do,\nmater? Mr Praed's been here this half hour, waiting for you.\n\nMRS WARREN. Well, if you've been waiting, Praddy, it's your own fault:\nI thought youd have had the gumption to know I was coming by the 3.10\ntrain. Vivie: put your hat on, dear: youll get sunburnt. Oh, I forgot to\nintroduce you. Sir George Crofts: my little Vivie.\n\n[Crofts advances to Vivie with his most courtly manner. She nods, but\nmakes no motion to shake hands.]\n\nCROFTS. May I shake hands with a young lady whom I have known by\nreputation very long as the daughter of one of my oldest friends?\n\nVIVIE [who has been looking him up and down sharply] If you like.\n\n[She takes his tenderly proferred hand and gives it a squeeze that makes\nhim open his eyes; then turns away, and says to her mother] Will you\ncome in, or shall I get a couple more chairs? [She goes into the porch\nfor the chairs].\n\nMRS WARREN. Well, George, what do you think of her?\n\nCROFTS [ruefully] She has a powerful fist. Did you shake hands with her,\nPraed?\n\nPRAED. Yes: it will pass off presently.\n\nCROFTS. I hope so. [Vivie reappears with two more chairs. He hurries to\nher assistance]. Allow me.\n\nMRS WARREN [patronizingly] Let Sir George help you with the chairs,\ndear.\n\nVIVIE [pitching them into his arms] Here you are. [She dusts her hands\nand turns to Mrs Warren]. Youd like some tea, wouldn't you?\n\nMRS WARREN [sitting in Praed's chair and fanning herself] I'm dying for\na drop to drink.\n\nVIVIE. I'll see about it. [She goes into the cottage].\n\n[Sir George has by this time managed to unfold a chair and plant it by\nMrs Warren, on her left. He throws the other on the grass and sits down,\nlooking dejected and rather foolish, with the handle of his stick in\nhis mouth. Praed, still very uneasy, fidgets around the garden on their\nright.]\n\nMRS WARREN [to Praed, looking at Crofts] Just look at him, Praddy: he\nlooks cheerful, don't he? He's been worrying my life out these three\nyears to have that little girl of mine shewn to him; and now that Ive\ndone it, he's quite out of countenance. [Briskly] Come! sit up, George;\nand take your stick out of your mouth. [Crofts sulkily obeys].\n\nPRAED. I think, you know--if you don't mind my saying so--that we had\nbetter get out of the habit of thinking of her as a little girl. You see\nshe has really distinguished herself; and I'm not sure, from what I have\nseen of her, that she is not older than any of us.\n\nMRS WARREN [greatly amused] Only listen to him, George! Older than any\nof us! Well she _has_ been stuffing you nicely with her importance.\n\nPRAED. But young people are particularly sensitive about being treated\nin that way.\n\nMRS WARREN. Yes; and young people have to get all that nonsense taken\nout of them, and good deal more besides. Don't you interfere, Praddy: I\nknow how to treat my own child as well as you do. [Praed, with a grave\nshake of his head, walks up the garden with his hands behind his back.\nMrs Warren pretends to laugh, but looks after him with perceptible\nconcern. Then, she whispers to Crofts] Whats the matter with him? What\ndoes he take it like that for?\n\nCROFTS [morosely] Youre afraid of Praed.\n\nMRS WARREN. What! Me! Afraid of dear old Praddy! Why, a fly wouldn't be\nafraid of him.\n\nCROFTS. _You're_ afraid of him.\n\nMRS WARREN [angry] I'll trouble you to mind your own business, and not\ntry any of your sulks on me. I'm not afraid of y o u, anyhow. If you\ncan't make yourself agreeable, youd better go home. [She gets up, and,\nturning her back on him, finds herself face to face with Praed]. Come,\nPraddy, I know it was only your tender-heartedness. Youre afraid I'll\nbully her.\n\nPRAED. My dear Kitty: you think I'm offended. Don't imagine that: pray\ndon't. But you know I often notice things that escape you; and though you\nnever take my advice, you sometimes admit afterwards that you ought to\nhave taken it.\n\nMRS WARREN. Well, what do you notice now?\n\nPRAED. Only that Vivie is a grown woman. Pray, Kitty, treat her with\nevery respect.\n\nMRS WARREN [with genuine amazement] Respect! Treat my own daughter with\nrespect! What next, pray!\n\nVIVIE [appearing at the cottage door and calling to Mrs Warren] Mother:\nwill you come to my room before tea?\n\nMRS WARREN. Yes, dearie. [She laughs indulgently at Praed's gravity, and\npats him on the cheek as she passes him on her way to the porch]. Don't\nbe cross, Praddy. [She follows Vivie into the cottage].\n\nCROFTS [furtively] I say, Praed.\n\nPRAED. Yes.\n\nCROFTS. I want to ask you a rather particular question.\n\nPRAED. Certainly. [He takes Mrs Warren's chair and sits close to\nCrofts].\n\nCROFTS. Thats right: they might hear us from the window. Look here: did\nKitty every tell you who that girl's father is?\n\nPRAED. Never.\n\nCROFTS. Have you any suspicion of who it might be?\n\nPRAED. None.\n\nCROFTS [not believing him] I know, of course, that you perhaps might\nfeel bound not to tell if she had said anything to you. But it's very\nawkward to be uncertain about it now that we shall be meeting the girl\nevery day. We don't exactly know how we ought to feel towards her.\n\nPRAED. What difference can that make? We take her on her own merits.\nWhat does it matter who her father was?\n\nCROFTS [suspiciously] Then you know who he was?\n\nPRAED [with a touch of temper] I said no just now. Did you not hear me?\n\nCROFTS. Look here, Praed. I ask you as a particular favor. If you _do_\nknow [movement of protest from Praed]--I only say, if you know,\nyou might at least set my mind at rest about her. The fact is, I fell\nattracted.\n\nPRAED [sternly] What do you mean?\n\nCROFTS. Oh, don't be alarmed: it's quite an innocent feeling. Thats what\npuzzles me about it. Why, for all I know, _I_ might be her father.\n\nPRAED. You! Impossible!\n\nCROFTS [catching him up cunningly] You know for certain that I'm not?\n\nPRAED. I know nothing about it, I tell you, any more than you. But\nreally, Crofts--oh no, it's out of the question. Theres not the least\nresemblance.\n\nCROFTS. As to that, theres no resemblance between her and her mother\nthat I can see. I suppose she's not y o u r daughter, is she?\n\nPRAED [rising indignantly] Really, Crofts--!\n\nCROFTS. No offence, Praed. Quite allowable as between two men of the\nworld.\n\nPRAED [recovering himself with an effort and speaking gently and\ngravely] Now listen to me, my dear Crofts. [He sits down again].\n\nI have nothing to do with that side of Mrs Warren's life, and never had.\nShe has never spoken to me about it; and of course I have never spoken\nto her about it. Your delicacy will tell you that a handsome woman needs\nsome friends who are not--well, not on that footing with her. The effect\nof her own beauty would become a torment to her if she could not escape\nfrom it occasionally. You are probably on much more confidential terms\nwith Kitty than I am. Surely you can ask her the question yourself.\n\nCROFTS. I h a v e asked her, often enough. But she's so determined to\nkeep the child all to herself that she would deny that it ever had a\nfather if she could. [Rising] I'm thoroughly uncomfortable about it,\nPraed.\n\nPRAED [rising also] Well, as you are, at all events, old enough to be\nher father, I don't mind agreeing that we both regard Miss Vivie in a\nparental way, as a young girl who we are bound to protect and help. What\ndo you say?\n\nCROFTS [aggressively] I'm no older than you, if you come to that.\n\nPRAED. Yes you are, my dear fellow: you were born old. I was born a boy:\nIve never been able to feel the assurance of a grown-up man in my life.\n[He folds his chair and carries it to the porch].\n\nMRS WARREN [calling from within the cottage] Prad-dee! George!\nTea-ea-ea-ea!\n\nCROFTS [hastily] She's calling us. [He hurries in].\n\n[Praed shakes his head bodingly, and is following Crofts when he is\nhailed by a young gentleman who has just appeared on the common, and is\nmaking for the gate. He is pleasant, pretty, smartly dressed, cleverly\ngood-for-nothing, not long turned 20, with a charming voice and\nagreeably disrespectful manners. He carries a light sporting magazine\nrifle.]\n\nTHE YOUNG GENTLEMAN. Hallo! Praed!\n\nPRAED. Why, Frank Gardner! [Frank comes in and shakes hands cordially].\nWhat on earth are you doing here?\n\nFRANK. Staying with my father.\n\nPRAED. The Roman father?\n\nFRANK. He's rector here. I'm living with my people this autumn for the\nsake of economy. Things came to a crisis in July: the Roman father had\nto pay my debts. He's stony broke in consequence; and so am I. What are\nyou up to in these parts? do you know the people here?\n\nPRAED. Yes: I'm spending the day with a Miss Warren.\n\nFRANK [enthusiastically] What! Do you know Vivie? Isn't she a jolly girl?\nI'm teaching her to shoot with this [putting down the rifle]. I'm so\nglad she knows you: youre just the sort of fellow she ought to know.\n[He smiles, and raises the charming voice almost to a singing tone as he\nexclaims] It's e v e r so jolly to find you here, Praed.\n\nPRAED. I'm an old friend of her mother. Mrs Warren brought me over to\nmake her daughter's acquaintance.\n\nFRANK. The mother! Is _she_ here?\n\nPRAED. Yes: inside, at tea.\n\nMRS WARREN [calling from within] Prad-dee-ee-ee-eee! The tea-cake'll be\ncold.\n\nPRAED [calling] Yes, Mrs Warren. In a moment. I've just met a friend\nhere.\n\nMRS WARREN. A what?\n\nPRAED [louder] A friend.\n\nMRS WARREN. Bring him in.\n\nPRAED. All right. [To Frank] Will you accept the invitation?\n\nFRANK [incredulous, but immensely amused] Is that Vivie's mother?\n\nPRAED. Yes.\n\nFRANK. By Jove! What a lark! Do you think she'll like me?\n\nPRAED. I've no doubt youll make yourself popular, as usual. Come in and\ntry [moving towards the house].\n\nFRANK. Stop a bit. [Seriously] I want to take you into my confidence.\n\nPRAED. Pray don't. It's only some fresh folly, like the barmaid at\nRedhill.\n\nFRANK. It's ever so much more serious than that. You say you've only just\nmet Vivie for the first time?\n\nPRAED. Yes.\n\nFRANK [rhapsodically] Then you can have no idea what a girl she is. Such\ncharacter! Such sense! And her cleverness! Oh, my eye, Praed, but I can\ntell you she is clever! And--need I add?--she loves me.\n\nCROFTS [putting his head out of the window] I say, Praed: what are you\nabout? Do come along. [He disappears].\n\nFRANK. Hallo! Sort of chap that would take a prize at a dog show, ain't\nhe? Who's he?\n\nPRAED. Sir George Crofts, an old friend of Mrs Warren's. I think we had\nbetter come in.\n\n[On their way to the porch they are interrupted by a call from the gate.\nTurning, they see an elderly clergyman looking over it.]\n\nTHE CLERGYMAN [calling] Frank!\n\nFRANK. Hallo! [To Praed] The Roman father. [To the clergyman] Yes,\ngov'nor: all right: presently. [To Praed] Look here, Praed: youd better\ngo in to tea. I'll join you directly.\n\nPRAED. Very good. [He goes into the cottage].\n\n[The clergyman remains outside the gate, with his hands on the top of\nit. The Rev. Samuel Gardner, a beneficed clergyman of the Established\nChurch, is over 50. Externally he is pretentious, booming, noisy,\nimportant. Really he is that obsolescent phenomenon the fool of the\nfamily dumped on the Church by his father the patron, clamorously\nasserting himself as father and clergyman without being able to command\nrespect in either capacity.]\n\nREV. S. Well, sir. Who are your friends here, if I may ask?\n\nFRANK. Oh, it's all right, gov'nor! Come in.\n\nREV. S. No, sir; not until I know whose garden I am entering.\n\nFRANK. It's all right. It's Miss Warren's.\n\nREV. S. I have not seen her at church since she came.\n\nFRANK. Of course not: she's a third wrangler. Ever so intellectual. Took\na higher degree than you did; so why should she go to hear you preach?\n\nREV. S. Don't be disrespectful, sir.\n\nFRANK. Oh, it don't matter: nobody hears us. Come in. [He opens the gate,\nunceremoniously pulling his father with it into the garden]. I want to\nintroduce you to her. Do you remember the advice you gave me last July,\ngov'nor?\n\nREV. S. [severely] Yes. I advised you to conquer your idleness and\nflippancy, and to work your way into an honorable profession and live on\nit and not upon me.\n\nFRANK. No: thats what you thought of afterwards. What you actually said\nwas that since I had neither brains nor money, I'd better turn my good\nlooks to account by marrying someone with both. Well, look here. Miss\nWarren has brains: you can't deny that.\n\nREV. S. Brains are not everything.\n\nFRANK. No, of course not: theres the money--\n\nREV. S. [interrupting him austerely] I was not thinking of money, sir. I\nwas speaking of higher things. Social position, for instance.\n\nFRANK. I don't care a rap about that.\n\nREV. S. But I do, sir.\n\nFRANK. Well, nobody wants y o u to marry her. Anyhow, she has what\namounts to a high Cambridge degree; and she seems to have as much money\nas she wants.\n\nREV. S. [sinking into a feeble vein of humor] I greatly doubt whether\nshe has as much money as y o u will want.\n\nFRANK. Oh, come: I havn't been so very extravagant. I live ever so\nquietly; I don't drink; I don't bet much; and I never go regularly to the\nrazzle-dazzle as you did when you were my age.\n\nREV. S. [booming hollowly] Silence, sir.\n\nFRANK. Well, you told me yourself, when I was making every such an ass\nof myself about the barmaid at Redhill, that you once offered a woman\nfifty pounds for the letters you wrote to her when--\n\nREV. S. [terrified] Sh-sh-sh, Frank, for Heaven's sake! [He looks round\napprehensively Seeing no one within earshot he plucks up courage to boom\nagain, but more subduedly]. You are taking an ungentlemanly advantage of\nwhat I confided to you for your own good, to save you from an error you\nwould have repented all your life long. Take warning by your father's\nfollies, sir; and don't make them an excuse for your own.\n\nFRANK. Did you ever hear the story of the Duke of Wellington and his\nletters?\n\nREV. S. No, sir; and I don't want to hear it.\n\nFRANK. The old Iron Duke didn't throw away fifty pounds: not he. He\njust wrote: \"Dear Jenny: publish and be damned! Yours affectionately,\nWellington.\" Thats what you should have done.\n\nREV. S. [piteously] Frank, my boy: when I wrote those letters I put\nmyself into that woman's power. When I told you about them I put myself,\nto some extent, I am sorry to say, in your power. She refused my money\nwith these words, which I shall never forget. \"Knowledge is power\" she\nsaid; \"and I never sell power.\"\n\nThats more than twenty years ago; and she has never made use of her\npower or caused me a moment's uneasiness. You are behaving worse to me\nthan she did, Frank.\n\nFRANK. Oh yes I dare say! Did you ever preach at her the way you preach\nat me every day?\n\nREV. S. [wounded almost to tears] I leave you, sir. You are\nincorrigible. [He turns towards the gate].\n\nFRANK [utterly unmoved] Tell them I shan't be home to tea, will you,\ngov'nor, like a good fellow? [He moves towards the cottage door and is\nmet by Praed and Vivie coming out].\n\nVIVIE [to Frank] Is that your father, Frank? I do so want to meet him.\n\nFRANK. Certainly. [Calling after his father] Gov'nor. Youre wanted. [The\nparson turns at the gate, fumbling nervously at his hat. Praed crosses\nthe garden to the opposite side, beaming in anticipation of civilities].\nMy father: Miss Warren.\n\nVIVIE [going to the clergyman and shaking his hand] Very glad to see\nyou here, Mr Gardner. [Calling to the cottage] Mother: come along: youre\nwanted.\n\n[Mrs Warren appears on the threshold, and is immediately transfixed,\nrecognizing the clergyman.]\n\nVIVIE [continuing] Let me introduce--\n\nMRS WARREN [swooping on the Reverend Samuel] Why it's Sam Gardner, gone\ninto the Church! Well, I never! Don't you know us, Sam? This is George\nCrofts, as large as life and twice as natural. Don't you remember me?\n\nREV. S. [very red] I really--er--\n\nMRS WARREN. Of course you do. Why, I have a whole album of your letters\nstill: I came across them only the other day.\n\nREV. S. [miserably confused] Miss Vavasour, I believe.\n\nMRS WARREN [correcting him quickly in a loud whisper] Tch! Nonsense! Mrs\nWarren: don't you see my daughter there?\n\n\n\n\nACT II\n\n\n[Inside the cottage after nightfall. Looking eastward from within\ninstead of westward from without, the latticed window, with its curtains\ndrawn, is now seen in the middle of the front wall of the cottage, with\nthe porch door to the left of it. In the left-hand side wall is the door\nleading to the kitchen. Farther back against the same wall is a dresser\nwith a candle and matches on it, and Frank's rifle standing beside them,\nwith the barrel resting in the plate-rack. In the centre a table stands\nwith a lighted lamp on it. Vivie's books and writing materials are on a\ntable to the right of the window, against the wall. The fireplace is on\nthe right, with a settle: there is no fire. Two of the chairs are set\nright and left of the table.]\n\n[The cottage door opens, shewing a fine starlit night without; and Mrs\nWarren, her shoulders wrapped in a shawl borrowed from Vivie, enters,\nfollowed by Frank, who throws his cap on the window seat. She has had\nenough of walking, and gives a gasp of relief as she unpins her hat;\ntakes it off; sticks the pin through the crown; and puts it on the\ntable.]\n\nMRS WARREN. O Lord! I don't know which is the worst of the country, the\nwalking or the sitting at home with nothing to do. I could do with a\nwhisky and soda now very well, if only they had such a things in this\nplace.\n\nFRANK. Perhaps Vivie's got some.\n\nMRS WARREN. Nonsense! What would a young girl like her be doing with\nsuch things! Never mind: it don't matter. I wonder how she passes her\ntime here! I'd a good deal rather be in Vienna.\n\nFRANK. Let me take you there. [He helps her to take off her shawl,\ngallantly giving her shoulders a very perceptible squeeze as he does\nso].\n\nMRS WARREN. Ah! would you? I'm beginning to think youre a chip of the\nold block.\n\nFRANK. Like the gov'nor, eh? [He hangs the shawl on the nearest chair,\nand sits down].\n\nMRS WARREN. Never you mind. What do you know about such things?\n\nYoure only a boy. [She goes to the hearth to be farther from\ntemptation].\n\nFRANK. Do come to Vienna with me? It'd be ever such larks.\n\nMRS WARREN. No, thank you. Vienna is no place for you--at least not\nuntil youre a little older. [She nods at him to emphasize this piece of\nadvice. He makes a mock-piteous face, belied by his laughing eyes.\nShe looks at him; then comes back to him]. Now, look here, little boy\n[taking his face in her hands and turning it up to her]: I know you\nthrough and through by your likeness to your father, better than you\nknow yourself. Don't you go taking any silly ideas into your head about\nme. Do you hear?\n\nFRANK [gallantly wooing her with his voice] Can't help it, my dear Mrs\nWarren: it runs in the family.\n\n[She pretends to box his ears; then looks at the pretty laughing\nupturned face of a moment, tempted. At last she kisses him, and\nimmediately turns away, out of patience with herself.]\n\nMRS WARREN. There! I shouldn't have done that. I _am_ wicked. Never you\nmind, my dear: it's only a motherly kiss. Go and make love to Vivie.\n\nFRANK. So I have.\n\nMRS WARREN [turning on him with a sharp note of alarm in her voice]\nWhat!\n\nFRANK. Vivie and I are ever such chums.\n\nMRS WARREN. What do you mean? Now see here: I won't have any young scamp\ntampering with my little girl. Do you hear? I won't have it.\n\nFRANK [quite unabashed] My dear Mrs Warren: don't you be alarmed. My\nintentions are honorable: ever so honorable; and your little girl is\njolly well able to take care of herself. She don't need looking after\nhalf so much as her mother. She ain't so handsome, you know.\n\nMRS WARREN [taken aback by his assurance] Well, you have got a nice\nhealthy two inches of cheek all over you. I don't know where you got it.\nNot from your father, anyhow.\n\nCROFTS [in the garden] The gipsies, I suppose?\n\nREV. S. [replying] The broomsquires are far worse.\n\nMRS WARREN [to Frank] S-sh! Remember! you've had your warning.\n\n[Crofts and the Reverend Samuel Gardner come in from the garden, the\nclergyman continuing his conversation as he enters.]\n\nREV. S. The perjury at the Winchester assizes is deplorable.\n\nMRS WARREN. Well? what became of you two? And wheres Praddy and Vivie?\n\nCROFTS [putting his hat on the settle and his stick in the chimney\ncorner] They went up the hill. We went to the village. I wanted a drink.\n[He sits down on the settle, putting his legs up along the seat].\n\nMRS WARREN. Well, she oughtn't to go off like that without telling me.\n[To Frank] Get your father a chair, Frank: where are your manners?\n[Frank springs up and gracefully offers his father his chair; then takes\nanother from the wall and sits down at the table, in the middle, with\nhis father on his right and Mrs Warren on his left]. George: where are\nyou going to stay to-night? You can't stay here. And whats Praddy going\nto do?\n\nCROFTS. Gardner'll put me up.\n\nMRS WARREN. Oh, no doubt you've taken care of yourself! But what about\nPraddy?\n\nCROFTS. Don't know. I suppose he can sleep at the inn.\n\nMRS WARREN. Havn't you room for him, Sam?\n\nREV. S. Well--er--you see, as rector here, I am not free to do as I\nlike. Er--what is Mr Praed's social position?\n\nMRS WARREN. Oh, he's all right: he's an architect. What an old\nstick-in-the-mud you are, Sam!\n\nFRANK. Yes, it's all right, gov'nor. He built that place down in Wales\nfor the Duke. Caernarvon Castle they call it. You must have heard of it.\n[He winks with lightning smartness at Mrs Warren, and regards his father\nblandly].\n\nREV. S. Oh, in that case, of course we shall only be too happy. I\nsuppose he knows the Duke personally.\n\nFRANK. Oh, ever so intimately! We can stick him in Georgina's old room.\n\nMRS WARREN. Well, thats settled. Now if those two would only come in and\nlet us have supper. Theyve no right to stay out after dark like this.\n\nCROFTS [aggressively] What harm are they doing you?\n\nMRS WARREN. Well, harm or not, I don't like it.\n\nFRANK. Better not wait for them, Mrs Warren. Praed will stay out as\nlong as possible. He has never known before what it is to stray over the\nheath on a summer night with my Vivie.\n\nCROFTS [sitting up in some consternation] I say, you know! Come!\n\nREV. S. [rising, startled out of his professional manner into real force\nand sincerity] Frank, once and for all, it's out of the question. Mrs\nWarren will tell you that it's not to be thought of.\n\nCROFTS. Of course not.\n\nFRANK [with enchanting placidity] Is that so, Mrs Warren?\n\nMRS WARREN [reflectively] Well, Sam, I don't know. If the girl wants to\nget married, no good can come of keeping her unmarried.\n\nREV. S. [astounded] But married to _him!_--your daughter to my son! Only\nthink: it's impossible.\n\nCROFTS. Of course it's impossible. Don't be a fool, Kitty.\n\nMRS WARREN [nettled] Why not? Isn't my daughter good enough for your son?\n\nREV. S. But surely, my dear Mrs Warren, you know the reasons--\n\nMRS WARREN [defiantly] I know no reasons. If you know any, you can tell\nthem to the lad, or to the girl, or to your congregation, if you like.\n\nREV. S. [collapsing helplessly into his chair] You know very well that I\ncouldn't tell anyone the reasons. But my boy will believe me when I tell\nhim there a r e reasons.\n\nFRANK. Quite right, Dad: he will. But has your boy's conduct ever been\ninfluenced by your reasons?\n\nCROFTS. You can't marry her; and thats all about it. [He gets up\nand stands on the hearth, with his back to the fireplace, frowning\ndeterminedly].\n\nMRS WARREN [turning on him sharply] What have you got to do with it,\npray?\n\nFRANK [with his prettiest lyrical cadence] Precisely what I was going to\nask, myself, in my own graceful fashion.\n\nCROFTS [to Mrs Warren] I suppose you don't want to marry the girl to a\nman younger than herself and without either a profession or twopence to\nkeep her on. Ask Sam, if you don't believe me. [To the parson] How much\nmore money are you going to give him?\n\nREV. S. Not another penny. He has had his patrimony; and he spent the\nlast of it in July. [Mrs Warren's face falls].\n\nCROFTS [watching her] There! I told you. [He resumes his place on\nthe settle and puts his legs on the seat again, as if the matter were\nfinally disposed of].\n\nFRANK [plaintively] This is ever so mercenary. Do you suppose Miss\nWarren's going to marry for money? If we love one another--\n\nMRS WARREN. Thank you. Your love's a pretty cheap commodity, my lad.\nIf you have no means of keeping a wife, that settles it; you can't have\nVivie.\n\nFRANK [much amused] What do y o u say, gov'nor, eh?\n\nREV. S. I agree with Mrs Warren.\n\nFRANK. And good old Crofts has already expressed his opinion.\n\nCROFTS [turning angrily on his elbow] Look here: I want none of your\ncheek.\n\nFRANK [pointedly] I'm e v e r so sorry to surprise you, Crofts; but you\nallowed yourself the liberty of speaking to me like a father a moment\nago. One father is enough, thank you.\n\nCROFTS [contemptuously] Yah! [He turns away again].\n\nFRANK [rising] Mrs Warren: I cannot give my Vivie up, even for your\nsake.\n\nMRS WARREN [muttering] Young scamp!\n\nFRANK [continuing] And as you no doubt intend to hold out other\nprospects to her, I shall lose no time in placing my case before her.\n[They stare at him; and he begins to declaim gracefully] He either fears\nhis fate too much, Or his deserts are small, That dares not put it to\nthe touch, To gain or lose it all.\n\n[The cottage doors open whilst he is reciting; and Vivie and Praed\ncome in. He breaks off. Praed puts his hat on the dresser. There is an\nimmediate improvement in the company's behavior. Crofts takes down his\nlegs from the settle and pulls himself together as Praed joins him at\nthe fireplace. Mrs Warren loses her ease of manner and takes refuge in\nquerulousness.]\n\nMRS WARREN. Wherever have you been, Vivie?\n\nVIVIE [taking off her hat and throwing it carelessly on the table] On\nthe hill.\n\nMRS WARREN. Well, you shouldn't go off like that without letting me know.\nHow could I tell what had become of you? And night coming on too!\n\nVIVIE [going to the door of the kitchen and opening it, ignoring her\nmother] Now, about supper? [All rise except Mrs Warren] We shall be\nrather crowded in here, I'm afraid.\n\nMRS WARREN. Did you hear what I said, Vivie?\n\nVIVIE [quietly] Yes, mother. [Reverting to the supper difficulty] How\nmany are we? [Counting] One, two, three, four, five, six. Well, two will\nhave to wait until the rest are done: Mrs Alison has only plates and\nknives for four.\n\nPRAED. Oh, it doesn't matter about me. I--\n\nVIVIE. You have had a long walk and are hungry, Mr Praed: you shall have\nyour supper at once. I can wait myself. I want one person to wait with\nme. Frank: are you hungry?\n\nFRANK. Not the least in the world. Completely off my peck, in fact.\n\nMRS WARREN [to Crofts] Neither are you, George. You can wait.\n\nCROFTS. Oh, hang it, I've eaten nothing since tea-time. Can't Sam do it?\n\nFRANK. Would you starve my poor father?\n\nREV. S. [testily] Allow me to speak for myself, sir. I am perfectly\nwilling to wait.\n\nVIVIE [decisively] There's no need. Only two are wanted. [She opens\nthe door of the kitchen]. Will you take my mother in, Mr Gardner. [The\nparson takes Mrs Warren; and they pass into the kitchen. Praed and\nCrofts follow. All except Praed clearly disapprove of the arrangement,\nbut do not know how to resist it. Vivie stands at the door looking in\nat them]. Can you squeeze past to that corner, Mr Praed: it's rather a\ntight fit. Take care of your coat against the white-wash: that right.\nNow, are you all comfortable?\n\nPRAED [within] Quite, thank you.\n\nMRS WARREN [within] Leave the door open, dearie. [Vivie frowns; but\nFrank checks her with a gesture, and steals to the cottage door, which\nhe softly sets wide open]. Oh Lor, what a draught! Youd better shut it,\ndear.\n\n[Vivie shuts it with a slam, and then, noting with disgust that her\nmother's hat and shawl are lying about, takes them tidily to the window\nseat, whilst Frank noiselessly shuts the cottage door.]\n\nFRANK [exulting] Aha! Got rid of em. Well, Vivvums: what do you think of\nmy governor?\n\nVIVIE [preoccupied and serious] I've hardly spoken to him. He doesn't\nstrike me as a particularly able person.\n\nFRANK. Well, you know, the old man is not altogether such a fool as he\nlooks. You see, he was shoved into the Church, rather; and in trying to\nlive up to it he makes a much bigger ass of himself than he really is. I\ndon't dislike him as much as you might expect. He means well. How do you\nthink youll get on with him?\n\nVIVIE [rather grimly] I don't think my future life will be much concerned\nwith him, or with any of that old circle of my mother's, except perhaps\nPraed. [She sits down on the settle] What do you think of my mother?\n\nFRANK. Really and truly?\n\nVIVIE. Yes, really and truly.\n\nFRANK. Well, she's ever so jolly. But she's rather a caution, isn't she?\nAnd Crofts! Oh, my eye, Crofts! [He sits beside her].\n\nVIVIE. What a lot, Frank!\n\nFRANK. What a crew!\n\nVIVIE [with intense contempt for them] If I thought that _I_ was like\nthat--that I was going to be a waster, shifting along from one meal to\nanother with no purpose, and no character, and no grit in me, I'd open\nan artery and bleed to death without one moment's hesitation.\n\nFRANK. Oh no, you wouldn't. Why should they take any grind when they can\nafford not to? I wish I had their luck. No: what I object to is their\nform. It isn't the thing: it's slovenly, ever so slovenly.\n\nVIVIE. Do you think your form will be any better when youre as old as\nCrofts, if you don't work?\n\nFRANK. Of course I do. Ever so much better. Vivvums mustn't lecture: her\nlittle boy's incorrigible. [He attempts to take her face caressingly in\nhis hands].\n\nVIVIE [striking his hands down sharply] Off with you: Vivvums is not in\na humor for petting her little boy this evening. [She rises and comes\nforward to the other side of the room].\n\nFRANK [following her] How unkind!\n\nVIVIE [stamping at him] Be serious. I'm serious.\n\nFRANK. Good. Let us talk learnedly, Miss Warren: do you know that all\nthe most advanced thinkers are agreed that half the diseases of modern\ncivilization are due to starvation of the affections of the young. Now,\n_I_--\n\nVIVIE [cutting him short] You are very tiresome. [She opens the inner\ndoor] Have you room for Frank there? He's complaining of starvation.\n\nMRS WARREN [within] Of course there is [clatter of knives and glasses\nas she moves the things on the table]. Here! theres room now beside me.\nCome along, Mr Frank.\n\nFRANK. Her little boy will be ever so even with his Vivvums for this.\n[He passes into the kitchen].\n\nMRS WARREN [within] Here, Vivie: come on you too, child. You must be\nfamished. [She enters, followed by Crofts, who holds the door open with\nmarked deference. She goes out without looking at him; and he shuts the\ndoor after her]. Why George, you can't be done: you've eaten nothing. Is\nthere anything wrong with you?\n\nCROFTS. Oh, all I wanted was a drink. [He thrusts his hands in his\npockets, and begins prowling about the room, restless and sulky].\n\nMRS WARREN. Well, I like enough to eat. But a little of that cold\nbeef and cheese and lettuce goes a long way. [With a sigh of only half\nrepletion she sits down lazily on the settle].\n\nCROFTS. What do you go encouraging that young pup for?\n\nMRS WARREN [on the alert at once] Now see here, George: what are you\nup to about that girl? I've been watching your way of looking at her.\nRemember: I know you and what your looks mean.\n\nCROFTS. Theres no harm in looking at her, is there?\n\nMRS WARREN. I'd put you out and pack you back to London pretty soon if\nI saw any of your nonsense. My girl's little finger is more to me than\nyour whole body and soul. [Crofts receives this with a sneering grin.\nMrs Warren, flushing a little at her failure to impose on him in the\ncharacter of a theatrically devoted mother, adds in a lower key] Make\nyour mind easy: the young pup has no more chance than you have.\n\nCROFTS. Mayn't a man take an interest in a girl?\n\nMRS WARREN. Not a man like you.\n\nCROFTS. How old is she?\n\nMRS WARREN. Never you mind how old she is.\n\nCROFTS. Why do you make such a secret of it?\n\nMRS WARREN. Because I choose.\n\nCROFTS. Well, I'm not fifty yet; and my property is as good as it ever\nwas--\n\nMRS [interrupting him] Yes; because youre as stingy as youre vicious.\n\nCROFTS [continuing] And a baronet isn't to be picked up every day.\n\nNo other man in my position would put up with you for a mother-in-law.\nWhy shouldn't she marry me?\n\nMRS WARREN. You!\n\nCROFTS. We three could live together quite comfortably. I'd die before\nher and leave her a bouncing widow with plenty of money. Why not? It's\nbeen growing in my mind all the time I've been walking with that fool\ninside there.\n\nMRS WARREN [revolted] Yes; it's the sort of thing that _would_ grow in\nyour mind.\n\n[He halts in his prowling; and the two look at one another, she\nsteadfastly, with a sort of awe behind her contemptuous disgust: he\nstealthily, with a carnal gleam in his eye and a loose grin.]\n\nCROFTS [suddenly becoming anxious and urgent as he sees no sign of\nsympathy in her] Look here, Kitty: youre a sensible woman: you needn't\nput on any moral airs. I'll ask no more questions; and you need answer\nnone. I'll settle the whole property on her; and if you want a checque\nfor yourself on the wedding day, you can name any figure you like--in\nreason.\n\nMRS WARREN. So it's come to that with you, George, like all the other\nworn-out old creatures!\n\nCROFTS [savagely] Damn you!\n\n[Before she can retort the door of the kitchen is opened; and the\nvoices of the others are heard returning. Crofts, unable to recover his\npresence of mind, hurries out of the cottage. The clergyman appears at\nthe kitchen door.]\n\nREV. S. [looking round] Where is Sir George?\n\nMRS WARREN. Gone out to have a pipe. [The clergyman takes his hat from\nthe table, and joins Mrs Warren at the fireside. Meanwhile, Vivie comes\nin, followed by Frank, who collapses into the nearest chair with an air\nof extreme exhaustion. Mrs Warren looks round at Vivie and says, with\nher affectation of maternal patronage even more forced than usual] Well,\ndearie: have you had a good supper?\n\nVIVIE. You know what Mrs Alison's suppers are. [She turns to Frank and\npets him] Poor Frank! was all the beef gone? did it get nothing but\nbread and cheese and ginger beer? [Seriously, as if she had done quite\nenough trifling for one evening] Her butter is really awful. I must get\nsome down from the stores.\n\nFRANK. Do, in Heaven's name!\n\n[Vivie goes to the writing-table and makes a memorandum to order the\nbutter. Praed comes in from the kitchen, putting up his handkerchief,\nwhich he has been using as a napkin.]\n\nREV. S. Frank, my boy: it is time for us to be thinking of home.\n\nYour mother does not know yet that we have visitors.\n\nPRAED. I'm afraid we're giving trouble.\n\nFRANK [rising] Not the least in the world: my mother will be delighted\nto see you. She's a genuinely intellectual artistic woman; and she sees\nnobody here from one year's end to another except the gov'nor; so you\ncan imagine how jolly dull it pans out for her. [To his father] Y o u\nr e not intellectual or artistic: are you pater? So take Praed home at\nonce; and I'll stay here and entertain Mrs Warren. Youll pick up Crofts\nin the garden. He'll be excellent company for the bull-pup.\n\nPRAED [taking his hat from the dresser, and coming close to Frank] Come\nwith us, Frank. Mrs Warren has not seen Miss Vivie for a long time; and\nwe have prevented them from having a moment together yet.\n\nFRANK [quite softened, and looking at Praed with romantic admiration]\nOf course. I forgot. Ever so thanks for reminding me. Perfect gentleman,\nPraddy. Always were. My ideal through life. [He rises to go, but\npauses a moment between the two older men, and puts his hand on Praed's\nshoulder]. Ah, if you had only been my father instead of this unworthy\nold man! [He puts his other hand on his father's shoulder].\n\nREV. S. [blustering] Silence, sir, silence: you are profane.\n\nMRS WARREN [laughing heartily] You should keep him in better order, Sam.\nGood-night. Here: take George his hat and stick with my compliments.\n\nREV. S. [taking them] Good-night. [They shake hands. As he passes Vivie\nhe shakes hands with her also and bids her good-night. Then, in booming\ncommand, to Frank] Come along, sir, at once. [He goes out].\n\nMRS WARREN. Byebye, Praddy.\n\nPRAED. Byebye, Kitty.\n\n[They shake hands affectionately and go out together, she accompanying\nhim to the garden gate.]\n\nFRANK [to Vivie] Kissums?\n\nVIVIE [fiercely] No. I hate you. [She takes a couple of books and some\npaper from the writing-table, and sits down with them at the middle\ntable, at the end next the fireplace].\n\nFRANK [grimacing] Sorry. [He goes for his cap and rifle. Mrs Warren\nreturns. He takes her hand] Good-night, dear Mrs Warren. [He kisses her\nhand. She snatches it away, her lips tightening, and looks more than\nhalf disposed to box his ears. He laughs mischievously and runs off,\nclapping-to the door behind him].\n\nMRS WARREN [resigning herself to an evening of boredom now that the men\nare gone] Did you ever in your life hear anyone rattle on so? Isn't he a\ntease? [She sits at the table]. Now that I think of it, dearie, don't you\ngo encouraging him. I'm sure he's a regular good-for-nothing.\n\nVIVIE [rising to fetch more books] I'm afraid so. Poor Frank! I shall\nhave to get rid of him; but I shall feel sorry for him, though he's\nnot worth it. That man Crofts does not seem to me to be good for much\neither: is he? [She throws the books on the table rather roughly].\n\nMRS WARREN [galled by Vivie's indifference] What do you know of men,\nchild, to talk that way of them? Youll have to make up your mind to see\na good deal of Sir George Crofts, as he's a friend of mine.\n\nVIVIE [quite unmoved] Why? [She sits down and opens a book]. Do you\nexpect that we shall be much together? You and I, I mean?\n\nMRS WARREN [staring at her] Of course: until youre married. Youre not\ngoing back to college again.\n\nVIVIE. Do you think my way of life would suit you? I doubt it.\n\nMRS WARREN. Y o u r way of life! What do you mean?\n\nVIVIE [cutting a page of her book with the paper knife on her\nchatelaine] Has it really never occurred to you, mother, that I have a\nway of life like other people?\n\nMRS WARREN. What nonsense is this youre trying to talk? Do you want to\nshew your independence, now that youre a great little person at school?\nDon't be a fool, child.\n\nVIVIE [indulgently] Thats all you have to say on the subject, is it,\nmother?\n\nMRS WARREN [puzzled, then angry] Don't you keep on asking me questions\nlike that. [Violently] Hold your tongue. [Vivie works on, losing no\ntime, and saying nothing]. You and your way of life, indeed! What next?\n[She looks at Vivie again. No reply].\n\nYour way of life will be what I please, so it will. [Another pause].\nIve been noticing these airs in you ever since you got that tripos or\nwhatever you call it. If you think I'm going to put up with them, youre\nmistaken; and the sooner you find it out, the better. [Muttering] All I\nhave to say on the subject, indeed! [Again raising her voice angrily] Do\nyou know who youre speaking to, Miss?\n\nVIVIE [looking across at her without raising her head from her book] No.\nWho are you? What are you?\n\nMRS WARREN [rising breathless] You young imp!\n\nVIVIE. Everybody knows my reputation, my social standing, and the\nprofession I intend to pursue. I know nothing about you. What is that\nway of life which you invite me to share with you and Sir George Crofts,\npray?\n\nMRS WARREN. Take care. I shall do something I'll be sorry for after, and\nyou too.\n\nVIVIE [putting aside her books with cool decision] Well, let us drop the\nsubject until you are better able to face it. [Looking critically at her\nmother] You want some good walks and a little lawn tennis to set you up.\nYou are shockingly out of condition: you were not able to manage twenty\nyards uphill today without stopping to pant; and your wrists are mere\nrolls of fat. Look at mine. [She holds out her wrists].\n\nMRS WARREN [after looking at her helplessly, begins to whimper] Vivie--\n\nVIVIE [springing up sharply] Now pray don't begin to cry. Anything but\nthat. I really cannot stand whimpering. I will go out of the room if you\ndo.\n\nMRS WARREN [piteously] Oh, my darling, how can you be so hard on me?\nHave I no rights over you as your mother?\n\nVIVIE. A r e you my mother?\n\nMRS WARREN. _Am_ I your mother? Oh, Vivie!\n\nVIVIE. Then where are our relatives? my father? our family friends? You\nclaim the rights of a mother: the right to call me fool and child; to\nspeak to me as no woman in authority over me at college dare speak to\nme; to dictate my way of life; and to force on me the acquaintance of\na brute whom anyone can see to be the most vicious sort of London man\nabout town. Before I give myself the trouble to resist such claims, I\nmay as well find out whether they have any real existence.\n\nMRS WARREN [distracted, throwing herself on her knees] Oh no, no.\n\nStop, stop. I _am_ your mother: I swear it. Oh, you can't mean to turn on\nme--my own child! it's not natural. You believe me, don't you? Say you\nbelieve me.\n\nVIVIE. Who was my father?\n\nMRS WARREN. You don't know what youre asking. I can't tell you.\n\nVIVIE [determinedly] Oh yes you can, if you like. I have a right to\nknow; and you know very well that I have that right. You can refuse\nto tell me if you please; but if you do, you will see the last of me\ntomorrow morning.\n\nMRS WARREN. Oh, it's too horrible to hear you talk like that. You\nwouldn't--you _couldn't_ leave me.\n\nVIVIE [ruthlessly] Yes, without a moment's hesitation, if you trifle\nwith me about this. [Shivering with disgust] How can I feel sure that I\nmay not have the contaminated blood of that brutal waster in my veins?\n\nMRS WARREN. No, no. On my oath it's not he, nor any of the rest that you\nhave ever met. I'm certain of that, at least.\n\n[Vivie's eyes fasten sternly on her mother as the significance of this\nflashes on her.]\n\nVIVIE [slowly] You are certain of that, at _least_. Ah! You mean that\nthat is all you are certain of. [Thoughtfully] I see. [Mrs Warren buries\nher face in her hands]. Don't do that, mother: you know you don't feel\nit a bit. [Mrs Warren takes down her hands and looks up deplorably\nat Vivie, who takes out her watch and says] Well, that is enough for\ntonight. At what hour would you like breakfast? Is half-past eight too\nearly for you?\n\nMRS WARREN [wildly] My God, what sort of woman are you?\n\nVIVIE [coolly] The sort the world is mostly made of, I should hope.\nOtherwise I don't understand how it gets its business done.\n\nCome [taking her mother by the wrist and pulling her up pretty\nresolutely]: pull yourself together. Thats right.\n\nMRS WARREN [querulously] Youre very rough with me, Vivie.\n\nVIVIE. Nonsense. What about bed? It's past ten.\n\nMRS WARREN [passionately] Whats the use of my going to bed? Do you think\nI could sleep?\n\nVIVIE. Why not? I shall.\n\nMRS WARREN. You! you've no heart. [She suddenly breaks out vehemently in\nher natural tongue--the dialect of a woman of the people--with all her\naffectations of maternal authority and conventional manners gone, and an\noverwhelming inspiration of true conviction and scorn in her] Oh, I wont\nbear it: I won't put up with the injustice of it. What right have you to\nset yourself up above me like this? You boast of what you are to me--to\n_me_, who gave you a chance of being what you are. What chance had I?\nShame on you for a bad daughter and a stuck-up prude!\n\nVIVIE [sitting down with a shrug, no longer confident; for her replies,\nwhich have sounded sensible and strong to her so far, now begin to ring\nrather woodenly and even priggishly against the new tone of her mother]\nDon't think for a moment I set myself above you in any way. You attacked\nme with the conventional authority of a mother: I defended myself with\nthe conventional superiority of a respectable woman. Frankly, I am not\ngoing to stand any of your nonsense; and when you drop it I shall not\nexpect you to stand any of mine. I shall always respect your right to\nyour own opinions and your own way of life.\n\nMRS WARREN. My own opinions and my own way of life! Listen to her\ntalking! Do you think I was brought up like you? able to pick and choose\nmy own way of life? Do you think I did what I did because I liked it, or\nthought it right, or wouldn't rather have gone to college and been a lady\nif I'd had the chance?\n\nVIVIE. Everybody has some choice, mother. The poorest girl alive may\nnot be able to choose between being Queen of England or Principal\nof Newnham; but she can choose between ragpicking and flowerselling,\naccording to her taste. People are always blaming circumstances for what\nthey are. I don't believe in circumstances. The people who get on in\nthis world are the people who get up and look for the circumstances they\nwant, and, if they can't find them, make them.\n\nMRS WARREN. Oh, it's easy to talk, isn't it? Here! would you like to know\nwhat _my_ circumstances were?\n\nVIVIE. Yes: you had better tell me. Won't you sit down?\n\nMRS WARREN. Oh, I'll sit down: don't you be afraid. [She plants her chair\nfarther forward with brazen energy, and sits down. Vivie is impressed in\nspite of herself]. D'you know what your gran'mother was?\n\nVIVIE. No.\n\nMRS WARREN. No, you don't. I do. She called herself a widow and had a\nfried-fish shop down by the Mint, and kept herself and four daughters\nout of it. Two of us were sisters: that was me and Liz; and we were both\ngood-looking and well made. I suppose our father was a well-fed man:\nmother pretended he was a gentleman; but I don't know. The other two\nwere only half sisters: undersized, ugly, starved looking, hard working,\nhonest poor creatures: Liz and I would have half-murdered them if\nmother hadn't half-murdered us to keep our hands off them. They were the\nrespectable ones. Well, what did they get by their respectability? I'll\ntell you. One of them worked in a whitelead factory twelve hours a day\nfor nine shillings a week until she died of lead poisoning. She only\nexpected to get her hands a little paralyzed; but she died. The other\nwas always held up to us as a model because she married a Government\nlaborer in the Deptford victualling yard, and kept his room and the\nthree children neat and tidy on eighteen shillings a week--until he took\nto drink. That was worth being respectable for, wasn't it?\n\nVIVIE [now thoughtfully attentive] Did you and your sister think so?\n\nMRS WARREN. Liz didn't, I can tell you: she had more spirit. We both went\nto a church school--that was part of the ladylike airs we gave ourselves\nto be superior to the children that knew nothing and went nowhere--and\nwe stayed there until Liz went out one night and never came back. I\nknow the schoolmistress thought I'd soon follow her example; for\nthe clergyman was always warning me that Lizzie'd end by jumping off\nWaterloo Bridge. Poor fool: that was all he knew about it! But I was\nmore afraid of the whitelead factory than I was of the river; and so\nwould you have been in my place. That clergyman got me a situation as\na scullery maid in a temperance restaurant where they sent out for\nanything you liked. Then I was a waitress; and then I went to the bar\nat Waterloo station: fourteen hours a day serving drinks and washing\nglasses for four shillings a week and my board. That was considered a\ngreat promotion for me. Well, one cold, wretched night, when I was so\ntired I could hardly keep myself awake, who should come up for a half of\nScotch but Lizzie, in a long fur cloak, elegant and comfortable, with a\nlot of sovereigns in her purse.\n\nVIVIE [grimly] My aunt Lizzie!\n\nMRS WARREN. Yes; and a very good aunt to have, too. She's living down\nat Winchester now, close to the cathedral, one of the most respectable\nladies there. Chaperones girls at the country ball, if you please.\nNo river for Liz, thank you! You remind me of Liz a little: she was a\nfirst-rate business woman--saved money from the beginning--never let\nherself look too like what she was--never lost her head or threw away a\nchance. When she saw I'd grown up good-looking she said to me across the\nbar \"What are you doing there, you little fool? wearing out your health\nand your appearance for other people's profit!\" Liz was saving money\nthen to take a house for herself in Brussels; and she thought we two\ncould save faster than one. So she lent me some money and gave me a\nstart; and I saved steadily and first paid her back, and then went into\nbusiness with her as a partner. Why shouldn't I have done it? The house\nin Brussels was real high class: a much better place for a woman to be\nin than the factory where Anne Jane got poisoned. None of the girls were\never treated as I was treated in the scullery of that temperance place,\nor at the Waterloo bar, or at home. Would you have had me stay in them\nand become a worn out old drudge before I was forty?\n\nVIVIE [intensely interested by this time] No; but why did you choose\nthat business? Saving money and good management will succeed in any\nbusiness.\n\nMRS WARREN. Yes, saving money. But where can a woman get the money to\nsave in any other business? Could y o u save out of four shillings a\nweek and keep yourself dressed as well? Not you. Of course, if youre\na plain woman and can't earn anything more; or if you have a turn for\nmusic, or the stage, or newspaper-writing: thats different. But neither\nLiz nor I had any turn for such things at all: all we had was our\nappearance and our turn for pleasing men. Do you think we were such\nfools as to let other people trade in our good looks by employing us\nas shopgirls, or barmaids, or waitresses, when we could trade in them\nourselves and get all the profits instead of starvation wages? Not\nlikely.\n\nVIVIE. You were certainly quite justified--from the business point of\nview.\n\nMRS WARREN. Yes; or any other point of view. What is any respectable\ngirl brought up to do but to catch some rich man's fancy and get the\nbenefit of his money by marrying him?--as if a marriage ceremony\ncould make any difference in the right or wrong of the thing! Oh, the\nhypocrisy of the world makes me sick! Liz and I had to work and save and\ncalculate just like other people; elseways we should be as poor as any\ngood-for-nothing drunken waster of a woman that thinks her luck will\nlast for ever. [With great energy] I despise such people: theyve\nno character; and if theres a thing I hate in a woman, it's want of\ncharacter.\n\nVIVIE. Come now, mother: frankly! Isn't it part of what you call\ncharacter in a woman that she should greatly dislike such a way of\nmaking money?\n\nMRS WARREN. Why, of course. Everybody dislikes having to work and make\nmoney; but they have to do it all the same. I'm sure I've often pitied\na poor girl, tired out and in low spirits, having to try to please some\nman that she doesn't care two straws for--some half-drunken fool that\nthinks he's making himself agreeable when he's teasing and worrying and\ndisgusting a woman so that hardly any money could pay her for putting up\nwith it. But she has to bear with disagreeables and take the rough with\nthe smooth, just like a nurse in a hospital or anyone else. It's not\nwork that any woman would do for pleasure, goodness knows; though to\nhear the pious people talk you would suppose it was a bed of roses.\n\nVIVIE. Still, you consider it worth while. It pays.\n\nMRS WARREN. Of course it's worth while to a poor girl, if she can resist\ntemptation and is good-looking and well conducted and sensible. It's far\nbetter than any other employment open to her.\n\nI always thought that it oughtn't to be. It _can't_ be right, Vivie, that\nthere shouldn't be better opportunities for women. I stick to that: it's\nwrong. But it's so, right or wrong; and a girl must make the best of it.\nBut of course it's not worth while for a lady. If you took to it youd be\na fool; but I should have been a fool if I'd taken to anything else.\n\nVIVIE [more and more deeply moved] Mother: suppose we were both as poor\nas you were in those wretched old days, are you quite sure that you\nwouldn't advise me to try the Waterloo bar, or marry a laborer, or even\ngo into the factory?\n\nMRS WARREN [indignantly] Of course not. What sort of mother do you take\nme for! How could you keep your self-respect in such starvation\nand slavery? And whats a woman worth? whats life worth? without\nself-respect! Why am I independent and able to give my daughter\na first-rate education, when other women that had just as good\nopportunities are in the gutter? Because I always knew how to respect\nmyself and control myself. Why is Liz looked up to in a cathedral town?\nThe same reason. Where would we be now if we'd minded the clergyman's\nfoolishness? Scrubbing floors for one and sixpence a day and nothing to\nlook forward to but the workhouse infirmary. Don't you be led astray by\npeople who don't know the world, my girl. The only way for a woman to\nprovide for herself decently is for her to be good to some man that can\nafford to be good to her. If she's in his own station of life, let her\nmake him marry her; but if she's far beneath him she can't expect it: why\nshould she? it wouldn't be for her own happiness. Ask any lady in London\nsociety that has daughters; and she'll tell you the same, except that I\ntell you straight and she'll tell you crooked. Thats all the difference.\n\nVIVIE [fascinated, gazing at her] My dear mother: you are a wonderful\nwoman: you are stronger than all England. And are you really and truly\nnot one wee bit doubtful--or--or--ashamed?\n\nMRS WARREN. Well, of course, dearie, it's only good manners to be\nashamed of it: it's expected from a woman. Women have to pretend to\nfeel a great deal that they don't feel. Liz used to be angry with me for\nplumping out the truth about it. She used to say that when every woman\ncould learn enough from what was going on in the world before her eyes,\nthere was no need to talk about it to her. But then Liz was such a\nperfect lady! She had the true instinct of it; while I was always a bit\nof a vulgarian. I used to be so pleased when you sent me your photos\nto see that you were growing up like Liz: you've just her ladylike,\ndetermined way. But I can't stand saying one thing when everyone knows\nI mean another. Whats the use in such hypocrisy? If people arrange the\nworld that way for women, theres no good pretending it's arranged the\nother way. No: I never was a bit ashamed really. I consider I had a\nright to be proud of how we managed everything so respectably, and never\nhad a word against us, and how the girls were so well taken care of.\nSome of them did very well: one of them married an ambassador. But of\ncourse now I daren't talk about such things: whatever would they think\nof us! [She yawns]. Oh dear! I do believe I'm getting sleepy after all.\n[She stretches herself lazily, thoroughly relieved by her explosion, and\nplacidly ready for her night's rest].\n\nVIVIE. I believe it is I who will not be able to sleep now. [She goes\nto the dresser and lights the candle. Then she extinguishes the lamp,\ndarkening the room a good deal]. Better let in some fresh air before\nlocking up. [She opens the cottage door, and finds that it is broad\nmoonlight]. What a beautiful night! Look! [She draws the curtains of the\nwindow. The landscape is seen bathed in the radiance of the harvest moon\nrising over Blackdown].\n\nMRS WARREN [with a perfunctory glance at the scene] Yes, dear; but take\ncare you don't catch your death of cold from the night air.\n\nVIVIE [contemptuously] Nonsense.\n\nMRS WARREN [querulously] Oh yes: everything I say is nonsense, according\nto you.\n\nVIVIE [turning to her quickly] No: really that is not so, mother.\n\nYou have got completely the better of me tonight, though I intended it\nto be the other way. Let us be good friends now.\n\nMRS WARREN [shaking her head a little ruefully] So it _has_ been the\nother way. But I suppose I must give in to it. I always got the worst of\nit from Liz; and now I suppose it'll be the same with you.\n\nVIVIE. Well, never mind. Come: good-night, dear old mother. [She takes\nher mother in her arms].\n\nMRS WARREN [fondly] I brought you up well, didn't I, dearie?\n\nVIVIE. You did.\n\nMRS WARREN. And youll be good to your poor old mother for it, won't you?\n\nVIVIE. I will, dear. [Kissing her] Good-night.\n\nMRS WARREN [with unction] Blessings on my own dearie darling! a mother's\nblessing!\n\n[She embraces her daughter protectingly, instinctively looking upward\nfor divine sanction.]\n\n\n\n\nACT III\n\n\n[In the Rectory garden next morning, with the sun shining from a\ncloudless sky. The garden wall has a five-barred wooden gate, wide\nenough to admit a carriage, in the middle. Beside the gate hangs a bell\non a coiled spring, communicating with a pull outside. The carriage\ndrive comes down the middle of the garden and then swerves to its left,\nwhere it ends in a little gravelled circus opposite the Rectory porch.\nBeyond the gate is seen the dusty high road, parallel with the wall,\nbounded on the farther side by a strip of turf and an unfenced pine\nwood. On the lawn, between the house and the drive, is a clipped yew\ntree, with a garden bench in its shade. On the opposite side the garden\nis shut in by a box hedge; and there is a little sundial on the turf,\nwith an iron chair near it. A little path leads through the box hedge,\nbehind the sundial.]\n\n[Frank, seated on the chair near the sundial, on which he has placed the\nmorning paper, is reading The Standard. His father comes from the house,\nred-eyed and shivery, and meets Frank's eye with misgiving.]\n\nFRANK [looking at his watch] Half-past eleven. Nice hour for a rector to\ncome down to breakfast!\n\nREV. S. Don't mock, Frank: don't mock. I am a little--er--[Shivering]--\n\nFRANK. Off color?\n\nREV. S. [repudiating the expression] No, sir: _unwell_ this morning.\nWhere's your mother?\n\nFRANK. Don't be alarmed: she's not here. Gone to town by the 11.13\nwith Bessie. She left several messages for you. Do you feel equal to\nreceiving them now, or shall I wait til you've breakfasted?\n\nREV. S. I h a v e breakfasted, sir. I am surprised at your mother\ngoing to town when we have people staying with us. They'll think it very\nstrange.\n\nFRANK. Possibly she has considered that. At all events, if Crofts is\ngoing to stay here, and you are going to sit up every night with him\nuntil four, recalling the incidents of your fiery youth, it is clearly\nmy mother's duty, as a prudent housekeeper, to go up to the stores and\norder a barrel of whisky and a few hundred siphons.\n\nREV. S. I did not observe that Sir George drank excessively.\n\nFRANK. You were not in a condition to, gov'nor.\n\nREV. S. Do you mean to say that _I_--?\n\nFRANK [calmly] I never saw a beneficed clergyman less sober. The\nanecdotes you told about your past career were so awful that I really\ndon't think Praed would have passed the night under your roof if it hadnt\nbeen for the way my mother and he took to one another.\n\nREV. S. Nonsense, sir. I am Sir George Crofts' host. I must talk to him\nabout something; and he has only one subject. Where is Mr Praed now?\n\nFRANK. He is driving my mother and Bessie to the station.\n\nREV. S. Is Crofts up yet?\n\nFRANK. Oh, long ago. He hasn't turned a hair: he's in much better\npractice than you. Has kept it up ever since, probably. He's taken\nhimself off somewhere to smoke.\n\n[Frank resumes his paper. The parson turns disconsolately towards the\ngate; then comes back irresolutely.]\n\nREV. S. Er--Frank.\n\nFRANK. Yes.\n\nREV. S. Do you think the Warrens will expect to be asked here after\nyesterday afternoon?\n\nFRANK. Theyve been asked already.\n\nREV. S. [appalled] What!!!\n\nFRANK. Crofts informed us at breakfast that you told him to bring Mrs\nWarren and Vivie over here to-day, and to invite them to make this house\ntheir home. My mother then found she must go to town by the 11.13 train.\n\nREV. S. [with despairing vehemence] I never gave any such invitation. I\nnever thought of such a thing.\n\nFRANK [compassionately] How do you know, gov'nor, what you said and\nthought last night?\n\nPRAED [coming in through the hedge] Good morning.\n\nREV. S. Good morning. I must apologize for not having met you at\nbreakfast. I have a touch of--of--\n\nFRANK. Clergyman's sore throat, Praed. Fortunately not chronic.\n\nPRAED [changing the subject] Well I must say your house is in a charming\nspot here. Really most charming.\n\nREV. S. Yes: it is indeed. Frank will take you for a walk, Mr Praed,\nif you like. I'll ask you to excuse me: I must take the opportunity\nto write my sermon while Mrs Gardner is away and you are all amusing\nyourselves. You won't mind, will you?\n\nPRAED. Certainly not. Don't stand on the slightest ceremony with me.\n\nREV. S. Thank you. I'll--er--er--[He stammers his way to the porch and\nvanishes into the house].\n\nPRAED. Curious thing it must be writing a sermon every week.\n\nFRANK. Ever so curious, if he did it. He buys em. He's gone for some\nsoda water.\n\nPRAED. My dear boy: I wish you would be more respectful to your father.\nYou know you can be so nice when you like.\n\nFRANK. My dear Praddy: you forget that I have to live with the governor.\nWhen two people live together--it don't matter whether theyre father and\nson or husband and wife or brother and sister--they can't keep up the\npolite humbug thats so easy for ten minutes on an afternoon call.\nNow the governor, who unites to many admirable domestic qualities the\nirresoluteness of a sheep and the pompousness and aggressiveness of a\njackass--\n\nPRAED. No, pray, pray, my dear Frank, remember! He is your father.\n\nFRANK. I give him due credit for that. [Rising and flinging down his\npaper] But just imagine his telling Crofts to bring the Warrens over\nhere! He must have been ever so drunk. You know, my dear Praddy, my\nmother wouldn't stand Mrs Warren for a moment. Vivie mustn't come here\nuntil she's gone back to town.\n\nPRAED. But your mother doesn't know anything about Mrs Warren, does she?\n[He picks up the paper and sits down to read it].\n\nFRANK. I don't know. Her journey to town looks as if she did. Not that\nmy mother would mind in the ordinary way: she has stuck like a brick to\nlots of women who had got into trouble. But they were all nice women.\nThats what makes the real difference. Mrs Warren, no doubt, has her\nmerits; but she's ever so rowdy; and my mother simply wouldn't put up\nwith her. So--hallo! [This exclamation is provoked by the reappearance\nof the clergyman, who comes out of the house in haste and dismay].\n\nREV. S. Frank: Mrs Warren and her daughter are coming across the heath\nwith Crofts: I saw them from the study windows. What _am_ I to say about\nyour mother?\n\nFRANK. Stick on your hat and go out and say how delighted you are to see\nthem; and that Frank's in the garden; and that mother and Bessie have\nbeen called to the bedside of a sick relative, and were ever so\nsorry they couldn't stop; and that you hope Mrs Warren slept well;\nand--and--say any blessed thing except the truth, and leave the rest to\nProvidence.\n\nREV. S. But how are we to get rid of them afterwards?\n\nFRANK. Theres no time to think of that now. Here! [He bounds into the\nhouse].\n\nREV. S. He's so impetuous. I don't know what to do with him, Mr Praed.\n\nFRANK [returning with a clerical felt hat, which he claps on his\nfather's head]. Now: off with you. [Rushing him through the gate].\nPraed and I'll wait here, to give the thing an unpremeditated air. [The\nclergyman, dazed but obedient, hurries off].\n\nFRANK. We must get the old girl back to town somehow, Praed. Come!\nHonestly, dear Praddy, do you like seeing them together?\n\nPRAED. Oh, why not?\n\nFRANK [his teeth on edge] Don't it make your flesh creep ever so little?\nthat wicked old devil, up to every villainy under the sun, I'll swear,\nand Vivie--ugh!\n\nPRAED. Hush, pray. Theyre coming.\n\n[The clergyman and Crofts are seen coming along the road, followed by\nMrs Warren and Vivie walking affectionately together.]\n\nFRANK. Look: she actually has her arm round the old woman's waist. It's\nher right arm: she began it. She's gone sentimental, by God! Ugh! ugh!\nNow do you feel the creeps? [The clergyman opens the gate: and Mrs\nWarren and Vivie pass him and stand in the middle of the garden looking\nat the house. Frank, in an ecstasy of dissimulation, turns gaily to Mrs\nWarren, exclaiming] Ever so delighted to see you, Mrs Warren. This quiet\nold rectory garden becomes you perfectly.\n\nMRS WARREN. Well, I never! Did you hear that, George? He says I look\nwell in a quiet old rectory garden.\n\nREV. S. [still holding the gate for Crofts, who loafs through it,\nheavily bored] You look well everywhere, Mrs Warren.\n\nFRANK. Bravo, gov'nor! Now look here: lets have a treat before lunch.\nFirst lets see the church. Everyone has to do that. It's a regular old\nthirteenth century church, you know: the gov'nor's ever so fond of it,\nbecause he got up a restoration fund and had it completely rebuilt six\nyears ago. Praed will be able to shew its points.\n\nPRAED [rising] Certainly, if the restoration has left any to shew.\n\nREV. S. [mooning hospitably at them] I shall be pleased, I'm sure, if\nSir George and Mrs Warren really care about it.\n\nMRS WARREN. Oh, come along and get it over.\n\nCROFTS [turning back toward the gate] I've no objection.\n\nREV. S. Not that way. We go through the fields, if you don't mind. Round\nhere. [He leads the way by the little path through the box hedge].\n\nCROFTS. Oh, all right. [He goes with the parson].\n\n[Praed follows with Mrs Warren. Vivie does not stir: she watches them\nuntil they have gone, with all the lines of purpose in her face marking\nit strongly.]\n\nFRANK. Ain't you coming?\n\nVIVIE. No. I want to give you a warning, Frank. You were making fun of\nmy mother just now when you said that about the rectory garden. That is\nbarred in the future. Please treat my mother with as much respect as you\ntreat your own.\n\nFRANK. My dear Viv: she wouldn't appreciate it: the two cases require\ndifferent treatment. But what on earth has happened to you? Last night\nwe were perfectly agreed as to your mother and her set. This morning I\nfind you attitudinizing sentimentally with your arm around your parent's\nwaist.\n\nVIVIE [flushing] Attitudinizing!\n\nFRANK. That was how it struck me. First time I ever saw you do a\nsecond-rate thing.\n\nVIVIE [controlling herself] Yes, Frank: there has been a change: but I\ndon't think it a change for the worse. Yesterday I was a little prig.\n\nFRANK. And today?\n\nVIVIE [wincing; then looking at him steadily] Today I know my mother\nbetter than you do.\n\nFRANK. Heaven forbid!\n\nVIVIE. What do you mean?\n\nFRANK. Viv: theres a freemasonry among thoroughly immoral people that\nyou know nothing of. You've too much character. _That's_ the bond\nbetween your mother and me: that's why I know her better than youll ever\nknow her.\n\nVIVIE. You are wrong: you know nothing about her. If you knew the\ncircumstances against which my mother had to struggle--\n\nFRANK [adroitly finishing the sentence for her] I should know why she is\nwhat she is, shouldn't I? What difference would that make?\n\nCircumstances or no circumstances, Viv, you won't be able to stand your\nmother.\n\nVIVIE [very angry] Why not?\n\nFRANK. Because she's an old wretch, Viv. If you ever put your arm around\nher waist in my presence again, I'll shoot myself there and then as a\nprotest against an exhibition which revolts me.\n\nVIVIE. Must I choose between dropping your acquaintance and dropping my\nmother's?\n\nFRANK [gracefully] That would put the old lady at ever such a\ndisadvantage. No, Viv: your infatuated little boy will have to stick to\nyou in any case. But he's all the more anxious that you shouldn't make\nmistakes. It's no use, Viv: your mother's impossible. She may be a good\nsort; but she's a bad lot, a very bad lot.\n\nVIVIE [hotly] Frank--! [He stands his ground. She turns away and\nsits down on the bench under the yew tree, struggling to recover her\nself-command. Then she says] Is she to be deserted by the world because\nshe's what you call a bad lot? Has she no right to live?\n\nFRANK. No fear of that, Viv: _she_ won't ever be deserted. [He sits on\nthe bench beside her].\n\nVIVIE. But I am to desert her, I suppose.\n\nFRANK [babyishly, lulling her and making love to her with his voice]\nMustn't go live with her. Little family group of mother and daughter\nwouldn't be a success. Spoil o u r little group.\n\nVIVIE [falling under the spell] What little group?\n\nFRANK. The babes in the wood: Vivie and little Frank. [He nestles\nagainst her like a weary child]. Lets go and get covered up with leaves.\n\nVIVIE [rhythmically, rocking him like a nurse] Fast asleep, hand in\nhand, under the trees.\n\nFRANK. The wise little girl with her silly little boy.\n\nVIVIE. The dear little boy with his dowdy little girl.\n\nFRANK. Ever so peaceful, and relieved from the imbecility of the little\nboy's father and the questionableness of the little girl's--\n\nVIVIE [smothering the word against her breast] Sh-sh-sh-sh! little girl\nwants to forget all about her mother. [They are silent for some moments,\nrocking one another. Then Vivie wakes up with a shock, exclaiming] What\na pair of fools we are! Come: sit up. Gracious! your hair. [She smooths\nit]. I wonder do all grown up people play in that childish way when\nnobody is looking.\n\nI never did it when I was a child.\n\nFRANK. Neither did I. You are my first playmate. [He catches her hand to\nkiss it, but checks himself to look around first. Very unexpectedly, he\nsees Crofts emerging from the box hedge]. Oh damn!\n\nVIVIE. Why damn, dear?\n\nFRANK [whispering] Sh! Here's this brute Crofts. [He sits farther away\nfrom her with an unconcerned air].\n\nCROFTS. Could I have a few words with you, Miss Vivie?\n\nVIVIE. Certainly.\n\nCROFTS [to Frank] Youll excuse me, Gardner. Theyre waiting for you in\nthe church, if you don't mind.\n\nFRANK [rising] Anything to oblige you, Crofts--except church. If you\nshould happen to want me, Vivvums, ring the gate bell. [He goes into the\nhouse with unruffled suavity].\n\nCROFTS [watching him with a crafty air as he disappears, and speaking to\nVivie with an assumption of being on privileged terms with her] Pleasant\nyoung fellow that, Miss Vivie. Pity he has no money, isn't it?\n\nVIVIE. Do you think so?\n\nCROFTS. Well, whats he to do? No profession. No property. Whats he good\nfor?\n\nVIVIE. I realize his disadvantages, Sir George.\n\nCROFTS [a little taken aback at being so precisely interpreted] Oh, it's\nnot that. But while we're in this world we're in it; and money's money.\n[Vivie does not answer]. Nice day, isn't it?\n\nVIVIE [with scarcely veiled contempt for this effort at conversation]\nVery.\n\nCROFTS [with brutal good humor, as if he liked her pluck] Well thats not\nwhat I came to say. [Sitting down beside her] Now listen, Miss Vivie.\nI'm quite aware that I'm not a young lady's man.\n\nVIVIE. Indeed, Sir George?\n\nCROFTS. No; and to tell you the honest truth I don't want to be either.\nBut when I say a thing I mean it; and when I feel a sentiment I feel it\nin earnest; and what I value I pay hard money for. Thats the sort of man\nI am.\n\nVIVIE. It does you great credit, I'm sure.\n\nCROFTS. Oh, I don't mean to praise myself. I have my faults, Heaven\nknows: no man is more sensible of that than I am. I know I'm not\nperfect: thats one of the advantages of being a middle-aged man; for\nI'm not a young man, and I know it. But my code is a simple one, and, I\nthink, a good one. Honor between man and man; fidelity between man and\nwoman; and no can't about this religion or that religion, but an honest\nbelief that things are making for good on the whole.\n\nVIVIE [with biting irony] \"A power, not ourselves, that makes for\nrighteousness,\" eh?\n\nCROFTS [taking her seriously] Oh certainly. Not ourselves, of course. Y\no u understand what I mean. Well, now as to practical matters. You may\nhave an idea that I've flung my money about; but I havn't: I'm richer\ntoday than when I first came into the property. I've used my knowledge of\nthe world to invest my money in ways that other men have overlooked; and\nwhatever else I may be, I'm a safe man from the money point of view.\n\nVIVIE. It's very kind of you to tell me all this.\n\nCROFTS. Oh well, come, Miss Vivie: you needn't pretend you don't see what\nI'm driving at. I want to settle down with a Lady Crofts. I suppose you\nthink me very blunt, eh?\n\nVIVIE. Not at all: I am very much obliged to you for being so definite\nand business-like. I quite appreciate the offer: the money, the\nposition, _Lady Crofts_, and so on. But I think I will say no, if you\ndon't mind, I'd rather not. [She rises, and strolls across to the\nsundial to get out of his immediate neighborhood].\n\nCROFTS [not at all discouraged, and taking advantage of the additional\nroom left him on the seat to spread himself comfortably, as if a few\npreliminary refusals were part of the inevitable routine of courtship]\nI'm in no hurry. It was only just to let you know in case young Gardner\nshould try to trap you. Leave the question open.\n\nVIVIE [sharply] My no is final. I won't go back from it.\n\n[Crofts is not impressed. He grins; leans forward with his elbows on his\nknees to prod with his stick at some unfortunate insect in the grass;\nand looks cunningly at her. She turns away impatiently.]\n\nCROFTS. I'm a good deal older than you. Twenty-five years: quarter of\na century. I shan't live for ever; and I'll take care that you shall be\nwell off when I'm gone.\n\nVIVIE. I am proof against even that inducement, Sir George. Don't you\nthink youd better take your answer? There is not the slightest chance of\nmy altering it.\n\nCROFTS [rising, after a final slash at a daisy, and coming nearer to\nher] Well, no matter. I could tell you some things that would change\nyour mind fast enough; but I wont, because I'd rather win you by honest\naffection. I was a good friend to your mother: ask her whether I wasn't.\nShe'd never have make the money that paid for your education if it hadnt\nbeen for my advice and help, not to mention the money I advanced her.\nThere are not many men who would have stood by her as I have. I put not\nless than forty thousand pounds into it, from first to last.\n\nVIVIE [staring at him] Do you mean to say that you were my mother's\nbusiness partner?\n\nCROFTS. Yes. Now just think of all the trouble and the explanations\nit would save if we were to keep the whole thing in the family, so to\nspeak. Ask your mother whether she'd like to have to explain all her\naffairs to a perfect stranger.\n\nVIVIE. I see no difficulty, since I understand that the business is\nwound up, and the money invested.\n\nCROFTS [stopping short, amazed] Wound up! Wind up a business thats\npaying 35 per cent in the worst years! Not likely. Who told you that?\n\nVIVIE [her color quite gone] Do you mean that it is still--? [She stops\nabruptly, and puts her hand on the sundial to support herself. Then she\ngets quickly to the iron chair and sits down].\n\nWhat business are you talking about?\n\nCROFTS. Well, the fact is it's not what would considered exactly a\nhigh-class business in my set--the country set, you know--o u r set it\nwill be if you think better of my offer. Not that theres any mystery\nabout it: don't think that. Of course you know by your mother's being\nin it that it's perfectly straight and honest. I've known her for many\nyears; and I can say of her that she'd cut off her hands sooner than\ntouch anything that was not what it ought to be. I'll tell you all about\nit if you like. I don't know whether you've found in travelling how hard\nit is to find a really comfortable private hotel.\n\nVIVIE [sickened, averting her face] Yes: go on.\n\nCROFTS. Well, thats all it is. Your mother has got a genius for managing\nsuch things. We've got two in Brussels, one in Ostend, one in Vienna,\nand two in Budapest. Of course there are others besides ourselves in\nit; but we hold most of the capital; and your mother's indispensable\nas managing director. You've noticed, I daresay, that she travels a good\ndeal. But you see you can't mention such things in society. Once let out\nthe word hotel and everybody thinks you keep a public-house. You wouldn't\nlike people to say that of your mother, would you? Thats why we're so\nreserved about it. By the way, youll keep it to yourself, won't you?\nSince it's been a secret so long, it had better remain so.\n\nVIVIE. And this is the business you invite me to join you in?\n\nCROFTS. Oh no. My wife shan't be troubled with business. Youll not be in\nit more than you've always been.\n\nVIVIE. _I_ always been! What do you mean?\n\nCROFTS. Only that you've always lived on it. It paid for your education\nand the dress you have on your back. Don't turn up your nose at business,\nMiss Vivie: where would your Newnhams and Girtons be without it?\n\nVIVIE [rising, almost beside herself] Take care. I know what this\nbusiness is.\n\nCROFTS [starting, with a suppressed oath] Who told you?\n\nVIVIE. Your partner. My mother.\n\nCROFTS [black with rage] The old--\n\nVIVIE. Just so.\n\n[He swallows the epithet and stands for a moment swearing and raging\nfoully to himself. But he knows that his cue is to be sympathetic. He\ntakes refuge in generous indignation.]\n\nCROFTS. She ought to have had more consideration for you. _I'd_ never\nhave told you.\n\nVIVIE. I think you would probably have told me when we were married: it\nwould have been a convenient weapon to break me in with.\n\nCROFTS [quite sincerely] I never intended that. On my word as a\ngentleman I didn't.\n\n[Vivie wonders at him. Her sense of the irony of his protest cools and\nbraces her. She replies with contemptuous self-possession.]\n\nVIVIE. It does not matter. I suppose you understand that when we leave\nhere today our acquaintance ceases.\n\nCROFTS. Why? Is it for helping your mother?\n\nVIVIE. My mother was a very poor woman who had no reasonable choice but\nto do as she did. You were a rich gentleman; and you did the same for\nthe sake of 35 per cent. You are a pretty common sort of scoundrel, I\nthink. That is my opinion of you.\n\nCROFTS [after a stare: not at all displeased, and much more at his ease\non these frank terms than on their former ceremonious ones] Ha! ha! ha!\nha! Go it, little missie, go it: it doesn't hurt me and it amuses you.\nWhy the devil shouldn't I invest my money that way? I take the interest\non my capital like other people: I hope you don't think I dirty my own\nhands with the work.\n\nCome! you wouldn't refuse the acquaintance of my mother's cousin the Duke\nof Belgravia because some of the rents he gets are earned in queer ways.\nYou wouldn't cut the Archbishop of Canterbury, I suppose, because the\nEcclesiastical Commissioners have a few publicans and sinners among\ntheir tenants. Do you remember your Crofts scholarship at Newnham? Well,\nthat was founded by my brother the M.P. He gets his 22 per cent out of\na factory with 600 girls in it, and not one of them getting wages enough\nto live on. How d'ye suppose they manage when they have no family to\nfall back on? Ask your mother. And do you expect me to turn my back on\n35 per cent when all the rest are pocketing what they can, like sensible\nmen? No such fool! If youre going to pick and choose your acquaintances\non moral principles, youd better clear out of this country, unless you\nwant to cut yourself out of all decent society.\n\nVIVIE [conscience stricken] You might go on to point out that I myself\nnever asked where the money I spent came from. I believe I am just as\nbad as you.\n\nCROFTS [greatly reassured] Of course you are; and a very good thing too!\nWhat harm does it do after all? [Rallying her jocularly] So you don't\nthink me such a scoundrel now you come to think it over. Eh?\n\nVIVIE. I have shared profits with you: and I admitted you just now to\nthe familiarity of knowing what I think of you.\n\nCROFTS [with serious friendliness] To be sure you did. You won't find\nme a bad sort: I don't go in for being superfine intellectually; but Ive\nplenty of honest human feeling; and the old Crofts breed comes out in\na sort of instinctive hatred of anything low, in which I'm sure youll\nsympathize with me. Believe me, Miss Vivie, the world isn't such a bad\nplace as the croakers make out. As long as you don't fly openly in the\nface of society, society doesn't ask any inconvenient questions; and\nit makes precious short work of the cads who do. There are no secrets\nbetter kept than the secrets everybody guesses. In the class of people\nI can introduce you to, no lady or gentleman would so far forget\nthemselves as to discuss my business affairs or your mothers. No man can\noffer you a safer position.\n\nVIVIE [studying him curiously] I suppose you really think youre getting\non famously with me.\n\nCROFTS. Well, I hope I may flatter myself that you think better of me\nthan you did at first.\n\nVIVIE [quietly] I hardly find you worth thinking about at all now. When\nI think of the society that tolerates you, and the laws that protect\nyou! when I think of how helpless nine out of ten young girls would\nbe in the hands of you and my mother! the unmentionable woman and her\ncapitalist bully--\n\nCROFTS [livid] Damn you!\n\nVIVIE. You need not. I feel among the damned already.\n\n[She raises the latch of the gate to open it and go out. He follows her\nand puts his hand heavily on the top bar to prevent its opening.]\n\nCROFTS [panting with fury] Do you think I'll put up with this from you,\nyou young devil?\n\nVIVIE [unmoved] Be quiet. Some one will answer the bell. [Without\nflinching a step she strikes the bell with the back of her hand. It\nclangs harshly; and he starts back involuntarily. Almost immediately\nFrank appears at the porch with his rifle].\n\nFRANK [with cheerful politeness] Will you have the rifle, Viv; or shall\nI operate?\n\nVIVIE. Frank: have you been listening?\n\nFRANK [coming down into the garden] Only for the bell, I assure you; so\nthat you shouldn't have to wait. I think I shewed great insight into your\ncharacter, Crofts.\n\nCROFTS. For two pins I'd take that gun from you and break it across your\nhead.\n\nFRANK [stalking him cautiously] Pray don't. I'm ever so careless in\nhandling firearms. Sure to be a fatal accident, with a reprimand from\nthe coroner's jury for my negligence.\n\nVIVIE. Put the rifle away, Frank: it's quite unnecessary.\n\nFRANK. Quite right, Viv. Much more sportsmanlike to catch him in a\ntrap. [Crofts, understanding the insult, makes a threatening movement].\nCrofts: there are fifteen cartridges in the magazine here; and I am a\ndead shot at the present distance and at an object of your size.\n\nCROFTS. Oh, you needn't be afraid. I'm not going to touch you.\n\nFRANK. Ever so magnanimous of you under the circumstances! Thank you.\n\nCROFTS. I'll just tell you this before I go. It may interest you, since\nyoure so fond of one another. Allow me, Mister Frank, to introduce you\nto your half-sister, the eldest daughter of the Reverend Samuel Gardner.\nMiss Vivie: you half-brother. Good morning! [He goes out through the\ngate and along the road].\n\nFRANK [after a pause of stupefaction, raising the rifle] Youll testify\nbefore the coroner that it's an accident, Viv. [He takes aim at the\nretreating figure of Crofts. Vivie seizes the muzzle and pulls it round\nagainst her breast].\n\nVIVIE. Fire now. You may.\n\nFRANK [dropping his end of the rifle hastily] Stop! take care. [She lets\nit go. It falls on the turf]. Oh, you've given your little boy such\na turn. Suppose it had gone off! ugh! [He sinks on the garden seat,\novercome].\n\nVIVIE. Suppose it had: do you think it would not have been a relief to\nhave some sharp physical pain tearing through me?\n\nFRANK [coaxingly] Take it ever so easy, dear Viv. Remember: even if the\nrifle scared that fellow into telling the truth for the first time in\nhis life, that only makes us the babes in the woods in earnest. [He\nholds out his arms to her]. Come and be covered up with leaves again.\n\nVIVIE [with a cry of disgust] Ah, not that, not that. You make all my\nflesh creep.\n\nFRANK. Why, whats the matter?\n\nVIVIE. Goodbye. [She makes for the gate].\n\nFRANK [jumping up] Hallo! Stop! Viv! Viv! [She turns in the gateway]\nWhere are you going to? Where shall we find you?\n\nVIVIE. At Honoria Fraser's chambers, 67 Chancery Lane, for the rest of\nmy life. [She goes off quickly in the opposite direction to that taken\nby Crofts].\n\nFRANK. But I say--wait--dash it! [He runs after her].\n\n\n\n\nACT IV\n\n\n[Honoria Fraser's chambers in Chancery Lane. An office at the top of New\nStone Buildings, with a plate-glass window, distempered walls, electric\nlight, and a patent stove. Saturday afternoon. The chimneys of Lincoln's\nInn and the western sky beyond are seen through the window. There is a\ndouble writing table in the middle of the room, with a cigar box, ash\npans, and a portable electric reading lamp almost snowed up in heaps of\npapers and books. This table has knee holes and chairs right and left\nand is very untidy. The clerk's desk, closed and tidy, with its high\nstool, is against the wall, near a door communicating with the inner\nrooms. In the opposite wall is the door leading to the public corridor.\nIts upper panel is of opaque glass, lettered in black on the outside,\nFRASER AND WARREN. A baize screen hides the corner between this door and\nthe window.]\n\n[Frank, in a fashionable light-colored coaching suit, with his stick,\ngloves, and white hat in his hands, is pacing up and down in the office.\nSomebody tries the door with a key.]\n\nFRANK [calling] Come in. It's not locked.\n\n[Vivie comes in, in her hat and jacket. She stops and stares at him.]\n\nVIVIE [sternly] What are you doing here?\n\nFRANK. Waiting to see you. I've been here for hours. Is this the way you\nattend to your business? [He puts his hat and stick on the table, and\nperches himself with a vault on the clerk's stool, looking at her with\nevery appearance of being in a specially restless, teasing, flippant\nmood].\n\nVIVIE. I've been away exactly twenty minutes for a cup of tea. [She takes\noff her hat and jacket and hangs them behind the screen]. How did you\nget in?\n\nFRANK. The staff had not left when I arrived. He's gone to play cricket\non Primrose Hill. Why don't you employ a woman, and give your sex a\nchance?\n\nVIVIE. What have you come for?\n\nFRANK [springing off the stool and coming close to her] Viv: lets go and\nenjoy the Saturday half-holiday somewhere, like the staff.\n\nWhat do you say to Richmond, and then a music hall, and a jolly supper?\n\nVIVIE. Can't afford it. I shall put in another six hours work before I go\nto bed.\n\nFRANK. Can't afford it, can't we? Aha! Look here. [He takes out a handful\nof sovereigns and makes them chink]. Gold, Viv: gold!\n\nVIVIE. Where did you get it?\n\nFRANK. Gambling, Viv: gambling. Poker.\n\nVIVIE. Pah! It's meaner than stealing it. No: I'm not coming. [She sits\ndown to work at the table, with her back to the glass door, and begins\nturning over the papers].\n\nFRANK [remonstrating piteously] But, my dear Viv, I want to talk to you\never so seriously.\n\nVIVIE. Very well: sit down in Honoria's chair and talk here. I like ten\nminutes chat after tea. [He murmurs]. No use groaning: I'm inexorable.\n[He takes the opposite seat disconsolately]. Pass that cigar box, will\nyou?\n\nFRANK [pushing the cigar box across] Nasty womanly habit. Nice men don't\ndo it any longer.\n\nVIVIE. Yes: they object to the smell in the office; and we've had to take\nto cigarets. See! [She opens the box and takes out a cigaret, which she\nlights. She offers him one; but he shakes his head with a wry face. She\nsettles herself comfortably in her chair, smoking]. Go ahead.\n\nFRANK. Well, I want to know what you've done--what arrangements you've\nmade.\n\nVIVIE. Everything was settled twenty minutes after I arrived here.\nHonoria has found the business too much for her this year; and she was\non the point of sending for me and proposing a partnership when I walked\nin and told her I hadn't a farthing in the world. So I installed myself\nand packed her off for a fortnight's holiday. What happened at Haslemere\nwhen I left?\n\nFRANK. Nothing at all. I said youd gone to town on particular business.\n\nVIVIE. Well?\n\nFRANK. Well, either they were too flabbergasted to say anything, or else\nCrofts had prepared your mother. Anyhow, she didn't say anything; and\nCrofts didn't say anything; and Praddy only stared. After tea they got up\nand went; and I've not seen them since.\n\nVIVIE [nodding placidly with one eye on a wreath of smoke] Thats all\nright.\n\nFRANK [looking round disparagingly] Do you intend to stick in this\nconfounded place?\n\nVIVIE [blowing the wreath decisively away, and sitting straight up] Yes.\nThese two days have given me back all my strength and self-possession. I\nwill never take a holiday again as long as I live.\n\nFRANK [with a very wry face] Mps! You look quite happy. And as hard as\nnails.\n\nVIVIE [grimly] Well for me that I am!\n\nFRANK [rising] Look here, Viv: we must have an explanation. We parted\nthe other day under a complete misunderstanding. [He sits on the table,\nclose to her].\n\nVIVIE [putting away the cigaret] Well: clear it up.\n\nFRANK. You remember what Crofts said.\n\nVIVIE. Yes.\n\nFRANK. That revelation was supposed to bring about a complete change in\nthe nature of our feeling for one another. It placed us on the footing\nof brother and sister.\n\nVIVIE. Yes.\n\nFRANK. Have you ever had a brother?\n\nVIVIE. No.\n\nFRANK. Then you don't know what being brother and sister feels like? Now\nI have lots of sisters; and the fraternal feeling is quite familiar to\nme. I assure you my feeling for you is not the least in the world like\nit. The girls will go _their_ way; I will go mine; and we shan't care\nif we never see one another again. Thats brother and sister. But as to\nyou, I can't be easy if I have to pass a week without seeing you. Thats\nnot brother and sister. Its exactly what I felt an hour before Crofts\nmade his revelation. In short, dear Viv, it's love's young dream.\n\nVIVIE [bitingly] The same feeling, Frank, that brought your father to my\nmother's feet. Is that it?\n\nFRANK [so revolted that he slips off the table for a moment] I very\nstrongly object, Viv, to have my feelings compared to any which the\nReverend Samuel is capable of harboring; and I object still more to a\ncomparison of you to your mother. [Resuming his perch] Besides, I don't\nbelieve the story. I have taxed my father with it, and obtained from him\nwhat I consider tantamount to a denial.\n\nVIVIE. What did he say?\n\nFRANK. He said he was sure there must be some mistake.\n\nVIVIE. Do you believe him?\n\nFRANK. I am prepared to take his word against Crofts'.\n\nVIVIE. Does it make any difference? I mean in your imagination or\nconscience; for of course it makes no real difference.\n\nFRANK [shaking his head] None whatever to _me_.\n\nVIVIE. Nor to me.\n\nFRANK [staring] But this is ever so surprising! [He goes back to his\nchair]. I thought our whole relations were altered in your imagination\nand conscience, as you put it, the moment those words were out of that\nbrute's muzzle.\n\nVIVIE. No: it was not that. I didn't believe him. I only wish I could.\n\nFRANK. Eh?\n\nVIVIE. I think brother and sister would be a very suitable relation for\nus.\n\nFRANK. You really mean that?\n\nVIVIE. Yes. It's the only relation I care for, even if we could afford\nany other. I mean that.\n\nFRANK [raising his eyebrows like one on whom a new light has dawned, and\nrising with quite an effusion of chivalrous sentiment] My dear Viv:\nwhy didn't you say so before? I am ever so sorry for persecuting you. I\nunderstand, of course.\n\nVIVIE [puzzled] Understand what?\n\nFRANK. Oh, I'm not a fool in the ordinary sense: only in the Scriptural\nsense of doing all the things the wise man declared to be folly, after\ntrying them himself on the most extensive scale. I see I am no longer\nVivvums's little boy. Don't be alarmed: I shall never call you Vivvums\nagain--at least unless you get tired of your new little boy, whoever he\nmay be.\n\nVIVIE. My new little boy!\n\nFRANK [with conviction] Must be a new little boy. Always happens that\nway. No other way, in fact.\n\nVIVIE. None that you know of, fortunately for you.\n\n[Someone knocks at the door.]\n\nFRANK. My curse upon yon caller, whoe'er he be!\n\nVIVIE. It's Praed. He's going to Italy and wants to say goodbye. I asked\nhim to call this afternoon. Go and let him in.\n\nFRANK. We can continue our conversation after his departure for Italy.\nI'll stay him out. [He goes to the door and opens it]. How are you,\nPraddy? Delighted to see you. Come in.\n\n[Praed, dressed for travelling, comes in, in high spirits.]\n\nPRAED. How do you do, Miss Warren? [She presses his hand cordially,\nthough a certain sentimentality in his high spirits jars upon her]. I\nstart in an hour from Holborn Viaduct. I wish I could persuade you to\ntry Italy.\n\nVIVIE. What for?\n\nPRAED. Why, to saturate yourself with beauty and romance, of course.\n\n[Vivie, with a shudder, turns her chair to the table, as if the work\nwaiting for her there were a support to her. Praed sits opposite to her.\nFrank places a chair near Vivie, and drops lazily and carelessly into\nit, talking at her over his shoulder.]\n\nFRANK. No use, Praddy. Viv is a little Philistine. She is indifferent to\n_my_ romance, and insensible to _my_ beauty.\n\nVIVIE. Mr Praed: once for all, there is no beauty and no romance in life\nfor me. Life is what it is; and I am prepared to take it as it is.\n\nPRAED [enthusiastically] You will not say that if you come with me to\nVerona and on to Venice. You will cry with delight at living in such a\nbeautiful world.\n\nFRANK. This is most eloquent, Praddy. Keep it up.\n\nPRAED. Oh, I assure you _I_ have cried--I shall cry again, I hope--at\nfifty! At your age, Miss Warren, you would not need to go so far as\nVerona. Your spirits would absolutely fly up at the mere sight of\nOstend. You would be charmed with the gaiety, the vivacity, the happy\nair of Brussels.\n\nVIVIE [springing up with an exclamation of loathing] Agh!\n\nPRAED [rising] Whats the matter?\n\nFRANK [rising] Hallo, Viv!\n\nVIVIE [to Praed, with deep reproach] Can you find no better example of\nyour beauty and romance than Brussels to talk to me about?\n\nPRAED [puzzled] Of course it's very different from Verona. I don't\nsuggest for a moment that--\n\nVIVIE [bitterly] Probably the beauty and romance come to much the same\nin both places.\n\nPRAED [completely sobered and much concerned] My dear Miss Warren:\nI--[looking enquiringly at Frank] Is anything the matter?\n\nFRANK. She thinks your enthusiasm frivolous, Praddy. She's had ever such\na serious call.\n\nVIVIE [sharply] Hold your tongue, Frank. Don't be silly.\n\nFRANK [sitting down] Do you call this good manners, Praed?\n\nPRAED [anxious and considerate] Shall I take him away, Miss Warren? I\nfeel sure we have disturbed you at your work.\n\nVIVIE. Sit down: I'm not ready to go back to work yet. [Praed sits]. You\nboth think I have an attack of nerves. Not a bit of it. But there are\ntwo subjects I want dropped, if you don't mind.\n\nOne of them [to Frank] is love's young dream in any shape or form: the\nother [to Praed] is the romance and beauty of life, especially Ostend\nand the gaiety of Brussels. You are welcome to any illusions you may\nhave left on these subjects: I have none. If we three are to remain\nfriends, I must be treated as a woman of business, permanently single\n[to Frank] and permanently unromantic [to Praed].\n\nFRANK. I also shall remain permanently single until you change your\nmind. Praddy: change the subject. Be eloquent about something else.\n\nPRAED [diffidently] I'm afraid theres nothing else in the world that I\n_can_ talk about. The Gospel of Art is the only one I can preach. I know\nMiss Warren is a great devotee of the Gospel of Getting On; but we\ncan't discuss that without hurting your feelings, Frank, since you are\ndetermined not to get on.\n\nFRANK. Oh, don't mind my feelings. Give me some improving advice by\nall means: it does me ever so much good. Have another try to make a\nsuccessful man of me, Viv. Come: lets have it all: energy, thrift,\nforesight, self-respect, character. Don't you hate people who have no\ncharacter, Viv?\n\nVIVIE [wincing] Oh, stop, stop. Let us have no more of that horrible\ncant. Mr Praed: if there are really only those two gospels in the world,\nwe had better all kill ourselves; for the same taint is in both, through\nand through.\n\nFRANK [looking critically at her] There is a touch of poetry about you\ntoday, Viv, which has hitherto been lacking.\n\nPRAED [remonstrating] My dear Frank: aren't you a little unsympathetic?\n\nVIVIE [merciless to herself] No: it's good for me. It keeps me from\nbeing sentimental.\n\nFRANK [bantering her] Checks your strong natural propensity that way,\ndon't it?\n\nVIVIE [almost hysterically] Oh yes: go on: don't spare me. I was\nsentimental for one moment in my life--beautifully sentimental--by\nmoonlight; and now--\n\nFRANK [quickly] I say, Viv: take care. Don't give yourself away.\n\nVIVIE. Oh, do you think Mr Praed does not know all about my mother?\n[Turning on Praed] You had better have told me that morning, Mr Praed.\nYou are very old fashioned in your delicacies, after all.\n\nPRAED. Surely it is you who are a little old fashioned in your\nprejudices, Miss Warren. I feel bound to tell you, speaking as an\nartist, and believing that the most intimate human relationships are\nfar beyond and above the scope of the law, that though I know that your\nmother is an unmarried woman, I do not respect her the less on that\naccount. I respect her more.\n\nFRANK [airily] Hear! hear!\n\nVIVIE [staring at him] Is that _all_ you know?\n\nPRAED. Certainly that is all.\n\nVIVIE. Then you neither of you know anything. Your guesses are innocence\nitself compared with the truth.\n\nPRAED [rising, startled and indignant, and preserving his politeness\nwith an effort] I hope not. [More emphatically] I hope not, Miss Warren.\n\nFRANK [whistles] Whew!\n\nVIVIE. You are not making it easy for me to tell you, Mr Praed.\n\nPRAED [his chivalry drooping before their conviction] If there is\nanything worse--that is, anything else--are you sure you are right to\ntell us, Miss Warren?\n\nVIVIE. I am sure that if I had the courage I should spend the rest of my\nlife in telling everybody--stamping and branding it into them until they\nall felt their part in its abomination as I feel mine. There is nothing\nI despise more than the wicked convention that protects these things\nby forbidding a woman to mention them. And yet I can't tell you. The two\ninfamous words that describe what my mother is are ringing in my ears\nand struggling on my tongue; but I can't utter them: the shame of them\nis too horrible for me. [She buries her face in her hands. The two men,\nastonished, stare at one another and then at her. She raises her head\nagain desperately and snatches a sheet of paper and a pen]. Here: let me\ndraft you a prospectus.\n\nFRANK. Oh, she's mad. Do you hear, Viv? mad. Come! pull yourself\ntogether.\n\nVIVIE. You shall see. [She writes]. \"Paid up capital: not less than\nforty thousand pounds standing in the name of Sir George Crofts,\nBaronet, the chief shareholder. Premises at Brussels, Ostend, Vienna,\nand Budapest. Managing director: Mrs Warren\"; and now don't let us forget\nh e r qualifications: the two words. [She writes the words and pushes\nthe paper to them]. There! Oh no: don't read it: don't! [She snatches it\nback and tears it to pieces; then seizes her head in her hands and hides\nher face on the table].\n\n[Frank, who has watched the writing over her shoulder, and opened his\neyes very widely at it, takes a card from his pocket; scribbles the\ntwo words on it; and silently hands it to Praed, who reads it with\namazement, and hides it hastily in his pocket.]\n\nFRANK [whispering tenderly] Viv, dear: thats all right. I read what you\nwrote: so did Praddy. We understand. And we remain, as this leaves us at\npresent, yours ever so devotedly.\n\nPRAED. We do indeed, Miss Warren. I declare you are the most splendidly\ncourageous woman I ever met.\n\n[This sentimental compliment braces Vivie. She throws it away from her\nwith an impatient shake, and forces herself to stand up, though not\nwithout some support from the table.]\n\nFRANK. Don't stir, Viv, if you don't want to. Take it easy.\n\nVIVIE. Thank you. You an always depend on me for two things: not to cry\nand not to faint. [She moves a few steps towards the door of the inner\nroom, and stops close to Praed to say] I shall need much more courage\nthan that when I tell my mother that we have come to a parting of the\nways. Now I must go into the next room for a moment to make myself neat\nagain, if you don't mind.\n\nPRAED. Shall we go away?\n\nVIVIE. No: I'll be back presently. Only for a moment. [She goes into the\nother room, Praed opening the door for her].\n\nPRAED. What an amazing revelation! I'm extremely disappointed in Crofts:\nI am indeed.\n\nFRANK. I'm not in the least. I feel he's perfectly accounted for at\nlast. But what a facer for me, Praddy! I can't marry her now.\n\nPRAED [sternly] Frank! [The two look at one another, Frank unruffled,\nPraed deeply indignant]. Let me tell you, Gardner, that if you desert\nher now you will behave very despicably.\n\nFRANK. Good old Praddy! Ever chivalrous! But you mistake: it's not the\nmoral aspect of the case: it's the money aspect. I really can't bring\nmyself to touch the old woman's money now.\n\nPRAED. And was that what you were going to marry on?\n\nFRANK. What else? _I_ havn't any money, nor the smallest turn for making\nit. If I married Viv now she would have to support me; and I should cost\nher more than I am worth.\n\nPRAED. But surely a clever bright fellow like you can make something by\nyour own brains.\n\nFRANK. Oh yes, a little. [He takes out his money again]. I made all that\nyesterday in an hour and a half. But I made it in a highly speculative\nbusiness. No, dear Praddy: even if Bessie and Georgina marry\nmillionaires and the governor dies after cutting them off with a\nshilling, I shall have only four hundred a year. And he won't die until\nhe's three score and ten: he hasn't originality enough. I shall be on\nshort allowance for the next twenty years. No short allowance for Viv,\nif I can help it. I withdraw gracefully and leave the field to the\ngilded youth of England. So that settled. I shan't worry her about it:\nI'll just send her a little note after we're gone. She'll understand.\n\nPRAED [grasping his hand] Good fellow, Frank! I heartily beg your\npardon. But must you never see her again?\n\nFRANK. Never see her again! Hang it all, be reasonable. I shall come\nalong as often as possible, and be her brother. I can _not_ understand\nthe absurd consequences you romantic people expect from the most\nordinary transactions. [A knock at the door]. I wonder who this is.\nWould you mind opening the door? If it's a client it will look more\nrespectable than if I appeared.\n\nPRAED. Certainly. [He goes to the door and opens it. Frank sits down in\nVivie's chair to scribble a note]. My dear Kitty: come in: come in.\n\n[Mrs Warren comes in, looking apprehensively around for Vivie. She has\ndone her best to make herself matronly and dignified. The brilliant hat\nis replaced by a sober bonnet, and the gay blouse covered by a costly\nblack silk mantle. She is pitiably anxious and ill at ease: evidently\npanic-stricken.]\n\nMRS WARREN [to Frank] What! Y o u r e here, are you?\n\nFRANK [turning in his chair from his writing, but not rising] Here, and\ncharmed to see you. You come like a breath of spring.\n\nMRS WARREN. Oh, get out with your nonsense. [In a low voice] Where's\nVivie?\n\n[Frank points expressively to the door of the inner room, but says\nnothing.]\n\nMRS WARREN [sitting down suddenly and almost beginning to cry] Praddy:\nwon't she see me, don't you think?\n\nPRAED. My dear Kitty: don't distress yourself. Why should she not?\n\nMRS WARREN. Oh, you never can see why not: youre too innocent. Mr Frank:\ndid she say anything to you?\n\nFRANK [folding his note] She _must_ see you, if [very expressively] you\nwait til she comes in.\n\nMRS WARREN [frightened] Why shouldn't I wait?\n\n[Frank looks quizzically at her; puts his note carefully on the\nink-bottle, so that Vivie cannot fail to find it when next she dips her\npen; then rises and devotes his attention entirely to her.]\n\nFRANK. My dear Mrs Warren: suppose you were a sparrow--ever so tiny\nand pretty a sparrow hopping in the roadway--and you saw a steam roller\ncoming in your direction, would you wait for it?\n\nMRS WARREN. Oh, don't bother me with your sparrows. What did she run away\nfrom Haslemere like that for?\n\nFRANK. I'm afraid she'll tell you if you rashly await her return.\n\nMRS WARREN. Do you want me to go away?\n\nFRANK. No: I always want you to stay. But I _advise_ you to go away.\n\nMRS WARREN. What! And never see her again!\n\nFRANK. Precisely.\n\nMRS WARREN [crying again] Praddy: don't let him be cruel to me. [She\nhastily checks her tears and wipes her eyes]. She'll be so angry if she\nsees I've been crying.\n\nFRANK [with a touch of real compassion in his airy tenderness] You know\nthat Praddy is the soul of kindness, Mrs Warren. Praddy: what do you\nsay? Go or stay?\n\nPRAED [to Mrs Warren] I really should be very sorry to cause you\nunnecessary pain; but I think perhaps you had better not wait. The fact\nis--[Vivie is heard at the inner door].\n\nFRANK. Sh! Too late. She's coming.\n\nMRS WARREN. Don't tell her I was crying. [Vivie comes in. She\nstops gravely on seeing Mrs Warren, who greets her with hysterical\ncheerfulness]. Well, dearie. So here you are at last.\n\nVIVIE. I am glad you have come: I want to speak to you. You said you\nwere going, Frank, I think.\n\nFRANK. Yes. Will you come with me, Mrs Warren? What do you say to a\ntrip to Richmond, and the theatre in the evening? There is safety in\nRichmond. No steam roller there.\n\nVIVIE. Nonsense, Frank. My mother will stay here.\n\nMRS WARREN [scared] I don't know: perhaps I'd better go. We're disturbing\nyou at your work.\n\nVIVIE [with quiet decision] Mr Praed: please take Frank away. Sit down,\nmother. [Mrs Warren obeys helplessly].\n\nPRAED. Come, Frank. Goodbye, Miss Vivie.\n\nVIVIE [shaking hands] Goodbye. A pleasant trip.\n\nPRAED. Thank you: thank you. I hope so.\n\nFRANK [to Mrs Warren] Goodbye: youd ever so much better have taken my\nadvice. [He shakes hands with her. Then airily to Vivie] Byebye, Viv.\n\nVIVIE. Goodbye. [He goes out gaily without shaking hands with her].\n\nPRAED [sadly] Goodbye, Kitty.\n\nMRS WARREN [snivelling]--oobye!\n\n[Praed goes. Vivie, composed and extremely grave, sits down in Honoria's\nchair, and waits for her mother to speak. Mrs Warren, dreading a pause,\nloses no time in beginning.]\n\nMRS WARREN. Well, Vivie, what did you go away like that for without\nsaying a word to me! How could you do such a thing! And what have you\ndone to poor George? I wanted him to come with me; but he shuffled\nout of it. I could see that he was quite afraid of you. Only fancy:\nhe wanted me not to come. As if [trembling] I should be afraid of you,\ndearie. [Vivie's gravity deepens]. But of course I told him it was all\nsettled and comfortable between us, and that we were on the best\nof terms. [She breaks down]. Vivie: whats the meaning of this? [She\nproduces a commercial envelope, and fumbles at the enclosure with\ntrembling fingers]. I got it from the bank this morning.\n\nVIVIE. It is my month's allowance. They sent it to me as usual the other\nday. I simply sent it back to be placed to your credit, and asked them\nto send you the lodgment receipt. In future I shall support myself.\n\nMRS WARREN [not daring to understand] Wasn't it enough? Why didn't\nyou tell me? [With a cunning gleam in her eye] I'll double it: I was\nintending to double it. Only let me know how much you want.\n\nVIVIE. You know very well that that has nothing to do with it. From this\ntime I go my own way in my own business and among my own friends. And\nyou will go yours. [She rises]. Goodbye.\n\nMRS WARREN [rising, appalled] Goodbye?\n\nVIVIE. Yes: goodbye. Come: don't let us make a useless scene: you\nunderstand perfectly well. Sir George Crofts has told me the whole\nbusiness.\n\nMRS WARREN [angrily] Silly old--[She swallows an epithet, and then turns\nwhite at the narrowness of her escape from uttering it].\n\nVIVIE. Just so.\n\nMRS WARREN. He ought to have his tongue cut out. But I thought it was\nended: you said you didn't mind.\n\nVIVIE [steadfastly] Excuse me: I _do_ mind.\n\nMRS WARREN. But I explained--\n\nVIVIE. You explained how it came about. You did not tell me that it is\nstill going on [She sits].\n\n[Mrs Warren, silenced for a moment, looks forlornly at Vivie, who waits,\nsecretly hoping that the combat is over. But the cunning expression\ncomes back into Mrs Warren's face; and she bends across the table, sly\nand urgent, half whispering.]\n\nMRS WARREN. Vivie: do you know how rich I am?\n\nVIVIE. I have no doubt you are very rich.\n\nMRS WARREN. But you don't know all that that means; youre too young. It\nmeans a new dress every day; it means theatres and balls every night;\nit means having the pick of all the gentlemen in Europe at your feet;\nit means a lovely house and plenty of servants; it means the choicest of\neating and drinking; it means everything you like, everything you want,\neverything you can think of. And what are you here? A mere drudge,\ntoiling and moiling early and late for your bare living and two cheap\ndresses a year. Think over it. [Soothingly] Youre shocked, I know. I can\nenter into your feelings; and I think they do you credit; but trust me,\nnobody will blame you: you may take my word for that. I know what young\ngirls are; and I know youll think better of it when you've turned it over\nin your mind.\n\nVIVIE. So that's how it is done, is it? You must have said all that to\nmany a woman, to have it so pat.\n\nMRS WARREN [passionately] What harm am I asking you to do? [Vivie turns\naway contemptuously. Mrs Warren continues desperately] Vivie: listen to\nme: you don't understand: you were taught wrong on purpose: you don't know\nwhat the world is really like.\n\nVIVIE [arrested] Taught wrong on purpose! What do you mean?\n\nMRS WARREN. I mean that youre throwing away all your chances for\nnothing. You think that people are what they pretend to be: that the way\nyou were taught at school and college to think right and proper is the\nway things really are. But it's not: it's all only a pretence, to keep\nthe cowardly slavish common run of people quiet. Do you want to find\nthat out, like other women, at forty, when you've thrown yourself away\nand lost your chances; or won't you take it in good time now from your\nown mother, that loves you and swears to you that it's truth: gospel\ntruth? [Urgently] Vivie: the big people, the clever people, the managing\npeople, all know it. They do as I do, and think what I think. I know\nplenty of them. I know them to speak to, to introduce you to, to make\nfriends of for you. I don't mean anything wrong: thats what you don't\nunderstand: your head is full of ignorant ideas about me. What do the\npeople that taught you know about life or about people like me? When did\nthey ever meet me, or speak to me, or let anyone tell them about me? the\nfools! Would they ever have done anything for you if I hadn't paid them?\nHavn't I told you that I want you to be respectable? Havn't I brought you\nup to be respectable? And how can you keep it up without my money and my\ninfluence and Lizzie's friends? Can't you see that youre cutting your own\nthroat as well as breaking my heart in turning your back on me?\n\nVIVIE. I recognize the Crofts philosophy of life, mother. I heard it all\nfrom him that day at the Gardners'.\n\nMRS WARREN. You think I want to force that played-out old sot on you! I\ndon't, Vivie: on my oath I don't.\n\nVIVIE. It would not matter if you did: you would not succeed. [Mrs\nWarren winces, deeply hurt by the implied indifference towards her\naffectionate intention. Vivie, neither understanding this nor concerning\nherself about it, goes on calmly] Mother: you don't at all know the sort\nof person I am. I don't object to Crofts more than to any other coarsely\nbuilt man of his class. To tell you the truth, I rather admire him\nfor being strongminded enough to enjoy himself in his own way and\nmake plenty of money instead of living the usual shooting, hunting,\ndining-out, tailoring, loafing life of his set merely because all\nthe rest do it. And I'm perfectly aware that if I'd been in the same\ncircumstances as my aunt Liz, I'd have done exactly what she did.\n\nI don't think I'm more prejudiced or straitlaced than you: I think\nI'm less. I'm certain I'm less sentimental. I know very well that\nfashionable morality is all a pretence, and that if I took your money\nand devoted the rest of my life to spending it fashionably, I might be\nas worthless and vicious as the silliest woman could possibly be without\nhaving a word said to me about it. But I don't want to be worthless. I\nshouldn't enjoy trotting about the park to advertize my dressmaker\nand carriage builder, or being bored at the opera to shew off a\nshopwindowful of diamonds.\n\nMRS WARREN [bewildered] But--\n\nVIVIE. Wait a moment: I've not done. Tell me why you continue your\nbusiness now that you are independent of it. Your sister, you told me,\nhas left all that behind her. Why don't you do the same?\n\nMRS WARREN. Oh, it's all very easy for Liz: she likes good society, and\nhas the air of being a lady. Imagine _me_ in a cathedral town! Why, the\nvery rooks in the trees would find me out even if I could stand\nthe dulness of it. I must have work and excitement, or I should go\nmelancholy mad. And what else is there for me to do? The life suits me:\nI'm fit for it and not for anything else. If I didn't do it somebody else\nwould; so I don't do any real harm by it. And then it brings in money;\nand I like making money. No: it's no use: I can't give it up--not for\nanybody. But what need you know about it? I'll never mention it. I'll\nkeep Crofts away. I'll not trouble you much: you see I have to be\nconstantly running about from one place to another. Youll be quit of me\naltogether when I die.\n\nVIVIE. No: I am my mother's daughter. I am like you: I must have work,\nand must make more money than I spend. But my work is not your work, and\nmy way is not your way. We must part. It will not make much difference\nto us: instead of meeting one another for perhaps a few months in twenty\nyears, we shall never meet: thats all.\n\nMRS WARREN [her voice stifled in tears] Vivie: I meant to have been more\nwith you: I did indeed.\n\nVIVIE. It's no use, mother: I am not to be changed by a few cheap tears\nand entreaties any more than you are, I daresay.\n\nMRS WARREN [wildly] Oh, you call a mother's tears cheap.\n\nVIVIE. They cost you nothing; and you ask me to give you the peace\nand quietness of my whole life in exchange for them. What use would my\ncompany be to you if you could get it? What have we two in common that\ncould make either of us happy together?\n\nMRS WARREN [lapsing recklessly into her dialect] We're mother and\ndaughter. I want my daughter. I've a right to you. Who is to care for me\nwhen I'm old? Plenty of girls have taken to me like daughters and cried\nat leaving me; but I let them all go because I had you to look forward\nto. I kept myself lonely for you. You've no right to turn on me now and\nrefuse to do your duty as a daughter.\n\nVIVIE [jarred and antagonized by the echo of the slums in her mother's\nvoice] My duty as a daughter! I thought we should come to that\npresently. Now once for all, mother, you want a daughter and Frank wants\na wife. I don't want a mother; and I don't want a husband. I have spared\nneither Frank nor myself in sending him about his business. Do you think\nI will spare you?\n\nMRS WARREN [violently] Oh, I know the sort you are: no mercy for\nyourself or anyone else. _I_ know. My experience has done that for me\nanyhow: I can tell the pious, canting, hard, selfish woman when I meet\nher. Well, keep yourself to yourself: _I_ don't want you. But listen to\nthis. Do you know what I would do with you if you were a baby again?\naye, as sure as there's a Heaven above us.\n\nVIVIE. Strangle me, perhaps.\n\nMRS WARREN. No: I'd bring you up to be a real daughter to me, and not\nwhat you are now, with your pride and your prejudices and the college\neducation you stole from me: yes, stole: deny it if you can: what was it\nbut stealing? I'd bring you up in my own house, I would.\n\nVIVIE [quietly] In one of your own houses.\n\nMRS WARREN [screaming] Listen to her! listen to how she spits on her\nmother's grey hairs! Oh, may you live to have your own daughter tear and\ntrample on you as you have trampled on me. And you will: you will. No\nwoman ever had luck with a mother's curse on her.\n\nVIVIE. I wish you wouldn't rant, mother. It only hardens me. Come: I\nsuppose I am the only young woman you ever had in your power that you\ndid good to. Don't spoil it all now.\n\nMRS WARREN. Yes, Heaven forgive me, it's true; and you are the only\none that ever turned on me. Oh, the injustice of it! the injustice! the\ninjustice! I always wanted to be a good woman. I tried honest work; and\nI was slave-driven until I cursed the day I ever heard of honest work. I\nwas a good mother; and because I made my daughter a good woman she turns\nme out as if I were a leper. Oh, if I only had my life to live over\nagain! I'd talk to that lying clergyman in the school. From this time\nforth, so help me Heaven in my last hour, I'll do wrong and nothing but\nwrong. And I'll prosper on it.\n\nVIVIE. Yes: it's better to choose your line and go through with it. If\nI had been you, mother, I might have done as you did; but I should not\nhave lived one life and believed in another. You are a conventional\nwoman at heart. That is why I am bidding you goodbye now. I am right, am\nI not?\n\nMRS WARREN [taken aback] Right to throw away all my money!\n\nVIVIE. No: right to get rid of you? I should be a fool not to. Isn't that\nso?\n\nMRS WARREN [sulkily] Oh well, yes, if you come to that, I suppose you\nare. But Lord help the world if everybody took to doing the right thing!\nAnd now I'd better go than stay where I'm not wanted. [She turns to the\ndoor].\n\nVIVIE [kindly] Won't you shake hands?\n\nMRS WARREN [after looking at her fiercely for a moment with a savage\nimpulse to strike her] No, thank you. Goodbye.\n\nVIVIE [matter-of-factly] Goodbye. [Mrs Warren goes out, slamming\nthe door behind her. The strain on Vivie's face relaxes; her grave\nexpression breaks up into one of joyous content; her breath goes out\nin a half sob, half laugh of intense relief. She goes buoyantly to her\nplace at the writing table; pushes the electric lamp out of the way;\npulls over a great sheaf of papers; and is in the act of dipping her pen\nin the ink when she finds Frank's note. She opens it unconcernedly\nand reads it quickly, giving a little laugh at some quaint turn of\nexpression in it]. And goodbye, Frank. [She tears the note up and tosses\nthe pieces into the wastepaper basket without a second thought. Then\nshe goes at her work with a plunge, and soon becomes absorbed in its\nfigures].", "title": "Mrs. Warren's Profession"}