{"summary": "The narrator, an elderly, unnamed Manhattan lawyer with a comfortable business, relates the story of the strangest man he has known: Bartleby. At the start of his story the lawyer already employs two scriveners to copy legal documents by hand: Nippers and Turkey. An increase in business leads him to advertise for a third, and he hires the forlorn-looking Bartleby in the hope that his calmness will soothe the irascible temperaments of the other two.\nAt first, Bartleby produces a large volume of high-quality work. But one day, when asked to help proofread a document, Bartleby answers with what soon becomes his perpetual response to every request—\"I would prefer not to.\" To the dismay of the lawyer and to the irritation of the other employees, Bartleby performs fewer and fewer tasks, and eventually none. The narrator makes several futile attempts to reason with him and to learn something about him; and when he stops by the office unexpectedly, he discovers that Bartleby has started living there.\nTension builds as business associates wonder why Bartleby is always there. Sensing the threat to his reputation but emotionally unable to evict Bartleby, the narrator moves his business out. Soon the new tenants come to ask for help: Bartleby still will not leave—he now sits on the stairs all day and sleeps in the building's doorway. The narrator visits him and attempts to reason with him, and surprises even himself by inviting Bartleby to come live with him. But Bartleby \"would prefer not to.\" Later the narrator returns to find that Bartleby has been forcibly removed and imprisoned in the Tombs. The narrator visits him. Finding Bartleby glummer than usual, he bribes a turnkey to make sure Bartleby gets enough food. But when he returns a few days later Bartleby has died of starvation, having preferred not to eat.\nSome time afterward, the narrator hears a rumor that Bartleby had worked in a dead letter office, and reflects that dead letters would have made anyone of Bartleby's temperament sink into an even darker gloom. The story closes with the narrator's resigned and pained sigh, \"Ah Bartleby! Ah humanity!\"\n\n", "full_text": "BARTLEBY, THE SCRIVENER.\n\nA STORY OF WALL-STREET.\n\nI am a rather elderly man.  The nature of my avocations for the last\nthirty years has brought me into more than ordinary contact with what\nwould seem an interesting and somewhat singular set of men, of whom as\nyet nothing that I know of has ever been written:--I mean the\nlaw-copyists or scriveners.  I have known very many of them,\nprofessionally and privately, and if I pleased, could relate divers\nhistories, at which good-natured gentlemen might smile, and sentimental\nsouls might weep.  But I waive the biographies of all other scriveners\nfor a few passages in the life of Bartleby, who was a scrivener of the\nstrangest I ever saw or heard of.  While of other law-copyists I might\nwrite the complete life, of Bartleby nothing of that sort can be done.\nI believe that no materials exist for a full and satisfactory biography\nof this man.  It is an irreparable loss to literature.  Bartleby was one\nof those beings of whom nothing is ascertainable, except from the\noriginal sources, and in his case those are very small.  What my own\nastonished eyes saw of Bartleby, _that_ is all I know of him, except,\nindeed, one vague report which will appear in the sequel.\n\nEre introducing the scrivener, as he first appeared to me, it is fit I\nmake some mention of myself, my _employees_, my business, my chambers,\nand general surroundings; because some such description is indispensable\nto an adequate understanding of the chief character about to be\npresented.\n\nImprimis:  I am a man who, from his youth upwards, has been filled with\na profound conviction that the easiest way of life is the best.  Hence,\nthough I belong to a profession proverbially energetic and nervous, even\nto turbulence, at times, yet nothing of that sort have I ever suffered\nto invade my peace.  I am one of those unambitious lawyers who never\naddresses a jury, or in any way draws down public applause; but in the\ncool tranquility of a snug retreat, do a snug business among rich men's\nbonds and mortgages and title-deeds.  All who know me, consider me an\neminently _safe_ man.  The late John Jacob Astor, a personage little\ngiven to poetic enthusiasm, had no hesitation in pronouncing my first\ngrand point to be prudence; my next, method.  I do not speak it in\nvanity, but simply record the fact, that I was not unemployed in my\nprofession by the late John Jacob Astor; a name which, I admit, I love\nto repeat, for it hath a rounded and orbicular sound to it, and rings\nlike unto bullion.  I will freely add, that I was not insensible to the\nlate John Jacob Astor's good opinion.\n\nSome time prior to the period at which this little history begins, my\navocations had been largely increased.  The good old office, now extinct\nin the State of New York, of a Master in Chancery, had been conferred\nupon me.  It was not a very arduous office, but very pleasantly\nremunerative.  I seldom lose my temper; much more seldom indulge in\ndangerous indignation at wrongs and outrages; but I must be permitted to\nbe rash here and declare, that I consider the sudden and violent\nabrogation of the office of Master in Chancery, by the new Constitution,\nas a--premature act; inasmuch as I had counted upon a life-lease of the\nprofits, whereas I only received those of a few short years.  But this\nis by the way.\n\nMy chambers were up stairs at No.--Wall-street.  At one end they looked\nupon the white wall of the interior of a spacious sky-light shaft,\npenetrating the building from top to bottom.  This view might have been\nconsidered rather tame than otherwise, deficient in what landscape\npainters call \"life.\"  But if so, the view from the other end of my\nchambers offered, at least, a contrast, if nothing more.  In that\ndirection my windows commanded an unobstructed view of a lofty brick\nwall, black by age and everlasting shade; which wall required no\nspy-glass to bring out its lurking beauties, but for the benefit of all\nnear-sighted spectators, was pushed up to within ten feet of my window\npanes.  Owing to the great height of the surrounding buildings, and my\nchambers being on the second floor, the interval between this wall and\nmine not a little resembled a huge square cistern.\n\nAt the period just preceding the advent of Bartleby, I had two persons\nas copyists in my employment, and a promising lad as an office-boy.\nFirst, Turkey; second, Nippers; third, Ginger Nut.  These may seem\nnames, the like of which are not usually found in the Directory.  In\ntruth they were nicknames, mutually conferred upon each other by my\nthree clerks, and were deemed expressive of their respective persons or\ncharacters.  Turkey was a short, pursy Englishman of about my own age,\nthat is, somewhere not far from sixty.  In the morning, one might say,\nhis face was of a fine florid hue, but after twelve o'clock,\nmeridian--his dinner hour--it blazed like a grate full of Christmas\ncoals; and continued blazing--but, as it were, with a gradual wane--till\n6 o'clock, P.M. or thereabouts, after which I saw no more of the\nproprietor of the face, which gaining its meridian with the sun, seemed\nto set with it, to rise, culminate, and decline the following day, with\nthe like regularity and undiminished glory.  There are many singular\ncoincidences I have known in the course of my life, not the least among\nwhich was the fact, that exactly when Turkey displayed his fullest beams\nfrom his red and radiant countenance, just then, too, at that critical\nmoment, began the daily period when I considered his business capacities\nas seriously disturbed for the remainder of the twenty-four hours.  Not\nthat he was absolutely idle, or averse to business then; far from it.\nThe difficulty was, he was apt to be altogether too energetic.  There\nwas a strange, inflamed, flurried, flighty recklessness of activity\nabout him.  He would be incautious in dipping his pen into his inkstand.\nAll his blots upon my documents, were dropped there after twelve\no'clock, meridian.  Indeed, not only would he be reckless and sadly\ngiven to making blots in the afternoon, but some days he went further,\nand was rather noisy.  At such times, too, his face flamed with\naugmented blazonry, as if cannel coal had been heaped on anthracite.  He\nmade an unpleasant racket with his chair; spilled his sand-box; in\nmending his pens, impatiently split them all to pieces, and threw them\non the floor in a sudden passion; stood up and leaned over his table,\nboxing his papers about in a most indecorous manner, very sad to behold\nin an elderly man like him.  Nevertheless, as he was in many ways a most\nvaluable person to me, and all the time before twelve o'clock, meridian,\nwas the quickest, steadiest creature too, accomplishing a great deal of\nwork in a style not easy to be matched--for these reasons, I was willing\nto overlook his eccentricities, though indeed, occasionally, I\nremonstrated with him.  I did this very gently, however, because, though\nthe civilest, nay, the blandest and most reverential of men in the\nmorning, yet in the afternoon he was disposed, upon provocation, to be\nslightly rash with his tongue, in fact, insolent.  Now, valuing his\nmorning services as I did, and resolved not to lose them; yet, at the\nsame time made uncomfortable by his inflamed ways after twelve o'clock;\nand being a man of peace, unwilling by my admonitions to call forth\nunseemly retorts from him; I took upon me, one Saturday noon (he was\nalways worse on Saturdays), to hint to him, very kindly, that perhaps\nnow that he was growing old, it might be well to abridge his labors; in\nshort, he need not come to my chambers after twelve o'clock, but, dinner\nover, had best go home to his lodgings and rest himself till teatime.\nBut no; he insisted upon his afternoon devotions.  His countenance\nbecame intolerably fervid, as he oratorically assured me--gesticulating\nwith a long ruler at the other end of the room--that if his services in\nthe morning were useful, how indispensable, then, in the afternoon?\n\n\"With submission, sir,\" said Turkey on this occasion, \"I consider myself\nyour right-hand man.  In the morning I but marshal and deploy my\ncolumns; but in the afternoon I put myself at their head, and gallantly\ncharge the foe, thus!\"--and he made a violent thrust with the ruler.\n\n\"But the blots, Turkey,\" intimated I.\n\n\"True,--but, with submission, sir, behold these hairs!  I am getting\nold.  Surely, sir, a blot or two of a warm afternoon is not to be\nseverely urged against gray hairs.  Old age--even if it blot the\npage--is honorable.  With submission, sir, we _both_ are getting old.\"\n\nThis appeal to my fellow-feeling was hardly to be resisted.  At all\nevents, I saw that go he would not.  So I made up my mind to let him\nstay, resolving, nevertheless, to see to it, that during the afternoon\nhe had to do with my less important papers.\n\nNippers, the second on my list, was a whiskered, sallow, and, upon the\nwhole, rather piratical-looking young man of about five and twenty.  I\nalways deemed him the victim of two evil powers--ambition and\nindigestion.  The ambition was evinced by a certain impatience of the\nduties of a mere copyist, an unwarrantable usurpation of strictly\nprofessional affairs, such as the original drawing up of legal\ndocuments.  The indigestion seemed betokened in an occasional nervous\ntestiness and grinning irritability, causing the teeth to audibly grind\ntogether over mistakes committed in copying; unnecessary maledictions,\nhissed, rather than spoken, in the heat of business; and especially by a\ncontinual discontent with the height of the table where he worked.\nThough of a very ingenious mechanical turn, Nippers could never get this\ntable to suit him.  He put chips under it, blocks of various sorts, bits\nof pasteboard, and at last went so far as to attempt an exquisite\nadjustment by final pieces of folded blotting paper.  But no invention\nwould answer.  If, for the sake of easing his back, he brought the table\nlid at a sharp angle well up towards his chin, and wrote there like a\nman using the steep roof of a Dutch house for his desk:--then he\ndeclared that it stopped the circulation in his arms.  If now he lowered\nthe table to his waistbands, and stooped over it in writing, then there\nwas a sore aching in his back.  In short, the truth of the matter was,\nNippers knew not what he wanted.  Or, if he wanted any thing, it was to\nbe rid of a scrivener's table altogether.  Among the manifestations of\nhis diseased ambition was a fondness he had for receiving visits from\ncertain ambiguous-looking fellows in seedy coats, whom he called his\nclients.  Indeed I was aware that not only was he, at times,\nconsiderable of a ward-politician, but he occasionally did a little\nbusiness at the Justices' courts, and was not unknown on the steps of\nthe Tombs.  I have good reason to believe, however, that one individual\nwho called upon him at my chambers, and who, with a grand air, he\ninsisted was his client, was no other than a dun, and the alleged\ntitle-deed, a bill.  But with all his failings, and the annoyances he\ncaused me, Nippers, like his compatriot Turkey, was a very useful man to\nme; wrote a neat, swift hand; and, when he chose, was not deficient in a\ngentlemanly sort of deportment.  Added to this, he always dressed in a\ngentlemanly sort of way; and so, incidentally, reflected credit upon my\nchambers.  Whereas with respect to Turkey, I had much ado to keep him\nfrom being a reproach to me.  His clothes were apt to look oily and\nsmell of eating-houses.  He wore his pantaloons very loose and baggy in\nsummer.  His coats were execrable; his hat not to be handled.  But while\nthe hat was a thing of indifference to me, inasmuch as his natural\ncivility and deference, as a dependent Englishman, always led him to\ndoff it the moment he entered the room, yet his coat was another matter.\nConcerning his coats, I reasoned with him; but with no effect.  The\ntruth was, I suppose, that a man of so small an income, could not afford\nto sport such a lustrous face and a lustrous coat at one and the same\ntime.  As Nippers once observed, Turkey's money went chiefly for red\nink.  One winter day I presented Turkey with a highly-respectable\nlooking coat of my own, a padded gray coat, of a most comfortable\nwarmth, and which buttoned straight up from the knee to the neck.  I\nthought Turkey would appreciate the favor, and abate his rashness and\nobstreperousness of afternoons.  But no.  I verily believe that\nbuttoning himself up in so downy and blanket-like a coat had a\npernicious effect upon him; upon the same principle that too much oats\nare bad for horses.  In fact, precisely as a rash, restive horse is said\nto feel his oats, so Turkey felt his coat.  It made him insolent.  He\nwas a man whom prosperity harmed.\n\nThough concerning the self-indulgent habits of Turkey I had my own\nprivate surmises, yet touching Nippers I was well persuaded that\nwhatever might be his faults in other respects, he was, at least, a\ntemperate young man.  But indeed, nature herself seemed to have been his\nvintner, and at his birth charged him so thoroughly with an irritable,\nbrandy-like disposition, that all subsequent potations were needless.\nWhen I consider how, amid the stillness of my chambers, Nippers would\nsometimes impatiently rise from his seat, and stooping over his table,\nspread his arms wide apart, seize the whole desk, and move it, and jerk\nit, with a grim, grinding motion on the floor, as if the table were a\nperverse voluntary agent, intent on thwarting and vexing him; I plainly\nperceive that for Nippers, brandy and water were altogether superfluous.\n\nIt was fortunate for me that, owing to its peculiar\ncause--indigestion--the irritability and consequent nervousness of\nNippers, were mainly observable in the morning, while in the afternoon\nhe was comparatively mild.  So that Turkey's paroxysms only coming on\nabout twelve o'clock, I never had to do with their eccentricities at one\ntime.  Their fits relieved each other like guards.  When Nippers' was\non, Turkey's was off; and _vice versa_.  This was a good natural\narrangement under the circumstances.\n\nGinger Nut, the third on my list, was a lad some twelve years old.  His\nfather was a carman, ambitious of seeing his son on the bench instead of\na cart, before he died.  So he sent him to my office as student at law,\nerrand boy, and cleaner and sweeper, at the rate of one dollar a week.\nHe had a little desk to himself, but he did not use it much.  Upon\ninspection, the drawer exhibited a great array of the shells of various\nsorts of nuts.  Indeed, to this quick-witted youth the whole noble\nscience of the law was contained in a nut-shell.  Not the least among\nthe employments of Ginger Nut, as well as one which he discharged with\nthe most alacrity, was his duty as cake and apple purveyor for Turkey\nand Nippers.  Copying law papers being proverbially dry, husky sort of\nbusiness, my two scriveners were fain to moisten their mouths very often\nwith Spitzenbergs to be had at the numerous stalls nigh the Custom\nHouse and Post Office.  Also, they sent Ginger Nut very frequently for\nthat peculiar cake--small, flat, round, and very spicy--after which he\nhad been named by them.  Of a cold morning when business was but dull,\nTurkey would gobble up scores of these cakes, as if they were mere\nwafers--indeed they sell them at the rate of six or eight for a\npenny--the scrape of his pen blending with the crunching of the crisp\nparticles in his mouth.  Of all the fiery afternoon blunders and\nflurried rashnesses of Turkey, was his once moistening a ginger-cake\nbetween his lips, and clapping it on to a mortgage for a seal.  I came\nwithin an ace of dismissing him then.  But he mollified me by making an\noriental bow, and saying--\"With submission, sir, it was generous of me\nto find you in stationery on my own account.\"\n\nNow my original business--that of a conveyancer and title hunter, and\ndrawer-up of recondite documents of all sorts--was considerably\nincreased by receiving the master's office.  There was now great work\nfor scriveners.  Not only must I push the clerks already with me, but I\nmust have additional help.  In answer to my advertisement, a motionless\nyoung man one morning, stood upon my office threshold, the door being\nopen, for it was summer.  I can see that figure now--pallidly neat,\npitiably respectable, incurably forlorn!  It was Bartleby.\n\nAfter a few words touching his qualifications, I engaged him, glad to\nhave among my corps of copyists a man of so singularly sedate an aspect,\nwhich I thought might operate beneficially upon the flighty temper of\nTurkey, and the fiery one of Nippers.\n\nI should have stated before that ground glass folding-doors divided my\npremises into two parts, one of which was occupied by my scriveners, the\nother by myself.  According to my humor I threw open these doors, or\nclosed them.  I resolved to assign Bartleby a corner by the\nfolding-doors, but on my side of them, so as to have this quiet man\nwithin easy call, in case any trifling thing was to be done.  I placed\nhis desk close up to a small side-window in that part of the room, a\nwindow which originally had afforded a lateral view of certain grimy\nback-yards and bricks, but which, owing to subsequent erections,\ncommanded at present no view at all, though it gave some light.  Within\nthree feet of the panes was a wall, and the light came down from far\nabove, between two lofty buildings, as from a very small opening in a\ndome.  Still further to a satisfactory arrangement, I procured a high\ngreen folding screen, which might entirely isolate Bartleby from my\nsight, though not remove him from my voice.  And thus, in a manner,\nprivacy and society were conjoined.\n\nAt first Bartleby did an extraordinary quantity of writing.  As if long\nfamishing for something to copy, he seemed to gorge himself on my\ndocuments.  There was no pause for digestion.  He ran a day and night\nline, copying by sun-light and by candle-light.  I should have been\nquite delighted with his application, had he been cheerfully\nindustrious.  But he wrote on silently, palely, mechanically.\n\nIt is, of course, an indispensable part of a scrivener's business to\nverify the accuracy of his copy, word by word.  Where there are two or\nmore scriveners in an office, they assist each other in this\nexamination, one reading from the copy, the other holding the original.\nIt is a very dull, wearisome, and lethargic affair.  I can readily\nimagine that to some sanguine temperaments it would be altogether\nintolerable.  For example, I cannot credit that the mettlesome poet\nByron would have contentedly sat down with Bartleby to examine a law\ndocument of, say five hundred pages, closely written in a crimpy hand.\n\nNow and then, in the haste of business, it had been my habit to assist\nin comparing some brief document myself, calling Turkey or Nippers for\nthis purpose.  One object I had in placing Bartleby so handy to me\nbehind the screen, was to avail myself of his services on such trivial\noccasions.  It was on the third day, I think, of his being with me, and\nbefore any necessity had arisen for having his own writing examined,\nthat, being much hurried to complete a small affair I had in hand, I\nabruptly called to Bartleby.  In my haste and natural expectancy of\ninstant compliance, I sat with my head bent over the original on my\ndesk, and my right hand sideways, and somewhat nervously extended with\nthe copy, so that immediately upon emerging from his retreat, Bartleby\nmight snatch it and proceed to business without the least delay.\n\nIn this very attitude did I sit when I called to him, rapidly stating\nwhat it was I wanted him to do--namely, to examine a small paper with\nme.  Imagine my surprise, nay, my consternation, when without moving\nfrom his privacy, Bartleby in a singularly mild, firm voice, replied, \"I\nwould prefer not to.\"\n\nI sat awhile in perfect silence, rallying my stunned faculties.\nImmediately it occurred to me that my ears had deceived me, or Bartleby\nhad entirely misunderstood my meaning.  I repeated my request in the\nclearest tone I could assume.  But in quite as clear a one came the\nprevious reply, \"I would prefer not to.\"\n\n\"Prefer not to,\" echoed I, rising in high excitement, and crossing the\nroom with a stride.  \"What do you mean?  Are you moon-struck?  I want\nyou to help me compare this sheet here--take it,\" and I thrust it\ntowards him.\n\n\"I would prefer not to,\" said he.\n\nI looked at him steadfastly.  His face was leanly composed; his gray eye\ndimly calm.  Not a wrinkle of agitation rippled him.  Had there been the\nleast uneasiness, anger, impatience or impertinence in his manner; in\nother words, had there been any thing ordinarily human about him,\ndoubtless I should have violently dismissed him from the premises.  But\nas it was, I should have as soon thought of turning my pale\nplaster-of-paris bust of Cicero out of doors.  I stood gazing at him\nawhile, as he went on with his own writing, and then reseated myself at\nmy desk.  This is very strange, thought I.  What had one best do?  But\nmy business hurried me.  I concluded to forget the matter for the\npresent, reserving it for my future leisure.  So calling Nippers from\nthe other room, the paper was speedily examined.\n\nA few days after this, Bartleby concluded four lengthy documents, being\nquadruplicates of a week's testimony taken before me in my High Court of\nChancery.  It became necessary to examine them.  It was an important\nsuit, and great accuracy was imperative.  Having all things arranged I\ncalled Turkey, Nippers and Ginger Nut from the next room, meaning to\nplace the four copies in the hands of my four clerks, while I should\nread from the original.  Accordingly Turkey, Nippers and Ginger Nut had\ntaken their seats in a row, each with his document in hand, when I\ncalled to Bartleby to join this interesting group.\n\n\"Bartleby!  quick, I am waiting.\"\n\nI heard a slow scrape of his chair legs on the uncarpeted floor, and\nsoon he appeared standing at the entrance of his hermitage.\n\n\"What is wanted?\" said he mildly.\n\n\"The copies, the copies,\" said I hurriedly.  \"We are going to examine\nthem.  There\"--and I held towards him the fourth quadruplicate.\n\n\"I would prefer not to,\" he said, and gently disappeared behind the\nscreen.\n\nFor a few moments I was turned into a pillar of salt, standing at the\nhead of my seated column of clerks.  Recovering myself, I advanced\ntowards the screen, and demanded the reason for such extraordinary\nconduct.\n\n\"_Why_ do you refuse?\"\n\n\"I would prefer not to.\"\n\nWith any other man I should have flown outright into a dreadful passion,\nscorned all further words, and thrust him ignominiously from my\npresence.  But there was something about Bartleby that not only\nstrangely disarmed me, but in a wonderful manner touched and\ndisconcerted me.  I began to reason with him.\n\n\"These are your own copies we are about to examine.  It is labor saving\nto you, because one examination will answer for your four papers.  It is\ncommon usage.  Every copyist is bound to help examine his copy.  Is it\nnot so?  Will you not speak?  Answer!\"\n\n\"I prefer not to,\" he replied in a flute-like tone.  It seemed to me\nthat while I had been addressing him, he carefully revolved every\nstatement that I made; fully comprehended the meaning; could not gainsay\nthe irresistible conclusions; but, at the same time, some paramount\nconsideration prevailed with him to reply as he did.\n\n\"You are decided, then, not to comply with my request--a request made\naccording to common usage and common sense?\"\n\nHe briefly gave me to understand that on that point my judgment was\nsound.  Yes:  his decision was irreversible.\n\nIt is not seldom the case that when a man is browbeaten in some\nunprecedented and violently unreasonable way, he begins to stagger in\nhis own plainest faith.  He begins, as it were, vaguely to surmise that,\nwonderful as it may be, all the justice and all the reason is on the\nother side.  Accordingly, if any disinterested persons are present, he\nturns to them for some reinforcement for his own faltering mind.\n\n\"Turkey,\" said I, \"what do you think of this?  Am I not right?\"\n\n\"With submission, sir,\" said Turkey, with his blandest tone, \"I think\nthat you are.\"\n\n\"Nippers,\" said I, \"what do _you_ think of it?\"\n\n\"I think I should kick him out of the office.\"\n\n(The reader of nice perceptions will here perceive that, it being\nmorning, Turkey's answer is couched in polite and tranquil terms, but\nNippers replies in ill-tempered ones.  Or, to repeat a previous\nsentence, Nippers' ugly mood was on duty and Turkey's off.)\n\n\"Ginger Nut,\" said I, willing to enlist the smallest suffrage in my\nbehalf, \"what do you think of it?\"\n\n\"I think, sir, he's a little _luny_,\" replied Ginger Nut with a grin.\n\n\"You hear what they say,\" said I, turning towards the screen, \"come\nforth and do your duty.\"\n\nBut he vouchsafed no reply.  I pondered a moment in sore perplexity.\nBut once more business hurried me.  I determined again to postpone the\nconsideration of this dilemma to my future leisure.  With a little\ntrouble we made out to examine the papers without Bartleby, though at\nevery page or two, Turkey deferentially dropped his opinion that this\nproceeding was quite out of the common; while Nippers, twitching in his\nchair with a dyspeptic nervousness, ground out between his set teeth\noccasional hissing maledictions against the stubborn oaf behind the\nscreen.  And for his (Nippers') part, this was the first and the last\ntime he would do another man's business without pay.\n\nMeanwhile Bartleby sat in his hermitage, oblivious to every thing but\nhis own peculiar business there.\n\nSome days passed, the scrivener being employed upon another lengthy\nwork.  His late remarkable conduct led me to regard his ways narrowly.\nI observed that he never went to dinner; indeed that he never went any\nwhere.  As yet I had never of my personal knowledge known him to be\noutside of my office.  He was a perpetual sentry in the corner.  At\nabout eleven o'clock though, in the morning, I noticed that Ginger Nut\nwould advance toward the opening in Bartleby's screen, as if silently\nbeckoned thither by a gesture invisible to me where I sat.  The boy\nwould then leave the office jingling a few pence, and reappear with a\nhandful of ginger-nuts which he delivered in the hermitage, receiving\ntwo of the cakes for his trouble.\n\nHe lives, then, on ginger-nuts, thought I; never eats a dinner, properly\nspeaking; he must be a vegetarian then; but no; he never eats even\nvegetables, he eats nothing but ginger-nuts.  My mind then ran on in\nreveries concerning the probable effects upon the human constitution of\nliving entirely on ginger-nuts.  Ginger-nuts are so called because they\ncontain ginger as one of their peculiar constituents, and the final\nflavoring one.  Now what was ginger?  A hot, spicy thing.  Was Bartleby\nhot and spicy?  Not at all.  Ginger, then, had no effect upon Bartleby.\nProbably he preferred it should have none.\n\nNothing so aggravates an earnest person as a passive resistance.  If the\nindividual so resisted be of a not inhumane temper, and the resisting\none perfectly harmless in his passivity; then, in the better moods of\nthe former, he will endeavor charitably to construe to his imagination\nwhat proves impossible to be solved by his judgment.  Even so, for the\nmost part, I regarded Bartleby and his ways.  Poor fellow! thought I, he\nmeans no mischief; it is plain he intends no insolence; his aspect\nsufficiently evinces that his eccentricities are involuntary.  He is\nuseful to me.  I can get along with him.  If I turn him away, the\nchances are he will fall in with some less indulgent employer, and then\nhe will be rudely treated, and perhaps driven forth miserably to starve.\nYes.  Here I can cheaply purchase a delicious self-approval.  To\nbefriend Bartleby; to humor him in his strange willfulness, will cost me\nlittle or nothing, while I lay up in my soul what will eventually prove\na sweet morsel for my conscience.  But this mood was not invariable with\nme.  The passiveness of Bartleby sometimes irritated me.  I felt\nstrangely goaded on to encounter him in new opposition, to elicit some\nangry spark from him answerable to my own.  But indeed I might as well\nhave essayed to strike fire with my knuckles against a bit of Windsor\nsoap.  But one afternoon the evil impulse in me mastered me, and the\nfollowing little scene ensued:\n\n\"Bartleby,\" said I, \"when those papers are all copied, I will compare\nthem with you.\"\n\n\"I would prefer not to.\"\n\n\"How?  Surely you do not mean to persist in that mulish vagary?\"\n\nNo answer.\n\nI threw open the folding-doors near by, and turning upon Turkey and\nNippers, exclaimed in an excited manner--\n\n\"He says, a second time, he won't examine his papers.  What do you think\nof it, Turkey?\"\n\nIt was afternoon, be it remembered.  Turkey sat glowing like a brass\nboiler, his bald head steaming, his hands reeling among his blotted\npapers.\n\n\"Think of it?\" roared Turkey; \"I think I'll just step behind his screen,\nand black his eyes for him!\"\n\nSo saying, Turkey rose to his feet and threw his arms into a pugilistic\nposition.  He was hurrying away to make good his promise, when I\ndetained him, alarmed at the effect of incautiously rousing Turkey's\ncombativeness after dinner.\n\n\"Sit down, Turkey,\" said I, \"and hear what Nippers has to say.  What do\nyou think of it, Nippers?  Would I not be justified in immediately\ndismissing Bartleby?\"\n\n\"Excuse me, that is for you to decide, sir.  I think his conduct quite\nunusual, and indeed unjust, as regards Turkey and myself.  But it may\nonly be a passing whim.\"\n\n\"Ah,\" exclaimed I, \"you have strangely changed your mind then--you speak\nvery gently of him now.\"\n\n\"All beer,\" cried Turkey; \"gentleness is effects of beer--Nippers and I\ndined together to-day.  You see how gentle _I_ am, sir.  Shall I go and\nblack his eyes?\"\n\n\"You refer to Bartleby, I suppose.  No, not to-day, Turkey,\" I replied;\n\"pray, put up your fists.\"\n\nI closed the doors, and again advanced towards Bartleby.  I felt\nadditional incentives tempting me to my fate.  I burned to be rebelled\nagainst again.  I remembered that Bartleby never left the office.\n\n\"Bartleby,\" said I, \"Ginger Nut is away; just step round to the Post\nOffice, won't you? (it was but a three minute walk,) and see if there is\nany thing for me.\"\n\n\"I would prefer not to.\"\n\n\"You _will_ not?\"\n\n\"I _prefer_ not.\"\n\nI staggered to my desk, and sat there in a deep study.  My blind\ninveteracy returned.  Was there any other thing in which I could procure\nmyself to be ignominiously repulsed by this lean, penniless wight?--my\nhired clerk?  What added thing is there, perfectly reasonable, that he\nwill be sure to refuse to do?\n\n\"Bartleby!\"\n\nNo answer.\n\n\"Bartleby,\" in a louder tone.\n\nNo answer.\n\n\"Bartleby,\" I roared.\n\nLike a very ghost, agreeably to the laws of magical invocation, at the\nthird summons, he appeared at the entrance of his hermitage.\n\n\"Go to the next room, and tell Nippers to come to me.\"\n\n\"I prefer not to,\" he respectfully and slowly said, and mildly\ndisappeared.\n\n\"Very good, Bartleby,\" said I, in a quiet sort of serenely severe\nself-possessed tone, intimating the unalterable purpose of some terrible\nretribution very close at hand.  At the moment I half intended something\nof the kind.  But upon the whole, as it was drawing towards my\ndinner-hour, I thought it best to put on my hat and walk home for the\nday, suffering much from perplexity and distress of mind.\n\nShall I acknowledge it?  The conclusion of this whole business was, that\nit soon became a fixed fact of my chambers, that a pale young scrivener,\nby the name of Bartleby, and a desk there; that he copied for me at the\nusual rate of four cents a folio (one hundred words); but he was\npermanently exempt from examining the work done by him, that duty being\ntransferred to Turkey and Nippers, one of compliment doubtless to their\nsuperior acuteness; moreover, said Bartleby was never on any account to\nbe dispatched on the most trivial errand of any sort; and that even if\nentreated to take upon him such a matter, it was generally understood\nthat he would prefer not to--in other words, that he would refuse\npointblank.\n\nAs days passed on, I became considerably reconciled to Bartleby.  His\nsteadiness, his freedom from all dissipation, his incessant industry\n(except when he chose to throw himself into a standing revery behind his\nscreen), his great stillness, his unalterableness of demeanor under all\ncircumstances, made him a valuable acquisition.  One prime thing was\nthis,--_he was always there;_--first in the morning, continually\nthrough the day, and the last at night.  I had a singular confidence in\nhis honesty.  I felt my most precious papers perfectly safe in his\nhands.  Sometimes to be sure I could not, for the very soul of me, avoid\nfalling into sudden spasmodic passions with him.  For it was exceeding\ndifficult to bear in mind all the time those strange peculiarities,\nprivileges, and unheard of exemptions, forming the tacit stipulations on\nBartleby's part under which he remained in my office.  Now and then, in\nthe eagerness of dispatching pressing business, I would inadvertently\nsummon Bartleby, in a short, rapid tone, to put his finger, say, on the\nincipient tie of a bit of red tape with which I was about compressing\nsome papers.  Of course, from behind the screen the usual answer, \"I\nprefer not to,\" was sure to come; and then, how could a human creature\nwith the common infirmities of our nature, refrain from bitterly\nexclaiming upon such perverseness--such unreasonableness.  However,\nevery added repulse of this sort which I received only tended to lessen\nthe probability of my repeating the inadvertence.\n\nHere it must be said, that according to the custom of most legal\ngentlemen occupying chambers in densely-populated law buildings, there\nwere several keys to my door.  One was kept by a woman residing in the\nattic, which person weekly scrubbed and daily swept and dusted my\napartments.  Another was kept by Turkey for convenience sake.  The third\nI sometimes carried in my own pocket.  The fourth I knew not who had.\n\nNow, one Sunday morning I happened to go to Trinity Church, to hear a\ncelebrated preacher, and finding myself rather early on the ground, I\nthought I would walk around to my chambers for a while.  Luckily I had\nmy key with me; but upon applying it to the lock, I found it resisted by\nsomething inserted from the inside.  Quite surprised, I called out; when\nto my consternation a key was turned from within; and thrusting his lean\nvisage at me, and holding the door ajar, the apparition of Bartleby\nappeared, in his shirt sleeves, and otherwise in a strangely tattered\ndishabille, saying quietly that he was sorry, but he was deeply engaged\njust then, and--preferred not admitting me at present.  In a brief word\nor two, he moreover added, that perhaps I had better walk round the\nblock two or three times, and by that time he would probably have\nconcluded his affairs.\n\nNow, the utterly unsurmised appearance of Bartleby, tenanting my\nlaw-chambers of a Sunday morning, with his cadaverously gentlemanly\n_nonchalance_, yet withal firm and self-possessed, had such a strange\neffect upon me, that incontinently I slunk away from my own door, and\ndid as desired.  But not without sundry twinges of impotent rebellion\nagainst the mild effrontery of this unaccountable scrivener.  Indeed, it\nwas his wonderful mildness chiefly, which not only disarmed me, but\nunmanned me, as it were.  For I consider that one, for the time, is a\nsort of unmanned when he tranquilly permits his hired clerk to dictate\nto him, and order him away from his own premises.  Furthermore, I was\nfull of uneasiness as to what Bartleby could possibly be doing in my\noffice in his shirt sleeves, and in an otherwise dismantled condition of\na Sunday morning.  Was any thing amiss going on?  Nay, that was out of\nthe question.  It was not to be thought of for a moment that Bartleby\nwas an immoral person.  But what could he be doing there?--copying?  Nay\nagain, whatever might be his eccentricities, Bartleby was an eminently\ndecorous person.  He would be the last man to sit down to his desk in\nany state approaching to nudity.  Besides, it was Sunday; and there was\nsomething about Bartleby that forbade the supposition that he would by\nany secular occupation violate the proprieties of the day.\n\nNevertheless, my mind was not pacified; and full of a restless\ncuriosity, at last I returned to the door.  Without hindrance I inserted\nmy key, opened it, and entered.  Bartleby was not to be seen.  I looked\nround anxiously, peeped behind his screen; but it was very plain that he\nwas gone.  Upon more closely examining the place, I surmised that for an\nindefinite period Bartleby must have ate, dressed, and slept in my\noffice, and that too without plate, mirror, or bed.  The cushioned seat\nof a rickety old sofa in one corner bore the faint impress of a lean,\nreclining form.  Rolled away under his desk, I found a blanket; under\nthe empty grate, a blacking box and brush; on a chair, a tin basin, with\nsoap and a ragged towel; in a newspaper a few crumbs of ginger-nuts and\na morsel of cheese.  Yes, thought I, it is evident enough that Bartleby\nhas been making his home here, keeping bachelor's hall all by himself.\nImmediately then the thought came sweeping across me, What miserable\nfriendlessness and loneliness are here revealed!  His poverty is great;\nbut his solitude, how horrible!  Think of it.  Of a Sunday, Wall-street\nis deserted as Petra; and every night of every day it is an emptiness.\nThis building too, which of week-days hums with industry and life, at\nnightfall echoes with sheer vacancy, and all through Sunday is forlorn.\nAnd here Bartleby makes his home; sole spectator of a solitude which he\nhas seen all populous--a sort of innocent and transformed Marius\nbrooding among the ruins of Carthage!\n\nFor the first time in my life a feeling of overpowering stinging\nmelancholy seized me.  Before, I had never experienced aught but a\nnot-unpleasing sadness.  The bond of a common humanity now drew me\nirresistibly to gloom.  A fraternal melancholy!  For both I and Bartleby\nwere sons of Adam.  I remembered the bright silks and sparkling faces I\nhad seen that day, in gala trim, swan-like sailing down the Mississippi\nof Broadway; and I contrasted them with the pallid copyist, and thought\nto myself, Ah, happiness courts the light, so we deem the world is gay;\nbut misery hides aloof, so we deem that misery there is none.  These sad\nfancyings--chimeras, doubtless, of a sick and silly brain--led on to\nother and more special thoughts, concerning the eccentricities of\nBartleby.  Presentiments of strange discoveries hovered round me.  The\nscrivener's pale form appeared to me laid out, among uncaring strangers,\nin its shivering winding sheet.\n\nSuddenly I was attracted by Bartleby's closed desk, the key in open\nsight left in the lock.\n\nI mean no mischief, seek the gratification of no heartless curiosity,\nthought I; besides, the desk is mine, and its contents too, so I will\nmake bold to look within.  Every thing was methodically arranged, the\npapers smoothly placed.  The pigeon holes were deep, and removing the\nfiles of documents, I groped into their recesses.  Presently I felt\nsomething there, and dragged it out.  It was an old bandanna\nhandkerchief, heavy and knotted.  I opened it, and saw it was a savings'\nbank.\n\nI now recalled all the quiet mysteries which I had noted in the man.  I\nremembered that he never spoke but to answer; that though at intervals\nhe had considerable time to himself, yet I had never seen him\nreading--no, not even a newspaper; that for long periods he would stand\nlooking out, at his pale window behind the screen, upon the dead brick\nwall; I was quite sure he never visited any refectory or eating house;\nwhile his pale face clearly indicated that he never drank beer like\nTurkey, or tea and coffee even, like other men; that he never went any\nwhere in particular that I could learn; never went out for a walk,\nunless indeed that was the case at present; that he had declined telling\nwho he was, or whence he came, or whether he had any relatives in the\nworld; that though so thin and pale, he never complained of ill health.\nAnd more than all, I remembered a certain unconscious air of pallid--how\nshall I call it?--of pallid haughtiness, say, or rather an austere\nreserve about him, which had positively awed me into my tame compliance\nwith his eccentricities, when I had feared to ask him to do the\nslightest incidental thing for me, even though I might know, from his\nlong-continued motionlessness, that behind his screen he must be\nstanding in one of those dead-wall reveries of his.\n\nRevolving all these things, and coupling them with the recently\ndiscovered fact that he made my office his constant abiding place and\nhome, and not forgetful of his morbid moodiness; revolving all these\nthings, a prudential feeling began to steal over me.  My first emotions\nhad been those of pure melancholy and sincerest pity; but just in\nproportion as the forlornness of Bartleby grew and grew to my\nimagination, did that same melancholy merge into fear, that pity into\nrepulsion.  So true it is, and so terrible too, that up to a certain\npoint the thought or sight of misery enlists our best affections; but,\nin certain special cases, beyond that point it does not.  They err who\nwould assert that invariably this is owing to the inherent selfishness\nof the human heart.  It rather proceeds from a certain hopelessness of\nremedying excessive and organic ill.  To a sensitive being, pity is not\nseldom pain.  And when at last it is perceived that such pity cannot\nlead to effectual succor, common sense bids the soul rid of it.  What I\nsaw that morning persuaded me that the scrivener was the victim of\ninnate and incurable disorder.  I might give alms to his body; but his\nbody did not pain him; it was his soul that suffered, and his soul I\ncould not reach.\n\nI did not accomplish the purpose of going to Trinity Church that\nmorning.  Somehow, the things I had seen disqualified me for the time\nfrom church-going.  I walked homeward, thinking what I would do with\nBartleby.  Finally, I resolved upon this;--I would put certain calm\nquestions to him the next morning, touching his history, etc., and if he\ndeclined to answer them openly and unreservedly (and I supposed he would\nprefer not), then to give him a twenty dollar bill over and above\nwhatever I might owe him, and tell him his services were no longer\nrequired; but that if in any other way I could assist him, I would be\nhappy to do so, especially if he desired to return to his native place,\nwherever that might be, I would willingly help to defray the expenses.\nMoreover, if, after reaching home, he found himself at any time in want\nof aid, a letter from him would be sure of a reply.\n\nThe next morning came.\n\n\"Bartleby,\" said I, gently calling to him behind his screen.\n\nNo reply.\n\n\"Bartleby,\" said I, in a still gentler tone, \"come here; I am not going\nto ask you to do any thing you would prefer not to do--I simply wish to\nspeak to you.\"\n\nUpon this he noiselessly slid into view.\n\n\"Will you tell me, Bartleby, where you were born?\"\n\n\"I would prefer not to.\"\n\n\"Will you tell me _any thing_ about yourself?\"\n\n\"I would prefer not to.\"\n\n\"But what reasonable objection can you have to speak to me?  I feel\nfriendly towards you.\"\n\nHe did not look at me while I spoke, but kept his glance fixed upon my\nbust of Cicero, which as I then sat, was directly behind me, some six\ninches above my head.\n\n\"What is your answer, Bartleby?\" said I, after waiting a considerable\ntime for a reply, during which his countenance remained immovable, only\nthere was the faintest conceivable tremor of the white attenuated mouth.\n\n\"At present I prefer to give no answer,\" he said, and retired into his\nhermitage.\n\nIt was rather weak in me I confess, but his manner on this occasion\nnettled me.  Not only did there seem to lurk in it a certain calm\ndisdain, but his perverseness seemed ungrateful, considering the\nundeniable good usage and indulgence he had received from me.\n\nAgain I sat ruminating what I should do.  Mortified as I was at his\nbehavior, and resolved as I had been to dismiss him when I entered my\noffices, nevertheless I strangely felt something superstitious knocking\nat my heart, and forbidding me to carry out my purpose, and denouncing\nme for a villain if I dared to breathe one bitter word against this\nforlornest of mankind.  At last, familiarly drawing my chair behind his\nscreen, I sat down and said: \"Bartleby, never mind then about revealing\nyour history; but let me entreat you, as a friend, to comply as far as\nmay be with the usages of this office.  Say now you will help to examine\npapers to-morrow or next day: in short, say now that in a day or two you\nwill begin to be a little reasonable:--say so, Bartleby.\"\n\n\"At present I would prefer not to be a little reasonable,\" was his\nmildly cadaverous reply.\n\nJust then the folding-doors opened, and Nippers approached.  He seemed\nsuffering from an unusually bad night's rest, induced by severer\nindigestion than common.  He overheard those final words of Bartleby.\n\n\"_Prefer not_, eh?\" gritted Nippers--\"I'd _prefer_ him, if I were you,\nsir,\" addressing me--\"I'd _prefer_ him; I'd give him preferences, the\nstubborn mule!  What is it, sir, pray, that he _prefers_ not to do now?\"\n\nBartleby moved not a limb.\n\n\"Mr. Nippers,\" said I, \"I'd prefer that you would withdraw for the\npresent.\"\n\nSomehow, of late I had got into the way of involuntarily using this word\n\"prefer\" upon all sorts of not exactly suitable occasions.  And I\ntrembled to think that my contact with the scrivener had already and\nseriously affected me in a mental way.  And what further and deeper\naberration might it not yet produce?  This apprehension had not been\nwithout efficacy in determining me to summary means.\n\nAs Nippers, looking very sour and sulky, was departing, Turkey blandly\nand deferentially approached.\n\n\"With submission, sir,\" said he, \"yesterday I was thinking about\nBartleby here, and I think that if he would but prefer to take a quart\nof good ale every day, it would do much towards mending him, and\nenabling him to assist in examining his papers.\"\n\n\"So you have got the word too,\" said I, slightly excited.\n\n\"With submission, what word, sir,\" asked Turkey, respectfully crowding\nhimself into the contracted space behind the screen, and by so doing,\nmaking me jostle the scrivener.  \"What word, sir?\"\n\n\"I would prefer to be left alone here,\" said Bartleby, as if offended at\nbeing mobbed in his privacy.\n\n\"_That's_ the word, Turkey,\" said I--\"that's it.\"\n\n\"Oh, _prefer_? oh yes--queer word.  I never use it myself.  But, sir, as\nI was saying, if he would but prefer--\"\n\n\"Turkey,\" interrupted I, \"you will please withdraw.\"\n\n\"Oh certainly, sir, if you prefer that I should.\"\n\nAs he opened the folding-door to retire, Nippers at his desk caught a\nglimpse of me, and asked whether I would prefer to have a certain paper\ncopied on blue paper or white.  He did not in the least roguishly accent\nthe word prefer.  It was plain that it involuntarily rolled from his\ntongue.  I thought to myself, surely I must get rid of a demented man,\nwho already has in some degree turned the tongues, if not the heads of\nmyself and clerks.  But I thought it prudent not to break the dismission\nat once.\n\nThe next day I noticed that Bartleby did nothing but stand at his window\nin his dead-wall revery.  Upon asking him why he did not write, he said\nthat he had decided upon doing no more writing.\n\n\"Why, how now? what next?\" exclaimed I, \"do no more writing?\"\n\n\"No more.\"\n\n\"And what is the reason?\"\n\n\"Do you not see the reason for yourself,\" he indifferently replied.\n\nI looked steadfastly at him, and perceived that his eyes looked dull and\nglazed.  Instantly it occurred to me, that his unexampled diligence in\ncopying by his dim window for the first few weeks of his stay with me\nmight have temporarily impaired his vision.\n\nI was touched.  I said something in condolence with him.  I hinted that\nof course he did wisely in abstaining from writing for a while; and\nurged him to embrace that opportunity of taking wholesome exercise in\nthe open air.  This, however, he did not do.  A few days after this, my\nother clerks being absent, and being in a great hurry to dispatch\ncertain letters by the mail, I thought that, having nothing else earthly\nto do, Bartleby would surely be less inflexible than usual, and carry\nthese letters to the post-office.  But he blankly declined.  So, much to\nmy inconvenience, I went myself.\n\nStill added days went by.  Whether Bartleby's eyes improved or not, I\ncould not say.  To all appearance, I thought they did.  But when I asked\nhim if they did, he vouchsafed no answer.  At all events, he would do no\ncopying.  At last, in reply to my urgings, he informed me that he had\npermanently given up copying.\n\n\"What!\" exclaimed I; \"suppose your eyes should get entirely well--better\nthan ever before--would you not copy then?\"\n\n\"I have given up copying,\" he answered, and slid aside.\n\nHe remained as ever, a fixture in my chamber.  Nay--if that were\npossible--he became still more of a fixture than before.  What was to be\ndone?  He would do nothing in the office: why should he stay there?  In\nplain fact, he had now become a millstone to me, not only useless as a\nnecklace, but afflictive to bear.  Yet I was sorry for him.  I speak\nless than truth when I say that, on his own account, he occasioned me\nuneasiness.  If he would but have named a single relative or friend, I\nwould instantly have written, and urged their taking the poor fellow\naway to some convenient retreat.  But he seemed alone, absolutely alone\nin the universe.  A bit of wreck in the mid Atlantic.  At length,\nnecessities connected with my business tyrannized over all other\nconsiderations.  Decently as I could, I told Bartleby that in six days'\ntime he must unconditionally leave the office.  I warned him to take\nmeasures, in the interval, for procuring some other abode.  I offered to\nassist him in this endeavor, if he himself would but take the first step\ntowards a removal.  \"And when you finally quit me, Bartleby,\" added I,\n\"I shall see that you go not away entirely unprovided.  Six days from\nthis hour, remember.\"\n\nAt the expiration of that period, I peeped behind the screen, and lo!\nBartleby was there.\n\nI buttoned up my coat, balanced myself; advanced slowly towards him,\ntouched his shoulder, and said, \"The time has come; you must quit this\nplace; I am sorry for you; here is money; but you must go.\"\n\n\"I would prefer not,\" he replied, with his back still towards me.\n\n\"You _must_.\"\n\nHe remained silent.\n\nNow I had an unbounded confidence in this man's common honesty.  He had\nfrequently restored to me sixpences and shillings carelessly dropped\nupon the floor, for I am apt to be very reckless in such shirt-button\naffairs.  The proceeding then which followed will not be deemed\nextraordinary.\n\n\"Bartleby,\" said I, \"I owe you twelve dollars on account; here are\nthirty-two; the odd twenty are yours.--Will you take it?\" and I handed\nthe bills towards him.\n\nBut he made no motion.\n\n\"I will leave them here then,\" putting them under a weight on the table.\nThen taking my hat and cane and going to the door I tranquilly turned\nand added--\"After you have removed your things from these offices,\nBartleby, you will of course lock the door--since every one is now gone\nfor the day but you--and if you please, slip your key underneath the\nmat, so that I may have it in the morning.  I shall not see you again;\nso good-bye to you.  If hereafter in your new place of abode I can be of\nany service to you, do not fail to advise me by letter.  Good-bye,\nBartleby, and fare you well.\"\n\nBut he answered not a word; like the last column of some ruined temple,\nhe remained standing mute and solitary in the middle of the otherwise\ndeserted room.\n\nAs I walked home in a pensive mood, my vanity got the better of my pity.\nI could not but highly plume myself on my masterly management in getting\nrid of Bartleby.  Masterly I call it, and such it must appear to any\ndispassionate thinker.  The beauty of my procedure seemed to consist in\nits perfect quietness.  There was no vulgar bullying, no bravado of any\nsort, no choleric hectoring, and striding to and fro across the\napartment, jerking out vehement commands for Bartleby to bundle himself\noff with his beggarly traps.  Nothing of the kind.  Without loudly\nbidding Bartleby depart--as an inferior genius might have done--I\n_assumed_ the ground that depart he must; and upon that assumption built\nall I had to say.  The more I thought over my procedure, the more I was\ncharmed with it.  Nevertheless, next morning, upon awakening, I had my\ndoubts,--I had somehow slept off the fumes of vanity.  One of the\ncoolest and wisest hours a man has, is just after he awakes in the\nmorning.  My procedure seemed as sagacious as ever.--but only in theory.\nHow it would prove in practice--there was the rub.  It was truly a\nbeautiful thought to have assumed Bartleby's departure; but, after all,\nthat assumption was simply my own, and none of Bartleby's.  The great\npoint was, not whether I had assumed that he would quit me, but whether\nhe would prefer so to do.  He was more a man of preferences than\nassumptions.\n\nAfter breakfast, I walked down town, arguing the probabilities _pro_ and\n_con_.  One moment I thought it would prove a miserable failure, and\nBartleby would be found all alive at my office as usual; the next moment\nit seemed certain that I should see his chair empty.  And so I kept\nveering about.  At the corner of Broadway and Canal-street, I saw quite\nan excited group of people standing in earnest conversation.\n\n\"I'll take odds he doesn't,\" said a voice as I passed.\n\n\"Doesn't go?--done!\" said I, \"put up your money.\"\n\nI was instinctively putting my hand in my pocket to produce my own, when\nI remembered that this was an election day.  The words I had overheard\nbore no reference to Bartleby, but to the success or non-success of some\ncandidate for the mayoralty.  In my intent frame of mind, I had, as it\nwere, imagined that all Broadway shared in my excitement, and were\ndebating the same question with me.  I passed on, very thankful that the\nuproar of the street screened my momentary absent-mindedness.\n\nAs I had intended, I was earlier than usual at my office door.  I stood\nlistening for a moment.  All was still.  He must be gone.  I tried the\nknob.  The door was locked.  Yes, my procedure had worked to a charm; he\nindeed must be vanished.  Yet a certain melancholy mixed with this: I\nwas almost sorry for my brilliant success.  I was fumbling under the\ndoor mat for the key, which Bartleby was to have left there for me, when\naccidentally my knee knocked against a panel, producing a summoning\nsound, and in response a voice came to me from within--\"Not yet; I am\noccupied.\"\n\nIt was Bartleby.\n\nI was thunderstruck.  For an instant I stood like the man who, pipe in\nmouth, was killed one cloudless afternoon long ago in Virginia, by a\nsummer lightning; at his own warm open window he was killed, and\nremained leaning out there upon the dreamy afternoon, till some one\ntouched him, when he fell.\n\n\"Not gone!\" I murmured at last.  But again obeying that wondrous\nascendancy which the inscrutable scrivener had over me, and from which\nascendancy, for all my chafing, I could not completely escape, I slowly\nwent down stairs and out into the street, and while walking round the\nblock, considered what I should next do in this unheard-of perplexity.\nTurn the man out by an actual thrusting I could not; to drive him away\nby calling him hard names would not do; calling in the police was an\nunpleasant idea; and yet, permit him to enjoy his cadaverous triumph\nover me,--this too I could not think of.  What was to be done? or, if\nnothing could be done, was there any thing further that I could _assume_\nin the matter?  Yes, as before I had prospectively assumed that Bartleby\nwould depart, so now I might retrospectively assume that departed he\nwas.  In the legitimate carrying out of this assumption, I might enter\nmy office in a great hurry, and pretending not to see Bartleby at all,\nwalk straight against him as if he were air.  Such a proceeding would in\na singular degree have the appearance of a home-thrust.  It was hardly\npossible that Bartleby could withstand such an application of the\ndoctrine of assumptions.  But upon second thoughts the success of the\nplan seemed rather dubious.  I resolved to argue the matter over with\nhim again.\n\n\"Bartleby,\" said I, entering the office, with a quietly severe\nexpression, \"I am seriously displeased.  I am pained, Bartleby.  I had\nthought better of you.  I had imagined you of such a gentlemanly\norganization, that in any delicate dilemma a slight hint would have\nsuffice--in short, an assumption.  But it appears I am deceived.  Why,\"\nI added, unaffectedly starting, \"you have not even touched that money\nyet,\" pointing to it, just where I had left it the evening previous.\n\nHe answered nothing.\n\n\"Will you, or will you not, quit me?\" I now demanded in a sudden\npassion, advancing close to him.\n\n\"I would prefer _not_ to quit you,\" he replied, gently emphasizing the\n_not_.\n\n\"What earthly right have you to stay here?  Do you pay any rent?  Do you\npay my taxes?  Or is this property yours?\"\n\nHe answered nothing.\n\n\"Are you ready to go on and write now?  Are your eyes recovered?  Could\nyou copy a small paper for me this morning? or help examine a few lines?\nor step round to the post-office?  In a word, will you do any thing at\nall, to give a coloring to your refusal to depart the premises?\"\n\nHe silently retired into his hermitage.\n\nI was now in such a state of nervous resentment that I thought it but\nprudent to check myself at present from further demonstrations.\nBartleby and I were alone.  I remembered the tragedy of the unfortunate\nAdams and the still more unfortunate Colt in the solitary office of the\nlatter; and how poor Colt, being dreadfully incensed by Adams, and\nimprudently permitting himself to get wildly excited, was at unawares\nhurried into his fatal act--an act which certainly no man could possibly\ndeplore more than the actor himself.  Often it had occurred to me in my\nponderings upon the subject, that had that altercation taken place in\nthe public street, or at a private residence, it would not have\nterminated as it did.  It was the circumstance of being alone in a\nsolitary office, up stairs, of a building entirely unhallowed by\nhumanizing domestic associations--an uncarpeted office, doubtless, of a\ndusty, haggard sort of appearance;--this it must have been, which\ngreatly helped to enhance the irritable desperation of the hapless Colt.\n\nBut when this old Adam of resentment rose in me and tempted me\nconcerning Bartleby, I grappled him and threw him.  How?  Why, simply by\nrecalling the divine injunction: \"A new commandment give I unto you,\nthat ye love one another.\"  Yes, this it was that saved me.  Aside from\nhigher considerations, charity often operates as a vastly wise and\nprudent principle--a great safeguard to its possessor.  Men have\ncommitted murder for jealousy's sake, and anger's sake, and hatred's\nsake, and selfishness' sake, and spiritual pride's sake; but no man that\never I heard of, ever committed a diabolical murder for sweet charity's\nsake.  Mere self-interest, then, if no better motive can be enlisted,\nshould, especially with high-tempered men, prompt all beings to charity\nand philanthropy.  At any rate, upon the occasion in question, I strove\nto drown my exasperated feelings towards the scrivener by benevolently\nconstruing his conduct.  Poor fellow, poor fellow! thought I, he don't\nmean any thing; and besides, he has seen hard times, and ought to be\nindulged.\n\nI endeavored also immediately to occupy myself, and at the same time to\ncomfort my despondency.  I tried to fancy that in the course of the\nmorning, at such time as might prove agreeable to him,  Bartleby, of his\nown free accord, would emerge from his hermitage, and take up some\ndecided line of march in the direction of the door.  But no.  Half-past\ntwelve o'clock came; Turkey began to glow in the face, overturn his\ninkstand, and become generally obstreperous; Nippers abated down into\nquietude and courtesy; Ginger Nut munched his noon apple; and Bartleby\nremained standing at his window in one of his profoundest dead-wall\nreveries.  Will it be credited?  Ought I to acknowledge it?  That\nafternoon I left the office without saying one further word to him.\n\nSome days now passed, during which, at leisure intervals I looked a\nlittle into \"Edwards on the Will,\" and \"Priestly on Necessity.\"  Under\nthe circumstances, those books induced a salutary feeling.  Gradually I\nslid into the persuasion that these troubles of mine touching the\nscrivener, had been all predestinated from eternity, and Bartleby was\nbilleted upon me for some mysterious purpose of an all-wise Providence,\nwhich it was not for a mere mortal like me to fathom.  Yes, Bartleby,\nstay there behind your screen, thought I; I shall persecute you no more;\nyou are harmless and noiseless as any of these old chairs; in short, I\nnever feel so private as when I know you are here.  At last I see it, I\nfeel it; I penetrate to the predestinated purpose of my life.  I am\ncontent.  Others may have loftier parts to enact; but my mission in this\nworld, Bartleby, is to furnish you with office-room for such period as\nyou may see fit to remain.\n\nI believe that this wise and blessed frame of mind would have continued\nwith me, had it not been for the unsolicited and uncharitable remarks\nobtruded upon me by my professional friends who visited the rooms.  But\nthus it often is, that the constant friction of illiberal minds wears\nout at last the best resolves of the more generous.  Though to be sure,\nwhen I reflected upon it, it was not strange that people entering my\noffice should be struck by the peculiar aspect of the unaccountable\nBartleby, and so be tempted to throw out some sinister observations\nconcerning him.  Sometimes an attorney having business with me, and\ncalling at my office and finding no one but the scrivener there, would\nundertake to obtain some sort of precise information from him touching\nmy whereabouts; but without heeding his idle talk, Bartleby would remain\nstanding immovable in the middle of the room.  So after contemplating\nhim in that position for a time, the attorney would depart, no wiser\nthan he came.\n\nAlso, when a Reference was going on, and the room full of lawyers and\nwitnesses and business was driving fast; some deeply occupied legal\ngentleman present, seeing Bartleby wholly unemployed, would request him\nto run round to his (the legal gentleman's) office and fetch some papers\nfor him.  Thereupon, Bartleby would tranquilly decline, and yet remain\nidle as before.  Then the lawyer would give a great stare, and turn to\nme.  And what could I say?  At last I was made aware that all through\nthe circle of my professional acquaintance, a whisper of wonder was\nrunning round, having reference to the strange creature I kept at my\noffice.  This worried me very much.  And as the idea came upon me of his\npossibly turning out a long-lived man, and keep occupying my chambers,\nand denying my authority; and perplexing my visitors; and scandalizing\nmy professional reputation; and casting a general gloom over the\npremises; keeping soul and body together to the last upon his savings\n(for doubtless he spent but half a dime a day), and in the end perhaps\noutlive me, and claim possession of my office by right of his perpetual\noccupancy: as all these dark anticipations crowded upon me more and\nmore, and my friends continually intruded their relentless remarks upon\nthe apparition in my room; a great change was wrought in me.  I resolved\nto gather all my faculties together, and for ever rid me of this\nintolerable incubus.\n\nEre revolving any complicated project, however, adapted to this end, I\nfirst simply suggested to Bartleby the propriety of his permanent\ndeparture.  In a calm and serious tone, I commended the idea to his\ncareful and mature consideration.  But having taken three days to\nmeditate upon it, he apprised me that his original determination\nremained the same; in short, that he still preferred to abide with me.\n\nWhat shall I do?  I now said to myself, buttoning up my coat to the last\nbutton.  What shall I do? what ought I to do? what does conscience say I\n_should_ do with this man, or rather ghost.  Rid myself of him, I must;\ngo, he shall.  But how?  You will not thrust him, the poor, pale,\npassive mortal,--you will not thrust such a helpless creature out of\nyour door? you will not dishonor yourself by such cruelty?  No, I will\nnot, I cannot do that.  Rather would I let him live and die here, and\nthen mason up his remains in the wall.  What then will you do?  For all\nyour coaxing, he will not budge.  Bribes he leaves under your own\npaperweight on your table; in short, it is quite plain that he prefers\nto cling to you.\n\nThen something severe, something unusual must be done.  What! surely you\nwill not have him collared by a constable, and commit his innocent\npallor to the common jail?  And upon what ground could you procure such\na thing to be done?--a vagrant, is he?  What! he a vagrant, a wanderer,\nwho refuses to budge?  It is because he will _not_ be a vagrant, then,\nthat you seek to count him _as_ a vagrant.  That is too absurd.  No\nvisible means of support:  there I have him.  Wrong again:  for\nindubitably he _does_ support himself, and that is the only unanswerable\nproof that any man can show of his possessing the means so to do.  No\nmore then.  Since he will not quit me, I must quit him.  I will change\nmy offices; I will move elsewhere; and give him fair notice, that if I\nfind him on my new premises I will then proceed against him as a common\ntrespasser.\n\nActing accordingly, next day I thus addressed him:  \"I find these\nchambers too far from the City Hall; the air is unwholesome.  In a word,\nI propose to remove my offices next week, and shall no longer require\nyour services.  I tell you this now, in order that you may seek another\nplace.\"\n\nHe made no reply, and nothing more was said.\n\nOn the appointed day I engaged carts and men, proceeded to my chambers,\nand having but little furniture, every thing was removed in a few hours.\nThroughout, the scrivener remained standing behind the screen, which I\ndirected to be removed the last thing.  It was withdrawn; and being\nfolded up like a huge folio, left him the motionless occupant of a naked\nroom.  I stood in the entry watching him a moment, while something from\nwithin me upbraided me.\n\nI re-entered, with my hand in my pocket--and--and my heart in my mouth.\n\n\"Good-bye, Bartleby; I am going--good-bye, and God some way bless you;\nand take that,\" slipping something in his hand.  But it dropped upon the\nfloor, and then,--strange to say--I tore myself from him whom I had so\nlonged to be rid of.\n\nEstablished in my new quarters, for a day or two I kept the door locked,\nand started at every footfall in the passages.  When I returned to my\nrooms after any little absence, I would pause at the threshold for an\ninstant, and attentively listen, ere applying my key.  But these fears\nwere needless.  Bartleby never came nigh me.\n\nI thought all was going well, when a perturbed looking stranger visited\nme, inquiring whether I was the person who had recently occupied rooms\nat No.--Wall-street.\n\nFull of forebodings, I replied that I was.\n\n\"Then sir,\" said the stranger, who proved a lawyer, \"you are responsible\nfor the man you left there.  He refuses to do any copying; he refuses to\ndo any thing; he says he prefers not to; and he refuses to quit the\npremises.\"\n\n\"I am very sorry, sir,\" said I, with assumed tranquility, but an inward\ntremor, \"but, really, the man you allude to is nothing to me--he is no\nrelation or apprentice of mine, that you should hold me responsible for\nhim.\"\n\n\"In mercy's name, who is he?\"\n\n\"I certainly cannot inform you.  I know nothing about him.  Formerly I\nemployed him as a copyist; but he has done nothing for me now for some\ntime past.\"\n\n\"I shall settle him then,--good morning, sir.\"\n\nSeveral days passed, and I heard nothing more; and though I often felt a\ncharitable prompting to call at the place and see poor Bartleby, yet a\ncertain squeamishness of I know not what withheld me.\n\nAll is over with him, by this time, thought I at last, when through\nanother week no further intelligence reached me.  But coming to my room\nthe day after, I found several persons waiting at my door in a high\nstate of nervous excitement.\n\n\"That's the man--here he comes,\" cried the foremost one, whom I\nrecognized as the lawyer who had previously called upon me alone.\n\n\"You must take him away, sir, at once,\" cried a portly person among\nthem, advancing upon me, and whom I knew to be the landlord of\nNo.--Wall-street.  \"These gentlemen, my tenants, cannot stand it any\nlonger; Mr. B--\" pointing to the lawyer, \"has turned him out of his\nroom, and he now persists in haunting the building generally, sitting\nupon the banisters of the stairs by day, and sleeping in the entry by\nnight.  Every body is concerned; clients are leaving the offices; some\nfears are entertained of a mob; something you must do, and that without\ndelay.\"\n\nAghast at this torrent, I fell back before it, and would fain have\nlocked myself in my new quarters.  In vain I persisted that Bartleby was\nnothing to me--no more than to any one else.  In vain:--I was the last\nperson known to have any thing to do with him, and they held me to the\nterrible account.  Fearful then of being exposed in the papers (as one\nperson present obscurely threatened) I considered the matter, and at\nlength said, that if the lawyer would give me a confidential interview\nwith the scrivener, in his (the lawyer's) own room, I would that\nafternoon strive my best to rid them of the nuisance they complained of.\n\nGoing up stairs to my old haunt, there was Bartleby silently sitting\nupon the banister at the landing.\n\n\"What are you doing here, Bartleby?\" said I.\n\n\"Sitting upon the banister,\" he mildly replied.\n\nI motioned him into the lawyer's room, who then left us.\n\n\"Bartleby,\" said I, \"are you aware that you are the cause of great\ntribulation to me, by persisting in occupying the entry after being\ndismissed from the office?\"\n\nNo answer.\n\n\"Now one of two things must take place.  Either you must do something,\nor something must be done to you.  Now what sort of business would you\nlike to engage in?  Would you like to re-engage in copying for some\none?\"\n\n\"No; I would prefer not to make any change.\"\n\n\"Would you like a clerkship in a dry-goods store?\"\n\n\"There is too much confinement about that.  No, I would not like a\nclerkship; but I am not particular.\"\n\n\"Too much confinement,\" I cried, \"why you keep yourself confined all the\ntime!\"\n\n\"I would prefer not to take a clerkship,\" he rejoined, as if to settle\nthat little item at once.\n\n\"How would a bar-tender's business suit you?  There is no trying of the\neyesight in that.\"\n\n\"I would not like it at all; though, as I said before, I am not\nparticular.\"\n\nHis unwonted wordiness inspirited me.  I returned to the charge.\n\n\"Well then, would you like to travel through the country collecting\nbills for the merchants?  That would improve your health.\"\n\n\"No, I would prefer to be doing something else.\"\n\n\"How then would going as a companion to Europe, to entertain some young\ngentleman with your conversation,--how would that suit you?\"\n\n\"Not at all.  It does not strike me that there is any thing definite\nabout that.  I like to be stationary.  But I am not particular.\"\n\n\"Stationary you shall be then,\" I cried, now losing all patience, and\nfor the first time in all my exasperating connection with him fairly\nflying into a passion.  \"If you do not go away from these premises\nbefore night, I shall feel bound--indeed I _am_ bound--to--to--to quit\nthe premises myself!\"  I rather absurdly concluded, knowing not with\nwhat possible threat to try to frighten his immobility into compliance.\nDespairing of all further efforts, I was precipitately leaving him, when\na final thought occurred to me--one which had not been wholly unindulged\nbefore.\n\n\"Bartleby,\" said I, in the kindest tone I could assume under such\nexciting circumstances, \"will you go home with me now--not to my office,\nbut my dwelling--and remain there till we can conclude upon some\nconvenient arrangement for you at our leisure?  Come, let us start now,\nright away.\"\n\n\"No:  at present I would prefer not to make any change at all.\"\n\nI answered nothing; but effectually dodging every one by the suddenness\nand rapidity of my flight, rushed from the building, ran up Wall-street\ntowards Broadway, and jumping into the first omnibus was soon removed\nfrom pursuit.  As soon as tranquility returned I distinctly perceived\nthat I had now done all that I possibly could, both in respect to the\ndemands of the landlord and his tenants, and with regard to my own\ndesire and sense of duty, to benefit Bartleby, and shield him from rude\npersecution.  I now strove to be entirely care-free and quiescent; and\nmy conscience justified me in the attempt; though indeed it was not so\nsuccessful as I could have wished.  So fearful was I of being again\nhunted out by the incensed landlord and his exasperated tenants, that,\nsurrendering my business to Nippers, for a few days I drove about the\nupper part of the town and through the suburbs, in my rockaway; crossed\nover to Jersey City and Hoboken, and paid fugitive visits to\nManhattanville and Astoria.  In fact I almost lived in my rockaway for\nthe time.\n\nWhen again I entered my office, lo, a note from the landlord lay upon\nthe desk.  I opened it with trembling hands.  It informed me that the\nwriter had sent to the police, and had Bartleby removed to the Tombs as\na vagrant.  Moreover, since I knew more about him than any one else, he\nwished me to appear at that place, and make a suitable statement of the\nfacts.  These tidings had a conflicting effect upon me.  At first I was\nindignant; but at last almost approved.  The landlord's energetic,\nsummary disposition had led him to adopt a procedure which I do not\nthink I would have decided upon myself; and yet as a last resort, under\nsuch peculiar circumstances, it seemed the only plan.\n\nAs I afterwards learned, the poor scrivener, when told that he must be\nconducted to the Tombs, offered not the slightest obstacle, but in his\npale unmoving way, silently acquiesced.\n\nSome of the compassionate and curious bystanders joined the party; and\nheaded by one of the constables arm in arm with Bartleby, the silent\nprocession filed its way through all the noise, and heat, and joy of the\nroaring thoroughfares at noon.\n\nThe same day I received the note I went to the Tombs, or to speak more\nproperly, the Halls of Justice.  Seeking the right officer, I stated the\npurpose of my call, and was informed that the individual I described was\nindeed within.  I then assured the functionary that Bartleby was a\nperfectly honest man, and greatly to be compassionated, however\nunaccountably eccentric.  I narrated all I knew, and closed by\nsuggesting the idea of letting him remain in as indulgent confinement as\npossible till something less harsh might be done--though indeed I hardly\nknew what.  At all events, if nothing else could be decided upon, the\nalms-house must receive him.  I then begged to have an interview.\n\nBeing under no disgraceful charge, and quite serene and harmless in all\nhis ways, they had permitted him freely to wander about the prison, and\nespecially in the inclosed grass-platted yard thereof.  And so I found\nhim there, standing all alone in the quietest of the yards, his face\ntowards a high wall, while all around, from the narrow slits of the jail\nwindows, I thought I saw peering out upon him the eyes of murderers and\nthieves.\n\n\"Bartleby!\"\n\n\"I know you,\" he said, without looking round,--\"and I want nothing to\nsay to you.\"\n\n\"It was not I that brought you here, Bartleby,\" said I, keenly pained at\nhis implied suspicion.  \"And to you, this should not be so vile a place.\nNothing reproachful attaches to you by being here.  And see, it is not\nso sad a place as one might think.  Look, there is the sky, and here is\nthe grass.\"\n\n\"I know where I am,\" he replied, but would say nothing more, and so I\nleft him.\n\nAs I entered the corridor again, a broad meat-like man, in an apron,\naccosted me, and jerking his thumb over his shoulder said--\"Is that your\nfriend?\"\n\n\"Yes.\"\n\n\"Does he want to starve?  If he does, let him live on the prison fare,\nthat's all.\"\n\n\"Who are you?\" asked I, not knowing what to make of such an unofficially\nspeaking person in such a place.\n\n\"I am the grub-man.  Such gentlemen as have friends here, hire me to\nprovide them with something good to eat.\"\n\n\"Is this so?\" said I, turning to the turnkey.\n\nHe said it was.\n\n\"Well then,\" said I, slipping some silver into the grub-man's hands (for\nso they called him).  \"I want you to give particular attention to my\nfriend there; let him have the best dinner you can get.  And you must be\nas polite to him as possible.\"\n\n\"Introduce me, will you?\" said the grub-man, looking at me with an\nexpression which seem to say he was all impatience for an opportunity to\ngive a specimen of his breeding.\n\nThinking it would prove of benefit to the scrivener, I acquiesced; and\nasking the grub-man his name, went up with him to Bartleby.\n\n\"Bartleby, this is Mr. Cutlets; you will find him very useful to you.\"\n\n\"Your sarvant, sir, your sarvant,\" said the grub-man, making a low\nsalutation behind his apron.  \"Hope you find it pleasant here,\nsir;--spacious grounds--cool apartments, sir--hope you'll stay with us\nsome time--try to make it agreeable.  May Mrs. Cutlets and I have the\npleasure of your company to dinner, sir, in Mrs. Cutlets' private room?\"\n\n\"I prefer not to dine to-day,\" said Bartleby, turning away.  \"It would\ndisagree with me; I am unused to dinners.\"  So saying he slowly moved to\nthe other side of the inclosure, and took up a position fronting the\ndead-wall.\n\n\"How's this?\" said the grub-man, addressing me with a stare of\nastonishment.  \"He's odd, aint he?\"\n\n\"I think he is a little deranged,\" said I, sadly.\n\n\"Deranged? deranged is it?  Well now, upon my word, I thought that\nfriend of yourn was a gentleman forger; they are always pale and\ngenteel-like, them forgers.  I can't pity'em--can't help it, sir.  Did\nyou know Monroe Edwards?\" he added touchingly, and paused.  Then, laying\nhis hand pityingly on my shoulder, sighed, \"he died of consumption at\nSing-Sing.  So you weren't acquainted with Monroe?\"\n\n\"No, I was never socially acquainted with any forgers.  But I cannot\nstop longer.  Look to my friend yonder.  You will not lose by it.  I\nwill see you again.\"\n\nSome few days after this, I again obtained admission to the Tombs, and\nwent through the corridors in quest of Bartleby; but without finding\nhim.\n\n\"I saw him coming from his cell not long ago,\" said a turnkey, \"may be\nhe's gone to loiter in the yards.\"\n\nSo I went in that direction.\n\n\"Are you looking for the silent man?\" said another turnkey passing me.\n\"Yonder he lies--sleeping in the yard there.  'Tis not twenty minutes\nsince I saw him lie down.\"\n\nThe yard was entirely quiet.  It was not accessible to the common\nprisoners.  The surrounding walls, of amazing thickness, kept off all\nsounds behind them.  The Egyptian character of the masonry weighed upon\nme with its gloom.  But a soft imprisoned turf grew under foot.  The\nheart of the eternal pyramids, it seemed, wherein, by some strange\nmagic, through the clefts, grass-seed, dropped by birds, had sprung.\n\nStrangely huddled at the base of the wall, his knees drawn up, and lying\non his side, his head touching the cold stones, I saw the wasted\nBartleby.  But nothing stirred.  I paused; then went close up to him;\nstooped over, and saw that his dim eyes were open; otherwise he seemed\nprofoundly sleeping.  Something prompted me to touch him.  I felt his\nhand, when a tingling shiver ran up my arm and down my spine to my feet.\n\nThe round face of the grub-man peered upon me now.  \"His dinner is\nready.  Won't he dine to-day, either?  Or does he live without dining?\"\n\n\"Lives without dining,\" said I, and closed his eyes.\n\n\"Eh!--He's asleep, aint he?\"\n\n\"With kings and counselors,\" murmured I.\n\n*  *  *  *  *  *  *  *\n\nThere would seem little need for proceeding further in this history.\nImagination will readily supply the meager recital of poor Bartleby's\ninterment.  But ere parting with the reader, let me say, that if this\nlittle narrative has sufficiently interested him, to awaken curiosity as\nto who Bartleby was, and what manner of life he led prior to the present\nnarrator's making his acquaintance, I can only reply, that in such\ncuriosity I fully share, but am wholly unable to gratify it.  Yet here I\nhardly know whether I should divulge one little item of rumor, which\ncame to my ear a few months after the scrivener's decease.  Upon what\nbasis it rested, I could never ascertain; and hence, how true it is I\ncannot now tell.  But inasmuch as this vague report has not been without\ncertain strange suggestive interest to me, however sad, it may prove the\nsame with some others; and so I will briefly mention it.  The report was\nthis:  that Bartleby had been a subordinate clerk in the Dead Letter\nOffice at Washington, from which he had been suddenly removed by a\nchange in the administration.  When I think over this rumor, I cannot\nadequately express the emotions which seize me.  Dead letters! does it\nnot sound like dead men?  Conceive a man by nature and misfortune prone\nto a pallid hopelessness, can any business seem more fitted to heighten\nit than that of continually handling these dead letters, and assorting\nthem for the flames?  For by the cart-load they are annually burned.\nSometimes from out the folded paper the pale clerk takes a ring:--the\nfinger it was meant for, perhaps, moulders in the grave; a bank-note\nsent in swiftest charity:--he whom it would relieve, nor eats nor\nhungers any more; pardon for those who died despairing; hope for those\nwho died unhoping; good tidings for those who died stifled by unrelieved\ncalamities.  On errands of life, these letters speed to death.\n\nAh Bartleby!  Ah humanity!", "title": "Bartleby, the Scrivener: A Story of Wall-Street"}