{"summary": "The narrative follows the course of a man's life from his schoolboy days to his adulthood. The son of a north German merchant and a \"Southern\" mother (Consuelo) with artistic talents, Tonio inherited qualities from both sides of his family. As a child, he experiences conflicting feelings for the bourgeois people around him. He feels both superior to them in his insights and envious of their innocent vitality. This conflict continues into Tonio's adulthood, when he becomes a famous writer living in southern Germany. \"To be an artist,\" he comes to believe, \"one has to die to everyday life.\" These issues are only partially resolved when Tonio travels north to visit his hometown. While there, Tonio is mistaken for an escaped criminal, thereby reinforcing his inner suspicion that the artist must be an outsider relative to \"respectable\" society. As Erich Heller –who knew Thomas Mann personally– observed, Tonio Kröger's theme is that of the \"artist as an exile from reality\" (with Goethe's Torquato Tasso (1790) and Grillparzer's Sappho (1818) for company). Yet it was also Erich Heller who, earlier, in his own youth, had diagnosed the main theme of Tonio Kröger to be the infatuation and entanglements of a passionate heart, destined to give shape to, intellectualize, its feelings in artistic terms.\n\n", "full_text": "Thomas Mann\n\nDer Tod in Venedig\n\n\n\n\nDie Texte folgen den Ausgaben:\n\n>Der Tod in Venedig< aus\n\nMuenchen, Hyperionverlag Hans von Weber 1912\n\n\n\n\n\n\nErstes Kapitel\n\n\nGustav Aschenbach oder von Aschenbach, wie seit seinem fuenfzigsten\nGeburtstag amtlich sein Name lautete, hatte an einem\nFruehlingsnachmittag des Jahres 19.., das unserem Kontinent monatelang\neine so gefahrdrohende Miene zeigte, von seiner Wohnung in der\nPrinz-Regentenstrasse zu Muenchen aus, allein einen weiteren Spaziergang\nunternommen. Ueberreizt von der schwierigen und gefaehrlichen, eben\njetzt eine hoechste Behutsamkeit, Umsicht, Eindringlichkeit und\nGenauigkeit des Willens erfordernden Arbeit der Vormittagsstunden,\nhatte der Schriftsteller dem Fortschwingen des produzierenden\nTriebwerks in seinem Innern, jenem \"motus animi continuus\", worin\nnach Cicero das Wesen der Beredsamkeit besteht, auch nach der\nMittagsmahlzeit nicht Einhalt zu tun vermocht und den entlastenden\nSchlummer nicht gefunden, der ihm, bei zunehmender Abnutzbarkeit\nseiner Kraefte, einmal untertags so noetig war. So hatte er bald nach\ndem Tee das Freie gesucht, in der Hoffnung, dass Luft und Bewegung ihn\nwieder herstellen und ihm zu einem erspriesslichen Abend verhelfen\nwuerden.\n\nEs war Anfang Mai und, nach nasskalten Wochen, ein falscher Hochsommer\neingefallen. Der Englische Garten, obgleich nur erst zart belaubt,\nwar dumpfig wie im August und in der Naehe der Stadt voller Wagen und\nSpaziergaenger gewesen. Beim Aumeister, wohin stillere und stillere\nWege ihn gefuehrt, hatte Aschenbach eine kleine Weile den volkstuemlich\nbelebten Wirtsgarten ueberblickt, an dessen Rande einige Droschken und\nEquipagen hielten, hatte von dort bei sinkender Sonne seinen Heimweg\nausserhalb des Parks ueber die offene Flur genommen und erwartete, da er\nsich muede fuehlte und ueber Foehring Gewitter drohte, am Noerdlichen\nFriedhof die Tram, die ihn in gerader Linie zur Stadt zurueckbringen\nsollte. Zufaellig fand er den Halteplatz und seine Umgebung von\nMenschen leer. Weder auf der gepflasterten Ungererstrasse, deren\nSchienengeleise sich einsam gleissend gegen Schwabing erstreckten,\nnoch auf der Foehringer Chaussee war ein Fuhrwerk zu sehen;\nhinter den Zaeunen der Steinmetzereien, wo zu Kauf stehende Kreuze,\nGedaechtnistafeln und Monumente ein zweites, unbehaustes Graeberfeld\nbilden, regte sich nichts, und das byzantinische Bauwerk der\nAussegnungshalle gegenueber lag schweigend im Abglanz des scheidenden\nTages. Ihre Stirnseite, mit griechischen Kreuzen und hieratischen\nSchildereien in lichten Farben geschmueckt, weist ueberdies symmetrisch\nangeordnete Inschriften in Goldlettern auf, ausgewaehlte, das\njenseitige Leben betreffende Schriftworte wie etwa: \"Sie gehen ein in\ndie Wohnung Gottes\" oder: \"Das ewige Licht leuchte ihnen\"; und der\nWartende hatte waehrend einiger Minuten eine ernste Zerstreuung darin\ngefunden, die Formeln abzulesen und sein geistiges Auge in ihrer\ndurchscheinenden Mystik sich verlieren zu lassen, als er, aus seinen\nTraeumereien zurueckkehrend, im Portikus, oberhalb der beiden\napokalyptischen Tiere, welche die Freitreppe bewachen, einen Mann\nbemerkte, dessen nicht ganz gewoehnliche Erscheinung seinen Gedanken\neine voellig andere Richtung gab.\n\nOb er nun aus dem Innern der Halle durch das bronzene Tor\nhervorgetreten oder von aussen unversehens heran und hinauf gelangt\nwar, blieb ungewiss. Aschenbach, ohne sich sonderlich in die Frage zu\nvertiefen, neigte zur ersteren Annahme. Maessig hochgewachsen, mager,\nbartlos und auffallend stumpfnaesig, gehoerte der Mann zum rothaarigen\nTyp und besass dessen milchige und sommersprossige Haut. Offenbar war\ner durchaus nicht bajuwarischen Schlages: wie denn wenigstens der\nbreit und gerade gerandete Basthut, der ihm den Kopf bedeckte, seinem\nAussehen ein Gepraege des Fremdlaendischen und Weitherkommenden\nverlieh. Freilich trug er dazu den landesueblichen Rucksack um die\nSchultern geschnallt, einen gelblichen Gurtanzug aus Lodenstoff, wie\nes schien, einen grauen Wetterkragen ueber dem linken Unterarm, den er\nin die Weiche gestuetzt hielt, und in der Rechten einen mit eiserner\nSpitze versehenen Stock, welchen er schraeg gegen den Boden stemmte und\nauf dessen Kruecke er, bei gekreuzten Fuessen, die Huefte lehnte. Erhobenen\nHauptes, so dass an seinem hager dem losen Sporthemd entwachsenden\nHalse der Adamsapfel stark und nackt hervortrat, blickte er mit\nfarblosen, rot bewimperten Augen, zwischen denen, sonderbar genug zu\nseiner kurz aufgeworfenen Nase passend, zwei senkrechte, energische\nFurchen standen, scharf spaehend ins Weite. So--und vielleicht trug\nsein erhoehter und erhoehender Standort zu diesem Eindruck bei--hatte\nseine Haltung etwas herrisch Ueberschauendes, Kuehnes oder selbst\nWildes; denn sei es, dass er, geblendet, gegen die untergehende Sonne\ngrimassierte oder dass es sich um eine dauernde physiognomische\nEntstellung handelte: seine Lippen schienen zu kurz, sie waren voellig\nvon den Zaehnen zurueckgezogen, dergestalt, dass diese, bis zum\nZahnfleisch blossgelegt, weiss und lang dazwischen hervorbleckten.\n\nWohl moeglich, dass Aschenbach es bei seiner halb zerstreuten, halb\ninquisitiven Musterung des Fremden an Ruecksicht hatte fehlen lassen;\ndenn ploetzlich ward er gewahr, dass jener seinen Blick erwiderte und\nzwar so kriegerisch, so gerade ins Auge hinein, so offenkundig\ngesonnen, die Sache aufs Aeusserste zu treiben und den Blick des andern\nzum Abzug zu zwingen, dass Aschenbach, peinlich beruehrt, sich abwandte\nund einen Gang die Zaeune entlang begann, mit dem beilaeufigen\nEntschluss, des Menschen nicht weiter achtzuhaben. Er hatte ihn in der\nnaechsten Minute vergessen. Mochte nun aber das Wandererhafte in der\nErscheinung des Fremden auf seine Einbildungskraft gewirkt haben oder\nsonst irgendein physischer oder seelischer Einfluss im Spiele sein:\neine seltsame Ausweitung seines Innern ward ihm ganz ueberraschend\nbewusst, eine Art schweifender Unruhe, ein jugendlich durstiges\nVerlangen in die Ferne, ein Gefuehl, so lebhaft, so neu oder doch so\nlaengst entwoehnt und verlernt, dass er, die Haende auf dem Ruecken und den\nBlick am Boden, gefesselt stehen blieb, um die Empfindung auf Wesen\nund Ziel zu pruefen. Es war Reiselust, nichts weiter; aber wahrhaft\nals Anfall auftretend und ins Leidenschaftliche, ja bis zur\nSinnestaeuschung gesteigert. Er sah naemlich, als Beispiel gleichsam fuer\nalle Wunder und Schrecken der mannigfaltigen Erde, die seine Begierde\nsich auf einmal vorzustellen trachtete,--sah wie mit leiblichem Auge\neine ungeheuere Landschaft, ein tropisches Sumpfgebiet unter\ndickdunstigem Himmel, feucht, ueppig und ungesund, eine von Menschen\ngemiedene Urweltwildnis aus Inseln, Moraesten und Schlamm fuehrenden\nWasserarmen. Die flachen Eilande, deren Boden mit Blaettern, so dick\nwie Haende, mit riesigen Farnen, mit fettem, gequollenem und\nabenteuerlich bluehendem Pflanzenwerk ueberwuchert war, sandten haarige\nPalmenschaefte empor, und wunderlich ungestalte Baeume, deren Wurzeln\ndem Stamm entwuchsen und sich durch die Luft in den Boden, ins Wasser\nsenkten, bildeten verworrene Waldungen. Auf der stockenden,\ngruenschattig spiegelnden Flut schwammen, wie Schuesseln gross,\nmilchweisse Blumen; Voegel von fremder Art, hochschultrig, mit\nunfoermigen Schnaebeln, standen auf hohen Beinen im Seichten und\nblickten unbeweglich zur Seite, waehrend durch ausgedehnte Schilffelder\nein klapperndes Wetzen und Rauschen ging, wie durch Heere von\nGeharnischten; dem Schauenden war es, als hauchte der laue,\nmephitische Odem dieser geilen und untauglichen Oede ihn an, die in\neinem ungeheuerlichen Zustande von Werden oder Vergehen zu schweben\nschien, zwischen den knotigen Rohrstaemmen eines Bambusdickichts\nglaubte er einen Augenblick die phosphoreszierenden Lichter des Tigers\nfunkeln zu sehen--und fuehlte sein Herz pochen vor Entsetzen und\nraetselhaftem Verlangen. Dann wich das Gesicht; und mit einem\nKopfschuetteln nahm Aschenbach seine Promenade an den Zaeunen der\nGrabsteinmetzereien wieder auf.\n\nEr hatte, zum mindesten seit ihm die Mittel zu Gebote gewesen waeren,\ndie Vorteile des Weltverkehrs beliebig zu geniessen, das Reisen nicht\nanders denn als eine hygienische Massregel betrachtet, die gegen Sinn\nund Neigung dann und wann hatte getroffen werden muessen. Zu\nbeschaeftigt mit den Aufgaben, welche sein Ich und die europaeische\nSeele ihm stellten, zu belastet von der Verpflichtung zur Produktion,\nder Zerstreuung zu abgeneigt, um zum Liebhaber der bunten Aussenwelt\nzu taugen, hatte er sich durchaus mit der Anschauung begnuegt, die\nheute jedermann, ohne sich weit aus seinem Kreise zu ruehren, von der\nOberflaeche der Erde gewinnen kann, und war niemals auch nur versucht\ngewesen, Europa zu verlassen. Zumal seit sein Leben sich langsam\nneigte, seit seine Kuenstlerfurcht, nicht fertig zu werden,--diese\nBesorgnis, die Uhr moechte abgelaufen sein, bevor er das Seine getan\nund voellig sich selbst gegeben, nicht mehr als blosse Grille von der\nHand zu weisen war, hatte sein aeusseres Dasein sich fast ausschliesslich\nauf die schoene Stadt, die ihm zur Heimat geworden, und auf den rauhen\nLandsitz beschraenkt, den er sich im Gebirge errichtet und wo er die\nregnerischen Sommer verbrachte.\n\nAuch wurde denn, was ihn da eben so spaet und ploetzlich angewandelt,\nsehr bald durch Vernunft und von jung auf geuebte Selbstzucht gemaessigt\nund richtig gestellt. Er hatte beabsichtigt, das Werk, fuer welches er\nlebte, bis zu einem gewissen Punkte zu foerdern, bevor er aufs Land\nuebersiedelte, und der Gedanke einer Weltbummelei, die ihn auf Monate\nseiner Arbeit entfuehren wuerde, schien allzu locker und planwidrig, er\ndurfte nicht ernstlich in Frage kommen. Und doch wusste er nur zu wohl,\naus welchem Grunde die Anfechtung so unversehens hervorgegangen war.\nFluchtdrang war sie, dass er es sich eingestand, diese Sehnsucht ins\nFerne und Neue, diese Begierde nach Befreiung, Entbuerdung und\nVergessen,--der Drang hinweg vom Werke, von der Alltagsstaette eines\nstarren, kalten und leidenschaftlichen Dienstes. Zwar liebte er ihn\nund liebte auch fast schon den entnervenden, sich taeglich erneuernden\nKampf zwischen seinem zaehen und stolzen, so oft erprobten Willen und\ndieser wachsenden Muedigkeit, von der niemand wissen und die das\nProdukt auf keine Weise, durch kein Anzeichen des Versagens und der\nLassheit verraten durfte. Aber verstaendig schien es, den Bogen nicht\nzu ueberspannen und ein so lebhaft ausbrechendes Beduerfnis nicht\neigensinnig zu ersticken. Er dachte an seine Arbeit, dachte an die\nStelle, an der er sie auch heute wieder, wie gestern schon, hatte\nverlassen muessen und die weder geduldiger Pflege noch einem raschen\nHandstreich sich fuegen zu wollen schien. Er pruefte sie aufs neue,\nversuchte die Hemmung zu durchbrechen oder aufzuloesen und liess\nmit einem Schauder des Widerwillens vom Angriff ab. Hier bot sich\nkeine ausserordentliche Schwierigkeit, sondern was ihn laehmte, waren\ndie Skrupeln der Unlust, die sich als eine durch nichts mehr zu\nbefriedigende Ungenuegsamkeit darstellte. Ungenuegsamkeit freilich hatte\nschon dem Juengling als Wesen und innerste Natur des Talentes gegolten,\nund um ihretwillen hatte er das Gefuehl gezuegelt und erkaeltet, weil er\nwusste, dass es geneigt ist, sich mit einem froehlichen Ungefaehr und mit\neiner halben Vollkommenheit zu begnuegen. Raechte sich nun also die\ngeknechtete Empfindung, indem sie ihn verliess, indem sie seine Kunst\nfuerder zu tragen und zu befluegeln sich weigerte und alle Lust, alles\nEntzuecken an der Form und am Ausdruck mit sich hinwegnahm?\nNicht, dass er Schlechtes herstellte: Dies wenigstens war der Vorteil\nseiner Jahre, dass er sich seiner Meisterschaft jeden Augenblick in\nGelassenheit sicher fuehlte. Aber er selbst, waehrend die Nation sie\nehrte, er ward ihrer nicht froh, und es schien ihm, als ermangle sein\nWerk jener Merkmale feurig spielender Laune, die, ein Erzeugnis der\nFreude, mehr als irgend ein innerer Gehalt, ein gewichtigerer Vorzug,\ndie Freude der geniessenden Welt bildeten. Er fuerchtete sich vor dem\nSommer auf dem Lande, allein in dem kleinen Hause mit der Magd, die\nihm das Essen bereitete, und dem Diener, der es ihm auftrug; fuerchtete\nsich vor den vertrauten Angesichten der Berggipfel und-waende, die\nwiederum seine unzufriedene Langsamkeit umstehen wuerden. Und\nso tat denn eine Einschaltung not, etwas Stegreifdasein, Tagdieberei,\nFernluft und Zufuhr neuen Blutes, damit der Sommer ertraeglich und\nergiebig werde. Reisen also,--er war es zufrieden. Nicht gar weit,\nnicht gerade bis zu den Tigern. Eine Nacht im Schlafwagen und eine\nSiesta von drei, vier Wochen an irgend einem Allerweltsferienplatze im\nliebenswuerdigen Sueden...\n\nSo dachte er, waehrend der Laerm der elektrischen Tram die Ungererstrasse\ndaher sich naeherte, und einsteigend beschloss er, diesen Abend dem\nStudium von Karte und Kursbuch zu widmen. Auf der Plattform fiel ihm\nein, nach dem Manne im Basthut, dem Genossen dieses immerhin\nfolgereichen Aufenthaltes, Umschau zu halten. Doch wurde ihm dessen\nVerbleib nicht deutlich, da er weder an seinem vorherigen Standort,\nnoch auf dem weiteren Halteplatz, noch auch im Wagen ausfindig zu\nmachen war.\n\n\n\n\nZweites Kapitel\n\n\nDer Autor der klaren und maechtigen Prosa-Epopoee vom Leben Friedrichs\nvon Preussen; der geduldige Kuenstler, der in langem Fleiss den\nfigurenreichen, so vielerlei Menschenschicksal im Schatten einer Idee\nversammelnden Romanteppich, \"Maja\" mit Namen, wob; der Schoepfer\njener starken Erzaehlung, die \"Ein Elender\" ueberschrieben ist und einer\nganzen dankbaren Jugend die Moeglichkeit sittlicher Entschlossenheit\njenseits der tiefsten Erkenntnis zeigte; der Verfasser endlich (und\ndamit sind die Werke seiner Reifezeit kurz bezeichnet) der\nleidenschaftlichen Abhandlung ueber \"Geist und Kunst\", deren\nordnende Kraft und antithetische Beredsamkeit ernste Beurteiler\nvermochte, sie unmittelbar neben Schillers Raisonnement ueber naive\nund sentimentalische Dichtung zu stellen: Gustav Aschenbach also war\nzu L., einer Kreisstadt der Provinz Schlesien, als Sohn eines hoeheren\nJustizbeamten geboren. Seine Vorfahren waren Offiziere, Richter,\nVerwaltungsfunktionaere gewesen, Maenner, die im Dienste des Koenigs, des\nStaates, ihr straffes, anstaendig karges Leben gefuehrt hatten. Innigere\nGeistigkeit hatte sich einmal, in der Person eines Predigers, unter\nihnen verkoerpert; rascheres, sinnlicheres Blut war der Familie in der\nvorigen Generation durch die Mutter des Dichters, Tochter eines\nboehmischen Kapellmeisters, zugekommen. Von ihr stammten die Merkmale\nfremder Rasse in seinem Aeussern. Die Vermaehlung dienstlich nuechterner\nGewissenhaftigkeit mit dunkleren, feurigeren Impulsen liess einen\nKuenstler und diesen besonderen Kuenstler erstehen. Da sein ganzes\nWesen auf Ruhm gestellt war, zeigte er sich, wenn nicht eigentlich\nfrueh reif, so doch, dank der Entschiedenheit und persoenlichen Praegnanz\nseines Tonfalls frueh fuer die Oeffentlichkeit reif und geschickt. Beinahe\nnoch Gymnasiast, besass er einen Namen. Zehn Jahre spaeter hatte\ner gelernt, von seinem Schreibtische aus zu repraesentieren, seinen\nRuhm zu verwalten in einem Briefsatz, der kurz sein musste (denn viele\nAnsprueche draengen auf den Erfolgreichen, den Vertrauenswuerdigen ein),\nguetig und bedeutend zu sein. Der Vierziger hatte, ermattet von den\nStrapazen und Wechselfaellen der eigentlichen Arbeit, alltaeglich eine\nPost zu bewaeltigen, die Wertzeichen aus aller Herren Laendern trug.\n\nEbensoweit entfernt vom Banalen wie vom Exzentrischen, war sein Talent\ngeschaffen, den Glauben des breiten Publikums und die bewundernde,\nfordernde Teilnahme der Waehlerischen zugleich zu gewinnen. So, schon\nals Juengling von allen Seiten auf die Leistung--und zwar die\nausserordentliche--verpflichtet, hatte er niemals den Muessiggang,\nniemals die Fahrlaessigkeit der Jugend gekannt. Als er um sein\nfuenfunddreissigstes Jahr in Wien erkrankte, aeusserte ein feiner Beobachter\nueber ihn in Gesellschaft: \"Sehen Sie, Aschenbach hat von jeher nur so\ngelebt\"--und der Sprecher schloss die Finger seiner Linken fest zur\nFaust--; \"niemals so\"--und er liess die geoeffnete Hand bequem\nvon der Lehne des Sessels haengen. Das traf zu; und das\nTapfer-Sittliche daran war, dass seine Natur von nichts weniger als\nrobuster Verfassung und zur staendigen Anspannung nur berufen, nicht\neigentlich geboren war.\n\nAerztliche Fuersorge hatte den Knaben vom Schulbesuch ausgeschlossen\nund auf haeuslichen Unterricht gedrungen. Einzeln, ohne Kameradschaft\nwar er aufgewachsen und hatte doch zeitig erkennen muessen, dass er\neinem Geschlecht angehoerte, in dem nicht das Talent, wohl aber die\nphysische Basis eine Seltenheit war, deren das Talent zu seiner\nErfuellung bedarf,--einem Geschlechte, das frueh sein Bestes zu geben\npflegt und in dem das Koennen es selten zu Jahren bringt. Aber sein\nLieblingswort war \"Durchhalten\",--er sah in seinem Friedrich-Roman\nnichts anderes als die Apotheose dieses Befehlswortes, das ihm als der\nInbegriffleitend-taetiger Tugend erschien. Auch wuenschte er sehnlichst,\nalt zu werden, denn er hatte von jeher dafuer gehalten, dass wahrhaft\ngross, umfassend, ja wahrhaft ehrenwert nur das Kuenstlertum zu nennen\nsei, dem es beschieden war, auf allen Stufen des Menschlichen\ncharakteristisch fruchtbar zu sein.\n\nDa er also die Aufgaben, mit denen sein Talent ihn belud, auf zarten\nSchultern tragen und weit gehen wollte, so bedurfte er hoechlich der\nZucht,--und Zucht war ja zum Gluecke sein eingeborenes Erbteil von\nvaeterlicher Seite. Mit vierzig, mit fuenfzig Jahren wie schon in einem\nAlter, wo andere verschwenden, schwaermen, die Ausfuehrung grosser Plaene\ngetrost verschieben, begann er seinen Tag beizeiten mit Stuerzen\nkalten Wassers ueber Brust und Ruecken und brachte dann, ein Paar hoher\nWachskerzen in silbernen Leuchtern zu Haeupten des Manuskripts, die\nKraefte, die er im Schlaf gesammelt, in zwei oder drei inbruenstig\ngewissenhaften Morgenstunden der Kunst zum Opfer dar. Es war\nverzeihlich, ja, es bedeutete recht eigentlich den Sieg seiner\nMoralitaet, wenn Unkundige die Maja-Welt oder die epischen Massen,\nin denen sich Friedrichs Heldenleben entrollte, fuer das Erzeugnis\ngedrungener Kraft und eines langen Atems hielten, waehrend sie vielmehr\nin kleinen Tagewerken aus hundert Einzelinspirationen zur Groesse\nemporgeschichtet und nur darum so durchaus und an jedem Punkte\nvortrefflich waren, weil ihr Schoepfer mit einer Willensdauer und\nZaehigkeit, derjenigen aehnlich, die seine Heimatprovinz eroberte,\njahrelang unter der Spannung eines und desselben Werkes ausgehalten\nund an die eigentliche Herstellung ausschliesslich seine staerksten und\nwuerdigsten Stunden gewandt hatte.\n\nDamit ein bedeutendes Geistesprodukt auf der Stelle eine breite und\ntiefe Wirkung zu ueben vermoege, muss eine tiefe Verwandtschaft, ja\nUebereinstimmung zwischen dem persoenlichen Schicksal seines Urhebers\nund dem allgemeinen des mitlebenden Geschlechtes bestehen. Die\nMenschen wissen nicht, warum sie einem Kunstwerk Ruhm bereiten. Weit\nentfernt von Kennerschaft, glauben sie hundert Vorzuege daran zu\nentdecken, um so viel Teilnahme zu rechtfertigen; aber der\neigentliche Grund ihres Beifalls ist ein Unwaegbares, ist Sympathie.\nAschenbach hatte es einmal an wenig sichtbarer Stelle unmittelbar\nausgesprochen, dass beinahe alles Grosse, was dastehe, als ein Trotzdem\ndastehe, trotz Kummer und Qual, Armut, Verlassenheit, Koerperschwaeche,\nLaster, Leidenschaft und tausend Hemmnissen zustande gekommen sei.\nAber das war mehr als eine Bemerkung, es war eine Erfahrung, war\ngeradezu die Formel seines Lebens und Ruhmes, der Schluessel zu seinem\nWerk; und was Wunder also, wenn es auch der sittliche Charakter, die\naeussere Gebaerde seiner eigentuemlichsten Figuren war?\n\nUeber den neuen, in mannigfach individuellen Erscheinungen\nwiederkehrenden Heldentyp, den dieser Schriftsteller bevorzugte, hatte\nschon fruehzeitig ein kluger Zergliederer geschrieben: dass er die\nKonzeption \"einer intellektuellen und juenglinghaften Maennlichkeit\"\nsei, \"die in stolzer Scham die Zaehne aufeinanderbeisst und ruhig\ndasteht, waehrend ihr die Schwerter und Speere durch den Leib gehen\".\nDas war schoen, geistreich und exakt, trotz seiner scheinbar allzu\npassivischen Praegung. Denn Haltung im Schicksal, Anmut in der Qual\nbedeutet nicht nur ein Dulden; sie ist eine aktive Leistung, ein\npositiver Triumph, und die Sebastian-Gestalt ist das schoenste\nSinnbild, wenn nicht der Kunst ueberhaupt, so doch gewiss der in Rede\nstehenden Kunst. Blickte man hinein in diese erzaehlte Welt, sah man\ndie elegante Selbstbeherrschung, die bis zum letzten Augenblick eine\ninnere Unterhoehlung, den biologischen Verfall vor den Augen der Welt\nverbirgt; die gelbe, sinnlich benachteiligte Haesslichkeit, die es\nvermag, ihre schwelende Brunst zur reinen Flamme zu entfachen, ja,\nsich zur Herrschaft im Reiche der Schoenheit aufzuschwingen; die\nbleiche Ohnmacht, welche aus den gluehenden Tiefen des Geistes die\nKraft holt, ein ganzes uebermuetiges Volk zu Fuessen des Kreuzes, zu\n_ihren_ Fuessen niederzuwerfen; die liebenswuerdige Haltung im leeren und\nstrengen Dienste der Form; das falsche, gefaehrliche Leben, die rasch\nentnervende Sehnsucht und Kunst des gebornen Betruegers: betrachtete\nman all dies Schicksal und wieviel gleichartiges noch, so konnte man\nzweifeln, ob es ueberhaupt einen anderen Heroismus gaebe, als denjenigen\nder Schwaeche. Welches Heldentum aber jedenfalls waere zeitgemaesser als\ndieses? Gustav Aschenbach war der Dichter all derer, die am Rande der\nErschoepfung arbeiten, der Ueberbuerdeten, schon Aufgeriebenen, sich noch\nAufrechthaltenden, all dieser Moralisten der Leistung, die, schmaechtig\nvon Wuchs und sproede von Mitteln, durch Willensverzueckung und kluge\nVerwaltung sich wenigstens eine Zeitlang die Wirkungen der Groesse\nabgewinnen. Ihrer sind viele, sie sind die Helden des Zeitalters. Und\nsie alle erkannten sich wieder in seinem Werk, sie fanden sich\nbestaetigt, erhoben, besungen darin, sie wussten ihm Dank, sie\nverkuendeten seinen Namen.\n\nEr war jung und roh gewesen mit der Zeit und, schlecht beraten von\nihr, war er oeffentlich gestrauchelt, hatte Missgriffe getan, sich\nblossgestellt, Verstoesse gegen Takt und Besonnenheit begangen in Wort\nund Werk. Aber er hatte die Wuerde gewonnen, nach welcher, wie er\nbehauptete, jedem grossen Talente ein natuerlicher Drang und Stachel\neingeboren ist, ja, man kann sagen, dass seine ganze Entwicklung ein\nbewusster und trotziger, alle Hemmungen des Zweifels und der Ironie\nzuruecklassender Aufstieg zur Wuerde gewesen war.\n\nLebendige, geistig unverbindliche Greifbarkeit der Gestaltung bildet\ndas Ergoetzen der buergerlichen Massen, aber leidenschaftlich unbedingte\nJugend wird nur durch das Problematische gefesselt: und Aschenbach\nwar problematisch, war unbedingt gewesen wie nur irgendein Juengling.\nEr hatte dem Geiste gefroent, mit der Erkenntnis Raubbau getrieben,\nSaatfrucht vermahlen, Geheimnisse preisgegeben, das Talent\nverdaechtigt, die Kunst verraten,--ja, waehrend seine Bildwerke die\nglaeubig Geniessenden unterhielten, erhoben, belebten, hatte er, der\njugendliche Kuenstler, die Zwanzigjaehrigen durch seine Zynismen ueber\ndas fragwuerdige Wesen der Kunst, des Kuenstlertums selbst in Atem\ngehalten.\n\nAber es scheint, dass gegen nichts ein edler und tuechtiger Geist sich\nrascher, sich gruendlicher abstumpft als gegen den scharfen und\nbitteren Reiz der Erkenntnis; und gewiss ist, dass die schwermuetig\ngewissenhafteste Gruendlichkeit des Juenglings Seichtheit bedeutet im\nVergleich mit dem tiefen Entschlusse des Meister gewordenen Mannes,\ndas Wissen zu leugnen, es abzulehnen, erhobenen Hauptes darueber\nhinwegzusehen, sofern es den Willen, die Tat, das Gefuehl und selbst\ndie Leidenschaft im Geringsten zu laehmen, zu entmutigen, zu\nentwuerdigen geeignet ist. Wie waere die beruehmte Erzaehlung vom\n\"Elenden\" wohl anders zu deuten denn als Ausbruch des Ekels gegen\nden unanstaendigen Psychologismus der Zeit, verkoerpert in der Figur\njenes weichen und albernen Halbschurken, der sich ein Schicksal\nerschleicht, indem er sein Weib, aus Ohnmacht, aus Lasterhaftigkeit,\naus ethischer Velleitaet, in die Arme eines Unbaertigen treibt und aus\nTiefe Nichtswuerdigkeiten begehen zu duerfen glaubt? Die Wucht des Wortes,\nmit welchem hier das Verworfene verworfen wurde, verkuendete die Abkehr\nvon allem moralischen Zweifelsinn, von jeder Sympathie mit dem Abgrund,\ndie Absage an die Laxheit des Mitleidssatzes, dass alles verstehen\nalles verzeihen heisse, und was sich hier vorbereitete, ja schon vollzog,\nwar jenes \"Wunder der wiedergeborenen Unbefangenheit\", auf\nwelches ein wenig spaeter in einem der Dialoge des Autors ausdruecklich\nund nicht ohne geheimnisvolle Betonung die Rede kam. Seltsame\nZusammenhaenge! War es eine geistige Folge dieser \"Wiedergeburt\",\ndieser neuen Wuerde und Strenge, dass man um dieselbe Zeit ein fast\nuebermaessiges Erstarken seines Schoenheitssinnes beobachtete, jene\nadelige Reinheit, Einfachheit und Ebenmaessigkeit der Formgebung,\nwelche seinen Produkten fortan ein so sinnfaelliges, ja gewolltes\nGepraege der Meisterlichkeit und Klassizitaet verlieh? Aber moralische\nEntschlossenheit jenseits des Wissens, der aufloesenden und hemmenden\nErkenntnis,--bedeutet sie nicht wiederum eine Vereinfachung, eine\nsittliche Vereinfaeltigung der Welt und der Seele und also auch ein\nErstarken zum Boesen, Verbotenen, zum sittlich Unmoeglichen? Und hat\nForm nicht zweierlei Gesicht? Ist sie nicht sittlich und unsittlich\nzugleich,--sittlich als Ergebnis und Ausdruck der Zucht, unsittlich\naber und selbst widersittlich, sofern sie von Natur eine moralische\nGleichgueltigkeit in sich schliesst, ja, wesentlich bestrebt ist, das\nMoralische unter ihr stolzes und unumschraenktes Szepter zu beugen?\n\nWie dem auch sei! Eine Entwicklung ist ein Schicksal; und wie sollte\nnicht diejenige anders verlaufen, die von der Teilnahme, dem\nMassenzutrauen einer weiten Oeffentlichkeit begleitet wird, als jene,\ndie sich ohne den Glanz und die Verbindlichkeiten des Ruhmes\nvollzieht? Nur ewiges Zigeunertum findet es langweilig und ist zu\nspotten geneigt, wenn ein grosses Talent dem libertinischen\nPuppenstande entwaechst, die Wuerde des Geistes ausdrucksvoll\nwahrzunehmen sich gewoehnt und die Hofsitten einer Einsamkeit annimmt,\ndie voll unberatener, hart selbstaendiger Leiden und Kaempfe war und es\nzu Macht und Ehren unter den Menschen brachte. Wieviel Spiel, Trotz,\nGenuss ist uebrigens in der Selbstgestaltung des Talentes! Etwas\nAmtlich-Erzieherisches trat mit der Zeit in Gustav Aschenbachs\nVorfuehrungen ein, sein Stil entriet in spaeteren Jahren der\nunmittelbaren Kuehnheiten, der subtilen und neuen Abschattungen, er\nwandelte sich ins Mustergueltig-Feststehende, Geschliffen-Herkoemmliche,\nErhaltende, Formelle, selbst Formelhafte, und wie die Ueberlieferung es\nvon Ludwig dem Vierzehnten wissen will, so verbannte der Alternde aus\nseiner Sprachweise jedes gemeine Wort: Damals geschah es, dass die\nUnterrichtsbehoerde ausgewaehlte Seiten von ihm in die vorgeschriebenen\nSchullesebuecher uebernahm. Es war ihm innerlich gemaess, und er lehnte\nnicht ab, als ein deutscher Fuerst, soeben zum Throne gelangt, dem\nDichter des \"Friedrich\" zu seinem fuenfzigsten Geburtstag den\npersoenlichen Adel verlieh.\n\nNach einigen Jahren der Unruhe, einigen Versuchsaufenthalten da und\ndort waehlte er fruehzeitig Muenchen zum dauernden Wohnsitz und lebte\ndort in buergerlichem Ehrenstande, wie er dem Geiste in besonderen\nEinzelfaellen zuteil wird. Die Ehe, die er in noch jugendlichem Alter\nmit einem Maedchen aus gelehrter Familie eingegangen, wurde nach kurzer\nGluecksfrist durch den Tod getrennt. Eine Tochter, schon Gattin, war\nihm geblieben. Einen Sohn hatte er nie besessen.\n\nGustav von Aschenbach war ein wenig unter Mittelgroesse, bruenett,\nrasiert. Sein Kopf erschien ein wenig zu gross im Verhaeltnis zu der\nfast zierlichen Gestalt. Sein rueckwaerts gebuerstetes Haar, am Scheitel\ngelichtet, an den Schlaefen sehr voll und stark ergraut, umrahmte eine\nhohe, zerklueftete und gleichsam narbige Stirn. Der Buegel einer\nGoldbrille mit randlosen Glaesern schnitt in die Wurzel der\ngedrungenen, edel gebogenen Nase ein. Der Mund war gross, oft schlaff,\noft ploetzlich schmal und gespannt; die Wangenpartie mager und\ngefurcht, das wohlausgebildete Kinn weich gespalten. Bedeutende\nSchicksale schienen ueber dies meist leidend seitwaerts geneigte Haupt\nhinweggegangen zu sein, und doch war die Kunst es gewesen, die hier\njene physiognomische Durchbildung uebernommen hatte, welche sonst das\nWerk eines schweren, bewegten Lebens ist. Hinter dieser Stirn waren\ndie blitzenden Repliken des Gespraechs zwischen Voltaire und dem Koenige\nueber den Krieg geboren; diese Augen, muede und tief durch die Glaeser\nblickend, hatten das blutige Inferno der Lazarette des Siebenjaehrigen\nKrieges gesehen. Auch persoenlich genommen ist ja die Kunst ein\nerhoehtes Leben. Sie beglueckt tiefer, sie verzehrt rascher. Sie graebt\nin das Antlitz ihres Dieners die Spuren imaginaerer und geistiger\nAbenteuer, und sie erzeugt, selbst bei kloesterlicher Stille des\naeusseren Daseins, auf die Dauer eine Verwoehntheit, Ueberfeinerung,\nMuedigkeit und Neugier der Nerven, wie ein Leben voll ausschweifendster\nLeidenschaften und Genuesse sie kaum hervorzubringen vermag.\n\n\n\n\nDrittes Kapitel\n\n\nMehrere Geschaefte weltlicher und literarischer Natur hielten den\nReiselustigen noch etwa zwei Wochen nach jenem Spaziergang in Muenchen\nzurueck. Er gab endlich Auftrag, sein Landhaus binnen vier Wochen zum\nEinzuge instandzusetzen und reiste an einem Tage zwischen Mitte und\nEnde des Mai mit dem Nachtzuge nach Triest, wo er nur vierundzwanzig\nStunden verweilte und sich am naechstfolgenden Morgen nach Pola\neinschiffte. Was er suchte, war das Fremdartige und Bezuglose,\nwelches jedoch rasch zu erreichen waere, und so nahm er Aufenthalt auf\neiner seit einigen Jahren geruehmten Insel der Adria, unfern der\nistrischen Kueste gelegen, mit farbig zerlumptem, in wildfremden Lauten\nredendem Landvolk und schoen zerrissenen Klippenpartien dort, wo das\nMeer offen war. Allein Regen und schwere Luft, eine kleinweltliche,\ngeschlossen oesterreichische Hotelgesellschaft und der Mangel jenes\nruhevoll innigen Verhaeltnisses zum Meere, das nur ein sanfter,\nsandiger Strand gewaehrt, verdrossen ihn, liessen ihn nicht das\nBewusstsein gewinnen, den Ort seiner Bestimmung getroffen zu haben; ein\nZug seines Innern, ihm war noch nicht deutlich, wohin, beunruhigte\nihn, er studierte Schiffsverbindungen, er blickte suchend umher, und\nauf einmal, zugleich ueberraschend und selbstverstaendlich, stand ihm\nsein Ziel vor Augen. Wenn man ueber Nacht das Unvergleichliche, das\nmaerchenhaft Abweichende zu erreichen wuenschte, wohin ging man? Aber\ndas war klar. Was sollte er hier? Er war fehlgegangen. Dorthin hatte\ner reisen wollen. Er saeumte nicht, den irrigen Aufenthalt zu kuendigen.\nAnderthalb Wochen nach seiner Ankunft auf der Insel trug ein\ngeschwindes Motorboot ihn und sein Gepaeck in dunstiger Fruehe ueber die\nWasser in den Kriegshafen zurueck, und er ging dort nur an Land, um\nsogleich ueber einen Brettersteg das feuchte Verdeck eines Schiffes zu\nbeschreiten, das unter Dampf zur Fahrt nach Venedig lag.\n\nEs war ein betagtes Fahrzeug italienischer Nationalitaet, veraltet,\nrussig und duester. In einer hoehlenartigen, kuenstlich erleuchteten Koje\ndes inneren Raumes, wohin Aschenbach sofort nach Betreten des Schiffes\nvon einem buckligen und unreinlichen Matrosen mit grinsender\nHoeflichkeit genoetigt wurde, sass hinter einem Tische, den Hut schief in\nder Stirn und einen Zigarettenstummel im Mundwinkel, ein\nziegenbaertiger Mann von der Physiognomie eines altmodischen\nZirkusdirektors, der mit grimassenhaft leichtem Geschaeftsgebaren die\nPersonalien der Reisenden aufnahm und ihnen die Fahrscheine\nausstellte. \"Nach Venedig!\" wiederholte er Aschenbachs Ansuchen, indem\ner den Arm reckte und die Feder in den breiigen Restinhalt eines\nschraeg geneigten Tintenfasses stiess. \"Nach Venedig erster Klasse! Sie\nsind bedient, mein Herr!\" Und er schrieb grosse Kraehenfuesse, streute aus\neiner Buechse blauen Sand auf die Schrift, liess ihn in eine toenerne\nSchale ablaufen, faltete das Papier mit gelben und knochigen Fingern\nund schrieb aufs neue. \"Ein gluecklich gewaehltes Reiseziel!\" schwatzte\ner unterdessen. \"Ah, Venedig! Eine herrliche Stadt! Eine Stadt von\nunwiderstehlicher Anziehungskraft fuer den Gebildeten, ihrer Geschichte\nsowohl wie ihrer gegenwaertigen Reize wegen!\" Die glatte Raschheit\nseiner Bewegungen und das leere Gerede, womit er sie begleitete,\nhatten etwas Betaeubendes und Ablenkendes, etwa als besorgte er, der\nReisende moechte in seinem Entschluss, nach Venedig zu fahren, noch\nwankend werden. Er kassierte eilig und liess mit Croupiergewandtheit\nden Differenzbetrag auf den fleckigen Tuchbezug des Tisches fallen.\n\"Gute Unterhaltung, mein Herr!\" sagte er mit schauspielerischer\nVerbeugung. \"Es ist mir eine Ehre, Sie zu befoerdern... Meine Herren!\"\nrief er sogleich mit erhobenem Arm und tat, als sei das Geschaeft im\nflottesten Gange, obgleich niemand mehr da war, der nach Abfertigung\nverlangt haette. Aschenbach kehrte auf das Verdeck zurueck.\n\nEinen Arm auf die Bruestung gelehnt, betrachtete er das muessige Volk,\ndas, der Abfahrt des Schiffes beizuwohnen, am Quai lungerte, und die\nPassagiere an Bord. Diejenigen der zweiten Klasse kauerten, Maenner und\nWeiber, auf dem Vorderdeck, indem sie Kisten und Buendel als Sitze\nbenutzten. Eine Gruppe junger Leute bildete die Reisegesellschaft des\nersten Verdecks, Polenser Handelsgehuelfen, wie es schien, die sich in\nangeregter Laune zu einem Ausflug nach Italien vereinigt hatten. Sie\nmachten nicht wenig Aufhebens von sich und ihrem Unternehmen,\nschwatzten, lachten, genossen selbstgefaellig das eigene Gebaerdenspiel\nund riefen den Kameraden, die, Portefeuilles unterm Arm, in Geschaeften\ndie Hafenstrasse entlang gingen und den Feiernden mit dem Stoeckchen\ndrohten, ueber das Gelaender gebeugt, zungengelaeufige Spottreden nach.\nEiner, in hellgelbem, uebermodisch geschnittenem Sommeranzug, roter\nKrawatte und kuehn aufgebogenem Panama, tat sich mit kraehender Stimme\nan Aufgeraeumtheit vor allen andern hervor. Kaum aber hatte Aschenbach\nihn genauer ins Auge gefasst, als er mit einer Art von Entsetzen\nerkannte, dass der Juengling falsch war. Er war alt, man konnte nicht\nzweifeln. Runzeln umgaben ihm Augen und Mund. Das matte Karmesin der\nWangen war Schminke, das braune Haar unter dem farbig umwundenen\nStrohhut Peruecke, sein Hals verfallen und sehnig, sein aufgesetztes\nSchnurrbaertchen und die Fliege am Kinn gefaerbt, sein gelbes und\nvollzaehliges Gebiss, das er lachend zeigte, ein billiger Ersatz, und\nseine Haende, mit Siegelringen an beiden Zeigefingern, waren die eines\nGreises. Schauerlich angemutet sah Aschenbach ihm und seiner\nGemeinschaft mit den Freunden zu. Wussten, bemerkten sie nicht, dass er\nalt war, dass er zu Unrecht ihre stutzerhafte und bunte Kleidung trug,\nzu Unrecht einen der Ihren spielte? Selbstverstaendlich und\ngewohnheitsmaessig, wie es schien, duldeten sie ihn in ihrer Mitte,\nbehandelten ihn als ihresgleichen, erwiderten ohne Abscheu seine\nneckischen Rippenstoesse. Wie ging das zu? Aschenbach bedeckte seine\nStirn mit der Hand und schloss die Augen, die heiss waren, da er zu\nwenig geschlafen hatte. Ihm war, als lasse nicht alles sich ganz\ngewoehnlich an, als beginne eine traeumerische Entfremdung, eine\nEntstellung der Welt ins Sonderbare um sich zu greifen, der vielleicht\nEinhalt zu tun waere, wenn er sein Gesicht ein wenig verdunkelte und\naufs neue um sich schaute. In diesem Augenblick jedoch beruehrte ihn\ndas Gefuehl des Schwimmens, und mit unvernuenftigem Erschrecken\naufsehend, gewahrte er, dass der schwere und duestere Koerper des\nSchiffes sich langsam vom gemauerten Ufer loeste. Zollweise, unter dem\nVorwaerts-und Rueckwaertsarbeiten der Maschine, verbreitete sich der\nStreifen schmutzig schillernden Wassers zwischen Quai und Schiffswand,\nund nach schwerfaelligen Manoevern kehrte der Dampfer seinen Bugspriet\ndem offenen Meere zu. Aschenbach ging nach der Steuerbordseite\nhinueber, wo der Bucklige ihm einen Liegestuhl aufgeschlagen hatte und\nein Steward in fleckigem Frack nach seinen Befehlen fragte.\n\nDer Himmel war grau, der Wind feucht; Hafen und Inseln waren\nzurueckgeblieben, und rasch verlor sich aus dem dunstigen\nGesichtskreise alles Land. Flocken von Kohlenstaub gingen, gedunsen\nvon Naesse, auf das gewaschene Deck nieder, das nicht trocknen wollte.\nSchon nach einer Stunde spannte man ein Segeldach aus, da es zu regnen\nbegann.\n\nIn seinen Mantel geschlossen, ein Buch im Schosse, ruhte der Reisende,\nund die Stunden verrannen ihm unversehens. Es hatte zu regnen\naufgehoert; man entfernte das leinene Dach. Der Horizont war\nvollkommen. Unter der breiten Kuppel des Himmels dehnte sich rings die\nungeheure Scheibe des oeden Meeres; aber im leeren, ungegliederten\nRaume fehlt unserem Sinn auch das Mass der Zeit, und wir daemmern im\nUngemessenen. Schattenhaft sonderbare Gestalten, der greise Geck, der\nZiegenbart aus dem Schiffsinnern, gingen mit unbestimmten Gebaerden,\nmit verwirrten Traumworten durch den Geist des Ruhenden, und er\nschlief ein.\n\nUm Mittag noetigte man ihn hinab, damit er in dem korridorartigen\nSpeisesaal, auf den die Tueren der Schlafkojen muendeten, zu Haeupten\neines langen Tisches, an dessen unterem Ende die Handelsgehuelfen,\neinschliesslich des Alten, seit zehn Uhr mit dem munteren Kapitaen\npokulierten, die bestellte Mahlzeit naehme. Sie war armselig, und er\nbeendete sie rasch. Es trieb ihn ins Freie, nach dem Himmel zu sehen:\nob er denn nicht ueber Venedig sich erhellen wollte.\n\nEr hatte nicht anders gedacht, als dass dies geschehen muesse, denn\nstets hatte die Stadt ihn im Glanze empfangen. Aber Himmel und Meer\nblieben trueb und bleiern, zeitweilig ging neblichter Regen nieder, und\ner fand sich darein, auf dem Wasserwege ein anderes Venedig zu\nerreichen, als er, zu Lande sich naehernd, je angetroffen hatte. Er\nstand am Fockmast, den Blick im Weiten, das Land erwartend. Er\ngedachte des schwermuetig-enthusiastischen Dichters, dem vormals die\nKuppeln und Glockentuerme seines Traumes aus diesen Fluten gestiegen\nwaren, er wiederholte im Stillen einiges von dem, was damals an\nEhrfurcht, Glueck und Trauer zu massvollem Gesange geworden, und von\nschon gestalteter Empfindung muehelos bewegt, pruefte er sein ernstes\nund muedes Herz, ob eine erneuernde Begeisterung und Verwirrung, ein\nspaetes Abenteuer des Gefuehles dem fahrenden Muessiggaenger vielleicht\nnoch vorbehalten sein koenne.\n\nDa tauchte zur Rechten die flache Kueste auf, Fischerboote belebten das\nMeer, die Baederinsel erschien, der Dampfer liess sie zur Linken, glitt\nverlangsamten Ganges durch den schmalen Port, der nach ihr benannt\nist, und auf der Lagune, angesichts bunt armseliger Behausungen hielt\ner ganz, da die Barke des Sanitaetsdienstes erwartet werden musste.\n\nEine Stunde verging, bis sie erschien. Man war angekommen und war es\nnicht; man hatte keine Eile und fuehlte sich doch von Ungeduld\ngetrieben. Die jungen Polenser, patriotisch angezogen auch wohl von\nden militaerischen Hornsignalen, die aus der Gegend der oeffentlichen\nGaerten her ueber das Wasser klangen, waren auf Deck gekommen, und, vom\nAsti begeistert, brachten sie Lebehochs auf die drueben exerzierenden\nBersaglieri aus. Aber widerlich war es zu sehen, in welchen Zustand\nden aufgestutzten Greisen seine falsche Gemeinschaft mit der Jugend\ngebracht hatte. Sein altes Hirn hatte dem Weine nicht wie die\njugendlich ruestigen Stand zu halten vermocht, er war klaeglich\nbetrunken. Verbloedeten Blicks, eine Zigarette zwischen den zitternden\nFingern, schwankte er, muehsam das Gleichgewicht haltend, auf der\nStelle, vom Rausche vorwaerts und rueckwaerts gezogen. Da er beim ersten\nSchritte gefallen waere, getraute er sich nicht vom Fleck, doch zeigte\ner einen jammervollen Uebermut, hielt jeden, der sich ihm naeherte, am\nKnopfe fest, lallte, zwinkerte, kicherte, hob seinen beringten,\nrunzeligen Zeigefinger zu alberner Neckerei und leckte auf abscheulich\nzweideutige Art mit der Zungenspitze die Mundwinkel. Aschenbach sah\nihm mit finsteren Brauen zu, und wiederum kam ein Gefuehl von\nBenommenheit ihn an, so, als zeige die Welt eine leichte, doch nicht\nzu hemmende Neigung, sich ins Sonderbare und Fratzenhafte zu\nentstellen; ein Gefuehl, dem nachzuhaengen freilich die Umstaende ihn\nabhielten, da eben die stampfende Taetigkeit der Maschine aufs neue\nbegann und das Schiff seine so nah dem Ziel unterbrochene Fahrt durch\nden Kanal von San Marco wieder aufnahm. So sah er ihn denn wieder,\nden erstaunlichsten Landungsplatz, jene blendende Komposition\nphantastischen Bauwerks, welche die Republik den ehrfuerchtigen Blicken\nnahender Seefahrer entgegenstellte: die leichte Herrlichkeit des\nPalastes und die Seufzerbruecke, die Saeulen mit Loew' und Heiligem am\nUfer, die prunkend vortretende Flanke des Maerchentempels, den\nDurchblick auf Torweg und Riesenuhr, und anschauend bedachte er, dass\nzu Lande, auf dem Bahnhof in Venedig anlangen, einen Palast durch eine\nHintertuer betreten heisse, und dass man nicht anders als wie nun er, als\nzu Schiffe, als ueber das hohe Meer die unwahrscheinlichste der Staedte\nerreichen sollte.\n\nDie Maschine stoppte, Gondeln draengten herzu, die Fallreepstreppe ward\nherabgelassen, Zollbeamte stiegen an Bord und walteten obenhin ihres\nAmtes; die Ausschiffung konnte beginnen. Aschenbach gab zu verstehen,\ndass er eine Gondel wuensche, die ihn und sein Gepaeck zur Station jener\nkleinen Dampfer bringen solle, welche zwischen der Stadt und dem Lido\nverkehren; denn er gedachte am Meere Wohnung zu nehmen. Man billigt\nsein Vorhaben, man schreit seinen Wunsch zur Wasserflaeche hinab, wo\ndie Gondelfuehrer im Dialekt mit einander zanken. Er ist noch\ngehindert, hinabzusteigen, sein Koffer hindert ihn, der eben mit\nMuehsal die leiterartige Treppe hinunter gezerrt und geschleppt wird.\nSo sieht er sich minutenlang ausserstande, den Zudringlichkeiten des\nschauderhaften Alten zu entkommen, den die Trunkenheit dunkel\nantreibt, dem Fremden Abschiedshonneurs zu machen. \"Wir wuenschen den\ngluecklichsten Aufenthalt\", meckert er unter Kratzfuessen. \"Man empfiehlt\nsich geneigter Erinnerung! Au revoir, excusez und bon jour, Euer\nExzellenz!\" Sein Mund waessert, er drueckt die Augen ein, er leckt die\nMundwinkel, und die gefaerbte Bartfliege an seiner Greisenlippe straeubt\nsich empor. \"Unsere Komplimente\", lallt er, zwei Fingerspitzen am\nMunde, \"unsere Komplimente dem Liebchen, dem allerliebsten, dem\nschoensten Liebchen...\" Und ploetzlich faellt ihm das falsche Obergebiss\nvom Kiefer auf die Unterlippe. Aschenbach konnte entweichen. \"Dem\nLiebchen, dem feinen Liebchen\", hoerte er in girrenden, hohlen und\nbehinderten Lauten in seinem Ruecken, waehrend er, am Strickgelaender\nsich haltend, die Fallreepstreppe hinabklomm.\n\nWer haette nicht einen fluechtigen Schauder, eine geheime Scheu und\nBeklommenheit zu bekaempfen gehabt, wenn es zum ersten Male oder nach\nlanger Entwoehnung galt, eine venezianische Gondel zu besteigen? Das\nseltsame Fahrzeug, aus balladesken Zeiten ganz unveraendert ueberkommen\nund so eigentuemlich schwarz, wie sonst unter allen Dingen nur Saerge\nsind, es erinnert an lautlose und verbrecherische Abenteuer in\nplaetschernder Nacht, es erinnert noch mehr an den Tod selbst, an Bahre\nund duesteres Begaengnis und letzte, schweigsame Fahrt. Und hat man\nbemerkt, dass der Sitz einer solchen Barke, dieser sargschwarz\nlackierte, mattschwarz gepolsterte Armstuhl, der weichste, ueppigste,\nder erschlaffendste Sitz von der Welt ist? Aschenbach ward es gewahr,\nals er zu Fuessen des Gondoliers, seinem Gepaeck gegenueber, das am\nSchnabel reinlich beisammen lag, sich niedergelassen hatte. Die\nRuderer zankten immer noch, rauh, unverstaendlich, mit drohenden\nGebaerden. Aber die besondere Stille der Wasserstadt schien ihre\nStimmen sanft aufzunehmen, zu entkoerpern, ueber der Flut zu zerstreuen.\nEs war warm hier im Hafen. Lau angeruehrt vom Hauch des Scirocco, auf\ndem nachgiebigen Element in Kissen gelehnt, schloss der Reisende die\nAugen im Genuss einer so ungewohnten als suessen Laessigkeit. Die Fahrt\nwird kurz sein, dachte er; moechte sie immer waehren! In leisem\nSchwanken fuehlte er sich dem Gedraenge, dem Stimmengewirr entgleiten.\n\nWie still und stiller es um ihn wurde! Nichts war zu vernehmen als das\nPlaetschern des Ruders, das hohle Aufschlagen der Wellen gegen den\nSchnabel der Barke, der steil, schwarz und an der Spitze\nhellebardenartig bewehrt ueber dem Wasser stand und noch ein Drittes,\nein Reden, ein Raunen,--das Fluestern des Gondoliers, der zwischen den\nZaehnen, stossweise, in Lauten, die von der Arbeit seiner Arme gepresst\nwaren, zu sich selber sprach. Aschenbach blickte auf, und mit leichter\nBefremdung gewahrte er, dass um ihn her die Lagune sich weitete und\nseine Fahrt dem offenen Meere zugekehrt war. Es schien folglich, dass\ner nicht allzu sehr ruhen duerfe, sondern auf den Vollzug seines\nWillens ein wenig bedacht sein muesse.\n\n--Zur Dampferstation also! sagte er mit einer halben Wendung\nrueckwaerts. Das Raunen verstummte. Er erhielt keine Antwort.\n\n--Zur Dampferstation also! wiederholte er, indem er sich vollends\numwandte und in das Gesicht des Gondoliers emporblickte, der hinter\nihm, auf erhoehtem Borde stehend, vor dem fahlen Himmel aufragte. Es\nwar ein Mann von ungefaelliger, ja brutaler Physiognomie, seemaennisch\nblau gekleidet, mit einer gelben Schaerpe geguertet und einen formlosen\nStrohhut, dessen Geflecht sich aufzuloesen begann, verwegen schief auf\ndem Kopfe. Seine Gesichtsbildung, sein blonder, lockiger Schnurrbart\nunter der kurz aufgeworfenen Nase liessen ihn durchaus nicht\nitalienischen Schlages erscheinen. Obgleich eher schmaechtig von\nLeibesbeschaffenheit, so dass man ihn fuer seinen Beruf nicht sonderlich\ngeschickt geglaubt haette, fuehrte er das Ruder, bei jedem Schlage den\nganzen Koerper einsetzend, mit grosser Energie. Ein paarmal zog er vor\nAnstrengung die Lippen zurueck und entbloesste seine weissen Zaehne. Die\nroetlichen Brauen gerunzelt, blickte er ueber den Gast hinweg, indem er\nbestimmten, fast groben Tones erwiderte:\n\n--Sie fahren zum Lido.\n\nAschenbach entgegnete:\n\n--Allerdings. Aber ich habe die Gondel nur genommen, um mich nach San\nMarco uebersetzen zu lassen. Ich wuensche den Vaporetto zu benutzen.\n\n--Sie koennen den Vaporetto nicht benutzen, mein Herr.\n\n--Und warum nicht?\n\n--Weil der Vaporetto kein Gepaeck befoerdert.\n\nDas war richtig; Aschenbach erinnerte sich. Er schwieg. Aber die\nschroffe, ueberhebliche, einem Fremden gegenueber so wenig landesuebliche\nArt des Menschen schien unleidlich. Er sagte:\n\n--Das ist meine Sache. Vielleicht will ich mein Gepaeck in Verwahrung\ngeben. Sie werden umkehren. Er blieb still. Das Ruder plaetscherte,\ndas Wasser schlug dumpf an den Bug. Und das Reden und Raunen begann\nwieder: der Gondolier sprach zwischen den Zaehnen mit sich selbst.\n\nWas war zu tun? Allein auf der Flut mit dem sonderbar unbotmaessigen,\nunheimlich entschlossenen Menschen, sah der Reisende kein Mittel,\nseinen Willen durchzusetzen. Wie weich er uebrigens ruhen durfte, wenn\ner sich nicht empoerte. Hatte er nicht gewuenscht, dass die Fahrt lange,\ndass sie immer dauern moege? Es war das Kluegste, den Dingen ihren Lauf\nzu lassen, und es war hauptsaechlich hoechst angenehm. Ein Bann der\nTraegheit schien auszugehen von seinem Sitz, von diesem niedrigen,\nschwarzgepolsterten Armstuhl, so sanft gewiegt von den Ruderschlaegen\ndes eigenmaechtigen Gondoliers in seinem Ruecken. Die Vorstellung, einem\nVerbrecher in die Haende gefallen zu sein, streifte traeumerisch\nAschenbachs Sinn,--unvermoegend, seine Gedanken zu taetiger Abwehr\naufzurufen. Verdriesslicher schien die Moeglichkeit, dass alles auf\nsimple Geldschneiderei angelegt sei. Eine Art Pflichtgefuehl oder\nStolz, die Erinnerung gleichsam, dass man dem vorbeugen muesse,\nvermochte ihn, sich noch einmal aufzuraffen. Er fragte:\n\n--Was fordern Sie fuer die Fahrt?\n\nUnd ueber ihn hinsehend antwortete der Gondolier:\n\n--Sie werden bezahlen.\n\nEs stand fest, was hierauf zurueckzugeben war. Aschenbach sagte\nmechanisch:\n\n--Ich werde nichts bezahlen, durchaus nichts, wenn Sie mich fahren,\nwohin ich nicht will.\n\n--Sie wollen zum Lido.\n\n--Aber nicht mit Ihnen.\n\n--Ich fahre Sie gut.\n\nDas ist wahr, dachte Aschenbach und spannte sich ab. Das ist wahr, du\nfaehrst mich gut. Selbst, wenn du es auf meine Barschaft abgesehen hast\nund mich hinterruecks mit einem Ruderschlage ins Haus des Aides\nschickst, wirst du mich gut gefahren haben. Allein nichts dergleichen\ngeschah. Sogar Gesellschaft stellte sich ein, ein Boot mit\nmusikalischen Wegelagerern, Maennern und Weibern, die zur Guitarre,\nzur Mandoline sangen, aufdringlich Bord an Bord mit der Gondel fuhren\nund die Stille ueber den Wassern mit ihrer gewinnsuechtigen\nFremdenpoesie erfuellten. Aschenbach warf Geld in den hingehaltenen\nHut. Sie schwiegen dann und fuhren davon. Und das Fluestern des\nGondoliers war wieder wahrnehmbar, der stossweise und abgerissen mit\nsich selber sprach.\n\nSo kam man denn an, geschaukelt vom Kielwasser eines zur Stadt\nfahrenden Dampfers. Zwei Munizipalbeamte, die Haende auf dem Ruecken,\ndie Gesichter der Lagune zugewandt, gingen am Ufer auf und ab.\nAschenbach verliess am Stege die Gondel, unterstuetzt von jenem Alten,\nder an jedem Landungsplatze Venedigs mit seinem Enterhaken zur Stelle\nist; und da es ihm an kleinerem Gelde fehlte, ging er hinueber in das\nder Dampferbruecke benachbarte Hotel, um dort zu wechseln und den\nRuderer nach Gutduenken abzulohnen. Er wird in der Halle bedient, er\nkehrt zurueck, er findet sein Reisegut auf einem Karren am Quai, und\nGondel und Gondolier sind verschwunden.\n\n--Er hat sich fortgemacht, sagte der Alte mit dem Enterhaken. Ein\nschlechter Mann, ein Mann ohne Konzession, gnaediger Herr. Er ist der\neinzige Gondolier, der keine Konzession besitzt. Die andern haben\nhierher telephoniert. Er sah, dass er erwartet wurde. Da hat er sich\nfortgemacht.\n\nAschenbach zuckte die Achseln.\n\n--Der Herr ist umsonst gefahren, sagte der Alte und hielt den Hut hin.\nAschenbach warf Muenzen hinein. Er gab Weisung, sein Gepaeck ins\nBaeder-Hotel zu bringen, und folgte dem Karren durch die Allee, die\nweissbluehende Allee, welche, Tavernen, Bazare, Pensionen zu beiden\nSeiten, quer ueber die Insel zum Strande laeuft.\n\nEr betrat das weitlaeufige Hotel von hinten, von der Gartenterrasse aus\nund begab sich durch die grosse Halle und die Vorhalle ins Office. Da\ner angemeldet war, wurde er mit dienstfertigem Einverstaendnis\nempfangen. Ein Manager, ein kleiner, leiser, schmeichelnd hoeflicher\nMann mit schwarzem Schnurrbart und in franzoesisch geschnittenem\nGehrock, begleitete ihn im Lift zum zweiten Stockwerk hinauf und wies\nihm sein Zimmer an, einen angenehmen, in Kirschholz moeblierten Raum,\nden man mit starkduftenden Blumen geschmueckt hatte und dessen hohe\nFenster die Aussicht aufs offene Meer gewaehrten. Er trat an eines\ndavon, nachdem der Angestellte sich zurueckgezogen, und waehrend man\nhinter ihm sein Gepaeck hereinschaffte und im Zimmer unterbrachte,\nblickte er hinaus auf den nachmittaeglich menschenarmen Strand und die\nunbesonnte See, die Flutzeit hatte und niedrige, gestreckte Wellen in\nruhigem Gleichtakt gegen das Ufer sandte.\n\nDie Beobachtungen und Begegnisse des Einsam-Stummen sind zugleich\nverschwommener und eindringlicher als die des Geselligen, seine\nGedanken schwerer, wunderlicher und nie ohne einen Anflug von\nTraurigkeit. Bilder und Wahrnehmungen, die mit einem Blick, einem\nLachen, einem Urteilsaustausch leichthin abzutun waeren, beschaeftigen\nihn ueber Gebuehr, vertiefen sich im Schweigen, werden bedeutsam,\nErlebnis, Abenteuer, Gefuehl. Einsamkeit zeitigt das Originale, das\ngewagt und befremdend Schoene, das Gedicht. Einsamkeit zeitigt aber\nauch das Verkehrte, das Unverhaeltnismaessige, das Absurde und\nUnerlaubte.--So beunruhigten die Erscheinungen der Herreise, der\ngraessliche alte Stutzer mit seinem Gefasel vom Liebchen, der verpoente,\num seinen Lohn geprellte Gondolier, noch jetzt das Gemuet des\nReisenden. Ohne der Vernunft Schwierigkeiten zu bieten, ohne\neigentlich Stoff zum Nachdenken zu geben, waren sie dennoch\ngrundsonderbar von Natur, wie es ihm schien, und beunruhigend wohl\neben durch diesen Widerspruch. Dazwischen gruesste er das Meer mit den\nAugen und empfand Freude, Venedig in so leicht erreichbarer Nahe zu\nwissen. Er wandte sich endlich, badete sein Gesicht, traf gegen das\nZimmermaedchen einige Anordnungen zur Vervollstaendigung seiner\nBequemlichkeit und liess sich von dem gruen gekleideten Schweizer, der\nden Lift bediente, ins Erdgeschoss hinunterfahren.\n\nEr nahm seinen Tee auf der Terrasse der Seeseite, stieg dann hinab und\nverfolgte den Promenaden-Quai eine gute Strecke in der Richtung auf\ndas Hotel Excelsior. Als er zurueckkehrte, schien es schon an der\nZeit, sich zur Abendmahlzeit umzukleiden. Er tat es langsam und genau,\nnach seiner Art, da er bei der Toilette zu arbeiten gewoehnt war, und\nfand sich trotzdem ein wenig verfrueht in der Halle ein, wo er einen\ngrossen Teil der Hotelgaeste, fremd untereinander und in gespielter\ngegenseitiger Teilnahmslosigkeit, aber in der gemeinsamen Erwartung\ndes Essens, versammelt fand. Er nahm eine Zeitung vom Tische, liess\nsich in einen Ledersessel nieder und betrachtete die Gesellschaft, die\nsich von derjenigen seines ersten Aufenthaltes in einer ihm angenehmen\nWeise unterschied.\n\nEin weiter, duldsam vieles umfassender Horizont tat sich auf.\nGedaempft, vermischten sich die Laute der grossen Sprachen. Der\nweltgueltige Abendanzug, eine Uniform der Gesittung, fasste aeusserlich\ndie Spielarten des Menschlichen zu anstaendiger Einheit zusammen. Man\nsah die trockene und lange Miene des Amerikaners, die vielgliedrige\nrussische Familie, englische Damen, deutsche Kinder mit franzoesischen\nBonnen. Der slavische Bestandteil schien vorzuherrschen. Gleich in der\nNaehe ward polnisch gesprochen.\n\nEs war eine Gruppe halb und kaum Erwachsener, unter der Obhut einer\nErzieherin oder Gesellschafterin um ein Rohrtischchen versammelt: drei\njunge Maedchen, fuenfzehn-bis siebzehnjaehrig, wie es schien, und ein\nlanghaariger Knabe von vielleicht vierzehn Jahren. Mit Erstaunen\nbemerkte Aschenbach, dass der Knabe vollkommen schoen war. Sein\nAntlitz,--bleich und anmutig verschlossen, von honigfarbenem Haar\numringelt, mit der gerade abfallenden Nase, dem lieblichen Munde, dem\nAusdruck von holdem und goettlichem Ernst, erinnerte an griechische\nBildwerke aus edelster Zeit, und bei reinster Vollendung der Form war\nes von so einmalig-persoenlichem Reiz, dass der Schauende weder in Natur\nnoch bildender Kunst etwas aehnlich Gegluecktes angetroffen zu haben\nglaubte. Was ferner auffiel, war ein offenbar grundsaetzlicher Kontrast\nzwischen den erzieherischen Gesichtspunkten, nach denen die\nGeschwister gekleidet und allgemein gehalten schienen. Die Herrichtung\nder drei Maedchen, von denen die Aelteste fuer erwachsen gelten konnte,\nwar bis zum Entstellenden herb und keusch. Eine gleichmaessig\nkloesterliche Tracht, schieferfarben, halblang, nuechtern und gewollt\nunkleidsam von Schnitt, mit weissen Fallkraegen als einziger Aufhellung,\nunterdrueckte und verhinderte jede Gefaelligkeit der Gestalt. Das glatt\nund fest an den Kopf geklebte Haar liess die Gesichter nonnenhaft leer\nund nichtssagend erscheinen. Gewiss, es war eine Mutter, die hier\nwaltete, und sie dachte nicht einmal daran, auch auf den Knaben die\npaedagogische Strenge anzuwenden, die ihr den Maedchen gegenueber geboten\nschien. Weichheit und Zaertlichkeit bestimmten ersichtlich seine\nExistenz. Man hatte sich gehuetet, die Scheere an sein schoenes Haar zu\nlegen; wie beim Dornauszieher lockte es sich in die Stirn, ueber die\nOhren und tiefer noch in den Nacken. Ein englisches Matrosenkostuem,\ndessen bauschige Aermel sich nach unten verengerten und die feinen\nGelenke seiner noch kindlichen, aber schmalen Haende knapp umspannten,\nverlieh mit seinen Schnueren, Maschen und Stickereien der zarten\nGestalt etwas Reiches und Verwoehntes. Er sass, im Halbprofil gegen den\nBetrachtenden, einen Fuss im schwarzen Lackschuh vor den andern\ngestellt, einen Ellenbogen auf die Armlehne seines Korbsessels\ngestuetzt, die Wange an die geschlossene Hand geschmiegt, in einer\nHaltung von laessigem Anstand und ganz ohne die fast untergeordnete\nSteifheit, an die seine weiblichen Geschwister gewoehnt schienen. War\ner leidend? Denn die Haut seines Gesichtes stach weiss wie Elfenbein\ngegen das goldige Dunkel der umrahmenden Locken ab. Oder war er\neinfach ein verzaerteltes Vorzugskind, von parteilicher und launischer\nLiebe getragen? Aschenbach war geneigt, dies zu glauben. Fast jedem\nKuenstlernaturell ist ein ueppiger und verraeterischer Hang eingeboren,\nSchoenheit schaffende Ungerechtigkeit anzuerkennen und aristokratischer\nBevorzugung Teilnahme und Huldigung entgegenzubringen.\n\nEin Kellner ging umher und meldete auf englisch, dass die Mahlzeit\nbereit sei. Allmaehlich verlor sich die Gesellschaft durch die Glastuer\nin den Speisesaal. Nachzuegler, vom Vestibuel, von den Lifts kommend,\ngingen vorueber. Man hatte drinnen zu servieren begonnen, aber die\njungen Polen verharrten noch um ihr Rohrtischchen, und Aschenbach, in\ntiefem Sessel behaglich aufgehoben und uebrigens das Schoene vor Augen,\nwartete mit ihnen.\n\nDie Gouvernante, eine kleine und korpulente Halbdame mit rotem\nGesicht, gab endlich das Zeichen, sich zu erheben. Mit hochgezogenen\nBrauen schob sie ihren Stuhl zurueck und verneigte sich, als eine grosse\nFrau, grau-weiss gekleidet und sehr reich mit Perlen geschmueckt, die\nHalle betrat. Die Haltung dieser Frau war kuehl und gemessen, die\nAnordnung ihres leicht gepuderten Haares sowohl wie die Machart ihres\nKleides von jener Einfachheit, die ueberall da den Geschmack bestimmt,\nwo Froemmigkeit als Bestandteil der Vornehmheit gilt. Sie haette die\nFrau eines hohen deutschen Beamten sein koennen. Etwas von\nphantastischem Aufwand kam in ihre Erscheinung einzig durch ihren\nSchmuck, der in der Tat kaum schaetzbar war und aus Ohrgehaengen, sowie\neiner dreifachen, sehr langen Kette kirschengrosser, mild schimmernder\nPerlen bestand.\n\nDie Geschwister waren rasch aufgestanden. Sie beugten sich zum Kuss\nueber die Hand ihrer Mutter, die mit einem zurueckhaltenden Laecheln\nihres gepflegten, doch etwas mueden und spitznaesigen Gesichtes ueber\nihre Koepfe hinwegblickte und einige Worte in franzoesischer Sprache an\ndie Erzieherin richtete. Dann schritt sie zur Glastuer. Die Geschwister\nfolgten ihr: die Maedchen in der Reihenfolge ihres Alters, nach ihnen\ndie Gouvernante, zuletzt der Knabe. Aus irgend einem Grunde wandte er\nsich um, bevor er die Schwelle ueberschritt, und da niemand sonst mehr\nin der Halle sich aufhielt, begegneten seine eigentuemlich daemmergrauen\nAugen denen Aschenbachs, der, seine Zeitung auf den Knien, in\nAnschauung versunken, der Gruppe nachblickte.\n\nWas er gesehen, war gewiss in keiner Einzelheit auffallend gewesen. Man\nwar nicht vor der Mutter zu Tische gegangen, man hatte sie erwartet,\nsie ehrerbietig begruesst und beim Eintritt in den Saal gebraeuchliche\nFormen beobachtet. Allein das alles hatte sich so ausdruecklich, mit\neinem solchen Akzent von Zucht, Verpflichtung und Selbstachtung\ndargestellt, dass Aschenbach sich sonderbar ergriffen fuehlte. Er\nzoegerte noch einige Augenblicke, ging dann auch seinerseits in den\nSpeisesaal hinueber und liess sich sein Tischchen anweisen, das, wie er\nmit einer kurzen Regung des Bedauerns feststellte, sehr weit von dem\nder polnischen Familie entfernt war.\n\nMuede und dennoch geistig bewegt, unterhielt er sich waehrend der\nlangwierigen Mahlzeit mit abstrakten, ja transzendenten Dingen, sann\nnach ueber die geheimnisvolle Verbindung, welche das Gesetzmaessige mit\ndem Individuellen eingehen muesse, damit menschliche Schoenheit\nentstehe, kam von da aus auf allgemeine Probleme der Form und der\nKunst und fand am Ende, dass seine Gedanken und Funde gewissen\nscheinbar gluecklichen Einfluesterungen des Traumes glichen, die sich\nbei ernuechtertem Sinn als vollstaendig schal und untauglich erweisen.\nEr hielt sich nach Tische rauchend, sitzend, umherwandelnd, in dem\nabendlich duftenden Parke auf, ging zeitig zur Ruhe und verbrachte die\nNacht in anhaltend tiefem, aber von Traumbildern verschiedentlich\nbelebtem Schlaf.\n\nDas Wetter liess sich am folgenden Tage nicht guenstiger an. Landwind\nging. Unter fahlem, bedecktem Himmel lag das Meer in stumpfer Ruhe,\nverschrumpft gleichsam, mit nuechtern nahem Horizont und so weit vom\nStrande zurueckgetreten, dass es mehrere Reihen langer Sandbaenke\nfreiliess. Als Aschenbach sein Fenster oeffnete, glaubte er den fauligen\nGeruch der Lagune zu spueren.\n\nVerstimmung befiel ihn. Schon in diesem Augenblick dachte er an\nAbreise. Einmal, vor Jahren, hatte nach zwei heiteren Fruehlingswochen\nhier dies Wetter ihn heimgesucht und sein Befinden so schwer\ngeschaedigt, dass er Venedig wie ein Fliehender hatte verlassen muessen.\nStellte nicht schon wieder die fiebrige Unlust von damals, der Druck\nin den Schlaefen, die Schwere der Augenlider sich ein? Noch einmal den\nAufenthalt zu wechseln wuerde laestig sein; wenn aber der Wind nicht\numschlug, so war seines Bleibens hier nicht. Er packte zur Sicherheit\nnicht voellig aus. Um neun Uhr fruehstueckte er in dem hierfuer\nvorbehaltenen Buefettzimmer zwischen Halle und Speisesaal.\n\nIn dem Raum herrschte die feierliche Stille, die zum Ehrgeiz der\ngrossen Hotels gehoert. Die bedienenden Kellner gingen auf leisen Sohlen\numher. Ein Klappern des Teegeraetes, ein halbgefluestertes Wort war\nalles, was man vernahm. In einem Winkel, schraeg gegenueber der Tuer und\nzwei Tische von seinem entfernt, bemerkte Aschenbach die polnischen\nMaedchen mit ihrer Erzieherin. Sehr aufrecht, das aschblonde Haar neu\ngeglaettet und mit geroeteten Augen, in steifen blauleinenen Kleidern\nmit kleinen weissen Fallkraegen und Manschetten sassen sie da und\nreichten einander ein Glas mit Eingemachtem. Sie waren mit ihrem\nFruehstueck fast fertig. Der Knabe fehlte.\n\nAschenbach laechelte. Nun kleiner Phaeake! dachte er. Du scheinst vor\ndiesen das Vorrecht beliebigen Ausschlafens zu geniessen. Und ploetzlich\naufgeheitert rezitierte er bei sich selbst den Vers:\n\n\"Oft veraenderten Schmuck und warme Baeder und Ruhe.\"\n\nEr fruehstueckte ohne Eile, empfing aus der Hand des Portiers, der mit\ngezogener Tressenmuetze in den Saal kam, einige nachgesandte Post und\noeffnete, eine Zigarette rauchend, ein paar Briefe. So geschah es, dass\ner dem Eintritt des Langschlaefers noch beiwohnte, den man dort drueben\nerwartete.\n\nEr kam durch die Glastuer und ging in der Stille schraeg durch den Raum\nzum Tisch seiner Schwestern. Sein Gehen war sowohl in der Haltung des\nOberkoerpers wie in der Bewegung der Kniee, dem Aufsetzen des\nweissbeschuhten Fusses von ausserordentlicher Anmut, sehr leicht,\nzugleich zart und stolz und verschoent noch durch die kindliche\nVerschaemtheit, in welcher er zweimal unterwegs, mit einer Kopfwendung\nin den Saal, die Augen aufschlug und senkte. Laechelnd, mit einem\nhalblauten Wort in seiner weich verschwommenen Sprache nahm er seinen\nPlatz ein, und jetzt zumal, da er dem Schauenden sein genaues Profil\nzuwandte, erstaunte dieser aufs neue, ja erschrak ueber die wahrhaft\ngottaehnliche Schoenheit des Menschenkindes. Der Knabe trug heute einen\nleichten Blusenanzug aus blau und weiss gestreiftem Waschstoff mit\nrotseidener Masche auf der Brust und am Halse von einem einfachen\nweissen Stehkragen abgeschlossen. Auf diesem Kragen aber, der nicht\neinmal sonderlich elegant zum Charakter des Anzugs passen wollte,\nruhte die Bluete des Hauptes in unvergleichlichem Liebreiz,--das Haupt\ndes Eros, vom gelblichen Schmelze parischen Marmors, mit feinen und\nernsten Brauen, Schlaefen und Ohr vom rechtwinklig einspringenden\nGeringel des Haares dunkel und weich bedeckt.\n\nGut, gut, dachte Aschenbach mit jener fachmaennisch kuehlen Billigung,\nin welche Kuenstler zuweilen einem Meisterwerk gegenueber ihr Entzuecken,\nihre Hingerissenheit kleiden. Und weiter dachte er: Wahrhaftig,\nerwarteten mich nicht Meer und Strand, ich bliebe hier, so lange du\nbleibst! So aber ging er denn, ging unter den Aufmerksamkeiten des\nPersonals durch die Halle, die grosse Terrasse hinab und gerade aus\nueber den Brettersteg zum abgesperrten Strand der Hotelgaeste. Er liess\nsich von dem barfuessigen Alten, der sich in Leinwandhose, Matrosenbluse\nund Strohhut dort unten als Bademeister taetig zeigte, die gemietete\nStrandhuette zuweisen, liess Tisch und Sessel hinaus auf die sandig\nbretterne Plattform stellen und machte sich's bequem in dem\nLiegestuhl, den er weiter zum Meere hin in den wachsgelben Sand\ngezogen hatte.\n\nDas Strandbild, dieser Anblick sorglos sinnlich geniessender Kultur am\nRande des Elementes, unterhielt und erfreute ihn wie nur je. Schon war\ndie graue und flache See belebt von watenden Kindern, Schwimmern,\nbunten Gestalten, welche, die Arme unter dem Kopf verschraenkt, auf den\nSandbaenken lagen. Andere ruderten in kleinen rot und blau gestrichenen\nBooten ohne Kiel und kenterten lachend. Vor der gedehnten Zeile der\nCapannen, auf deren Plattformen man wie auf kleinen Veranden sass, gab\nes spielende Bewegung und traeg hingestreckte Ruhe, Besuche und\nGeplauder, sorgfaeltige Morgeneleganz neben der Nacktheit, die\nkeck-behaglich die Freiheiten des Ortes genoss. Vorn auf dem feuchten\nund festen Sande lustwandelten Einzelne in weissen Bademaenteln, in\nweiten, starkfarbigen Hemdgewaendern. Eine vielfaeltige Sandburg zur\nRechten, von Kindern hergestellt, war rings mit kleinen Flaggen in den\nFarben aller Laender besteckt. Verkaeufer von Muscheln, Kuchen und\nFruechten breiteten kniend ihre Waren aus. Links, vor einer der Huetten,\ndie quer zur Reihe der uebrigen und zum Meere standen und auf dieser\nSeite einen Abschluss des Strandes bildeten, kampierte eine russische\nFamilie: Maenner mit Baerten und grossen Zaehnen, muerbe und traege Frauen,\nein baltisches Fraeulein, das an einer Staffelei sitzend unter Ausrufen\nder Verzweiflung das Meer malte, zwei gutmuetig-haessliche Kinder, eine\nalte Magd im Kopftuch und mit zaertlich unterwuerfigen Sklavenmanieren.\nDankbar geniessend lebten sie dort, riefen unermuedlich die Namen der\nunfolgsam sich tummelnden Kinder, scherzten vermittelst weniger\nitalienischer Worte lange mit dem humoristischen Alten, von dem sie\nZuckerwerk kauften, kuessten einander auf die Wangen und kuemmerten sich\num keinen Beobachter ihrer menschlichen Gemeinschaft.\n\nIch will also bleiben, dachte Aschenbach. Wo waere es besser? Und die\nHaende im Schoss gefaltet, liess er seine Augen sich in den Weiten des\nMeeres verlieren, seinen Blick entgleiten, verschwimmen, sich brechen\nim eintoenigen Dunst der Raumeswueste. Er liebte das Meer aus tiefen\nGruenden: aus dem Ruheverlangen des schwer arbeitenden Kuenstlers, der\nvon der anspruchsvollen Vielgestalt der Erscheinungen an der Brust des\nEinfachen, Ungeheueren sich zu bergen begehrt; aus einem verbotenen,\nseiner Aufgabe gerade entgegengesetzten und eben darum verfuehrerischen\nHange zum Ungegliederten, Masslosen, Ewigen, zum Nichts. Am\nVollkommenen zu ruhen, ist die Sehnsucht dessen, der sich um das\nVortreffliche mueht; und ist nicht das Nichts eine Form des\nVollkommenen? Wie er nun aber so tief ins Leere traeumte, ward\nploetzlich die Horizontale des Ufersaumes von einer menschlichen\nGestalt ueberschnitten, und als er seinen Blick aus dem Unbegrenzten\neinholte und sammelte, da war es der schoene Knabe, der von links\nkommend vor ihm im Sande vorueberging. Er ging barfuss, zum Waten\nbereit, die schlanken Beine bis ueber die Knie entbloesst, langsam, aber\nso leicht und stolz, als sei er ohne Schuhwerk sich zu bewegen ganz\ngewoehnt, und schaute sich nach den querstehenden Huetten um. Kaum aber\nhatte er die russische Familie bemerkt, die dort in dankbarer\nEintracht ihr Wesen trieb, als ein Unwetter zorniger Verachtung sein\nGesicht ueberzog. Seine Stirn verfinsterte sich, sein Mund ward\nemporgehoben, von den Lippen nach einer Seite ging ein erbittertes\nZerren, dass die Wange zerriss, und seine Brauen waren so schwer\ngerunzelt, dass unter ihrem Druck die Augen eingesunken schienen und\nboese und dunkel darunter hervor die Sprache des Hasses fuehrten. Er\nblickte zu Boden, blickte noch einmal drohend zurueck, tat dann mit der\nSchulter eine heftig wegwerfende Bewegung und liess die Feinde im\nRuecken.\n\nEine Art Zartgefuehl oder Erschrockenheit, etwas wie Achtung und Scham,\nveranlasste Aschenbach, sich abzuwenden, als ob er nichts gesehen\nhaette; denn dem ernsten Zufallsbeobachter der Leidenschaft widerstrebt\nes, von seinen Wahrnehmungen auch nur vor sich selber Gebrauch zu\nmachen. Er war aber erheitert und erschuettert zugleich, das heisst:\nbeglueckt. Dieser kindische Fanatismus, gerichtet gegen das gutmuetigste\nStueck Leben,--er stellte das Goettlich-Nichtssagende in menschliche\nBeziehungen; er liess ein kostbares Bildwerk der Natur, das nur zur\nAugenweide getaugt hatte, einer tieferen Teilnahme wert erscheinen;\nund er verlieh der ohnehin durch Schoenheit bedeutenden Gestalt des\nHalbwuechsigen eine politisch-geschichtliche Folie, die gestattete, ihn\nueber seine Jahre ernst zu nehmen.\n\nNoch abgewandt, lauschte Aschenbach auf die Stimme des Knaben, seine\nhelle, ein wenig schwache Stimme, mit der er sich von weitem schon den\num die Sandburg beschaeftigten Gespielen gruessend anzukuendigen suchte.\nMan antwortete ihm, indem man ihm seinen Namen oder eine Koseform\nseines Namens mehrfach entgegenrief, und Aschenbach horchte mit einer\ngewissen Neugier darauf, ohne Genaueres erfassen zu koennen, als zwei\nmelodische Silben wie \"Adgio\" oder oefter noch \"Adgiu\" mit rufend\ngedehntem u-Laut am Ende. Er freute sich des Klanges, er fand ihn in\nseinem Wohllaut dem Gegenstande angemessen, wiederholte ihn im Stillen\nund wandte sich befriedigt seinen Briefen und Papieren zu.\n\nSeine kleine Reiseschreibmappe auf den Knien, begann er, mit dem\nFuellfederhalter diese und jene Korrespondenz zu erledigen. Aber nach\neiner Viertelstunde schon fand er es schade, die Situation, die\ngeniessenswerteste, die er kannte, so im Geist zu verlassen und durch\ngleichgueltige Taetigkeit zu versaeumen. Er warf das Schreibzeug\nbeiseite, er kehrte zum Meere zurueck, und nicht lange, so wandte er,\nabgelenkt von den Stimmen der Jugend am Sandbau, den Kopf bequem an\nder Lehne des Stuhles nach rechts, um sich nach dem Treiben und\nBleiben des trefflichen Adgio wieder umzutun.\n\nDer erste Blick fand ihn; die rote Masche auf seiner Brust war nicht\nzu verfehlen. Mit anderen beschaeftigt, eine alte Planke als Bruecke\nueber den feuchten Graben der Sandburg zu legen, gab er rufend und mit\ndem Kopfe winkend seine Anweisungen zu diesem Werk. Es waren da mit\nihm ungefaehr zehn Genossen, Knaben und Maedchen, von seinem Alter und\neinige juenger, die in Zungen, polnisch, franzoesisch und auch in\nBalkan-Idiomen durcheinander schwatzten. Aber sein Name war es, der am\noeftesten erklang. Offenbar war er begehrt, umworben, bewundert. Einer\nnamentlich, Pole gleich ihm, ein staemmiger Bursche, der aehnlich wie\n\"Jaschu\" gerufen wurde, mit schwarzem, pomadisiertem Haar und leinenem\nGuertelanzug, schien sein naechster Vasall und Freund. Sie gingen, als\nfuer diesmal die Arbeit am Sandbau beendigt war, umschlungen den Strand\nentlang, und der, welcher \"Jaschu\" gerufen wurde, kuesste den Schoenen.\n\nAschenbach war versucht, ihm mit dem Finger zu drohen. \"Dir aber rat\nich Kritobulos\", dachte er laechelnd, \"geh ein Jahr auf Reisen! Denn\nsoviel brauchst du mindestens Zeit zur Genesung.\" Und dann fruehstueckte\ner grosse, vollreife Erdbeeren, die er von einem Haendler erstand. Es\nwar sehr warm geworden, obgleich die Sonne die Dunstschicht des\nHimmels nicht zu durchdringen vermochte. Traegheit fesselte den Geist,\nindes die Sinne die ungeheure und betaeubende Unterhaltung der\nMeeresstille genossen. Zu erraten, zu erforschen, welcher Name es sei,\nder ungefaehr \"Adgio\" lautete, schien dem ernsten Mann eine\nangemessene, vollkommen ausfuellende Aufgabe und Beschaeftigung. Und mit\nHilfe einiger polnischer Erinnerungen stellte er fest, dass \"Tadzio\"\ngemeint sein muesse, die Abkuerzung von \"Tadeusz\" und im Anrufe \"Tadziu\"\nlautend. Tadzio badete. Aschenbach, der ihn aus den Augen verloren\nhatte, entdeckte seinen Kopf, seinen Arm, mit dem er rudernd ausholte,\nweit draussen im Meer; denn das Meer mochte flach sein bis weit hinaus.\nAber schon schien man besorgt um ihn, schon riefen Frauenstimmen nach\nihm von den Huetten, stiessen wiederum diesen Namen aus, der den Strand\nbeinahe wie eine Losung beherrschte und mit seinen weichen Mitlauten,\nseinem gezogenen u-Ruf am Ende, etwas zugleich Suesses und Wildes hatte:\n\"Tadziu, Tadziu!\" Er gehorchte, er lief, das widerstrebende Wasser mit\nden Beinen zu Schaum schlagend, zurueckgeworfenen Kopfes durch die\nFlut; und zu sehen, wie die lebendige Gestalt, vormaennlich hold und\nherb, mit triefenden Locken und schoen wie ein zarter Gott, herkommend\naus den Tiefen von Himmel und Meer, dem Elemente entstieg und entrann:\nDieser Anblick gab mythische Vorstellungen ein, er war wie\nDichterkunde von anfaenglichen Zeiten, vom Ursprung der Form und von\nder Geburt der Goetter. Aschenbach lauschte mit geschlossenen Augen auf\ndiesen in seinem Innern antoenenden Gesang; und abermals dachte er, dass\nes hier gut sei und dass er bleiben wolle.\n\nSpaeter lag Tadzio, vom Bade ausruhend, im Sande, gehuellt in sein\nweisses Laken, das unter der rechten Schulter durchgezogen war, den\nKopf auf den blossen Arm gebettet; und auch wenn Aschenbach ihn nicht\nbetrachtete, sondern einige Seiten in seinem Buche las, vergass er fast\nniemals, dass jener dort lag und dass es ihn nur eine leichte Wendung\ndes Kopfes nach rechts kostete, um das Bewunderungswuerdige zu\nerblicken. Beinahe schien es ihm, als saesse er hier, um den Ruhenden zu\nbehueten,--mit eigenen Angelegenheiten beschaeftigt und dabei doch in\nbestaendiger Wachsamkeit fuer das edle Menschenbild dort zur Rechten,\nnicht weit von ihm. Und eine vaeterliche Huld, die geruehrte Hinneigung\ndessen, der sich opfernd im Geiste das Schoene zeugt, zu dem, der die\nSchoenheit hat, erfuellte und bewegte sein Herz.\n\nNach Mittag verliess er den Strand, kehrte ins Hotel zurueck und liess\nsich hinauf vor sein Zimmer fahren. Er verweilte dort drinnen laengere\nZeit vor dem Spiegel und betrachtete sein graues Haar, sein muedes und\nscharfes Gesicht. In diesem Augenblick dachte er an seinen Ruhm und\ndaran, dass Viele ihn auf den Strassen kannten und ehrerbietig\nbetrachteten, um seines sicher treffenden und mit Anmut gekroenten\nWortes willen,--rief alle, aeusseren Erfolge seines Talentes auf, die\nihm irgend einfallen wollten und gedachte sogar seiner Nobilitierung.\nEr begab sich dann zum Lunch hinab in den Saal und speiste an seinem\nTischchen. Als er nach beendeter Mahlzeit den Lift bestieg, draengte\njunges Volk, das gleichfalls vom Fruehstueck kam, ihm nach in das\nschwebende Kaemmerchen, und auch Tadzio trat ein. Er stand ganz nahe\nbei Aschenbach, zum ersten Male so nah, dass dieser ihn nicht in\nbildmaessigem Abstand, sondern genau, mit den Einzelheiten seiner\nMenschlichkeit wahrnahm und erkannte. Der Knabe ward angeredet von\nirgend jemandem, und waehrend er mit unbeschreiblich lieblichem Laecheln\nantwortete, trat er schon wieder aus, im ersten Stockwerk, rueckwaerts,\nmit niedergeschlagenen Augen. Schoenheit macht schamhaft, dachte\nAschenbach und bedachte sehr eindringlich, warum. Er hatte jedoch\nbemerkt, dass Tadzios Zaehne nicht recht erfreulich waren: etwas zackig\nund blass, ohne den Schmelz der Gesundheit und von eigentuemlich sproeder\nDurchsichtigkeit wie zuweilen bei Bleichsuechtigen. Er ist sehr zart,\ner ist kraenklich, dachte Aschenbach. Er wird wahrscheinlich nicht alt\nwerden. Und er verzichtete darauf, sich Rechenschaft ueber ein Gefuehl\nder Genugtuung oder Beruhigung zu geben, das diesen Gedanken\nbegleitete.\n\nEr verbrachte zwei Stunden auf seinem Zimmer und fuhr am Nachmittag\nmit dem Vaporetto ueber die faulriechende Lagune nach Venedig. Er stieg\naus bei San Marco, nahm den Tee auf dem Platze und trat dann, seiner\nhiesigen Tagesordnung gemaess, einen Spaziergang durch die Strassen an.\nEs war jedoch dieser Gang, der einen voelligen Umschwung seiner\nStimmung, seiner Entschluesse herbeifuehrte.\n\nEine widerliche Schwuele lag in den Gassen, die Luft war so dick, dass\ndie Gerueche, die aus Wohnungen, Laeden, Garkuechen quollen, Oeldunst,\nWolken von Parfuem und viele andere in Schwaden standen, ohne sich zu\nzerstreuen. Zigarettenrauch hing an seinem Orte und entwich nur\nlangsam. Das Menschengeschiebe in der Enge belaestigte den\nSpaziergaenger, statt ihn zu unterhalten. Je laenger er ging, desto\nquaelender bemaechtigte sich seiner der abscheuliche Zustand, den die\nSeeluft zusammen mit dem Scirocco hervorbringen kann, und der zugleich\nErregung und Erschlaffung ist. Peinlicher Schweiss brach ihm aus. Die\nAugen versagten den Dienst, die Brust war beklommen, er fieberte, das\nBlut pochte im Kopf. Er floh aus den drangvollen Geschaeftsgassen ueber\nBruecken in die Gaenge der Armen: dort behelligten ihn Bettler, und die\nueblen Ausduenstungen der Kanaele verleideten das Atmen. Auf stillem\nPlatz, einer jener vergessen und verwunschen anmutenden Oertlichkeiten,\ndie sich im Innern Venedigs finden, am Rande eines Brunnens rastend,\ntrocknete er die Stirn und sah ein, dass er reisen muesse.\n\nZum zweitenmal und nun endgueltig war es erwiesen, dass diese Stadt bei\ndieser Witterung ihm hoechst schaedlich war. Eigensinniges Ausharren\nerschien vernunftwidrig, die Aussicht auf ein Umschlagen des Windes\nganz ungewiss. Es galt rasche Entscheidung. Schon jetzt nach Hause\nzurueckzukehren, verbot sich. Weder Sommer-noch Winterquartier war\nbereit, ihn aufzunehmen. Aber nicht nur hier gab es Meer und Strand,\nund anderwaerts fanden sie sich ohne die boese Zutat der Lagune und\nihres Fieberdunstes. Er erinnerte sich eines kleinen Seebades nicht\nweit von Triest, das man ihm ruehmlich genannt hatte. Warum nicht\ndorthin? Und zwar ohne Verzug, damit der abermalige Aufenthaltswechsel\nsich noch lohne. Er erklaerte sich fuer entschlossen und stand auf. Am\nnaechsten Gondelhalteplatz nahm er ein Fahrzeug und liess sich durch das\ntruebe Labyrinth der Kanaele, unter zierlichen Marmorbalkonen hin, die\nvon Loewenbildern flankiert waren, um glitschige Mauerecken, vorbei an\ntrauernden Palastfassaden, die grosse Firmenschilder im Abfall\nschaukelnden Wasser spiegelten, nach San Marco leiten. Er hatte Muehe,\ndorthin zu gelangen, denn der Gondolier, der mit Spitzenfabriken und\nGlasblaesereien im Bunde stand, versuchte ueberall, ihn zu Besichtigung\nund Einkauf abzusetzen, und wenn die bizarre Fahrt durch Venedig\nihren Zauber zu ueben begann, so tat der beutelschneiderische\nGeschaeftsgeist der gesunkenen Koenigin das seine, den Sinn wieder\nverdriesslich zu ernuechtern.\n\nIns Hotel zurueckgekehrt, gab er noch vor dem Diner im Bureau die\nErklaerung ab, dass unvorhergesehene Umstaende ihn noetigten, morgen frueh\nabzureisen. Man bedauerte, man quittierte seine Rechnung. Er speiste\nund verbrachte den lauen Abend, Journale lesend, in einem\nSchaukelstuhl auf der rueckwaertigen Terrasse. Bevor er zur Ruhe ging,\nmachte er sein Gepaeck vollkommen zur Abreise fertig.\n\nEr schlief nicht zum besten, da der bevorstehende Wiederaufbruch ihn\nbeunruhigte. Als er am Morgen die Fenster oeffnete, war der Himmel\nbezogen nach wie vor, aber die Luft schien frischer, und--es begann\nauch schon seine Reue. War diese Kuendigung nicht ueberstuerzt und\nirrtuemlich, die Handlung eines kranken und unmassgeblichen Zustandes\ngewesen? Haette er sie ein wenig zurueckbehalten, haette er es, ohne so\nrasch zu verzagen, auf den Versuch einer Anpassung an die\nvenezianische Luft oder auf Besserung des Wetters ankommen lassen, so\nstand ihm jetzt, statt Hast und Last, ein Vormittag am Strande gleich\ndem gestrigen bevor. Zu spaet. Nun musste er fortfahren, zu wollen, was\ner gestern gewollt hatte. Er kleidete sich an und fuhr um acht Uhr zum\nFruehstueck ins Erdgeschoss hinab.\n\nDer Buefettraum war, als er eintrat, noch leer von Gaesten. Einzelne\nkamen, waehrend er sass und das Bestellte erwartete. Die Teetasse am\nMunde, sah er die polnischen Maedchen nebst ihrer Begleiterin sich\neinfinden; streng und morgenfrisch, mit geroeteten Augen schritten sie\nzu ihrem Tisch in der Fensterecke. Gleich darauf naeherte sich ihm der\nPortier mit gezogener Muetze und mahnte zum Aufbruch. Das Automobil\nstehe bereit, ihn und andere Reisende nach dem Hotel \"Excelsior\" zu\nbringen, von wo das Motorboot die Herrschaften durch den Privatkanal\nder Gesellschaft zum Bahnhof befoerdern werde. Die Zeit draenge.\n--Aschenbach fand, dass sie das nicht im mindesten tue. Mehr als eine\nStunde blieb bis zur Abfahrt seines Zuges. Er aergerte sich an der\nGasthofsitte, den Abreisenden vorzeitig aus dem Hause zu schaffen und\nbedeutete dem Portier, dass er in Ruhe zu fruehstuecken wuensche. Der Mann\nzog sich zoegernd zurueck, um nach fuenf Minuten wieder aufzutreten.\nUnmoeglich, dass der Wagen laenger warte. Dann moege er fahren und seinen\nKoffer mitnehmen, entgegnete Aschenbach gereizt. Er selbst wolle zur\ngegebenen Zeit das oeffentliche Dampfboot benutzen und bitte, die Sorge\num sein Fortkommen ihm selber zu ueberlassen. Der Angestellte verbeugte\nsich. Aschenbach, froh, die laestigen Mahnungen abgewehrt zu haben,\nbeendete seinen Imbiss ohne Eile, ja liess sich sogar noch vom Kellner\nTagesblaetter reichen. Die Zeit war recht knapp geworden, als er\naufstand. Es fuegte sich, dass im selben Augenblick Tadzio durch die\nGlastuer hereinkam.\n\nEr kreuzte, zum Tische der Seinen gehend, den Weg des Aufbrechenden,\nschlug vor dem grauhaarigen, hochgestirnten Mann bescheiden die Augen\nnieder, um sie nach seiner lieblichen Art sogleich wieder weich und\nvoll zu ihm aufzuschlagen und war vorueber. Adieu, Tadzio! dachte\nAschenbach. Ich sah dich kurz. Und indem er gegen seine Gewohnheit das\nGedachte wirklich mit den Lippen ausbildete und vor sich hinsprach,\nfuegte er hinzu: Sei gesegnet!--Er hielt dann Abreise, verteilte\nTrinkgelder, ward von dem kleinen leisen Manager im franzoesischen\nGehrock verabschiedet und verliess das Hotel zu Fuss, wie er gekommen,\num sich, gefolgt von dem Handgepaeck tragenden Hausdiener, durch die\nweiss bluehende Allee quer ueber die Insel zur Dampferbruecke zu begeben.\nEr erreicht sie, er nimmt Platz,--und was folgte, war eine\nLeidensfahrt, kummervoll, durch alle Tiefen der Reue.\n\nEs war die vertraute Fahrt ueber die Lagune, an San Marco vorbei, den\ngrossen Kanal hinauf. Aschenbach sass auf der Rundbank am Buge, den Arm\naufs Gelaender gestuetzt, mit der Hand die Augen beschattend. Die\noeffentlichen Gaerten blieben zurueck, die Piazzetta eroeffnete sich noch\neinmal in fuerstlicher Anmut und ward verlassen, es kam die grosse\nFlucht der Palaeste, und als die Wasserstrasse sich wendete, erschien\ndes Rialto praechtig gespannter Marmorbogen. Der Abschiednehmende\nschaute, und seine Brust war zerrissen. Die Atmosphaere der Stadt,\ndiesen leis fauligen Geruch von Meer und Sumpf, den zu fliehen es ihn\nso sehr gedraengt hatte,--er atmete ihn jetzt in tiefen, zaertlich\nschmerzlichen Zuegen. War es moeglich, dass er nicht gewusst, nicht\nbedacht hatte, wie sehr sein Herz an dem allen hing? Was heute morgen\nein halbes Bedauern, ein leiser Zweifel an der Richtigkeit seines Tuns\ngewesen war, das wurde jetzt zum Harm, zum wirklichen Weh, zu einer\nSeelennot, so bitter, dass sie ihm mehrmals Traenen in die Augen trieb,\nund von der er sich sagte, dass er sie unmoeglich habe vorhersehen\nkoennen. Was er als so schwer ertraeglich, ja, zuweilen als voellig\nunleidlich empfand, war offenbar der Gedanke, dass er Venedig nie\nwieder sehen solle, dass dies ein Abschied fuer immer sei. Denn da sich\nzum zweiten Male gezeigt hatte, dass die Stadt ihn krank mache, da er\nsie zum zweiten Male jaeh zu verlassen gezwungen war, so hatte er sie\nja fortan als einen ihm unmoeglichen und verbotenen Aufenthalt zu\nbetrachten, dem er nicht gewachsen war und den wieder aufzusuchen\nsinnlos gewesen waere. Ja, er empfand, dass, wenn er jetzt abreise,\nScham und Trotz ihn hindern muessten, die geliebte Stadt je wieder zu\nsehen, der gegenueber er zweimal koerperlich versagt hatte; und dieser\nStreitfall zwischen seelischer Neigung und koerperlichem Vermoegen\nschien dem Alternden auf einmal so schwer und wichtig, die physische\nNiederlage so schmaehlich, so um jeden Preis hintanzuhalten, dass er die\nleichtfertige Ergebung nicht begriff, mit welcher er gestern, ohne\nernstlichen Kampf, sie zu tragen und anzuerkennen beschlossen hatte.\n\nUnterdessen naehert sich das Dampfboot dem Bahnhof, und Schmerz\nund Ratlosigkeit steigen bis zur Verwirrung. Die Abreise duenkt dem\nGequaelten unmoeglich, die Umkehr nicht minder. So ganz zerrissen\nbetritt er die Station. Es ist sehr spaet, er hat keinen Augenblick zu\nverlieren, wenn er den Zug erreichen will. Er will es und will es\nnicht. Aber die Zeit draengt, sie geisselt ihn vorwaerts; er eilt, sich\nsein Billett zu verschaffen und sieht sich im Tumult der Halle nach\ndem hier stationierten Beamten der Hotelgesellschaft um. Der Mensch\nzeigt sich und meldet, der grosse Koffer sei aufgegeben. Schon\naufgegeben? Ja, bestens,--nach Como. Nach Como? Und aus einem\nhastigen Hin und Her, aus zornigen Fragen und betretenen Antworten\nkommt zu Tage, dass der Koffer, schon im Gepaeckbefoerderungs-Amt des\nHotels \"Excelsior\" zusammen mit anderer, fremder Bagage, in voellig\nfalsche Richtung geleitet wurde.\n\nAschenbach hatte Muehe, die Miene zu bewahren, die unter diesen\nUmstaenden einzig begreiflich war. Eine abenteuerliche Freude, eine\nunglaubliche Heiterkeit erschuetterte von innen fast krampfhaft seine\nBrust. Der Angestellte stuerzte davon, um moeglicherweise den Koffer\nnoch anzuhalten und kehrte, wie zu erwarten gewesen, unverrichteter\nDinge zurueck. Da erklaerte denn Aschenbach, dass er ohne sein Gepaeck\nnicht zu reisen wuensche, sondern umzukehren und das Wiedereintreffen\ndes Stueckes im Baederhotel zu erwarten entschlossen sei. Ob das\nMotorboot der Gesellschaft am Bahnhof liege. Der Mann beteuerte,\nes liege vor der Tuer. Er bestimmte in italienischer Suade den\nSchalterbeamten, den geloesten Fahrschein zurueckzunehmen, er schwor,\ndass depeschiert werden, dass nichts gespart und versaeumt werden solle,\num den Koffer in Baelde zurueckzugewinnen, und--so fand das Seltsame\nstatt, dass der Reisende, zwanzig Minuten nach seiner Ankunft am\nBahnhof, sich wieder im Grossen Kanal auf dem Rueckweg zum Lido sah.\n\nWunderlich unglaubhaftes, beschaemendes, komisch traumartiges\nAbenteuer: Staetten, von denen man eben in tiefster Wehmut Abschied auf\nimmer genommen, vom Schicksal umgewandt und zurueckverschlagen, in\nderselben Stunde noch wiederzusehen! Schaum vor dem Buge, drollig\nbehend zwischen Gondeln und Dampfern lavierend, schoss das kleine,\neilfertige Fahrzeug seinem Ziele zu, indes sein Passagier unter der\nMaske aergerlicher Resignation die aengstlich-uebermuetige Erregung eines\nentlaufenen Knaben verbarg. Noch immer, von Zeit zu Zeit, ward seine\nBrust bewegt von Lachen ueber dies Missgeschick, das, wie er sich sagte,\nein Sonntagskind nicht gefaelliger haette heimsuchen koennen. Es waren\nErklaerungen zu geben, erstaunte Gesichter zu bestehen,--dann war, so\nsagte er sich, alles wieder gut, dann war ein Unglueck verhuetet, ein\nschwerer Irrtum richtig gestellt, und alles, was er im Ruecken zu\nlassen geglaubt hatte, eroeffnete sich ihm wieder, war auf beliebige\nZeit wieder sein... Taeuschte ihn uebrigens die rasche Fahrt oder kam\nwirklich zum Ueberfluss der Wind nun dennoch vom Meere her?\n\nDie Wellen schlugen gegen die betonierten Waende des schmalen Kanals,\nder durch die Insel zum Hotel \"Excelsior\" gelegt ist. Ein automobiler\nOmnibus erwartete dort den Wiederkehrenden und fuehrte ihn oberhalb des\ngekraeuselten Meeres auf geradem Wege zum Baeder-Hotel. Der kleine\nschnurrbaertige Manager im geschweiften Gehrock kam zur Begruessung die\nFreitreppe herab.\n\nLeise schmeichelnd bedauerte er den Zwischenfall, nannte ihn aeusserst\npeinlich fuer ihn und das Institut, billigte aber mit Ueberzeugung\nAschenbachs Entschluss, das Gepaeckstueck hier zu erwarten. Freilich sei\nsein Zimmer vergeben, ein anderes jedoch, nicht schlechter, sogleich\nzur Verfuegung. \"Pas de chance, monsieur\", sagte der schweizerische\nLiftfuehrer laechelnd, als man hinaufglitt. Und so wurde der Fluechtling\nwieder einquartiert, in einem Zimmer, das dem vorigen nach Lage und\nEinrichtung fast vollkommen glich.\n\nErmuedet, betaeubt von dem Wirbel dieses seltsamen Vormittags, liess er\nsich, nachdem er den Inhalt seiner Handtasche im Zimmer verteilt, in\neinem Lehnstuhl am offenen Fenster nieder. Das Meer hatte eine\nblassgruene Faerbung angenommen, die Luft schien duenner und reiner, der\nStrand mit seinen Huetten und Booten farbiger, obgleich der Himmel noch\ngrau war. Aschenbach blickte hinaus, die Haende im Schoss gefaltet,\nzufrieden, wieder hier zu sein, kopfschuettelnd unzufrieden ueber seinen\nWankelmut, seine Unkenntnis der eigenen Wuensche. So sass er wohl eine\nStunde, ruhend und gedankenlos traeumend. Um Mittag erblickte er\nTadzio, der in gestreiftem Leinenanzug mit roter Masche, vom Meere\nher, durch die Strandsperre und die Bretterwege entlang zum Hotel\nzurueckkehrte. Aschenbach erkannte ihn aus seiner Hoehe sofort, bevor er\nihn eigentlich ins Auge gefasst, und wollte etwas denken, wie: \"Sieh,\nTadzio, da bist ja auch du wieder!\" Aber im gleichen Augenblick fuehlte\ner, wie der laessige Gruss vor der Wahrheit seines Herzens hinsank und\nverstummte,--fuehlte die Begeisterung seines Blutes, die Freude, den\nSchmerz seiner Seele und erkannte, dass ihm um Tadzios willen der\nAbschied so schwer geworden war.\n\nEr sass ganz still, ganz ungesehen an seinem hohen Platze und blickte\nin sich hinein. Seine Zuege waren erwacht, seine Brauen stiegen, ein\naufmerksames, neugierig geistreiches Laecheln spannte seinen Mund. Dann\nhob er den Kopf und beschrieb mit beiden, schlaff ueber die Lehne des\nSessels hinabhaengenden Armen eine langsam drehende und hebende\nBewegung, die Handflaechen vorwaerts kehrend, so, als deute er ein\nOeffnen und Ausbreiten der Arme an. Es war eine bereitwillig willkommen\nheissende, gelassen aufnehmende Gebaerde.\n\n\n\n\nViertes Kapitel\n\n\nNun lenkte Tag fuer Tag der Gott mit den hitzigen Wangen nackend sein\ngluthauchendes Viergespann durch die Raeume des Himmels und sein gelbes\nGelock flatterte im zugleich ausstuermenden Ostwind. Weisslich seidiger\nGlanz lag auf den Weiten des traege wallenden Pontos. Der Sand gluehte.\nUnter der silbrig flirrenden Blaeue des Aethers waren rostfarbene\nSegeltuecher vor den Strandhuetten ausgespannt, und auf dem scharf\numgrenzten Schattenfleck, den sie boten, verbrachte man die\nVormittagsstunden. Aber koestlich war auch der Abend, wenn die Pflanzen\ndes Parks balsamisch dufteten, die Gestirne droben ihren Reigen\nschritten und das Murmeln des umnachteten Meeres, leise\nheraufdringend, die Seele besprach. Solch ein Abend trug in sich die\nfreudige Gewaehr eines neuen Sonnentages von leicht geordneter Musse und\ngeschmueckt mit zahllosen, dicht beieinander liegenden Moeglichkeiten\nlieblichen Zufalls.\n\nDer Gast, den ein so gefuegiges Missgeschick hier festgehalten, war weit\nentfernt, in der Rueckgewinnung seiner Habe einen Grund zu erneutem\nAufbruch zu sehen. Er hatte zwei Tage lang einige Entbehrung dulden\nund zu den Mahlzeiten im grossen Speisesaal im Reiseanzug erscheinen\nmuessen. Dann, als man endlich die verirrte Last wieder in seinem\nZimmer niedersetzte, packte er gruendlich aus und fuellte Schrank und\nSchubfaecher mit dem Seinen, entschlossen zu vorlaeufig unabsehbarem\nVerweilen, vergnuegt, die Stunden des Strandes in seidenem Anzug\nverbringen und beim Diner sich wieder in schicklicher Abendtracht an\nseinem Tischchen zeigen zu koennen.\n\nDer wohlige Gleichtakt dieses Daseins hatte ihn schon in seinen Bann\ngezogen, die weiche und glaenzende Milde dieser Lebensfuehrung ihn rasch\nberueckt. Welch ein Aufenthalt in der Tat, der die Reize eines\ngepflegten Badelebens an suedlichem Strande mit der traulich bereiten\nNaehe der wunderlich-wundersamen Stadt verbindet! Aschenbach liebte\nnicht den Genuss. Wann immer und wo es galt, zu feiern, der Ruhe zu\npflegen, sich gute Tage zu machen, verlangte ihn bald--und namentlich\nin juengeren Jahren war dies so gewesen--mit Unruhe und Widerwillen\nzurueck in die hohe Muehsal, den heilig nuechternen Dienst seines\nAlltags. Nur dieser Ort verzauberte ihn, entspannte sein Wollen,\nmachte ihn gluecklich. Manchmal vormittags, unter dem Schattentuch\nseiner Huette, hintraeumend ueber die Blaeue des Suedmeers, oder bei lauer\nNacht auch wohl, gelehnt in die Kissen der Gondel, die ihn vom\nMarkusplatz, wo er sich lange verweilt, unter dem gross gestirnten\nHimmel heimwaerts zum Lido fuehrte--und die bunten Lichter, die\nschmelzenden Klaenge der Serenade blieben zurueck,--erinnerte er sich\nseines Landsitzes in den Bergen, der Staette seines sommerlichen\nRingens, wo die Wolken tief durch den Garten zogen, fuerchterliche\nGewitter am Abend das Licht des Hauses loeschten und die Raben, die er\nfuetterte, sich in den Wipfeln der Fichten schwangen. Dann schien es\nihm wohl, als sei er entrueckt ins elysische Land, an die Grenzen der\nErde, wo leichtestes Leben den Menschen beschert ist, wo nicht Schnee\nist und Winter noch Sturm und stroemender Regen, sondern immer sanft\nkuehlenden Anhauch Okeanos aufsteigen laesst und in seliger Musse die Tage\nverrinnen, muehelos, kampflos und ganz nur der Sonne und ihren Festen\ngeweiht.\n\nViel, fast bestaendig sah Aschenbach den Knaben Tadzio; ein\nbeschraenkter Raum, eine jedem gegebene Lebensordnung brachten es mit\nsich, dass der Schoene ihm tagueber mit kurzen Unterbrechungen nahe war.\nEr sah, er traf ihn ueberall: in den unteren Raeumen des Hotels, auf den\nkuehlenden Wasserfahrten zur Stadt und von dort zurueck, im Gepraenge des\nPlatzes selbst und oft noch zwischenein auf Wegen und Stegen, wenn der\nZufall ein Uebriges tat. Hauptsaechlich aber und mit der gluecklichsten\nRegelmaessigkeit bot ihm der Vormittag am Strande ausgedehnte\nGelegenheit, der holden Erscheinung Andacht und Studium zu widmen. Ja,\ndiese Gebundenheit des Glueckes, diese taeglich-gleichmaessig wieder\nanbrechende Gunst der Umstaende war es so recht, was ihn mit\nZufriedenheit und Lebensfreude erfuellte, was ihm den Aufenthalt teuer\nmachte und einen Sonnentag so gefaellig hinhaltend sich an den anderen\nreihen liess.\n\nEr war frueh auf, wie sonst wohl bei pochendem Arbeitsdrange, und vor\nden meisten am Strand, wenn die Sonne noch milde war und das Meer weiss\nblendend in Morgentraeumen lag. Er gruesste menschenfreundlich den\nWaechter der Sperre, gruesste auch vertraulich den barfuessigen Weissbart,\nder ihm die Staette bereitet, das braune Schattentuch ausgespannt, die\nMoebel der Huette hinaus auf die Plattform gerueckt hatte, und liess sich\nnieder. Drei Stunden oder vier waren dann sein, in denen die Sonne zur\nHoehe stieg und furchtbare Macht gewann, in denen das Meer tiefer und\ntiefer blaute und in denen er Tadzio sehen durfte.\n\nEr sah ihn kommen, von links, am Rande des Meeres daher, sah ihn von\nrueckwaerts zwischen den Huetten hervortreten oder fand auch wohl\nploetzlich und nicht ohne ein frohes Erschrecken, dass er sein Kommen\nversaeumt und dass er schon da war, schon in dem blau und weissen\nBadeanzug, der jetzt am Strand seine einzige Kleidung war, sein\ngewohntes Treiben in Sonne und Sand wieder aufgenommen hatte,--dies\nlieblich nichtige, muessig unstete Leben, das Spiel war und Ruhe, ein\nSchlendern, Waten, Graben, Haschen, Lagern und Schwimmen, bewacht,\nberufen von den Frauen auf der Plattform, die mit Kopfstimmen seinen\nNamen ertoenen liessen: \"Tadziu! Tadziu!\" und zu denen er mit eifrigem\nGebaerdenspiel gelaufen kam, ihnen zu erzaehlen, was er erlebt, ihnen\nzu zeigen, was er gefunden, gefangen: Muscheln, Seepferdchen, Quallen\nund seitlich laufende Krebse. Aschenbach verstand nicht ein Wort von\ndem, was er sagte, und mochte es das Alltaeglichste sein, es war\nverschwommener Wohllaut in seinem Ohr. So erhob Fremdheit des Knaben\nRede zur Musik, eine uebermuetige Sonne goss verschwenderischen Glanz\nueber ihn aus, und die erhabene Tiefsicht des Meeres war immer seiner\nErscheinung Folie und Hintergrund.\n\nBald kannte der Betrachtende jede Linie und Pose dieses so gehobenen,\nso frei sich darstellenden Koerpers, begruesste freudig jede schon\nvertraute Schoenheit aufs Neue und fand der Bewunderung, der zarten\nSinneslust kein Ende. Man rief den Knaben, einen Gast zu begruessen, der\nden Frauen bei der Huette aufwartete; er lief herbei, lief nass\nvielleicht aus der Flut, er warf die Locken, und indem er die Hand\nreichte, auf einem Beine ruhend, den anderen Fuss auf die Zehenspitzen\ngestellt, hatte er eine reizende Drehung und Wendung des Koerpers,\nanmutig spannungsvoll, verschaemt aus Liebenswuerdigkeit, gefallsuechtig\naus adeliger Pflicht. Er lag ausgestreckt, das Badetuch um die Brust\ngeschlungen, den zart gemeisselten Arm in den Sand gestuetzt, das Kinn\nin der hohlen Hand; der, welcher \"Jaschu\" gerufen wurde, sass kauernd\nbei ihm und tat ihm schoen, und nichts konnte bezaubernder sein, als\ndas Laecheln der Augen und Lippen, mit dem der Ausgezeichnete zu dem\nGeringeren, Dienenden aufblickte. Er stand am Rande der See, allein,\nabseits von den Seinen, ganz nahe bei Aschenbach,--aufrecht, die Haende\nim Nacken verschlungen, langsam sich auf den Fussballen schaukelnd, und\ntraeumte ins Blaue, waehrend kleine Wellen, die anliefen, seine Zehen\nbadeten. Sein honigfarbenes Haar schmiegte sich in Ringeln an die\nSchlaefen und in den Nacken, die Sonne erleuchtete den Flaum des oberen\nRueckgrates, die feine Zeichnung der Rippen, das Gleichmass der Brust\ntraten durch die knappe Umhuellung des Rumpfes hervor, seine\nAchselhoehlen waren noch glatt wie bei einer Statue, seine Kniekehlen\nglaenzten, und ihr blaeuliches Geaeder liess seinen Koerper wie aus\nklarerem Stoffe gebildet erscheinen. Welch eine Zucht, welche\nPraezision des Gedankens war ausgedrueckt in diesem gestreckten und\njugendlich vollkommenen Leibe! Der strenge und reine Wille jedoch,\nder, dunkel taetig, dies goettliche Bildwerk ans Licht zu treiben\nvermocht hatte,--war er nicht ihm, dem Kuenstler, bekannt und vertraut?\nWirkte er nicht auch in ihm, wenn er, besonnener Leidenschaft voll,\naus der Marmormasse der Sprache die schlanke Form befreite, die er im\nGeiste geschaut und die er als Standbild und Spiegel geistiger\nSchoenheit den Menschen darstellte?\n\nStandbild und Spiegel! Seine Augen umfassten die edle Gestalt dort am\nRande des Blauen, und in aufschwaermendem Entzuecken glaubte er mit\ndiesem Blick das Schoene selbst zu begreifen, die Form als\nGottesgedanken, die eine und reine Vollkommenheit, die im Geiste lebt\nund von der ein menschliches Abbild und Gleichnis hier leicht und hold\nzur Anbetung aufgerichtet war. Das war der Rausch; und unbedenklich,\nja gierig, hiess der alternde Kuenstler ihn willkommen. Sein Geist\nkreiste, seine Bildung geriet ins Wallen, sein Gedaechtnis warf uralte,\nseiner Jugend ueberlieferte und bis dahin niemals von eigenem Feuer\nbelebte Gedanken auf. Stand nicht geschrieben, dass die Sonne unsere\nAufmerksamkeit von den intellektuellen auf die sinnlichen Dinge\nwendet? Sie betaeube und bezaubere, hiess es, Verstand und Gedaechtnis,\ndergestalt, dass die Seele vor Vergnuegen ihres eigentlichen Zustandes\nganz vergesse und mit staunender Bewunderung an dem schoensten der\nbesonnten Gegenstaende haengen bleibe: ja, nur mit Huelfe eines Koerpers\nvermoege sie dann noch zu hoeherer Betrachtung sich zu erheben. Amor\nfuerwahr tat es den Mathematikern gleich, die unfaehigen Kindern\ngreifbare Bilder der reinen Formen vorzeigen: So auch bediente der\nGott sich, um uns das Geistige sichtbar zu machen, gern der Gestalt\nund Farbe menschlicher Jugend, die er zum Werkzeug der Erinnerung mit\nallem Abglanz der Schoenheit schmueckte und bei deren Anblick wir dann\nwohl in Schmerz und Hoffnung entbrannten.\n\nSo dachte der Enthusiasmierte; so vermochte er zu empfinden. Und aus\nMeerrausch und Sonnenglast spann sich ihm ein reizendes Bild.\nEs war die alte Platane unfern den Mauern Athens,--war jener\nheilig-schattige, vom Dufte der Kirschbaumblueten erfuellte Ort, den\nWeihbilder und fromme Gaben schmueckten zu Ehren der Nymphen und des\nAcheloos. Ganz klar fiel der Bach zu Fuessen des breitgeaesteten Baums\nueber glatte Kiesel; die Grillen geigten. Auf dem Rasen aber, der sanft\nabfiel, so, dass man im Liegen den Kopf hoch halten konnte, lagerten\nZwei, geborgen hier vor der Glut des Tages: ein Aeltlicher und ein\nJunger, ein Haesslicher und ein Schoener, der Weise beim Liebenswuerdigen.\nUnd unter Artigkeiten und geistreich werbenden Scherzen belehrte\nSokrates den Phaidros ueber Sehnsucht und Tugend. Er sprach ihm von dem\nheissen Erschrecken, das der Fuehlende leidet, wenn sein Auge ein\nGleichnis der ewigen Schoenheit erblickt; sprach ihm von den Begierden\ndes Weihelosen und Schlechten, der die Schoenheit nicht denken kann,\nwenn er ihr Abbild sieht, und der Ehrfurcht nicht faehig ist; sprach\nvon der heiligen Angst, die den Edlen befaellt, wenn ein gottgleiches\nAntlitz, ein vollkommener Leib ihm erscheint, er dann aufbebt und\nausser sich ist und hinzusehen sich kaum getraut und den verehrt, der\ndie Schoenheit hat, ja, ihm opfern wuerde, wie einer Bildsaeule, wenn er\nnicht fuerchten muesste, den Menschen naerrisch zu scheinen. Denn die\nSchoenheit, mein Phaidros, nur sie, ist liebenswuerdig und sichtbar\nzugleich: sie ist, merke das wohl! die einzige Form des Geistigen,\nwelche wir sinnlich empfangen, sinnlich ertragen koennen. Oder was\nwuerde aus uns, wenn das Goettliche sonst, wenn Vernunft und Tugend und\nWahrheit uns sinnlich erscheinen wollten? Wuerden wir nicht vergehen\nund verbrennen vor Liebe, wie Semele einstmals vor Zeus? So ist die\nSchoenheit der Weg des Fuehlenden zum Geiste,--nur der Weg, ein Mittel\nnur, kleiner Phaidros... Und dann sprach er das Feinste aus, der\nverschlagene Hofmacher: Dies, dass der Liebende goettlicher sei, als der\nGeliebte, weil in jenem der Gott sei nicht aber im andern,--diesen\nzaertlichsten, spoettischsten Gedanken vielleicht, der jemals gedacht\nward, und dem alle Schalkheit und heimlichste Wollust der Sehnsucht\nentspringt. Glueck des Schriftstellers ist der Gedanke, der ganz\nGefuehl, ist das Gefuehl, das ganz Gedanke zu werden vermag. Solch ein\npulsender Gedanke, solch genaues Gefuehl gehoerte und gehorchte dem\nEinsamen damals: naemlich, dass die Natur vor Wonne erschaure, wenn der\nGeist sich huldigend vor der Schoenheit neige. Er wuenschte ploetzlich,\nzu schreiben. Zwar liebt Eros, heisst es, den Muessiggang, und fuer\nsolchen nur ist er geschaffen. Aber an diesem Punkte der Krisis war\ndie Erregung des Heimgesuchten auf Produktion gerichtet. Fast\ngleichgueltig der Anlass. Eine Frage, eine Anregung, ueber ein gewisses\ngrosses und brennendes Problem der Kultur und des Geschmackes sich\nbekennend vernehmen zu lassen, war in die geistige Welt ergangen und\nbei dem Verreisten eingelaufen. Der Gegenstand war ihm gelaeufig, war\nihm Erlebnis; sein Geluest, ihn im Licht seines Wortes erglaenzen zu\nlassen, auf einmal unwiderstehlich. Und zwar ging sein Verlangen\ndahin, in Tadzios Gegenwart zu arbeiten, beim Schreiben den Wuchs des\nKnaben zum Muster zu nehmen, seinen Stil den Linien dieses Koerpers\nfolgen zu lassen, der ihm goettlich schien, und seine Schoenheit ins\nGeistige zu tragen, wie der Adler einst den troischen Hirten zum Aether\ntrug. Nie hatte er die Lust des Wortes suesser empfunden, nie so gewusst,\ndass Eros im Worte sei, wie waehrend der gefaehrlich koestlichen Stunden,\nin denen er, an seinem rohen Tische unter dem Schattentuch, im\nAngesicht des Idols und die Musik seiner Stimme im Ohr, nach Tadzios\nSchoenheit seine kleine Abhandlung,--jene anderthalb Seiten erlesener\nProsa formte, deren Lauterkeit, Adel und schwingende Gefuehlsspannung\nbinnen kurzem die Bewunderung vieler erregen sollte. Es ist sicher\ngut, dass die Welt nur das schoene Werk, nicht auch seine Urspruenge,\nnicht seine Entstehungsbedingungen kennt; denn die Kenntnis der\nQuellen, aus denen dem Kuenstler Eingebung floss, wuerde sie oftmals\nverwirren, abschrecken und so die Wirkungen des Vortrefflichen\naufheben. Sonderbare Stunden! Sonderbar entnervende Muehe! Seltsam\nzeugender Verkehr des Geistes mit einem Koerper! Als Aschenbach seine\nArbeit verwahrte und vom Strande aufbrach, fuehlte er sich erschoepft,\nja zerruettet, und ihm war, als ob sein Gewissen wie nach einer\nAusschweifung Klage fuehre.\n\nEs war am folgenden Morgen, dass er, im Begriff das Hotel zu verlassen,\nvon der Freitreppe aus gewahrte, wie Tadzio, schon unterwegs zum\nMeere--und zwar allein,--sich eben der Strandsperre naeherte. Der\nWunsch, der einfache Gedanke, die Gelegenheit zu nutzen und mit dem,\nder ihm unwissentlich so viel Erhebung und Bewegung bereitet, leichte,\nheitere Bekanntschaft zu machen, ihn anzureden, sich seiner Antwort,\nseines Blickes zu erfreuen, lag nahe und draengte sich auf. Der Schoene\nging schlendernd, er war einzuholen, und Aschenbach beschleunigte\nseine Schritte. Er erreicht ihn auf dem Brettersteig hinter den\nHuetten, er will ihm die Hand aufs Haupt, auf die Schulter legen und\nirgend ein Wort, eine freundliche franzoesische Phrase schwebt ihm auf\nden Lippen: da fuehlt er, dass sein Herz, vielleicht auch vom schnellen\nGang, wie ein Hammer schlaegt, dass er, so knapp bei Atem, nur gepresst\nund bebend wird sprechen koennen; er zoegert, er sucht sich zu\nbeherrschen, er fuerchtet ploetzlich, schon zu lange dicht hinter dem\nSchoenen zu gehen, fuerchtet sein Aufmerksamwerden, sein fragendes\nUmschauen, nimmt noch einen Anlauf, versagt, verzichtet und geht\ngesenkten Hauptes vorueber.\n\nZu spaet! dachte er in diesem Augenblick. Zu spaet! Jedoch war es zu\nspaet? Dieser Schritt, den zu tun er versaeumte, er haette sehr\nmoeglicherweise zum Guten, Leichten und Frohen, zu heilsamer\nErnuechterung gefuehrt. Allein es war wohl an dem, dass der Alternde die\nErnuechterung nicht wollte, dass der Rausch ihm zu teuer war. Wer\nentraetselt Wesen und Gepraege des Kuenstlertums! Wer begreift die tiefe\nInstinktverschmelzung von Zucht und Zuegellosigkeit, worin es beruht!\nDenn heilsame Ernuechterung nicht wollen zu koennen, ist Zuegellosigkeit.\nAschenbach war zur Selbstkritik nicht mehr aufgelegt; der Geschmack,\ndie geistige Verfassung seiner Jahre, Selbstachtung, Reife und spaete\nEinfachheit machten ihn nicht geneigt, Beweggruende zu zergliedern und\nzu entscheiden, ob er aus Gewissen, ob aus Liederlichkeit und Schwaeche\nsein Vorhaben nicht ausgefuehrt habe. Er war verwirrt, er fuerchtete,\ndass irgend jemand, wenn auch der Strandwaechter nur, seinen Lauf, seine\nNiederlage beobachtet haben moechte, fuerchtete sehr die Laecherlichkeit.\nIm uebrigen scherzte er bei sich selbst ueber seine komisch-heilige\nAngst. \"Bestuerzt\", dachte er, \"bestuerzt wie ein Hahn, der angstvoll\nseine Fluegel im Kampfe haengen laesst. Das ist wahrlich der Gott, der\nbeim Anblick des Liebenswuerdigen so unseren Mut bricht und unsern\nstolzen Sinn so gaenzlich zu Boden drueckt...\" Er spielte, schwaermte und\nwar viel zu hochmuetig, um ein Gefuehl zu fuerchten.\n\nSchon ueberwachte er nicht mehr den Ablauf der Mussezeit, die er sich\nselber gewaehrt; der Gedanke an Heimkehr beruehrte ihn nicht einmal. Er\nhatte sich reichlich Geld verschrieben. Seine Besorgnis galt einzig\nder moeglichen Abreise der polnischen Familie; doch hatte er unter der\nHand, durch beilaeufige Erkundigung beim Coiffeur des Hotels, erfahren,\ndass diese Herrschaften ganz kurz vor seiner eigenen Ankunft hier\nabgestiegen seien. Die Sonne braeunte ihm Antlitz und Haende, der\nerregende Salzhauch staerkte ihn zum Gefuehl, und wie er sonst jede\nErquickung, die Schlaf, Nahrung oder Natur ihm gespendet, sogleich an\nein Werk zu verausgaben gewohnt war, so liess er nun alles, was Sonne,\nMusse und Meerluft ihm an taeglicher Kraeftigung zufuehrten,\nhochherzig-unwirtschaftlich aufgehen in Rausch und Empfindung.\n\nSein Schlaf war fluechtig; die koestlich einfoermigen Tage waren getrennt\ndurch kurze Naechte voll gluecklicher Unruhe. Zwar zog er sich zeitig\nzurueck, denn um neun Uhr, wenn Tadzio vom Schauplatz verschwunden war,\nschien der Tag ihm beendet. Aber ums erste Morgengrauen weckte ihn ein\nzart durchdringendes Erschrecken, sein Herz erinnerte sich seines\nAbenteuers, es litt ihn nicht mehr in den Kissen, er erhob sich, und\nleicht eingehuellt gegen die Schauer der Fruehe setzte er sich ans\noffene Fenster, den Aufgang der Sonne zu erwarten. Das wundervolle\nEreignis erfuellte seine vom Schlafe geweihte Seele mit Andacht. Noch\nlagen Himmel, Erde und Meer in geisterhaft glasiger Daemmerblaesse; noch\nschwamm ein vergehender Stern im Wesenlosen. Aber ein Wehen kam, eine\nbeschwingte Kunde von unnahbaren Wohnplaetzen, dass Eos sich von der\nSeite des Gatten erhebe, und jenes erste, suesse Erroeten der fernsten\nHimmels-und Meeresstriche geschah, durch welches das Sinnlichwerden\nder Schoepfung sich anzeigt. Die Goettin nahte, die\nJuenglingsentfuehrerin, die den Kleitos, den Kephalos raubte und dem\nNeide aller Olympischen trotzend die Liebe des schoenen Orion genoss.\nEin Rosenstreuen begann da am Rande der Welt, ein unsaeglich holdes\nScheinen und Bluehen, kindliche Wolken, verklaert, durchleuchtet,\nschwebten gleich dienenden Amoretten im rosigen, blaeulichen Duft,\nPurpur fiel auf das Meer, das ihn wallend vorwaerts zu schwemmen\nschien, goldene Speere zuckten von unten zur Hoehe des Himmels hinauf,\nder Glanz ward zum Brande, lautlos, mit goettlicher Uebergewalt waelzten\nsich Glut und Brunst und lodernde Flammen herauf, und mit raffenden\nHufen stiegen des Bruders heilige Renner ueber den Erdkreis empor.\nAngestrahlt von der Pracht des Gottes sass der Einsam-Wache, er schloss\ndie Augen und liess von der Glorie seine Lider kuessen. Ehemalige\nGefuehle, fruehe, koestliche Drangsale des Herzens, die im strengen\nDienst seines Lebens erstorben waren und nun so sonderbar gewandelt\nzurueckkehrten,--er erkannte sie mit verwirrtem, verwundertem Laecheln.\nEr sann, er traeumte, langsam bildeten seine Lippen einen Namen, und\nnoch immer laechelnd, mit aufwaerts gekehrtem Antlitz, die Haende im\nSchoesse gefaltet, entschlummerte er in seinem Sessel noch einmal.\n\nAber der Tag, der so feurig-festlich begann, war im ganzen seltsam\ngehoben und mythisch verwandelt. Woher kam und stammte der Hauch, der\nauf einmal so sanft und bedeutend, hoeherer Einfluesterung gleich,\nSchlaefe und Ohr umspielte? Weisse Federwoelkchen standen in verbreiteten\nScharen am Himmel, gleich weidenden Herden der Goetter. Staerkerer Wind\nerhob sich, und die Rosse Poseidons liefen, sich baeumend, daher,\nStiere auch wohl, dem Blaeulichgelockten gehoerig, welche mit Bruellen\nanrennend die Hoerner senkten. Zwischen dem Felsengeroell des\nentfernteren Strandes jedoch huepften die Wellen empor als springende\nZiegen. Eine heilig entstellte Welt voll panischen Lebens schloss den\nBerueckten ein, und sein Herz traeumte zarte Fabeln. Mehrmals, wenn\nhinter Venedig die Sonne sank, sass er auf einer Bank im Park, um\nTadzio zuzuschauen, der sich, weiss gekleidet und farbig geguertet, auf\ndem gewalzten Kiesplatz mit Ballspiel vergnuegte, und Hyakinthos war\nes, den er zu sehen glaubte, und der sterben musste, weil zwei Goetter\nihn liebten. Ja, er empfand Zephyrs schmerzenden Neid auf den\nNebenbuhler, der des Orakels, des Bogens und der Kithara vergass, um\nimmer mit dem Schoenen zu spielen; er sah die Wurfscheibe, von\ngrausamer Eifersucht gelenkt, das liebliche Haupt treffen, er empfing,\nerblassend auch er, den geknickten Leib, und die Blume, dem suessen\nBlute entsprossen, trug die Inschrift seiner unendlichen Klage...\n\nSeltsamer, heikler ist nichts als das Verhaeltnis von Menschen, die\nsich nur mit den Augen kennen,--die taeglich, ja stuendlich einander\nbegegnen, beobachten und dabei den Schein gleichgueltiger Fremdheit\ngrusslos und wortlos aufrecht zu halten durch Sittenzwang oder eigene\nGrille genoetigt sind. Zwischen ihnen ist Unruhe und ueberreizte\nNeugier, die Hysterie eines unbefriedigten, unnatuerlich unterdrueckten\nErkenntnis-und Austauschbeduerfnisses und namentlich auch eine Art von\ngespannter Achtung. Denn der Mensch liebt und ehrt den Menschen, so\nlange er ihn nicht zu beurteilen vermag, und die Sehnsucht ist ein\nErzeugnis mangelhafter Erkenntnis.\n\nIrgend eine Beziehung und Bekanntschaft musste sich notwendig ausbilden\nzwischen Aschenbach und dem jungen Tadzio, und mit durchdringender\nFreude konnte der Aeltere feststellen, dass Teilnahme und Aufmerksamkeit\nnicht voellig unerwidert blieben. Was bewog zum Beispiel den Schoenen,\nniemals mehr, wenn er morgens am Strande erschien, den Brettersteg an\nder Rueckseite der Huetten zu benuetzen, sondern nur noch auf dem\nvorderen Wege, durch den Sand, an Aschenbachs Wohnplatz vorbei und\nmanchmal unnoetig dicht an ihm vorbei, seinen Tisch, seinen Stuhl fast\nstreifend, zur Huette der Seinen zu schlendern? Wirkte so die\nAnziehung, die Faszination eines ueberlegenen Gefuehls auf seinen zarten\nund gedankenlosen Gegenstand? Aschenbach erwartete taeglich Tadzios\nAuftreten, und zuweilen tat er, als sei er beschaeftigt, wenn es sich\nvollzog, und liess den Schoenen scheinbar unbeachtet voruebergehen.\nZuweilen aber auch blickte er auf, und ihre Blicke trafen sich. Sie\nwaren beide tief ernst, wenn das geschah. In der gebildeten und\nwuerdevollen Miene des Aelteren verriet nichts eine innere Bewegung;\naber in Tadzios Augen war ein Forschen, ein nachdenkliches Fragen, in\nseinen Gang kam ein Zoegern, er blickte zu Boden, er blickte lieblich\nwieder auf, und wenn er vorueber war, so schien ein Etwas in seiner\nHaltung auszudruecken, dass nur Erziehung ihn hinderte, sich umzuwenden.\n\nEinmal jedoch, eines Abends, begab es sich anders. Die polnischen\nGeschwister hatten nebst ihrer Gouvernante bei der Hauptmahlzeit im\ngrossen Saale gefehlt,--mit Besorgnis hatte Aschenbach es wahrgenommen.\nEr erging sich nach Tische, sehr unruhig ueber ihren Verbleib, in\nAbendanzug und Strohhut vor dem Hotel, zu Fuessen der Terrasse, als er\nploetzlich die nonnenaehnlichen Schwestern mit der Erzieherin und vier\nSchritte hinter ihnen Tadzio im Lichte der Bogenlampen auftauchen sah.\nOffenbar kamen sie von der Dampferbruecke, nachdem sie aus irgendeinem\nGrunde in der Stadt gespeist. Auf dem Wasser war es wohl kuehl gewesen;\nTadzio trug eine dunkelblaue Seemanns-Ueberjacke mit goldenen Knoepfen\nund auf dem Kopf eine zugehoerige Muetze. Sonne und Seeluft verbrannten\nihn nicht, seine Hautfarbe war marmorhaft gelblich geblieben wie zu\nBeginn; doch schien er blaesser heute als sonst, sei es infolge der\nKuehle oder durch den bleichenden Mondschein der Lampen. Seine\nebenmaessigen Brauen zeichneten sich schaerfer ab, seine Augen dunkelten\ntief. Er war schoener, als es sich sagen laesst, und Aschenbach empfand\nwie schon oftmals mit Schmerzen, dass das Wort die sinnliche Schoenheit\nnur zu preisen, nicht wiederzugeben vermag.\n\nEr war der teuren Erscheinung nicht gewaertig gewesen, sie kam\nunverhofft, er hatte nicht Zeit gehabt, seine Miene zu Ruhe und Wuerde\nzu befestigen. Freude, Ueberraschung, Bewunderung mochten sich offen\ndarin malen, als sein Blick dem des Vermissten begegnete,--und in\ndieser Sekunde geschah es, dass Tadzio laechelte: ihn anlaechelte,\nsprechend, vertraut, liebreizend und unverhohlen, mit Lippen, die sich\nim Laecheln erst langsam oeffneten. Es war das Laecheln des Narziss, der\nsich ueber das spiegelnde Wasser neigt, jenes tiefe, bezauberte,\nhingezogene Laecheln, mit dem er nach dem Widerschein der eigenen\nSchoenheit die Arme streckt,--ein ganz wenig verzerrtes Laecheln,\nverzerrt von der Aussichtslosigkeit seines Trachtens, die holden\nLippen seines Schattens zu kuessen, kokett, neugierig und leise\ngequaelt, betoert und betoerend.\n\nDer, welcher dies Laecheln empfangen, enteilte damit wie mit einem\nverhaengnisvollen Geschenk. Er war so sehr erschuettert, dass er das\nLicht der Terrasse, des Vorgartens, zu fliehen gezwungen war und mit\nhastigen Schritten das Dunkel des rueckwaertigen Parkes suchte.\nSonderbar entruestete und zaertliche Vermahnungen entrangen sich ihm:\n\"Du darfst so nicht laecheln! Hoere, man darf so niemandem laecheln!\" Er\nwarf sich auf eine Bank, er atmete ausser sich den naechtlichen Duft der\nPflanzen. Und zurueckgelehnt, mit haengenden Armen, ueberwaeltigt und\nmehrfach von Schauern ueberlaufen, fluesterte er die stehende Formel der\nSehnsucht,--unmoeglich hier, absurd, verworfen, laecherlich und heilig\ndoch, ehrwuerdig auch hier noch: \"Ich liebe dich!\"\n\n\n\n\nFuenftes Kapitel\n\n\nIn der vierten Woche seines Aufenthalts auf dem Lido machte Gustav von\nAschenbach einige die Aussenwelt betreffende unheimliche Wahrnehmungen.\nErstens schien es ihm, als ob bei steigender Jahreszeit die Frequenz\nseines Gasthofes eher ab-als zunaehme, und, insbesondere, als ob die\ndeutsche Sprache um ihn her versiege und verstumme, so dass bei Tisch\nund am Strand endlich nur noch fremde Laute sein Ohr trafen. Eines\nTages dann fing er beim Coiffeur, den er jetzt haeufig besuchte, im\nGespraeche ein Wort auf, das ihn stutzig machte. Der Mann hatte einer\ndeutschen Familie erwaehnt, die soeben nach kurzem Verweilen abgereist\nwar und setzte plaudernd und schmeichelnd hinzu: \"Sie bleiben, mein\nHerr; Sie haben keine Furcht vor dem Uebel.\" Aschenbach sah ihn an.\n\"Dem Uebel?\" wiederholte er. Der Schwaetzer verstummte, tat beschaeftigt,\nueberhoerte die Frage, und als sie dringlicher gestellt ward, erklaerte\ner, er wisse von nichts und suchte mit verlegener Beredsamkeit\nabzulenken.\n\nDas war um Mittag. Nachmittags fuhr Aschenbach bei Windstille und\nschwerem Sonnenbrand nach Venedig; denn ihn trieb die Manie, den\npolnischen Geschwistern zu folgen, die er mit ihrer Begleiterin den\nWeg zur Dampferbruecke hatte einschlagen sehen. Er fand den Abgott\nnicht bei San Marco. Aber beim Tee, an seinem eisernen Rundtischchen\nauf der Schattenseite des Platzes sitzend, witterte er ploetzlich in\nder Luft ein eigentuemliches Arom, von dem ihm jetzt schien, als habe\nes schon seit Tagen, ohne ihm ins Bewusstsein zu dringen, seinen Sinn\nberuehrt,--einen suesslich-offizinellen Geruch, der an Elend und Wunden\nund verdaechtige Reinlichkeit erinnerte. Er pruefte und erkannte ihn\nnachdenklich, beendete seinen Imbiss und verliess den Platz auf der dem\nTempel gegenueberliegenden Seite. In der Enge verstaerkte sich der\nGeruch. An den Strassenecken hafteten gedruckte Anschlaege, durch welche\ndie Bevoelkerung wegen gewisser Erkrankungen des gastrischen Systems,\ndie bei dieser Witterung an der Tagesordnung seien, vor dem Genusse\nvon Austern und Muscheln, auch vor dem Wasser der Kanaele\nstadtvaeterlich gewarnt wurde. Die beschoenigende Natur des Erlasses war\ndeutlich. Volksgruppen standen schweigsam auf Bruecken und Plaetzen\nbeisammen; und der Fremde stand spuerend und gruebelnd unter ihnen.\n\nEinen Ladeninhaber, der zwischen Korallenschnueren und falschen\nAmethyst-Geschmeiden in der Tuere seines Gewoelbes lehnte, bat er um\nAuskunft ueber den fatalen Geruch. Der Mann mass ihn mit schweren Augen\nund ermunterte sich hastig. \"Eine vorbeugende Massregel, mein Herr!\"\nantwortete er mit Gebaerdenspiel. \"Eine Verfuegung der Polizei, die man\nbilligen muss. Diese Witterung drueckt, der Scirocco ist der Gesundheit\nnicht zutraeglich. Kurz, Sie verstehen,--eine vielleicht uebertriebene\nVorsicht...\" Aschenbach dankte ihm und ging weiter. Auch auf dem\nDampfer, der ihn zum Lido zuruecktrug, spuerte er jetzt den Geruch des\nkeimbekaempfenden Mittels.\n\nIns Hotel zurueckgekehrt, begab er sich sogleich in die Halle zum\nZeitungstisch und hielt in den Blaettern Umschau. Er fand in den\nfremdsprachigen nichts. Die heimatlichen verzeichneten Geruechte,\nfuehrten schwankende Ziffern an, gaben amtliche Ableugnungen wieder und\nbezweifelten deren Wahrhaftigkeit. So erklaerte sich der Abzug des\ndeutschen und oesterreichischen Elementes. Die Angehoerigen der uebrigen\nNationen wussten offenbar nichts, ahnten nichts, waren noch nicht\nbeunruhigt. \"Man soll schweigen!\" dachte Aschenbach erregt, indem er\ndie Journale auf den Tisch zurueckwarf. \"Man soll das verschweigen!\"\nAber zugleich fuellte sein Herz sich mit Genugtuung ueber das Abenteuer,\nin welches die Aussenwelt geraten wollte. Denn der Leidenschaft ist,\nwie dem Verbrechen, die gesicherte Ordnung und Wohlfahrt des Alltags\nnicht gemaess, und jede Lockerung des buergerlichen Gefueges, jede\nVerwirrung und Heimsuchung der Welt muss ihr willkommen sein, weil sie\nihren Vorteil dabei zu finden unbestimmt hoffen kann. So empfand\nAschenbach eine dunkle Zufriedenheit ueber die obrigkeitlich\nbemaentelten Vorgaenge in den schmutzigen Gaesschen Venedigs,--dieses\nschlimme Geheimnis der Stadt, das mit seinem eigensten Geheimnis\nverschmolz, und an dessen Bewahrung auch ihm so sehr gelegen war. Denn\nder Verliebte besorgte nichts, als dass Tadzio abreisen koennte und\nerkannte nicht ohne Entsetzen, dass er nicht mehr zu leben wissen\nwerde, wenn das geschaehe.\n\nNeuerdings begnuegte er sich nicht damit, Naehe und Anblick des Schoenen\nder Tagesregel und dem Gluecke zu danken; er verfolgte ihn, er stellte\nihm nach. Sonntags zum Beispiel erschienen die Polen niemals am\nStrande; er erriet, dass sie die Messe in San Marco besuchten, er eilte\ndorthin, und aus der Glut des Platzes in die goldene Daemmerung des\nHeiligtums eintretend, fand er den Entbehrten, ueber ein Betpult\ngebeugt beim Gottesdienst. Dann stand er im Hintergrunde, auf\nzerklueftetem Mosaikboden, inmitten knieenden, murmelnden,\nkreuzschlagenden Volkes, und die gedrungene Pracht des\nmorgenlaendischen Tempels lastete ueppig auf seinen Sinnen. Vorn\nwandelte, hantierte und sang der schwergeschmueckte Priester, Weihrauch\nquoll auf, er umnebelte die kraftlosen Flaemmchen der Altarkerzen, und\nin den dumpfsuessen Opferduft schien sich leise ein anderer zu mischen:\nder Geruch der erkrankten Stadt. Aber durch Dunst und Gefunkel sah\nAschenbach, wie der Schoene dort vorn den Kopf wandte, ihn suchte und\nihn erblickte.\n\nWenn dann die Menge durch die geoeffneten Portale hinausstroemte auf den\nleuchtenden, von Tauben wimmelnden Platz, verbarg sich der Betoerte in\nder Vorhalle, er versteckte sich, er legte sich auf die Lauer. Er sah\ndie Polen die Kirche verlassen, sah, wie die Geschwister sich auf\nzeremonioese Art von der Mutter verabschiedeten und wie diese sich\nheimkehrend zur Piazzetta wandte; er stellte fest, dass der Schoene, die\nkloesterlichen Schwestern und die Gouvernante den Weg zur Rechten durch\ndas Tor des Uhrturmes und in die Merceria einschlugen, und nachdem er\nsie einigen Vorsprung hatte gewinnen lassen, folgte er ihnen, folgte\nihnen verstohlen auf ihrem Spaziergang durch Venedig.\n\nEr musste stehen bleiben, wenn sie sich verweilten, musste in Garkuechen\nund Hoefe fluechten, um die Umkehrenden vorueber zu lassen; er verlor\nsie, suchte erhitzt und erschoepft nach ihnen ueber Bruecken und in\nschmutzigen Sackgassen und erduldete Minuten toedlicher Pein, wenn er\nsie ploetzlich in enger Passage, wo kein Ausweichen moeglich war, sich\nentgegenkommen sah. Dennoch kann man nicht sagen, dass er litt. Haupt\nund Herz waren ihm trunken, und seine Schritte folgten den Weisungen\ndes Daemons, dem es Lust ist, des Menschen Vernunft und Wuerde unter\nseine Fuesse zu treten.\n\nIrgendwo nahmen Tadzio und die Seinen dann wohl eine Gondel, und\nAschenbach, den, waehrend sie einstiegen, ein Vorbau, ein Brunnen\nverborgen gehalten hatte, tat, kurz nachdem sie vom Ufer abgestossen,\nein Gleiches. Er sprach hastig und gedaempft, wenn er den Ruderer,\nunter dem Versprechen eines reichlichen Trinkgeldes, anwies, jener\nGondel, die eben dort um die Ecke biege, unauffaellig in einigem\nAbstand zu folgen; und es ueberrieselte ihn, wenn der Mensch, mit der\nspitzbuebischen Erboetigkeit eines Gelegenheitsmachers, ihm in demselben\nTone versicherte, dass er bedient, dass er gewissenhaft bedient werden\nsolle.\n\nSo glitt und schwankte er denn, in weiche, schwarze Kissen gelehnt,\nder anderen schwarzen, geschnabelten Barke nach, an deren Spur die\nPassion ihn fesselte. Zuweilen entschwand sie ihm: dann fuehlte er\nKummer und Unruhe. Aber sein Fuehrer, als sei er in solchen Auftraegen\nwohl geuebt, wusste ihm stets durch schlaue Manoever, durch rasche\nQuerfahrten und Abkuerzungen das Begehrte wieder vor Augen zu bringen.\nDie Luft war still und riechend, schwer brannte die Sonne durch den\nDunst, der den Himmel schieferig faerbte. Wasser schlug glucksend gegen\nHolz und Stein. Der Ruf des Gondoliers, halb Warnung, halb Gruss, ward\nfernher aus der Stille des Labyrinths nach sonderbarer Uebereinkunft\nbeantwortet. Aus kleinen, hochliegenden Gaerten hingen Bluetendolden,\nweiss und purpurn, nach Mandeln duftend, ueber morsches Gemaeuer.\nArabische Fensterumrahmungen bildeten sich im Trueben ab. Die\nMarmorstufen einer Kirche stiegen in die Flut; ein Bettler, darauf\nkauernd, sein Elend beteuernd, hielt seinen Hut hin und zeigte das\nWeisse der Augen, als sei er blind, ein Altertumshaendler, vor seiner\nSpelunke, lud den Vorueberziehenden mit kriecherischen Gebaerden zum\nAufenthalt ein, in der Hoffnung, ihn zu betruegen. Das war Venedig, die\nschmeichlerische und verdaechtige Schoene,--diese Stadt, halb Maerchen,\nhalb Fremdenfalle, in deren fauliger Luft die Kunst einst\nschwelgerisch aufwucherte und welche den Musikern Klaenge eingab, die\nwiegen und buhlerisch einlullen. Dem Abenteuernden war es, als traenke\nsein Auge dergleichen Ueppigkeit, als wuerde sein Ohr von solchen\nMelodien umworben; er erinnerte sich auch, dass die Stadt krank sei und\nes aus Gewinnsucht verheimliche, und er spaehte ungezuegelter aus nach\nder voranschwebenden Gondel.\n\nSo wusste und wollte denn der Verwirrte nichts anderes mehr, als den\nGegenstand, der ihn entzuendete, ohne Unterlass zu verfolgen, von ihm\nzu traeumen, wenn er abwesend war, und, nach der Weise der Liebenden,\nseinem blossen Schattenbild zaertliche Worte zu geben. Einsamkeit,\nFremde und das Glueck eines spaeten und tiefen Rausches ermutigten und\nueberredeten ihn, sich auch das Befremdlichste ohne Scheu und Erroeten\ndurchgehen zu lassen, wie es denn vorgekommen war, dass er, spaet abends\nvon Venedig heimkehrend, im ersten Stock des Hotels an des Schoenen\nZimmertuer Halt gemacht, seine Stirn in voelliger Trunkenheit an die\nAngel der Tuer gelehnt und sich lange von dort nicht zu trennen\nvermocht hatte, auf die Gefahr, in einer so wahnsinnigen Lage ertappt\nund betroffen zu werden.\n\nDennoch fehlte es nicht an Augenblicken des Innehaltens und der halben\nBesinnung. Auf welchen Wegen! dachte er dann mit Bestuerzung. Auf\nwelchen Wegen! Wie jeder Mann, dem natuerliche Verdienste ein\naristokratisches Interesse fuer seine Abstammung einfloessen, war er\ngewohnt, bei den Leistungen und Erfolgen seines Lebens der Vorfahren\nzu gedenken, sich ihrer Zustimmung, ihrer Genugtuung, ihrer\nnotgedrungenen Achtung im Geiste zu versichern. Er dachte ihrer auch\njetzt und hier, verstrickt in ein so unstatthaftes Erlebnis, begriffen\nin so exotischen Ausschweifungen des Gefuehls; gedachte der\nhaltungsvollen Strenge, der anstaendigen Maennlichkeit ihres Wesens und\nlaechelte schwermuetig. Was wuerden sie sagen? Aber freilich, was haetten\nsie zu seinem ganzen Leben gesagt, das von dem ihren so bis zur\nEntartung abgewichen war, zu diesem Leben im Banne der Kunst, ueber das\ner selbst einst, im Buergersinne der Vaeter, so spoettische\nJuenglingserkenntnisse hatte verlauten lassen und das dem ihren im\nGrunde so aehnlich gewesen war! Auch er hatte gedient, auch er sich in\nharter Zucht geuebt; auch er war Soldat und Kriegsmann gewesen, gleich\nmanchen von ihnen,--denn die Kunst war ein Krieg, ein aufreibender\nKampf, fuer welchen man heute nicht lange taugte. Ein Leben der\nSelbstueberwindung und des Trotzdem, ein herbes, standhaftes und\nenthaltsames Leben, das er zum Sinnbild fuer einen zarten und\nzeitgemaessen Heroismus gestaltet hatte,--wohl durfte er es maennlich,\ndurfte es tapfer nennen, und es wollte ihm scheinen, als sei der Eros,\nder sich seiner bemeistert, einem solchen Leben auf irgendeine Weise\nbesonders gemaess und geneigt. Hatte er nicht bei den tapfersten Voelkern\nvorzueglich in Ansehen gestanden, ja, hiess es nicht, dass er durch\nTapferkeit in ihren Staedten geblueht habe? Zahlreiche Kriegshelden der\nVorzeit hatten willig sein Joch getragen, denn gar keine Erniedrigung\ngalt, die der Gott verhaengte, und Taten, die als Merkmale der Feigheit\nwaeren gescholten worden, wenn sie um anderer Zwecke willen geschehen\nwaeren: Fussfaelle, Schwuere, instaendige Bitten und sklavisches Wesen,\nsolche gereichten dem Liebenden nicht zur Schande, sondern er erntete\nvielmehr noch Lob dafuer.\n\nSo war des Betoerten Denkweise bestimmt, so suchte er sich zu stuetzen,\nseine Wuerde zu wahren. Aber zugleich wandte er bestaendig eine spuerende\nund eigensinnige Aufmerksamkeit den unsauberen Vorgaengen im Innern\nVenedigs zu, jenem Abenteuer der Aussenwelt, das mit dem seines Herzens\ndunkel zusammenfloss und seine Leidenschaft mit unbestimmten,\ngesetzlosen Hoffnungen naehrte. Versessen darauf, Neues und Sicheres\nueber Stand oder Fortschritt des Uebels zu erfahren, durchstoeberte er in\nden Kaffeehaeusern der Stadt die heimatlichen Blaetter, da sie vom\nLesetisch der Hotelhalle seit mehreren Tagen verschwunden waren.\nBehauptungen und Widerrufe wechselten darin. Die Zahl der\nErkrankungs-, der Todesfaelle sollte sich auf zwanzig, auf vierzig, ja\nhundert und mehr belaufen, und gleich darauf wurde jedes Auftreten der\nSeuche wenn nicht rundweg in Abrede gestellt, so doch auf voellig\nvereinzelte, von aussen eingeschleppte Faelle zurueckgefuehrt. Warnende\nBedenken, Proteste gegen das gefaehrliche Spiel der welschen Behoerden\nwaren eingestreut. Gewissheit war nicht zu erlangen.\n\nDennoch war sich der Einsame eines besonderen Anrechtes bewusst, an dem\nGeheimnis teil zu haben, und, gleichwohl ausgeschlossen, fand er eine\nbizarre Genugtuung darin, die Wissenden mit verfaenglichen Fragen\nanzugehen und sie, die zum Schweigen verbuendet waren, zur\nausdruecklichen Luege zu noetigen. Eines Tages beim Fruehstueck im grossen\nSpeisesaal stellte er so den Geschaeftsfuehrer zur Rede, jenen kleinen,\nleise auftretenden Menschen im franzoesischen Gehrock, der sich\ngruessend und beaufsichtigend zwischen den Speisenden bewegte und auch\nan Aschenbachs Tischchen zu einigen Plauderworten Halt machte. Warum\nman denn eigentlich, fragte der Gast in laessiger und beilaeufiger\nWeise, warum in aller Welt, man seit einiger Zeit Venedig\ndesinfiziere?--\"Es handelt sich\", antwortete der Schleicher, \"um eine\nMassnahme der Polizei, bestimmt, allerlei Unzutraeglichkeiten oder\nStoerungen der oeffentlichen Gesundheit, welche durch die bruetende und\nausnehmend warme Witterung erzeugt werden moechten, pflichtgemaess und\nbeizeiten hintanzuhalten.\"--\"Die Polizei ist zu loben\", erwiderte\nAschenbach, und nach Austausch einiger meteorologischer Bemerkungen\nempfahl sich der Manager.\n\nSelbigen Tages noch, abends nach dem Diner, geschah es, dass eine\nkleine Bande von Strassensaengern aus der Stadt sich im Vorgarten des\nGasthofes hoeren liess. Sie standen, zwei Maenner und zwei Weiber, an dem\neisernen Mast einer Bogenlampe und wandten ihre weissbeschienenen\nGesichter zur grossen Terrasse empor, wo die Kurgesellschaft sich bei\nKaffee und kuehlenden Getraenken die volkstuemliche Darbietung gefallen\nliess. Das Hotelpersonal, Liftboys, Kellner und Angestellte der Office,\nzeigte sich lauschend an den Tueren zur Halle. Die russische Familie,\neifrig und genau im Genuss, hatte sich Rohrstuehle in den Garten\nhinabstellen lassen, um den Ausuebenden naeher zu sein, und sass dort\ndankbar im Halbkreise. Hinter der Herrschaft, in turbanartigem\nKopftuch, stand ihre alte Sklavin.\n\nMandoline, Guitarre, Harmonika und eine quinkelierende Geige waren\nunter den Haenden der Bettelvirtuosen in Taetigkeit. Mit instrumentalen\nDurchfuehrungen wechselten Gesangsnummern, wie denn das juengere der\nWeiber, scharf und quaekend von Stimme, sich mit dem suess\nfalsettierenden Tenor zu einem verlangenden Liebesduett zusammentat.\nAber als das eigentliche Talent und Haupt der Vereinigung zeigte sich\nunzweideutig der andere der Maenner, Inhaber der Guitarre und im\nCharakter eine Art Baryton-Buffo, fast ohne Stimme dabei, aber mimisch\nbegabt und von bemerkenswerter komischer Energie. Oftmals loeste er\nsich, sein grosses Instrument im Arm, von der Gruppe der anderen los\nund drang agierend gegen die Rampe vor, wo man seine Eulenspiegeleien\nmit aufmunterndem Lachen belohnte. Namentlich die Russen, in ihrem\nParterre, zeigten sich entzueckt ueber soviel suedliche Beweglichkeit und\nermutigten ihn durch Beifall und Zurufe, immer kecker und sicherer aus\nsich heraus zu gehen.\n\nAschenbach sass an der Balustrade und kuehlte zuweilen die Lippen mit\neinem Gemisch aus Granatapfelsaft und Soda, das vor ihm rubinrot im\nGlase funkelte. Seine Nerven nahmen die dudelnden Klaenge, die vulgaeren\nund schmachtenden Melodien begierig auf, denn die Leidenschaft laehmt\nden waehlerischen Sinn und laesst sich allen Ernstes mit Reizen ein,\nwelche die Nuechternheit humoristisch aufnehmen oder unwillig ablehnen\nwuerde. Seine Zuege waren durch die Spruenge des Gauklers zu einem fix\ngewordenen und schon schmerzenden Laecheln verrenkt. Er sass laessig da,\nwaehrend eine aeusserste Aufmerksamkeit sein Inneres spannte, denn sechs\nSchritte von ihm lehnte Tadzio am Steingelaender.\n\nEr stand dort in dem weissen Guertelanzug, den er zuweilen zur\nHauptmahlzeit anlegte, in unvermeidlicher und anerschaffener Grazie,\nden linken Unterarm auf der Bruestung, die Fuesse gekreuzt, die rechte\nHand in der tragenden Huefte, und blickte mit einem Ausdruck, der kaum\nein Laecheln, nur eine entfernte Neugier, ein hoefliches Entgegennehmen\nwar, zu den Baenkelsaengern hinab. Manchmal richtete er sich gerade auf\nund zog, indem er die Brust dehnte, mit einer schoenen Bewegung beider\nArme den weissen Kittel durch den Lederguertel hinunter. Manchmal aber\nauch, und der Alternde gewahrte es mit Triumph, mit einem Taumeln\nseiner Vernunft und auch mit Entsetzen, wandte er zoegernd und behutsam\noder auch rasch und ploetzlich, als gelte es eine Ueberrumpelung, den\nKopf ueber die linke Schulter gegen den Platz seines Liebhabers. Er\nfand nicht dessen Augen, denn eine schmaehliche Besorgnis zwang den\nVerwirrten, seine Blicke aengstlich im Zaum zu halten. Im Grund der\nTerrasse sassen die Frauen, die Tadzio behueteten, und es war dahin\ngekommen, dass der Verliebte fuerchten musste, auffaellig geworden und\nbeargwoehnt zu sein. Ja, mit einer Art von Erstarrung hatte er\nmehrmals, am Strande, in der Hotelhalle und auf der Piazza San Marco,\nzu bemerken gehabt, dass man Tadzio aus seiner Naehe zurueckrief, ihn von\nihm fernzuhalten bedacht war--und eine furchtbare Beleidigung daraus\nentnehmen muessen, unter der sein Stolz sich in ungekannten Qualen\nwand, und welche von sich zu weisen sein Gewissen ihn hinderte.\n\nUnterdessen hatte der Guitarrist zu eigener Begleitung ein Solo\nbegonnen, einen mehrstrophigen, eben in ganz Italien florierenden\nGassenhauer, in dessen Kehrreim seine Gesellschaft jedesmal mit\nGesang und saemtlichem Musikzeug einfiel und den er auf eine\nplastisch-dramatische Art zum Vortrag zu bringen wusste. Schmaechtig\ngebaut und auch von Antlitz mager und ausgemergelt, stand er,\nabgetrennt von den Seinen, den schaebigen Filz im Nacken, so dass ein\nWulst seines roten Haars unter der Krempe hervorquoll, in einer\nHaltung von frecher Bravour auf dem Kies und schleuderte zum Schollern\nder Saiten in eindringlichem Sprechgesang seine Spaesse zur Terrasse\nempor, indes vor produzierender Anstrengung die Adern auf seiner\nStirne schwollen. Er schien nicht venezianischen Schlages, vielmehr\nvon der Rasse der neapolitanischen Komiker, halb Zuhaelter, halb\nKomoediant, brutal und verwegen, gefaehrlich und unterhaltend. Sein\nLied, lediglich albern dem Wortlaut nach, gewann in seinem Munde,\ndurch sein Mienenspiel, seine Koerperbewegungen, seine Art, andeutend\nzu blinzeln und die Zunge schluepfrig im Mundwinkel spielen zu lassen,\netwas Zweideutiges, unbestimmt Anstoessiges. Dem weichen Kragen des\nSporthemdes, das er zu uebrigens staedtischer Kleidung trug, entwuchs\nsein hagerer Hals mit auffallend gross und nackt wirkendem Adamsapfel.\nSein bleiches, stumpfnaesiges Gesicht, aus dessen bartlosen Zuegen\nschwer auf sein Alter zu schliessen war, schien durchpfluegt von\nGrimassen und Laster, und sonderbar wollten zum Grinsen seines\nbeweglichen Mundes die beiden Furchen passen, die trotzig, herrisch,\nfast wild zwischen seinen roetlichen Brauen standen. Was jedoch des\nEinsamen tiefe Achtsamkeit eigentlich auf ihn lenkte, war die\nBemerkung, dass die verdaechtige Figur auch ihre eigene verdaechtige\nAtmosphaere mit sich zu fuehren schien. Jedesmal naemlich, wenn der\nRefrain wieder einsetzte, unternahm der Saenger unter Faxen und\ngruessendem Handschuetteln einen grotesken Rundmarsch, der ihn\nunmittelbar unter Aschenbachs Platz vorueberfuehrte, und jedesmal, wenn\ndas geschah, wehte, von seinen Kleidern, seinem Koerper ausgehend, ein\nSchwaden starken Karbolgeruchs zur Terrasse empor.\n\nNach geendigtem Couplet begann er, Geld einzuziehen. Er fing bei den\nRussen an, die man bereitwillig spenden sah, und kam dann die Stufen\nherauf. So frech er sich bei der Produktion benommen, so demuetig\nzeigte er sich hier oben. Katzbuckelnd, unter Kratzfuessen schlich er\nzwischen den Tischen umher, und ein Laecheln tueckischer Unterwuerfigkeit\nentbloesste seine starken Zaehne, waehrend doch immer noch die beiden\nFurchen drohend zwischen seinen roten Brauen standen. Man musterte das\nfremdartige, seinen Unterhalt einsammelnde Wesen mit Neugier und\neinigem Abscheu, man warf mit spitzen Fingern Muenzen in seinen Filz\nund huetete sich, ihn zu beruehren. Die Aufhebung der physischen Distanz\nzwischen dem Komoedianten und den Anstaendigen erzeugt, und war das\nVergnuegen noch so gross, stets eine gewisse Verlegenheit. Er fuehlte sie\nund suchte, sich durch Kriecherei zu entschuldigen. Er kam zu\nAschenbach und mit ihm der Geruch, ueber den niemand ringsum sich\nGedanken zu machen schien.\n\n\"Hoere!\" sagte der Einsame gedaempft und fast mechanisch. \"Man\ndesinfiziert Venedig. Warum?\"--Der Spassmacher antwortete heiser: \"Von\nwegen der Polizei! Das ist Vorschrift, mein Herr, bei solcher Hitze\nund bei Scirocco. Der Scirocco drueckt. Er ist der Gesundheit nicht\nzutraeglich...\" Er sprach wie verwundert darueber, dass man dergleichen\nfragen koenne und demonstrierte mit der flachen Hand, wie sehr der\nScirocco druecke.--\"Es ist also kein Uebel in Venedig?\" fragte\nAschenbach sehr leise und zwischen den Zaehnen.--Die muskuloesen Zuege\ndes Possenreissers fielen in eine Grimasse komischer Ratlosigkeit. \"Ein\nUebel? Aber was fuer ein Uebel? Ist der Scirocco ein Uebel? Ist\nvielleicht unsere Polizei ein Uebel? Sie belieben zu scherzen! Ein\nUebel! Warum nicht gar! Eine vorbeugende Massregel, verstehen Sie doch!\nEine polizeiliche Anordnung gegen die Wirkungen der drueckenden\nWitterung...\" Er gestikulierte.--\"Es ist gut\", sagte Aschenbach\nwiederum kurz und leise und liess rasch ein ungebuehrlich bedeutendes\nGeldstueck in den Hut fallen. Dann winkte er dem Menschen mit den\nAugen, zu gehen. Er gehorchte grinsend, unter Buecklingen; aber er\nhatte noch nicht die Treppe erreicht, als zwei Hotelangestellte sich\nauf ihn warfen und ihn, ihre Gesichter dicht an dem seinen, in ein\ngefluestertes Kreuzverhoer nahmen. Er zuckte die Achseln, er gab\nBeteuerungen, er schwor, verschwiegen gewesen zu sein; man sah es.\nEntlassen, kehrte er in den Garten zurueck, und, nach einer kurzen\nVerabredung mit den Seinen unter der Bogenlampe, trat er zu einem\nDank-und Abschiedsliede noch einmal vor.\n\nEs war ein Lied, das jemals gehoert zu haben der Einsame sich nicht\nerinnerte; ein dreister Schlager in unverstaendlichem Dialekt und\nausgestattet mit einem Lach-Refrain, in den die Bande regelmaessig aus\nvollem Halse einfiel. Es hoerten hierbei sowohl die Worte wie auch die\nBegleitung der Instrumente auf, und nichts blieb uebrig als ein\nrhythmisch irgendwie geordnetes, aber sehr natuerlich behandeltes\nLachen, das namentlich der Solist mit grossem Talent zu taeuschendster\nLebendigkeit zu gestalten wusste. Er hatte bei wiederhergestelltem\nkuenstlerischen Abstand zwischen ihm und den Herrschaften seine ganze\nFrechheit wiedergefunden, und sein Kunstlachen, unverschaemt zur\nTerrasse emporgesandt, war Hohngelaechter. Schon gegen das Ende des\nartikulierten Teiles der Strophe schien er mit einem unwiderstehlichen\nKitzel zu kaempfen. Er schluchzte, seine Stimme schwankte, er presste\ndie Hand gegen den Mund, er verzog die Schultern, und im gegebenen\nAugenblick brach, heulte und platzte das unbaendige Lachen aus ihm\nhervor, mit solcher Wahrheit, dass es ansteckend wirkte und sich den\nZuhoerern mitteilte, dass auch auf der Terrasse eine gegenstandslose und\nnur von sich selbst lebende Heiterkeit um sich griff. Dies aber eben\nschien des Saengers Ausgelassenheit zu verdoppeln. Er beugte die Knie,\ner schlug die Schenkel, er hielt sich die Seiten, er wollte sich\nausschuetten, er lachte nicht mehr, er schrie; er wies mit dem Finger\nhinauf, als gaebe es nichts Komischeres, als die lachende Gesellschaft\ndort oben, und endlich lachte dann alles im Garten und auf der\nVeranda, bis zu den Kellnern, Liftboys und Hausdienern in den Tueren.\n\nAschenbach ruhte nicht mehr im Stuhl, er sass aufgerichtet wie zum\nVersuche der Abwehr oder der Flucht. Aber das Gelaechter, der\nheraufwehende Hospitalgeruch und die Naehe des Schoenen verwoben sich\nihm zu einem Traumbann, der unzerreissbar und unentrinnbar sein Haupt,\nseinen Sinn umfangen hielt. In der allgemeinen Bewegung und\nZerstreuung wagte er es, zu Tadzio hinueberzublicken, und indem er es\ntat, durfte er bemerken, dass der Schoene, in Erwiderung seines Blickes\nebenfalls ernst blieb, ganz so, als richte er Verhalten und Miene nach\nder des Anderen und als vermoege die allgemeine Stimmung nichts ueber\nihn, da jener sich ihr entzog. Diese kindliche und beziehungsvolle\nFolgsamkeit hatte etwas so Entwaffnendes, Ueberwaeltigendes, dass der\nGrauhaarige sich mit Muehe enthielt, sein Gesicht in den Haenden zu\nverbergen. Auch hatte es ihm geschienen, als bedeute Tadzios\ngelegentliches Sichaufrichten und Aufatmen ein Seufzen, eine\nBeklemmung der Brust. \"Er ist kraenklich, er wird wahrscheinlich nicht\nalt werden\", dachte er wiederum mit jener Sachlichkeit, zu welcher\nRausch und Sehnsucht bisweilen sich sonderbar emanzipieren, und reine\nFuersorge zugleich mit einer ausschweifenden Genugtuung erfuellte sein\nHerz.\n\nDie Venezianer unterdessen hatten geendigt und zogen ab. Beifall\nbegleitete sie, und ihr Anfuehrer versaeumte nicht, noch seinen Abgang\nmit Spassen auszuschmuecken. Seine Kratzfuesse, seine Kusshaende wurden\nbelacht, und er verdoppelte sie daher. Als die Seinen schon draussen\nwaren, tat er noch, als renne er rueckwaerts empfindlich gegen einen\nLampenmast und schlich scheinbar krumm vor Schmerzen zur Pforte. Dort\nendlich warf er auf einmal die Maske des komischen Pechvogels ab,\nrichtete sich, ja schnellte elastisch auf, bleckte den Gaesten auf der\nTerrasse frech die Zunge heraus und schluepfte ins Dunkel. Die\nBadegesellschaft verlor sich; Tadzio stand laengst nicht mehr an der\nBalustrade. Aber der Einsame sass noch lange, zum Befremden der\nKellner, bei dem Rest seines Granatapfelgetraenkes an seinem Tischchen.\nDie Nacht schritt vor, die Zeit zerfiel. Im Hause seiner Eltern, vor\nvielen Jahren, hatte es eine Sanduhr gegeben,--er sah das gebrechliche\nund bedeutende Geraetchen auf einmal wieder, als stuende es vor ihm.\nLautlos und fein rann der rostrot gefaerbte Sand durch die glaeserne\nEnge, und da er in der oberen Hoehlung zur Neige ging, hatte sich dort\nein kleiner, reissender Strudel gebildet.\n\nSchon am folgenden Tage, nachmittags, tat der Starrsinnige einen neuen\nSchritt zur Versuchung der Aussenwelt und diesmal mit allem moeglichen\nErfolge. Er trat naemlich vom Markusplatz in das dort gelegene\nenglische Reisebureau, und nachdem er an der Kasse einiges Geld\ngewechselt, richtete er mit der Miene des misstrauischen Fremden an den\nihn bedienenden Clerk seine fatale Frage. Es war ein wollig\ngekleideter Brite, noch jung, mit in der Mitte geteiltem Haar, nahe\nbei einander liegenden Augen und von jener gesetzten Loyalitaet des\nWesens, die im spitzbuebisch behenden Sueden so fremd, so merkwuerdig\nanmutet. Er fing an: \"Kein Grund zur Besorgnis, Sir. Eine Massregel\nohne ernste Bedeutung. Solche Anordnungen werden haeufig getroffen,\num gesundheitsschaedlichen Wirkungen der Hitze und des Scirocco\nvorzubeugen...\" Aber seine blauen Augen aufschlagend, begegnete er dem\nBlicke des Fremden, einem mueden und etwas traurigen Blick, der mit\nleichter Verachtung auf seine Lippen gerichtet war. Da erroetete der\nEnglaender. \"Dies ist\", fuhr er halblaut und in einiger Bewegung fort,\n\"die amtliche Erklaerung, auf der zu bestehen man hier fuer gut\nbefindet. Ich werde Ihnen sagen, dass noch etwas anderes dahinter\nsteckt.\" Und dann sagte er in seiner redlichen und bequemen Sprache\ndie Wahrheit.\n\nSeit mehreren Jahren schon hatte die indische Cholera eine verstaerkte\nNeigung zur Ausbreitung und Wanderung an den Tag gelegt. Erzeugt aus\nden warmen Moraesten des Ganges-Deltas, aufgestiegen mit dem\nmephitischen Odem jener ueppig-untauglichen, von Menschen gemiedenen\nUrwelt-und Inselwildnis, in deren Bambusdickichten der Tiger kauert,\nhatte die Seuche in ganz Hindustan andauernd und ungewoehnlich heftig\ngewuetet, hatte oestlich nach China, westlich nach Afghanistan und\nPersien uebergegriffen und, den Hauptstrassen des Karawanenverkehrs\nfolgend, ihre Schrecken bis Astrachan, ja selbst bis Moskau getragen.\nAber waehrend Europa zitterte, das Gespenst moechte von dort aus und zu\nLande seinen Einzug halten, war es, von syrischen Kauffahrern uebers\nMeer verschleppt, fast gleichzeitig in mehreren Mittelmeerhaefen\naufgetaucht, hatte in Toulon und Malaga sein Haupt erhoben, in Palermo\nund Neapel mehrfach seine Maske gezeigt und schien aus ganz Calabrien\nund Apulien nicht mehr weichen zu wollen. Der Norden der Halbinsel war\nverschont geblieben. Jedoch Mitte Mai dieses Jahres fand man zu\nVenedig an ein und demselben Tage die furchtbaren Vibrionen in den\nausgemergelten, schwaerzlichen Leichnamen eines Schifferknechtes und\neiner Gruenwarenhaendlerin. Die Faelle wurden verheimlicht. Aber nach\neiner Woche waren es deren zehn, waren es zwanzig, dreissig und zwar in\nverschiedenen Quartieren. Ein Mann aus der oesterreichischen Provinz,\nder sich zu seinem Vergnuegen einige Tage in Venedig aufgehalten,\nstarb, in sein Heimatstaedtchen zurueckgekehrt, unter unzweideutigen\nAnzeichen, und so kam es, dass die ersten Geruechte von der Heimsuchung\nder Lagunenstadt in deutsche Tagesblaetter gelangten. Venedigs\nObrigkeit liess antworten, dass die Gesundheitsverhaeltnisse der Stadt\nnie besser gewesen seien und traf die notwendigsten Massregeln zur\nBekaempfung. Aber wahrscheinlich waren Nahrungsmittel infiziert worden.\nGemuese, Fleisch oder Milch, denn geleugnet und vertuscht, frass das\nSterben in der Enge der Gaesschen um sich, und die vorzeitig\neingefallene Sommerhitze, welche das Wasser der Kanaele laulich\nerwaermte, war der Verbreitung besonders guenstig. Ja, es schien, als ob\ndie Seuche eine Neubelebung ihrer Kraefte erfahren, als ob die\nTenazitaet und Fruchtbarkeit ihrer Erreger sich verdoppelt haette. Faelle\nder Genesung waren sehr selten; achtzig vom Hundert der Befallenen\nstarben und zwar auf entsetzliche Weise, denn das Uebel trat mit\naeusserster Wildheit auf und zeigte haeufig jene gefaehrlichste Form,\nwelche \"die trockene\" benannt ist. Hierbei vermochte der Koerper das\naus den Blutgefaessen massenhaft abgesonderte Wasser nicht einmal\nauszutreiben. Binnen wenigen Stunden verdorrte der Kranke und\nerstickte am pechartig zaehe gewordenen Blut unter Kraempfen und\nheiseren Klagen. Wohl ihm, wenn, was zuweilen geschah, der Ausbruch\nnach leichtem Uebelbefinden in Gestalt einer tiefen Ohnmacht erfolgte,\naus der er nicht mehr oder kaum noch erwachte. Anfang Juni fuellten\nsich in der Stille die Isolierbaracken des Ospedale civico, in den\nbeiden Waisenhaeusern begann es an Platz zu mangeln, und ein\nschauerlich reger Verkehr herrschte zwischen dem Kai der neuen\nFundamente und San Michele, der Friedhofsinsel. Aber die Furcht vor\nallgemeiner Schaedigung, die Ruecksicht auf die kuerzlich eroeffnete\nGemaeldeausstellung in den oeffentlichen Gaerten, auf die gewaltigen\nAusfaelle, von denen im Falle der Panik und des Verrufes die Hotels,\ndie Geschaefte, das ganze vielfaeltige Fremdengewerbe bedroht waren,\nzeigte sich maechtiger in der Stadt als Wahrheitsliebe und Achtung vor\ninternationalen Abmachungen; sie vermochte die Behoerde, ihre Politik\ndes Verschweigens und des Ableugnens hartnaeckig aufrecht zu erhalten.\nDer oberste Medizinalbeamte Venedigs, ein verdienter Mann, war\nentruestet von seinem Posten zurueckgetreten und unter der Hand durch\neine gefuegigere Persoenlichkeit ersetzt worden. Das Volk wusste das; und\ndie Korruption der Oberen zusammen mit der herrschenden Unsicherheit,\ndem Ausnahmezustand, in welchen der umgehende Tod die Stadt versetzte,\nbrachte eine gewisse Entsittlichung der unteren Schichten hervor, eine\nErmutigung lichtscheuer und antisozialer Triebe, die sich in\nUnmaessigkeit, Schamlosigkeit und wachsender Kriminalitaet bekundete.\nGegen die Regel bemerkte man abends viele Betrunkene; boesartiges\nGesindel machte, so hiess es, nachts die Strassen unsicher; raeuberische\nAnfaelle und selbst Mordtaten wiederholten sich, denn schon zweimal\nhatte sich erwiesen, dass angeblich der Seuche zum Opfer gefallene\nPersonen vielmehr von ihren eigenen Anverwandten mit Gift aus dem\nLeben geraeumt worden waren; und die gewerbsmaessige Liederlichkeit nahm\naufdringliche und ausschweifende Formen an, wie sie sonst hier nicht\nbekannt und nur im Sueden des Landes und im Orient zu Hause gewesen\nwaren.\n\nVon diesen Dingen sprach der Englaender das Entscheidende aus. \"Sie\ntaeten gut\", schloss er, \"lieber heute als morgen zu reisen. Laenger, als\nein paar Tage noch, kann die Verhaengung der Sperre kaum auf sich\nwarten lassen.\"--\"Danke Ihnen\", sagte Aschenbach und verliess das Amt.\n\nDer Platz lag in sonnenloser Schwuele. Unwissende Fremde sassen vor den\nCafes oder standen, ganz von Tauben bedeckt, vor der Kirche und sahen\nzu, wie die Tiere, wimmelnd, fluegelschlagend, einander verdraengend,\nnach den in hohlen Haenden dargebotenen Maiskoernern pickten. In\nfiebriger Erregung, triumphierend im Besitze der Wahrheit, einen\nGeschmack von Ekel dabei auf der Zunge und ein phantastisches Grauen\nim Herzen, schritt der Einsame die Fliesen des Prachthofes auf und\nnieder. Er erwog eine reinigende und anstaendige Handlung. Er konnte\nheute Abend nach dem Diner der perlengeschmueckten Frau sich naehern und\nzu ihr sprechen, was er woertlich entwarf: \"Gestatten Sie dem Fremden,\nMadame, Ihnen mit einem Rat, einer Warnung zu dienen, die der\nEigennutz Ihnen vorenthaelt. Reisen Sie ab, sogleich, mit Tadzio und\nIhren Toechtern! Venedig ist verseucht.\" Er konnte dann dem Werkzeug\neiner hoehnischen Gottheit zum Abschied die Hand aufs Haupt legen, sich\nwegwenden und diesem Sumpfe entfliehen. Aber er fuehlte zugleich, dass\ner unendlich weit entfernt war, einen solchen Schritt im Ernste zu\nwollen. Er wuerde ihn zurueckfuehren, wuerde ihn sich selber wiedergeben;\naber wer ausser sich ist, verabscheut nichts mehr, als wieder in sich\nzu gehen. Er erinnerte sich eines weissen Bauwerks, geschmueckt mit\nabendlich gleissenden Inschriften, in deren durchscheinender Mystik das\nAuge seines Geistes sich verloren hatte; jener seltsamen\nWandrergestalt sodann, die dem Alternden schweifende\nJuenglingssehnsucht ins Weite und Fremde erweckt hatte; und der Gedanke\nan Heimkehr, an Besonnenheit, Nuechternheit, Muehsal und Meisterschaft,\nwiderte ihn in solchem Masse, dass sein Gesicht sich zum Ausdruck\nphysischer Uebelkeit verzerrte. \"Man soll schweigen!\" fluesterte er\nheftig. Und: \"Ich werde schweigen!\" Das Bewusstsein seiner\nMitwisserschaft, seiner Mitschuld berauschte ihn, wie geringe Mengen\nWeines ein muedes Hirn berauschen. Das Bild der heimgesuchten und\nverwahrlosten Stadt, wuest seinem Geiste vorschwebend, entzuendete in\nihm Hoffnungen, unsagbar, die Vernunft ueberschreitend, und von\nungeheuerlicher Suessigkeit. Was war ihm das zarte Glueck, von dem er\nvorhin einen Augenblick getraeumt, verglichen mit diesen Erwartungen?\nWas galt ihm noch Kunst und Tugend gegenueber den Vorteilen des Chaos?\nEr schwieg und blieb.\n\nIn dieser Nacht hatte er einen furchtbaren Traum,--wenn man als Traum\nein koerperhaft-geistiges Erlebnis bezeichnen kann, das ihm zwar im\ntiefsten Schlaf und in voelligster Unabhaengigkeit und sinnlicher\nGegenwart widerfuhr, aber ohne dass er sich ausser den Geschehnissen im\nRaume wandelnd und anwesend sah; sondern ihr Schauplatz war vielmehr\nseine Seele selbst, und sie brachen von aussen herein, seinen\nWiderstand--einen tiefen und geistigen Widerstand--gewalttaetig\nniederwerfend, gingen hindurch und liessen seine Existenz, liessen die\nKultur seines Lebens verheert, vernichtet zurueck.\n\nAngst war der Anfang, Angst und Lust und eine entsetzte Neugier nach\ndem, was kommen wollte. Nacht herrschte, und seine Sinne lauschten;\ndenn weither naeherte sich Getuemmel, Getoese, ein Gemisch von Laerm:\nRasseln, Schmettern und dumpfes Donnern, schrilles Jauchzen dazu und\nein bestimmtes Geheul im gezogenen u-Laut, alles durchsetzt und\ngrauenhaft suess uebertoent von tief girrendem, ruchlos beharrlichen\nFloetenspiel, welches auf schamlos zudringende Art die Eingeweide\nbezauberte. Aber er wusste ein Wort, dunkel, doch das benennend was\nkam: \"_Der fremde Gott!_\" Qualmige Glut glomm auf: da erkannte er\nBergland, aehnlich dem um sein Sommerhaus. Und in zerrissenem Licht,\nvon bewaldeter Hoehe, zwischen Staemmen und moosigen Felstruemmern waelzte\nes sich und stuerzte wirbelnd herab: Menschen, Tiere, ein Schwarm, eine\ntobende Rotte, und ueberschwemmte die Halde mit Leibern, Flammen,\nTumult und taumelndem Rundtanz. Weiber, strauchelnd ueber zu\nlange Fellgewaender, die ihnen vom Guertel hingen, schuettelten\nSchellentrommeln ueber ihren stoehnend zurueckgeworfenen Haeuptern,\nschwangen stiebende Fackelbraende und nackte Dolche, hielten zuengelnde\nSchlangen in der Mitte des Leibes erfasst oder trugen schreiend ihre\nBrueste in beiden Haenden. Maenner, Hoerner ueber den Stirnen, mit Pelzwerk\ngeschuerzt und zottig von Haut, beugten die Nacken und hoben Arme und\nSchenkel, liessen eherne Becken erdroehnen und schlugen wuetend auf\nPauken, waehrend glatte Knaben mit umlaubten Staeben Boecke stachelten,\nan deren Hoerner sie sich klammerten und von deren Spruengen sie sich\njauchzend schleifen liessen. Und die Begeisterten heulten den Ruf aus\nweichen Mitlauten und gezogenem u-Ruf am Ende, suess und wild zugleich,\nwie kein jemals erhoerter: hier klang er auf, in die Luefte geroehrt, wie\nvon Hirschen, und dort gab man ihn wieder, vielstimmig, in wuestem\nTriumph, hetzte einander damit zum Tanz und Schleudern der Glieder und\nliess ihn niemals verstummen. Aber alles durchdrang und beherrschte der\ntiefe, lockende Floetenton. Lockte er nicht auch ihn, den widerstrebend\nErlebenden, schamlos beharrlich zum Fest und Unmass des aeussersten\nOpfers? Gross war sein Abscheu, gross seine Furcht, redlich sein Wille,\nbis zuletzt das Seine zu schuetzen gegen den Fremden, den Feind des\ngefassten und wuerdigen Geistes. Aber der Laerm, das Geheul, vervielfacht\nvon hallender Bergwand, wuchs, nahm Ueberhand, schwoll zu hinreissendem\nWahnsinn. Duenste bedraengten den Sinn, der beizende Ruch der Boecke,\nWitterung keuchender Leiber und ein Hauch wie von faulenden Wassern,\ndazu ein anderer noch, vertraut: nach Wunden und umlaufender\nKrankheit. Mit den Paukenschlaegen droehnte sein Herz, sein Gehirn\nkreiste, Wut ergriff ihn, Verblendung, betaeubende Wollust, und seine\nSeele begehrte, sich anzuschliessen dem Reigen des Gottes. Das obszoene\nSymbol, riesig, aus Holz, ward enthuellt und erhoeht: da heulten sie\nzuegelloser die Losung. Schaum vor den Lippen tobten sie, reizten\neinander mit geilen Gebaerden und buhlenden Haenden, lachend und\naechzend,--stiessen die Stachelstaebe einander ins Fleisch und leckten\ndas Blut von den Gliedern. Aber mit ihnen, in ihnen war der Traeumende\nnun und dem fremden Gotte gehoerig. Ja, sie waren er selbst, als sie\nreissend und mordend sich auf die Tiere hinwarfen und dampfende Fetzen\nverschlangen, als auf zerwuehltem Moosgrund grenzenlose Vermischung\nbegann, dem Gotte zum Opfer. Und seine Seele kostete Unzucht und\nRaserei des Unterganges.\n\nAus diesem Traum erwachte der Heimgesuchte entnervt, zerruettet und\nkraftlos dem Daemon verfallen. Er scheute nicht mehr die beobachtenden\nBlicke der Menschen; ob er sich ihrem Verdacht aussetze, kuemmerte\nihn nicht. Auch flohen sie ja, reisten ab; zahlreiche Strandhuetten\nstanden leer, die Besetzung des Speisesaals wies groessere Luecken auf,\nund in der Stadt sah man selten noch einen Fremden. Die Wahrheit\nschien durchgesickert, die Panik, trotz zaehen Zusammenhaltens der\nInteressenten, nicht laenger hintanzuhalten. Aber die Frau im\nPerlenschmuck blieb mit den Ihren, sei es, weil die Geruechte nicht zu\nihr drangen, oder weil sie zu stolz und furchtlos war, um ihnen zu\nweichen: Tadzio blieb; und jenem, in seiner Umfangenheit, war es\nzuweilen, als koenne Flucht und Tod alles stoerende Leben in der Runde\nentfernen und er allein mit dem Schoenen auf dieser Insel\nzurueckbleiben,--ja, wenn vormittags am Meere sein Blick schwer,\nunverantwortlich, unverwandt auf dem Begehrten ruhte, wenn er bei\nsinkendem Tage durch Gassen, in denen verheimlichterweise das ekle\nSterben umging, ihm unwuerdig nachfolgte, so schien das Ungeheuerliche\nihm aussichtsreich und hinfaellig das Sittengesetz.\n\nWie irgend ein Liebender wuenschte er, zu gefallen und empfand bittere\nAngst, dass es nicht moeglich sein moechte. Er fuegte seinem Anzuege\njugendlich aufheiternde Einzelheiten hinzu, er legte Edelsteine an und\nbenutzte Parfuems, er brauchte mehrmals am Tage viel Zeit fuer seine\nToilette und kam geschmueckt, erregt und gespannt zu Tische. Angesichts\nder suessen Jugend, die es ihm angetan, ekelte ihn sein alternder Leib,\nder Anblick seines grauen Haares, seiner scharfen Gesichtszuege stuerzte\nihn in Scham und Hoffnungslosigkeit. Es trieb ihn, sich koerperlich zu\nerquicken und wiederherzustellen; er besuchte haeufig den Coiffeur des\nHauses.\n\nIm Frisiermantel, unter den pflegenden Haenden des Schwaetzers im Stuhle\nzurueckgelehnt, betrachtete er gequaelten Blickes sein Spiegelbild.\n\n\"Grau\", sagte er mit verzerrtem Munde.\n\n\"Ein wenig\", antwortete der Mensch. \"Naemlich durch Schuld einer\nkleinen Vernachlaessigung, einer Indifferenz in aeusserlichen Dingen,\ndie bei bedeutenden Personen begreiflich ist, die man aber doch\nnicht unbedingt loben kann und zwar umso weniger, als gerade solchen\nPersonen Vorurteile in Sachen des Natuerlichen oder Kuenstlichen wenig\nangemessen sind. Wuerde sich die Sittenstrenge gewisser Leute gegenueber\nder kosmetischen Kunst logischerweise auch auf ihre Zaehne erstrecken,\nso wuerden sie nicht wenig Anstoss erregen. Schliesslich sind wir so alt,\nwie unser Geist, unser Herz sich fuehlen, und graues Haar bedeutet\nunter Umstaenden eine wirklichere Unwahrheit, als die verschmaehte\nKorrektur bedeuten wuerde. In Ihrem Falle, mein Herr, hat man ein Recht\nauf seine natuerliche Haarfarbe. Sie erlauben mir, Ihnen die Ihrige\neinfach zurueckzugeben?\"\n\n\"Wie das?\" fragte Aschenbach.\n\nDa wusch der Beredte das Haar des Gastes mit zweierlei Wasser, einem\nklaren und einem dunklen, und es war schwarz wie in jungen Jahren. Er\nbog es hierauf mit der Brennscheere in weiche Lagen, trat rueckwaerts\nund musterte das behandelte Haupt.\n\n\"Es waere nun nur noch\", sagte er, \"die Gesichtshaut ein wenig\naufzufrischen.\"\n\nUnd wie jemand, der nicht enden, sich nicht genug tun kann, ging er\nmit immer neu belebter Geschaeftigkeit von einer Hantierung zur anderen\nueber. Aschenbach, bequem ruhend, der Abwehr nicht faehig, hoffnungsvoll\nerregt vielmehr von dem, was geschah, sah im Glase seine Brauen sich\nentschiedener und ebenmaessiger woelben, den Schnitt seiner Augen sich\nverlaengern, ihren Glanz durch eine leichte Untermalung des Lides sich\nheben, sah weiter unten, wo die Haut braeunlich-ledern gewesen, weich\naufgetragen, ein zartes Karmin erwachen, seine Lippen, blutarm soeben\nnoch, himbeerfarben schwellen, die Furchen der Wangen, des Mundes, die\nRunzeln der Augen unter Creme und Jugendhauch verschwinden,--erblickte\nmit Herzklopfen einen bluehenden Juengling. Der Kosmetiker gab sich\nendlich zufrieden, indem er nach Art solcher Leute dem, den er bedient\nhatte, mit kriechender Hoeflichkeit dankte. \"Eine unbedeutende\nNachhilfe\", sagte er, indem er eine letzte Hand an Aschenbachs Aeusseres\nlegte. \"Nun kann der Herr sich unbedenklich verlieben.\" Der Berueckte\nging, traumgluecklich, verwirrt und furchtsam. Seine Krawatte war rot,\nsein breitschattender Strohhut mit einem mehrfarbigen Bande umwunden.\n\nLauwarmer Sturmwind war aufgekommen; es regnete selten und spaerlich,\naber die Luft war feucht, dick und von Faeulnisduensten erfuellt.\nFlattern, Klatschen und Sausen umgab das Gehoer, und dem unter der\nSchminke Fiebernden schienen Windgeister ueblen Geschlechts im Raume\nihr Wesen zu treiben, unholdes Gevoegel des Meeres, das des\nVerurteilten Mahl zerwuehlt, zernagt und mit Unrat schaendet. Denn die\nSchwuele wehrte der Esslust, und die Vorstellung draengte sich auf, dass\ndie Speisen mit Ansteckungsstoffen vergiftet seien.\n\nAuf den Spuren des Schoenen hatte Aschenbach sich eines Nachmittags in\ndas innere Gewirr der kranken Stadt vertieft. Mit versagendem\nOrtssinn, da die Gaesschen, Gewaesser, Bruecken und Plaetzchen des\nLabyrinthes zu sehr einander gleichen, auch der Himmelsgegenden nicht\nmehr sicher, war er durchaus darauf bedacht, das sehnlich verfolgte\nBild nicht aus den Augen zu verlieren, und zu schmaehlicher\nBehutsamkeit genoetigt, an Mauern gedrueckt, hinter dem Ruecken\nVorangehender Schutz suchend, ward er sich lange nicht der Muedigkeit,\nder Erschoepfung bewusst, welche Gefuehl und immerwaehrende Spannung\nseinem Koerper, seinem Geiste zugefuegt hatten. Tadzio ging hinter den\nSeinen, er liess der Pflegerin und den nonnenaehnlichen Schwestern in\nder Enge gewoehnlich den Vortritt, und einzeln schlendernd wandte er\nzuweilen das Haupt, um sich ueber die Schulter hinweg der Gefolgschaft\nseines Liebhabers mit einem Blick seiner eigentuemlich daemmergrauen\nAugen zu versichern. Er sah ihn, und er verriet ihn nicht. Berauscht\nvon dieser Erkenntnis, von diesen Augen vorwaerts gelockt, am\nNarrenseile geleitet von der Passion, stahl der Verliebte sich seiner\nunziemlichen Hoffnung nach--und sah sich schliesslich dennoch um ihren\nAnblick betrogen. Die Polen hatten eine kurz gewoelbte Bruecke\nueberschritten, die Hoehe des Bogens verbarg sie dem Nachfolgenden, und\nseinerseits hinaufgelangt, entdeckte er sie nicht mehr. Er forschte\nnach ihnen in drei Richtungen, geradeaus und nach beiden Seiten den\nschmalen und schmutzigen Quai entlang, vergebens. Entnervung,\nHinfaelligkeit noetigten ihn endlich, vom Suchen abzulassen.\n\nSein Kopf brannte, sein Koerper war mit klebrigem Schweiss bedeckt, sein\nGenick zitterte, ein nicht mehr ertraeglicher Durst peinigte ihn, er\nsah sich nach irgendwelcher, nach augenblicklicher Labung um. Vor\neinem kleinen Gemueseladen kaufte er einige Fruechte, Erdbeeren,\nueberreife und weiche Ware und ass im Gehen davon. Ein kleiner Platz,\nverlassen, verwunschen anmutend, oeffnete sich vor ihm, er erkannte\nihn, es war hier gewesen, wo er vor Wochen den vereitelten Fluchtplan\ngefasst hatte. Auf den Stufen der Zisterne, inmitten des Ortes, liess er\nsich niedersinken und lehnte den Kopf an das steinerne Rund. Es war\nstill, Gras wuchs zwischen dem Pflaster. Abfaelle lagen umher. Unter\nden verwitterten, unregelmaessig hohen Haeusern in der Runde erschien\neines palastartig, mit Spitzbogenfenstern, hinter denen die Leere\nwohnte, und kleinen Loewenbalkonen. Im Erdgeschoss eines anderen befand\nsich eine Apotheke. Warme Windstoesse brachten zuweilen Karbolgeruch.\n\nEr sass dort, der Meister, der wuerdig gewordene Kuenstler, der Autor des\n\"Elenden\", der in so vorbildlich reiner Form dem Zigeunertum und der\ntrueben Tiefe abgesagt, dem Abgrunde die Sympathie gekuendigt und das\nVerworfene verworfen hatte, der Hochgestiegene, der, Ueberwinder seines\nWissens und aller Ironie entwachsen, in die Verbindlichkeiten des\nMassenzutrauens sich gewoehnt hatte, er, dessen Ruhm amtlich, dessen\nName geadelt war und an dessen Styl die Knaben sich zu bilden\nangehalten wurden,--er sass dort, seine Lider waren geschlossen, nur\nzuweilen glitt, rasch sich wieder verbergend, ein spoettischer und\nbetretener Blick seitlich darunter hervor, und seine schlaffen Lippen,\nkosmetisch aufgehoeht, bildeten einzelne Worte aus von dem, was sein\nhalb schlummerndes Hirn an seltsamer Traumlogik hervorbrachte.\n\n\"Denn die Schoenheit, Phaidros, merke das wohl! nur die Schoenheit ist\ngoettlich und sichtbar zugleich, und so ist sie denn also des\nSinnlichen Weg, ist, kleiner Phaidros, der Weg des Kuenstlers zum\nGeiste. Glaubst du nun aber, mein Lieber, dass derjenige jemals\nWeisheit und wahre Manneswuerde gewinnen koenne, fuer den der Weg zum\nGeistigen durch die Sinne fuehrt? Oder glaubst du vielmehr (ich stelle\ndir die Entscheidung frei), dass dies ein gefaehrlich-lieblicher Weg\nsei, wahrhaft ein Irr-und Suendenweg, der mit Notwendigkeit in die Irre\nleitet? Denn du musst wissen, dass wir Dichter den Weg der Schoenheit\nnicht gehen koennen, ohne dass Eros sich zugesellt und sich zum Fuehrer\naufwirft; ja, moegen wir auch Helden auf unsere Art und zuechtige\nKriegsleute sein, so sind wir wie Weiber, denn Leidenschaft ist unsere\nErhebung, und unsere Sehnsucht muss Liebe bleiben,--das ist unsere Lust\nund unsere Schande. Siehst du nun wohl, dass wir Dichter nicht weise\nnoch wuerdig sein koennen? Dass wir notwendig in die Irre gehen,\nnotwendig liederlich und Abenteurer des Gefuehles bleiben? Die\nMeisterhaltung unseres Styls ist Luege und Narrentum, unser Ruhm und\nEhrenstand eine Posse, das Vertrauen der Menge zu uns hoechst\nlaecherlich, Volks-und Jugenderziehung durch die Kunst ein gewagtes, zu\nverbietendes Unternehmen. Denn wie sollte wohl der zum Erzieher\ntaugen, dem eine unverbesserliche und natuerliche Richtung zum Abgrunde\neingeboren ist? Wir moechten ihn wohl verleugnen und Wuerde gewinnen,\naber wie wir uns auch wenden moegen, er zieht uns an. So sagen wir etwa\nder aufloesenden Erkenntnis ab, denn die Erkenntnis, Phaidros, hat\nkeine Wuerde und Strenge: sie ist wissend, verstehend, verzeihend, ohne\nHaltung und Form; sie hat Sympathie mit dem Abgrund, sie ist der\nAbgrund. Diese also verwerfen wir mit Entschlossenheit, und fortan\ngilt unser Trachten einzig der Schoenheit, das will sagen der\nEinfachheit, Groesse und neuen Strenge, der zweiten Unbefangenheit und\nder Form. Aber Form und Unbefangenheit, Phaidros, fuehren zum Rausch\nund zur Begierde, fuehren den Edlen vielleicht zu grauenhaftem\nGefuehlsfrevel, den seine eigene schoene Strenge als infam verwirft,\nfuehren zum Abgrund, zum Abgrund auch sie. Uns Dichter, sage ich,\nfuehren sie dahin, denn wir vermoegen nicht, uns aufzuschwingen, wir\nvermoegen nur auszuschweifen. Und nun gehe ich, Phaidros, bleibe du\nhier; und erst wenn du mich nicht mehr siehst, so gehe auch du.\"\n\n       *       *       *       *       *\n\nEinige Tage spaeter verliess Gustav von Aschenbach, da er sich leidend\nfuehlte, das Baeder-Hotel zu spaeterer Morgenstunde als gewoehnlich. Er\nhatte mit gewissen, nur halb koerperlichen Schwindelanfaellen zu\nkaempfen, die von einer heftig aufsteigenden Angst und Ratlosigkeit\nbegleitet waren, einem Gefuehl der Ausweg-und Aussichtslosigkeit, von\ndem nicht klar wurde, ob es sich auf die aeussere Welt oder auf seine\neigene Existenz bezog. In der Halle bemerkte er eine grosse Menge zum\nTransport bereitliegenden Gepaecks, fragte einen Tuerhueter, wer es sei,\nder reise, und erhielt zur Antwort den polnischen Adelsnamen, dessen\ner insgeheim gewaertig gewesen war. Er empfing ihn, ohne dass seine\nverfallenen Gesichtszuege sich veraendert haetten, mit jener kurzen\nHebung des Kopfes, mit der man etwas, was man nicht zu wissen\nbrauchte, beilaeufig zur Kenntnis nimmt, und fragte noch: \"Wann?\" Man\nantwortete ihm: \"Nach dem Lunch.\" Er nickte und ging zum Meere.\n\nEs war unwirtlich dort. Ueber das weite, flache Gewaesser, das den\nStrand von der ersten gestreckten Sandbank trennte, liefen kraeuselnde\nSchauer von vorn nach hinten. Herbstlichkeit, Ueberlebtheit schien ueber\ndem einst so farbig belebten, nun fast verlassenen Lustorte zu liegen,\ndessen Sand nicht mehr reinlich gehalten wurde. Ein photographischer\nApparat, scheinbar herrenlos, stand auf seinem dreibeinigen Stativ am\nRande der See, und ein schwarzes Tuch, darueber gebreitet, flatterte\nklatschend im kaelteren Winde.\n\nTadzio, mit drei oder vier Gespielen, die ihm geblieben waren, bewegte\nsich zur Rechten vor der Huette der Seinen, und, eine Decke ueber den\nKnieen, etwa in der Mitte zwischen dem Meer und der Reihe der\nStrandhuetten in seinem Liegestuhl ruhend, sah Aschenbach ihm noch\neinmal zu. Das Spiel, das unbeaufsichtigt war, denn die Frauen mochten\nmit Reisevorbereitungen beschaeftigt sein, schien regellos und artete\naus. Jener Staemmige, im Guertelanzug und mit schwarzem, pomadisiertem\nHaar, der \"Jaschu\" gerufen wurde, durch einen Sandwurf ins Gesicht\ngereizt und geblendet, zwang Tadzio zum Ringkampf, der rasch mit dem\nFall des schwaecheren Schoenen endete. Aber als ob in der\nAbschiedsstunde das dienende Gefuehl des Geringeren sich in grausame\nRoheit verkehre und fuer eine lange Sklaverei Rache zu nehmen trachte,\nliess der Sieger auch dann noch nicht von dem Unterlegenen ab, sondern\ndrueckte, auf seinem Ruecken knieend, dessen Gesicht so anhaltend in den\nSand, dass Tadzio, ohnedies vom Kampf ausser Atem, zu ersticken drohte.\nSeine Versuche, den Lastenden abzuschuetteln, waren krampfhaft, sie\nunterblieben auf Augenblicke ganz und wiederholten sich nur noch als\nein Zucken. Entsetzt wollte Aschenbach zur Rettung aufspringen, als\nder Gewalttaetige endlich sein Opfer freigab. Tadzio, sehr bleich,\nrichtete sich zur Haelfte auf und sass, auf einen Arm gestuetzt, mehrere\nMinuten lang unbeweglich, mit verwirrtem Haar und dunkelnden Augen.\nDann stand er vollends auf und entfernte sich langsam. Man rief ihn,\nanfaenglich munter, dann baenglich und bittend; er hoerte nicht. Der\nSchwarze, den Reue ueber seine Ausschreitung sogleich erfasst haben\nmochte, holte ihn ein und suchte ihn zu versoehnen. Eine\nSchulterbewegung wies ihn zurueck. Tadzio ging schraeg hinunter zum\nWasser. Er war barfuss und trug seinen gestreiften Leinenanzug mit\nroter Schleife.\n\nAm Rande der Flut verweilte er sich, gesenkten Hauptes mit einer\nFussspitze Figuren im feuchten Sande zeichnend, und ging dann in die\nseichte Vorsee, die an ihrer tiefsten Stelle noch nicht seine Knie\nbenetzte, durchschritt sie, laessig vordringend, und gelangte zur\nSandbank. Dort stand er einen Augenblick, das Gesicht der Weite\nzugekehrt, und begann hierauf, die lange und schmale Strecke\nentbloessten Grundes nach links hin langsam abzuschreiten. Vom\nFestlande geschieden durch breite Wasser, geschieden von den\nGenossen durch stolze Laune, wandelte er, eine hoechst abgesonderte\nund verbindungslose Erscheinung, mit flatterndem Haar dort draussen\nim Meere, im Winde, vorm Nebelhaft-Grenzenlosen. Abermals blieb er\nzur Ausschau stehen. Und ploetzlich, wie unter einer Erinnerung, einem\nImpuls, wandte er den Oberkoerper, eine Hand in der Huefte, in schoener\nDrehung aus seiner Grundpositur und blickte ueber die Schulter zum\nUfer. Der Schauende dort sass wie er einst gesessen, als zuerst, von\njener Schwelle zurueckgesandt, dieser daemmergraue Blick dem seinen\nbegegnet war. Sein Haupt war an der Lehne des Stuhles langsam der\nBewegung des draussen Schreitenden gefolgt; nun hob es sich, gleichsam\ndem Blicke entgegen, und sank auf die Brust, so dass seine Augen von\nunten sahen, indes sein Antlitz den schlaffen, innig versunkenen\nAusdruck tiefen Schlummers zeigte. Ihm war aber, als ob der bleiche\nund liebliche Psychagog dort draussen ihm laechle, ihm winke; als ob er,\ndie Hand aus der Huefte loesend, hinausdeute, voranschwebe ins\nVerheissungsvoll-Ungeheure. Und wie so oft machte er sich auf, ihm zu\nfolgen.\n\nMinuten vergingen, bis man dem seitlich im Stuhle Hinabgesunkenen zur\nHilfe eilte. Man brachte ihn auf sein Zimmer. Und noch desselben Tages\nempfing eine respektvoll erschuetterte Welt die Nachricht von seinem\nTode.", "title": "Der Tod in Venedig (German)"}