{"summary": "The short story involves Mr. and Mrs. White and their adult son, Herbert. Sergeant-Major Morris, a friend of the Whites who has been part of the British Army in India, introduces them to the monkey's paw, telling of its mysterious powers to grant three wishes and of its journey from an old fakir to his comrade, who used his third wish to wish for death.\nSergeant-Major Morris, having had a bad experience upon using the paw, throws the monkey's paw into the fire but White quickly retrieves it. Morris warns White, but White, thinking about what the paw could be used for, ignores him.\nMr. White wishes for £200 to be used as the final payment on his house. The next day his son Herbert leaves for work at a local factory. Later that day, word comes to the White home that Herbert has been killed in a machinery accident. Although the employer disclaims tortious responsibility for the incident, the firm makes a goodwill payment to heirs of the deceased. The payment is £200.\nTen days after the funeral, Mrs. White, almost mad with grief, asks her husband to use the paw to wish Herbert back to life. Reluctantly, he does so. Shortly afterwards there is a knock at the door. Mrs. White fumbles at the locks in an attempt to open the door. Mr. White knows, however, that he cannot allow their revived son in, as his appearance will be too hideous. Mr. White was required to identify the body, which had been mutilated by the accident. It has now been buried for more than a week. While Mrs. White tries to open the door, Mr. White makes his third wish, and the knocking stops. Mrs. White opens the door to find no one there.\n\n", "full_text": "THE LADY OF THE BARGE\n\nAND OTHER STORIES\n\nBy W. W. Jacobs\n\n\n\n\nTHE MONKEY'S PAW\n\n\nI.\n\nWithout, the night was cold and wet, but in the small parlour of Laburnam\nVilla the blinds were drawn and the fire burned brightly.  Father and son\nwere at chess, the former, who possessed ideas about the game involving\nradical changes, putting his king into such sharp and unnecessary perils\nthat it even provoked comment from the white-haired old lady knitting\nplacidly by the fire.\n\n\"Hark at the wind,\" said Mr. White, who, having seen a fatal mistake\nafter it was too late, was amiably desirous of preventing his son from\nseeing it.\n\n\"I'm listening,\" said the latter, grimly surveying the board as he\nstretched out his hand.  \"Check.\"\n\n\"I should hardly think that he'd come to-night,\" said his father, with\nhis hand poised over the board.\n\n\"Mate,\" replied the son.\n\n\"That's the worst of living so far out,\" bawled Mr. White, with sudden\nand unlooked-for violence; \"of all the beastly, slushy, out-of-the-way\nplaces to live in, this is the worst.  Pathway's a bog, and the road's a\ntorrent.  I don't know what people are thinking about.  I suppose because\nonly two houses in the road are let, they think it doesn't matter.\"\n\n\"Never mind, dear,\" said his wife, soothingly; \"perhaps you'll win the\nnext one.\"\n\nMr. White looked up sharply, just in time to intercept a knowing glance\nbetween mother and son.  The words died away on his lips, and he hid a\nguilty grin in his thin grey beard.\n\n\"There he is,\" said Herbert White, as the gate banged to loudly and heavy\nfootsteps came toward the door.\n\nThe old man rose with hospitable haste, and opening the door, was heard\ncondoling with the new arrival.  The new arrival also condoled with\nhimself, so that Mrs. White said, \"Tut, tut!\"  and coughed gently as her\nhusband entered the room, followed by a tall, burly man, beady of eye and\nrubicund of visage.\n\n\"Sergeant-Major Morris,\" he said, introducing him.\n\nThe sergeant-major shook hands, and taking the proffered seat by the\nfire, watched contentedly while his host got out whiskey and tumblers and\nstood a small copper kettle on the fire.\n\nAt the third glass his eyes got brighter, and he began to talk, the\nlittle family circle regarding with eager interest this visitor from\ndistant parts, as he squared his broad shoulders in the chair and spoke\nof wild scenes and doughty deeds; of wars and plagues and strange\npeoples.\n\n\"Twenty-one years of it,\" said Mr. White, nodding at his wife and son.\n\"When he went away he was a slip of a youth in the warehouse.  Now look\nat him.\"\n\n\"He don't look to have taken much harm,\" said Mrs. White, politely.\n\n\"I'd like to go to India myself,\" said the old man, \"just to look round a\nbit, you know.\"\n\n\"Better where you are,\" said the sergeant-major, shaking his head.  He\nput down the empty glass, and sighing softly, shook it again.\n\n\"I should like to see those old temples and fakirs and jugglers,\" said\nthe old man.  \"What was that you started telling me the other day about a\nmonkey's paw or something, Morris?\"\n\n\"Nothing,\" said the soldier, hastily.  \"Leastways nothing worth hearing.\"\n\n\"Monkey's paw?\"  said Mrs. White, curiously.\n\n\"Well, it's just a bit of what you might call magic, perhaps,\" said the\nsergeant-major, offhandedly.\n\nHis three listeners leaned forward eagerly.  The visitor absent-mindedly\nput his empty glass to his lips and then set it down again.  His host\nfilled it for him.\n\n\"To look at,\" said the sergeant-major, fumbling in his pocket, \"it's just\nan ordinary little paw, dried to a mummy.\"\n\nHe took something out of his pocket and proffered it.  Mrs. White drew\nback with a grimace, but her son, taking it, examined it curiously.\n\n\"And what is there special about it?\"  inquired Mr. White as he took it\nfrom his son, and having examined it, placed it upon the table.\n\n\"It had a spell put on it by an old fakir,\" said the sergeant-major,\n\"a very holy man.  He wanted to show that fate ruled people's lives, and\nthat those who interfered with it did so to their sorrow.  He put a spell\non it so that three separate men could each have three wishes from it.\"\n\nHis manner was so impressive that his hearers were conscious that their\nlight laughter jarred somewhat.\n\n\"Well, why don't you have three, sir?\"  said Herbert White, cleverly.\n\nThe soldier regarded him in the way that middle age is wont to regard\npresumptuous youth.  \"I have,\" he said, quietly, and his blotchy face\nwhitened.\n\n\"And did you really have the three wishes granted?\"  asked Mrs. White.\n\n\"I did,\" said the sergeant-major, and his glass tapped against his strong\nteeth.\n\n\"And has anybody else wished?\"  persisted the old lady.\n\n\"The first man had his three wishes.  Yes,\" was the reply; \"I don't know\nwhat the first two were, but the third was for death.  That's how I got\nthe paw.\"\n\nHis tones were so grave that a hush fell upon the group.\n\n\"If you've had your three wishes, it's no good to you now, then, Morris,\"\nsaid the old man at last.  \"What do you keep it for?\"\n\nThe soldier shook his head.  \"Fancy, I suppose,\" he said, slowly.  \"I did\nhave some idea of selling it, but I don't think I will.  It has caused\nenough mischief already.  Besides, people won't buy.  They think it's a\nfairy tale; some of them, and those who do think anything of it want to\ntry it first and pay me afterward.\"\n\n\"If you could have another three wishes,\" said the old man, eyeing him\nkeenly, \"would you have them?\"\n\n\"I don't know,\" said the other.  \"I don't know.\"\n\nHe took the paw, and dangling it between his forefinger and thumb,\nsuddenly threw it upon the fire.  White, with a slight cry, stooped down\nand snatched it off.\n\n\"Better let it burn,\" said the soldier, solemnly.\n\n\"If you don't want it, Morris,\" said the other, \"give it to me.\"\n\n\"I won't,\" said his friend, doggedly.  \"I threw it on the fire.  If you\nkeep it, don't blame me for what happens.  Pitch it on the fire again\nlike a sensible man.\"\n\nThe other shook his head and examined his new possession closely.  \"How\ndo you do it?\"  he inquired.\n\n\"Hold it up in your right hand and wish aloud,\" said the sergeant-major,\n\"but I warn you of the consequences.\"\n\n\"Sounds like the Arabian Nights,\" said Mrs. White, as she rose and began\nto set the supper.  \"Don't you think you might wish for four pairs of\nhands for me?\"\n\nHer husband drew the talisman from pocket, and then all three burst into\nlaughter as the sergeant-major, with a look of alarm on his face, caught\nhim by the arm.\n\n\"If you must wish,\" he said, gruffly, \"wish for something sensible.\"\n\nMr. White dropped it back in his pocket, and placing chairs, motioned his\nfriend to the table.  In the business of supper the talisman was partly\nforgotten, and afterward the three sat listening in an enthralled fashion\nto a second instalment of the soldier's adventures in India.\n\n\"If the tale about the monkey's paw is not more truthful than those he\nhas been telling us,\" said Herbert, as the door closed behind their\nguest, just in time for him to catch the last train, \"we sha'nt make much\nout of it.\"\n\n\"Did you give him anything for it, father?\"  inquired Mrs. White,\nregarding her husband closely.\n\n\"A trifle,\" said he, colouring slightly.  \"He didn't want it, but I made\nhim take it.  And he pressed me again to throw it away.\"\n\n\"Likely,\" said Herbert, with pretended horror.  \"Why, we're going to be\nrich, and famous and happy.  Wish to be an emperor, father, to begin\nwith; then you can't be henpecked.\"\n\nHe darted round the table, pursued by the maligned Mrs. White armed with\nan antimacassar.\n\nMr. White took the paw from his pocket and eyed it dubiously.  \"I don't\nknow what to wish for, and that's a fact,\" he said, slowly.  \"It seems to\nme I've got all I want.\"\n\n\"If you only cleared the house, you'd be quite happy, wouldn't you?\"\nsaid Herbert, with his hand on his shoulder.  \"Well, wish for two hundred\npounds, then; that 'll just do it.\"\n\nHis father, smiling shamefacedly at his own credulity, held up the\ntalisman, as his son, with a solemn face, somewhat marred by a wink at\nhis mother, sat down at the piano and struck a few impressive chords.\n\n\"I wish for two hundred pounds,\" said the old man distinctly.\n\nA fine crash from the piano greeted the words, interrupted by a\nshuddering cry from the old man.  His wife and son ran toward him.\n\n\"It moved,\" he cried, with a glance of disgust at the object as it lay on\nthe floor.\n\n\"As I wished, it twisted in my hand like a snake.\"\n\n\"Well, I don't see the money,\" said his son as he picked it up and placed\nit on the table, \"and I bet I never shall.\"\n\n\"It must have been your fancy, father,\" said his wife, regarding him\nanxiously.\n\nHe shook his head.  \"Never mind, though; there's no harm done, but it\ngave me a shock all the same.\"\n\nThey sat down by the fire again while the two men finished their pipes.\nOutside, the wind was higher than ever, and the old man started nervously\nat the sound of a door banging upstairs.  A silence unusual and\ndepressing settled upon all three, which lasted until the old couple rose\nto retire for the night.\n\n\"I expect you'll find the cash tied up in a big bag in the middle of your\nbed,\" said Herbert, as he bade them good-night, \"and something horrible\nsquatting up on top of the wardrobe watching you as you pocket your\nill-gotten gains.\"\n\nHe sat alone in the darkness, gazing at the dying fire, and seeing faces\nin it.  The last face was so horrible and so simian that he gazed at it\nin amazement.  It got so vivid that, with a little uneasy laugh, he felt\non the table for a glass containing a little water to throw over it.  His\nhand grasped the monkey's paw, and with a little shiver he wiped his hand\non his coat and went up to bed.\n\n\n\nII.\n\nIn the brightness of the wintry sun next morning as it streamed over the\nbreakfast table he laughed at his fears.  There was an air of prosaic\nwholesomeness about the room which it had lacked on the previous night,\nand the dirty, shrivelled little paw was pitched on the sideboard with a\ncarelessness which betokened no great belief in its virtues.\n\n\"I suppose all old soldiers are the same,\" said Mrs. White.  \"The idea of\nour listening to such nonsense!  How could wishes be granted in these\ndays?  And if they could, how could two hundred pounds hurt you, father?\"\n\n\"Might drop on his head from the sky,\" said the frivolous Herbert.\n\n\"Morris said the things happened so naturally,\" said his father, \"that\nyou might if you so wished attribute it to coincidence.\"\n\n\"Well, don't break into the money before I come back,\" said Herbert as he\nrose from the table.  \"I'm afraid it'll turn you into a mean, avaricious\nman, and we shall have to disown you.\"\n\nHis mother laughed, and following him to the door, watched him down the\nroad; and returning to the breakfast table, was very happy at the expense\nof her husband's credulity.  All of which did not prevent her from\nscurrying to the door at the postman's knock, nor prevent her from\nreferring somewhat shortly to retired sergeant-majors of bibulous habits\nwhen she found that the post brought a tailor's bill.\n\n\"Herbert will have some more of his funny remarks, I expect, when he\ncomes home,\" she said, as they sat at dinner.\n\n\"I dare say,\" said Mr. White, pouring himself out some beer; \"but for all\nthat, the thing moved in my hand; that I'll swear to.\"\n\n\"You thought it did,\" said the old lady soothingly.\n\n\"I say it did,\" replied the other.  \"There was no thought about it; I had\njust---- What's the matter?\"\n\nHis wife made no reply.  She was watching the mysterious movements of a\nman outside, who, peering in an undecided fashion at the house, appeared\nto be trying to make up his mind to enter.  In mental connection with the\ntwo hundred pounds, she noticed that the stranger was well dressed, and\nwore a silk hat of glossy newness.  Three times he paused at the gate,\nand then walked on again.  The fourth time he stood with his hand upon\nit, and then with sudden resolution flung it open and walked up the path.\nMrs. White at the same moment placed her hands behind her, and hurriedly\nunfastening the strings of her apron, put that useful article of apparel\nbeneath the cushion of her chair.\n\nShe brought the stranger, who seemed ill at ease, into the room.  He\ngazed at her furtively, and listened in a preoccupied fashion as the old\nlady apologized for the appearance of the room, and her husband's coat, a\ngarment which he usually reserved for the garden.  She then waited as\npatiently as her sex would permit, for him to broach his business, but he\nwas at first strangely silent.\n\n\"I--was asked to call,\" he said at last, and stooped and picked a piece\nof cotton from his trousers.  \"I come from 'Maw and Meggins.'\"\n\nThe old lady started.  \"Is anything the matter?\"  she asked,\nbreathlessly.  \"Has anything happened to Herbert?  What is it?  What is\nit?\"\n\nHer husband interposed.  \"There, there, mother,\" he said, hastily.  \"Sit\ndown, and don't jump to conclusions.  You've not brought bad news, I'm\nsure, sir;\" and he eyed the other wistfully.\n\n\"I'm sorry--\" began the visitor.\n\n\"Is he hurt?\"  demanded the mother, wildly.\n\nThe visitor bowed in assent.  \"Badly hurt,\" he said, quietly, \"but he is\nnot in any pain.\"\n\n\"Oh, thank God!\" said the old woman, clasping her hands.  \"Thank God for\nthat!  Thank--\"\n\nShe broke off suddenly as the sinister meaning of the assurance dawned\nupon her and she saw the awful confirmation of her fears in the other's\naverted face.  She caught her breath, and turning to her slower-witted\nhusband, laid her trembling old hand upon his.  There was a long silence.\n\n\"He was caught in the machinery,\" said the visitor at length in a low\nvoice.\n\n\"Caught in the machinery,\" repeated Mr. White, in a dazed fashion, \"yes.\"\n\nHe sat staring blankly out at the window, and taking his wife's hand\nbetween his own, pressed it as he had been wont to do in their old\ncourting-days nearly forty years before.\n\n\"He was the only one left to us,\" he said, turning gently to the visitor.\n\"It is hard.\"\n\nThe other coughed, and rising, walked slowly to the window.  \"The firm\nwished me to convey their sincere sympathy with you in your great loss,\"\nhe said, without looking round.  \"I beg that you will understand I am\nonly their servant and merely obeying orders.\"\n\nThere was no reply; the old woman's face was white, her eyes staring, and\nher breath inaudible; on the husband's face was a look such as his friend\nthe sergeant might have carried into his first action.\n\n\"I was to say that 'Maw and Meggins' disclaim all responsibility,\"\ncontinued the other.  \"They admit no liability at all, but in\nconsideration of your son's services, they wish to present you with\na certain sum as compensation.\"\n\nMr. White dropped his wife's hand, and rising to his feet, gazed with a\nlook of horror at his visitor.  His dry lips shaped the words, \"How\nmuch?\"\n\n\"Two hundred pounds,\" was the answer.\n\nUnconscious of his wife's shriek, the old man smiled faintly, put out his\nhands like a sightless man, and dropped, a senseless heap, to the floor.\n\n\nIII.\n\nIn the huge new cemetery, some two miles distant, the old people buried\ntheir dead, and came back to a house steeped in shadow and silence.  It\nwas all over so quickly that at first they could hardly realize it, and\nremained in a state of expectation as though of something else to happen\n--something else which was to lighten this load, too heavy for old hearts\nto bear.\n\nBut the days passed, and expectation gave place to resignation--the\nhopeless resignation of the old, sometimes miscalled, apathy.  Sometimes\nthey hardly exchanged a word, for now they had nothing to talk about, and\ntheir days were long to weariness.\n\nIt was about a week after that the old man, waking suddenly in the night,\nstretched out his hand and found himself alone.  The room was in\ndarkness, and the sound of subdued weeping came from the window.  He\nraised himself in bed and listened.\n\n\"Come back,\" he said, tenderly.  \"You will be cold.\"\n\n\"It is colder for my son,\" said the old woman, and wept afresh.\n\nThe sound of her sobs died away on his ears.  The bed was warm, and his\neyes heavy with sleep.  He dozed fitfully, and then slept until a sudden\nwild cry from his wife awoke him with a start.\n\n\"The paw!\"  she cried wildly.  \"The monkey's paw!\"\n\nHe started up in alarm.  \"Where?  Where is it?  What's the matter?\"\n\nShe came stumbling across the room toward him.  \"I want it,\" she said,\nquietly.  \"You've not destroyed it?\"\n\n\"It's in the parlour, on the bracket,\" he replied, marvelling.  \"Why?\"\n\nShe cried and laughed together, and bending over, kissed his cheek.\n\n\"I only just thought of it,\" she said, hysterically.  \"Why didn't I think\nof it before?  Why didn't you think of it?\"\n\n\"Think of what?\"  he questioned.\n\n\"The other two wishes,\" she replied, rapidly. \"We've only had one.\"\n\n\"Was not that enough?\"  he demanded, fiercely.\n\n\"No,\" she cried, triumphantly; \"we'll have one more.  Go down and get it\nquickly, and wish our boy alive again.\"\n\nThe man sat up in bed and flung the bedclothes from his quaking limbs.\n\"Good God, you are mad!\"  he cried, aghast.\n\n\"Get it,\" she panted; \"get it quickly, and wish--Oh, my boy, my boy!\"\n\nHer husband struck a match and lit the candle.  \"Get back to bed,\" he\nsaid, unsteadily.  \"You don't know what you are saying.\"\n\n\"We had the first wish granted,\" said the old woman, feverishly; \"why not\nthe second?\"\n\n\"A coincidence,\" stammered the old man.\n\n\"Go and get it and wish,\" cried his wife, quivering with excitement.\n\nThe old man turned and regarded her, and his voice shook.  \"He has been\ndead ten days, and besides he--I would not tell you else, but--I could\nonly recognize him by his clothing.  If he was too terrible for you to\nsee then, how now?\"\n\n\"Bring him back,\" cried the old woman, and dragged him toward the door.\n\"Do you think I fear the child I have nursed?\"\n\nHe went down in the darkness, and felt his way to the parlour, and then\nto the mantelpiece.  The talisman was in its place, and a horrible fear\nthat the unspoken wish might bring his mutilated son before him ere he\ncould escape from the room seized upon him, and he caught his breath as\nhe found that he had lost the direction of the door.  His brow cold with\nsweat, he felt his way round the table, and groped along the wall until\nhe found himself in the small passage with the unwholesome thing in his\nhand.\n\nEven his wife's face seemed changed as he entered the room.  It was white\nand expectant, and to his fears seemed to have an unnatural look upon it.\nHe was afraid of her.\n\n\"Wish!\"  she cried, in a strong voice.\n\n\"It is foolish and wicked,\" he faltered.\n\n\"Wish!\"  repeated his wife.\n\nHe raised his hand.  \"I wish my son alive again.\"\n\nThe talisman fell to the floor, and he regarded it fearfully.  Then he\nsank trembling into a chair as the old woman, with burning eyes, walked\nto the window and raised the blind.\n\nHe sat until he was chilled with the cold, glancing occasionally at the\nfigure of the old woman peering through the window.  The candle-end,\nwhich had burned below the rim of the china candlestick, was throwing\npulsating shadows on the ceiling and walls, until, with a flicker larger\nthan the rest, it expired.  The old man, with an unspeakable sense of\nrelief at the failure of the talisman, crept back to his bed, and a\nminute or two afterward the old woman came silently and apathetically\nbeside him.\n\nNeither spoke, but lay silently listening to the ticking of the clock.  A\nstair creaked, and a squeaky mouse scurried noisily through the wall.\nThe darkness was oppressive, and after lying for some time screwing up\nhis courage, he took the box of matches, and striking one, went\ndownstairs for a candle.\n\nAt the foot of the stairs the match went out, and he paused to strike\nanother; and at the same moment a knock, so quiet and stealthy as to be\nscarcely audible, sounded on the front door.\n\nThe matches fell from his hand and spilled in the passage.  He stood\nmotionless, his breath suspended until the knock was repeated.  Then he\nturned and fled swiftly back to his room, and closed the door behind him.\nA third knock sounded through the house.\n\n\"What's that?\"  cried the old woman, starting up.\n\n\"A rat,\" said the old man in shaking tones--\"a rat.  It passed me on the\nstairs.\"\n\nHis wife sat up in bed listening.  A loud knock resounded through the\nhouse.\n\n\"It's Herbert!\"  she screamed.  \"It's Herbert!\"\n\nShe ran to the door, but her husband was before her, and catching her by\nthe arm, held her tightly.\n\n\"What are you going to do?\"  he whispered hoarsely.\n\n\"It's my boy; it's Herbert!\"  she cried, struggling mechanically.\n\"I forgot it was two miles away.  What are you holding me for?  Let go.\nI must open the door.\"\n\n\"For God's sake don't let it in,\" cried the old man, trembling.\n\n\"You're afraid of your own son,\" she cried, struggling.  \"Let me go.  I'm\ncoming, Herbert; I'm coming.\"\n\nThere was another knock, and another.  The old woman with a sudden wrench\nbroke free and ran from the room.  Her husband followed to the landing,\nand called after her appealingly as she hurried downstairs.  He heard the\nchain rattle back and the bottom bolt drawn slowly and stiffly from the\nsocket.  Then the old woman's voice, strained and panting.\n\n\"The bolt,\" she cried, loudly.  \"Come down.  I can't reach it.\"\n\nBut her husband was on his hands and knees groping wildly on the floor in\nsearch of the paw.  If he could only find it before the thing outside got\nin.  A perfect fusillade of knocks reverberated through the house, and he\nheard the scraping of a chair as his wife put it down in the passage\nagainst the door.  He heard the creaking of the bolt as it came slowly\nback, and at the same moment he found the monkey's paw, and frantically\nbreathed his third and last wish.\n\nThe knocking ceased suddenly, although the echoes of it were still in the\nhouse.  He heard the chair drawn back, and the door opened.  A cold wind\nrushed up the staircase, and a long loud wail of disappointment and\nmisery from his wife gave him courage to run down to her side, and then\nto the gate beyond.  The street lamp flickering opposite shone on a quiet\nand deserted road.", "title": "The Monkey's Paw"}