{"summary": "The story begins when Mr Otis and family move to Canterville Chase, despite warnings from Lord Canterville that the house is haunted. Mr Otis says that he will take the furniture as well as the ghost at valuation. The Otis family includes Mr and Mrs Otis, their eldest son Washington, their daughter Virginia and the Otis twins (often referred to as \"Stars and Stripes\"). The other characters include the Canterville Ghost, the Duke of Cheshire (who wants to marry Virginia), Mrs Umney (the housekeeper), and Rev. Augustus Dampier. At first,none of the Otis family believe in ghosts, but shortly after they move in, none of them can deny the presence of Sir Simon de Canterville (The Canterville Ghost). The family hears clanking chains, they witness reappearing bloodstains \"on the floor just by the fireplace\", which are removed every time they appear in various forms (colours). But, humorously, none of these scare the Otis family in the least. In fact, upon hearing the clanking noises in the hallway, Mr Otis promptly gets out of bed and pragmatically offers the ghost Tammany Rising Sun Lubricator to oil his chains.\nDespite Sir Simon's (ghost) attempts to appear in the most gruesome guises, the family refuses to be frightened, and Sir Simon feels increasingly helpless and humiliated. When Mrs Otis notices a mysterious red mark on the floor, she simply replies that she does \"not at all care for blood stains in the sitting room\". When Mrs Umney informs Mrs Otis that the blood stain is indeed evidence of the ghost and cannot be removed, Washington Otis, the eldest son, suggests that the stain will be removed with Pinkerton's Champion Stain Remover and Paragon Detergent: a quick fix, like the Tammany Rising Sun Lubricator, and a practical way of dealing with the problem.\nWilde describes Mrs Otis as \"a very handsome middle-aged woman\" who has been \"a celebrated New York belle\". Her expression of \"modern\" American culture surfaces when she immediately resorts to giving the ghost \"Doctor Dobell's tincture\" thinking he was screaming due to indigestion on family's second encounter with the ghost and when she expresses an interest in joining the Psychical Society to help her understand the ghost. Mrs Otis is given Wilde's highest praise when he says: \"Indeed, in many respects, she was quite English...\"\nThe most colourful character in the story is undoubtedly the ghost himself, Sir Simon, who goes about his duties with theatrical panache and flair. He assumes a series of dramatic roles in his failed attempts to impress and terrify the Otises, making it easy to imagine him as a comical character in a stage play. The ghost has the ability to change forms, so he taps into his repertoire of tricks. He takes the role of ghostly apparitions such as a Headless Earl, a Strangled Babe, the Blood-Sucker of Bexley Moor, Suicide's Skeleton, and the Corpse-Snatcher of Chertsey Barn, all having succeeded in horrifying previous castle residents over the centuries. But none of them works with these Americans. Sir Simon schemes, but even begins as his costumes become increasingly gruesome, his antics do nothing to scare his house guests, and the Otises beat him every time. He falls victim to tripwires, peashooters, butter-slides, and falling buckets of water. In a particularly comical scene, he is frightened by the sight of a \"ghost\" rigged up by the mischievous twins.\nDuring the course of the story, as narrated from Sir Simon's viewpoint, he tells us the complexity of the ghost's emotions: he sees himself brave, frightening, distressed, scared, and finally, depressed and weak. He exposes his vulnerability during an encounter with Virginia, the Otis's fifteen-year-old daughter. Virginia is different from everyone else in the family, and Sir Simon recognizes this. He tells her that he has not slept in three hundred years and wants desperately to do so. The ghost reveals to Virginia the tragic tale of his wife, Lady Eleanor de Canterville.\nUnlike the rest of her family, Virginia does not dismiss the ghost, because she is different from everyone else in the family. She takes him seriously: she listens to him and learns an important lesson, as well as the true meaning behind a riddle. Sir Simon de Canterville says that she must weep for him, for he has no tears; she must pray for him, for he has no faith; and then she must accompany him to the angel of death and beg for Death's mercy upon Sir Simon. She does weep for him and pray for him, and she disappears with Sir Simon through the wainscoting and goes with him to the Garden of Death and bids the ghost farewell. Then she reappears at midnight, through a panel in the wall, carrying jewels and news that Sir Simon has passed on to the next world and no longer resides in the house.\nVirginia's ability to accept Sir Simon leads to her enlightenment: Sir Simon, she tells her husband several years later, helped her understand \"what Life is, what Death signifies, and why Love is stronger than both\". The story ends with Virginia marrying the Duke of Cheshire after they both come of age.\nThe Canterville Ghost is a study in contrasts. Wilde places the American Otises in a British stately home. He creates stereotypical characters that represent both England and the United States, and he presents each of these characters as comical figures, satirizing both the unrefined tastes of Americans and the determination of the British to guard their traditions. Sir Simon is not a symbol of England, as Mrs Umney perhaps is, but rather a paragon of British culture. In this sense, he stands in perfect contrast to the Otises. By pitting the ghost and the Otises against each other, Wilde emphasized the clash of cultures between England and the United States of America.\n[[The story illustrates Wilde's tendency to reverse situations into their opposites, as the Otises gain the upper hand and succeed in terrorizing the ghost rather than being terrorized by him. This ghost story is told from the perspective of the ghost, Sir Simon. Sir Simon could logically be labeled the protagonist in this story, as it is he who faces the challenge of overcoming adversity and bettering his lot.]]\nHumor is the most powerful weapon used by Wilde to defuse the tension and scary atmosphere that characterise a traditional ghost story. Phantoms, strange noises, blood stains, even the haunting of the ghost in the corridors are all treated with humor: Mr Otis offers lubricant for creaking chains, the persistent blood stain is cleaned with stain remover, and the ghost appears in a miserable state that shocks nobody. After Mr Otis offers him lubricator to oil his chains, the ghost laughs demoniacally, then Mrs Otis accuses him of indigestion and offers him tincture. The ghost feels duty bound and says, \"I must rattle my chains, groan through keyholes, walk about at night.\"\nOscar Wilde treats even murder flippantly. Sir Simon murdered his wife because she was not a good cook and could not do repair work. Sir Simon even gloats to himself about the people he drove to insanity or death as a ghost. He becomes frustrated because the Otises are incapable of appreciating the symbolic value of apparitions, blood stains, the development of astral bodies and his solemn duty to haunt the castle. All the tricks which are played on the ghost by the twins are humorous, with the most ironic being the fake ghost which frightens the \"real\" Canterville ghost.\nThough Wilde tells a humorous tale, it appears that he also has a message, and he uses fifteen-year-old Virginia to convey it. Virginia says that the ghost helped her see the significance of life and death, and why love is stronger than both. This is certainly not the first time an author has used a traditional ghost story and the theme of life and death to examine the issue of forgiveness: ghosts, after all, presumably remain in this realm because, for some reason, they are unable to move on. Wilde's ghost, Sir Simon, \"had been very wicked\", and had even murdered his wife because she had plain looks and was not good at cooking. Virginia tells her father after she returns to the castle, \"But he was really sorry for all that he had done. \"God has forgiven him, Virginia tells her father, and because of that forgiveness, Sir Simon de Canterville can finally rest in peace\".\n\n", "full_text": "Note: Project Gutenberg also has an HTML version of this\n      file which includes the original illustrations.\n      See 14522-h.htm or 14522-h.zip:\n      (http://www.gutenberg.net/dirs/1/4/5/2/14522/14522-h/14522-h.htm)\n      or\n      (http://www.gutenberg.net/dirs/1/4/5/2/14522/14522-h.zip)\n\n\n\n\n\nTHE CANTERVILLE GHOST\n\nby\n\nWILDE\n\nAn amusing chronicle of the tribulations of the Ghost of Canterville\nChase when his ancestral halls became the home of the American Minister\nto the Court of St. James.\n\nIllustrated by Wallace Goldsmith\n\nJohn W. Luce and Company\nBoston and London\n\n1906\n\n\n\n\n\n\n\nLIST OF ILLUSTRATIONS\n\n\nMISS VIRGINIA E. OTIS\n\n\"HAD ONCE RACED OLD LORD BILTON ON HER PONY\"\n\n\"BLOOD HAS BEEN SPILLED ON THAT SPOT\"\n\n\"I REALLY MUST INSIST ON YOUR OILING THOSE CHAINS\"\n\n\"THE TWINS ... AT ONCE DISCHARGED TWO PELLETS ON HIM\"\n\n\"ITS HEAD WAS BALD AND BURNISHED\"\n\n\"HE MET WITH A SEVERE FALL\"\n\n\"A HEAVY JUG OF WATER FELL RIGHT DOWN ON HIM\"\n\n\"MAKING SATIRICAL REMARKS ON THE PHOTOGRAPHS\"\n\n\"SUDDENLY THERE LEAPED OUT TWO FIGURES\"\n\n\"'POOR, POOR GHOST,' SHE MURMURED; 'HAVE YOU NO PLACE WHERE YOU CAN\nSLEEP?'\"\n\n\"THE GHOST GLIDED ON MORE SWIFTLY\"\n\n\"HE HEARD SOMEBODY GALLOPING AFTER HIM\"\n\n\"OUT ON THE LANDING STEPPED VIRGINIA\"\n\n\"CHAINED TO IT WAS A GAUNT SKELETON\"\n\n\"BY THE SIDE OF THE HEARSE AND THE COACHES WALKED THE SERVANTS WITH\nLIGHTED TORCHES\"\n\n\"THE MOON CAME OUT FROM BEHIND A CLOUD\"\n\n\n\n\nI\n\n\nWhen Mr. Hiram B. Otis, the American Minister, bought Canterville Chase,\nevery one told him he was doing a very foolish thing, as there was no\ndoubt at all that the place was haunted. Indeed, Lord Canterville\nhimself, who was a man of the most punctilious honour, had felt it his\nduty to mention the fact to Mr. Otis when they came to discuss terms.\n\n\"We have not cared to live in the place ourselves,\" said Lord\nCanterville, \"since my grandaunt, the Dowager Duchess of Bolton, was\nfrightened into a fit, from which she never really recovered, by two\nskeleton hands being placed on her shoulders as she was dressing for\ndinner, and I feel bound to tell you, Mr. Otis, that the ghost has been\nseen by several living members of my family, as well as by the rector of\nthe parish, the Rev. Augustus Dampier, who is a Fellow of King's\nCollege, Cambridge. After the unfortunate accident to the Duchess, none\nof our younger servants would stay with us, and Lady Canterville often\ngot very little sleep at night, in consequence of the mysterious noises\nthat came from the corridor and the library.\"\n\n\"My Lord,\" answered the Minister, \"I will take the furniture and the\nghost at a valuation. I have come from a modern country, where we have\neverything that money can buy; and with all our spry young fellows\npainting the Old World red, and carrying off your best actors and\nprima-donnas, I reckon that if there were such a thing as a ghost in\nEurope, we'd have it at home in a very short time in one of our public\nmuseums, or on the road as a show.\"\n\n\"I fear that the ghost exists,\" said Lord Canterville, smiling, \"though\nit may have resisted the overtures of your enterprising impresarios. It\nhas been well known for three centuries, since 1584 in fact, and always\nmakes its appearance before the death of any member of our family.\"\n\n\"Well, so does the family doctor for that matter, Lord Canterville. But\nthere is no such thing, sir, as a ghost, and I guess the laws of Nature\nare not going to be suspended for the British aristocracy.\"\n\n\"You are certainly very natural in America,\" answered Lord Canterville,\nwho did not quite understand Mr. Otis's last observation, \"and if you\ndon't mind a ghost in the house, it is all right. Only you must remember\nI warned you.\"\n\n[Illustration: MISS VIRGINIA E. OTIS]\n\nA few weeks after this, the purchase was concluded, and at the close of\nthe season the Minister and his family went down to Canterville Chase.\nMrs. Otis, who, as Miss Lucretia R. Tappan, of West 53d Street, had been\na celebrated New York belle, was now a very handsome, middle-aged woman,\nwith fine eyes, and a superb profile. Many American ladies on leaving\ntheir native land adopt an appearance of chronic ill-health, under the\nimpression that it is a form of European refinement, but Mrs. Otis had\nnever fallen into this error. She had a magnificent constitution, and a\nreally wonderful amount of animal spirits. Indeed, in many respects, she\nwas quite English, and was an excellent example of the fact that we\nhave really everything in common with America nowadays, except, of\ncourse, language. Her eldest son, christened Washington by his parents\nin a moment of patriotism, which he never ceased to regret, was a\nfair-haired, rather good-looking young man, who had qualified himself\nfor American diplomacy by leading the German at the Newport Casino for\nthree successive seasons, and even in London was well known as an\nexcellent dancer. Gardenias and the peerage were his only weaknesses.\nOtherwise he was extremely sensible. Miss Virginia E. Otis was a little\ngirl of fifteen, lithe and lovely as a fawn, and with a fine freedom\nin her large blue eyes. She was a wonderful Amazon, and had once raced\nold Lord Bilton on her pony twice round the park, winning by a length\nand a half, just in front of the Achilles statue, to the huge delight of\nthe young Duke of Cheshire, who proposed for her on the spot, and was\nsent back to Eton that very night by his guardians, in floods of tears.\nAfter Virginia came the twins, who were usually called \"The Star and\nStripes,\" as they were always getting swished. They were delightful\nboys, and, with the exception of the worthy Minister, the only true\nrepublicans of the family.\n\n[Illustration: \"HAD ONCE RACED OLD LORD BILTON ON HER PONY\"]\n\nAs Canterville Chase is seven miles from Ascot, the nearest railway\nstation, Mr. Otis had telegraphed for a waggonette to meet them, and\nthey started on their drive in high spirits. It was a lovely July\nevening, and the air was delicate with the scent of the pinewoods. Now\nand then they heard a wood-pigeon brooding over its own sweet voice, or\nsaw, deep in the rustling fern, the burnished breast of the pheasant.\nLittle squirrels peered at them from the beech-trees as they went by,\nand the rabbits scudded away through the brushwood and over the mossy\nknolls, with their white tails in the air. As they entered the avenue of\nCanterville Chase, however, the sky became suddenly overcast with\nclouds, a curious stillness seemed to hold the atmosphere, a great\nflight of rooks passed silently over their heads, and, before they\nreached the house, some big drops of rain had fallen.\n\nStanding on the steps to receive them was an old woman, neatly dressed\nin black silk, with a white cap and apron. This was Mrs. Umney, the\nhousekeeper, whom Mrs. Otis, at Lady Canterville's earnest request, had\nconsented to keep in her former position. She made them each a low\ncurtsey as they alighted, and said in a quaint, old-fashioned manner,\n\"I bid you welcome to Canterville Chase.\" Following her, they passed\nthrough the fine Tudor hall into the library, a long, low room, panelled\nin black oak, at the end of which was a large stained glass window. Here\nthey found tea laid out for them, and, after taking off their wraps,\nthey sat down and began to look round, while Mrs. Umney waited on them.\n\nSuddenly Mrs. Otis caught sight of a dull red stain on the floor just by\nthe fireplace, and, quite unconscious of what it really signified, said\nto Mrs. Umney, \"I am afraid something has been spilt there.\"\n\n\"Yes, madam,\" replied the old housekeeper in a low voice, \"blood has\nbeen spilt on that spot.\"\n\n[Illustration: \"BLOOD HAS BEEN SPILLED ON THAT SPOT\"]\n\n\"How horrid!\" cried Mrs. Otis; \"I don't at all care for blood-stains in\na sitting-room. It must be removed at once.\"\n\nThe old woman smiled, and answered in the same low, mysterious voice,\n\"It is the blood of Lady Eleanore de Canterville, who was murdered on\nthat very spot by her own husband, Sir Simon de Canterville, in 1575.\nSir Simon survived her nine years, and disappeared suddenly under very\nmysterious circumstances. His body has never been discovered, but his\nguilty spirit still haunts the Chase. The blood-stain has been much\nadmired by tourists and others, and cannot be removed.\"\n\n\"That is all nonsense,\" cried Washington Otis; \"Pinkerton's Champion\nStain Remover and Paragon Detergent will clean it up in no time,\" and\nbefore the terrified housekeeper could interfere, he had fallen upon his\nknees, and was rapidly scouring the floor with a small stick of what\nlooked like a black cosmetic. In a few moments no trace of the\nblood-stain could be seen.\n\n\"I knew Pinkerton would do it,\" he exclaimed, triumphantly, as he\nlooked round at his admiring family; but no sooner had he said these\nwords than a terrible flash of lightning lit up the sombre room, a\nfearful peal of thunder made them all start to their feet, and Mrs.\nUmney fainted.\n\n\"What a monstrous climate!\" said the American Minister, calmly, as he\nlit a long cheroot. \"I guess the old country is so overpopulated that\nthey have not enough decent weather for everybody. I have always been of\nopinion that emigration is the only thing for England.\"\n\n\"My dear Hiram,\" cried Mrs. Otis, \"what can we do with a woman who\nfaints?\"\n\n\"Charge it to her like breakages,\" answered the Minister; \"she won't\nfaint after that;\" and in a few moments Mrs. Umney certainly came to.\nThere was no doubt, however, that she was extremely upset, and she\nsternly warned Mr. Otis to beware of some trouble coming to the house.\n\n\"I have seen things with my own eyes, sir,\" she said, \"that would make\nany Christian's hair stand on end, and many and many a night I have not\nclosed my eyes in sleep for the awful things that are done here.\" Mr.\nOtis, however, and his wife warmly assured the honest soul that they\nwere not afraid of ghosts, and, after invoking the blessings of\nProvidence on her new master and mistress, and making arrangements for\nan increase of salary, the old housekeeper tottered off to her own room.\n\n\n\n\nII\n\n\nThe storm raged fiercely all that night, but nothing of particular note\noccurred. The next morning, however, when they came down to breakfast,\nthey found the terrible stain of blood once again on the floor. \"I don't\nthink it can be the fault of the Paragon Detergent,\" said Washington,\n\"for I have tried it with everything. It must be the ghost.\" He\naccordingly rubbed out the stain a second time, but the second morning\nit appeared again. The third morning also it was there, though the\nlibrary had been locked up at night by Mr. Otis himself, and the key\ncarried up-stairs. The whole family were now quite interested; Mr. Otis\nbegan to suspect that he had been too dogmatic in his denial of the\nexistence of ghosts, Mrs. Otis expressed her intention of joining the\nPsychical Society, and Washington prepared a long letter to Messrs.\nMyers and Podmore on the subject of the Permanence of Sanguineous Stains\nwhen connected with Crime. That night all doubts about the objective\nexistence of phantasmata were removed for ever.\n\nThe day had been warm and sunny; and, in the cool of the evening, the\nwhole family went out to drive. They did not return home till nine\no'clock, when they had a light supper. The conversation in no way turned\nupon ghosts, so there were not even those primary conditions of\nreceptive expectations which so often precede the presentation of\npsychical phenomena. The subjects discussed, as I have since learned\nfrom Mr. Otis, were merely such as form the ordinary conversation of\ncultured Americans of the better class, such as the immense superiority\nof Miss Fanny Devonport over Sarah Bernhardt as an actress; the\ndifficulty of obtaining green corn, buckwheat cakes, and hominy, even in\nthe best English houses; the importance of Boston in the development of\nthe world-soul; the advantages of the baggage-check system in railway\ntravelling; and the sweetness of the New York accent as compared to the\nLondon drawl. No mention at all was made of the supernatural, nor was\nSir Simon de Canterville alluded to in any way. At eleven o'clock the\nfamily retired, and by half-past all the lights were out. Some time\nafter, Mr. Otis was awakened by a curious noise in the corridor, outside\nhis room. It sounded like the clank of metal, and seemed to be coming\nnearer every moment. He got up at once, struck a match, and looked at\nthe time. It was exactly one o'clock. He was quite calm, and felt his\npulse, which was not at all feverish. The strange noise still continued,\nand with it he heard distinctly the sound of footsteps. He put on his\nslippers, took a small oblong phial out of his dressing-case, and opened\nthe door. Right in front of him he saw, in the wan moonlight, an old man\nof terrible aspect. His eyes were as red burning coals; long grey hair\nfell over his shoulders in matted coils; his garments, which were of\nantique cut, were soiled and ragged, and from his wrists and ankles hung\nheavy manacles and rusty gyves.\n\n\"My dear sir,\" said Mr. Otis, \"I really must insist on your oiling those\nchains, and have brought you for that purpose a small bottle of the\nTammany Rising Sun Lubricator. It is said to be completely efficacious\nupon one application, and there are several testimonials to that effect\non the wrapper from some of our most eminent native divines. I shall\nleave it here for you by the bedroom candles, and will be happy to\nsupply you with more, should you require it.\" With these words the\nUnited States Minister laid the bottle down on a marble table, and,\nclosing his door, retired to rest.\n\n[Illustration: \"I REALLY MUST INSIST ON YOUR OILING THOSE CHAINS\"]\n\nFor a moment the Canterville ghost stood quite motionless in natural\nindignation; then, dashing the bottle violently upon the polished floor,\nhe fled down the corridor, uttering hollow groans, and emitting a\nghastly green light. Just, however, as he reached the top of the great\noak staircase, a door was flung open, two little white-robed figures\nappeared, and a large pillow whizzed past his head! There was evidently\nno time to be lost, so, hastily adopting the Fourth dimension of Space\nas a means of escape, he vanished through the wainscoting, and the house\nbecame quite quiet.\n\nOn reaching a small secret chamber in the left wing, he leaned up\nagainst a moonbeam to recover his breath, and began to try and realize\nhis position. Never, in a brilliant and uninterrupted career of three\nhundred years, had he been so grossly insulted. He thought of the\nDowager Duchess, whom he had frightened into a fit as she stood before\nthe glass in her lace and diamonds; of the four housemaids, who had gone\ninto hysterics when he merely grinned at them through the curtains on\none of the spare bedrooms; of the rector of the parish, whose candle he\nhad blown out as he was coming late one night from the library, and who\nhad been under the care of Sir William Gull ever since, a perfect martyr\nto nervous disorders; and of old Madame de Tremouillac, who, having\nwakened up one morning early and seen a skeleton seated in an armchair\nby the fire reading her diary, had been confined to her bed for six\nweeks with an attack of brain fever, and, on her recovery, had become\nreconciled to the Church, and broken off her connection with that\nnotorious sceptic, Monsieur de Voltaire. He remembered the terrible\nnight when the wicked Lord Canterville was found choking in his\ndressing-room, with the knave of diamonds half-way down his throat, and\nconfessed, just before he died, that he had cheated Charles James Fox\nout of L50,000 at Crockford's by means of that very card, and swore that\nthe ghost had made him swallow it. All his great achievements came back\nto him again, from the butler who had shot himself in the pantry because\nhe had seen a green hand tapping at the window-pane, to the beautiful\nLady Stutfield, who was always obliged to wear a black velvet band round\nher throat to hide the mark of five fingers burnt upon her white skin,\nand who drowned herself at last in the carp-pond at the end of the\nKing's Walk. With the enthusiastic egotism of the true artist, he went\nover his most celebrated performances, and smiled bitterly to himself as\nhe recalled to mind his last appearance as \"Red Reuben, or the Strangled\nBabe,\" his _debut_ as \"Guant Gibeon, the Blood-sucker of Bexley Moor,\"\nand the _furore_ he had excited one lovely June evening by merely\nplaying ninepins with his own bones upon the lawn-tennis ground. And\nafter all this some wretched modern Americans were to come and offer him\nthe Rising Sun Lubricator, and throw pillows at his head! It was quite\nunbearable. Besides, no ghost in history had ever been treated in this\nmanner. Accordingly, he determined to have vengeance, and remained till\ndaylight in an attitude of deep thought.\n\n\n\n\nIII\n\n\nThe next morning, when the Otis family met at breakfast, they discussed\nthe ghost at some length. The United States Minister was naturally a\nlittle annoyed to find that his present had not been accepted. \"I have\nno wish,\" he said, \"to do the ghost any personal injury, and I must say\nthat, considering the length of time he has been in the house, I don't\nthink it is at all polite to throw pillows at him,\"--a very just remark,\nat which, I am sorry to say, the twins burst into shouts of laughter.\n\"Upon the other hand,\" he continued, \"if he really declines to use the\nRising Sun Lubricator, we shall have to take his chains from him. It\nwould be quite impossible to sleep, with such a noise going on outside\nthe bedrooms.\"\n\nFor the rest of the week, however, they were undisturbed, the only thing\nthat excited any attention being the continual renewal of the\nblood-stain on the library floor. This certainly was very strange, as\nthe door was always locked at night by Mr. Otis, and the windows kept\nclosely barred. The chameleon-like colour, also, of the stain excited a\ngood deal of comment. Some mornings it was a dull (almost Indian) red,\nthen it would be vermilion, then a rich purple, and once when they came\ndown for family prayers, according to the simple rites of the Free\nAmerican Reformed Episcopalian Church, they found it a bright\nemerald-green. These kaleidoscopic changes naturally amused the party\nvery much, and bets on the subject were freely made every evening. The\nonly person who did not enter into the joke was little Virginia, who,\nfor some unexplained reason, was always a good deal distressed at the\nsight of the blood-stain, and very nearly cried the morning it was\nemerald-green.\n\nThe second appearance of the ghost was on Sunday night. Shortly after\nthey had gone to bed they were suddenly alarmed by a fearful crash in\nthe hall. Rushing down-stairs, they found that a large suit of old\narmour had become detached from its stand, and had fallen on the stone\nfloor, while seated in a high-backed chair was the Canterville ghost,\nrubbing his knees with an expression of acute agony on his face. The\ntwins, having brought their pea-shooters with them, at once discharged\ntwo pellets on him, with that accuracy of aim which can only be attained\nby long and careful practice on a writing-master, while the United\nStates Minister covered him with his revolver, and called upon him, in\naccordance with Californian etiquette, to hold up his hands! The ghost\nstarted up with a wild shriek of rage, and swept through them like a\nmist, extinguishing Washington Otis's candle as he passed, and so\nleaving them all in total darkness. On reaching the top of the staircase\nhe recovered himself, and determined to give his celebrated peal of\ndemoniac laughter. This he had on more than one occasion found extremely\nuseful. It was said to have turned Lord Raker's wig grey in a single\nnight, and had certainly made three of Lady Canterville's French\ngovernesses give warning before their month was up. He accordingly\nlaughed his most horrible laugh, till the old vaulted roof rang and\nrang again, but hardly had the fearful echo died away when a door\nopened, and Mrs. Otis came out in a light blue dressing-gown. \"I am\nafraid you are far from well,\" she said, \"and have brought you a bottle\nof Doctor Dobell's tincture. If it is indigestion, you will find it a\nmost excellent remedy.\" The ghost glared at her in fury, and began at\nonce to make preparations for turning himself into a large black dog, an\naccomplishment for which he was justly renowned, and to which the family\ndoctor always attributed the permanent idiocy of Lord Canterville's\nuncle, the Hon. Thomas Horton. The sound of approaching footsteps,\nhowever, made him hesitate in his fell purpose, so he contented himself\nwith becoming faintly phosphorescent, and vanished with a deep\nchurchyard groan, just as the twins had come up to him.\n\n[Illustration: \"THE TWINS ... AT ONCE DISCHARGED TWO PELLETS ON HIM\"]\n\nOn reaching his room he entirely broke down, and became a prey to the\nmost violent agitation. The vulgarity of the twins, and the gross\nmaterialism of Mrs. Otis, were naturally extremely annoying, but what\nreally distressed him most was that he had been unable to wear the suit\nof mail. He had hoped that even modern Americans would be thrilled by\nthe sight of a Spectre in armour, if for no more sensible reason, at\nleast out of respect for their natural poet Longfellow, over whose\ngraceful and attractive poetry he himself had whiled away many a weary\nhour when the Cantervilles were up in town. Besides it was his own suit.\nHe had worn it with great success at the Kenilworth tournament, and had\nbeen highly complimented on it by no less a person than the Virgin Queen\nherself. Yet when he had put it on, he had been completely overpowered\nby the weight of the huge breastplate and steel casque, and had fallen\nheavily on the stone pavement, barking both his knees severely, and\nbruising the knuckles of his right hand.\n\nFor some days after this he was extremely ill, and hardly stirred out of\nhis room at all, except to keep the blood-stain in proper repair.\nHowever, by taking great care of himself, he recovered, and resolved to\nmake a third attempt to frighten the United States Minister and his\nfamily. He selected Friday, August 17th, for his appearance, and spent\nmost of that day in looking over his wardrobe, ultimately deciding in\nfavour of a large slouched hat with a red feather, a winding-sheet\nfrilled at the wrists and neck, and a rusty dagger. Towards evening a\nviolent storm of rain came on, and the wind was so high that all the\nwindows and doors in the old house shook and rattled. In fact, it was\njust such weather as he loved. His plan of action was this. He was to\nmake his way quietly to Washington Otis's room, gibber at him from the\nfoot of the bed, and stab himself three times in the throat to the sound\nof low music. He bore Washington a special grudge, being quite aware\nthat it was he who was in the habit of removing the famous Canterville\nblood-stain by means of Pinkerton's Paragon Detergent. Having reduced\nthe reckless and foolhardy youth to a condition of abject terror, he was\nthen to proceed to the room occupied by the United States Minister and\nhis wife, and there to place a clammy hand on Mrs. Otis's forehead,\nwhile he hissed into her trembling husband's ear the awful secrets of\nthe charnel-house. With regard to little Virginia, he had not quite made\nup his mind. She had never insulted him in any way, and was pretty and\ngentle. A few hollow groans from the wardrobe, he thought, would be more\nthan sufficient, or, if that failed to wake her, he might grabble at the\ncounterpane with palsy-twitching fingers. As for the twins, he was quite\ndetermined to teach them a lesson. The first thing to be done was, of\ncourse, to sit upon their chests, so as to produce the stifling\nsensation of nightmare. Then, as their beds were quite close to each\nother, to stand between them in the form of a green, icy-cold corpse,\ntill they became paralyzed with fear, and finally, to throw off the\nwinding-sheet, and crawl round the room, with white, bleached bones and\none rolling eyeball, in the character of \"Dumb Daniel, or the Suicide's\nSkeleton,\" a _role_ in which he had on more than one occasion produced a\ngreat effect, and which he considered quite equal to his famous part of\n\"Martin the Maniac, or the Masked Mystery.\"\n\nAt half-past ten he heard the family going to bed. For some time he was\ndisturbed by wild shrieks of laughter from the twins, who, with the\nlight-hearted gaiety of schoolboys, were evidently amusing themselves\nbefore they retired to rest, but at a quarter-past eleven all was still,\nand, as midnight sounded, he sallied forth. The owl beat against the\nwindow-panes, the raven croaked from the old yew-tree, and the wind\nwandered moaning round the house like a lost soul; but the Otis family\nslept unconscious of their doom, and high above the rain and storm he\ncould hear the steady snoring of the Minister for the United States. He\nstepped stealthily out of the wainscoting, with an evil smile on his\ncruel, wrinkled mouth, and the moon hid her face in a cloud as he stole\npast the great oriel window, where his own arms and those of his\nmurdered wife were blazoned in azure and gold. On and on he glided, like\nan evil shadow, the very darkness seeming to loathe him as he passed.\nOnce he thought he heard something call, and stopped; but it was only\nthe baying of a dog from the Red Farm, and he went on, muttering strange\nsixteenth-century curses, and ever and anon brandishing the rusty dagger\nin the midnight air. Finally he reached the corner of the passage that\nled to luckless Washington's room. For a moment he paused there, the\nwind blowing his long grey locks about his head, and twisting into\ngrotesque and fantastic folds the nameless horror of the dead man's\nshroud. Then the clock struck the quarter, and he felt the time was\ncome. He chuckled to himself, and turned the corner; but no sooner had\nhe done so than, with a piteous wail of terror, he fell back, and hid\nhis blanched face in his long, bony hands. Right in front of him was\nstanding a horrible spectre, motionless as a carven image, and monstrous\nas a madman's dream! Its head was bald and burnished; its face round,\nand fat, and white; and hideous laughter seemed to have writhed its\nfeatures into an eternal grin. From the eyes streamed rays of scarlet\nlight, the mouth was a wide well of fire, and a hideous garment, like\nto his own, swathed with its silent snows the Titan form. On its breast\nwas a placard with strange writing in antique characters, some scroll of\nshame it seemed, some record of wild sins, some awful calendar of crime,\nand, with its right hand, it bore aloft a falchion of gleaming steel.\n\n[Illustration: \"ITS HEAD WAS BALD AND BURNISHED\"]\n\nNever having seen a ghost before, he naturally was terribly frightened,\nand, after a second hasty glance at the awful phantom, he fled back to\nhis room, tripping up in his long winding-sheet as he sped down the\ncorridor, and finally dropping the rusty dagger into the Minister's\njack-boots, where it was found in the morning by the butler. Once in the\nprivacy of his own apartment, he flung himself down on a small\npallet-bed, and hid his face under the clothes. After a time, however,\nthe brave old Canterville spirit asserted itself, and he determined to\ngo and speak to the other ghost as soon as it was daylight. Accordingly,\njust as the dawn was touching the hills with silver, he returned towards\nthe spot where he had first laid eyes on the grisly phantom, feeling\nthat, after all, two ghosts were better than one, and that, by the aid\nof his new friend, he might safely grapple with the twins. On reaching\nthe spot, however, a terrible sight met his gaze. Something had\nevidently happened to the spectre, for the light had entirely faded from\nits hollow eyes, the gleaming falchion had fallen from its hand, and it\nwas leaning up against the wall in a strained and uncomfortable\nattitude. He rushed forward and seized it in his arms, when, to his\nhorror, the head slipped off and rolled on the floor, the body assumed a\nrecumbent posture, and he found himself clasping a white dimity\nbed-curtain, with a sweeping-brush, a kitchen cleaver, and a hollow\nturnip lying at his feet! Unable to understand this curious\ntransformation, he clutched the placard with feverish haste, and there,\nin the grey morning light, he read these fearful words:--\n\n        +------------------------------------+\n        |         YE OTIS GHOSTE             |\n        | Ye Onlie True and Originale Spook, |\n        |    Beware of Ye Imitationes.       |\n        |   All others are counterfeite.     |\n        +------------------------------------+\n\nThe whole thing flashed across him. He had been tricked, foiled, and\nout-witted! The old Canterville look came into his eyes; he ground his\ntoothless gums together; and, raising his withered hands high above his\nhead, swore according to the picturesque phraseology of the antique\nschool, that, when Chanticleer had sounded twice his merry horn, deeds\nof blood would be wrought, and murder walk abroad with silent feet.\n\nHardly had he finished this awful oath when, from the red-tiled roof of\na distant homestead, a cock crew. He laughed a long, low, bitter laugh,\nand waited. Hour after hour he waited, but the cock, for some strange\nreason, did not crow again. Finally, at half-past seven, the arrival of\nthe housemaids made him give up his fearful vigil, and he stalked back\nto his room, thinking of his vain oath and baffled purpose. There he\nconsulted several books of ancient chivalry, of which he was\nexceedingly fond, and found that, on every occasion on which this oath\nhad been used, Chanticleer had always crowed a second time. \"Perdition\nseize the naughty fowl,\" he muttered, \"I have seen the day when, with my\nstout spear, I would have run him through the gorge, and made him crow\nfor me an 'twere in death!\" He then retired to a comfortable lead\ncoffin, and stayed there till evening.\n\n\n\n\nIV\n\n\n[Illustration: \"HE MET WITH A SEVERE FALL\"]\n\nThe next day the ghost was very weak and tired. The terrible excitement\nof the last four weeks was beginning to have its effect. His nerves were\ncompletely shattered, and he started at the slightest noise. For five\ndays he kept his room, and at last made up his mind to give up the point\nof the blood-stain on the library floor. If the Otis family did not want\nit, they clearly did not deserve it. They were evidently people on a\nlow, material plane of existence, and quite incapable of appreciating\nthe symbolic value of sensuous phenomena. The question of phantasmic\napparitions, and the development of astral bodies, was of course quite a\ndifferent matter, and really not under his control. It was his solemn\nduty to appear in the corridor once a week, and to gibber from the large\noriel window on the first and third Wednesdays in every month, and he\ndid not see how he could honourably escape from his obligations. It is\nquite true that his life had been very evil, but, upon the other hand,\nhe was most conscientious in all things connected with the supernatural.\nFor the next three Saturdays, accordingly, he traversed the corridor as\nusual between midnight and three o'clock, taking every possible\nprecaution against being either heard or seen. He removed his boots,\ntrod as lightly as possible on the old worm-eaten boards, wore a large\nblack velvet cloak, and was careful to use the Rising Sun Lubricator for\noiling his chains. I am bound to acknowledge that it was with a good\ndeal of difficulty that he brought himself to adopt this last mode of\nprotection. However, one night, while the family were at dinner, he\nslipped into Mr. Otis's bedroom and carried off the bottle. He felt a\nlittle humiliated at first, but afterwards was sensible enough to see\nthat there was a great deal to be said for the invention, and, to a\ncertain degree, it served his purpose. Still in spite of everything he\nwas not left unmolested. Strings were continually being stretched across\nthe corridor, over which he tripped in the dark, and on one occasion,\nwhile dressed for the part of \"Black Isaac, or the Huntsman of Hogley\nWoods,\" he met with a severe fall, through treading on a butter-slide,\nwhich the twins had constructed from the entrance of the Tapestry\nChamber to the top of the oak staircase. This last insult so enraged\nhim, that he resolved to make one final effort to assert his dignity and\nsocial position, and determined to visit the insolent young Etonians the\nnext night in his celebrated character of \"Reckless Rupert, or the\nHeadless Earl.\"\n\n[Illustration: \"A HEAVY JUG OF WATER FELL RIGHT DOWN ON HIM.\"]\n\nHe had not appeared in this disguise for more than seventy years; in\nfact, not since he had so frightened pretty Lady Barbara Modish by means\nof it, that she suddenly broke off her engagement with the present Lord\nCanterville's grandfather, and ran away to Gretna Green with handsome\nJack Castletown, declaring that nothing in the world would induce her to\nmarry into a family that allowed such a horrible phantom to walk up and\ndown the terrace at twilight. Poor Jack was afterwards shot in a duel by\nLord Canterville on Wandsworth Common, and Lady Barbara died of a broken\nheart at Tunbridge Wells before the year was out, so, in every way, it\nhad been a great success. It was, however an extremely difficult\n\"make-up,\" if I may use such a theatrical expression in connection with\none of the greatest mysteries of the supernatural, or, to employ a more\nscientific term, the higher-natural world, and it took him fully three\nhours to make his preparations. At last everything was ready, and he was\nvery pleased with his appearance. The big leather riding-boots that went\nwith the dress were just a little too large for him, and he could only\nfind one of the two horse-pistols, but, on the whole, he was quite\nsatisfied, and at a quarter-past one he glided out of the wainscoting\nand crept down the corridor. On reaching the room occupied by the twins,\nwhich I should mention was called the Blue Bed Chamber, on account of\nthe colour of its hangings, he found the door just ajar. Wishing to make\nan effective entrance, he flung it wide open, when a heavy jug of water\nfell right down on him, wetting him to the skin, and just missing his\nleft shoulder by a couple of inches. At the same moment he heard stifled\nshrieks of laughter proceeding from the four-post bed. The shock to his\nnervous system was so great that he fled back to his room as hard as he\ncould go, and the next day he was laid up with a severe cold. The only\nthing that at all consoled him in the whole affair was the fact that he\nhad not brought his head with him, for, had he done so, the consequences\nmight have been very serious.\n\n[Illustration: \"MAKING SATIRICAL REMARKS ON THE PHOTOGRAPHS\"]\n\nHe now gave up all hope of ever frightening this rude American family,\nand contented himself, as a rule, with creeping about the passages in\nlist slippers, with a thick red muffler round his throat for fear of\ndraughts, and a small arquebuse, in case he should be attacked by the\ntwins. The final blow he received occurred on the 19th of September. He\nhad gone down-stairs to the great entrance-hall, feeling sure that\nthere, at any rate, he would be quite unmolested, and was amusing\nhimself by making satirical remarks on the large Saroni photographs of\nthe United States Minister and his wife which had now taken the place of\nthe Canterville family pictures. He was simply but neatly clad in a long\nshroud, spotted with churchyard mould, had tied up his jaw with a strip\nof yellow linen, and carried a small lantern and a sexton's spade. In\nfact, he was dressed for the character of \"Jonas the Graveless, or the\nCorpse-Snatcher of Chertsey Barn,\" one of his most remarkable\nimpersonations, and one which the Cantervilles had every reason to\nremember, as it was the real origin of their quarrel with their\nneighbour, Lord Rufford. It was about a quarter-past two o'clock in\nthe morning, and, as far as he could ascertain, no one was stirring. As\nhe was strolling towards the library, however, to see if there were any\ntraces left of the blood-stain, suddenly there leaped out on him from a\ndark corner two figures, who waved their arms wildly above their heads,\nand shrieked out \"BOO!\" in his ear.\n\n[Illustration: \"SUDDENLY THERE LEAPED OUT TWO FIGURES.\"]\n\nSeized with a panic, which, under the circumstances, was only natural,\nhe rushed for the staircase, but found Washington Otis waiting for him\nthere with the big garden-syringe, and being thus hemmed in by his\nenemies on every side, and driven almost to bay, he vanished into the\ngreat iron stove, which, fortunately for him, was not lit, and had to\nmake his way home through the flues and chimneys, arriving at his own\nroom in a terrible state of dirt, disorder, and despair.\n\nAfter this he was not seen again on any nocturnal expedition. The twins\nlay in wait for him on several occasions, and strewed the passages with\nnutshells every night to the great annoyance of their parents and the\nservants, but it was of no avail. It was quite evident that his feelings\nwere so wounded that he would not appear. Mr. Otis consequently resumed\nhis great work on the history of the Democratic Party, on which he had\nbeen engaged for some years; Mrs. Otis organized a wonderful\nclam-bake, which amazed the whole county; the boys took to lacrosse\neuchre, poker, and other American national games, and Virginia rode\nabout the lanes on her pony, accompanied by the young Duke of Cheshire,\nwho had come to spend the last week of his holidays at Canterville\nChase. It was generally assumed that the ghost had gone away, and, in\nfact, Mr. Otis wrote a letter to that effect to Lord Canterville, who,\nin reply, expressed his great pleasure at the news, and sent his best\ncongratulations to the Minister's worthy wife.\n\nThe Otises, however, were deceived, for the ghost was still in the\nhouse, and though now almost an invalid, was by no means ready to let\nmatters rest, particularly as he heard that among the guests was the\nyoung Duke of Cheshire, whose grand-uncle, Lord Francis Stilton, had\nonce bet a hundred guineas with Colonel Carbury that he would play dice\nwith the Canterville ghost, and was found the next morning lying on the\nfloor of the card-room in such a helpless paralytic state that, though\nhe lived on to a great age, he was never able to say anything again but\n\"Double Sixes.\" The story was well known at the time, though, of course,\nout of respect to the feelings of the two noble families, every attempt\nwas made to hush it up, and a full account of all the circumstances\nconnected with it will be found in the third volume of Lord Tattle's\n_Recollections of the Prince Regent and his Friends_. The ghost, then,\nwas naturally very anxious to show that he had not lost his influence\nover the Stiltons, with whom, indeed, he was distantly connected, his\nown first cousin having been married _en secondes noces_ to the Sieur de\nBulkeley, from whom, as every one knows, the Dukes of Cheshire are\nlineally descended. Accordingly, he made arrangements for appearing to\nVirginia's little lover in his celebrated impersonation of \"The Vampire\nMonk, or the Bloodless Benedictine,\" a performance so horrible that when\nold Lady Startup saw it, which she did on one fatal New Year's Eve, in\nthe year 1764, she went off into the most piercing shrieks, which\nculminated in violent apoplexy, and died in three days, after\ndisinheriting the Cantervilles, who were her nearest relations, and\nleaving all her money to her London apothecary. At the last moment,\nhowever, his terror of the twins prevented his leaving his room, and the\nlittle Duke slept in peace under the great feathered canopy in the Royal\nBedchamber, and dreamed of Virginia.\n\n\n\n\nV\n\n\nA few days after this, Virginia and her curly-haired cavalier went out\nriding on Brockley meadows, where she tore her habit so badly in getting\nthrough a hedge that, on their return home, she made up her mind to go\nup by the back staircase so as not to be seen. As she was running past\nthe Tapestry Chamber, the door of which happened to be open, she fancied\nshe saw some one inside, and thinking it was her mother's maid, who\nsometimes used to bring her work there, looked in to ask her to mend\nher habit. To her immense surprise, however, it was the Canterville\nGhost himself! He was sitting by the window, watching the ruined gold of\nthe yellowing trees fly through the air, and the red leaves dancing\nmadly down the long avenue. His head was leaning on his hand, and his\nwhole attitude was one of extreme depression. Indeed, so forlorn, and so\nmuch out of repair did he look, that little Virginia, whose first idea\nhad been to run away and lock herself in her room, was filled with pity,\nand determined to try and comfort him. So light was her footfall, and so\ndeep his melancholy, that he was not aware of her presence till she\nspoke to him.\n\n\"I am so sorry for you,\" she said, \"but my brothers are going back to\nEton to-morrow, and then, if you behave yourself, no one will annoy\nyou.\"\n\n\"It is absurd asking me to behave myself,\" he answered, looking round in\nastonishment at the pretty little girl who had ventured to address him,\n\"quite absurd. I must rattle my chains, and groan through keyholes, and\nwalk about at night, if that is what you mean. It is my only reason for\nexisting.\"\n\n\"It is no reason at all for existing, and you know you have been very\nwicked. Mrs. Umney told us, the first day we arrived here, that you had\nkilled your wife.\"\n\n\"Well, I quite admit it,\" said the Ghost, petulantly, \"but it was a\npurely family matter, and concerned no one else.\"\n\n\"It is very wrong to kill any one,\" said Virginia, who at times had a\nsweet puritan gravity, caught from some old New England ancestor.\n\n\"Oh, I hate the cheap severity of abstract ethics! My wife was very\nplain, never had my ruffs properly starched, and knew nothing about\ncookery. Why, there was a buck I had shot in Hogley Woods, a magnificent\npricket, and do you know how she had it sent to table? However, it is\nno matter now, for it is all over, and I don't think it was very nice of\nher brothers to starve me to death, though I did kill her.\"\n\n\"Starve you to death? Oh, Mr. Ghost--I mean Sir Simon, are you hungry? I\nhave a sandwich in my case. Would you like it?\"\n\n\"No, thank you, I never eat anything now; but it is very kind of you,\nall the same, and you are much nicer than the rest of your horrid, rude,\nvulgar, dishonest family.\"\n\n\"Stop!\" cried Virginia, stamping her foot, \"it is you who are rude, and\nhorrid, and vulgar, and as for dishonesty, you know you stole the\npaints out of my box to try and furbish up that ridiculous blood-stain\nin the library. First you took all my reds, including the vermilion, and\nI couldn't do any more sunsets, then you took the emerald-green and the\nchrome-yellow, and finally I had nothing left but indigo and Chinese\nwhite, and could only do moonlight scenes, which are always depressing\nto look at, and not at all easy to paint. I never told on you, though I\nwas very much annoyed, and it was most ridiculous, the whole thing; for\nwho ever heard of emerald-green blood?\"\n\n\"Well, really,\" said the Ghost, rather meekly, \"what was I to do? It is\na very difficult thing to get real blood nowadays, and, as your brother\nbegan it all with his Paragon Detergent, I certainly saw no reason why I\nshould not have your paints. As for colour, that is always a matter of\ntaste: the Cantervilles have blue blood, for instance, the very bluest\nin England; but I know you Americans don't care for things of this\nkind.\"\n\n\"You know nothing about it, and the best thing you can do is to emigrate\nand improve your mind. My father will be only too happy to give you a\nfree passage, and though there is a heavy duty on spirits of every kind,\nthere will be no difficulty about the Custom House, as the officers are\nall Democrats. Once in New York, you are sure to be a great success. I\nknow lots of people there who would give a hundred thousand dollars to\nhave a grandfather, and much more than that to have a family ghost.\"\n\n\"I don't think I should like America.\"\n\n\"I suppose because we have no ruins and no curiosities,\" said Virginia,\nsatirically.\n\n\"No ruins! no curiosities!\" answered the Ghost; \"you have your navy and\nyour manners.\"\n\n\"Good evening; I will go and ask papa to get the twins an extra week's\nholiday.\"\n\n\"Please don't go, Miss Virginia,\" he cried; \"I am so lonely and so\nunhappy, and I really don't know what to do. I want to go to sleep and I\ncannot.\"\n\n\"That's quite absurd! You have merely to go to bed and blow out the\ncandle. It is very difficult sometimes to keep awake, especially at\nchurch, but there is no difficulty at all about sleeping. Why, even\nbabies know how to do that, and they are not very clever.\"\n\n\"I have not slept for three hundred years,\" he said sadly, and\nVirginia's beautiful blue eyes opened in wonder; \"for three hundred\nyears I have not slept, and I am so tired.\"\n\nVirginia grew quite grave, and her little lips trembled like\nrose-leaves. She came towards him, and kneeling down at his side, looked\nup into his old withered face.\n\n\"Poor, poor Ghost,\" she murmured; \"have you no place where you can\nsleep?\"\n\n[Illustration: \"'POOR, POOR GHOST,' SHE MURMURED; 'HAVE YOU NO PLACE\nWHERE YOU CAN SLEEP?'\"]\n\n\"Far away beyond the pine-woods,\" he answered, in a low, dreamy voice,\n\"there is a little garden. There the grass grows long and deep, there\nare the great white stars of the hemlock flower, there the nightingale\nsings all night long. All night long he sings, and the cold crystal\nmoon looks down, and the yew-tree spreads out its giant arms over the\nsleepers.\"\n\nVirginia's eyes grew dim with tears, and she hid her face in her hands.\n\n\"You mean the Garden of Death,\" she whispered.\n\n\"Yes, death. Death must be so beautiful. To lie in the soft brown earth,\nwith the grasses waving above one's head, and listen to silence. To have\nno yesterday, and no to-morrow. To forget time, to forget life, to be at\npeace. You can help me. You can open for me the portals of death's\nhouse, for love is always with you, and love is stronger than death\nis.\"\n\nVirginia trembled, a cold shudder ran through her, and for a few moments\nthere was silence. She felt as if she was in a terrible dream.\n\nThen the ghost spoke again, and his voice sounded like the sighing of\nthe wind.\n\n\"Have you ever read the old prophecy on the library window?\"\n\n\"Oh, often,\" cried the little girl, looking up; \"I know it quite well.\nIt is painted in curious black letters, and is difficult to read. There\nare only six lines:\n\n    \"'When a golden girl can win\n    Prayer from out the lips of sin,\n    When the barren almond bears,\n    And a little child gives away its tears,\n    Then shall all the house be still\n    And peace come to Canterville.'\n\n\"But I don't know what they mean.\"\n\n\"They mean,\" he said, sadly, \"that you must weep with me for my sins,\nbecause I have no tears, and pray with me for my soul, because I have no\nfaith, and then, if you have always been sweet, and good, and gentle,\nthe angel of death will have mercy on me. You will see fearful shapes in\ndarkness, and wicked voices will whisper in your ear, but they will not\nharm you, for against the purity of a little child the powers of Hell\ncannot prevail.\"\n\nVirginia made no answer, and the ghost wrung his hands in wild despair\nas he looked down at her bowed golden head. Suddenly she stood up, very\npale, and with a strange light in her eyes. \"I am not afraid,\" she said\nfirmly, \"and I will ask the angel to have mercy on you.\"\n\nHe rose from his seat with a faint cry of joy, and taking her hand bent\nover it with old-fashioned grace and kissed it. His fingers were as cold\nas ice, and his lips burned like fire, but Virginia did not falter, as\nhe led her across the dusky room. On the faded green tapestry were\nbroidered little huntsmen. They blew their tasselled horns and with\ntheir tiny hands waved to her to go back. \"Go back! little Virginia,\"\nthey cried, \"go back!\" but the ghost clutched her hand more tightly,\nand she shut her eyes against them. Horrible animals with lizard tails\nand goggle eyes blinked at her from the carven chimneypiece, and\nmurmured, \"Beware! little Virginia, beware! we may never see you again,\"\nbut the Ghost glided on more swiftly, and Virginia did not listen. When\nthey reached the end of the room he stopped, and muttered some words she\ncould not understand. She opened her eyes, and saw the wall slowly\nfading away like a mist, and a great black cavern in front of her. A\nbitter cold wind swept round them, and she felt something pulling at her\ndress. \"Quick, quick,\" cried the Ghost, \"or it will be too late,\" and\nin a moment the wainscoting had closed behind them, and the Tapestry\nChamber was empty.\n\n[Illustration: \"THE GHOST GLIDED ON MORE SWIFTLY\"]\n\n\n\n\nVI\n\n\nAbout ten minutes later, the bell rang for tea, and, as Virginia did not\ncome down, Mrs. Otis sent up one of the footmen to tell her. After a\nlittle time he returned and said that he could not find Miss Virginia\nanywhere. As she was in the habit of going out to the garden every\nevening to get flowers for the dinner-table, Mrs. Otis was not at all\nalarmed at first, but when six o'clock struck, and Virginia did not\nappear, she became really agitated, and sent the boys out to look for\nher, while she herself and Mr. Otis searched every room in the house. At\nhalf-past six the boys came back and said that they could find no trace\nof their sister anywhere. They were all now in the greatest state of\nexcitement, and did not know what to do, when Mr. Otis suddenly\nremembered that, some few days before, he had given a band of gipsies\npermission to camp in the park. He accordingly at once set off for\nBlackfell Hollow, where he knew they were, accompanied by his eldest son\nand two of the farm-servants. The little Duke of Cheshire, who was\nperfectly frantic with anxiety, begged hard to be allowed to go too,\nbut Mr. Otis would not allow him, as he was afraid there might be a\nscuffle. On arriving at the spot, however, he found that the gipsies had\ngone, and it was evident that their departure had been rather sudden, as\nthe fire was still burning, and some plates were lying on the grass.\nHaving sent off Washington and the two men to scour the district, he ran\nhome, and despatched telegrams to all the police inspectors in the\ncounty, telling them to look out for a little girl who had been\nkidnapped by tramps or gipsies. He then ordered his horse to be brought\nround, and, after insisting on his wife and the three boys sitting down\nto dinner, rode off down the Ascot road with a groom. He had hardly,\nhowever, gone a couple of miles, when he heard somebody galloping after\nhim, and, looking round, saw the little Duke coming up on his pony, with\nhis face very flushed, and no hat. \"I'm awfully sorry, Mr. Otis,\" gasped\nout the boy, \"but I can't eat any dinner as long as Virginia is lost.\nPlease don't be angry with me; if you had let us be engaged last year,\nthere would never have been all this trouble. You won't send me back,\nwill you? I can't go! I won't go!\"\n\n[Illustration: \"HE HEARD SOMEBODY GALLOPING AFTER HIM\"]\n\nThe Minister could not help smiling at the handsome young scapegrace,\nand was a good deal touched at his devotion to Virginia, so leaning down\nfrom his horse, he patted him kindly on the shoulders, and said, \"Well,\nCecil, if you won't go back, I suppose you must come with me, but I must\nget you a hat at Ascot.\"\n\n\"Oh, bother my hat! I want Virginia!\" cried the little Duke, laughing,\nand they galloped on to the railway station. There Mr. Otis inquired of\nthe station-master if any one answering to the description of Virginia\nhad been seen on the platform, but could get no news of her. The\nstation-master, however, wired up and down the line, and assured him\nthat a strict watch would be kept for her, and, after having bought a\nhat for the little Duke from a linen-draper, who was just putting up his\nshutters, Mr. Otis rode off to Bexley, a village about four miles away,\nwhich he was told was a well-known haunt of the gipsies, as there was a\nlarge common next to it. Here they roused up the rural policeman, but\ncould get no information from him, and, after riding all over the\ncommon, they turned their horses' heads homewards, and reached the Chase\nabout eleven o'clock, dead-tired and almost heart-broken. They found\nWashington and the twins waiting for them at the gate-house with\nlanterns, as the avenue was very dark. Not the slightest trace of\nVirginia had been discovered. The gipsies had been caught on Brockley\nmeadows, but she was not with them, and they had explained their sudden\ndeparture by saying that they had mistaken the date of Chorton Fair, and\nhad gone off in a hurry for fear they should be late. Indeed, they had\nbeen quite distressed at hearing of Virginia's disappearance, as they\nwere very grateful to Mr. Otis for having allowed them to camp in his\npark, and four of their number had stayed behind to help in the search.\nThe carp-pond had been dragged, and the whole Chase thoroughly gone\nover, but without any result. It was evident that, for that night at any\nrate, Virginia was lost to them; and it was in a state of the deepest\ndepression that Mr. Otis and the boys walked up to the house, the groom\nfollowing behind with the two horses and the pony. In the hall they\nfound a group of frightened servants, and lying on a sofa in the library\nwas poor Mrs. Otis, almost out of her mind with terror and anxiety, and\nhaving her forehead bathed with eau de cologne by the old housekeeper.\nMr. Otis at once insisted on her having something to eat, and ordered up\nsupper for the whole party. It was a melancholy meal, as hardly any one\nspoke, and even the twins were awestruck and subdued, as they were very\nfond of their sister. When they had finished, Mr. Otis, in spite of the\nentreaties of the little Duke, ordered them all to bed, saying that\nnothing more could be done that night, and that he would telegraph in\nthe morning to Scotland Yard for some detectives to be sent down\nimmediately. Just as they were passing out of the dining-room, midnight\nbegan to boom from the clock tower, and when the last stroke sounded\nthey heard a crash and a sudden shrill cry; a dreadful peal of thunder\nshook the house, a strain of unearthly music floated through the air, a\npanel at the top of the staircase flew back with a loud noise, and out\non the landing, looking very pale and white, with a little casket in her\nhand, stepped Virginia. In a moment they had all rushed up to her. Mrs.\nOtis clasped her passionately in her arms, the Duke smothered her with\nviolent kisses, and the twins executed a wild war-dance round the group.\n\n[Illustration: \"OUT ON THE LANDING STEPPED VIRGINIA\"]\n\n\"Good heavens! child, where have you been?\" said Mr. Otis, rather\nangrily, thinking that she had been playing some foolish trick on them.\n\"Cecil and I have been riding all over the country looking for you, and\nyour mother has been frightened to death. You must never play these\npractical jokes any more.\"\n\n\"Except on the Ghost! except on the Ghost!\" shrieked the twins, as they\ncapered about.\n\n\"My own darling, thank God you are found; you must never leave my side\nagain,\" murmured Mrs. Otis, as she kissed the trembling child, and\nsmoothed the tangled gold of her hair.\n\n\"Papa,\" said Virginia, quietly, \"I have been with the Ghost. He is dead,\nand you must come and see him. He had been very wicked, but he was\nreally sorry for all that he had done, and he gave me this box of\nbeautiful jewels before he died.\"\n\nThe whole family gazed at her in mute amazement, but she was quite grave\nand serious; and, turning round, she led them through the opening in the\nwainscoting down a narrow secret corridor, Washington following with a\nlighted candle, which he had caught up from the table. Finally, they\ncame to a great oak door, studded with rusty nails. When Virginia\ntouched it, it swung back on its heavy hinges, and they found themselves\nin a little low room, with a vaulted ceiling, and one tiny grated\nwindow. Imbedded in the wall was a huge iron ring, and chained to it was\na gaunt skeleton, that was stretched out at full length on the stone\nfloor, and seemed to be trying to grasp with its long fleshless fingers\nan old-fashioned trencher and ewer, that were placed just out of its\nreach. The jug had evidently been once filled with water, as it was\ncovered inside with green mould. There was nothing on the trencher but\na pile of dust. Virginia knelt down beside the skeleton, and, folding\nher little hands together, began to pray silently, while the rest of the\nparty looked on in wonder at the terrible tragedy whose secret was now\ndisclosed to them.\n\n[Illustration: \"CHAINED TO IT WAS A GAUNT SKELETON\"]\n\n\"Hallo!\" suddenly exclaimed one of the twins, who had been looking out\nof the window to try and discover in what wing of the house the room was\nsituated. \"Hallo! the old withered almond-tree has blossomed. I can see\nthe flowers quite plainly in the moonlight.\"\n\n\"God has forgiven him,\" said Virginia, gravely, as she rose to her feet,\nand a beautiful light seemed to illumine her face.\n\n\"What an angel you are!\" cried the young Duke, and he put his arm round\nher neck, and kissed her.\n\n\n\n\n\nVII\n\n\n[Illustration: \"BY THE SIDE OF THE HEARSE AND THE COACHES WALKED THE\nSERVANTS WITH LIGHTED TORCHES\"]\n\nFour days after these curious incidents, a funeral started from\nCanterville Chase at about eleven o'clock at night. The hearse was drawn\nby eight black horses, each of which carried on its head a great tuft of\nnodding ostrich-plumes, and the leaden coffin was covered by a rich\npurple pall, on which was embroidered in gold the Canterville\ncoat-of-arms. By the side of the hearse and the coaches walked the\nservants with lighted torches, and the whole procession was wonderfully\nimpressive. Lord Canterville was the chief mourner, having come up\nspecially from Wales to attend the funeral, and sat in the first\ncarriage along with little Virginia. Then came the United States\nMinister and his wife, then Washington and the three boys, and in the\nlast carriage was Mrs. Umney. It was generally felt that, as she had\nbeen frightened by the ghost for more than fifty years of her life, she\nhad a right to see the last of him. A deep grave had been dug in the\ncorner of the churchyard, just under the old yew-tree, and the service\nwas read in the most impressive manner by the Rev. Augustus Dampier.\nWhen the ceremony was over, the servants, according to an old custom\nobserved in the Canterville family, extinguished their torches, and, as\nthe coffin was being lowered into the grave, Virginia stepped forward,\nand laid on it a large cross made of white and pink almond-blossoms. As\nshe did so, the moon came out from behind a cloud, and flooded with its\nsilent silver the little churchyard, and from a distant copse a\nnightingale began to sing. She thought of the ghost's description of the\nGarden of Death, her eyes became dim with tears, and she hardly spoke a\nword during the drive home.\n\n[Illustration: \"THE MOON CAME OUT FROM BEHIND A CLOUD\"]\n\nThe next morning, before Lord Canterville went up to town, Mr. Otis had\nan interview with him on the subject of the jewels the ghost had given\nto Virginia. They were perfectly magnificent, especially a certain ruby\nnecklace with old Venetian setting, which was really a superb specimen\nof sixteenth-century work, and their value was so great that Mr. Otis\nfelt considerable scruples about allowing his daughter to accept them.\n\n\"My lord,\" he said, \"I know that in this country mortmain is held to\napply to trinkets as well as to land, and it is quite clear to me that\nthese jewels are, or should be, heirlooms in your family. I must beg\nyou, accordingly, to take them to London with you, and to regard them\nsimply as a portion of your property which has been restored to you\nunder certain strange conditions. As for my daughter, she is merely a\nchild, and has as yet, I am glad to say, but little interest in such\nappurtenances of idle luxury. I am also informed by Mrs. Otis, who, I\nmay say, is no mean authority upon Art,--having had the privilege of\nspending several winters in Boston when she was a girl,--that these gems\nare of great monetary worth, and if offered for sale would fetch a tall\nprice. Under these circumstances, Lord Canterville, I feel sure that you\nwill recognize how impossible it would be for me to allow them to remain\nin the possession of any member of my family; and, indeed, all such\nvain gauds and toys, however suitable or necessary to the dignity of the\nBritish aristocracy, would be completely out of place among those who\nhave been brought up on the severe, and I believe immortal, principles\nof Republican simplicity. Perhaps I should mention that Virginia is very\nanxious that you should allow her to retain the box, as a memento of\nyour unfortunate but misguided ancestor. As it is extremely old, and\nconsequently a good deal out of repair, you may perhaps think fit to\ncomply with her request. For my own part, I confess I am a good deal\nsurprised to find a child of mine expressing sympathy with mediaevalism\nin any form, and can only account for it by the fact that Virginia was\nborn in one of your London suburbs shortly after Mrs. Otis had returned\nfrom a trip to Athens.\"\n\nLord Canterville listened very gravely to the worthy Minister's speech,\npulling his grey moustache now and then to hide an involuntary smile,\nand when Mr. Otis had ended, he shook him cordially by the hand, and\nsaid: \"My dear sir, your charming little daughter rendered my unlucky\nancestor, Sir Simon, a very important service, and I and my family are\nmuch indebted to her for her marvellous courage and pluck. The jewels\nare clearly hers, and, egad, I believe that if I were heartless enough\nto take them from her, the wicked old fellow would be out of his grave\nin a fortnight, leading me the devil of a life. As for their being\nheirlooms, nothing is an heirloom that is not so mentioned in a will or\nlegal document, and the existence of these jewels has been quite\nunknown. I assure you I have no more claim on them than your butler, and\nwhen Miss Virginia grows up, I dare say she will be pleased to have\npretty things to wear. Besides, you forget, Mr. Otis, that you took the\nfurniture and the ghost at a valuation, and anything that belonged to\nthe ghost passed at once into your possession, as, whatever activity\nSir Simon may have shown in the corridor at night, in point of law he\nwas really dead, and you acquired his property by purchase.\"\n\nMr. Otis was a good deal distressed at Lord Canterville's refusal, and\nbegged him to reconsider his decision, but the good-natured peer was\nquite firm, and finally induced the Minister to allow his daughter to\nretain the present the ghost had given her, and when, in the spring of\n1890, the young Duchess of Cheshire was presented at the Queen's first\ndrawing-room on the occasion of her marriage, her jewels were the\nuniversal theme of admiration. For Virginia received the coronet, which\nis the reward of all good little American girls, and was married to her\nboy-lover as soon as he came of age. They were both so charming, and\nthey loved each other so much, that every one was delighted at the\nmatch, except the old Marchioness of Dumbleton, who had tried to catch\nthe Duke for one of her seven unmarried daughters, and had given no less\nthan three expensive dinner-parties for that purpose, and, strange to\nsay, Mr. Otis himself. Mr. Otis was extremely fond of the young Duke\npersonally, but, theoretically, he objected to titles, and, to use his\nown words, \"was not without apprehension lest, amid the enervating\ninfluences of a pleasure-loving aristocracy, the true principles of\nRepublican simplicity should be forgotten.\" His objections, however,\nwere completely overruled, and I believe that when he walked up the\naisle of St. George's, Hanover Square, with his daughter leaning on his\narm, there was not a prouder man in the whole length and breadth of\nEngland.\n\nThe Duke and Duchess, after the honeymoon was over, went down to\nCanterville Chase, and on the day after their arrival they walked over\nin the afternoon to the lonely churchyard by the pine-woods. There had\nbeen a great deal of difficulty at first about the inscription on Sir\nSimon's tombstone, but finally it had been decided to engrave on it\nsimply the initials of the old gentleman's name, and the verse from the\nlibrary window. The Duchess had brought with her some lovely roses,\nwhich she strewed upon the grave, and after they had stood by it for\nsome time they strolled into the ruined chancel of the old abbey. There\nthe Duchess sat down on a fallen pillar, while her husband lay at her\nfeet smoking a cigarette and looking up at her beautiful eyes. Suddenly\nhe threw his cigarette away, took hold of her hand, and said to her,\n\"Virginia, a wife should have no secrets from her husband.\"\n\n\"Dear Cecil! I have no secrets from you.\"\n\n\"Yes, you have,\" he answered, smiling, \"you have never told me what\nhappened to you when you were locked up with the ghost.\"\n\n\"I have never told any one, Cecil,\" said Virginia, gravely.\n\n\"I know that, but you might tell me.\"\n\n\"Please don't ask me, Cecil, I cannot tell you. Poor Sir Simon! I owe\nhim a great deal. Yes, don't laugh, Cecil, I really do. He made me see\nwhat Life is, and what Death signifies, and why Love is stronger than\nboth.\"\n\nThe Duke rose and kissed his wife lovingly.\n\n\"You can have your secret as long as I have your heart,\" he murmured.\n\n\"You have always had that, Cecil.\"\n\n\"And you will tell our children some day, won't you?\"\n\nVirginia blushed.", "title": "The Canterville Ghost"}