{"summary": "Faust is bored and depressed with his life as a scholar. After an attempt to take his own life, he calls on the Devil for further knowledge and magic powers with which to indulge all the pleasure and knowledge of the world. In response, the Devil's representative, Mephistopheles, appears. He makes a bargain with Faust: Mephistopheles will serve Faust with his magic powers for a set number of years, but at the end of the term, the Devil will claim Faust's soul, and Faust will be eternally damned. The term usually stipulated in the early tales is 24 years; one year for each of the hours in a day.\nDuring the term of the bargain, Faust makes use of Mephistopheles in various ways. In many versions of the story, particularly Goethe's drama, Mephistopheles helps Faust seduce a beautiful and innocent girl, usually named Gretchen, whose life is ultimately destroyed. However, Gretchen's innocence saves her in the end, and she enters Heaven. In Goethe's rendition, Faust is saved by God's grace via his constant striving—in combination with Gretchen's pleadings with God in the form of the Eternal Feminine. However, in the early tales, Faust is irrevocably corrupted and believes his sins cannot be forgiven; when the term ends, the Devil carries him off to Hell.\n\n", "full_text": "Proofreading Team\n\n\n\n\n\n\n[Illustration: Faust]\n[Illustration]\n[Illustration]\n[Illustration: _Have you not led this life quite long enough?_]\n\n\n\n\nFAUST\n\n_by_\n\n_Johann Wolfgang von Goethe_\n\nWITH ILLUSTRATIONS BY\n\n_Harry Clarke_\n\nTRANSLATED INTO ENGLISH, IN\nTHE ORIGINAL METRES, BY\n\n_Bayard Taylor_\n\n\n_An Illustrated Edition_\n\nTHE WORLD PUBLISHING COMPANY\n\nCLEVELAND, OHIO NEW YORK, N.Y.\n\n\n\n\nPRINTED IN THE UNITED STATES OF AMERICA\n\n[Illustration]\n\n[Illustration]\n\nCONTENTS\n\n\nPREFACE\nAN GOETHE\nDEDICATION\nPRELUDE AT THE THEATRE\nPROLOGUE IN HEAVEN\n\nSCENE I. NIGHT (_Faust's Monologue_)\n     II. BEFORE THE CITY-GATE\n    III. THE STUDY (_The Exorcism_)\n     IV. THE STUDY (_The Compact_)\n      V. AUERBACH'S CELLAR\n     VI. WITCHES' KITCHEN\n    VII. A STREET\n   VIII. EVENING\n     IX. PROMENADE\n      X. THE NEIGHBOR'S HOUSE\n      XI. STREET\n     XII. GARDEN\n    XIII. A GARDEN-ARBOR\n     XIV. FOREST AND CAVERN\n      XV. MARGARET'S ROOM\n     XVI. MARTHA'S GARDEN\n    XVII. AT THE FOUNTAIN\n   XVIII. DONJON (_Margaret's Prayer_)\n     XIX. NIGHT (_Valentine's Death_)\n      XX. CATHEDRAL\n     XXI. WALPURGIS-NIGHT\n    XXII. OBERON AND TITANIA'S GOLDEN WEDDING\n   XXIII. DREARY DAY\n    XXIV. NIGHT\n     XXV. DUNGEON\n[Illustration]\n\n\n\n\nFAUST\n\n[Illustration]\n\n[Illustration: Preface]\n\nIt is twenty years since I first determined to attempt the translation\nof _Faust_, in the original metres. At that time, although more than a\nscore of English translations of the First Part, and three or four of\nthe Second Part, were in existence, the experiment had not yet been\nmade. The prose version of Hayward seemed to have been accepted as the\nstandard, in default of anything more satisfactory: the English critics,\ngenerally sustaining the translator in his views concerning the\nsecondary importance of form in Poetry, practically discouraged any\nfurther attempt; and no one, familiar with rhythmical expression through\nthe needs of his own nature, had devoted the necessary love and patience\nto an adequate reproduction of the great work of Goethe's life.\n\nMr. Brooks was the first to undertake the task, and the publication of\nhis translation of the First Part (in 1856) induced me, for a time, to\ngive up my own design. No previous English version exhibited such\nabnegation of the translator's own tastes and habits of thought, such\nreverent desire to present the original in its purest form. The care and\nconscience with which the work had been performed were so apparent, that\nI now state with reluctance what then seemed to me to be its only\ndeficiencies,--a lack of the lyrical fire and fluency of the original in\nsome passages, and an occasional lowering of the tone through the use of\nwords which are literal, but not equivalent. The plan of translation\nadopted by Mr. Brooks was so entirely my own, that when further\nresidence in Germany and a more careful study of both parts of _Faust_\nhad satisfied me that the field was still open,--that the means\nfurnished by the poetical affinity of the two languages had not yet been\nexhausted,--nothing remained for me but to follow him in all essential\nparticulars. His example confirmed me in the belief that there were few\ndifficulties in the way of a nearly literal yet thoroughly rhythmical\nversion of _Faust_, which might not be overcome by loving labor. A\ncomparison of seventeen English translations, in the arbitrary metres\nadopted by the translators, sufficiently showed the danger of allowing\nlicense in this respect: the white light of Goethe's thought was thereby\npassed through the tinted glass of other minds, and assumed the coloring\nof each. Moreover, the plea of selecting different metres in the hope of\nproducing a similar effect is unreasonable, where the identical metres\nare possible.\n\nThe value of form, in a poetical work, is the first question to be\nconsidered. No poet ever understood this question more thoroughly than\nGoethe himself, or expressed a more positive opinion in regard to it.\nThe alternative modes of translation which he presents (reported by\nRiemer, quoted by Mrs. Austin, in her \"Characteristics of Goethe,\" and\naccepted by Mr. Hayward),[A] are quite independent of his views\nconcerning the value of form, which we find given elsewhere, in the\nclearest and most emphatic manner.[B] Poetry is not simply a fashion of\nexpression: it is the form of expression absolutely required by a\ncertain class of ideas. Poetry, indeed, may be distinguished from Prose\nby the single circumstance, that it is the utterance of whatever in man\ncannot be perfectly uttered in any other than a rhythmical form: it is\nuseless to say that the naked meaning is independent of the form: on the\ncontrary, the form contributes essentially to the fullness of the\nmeaning. In Poetry which endures through its own inherent vitality,\nthere is no forced union of these two elements. They are as intimately\nblended, and with the same mysterious beauty, as the sexes in the\nancient Hermaphroditus. To attempt to represent Poetry in Prose, is very\nmuch like attempting to translate music into speech.[C]\n\n[A] \"'There are two maxims of translation,' says he: 'the one requires\nthat the author, of a foreign nation, be brought to us in such a manner\nthat we may regard him as our own; the other, on the contrary, demands\nof us that we transport ourselves over to him, and adopt his situation,\nhis mode of speaking, and his peculiarities. The advantages of both are\nsufficiently known to all instructed persons, from masterly examples.'\"\nIs it necessary, however, that there should always be this alternative?\nWhere the languages are kindred, and equally capable of all varieties of\nmetrical expression, may not both these \"maxims\" be observed in the same\ntranslation? Goethe, it is true, was of the opinion that _Faust_ ought\nto be given, in French, in the manner of Clement Marot; but this was\nundoubtedly because he felt the inadequacy of modern French to express\nthe naive, simple realism of many passages. The same objection does not\napply to English. There are a few archaic expressions in _Faust_, but no\nmore than are still allowed--nay, frequently encouraged--in the English\nof our day.\n\n[B] \"You are right,\" said Goethe; \"there are great and mysterious\nagencies included in the various forms of Poetry. If the substance of my\n'Roman Elegies' were to be expressed in the tone and measure of Byron's\n'Don Juan,' it would really have an atrocious effect.\"--_Eckermann_.\n\n\"The rhythm,\" said Goethe, \"is an unconscious result of the poetic mood.\nIf one should stop to consider it mechanically, when about to write a\npoem, one would become bewildered and accomplish nothing of real\npoetical value.\"--_Ibid_.\n\n\"_All that is poetic in character should be rythmically treated_! Such\nis my conviction; and if even a sort of poetic prose should be gradually\nintroduced, it would only show that the distinction between prose and\npoetry had been completely lost sight of.\"--_Goethe to Schiller_, 1797.\n\nTycho Mommsen, in his excellent essay, _Die Kunst des Deutschen\nUebersetzers aus neueren Sprachen_, goes so far as to say: \"The metrical\nor rhymed modelling of a poetical work is so essentially the germ of its\nbeing, that, rather than by giving it up, we might hope to construct a\nsimilar work of art before the eyes of our countrymen, by giving up or\nchanging the substance. The immeasurable result which has followed works\nwherein the form has been retained--such as the Homer of Voss, and the\nShakespeare of Tieck and Schlegel--is an incontrovertible evidence of\nthe vitality of the endeavor.\"\n\n[C] \"Goethe's poems exercise a great sway over me, not only by their\nmeaning, but also by their rhythm. It is a language which stimulates me\nto composition.\"--_Beethoven_.\n\nThe various theories of translation from the Greek and Latin poets have\nbeen admirably stated by Dryden in his Preface to the \"Translations from\nOvid's Epistles,\" and I do not wish to continue the endless\ndiscussion,--especially as our literature needs examples, not opinions.\nA recent expression, however, carries with it so much authority, that I\nfeel bound to present some considerations which the accomplished scholar\nseems to have overlooked. Mr. Lewes[D] justly says: \"The effect of\npoetry is a compound of music and suggestion; this music and this\nsuggestion are intermingled in words, which to alter is to alter the\neffect. For words in poetry are not, as in prose, simple representatives\nof objects and ideas: they are parts of an organic whole,--they are\ntones in the harmony.\" He thereupon illustrates the effect of\ntranslation by changing certain well-known English stanzas into others,\nequivalent in meaning, but lacking their felicity of words, their grace\nand melody. I cannot accept this illustration as valid, because Mr.\nLewes purposely omits the very quality which an honest translator should\nexhaust his skill in endeavoring to reproduce. He turns away from the\n_one best_ word or phrase in the English lines he quotes, whereas the\ntranslator seeks precisely that one best word or phrase (having _all_\nthe resources of his language at command), to represent what is said in\n_another_ language. More than this, his task is not simply mechanical:\nhe must feel, and be guided by, a secondary inspiration. Surrendering\nhimself to the full possession of the spirit which shall speak through\nhim, he receives, also, a portion of the same creative power. Mr. Lewes\nreaches this conclusion: \"If, therefore, we reflect what a poem _Faust_\nis, and that it contains almost every variety of style and metre, it\nwill be tolerably evident that no one unacquainted with the original can\nform an adequate idea of it from translation,\"[E] which is certainly\ncorrect of any translation wherein something of the rhythmical variety\nand beauty of the original is not retained. That very much of the\nrhythmical character may be retained in English, was long ago shown by\nMr. Carlyle,[F] in the passages which he translated, both literally and\nrhythmically, from the _Helena_ (Part Second). In fact, we have so many\ninstances of the possibility of reciprocally transferring the finest\nqualities of English and German poetry, that there is no sufficient\nexcuse for an unmetrical translation of _Faust_. I refer especially to\nsuch subtile and melodious lyrics as \"The Castle by the Sea,\" of Uhland,\nand the \"Silent Land\" of Salis, translated by Mr. Longfellow; Goethe's\n\"Minstrel\" and \"Coptic Song,\" by Dr. Hedge; Heine's \"Two Grenadiers,\" by\nDr. Furness and many of Heine's songs by Mr Leland; and also to the\nGerman translations of English lyrics, by Freiligrath and Strodtmann.[G]\n\n\n[D] Life of Goethe (Book VI.).\n\n[E] Mr. Lewes gives the following advice: \"The English reader would\nperhaps best succeed who should first read Dr. Anster's brilliant\nparaphrase, and then carefully go through Hayward's prose translation.\"\nThis is singularly at variance with the view he has just expressed. Dr.\nAnster's version is an almost incredible dilution of the original,\nwritten in _other_ metres; while Hayward's entirely omits the element of\npoetry.\n\n[F] Foreign Review, 1828.\n\n[G] When Freiligrath can thus give us Walter Scott:--\n\n\"Kommt, wie der Wind kommt, Wenn Waelder erzittern Kommt, wie die\nBrandung Wenn Flotten zersplittern! Schnell heran, schnell herab,\nSchneller kommt Al'e!--Haeuptling und Bub' und Knapp, Herr und Vasalle!\"\n\nor Strodtmann thus reproduce Tennyson:--\n\n\"Es faellt der Strahl auf Burg und Thal, Und schneeige Gipfel, reich an\nSagen; Viel' Lichter wehn auf blauen Seen, Bergab die Wasserstuerze\njagen! Blas, Huefthorn, blas, in Wiederhall erschallend: Blas,\nHorn--antwortet, Echos, hallend, hallend, hallend!\"\n\n--it must be a dull ear which would be satisfied with the omission of\nrhythm and rhyme.\n\nI have a more serious objection, however, to urge against Mr. Hayward's\nprose translation. Where all the restraints of verse are flung aside, we\nshould expect, at least, as accurate a reproduction of the sense,\nspirit, and tone of the original, as the genius of our language will\npermit. So far from having given us such a reproduction, Mr. Hayward not\nonly occasionally mistakes the exact meaning of the German text,[H] but,\nwherever two phrases may be used to express the meaning with equal\nfidelity, he very frequently selects that which has the less grace,\nstrength, or beauty.[I]\n\n[H] On his second page, the line _Mein Lied ertoent der unbekannten\nMenge_, \"My song sounds to the unknown multitude,\" is translated: \"My\n_sorrow_ voices itself to the strange throng.\" Other English\ntranslators, I notice, have followed Mr. Hayward in mistaking _Lied_ for\n_Leid_.\n\nI:\n I take but one out of numerous instances, for the sake of\nillustration. The close of the Soldier's Song (Part I. Scene II.) is:--\n\n          \"Kuehn is das Muehen,\n          Herrlich der Lohn!\n          Und die Soldaten\n          Ziehen davon.\"\n\nLiterally:\n\n          Bold is the endeavor,\n          Splendid the pay!\n          And the soldiers\n          March away.\n\nThis Mr. Hayward translates:--\n\n          Bold the adventure,\n          Noble the reward--\n          And the soldiers\n          Are off.\n\nFor there are few things which may not be said, in English, in a twofold\nmanner,--one poetic, and the other prosaic. In German, equally, a word\nwhich in ordinary use has a bare prosaic character may receive a fairer\nand finer quality from its place in verse. The prose translator should\ncertainly be able to feel the manifestation of this law in both\nlanguages, and should so choose his words as to meet their reciprocal\nrequirements. A man, however, who is not keenly sensible to the power\nand beauty and value of rhythm, is likely to overlook these delicate yet\nmost necessary distinctions. The author's thought is stripped of a last\ngrace in passing through his mind, and frequently presents very much the\nsame resemblance to the original as an unhewn shaft to the fluted\ncolumn. Mr. Hayward unconsciously illustrates his lack of a refined\nappreciation of verse, \"in giving,\" as he says, \"_a sort of rhythmical\narrangement_ to the lyrical parts,\" his object being \"to convey some\nnotion of the variety of versification which forms one great charm of\nthe poem.\" A literal translation is always possible in the unrhymed\npassages; but even here Mr. Hayward's ear did not dictate to him the\nnecessity of preserving the original rhythm.\n\nWhile, therefore, I heartily recognize his lofty appreciation of\n_Faust_,--while I honor him for the patient and conscientious labor he\nhas bestowed upon his translation,--I cannot but feel that he has\nhimself illustrated the unsoundness of his argument. Nevertheless, the\ncircumstance that his prose translation of _Faust_ has received so much\nacceptance proves those qualities of the original work which cannot be\ndestroyed by a test so violent. From the cold bare outline thus\nproduced, the reader unacquainted with the German language would\nscarcely guess what glow of color, what richness of changeful life, what\nfluent grace and energy of movement have been lost in the process. We\nmust, of course, gratefully receive such an outline, where a nearer\napproach to the form of the original is impossible, but, until the\nlatter has been demonstrated, we are wrong to remain content with the\ncheaper substitute.\n\nIt seems to me that in all discussions upon this subject the capacities\nof the English language have received but scanty justice. The\nintellectual tendencies of our race have always been somewhat\nconservative, and its standards of literary taste or belief, once set\nup, are not varied without a struggle. The English ear is suspicious of\nnew metres and unaccustomed forms of expression: there are critical\ndetectives on the track of every author, and a violation of the accepted\ncanons is followed by a summons to judgment. Thus the tendency is to\ncontract rather than to expand the acknowledged excellences of the\nlanguage.[J]\n\n[J] I cannot resist the temptation of quoting the following passage from\nJacob Grimm: \"No one of all the modern languages has acquired a greater\nforce and strength than the English, through the derangement and\nrelinquishment of its ancient laws of sound. The unteachable\n(nevertheless _learnable_) profusion of its middle-tones has conferred\nupon it an intrinsic power of expression, such as no other human tongue\never possessed. Its entire, thoroughly intellectual and wonderfully\nsuccessful foundation and perfected development issued from a marvelous\nunion of the two noblest tongues of Europe, the Germanic and the\nRomanic. Their mutual relation in the English language is well known,\nsince the former furnished chiefly the material basis, while the latter\nadded the intellectual conceptions. The English language, by and through\nwhich the greatest and most eminent poet of modern times--as contrasted\nwith ancient classical poetry--(of course I can refer only to\nShakespeare) was begotten and nourished, has a just claim to be called a\nlanguage of the world; and it appears to be destined, like the English\nrace, to a higher and broader sway in all quarters of the earth. For in\nrichness, in compact adjustment of parts, and in pure intelligence, none\nof the living languages can be compared with it,--not even our German,\nwhich is divided even as we are divided, and which must cast off many\nimperfections before it can boldly enter on its career.\"--_Ueber den\nUrsprung der Sprache_.\n\nThe difficulties in the way of a nearly literal translation of _Faust_\nin the original metres have been exaggerated, because certain affinities\nbetween the two languages have not been properly considered. With all\nthe splendor of versification in the work, it contains but few metres of\nwhich the English tongue is not equally capable. Hood has familiarized\nus with dactylic (triple) rhymes, and they are remarkably abundant and\nskillful in Mr. Lowell's \"Fable for the Critics\": even the unrhymed\niambic hexameter of the _Helena_ occurs now and then in Milton's _Samson\nAgonistes_. It is true that the metrical foot into which the German\nlanguage most naturally falls is the _trochaic_, while in English it is\nthe _iambic_: it is true that German is rich, involved, and tolerant of\nnew combinations, while English is simple, direct, and rather shy of\ncompounds; but precisely these differences are so modified in the German\nof _Faust_ that there is a mutual approach of the two languages. In\n_Faust_, the iambic measure predominates; the style is compact; the many\nlicenses which the author allows himself are all directed towards a\nshorter mode of construction. On the other hand, English metre compels\nthe use of inversions, admits many verbal liberties prohibited to prose,\nand so inclines towards various flexible features of its sister-tongue\nthat many lines of _Faust_ may be repeated in English without the\nslightest change of meaning, measure, or rhyme. There are words, it is\ntrue, with so delicate a bloom upon them that it can in no wise be\npreserved; but even such words will always lose less when they carry\nwith them their rhythmical atmosphere. The flow of Goethe's verse is\nsometimes so similar to that of the corresponding English metre, that\nnot only its harmonies and caesural pauses, but even its punctuation,\nmay be easily retained.\n\nI am satisfied that the difference between a translation of _Faust_ in\nprose or metre is chiefly one of labor,--and of that labor which is\nsuccessful in proportion as it is joyously performed. My own task has\nbeen cheered by the discovery, that the more closely I reproduced the\nlanguage of the original, the more of its rhythmical character was\ntransferred at the same time. If, now and then, there was an inevitable\nalternative of meaning or music, I gave the preference to the former. By\nthe term \"original metres\" I do not mean a rigid, unyielding adherence\nto every foot, line, and rhyme of the German original, although this has\nvery nearly been accomplished. Since the greater part of the work is\nwritten in an irregular measure, the lines varying from three to six\nfeet, and the rhymes arranged according to the author's will, I do not\nconsider that an occasional change in the number of feet, or order of\nrhyme, is any violation of the metrical plan. The single slight liberty\nI have taken with the lyrical passages is in Margaret's song,--\"The King\nof Thule,\"--in which, by omitting the alternate feminine rhymes, yet\nretaining the metre, I was enabled to make the translation strictly\nliteral. If, in two or three instances, I have left a line unrhymed, I\nhave balanced the omission by giving rhymes to other lines which stand\nunrhymed in the original text. For the same reason, I make no apology\nfor the imperfect rhymes, which are frequently a translation as well as\na necessity. With all its supreme qualities, _Faust_ is far from being a\ntechnically perfect work.[K]\n\n[K] \"At present, everything runs in technical grooves, and the critical\ngentlemen begin to wrangle whether in a rhyme an _s_ should correspond\nwith an _s_ and not with _sz_. If I were young and reckless enough, I\nwould purposely offend all such technical caprices: I would use\nalliteration, assonance, false rhyme, just according to my own will or\nconvenience--but, at the same time, I would attend to the main thing,\nand endeavor to say so many good things that every one would be\nattracted to read and remember them.\"--_Goethe_, in 1831.\n\nThe feminine and dactylic rhymes, which have been for the most part\nomitted by all metrical translators except Mr. Brooks, are\nindispensable. The characteristic tone of many passages would be nearly\nlost, without them. They give spirit and grace to the dialogue, point to\nthe aphoristic portions (especially in the Second Part), and an\never-changing music to the lyrical passages. The English language,\nthough not so rich as the German in such rhymes, is less deficient than\nis generally supposed. The difficulty to be overcome is one of\nconstruction rather than of the vocabulary. The present participle can\nonly be used to a limited extent, on account of its weak termination,\nand the want of an accusative form to the noun also restricts the\narrangement of words in English verse. I cannot hope to have been always\nsuccessful; but I have at least labored long and patiently, bearing\nconstantly in mind not only the meaning of the original and the\nmechanical structure of the lines, but also that subtile and haunting\nmusic which seems to govern rhythm instead of being governed by it.\n\nB.T.\n\n[Illustration]\n\n\n\n\nAN GOETHE\n\n_Erhabener Geist, im Geisterreich verloren!\nWo immer Deine lichte Wohnung sey,\nZum hoeh'ren Schaffen bist Du neugeboren,\nUnd singest dort die voll're Litanei.\nVon jenem Streben das Du auserkoren,\nVom reinsten Aether, drin Du athmest frei,\nO neige Dich zu gnaedigem Erwiedern\nDes letzten Wiederhalls von Deinen Liedern!\n\n\nII\n\nDen alten Musen die bestaeubten Kronen\nNahmst Du, zu neuem Glanz, mit kuehner Hand:\nDu loest die Raethsel aeltester Aeonen\nDurch juengeren Glauben, helleren Verstand,\nUnd machst, wo rege Menschengeister wohnen,\nDie ganze Erde Dir zum Vaterland;\nUnd Deine Juenger sehn in Dir, verwundert,\nVerkoerpert schon das werdende Jahrhundert.\n\n\nIII\n\nWas Du gesungen, Aller Lust und Klagen,\nDes Lebens Wiedersprueche, neu vermaehlt,--\nDie Harfe tausendstimmig frisch geschlagen,\nDie Shakspeare einst, die einst Homer gewaehlt,--\nDarf ich in fremde Klaenge uebertragen\nDas Alles, wo so Mancher schon gefehlt?\nLass Deinen Geist in meiner Stimme klingen,\nUnd was Du sangst, lass mich es Dir nachsingen!_\n\nB.T.\n\n[Illustration]\n\n[Illustration: =Dedication=]\n\nAgain ye come, ye hovering Forms! I find ye,\nAs early to my clouded sight ye shone!\nShall I attempt, this once, to seize and bind ye?\nStill o'er my heart is that illusion thrown?\nYe crowd more near! Then, be the reign assigned ye,\nAnd sway me from your misty, shadowy zone!\nMy bosom thrills, with youthful passion shaken,\nFrom magic airs that round your march awaken.\n\nOf joyous days ye bring the blissful vision;\nThe dear, familiar phantoms rise again,\nAnd, like an old and half-extinct tradition,\nFirst Love returns, with Friendship in his train.\nRenewed is Pain: with mournful repetition\nLife tracks his devious, labyrinthine chain,\nAnd names the Good, whose cheating fortune tore them\nFrom happy hours, and left me to deplore them.\n\nThey hear no longer these succeeding measures,\nThe souls, to whom my earliest songs I sang:\n\nDispersed the friendly troop, with all its pleasures,\nAnd still, alas! the echoes first that rang!\nI bring the unknown multitude my treasures;\nTheir very plaudits give my heart a pang,\nAnd those beside, whose joy my Song so flattered,\nIf still they live, wide through the world are scattered.\n\nAnd grasps me now a long-unwonted yearning\nFor that serene and solemn Spirit-Land:\nMy song, to faint Aeolian murmurs turning,\nSways like a harp-string by the breezes fanned.\nI thrill and tremble; tear on tear is burning,\nAnd the stern heart is tenderly unmanned.\nWhat I possess, I see far distant lying,\nAnd what I lost, grows real and undying.\n\n[Illustration]\n\n[Illustration: =Prelude at the Theatre=]\n\n\n\nMANAGER    DRAMATIC POET    MERRY-ANDREW\n\nMANAGER\n\nYou two, who oft a helping hand\nHave lent, in need and tribulation.\nCome, let me know your expectation\nOf this, our enterprise, in German land!\nI wish the crowd to feel itself well treated,\nEspecially since it lives and lets me live;\nThe posts are set, the booth of boards completed.\nAnd each awaits the banquet I shall give.\nAlready there, with curious eyebrows raised,\nThey sit sedate, and hope to be amazed.\nI know how one the People's taste may flatter,\nYet here a huge embarrassment I feel:\nWhat they're accustomed to, is no great matter,\nBut then, alas! they've read an awful deal.\nHow shall we plan, that all be fresh and new,--\nImportant matter, yet attractive too?\nFor 'tis my pleasure-to behold them surging,\nWhen to our booth the current sets apace,\nAnd with tremendous, oft-repeated urging,\nSqueeze onward through the narrow gate of grace:\nBy daylight even, they push and cram in\nTo reach the seller's box, a fighting host,\nAnd as for bread, around a baker's door, in famine,\nTo get a ticket break their necks almost.\nThis miracle alone can work the Poet\nOn men so various: now, my friend, pray show it.\n\n\nPOET\n\n\nSpeak not to me of yonder motley masses,\nWhom but to see, puts out the fire of Song!\nHide from my view the surging crowd that passes,\nAnd in its whirlpool forces us along!\nNo, lead me where some heavenly silence glasses\nThe purer joys that round the Poet throng,--\nWhere Love and Friendship still divinely fashion\nThe bonds that bless, the wreaths that crown his passion!\nAh, every utterance from the depths of feeling\nThe timid lips have stammeringly expressed,--\nNow failing, now, perchance, success revealing,--\nGulps the wild Moment in its greedy breast;\nOr oft, reluctant years its warrant sealing,\nIts perfect stature stands at last confessed!\nWhat dazzles, for the Moment spends its spirit:\nWhat's genuine, shall Posterity inherit.\n\n\nMERRY-ANDREW\n\n\nPosterity! Don't name the word to me!\nIf _I_ should choose to preach Posterity,\nWhere would you get contemporary fun?\nThat men _will_ have it, there's no blinking:\nA fine young fellow's presence, to my thinking,\nIs something worth, to every one.\nWho genially his nature can outpour,\nTakes from the People's moods no irritation;\nThe wider circle he acquires, the more\nSecurely works his inspiration.\nThen pluck up heart, and give us sterling coin!\nLet Fancy be with her attendants fitted,--\nSense, Reason, Sentiment, and Passion join,--\nBut have a care, lest Folly be omitted!\n\nMANAGER\n\nChiefly, enough of incident prepare!\nThey come to look, and they prefer to stare.\nReel off a host of threads before their faces,\nSo that they gape in stupid wonder: then\nBy sheer diffuseness you have won their graces,\nAnd are, at once, most popular of men.\nOnly by mass you touch the mass; for any\nWill finally, himself, his bit select:\nWho offers much, brings something unto many,\nAnd each goes home content with the effect,\nIf you've a piece, why, just in pieces give it:\nA hash, a stew, will bring success, believe it!\n'Tis easily displayed, and easy to invent.\nWhat use, a Whole compactly to present?\nYour hearers pick and pluck, as soon as they receive it!\n\nPOET\n\nYou do not feel, how such a trade debases;\nHow ill it suits the Artist, proud and true!\nThe botching work each fine pretender traces\nIs, I perceive, a principle with you.\n\nMANAGER\n\nSuch a reproach not in the least offends;\nA man who some result intends\nMust use the tools that best are fitting.\nReflect, soft wood is given to you for splitting,\nAnd then, observe for whom you write!\nIf one comes bored, exhausted quite,\nAnother, satiate, leaves the banquet's tapers,\nAnd, worst of all, full many a wight\nIs fresh from reading of the daily papers.\nIdly to us they come, as to a masquerade,\nMere curiosity their spirits warming:\nThe ladies with themselves, and with their finery, aid,\nWithout a salary their parts performing.\nWhat dreams are yours in high poetic places?\nYou're pleased, forsooth, full houses to behold?\nDraw near, and view your patrons' faces!\nThe half are coarse, the half are cold.\nOne, when the play is out, goes home to cards;\nA wild night on a wench's breast another chooses:\nWhy should you rack, poor, foolish bards,\nFor ends like these, the gracious Muses?\nI tell you, give but more--more, ever more, they ask:\nThus shall you hit the mark of gain and glory.\nSeek to confound your auditory!\nTo satisfy them is a task.--\nWhat ails you now? Is't suffering, or pleasure?\n\nPOET\n\nGo, find yourself a more obedient slave!\nWhat! shall the Poet that which Nature gave,\nThe highest right, supreme Humanity,\nForfeit so wantonly, to swell your treasure?\nWhence o'er the heart his empire free?\nThe elements of Life how conquers he?\nIs't not his heart's accord, urged outward far and dim,\nTo wind the world in unison with him?\nWhen on the spindle, spun to endless distance,\nBy Nature's listless hand the thread is twirled,\nAnd the discordant tones of all existence\nIn sullen jangle are together hurled,\nWho, then, the changeless orders of creation\nDivides, and kindles into rhythmic dance?\nWho brings the One to join the general ordination,\nWhere it may throb in grandest consonance?\nWho bids the storm to passion stir the bosom?\nIn brooding souls the sunset burn above?\nWho scatters every fairest April blossom\nAlong the shining path of Love?\nWho braids the noteless leaves to crowns, requiting\nDesert with fame, in Action's every field?\nWho makes Olympus sure, the Gods uniting?\nThe might of Man, as in the Bard revealed.\n\nMERRY-ANDREW\n\nSo, these fine forces, in conjunction,\nPropel the high poetic function,\nAs in a love-adventure they might play!\nYou meet by accident; you feel, you stay,\nAnd by degrees your heart is tangled;\nBliss grows apace, and then its course is jangled;\nYou're ravished quite, then comes a touch of woe,\nAnd there's a neat romance, completed ere you know!\nLet us, then, such a drama give!\nGrasp the exhaustless life that all men live!\nEach shares therein, though few may comprehend:\nWhere'er you touch, there's interest without end.\nIn motley pictures little light,\nMuch error, and of truth a glimmering mite,\nThus the best beverage is supplied,\nWhence all the world is cheered and edified.\nThen, at your play, behold the fairest flower\nOf youth collect, to hear the revelation!\nEach tender soul, with sentimental power,\nSucks melancholy food from your creation;\nAnd now in this, now that, the leaven works.\nFor each beholds what in his bosom lurks.\nThey still are moved at once to weeping or to laughter,\nStill wonder at your flights, enjoy the show they see:\nA mind, once formed, is never suited after;\nOne yet in growth will ever grateful be.\n\nPOET\n\nThen give me back that time of pleasures,\nWhile yet in joyous growth I sang,--\nWhen, like a fount, the crowding measures\nUninterrupted gushed and sprang!\nThen bright mist veiled the world before me,\nIn opening buds a marvel woke,\nAs I the thousand blossoms broke,\nWhich every valley richly bore me!\nI nothing had, and yet enough for youth--\nJoy in Illusion, ardent thirst for Truth.\nGive, unrestrained, the old emotion,\nThe bliss that touched the verge of pain,\nThe strength of Hate, Love's deep devotion,--\nO, give me back my youth again!\n\nMERRY ANDREW\n\nYouth, good my friend, you certainly require\nWhen foes in combat sorely press you;\nWhen lovely maids, in fond desire,\nHang on your bosom and caress you;\nWhen from the hard-won goal the wreath\nBeckons afar, the race awaiting;\nWhen, after dancing out your breath,\nYou pass the night in dissipating:--\nBut that familiar harp with soul\nTo play,--with grace and bold expression,\nAnd towards a self-erected goal\nTo walk with many a sweet digression,--\nThis, aged Sirs, belongs to you,\nAnd we no less revere you for that reason:\nAge childish makes, they say, but 'tis not true;\nWe're only genuine children still, in Age's season!\n\n\nMANAGER\n\nThe words you've bandied are sufficient;\n'Tis deeds that I prefer to see:\nIn compliments you're both proficient,\nBut might, the while, more useful be.\nWhat need to talk of Inspiration?\n'Tis no companion of Delay.\nIf Poetry be your vocation,\nLet Poetry your will obey!\nFull well you know what here is wanting;\nThe crowd for strongest drink is panting,\nAnd such, forthwith, I'd have you brew.\nWhat's left undone to-day, To-morrow will not do.\nWaste not a day in vain digression:\nWith resolute, courageous trust\nSeize every possible impression,\nAnd make it firmly your possession;\nYou'll then work on, because you must.\nUpon our German stage, you know it,\nEach tries his hand at what he will;\nSo, take of traps and scenes your fill,\nAnd all you find, be sure to show it!\nUse both the great and lesser heavenly light,--\nSquander the stars in any number,\nBeasts, birds, trees, rocks, and all such lumber,\nFire, water, darkness, Day and Night!\nThus, in our booth's contracted sphere,\nThe circle of Creation will appear,\nAnd move, as we deliberately impel,\nFrom Heaven, across the World, to Hell!\n[Illustration]\n[Illustration]\n\nPROLOGUE IN HEAVEN\n\nTHE LORD THE HEAVENLY HOST _Afterwards_\nMEPHISTOPHELES\n\n(_The_ THREE ARCHANGELS _come forward_.)\n\n\nRAPHAEL\n\nThe sun-orb sings, in emulation,\n'Mid brother-spheres, his ancient round:\nHis path predestined through Creation\nHe ends with step of thunder-sound.\nThe angels from his visage splendid\nDraw power, whose measure none can say;\nThe lofty works, uncomprehended,\nAre bright as on the earliest day.\n\n\nGABRIEL\n\nAnd swift, and swift beyond conceiving,\nThe splendor of the world goes round,\nDay's Eden-brightness still relieving\nThe awful Night's intense profound:\nThe ocean-tides in foam are breaking,\nAgainst the rocks' deep bases hurled,\nAnd both, the spheric race partaking,\nEternal, swift, are onward whirled!\n\n\nMICHAEL\n\nAnd rival storms abroad are surging\nFrom sea to land, from land to sea.\nA chain of deepest action forging\nRound all, in wrathful energy.\nThere flames a desolation, blazing\nBefore the Thunder's crashing way:\nYet, Lord, Thy messengers are praising\nThe gentle movement of Thy Day.\n\n\nTHE THREE\n\nThough still by them uncomprehended,\nFrom these the angels draw their power,\nAnd all Thy works, sublime and splendid,\nAre bright as in Creation's hour.\n\n\nMEPHISTOPHELES\n\nSince Thou, O Lord, deign'st to approach again\nAnd ask us how we do, in manner kindest,\nAnd heretofore to meet myself wert fain,\nAmong Thy menials, now, my face Thou findest.\nPardon, this troop I cannot follow after\nWith lofty speech, though by them scorned and spurned:\nMy pathos certainly would move Thy laughter,\nIf Thou hadst not all merriment unlearned.\nOf suns and worlds I've nothing to be quoted;\nHow men torment themselves, is all I've noted.\nThe little god o' the world sticks to the same old way,\nAnd is as whimsical as on Creation's day.\nLife somewhat better might content him,\nBut for the gleam of heavenly light which Thou hast lent\n  him:\nHe calls it Reason--thence his power's increased,\nTo be far beastlier than any beast.\nSaving Thy Gracious Presence, he to me\nA long-legged grasshopper appears to be,\nThat springing flies, and flying springs,\nAnd in the grass the same old ditty sings.\nWould he still lay among the grass he grows in!\nEach bit of dung he seeks, to stick his nose in.\n\n\nTHE LORD\n\nHast thou, then, nothing more to mention?\nCom'st ever, thus, with ill intention?\nFind'st nothing right on earth, eternally?\n\n\nMEPHISTOPHELES\n\nNo, Lord! I find things, there, still bad as they can be.\nMan's misery even to pity moves my nature;\nI've scarce the heart to plague the wretched creature.\n\n\nTHE LORD\n\nKnow'st Faust?\n\n\nMEPHISTOPHELES\n\nThe Doctor Faust?\n\n\nTHE LORD\n\nMy servant, he!\n\n\nMEPHISTOPHELES\n\nForsooth! He serves you after strange devices:\nNo earthly meat or drink the fool suffices:\nHis spirit's ferment far aspireth;\nHalf conscious of his frenzied, crazed unrest,\nThe fairest stars from Heaven he requireth,\nFrom Earth the highest raptures and the best,\nAnd all the Near and Far that he desireth\nFails to subdue the tumult of his breast.\n\n\nTHE LORD\n\nThough still confused his service unto Me,\nI soon shall lead him to a clearer morning.\nSees not the gardener, even while buds his tree,\nBoth flower and fruit the future years adorning?\n\n\nMEPHISTOPHELES\n\nWhat will you bet? There's still a chance to gain him,\nIf unto me full leave you give,\nGently upon _my_ road to train him!\n\n\nTHE LORD\n\nAs long as he on earth shall live,\nSo long I make no prohibition.\nWhile Man's desires and aspirations stir,\nHe cannot choose but err.\n\n\nMEPHISTOPHELES\n\nMy thanks! I find the dead no acquisition,\nAnd never cared to have them in my keeping.\nI much prefer the cheeks where ruddy blood is leaping,\nAnd when a corpse approaches, close my house:\nIt goes with me, as with the cat the mouse.\n\n\nTHE LORD\n\nEnough! What thou hast asked is granted.\nTurn off this spirit from his fountain-head;\nTo trap him, let thy snares be planted,\nAnd him, with thee, be downward led;\nThen stand abashed, when thou art forced to say:\nA good man, through obscurest aspiration,\nHas still an instinct of the one true way.\n\n\nMEPHISTOPHELES\n\nAgreed! But 'tis a short probation.\nAbout my bet I feel no trepidation.\nIf I fulfill my expectation,\nYou'll let me triumph with a swelling breast:\nDust shall he eat, and with a zest,\nAs did a certain snake, my near relation.\n\n\nTHE LORD\n\nTherein thou'rt free, according to thy merits;\nThe like of thee have never moved My hate.\nOf all the bold, denying Spirits,\nThe waggish knave least trouble doth create.\nMan's active nature, flagging, seeks too soon the level;\nUnqualified repose he learns to crave;\nWhence, willingly, the comrade him I gave,\nWho works, excites, and must create, as Devil.\nBut ye, God's sons in love and duty,\nEnjoy the rich, the ever-living Beauty!\nCreative Power, that works eternal schemes,\nClasp you in bonds of love, relaxing never,\nAnd what in wavering apparition gleams\nFix in its place with thoughts that stand forever!\n\n\n(_Heaven closes: the_ ARCHANGELS _separate_.)\n\n\nMEPHISTOPHELES (_solus_)\n\nI like, at times, to hear The Ancient's word,\nAnd have a care to be most civil:\nIt's really kind of such a noble Lord\nSo humanly to gossip with the Devil!\n[Illustration]\n[Illustration]\n\n\n\n\nFIRST PART OF THE TRAGEDY\n\nI\n\nNIGHT\n\n(_A lofty-arched, narrow, Gothic chamber_. FAUST, _in a chair at his\ndesk, restless_.)\n\n\nFAUST\n\nI've studied now Philosophy\nAnd Jurisprudence, Medicine,--\nAnd even, alas! Theology,--\nFrom end to end, with labor keen;\nAnd here, poor fool! with all my lore\nI stand, no wiser than before:\nI'm Magister--yea, Doctor--hight,\nAnd straight or cross-wise, wrong or right,\nThese ten years long, with many woes,\nI've led my scholars by the nose,--\nAnd see, that nothing can be known!\n_That_ knowledge cuts me to the bone.\nI'm cleverer, true, than those fops of teachers,\nDoctors and Magisters, Scribes and Preachers;\nNeither scruples nor doubts come now to smite me,\nNor Hell nor Devil can longer affright me.\n\nFor this, all pleasure am I foregoing;\nI do not pretend to aught worth knowing,\nI do not pretend I could be a teacher\nTo help or convert a fellow-creature.\nThen, too, I've neither lands nor gold,\nNor the world's least pomp or honor hold--\nNo dog would endure such a curst existence!\nWherefore, from Magic I seek assistance,\nThat many a secret perchance I reach\nThrough spirit-power and spirit-speech,\nAnd thus the bitter task forego\nOf saying the things I do not know,--\nThat I may detect the inmost force\nWhich binds the world, and guides its course;\nIts germs, productive powers explore,\nAnd rummage in empty words no more!\n\nO full and splendid Moon, whom I\nHave, from this desk, seen climb the sky\nSo many a midnight,--would thy glow\nFor the last time beheld my woe!\nEver thine eye, most mournful friend,\nO'er books and papers saw me bend;\nBut would that I, on mountains grand,\nAmid thy blessed light could stand,\nWith spirits through mountain-caverns hover,\nFloat in thy twilight the meadows over,\nAnd, freed from the fumes of lore that swathe me,\nTo health in thy dewy fountains bathe me!\n\nAh, me! this dungeon still I see.\nThis drear, accursed masonry,\nWhere even the welcome daylight strains\nBut duskly through the painted panes.\nHemmed in by many a toppling heap\nOf books worm-eaten, gray with dust,\nWhich to the vaulted ceiling creep,\nAgainst the smoky paper thrust,--\nWith glasses, boxes, round me stacked,\nAnd instruments together hurled,\nAncestral lumber, stuffed and packed--\nSuch is my world: and what a world!\n\nAnd do I ask, wherefore my heart\nFalters, oppressed with unknown needs?\nWhy some inexplicable smart\nAll movement of my life impedes?\nAlas! in living Nature's stead,\nWhere God His human creature set,\nIn smoke and mould the fleshless dead\nAnd bones of beasts surround me yet!\n\nFly! Up, and seek the broad, free land!\nAnd this one Book of Mystery\nFrom Nostradamus' very hand,\nIs't not sufficient company?\nWhen I the starry courses know,\nAnd Nature's wise instruction seek,\nWith light of power my soul shall glow,\nAs when to spirits spirits speak.\nTis vain, this empty brooding here,\nThough guessed the holy symbols be:\nYe, Spirits, come--ye hover near--\nOh, if you hear me, answer me!\n\n(_He opens the Book, and perceives the sign of the Macrocosm_.)\n\nHa! what a sudden rapture leaps from this\nI view, through all my senses swiftly flowing!\nI feel a youthful, holy, vital bliss\nIn every vein and fibre newly glowing.\nWas it a God, who traced this sign,\nWith calm across my tumult stealing,\nMy troubled heart to joy unsealing,\nWith impulse, mystic and divine,\nThe powers of Nature here, around my path, revealing?\nAm I a God?--so clear mine eyes!\nIn these pure features I behold\nCreative Nature to my soul unfold.\nWhat says the sage, now first I recognize:\n\"The spirit-world no closures fasten;\nThy sense is shut, thy heart is dead:\nDisciple, up! untiring, hasten\nTo bathe thy breast in morning-red!\"\n\n(_He contemplates the sign_.)\n\nHow each the Whole its substance gives,\nEach in the other works and lives!\nLike heavenly forces rising and descending,\nTheir golden urns reciprocally lending,\nWith wings that winnow blessing\nFrom Heaven through Earth I see them pressing,\nFilling the All with harmony unceasing!\nHow grand a show! but, ah! a show alone.\nThee, boundless Nature, how make thee my own?\nWhere you, ye beasts? Founts of all Being, shining,\nWhereon hang Heaven's and Earth's desire,\nWhereto our withered hearts aspire,--\nYe flow, ye feed: and am I vainly pining?\n\n(_He turns the leaves impatiently, and perceives the sign of the\nEarth-Spirit_.)\n\nHow otherwise upon me works this sign!\nThou, Spirit of the Earth, art nearer:\nEven now my powers are loftier, clearer;\nI glow, as drunk with new-made wine:\nNew strength and heart to meet the world incite me,\nThe woe of earth, the bliss of earth, invite me,\nAnd though the shock of storms may smite me,\nNo crash of shipwreck shall have power to fright me!\nClouds gather over me--\nThe moon conceals her light--\nThe lamp's extinguished!--\nMists rise,--red, angry rays are darting\nAround my head!--There falls\nA horror from the vaulted roof,\nAnd seizes me!\nI feel thy presence, Spirit I invoke!\nReveal thyself!\nHa! in my heart what rending stroke!\nWith new impulsion\nMy senses heave in this convulsion!\nI feel thee draw my heart, absorb, exhaust me:\nThou must! thou must! and though my life it cost me!\n\n(_He seizes the book, and mysteriously pronounces the sign of\nthe Spirit. A ruddy flame flashes: the Spirit appears in\nthe flame_.)\n\n\nSPIRIT\n\nWho calls me?\n\n\nFAUST (_with averted head_)\n\nTerrible to see!\n\n\nSPIRIT\n\nMe hast thou long with might attracted,\nLong from my sphere thy food exacted,\nAnd now--\n\nFAUST\n\n  Woe! I endure not thee!\n\n\nSPIRIT\n\nTo view me is thine aspiration,\nMy voice to hear, my countenance to see;\nThy powerful yearning moveth me,\nHere am I!--what mean perturbation\nThee, superhuman, shakes? Thy soul's high calling, where?\nWhere is the breast, which from itself a world did bear,\nAnd shaped and cherished--which with joy expanded,\nTo be our peer, with us, the Spirits, banded?\nWhere art thou, Faust, whose voice has pierced to me,\nWho towards me pressed with all thine energy?\n_He_ art thou, who, my presence breathing, seeing,\nTrembles through all the depths of being,\nA writhing worm, a terror-stricken form?\n\n\nFAUST\n\nThee, form of flame, shall I then fear?\nYes, I am Faust: I am thy peer!\n\n\nSPIRIT\n\n  In the tides of Life, in Action's storm,\n  A fluctuant wave,\n  A shuttle free,\n  Birth and the Grave,\n  An eternal sea,\n  A weaving, flowing\n  Life, all-glowing,\nThus at Time's humming loom 'tis my hand prepares\nThe garment of Life which the Deity wears!\n\n\nFAUST\n\nThou, who around the wide world wendest,\nThou busy Spirit, how near I feel to thee!\n\n\nSPIRIT\n\nThou'rt like the Spirit which thou comprehendest,\nNot me!\n\n(_Disappears_.)\n\n\nFAUST (_overwhelmed_)\n\nNot thee!\nWhom then?\nI, image of the Godhead!\nNot even like thee!\n\n(_A knock_).\n\nO Death!--I know it--'tis my Famulus!\nMy fairest luck finds no fruition:\nIn all the fullness of my vision\nThe soulless sneak disturbs me thus!\n\n(_Enter_ WAGNER_, in dressing-gown and night-cap, a lamp in\nhis hand. _FAUST_ turns impatiently_.)\n\n\nWAGNER\n\nPardon, I heard your declamation;\n'Twas sure an old Greek tragedy you read?\nIn such an art I crave some preparation,\nSince now it stands one in good stead.\nI've often heard it said, a preacher\nMight learn, with a comedian for a teacher.\n\n\nFAUST\n\nYes, when the priest comedian is by nature,\nAs haply now and then the case may be.\n\n\nWAGNER\n\nAh, when one studies thus, a prisoned creature,\nThat scarce the world on holidays can see,--\nScarce through a glass, by rare occasion,\nHow shall one lead it by persuasion?\n\n\nFAUST\n\nYou'll ne'er attain it, save you know the feeling,\nSave from the soul it rises clear,\nSerene in primal strength, compelling\nThe hearts and minds of all who hear.\nYou sit forever gluing, patching;\nYou cook the scraps from others' fare;\nAnd from your heap of ashes hatching\nA starveling flame, ye blow it bare!\nTake children's, monkeys' gaze admiring,\nIf such your taste, and be content;\nBut ne'er from heart to heart you'll speak inspiring,\nSave your own heart is eloquent!\n\n\nWAGNER\n\nYet through delivery orators succeed;\nI feel that I am far behind, indeed.\n\n\nFAUST\n\nSeek thou the honest recompense!\nBeware, a tinkling fool to be!\nWith little art, clear wit and sense\nSuggest their own delivery;\nAnd if thou'rt moved to speak in earnest,\nWhat need, that after words thou yearnest?\nYes, your discourses, with their glittering show,\nWhere ye for men twist shredded thought like paper,\nAre unrefreshing as the winds that blow\nThe rustling leaves through chill autumnal vapor!\n\n\nWAGNER\n\nAh, God! but Art is long,\nAnd Life, alas! is fleeting.\nAnd oft, with zeal my critic-duties meeting,\nIn head and breast there's something wrong.\n\nHow hard it is to compass the assistance\nWhereby one rises to the source!\nAnd, haply, ere one travels half the course\nMust the poor devil quit existence.\n\n\nFAUST\n\nIs parchment, then, the holy fount before thee,\nA draught wherefrom thy thirst forever slakes?\nNo true refreshment can restore thee,\nSave what from thine own soul spontaneous breaks.\n\n\nWAGNER\n\nPardon! a great delight is granted\nWhen, in the spirit of the ages planted,\nWe mark how, ere our times, a sage has thought,\nAnd then, how far his work, and grandly, we have brought.\n\n\nFAUST\n\nO yes, up to the stars at last!\nListen, my friend: the ages that are past\nAre now a book with seven seals protected:\nWhat you the Spirit of the Ages call\nIs nothing but the spirit of you all,\nWherein the Ages are reflected.\nSo, oftentimes, you miserably mar it!\nAt the first glance who sees it runs away.\nAn offal-barrel and a lumber-garret,\nOr, at the best, a Punch-and-Judy play,\nWith maxims most pragmatical and hitting,\nAs in the mouths of puppets are befitting!\n\n\nWAGNER\n\nBut then, the world--the human heart and brain!\nOf these one covets some slight apprehension.\n\n\nFAUST\n\nYes, of the kind which men attain!\nWho dares the child's true name in public mention?\nThe few, who thereof something really learned,\nUnwisely frank, with hearts that spurned concealing,\nAnd to the mob laid bare each thought and feeling,\nHave evermore been crucified and burned.\nI pray you, Friend, 'tis now the dead of night;\nOur converse here must be suspended.\n\n\nWAGNER\n\nI would have shared your watches with delight,\nThat so our learned talk might be extended.\nTo-morrow, though, I'll ask, in Easter leisure,\nThis and the other question, at your pleasure.\nMost zealously I seek for erudition:\nMuch do I know--but to know all is my ambition.\n\n                                            [_Exit_.\n\n\nFAUST (_solus_)\n\nThat brain, alone, not loses hope, whose choice is\nTo stick in shallow trash forevermore,--\nWhich digs with eager hand for buried ore,\nAnd, when it finds an angle-worm, rejoices!\n\nDare such a human voice disturb the flow,\nAround me here, of spirit-presence fullest?\nAnd yet, this once my thanks I owe\nTo thee, of all earth's sons the poorest, dullest!\nFor thou hast torn me from that desperate state\nWhich threatened soon to overwhelm my senses:\nThe apparition was so giant-great,\nIt dwarfed and withered all my soul's pretences!\n\nI, image of the Godhead, who began--\nDeeming Eternal Truth secure in nearness--\nYe choirs, have ye begun the sweet, consoling chant,\nWhich, through the night of Death, the angels ministrant\nSang, God's new Covenant repeating?\n\n\nCHORUS OF WOMEN\n\n          With spices and precious\n          Balm, we arrayed him;\n          Faithful and gracious,\n          We tenderly laid him:\n          Linen to bind him\n          Cleanlily wound we:\n          Ah! when we would find him,\n          Christ no more found we!\n\n\nCHORUS OF ANGELS\n\n          Christ is ascended!\n          Bliss hath invested him,--\n          Woes that molested him,\n          Trials that tested him,\n          Gloriously ended!\n\n\nFAUST\n\nWhy, here in dust, entice me with your spell,\nYe gentle, powerful sounds of Heaven?\nPeal rather there, where tender natures dwell.\nYour messages I hear, but faith has not been given;\nThe dearest child of Faith is Miracle.\nI venture not to soar to yonder regions\nWhence the glad tidings hither float;\nAnd yet, from childhood up familiar with the note,\nTo Life it now renews the old allegiance.\nOnce Heavenly Love sent down a burning kiss\nUpon my brow, in Sabbath silence holy;\nAnd, filled with mystic presage, chimed the church-bell slowly,\nAnd prayer dissolved me in a fervent bliss.\nA sweet, uncomprehended yearning\nDrove forth my feet through woods and meadows free,\nAnd while a thousand tears were burning,\nI felt a world arise for me.\nThese chants, to youth and all its sports appealing,\nProclaimed the Spring's rejoicing holiday;\nAnd Memory holds me now, with childish feeling,\nBack from the last, the solemn way.\nSound on, ye hymns of Heaven, so sweet and mild!\nMy tears gush forth: the Earth takes back her child!\n\n\nCHORUS OF DISCIPLES\n\n        Has He, victoriously,\n        Burst from the vaulted\n        Grave, and all-gloriously\n        Now sits exalted?\n        Is He, in glow of birth,\n        Rapture creative near?\n        Ah! to the woe of earth\n        Still are we native here.\n        We, his aspiring\n        Followers, Him we miss;\n        Weeping, desiring,\n        Master, Thy bliss!\n\nCHORUS OF ANGELS\n\n        Christ is arisen,\n        Out of Corruption's womb:\n        Burst ye the prison,\n        Break from your gloom!\n        Praising and pleading him,\n        Lovingly needing him,\n        Brotherly feeding him,\n        Preaching and speeding him,\n        Blessing, succeeding Him,\n        Thus is the Master near,--\n        Thus is He here!\n[Illustration]\n\n\n\n\nII\n\nBEFORE THE CITY-GATE\n\n(_Pedestrians of all kinds come forth_.)\n\n\nSEVERAL APPRENTICES\n\nWhy do you go that way?\n\n\nOTHERS\n\nWe're for the Hunters' lodge, to-day.\n\n\nTHE FIRST\n\nWe'll saunter to the Mill, in yonder hollow.\n\n\nAN APPRENTICE\n\nGo to the River Tavern, I should say.\n\n\nSECOND APPRENTICE\n\nBut then, it's not a pleasant way.\n\n\nTHE OTHERS\n\nAnd what will _you_?\n\nA THIRD\n\n            As goes the crowd, I follow.\n\n\nA FOURTH\n\nCome up to Burgdorf? There you'll find good cheer,\nThe finest lasses and the best of beer,\nAnd jolly rows and squabbles, trust me!\n\n\nA FIFTH\n\nYou swaggering fellow, is your hide\nA third time itching to be tried?\nI won't go there, your jolly rows disgust me!\n\n\nSERVANT-GIRL\n\nNo,--no! I'll turn and go to town again.\n\n\nANOTHER\n\nWe'll surely find him by those poplars yonder.\n\n\nTHE FIRST\n\nThat's no great luck for me, 'tis plain.\nYou'll have him, when and where you wander:\nHis partner in the dance you'll be,--\nBut what is all your fun to me?\n\n\nTHE OTHER\n\nHe's surely not alone to-day:\nHe'll be with Curly-head, I heard him say.\n\n\nA STUDENT\n\nDeuce! how they step, the buxom wenches!\nCome, Brother! we must see them to the benches.\nA strong, old beer, a pipe that stings and bites,\nA girl in Sunday clothes,--these three are my delights.\n\n\nCITIZEN'S DAUGHTER\n\nJust see those handsome fellows, there!\nIt's really shameful, I declare;--\nTo follow servant-girls, when they\nMight have the most genteel society to-day!\n\n\nSECOND STUDENT (_to the First_)\n\nNot quite so fast! Two others come behind,--\nThose, dressed so prettily and neatly.\nMy neighbor's one of them, I find,\nA girl that takes my heart, completely.\nThey go their way with looks demure,\nBut they'll accept us, after all, I'm sure.\n\n\nTHE FIRST\n\nNo, Brother! not for me their formal ways.\nQuick! lest our game escape us in the press:\nThe hand that wields the broom on Saturdays\nWill best, on Sundays, fondle and caress.\n\n\nCITIZEN\n\nHe suits me not at all, our new-made Burgomaster!\nSince he's installed, his arrogance grows faster.\nHow has he helped the town, I say?\nThings worsen,--what improvement names he?\nObedience, more than ever, claims he,\nAnd more than ever we must pay!\n\n\nBEGGAR (_sings_)\n\n  Good gentlemen and lovely ladies,\n  So red of cheek and fine of dress,\n  Behold, how needful here your aid is,\n  And see and lighten my distress!\n  Let me not vainly sing my ditty;\n  He's only glad who gives away:\n  A holiday, that shows your pity,\n  Shall be for me a harvest-day!\n\n\nANOTHER CITIZEN\n\nOn Sundays, holidays, there's naught I take delight in,\nLike gossiping of war, and war's array,\nWhen down in Turkey, far away,\nThe foreign people are a-fighting.\nOne at the window sits, with glass and friends,\nAnd sees all sorts of ships go down the river gliding:\nAnd blesses then, as home he wends\nAt night, our times of peace abiding.\n\n\nTHIRD CITIZEN\n\nYes, Neighbor! that's my notion, too:\nWhy, let them break their heads, let loose their passions,\nAnd mix things madly through and through,\nSo, here, we keep our good old fashions!\n\n\nOLD WOMAN (_to the Citizen's Daughter_)\n\nDear me, how fine! So handsome, and so young!\nWho wouldn't lose his heart, that met you?\nDon't be so proud! I'll hold my tongue,\nAnd what you'd like I'll undertake to get you.\n\n\nCITIZEN'S DAUGHTER\n\nCome, Agatha! I shun the witch's sight\nBefore folks, lest there be misgiving:\n'Tis true, she showed me, on Saint Andrew's Night,\nMy future sweetheart, just as he were living.\n\n\nTHE OTHER\n\nShe showed me mine, in crystal clear,\nWith several wild young blades, a soldier-lover:\nI seek him everywhere, I pry and peer,\nAnd yet, somehow, his face I can't discover.\n\nSOLDIERS\n\n        Castles, with lofty\n        Ramparts and towers,\n        Maidens disdainful\n        In Beauty's array,\n        Both shall be ours!\n        Bold is the venture,\n        Splendid the pay!\n        Lads, let the trumpets\n        For us be suing,--\n        Calling to pleasure,\n        Calling to ruin.\n        Stormy our life is;\n        Such is its boon!\n        Maidens and castles\n        Capitulate soon.\n        Bold is the venture,\n        Splendid the pay!\n        And the soldiers go marching,\n        Marching away!\n\n\nFAUST AND WAGNER\n\n\nFAUST\n\nReleased from ice are brook and river\nBy the quickening glance of the gracious Spring;\nThe colors of hope to the valley cling,\nAnd weak old Winter himself must shiver,\nWithdrawn to the mountains, a crownless king:\nWhence, ever retreating, he sends again\nImpotent showers of sleet that darkle\nIn belts across the green o' the plain.\nBut the sun will permit no white to sparkle;\nEverywhere form in development moveth;\nHe will brighten the world with the tints he loveth,\nAnd, lacking blossoms, blue, yellow, and red,\nHe takes these gaudy people instead.\nTurn thee about, and from this height\nBack on the town direct thy sight.\nOut of the hollow, gloomy gate,\nThe motley throngs come forth elate:\nEach will the joy of the sunshine hoard,\nTo honor the Day of the Risen Lord!\nThey feel, themselves, their resurrection:\nFrom the low, dark rooms, scarce habitable;\nFrom the bonds of Work, from Trade's restriction;\nFrom the pressing weight of roof and gable;\nFrom the narrow, crushing streets and alleys;\nFrom the churches' solemn and reverend night,\nAll come forth to the cheerful light.\nHow lively, see! the multitude sallies,\nScattering through gardens and fields remote,\nWhile over the river, that broadly dallies,\nDances so many a festive boat;\nAnd overladen, nigh to sinking,\nThe last full wherry takes the stream.\nYonder afar, from the hill-paths blinking,\nTheir clothes are colors that softly gleam.\nI hear the noise of the village, even;\nHere is the People's proper Heaven;\nHere high and low contented see!\nHere I am Man,--dare man to be!\n\n\nWAGNER\n\nTo stroll with you, Sir Doctor, flatters;\n'Tis honor, profit, unto me.\nBut I, alone, would shun these shallow matters,\nSince all that's coarse provokes my enmity.\nThis fiddling, shouting, ten-pin rolling\nI hate,--these noises of the throng:\nThey rave, as Satan were their sports controlling.\nAnd call it mirth, and call it song!\n\n\nPEASANTS, UNDER THE LINDEN-TREE\n  (_Dance and Song_.)\n\n          All for the dance the shepherd dressed,\n          In ribbons, wreath, and gayest vest\n            Himself with care arraying:\n          Around the linden lass and lad\n          Already footed it like mad:\n            Hurrah! hurrah!\n            Hurrah--tarara-la!\n          The fiddle-bow was playing.\n\n          He broke the ranks, no whit afraid,\n          And with his elbow punched a maid,\n            Who stood, the dance surveying:\n          The buxom wench, she turned and said:\n          \"Now, you I call a stupid-head!\"\n            Hurrah! hurrah!\n            Hurrah--tarara-la!\n          \"Be decent while you're staying!\"\n\n          Then round the circle went their flight,\n          They danced to left, they danced to right:\n          Their kirtles all were playing.\n          They first grew red, and then grew warm,\n          And rested, panting, arm in arm,--\n            Hurrah! hurrah!\n            Hurrah--tarara-la!\n          And hips and elbows straying.\n\n          Now, don't be so familiar here!\n          How many a one has fooled his dear,\n          Waylaying and betraying!\n\n          And yet, he coaxed her soon aside,\n          And round the linden sounded wide.\n            Hurrah! hurrah!\n            Hurrah--tarara-la!\n          And the fiddle-bow was playing.\n\nOLD PEASANT\n\nSir Doctor, it is good of you,\nThat thus you condescend, to-day,\nAmong this crowd of merry folk,\nA highly-learned man, to stray.\nThen also take the finest can,\nWe fill with fresh wine, for your sake:\nI offer it, and humbly wish\nThat not alone your thirst is slake,--\nThat, as the drops below its brink,\nSo many days of life you drink!\n\n\nFAUST\n\nI take the cup you kindly reach,\nWith thanks and health to all and each.\n\n(_The People gather in a circle about him_.)\n\n\nOLD PEASANT\n\nIn truth, 'tis well and fitly timed,\nThat now our day of joy you share,\nWho heretofore, in evil days,\nGave us so much of helping care.\nStill many a man stands living here,\nSaved by your father's skillful hand,\nThat snatched him from the fever's rage\nAnd stayed the plague in all the land.\nThen also you, though but a youth,\nWent into every house of pain:\nMany the corpses carried forth,\nBut you in health came out again.\n\nFAUST\n\nNo test or trial you evaded:\nA Helping God the helper aided.\n\nALL\n\nHealth to the man, so skilled and tried.\nThat for our help he long may abide!\n\nFAUST\n\nTo Him above bow down, my friends,\nWho teaches help, and succor sends!\n\n(_He goes on with_ WAGNER.)\n\nWAGNER\n\nWith what a feeling, thou great man, must thou\nReceive the people's honest veneration!\nHow lucky he, whose gifts his station\nWith such advantages endow!\nThou'rt shown to all the younger generation:\nEach asks, and presses near to gaze;\nThe fiddle stops, the dance delays.\nThou goest, they stand in rows to see,\nAnd all the caps are lifted high;\nA little more, and they would bend the knee\nAs if the Holy Host came by.\n\nFAUST\n\nA few more steps ascend, as far as yonder stone!--\nHere from our wandering will we rest contented.\nHere, lost in thought, I've lingered oft alone,\nWhen foolish fasts and prayers my life tormented.\nHere, rich in hope and firm in faith,\nWith tears, wrung hands and sighs, I've striven,\nThe end of that far-spreading death\nEntreating from the Lord of Heaven!\nNow like contempt the crowd's applauses seem:\nCouldst thou but read, within mine inmost spirit,\nHow little now I deem,\nThat sire or son such praises merit!\nMy father's was a sombre, brooding brain,\nWhich through the holy spheres of Nature groped and wandered,\nAnd honestly, in his own fashion, pondered\nWith labor whimsical, and pain:\nWho, in his dusky work-shop bending,\nWith proved adepts in company,\nMade, from his recipes unending,\nOpposing substances agree.\nThere was a Lion red, a wooer daring,\nWithin the Lily's tepid bath espoused,\nAnd both, tormented then by flame unsparing,\nBy turns in either bridal chamber housed.\nIf then appeared, with colors splendid,\nThe young Queen in her crystal shell,\nThis was the medicine--the patients' woes soon ended,\nAnd none demanded: who got well?\nThus we, our hellish boluses compounding,\nAmong these vales and hills surrounding,\nWorse than the pestilence, have passed.\nThousands were done to death from poison of my giving;\nAnd I must hear, by all the living,\nThe shameless murderers praised at last!\n\nWAGNER\n\nWhy, therefore, yield to such depression?\nA good man does his honest share\nIn exercising, with the strictest care,\nThe art bequeathed to his possession!\nDost thou thy father honor, as a youth?\nThen may his teaching cheerfully impel thee:\nDost thou, as man, increase the stores of truth?\nThen may thine own son afterwards excel thee.\n\nFAUST\n\nO happy he, who still renews\nThe hope, from Error's deeps to rise forever!\nThat which one does not know, one needs to use;\nAnd what one knows, one uses never.\nBut let us not, by such despondence, so\nThe fortune of this hour embitter!\nMark how, beneath the evening sunlight's glow,\nThe green-embosomed houses glitter!\nThe glow retreats, done is the day of toil;\nIt yonder hastes, new fields of life exploring;\nAh, that no wing can lift me from the soil,\nUpon its track to follow, follow soaring!\nThen would I see eternal Evening gild\nThe silent world beneath me glowing,\nOn fire each mountain-peak, with peace each valley filled,\nThe silver brook to golden rivers flowing.\nThe mountain-chain, with all its gorges deep,\nWould then no more impede my godlike motion;\nAnd now before mine eyes expands the ocean\nWith all its bays, in shining sleep!\nYet, finally, the weary god is sinking;\nThe new-born impulse fires my mind,--\nI hasten on, his beams eternal drinking,\nThe Day before me and the Night behind,\nAbove me heaven unfurled, the floor of waves beneath me,--\nA glorious dream! though now the glories fade.\nAlas! the wings that lift the mind no aid\nOf wings to lift the body can bequeath me.\nYet in each soul is born the pleasure\nOf yearning onward, upward and away,\nWhen o'er our heads, lost in the vaulted azure,\nThe lark sends down his flickering lay,--\nWhen over crags and piny highlands\nThe poising eagle slowly soars,\nAnd over plains and lakes and islands\nThe crane sails by to other shores.\n\nWAGNER\n\nI've had, myself, at times, some odd caprices,\nBut never yet such impulse felt, as this is.\nOne soon fatigues, on woods and fields to look,\nNor would I beg the bird his wing to spare us:\nHow otherwise the mental raptures bear us\nFrom page to page, from book to book!\nThen winter nights take loveliness untold,\nAs warmer life in every limb had crowned you;\nAnd when your hands unroll some parchment rare and old,\nAll Heaven descends, and opens bright around you!\n\nFAUST\n\nOne impulse art thou conscious of, at best;\nO, never seek to know the other!\nTwo souls, alas! reside within my breast,\nAnd each withdraws from, and repels, its brother.\nOne with tenacious organs holds in love\nAnd clinging lust the world in its embraces;\nThe other strongly sweeps, this dust above,\nInto the high ancestral spaces.\nIf there be airy spirits near,\n'Twixt Heaven and Earth on potent errands fleeing,\nLet them drop down the golden atmosphere,\nAnd bear me forth to new and varied being!\nYea, if a magic mantle once were mine,\nTo waft me o'er the world at pleasure,\nI would not for the costliest stores of treasure--\nNot for a monarch's robe--the gift resign.\n\nWAGNER\n\nInvoke not thus the well-known throng,\nWhich through the firmament diffused is faring,\nAnd danger thousand-fold, our race to wrong.\nIn every quarter is preparing.\nSwift from the North the spirit-fangs so sharp\nSweep down, and with their barbed points assail you;\nThen from the East they come, to dry and warp\nYour lungs, till breath and being fail you:\nIf from the Desert sendeth them the South,\nWith fire on fire your throbbing forehead crowning,\nThe West leads on a host, to cure the drouth\nOnly when meadow, field, and you are drowning.\nThey gladly hearken, prompt for injury,--\nGladly obey, because they gladly cheat us;\nFrom Heaven they represent themselves to be,\nAnd lisp like angels, when with lies they meet us.\nBut, let us go! 'Tis gray and dusky all:\nThe air is cold, the vapors fall.\nAt night, one learns his house to prize:--\nWhy stand you thus, with such astonished eyes?\nWhat, in the twilight, can your mind so trouble?\n\nFAUST\n\nSeest thou the black dog coursing there, through corn and\nstubble?\n\nWAGNER\n\nLong since: yet deemed him not important in the least.\n\nFAUST\n\nInspect him close: for what tak'st thou the beast?\n\nWAGNER\n\nWhy, for a poodle who has lost his master,\nAnd scents about, his track to find.\n\nFAUST\n\nSeest thou the spiral circles, narrowing faster,\nWhich he, approaching, round us seems to wind?\nA streaming trail of fire, if I see rightly,\nFollows his path of mystery.\n\nWAGNER\n\nIt may be that your eyes deceive you slightly;\nNaught but a plain black poodle do I see.\n\nFAUST\n\nIt seems to me that with enchanted cunning\nHe snares our feet, some future chain to bind.\n\nWAGNER\n\nI see him timidly, in doubt, around us running,\nSince, in his master's stead, two strangers doth he find.\n\nFAUST\n\nThe circle narrows: he is near!\n\nWAGNER\n\nA dog thou seest, and not a phantom, here!\nBehold him stop--upon his belly crawl--His\ntail set wagging: canine habits, all!\n\nFAUST\n\nCome, follow us! Come here, at least!\n\nWAGNER\n\n'Tis the absurdest, drollest beast.\nStand still, and you will see him wait;\nAddress him, and he gambols straight;\nIf something's lost, he'll quickly bring it,--\nYour cane, if in the stream you fling it.\n\nFAUST\n\nNo doubt you're right: no trace of mind, I own,\nIs in the beast: I see but drill, alone.\n\nWAGNER\n\nThe dog, when he's well educated,\nIs by the wisest tolerated.\nYes, he deserves your favor thoroughly,--\nThe clever scholar of the students, he!\n\n(_They pass in the city-gate_.)\n\n[Illustration]\n\n[Illustration]\n\n\n\n\nIII\n\n\nTHE STUDY\n\nFAUST\n\n(_Entering, with the poodle_.)\n\n     Behind me, field and meadow sleeping,\n     I leave in deep, prophetic night,\n     Within whose dread and holy keeping\n     The better soul awakes to light.\n     The wild desires no longer win us,\n     The deeds of passion cease to chain;\n     The love of Man revives within us,\n     The love of God revives again.\n\nBe still, thou poodle; make not such racket and riot!\nWhy at the threshold wilt snuffing be?\nBehind the stove repose thee in quiet!\nMy softest cushion I give to thee.\nAs thou, up yonder, with running and leaping\nAmused us hast, on the mountain's crest,\n\nSo now I take thee into my keeping,\nA welcome, but also a silent, guest.\n\n     Ah, when, within our narrow chamber\n     The lamp with friendly lustre glows,\n     Flames in the breast each faded ember,\n     And in the heart, itself that knows.\n     Then Hope again lends sweet assistance,\n     And Reason then resumes her speech:\n     One yearns, the rivers of existence,\n     The very founts of Life, to reach.\n\nSnarl not, poodle! To the sound that rises,\nThe sacred tones that my soul embrace,\nThis bestial noise is out of place.\nWe are used to see, that Man despises\nWhat he never comprehends,\nAnd the Good and the Beautiful vilipends,\nFinding them often hard to measure:\nWill the dog, like man, snarl _his_ displeasure?\n\nBut ah! I feel, though will thereto be stronger,\nContentment flows from out my breast no longer.\nWhy must the stream so soon run dry and fail us,\nAnd burning thirst again assail us?\nTherein I've borne so much probation!\nAnd yet, this want may be supplied us;\nWe call the Supernatural to guide us;\nWe pine and thirst for Revelation,\nWhich nowhere worthier is, more nobly sent,\nThan here, in our New Testament.\nI feel impelled, its meaning to determine,--\nWith honest purpose, once for all,\nThe hallowed Original\nTo change to my beloved German.\n\n(_He opens a volume, and commences_.)\n'Tis written: \"In the Beginning was the _Word_.\"\nHere am I balked: who, now can help afford?\nThe _Word?_--impossible so high to rate it;\nAnd otherwise must I translate it.\nIf by the Spirit I am truly taught.\nThen thus: \"In the Beginning was the _Thought_\"\nThis first line let me weigh completely,\nLest my impatient pen proceed too fleetly.\nIs it the _Thought_ which works, creates, indeed?\n\"In the Beginning was the _Power,\"_ I read.\nYet, as I write, a warning is suggested,\nThat I the sense may not have fairly tested.\nThe Spirit aids me: now I see the light!\n\"In the Beginning was the _Act_,\" I write.\n\nIf I must share my chamber with thee,\nPoodle, stop that howling, prithee!\nCease to bark and bellow!\nSuch a noisy, disturbing fellow\nI'll no longer suffer near me.\nOne of us, dost hear me!\nMust leave, I fear me.\nNo longer guest-right I bestow;\nThe door is open, art free to go.\nBut what do I see in the creature?\nIs that in the course of nature?\nIs't actual fact? or Fancy's shows?\nHow long and broad my poodle grows!\nHe rises mightily:\nA canine form that cannot be!\nWhat a spectre I've harbored thus!\nHe resembles a hippopotamus,\nWith fiery eyes, teeth terrible to see:\nO, now am I sure of thee!\nFor all of thy half-hellish brood\nThe Key of Solomon is good.\n\nSPIRITS (_in the corridor_)\n\n     Some one, within, is caught!\n     Stay without, follow him not!\n     Like the fox in a snare,\n     Quakes the old hell-lynx there.\n     Take heed--look about!\n     Back and forth hover,\n     Under and over,\n     And he'll work himself out.\n     If your aid avail him,\n     Let it not fail him;\n     For he, without measure,\n     Has wrought for our pleasure.\n\nFAUST\n\nFirst, to encounter the beast,\nThe Words of the Four be addressed:\n    Salamander, shine glorious!\n    Wave, Undine, as bidden!\n    Sylph, be thou hidden!\n    Gnome, be laborious!\n\nWho knows not their sense\n(These elements),--\nTheir properties\nAnd power not sees,--\nNo mastery he inherits\nOver the Spirits.\n\n     Vanish in flaming ether,\n     Salamander!\n     Flow foamingly together,\n     Undine!\n     Shine in meteor-sheen,\n     Sylph!\n     Bring help to hearth and shelf.\n     Incubus! Incubus!\n     Step forward, and finish thus!\n\nOf the Four, no feature\nLurks in the creature.\nQuiet he lies, and grins disdain:\nNot yet, it seems, have I given him pain.\nNow, to undisguise thee,\nHear me exorcise thee!\nArt thou, my gay one,\nHell's fugitive stray-one?\nThe sign witness now,\nBefore which they bow,\nThe cohorts of Hell!\n\nWith hair all bristling, it begins to swell.\n\n     Base Being, hearest thou?\n     Knowest and fearest thou\n     The One, unoriginate,\n     Named inexpressibly,\n     Through all Heaven impermeate,\n     Pierced irredressibly!\n\nBehind the stove still banned,\nSee it, an elephant, expand!\nIt fills the space entire,\nMist-like melting, ever faster.\n'Tis enough: ascend no higher,--\nLay thyself at the feet of the Master!\nThou seest, not vain the threats I bring thee:\nWith holy fire I'll scorch and sting thee!\nWait not to know\nThe threefold dazzling glow!\nWait not to know\nThe strongest art within my hands!\n\nMEPHISTOPHELES\n\n(_while the vapor is dissipating, steps forth from behind the\nstove, in the costume of a Travelling Scholar_.)\nWhy such a noise? What are my lord's commands?\n\nFAUST\n\nThis was the poodle's real core,\nA travelling scholar, then? The _casus_ is diverting.\n\nMEPHISTOPHELES\n\nThe learned gentleman I bow before:\nYou've made me roundly sweat, that's certain!\n\nFAUST\n\nWhat is thy name?\n\nMEPHISTOPHELES\n\nA question small, it seems,\nFor one whose mind the Word so much despises;\nWho, scorning all external gleams,\nThe depths of being only prizes.\n\nFAUST\n\nWith all you gentlemen, the name's a test,\nWhereby the nature usually is expressed.\nClearly the latter it implies\nIn names like Beelzebub, Destroyer, Father of Lies.\nWho art thou, then?\n\nMEPHISTOPHELES\n\nPart of that Power, not understood,\nWhich always wills the Bad, and always works the Good.\n\nFAUST\n\nWhat hidden sense in this enigma lies?\n\nMEPHISTOPHELES\n\nI am the Spirit that Denies!\nAnd justly so: for all things, from the Void\nCalled forth, deserve to be destroyed:\n'Twere better, then, were naught created.\nThus, all which you as Sin have rated,--\nDestruction,--aught with Evil blent,--\nThat is my proper element.\n\nFAUST\n\nThou nam'st thyself a part, yet show'st complete to me?\n\nMEPHISTOPHELES\n\nThe modest truth I speak to thee.\nIf Man, that microcosmic fool, can see\nHimself a whole so frequently,\nPart of the Part am I, once All, in primal Night,--\nPart of the Darkness which brought forth the Light,\nThe haughty Light, which now disputes the space,\nAnd claims of Mother Night her ancient place.\nAnd yet, the struggle fails; since Light, howe'er it weaves,\nStill, fettered, unto bodies cleaves:\nIt flows from bodies, bodies beautifies;\nBy bodies is its course impeded;\nAnd so, but little time is needed,\nI hope, ere, as the bodies die, it dies!\n\nFAUST\n\nI see the plan thou art pursuing:\nThou canst not compass general ruin,\nAnd hast on smaller scale begun.\n\nMEPHISTOPHELES\n\nAnd truly 'tis not much, when all is done.\nThat which to Naught is in resistance set,--\nThe Something of this clumsy world,--has yet,\nWith all that I have undertaken,\nNot been by me disturbed or shaken:\nFrom earthquake, tempest, wave, volcano's brand,\nBack into quiet settle sea and land!\nAnd that damned stuff, the bestial, human brood,--\nWhat use, in having that to play with?\nHow many have I made away with!\nAnd ever circulates a newer, fresher blood.\nIt makes me furious, such things beholding:\nFrom Water, Earth, and Air unfolding,\nA thousand germs break forth and grow,\nIn dry, and wet, and warm, and chilly;\nAnd had I not the Flame reserved, why, really,\nThere's nothing special of my own to show!\n\nFAUST\n\nSo, to the actively eternal\nCreative force, in cold disdain\nYou now oppose the fist infernal,\nWhose wicked clench is all in vain!\nSome other labor seek thou rather,\nQueer Son of Chaos, to begin!\n\nMEPHISTOPHELES\n\nWell, we'll consider: thou canst gather\nMy views, when next I venture in.\nMight I, perhaps, depart at present?\n\nFAUST\n\nWhy thou shouldst ask, I don't perceive.\nThough our acquaintance is so recent,\nFor further visits thou hast leave.\nThe window's here, the door is yonder;\nA chimney, also, you behold.\n\nMEPHISTOPHELES\n\nI must confess that forth I may not wander,\nMy steps by one slight obstacle controlled,--\nThe wizard's-foot, that on your threshold made is.\n\nFAUST\n\nThe pentagram prohibits thee?\nWhy, tell me now, thou Son of Hades,\nIf that prevents, how cam'st thou in to me?\nCould such a spirit be so cheated?\n\nMEPHISTOPHELES\n\nInspect the thing: the drawing's not completed.\nThe outer angle, you may see,\nIs open left--the lines don't fit it.\n\nFAUST\n\nWell,--Chance, this time, has fairly hit it!\nAnd thus, thou'rt prisoner to me?\nIt seems the business has succeeded.\n\nMEPHISTOPHELES\n\nThe poodle naught remarked, as after thee he speeded;\nBut other aspects now obtain:\nThe Devil can't get out again.\n\nFAUST\n\nTry, then, the open window-pane!\n\nMEPHISTOPHELES\n\nFor Devils and for spectres this is law:\nWhere they have entered in, there also they withdraw.\nThe first is free to us; we're governed by the second.\n\nFAUST\n\nIn Hell itself, then, laws are reckoned?\nThat's well! So might a compact be\nMade with you gentlemen--and binding,--surely?\n\nMEPHISTOPHELES\n\nAll that is promised shall delight thee purely;\nNo skinflint bargain shalt thou see.\nBut this is not of swift conclusion;\nWe'll talk about the matter soon.\nAnd now, I do entreat this boon--\nLeave to withdraw from my intrusion.\n\nFAUST\n\nOne moment more I ask thee to remain,\nSome pleasant news, at least, to tell me.\n\nMEPHISTOPHELES\n\nRelease me, now! I soon shall come again;\nThen thou, at will, mayst question and compel me.\n\nFAUST\n\nI have not snares around thee cast;\nThyself hast led thyself into the meshes.\nWho traps the Devil, hold him fast!\nNot soon a second time he'll catch a prey so precious.\n\nMEPHISTOPHELES\n\nAn't please thee, also I'm content to stay,\nAnd serve thee in a social station;\nBut stipulating, that I may\nWith arts of mine afford thee recreation.\n\nFAUST\n\nThereto I willingly agree,\nIf the diversion pleasant be.\n\nMEPHISTOPHELES\n\nMy friend, thou'lt win, past all pretences,\nMore in this hour to soothe thy senses,\nThan in the year's monotony.\nThat which the dainty spirits sing thee,\nThe lovely pictures they shall bring thee,\nAre more than magic's empty show.\nThy scent will be to bliss invited;\nThy palate then with taste delighted,\nThy nerves of touch ecstatic glow!\nAll unprepared, the charm I spin:\nWe're here together, so begin!\n\nSPIRITS\n\n     Vanish, ye darking\n     Arches above him!\n     Loveliest weather,\n     Born of blue ether,\n     Break from the sky!\n     O that the darkling\n     Clouds had departed!\n     Starlight is sparkling,\n     Tranquiller-hearted\n     Suns are on high.\n     Heaven's own children\n     In beauty bewildering,\n     Waveringly bending,\n     Pass as they hover;\n     Longing unending\n     Follows them over.\n     They, with their glowing\n     Garments, out-flowing,\n     Cover, in going,\n     Landscape and bower,\n     Where, in seclusion,\n     Lovers are plighted,\n     Lost in illusion.\n     Bower on bower!\n     Tendrils unblighted!\n     Lo! in a shower\n     Grapes that o'ercluster\n     Gush into must, or\n     Flow into rivers\n     Of foaming and flashing\n     Wine, that is dashing\n     Gems, as it boundeth\n     Down the high places,\n     And spreading, surroundeth\n     With crystalline spaces,\n     In happy embraces,\n     Blossoming forelands,\n     Emerald shore-lands!\n     And the winged races\n     Drink, and fly onward--\n     Fly ever sunward\n     To the enticing\n     Islands, that flatter,\n     Dipping and rising\n     Light on the water!\n     Hark, the inspiring\n     Sound of their quiring!\n     See, the entrancing\n     Whirl of their dancing!\n     All in the air are\n     Freer and fairer.\n     Some of them scaling\n     Boldly the highlands,\n     Others are sailing,\n     Circling the islands;\n     Others are flying;\n     Life-ward all hieing,--\n     All for the distant\n     Star of existent\n     Rapture and Love!\n\nMEPHISTOPHELES\n\nHe sleeps! Enough, ye fays! your airy number\nHave sung him truly into slumber:\nFor this performance I your debtor prove.--\nNot yet art thou the man, to catch the Fiend and hold him!--\nWith fairest images of dreams infold him,\nPlunge him in seas of sweet untruth!\nYet, for the threshold's magic which controlled him,\nThe Devil needs a rat's quick tooth.\nI use no lengthened invocation:\nHere rustles one that soon will work my liberation.\n\nThe lord of rats and eke of mice,\nOf flies and bed-bugs, frogs and lice,\nSummons thee hither to the door-sill,\nTo gnaw it where, with just a morsel\nOf oil, he paints the spot for thee:--\nThere com'st thou, hopping on to me!\nTo work, at once! The point which made me craven\nIs forward, on the ledge, engraven.\nAnother bite makes free the door:\nSo, dream thy dreams, O Faust, until we meet once more!\n\nFAUST _(awaking)_\n\nAm I again so foully cheated?\nRemains there naught of lofty spirit-sway,\nBut that a dream the Devil counterfeited,\nAnd that a poodle ran away?\n\n[Illustration]\n\n\n\n\nIV\n\n\nTHE STUDY\n\nFAUST MEPHISTOPHELES\n\nFAUST\n\nA knock? Come in! Again my quiet broken?\n\nMEPHISTOPHELES\n\n'Tis I!\n\nFAUST\n\n         Come in!\n\nMEPHISTOPHELES\n\n                  Thrice must the words be spoken.\n\nFAUST\n\nCome in, then!\n\n\nMEPHISTOPHELES\n\n                   Thus thou pleasest me.\nI hope we'll suit each other well;\nFor now, thy vapors to dispel,\nI come, a squire of high degree,\nIn scarlet coat, with golden trimming,\nA cloak in silken lustre swimming,\nA tall cock's-feather in my hat,\nA long, sharp sword for show or quarrel,--\nAnd I advise thee, brief and flat,\nTo don the self-same gay apparel,\nThat, from this den released, and free,\nLife be at last revealed to thee!\n\nFAUST\n\nThis life of earth, whatever my attire,\nWould pain me in its wonted fashion.\nToo old am I to play with passion;\nToo young, to be without desire.\nWhat from the world have I to gain?\nThou shalt abstain--renounce--refrain!\nSuch is the everlasting song\nThat in the ears of all men rings,--\nThat unrelieved, our whole life long,\nEach hour, in passing, hoarsely sings.\nIn very terror I at morn awake,\nUpon the verge of bitter weeping,\nTo see the day of disappointment break,\nTo no one hope of mine--not one--its promise keeping:--\nThat even each joy's presentiment\nWith wilful cavil would diminish,\nWith grinning masks of life prevent\nMy mind its fairest work to finish!\nThen, too, when night descends, how anxiously\nUpon my couch of sleep I lay me:\nThere, also, comes no rest to me,\nBut some wild dream is sent to fray me.\nThe God that in my breast is owned\nCan deeply stir the inner sources;\nThe God, above my powers enthroned,\nHe cannot change external forces.\nSo, by the burden of my days oppressed,\nDeath is desired, and Life a thing unblest!\n\nMEPHISTOPHELES\n\nAnd yet is never Death a wholly welcome guest.\n\nFAUST\n\nO fortunate, for whom, when victory glances,\nThe bloody laurels on the brow he bindeth!\nWhom, after rapid, maddening dances,\nIn clasping maiden-arms he findeth!\nO would that I, before that spirit-power,\nRavished and rapt from life, had sunken!\n\nMEPHISTOPHELES\n\nAnd yet, by some one, in that nightly hour,\nA certain liquid was not drunken.\n\nFAUST\n\nEavesdropping, ha! thy pleasure seems to be.\n\nMEPHISTOPHELES\n\nOmniscient am I not; yet much is known to me.\n\nFAUST\n\nThough some familiar tone, retrieving\nMy thoughts from torment, led me on,\nAnd sweet, clear echoes came, deceiving\nA faith bequeathed from Childhood's dawn,\nYet now I curse whate'er entices\nAnd snares the soul with visions vain;\nWith dazzling cheats and dear devices\nConfines it in this cave of pain!\nCursed be, at once, the high ambition\nWherewith the mind itself deludes!\nCursed be the glare of apparition\nThat on the finer sense intrudes!\nCursed be the lying dream's impression\nOf name, and fame, and laurelled brow!\nCursed, all that flatters as possession,\nAs wife and child, as knave and plow!\nCursed Mammon be, when he with treasures\nTo restless action spurs our fate!\nCursed when, for soft, indulgent leisures,\nHe lays for us the pillows straight!\nCursed be the vine's transcendent nectar,--\nThe highest favor Love lets fall!\nCursed, also, Hope!--cursed Faith, the spectre!\nAnd cursed be Patience most of all!\n\nCHORUS OF SPIRITS (_invisible_)\n\n     Woe! woe!\n     Thou hast it destroyed,\n     The beautiful world,\n     With powerful fist:\n     In ruin 'tis hurled,\n     By the blow of a demigod shattered!\n     The scattered\n     Fragments into the Void we carry,\n     Deploring\n     The beauty perished beyond restoring.\n     Mightier\n     For the children of men,\n     Brightlier\n     Build it again,\n     In thine own bosom build it anew!\n     Bid the new career\n     Commence,\n     With clearer sense,\n     And the new songs of cheer\n     Be sung thereto!\n\nMEPHISTOPHELES\n\nThese are the small dependants\nWho give me attendance.\nHear them, to deeds and passion\nCounsel in shrewd old-fashion!\nInto the world of strife,\nOut of this lonely life\nThat of senses and sap has betrayed thee,\nThey would persuade thee.\nThis nursing of the pain forego thee,\nThat, like a vulture, feeds upon thy breast!\nThe worst society thou find'st will show thee\nThou art a man among the rest.\nBut 'tis not meant to thrust\nThee into the mob thou hatest!\nI am not one of the greatest,\nYet, wilt thou to me entrust\nThy steps through life, I'll guide thee,--\nWill willingly walk beside thee,--\nWill serve thee at once and forever\nWith best endeavor,\nAnd, if thou art satisfied,\nWill as servant, slave, with thee abide.\n\nFAUST\n\nAnd what shall be my counter-service therefor?\n\nMEPHISTOPHELES\n\nThe time is long: thou need'st not now insist.\n\nFAUST\n\nNo--no! The Devil is an egotist,\nAnd is not apt, without a why or wherefore,\n\"For God's sake,\" others to assist.\nSpeak thy conditions plain and clear!\nWith such a servant danger comes, I fear.\n\nMEPHISTOPHELES\n\n_Here_, an unwearied slave, I'll wear thy tether,\nAnd to thine every nod obedient be:\nWhen _There_ again we come together,\nThen shalt thou do the same for me.\n\nFAUST\n\nThe _There_ my scruples naught increases.\nWhen thou hast dashed this world to pieces,\nThe other, then, its place may fill.\nHere, on this earth, my pleasures have their sources;\nYon sun beholds my sorrows in his courses;\nAnd when from these my life itself divorces,\nLet happen all that can or will!\nI'll hear no more: 'tis vain to ponder\nIf there we cherish love or hate,\nOr, in the spheres we dream of yonder,\nA High and Low our souls await.\n\nMEPHISTOPHELES\n\nIn this sense, even, canst thou venture.\nCome, bind thyself by prompt indenture,\nAnd thou mine arts with joy shalt see:\nWhat no man ever saw, I'll give to thee.\n\nFAUST\n\nCanst thou, poor Devil, give me whatsoever?\nWhen was a human soul, in its supreme endeavor,\nE'er understood by such as thou?\nYet, hast thou food which never satiates, now,--\nThe restless, ruddy gold hast thou,\nThat runs, quicksilver-like, one's fingers through,--\nA game whose winnings no man ever knew,--\nA maid that, even from my breast,\nBeckons my neighbor with her wanton glances,\nAnd Honor's godlike zest,\nThe meteor that a moment dances,--\nShow me the fruits that, ere they're gathered, rot,\nAnd trees that daily with new leafage clothe them!\n\nMEPHISTOPHELES\n\nSuch a demand alarms me not:\nSuch treasures have I, and can show them.\nBut still the time may reach us, good my friend.\nWhen peace we crave and more luxurious diet.\n\nFAUST\n\nWhen on an idler's bed I stretch myself in quiet.\nThere let, at once, my record end!\nCanst thou with lying flattery rule me,\nUntil, self-pleased, myself I see,--\nCanst thou with rich enjoyment fool me,\nLet that day be the last for me!\nThe bet I offer.\n\nMEPHISTOPHELES\n                   Done!\n\nFAUST\n                         And heartily!\nWhen thus I hail the Moment flying:\n\"Ah, still delay--thou art so fair!\"\nThen bind me in thy bonds undying,\nMy final ruin then declare!\nThen let the death-bell chime the token.\nThen art thou from thy service free!\nThe clock may stop, the hand be broken,\nThen Time be finished unto me!\n\nMEPHISTOPHELES\n\nConsider well: my memory good is rated.\n\nFAUST\n\nThou hast a perfect right thereto.\nMy powers I have not rashly estimated:\nA slave am I, whate'er I do--\nIf thine, or whose? 'tis needless to debate it.\n\nMEPHISTOPHELES\n\nThen at the Doctors'-banquet I, to-day,\nWill as a servant wait behind thee.\nBut one thing more! Beyond all risk to bind thee,\nGive me a line or two, I pray.\n\nFAUST\n\nDemand'st thou, Pedant, too, a document?\nHast never known a man, nor proved his word's intent?\nIs't not enough, that what I speak to-day\nShall stand, with all my future days agreeing?\nIn all its tides sweeps not the world away,\nAnd shall a promise bind my being?\nYet this delusion in our hearts we bear:\nWho would himself therefrom deliver?\nBlest he, whose bosom Truth makes pure and fair!\nNo sacrifice shall he repent of ever.\nNathless a parchment, writ and stamped with care,\nA spectre is, which all to shun endeavor.\nThe word, alas! dies even in the pen,\nAnd wax and leather keep the lordship then.\nWhat wilt from me, Base Spirit, say?--\nBrass, marble, parchment, paper, clay?\nThe terms with graver, quill, or chisel, stated?\nI freely leave the choice to thee.\n\nMEPHISTOPHELES\n\nWhy heat thyself, thus instantly,\nWith eloquence exaggerated?\nEach leaf for such a pact is good;\nAnd to subscribe thy name thou'lt take a drop of blood.\n\nFAUST\n\nIf thou therewith art fully satisfied,\nSo let us by the farce abide.\n\nMEPHISTOPHELES\n\nBlood is a juice of rarest quality.\n\nFAUST\n\nFear not that I this pact shall seek to sever?\nThe promise that I make to thee\nIs just the sum of my endeavor.\nI have myself inflated all too high;\nMy proper place is thy estate:\nThe Mighty Spirit deigns me no reply,\nAnd Nature shuts on me her gate.\nThe thread of Thought at last is broken,\nAnd knowledge brings disgust unspoken.\nLet us the sensual deeps explore,\nTo quench the fervors of glowing passion!\nLet every marvel take form and fashion\nThrough the impervious veil it wore!\nPlunge we in Time's tumultuous dance,\nIn the rush and roll of Circumstance!\nThen may delight and distress,\nAnd worry and success,\nAlternately follow, as best they can:\nRestless activity proves the man!\n\nMEPHISTOPHELES\n\nFor you no bound, no term is set.\nWhether you everywhere be trying,\nOr snatch a rapid bliss in flying,\nMay it agree with you, what you get!\nOnly fall to, and show no timid balking.\n\nFAUST\n\nBut thou hast heard, 'tis not of joy we're talking.\nI take the wildering whirl, enjoyment's keenest pain,\nEnamored hate, exhilarant disdain.\nMy bosom, of its thirst for knowledge sated,\nShall not, henceforth, from any pang be wrested,\nAnd all of life for all mankind created\nShall be within mine inmost being tested:\nThe highest, lowest forms my soul shall borrow,\nShall heap upon itself their bliss and sorrow,\nAnd thus, my own sole self to all their selves expanded,\nI too, at last, shall with them all be stranded!\n\nMEPHISTOPHELES\n\nBelieve me, who for many a thousand year\nThe same tough meat have chewed and tested,\nThat from the cradle to the bier\nNo man the ancient leaven has digested!\nTrust one of us, this Whole supernal\nIs made but for a God's delight!\n_He_ dwells in splendor single and eternal,\nBut _us_ he thrusts in darkness, out of sight,\nAnd _you_ he dowers with Day and Night.\n\nFAUST\n\nNay, but I will!\n\nMEPHISTOPHELES\n\nA good reply!\nOne only fear still needs repeating:\nThe art is long, the time is fleeting.\nThen let thyself be taught, say I!\nGo, league thyself with a poet,\nGive the rein to his imagination,\nThen wear the crown, and show it,\nOf the qualities of his creation,--\nThe courage of the lion's breed,\nThe wild stag's speed,\nThe Italian's fiery blood,\nThe North's firm fortitude!\nLet him find for thee the secret tether\nThat binds the Noble and Mean together.\nAnd teach thy pulses of youth and pleasure\nTo love by rule, and hate by measure!\nI'd like, myself, such a one to see:\nSir Microcosm his name should be.\n\nFAUST\n\nWhat am I, then, if 'tis denied my part\nThe crown of all humanity to win me,\nWhereto yearns every sense within me?\n\nMEPHISTOPHELES\n\nWhy, on the whole, thou'rt--what thou art.\nSet wigs of million curls upon thy head, to raise thee,\nWear shoes an ell in height,--the truth betrays thee,\nAnd thou remainest--what thou art.\n\nFAUST\n\nI feel, indeed, that I have made the treasure\nOf human thought and knowledge mine, in vain;\nAnd if I now sit down in restful leisure,\nNo fount of newer strength is in my brain:\nI am no hair's-breadth more in height,\nNor nearer, to the Infinite,\n\nMEPHISTOPHELES\n\nGood Sir, you see the facts precisely\nAs they are seen by each and all.\nWe must arrange them now, more wisely,\nBefore the joys of life shall pall.\nWhy, Zounds! Both hands and feet are, truly--\nAnd head and virile forces--thine:\nYet all that I indulge in newly,\nIs't thence less wholly mine?\nIf I've six stallions in my stall,\nAre not their forces also lent me?\nI speed along, completest man of all,\nAs though my legs were four-and-twenty.\nTake hold, then! let reflection rest,\nAnd plunge into the world with zest!\nI say to thee, a speculative wight\nIs like a beast on moorlands lean,\nThat round and round some fiend misleads to evil plight,\nWhile all about lie pastures fresh and green.\n\nFAUST\n\nThen how shall we begin?\n\nMEPHISTOPHELES\n\nWe'll try a wider sphere.\nWhat place of martyrdom is here!\nIs't life, I ask, is't even prudence,\nTo bore thyself and bore the students?\nLet Neighbor Paunch to that attend!\nWhy plague thyself with threshing straw forever?\nThe best thou learnest, in the end\nThou dar'st not tell the youngsters--never!\nI hear one's footsteps, hither steering.\n\nFAUST\nTo see him now I have no heart.\n\nMEPHISTOPHELES\n\nSo long the poor boy waits a hearing,\nHe must not unconsoled depart.\nThy cap and mantle straightway lend me!\nI'll play the comedy with art.\n\n(_He disguises himself_.)\n\nMy wits, be certain, will befriend me.\nBut fifteen minutes' time is all I need;\nFor our fine trip, meanwhile, prepare thyself with speed!\n\n[_Exit_ FAUST.\n\nMEPHISTOPHELES\n\n(_In_ FAUST'S _long mantle_.)\n\nReason and Knowledge only thou despise,\nThe highest strength in man that lies!\nLet but the Lying Spirit bind thee\nWith magic works and shows that blind thee,\nAnd I shall have thee fast and sure!--\nFate such a bold, untrammelled spirit gave him,\nAs forwards, onwards, ever must endure;\nWhose over-hasty impulse drave him\nPast earthly joys he might secure.\nDragged through the wildest life, will I enslave him,\nThrough flat and stale indifference;\nWith struggling, chilling, checking, so deprave him\nThat, to his hot, insatiate sense,\nThe dream of drink shall mock, but never lave him:\nRefreshment shall his lips in vain implore--\nHad he not made himself the Devil's, naught could save\nhim,\nStill were he lost forevermore!\n\n(_A_ STUDENT _enters_.)\n\nSTUDENT\n\nA short time, only, am I here,\nAnd come, devoted and sincere,\nTo greet and know the man of fame,\nWhom men to me with reverence name.\n\nMEPHISTOPHELES\n\nYour courtesy doth flatter me:\nYou see a man, as others be.\nHave you, perchance, elsewhere begun?\n\nSTUDENT\n\nReceive me now, I pray, as one\nWho comes to you with courage good,\nSomewhat of cash, and healthy blood:\nMy mother was hardly willing to let me;\nBut knowledge worth having I fain would get me.\n\nMEPHISTOPHELES\n\nThen you have reached the right place now.\n\nSTUDENT\n\nI'd like to leave it, I must avow;\nI find these walls, these vaulted spaces\nAre anything but pleasant places.\nTis all so cramped and close and mean;\nOne sees no tree, no glimpse of green,\nAnd when the lecture-halls receive me,\nSeeing, hearing, and thinking leave me.\n\nMEPHISTOPHELES\n\nAll that depends on habitude.\nSo from its mother's breasts a child\nAt first, reluctant, takes its food,\nBut soon to seek them is beguiled.\nThus, at the breasts of Wisdom clinging,\nThou'lt find each day a greater rapture bringing.\n\nSTUDENT\n\nI'll hang thereon with joy, and freely drain them;\nBut tell me, pray, the proper means to gain them.\n\nMEPHISTOPHELES\n\nExplain, before you further speak,\nThe special faculty you seek.\n\nSTUDENT\n\nI crave the highest erudition;\nAnd fain would make my acquisition\nAll that there is in Earth and Heaven,\nIn Nature and in Science too.\n\nMEPHISTOPHELES\n\nHere is the genuine path for you;\nYet strict attention must be given.\n\nSTUDENT\n\nBody and soul thereon I'll wreak;\nYet, truly, I've some inclination\nOn summer holidays to seek\nA little freedom and recreation.\n\nMEPHISTOPHELES\n\nUse well your time! It flies so swiftly from us;\nBut time through order may be won, I promise.\nSo, Friend (my views to briefly sum),\nFirst, the _collegium logicum_.\nThere will your mind be drilled and braced,\nAs if in Spanish boots 'twere laced,\nAnd thus, to graver paces brought,\n'Twill plod along the path of thought,\nInstead of shooting here and there,\nA will-o'-the-wisp in murky air.\nDays will be spent to bid you know,\nWhat once you did at a single blow,\nLike eating and drinking, free and strong,--\nThat one, two, three! thereto belong.\nTruly the fabric of mental fleece\nResembles a weaver's masterpiece,\nWhere a thousand threads one treadle throws,\nWhere fly the shuttles hither and thither.\nUnseen the threads are knit together.\nAnd an infinite combination grows.\nThen, the philosopher steps in\nAnd shows, no otherwise it could have been:\nThe first was so, the second so,\nTherefore the third and fourth are so;\nWere not the first and second, then\nThe third and fourth had never been.\nThe scholars are everywhere believers,\nBut never succeed in being weavers.\nHe who would study organic existence,\nFirst drives out the soul with rigid persistence;\nThen the parts in his hand he may hold and class,\nBut the spiritual link is lost, alas!\n_Encheiresin natures_, this Chemistry names,\nNor knows how herself she banters and blames!\n\nSTUDENT\n\nI cannot understand you quite.\n\nMEPHISTOPHELES\n\nYour mind will shortly be set aright,\nWhen you have learned, all things reducing,\nTo classify them for your using.\n\nSTUDENT\n\nI feel as stupid, from all you've said,\nAs if a mill-wheel whirled in my head!\n\nMEPHISTOPHELES\n\nAnd after--first and foremost duty--Of\nMetaphysics learn the use and beauty!\nSee that you most profoundly gain\nWhat does not suit the human brain!\nA splendid word to serve, you'll find\nFor what goes in--or won't go in--your mind.\nBut first, at least this half a year,\nTo order rigidly adhere;\nFive hours a day, you understand,\nAnd when the clock strikes, be on hand!\nPrepare beforehand for your part\nWith paragraphs all got by heart,\nSo you can better watch, and look\nThat naught is said but what is in the book:\nYet in thy writing as unwearied be,\nAs did the Holy Ghost dictate to thee!\n\nSTUDENT\n\nNo need to tell me twice to do it!\nI think, how useful 'tis to write;\nFor what one has, in black and white,\nOne carries home and then goes through it.\n\nMEPHISTOPHELES\n\nYet choose thyself a faculty!\n\nSTUDENT\n\nI cannot reconcile myself to Jurisprudence.\n\nMEPHISTOPHELES\n\nNor can I therefore greatly blame you students:\nI know what science this has come to be.\nAll rights and laws are still transmitted\nLike an eternal sickness of the race,--\nFrom generation unto generation fitted,\nAnd shifted round from place to place.\nReason becomes a sham, Beneficence a worry:\nThou art a grandchild, therefore woe to thee!\nThe right born with us, ours in verity,\nThis to consider, there's, alas! no hurry.\n\nSTUDENT\n\nMy own disgust is strengthened by your speech:\nO lucky he, whom you shall teach!\nI've almost for Theology decided.\n\nMEPHISTOPHELES\n\nI should not wish to see you here misguided:\nFor, as regards this science, let me hint\n'Tis very hard to shun the false direction;\nThere's so much secret poison lurking in 't,\nSo like the medicine, it baffles your detection.\nHear, therefore, one alone, for that is best, in sooth,\nAnd simply take your master's words for truth.\nOn _words_ let your attention centre!\nThen through the safest gate you'll enter\nThe temple-halls of Certainty.\n\nSTUDENT\n\nYet in the word must some idea be.\n\nMEPHISTOPHELES\n\nOf course! But only shun too over-sharp a tension,\nFor just where fails the comprehension,\nA word steps promptly in as deputy.\nWith words 'tis excellent disputing;\nSystems to words 'tis easy suiting;\nOn words 'tis excellent believing;\nNo word can ever lose a jot from thieving.\n\nSTUDENT\n\nPardon! With many questions I detain you.\nYet must I trouble you again.\nOf Medicine I still would fain\nHear one strong word that might explain you.\nThree years is but a little space.\nAnd, God! who can the field embrace?\nIf one some index could be shown,\n'Twere easier groping forward, truly.\n\nMEPHISTOPHELES (_aside_)\n\nI'm tired enough of this dry tone,--\nMust play the Devil again, and fully.\n\n(_Aloud_)\n\nTo grasp the spirit of Medicine is easy:\nLearn of the great and little world your fill,\nTo let it go at last, so please ye,\nJust as God will!\nIn vain that through the realms of science you may drift;\nEach one learns only--just what learn he can:\nYet he who grasps the Moment's gift,\nHe is the proper man.\nWell-made you are, 'tis not to be denied,\nThe rest a bold address will win you;\nIf you but in yourself confide,\nAt once confide all others in you.\nTo lead the women, learn the special feeling!\nTheir everlasting aches and groans,\nIn thousand tones,\nHave all one source, one mode of healing;\nAnd if your acts are half discreet,\nYou'll always have them at your feet.\nA title first must draw and interest them,\nAnd show that yours all other arts exceeds;\nThen, as a greeting, you are free to touch and test them,\nWhile, thus to do, for years another pleads.\nYou press and count the pulse's dances,\nAnd then, with burning sidelong glances,\nYou clasp the swelling hips, to see\nIf tightly laced her corsets be.\n\nSTUDENT\n\nThat's better, now! The How and Where, one sees.\n\nMEPHISTOPHELES\n\nMy worthy friend, gray are all theories,\nAnd green alone Life's golden tree.\n\nSTUDENT\n\nI swear to you, 'tis like a dream to me.\nMight I again presume, with trust unbounded,\nTo hear your wisdom thoroughly expounded?\n\nMEPHISTOPHELES\n\nMost willingly, to what extent I may.\n\nSTUDENT\n\nI cannot really go away:\nAllow me that my album first I reach you,--\nGrant me this favor, I beseech you!\n\nMEPHISTOPHELES\n\nAssuredly.\n\n(_He writes, and returns the book_.)\n\nSTUDENT (_reads_)\n\n_Eritis sicut Deus, scientes bonum et malum_.\n(_Closes the book with reverence, and withdraws_)\n\nMEPHISTOPHELES\n\nFollow the ancient text, and the snake thou wast ordered to trample!\nWith all thy likeness to God, thou'lt yet be a sorry example!\n\n(FAUST _enters_.)\n\nFAUST\n\nNow, whither shall we go?\n\nMEPHISTOPHELES\n\nAs best it pleases thee.\nThe little world, and then the great, we'll see.\nWith what delight, what profit winning,\nShalt thou sponge through the term beginning!\n\nFAUST\n\nYet with the flowing beard I wear,\nBoth ease and grace will fail me there.\nThe attempt, indeed, were a futile strife;\nI never could learn the ways of life.\nI feel so small before others, and thence\nShould always find embarrassments.\n\nMEPHISTOPHELES\n\nMy friend, thou soon shalt lose all such misgiving:\nBe thou but self-possessed, thou hast the art of living!\n\nFAUST\n\nHow shall we leave the house, and start?\nWhere hast thou servant, coach and horses?\n\nMEPHISTOPHELES\n\nWe'll spread this cloak with proper art,\nThen through the air direct our courses.\nBut only, on so bold a flight,\nBe sure to have thy luggage light.\nA little burning air, which I shall soon prepare us,\nAbove the earth will nimbly bear us,\nAnd, if we're light, we'll travel swift and clear:\nI gratulate thee on thy new career!\n\n[Illustration]\n\n\n\n\nV\n\n\nAUERBACH'S CELLAR IN LEIPZIG\nCAROUSAL OF JOLLY COMPANIONS\n\nFROSCH\n\nI no one laughing? no one drinking?\nI'll teach you how to grin, I'm thinking.\nTo-day you're like wet straw, so tame;\nAnd usually you're all aflame.\n\nBRANDER\n\nNow that's your fault; from you we nothing see,\nNo beastliness and no stupidity.\n\nFROSCH\n\n(_Pours a glass of wine over_ BRANDER'S _head_.)\nThere's both together!\n\nBRANDER\n\nTwice a swine!\n\nFROSCH\n\nYou wanted them: I've given you mine.\n\nSIEBEL\n\nTurn out who quarrels--out the door!\nWith open throat sing chorus, drink and roar!\nUp! holla! ho!\n\nALTMAYER\n\nWoe's me, the fearful bellow!\nBring cotton, quick! He's split my ears, that fellow.\n\nSIEBEL\n\nWhen the vault echoes to the song,\nOne first perceives the bass is deep and strong.\n\nFROSCH\n\nWell said! and out with him that takes the least offence!\n_Ah, tara, lara da_!\n\nALTMAYER\n\n_Ah, tara, lara, da_!\n\nFROSCH\n\nThe throats are tuned, commence!\n(_Sings_.)\n_The dear old holy Roman realm,\nHow does it hold together_?\n\nBRANDER\n\nA nasty song! Fie! a political song--\nA most offensive song! Thank God, each morning, therefore,\nThat you have not the Roman realm to care for!\nAt least, I hold it so much gain for me,\nThat I nor Chancellor nor Kaiser be.\nYet also we must have a ruling head, I hope,\nAnd so we'll choose ourselves a Pope.\nYou know the quality that can\nDecide the choice, and elevate the man.\n\nFROSCH (_sings_)\n\n     _Soar up, soar up, Dame Nightingale!\n     Ten thousand times my sweetheart hail!_\n\nSIEBEL\n\nNo, greet my sweetheart not! I tell you, I'll resent it.\n\nFROSCH\n\nMy sweetheart greet and kiss! I dare you to prevent it!\n\n            (_Sings_.)\n\n     _Draw the latch! the darkness makes:\n     Draw the latch! the lover wakes.\n     Shut the latch! the morning breaks_.\n\nSIEBEL\n\nYes, sing away, sing on, and praise, and brag of her!\nI'll wait my proper time for laughter:\nMe by the nose she led, and now she'll lead you after.\nHer paramour should be an ugly gnome,\nWhere four roads cross, in wanton play to meet her:\nAn old he-goat, from Blocksberg coming home,\nShould his good-night in lustful gallop bleat her!\nA fellow made of genuine flesh and blood\nIs for the wench a deal too good.\nGreet her? Not I: unless, when meeting,\nTo smash her windows be a greeting!\n\nBRANDER (_pounding on the table_)\n\nAttention! Hearken now to me!\nConfess, Sirs, I know how to live.\nEnamored persons here have we,\nAnd I, as suits their quality,\nMust something fresh for their advantage give.\nTake heed! 'Tis of the latest cut, my strain,\nAnd all strike in at each refrain!\n\n     (_He sings_.)\n\n     There was a rat in the cellar-nest,\n     Whom fat and butter made smoother:\n     He had a paunch beneath his vest\n     Like that of Doctor Luther.\n     The cook laid poison cunningly,\n     And then as sore oppressed was he\n     As if he had love in his bosom.\n\n     CHORUS (_shouting_)\n\n     As if he had love in his bosom!\n\n     BRANDER\n\n     He ran around, he ran about,\n     His thirst in puddles laving;\n     He gnawed and scratched the house throughout.\n     But nothing cured his raving.\n     He whirled and jumped, with torment mad,\n     And soon enough the poor beast had,\n     As if he had love in his bosom.\n\n     CHORUS\n\n     As if he had love in his bosom!\n\n     BRANDER\n\n     And driven at last, in open day,\n     He ran into the kitchen,\n     Fell on the hearth, and squirming lay,\n     In the last convulsion twitching.\n     Then laughed the murderess in her glee:\n     \"Ha! ha! he's at his last gasp,\" said she,\n     \"As if he had love in his bosom!\"\n\nCHORUS\n\n     As if he had love in his bosom!\n\nSIEBEL\n\nHow the dull fools enjoy the matter!\nTo me it is a proper art\nPoison for such poor rats to scatter.\n\nBRANDER\n\nPerhaps you'll warmly take their part?\n\nALTMAYER\n\nThe bald-pate pot-belly I have noted:\nMisfortune tames him by degrees;\nFor in the rat by poison bloated\nHis own most natural form he sees.\n\nFAUST AND MEPHISTOPHELES\n\nMEPHISTOPHELES\n\nBefore all else, I bring thee hither\nWhere boon companions meet together,\nTo let thee see how smooth life runs away.\nHere, for the folk, each day's a holiday:\nWith little wit, and ease to suit them,\nThey whirl in narrow, circling trails,\nLike kittens playing with their tails?\nAnd if no headache persecute them,\nSo long the host may credit give,\nThey merrily and careless live.\n\nBRANDER\n\nThe fact is easy to unravel,\nTheir air's so odd, they've just returned from travel:\nA single hour they've not been here.\n\nFROSCH\n\nYou've verily hit the truth! Leipzig to me is dear:\nParis in miniature, how it refines its people!\n\nSIEBEL\n\nWho are the strangers, should you guess?\n\nFROSCH\n\nLet me alone! I'll set them first to drinking,\nAnd then, as one a child's tooth draws, with cleverness,\nI'll worm their secret out, I'm thinking.\nThey're of a noble house, that's very clear:\nHaughty and discontented they appear.\n\nBRANDER\n\nThey're mountebanks, upon a revel.\n\nALTMAYER\n\nPerhaps.\n\nFROSCH\n\nLook out, I'll smoke them now!\n\nMEPHISTOPHELES (_to_ FAUST)\n\nNot if he had them by the neck, I vow,\nWould e'er these people scent the Devil!\n\nFAUST\nFair greeting, gentlemen!\n\nSIEBEL\n\nOur thanks: we give the same.\n(_Murmurs, inspecting_ MEPHISTOPHELES _from the side_.)\nIn one foot is the fellow lame?\n\nMEPHISTOPHELES\n\nIs it permitted that we share your leisure?\nIn place of cheering drink, which one seeks vainly here,\nYour company shall give us pleasure.\n\nALTMAYER\n\nA most fastidious person you appear.\n\n\nFROSCH\n\nNo doubt 'twas late when you from Rippach started?\nAnd supping there with Hans occasioned your delay?\n\nMEPHISTOPHELES\n\nWe passed, without a call, to-day.\nAt our last interview, before we parted\nMuch of his cousins did he speak, entreating\nThat we should give to each his kindly greeting.\n\n(_He bows to_ FROSCH.)\n\nALTMAYER (_aside_)\n\nYou have it now! he understands.\n\nSIEBEL\n\nA knave sharp-set!\n\nFROSCH\n\nJust wait awhile: I'll have him yet.\n\nMEPHISTOPHELES\n\nIf I am right, we heard the sound\nOf well-trained voices, singing chorus;\nAnd truly, song must here rebound\nSuperbly from the arches o'er us.\n\nFROSCH\n\nAre you, perhaps, a virtuoso?\n\nMEPHISTOPHELES\n\nO no! my wish is great, my power is only so-so.\n\nALTMAYER\n\nGive us a song!\n\nMEPHISTOPHELES\n\nIf you desire, a number.\n\nSIEBEL\n\nSo that it be a bran-new strain!\n\nMEPHISTOPHELES\n\nWe've just retraced our way from. Spain,\nThe lovely land of wine, and song, and slumber.\n\n(_Sings_.)\n\nThere was a king once reigning,\nWho had a big black flea--\n\nFROSCH\n\nHear, hear! A flea! D'ye rightly take the jest?\nI call a flea a tidy guest.\n\nMEPHISTOPHELES (_sings_)\n\n     There was a king once reigning,\n     Who had a big black flea,\n     And loved him past explaining,\n     As his own son were he.\n     He called his man of stitches;\n     The tailor came straightway:\n     Here, measure the lad for breeches.\n     And measure his coat, I say!\n\nBRANDER\n\nBut mind, allow the tailor no caprices:\nEnjoin upon him, as his head is dear,\nTo most exactly measure, sew and shear,\nSo that the breeches have no creases!\n\nMEPHISTOPHELES\n\n     In silk and velvet gleaming\n     He now was wholly drest--\n     Had a coat with ribbons streaming,\n     A cross upon his breast.\n     He had the first of stations,\n     A minister's star and name;\n     And also all his relations\n     Great lords at court became.\n\n     And the lords and ladies of honor\n     Were plagued, awake and in bed;\n     The queen she got them upon her,\n     The maids were bitten and bled.\n     And they did not dare to brush them,\n     Or scratch them, day or night:\n     We crack them and we crush them,\n     At once, whene'er they bite.\n\n     CHORUS (_shouting_)\n\n     We crack them and we crush them,\n     At once, whene'er they bite!\n\nFROSCH\nBravo! bravo! that was fine.\n\nSIEBEL\n\nEvery flea may it so befall!\n\nBRANDER\n\nPoint your fingers and nip them all!\n\nALTMAYER\n\nHurrah for Freedom! Hurrah for wine!\n\nMEPHISTOPHELES\n\nI fain would drink with you, my glass to Freedom clinking,\nIf 'twere a better wine that here I see you drinking.\n\nSIEBEL\n\nDon't let us hear that speech again!\n\nMEPHISTOPHELES\n\nDid I not fear the landlord might complain,\nI'd treat these worthy guests, with pleasure,\nTo some from out our cellar's treasure.\n\nSIEBEL\n\nJust treat, and let the landlord me arraign!\n\nFROSCH\n\nAnd if the wine be good, our praises shall be ample.\nBut do not give too very small a sample;\nFor, if its quality I decide,\nWith a good mouthful I must be supplied.\n\nALTMAYER (_aside_)\n\nThey're from the Rhine! I guessed as much, before.\n\nMEPHISTOPHELES\n\nBring me a gimlet here!\n\nBRANDER\n\nWhat shall therewith be done?\nYou've not the casks already at the door?\n\nALTMAYER\n\nYonder, within the landlord's box of tools, there's one!\n\nMEPHISTOPHELES (_takes the gimlet_)\n\n(_To_ FROSCH.)\n\nNow, give me of your taste some intimation.\n\nFROSCH\n\nHow do you mean? Have you so many kinds?\n\nMEPHISTOPHELES\n\nThe choice is free: make up your minds.\n\nALTMAYER (_to_ FROSCH)\n\nAha! you lick your chops, from sheer anticipation.\n\nFROSCH\n\nGood! if I have the choice, so let the wine be Rhenish!\nOur Fatherland can best the sparkling cup replenish.\n\nMEPHISTOPHELES\n\n(_boring a hole in the edge of the table, at the place where_\nFROSCH _sits_)\n\nGet me a little wax, to make the stoppers, quick!\n\nALTMAYER\n\nAh! I perceive a juggler's trick.\n\nMEPHISTOPHELES (_to_ BRANDER)\n\nAnd you?\n\nBRANDER\n\nChampagne shall be my wine,\nAnd let it sparkle fresh and fine!\n\nMEPHISTOPHELES\n\n(_bores: in the meantime one has made the wax stoppers, and\nplugged the holes with them_.)\n\nBRANDER\n\nWhat's foreign one can't always keep quite clear of,\nFor good things, oft, are not so near;\nA German can't endure the French to see or hear of,\nYet drinks their wines with hearty cheer.\n\nSIEBEL\n\n(_as_ MEPHISTOPHELES _approaches his seat_)\nFor me, I grant, sour wine is out of place;\nFill up my glass with sweetest, will you?\n\nMEPHISTOPHELES (_boring_)\n\nTokay shall flow at once, to fill you!\n\nALTMAYER\n\nNo--look me, Sirs, straight in the face!\nI see you have your fun at our expense.\n\nMEPHISTOPHELES\n\nO no! with gentlemen of such pretence,\nThat were to venture far, indeed.\nSpeak out, and make your choice with speed!\nWith what a vintage can I serve you?\n\nALTMAYER\n\nWith any--only satisfy our need.\n\n(_After the holes have been bored and plugged_)\n\nMEPHISTOPHELES (_with singular gestures_)\n\n     Grapes the vine-stem bears,\n     Horns the he-goat wears!\n     The grapes are juicy, the vines are wood,\n     The wooden table gives wine as good!\n     Into the depths of Nature peer,--\n     Only believe there's a miracle here!\n\nNow draw the stoppers, and drink your fill!\n\nALL\n\n(_as they draw out the stoppers, and the wine which has been\ndesired flows into the glass of each)_\n\nO beautiful fountain, that flows at will!\n\nMEPHISTOPHELES\n\nBut have a care that you nothing spill!\n\n(_They drink repeatedly_.)\n\nALL (_sing_)\n\n     As 'twere five hundred hogs, we feel\n     So cannibalic jolly!\n\nMEPHISTOPHELES\n\nSee, now, the race is happy--it is free!\n\nFAUST\n\nTo leave them is my inclination.\n\nMEPHISTOPHELES\n\nTake notice, first! their bestiality\nWill make a brilliant demonstration.\n\nSIEBEL\n\n(_drinks carelessly: the wine spills upon the earth, and turns to\nflame_)\n\nHelp! Fire! Help! Hell-fire is sent!\n\nMEPHISTOPHELES (_charming away the flame)_\n\nBe quiet, friendly element!\n\n(_To the revellers_)\n\nA bit of purgatory 'twas for this time, merely.\n\nSIEBEL\n\nWhat mean you? Wait!--you'll pay for't dearly!\nYou'll know us, to your detriment.\n\nFROSCH\n\nDon't try that game a second time upon us!\n\nALTMAYER\n\nI think we'd better send him packing quietly.\n\nSIEBEL\n\nWhat, Sir! you dare to make so free,\nAnd play your hocus-pocus on us!\n\nMEPHISTOPHELES\n\nBe still, old wine-tub.\n\nSIEBEL\n\nBroomstick, you!\nYou face it out, impertinent and heady?\n\nBRANDER\n\nJust wait! a shower of blows is ready.\n\nALTMAYER\n\n(_draws a stopper out of the table: fire flies in his face_.)\nI burn! I burn!\n\nSIEBEL\n\n'Tis magic! Strike--\nThe knave is outlawed! Cut him as you like!\n(_They draw their knives, and rush upon_ MEPHISTOPHELES.)\n\nMEPHISTOPHELES (_with solemn gestures_)\n\n     False word and form of air,\n     Change place, and sense ensnare!\n     Be here--and there!\n\n(_They stand amazed and look at each other_.)\n\nALTMAYER\n\nWhere am I? What a lovely land!\n\nFROSCH\n\nVines? Can I trust my eyes?\n\nSIEBEL\n\nAnd purple grapes at hand!\n\nBRANDER\n\nHere, over this green arbor bending,\nSee what a vine! what grapes depending!\n\n(_He takes_ SIEBEL _by the nose: the others do the same reciprocally,\nand raise their knives_.)\n\nMEPHISTOPHELES (_as above_)\n\nLoose, Error, from their eyes the band,\nAnd how the Devil jests, be now enlightened!\n\n(_He disappears with_ FAUST: _the revellers start and separate_.)\n\nSIEBEL\n\nWhat happened?\n\nALTMAYER\n\nHow?\n\nFROSCH\n\nWas that your nose I tightened?\n\nBRANDER (_to_ SIEBEL)\n\nAnd yours that still I have in hand?\n\nALTMAYER\n\nIt was a blow that went through every limb!\nGive me a chair! I sink! my senses swim.\n\nFROSCH\n\nBut what has happened, tell me now?\n\nSIEBEL\n\nWhere is he? If I catch the scoundrel hiding,\nHe shall not leave alive, I vow.\n\nALTMAYER\n\nI saw him with these eyes upon a wine-cask riding\nOut of the cellar-door, just now.\nStill in my feet the fright like lead is weighing.\n(_He turns towards the table_.)\nWhy! If the fount of wine should still be playing?\n\nSIEBEL\n\n'Twas all deceit, and lying, false design!\n\nFROSCH\n\nAnd yet it seemed as I were drinking wine.\n\nBRANDER\n\nBut with the grapes how was it, pray?\n\nALTMAYER\n\nShall one believe no miracles, just say!\n\n[Illustration]\n\n[Illustration]\n\n\n\n\nVI\n\n\nWITCHES' KITCHEN\n\n(_Upon a low hearth stands a great caldron, under which a fire\nis burning. Various figures appear in the vapors which\nrise from the caldron. An ape sits beside it, skims it, and\nwatches lest it boil over. The he-ape, with the young\nones, sits near and warms himself. Ceiling and walls are\ncovered with the most fantastic witch-implements_.)\n\nFAUST MEPHISTOPHELES\n\nFAUST\n\nThese crazy signs of witches' craft repel me!\nI shall recover, dost thou tell me,\nThrough this insane, chaotic play?\nFrom an old hag shall I demand assistance?\nAnd will her foul mess take away\nFull thirty years from my existence?\nWoe's me, canst thou naught better find!\nAnother baffled hope must be lamented:\nHas Nature, then, and has a noble mind\nNot any potent balsam yet invented?\n\nMEPHISTOPHELES\n\nOnce more, my friend, thou talkest sensibly.\nThere is, to make thee young, a simpler mode and apter;\nBut in another book 'tis writ for thee,\nAnd is a most eccentric chapter.\n\nFAUST\n\nYet will I know it.\n\nMEPHISTOPHELES\n\nGood! the method is revealed\nWithout or gold or magic or physician.\nBetake thyself to yonder field,\nThere hoe and dig, as thy condition;\nRestrain thyself, thy sense and will\nWithin a narrow sphere to flourish;\nWith unmixed food thy body nourish;\nLive with the ox as ox, and think it not a theft\nThat thou manur'st the acre which thou reapest;--\nThat, trust me, is the best mode left,\nWhereby for eighty years thy youth thou keepest!\n\nFAUST\n\nI am not used to that; I cannot stoop to try it--\nTo take the spade in hand, and ply it.\nThe narrow being suits me not at all.\n\nMEPHISTOPHELES\n\nThen to thine aid the witch must call.\n\nFAUST\n\nWherefore the hag, and her alone?\nCanst thou thyself not brew the potion?\n\nMEPHISTOPHELES\n\nThat were a charming sport, I own:\nI'd build a thousand bridges meanwhile, I've a notion.\nNot Art and Science serve, alone;\nPatience must in the work be shown.\nLong is the calm brain active in creation;\nTime, only, strengthens the fine fermentation.\nAnd all, belonging thereunto,\nIs rare and strange, howe'er you take it:\nThe Devil taught the thing, 'tis true,\nAnd yet the Devil cannot make it.\n(_Perceiving the Animals_)\nSee, what a delicate race they be!\nThat is the maid! the man is he!\n(_To the Animals_)\nIt seems the mistress has gone away?\n\nTHE ANIMALS\n\nCarousing, to-day!\nOff and about,\nBy the chimney out!\n\nMEPHISTOPHELES\n\nWhat time takes she for dissipating?\n\nTHE ANIMALS\n\nWhile we to warm our paws are waiting.\n\nMEPHISTOPHELES (_to_ FAUST)\n\nHow findest thou the tender creatures?\n\nFAUST\n\nAbsurder than I ever yet did see.\n\nMEPHISTOPHELES\n\nWhy, just such talk as this, for me,\nIs that which has the most attractive features!\n\n(_To the Animals_)\n\nBut tell me now, ye cursed puppets,\nWhy do ye stir the porridge so?\n\nTHE ANIMALS\n\nWe're cooking watery soup for beggars.\n\nMEPHISTOPHELES\n\nThen a great public you can show.\n\nTHE HE-APE\n\n(_comes up and fawns on_ MEPHISTOPHELES)\n\n     O cast thou the dice!\n     Make me rich in a trice,\n     Let me win in good season!\n     Things are badly controlled,\n     And had I but gold,\n     So had I my reason.\n\nMEPHISTOPHELES\n\nHow would the ape be sure his luck enhances.\nCould he but try the lottery's chances!\n\n(_In the meantime the young apes have been playing with a\nlarge ball, which they now roll forward_.)\n\nTHE HE-APE\n\n     The world's the ball:\n     Doth rise and fall,\n     And roll incessant:\n     Like glass doth ring,\n     A hollow thing,--\n     How soon will't spring,\n     And drop, quiescent?\n     Here bright it gleams,\n     Here brighter seems:\n     I live at present!\n     Dear son, I say,\n     Keep thou away!\n     Thy doom is spoken!\n     'Tis made of clay,\n     And will be broken.\n\nMEPHISTOPHELES\n\nWhat means the sieve?\n\nTHE HE-APE (_taking it down_)\n\n     Wert thou the thief,\n     I'd know him and shame him.\n\n(_He runs to the_ SHE-APE, _and lets her look through it_.)\n\n     Look through the sieve!\n     Know'st thou the thief,\n     And darest not name him?\n\nMEPHISTOPHELES (_approaching the fire)_\n\nAnd what's this pot?\n\nHE-APE AND SHE-APE\n\n     The fool knows it not!\n     He knows not the pot,\n     He knows not the kettle!\n\nMEPHISTOPHELES\n\nImpertinent beast!\n\nTHE HE-APE\n\nTake the brush here, at least,\nAnd sit down on the settle!\n\n(_He invites_ MEPHISTOPHELES _to sit down_.)\n\nFAUST\n\n(_who during all this time has been standing before a mirror,\nnow approaching and now retreating from it_)\n\nWhat do I see? What heavenly form revealed\nShows through the glass from Magic's fair dominions!\nO lend me, Love, the swiftest of thy pinions,\nAnd bear me to her beauteous field!\nAh, if I leave this spot with fond designing,\nIf I attempt to venture near,\nDim, as through gathering mist, her charms appear!--\nA woman's form, in beauty shining!\nCan woman, then, so lovely be?\nAnd must I find her body, there reclining,\nOf all the heavens the bright epitome?\nCan Earth with such a thing be mated?\n\nMEPHISTOPHELES\n\nWhy, surely, if a God first plagues Himself six days,\nThen, self-contented, _Bravo_! says,\nMust something clever be created.\nThis time, thine eyes be satiate!\nI'll yet detect thy sweetheart and ensnare her,\nAnd blest is he, who has the lucky fate,\nSome day, as bridegroom, home to bear her.\n\n(FAUST _gazes continually in the mirror_. MEPHISTOPHELES,\n_stretching himself out on the settle, and playing with the\nbrush, continues to speak_.)\n\nSo sit I, like the King upon his throne:\nI hold the sceptre, here,--and lack the crown alone.\n\nTHE ANIMALS\n\n(_who up to this time have been making all kinds of fantastic\nmovements together bring a crown to_ MEPHISTOPHELES\n_with great noise_.)\n\n     O be thou so good\n     With sweat and with blood\n     The crown to belime!\n\n(_They handle the crown awkwardly and break it into two\npieces, with which they spring around_.)\n\n     'Tis done, let it be!\n     We speak and we see,\n     We hear and we rhyme!\n\nFAUST (_before the mirror_)\n\nWoe's me! I fear to lose my wits.\n\nMEPHISTOPHELES (_pointing to the Animals_)\n\nMy own head, now, is really nigh to sinking.\n\nTHE ANIMALS\n\n     If lucky our hits,\n     And everything fits,\n     'Tis thoughts, and we're thinking!\n\nFAUST (_as above_)\n\nMy bosom burns with that sweet vision;\nLet us, with speed, away from here!\n\nMEPHISTOPHELES (_in the same attitude_)\n\nOne must, at least, make this admission--\nThey're poets, genuine and sincere.\n\n(_The caldron, which the_ SHE-APE _has up to this time neglected\nto watch, begins to boil over: there ensues a great flame_,\n_which blazes out the chimney. The_ WITCH _comes careering\ndown through the flame, with terrible cries_.)\n\nTHE WITCH\n\n     Ow! ow! ow! ow!\n     The damned beast--the cursed sow!\n     To leave the kettle, and singe the Frau!\n     Accursed fere!\n\n(_Perceiving_ FAUST _and_ MEPHISTOPHELES.)\n\n     What is that here?\n     Who are you here?\n     What want you thus?\n     Who sneaks to us?\n     The fire-pain\n     Burn bone and brain!\n\n(_She plunges the skimming-ladle into the caldron, and scatters\nflames towards_ FAUST, MEPHISTOPHELES, _and the Animals.\nThe Animals whimper_.)\n\nMEPHISTOPHELES\n\n(_reversing the brush, which he has been holding in his hand,\nand striding among the jars and glasses_)\n\n     In two! in two!\n     There lies the brew!\n     There lies the glass!\n     The joke will pass,\n     As time, foul ass!\n     To the singing of thy crew.\n\n(_As the_ WITCH _starts back, full of wrath and horror_)\n\nHa! know'st thou me? Abomination, thou!\nKnow'st thou, at last, thy Lord and Master?\nWhat hinders me from smiting now\nThee and thy monkey-sprites with fell disaster?\nHast for the scarlet coat no reverence?\nDost recognize no more the tall cock's-feather?\nHave I concealed this countenance?--\nMust tell my name, old face of leather?\n\nTHE WITCH\n\nO pardon, Sir, the rough salute!\nYet I perceive no cloven foot;\nAnd both your ravens, where are _they_ now?\n\nMEPHISTOPHELES\n\nThis time, I'll let thee 'scape the debt;\nFor since we two together met,\n'Tis verily full many a day now.\nCulture, which smooth the whole world licks,\nAlso unto the Devil sticks.\nThe days of that old Northern phantom now are over:\nWhere canst thou horns and tail and claws discover?\nAnd, as regards the foot, which I can't spare, in truth,\n'Twould only make the people shun me;\nTherefore I've worn, like many a spindly youth,\nFalse calves these many years upon me.\n\nTHE WITCH (_dancing_)\n\nReason and sense forsake my brain,\nSince I behold Squire Satan here again!\n\nMEPHISTOPHELES\n\nWoman, from such a name refrain!\n\nTHE WITCH\n\nWhy so? What has it done to thee?\n\nMEPHISTOPHELES\n\nIt's long been written in the Book of Fable;\nYet, therefore, no whit better men we see:\nThe Evil One has left, the evil ones are stable.\nSir Baron call me thou, then is the matter good;\nA cavalier am I, like others in my bearing.\nThou hast no doubt about my noble blood:\nSee, here's the coat-of-arms that I am wearing!\n\n(_He makes an indecent gesture_.)\n\nTHE WITCH (_laughs immoderately_)\n\nHa! ha! That's just your way, I know:\nA rogue you are, and you were always so.\n\nMEPHISTOPHELES (_to_ FAUST)\n\nMy friend, take proper heed, I pray!\nTo manage witches, this is just the way.\n\nTHE WITCH\n\nWherein, Sirs, can I be of use?\n\nMEPHISTOPHELES\n\nGive us a goblet of the well-known juice!\nBut, I must beg you, of the oldest brewage;\nThe years a double strength produce.\n\nTHE WITCH\n\nWith all my heart! Now, here's a bottle,\nWherefrom, sometimes, I wet my throttle,\nWhich, also, not the slightest, stinks;\nAnd willingly a glass I'll fill him.\n\n(_Whispering_)\n\nYet, if this man without due preparation drinks,\nAs well thou know'st, within an hour 'twill kill him.\n\nMEPHISTOPHELES\n\nHe is a friend of mine, with whom it will agree,\nAnd he deserves thy kitchen's best potation:\nCome, draw thy circle, speak thine adjuration,\nAnd fill thy goblet full and free!\n\nTHE WITCH\n\n(_with fantastic gestures draws a circle and places mysterious\narticles therein; meanwhile the glasses begin to ring, the\ncaldron to sound, and make a musical accompaniment.\nFinally she brings a great book, and stations in the circle\nthe Apes, who are obliged to serve as reading-desk, and to\nhold the torches. She then beckons_ FAUST _to approach_.)\n\nFAUST (_to_ MEPHISTOPHELES)\n\nNow, what shall come of this? the creatures antic,\nThe crazy stuff, the gestures frantic,--\nAll the repulsive cheats I view,--\nAre known to me, and hated, too.\n\nMEPHISTOPHELES\n\nO, nonsense! That's a thing for laughter;\nDon't be so terribly severe!\nShe juggles you as doctor now, that, after,\nThe beverage may work the proper cheer.\n\n(_He persuades_ FAUST _to step into the circle_.)\n\nTHE WITCH\n\n(_begins to declaim, with much emphasis, from the book_)\n\n     See, thus it's done!\n     Make ten of one,\n     And two let be,\n     Make even three,\n     And rich thou 'It be.\n     Cast o'er the four!\n     From five and six\n     (The witch's tricks)\n     Make seven and eight,\n     'Tis finished straight!\n     And nine is one,\n     And ten is none.\n     This is the witch's once-one's-one!\n\nFAUST\n\nShe talks like one who raves in fever.\n\nMEPHISTOPHELES\n\nThou'lt hear much more before we leave her.\n'Tis all the same: the book I can repeat,\nSuch time I've squandered o'er the history:\nA contradiction thus complete\nIs always for the wise, no less than fools, a mystery.\nThe art is old and new, for verily\nAll ages have been taught the matter,--\nBy Three and One, and One and Three,\nError instead of Truth to scatter.\nThey prate and teach, and no one interferes;\nAll from the fellowship of fools are shrinking.\nMan usually believes, if only words he hears,\nThat also with them goes material for thinking!\n\nTHE WITCH (_continues_)\n\n     The lofty skill\n     Of Science, still\n     From all men deeply hidden!\n     Who takes no thought,\n     To him 'tis brought,\n     'Tis given unsought, unbidden!\n\nFAUST\n\nWhat nonsense she declaims before us!\nMy head is nigh to split, I fear:\nIt seems to me as if I hear\nA hundred thousand fools in chorus.\n\nMEPHISTOPHELES\n\nO Sibyl excellent, enough of adjuration!\nBut hither bring us thy potation,\nAnd quickly fill the beaker to the brim!\nThis drink will bring my friend no injuries:\nHe is a man of manifold degrees,\nAnd many draughts are known to him.\n\n(_The_ WITCH, _with many ceremonies, pours the drink into a\ncup; as_ FAUST _sets it to his lips, a light flame arises_.)\n\nDown with it quickly! Drain it off!\n'Twill warm thy heart with new desire:\nArt with the Devil hand and glove,\nAnd wilt thou be afraid of fire?\n\n(_The_ WITCH _breaks the circle_: FAUST _steps forth_.)\n\nMEPHISTOPHELES\n\nAnd now, away! Thou dar'st not rest.\n\nTHE WITCH\n\nAnd much good may the liquor do thee!\n\nMEPHISTOPHELES (_to the_ WITCH)\n\nThy wish be on Walpurgis Night expressed;\nWhat boon I have, shall then be given unto thee.\n\nTHE WITCH\n\nHere is a song, which, if you sometimes sing,\nYou'll find it of peculiar operation.\n\nMEPHISTOPHELES (_to_ FAUST)\n\nCome, walk at once! A rapid occupation\nMust start the needful perspiration,\nAnd through thy frame the liquor's potence fling.\nThe noble indolence I'll teach thee then to treasure,\nAnd soon thou'lt be aware, with keenest thrills of pleasure,\nHow Cupid stirs and leaps, on light and restless wing.\n\nFAUST\n\nOne rapid glance within the mirror give me,\nHow beautiful that woman-form!\n\nMEPHISTOPHELES\n\nNo, no! The paragon of all, believe me,\nThou soon shalt see, alive and warm.\n\n_(Aside)_\n\nThou'lt find, this drink thy blood compelling,\nEach woman beautiful as Helen!\n\n[Illustration]\n\n[Illustration]\n\n\n\n\nVII\n\n\nSTREET\n\nFAUST MARGARET _(passing by)_\n\nFAUST\n\nFair lady, let it not offend you,\nThat arm and escort I would lend you!\n\nMARGARET\n\nI'm neither lady, neither fair,\nAnd home I can go without your care.\n\n[_She releases herself, and exit_.\n\nFAUST\n\nBy Heaven, the girl is wondrous fair!\nOf all I've seen, beyond compare;\nSo sweetly virtuous and pure,\nAnd yet a little pert, be sure!\nThe lip so red, the cheek's clear dawn,\n[Illustration:]\nI'll not forget while the world rolls on!\nHow she cast down her timid eyes,\nDeep in my heart imprinted lies:\nHow short and sharp of speech was she,\nWhy, 'twas a real ecstasy!\n\n(MEPHISTOPHELES _enters_)\n\nFAUST\n\nHear, of that girl I'd have possession!\n\nMEPHISTOPHELES\n\nWhich, then?\n\nFAUST\n\nThe one who just went by.\n\nMEPHISTOPHELES\n\nShe, there? She's coming from confession,\nOf every sin absolved; for I,\nBehind her chair, was listening nigh.\nSo innocent is she, indeed,\nThat to confess she had no need.\nI have no power o'er souls so green.\n\nFAUST\n\nAnd yet, she's older than fourteen.\n\nMEPHISTOPHELES\n\nHow now! You're talking like Jack Rake,\nWho every flower for himself would take,\nAnd fancies there are no favors more,\nNor honors, save for him in store;\nYet always doesn't the thing succeed.\n\nFAUST\n\nMost Worthy Pedagogue, take heed!\nLet not a word of moral law be spoken!\nI claim, I tell thee, all my right;\nAnd if that image of delight\nRest not within mine arms to-night,\nAt midnight is our compact broken.\n\nMEPHISTOPHELES\n\nBut think, the chances of the case!\nI need, at least, a fortnight's space,\nTo find an opportune occasion.\n\nFAUST\n\nHad I but seven hours for all,\nI should not on the Devil call,\nBut win her by my own persuasion.\n\nMEPHISTOPHELES\n\nYou almost like a Frenchman prate;\nYet, pray, don't take it as annoyance!\nWhy, all at once, exhaust the joyance?\nYour bliss is by no means so great\nAs if you'd use, to get control,\nAll sorts of tender rigmarole,\nAnd knead and shape her to your thought,\nAs in Italian tales 'tis taught.\n\nFAUST\n\nWithout that, I have appetite.\n\nMEPHISTOPHELES\n\nBut now, leave jesting out of sight!\nI tell you, once for all, that speed\nWith this fair girl will not succeed;\nBy storm she cannot captured be;\nWe must make use of strategy.\n\nFAUST\n\nGet me something the angel keeps!\nLead me thither where she sleeps!\nGet me a kerchief from her breast,--\nA garter that her knee has pressed!\n\nMEPHISTOPHELES\n\nThat you may see how much I'd fain\nFurther and satisfy your pain,\nWe will no longer lose a minute;\nI'll find her room to-day, and take you in it.\n\nFAUST\n\nAnd shall I see--possess her?\n\nMEPHISTOPHELES\n\nNo!\nUnto a neighbor she must go,\nAnd meanwhile thou, alone, mayst glow\nWith every hope of future pleasure,\nBreathing her atmosphere in fullest measure.\n\nFAUST\n\nCan we go thither?\n\nMEPHISTOPHELES\n\n'Tis too early yet.\n\nFAUST\n\nA gift for her I bid thee get!\n[_Exit_.\n\nMEPHISTOPHELES\n\nPresents at once? That's good: he's certain to get at her!\nFull many a pleasant place I know,\nAnd treasures, buried long ago:\nI must, perforce, look up the matter. _[Exit_.\n[Illustration]\n\n\n\n\nVIII\n\n\nEVENING A SMALL, NEATLY KEPT CHAMBER\n\nMARGARET\n\n(_plaiting and binding up the braids of her hair_)\n\nI'd something give, could I but say\nWho was that gentleman, to-day.\nSurely a gallant man was he,\nAnd of a noble family;\nAnd much could I in his face behold,--\nAnd he wouldn't, else, have been so bold!\n\n                              [_Exit_\n\nMEPHISTOPHELES FAUST\n\nMEPHISTOPHELES\n\nCome in, but gently: follow me!\n\nFAUST (_after a moment's silence_)\n\nLeave me alone, I beg of thee!\n\nMEPHISTOPHELES (_prying about_)\n\nNot every girl keeps things so neat.\n\nFAUST (_looking around_)\n\nO welcome, twilight soft and sweet,\nThat breathes throughout this hallowed shrine!\nSweet pain of love, bind thou with fetters fleet\nThe heart that on the dew of hope must pine!\nHow all around a sense impresses\nOf quiet, order, and content!\nThis poverty what bounty blesses!\nWhat bliss within this narrow den is pent!\n\n(_He throws himself into a leathern arm-chair near the bed_.)\n\nReceive me, thou, that in thine open arms\nDeparted joy and pain wert wont to gather!\nHow oft the children, with their ruddy charms,\nHung here, around this throne, where sat the father!\nPerchance my love, amid the childish band,\nGrateful for gifts the Holy Christmas gave her,\nHere meekly kissed the grandsire's withered hand.\nI feel, O maid! thy very soul\nOf order and content around me whisper,--\nWhich leads thee with its motherly control,\nThe cloth upon thy board bids smoothly thee unroll,\nThe sand beneath thy feet makes whiter, crisper.\nO dearest hand, to thee 'tis given\nTo change this hut into a lower heaven!\nAnd here!\n\n(_He lifts one of the bed-curtains_.)\n\nWhat sweetest thrill is in my blood!\nHere could I spend whole hours, delaying:\nHere Nature shaped, as if in sportive playing,\nThe angel blossom from the bud.\nHere lay the child, with Life's warm essence\nThe tender bosom filled and fair,\nAnd here was wrought, through holier, purer presence,\nThe form diviner beings wear!\n\nAnd I? What drew me here with power?\nHow deeply am I moved, this hour!\nWhat seek I? Why so full my heart, and sore?\nMiserable Faust! I know thee now no more.\n\nIs there a magic vapor here?\nI came, with lust of instant pleasure,\nAnd lie dissolved in dreams of love's sweet leisure!\nAre we the sport of every changeful atmosphere?\n\nAnd if, this moment, came she in to me,\nHow would I for the fault atonement render!\nHow small the giant lout would be,\nProne at her feet, relaxed and tender!\n\nMEPHISTOPHELES\n\nBe quick! I see her there, returning.\n\nFAUST\n\nGo! go! I never will retreat.\n\nMEPHISTOPHELES\n\nHere is a casket, not unmeet,\nWhich elsewhere I have just been earning.\nHere, set it in the press, with haste!\nI swear, 'twill turn her head, to spy it:\nSome baubles I therein had placed,\nThat you might win another by it.\nTrue, child is child, and play is play.\n\nFAUST\n\nI know not, should I do it?\n\nMEPHISTOPHELES\n\nAsk you, pray?\nYourself, perhaps, would keep the bubble?\nThen I suggest, 'twere fair and just\nTo spare the lovely day your lust,\nAnd spare to me the further trouble.\nYou are not miserly, I trust?\nI rub my hands, in expectation tender--\n\n(_He places the casket in the press, and locks it again_.)\n\nNow quick, away!\nThe sweet young maiden to betray,\nSo that by wish and will you bend her;\nAnd you look as though\nTo the lecture-hall you were forced to go,--\nAs if stood before you, gray and loath,\nPhysics and Metaphysics both!\nBut away! [_Exeunt_.\n\nMARGARET (_with a lamp_)\n\nIt is so close, so sultry, here!\n\n(_She opens the window_)\n\nAnd yet 'tis not so warm outside.\nI feel, I know not why, such fear!--\nWould mother came!--where can she bide?\nMy body's chill and shuddering,--\nI'm but a silly, fearsome thing!\n\n(_She begins to sing while undressing_)\n\n        There was a King in Thule,\n        Was faithful till the grave,--\n        To whom his mistress, dying,\n        A golden goblet gave.\n\n        Naught was to him more precious;\n        He drained it at every bout:\n        His eyes with tears ran over,\n        As oft as he drank thereout.\n\n        When came his time of dying,\n        The towns in his land he told,\n        Naught else to his heir denying\n        Except the goblet of gold.\n\n        He sat at the royal banquet\n        With his knights of high degree,\n        In the lofty hall of his fathers\n        In the Castle by the Sea.\n\n        There stood the old carouser,\n        And drank the last life-glow;\n        And hurled the hallowed goblet\n        Into the tide below.\n\n        He saw it plunging and filling,\n        And sinking deep in the sea:\n        Then fell his eyelids forever,\n        And never more drank he!\n\n(_She opens the press in order to arrange her clothes, and perceives\nthe casket of jewels_.)\n\nHow comes that lovely casket here to me?\nI locked the press, most certainly.\n'Tis truly wonderful! What can within it be?\nPerhaps 'twas brought by some one as a pawn,\nAnd mother gave a loan thereon?\nAnd here there hangs a key to fit:\nI have a mind to open it.\nWhat is that? God in Heaven! Whence came\nSuch things? Never beheld I aught so fair!\nRich ornaments, such as a noble dame\nOn highest holidays might wear!\nHow would the pearl-chain suit my hair?\nAh, who may all this splendor own?\n\n(_She adorns herself with the jewelry, and steps before the\nmirror_.)\n\nWere but the ear-rings mine, alone!\nOne has at once another air.\nWhat helps one's beauty, youthful blood?\nOne may possess them, well and good;\nBut none the more do others care.\nThey praise us half in pity, sure:\nTo gold still tends,\nOn gold depends\nAll, all! Alas, we poor!\n\n[Illustration]\n\n[Illustration]\n\n\n\n\nIX\n\n\nPROMENADE\n\n(FAUST, _walking thoughtfully up and down. To him_ MEPHISTOPHELES.)\n\nMEPHISTOPHELES\n\nBy all love ever rejected! By hell-fire hot and unsparing!\nI wish I knew something worse, that I might use it for\nswearing!\n\nFAUST\n\nWhat ails thee? What is't gripes thee, elf?\nA face like thine beheld I never.\n\nMEPHISTOPHELES\n\nI would myself unto the Devil deliver,\nIf I were not a Devil myself!\n\nFAUST\n\nThy head is out of order, sadly:\nIt much becomes thee to be raving madly.\n\nMEPHISTOPHELES\n\nJust think, the pocket of a priest should get\nThe trinkets left for Margaret!\nThe mother saw them, and, instanter,\nA secret dread began to haunt her.\nKeen scent has she for tainted air;\nShe snuffs within her book of prayer,\nAnd smells each article, to see\nIf sacred or profane it be;\nSo here she guessed, from every gem,\nThat not much blessing came with them.\n\"My child,\" she said, \"ill-gotten good\nEnsnares the soul, consumes the blood.\nBefore the Mother of God we'll lay it;\nWith heavenly manna she'll repay it!\"\nBut Margaret thought, with sour grimace,\n\"A gift-horse is not out of place,\nAnd, truly! godless cannot be\nThe one who brought such things to me.\"\nA parson came, by the mother bidden:\nHe saw, at once, where the game was hidden,\nAnd viewed it with a favor stealthy.\nHe spake: \"That is the proper view,--\nWho overcometh, winneth too.\nThe Holy Church has a stomach healthy:\nHath eaten many a land as forfeit,\nAnd never yet complained of surfeit:\nThe Church alone, beyond all question,\nHas for ill-gotten goods the right digestion.\"\n\nFAUST\n\nA general practice is the same,\nWhich Jew and King may also claim.\n\nMEPHISTOPHELES\n\nThen bagged the spangles, chains, and rings,\nAs if but toadstools were the things,\nAnd thanked no less, and thanked no more\nThan if a sack of nuts he bore,--\nPromised them fullest heavenly pay,\nAnd deeply edified were they.\n\nFAUST\n\nAnd Margaret?\n\nMEPHISTOPHELES\n\nSits unrestful still,\nAnd knows not what she should, or will;\nThinks on the jewels, day and night,\nBut more on him who gave her such delight.\n\nFAUST\n\nThe darling's sorrow gives me pain.\nGet thou a set for her again!\nThe first was not a great display.\n\nMEPHISTOPHELES\n\nO yes, the gentleman finds it all child's-play!\n\nFAUST\n\nFix and arrange it to my will;\nAnd on her neighbor try thy skill!\nDon't be a Devil stiff as paste,\nBut get fresh jewels to her taste!\n\nMEPHISTOPHELES\n\nYes, gracious Sir, in all obedience!\n\n[_Exit_ FAUST.\n\nSuch an enamored fool in air would blow\nSun, moon, and all the starry legions,\nTo give his sweetheart a diverting show.\n\n[_Exit_.\n\n[Illustration]\n\n\n\n\nX\n\n\nTHE NEIGHBOR'S HOUSE\n\nMARTHA (_solus_)\n\nGod forgive my husband, yet he\nHasn't done his duty by me!\nOff in the world he went straightway,--\nLeft me lie in the straw where I lay.\nAnd, truly, I did naught to fret him:\nGod knows I loved, and can't forget him!\n\n(_She weeps_.)\n\nPerhaps he's even dead! Ah, woe!--\nHad I a certificate to show!\n\nMARGARET (_comes_)\n\nDame Martha!\n\nMARTHA\n\nMargaret! what's happened thee?\n\nMARGARET\n\nI scarce can stand, my knees are trembling!\nI find a box, the first resembling,\nWithin my press! Of ebony,--\nAnd things, all splendid to behold,\nAnd richer far than were the old.\n\nMARTHA\n\nYou mustn't tell it to your mother!\n'Twould go to the priest, as did the other.\n\nMARGARET\n\nAh, look and see--just look and see!\n\nMARTHA (_adorning her_)\n\nO, what a blessed luck for thee!\n\nMARGARET\n\nBut, ah! in the streets I dare not bear them,\nNor in the church be seen to wear them.\n\nMARTHA\n\nYet thou canst often this way wander,\nAnd secretly the jewels don,\nWalk up and down an hour, before the mirror yonder,--\nWe'll have our private joy thereon.\nAnd then a chance will come, a holiday,\nWhen, piece by piece, can one the things abroad display,\nA chain at first, then other ornament:\nThy mother will not see, and stories we'll invent.\n\nMARGARET\n\nWhoever could have brought me things so precious?\nThat something's wrong, I feel suspicious.\n\n(_A knock_)\n\nGood Heaven! My mother can that have been?\n\nMARTHA (_peeping through the blind_)\n\n'Tis some strange gentleman.--Come in!\n\n(MEPHISTOPHELES _enters_.)\n\n\nMEPHISTOPHELES\n\nThat I so boldly introduce me,\nI beg you, ladies, to excuse me.\n\n(_Steps back reverently, on seeing_ MARGARET.)\n\nFor Martha Schwerdtlein I'd inquire!\n\n\nMARTHA\n\nI'm she: what does the gentleman desire?\n\n\nMEPHISTOPHELES (_aside to her_)\n\nIt is enough that you are she:\nYou've a visitor of high degree.\nPardon the freedom I have ta'en,--\nWill after noon return again.\n\n\nMARTHA (_aloud_)\n\nOf all things in the world! Just hear--\nHe takes thee for a lady, dear!\n\n\nMARGARET\n\nI am a creature young and poor:\nThe gentleman's too kind, I'm sure.\nThe jewels don't belong to me.\n\n\nMEPHISTOPHELES\n\nAh, not alone the jewelry!\nThe look, the manner, both betray--\nRejoiced am I that I may stay!\n\n\nMARTHA\n\nWhat is your business? I would fain--\n\nMEPHISTOPHELES\n\nI would I had a more cheerful strain!\nTake not unkindly its repeating:\nYour husband's dead, and sends a greeting.\n\n\nMARTHA\n\nIs dead? Alas, that heart so true!\nMy husband dead! Let me die, too!\n\n\nMARGARET\n\nAh, dearest dame, let not your courage fail!\n\n\nMEPHISTOPHELES\n\nHear me relate the mournful tale!\n\n\nMARGARET\n\nTherefore I'd never love, believe me!\nA loss like this to death would grieve me.\n\n\nMEPHISTOPHELES\n\nJoy follows woe, woe after joy comes flying.\n\n\nMARTHA\n\nRelate his life's sad close to me!\n\n\nMEPHISTOPHELES\n\nIn Padua buried, he is lying\nBeside the good Saint Antony,\nWithin a grave well consecrated,\nFor cool, eternal rest created.\n\n\nMARTHA\n\nHe gave you, further, no commission?\n\nMEPHISTOPHELES\n\nYes, one of weight, with many sighs:\nThree hundred masses buy, to save him from perdition!\nMy hands are empty, otherwise.\n\n\nMARTHA\n\nWhat! Not a pocket-piece? no jewelry?\nWhat every journeyman within his wallet spares,\nAnd as a token with him bears,\nAnd rather starves or begs, than loses?\n\n\nMEPHISTOPHELES\n\nMadam, it is a grief to me;\nYet, on my word, his cash was put to proper uses.\nBesides, his penitence was very sore,\nAnd he lamented his ill fortune all the more.\n\n\nMARGARET\n\nAlack, that men are so unfortunate!\nSurely for his soul's sake full many a prayer I'll proffer.\n\n\nMEPHISTOPHELES\n\nYou well deserve a speedy marriage-offer:\nYou are so kind, compassionate.\n\n\nMARGARET\n\nO, no! As yet, it would not do.\n\n\nMEPHISTOPHELES\n\nIf not a husband, then a beau for you!\nIt is the greatest heavenly blessing,\nTo have a dear thing for one's caressing.\n\n\nMARGARET\n\nThe country's custom is not so.\n\nMEPHISTOPHELES\n\nCustom, or not! It happens, though.\n\n\nMARTHA\n\nContinue, pray!\n\n\nMEPHISTOPHELES\n\n  I stood beside his bed of dying.\n'Twas something better than manure,--\nHalf-rotten straw: and yet, he died a Christian, sure,\nAnd found that heavier scores to his account were lying.\nHe cried: \"I find my conduct wholly hateful!\nTo leave my wife, my trade, in manner so ungrateful!\nAh, the remembrance makes me die!\nWould of my wrong to her I might be shriven!\"\n\n\nMARTHA (_weeping_)\n\nThe dear, good man! Long since was he forgiven.\n\n\nMEPHISTOPHELES\n\n\"Yet she, God knows! was more to blame than I.\"\n\n\nMARTHA\n\nHe lied! What! On the brink of death he slandered?\n\n\nMEPHISTOPHELES\n\nIn the last throes his senses wandered,\nIf I such things but half can judge.\nHe said: \"I had no time for play, for gaping freedom:\nFirst children, and then work for bread to feed 'em,--\nFor bread, in the widest sense, to drudge,\nAnd could not even eat my share in peace and quiet!\"\n\n\nMARTHA\n\nHad he all love, all faith forgotten in his riot?\nMy work and worry, day and night?\n\nMEPHISTOPHELES\n\nNot so: the memory of it touched him quite.\nSaid he: \"When I from Malta went away\nMy prayers for wife and little ones were zealous,\nAnd such a luck from Heaven befell us,\nWe made a Turkish merchantman our prey,\nThat to the Soldan bore a mighty treasure.\nThen I received, as was most fit,\nSince bravery was paid in fullest measure,\nMy well-apportioned share of it.\"\n\n\nMARTHA\n\nSay, how? Say, where? If buried, did he own it?\n\n\nMEPHISTOPHELES\n\nWho knows, now, whither the four winds have blown it?\nA fair young damsel took him in her care,\nAs he in Naples wandered round, unfriended;\nAnd she much love, much faith to him did bear,\nSo that he felt it till his days were ended.\n\n\nMARTHA\n\nThe villain! From his children thieving!\nEven all the misery on him cast\nCould not prevent his shameful way of living!\n\n\nMEPHISTOPHELES\n\nBut see! He's dead therefrom, at last.\nWere I in _your_ place, do not doubt me,\nI'd mourn him decently a year,\nAnd for another keep, meanwhile, my eyes about me.\n\n\nMARTHA\n\nAh, God! another one so dear\nAs was my first, this world will hardly give me.\nThere never was a sweeter fool than mine,\nOnly he loved to roam and leave me,\nAnd foreign wenches and foreign wine,\nAnd the damned throw of dice, indeed.\n\n\nMEPHISTOPHELES\n\nWell, well! That might have done, however,\nIf he had only been as clever,\nAnd treated _your_ slips with as little heed.\nI swear, with this condition, too,\nI would, myself, change rings with you.\n\n\nMARTHA\n\nThe gentleman is pleased to jest.\n\n\nMEPHISTOPHELES\n\nI'll cut away, betimes, from here:\nShe'd take the Devil at his word, I fear.\n\n(_To_ MARGARET)\n\nHow fares the heart within your breast?\n\n\nMARGARET\n\nWhat means the gentleman?\n\n\nMEPHISTOPHELES (_aside_)\n\n  Sweet innocent, thou art!\n\n(_Aloud_.)\n\n Ladies, farewell!\n\n\nMARGARET\n\nFarewell!\n\n\nMARTHA\n\n                  A moment, ere we part!\nI'd like to have a legal witness,\nWhere, how, and when he died, to certify his fitness.\nIrregular ways I've always hated;\nI want his death in the weekly paper stated.\n\n\nMEPHISTOPHELES\n\nYes, my good dame, a pair of witnesses\nAlways the truth establishes.\nI have a friend of high condition,\nWho'll also add his deposition.\nI'll bring him here.\n\n\nMARTHA\n\n                  Good Sir, pray do!\n\n\nMEPHISTOPHELES\n\nAnd this young lady will be present, too?\nA gallant youth! has travelled far:\nLadies with him delighted are.\n\n\nMARGARET\n\nBefore him I should blush, ashamed.\n\n\nMEPHISTOPHELES\n\nBefore no king that could be named!\n\n\nMARTHA\n\nBehind the house, in my garden, then,\nThis eve we'll expect the gentlemen.\n\n[Illustration]\n\n\n\n\nXI\n\n\nA STREET\n\nFAUST MEPHISTOPHELES\n\nFAUST\n\nHow is it? under way? and soon complete?\n\nMEPHISTOPHELES\n\nAh, bravo! Do I find you burning?\nWell, Margaret soon will still your yearning:\nAt Neighbor Martha's you'll this evening meet.\nA fitter woman ne'er was made\nTo ply the pimp and gypsy trade!\n\nFAUST\n\nTis well.\n\nMEPHISTOPHELES\n\nYet something is required from us.\n\nFAUST\n\nOne service pays the other thus.\n\nMEPHISTOPHELES\n\nWe've but to make a deposition valid\nThat now her husband's limbs, outstretched and pallid,\nAt Padua rest, in consecrated soil.\n\nFAUST\n\nMost wise! And first, of course, we'll make the journey\n  thither?\n\nMEPHISTOPHELES\n\n_Sancta simplicitas_! no need of such a toil;\nDepose, with knowledge or without it, either!\n\nFAUST\n\nIf you've naught better, then, I'll tear your pretty plan!\n\nMEPHISTOPHELES\n\nNow, there you are! O holy man!\nIs it the first time in your life you're driven\nTo bear false witness in a case?\nOf God, the world and all that in it has a place,\nOf Man, and all that moves the being of his race,\nHave you not terms and definitions given\nWith brazen forehead, daring breast?\nAnd, if you'll probe the thing profoundly,\nKnew you so much--and you'll confess it roundly!--\nAs here of Schwerdtlein's death and place of rest?\n\nFAUST\n\nThou art, and thou remain'st, a sophist, liar.\n\nMEPHISTOPHELES\n\nYes, knew I not more deeply thy desire.\nFor wilt thou not, no lover fairer,\nPoor Margaret flatter, and ensnare her,\nAnd all thy soul's devotion swear her?\n\nFAUST\n\nAnd from my heart.\n\nMEPHISTOPHELES\n\n  'Tis very fine!\nThine endless love, thy faith assuring,\nThe one almighty force enduring,--\nWill that, too, prompt this heart of thine?\n\nFAUST\n\nHold! hold! It will!--If such my flame,\nAnd for the sense and power intense\nI seek, and cannot find, a name;\nThen range with all my senses through creation,\nCraving the speech of inspiration,\nAnd call this ardor, so supernal,\nEndless, eternal and eternal,--\nIs that a devilish lying game?\n\nMEPHISTOPHELES\n\nAnd yet I'm right!\n\nFAUST\n\n  Mark this, I beg of thee!\nAnd spare my lungs henceforth: whoever\nIntends to have the right, if but his\n  tongue be clever,\nWill have it, certainly.\nBut come: the further talking brings\n  disgust,\nFor thou art right, especially since I\n  must.\n\n[Illustration]\n\n[Illustration]\n\n\n\n\nXII\n\n\nGARDEN\n\n(MARGARET _on_ FAUST'S _arm_. MARTHA _and_ MEPHISTOPHELES\n_walking up and down_.)\n\nMARGARET\n\nI feel, the gentleman allows for me,\nDemeans himself, and shames me by it;\nA traveller is so used to be\nKindly content with any diet.\nI know too well that my poor gossip can\nNe'er entertain such an experienced man.\n\nFAUST\n\nA look from thee, a word, more entertains\nThan all the lore of wisest brains.\n\n(_He kisses her hand_.)\n\nMARGARET\n\nDon't incommode yourself! How could you ever kiss it!\nIt is so ugly, rough to see!\nWhat work I do,--how hard and steady is it!\nMother is much too close with me.\n\n[_They pass_.\n\nMARTHA\n\nAnd you, Sir, travel always, do you not?\n\nMEPHISTOPHELES\n\nAlas, that trade and duty us so harry!\nWith what a pang one leaves so many a spot,\nAnd dares not even now and then to tarry!\n\nMARTHA\n\nIn young, wild years it suits your ways,\nThis round and round the world in freedom sweeping;\nBut then come on the evil days,\nAnd so, as bachelor, into his grave a-creeping,\nNone ever found a thing to praise.\n\nMEPHISTOPHELES\n\nI dread to see how such a fate advances.\n\nMARTHA\n\nThen, worthy Sir, improve betimes your chances!\n\n[_They pass_.\n\nMARGARET\n\nYes, out of sight is out of mind!\nYour courtesy an easy grace is;\nBut you have friends in other places,\nAnd sensibler than I, you'll find.\n\nFAUST\n\nTrust me, dear heart! what men call sensible\nIs oft mere vanity and narrowness.\n\nMARGARET\n\n  How so?\n\nFAUST\n\nAh, that simplicity and innocence ne'er know\nThemselves, their holy value, and their spell!\nThat meekness, lowliness, the highest graces\nWhich Nature portions out so lovingly--\n\nMARGARET\n\nSo you but think a moment's space on me,\nAll times I'll have to think on you, all places!\n\nFAUST\n\nNo doubt you're much alone?\n\nMARGARET\n\nYes, for our household small has grown,\nYet must be cared for, you will own.\nWe have no maid: I do the knitting, sewing, sweeping,\nThe cooking, early work and late, in fact;\nAnd mother, in her notions of housekeeping,\nIs so exact!\nNot that she needs so much to keep expenses down:\nWe, more than others, might take comfort, rather:\nA nice estate was left us by my father,\nA house, a little garden near the town.\nBut now my days have less of noise and hurry;\nMy brother is a soldier,\nMy little sister's dead.\nTrue, with the child a troubled life I led,\nYet I would take again, and willing, all the worry,\nSo very dear was she.\n\nFAUST\n\nAn angel, if like thee!\n\nMARGARET\n\nI brought it up, and it was fond of me.\nFather had died before it saw the light,\nAnd mother's case seemed hopeless quite,\nSo weak and miserable she lay;\nAnd she recovered, then, so slowly, day by day.\nShe could not think, herself, of giving\nThe poor wee thing its natural living;\nAnd so I nursed it all alone\nWith milk and water: 'twas my own.\nLulled in my lap with many a song,\nIt smiled, and tumbled, and grew strong.\n\nFAUST\n\nThe purest bliss was surely then thy dower.\n\nMARGARET\n\nBut surely, also, many a weary hour.\nI kept the baby's cradle near\nMy bed at night: if 't even stirred, I'd guess it,\nAnd waking, hear.\nAnd I must nurse it, warm beside me press it,\nAnd oft, to quiet it, my bed forsake,\nAnd dandling back and forth the restless creature take,\nThen at the wash-tub stand, at morning's break;\nAnd then the marketing and kitchen-tending,\nDay after day, the same thing, never-ending.\nOne's spirits, Sir, are thus not always good,\nBut then one learns to relish rest and food.\n\n[_They pass_.\n\nMARTHA\n\nYes, the poor women are bad off, 'tis true:\nA stubborn bachelor there's no converting.\n\nMEPHISTOPHELES\n\nIt but depends upon the like of you,\nAnd I should turn to better ways than flirting.\n\nMARTHA\n\nSpeak plainly, Sir, have you no one detected?\nHas not your heart been anywhere subjected?\n\nMEPHISTOPHELES\n\nThe proverb says: One's own warm hearth\nAnd a good wife, are gold and jewels worth.\n\nMARTHA\n\nI mean, have you not felt desire, though ne'er so slightly?\n\nMEPHISTOPHELES\n\nI've everywhere, in fact, been entertained politely.\n\nMARTHA\n\nI meant to say, were you not touched in earnest, ever?\n\nMEPHISTOPHELES\n\nOne should allow one's self to jest with ladies never.\n\n\nMARTHA\nAh, you don't understand!\n\nMEPHISTOPHELES\n\nI'm sorry I'm so blind:\nBut I am sure--that you are very kind.\n\n[_They pass_.\n\nFAUST\n\nAnd me, thou angel! didst thou recognize,\nAs through the garden-gate I came?\n\nMARGARET\n\nDid you not see it? I cast down my eyes.\n\nFAUST\n\nAnd thou forgiv'st my freedom, and the blame\nTo my impertinence befitting,\nAs the Cathedral thou wert quitting?\n\nMARGARET\n\nI was confused, the like ne'er happened me;\nNo one could ever speak to my discredit.\nAh, thought I, in my conduct has he read it--\nSomething immodest or unseemly free?\nHe seemed to have the sudden feeling\nThat with this wench 'twere very easy dealing.\nI will confess, I knew not what appeal\nOn your behalf, here, in my bosom grew;\nBut I was angry with myself, to feel\nThat I could not be angrier with you.\n\n\nFAUST\n\nSweet darling!\n\nMARGARET\n\nWait a while!\n\n(_She plucks a star-flower, and pulls off the leaves, one after\nthe other_.)\n\nFAUST\n\nShall that a nosegay be?\n\nMARGARET\n\nNo, it is just in play.\n\nFAUST\n\nHow?\n\nMARGARET\n\nGo! you'll laugh at me.\n(_She pulls off the leaves and murmurs_.)\n\nFAUST\n\nWhat murmurest thou?\n\nMARGARET (_half aloud_)\n\nHe loves me--loves me not.\n\nFAUST\n\nThou sweet, angelic soul!\n\nMARGARET (_continues_)\n\nLoves me--not--loves me--not--\n(_plucking the last leaf, she cries with frank delight_:)\n\nHe loves me!\n\nFAUST\n\nYes, child! and let this blossom-word\nFor thee be speech divine! He loves thee!\nAh, know'st thou what it means? He loves thee!\n\n(_He grasps both her hands_.)\n\nMARGARET\n\nI'm all a-tremble!\n\nFAUST\n\nO tremble not! but let this look,\nLet this warm clasp of hands declare thee\nWhat is unspeakable!\nTo yield one wholly, and to feel a rapture\nIn yielding, that must be eternal!\nEternal!--for the end would be despair.\nNo, no,--no ending! no ending!\n\nMARTHA (_coming forward_)\n\nThe night is falling.\n\nMEPHISTOPHELES\n\n                    Ay! we must away.\n\nMARTHA\n\nI'd ask you, longer here to tarry,\nBut evil tongues in this town have full play.\nIt's as if nobody had nothing to fetch and carry,\nNor other labor,\nBut spying all the doings of one's neighbor:\nAnd one becomes the talk, do whatsoe'er one may.\nWhere is our couple now?\n\nMEPHISTOPHELES\n\n                 Flown up the alley yonder,\nThe wilful summer-birds!\n\nMARTHA\n\n                 He seems of her still fonder.\n\nMEPHISTOPHELES\n\nAnd she of him. So runs the world away!\n\n[Illustration]\n\n[Illustration]\n\n\n\n\nXIII\n\n\nA GARDEN-ARBOR\n\n(MARGARET _comes in, conceals herself behind the door, puts her\nfinger to her lips, and peeps through the crack_.)\n\nMARGARET\n\nHe comes!\n\nFAUST (_entering_)\n\n                  Ah, rogue! a tease thou art:\nI have thee!\n(_He kisses her_.)\n\nMARGARET\n\n(_clasping him, and returning the kiss_)\n             Dearest man! I love thee from my heart.\n\n(MEPHISTOPHELES _knocks_)\n\nFAUST (_stamping his foot_)\n\nWho's there?\n\nMEPHISTOPHELES\n\nA friend!\n\nFAUST\n\n              A beast!\n\nMEPHISTOPHELES\n\n             Tis time to separate.\n\nMARTHA (_coming_)\n\nYes, Sir, 'tis late.\n\nFAUST\n\n            May I not, then, upon you wait?\n\nMARGARET\nMy mother would--farewell!\n\nFAUST\n\n            Ah, can I not remain?\nFarewell!\n\nMARTHA\n\n          Adieu!\n\nMARGARET\n\n             And soon to meet again!\n\n[_Exeunt_ FAUST _and_ MEPHISTOPHELES.\n\nMARGARET\n\nDear God! However is it, such\nA man can think and know so much?\nI stand ashamed and in amaze,\nAnd answer \"Yes\" to all he says,\nA poor, unknowing child! and he--\nI can't think what he finds in me! [_Exit_.\n\n[Illustration]\n\n\n\n\nXIV\n\n\nFOREST AND CAVERN\n\nFAUST (_solus_)\n\nSpirit sublime, thou gav'st me, gav'st me all\nFor which I prayed. Not unto me in vain\nHast thou thy countenance revealed in fire.\nThou gav'st me Nature as a kingdom grand,\nWith power to feel and to enjoy it. Thou\nNot only cold, amazed acquaintance yield'st,\nBut grantest, that in her profoundest breast\nI gaze, as in the bosom of a friend.\nThe ranks of living creatures thou dost lead\nBefore me, teaching me to know my brothers\nIn air and water and the silent wood.\nAnd when the storm in forests roars and grinds,\nThe giant firs, in falling, neighbor boughs\nAnd neighbor trunks with crushing weight bear down,\nAnd falling, fill the hills with hollow thunders,--\nThen to the cave secure thou leadest me,\nThen show'st me mine own self, and in my breast\nThe deep, mysterious miracles unfold.\nAnd when the perfect moon before my gaze\nComes up with soothing light, around me float\nFrom every precipice and thicket damp\nThe silvery phantoms of the ages past,\nAnd temper the austere delight of thought.\n\nThat nothing can be perfect unto Man\nI now am conscious. With this ecstasy,\nWhich brings me near and nearer to the Gods,\nThou gav'st the comrade, whom I now no more\nCan do without, though, cold and scornful, he\nDemeans me to myself, and with a breath,\nA word, transforms thy gifts to nothingness.\nWithin my breast he fans a lawless fire,\nUnwearied, for that fair and lovely form:\nThus in desire I hasten to enjoyment,\nAnd in enjoyment pine to feel desire.\n\n(MEPHISTOPHELES _enters_.)\n\nMEPHISTOPHELES\n\nHave you not led this life quite long enough?\nHow can a further test delight you?\n'Tis very well, that once one tries the stuff,\nBut something new must then requite you.\n\nFAUST\n\nWould there were other work for thee!\nTo plague my day auspicious thou returnest.\n\nMEPHISTOPHELES\n\nWell! I'll engage to let thee be:\nThou darest not tell me so in earnest.\nThe loss of thee were truly very slight,--\ncomrade crazy, rude, repelling:\n\n[Illustration]\n\nOne has one's hands full all the day and night;\nIf what one does, or leaves undone, is right,\nFrom such a face as thine there is no telling.\n\nFAUST\n\nThere is, again, thy proper tone!--\nThat thou hast bored me, I must thankful be!\n\nMEPHISTOPHELES\n\nPoor Son of Earth, how couldst thou thus alone\nHave led thy life, bereft of me?\nI, for a time, at least, have worked thy cure;\nThy fancy's rickets plague thee not at all:\nHad I not been, so hadst thou, sure,\nWalked thyself off this earthly ball\nWhy here to caverns, rocky hollows slinking,\nSit'st thou, as 'twere an owl a-blinking?\nWhy suck'st, from sodden moss and dripping stone,\nToad-like, thy nourishment alone?\nA fine way, this, thy time to fill!\nThe Doctor's in thy body still.\n\nFAUST\n\nWhat fresh and vital forces, canst thou guess,\nSpring from my commerce with the wilderness?\nBut, if thou hadst the power of guessing,\nThou wouldst be devil enough to grudge my soul the blessing.\n\nMEPHISTOPHELES\n\nA blessing drawn from supernatural fountains!\nIn night and dew to lie upon the mountains;\nAll Heaven and Earth in rapture penetrating;\nThyself to Godhood haughtily inflating;\nTo grub with yearning force through Earth's dark marrow,\nCompress the six days' work within thy bosom narrow,--\nTo taste, I know not what, in haughty power,\nThine own ecstatic life on all things shower,\nThine earthly self behind thee cast,\nAnd then the lofty instinct, thus--\n\n(_With a gesture_:)\n\nat last,--\ndaren't say how--to pluck the final flower!\n\nFAUST\n\nShame on thee!\n\nMEPHISTOPHELES\n\nYes, thou findest that unpleasant!\nThou hast the moral right to cry me \"shame!\" at present.\nOne dares not that before chaste ears declare,\nWhich chaste hearts, notwithstanding, cannot spare;\nAnd, once for all, I grudge thee not the pleasure\nOf lying to thyself in moderate measure.\nBut such a course thou wilt not long endure;\nAlready art thou o'er-excited,\nAnd, if it last, wilt soon be plighted\nTo madness and to horror, sure.\nEnough of that! Thy love sits lonely yonder,\nBy all things saddened and oppressed;\nHer thoughts and yearnings seek thee, tenderer, fonder,--\nmighty love is in her breast.\nFirst came thy passion's flood and poured around her\nAs when from melted snow a streamlet overflows;\nThou hast therewith so filled and drowned her,\nThat now _thy_ stream all shallow shows.\nMethinks, instead of in the forests lording,\nThe noble Sir should find it good,\nThe love of this young silly blood\nAt once to set about rewarding.\nHer time is miserably long;\nShe haunts her window, watching clouds that stray\nO'er the old city-wall, and far away.\n\"Were I a little bird!\" so runs her song,\nDay long, and half night long.\nNow she is lively, mostly sad,\nNow, wept beyond her tears;\nThen again quiet she appears,--Always\nlove-mad.\n\nFAUST\n\nSerpent! Serpent!\n\nMEPHISTOPHELES _(aside)_\n\nHa! do I trap thee!\n\nFAUST\n\nGet thee away with thine offences,\nReprobate! Name not that fairest thing,\nNor the desire for her sweet body bring\nAgain before my half-distracted senses!\n\nMEPHISTOPHELES\n\nWhat wouldst thou, then? She thinks that thou art flown;\nAnd half and half thou art, I own.\n\nFAUST\n\nYet am I near, and love keeps watch and ward;\nThough I were ne'er so far, it cannot falter:\nI envy even the Body of the Lord\nThe touching of her lips, before the altar.\n\nMEPHISTOPHELES\n\n'Tis very well! _My_ envy oft reposes\nOn your twin-pair, that feed among the roses.\n\nFAUST\n\nAway, thou pimp!\n\nMEPHISTOPHELES\n\nYou rail, and it is fun to me.\nThe God, who fashioned youth and maid,\nPerceived the noblest purpose of His trade,\nAnd also made their opportunity.\nGo on! It is a woe profound!\n'Tis for your sweetheart's room you're bound,\nAnd not for death, indeed.\n\nFAUST\n\nWhat are, within her arms, the heavenly blisses?\nThough I be glowing with her kisses,\nDo I not always share her need?\nI am the fugitive, all houseless roaming,\nThe monster without air or rest,\nThat like a cataract, down rocks and gorges foaming,\nLeaps, maddened, into the abyss's breast!\nAnd side-wards she, with young unwakened senses,\nWithin her cabin on the Alpine field\nHer simple, homely life commences,\nHer little world therein concealed.\nAnd I, God's hate flung o'er me,\nHad not enough, to thrust\nThe stubborn rocks before me\nAnd strike them into dust!\nShe and her peace I yet must undermine:\nThou, Hell, hast claimed this sacrifice as thine!\nHelp, Devil! through the coming pangs to push me;\nWhat must be, let it quickly be!\nLet fall on me her fate, and also crush me,--\nOne ruin whelm both her and me!\n\nMEPHISTOPHELES\n\nAgain it seethes, again it glows!\nThou fool, go in and comfort her!\nWhen such a head as thine no outlet knows,\nIt thinks the end must soon occur.\nHail him, who keeps a steadfast mind!\nThou, else, dost well the devil-nature wear:\nNaught so insipid in the world I find\nAs is a devil in despair.\n\n[Illustration]\n\n[Illustration]\n\n\n\n\nXV\n\n\nMARGARET'S ROOM\n\nMARGARET\n\n(_at the spinning-wheel, alone_)\n\n        My peace is gone,\n        My heart is sore:\n        I never shall find it,\n        Ah, nevermore!\n\n        Save I have him near.\n        The grave is here;\n        The world is gall\n        And bitterness all.\n\n        My poor weak head\n        Is racked and crazed;\n        My thought is lost,\n        My senses mazed.\n\n        My peace is gone,\n        My heart is sore:\n        I never shall find it,\n        Ah, nevermore!\n\n        To see him, him only,\n        At the pane I sit;\n        To meet him, him only,\n        The house I quit.\n\n        His lofty gait,\n        His noble size,\n        The smile of his mouth,\n        The power of his eyes,\n\n        And the magic flow\n        Of his talk, the bliss\n        In the clasp of his hand,\n        And, ah! his kiss!\n\n        My peace is gone,\n        My heart is sore:\n        I never shall find it,\n        Ah, nevermore!\n\n        My bosom yearns\n        For him alone;\n        Ah, dared I clasp him,\n        And hold, and own!\n\n        And kiss his mouth,\n        To heart's desire,\n        And on his kisses\n        At last expire!\n\n[Illustration]\n\n\n\n\nXVI\n\n\nMARTHA'S GARDEN\n\nMARGARET FAUST\n\nMARGARET\n\nPromise me, Henry!--\n\nFAUST\n\nWhat I can!\n\nMARGARET\n\nHow is't with thy religion, pray?\nThou art a dear, good-hearted man,\nAnd yet, I think, dost not incline that way.\n\nFAUST\n\nLeave that, my child! Thou know'st my love is tender;\nFor love, my blood and life would I surrender,\nAnd as for Faith and Church, I grant to each his own.\n\nMARGARET\n\nThat's not enough: we must believe thereon.\n\nFAUST\n\nMust we?\n\nMARGARET\n\nWould that I had some influence!\nThen, too, thou honorest not the Holy Sacraments.\n\nFAUST\n\nI honor them.\n\nMARGARET\n\nDesiring no possession\n'Tis long since thou hast been to mass or to confession.\nBelievest thou in God?\n\nFAUST\n\nMy darling, who shall dare\n\"I believe in God!\" to say?\nAsk priest or sage the answer to declare,\nAnd it will seem a mocking play,\nA sarcasm on the asker.\n\nMARGARET\n\nThen thou believest not!\n\nFAUST\n\nHear me not falsely, sweetest countenance!\nWho dare express Him?\nAnd who profess Him,\nSaying: I believe in Him!\nWho, feeling, seeing,\nDeny His being,\nSaying: I believe Him not!\nThe All-enfolding,\nThe All-upholding,\nFolds and upholds he not\nThee, me, Himself?\nArches not there the sky above us?\nLies not beneath us, firm, the earth?\nAnd rise not, on us shining,\nFriendly, the everlasting stars?\nLook I not, eye to eye, on thee,\nAnd feel'st not, thronging\nTo head and heart, the force,\nStill weaving its eternal secret,\nInvisible, visible, round thy life?\nVast as it is, fill with that force thy heart,\nAnd when thou in the feeling wholly blessed art,\nCall it, then, what thou wilt,--\nCall it Bliss! Heart! Love! God!\nI have no name to give it!\nFeeling is all in all:\nThe Name is sound and smoke,\nObscuring Heaven's clear glow.\n\nMARGARET\n\nAll that is fine and good, to hear it so:\nMuch the same way the preacher spoke,\nOnly with slightly different phrases.\n\nFAUST\n\nThe same thing, in all places,\nAll hearts that beat beneath the heavenly day--\nEach in its language--say;\nThen why not I, in mine, as well?\n\nMARGARET\n\nTo hear it thus, it may seem passable;\nAnd yet, some hitch in't there must be\nFor thou hast no Christianity.\n\nFAUST\n\nDear love!\n\nMARGARET\n\n                  I've long been grieved to see\nThat thou art in such company.\n\nFAUST\n\nHow so?\n\nMARGARET\n\n        The man who with thee goes, thy mate,\nWithin my deepest, inmost soul I hate.\nIn all my life there's nothing\nHas given my heart so keen a pang of loathing,\nAs his repulsive face has done.\n\nFAUST\n\nNay, fear him not, my sweetest one!\n\nMARGARET\n\nI feel his presence like something ill.\nI've else, for all, a kindly will,\nBut, much as my heart to see thee yearneth,\nThe secret horror of him returneth;\nAnd I think the man a knave, as I live!\nIf I do him wrong, may God forgive!\n\nFAUST\n\nThere must be such queer birds, however.\n\nMARGARET\n\nLive with the like of him, may I never!\nWhen once inside the door comes he,\nHe looks around so sneeringly,\nAnd half in wrath:\nOne sees that in nothing no interest he hath:\n'Tis written on his very forehead\nThat love, to him, is a thing abhorred.\nI am so happy on thine arm,\nSo free, so yielding, and so warm,\nAnd in his presence stifled seems my heart.\n\nFAUST\n\nForeboding angel that thou art!\n\nMARGARET\n\nIt overcomes me in such degree,\nThat wheresoe'er he meets us, even,\nI feel as though I'd lost my love for thee.\nWhen he is by, I could not pray to Heaven.\nThat burns within me like a flame,\nAnd surely, Henry, 'tis with thee the same.\n\nFAUST\n\nThere, now, is thine antipathy!\n\nMARGARET\n\nBut I must go.\n\nFAUST\n\n                Ah, shall there never be\nA quiet hour, to see us fondly plighted,\nWith breast to breast, and soul to soul united?\n\nMARGARET\n\nAh, if I only slept alone!\nI'd draw the bolts to-night, for thy desire;\nBut mother's sleep so light has grown,\nAnd if we were discovered by her,\n'Twould be my death upon the spot!\n\nFAUST\n\nThou angel, fear it not!\nHere is a phial: in her drink\nBut three drops of it measure,\nAnd deepest sleep will on her senses sink.\n\nMARGARET\n\nWhat would I not, to give thee pleasure?\nIt will not harm her, when one tries it?\n\nFAUST\n\nIf 'twould, my love, would I advise it?\n\nMARGARET\n\nAh, dearest man, if but thy face I see,\nI know not what compels me to thy will:\nSo much have I already done for thee,\nThat scarcely more is left me to fulfil.\n\n(_Enter_ MEPHISTOPHELES.) [_Exit_.\n\nMEPHISTOPHELES\n\nThe monkey! Is she gone?\n\nFAUST\n\n                          Hast played the spy again?\n\nMEPHISTOPHELES\n\nI've heard, most fully, how she drew thee.\nThe Doctor has been catechised, 'tis plain;\nGreat good, I hope, the thing will do thee.\nThe girls have much desire to ascertain\nIf one is prim and good, as ancient rules compel:\nIf there he's led, they think, he'll follow them as well.\n\nFAUST\n\nThou, monster, wilt nor see nor own\nHow this pure soul, of faith so lowly,\nSo loving and ineffable,--\nThe faith alone\nThat her salvation is,--with scruples holy\nPines, lest she hold as lost the man she loves so well!\n\nMEPHISTOPHELES\n\nThou, full of sensual, super-sensual desire,\nA girl by the nose is leading thee.\n\nFAUST\n\nAbortion, thou, of filth and fire!\n\nMEPHISTOPHELES\n\nAnd then, how masterly she reads physiognomy!\nWhen I am present she's impressed, she knows not how;\nShe in my mask a hidden sense would read:\nShe feels that surely I'm a genius now,--\nPerhaps the very Devil, indeed!\nWell, well,--to-night--?\n\nFAUST\n\n                          What's that to thee?\n\nMEPHISTOPHELES\n\nYet my delight 'twill also be!\n\n[Illustration]\n\n[Illustration]\n\n\n\n\nXVII\n\n\nAT THE FOUNTAIN\n\nMARGARET _and_ LISBETH _With pitchers_.\n\nLISBETH\n\nHast nothing heard of Barbara?\n\nMARGARET\n\nNo, not a word. I go so little out.\n\nLISBETH\n\nIt's true, Sibylla said, to-day.\nShe's played the fool at last, there's not a doubt.\nSuch taking-on of airs!\n\nMARGARET\n\n                        How so?\n\nLISBETH\n\n                                 It stinks!\nShe's feeding two, whene'er she eats and drinks.\n\nMARGARET\n\nAh!\n\nLISBETH\n\n    And so, at last, it serves her rightly.\nShe clung to the fellow so long and tightly!\nThat was a promenading!\nAt village and dance parading!\nAs the first they must everywhere shine,\nAnd he treated her always to pies and wine,\nAnd she made a to-do with her face so fine;\nSo mean and shameless was her behavior,\nShe took all the presents the fellow gave her.\n'Twas kissing and coddling, on and on!\nSo now, at the end, the flower is gone.\n\nMARGARET\n\nThe poor, poor thing!\n\nLISBETH\n\n                      Dost pity her, at that?\nWhen one of us at spinning sat,\nAnd mother, nights, ne'er let us out the door\nShe sported with her paramour.\nOn the door-bench, in the passage dark,\nThe length of the time they'd never mark.\nSo now her head no more she'll lift,\nBut do church-penance in her sinner's shift!\n\nMARGARET\n\nHe'll surely take her for his wife.\n\nLISBETH\n\nHe'd be a fool! A brisk young blade\nHas room, elsewhere, to ply his trade.\nBesides, he's gone.\n\nMARGARET\n\n                   That is not fair!\n\nLISBETH\n\nIf him she gets, why let her beware!\nThe boys shall dash her wreath on the floor,\nAnd we'll scatter chaff before her door!\n                                              [_Exit_.\n\nMARGARET (_returning home_)\n\nHow scornfully I once reviled,\nWhen some poor maiden was beguiled!\nMore speech than any tongue suffices\nI craved, to censure others' vices.\nBlack as it seemed, I blackened still,\nAnd blacker yet was in my will;\nAnd blessed myself, and boasted high,--\nAnd now--a living sin am I!\nYet--all that drove my heart thereto,\nGod! was so good, so dear, so true!\n\n[Illustration]\n\n[Illustration]\n\n\n\n\nXVIII\n\n\nDONJON\n\n(_In a niche of the wall a shrine, with an image of the Mater\nDolorosa. Pots of flowers before it_.)\n\nMARGARET\n\n(_putting fresh flowers in the pots_)\n\n        Incline, O Maiden,\n        Thou sorrow-laden,\n        Thy gracious countenance upon my pain!\n\n        The sword Thy heart in,\n        With anguish smarting,\n        Thou lookest up to where Thy Son is slain!\n\n        Thou seest the Father;\n        Thy sad sighs gather,\n        And bear aloft Thy sorrow and His pain!\n\n        Ah, past guessing,\n        Beyond expressing,\n        The pangs that wring my flesh and bone!\n        Why this anxious heart so burneth,\n        Why it trembleth, why it yearneth,\n        Knowest Thou, and Thou alone!\n\n        Where'er I go, what sorrow,\n        What woe, what woe and sorrow\n        Within my bosom aches!\n        Alone, and ah! unsleeping,\n        I'm weeping, weeping, weeping,\n        The heart within me breaks.\n\n        The pots before my window,\n        Alas! my tears did wet,\n        As in the early morning\n        For thee these flowers I set.\n\n        Within my lonely chamber\n        The morning sun shone red:\n        I sat, in utter sorrow,\n        Already on my bed.\n\n        Help! rescue me from death and stain!\n        O Maiden!\n        Thou sorrow-laden,\n        Incline Thy countenance upon my pain!\n\n[Illustration]\n\n[Illustration]\n\n\n\n\nXIX\n\n\nNIGHT\n\nSTREET BEFORE MARGARET'S DOOR\n\nVALENTINE (_a soldier_, MARGARET'S _brother_)\n\nWhen I have sat at some carouse.\nWhere each to each his brag allows,\nAnd many a comrade praised to me\nHis pink of girls right lustily,\nWith brimming glass that spilled the toast,\nAnd elbows planted as in boast:\nI sat in unconcerned repose,\nAnd heard the swagger as it rose.\nAnd stroking then my beard, I'd say,\nSmiling, the bumper in my hand:\n\"Each well enough in her own way.\nBut is there one in all the land\nLike sister Margaret, good as gold,--\nOne that to her can a candle hold?\"\nCling! clang! \"Here's to her!\" went around\nThe board: \"He speaks the truth!\" cried some;\n\"In her the flower o' the sex is found!\"\nAnd all the swaggerers were dumb.\nAnd now!--I could tear my hair with vexation.\nAnd dash out my brains in desperation!\nWith turned-up nose each scamp may face me,\nWith sneers and stinging taunts disgrace me,\nAnd, like a bankrupt debtor sitting,\nA chance-dropped word may set me sweating!\nYet, though I thresh them all together,\nI cannot call them liars, either.\n\nBut what comes sneaking, there, to view?\nIf I mistake not, there are two.\nIf _he's_ one, let me at him drive!\nHe shall not leave the spot alive.\n\nFAUST MEPHISTOPHELES\n\nFAUST\n\nHow from the window of the sacristy\nUpward th'eternal lamp sends forth a glimmer,\nThat, lessening side-wards, fainter grows and dimmer,\nTill darkness closes from the sky!\nThe shadows thus within my bosom gather.\n\nMEPHISTOPHELES\n\nI'm like a sentimental tom-cat, rather,\nThat round the tall fire-ladders sweeps,\nAnd stealthy, then, along the coping creeps:\nQuite virtuous, withal, I come,\nA little thievish and a little frolicsome.\nI feel in every limb the presage\nForerunning the grand Walpurgis-Night:\nDay after to-morrow brings its message,\nAnd one keeps watch then with delight.\n\nFAUST\n\nMeanwhile, may not the treasure risen be,\nWhich there, behind, I glimmering see?\n\nMEPHISTOPHELES\n\nShalt soon experience the pleasure,\nTo lift the kettle with its treasure.\nI lately gave therein a squint--\nSaw splendid lion-dollars in 't.\n\nFAUST\n\nNot even a jewel, not a ring,\nTo deck therewith my darling girl?\n\nMEPHISTOPHELES\n\nI saw, among the rest, a thing\nThat seemed to be a chain of pearl.\n\nFAUST\n\nThat's well, indeed! For painful is it\nTo bring no gift when her I visit.\n\nMEPHISTOPHELES\n\nThou shouldst not find it so annoying,\nWithout return to be enjoying.\nNow, while the sky leads forth its starry throng,\nThou'lt hear a masterpiece, no work completer:\nI'll sing her, first, a moral song,\nThe surer, afterwards, to cheat her.\n\n(_Sings to the cither_.)\n\n        What dost thou here\n        In daybreak clear,\n        Kathrina dear,\n        Before thy lover's door?\n        Beware! the blade\n        Lets in a maid.\n        That out a maid\n        Departeth nevermore!\n\n        The coaxing shun\n        Of such an one!\n        When once 'tis done\n        Good-night to thee, poor thing!\n        Love's time is brief:\n        Unto no thief\n        Be warm and lief,\n        But with the wedding-ring!\n\nVALENTINE (_comes forward_)\n\nWhom wilt thou lure? God's-element!\nRat-catching piper, thou!--perdition!\nTo the Devil, first, the instrument!\nTo the Devil, then, the curst musician!\n\nMEPHISTOPHELES\n\nThe cither's smashed! For nothing more 'tis fitting.\n\nVALENTINE\n\nThere's yet a skull I must be splitting!\n\nMEPHISTOPHELES (_to_ FAUST)\n\nSir Doctor, don't retreat, I pray!\nStand by: I'll lead, if you'll but tarry:\nOut with your spit, without delay!\nYou've but to lunge, and I will parry.\n\nVALENTINE\n\nThen parry that!\n\nMEPHISTOPHELES\n\n                 Why not? 'tis light.\nVALENTINE\n\nThat, too!\n\nMEPHISTOPHELES\n\nOf course.\n\nVALENTINE\n\nI think the Devil must fight!\nHow is it, then? my hand's already lame:\n\nMEPHISTOPHELES (_to_ FAUST)\n\nThrust home!\n\nVALENTINE (_jails_)\n\nO God!\n\nMEPHISTOPHELES\n\nNow is the lubber tame!\nBut come, away! 'Tis time for us to fly;\nFor there arises now a murderous cry.\nWith the police 'twere easy to compound it,\nBut here the penal court will sift and sound it.\n\n[_Exit with_ FAUST.\n\nMARTHA (_at the window_)\n\nCome out! Come out!\n\nMARGARET (_at the window_)\n\nQuick, bring a light!\n\nMARTHA (_as above_)\n\nThey swear and storm, they yell and fight!\n\nPEOPLE\n\nHere lies one dead already--see!\n\nMARTHA (_coming from the house_)\n\nThe murderers, whither have they run?\n\nMARGARET (_coming out_)\n\nWho lies here?\n\nPEOPLE\n\n'Tis thy mother's son!\n\nMARGARET\n\nAlmighty God! what misery!\n\nVALENTINE\n\nI'm dying! That is quickly said,\nAnd quicker yet 'tis done.\nWhy howl, you women there? Instead,\nCome here and listen, every one!\n\n(_All gather around him_)\n\nMy Margaret, see! still young thou art,\nBut not the least bit shrewd or smart,\nThy business thus to slight:\nSo this advice I bid thee heed--\nNow that thou art a whore indeed,\nWhy, be one then, outright!\n\nMARGARET\n\nMy brother! God! such words to me?\n\nVALENTINE\n\nIn this game let our Lord God be!\nWhat's done's already done, alas!\nWhat follows it, must come to pass.\nWith one begin'st thou secretly,\nThen soon will others come to thee,\nAnd when a dozen thee have known,\nThou'rt also free to all the town.\nWhen Shame is born and first appears,\nShe is in secret brought to light,\nAnd then they draw the veil of night\nOver her head and ears;\nHer life, in fact, they're loath to spare her.\nBut let her growth and strength display,\nShe walks abroad unveiled by day,\nYet is not grown a whit the fairer.\nThe uglier she is to sight,\nThe more she seeks the day's broad light.\nThe time I verily can discern\nWhen all the honest folk will turn\nFrom thee, thou jade! and seek protection\nAs from a corpse that breeds infection.\nThy guilty heart shall then dismay thee.\nWhen they but look thee in the face:--\nShalt not in a golden chain array thee,\nNor at the altar take thy place!\nShalt not, in lace and ribbons flowing,\nMake merry when the dance is going!\nBut in some corner, woe betide thee!\nAmong the beggars and cripples hide thee;\nAnd so, though even God forgive,\nOn earth a damned existence live!\n\nMARTHA\n\nCommend your soul to God for pardon,\nThat you your heart with slander harden!\n\nVALENTINE\n\nThou pimp most infamous, be still!\nCould I thy withered body kill,\n'Twould bring, for all my sinful pleasure,\nForgiveness in the richest measure.\n\nMARGARET\n\nMy brother! This is Hell's own pain!\n\nVALENTINE\n\nI tell thee, from thy tears refrain!\nWhen thou from honor didst depart\nIt stabbed me to the very heart.\nNow through the slumber of the grave\nI go to God as a soldier brave.\n\n(_Dies_.)\n\n[Illustration]\n\n[Illustration]\n\n\n\n\nXX\n\n\nCATHEDRAL\n\nSERVICE, ORGAN _and_ ANTHEM.\n\n(MARGARET _among much people: the_ EVIL SPIRIT _behind_\nMARGARET.)\n\nEVIL SPIRIT\n\nHOW otherwise was it, Margaret,\nWhen thou, still innocent,\nHere to the altar cam'st,\nAnd from the worn and fingered book\nThy prayers didst prattle,\nHalf sport of childhood,\nHalf God within thee!\nMargaret!\nWhere tends thy thought?\nWithin thy bosom\nWhat hidden crime?\nPray'st thou for mercy on thy mother's soul,\nThat fell asleep to long, long torment, and through thee?\nUpon thy threshold whose the blood?\nAnd stirreth not and quickens\nSomething beneath thy heart,\nThy life disquieting\nWith most foreboding presence?\n\nMARGARET\n\nWoe! woe!\nWould I were free from the thoughts\nThat cross me, drawing hither and thither\nDespite me!\n\nCHORUS\n\n        _Diesira, dies illa,\n        Solvet soeclum in favilla_!\n        _(Sound of the organ_.)\n\nEVIL SPIRIT\n\nWrath takes thee!\nThe trumpet peals!\nThe graves tremble!\nAnd thy heart\nFrom ashy rest\nTo fiery torments\nNow again requickened,\nThrobs to life!\n\nMARGARET\n\nWould I were forth!\nI feel as if the organ here\nMy breath takes from me,\nMy very heart\nDissolved by the anthem!\n\n\nCHORUS\n\n        _Judex ergo cum sedebit,\n        Quidquid latet, ad parebit,\n        Nil inultum remanebit_.\nMARGARET\n\nI cannot breathe!\nThe massy pillars\nImprison me!\nThe vaulted arches\nCrush me!--Air!\n\nEVIL SPIRIT\n\nHide thyself! Sin and shame\nStay never hidden.\nAir? Light?\nWoe to thee!\n\nCHORUS\n\n        _Quid sum miser tunc dicturus,\n        Quem patronem rogaturus,\n        Cum vix Justus sit securus_?\n\nEVIL SPIRIT\n\nThey turn their faces,\nThe glorified, from thee:\nThe pure, their hands to offer,\nShuddering, refuse thee!\nWoe!\n\nCHORUS\n\n_Quid sum miser tune dicturus_?\n\nMARGARET\n\nNeighbor! your cordial! (_She falls in a swoon_.)\n\n[Illustration]\n\n[Illustration]\n\n\n\n\nXXI\n\n\nWALPURGIS-NIGHT\n\nTHE HARTZ MOUNTAINS.\n\n_District of Schierke and Elend_.\n\nFAUST MEPHISTOPHELES\n\nMEPHISTOPHELES\n\nDOST thou not wish a broomstick-steed's assistance?\nThe sturdiest he-goat I would gladly see:\nThe way we take, our goal is yet some distance.\n\nFAUST\n\nSo long as in my legs I feel the fresh existence.\nThis knotted staff suffices me.\nWhat need to shorten so the way?\nAlong this labyrinth of vales to wander,\nThen climb the rocky ramparts yonder,\nWherefrom the fountain flings eternal spray,\nIs such delight, my steps would fain delay.\nThe spring-time stirs within the fragrant birches,\nAnd even the fir-tree feels it now:\nShould then our limbs escape its gentle searches?\n\nMEPHISTOPHELES\n\nI notice no such thing, I vow!\n'Tis winter still within my body:\nUpon my path I wish for frost and snow.\nHow sadly rises, incomplete and ruddy,\nThe moon's lone disk, with its belated glow,\nAnd lights so dimly, that, as one advances,\nAt every step one strikes a rock or tree!\nLet us, then, use a Jack-o'-lantern's glances:\nI see one yonder, burning merrily.\nHo, there! my friend! I'll levy thine attendance:\nWhy waste so vainly thy resplendence?\nBe kind enough to light us up the steep!\n\nWILL-O'-THE-WISP\n\nMy reverence, I hope, will me enable\nTo curb my temperament unstable;\nFor zigzag courses we are wont to keep.\n\nMEPHISTOPHELES\n\nIndeed? he'd like mankind to imitate!\nNow, in the Devil's name, go straight,\nOr I'll blow out his being's flickering spark!\n\nWILL-O'-THE-WISP\n\nYou are the master of the house, I mark,\nAnd I shall try to serve you nicely.\nBut then, reflect: the mountain's magic-mad to-day,\nAnd if a will-o'-the-wisp must guide you on the way,\nYou mustn't take things too precisely.\n\nFAUST, MEPHISTOPHELES, WILL-O'-THE-WISP\n\n(_in alternating song_)\n\n     We, it seems, have entered newly\n     In the sphere of dreams enchanted.\n     Do thy bidding, guide us truly,\n     That our feet be forwards planted\n     In the vast, the desert spaces!\n     See them swiftly changing places,\n     Trees on trees beside us trooping,\n     And the crags above us stooping,\n     And the rocky snouts, outgrowing,--\n     Hear them snoring, hear them blowing!\n     O'er the stones, the grasses, flowing\n     Stream and streamlet seek the hollow.\n     Hear I noises? songs that follow?\n     Hear I tender love-petitions?\n     Voices of those heavenly visions?\n     Sounds of hope, of love undying!\n     And the echoes, like traditions\n     Of old days, come faint and hollow.\n\n     Hoo-hoo! Shoo-hoo! Nearer hover\n     Jay and screech-owl, and the plover,--\n     Are they all awake and crying?\n     Is't the salamander pushes,\n     Bloated-bellied, through the bushes?\n     And the roots, like serpents twisted,\n     Through the sand and boulders toiling,\n     Fright us, weirdest links uncoiling\n     To entrap us, unresisted:\n     Living knots and gnarls uncanny\n     Feel with polypus-antennae\n     For the wanderer. Mice are flying,\n     Thousand-colored, herd-wise hieing\n     Through the moss and through the heather!\n\n     And the fire-flies wink and darkle,\n     Crowded swarms that soar and sparkle,\n     And in wildering escort gather!\n\n     Tell me, if we still are standing,\n     Or if further we're ascending?\n     All is turning, whirling, blending,\n     Trees and rocks with grinning faces,\n     Wandering lights that spin in mazes,\n     Still increasing and expanding!\n\nMEPHISTOPHELES\n\nGrasp my skirt with heart undaunted!\nHere a middle-peak is planted,\nWhence one seeth, with amaze,\nMammon in the mountain blaze.\n\nFAUST\n\nHow strangely glimmers through the hollows\nA dreary light, like that of dawn!\nIts exhalation tracks and follows\nThe deepest gorges, faint and wan.\nHere steam, there rolling vapor sweepeth;\nHere burns the glow through film and haze:\nNow like a tender thread it creepeth,\nNow like a fountain leaps and plays.\nHere winds away, and in a hundred\nDivided veins the valley braids:\nThere, in a corner pressed and sundered,\nItself detaches, spreads and fades.\nHere gush the sparkles incandescent\nLike scattered showers of golden sand;--\nBut, see! in all their height, at present,\nThe rocky ramparts blazing stand.\n\n[Illustration: _Under the old ribs of the rock retreating_,]\n\nMEPHISTOPHELES\n\nHas not Sir Mammon grandly lighted\nHis palace for this festal night?\n'Tis lucky thou hast seen the sight;\nThe boisterous guests approach that were invited.\n\nFAUST\n\nHow raves the tempest through the air!\nWith what fierce blows upon my neck 'tis beating!\n\nMEPHISTOPHELES\n\nUnder the old ribs of the rock retreating,\nHold fast, lest thou be hurled down the abysses there!\nThe night with the mist is black;\nHark! how the forests grind and crack!\nFrightened, the owlets are scattered:\nHearken! the pillars are shattered.\nThe evergreen palaces shaking!\nBoughs are groaning and breaking,\nThe tree-trunks terribly thunder,\nThe roots are twisting asunder!\nIn frightfully intricate crashing\nEach on the other is dashing,\nAnd over the wreck-strewn gorges\nThe tempest whistles and surges!\nHear'st thou voices higher ringing?\nFar away, or nearer singing?\nYes, the mountain's side along,\nSweeps an infuriate glamouring song!\n\nWITCHES (_in chorus_)\n\n     The witches ride to the Brocken's top,\n     The stubble is yellow, and green the crop.\n     There gathers the crowd for carnival:\n     Sir Urian sits over all.\n\n     And so they go over stone and stock;\n     The witch she-----s, and-----s the buck.\n\nA VOICE\n\n     Alone, old Baubo's coming now;\n     She rides upon a farrow-sow.\n\nCHORUS\n\n     Then honor to whom the honor is due!\n     Dame Baubo first, to lead the crew!\n     A tough old sow and the mother thereon,\n     Then follow the witches, every one.\n\nA VOICE\n\nWhich way com'st thou hither?\n\nVOICE\n\nO'er the Ilsen-stone.\nI peeped at the owl in her nest alone:\nHow she stared and glared!\n\nVOICE\n\nBetake thee to Hell!\nWhy so fast and so fell?\n\nVOICE\n\nShe has scored and has flayed me:\nSee the wounds she has made me!\n\nWITCHES (_chorus_)\n\n     The way is wide, the way is long:\n     See, what a wild and crazy throng!\n     The broom it scratches, the fork it thrusts,\n     The child is stifled, the mother bursts.\nWIZARDS (_semichorus_)\n\n     As doth the snail in shell, we crawl:\n     Before us go the women all.\n     When towards the Devil's House we tread,\n     Woman's a thousand steps ahead.\n\nOTHER SEMICHORUS\n\n     We do not measure with such care:\n     Woman in thousand steps is theft.\n     But howsoe'er she hasten may,\n     Man in one leap has cleared the way.\n\nVOICE (_from above_)\n\nCome on, come on, from Rocky Lake!\n\nVOICE (_from below_)\n\nAloft we'd fain ourselves betake.\nWe've washed, and are bright as ever you will,\nYet we're eternally sterile still.\n\nBOTH CHORUSES\n\n     The wind is hushed, the star shoots by.\n     The dreary moon forsakes the sky;\n     The magic notes, like spark on spark,\n     Drizzle, whistling through the dark.\n\nVOICE (_from below_)\n\nHalt, there! Ho, there!\n\nVOICE (_from above_)\n\nWho calls from the rocky cleft below there?\n\nVOICE (_below_)\n\nTake me, too! take me, too!\nI'm climbing now three hundred years,\nAnd yet the summit cannot see:\nAmong my equals I would be.\n\nBOTH CHORUSES\n\n     Bears the broom and bears the stock,\n     Bears the fork and bears the buck:\n     Who cannot raise himself to-night\n     Is evermore a ruined wight.\n\nHALF-WITCH (_below_)\n\nSo long I stumble, ill bestead,\nAnd the others are now so far ahead!\nAt home I've neither rest nor cheer,\nAnd yet I cannot gain them here.\n\nCHORUS OF WITCHES\n\n     To cheer the witch will salve avail;\n     A rag will answer for a sail;\n     Each trough a goodly ship supplies;\n     He ne'er will fly, who now not flies.\n\nBOTH CHORUSES\n\n     When round the summit whirls our flight,\n     Then lower, and on the ground alight;\n     And far and wide the heather press\n     With witchhood's swarms of wantonness!\n\n(_They settle down_.)\n\nMEPHISTOPHELES\n\nThey crowd and push, they roar and clatter!\nThey whirl and whistle, pull and chatter!\nThey shine, and spirt, and stink, and burn!\nThe true witch-element we learn.\nKeep close! or we are parted, in our turn,\nWhere art thou?\n\nFAUST (_in the distance_)\n\nHere!\n\nMEPHISTOPHELES\n\nWhat! whirled so far astray?\nThen house-right I must use, and clear the way.\nMake room! Squire Voland comes! Room, gentle rabble,\nroom!\n\nHere, Doctor, hold to me: in one jump we'll resume\nAn easier space, and from the crowd be free:\nIt's too much, even for the like of me.\nYonder, with special light, there's something shining clearer\nWithin those bushes; I've a mind to see.\nCome on! well slip a little nearer.\n\nFAUST\n\nSpirit of Contradiction! On! I'll follow straight.\n'Tis planned most wisely, if I judge aright:\nWe climb the Brocken's top in the Walpurgis-Night,\nThat arbitrarily, here, ourselves we isolate.\n\nMEPHISTOPHELES\n\nBut see, what motley flames among the heather!\nThere is a lively club together:\nIn smaller circles one is not alone.\n\nFAUST\n\nBetter the summit, I must own:\nThere fire and whirling smoke I see.\nThey seek the Evil One in wild confusion:\nMany enigmas there might find solution.\n\nMEPHISTOPHELES\n\nBut there enigmas also knotted be.\nLeave to the multitude their riot!\nHere will we house ourselves in quiet.\nIt is an old, transmitted trade,\nThat in the greater world the little worlds are made.\nI see stark-nude young witches congregate,\nAnd old ones, veiled and hidden shrewdly:\nOn my account be kind, nor treat them rudely!\nThe trouble's small, the fun is great.\nI hear the noise of instruments attuning,--\nVile din! yet one must learn to bear the crooning.\nCome, come along! It _must_ be, I declare!\nI'll go ahead and introduce thee there,\nThine obligation newly earning.\nThat is no little space: what say'st thou, friend?\nLook yonder! thou canst scarcely see the end:\nA hundred fires along the ranks are burning.\nThey dance, they chat, they cook, they drink, they court:\nNow where, just tell me, is there better sport?\n\nFAUST\n\nWilt thou, to introduce us to the revel,\nAssume the part of wizard or of devil?\n\nMEPHISTOPHELES\n\nI'm mostly used, 'tis true, to go incognito,\nBut on a gala-day one may his orders show.\nThe Garter does not deck my suit,\nBut honored and at home is here the cloven foot.\nPerceiv'st thou yonder snail? It cometh, slow and steady;\nSo delicately its feelers pry,\nThat it hath scented me already:\nI cannot here disguise me, if I try.\nBut come! we'll go from this fire to a newer:\nI am the go-between, and thou the wooer.\n\n(_To some, who are sitting around dying embers_:)\n\nOld gentlemen, why at the outskirts? Enter!\nI'd praise you if I found you snugly in the centre,\nWith youth and revel round you like a zone:\nYou each, at home, are quite enough alone.\n\nGENERAL\n\nSay, who would put his trust in nations,\nHowe'er for them one may have worked and planned?\nFor with the people, as with women,\nYouth always has the upper hand.\n\nMINISTER\n\nThey're now too far from what is just and sage.\nI praise the old ones, not unduly:\nWhen we were all-in-all, then, truly,\n_Then_ was the real golden age.\n\nPARVENU\n\nWe also were not stupid, either,\nAnd what we should not, often did;\nBut now all things have from their bases slid,\nJust as we meant to hold them fast together.\n\nAUTHOR\n\nWho, now, a work of moderate sense will read?\nSuch works are held as antiquate and mossy;\nAnd as regards the younger folk, indeed,\nThey never yet have been so pert and saucy.\n\nMEPHISTOPHELES\n\n(_who all at once appears very old_)\n\nI feel that men are ripe for Judgment-Day,\nNow for the last time I've the witches'-hill ascended:\nSince to the lees _my_ cask is drained away,\nThe world's, as well, must soon be ended.\n\nHUCKSTER-WITCH\n\nYe gentlemen, don't pass me thus!\nLet not the chance neglected be!\nBehold my wares attentively:\nThe stock is rare and various.\nAnd yet, there's nothing I've collected--\nNo shop, on earth, like this you'll find!--\nWhich has not, once, sore hurt inflicted\nUpon the world, and on mankind.\nNo dagger's here, that set not blood to flowing;\nNo cup, that hath not once, within a healthy frame\nPoured speedy death, in poison glowing:\nNo gems, that have not brought a maid to shame;\nNo sword, but severed ties for the unwary,\nOr from behind struck down the adversary.\n\nMEPHISTOPHELES\n\nGossip! the times thou badly comprehendest:\nWhat's done has happed--what haps, is done!\n'Twere better if for novelties thou sendest:\nBy such alone can we be won.\n\nFAUST\n\nLet me not lose myself in all this pother!\nThis is a fair, as never was another!\n\nMEPHISTOPHELES\n\nThe whirlpool swirls to get above:\nThou'rt shoved thyself, imagining to shove.\n\nFAUST\n\nBut who is that?\n\nMEPHISTOPHELES\n\nNote her especially,\nTis Lilith.\n\nFAUST\n\nWho?\n\nMEPHISTOPHELES\n\nAdam's first wife is she.\nBeware the lure within her lovely tresses,\nThe splendid sole adornment of her hair!\nWhen she succeeds therewith a youth to snare,\nNot soon again she frees him from her jesses.\n\nFAUST\n\nThose two, the old one with the young one sitting,\nThey've danced already more than fitting.\n\nMEPHISTOPHELES\n\nNo rest to-night for young or old!\nThey start another dance: come now, let us take hold!\n\nFAUST (_dancing with the young witch_)\n\n     A lovely dream once came to me;\n     I then beheld an apple-tree,\n     And there two fairest apples shone:\n     They lured me so, I climbed thereon.\n\nTHE FAIR ONE\n\n     Apples have been desired by you,\n     Since first in Paradise they grew;\n     And I am moved with joy, to know\n     That such within my garden grow.\n\nMEPHISTOPHELES (_dancing with the old one_)\n\n     A dissolute dream once came to me:\n     Therein I saw a cloven tree,\n     Which had a-----------------;\n     Yet,-----as 'twas, I fancied it.\n\nTHE OLD ONE\n\n     I offer here my best salute\n     Unto the knight with cloven foot!\n     Let him a-----------prepare,\n     If him------------------does not scare.\n\nPROKTOPHANTASMIST\n\nAccursed folk! How dare you venture thus?\nHad you not, long since, demonstration\nThat ghosts can't stand on ordinary foundation?\nAnd now you even dance, like one of us!\n\nTHE FAIR ONE (_dancing_)\n\nWhy does he come, then, to our ball?\n\nFAUST (_dancing_)\n\nO, everywhere on him you fall!\nWhen others dance, he weighs the matter:\nIf he can't every step bechatter,\nThen 'tis the same as were the step not made;\nBut if you forwards go, his ire is most displayed.\nIf you would whirl in regular gyration\nAs he does in his dull old mill,\nHe'd show, at any rate, good-will,--\nEspecially if you heard and heeded his hortation.\n\nPROKTOPHANTASMIST\n\nYou still are here? Nay, 'tis a thing unheard!\nVanish, at once! We've said the enlightening word.\nThe pack of devils by no rules is daunted:\nWe are so wise, and yet is Tegel haunted.\nTo clear the folly out, how have I swept and stirred!\nTwill ne'er be clean: why, 'tis a thing unheard!\n\nTHE FAIR ONE\n\nThen cease to bore us at our ball!\n\nPROKTOPHANTASMIST\n\nI tell you, spirits, to your face,\nI give to spirit-despotism no place;\nMy spirit cannot practise it at all.\n\n(_The dance continues_)\n\nNaught will succeed, I see, amid such revels;\nYet something from a tour I always save,\nAnd hope, before my last step to the grave,\nTo overcome the poets and the devils.\n\nMEPHISTOPHELES\n\nHe now will seat him in the nearest puddle;\nThe solace this, whereof he's most assured:\nAnd when upon his rump the leeches hang and fuddle,\nHe'll be of spirits and of Spirit cured.\n\n(_To_ FAUST, _who has left the dance_:)\n\nWherefore forsakest thou the lovely maiden,\nThat in the dance so sweetly sang?\n\nFAUST\n\nAh! in the midst of it there sprang\nA red mouse from her mouth--sufficient reason.\n\nMEPHISTOPHELES\n\nThat's nothing! One must not so squeamish be;\nSo the mouse was not gray, enough for thee.\nWho'd think of that in love's selected season?\n\nFAUST\n\nThen saw I--.\n\nMEPHISTOPHELES\n\nWhat?\n\nFAUST\n\nMephisto, seest thou there,\nAlone and far, a girl most pale and fair?\nShe falters on, her way scarce knowing,\nAs if with fettered feet that stay her going.\nI must confess, it seems to me\nAs if my kindly Margaret were she.\n\nMEPHISTOPHELES\n\nLet the thing be! All thence have evil drawn:\nIt is a magic shape, a lifeless eidolon.\nSuch to encounter is not good:\nTheir blank, set stare benumbs the human blood,\nAnd one is almost turned to stone.\nMedusa's tale to thee is known.\n\nFAUST\n\nForsooth, the eyes they are of one whom, dying,\nNo hand with loving pressure closed;\nThat is the breast whereon I once was lying,--\nThe body sweet, beside which I reposed!\n\nMEPHISTOPHELES\n\nTis magic all, thou fool, seduced so easily!\nUnto each man his love she seems to be.\n\nFAUST\n\nThe woe, the rapture, so ensnare me,\nThat from her gaze I cannot tear me!\nAnd, strange! around her fairest throat\nA single scarlet band is gleaming,\nNo broader than a knife-blade seeming!\n\nMEPHISTOPHELES\n\nQuite right! The mark I also note.\nHer head beneath her arm she'll sometimes carry;\nTwas Perseus lopped it, her old adversary.\nThou crav'st the same illusion still!\nCome, let us mount this little hill;\nThe Prater shows no livelier stir,\nAnd, if they've not bewitched my sense,\nI verily see a theatre.\nWhat's going on?\n\nSERVIBILIS\n                 'Twill shortly recommence:\nA new performance--'tis the last of seven.\nTo give that number is the custom here:\n'Twas by a Dilettante written,\nAnd Dilettanti in the parts appear.\nThat now I vanish, pardon, I entreat you!\nAs Dilettante I the curtain raise.\n\nMEPHISTOPHELES\nWhen I upon the Blocksberg meet you,\nI find it good: for that's your proper place.\n\n\n[Illustration]\n\n[Illustration]\n\n\n\n\nXXII\n\n\nWALPURGIS-NIGHT'S DREAM\n\nOBERON AND TITANIA's GOLDEN WEDDING\n\nINTERMEZZO\n\nMANAGER\n\nSons of Mieding, rest to-day!\nNeedless your machinery:\nMisty vale and mountain gray,\nThat is all the scenery.\n\nHERALD\n\nThat the wedding golden be.\nMust fifty years be rounded:\nBut _the Golden_ give to me,\nWhen the strife's compounded.\n\nOBERON\n\nSpirits, if you're here, be seen--\nShow yourselves, delighted!\nFairy king and fairy queen,\nThey are newly plighted.\n\nPUCK\n\nCometh Puck, and, light of limb,\nWhisks and whirls in measure:\nCome a hundred after him,\nTo share with him the pleasure.\n\nARIEL\n\nAriel's song is heavenly-pure,\nHis tones are sweet and rare ones:\nThough ugly faces he allure,\nYet he allures the fair ones.\n\nOBERON\n\nSpouses, who would fain agree,\nLearn how we were mated!\nIf your pairs would loving be,\nFirst be separated!\n\nTITANIA\n\nIf her whims the wife control,\nAnd the man berate her,\nTake him to the Northern Pole,\nAnd her to the Equator!\n\nORCHESTRA. TUTTI.\n\n_Fortissimo_.\n\nSnout of fly, mosquito-bill,\nAnd kin of all conditions,\nFrog in grass, and cricket-trill,--\nThese are the musicians!\n\nSOLO\n\nSee the bagpipe on our track!\n'Tis the soap-blown bubble:\nHear the _schnecke-schnicke-schnack_\nThrough his nostrils double!\n\nSPIRIT, JUST GROWING INTO FORM\n\nSpider's foot and paunch of toad,\nAnd little wings--we know 'em!\nA little creature 'twill not be,\nBut yet, a little poem.\n\nA LITTLE COUPLE\n\nLittle step and lofty leap\nThrough honey-dew and fragrance:\nYou'll never mount the airy steep\nWith all your tripping vagrance.\n\nINQUISITIVE TRAVELLER\n\nIs't but masquerading play?\nSee I with precision?\nOberon, the beauteous fay,\nMeets, to-night, my vision!\n\nORTHODOX\n\nNot a claw, no tail I see!\nAnd yet, beyond a cavil,\nLike \"the Gods of Greece,\" must he\nAlso be a devil.\n\nNORTHERN ARTIST\n\nI only seize, with sketchy air,\nSome outlines of the tourney;\nYet I betimes myself prepare\nFor my Italian journey.\n\nPURIST\n\nMy bad luck brings me here, alas!\nHow roars the orgy louder!\nAnd of the witches in the mass,\nBut only two wear powder.\n\nYOUNG WITCH\n\nPowder becomes, like petticoat,\nA gray and wrinkled noddy;\nSo I sit naked on my goat,\nAnd show a strapping body.\n\nMATRON\n\nWe've too much tact and policy\nTo rate with gibes a scolder;\nYet, young and tender though you be,\nI hope to see you moulder.\n\nLEADER OF THE BAND\n\nFly-snout and mosquito-bill,\nDon't swarm so round the Naked!\nFrog in grass and cricket-trill,\nObserve the time, and make it!\n\nWEATHERCOCK (_towards one side_)\n\nSociety to one's desire!\nBrides only, and the sweetest!\nAnd bachelors of youth and fire.\nAnd prospects the completest!\n\nWEATHERCOCK (_towards the other side_)\n\nAnd if the Earth don't open now\nTo swallow up each ranter,\nWhy, then will I myself, I vow,\nJump into hell instanter!\n\nXENIES\n\nUs as little insects see!\nWith sharpest nippers flitting,\nThat our Papa Satan we\nMay honor as is fitting.\n\nHENNINGS\n\nHow, in crowds together massed,\nThey are jesting, shameless!\nThey will even say, at last,\nThat their hearts are blameless.\n\nMUSAGETES\n\nAmong this witches' revelry\nHis way one gladly loses;\nAnd, truly, it would easier be\nThan to command the Muses.\n\nCI-DEVANT GENIUS OF THE AGE\n\nThe proper folks one's talents laud:\nCome on, and none shall pass us!\nThe Blocksberg has a summit broad,\nLike Germany's Parnassus.\n\nINQUISITIVE TRAVELLER\n\nSay, who's the stiff and pompous man?\nHe walks with haughty paces:\nHe snuffles all he snuffle can:\n\"He scents the Jesuits' traces.\"\n\nCRANE\n\nBoth clear and muddy streams, for me\nAre good to fish and sport in:\nAnd thus the pious man you see\nWith even devils consorting.\n\nWORLDLING\n\nYes, for the pious, I suspect,\nAll instruments are fitting;\nAnd on the Blocksberg they erect\nFull many a place of meeting.\n\nDANCER\n\nA newer chorus now succeeds!\nI hear the distant drumming.\n\"Don't be disturbed! 'tis, in the reeds,\nThe bittern's changeless booming.\"\n\nDANCING-MASTER\n\nHow each his legs in nimble trip\nLifts up, and makes a clearance!\nThe crooked jump, the heavy skip,\nNor care for the appearance.\n\nGOOD FELLOW\n\nThe rabble by such hate are held,\nTo maim and slay delights them:\nAs Orpheus' lyre the brutes compelled,\nThe bagpipe here unites them.\n\nDOGMATIST\n\nI'll not be led by any lure\nOf doubts or critic-cavils:\nThe Devil must be something, sure,--\nOr how should there be devils?\n\nIDEALIST\n\nThis once, the fancy wrought in me\nIs really too despotic:\nForsooth, if I am all I see,\nI must be idiotic!\n\nREALIST\n\nThis racking fuss on every hand,\nIt gives me great vexation;\nAnd, for the first time, here I stand\nOn insecure foundation.\n\nSUPERNATURALIST\n\nWith much delight I see the play,\nAnd grant to these their merits,\nSince from the devils I also may\nInfer the better spirits.\n\nSCEPTIC\n\nThe flame they follow, on and on,\nAnd think they're near the treasure:\nBut _Devil_ rhymes with _Doubt_ alone,\nSo I am here with pleasure.\n\nLEADER OF THE BAND\n\nFrog in green, and cricket-trill.\nSuch dilettants!--perdition!\nFly-snout and mosquito-bill,--\nEach one's a fine musician!\n\nTHE ADROIT\n\n_Sans souci_, we call the clan\nOf merry creatures so, then;\nGo a-foot no more we can,\nAnd on our heads we go, then.\n\nTHE AWKWARD\n\nOnce many a bit we sponged, but now,\nGod help us! that is done with:\nOur shoes are all danced out, we trow,\nWe've but naked soles to run with.\n\nWILL-O'-THE WISPS\n\nFrom the marshes we appear,\nWhere we originated;\nYet in the ranks, at once, we're here\nAs glittering gallants rated.\n\nSHOOTING-STAR\n\nDarting hither from the sky,\nIn star and fire light shooting,\nCross-wise now in grass I lie:\nWho'll help me to my footing?\n\nTHE HEAVY FELLOWS\n\nRoom! and round about us, room!\nTrodden are the grasses:\nSpirits also, spirits come,\nAnd they are bulky masses.\n\nPUCK\n\nEnter not so stall-fed quite,\nLike elephant-calves about one!\nAnd the heaviest weight to-night\nBe Puck, himself, the stout one!\n\nARIEL\n\nIf loving Nature at your back,\nOr Mind, the wings uncloses,\nFollow up my airy track\nTo the mount of roses!\n\nORCHESTRA\n\n_pianissimo_\nCloud and trailing mist o'erhead\nAre now illuminated:\nAir in leaves, and wind in reed,\nAnd all is dissipated.\n\n[Illustration]\n\n\n\n\nXXIII\n\n\nDREARY DAY\n\nA FIELD\n\nFAUST MEPHISTOPHELES\n\nFAUST\n\nIn misery! In despair! Long wretchedly astray on the face of the earth,\nand now imprisoned! That gracious, ill-starred creature shut in a\ndungeon as a criminal, and given up to fearful torments! To this has it\ncome! to this!--Treacherous, contemptible spirit, and thou hast\nconcealed it from me!--Stand, then,--stand! Roll the devilish eyes\nwrathfully in thy head! Stand and defy me with thine intolerable\npresence! Imprisoned! In irretrievable misery! Delivered up to evil\nspirits, and to condemning, unfeeling Man! And thou hast lulled me,\nmeanwhile, with the most insipid dissipations, hast concealed from me\nher increasing wretchedness, and suffered her to go helplessly to ruin!\n[Illustration: _Roll the devilish eyes wrathfully in thy head_]\n\n\nMEPHISTOPHELES\n\nShe is not the first.\n\nFAUST\n\nDog! Abominable monster! Transform him, thou Infinite Spirit! transform\nthe reptile again into his dog-shape? in which it pleased him often at\nnight to scamper on before me, to roll himself at the feet of the\nunsuspecting wanderer, and hang upon his shoulders when he fell!\nTransform him again into his favorite likeness, that he may crawl upon\nhis belly in the dust before me,--that I may trample him, the outlawed,\nunder foot! Not the first! O woe! woe which no human soul can grasp,\nthat more than one being should sink into the depths of this\nmisery,--that the first, in its writhing death-agony under the eyes of\nthe Eternal Forgiver, did not expiate the guilt of all others! The\nmisery of this single one pierces to the very marrow of my life; and\nthou art calmly grinning at the fate of thousands!\n\nMEPHISTOPHELES\n\nNow we are already again at the end of our wits, where the understanding\nof you men runs wild. Why didst thou enter into fellowship with us, if\nthou canst not carry it out? Wilt fly, and art not secure against\ndizziness? Did we thrust ourselves upon thee, or thou thyself upon us?\n\nFAUST\n\nGnash not thus thy devouring teeth at me? It fills me with horrible\ndisgust. Mighty, glorious Spirit, who hast vouchsafed to me Thine\napparition, who knowest my heart and my soul, why fetter me to the\nfelon-comrade, who feeds on mischief and gluts himself with ruin?\n\nMEPHISTOPHELES\n\nHast thou done?\n\nFAUST\n\nRescue her, or woe to thee! The fearfullest curse be upon thee for\nthousands of ages!\n\nMEPHISTOPHELES\n\nI cannot loosen the bonds of the Avenger, nor undo his bolts. Rescue\nher? Who was it that plunged her into ruin? I, or thou?\n\n(FAUST _looks around wildly_.)\n\nWilt thou grasp the thunder? Well that it has not been given to you,\nmiserable mortals! To crush to pieces the innocent respondent--that is\nthe tyrant-fashion of relieving one's self in embarrassments.\n\nFAUST\n\nTake me thither! She shall be free!\n\nMEPHISTOPHELES\n\nAnd the danger to which thou wilt expose thyself? Know that the guilt of\nblood, from thy hand, still lies upon the town! Avenging spirits hover\nover the spot where the victim fell, and lie in wait for the returning\nmurderer.\n\nFAUST\n\nThat, too, from thee? Murder and death of a world upon thee, monster!\nTake me thither, I say, and liberate her!\n\nMEPHISTOPHELES\n\nI will convey thee there; and hear, what I can do! Have I all the power\nin Heaven and on Earth? I will becloud the jailer's senses: get\npossession of the key, and lead her forth with human hand! I will keep\nwatch: the magic steeds are ready, I will carry you off. So much is in\nmy power.\n\nFAUST\n\nUp and away!\n\n[Illustration]\n\n\n\n\nXXIV\n\n\nNIGHT\n\nOPEN FIELD\n\n(FAUST _and_ MEPHISTOPHELES _speeding onward on black horses_.)\n\n\nFAUST\n\nWhat weave they there round the raven-stone?\n\n\nMEPHISTOPHELES\n\nI know not what they are brewing and doing.\n\n\nFAUST\n\nSoaring up, sweeping down, bowing and bending!\n\n\nMEPHISTOPHELES\n\nA witches'-guild.\n\n\nFAUST\n\nThey scatter, devote and doom!\n\n\nMEPHISTOPHELES\n\nOn! on!\n\n[Illustration]\n\n\n\n\nXXV\n\n\nDUNGEON\n\nFAUST\n\n(_with a bunch of keys and a lamp, before an iron door_)\n\nA shudder, long unfelt, comes o'er me;\nMankind's collected woe o'erwhelms me, here.\nShe dwells within the dark, damp walls before me,\nAnd all her crime was a delusion dear!\nWhat! I delay to free her?\nI dread, once again to see her?\nOn! my shrinking but lingers Death more near.\n\n(_He grasps the lock: the sound of singing is heard inside_.)\n\n     _My mother, the harlot,\n     Who put me to death;\n     My father, the varlet,\n     Who eaten me hath!\n     Little sister, so good,\n     Laid my bones in the wood,\n     In the damp moss and clay:_\n     _Then was I a beautiful bird o' the wood;\n     Fly away! Fly away_!\n\nFAUST _(unlocking)_\n\nShe does not dream her lover listens near;\nThat he the rattling chain, the rustling straw, can hear.\n\n_(He enters_.)\n\nMARGARET (_hiding herself on the pallet_)\nWoe! woe! They come. O death of bitterness!\n\nFAUST (_whispering_)\nHush! hush! The hour is come that frees thee.\n\nMARGARET (_throwing herself before him_)\nArt thou a man, then pity my distress!\n\nFAUST\nThy cries will wake the guards, and they will seize thee!\n(_He takes hold of the fetters to unlock them_.)\n\nMARGARET (_on her knees_)\n\nWho, headsman! unto thee such power\nOver me could give?\nThou'rt come for me at midnight-hour:\nHave mercy on me, let me live!\nIs't not soon enough when morning chime has run?\n\n(_She rises_.)\n\nAnd I am yet so young, so young!\nAnd now Death comes, and ruin!\nI, too, was fair, and that was my undoing.\nMy love was near, but now he's far;\nTorn lies the wreath, scattered the blossoms are.\nSeize me not thus so violently!\nSpare me! What have I done to thee?\nLet me not vainly entreat thee!\nI never chanced, in all my days, to meet thee!\n\n\nFAUST\n\nShall I outlive this misery?\n\n\nMARGARET\n\nNow am I wholly in thy might.\nBut let me suckle, first, my baby!\nI blissed it all this livelong night;\nThey took 't away, to vex me, maybe,\nAnd now they say I killed the child outright.\nAnd never shall I be glad again.\nThey sing songs about me! 'tis bad of the folk to do it!\nThere's an old story has the same refrain;\nWho bade them so construe it?\n\n\nFAUST (_falling upon his knees_)\n\nHere lieth one who loves thee ever,\nThe thraldom of thy woe to sever.\n\n\nMARGARET (_flinging herself beside him_)\n\nO let us kneel, and call the Saints to hide us!\nUnder the steps beside us,\nThe threshold under,\nHell heaves in thunder!\nThe Evil One\nWith terrible wrath\nSeeketh a path\nHis prey to discover!\n\nFAUST (_aloud_)\n\nMargaret! Margaret!\n\n\nMARGARET (_attentively listening_)\n\nThat was the voice of my lover!\n\n(_She springs to her feet: the fetters fall off_.)\n\nWhere is he? I heard him call me.\nI am free! No one shall enthrall me.\nTo his neck will I fly,\nOn his bosom lie!\nOn the threshold he stood, and _Margaret_! calling,\nMidst of Hell's howling and noises appalling,\nMidst of the wrathful, infernal derision,\nI knew the sweet sound of the voice of the vision!\n\n\nFAUST\n\n'Tis I!\n\nMARGARET\n\n      'Tis thou! O, say it once again!\n\n    (_Clasping him_.)\n\n'Tis he! 'tis he! Where now is all my pain?\nThe anguish of the dungeon, and the chain?\n'Tis thou! Thou comest to save me,\nAnd I am saved!--\nAgain the street I see\nWhere first I looked on thee;\nAnd the garden, brightly blooming,\nWhere I and Martha wait thy coming.\n\n\nFAUST (_struggling to leave_)\n\nCome! Come with me!\n\n\nMARGARET\n\n                    Delay, now!\nSo fain I stay, when thou delayest!\n\n  (_Caressing him_.)\n\n\nFAUST\n\nAway, now!\nIf longer here thou stayest,\nWe shall be made to dearly rue it.\n\nMARGARET\n\nKiss me!--canst no longer do it?\nMy friend, so short a time thou'rt missing,\nAnd hast unlearned thy kissing?\nWhy is my heart so anxious, on thy breast?\nWhere once a heaven thy glances did create me,\nA heaven thy loving words expressed,\nAnd thou didst kiss, as thou wouldst suffocate me--\nKiss me!\nOr I'll kiss thee!\n\n(_She embraces him_.)\n\nAh, woe! thy lips are chill,\nAnd still.\nHow changed in fashion\nThy passion!\nWho has done me this ill?\n\n(_She turns away from him_.)\n\nFAUST\n\nCome, follow me! My darling, be more bold:\nI'll clasp thee, soon, with warmth a thousand-fold;\nBut follow now! 'Tis all I beg of thee.\n\nMARGARET (_turning to him_)\n\nAnd is it thou? Thou, surely, certainly?\n\nFAUST\n\n'Tis I! Come on!\n\nMARGARET\n\nThou wilt unloose my chain,\nAnd in thy lap wilt take me once again.\nHow comes it that thou dost not shrink from me?--\nSay, dost thou know, my friend, whom thou mak'st free?\n\nFAUST\n\nCome! come! The night already vanisheth.\n\n\nMARGARET\n\nMy mother have I put to death;\nI've drowned the baby born to thee.\nWas it not given to thee and me?\nThee, too!--'Tis thou! It scarcely true doth seem--\nGive me thy hand! 'Tis not a dream!\nThy dear, dear hand!--But, ah, 'tis wet!\nWhy, wipe it off! Methinks that yet\nThere's blood thereon.\nAh, God! what hast thou done?\nNay, sheathe thy sword at last!\nDo not affray me!\n\n\nFAUST\n\nO, let the past be past!\nThy words will slay me!\n\n\nMARGARET\n\nNo, no! Thou must outlive us.\nNow I'll tell thee the graves to give us:\nThou must begin to-morrow\nThe work of sorrow!\nThe best place give to my mother,\nThen close at her side my brother,\nAnd me a little away,\nBut not too very far, I pray!\nAnd here, on my right breast, my baby lay!\nNobody else will lie beside me!--\nAh, within thine arms to hide me,\nThat was a sweet and a gracious bliss,\nBut no more, no more can I attain it!\nI would force myself on thee and constrain it,\nAnd it seems thou repellest my kiss:\nAnd yet 'tis thou, so good, so kind to see!\n\n\nFAUST\n\nIf thou feel'st it is I, then come with me!\n\n\nMARGARET\n\nOut yonder?\n\n\nFAUST\n\nTo freedom.\n\n\nMARGARET\n\n  If the grave is there,\nDeath lying in wait, then come!\nFrom here to eternal rest:\nNo further step--no, no!\nThou goest away! O Henry, if I could go!\n\n\nFAUST\n\nThou canst! Just will it! Open stands the door.\n\n\nMARGARET\n\nI dare not go: there's no hope any more.\nWhy should I fly? They'll still my steps waylay!\nIt is so wretched, forced to beg my living,\nAnd a bad conscience sharper misery giving!\nIt is so wretched, to be strange, forsaken,\nAnd I'd still be followed and taken!\n\n\nFAUST\n\nI'll stay with thee.\n\n\nMARGARET\n\nBe quick! Be quick!\nSave thy perishing child!\nAway! Follow the ridge\nUp by the brook,\n\n[Illustration: _=If the grave is there,\nDeath lying in wait, then come=_!]\n\nOver the bridge,\nInto the wood,\nTo the left, where the plank is placed\nIn the pool!\nSeize it in haste!\n'Tis trying to rise,\n'Tis struggling still!\nSave it! Save it!\n\n\nFAUST\n\nRecall thy wandering will!\nOne step, and thou art free at last!\n\n\nMARGARET\n\nIf the mountain we had only passed!\nThere sits my mother upon a stone,--\nI feel an icy shiver!\nThere sits my mother upon a stone,\nAnd her head is wagging ever.\nShe beckons, she nods not, her heavy head falls o'er;\nShe slept so long that she wakes no more.\nShe slept, while we were caressing:\nAh, those were the days of blessing!\n\n\nFAUST\n\nHere words and prayers are nothing worth;\nI'll venture, then, to bear thee forth.\n\n\nMARGARET\n\nNo--let me go! I'll suffer no force!\nGrasp me not so murderously!\nI've done, else, all things for the love of thee.\n\n\nFAUST\n\nThe day dawns: Dearest! Dearest!\n\nMARGARET\n\nDay? Yes, the day comes,--the last day breaks for me!\nMy wedding-day it was to be!\nTell no one thou has been with Margaret!\nWoe for my garland! The chances\nAre over--'tis all in vain!\nWe shall meet once again,\nBut not at the dances!\nThe crowd is thronging, no word is spoken:\nThe square below\nAnd the streets overflow:\nThe death-bell tolls, the wand is broken.\nI am seized, and bound, and delivered--\nShoved to the block--they give the sign!\nNow over each neck has quivered\nThe blade that is quivering over mine.\nDumb lies the world like the grave!\n\nFAUST\n\nO had I ne'er been born!\n\nMEPHISTOPHELES (_appears outside_)\n\nOff! or you're lost ere morn.\nUseless talking, delaying and praying!\nMy horses are neighing:\nThe morning twilight is near.\n\nMARGARET\n\nWhat rises up from the threshold here?\nHe! he! suffer him not!\nWhat does he want in this holy spot?\nHe seeks me!\n\n\nFAUST\n\nThou shalt live.\n\nMARGARET\n\nJudgment of God! myself to thee I give.\n\n\nMEPHISTOPHELES (_to_ FAUST)\n\nCome! or I'll leave her in the lurch, and thee!\n\n\nMARGARET\n\nThine am I, Father! rescue me!\nYe angels, holy cohorts, guard me,\nCamp around, and from evil ward me!\nHenry! I shudder to think of thee.\n\n\nMEPHISTOPHELES\n\nShe is judged!\n\n\nVOICE (_from above_)\n\n         She is saved!\n\n\nMEPHISTOPHELES (_to_ FAUST)\n\n                     Hither to me!\n\n(_He disappears with_ FAUST.)\n\n\nVOICE (_from within, dying away_)\n\nHenry! Henry!\n\n[illustration]\n\n[Illustration]", "title": "Faust"}