{"summary": "The story focuses on a family of anthropomorphic rabbits, the widowed mother rabbit cautioning her young against entering a vegetable garden grown by a man named Mr. McGregor, telling them: \"your Father had an accident there; he was put in a pie by Mrs. McGregor\". Whereas her three daughters obediently refrain from entering the garden, going down the lane to pick blackberries, her rebellious son Peter enters the garden to snack on some vegetables. Peter ends up eating more than is good for him and goes looking for parsley to cure his stomach ache. However, Peter is spotted by Mr. McGregor and loses his jacket and shoes while trying to escape. He hides in a watering can in a shed, but then has to run away again when Mr. McGregor finds him, and ends up completely lost. After sneaking past a cat, Peter sees the gate where he entered the garden from a distance and heads for it, despite being spotted and chased by Mr. McGregor again. He finds difficulties in wriggling beneath the gate, but manages to escape the garden, only to spot his abandoned clothing articles being used to dress Mr. McGregor's scarecrow. After returning home, a sick Peter is sent to bed by his mother whereas his well-behaved sisters receive a sumptuous dinner of milk and berries as opposed to Peter's supper of chamomile tea.\n\n", "full_text": "[Illustration]\n\nTHE TALE OF\n\nPETER RABBIT\n\nBY\n\nBEATRIX POTTER\n\n[Illustration]\n\nFREDERICK WARNE\n\n\n\n\nFREDERICK WARNE\n\nFirst published 1902\n\nFrederick Warne & Co., 1902\n\nPrinted and bound in Great Britain by William Clowes Limited, Beccles\nand London\n\n\n\n\n[Illustration]\n\n[Illustration]\n\n\nOnce upon a time there were four little Rabbits, and their names\nwere--\n\n          Flopsy,\n       Mopsy,\n   Cotton-tail,\nand Peter.\n\nThey lived with their Mother in a sand-bank, underneath the root of a\nvery big fir-tree.\n\n'Now my dears,' said old Mrs. Rabbit one morning, 'you may go into\nthe fields or down the lane, but don't go into Mr. McGregor's garden:\nyour Father had an accident there; he was put in a pie by Mrs.\nMcGregor.'\n\n[Illustration]\n\n[Illustration]\n\n'Now run along, and don't get into mischief. I am going out.'\n\nThen old Mrs. Rabbit took a basket and her umbrella, and went through\nthe wood to the baker's. She bought a loaf of brown bread and five\ncurrant buns.\n\n[Illustration]\n\n[Illustration]\n\nFlopsy, Mopsy, and Cottontail, who were good little bunnies, went\ndown the lane to gather blackberries:\n\nBut Peter, who was very naughty, ran straight away to Mr. McGregor's\ngarden, and squeezed under the gate!\n\n[Illustration]\n\n[Illustration]\n\nFirst he ate some lettuces and some French beans; and then he ate\nsome radishes;\n\nAnd then, feeling rather sick, he went to look for some parsley.\n\n[Illustration]\n\n[Illustration]\n\nBut round the end of a cucumber frame, whom should he meet but Mr.\nMcGregor!\n\nMr. McGregor was on his hands and knees planting out young cabbages,\nbut he jumped up and ran after Peter, waving a rake and calling out,\n'Stop thief!'\n\n[Illustration]\n\n[Illustration]\n\nPeter was most dreadfully frightened; he rushed all over the garden,\nfor he had forgotten the way back to the gate.\n\nHe lost one of his shoes among the cabbages, and the other shoe\namongst the potatoes.\n\nAfter losing them, he ran on four legs and went faster, so that I\nthink he might have got away altogether if he had not unfortunately\nrun into a gooseberry net, and got caught by the large buttons on his\njacket. It was a blue jacket with brass buttons, quite new.\n\n[Illustration]\n\n[Illustration]\n\nPeter gave himself up for lost, and shed big tears; but his sobs were\noverheard by some friendly sparrows, who flew to him in great\nexcitement, and implored him to exert himself.\n\nMr. McGregor came up with a sieve, which he intended to pop upon the\ntop of Peter; but Peter wriggled out just in time, leaving his jacket\nbehind him.\n\n[Illustration]\n\n[Illustration]\n\nAnd rushed into the tool-shed, and jumped into a can. It would have\nbeen a beautiful thing to hide in, if it had not had so much water in it.\n\nMr. McGregor was quite sure that Peter was somewhere in the\ntool-shed, perhaps hidden underneath a flower-pot. He began to turn\nthem over carefully, looking under each.\n\nPresently Peter sneezed--'Kertyschoo!' Mr. McGregor was after him in\nno time.\n\n[Illustration]\n\n[Illustration]\n\nAnd tried to put his foot upon Peter, who jumped out of a window,\nupsetting three plants. The window was too small for Mr. McGregor, and\nhe was tired of running after Peter. He went back to his work.\n\nPeter sat down to rest; he was out of breath and trembling with\nfright, and he had not the least idea which way to go. Also he was\nvery damp with sitting in that can.\n\nAfter a time he began to wander about, going lippity--lippity--not\nvery fast, and looking all round.\n\n[Illustration]\n\n[Illustration]\n\nHe found a door in a wall; but it was locked, and there was no room\nfor a fat little rabbit to squeeze underneath.\n\nAn old mouse was running in and out over the stone doorstep, carrying\npeas and beans to her family in the wood. Peter asked her the way to\nthe gate, but she had such a large pea in her mouth that she could not\nanswer. She only shook her head at him. Peter began to cry.\n\nThen he tried to find his way straight across the garden, but he\nbecame more and more puzzled. Presently, he came to a pond where Mr.\nMcGregor filled his water-cans. A white cat was staring at some\ngold-fish, she sat very, very still, but now and then the tip of her\ntail twitched as if it were alive. Peter thought it best to go away\nwithout speaking to her; he had heard about cats from his cousin,\nlittle Benjamin Bunny.\n\n[Illustration]\n\n[Illustration]\n\nHe went back towards the tool-shed, but suddenly, quite close to him,\nhe heard the noise of a hoe--scr-r-ritch, scratch, scratch, scritch.\nPeter scuttered underneath the bushes. But presently, as nothing\nhappened, he came out, and climbed upon a wheelbarrow and peeped over.\nThe first thing he saw was Mr. McGregor hoeing onions. His back was\nturned towards Peter, and beyond him was the gate!\n\nPeter got down very quietly off the wheelbarrow; and started running\nas fast as he could go, along a straight walk behind some\nblack-currant bushes.\n\nMr. McGregor caught sight of him at the corner, but Peter did not\ncare. He slipped underneath the gate, and was safe at last in the wood\noutside the garden.\n\n[Illustration]\n\n[Illustration]\n\nMr. McGregor hung up the little jacket and the shoes for a scare-crow\nto frighten the blackbirds.\n\nPeter never stopped running or looked behind him till he got home to\nthe big fir-tree.\n\nHe was so tired that he flopped down upon the nice soft sand on the\nfloor of the rabbit-hole and shut his eyes. His mother was busy\ncooking; she wondered what he had done with his clothes. It was the\nsecond little jacket and pair of shoes that Peter had lost in a\nfortnight!\n\n[Illustration]\n\nI am sorry to say that Peter was not very well during the evening.\n\nHis mother put him to bed, and made some camomile tea; and she gave a\ndose of it to Peter!\n\n'One table-spoonful to be taken at bed-time.'\n\n[Illustration]\n\n[Illustration]\n\nBut Flopsy, Mopsy, and Cotton-tail had bread and milk and\nblackberries for supper.\n\nTHE END", "title": "The Tale of Peter Rabbit"}