{"summary": "Freud's book covered three main areas: sexual perversions; childhood sexuality; and puberty.\n\nFreud began his first essay, on \"The Sexual Aberrations\", by distinguishing between the sexual object and the sexual aim — noting that deviations from the norm could occur with respect to both. The sexual object is therein defined as a desired object, and the sexual aim as what acts are desired with said object.\nDiscussing the choice of children and animals as sex objects — pedophilia and bestiality — he notes that most people would prefer to limit these perversions to the insane \"on aesthetic grounds\" but that they exist in normal people also. He also explores deviations of sexual aims, as in the tendency to linger over preparatory sexual aspects such as looking and touching.\nTurning to neurotics, Freud emphasised that \"in them tendencies to every kind of perversion can be shown to exist as unconscious forces...neurosis is, as it were, the negative of perversion\". Freud also makes the point that people who are behaviorally abnormal are always sexually abnormal in his experience but that many people who are normal behaviorally otherwise are sexually abnormal also.\nFreud concluded that \"a disposition to perversions is an original and universal disposition of the human sexual instinct and that...this postulated constitution, containing the germs of all the perversions, will only be demonstrable in children“.\n\nHis second essay, on \"Infantile Sexuality\", argues that children have sexual urges, from which adult sexuality only gradually emerges via psychosexual development.\nLooking at children, Freud identified many forms of infantile sexual emotions, including thumb sucking, autoeroticism, and sibling rivalry.\n\nIn his third essay, \"The Transformations of Puberty\" Freud formalised the distinction between the 'fore-pleasures' of infantile sexuality and the 'end-pleasure' of sexual intercourse.\nHe also demonstrated how the adolescent years consolidate sexual identity under the dominance of the genitals.\n\nFreud sought to link to his theory of the unconscious put forward in The Interpretation of Dreams (1899) and his work on hysteria by positing sexuality as the driving force of both neuroses (through repression) and perversion.\nIn its final version, the \"Three Essays\" also included the concepts of penis envy, castration anxiety, and the Oedipus complex.\n\n", "full_text": "NERVOUS AND MENTAL DISEASE MONOGRAPH SERIES NO. 7\n\nTHREE CONTRIBUTIONS TO THE THEORY OF SEX\n\n_SECOND EDITION_\n_SECOND REPRINTING_\n\nBY\n\nPROF. SIGMUND FREUD, LL.D.\nVIENNA\n\nAUTHORIZED TRANSLATION BY\n\nA.A. BRILL, PH.B., M.D.\nCLINICAL ASSISTANT, DEPARTMENT OF PSYCHIATRY AND NEUROLOGY, COLUMBIA\nUNIVERSITY; ASSISTANT IN MENTAL DISEASES, BELLEVUE HOSPITAL; ASSISTANT\nVISITING PHYSICIAN, HOSPITAL FOR NERVOUS DISEASES\n\nWITH INTRODUCTION BY\n\nJAMES J. PUTNAM, M.D.\n\nNERVOUS AND MENTAL DISEASE PUBLISHING CO.\nNEW YORK AND WASHINGTON\n1920\n\n\n\n\nNERVOUS AND MENTAL DISEASE MONOGRAPH SERIES\n\nEdited by\n\nDrs. SMITH ELY JELLIFFE and WM. A. WHITE\n\nNumbers Issued\n\n1. Outlines of Psychiatry. (7th Edition.) $3.00. By Dr. William A.\n     White.\n2. Studies in Paranoia. (Out of Print.) By Drs. N. Gierlich and M.\n     Friedman.\n3. The Psychology of Dementia Praecox. (Out of Print.) By Dr. C.G. Jung.\n4. Selected Papers on Hysteria and other Psychoneuroses. (3d Edition.)\n     $3.00. By Prof. Sigmund Freud.\n5. The Wassermann Serum Diagnosis in Psychiatry. $2.00. By Dr. Felix\n     Plaut.\n6. Epidemic Poliomyelitis. New York, 1907. (Out of Print.)\n7. Three Contributions to Sexual Theory. (3d Edition.) $2.00. By Prof.\n     Sigmund Freud.\n8. Mental Mechanisms. (Out of Print.) $2.00. By Dr. Wm. A. White.\n9. Studies in Psychiatry. $2.00. New York Psychiatrical Society.\n10. Handbook of Mental Examination Methods. $2.00. (Out of Print.) By\n     Shepherd Ivory Franz.\n11. The Theory of Schizophrenic Negativism. $1.00. By Professor E.\n     Bleuler.\n12. Cerebellar Functions. $3.00. By Dr. Andre-Thomas.\n13. History of Prison Psychoses. $1.25. By Drs. P. Nitsche and K.\n     Wilmanns.\n14. General Paresis. $3.00. By Prof. E. Kraepelin.\n15. Dreams and Myths. $1.00. By Dr. Karl Abraham.\n16. Poliomyelitis. $3.00. By Dr. I. Wickmann.\n17. Freud's Theories of the Neuroses. $2.00. By Dr. E. Hitschmann.\n18. The Myth of the Birth of the Hero. $1.00. By Dr. Otto Rank.\n19. The Theory of Psychoanalysis. $1.50. (Out of Print.) By Dr. C.G.\n     Jung.\n20. Vagotonia. $1.00. (3d Edition.) By Drs. Eppinger and Hess.\n21. Wishfulfillment and Symbolism in Fairy Tales. $1.00. By Dr. Ricklin.\n22. The Dream Problem. $1.00. By Dr. A.E. Maeder.\n23. The Significance of Psychoanalysis for the Mental Sciences. $1.50.\n     By Drs. O. Rank and D.H. Sachs.\n24. Organ Inferiority and its Psychical Compensation. $1.50. By Dr.\n     Alfred Adler.\n25. The History of the Psychoanalytic Movement. $1.00. By Prof. S.\n     Freud.\n26. Technique of Psychoanalysis. $2.00. By Dr. Smith Ely Jelliffe.\n27. Vegetative Neurology. $2.00. By Dr. H. Higier.\n28. The Autonomic Functions and the Personality. $2.00. By Dr. Edward J.\n     Kemp.\n29. A Study of the Mental Life of the Child, $2.00. By Dr. H. Von\n     Hug-Hellmuth.\n30. Internal Secretions and the Nervous System. $1.00. By Dr. M. Laignel\n     Lavastine.\n31. Sleep Walking and Moon Walking. $2.00. By Dr. J. Sadger.\n\nNERVOUS AND MENTAL DISEASE PUBLISHING COMPANY 3617 10th St. N.W.,\nWashington, D.C.\n\n\n\n\nTABLE OF CONTENTS\n\n                                                             PAGE\nINTRODUCTION TO TRANSLATION                                     v\nAUTHOR'S PREFACE TO THE SECOND EDITION                         ix\nAUTHOR'S PREFACE TO THE THIRD EDITION                           x\n  I. THE SEXUAL ABERRATIONS                                     1\n II. THE INFANTILE SEXUALITY                                   36\nIII. THE TRANSFORMATION OF PUBERTY                             68\n\n\n\n\nINTRODUCTION TO TRANSLATION\n\n\nThe somewhat famous \"Three Essays,\" which Dr. Brill is here bringing to\nthe attention of an English-reading public, occupy--brief as they\nare--an important position among the achievements of their author, a\ngreat investigator and pioneer in an important line. It is not claimed\nthat the facts here gathered are altogether new. The subject of the\nsexual instinct and its aberrations has long been before the scientific\nworld and the names of many effective toilers in this vast field are\nknown to every student. When one passes beyond the strict domains of\nscience and considers what is reported of the sexual life in folkways\nand art-lore and the history of primitive culture and in romance, the\nsources of information are immense. Freud has made considerable\nadditions to this stock of knowledge, but he has done also something of\nfar greater consequence than this. He has worked out, with incredible\npenetration, the part which this instinct plays in every phase of human\nlife and in the development of human character, and has been able to\nestablish on a firm footing the remarkable thesis that psychoneurotic\nillnesses never occur with a perfectly normal sexual life. Other sorts\nof emotions contribute to the result, but some aberration of the sexual\nlife is always present, as the cause of especially insistent emotions\nand repressions.\n\nThe instincts with which every child is born furnish desires or cravings\nwhich must be dealt with in some fashion. They may be refined\n(\"sublimated\"), so far as is necessary and desirable, into energies of\nother sorts--as happens readily with the play-instinct--or they may\nremain as the source of perversions and inversions, and of cravings of\nnew sorts substituted for those of the more primitive kinds under the\npressure of a conventional civilization. The symptoms of the functional\npsychoneuroses represent, after a fashion, some of these distorted\nattempts to find a substitute for the imperative cravings born of the\nsexual instincts, and their form often depends, in part at least, on the\npeculiarities of the sexual life in infancy and early childhood. It is\nFreud's service to have investigated this inadequately chronicled period\nof existence with extraordinary acumen. In so doing he made it plain\nthat the \"perversions\" and \"inversions,\" which reappear later under such\nstriking shapes, belong to the normal sexual life of the young child and\nare seen, in veiled forms, in almost every case of nervous illness.\n\nIt cannot too often be repeated that these discoveries represent no\nfanciful deductions, but are the outcome of rigidly careful observations\nwhich any one who will sufficiently prepare himself can verify. Critics\nfret over the amount of \"sexuality\" that Freud finds evidence of in the\nhistories of his patients, and assume that he puts it there. But such\ncriticisms are evidences of misunderstandings and proofs of ignorance.\n\nFreud had learned that the amnesias of hypnosis and of hysteria were not\nabsolute but relative and that in covering the lost memories, much more,\nof unexpected sort, was often found. Others, too, had gone as far as\nthis, and stopped. But this investigator determined that nothing but the\nabsolute impossibility of going further should make him cease from\nurging his patients into an inexorable scrutiny of the unconscious\nregions of their memories and thoughts, such as never had been made\nbefore. Every species of forgetfulness, even the forgetfulness of\nchildhood's years, was made to yield its hidden stores of knowledge;\ndreams, even though apparently absurd, were found to be interpreters of\na varied class of thoughts, active, although repressed as out of harmony\nwith the selected life of consciousness; layer after layer, new sets of\nmotives underlying motives were laid bare, and each patient's interest\nwas strongly enlisted in the task of learning to know himself in order\nmore truly and wisely to \"sublimate\" himself. Gradually other workers\njoined patiently in this laborious undertaking, which now stands, for\nthose who have taken pains to comprehend it, as by far the most\nimportant movement in psychopathology.\n\nIt must, however, be recognized that these essays, of which Dr. Brill\nhas given a translation that cannot but be timely, concern a subject\nwhich is not only important but unpopular. Few physicians read the works\nof v. Krafft-Ebing, Magnus Hirschfeld, Moll, and others of like sort.\nThe remarkable volumes of Havelock Ellis were refused publication in his\nnative England. The sentiments which inspired this hostile attitude\ntowards the study of the sexual life are still active, though growing\nsteadily less common. One may easily believe that if the facts which\nFreud's truth-seeking researches forced him to recognize and to publish\nhad not been of an unpopular sort, his rich and abundant contributions\nto observational psychology, to the significance of dreams, to the\netiology and therapeutics of the psychoneuroses, to the interpretation\nof mythology, would have won for him, by universal acclaim, the same\nrecognition among all physicians that he has received from a rapidly\nincreasing band of followers and colleagues.\n\nMay Dr. Brill's translation help toward this end.\n\nThere are two further points on which some comments should be made. The\nfirst is this, that those who conscientiously desire to learn all that\nthey can from Freud's remarkable contributions should not be content to\nread any one of them alone. His various publications, such as \"The\nSelected Papers on Hysteria and Other Psychoneuroses,\"[1] \"The\nInterpretation of Dreams,\"[2] \"The Psychopathology of Everyday Life,\"[3]\n\"Wit and its Relation to the Unconscious,\"[4] the analysis of the case\nof the little boy called Hans, the study of Leonardo da Vinci,[4a] and\nthe various short essays in the four Sammlungen kleiner Schriften, not\nonly all hang together, but supplement each other to a remarkable\nextent. Unless a course of study such as this is undertaken many critics\nmay think various statements and inferences in this volume to be far\nfetched or find them too obscure for comprehension.\n\nThe other point is the following: One frequently hears the\npsychoanalytic method referred to as if it was customary for those\npracticing it to exploit the sexual experiences of their patients and\nnothing more, and the insistence on the details of the sexual life,\npresented in this book, is likely to emphasize that notion. But the fact\nis, as every thoughtful inquirer is aware, that the whole progress of\ncivilization, whether in the individual or the race, consists largely in\na \"sublimation\" of infantile instincts, and especially certain portions\nof the sexual instinct, to other ends than those which they seemed\ndesigned to serve. Art and poetry are fed on this fuel and the evolution\nof character and mental force is largely of the same origin. All the\nforms which this sublimation, or the abortive attempts at sublimation,\nmay take in any given case, should come out in the course of a thorough\npsychoanalysis. It is not the sexual life alone, but every interest and\nevery motive, that must be inquired into by the physician who is seeking\nto obtain all the data about the patient, necessary for his reeducation\nand his cure. But all the thoughts and emotions and desires and motives\nwhich appear in the man or woman of adult years were once crudely\nrepresented in the obscure instincts of the infant, and among these\ninstincts those which were concerned directly or indirectly with the\nsexual emotions, in a wide sense, are certain to be found in every case\nto have been the most important for the end-result.\n\n                                                      JAMES J. PUTNAM.\n\nBOSTON, August 23, 1910.\n\n[1] Translated by A.A. Brill, NERVOUS AND MENTAL DISEASE MONOGRAPH\nSERIES, NO. 4.\n\n[2] Translated by A.A. Brill, The Macmillan Co., New York, and Allen &\nUnwin, London.\n\n[3] Translated by A.A. Brill, The Macmillan Co., New York.\n\n[4] Translated by A.A. Brill, Moffatt, Yard & Co., New York.\n\n[4a] Translated by A.A. Brill, Moffatt, Yard & Co., New York.\n\n\n\n\nAUTHOR'S PREFACE TO THE SECOND EDITION\n\n\nAlthough the author is fully aware of the gaps and obscurities contained\nin this small volume, he has, nevertheless, resisted a temptation to add\nto it the results obtained from the investigations of the last five\nyears, fearing that thus its unified and documentary character would be\ndestroyed. He accordingly reproduces the original text with but slight\nmodifications, contenting himself with the addition of a few footnotes.\nFor the rest, it is his ardent wish that this book may speedily become\nantiquated--to the end that the new material brought forward in it may\nbe universally accepted, while the shortcomings it displays may give\nplace to juster views.\n\nVIENNA, December, 1909.\n\n\n\n\nAUTHOR'S PREFACE TO THE THIRD EDITION\n\n\nAfter watching for ten years the reception accorded to this book and the\neffect it has produced, I wish to provide the third edition of it with\nsome prefatory remarks dealing with the misunderstandings of the book\nand the demands, insusceptible of fulfillment, made against it. Let me\nemphasize in the first place that whatever is here presented is derived\nentirely from every-day medical experience which is to be made more\nprofound and scientifically important through the results of\npsychoanalytic investigation. The \"Three Contributions to the Theory of\nSex\" can contain nothing except what psychoanalysis obliges them to\naccept or what it succeeds in corroborating. It is therefore excluded\nthat they should ever be developed into a \"theory of sex,\" and it is\nalso quite intelligible that they will assume no attitude at all towards\nsome important problems of the sexual life. This should not however give\nthe impression that these omitted chapters of the great theme were\nunfamiliar to the author, or that they were neglected by him as\nsomething of secondary importance.\n\nThe dependence of this work on the psychoanalytic experiences which have\ndetermined the writing of it, shows itself not only in the selection but\nalso in the arrangement of the material. A certain succession of stages\nwas observed, the occasional factors are rendered prominent, the\nconstitutional ones are left in the background, and the ontogenetic\ndevelopment receives greater consideration than the phylogenetic. For\nthe occasional factors play the principal role in analysis, and are\nalmost completely worked up in it, while the constitutional factors only\nbecome evident from behind as elements which have been made functional\nthrough experience, and a discussion of these would lead far beyond the\nworking sphere of psychoanalysis.\n\nA similar connection determines the relation between ontogenesis and\nphylogenesis. Ontogenesis may be considered as a repetition of\nphylogenesis insofar as the latter has not been varied by a more recent\nexperience. The phylogenetic disposition makes itself visible behind the\nontogenetic process. But fundamentally the constitution is really the\nprecipitate of a former experience of the species to which the newer\nexperience of the individual being is added as the sum of the occasional\nfactors.\n\nBeside its thoroughgoing dependence on psychoanalytic investigation I\nmust emphasize as a character of this work of mine its intentional\nindependence of biological investigation. I have carefully avoided the\ninclusion of the results of scientific investigation in general sex\nbiology or of particular species of animals in this study of human\nsexual functions which is made possible by the technique of\npsychoanalysis. My aim was indeed to find out how much of the biology of\nthe sexual life of man can be discovered by means of psychological\ninvestigation; I was able to point to additions and agreements which\nresulted from this examination, but I did not have to become confused if\nthe psychoanalytic methods led in some points to views and results which\ndeviated considerably from those merely based on biology.\n\nI have added many passages in this edition, but I have abstained from\ncalling attention to them, as in former editions, by special marks. The\nscientific work in our sphere has at present been retarded in its\nprogress, nevertheless some supplements to this work were indispensable\nif it was to remain in touch with our newer psychoanalytic literature.\n\nVIENNA, October, 1914.\n\n\n\n\nI\n\nTHE SEXUAL ABERRATIONS[1]\n\n\nThe fact of sexual need in man and animal is expressed in biology by the\nassumption of a \"sexual impulse.\" This impulse is made analogous to the\nimpulse of taking nourishment, and to hunger. The sexual expression\ncorresponding to hunger not being found colloquilly, science uses the\nexpression \"libido.\"[2]\n\nPopular conception makes definite assumptions concerning the nature and\nqualities of this sexual impulse. It is supposed to be absent during\nchildhood and to commence about the time of and in connection with the\nmaturing process of puberty; it is supposed that it manifests itself in\nirresistible attractions exerted by one sex upon the other, and that its\naim is sexual union or at least such actions as would lead to union.\n\nBut we have every reason to see in these assumptions a very\nuntrustworthy picture of reality. On closer examination they are found\nto abound in errors, inaccuracies and hasty conclusions.\n\nIf we introduce two terms and call the person from whom the sexual\nattraction emanates the _sexual object_, and the action towards which\nthe impulse strives the _sexual aim_, then the scientifically examined\nexperience shows us many deviations in reference to both sexual object\nand sexual aim, the relations of which to the accepted standard require\nthorough investigation.\n\n\n1. DEVIATION IN REFERENCE TO THE SEXUAL OBJECT\n\nThe popular theory of the sexual impulse corresponds closely to the\npoetic fable of dividing the person into two halves--man and woman--who\nstrive to become reunited through love. It is therefore very surprising\nto hear that there are men for whom the sexual object is not woman but\nman, and that there are women for whom it is not man but woman. Such\n_persons_ are called contrary sexuals, or better, inverts; the\n_condition_, that of inversion. The number of such individuals is\nconsiderable though difficult of accurate determination.[3]\n\n\nA. _Inversion_\n\n*The Behavior of Inverts.*--The above-mentioned persons behave in many\nways quite differently.\n\n(_a_) They are absolutely inverted; _i.e._, their sexual object must be\nalways of the same sex, while the opposite sex can never be to them an\nobject of sexual longing, but leaves them indifferent or may even evoke\nsexual repugnance. As men they are unable, on account of this\nrepugnance, to perform the normal sexual act or miss all pleasure in its\nperformance.\n\n(_b_) They are amphigenously inverted (psychosexually hermaphroditic);\n_i.e._, their sexual object may belong indifferently to either the same\nor to the other sex. The inversion lacks the character of exclusiveness.\n\n(_c_) They are occasionally inverted; _i.e._, under certain external\nconditions, chief among which are the inaccessibility of the normal\nsexual object and initiation, they are able to take as the sexual\nobject a person of the same sex and thus find sexual gratification.\n\nThe inverted also manifest a manifold behavior in their judgment about\nthe peculiarities of their sexual impulse. Some take the inversion as a\nmatter of course, just as the normal person does regarding his libido,\nfirmly demanding the same rights as the normal. Others, however, strive\nagainst the fact of their inversion and perceive in it a morbid\ncompulsion.[4]\n\nOther variations concern the relations of time. The characteristics of\nthe inversion in any individual may date back as far as his memory goes,\nor they may become manifest to him at a definite period before or after\npuberty.[5] The character is either retained throughout life, or it\noccasionally recedes or represents an episode on the road to normal\ndevelopment. A periodical fluctuation between the normal and the\ninverted sexual object has also been observed. Of special interest are\nthose cases in which the libido changes, taking on the character of\ninversion after a painful experience with the normal sexual object.\n\nThese different categories of variation generally exist independently of\none another. In the most extreme cases it can regularly be assumed that\nthe inversion has existed at all times and that the person feels\ncontented with his peculiar state.\n\nMany authors will hesitate to gather into a unit all the cases\nenumerated here and will prefer to emphasize the differences rather than\nthe common characters of these groups, a view which corresponds with\ntheir preferred judgment of inversions. But no matter what divisions may\nbe set up, it cannot be overlooked that all transitions are abundantly\nmet with, so that the formation of a series would seem to impose itself.\n\n*Conception of Inversion.*--The first attention bestowed upon inversion\ngave rise to the conception that it was a congenital sign of nervous\ndegeneration. This harmonized with the fact that doctors first met it\namong the nervous, or among persons giving such an impression. There are\ntwo elements which should be considered independently in this\nconception: the congenitality, and the degeneration.\n\n*Degeneration.*--This term _degeneration_ is open to the objections\nwhich may be urged against the promiscuous use of this word in general.\nIt has in fact become customary to designate all morbid manifestations\nnot of traumatic or infectious origin as degenerative. Indeed, Magnan's\nclassification of degenerates makes it possible that the highest general\nconfiguration of nervous accomplishment need not exclude the application\nof the concept of degeneration. Under the circumstances, it is a\nquestion what use and what new content the judgment of \"degeneration\"\nstill possesses. It would seem more appropriate not to speak of\ndegeneration: (1) Where there are not many marked deviations from the\nnormal; (2) where the capacity for working and living do not in general\nappear markedly impaired.[6]\n\nThat the inverted are not degenerates in this qualified sense can be\nseen from the following facts:\n\n1. The inversion is found among persons who otherwise show no marked\ndeviation from the normal.\n\n2. It is found also among persons whose capabilities are not disturbed,\nwho on the contrary are distinguished by especially high intellectual\ndevelopment and ethical culture.[7]\n\n3. If one disregards the patients of one's own practice and strives to\ncomprehend a wider field of experience, he will in two directions\nencounter facts which will prevent him from assuming inversions as a\ndegenerative sign.\n\n(_a_) It must be considered that inversion was a frequent manifestation\namong the ancient nations at the height of their culture. It was an\ninstitution endowed with important functions. (_b_) It is found to be\nunusually prevalent among savages and primitive races, whereas the term\ndegeneration is generally limited to higher civilization (I. Bloch).\nEven among the most civilized nations of Europe, climate and race have a\nmost powerful influence on the distribution of, and attitude toward,\ninversion.[8]\n\n*Innateness.*--Only for the first and most extreme class of inverts, as\ncan be imagined, has innateness been claimed, and this from their own\nassurance that at no time in their life has their sexual impulse\nfollowed a different course. The fact of the existence of two other\nclasses, especially of the third, is difficult to reconcile with the\nassumption of its being congenital. Hence, the propensity of those\nholding this view to separate the group of absolute inverts from the\nothers results in the abandonment of the general conception of\ninversion. Accordingly in a number of cases the inversion would be of a\ncongenital character, while in others it might originate from other\ncauses.\n\nIn contradistinction to this conception is that which assumes inversion\nto be an _acquired_ character of the sexual impulse. It is based on the\nfollowing facts. (1) In many inverts (even absolute ones) an early\naffective sexual impression can be demonstrated, as a result of which\nthe homosexual inclination developed. (2) In many others outer\ninfluences of a promoting and inhibiting nature can be demonstrated,\nwhich in earlier or later life led to a fixation of the inversion--among\nwhich are exclusive relations with the same sex, companionship in war,\ndetention in prison, dangers of hetero-sexual intercourse, celibacy,\nsexual weakness, etc. (3) Hypnotic suggestion may remove the inversion,\nwhich would be surprising in that of a congenital character.\n\nIn view of all this, the existence of congenital inversion can certainly\nbe questioned. The objection may be made to it that a more accurate\nexamination of those claimed to be congenitally inverted will probably\nshow that the direction of the libido was determined by a definite\nexperience of early childhood, which has not been retained in the\nconscious memory of the person, but which can be brought back to memory\nby proper influences (Havelock Ellis). According to that author\ninversion can be designated only as a frequent variation of the sexual\nimpulse which may be determined by a number of external circumstances of\nlife.\n\nThe apparent certainty thus reached is, however, overthrown by the\nretort that manifestly there are many persons who have experienced even\nin their early youth those very sexual influences, such as seduction,\nmutual onanism, without becoming inverts, or without constantly\nremaining so. Hence, one is forced to assume that the alternatives\ncongenital and acquired are either incomplete or do not cover the\ncircumstances present in inversions.\n\n*Explanation of Inversion.*--The nature of inversion is explained\nneither by the assumption that it is congenital nor that it is acquired.\nIn the first case, we need to be told what there is in it of the\ncongenital, unless we are satisfied with the roughest explanation,\nnamely, that a person brings along a congenital sexual impulse connected\nwith a definite sexual object. In the second case it is a question\nwhether the manifold accidental influences suffice to explain the\nacquisition unless there is something in the individual to meet them\nhalf way. The negation of this last factor is inadmissible according to\nour former conclusions.\n\n*The Relation of Bisexuality.*--Since the time of Frank Lydston,\nKiernan, and Chevalier, a new series of ideas has been introduced for\nthe explanation of the possibility of sexual inversion. This contains a\nnew contradiction to the popular belief which assumes that a human being\nis either a man or a woman. Science shows cases in which the sexual\ncharacteristics appear blurred and thus the sexual distinction is made\ndifficult, especially on an anatomical basis. The genitals of such\npersons unite the male and female characteristics (hermaphroditism). In\nrare cases both parts of the sexual apparatus are well developed (true\nhermaphroditism), but usually both are stunted.[9]\n\nThe importance of these abnormalities lies in the fact that they\nunexpectedly facilitate the understanding of the normal formation. A\ncertain degree of anatomical hermaphroditism really belongs to the\nnormal. In no normally formed male or female are traces of the apparatus\nof the other sex lacking; these either continue functionless as\nrudimentary organs, or they are transformed for the purpose of assuming\nother functions.\n\nThe conception which we gather from this long known anatomical fact is\nthe original predisposition to bisexuality, which in the course of\ndevelopment has changed to monosexuality, leaving slight remnants of the\nstunted sex.\n\nIt was natural to transfer this conception to the psychic sphere and to\nconceive the inversion in its aberrations as an expression of psychic\nhermaphroditism. In order to bring the question to a decision, it was\nonly necessary to have one other circumstance, viz., a regular\nconcurrence of the inversion with the psychic and somatic signs of\nhermaphroditism.\n\nBut this second expectation was not realized. The relations between the\nassumed psychical and the demonstrable anatomical androgyny should never\nbe conceived as being so close. There is frequently found in the\ninverted a diminution of the sexual impulse (H. Ellis) and a slight\nanatomical stunting of the organs. This, however, is found frequently\nbut by no means regularly or preponderately. Thus we must recognize that\ninversion and somatic hermaphroditism are totally independent of each\nother.\n\nGreat importance has also been attached to the so-called secondary and\ntertiary sex characters and their aggregate occurrence in the inverted\nhas been emphasized (H. Ellis). There is much truth in this but it\nshould not be forgotten that the secondary and tertiary sex\ncharacteristics very frequently manifest themselves in the other sex,\nthus indicating androgyny without, however, involving changes in the\nsexual object in the sense of an inversion.\n\nPsychic hermaphroditism would gain in substantiality if parallel with\nthe inversion of the sexual object there should be at least a change in\nthe other psychic qualities, such as in the impulses and distinguishing\ntraits characteristic of the other sex. But such inversion of character\ncan be expected with some regularity only in inverted women; in men the\nmost perfect psychic manliness may be united with the inversion. If one\nfirmly adheres to the hypothesis of a psychic hermaphroditism, one must\nadd that in certain spheres its manifestations allow the recognition of\nonly a very slight contrary determination. The same also holds true in\nthe somatic androgyny. According to Halban, the appearance of individual\nstunted organs and secondary sex characters are quite independent of\neach other.[10]\n\nA spokesman of the masculine inverts stated the bisexual theory in its\ncrudest form in the following words: \"It is a female brain in a male\nbody.\" But we do not know the characteristics of a \"female brain.\" The\nsubstitution of the anatomical for the psychological is as frivolous as\nit is unjustified. The tentative explanation by v. Krafft-Ebing seems to\nbe more precisely formulated than that of Ulrich but does not\nessentially differ from it. v. Krafft-Ebing thinks that the bisexual\npredisposition gives to the individual male and female brain centers as\nwell as somatic sexual organs. These centers develop first towards\npuberty mostly under the influence of the independent sex glands. We\ncan, however, say the same of the male and female \"centers\" as of the\nmale and female brains; and, moreover, we do not even know whether we\ncan assume for the sexual functions separate brain locations (\"centers\")\nsuch as we may assume for language.\n\nAfter this discussion, two notions, at all events, persist; first, that\na bisexual predisposition is to be presumed for the inversion also, only\nwe do not know of what it consists beyond the anatomical formations;\nand, second, that we are dealing with disturbances which are experienced\nby the sexual impulse during its development.[11]\n\n*The Sexual Object of Inverts.*--The theory of psychic hermaphroditism\npresupposed that the sexual object of the inverted is the reverse of the\nnormal. The inverted man, like the woman, succumbs to the charms\nemanating from manly qualities of body and mind; he feels himself like a\nwoman and seeks a man.\n\nBut however true this may be for a great number of inverts, it by no\nmeans indicates the general character of inversion. There is no doubt\nthat a great part of the male inverted have retained the psychic\ncharacter of virility, that proportionately they show but little of the\nsecondary characters of the other sex, and that they really look for\nreal feminine psychic features in their sexual object. If that were not\nso it would be incomprehensible why masculine prostitution, in offering\nitself to inverts, copies in all its exterior, to-day as in antiquity,\nthe dress and attitudes of woman. This imitation would otherwise be an\ninsult to the ideal of the inverts. Among the Greeks, where the most\nmanly men were found among inverts, it is quite obvious that it was not\nthe masculine character of the boy which kindled the love of man, but it\nwas his physical resemblance to woman as well as his feminine psychic\nqualities, such as shyness, demureness, and the need of instruction and\nhelp. As soon as the boy himself became a man he ceased to be a sexual\nobject for men and in turn became a lover of boys. The sexual object in\nthis case as in many others is therefore not of the like sex, but it\nunites both sex characters, a compromise between the impulses striving\nfor the man and for the woman, but firmly conditioned by the masculinity\nof body (the genitals).[12]\n\nThe conditions in the woman are more definite; here the active inverts,\nwith special frequency, show the somatic and psychic characters of man\nand desire femininity in their sexual object; though even here greater\nvariation will be found on more intimate investigation.\n\n*The Sexual Aim of Inverts.*--The important fact to bear in mind is that\nno uniformity of the sexual aim can be attributed to inversion.\nIntercourse per anum in men by no means goes with inversion;\nmasturbation is just as frequently the exclusive aim; and the limitation\nof the sexual aim to mere effusion of feelings is here even more\nfrequent than in hetero-sexual love. In women, too, the sexual aims of\nthe inverted are manifold, among which contact with the mucous membrane\nof the mouth seems to be preferred.\n\n*Conclusion.*--Though from the material on hand we are by no means in a\nposition satisfactorily to explain the origin of inversion, we can say\nthat through this investigation we have obtained an insight which can\nbecome of greater significance to us than the solution of the above\nproblem. Our attention is called to the fact that we have assumed a too\nclose connection between the sexual impulse and the sexual object. The\nexperience gained from the so called abnormal cases teaches us that a\nconnection exists between the sexual impulse and the sexual object which\nwe are in danger of overlooking in the uniformity of normal states where\nthe impulse seems to bring with it the object. We are thus instructed to\nseparate this connection between the impulse and the object. The sexual\nimpulse is probably entirely independent of its object and is not\noriginated by the stimuli proceeding from the object.\n\n\nB. _The Sexually Immature and Animals as Sexual Objects_\n\nWhereas those sexual inverts whose sexual object does not belong to the\nnormally adapted sex, appear to the observer as a collective number of\nperhaps otherwise normal individuals, the persons who choose for their\nsexual object the sexually immature (children) are apparently from the\nfirst sporadic aberrations. Only exceptionally are children the\nexclusive sexual objects. They are mostly drawn into this role by a\nfaint-hearted and impotent individual who makes use of such substitutes,\nor when an impulsive urgent desire cannot at the time secure the proper\nobject. Still it throws some light on the nature of the sexual impulse,\nthat it should suffer such great variation and depreciation of its\nobject, a thing which hunger, adhering more energetically to its object,\nwould allow only in the most extreme cases. The same may be said of\nsexual relations with animals--a thing not at all rare among\nfarmers--where the sexual attraction goes beyond the limits of the\nspecies.\n\nFor esthetic reasons one would fain attribute this and other excessive\naberrations of the sexual impulse to the insane, but this cannot be\ndone. Experience teaches that among the latter no disturbances of the\nsexual impulse can be found other than those observed among the sane, or\namong whole races and classes. Thus we find with gruesome frequency\nsexual abuse of children by teachers and servants merely because they\nhave the best opportunities for it. The insane present the aforesaid\naberration only in a somewhat intensified form; or what is of special\nsignificance is the fact that the aberration becomes exclusive and takes\nthe place of the normal sexual gratification.\n\nThis very remarkable relation of sexual variations ranging from the\nnormal to the insane gives material for reflection. It seems to me that\nthe fact to be explained would show that the impulses of the sexual life\nbelong to those which even normally are most poorly controlled by the\nhigher psychic activities. He who is in any way psychically abnormal, be\nit in social or ethical conditions, is, according to my experience,\nregularly so in his sexual life. But many are abnormal in their sexual\nlife who in every other respect correspond to the average; they have\nfollowed the human cultural development, but sexuality remained as their\nweak point.\n\nAs a general result of these discussions we come to see that, under\nnumerous conditions and among a surprising number of individuals, the\nnature and value of the sexual object steps into the background. There\nis something else in the sexual impulse which is the essential and\nconstant.[13]\n\n\n2. DEVIATION IN REFERENCE TO THE SEXUAL AIM\n\nThe union of the genitals in the characteristic act of copulation is\ntaken as the normal sexual aim. It serves to loosen the sexual tension\nand temporarily to quench the sexual desire (gratification analogous to\nsatisfaction of hunger). Yet even in the most normal sexual process\nthose additions are distinguishable, the development of which leads to\nthe aberrations described as _perversions_. Thus certain intermediary\nrelations to the sexual object connected with copulation, such as\ntouching and looking, are recognized as preliminary to the sexual aim.\nThese activities are on the one hand themselves connected with pleasure\nand on the other hand they enhance the excitement which persists until\nthe definite sexual aim is reached. One definite kind of contiguity,\nconsisting of mutual approximation of the mucous membranes of the lips\nin the form of a kiss, has received among the most civilized nations a\nsexual value, though the parts of the body concerned do not belong to\nthe sexual apparatus but form the entrance to the digestive tract. This\ntherefore supplies the factors which allow us to bring the perversions\ninto relation with the normal sexual life, and which are available also\nfor their classification. The perversions are either (_a_) anatomical\n_transgressions_ of the bodily regions destined for sexual union, or (_b_)\na _lingering_ at the intermediary relations to the sexual object which\nshould normally be rapidly passed on the way to the definite sexual aim.\n\n\n(_a_) _Anatomical Transgression_\n\n*Overestimation of the Sexual Object.*--The psychic estimation in which\nthe sexual object as a goal of the sexual impulse shares is only in the\nrarest cases limited to the genitals; generally it embraces the whole\nbody and tends to include all sensations emanating from the sexual\nobject. The same overestimation spreads over the psychic sphere and\nmanifests itself as a logical blinding (diminished judgment) in the face\nof the psychic attainments and perfections of the sexual object, as well\nas a blind obedience to the judgments issuing from the latter. The full\nfaith of love thus becomes an important, if not the primordial source of\nauthority.[14]\n\nIt is this sexual overvaluation, which so ill agrees with the\nrestriction of the sexual aim to the union of the genitals only, that\nassists other parts of the body to participate as sexual aims.[15] In\nthe development of this most manifold anatomical overestimation there is\nan unmistakable desire towards variation, a thing denominated by Hoche\nas \"excitement-hunger\" (Reiz-hunger).[16]\n\n*Sexual Utilization of the Mucous Membrane of the Lips and Mouth.*--The\nsignificance of the factor of sexual overestimation can be best studied\nin the man, in whom alone the sexual life is accessible to\ninvestigation, whereas in the woman it is veiled in impenetrable\ndarkness, partly in consequence of cultural stunting and partly on\naccount of the conventional reticence and dishonesty of women.\n\nThe employment of the mouth as a sexual organ is considered as a\nperversion if the lips (tongue) of the one are brought into contact with\nthe genitals of the other, but not when the mucous membrane of the lips\nof both touch each other. In the latter exception we find the connection\nwith the normal. He who abhors the former as perversions, though these\nsince antiquity have been common practices among mankind, yields to a\ndistinct _feeling of loathing_ which protects him from adopting such\nsexual aims. The limit of such loathing is frequently purely\nconventional; he who kisses fervently the lips of a pretty girl will\nperhaps be able to use her tooth brush only with a sense of loathing,\nthough there is no reason to assume that his own oral cavity for which\nhe entertains no loathing is cleaner than that of the girl. Our\nattention is here called to the factor of loathing which stands in the\nway of the libidinous overestimation of the sexual aim, but which may\nin turn be vanquished by the libido. In the loathing we may observe one\nof the forces which have brought about the restrictions of the sexual\naim. As a rule these forces halt at the genitals; there is, however, no\ndoubt that even the genitals of the other sex themselves may be an\nobject of loathing. Such behavior is characteristic of all hysterics,\nespecially women. The force of the sexual impulse prefers to occupy\nitself with the overcoming of this loathing (see below).\n\n*Sexual Utilization of the Anal Opening.*--It is even more obvious than\nin the former case that it is the loathing which stamps as a perversion\nthe use of the anus as a sexual aim. But it should not be interpreted as\nespousing a cause when I observe that the basis of this\nloathing--namely, that this part of the body serves for the excretion\nand comes in contact with the loathsome excrement--is not more plausible\nthan the basis which hysterical girls have for the disgust which they\nentertain for the male genital because it serves for urination.\n\nThe sexual role of the mucous membrane of the anus is by no means\nlimited to intercourse between men; its preference has nothing\ncharacteristic of the inverted feeling. On the contrary, it seems that\nthe _pedicatio_ of the man owes its role to the analogy with the act in\nthe woman, whereas among inverts it is mutual masturbation which is the\nmost common sexual aim.\n\n*The Significance of Other Parts of the Body.*--Sexual infringement on\nthe other parts of the body, in all its variations, offers nothing new;\nit adds nothing to our knowledge of the sexual impulse which herein only\nannounces its intention to dominate the sexual object in every way.\nBesides the sexual overvaluation, a second and generally unknown factor\nmay be mentioned among the anatomical transgressions. Certain parts of\nthe body, like the mucous membrane of the mouth and anus, which\nrepeatedly appear in such practices, lay claim as it were to be\nconsidered and treated as genitals. We shall hear how this claim is\njustified by the development of the sexual impulse, and how it is\nfulfilled in the symptomatology of certain morbid conditions.\n\n*Unfit Substitutes for the Sexual Object. Fetichism.*--We are especially\nimpressed by those cases in which for the normal sexual object another\nis substituted which is related to it but which is totally unfit for the\nnormal sexual aim. According to the scheme of the introduction we should\nhave done better to mention this most interesting group of aberrations\nof the sexual impulse among the deviations in reference to the sexual\nobject, but we have deferred mention of these until we became acquainted\nwith the factor of sexual overestimation, upon which these\nmanifestations, connected with the relinquishing of the sexual aim,\ndepend.\n\nThe substitute for the sexual object is generally a part of the body but\nlittle adapted for sexual purposes, such as the foot, or hair, or an\ninanimate object which is in demonstrable relation with the sexual\nperson, and preferably with the sexuality of the same (fragments of\nclothing, white underwear). This substitution is not unjustly compared\nwith the fetich in which the savage sees the embodiment of his god.\n\nThe transition to the cases of fetichism, with a renunciation of a\nnormal or of a perverted sexual aim, is formed by cases in which a\nfetichistic determination is demanded in the sexual object if the sexual\naim is to be attained (definite color of hair, clothing, even physical\nblemishes). No other variation of the sexual impulse verging on the\npathological claims our interest as much as this one, owing to the\npeculiarity occasioned by its manifestations. A certain diminution in\nthe striving for the normal sexual aim may be presupposed in all these\ncases (executive weakness of the sexual apparatus).[17] The connection\nwith the normal is occasioned by the psychologically necessary\noverestimation of the sexual object, which inevitably encroaches upon\neverything associatively related to it (sexual object). A certain degree\nof such fetichism therefore regularly belong to the normal, especially\nduring those stages of wooing when the normal sexual aim seems\ninaccessible or its realization deferred.\n\n     \"Get me a handkerchief from her bosom--a garter of my love.\"\n                                                        --FAUST.\n\nThe case becomes pathological only when the striving for the fetich\nfixes itself beyond such determinations and takes the place of the\nnormal sexual aim; or again, when the fetich disengages itself from the\nperson concerned and itself becomes a sexual object. These are the\ngeneral determinations for the transition of mere variations of the\nsexual impulse into pathological aberrations.\n\nThe persistent influence of a sexual impress mostly received in early\nchildhood often shows itself in the selection of a fetich, as Binet\nfirst asserted, and as was later proven by many illustrations,--a thing\nwhich may be placed parallel to the proverbial attachment to a first\nlove in the normal (\"On revient toujours a ses premiers amours\"). Such a\nconnection is especially seen in cases with only fetichistic\ndeterminations of the sexual object. The significance of early sexual\nimpressions will be met again in other places.\n\nIn other cases it was mostly a symbolic thought association, unconscious\nto the person concerned, which led to the replacing of the object by\nmeans of a fetich. The paths of these connections can not always be\ndefinitely demonstrated. The foot is a very primitive sexual symbol\nalready found in myths.[18] Fur is used as a fetich probably on account\nof its association with the hairiness of the mons veneris. Such\nsymbolism seems often to depend on sexual experiences in childhood.[19]\n\n\n(_b_) _Fixation of Precursory Sexual Aims_\n\n*The Appearance of New Intentions.*--All the outer and inner\ndeterminations which impede or hold at a distance the attainment of the\nnormal sexual aim, such as impotence, costliness of the sexual object,\nand dangers of the sexual act, will conceivably strengthen the\ninclination to linger at the preparatory acts and to form them into new\nsexual aims which may take the place of the normal. On closer\ninvestigation it is always seen that the ostensibly most peculiar of\nthese new intentions have already been indicated in the normal sexual\nact.\n\n*Touching and Looking.*--At least a certain amount of touching is\nindispensable for a person in order to attain the normal sexual aim. It\nis also generally known that the touching of the skin of the sexual\nobject causes much pleasure and produces a supply of new excitement.\nHence, the lingering at the touching can hardly be considered a\nperversion if the sexual act is proceeded with.\n\nThe same holds true in the end with looking which is analogous to\ntouching. The manner in which the libidinous excitement is frequently\nawakened is by the optical impression, and selection takes account of\nthis circumstance--if this teleological mode of thinking be\npermitted--by making the sexual object a thing of beauty. The covering\nof the body, which keeps abreast with civilization, serves to arouse\nsexual inquisitiveness, which always strives to restore for itself the\nsexual object by uncovering the hidden parts. This can be turned into\nthe artistic (\"sublimation\") if the interest is turned from the genitals\nto the form of the body.[20] The tendency to linger at this intermediary\nsexual aim of the sexually accentuated looking is found to a certain\ndegree in most normals; indeed it gives them the possibility of\ndirecting a certain amount of their libido to a higher artistic aim. On\nthe other hand, the fondness for looking becomes a perversion (_a_) when\nit limits itself entirely to the genitals; (_b_) when it becomes connected\nwith the overcoming of loathing (voyeurs and onlookers at the functions\nof excretion); and (_c_) when instead of preparing for the normal sexual\naim it suppresses it. The latter, if I may draw conclusions from a\nsingle analysis, is in a most pronounced way true of exhibitionists, who\nexpose their genitals so as in turn to bring to view the genitals of\nothers.\n\nIn the perversion which consists in striving to look and be looked at we\nare confronted with a very remarkable character which will occupy us\neven more intensively in the following aberration. The sexual aim is\nhere present in twofold formation, in an _active_ and a _passive_ form.\n\nThe force which is opposed to the peeping mania and through which it is\neventually abolished is _shame_ (like the former loathing).\n\n*Sadism and Masochism.*--The desire to cause pain to the sexual object\nand its opposite, the most frequent and most significant of all\nperversions, was designated in its two forms by v. Krafft-Ebing as\nsadism or the active form, and masochism or the passive form. Other\nauthors prefer the narrower term algolagnia which emphasizes the\npleasure in pain and cruelty, whereas the terms selected by v.\nKrafft-Ebing place the pleasure secured in all kinds of humility and\nsubmission in the foreground.\n\nThe roots of active algolagnia, sadism, can be readily demonstrable in\nthe normal. The sexuality of most men shows a taint of _aggression_, it\nis a propensity to subdue, the biological significance of which lies in\nthe necessity of overcoming the resistance of the sexual object by\nactions other than mere _courting_. Sadism would then correspond to an\naggressive component of the sexual impulse which has become independent\nand exaggerated and has been brought to the foreground by displacement.\n\nThe conception of sadism fluctuates in the usage of language from a mere\nactive or impetuous attitude towards the sexual object to the exclusive\nattachment of the gratification to the subjection and maltreatment of\nthe object. Strictly speaking only the last extreme case has a claim to\nthe name of perversion.\n\nSimilarly, the designation of masochism comprises all passive attitude\nto the sexual life and to the sexual object; in its most extreme form\nthe gratification is connected with suffering of physical or mental pain\nat the hands of the sexual object. Masochism as a perversion seems to be\nstill more remote from the normal sexual life by forming a contrast to\nit; it may be doubted whether it ever appears as a primary form or\nwhether it does not more regularly originate through transformation from\nsadism. It can often be recognized that the masochism is nothing but a\ncontinuation of the sadism turning against one's own person in which the\nlatter at first takes the place of the sexual object. Analysis of\nextreme cases of masochistic perversions show that there is a\ncooeperation of a large series of factors which exaggerate and fix the\noriginal passive sexual attitude (castration complex, conscience).\n\nThe pain which is here overcome ranks with the loathing and shame which\nwere the resistances opposed to the libido.\n\nSadism and masochism occupy a special place among the perversions, for\nthe contrast of activity and passivity lying at their bases belong to\nthe common traits of the sexual life.\n\nThat cruelty and sexual impulse are most intimately connected is beyond\ndoubt taught by the history of civilization, but in the explanation of\nthis connection no one has gone beyond the accentuation of the\naggressive factors of the libido. The aggression which is mixed with the\nsexual impulse is according to some authors a remnant of cannibalistic\nlust, a participation on the part of the domination apparatus\n(Bemaechtigungsapparatus), which served also for the gratification of the\ngreat wants of the other, ontogenetically the older impulse.[21] It has\nalso been claimed that every pain contains in itself the possibility of\na pleasurable sensation. Let us be satisfied with the impression that\nthe explanation of this perversion is by no means satisfactory and that\nit is possible that many psychic efforts unite themselves into one\neffect.\n\nThe most striking peculiarity of this perversion lies in the fact that\nits active and passive forms are regularly encountered together in the\nsame person. He who experiences pleasure by causing pain to others in\nsexual relations is also able to experience the pain emanating from\nsexual relations as pleasure. A sadist is simultaneously a masochist,\nthough either the active or the passive side of the perversion may be\nmore strongly developed and thus represent his preponderate sexual\nactivity.[22]\n\nWe thus see that certain perverted propensities regularly appear in\n_contrasting pairs_, a thing which, in view of the material to be\nproduced later, must claim great theoretical value. It is furthermore\nclear that the existence of the contrast, sadism and masochism, can not\nreadily be attributed to the mixture of aggression. On the other hand\none may be tempted to connect such simultaneously existing contrasts\nwith the united contrast of male and female in bisexuality, the\nsignificance of which is reduced in psychoanalysis to the contrast of\nactivity and passivity.\n\n\n3. GENERAL STATEMENTS APPLICABLE TO ALL PERVERSIONS\n\n*Variation and Disease.*--The physicians who at first studied the\n_perversions_ in pronounced cases and under peculiar conditions were\nnaturally inclined to attribute to them the character of a morbid or\ndegenerative sign similar to the _inversions_. This view, however, is\neasier to refute in this than in the former case. Everyday experience\nhas shown that most of these transgressions, at least the milder ones,\nare seldom wanting as components in the sexual life of normals who look\nupon them as upon other intimacies. Wherever the conditions are\nfavorable such a perversion may for a long time be substituted by a\nnormal person for the normal sexual aim or it may be placed near it. In\nno normal person does the normal sexual aim lack some designable\nperverse element, and this universality suffices in itself to prove the\ninexpediency of an opprobrious application of the name perversion. In\nthe realm of the sexual life one is sure to meet with exceptional\ndifficulties which are at present really unsolvable, if one wishes to\ndraw a sharp line between the mere variations within physiological\nlimits and morbid symptoms.\n\nNevertheless, the quality of the new sexual aim in some of these\nperversions is such as to require special notice. Some of the\nperversions are in content so distant from the normal that we cannot\nhelp calling them \"morbid,\" especially those in which the sexual\nimpulse, in overcoming the resistances (shame, loathing, fear, and pain)\nhas brought about surprising results (licking of feces and violation of\ncadavers). Yet even in these cases one ought not to feel certain of\nregularly finding among the perpetrators persons of pronounced\nabnormalities or insane minds. We can not lose sight of the fact that\npersons who otherwise behave normally are recorded as sick in the realm\nof the sexual life where they are dominated by the most unbridled of all\nimpulses. On the other hand, a manifest abnormality in any other\nrelation in life generally shows an undercurrent of abnormal sexual\nbehavior.\n\nIn the majority of cases we are able to find the morbid character of the\nperversion not in the content of the new sexual aim but in its relation\nto the normal. It is morbid if the perversion does not appear beside the\nnormal (sexual aim and sexual object), where favorable circumstances\npromote it and unfavorable impede the normal, or if it has under all\ncircumstances repressed and supplanted the normal; _the exclusiveness_\nand _fixation_ of the perversion justifies us in considering it a morbid\nsymptom.\n\n*The Psychic Participation in the Perversions.*--Perhaps it is precisely\nin the most abominable perversions that we must recognize the most\nprolific psychic participation for the transformation of the sexual\nimpulse. In these cases a piece of psychic work has been accomplished in\nwhich, in spite of its gruesome success, the value of an idealization of\nthe impulse can not be disputed. The omnipotence of love nowhere perhaps\nshows itself stronger than in this one of her aberrations. The highest\nand the lowest everywhere in sexuality hang most intimately together.\n(\"From heaven through the world to hell.\")\n\n*Two Results.*--In the study of perversions we have gained an insight\ninto the fact that the sexual impulse has to struggle against certain\npsychic forces, resistances, among which shame and loathing are most\nprominent. We may presume that these forces are employed to confine the\nimpulse within the accepted normal limits, and if they have become\ndeveloped in the individual before the sexual impulse has attained its\nfull strength, it is really they which have directed it in the course of\ndevelopment.[23]\n\nWe have furthermore remarked that some of the examined perversions can\nbe comprehended only by assuming the union of many motives. If they are\namenable to analysis--disintegration--they must be of a composite\nnature. This may give us a hint that the sexual impulse itself may not\nbe something simple, that it may on the contrary be composed of many\ncomponents which detach themselves to form perversions. Our clinical\nobservation thus calls our attention to _fusions_ which have lost their\nexpression in the uniform normal behavior.\n\n\n4. THE SEXUAL IMPULSE IN NEUROTICS\n\n*Psychoanalysis.*--A proper contribution to the knowledge of the sexual\nimpulse in persons who are at least related to the normal can be gained\nonly from one source, and is accessible only by one definite path. There\nis only one way to obtain a thorough and unerring solution of problems\nin the sexual life of so-called psychoneurotics (hysteria, obsessions,\nthe wrongly-named neurasthenia, and surely also dementia praecox, and\nparanoia), and that is by subjecting them to the psychoanalytic\ninvestigations propounded by J. Breuer and myself in 1893, which we\ncalled the \"cathartic\" treatment.\n\nI must repeat what I have said in my published work, that these\npsychoneuroses, as far as my experience goes, are based on sexual motive\npowers. I do not mean that the energy of the sexual impulse merely\ncontributes to the forces supporting the morbid manifestations\n(symptoms), but I wish distinctly to maintain that this supplies the\nonly constant and the most important source of energy in the neurosis,\nso that the sexual life of such persons manifests itself either\nexclusively, preponderately, or partially in these symptoms. As I have\nalready stated in different places, the symptoms are the sexual\nactivities of the patient. The proof for this assertion I have obtained\nfrom the psychoanalysis of hysterics and other neurotics during a period\nof twenty years, the results of which I hope to give later in a detailed\naccount.\n\nPsychoanalysis removes the symptoms of hysteria on the supposition that\nthey are the substitutes--the transcriptions as it were--for a series of\nemotionally accentuated psychic processes, wishes, and desires, to which\na passage for their discharge through the conscious psychic activities\nhas been cut off by a special process (repression). These thought\nformations which are restrained in the state of the unconscious strive\nfor expression, that is, for _discharge_, in conformity to their\naffective value, and find such in hysteria through a process of\n_conversion_ into somatic phenomena--the hysterical symptoms. If, _lege\nartis_, and with the aid of a special technique, retrogressive\ntransformations of the symptoms into the affectful and conscious\nthoughts can be effected, it then becomes possible to get the most\naccurate information about the nature and origin of these previously\nunconscious psychic formations.\n\n*Results of Psychoanalysis.*--In this manner it has been discovered that\nthe symptoms represent the equivalent for the strivings which received\ntheir strength from the source of the sexual impulse. This fully concurs\nwith what we know of the character of hysterics, which we have taken as\nmodels for all psycho-neurotics, before they have become diseased, and\nwith what we know concerning the causes of the disease. The hysterical\ncharacter evinces a part of sexual repression which reaches beyond the\nnormal limits, an exaggeration of the resistances against the sexual\nimpulse which we know as shame and loathing. It is an instinctive flight\nfrom intellectual occupation with the sexual problem, the consequence of\nwhich in pronounced cases is a complete sexual ignorance, which is\npreserved till the age of sexual maturity is attained.[24]\n\nThis feature, so characteristic of hysteria, is not seldom concealed in\ncrude observation by the existence of the second constitutional factor\nof hysteria, namely, the enormous development of the sexual craving. But\nthe psychological analysis will always reveal it and solves the very\ncontradictory enigma of hysteria by proving the existence of the\ncontrasting pair, an immense sexual desire and a very exaggerated sexual\nrejection.\n\nThe provocation of the disease in hysterically predisposed persons is\nbrought about if in consequence of their progressive maturity or\nexternal conditions of life they are earnestly confronted with the real\nsexual demand. Between the pressure of the craving and the opposition of\nthe sexual rejection an outlet for the disease results, which does not\nremove the conflict but seeks to elude it by transforming the libidinous\nstrivings into symptoms. It is an exception only in appearance if a\nhysterical person, say a man, becomes subject to some banal emotional\ndisturbance, to a conflict in the center of which there is no sexual\ninterest. Psychoanalysis will regularly show that it is the sexual\ncomponents of the conflict which make the disease possible by\nwithdrawing the psychic processes from normal adjustment.\n\n*Neurosis and Perversion.*--A great part of the opposition to my\nassertion is explained by the fact that the sexuality from which I\ndeduce the psychoneurotic symptoms is thought of as coincident with the\nnormal sexual impulse. But psychoanalysis teaches us better than this.\nIt shows that the symptoms do not by any means result at the expense\nonly of the so called normal sexual impulse (at least not exclusively or\npreponderately), but they represent the converted expression of impulses\nwhich in a broader sense might be designated as _perverse_ if they could\nmanifest themselves directly in phantasies and acts without deviating\nfrom consciousness. The symptoms are therefore partially formed at the\ncost of abnormal sexuality. _The neurosis is, so to say, the negative of\nthe perversion._[25]\n\nThe sexual impulse of the psychoneurotic shows all the aberrations which\nwe have studied as variations of the normal and as manifestations of\nmorbid sexual life.\n\n(_a_) In all the neurotics without exception we find feelings of inversion\nin the unconscious psychic life, fixation of libido on persons of the\nsame sex. It is impossible, without a deep and searching discussion,\nadequately to appreciate the significance of this factor for the\nformation of the picture of the disease; I can only assert that the\nunconscious propensity to inversion is never wanting and is particularly\nof immense service in explaining male hysteria.[26]\n\n(_b_) All the inclinations to anatomical transgression can be demonstrated\nin psychoneurotics in the unconscious and as symptom-creators. Of\nspecial frequency and intensity are those which impart to the mouth and\nthe mucous membrane of the anus the role of genitals.\n\n(_c_) The partial desires which usually appear in contrasting pairs play\na very prominent role among the symptom-creators in the psychoneuroses.\nWe have learned to know them as carriers of new sexual aims, such as\npeeping mania, exhibitionism, and the actively and passively formed\nimpulses of cruelty. The contribution of the last is indispensable for\nthe understanding of the morbid nature of the symptoms; it almost\nregularly controls some portion of the social behavior of the patient.\nThe transformation of love into hatred, of tenderness into hostility,\nwhich is characteristic of a large number of neurotic cases and\napparently of all cases of paranoia, takes place by means of the union\nof cruelty with the libido.\n\nThe interest in these deductions will be more heightened by certain\npeculiarities of the diagnosis of facts.\n\nAlpha. There is nothing in the unconscious streams of thought of\nthe neuroses which would correspond to an inclination towards fetichism;\na circumstance which throws light on the psychological peculiarity of\nthis well understood perversion.\n\nBeta. Wherever any such impulse is found in the unconscious which\ncan be paired with a contrasting one, it can regularly be demonstrated\nthat the latter, too, is effective. Every active perversion is here\naccompanied by its passive counterpart. He who in the unconscious is an\nexhibitionist is at the same time a voyeur, he who suffers from sadistic\nfeelings as a result of repression will also show another reinforcement\nof the symptoms from the source of masochistic tendencies. The perfect\nconcurrence with the behavior of the corresponding positive perversions\nis certainly very noteworthy. In the picture of the disease, however,\nthe preponderant role is played by either one or the other of the\nopposing tendencies.\n\nGamma. In a pronounced case of psychoneurosis we seldom find the\ndevelopment of one single perverted impulse; usually there are many and\nregularly there are traces of all perversions. The individual impulse,\nhowever, on account of its intensity, is independent of the development\nof the others, but the study of the positive perversions gives us the\naccurate counterpart to it.\n\n\nPARTIAL IMPULSES AND EROGENOUS ZONES\n\nKeeping in mind what we have learned from the examination of the\npositive and negative perversions, it becomes quite obvious that they\ncan be referred to a number of \"partial impulses,\" which are not,\nhowever, primary but are subject to further analysis. By an \"impulse\" we\ncan understand in the first place nothing but the psychic representative\nof a continually flowing internal somatic source of excitement, in\ncontradistinction to the \"stimulus\" which is produced by isolated\nexcitements coming from without. The impulse is thus one of the concepts\nmarking the limits between the psychic and the physical. The simplest\nand most obvious assumption concerning the nature of the impulses would\nbe that in themselves they possess no quality but are only taken into\naccount as a measure of the demand for effort in the psychic life. What\ndistinguishes the impulses from one another and furnishes them with\nspecific attributes is their relation to their somatic _sources_ and to\ntheir _aims_. The source of the impulse is an exciting process in an\norgan, and the immediate aim of the impulse lies in the elimination of\nthis organic stimulus.\n\nAnother preliminary assumption in the theory of the impulse which we\ncannot relinquish, states that the bodily organs furnish two kinds of\nexcitements which are determined by differences of a chemical nature.\nOne of these forms of excitement we designate as the specifically sexual\nand the concerned organ as the _erogenous zone_, while the sexual\nelement emanating from it is the partial impulse.[27]\n\nIn the perversions which claim sexual significance for the oral cavity\nand the anal opening the part played by the erogenous zone is quite\nobvious. It behaves in every way like a part of the sexual apparatus. In\nhysteria these parts of the body, as well as the tracts of mucous\nmembrane proceeding from them, become the seat of new sensations and\ninnervating changes in a manner similar to the real genitals when under\nthe excitement of normal sexual processes.\n\nThe significance of the erogenous zones in the psychoneuroses, as\nadditional apparatus and substitutes for the genitals, appears to be\nmost prominent in hysteria though that does not signify that it is of\nlesser validity in the other morbid forms. It is not so recognizable in\ncompulsion neurosis and paranoia because here the symptom formation\ntakes place in regions of the psychic apparatus which lie at a great\ndistance from the central locations for bodily control. The more\nremarkable thing in the compulsion neurosis is the significance of the\nimpulses which create new sexual aims and appear independently of the\nerogenous zones. Nevertheless, the eye corresponds to an erogenous zone\nin the looking and exhibition mania, while the skin takes on the same\npart in the pain and cruelty components of the sexual impulse. The skin,\nwhich in special parts of the body becomes differentiated as sensory\norgans and modified by the mucous membrane, is the erogenous zone,\n[Greek: kat] ex ogen.[28]\n\n\nEXPLANATION OF THE MANIFEST PREPONDERANCE OF SEXUAL PERVERSIONS IN THE\nPSYCHONEUROSES\n\nThe sexuality of psychoneurotics has perhaps been placed in a false\nlight by the above discussions. It appears that the sexual behavior of\nthe psychoneurotic approaches in predisposition to the pervert and\ndeviates by just so much from the normal. Nevertheless, it is very\npossible that the constitutional disposition of these patients besides\ncontaining an immense amount of sexual repression and a predominant\nforce of sexual impulse also possesses an unusual tendency to\nperversions in the broadest sense. However, an examination of milder\ncases shows that the last assumption is not an absolute requisite, or at\nleast that in pronouncing judgment on the morbid effects one ought to\ndiscount the effect of one of the factors. In most psychoneurotics the\ndisease first appears after puberty following the demands of the normal\nsexual life. Against these the repression above all directs itself. Or\nthe disease comes on later, owing to the fact that the libido is unable\nto attain normal sexual gratification. In both cases the libido behaves\nlike a stream the principal bed of which is dammed; it fills the\ncollateral roads which until now perhaps have been empty. Thus the\nmanifestly great (though to be sure negative) tendency to perversion in\npsychoneurotics may be collaterally conditioned; at any rate, it is\ncertainly collaterally increased. The fact of the matter is that the\nsexual repression has to be added as an inner factor to such external\nones as restriction of freedom, inaccessibility to the normal sexual\nobject, dangers of the normal sexual act, etc., which cause the origin\nof perversions in individuals who might have otherwise remained normal.\n\nIn individual cases of neurosis the behavior may be different; now the\ncongenital force of the tendency to perversion may be more decisive and\nat other times more influence may be exerted by the collateral increase\nof the same through the deviation of the libido from the normal sexual\naim and object. It would be unjust to construe a contrast where a\ncooperation exists. The greatest results will always be brought about by\na neurosis if constitution and experience cooperate in the same\ndirection. A pronounced constitution may perhaps be able to dispense\nwith the assistance of daily impressions, while a profound disturbance\nin life may perhaps bring on a neurosis even in an average constitution.\nThese views similarly hold true in the etiological significance\nof the congenital and the accidental experiences in other spheres.\n\nIf, however, preference is given to the assumption that an especially\nformed tendency to perversions is characteristic of the psychoneurotic\nconstitution, there is a prospect of being able to distinguish a\nmultiformity of such constitutions in accordance with the congenital\npreponderance of this or that erogenous zone, or of this or that partial\nimpulse. Whether there is a special relationship between the\npredisposition to perversions and the selection of the morbid picture\nhas not, like many other things in this realm, been investigated.\n\n\nREFERENCE TO THE INFANTILISM OF SEXUALITY\n\nBy demonstrating the perverted feelings as symptomatic formations in\npsychoneurotics, we have enormously increased the number of persons who\ncan be added to the perverts. This is not only because neurotics\nrepresent a very large proportion of humanity, but we must consider also\nthat the neuroses in all their gradations run in an uninterrupted series\nto the normal state. Moebius was quite justified in saying that we are\nall somewhat hysterical. Hence, the very wide dissemination of\nperversions urged us to assume that the predisposition to perversions is\nno rare peculiarity but must form a part of the normally accepted\nconstitution.\n\nWe have heard that it is a question whether perversions should be\nreferred to congenital determinations or whether they originate from\naccidental experiences, just as Binet showed in fetichisms. Now we are\nforced to the conclusion that there is indeed something congenital at\nthe basis of perversions, but it is something _which is congenital in\nall persons_, which as a predisposition may fluctuate in intensity and\nis brought into prominence by influences of life. We deal here with\ncongenital roots in the constitution of the sexual impulse which in one\nseries of cases develop into real carriers of sexual activity\n(perverts); while in other cases they undergo an insufficient\nsuppression (repression), so that as morbid symptoms they are enabled to\nattract to themselves in a round-about way a considerable part of the\nsexual energy; while again in favorable cases between the two extremes\nthey originate the normal sexual life through effective restrictions and\nother elaborations.\n\nBut we must also remember that the assumed constitution which shows the\nroots of all perversions will be demonstrable only in the child, though\nall impulses can be manifested in it only in moderate intensity. If we\nare led to suppose that neurotics conserve the infantile state of their\nsexuality or return to it, our interest must then turn to the sexual\nlife of the child, and we will then follow the play of influences which\ncontrol the processes of development of the infantile sexuality up to\nits termination in a perversion, a neurosis or a normal sexual life.\n\n[1] The facts contained in the first \"Contribution\" have been gathered\nfrom the familiar publications of Krafft-Ebing, Moll, Moebius, Havelock\nEllis, Schrenk-Notzing, Loewenfeld, Eulenberg, J. Bloch, and M.\nHirschfeld, and from the later works published in the \"Jahrbuch fuer\nsexuelle Zwischenstufen.\" As these publications also mention the other\nliterature bearing on this subject I may forbear giving detailed\nreferences.\n\nThe conclusions reached through the investigation of sexual inverts are\nall based on the reports of J. Sadger and on my own experience.\n\n[2] For general use the word \"libido\" is best translated by \"craving.\"\n(Prof. James J. Putnam, Journal of Abnormal Psychology, Vol. IV, 6.)\n\n[3] For the difficulties entailed in the attempt to ascertain the\nproportional number of inverts compare the work of M. Hirschfeld in the\nJahrbuch fuer sexuelle Zwischenstufen, 1904. Cf. also Brill, The\nConception of Homosexuality, Journal of the A.M.A., August 2, 1913.\n\n[4] Such a striving against the compulsion to inversion favors cures by\nsuggestion of psychoanalysis.\n\n[5] Many have justly emphasized the fact that the autobiographic\nstatements of inverts, as to the time of the appearance of their\ntendency to inversion, are untrustworthy as they may have repressed from\nmemory any evidences of heterosexual feelings.\n\nPsychoanalysis has confirmed this suspicion in all cases of inversion\naccessible, and has decidedly changed their anamnesis by filling up the\ninfantile amnesias.\n\n[6] With what reserve the diagnosis of degeneration should be made and\nwhat slight practical significance can be attributed to it can be\ngathered from the discussions of Moebius (Ueber Entartung; Grenzfragen\ndes Nerven- und Seelenlebens, No. III, 1900). He says: \"If we review the\nwide sphere of degeneration upon which we have here turned some light we\ncan conclude without further ado that it is really of little value to\ndiagnose degeneration.\"\n\n[7] We must agree with the spokesman of \"Uranism\" that some of the most\nprominent men known have been inverts and perhaps absolute inverts.\n\n[8] In the conception of inversion the pathological features have been\nSeparated from the anthropological. For this credit is due to I. Bloch\n(Beitraege zur Aetiologie der Psychopathia Sexualis, 2 Teile, 1902-3), who\nhas also brought into prominence the existence of inversion in the old\ncivilized nations.\n\n[9] Compare the last detailed discussion of somatic hermaphroditism\n(Taruffi, Hermaphroditismus und Zeugungsunfaehigkeit, German edit. by R.\nTeuscher, 1903), and the works of Neugebauer in many volumes of the\nJahrbuch fuer sexuelle Zwischenstufen.\n\n[10] J. Halban, \"Die Entstehung der Geschlechtscharaktere,\" Arch. fuer\nGynaekologie, Bd. 70, 1903. See also there the literature on the subject.\n\n[11] According to a report in Vol. 6 of the Jahrbuch f. sexuelle\nZwischenstufen, E. Gley is supposed to have been the first to mention\nbisexuality as an explanation of inversion. He published a paper (Les\nAberrations de l'instinct Sexuel) in the Revue Philosophique as early as\nJanuary, 1884. It is moreover noteworthy that the majority of authors\nwho trace the inversion to bisexuality assume this factor not only for\nthe inverts but also for those who have developed normally, and justly\ninterpret the inversion as a result of a disturbance in development.\nAmong these authors are Chevalier (Inversion Sexuelle, 1893), and v.\nKrafft-Ebing (\"Zur Erklaerung der kontraeren Sexualempfindung,\" Jahrbuecher\nf. Psychiatrie u. Nervenheilkunde, XIII), who states that there are a\nnumber of observations \"from which at least the virtual and continued\nexistence of this second center (of the underlying sex) results.\" A Dr.\nArduin (Die Frauenfrage und die sexuellen Zwischenstufen, 2d vol. of the\nJahrbuch f. sexuelle Zwischenstufen, 1900) states that \"in every man\nthere exist male and female elements.\" See also the same Jahrbuch, Bd.\nI, 1899 (\"Die objektive Diagnose der Homosexualitat,\" by M. Hirschfeld,\npp. 8-9). In the determination of sex, as far as heterosexual persons\nare concerned, some are disproportionately more strongly developed than\nothers. G. Herman is firm in his belief \"that in every woman there are\nmale, and in every man there are female germs and qualities\" (Genesis,\ndas Gesetz der Zeugung, 9 Bd., Libido und Manie, 1903). As recently as\n1906 W. Fliess (Der Ablauf des Lebens) has claimed ownership of the idea\nof bisexuality (in the sense of double sex). Psychoanalytic\ninvestigation very strongly opposes the attempt to separate homosexuals\nfrom other persons as a group of a special nature. By also studying\nsexual excitations other than the manifestly open ones it discovers that\nall men are capable of homosexual object selection and actually\naccomplish this in the unconscious. Indeed the attachments of libidinous\nfeelings to persons of the same sex play no small role as factors in\nnormal psychic life, and as causative factors of disease they play a\ngreater role than those belonging to the opposite sex. According to\npsychoanalysis, it rather seems that it is the independence of the\nobject, selection of the sex of the object, the same free disposal over\nmale and female objects, as observed in childhood, in primitive states\nand in prehistoric times, which forms the origin from which the normal\nas well as the inversion types developed, following restrictions in this\nor that direction. In the psychoanalytic sense the exclusive sexual\ninterest of the man for the woman is also a problem requiring an\nexplanation, and is not something that is self-evident and explainable\non the basis of chemical attraction. The determination as to the\ndefinite sexual behavior does not occur until after puberty and is the\nresult of a series of as yet not observable factors, some of which are\nof a constitutional, while some are of an accidental nature. Certainly\nsome of these factors can turn out to be so enormous that by their\ncharacter they influence the result. In general, however, the\nmultiplicity of the determining factors is reflected by the manifoldness\nof the outcomes in the manifest sexual behavior of the person. In the\ninversion types it can be ascertained that they are altogether\ncontrolled by an archaic constitution and by primitive psychic\nmechanisms. The importance of the _narcissistic object selection_ and\nthe _clinging_ to the erotic significance of the _anal_ zone seem to be\ntheir most essential characteristics. But one gains nothing by\nseparating the most extreme inversion types from the others on the basis\nof such constitutional peculiarities. What is found in the latter as\nseemingly an adequate determinant can also be demonstrated only in\nlesser force in the constitution of transitional types and in manifestly\nnormal persons. The differences in the results may be of a qualitative\nnature, but analysis shows that the differences in the determinants are\nonly quantitative. As a remarkable factor among the accidental\ninfluences of the object selection, we found the sexual rejection or the\nearly sexual intimidation, and our attention was also called to the fact\nthat the existence of both parents plays an important role in the\nchild's life. The disappearance of a strong father in childhood not\ninfrequently favors the inversion. Finally, one might demand that the\ninversion of the sexual object should notionally be strictly separated\nfrom the mixing of the sex characteristics in the subject. A certain\namount of independence is unmistakable also in this relation.\n\n[12] Although psychoanalysis has not yet given us a full explanation for\nthe origin of inversion, it has revealed the psychic mechanism of its\ngenesis and has essentially enriched the problems in question. In all\nthe cases examined we have ascertained that the later inverts go through\nin their childhood a phase of very intense but short-lived fixation on\nthe woman (usually on the mother) and after overcoming it they identify\nthemselves with the woman and take themselves as the sexual object; that\nis, proceeding on a narcissistic basis, they look for young men\nresembling themselves in persons whom they wish to love as their mother\nhas loved them. We have, moreover, frequently found that alleged inverts\nare by no means indifferent to the charms of women, but the excitation\nevoked by the woman is always transferred to a male object. They thus\nrepeat through life the mechanism which gave origin to their inversion.\nTheir obsessive striving for the man proves to be determined by their\nrestless flight from the woman.\n\n[13] The most pronounced difference between the sexual life\n(Liebesleben) of antiquity and ours lies in the fact that the ancients\nplaced the emphasis on the impulse itself, while we put it on its\nobject. The ancients extolled the impulse and were ready to ennoble\nthrough it even an inferior object, while we disparage the activity of\nthe impulse as such and only countenance it on account of the merits of\nthe object.\n\n[14] I must mention here that the blind obedience evinced by the\nhypnotized subject to the hypnotist causes me to think that the nature\nof hypnosis is to be found in the unconscious fixation of the libido on\nthe person of the hypnotizer (by means of the masochistic component of\nthe sexual impulse).\n\nFerenczi connects this character of suggestibility with the \"parent\ncomplex\" (Jahrbuch fuer Psychoanalytische und psychopathologische\nForschungen, I, 1909).\n\n[15] Moreover, it is to be noted that sexual overvaluation does not\nbecome pronounced in all mechanisms of object selection, and that we\nshall later learn to know another and more direct explanation for the\nsexual role of the other parts of the body.\n\n[16] Further investigations lead to the conclusion that I. Bloch has\noverestimated the factor of excitement-hunger (Reizhunger). The various\nroads upon which the libido moves behave to each other from the very\nbeginning like communicating pipes; the factor of collateral streaming\nmust also be considered.\n\n[17] This weakness corresponds to the constitutional predisposition. The\nearly sexual intimidation which pushes the person away from the normal\nsexual aim and urges him to seek a substitute, has been demonstrated by\npsychoanalysis, as an accidental determinant.\n\n[18] The shoe or slipper is accordingly a symbol for the female\ngenitals.\n\n[19] Psychoanalysis has filled up the gap in the understanding of\nfetichisms by showing that the selection of the fetich depends on a\ncoprophilic smell-desire which has been lost by repression. Feet and\nhair are strong smelling objects which are raised to fetiches after the\nrenouncing of the now unpleasant sensation of smell. Accordingly, only\nthe filthy and ill-smelling foot is the sexual object in the perversion\nwhich corresponds to the foot fetichism. Another contribution to the\nexplanation of the fetichistic preference of the foot is found in the\nInfantile Sexual Theories (see later). The foot replaces the penis which\nis so much missed in the woman. In some cases of foot fetichism it could\nbe shown that the desire for looking originally directed to the\ngenitals, which wished to reach its object from below, was stopped on\nthe way by prohibition and repression, and therefore adhered to the foot\nor shoe as a fetich. In conformity with infantile expectation, the\nfemale genital was hereby imagined as a male genital.\n\n[20] I have no doubt that the conception of the \"beautiful\" is rooted in\nthe soil of sexual excitement and originally signified the sexual\nexcitant. The more remarkable, therefore, is the fact that the genitals,\nthe sight of which provokes the greatest sexual excitement, can really\nnever be considered \"beautiful.\"\n\n[21] Cf. here the later communication on the pregenital phases of the\nsexual development, in which this view is confirmed. See below,\n\"Ambivalence.\"\n\n[22] Instead of substantiating this statement by many examples I will\nmerely cite Havelock Ellis (The Sexual Impulse, 1903): \"All known cases\nof sadism and masochism, even those cited by v. Krafft-Ebing, always\nshow (as has already been shown by Colin, Scott, and Fere) traces of\nboth groups of manifestations in the same individual.\"\n\n[23] On the other hand the restricting forces of the sexual\nevolution--disgust, shame, morality--must also be looked upon as\nhistoric precipitates of the outer inhibitions which the sexual impulse\nexperienced in the psychogenesis of humanity. One can observe that they\nappear in their time during the development of the individual almost\nspontaneously at the call of education and influence.\n\n[24] Studien ueber Hysterie, 1895, J. Breuer tells of the patient on whom\nhe first practiced the cathartic method: \"The sexual factor was\nsurprisingly undeveloped.\"\n\n[25] The well-known fancies of perverts which under favorable conditions\nare changed into contrivances, the delusional fears of paranoiacs which\nare in a hostile manner projected on others, and the unconscious fancies\nof hysterics which are discovered in their symptoms by psychoanalysis,\nagree as to content in the minutest details.\n\n[26] A psychoneurosis very often associates itself with a manifest\ninversion in which the heterosexual feeling becomes subjected to\ncomplete repression.--It is but just to state that the necessity of a\ngeneral recognition of the tendency to inversion in psychoneurotics was\nfirst imparted to me personally by Wilh. Fliess, of Berlin, after I had\nmyself discovered it in some cases.\n\n[27] It is not easy to justify here this assumption which was taken from\na definite class of neurotic diseases. On the other hand, it would be\nimpossible to assert anything definite concerning the impulses if one\ndid not take the trouble of mentioning these presuppositions.\n\n[28] One should here think of Moll's assertion, who divides the sexual\nimpulse into the impulses of contrectation and detumescence.\nContrectation signifies a desire to touch the skin.\n\n\n\n\nII\n\nTHE INFANTILE SEXUALITY\n\n\nIt is a part of popular belief about the sexual impulse that it is\nabsent in childhood and that it first appears in the period of life\nknown as puberty. This, though a common error, is serious in its\nconsequences and is chiefly due to our present ignorance of the\nfundamental principles of the sexual life. A comprehensive study of the\nsexual manifestations of childhood would probably reveal to us the\nexistence of the essential features of the sexual impulse, and would\nmake us acquainted with its development and its composition from various\nsources.\n\n*The Neglect of the Infantile.*--It is remarkable that those writers who\nendeavor to explain the qualities and reactions of the adult individual\nhave given so much more attention to the ancestral period than to the\nperiod of the individual's own existence--that is, they have attributed\nmore influence to heredity than to childhood. As a matter of fact, it\nmight well be supposed that the influence of the latter period would be\neasier to understand, and that it would be entitled to more\nconsideration than heredity.[1] To be sure, one occasionally finds in\nmedical literature notes on the premature sexual activities of small\nchildren, about erections and masturbation and even actions resembling\ncoitus, but these are referred to merely as exceptional occurrences, as\ncuriosities, or as deterring examples of premature perversity. No author\nhas to my knowledge recognized the normality of the sexual impulse in\nchildhood, and in the numerous writings on the development of the child\nthe chapter on \"Sexual Development\" is usually passed over.[2]\n\n*Infantile Amnesia.*--This remarkable negligence is due partly to\nconventional considerations, which influence the writers on account of\ntheir own bringing up, and partly to a psychic phenomenon which has thus\nfar remained unexplained. I refer to the peculiar amnesia which veils\nfrom most people (not from all!) the first years of their childhood,\nusually the first six or eight years. So far it has not occurred to us\nthat this amnesia ought to surprise us, though we have good reasons for\nsurprise. For we are informed that in those years from which we later\nobtain nothing except a few incomprehensible memory fragments, we have\nvividly reacted to impressions, that we have manifested pain and\npleasure like any human being, that we have evinced love, jealousy, and\nother passions as they then affected us; indeed we are told that we have\nuttered remarks which proved to grown-ups that we possessed\nunderstanding and a budding power of judgment. Still we know nothing of\nall this when we become older. Why does our memory lag behind all our\nother psychic activities? We really have reason to believe that at no\ntime of life are we more capable of impressions and reproductions than\nduring the years of childhood.[3]\n\nOn the other hand we must assume, or we may convince ourselves through\npsychological observations on others, that the very impressions which we\nhave forgotten have nevertheless left the deepest traces in our psychic\nlife, and acted as determinants for our whole future development. We\nconclude therefore that we do not deal with a real forgetting of\ninfantile impressions but rather with an amnesia similar to that\nobserved in neurotics for later experiences, the nature of which\nconsists in their being detained from consciousness (repression). But\nwhat forces bring about this repression of the infantile impressions? He\nwho can solve this riddle will also explain hysterical amnesia.\n\nWe shall not, however, hesitate to assert that the existence of the\ninfantile amnesia gives us a new point of comparison between the psychic\nstates of the child and those of the psychoneurotic. We have already\nencountered another point of comparison when confronted by the fact that\nthe sexuality of the psychoneurotic preserves the infantile character or\nhas returned to it. May there not be an ultimate connection between the\ninfantile and the hysterical amnesias?\n\nThe connection between the infantile and the hysterical amnesias is\nreally more than a mere play of wit. The hysterical amnesia which serves\nthe repression can only be explained by the fact that the individual\nalready possesses a sum of recollections which have been withdrawn from\nconscious disposal and which by associative connection now seize that\nwhich is acted upon by the repelling forces of the repression emanating\nfrom consciousness.[4] We may say that without infantile amnesia there\nwould be no hysterical amnesia.\n\nI believe that the infantile amnesia which causes the individual to look\nupon his childhood as if it were a _prehistoric_ time and conceals from\nhim the beginning of his own sexual life--that this amnesia is\nresponsible for the fact that one does not usually attribute any value\nto the infantile period in the development of the sexual life. One\nsingle observer cannot fill the gap which has been thus produced in our\nknowledge. As early as 1896 I had already emphasized the significance of\nchildhood for the origin of certain important phenomena connected with\nthe sexual life, and since then I have not ceased to put into the\nforeground the importance of the infantile factor for sexuality.\n\n\nTHE SEXUAL LATENCY PERIOD OF CHILDHOOD AND ITS INTERRUPTIONS\n\nThe extraordinary frequent discoveries of apparently abnormal and\nexceptional sexual manifestations in childhood, as well as the\ndiscovery of infantile reminiscences in neurotics, which were hitherto\nunconscious, allow us to sketch the following picture of the sexual\nbehavior of childhood.[5]\n\nIt seems certain that the newborn child brings with it the germs of\nsexual feelings which continue to develop for some time and then succumb\nto a progressive suppression, which is in turn broken through by the\nproper advances of the sexual development and which can be checked by\nindividual idiosyncrasies. Nothing is known concerning the laws and\nperiodicity of this oscillating course of development. It seems,\nhowever, that the sexual life of the child mostly manifests itself in\nthe third or fourth year in some form accessible to observation.[6]\n\n*The Sexual Inhibition.*--It is during this period of total or at least\npartial latency that the psychic forces develop which later act as\ninhibitions on the sexual life, and narrow its direction like dams.\nThese psychic forces are loathing, shame, and moral and esthetic ideal\ndemands. We may gain the impression that the erection of these dams in\nthe civilized child is the work of education; and surely education\ncontributes much to it. In reality, however, this development is\norganically determined and can occasionally be produced without the help\nof education. Indeed education remains properly within its assigned\nrealm only if it strictly follows the path of the organic determinant\nand impresses it somewhat cleaner and deeper.\n\n*Reaction Formation and Sublimation.*--What are the means that\naccomplish these very important constructions so significant for the\nlater personal culture and normality? They are probably brought about at\nthe cost of the infantile sexuality itself, the influx of which has not\nstopped even in this latency period--the energy of which indeed has been\nturned away either wholly or partially from sexual utilization and\nconducted to other aims. The historians of civilization seem to be\nunanimous in the opinion that such deviation of sexual motive powers\nfrom sexual aims to new aims, a process which merits the name of\n_sublimation_, has furnished powerful components for all cultural\naccomplishments. We will therefore add that the same process acts in the\ndevelopment of every individual, and that it begins to act in the sexual\nlatency period.[7]\n\nWe can also venture an opinion about the mechanisms of such sublimation.\nThe sexual feelings of these infantile years on the one hand could not\nbe utilizable, since the procreating functions are postponed,--this is\nthe chief character of the latency period; on the other hand, they would\nin themselves be perverse, as they would emanate from erogenous zones\nand would be born of impulses which in the individual's course of\ndevelopment could only evoke a feeling of displeasure. They therefore\nawaken contrary forces (feelings of reaction), which in order to\nsuppress such displeasure, build up the above mentioned psychic dams:\nloathing, shame, and morality.[8]\n\n*The Interruptions of the Latency Period.*--Without deluding ourselves\nas to the hypothetical nature and deficient clearness of our\nunderstanding regarding the infantile period of latency and delay, we\nwill return to reality and state that such a utilization of the\ninfantile sexuality represents an ideal bringing up from which the\ndevelopment of the individual usually deviates in some measure and often\nvery considerably. A portion of the sexual manifestation which has\nwithdrawn from sublimation occasionally breaks through, or a sexual\nactivity remains throughout the whole duration of the latency period\nuntil the reinforced breaking through of the sexual impulse in puberty.\nIn so far as they have paid any attention to infantile sexuality the\neducators behave as if they shared our views concerning the formation of\nthe moral forces of defence at the cost of sexuality, and as if they\nknew that sexual activity makes the child uneducable; for the educators\nconsider all sexual manifestations of the child as an \"evil\" in the face\nof which little can be accomplished. We have, however, every reason for\ndirecting our attention to those phenomena so much feared by the\neducators, for we expect to find in them the solution of the primitive\nformation of the sexual impulse.\n\n\nTHE MANIFESTATIONS OF THE INFANTILE SEXUALITY\n\nFor reasons which we shall discuss later we will take as a model of the\ninfantile sexual manifestations thumbsucking (pleasure-sucking), to\nwhich the Hungarian pediatrist, Lindner, has devoted an excellent\nessay.[9]\n\n*Thumbsucking.*--Thumbsucking, which manifests itself in the nursing\nbaby and which may be continued till maturity or throughout life,\nconsists in a rhythmic repetition of sucking contact with the mouth (the\nlips), wherein the purpose of taking nourishment is excluded. A part of\nthe lip itself, the tongue, which is another preferable skin region\nwithin reach, and even the big toe--may be taken as objects for sucking.\nSimultaneously, there is also a desire to grasp things, which manifests\nitself in a rhythmical pulling of the ear lobe and which may cause the\nchild to grasp a part of another person (generally the ear) for the same\npurpose. The pleasure-sucking is connected with an entire exhaustion of\nattention and leads to sleep or even to a motor reaction in the form of\nan orgasm.[10] Pleasure-sucking is often combined with a rubbing contact\nwith certain sensitive parts of the body, such as the breast and\nexternal genitals. It is by this road that many children go from\nthumb-sucking to masturbation.\n\nLindner himself has recognized the sexual nature of this action and\nopenly emphasized it. In the nursery thumbsucking is often treated in\nthe same way as any other sexual \"naughtiness\" of the child. A very\nstrong objection was raised against this view by many pediatrists and\nneurologists which in part is certainly due to the confusion of the\nterms \"sexual\" and \"genital.\" This contradiction raises the difficult\nquestion, which cannot be rejected, namely, in what general traits do we\nwish to recognize the sexual manifestations of the child. I believe that\nthe association of the manifestations into which we gained an insight\nthrough psychoanalytic investigation justify us in claiming thumbsucking\nas a sexual activity and in studying through it the essential features\nof the infantile sexual activity.\n\n*Autoerotism.*--It is our duty here to arrange this state of affairs\ndifferently. Let us insist that the most striking character of this\nsexual activity is that the impulse is not directed against other\npersons but that it gratifies itself on its own body; to use the happy\nterm invented by Havelock Ellis, we will say that it is autoerotic.[11]\n\nIt is, moreover, clear that the action of the thumbsucking child is\ndetermined by the fact that it seeks a pleasure which has already been\nexperienced and is now remembered. Through the rhythmic sucking on a\nportion of the skin or mucous membrane it finds the gratification in the\nsimplest way. It is also easy to conjecture on what occasions the child\nfirst experienced this pleasure which it now strives to renew. The first\nand most important activity in the child's life, the sucking from the\nmother's breast (or its substitute), must have acquainted it with this\npleasure. We would say that the child's lips behaved like an _erogenous\nzone_, and that the excitement through the warm stream of milk was\nreally the cause of the pleasurable sensation. To be sure, the\ngratification of the erogenous zone was at first united with the\ngratification of taking nourishment. He who sees a satiated child sink\nback from the mother's breast, and fall asleep with reddened cheeks and\nblissful smile, will have to admit that this picture remains as typical\nof the expression of sexual gratification in later life. But the desire\nfor repetition of the sexual gratification is separated from the desire\nfor taking nourishment; a separation which becomes unavoidable with the\nappearance of the teeth when the nourishment is no longer sucked in but\nchewed. The child does not make use of a strange object for sucking but\nprefers its own skin because it is more convenient, because it thus\nmakes itself independent of the outer world which it cannot yet control,\nand because in this way it creates for itself, as it were, a second,\neven if an inferior, erogenous zone. The inferiority of this second\nregion urges it later to seek the same parts, the lips of another\nperson. (\"It is a pity that I cannot kiss myself,\" might be attributed\nto it.)\n\nNot all children suck their thumbs. It may be assumed that it is found\nonly in children in whom the erogenous significance of the lip-zone is\nconstitutionally reenforced. Children in whom this is retained are\nhabitual kissers as adults and show a tendency to perverse kissing, or\nas men they have a marked desire for drinking and smoking. But if\nrepression comes into play they experience disgust for eating and evince\nhysterical vomiting. By virtue of the community of the lip-zone the\nrepression encroaches upon the impulse of nourishment. Many of my female\npatients showing disturbances in eating, such as hysterical globus,\nchoking sensations, and vomiting, have been energetic thumbsuckers\nduring infancy.\n\nIn the thumbsucking or pleasure-sucking we have already been able to\nobserve the three essential characters of an infantile sexual\nmanifestation. The latter has its origin in conjunction with a bodily\nfunction which is very important for life, it does not yet know any\nsexual object, it is _autoerotic_ and its sexual aim is under the\ncontrol of an _erogenous zone_. Let us assume for the present that these\ncharacters also hold true for most of the other activities of the\ninfantile sexual impulse.\n\n\nTHE SEXUAL AIM OF THE INFANTILE SEXUALITY\n\n*The Characters of the Erogenous Zones.*--From the example of\nthumbsucking we may gather a great many points useful for the\ndistinguishing of an erogenous zone. It is a portion of skin or mucous\nmembrane in which the stimuli produce a feeling of pleasure of definite\nquality. There is no doubt that the pleasure-producing stimuli are\ngoverned by special determinants which we do not know. The rhythmic\ncharacters must play some part in them and this strongly suggests an\nanalogy to tickling. It does not, however, appear so certain whether the\ncharacter of the pleasurable feeling evoked by the stimulus can be\ndesignated as \"peculiar,\" and in what part of this peculiarity the\nsexual factor exists. Psychology is still groping in the dark when it\nconcerns matters of pleasure and pain, and the most cautious assumption\nis therefore the most advisable. We may perhaps later come upon reasons\nwhich seem to support the peculiar quality of the sensation of pleasure.\n\nThe erogenous quality may adhere most notably to definite regions of the\nbody. As is shown by the example of thumbsucking, there are predestined\nerogenous zones. But the same example also shows that any other region\nof skin or mucous membrane may assume the function of an erogenous zone;\nit must therefore carry along a certain adaptability. The production of\nthe sensation of pleasure therefore depends more on the quality of the\nstimulus than on the nature of the bodily region. The thumbsucking child\nlooks around on his body and selects any portion of it for\npleasure-sucking, and becoming accustomed to it, he then prefers it. If\nhe accidentally strikes upon a predestined region, such as breast,\nnipple or genitals, it naturally has the preference. A quite analogous\ntendency to displacement is again found in the symptomatology of\nhysteria. In this neurosis the repression mostly concerns the genital\nzones proper; these in turn transmit their excitation to the other\nerogenous zones, usually dormant in mature life, which then behave\nexactly like genitals. But besides this, just as in thumbsucking, any\nother region of the body may become endowed with the excitation of the\ngenitals and raised to an erogenous zone. Erogenous and hysterogenous\nzones show the same characters.[12]\n\n*The Infantile Sexual Aim.*--The sexual aim of the infantile impulse\nconsists in the production of gratification through the proper\nexcitation of this or that selected erogenous zone. In order to leave a\ndesire for its repetition this gratification must have been previously\nexperienced, and we may be sure that nature has devised definite means\nso as not to leave this occurrence to mere chance. The arrangement which\nhas fulfilled this purpose for the lip-zone we have already discussed;\nit is the simultaneous connection of this part of the body with the\ntaking of nourishment. We shall also meet other similar mechanisms as\nsources of sexuality. The state of desire for repetition of\ngratification can be recognized through a peculiar feeling of tension\nwhich in itself is rather of a painful character, and through a\ncentrally-determined feeling of itching or sensitiveness which is\nprojected into the peripheral erogenous zone. The sexual aim may\ntherefore be formulated as follows: the chief object is to substitute\nfor the projected feeling of sensitiveness in the erogenous zone that\nouter stimulus which removes the feeling of sensitiveness by evoking the\nfeeling of gratification. This external stimulus consists usually in a\nmanipulation which is analogous to sucking.\n\nIt is in full accord with our physiological knowledge if the desire\nhappens to be awakened also peripherally through an actual change in the\nerogenous zone. The action is puzzling only to some extent as one\nstimulus for its suppression seems to want another applied to the same\nplace.\n\n\nTHE MASTURBATIC SEXUAL MANIFESTATIONS[13]\n\nIt is a matter of great satisfaction to know that there is nothing\nfurther of greater importance to learn about the sexual activity of the\nchild after the impulse of one erogenous zone has become comprehensible\nto us. The most pronounced differences are found in the action necessary\nfor the gratification, which consists in sucking for the lip zone and\nwhich must be replaced by other muscular actions according to the\nsituation and nature of the other zones.\n\n*The Activity of the Anal Zone.*--Like the lip zone the anal zone is,\nthrough its position, adapted to conduct the sexuality to the other\nfunctions of the body. It should be assumed that the erogenous\nsignificance of this region of the body was originally very large.\nThrough psychoanalysis one finds, not without surprise, the many\ntransformations that are normally undertaken with the usual excitations\nemanating from here, and that this zone often retains for life a\nconsiderable fragment of genital irritability.[14] The intestinal\ncatarrhs so frequent during infancy produce intensive irritations in\nthis zone, and we often hear it said that intestinal catarrh at this\ndelicate age causes \"nervousness.\" In later neurotic diseases they exert\na definite influence on the symptomatic expression of the neurosis,\nplacing at its disposal the whole sum of intestinal disturbances.\nConsidering the erogenous significance of the anal zone which has been\nretained at least in transformation, one should not laugh at the\nhemorrhoidal influences to which the old medical literature attached so\nmuch weight in the explanation of neurotic states.\n\nChildren utilizing the erogenous sensitiveness of the anal zone can be\nrecognized by their holding back of fecal masses until through\naccumulation there result violent muscular contractions; the passage of\nthese masses through the anus is apt to produce a marked irritation of\nthe mucus membrane. Besides the pain this must produce also a sensation\nof pleasure. One of the surest premonitions of later eccentricity or\nnervousness is when an infant obstinately refuses to empty his bowel\nwhen placed on the chamber by the nurse and reserves this function at\nits own pleasure. It does not concern him that he will soil his bed; all\nhe cares for is not to lose the subsidiary pleasure while defecating.\nThe educators have again the right inkling when they designate children\nwho withhold these functions as bad. The content of the bowel which is\nan exciting object to the sexually sensitive surface of mucous membrane\nbehaves like the precursor of another organ which does not become active\nuntil after the phase of childhood. In addition it has other important\nmeanings to the nursling. It is evidently treated as an additional part\nof the body, it represents the first \"donation,\" the disposal of which\nexpresses the pliability while the retention of it can express the\nspite of the little being towards its environment. From the idea of\n\"donation\" he later gains the meaning of the \"babe\" which according to\none of the infantile sexual theories is acquired through eating and is\nborn through the bowel.\n\nThe retention of fecal masses, which is at first intentional in order to\nutilize them, as it were, for masturbatic excitation of the anal zone,\nis at least one of the roots of constipation so frequent in neuropaths.\nThe whole significance of the anal zone is mirrored in the fact that\nthere are but few neurotics who have not their special scatologic\ncustoms, ceremonies, etc., which they retain with cautious secrecy.\n\nReal masturbatic irritation of the anal zone by means of the fingers,\nevoked through either centrally or peripherally supported itching, is\nnot at all rare in older children.\n\n*The Activity of the Genital Zone.*--Among the erogenous zones of the\nchild's body there is one which certainly does not play the main role,\nand which cannot be the carrier of earliest sexual feeling--which,\nhowever, is destined for great things in later life. In both male and\nfemale it is connected with the voiding of urine (penis, clitoris), and\nin the former it is enclosed in a sack of mucous membrane, probably in\norder not to miss the irritations caused by the secretions which may\narouse the sexual excitement at an early age. The sexual activities of\nthis erogenous zone, which belongs to the real genitals, are the\nbeginning of the later normal sexual life.\n\nOwing to the anatomical position, the overflowing of secretions, the\nwashing and rubbing of the body, and to certain accidental excitements\n(the wandering of intestinal worms in the girl), it happens that the\npleasurable feeling which these parts of the body are capable of\nproducing makes itself noticeable to the child even during the sucking\nage, and thus awakens desire for its repetition. When we review all the\nactual arrangements, and bear in mind that the measures for cleanliness\nhave the same effect as the uncleanliness itself, we can then scarcely\nmistake nature's intention, which is to establish the future primacy of\nthese erogenous zones for the sexual activity through the infantile\nonanism from which hardly an individual escapes. The action of removing\nthe stimulus and setting free the gratification consists in a rubbing\ncontiguity with the hand or in a certain previously-formed pressure\nreflex effected by the closure of the thighs. The latter procedure seems\nto be the more primitive and is by far the more common in girls. The\npreference for the hand in boys already indicates what an important part\nof the male sexual activity will be accomplished in the future by the\nimpulse to mastery (Bemaechtigungstrieb).[15] It can only help towards\nclearness if I state that the infantile masturbation should be divided\ninto three phases. The first phase belongs to the nursing period, the\nsecond to the short flourishing period of sexual activity at about the\nfourth year, only the third corresponds to the one which is often\nconsidered exclusively as onanism of puberty.\n\nThe infantile onanism seems to disappear after a brief time, but it may\ncontinue uninterruptedly till puberty and thus represent the first\nmarked deviation from the development desirable for civilized man. At\nsome time during childhood after the nursing period, the sexual impulse\nof the genitals reawakens and continues active for some time until it is\nagain suppressed, or it may continue without interruption. The possible\nrelations are very diverse and can only be elucidated through a more\nprecise analysis of individual cases. The details, however, of this\n_second_ infantile sexual activity leave behind the profoundest\n(unconscious) impressions in the persons's memory; if the individual\nremains healthy they determine his character and if he becomes sick\nafter puberty they determine the symptomatology of his neurosis.[16] In\nthe latter case it is found that this sexual period is forgotten and the\nconscious reminiscences pointing to them are displaced; I have already\nmentioned that I would like to connect the normal infantile amnesia with\nthis infantile sexual activity. By psychoanalytic investigation it is\npossible to bring to consciousness the forgotten material, and thereby\nto remove a compulsion which emanates from the unconscious psychic\nmaterial.\n\n*The Return of the Infantile Masturbation.*--The sexual excitation of\nthe nursing period returns during the designated years of childhood as a\ncentrally determined tickling sensation demanding onanistic\ngratification, or as a pollution-like process which, analogous to the\npollution of maturity, may attain gratification without the aid of any\naction. The latter case is more frequent in girls and in the second half\nof childhood; its determinants are not well understood, but it often,\nthough not regularly, seems to have as a basis a period of early active\nonanism. The symptomatology of this sexual manifestation is poor; the\ngenital apparatus is still undeveloped and all signs are therefore\ndisplayed by the urinary apparatus which is, so to say, the guardian of\nthe genital apparatus. Most of the so-called bladder disturbances of\nthis period are of a sexual nature; whenever the enuresis nocturna does\nnot represent an epileptic attack it corresponds to a pollution.\n\nThe return of the sexual activity is determined by inner and outer\ncauses which can be conjectured from the formation of the symptoms of\nneurotic diseases and definitely revealed by psychoanalytic\ninvestigations. The internal causes will be discussed later, the\naccidental outer causes attain at this time a great and permanent\nsignificance. As the first outer cause we have the influence of\nseduction which prematurely treats the child as a sexual object; under\nconditions favoring impressions this teaches the child the gratification\nof the genital zones, and thus usually forces it to repeat this\ngratification in onanism. Such influences can come from adults or other\nchildren. I cannot admit that I overestimated its frequency or its\nsignificance in my contributions to the etiology of hysteria,[17] though\nI did not know then that normal individuals may have the same\nexperiences in their childhood, and hence placed a higher value on\nseductions than on the factors found in the sexual constitution and\ndevelopment.[18] It is quite obvious that no seduction is necessary to\nawaken the sexual life of the child, that such an awakening may come on\nspontaneously from inner sources.\n\n*Polymorphous-perverse Disposition.*--It is instructive to know that\nunder the influence of seduction the child may become\npolymorphous-perverse and may be misled into all sorts of\ntransgressions. This goes to show that it carries along the adaptation\nfor them in its disposition. The formation of such perversions meets but\nslight resistance because the psychic dams against sexual\ntransgressions, such as shame, loathing and morality--which depend on\nthe age of the child--are not yet erected or are only in the process of\nformation. In this respect the child perhaps does not behave differently\nfrom the average uncultured woman in whom the same polymorphous-perverse\ndisposition exists. Such a woman may remain sexually normal under usual\nconditions, but under the guidance of a clever seducer she will find\npleasure in every perversion and will retain the same as her sexual\nactivity. The same polymorphous or infantile disposition fits the\nprostitute for her professional activity, and in the enormous number of\nprostitutes and of women to whom we must attribute an adaptation for\nprostitution, even if they do not follow this calling, it is absolutely\nimpossible not to recognize in their uniform disposition for all\nperversions the universal and primitive human.\n\n*Partial Impulses.*--For the rest, the influence of seduction does not\naid us in unravelling the original relations of the sexual impulse, but\nrather confuses our understanding of the same, inasmuch as it\nprematurely supplies the child with the sexual object at a time when the\ninfantile sexual impulse does not yet evince any desire for it. We must\nadmit, however, that the infantile sexual life, though mainly under the\ncontrol of erogenous zones, also shows components in which from the very\nbeginning other persons are regarded as sexual objects. Among these we\nhave the impulses for looking and showing off, and for cruelty, which\nmanifest themselves somewhat independently of the erogenous zones and\nwhich only later enter into intimate relationship with the sexual life;\nbut along with the erogenous sexual activity they are noticeable even in\nthe infantile years as separate and independent strivings. The little\nchild is above all shameless, and during its early years it evinces\ndefinite pleasure in displaying its body and especially its sexual\norgans. A counterpart to this desire which is to be considered as\nperverse, the curiosity to see other persons' genitals, probably appears\nfirst in the later years of childhood when the hindrance of the feeling\nof shame has already reached a certain development. Under the influence\nof seduction the looking perversion may attain great importance for the\nsexual life of the child. Still, from my investigations of the childhood\nyears of normal and neurotic patients, I must conclude that the impulse\nfor looking can appear in the child as a spontaneous sexual\nmanifestation. Small children, whose attention has once been directed to\ntheir own genitals--usually by masturbation--are wont to progress in\nthis direction without outside interference, and to develop a vivid\ninterest in the genitals of their playmates. As the occasion for the\ngratification of such curiosity is generally afforded during the\ngratification of both excrementitious needs, such children become\n_voyeurs_ and are zealous spectators at the voiding of urine and feces\nof others, After this tendency has been repressed, the curiosity to see\nthe genitals of others (one's own or those of the other sex) remains as\na tormenting desire which in some neurotic cases furnishes the strongest\nmotive power for the formation of symptoms.\n\nThe cruelty component of the sexual impulse develops in the child with\nstill greater independence of those sexual activities which are\nconnected with erogenous zones. Cruelty is especially near the childish\ncharacter, since the inhibition which restrains the impulse to mastery\nbefore it causes pain to others--that is, the capacity for\nsympathy--develops comparatively late. As we know, a thorough\npsychological analysis of this impulse has not as yet been successfully\naccomplished; we may assume that the cruel feelings emanate from the\nimpulse to mastery and appear at a period in the sexual life before the\ngenitals have taken on their later role. It then dominates a phase of\nthe sexual life, which we shall later describe as the pregenital\norganization. Children who are distinguished for evincing especial\ncruelty to animals and playmates may be justly suspected of intensive\nand premature sexual activity in the erogenous zones; and in a\nsimultaneous prematurity of all sexual impulses, the erogenous sexual\nactivity surely seems to be primary. The absence of the barrier of\nsympathy carries with it the danger that the connections between cruelty\nand the erogenous impulses formed in childhood cannot be broken in later\nlife.\n\nAn erogenous source of the passive impulse for cruelty (masochism) is\nfound in the painful irritation of the gluteal region which is familiar\nto all educators since the confessions of J.J. Rousseau. This has justly\ncaused them to demand that physical punishment, which usually concerns\nthis part of the body, should be withheld from all children in whom the\nlibido might be forced into collateral roads by the later demands of\ncultural education.[19]\n\n\nTHE INFANTILE SEXUAL INVESTIGATION\n\n*Inquisitiveness.*--At the same time when the sexual life of the child\nreaches its first bloom, from the age of three to the age of five, it\nalso evinces the beginning of that activity which is ascribed to the\nimpulse for knowledge and investigation. The desire for knowledge can\nneither be added to the elementary components of the impulses nor can it\nbe altogether subordinated under sexuality. Its activity corresponds on\nthe one hand to a sublimating mode of acquisition and on the other hand\nit labors with the energy of the desire for looking. Its relations to\nthe sexual life, however, are of particular importance, for we have\nlearned from psychoanalysis that the inquisitiveness of children is\nattracted to the sexual problems unusually early and in an unexpectedly\nintensive manner, indeed it perhaps may first be awakened by the sexual\nproblems.\n\n*The Riddle of the Sphinx.*--It is not theoretical but practical\ninterests which start the work of the investigation activity in the\nchild. The threat to the conditions of his existence through the actual\nor expected arrival of a new child, the fear of the loss in care and\nlove which is connected with this event, cause the child to become\nthoughtful and sagacious. Corresponding with the history of this\nawakening, the first problem with which it occupies itself is not the\nquestion as to the difference between the sexes, but the riddle: from\nwhere do children come? In a distorted form, which can easily be\nunraveled, this is the same riddle which was given by the Theban Sphinx.\nThe fact of the two sexes is usually first accepted by the child without\nstruggle and hesitation. It is quite natural for the male child to\npresuppose in all persons it knows a genital like his own, and to find\nit impossible to harmonize the lack of it with his conception of others.\n\n*The Castration Complex.*--This conviction is energetically adhered to\nby the boy and tenaciously defended against the contradictions which\nsoon result, and are only given up after severe internal struggles\n(castration complex). The substitutive formations of this lost penis of\nthe woman play a great part in the formation of many perversions.\n\nThe assumption of the same (male) genital in all persons is the first of\nthe remarkable and consequential infantile sexual theories. It is of\nlittle help to the child when biological science agrees with his\npreconceptions and recognizes the feminine clitoris as the real\nsubstitute for the penis. The little girl does not react with similar\nrefusals when she sees the differently formed genital of the boy. She\nis immediately prepared to recognize it, and soon becomes envious of the\npenis; this envy reaches its highest point in the consequentially\nimportant wish that she also should be a boy.\n\n*Birth Theories.*--Many people can remember distinctly how intensely\nthey interested themselves, in the prepubescent period, in the question\nwhere children came from. The anatomical solutions at that time read\nvery differently; the children come out of the breast or are cut out of\nthe body, or the navel opens itself to let them out. Outside of analysis\none only seldom remembers the investigation corresponding to the early\nchildhood years; it had long merged into repression but its results were\nthoroughly uniform. One gets children by eating something special (as in\nthe fairy tale) and they are born through the bowel like a passage.\nThese infantile theories recall the structures in the animal kingdom,\nespecially do they recall the cloaca of the types which stand lower than\nthe mammals.\n\n*Sadistic Conception of the Sexual Act.*--If children of so delicate an\nage become spectators of the sexual act between grown-ups, for which an\noccasion is furnished by the conviction of the grown-ups that little\nchildren cannot understand anything sexual, they cannot help conceiving\nthe sexual act as a kind of maltreating or overpowering, that is, it\nimpresses them in a sadistic sense. Psychoanalysis also teaches us that\nsuch an early childhood impression contributes much to the disposition\nfor a later sadistic displacement of the sexual aim. Besides this\nchildren also occupy themselves with the problem of what the sexual act\nconsists in or, as they grasp it, of what marriage consists, and seek\nthe solution of the mystery mostly in an association to which the\nfunctions of urination and defecation give occasion.\n\n*The Typical Failure of the Infantile Sexual Investigation.*--It can be\nstated in general about the infantile sexual theories that they are\nreproductions of the child's own sexual constitution, and that despite\ntheir grotesque mistakes they evince more understanding of the sexual\nprocesses than is credited to their creators. Children also perceive the\npregnancy of the mother and know how to interpret it correctly; the\nstork fable is very often related before auditors who confront it with a\ndeep, but mostly mute suspicion. But as two elements remain unknown to\nthe infantile sexual investigation, namely, the role of the propagating\nsemen and the female genital opening--precisely the same points in which\nthe infantile organization is still backward--the effort of the\ninfantile investigator regularly remains fruitless, and ends in a\nrenunciation which not infrequently leaves a lasting injury to the\ndesire for knowledge. The sexual investigation of these early childhood\nyears is always conducted alone, it signifies the first step towards\nindependent orientation in the world, and causes a marked estrangement\nbetween the child and the persons of his environment who formerly\nenjoyed its full confidence.\n\n*The Phases of Development of the Sexual Organization.*--As\ncharacteristics of the infantile sexuality we have hitherto emphasized\nthe fact that it is essentially autoerotic (it finds its object in its\nown body), and that its individual partial impulses, which on the whole\nare unconnected and independent of one another, are striving for the\nacquisition of pleasure. The end of this development forms the so-called\nnormal sexual life of the adult in which the acquisition of pleasure has\nbeen put into the service of the function of propagation, and the\npartial impulses, under the primacy of one single erogenous zone, have\nformed a firm organization for the attainment of the sexual aim in a\nstrange sexual object.\n\n*Pregenital Organizations.*--The study, with the help of\npsychoanalysis, of the inhibitions and disturbances in this course of\ndevelopment now permits us to recognize additions and primary stages of\nsuch organization of the partial impulses which likewise furnish a sort\nof sexual regime. These phases of the sexual organization normally will\npass over smoothly and will only be recognizable by slight indications.\nOnly in pathological cases do they become active and discernible to\ncoarse observation.\n\nOrganizations of the sexual life in which the genital zones have not yet\nassumed the dominating role we would call the _pregenital_ phase. So far\nwe have become acquainted with two of them which recall reversions to\nearly animal states.\n\nOne of the first of such pregenital sexual organizations is the _oral_,\nor if we wish, the cannibalistic. Here the sexual activity is not yet\nseparated from the taking of nourishment, and the contrasts within the\nsame not yet differentiated. The object of the one activity is also that\nof the other, the sexual aim consists in the _incorporating_ into one's\nown body of the object, it is the prototype of that which later plays\nsuch an important psychic role as _identification_. As a remnant of this\nfictitious phase of organization forced on us by pathology we can\nconsider thumbsucking. Here the sexual activity became separated from\nthe nourishment activity and the strange object was given up in favor of\none from his own body.\n\nA second pregenital phase is the sadistic-anal organization. Here the\ncontrasts which run through the whole sexual life are already developed,\nbut cannot yet be designated as _masculine_ and _feminine_, but must be\ncalled _active_ and _passive_. The activity is supplied by the\nmusculature of the body through the mastery impulse; the erogenous\nmucous membrane of the bowel manifests itself above all as an organ with\na passive sexual aim, for both strivings there are objects present,\nwhich however do not merge together. Besides them there are other\npartial impulses which are active in an autoerotic manner. The sexual\npolarity and the strange object can thus already be demonstrated in this\nphase. The organization and subordination under the function of\npropagation are still lacking.\n\n*Ambivalence.*--This form of the sexual organization could be retained\nthroughout life and continue to draw to itself a large part of the\nsexual activity. The prevalence of sadism and the role of the cloaca of\nthe anal zone stamps it with an exquisitely archaic impression. As\nanother characteristic belonging to it we can mention the fact that the\ncontrasting pair of impulses are developed in almost the same manner, a\nbehavior which was designated by Bleuler with the happy name of\n_ambivalence_.\n\nThe assumption of the pregenital organizations of the sexual life is\nbased on the analysis of the neuroses and hardly deserves any\nconsideration without a knowledge of the same. We may expect that\ncontinued analytic efforts will furnish us with still more disclosures\nconcerning the structure and development of the normal sexual function.\n\nTo complete the picture of the infantile sexual life one must add that\nfrequently or regularly an object selection takes place even in\nchildhood which is as characteristic as the one we have represented for\nthe phase of development of puberty. This object selection proceeds in\nsuch a manner that all the sexual strivings proceed in the direction of\none person in whom they wish to attain their aim. This is then the\nnearest approach to the definitive formation of the sexual life after\npuberty, that is possible in childhood. It differs from the latter only\nin the fact that the collection of the partial impulses and their\nsubordination to the primacy of the genitals is very imperfectly or not\nat all accomplished in childhood. The establishment of this primacy in\nthe service of propagation is therefore the last phase through which the\nsexual organization passes.\n\n*The Two Periods of Object Selection.*--That the object selection takes\nplace in two periods, or in two shifts, can be spoken of as a typical\noccurrence. The first shift has its origin between the age of three and\nfive years, and is brought to a stop or to retrogression by the latency\nperiod; it is characterized by the infantile nature of its sexual aims.\nThe second shift starts with puberty and determines the definitive\nformation of the sexual life.\n\nThe fact of the double object selection which is essentially due to the\neffect of the latency period, becomes most significant for the\ndisturbance of this terminal state. The results of the infantile object\nselection reach into the later period; they are either preserved as such\nor are even refreshed at the time of puberty. But due to the development\nof the repression which takes place between the two phases they turn out\nas unutilizable. The sexual aims have become softened and now represent\nwhat we can designate as the _tender_ streams of the sexual life. Only\npsychoanalytic investigation can demonstrate that behind this\ntenderness, such as honoring and esteeming, there is concealed the old\nsexual strivings of the infantile partial impulses which have now become\nuseless. The object selection of the pubescent period must renounce the\ninfantile objects and begin anew as a sensuous stream. The fact that the\ntwo streams do not meet often enough has as a result that one of the\nideals of the sexual life, namely, the union of all desires in one\nobject, can not be attained.\n\n\nTHE SOURCES OF THE INFANTILE SEXUALITY\n\nIn our effort to follow up the origins of the sexual impulse, we have\nthus far found that the sexual excitement originates (_a_) as an imitation\nof a gratification which has been experienced in conjunction with other\norganic processes; (_b_) through the appropriate peripheral stimulation of\nerogenous zones; (_c_) and as an expression of some \"impulse,\" like the\nlooking and cruelty impulses, the origin of which we do not yet fully\nunderstand. The psychoanalytic investigation of later life which leads\nback to childhood and the contemporary observation of the child itself\ncooeperate to reveal to us still other regularly-flowing sources of the\nsexual excitement. The observation of childhood has the disadvantage of\ntreating easily misunderstood material, while psychoanalysis is made\ndifficult by the fact that it can reach its objects and conclusions only\nby great detours; still the united efforts of both methods achieve a\nsufficient degree of positive understanding.\n\nIn investigating the erogenous zones we have already found that these\nskin regions merely show the special exaggeration of a form of\nsensitiveness which is to a certain degree found over the whole surface\nof the skin. It will therefore not surprise us to learn that certain\nforms of general sensitiveness in the skin can be ascribed to very\ndistinct erogenous action. Among these we will above all mention the\ntemperature sensitiveness; this will perhaps prepare us for the\nunderstanding of the therapeutic effects of warm baths.\n\n*Mechanical Excitation.*--We must, moreover, describe here the\nproduction of sexual excitation by means of rhythmic mechanical shaking\nof the body. There are three kinds of exciting influences: those acting\non the sensory apparatus of the vestibular nerves, those acting on the\nskin, and those acting on the deep parts, such as the muscles and\njoints. The sexual excitation produced by these influences seems to be\nof a pleasurable nature--it is worth emphasizing that for some time we\nshall continue to use indiscriminately the terms \"sexual excitement\" and\n\"gratification\" leaving the search for an explanation of the terms to a\nlater time--and that the pleasure is produced by mechanical stimulation\nis proved by the fact that children are so fond of play involving\npassive motion, like swinging or flying in the air, and repeatedly\ndemand its repetition.[20] As we know, rocking is regularly used in\nputting restless children to sleep. The shaking sensation experienced in\nwagons and railroad trains exerts such a fascinating influence on older\nchildren, that all boys, at least at one time in their lives, want to\nbecome conductors and drivers. They are wont to ascribe to railroad\nactivities an extraordinary and mysterious interest, and during the age\nof phantastic activity (shortly before puberty) they utilize these as a\nnucleus for exquisite sexual symbolisms. The desire to connect railroad\ntravelling with sexuality apparently originates from the pleasurable\ncharacter of the sensation of motion. When the repression later sets in\nand changes so many of the childish likes into their opposites, these\nsame persons as adolescents and adults then react to the rocking and\nrolling with nausea and become terribly exhausted by a railroad journey,\nor they show a tendency to attacks of anxiety during the journey, and by\nbecoming obsessed with railroad phobia they protect themselves against a\nrepetition of the painful experiences.\n\nThis also fits in with the not as yet understood fact that the\nconcurrence of fear with mechanical shaking produces the severest\nhysterical forms of traumatic neurosis. It may at least be assumed that\ninasmuch as even a slight intensity of these influences becomes a source\nof sexual excitement, the action of an excessive amount of the same will\nproduce a profound disorder in the sexual mechanism.\n\n*Muscular Activity.*--It is well known that the child has need for\nstrong muscular activity, from the gratification of which it draws\nextraordinary pleasure. Whether this pleasure has anything to do with\nsexuality, whether it includes in itself sexual satisfaction? or can be\nthe occasion of sexual excitement; all this may be refuted by critical\nconsideration, which will probably be directed also to the position\ntaken above that the pleasure in the sensations of passive movement are\nof sexual character or that they are sexually exciting. The fact\nremains, however, that a number of persons report that they experienced\nthe first signs of excitement in their genitals during fighting or\nwrestling with playmates, in which situation, besides the general\nmuscular exertion, there is an intensive contact with the opponent's\nskin which also becomes effective. The desire for muscular contest with\na definite person, like the desire for word contest in later years, is a\ngood sign that the object selection has been directed toward this\nperson. \"Was sich liebt, das neckt sich.\"[21] In the promotion of sexual\nexcitement through muscular activity we might recognize one of the\nsources of the sadistic impulse. The infantile connection between\nfighting and sexual excitement acts in many persons as a determinant for\nthe future preferred course of their sexual impulse.[22]\n\n*Affective Processes.*--The other sources of sexual excitement in the\nchild are open to less doubt. Through contemporary observations, as well\nas through later investigations, it is easy to ascertain that all more\nintensive affective processes, even excitements of a terrifying nature,\nencroach upon sexuality; this can at all events furnish us with a\ncontribution to the understanding of the pathogenic action of such\nemotions. In the school child, fear of a coming examination or exertion\nexpended in the solution of a difficult task can become significant for\nthe breaking through of sexual manifestations as well as for his\nrelations to the school, inasmuch as under such excitements a sensation\noften occurs urging him to touch the genitals, or leading to a\npollution-like process with all its disagreeable consequences. The\nbehavior of children at school, which is so often mysterious to the\nteacher, ought surely to be considered in relation with their\ngerminating sexuality. The sexually-exciting influence of some painful\naffects, such as fear, shuddering, and horror, is felt by a great many\npeople throughout life and readily explains why so many seek\nopportunities to experience such sensations, provided that certain\naccessory circumstances (as under imaginary circumstances in reading, or\nin the theater) suppress the earnestness of the painful feeling.\n\nIf we might assume that the same erogenous action also reaches the\nintensive painful feelings, especially if the pain be toned down or held\nat a distance by a subsidiary determination, this relation would then\ncontain the main roots of the masochistic-sadistic impulse, into the\nmanifold composition of which we are gaining a gradual insight.\n\n*Intellectual Work.*--Finally, is is evident that mental application or\nthe concentration of attention on an intellectual accomplishment will\nresult, especially often in youthful persons, but in older persons as\nwell, in a simultaneous sexual excitement, which may be looked upon as\nthe only justified basis for the otherwise so doubtful etiology of\nnervous disturbances from mental \"overwork.\"\n\nIf we now, in conclusion, review the evidences and indications of the\nsources of the infantile sexual excitement, which have been reported\nneither completely nor exhaustively, we may lay down the following\ngeneral laws as suggested or established. It seems to be provided in the\nmost generous manner that the process of sexual excitement--the nature\nof which certainly remains quite mysterious to us--should be set in\nmotion. The factor making this provision in a more or less direct way is\nthe excitation of the sensible surfaces of the skin and sensory organs,\nwhile the most immediate exciting influences are exerted on certain\nparts which are designated as erogenous zones. The criterion in all\nthese sources of sexual excitement is really the quality of the stimuli,\nthough the factor of intensity (in pain) is not entirely unimportant.\nBut in addition to this there are arrangements in the organism which\ninduce sexual excitement as a subsidiary action in a large number of\ninner processes as soon as the intensity of these processes has risen\nabove certain quantitative limits. What we have designated as the\npartial impulses of sexuality are either directly derived from these\ninner sources of sexual excitation or composed of contributions from\nsuch sources and from erogenous zones. It is possible that nothing of\nany considerable significance occurs in the organism that does not\ncontribute its components to the excitement of the sexual impulse.\n\nIt seems to me at present impossible to shed more light and certainty on\nthese general propositions, and for this I hold two factors responsible;\nfirst, the novelty of this manner of investigation, and secondly, the\nfact that the nature of the sexual excitement is entirely unfamiliar to\nus. Nevertheless, I will not forbear speaking about two points which\npromise to open wide prospects in the future.\n\n*Diverse Sexual Constitutions.*--(_a_) We have considered above the\npossibility of establishing the manifold character of congenital sexual\nconstitutions through the diverse formation of the erogenous zones; we\nmay now attempt to do the same in dealing with the indirect sources of\nsexual excitement. We may assume that, although these different sources\nfurnish contributions in all individuals, they are not all equally\nstrong in all persons; and that a further contribution to the\ndifferentiation of the diverse sexual constitution will be found in the\npreferred developments of the individual sources of sexual excitement.\n\n*The Paths of Opposite Influences.*--(_b_) Since we are now dropping the\nfigurative manner of expression hitherto employed, by which we spoke of\n_sources_ of sexual excitement, we may now assume that all the\nconnecting ways leading from other functions to sexuality must also be\npassable in the reverse direction. For example, if the lip zone, the\ncommon possession of both functions, is responsible for the fact that\nthe sexual gratification originates during the taking of nourishment,\nthe same factor offers also an explanation for the disturbances in the\ntaking of nourishment if the erogenous functions of the common zone are\ndisturbed. As soon as we know that concentration of attention may\nproduce sexual excitement, it is quite natural to assume that acting on\nthe same path, but in a contrary direction, the state of sexual\nexcitement will be able to influence the availability of the voluntary\nattention. A good part of the symptomatology of the neuroses which I\ntrace to disturbance of sexual processes manifests itself in\ndisturbances of the other non-sexual bodily functions, and this hitherto\nincomprehensible action becomes less mysterious if it only represents\nthe counterpart of the influences controlling the production of the\nsexual excitement.\n\nHowever the same paths through which sexual disturbances encroach upon\nthe other functions of the body must in health be supposed to serve\nanother important function. It must be through these paths that the\nattraction of the sexual motive-powers to other than sexual aims, the\nsublimation of sexuality, is accomplished. We must conclude with the\nadmission that very little is definitely known concerning the paths\nbeyond the fact that they exist, and that they are probably passable in\nboth directions.\n\n[1] For it is really impossible to have a correct knowledge of the part\nbelonging to heredity without first understanding the part belonging to\nthe infantile.\n\n[2] This assertion on revision seemed even to myself so bold that I\ndecided to test its correctness by again reviewing the literature. The\nresult of this second review did not warrant any change in my original\nstatement. The scientific elaboration of the physical as well as the\npsychic phenomena of the infantile sexuality is still in its initial\nstages. One author (S. Bell, \"A Preliminary Study of the Emotions of\nLove Between the Sexes,\" American Journal of Psychology, XIII, 1902)\nsays: \"I know of no scientist who has given a careful analysis of the\nemotion as it is seen in the adolescent.\" The only attention given to\nsomatic sexual manifestations occurring before the age of puberty was in\nconnection with degenerative manifestations, and these were referred to\nas a sign of degeneration. A chapter on the sexual life of children is\nnot to be found in all the representative psychologies of this age which\nI have read. Among these works I can mention the following: Preyer;\nBaldwin (The Development of the Mind in the Child and in the Race,\n1898); Perez (L'enfant de 3-7 ans, 1894); Struempel (Die paedagogische\nPathologie, 1899); Karl Groos (Das Seelenleben des Kindes, 1904); Th.\nHeller (Grundriss der Heilpaedagogic, 1904); Sully (Observations\nConcerning Childhood, 1897). The best impression of the present\nsituation of this sphere can be obtained from the journal Die\nKinderfehler (issued since 1896). On the other hand one gains the\nimpression that the existence of love in childhood is in no need of\ndemonstration. Perez (l.c.) speaks for it; K. Groos (Die Spiele der\nMenschen, 1899) states that some children are very early subject to\nsexual emotions, and show a desire to touch the other sex (p. 336); S.\nBell observed the earliest appearance of sex-love in a child during the\nmiddle part of its third year. See also Havelock Ellis, The Sexual\nImpulse, Appendix II.\n\nThe above-mentioned judgment concerning the literature of infantile\nsexuality no longer holds true since the appearance of the great and\nimportant work of G. Stanley Hall (Adolescence, Its Psychology and its\nRelation to Physiology, Anthropology, Sociology, Sex, Crime, Religion,\nand Education, 2 vols., New York, 1908). The recent book of A. Moll, Das\nSexualleben des Kindes, Berlin, 1909, offers no occasion for such a\nmodification. See, on the other hand, Bleuler, Sexuelle abnormitaeten der\nKinder (Jahrbuch der Schweizerischen Gesellschaft fuer\nSchulgesundheitspflege, IX, 1908). A book by Mrs. Dr. H.v. Hug-Hellmuth,\nAus dem Seelenleben des Kindes (1913), has taken full account of the\nneglected sexual factors. [Translated in Monograph Series.]\n\n[3] I have attempted to solve the problems presented by the earliest\ninfantile recollections in a paper, \"Ueber Deckerinnerungen\"\n(Monatsschrift fuer Psychiatrie und Neurologie, VI, 1899). Cf. also The\nPsychopathology of Everyday Life, The Macmillan Co., New York, and\nUnwin, London.\n\n[4] One cannot understand the mechanism of repression when one takes\ninto consideration only one of the two cooperating processes. As a\ncomparison one may think of the way the tourist is despatched to the top\nof the great pyramid of Gizeh; he is pushed from one side and pulled\nfrom the other.\n\n[5] The use of the latter material is justified by the fact that the\nyears of childhood of those who are later neurotics need not necessarily\ndiffer from those who are later normal except in intensity and\ndistinctness.\n\n[6] An anatomic analogy to the behavior of the infantile sexual function\nformulated by me is perhaps given by Bayer (Deutsches Archiv fuer\nklinische Medizin, Bd. 73) who claims that the internal genitals\n(uterus) are regularly larger in newborn than in older children.\nHowever, Halban's conception, that after birth there is also an\ninvolution of the other parts of the sexual apparatus, has not been\nverified. According to Halban (Zeitschrift fuer Geburtshilfe u.\nGynaekologie, LIII, 1904) this process of involution ends after a few\nweeks of extra-uterine life.\n\n[7] The expression \"sexual latency period\" (sexuelle latenz-periode) I\nhave borrowed from W. Fliess.\n\n[8] In the case here discussed the sublimation of the sexual motive\npowers proceed on the road of reaction formations. But in general it is\nnecessary to separate from each other sublimation and reaction formation\nas two diverse processes. Sublimation may also result through other and\nsimpler mechanisms.\n\n[9] Jahrbuch fuer Kinderheilkunde, N.F., XIV, 1879.\n\n[10] This already shows what holds true for the whole life, namely, that\nsexual gratification is the best hypnotic. Most nervous insomnias are\ntraced to lack of sexual gratification. It is also known that\nunscrupulous nurses calm crying children to sleep by stroking their\ngenitals.\n\n[11] Ellis spoils, however, the sense of his invented term by comprising\nunder the phenomena of autoerotism the whole of hysteria and\nmasturbation in its full extent.\n\n[12] Further reflection and observation lead me to attribute the quality\nof erogenity to all parts of the body and inner organs. See later on\nnarcism.\n\n[13] Compare here the very comprehensive but confusing literature on\nonanism, _e.g._, Rohleder, Die Masturbation, 1899. Cf. also the\npamphlet, \"Die Onanie,\" which contains the discussion of the Vienna\nPsychoanalytic Society, Wiesbaden, 1912.\n\n[14] Compare here the essay on \"Charakter und Analerotic\" in the\nSammlung kleiner Schriften zur Neurosenlehre, Zweite Folge, 1909. Cf.\nalso Brill, Psychanalysis, Chap. XIII, Anal Eroticism and Character,\nW.B. Saunders, Philadelphia.\n\n[15] Unusual techniques in the performance of onanism seem to point to\nthe influence of a prohibition against onanism which has been overcome.\n\n[16] Why neurotics, when conscience stricken, regularly connect it with\ntheir onanistic activity, as was only recently recognized by Bleuler, is\na problem which still awaits an exhaustive analysis.\n\n[17] Freud, Selected Papers on Hysteria and Other Psychoneuroses, 3d\nedition, translated by A.A. Brill, N.Y. Nerv. and Ment. Dis. Pub. Co.\nNervous and Mental Disease Monograph, Series No. 4.\n\n[18] Havelock Ellis, in an appendix to his study on the Sexual Impulse,\n1903, gives a number of autobiographic reports of normal persons\ntreating their first sexual feelings in childhood and the causes of the\nsame. These reports naturally show the deficiency due to infantile\namnesia; they do not cover the prehistoric time in the sexual life and\ntherefore must be supplemented by psychoanalysis of individuals who\nbecame neurotic. Notwithstanding this these reports are valuable in more\nthan one respect, and information of a similar nature has urged me to\nmodify my etiological assumption as mentioned in the text.\n\n[19] The above-mentioned assertions concerning the infantile sexuality\nwere justified in 1905, in the main through the results of\npsychoanalytic investigations in adults. Direct observation of the child\ncould not at the time be utilized to its full extent and resulted only\nin individual indications and valuable confirmations. Since then it has\nbecome possible through the analysis of some cases of nervous disease in\nthe delicate age of childhood to gain a direct understanding of the\ninfantile psychosexuality (Jahrbuch fuer psychoanalytische und\npsychopathologische Forschungen, Bd. 1, 2, 1909). I can point with\nsatisfaction to the fact that direct observation has fully confirmed the\nconclusion drawn from psychoanalysis, and thus furnishes good evidence\nfor the reliability of the latter method of investigation.\n\nMoreover, the \"Analysis of a Phobia in a Five-year-old Boy\" (Jahrbuch,\nBd. 1) has taught us something new for which psychoanalysis had not\nprepared us, to wit, that sexual symbolism, the representation of the\nsexual by non-sexual objects and relations--reaches back into the years\nwhen the child is first learning to master the language. My attention\nhas also been directed to a deficiency in the above-cited statement\nwhich for the sake of clearness described any conceivable separation\nbetween the two phases of autoerotism and object love as a temporal\nseparation. From the cited analysis (as well as from the above-mentioned\nwork of Bell) we learn that children from three to five are capable of\nevincing a very strong object-selection which is accompanied by strong\naffects.\n\n[20] Some persons can recall that the contact of the moving air in\nswinging caused them direct sexual pleasure in the genitals.\n\n[21] \"Those who love each other tease each other.\"\n\n[22] The analyses of neurotic disturbances of walking and of agoraphobia\nremove all doubt as to the sexual nature of the pleasure of motion. As\neverybody knows modern cultural education utilizes sports to a great\nextent in order to turn away the youth from sexual activity; it would be\nmore proper to say that it replaces the sexual pleasure by motion\npleasure, and forces the sexual activity back upon one of its autoerotic\ncomponents.\n\n\n\n\nIII\n\nTHE TRANSFORMATION OF PUBERTY\n\n\nWith the beginning of puberty the changes set in which transform the\ninfantile sexual life into its definite normal form. Hitherto the sexual\nimpulse has been preponderantly autoerotic; it now finds the sexual\nobject. Thus far it has manifested itself in single impulses and in\nerogenous zones seeking a certain pleasure as a single sexual aim. A new\nsexual aim now appears for the production of which all partial impulses\ncooeperate, while the erogenous zones subordinate themselves to the\nprimacy of the genital zone.[1] As the new sexual aim assigns very\ndifferent functions to the two sexes their sexual developments now part\ncompany. The sexual development of the man is more consistent and easier\nto understand, while in the woman there even appears a form of\nregression. The normality of the sexual life is guaranteed only by the\nexact concurrence of the two streams directed to the sexual object and\nsexual aim. It is like the piercing of a tunnel from opposite sides.\n\nThe new sexual aim in the man consists in the discharging of the sexual\nproducts; it is not contradictory to the former sexual aim, that of\nobtaining pleasure; on the contrary, the highest amount of pleasure is\nconnected with this final act in the sexual process. The sexual impulse\nnow enters into the service of the function of propagation; it becomes,\nso to say, altruistic. If this transformation is to succeed its process\nmust be adjusted to the original dispositions and all the peculiarities\nof the impulses.\n\nJust as on every other occasion where new connections and compositions\nare to be formed in complicated mechanisms, here, too, there is a\npossibility for morbid disturbance if the new order of things does not\nget itself established. All morbid disturbances of the sexual life may\njustly be considered as inhibitions of development.\n\n\nTHE PRIMACY OF THE GENITAL ZONES AND THE FORE-PLEASURE\n\nFrom the course of development as described we can clearly see the issue\nand the end aim. The intermediary transitions are still quite obscure\nand many a riddle will have to be solved in them.\n\nThe most striking process of puberty has been selected as its most\ncharacteristic; it is the manifest growth of the external genitals which\nhave shown a relative inhibition of growth during the latency period of\nchildhood. Simultaneously the inner genitals develop to such an extent\nas to be able to furnish sexual products or to receive them for the\npurpose of forming a new living being. A most complicated apparatus is\nthus formed which waits to be claimed.\n\nThis apparatus can be set in motion by stimuli, and observation teaches\nthat the stimuli can affect it in three ways: from the outer world\nthrough the familiar erogenous zones; from the inner organic world by\nways still to be investigated; and from the psychic life, which merely\nrepresents a depository of external impressions and a receptacle of\ninner excitations. The same result follows in all three cases, namely, a\nstate which can be designated as \"sexual excitation\" and which manifests\nitself in psychic and somatic signs. The psychic sign consists in a\npeculiar feeling of tension of a most urgent character, and among the\nmanifold somatic signs the many changes in the genitals stand first.\nThey have a definite meaning, that of readiness; they constitute a\npreparation for the sexual act (the erection of the penis and the\nglandular activity of the vagina).\n\n*The Sexual Tension*--The character of the tension of sexual excitation\nis connected with a problem the solution of which is as difficult as it\nwould be important for the conception of the sexual process. Despite all\ndivergence of opinion regarding it in psychology, I must firmly maintain\nthat a feeling of tension must carry with it the character of\ndispleasure. For me it is conclusive that such a feeling carries with it\nthe impulse to alter the psychic situation, and acts incitingly, which\nis quite contrary to the nature of perceived pleasure. But if we ascribe\nthe tension of the sexual excitation to the feelings of displeasure we\nencounter the fact that it is undoubtedly pleasurably perceived. The\ntension produced by sexual excitation is everywhere accompanied by\npleasure; even in the preparatory changes of the genitals there is a\ndistinct feeling of satisfaction. What relation is there between this\nunpleasant tension and this feeling of pleasure?\n\nEverything relating to the problem of pleasure and pain touches one of\nthe weakest spots of present-day psychology. We shall try if possible to\nlearn something from the determinations of the case in question and to\navoid encroaching on the problem as a whole. Let us first glance at the\nmanner in which the erogenous zones adjust themselves to the new order\nof things. An important role devolves upon them in the preparation of\nthe sexual excitation. The eye which is very remote from the sexual\nobject is most often in position, during the relations of object wooing,\nto become attracted by that particular quality of excitation, the motive\nof which we designate as beauty in the sexual object. The excellencies\nof the sexual object are therefore also called \"attractions.\" This\nattraction is on the one hand already connected with pleasure, and on\nthe other hand it either results in an increase of the sexual excitation\nor in an evocation of the same where it is still wanting. The effect is\nthe same if the excitation of another erogenous zone, _e.g._, the\ntouching hand, is added to it. There is on the one hand the feeling of\npleasure which soon becomes enhanced by the pleasure from the\npreparatory changes, and on the other hand there is a further increase\nof the sexual tension which soon changes into a most distinct feeling of\ndispleasure if it cannot proceed to more pleasure. Another case will\nperhaps be clearer; let us, for example, take the case where an\nerogenous zone, like a woman's breast, is excited by touching in a\nperson who is not sexually excited at the time. This touching in itself\nevokes a feeling of pleasure, but it is also best adapted to awaken\nsexual excitement which demands still more pleasure. How it happens that\nthe perceived pleasure evokes the desire for greater pleasure, that is\nthe real problem.\n\n*Fore-pleasure Mechanism.*--But the role which devolves upon the\nerogenous zones is clear. What applies to one applies to all. They are\nall utilized to furnish a certain amount of pleasure through their own\nproper excitation, which increases the tension, and which is in turn\ndestined to produce the necessary motor energy in order to bring to a\nconclusion the sexual act. The last part but one of this act is again a\nsuitable excitation of an erogenous zone; _i.e._, the genital zone\nproper of the glans penis is excited by the object most fit for it, the\nmucous membrane of the vagina, and through the pleasure furnished by\nthis excitation it now produces reflexly the motor energy which conveys\nto the surface the sexual substance. This last pleasure is highest in\nits intensity, and differs from the earliest ones in its mechanism. It\nis altogether produced through discharge, it is altogether gratification\npleasure and the tension of the libido temporarily dies away with it.\n\nIt does not seem to me unjustified to fix by name the distinction in the\nnature of these pleasures, the one through the excitation of the\nerogenous zones, and the other through the discharge of the sexual\nsubstance. In contradistinction to the end-pleasure, or pleasure of\ngratification of sexual activity, we can properly designate the first as\n_fore-pleasure_. The fore-pleasure is then the same as that furnished by\nthe infantile sexual impulse, though on a reduced scale; while the\n_end-pleasure_ is new and is probably connected with determinations\nwhich first appear at puberty. The formula for the new function of the\nerogenous zones reads as follows: they are utilized for the purpose of\nmaking possible the production of the greater pleasure of gratification\nby means of the fore-pleasure which is gained from them as in infantile\nlife.\n\nI have recently been able to elucidate another example from a quite\ndifferent realm of the psychic life, in which likewise a greater feeling\nof pleasure is achieved by means of a lesser feeling of pleasure which\nthereby acts as an alluring premium. We had there also the opportunity\nof entering more deeply into the nature of pleasure.[2]\n\n*Dangers of the Fore-pleasure.*--However the connection of fore-pleasure\nwith the infantile life is strengthened by the pathogenic role which may\ndevolve upon it. In the mechanism through which the fore-pleasure is\nexpressed there exists an obvious danger to the attainment of the normal\nsexual aim. This occurs if it happens that there is too much\nfore-pleasure and too little tension in any part of the preparatory\nsexual process. The motive power for the further continuation of the\nsexual process then escapes, the whole road becomes shortened, and the\npreparatory action in question takes the place of the normal sexual aim.\nExperience shows that such a hurtful condition is determined by the fact\nthat the erogenous zone concerned or the corresponding partial impulse\nhas already contributed an unusual amount of pleasure in infantile life.\nIf other factors favoring fixation are added a compulsion readily\nresults for the later life which prevents the fore-pleasure from\narranging itself into a new combination. Indeed, the mechanism of many\nperversions is of such a nature; they merely represent a lingering at a\npreparatory act of the sexual process.\n\nThe failure of the function of the sexual mechanism through the fault of\nthe fore-pleasure is generally avoided if the primacy of the genital\nzones has also already been sketched out in infantile life. The\npreparations of the second half of childhood (from the eighth year to\npuberty) really seem to favor this. During these years the genital zones\nbehave almost as at the age of maturity; they are the seat of exciting\nsensations and of preparatory changes if any kind of pleasure is\nexperienced through the gratification of other erogenous zones; although\nthis effect remains aimless, _i.e._, it contributes nothing towards the\ncontinuation of the sexual process. Besides the pleasure of\ngratification a certain amount of sexual tension appears even in\ninfancy, though it is less constant and less abundant. We can now\nunderstand also why in the discussion of the sources of sexuality we had\na perfectly good reason for saying that the process in question acts as\nsexual gratification as well as sexual excitement. We note that on our\nway towards the truth we have at first enormously exaggerated the\ndistinctions between the infantile and the mature sexual life, and we\ntherefore supplement what has been said with a correction. The infantile\nmanifestations of sexuality determine not only the deviations from the\nnormal sexual life but also the normal formations of the same.\n\n\nTHE PROBLEM OF SEXUAL EXCITEMENT\n\nIt remains entirely unexplained whence the sexual tension comes which\noriginates simultaneously with the gratification of erogenous zones and\nwhat is its nature. The obvious supposition that this tension originates\nin some way from the pleasure itself is not only improbable in itself\nbut untenable, inasmuch as during the greatest pleasure which is\nconnected with the voiding of sexual substance there is no production of\ntension but rather a removal of all tension. Hence, pleasure and sexual\ntension can be only indirectly connected.\n\n*The Role of the Sexual Substance.*--Aside from the fact that only the\ndischarge of the sexual substance can normally put an end to the sexual\nexcitement, there are other essential facts which bring the sexual\ntension into relation with the sexual products. In a life of continence\nthe sexual activity is wont to discharge the sexual substance at night\nduring pleasurable dream hallucinations of a sexual act, this discharge\ncoming at changing but not at entirely capricious intervals; and the\nfollowing interpretation of this process--the nocturnal pollution--can\nhardly be rejected, viz., that the sexual tension which brings about a\nsubstitute for the sexual act by the short hallucinatory road is a\nfunction of the accumulated semen in the reservoirs for the sexual\nproducts. Experiences with the exhaustibility of the sexual mechanism\nspeak for the same thing. Where there is no stock of semen it is not\nonly impossible to accomplish the sexual act, but there is also a lack\nof excitability in the erogenous zones, the suitable excitation of which\ncan evoke no pleasure. We thus discover incidentally that a certain\namount of sexual tension is itself necessary for the excitability of the\nerogenous zones.\n\nOne would thus be forced to the assumption, which if I am not mistaken\nis quite generally adopted, that the accumulation of sexual substance\nproduces and maintains the sexual tension. The pressure of these\nproducts on the walls of their receptacles acts as an excitant on the\nspinal center, the state of which is then perceived by the higher\ncenters which then produce in consciousness the familiar feeling of\ntension. If the excitation of erogenous zones increases the sexual\ntension, it can only be due to the fact that the erogenous zones are\nconnected with these centers by previously formed anatomical\nconnections. They increase there the tone of the excitation, and with\nsufficient sexual tension they set in motion the sexual act, and with\ninsufficient tension they merely stimulate a production of the sexual\nsubstance.\n\nThe weakness of the theory which one finds adopted, _e.g._, in v.\nKrafft-Ebing's description of the sexual process, lies in the fact that\nit has been formed for the sexual activity of the mature man and pays\ntoo little heed to three kinds of relations which should also have been\nelucidated. We refer to the relations as found in the child, in the\nwoman, and in the castrated male. In none of the three cases can we\nspeak of an accumulation of sexual products in the same sense as in the\nman, which naturally renders difficult the general application of this\nscheme; still it may be admitted without any further ado that ways can\nbe found to justify the subordination of even these cases. Nevertheless\none should be cautious about burdening the factor of accumulation of\nsexual products with actions which it seems incapable of supporting.\n\n*Overestimation of the Internal Genitals.*--That sexual excitement can\nbe independent to a considerable extent of the production of sexual\nsubstance seems to be shown by observations on castrated males, in whom\nthe libido sometimes escapes the injury caused by the operation,\nalthough the opposite behavior, which is really the motive for the\noperation, is usually the rule. It is therefore not at all surprising,\nas C. Rieger puts it, that the loss of the male germ glands in maturer\nage should exert no new influence on the psychic life of the individual.\nThe germ glands are really not the sexuality, and the experience with\ncastrated males only verifies what we had long before learned from the\nremoval of the ovaries, namely that it is impossible to do away with the\nsexual character by removing the germ glands. To be sure, castration\nperformed at a tender age, before puberty, comes nearer to this aim, but\nit would seem in this case that besides the loss of the sexual glands we\nmust also consider the inhibition of development and other factors\nwhich are connected with that loss.\n\n*Chemical Theories.*--The truth remains, however, that we are unable to\ngive any information about the nature of the sexual excitement for the\nreason that we do not know with what organ or organs sexuality is\nconnected, since we have seen that the sexual glands have been\noverestimated in this significance. Since surprising discoveries have\ntaught us the important role of the thyroid gland in sexuality, we may\nassume that the knowledge of the essential factors of sexuality are\nstill withheld from us. One who feels the need of filling up the large\ngap in our knowledge with a preliminary assumption may formulate for\nhimself the following theory based on the active substances found in the\nthyroid. Through the appropriate excitement of erogenous zones, as well\nas through other conditions under which sexual excitement originates, a\nmaterial which is universally distributed in the organism becomes\ndisintegrated, the decomposing products of which supply a specific\nstimulus to the organs of reproduction or to the spinal center connected\nwith them. Such a transformation of a toxic stimulus in a particular\norganic stimulus we are already familiar with from other toxic products\nintroduced into the body from without. To treat, if only hypothetically,\nthe complexities of the pure toxic and the physiologic stimulations\nwhich result in the sexual processes is not now our appropriate task. To\nbe sure, I attach no value to this special assumption and I shall be\nquite ready to give it up in favor of another, provided its original\ncharacter, the emphasis on the sexual chemism, were preserved. For this\napparently arbitrary statement is supported by a fact which, though\nlittle heeded, is most noteworthy. The neuroses which can be traced only\nto disturbances of the sexual life show the greatest clinical\nresemblance to the phenomena of intoxication and abstinence which result\nfrom the habitual introduction of pleasure-producing poisonous\nsubstances (alkaloids.)\n\n\nTHE THEORY OF THE LIBIDO\n\nThese assumptions concerning the chemical basis of the sexual excitement\nare in full accord with the auxiliary conception which we formed for the\npurpose of mastering the psychic manifestations of the sexual life. We\nhave determined the concept of _libido_ as that of a force of variable\nquantity which has the capacity of measuring processes and\ntransformations in the spheres of sexual excitement. This libido we\ndistinguished from the energy which is to be generally adjudged to the\npsychic processes with reference to its special origin and thus we\nattribute to it also a qualitative character. In separating libidinous\nfrom other psychic energy we give expression to the assumption that the\nsexual processes of the organism are differentiated from the nutritional\nprocesses through a special chemism. The analyses of perversions and\npsychoneuroses have taught us that this sexual excitement is furnished\nnot only from the so-called sexual parts alone but from all organs of\nthe body. We thus formulate for ourselves the concept of a\nlibido-quantum whose psychic representative we designate as the\nego-libido; the production, increase, distribution and displacement of\nthis ego-libido will offer the possible explanation for the observed\npsycho-sexual phenomena.\n\nBut this ego-libido becomes conveniently accessible to psychoanalytic\nstudy only when the psychic energy is employed on sexual objects, that\nis when it becomes object libido. Then we see it as it concentrates and\nfixes itself on objects, or as it leaves those objects and passes over\nto others from which positions it directs the individual's sexual\nactivity, that is, it leads to partial and temporary extinction of the\nlibido. Psychoanalysis of the so-called transference neuroses (hysteria\nand compulsion neurosis) offers us here a reliable insight.\n\nConcerning the fates of the object libido we also state that it is\nwithdrawn from the object, that it is preserved floating in special\nstates of tension and is finally taken back into the ego, so that it\nagain becomes ego-libido. In contradistinction to the object-libido we\nalso call the ego-libido narcissistic libido. From psychoanalysis we\nlook over the boundary which we are not permitted to pass into the\nactivity of the narcissistic libido and thus form an idea of the\nrelations between the two. The narcissistic or ego-libido appears to us\nas the great reservoir from which the energy for the investment of the\nobject is sent out and into which it is drawn back again, while the\nnarcissistic libido investment of the ego appears to us as the realized\nprimitive state in the first childhood, which only becomes hidden by the\nlater emissions of the libido, and is retained at the bottom behind\nthem.\n\nThe task of a theory of libido of neurotic and psychotic disturbances\nwould have for its object to express in terms of the libido-economy all\nobserved phenomena and disclosed processes. It is easy to divine that\nthe greater significance would attach thereby to the destinies of the\nego-libido, especially where it would be the question of explaining the\ndeeper psychotic disturbances. The difficulty then lies in the fact that\nthe means of our investigation, psychoanalysis, at present gives us\ndefinite information only concerning the transformation of the\nobject-libido, but cannot distinguish without further study the\nego-libido from the other effective energies in the ego.[3]\n\n\nDIFFERENTIATION BETWEEN MAN AND WOMAN\n\nIt is known that the sharp differentiation of the male and female\ncharacter originates at puberty, and it is the resulting difference\nwhich, more than any other factor, decisively influences the later\ndevelopment of personality. To be sure, the male and female dispositions\nare easily recognizable even in infantile life; thus the development of\nsexual inhibitions (shame, loathing, sympathy, etc.) ensues earlier and\nwith less resistance in the little girl than in the little boy. The\ntendency to sexual repression certainly seems much greater, and where\npartial impulses of sexuality are noticed they show a preference for the\npassive form. But, the autoerotic activity of the erogenous zones is the\nsame in both sexes, and it is this agreement that removes the\npossibility of a sex differentiation in childhood as it appears after\npuberty. In respect to the autoerotic and masturbatic sexual\nmanifestations, it may be asserted that the sexuality of the little girl\nhas entirely a male character. Indeed, if one could give a more definite\ncontent to the terms \"masculine and feminine,\" one might advance the\nopinion that _the libido is regularly and lawfully of a masculine\nnature, whether in the man or in the woman; and if we consider its\nobject, this may be either the man or the woman_.[4]\n\nSince becoming acquainted with the aspect of bisexuality I hold this\nfactor as here decisive, and I believe that without taking into account\nthe factor of bisexuality it will hardly be possible to understand the\nactually observed sexual manifestations in man and woman.\n\n*The Leading Zones in Man and Woman.*--Further than this I can only add\nthe following. The chief erogenous zone in the female child is the\nclitoris, which is homologous to the male penis. All I have been able to\ndiscover concerning masturbation in little girls concerned the clitoris\nand not those other external genitals which are so important for the\nlater sexual functions. With few exceptions I myself doubt whether the\nfemale child can be seduced to anything but clitoris masturbation. The\nfrequent spontaneous discharges of sexual excitement in little girls\nmanifest themselves in a twitching of the clitoris, and its frequent\nerections enable the girl to understand correctly even without any\ninstruction the sexual manifestations of the other sex; they simply\ntransfer to the boys the sensations of their own sexual processes.\n\nIf one wishes to understand how the little girl becomes a woman, he must\nfollow up the further destinies of this clitoris excitation. Puberty,\nwhich brings to the boy a great advance of libido, distinguishes itself\nin the girl by a new wave of repression which especially concerns the\nclitoris sexuality. It is a part of the male sexual life that sinks into\nrepression. The reenforcement of the sexual inhibitions produced in the\nwoman by the repression of puberty causes a stimulus in the libido of\nthe man and forces it to increase its capacity; with the height of the\nlibido there is a rise in the overestimation of the sexual, which can be\npresent in its full force only when the woman refuses and denies her\nsexuality. If the sexual act is finally submitted to and the clitoris\nbecomes excited its role is then to conduct the excitement to the\nadjacent female parts, and in this it acts like a chip of pine wood\nwhich is utilized to set fire to the harder wood. It often takes some\ntime for this transference to be accomplished; during which the young\nwife remains anesthetic. This anesthesia may become permanent if the\nclitoris zone refuses to give up its excitability; a condition brought\non by abundant activities in infantile life. It is known that anesthesia\nin women is often only apparent and local. They are anesthetic at the\nvaginal entrance but not at all unexcitable through the clitoris or even\nthrough other zones. Besides these erogenous causes of anesthesia there\nare also psychic causes likewise determined by the repression.\n\nIf the transference of the erogenous excitability from the clitoris to\nthe vagina has succeeded, the woman has thus changed her leading zone\nfor the future sexual activity; the man on the other hand retains his\nfrom childhood. The main determinants for the woman's preference for the\nneuroses, especially for hysteria, lie in this change of the leading\nzone as well as in the repression of puberty. These determinants are\ntherefore most intimately connected with the nature of femininity.\n\n\nTHE OBJECT-FINDING\n\nWhile the primacy of the genital zones is being established through the\nprocesses of puberty, and the erected penis in the man imperiously\npoints towards the new sexual aim, _i.e._, towards the penetration of a\ncavity which excites the genital zone, the object-finding, for which\nalso preparations have been made since early childhood, becomes\nconsummated on the psychic side. While the very incipient sexual\ngratifications are still connected with the taking of nourishment, the\nsexual impulse has a sexual object outside its own body in his mother's\nbreast. This object it loses later, perhaps at the very time when it\nbecomes possible for the child to form a general picture of the person\nto whom the organ granting him the gratification belongs. The sexual\nimpulse later regularly becomes autoerotic, and only after overcoming\nthe latency period is there a resumption of the original relation. It is\nnot without good reason that the suckling of the child at its mother's\nbreast has become a model for every amour. The object-finding is really\na re-finding.[5]\n\n*The Sexual Object of the Nursing Period.*--However, even after the\nseparation of the sexual activity from the taking of nourishment, there\nstill remains from this first and most important of all sexual relations\nan important share, which prepares the object selection and assists in\nreestablishing the lost happiness. Throughout the latency period the\nchild learns to love other persons who assist it in its helplessness and\ngratify its wants; all this follows the model and is a continuation of\nthe child's infantile relations to his wet nurse. One may perhaps\nhesitate to identify the tender feelings and esteem of the child for his\nfoster-parents with sexual love; I believe, however, that a more\nthorough psychological investigation will establish this identity beyond\nany doubt. The intercourse between the child and its foster-parents is\nfor the former an inexhaustible source of sexual excitation and\ngratification of erogenous zones, especially since the parents--or as a\nrule the mother--supplies the child with feelings which originate from\nher own sexual life; she pats it, kisses it, and rocks it, plainly\ntaking it as a substitute for a full-valued sexual object.[6] The mother\nwould probably be terrified if it were explained to her that all her\ntenderness awakens the sexual impulse of her child and prepares its\nfuture intensity. She considers her actions as asexually \"pure\" love,\nfor she carefully avoids causing more irritation to the genitals of the\nchild than is indispensable in caring for the body. But as we know the\nsexual impulse is not awakened by the excitation of genital zones alone.\nWhat we call tenderness will some day surely manifest its influence on\nthe genital zones also. If the mother better understood the high\nsignificance of the sexual impulse for the whole psychic life and for\nall ethical and psychic activities, the enlightenment would spare her\nall reproaches. By teaching the child to love she only fulfills her\nfunction; for the child should become a fit man with energetic sexual\nneeds, and accomplish in life all that the impulse urges the man to do.\nOf course, too much parental tenderness becomes harmful because it\naccelerates the sexual maturity, and also because it \"spoils\" the child\nand makes it unfit to temporarily renounce love or be satisfied with a\nsmaller amount of love in later life. One of the surest premonitions of\nlater nervousness is the fact that the child shows itself insatiable in\nits demands for parental tenderness; on the other hand, neuropathic\nparents, who usually display a boundless tenderness, often with their\ncaressing awaken in the child a disposition for neurotic diseases. This\nexample at least shows that neuropathic parents have nearer ways than\ninheritance by which they can transfer their disturbances to their\nchildren.\n\n*Infantile Fear.*--The children themselves behave from their early\nchildhood as if their attachment to their foster-parents were of the\nnature of sexual love. The fear of children is originally nothing but an\nexpression for the fact that they miss the beloved person. They\ntherefore meet every stranger with fear, they are afraid of the dark\nbecause they cannot see the beloved person, and are calmed if they can\ngrasp that person's hand. The effect of childish fears and of the\nterrifying stories told by nurses is overestimated if one blames the\nlatter for producing the fear in children. Children who are predisposed\nto fear absorb these stories, which make no impression whatever upon\nothers; and only such children are predisposed to fear whose sexual\nimpulse is excessive or prematurely developed, or has become exigent\nthrough pampering. The child behaves here like the adult, that is, it\nchanges its libido into fear when it cannot bring it to gratification,\nand the grown-up who becomes neurotic on account of ungratified libido\nbehaves in his anxiety like a child; he fears when he is alone, _i.e._,\nwithout a person of whose love he believes himself sure, and who can\ncalm his fears by means of the most childish measures.[7]\n\n*Incest Barriers.*--If the tenderness of the parents for the child has\nluckily failed to awaken the sexual impulse of the child prematurely,\n_i.e._, before the physical determinations for puberty appear, and if\nthat awakening has not gone so far as to cause an unmistakable breaking\nthrough of the psychic excitement into the genital system, it can then\nfulfill its task and direct the child at the age of maturity in the\nselection of the sexual object. It would, of course, be most natural for\nthe child to select as the sexual object that person whom it has loved\nsince childhood with, so to speak, a suppressed libido.[8] But owing to\nthe delay of sexual maturity time has been gained for the erection\nbeside the sexual inhibitions of the incest barrier, that moral\nprescription which explicitly excludes from the object selection the\nbeloved person of infancy or blood relation. The observance of this\nbarrier is above all a demand of cultural society which must guard\nagainst the absorption by the family of those interests which it needs\nfor the production of higher social units. Society, therefore, uses\nevery means to loosen those family ties in every individual, especially\nin the boy, which are authoritative in childhood only.[9]\n\nThe object selection, however, is first accomplished in the imagination,\nand the sexual life of the maturing youth has hardly any escape except\nindulgence in phantasies or ideas which are not destined to be brought\nto execution. In the phantasies of all persons the infantile\ninclinations, now reenforced by somatic emphasis, reappear, and among\nthem one finds in regular frequency and in the first place the sexual\nfeeling of the child for the parents. This has usually already been\ndifferentiated by the sexual attraction, the attraction of the son for\nthe mother and of the daughter for the father.[10] Simultaneously with\nthe overcoming and rejection of these distinctly incestuous phantasies\nthere occurs one of the most important as well as one of the most\npainful psychic accomplishments of puberty; it is the breaking away from\nthe parental authority, through which alone is formed that opposition\nbetween the new and old generations which is so important for cultural\nprogress. Many persons are detained at each of the stations in the\ncourse of development through which the individual must pass; and\naccordingly there are persons who never overcome the parental authority\nand never, or very imperfectly, withdraw their affection from their\nparents. They are mostly girls, who, to the delight of their parents,\nretain their full infantile love far beyond puberty, and it is\ninstructive to find that in their married life these girls are incapable\nof fulfilling their duties to their husbands. They make cold wives and\nremain sexually anesthetic. This shows that the apparently non-sexual\nlove for the parents and the sexual love are nourished from the same\nsource, _i.e._, that the first merely corresponds to an infantile\nfixation of the libido.\n\nThe nearer we come to the deeper disturbances of the psychosexual\ndevelopment the more easily we can recognize the evident significance of\nthe incestuous object-selection. As a result of sexual rejection there\nremains in the unconscious of the psychoneurotic a great part or the\nwhole of the psychosexual activity for object finding. Girls with an\nexcessive need for affection and an equal horror for the real demands of\nthe sexual life experience an uncontrollable temptation on the one hand\nto realize in life the ideal of the asexual love and on the other hand\nto conceal their libido under an affection which they may manifest\nwithout self reproach; this they do by clinging for life to the\ninfantile attraction for their parents or brothers or sisters which has\nbeen repressed in puberty. With the help of the symptoms and other\nmorbid manifestations, psychoanalysis can trace their unconscious\nthoughts and translate them into the conscious, and thus easily show to\nsuch persons that they are in love with their consanguinous relations in\nthe popular meaning of the term. Likewise when a once healthy person\nfalls sick after an unhappy love affair, the mechanism of the disease\ncan distinctly be explained as a return of his libido to the persons\npreferred in his infancy.\n\n*The After Effects of the Infantile Object Selection.*--Even those who\nhave happily eluded the incestuous fixation of their libido have not\ncompletely escaped its influence. It is a distinct echo of this phase of\ndevelopment that the first serious love of the young man is often for a\nmature woman and that of the girl for an older man equipped with\nauthority--_i.e._, for persons who can revive in them the picture of the\nmother and father. Generally speaking object selection unquestionably\ntakes place by following more freely these prototypes. The man seeks\nabove all the memory picture of his mother as it has dominated him since\nthe beginning of childhood; this is quite consistent with the fact that\nthe mother, if still living, strives against this, her renewal, and\nmeets it with hostility. In view of this significance of the infantile\nrelation to the parents for the later selection of the sexual object, it\nis easy to understand that every disturbance of this infantile relation\nbrings to a head the most serious results for the sexual life after\npuberty. Jealousy of the lover, too, never lacks the infantile sources\nor at least the infantile reinforcement. Quarrels between parents and\nunhappy marital relations between the same determine the severest\npredispositions for disturbed sexual development or neurotic diseases in\nthe children.\n\nThe infantile desire for the parents is, to be sure, the most important,\nbut not the only trace revived in puberty which points the way to the\nobject selection. Other dispositions of the same origin permit the man,\nstill supported by his infancy, to develop more than one single sexual\nseries and to form different determinations for the object\nselection.[11]\n\n*Prevention of Inversion.*--One of the tasks imposed in the object\nselection consists in not missing the opposite sex. This, as we know, is\nnot solved without some difficulty. The first feelings after puberty\noften enough go astray, though not with any permanent injury. Dessoir\nhas called attention to the normality of the enthusiastic friendships\nformed by boys and girls with their own sex. The greatest force which\nguards against a permanent inversion of the sexual object is surely the\nattraction exerted by the opposite sex characters on each other. For\nthis we can give no explanation in connection with this discussion. This\nfactor, however, does not in itself suffice to exclude the inversion;\nbesides this there are surely many other supporting factors. Above all,\nthere is the authoritative inhibition of society; experience shows that\nwhere the inversion is not considered a crime it fully corresponds to\nthe sexual inclinations of many persons. Moreover, it may be assumed\nthat in the man the infantile memories of the mother's tenderness, as\nwell as that of other females who cared for him as a child,\nenergetically assist in directing his selection to the woman, while the\nearly sexual intimidation experienced through the father and the\nattitude of rivalry existing between them deflects the boy from the same\nsex. Both factors also hold true in the case of the girl whose sexual\nactivity is under the special care of the mother. This results in a\nhostile relation to the same sex which decisively influences the object\nselection in the normal sense. The bringing up of boys by male persons\n(slaves in the ancient times) seems to favor homosexuality; the\nfrequency of inversion in the present day nobility is probably explained\nby their employment of male servants, and by the scant care that mothers\nof that class give to their children. It happens in some hysterics that\none of the parents has disappeared (through death, divorce, or\nestrangement), thus permitting the remaining parent to absorb all the\nlove of the child, and in this way establishing the determinations for\nthe sex of the person to be selected later as the sexual object; thus a\npermanent inversion is made possible.\n\n\nSUMMARY\n\nIt is now time to attempt a summing-up. We have started from the\naberrations of the sexual impulse in reference to its object and aim and\nhave encountered the question whether these originate from a congenital\npredisposition, or whether they are acquired in consequence of\ninfluences from life. The answer to this question was reached through an\nexamination of the relations of the sexual life of psychoneurotics, a\nnumerous group not very remote from the normal. This examination has\nbeen made through psychoanalytic investigations. We have thus found that\na tendency to all perversions might be demonstrated in these persons in\nthe form of unconscious forces revealing themselves as symptom creators\nand we could say that the neurosis is, as it were, the negative of the\nperversion. In view of the now recognized great diffusion of tendencies\nto perversion the idea forced itself upon us that the disposition to\nperversions is the primitive and universal disposition of the human\nsexual impulse, from which the normal sexual behavior develops in\nconsequence of organic changes and psychic inhibitions in the course of\nmaturity. We hoped to be able to demonstrate the original disposition in\nthe infantile life; among the forces restraining the direction of the\nsexual impulse we have mentioned shame, loathing and sympathy, and the\nsocial constructions of morality and authority. We have thus been forced\nto perceive in every fixed aberration from the normal sexual life a\nfragment of inhibited development and infantilism. The significance of\nthe variations of the original dispositions had to be put into the\nforeground, but between them and the influences of life we had to assume\na relation of cooeperation and not of opposition. On the other hand, as\nthe original disposition must have been a complex one, the sexual\nimpulse itself appeared to us as something composed of many factors,\nwhich in the perversions becomes separated, as it were, into its\ncomponents. The perversions, thus prove themselves to be on the one hand\ninhibitions, and on the other dissociations from the normal development.\nBoth conceptions became united in the assumption that the sexual impulse\nof the adult due to the composition of the diverse feelings of the\ninfantile life became formed into one unit, one striving, with one\nsingle aim.\n\nWe also added an explanation for the preponderance of perversive\ntendencies in the psychoneurotics by recognizing in these tendencies\ncollateral fillings of side branches caused by the shifting of the main\nriver bed through repression, and we then turned our examination to the\nsexual life of the infantile period.[12] We found it regrettable that\nthe existence of a sexual life in infancy has been disputed, and that\nthe sexual manifestations which have been often observed in children\nhave been described as abnormal occurrences. It rather seemed to us that\nthe child brings along into the world germs of sexual activity and that\neven while taking nourishment it at the same time also enjoys a sexual\ngratification which it then seeks again to procure for itself through\nthe familiar activity of \"thumbsucking.\" The sexual activity of the\nchild, however, does not develop in the same measure as its other\nfunctions, but merges first into the so-called latency period from the\nage of three to the age of five years. The production of sexual\nexcitation by no means ceases at this period but continues and furnishes\na stock of energy, the greater part of which is utilized for aims other\nthan sexual; namely, on the one hand for the delivery of sexual\ncomponents for social feelings, and on the other hand (by means of\nrepression and reaction formation) for the erection of the future sexual\nbarriers. Accordingly, the forces which are destined to hold the sexual\nimpulse in certain tracks are built up in infancy at the expense of the\ngreater part of the perverse sexual feelings and with the assistance of\neducation. Another part of the infantile sexual manifestations escapes\nthis utilization and may manifest itself as sexual activity. It can then\nbe discovered that the sexual excitation of the child flows from diverse\nsources. Above all gratifications originate through the adapted sensible\nexcitation of so-called erogenous zones. For these probably any skin\nregion or sensory organ may serve; but there are certain distinguished\nerogenous zones the excitation of which by certain organic mechanisms is\nassured from the beginning. Moreover, sexual excitation originates in\nthe organism, as it were, as a by-product in a great number of\nprocesses, as soon as they attain a certain intensity; this especially\ntakes place in all strong emotional excitements even if they be of a\npainful nature. The excitations from all these sources do not yet unite,\nbut they pursue their aim individually--this aim consisting merely in\nthe gaining of a certain pleasure. The sexual impulse of childhood is\ntherefore objectless or _autoerotic_.\n\nStill during infancy the erogenous zone of the genitals begins to make\nitself noticeable, either by the fact that like any other erogenous zone\nit furnishes gratification through a suitable sensible stimulus, or\nbecause in some incomprehensible way the gratification from other\nsources causes at the same time the sexual excitement which has a\nspecial connection with the genital zone. We found cause to regret that\na sufficient explanation of the relations between sexual gratification\nand sexual excitement, as well as between the activity of the genital\nzone and the remaining sources of sexuality, was not to be attained.\n\nWe were unable to state what amount of sexual activity in childhood\nmight be designated as normal to the extent of being incapable of\nfurther development. The character of the sexual manifestation showed\nitself to be preponderantly masturbatic. We, moreover, verified from\nexperience the belief that the external influences of seduction, might\nproduce premature breaches in the latency period leading as far as the\nsuppression of the same, and that the sexual impulse of the child really\nshows itself to be polymorphous-perverse; furthermore, that every such\npremature sexual activity impairs the educability of the child.\n\nDespite the incompleteness of our examinations of the infantile sexual\nlife we were subsequently forced to attempt to study the serious changes\nproduced by the appearance of puberty. We selected two of the same as\ncriteria, namely, the subordination of all other sources of the sexual\nfeeling to the primacy of the genital zones, and the process of object\nfinding. Both of them are already developed in childhood. The first is\naccomplished through the mechanism of utilizing the fore-pleasure,\nwhereby all other independent sexual acts which are connected with\npleasure and excitement become preparatory acts for the new sexual aim,\nthe voiding of the sexual products, the attainment of which under\nenormous pleasure puts an end to the sexual feeling. At the same time we\nhad to consider the differentiation of the sexual nature of man and\nwoman, and we found that in order to become a woman a new repression is\nrequired which abolishes a piece of infantile masculinity, and prepares\nthe woman for the change of the leading genital zones. Lastly, we found\nthe object selection, tracing it through infancy to its revival in\npuberty; we also found indications of sexual inclinations on the part of\nthe child for the parents and foster-parents, which, however, were\nturned away from these persons to others resembling them by the incest\nbarriers which had been erected in the meantime. Let us finally add that\nduring the transition period of puberty the somatic and psychic\nprocesses of development proceed side by side, but separately, until\nwith the breaking through of an intense psychic love-stimulus for the\ninnervation of the genitals, the normally demanded unification of the\nerotic function is established.\n\n*The Factors Disturbing the Development.*--As we have already shown by\ndifferent examples, every step on this long road of development may\nbecome a point of fixation and every joint in this complicated structure\nmay afford opportunity for a dissociation of the sexual impulse. It\nstill remains for us to review the various inner and outer factors which\ndisturb the development, and to mention the part of the mechanism\naffected by the disturbance emanating from them. The factors which we\nmention here in a series cannot, of course, all be in themselves of\nequal validity and we must expect to meet with difficulties in the\nassigning to the individual factors their due importance.\n\n*Constitution and Heredity.*--In the first place, we must mention here\nthe congenital _variation of the sexual constitution_, upon which the\ngreatest weight probably falls, but the existence of which, as may be\neasily understood, can be established only through its later\nmanifestations and even then not always with great certainty. We\nunderstand by it a preponderance of one or another of the manifold\nsources of the sexual excitement, and we believe that such a difference\nof disposition must always come to expression in the final result, even\nif it should remain within normal limits. Of course, we can also imagine\ncertain variations of the original disposition that even without further\naid must necessarily lead to the formation of an abnormal sexual life.\nOne can call these \"degenerative\" and consider them as an expression of\nhereditary deterioration. In this connection I have to report a\nremarkable fact. In more than half of the severe cases of hysteria,\ncompulsion neuroses, etc., which I have treated by psychotherapy, I have\nsucceeded in positively demonstrating that their fathers have gone\nthrough an attack of syphilis before marriage; they have either suffered\nfrom tabes or general paresis, or there was a definite history of lues.\nI expressly add that the children who were later neurotic showed\nabsolutely no signs of hereditary lues, so that the abnormal sexual\nconstitution was to be considered as the last off-shoot of the luetic\nheredity. As far as it is now from my thoughts to put down a descent\nfrom syphilitic parents as a regular and indispensable etiological\ndetermination of the neuropathic constitution, I nevertheless maintain\nthat the coincidence observed by me is not accidental and not without\nsignificance.\n\nThe hereditary relations of the positive perverts are not so well known\nbecause they know how to avoid inquiry. Still there is reason to believe\nthat the same holds true in the perversions as in the neuroses. We often\nfind perversions and psychoneuroses in the different sexes of the same\nfamily, so distributed that the male members, or one of them, is a\npositive pervert, while the females, following the repressive tendencies\nof their sex, are negative perverts or hysterics. This is a good example\nof the substantial relations between the two disturbances which I have\ndiscovered.\n\n*Further Elaboration.*--It cannot, however, be maintained that the\nstructure of the sexual life is rendered finally complete by the\naddition of the diverse components of the sexual constitution. On the\ncontrary, qualifications continue to appear and new possibilities\nresult, depending upon the fate experienced by the sexual streams\noriginating from the individual sources. This _further elaboration_ is\nevidently the final and decisive one while the constitution described as\nuniform may lead to three final issues. If all the dispositions assumed\nto be abnormal retain their relative proportion, and are strengthened\nwith maturity, the ultimate result can only be a perverse sexual life.\nThe analysis of such abnormally constituted dispositions has not yet\nbeen thoroughly undertaken, but we already know cases that can be\nreadily explained in the light of these theories. Authors believe, for\nexample, that a whole series of fixation perversions must necessarily\nhave had as their basis a congenital weakness of the sexual impulse. The\nstatement seems to me untenable in this form, but it becomes ingenious\nif it refers to a constitutional weakness of one factor in the sexual\nimpulse, namely, the genital zone, which later in the interests of\npropagation accepts as a function the sum of the individual sexual\nactivities. In this case the summation which is demanded in puberty must\nfail and the strongest of the other sexual components continues its\nactivity as a perversion.[13]\n\n*Repression.*--Another issue results if in the course of development\ncertain powerful components experience a _repression_--which we must\ncarefully note is not a suspension. The excitations in question are\nproduced as usual but are prevented from attaining their aim by psychic\nhindrances, and are driven off into many other paths until they express\nthemselves in a symptom. The result can be an almost normal sexual\nlife--usually a limited one--but supplemented by psychoneurotic disease.\nIt is these cases that become so familiar to us through the\npsychoanalytic investigation of neurotics. The sexual life of such\npersons begins like that of perverts, a considerable part of their\nchildhood is filled up with perverse sexual activity which occasionally\nextends far beyond the period of maturity, but owing to inner reasons a\nrepressive change then results--usually before puberty, but now and then\neven much later--and from this point on without any extinction of the\nold feelings there appears a neurosis instead of a perversion. One may\nrecall here the saying, \"Junge Hure, alte Betschwester,\"--only here\nyouth has turned out to be much too short. The relieving of the\nperversion by the neurosis in the life of the same person, as well as\nthe above mentioned distribution of perversion and hysteria in different\npersons of the same family, must be placed side by side with the fact\nthat the neurosis is the negative of the perversion.\n\n*Sublimation.*--The third issue in abnormal constitutional dispositions\nis made possible by the process of \"sublimation,\" through which the\npowerful excitations from individual sources of sexuality are discharged\nand utilized in other spheres, so that a considerable increase of\npsychic capacity results from an, in itself dangerous, predisposition.\nThis forms one the sources of artistic activity, and, according as such\nsublimation is complete or incomplete, the analysis of the character of\nhighly gifted, especially of artistically disposed persons, will show\nany proportionate, blending between productive ability, perversion, and\nneurosis. A sub-species of sublimation is the suppression through\n_reaction-formation_, which, as we have found, begins even in the\nlatency period of infancy, only to continue throughout life in\nfavorable cases. What we call the _character_ of a person is built up to\na great extent from the material of sexual excitations; it is composed\nof impulses fixed since infancy and won through sublimation, and of such\nconstructions as are destined to suppress effectually those perverse\nfeelings which are recognized as useless. The general perverse sexual\ndisposition of childhood can therefore be esteemed as a source of a\nnumber of our virtues, insofar as it incites their creation through the\nformation of reactions.[14]\n\n*Accidental Experiences.*--All other influences lose in significance\nwhen compared with the sexual discharges, shifts of repressions, and\nsublimations; the inner determinations for the last two processes are\ntotally unknown to us. He who includes repressions and sublimations\namong constitutional predispositions, and considers them as the living\nmanifestations of the same, has surely the right to maintain that the\nfinal structure of the sexual life is above all the result of the\ncongenital constitution. No intelligent person, however, will dispute\nthat in such a cooeperation of factors there is also room for the\nmodifying influences of occasional factors derived from experience in\nchildhood and later on.\n\nIt is not easy to estimate the effectiveness of the constitutional and\nof the occasional factors in their relation to each other. Theory is\nalways inclined to overestimate the first while therapeutic practice\nrenders prominent the significance of the latter. By no means should it\nbe forgotten that between the two there exists a relation of cooeperation\nand not of exclusion. The constitutional factor must wait for\nexperiences which bring it to the surface, while the occasional needs\nthe support of the constitutional factor in order to become effective.\nFor the majority of cases one can imagine a so-called \"etiological\ngroup\" in which the declining intensities of one factor become balanced\nby the rise in the others, but there is no reason to deny the existence\nof extremes at the ends of the group.\n\nIt would be still more in harmony with psychoanalytic investigation if\nthe experiences of early childhood would get a place of preference among\nthe occasional factors. The one etiological group then becomes split up\ninto two which may be designated as the dispositional and the definitive\ngroups. Constitution and occasional infantile experiences are just as\ncooeperative in the first as disposition and later traumatic experiences\nin the second group. All the factors which injure the sexual development\nshow their effect in that they produce a _regression_, or a return to a\nformer phase of development.\n\nWe may now continue with our task of enumerating the factors which have\nbecome known to us as influential for the sexual development, whether\nthey be active forces or merely manifestations of the same.\n\n*Prematurity.*--Such a factor is the spontaneous sexual _prematurity_\nwhich can be definitely demonstrated at least in the etiology of the\nneuroses, though in itself it is as little adequate for causation as the\nother factors. It manifests itself in a breaking through, shortening, or\nsuspending of the infantile latency period and becomes a cause of\ndisturbances inasmuch as it provokes sexual manifestations which, either\non account of the unready state of the sexual inhibitions or because of\nthe undeveloped state of the genital system, can only carry along the\ncharacter of perversions. These tendencies to perversion may either\nremain as such, or after the repression sets in they may become motive\npowers for neurotic symptoms; at all events, the sexual prematurity\nrenders difficult the desirable later control of the sexual impulse by\nthe higher psychic influences, and enhances the compulsive-like\ncharacter which even without this prematurity would be claimed by the\npsychic representatives of the impulse. Sexual prematurity often runs\nparallel with premature intellectual development; it is found as such in\nthe infantile history of the most distinguished and most productive\nindividuals, and in such connection it does not seem to act as\npathogenically as when appearing isolated.\n\n*Temporal Factors.*--Just like prematurity, other factors, which under\nthe designation of _temporal_ can be added to prematurity, also demand\nconsideration. It seems to be phylogenetically established in what\nsequence the individual impulsive feelings become active, and how long\nthey can manifest themselves before they succumb to the influence of a\nnewly appearing active impulse or to a typical repression. But both in\nthis temporal succession as well as in the duration of the same,\nvariations seem to occur, which must exercise a definite influence on\nthe experience. It cannot be a matter of indifference whether a certain\nstream appears earlier or later than its counterstream, for the effect\nof a repression cannot be made retrogressive; a temporal deviation in\nthe composition of the components regularly produces a change in the\nresult. On the other hand impulsive feelings which appear with special\nintensity often come to a surprisingly rapid end, as in the case of the\nheterosexual attachment of the later manifest homosexuals. The strivings\nof childhood which manifest themselves most impetuously do not justify\nthe fear that they will lastingly dominate the character of the\ngrown-up; one has as much right to expect that they will disappear in\norder to make room for their counterparts. (Harsh masters do not rule\nlong.) To what one may attribute such temporal confusions of the\nprocesses of development we are hardly able to suggest. A view is opened\nhere to a deeper phalanx of biological, and perhaps also historical\nproblems, which we have not yet approached within fighting distance.\n\n*Adhesion.*--The significance of all premature sexual manifestations is\nenhanced by a psychic factor of unknown origin which at present can be\nput down only as a psychological preliminary. I believe that it is the\n_heightened adhesion_ or _fixedness_ of these impressions of the sexual\nlife which in later neurotics, as well as in perverts, must be added for\nthe completion of the other facts; for the same premature sexual\nmanifestations in other persons cannot impress themselves deeply enough\nto repeat themselves compulsively and to succeed in prescribing the way\nfor the sexual impulse throughout later life. Perhaps a part of the\nexplanation for this adhesion lies in another psychic factor which we\ncannot miss in the causation of the neuroses, namely, in the\npreponderance which in the psychic life falls to the share of memory\ntraces as compared with recent impressions. This factor is apparently\ndependent on the intellectual development and grows with the growth of\npersonal culture. In contrast to this the savage has been characterized\nas \"the unfortunate child of the moment.\"[15] Owing to the oppositional\nrelation existing between culture and the free development of sexuality,\nthe results of which may be traced far into the formation of our life,\nthe problem how the sexual life of the child evolves is of very little\nimportance for the later life in the lower stages of culture and\ncivilization, and of very great importance in the higher.\n\n*Fixation.*--The influence of the psychic factors just mentioned favored\nthe development of the accidentally experienced impulses of the\ninfantile sexuality. The latter (especially in the form of seductions\nthrough other children or through adults) produce the material which,\nwith the help of the former, may become fixed as a permanent\ndisturbance. A considerable number of the deviations from the normal\nsexual life observed later have been thus established in neurotics and\nperverts from the beginning through the impressions received during the\nalleged sexually free period of childhood. The causation is produced by\nthe responsiveness of the constitution, the prematurity, the quality of\nheightened adhesion, and the accidental excitement of the sexual impulse\nthrough outside influence.\n\nThe unsatisfactory conclusions which have resulted from this\ninvestigation of the disturbances of the sexual life is due to the fact\nthat we as yet know too little concerning the biological processes in\nwhich the nature of sexuality consists to form from our isolated\nexaminations a satisfactory theory for the explanation of either the\nnormal or the pathological.\n\n[1] The differences will be emphasized in the schematic representation\ngiven in the text. To what extent the infantile sexuality approaches the\ndefinitive sexual organization through its object selection has been\ndiscussed before (p. 60).\n\n[2] See my work, Wit and its Relation to the Unconscious, translated by\nA.A. Brill, Moffat Yard Pub. Co., New York: \"The fore-pleasure gained by\nthe technique of wit is utilized for the purpose of setting free a\ngreater pleasure by the removal of inner inhibitions.\"\n\n[3] Cf. Zur Einfuehrung des Narzismus, Jahrbuch der Psychoanalyse, VI,\n1913.\n\n[4] It is necessary to make clear that the conceptions \"masculine\" and\n\"feminine,\" whose content seems so unequivocal to the ordinary meaning,\nbelong to the most confused terms in science and can be cut up into at\nleast three paths. One uses masculine and feminine at times in the sense\nof activity and passivity, again, in the biological sense, and then also\nin the sociological sense. The first of these three meanings is the\nessential one and the only one utilizable in psychoanalysis. It agrees\nwith the masculine designation of the libido in the text above, for the\nlibido is always active even when it is directed to a passive aim. The\nsecond, the biological significance of masculine and feminine, is the\none which permits the clearest determination. Masculine and feminine are\nhere characterized by the presence of semen or ovum and through the\nfunctions emanating from them. The activity and its secondary\nmanifestations, like stronger developed muscles, aggression, a greater\nintensity of libido, are as a rule soldered to the biological\nmasculinity but not necessarily connected with it, for there are species\nof animals in whom these qualities are attributed to the female. The\nthird, the sociological meaning, receives its content through the\nobservation of the actual existing male and female individuals. The\nresult of this in man is that there is no pure masculinity or feminity\neither in the biological or psychological sense. On the contrary every\nindividual person shows a mixture of his own biological sex\ncharacteristics with the biological traits of the other sex and a union\nof activity and passivity; this is the case whether these psychological\ncharacteristic features depend on the biological or whether they are\nindependent of it.\n\n[5] Psychoanalysis teaches that there are two paths of object-finding;\nthe first is the one discussed in the text which is guided by the early\ninfantile prototypes. The second is the narcissistic which seeks its own\nego and finds it in the other. The latter is of particularly great\nsignificance for the pathological outcomes, but does not fit into the\nconnection treated here.\n\n[6] Those to whom this conception appears \"wicked\" may read Havelock\nEllis's treatise on the relations between mother and child which\nexpresses almost the same ideas (The Sexual Impulse, p. 16).\n\n[7] For the explanation of the origin of the infantile fear I am\nindebted to a three-year-old boy whom I once heard calling from a dark\nroom: \"Aunt, talk to me, I am afraid because it is dark.\" \"How will that\nhelp you,\" answered the aunt; \"you cannot see anyhow.\" \"That's nothing,\"\nanswered the child; \"if some one talks then it becomes light.\"--He was,\nas we see, not afraid of the darkness but he was afraid because he\nmissed the person he loved, and he could promise to calm down as soon as\nhe was assured of her presence.\n\n[8] Cf. here what was said on page 83 concerning the object selection of\nthe child; the \"tender stream.\"\n\n[9] The incest barrier probably belongs to the historical acquisitions\nof humanity and like other moral taboos it must be fixed in many\nindividuals through organic heredity. (Cf. my work, Totem and Taboo,\n1913.) Psychoanalytic studies show, however, how intensively the\nindividual struggles with the incest temptations during his development\nand how frequently he puts them into phantasies and even into reality.\n\n[10] Compare the description concerning the inevitable relation in the\nOedipus legend (The Interpretation of Dreams, p. 222, translated by A.A.\nBrill, The Macmillan Co., New York, and Allen & Unwin, London).\n\n[11] Innumerable peculiarities of the human love-life as well as the\ncompulsiveness of being in love itself can surely only be understood\nthrough a reference to childhood or as an effective remnant of the same.\n\n[12] This was true not only of the \"negative\" tendencies to perversion\nappearing in the neurosis, but also of the so-called positive\nperversions. The latter are not only to be attributed to the fixation of\nthe infantile tendencies, but also to regression to these tendencies\nowing to the misplacement of other paths of the sexual stream. Hence the\npositive perversions are also accessible to psychoanalytic therapy. (Cf.\nthe works of Sadger, Ferenczi, and Brill.)\n\n[13] Here one often sees that at first a normal sexual stream begins at\nthe age of puberty, but owing to its inner weakness it breaks down at\nthe first outer hindrance and then changes from regression, to perverse\nfixation.\n\n[14] That keen observer of human nature, E. Zola, describes a girl in\nhis book, La Joie de vivre, who in cheerful self renunciation offers all\nshe has in possession or expectation, her fortune and her life's hopes\nto those she loves without thought of return. The childhood of this girl\nwas dominated by an insatiable desire for love which whenever she was\ndepreciated caused her to merge into a fit of cruelty.\n\n[15] It is possible that the heightened adhesion is only the result of a\nspecial intensive somatic sexual manifestation of former years.\n\n\n\n\nINDEX\n\n\nAberrations (see Perversions)\n  a fragment of inhibited development, 89\n  Sexual, 1, 13, 14\n  shown by the psychoneurotic, 29\n  with animals, 13\n\nAbsolute Inversion (sexual object of the same sex), 2\n\nActivity and Passivity in sexual aim in exhibitionism, 21\n  of Sadism and Masochism, 23\n  precursors and masculine and feminine, 59\n\nActivity, Muscular, 63\n\nAdhesion, heightened, or fixedness of impressions of sexual life, 99\n  may be only result of a special intensive somatic sexual manifestation of former years, 99\n\nAffective Processes, 64\n  pathogenic action of, 64\n  value of unconscious thought formation, 27\n\nAggression, Sadism and Masochism not attributable to mixture of, 24\n  taint of, shown by sexuality of most men, 22\n\nAgoraphobia and neurotic disturbances of walking, 64, note 22\n\nAims of impulses distinguish them from one another, 31\n\nAlgolagnia, 22\n\nAlkaloids, introduction of, analogous in neuroses and phenomena of intoxication and abstinence, 76\n\nAmbivalence, 59\n\nAmnesia, Infantile, 37\n  connected with infantile sexual activity, 51\n  and hysterical compared, 39\n\nAmphigenous inversion, 2\n\nAnal Erotic, 10, note 11\n  Zone, activity of, 47\n    erogenous significance of, 48\n    masturbatic irritation of, 49\n\nAndrogyny, 8\n\nAnesthesia, causes of, are partly psychic, 81\n  continuance of, caused by retention of clitoris excitability, 81\n  of newly married women, 80\n  of wives due to parent complex, 85\n  of women often only apparent and local, 81\n  of women only at vaginal entrance, 81\n\nAnimals as sexual objects, 13\n\nAnus (see also Anal)\n  as aim of inverts, 12; 17\n  especially frequent example of transgression, 29\n  part played by erogenous zone in, 32\n\nAnxiety on railroads, 63\n\nArchaic constitution, 10, note 11\n\nArduin, Dr., 9, note 11\n\nAttractions connected with pleasure, 70\n\nAutoerotism, the gratification of sexual impulse on own body, 43\n  separation of, from object love, not temporal, 55, note 19\n  essential, of infantile sexuality, 58\n  of erogenous zones, same in boy and girl, 79\n  regular, of sexual impulse, 81\n\n\nBaths, warm, therapeutic effects of, 62\n\nBayer, 40, note 6\n\nBeautiful, concept of, 21\n  a quality of excitation, 70\n\nBell, S., 37,\n  note 2; 55,\n  note 19\n\nBinet; 19; 34\n\nBirth theories, 57\n\nBisexuality, Relation of, 7\n  as explanation of inversion, 9, note 11\n    Sadism and Masochism, 24\n  necessary to understanding of sexual in man and woman, 80\n\nBladder, disturbances of childhood sexual in nature, 51\n\nBleuler, 37, note 2; 60\n\nBloch, I., 1, note 1; 5; 16\n\nBreast, rubbing of, 43\n  woman's, as erogenous zone, 71\n\n\nCadavers, 25\n\nCannibalistic pregenital phase, 59\n\nCastration complex, 22; 56\n  of males does not always injure sexual libido, 75\n\nCatarrh, intestinal, produces irritations in anal zone, 48\n\nCathartic treatment, 26\n\nCharacter built up from the material of sexual excitations, 96\n  composed of impulses fixed since infancy and won through sublimation, 96\n  of individual determined by infantile sexual activity, 50\n\nChemical theories of sexual excitement, 76\n\nChevalier, 7; 9, note 11\n\nChildish, see Infantile\n\nChildren and neurotics compared, 38\n  as sexual objects, 13\n  cruelty especially characteristic of, 30\n  educability of, impaired by premature sexual activity, 91\n  impressionability of, 38\n  in school, behavior of and germinating sexuality, 64\n  sexual life of, 40\n\nClitoris, chief erogenous zone in female child, 80\n  erection of, in little girls, 80\n  excitability retained causes continuance of anesthesia, 81\n  excitation, destinies of, 80\n    conducts excitement to adjacent female parts, 80\n    transfer of, to other parts, takes time, 80\n  sexuality is a part of male sexual life, 80\n  sexuality repressed in girl at puberty, 80\n\nCoitus, 36\n\nColin, 23\n\nComplex, castration, 22; 56\n  Oedipus, 85\n  parent, 15, note 14\n    strongest in girls, 85\n\nCompulsion emanating from unconscious psychic material, 51\n  inversion is perceived as a morbid, 3\n  neurosis, 32\n  psychoanalysis enlightens ego libido, 77\n  from fixation on erogenous zones in infancy, 77\n\nCongeniality in inversions, 4\n  of perversions in all persons, 34\n\nConscience, 22\n\nConstitutional factor, relation of, to occasional 96\n\nContrary Sexuals, 2\n\nConversion, 27\n\nCoprophilic smell desire, 20, note 19\n\nCopulation, 14\n\nCourting, 22\n\nCraving, best English word for libido, 1, note 2\n\nCruelty and sexual impulse most intimately connected, 23\n  as component of infantile sexual life regarding others as sexual objects, 53\n  especially near the childish character, 54\n  partial desires as carriers of impulses of, 30\n\nCulture and sex, 41\n\n\nDangers of fore-pleasure, 72\n\nDegeneration, nervous, 4\n  high ethical culture in, 5\n\nDementia praecox, 26\n\nDesire, coprophilic smell, 20, note 19\n  for knowledge, 55\n  immense sexual, in hysteria, 28\n  partial, 29\n\nDessoir, 87\n\nDonation, idea of, 48; 49\n\nDrinking, desire for, in former thumbsuckers, 44\n\n\nEar lobe pulling, 42\n\nEating, sexuality of, 66\n\nEgo-Libido (see Libido)\n\nEllis, H., 1, note 1; 6; 8; 23; 43; 52, note 18\n\nEnd Pleasure (see Gratification, Orgasm, Pleasure)\n  new to age after puberty, 72\n\nEnuresis nocturna corresponds to a pollution, 51\n\nErection of clitoris in little girls, 80\n  of penis, a somatic sign of sexual excitation, 69\n\nErogenous action of pain, 65\n  functions, disturbance of, in lip zone, 66\n  significance of anal zone, 48\n  zones, partial impulses and, 31\n    significance of in psychoneuroses, 32\n    preponderance of special, in psychoneuroses, 34\n    source of sexual feelings of infantile years, 41\n    lips as, 44\n    characters of, 45\n    predestined, 46\n    show same characters as hysterogenous, 46\n    any part of body may become, 46, note 12\n    significance of anal zone, 48\n    premature activity in, indicated by cruelty, 54\n    parts of skin called, 65\n    one of three ways of stimulation of sexual apparatus, 69\n    their manner of adjustment to new order, 70\n    role of, in preparing sexual excitation, 70\n    increase tension, 71\n    make possible the gratification pleasure, 72\n    contribute unusual pleasure in infantile life, 72\n    connected anatomically with centers producing tension, 74\n    autoerotism of, same in boy and girl, 79\n    chief, in female child is the clitoris, 80\n    changed from clitoris to vagina, mark of womanhood, 81\n    change of leading, determines woman's preference for neuroses, 81\n    gratified by intercourse between child and foster parents, 82\n\nEtiological group, 97\n  composed of dispositional and definitive groups, 97\n\nEulenberg, 1, note 1\n\nExcitement enhanced by preliminary activities, 14\n    hunger, 16\n  influences, three kinds of, 62\n  sexual, nature of, entirely unfamiliar, 66\n    prepared by erogenous zones, 70\n    result of any of three kinds of stimuli, 69\n\nExhibitionism (see Looking, Peeping, Voyeur)\n  as a perversion, 21\n  partial desires as carriers of, 30\n  the eye as erogenous zone in, 32\n  as component of infantile sexual life, 53\n\nEye as erogenous zone, 32; 70\n\n\nFaith, 15\n\nFather, sexual intimidation experienced through, averts inversion, 88\n\nFear, infantile, 83\n    only expresses child's missing beloved person, 83\n  influence of, sexually exciting, 64\n  of being alone alike in child and neurotic, 84\n  of dark, infantile, 83\n  of grown up neurotic like that of children, 84\n  only children with excessive sexual impulse disposed to, 83\n  sought as sexual excitement, 64\n\nFeces, licking of, 25\n  retention of, a source of pleasure, 48\n    a cause of constipation, 49\n\nFeelings, perverted, 34\n\nFemale (see Masculine and Feminine)\n\nFemale child, entirely made character of in autoerotism and masturbation, 79\n\nFere, 23\n\nFerenczi, 15, note 14\n\nFetichism, 18\n  Binet's findings in, 34\n  nothing in unconscious streams of thought inclining to, 30\n  of foot, 20, note 19\n\nFixation, 99\n  of impulses accidentally experienced, 99\n\nFliess, W., 10, note 11; 29, note 26; 41, note 7\n\nFoot, as unfit substitute for sexual object, 18\n  fetichism of, 20, note 19\n\nFore-Pleasure, connection of, with infantile life strengthened by pathogenic role, 72\n  dangers of, 72\n  is that of excitation of erogenous zones, 72\n  mechanism contains danger to attainment of normal sexual aim, 72\n  primacy of genital zones and the, 69\n  same as that furnished by infantile sexual impulse, 72\n  too much endangers attainment of normal sexual aim, 72\n\nFur, 19\n\nFusions, 26\n  activity of, 49\n\n\nGenital zone, primacy of, 69\n  external, in woman, so important for later sexual functions, 80\n  overestimation of internal, 75\n  gratification of, 52\n\nGenitals, erogenous zones behave like real, in hysteria, 32\n  looking only at, becomes a perversion, 21\n  male, in all persons, the infantile sexual theory, 56\n  mouth and anus playing role of, 29\n  opening of female, unknown to children, 58\n  primacy of, intended by nature, 50\n  rubbed by children while pleasure sucking, 43\n  sexual impulse of reawakens, 50\n  touching of, caused by strong excitements in children, 64\n\nGley, E., 9, note 11\n\nGlobus, hysterical, in former thumbsuckers, 45\n\nGratification pleasure of orgasm, 71\n  sexual, 3; 14\n  picture of, in suckling, 44\n  relation of, to sexual excitement not explained, 91\n  the best hypnotic, 43\n\nGroos, K., 37, note 2\n\n\nHair, 18\n\nHalban, 8\n\nHall, G.S., 37, note 2\n\nHemorrhoids and neurotic states, 48\n\nHeredity, 36\n\nHerman, G., 10, note 11\n\nHermaphrodites, psychosexual, 2; 7\n  anatomical, 7\n\nHetero-sexual feelings, 3, note 5; 29, note 26\n  intercourse, dangers of, fix inversions, 6\n\nHirschfeld, M., 1, note 1; 9, note 11\n\nHoche, 16\n\nHomosexual, 2\n  among Greeks, 11\n  favored by bringing up of boys by men, 88\n  inclination resulting in inversion, 6\n  in men, 11\n  in women, 12\n  object selection accomplished by all men in the unconscious, 10, note 11\n\nHug-Hellmuth, Mrs. Dr. H., 37, note 2\n\nHunger and sex compared, 1\n  excitement, 16\n\nHypnosis (suggestion), 3, note 4\n  obedience in, shows nature of, to be fixation on hypnotizer, 15, note 14\n  removes inversion, 6\n\nHysteria, immense sexual desire in, 28\n  male, explained by propensity to inversion, 29\n  many cases of have syphilitic fathers, 93\n  preference for, in women determined by change of leading erogenous zone, 81\n    determined by repression of puberty, 81\n  psychoanalysis in, 26\n  of, enlightens the ego-libido, 77\n    removes symptoms of, 27\n  seduction as frequent cause of, 52\n  some cases of, conditioned by disappearance of one parent, 88\n  symptomatology of, tendency to displacement in, 46\n\nHysterical globus, 45\n  vomiting, 44; 45\n\nHysterogenous zones show same characteristics as erogenous, 46\n\n\nIdeal of sexual life, the union of all desires in one object, 61\n\nIdentification as development out of oral pregenital sexual organization, 59\n\nImmature as sexual objects, 13\n\nImpotence, 20\n\nImpulse development, 9\n  partial, 31\n    independent of each other, strive for pleasure, 58\n  sexual, 1\n    acquired, 5\n  to mastery, foreshadowed in boys' masturbation, 50\n\nIncest barriers, 84\n  object selection significant in psychosexual disturbances, 86\n  phantasies rejected, 85\n  temptations, struggle of the individual with, 85, note 9\n\nInfantile amnesia, 37\n    and infantile sexual activity, 51\n  attraction for parents, etc., repressed in puberty, 86\n  desire for parents, 87\n  factor for sexuality, 39\n  fear, 83; 84, note 7\n  fixation of libido, 86\n  in sexuality, 34\n    conserved by neurotics, 35\n  masturbation, 51\n  neglect of the, 36\n  object selection, after effects of, 86\n  onanism almost universal, 50\n  relations to parents, produces serious results to sexual life, 87\n      cause of jealousy of lover, 87\n    wet nurse, 82\n  reminiscences in neurotics, 40\n  sexual activity, 50\n    aim, 45; 46\n    excitement generously provided for, 65\n    impulse same as adult fore-pleasure, 72\n    investigation, failure of, 57\n  sexuality, 36\n    manifestations of, 42\n    determines normal, 73\n    source of, 61\n  sexual life, 53\n\nInfluences, opposite, paths of, 66\n\nInhibitions (see Shame, Loathing, Sympathy) 26, note 23\n  sexual, 40\n    develop earlier in girl, 78\n  study of, 58\n\nInnateness, 5\n\nInner organic world, one of three stimulants of sexual apparatus, 69\n\nInquisitiveness, 55\n  of children attracted to sexual problems, 56\n\nIntentions, Appearance of New, 20\n\nIntellectual work, 65\n\nIntensity of stimulus, a factor in sexual excitement, 65\n\nIntestinal catarrh in neurosis, 48\n\nInversion, amphigenous, 2\n  influence of climate and race on, 5\n  conception of, 4\n  congeniality of, 4\n  corresponds to sexual inclinations of many persons, 88\n  effect of father on, 11, note 11\n  explanation of, 6; 10, note 11\n  extreme cases of, 3\n  feelings of, in all neurotics, 29\n  frequent in ancient times, 5\n  permanent, made possible by a disappearance of one parent, 88\n  prevention of, 87\n  time of, 3\n\nInverts, behavior of, 2; 3\n  psychic manliness in, 8\n  sexual object of, 10\n  aim of, 12\n\nInvestigation, infantile sexual, 55\n  conducted alone, 58\n  is first step at independent orientation, 58\n  causes estrangement from persons, 58\n\nItching, feeling of, projected into peripheral erogenous zone, 47\n\n\nKiernan, 7\n\nKinderfehler, Die (periodical), 37, note 2\n\nKissing (see Mouth, Oral)\n  as perversion, 15\n  habitual, in former thumbsuckers, 44\n  in female inverts, 12\n\nKnowledge, desire for, cooeperates with energy of desire for looking, 56\n  not wholly sexual, 55\n  relations to sexual life of particular importance to, 56\n\nKrafft-Ebing, 1, note 1; 9, and note 11; 22; 23\n  weakness of his description of sexual process, 75\n\n\nLatency Period, Sexual in Childhood, 39; 40\n  interruptions of, 41\n\nLeading Zone in man and woman, 80\n  in female child is the clitoris, 80\n\nLibido as term for sexual feeling corresponding to hunger, 1\n  of inverts, 3\n  direction of, determined by experience in early childhood, 6\n  attachment of, to persons of same sex, 10, note 11\n  fixation of, on hypnotizer, 15, note 14\n  amount of directed to artistic aim, 21\n  aggressive factor of, in sadism, 23\n  strivings of, transformed into symptoms, 28\n  fixation of, on persons of same sex, 29\n  union of cruelty with, in neurotics and paranoiacs, 30\n  of psychoneurotics unable to obtain normal sexual gratification, 33\n  of children in corporal punishment, 55\n  tension of, dies away at orgasm, 71\n  sometimes escapes injury in castration, 75\n  Theory of, 77\n  a force of variable quantity capable of measuring sexual processes, 77\n  a concept auxiliary to chemical theory, 77\n  energy has a qualitative character, 77\n    has special chemism different from nutritional processes, 77\n  quantum psychically represented by ego-libido, 77\n  production, increase, distribution and displacement of the Ego-, explains psychosexual phenomena, 77\n  accessibility of the Ego- to psychoanalysis, 77\n  the Ego- becomes Object-Libido, 77\n  fate of the Object- is to be withdrawn from the object, 77\n    is to be preserved floating in special states of tension, 77\n    is to be finally taken back into the Ego, 77\n  The Ego- is called the narcissistic Libido, 78\n    greater significance of, in psychotic disturbances, 78\n  is regularly of a masculine character in man and woman, 79\n  the object of may be either man or woman, 79\n  of child, when ungratified is changed into fear, 84\n  suppressed, of love of child to parents, 84\n  infantile fixation of, causes sexual love for parents, 86\n  girls conceal, under affection for family, 86\n  return of, to persons preferred in infancy, 86\n  incestuous fixation of, not completely escaped, 86\n\nLindner, 42; 43\n\nLingering at intermediary relations, 15; 20\n  at preparatory act of sexual process is mechanism of many perversions, 73\n\nLip as erogenous zone, 44\n  sexual utilization of mucous membrane of, 16\n  sucking of, 42\n  zone is responsible for sexual gratification during eating, 66\n\nLoathing, feeling of, protects individual from improper sexual aims, 16; 17\n  overcoming of, at sight of excretion, produces voyeurs, 21\n  and Shame in Masochism, 23\n    in Inversions, 25\n  as psychic force inhibiting sexual life, 40\n\nLooking (see Peeping, Voyeurs)\n  as addition to normal sexual process, 14\n  Lingering at Touching and, 20\n  as a perversion, 21\n  and exhibition mania, the eye an erogenous zone in, 32\n  as component of infantile sexual life with others as object, 53\n\nLove, omnipotence of, 25\n  and hate, 30\n  temporary renouncement of, in child, 83\n  smaller amount of, than mother love to satisfy individual in later life, 83\n  non-sexual and sexual, for parents, nourished from same source, 86\n  sexual, corresponds to an infantile fixation of the Libido, 86\n  -life, peculiarities of, understood only through childhood, 87, note 11\n\nLoewenfeld, 1, note 1\n\nLydston, F., 7\n\n\nMagnan's classification, 4\n\nMan (see Bisexuality, Masculine and Feminine)\n  sexual development of, more consistent and easier to understand, 68\n  differentiation between, and woman, 78\n\nMasculine and feminine, 79\n  as activity and passivity, 79, note 4\n  biological significance of, permits clearest determination, 79 note 4\n  in sociological sense, 79, note 4\n    no pure, in either biological or sociological sense, 79, note 4\n\nMasochism, in relation between hypnotized and hypnotist, 15, note 14\n  and Sadism, 21\n  originates through transformation from Sadism, 22\n  and Sadism occupy special place among perversions, 23\n  reinforced by Sadism in exhibitionism, 30\n  source of, in painful irritation of gluteal region, 55\n  -Sadism impulse rooted in erogenous action of pain, 65\n\nMastery, impulse to, foreshadowed in boys' masturbation, 50\n  source of cruelty in children, 54\n  supplies activity, 59\n\nMasturbatic sexual manifestations, 47\n  excitation of anal zone, 49\n  irritation of anal zone, 49\n  sexual manifestations have same male character in boy and girl, 79\n\nMasturbation frequently the exclusive aim in inversion, 12\n  in small children, 36\n  thumb-sucking and, 43\n  infantile, has three phases, 50\n    return of, 51\n  in little girls concerns clitoris only, 80\n\nMechanical excitation, 62\n\nMemory traces preponderate over recent impressions in causation of neuroses, 99\n\nMoebius, 1, note 1; 4, note 6; 34\n\nMoll, 1, note 1; 32; 37, note 1\n\nMorality as a psychic dam, 41\n\nMother, fixation on, in inverts, 11, note 12\n  image helps males avert inversions, 88\n  image helps females avert inversions, 88\n\nMotion, pleasure of, sexual in nature, 64, note 22\n\nMouth (see Lip, Oral)\n  Sexual Utilization of Mucous Membrane of Lips and, 16\n  as a frequent example of transgression, 29\n  as an erogenous zone, 31\n\nMuscular activity, pleasure from, 63\n\n\nNarcissism in object selection, 10, note 11\n  as identification with mother, 12, note 12\n\nNarcissistic Libido a name for Ego-Libido, 78\n  a reservoir of energy for investment of object, 78\n  investment of ego a realized primitive state, 78\n\nNausea on railroads, 63\n\nNeurosis and perversion, 28\n  the negative of a perversion, 29; 89\n  intestinal catarrh in, 48\n  symptomatology of, traced to disturbance of sexual processes, 67\n  a factor in the causation of, is preponderance of memory traces, 99\n\nNeurotics and children compared, 38\n  infantile reminiscences in, 40\n  scatologic customs of, 49\n  diseases, disposition for, awakened by over tender parents, 83\n  have nearer ways than tenderness to transfer their disturbances to their children, 38\n  fixedness of impressions of sexual life in, 99\n\nNursing Period, Sexual Object of, 82\n\n\nObject finding, 81\n    is consummated on psychic side at anatomical puberty, 81\n    is really a re-finding (of the mother), 82\n    two paths of, shown by psychoanalysis, 82, note 5\n  selection must avoid beloved person of infancy, 84\n    first accomplished in imagination, 85\n    incestuous, significant in psychosexual disturbances, 86\n    after effects of infantile, 86\n    follows prototypes of parents, 86\n\nObsessions explained only through psychoanalysis, 26\n\nOccasional inversion, 2\n\nOedipus Complex, 85\n\nOnanism (see Masturbation)\n  mutual, not producing inversion, 6\n  infantile, almost universal, 50\n  unusual techniques in, show prohibition overcome, 50, note 15\n  infantile, disappears soon, 50\n  connected by conscience-stricken neurotics with their neurosis, 51, note 16\n  gratification in infantile masturbation, 51\n  early active, as determinant of pollution-like process, 51\n\nOpposite Influences, Paths of, 66\n\nOral (see Lip, Mouth)\n  pregenital sexual organization, 59\n\nOrganizations, Pregenital, 54; 58\n\nOrgasm, thumb-sucking leading to, 43\n\nOverestimation of the Sexual Object, 15\n\nOverwork, nervous disturbances of mental, caused by simultaneous sexual excitement, 65\n\n\nPain ranks with loathing and shame, 23\n\nPain sought by many persons, 64\n  toned down has erogenous action, 65\n  a factor in sexual excitement, 65\n\nParanoia, knowledge of sexual impulse in, gained only through psychoanalysis, 26\n  delusional fears in, based on perversions, 29, note 25\n  union of cruelty with libido in, 30\n  significance of erogenous zones in, 32\n\nParent complex, 15, note 14\n  strongest in girls, 85\n  result of boundless tenderness of parents, 83\n\nPartial desires, 29\n  impulses and erogenous zones, 31; 34; 53; 59\n    show passive form in girls, 79\n\nPassivity (see Activity)\n  sexual aim present in exhibitionism in active and passive form, 21\n  active and passive forms of Sadism-Masochism, 23\n\nPedicatio, 17\n\nPeeping (see Exhibitionism, Looking, Voyeurs)\n  as perversion, 21\n  force opposed to, is shame, 21\n  mania, partial desires as carriers of, 30\n  as strongest motive power for formation of neurotic symptoms, 54\n\nPenis, envy of in girls, 37\n  erection of, the somatic sign of sexual excitation, 69\n\nPerez, 37, note 2\n\nPerversions, as additions to normal sexual processes, 14\n  brought into relation with normal sexual life, 15\n  mouth as sexual organ in, 16\n  Sadism-Masochism the most significant of, 22\n  general statements applicable to, 24\n  exclusiveness and fixation of, 25\n  psychic participation in, 25\n  and neurosis, 28; 29\n  fetichisms as, 30\n  positive, 31\n  preponderance of sexual, in psychoneuroses, 32\n  sexual impulse of psychoneurotics possesses unusual tendency to, 33\n  relation of predisposition to, and morbid picture, 34\n  formation of, 52\n  of prostitutes, 53\n  part played in, by castration complex, 22\n  mechanism of many, represents a lingering at a preparatory act, 73\n  the neuroses the negative of the, 89\n  disposition to, universal, 89\n  as inhibitions and dissociations from normal development, 89\n  negative appearing in neurosis, 89, note 12\n  positive and negative in the same family, 94\n  resulting from the strongest of other sexual components, 94\n  of childhood as source of some virtues, 96\n\nPhantasies the only escape of the maturing youth, 85\n  of the individual in struggle with incest temptation, 85, note 9\n  of all persons contain infantile inclinations, 85\n  distinctly incestuous, rejected, 85\n\nPleasure sucking, 42; 43\n  relation of feeling of, to unpleasant tension, 70\n  relations of, the weakest spot in present day psychology, 70\n  the last, of sexual acts differs earlier pleasures, 71\n    produced through discharge, 71\n    is altogether gratification pleasure, 71\n  nature of, more deeply entered into in the study of wit, 72\n\nPollution, process similar to, in infancy, 51\n    caused by strong excitements in children, 64\n  nocturnal, due to accumulation of semen, 74\n\nPolymorphous-perverse disposition, 52\n\nPrecursory Sexual Aims, 20\n\nPredisposition, bisexual, 9\n\nPregenital organization as phase of sexual life, 54; 58\n  phase of organization of sexual life, 59\n    sadistic-anal, 59\n  organizations, assumption of, based on analysis of neuroses, 60\n\nPrematurity, spontaneous sexual, a factor influential for sexual development, 97\n  shown in breaking through, shortening or suspending of infantile latency period, 97\n  becomes cause of disturbances in provoking sexual manifestations having character of perversions, 97\n  sexual, runs parallel with intellectual prematurity, 98\n\nPrevention of inversion, 87\n\nPrimacy of the Genitals, 50; 69\n  attained at puberty, 68\n  already sketched out in infantile life, 73\n  for propagation, the last phase of sexual organization, 60\n\nPrimitive Psychic Mechanisms, 10, note 11\n\nProstitute fitted for her activity by polymorphous-perverse disposition, 53\n\nPsychic participation in perversions, 25\n  life one of three stimuli of sexual apparatus, 69\n  sign of sexual excitation a feeling of tension, 69\n  accomplishment of puberty is breaking away from parental authority, 85\n\nPsychoanalysis, cures by, 3\n  of homosexuals, 10, note 11\n  reveals psychic mechanism of genesis of inversion, 11, note 12\n\nPsychoanalysis, 26\n  shows early intimidation from normal sexual aims, 18, note 17\n  explains fetichism, 20, note 19\n  reduces bisexuality to activity and passivity, 24\n  reduces symptoms of hysteria, 27\n  unconscious phantasies revealed by, 29, note 25\n  of thumb-sucking, 43\n  of anal zone, 47\n  brings forgotten material to consciousness, 51\n  of infantile sexuality, 55, note 19\n  and inquisitiveness of children, 56\n  and pregenital organizations, 58\n  and tenderness of sexual life, 61\n  novelty of, 66\n  of transference psychoses, 77\n  gives at present definite information only about transformations of object-libido, 78\n  cannot distinguish ego-libido from other effective energies, 78\n  shows two paths of object finding, 82, note 5\n  shows individual struggle with incest temptations, 85, note 9\n  positive perversions accessible to therapy of, 90, note 12\n\nPsychoneuroses based on sexual motive powers, 26\n  associated with manifest inversions, 29, note 26\n  traces of all perversions in, 30\n  significance of erogenous zones in, 32\n  preponderance of special erogenous zones in, 34\n\nPsychoneurotics, sexual life of, explained only through psychoanalysis, 26\n  Sexual Activities of, 27\n  disease of, appears after puberty, 33\n  constitution of, tendency to inversions in, 34\n  sexuality of preserves infantile character, 39\n\nPsychosexual hermaphrodites show indifference to which sex their object belongs, 2\n  not paralleled by other psychic qualities, 8\n  phenomena explained by nature of ego-libido, 77\n  development, disturbances of, show incestuous object selection, 86\n\nPuberty not the time of the beginning of the sexual impulse, 1; 36\n  relation of, to inversion, 3\n  definite sexual behavior not determined till after, 10, note 11\n  Transformations of, 68\n  most striking process of, the growth of the genitals, 69\n\n\nRailroad activities, sexual element in, 62\n\nReaction formation, 40\n    and sublimation two diverse processes, 41\n  feelings of, 41\n  formation begins in latency period, 95\n\nReading as source of sexual excitement through fear, 64\n\nRegression appears in sex development of woman, 68\n  produced by factors injuring sexual development, 97\n\nRepression of certain powerful components, 94\n  not a suspension, 95\n  result of, an almost normal sexual life, 95\n\nRepression, inner determinations of, unknown, 96\n  effect of, cannot be made retrogressive, 98\n  a special process cutting off conscious discharge of wishes, 27\n\nRepression of heterosexual feeling in psychoneurosis, 29, note 26\n  Sadism resulting from shows masochistic tendencies, 30\n  immense amount, in inverts, 33\n  congenital roots of sexual impulse undergo insufficient, 35\n  of impressions of childhood, 38\n  sexual, greater in girl, 79\n  new wave of, distinguishes puberty of girl, 80\n  determines psychic causes of anesthesia, 81\n  of puberty determines woman's preference for neuroses, 81\n  a new, required, abolishing a piece of infantile masculinity, 92\n\nResistances, shame, loathing, fear and pain as, 25\n\nRhythm in sucking analogous to tickling, 45\n  of mechanical shaking of the body produces sexual excitation, 62\n\nRiddle of the Sphinx, 56\n\nRieger, C., 75\n\nRohleder, 47, note 13\n\nRousseau, J.J., 55\n\n\nSadger, J., 1\n\nSadism (see Masochism)\n  and Masochism, 21\n    occupy special place among perversions, 23\n  conception of, fluctuates, 22\n  attributable to bisexuality, 24\n  resulting from repression paralleled by Masochism, 30\n  attributed by children to sexual act, 57\n  prevalence of, 60\n  -Masochism impulse, rooted in erogenous action of pain, 65\n\nSadistic-anal pregenital sexual organization, 59\n\nSadistic impulse from muscular activity, 64\n\nScatologic customs of neurotics, 49\n\nSchrenk-Notzing, 1, note 1\n\nScott, 23\n\nSecondary sex characteristics, 8\n\nSeduction does not necessarily produce inverts, 6\n  treating child as a sexual object, 51\n  as outer cause of return of sexual activity in childhood, 51\n  not necessary to awaken sexual life of child, 52\n  does not explain original relations of sexual impulse, 53\n\nSemen, role of, unknown to children, 58\n\nSex characteristics, Secondary and Tertiary, 8\n  culture and, 41\n\nSexual Aberrations, 1\n    a transition of variations of sexual impulse to the pathological, 19\n  act, theories of children as to, 57\n  activities, of psychoneurotics, 27\n    premature, of children, impair educability, 91\n  activities, infantile leave profoundest impressions, 50\n  aim abandoned in childhood, 40\n    at puberty different in the two sexes, 68\n    Deviation in Reference to, 14\n    distinction between, and sexual object, 1\n    Fixation of Precursory, 20\n    in man the discharge of the sexual products, 68\n    of infantile impulse, 46\n    of infantile sexuality, 45\n    of Inverts, 12\n    perversion may be substituted for, by normal person, 24\n    should be restricted to union of genitals, 16\n  apparatus, weakness of, 18\n  constitutions, diverse, 66\n    variation of, 93\n  contrary, 2\n  development of man easier to understand, than woman's, 68\n  disturbances, paths of, a means of sublimation, 67\n    serviceable in health, 67\n  excitation of nursing period, 51\n    is one result of three ways of stimulation of the sexual apparatus, 69\n  excitement originates\n    (_a_) as imitation of a previous gratification, 61\n    (_b_) as a stimulation of erogenous zones, 61\n    (_c_) as the expression of some impulse, 61\n    sources of, tested by quality of stimulus, 65\n    inner sources of, 65\n    nature of, unfamiliar to us, 66\n    indirect source of, not equally strong in all persons, 66\n    influences availability of voluntary attention, 67\n    problem of, 73\n    normally ended only by discharge of semen, 74\n    independent of an accumulation of sexual substance, 75\n    furnished not only from so-called sexual parts, 77\n    intercourse between parents and child an inexhaustible source of, 82\n  gratification found by inverts in object of same sex, 3\n  impression, 5\n  Impulse, 1\n    acquired, 5\n    too close connection of, with object assumed, 12\n    entirely independent of its object, 13\n    most poorly controlled of all by higher psychic activities, 14\n    alone was extolled by the ancients, 14, note 13\n    Masochism in, causes unconscious fixation of libido on the hypnotist, 15, note 14\n    closely connected with cruelty, 23\n    the source of symptoms of neuroses, 27\n    perverse, converted expression of, 29\n    in psychoneuroses, 33\n    ignorance of essential features of, 36\n    becomes altruistic, 68\n    regularly becomes autoerotic, 81\n    not awakened, 82\n    of genitals reawakens, 50\n    primitive formation of, 42\n  inhibition, 40\n  inversion, 2\n    presupposes that sexual object is reverse of normal, 10\n  inverts, 1, note 1\n  investigation, infantile, 55\n  latency period, in childhood, 39\n  life of children, 40\n    shows components regarding others as sexual objects, 53\n    tender streams of, 61\n    normality of guaranteed by concurrence of two streams, 68\n    all disturbances of, as inhibitions of development, 69\n    development of, of children unimportant in lower stages of culture and important in higher, 99\n  love shown by children towards parents at an early date, 83\n  manifestations in childhood, exceptional, 39\n    the masturbatic, 47\n  object is the person from whom the sexual attraction emanates, 1\n    Deviation in Reference to the, 2\n    inaccessibility of, leads to occasional inversion, 3\n    of inverts, 10\n    male inverts look for real feminine psychic features in, 11\n    female active inverts look for femininity in, 12\n    the sexually immature and animals as, 13\n    emphasis placed by moderns on the, 14, note 13\n    lingering at intermediary relations to, one of the perversions, 15\n  object, overestimation of the, 15\n    unfit substitutes for, 18\n    selection in very young children, 55, note 19\n    found at puberty, 68\n    and aim concurrent in normal sexual life, 68\n    in mother's breast, 81\n    lost when infant forms general picture of person, 81\n    of nursing period, 82\n  organization, pregenital oral, 59\n  overestimation of, rises only when woman refuses, 80\n  process, motive power for, escapes in fore-pleasure, 72\n  rejection leaves in unconscious of neurotic the psychosexual activity for object finding, 86\n  satisfaction from muscular activity, 63\n  substance, role of, 74\n  symbolism of forms of motion, 63\n  tension loosened by copulation, 14\n    implies feeling of displeasure, 70\n    carries impulse to alter psychic situation, 70\n    appears even in infancy, 73\n    does not originate in pleasure, 74\n    and pleasure only indirectly connected, 74\n    a certain amount of, necessary for the excitability of the erogenous zones, 74\n  theories, infantile, are reproductions of child's sexual constitution, 57\n\nSexuality as the weak point of the otherwise normal, 14\n  infantilism of, 34\n  infantile factor in, 39\n  infantile, manifestations of, 42\n  sexual aim of infantile, 45\n  germinating, affecting children's behavior in school, 64\n  encroached upon by all intensive affective processes, 64\n  partial impulses of, 65\n  of eating, 66\n  ways between, and other functions traversible in both directions, 66\n  does not consist entirely in male germ glands, 75\n  of clitoris repressed in girl at puberty, 80\n\nSexuals, Contrary, 2\n\nShame is a force opposed to the peeping mania, 21\n  as a resistance opposed to the libido, 23, 25\n  as force acting as an inhibition on sexual life, 40\n\nShoe as a symbol of female genital, 19, note 18\n\nSkin as erogenous zone, 32\n  as factor of sexual excitement, 65\n\nSleep caused by pleasure-sucking, 43\n\nSmell desire, coprophilic, 20, note 19\n\nSmoking, desire for in former thumb-suckers, 44\n\nSphinx, Riddle of, 56\n\nSports turn youth away from sexual activity, 64\n\nStimulus produced by isolated excitements coming from without, 31\n  outer, removing sensitiveness with gratification, 47\n  quality of, as criterion of sources of sexual excitement, 65\n  can set in motion complicated sexual apparatus, 69\n  affects the sexual apparatus in three ways, 69\n\nSublimation, artistic, 21\n  Reaction Formation and, 40\n  a deviation of sexual motive powers from sexual aims, 41\n  and reaction formation two diverse processes, 41, note 8\n  desire for knowledge corresponds to, 55\n  effected on paths by which sexual disturbances encroach upon other functions of the body, 67\n  makes possible a third issue in abnormal constitutional dispositions, 95\n  inner processes of, totally unknown, 96\n\nSucking, see Thumb-sucking,--\n\nSymbolism of fetichism, 19, 20\n  sexual, of early childhood, 55, note 19\n\nSymptomatology of neurotic determined by infantile sexual activity, 50\n  of pollution-like process, 51\n  of neuroses traced to disturbance of the sexual processes, 67\n    manifested in disturbances of other non-sexual bodily functions, 67\n\nSymptoms, creators of, are unconscious forces, 89\n  of psychoneuroses are the sexual activities of the patient, 27\n\nSyphilis in fathers of more than half the cases of hysteria, compulsion-neurosis, etc., treated by Freud, 93\n\n\nTemperature sensitiveness, as result of distinct erogenous action, 62\n\nTemporal Factors, 98\n\nTension, sexual, loosened by copulation, 14, 70\n    feeling of, 46\n      the psychic sign of sexual excitation, 69\n  unpleasant, relation of, to feeling of pleasure, 70\n  increase in changing to displeasure, 71\n  increased by functions of erogenous zones, 71\n  of libido dies away at orgasm, 71\n  too little, endangers attainment of sexual aim, 72\n\nTertiary sex characteristics, 8\n\nTheatre as source of sexual excitement through fear, 64\n\nThumb-sucking as model of infantile sexual manifestations, 42\n  a sexual activity, 43\n  as remnant of oral phase of pregenital sexual organization, 59\n\nThyroid gland, role of, in sexuality, 76\n\nTickling analogous to rhythmic sucking, 45\n  demanding onanistic gratification, 51\n\nToe, sucking of, 42\n\nTongue, sucking of, 42\n\nTouching as preliminary to sexual aim, 14\n  and looking, 20\n  hand as addition to attraction of sexual object, 70\n\nTransference neuroses, 77\n  of erogenous excitability from clitoris to vagina, 81\n\nTransformation of puberty, 68\n  success of, dependent on adjustment to dispositions and impulses, 68\n\nTransgressions, anatomical, 15\n  especially frequent, are those to mouth and anus, 29\n\n\nUlrich, 9\n\nUnconscious, all neurotics have feelings of inversion in, 29\n  nothing in, corresponds to fetichism, 30\n  psychic material is the source of compulsions, 51\n  forces revealing themselves as symptom creators, 89\n\nUranism, 5, note 7\n\nUrinary apparatus, the guardian of the genital, 51\n\n\nVagina, glandular activity of, the somatic sign of sexual excitation, 69\n\nVomiting, hysterical, evinced after repression of thumb-sucking, 44\n\nVoyeurs (see Looking, Peeping, Exhibitionism)\n  as examples of overcoming of loathing, 21\n  exhibitionists are at the same time, 30\n  children become, 54\n\n\nWishes, symptoms of hysteria are substitutes for, 27\n\nWit as source of greater knowledge of pleasure, 72\n\nWoman (see Masculine and feminine)\n  regression in sex development of, 68\n  differentiation between man and, 78\n\nWork, intellectual, as sexual excitement, 65\n\n\nZola, 96\n\nZone, chief erogenous, in female child is the clitoris, 80\n\nZones, erogenous, 31\n    characters of, 45\n    predestined, 46\n  lips as erogenous, 44\n  all parts of body may become erogenous, 46\n  genital, gratification of, taught by seduction, 52\n  erogenous, premature activity of, indicated by cruelty, 54\n    parts of skin called, 65\n  lip, responsible for sexual gratification during eating, 66\n  primacy of genital, 69\n  erogenous, prepare sexual excitement, 70\n  leading, in man and woman, 80\n\n\n\n\nVolume VII                  July, 1920                  Number 3\n\nThe Psychoanalytic Review\n\nA Journal Devoted to an Understanding of Human Conduct\n\nEDITED AND PUBLISHED BY\n\nWILLIAM A. WHITE, M.D., and SMITH ELY JELLIFFE, M.D.\n\n       *       *       *       *       *\n\nCONTENTS\n\nORIGINAL ARTICLES\n     *Freud's Concept of the \"Censorship\".* W.H.R. RIVERS.\n     *Psychology of War and Schizophrenia.* E.W. LAZELL.\n     *The Paraphrenic's Inaccessibility.* M.K. ISHAM.\nTRANSLATION\n     *Psychological Psychiatry.* H.F. DELGADO.\nABSTRACTS. *Book Reviews*\n\n       *       *       *       *       *\n\nIssued Quarterly: $6.00 per Volume,\nSingle Numbers, $1.75\nForeign, $6.60\n\n       *       *       *       *       *\n\nNERVOUS AND MENTAL DISEASE PUBLISHING COMPANY\n\n41 NORTH QUEEN STREET, LANCASTER, PA.,\nand\n3617 10th ST., N.W., WASHINGTON, D. C.\n\nSerial No. 27\n\n       *       *       *       *       *\n\nEntered as Second-Class Matter October 25, 1913, at the Post Office at\nLancaster, Pennsylvania under the Act of March 3, 1879.\n\n\n\n\nPublishers of\n\nThe Psychoanalytic Review\n\nA Journal Devoted to the Understanding of Human Conduct\n\nEdited by WILLIAM A. WHITE, M.D., and SMITH ELY JELLIFFE, M.D. Leading\nArticles Which Have Appeared in Previous Volumes\n\nVOL. I. (Beginning November, 1913.)\n\nThe Theory of Psychoanalysis. C.G. Jung.\nPsychoanalysis of Self-Mutilation. L.E. Emerson.\nBlindness as a Wish. T.H. Ames.\nThe Technique of Psychoanalysis. S.E. Jelliffe.\nWishfulfillment and Symbolism in Fairy Tales. Riklin.\nCharacter and the Neuroses. Trigant Burrow.\nThe Wildisbush Crucified Saint. Theodore Schroeder.\nThe Pragmatic Advantage of Freudo-Analysis. Knight Dunlap.\nMoon Myth in Medicine. William A. White.\nThe Sadism of Oscar Wilde's \"Salome.\" Isador H. Coriat.\nPsychoanalysis and Hospitals. L.E. Emerson.\nThe Dream as a Simple Wishfulfillment in the Negro. John E. Lind.\n\nVOL. II. (Beginning January, 1915.)\n\nThe Principles of Pain-Pleasure and Reality. Paul Federn.\nThe Unconscious. William A. White.\nA Plea for a Broader Standpoint in Psychoanalysis. Meyer Solomon.\nContributions to the Pathology of Everyday Life; Their Relation to\n     Abnormal Mental Phenomena. Robert Stewart Miller.\nThe Integrative Functions of the Nervous System Applied to Some\n     Reactions in Human Behavior and their Attending Psychic Functions.\n     Edward J. Kempf.\nA Manic-Depressive Upset Presenting Frank Wish-Realization Construction.\n     Ralph Reed.\nPsychoanalytic Parallels. William A. White.\nRole of Sexual Complex in Dementia Praecox. James C. Hassall.\nPsycho-Genetics of Androcratic Evolution. Theodore Schroeder.\nSignificance of Psychoanalysis for the Mental Sciences. Otto Rank and\n     Hans Sachs.\nSome Studies in the Psychopathology of Acute Dissociation of the\n     Personality. Edward J. Kempf.\nPsychoanalysis. Arthur H. Ring.\nA Philosophy for Psychoanalysis. L.E. Emerson.\n\nVOL. III. (Beginning January, 1916.)\n\nSymbolism. William A. White.\nThe Work of Alfred Adler, Considered with Especial Reference to that of\n     Freud. James J. Putnam.\nArt in the Insane. L. Grimberg.\nRetaliation Dreams. Hansell Crenshaw.\nHistory of the Psychoanalytic Movement. Sigmund Freud.\nClinical Cases Exhibiting Unconscious Defence Reactions. Francis H.\n     Shockley.\nProcesses of Recovery in Schizophrenics. H. Bertschinger.\nFreud and Sociology. Ernest R. Groves.\nThe Ontogenetic Against the Phylogenetic Elements in the Psychoses of\n     the Colored Race. Arrah B. Evarts.\nDiscomfiture and Evil Spirits. Elsie Clews Parsons.\nTwo Very Definite Wish-Fulfillment Dreams. C.B. Burr.\n\nVOL. IV. (Beginning January, 1917.)\n\nIndividuality and Introversion. William A. White.\nA Study of a Severe Case of Compulsion Neurosis. H.W. Frink.\nA Summary of Material on the Topical Community of Primitive and\n     Pathological Symbols (\"Archeopathic\" Symbols), F.L. Wells.\nA Literary Forerunner of Freud. Helen Williston Brown.\nThe Technique of Dream Interpretation. Wilhelm Steckel.\nThe Social and Sexual Behavior of Infrahuman Primates with some\n     Comparable Facts in Human Behavior. Edw. J. Kempf.\nPain as a Reaction of Defence. H.B. Moyle.\nSome Statistical Results of the Psychoanalytic Treatment of\n     Psychoneuroses. Isador H. Coriat. The Role of Animals in the\n     Unconscious. S.E. Jelliffe and L. Brink.\nThe Genesis and Meaning of Homosexuality. Trigant Burrow.\nPhylogenetic Elements in the Psychoses of the Negro. John E. Lind.\nFreudian Elements in the Animism of the Niger Delta. E.R. Groves.\nThe Mechanism of Transference. William A. White.\nThe Future of Psychoanalysis. Isador H. Coriat.\nHermaphroditic Dreams. Isador H. Coriat.\nThe Psychology of \"The Yellow Jacket.\" E.J. Kempf.\nHeredity and Self-Conceit. Mabel Stevens.\nThe Long Handicap. Helen R. Hull.\n\nVOL. V. (Beginning January, 1918.)\n\nAnalysis of a Case of Manic-Depressive Psychosis Showing well-marked\n     Regressive Stages. Lucile Dooley.\nReactions to Personal Names. C.P. Oberndorf.\nA Study of the Mental Life of the Child. H. von Hug-Hellmuth.\nAn Interpretation of Certain Symbolisms. J.J. Putnam.\nCharles Darwin--The Affective Source of His Inspiration and Anxiety\n     Neurosis. Edw. J. Kempf.\nThe Origin of the Incest-Awe. Trigant Burrow.\nCompulsion and Freedom: The Fantasy of the Willow Tree. S.E. Jelliffe\n     and L. Brink.\nA Case of Childhood Conflicts with Prominent Reference to the Urinary\n     System: with some General Considerations on Urinary Symptoms in the\n     Psychoneuroses and Psychoses. C. Macfie Campbell.\nThe Hound of Heaven. Thomas Vernon Moore.\nA Lace Creation Revealing an Incest Fantasy. Arrah B. Evarts.\nNephew and Maternal Uncle: A Motive of Early Literature in the Light of\n     Freudian Psychology. Albert K. Weinberg.\n\nAll the leading foreign psychoanalytic journals are regularly\nabstracted, and all books dealing with psychoanalysis are reviewed.\n\nIssued Quarterly: $5.00 per Volume.\n\nSingle Copies: $1.50                                   Foreign, $5.60.\n\nNervous and Mental Disease Publishing Company\n\n3617 Tenth Street, N.W.                               WASHINGTON, D.C.", "title": "Three Contributions to the Theory of Sex"}