{"summary": "\nIshmael explains his need to go to sea and travels from Manhattan Island to New Bedford. The inn is crowded and he must share a bed with the tattooed Polynesian Queequeg, a harpooneer whose father was king of the (fictional) island of Rokovoko. The next morning Ishmael and Queequeg attend Father Mapple's sermon on Jonah, then head for Nantucket. Ishmael signs up with the Quaker ship-owners Bildad and Peleg for a voyage on their whaler Pequod. Peleg describes Captain Ahab: \"He's a grand, ungodly, god-like man\" who nevertheless \"has his humanities\" (Ch. 16, \"The Ship\"). They hire Queequeg the following morning. A man named Elijah prophesies a dire fate should Ishmael and Queequeg join Ahab. While provisions are loaded, shadowy figures board the ship. On a cold Christmas Day, the Pequod leaves the harbor.\nChapters discourse on cetology (the zoological classification and natural history of the whale), and describe the crew-members. The chief mate is 30-year-old Starbuck, a Nantucket Quaker with a realist mentality, whose harpooneer is Queequeg; second mate is Stubb, from Cape Cod, happy-go-lucky and cheerful, whose harpooneer is Tashtego, a proud, pure-blooded Indian from Gay Head, the third mate is Flask, from Martha's Vineyard, short, stout, whose harpooneer is Daggoo, a tall African, now a resident of Nantucket.\nWhen Ahab finally appears on the quarterdeck, he announces he is out for revenge on the white whale which took one leg from the knee down and left him with a prosthesis fashioned from a whale's jawbone. Ahab will give the first man to sight Moby Dick a doubloon, a gold coin, which he nails to the mast. Starbuck objects that he has not come for vengeance but for profit. Ahab's purpose exercises a mysterious spell on Ishmael: \"Ahab's quenchless feud seemed mine\" (Ch. 41, \"Moby Dick\"). Instead of rounding Cape Horn, Ahab heads for the equatorial Pacific Ocean via southern Africa. One afternoon, as Ishmael and Queequeg are weaving a mat — \"its warp seemed necessity, his hand free will, and Queequeg's sword chance\" (Ch. 47, \"The Mat-Maker\") —, Tashtego sights a sperm whale. Immediately five hidden figures appear who Ahab has brought as his own boat crew. Their leader, Fedallah, a Parsee, is Ahab's harpooneer. The pursuit is unsuccessful.\n\nSoutheast of the Cape of Good Hope, the Pequod makes the first of nine sea-encounters, or \"gams\", with other ships: Ahab hails the Goney (Albatross) to ask whether they have seen the White Whale but the trumpet through which her captain tries to speak falls into the sea before he can answer. Ishmael explains that because of Ahab's absorption with Moby Dick, he sails on without the customary \"gam\", which defines as a \"social meeting of two (or more) Whale-ships\", in which the two captains remain on one ship and the chief mates on the other (Ch. 53, \"The Gam\"). In the second gam off the Cape of Good Hope, with the Town-Ho, a Nantucket whaler, the concealed story of a \"judgment of God\" (Ch. 54, \"The Town-Ho's Story\") is revealed, but only to the crew: a defiant sailor who struck an oppressive officer is flogged, and when that officer led the chase for Moby Dick he fell from the boat and was killed by the whale.\nChapters 55-60 discuss pictures of whales, brit (microscopic sea creatures on which whales feed), squid and — after four boats lowered in vain because Daggoo mistook a squid for the white whale — whale-lines. The next day, in the Indian Ocean, Stubb kills a sperm whale, and that night Fleece, the Pequod‍ '​s black cook, prepares him a rare whale steak. Fleece delivers a sermon to the sharks who fight each other to feast on the whale's carcass, tied to the ship, saying that their nature is to be voracious but they must overcome it (Ch. 64, \"Stubb's Supper\"). The whale is prepared, beheaded, and barrels of oil are tried out. Standing at the head of the whale, Ahab begs it to speak of the depths of the sea. The Pequod next encounters the Jeroboam, which not only lost its chief mate to Moby Dick, but is now plagued by an epidemic.\nThe whale carcass still lies in the water. Queequeg mounts it, tied to Ishmael's belt by a monkey-rope as if they were Siamese twins. Stubb and Flask kill a right whale whose head is fastened to a yardarm opposite the sperm whale's head. Ishmael compares the two heads in a philosophical way: the right whale is Lockean, stoic, and the sperm whale as Kantean, platonic. Tashtego cuts into the head of the sperm-whale and retrieves buckets of oil. He falls into the head, and the head falls off the yardarm into the sea. Queequeg dives after him and frees his mate with his sword.\nThe Pequod next gams with the Jungfrau from Bremen. Both ships sight whales simultaneously, with the Pequod winning the contest. The three harpooneers dart their harpoons, and Flask delivers the mortal strike with a lance. The carcass sinks, and Queequeg barely manages to escape. The Pequod‍ '​s next gam is with the French whaler Bouton de Rose, whose crew is ignorant of the ambergris in the head of the diseased whale in their possession. Stubb talks them out of it, but Ahab orders him away. Days later an encounter with a harpooned whale prompts Pip, a little Negro cabin-boy from Alabama, to jump out of his whale-boat. The whale must be cut loose, because the line has Pip so entangled in it. Furious, Stubb orders Pip to stay in the whaleboat, but Pip later jumps again, and is left alone in the immense sea and has gone insane by the time he is picked up.\nCooled sperm oil congeals and must be squeezed back into liquid state; blubber is boiled in the try-pots on deck; the warm oil is decanted into casks, and then stowed in the ship. After the operation, the decks are scrubbed. The coin hammered to the main-mast shows three Andes summits, one with a flame, one with a tower, and one a crowing cock. Ahab stops to look at the doubloon and interprets the coin as signs of his firmness, volcanic energy, and victory; Starbuck takes the high peaks as evidence of the Trinity; Stubb focuses on the zodiacal arch over the mountains; and Flask sees nothing of any symbolic value at all. The Manxman mutters in front of the mast, and Pip declines the verb \"look\".\n\nThe Pequod next gams with the Samuel Enderby of London, captained by Boomer, a down-to-earth fellow who lost his right arm to Moby Dick. Nevertheless, he carries no ill will toward the whale, which he regards not as malicious but as awkward. Ahab puts an end to the gam by rushing back to his ship. The narrator now discusses the subjects of 1) whalers supply; 2) a glen in Tranque in the Arsacides islands full of carved whale bones, fossil whales, whale skeleton measurements; 3) the chance that the magnitude of the whale will diminish and that the leviathan might perish.\nLeaving the Samuel Enderby, Ahab wrenches his ivory leg and orders the carpenter to fashion him another. Starbuck informs Ahab of oil leakage in the hold. Reluctantly, Ahab orders the harpooneers to inspect the casks. Queequeg, sweating all day below decks, develops a chill and soon is almost mortally feverish. The carpenter makes a coffin for Queequeg, who fears an ordinary burial at sea. Queequeg tries it for size, with Pip sobbing and beating his tambourine, standing by and calling himself a coward while he praises Queequeg for his gameness. Yet Queequeg suddenly rallies, briefly convalesces, and leaps up, back in good health. Henceforth he uses his coffin for a spare sea-chest, which is later caulked and pitched to replace the Pequod‍ '​s life-buoy.\nThe Pequod sails northeast toward Formosa and into the Pacific Ocean. Ahab with one nostril smells the musk from the Bashee isles and with the other the salt of the waters where Moby Dick swims. Ahab goes to Perth, the blacksmith, with bag of race-horse shoe-nail stubs to be forged into the shank of a special harpoon, and with his razors for Perth to melt and fashion into a harpoon barb. Ahab tempers the barb in blood from Queequeg, Tashtego and Daggoo.\nThe Pequod gams next with the Bachelor, a Nantucket ship heading home full of sperm oil. Every now and then the Pequod lowers for whales with success. On one of those nights in the whaleboat, Fedallah prophesies that neither hearse nor coffin can be Ahab's, that before he dies Ahab must see two hearses — one not made by mortal hands and the other made of American wood — that Fedallah will precede his captain in death, and finally that only hemp can kill Ahab.\nAs the Pequod approaches the Equator, Ahab scolds his quadrant for telling him only where he is and not where he will be. He dashes it to the deck. That evening an impressive typhoon attacks the ship. Lightning strikes the mast, setting the doubloon and Ahab's harpoon aglow. Ahab delivers a speech on the spirit of fire, seeing the lightning as a portent of Moby Dick. Starbuck sees the lightning as a warning, and feels tempted to shoot the sleeping Ahab with a musket. Next morning when he finds that the lightning disoriented the compass, Ahab makes a new one out of a lance, a maul, and a sailmaker's needle. He orders the log be heaved, but the weathered line snaps, leaving the ship with no way to fix its location.\nThe Pequod is now heading southeast toward Moby Dick. A man falls overboard from the mast. The life-buoy is thrown, but both sink. Now Queequeg proposes that his superfluous coffin be used as a new life-buoy. Starbuck orders the carpenter take care it is lidded and caulked. Next morning the ship meets in another truncated gam with the Rachel, commanded by Captain Gardener from Nantucket. The Rachel is seeking survivors from one of her whaleboats which had gone after Moby Dick. Among the missing is Gardiner's young son. Ahab refuses to join the search. Twenty four hours a day Ahab now stands and walks the deck, while Fedallah shadows him. Suddenly a sea hawk grabs Ahab's slouched hat and flies off with it. Next the Pequod, in a ninth and final gam, meets the Delight, badly damaged and with five of her crew left dead by Moby Dick. Her captain shouts that the harpoon which can kill the white whale has yet to be forged, but Ahab flourishes his special lance and once more orders the ship forward. Ahab shares a moment of contemplation with Starbuck. Ahab speaks about his wife and child, calls himself a fool for spending forty years on whaling, and claims he can see his own child in Starbuck's eye. Starbuck tries to persuade Ahab to return to Nantucket to meet both their families, but Ahab simply crosses the deck and stands near Fedallah.\nOn the first day of the chase, Ahab smells the whale, climbs the mast, and sights Moby Dick. He claims the doubloon for himself, and orders all boats to lower except for Starbuck's. The whale bites Ahab's boat in two, tosses the captain out of it, and scatters the crew. On the second day of the chase, Ahab leaves Starbuck in charge of the Pequod. Moby Dick smashes the three boats that seek him into splinters and tangles their lines. Ahab is rescued, but his ivory leg and Fedallah are lost. Starbuck begs Ahab to desist, but Ahab vows to slay the white whale, even if he would have to dive through the globe itself in order to get his revenge.\n\nOn the third day of the chase, Ahab sights Moby Dick at noon, and sharks appear as well. Ahab lowers his boat for a final time, leaving Starbuck again on board. Moby Dick breaches and destroys two boats. Fedallah's corpse, still entangled in the fouled lines, is lashed to the whale's back, and so Moby Dick turns out to be the hearse Fedallah prophesied. \"Possessed by all the fallen angels\" (Ch. 135), Ahab plants his harpoon in the whale's flank. Moby Dick smites the whaleboat, tossing its men into the sea. Only Ishmael survives. The whale now fatally attacks the Pequod. Ahab then realizes that the destroyed ship is the hearse made of American wood in Fedallah's prophesy. The whale returns to Ahab, who stabs at him again. The line loops around Ahab's neck, and as the stricken whale swims away, the captain is drawn with him out of sight. Queequeg's coffin comes to the surface, the only thing to escape the vortex when Pequod sank. For an entire day Ishmael floats on it, and then the Rachel, still looking for its lost seamen, rescues him.\n\n", "full_text": "[Note: This is one of Project Gutenberg's early files dated 1991\nand the 15th file in the PG Collection. It appears to be a reference\nfile only and simply contains a list of chapter headings.\n\nThe reader will find a complete text and html file of a later date\nnumbered PG 2701:  http://www.gutenberg.org/ebooks/2701 ]\n\n\n\nMoby Dick\n\nby Herman Melville (1819-1891)\n\n\nBorn in New York City, the son of New England merchant.\nHe worked at odd jobs (clerk, garmhand, teacher)\nbefore sailing to the South Seas on the whaler _Acushnet_.\nHe deserted his ship, lived among cannibals, mutinied on\nan Australian boat, then spent two years on an American\nboat returning to the U.S.  He successfully romanticized\nthese adventures, publishing seven novels in six years,\nincluding _Moby Dick_ (1851), one of the masterworks of\nAmerican fiction.  His popularity waned, and by the time\nhe died he was virtually forgotten.  _Billy Budd_ was\nhis last great novel.  As his writing declined, Melville\nsailed again, around Cape Horn to San Francisco on a clipper\nship commanded by his brother.\n\n\n  File:         Contents:\n\n  moby-001.txt  Preliminary Matter.     This text of Melville's   moby-Dick is based on\n  moby-002.txt  LOOMINGS                Call me Ishmael.  Some years ago--never mind how\n  moby-003.txt  THE CARPET-BAG          I stuffed a shirt or two into my old\n  moby-004.txt  THE SPOUTER-INN         Entering that gable-ended Spouter-Inn,\n  moby-005.txt  THE COUNTERPANE         Upon waking next morning about daylight,\n  moby-006.txt  BREAKFAST               I quickly followed suit, and descending into\n  moby-007.txt  THE STREET              If I had been astonished at first catching a\n  moby-008.txt  THE CHAPEL              In this same New Bedford there stands a\n  moby-009.txt  THE PULPIT              I had not been seated very long ere a man\n  moby-010.txt  THE SERMON              Father Mapple rose, and in a mild voice of\n  moby-010.txt  A BOSOM FRIEND          Returning to the Spouter-Inn from the\n  moby-011.txt  NIGHTGOWN               We had lain thus in bed, chatting and\n  moby-012.txt  BIOGRAPHICAL            Queequeg was a native of Kokovoko, an\n  moby-013.txt  WHEELBARROW             wheelbarrow next morning, Monday, after disposing of\n  moby-014.txt  NANTUCKET               Nothing more happened on the passage worthy\n  moby-015.txt  CHOWDER                 It was quite late in the evening when the\n  moby-016.txt  THE SHIP                In bed we concocted our plans for the morrow.\n  moby-017.txt  THE RAMADAN             As Queequeg's Ramadan, or Fasting and\n  moby-018.txt  HIS MARK                As we were walking down the end of the wharf\n  moby-019.txt  THE PROPHET             Shipmates, have ye shipped in that ship?\n  moby-020.txt  ALL ASTIR               A day or two passed, and there was great\n  moby-021.txt  GOING ABOARD            It was nearly six o'clock, but only grey\n  moby-022.txt  MERRY CHRISTMAS         At length, towards noon, upon the\n  moby-023.txt  THE LEE SHORE           Some chapters back, one Bulkington was\n  moby-024.txt  THE ADVOCATE            As Queequeg and I are now fairly embarked\n  moby-025.txt  POSTSCRIPT              In behalf of the dignity of whaling, I\n  moby-026.txt  KNIGHTS AND SQUIRES     The chief mate of the Pequod was\n  moby-027.txt  KNIGHTS AND SQUIRES     Stubb was the second mate.  He\n  moby-028.txt  AHAB                    For several days after leaving Nantucket,\n  moby-029.txt  ENTER AHAB; TO HIM, STUBB       Some days elapsed, and ice\n  moby-030.txt  THE PIPE                When Stubb had departed, Ahab stood for a\n  moby-031.txt  QUEEN MAB               Next morning Stubb accosted Flask.  Such a\n  moby-032.txt  CETOLOGY                Already we are boldly launched upon the\n  moby-033.txt  THE SPECKSYNDER         Concerning the officers of the\n  moby-034.txt  THE CABIN-TABLE         It is noon; and Dough-Boy, the\n  moby-035.txt  THE MAST-HEAD           It was during the more pleasant weather,\n  moby-036.txt  THE QUARTER-DECK        (enter Ahab: Then, all.) It\n  moby-037.txt  SUNSET                  The cabin; by the stern windows;\n  moby-038.txt  DUSK                    By the Mainmast; Starbuck leaning\n  moby-039.txt  FIRST NIGHT-WATCH FORE-TOP     ( Stubb solus, and\n  moby-040.txt  MIDNIGHT, FORECASTLE HARPOONERS AND SAILORS          ( Foresail\n  moby-041.txt  MOBY DICK               I, Ishmael, was one of that crew; my shouts\n  moby-042.txt  THE WHITENESS OF THE WHALE     What the white whale was to\n  moby-043.txt  HARK                    Hist!  Did you hear that noise, Cabaco?\n  moby-044.txt  THE CHART               Had you followed Captain Ahab down into his\n  moby-045.txt  THE AFFIDAVIT           So far as what there may be of a\n  moby-046.txt  SURMISES                Though, consumed with the hot fire of his\n  moby-047.txt  THE MAT-MAKER           It was a cloudy, sultry afternoon;\n  moby-048.txt  THE FIRST LOWERING      The phantoms, for so they then\n  moby-049.txt  THE HYENA               There are certain queer times and occasions\n  moby-050.txt  AHAB'S BOAT AND CREW. FEDALLAH     Who would have thought\n  moby-051.txt  THE SPIRIT-SPOUT        Days, weeks passed, and under easy\n  moby-052.txt  THE ALBATROSS           South-eastward from the Cape, off the\n  moby-053.txt  THE GAM                 The ostensible reason why Ahab did not go on\n  moby-054.txt  THE TOWN-HO'S STORY     (As told at the Golden Inn.)\n  moby-055.txt  OF THE MONSTROUS PICTURES OF WHALES       I shall ere long\n  moby-056.txt  OF THE LESS ERRONEOUS PICTURES OF WHALES, AND THE TRUE\n  moby-057.txt  OF WHALES IN PAINT; IN TEETH; IN WOOD; IN\n  moby-058.txt  BRIT                    Steering north-eastward from the Crozetts, we\n  moby-059.txt  SQUID                   Slowly wading through the meadows of brit, the\n  moby-060.txt  THE LINE                With reference to the whaling scene shortly to\n  moby-061.txt  STUBB KILLS A WHALE     If to Starbuck the apparition of\n  moby-062.txt  THE DART                A word concerning an incident in the last\n  moby-063.txt  THE CROTCH              Out of the trunk, the branches grow; out\n  moby-064.txt  STUBB'S SUPPER          Stubb's whale had been killed some\n  moby-065.txt  THE WHALE AS A DISH     That mortal man should feed upon\n  moby-066.txt  THE SHARK MASSACRE      When in the Southern Fishery, a\n  moby-067.txt  CUTTING IN              It was a Saturday night, and such a\n  moby-068.txt  THE BLANKET             I have given no small attention to that\n  moby-069.txt  THE FUNERAL             Haul in the chains!  Let the carcase go\n  moby-070.txt  THE SPHYNX              It should not have been omitted that\n  moby-071.txt  THE JEROBOAM'S STORY    Hand in hand, ship and breeze\n  moby-072.txt  THE MONKEY ROPE         In the tumultuous business of cutting-in\n  moby-073.txt  STUBB AND FLASK KILL A RIGHT WHALE; AND THEN HAVE\n  moby-074.txt  THE SPERM WHALE'S HEAD--CONTRASTED VIEW      Here, now, are\n  moby-075.txt  THE RIGHT WHALE'S HEAD--CONTRASTED VIEW      Crossing the\n  moby-076.txt  THE BATTERING-RAM       Ere quitting, for the nonce, the\n  moby-077.txt  THE GREAT HEIDELBURGH TUN      Now comes the Baling of\n  moby-078.txt  CISTERN AND BUCKETS     Nimble as a cat, Tashtego\n  moby-079.txt  THE PRAIRE              To scan the lines of his face, or feel\n  moby-080.txt  THE NUT                 If the Sperm Whale be physiognomically a\n  moby-081.txt  THE PEQUOD MEETS THE VIRGIN       The predestinated day\n  moby-082.txt  THE HONOR AND GLORY OF WHALING    There are some\n  moby-083.txt  JONAH HISTORICALLY REGARDED       Reference was made to\n  moby-084.txt  PITCHPOLING             To make them run easily and swiftly,\n  moby-085.txt  THE FOUNTAIN            That for six thousand years --and no one\n  moby-086.txt  THE TAIL                Other poets have warbled the praises of\n  moby-087.txt  THE GRAND ARMADA        The long and narrow peninsula of\n  moby-088.txt  SCHOOLS AND SCHOOLMASTERS         The previous chapter\n  moby-089.txt  FAST-FISH AND LOOSE-FISH          The allusion to the waifs\n  moby-090.txt  HEADS OR TAILS          De balena vero sufficit, si rex habeat\n  moby-091.txt  THE PEQUOD MEETS THE ROSE-BUD     In vain it was to rake\n  moby-092.txt  AMBERGRIS               Now this ambergris is a very curious\n  moby-093.txt  THE CASTAWAY            It was but some few days after\n  moby-094.txt  A SQUEEZE OF THE HAND   That whale of Stubb's so dearly\n  moby-095.txt  THE CASSOCK             Had you stepped on board the Pequod at a\n  moby-096.txt  THE TRY-WORKS           Besides her hoisted boats, an American\n  moby-097.txt  THE LAMP                Had you descended from the Pequod's\n  moby-098.txt  STOWING DOWN AND CLEARING UP      Already has it been\n  moby-099.txt  THE DOUBLOON            Ere now it has been related how Ahab was\n  moby-100.txt  LEG AND ARM THE PEQUOD, OF NANTUCKET, MEETS THE SAMUEL\n  moby-101.txt  THE DECANTER            Ere the English ship fades from sight, be\n  moby-102.txt  A BOWER IN THE ARSACIDES          Hitherto, in descriptively\n  moby-103.txt  MEASUREMENT OF THE WHALE'S SKELETON     In the first\n  moby-104.txt  THE FOSSIL WHALE        From his mighty bulk the whale\n  moby-105.txt  DOES THE WHALE'S MAGNITUDE DIMINISH? WILL HE PERISH?       Inasmuch, then\n  moby-106.txt  AHAB'S LEG              The precipitating manner in which Captain\n  moby-107.txt  THE CARPENTER           Seat thyself sultanically among the\n  moby-108.txt  AHAB AND THE CARPENTER THE DECK--FIRST NIGHT WATCH\n  moby-109.txt  AHAB AND STARBUCK IN THE CABIN        According to usage they\n  moby-110.txt  QUEEQUEG IN HIS COFFIN                Upon searching, it was found\n  moby-111.txt  THE PACIFIC             When gliding by the Bashee isles we emerged\n  moby-112.txt  THE BLACKSMITH          The blacksmith availing himself of the mild,\n  moby-113.txt  THE FORGE               With matted beard, and swathed in a\n  moby-114.txt  THE GILDER              Penetrating further and further into the\n  moby-115.txt  THE PEQUOD MEETS THE BACHELOR         And jolly enough were\n  moby-116.txt  THE DYING WHALE         Not seldom in this life, when, on the\n  moby-117.txt  THE WHALE WATCH         The four whales slain that evening\n  moby-118.txt  THE QUADRANT            The season for the Line at length drew\n  moby-119.txt  THE CANDLES             Warmest climes but nurse the cruellest\n  moby-120.txt  THE DECK TOWARDS THE END OF THE FIRST NIGHT WATCH\n  moby-121.txt  MIDNIGHT--THE FORECASTLE BULWARKS     Stubb and Flask\n  moby-122.txt  MIDNIGHT ALOFT--THUNDER AND LIGHTNING            The\n  moby-123.txt  THE MUSKET              During the most violent shocks of the\n  moby-124.txt  THE NEEDLE              Next morning the not-yet-subsided sea\n  moby-125.txt  THE LOG AND LINE        While now the fated Pequod had been\n  moby-126.txt  THE LIFE-BUOY           Steering now south-eastward by Ahab's\n  moby-127.txt  THE DECK                The coffin laid upon two line-tubs, between\n  moby-128.txt  THE PEQUOD MEETS THE RACHEL     Next day, a large\n  moby-129.txt  THE CABIN               (Ahab moving to go on deck; Pip catches\n  moby-130.txt  THE HAT                 And now that at the proper time and place,\n  moby-131.txt  THE PEQUOD MEETS THE DELIGHT    The intense Pequod\n  moby-132.txt  THE SYMPHONY            It was a clear steel-blue day.  The\n  moby-133.txt  THE CHASE--FIRST DAY    That night, in the mid-watch,\n  moby-134.txt  THE CHASE--SECOND DAY   At day-break, the three", "title": "Moby Dick"}