{"summary": "\nThe protagonist of Hamlet is Prince Hamlet of Denmark, son of the recently deceased King Hamlet, and nephew of King Claudius, his father's brother and successor. Claudius hastily married King Hamlet's widow, Gertrude, Hamlet's mother, and took the throne for himself. Denmark has a long-standing feud with neighboring Norway, which culminated when King Hamlet slew King Fortinbras of Norway in a battle years ago. Although Denmark defeated Norway, and the Norwegian throne fell to King Fortinbras's infirm brother, Denmark fears that an invasion led by the dead Norwegian king's son, Prince Fortinbras, is imminent.\nThe play opens on a cold night on the ramparts of Elsinore, the Danish royal castle. The sentries Bernardo and Marcellus and Hamlet's friend Horatio encounter a ghost that looks like the late King Hamlet. They vow to tell Prince Hamlet what they have witnessed.\nAs the Court gathers the next day, while King Claudius and Queen Gertrude discuss affairs of state with their elderly adviser Polonius, Hamlet looks on glumly. After the Court exits, Hamlet despairs of his father's death and his mother's hasty remarriage. Learning of the Ghost from Horatio, Hamlet resolves to see it himself.\n\nAs Polonius's son Laertes prepares to depart for a visit to France, Polonius gives him contradictory advice that culminates in the ironic maxim \"to thine own self be true.\" Polonius's daughter, Ophelia, admits her interest in Hamlet, but both Polonius and Laertes warn her against seeking the prince's attention. That night on the rampart, the Ghost appears to Hamlet, telling the prince that he was murdered by Claudius and demanding that Hamlet avenge him. Hamlet agrees and the Ghost vanishes. The prince confides to Horatio and the sentries that from now on he plans to \"put on an antic disposition\" and forces them to swear to keep his plans for revenge secret. Privately, however, he remains uncertain of the Ghost's reliability.\nSoon thereafter, Ophelia rushes to her father, telling him that Hamlet arrived at her door the prior night half-undressed and behaving crazily. Polonius blames love for Hamlet's madness and resolves to inform Claudius and Gertrude. As he enters to do so, the king and queen finish welcoming Rosencrantz and Guildenstern, two student acquaintances of Hamlet, to Elsinore. The royal couple has requested that the students investigate the cause of Hamlet's mood and behavior. Additional news requires that Polonius wait to be heard: messengers from Norway inform Claudius that the King of Norway has rebuked Prince Fortinbras for attempting to re-fight his father's battles. The forces that Fortinbras conscripted to march against Denmark will instead be sent against Poland, though they will pass through a portion of Denmark to get there.\nPolonius tells Claudius and Gertrude his theory regarding Hamlet's behavior, and speaks to Hamlet in a hall of the castle to try to uncover more information. Hamlet feigns madness but subtly insults Polonius all the while. When Rosencrantz and Guildenstern arrive, Hamlet greets his friends warmly, but quickly discerns that they are spies. Hamlet becomes bitter, admitting that he is upset at his situation but refusing to give the true reason why, instead commenting on \"what a piece of work\" humanity is. Rosencrantz and Guildenstern tell Hamlet that they have brought along a troupe of actors that they met while traveling to Elsinore. Hamlet, after welcoming the actors and dismissing his friends-turned-spies, plots to stage a play featuring a death in the style of his father's murder, thereby determining the truth of the Ghost's story, as well as Claudius's guilt or innocence, by studying Claudius's reaction.\nPolonius forces Ophelia to return Hamlet's love letters and tokens of affection to the prince while he and Claudius watch from afar to evaluate Hamlet's reaction. Hamlet is walking alone in the hall as the King and Polonius await Ophelia's entrance, musing whether \"to be or not to be.\" When Ophelia enters and tries to return Hamlet's things, Hamlet accuses her of immodesty and cries \"get thee to a nunnery,\" though it is unclear whether this, too, is a show of madness or genuine distress. His reaction convinces Claudius that Hamlet is not mad for love. Shortly thereafter, the court assembles to watch the play Hamlet has commissioned. After seeing the Player King murdered by his rival pouring poison in his ear, Claudius abruptly rises and runs from the room: proof positive for Hamlet of his uncle's guilt.\n\nGertrude summons Hamlet to her room to demand an explanation. Meanwhile, Claudius talks to himself about the impossibility of repenting, since he still has possession of his ill-gotten goods: his brother's crown and wife. He sinks to his knees. Hamlet, on his way to visit his mother, sneaks up behind him, but does not kill him, reasoning that killing Claudius while he is praying will send him straight to heaven while the Ghost is stuck in purgatory. In the queen's bedchamber, Hamlet and Gertrude fight bitterly. Polonius, spying on the conversation from behind a tapestry, makes a noise. Hamlet, believing it is Claudius, stabs wildly, killing Polonius, but pulls aside the curtain and sees his mistake. In a rage, Hamlet brutally insults his mother for her apparent ignorance of Claudius's villainy, but the Ghost enters and reprimands Hamlet for his inaction and harsh words. Unable to see or hear the Ghost herself, Gertrude takes Hamlet's conversation with it as further evidence of madness. After begging the queen to stop sleeping with Claudius, Hamlet leaves, dragging Polonius's corpse away. Hamlet jokes with Claudius about where he has hidden Polonius's body, and the king, fearing for his life, sends Rosencrantz and Guildenstern to accompany Hamlet to England with a sealed letter to the English king requesting that Hamlet be executed immediately.\nDemented by grief at Polonius's death, Ophelia wanders Elsinore. Laertes arrives back from France, enraged by his father's death and his sister's madness. Claudius convinces Laertes that Hamlet is solely responsible, but a letter soon arrives indicating that Hamlet has returned to Denmark, foiling Claudius's plan. Claudius switches tactics, proposing a fencing match between Laertes and Hamlet to settle their differences. Laertes will be given a poison-tipped foil, and Claudius will offer Hamlet poisoned wine as a congratulation if that fails. Gertrude interrupts to report that Ophelia has drowned, though it is unclear whether it was suicide or an accident exacerbated by her madness.\n\nHoratio has received a letter from Hamlet, explaining that the prince escaped by negotiating with pirates who attempted to attack his England-bound ship, and the friends reunite offstage. Two gravediggers discuss Ophelia's apparent suicide while digging her grave. Hamlet arrives with Horatio and banters with one of the gravediggers, who unearths the skull of a jester from Hamlet's childhood, Yorick. Hamlet picks up the skull, saying \"alas, poor Yorick\" as he contemplates mortality. Ophelia's funeral procession approaches, led by Laertes. Hamlet and Horatio initially hide, but when Hamlet realizes that Ophelia is the one being buried, he reveals himself, proclaiming his love for her. Laertes and Hamlet fight by Ophelia's graveside, but the brawl is broken up.\nBack at Elsinore, Hamlet explains to Horatio that he had discovered Claudius's letter with Rosencrantz and Guildenstern's belongings and replaced it with a forged copy indicating that his former friends should be killed instead. A foppish courtier, Osric, interrupts the conversation to deliver the fencing challenge to Hamlet. Hamlet, despite Horatio's advice, accepts it. Hamlet does well at first, leading the match by two hits to none, and Gertrude raises a toast to him using the poisoned glass of wine Claudius had set aside for Hamlet. Claudius tries to stop her, but is too late: she drinks, and Laertes realizes the plot will be revealed. Laertes slashes Hamlet with his poisoned blade. In the ensuing scuffle, they switch weapons and Hamlet wounds Laertes with his own poisoned sword. Gertrude collapses and, claiming she has been poisoned, dies. In his dying moments, Laertes reconciles with Hamlet and reveals Claudius's plan. Hamlet rushes at Claudius and kills him. As the poison takes effect, Hamlet, hearing that Fortinbras is marching through the area, names the Norwegiean prince as his successor. Horatio, distraught at the thought of being the last survivor, says he will commit suicide by drinking the dregs of Gertrude's poisoned wine, but Hamlet begs him to live on and tell his story. Hamlet dies, proclaiming \"the rest is silence.\" Fortinbras, who was ostensibly marching towards Poland with his army, arrives at the palace, along with an English ambassador bringing news of Rosencrantz and Guildenstern's deaths. Horatio promises to recount the full story of what happened, and Fortinbras, seeing the entire Danish royal family dead, takes the crown for himself.\n\n", "full_text": "HAMLET, PRINCE OF DENMARK\n\nby William Shakespeare\n\n\n\n\nPERSONS REPRESENTED.\n\nClaudius, King of Denmark.\nHamlet, Son to the former, and Nephew to the present King.\nPolonius, Lord Chamberlain.\nHoratio, Friend to Hamlet.\nLaertes, Son to Polonius.\nVoltimand, Courtier.\nCornelius, Courtier.\nRosencrantz, Courtier.\nGuildenstern, Courtier.\nOsric, Courtier.\nA Gentleman, Courtier.\nA Priest.\nMarcellus, Officer.\nBernardo, Officer.\nFrancisco, a Soldier\nReynaldo, Servant to Polonius.\nPlayers.\nTwo Clowns, Grave-diggers.\nFortinbras, Prince of Norway.\nA Captain.\nEnglish Ambassadors.\nGhost of Hamlet's Father.\n\nGertrude, Queen of Denmark, and Mother of Hamlet.\nOphelia, Daughter to Polonius.\n\nLords, Ladies, Officers, Soldiers, Sailors, Messengers, and other\nAttendants.\n\nSCENE. Elsinore.\n\n\n\nACT I.\n\nScene I. Elsinore. A platform before the Castle.\n\n[Francisco at his post. Enter to him Bernardo.]\n\nBer.\nWho's there?\n\nFran.\nNay, answer me: stand, and unfold yourself.\n\nBer.\nLong live the king!\n\nFran.\nBernardo?\n\nBer.\nHe.\n\nFran.\nYou come most carefully upon your hour.\n\nBer.\n'Tis now struck twelve. Get thee to bed, Francisco.\n\nFran.\nFor this relief much thanks: 'tis bitter cold,\nAnd I am sick at heart.\n\nBer.\nHave you had quiet guard?\n\nFran.\nNot a mouse stirring.\n\nBer.\nWell, good night.\nIf you do meet Horatio and Marcellus,\nThe rivals of my watch, bid them make haste.\n\nFran.\nI think I hear them.--Stand, ho! Who is there?\n\n[Enter Horatio and Marcellus.]\n\nHor.\nFriends to this ground.\n\nMar.\nAnd liegemen to the Dane.\n\nFran.\nGive you good-night.\n\nMar.\nO, farewell, honest soldier;\nWho hath reliev'd you?\n\nFran.\nBernardo has my place.\nGive you good-night.\n\n[Exit.]\n\nMar.\nHolla! Bernardo!\n\nBer.\nSay.\nWhat, is Horatio there?\n\nHor.\nA piece of him.\n\nBer.\nWelcome, Horatio:--Welcome, good Marcellus.\n\nMar.\nWhat, has this thing appear'd again to-night?\n\nBer.\nI have seen nothing.\n\nMar.\nHoratio says 'tis but our fantasy,\nAnd will not let belief take hold of him\nTouching this dreaded sight, twice seen of us:\nTherefore I have entreated him along\nWith us to watch the minutes of this night;\nThat, if again this apparition come\nHe may approve our eyes and speak to it.\n\nHor.\nTush, tush, 'twill not appear.\n\nBer.\nSit down awhile,\nAnd let us once again assail your ears,\nThat are so fortified against our story,\nWhat we two nights have seen.\n\nHor.\nWell, sit we down,\nAnd let us hear Bernardo speak of this.\n\nBer.\nLast night of all,\nWhen yond same star that's westward from the pole\nHad made his course to illume that part of heaven\nWhere now it burns, Marcellus and myself,\nThe bell then beating one,--\n\nMar.\nPeace, break thee off; look where it comes again!\n\n[Enter Ghost, armed.]\n\nBer.\nIn the same figure, like the king that's dead.\n\nMar.\nThou art a scholar; speak to it, Horatio.\n\nBer.\nLooks it not like the King? mark it, Horatio.\n\nHor.\nMost like:--it harrows me with fear and wonder.\n\nBer.\nIt would be spoke to.\n\nMar.\nQuestion it, Horatio.\n\nHor.\nWhat art thou, that usurp'st this time of night,\nTogether with that fair and warlike form\nIn which the majesty of buried Denmark\nDid sometimes march? By heaven I charge thee, speak!\n\nMar.\nIt is offended.\n\nBer.\nSee, it stalks away!\n\nHor.\nStay! speak, speak! I charge thee speak!\n\n[Exit Ghost.]\n\nMar.\n'Tis gone, and will not answer.\n\nBer.\nHow now, Horatio! You tremble and look pale:\nIs not this something more than fantasy?\nWhat think you on't?\n\nHor.\nBefore my God, I might not this believe\nWithout the sensible and true avouch\nOf mine own eyes.\n\nMar.\nIs it not like the King?\n\nHor.\nAs thou art to thyself:\nSuch was the very armour he had on\nWhen he the ambitious Norway combated;\nSo frown'd he once when, in an angry parle,\nHe smote the sledded Polacks on the ice.\n'Tis strange.\n\nMar.\nThus twice before, and jump at this dead hour,\nWith martial stalk hath he gone by our watch.\n\nHor.\nIn what particular thought to work I know not;\nBut, in the gross and scope of my opinion,\nThis bodes some strange eruption to our state.\n\nMar.\nGood now, sit down, and tell me, he that knows,\nWhy this same strict and most observant watch\nSo nightly toils the subject of the land;\nAnd why such daily cast of brazen cannon,\nAnd foreign mart for implements of war;\nWhy such impress of shipwrights, whose sore task\nDoes not divide the Sunday from the week;\nWhat might be toward, that this sweaty haste\nDoth make the night joint-labourer with the day:\nWho is't that can inform me?\n\nHor.\nThat can I;\nAt least, the whisper goes so. Our last king,\nWhose image even but now appear'd to us,\nWas, as you know, by Fortinbras of Norway,\nThereto prick'd on by a most emulate pride,\nDar'd to the combat; in which our valiant Hamlet,--\nFor so this side of our known world esteem'd him,--\nDid slay this Fortinbras; who, by a seal'd compact,\nWell ratified by law and heraldry,\nDid forfeit, with his life, all those his lands,\nWhich he stood seiz'd of, to the conqueror:\nAgainst the which, a moiety competent\nWas gaged by our king; which had return'd\nTo the inheritance of Fortinbras,\nHad he been vanquisher; as by the same cov'nant,\nAnd carriage of the article design'd,\nHis fell to Hamlet. Now, sir, young Fortinbras,\nOf unimproved mettle hot and full,\nHath in the skirts of Norway, here and there,\nShark'd up a list of lawless resolutes,\nFor food and diet, to some enterprise\nThat hath a stomach in't; which is no other,--\nAs it doth well appear unto our state,--\nBut to recover of us, by strong hand,\nAnd terms compulsatory, those foresaid lands\nSo by his father lost: and this, I take it,\nIs the main motive of our preparations,\nThe source of this our watch, and the chief head\nOf this post-haste and romage in the land.\n\nBer.\nI think it be no other but e'en so:\nWell may it sort, that this portentous figure\nComes armed through our watch; so like the king\nThat was and is the question of these wars.\n\nHor.\nA mote it is to trouble the mind's eye.\nIn the most high and palmy state of Rome,\nA little ere the mightiest Julius fell,\nThe graves stood tenantless, and the sheeted dead\nDid squeak and gibber in the Roman streets;\nAs, stars with trains of fire and dews of blood,\nDisasters in the sun; and the moist star,\nUpon whose influence Neptune's empire stands,\nWas sick almost to doomsday with eclipse:\nAnd even the like precurse of fierce events,--\nAs harbingers preceding still the fates,\nAnd prologue to the omen coming on,--\nHave heaven and earth together demonstrated\nUnto our climature and countrymen.--\nBut, soft, behold! lo, where it comes again!\n\n[Re-enter Ghost.]\n\nI'll cross it, though it blast me.--Stay, illusion!\nIf thou hast any sound, or use of voice,\nSpeak to me:\nIf there be any good thing to be done,\nThat may to thee do ease, and, race to me,\nSpeak to me:\nIf thou art privy to thy country's fate,\nWhich, happily, foreknowing may avoid,\nO, speak!\nOr if thou hast uphoarded in thy life\nExtorted treasure in the womb of earth,\nFor which, they say, you spirits oft walk in death,\n[The cock crows.]\nSpeak of it:--stay, and speak!--Stop it, Marcellus!\n\nMar.\nShall I strike at it with my partisan?\n\nHor.\nDo, if it will not stand.\n\nBer.\n'Tis here!\n\nHor.\n'Tis here!\n\nMar.\n'Tis gone!\n\n[Exit Ghost.]\n\nWe do it wrong, being so majestical,\nTo offer it the show of violence;\nFor it is, as the air, invulnerable,\nAnd our vain blows malicious mockery.\n\nBer.\nIt was about to speak, when the cock crew.\n\nHor.\nAnd then it started, like a guilty thing\nUpon a fearful summons. I have heard\nThe cock, that is the trumpet to the morn,\nDoth with his lofty and shrill-sounding throat\nAwake the god of day; and at his warning,\nWhether in sea or fire, in earth or air,\nThe extravagant and erring spirit hies\nTo his confine: and of the truth herein\nThis present object made probation.\n\nMar.\nIt faded on the crowing of the cock.\nSome say that ever 'gainst that season comes\nWherein our Saviour's birth is celebrated,\nThe bird of dawning singeth all night long;\nAnd then, they say, no spirit dare stir abroad;\nThe nights are wholesome; then no planets strike,\nNo fairy takes, nor witch hath power to charm;\nSo hallow'd and so gracious is the time.\n\nHor.\nSo have I heard, and do in part believe it.\nBut, look, the morn, in russet mantle clad,\nWalks o'er the dew of yon high eastward hill:\nBreak we our watch up: and by my advice,\nLet us impart what we have seen to-night\nUnto young Hamlet; for, upon my life,\nThis spirit, dumb to us, will speak to him:\nDo you consent we shall acquaint him with it,\nAs needful in our loves, fitting our duty?\n\nMar.\nLet's do't, I pray; and I this morning know\nWhere we shall find him most conveniently.\n\n[Exeunt.]\n\n\n\nScene II. Elsinore. A room of state in the Castle.\n\n[Enter the King, Queen, Hamlet, Polonius, Laertes, Voltimand,\nCornelius, Lords, and Attendant.]\n\nKing.\nThough yet of Hamlet our dear brother's death\nThe memory be green, and that it us befitted\nTo bear our hearts in grief, and our whole kingdom\nTo be contracted in one brow of woe;\nYet so far hath discretion fought with nature\nThat we with wisest sorrow think on him,\nTogether with remembrance of ourselves.\nTherefore our sometime sister, now our queen,\nTh' imperial jointress to this warlike state,\nHave we, as 'twere with a defeated joy,--\nWith an auspicious and one dropping eye,\nWith mirth in funeral, and with dirge in marriage,\nIn equal scale weighing delight and dole,--\nTaken to wife; nor have we herein barr'd\nYour better wisdoms, which have freely gone\nWith this affair along:--or all, our thanks.\nNow follows, that you know, young Fortinbras,\nHolding a weak supposal of our worth,\nOr thinking by our late dear brother's death\nOur state to be disjoint and out of frame,\nColleagued with this dream of his advantage,\nHe hath not fail'd to pester us with message,\nImporting the surrender of those lands\nLost by his father, with all bonds of law,\nTo our most valiant brother. So much for him,--\nNow for ourself and for this time of meeting:\nThus much the business is:--we have here writ\nTo Norway, uncle of young Fortinbras,--\nWho, impotent and bed-rid, scarcely hears\nOf this his nephew's purpose,--to suppress\nHis further gait herein; in that the levies,\nThe lists, and full proportions are all made\nOut of his subject:--and we here dispatch\nYou, good Cornelius, and you, Voltimand,\nFor bearers of this greeting to old Norway;\nGiving to you no further personal power\nTo business with the king, more than the scope\nOf these dilated articles allow.\nFarewell; and let your haste commend your duty.\n\nCor. and Volt.\nIn that and all things will we show our duty.\n\nKing.\nWe doubt it nothing: heartily farewell.\n\n[Exeunt Voltimand and Cornelius.]\n\nAnd now, Laertes, what's the news with you?\nYou told us of some suit; what is't, Laertes?\nYou cannot speak of reason to the Dane,\nAnd lose your voice: what wouldst thou beg, Laertes,\nThat shall not be my offer, not thy asking?\nThe head is not more native to the heart,\nThe hand more instrumental to the mouth,\nThan is the throne of Denmark to thy father.\nWhat wouldst thou have, Laertes?\n\nLaer.\nDread my lord,\nYour leave and favour to return to France;\nFrom whence though willingly I came to Denmark,\nTo show my duty in your coronation;\nYet now, I must confess, that duty done,\nMy thoughts and wishes bend again toward France,\nAnd bow them to your gracious leave and pardon.\n\nKing.\nHave you your father's leave? What says Polonius?\n\nPol.\nHe hath, my lord, wrung from me my slow leave\nBy laboursome petition; and at last\nUpon his will I seal'd my hard consent:\nI do beseech you, give him leave to go.\n\nKing.\nTake thy fair hour, Laertes; time be thine,\nAnd thy best graces spend it at thy will!--\nBut now, my cousin Hamlet, and my son--\n\nHam.\n[Aside.] A little more than kin, and less than kind!\n\nKing.\nHow is it that the clouds still hang on you?\n\nHam.\nNot so, my lord; I am too much i' the sun.\n\nQueen.\nGood Hamlet, cast thy nighted colour off,\nAnd let thine eye look like a friend on Denmark.\nDo not for ever with thy vailed lids\nSeek for thy noble father in the dust:\nThou know'st 'tis common,--all that lives must die,\nPassing through nature to eternity.\n\nHam.\nAy, madam, it is common.\n\nQueen.\nIf it be,\nWhy seems it so particular with thee?\n\nHam.\nSeems, madam! Nay, it is; I know not seems.\n'Tis not alone my inky cloak, good mother,\nNor customary suits of solemn black,\nNor windy suspiration of forc'd breath,\nNo, nor the fruitful river in the eye,\nNor the dejected 'havior of the visage,\nTogether with all forms, moods, shows of grief,\nThat can denote me truly: these, indeed, seem;\nFor they are actions that a man might play;\nBut I have that within which passeth show;\nThese but the trappings and the suits of woe.\n\nKing.\n'Tis sweet and commendable in your nature, Hamlet,\nTo give these mourning duties to your father;\nBut, you must know, your father lost a father;\nThat father lost, lost his; and the survivor bound,\nIn filial obligation, for some term\nTo do obsequious sorrow: but to persevere\nIn obstinate condolement is a course\nOf impious stubbornness; 'tis unmanly grief;\nIt shows a will most incorrect to heaven;\nA heart unfortified, a mind impatient;\nAn understanding simple and unschool'd;\nFor what we know must be, and is as common\nAs any the most vulgar thing to sense,\nWhy should we, in our peevish opposition,\nTake it to heart? Fie! 'tis a fault to heaven,\nA fault against the dead, a fault to nature,\nTo reason most absurd; whose common theme\nIs death of fathers, and who still hath cried,\nFrom the first corse till he that died to-day,\n'This must be so.' We pray you, throw to earth\nThis unprevailing woe; and think of us\nAs of a father: for let the world take note\nYou are the most immediate to our throne;\nAnd with no less nobility of love\nThan that which dearest father bears his son\nDo I impart toward you. For your intent\nIn going back to school in Wittenberg,\nIt is most retrograde to our desire:\nAnd we beseech you bend you to remain\nHere in the cheer and comfort of our eye,\nOur chiefest courtier, cousin, and our son.\n\nQueen.\nLet not thy mother lose her prayers, Hamlet:\nI pray thee stay with us; go not to Wittenberg.\n\nHam.\nI shall in all my best obey you, madam.\n\nKing.\nWhy, 'tis a loving and a fair reply:\nBe as ourself in Denmark.--Madam, come;\nThis gentle and unforc'd accord of Hamlet\nSits smiling to my heart: in grace whereof,\nNo jocund health that Denmark drinks to-day\nBut the great cannon to the clouds shall tell;\nAnd the king's rouse the heaven shall bruit again,\nRe-speaking earthly thunder. Come away.\n\n[Exeunt all but Hamlet.]\n\nHam.\nO that this too too solid flesh would melt,\nThaw, and resolve itself into a dew!\nOr that the Everlasting had not fix'd\nHis canon 'gainst self-slaughter! O God! O God!\nHow weary, stale, flat, and unprofitable\nSeem to me all the uses of this world!\nFie on't! O fie! 'tis an unweeded garden,\nThat grows to seed; things rank and gross in nature\nPossess it merely. That it should come to this!\nBut two months dead!--nay, not so much, not two:\nSo excellent a king; that was, to this,\nHyperion to a satyr; so loving to my mother,\nThat he might not beteem the winds of heaven\nVisit her face too roughly. Heaven and earth!\nMust I remember? Why, she would hang on him\nAs if increase of appetite had grown\nBy what it fed on: and yet, within a month,--\nLet me not think on't,--Frailty, thy name is woman!--\nA little month; or ere those shoes were old\nWith which she followed my poor father's body\nLike Niobe, all tears;--why she, even she,--\nO God! a beast that wants discourse of reason,\nWould have mourn'd longer,--married with mine uncle,\nMy father's brother; but no more like my father\nThan I to Hercules: within a month;\nEre yet the salt of most unrighteous tears\nHad left the flushing in her galled eyes,\nShe married:-- O, most wicked speed, to post\nWith such dexterity to incestuous sheets!\nIt is not, nor it cannot come to good;\nBut break my heart,--for I must hold my tongue!\n\n[Enter Horatio, Marcellus, and Bernardo.]\n\nHor.\nHail to your lordship!\n\nHam.\nI am glad to see you well:\nHoratio,--or I do forget myself.\n\nHor.\nThe same, my lord, and your poor servant ever.\n\nHam.\nSir, my good friend; I'll change that name with you:\nAnd what make you from Wittenberg, Horatio?--\nMarcellus?\n\nMar.\nMy good lord,--\n\nHam.\nI am very glad to see you.--Good even, sir.--\nBut what, in faith, make you from Wittenberg?\n\nHor.\nA truant disposition, good my lord.\n\nHam.\nI would not hear your enemy say so;\nNor shall you do my ear that violence,\nTo make it truster of your own report\nAgainst yourself: I know you are no truant.\nBut what is your affair in Elsinore?\nWe'll teach you to drink deep ere you depart.\n\nHor.\nMy lord, I came to see your father's funeral.\n\nHam.\nI prithee do not mock me, fellow-student.\nI think it was to see my mother's wedding.\n\nHor.\nIndeed, my lord, it follow'd hard upon.\n\nHam.\nThrift, thrift, Horatio! The funeral bak'd meats\nDid coldly furnish forth the marriage tables.\nWould I had met my dearest foe in heaven\nOr ever I had seen that day, Horatio!--\nMy father,--methinks I see my father.\n\nHor.\nWhere, my lord?\n\nHam.\nIn my mind's eye, Horatio.\n\nHor.\nI saw him once; he was a goodly king.\n\nHam.\nHe was a man, take him for all in all,\nI shall not look upon his like again.\n\nHor.\nMy lord, I think I saw him yesternight.\n\nHam.\nSaw who?\n\nHor.\nMy lord, the king your father.\n\nHam.\nThe King my father!\n\nHor.\nSeason your admiration for awhile\nWith an attent ear, till I may deliver,\nUpon the witness of these gentlemen,\nThis marvel to you.\n\nHam.\nFor God's love let me hear.\n\nHor.\nTwo nights together had these gentlemen,\nMarcellus and Bernardo, on their watch\nIn the dead vast and middle of the night,\nBeen thus encounter'd. A figure like your father,\nArmed at point exactly, cap-a-pe,\nAppears before them and with solemn march\nGoes slow and stately by them: thrice he walk'd\nBy their oppress'd and fear-surprised eyes,\nWithin his truncheon's length; whilst they, distill'd\nAlmost to jelly with the act of fear,\nStand dumb, and speak not to him. This to me\nIn dreadful secrecy impart they did;\nAnd I with them the third night kept the watch:\nWhere, as they had deliver'd, both in time,\nForm of the thing, each word made true and good,\nThe apparition comes: I knew your father;\nThese hands are not more like.\n\nHam.\nBut where was this?\n\nMar.\nMy lord, upon the platform where we watch'd.\n\nHam.\nDid you not speak to it?\n\nHor.\nMy lord, I did;\nBut answer made it none: yet once methought\nIt lifted up it head, and did address\nItself to motion, like as it would speak:\nBut even then the morning cock crew loud,\nAnd at the sound it shrunk in haste away,\nAnd vanish'd from our sight.\n\nHam.\n'Tis very strange.\n\nHor.\nAs I do live, my honour'd lord, 'tis true;\nAnd we did think it writ down in our duty\nTo let you know of it.\n\nHam.\nIndeed, indeed, sirs, but this troubles me.\nHold you the watch to-night?\n\nMar. and Ber.\nWe do, my lord.\n\nHam.\nArm'd, say you?\n\nBoth.\nArm'd, my lord.\n\nHam.\nFrom top to toe?\n\nBoth.\nMy lord, from head to foot.\n\nHam.\nThen saw you not his face?\n\nHor.\nO, yes, my lord: he wore his beaver up.\n\nHam.\nWhat, look'd he frowningly?\n\nHor.\nA countenance more in sorrow than in anger.\n\nHam.\nPale or red?\n\nHor.\nNay, very pale.\n\nHam.\nAnd fix'd his eyes upon you?\n\nHor.\nMost constantly.\n\nHam.\nI would I had been there.\n\nHor.\nIt would have much amaz'd you.\n\nHam.\nVery like, very like. Stay'd it long?\n\nHor.\nWhile one with moderate haste might tell a hundred.\n\nMar. and Ber.\nLonger, longer.\n\nHor.\nNot when I saw't.\n\nHam.\nHis beard was grizzled,--no?\n\nHor.\nIt was, as I have seen it in his life,\nA sable silver'd.\n\nHam.\nI will watch to-night;\nPerchance 'twill walk again.\n\nHor.\nI warr'nt it will.\n\nHam.\nIf it assume my noble father's person,\nI'll speak to it, though hell itself should gape\nAnd bid me hold my peace. I pray you all,\nIf you have hitherto conceal'd this sight,\nLet it be tenable in your silence still;\nAnd whatsoever else shall hap to-night,\nGive it an understanding, but no tongue:\nI will requite your loves. So, fare ye well:\nUpon the platform, 'twixt eleven and twelve,\nI'll visit you.\n\nAll.\nOur duty to your honour.\n\nHam.\nYour loves, as mine to you: farewell.\n\n[Exeunt Horatio, Marcellus, and Bernardo.]\n\nMy father's spirit in arms! All is not well;\nI doubt some foul play: would the night were come!\nTill then sit still, my soul: foul deeds will rise,\nThough all the earth o'erwhelm them, to men's eyes.\n\n[Exit.]\n\n\n\nScene III. A room in Polonius's house.\n\n[Enter Laertes and Ophelia.]\n\nLaer.\nMy necessaries are embark'd: farewell:\nAnd, sister, as the winds give benefit\nAnd convoy is assistant, do not sleep,\nBut let me hear from you.\n\nOph.\nDo you doubt that?\n\nLaer.\nFor Hamlet, and the trifling of his favour,\nHold it a fashion, and a toy in blood:\nA violet in the youth of primy nature,\nForward, not permanent, sweet, not lasting;\nThe perfume and suppliance of a minute;\nNo more.\n\nOph.\nNo more but so?\n\nLaer.\nThink it no more:\nFor nature, crescent, does not grow alone\nIn thews and bulk; but as this temple waxes,\nThe inward service of the mind and soul\nGrows wide withal. Perhaps he loves you now;\nAnd now no soil nor cautel doth besmirch\nThe virtue of his will: but you must fear,\nHis greatness weigh'd, his will is not his own;\nFor he himself is subject to his birth:\nHe may not, as unvalu'd persons do,\nCarve for himself; for on his choice depends\nThe safety and health of this whole state;\nAnd therefore must his choice be circumscrib'd\nUnto the voice and yielding of that body\nWhereof he is the head. Then if he says he loves you,\nIt fits your wisdom so far to believe it\nAs he in his particular act and place\nMay give his saying deed; which is no further\nThan the main voice of Denmark goes withal.\nThen weigh what loss your honour may sustain\nIf with too credent ear you list his songs,\nOr lose your heart, or your chaste treasure open\nTo his unmaster'd importunity.\nFear it, Ophelia, fear it, my dear sister;\nAnd keep you in the rear of your affection,\nOut of the shot and danger of desire.\nThe chariest maid is prodigal enough\nIf she unmask her beauty to the moon:\nVirtue itself scopes not calumnious strokes:\nThe canker galls the infants of the spring\nToo oft before their buttons be disclos'd:\nAnd in the morn and liquid dew of youth\nContagious blastments are most imminent.\nBe wary then; best safety lies in fear:\nYouth to itself rebels, though none else near.\n\nOph.\nI shall th' effect of this good lesson keep\nAs watchman to my heart. But, good my brother,\nDo not, as some ungracious pastors do,\nShow me the steep and thorny way to heaven;\nWhilst, like a puff'd and reckless libertine,\nHimself the primrose path of dalliance treads\nAnd recks not his own read.\n\nLaer.\nO, fear me not.\nI stay too long:--but here my father comes.\n\n[Enter Polonius.]\n\nA double blessing is a double grace;\nOccasion smiles upon a second leave.\n\nPol.\nYet here, Laertes! aboard, aboard, for shame!\nThe wind sits in the shoulder of your sail,\nAnd you are stay'd for. There,--my blessing with thee!\n\n[Laying his hand on Laertes's head.]\n\nAnd these few precepts in thy memory\nLook thou character. Give thy thoughts no tongue,\nNor any unproportion'd thought his act.\nBe thou familiar, but by no means vulgar.\nThose friends thou hast, and their adoption tried,\nGrapple them unto thy soul with hoops of steel;\nBut do not dull thy palm with entertainment\nOf each new-hatch'd, unfledg'd comrade. Beware\nOf entrance to a quarrel; but, being in,\nBear't that the opposed may beware of thee.\nGive every man thine ear, but few thy voice:\nTake each man's censure, but reserve thy judgment.\nCostly thy habit as thy purse can buy,\nBut not express'd in fancy; rich, not gaudy:\nFor the apparel oft proclaims the man;\nAnd they in France of the best rank and station\nAre most select and generous chief in that.\nNeither a borrower nor a lender be:\nFor loan oft loses both itself and friend;\nAnd borrowing dulls the edge of husbandry.\nThis above all,--to thine own self be true;\nAnd it must follow, as the night the day,\nThou canst not then be false to any man.\nFarewell: my blessing season this in thee!\n\nLaer.\nMost humbly do I take my leave, my lord.\n\nPol.\nThe time invites you; go, your servants tend.\n\nLaer.\nFarewell, Ophelia; and remember well\nWhat I have said to you.\n\nOph.\n'Tis in my memory lock'd,\nAnd you yourself shall keep the key of it.\n\nLaer.\nFarewell.\n\n[Exit.]\n\nPol.\nWhat is't, Ophelia, he hath said to you?\n\nOph.\nSo please you, something touching the Lord Hamlet.\n\nPol.\nMarry, well bethought:\n'Tis told me he hath very oft of late\nGiven private time to you; and you yourself\nHave of your audience been most free and bounteous;\nIf it be so,--as so 'tis put on me,\nAnd that in way of caution,--I must tell you\nYou do not understand yourself so clearly\nAs it behooves my daughter and your honour.\nWhat is between you? give me up the truth.\n\nOph.\nHe hath, my lord, of late made many tenders\nOf his affection to me.\n\nPol.\nAffection! pooh! you speak like a green girl,\nUnsifted in such perilous circumstance.\nDo you believe his tenders, as you call them?\n\nOph.\nI do not know, my lord, what I should think.\n\nPol.\nMarry, I'll teach you: think yourself a baby;\nThat you have ta'en these tenders for true pay,\nWhich are not sterling. Tender yourself more dearly;\nOr,--not to crack the wind of the poor phrase,\nWronging it thus,--you'll tender me a fool.\n\nOph.\nMy lord, he hath importun'd me with love\nIn honourable fashion.\n\nPol.\nAy, fashion you may call it; go to, go to.\n\nOph.\nAnd hath given countenance to his speech, my lord,\nWith almost all the holy vows of heaven.\n\nPol.\nAy, springes to catch woodcocks. I do know,\nWhen the blood burns, how prodigal the soul\nLends the tongue vows: these blazes, daughter,\nGiving more light than heat,--extinct in both,\nEven in their promise, as it is a-making,--\nYou must not take for fire. From this time\nBe something scanter of your maiden presence;\nSet your entreatments at a higher rate\nThan a command to parley. For Lord Hamlet,\nBelieve so much in him, that he is young;\nAnd with a larger tether may he walk\nThan may be given you: in few, Ophelia,\nDo not believe his vows; for they are brokers,--\nNot of that dye which their investments show,\nBut mere implorators of unholy suits,\nBreathing like sanctified and pious bawds,\nThe better to beguile. This is for all,--\nI would not, in plain terms, from this time forth\nHave you so slander any moment leisure\nAs to give words or talk with the Lord Hamlet.\nLook to't, I charge you; come your ways.\n\nOph.\nI shall obey, my lord.\n\n[Exeunt.]\n\n\n\nScene IV. The platform.\n\n[Enter Hamlet, Horatio, and Marcellus.]\n\nHam.\nThe air bites shrewdly; it is very cold.\n\nHor.\nIt is a nipping and an eager air.\n\nHam.\nWhat hour now?\n\nHor.\nI think it lacks of twelve.\n\nMar.\nNo, it is struck.\n\nHor.\nIndeed? I heard it not: then draws near the season\nWherein the spirit held his wont to walk.\n\n[A flourish of trumpets, and ordnance shot off within.]\n\nWhat does this mean, my lord?\n\nHam.\nThe King doth wake to-night and takes his rouse,\nKeeps wassail, and the swaggering up-spring reels;\nAnd, as he drains his draughts of Rhenish down,\nThe kettle-drum and trumpet thus bray out\nThe triumph of his pledge.\n\nHor.\nIs it a custom?\n\nHam.\nAy, marry, is't;\nBut to my mind,--though I am native here,\nAnd to the manner born,--it is a custom\nMore honour'd in the breach than the observance.\nThis heavy-headed revel east and west\nMakes us traduc'd and tax'd of other nations:\nThey clepe us drunkards, and with swinish phrase\nSoil our addition; and, indeed, it takes\nFrom our achievements, though perform'd at height,\nThe pith and marrow of our attribute.\nSo oft it chances in particular men\nThat, for some vicious mole of nature in them,\nAs in their birth,--wherein they are not guilty,\nSince nature cannot choose his origin,--\nBy the o'ergrowth of some complexion,\nOft breaking down the pales and forts of reason;\nOr by some habit, that too much o'er-leavens\nThe form of plausive manners;--that these men,--\nCarrying, I say, the stamp of one defect,\nBeing nature's livery, or fortune's star,--\nTheir virtues else,--be they as pure as grace,\nAs infinite as man may undergo,--\nShall in the general censure take corruption\nFrom that particular fault: the dram of eale\nDoth all the noble substance often doubt\nTo his own scandal.\n\nHor.\nLook, my lord, it comes!\n\n[Enter Ghost.]\n\nHam.\nAngels and ministers of grace defend us!--\nBe thou a spirit of health or goblin damn'd,\nBring with thee airs from heaven or blasts from hell,\nBe thy intents wicked or charitable,\nThou com'st in such a questionable shape\nThat I will speak to thee: I'll call thee Hamlet,\nKing, father, royal Dane; O, answer me!\nLet me not burst in ignorance; but tell\nWhy thy canoniz'd bones, hearsed in death,\nHave burst their cerements; why the sepulchre,\nWherein we saw thee quietly in-urn'd,\nHath op'd his ponderous and marble jaws\nTo cast thee up again! What may this mean,\nThat thou, dead corse, again in complete steel,\nRevisit'st thus the glimpses of the moon,\nMaking night hideous, and we fools of nature\nSo horridly to shake our disposition\nWith thoughts beyond the reaches of our souls?\nSay, why is this? wherefore? what should we do?\n\n[Ghost beckons Hamlet.]\n\nHor.\nIt beckons you to go away with it,\nAs if it some impartment did desire\nTo you alone.\n\nMar.\nLook with what courteous action\nIt waves you to a more removed ground:\nBut do not go with it!\n\nHor.\nNo, by no means.\n\nHam.\nIt will not speak; then will I follow it.\n\nHor.\nDo not, my lord.\n\nHam.\nWhy, what should be the fear?\nI do not set my life at a pin's fee;\nAnd for my soul, what can it do to that,\nBeing a thing immortal as itself?\nIt waves me forth again;--I'll follow it.\n\nHor.\nWhat if it tempt you toward the flood, my lord,\nOr to the dreadful summit of the cliff\nThat beetles o'er his base into the sea,\nAnd there assume some other horrible form\nWhich might deprive your sovereignty of reason,\nAnd draw you into madness? think of it:\nThe very place puts toys of desperation,\nWithout more motive, into every brain\nThat looks so many fadoms to the sea\nAnd hears it roar beneath.\n\nHam.\nIt waves me still.--\nGo on; I'll follow thee.\n\nMar.\nYou shall not go, my lord.\n\nHam.\nHold off your hands.\n\nHor.\nBe rul'd; you shall not go.\n\nHam.\nMy fate cries out,\nAnd makes each petty artery in this body\nAs hardy as the Nemean lion's nerve.--\n\n[Ghost beckons.]\n\nStill am I call'd;--unhand me, gentlemen;--\n\n[Breaking free from them.]\n\nBy heaven, I'll make a ghost of him that lets me!--\nI say, away!--Go on; I'll follow thee.\n\n[Exeunt Ghost and Hamlet.]\n\nHor.\nHe waxes desperate with imagination.\n\nMar.\nLet's follow; 'tis not fit thus to obey him.\n\nHor.\nHave after.--To what issue will this come?\n\nMar.\nSomething is rotten in the state of Denmark.\n\nHor.\nHeaven will direct it.\n\nMar.\nNay, let's follow him.\n\n[Exeunt.]\n\n\n\nScene V. A more remote part of the Castle.\n\n[Enter Ghost and Hamlet.]\n\nHam.\nWhither wilt thou lead me? speak! I'll go no further.\n\nGhost.\nMark me.\n\nHam.\nI will.\n\nGhost.\nMy hour is almost come,\nWhen I to sulph'uous and tormenting flames\nMust render up myself.\n\nHam.\nAlas, poor ghost!\n\nGhost.\nPity me not, but lend thy serious hearing\nTo what I shall unfold.\n\nHam.\nSpeak; I am bound to hear.\n\nGhost.\nSo art thou to revenge, when thou shalt hear.\n\nHam.\nWhat?\n\nGhost.\nI am thy father's spirit;\nDoom'd for a certain term to walk the night,\nAnd for the day confin'd to wastein fires,\nTill the foul crimes done in my days of nature\nAre burnt and purg'd away. But that I am forbid\nTo tell the secrets of my prison-house,\nI could a tale unfold whose lightest word\nWould harrow up thy soul; freeze thy young blood;\nMake thy two eyes, like stars, start from their spheres;\nThy knotted and combined locks to part,\nAnd each particular hair to stand on end\nLike quills upon the fretful porcupine:\nBut this eternal blazon must not be\nTo ears of flesh and blood.--List, list, O, list!--\nIf thou didst ever thy dear father love--\n\nHam.\nO God!\n\nGhost.\nRevenge his foul and most unnatural murder.\n\nHam.\nMurder!\n\nGhost.\nMurder most foul, as in the best it is;\nBut this most foul, strange, and unnatural.\n\nHam.\nHaste me to know't, that I, with wings as swift\nAs meditation or the thoughts of love,\nMay sweep to my revenge.\n\nGhost.\nI find thee apt;\nAnd duller shouldst thou be than the fat weed\nThat rots itself in ease on Lethe wharf,\nWouldst thou not stir in this. Now, Hamlet, hear.\n'Tis given out that, sleeping in my orchard,\nA serpent stung me; so the whole ear of Denmark\nIs by a forged process of my death\nRankly abus'd; but know, thou noble youth,\nThe serpent that did sting thy father's life\nNow wears his crown.\n\nHam.\nO my prophetic soul!\nMine uncle!\n\nGhost.\nAy, that incestuous, that adulterate beast,\nWith witchcraft of his wit, with traitorous gifts,--\nO wicked wit and gifts, that have the power\nSo to seduce!--won to his shameful lust\nThe will of my most seeming-virtuous queen:\nO Hamlet, what a falling-off was there!\nFrom me, whose love was of that dignity\nThat it went hand in hand even with the vow\nI made to her in marriage; and to decline\nUpon a wretch whose natural gifts were poor\nTo those of mine!\nBut virtue, as it never will be mov'd,\nThough lewdness court it in a shape of heaven;\nSo lust, though to a radiant angel link'd,\nWill sate itself in a celestial bed\nAnd prey on garbage.\nBut soft! methinks I scent the morning air;\nBrief let me be.--Sleeping within my orchard,\nMy custom always of the afternoon,\nUpon my secure hour thy uncle stole,\nWith juice of cursed hebenon in a vial,\nAnd in the porches of my ears did pour\nThe leperous distilment; whose effect\nHolds such an enmity with blood of man\nThat, swift as quicksilver, it courses through\nThe natural gates and alleys of the body;\nAnd with a sudden vigour it doth posset\nAnd curd, like eager droppings into milk,\nThe thin and wholesome blood; so did it mine;\nAnd a most instant tetter bark'd about,\nMost lazar-like, with vile and loathsome crust\nAll my smooth body.\nThus was I, sleeping, by a brother's hand,\nOf life, of crown, of queen, at once dispatch'd:\nCut off even in the blossoms of my sin,\nUnhous'led, disappointed, unanel'd;\nNo reckoning made, but sent to my account\nWith all my imperfections on my head:\nO, horrible! O, horrible! most horrible!\nIf thou hast nature in thee, bear it not;\nLet not the royal bed of Denmark be\nA couch for luxury and damned incest.\nBut, howsoever thou pursu'st this act,\nTaint not thy mind, nor let thy soul contrive\nAgainst thy mother aught: leave her to heaven,\nAnd to those thorns that in her bosom lodge,\nTo prick and sting her. Fare thee well at once!\nThe glowworm shows the matin to be near,\nAnd 'gins to pale his uneffectual fire:\nAdieu, adieu! Hamlet, remember me.\n\n[Exit.]\n\nHam.\nO all you host of heaven! O earth! what else?\nAnd shall I couple hell? O, fie!--Hold, my heart;\nAnd you, my sinews, grow not instant old,\nBut bear me stiffly up.--Remember thee!\nAy, thou poor ghost, while memory holds a seat\nIn this distracted globe. Remember thee!\nYea, from the table of my memory\nI'll wipe away all trivial fond records,\nAll saws of books, all forms, all pressures past,\nThat youth and observation copied there;\nAnd thy commandment all alone shall live\nWithin the book and volume of my brain,\nUnmix'd with baser matter: yes, by heaven!--\nO most pernicious woman!\nO villain, villain, smiling, damned villain!\nMy tables,--meet it is I set it down,\nThat one may smile, and smile, and be a villain;\nAt least, I am sure, it may be so in Denmark:\n\n[Writing.]\n\nSo, uncle, there you are. Now to my word;\nIt is 'Adieu, adieu! remember me:'\nI have sworn't.\n\nHor.\n[Within.] My lord, my lord,--\n\nMar.\n[Within.] Lord Hamlet,--\n\nHor.\n[Within.] Heaven secure him!\n\nHam.\nSo be it!\n\nMar.\n[Within.] Illo, ho, ho, my lord!\n\nHam.\nHillo, ho, ho, boy! Come, bird, come.\n\n[Enter Horatio and Marcellus.]\n\nMar.\nHow is't, my noble lord?\n\nHor.\nWhat news, my lord?\n\nHam.\nO, wonderful!\n\nHor.\nGood my lord, tell it.\n\nHam.\nNo; you'll reveal it.\n\nHor.\nNot I, my lord, by heaven.\n\nMar.\nNor I, my lord.\n\nHam.\nHow say you then; would heart of man once think it?--\nBut you'll be secret?\n\nHor. and Mar.\nAy, by heaven, my lord.\n\nHam.\nThere's ne'er a villain dwelling in all Denmark\nBut he's an arrant knave.\n\nHor.\nThere needs no ghost, my lord, come from the grave\nTo tell us this.\n\nHam.\nWhy, right; you are i' the right;\nAnd so, without more circumstance at all,\nI hold it fit that we shake hands and part:\nYou, as your business and desires shall point you,--\nFor every man hath business and desire,\nSuch as it is;--and for my own poor part,\nLook you, I'll go pray.\n\nHor.\nThese are but wild and whirling words, my lord.\n\nHam.\nI'm sorry they offend you, heartily;\nYes, faith, heartily.\n\nHor.\nThere's no offence, my lord.\n\nHam.\nYes, by Saint Patrick, but there is, Horatio,\nAnd much offence too. Touching this vision here,--\nIt is an honest ghost, that let me tell you:\nFor your desire to know what is between us,\nO'ermaster't as you may. And now, good friends,\nAs you are friends, scholars, and soldiers,\nGive me one poor request.\n\nHor.\nWhat is't, my lord? we will.\n\nHam.\nNever make known what you have seen to-night.\n\nHor. and Mar.\nMy lord, we will not.\n\nHam.\nNay, but swear't.\n\nHor.\nIn faith,\nMy lord, not I.\n\nMar.\nNor I, my lord, in faith.\n\nHam.\nUpon my sword.\n\nMar.\nWe have sworn, my lord, already.\n\nHam.\nIndeed, upon my sword, indeed.\n\nGhost.\n[Beneath.] Swear.\n\nHam.\nHa, ha boy! say'st thou so? art thou there, truepenny?--\nCome on!--you hear this fellow in the cellarage,--\nConsent to swear.\n\nHor.\nPropose the oath, my lord.\n\nHam.\nNever to speak of this that you have seen,\nSwear by my sword.\n\nGhost.\n[Beneath.] Swear.\n\nHam.\nHic et ubique? then we'll shift our ground.--\nCome hither, gentlemen,\nAnd lay your hands again upon my sword:\nNever to speak of this that you have heard,\nSwear by my sword.\n\nGhost.\n[Beneath.] Swear.\n\nHam.\nWell said, old mole! canst work i' the earth so fast?\nA worthy pioner!--Once more remove, good friends.\n\nHor.\nO day and night, but this is wondrous strange!\n\nHam.\nAnd therefore as a stranger give it welcome.\nThere are more things in heaven and earth, Horatio,\nThan are dreamt of in your philosophy.\nBut come;--\nHere, as before, never, so help you mercy,\nHow strange or odd soe'er I bear myself,--\nAs I, perchance, hereafter shall think meet\nTo put an antic disposition on,--\nThat you, at such times seeing me, never shall,\nWith arms encumber'd thus, or this head-shake,\nOr by pronouncing of some doubtful phrase,\nAs 'Well, well, we know'; or 'We could, an if we would';--\nOr 'If we list to speak'; or 'There be, an if they might';--\nOr such ambiguous giving out, to note\nThat you know aught of me:--this is not to do,\nSo grace and mercy at your most need help you,\nSwear.\n\nGhost.\n[Beneath.] Swear.\n\nHam.\nRest, rest, perturbed spirit!--So, gentlemen,\nWith all my love I do commend me to you:\nAnd what so poor a man as Hamlet is\nMay do, to express his love and friending to you,\nGod willing, shall not lack. Let us go in together;\nAnd still your fingers on your lips, I pray.\nThe time is out of joint:--O cursed spite,\nThat ever I was born to set it right!--\nNay, come, let's go together.\n\n[Exeunt.]\n\n\n\nAct II.\n\nScene I. A room in Polonius's house.\n\n[Enter Polonius and Reynaldo.]\n\nPol.\nGive him this money and these notes, Reynaldo.\n\nRey.\nI will, my lord.\n\nPol.\nYou shall do marvellous wisely, good Reynaldo,\nBefore You visit him, to make inquiry\nOf his behaviour.\n\nRey.\nMy lord, I did intend it.\n\nPol.\nMarry, well said; very well said. Look you, sir,\nEnquire me first what Danskers are in Paris;\nAnd how, and who, what means, and where they keep,\nWhat company, at what expense; and finding,\nBy this encompassment and drift of question,\nThat they do know my son, come you more nearer\nThan your particular demands will touch it:\nTake you, as 'twere, some distant knowledge of him;\nAs thus, 'I know his father and his friends,\nAnd in part him;--do you mark this, Reynaldo?\n\nRey.\nAy, very well, my lord.\n\nPol.\n'And in part him;--but,' you may say, 'not well:\nBut if't be he I mean, he's very wild;\nAddicted so and so;' and there put on him\nWhat forgeries you please; marry, none so rank\nAs may dishonour him; take heed of that;\nBut, sir, such wanton, wild, and usual slips\nAs are companions noted and most known\nTo youth and liberty.\n\nRey.\nAs gaming, my lord.\n\nPol.\nAy, or drinking, fencing, swearing, quarrelling,\nDrabbing:--you may go so far.\n\nRey.\nMy lord, that would dishonour him.\n\nPol.\nFaith, no; as you may season it in the charge.\nYou must not put another scandal on him,\nThat he is open to incontinency;\nThat's not my meaning: but breathe his faults so quaintly\nThat they may seem the taints of liberty;\nThe flash and outbreak of a fiery mind;\nA savageness in unreclaimed blood,\nOf general assault.\n\nRey.\nBut, my good lord,--\n\nPol.\nWherefore should you do this?\n\nRey.\nAy, my lord,\nI would know that.\n\nPol.\nMarry, sir, here's my drift;\nAnd I believe it is a fetch of warrant:\nYou laying these slight sullies on my son\nAs 'twere a thing a little soil'd i' the working,\nMark you,\nYour party in converse, him you would sound,\nHaving ever seen in the prenominate crimes\nThe youth you breathe of guilty, be assur'd\nHe closes with you in this consequence;\n'Good sir,' or so; or 'friend,' or 'gentleman'--\nAccording to the phrase or the addition\nOf man and country.\n\nRey.\nVery good, my lord.\n\nPol.\nAnd then, sir, does he this,--he does--What was I about to say?--\nBy the mass, I was about to say something:--Where did I leave?\n\nRey.\nAt 'closes in the consequence,' at 'friend or so,' and\ngentleman.'\n\nPol.\nAt--closes in the consequence'--ay, marry!\nHe closes with you thus:--'I know the gentleman;\nI saw him yesterday, or t'other day,\nOr then, or then; with such, or such; and, as you say,\nThere was he gaming; there o'ertook in's rouse;\nThere falling out at tennis': or perchance,\n'I saw him enter such a house of sale,'--\nVidelicet, a brothel,--or so forth.--\nSee you now;\nYour bait of falsehood takes this carp of truth:\nAnd thus do we of wisdom and of reach,\nWith windlaces, and with assays of bias,\nBy indirections find directions out:\nSo, by my former lecture and advice,\nShall you my son. You have me, have you not?\n\nRey.\nMy lord, I have.\n\nPol.\nGod b' wi' you, fare you well.\n\nRey.\nGood my lord!\n\nPol.\nObserve his inclination in yourself.\n\nRey.\nI shall, my lord.\n\nPol.\nAnd let him ply his music.\n\nRey.\nWell, my lord.\n\nPol.\nFarewell!\n\n[Exit Reynaldo.]\n\n[Enter Ophelia.]\n\nHow now, Ophelia! what's the matter?\n\nOph.\nAlas, my lord, I have been so affrighted!\n\nPol.\nWith what, i' the name of God?\n\nOph.\nMy lord, as I was sewing in my chamber,\nLord Hamlet,--with his doublet all unbrac'd;\nNo hat upon his head; his stockings foul'd,\nUngart'red, and down-gyved to his ankle;\nPale as his shirt; his knees knocking each other;\nAnd with a look so piteous in purport\nAs if he had been loosed out of hell\nTo speak of horrors,--he comes before me.\n\nPol.\nMad for thy love?\n\nOph.\nMy lord, I do not know;\nBut truly I do fear it.\n\nPol.\nWhat said he?\n\nOph.\nHe took me by the wrist, and held me hard;\nThen goes he to the length of all his arm;\nAnd with his other hand thus o'er his brow,\nHe falls to such perusal of my face\nAs he would draw it. Long stay'd he so;\nAt last,--a little shaking of mine arm,\nAnd thrice his head thus waving up and down,--\nHe rais'd a sigh so piteous and profound\nAs it did seem to shatter all his bulk\nAnd end his being: that done, he lets me go:\nAnd, with his head over his shoulder turn'd\nHe seem'd to find his way without his eyes;\nFor out o' doors he went without their help,\nAnd to the last bended their light on me.\n\nPol.\nCome, go with me: I will go seek the king.\nThis is the very ecstasy of love;\nWhose violent property fordoes itself,\nAnd leads the will to desperate undertakings,\nAs oft as any passion under heaven\nThat does afflict our natures. I am sorry,--\nWhat, have you given him any hard words of late?\n\nOph.\nNo, my good lord; but, as you did command,\nI did repel his letters and denied\nHis access to me.\n\nPol.\nThat hath made him mad.\nI am sorry that with better heed and judgment\nI had not quoted him: I fear'd he did but trifle,\nAnd meant to wreck thee; but beshrew my jealousy!\nIt seems it as proper to our age\nTo cast beyond ourselves in our opinions\nAs it is common for the younger sort\nTo lack discretion. Come, go we to the king:\nThis must be known; which, being kept close, might move\nMore grief to hide than hate to utter love.\n\n[Exeunt.]\n\n\n\nScene II. A room in the Castle.\n\n[Enter King, Rosencrantz, Guildenstern, and Attendants.]\n\nKing.\nWelcome, dear Rosencrantz and Guildenstern!\nMoreover that we much did long to see you,\nThe need we have to use you did provoke\nOur hasty sending. Something have you heard\nOf Hamlet's transformation; so I call it,\nSince nor the exterior nor the inward man\nResembles that it was. What it should be,\nMore than his father's death, that thus hath put him\nSo much from the understanding of himself,\nI cannot dream of: I entreat you both\nThat, being of so young days brought up with him,\nAnd since so neighbour'd to his youth and humour,\nThat you vouchsafe your rest here in our court\nSome little time: so by your companies\nTo draw him on to pleasures, and to gather,\nSo much as from occasion you may glean,\nWhether aught, to us unknown, afflicts him thus,\nThat, open'd, lies within our remedy.\n\nQueen.\nGood gentlemen, he hath much talk'd of you,\nAnd sure I am two men there are not living\nTo whom he more adheres. If it will please you\nTo show us so much gentry and good-will\nAs to expend your time with us awhile,\nFor the supply and profit of our hope,\nYour visitation shall receive such thanks\nAs fits a king's remembrance.\n\nRos.\nBoth your majesties\nMight, by the sovereign power you have of us,\nPut your dread pleasures more into command\nThan to entreaty.\n\nGuil.\nWe both obey,\nAnd here give up ourselves, in the full bent,\nTo lay our service freely at your feet,\nTo be commanded.\n\nKing.\nThanks, Rosencrantz and gentle Guildenstern.\n\nQueen.\nThanks, Guildenstern and gentle Rosencrantz:\nAnd I beseech you instantly to visit\nMy too-much-changed son.--Go, some of you,\nAnd bring these gentlemen where Hamlet is.\n\nGuil.\nHeavens make our presence and our practices\nPleasant and helpful to him!\n\nQueen.\nAy, amen!\n\n[Exeunt Rosencrantz, Guildenstern, and some Attendants].\n\n[Enter Polonius.]\n\nPol.\nTh' ambassadors from Norway, my good lord,\nAre joyfully return'd.\n\nKing.\nThou still hast been the father of good news.\n\nPol.\nHave I, my lord? Assure you, my good liege,\nI hold my duty, as I hold my soul,\nBoth to my God and to my gracious king:\nAnd I do think,--or else this brain of mine\nHunts not the trail of policy so sure\nAs it hath us'd to do,--that I have found\nThe very cause of Hamlet's lunacy.\n\nKing.\nO, speak of that; that do I long to hear.\n\nPol.\nGive first admittance to the ambassadors;\nMy news shall be the fruit to that great feast.\n\nKing.\nThyself do grace to them, and bring them in.\n\n[Exit Polonius.]\n\nHe tells me, my sweet queen, he hath found\nThe head and source of all your son's distemper.\n\nQueen.\nI doubt it is no other but the main,--\nHis father's death and our o'erhasty marriage.\n\nKing.\nWell, we shall sift him.\n\n[Enter Polonius, with Voltimand and Cornelius.]\n\nWelcome, my good friends!\nSay, Voltimand, what from our brother Norway?\n\nVolt.\nMost fair return of greetings and desires.\nUpon our first, he sent out to suppress\nHis nephew's levies; which to him appear'd\nTo be a preparation 'gainst the Polack;\nBut, better look'd into, he truly found\nIt was against your highness; whereat griev'd,--\nThat so his sickness, age, and impotence\nWas falsely borne in hand,--sends out arrests\nOn Fortinbras; which he, in brief, obeys;\nReceives rebuke from Norway; and, in fine,\nMakes vow before his uncle never more\nTo give th' assay of arms against your majesty.\nWhereon old Norway, overcome with joy,\nGives him three thousand crowns in annual fee;\nAnd his commission to employ those soldiers,\nSo levied as before, against the Polack:\nWith an entreaty, herein further shown,\n[Gives a paper.]\nThat it might please you to give quiet pass\nThrough your dominions for this enterprise,\nOn such regards of safety and allowance\nAs therein are set down.\n\nKing.\nIt likes us well;\nAnd at our more consider'd time we'll read,\nAnswer, and think upon this business.\nMeantime we thank you for your well-took labour:\nGo to your rest; at night we'll feast together:\nMost welcome home!\n\n[Exeunt Voltimand and Cornelius.]\n\nPol.\nThis business is well ended.--\nMy liege, and madam,--to expostulate\nWhat majesty should be, what duty is,\nWhy day is day, night is night, and time is time.\nWere nothing but to waste night, day, and time.\nTherefore, since brevity is the soul of wit,\nAnd tediousness the limbs and outward flourishes,\nI will be brief:--your noble son is mad:\nMad call I it; for to define true madness,\nWhat is't but to be nothing else but mad?\nBut let that go.\n\nQueen.\nMore matter, with less art.\n\nPol.\nMadam, I swear I use no art at all.\nThat he is mad, 'tis true: 'tis true 'tis pity;\nAnd pity 'tis 'tis true: a foolish figure;\nBut farewell it, for I will use no art.\nMad let us grant him then: and now remains\nThat we find out the cause of this effect;\nOr rather say, the cause of this defect,\nFor this effect defective comes by cause:\nThus it remains, and the remainder thus.\nPerpend.\nI have a daughter,--have whilst she is mine,--\nWho, in her duty and obedience, mark,\nHath given me this: now gather, and surmise.\n[Reads.]\n'To the celestial, and my soul's idol, the most beautified\nOphelia,'--\nThat's an ill phrase, a vile phrase; 'beautified' is a vile\nphrase: but you shall hear. Thus:\n[Reads.]\n'In her excellent white bosom, these, &c.'\n\nQueen.\nCame this from Hamlet to her?\n\nPol.\nGood madam, stay awhile; I will be faithful.\n[Reads.]\n  'Doubt thou the stars are fire;\n     Doubt that the sun doth move;\n   Doubt truth to be a liar;\n     But never doubt I love.\n'O dear Ophelia, I am ill at these numbers; I have not art to\nreckon my groans: but that I love thee best, O most best, believe\nit. Adieu.\n  'Thine evermore, most dear lady, whilst this machine is to him,\n     HAMLET.'\nThis, in obedience, hath my daughter show'd me;\nAnd more above, hath his solicitings,\nAs they fell out by time, by means, and place,\nAll given to mine ear.\n\nKing.\nBut how hath she\nReceiv'd his love?\n\nPol.\nWhat do you think of me?\n\nKing.\nAs of a man faithful and honourable.\n\nPol.\nI would fain prove so. But what might you think,\nWhen I had seen this hot love on the wing,--\nAs I perceiv'd it, I must tell you that,\nBefore my daughter told me,-- what might you,\nOr my dear majesty your queen here, think,\nIf I had play'd the desk or table-book,\nOr given my heart a winking, mute and dumb;\nOr look'd upon this love with idle sight;--\nWhat might you think? No, I went round to work,\nAnd my young mistress thus I did bespeak:\n'Lord Hamlet is a prince, out of thy sphere;\nThis must not be:' and then I precepts gave her,\nThat she should lock herself from his resort,\nAdmit no messengers, receive no tokens.\nWhich done, she took the fruits of my advice;\nAnd he, repulsed,--a short tale to make,--\nFell into a sadness; then into a fast;\nThence to a watch; thence into a weakness;\nThence to a lightness; and, by this declension,\nInto the madness wherein now he raves,\nAnd all we wail for.\n\nKing.\nDo you think 'tis this?\n\nQueen.\nIt may be, very likely.\n\nPol.\nHath there been such a time,--I'd fain know that--\nThat I have positively said ''Tis so,'\nWhen it prov'd otherwise?\n\nKing.\nNot that I know.\n\nPol.\nTake this from this, if this be otherwise:\n[Points to his head and shoulder.]\nIf circumstances lead me, I will find\nWhere truth is hid, though it were hid indeed\nWithin the centre.\n\nKing.\nHow may we try it further?\n\nPol.\nYou know sometimes he walks for hours together\nHere in the lobby.\n\nQueen.\nSo he does indeed.\n\nPol.\nAt such a time I'll loose my daughter to him:\nBe you and I behind an arras then;\nMark the encounter: if he love her not,\nAnd he not from his reason fall'n thereon\nLet me be no assistant for a state,\nBut keep a farm and carters.\n\nKing.\nWe will try it.\n\nQueen.\nBut look where sadly the poor wretch comes reading.\n\nPol.\nAway, I do beseech you, both away\nI'll board him presently:--O, give me leave.\n\n[Exeunt King, Queen, and Attendants.]\n\n[Enter Hamlet, reading.]\n\nHow does my good Lord Hamlet?\n\nHam.\nWell, God-a-mercy.\n\nPol.\nDo you know me, my lord?\n\nHam.\nExcellent well; you're a fishmonger.\n\nPol.\nNot I, my lord.\n\nHam.\nThen I would you were so honest a man.\n\nPol.\nHonest, my lord!\n\nHam.\nAy, sir; to be honest, as this world goes, is to be one man\npicked out of ten thousand.\n\nPol.\nThat's very true, my lord.\n\nHam.\nFor if the sun breed maggots in a dead dog, being a god-kissing\ncarrion,--Have you a daughter?\n\nPol.\nI have, my lord.\n\nHam.\nLet her not walk i' the sun: conception is a blessing, but not\nas your daughter may conceive:--friend, look to't.\n\nPol.\nHow say you by that?--[Aside.] Still harping on my daughter:--yet\nhe knew me not at first; he said I was a fishmonger: he is far\ngone, far gone: and truly in my youth I suffered much extremity\nfor love; very near this. I'll speak to him again.--What do you\nread, my lord?\n\nHam.\nWords, words, words.\n\nPol.\nWhat is the matter, my lord?\n\nHam.\nBetween who?\n\nPol.\nI mean, the matter that you read, my lord.\n\nHam.\nSlanders, sir: for the satirical slave says here that old men\nhave grey beards; that their faces are wrinkled; their eyes\npurging thick amber and plum-tree gum; and that they have a\nplentiful lack of wit, together with most weak hams: all which,\nsir, though I most powerfully and potently believe, yet I hold it\nnot honesty to have it thus set down; for you yourself, sir,\nshould be old as I am, if, like a crab, you could go backward.\n\nPol.\n[Aside.] Though this be madness, yet there is a method in't.--\nWill you walk out of the air, my lord?\n\nHam.\nInto my grave?\n\nPol.\nIndeed, that is out o' the air. [Aside.] How pregnant sometimes\nhis replies are! a happiness that often madness hits on, which\nreason and sanity could not so prosperously be delivered of. I\nwill leave him and suddenly contrive the means of meeting between\nhim and my daughter.--My honourable lord, I will most humbly take\nmy leave of you.\n\nHam.\nYou cannot, sir, take from me anything that I will more\nwillingly part withal,--except my life, except my life, except my\nlife.\n\nPol.\nFare you well, my lord.\n\nHam.\nThese tedious old fools!\n\n[Enter Rosencrantz and Guildenstern.]\n\nPol.\nYou go to seek the Lord Hamlet; there he is.\n\nRos.\n[To Polonius.] God save you, sir!\n\n[Exit Polonius.]\n\nGuil.\nMy honoured lord!\n\nRos.\nMy most dear lord!\n\nHam.\nMy excellent good friends! How dost thou, Guildenstern? Ah,\nRosencrantz! Good lads, how do ye both?\n\nRos.\nAs the indifferent children of the earth.\n\nGuil.\nHappy in that we are not over-happy;\nOn fortune's cap we are not the very button.\n\nHam.\nNor the soles of her shoe?\n\nRos.\nNeither, my lord.\n\nHam.\nThen you live about her waist, or in the middle of her\nfavours?\n\nGuil.\nFaith, her privates we.\n\nHam.\nIn the secret parts of fortune? O, most true; she is a\nstrumpet. What's the news?\n\nRos.\nNone, my lord, but that the world's grown honest.\n\nHam.\nThen is doomsday near; but your news is not true. Let me\nquestion more in particular: what have you, my good friends,\ndeserved at the hands of fortune, that she sends you to prison\nhither?\n\nGuil.\nPrison, my lord!\n\nHam.\nDenmark's a prison.\n\nRos.\nThen is the world one.\n\nHam.\nA goodly one; in which there are many confines, wards, and\ndungeons, Denmark being one o' the worst.\n\nRos.\nWe think not so, my lord.\n\nHam.\nWhy, then 'tis none to you; for there is nothing either good\nor bad but thinking makes it so: to me it is a prison.\n\nRos.\nWhy, then, your ambition makes it one; 'tis too narrow for your\nmind.\n\nHam.\nO God, I could be bounded in a nutshell, and count myself a\nking of infinite space, were it not that I have bad dreams.\n\nGuil.\nWhich dreams, indeed, are ambition; for the very substance of\nthe ambitious is merely the shadow of a dream.\n\nHam.\nA dream itself is but a shadow.\n\nRos.\nTruly, and I hold ambition of so airy and light a quality that\nit is but a shadow's shadow.\n\nHam.\nThen are our beggars bodies, and our monarchs and outstretch'd\nheroes the beggars' shadows. Shall we to the court? for, by my\nfay, I cannot reason.\n\nRos. and Guild.\nWe'll wait upon you.\n\nHam.\nNo such matter: I will not sort you with the rest of my\nservants; for, to speak to you like an honest man, I am most\ndreadfully attended. But, in the beaten way of friendship, what\nmake you at Elsinore?\n\nRos.\nTo visit you, my lord; no other occasion.\n\nHam.\nBeggar that I am, I am even poor in thanks; but I thank you:\nand sure, dear friends, my thanks are too dear a halfpenny. Were\nyou not sent for? Is it your own inclining? Is it a free\nvisitation? Come, deal justly with me: come, come; nay, speak.\n\nGuil.\nWhat should we say, my lord?\n\nHam.\nWhy, anything--but to the purpose. You were sent for; and\nthere is a kind of confession in your looks, which your modesties\nhave not craft enough to colour: I know the good king and queen\nhave sent for you.\n\nRos.\nTo what end, my lord?\n\nHam.\nThat you must teach me. But let me conjure you, by the rights\nof our fellowship, by the consonancy of our youth, by the\nobligation of our ever-preserved love, and by what more dear a\nbetter proposer could charge you withal, be even and direct with\nme, whether you were sent for or no.\n\nRos.\n[To Guildenstern.] What say you?\n\nHam.\n[Aside.] Nay, then, I have an eye of you.--If you love me, hold\nnot off.\n\nGuil.\nMy lord, we were sent for.\n\nHam.\nI will tell you why; so shall my anticipation prevent your\ndiscovery, and your secrecy to the king and queen moult no\nfeather. I have of late,--but wherefore I know not,--lost all my\nmirth, forgone all custom of exercises; and indeed, it goes so\nheavily with my disposition that this goodly frame, the earth,\nseems to me a sterile promontory; this most excellent canopy, the\nair, look you, this brave o'erhanging firmament, this majestical\nroof fretted with golden fire,--why, it appears no other thing\nto me than a foul and pestilent congregation of vapours. What a\npiece of work is man! How noble in reason! how infinite in\nfaculties! in form and moving, how express and admirable! in\naction how like an angel! in apprehension, how like a god! the\nbeauty of the world! the paragon of animals! And yet, to me, what\nis this quintessence of dust? Man delights not me; no, nor woman\nneither, though by your smiling you seem to say so.\n\nRos.\nMy lord, there was no such stuff in my thoughts.\n\nHam.\nWhy did you laugh then, when I said 'Man delights not me'?\n\nRos.\nTo think, my lord, if you delight not in man, what lenten\nentertainment the players shall receive from you: we coted them\non the way; and hither are they coming to offer you service.\n\nHam.\nHe that plays the king shall be welcome,--his majesty shall\nhave tribute of me; the adventurous knight shall use his foil and\ntarget; the lover shall not sigh gratis; the humorous man shall\nend his part in peace; the clown shall make those laugh whose\nlungs are tickle o' the sere; and the lady shall say her mind\nfreely, or the blank verse shall halt for't. What players are\nthey?\n\nRos.\nEven those you were wont to take such delight in,--the\ntragedians of the city.\n\nHam.\nHow chances it they travel? their residence, both in\nreputation and profit, was better both ways.\n\nRos.\nI think their inhibition comes by the means of the late\ninnovation.\n\nHam.\nDo they hold the same estimation they did when I was in the\ncity? Are they so followed?\n\nRos.\nNo, indeed, are they not.\n\nHam.\nHow comes it? do they grow rusty?\n\nRos.\nNay, their endeavour keeps in the wonted pace: but there is,\nsir, an aery of children, little eyases, that cry out on the top\nof question, and are most tyrannically clapped for't: these are\nnow the fashion; and so berattle the common stages,--so they call\nthem,--that many wearing rapiers are afraid of goose-quills and\ndare scarce come thither.\n\nHam.\nWhat, are they children? who maintains 'em? How are they\nescoted? Will they pursue the quality no longer than they can\nsing? will they not say afterwards, if they should grow\nthemselves to common players,--as it is most like, if their means\nare no better,--their writers do them wrong to make them exclaim\nagainst their own succession?\n\nRos.\nFaith, there has been much to do on both sides; and the nation\nholds it no sin to tarre them to controversy: there was, for\nawhile, no money bid for argument unless the poet and the player\nwent to cuffs in the question.\n\nHam.\nIs't possible?\n\nGuil.\nO, there has been much throwing about of brains.\n\nHam.\nDo the boys carry it away?\n\nRos.\nAy, that they do, my lord; Hercules and his load too.\n\nHam.\nIt is not very strange; for my uncle is king of Denmark, and\nthose that would make mouths at him while my father lived, give\ntwenty, forty, fifty, a hundred ducats a-piece for his picture in\nlittle. 'Sblood, there is something in this more than natural, if\nphilosophy could find it out.\n\n[Flourish of trumpets within.]\n\nGuil.\nThere are the players.\n\nHam.\nGentlemen, you are welcome to Elsinore. Your hands, come: the\nappurtenance of welcome is fashion and ceremony: let me comply\nwith you in this garb; lest my extent to the players, which I\ntell you must show fairly outward, should more appear like\nentertainment than yours. You are welcome: but my uncle-father\nand aunt-mother are deceived.\n\nGuil.\nIn what, my dear lord?\n\nHam.\nI am but mad north-north-west: when the wind is southerly I\nknow a hawk from a handsaw.\n\n[Enter Polonius.]\n\nPol.\nWell be with you, gentlemen!\n\nHam.\nHark you, Guildenstern;--and you too;--at each ear a hearer: that\ngreat baby you see there is not yet out of his swaddling clouts.\n\nRos.\nHappily he's the second time come to them; for they say an old\nman is twice a child.\n\nHam.\nI will prophesy he comes to tell me of the players; mark it.--You\nsay right, sir: o' Monday morning; 'twas so indeed.\n\nPol.\nMy lord, I have news to tell you.\n\nHam.\nMy lord, I have news to tell you. When Roscius was an actor in\nRome,--\n\nPol.\nThe actors are come hither, my lord.\n\nHam.\nBuzz, buzz!\n\nPol.\nUpon my honour,--\n\nHam.\nThen came each actor on his ass,--\n\nPol.\nThe best actors in the world, either for tragedy, comedy,\nhistory, pastoral, pastoral-comical, historical-pastoral,\ntragical-historical, tragical-comical-historical-pastoral, scene\nindividable, or poem unlimited: Seneca cannot be too heavy nor\nPlautus too light. For the law of writ and the liberty, these are\nthe only men.\n\nHam.\nO Jephthah, judge of Israel, what a treasure hadst thou!\n\nPol.\nWhat treasure had he, my lord?\n\nHam.\nWhy--\n   'One fair daughter, and no more,\n   The which he loved passing well.'\n\n\nPol.\n[Aside.] Still on my daughter.\n\nHam.\nAm I not i' the right, old Jephthah?\n\nPol.\nIf you call me Jephthah, my lord, I have a daughter that I\nlove passing well.\n\nHam.\nNay, that follows not.\n\nPol.\nWhat follows, then, my lord?\n\nHam.\nWhy--\n   'As by lot, God wot,'\nand then, you know,\n   'It came to pass, as most like it was--'\nThe first row of the pious chanson will show you more; for look\nwhere my abridgment comes.\n\n[Enter four or five Players.]\n\nYou are welcome, masters; welcome, all:--I am glad to see thee\nwell.--welcome, good friends.--O, my old friend! Thy face is\nvalanc'd since I saw thee last; comest thou to beard me in\nDenmark?--What, my young lady and mistress! By'r lady, your\nladyship is nearer to heaven than when I saw you last, by the\naltitude of a chopine. Pray God, your voice, like a piece of\nuncurrent gold, be not cracked within the ring.--Masters, you are\nall welcome. We'll e'en to't like French falconers, fly at\nanything we see: we'll have a speech straight: come, give us a\ntaste of your quality: come, a passionate speech.\n\nI Play.\nWhat speech, my lord?\n\nHam.\nI heard thee speak me a speech once,--but it was never acted;\nor if it was, not above once; for the play, I remember, pleased\nnot the million, 'twas caviare to the general; but it was,--as I\nreceived it, and others, whose judgments in such matters cried in\nthe top of mine,--an excellent play, well digested in the scenes,\nset down with as much modesty as cunning. I remember, one said\nthere were no sallets in the lines to make the matter savoury,\nnor no matter in the phrase that might indite the author of\naffectation; but called it an honest method, as wholesome as\nsweet, and by very much more handsome than fine. One speech in it\nI chiefly loved: 'twas AEneas' tale to Dido, and thereabout of it\nespecially where he speaks of Priam's slaughter: if it live in\nyour memory, begin at this line;--let me see, let me see:--\n\nThe rugged Pyrrhus, like th' Hyrcanian beast,--\n\nit is not so:-- it begins with Pyrrhus:--\n\n  'The rugged Pyrrhus,--he whose sable arms,\n   Black as his purpose, did the night resemble\n   When he lay couched in the ominous horse,--\n   Hath now this dread and black complexion smear'd\n   With heraldry more dismal; head to foot\n   Now is he total gules; horridly trick'd\n   With blood of fathers, mothers, daughters, sons,\n   Bak'd and impasted with the parching streets,\n   That lend a tyrannous and a damned light\n   To their vile murders: roasted in wrath and fire,\n   And thus o'ersized with coagulate gore,\n   With eyes like carbuncles, the hellish Pyrrhus\n   Old grandsire Priam seeks.'\n\nSo, proceed you.\n\nPol.\n'Fore God, my lord, well spoken, with good accent and good\ndiscretion.\n\nI Play.\n   Anon he finds him,\n   Striking too short at Greeks: his antique sword,\n   Rebellious to his arm, lies where it falls,\n   Repugnant to command: unequal match'd,\n   Pyrrhus at Priam drives; in rage strikes wide;\n   But with the whiff and wind of his fell sword\n   The unnerved father falls. Then senseless Ilium,\n   Seeming to feel this blow, with flaming top\n   Stoops to his base; and with a hideous crash\n   Takes prisoner Pyrrhus' ear: for lo! his sword,\n   Which was declining on the milky head\n   Of reverend Priam, seem'd i' the air to stick:\n   So, as a painted tyrant, Pyrrhus stood;\n   And, like a neutral to his will and matter,\n   Did nothing.\n   But as we often see, against some storm,\n   A silence in the heavens, the rack stand still,\n   The bold winds speechless, and the orb below\n   As hush as death, anon the dreadful thunder\n   Doth rend the region; so, after Pyrrhus' pause,\n   A roused vengeance sets him new a-work;\n   And never did the Cyclops' hammers fall\n   On Mars's armour, forg'd for proof eterne,\n   With less remorse than Pyrrhus' bleeding sword\n   Now falls on Priam.--\n   Out, out, thou strumpet, Fortune! All you gods,\n   In general synod, take away her power;\n   Break all the spokes and fellies from her wheel,\n   And bowl the round nave down the hill of heaven,\n   As low as to the fiends!\n\nPol.\nThis is too long.\n\nHam.\nIt shall to the barber's, with your beard.--Pr'ythee say on.--\nHe's for a jig or a tale of bawdry, or he sleeps:--say on; come\nto Hecuba.\n\nI Play.\n   But who, O who, had seen the mobled queen,--\n\nHam.\n'The mobled queen'?\n\nPol.\nThat's good! 'Mobled queen' is good.\n\nI Play.\n   Run barefoot up and down, threatening the flames\n   With bisson rheum; a clout upon that head\n   Where late the diadem stood, and for a robe,\n   About her lank and all o'erteemed loins,\n   A blanket, in the alarm of fear caught up;--\n   Who this had seen, with tongue in venom steep'd,\n   'Gainst Fortune's state would treason have pronounc'd:\n   But if the gods themselves did see her then,\n   When she saw Pyrrhus make malicious sport\n   In mincing with his sword her husband's limbs,\n   The instant burst of clamour that she made,--\n   Unless things mortal move them not at all,--\n   Would have made milch the burning eyes of heaven,\n   And passion in the gods.\n\nPol.\nLook, whether he has not turn'd his colour, and has tears in's\neyes.--Pray you, no more!\n\nHam.\n'Tis well. I'll have thee speak out the rest of this soon.--\nGood my lord, will you see the players well bestowed? Do you\nhear? Let them be well used; for they are the abstracts and brief\nchronicles of the time; after your death you were better have a\nbad epitaph than their ill report while you live.\n\nPol.\nMy lord, I will use them according to their desert.\n\nHam.\nOdd's bodikin, man, better: use every man after his\ndesert, and who should scape whipping? Use them after your own\nhonour and dignity: the less they deserve, the more merit is in\nyour bounty. Take them in.\n\nPol.\nCome, sirs.\n\nHam.\nFollow him, friends: we'll hear a play to-morrow.\n\n[Exeunt Polonius with all the Players but the First.]\n\nDost thou hear me, old friend? Can you play 'The Murder of\nGonzago'?\n\nI Play.\nAy, my lord.\n\nHam.\nWe'll ha't to-morrow night. You could, for a need, study a\nspeech of some dozen or sixteen lines which I would set down and\ninsert in't? could you not?\n\nI Play.\nAy, my lord.\n\nHam.\nVery well.--Follow that lord; and look you mock him not.\n\n[Exit First Player.]\n\n--My good friends [to Ros. and Guild.], I'll leave you till\nnight: you are welcome to Elsinore.\n\nRos.\nGood my lord!\n\n[Exeunt Rosencrantz and Guildenstern.]\n\nHam.\nAy, so, God b' wi' ye!\nNow I am alone.\nO, what a rogue and peasant slave am I!\nIs it not monstrous that this player here,\nBut in a fiction, in a dream of passion,\nCould force his soul so to his own conceit\nThat from her working all his visage wan'd;\nTears in his eyes, distraction in's aspect,\nA broken voice, and his whole function suiting\nWith forms to his conceit? And all for nothing!\nFor Hecuba?\nWhat's Hecuba to him, or he to Hecuba,\nThat he should weep for her? What would he do,\nHad he the motive and the cue for passion\nThat I have? He would drown the stage with tears\nAnd cleave the general ear with horrid speech;\nMake mad the guilty, and appal the free;\nConfound the ignorant, and amaze, indeed,\nThe very faculties of eyes and ears.\nYet I,\nA dull and muddy-mettled rascal, peak,\nLike John-a-dreams, unpregnant of my cause,\nAnd can say nothing; no, not for a king\nUpon whose property and most dear life\nA damn'd defeat was made. Am I a coward?\nWho calls me villain? breaks my pate across?\nPlucks off my beard and blows it in my face?\nTweaks me by the nose? gives me the lie i' the throat\nAs deep as to the lungs? who does me this, ha?\n'Swounds, I should take it: for it cannot be\nBut I am pigeon-liver'd, and lack gall\nTo make oppression bitter; or ere this\nI should have fatted all the region kites\nWith this slave's offal: bloody, bawdy villain!\nRemorseless, treacherous, lecherous, kindless villain!\nO, vengeance!\nWhy, what an ass am I! This is most brave,\nThat I, the son of a dear father murder'd,\nPrompted to my revenge by heaven and hell,\nMust, like a whore, unpack my heart with words\nAnd fall a-cursing like a very drab,\nA scullion!\nFie upon't! foh!--About, my brain! I have heard\nThat guilty creatures, sitting at a play,\nHave by the very cunning of the scene\nBeen struck so to the soul that presently\nThey have proclaim'd their malefactions;\nFor murder, though it have no tongue, will speak\nWith most miraculous organ, I'll have these players\nPlay something like the murder of my father\nBefore mine uncle: I'll observe his looks;\nI'll tent him to the quick: if he but blench,\nI know my course. The spirit that I have seen\nMay be the devil: and the devil hath power\nTo assume a pleasing shape; yea, and perhaps\nOut of my weakness and my melancholy,--\nAs he is very potent with such spirits,--\nAbuses me to damn me: I'll have grounds\nMore relative than this.--the play's the thing\nWherein I'll catch the conscience of the king.\n\n[Exit.]\n\n\n\n\nACT III.\n\nScene I. A room in the Castle.\n\n[Enter King, Queen, Polonius, Ophelia, Rosencrantz, and\nGuildenstern.]\n\nKing.\nAnd can you, by no drift of circumstance,\nGet from him why he puts on this confusion,\nGrating so harshly all his days of quiet\nWith turbulent and dangerous lunacy?\n\nRos.\nHe does confess he feels himself distracted,\nBut from what cause he will by no means speak.\n\nGuil.\nNor do we find him forward to be sounded,\nBut, with a crafty madness, keeps aloof\nWhen we would bring him on to some confession\nOf his true state.\n\nQueen.\nDid he receive you well?\n\nRos.\nMost like a gentleman.\n\nGuil.\nBut with much forcing of his disposition.\n\nRos.\nNiggard of question; but, of our demands,\nMost free in his reply.\n\nQueen.\nDid you assay him\nTo any pastime?\n\nRos.\nMadam, it so fell out that certain players\nWe o'er-raught on the way: of these we told him,\nAnd there did seem in him a kind of joy\nTo hear of it: they are about the court,\nAnd, as I think, they have already order\nThis night to play before him.\n\nPol.\n'Tis most true;\nAnd he beseech'd me to entreat your majesties\nTo hear and see the matter.\n\nKing.\nWith all my heart; and it doth much content me\nTo hear him so inclin'd.--\nGood gentlemen, give him a further edge,\nAnd drive his purpose on to these delights.\n\nRos.\nWe shall, my lord.\n\n[Exeunt Rosencrantz and Guildenstern.]\n\nKing.\nSweet Gertrude, leave us too;\nFor we have closely sent for Hamlet hither,\nThat he, as 'twere by accident, may here\nAffront Ophelia:\nHer father and myself,--lawful espials,--\nWill so bestow ourselves that, seeing, unseen,\nWe may of their encounter frankly judge;\nAnd gather by him, as he is behav'd,\nIf't be the affliction of his love or no\nThat thus he suffers for.\n\nQueen.\nI shall obey you:--\nAnd for your part, Ophelia, I do wish\nThat your good beauties be the happy cause\nOf Hamlet's wildness: so shall I hope your virtues\nWill bring him to his wonted way again,\nTo both your honours.\n\nOph.\nMadam, I wish it may.\n\n[Exit Queen.]\n\nPol.\nOphelia, walk you here.--Gracious, so please you,\nWe will bestow ourselves.--[To Ophelia.] Read on this book;\nThat show of such an exercise may colour\nYour loneliness.--We are oft to blame in this,--\n'Tis too much prov'd,--that with devotion's visage\nAnd pious action we do sugar o'er\nThe Devil himself.\n\nKing.\n[Aside.] O, 'tis too true!\nHow smart a lash that speech doth give my conscience!\nThe harlot's cheek, beautied with plastering art,\nIs not more ugly to the thing that helps it\nThan is my deed to my most painted word:\nO heavy burden!\n\nPol.\nI hear him coming: let's withdraw, my lord.\n\n[Exeunt King and Polonius.]\n\n[Enter Hamlet.]\n\nHam.\nTo be, or not to be,--that is the question:--\nWhether 'tis nobler in the mind to suffer\nThe slings and arrows of outrageous fortune\nOr to take arms against a sea of troubles,\nAnd by opposing end them?--To die,--to sleep,--\nNo more; and by a sleep to say we end\nThe heartache, and the thousand natural shocks\nThat flesh is heir to,--'tis a consummation\nDevoutly to be wish'd. To die,--to sleep;--\nTo sleep! perchance to dream:--ay, there's the rub;\nFor in that sleep of death what dreams may come,\nWhen we have shuffled off this mortal coil,\nMust give us pause: there's the respect\nThat makes calamity of so long life;\nFor who would bear the whips and scorns of time,\nThe oppressor's wrong, the proud man's contumely,\nThe pangs of despis'd love, the law's delay,\nThe insolence of office, and the spurns\nThat patient merit of the unworthy takes,\nWhen he himself might his quietus make\nWith a bare bodkin? who would these fardels bear,\nTo grunt and sweat under a weary life,\nBut that the dread of something after death,--\nThe undiscover'd country, from whose bourn\nNo traveller returns,--puzzles the will,\nAnd makes us rather bear those ills we have\nThan fly to others that we know not of?\nThus conscience does make cowards of us all;\nAnd thus the native hue of resolution\nIs sicklied o'er with the pale cast of thought;\nAnd enterprises of great pith and moment,\nWith this regard, their currents turn awry,\nAnd lose the name of action.--Soft you now!\nThe fair Ophelia!--Nymph, in thy orisons\nBe all my sins remember'd.\n\nOph.\nGood my lord,\nHow does your honour for this many a day?\n\nHam.\nI humbly thank you; well, well, well.\n\nOph.\nMy lord, I have remembrances of yours\nThat I have longed long to re-deliver.\nI pray you, now receive them.\n\nHam.\nNo, not I;\nI never gave you aught.\n\nOph.\nMy honour'd lord, you know right well you did;\nAnd with them words of so sweet breath compos'd\nAs made the things more rich; their perfume lost,\nTake these again; for to the noble mind\nRich gifts wax poor when givers prove unkind.\nThere, my lord.\n\nHam.\nHa, ha! are you honest?\n\nOph.\nMy lord?\n\nHam.\nAre you fair?\n\nOph.\nWhat means your lordship?\n\nHam.\nThat if you be honest and fair, your honesty should admit no\ndiscourse to your beauty.\n\nOph.\nCould beauty, my lord, have better commerce than with honesty?\n\nHam.\nAy, truly; for the power of beauty will sooner transform\nhonesty from what it is to a bawd than the force of honesty can\ntranslate beauty into his likeness: this was sometime a paradox,\nbut now the time gives it proof. I did love you once.\n\nOph.\nIndeed, my lord, you made me believe so.\n\nHam.\nYou should not have believ'd me; for virtue cannot so\ninoculate our old stock but we shall relish of it: I loved you\nnot.\n\nOph.\nI was the more deceived.\n\nHam.\nGet thee to a nunnery: why wouldst thou be a breeder of\nsinners? I am myself indifferent honest; but yet I could accuse\nme of such things that it were better my mother had not borne me:\nI am very proud, revengeful, ambitious; with more offences at my\nbeck than I have thoughts to put them in, imagination to give\nthem shape, or time to act them in. What should such fellows as I\ndo crawling between earth and heaven? We are arrant knaves, all;\nbelieve none of us. Go thy ways to a nunnery. Where's your\nfather?\n\nOph.\nAt home, my lord.\n\nHam.\nLet the doors be shut upon him, that he may play the fool\nnowhere but in's own house. Farewell.\n\nOph.\nO, help him, you sweet heavens!\n\nHam.\nIf thou dost marry, I'll give thee this plague for thy dowry,--\nbe thou as chaste as ice, as pure as snow, thou shalt not escape\ncalumny. Get thee to a nunnery, go: farewell. Or, if thou wilt\nneeds marry, marry a fool; for wise men know well enough what\nmonsters you make of them. To a nunnery, go; and quickly too.\nFarewell.\n\nOph.\nO heavenly powers, restore him!\n\nHam.\nI have heard of your paintings too, well enough; God hath\ngiven you one face, and you make yourselves another: you jig, you\namble, and you lisp, and nickname God's creatures, and make your\nwantonness your ignorance. Go to, I'll no more on't; it hath made\nme mad. I say, we will have no more marriages: those that are\nmarried already, all but one, shall live; the rest shall keep as\nthey are. To a nunnery, go.\n\n[Exit.]\n\nOph.\nO, what a noble mind is here o'erthrown!\nThe courtier's, scholar's, soldier's, eye, tongue, sword,\nThe expectancy and rose of the fair state,\nThe glass of fashion and the mould of form,\nThe observ'd of all observers,--quite, quite down!\nAnd I, of ladies most deject and wretched\nThat suck'd the honey of his music vows,\nNow see that noble and most sovereign reason,\nLike sweet bells jangled, out of tune and harsh;\nThat unmatch'd form and feature of blown youth\nBlasted with ecstasy: O, woe is me,\nTo have seen what I have seen, see what I see!\n\n[Re-enter King and Polonius.]\n\nKing.\nLove! his affections do not that way tend;\nNor what he spake, though it lack'd form a little,\nWas not like madness. There's something in his soul\nO'er which his melancholy sits on brood;\nAnd I do doubt the hatch and the disclose\nWill be some danger: which for to prevent,\nI have in quick determination\nThus set it down:--he shall with speed to England\nFor the demand of our neglected tribute:\nHaply the seas, and countries different,\nWith variable objects, shall expel\nThis something-settled matter in his heart;\nWhereon his brains still beating puts him thus\nFrom fashion of himself. What think you on't?\n\nPol.\nIt shall do well: but yet do I believe\nThe origin and commencement of his grief\nSprung from neglected love.--How now, Ophelia!\nYou need not tell us what Lord Hamlet said;\nWe heard it all.--My lord, do as you please;\nBut if you hold it fit, after the play,\nLet his queen mother all alone entreat him\nTo show his grief: let her be round with him;\nAnd I'll be plac'd, so please you, in the ear\nOf all their conference. If she find him not,\nTo England send him; or confine him where\nYour wisdom best shall think.\n\nKing.\nIt shall be so:\nMadness in great ones must not unwatch'd go.\n\n[Exeunt.]\n\n\n\nScene II. A hall in the Castle.\n\n[Enter Hamlet and certain Players.]\n\nHam.\nSpeak the speech, I pray you, as I pronounced it to you,\ntrippingly on the tongue: but if you mouth it, as many of your\nplayers do, I had as lief the town crier spoke my lines. Nor do\nnot saw the air too much with your hand, thus, but use all\ngently: for in the very torrent, tempest, and, as I may say,\nwhirlwind of passion, you must acquire and beget a\ntemperance that may give it smoothness. O, it offends me to the\nsoul, to hear a robustious periwig-pated fellow tear a passion to\ntatters, to very rags, to split the ears of the groundlings, who,\nfor the most part, are capable of nothing but inexplicable dumb\nshows and noise: I would have such a fellow whipped for o'erdoing\nTermagant; it out-herods Herod: pray you avoid it.\n\nI Player.\nI warrant your honour.\n\nHam.\nBe not too tame neither; but let your own discretion be your\ntutor: suit the action to the word, the word to the action; with\nthis special observance, that you o'erstep not the modesty of\nnature: for anything so overdone is from the purpose of playing,\nwhose end, both at the first and now, was and is, to hold, as\n'twere, the mirror up to nature; to show virtue her own image,\nscorn her own image, and the very age and body of the time his\nform and pressure. Now, this overdone, or come tardy off, though\nit make the unskilful laugh, cannot but make the judicious\ngrieve; the censure of the which one must in your allowance,\no'erweigh a whole theatre of others. O, there be players that I\nhave seen play,--and heard others praise, and that highly,--not\nto speak it profanely, that, neither having the accent of\nChristians, nor the gait of Christian, pagan, nor man, have so\nstrutted and bellowed that I have thought some of nature's\njourneymen had made men, and not made them well, they imitated\nhumanity so abominably.\n\nI Player.\nI hope we have reform'd that indifferently with us, sir.\n\nHam.\nO, reform it altogether. And let those that play your clowns\nspeak no more than is set down for them: for there be of them\nthat will themselves laugh, to set on some quantity of barren\nspectators to laugh too, though in the meantime some necessary\nquestion of the play be then to be considered: that's villanous\nand shows a most pitiful ambition in the fool that uses it. Go\nmake you ready.\n\n[Exeunt Players.]\n\n[Enter Polonius, Rosencrantz, and Guildenstern.]\n\nHow now, my lord! will the king hear this piece of work?\n\nPol.\nAnd the queen too, and that presently.\n\nHam.\nBid the players make haste.\n\n[Exit Polonius.]\n\nWill you two help to hasten them?\n\nRos. and Guil.\nWe will, my lord.\n\n[Exeunt Ros. and Guil.]\n\nHam.\nWhat, ho, Horatio!\n\n[Enter Horatio.]\n\nHor.\nHere, sweet lord, at your service.\n\nHam.\nHoratio, thou art e'en as just a man\nAs e'er my conversation cop'd withal.\n\nHor.\nO, my dear lord,--\n\nHam.\nNay, do not think I flatter;\nFor what advancement may I hope from thee,\nThat no revenue hast, but thy good spirits,\nTo feed and clothe thee? Why should the poor be flatter'd?\nNo, let the candied tongue lick absurd pomp;\nAnd crook the pregnant hinges of the knee\nWhere thrift may follow fawning. Dost thou hear?\nSince my dear soul was mistress of her choice,\nAnd could of men distinguish, her election\nHath seal'd thee for herself: for thou hast been\nAs one, in suffering all, that suffers nothing;\nA man that Fortune's buffets and rewards\nHast ta'en with equal thanks: and bles'd are those\nWhose blood and judgment are so well commingled\nThat they are not a pipe for Fortune's finger\nTo sound what stop she please. Give me that man\nThat is not passion's slave, and I will wear him\nIn my heart's core, ay, in my heart of heart,\nAs I do thee.--Something too much of this.--\nThere is a play to-night before the king;\nOne scene of it comes near the circumstance,\nWhich I have told thee, of my father's death:\nI pr'ythee, when thou see'st that act a-foot,\nEven with the very comment of thy soul\nObserve mine uncle: if his occulted guilt\nDo not itself unkennel in one speech,\nIt is a damned ghost that we have seen;\nAnd my imaginations are as foul\nAs Vulcan's stithy. Give him heedful note;\nFor I mine eyes will rivet to his face;\nAnd, after, we will both our judgments join\nIn censure of his seeming.\n\nHor.\nWell, my lord:\nIf he steal aught the whilst this play is playing,\nAnd scape detecting, I will pay the theft.\n\nHam.\nThey are coming to the play. I must be idle:\nGet you a place.\n\n[Danish march. A flourish. Enter King, Queen, Polonius, Ophelia,\nRosencrantz, Guildenstern, and others.]\n\nKing.\nHow fares our cousin Hamlet?\n\nHam.\nExcellent, i' faith; of the chameleon's dish: I eat the air,\npromise-crammed: you cannot feed capons so.\n\nKing.\nI have nothing with this answer, Hamlet; these words are not\nmine.\n\nHam.\nNo, nor mine now. My lord, you play'd once i' the university, you\nsay? [To Polonius.]\n\nPol.\nThat did I, my lord, and was accounted a good actor.\n\nHam.\nWhat did you enact?\n\nPol.\nI did enact Julius Caesar; I was kill'd i' the Capitol; Brutus\nkilled me.\n\nHam.\nIt was a brute part of him to kill so capital a calf there.--Be\nthe players ready?\n\nRos.\nAy, my lord; they stay upon your patience.\n\nQueen.\nCome hither, my dear Hamlet, sit by me.\n\nHam.\nNo, good mother, here's metal more attractive.\n\nPol.\nO, ho! do you mark that? [To the King.]\n\nHam.\nLady, shall I lie in your lap?\n[Lying down at Ophelia's feet.]\n\nOph.\nNo, my lord.\n\nHam.\nI mean, my head upon your lap?\n\nOph.\nAy, my lord.\n\nHam.\nDo you think I meant country matters?\n\nOph.\nI think nothing, my lord.\n\nHam.\nThat's a fair thought to lie between maids' legs.\n\nOph.\nWhat is, my lord?\n\nHam.\nNothing.\n\nOph.\nYou are merry, my lord.\n\nHam.\nWho, I?\n\nOph.\nAy, my lord.\n\nHam.\nO, your only jig-maker! What should a man do but be merry?\nfor look you how cheerfully my mother looks, and my father died\nwithin 's two hours.\n\nOph.\nNay, 'tis twice two months, my lord.\n\nHam.\nSo long? Nay then, let the devil wear black, for I'll have a\nsuit of sables. O heavens! die two months ago, and not forgotten\nyet? Then there's hope a great man's memory may outlive his life\nhalf a year: but, by'r lady, he must build churches then; or else\nshall he suffer not thinking on, with the hobby-horse, whose\nepitaph is 'For, O, for, O, the hobby-horse is forgot!'\n\n[Trumpets sound. The dumb show enters.]\n\n[Enter a King and a Queen very lovingly; the Queen embracing\nhim and he her. She kneels, and makes show of protestation\nunto him. He takes her up, and declines his head upon her\nneck: lays him down upon a bank of flowers: she, seeing\nhim asleep, leaves him. Anon comes in a fellow, takes off his\ncrown, kisses it, pours poison in the king's ears, and exit. The\nQueen returns, finds the King dead, and makes passionate action.\nThe Poisoner with some three or four Mutes, comes in again,\nseeming to lament with her. The dead body is carried away. The\nPoisoner wooes the Queen with gifts; she seems loth and unwilling\nawhile, but in the end accepts his love.]\n\n[Exeunt.]\n\nOph.\nWhat means this, my lord?\n\nHam.\nMarry, this is miching mallecho; it means mischief.\n\nOph.\nBelike this show imports the argument of the play.\n\n[Enter Prologue.]\n\nHam.\nWe shall know by this fellow: the players cannot keep counsel;\nthey'll tell all.\n\nOph.\nWill he tell us what this show meant?\n\nHam.\nAy, or any show that you'll show him: be not you ashamed to\nshow, he'll not shame to tell you what it means.\n\nOph.\nYou are naught, you are naught: I'll mark the play.\n\nPro.\n   For us, and for our tragedy,\n   Here stooping to your clemency,\n   We beg your hearing patiently.\n\nHam.\nIs this a prologue, or the posy of a ring?\n\nOph.\n'Tis brief, my lord.\n\nHam.\nAs woman's love.\n\n[Enter a King and a Queen.]\n\nP. King.\nFull thirty times hath Phoebus' cart gone round\nNeptune's salt wash and Tellus' orbed ground,\nAnd thirty dozen moons with borrow'd sheen\nAbout the world have times twelve thirties been,\nSince love our hearts, and Hymen did our hands,\nUnite commutual in most sacred bands.\n\nP. Queen.\nSo many journeys may the sun and moon\nMake us again count o'er ere love be done!\nBut, woe is me, you are so sick of late,\nSo far from cheer and from your former state.\nThat I distrust you. Yet, though I distrust,\nDiscomfort you, my lord, it nothing must:\nFor women's fear and love holds quantity;\nIn neither aught, or in extremity.\nNow, what my love is, proof hath made you know;\nAnd as my love is siz'd, my fear is so:\nWhere love is great, the littlest doubts are fear;\nWhere little fears grow great, great love grows there.\n\nP. King.\nFaith, I must leave thee, love, and shortly too;\nMy operant powers their functions leave to do:\nAnd thou shalt live in this fair world behind,\nHonour'd, belov'd, and haply one as kind\nFor husband shalt thou,--\n\nP. Queen.\nO, confound the rest!\nSuch love must needs be treason in my breast:\nIn second husband let me be accurst!\nNone wed the second but who kill'd the first.\n\nHam.\n[Aside.] Wormwood, wormwood!\n\nP. Queen.\nThe instances that second marriage move\nAre base respects of thrift, but none of love.\nA second time I kill my husband dead\nWhen second husband kisses me in bed.\n\nP. King.\nI do believe you think what now you speak;\nBut what we do determine oft we break.\nPurpose is but the slave to memory;\nOf violent birth, but poor validity:\nWhich now, like fruit unripe, sticks on the tree;\nBut fall unshaken when they mellow be.\nMost necessary 'tis that we forget\nTo pay ourselves what to ourselves is debt:\nWhat to ourselves in passion we propose,\nThe passion ending, doth the purpose lose.\nThe violence of either grief or joy\nTheir own enactures with themselves destroy:\nWhere joy most revels, grief doth most lament;\nGrief joys, joy grieves, on slender accident.\nThis world is not for aye; nor 'tis not strange\nThat even our loves should with our fortunes change;\nFor 'tis a question left us yet to prove,\nWhether love lead fortune, or else fortune love.\nThe great man down, you mark his favourite flies,\nThe poor advanc'd makes friends of enemies;\nAnd hitherto doth love on fortune tend:\nFor who not needs shall never lack a friend;\nAnd who in want a hollow friend doth try,\nDirectly seasons him his enemy.\nBut, orderly to end where I begun,--\nOur wills and fates do so contrary run\nThat our devices still are overthrown;\nOur thoughts are ours, their ends none of our own:\nSo think thou wilt no second husband wed;\nBut die thy thoughts when thy first lord is dead.\n\nP. Queen.\nNor earth to me give food, nor heaven light!\nSport and repose lock from me day and night!\nTo desperation turn my trust and hope!\nAn anchor's cheer in prison be my scope!\nEach opposite that blanks the face of joy\nMeet what I would have well, and it destroy!\nBoth here and hence pursue me lasting strife,\nIf, once a widow, ever I be wife!\n\nHam.\nIf she should break it now! [To Ophelia.]\n\nP. King.\n'Tis deeply sworn. Sweet, leave me here awhile;\nMy spirits grow dull, and fain I would beguile\nThe tedious day with sleep.\n[Sleeps.]\n\nP. Queen.\nSleep rock thy brain,\nAnd never come mischance between us twain!\n\n[Exit.]\n\nHam.\nMadam, how like you this play?\n\nQueen.\nThe lady protests too much, methinks.\n\nHam.\nO, but she'll keep her word.\n\nKing.\nHave you heard the argument? Is there no offence in't?\n\nHam.\nNo, no! They do but jest, poison in jest; no offence i' the\nworld.\n\nKing.\nWhat do you call the play?\n\nHam.\nThe Mouse-trap. Marry, how? Tropically. This play is the\nimage of a murder done in Vienna: Gonzago is the duke's name;\nhis wife, Baptista: you shall see anon; 'tis a knavish piece of\nwork: but what o' that? your majesty, and we that have free\nsouls, it touches us not: let the gall'd jade wince; our withers\nare unwrung.\n\n[Enter Lucianus.]\n\nThis is one Lucianus, nephew to the King.\n\nOph.\nYou are a good chorus, my lord.\n\nHam.\nI could interpret between you and your love, if I could see\nthe puppets dallying.\n\nOph.\nYou are keen, my lord, you are keen.\n\nHam.\nIt would cost you a groaning to take off my edge.\n\nOph.\nStill better, and worse.\n\nHam.\nSo you must take your husbands.--Begin, murderer; pox, leave\nthy damnable faces, and begin. Come:--'The croaking raven doth\nbellow for revenge.'\n\nLuc.\nThoughts black, hands apt, drugs fit, and time agreeing;\nConfederate season, else no creature seeing;\nThou mixture rank, of midnight weeds collected,\nWith Hecate's ban thrice blasted, thrice infected,\nThy natural magic and dire property\nOn wholesome life usurp immediately.\n\n[Pours the poison into the sleeper's ears.]\n\nHam.\nHe poisons him i' the garden for's estate. His name's Gonzago:\nThe story is extant, and written in very choice Italian; you\nshall see anon how the murderer gets the love of Gonzago's wife.\n\nOph.\nThe King rises.\n\nHam.\nWhat, frighted with false fire!\n\nQueen.\nHow fares my lord?\n\nPol.\nGive o'er the play.\n\nKing.\nGive me some light:--away!\n\nAll.\nLights, lights, lights!\n\n[Exeunt all but Hamlet and Horatio.]\n\nHam.\n   Why, let the strucken deer go weep,\n     The hart ungalled play;\n   For some must watch, while some must sleep:\n     So runs the world away.--\nWould not this, sir, and a forest of feathers--if the rest of my\nfortunes turn Turk with me,--with two Provincial roses on my\nrazed shoes, get me a fellowship in a cry of players, sir?\n\nHor.\nHalf a share.\n\nHam.\n     A whole one, I.\n   For thou dost know, O Damon dear,\n     This realm dismantled was\n   Of Jove himself; and now reigns here\n     A very, very--pajock.\n\nHor.\nYou might have rhymed.\n\nHam.\nO good Horatio, I'll take the ghost's word for a thousand\npound! Didst perceive?\n\nHor.\nVery well, my lord.\n\nHam.\nUpon the talk of the poisoning?--\n\nHor.\nI did very well note him.\n\nHam.\nAh, ha!--Come, some music! Come, the recorders!--\n   For if the king like not the comedy,\n   Why then, belike he likes it not, perdy.\nCome, some music!\n\n[Enter Rosencrantz and Guildenstern.]\n\nGuil.\nGood my lord, vouchsafe me a word with you.\n\nHam.\nSir, a whole history.\n\nGuil.\nThe king, sir--\n\nHam.\nAy, sir, what of him?\n\nGuil.\nIs, in his retirement, marvellous distempered.\n\nHam.\nWith drink, sir?\n\nGuil.\nNo, my lord; rather with choler.\n\nHam.\nYour wisdom should show itself more richer to signify this to\nthe doctor; for me to put him to his purgation would perhaps\nplunge him into far more choler.\n\nGuil.\nGood my lord, put your discourse into some frame, and start\nnot so wildly from my affair.\n\nHam.\nI am tame, sir:--pronounce.\n\nGuil.\nThe queen, your mother, in most great affliction of spirit,\nhath sent me to you.\n\nHam.\nYou are welcome.\n\nGuil.\nNay, good my lord, this courtesy is not of the right breed.\nIf it shall please you to make me a wholesome answer, I will do\nyour mother's commandment: if not, your pardon and my return\nshall be the end of my business.\n\nHam.\nSir, I cannot.\n\nGuil.\nWhat, my lord?\n\nHam.\nMake you a wholesome answer; my wit's diseased: but, sir, such\nanswer as I can make, you shall command; or rather, as you say,\nmy mother: therefore no more, but to the matter: my mother, you\nsay,--\n\nRos.\nThen thus she says: your behaviour hath struck her into\namazement and admiration.\n\nHam.\nO wonderful son, that can so stonish a mother!--But is there no\nsequel at the heels of this mother's admiration?\n\nRos.\nShe desires to speak with you in her closet ere you go to bed.\n\nHam.\nWe shall obey, were she ten times our mother. Have you any\nfurther trade with us?\n\nRos.\nMy lord, you once did love me.\n\nHam.\nAnd so I do still, by these pickers and stealers.\n\nRos.\nGood my lord, what is your cause of distemper? you do, surely,\nbar the door upon your own liberty if you deny your griefs to\nyour friend.\n\nHam.\nSir, I lack advancement.\n\nRos.\nHow can that be, when you have the voice of the king himself\nfor your succession in Denmark?\n\nHam.\nAy, sir, but 'While the grass grows'--the proverb is something\nmusty.\n\n[Re-enter the Players, with recorders.]\n\nO, the recorders:--let me see one.--To withdraw with you:--why do\nyou go about to recover the wind of me, as if you would drive me\ninto a toil?\n\nGuil.\nO my lord, if my duty be too bold, my love is too unmannerly.\n\nHam.\nI do not well understand that. Will you play upon this pipe?\n\nGuil.\nMy lord, I cannot.\n\nHam.\nI pray you.\n\nGuil.\nBelieve me, I cannot.\n\nHam.\nI do beseech you.\n\nGuil.\nI know, no touch of it, my lord.\n\nHam.\n'Tis as easy as lying: govern these ventages with your\nfinger and thumb, give it breath with your mouth, and it will\ndiscourse most eloquent music. Look you, these are the stops.\n\nGuil.\nBut these cannot I command to any utterance of harmony; I\nhave not the skill.\n\nHam.\nWhy, look you now, how unworthy a thing you make of me! You\nwould play upon me; you would seem to know my stops; you would\npluck out the heart of my mystery; you would sound me from my\nlowest note to the top of my compass; and there is much music,\nexcellent voice, in this little organ, yet cannot you make it\nspeak. 'Sblood, do you think I am easier to be played on than a\npipe? Call me what instrument you will, though you can fret me,\nyou cannot play upon me.\n\n[Enter Polonius.]\n\nGod bless you, sir!\n\nPol.\nMy lord, the queen would speak with you, and presently.\n\nHam.\nDo you see yonder cloud that's almost in shape of a camel?\n\nPol.\nBy the mass, and 'tis like a camel indeed.\n\nHam.\nMethinks it is like a weasel.\n\nPol.\nIt is backed like a weasel.\n\nHam.\nOr like a whale.\n\nPol.\nVery like a whale.\n\nHam.\nThen will I come to my mother by and by.--They fool me to the\ntop of my bent.--I will come by and by.\n\nPol.\nI will say so.\n\n[Exit.]\n\nHam.\nBy-and-by is easily said.\n\n[Exit Polonius.]\n\n--Leave me, friends.\n\n[Exeunt Ros, Guil., Hor., and Players.]\n\n'Tis now the very witching time of night,\nWhen churchyards yawn, and hell itself breathes out\nContagion to this world: now could I drink hot blood,\nAnd do such bitter business as the day\nWould quake to look on. Soft! now to my mother.--\nO heart, lose not thy nature; let not ever\nThe soul of Nero enter this firm bosom:\nLet me be cruel, not unnatural;\nI will speak daggers to her, but use none;\nMy tongue and soul in this be hypocrites,--\nHow in my words somever she be shent,\nTo give them seals never, my soul, consent!\n\n[Exit.]\n\n\n\nScene III. A room in the Castle.\n\n[Enter King, Rosencrantz, and Guildenstern.]\n\nKing.\nI like him not; nor stands it safe with us\nTo let his madness range. Therefore prepare you;\nI your commission will forthwith dispatch,\nAnd he to England shall along with you:\nThe terms of our estate may not endure\nHazard so near us as doth hourly grow\nOut of his lunacies.\n\nGuil.\nWe will ourselves provide:\nMost holy and religious fear it is\nTo keep those many many bodies safe\nThat live and feed upon your majesty.\n\nRos.\nThe single and peculiar life is bound,\nWith all the strength and armour of the mind,\nTo keep itself from 'noyance; but much more\nThat spirit upon whose weal depend and rest\nThe lives of many. The cease of majesty\nDies not alone; but like a gulf doth draw\nWhat's near it with it: it is a massy wheel,\nFix'd on the summit of the highest mount,\nTo whose huge spokes ten thousand lesser things\nAre mortis'd and adjoin'd; which, when it falls,\nEach small annexment, petty consequence,\nAttends the boisterous ruin. Never alone\nDid the king sigh, but with a general groan.\n\nKing.\nArm you, I pray you, to this speedy voyage;\nFor we will fetters put upon this fear,\nWhich now goes too free-footed.\n\nRos and Guil.\nWe will haste us.\n\n[Exeunt Ros. and Guil.]\n\n[Enter Polonius.]\n\nPol.\nMy lord, he's going to his mother's closet:\nBehind the arras I'll convey myself\nTo hear the process; I'll warrant she'll tax him home:\nAnd, as you said, and wisely was it said,\n'Tis meet that some more audience than a mother,\nSince nature makes them partial, should o'erhear\nThe speech, of vantage. Fare you well, my liege:\nI'll call upon you ere you go to bed,\nAnd tell you what I know.\n\nKing.\nThanks, dear my lord.\n\n[Exit Polonius.]\n\nO, my offence is rank, it smells to heaven;\nIt hath the primal eldest curse upon't,--\nA brother's murder!--Pray can I not,\nThough inclination be as sharp as will:\nMy stronger guilt defeats my strong intent;\nAnd, like a man to double business bound,\nI stand in pause where I shall first begin,\nAnd both neglect. What if this cursed hand\nWere thicker than itself with brother's blood,--\nIs there not rain enough in the sweet heavens\nTo wash it white as snow? Whereto serves mercy\nBut to confront the visage of offence?\nAnd what's in prayer but this twofold force,--\nTo be forestalled ere we come to fall,\nOr pardon'd being down? Then I'll look up;\nMy fault is past. But, O, what form of prayer\nCan serve my turn? Forgive me my foul murder!--\nThat cannot be; since I am still possess'd\nOf those effects for which I did the murder,--\nMy crown, mine own ambition, and my queen.\nMay one be pardon'd and retain the offence?\nIn the corrupted currents of this world\nOffence's gilded hand may shove by justice;\nAnd oft 'tis seen the wicked prize itself\nBuys out the law; but 'tis not so above;\nThere is no shuffling;--there the action lies\nIn his true nature; and we ourselves compell'd,\nEven to the teeth and forehead of our faults,\nTo give in evidence. What then? what rests?\nTry what repentance can: what can it not?\nYet what can it when one cannot repent?\nO wretched state! O bosom black as death!\nO limed soul, that, struggling to be free,\nArt more engag'd! Help, angels! Make assay:\nBow, stubborn knees; and, heart, with strings of steel,\nBe soft as sinews of the new-born babe!\nAll may be well.\n\n[Retires and kneels.]\n\n[Enter Hamlet.]\n\nHam.\nNow might I do it pat, now he is praying;\nAnd now I'll do't;--and so he goes to heaven;\nAnd so am I reveng'd.--that would be scann'd:\nA villain kills my father; and for that,\nI, his sole son, do this same villain send\nTo heaven.\nO, this is hire and salary, not revenge.\nHe took my father grossly, full of bread;\nWith all his crimes broad blown, as flush as May;\nAnd how his audit stands, who knows save heaven?\nBut in our circumstance and course of thought,\n'Tis heavy with him: and am I, then, reveng'd,\nTo take him in the purging of his soul,\nWhen he is fit and season'd for his passage?\nNo.\nUp, sword, and know thou a more horrid hent:\nWhen he is drunk asleep; or in his rage;\nOr in the incestuous pleasure of his bed;\nAt gaming, swearing; or about some act\nThat has no relish of salvation in't;--\nThen trip him, that his heels may kick at heaven;\nAnd that his soul may be as damn'd and black\nAs hell, whereto it goes. My mother stays:\nThis physic but prolongs thy sickly days.\n\n[Exit.]\n\n[The King rises and advances.]\n\nKing.\nMy words fly up, my thoughts remain below:\nWords without thoughts never to heaven go.\n\n[Exit.]\n\n\n\nScene IV. Another room in the castle.\n\n[Enter Queen and Polonius.]\n\nPol.\nHe will come straight. Look you lay home to him:\nTell him his pranks have been too broad to bear with,\nAnd that your grace hath screen'd and stood between\nMuch heat and him. I'll silence me e'en here.\nPray you, be round with him.\n\nHam.\n[Within.] Mother, mother, mother!\n\nQueen.\nI'll warrant you:\nFear me not:--withdraw; I hear him coming.\n\n[Polonius goes behind the arras.]\n\n[Enter Hamlet.]\n\nHam.\nNow, mother, what's the matter?\n\nQueen.\nHamlet, thou hast thy father much offended.\n\nHam.\nMother, you have my father much offended.\n\nQueen.\nCome, come, you answer with an idle tongue.\n\nHam.\nGo, go, you question with a wicked tongue.\n\nQueen.\nWhy, how now, Hamlet!\n\nHam.\nWhat's the matter now?\n\nQueen.\nHave you forgot me?\n\nHam.\nNo, by the rood, not so:\nYou are the Queen, your husband's brother's wife,\nAnd,--would it were not so!--you are my mother.\n\nQueen.\nNay, then, I'll set those to you that can speak.\n\nHam.\nCome, come, and sit you down; you shall not budge;\nYou go not till I set you up a glass\nWhere you may see the inmost part of you.\n\nQueen.\nWhat wilt thou do? thou wilt not murder me?--\nHelp, help, ho!\n\nPol.\n[Behind.] What, ho! help, help, help!\n\nHam.\nHow now? a rat? [Draws.]\nDead for a ducat, dead!\n\n[Makes a pass through the arras.]\n\nPol.\n[Behind.] O, I am slain!\n\n[Falls and dies.]\n\nQueen.\nO me, what hast thou done?\n\nHam.\nNay, I know not: is it the king?\n\n[Draws forth Polonius.]\n\nQueen.\nO, what a rash and bloody deed is this!\n\nHam.\nA bloody deed!--almost as bad, good mother,\nAs kill a king and marry with his brother.\n\nQueen.\nAs kill a king!\n\nHam.\nAy, lady, 'twas my word.--\nThou wretched, rash, intruding fool, farewell!\n[To Polonius.]\nI took thee for thy better: take thy fortune;\nThou find'st to be too busy is some danger.--\nLeave wringing of your hands: peace! sit you down,\nAnd let me wring your heart: for so I shall,\nIf it be made of penetrable stuff;\nIf damned custom have not braz'd it so\nThat it is proof and bulwark against sense.\n\nQueen.\nWhat have I done, that thou dar'st wag thy tongue\nIn noise so rude against me?\n\nHam.\nSuch an act\nThat blurs the grace and blush of modesty;\nCalls virtue hypocrite; takes off the rose\nFrom the fair forehead of an innocent love,\nAnd sets a blister there; makes marriage-vows\nAs false as dicers' oaths: O, such a deed\nAs from the body of contraction plucks\nThe very soul, and sweet religion makes\nA rhapsody of words: heaven's face doth glow;\nYea, this solidity and compound mass,\nWith tristful visage, as against the doom,\nIs thought-sick at the act.\n\nQueen.\nAh me, what act,\nThat roars so loud, and thunders in the index?\n\nHam.\nLook here upon this picture, and on this,--\nThe counterfeit presentment of two brothers.\nSee what a grace was seated on this brow;\nHyperion's curls; the front of Jove himself;\nAn eye like Mars, to threaten and command;\nA station like the herald Mercury\nNew lighted on a heaven-kissing hill:\nA combination and a form, indeed,\nWhere every god did seem to set his seal,\nTo give the world assurance of a man;\nThis was your husband.--Look you now what follows:\nHere is your husband, like a milldew'd ear\nBlasting his wholesome brother. Have you eyes?\nCould you on this fair mountain leave to feed,\nAnd batten on this moor? Ha! have you eyes?\nYou cannot call it love; for at your age\nThe hey-day in the blood is tame, it's humble,\nAnd waits upon the judgment: and what judgment\nWould step from this to this? Sense, sure, you have,\nElse could you not have motion: but sure that sense\nIs apoplex'd; for madness would not err;\nNor sense to ecstacy was ne'er so thrall'd\nBut it reserv'd some quantity of choice\nTo serve in such a difference. What devil was't\nThat thus hath cozen'd you at hoodman-blind?\nEyes without feeling, feeling without sight,\nEars without hands or eyes, smelling sans all,\nOr but a sickly part of one true sense\nCould not so mope.\nO shame! where is thy blush? Rebellious hell,\nIf thou canst mutine in a matron's bones,\nTo flaming youth let virtue be as wax,\nAnd melt in her own fire: proclaim no shame\nWhen the compulsive ardour gives the charge,\nSince frost itself as actively doth burn,\nAnd reason panders will.\n\nQueen.\nO Hamlet, speak no more:\nThou turn'st mine eyes into my very soul;\nAnd there I see such black and grained spots\nAs will not leave their tinct.\n\nHam.\nNay, but to live\nIn the rank sweat of an enseamed bed,\nStew'd in corruption, honeying and making love\nOver the nasty sty,--\n\nQueen.\nO, speak to me no more;\nThese words like daggers enter in mine ears;\nNo more, sweet Hamlet.\n\nHam.\nA murderer and a villain;\nA slave that is not twentieth part the tithe\nOf your precedent lord; a vice of kings;\nA cutpurse of the empire and the rule,\nThat from a shelf the precious diadem stole\nAnd put it in his pocket!\n\nQueen.\nNo more.\n\nHam.\nA king of shreds and patches!--\n\n[Enter Ghost.]\n\nSave me and hover o'er me with your wings,\nYou heavenly guards!--What would your gracious figure?\n\nQueen.\nAlas, he's mad!\n\nHam.\nDo you not come your tardy son to chide,\nThat, laps'd in time and passion, lets go by\nThe important acting of your dread command?\nO, say!\n\nGhost.\nDo not forget. This visitation\nIs but to whet thy almost blunted purpose.\nBut, look, amazement on thy mother sits:\nO, step between her and her fighting soul,--\nConceit in weakest bodies strongest works,--\nSpeak to her, Hamlet.\n\nHam.\nHow is it with you, lady?\n\nQueen.\nAlas, how is't with you,\nThat you do bend your eye on vacancy,\nAnd with the incorporal air do hold discourse?\nForth at your eyes your spirits wildly peep;\nAnd, as the sleeping soldiers in the alarm,\nYour bedded hairs, like life in excrements,\nStart up and stand an end. O gentle son,\nUpon the heat and flame of thy distemper\nSprinkle cool patience! Whereon do you look?\n\nHam.\nOn him, on him! Look you how pale he glares!\nHis form and cause conjoin'd, preaching to stones,\nWould make them capable.--Do not look upon me;\nLest with this piteous action you convert\nMy stern effects: then what I have to do\nWill want true colour; tears perchance for blood.\n\nQueen.\nTo whom do you speak this?\n\nHam.\nDo you see nothing there?\n\nQueen.\nNothing at all; yet all that is I see.\n\nHam.\nNor did you nothing hear?\n\nQueen.\nNo, nothing but ourselves.\n\nHam.\nWhy, look you there! look how it steals away!\nMy father, in his habit as he liv'd!\nLook, where he goes, even now out at the portal!\n\n[Exit Ghost.]\n\nQueen.\nThis is the very coinage of your brain:\nThis bodiless creation ecstasy\nIs very cunning in.\n\nHam.\nEcstasy!\nMy pulse, as yours, doth temperately keep time,\nAnd makes as healthful music: it is not madness\nThat I have utter'd: bring me to the test,\nAnd I the matter will re-word; which madness\nWould gambol from. Mother, for love of grace,\nLay not that flattering unction to your soul\nThat not your trespass, but my madness speaks:\nIt will but skin and film the ulcerous place,\nWhilst rank corruption, mining all within,\nInfects unseen. Confess yourself to heaven;\nRepent what's past; avoid what is to come;\nAnd do not spread the compost on the weeds,\nTo make them ranker. Forgive me this my virtue;\nFor in the fatness of these pursy times\nVirtue itself of vice must pardon beg,\nYea, curb and woo for leave to do him good.\n\nQueen.\nO Hamlet, thou hast cleft my heart in twain.\n\nHam.\nO, throw away the worser part of it,\nAnd live the purer with the other half.\nGood night: but go not to mine uncle's bed;\nAssume a virtue, if you have it not.\nThat monster custom, who all sense doth eat,\nOf habits evil, is angel yet in this,--\nThat to the use of actions fair and good\nHe likewise gives a frock or livery\nThat aptly is put on. Refrain to-night;\nAnd that shall lend a kind of easiness\nTo the next abstinence: the next more easy;\nFor use almost can change the stamp of nature,\nAnd either curb the devil, or throw him out\nWith wondrous potency. Once more, good-night:\nAnd when you are desirous to be bles'd,\nI'll blessing beg of you.--For this same lord\n[Pointing to Polonius.]\nI do repent; but heaven hath pleas'd it so,\nTo punish me with this, and this with me,\nThat I must be their scourge and minister.\nI will bestow him, and will answer well\nThe death I gave him. So again, good-night.--\nI must be cruel, only to be kind:\nThus bad begins, and worse remains behind.--\nOne word more, good lady.\n\nQueen.\nWhat shall I do?\n\nHam.\nNot this, by no means, that I bid you do:\nLet the bloat king tempt you again to bed;\nPinch wanton on your cheek; call you his mouse;\nAnd let him, for a pair of reechy kisses,\nOr paddling in your neck with his damn'd fingers,\nMake you to ravel all this matter out,\nThat I essentially am not in madness,\nBut mad in craft. 'Twere good you let him know;\nFor who that's but a queen, fair, sober, wise,\nWould from a paddock, from a bat, a gib,\nSuch dear concernings hide? who would do so?\nNo, in despite of sense and secrecy,\nUnpeg the basket on the house's top,\nLet the birds fly, and, like the famous ape,\nTo try conclusions, in the basket creep\nAnd break your own neck down.\n\nQueen.\nBe thou assur'd, if words be made of breath,\nAnd breath of life, I have no life to breathe\nWhat thou hast said to me.\n\nHam.\nI must to England; you know that?\n\nQueen.\nAlack,\nI had forgot: 'tis so concluded on.\n\nHam.\nThere's letters seal'd: and my two schoolfellows,--\nWhom I will trust as I will adders fang'd,--\nThey bear the mandate; they must sweep my way\nAnd marshal me to knavery. Let it work;\nFor 'tis the sport to have the enginer\nHoist with his own petard: and 't shall go hard\nBut I will delve one yard below their mines\nAnd blow them at the moon: O, 'tis most sweet,\nWhen in one line two crafts directly meet.--\nThis man shall set me packing:\nI'll lug the guts into the neighbour room.--\nMother, good-night.--Indeed, this counsellor\nIs now most still, most secret, and most grave,\nWho was in life a foolish peating knave.\nCome, sir, to draw toward an end with you:--\nGood night, mother.\n\n[Exeunt severally; Hamlet, dragging out Polonius.]\n\n\n\nACT IV.\n\nScene I. A room in the Castle.\n\n[Enter King, Queen, Rosencrantz and Guildenstern.]\n\nKing.\nThere's matter in these sighs. These profound heaves\nYou must translate: 'tis fit we understand them.\nWhere is your son?\n\nQueen.\nBestow this place on us a little while.\n\n[To Rosencrantz and Guildenstern, who go out.]\n\nAh, my good lord, what have I seen to-night!\n\nKing.\nWhat, Gertrude? How does Hamlet?\n\nQueen.\nMad as the sea and wind, when both contend\nWhich is the mightier: in his lawless fit\nBehind the arras hearing something stir,\nWhips out his rapier, cries 'A rat, a rat!'\nAnd in this brainish apprehension, kills\nThe unseen good old man.\n\nKing.\nO heavy deed!\nIt had been so with us, had we been there:\nHis liberty is full of threats to all;\nTo you yourself, to us, to every one.\nAlas, how shall this bloody deed be answer'd?\nIt will be laid to us, whose providence\nShould have kept short, restrain'd, and out of haunt\nThis mad young man. But so much was our love\nWe would not understand what was most fit;\nBut, like the owner of a foul disease,\nTo keep it from divulging, let it feed\nEven on the pith of life. Where is he gone?\n\nQueen.\nTo draw apart the body he hath kill'd:\nO'er whom his very madness, like some ore\nAmong a mineral of metals base,\nShows itself pure: he weeps for what is done.\n\nKing.\nO Gertrude, come away!\nThe sun no sooner shall the mountains touch\nBut we will ship him hence: and this vile deed\nWe must with all our majesty and skill\nBoth countenance and excuse.--Ho, Guildenstern!\n\n[Re-enter Rosencrantz and Guildenstern.]\n\nFriends both, go join you with some further aid:\nHamlet in madness hath Polonius slain,\nAnd from his mother's closet hath he dragg'd him:\nGo seek him out; speak fair, and bring the body\nInto the chapel. I pray you, haste in this.\n\n[Exeunt Rosencrantz and Guildenstern.]\n\nCome, Gertrude, we'll call up our wisest friends;\nAnd let them know both what we mean to do\nAnd what's untimely done: so haply slander,--\nWhose whisper o'er the world's diameter,\nAs level as the cannon to his blank,\nTransports his poison'd shot,--may miss our name,\nAnd hit the woundless air.--O, come away!\nMy soul is full of discord and dismay.\n\n[Exeunt.]\n\nScene II. Another room in the Castle.\n\n[Enter Hamlet.]\n\nHam.\nSafely stowed.\n\nRos. and Guil.\n[Within.] Hamlet! Lord Hamlet!\n\nHam.\nWhat noise? who calls on Hamlet? O, here they come.\n\n[Enter Rosencrantz and Guildenstern.]\n\nRos.\nWhat have you done, my lord, with the dead body?\n\nHam.\nCompounded it with dust, whereto 'tis kin.\n\nRos.\nTell us where 'tis, that we may take it thence,\nAnd bear it to the chapel.\n\nHam.\nDo not believe it.\n\nRos.\nBelieve what?\n\nHam.\nThat I can keep your counsel, and not mine own. Besides, to be\ndemanded of a sponge!--what replication should be made by the son\nof a king?\n\nRos.\nTake you me for a sponge, my lord?\n\nHam.\nAy, sir; that soaks up the King's countenance, his rewards,\nhis authorities. But such officers do the king best service in\nthe end: he keeps them, like an ape, in the corner of his jaw;\nfirst mouthed, to be last swallowed: when he needs what you have\ngleaned, it is but squeezing you, and, sponge, you shall be dry\nagain.\n\nRos.\nI understand you not, my lord.\n\nHam.\nI am glad of it: a knavish speech sleeps in a foolish ear.\n\nRos.\nMy lord, you must tell us where the body is and go with us to\nthe king.\n\nHam.\nThe body is with the king, but the king is not with the body.\nThe king is a thing,--\n\nGuil.\nA thing, my lord!\n\nHam.\nOf nothing: bring me to him. Hide fox, and all after.\n\n[Exeunt.]\n\n\n\nScene III. Another room in the Castle.\n\n[Enter King,attended.]\n\nKing.\nI have sent to seek him and to find the body.\nHow dangerous is it that this man goes loose!\nYet must not we put the strong law on him:\nHe's lov'd of the distracted multitude,\nWho like not in their judgment, but their eyes;\nAnd where 'tis so, the offender's scourge is weigh'd,\nBut never the offence. To bear all smooth and even,\nThis sudden sending him away must seem\nDeliberate pause: diseases desperate grown\nBy desperate appliance are reliev'd,\nOr not at all.\n\n[Enter Rosencrantz.]\n\nHow now! what hath befall'n?\n\nRos.\nWhere the dead body is bestow'd, my lord,\nWe cannot get from him.\n\nKing.\nBut where is he?\n\nRos.\nWithout, my lord; guarded, to know your pleasure.\n\nKing.\nBring him before us.\n\nRos.\nHo, Guildenstern! bring in my lord.\n\n[Enter Hamlet and Guildenstern.]\n\nKing.\nNow, Hamlet, where's Polonius?\n\nHam.\nAt supper.\n\nKing.\nAt supper! where?\n\nHam.\nNot where he eats, but where he is eaten: a certain\nconvocation of politic worms are e'en at him. Your worm is your\nonly emperor for diet: we fat all creatures else to fat us, and\nwe fat ourselves for maggots: your fat king and your lean beggar\nis but variable service,--two dishes, but to one table: that's\nthe end.\n\nKing.\nAlas, alas!\n\nHam.\nA man may fish with the worm that hath eat of a king, and eat\nof the fish that hath fed of that worm.\n\nKing.\nWhat dost thou mean by this?\n\nHam.\nNothing but to show you how a king may go a progress through\nthe guts of a beggar.\n\nKing.\nWhere is Polonius?\n\nHam.\nIn heaven: send thither to see: if your messenger find him not\nthere, seek him i' the other place yourself. But, indeed, if you\nfind him not within this month, you shall nose him as you go up\nthe stairs into the lobby.\n\nKing.\nGo seek him there. [To some Attendants.]\n\nHam.\nHe will stay till you come.\n\n[Exeunt Attendants.]\n\nKing.\nHamlet, this deed, for thine especial safety,--\nWhich we do tender, as we dearly grieve\nFor that which thou hast done,--must send thee hence\nWith fiery quickness: therefore prepare thyself;\nThe bark is ready, and the wind at help,\nThe associates tend, and everything is bent\nFor England.\n\nHam.\nFor England!\n\nKing.\nAy, Hamlet.\n\nHam.\nGood.\n\nKing.\nSo is it, if thou knew'st our purposes.\n\nHam.\nI see a cherub that sees them.--But, come; for England!--\nFarewell, dear mother.\n\nKing.\nThy loving father, Hamlet.\n\nHam.\nMy mother: father and mother is man and wife; man and wife is\none flesh; and so, my mother.--Come, for England!\n\n[Exit.]\n\nKing.\nFollow him at foot; tempt him with speed aboard;\nDelay it not; I'll have him hence to-night:\nAway! for everything is seal'd and done\nThat else leans on the affair: pray you, make haste.\n\n[Exeunt Rosencrantz and Guildenstern.]\n\nAnd, England, if my love thou hold'st at aught,--\nAs my great power thereof may give thee sense,\nSince yet thy cicatrice looks raw and red\nAfter the Danish sword, and thy free awe\nPays homage to us,--thou mayst not coldly set\nOur sovereign process; which imports at full,\nBy letters conjuring to that effect,\nThe present death of Hamlet. Do it, England;\nFor like the hectic in my blood he rages,\nAnd thou must cure me: till I know 'tis done,\nHowe'er my haps, my joys were ne'er begun.\n\n[Exit.]\n\n\n\nScene IV. A plain in Denmark.\n\n[Enter Fortinbras, and Forces marching.]\n\nFor.\nGo, Captain, from me greet the Danish king:\nTell him that, by his license, Fortinbras\nCraves the conveyance of a promis'd march\nOver his kingdom. You know the rendezvous.\nIf that his majesty would aught with us,\nWe shall express our duty in his eye;\nAnd let him know so.\n\nCapt.\nI will do't, my lord.\n\nFor.\nGo softly on.\n\n[Exeunt all For. and Forces.]\n\n[Enter Hamlet, Rosencrantz, Guildenstern, &c.]\n\nHam.\nGood sir, whose powers are these?\n\nCapt.\nThey are of Norway, sir.\n\nHam.\nHow purpos'd, sir, I pray you?\n\nCapt.\nAgainst some part of Poland.\n\nHam.\nWho commands them, sir?\n\nCapt.\nThe nephew to old Norway, Fortinbras.\n\nHam.\nGoes it against the main of Poland, sir,\nOr for some frontier?\n\nCapt.\nTruly to speak, and with no addition,\nWe go to gain a little patch of ground\nThat hath in it no profit but the name.\nTo pay five ducats, five, I would not farm it;\nNor will it yield to Norway or the Pole\nA ranker rate, should it be sold in fee.\n\nHam.\nWhy, then the Polack never will defend it.\n\nCapt.\nYes, it is already garrison'd.\n\nHam.\nTwo thousand souls and twenty thousand ducats\nWill not debate the question of this straw:\nThis is the imposthume of much wealth and peace,\nThat inward breaks, and shows no cause without\nWhy the man dies.--I humbly thank you, sir.\n\nCapt.\nGod b' wi' you, sir.\n\n[Exit.]\n\nRos.\nWill't please you go, my lord?\n\nHam.\nI'll be with you straight. Go a little before.\n\n[Exeunt all but Hamlet.]\n\nHow all occasions do inform against me\nAnd spur my dull revenge! What is a man,\nIf his chief good and market of his time\nBe but to sleep and feed? a beast, no more.\nSure he that made us with such large discourse,\nLooking before and after, gave us not\nThat capability and godlike reason\nTo fust in us unus'd. Now, whether it be\nBestial oblivion, or some craven scruple\nOf thinking too precisely on the event,--\nA thought which, quarter'd, hath but one part wisdom\nAnd ever three parts coward,--I do not know\nWhy yet I live to say 'This thing's to do;'\nSith I have cause, and will, and strength, and means\nTo do't. Examples, gross as earth, exhort me:\nWitness this army, of such mass and charge,\nLed by a delicate and tender prince;\nWhose spirit, with divine ambition puff'd,\nMakes mouths at the invisible event;\nExposing what is mortal and unsure\nTo all that fortune, death, and danger dare,\nEven for an egg-shell. Rightly to be great\nIs not to stir without great argument,\nBut greatly to find quarrel in a straw\nWhen honour's at the stake. How stand I, then,\nThat have a father kill'd, a mother stain'd,\nExcitements of my reason and my blood,\nAnd let all sleep? while, to my shame, I see\nThe imminent death of twenty thousand men\nThat, for a fantasy and trick of fame,\nGo to their graves like beds; fight for a plot\nWhereon the numbers cannot try the cause,\nWhich is not tomb enough and continent\nTo hide the slain?--O, from this time forth,\nMy thoughts be bloody, or be nothing worth!\n\n[Exit.]\n\n\n\nScene V. Elsinore. A room in the Castle.\n\n[Enter Queen and Horatio.]\n\nQueen.\nI will not speak with her.\n\nGent.\nShe is importunate; indeed distract:\nHer mood will needs be pitied.\n\nQueen.\nWhat would she have?\n\nGent.\nShe speaks much of her father; says she hears\nThere's tricks i' the world, and hems, and beats her heart;\nSpurns enviously at straws; speaks things in doubt,\nThat carry but half sense: her speech is nothing,\nYet the unshaped use of it doth move\nThe hearers to collection; they aim at it,\nAnd botch the words up fit to their own thoughts;\nWhich, as her winks, and nods, and gestures yield them,\nIndeed would make one think there might be thought,\nThough nothing sure, yet much unhappily.\n'Twere good she were spoken with; for she may strew\nDangerous conjectures in ill-breeding minds.\n\nQueen.\nLet her come in.\n\n[Exit Horatio.]\n\nTo my sick soul, as sin's true nature is,\nEach toy seems Prologue to some great amiss:\nSo full of artless jealousy is guilt,\nIt spills itself in fearing to be spilt.\n\n[Re-enter Horatio with Ophelia.]\n\nOph.\nWhere is the beauteous majesty of Denmark?\n\nQueen.\nHow now, Ophelia?\n\nOph. [Sings.]\n   How should I your true love know\n     From another one?\n   By his cockle bat and' staff\n     And his sandal shoon.\n\nQueen.\nAlas, sweet lady, what imports this song?\n\nOph.\nSay you? nay, pray you, mark.\n[Sings.]\n   He is dead and gone, lady,\n     He is dead and gone;\n   At his head a grass green turf,\n     At his heels a stone.\n\nQueen.\nNay, but Ophelia--\n\nOph.\nPray you, mark.\n[Sings.]\n   White his shroud as the mountain snow,\n\n[Enter King.]\n\nQueen.\nAlas, look here, my lord!\n\nOph.\n[Sings.]\n     Larded all with sweet flowers;\n   Which bewept to the grave did go\n     With true-love showers.\n\nKing.\nHow do you, pretty lady?\n\nOph.\nWell, God dild you! They say the owl was a baker's daughter.\nLord, we know what we are, but know not what we may be. God be at\nyour table!\n\nKing.\nConceit upon her father.\n\nOph.\nPray you, let's have no words of this; but when they ask you what\nit means, say you this:\n[Sings.]\n   To-morrow is Saint Valentine's day\n     All in the morning bedtime,\n   And I a maid at your window,\n     To be your Valentine.\n\n   Then up he rose and donn'd his clothes,\n     And dupp'd the chamber door,\n   Let in the maid, that out a maid\n     Never departed more.\n\nKing.\nPretty Ophelia!\n\nOph.\nIndeed, la, without an oath, I'll make an end on't:\n[Sings.]\n   By Gis and by Saint Charity,\n     Alack, and fie for shame!\n   Young men will do't if they come to't;\n     By cock, they are to blame.\n\n   Quoth she, before you tumbled me,\n     You promis'd me to wed.\n   So would I ha' done, by yonder sun,\n     An thou hadst not come to my bed.\n\nKing.\nHow long hath she been thus?\n\nOph.\nI hope all will be well. We must be patient: but I cannot\nchoose but weep, to think they would lay him i' the cold ground.\nMy brother shall know of it: and so I thank you for your good\ncounsel.--Come, my coach!--Good night, ladies; good night, sweet\nladies; good night, good night.\n\n[Exit.]\n\nKing.\nFollow her close; give her good watch, I pray you.\n\n[Exit Horatio.]\n\nO, this is the poison of deep grief; it springs\nAll from her father's death. O Gertrude, Gertrude,\nWhen sorrows come, they come not single spies,\nBut in battalions! First, her father slain:\nNext, your son gone; and he most violent author\nOf his own just remove: the people muddied,\nThick and and unwholesome in their thoughts and whispers\nFor good Polonius' death; and we have done but greenly\nIn hugger-mugger to inter him: poor Ophelia\nDivided from herself and her fair judgment,\nWithout the which we are pictures or mere beasts:\nLast, and as much containing as all these,\nHer brother is in secret come from France;\nFeeds on his wonder, keeps himself in clouds,\nAnd wants not buzzers to infect his ear\nWith pestilent speeches of his father's death;\nWherein necessity, of matter beggar'd,\nWill nothing stick our person to arraign\nIn ear and ear. O my dear Gertrude, this,\nLike to a murdering piece, in many places\nGive, me superfluous death.\n\n[A noise within.]\n\nQueen.\nAlack, what noise is this?\n\nKing.\nWhere are my Switzers? let them guard the door.\n\n[Enter a Gentleman.]\n\nWhat is the matter?\n\nGent.\nSave yourself, my lord:\nThe ocean, overpeering of his list,\nEats not the flats with more impetuous haste\nThan young Laertes, in a riotous head,\nO'erbears your offices. The rabble call him lord;\nAnd, as the world were now but to begin,\nAntiquity forgot, custom not known,\nThe ratifiers and props of every word,\nThey cry 'Choose we! Laertes shall be king!'\nCaps, hands, and tongues applaud it to the clouds,\n'Laertes shall be king! Laertes king!'\n\nQueen.\nHow cheerfully on the false trail they cry!\nO, this is counter, you false Danish dogs!\n\n[A noise within.]\n\nKing.\nThe doors are broke.\n\n[Enter Laertes, armed; Danes following.]\n\nLaer.\nWhere is this king?--Sirs, stand you all without.\n\nDanes.\nNo, let's come in.\n\nLaer.\nI pray you, give me leave.\n\nDanes.\nWe will, we will.\n\n[They retire without the door.]\n\nLaer.\nI thank you:--keep the door.--O thou vile king,\nGive me my father!\n\nQueen.\nCalmly, good Laertes.\n\nLaer.\nThat drop of blood that's calm proclaims me bastard;\nCries cuckold to my father; brands the harlot\nEven here, between the chaste unsmirched brow\nOf my true mother.\n\nKing.\nWhat is the cause, Laertes,\nThat thy rebellion looks so giant-like?--\nLet him go, Gertrude; do not fear our person:\nThere's such divinity doth hedge a king,\nThat treason can but peep to what it would,\nActs little of his will.--Tell me, Laertes,\nWhy thou art thus incens'd.--Let him go, Gertrude:--\nSpeak, man.\n\nLaer.\nWhere is my father?\n\nKing.\nDead.\n\nQueen.\nBut not by him.\n\nKing.\nLet him demand his fill.\n\nLaer.\nHow came he dead? I'll not be juggled with:\nTo hell, allegiance! vows, to the blackest devil!\nConscience and grace, to the profoundest pit!\nI dare damnation:--to this point I stand,--\nThat both the worlds, I give to negligence,\nLet come what comes; only I'll be reveng'd\nMost throughly for my father.\n\nKing.\nWho shall stay you?\n\nLaer.\nMy will, not all the world:\nAnd for my means, I'll husband them so well,\nThey shall go far with little.\n\nKing.\nGood Laertes,\nIf you desire to know the certainty\nOf your dear father's death, is't writ in your revenge\nThat, sweepstake, you will draw both friend and foe,\nWinner and loser?\n\nLaer.\nNone but his enemies.\n\nKing.\nWill you know them then?\n\nLaer.\nTo his good friends thus wide I'll ope my arms;\nAnd, like the kind life-rendering pelican,\nRepast them with my blood.\n\nKing.\nWhy, now you speak\nLike a good child and a true gentleman.\nThat I am guiltless of your father's death,\nAnd am most sensibly in grief for it,\nIt shall as level to your judgment pierce\nAs day does to your eye.\n\nDanes.\n[Within] Let her come in.\n\nLaer.\nHow now! What noise is that?\n\n[Re-enter Ophelia, fantastically dressed with straws and\nflowers.]\n\nO heat, dry up my brains! tears seven times salt,\nBurn out the sense and virtue of mine eye!--\nBy heaven, thy madness shall be paid by weight,\nTill our scale turn the beam. O rose of May!\nDear maid, kind sister, sweet Ophelia!--\nO heavens! is't possible a young maid's wits\nShould be as mortal as an old man's life?\nNature is fine in love; and where 'tis fine,\nIt sends some precious instance of itself\nAfter the thing it loves.\n\nOph.\n[Sings.]\n   They bore him barefac'd on the bier\n   Hey no nonny, nonny, hey nonny\n   And on his grave rain'd many a tear.--\n\nFare you well, my dove!\n\nLaer.\nHadst thou thy wits, and didst persuade revenge,\nIt could not move thus.\n\nOph.\nYou must sing 'Down a-down, an you call him a-down-a.' O,\nhow the wheel becomes it! It is the false steward, that stole his\nmaster's daughter.\n\nLaer.\nThis nothing's more than matter.\n\nOph.\nThere's rosemary, that's for remembrance; pray, love,\nremember: and there is pansies, that's for thoughts.\n\nLaer.\nA document in madness,--thoughts and remembrance fitted.\n\nOph.\nThere's fennel for you, and columbines:--there's rue for you;\nand here's some for me:--we may call it herb of grace o'\nSundays:--O, you must wear your rue with a difference.--There's a\ndaisy:--I would give you some violets, but they wither'd all when\nmy father died:--they say he made a good end,--\n[Sings.]\n   For bonny sweet Robin is all my joy,--\n\nLaer.\nThought and affliction, passion, hell itself,\nShe turns to favour and to prettiness.\n\nOph.\n[Sings.]\n   And will he not come again?\n   And will he not come again?\n     No, no, he is dead,\n     Go to thy death-bed,\n   He never will come again.\n\n   His beard was as white as snow,\n   All flaxen was his poll:\n     He is gone, he is gone,\n     And we cast away moan:\n   God ha' mercy on his soul!\n\nAnd of all Christian souls, I pray God.--God b' wi' ye.\n\n[Exit.]\n\nLaer.\nDo you see this, O God?\n\nKing.\nLaertes, I must commune with your grief,\nOr you deny me right. Go but apart,\nMake choice of whom your wisest friends you will,\nAnd they shall hear and judge 'twixt you and me.\nIf by direct or by collateral hand\nThey find us touch'd, we will our kingdom give,\nOur crown, our life, and all that we call ours,\nTo you in satisfaction; but if not,\nBe you content to lend your patience to us,\nAnd we shall jointly labour with your soul\nTo give it due content.\n\nLaer.\nLet this be so;\nHis means of death, his obscure burial,--\nNo trophy, sword, nor hatchment o'er his bones,\nNo noble rite nor formal ostentation,--\nCry to be heard, as 'twere from heaven to earth,\nThat I must call't in question.\n\nKing.\nSo you shall;\nAnd where the offence is let the great axe fall.\nI pray you go with me.\n\n[Exeunt.]\n\n\n\nScene VI. Another room in the Castle.\n\n[Enter Horatio and a Servant.]\n\nHor.\nWhat are they that would speak with me?\n\nServant.\nSailors, sir: they say they have letters for you.\n\nHor.\nLet them come in.\n\n[Exit Servant.]\n\nI do not know from what part of the world\nI should be greeted, if not from Lord Hamlet.\n\n[Enter Sailors.]\n\nI Sailor.\nGod bless you, sir.\n\nHor.\nLet him bless thee too.\n\nSailor.\nHe shall, sir, an't please him. There's a letter for you,\nsir,--it comes from the ambassador that was bound for England; if\nyour name be Horatio, as I am let to know it is.\n\nHor.\n[Reads.] 'Horatio, when thou shalt have overlooked\nthis, give these fellows some means to the king: they have\nletters for him. Ere we were two days old at sea, a pirate of\nvery warlike appointment gave us chase. Finding ourselves too\nslow of sail, we put on a compelled valour, and in the grapple I\nboarded them: on the instant they got clear of our ship; so I\nalone became their prisoner. They have dealt with me like thieves\nof mercy: but they knew what they did; I am to do a good turn for\nthem. Let the king have the letters I have sent; and repair thou\nto me with as much haste as thou wouldst fly death. I have words\nto speak in thine ear will make thee dumb; yet are they much too\nlight for the bore of the matter. These good fellows will bring\nthee where I am. Rosencrantz and Guildenstern hold their course\nfor England: of them I have much to tell thee. Farewell.\nHe that thou knowest thine,       HAMLET.'\n\nCome, I will give you way for these your letters;\nAnd do't the speedier, that you may direct me\nTo him from whom you brought them.\n\n[Exeunt.]\n\n\n\nScene VII. Another room in the Castle.\n\n[Enter King and Laertes.]\n\nKing.\nNow must your conscience my acquittance seal,\nAnd you must put me in your heart for friend,\nSith you have heard, and with a knowing ear,\nThat he which hath your noble father slain\nPursu'd my life.\n\nLaer.\nIt well appears:--but tell me\nWhy you proceeded not against these feats,\nSo crimeful and so capital in nature,\nAs by your safety, wisdom, all things else,\nYou mainly were stirr'd up.\n\nKing.\nO, for two special reasons;\nWhich may to you, perhaps, seem much unsinew'd,\nBut yet to me they are strong. The queen his mother\nLives almost by his looks; and for myself,--\nMy virtue or my plague, be it either which,--\nShe's so conjunctive to my life and soul,\nThat, as the star moves not but in his sphere,\nI could not but by her. The other motive,\nWhy to a public count I might not go,\nIs the great love the general gender bear him;\nWho, dipping all his faults in their affection,\nWould, like the spring that turneth wood to stone,\nConvert his gyves to graces; so that my arrows,\nToo slightly timber'd for so loud a wind,\nWould have reverted to my bow again,\nAnd not where I had aim'd them.\n\nLaer.\nAnd so have I a noble father lost;\nA sister driven into desperate terms,--\nWhose worth, if praises may go back again,\nStood challenger on mount of all the age\nFor her perfections:--but my revenge will come.\n\nKing.\nBreak not your sleeps for that:--you must not think\nThat we are made of stuff so flat and dull\nThat we can let our beard be shook with danger,\nAnd think it pastime. You shortly shall hear more:\nI lov'd your father, and we love ourself;\nAnd that, I hope, will teach you to imagine,--\n\n[Enter a Messenger.]\n\nHow now! What news?\n\nMess.\nLetters, my lord, from Hamlet:\nThis to your majesty; this to the queen.\n\nKing.\nFrom Hamlet! Who brought them?\n\nMess.\nSailors, my lord, they say; I saw them not:\nThey were given me by Claudio:--he receiv'd them\nOf him that brought them.\n\nKing.\nLaertes, you shall hear them.\nLeave us.\n\n[Exit Messenger.]\n\n[Reads]'High and mighty,--You shall know I am set naked on your\nkingdom. To-morrow shall I beg leave to see your kingly eyes:\nwhen I shall, first asking your pardon thereunto, recount the\noccasions of my sudden and more strange return.       HAMLET.'\n\nWhat should this mean? Are all the rest come back?\nOr is it some abuse, and no such thing?\n\nLaer.\nKnow you the hand?\n\nKing.\n'Tis Hamlet's character:--'Naked!'--\nAnd in a postscript here, he says 'alone.'\nCan you advise me?\n\nLaer.\nI am lost in it, my lord. But let him come;\nIt warms the very sickness in my heart\nThat I shall live and tell him to his teeth,\n'Thus didest thou.'\n\nKing.\nIf it be so, Laertes,--\nAs how should it be so? how otherwise?--\nWill you be rul'd by me?\n\nLaer.\nAy, my lord;\nSo you will not o'errule me to a peace.\n\nKing.\nTo thine own peace. If he be now return'd--\nAs checking at his voyage, and that he means\nNo more to undertake it,--I will work him\nTo exploit, now ripe in my device,\nUnder the which he shall not choose but fall:\nAnd for his death no wind shall breathe;\nBut even his mother shall uncharge the practice\nAnd call it accident.\n\nLaer.\nMy lord, I will be rul'd;\nThe rather if you could devise it so\nThat I might be the organ.\n\nKing.\nIt falls right.\nYou have been talk'd of since your travel much,\nAnd that in Hamlet's hearing, for a quality\nWherein they say you shine: your sum of parts\nDid not together pluck such envy from him\nAs did that one; and that, in my regard,\nOf the unworthiest siege.\n\nLaer.\nWhat part is that, my lord?\n\nKing.\nA very riband in the cap of youth,\nYet needful too; for youth no less becomes\nThe light and careless livery that it wears\nThan settled age his sables and his weeds,\nImporting health and graveness.--Two months since,\nHere was a gentleman of Normandy,--\nI've seen myself, and serv'd against, the French,\nAnd they can well on horseback: but this gallant\nHad witchcraft in't: he grew unto his seat;\nAnd to such wondrous doing brought his horse,\nAs had he been incorps'd and demi-natur'd\nWith the brave beast: so far he topp'd my thought\nThat I, in forgery of shapes and tricks,\nCome short of what he did.\n\nLaer.\nA Norman was't?\n\nKing.\nA Norman.\n\nLaer.\nUpon my life, Lamond.\n\nKing.\nThe very same.\n\nLaer.\nI know him well: he is the brooch indeed\nAnd gem of all the nation.\n\nKing.\nHe made confession of you;\nAnd gave you such a masterly report\nFor art and exercise in your defence,\nAnd for your rapier most especially,\nThat he cried out, 'twould be a sight indeed\nIf one could match you: the scrimers of their nation\nHe swore, had neither motion, guard, nor eye,\nIf you oppos'd them. Sir, this report of his\nDid Hamlet so envenom with his envy\nThat he could nothing do but wish and beg\nYour sudden coming o'er, to play with him.\nNow, out of this,--\n\nLaer.\nWhat out of this, my lord?\n\nKing.\nLaertes, was your father dear to you?\nOr are you like the painting of a sorrow,\nA face without a heart?\n\nLaer.\nWhy ask you this?\n\nKing.\nNot that I think you did not love your father;\nBut that I know love is begun by time,\nAnd that I see, in passages of proof,\nTime qualifies the spark and fire of it.\nThere lives within the very flame of love\nA kind of wick or snuff that will abate it;\nAnd nothing is at a like goodness still;\nFor goodness, growing to a plurisy,\nDies in his own too much: that we would do,\nWe should do when we would; for this 'would' changes,\nAnd hath abatements and delays as many\nAs there are tongues, are hands, are accidents;\nAnd then this 'should' is like a spendthrift sigh,\nThat hurts by easing. But to the quick o' the ulcer:--\nHamlet comes back: what would you undertake\nTo show yourself your father's son in deed\nMore than in words?\n\nLaer.\nTo cut his throat i' the church.\n\nKing.\nNo place, indeed, should murder sanctuarize;\nRevenge should have no bounds. But, good Laertes,\nWill you do this, keep close within your chamber.\nHamlet return'd shall know you are come home:\nWe'll put on those shall praise your excellence\nAnd set a double varnish on the fame\nThe Frenchman gave you; bring you in fine together\nAnd wager on your heads: he, being remiss,\nMost generous, and free from all contriving,\nWill not peruse the foils; so that with ease,\nOr with a little shuffling, you may choose\nA sword unbated, and, in a pass of practice,\nRequite him for your father.\n\nLaer.\nI will do't:\nAnd for that purpose I'll anoint my sword.\nI bought an unction of a mountebank,\nSo mortal that, but dip a knife in it,\nWhere it draws blood no cataplasm so rare,\nCollected from all simples that have virtue\nUnder the moon, can save the thing from death\nThis is but scratch'd withal: I'll touch my point\nWith this contagion, that, if I gall him slightly,\nIt may be death.\n\nKing.\nLet's further think of this;\nWeigh what convenience both of time and means\nMay fit us to our shape: if this should fail,\nAnd that our drift look through our bad performance.\n'Twere better not assay'd: therefore this project\nShould have a back or second, that might hold\nIf this did blast in proof. Soft! let me see:--\nWe'll make a solemn wager on your cunnings,--\nI ha't:\nWhen in your motion you are hot and dry,--\nAs make your bouts more violent to that end,--\nAnd that he calls for drink, I'll have prepar'd him\nA chalice for the nonce; whereon but sipping,\nIf he by chance escape your venom'd stuck,\nOur purpose may hold there.\n\n[Enter Queen.]\n\nHow now, sweet queen!\n\nQueen.\nOne woe doth tread upon another's heel,\nSo fast they follow:--your sister's drown'd, Laertes.\n\nLaer.\nDrown'd! O, where?\n\nQueen.\nThere is a willow grows aslant a brook,\nThat shows his hoar leaves in the glassy stream;\nThere with fantastic garlands did she come\nOf crowflowers, nettles, daisies, and long purples,\nThat liberal shepherds give a grosser name,\nBut our cold maids do dead men's fingers call them.\nThere, on the pendant boughs her coronet weeds\nClamb'ring to hang, an envious sliver broke;\nWhen down her weedy trophies and herself\nFell in the weeping brook. Her clothes spread wide;\nAnd, mermaid-like, awhile they bore her up;\nWhich time she chaunted snatches of old tunes;\nAs one incapable of her own distress,\nOr like a creature native and indu'd\nUnto that element: but long it could not be\nTill that her garments, heavy with their drink,\nPull'd the poor wretch from her melodious lay\nTo muddy death.\n\nLaer.\nAlas, then she is drown'd?\n\nQueen.\nDrown'd, drown'd.\n\nLaer.\nToo much of water hast thou, poor Ophelia,\nAnd therefore I forbid my tears: but yet\nIt is our trick; nature her custom holds,\nLet shame say what it will: when these are gone,\nThe woman will be out.--Adieu, my lord:\nI have a speech of fire, that fain would blaze,\nBut that this folly douts it.\n\n[Exit.]\n\nKing.\nLet's follow, Gertrude;\nHow much I had to do to calm his rage!\nNow fear I this will give it start again;\nTherefore let's follow.\n\n[Exeunt.]\n\n\n\nACT V.\n\nScene I. A churchyard.\n\n[Enter two Clowns, with spades, &c.]\n\n1 Clown.\nIs she to be buried in Christian burial when she wilfully\nseeks her own salvation?\n\n2 Clown.\nI tell thee she is; and therefore make her grave straight: the\ncrowner hath sat on her, and finds it Christian burial.\n\n1 Clown.\nHow can that be, unless she drowned herself in her own defence?\n\n2 Clown.\nWhy, 'tis found so.\n\n1 Clown.\nIt must be se offendendo; it cannot be else. For here lies\nthe point: if I drown myself wittingly, it argues an act: and an\nact hath three branches; it is to act, to do, and to perform:\nargal, she drowned herself wittingly.\n\n2 Clown.\nNay, but hear you, goodman delver,--\n\n1 Clown.\nGive me leave. Here lies the water; good: here stands the\nman; good: if the man go to this water and drown himself, it is,\nwill he, nill he, he goes,--mark you that: but if the water come\nto him and drown him, he drowns not himself; argal, he that is\nnot guilty of his own death shortens not his own life.\n\n2 Clown.\nBut is this law?\n\n1 Clown.\nAy, marry, is't--crowner's quest law.\n\n2 Clown.\nWill you ha' the truth on't? If this had not been a\ngentlewoman, she should have been buried out o' Christian burial.\n\n1 Clown.\nWhy, there thou say'st: and the more pity that great folk\nshould have countenance in this world to drown or hang themselves\nmore than their even Christian.--Come, my spade. There is no\nancient gentlemen but gardeners, ditchers, and grave-makers: they\nhold up Adam's profession.\n\n2 Clown.\nWas he a gentleman?\n\n1 Clown.\nHe was the first that ever bore arms.\n\n2 Clown.\nWhy, he had none.\n\n1 Clown.\nWhat, art a heathen? How dost thou understand the Scripture?\nThe Scripture says Adam digg'd: could he dig without arms? I'll\nput another question to thee: if thou answerest me not to the\npurpose, confess thyself,--\n\n2 Clown.\nGo to.\n\n1 Clown.\nWhat is he that builds stronger than either the mason, the\nshipwright, or the carpenter?\n\n2 Clown.\nThe gallows-maker; for that frame outlives a thousand tenants.\n\n1 Clown.\nI like thy wit well, in good faith: the gallows does well;\nbut how does it well? it does well to those that do ill: now,\nthou dost ill to say the gallows is built stronger than the\nchurch; argal, the gallows may do well to thee. To't again, come.\n\n2 Clown.\nWho builds stronger than a mason, a shipwright, or a carpenter?\n\n1 Clown.\nAy, tell me that, and unyoke.\n\n2 Clown.\nMarry, now I can tell.\n\n1 Clown.\nTo't.\n\n2 Clown.\nMass, I cannot tell.\n\n[Enter Hamlet and Horatio, at a distance.]\n\n1 Clown.\nCudgel thy brains no more about it, for your dull ass will\nnot mend his pace with beating; and when you are asked this\nquestion next, say 'a grave-maker;' the houses he makes last\ntill doomsday. Go, get thee to Yaughan; fetch me a stoup of\nliquor.\n\n[Exit Second Clown.]\n\n[Digs and sings.]\n\n   In youth when I did love, did love,\n     Methought it was very sweet;\n   To contract, O, the time for, ah, my behove,\n     O, methought there was nothing meet.\n\nHam.\nHas this fellow no feeling of his business, that he sings at\ngrave-making?\n\nHor.\nCustom hath made it in him a property of easiness.\n\nHam.\n'Tis e'en so: the hand of little employment hath the daintier\nsense.\n\n1 Clown.\n[Sings.]\n   But age, with his stealing steps,\n     Hath claw'd me in his clutch,\n   And hath shipp'd me into the land,\n     As if I had never been such.\n\n[Throws up a skull.]\n\nHam.\nThat skull had a tongue in it, and could sing once: how the\nknave jowls it to the ground,as if 'twere Cain's jawbone, that\ndid the first murder! This might be the pate of a politician,\nwhich this ass now o'erreaches; one that would circumvent God,\nmight it not?\n\nHor.\nIt might, my lord.\n\nHam.\nOr of a courtier, which could say 'Good morrow, sweet lord!\nHow dost thou, good lord?' This might be my lord such-a-one, that\npraised my lord such-a-one's horse when he meant to beg\nit,--might it not?\n\nHor.\nAy, my lord.\n\nHam.\nWhy, e'en so: and now my Lady Worm's; chapless, and knocked\nabout the mazard with a sexton's spade: here's fine revolution,\nan we had the trick to see't. Did these bones cost no more the\nbreeding but to play at loggets with 'em? mine ache to think\non't.\n\n1 Clown.\n[Sings.]\n   A pickaxe and a spade, a spade,\n     For and a shrouding sheet;\n   O, a pit of clay for to be made\n     For such a guest is meet.\n\n[Throws up another skull].\n\nHam.\nThere's another: why may not that be the skull of a lawyer?\nWhere be his quiddits now, his quillets, his cases, his tenures,\nand his tricks? why does he suffer this rude knave now to knock\nhim about the sconce with a dirty shovel, and will not tell him\nof his action of battery? Hum! This fellow might be in's time a\ngreat buyer of land, with his statutes, his recognizances, his\nfines, his double vouchers, his recoveries: is this the fine of\nhis fines, and the recovery of his recoveries, to have his fine\npate full of fine dirt? will his vouchers vouch him no more of\nhis purchases, and double ones too, than the length and breadth\nof a pair of indentures? The very conveyances of his lands will\nscarcely lie in this box; and must the inheritor himself have no\nmore, ha?\n\nHor.\nNot a jot more, my lord.\n\nHam.\nIs not parchment made of sheep-skins?\n\nHor.\nAy, my lord, And of calf-skins too.\n\nHam.\nThey are sheep and calves which seek out assurance in that. I\nwill speak to this fellow.--Whose grave's this, sir?\n\n1 Clown.\nMine, sir.\n[Sings.]\n   O, a pit of clay for to be made\n     For such a guest is meet.\n\nHam.\nI think it be thine indeed, for thou liest in't.\n\n1 Clown.\nYou lie out on't, sir, and therefore 'tis not yours: for my part,\nI do not lie in't, yet it is mine.\n\nHam.\nThou dost lie in't, to be in't and say it is thine: 'tis for\nthe dead, not for the quick; therefore thou liest.\n\n1 Clown.\n'Tis a quick lie, sir; 't will away again from me to you.\n\nHam.\nWhat man dost thou dig it for?\n\n1 Clown.\nFor no man, sir.\n\nHam.\nWhat woman then?\n\n1 Clown.\nFor none neither.\n\nHam.\nWho is to be buried in't?\n\n1 Clown.\nOne that was a woman, sir; but, rest her soul, she's dead.\n\nHam.\nHow absolute the knave is! We must speak by the card, or\nequivocation will undo us. By the Lord, Horatio, these three\nyears I have taken note of it, the age is grown so picked that\nthe toe of the peasant comes so near the heel of the courtier he\ngalls his kibe.--How long hast thou been a grave-maker?\n\n1 Clown.\nOf all the days i' the year, I came to't that day that our\nlast King Hamlet overcame Fortinbras.\n\nHam.\nHow long is that since?\n\n1 Clown.\nCannot you tell that? every fool can tell that: it was the\nvery day that young Hamlet was born,--he that is mad, and sent\ninto England.\n\nHam.\nAy, marry, why was be sent into England?\n\n1 Clown.\nWhy, because he was mad: he shall recover his wits there;\nor, if he do not, it's no great matter there.\n\nHam.\nWhy?\n\n1 Clown.\n'Twill not he seen in him there; there the men are as mad as he.\n\nHam.\nHow came he mad?\n\n1 Clown.\nVery strangely, they say.\n\nHam.\nHow strangely?\n\n1 Clown.\nFaith, e'en with losing his wits.\n\nHam.\nUpon what ground?\n\n1 Clown.\nWhy, here in Denmark: I have been sexton here, man and boy,\nthirty years.\n\nHam.\nHow long will a man lie i' the earth ere he rot?\n\n1 Clown.\nFaith, if he be not rotten before he die,--as we have many\npocky corses now-a-days that will scarce hold the laying in,--he\nwill last you some eight year or nine year: a tanner will last\nyou nine year.\n\nHam.\nWhy he more than another?\n\n1 Clown.\nWhy, sir, his hide is so tann'd with his trade that he will\nkeep out water a great while; and your water is a sore decayer of\nyour whoreson dead body. Here's a skull now; this skull hath lain\nin the earth three-and-twenty years.\n\nHam.\nWhose was it?\n\n1 Clown.\nA whoreson, mad fellow's it was: whose do you think it was?\n\nHam.\nNay, I know not.\n\n1 Clown.\nA pestilence on him for a mad rogue! 'a pour'd a flagon of\nRhenish on my head once. This same skull, sir, was Yorick's\nskull, the king's jester.\n\nHam.\nThis?\n\n1 Clown.\nE'en that.\n\nHam.\nLet me see. [Takes the skull.] Alas, poor Yorick!--I knew him,\nHoratio; a fellow of infinite jest, of most excellent fancy: he\nhath borne me on his back a thousand times; and now, how abhorred\nin my imagination it is! my gorge rises at it. Here hung those\nlips that I have kiss'd I know not how oft. Where be your gibes\nnow? your gambols? your songs? your flashes of merriment, that\nwere wont to set the table on a roar? Not one now, to mock your\nown grinning? quite chap-fallen? Now, get you to my lady's\nchamber, and tell her, let her paint an inch thick, to this\nfavour she must come; make her laugh at that.--Pr'ythee, Horatio,\ntell me one thing.\n\nHor.\nWhat's that, my lord?\n\nHam.\nDost thou think Alexander looked o' this fashion i' the earth?\n\nHor.\nE'en so.\n\nHam.\nAnd smelt so? Pah!\n\n[Throws down the skull.]\n\nHor.\nE'en so, my lord.\n\nHam.\nTo what base uses we may return, Horatio! Why may not\nimagination trace the noble dust of Alexander till he find it\nstopping a bung-hole?\n\nHor.\n'Twere to consider too curiously to consider so.\n\nHam.\nNo, faith, not a jot; but to follow him thither with modesty\nenough, and likelihood to lead it: as thus: Alexander died,\nAlexander was buried, Alexander returneth into dust; the dust is\nearth; of earth we make loam; and why of that loam whereto he\nwas converted might they not stop a beer-barrel?\n   Imperious Caesar, dead and turn'd to clay,\n   Might stop a hole to keep the wind away.\n   O, that that earth which kept the world in awe\n   Should patch a wall to expel the winter's flaw!\nBut soft! but soft! aside!--Here comes the king.\n\n[Enter priests, &c, in procession; the corpse of Ophelia,\nLaertes, and Mourners following; King, Queen, their Trains, &c.]\n\nThe queen, the courtiers: who is that they follow?\nAnd with such maimed rites? This doth betoken\nThe corse they follow did with desperate hand\nFordo it own life: 'twas of some estate.\nCouch we awhile and mark.\n\n[Retiring with Horatio.]\n\nLaer.\nWhat ceremony else?\n\nHam.\nThat is Laertes,\nA very noble youth: mark.\n\nLaer.\nWhat ceremony else?\n\n1 Priest.\nHer obsequies have been as far enlarg'd\nAs we have warranties: her death was doubtful;\nAnd, but that great command o'ersways the order,\nShe should in ground unsanctified have lodg'd\nTill the last trumpet; for charitable prayers,\nShards, flints, and pebbles should be thrown on her,\nYet here she is allowed her virgin rites,\nHer maiden strewments, and the bringing home\nOf bell and burial.\n\nLaer.\nMust there no more be done?\n\n1 Priest.\nNo more be done;\nWe should profane the service of the dead\nTo sing a requiem and such rest to her\nAs to peace-parted souls.\n\nLaer.\nLay her i' the earth;--\nAnd from her fair and unpolluted flesh\nMay violets spring!--I tell thee, churlish priest,\nA ministering angel shall my sister be\nWhen thou liest howling.\n\nHam.\nWhat, the fair Ophelia?\n\nQueen.\nSweets to the sweet: farewell.\n[Scattering flowers.]\nI hop'd thou shouldst have been my Hamlet's wife;\nI thought thy bride-bed to have deck'd, sweet maid,\nAnd not have strew'd thy grave.\n\nLaer.\nO, treble woe\nFall ten times treble on that cursed head\nWhose wicked deed thy most ingenious sense\nDepriv'd thee of!--Hold off the earth awhile,\nTill I have caught her once more in mine arms:\n[Leaps into the grave.]\nNow pile your dust upon the quick and dead,\nTill of this flat a mountain you have made,\nTo o'ertop old Pelion or the skyish head\nOf blue Olympus.\n\nHam.\n[Advancing.]\nWhat is he whose grief\nBears such an emphasis? whose phrase of sorrow\nConjures the wandering stars, and makes them stand\nLike wonder-wounded hearers? this is I,\nHamlet the Dane.\n[Leaps into the grave.]\n\nLaer.\nThe devil take thy soul!\n[Grappling with him.]\n\nHam.\nThou pray'st not well.\nI pr'ythee, take thy fingers from my throat;\nFor, though I am not splenetive and rash,\nYet have I in me something dangerous,\nWhich let thy wiseness fear: away thy hand!\n\nKing.\nPluck them asunder.\n\nQueen.\nHamlet! Hamlet!\n\nAll.\nGentlemen!--\n\nHor.\nGood my lord, be quiet.\n\n[The Attendants part them, and they come out of the grave.]\n\nHam.\nWhy, I will fight with him upon this theme\nUntil my eyelids will no longer wag.\n\nQueen.\nO my son, what theme?\n\nHam.\nI lov'd Ophelia; forty thousand brothers\nCould not, with all their quantity of love,\nMake up my sum.--What wilt thou do for her?\n\nKing.\nO, he is mad, Laertes.\n\nQueen.\nFor love of God, forbear him!\n\nHam.\n'Swounds, show me what thou'lt do:\nWoul't weep? woul't fight? woul't fast? woul't tear thyself?\nWoul't drink up eisel? eat a crocodile?\nI'll do't.--Dost thou come here to whine?\nTo outface me with leaping in her grave?\nBe buried quick with her, and so will I:\nAnd, if thou prate of mountains, let them throw\nMillions of acres on us, till our ground,\nSingeing his pate against the burning zone,\nMake Ossa like a wart! Nay, an thou'lt mouth,\nI'll rant as well as thou.\n\nQueen.\nThis is mere madness:\nAnd thus a while the fit will work on him;\nAnon, as patient as the female dove,\nWhen that her golden couplets are disclos'd,\nHis silence will sit drooping.\n\nHam.\nHear you, sir;\nWhat is the reason that you use me thus?\nI lov'd you ever: but it is no matter;\nLet Hercules himself do what he may,\nThe cat will mew, and dog will have his day.\n\n[Exit.]\n\nKing.\nI pray thee, good Horatio, wait upon him.--\n\n[Exit Horatio.]\n[To Laertes]\nStrengthen your patience in our last night's speech;\nWe'll put the matter to the present push.--\nGood Gertrude, set some watch over your son.--\nThis grave shall have a living monument:\nAn hour of quiet shortly shall we see;\nTill then in patience our proceeding be.\n\n[Exeunt.]\n\n\n\nScene II. A hall in the Castle.\n\n[Enter Hamlet and Horatio.]\n\nHam.\nSo much for this, sir: now let me see the other;\nYou do remember all the circumstance?\n\nHor.\nRemember it, my lord!\n\nHam.\nSir, in my heart there was a kind of fighting\nThat would not let me sleep: methought I lay\nWorse than the mutinies in the bilboes. Rashly,\nAnd prais'd be rashness for it,--let us know,\nOur indiscretion sometime serves us well,\nWhen our deep plots do fail; and that should teach us\nThere's a divinity that shapes our ends,\nRough-hew them how we will.\n\nHor.\nThat is most certain.\n\nHam.\nUp from my cabin,\nMy sea-gown scarf'd about me, in the dark\nGrop'd I to find out them: had my desire;\nFinger'd their packet; and, in fine, withdrew\nTo mine own room again: making so bold,\nMy fears forgetting manners, to unseal\nTheir grand commission; where I found, Horatio,\nO royal knavery! an exact command,--\nLarded with many several sorts of reasons,\nImporting Denmark's health, and England's too,\nWith, ho! such bugs and goblins in my life,--\nThat, on the supervise, no leisure bated,\nNo, not to stay the grinding of the axe,\nMy head should be struck off.\n\nHor.\nIs't possible?\n\nHam.\nHere's the commission: read it at more leisure.\nBut wilt thou bear me how I did proceed?\n\nHor.\nI beseech you.\n\nHam.\nBeing thus benetted round with villanies,--\nOr I could make a prologue to my brains,\nThey had begun the play,--I sat me down;\nDevis'd a new commission; wrote it fair:\nI once did hold it, as our statists do,\nA baseness to write fair, and labour'd much\nHow to forget that learning; but, sir, now\nIt did me yeoman's service. Wilt thou know\nThe effect of what I wrote?\n\nHor.\nAy, good my lord.\n\nHam.\nAn earnest conjuration from the king,--\nAs England was his faithful tributary;\nAs love between them like the palm might flourish;\nAs peace should still her wheaten garland wear\nAnd stand a comma 'tween their amities;\nAnd many such-like as's of great charge,--\nThat, on the view and know of these contents,\nWithout debatement further, more or less,\nHe should the bearers put to sudden death,\nNot shriving-time allow'd.\n\nHor.\nHow was this seal'd?\n\nHam.\nWhy, even in that was heaven ordinant.\nI had my father's signet in my purse,\nWhich was the model of that Danish seal:\nFolded the writ up in the form of the other;\nSubscrib'd it: gave't the impression; plac'd it safely,\nThe changeling never known. Now, the next day\nWas our sea-fight; and what to this was sequent\nThou know'st already.\n\nHor.\nSo Guildenstern and Rosencrantz go to't.\n\nHam.\nWhy, man, they did make love to this employment;\nThey are not near my conscience; their defeat\nDoes by their own insinuation grow:\n'Tis dangerous when the baser nature comes\nBetween the pass and fell incensed points\nOf mighty opposites.\n\nHor.\nWhy, what a king is this!\n\nHam.\nDoes it not, thinks't thee, stand me now upon,--\nHe that hath kill'd my king, and whor'd my mother;\nPopp'd in between the election and my hopes;\nThrown out his angle for my proper life,\nAnd with such cozenage--is't not perfect conscience\nTo quit him with this arm? and is't not to be damn'd\nTo let this canker of our nature come\nIn further evil?\n\nHor.\nIt must be shortly known to him from England\nWhat is the issue of the business there.\n\nHam.\nIt will be short: the interim is mine;\nAnd a man's life is no more than to say One.\nBut I am very sorry, good Horatio,\nThat to Laertes I forgot myself;\nFor by the image of my cause I see\nThe portraiture of his: I'll court his favours:\nBut, sure, the bravery of his grief did put me\nInto a towering passion.\n\nHor.\nPeace; who comes here?\n\n[Enter Osric.]\n\nOsr.\nYour lordship is right welcome back to Denmark.\n\nHam.\nI humbly thank you, sir. Dost know this water-fly?\n\nHor.\nNo, my good lord.\n\nHam.\nThy state is the more gracious; for 'tis a vice to know him. He\nhath much land, and fertile: let a beast be lord of beasts, and\nhis crib shall stand at the king's mess; 'tis a chough; but, as I\nsay, spacious in the possession of dirt.\n\nOsr.\nSweet lord, if your lordship were at leisure, I should\nimpart a thing to you from his majesty.\n\nHam.\nI will receive it with all diligence of spirit. Put your\nbonnet to his right use; 'tis for the head.\n\nOsr.\nI thank your lordship, t'is very hot.\n\nHam.\nNo, believe me, 'tis very cold; the wind is northerly.\n\nOsr.\nIt is indifferent cold, my lord, indeed.\n\nHam.\nMethinks it is very sultry and hot for my complexion.\n\nOsr.\nExceedingly, my lord; it is very sultry,--as 'twere--I cannot\ntell how. But, my lord, his majesty bade me signify to you that\nhe has laid a great wager on your head. Sir, this is the\nmatter,--\n\nHam.\nI beseech you, remember,--\n[Hamlet moves him to put on his hat.]\n\nOsr.\nNay, in good faith; for mine ease, in good faith. Sir, here\nis newly come to court Laertes; believe me, an absolute\ngentleman, full of most excellent differences, of very soft\nsociety and great showing: indeed, to speak feelingly of him, he\nis the card or calendar of gentry; for you shall find in him the\ncontinent of what part a gentleman would see.\n\nHam.\nSir, his definement suffers no perdition in you;--though, I\nknow, to divide him inventorially would dizzy the arithmetic of\nmemory, and yet but yaw neither, in respect of his quick sail.\nBut, in the verity of extolment, I take him to be a soul of great\narticle, and his infusion of such dearth and rareness as, to make\ntrue diction of him, his semblable is his mirror, and who else\nwould trace him, his umbrage, nothing more.\n\nOsr.\nYour lordship speaks most infallibly of him.\n\nHam.\nThe concernancy, sir? why do we wrap the gentleman in our more\nrawer breath?\n\nOsr.\nSir?\n\nHor.\nIs't not possible to understand in another tongue? You will do't,\nsir, really.\n\nHam.\nWhat imports the nomination of this gentleman?\n\nOsr.\nOf Laertes?\n\nHor.\nHis purse is empty already; all's golden words are spent.\n\nHam.\nOf him, sir.\n\nOsr.\nI know, you are not ignorant,--\n\nHam.\nI would you did, sir; yet, in faith, if you did, it would not\nmuch approve me.--Well, sir.\n\nOsr.\nYou are not ignorant of what excellence Laertes is,--\n\nHam.\nI dare not confess that, lest I should compare with him in\nexcellence; but to know a man well were to know himself.\n\nOsr.\nI mean, sir, for his weapon; but in the imputation laid on\nhim by them, in his meed he's unfellowed.\n\nHam.\nWhat's his weapon?\n\nOsr.\nRapier and dagger.\n\nHam.\nThat's two of his weapons:--but well.\n\nOsr.\nThe king, sir, hath wager'd with him six Barbary horses:\nagainst the which he has imponed, as I take it, six French\nrapiers and poniards, with their assigns, as girdle, hangers, and\nso: three of the carriages, in faith, are very dear to fancy,\nvery responsive to the hilts, most delicate carriages, and of\nvery liberal conceit.\n\nHam.\nWhat call you the carriages?\n\nHor.\nI knew you must be edified by the margent ere you had done.\n\nOsr.\nThe carriages, sir, are the hangers.\n\nHam.\nThe phrase would be more german to the matter if we could\ncarry cannon by our sides. I would it might be hangers till then.\nBut, on: six Barbary horses against six French swords, their\nassigns, and three liberal conceited carriages: that's the French\nbet against the Danish: why is this all imponed, as you call it?\n\nOsr.\nThe king, sir, hath laid that, in a dozen passes between\nyour and him, he shall not exceed you three hits: he hath\nlaid on twelve for nine; and it would come to immediate trial\nif your lordship would vouchsafe the answer.\n\nHam.\nHow if I answer no?\n\nOsr.\nI mean, my lord, the opposition of your person in trial.\n\nHam.\nSir, I will walk here in the hall: if it please his majesty,\nit is the breathing time of day with me: let the foils be\nbrought, the gentleman willing, and the king hold his purpose,\nI will win for him if I can; if not, I will gain nothing but my\nshame and the odd hits.\n\nOsr.\nShall I re-deliver you e'en so?\n\nHam.\nTo this effect, sir; after what flourish your nature will.\n\nOsr.\nI commend my duty to your lordship.\n\nHam.\nYours, yours.\n\n[Exit Osric.]\n\nHe does well to commend it himself; there are no tongues else\nfor's turn.\n\nHor.\nThis lapwing runs away with the shell on his head.\n\nHam.\nHe did comply with his dug before he suck'd it. Thus has he,--and\nmany more of the same bevy that I know the drossy age dotes on,--\nonly got the tune of the time and outward habit of encounter;\na kind of yesty collection, which carries them through and\nthrough the most fanned and winnowed opinions; and do but blow\nthem to their trial, the bubbles are out,\n\n[Enter a Lord.]\n\nLord.\nMy lord, his majesty commended him to you by young Osric,\nwho brings back to him that you attend him in the hall: he sends\nto know if your pleasure hold to play with Laertes, or that you\nwill take longer time.\n\nHam.\nI am constant to my purposes; they follow the king's pleasure:\nif his fitness speaks, mine is ready; now or whensoever, provided\nI be so able as now.\n\nLord.\nThe King and Queen and all are coming down.\n\nHam.\nIn happy time.\n\nLord.\nThe queen desires you to use some gentle entertainment to\nLaertes before you fall to play.\n\nHam.\nShe well instructs me.\n\n[Exit Lord.]\n\nHor.\nYou will lose this wager, my lord.\n\nHam.\nI do not think so; since he went into France I have been in\ncontinual practice: I shall win at the odds. But thou wouldst not\nthink how ill all's here about my heart: but it is no matter.\n\nHor.\nNay, good my lord,--\n\nHam.\nIt is but foolery; but it is such a kind of gain-giving as\nwould perhaps trouble a woman.\n\nHor.\nIf your mind dislike anything, obey it: I will forestall their\nrepair hither, and say you are not fit.\n\nHam.\nNot a whit, we defy augury: there's a special providence in\nthe fall of a sparrow. If it be now, 'tis not to come; if it be\nnot to come, it will be now; if it be not now, yet it will come:\nthe readiness is all: since no man has aught of what he leaves,\nwhat is't to leave betimes?\n\n[Enter King, Queen, Laertes, Lords, Osric, and Attendants with\nfoils &c.]\n\nKing.\nCome, Hamlet, come, and take this hand from me.\n\n[The King puts Laertes' hand into Hamlet's.]\n\nHam.\nGive me your pardon, sir: I have done you wrong:\nBut pardon't, as you are a gentleman.\nThis presence knows, and you must needs have heard,\nHow I am punish'd with sore distraction.\nWhat I have done\nThat might your nature, honour, and exception\nRoughly awake, I here proclaim was madness.\nWas't Hamlet wrong'd Laertes? Never Hamlet:\nIf Hamlet from himself be ta'en away,\nAnd when he's not himself does wrong Laertes,\nThen Hamlet does it not, Hamlet denies it.\nWho does it, then? His madness: if't be so,\nHamlet is of the faction that is wrong'd;\nHis madness is poor Hamlet's enemy.\nSir, in this audience,\nLet my disclaiming from a purpos'd evil\nFree me so far in your most generous thoughts\nThat I have shot my arrow o'er the house\nAnd hurt my brother.\n\nLaer.\nI am satisfied in nature,\nWhose motive, in this case, should stir me most\nTo my revenge. But in my terms of honour\nI stand aloof; and will no reconcilement\nTill by some elder masters of known honour\nI have a voice and precedent of peace\nTo keep my name ungor'd. But till that time\nI do receive your offer'd love like love,\nAnd will not wrong it.\n\nHam.\nI embrace it freely;\nAnd will this brother's wager frankly play.--\nGive us the foils; come on.\n\nLaer.\nCome, one for me.\n\nHam.\nI'll be your foil, Laertes; in mine ignorance\nYour skill shall, like a star in the darkest night,\nStick fiery off indeed.\n\nLaer.\nYou mock me, sir.\n\nHam.\nNo, by this hand.\n\nKing.\nGive them the foils, young Osric. Cousin Hamlet,\nYou know the wager?\n\nHam.\nVery well, my lord;\nYour grace has laid the odds o' the weaker side.\n\nKing.\nI do not fear it; I have seen you both;\nBut since he's better'd, we have therefore odds.\n\nLaer.\nThis is too heavy, let me see another.\n\nHam.\nThis likes me well. These foils have all a length?\n\n[They prepare to play.]\n\nOsr.\nAy, my good lord.\n\nKing.\nSet me the stoups of wine upon that table,--\nIf Hamlet give the first or second hit,\nOr quit in answer of the third exchange,\nLet all the battlements their ordnance fire;\nThe king shall drink to Hamlet's better breath;\nAnd in the cup an union shall he throw,\nRicher than that which four successive kings\nIn Denmark's crown have worn. Give me the cups;\nAnd let the kettle to the trumpet speak,\nThe trumpet to the cannoneer without,\nThe cannons to the heavens, the heavens to earth,\n'Now the king drinks to Hamlet.'--Come, begin:--\nAnd you, the judges, bear a wary eye.\n\nHam.\nCome on, sir.\n\nLaer.\nCome, my lord.\n\n[They play.]\n\nHam.\nOne.\n\nLaer.\nNo.\n\nHam.\nJudgment!\n\nOsr.\nA hit, a very palpable hit.\n\nLaer.\nWell;--again.\n\nKing.\nStay, give me drink.--Hamlet, this pearl is thine;\nHere's to thy health.--\n\n[Trumpets sound, and cannon shot off within.]\n\nGive him the cup.\n\nHam.\nI'll play this bout first; set it by awhile.--\nCome.--Another hit; what say you?\n\n[They play.]\n\nLaer.\nA touch, a touch, I do confess.\n\nKing.\nOur son shall win.\n\nQueen.\nHe's fat, and scant of breath.--\nHere, Hamlet, take my napkin, rub thy brows:\nThe queen carouses to thy fortune, Hamlet.\n\nHam.\nGood madam!\n\nKing.\nGertrude, do not drink.\n\nQueen.\nI will, my lord; I pray you pardon me.\n\nKing.\n[Aside.] It is the poison'd cup; it is too late.\n\nHam.\nI dare not drink yet, madam; by-and-by.\n\nQueen.\nCome, let me wipe thy face.\n\nLaer.\nMy lord, I'll hit him now.\n\nKing.\nI do not think't.\n\nLaer.\n[Aside.] And yet 'tis almost 'gainst my conscience.\n\nHam.\nCome, for the third, Laertes: you but dally;\nI pray you pass with your best violence:\nI am afeard you make a wanton of me.\n\nLaer.\nSay you so? come on.\n\n[They play.]\n\nOsr.\nNothing, neither way.\n\nLaer.\nHave at you now!\n\n[Laertes wounds Hamlet; then, in scuffling, they\nchange rapiers, and Hamlet wounds Laertes.]\n\nKing.\nPart them; they are incens'd.\n\nHam.\nNay, come again!\n\n[The Queen falls.]\n\nOsr.\nLook to the queen there, ho!\n\nHor.\nThey bleed on both sides.--How is it, my lord?\n\nOsr.\nHow is't, Laertes?\n\nLaer.\nWhy, as a woodcock to my own springe, Osric;\nI am justly kill'd with mine own treachery.\n\nHam.\nHow does the Queen?\n\nKing.\nShe swoons to see them bleed.\n\nQueen.\nNo, no! the drink, the drink!--O my dear Hamlet!--\nThe drink, the drink!--I am poison'd.\n\n[Dies.]\n\nHam.\nO villany!--Ho! let the door be lock'd:\nTreachery! seek it out.\n\n[Laertes falls.]\n\nLaer.\nIt is here, Hamlet: Hamlet, thou art slain;\nNo medicine in the world can do thee good;\nIn thee there is not half an hour of life;\nThe treacherous instrument is in thy hand,\nUnbated and envenom'd: the foul practice\nHath turn'd itself on me; lo, here I lie,\nNever to rise again: thy mother's poison'd:\nI can no more:--the king, the king's to blame.\n\nHam.\nThe point envenom'd too!--\nThen, venom, to thy work.\n\n[Stabs the King.]\n\nOsric and Lords.\nTreason! treason!\n\nKing.\nO, yet defend me, friends! I am but hurt.\n\nHam.\nHere, thou incestuous, murderous, damned Dane,\nDrink off this potion.--Is thy union here?\nFollow my mother.\n\n[King dies.]\n\nLaer.\nHe is justly serv'd;\nIt is a poison temper'd by himself.--\nExchange forgiveness with me, noble Hamlet:\nMine and my father's death come not upon thee,\nNor thine on me!\n\n[Dies.]\n\nHam.\nHeaven make thee free of it! I follow thee.--\nI am dead, Horatio.--Wretched queen, adieu!--\nYou that look pale and tremble at this chance,\nThat are but mutes or audience to this act,\nHad I but time,--as this fell sergeant, death,\nIs strict in his arrest,--O, I could tell you,--\nBut let it be.--Horatio, I am dead;\nThou liv'st; report me and my cause aright\nTo the unsatisfied.\n\nHor.\nNever believe it:\nI am more an antique Roman than a Dane.--\nHere's yet some liquor left.\n\nHam.\nAs thou'rt a man,\nGive me the cup; let go; by heaven, I'll have't.--\nO good Horatio, what a wounded name,\nThings standing thus unknown, shall live behind me!\nIf thou didst ever hold me in thy heart,\nAbsent thee from felicity awhile,\nAnd in this harsh world draw thy breath in pain,\nTo tell my story.--\n\n[March afar off, and shot within.]\n\nWhat warlike noise is this?\n\nOsr.\nYoung Fortinbras, with conquest come from Poland,\nTo the ambassadors of England gives\nThis warlike volley.\n\nHam.\nO, I die, Horatio;\nThe potent poison quite o'er-crows my spirit:\nI cannot live to hear the news from England;\nBut I do prophesy the election lights\nOn Fortinbras: he has my dying voice;\nSo tell him, with the occurrents, more and less,\nWhich have solicited.--the rest is silence.\n\n[Dies.]\n\nHor.\nNow cracks a noble heart.--Good night, sweet prince,\nAnd flights of angels sing thee to thy rest!\nWhy does the drum come hither?\n\n[March within.]\n\n[Enter Fortinbras, the English Ambassadors, and others.]\n\nFort.\nWhere is this sight?\n\nHor.\nWhat is it you will see?\nIf aught of woe or wonder, cease your search.\n\nFort.\nThis quarry cries on havoc.--O proud death,\nWhat feast is toward in thine eternal cell,\nThat thou so many princes at a shot\nSo bloodily hast struck?\n\n1 Ambassador.\nThe sight is dismal;\nAnd our affairs from England come too late:\nThe ears are senseless that should give us hearing,\nTo tell him his commandment is fulfill'd\nThat Rosencrantz and Guildenstern are dead:\nWhere should we have our thanks?\n\nHor.\nNot from his mouth,\nHad it the ability of life to thank you:\nHe never gave commandment for their death.\nBut since, so jump upon this bloody question,\nYou from the Polack wars, and you from England,\nAre here arriv'd, give order that these bodies\nHigh on a stage be placed to the view;\nAnd let me speak to the yet unknowing world\nHow these things came about: so shall you hear\nOf carnal, bloody and unnatural acts;\nOf accidental judgments, casual slaughters;\nOf deaths put on by cunning and forc'd cause;\nAnd, in this upshot, purposes mistook\nFall'n on the inventors' heads: all this can I\nTruly deliver.\n\nFort.\nLet us haste to hear it,\nAnd call the noblest to the audience.\nFor me, with sorrow I embrace my fortune:\nI have some rights of memory in this kingdom,\nWhich now, to claim my vantage doth invite me.\n\nHor.\nOf that I shall have also cause to speak,\nAnd from his mouth whose voice will draw on more:\nBut let this same be presently perform'd,\nEven while men's minds are wild: lest more mischance\nOn plots and errors happen.\n\nFort.\nLet four captains\nBear Hamlet like a soldier to the stage;\nFor he was likely, had he been put on,\nTo have prov'd most royally: and, for his passage,\nThe soldiers' music and the rites of war\nSpeak loudly for him.--\nTake up the bodies.--Such a sight as this\nBecomes the field, but here shows much amiss.\nGo, bid the soldiers shoot.\n\n[A dead march.]\n\n[Exeunt, bearing off the dead bodies; after the which a peal of\nordnance is shot off.]\n\n\n\n\n\nThe End of Project Gutenberg Etext of Hamlet by Shakespeare\nPG has multiple editions of William Shakespeare's Complete Works", "title": "Hamlet, Prince of Denmark"}