{"summary": "On Christmas Eve night, while his wife and children sleep, a father awakens to noises outside his house. Looking out the window, he sees St. Nicholas in an air-borne sleigh pulled by eight reindeer. After landing his sleigh on the roof, the saint enters the house through the chimney, carrying a sack of toys with him. The father watches Nicholas filling the children's Christmas stockings hanging by the fire, and laughs to himself. They share a conspiratorial moment before the saint bounds up the chimney again. As he flies away, Saint Nicholas wishes everyone a \"Happy Christmas to all, and to all a good night.\"\n\n", "full_text": "Twas the Night Before Christmas\n\n  A Visit from St. Nicholas\n\n  By Clement C. Moore\n\n\n  [Illustration]\n\n\n  With Pictures by Jessie Willcox Smith\n\n  Houghton Mifflin Company\n\n  Boston\n\n  Copyright (c) 1912 by Houghton Mifflin Company\n\n  All rights reserved. For information about permission\n  to reproduce selections from this book, write to\n  Permissions, Houghton Mifflin Company, 215 Park\n  Avenue South, New York, New York 10003.\n\n  HC ISBN 0-395-06952-1\n  PA ISBN 0-395-64374-0\n\n  Printed in the United States of America\n\n  LBM 40 39 38 37 36\n\n\n\n\nINTRODUCTION\n\n\nAmid the many celebrations last Christmas Eve, in various places by\ndifferent persons, there was one, in New York City, not like any other\nanywhere. A company of men, women, and children went together just after\nthe evening service in their church, and, standing around the tomb of\nthe author of \"A Visit from St. Nicholas,\" recited together the words of\nthe poem which we all know so well and love so dearly.\n\nDr. Clement C. Moore, who wrote the poem, never expected that he would\nbe remembered by it. If he expected to be famous at all as a writer, he\nthought it would be because of the Hebrew Dictionary that he wrote.\n\nHe was born in a house near Chelsea Square, New York City, in 1781; and\nhe lived there all his life. It was a great big house, with fireplaces\nin it;--just the house to be living in on Christmas Eve.\n\nDr. Moore had children. He liked writing poetry for them even more than\nhe liked writing a Hebrew Dictionary. He wrote a whole book of poems for\nthem.\n\nOne year he wrote this poem, which we usually call \"'Twas the Night\nbefore Christmas,\" to give to his children for a Christmas present. They\nread it just after they had hung up their stockings before one of the\nbig fireplaces in their house. Afterward, they learned it, and sometimes\nrecited it, just as other children learn it and recite it now.\n\nIt was printed in a newspaper. Then a magazine printed it, and after a\ntime it was printed in the school readers. Later it was printed by\nitself, with pictures. Then it was translated into German, French, and\nmany other languages. It was even made into \"Braille\"; which is the\nraised printing that blind children read with their fingers. But never\nhas it been given to us in so attractive a form as in this book. It has\nhappened that almost all the children in the world know this poem. How\nfew of them know any Hebrew!\n\nEvery Christmas Eve the young men studying to be ministers at the\nGeneral Theological Seminary, New York City, put a holly wreath around\nDr. Moore's picture, which is on the wall of their dining-room. Why?\nBecause he gave the ground on which the General Theological Seminary\nstands? Because he wrote a Hebrew Dictionary? No. They do it because he\nwas the author of \"A Visit from St. Nicholas.\"\n\nMost of the children probably know the words of the poem. They are old.\nBut the pictures that Miss Jessie Willcox Smith has painted for this\nedition of it are new. All the children, probably, have seen other\npictures painted by Miss Smith, showing children at other seasons of the\nyear. How much they will enjoy looking at these pictures, showing\nchildren on that night that all children like best,--Christmas Eve!\n\n                                                                  E. McC.\n\n\n\n\n    'Twas the Night before Christmas\n\n\n[Illustration]\n\n'Twas the night before Christmas, when all through the house\nNot a creature was stirring, not even a mouse;\nThe stockings were hung by the chimney with care\nIn hopes that St. Nicholas soon would be there;\n\n[Illustration]\n\nThe children were nestled all snug in their beds,\nWhile visions of sugar-plums danced in their heads;\nAnd mamma in her kerchief, and I in my cap,\nHad just settled our brains for a long winter's nap,\n\n[Illustration]\n\nWhen out on the lawn there arose such a clatter,\nI sprang from the bed to see what was the matter.\nAway to the window I flew like a flash,\nTore open the shutters and threw up the sash.\n\n[Illustration]\n\nThe moon on the breast of the new-fallen snow\nGave the lustre of mid-day to objects below,\nWhen, what to my wondering eyes should appear,\nBut a miniature sleigh, and eight tiny reindeer,\n\n[Illustration]\n\nWith a little old driver, so lively and quick,\nI knew in a moment it must be St. Nick.\nMore rapid than eagles his coursers they came,\nAnd he whistled, and shouted, and called them by name:\n\n\"Now, _Dasher!_ now, _Dancer!_ now, _Prancer_ and _Vixen!_\nOn, _Comet!_ on, _Cupid!_ on, _Donder_ and _Blitzen!_\nTo the top of the porch! to the top of the wall!\nNow dash away! dash away! dash away all!\"\n\n[Illustration]\n\n[Illustration]\n\nAs dry leaves that before the wild hurricane fly,\nWhen they meet with an obstacle, mount to the sky;\nSo up to the house-top the coursers they flew,\nWith the sleigh full of Toys, and St. Nicholas too.\n\nAnd then, in a twinkling, I heard on the roof\nThe prancing and pawing of each little hoof.\nAs I drew in my head, and was turning around,\nDown the chimney St. Nicholas came with a bound.\n\nHe was dressed all in fur, from his head to his foot,\nAnd his clothes were all tarnished with ashes and soot;\nA bundle of Toys he had flung on his back,\nAnd he looked like a peddler just opening his pack.\n\n[Illustration]\n\nHis eyes--how they twinkled! his dimples how merry!\nHis cheeks were like roses, his nose like a cherry!\nHis droll little mouth was drawn up like a bow,\nAnd the beard of his chin was as white as the snow;\n\n[Illustration]\n\nThe stump of a pipe he held tight in his teeth,\nAnd the smoke it encircled his head like a wreath;\nHe had a broad face and a little round belly,\nThat shook when he laughed, like a bowlful of jelly.\n\n[Illustration]\n\nHe was chubby and plump, a right jolly old elf,\nAnd I laughed when I saw him, in spite of myself;\nA wink of his eye and a twist of his head,\nSoon gave me to know I had nothing to dread;\n\n[Illustration]\n\nHe spoke not a word, but went straight to his work,\nAnd filled all the stockings; then turned with a jerk,\nAnd laying his finger aside of his nose,\nAnd giving a nod, up the chimney he rose;\n\n[Illustration]\n\nHe sprang to his sleigh, to his team gave a whistle,\nAnd away they all flew like the down of a thistle.\nBut I heard him exclaim, ere he drove out of sight,\n_\"Happy Christmas to all, and to all a good-night.\"_\n\n[Illustration]\n\n[Illustration]", "title": "Twas the Night before Christmas: A Visit from St. Nicholas"}