{"summary": "\n\"The Raven\" follows an unnamed narrator on a dreary night in December who sits reading \"forgotten lore\" by a dying fire  as a way to forget the death of his beloved Lenore. A \"tapping at [his] chamber door\" reveals nothing, but excites his soul to \"burning\". The tapping is repeated, slightly louder, and he realizes it is coming from his window. When he goes to investigate, a raven flutters into his chamber. Paying no attention to the man, the raven perches on a bust of Pallas above the door.\nAmused by the raven's comically serious disposition, the man asks that the bird tell him its name. The raven's only answer is \"Nevermore\". The narrator is surprised that the raven can talk, though at this point it has said nothing further. The narrator remarks to himself that his \"friend\" the raven will soon fly out of his life, just as \"other friends have flown before\" along with his previous hopes. As if answering, the raven responds again with \"Nevermore\". The narrator reasons that the bird learned the word \"Nevermore\" from some \"unhappy master\" and that it is the only word it knows.\nEven so, the narrator pulls his chair directly in front of the raven, determined to learn more about it. He thinks for a moment in silence, and his mind wanders back to his lost Lenore. He thinks the air grows denser and feels the presence of angels, and wonders if God is sending him a sign that he is to forget Lenore. The bird again replies in the negative, suggesting that he can never be free of his memories. The narrator becomes angry, calling the raven a \"thing of evil\" and a \"prophet\". Finally, he asks the raven whether he will be reunited with Lenore in Heaven. When the raven responds with its typical \"Nevermore\", he is enraged, and, calling it a liar, commands the bird to return to the \"Plutonian shore\",—but it does not move. Presumably at the time of the poem's recitation by the narrator, the raven \"still is sitting\" on the bust of Pallas. The narrator's final admission is that his soul is trapped beneath the raven's shadow and shall be lifted \"Nevermore\".\n\n", "full_text": "Transcriber's Notes:\n\nIn the List of Illustrations I restored a missing single quote after \"Lenore!\":\n  \"'Wretch,' I cried, 'thy God hath lent thee--by these angels he hath sent thee\n  Respite--respite and nepenthe from thy memories of Lenore!'\"\n\nThe List of Illustrations uses 'visitor' where the poem and the actual\nillustration use 'visiter'.\n\n\n       *       *       *       *       *\n\n\n\n\nTHE RAVEN\n\nBY\nEDGAR ALLAN POE\n\nILLUSTRATED\nBY GUSTAVE DORE\n\n[Illustration]\n\nWITH COMMENT BY EDMUND C. STEDMAN\n\nNEW YORK\n\nHARPER & BROTHERS, PUBLISHERS, FRANKLIN SQUARE\n1884\n\n\n\n\nEntered according to Act of Congress, in the year 1883, by\nHARPER & BROTHERS,\nIn the Office of the Librarian of Congress, at Washington.\n\n_All rights reserved._\n\n\n\n\nLIST OF ILLUSTRATIONS\nWITH NAMES OF ENGRAVERS\n\nTitle-page, designed by Elihu Vedder.       _Frederick Juengling._\n\n\"Nevermore.\"                         _H. Claudius, G.J. Buechner._\n\nANANKE.                                             _H. Claudius._\n\n\"Once upon a midnight dreary, while I pondered, weak and weary,\nOver many a quaint and curious volume of forgotten lore.\"\n                                                    _R.A. Muller._\n\n\"Ah, distinctly I remember, it was in the bleak December,\nAnd each separate dying ember wrought its ghost upon the floor.\"\n                                                    _R.G. Tietze._\n\n\"Eagerly I wished the morrow; vainly I had sought to borrow\nFrom my books surcease of sorrow--sorrow for the lost Lenore.\"\n                                                    _H. Claudius._\n\n\"Sorrow for the lost Lenore.\"                     _W. Zimmermann._\n\n\"For the rare and radiant maiden whom the angels name Lenore--\n                                          Nameless here for evermore.\"\n                                            _Frederick Juengling._\n\n\"''T is some visitor entreating entrance at my chamber door--\nSome late visitor entreating entrance at my chamber door.'\"\n                                                  _W. Zimmermann._\n\n   --\"Here I opened wide the door;--\nDarkness there, and nothing more.\"                  _H. Claudius._\n\n\"Doubting, dreaming dreams no mortal ever dared to dream before.\"\n                                                      _F.S. King._\n\n\"'Surely,' said I, 'surely that is something at my window lattice;\nLet me see, then, what thereat is, and this mystery explore.'\"\n                                            _Frederick Juengling._\n\n\"Open here I flung the shutter.\"                     _T. Johnson._\n\n             --\"A stately Raven of the saintly days of yore.\nNot the least obeisance made he; not a minute stopped or stayed he.\"\n                                                 _R. Staudenbaur._\n\n\"Perched upon a bust of Pallas just above my chamber door--\n                                          Perched, and sat, and nothing more.\"\n                                                    _R.G. Tietze._\n\n\"Wandering from the Nightly shore.\" _Frederick Juengling._\n\n\"Till I scarcely more than muttered, 'Other friends have flown before--\nOn the morrow _he_ will leave me, as my hopes have flown before.'\"\n                                                   _Frank French._\n\n\"Then, upon the velvet sinking, I betook myself to linking\nFancy unto fancy.\"                                 _R. Schelling._\n\n\"But whose velvet violet lining with the lamplight gloating o'er\n                                          _She_ shall press, ah, nevermore!\"\n                                                  _George Kruell._\n\n\"'Wretch,' I cried, 'thy God hath lent thee--by these angels he hath sent thee\nRespite--respite and nepenthe from thy memories of Lenore!'\"\n                                               _Victor Bernstrom._\n\n\"On this home by Horror haunted.\"                _R. Staudenbaur._\n\n                            \"'Tell me truly, I implore--\nIs there--_is_ there balm in Gilead?--tell me--tell me, I implore!'\"\n                                                  _W. Zimmermann._\n\n\"'Tell this soul with sorrow laden if, within the distant Aidenn,\nIt shall clasp a sainted maiden whom the angels name Lenore.'\"\n                                                      _F.S. King._\n\n\"'Be that word our sign of parting, bird or fiend!' I shrieked, upstarting.\"\n                                                  _W. Zimmermann._\n\n\"'Get thee back into the tempest and the Night's Plutonian shore!'\"\n                                                  _Robert Hoskin._\n\n\"And my soul from out that shadow that lies floating on the floor\n                                          Shall be lifted--nevermore!\"\n                                                    _R.G. Tietze._\n\nThe secret of the Sphinx.                        _R. Staudenbaur._\n\n\n\n\nCOMMENT ON THE POEM.\n\n\nThe secret of a poem, no less than a jest's prosperity, lies in the ear of\nhim that hears it. Yield to its spell, accept the poet's mood: this, after\nall, is what the sages answer when you ask them of its value. Even though\nthe poet himself, in his other mood, tell you that his art is but sleight\nof hand, his food enchanter's food, and offer to show you the trick of\nit,--believe him not. Wait for his prophetic hour; then give yourself to\nhis passion, his joy or pain. \"We are in Love's hand to-day!\" sings\nGautier, in Swinburne's buoyant paraphrase,--and from morn to sunset we are\nwafted on the violent sea: there is but one love, one May, one flowery\nstrand. Love is eternal, all else unreal and put aside. The vision has an\nend, the scene changes; but we have gained something, the memory of a\ncharm. As many poets, so many charms. There is the charm of Evanescence,\nthat which lends to supreme beauty and grace an aureole of Pathos. Share\nwith Landor his one \"night of memories and of sighs\" for Rose Aylmer, and\nyou have this to the full.\n\nAnd now take the hand of a new-world minstrel, strayed from some proper\nhabitat to that rude and dissonant America which, as Baudelaire saw, \"was\nfor Poe only a vast prison through which he ran, hither and thither, with\nthe feverish agitation of a being created to breathe in a purer world,\" and\nwhere \"his interior life, spiritual as a poet, spiritual even as a\ndrunkard, was but one perpetual effort to escape the influence of this\nantipathetical atmosphere.\" Clasp the sensitive hand of a troubled singer\ndreeing thus his weird, and share with him the clime in which he\nfound,--never throughout the day, always in the night,--if not the Atlantis\nwhence he had wandered, at least a place of refuge from the bounds in which\nby day he was immured.\n\nTo one land only he has power to lead you, and for one night only can you\nshare his dream. A tract of neither Earth nor Heaven: \"No-man's-land,\" out\nof Space, out of Time. Here are the perturbed ones, through whose eyes,\nlike those of the Cenci, the soul finds windows though the mind is dazed;\nhere spirits, groping for the path which leads to Eternity, are halted and\ndelayed. It is the limbo of \"planetary souls,\" wherein are all moonlight\nuncertainties, all lost loves and illusions. Here some are fixed in trance,\nthe only respite attainable; others\n\n         \"move fantastically\n    To a discordant melody:\"\n\nwhile everywhere are\n\n    \"Sheeted Memories of the Past--\n    Shrouded forms that start and sigh\n    As they pass the wanderer by.\"\n\nSuch is the land, and for one night we enter it,--a night of astral phases\nand recurrent chimes. Its monodies are twelve poems, whose music strives to\nchange yet ever is the same. One by one they sound, like the chiming of the\nbrazen and ebony clock, in \"The Masque of the Red Death,\" which made the\nwaltzers pause with \"disconcert and tremulousness and meditation,\" as often\nas the hour came round.\n\nOf all these mystical cadences, the plaint of _The Raven_, vibrating\nthrough the portal, chiefly has impressed the outer world. What things go\nto the making of a poem,--and how true in this, as in most else, that race\nwhich named its bards \"the makers\"? A work is called out of the void. Where\nthere was nothing, it remains,--a new creation, part of the treasure of\nmankind. And a few exceptional lyrics, more than others that are equally\ncreative, compel us to think anew how bravely the poet's pen turns things\nunknown\n\n          \"to shapes, and gives to airy nothing\n    A local habitation, and a name.\"\n\nEach seems without a prototype, yet all fascinate us with elements wrested\nfrom the shadow of the Supernatural. Now the highest imagination is\nconcerned about the soul of things; it may or may not inspire the Fantasy\nthat peoples with images the interlunar vague. Still, one of these lyrics,\nin its smaller way, affects us with a sense of uniqueness, as surely as the\nsublimer works of a supernatural cast,--Marlowe's \"Faustus,\" the \"Faust\" of\nGoethe, \"Manfred,\" or even those ethereal masterpieces, \"The Tempest\" and\n\"A Midsummer Night's Dream.\" More than one, while otherwise unique, has\nsome burden or refrain which haunts the memory,--once heard, never\nforgotten, like the tone of a rarely used but distinctive organ-stop.\nNotable among them is Buerger's \"Lenore,\" that ghostly and resonant ballad,\nthe lure and foil of the translators. Few will deny that Coleridge's\nwondrous \"Rime of the Ancient Mariner\" stands at their very head. \"Le\nJuif-Errant\" would have claims, had Beranger been a greater poet; and, but\nfor their remoteness from popular sympathy, \"The Lady of Shalott\" and \"The\nBlessed Damozel\" might be added to the list. It was given to Edgar Allan\nPoe to produce two lyrics, \"The Bells\" and _The Raven_, each of which,\nalthough perhaps of less beauty than those of Tennyson and Rossetti, is a\nunique. \"Ulalume,\" while equally strange and imaginative, has not the\nuniversal quality that is a portion of our test.\n\n_The Raven_ in sheer poetical constituents falls below such pieces as \"The\nHaunted Palace,\" \"The City in the Sea,\" \"The Sleeper,\" and \"Israfel.\" The\nwhole of it would be exchanged, I suspect, by readers of a fastidious cast,\nfor such passages as these:\n\n    \"Around, by lifting winds forgot,\n    Resignedly beneath the sky\n    The melancholy waters lie.\n\n    No rays from the holy heaven come down\n    On the long night-time of that town;\n    But light from out the lurid sea\n    Streams up the turrets silently--\n\n           * * *\n\n    Up many and many a marvellous shrine\n    Whose wreathed friezes intertwine\n    The viol, the violet, and the vine.\n\n           * * *\n\n    No swellings tell that winds may be\n    Upon some far-off happier sea--\n    No heavings hint that winds have been\n    On seas less hideously serene.\"\n\nIt lacks the aerial melody of the poet whose heart-strings are a lute:\n\n    \"And they say (the starry choir\n      And the other listening things)\n    That Israfeli's fire\n    Is owing to that lyre\n      By which he sits and sings--\n    The trembling living wire\n      Of those unusual strings.\"\n\nBut _The Raven_, like \"The Bells\" and \"Annabel Lee,\" commends itself to the\nmany and the few. I have said elsewhere that Poe's rarer productions seemed\nto me \"those in which there is the appearance, at least, of\nspontaneity,--in which he yields to his feelings, while dying falls and\ncadences most musical, most melancholy, come from him unawares.\" This is\nstill my belief; and yet, upon a fresh study of this poem, it impresses me\nmore than at any time since my boyhood. Close acquaintance tells in favor\nof every true work of art. Induce the man, who neither knows art nor cares\nfor it, to examine some poem or painting, and how soon its force takes hold\nof him! In fact, he will overrate the relative value of the first good work\nby which his attention has been fairly caught. _The Raven_, also, has\nconsistent qualities which even an expert must admire. In no other of its\nauthor's poems is the motive more palpably defined. \"The Haunted Palace\" is\njust as definite to the select reader, but Poe scarcely would have taken\nthat subtle allegory for bald analysis. _The Raven_ is wholly occupied with\nthe author's typical theme--the irretrievable loss of an idolized and\nbeautiful woman; but on other grounds, also, the public instinct is correct\nin thinking it his representative poem.\n\nA man of genius usually gains a footing with the success of some one\neffort, and this is not always his greatest. Recognition is the more\ninstant for having been postponed. He does not acquire it, like a miser's\nfortune, coin after coin, but \"not at all or all in all.\" And thus with\nother ambitions: the courtier, soldier, actor,--whatever their parts,--each\ncounts his triumph from some lucky stroke. Poe's Raven, despite augury, was\nfor him \"the bird that made the breeze to blow.\" The poet settled in\nNew-York, in the winter of 1844-'45, finding work upon Willis's paper, \"The\nEvening Mirror,\" and eking out his income by contributions elsewhere. For\nsix years he had been an active writer, and enjoyed a professional\nreputation; was held in both respect and misdoubt, and was at no loss for\nhis share of the ill-paid journalism of that day. He also had done much of\nhis very best work,--such tales as \"Ligeia\" and \"The Fall of the House of\nUsher,\" (the latter containing that mystical counterpart, in verse, of\nElihu Vedder's \"A Lost Mind,\") such analytic feats as \"The Gold Bug\" and\n\"The Mystery of Marie Roget.\" He had made proselytes abroad, and gained a\nlasting hold upon the French mind. He had learned his own power and\nweakness, and was at his prime, and not without a certain reputation. But\nhe had written nothing that was on the tongue of everybody. To rare and\ndelicate work some popular touch must be added to capture the general\naudience of one's own time.\n\nThrough the industry of Poe's successive biographers, the hit made by _The\nRaven_ has become an oft-told tale. The poet's young wife, Virginia, was\nfading before his eyes, but lingered for another year within death's\nshadow. The long, low chamber in the house near the Bloomingdale Road is\nas famous as the room where Rouget de l'Isle composed the Marseillaise.\nAll have heard that the poem, signed \"Quarles,\" appeared in the \"American\nReview,\" with a pseudo-editorial comment on its form; that Poe received ten\ndollars for it; that Willis, the kindest and least envious of fashionable\narbiters, reprinted it with a eulogy that instantly made it town-talk. All\ndoubt of its authorship was dispelled when Poe recited it himself at a\nliterary gathering, and for a time he was the most marked of American\nauthors. The hit stimulated and encouraged him. Like another and prouder\nsatirist, he too found \"something of summer\" even \"in the hum of insects.\"\nSorrowfully enough, but three years elapsed,--a period of influence, pride,\nanguish, yet always of imaginative or critical labor,--before the final\ndefeat, before the curtain dropped on a life that for him was in truth a\ntragedy, and he yielded to \"the Conqueror Worm.\"\n\n\"The American Review: A Whig Journal\" was a creditable magazine for the\ntime, double-columned, printed on good paper with clear type, and\nillustrated by mezzotint portraits. Amid much matter below the present\nstandard, it contained some that any editor would be glad to receive. The\ninitial volume, for 1845, has articles by Horace Greeley, Donald Mitchell,\nWalter Whitman, Marsh, Tuckerman, and Whipple. Ralph Hoyt's quaint poem,\n\"Old,\" appeared in this volume. And here are three lyrics by Poe: \"The City\nin the Sea,\" \"The Valley of Unrest,\" and _The Raven_. Two of these were\nbuilt up,--such was his way,--from earlier studies, but the last-named came\nout as if freshly composed, and almost as we have it now. The statement\nthat it was not afterward revised is erroneous. Eleven trifling changes\nfrom the magazine-text appear in _The Raven and Other Poems_, 1845, a book\nwhich the poet shortly felt encouraged to offer the public. These are\nmostly changes of punctuation, or of single words, the latter kind made to\nheighten the effect of alliteration. In Mr. Lang's pretty edition of Poe's\nverse, brought out in the \"Parchment Library,\" he has shown the instinct of\na scholar, and has done wisely, in going back to the text in the volume\njust mentioned, as given in the London issue of 1846. The \"standard\"\nGriswold collection of the poet's works abounds with errors. These have\nbeen repeated by later editors, who also have made errors of their own. But\nthe text of _The Raven_, owing to the requests made to the author for\nmanuscript copies, was still farther revised by him; in fact, he printed it\nin Richmond, just before his death, with the poetic substitution of\n\"seraphim whose foot-falls\" for \"angels whose faint foot-falls,\" in the\nfourteenth stanza. Our present text, therefore, while substantially that of\n1845, is somewhat modified by the poet's later reading, and is, I think,\nthe most correct and effective version of this single poem. The most\nradical change from the earliest version appeared, however, in the volume\nin 1845; the eleventh stanza originally having contained these lines,\nfaulty in rhyme and otherwise a blemish on the poem:\n\n    \"Caught from some unhappy master, whom unmerciful Disaster\n    Followed fast and followed faster--so, when Hope he would adjure,\n    Stern Despair returned, instead of the sweet Hope he dared adjure--\n                                          That sad answer, 'Nevermore!'\"\n\nIt would be well if other, and famous, poets could be as sure of making\ntheir changes always improvements. Poe constantly rehandled his scanty show\nof verse, and usually bettered it. _The Raven_ was the first of the few\npoems which he nearly brought to completion before printing. It may be that\nthose who care for poetry lost little by his death. Fluent in prose, he\nnever wrote verse for the sake of making a poem. When a refrain of image\nhaunted him, the lyric that resulted was the inspiration, as he himself\nsaid, of a passion, not of a purpose. This was at intervals so rare as\nalmost to justify the Fairfield theory that each was the product of a\nnervous crisis.\n\nWhat, then, gave the poet his clue to _The Raven_? From what misty\nfoundation did it rise slowly to a music slowly breathed? As usual, more\nthan one thing went to the building of so notable a poem. Considering the\nlonger sermons often preached on brief and less suggestive texts, I hope\nnot to be blamed for this discussion of a single lyric,--especially one\nwhich an artist like Dore has made the subject of prodigal illustration.\nUntil recently I had supposed that this piece, and a few which its author\ncomposed after its appearance, were exceptional in not having grown from\ngerms in his boyish verse. But Mr. Fearing Gill has shown me some\nunpublished stanzas by Poe, written in his eighteenth year, and entitled,\n\"The Demon of the Fire.\" The manuscript appears to be in the poet's early\nhandwriting, and its genuineness is vouched for by the family in whose\npossession it has remained for half a century. Besides the plainest germs\nof \"The Bells\" and \"The Haunted Palace\" it contains a few lines somewhat\nsuggestive of the opening and close of _The Raven_. As to the rhythm of our\npoem, a comparison of dates indicates that this was influenced by the\nrhythm of \"Lady Geraldine's Courtship.\" Poe was one of the first to honor\nMiss Barrett's genius; he inscribed his collected poems to her as \"the\nnoblest of her sex,\" and was in sympathy with her lyrical method. The\nlines from her love-poem,\n\n    \"With a murmurous stir uncertain, in the air, the purple curtain\n    Swelleth in and swelleth out around her motionless pale brows,\"\n\nfound an echo in these:\n\n    \"And the silken sad uncertain rustling of each purple curtain\n    Thrilled me--filled me with fantastic terrors never felt before.\"\n\nHere Poe assumed a privilege for which he roughly censured Longfellow, and\nwhich no one ever sought on his own premises without swift detection and\nchastisement. In melody and stanzaic form, we shall see that the two poems\nare not unlike, but in motive they are totally distinct. The generous\npoetess felt nothing but the true originality of the poet. \"This vivid\nwriting!\" she exclaimed,--\"this power which is felt!... Our great poet, Mr.\nBrowning, author of 'Paracelsus,' &c., is enthusiastic in his admiration of\nthe rhythm.\" Mr. Ingram, after referring to \"Lady Geraldine,\" cleverly\npoints out another source from which Poe may have caught an impulse. In\n1843, Albert Pike, the half-Greek, half-frontiersman, poet of Arkansas, had\nprinted in \"The New Mirror,\" for which Poe then was writing, some verses\nentitled \"Isadore,\" but since revised by the author and called \"The Widowed\nHeart.\" I select from Mr. Pike's revision the following stanza, of which\nthe main features correspond with the original version:\n\n    \"Restless I pace our lonely rooms, I play our songs no more,\n    The garish sun shines flauntingly upon the unswept floor;\n    The mocking-bird still sits and sings, O melancholy strain!\n    For my heart is like an autumn-cloud that overflows with rain;\n                            Thou art lost to me forever, Isadore!\"\n\nHere we have a prolonged measure, a similarity of refrain, and the\nintroduction of a bird whose song enhances sorrow. There are other trails\nwhich may be followed by the curious; notably, a passage which Mr. Ingram\nselects from Poe's final review of \"Barnaby Rudge\":\n\n     \"The raven, too, * * * might have been made, more than we now see\n     it, a portion of the conception of the fantastic Barnaby. * * * Its\n     character might have performed, in regard to that of the idiot,\n     much the same part as does, in music, the accompaniment in respect\n     to the air.\"\n\nNevertheless, after pointing out these germs and resemblances, the value of\nthis poem still is found in its originality. The progressive music, the\nscenic detail and contrasted light and shade,--above all, the spiritual\npassion of the nocturn, make it the work of an informing genius. As for the\ngruesome bird, he is unlike all the other ravens of his clan, from the \"twa\ncorbies\" and \"three ravens\" of the balladists to Barnaby's rumpled \"Grip.\"\nHere is no semblance of the cawing rook that haunts ancestral turrets and\ntreads the field of heraldry; no boding phantom of which Tickell sang that,\nwhen,\n\n            \"shrieking at her window thrice,\n        The raven flap'd his wing,\n    Too well the love-lorn maiden knew\n        The solemn boding sound.\"\n\nPoe's raven is a distinct conception; the incarnation of a mourner's agony\nand hopelessness; a sable embodied Memory, the abiding chronicler of doom,\na type of the Irreparable. Escaped across the Styx, from \"the Night's\nPlutonian shore,\" he seems the imaged soul of the questioner himself,--of\nhim who can not, will not, quaff the kind nepenthe, because the memory of\nLenore is all that is left him, and with the surcease of his sorrow even\nthat would be put aside.\n\n_The Raven_ also may be taken as a representative poem of its author, for\nits exemplification of all his notions of what a poem should be. These are\nfound in his essays on \"The Poetic Principle,\" \"The Rationale of Verse,\"\nand \"The Philosophy of Composition.\" Poe declared that \"in Music, perhaps,\nthe soul most nearly attains the great end for which, when inspired by the\nPoetic Sentiment, it struggles--the creation of supernal Beauty.... Verse\ncannot be better designated than as an inferior or less capable music\"; but\nagain, verse which is really the \"Poetry of Words\" is \"The Rhythmical\nCreation of Beauty,\"--this and nothing more. The _tone_ of the highest\nBeauty is one of Sadness. The most melancholy of topics is Death. This must\nbe allied to Beauty. \"The death, then, of a beautiful woman is,\nunquestionably, the most poetical topic in the world,--and equally is it\nbeyond doubt that the lips best suited for such a topic are those of a\nbereaved lover.\" These last expressions are quoted from Poe's whimsical\nanalysis of this very poem, but they indicate precisely the general range\nof his verse. The climax of \"The Bells\" is the muffled monotone of ghouls,\nwho glory in weighing down the human heart. \"Lenore,\" _The Raven_, \"The\nSleeper,\" \"To One in Paradise,\" and \"Ulalume\" form a tenebrose\nsymphony,--and \"Annabel Lee,\" written last of all, shows that one theme\npossessed him to the end. Again, these are all nothing if not musical, and\nsome are touched with that quality of the Fantastic which awakes the sense\nof awe, and adds a new fear to agony itself. Through all is dimly outlined,\nbeneath a shadowy pall, the poet's ideal love,--so often half-portrayed\nelsewhere,--the entombed wife of Usher, the Lady Ligeia, in truth the\ncounterpart of his own nature. I suppose that an artist's love for one \"in\nthe form\" never can wholly rival his devotion to some ideal. The woman near\nhim must exercise her spells, be all by turns and nothing long, charm him\nwith infinite variety, or be content to forego a share of his allegiance.\nHe must be lured by the Unattainable, and this is ever just beyond him in\nhis passion for creative art.\n\nPoe, like Hawthorne, came in with the decline of the Romantic school, and\nnone delighted more than he to laugh at its calamity. Yet his heart was\nwith the romancers and their Oriental or Gothic effects. His invention, so\nrich in the prose tales, seemed to desert him when he wrote verse; and his\njudgment told him that long romantic poems depend more upon incident than\ninspiration,--and that, to utter the poetry of romance, lyrics would\nsuffice. Hence his theory, clearly fitted to his own limitations, that \"a\n'long poem' is a flat contradiction in terms.\" The components of _The\nRaven_ are few and simple: a man, a bird, and the phantasmal memory at a\nwoman. But the piece affords a fine display of romantic material. What have\nwe? The midnight; the shadowy chamber with its tomes of forgotten lore; the\nstudent,--a modern Hieronymus; the raven's tap on the casement; the wintry\nnight and dying fire; the silken wind-swept hangings; the dreams and vague\nmistrust of the echoing darkness; the black, uncanny bird upon the pallid\nbust; the accessories of violet velvet and the gloating lamp. All this\nstage effect of situation, light, color, sound, is purely romantic, and\neven melodramatic, but of a poetic quality that melodrama rarely exhibits,\nand thoroughly reflective of the poet's \"eternal passion, eternal pain.\"\n\nThe rhythmical structure of _The Raven_ was sure to make an impression.\nRhyme, alliteration, the burden, the stanzaic form, were devised with\nsingular adroitness. Doubtless the poet was struck with the aptness of Miss\nBarrett's musical trochaics, in \"eights,\" and especially by the arrangement\nadopted near the close of \"Lady Geraldine\":\n\n    \"'Eyes,' he said, 'now throbbing through me! Are ye eyes that did undo me?\n    Shining eyes, like antique jewels set in Parian statue-stone!\n    Underneath that calm white forehead, are ye ever burning torrid\n    O'er the desolate sand-desert of my heart and life undone?'\"\n\nHis artistic introduction of a third rhyme in both the second and fourth\nlines, and the addition of a fifth line and a final refrain, made the\nstanza of _The Raven_. The persistent alliteration seems to come without\neffort, and often the rhymes within lines are seductive; while the refrain\nor burden dominates the whole work. Here also he had profited by Miss\nBarrett's study of ballads and romaunts in her own and other tongues. A\n\"refrain\" is the lure wherewith a poet or a musician holds the wandering\near,--the recurrent longing of Nature for the initial strain. I have always\nadmired the beautiful refrains of the English songstress,--\"The\nNightingales, the Nightingales,\" \"Margret, Margret,\" \"My Heart and I,\"\n\"Toll slowly,\" \"The River floweth on,\" \"Pan, Pan is dead,\" etc. She also\nemployed what I term the Repetend, in the use of which Poe has excelled all\npoets since Coleridge thus revived it:\n\n    \"O happy living things! no tongue\n    Their beauty might declare:\n    A spring of love gushed from my heart,\n    And I blessed them unaware:\n    Sure my kind saint took pity on me,\n    And I blessed them unaware.\"\n\nPoe created the fifth line of his stanza for the magic of the repetend. He\nrelied upon it to the uttermost in a few later poems,--\"Lenore,\" \"Annabel\nLee,\" \"Ulalume,\" and \"For Annie.\" It gained a wild and melancholy music, I\nhave thought, from the \"sweet influences,\" of the Afric burdens and\nrepetends that were sung to him in childhood, attuning with their native\nmelody the voice of our Southern poet.\n\n\"The Philosophy of Composition,\" his analysis of _The Raven_, is a\ntechnical dissection of its method and structure. Neither his avowal of\ncold-blooded artifice, nor his subsequent avowal to friends that an\nexposure of this artifice was only another of his intellectual hoaxes, need\nbe wholly credited. If he had designed the complete work in advance, he\nscarcely would have made so harsh a prelude of rattle-pan rhymes to the\ndelicious melody of the second stanza,--not even upon his theory of the\nfantastic. Of course an artist, having perfected a work, sees, like the\nfirst Artist, that it is good, and sees why it is good. A subsequent\nanalysis, coupled with a disavowal of any sacred fire, readily enough may\nbe made. My belief is that the first conception and rough draft of this\npoem came as inspiration always comes; that its author then saw how it\nmight be perfected, giving it the final touches described in his chapter on\nComposition, and that the latter, therefore, is neither wholly false nor\nwholly true. The harm of such analysis is that it tempts a novice to fancy\nthat artificial processes can supersede imagination. The impulse of genius\nis to guard the secrets of its creative hour. Glimpses obtained of the\ntoil, the baffled experiments, which precede a triumph, as in the\nsketch-work of Hawthorne recently brought to light, afford priceless\ninstruction and encouragement to the sincere artist. But one who\nvoluntarily exposes his Muse to the gaze of all comers should recall the\nfate of King Candaules.\n\nThe world still thinks of Poe as a \"luckless man of genius.\" I recently\nheard him mentioned as \"one whom everybody seems chartered to misrepresent,\ndecry or slander.\" But it seems to me that his ill-luck ended with his\npitiable death, and that since then his defence has been persistent, and\nhis fame of as steadfast growth as a suffering and gifted author could pray\nfor in his hopeful hour. Griswold's decrial and slander turned the current\nin his favor. Critics and biographers have come forward with successive\nrefutations, with tributes to his character, with new editions of his\nworks. His own letters and the minute incidents of his career are before\nus; the record, good and bad, is widely known. No appellor has received\nmore tender and forgiving judgement. His mishaps in life belonged to his\nregion and period, perchance still more to his own infirmity of will.\nDoubtless his environment was not one to guard a fine-grained, ill-balanced\nnature from perils without and within. His strongest will, to be lord of\nhimself, gained for him \"that heritage of woe.\" He confessed himself the\nbird's unhappy master, the stricken sufferer of this poem. But his was a\nfull share of that dramatic temper which exults in the presage of its own\ndoom. There is a delight in playing one's high part: we are all gladiators,\ncrying _Ave Imperator!_ To quote Burke's matter of fact: \"In grief the\npleasure is still uppermost, and the affliction we suffer has no\nresemblance to absolute pain, which is always odious, and which we endeavor\nto shake off as soon as possible.\" Poe went farther, and was an artist even\nin the tragedy of his career. If, according to his own belief, sadness and\nthe vanishing of beauty are the highest poetic themes, and poetic feeling\nthe keenest earthly pleasure, then the sorrow and darkness of his broken\nlife were not without their frequent compensation.\n\nIn the following pages, we have a fresh example of an artist's genius\ncharacterizing his interpretation of a famous poem. Gustave Dore, the last\nwork of whose pencil is before us, was not the painter, or even the\ndraughtsman, for realists demanding truth of tone, figure, and perfection.\nSuch matters concerned him less than to make shape and distance, light and\nshade, assist his purpose,--which was to excite the soul, the imagination,\nof the looker on. This he did by arousing our sense of awe, through\nmarvellous and often sublime conceptions of things unutterable and full of\ngloom or glory. It is well said that if his works were not great paintings,\nas pictures they are great indeed. As a \"literary artist,\" and such he was,\nhis force was in direct ratio with the dramatic invention of his author,\nwith the brave audacities of the spirit that kindled his own. Hence his\nsuccess with Rabelais, with \"Le Juif-Errant,\" \"Les Contes Drolatiques,\" and\n\"Don Quixote,\" and hence, conversely, his failure to express the beauty of\nTennyson's Idyls, of \"Il Paradiso,\" of the Hebrew pastorals, and other\ntexts requiring exaltation, or sweetness and repose. He was a born master\nof the grotesque, and by a special insight could portray the spectres of a\nhaunted brain. We see objects as his personages saw them, and with the very\neyes of the Wandering Jew, the bewildered Don, or the goldsmith's daughter\nwhose fancy so magnifies the King in the shop on the Pont-au-Change. It was\nin the nature of things that he should be attracted to each masterpiece of\nverse or prose that I have termed unique. The lower kingdoms were called\ninto his service; his rocks, trees and mountains, the sky itself, are\nanimate with motive and diablerie. Had he lived to illustrate Shakespeare,\nwe should have seen a remarkable treatment of Caliban, the Witches, the\nstorm in \"Lear\"; but doubtless should have questioned his ideals of Imogen\nor Miranda. Beauty pure and simple, and the perfect excellence thereof, he\nrarely seemed to comprehend.\n\nYet there is beauty in his designs for the \"Ancient Mariner,\" unreal as\nthey are, and a consecutiveness rare in a series by Dore. The Rime afforded\nhim a prolonged story, with many shiftings of the scene. In _The Raven_\nsound and color preserve their monotone and we have no change of place or\noccasion. What is the result? Dore proffers a series of variations upon the\ntheme as he conceived it, \"the enigma of death and the hallucination of an\ninconsolable soul.\" In some of these drawings his faults are evident;\nothers reveal his powerful originality, and the best qualities in which, as\na draughtsman, he stood alone. Plainly there was something in common\nbetween the working moods of Poe and Dore. This would appear more clearly\nhad the latter tried his hand upon the \"Tales of the Grotesque and\nArabesque.\" Both resorted often to the elf-land of fantasy and romance. In\nmelodramatic feats they both, through their command of the supernatural,\navoided the danger-line between the ideal and the absurd. Poe was the truer\nworshipper of the Beautiful; his love for it was a consecrating passion,\nand herein he parts company with his illustrator. Poet or artist, Death at\nlast transfigures all: within the shadow of his sable harbinger, Vedder's\nsymbolic crayon aptly sets them face to face, but enfolds them with the\nmantle of immortal wisdom and power. An American woman has wrought the\nimage of a star-eyed Genius with the final torch, the exquisite semblance\nof one whose vision beholds, but whose lips may not utter, the mysteries of\na land beyond \"the door of a legended tomb.\"\n\nEDMUND C. STEDMAN.\n\n\n\n\nTHE POEM.\n\n\n\n\n[Illustration]\n\n\n\n\nTHE RAVEN.\n\n\nOnce upon a midnight dreary, while I pondered, weak and weary,\nOver many a quaint and curious volume of forgotten lore,\nWhile I nodded, nearly napping, suddenly there came a tapping,\nAs of some one gently rapping, rapping at my chamber door.\n\"'T is some visiter,\" I muttered, \"tapping at my chamber door--\n                                          Only this, and nothing more.\"\n\nAh, distinctly I remember it was in the bleak December,\nAnd each separate dying ember wrought its ghost upon the floor.\nEagerly I wished the morrow:--vainly I had sought to borrow\nFrom my books surcease of sorrow--sorrow for the lost Lenore--\nFor the rare and radiant maiden whom the angels name Lenore--\n                                          Nameless here for evermore.\n\nAnd the silken sad uncertain rustling of each purple curtain\nThrilled me--filled me with fantastic terrors never felt before;\nSo that now, to still the beating of my heart, I stood repeating\n\"'T is some visiter entreating entrance at my chamber door\nSome late visiter entreating entrance at my chamber door;--\n                                          This it is, and nothing more.\"\n\nPresently my soul grew stronger; hesitating then no longer,\n\"Sir,\" said I, \"or Madam, truly your forgiveness I implore;\nBut the fact is I was napping, and so gently you came rapping,\nAnd so faintly you came tapping, tapping at my chamber door,\nThat I scarce was sure I heard you\"--here I opened wide the door;--\n                                          Darkness there, and nothing more.\n\nDeep into that darkness peering, long I stood there wondering, fearing,\nDoubting, dreaming dreams no mortal ever dared to dream before;\nBut the silence was unbroken, and the darkness gave no token,\nAnd the only word there spoken was the whispered word, \"Lenore!\"\nThis I whispered, and an echo murmured back the word, \"Lenore!\"\n                                          Merely this and nothing more.\n\nBack into the chamber turning, all my soul within me burning,\nSoon again I heard a tapping, somewhat louder than before.\n\"Surely,\" said I, \"surely that is something at my window lattice;\nLet me see, then, what thereat is, and this mystery explore--\nLet my heart be still a moment and this mystery explore;--\n                                          'T is the wind and nothing more!\"\n\nOpen here I flung the shutter, when, with many a flirt and flutter,\nIn there stepped a stately Raven of the saintly days of yore.\nNot the least obeisance made he; not a minute stopped or stayed he;\nBut, with mien of lord or lady, perched above my chamber door--\nPerched upon a bust of Pallas just above my chamber door--\n                                          Perched, and sat, and nothing more.\n\nThen this ebony bird beguiling my sad fancy into smiling,\nBy the grave and stern decorum of the countenance it wore,\n\"Though thy crest be shorn and shaven, thou,\" I said, \"art sure no craven,\nGhastly grim and ancient Raven wandering from the Nightly shore,--\nTell me what thy lordly name is on the Night's Plutonian shore!\"\n                                          Quoth the Raven, \"Nevermore.\"\n\nMuch I marvelled this ungainly fowl to hear discourse so plainly,\nThough its answer little meaning--little relevancy bore;\nFor we cannot help agreeing that no living human being\nEver yet was blessed with seeing bird above his chamber door--\nBird or beast upon the sculptured bust above his chamber door,\n                                          With such name as \"Nevermore.\"\n\nBut the Raven, sitting lonely on the placid bust, spoke only\nThat one word, as if his soul in that one word he did outpour.\nNothing further then he uttered--not a feather then he fluttered--\nTill I scarcely more than muttered, \"Other friends have flown before--\nOn the morrow _he_ will leave me, as my hopes have flown before.\"\n                                          Then the bird said, \"Nevermore.\"\n\nStartled at the stillness broken by reply so aptly spoken,\n\"Doubtless,\" said I, \"what it utters is its only stock and store,\nCaught from some unhappy master whom unmerciful Disaster\nFollowed fast and followed faster till his songs one burden bore--\nTill the dirges of his Hope that melancholy burden bore\n                                          Of 'Never--nevermore.'\"\n\nBut the Raven still beguiling all my sad soul into smiling,\nStraight I wheeled a cushioned seat in front of bird and bust and door;\nThen, upon the velvet sinking, I betook myself to linking\nFancy unto fancy, thinking what this ominous bird of yore--\nWhat this grim, ungainly, ghastly, gaunt and ominous bird of yore\n                                          Meant in croaking \"Nevermore.\"\n\nThis I sat engaged in guessing, but no syllable expressing\nTo the fowl whose fiery eyes now burned into my bosom's core;\nThis and more I sat divining, with my head at ease reclining\nOn the cushion's velvet lining that the lamplight gloated o'er,\nBut whose velvet violet lining with the lamplight gloating o'er\n                                          _She_ shall press, ah, nevermore!\n\nThen, methought, the air grew denser, perfumed from an unseen censer\nSwung by seraphim whose foot-falls tinkled on the tufted floor.\n\"Wretch,\" I cried, \"thy God hath lent thee--by these angels he hath sent thee\nRespite--respite and nepenthe from thy memories of Lenore!\nQuaff, oh quaff this kind nepenthe, and forget this lost Lenore!\"\n                                          Quoth the Raven, \"Nevermore.\"\n\n\"Prophet!\" said I, \"thing of evil!--prophet still, if bird or devil!--\nWhether Tempter sent, or whether tempest tossed thee here ashore,\nDesolate yet all undaunted, on this desert land enchanted--\nOn this home by Horror haunted--tell me truly, I implore--\nIs there--_is_ there balm in Gilead?--tell me--tell me, I implore!\"\n                                          Quoth the Raven, \"Nevermore.\"\n\n\"Prophet!\" said I, \"thing of evil--prophet still, if bird or devil!\nBy that Heaven that bends above, us--by that God we both adore--\nTell this soul with sorrow laden if, within the distant Aidenn,\nIt shall clasp a sainted maiden whom the angels name Lenore--\nClasp a rare and radiant maiden whom the angels name Lenore.\"\n                                          Quoth the Raven, \"Nevermore.\"\n\n\"Be that word our sign of parting, bird or fiend!\" I shrieked, upstarting--\n\"Get thee back into the tempest and the Night's Plutonian shore!\nLeave no black plume as a token of that lie thy soul hath spoken!\nLeave my loneliness unbroken!--quit the bust above my door!\nTake thy beak from out my heart, and take thy form from off my door!\"\n                                          Quoth the Raven, \"Nevermore.\"\n\nAnd the Raven, never flitting, still is sitting, still is sitting\nOn the pallid bust of Pallas just above my chamber door;\nAnd his eyes have all the seeming of a demon's that is dreaming,\nAnd the lamplight o'er him streaming throws his shadow on the floor;\nAnd my soul from out that shadow that lies floating on the floor\n                                          Shall be lifted--nevermore!\n\n\n\n\n[Illustration]\n\n\n    \"Once upon a midnight dreary, while I pondered, weak and weary,\n    Over many a quaint and curious volume of forgotten lore.\"\n\n\n[Illustration]\n\n\n    \"Ah, distinctly I remember it was in the bleak December,\n    And each separate dying ember wrought its ghost upon the floor.\"\n\n\n[Illustration]\n\n\n    \"Eagerly I wished the morrow;--vainly I had sought to borrow\n    From my books surcease of sorrow--sorrow for the lost Lenore.\"\n\n\n[Illustration]\n\n\n\"Sorrow for the lost Lenore.\"\n\n\n[Illustration]\n\n\n    \"For the rare and radiant maiden whom the angels name Lenore--\n                                      Nameless here for evermore.\"\n\n\n[Illustration]\n\n\n    \"'T is some visiter entreating entrance at my chamber door--\n    Some late visiter entreating entrance at my chamber door.\"\n\n\n[Illustration]\n\n\n    \"Here I opened wide the door;--\n                                      Darkness there, and nothing more.\"\n\n\n[Illustration]\n\n\n    \"Doubting, dreaming dreams no mortal ever dared to dream before.\"\n\n\n[Illustration]\n\n\n    \"'Surely,' said I, 'surely that is something at my window lattice;\n    Let me see, then, what thereat is, and this mystery explore.'\"\n\n\n[Illustration]\n\n\n    \"Open here I flung the shutter.\"\n\n\n[Illustration]\n\n\n    ... \"A stately Raven of the saintly days of yore.\n    Not the least obeisance made he; not a minute stopped or stayed he.\"\n\n\n[Illustration]\n\n\n    \"Perched upon a bust of Pallas just above my chamber door--\n                                      Perched, and sat, and nothing more.\"\n\n\n[Illustration]\n\n\n    \"Wandering from the Nightly shore.\"\n\n\n[Illustration]\n\n\n    \"Till I scarcely more than muttered, 'Other friends have flown before--\n    On the morrow _he_ will leave me, as my hopes have flown before.'\"\n\n\n[Illustration]\n\n\n    \"Then, upon the velvet sinking, I betook myself to linking\n    Fancy unto fancy.\"\n\n\n[Illustration]\n\n\n    \"But whose velvet violet lining with the lamplight gloating o'er\n                                      _She_ shall press, ah, nevermore!\"\n\n\n[Illustration]\n\n\n    \"'Wretch,' I cried, 'thy God hath lent thee--by these angels he hath sent thee\n    Respite--respite and nepenthe from thy memories of Lenore!'\"\n\n\n[Illustration]\n\n\n    \"On this home by Horror haunted.\"\n\n\n[Illustration]\n\n\n    ... \"Tell me truly, I implore--\n    Is there--_is_ there balm in Gilead?--tell me--tell me, I implore!\"\n\n\n[Illustration]\n\n\n    \"Tell this soul with sorrow laden if, within the distant Aidenn,\n    It shall clasp a sainted maiden whom the angels name Lenore.\"\n\n\n[Illustration]\n\n\n    \"'Be that word our sign of parting, bird or fiend!' I shrieked, upstarting.\"\n\n\n[Illustration]\n\n\n    \"'Get thee back into the tempest and the Night's Plutonian shore!'\"\n\n\n[Illustration]\n\n\n    \"And my soul from out that shadow that lies floating on the floor\n                                      Shall be lifted--nevermore!\"\n\n\n[Illustration]\n\n\n[Illustration]", "title": "The Raven"}