{"summary": "Set in a rural Russian house, the plot focuses on the romantic and artistic conflicts among an eclectic group of characters. Fading leading lady Irina Arkadina has come to visit her brother Sorin, a retired civil servant in ailing health, with her lover, the successful hack writer Trigorin. Her son, brooding experimental playwright Konstantin Treplev, adores the ingenue Nina, who in turn is mesmerized by Trigorin. Their interactions slowly lead to the moral and spiritual disintegration of each of them and ultimately lead to tragedy.\n\n", "full_text": "THE SEA-GULL\n\n\nby Anton Checkov\n\n\n\nA Play In Four Acts\n\n\n\n\nCHARACTERS\n\nIRINA ABKADINA, an actress\n\nCONSTANTINE TREPLIEFF, her son\n\nPETER SORIN, her brother\n\nNINA ZARIETCHNAYA, a young girl, the daughter of a rich landowner\n\nILIA SHAMRAEFF, the manager of SORIN'S estate\n\nPAULINA, his wife\n\nMASHA, their daughter\n\nBORIS TRIGORIN, an author\n\nEUGENE DORN, a doctor\n\nSIMON MEDVIEDENKO, a schoolmaster\n\nJACOB, a workman\n\nA COOK\n\nA MAIDSERVANT\n\n\n_The scene is laid on SORIN'S estate. Two years elapse between the third\nand fourth acts_.\n\n\n\n\nTHE SEA-GULL\n\n\n\n\nACT I\n\n_The scene is laid in the park on SORIN'S estate. A broad avenue of\ntrees leads away from the audience toward a lake which lies lost in\nthe depths of the park. The avenue is obstructed by a rough stage,\ntemporarily erected for the performance of amateur theatricals, and\nwhich screens the lake from view. There is a dense growth of bushes to\nthe left and right of the stage. A few chairs and a little table are\nplaced in front of the stage. The sun has just set. JACOB and some other\nworkmen are heard hammering and coughing on the stage behind the lowered\ncurtain_.\n\nMASHA and MEDVIEDENKO come in from the left, returning from a walk.\n\nMEDVIEDENKO. Why do you always wear mourning?\n\nMASHA. I dress in black to match my life. I am unhappy.\n\nMEDVIEDENKO. Why should you be unhappy? [Thinking it over] I don't\nunderstand it. You are healthy, and though your father is not rich, he\nhas a good competency. My life is far harder than yours. I only have\ntwenty-three roubles a month to live on, but I don't wear mourning.\n[They sit down].\n\nMASHA. Happiness does not depend on riches; poor men are often happy.\n\nMEDVIEDENKO. In theory, yes, but not in reality. Take my case, for\ninstance; my mother, my two sisters, my little brother and I must all\nlive somehow on my salary of twenty-three roubles a month. We have to\neat and drink, I take it. You wouldn't have us go without tea and sugar,\nwould you? Or tobacco? Answer me that, if you can.\n\nMASHA. [Looking in the direction of the stage] The play will soon begin.\n\nMEDVIEDENKO. Yes, Nina Zarietchnaya is going to act in Treplieff's play.\nThey love one another, and their two souls will unite to-night in the\neffort to interpret the same idea by different means. There is no ground\non which your soul and mine can meet. I love you. Too restless and sad\nto stay at home, I tramp here every day, six miles and back, to be met\nonly by your indifference. I am poor, my family is large, you can have\nno inducement to marry a man who cannot even find sufficient food for\nhis own mouth.\n\nMASHA. It is not that. [She takes snuff] I am touched by your affection,\nbut I cannot return it, that is all. [She offers him the snuff-box] Will\nyou take some?\n\nMEDVIEDENKO. No, thank you. [A pause.]\n\nMASHA. The air is sultry; a storm is brewing for to-night. You do\nnothing but moralise or else talk about money. To you, poverty is the\ngreatest misfortune that can befall a man, but I think it is a thousand\ntimes easier to go begging in rags than to--You wouldn't understand\nthat, though.\n\nSORIN leaning on a cane, and TREPLIEFF come in.\n\nSORIN. For some reason, my boy, country life doesn't suit me, and I am\nsure I shall never get used to it. Last night I went to bed at ten and\nwoke at nine this morning, feeling as if, from oversleep, my brain had\nstuck to my skull. [Laughing] And yet I accidentally dropped off to\nsleep again after dinner, and feel utterly done up at this moment. It is\nlike a nightmare.\n\nTREPLIEFF. There is no doubt that you should live in town. [He catches\nsight of MASHA and MEDVIEDENKO] You shall be called when the play\nbegins, my friends, but you must not stay here now. Go away, please.\n\nSORIN. Miss Masha, will you kindly ask your father to leave the dog\nunchained? It howled so last night that my sister was unable to sleep.\n\nMASHA. You must speak to my father yourself. Please excuse me; I can't\ndo so. [To MEDVIEDENKO] Come, let us go.\n\nMEDVIEDENKO. You will let us know when the play begins?\n\nMASHA and MEDVIEDENKO go out.\n\nSORIN. I foresee that that dog is going to howl all night again. It is\nalways this way in the country; I have never been able to live as I like\nhere. I come down for a month's holiday, to rest and all, and am\nplagued so by their nonsense that I long to escape after the first day.\n[Laughing] I have always been glad to get away from this place, but I\nhave been retired now, and this was the only place I had to come to.\nWilly-nilly, one must live somewhere.\n\nJACOB. [To TREPLIEFF] We are going to take a swim, Mr. Constantine.\n\nTREPLIEFF. Very well, but you must be back in ten minutes.\n\nJACOB. We will, sir.\n\nTREPLIEFF. [Looking at the stage] Just like a real theatre! See,\nthere we have the curtain, the foreground, the background, and all. No\nartificial scenery is needed. The eye travels direct to the lake, and\nrests on the horizon. The curtain will be raised as the moon rises at\nhalf-past eight.\n\nSORIN. Splendid!\n\nTREPLIEFF. Of course the whole effect will be ruined if Nina is late.\nShe should be here by now, but her father and stepmother watch her so\nclosely that it is like stealing her from a prison to get her away from\nhome. [He straightens SORIN'S collar] Your hair and beard are all on\nend. Oughtn't you to have them trimmed?\n\nSORIN. [Smoothing his beard] They are the tragedy of my existence. Even\nwhen I was young I always looked as if I were drunk, and all. Women have\nnever liked me. [Sitting down] Why is my sister out of temper?\n\nTREPLIEFF. Why? Because she is jealous and bored. [Sitting down beside\nSORIN] She is not acting this evening, but Nina is, and so she has set\nherself against me, and against the performance of the play, and against\nthe play itself, which she hates without ever having read it.\n\nSORIN. [Laughing] Does she, really?\n\nTREPLIEFF. Yes, she is furious because Nina is going to have a\nsuccess on this little stage. [Looking at his watch] My mother is a\npsychological curiosity. Without doubt brilliant and talented, capable\nof sobbing over a novel, of reciting all Nekrasoff's poetry by heart,\nand of nursing the sick like an angel of heaven, you should see what\nhappens if any one begins praising Duse to her! She alone must be\npraised and written about, raved over, her marvellous acting in \"La Dame\naux Camelias\" extolled to the skies. As she cannot get all that rubbish\nin the country, she grows peevish and cross, and thinks we are all\nagainst her, and to blame for it all. She is superstitious, too. She\ndreads burning three candles, and fears the thirteenth day of the month.\nThen she is stingy. I know for a fact that she has seventy thousand\nroubles in a bank at Odessa, but she is ready to burst into tears if you\nask her to lend you a penny.\n\nSORIN. You have taken it into your head that your mother dislikes your\nplay, and the thought of it has excited you, and all. Keep calm; your\nmother adores you.\n\nTREPLIEFF. [Pulling a flower to pieces] She loves me, loves me not;\nloves--loves me not; loves--loves me not! [Laughing] You see, she\ndoesn't love me, and why should she? She likes life and love and gay\nclothes, and I am already twenty-five years old; a sufficient reminder\nto her that she is no longer young. When I am away she is only\nthirty-two, in my presence she is forty-three, and she hates me for\nit. She knows, too, that I despise the modern stage. She adores it, and\nimagines that she is working on it for the benefit of humanity and her\nsacred art, but to me the theatre is merely the vehicle of convention\nand prejudice. When the curtain rises on that little three-walled room,\nwhen those mighty geniuses, those high-priests of art, show us people in\nthe act of eating, drinking, loving, walking, and wearing their coats,\nand attempt to extract a moral from their insipid talk; when playwrights\ngive us under a thousand different guises the same, same, same old\nstuff, then I must needs run from it, as Maupassant ran from the Eiffel\nTower that was about to crush him by its vulgarity.\n\nSORIN. But we can't do without a theatre.\n\nTREPLIEFF. No, but we must have it under a new form. If we can't do\nthat, let us rather not have it at all. [Looking at his watch] I love my\nmother, I love her devotedly, but I think she leads a stupid life. She\nalways has this man of letters of hers on her mind, and the newspapers\nare always frightening her to death, and I am tired of it. Plain, human\negoism sometimes speaks in my heart, and I regret that my mother is\na famous actress. If she were an ordinary woman I think I should be\na happier man. What could be more intolerable and foolish than my\nposition, Uncle, when I find myself the only nonentity among a crowd of\nher guests, all celebrated authors and artists? I feel that they only\nendure me because I am her son. Personally I am nothing, nobody. I\npulled through my third year at college by the skin of my teeth, as they\nsay. I have neither money nor brains, and on my passport you may read\nthat I am simply a citizen of Kiev. So was my father, but he was\na well-known actor. When the celebrities that frequent my mother's\ndrawing-room deign to notice me at all, I know they only look at me\nto measure my insignificance; I read their thoughts, and suffer from\nhumiliation.\n\nSORIN. Tell me, by the way, what is Trigorin like? I can't understand\nhim, he is always so silent.\n\nTREPLIEFF. Trigorin is clever, simple, well-mannered, and a little, I\nmight say, melancholic in disposition. Though still under forty, he is\nsurfeited with praise. As for his stories, they are--how shall I put\nit?--pleasing, full of talent, but if you have read Tolstoi or Zola you\nsomehow don't enjoy Trigorin.\n\nSORIN. Do you know, my boy, I like literary men. I once passionately\ndesired two things: to marry, and to become an author. I have succeeded\nin neither. It must be pleasant to be even an insignificant author.\n\nTREPLIEFF. [Listening] I hear footsteps! [He embraces his uncle] I\ncannot live without her; even the sound of her footsteps is music to me.\nI am madly happy. [He goes quickly to meet NINA, who comes in at that\nmoment] My enchantress! My girl of dreams!\n\nNINA. [Excitedly] It can't be that I am late? No, I am not late.\n\nTREPLIEFF. [Kissing her hands] No, no, no!\n\nNINA. I have been in a fever all day, I was so afraid my father would\nprevent my coming, but he and my stepmother have just gone driving. The\nsky is clear, the moon is rising. How I hurried to get here! How I urged\nmy horse to go faster and faster! [Laughing] I am _so_ glad to see you!\n[She shakes hands with SORIN.]\n\nSORIN. Oho! Your eyes look as if you had been crying. You mustn't do\nthat.\n\nNINA. It is nothing, nothing. Do let us hurry. I must go in half an\nhour. No, no, for heaven's sake do not urge me to stay. My father\ndoesn't know I am here.\n\nTREPLIEFF. As a matter of fact, it is time to begin now. I must call the\naudience.\n\nSORIN. Let me call them--and all--I am going this minute. [He goes\ntoward the right, begins to sing \"The Two Grenadiers,\" then stops.]\nI was singing that once when a fellow-lawyer said to me: \"You have a\npowerful voice, sir.\" Then he thought a moment and added, \"But it is a\ndisagreeable one!\" [He goes out laughing.]\n\nNINA. My father and his wife never will let me come here; they call this\nplace Bohemia and are afraid I shall become an actress. But this lake\nattracts me as it does the gulls. My heart is full of you. [She glances\nabout her.]\n\nTREPLIEFF. We are alone.\n\nNINA. Isn't that some one over there?\n\nTREPLIEFF. No. [They kiss one another.]\n\nNINA. What is that tree?\n\nTREPLIEFF. An elm.\n\nNINA. Why does it look so dark?\n\nTREPLIEFF. It is evening; everything looks dark now. Don't go away\nearly, I implore you.\n\nNINA. I must.\n\nTREPLIEFF. What if I were to follow you, Nina? I shall stand in your\ngarden all night with my eyes on your window.\n\nNINA. That would be impossible; the watchman would see you, and Treasure\nis not used to you yet, and would bark.\n\nTREPLIEFF. I love you.\n\nNINA. Hush!\n\nTREPLIEFF. [Listening to approaching footsteps] Who is that? Is it you,\nJacob?\n\nJACOB. [On the stage] Yes, sir.\n\nTREPLIEFF. To your places then. The moon is rising; the play must\ncommence.\n\nNINA. Yes, sir.\n\nTREPLIEFF. Is the alcohol ready? Is the sulphur ready? There must be\nfumes of sulphur in the air when the red eyes shine out. [To NINA] Go,\nnow, everything is ready. Are you nervous?\n\nNINA. Yes, very. I am not so much afraid of your mother as I am of\nTrigorin. I am terrified and ashamed to act before him; he is so famous.\nIs he young?\n\nTREPLIEFF. Yes.\n\nNINA. What beautiful stories he writes!\n\nTREPLIEFF. [Coldly] I have never read any of them, so I can't say.\n\nNINA. Your play is very hard to act; there are no living characters in\nit.\n\nTREPLIEFF. Living characters! Life must be represented not as it is, but\nas it ought to be; as it appears in dreams.\n\nNINA. There is so little action; it seems more like a recitation. I\nthink love should always come into every play.\n\nNINA and TREPLIEFF go up onto the little stage; PAULINA and DORN come\nin.\n\nPAULINA. It is getting damp. Go back and put on your goloshes.\n\nDORN. I am quite warm.\n\nPAULINA. You never will take care of yourself; you are quite obstinate\nabout it, and yet you are a doctor, and know quite well that damp air is\nbad for you. You like to see me suffer, that's what it is. You sat out\non the terrace all yesterday evening on purpose.\n\nDORN. [Sings]\n\n\"Oh, tell me not that youth is wasted.\"\n\nPAULINA. You were so enchanted by the conversation of Madame Arkadina\nthat you did not even notice the cold. Confess that you admire her.\n\nDORN. I am fifty-five years old.\n\nPAULINA. A trifle. That is not old for a man. You have kept your looks\nmagnificently, and women still like you.\n\nDORN. What are you trying to tell me?\n\nPAULINA. You men are all ready to go down on your knees to an actress,\nall of you.\n\nDORN. [Sings]\n\n\"Once more I stand before thee.\"\n\nIt is only right that artists should be made much of by society and\ntreated differently from, let us say, merchants. It is a kind of\nidealism.\n\nPAULINA. When women have loved you and thrown themselves at your head,\nhas that been idealism?\n\nDORN. [Shrugging his shoulders] I can't say. There has been a great deal\nthat was admirable in my relations with women. In me they liked, above\nall, the superior doctor. Ten years ago, you remember, I was the only\ndecent doctor they had in this part of the country--and then, I have\nalways acted like a man of honour.\n\nPAULINA. [Seizes his hand] Dearest!\n\nDORN. Be quiet! Here they come.\n\nARKADINA comes in on SORIN'S arm; also TRIGORIN, SHAMRAEFF, MEDVIEDENKO,\nand MASHA.\n\nSHAMRAEFF. She acted most beautifully at the Poltava Fair in 1873; she\nwas really magnificent. But tell me, too, where Tchadin the comedian is\nnow? He was inimitable as Rasplueff, better than Sadofski. Where is he\nnow?\n\nARKADINA. Don't ask me where all those antediluvians are! I know nothing\nabout them. [She sits down.]\n\nSHAMRAEFF. [Sighing] Pashka Tchadin! There are none left like him. The\nstage is not what it was in his time. There were sturdy oaks growing on\nit then, where now but stumps remain.\n\nDORN. It is true that we have few dazzling geniuses these days, but, on\nthe other hand, the average of acting is much higher.\n\nSHAMRAEFF. I cannot agree with you; however, that is a matter of taste,\n_de gustibus._\n\nEnter TREPLIEFF from behind the stage.\n\nARKADINA. When will the play begin, my dear boy?\n\nTREPLIEFF. In a moment. I must ask you to have patience.\n\nARKADINA. [Quoting from Hamlet] My son,\n\n     \"Thou turn'st mine eyes into my very soul;\n     And there I see such black grained spots\n     As will not leave their tinct.\"\n\n[A horn is blown behind the stage.]\n\nTREPLIEFF. Attention, ladies and gentlemen! The play is about to begin.\n[A pause] I shall commence. [He taps the door with a stick, and speaks\nin a loud voice] O, ye time-honoured, ancient mists that drive at night\nacross the surface of this lake, blind you our eyes with sleep, and show\nus in our dreams that which will be in twice ten thousand years!\n\nSORIN. There won't be anything in twice ten thousand years.\n\nTREPLIEFF. Then let them now show us that nothingness.\n\nARKADINA. Yes, let them--we are asleep.\n\nThe curtain rises. A vista opens across the lake. The moon hangs low\nabove the horizon and is reflected in the water. NINA, dressed in white,\nis seen seated on a great rock.\n\nNINA. All men and beasts, lions, eagles, and quails, horned stags,\ngeese, spiders, silent fish that inhabit the waves, starfish from the\nsea, and creatures invisible to the eye--in one word, life--all, all\nlife, completing the dreary round imposed upon it, has died out at last.\nA thousand years have passed since the earth last bore a living creature\non her breast, and the unhappy moon now lights her lamp in vain. No\nlonger are the cries of storks heard in the meadows, or the drone of\nbeetles in the groves of limes. All is cold, cold. All is void, void,\nvoid. All is terrible, terrible--[A pause] The bodies of all living\ncreatures have dropped to dust, and eternal matter has transformed them\ninto stones and water and clouds; but their spirits have flowed together\ninto one, and that great world-soul am I! In me is the spirit of the\ngreat Alexander, the spirit of Napoleon, of Caesar, of Shakespeare,\nand of the tiniest leech that swims. In me the consciousness of man has\njoined hands with the instinct of the animal; I understand all, all,\nall, and each life lives again in me.\n\n[The will-o-the-wisps flicker out along the lake shore.]\n\nARKADINA. [Whispers] What decadent rubbish is this?\n\nTREPLIEFF. [Imploringly] Mother!\n\nNINA. I am alone. Once in a hundred years my lips are opened, my voice\nechoes mournfully across the desert earth, and no one hears. And you,\npoor lights of the marsh, you do not hear me. You are engendered at\nsunset in the putrid mud, and flit wavering about the lake till dawn,\nunconscious, unreasoning, unwarmed by the breath of life. Satan, father\nof eternal matter, trembling lest the spark of life should glow in you,\nhas ordered an unceasing movement of the atoms that compose you, and so\nyou shift and change for ever. I, the spirit of the universe, I alone\nam immutable and eternal. [A pause] Like a captive in a dungeon deep and\nvoid, I know not where I am, nor what awaits me. One thing only is not\nhidden from me: in my fierce and obstinate battle with Satan, the source\nof the forces of matter, I am destined to be victorious in the end.\nMatter and spirit will then be one at last in glorious harmony, and the\nreign of freedom will begin on earth. But this can only come to pass by\nslow degrees, when after countless eons the moon and earth and shining\nSirius himself shall fall to dust. Until that hour, oh, horror! horror!\nhorror! [A pause. Two glowing red points are seen shining across the\nlake] Satan, my mighty foe, advances; I see his dread and lurid eyes.\n\nARKADINA. I smell sulphur. Is that done on purpose?\n\nTREPLIEFF. Yes.\n\nARKADINA. Oh, I see; that is part of the effect.\n\nTREPLIEFF. Mother!\n\nNINA. He longs for man--\n\nPAULINA. [To DORN] You have taken off your hat again! Put it on, you\nwill catch cold.\n\nARKADINA. The doctor has taken off his hat to Satan father of eternal\nmatter--\n\nTREPLIEFF. [Loudly and angrily] Enough of this! There's an end to the\nperformance. Down with the curtain!\n\nARKADINA. Why, what are you so angry about?\n\nTREPLIEFF. [Stamping his foot] The curtain; down with it! [The curtain\nfalls] Excuse me, I forgot that only a chosen few might write plays or\nact them. I have infringed the monopoly. I--I---\n\nHe would like to say more, but waves his hand instead, and goes out to\nthe left.\n\nARKADINA. What is the matter with him?\n\nSORIN. You should not handle youthful egoism so roughly, sister.\n\nARKADINA. What did I say to him?\n\nSORIN. You hurt his feelings.\n\nARKADINA. But he told me himself that this was all in fun, so I treated\nhis play as if it were a comedy.\n\nSORIN. Nevertheless---\n\nARKADINA. Now it appears that he has produced a masterpiece, if you\nplease! I suppose it was not meant to amuse us at all, but that he\narranged the performance and fumigated us with sulphur to demonstrate to\nus how plays should be written, and what is worth acting. I am tired\nof him. No one could stand his constant thrusts and sallies. He is a\nwilful, egotistic boy.\n\nSORIN. He had hoped to give you pleasure.\n\nARKADINA. Is that so? I notice, though, that he did not choose an\nordinary play, but forced his decadent trash on us. I am willing to\nlisten to any raving, so long as it is not meant seriously, but in\nshowing us this, he pretended to be introducing us to a new form of art,\nand inaugurating a new era. In my opinion, there was nothing new about\nit, it was simply an exhibition of bad temper.\n\nTRIGORIN. Everybody must write as he feels, and as best he may.\n\nARKADINA. Let him write as he feels and can, but let him spare me his\nnonsense.\n\nDORN. Thou art angry, O Jove!\n\nARKADINA. I am a woman, not Jove. [She lights a cigarette] And I am not\nangry, I am only sorry to see a young man foolishly wasting his time. I\ndid not mean to hurt him.\n\nMEDVIEDENKO. No one has any ground for separating life from matter, as\nthe spirit may well consist of the union of material atoms. [Excitedly,\nto TRIGORIN] Some day you should write a play, and put on the stage the\nlife of a schoolmaster. It is a hard, hard life.\n\nARKADINA. I agree with you, but do not let us talk about plays or atoms\nnow. This is such a lovely evening. Listen to the singing, friends, how\nsweet it sounds.\n\nPAULINA. Yes, they are singing across the water. [A pause.]\n\nARKADINA. [To TRIGORIN] Sit down beside me here. Ten or fifteen years\nago we had music and singing on this lake almost all night. There are\nsix houses on its shores. All was noise and laughter and romance then,\nsuch romance! The young star and idol of them all in those days was this\nman here, [Nods toward DORN] Doctor Eugene Dorn. He is fascinating now,\nbut he was irresistible then. But my conscience is beginning to\nprick me. Why did I hurt my poor boy? I am uneasy about him. [Loudly]\nConstantine! Constantine!\n\nMASHA. Shall I go and find him?\n\nARKADINA. If you please, my dear.\n\nMASHA. [Goes off to the left, calling] Mr. Constantine! Oh, Mr.\nConstantine!\n\nNINA. [Comes in from behind the stage] I see that the play will never be\nfinished, so now I can go home. Good evening. [She kisses ARKADINA and\nPAULINA.]\n\nSORIN. Bravo! Bravo!\n\nARKADINA. Bravo! Bravo! We were quite charmed by your acting. With your\nlooks and such a lovely voice it is a crime for you to hide yourself\nin the country. You must be very talented. It is your duty to go on the\nstage, do you hear me?\n\nNINA. It is the dream of my life, which will never come true.\n\nARKADINA. Who knows? Perhaps it will. But let me present Monsieur Boris\nTrigorin.\n\nNINA. I am delighted to meet you. [Embarrassed] I have read all your\nbooks.\n\nARKADINA. [Drawing NINA down beside her] Don't be afraid of him, dear.\nHe is a simple, good-natured soul, even if he is a celebrity. See, he is\nembarrassed himself.\n\nDORN. Couldn't the curtain be raised now? It is depressing to have it\ndown.\n\nSHAMRAEFF. [Loudly] Jacob, my man! Raise the curtain!\n\nNINA. [To TRIGORIN] It was a curious play, wasn't it?\n\nTRIGORIN. Very. I couldn't understand it at all, but I watched it with\nthe greatest pleasure because you acted with such sincerity, and the\nsetting was beautiful. [A pause] There must be a lot of fish in this\nlake.\n\nNINA. Yes, there are.\n\nTRIGORIN. I love fishing. I know of nothing pleasanter than to sit on a\nlake shore in the evening with one's eyes on a floating cork.\n\nNINA. Why, I should think that for one who has tasted the joys of\ncreation, no other pleasure could exist.\n\nARKADINA. Don't talk like that. He always begins to flounder when people\nsay nice things to him.\n\nSHAMRAEFF. I remember when the famous Silva was singing once in the\nOpera House at Moscow, how delighted we all were when he took the low C.\nWell, you can imagine our astonishment when one of the church cantors,\nwho happened to be sitting in the gallery, suddenly boomed out: \"Bravo,\nSilva!\" a whole octave lower. Like this: [In a deep bass voice] \"Bravo,\nSilva!\" The audience was left breathless. [A pause.]\n\nDORN. An angel of silence is flying over our heads.\n\nNINA. I must go. Good-bye.\n\nARKADINA. Where to? Where must you go so early? We shan't allow it.\n\nNINA. My father is waiting for me.\n\nARKADINA. How cruel he is, really. [They kiss each other] Then I suppose\nwe can't keep you, but it is very hard indeed to let you go.\n\nNINA. If you only knew how hard it is for me to leave you all.\n\nARKADINA. Somebody must see you home, my pet.\n\nNINA. [Startled] No, no!\n\nSORIN. [Imploringly] Don't go!\n\nNINA. I must.\n\nSORIN. Stay just one hour more, and all. Come now, really, you know.\n\nNINA. [Struggling against her desire to stay; through her tears] No, no,\nI can't. [She shakes hands with him and quickly goes out.]\n\nARKADINA. An unlucky girl! They say that her mother left the whole of an\nimmense fortune to her husband, and now the child is penniless because\nthe father has already willed everything away to his second wife. It is\npitiful.\n\nDORN. Yes, her papa is a perfect beast, and I don't mind saying so--it\nis what he deserves.\n\nSORIN. [Rubbing his chilled hands] Come, let us go in; the night is\ndamp, and my legs are aching.\n\nARKADINA. Yes, you act as if they were turned to stone; you can hardly\nmove them. Come, you unfortunate old man. [She takes his arm.]\n\nSHAMRAEFF. [Offering his arm to his wife] Permit me, madame.\n\nSORIN. I hear that dog howling again. Won't you please have it\nunchained, Shamraeff?\n\nSHAMRAEFF. No, I really can't, sir. The granary is full of millet, and\nI am afraid thieves might break in if the dog were not there. [Walking\nbeside MEDVIEDENKO] Yes, a whole octave lower: \"Bravo, Silva!\" and he\nwasn't a singer either, just a simple church cantor.\n\nMEDVIEDENKO. What salary does the church pay its singers? [All go out\nexcept DORN.]\n\nDORN. I may have lost my judgment and my wits, but I must confess I\nliked that play. There was something in it. When the girl spoke of her\nsolitude and the Devil's eyes gleamed across the lake, I felt my hands\nshaking with excitement. It was so fresh and naive. But here he comes;\nlet me say something pleasant to him.\n\nTREPLIEFF comes in.\n\nTREPLIEFF. All gone already?\n\nDORN. I am here.\n\nTREPLIEFF. Masha has been yelling for me all over the park. An\ninsufferable creature.\n\nDORN. Constantine, your play delighted me. It was strange, of course,\nand I did not hear the end, but it made a deep impression on me. You\nhave a great deal of talent, and must persevere in your work.\n\nTREPLIEFF seizes his hand and squeezes it hard, then kisses him\nimpetuously.\n\nDORN. Tut, tut! how excited you are. Your eyes are full of tears. Listen\nto me. You chose your subject in the realm of abstract thought, and you\ndid quite right. A work of art should invariably embody some lofty idea.\nOnly that which is seriously meant can ever be beautiful. How pale you\nare!\n\nTREPLIEFF. So you advise me to persevere?\n\nDORN. Yes, but use your talent to express only deep and eternal truths.\nI have led a quiet life, as you know, and am a contented man, but if I\nshould ever experience the exaltation that an artist feels during his\nmoments of creation, I think I should spurn this material envelope of my\nsoul and everything connected with it, and should soar away into heights\nabove this earth.\n\nTREPLIEFF. I beg your pardon, but where is Nina?\n\nDORN. And yet another thing: every work of art should have a definite\nobject in view. You should know why you are writing, for if you follow\nthe road of art without a goal before your eyes, you will lose yourself,\nand your genius will be your ruin.\n\nTREPLIEFF. [Impetuously] Where is Nina?\n\nDORN. She has gone home.\n\nTREPLIEFF. [In despair] Gone home? What shall I do? I want to see her; I\nmust see her! I shall follow her.\n\nDORN. My dear boy, keep quiet.\n\nTREPLIEFF. I am going. I must go.\n\nMASHA comes in.\n\nMASHA. Your mother wants you to come in, Mr. Constantine. She is waiting\nfor you, and is very uneasy.\n\nTREPLIEFF. Tell her I have gone away. And for heaven's sake, all of you,\nleave me alone! Go away! Don't follow me about!\n\nDORN. Come, come, old chap, don't act like this; it isn't kind at all.\n\nTREPLIEFF. [Through his tears] Good-bye, doctor, and thank you.\n\nTREPLIEFF goes out.\n\nDORN. [Sighing] Ah, youth, youth!\n\nMASHA. It is always \"Youth, youth,\" when there is nothing else to be\nsaid.\n\nShe takes snuff. DORN takes the snuff-box out of her hands and flings it\ninto the bushes.\n\nDORN. Don't do that, it is horrid. [A pause] I hear music in the house.\nI must go in.\n\nMASHA. Wait a moment.\n\nDORN. What do you want?\n\nMASHA. Let me tell you again. I feel like talking. [She grows more and\nmore excited] I do not love my father, but my heart turns to you. For\nsome reason, I feel with all my soul that you are near to me. Help me!\nHelp me, or I shall do something foolish and mock at my life, and ruin\nit. I am at the end of my strength.\n\nDORN. What is the matter? How can I help you?\n\nMASHA. I am in agony. No one, no one can imagine how I suffer. [She lays\nher head on his shoulder and speaks softly] I love Constantine.\n\nDORN. Oh, how excitable you all are! And how much love there is about\nthis lake of spells! [Tenderly] But what can I do for you, my child?\nWhat? What?\n\nThe curtain falls.\n\n\n\n\nACT II\n\n_The lawn in front of SORIN'S house. The house stands in the background,\non a broad terrace. The lake, brightly reflecting the rays of the sun,\nlies to the left. There are flower-beds here and there. It is noon;\nthe day is hot. ARKADINA, DORN, and MASHA are sitting on a bench on the\nlawn, in the shade of an old linden. An open book is lying on DORN'S\nknees_.\n\nARKADINA. [To MASHA] Come, get up. [They both get up] Stand beside me.\nYou are twenty-two and I am almost twice your age. Tell me, Doctor,\nwhich of us is the younger looking?\n\nDORN. You are, of course.\n\nARKADINA. You see! Now why is it? Because I work; my heart and mind are\nalways busy, whereas you never move off the same spot. You don't live.\nIt is a maxim of mine never to look into the future. I never admit the\nthought of old age or death, and just accept what comes to me.\n\nMASHA. I feel as if I had been in the world a thousand years, and I\ntrail my life behind me like an endless scarf. Often I have no desire\nto live at all. Of course that is foolish. One ought to pull oneself\ntogether and shake off such nonsense.\n\nDORN. [Sings softly]\n\n\"Tell her, oh flowers--\"\n\nARKADINA. And then I keep myself as correct-looking as an Englishman. I\nam always well-groomed, as the saying is, and carefully dressed, with my\nhair neatly arranged. Do you think I should ever permit myself to leave\nthe house half-dressed, with untidy hair? Certainly not! I have kept my\nlooks by never letting myself slump as some women do. [She puts her arms\nakimbo, and walks up and down on the lawn] See me, tripping on tiptoe\nlike a fifteen-year-old girl.\n\nDORN. I see. Nevertheless, I shall continue my reading. [He takes up his\nbook] Let me see, we had come to the grain-dealer and the rats.\n\nARKADINA. And the rats. Go on. [She sits down] No, give me the book, it\nis my turn to read. [She takes the book and looks for the place] And\nthe rats. Ah, here it is. [She reads] \"It is as dangerous for society to\nattract and indulge authors as it is for grain-dealers to raise rats\nin their granaries. Yet society loves authors. And so, when a woman\nhas found one whom she wishes to make her own, she lays siege to him\nby indulging and flattering him.\" That may be so in France, but it\ncertainly is not so in Russia. We do not carry out a programme like\nthat. With us, a woman is usually head over ears in love with an author\nbefore she attempts to lay siege to him. You have an example before your\neyes, in me and Trigorin.\n\nSORIN comes in leaning on a cane, with NINA beside him. MEDVIEDENKO\nfollows, pushing an arm-chair.\n\nSORIN. [In a caressing voice, as if speaking to a child] So we are happy\nnow, eh? We are enjoying ourselves to-day, are we? Father and stepmother\nhave gone away to Tver, and we are free for three whole days!\n\nNINA. [Sits down beside ARKADINA, and embraces her] I am so happy. I\nbelong to you now.\n\nSORIN. [Sits down in his arm-chair] She looks lovely to-day.\n\nARKADINA. Yes, she has put on her prettiest dress, and looks sweet. That\nwas nice of you. [She kisses NINA] But we mustn't praise her too much;\nwe shall spoil her. Where is Trigorin?\n\nNINA. He is fishing off the wharf.\n\nARKADINA. I wonder he isn't bored. [She begins to read again.]\n\nNINA. What are you reading?\n\nARKADINA. \"On the Water,\" by Maupassant. [She reads a few lines to\nherself] But the rest is neither true nor interesting. [She lays down\nthe book] I am uneasy about my son. Tell me, what is the matter with\nhim? Why is he so dull and depressed lately? He spends all his days on\nthe lake, and I scarcely ever see him any more.\n\nMASHA. His heart is heavy. [Timidly, to NINA] Please recite something\nfrom his play.\n\nNINA. [Shrugging her shoulders] Shall I? Is it so interesting?\n\nMASHA. [With suppressed rapture] When he recites, his eyes shine and his\nface grows pale. His voice is beautiful and sad, and he has the ways of\na poet.\n\nSORIN begins to snore.\n\nDORN. Pleasant dreams!\n\nARKADINA. Peter!\n\nSORIN. Eh?\n\nARKADINA. Are you asleep?\n\nSORIN. Not a bit of it. [A pause.]\n\nARKADINA. You don't do a thing for your health, brother, but you really\nought to.\n\nDORN. The idea of doing anything for one's health at sixty-five!\n\nSORIN. One still wants to live at sixty-five.\n\nDORN. [Crossly] Ho! Take some camomile tea.\n\nARKADINA. I think a journey to some watering-place would be good for\nhim.\n\nDORN. Why, yes; he might go as well as not.\n\nARKADINA. You don't understand.\n\nDORN. There is nothing to understand in this case; it is quite clear.\n\nMEDVIEDENKO. He ought to give up smoking.\n\nSORIN. What nonsense! [A pause.]\n\nDORN. No, that is not nonsense. Wine and tobacco destroy the\nindividuality. After a cigar or a glass of vodka you are no longer Peter\nSorin, but Peter Sorin plus somebody else. Your ego breaks in two: you\nbegin to think of yourself in the third person.\n\nSORIN. It is easy for you to condemn smoking and drinking; you have\nknown what life is, but what about me? I have served in the Department\nof Justice for twenty-eight years, but I have never lived, I have never\nhad any experiences. You are satiated with life, and that is why you\nhave an inclination for philosophy, but I want to live, and that is why\nI drink my wine for dinner and smoke cigars, and all.\n\nDORN. One must take life seriously, and to take a cure at sixty-five\nand regret that one did not have more pleasure in youth is, forgive my\nsaying so, trifling.\n\nMASHA. It must be lunch-time. [She walks away languidly, with a dragging\nstep] My foot has gone to sleep.\n\nDORN. She is going to have a couple of drinks before lunch.\n\nSORIN. The poor soul is unhappy.\n\nDORN. That is a trifle, your honour.\n\nSORIN. You judge her like a man who has obtained all he wants in life.\n\nARKADINA. Oh, what could be duller than this dear tedium of the country?\nThe air is hot and still, nobody does anything but sit and philosophise\nabout life. It is pleasant, my friends, to sit and listen to you here,\nbut I had rather a thousand times sit alone in the room of a hotel\nlearning a role by heart.\n\nNINA. [With enthusiasm] You are quite right. I understand how you feel.\n\nSORIN. Of course it is pleasanter to live in town. One can sit in one's\nlibrary with a telephone at one's elbow, no one comes in without being\nfirst announced by the footman, the streets are full of cabs, and all---\n\nDORN. [Sings]\n\n\"Tell her, oh flowers---\"\n\nSHAMRAEFF comes in, followed by PAULINA.\n\nSHAMRAEFF. Here they are. How do you do? [He kisses ARKADINA'S hand and\nthen NINA'S] I am delighted to see you looking so well. [To ARKADINA] My\nwife tells me that you mean to go to town with her to-day. Is that so?\n\nARKADINA. Yes, that is what I had planned to do.\n\nSHAMRAEFF. Hm--that is splendid, but how do you intend to get there,\nmadam? We are hauling rye to-day, and all the men are busy. What horses\nwould you take?\n\nARKADINA. What horses? How do I know what horses we shall have?\n\nSORIN. Why, we have the carriage horses.\n\nSHAMRAEFF. The carriage horses! And where am I to find the harness for\nthem? This is astonishing! My dear madam, I have the greatest respect\nfor your talents, and would gladly sacrifice ten years of my life for\nyou, but I cannot let you have any horses to-day.\n\nARKADINA. But if I must go to town? What an extraordinary state of\naffairs!\n\nSHAMRAEFF. You do not know, madam, what it is to run a farm.\n\nARKADINA. [In a burst of anger] That is an old story! Under these\ncircumstances I shall go back to Moscow this very day. Order a carriage\nfor me from the village, or I shall go to the station on foot.\n\nSHAMRAEFF. [losing his temper] Under these circumstances I resign my\nposition. You must find yourself another manager. [He goes out.]\n\nARKADINA. It is like this every summer: every summer I am insulted here.\nI shall never set foot here again.\n\nShe goes out to the left, in the direction of the wharf. In a few\nminutes she is seen entering the house, followed by TRIGORIN, who\ncarries a bucket and fishing-rod.\n\nSORIN. [Losing his temper] What the deuce did he mean by his impudence?\nI want all the horses brought here at once!\n\nNINA. [To PAULINA] How could he refuse anything to Madame Arkadina, the\nfamous actress? Is not every wish, every caprice even, of hers, more\nimportant than any farm work? This is incredible.\n\nPAULINA. [In despair] What can I do about it? Put yourself in my place\nand tell me what I can do.\n\nSORIN. [To NINA] Let us go and find my sister, and all beg her not to\ngo. [He looks in the direction in which SHAMRAEFF went out] That man is\ninsufferable; a regular tyrant.\n\nNINA. [Preventing him from getting up] Sit still, sit still, and let\nus wheel you. [She and MEDVIEDENKO push the chair before them] This is\nterrible!\n\nSORIN. Yes, yes, it is terrible; but he won't leave. I shall have a talk\nwith him in a moment. [They go out. Only DORN and PAULINA are left.]\n\nDORN. How tiresome people are! Your husband deserves to be thrown out of\nhere neck and crop, but it will all end by this old granny Sorin and his\nsister asking the man's pardon. See if it doesn't.\n\nPAULINA. He has sent the carriage horses into the fields too. These\nmisunderstandings occur every day. If you only knew how they excite me!\nI am ill; see! I am trembling all over! I cannot endure his rough ways.\n[Imploringly] Eugene, my darling, my beloved, take me to you. Our time\nis short; we are no longer young; let us end deception and concealment,\neven though it is only at the end of our lives. [A pause.]\n\nDORN. I am fifty-five years old. It is too late now for me to change my\nways of living.\n\nPAULINA. I know that you refuse me because there are other women who are\nnear to you, and you cannot take everybody. I understand. Excuse me--I\nsee I am only bothering you.\n\nNINA is seen near the house picking a bunch of flowers.\n\nDORN. No, it is all right.\n\nPAULINA. I am tortured by jealousy. Of course you are a doctor and\ncannot escape from women. I understand.\n\nDORN. [TO NINA, who comes toward him] How are things in there?\n\nNINA. Madame Arkadina is crying, and Sorin is having an attack of\nasthma.\n\nDORN. Let us go and give them both some camomile tea.\n\nNINA. [Hands him the bunch of flowers] Here are some flowers for you.\n\nDORN. Thank you. [He goes into the house.]\n\nPAULINA. [Following him] What pretty flowers! [As they reach the house\nshe says in a low voice] Give me those flowers! Give them to me!\n\nDORN hands her the flowers; she tears them to pieces and flings them\naway. They both go into the house.\n\nNINA. [Alone] How strange to see a famous actress weeping, and for\nsuch a trifle! Is it not strange, too, that a famous author should sit\nfishing all day? He is the idol of the public, the papers are full\nof him, his photograph is for sale everywhere, his works have been\ntranslated into many foreign languages, and yet he is overjoyed if he\ncatches a couple of minnows. I always thought famous people were distant\nand proud; I thought they despised the common crowd which exalts\nriches and birth, and avenged themselves on it by dazzling it with the\ninextinguishable honour and glory of their fame. But here I see them\nweeping and playing cards and flying into passions like everybody else.\n\nTREPLIEFF comes in without a hat on, carrying a gun and a dead seagull.\n\nTREPLIEFF. Are you alone here?\n\nNINA. Yes.\n\nTREPLIEFF lays the sea-gull at her feet.\n\nNINA. What do you mean by this?\n\nTREPLIEFF. I was base enough to-day to kill this gull. I lay it at your\nfeet.\n\nNINA. What is happening to you? [She picks up the gull and stands\nlooking at it.]\n\nTREPLIEFF. [After a pause] So shall I soon end my own life.\n\nNINA. You have changed so that I fail to recognise you.\n\nTREPLIEFF. Yes, I have changed since the time when I ceased to recognise\nyou. You have failed me; your look is cold; you do not like to have me\nnear you.\n\nNINA. You have grown so irritable lately, and you talk so darkly and\nsymbolically that you must forgive me if I fail to follow you. I am too\nsimple to understand you.\n\nTREPLIEFF. All this began when my play failed so dismally. A woman never\ncan forgive failure. I have burnt the manuscript to the last page. Oh,\nif you could only fathom my unhappiness! Your estrangement is to me\nterrible, incredible; it is as if I had suddenly waked to find this\nlake dried up and sunk into the earth. You say you are too simple to\nunderstand me; but, oh, what is there to understand? You disliked\nmy play, you have no faith in my powers, you already think of me as\ncommonplace and worthless, as many are. [Stamping his foot] How well\nI can understand your feelings! And that understanding is to me like\na dagger in the brain. May it be accursed, together with my stupidity,\nwhich sucks my life-blood like a snake! [He sees TRIGORIN, who\napproaches reading a book] There comes real genius, striding along like\nanother Hamlet, and with a book, too. [Mockingly] \"Words, words, words.\"\nYou feel the warmth of that sun already, you smile, your eyes melt and\nglow liquid in its rays. I shall not disturb you. [He goes out.]\n\nTRIGORIN. [Making notes in his book] Takes snuff and drinks vodka;\nalways wears black dresses; is loved by a schoolteacher--\n\nNINA. How do you do?\n\nTRIGORIN. How are you, Miss Nina? Owing to an unforeseen development of\ncircumstances, it seems that we are leaving here today. You and I shall\nprobably never see each other again, and I am sorry for it. I seldom\nmeet a young and pretty girl now; I can hardly remember how it feels\nto be nineteen, and the young girls in my books are seldom living\ncharacters. I should like to change places with you, if but for an hour,\nto look out at the world through your eyes, and so find out what sort of\na little person you are.\n\nNINA. And I should like to change places with you.\n\nTRIGORIN. Why?\n\nNINA. To find out how a famous genius feels. What is it like to be\nfamous? What sensations does it give you?\n\nTRIGORIN. What sensations? I don't believe it gives any. [Thoughtfully]\nEither you exaggerate my fame, or else, if it exists, all I can say is\nthat one simply doesn't feel fame in any way.\n\nNINA. But when you read about yourself in the papers?\n\nTRIGORIN. If the critics praise me, I am happy; if they condemn me, I am\nout of sorts for the next two days.\n\nNINA. This is a wonderful world. If you only knew how I envy you! Men\nare born to different destinies. Some dully drag a weary, useless life\nbehind them, lost in the crowd, unhappy, while to one out of a million,\nas to you, for instance, comes a bright destiny full of interest and\nmeaning. You are lucky.\n\nTRIGORIN. I, lucky? [He shrugs his shoulders] H-m--I hear you talking\nabout fame, and happiness, and bright destinies, and those fine words of\nyours mean as much to me--forgive my saying so--as sweetmeats do, which\nI never eat. You are very young, and very kind.\n\nNINA. Your life is beautiful.\n\nTRIGORIN. I see nothing especially lovely about it. [He looks at his\nwatch] Excuse me, I must go at once, and begin writing again. I am in a\nhurry. [He laughs] You have stepped on my pet corn, as they say, and I\nam getting excited, and a little cross. Let us discuss this bright and\nbeautiful life of mine, though. [After a few moments' thought] Violent\nobsessions sometimes lay hold of a man: he may, for instance, think day\nand night of nothing but the moon. I have such a moon. Day and night I\nam held in the grip of one besetting thought, to write, write, write!\nHardly have I finished one book than something urges me to write\nanother, and then a third, and then a fourth--I write ceaselessly. I am,\nas it were, on a treadmill. I hurry for ever from one story to another,\nand can't help myself. Do you see anything bright and beautiful in that?\nOh, it is a wild life! Even now, thrilled as I am by talking to you, I\ndo not forget for an instant that an unfinished story is awaiting me. My\neye falls on that cloud there, which has the shape of a grand piano; I\ninstantly make a mental note that I must remember to mention in my story\na cloud floating by that looked like a grand piano. I smell heliotrope;\nI mutter to myself: a sickly smell, the colour worn by widows; I must\nremember that in writing my next description of a summer evening. I\ncatch an idea in every sentence of yours or of my own, and hasten to\nlock all these treasures in my literary store-room, thinking that some\nday they may be useful to me. As soon as I stop working I rush off to\nthe theatre or go fishing, in the hope that I may find oblivion there,\nbut no! Some new subject for a story is sure to come rolling through my\nbrain like an iron cannonball. I hear my desk calling, and have to go\nback to it and begin to write, write, write, once more. And so it\ngoes for everlasting. I cannot escape myself, though I feel that I am\nconsuming my life. To prepare the honey I feed to unknown crowds, I am\ndoomed to brush the bloom from my dearest flowers, to tear them from\ntheir stems, and trample the roots that bore them under foot. Am I not\na madman? Should I not be treated by those who know me as one mentally\ndiseased? Yet it is always the same, same old story, till I begin to\nthink that all this praise and admiration must be a deception, that I am\nbeing hoodwinked because they know I am crazy, and I sometimes tremble\nlest I should be grabbed from behind and whisked off to a lunatic\nasylum. The best years of my youth were made one continual agony for me\nby my writing. A young author, especially if at first he does not make\na success, feels clumsy, ill-at-ease, and superfluous in the world. His\nnerves are all on edge and stretched to the point of breaking; he is\nirresistibly attracted to literary and artistic people, and hovers about\nthem unknown and unnoticed, fearing to look them bravely in the eye,\nlike a man with a passion for gambling, whose money is all gone. I\ndid not know my readers, but for some reason I imagined they were\ndistrustful and unfriendly; I was mortally afraid of the public, and\nwhen my first play appeared, it seemed to me as if all the dark eyes in\nthe audience were looking at it with enmity, and all the blue ones with\ncold indifference. Oh, how terrible it was! What agony!\n\nNINA. But don't your inspiration and the act of creation give you\nmoments of lofty happiness?\n\nTRIGORIN. Yes. Writing is a pleasure to me, and so is reading the\nproofs, but no sooner does a book leave the press than it becomes odious\nto me; it is not what I meant it to be; I made a mistake to write it at\nall; I am provoked and discouraged. Then the public reads it and says:\n\"Yes, it is clever and pretty, but not nearly as good as Tolstoi,\" or\n\"It is a lovely thing, but not as good as Turgenieff's 'Fathers and\nSons,'\" and so it will always be. To my dying day I shall hear people\nsay: \"Clever and pretty; clever and pretty,\" and nothing more; and when\nI am gone, those that knew me will say as they pass my grave: \"Here lies\nTrigorin, a clever writer, but he was not as good as Turgenieff.\"\n\nNINA. You must excuse me, but I decline to understand what you are\ntalking about. The fact is, you have been spoilt by your success.\n\nTRIGORIN. What success have I had? I have never pleased myself; as\na writer, I do not like myself at all. The trouble is that I am made\ngiddy, as it were, by the fumes of my brain, and often hardly know what\nI am writing. I love this lake, these trees, the blue heaven; nature's\nvoice speaks to me and wakes a feeling of passion in my heart, and I\nam overcome by an uncontrollable desire to write. But I am not only\na painter of landscapes, I am a man of the city besides. I love my\ncountry, too, and her people; I feel that, as a writer, it is my duty to\nspeak of their sorrows, of their future, also of science, of the rights\nof man, and so forth. So I write on every subject, and the public hounds\nme on all sides, sometimes in anger, and I race and dodge like a fox\nwith a pack of hounds on his trail. I see life and knowledge flitting\naway before me. I am left behind them like a peasant who has missed his\ntrain at a station, and finally I come back to the conclusion that all\nI am fit for is to describe landscapes, and that whatever else I attempt\nrings abominably false.\n\nNINA. You work too hard to realise the importance of your writings. What\nif you are discontented with yourself? To others you appear a great and\nsplendid man. If I were a writer like you I should devote my whole life\nto the service of the Russian people, knowing at the same time that\ntheir welfare depended on their power to rise to the heights I had\nattained, and the people should send me before them in a chariot of\ntriumph.\n\nTRIGORIN. In a chariot? Do you think I am Agamemnon? [They both smile.]\n\nNINA. For the bliss of being a writer or an actress I could endure want,\nand disillusionment, and the hatred of my friends, and the pangs of my\nown dissatisfaction with myself; but I should demand in return fame,\nreal, resounding fame! [She covers her face with her hands] Whew! My\nhead reels!\n\nTHE VOICE OF ARKADINA. [From inside the house] Boris! Boris!\n\nTRIGORIN. She is calling me, probably to come and pack, but I don't want\nto leave this place. [His eyes rest on the lake] What a blessing such\nbeauty is!\n\nNINA. Do you see that house there, on the far shore?\n\nTRIGORIN. Yes.\n\nNINA. That was my dead mother's home. I was born there, and have lived\nall my life beside this lake. I know every little island in it.\n\nTRIGORIN. This is a beautiful place to live. [He catches sight of the\ndead sea-gull] What is that?\n\nNINA. A gull. Constantine shot it.\n\nTRIGORIN. What a lovely bird! Really, I can't bear to go away. Can't you\npersuade Irina to stay? [He writes something in his note-book.]\n\nNINA. What are you writing?\n\nTRIGORIN. Nothing much, only an idea that occurred to me. [He puts the\nbook back in his pocket] An idea for a short story. A young girl grows\nup on the shores of a lake, as you have. She loves the lake as the gulls\ndo, and is as happy and free as they. But a man sees her who chances to\ncome that way, and he destroys her out of idleness, as this gull here\nhas been destroyed. [A pause. ARKADINA appears at one of the windows.]\n\nARKADINA. Boris! Where are you?\n\nTRIGORIN. I am coming this minute.\n\nHe goes toward the house, looking back at NINA. ARKADINA remains at the\nwindow.\n\nTRIGORIN. What do you want?\n\nARKADINA. We are not going away, after all.\n\nTRIGORIN goes into the house. NINA comes forward and stands lost in\nthought.\n\nNINA. It is a dream!\n\nThe curtain falls.\n\n\n\n\nACT III\n\n_The dining-room of SORIN'S house. Doors open out of it to the right\nand left. A table stands in the centre of the room. Trunks and boxes\nencumber the floor, and preparations for departure are evident. TRIGORIN\nis sitting at a table eating his breakfast, and MASHA is standing beside\nhim_.\n\nMASHA. I am telling you all these things because you write books and\nthey may be useful to you. I tell you honestly, I should not have lived\nanother day if he had wounded himself fatally. Yet I am courageous; I\nhave decided to tear this love of mine out of my heart by the roots.\n\nTRIGORIN. How will you do it?\n\nMASHA. By marrying Medviedenko.\n\nTRIGORIN. The school-teacher?\n\nMASHA. Yes.\n\nTRIGORIN. I don't see the necessity for that.\n\nMASHA. Oh, if you knew what it is to love without hope for years and\nyears, to wait for ever for something that will never come! I shall not\nmarry for love, but marriage will at least be a change, and will bring\nnew cares to deaden the memories of the past. Shall we have another\ndrink?\n\nTRIGORIN. Haven't you had enough?\n\nMASHA. Fiddlesticks! [She fills a glass] Don't look at me with that\nexpression on your face. Women drink oftener than you imagine, but most\nof them do it in secret, and not openly, as I do. They do indeed, and\nit is always either vodka or brandy. [They touch glasses] To your good\nhealth! You are so easy to get on with that I am sorry to see you go.\n[They drink.]\n\nTRIGORIN. And I am sorry to leave.\n\nMASHA. You should ask her to stay.\n\nTRIGORIN. She would not do that now. Her son has been behaving\noutrageously. First he attempted suicide, and now I hear he is going\nto challenge me to a duel, though what his provocation may be I can't\nimagine. He is always sulking and sneering and preaching about a new\nform of art, as if the field of art were not large enough to accommodate\nboth old and new without the necessity of jostling.\n\nMASHA. It is jealousy. However, that is none of my business. [A pause.\nJACOB walks through the room carrying a trunk; NINA comes in and stands\nby the window] That schoolteacher of mine is none too clever, but he\nis very good, poor man, and he loves me dearly, and I am sorry for him.\nHowever, let me say good-bye and wish you a pleasant journey. Remember\nme kindly in your thoughts. [She shakes hands with him] Thanks for your\ngoodwill. Send me your books, and be sure to write something in them;\nnothing formal, but simply this: \"To Masha, who, forgetful of her\norigin, for some unknown reason is living in this world.\" Good-bye. [She\ngoes out.]\n\nNINA. [Holding out her closed hand to TRIGORIN] Is it odd or even?\n\nTRIGORIN. Even.\n\nNINA. [With a sigh] No, it is odd. I had only one pea in my hand. I\nwanted to see whether I was to become an actress or not. If only some\none would advise me what to do!\n\nTRIGORIN. One cannot give advice in a case like this. [A pause.]\n\nNINA. We shall soon part, perhaps never to meet again. I should like you\nto accept this little medallion as a remembrance of me. I have had your\ninitials engraved on it, and on this side is the name of one of your\nbooks: \"Days and Nights.\"\n\nTRIGORIN. How sweet of you! [He kisses the medallion] It is a lovely\npresent.\n\nNINA. Think of me sometimes.\n\nTRIGORIN. I shall never forget you. I shall always remember you as I saw\nyou that bright day--do you recall it?--a week ago, when you wore your\nlight dress, and we talked together, and the white seagull lay on the\nbench beside us.\n\nNINA. [Lost in thought] Yes, the sea-gull. [A pause] I beg you to let me\nsee you alone for two minutes before you go.\n\nShe goes out to the left. At the same moment ARKADINA comes in from the\nright, followed by SORIN in a long coat, with his orders on his breast,\nand by JACOB, who is busy packing.\n\nARKADINA. Stay here at home, you poor old man. How could you pay visits\nwith that rheumatism of yours? [To TRIGORIN] Who left the room just now,\nwas it Nina?\n\nTRIGORIN. Yes.\n\nARKADINA. I beg your pardon; I am afraid we interrupted you. [She sits\ndown] I think everything is packed. I am absolutely exhausted.\n\nTRIGORIN. [Reading the inscription on the medallion] \"Days and Nights,\npage 121, lines 11 and 12.\"\n\nJACOB. [Clearing the table] Shall I pack your fishing-rods, too, sir?\n\nTRIGORIN. Yes, I shall need them, but you can give my books away.\n\nJACOB. Very well, sir.\n\nTRIGORIN. [To himself] Page 121, lines 11 and 12. [To ARKADINA] Have we\nmy books here in the house?\n\nARKADINA. Yes, they are in my brother's library, in the corner cupboard.\n\nTRIGORIN. Page 121--[He goes out.]\n\nSORIN. You are going away, and I shall be lonely without you.\n\nARKADINA. What would you do in town?\n\nSORIN. Oh, nothing in particular, but somehow--[He laughs] They are soon\nto lay the corner-stone of the new court-house here. How I should like\nto leap out of this minnow-pond, if but for an hour or two! I am tired\nof lying here like an old cigarette stump. I have ordered the carriage\nfor one o'clock. We can go away together.\n\nARKADINA. [After a pause] No, you must stay here. Don't be lonely, and\ndon't catch cold. Keep an eye on my boy. Take good care of him; guide\nhim along the proper paths. [A pause] I am going away, and so shall\nnever find out why Constantine shot himself, but I think the chief\nreason was jealousy, and the sooner I take Trigorin away, the better.\n\nSORIN. There were--how shall I explain it to you?--other reasons besides\njealousy for his act. Here is a clever young chap living in the depths\nof the country, without money or position, with no future ahead of him,\nand with nothing to do. He is ashamed and afraid of being so idle. I am\ndevoted to him and he is fond of me, but nevertheless he feels that he\nis useless here, that he is little more than a dependent in this house.\nIt is the pride in him.\n\nARKADINA. He is a misery to me! [Thoughtfully] He might possibly enter\nthe army.\n\nSORIN. [Gives a whistle, and then speaks with hesitation] It seems to\nme that the best thing for him would be if you were to let him have\na little money. For one thing, he ought to be allowed to dress like a\nhuman being. See how he looks! Wearing the same little old coat that\nhe has had for three years, and he doesn't even possess an overcoat!\n[Laughing] And it wouldn't hurt the youngster to sow a few wild oats;\nlet him go abroad, say, for a time. It wouldn't cost much.\n\nARKADINA. Yes, but--However, I think I might manage about his clothes,\nbut I couldn't let him go abroad. And no, I don't think I can let him\nhave his clothes even, now. [Decidedly] I have no money at present.\n\nSORIN laughs.\n\nARKADINA. I haven't indeed.\n\nSORIN. [Whistles] Very well. Forgive me, darling; don't be angry. You\nare a noble, generous woman!\n\nARKADINA. [Weeping] I really haven't the money.\n\nSORIN. If I had any money of course I should let him have some myself,\nbut I haven't even a penny. The farm manager takes my pension from me\nand puts it all into the farm or into cattle or bees, and in that way it\nis always lost for ever. The bees die, the cows die, they never let me\nhave a horse.\n\nARKADINA. Of course I have some money, but I am an actress and my\nexpenses for dress alone are enough to bankrupt me.\n\nSORIN. You are a dear, and I am very fond of you, indeed I am. But\nsomething is the matter with me again. [He staggers] I feel giddy. [He\nleans against the table] I feel faint, and all.\n\nARKADINA. [Frightened ] Peter! [She tries to support him] Peter!\ndearest! [She calls] Help! Help!\n\nTREPLIEFF and MEDVIEDENKO come in; TREPLIEFF has a bandage around his\nhead.\n\nARKADINA. He is fainting!\n\nSORIN. I am all right. [He smiles and drinks some water] It is all over\nnow.\n\nTREPLIEFF. [To his mother] Don't be frightened, mother, these attacks\nare not dangerous; my uncle often has them now. [To his uncle] You must\ngo and lie down, Uncle.\n\nSORIN. Yes, I think I shall, for a few minutes. I am going to Moscow\nall the same, but I shall lie down a bit before I start. [He goes out\nleaning on his cane.]\n\nMEDVIEDENKO. [Giving him his arm] Do you know this riddle? On four legs\nin the morning; on two legs at noon; and on three legs in the evening?\n\nSORIN. [Laughing] Yes, exactly, and on one's back at night. Thank you, I\ncan walk alone.\n\nMEDVIEDENKO. Dear me, what formality! [He and SORIN go out.]\n\nARKADINA. He gave me a dreadful fright.\n\nTREPLIEFF. It is not good for him to live in the country. Mother, if you\nwould only untie your purse-strings for once, and lend him a thousand\nroubles! He could then spend a whole year in town.\n\nARKADINA. I have no money. I am an actress and not a banker. [A pause.]\n\nTREPLIEFF. Please change my bandage for me, mother, you do it so gently.\n\nARKADINA goes to the cupboard and takes out a box of bandages and a\nbottle of iodoform.\n\nARKADINA. The doctor is late.\n\nTREPLIEFF. Yes, he promised to be here at nine, and now it is noon\nalready.\n\nARKADINA. Sit down. [She takes the bandage off his head] You look as if\nyou had a turban on. A stranger that was in the kitchen yesterday asked\nto what nationality you belonged. Your wound is almost healed. [She\nkisses his head] You won't be up to any more of these silly tricks\nagain, will you, when I am gone?\n\nTREPLIEFF. No, mother. I did that in a moment of insane despair, when I\nhad lost all control over myself. It will never happen again. [He kisses\nher hand] Your touch is golden. I remember when you were still acting at\nthe State Theatre, long ago, when I was still a little chap, there was a\nfight one day in our court, and a poor washerwoman was almost beaten to\ndeath. She was picked up unconscious, and you nursed her till she was\nwell, and bathed her children in the washtubs. Have you forgotten it?\n\nARKADINA. Yes, entirely. [She puts on a new bandage.]\n\nTREPLIEFF. Two ballet dancers lived in the same house, and they used to\ncome and drink coffee with you.\n\nARKADINA. I remember that.\n\nTREPLIEFF. They were very pious. [A pause] I love you again, these last\nfew days, as tenderly and trustingly as I did as a child. I have no one\nleft me now but you. Why, why do you let yourself be controlled by that\nman?\n\nARKADINA. You don't understand him, Constantine. He has a wonderfully\nnoble personality.\n\nTREPLIEFF. Nevertheless, when he has been told that I wish to challenge\nhim to a duel his nobility does not prevent him from playing the coward.\nHe is about to beat an ignominious retreat.\n\nARKADINA. What nonsense! I have asked him myself to go.\n\nTREPLIEFF. A noble personality indeed! Here we are almost quarrelling\nover him, and he is probably in the garden laughing at us at this very\nmoment, or else enlightening Nina's mind and trying to persuade her into\nthinking him a man of genius.\n\nARKADINA. You enjoy saying unpleasant things to me. I have the greatest\nrespect for that man, and I must ask you not to speak ill of him in my\npresence.\n\nTREPLIEFF. I have no respect for him at all. You want me to think him a\ngenius, as you do, but I refuse to lie: his books make me sick.\n\nARKADINA. You envy him. There is nothing left for people with no talent\nand mighty pretensions to do but to criticise those who are really\ngifted. I hope you enjoy the consolation it brings.\n\nTREPLIEFF. [With irony] Those who are really gifted, indeed! [Angrily] I\nam cleverer than any of you, if it comes to that! [He tears the bandage\noff his head] You are the slaves of convention, you have seized the\nupper hand and now lay down as law everything that you do; all else you\nstrangle and trample on. I refuse to accept your point of view, yours\nand his, I refuse!\n\nARKADINA. That is the talk of a decadent.\n\nTREPLIEFF. Go back to your beloved stage and act the miserable\nditch-water plays you so much admire!\n\nARKADINA. I never acted in a play like that in my life. You couldn't\nwrite even the trashiest music-hall farce, you idle good-for-nothing!\n\nTREPLIEFF. Miser!\n\nARKADINA. Rag-bag!\n\nTREPLIEFF sits down and begins to cry softly.\n\nARKADINA. [Walking up and down in great excitement] Don't cry! You\nmustn't cry! [She bursts into tears] You really mustn't. [She kisses his\nforehead, his cheeks, his head] My darling child, forgive me. Forgive\nyour wicked mother.\n\nTREPLIEFF. [Embracing her] Oh, if you could only know what it is to have\nlost everything under heaven! She does not love me. I see I shall never\nbe able to write. Every hope has deserted me.\n\nARKADINA. Don't despair. This will all pass. He is going away to-day,\nand she will love you once more. [She wipes away his tears] Stop crying.\nWe have made peace again.\n\nTREPLIEFF. [Kissing her hand] Yes, mother.\n\nARKADINA. [Tenderly] Make your peace with him, too. Don't fight with\nhim. You surely won't fight?\n\nTREPLIEFF. I won't, but you must not insist on my seeing him again,\nmother, I couldn't stand it. [TRIGORIN comes in] There he is; I am\ngoing. [He quickly puts the medicines away in the cupboard] The doctor\nwill attend to my head.\n\nTRIGORIN. [Looking through the pages of a book] Page 121, lines 11 and\n12; here it is. [He reads] \"If at any time you should have need of my\nlife, come and take it.\"\n\nTREPLIEFF picks up the bandage off the floor and goes out.\n\nARKADINA. [Looking at her watch] The carriage will soon be here.\n\nTRIGORIN. [To himself] If at any time you should have need of my life,\ncome and take it.\n\nARKADINA. I hope your things are all packed.\n\nTRIGORIN. [Impatiently] Yes, yes. [In deep thought] Why do I hear a note\nof sadness that wrings my heart in this cry of a pure soul? If at any\ntime you should have need of my life, come and take it. [To ARKADINA]\nLet us stay here one more day!\n\nARKADINA shakes her head.\n\nTRIGORIN. Do let us stay!\n\nARKADINA. I know, dearest, what keeps you here, but you must control\nyourself. Be sober; your emotions have intoxicated you a little.\n\nTRIGORIN. You must be sober, too. Be sensible; look upon what has\nhappened as a true friend would. [Taking her hand] You are capable of\nself-sacrifice. Be a friend to me and release me!\n\nARKADINA. [In deep excitement] Are you so much in love?\n\nTRIGORIN. I am irresistibly impelled toward her. It may be that this is\njust what I need.\n\nARKADINA. What, the love of a country girl? Oh, how little you know\nyourself!\n\nTRIGORIN. People sometimes walk in their sleep, and so I feel as if\nI were asleep, and dreaming of her as I stand here talking to you. My\nimagination is shaken by the sweetest and most glorious visions. Release\nme!\n\nARKADINA. [Shuddering] No, no! I am only an ordinary woman; you must not\nsay such things to me. Do not torment me, Boris; you frighten me.\n\nTRIGORIN. You could be an extraordinary woman if you only would. Love\nalone can bring happiness on earth, love the enchanting, the poetical\nlove of youth, that sweeps away the sorrows of the world. I had no time\nfor it when I was young and struggling with want and laying siege to the\nliterary fortress, but now at last this love has come to me. I see it\nbeckoning; why should I fly?\n\nARKADINA. [With anger] You are mad!\n\nTRIGORIN. Release me.\n\nARKADINA. You have all conspired together to torture me to-day. [She\nweeps.]\n\nTRIGORIN. [Clutching his head desperately] She doesn't understand me!\nShe won't understand me!\n\nARKADINA. Am I then so old and ugly already that you can talk to me like\nthis without any shame about another woman? [She embraces and kisses\nhim] Oh, you have lost your senses! My splendid, my glorious friend, my\nlove for you is the last chapter of my life. [She falls on her knees]\nYou are my pride, my joy, my light. [She embraces his knees] I could\nnever endure it should you desert me, if only for an hour; I should go\nmad. Oh, my wonder, my marvel, my king!\n\nTRIGORIN. Some one might come in. [He helps her to rise.]\n\nARKADINA. Let them come! I am not ashamed of my love. [She kisses his\nhands] My jewel! My despair! You want to do a foolish thing, but I don't\nwant you to do it. I shan't let you do it! [She laughs] You are mine,\nyou are mine! This forehead is mine, these eyes are mine, this silky\nhair is mine. All your being is mine. You are so clever, so wise, the\nfirst of all living writers; you are the only hope of your country. You\nare so fresh, so simple, so deeply humourous. You can bring out every\nfeature of a man or of a landscape in a single line, and your characters\nlive and breathe. Do you think that these words are but the incense of\nflattery? Do you think I am not speaking the truth? Come, look into my\neyes; look deep; do you find lies there? No, you see that I alone know\nhow to treasure you. I alone tell you the truth. Oh, my very dear, you\nwill go with me? You will? You will not forsake me?\n\nTRIGORIN. I have no will of my own; I never had. I am too indolent, too\nsubmissive, too phlegmatic, to have any. Is it possible that women like\nthat? Take me. Take me away with you, but do not let me stir a step from\nyour side.\n\nARKADINA. [To herself] Now he is mine! [Carelessly, as if nothing\nunusual had happened] Of course you must stay here if you really want\nto. I shall go, and you can follow in a week's time. Yes, really, why\nshould you hurry away?\n\nTRIGORIN. Let us go together.\n\nARKADINA. As you like. Let us go together then. [A pause. TRIGORIN\nwrites something in his note-book] What are you writing?\n\nTRIGORIN. A happy expression I heard this morning: \"A grove of maiden\npines.\" It may be useful. [He yawns] So we are really off again,\ncondemned once more to railway carriages, to stations and restaurants,\nto Hamburger steaks and endless arguments!\n\nSHAMRAEFF comes in.\n\nSHAMRAEFF. I am sorry to have to inform you that your carriage is at the\ndoor. It is time to start, honoured madam, the train leaves at two-five.\nWould you be kind enough, madam, to remember to inquire for me where\nSuzdaltzeff the actor is now? Is he still alive, I wonder? Is he well?\nHe and I have had many a jolly time together. He was inimitable in \"The\nStolen Mail.\" A tragedian called Izmailoff was in the same company, I\nremember, who was also quite remarkable. Don't hurry, madam, you still\nhave five minutes. They were both of them conspirators once, in the\nsame melodrama, and one night when in the course of the play they were\nsuddenly discovered, instead of saying \"We have been trapped!\" Izmailoff\ncried out: \"We have been rapped!\" [He laughs] Rapped!\n\nWhile he has been talking JACOB has been busy with the trunks, and the\nmaid has brought ARKADINA her hat, coat, parasol, and gloves. The cook\nlooks hesitatingly through the door on the right, and finally comes into\nthe room. PAULINA comes in. MEDVIEDENKO comes in.\n\nPAULINA. [Presenting ARKADINA with a little basket] Here are some\nplums for the journey. They are very sweet ones. You may want to nibble\nsomething good on the way.\n\nARKADINA. You are very kind, Paulina.\n\nPAULINA. Good-bye, my dearie. If things have not been quite as you could\nhave wished, please forgive us. [She weeps.]\n\nARKADINA. It has been delightful, delightful. You mustn't cry.\n\nSORIN comes in through the door on the left, dressed in a long coat with\na cape, and carrying his hat and cane. He crosses the room.\n\nSORIN. Come, sister, it is time to start, unless you want to miss the\ntrain. I am going to get into the carriage. [He goes out.]\n\nMEDVIEDENKO. I shall walk quickly to the station and see you off there.\n[He goes out.]\n\nARKADINA. Good-bye, all! We shall meet again next summer if we live.\n[The maid servant, JACOB, and the cook kiss her hand] Don't forget me.\n[She gives the cook a rouble] There is a rouble for all three of you.\n\nTHE COOK. Thank you, mistress; a pleasant journey to you.\n\nJACOB. God bless you, mistress.\n\nSHAMRAEFF. Send us a line to cheer us up. [TO TRIGORIN] Good-bye, sir.\n\nARKADINA. Where is Constantine? Tell him I am starting. I must say\ngood-bye to him. [To JACOB] I gave the cook a rouble for all three of\nyou.\n\nAll go out through the door on the right. The stage remains empty.\nSounds of farewell are heard. The maid comes running back to fetch the\nbasket of plums which has been forgotten. TRIGORIN comes back.\n\nTRIGORIN. I had forgotten my cane. I think I left it on the terrace. [He\ngoes toward the door on the right and meets NINA, who comes in at that\nmoment] Is that you? We are off.\n\nNINA. I knew we should meet again. [With emotion] I have come to an\nirrevocable decision, the die is cast: I am going on the stage. I am\ndeserting my father and abandoning everything. I am beginning life anew.\nI am going, as you are, to Moscow. We shall meet there.\n\nTRIGORIN. [Glancing about him] Go to the Hotel Slavianski Bazar. Let\nme know as soon as you get there. I shall be at the Grosholski House in\nMoltchanofka Street. I must go now. [A pause.]\n\nNINA. Just one more minute!\n\nTRIGORIN. [In a low voice] You are so beautiful! What bliss to think\nthat I shall see you again so soon! [She sinks on his breast] I shall\nsee those glorious eyes again, that wonderful, ineffably tender smile,\nthose gentle features with their expression of angelic purity! My\ndarling! [A prolonged kiss.]\n\nThe curtain falls.\n\nTwo years elapse between the third and fourth acts.\n\n\n\n\nACT IV\n\n_A sitting-room in SORIN'S house, which has been converted into a\nwriting-room for TREPLIEFF. To the right and left are doors leading into\ninner rooms, and in the centre is a glass door opening onto a terrace.\nBesides the usual furniture of a sitting-room there is a writing-desk\nin the right-hand corner of the room. There is a Turkish divan near the\ndoor on the left, and shelves full of books stand against the walls.\nBooks are lying scattered about on the windowsills and chairs. It is\nevening. The room is dimly lighted by a shaded lamp on a table. The wind\nmoans in the tree tops and whistles down the chimney. The watchman in\nthe garden is heard sounding his rattle. MEDVIEDENKO and MASHA come in_.\n\nMASHA. [Calling TREPLIEFF] Mr. Constantine, where are you? [Looking\nabout her] There is no one here. His old uncle is forever asking for\nConstantine, and can't live without him for an instant.\n\nMEDVIEDENKO. He dreads being left alone. [Listening to the wind] This is\na wild night. We have had this storm for two days.\n\nMASHA. [Turning up the lamp] The waves on the lake are enormous.\n\nMEDVIEDENKO. It is very dark in the garden. Do you know, I think that\nold theatre ought to be knocked down. It is still standing there, naked\nand hideous as a skeleton, with the curtain flapping in the wind. I\nthought I heard a voice weeping in it as I passed there last night.\n\nMASHA. What an idea! [A pause.]\n\nMEDVIEDENKO. Come home with me, Masha.\n\nMASHA. [Shaking her head] I shall spend the night here.\n\nMEDVIEDENKO. [Imploringly] Do come, Masha. The baby must be hungry.\n\nMASHA. Nonsense, Matriona will feed it. [A pause.]\n\nMEDVIEDENKO. It is a pity to leave him three nights without his mother.\n\nMASHA. You are getting too tiresome. You used sometimes to talk of other\nthings besides home and the baby, home and the baby. That is all I ever\nhear from you now.\n\nMEDVIEDENKO. Come home, Masha.\n\nMASHA. You can go home if you want to.\n\nMEDVIEDENKO. Your father won't give me a horse.\n\nMASHA. Yes, he will; ask him.\n\nMEDVIEDENKO. I think I shall. Are you coming home to-morrow?\n\nMASHA. Yes, yes, to-morrow.\n\nShe takes snuff. TREPLIEFF and PAULINA come in. TREPLIEFF is carrying\nsome pillows and a blanket, and PAULINA is carrying sheets and pillow\ncases. They lay them on the divan, and TREPLIEFF goes and sits down at\nhis desk.\n\nMASHA. Who is that for, mother?\n\nPAULINA. Mr. Sorin asked to sleep in Constantine's room to-night.\n\nMASHA. Let me make the bed.\n\nShe makes the bed. PAULINA goes up to the desk and looks at the\nmanuscripts lying on it. [A pause.]\n\nMEDVIEDENKO. Well, I am going. Good-bye, Masha. [He kisses his wife's\nhand] Good-bye, mother. [He tries to kiss his mother-in-law's hand.]\n\nPAULINA. [Crossly] Be off, in God's name!\n\nTREPLIEFF shakes hands with him in silence, and MEDVIEDENKO goes out.\n\nPAULINA. [Looking at the manuscripts] No one ever dreamed, Constantine,\nthat you would one day turn into a real author. The magazines pay you\nwell for your stories. [She strokes his hair.] You have grown handsome,\ntoo. Dear, kind Constantine, be a little nicer to my Masha.\n\nMASHA. [Still making the bed] Leave him alone, mother.\n\nPAULINA. She is a sweet child. [A pause] A woman, Constantine, asks only\nfor kind looks. I know that from experience.\n\nTREPLIEFF gets up from his desk and goes out without a word.\n\nMASHA. There now! You have vexed him. I told you not to bother him.\n\nPAULINA. I am sorry for you, Masha.\n\nMASHA. Much I need your pity!\n\nPAULINA. My heart aches for you. I see how things are, and understand.\n\nMASHA. You see what doesn't exist. Hopeless love is only found in\nnovels. It is a trifle; all one has to do is to keep a tight rein on\noneself, and keep one's head clear. Love must be plucked out the moment\nit springs up in the heart. My husband has been promised a school in\nanother district, and when we have once left this place I shall forget\nit all. I shall tear my passion out by the roots. [The notes of a\nmelancholy waltz are heard in the distance.]\n\nPAULINA. Constantine is playing. That means he is sad.\n\nMASHA silently waltzes a few turns to the music.\n\nMASHA. The great thing, mother, is not to have him continually in sight.\nIf my Simon could only get his remove I should forget it all in a month\nor two. It is a trifle.\n\nDORN and MEDVIEDENKO come in through the door on the left, wheeling\nSORIN in an arm-chair.\n\nMEDVIEDENKO. I have six mouths to feed now, and flour is at seventy\nkopecks.\n\nDORN. A hard riddle to solve!\n\nMEDVIEDENKO. It is easy for you to make light of it. You are rich enough\nto scatter money to your chickens, if you wanted to.\n\nDORN. You think I am rich? My friend, after practising for thirty years,\nduring which I could not call my soul my own for one minute of the night\nor day, I succeeded at last in scraping together one thousand roubles,\nall of which went, not long ago, in a trip which I took abroad. I\nhaven't a penny.\n\nMASHA. [To her husband] So you didn't go home after all?\n\nMEDVIEDENKO. [Apologetically] How can I go home when they won't give me\na horse?\n\nMASHA. [Under her breath, with bitter anger] Would I might never see\nyour face again!\n\nSORIN in his chair is wheeled to the left-hand side of the room.\nPAULINA, MASHA, and DORN sit down beside him. MEDVIEDENKO stands sadly\naside.\n\nDORN. What a lot of changes you have made here! You have turned this\nsitting-room into a library.\n\nMASHA. Constantine likes to work in this room, because from it he can\nstep out into the garden to meditate whenever he feels like it. [The\nwatchman's rattle is heard.]\n\nSORIN. Where is my sister?\n\nDORN. She has gone to the station to meet Trigorin. She will soon be\nback.\n\nSORIN. I must be dangerously ill if you had to send for my sister.\n[He falls silent for a moment] A nice business this is! Here I am\ndangerously ill, and you won't even give me any medicine.\n\nDORN. What shall I prescribe for you? Camomile tea? Soda? Quinine?\n\nSORIN. Don't inflict any of your discussions on me again. [He nods\ntoward the sofa] Is that bed for me?\n\nPAULINA. Yes, for you, sir.\n\nSORIN. Thank you.\n\nDORN. [Sings] \"The moon swims in the sky to-night.\"\n\nSORIN. I am going to give Constantine an idea for a story. It shall be\ncalled \"The Man Who Wished--L'Homme qui a voulu.\" When I was young, I\nwished to become an author; I failed. I wished to be an orator; I speak\nabominably, [Exciting himself] with my eternal \"and all, and all,\"\ndragging each sentence on and on until I sometimes break out into a\nsweat all over. I wished to marry, and I didn't; I wished to live in the\ncity, and here I am ending my days in the country, and all.\n\nDORN. You wished to become State Councillor, and--you are one!\n\nSORIN. [Laughing] I didn't try for that, it came of its own accord.\n\nDORN. Come, you must admit that it is petty to cavil at life at\nsixty-two years of age.\n\nSORIN. You are pig-headed! Can't you see I want to live?\n\nDORN. That is futile. Nature has commanded that every life shall come to\nan end.\n\nSORIN. You speak like a man who is satiated with life. Your thirst for\nit is quenched, and so you are calm and indifferent, but even you dread\ndeath.\n\nDORN. The fear of death is an animal passion which must be overcome.\nOnly those who believe in a future life and tremble for sins committed,\ncan logically fear death; but you, for one thing, don't believe in a\nfuture life, and for another, you haven't committed any sins. You have\nserved as a Councillor for twenty-five years, that is all.\n\nSORIN. [Laughing] Twenty-eight years!\n\nTREPLIEFF comes in and sits down on a stool at SORIN'S feet. MASHA fixes\nher eyes on his face and never once tears them away.\n\nDORN. We are keeping Constantine from his work.\n\nTREPLIEFF. No matter. [A pause.]\n\nMEDVIEDENKO. Of all the cities you visited when you were abroad, Doctor,\nwhich one did you like the best?\n\nDORN. Genoa.\n\nTREPLIEFF. Why Genoa?\n\nDORN. Because there is such a splendid crowd in its streets. When you\nleave the hotel in the evening, and throw yourself into the heart of\nthat throng, and move with it without aim or object, swept along, hither\nand thither, their life seems to be yours, their soul flows into you,\nand you begin to believe at last in a great world spirit, like the one\nin your play that Nina Zarietchnaya acted. By the way, where is Nina\nnow? Is she well?\n\nTREPLIEFF. I believe so.\n\nDORN. I hear she has led rather a strange life; what happened?\n\nTREPLIEFF. It is a long story, Doctor.\n\nDORN. Tell it shortly. [A pause.]\n\nTREPLIEFF. She ran away from home and joined Trigorin; you know that?\n\nDORN. Yes.\n\nTREPLIEFF. She had a child that died. Trigorin soon tired of her and\nreturned to his former ties, as might have been expected. He had\nnever broken them, indeed, but out of weakness of character had always\nvacillated between the two. As far as I can make out from what I have\nheard, Nina's domestic life has not been altogether a success.\n\nDORN. What about her acting?\n\nTREPLIEFF. I believe she made an even worse failure of that. She made\nher debut on the stage of the Summer Theatre in Moscow, and afterward\nmade a tour of the country towns. At that time I never let her out of my\nsight, and wherever she went I followed. She always attempted great\nand difficult parts, but her delivery was harsh and monotonous, and her\ngestures heavy and crude. She shrieked and died well at times, but those\nwere but moments.\n\nDORN. Then she really has a talent for acting?\n\nTREPLIEFF. I never could make out. I believe she has. I saw her, but she\nrefused to see me, and her servant would never admit me to her rooms. I\nappreciated her feelings, and did not insist upon a meeting. [A pause]\nWhat more can I tell you? She sometimes writes to me now that I have\ncome home, such clever, sympathetic letters, full of warm feeling. She\nnever complains, but I can tell that she is profoundly unhappy; not a\nline but speaks to me of an aching, breaking nerve. She has one strange\nfancy; she always signs herself \"The Sea-gull.\" The miller in \"Rusalka\"\ncalled himself \"The Crow,\" and so she repeats in all her letters that\nshe is a sea-gull. She is here now.\n\nDORN. What do you mean by \"here?\"\n\nTREPLIEFF. In the village, at the inn. She has been there for five days.\nI should have gone to see her, but Masha here went, and she refuses to\nsee any one. Some one told me she had been seen wandering in the fields\na mile from here yesterday evening.\n\nMEDVIEDENKO. Yes, I saw her. She was walking away from here in the\ndirection of the village. I asked her why she had not been to see us.\nShe said she would come.\n\nTREPLIEFF. But she won't. [A pause] Her father and stepmother have\ndisowned her. They have even put watchmen all around their estate to\nkeep her away. [He goes with the doctor toward the desk] How easy it is,\nDoctor, to be a philosopher on paper, and how difficult in real life!\n\nSORIN. She was a beautiful girl. Even the State Councillor himself was\nin love with her for a time.\n\nDORN. You old Lovelace, you!\n\nSHAMRAEFF'S laugh is heard.\n\nPAULINA. They are coming back from the station.\n\nTREPLIEFF. Yes, I hear my mother's voice.\n\nARKADINA and TRIGORIN come in, followed by SHAMRAEFF.\n\nSHAMRAEFF. We all grow old and wither, my lady, while you alone, with\nyour light dress, your gay spirits, and your grace, keep the secret of\neternal youth.\n\nARKADINA. You are still trying to turn my head, you tiresome old man.\n\nTRIGORIN. [To SORIN] How do you do, Peter? What, still ill? How silly of\nyou! [With evident pleasure, as he catches sight of MASHA] How are you,\nMiss Masha?\n\nMASHA. So you recognised me? [She shakes hands with him.]\n\nTRIGORIN. Did you marry him?\n\nMASHA. Long ago.\n\nTRIGORIN. You are happy now? [He bows to DORN and MEDVIEDENKO, and then\ngoes hesitatingly toward TREPLIEFF] Your mother says you have forgotten\nthe past and are no longer angry with me.\n\nTREPLIEFF gives him his hand.\n\nARKADINA. [To her son] Here is a magazine that Boris has brought you\nwith your latest story in it.\n\nTREPLIEFF. [To TRIGORIN, as he takes the magazine] Many thanks; you are\nvery kind.\n\nTRIGORIN. Your admirers all send you their regards. Every one in Moscow\nand St. Petersburg is interested in you, and all ply me with questions\nabout you. They ask me what you look like, how old you are, whether you\nare fair or dark. For some reason they all think that you are no longer\nyoung, and no one knows who you are, as you always write under an\nassumed name. You are as great a mystery as the Man in the Iron Mask.\n\nTREPLIEFF. Do you expect to be here long?\n\nTRIGORIN. No, I must go back to Moscow to-morrow. I am finishing another\nnovel, and have promised something to a magazine besides. In fact, it is\nthe same old business.\n\nDuring their conversation ARKADINA and PAULINA have put up a card-table\nin the centre of the room; SHAMRAEFF lights the candles and arranges the\nchairs, then fetches a box of lotto from the cupboard.\n\nTRIGORIN. The weather has given me a rough welcome. The wind is\nfrightful. If it goes down by morning I shall go fishing in the\nlake, and shall have a look at the garden and the spot--do you\nremember?--where your play was given. I remember the piece very well,\nbut should like to see again where the scene was laid.\n\nMASHA. [To her father] Father, do please let my husband have a horse. He\nought to go home.\n\nSHAMRAEFF. [Angrily] A horse to go home with! [Sternly] You know the\nhorses have just been to the station. I can't send them out again.\n\nMASHA. But there are other horses. [Seeing that her father remains\nsilent] You are impossible!\n\nMEDVIEDENKO. I shall go on foot, Masha.\n\nPAULINA. [With a sigh] On foot in this weather? [She takes a seat at the\ncard-table] Shall we begin?\n\nMEDVIEDENKO. It is only six miles. Good-bye. [He kisses his wife's\nhand;] Good-bye, mother. [His mother-in-law gives him her hand\nunwillingly] I should not have troubled you all, but the baby--[He bows\nto every one] Good-bye. [He goes out with an apologetic air.]\n\nSHAMRAEFF. He will get there all right, he is not a major-general.\n\nPAULINA. Come, let us begin. Don't let us waste time, we shall soon be\ncalled to supper.\n\nSHAMRAEFF, MASHA, and DORN sit down at the card-table.\n\nARKADINA. [To TRIGORIN] When the long autumn evenings descend on us we\nwhile away the time here by playing lotto. Look at this old set; we used\nit when our mother played with us as children. Don't you want to take a\nhand in the game with us until supper time? [She and TRIGORIN sit down\nat the table] It is a monotonous game, but it is all right when one gets\nused to it. [She deals three cards to each of the players.]\n\nTREPLIEFF. [Looking through the pages of the magazine] He has read his\nown story, and hasn't even cut the pages of mine.\n\nHe lays the magazine on his desk and goes toward the door on the right,\nstopping as he passes his mother to give her a kiss.\n\nARKADINA. Won't you play, Constantine?\n\nTREPLIEFF. No, excuse me please, I don't feel like it. I am going to\ntake a turn through the rooms. [He goes out.]\n\nMASHA. Are you all ready? I shall begin: twenty-two.\n\nARKADINA. Here it is.\n\nMASHA. Three.\n\nDORN. Right.\n\nMASHA. Have you put down three? Eight. Eighty-one. Ten.\n\nSHAMRAEFF. Don't go so fast.\n\nARKADINA. Could you believe it? I am still dazed by the reception they\ngave me in Kharkoff.\n\nMASHA. Thirty-four. [The notes of a melancholy waltz are heard.]\n\nARKADINA. The students gave me an ovation; they sent me three baskets of\nflowers, a wreath, and this thing here.\n\nShe unclasps a brooch from her breast and lays it on the table.\n\nSHAMRAEFF. There is something worth while!\n\nMASHA. Fifty.\n\nDORN. Fifty, did you say?\n\nARKADINA. I wore a perfectly magnificent dress; I am no fool when it\ncomes to clothes.\n\nPAULINA. Constantine is playing again; the poor boy is sad.\n\nSHAMRAEFF. He has been severely criticised in the papers.\n\nMASHA. Seventy-seven.\n\nARKADINA. They want to attract attention to him.\n\nTRIGORIN. He doesn't seem able to make a success, he can't somehow\nstrike the right note. There is an odd vagueness about his writings\nthat sometimes verges on delirium. He has never created a single living\ncharacter.\n\nMASHA. Eleven.\n\nARKADINA. Are you bored, Peter? [A pause] He is asleep.\n\nDORN. The Councillor is taking a nap.\n\nMASHA. Seven. Ninety.\n\nTRIGORIN. Do you think I should write if I lived in such a place as\nthis, on the shore of this lake? Never! I should overcome my passion,\nand give my life up to the catching of fish.\n\nMASHA. Twenty-eight.\n\nTRIGORIN. And if I caught a perch or a bass, what bliss it would be!\n\nDORN. I have great faith in Constantine. I know there is something in\nhim. He thinks in images; his stories are vivid and full of colour,\nand always affect me deeply. It is only a pity that he has no definite\nobject in view. He creates impressions, and nothing more, and one cannot\ngo far on impressions alone. Are you glad, madam, that you have an\nauthor for a son?\n\nARKADINA. Just think, I have never read anything of his; I never have\ntime.\n\nMASHA. Twenty-six.\n\nTREPLIEFF comes in quietly and sits down at his table.\n\nSHAMRAEFF. [To TRIGORIN] We have something here that belongs to you,\nsir.\n\nTRIGORIN. What is it?\n\nSHAMRAEFF. You told me to have the sea-gull stuffed that Mr. Constantine\nkilled some time ago.\n\nTRIGORIN. Did I? [Thoughtfully] I don't remember.\n\nMASHA. Sixty-one. One.\n\nTREPLIEFF throws open the window and stands listening.\n\nTREPLIEFF. How dark the night is! I wonder what makes me so restless.\n\nARKADINA. Shut the window, Constantine, there is a draught here.\n\nTREPLIEFF shuts the window.\n\nMASHA. Ninety-eight.\n\nTRIGORIN. See, my card is full.\n\nARKADINA. [Gaily] Bravo! Bravo!\n\nSHAMRAEFF. Bravo!\n\nARKADINA. Wherever he goes and whatever he does, that man always has\ngood luck. [She gets up] And now, come to supper. Our renowned guest did\nnot have any dinner to-day. We can continue our game later. [To her son]\nCome, Constantine, leave your writing and come to supper.\n\nTREPLIEFF. I don't want anything to eat, mother; I am not hungry.\n\nARKADINA. As you please. [She wakes SORIN] Come to supper, Peter. [She\ntakes SHAMRAEFF'S arm] Let me tell you about my reception in Kharkoff.\n\nPAULINA blows out the candles on the table, then she and DORN roll\nSORIN'S chair out of the room, and all go out through the door on the\nleft, except TREPLIEFF, who is left alone. TREPLIEFF prepares to write.\nHe runs his eye over what he has already written.\n\nTREPLIEFF. I have talked a great deal about new forms of art, but I feel\nmyself gradually slipping into the beaten track. [He reads] \"The\nplacard cried it from the wall--a pale face in a frame of dusky\nhair\"--cried--frame--that is stupid. [He scratches out what he has\nwritten] I shall begin again from the place where my hero is wakened by\nthe noise of the rain, but what follows must go. This description of a\nmoonlight night is long and stilted. Trigorin has worked out a process\nof his own, and descriptions are easy for him. He writes that the neck\nof a broken bottle lying on the bank glittered in the moonlight, and\nthat the shadows lay black under the mill-wheel. There you have a\nmoonlight night before your eyes, but I speak of the shimmering light,\nthe twinkling stars, the distant sounds of a piano melting into the\nstill and scented air, and the result is abominable. [A pause] The\nconviction is gradually forcing itself upon me that good literature is\nnot a question of forms new or old, but of ideas that must pour freely\nfrom the author's heart, without his bothering his head about any forms\nwhatsoever. [A knock is heard at the window nearest the table] What was\nthat? [He looks out of the window] I can't see anything. [He opens the\nglass door and looks out into the garden] I heard some one run down\nthe steps. [He calls] Who is there? [He goes out, and is heard walking\nquickly along the terrace. In a few minutes he comes back with NINA\nZARIETCHNAYA] Oh, Nina, Nina!\n\nNINA lays her head on TREPLIEFF'S breast and stifles her sobs.\n\nTREPLIEFF. [Deeply moved] Nina, Nina! It is you--you! I felt you would\ncome; all day my heart has been aching for you. [He takes off her hat\nand cloak] My darling, my beloved has come back to me! We mustn't cry,\nwe mustn't cry.\n\nNINA. There is some one here.\n\nTREPLIEFF. No one is here.\n\nNINA. Lock the door, some one might come.\n\nTREPLIEFF. No one will come in.\n\nNINA. I know your mother is here. Lock the door.\n\nTREPLIEFF locks the door on the right and comes back to NINA.\n\nTREPLIEFF. There is no lock on that one. I shall put a chair against\nit. [He puts an arm-chair against the door] Don't be frightened, no one\nshall come in.\n\nNINA. [Gazing intently into his face] Let me look at you. [She looks\nabout her] It is warm and comfortable in here. This used to be a\nsitting-room. Have I changed much?\n\nTREPLIEFF. Yes, you have grown thinner, and your eyes are larger than\nthey were. Nina, it seems so strange to see you! Why didn't you let me\ngo to you? Why didn't you come sooner to me? You have been here nearly a\nweek, I know. I have been several times each day to where you live, and\nhave stood like a beggar beneath your window.\n\nNINA. I was afraid you might hate me. I dream every night that you look\nat me without recognising me. I have been wandering about on the shores\nof the lake ever since I came back. I have often been near your house,\nbut I have never had the courage to come in. Let us sit down. [They sit\ndown] Let us sit down and talk our hearts out. It is so quiet and warm\nin here. Do you hear the wind whistling outside? As Turgenieff says,\n\"Happy is he who can sit at night under the roof of his home, who has a\nwarm corner in which to take refuge.\" I am a sea-gull--and yet--no.\n[She passes her hand across her forehead] What was I saying? Oh, yes,\nTurgenieff. He says, \"and God help all houseless wanderers.\" [She sobs.]\n\nTREPLIEFF. Nina! You are crying again, Nina!\n\nNINA. It is all right. I shall feel better after this. I have not cried\nfor two years. I went into the garden last night to see if our old\ntheatre were still standing. I see it is. I wept there for the first\ntime in two years, and my heart grew lighter, and my soul saw more\nclearly again. See, I am not crying now. [She takes his hand in hers]\nSo you are an author now, and I am an actress. We have both been sucked\ninto the whirlpool. My life used to be as happy as a child's; I used to\nwake singing in the morning; I loved you and dreamt of fame, and what is\nthe reality? To-morrow morning early I must start for Eltz by train in\na third-class carriage, with a lot of peasants, and at Eltz the educated\ntrades-people will pursue me with compliments. It is a rough life.\n\nTREPLIEFF. Why are you going to Eltz?\n\nNINA. I have accepted an engagement there for the winter. It is time for\nme to go.\n\nTREPLIEFF. Nina, I have cursed you, and hated you, and torn up your\nphotograph, and yet I have known every minute of my life that my heart\nand soul were yours for ever. To cease from loving you is beyond my\npower. I have suffered continually from the time I lost you and began\nto write, and my life has been almost unendurable. My youth was suddenly\nplucked from me then, and I seem now to have lived in this world for\nninety years. I have called out to you, I have kissed the ground you\nwalked on, wherever I looked I have seen your face before my eyes, and\nthe smile that had illumined for me the best years of my life.\n\nNINA. [Despairingly] Why, why does he talk to me like this?\n\nTREPLIEFF. I am quite alone, unwarmed by any attachment. I am as cold\nas if I were living in a cave. Whatever I write is dry and gloomy and\nharsh. Stay here, Nina, I beseech you, or else let me go away with you.\n\nNINA quickly puts on her coat and hat.\n\nTREPLIEFF. Nina, why do you do that? For God's sake, Nina! [He watches\nher as she dresses. A pause.]\n\nNINA. My carriage is at the gate. Do not come out to see me off. I shall\nfind the way alone. [Weeping] Let me have some water.\n\nTREPLIEFF hands her a glass of water.\n\nTREPLIEFF. Where are you going?\n\nNINA. Back to the village. Is your mother here?\n\nTREPLIEFF. Yes, my uncle fell ill on Thursday, and we telegraphed for\nher to come.\n\nNINA. Why do you say that you have kissed the ground I walked on? You\nshould kill me rather. [She bends over the table] I am so tired. If I\ncould only rest--rest. [She raises her head] I am a sea-gull--no--no,\nI am an actress. [She hears ARKADINA and TRIGORIN laughing in the\ndistance, runs to the door on the left and looks through the keyhole] He\nis there too. [She goes back to TREPLIEFF] Ah, well--no matter. He\ndoes not believe in the theatre; he used to laugh at my dreams, so that\nlittle by little I became down-hearted and ceased to believe in it too.\nThen came all the cares of love, the continual anxiety about my little\none, so that I soon grew trivial and spiritless, and played my parts\nwithout meaning. I never knew what to do with my hands, and I could not\nwalk properly or control my voice. You cannot imagine the state of mind\nof one who knows as he goes through a play how terribly badly he is\nacting. I am a sea-gull--no--no, that is not what I meant to say. Do you\nremember how you shot a seagull once? A man chanced to pass that way and\ndestroyed it out of idleness. That is an idea for a short story, but it\nis not what I meant to say. [She passes her hand across her forehead]\nWhat was I saying? Oh, yes, the stage. I have changed now. Now I am a\nreal actress. I act with joy, with exaltation, I am intoxicated by it,\nand feel that I am superb. I have been walking and walking, and thinking\nand thinking, ever since I have been here, and I feel the strength of\nmy spirit growing in me every day. I know now, I understand at last,\nConstantine, that for us, whether we write or act, it is not the honour\nand glory of which I have dreamt that is important, it is the strength\nto endure. One must know how to bear one's cross, and one must have\nfaith. I believe, and so do not suffer so much, and when I think of my\ncalling I do not fear life.\n\nTREPLIEFF. [Sadly] You have found your way, you know where you are\ngoing, but I am still groping in a chaos of phantoms and dreams, not\nknowing whom and what end I am serving by it all. I do not believe in\nanything, and I do not know what my calling is.\n\nNINA. [Listening] Hush! I must go. Good-bye. When I have become a\nfamous actress you must come and see me. Will you promise to come? But\nnow--[She takes his hand] it is late. I can hardly stand. I am fainting.\nI am hungry.\n\nTREPLIEFF. Stay, and let me bring you some supper.\n\nNINA. No, no--and don't come out, I can find the way alone. My carriage\nis not far away. So she brought him back with her? However, what\ndifference can that make to me? Don't tell Trigorin anything when you\nsee him. I love him--I love him even more than I used to. It is an idea\nfor a short story. I love him--I love him passionately--I love him to\ndespair. Have you forgotten, Constantine, how pleasant the old times\nwere? What a gay, bright, gentle, pure life we led? How a feeling as\nsweet and tender as a flower blossomed in our hearts? Do you remember,\n[She recites] \"All men and beasts, lions, eagles, and quails, horned\nstags, geese, spiders, silent fish that inhabit the waves, starfish from\nthe sea, and creatures invisible to the eye--in one word, life--all, all\nlife, completing the dreary round set before it, has died out at last.\nA thousand years have passed since the earth last bore a living creature\non its breast, and the unhappy moon now lights her lamp in vain. No\nlonger are the cries of storks heard in the meadows, or the drone of\nbeetles in the groves of limes----\"\n\nShe embraces TREPLIEFF impetuously and runs out onto the terrace.\n\nTREPLIEFF. [After a pause] It would be a pity if she were seen in the\ngarden. My mother would be distressed.\n\nHe stands for several minutes tearing up his manuscripts and throwing\nthem under the table, then unlocks the door on the right and goes out.\n\nDORN. [Trying to force open the door on the left] Odd! This door seems\nto be locked. [He comes in and puts the chair back in its former place]\nThis is like a hurdle race.\n\nARKADINA and PAULINA come in, followed by JACOB carrying some bottles;\nthen come MASHA, SHAMRAEFF, and TRIGORIN.\n\nARKADINA. Put the claret and the beer here, on the table, so that we can\ndrink while we are playing. Sit down, friends.\n\nPAULINA. And bring the tea at once.\n\nShe lights the candles and takes her seat at the card-table. SHAMRAEFF\nleads TRIGORIN to the cupboard.\n\nSHAMRAEFF. Here is the stuffed sea-gull I was telling you about. [He\ntakes the sea-gull out of the cupboard] You told me to have it done.\n\nTRIGORIN. [looking at the bird] I don't remember a thing about it, not a\nthing. [A shot is heard. Every one jumps.]\n\nARKADINA. [Frightened] What was that?\n\nDORN. Nothing at all; probably one of my medicine bottles has blown up.\nDon't worry. [He goes out through the door on the right, and comes back\nin a few moments] It is as I thought, a flask of ether has exploded. [He\nsings]\n\n\"Spellbound once more I stand before thee.\"\n\nARKADINA. [Sitting down at the table] Heavens! I was really frightened.\nThat noise reminded me of--[She covers her face with her hands]\nEverything is black before my eyes.\n\nDORN. [Looking through the pages of a magazine, to TRIGORIN] There was\nan article from America in this magazine about two months ago that I\nwanted to ask you about, among other things. [He leads TRIGORIN to the\nfront of the stage] I am very much interested in this question. [He\nlowers his voice and whispers] You must take Madame Arkadina away from\nhere; what I wanted to say was, that Constantine has shot himself.\n\nThe curtain falls.", "title": "The Sea-Gull"}