{"summary": "Candide contains thirty episodic chapters, which may be grouped into two main schemes: one consists of two divisions, separated by the protagonist's hiatus in El Dorado; the other consists of three parts, each defined by its geographical setting. By the former scheme, the first half of Candide constitutes the rising action and the last part the resolution. This view is supported by the strong theme of travel and quest, reminiscent of adventure and picaresque novels, which tend to employ such a dramatic structure. By the latter scheme, the thirty chapters may be grouped into three parts each comprising ten chapters and defined by locale: I–X are set in Europe, XI–XX are set in the Americas, and XXI–XXX are set in Europe and the Ottoman Empire. The plot summary that follows uses this second format and includes Voltaire's additions of 1761.\n\nThe tale of Candide begins in the castle of the Baron Thunder-ten-Tronckh in Westphalia, home to: the Baron's daughter, Lady Cunégonde; his bastard nephew, Candide; a tutor, Pangloss; a chambermaid, Paquette; and the rest of the Baron's family. The protagonist, Candide, is romantically attracted to Cunégonde. He is a child of \"the most unaffected simplicity\", whose face is \"the index of his mind\". Dr. Pangloss, professor of \"métaphysico-théologo-cosmolonigologie\" (English translation: \"metaphysico-theologo-cosmonigology\") and self-proclaimed optimist, teaches his pupils that they live in the \"best of all possible worlds\" and that \"all is for the best\".\n\nAll is well in the castle until Cunégonde sees Pangloss sexually engaged with Paquette in some bushes. Encouraged by this show of affection, Cunégonde drops her handkerchief next to Candide which entices him to kiss her. For this infraction, Candide is evicted from the castle, at which point he is captured by Bulgar (Prussian) recruiters and coerced into military service, where he is flogged, nearly executed, and forced to participate in a major battle between the Bulgars and the Abares (an allegory representing the Prussians and the French). Candide eventually escapes the army and makes his way to Holland where he is given aid by Jacques, an Anabaptist, who strengthens Candide's optimism. Soon after, Candide finds his master Pangloss, now a beggar with syphilis. Pangloss reveals he was infected with this disease by Paquette and shocks Candide by relating how Castle Thunder-ten-Tronckh was destroyed by Bulgars, and that Cunégonde and her whole family were killed. Pangloss is cured of his illness by Jacques, losing one eye and one ear in the process, and the three set sail to Lisbon.\nIn Lisbon's harbor, they are overtaken by a vicious storm which destroys the boat. Jacques attempts to save a sailor, and in the process is thrown overboard. The sailor makes no move to help the drowning Jacques, and Candide is in a state of despair until Pangloss explains to him that Lisbon harbor was created in order for Jacques to drown. Only Pangloss, Candide, and the \"brutish sailor\" who let Jacques drown survive the wreck and reach Lisbon, which is promptly hit by an earthquake, tsunami and fire that kill tens of thousands. The sailor leaves in order to loot the rubble while Candide, injured and begging for help, is lectured on the optimistic view of the situation by Pangloss.\nThe next day, Pangloss discusses his optimistic philosophy with a member of the Portuguese Inquisition, and he and Candide are arrested for heresy, set to be tortured and killed in an \"auto-da-fé\" set up to appease God and prevent another disaster. Candide is flogged and sees Pangloss hanged, but another earthquake intervenes and he escapes. He is approached by an old woman, who leads him to a house where Lady Cunégonde waits, alive. Candide is surprised: Pangloss had told him that Cunégonde had been raped and disemboweled. She had been, but Cunégonde points out that people survive such things. However, her rescuer sold her to a Jewish merchant who was then threatened by a corrupt Grand Inquisitor into sharing her. Her owners arrive, find her with another man, and Candide kills them both. Candide and the two women flee the city, heading to the Americas. Along the way, Cunégonde falls into self-pity, complaining of all the misfortunes that have befallen her. The old woman reciprocates by revealing her own tragic life, which included having a buttock cut off in order to feed some starving men.\n\nThe trio arrives in Buenos Aires, where Governor Don Fernando d'Ibarra y Figueroa y Mascarenes y Lampourdos y Alejandro asks to marry Cunégonde. Just then, an alcalde (a Spanish fortress commander) arrives, pursuing Candide for killing the Grand Inquisitor. Leaving the women behind, Candide flees to Paraguay with his practical and heretofore unmentioned manservant, Cacambo.\n\nAt a border post on the way to Paraguay, Cacambo and Candide speak to the commandant, who turns out to be Cunégonde's unnamed brother. He explains that after his family was slaughtered, the Jesuits' preparation for his burial revived him, and he has since joined the order. When Candide proclaims he intends to marry Cunégonde, her brother attacks him, and Candide stabs him through with his rapier. After lamenting all the people (mainly priests) he has killed, he and Cacambo flee. In their flight, Candide and Cacambo come across two naked women being chased and bitten by a pair of monkeys. Candide, seeking to protect the women, shoots and kills the monkeys, but is informed by Cacambo that the monkeys and women were probably lovers.\nCacambo and Candide are captured by Oreillons, or Orejones; members of the Inca nobility who widened the lobes of their ears, and are depicted here as the fictional inhabitants of the area. Mistaking Candide for a Jesuit by his robes, the Oreillons prepare to cook Candide and Cacambo; however, Cacambo convinces the Oreillons that Candide killed a Jesuit to procure the robe. Cacambo and Candide are released and travel for a month on foot and then down a river by canoe, living on fruits and berries.\nAfter a few more adventures, Candide and Cacambo wander into El Dorado, a geographically isolated utopia where the streets are covered with precious stones, there exist no priests, and all of the king's jokes are funny. Candide and Cacambo stay a month in El Dorado, but Candide is still in pain without Cunégonde, and expresses to the king his wish to leave. The king points out that this is a foolish idea, but generously helps them do so. The pair continue their journey, now accompanied by one hundred red pack sheep carrying provisions and incredible sums of money, which they slowly lose or have stolen over the next few adventures.\nCandide and Cacambo eventually reach Suriname, where they split up: Cacambo travels to Buenos Aires to retrieve Lady Cunégonde, while Candide prepares to travel to Europe to await the two. Candide's remaining sheep are stolen, and Candide is fined heavily by a Dutch magistrate for petulance over the theft. Before leaving Suriname, Candide feels in need of companionship, so he interviews a number of local men who have been through various ill-fortunes and settles on a man named Martin.\n\nThis companion, Martin, is a Manichaean scholar based on the real-life pessimist Pierre Bayle, who was a chief opponent of Leibniz. For the remainder of the voyage, Martin and Candide argue about philosophy, Martin painting the entire world as occupied by fools. Candide, however, remains an optimist at heart, since it is all he knows. As they arrive in England, they see an admiral (based on Admiral Byng) being shot for not killing enough of the enemy. Martin explains that Britain finds it necessary to shoot an admiral from time to time \"pour l'encouragement des autres\" (to encourage the others). Candide, horrified, arranges for them to leave Britain immediately. After various scenes satirising other European institutions, Candide and Martin meet Paquette, the chambermaid who infected Pangloss with his syphilis, in Venice. She is now a prostitute, and is spending her time with a monk, Brother Giroflée. Although both appear happy on the surface, they reveal their despair: Paquette has led a miserable existence as a sexual object, and the monk detests the religious order in which he was indoctrinated.\nLater, while Candide and Martin are eating supper, Cacambo returns to Candide and informs him that Cunégonde is in Constantinople, and that she has been enslaved. She is now washing dishes for a prince of Transylvania, and has become ugly. On the way to rescue her, Candide finds Pangloss and Cunégonde's brother rowing in the galley. Candide buys their freedom and further passage at steep prices. The baron and Pangloss relate how they survived, but despite the horrors he has been through, Pangloss's optimism remains unshaken: \"I still hold to my original opinions, because, after all, I'm a philosopher, and it wouldn't be proper for me to recant, since Leibniz cannot be wrong, and since pre-established harmony is the most beautiful thing in the world, along with the plenum and subtle matter.\"\nThe travellers arrive on the Ottoman coast where they rejoin Cunégonde and the old woman. Cunégonde has indeed become hideously ugly, but Candide nevertheless buys their freedom and marries Cunégonde to spite her brother. Paquette and Brother Giroflée, too, are reconciled with Candide on a farm which he just bought with the last of his finances.\nOne day, the protagonists seek out a dervish known as a great philosopher of the land. Pangloss asks him why Man is made to suffer so, and what they all ought to do. The dervish responds by asking rhetorically why Pangloss is concerned about the existence of evil and good. The dervish describes human beings as mice on a ship sent by a king to Egypt; their comfort does not matter to the king. The dervish then slams his door on the group. Returning to their farm, Candide, Pangloss, and Martin meet a Turk whose philosophy is to devote his life only to simple work and not concern himself with external affairs. He and his four children work a small farm to keep \"free of three great evils: boredom, vice and necessity\", or \"poverty\" as per John Butt's 1947 translation. Candide, Pangloss, Martin, Cunégonde, Paquette, Cacambo, the old woman, and Brother Giroflée all set to work (on this \"louable dessein\", or \"commendable plan\", as the narrator calls it) on a farm of their own, each to one specific task. Candide ignores Pangloss's insistence that all turned out for the best by necessity, instead telling him \"we must cultivate our garden\".\n\n", "full_text": "*       *       *       *       *\n    +------------------------------------------------------------+\n    | Transcriber's Note:                                        |\n    |                                                            |\n    | Obvious typographical errors have been corrected in        |\n    | this text. For a complete list, please see the bottom of   |\n    | this document.                                             |\n    |                                                            |\n    +------------------------------------------------------------+\n\n       *       *       *       *       *\n\n\n\nTHE MODERN LIBRARY\n\nOF THE WORLD'S BEST BOOKS\n\n\n\n\nCANDIDE BY VOLTAIRE\n\n\n     The Publishers will be glad to mail complete list of titles\n     in the Modern Library. The list is representative of the\n     Great Moderns and is one of the most important contributions\n     to publishing that has been made for many years. Every\n     reader of books will find titles he needs at a low price in\n     an attractive form.\n\n\n[Illustration: Voltaire.]\n\n\n\n\nCANDIDE\n\nBY VOLTAIRE\n\nINTRODUCTION BY PHILIP LITTELL\n\nBONI AND LIVERIGHT, INC.\n\nPUBLISHERS NEW YORK\n\nCopyright, 1918, by\nBONI & LIVERIGHT, INC.\n\nPrinted in the United States of America\n\n\n\n\nINTRODUCTION\n\n\nEver since 1759, when Voltaire wrote \"Candide\" in ridicule of the notion\nthat this is the best of all possible worlds, this world has been a\ngayer place for readers. Voltaire wrote it in three days, and five or\nsix generations have found that its laughter does not grow old.\n\n\"Candide\" has not aged. Yet how different the book would have looked if\nVoltaire had written it a hundred and fifty years later than 1759. It\nwould have been, among other things, a book of sights and sounds. A\nmodern writer would have tried to catch and fix in words some of those\nAtlantic changes which broke the Atlantic monotony of that voyage from\nCadiz to Buenos Ayres. When Martin and Candide were sailing the length\nof the Mediterranean we should have had a contrast between naked scarped\nBalearic cliffs and headlands of Calabria in their mists. We should have\nhad quarter distances, far horizons, the altering silhouettes of an\nIonian island. Colored birds would have filled Paraguay with their\nsilver or acid cries.\n\nDr. Pangloss, to prove the existence of design in the universe, says\nthat noses were made to carry spectacles, and so we have spectacles. A\nmodern satirist would not try to paint with Voltaire's quick brush the\ndoctrine that he wanted to expose. And he would choose a more\ncomplicated doctrine than Dr. Pangloss's optimism, would study it more\nclosely, feel his destructive way about it with a more learned and\ncaressing malice. His attack, stealthier, more flexible and more patient\nthan Voltaire's, would call upon us, especially when his learning got a\nlittle out of control, to be more than patient. Now and then he would\nbore us. \"Candide\" never bored anybody except William Wordsworth.\n\nVoltaire's men and women point his case against optimism by starting\nhigh and falling low. A modern could not go about it after this fashion.\nHe would not plunge his people into an unfamiliar misery. He would just\nkeep them in the misery they were born to.\n\nBut such an account of Voltaire's procedure is as misleading as the\nplaster cast of a dance. Look at his procedure again. Mademoiselle\nCunegonde, the illustrious Westphalian, sprung from a family that could\nprove seventy-one quarterings, descends and descends until we find her\nearning her keep by washing dishes in the Propontis. The aged faithful\nattendant, victim of a hundred acts of rape by negro pirates, remembers\nthat she is the daughter of a pope, and that in honor of her\napproaching marriage with a Prince of Massa-Carrara all Italy wrote\nsonnets of which not one was passable. We do not need to know French\nliterature before Voltaire in order to feel, although the lurking parody\nmay escape us, that he is poking fun at us and at himself. His laughter\nat his own methods grows more unmistakable at the last, when he\ncaricatures them by casually assembling six fallen monarchs in an inn at\nVenice.\n\nA modern assailant of optimism would arm himself with social pity. There\nis no social pity in \"Candide.\" Voltaire, whose light touch on familiar\ninstitutions opens them and reveals their absurdity, likes to remind us\nthat the slaughter and pillage and murder which Candide witnessed among\nthe Bulgarians was perfectly regular, having been conducted according to\nthe laws and usages of war. Had Voltaire lived to-day he would have done\nto poverty what he did to war. Pitying the poor, he would have shown us\npoverty as a ridiculous anachronism, and both the ridicule and the pity\nwould have expressed his indignation.\n\nAlmost any modern, essaying a philosophic tale, would make it long.\n\"Candide\" is only a \"Hamlet\" and a half long. It would hardly have been\nshorter if Voltaire had spent three months on it, instead of those three\ndays. A conciseness to be matched in English by nobody except Pope, who\ncan say a plagiarizing enemy \"steals much, spends little, and has\nnothing left,\" a conciseness which Pope toiled and sweated for, came as\neasy as wit to Voltaire. He can afford to be witty, parenthetically, by\nthe way, prodigally, without saving, because he knows there is more wit\nwhere that came from.\n\nOne of Max Beerbohm's cartoons shows us the young Twentieth Century\ngoing at top speed, and watched by two of his predecessors. Underneath\nis this legend: \"The Grave Misgivings of the Nineteenth Century, and the\nWicked Amusement of the Eighteenth, in Watching the Progress (or\nwhatever it is) of the Twentieth.\" This Eighteenth Century snuff-taking\nand malicious, is like Voltaire, who nevertheless must know, if he\nhappens to think of it, that not yet in the Twentieth Century, not for\nall its speed mania, has any one come near to equalling the speed of a\nprose tale by Voltaire. \"Candide\" is a full book. It is filled with\nmockery, with inventiveness, with things as concrete as things to eat\nand coins, it has time for the neatest intellectual clickings, it is\nnever hurried, and it moves with the most amazing rapidity. It has the\nrapidity of high spirits playing a game. The dry high spirits of this\ndestroyer of optimism make most optimists look damp and depressed.\nContemplation of the stupidity which deems happiness possible almost\nmade Voltaire happy. His attack on optimism is one of the gayest books\nin the world. Gaiety has been scattered everywhere up and down its pages\nby Voltaire's lavish hand, by his thin fingers.\n\nMany propagandist satirical books have been written with \"Candide\" in\nmind, but not too many. To-day, especially, when new faiths are changing\nthe structure of the world, faiths which are still plastic enough to be\ndeformed by every disciple, each disciple for himself, and which have\nnot yet received the final deformation known as universal acceptance,\nto-day \"Candide\" is an inspiration to every narrative satirist who hates\none of these new faiths, or hates every interpretation of it but his\nown. Either hatred will serve as a motive to satire.\n\nThat is why the present is one of the right moments to republish\n\"Candide.\" I hope it will inspire younger men and women, the only ones\nwho can be inspired, to have a try at Theodore, or Militarism; Jane, or\nPacifism; at So-and-So, the Pragmatist or the Freudian. And I hope, too,\nthat they will without trying hold their pens with an eighteenth century\nlightness, not inappropriate to a philosophic tale. In Voltaire's\nfingers, as Anatole France has said, the pen runs and laughs. PHILIP\nLITTELL.\n\n\n\n\nCONTENTS\n\nCHAPTER                                                       PAGE\n\n     I. How Candide was brought up in a\n        Magnificent Castle, and how he was\n        expelled thence                                          1\n\n    II. What became of Candide among the\n        Bulgarians                                               5\n\n   III. How Candide made his escape from the\n        Bulgarians, and what afterwards became\n        of him                                                   9\n\n    IV. How Candide found his old Master\n        Pangloss, and what happened to them                     13\n\n     V. Tempest, Shipwreck, Earthquake, and\n        what became of Doctor Pangloss,\n        Candide, and James the Anabaptist                       18\n\n    VI. How the Portuguese made a Beautiful\n        Auto-da-fe, to prevent any further\n        Earthquakes: and how Candide was\n        publicly whipped                                        23\n\n   VII. How the Old Woman took care of\n        Candide, and how he found the Object\n        he loved                                                26\n\n  VIII. The History of Cunegonde                                30\n\n    IX. What became of Cunegonde, Candide,\n        the Grand Inquisitor, and the Jew                       35\n\n     X. In what distress Candide, Cunegonde,\n        and the Old Woman arrived at\n        Cadiz; and of their Embarkation                         38\n\n    XI. History of the Old Woman                                42\n\n   XII. The Adventures of the Old Woman\n        continued                                               48\n\n  XIII. How Candide was forced away from his\n        fair Cunegonde and the Old Woman                        54\n\n   XIV. How Candide and Cacambo were received\n        by the Jesuits of Paraguay                              58\n\n    XV. How Candide killed the brother of his\n        dear Cunegonde                                          64\n\n   XVI. Adventures of the Two Travellers,\n        with Two Girls, Two Monkeys, and\n        the Savages called Oreillons                            68\n\n  XVII. Arrival of Candide and his Valet at El\n        Dorado, and what they saw there                         74\n\n XVIII. What they saw in the Country of El\n        Dorado                                                  80\n\n   XIX. What happened to them at Surinam and\n        how Candide got acquainted with\n        Martin                                                  89\n\n    XX. What happened at Sea to Candide and\n        Martin                                                  98\n\n   XXI. Candide and Martin, reasoning, draw\n        near the Coast of France                               102\n\n  XXII. What happened in France to Candide\n        and Martin                                             105\n\n XXIII. Candide and Martin touched upon the\n        Coast of England, and what they saw\n        there                                                  122\n\n  XXIV. Of Paquette and Friar Giroflee                         125\n\n   XXV. The Visit to Lord Pococurante, a\n        Noble Venetian                                         133\n\n  XXVI. Of a Supper which Candide and Martin\n        took with Six Strangers, and who\n        they were                                              142\n\n XXVII. Candide's Voyage to Constantinople                     148\n\nXXVIII. What happened to Candide, Cunegonde,\n        Pangloss, Martin, etc.                                 154\n\n  XXIX. How Candide found Cunegonde and\n        the Old Woman again                                    159\n\n   XXX. The Conclusion                                         161\n\n\n[Illustration: VOLTAIRE'S CANDIDE]\n\n\n\n\nCANDIDE\n\n\n\n\nI\n\nHOW CANDIDE WAS BROUGHT UP IN A MAGNIFICENT CASTLE, AND HOW HE WAS\nEXPELLED THENCE.\n\n\nIn a castle of Westphalia, belonging to the Baron of\nThunder-ten-Tronckh, lived a youth, whom nature had endowed with the\nmost gentle manners. His countenance was a true picture of his soul. He\ncombined a true judgment with simplicity of spirit, which was the\nreason, I apprehend, of his being called Candide. The old servants of\nthe family suspected him to have been the son of the Baron's sister, by\na good, honest gentleman of the neighborhood, whom that young lady would\nnever marry because he had been able to prove only seventy-one\nquarterings, the rest of his genealogical tree having been lost through\nthe injuries of time.\n\nThe Baron was one of the most powerful lords in Westphalia, for his\ncastle had not only a gate, but windows. His great hall, even, was hung\nwith tapestry. All the dogs of his farm-yards formed a pack of hounds at\nneed; his grooms were his huntsmen; and the curate of the village was\nhis grand almoner. They called him \"My Lord,\" and laughed at all his\nstories.\n\nThe Baron's lady weighed about three hundred and fifty pounds, and was\ntherefore a person of great consideration, and she did the honours of\nthe house with a dignity that commanded still greater respect. Her\ndaughter Cunegonde was seventeen years of age, fresh-coloured, comely,\nplump, and desirable. The Baron's son seemed to be in every respect\nworthy of his father. The Preceptor Pangloss[1] was the oracle of the\nfamily, and little Candide heard his lessons with all the good faith of\nhis age and character.\n\nPangloss was professor of metaphysico-theologico-cosmolo-nigology. He\nproved admirably that there is no effect without a cause, and that, in\nthis best of all possible worlds, the Baron's castle was the most\nmagnificent of castles, and his lady the best of all possible\nBaronesses.\n\n\"It is demonstrable,\" said he, \"that things cannot be otherwise than as\nthey are; for all being created for an end, all is necessarily for the\nbest end. Observe, that the nose has been formed to bear\nspectacles--thus we have spectacles. Legs are visibly designed for\nstockings--and we have stockings. Stones were made to be hewn, and to\nconstruct castles--therefore my lord has a magnificent castle; for the\ngreatest baron in the province ought to be the best lodged. Pigs were\nmade to be eaten--therefore we eat pork all the year round. Consequently\nthey who assert that all is well have said a foolish thing, they should\nhave said all is for the best.\"\n\nCandide listened attentively and believed innocently; for he thought\nMiss Cunegonde extremely beautiful, though he never had the courage to\ntell her so. He concluded that after the happiness of being born of\nBaron of Thunder-ten-Tronckh, the second degree of happiness was to be\nMiss Cunegonde, the third that of seeing her every day, and the fourth\nthat of hearing Master Pangloss, the greatest philosopher of the whole\nprovince, and consequently of the whole world.\n\nOne day Cunegonde, while walking near the castle, in a little wood which\nthey called a park, saw between the bushes, Dr. Pangloss giving a lesson\nin experimental natural philosophy to her mother's chamber-maid, a\nlittle brown wench, very pretty and very docile. As Miss Cunegonde had a\ngreat disposition for the sciences, she breathlessly observed the\nrepeated experiments of which she was a witness; she clearly perceived\nthe force of the Doctor's reasons, the effects, and the causes; she\nturned back greatly flurried, quite pensive, and filled with the desire\nto be learned; dreaming that she might well be a _sufficient reason_ for\nyoung Candide, and he for her.\n\nShe met Candide on reaching the castle and blushed; Candide blushed\nalso; she wished him good morrow in a faltering tone, and Candide spoke\nto her without knowing what he said. The next day after dinner, as they\nwent from table, Cunegonde and Candide found themselves behind a screen;\nCunegonde let fall her handkerchief, Candide picked it up, she took him\ninnocently by the hand, the youth as innocently kissed the young lady's\nhand with particular vivacity, sensibility, and grace; their lips met,\ntheir eyes sparkled, their knees trembled, their hands strayed. Baron\nThunder-ten-Tronckh passed near the screen and beholding this cause and\neffect chased Candide from the castle with great kicks on the backside;\nCunegonde fainted away; she was boxed on the ears by the Baroness, as\nsoon as she came to herself; and all was consternation in this most\nmagnificent and most agreeable of all possible castles.\n\n\n\n\nII\n\nWHAT BECAME OF CANDIDE AMONG THE BULGARIANS.\n\n\nCandide, driven from terrestrial paradise, walked a long while without\nknowing where, weeping, raising his eyes to heaven, turning them often\ntowards the most magnificent of castles which imprisoned the purest of\nnoble young ladies. He lay down to sleep without supper, in the middle\nof a field between two furrows. The snow fell in large flakes. Next day\nCandide, all benumbed, dragged himself towards the neighbouring town\nwhich was called Waldberghofftrarbk-dikdorff, having no money, dying of\nhunger and fatigue, he stopped sorrowfully at the door of an inn. Two\nmen dressed in blue observed him.\n\n\"Comrade,\" said one, \"here is a well-built young fellow, and of proper\nheight.\"\n\nThey went up to Candide and very civilly invited him to dinner.\n\n\"Gentlemen,\" replied Candide, with a most engaging modesty, \"you do me\ngreat honour, but I have not wherewithal to pay my share.\"\n\n\"Oh, sir,\" said one of the blues to him, \"people of your appearance and\nof your merit never pay anything: are you not five feet five inches\nhigh?\"\n\n\"Yes, sir, that is my height,\" answered he, making a low bow.\n\n\"Come, sir, seat yourself; not only will we pay your reckoning, but we\nwill never suffer such a man as you to want money; men are only born to\nassist one another.\"\n\n\"You are right,\" said Candide; \"this is what I was always taught by Mr.\nPangloss, and I see plainly that all is for the best.\"\n\nThey begged of him to accept a few crowns. He took them, and wished to\ngive them his note; they refused; they seated themselves at table.\n\n\"Love you not deeply?\"\n\n\"Oh yes,\" answered he; \"I deeply love Miss Cunegonde.\"\n\n\"No,\" said one of the gentlemen, \"we ask you if you do not deeply love\nthe King of the Bulgarians?\"\n\n\"Not at all,\" said he; \"for I have never seen him.\"\n\n\"What! he is the best of kings, and we must drink his health.\"\n\n\"Oh! very willingly, gentlemen,\" and he drank.\n\n\"That is enough,\" they tell him. \"Now you are the help, the support,\nthe defender, the hero of the Bulgarians. Your fortune is made, and your\nglory is assured.\"\n\nInstantly they fettered him, and carried him away to the regiment. There\nhe was made to wheel about to the right, and to the left, to draw his\nrammer, to return his rammer, to present, to fire, to march, and they\ngave him thirty blows with a cudgel. The next day he did his exercise a\nlittle less badly, and he received but twenty blows. The day following\nthey gave him only ten, and he was regarded by his comrades as a\nprodigy.\n\nCandide, all stupefied, could not yet very well realise how he was a\nhero. He resolved one fine day in spring to go for a walk, marching\nstraight before him, believing that it was a privilege of the human as\nwell as of the animal species to make use of their legs as they pleased.\nHe had advanced two leagues when he was overtaken by four others, heroes\nof six feet, who bound him and carried him to a dungeon. He was asked\nwhich he would like the best, to be whipped six-and-thirty times through\nall the regiment, or to receive at once twelve balls of lead in his\nbrain. He vainly said that human will is free, and that he chose neither\nthe one nor the other. He was forced to make a choice; he determined, in\nvirtue of that gift of God called liberty, to run the gauntlet\nsix-and-thirty times. He bore this twice. The regiment was composed of\ntwo thousand men; that composed for him four thousand strokes, which\nlaid bare all his muscles and nerves, from the nape of his neck quite\ndown to his rump. As they were going to proceed to a third whipping,\nCandide, able to bear no more, begged as a favour that they would be so\ngood as to shoot him. He obtained this favour; they bandaged his eyes,\nand bade him kneel down. The King of the Bulgarians passed at this\nmoment and ascertained the nature of the crime. As he had great talent,\nhe understood from all that he learnt of Candide that he was a young\nmetaphysician, extremely ignorant of the things of this world, and he\naccorded him his pardon with a clemency which will bring him praise in\nall the journals, and throughout all ages.\n\nAn able surgeon cured Candide in three weeks by means of emollients\ntaught by Dioscorides. He had already a little skin, and was able to\nmarch when the King of the Bulgarians gave battle to the King of the\nAbares.[2]\n\n\n\n\nIII\n\nHOW CANDIDE MADE HIS ESCAPE FROM THE BULGARIANS, AND WHAT AFTERWARDS\nBECAME OF HIM.\n\n\nThere was never anything so gallant, so spruce, so brilliant, and so\nwell disposed as the two armies. Trumpets, fifes, hautboys, drums, and\ncannon made music such as Hell itself had never heard. The cannons first\nof all laid flat about six thousand men on each side; the muskets swept\naway from this best of worlds nine or ten thousand ruffians who infested\nits surface. The bayonet was also a _sufficient reason_ for the death of\nseveral thousands. The whole might amount to thirty thousand souls.\nCandide, who trembled like a philosopher, hid himself as well as he\ncould during this heroic butchery.\n\nAt length, while the two kings were causing Te Deum to be sung each in\nhis own camp, Candide resolved to go and reason elsewhere on effects and\ncauses. He passed over heaps of dead and dying, and first reached a\nneighbouring village; it was in cinders, it was an Abare village which\nthe Bulgarians had burnt according to the laws of war. Here, old men\ncovered with wounds, beheld their wives, hugging their children to their\nbloody breasts, massacred before their faces; there, their daughters,\ndisembowelled and breathing their last after having satisfied the\nnatural wants of Bulgarian heroes; while others, half burnt in the\nflames, begged to be despatched. The earth was strewed with brains,\narms, and legs.\n\nCandide fled quickly to another village; it belonged to the Bulgarians;\nand the Abarian heroes had treated it in the same way. Candide, walking\nalways over palpitating limbs or across ruins, arrived at last beyond\nthe seat of war, with a few provisions in his knapsack, and Miss\nCunegonde always in his heart. His provisions failed him when he arrived\nin Holland; but having heard that everybody was rich in that country,\nand that they were Christians, he did not doubt but he should meet with\nthe same treatment from them as he had met with in the Baron's castle,\nbefore Miss Cunegonde's bright eyes were the cause of his expulsion\nthence.\n\nHe asked alms of several grave-looking people, who all answered him,\nthat if he continued to follow this trade they would confine him to the\nhouse of correction, where he should be taught to get a living.\n\nThe next he addressed was a man who had been haranguing a large assembly\nfor a whole hour on the subject of charity. But the orator, looking\naskew, said:\n\n\"What are you doing here? Are you for the good cause?\"\n\n\"There can be no effect without a cause,\" modestly answered Candide;\n\"the whole is necessarily concatenated and arranged for the best. It was\nnecessary for me to have been banished from the presence of Miss\nCunegonde, to have afterwards run the gauntlet, and now it is necessary\nI should beg my bread until I learn to earn it; all this cannot be\notherwise.\"\n\n\"My friend,\" said the orator to him, \"do you believe the Pope to be\nAnti-Christ?\"\n\n\"I have not heard it,\" answered Candide; \"but whether he be, or whether\nhe be not, I want bread.\"\n\n\"Thou dost not deserve to eat,\" said the other. \"Begone, rogue; begone,\nwretch; do not come near me again.\"\n\nThe orator's wife, putting her head out of the window, and spying a man\nthat doubted whether the Pope was Anti-Christ, poured over him a\nfull.... Oh, heavens! to what excess does religious zeal carry the\nladies.\n\nA man who had never been christened, a good Anabaptist, named James,\nbeheld the cruel and ignominious treatment shown to one of his\nbrethren, an unfeathered biped with a rational soul, he took him home,\ncleaned him, gave him bread and beer, presented him with two florins,\nand even wished to teach him the manufacture of Persian stuffs which\nthey make in Holland. Candide, almost prostrating himself before him,\ncried:\n\n\"Master Pangloss has well said that all is for the best in this world,\nfor I am infinitely more touched by your extreme generosity than with\nthe inhumanity of that gentleman in the black coat and his lady.\"\n\nThe next day, as he took a walk, he met a beggar all covered with scabs,\nhis eyes diseased, the end of his nose eaten away, his mouth distorted,\nhis teeth black, choking in his throat, tormented with a violent cough,\nand spitting out a tooth at each effort.\n\n\n\n\nIV\n\nHOW CANDIDE FOUND HIS OLD MASTER PANGLOSS, AND WHAT HAPPENED TO THEM.\n\n\nCandide, yet more moved with compassion than with horror, gave to this\nshocking beggar the two florins which he had received from the honest\nAnabaptist James. The spectre looked at him very earnestly, dropped a\nfew tears, and fell upon his neck. Candide recoiled in disgust.\n\n\"Alas!\" said one wretch to the other, \"do you no longer know your dear\nPangloss?\"\n\n\"What do I hear? You, my dear master! you in this terrible plight! What\nmisfortune has happened to you? Why are you no longer in the most\nmagnificent of castles? What has become of Miss Cunegonde, the pearl of\ngirls, and nature's masterpiece?\"\n\n\"I am so weak that I cannot stand,\" said Pangloss.\n\nUpon which Candide carried him to the Anabaptist's stable, and gave him\na crust of bread. As soon as Pangloss had refreshed himself a little:\n\n\"Well,\" said Candide, \"Cunegonde?\"\n\n\"She is dead,\" replied the other.\n\nCandide fainted at this word; his friend recalled his senses with a\nlittle bad vinegar which he found by chance in the stable. Candide\nreopened his eyes.\n\n\"Cunegonde is dead! Ah, best of worlds, where art thou? But of what\nillness did she die? Was it not for grief, upon seeing her father kick\nme out of his magnificent castle?\"\n\n\"No,\" said Pangloss, \"she was ripped open by the Bulgarian soldiers,\nafter having been violated by many; they broke the Baron's head for\nattempting to defend her; my lady, her mother, was cut in pieces; my\npoor pupil was served just in the same manner as his sister; and as for\nthe castle, they have not left one stone upon another, not a barn, nor a\nsheep, nor a duck, nor a tree; but we have had our revenge, for the\nAbares have done the very same thing to a neighbouring barony, which\nbelonged to a Bulgarian lord.\"\n\nAt this discourse Candide fainted again; but coming to himself, and\nhaving said all that it became him to say, inquired into the cause and\neffect, as well as into the _sufficient reason_ that had reduced\nPangloss to so miserable a plight.\n\n\"Alas!\" said the other, \"it was love; love, the comfort of the human\nspecies, the preserver of the universe, the soul of all sensible beings,\nlove, tender love.\"\n\n\"Alas!\" said Candide, \"I know this love, that sovereign of hearts, that\nsoul of our souls; yet it never cost me more than a kiss and twenty\nkicks on the backside. How could this beautiful cause produce in you an\neffect so abominable?\"\n\nPangloss made answer in these terms: \"Oh, my dear Candide, you remember\nPaquette, that pretty wench who waited on our noble Baroness; in her\narms I tasted the delights of paradise, which produced in me those hell\ntorments with which you see me devoured; she was infected with them, she\nis perhaps dead of them. This present Paquette received of a learned\nGrey Friar, who had traced it to its source; he had had it of an old\ncountess, who had received it from a cavalry captain, who owed it to a\nmarchioness, who took it from a page, who had received it from a Jesuit,\nwho when a novice had it in a direct line from one of the companions of\nChristopher Columbus.[3] For my part I shall give it to nobody, I am\ndying.\"\n\n\"Oh, Pangloss!\" cried Candide, \"what a strange genealogy! Is not the\nDevil the original stock of it?\"\n\n\"Not at all,\" replied this great man, \"it was a thing unavoidable, a\nnecessary ingredient in the best of worlds; for if Columbus had not in\nan island of America caught this disease, which contaminates the source\nof life, frequently even hinders generation, and which is evidently\nopposed to the great end of nature, we should have neither chocolate nor\ncochineal. We are also to observe that upon our continent, this\ndistemper is like religious controversy, confined to a particular spot.\nThe Turks, the Indians, the Persians, the Chinese, the Siamese, the\nJapanese, know nothing of it; but there is a sufficient reason for\nbelieving that they will know it in their turn in a few centuries. In\nthe meantime, it has made marvellous progress among us, especially in\nthose great armies composed of honest well-disciplined hirelings, who\ndecide the destiny of states; for we may safely affirm that when an army\nof thirty thousand men fights another of an equal number, there are\nabout twenty thousand of them p-x-d on each side.\"\n\n\"Well, this is wonderful!\" said Candide, \"but you must get cured.\"\n\n\"Alas! how can I?\" said Pangloss, \"I have not a farthing, my friend, and\nall over the globe there is no letting of blood or taking a glister,\nwithout paying, or somebody paying for you.\"\n\nThese last words determined Candide; he went and flung himself at the\nfeet of the charitable Anabaptist James, and gave him so touching a\npicture of the state to which his friend was reduced, that the good man\ndid not scruple to take Dr. Pangloss into his house, and had him cured\nat his expense. In the cure Pangloss lost only an eye and an ear. He\nwrote well, and knew arithmetic perfectly. The Anabaptist James made him\nhis bookkeeper. At the end of two months, being obliged to go to Lisbon\nabout some mercantile affairs, he took the two philosophers with him in\nhis ship. Pangloss explained to him how everything was so constituted\nthat it could not be better. James was not of this opinion.\n\n\"It is more likely,\" said he, \"mankind have a little corrupted nature,\nfor they were not born wolves, and they have become wolves; God has\ngiven them neither cannon of four-and-twenty pounders, nor bayonets; and\nyet they have made cannon and bayonets to destroy one another. Into this\naccount I might throw not only bankrupts, but Justice which seizes on\nthe effects of bankrupts to cheat the creditors.\"\n\n\"All this was indispensable,\" replied the one-eyed doctor, \"for private\nmisfortunes make the general good, so that the more private misfortunes\nthere are the greater is the general good.\"\n\nWhile he reasoned, the sky darkened, the winds blew from the four\nquarters, and the ship was assailed by a most terrible tempest within\nsight of the port of Lisbon.\n\n\n\n\nV\n\nTEMPEST, SHIPWRECK, EARTHQUAKE, AND WHAT BECAME OF DOCTOR PANGLOSS,\nCANDIDE, AND JAMES THE ANABAPTIST.\n\n\nHalf dead of that inconceivable anguish which the rolling of a ship\nproduces, one-half of the passengers were not even sensible of the\ndanger. The other half shrieked and prayed. The sheets were rent, the\nmasts broken, the vessel gaped. Work who would, no one heard, no one\ncommanded. The Anabaptist being upon deck bore a hand; when a brutish\nsailor struck him roughly and laid him sprawling; but with the violence\nof the blow he himself tumbled head foremost overboard, and stuck upon a\npiece of the broken mast. Honest James ran to his assistance, hauled him\nup, and from the effort he made was precipitated into the sea in sight\nof the sailor, who left him to perish, without deigning to look at him.\nCandide drew near and saw his benefactor, who rose above the water one\nmoment and was then swallowed up for ever. He was just going to jump\nafter him, but was prevented by the philosopher Pangloss, who\ndemonstrated to him that the Bay of Lisbon had been made on purpose for\nthe Anabaptist to be drowned. While he was proving this _a priori_, the\nship foundered; all perished except Pangloss, Candide, and that brutal\nsailor who had drowned the good Anabaptist. The villain swam safely to\nthe shore, while Pangloss and Candide were borne thither upon a plank.\n\nAs soon as they recovered themselves a little they walked toward Lisbon.\nThey had some money left, with which they hoped to save themselves from\nstarving, after they had escaped drowning. Scarcely had they reached the\ncity, lamenting the death of their benefactor, when they felt the earth\ntremble under their feet. The sea swelled and foamed in the harbour, and\nbeat to pieces the vessels riding at anchor. Whirlwinds of fire and\nashes covered the streets and public places; houses fell, roofs were\nflung upon the pavements, and the pavements were scattered. Thirty\nthousand inhabitants of all ages and sexes were crushed under the\nruins.[4] The sailor, whistling and swearing, said there was booty to be\ngained here.\n\n\"What can be the _sufficient reason_ of this phenomenon?\" said Pangloss.\n\n\"This is the Last Day!\" cried Candide.\n\nThe sailor ran among the ruins, facing death to find money; finding it,\nhe took it, got drunk, and having slept himself sober, purchased the\nfavours of the first good-natured wench whom he met on the ruins of the\ndestroyed houses, and in the midst of the dying and the dead. Pangloss\npulled him by the sleeve.\n\n\"My friend,\" said he, \"this is not right. You sin against the _universal\nreason_; you choose your time badly.\"\n\n\"S'blood and fury!\" answered the other; \"I am a sailor and born at\nBatavia. Four times have I trampled upon the crucifix in four voyages to\nJapan[5]; a fig for thy universal reason.\"\n\nSome falling stones had wounded Candide. He lay stretched in the street\ncovered with rubbish.\n\n\"Alas!\" said he to Pangloss, \"get me a little wine and oil; I am dying.\"\n\n\"This concussion of the earth is no new thing,\" answered Pangloss. \"The\ncity of Lima, in America, experienced the same convulsions last year;\nthe same cause, the same effects; there is certainly a train of sulphur\nunder ground from Lima to Lisbon.\"\n\n\"Nothing more probable,\" said Candide; \"but for the love of God a little\noil and wine.\"\n\n\"How, probable?\" replied the philosopher. \"I maintain that the point is\ncapable of being demonstrated.\"\n\nCandide fainted away, and Pangloss fetched him some water from a\nneighbouring fountain. The following day they rummaged among the ruins\nand found provisions, with which they repaired their exhausted strength.\nAfter this they joined with others in relieving those inhabitants who\nhad escaped death. Some, whom they had succoured, gave them as good a\ndinner as they could in such disastrous circumstances; true, the repast\nwas mournful, and the company moistened their bread with tears; but\nPangloss consoled them, assuring them that things could not be\notherwise.\n\n\"For,\" said he, \"all that is is for the best. If there is a volcano at\nLisbon it cannot be elsewhere. It is impossible that things should be\nother than they are; for everything is right.\"\n\nA little man dressed in black, Familiar of the Inquisition, who sat by\nhim, politely took up his word and said:\n\n\"Apparently, then, sir, you do not believe in original sin; for if all\nis for the best there has then been neither Fall nor punishment.\"\n\n\"I humbly ask your Excellency's pardon,\" answered Pangloss, still more\npolitely; \"for the Fall and curse of man necessarily entered into the\nsystem of the best of worlds.\"\n\n\"Sir,\" said the Familiar, \"you do not then believe in liberty?\"\n\n\"Your Excellency will excuse me,\" said Pangloss; \"liberty is consistent\nwith absolute necessity, for it was necessary we should be free; for, in\nshort, the determinate will----\"\n\nPangloss was in the middle of his sentence, when the Familiar beckoned\nto his footman, who gave him a glass of wine from Porto or Opporto.\n\n\n\n\nVI\n\nHOW THE PORTUGUESE MADE A BEAUTIFUL AUTO-DA-FE, TO PREVENT ANY FURTHER\nEARTHQUAKES; AND HOW CANDIDE WAS PUBLICLY WHIPPED.\n\n\nAfter the earthquake had destroyed three-fourths of Lisbon, the sages of\nthat country could think of no means more effectual to prevent utter\nruin than to give the people a beautiful _auto-da-fe_[6]; for it had\nbeen decided by the University of Coimbra, that the burning of a few\npeople alive by a slow fire, and with great ceremony, is an infallible\nsecret to hinder the earth from quaking.\n\nIn consequence hereof, they had seized on a Biscayner, convicted of\nhaving married his godmother, and on two Portuguese, for rejecting the\nbacon which larded a chicken they were eating[7]; after dinner, they\ncame and secured Dr. Pangloss, and his disciple Candide, the one for\nspeaking his mind, the other for having listened with an air of\napprobation. They were conducted to separate apartments, extremely cold,\nas they were never incommoded by the sun. Eight days after they were\ndressed in _san-benitos_[8] and their heads ornamented with paper\nmitres. The mitre and _san-benito_ belonging to Candide were painted\nwith reversed flames and with devils that had neither tails nor claws;\nbut Pangloss's devils had claws and tails and the flames were upright.\nThey marched in procession thus habited and heard a very pathetic\nsermon, followed by fine church music. Candide was whipped in cadence\nwhile they were singing; the Biscayner, and the two men who had refused\nto eat bacon, were burnt; and Pangloss was hanged, though that was not\nthe custom. The same day the earth sustained a most violent concussion.\n\nCandide, terrified, amazed, desperate, all bloody, all palpitating, said\nto himself:\n\n\"If this is the best of possible worlds, what then are the others? Well,\nif I had been only whipped I could put up with it, for I experienced\nthat among the Bulgarians; but oh, my dear Pangloss! thou greatest of\nphilosophers, that I should have seen you hanged, without knowing for\nwhat! Oh, my dear Anabaptist, thou best of men, that thou should'st have\nbeen drowned in the very harbour! Oh, Miss Cunegonde, thou pearl of\ngirls! that thou should'st have had thy belly ripped open!\"\n\nThus he was musing, scarce able to stand, preached at, whipped,\nabsolved, and blessed, when an old woman accosted him saying:\n\n\"My son, take courage and follow me.\"\n\n\n\n\nVII\n\nHOW THE OLD WOMAN TOOK CARE OF CANDIDE, AND HOW HE FOUND THE OBJECT HE\nLOVED.\n\n\nCandide did not take courage, but followed the old woman to a decayed\nhouse, where she gave him a pot of pomatum to anoint his sores, showed\nhim a very neat little bed, with a suit of clothes hanging up, and left\nhim something to eat and drink.\n\n\"Eat, drink, sleep,\" said she, \"and may our lady of Atocha,[9] the great\nSt. Anthony of Padua, and the great St. James of Compostella, receive\nyou under their protection. I shall be back to-morrow.\"\n\nCandide, amazed at all he had suffered and still more with the charity\nof the old woman, wished to kiss her hand.\n\n\"It is not my hand you must kiss,\" said the old woman; \"I shall be back\nto-morrow. Anoint yourself with the pomatum, eat and sleep.\"\n\nCandide, notwithstanding so many disasters, ate and slept. The next\nmorning the old woman brought him his breakfast, looked at his back, and\nrubbed it herself with another ointment: in like manner she brought him\nhis dinner; and at night she returned with his supper. The day following\nshe went through the very same ceremonies.\n\n\"Who are you?\" said Candide; \"who has inspired you with so much\ngoodness? What return can I make you?\"\n\nThe good woman made no answer; she returned in the evening, but brought\nno supper.\n\n\"Come with me,\" she said, \"and say nothing.\"\n\nShe took him by the arm, and walked with him about a quarter of a mile\ninto the country; they arrived at a lonely house, surrounded with\ngardens and canals. The old woman knocked at a little door, it opened,\nshe led Candide up a private staircase into a small apartment richly\nfurnished. She left him on a brocaded sofa, shut the door and went away.\nCandide thought himself in a dream; indeed, that he had been dreaming\nunluckily all his life, and that the present moment was the only\nagreeable part of it all.\n\nThe old woman returned very soon, supporting with difficulty a trembling\nwoman of a majestic figure, brilliant with jewels, and covered with a\nveil.\n\n\"Take off that veil,\" said the old woman to Candide.\n\nThe young man approaches, he raises the veil with a timid hand. Oh!\nwhat a moment! what surprise! he believes he beholds Miss Cunegonde? he\nreally sees her! it is herself! His strength fails him, he cannot utter\na word, but drops at her feet. Cunegonde falls upon the sofa. The old\nwoman supplies a smelling bottle; they come to themselves and recover\ntheir speech. As they began with broken accents, with questions and\nanswers interchangeably interrupted with sighs, with tears, and cries.\nThe old woman desired they would make less noise and then she left them\nto themselves.\n\n\"What, is it you?\" said Candide, \"you live? I find you again in\nPortugal? then you have not been ravished? then they did not rip open\nyour belly as Doctor Pangloss informed me?\"\n\n\"Yes, they did,\" said the beautiful Cunegonde; \"but those two accidents\nare not always mortal.\"\n\n\"But were your father and mother killed?\"\n\n\"It is but too true,\" answered Cunegonde, in tears.\n\n\"And your brother?\"\n\n\"My brother also was killed.\"\n\n\"And why are you in Portugal? and how did you know of my being here? and\nby what strange adventure did you contrive to bring me to this house?\"\n\n\"I will tell you all that,\" replied the lady, \"but first of all let me\nknow your history, since the innocent kiss you gave me and the kicks\nwhich you received.\"\n\nCandide respectfully obeyed her, and though he was still in a surprise,\nthough his voice was feeble and trembling, though his back still pained\nhim, yet he gave her a most ingenuous account of everything that had\nbefallen him since the moment of their separation. Cunegonde lifted up\nher eyes to heaven; shed tears upon hearing of the death of the good\nAnabaptist and of Pangloss; after which she spoke as follows to Candide,\nwho did not lose a word and devoured her with his eyes.\n\n\n\n\nVIII\n\nTHE HISTORY OF CUNEGONDE.\n\n\n\"I was in bed and fast asleep when it pleased God to send the Bulgarians\nto our delightful castle of Thunder-ten-Tronckh; they slew my father and\nbrother, and cut my mother in pieces. A tall Bulgarian, six feet high,\nperceiving that I had fainted away at this sight, began to ravish me;\nthis made me recover; I regained my senses, I cried, I struggled, I bit,\nI scratched, I wanted to tear out the tall Bulgarian's eyes--not knowing\nthat what happened at my father's house was the usual practice of war.\nThe brute gave me a cut in the left side with his hanger, and the mark\nis still upon me.\"\n\n\"Ah! I hope I shall see it,\" said honest Candide.\n\n\"You shall,\" said Cunegonde, \"but let us continue.\"\n\n\"Do so,\" replied Candide.\n\nThus she resumed the thread of her story:\n\n\"A Bulgarian captain came in, saw me all bleeding, and the soldier not\nin the least disconcerted. The captain flew into a passion at the\ndisrespectful behaviour of the brute, and slew him on my body. He\nordered my wounds to be dressed, and took me to his quarters as a\nprisoner of war. I washed the few shirts that he had, I did his cooking;\nhe thought me very pretty--he avowed it; on the other hand, I must own\nhe had a good shape, and a soft and white skin; but he had little or no\nmind or philosophy, and you might see plainly that he had never been\ninstructed by Doctor Pangloss. In three months time, having lost all his\nmoney, and being grown tired of my company, he sold me to a Jew, named\nDon Issachar, who traded to Holland and Portugal, and had a strong\npassion for women. This Jew was much attached to my person, but could\nnot triumph over it; I resisted him better than the Bulgarian soldier. A\nmodest woman may be ravished once, but her virtue is strengthened by it.\nIn order to render me more tractable, he brought me to this country\nhouse. Hitherto I had imagined that nothing could equal the beauty of\nThunder-ten-Tronckh Castle; but I found I was mistaken.\n\n\"The Grand Inquisitor, seeing me one day at Mass, stared long at me, and\nsent to tell me that he wished to speak on private matters. I was\nconducted to his palace, where I acquainted him with the history of my\nfamily, and he represented to me how much it was beneath my rank to\nbelong to an Israelite. A proposal was then made to Don Issachar that he\nshould resign me to my lord. Don Issachar, being the court banker, and a\nman of credit, would hear nothing of it. The Inquisitor threatened him\nwith an _auto-da-fe_. At last my Jew, intimidated, concluded a bargain,\nby which the house and myself should belong to both in common; the Jew\nshould have for himself Monday, Wednesday, and Saturday, and the\nInquisitor should have the rest of the week. It is now six months since\nthis agreement was made. Quarrels have not been wanting, for they could\nnot decide whether the night from Saturday to Sunday belonged to the old\nlaw or to the new. For my part, I have so far held out against both, and\nI verily believe that this is the reason why I am still beloved.\n\n\"At length, to avert the scourge of earthquakes, and to intimidate Don\nIssachar, my Lord Inquisitor was pleased to celebrate an _auto-da-fe_.\nHe did me the honour to invite me to the ceremony. I had a very good\nseat, and the ladies were served with refreshments between Mass and the\nexecution. I was in truth seized with horror at the burning of those two\nJews, and of the honest Biscayner who had married his godmother; but\nwhat was my surprise, my fright, my trouble, when I saw in a\n_san-benito_ and mitre a figure which resembled that of Pangloss! I\nrubbed my eyes, I looked at him attentively, I saw him hung; I fainted.\nScarcely had I recovered my senses than I saw you stripped, stark naked,\nand this was the height of my horror, consternation, grief, and despair.\nI tell you, truthfully, that your skin is yet whiter and of a more\nperfect colour than that of my Bulgarian captain. This spectacle\nredoubled all the feelings which overwhelmed and devoured me. I screamed\nout, and would have said, 'Stop, barbarians!' but my voice failed me,\nand my cries would have been useless after you had been severely\nwhipped. How is it possible, said I, that the beloved Candide and the\nwise Pangloss should both be at Lisbon, the one to receive a hundred\nlashes, and the other to be hanged by the Grand Inquisitor, of whom I am\nthe well-beloved? Pangloss most cruelly deceived me when he said that\neverything in the world is for the best.\n\n\"Agitated, lost, sometimes beside myself, and sometimes ready to die of\nweakness, my mind was filled with the massacre of my father, mother, and\nbrother, with the insolence of the ugly Bulgarian soldier, with the stab\nthat he gave me, with my servitude under the Bulgarian captain, with my\nhideous Don Issachar, with my abominable Inquisitor, with the execution\nof Doctor Pangloss, with the grand Miserere to which they whipped you,\nand especially with the kiss I gave you behind the screen the day that I\nhad last seen you. I praised God for bringing you back to me after so\nmany trials, and I charged my old woman to take care of you, and to\nconduct you hither as soon as possible. She has executed her commission\nperfectly well; I have tasted the inexpressible pleasure of seeing you\nagain, of hearing you, of speaking with you. But you must be hungry, for\nmyself, I am famished; let us have supper.\"\n\nThey both sat down to table, and, when supper was over, they placed\nthemselves once more on the sofa; where they were when Signor Don\nIssachar arrived. It was the Jewish Sabbath, and Issachar had come to\nenjoy his rights, and to explain his tender love.\n\n\n\n\nIX\n\nWHAT BECAME OF CUNEGONDE, CANDIDE, THE GRAND INQUISITOR, AND THE JEW.\n\n\nThis Issachar was the most choleric Hebrew that had ever been seen in\nIsrael since the Captivity in Babylon.\n\n\"What!\" said he, \"thou bitch of a Galilean, was not the Inquisitor\nenough for thee? Must this rascal also share with me?\"\n\nIn saying this he drew a long poniard which he always carried about him;\nand not imagining that his adversary had any arms he threw himself upon\nCandide: but our honest Westphalian had received a handsome sword from\nthe old woman along with the suit of clothes. He drew his rapier,\ndespite his gentleness, and laid the Israelite stone dead upon the\ncushions at Cunegonde's feet.\n\n\"Holy Virgin!\" cried she, \"what will become of us? A man killed in my\napartment! If the officers of justice come, we are lost!\"\n\n\"Had not Pangloss been hanged,\" said Candide, \"he would give us good\ncounsel in this emergency, for he was a profound philosopher. Failing\nhim let us consult the old woman.\"\n\nShe was very prudent and commenced to give her opinion when suddenly\nanother little door opened. It was an hour after midnight, it was the\nbeginning of Sunday. This day belonged to my lord the Inquisitor. He\nentered, and saw the whipped Candide, sword in hand, a dead man upon the\nfloor, Cunegonde aghast, and the old woman giving counsel.\n\nAt this moment, the following is what passed in the soul of Candide, and\nhow he reasoned:\n\nIf this holy man call in assistance, he will surely have me burnt; and\nCunegonde will perhaps be served in the same manner; he was the cause of\nmy being cruelly whipped; he is my rival; and, as I have now begun to\nkill, I will kill away, for there is no time to hesitate. This reasoning\nwas clear and instantaneous; so that without giving time to the\nInquisitor to recover from his surprise, he pierced him through and\nthrough, and cast him beside the Jew.\n\n\"Yet again!\" said Cunegonde, \"now there is no mercy for us, we are\nexcommunicated, our last hour has come. How could you do it? you,\nnaturally so gentle, to slay a Jew and a prelate in two minutes!\"\n\n\"My beautiful young lady,\" responded Candide, \"when one is a lover,\njealous and whipped by the Inquisition, one stops at nothing.\"\n\nThe old woman then put in her word, saying:\n\n\"There are three Andalusian horses in the stable with bridles and\nsaddles, let the brave Candide get them ready; madame has money, jewels;\nlet us therefore mount quickly on horseback, though I can sit only on\none buttock; let us set out for Cadiz, it is the finest weather in the\nworld, and there is great pleasure in travelling in the cool of the\nnight.\"\n\nImmediately Candide saddled the three horses, and Cunegonde, the old\nwoman and he, travelled thirty miles at a stretch. While they were\njourneying, the Holy Brotherhood entered the house; my lord the\nInquisitor was interred in a handsome church, and Issachar's body was\nthrown upon a dunghill.\n\nCandide, Cunegonde, and the old woman, had now reached the little town\nof Avacena in the midst of the mountains of the Sierra Morena, and were\nspeaking as follows in a public inn.\n\n\n\n\nX\n\nIN WHAT DISTRESS CANDIDE, CUNEGONDE, AND THE OLD WOMAN ARRIVED AT CADIZ;\nAND OF THEIR EMBARKATION.\n\n\n\"Who was it that robbed me of my money and jewels?\" said Cunegonde, all\nbathed in tears. \"How shall we live? What shall we do? Where find\nInquisitors or Jews who will give me more?\"\n\n\"Alas!\" said the old woman, \"I have a shrewd suspicion of a reverend\nGrey Friar, who stayed last night in the same inn with us at Badajos.\nGod preserve me from judging rashly, but he came into our room twice,\nand he set out upon his journey long before us.\"\n\n\"Alas!\" said Candide, \"dear Pangloss has often demonstrated to me that\nthe goods of this world are common to all men, and that each has an\nequal right to them. But according to these principles the Grey Friar\nought to have left us enough to carry us through our journey. Have you\nnothing at all left, my dear Cunegonde?\"\n\n\"Not a farthing,\" said she.\n\n\"What then must we do?\" said Candide.\n\n\"Sell one of the horses,\" replied the old woman. \"I will ride behind\nMiss Cunegonde, though I can hold myself only on one buttock, and we\nshall reach Cadiz.\"\n\nIn the same inn there was a Benedictine prior who bought the horse for a\ncheap price. Candide, Cunegonde, and the old woman, having passed\nthrough Lucena, Chillas, and Lebrixa, arrived at length at Cadiz. A\nfleet was there getting ready, and troops assembling to bring to reason\nthe reverend Jesuit Fathers of Paraguay, accused of having made one of\nthe native tribes in the neighborhood of San Sacrament revolt against\nthe Kings of Spain and Portugal. Candide having been in the Bulgarian\nservice, performed the military exercise before the general of this\nlittle army with so graceful an address, with so intrepid an air, and\nwith such agility and expedition, that he was given the command of a\ncompany of foot. Now, he was a captain! He set sail with Miss Cunegonde,\nthe old woman, two valets, and the two Andalusian horses, which had\nbelonged to the grand Inquisitor of Portugal.\n\nDuring their voyage they reasoned a good deal on the philosophy of poor\nPangloss.\n\n\"We are going into another world,\" said Candide; \"and surely it must be\nthere that all is for the best. For I must confess there is reason to\ncomplain a little of what passeth in our world in regard to both\nnatural and moral philosophy.\"\n\n\"I love you with all my heart,\" said Cunegonde; \"but my soul is still\nfull of fright at that which I have seen and experienced.\"\n\n\"All will be well,\" replied Candide; \"the sea of this new world is\nalready better than our European sea; it is calmer, the winds more\nregular. It is certainly the New World which is the best of all possible\nworlds.\"\n\n\"God grant it,\" said Cunegonde; \"but I have been so horribly unhappy\nthere that my heart is almost closed to hope.\"\n\n\"You complain,\" said the old woman; \"alas! you have not known such\nmisfortunes as mine.\"\n\nCunegonde almost broke out laughing, finding the good woman very\namusing, for pretending to have been as unfortunate as she.\n\n\"Alas!\" said Cunegonde, \"my good mother, unless you have been ravished\nby two Bulgarians, have received two deep wounds in your belly, have had\ntwo castles demolished, have had two mothers cut to pieces before your\neyes, and two of your lovers whipped at an _auto-da-fe_, I do not\nconceive how you could be more unfortunate than I. Add that I was born a\nbaroness of seventy-two quarterings--and have been a cook!\"\n\n\"Miss,\" replied the old woman, \"you do not know my birth; and were I to\nshow you my backside, you would not talk in that manner, but would\nsuspend your judgment.\"\n\nThis speech having raised extreme curiosity in the minds of Cunegonde\nand Candide, the old woman spoke to them as follows.\n\n\n\n\nXI\n\nHISTORY OF THE OLD WOMAN.\n\n\n\"I had not always bleared eyes and red eyelids; neither did my nose\nalways touch my chin; nor was I always a servant. I am the daughter of\nPope Urban X,[10] and of the Princess of Palestrina. Until the age of\nfourteen I was brought up in a palace, to which all the castles of your\nGerman barons would scarcely have served for stables; and one of my\nrobes was worth more than all the magnificence of Westphalia. As I grew\nup I improved in beauty, wit, and every graceful accomplishment, in the\nmidst of pleasures, hopes, and respectful homage. Already I inspired\nlove. My throat was formed, and such a throat! white, firm, and shaped\nlike that of the Venus of Medici; and what eyes! what eyelids! what\nblack eyebrows! such flames darted from my dark pupils that they\neclipsed the scintillation of the stars--as I was told by the poets in\nour part of the world. My waiting women, when dressing and undressing\nme, used to fall into an ecstasy, whether they viewed me before or\nbehind; how glad would the gentlemen have been to perform that office\nfor them!\n\n\"I was affianced to the most excellent Prince of Massa Carara. Such a\nprince! as handsome as myself, sweet-tempered, agreeable, brilliantly\nwitty, and sparkling with love. I loved him as one loves for the first\ntime--with idolatry, with transport. The nuptials were prepared. There\nwas surprising pomp and magnificence; there were _fetes_, carousals,\ncontinual _opera bouffe_; and all Italy composed sonnets in my praise,\nthough not one of them was passable. I was just upon the point of\nreaching the summit of bliss, when an old marchioness who had been\nmistress to the Prince, my husband, invited him to drink chocolate with\nher. He died in less than two hours of most terrible convulsions. But\nthis is only a bagatelle. My mother, in despair, and scarcely less\nafflicted than myself, determined to absent herself for some time from\nso fatal a place. She had a very fine estate in the neighbourhood of\nGaeta. We embarked on board a galley of the country which was gilded\nlike the great altar of St. Peter's at Rome. A Sallee corsair swooped\ndown and boarded us. Our men defended themselves like the Pope's\nsoldiers; they flung themselves upon their knees, and threw down their\narms, begging of the corsair an absolution _in articulo mortis_.\n\n\"Instantly they were stripped as bare as monkeys; my mother, our maids\nof honour, and myself were all served in the same manner. It is amazing\nwith what expedition those gentry undress people. But what surprised me\nmost was, that they thrust their fingers into the part of our bodies\nwhich the generality of women suffer no other instrument but--pipes to\nenter. It appeared to me a very strange kind of ceremony; but thus one\njudges of things when one has not seen the world. I afterwards learnt\nthat it was to try whether we had concealed any diamonds. This is the\npractice established from time immemorial, among civilised nations that\nscour the seas. I was informed that the very religious Knights of Malta\nnever fail to make this search when they take any Turkish prisoners of\neither sex. It is a law of nations from which they never deviate.\n\n\"I need not tell _you_ how great a hardship it was for a young princess\nand her mother to be made slaves and carried to Morocco. You may easily\nimagine all we had to suffer on board the pirate vessel. My mother was\nstill very handsome; our maids of honour, and even our waiting women,\nhad more charms than are to be found in all Africa. As for myself, I was\nravishing, was exquisite, grace itself, and I was a virgin! I did not\nremain so long; this flower, which had been reserved for the handsome\nPrince of Massa Carara, was plucked by the corsair captain. He was an\nabominable negro, and yet believed that he did me a great deal of\nhonour. Certainly the Princess of Palestrina and myself must have been\nvery strong to go through all that we experienced until our arrival at\nMorocco. But let us pass on; these are such common things as not to be\nworth mentioning.\n\n\"Morocco swam in blood when we arrived. Fifty sons of the Emperor\nMuley-Ismael[11] had each their adherents; this produced fifty civil\nwars, of blacks against blacks, and blacks against tawnies, and tawnies\nagainst tawnies, and mulattoes against mulattoes. In short it was a\ncontinual carnage throughout the empire.\n\n\"No sooner were we landed, than the blacks of a contrary faction to that\nof my captain attempted to rob him of his booty. Next to jewels and gold\nwe were the most valuable things he had. I was witness to such a battle\nas you have never seen in your European climates. The northern nations\nhave not that heat in their blood, nor that raging lust for women, so\ncommon in Africa. It seems that you Europeans have only milk in your\nveins; but it is vitriol, it is fire which runs in those of the\ninhabitants of Mount Atlas and the neighbouring countries. They fought\nwith the fury of the lions, tigers, and serpents of the country, to see\nwho should have us. A Moor seized my mother by the right arm, while my\ncaptain's lieutenant held her by the left; a Moorish soldier had hold of\nher by one leg, and one of our corsairs held her by the other. Thus\nalmost all our women were drawn in quarters by four men. My captain\nconcealed me behind him; and with his drawn scimitar cut and slashed\nevery one that opposed his fury. At length I saw all our Italian women,\nand my mother herself, torn, mangled, massacred, by the monsters who\ndisputed over them. The slaves, my companions, those who had taken them,\nsoldiers, sailors, blacks, whites, mulattoes, and at last my captain,\nall were killed, and I remained dying on a heap of dead. Such scenes as\nthis were transacted through an extent of three hundred leagues--and yet\nthey never missed the five prayers a day ordained by Mahomet.\n\n\"With difficulty I disengaged myself from such a heap of slaughtered\nbodies, and crawled to a large orange tree on the bank of a neighbouring\nrivulet, where I fell, oppressed with fright, fatigue, horror, despair,\nand hunger. Immediately after, my senses, overpowered, gave themselves\nup to sleep, which was yet more swooning than repose. I was in this\nstate of weakness and insensibility, between life and death, when I\nfelt myself pressed by something that moved upon my body. I opened my\neyes, and saw a white man, of good countenance, who sighed, and who said\nbetween his teeth: '_O che sciagura d'essere senza coglioni!_'\"[12]\n\n\n\n\nXII\n\nTHE ADVENTURES OF THE OLD WOMAN CONTINUED.\n\n\n\"Astonished and delighted to hear my native language, and no less\nsurprised at what this man said, I made answer that there were much\ngreater misfortunes than that of which he complained. I told him in a\nfew words of the horrors which I had endured, and fainted a second time.\nHe carried me to a neighbouring house, put me to bed, gave me food,\nwaited upon me, consoled me, flattered me; he told me that he had never\nseen any one so beautiful as I, and that he never so much regretted the\nloss of what it was impossible to recover.\n\n\"'I was born at Naples,' said he, 'there they geld two or three thousand\nchildren every year; some die of the operation, others acquire a voice\nmore beautiful than that of women, and others are raised to offices of\nstate.[13] This operation was performed on me with great success and I\nwas chapel musician to madam, the Princess of Palestrina.'\n\n\"'To my mother!' cried I.\n\n\"'Your mother!' cried he, weeping. 'What! can you be that young\nprincess whom I brought up until the age of six years, and who promised\nso early to be as beautiful as you?'\n\n\"'It is I, indeed; but my mother lies four hundred yards hence, torn in\nquarters, under a heap of dead bodies.'\n\n\"I told him all my adventures, and he made me acquainted with his;\ntelling me that he had been sent to the Emperor of Morocco by a\nChristian power, to conclude a treaty with that prince, in consequence\nof which he was to be furnished with military stores and ships to help\nto demolish the commerce of other Christian Governments.\n\n\"'My mission is done,' said this honest eunuch; 'I go to embark for\nCeuta, and will take you to Italy. _Ma che sciagura d'essere senza\ncoglioni!_'\n\n\"I thanked him with tears of commiseration; and instead of taking me to\nItaly he conducted me to Algiers, where he sold me to the Dey. Scarcely\nwas I sold, than the plague which had made the tour of Africa, Asia, and\nEurope, broke out with great malignancy in Algiers. You have seen\nearthquakes; but pray, miss, have you ever had the plague?\"\n\n\"Never,\" answered Cunegonde.\n\n\"If you had,\" said the old woman, \"you would acknowledge that it is far\nmore terrible than an earthquake. It is common in Africa, and I caught\nit. Imagine to yourself the distressed situation of the daughter of a\nPope, only fifteen years old, who, in less than three months, had felt\nthe miseries of poverty and slavery, had been ravished almost every day,\nhad beheld her mother drawn in quarters, had experienced famine and war,\nand was dying of the plague in Algiers. I did not die, however, but my\neunuch, and the Dey, and almost the whole seraglio of Algiers perished.\n\n\"As soon as the first fury of this terrible pestilence was over, a sale\nwas made of the Dey's slaves; I was purchased by a merchant, and carried\nto Tunis; this man sold me to another merchant, who sold me again to\nanother at Tripoli; from Tripoli I was sold to Alexandria, from\nAlexandria to Smyrna, and from Smyrna to Constantinople. At length I\nbecame the property of an Aga of the Janissaries, who was soon ordered\naway to the defence of Azof, then besieged by the Russians.\n\n\"The Aga, who was a very gallant man, took his whole seraglio with him,\nand lodged us in a small fort on the Palus Meotides, guarded by two\nblack eunuchs and twenty soldiers. The Turks killed prodigious numbers\nof the Russians, but the latter had their revenge. Azof was destroyed by\nfire, the inhabitants put to the sword, neither sex nor age was spared;\nuntil there remained only our little fort, and the enemy wanted to\nstarve us out. The twenty Janissaries had sworn they would never\nsurrender. The extremities of famine to which they were reduced, obliged\nthem to eat our two eunuchs, for fear of violating their oath. And at\nthe end of a few days they resolved also to devour the women.\n\n\"We had a very pious and humane Iman, who preached an excellent sermon,\nexhorting them not to kill us all at once.\n\n\"'Only cut off a buttock of each of those ladies,' said he, 'and you'll\nfare extremely well; if you must go to it again, there will be the same\nentertainment a few days hence; heaven will accept of so charitable an\naction, and send you relief.'\n\n\"He had great eloquence; he persuaded them; we underwent this terrible\noperation. The Iman applied the same balsam to us, as he does to\nchildren after circumcision; and we all nearly died.\n\n\"Scarcely had the Janissaries finished the repast with which we had\nfurnished them, than the Russians came in flat-bottomed boats; not a\nJanissary escaped. The Russians paid no attention to the condition we\nwere in. There are French surgeons in all parts of the world; one of\nthem who was very clever took us under his care--he cured us; and as\nlong as I live I shall remember that as soon as my wounds were healed he\nmade proposals to me. He bid us all be of good cheer, telling us that\nthe like had happened in many sieges, and that it was according to the\nlaws of war.\n\n\"As soon as my companions could walk, they were obliged to set out for\nMoscow. I fell to the share of a Boyard who made me his gardener, and\ngave me twenty lashes a day. But this nobleman having in two years' time\nbeen broke upon the wheel along with thirty more Boyards for some broils\nat court, I profited by that event; I fled. I traversed all Russia; I\nwas a long time an inn-holder's servant at Riga, the same at Rostock, at\nVismar, at Leipzig, at Cassel, at Utrecht, at Leyden, at the Hague, at\nRotterdam. I waxed old in misery and disgrace, having only one-half of\nmy posteriors, and always remembering I was a Pope's daughter. A hundred\ntimes I was upon the point of killing myself; but still I loved life.\nThis ridiculous foible is perhaps one of our most fatal characteristics;\nfor is there anything more absurd than to wish to carry continually a\nburden which one can always throw down? to detest existence and yet to\ncling to one's existence? in brief, to caress the serpent which devours\nus, till he has eaten our very heart?\n\n\"In the different countries which it has been my lot to traverse, and\nthe numerous inns where I have been servant, I have taken notice of a\nvast number of people who held their own existence in abhorrence, and\nyet I never knew of more than eight who voluntarily put an end to their\nmisery; three negroes, four Englishmen, and a German professor named\nRobek.[14] I ended by being servant to the Jew, Don Issachar, who placed\nme near your presence, my fair lady. I am determined to share your fate,\nand have been much more affected with your misfortunes than with my own.\nI would never even have spoken to you of my misfortunes, had you not\npiqued me a little, and if it were not customary to tell stories on\nboard a ship in order to pass away the time. In short, Miss Cunegonde, I\nhave had experience, I know the world; therefore I advise you to divert\nyourself, and prevail upon each passenger to tell his story; and if\nthere be one of them all, that has not cursed his life many a time, that\nhas not frequently looked upon himself as the unhappiest of mortals, I\ngive you leave to throw me headforemost into the sea.\"\n\n\n\n\nXIII\n\nHOW CANDIDE WAS FORCED AWAY FROM HIS FAIR CUNEGONDE AND THE OLD WOMAN.\n\n\nThe beautiful Cunegonde having heard the old woman's history, paid her\nall the civilities due to a person of her rank and merit. She likewise\naccepted her proposal, and engaged all the passengers, one after the\nother, to relate their adventures; and then both she and Candide allowed\nthat the old woman was in the right.\n\n\"It is a great pity,\" said Candide, \"that the sage Pangloss was hanged\ncontrary to custom at an _auto-da-fe_; he would tell us most amazing\nthings in regard to the physical and moral evils that overspread earth\nand sea, and I should be able, with due respect, to make a few\nobjections.\"\n\nWhile each passenger was recounting his story, the ship made her way.\nThey landed at Buenos Ayres. Cunegonde, Captain Candide, and the old\nwoman, waited on the Governor, Don Fernando d'Ibaraa, y Figueora, y\nMascarenes, y Lampourdos, y Souza. This nobleman had a stateliness\nbecoming a person who bore so many names. He spoke to men with so noble\na disdain, carried his nose so loftily, raised his voice so\nunmercifully, assumed so imperious an air, and stalked with such\nintolerable pride, that those who saluted him were strongly inclined to\ngive him a good drubbing. Cunegonde appeared to him the most beautiful\nhe had ever met. The first thing he did was to ask whether she was not\nthe captain's wife. The manner in which he asked the question alarmed\nCandide; he durst not say she was his wife, because indeed she was not;\nneither durst he say she was his sister, because it was not so; and\nalthough this obliging lie had been formerly much in favour among the\nancients, and although it could be useful to the moderns, his soul was\ntoo pure to betray the truth.\n\n\"Miss Cunegonde,\" said he, \"is to do me the honour to marry me, and we\nbeseech your excellency to deign to sanction our marriage.\"\n\nDon Fernando d'Ibaraa, y Figueora, y Mascarenes, y Lampourdos, y Souza,\nturning up his moustachios, smiled mockingly, and ordered Captain\nCandide to go and review his company. Candide obeyed, and the Governor\nremained alone with Miss Cunegonde. He declared his passion, protesting\nhe would marry her the next day in the face of the church, or otherwise,\njust as should be agreeable to herself. Cunegonde asked a quarter of an\nhour to consider of it, to consult the old woman, and to take her\nresolution.\n\nThe old woman spoke thus to Cunegonde:\n\n\"Miss, you have seventy-two quarterings, and not a farthing; it is now\nin your power to be wife to the greatest lord in South America, who has\nvery beautiful moustachios. Is it for you to pique yourself upon\ninviolable fidelity? You have been ravished by Bulgarians; a Jew and an\nInquisitor have enjoyed your favours. Misfortune gives sufficient\nexcuse. I own, that if I were in your place, I should have no scruple in\nmarrying the Governor and in making the fortune of Captain Candide.\"\n\nWhile the old woman spoke with all the prudence which age and experience\ngave, a small ship entered the port on board of which were an Alcalde\nand his alguazils, and this was what had happened.\n\nAs the old woman had shrewdly guessed, it was a Grey Friar who stole\nCunegonde's money and jewels in the town of Badajos, when she and\nCandide were escaping. The Friar wanted to sell some of the diamonds to\na jeweller; the jeweller knew them to be the Grand Inquisitor's. The\nFriar before he was hanged confessed he had stolen them. He described\nthe persons, and the route they had taken. The flight of Cunegonde and\nCandide was already known. They were traced to Cadiz. A vessel was\nimmediately sent in pursuit of them. The vessel was already in the port\nof Buenos Ayres. The report spread that the Alcalde was going to land,\nand that he was in pursuit of the murderers of my lord the Grand\nInquisitor. The prudent old woman saw at once what was to be done.\n\n\"You cannot run away,\" said she to Cunegonde, \"and you have nothing to\nfear, for it was not you that killed my lord; besides the Governor who\nloves you will not suffer you to be ill-treated; therefore stay.\"\n\nShe then ran immediately to Candide.\n\n\"Fly,\" said she, \"or in an hour you will be burnt.\"\n\nThere was not a moment to lose; but how could he part from Cunegonde,\nand where could he flee for shelter?\n\n\n\n\nXIV\n\nHOW CANDIDE AND CACAMBO WERE RECEIVED BY THE JESUITS OF PARAGUAY.\n\n\nCandide had brought such a valet with him from Cadiz, as one often meets\nwith on the coasts of Spain and in the American colonies. He was a\nquarter Spaniard, born of a mongrel in Tucuman; he had been singing-boy,\nsacristan, sailor, monk, pedlar, soldier, and lackey. His name was\nCacambo, and he loved his master, because his master was a very good\nman. He quickly saddled the two Andalusian horses.\n\n\"Come, master, let us follow the old woman's advice; let us start, and\nrun without looking behind us.\"\n\nCandide shed tears.\n\n\"Oh! my dear Cunegonde! must I leave you just at a time when the\nGovernor was going to sanction our nuptials? Cunegonde, brought to such\na distance what will become of you?\"\n\n\"She will do as well as she can,\" said Cacambo; \"the women are never at\na loss, God provides for them, let us run.\"\n\n\"Whither art thou carrying me? Where shall we go? What shall we do\nwithout Cunegonde?\" said Candide.\n\n\"By St. James of Compostella,\" said Cacambo, \"you were going to fight\nagainst the Jesuits; let us go to fight for them; I know the road well,\nI'll conduct you to their kingdom, where they will be charmed to have a\ncaptain that understands the Bulgarian exercise. You'll make a\nprodigious fortune; if we cannot find our account in one world we shall\nin another. It is a great pleasure to see and do new things.\"\n\n\"You have before been in Paraguay, then?\" said Candide.\n\n\"Ay, sure,\" answered Cacambo, \"I was servant in the College of the\nAssumption, and am acquainted with the government of the good Fathers as\nwell as I am with the streets of Cadiz. It is an admirable government.\nThe kingdom is upwards of three hundred leagues in diameter, and divided\ninto thirty provinces; there the Fathers possess all, and the people\nnothing; it is a masterpiece of reason and justice. For my part I see\nnothing so divine as the Fathers who here make war upon the kings of\nSpain and Portugal, and in Europe confess those kings; who here kill\nSpaniards, and in Madrid send them to heaven; this delights me, let us\npush forward. You are going to be the happiest of mortals. What pleasure\nwill it be to those Fathers to hear that a captain who knows the\nBulgarian exercise has come to them!\"\n\nAs soon as they reached the first barrier, Cacambo told the advanced\nguard that a captain wanted to speak with my lord the Commandant. Notice\nwas given to the main guard, and immediately a Paraguayan officer ran\nand laid himself at the feet of the Commandant, to impart this news to\nhim. Candide and Cacambo were disarmed, and their two Andalusian horses\nseized. The strangers were introduced between two files of musketeers;\nthe Commandant was at the further end, with the three-cornered cap on\nhis head, his gown tucked up, a sword by his side, and a spontoon[15] in\nhis hand. He beckoned, and straightway the new-comers were encompassed\nby four-and-twenty soldiers. A sergeant told them they must wait, that\nthe Commandant could not speak to them, and that the reverend Father\nProvincial does not suffer any Spaniard to open his mouth but in his\npresence, or to stay above three hours in the province.\n\n\"And where is the reverend Father Provincial?\" said Cacambo.\n\n\"He is upon the parade just after celebrating mass,\" answered the\nsergeant, \"and you cannot kiss his spurs till three hours hence.\"\n\n\"However,\" said Cacambo, \"the captain is not a Spaniard, but a German,\nhe is ready to perish with hunger as well as myself; cannot we have\nsomething for breakfast, while we wait for his reverence?\"\n\nThe sergeant went immediately to acquaint the Commandant with what he\nhad heard.\n\n\"God be praised!\" said the reverend Commandant, \"since he is a German, I\nmay speak to him; take him to my arbour.\"\n\nCandide was at once conducted to a beautiful summer-house, ornamented\nwith a very pretty colonnade of green and gold marble, and with\ntrellises, enclosing parraquets, humming-birds, fly-birds, guinea-hens,\nand all other rare birds. An excellent breakfast was provided in vessels\nof gold; and while the Paraguayans were eating maize out of wooden\ndishes, in the open fields and exposed to the heat of the sun, the\nreverend Father Commandant retired to his arbour.\n\nHe was a very handsome young man, with a full face, white skin but high\nin colour; he had an arched eyebrow, a lively eye, red ears, vermilion\nlips, a bold air, but such a boldness as neither belonged to a Spaniard\nnor a Jesuit. They returned their arms to Candide and Cacambo, and also\nthe two Andalusian horses; to whom Cacambo gave some oats to eat just by\nthe arbour, having an eye upon them all the while for fear of a\nsurprise.\n\nCandide first kissed the hem of the Commandant's robe, then they sat\ndown to table.\n\n\"You are, then, a German?\" said the Jesuit to him in that language.\n\n\"Yes, reverend Father,\" answered Candide.\n\nAs they pronounced these words they looked at each other with great\namazement, and with such an emotion as they could not conceal.\n\n\"And from what part of Germany do you come?\" said the Jesuit.\n\n\"I am from the dirty province of Westphalia,\" answered Candide; \"I was\nborn in the Castle of Thunder-ten-Tronckh.\"\n\n\"Oh! Heavens! is it possible?\" cried the Commandant.\n\n\"What a miracle!\" cried Candide.\n\n\"Is it really you?\" said the Commandant.\n\n\"It is not possible!\" said Candide.\n\nThey drew back; they embraced; they shed rivulets of tears.\n\n\"What, is it you, reverend Father? You, the brother of the fair\nCunegonde! You, that was slain by the Bulgarians! You, the Baron's son!\nYou, a Jesuit in Paraguay! I must confess this is a strange world that\nwe live in. Oh, Pangloss! Pangloss! how glad you would be if you had not\nbeen hanged!\"\n\nThe Commandant sent away the negro slaves and the Paraguayans, who\nserved them with liquors in goblets of rock-crystal. He thanked God and\nSt. Ignatius a thousand times; he clasped Candide in his arms; and their\nfaces were all bathed with tears.\n\n\"You will be more surprised, more affected, and transported,\" said\nCandide, \"when I tell you that Cunegonde, your sister, whom you believe\nto have been ripped open, is in perfect health.\"\n\n\"Where?\"\n\n\"In your neighbourhood, with the Governor of Buenos Ayres; and I was\ngoing to fight against you.\"\n\nEvery word which they uttered in this long conversation but added wonder\nto wonder. Their souls fluttered on their tongues, listened in their\nears, and sparkled in their eyes. As they were Germans, they sat a good\nwhile at table, waiting for the reverend Father Provincial, and the\nCommandant spoke to his dear Candide as follows.\n\n\n\n\nXV\n\nHOW CANDIDE KILLED THE BROTHER OF HIS DEAR CUNEGONDE.\n\n\n\"I shall have ever present to my memory the dreadful day, on which I saw\nmy father and mother killed, and my sister ravished. When the Bulgarians\nretired, my dear sister could not be found; but my mother, my father,\nand myself, with two maid-servants and three little boys all of whom had\nbeen slain, were put in a hearse, to be conveyed for interment to a\nchapel belonging to the Jesuits, within two leagues of our family seat.\nA Jesuit sprinkled us with some holy water; it was horribly salt; a few\ndrops of it fell into my eyes; the father perceived that my eyelids\nstirred a little; he put his hand upon my heart and felt it beat. I\nreceived assistance, and at the end of three weeks I recovered. You\nknow, my dear Candide, I was very pretty; but I grew much prettier, and\nthe reverend Father Didrie,[16] Superior of that House, conceived the\ntenderest friendship for me; he gave me the habit of the order, some\nyears after I was sent to Rome. The Father-General needed new levies of\nyoung German-Jesuits. The sovereigns of Paraguay admit as few Spanish\nJesuits as possible; they prefer those of other nations as being more\nsubordinate to their commands. I was judged fit by the reverend\nFather-General to go and work in this vineyard. We set out--a Pole, a\nTyrolese, and myself. Upon my arrival I was honoured with a\nsub-deaconship and a lieutenancy. I am to-day colonel and priest. We\nshall give a warm reception to the King of Spain's troops; I will answer\nfor it that they shall be excommunicated and well beaten. Providence\nsends you here to assist us. But is it, indeed, true that my dear sister\nCunegonde is in the neighbourhood, with the Governor of Buenos Ayres?\"\n\nCandide assured him on oath that nothing was more true, and their tears\nbegan afresh.\n\nThe Baron could not refrain from embracing Candide; he called him his\nbrother, his saviour.\n\n\"Ah! perhaps,\" said he, \"we shall together, my dear Candide, enter the\ntown as conquerors, and recover my sister Cunegonde.\"\n\n\"That is all I want,\" said Candide, \"for I intended to marry her, and I\nstill hope to do so.\"\n\n\"You insolent!\" replied the Baron, \"would you have the impudence to\nmarry my sister who has seventy-two quarterings! I find thou hast the\nmost consummate effrontery to dare to mention so presumptuous a design!\"\n\nCandide, petrified at this speech, made answer:\n\n\"Reverend Father, all the quarterings in the world signify nothing; I\nrescued your sister from the arms of a Jew and of an Inquisitor; she has\ngreat obligations to me, she wishes to marry me; Master Pangloss always\ntold me that all men are equal, and certainly I will marry her.\"\n\n\"We shall see that, thou scoundrel!\" said the Jesuit Baron de\nThunder-ten-Tronckh, and that instant struck him across the face with\nthe flat of his sword. Candide in an instant drew his rapier, and\nplunged it up to the hilt in the Jesuit's belly; but in pulling it out\nreeking hot, he burst into tears.\n\n\"Good God!\" said he, \"I have killed my old master, my friend, my\nbrother-in-law! I am the best-natured creature in the world, and yet I\nhave already killed three men, and of these three two were priests.\"\n\nCacambo, who stood sentry by the door of the arbour, ran to him.\n\n\"We have nothing more for it than to sell our lives as dearly as we\ncan,\" said his master to him, \"without doubt some one will soon enter\nthe arbour, and we must die sword in hand.\"\n\nCacambo, who had been in a great many scrapes in his lifetime, did not\nlose his head; he took the Baron's Jesuit habit, put it on Candide, gave\nhim the square cap, and made him mount on horseback. All this was done\nin the twinkling of an eye.\n\n\"Let us gallop fast, master, everybody will take you for a Jesuit, going\nto give directions to your men, and we shall have passed the frontiers\nbefore they will be able to overtake us.\"\n\nHe flew as he spoke these words, crying out aloud in Spanish:\n\n\"Make way, make way, for the reverend Father Colonel.\"\n\n\n\n\nXVI\n\nADVENTURES OF THE TWO TRAVELLERS, WITH TWO GIRLS, TWO MONKEYS, AND THE\nSAVAGES CALLED OREILLONS.\n\n\nCandide and his valet had got beyond the barrier, before it was known in\nthe camp that the German Jesuit was dead. The wary Cacambo had taken\ncare to fill his wallet with bread, chocolate, bacon, fruit, and a few\nbottles of wine. With their Andalusian horses they penetrated into an\nunknown country, where they perceived no beaten track. At length they\ncame to a beautiful meadow intersected with purling rills. Here our two\nadventurers fed their horses. Cacambo proposed to his master to take\nsome food, and he set him an example.\n\n\"How can you ask me to eat ham,\" said Candide, \"after killing the\nBaron's son, and being doomed never more to see the beautiful Cunegonde?\nWhat will it avail me to spin out my wretched days and drag them far\nfrom her in remorse and despair? And what will the _Journal of\nTrevoux_[17] say?\"\n\nWhile he was thus lamenting his fate, he went on eating. The sun went\ndown. The two wanderers heard some little cries which seemed to be\nuttered by women. They did not know whether they were cries of pain or\njoy; but they started up precipitately with that inquietude and alarm\nwhich every little thing inspires in an unknown country. The noise was\nmade by two naked girls, who tripped along the mead, while two monkeys\nwere pursuing them and biting their buttocks. Candide was moved with\npity; he had learned to fire a gun in the Bulgarian service, and he was\nso clever at it, that he could hit a filbert in a hedge without touching\na leaf of the tree. He took up his double-barrelled Spanish fusil, let\nit off, and killed the two monkeys.\n\n\"God be praised! My dear Cacambo, I have rescued those two poor\ncreatures from a most perilous situation. If I have committed a sin in\nkilling an Inquisitor and a Jesuit, I have made ample amends by saving\nthe lives of these girls. Perhaps they are young ladies of family; and\nthis adventure may procure us great advantages in this country.\"\n\nHe was continuing, but stopped short when he saw the two girls tenderly\nembracing the monkeys, bathing their bodies in tears, and rending the\nair with the most dismal lamentations.\n\n\"Little did I expect to see such good-nature,\" said he at length to\nCacambo; who made answer:\n\n\"Master, you have done a fine thing now; you have slain the sweethearts\nof those two young ladies.\"\n\n\"The sweethearts! Is it possible? You are jesting, Cacambo, I can never\nbelieve it!\"\n\n\"Dear master,\" replied Cacambo; \"you are surprised at everything. Why\nshould you think it so strange that in some countries there are monkeys\nwhich insinuate themselves into the good graces of the ladies; they are\na fourth part human, as I am a fourth part Spaniard.\"\n\n\"Alas!\" replied Candide, \"I remember to have heard Master Pangloss say,\nthat formerly such accidents used to happen; that these mixtures were\nproductive of Centaurs, Fauns, and Satyrs; and that many of the ancients\nhad seen such monsters, but I looked upon the whole as fabulous.\"\n\n\"You ought now to be convinced,\" said Cacambo, \"that it is the truth,\nand you see what use is made of those creatures, by persons that have\nnot had a proper education; all I fear is that those ladies will play us\nsome ugly trick.\"\n\nThese sound reflections induced Candide to leave the meadow and to\nplunge into a wood. He supped there with Cacambo; and after cursing the\nPortuguese inquisitor, the Governor of Buenos Ayres, and the Baron, they\nfell asleep on moss. On awaking they felt that they could not move; for\nduring the night the Oreillons, who inhabited that country, and to whom\nthe ladies had denounced them, had bound them with cords made of the\nbark of trees. They were encompassed by fifty naked Oreillons, armed\nwith bows and arrows, with clubs and flint hatchets. Some were making a\nlarge cauldron boil, others were preparing spits, and all cried:\n\n\"A Jesuit! a Jesuit! we shall be revenged, we shall have excellent\ncheer, let us eat the Jesuit, let us eat him up!\"\n\n\"I told you, my dear master,\" cried Cacambo sadly, \"that those two girls\nwould play us some ugly trick.\"\n\nCandide seeing the cauldron and the spits, cried:\n\n\"We are certainly going to be either roasted or boiled. Ah! what would\nMaster Pangloss say, were he to see how pure nature is formed?\nEverything is right, may be, but I declare it is very hard to have lost\nMiss Cunegonde and to be put upon a spit by Oreillons.\"\n\nCacambo never lost his head.\n\n\"Do not despair,\" said he to the disconsolate Candide, \"I understand a\nlittle of the jargon of these people, I will speak to them.\"\n\n\"Be sure,\" said Candide, \"to represent to them how frightfully inhuman\nit is to cook men, and how very un-Christian.\"\n\n\"Gentlemen,\" said Cacambo, \"you reckon you are to-day going to feast\nupon a Jesuit. It is all very well, nothing is more unjust than thus to\ntreat your enemies. Indeed, the law of nature teaches us to kill our\nneighbour, and such is the practice all over the world. If we do not\naccustom ourselves to eating them, it is because we have better fare.\nBut you have not the same resources as we; certainly it is much better\nto devour your enemies than to resign to the crows and rooks the fruits\nof your victory. But, gentlemen, surely you would not choose to eat your\nfriends. You believe that you are going to spit a Jesuit, and he is your\ndefender. It is the enemy of your enemies that you are going to roast.\nAs for myself, I was born in your country; this gentleman is my master,\nand, far from being a Jesuit, he has just killed one, whose spoils he\nwears; and thence comes your mistake. To convince you of the truth of\nwhat I say, take his habit and carry it to the first barrier of the\nJesuit kingdom, and inform yourselves whether my master did not kill a\nJesuit officer. It will not take you long, and you can always eat us if\nyou find that I have lied to you. But I have told you the truth. You are\ntoo well acquainted with the principles of public law, humanity, and\njustice not to pardon us.\"\n\nThe Oreillons found this speech very reasonable. They deputed two of\ntheir principal people with all expedition to inquire into the truth of\nthe matter; these executed their commission like men of sense, and soon\nreturned with good news. The Oreillons untied their prisoners, showed\nthem all sorts of civilities, offered them girls, gave them refreshment,\nand reconducted them to the confines of their territories, proclaiming\nwith great joy:\n\n\"He is no Jesuit! He is no Jesuit!\"\n\nCandide could not help being surprised at the cause of his deliverance.\n\n\"What people!\" said he; \"what men! what manners! If I had not been so\nlucky as to run Miss Cunegonde's brother through the body, I should have\nbeen devoured without redemption. But, after all, pure nature is good,\nsince these people, instead of feasting upon my flesh, have shown me a\nthousand civilities, when then I was not a Jesuit.\"\n\n\n\n\nXVII\n\nARRIVAL OF CANDIDE AND HIS VALET AT EL DORADO, AND WHAT THEY SAW THERE.\n\n\n\"You see,\" said Cacambo to Candide, as soon as they had reached the\nfrontiers of the Oreillons, \"that this hemisphere is not better than the\nothers, take my word for it; let us go back to Europe by the shortest\nway.\"\n\n\"How go back?\" said Candide, \"and where shall we go? to my own country?\nThe Bulgarians and the Abares are slaying all; to Portugal? there I\nshall be burnt; and if we abide here we are every moment in danger of\nbeing spitted. But how can I resolve to quit a part of the world where\nmy dear Cunegonde resides?\"\n\n\"Let us turn towards Cayenne,\" said Cacambo, \"there we shall find\nFrenchmen, who wander all over the world; they may assist us; God will\nperhaps have pity on us.\"\n\nIt was not easy to get to Cayenne; they knew vaguely in which direction\nto go, but rivers, precipices, robbers, savages, obstructed them all the\nway. Their horses died of fatigue. Their provisions were consumed; they\nfed a whole month upon wild fruits, and found themselves at last near a\nlittle river bordered with cocoa trees, which sustained their lives and\ntheir hopes.\n\nCacambo, who was as good a counsellor as the old woman, said to Candide:\n\n\"We are able to hold out no longer; we have walked enough. I see an\nempty canoe near the river-side; let us fill it with cocoanuts, throw\nourselves into it, and go with the current; a river always leads to some\ninhabited spot. If we do not find pleasant things we shall at least find\nnew things.\"\n\n\"With all my heart,\" said Candide, \"let us recommend ourselves to\nProvidence.\"\n\nThey rowed a few leagues, between banks, in some places flowery, in\nothers barren; in some parts smooth, in others rugged. The stream ever\nwidened, and at length lost itself under an arch of frightful rocks\nwhich reached to the sky. The two travellers had the courage to commit\nthemselves to the current. The river, suddenly contracting at this\nplace, whirled them along with a dreadful noise and rapidity. At the end\nof four-and-twenty hours they saw daylight again, but their canoe was\ndashed to pieces against the rocks. For a league they had to creep from\nrock to rock, until at length they discovered an extensive plain,\nbounded by inaccessible mountains. The country was cultivated as much\nfor pleasure as for necessity. On all sides the useful was also the\nbeautiful. The roads were covered, or rather adorned, with carriages of\na glittering form and substance, in which were men and women of\nsurprising beauty, drawn by large red sheep which surpassed in fleetness\nthe finest coursers of Andalusia, Tetuan, and Mequinez.[18]\n\n\"Here, however, is a country,\" said Candide, \"which is better than\nWestphalia.\"\n\nHe stepped out with Cacambo towards the first village which he saw. Some\nchildren dressed in tattered brocades played at quoits on the outskirts.\nOur travellers from the other world amused themselves by looking on. The\nquoits were large round pieces, yellow, red, and green, which cast a\nsingular lustre! The travellers picked a few of them off the ground;\nthis was of gold, that of emeralds, the other of rubies--the least of\nthem would have been the greatest ornament on the Mogul's throne.\n\n\"Without doubt,\" said Cacambo, \"these children must be the king's sons\nthat are playing at quoits!\"\n\nThe village schoolmaster appeared at this moment and called them to\nschool.\n\n\"There,\" said Candide, \"is the preceptor of the royal family.\"\n\nThe little truants immediately quitted their game, leaving the quoits\non the ground with all their other playthings. Candide gathered them up,\nran to the master, and presented them to him in a most humble manner,\ngiving him to understand by signs that their royal highnesses had\nforgotten their gold and jewels. The schoolmaster, smiling, flung them\nupon the ground; then, looking at Candide with a good deal of surprise,\nwent about his business.\n\nThe travellers, however, took care to gather up the gold, the rubies,\nand the emeralds.\n\n\"Where are we?\" cried Candide. \"The king's children in this country must\nbe well brought up, since they are taught to despise gold and precious\nstones.\"\n\nCacambo was as much surprised as Candide. At length they drew near the\nfirst house in the village. It was built like an European palace. A\ncrowd of people pressed about the door, and there were still more in the\nhouse. They heard most agreeable music, and were aware of a delicious\nodour of cooking. Cacambo went up to the door and heard they were\ntalking Peruvian; it was his mother tongue, for it is well known that\nCacambo was born in Tucuman, in a village where no other language was\nspoken.\n\n\"I will be your interpreter here,\" said he to Candide; \"let us go in, it\nis a public-house.\"\n\nImmediately two waiters and two girls, dressed in cloth of gold, and\ntheir hair tied up with ribbons, invited them to sit down to table with\nthe landlord. They served four dishes of soup, each garnished with two\nyoung parrots; a boiled condor[19] which weighed two hundred pounds; two\nroasted monkeys, of excellent flavour; three hundred humming-birds in\none dish, and six hundred fly-birds in another; exquisite ragouts;\ndelicious pastries; the whole served up in dishes of a kind of\nrock-crystal. The waiters and girls poured out several liqueurs drawn\nfrom the sugar-cane.\n\nMost of the company were chapmen and waggoners, all extremely polite;\nthey asked Cacambo a few questions with the greatest circumspection, and\nanswered his in the most obliging manner.\n\nAs soon as dinner was over, Cacambo believed as well as Candide that\nthey might well pay their reckoning by laying down two of those large\ngold pieces which they had picked up. The landlord and landlady shouted\nwith laughter and held their sides. When the fit was over:\n\n\"Gentlemen,\" said the landlord, \"it is plain you are strangers, and such\nguests we are not accustomed to see; pardon us therefore for laughing\nwhen you offered us the pebbles from our highroads in payment of your\nreckoning. You doubtless have not the money of the country; but it is\nnot necessary to have any money at all to dine in this house. All\nhostelries established for the convenience of commerce are paid by the\ngovernment. You have fared but very indifferently because this is a poor\nvillage; but everywhere else, you will be received as you deserve.\"\n\nCacambo explained this whole discourse with great astonishment to\nCandide, who was as greatly astonished to hear it.\n\n\"What sort of a country then is this,\" said they to one another; \"a\ncountry unknown to all the rest of the world, and where nature is of a\nkind so different from ours? It is probably the country where all is\nwell; for there absolutely must be one such place. And, whatever Master\nPangloss might say, I often found that things went very ill in\nWestphalia.\"\n\n\n\n\nXVIII\n\nWHAT THEY SAW IN THE COUNTRY OF EL DORADO.\n\n\nCacambo expressed his curiosity to the landlord, who made answer:\n\n\"I am very ignorant, but not the worse on that account. However, we have\nin this neighbourhood an old man retired from Court who is the most\nlearned and most communicative person in the kingdom.\"\n\nAt once he took Cacambo to the old man. Candide acted now only a second\ncharacter, and accompanied his valet. They entered a very plain house,\nfor the door was only of silver, and the ceilings were only of gold, but\nwrought in so elegant a taste as to vie with the richest. The\nantechamber, indeed, was only encrusted with rubies and emeralds, but\nthe order in which everything was arranged made amends for this great\nsimplicity.\n\nThe old man received the strangers on his sofa, which was stuffed with\nhumming-birds' feathers, and ordered his servants to present them with\nliqueurs in diamond goblets; after which he satisfied their curiosity\nin the following terms:\n\n\"I am now one hundred and seventy-two years old, and I learnt of my late\nfather, Master of the Horse to the King, the amazing revolutions of\nPeru, of which he had been an eyewitness. The kingdom we now inhabit is\nthe ancient country of the Incas, who quitted it very imprudently to\nconquer another part of the world, and were at length destroyed by the\nSpaniards.\n\n\"More wise by far were the princes of their family, who remained in\ntheir native country; and they ordained, with the consent of the whole\nnation, that none of the inhabitants should ever be permitted to quit\nthis little kingdom; and this has preserved our innocence and happiness.\nThe Spaniards have had a confused notion of this country, and have\ncalled it _El Dorado_; and an Englishman, whose name was Sir Walter\nRaleigh, came very near it about a hundred years ago; but being\nsurrounded by inaccessible rocks and precipices, we have hitherto been\nsheltered from the rapaciousness of European nations, who have an\ninconceivable passion for the pebbles and dirt of our land, for the sake\nof which they would murder us to the last man.\"\n\nThe conversation was long: it turned chiefly on their form of\ngovernment, their manners, their women, their public entertainments,\nand the arts. At length Candide, having always had a taste for\nmetaphysics, made Cacambo ask whether there was any religion in that\ncountry.\n\nThe old man reddened a little.\n\n\"How then,\" said he, \"can you doubt it? Do you take us for ungrateful\nwretches?\"\n\nCacambo humbly asked, \"What was the religion in El Dorado?\"\n\nThe old man reddened again.\n\n\"Can there be two religions?\" said he. \"We have, I believe, the religion\nof all the world: we worship God night and morning.\"\n\n\"Do you worship but one God?\" said Cacambo, who still acted as\ninterpreter in representing Candide's doubts.\n\n\"Surely,\" said the old man, \"there are not two, nor three, nor four. I\nmust confess the people from your side of the world ask very\nextraordinary questions.\"\n\nCandide was not yet tired of interrogating the good old man; he wanted\nto know in what manner they prayed to God in El Dorado.\n\n\"We do not pray to Him,\" said the worthy sage; \"we have nothing to ask\nof Him; He has given us all we need, and we return Him thanks without\nceasing.\"\n\nCandide having a curiosity to see the priests asked where they were.\nThe good old man smiled.\n\n\"My friend,\" said he, \"we are all priests. The King and all the heads of\nfamilies sing solemn canticles of thanksgiving every morning,\naccompanied by five or six thousand musicians.\"\n\n\"What! have you no monks who teach, who dispute, who govern, who cabal,\nand who burn people that are not of their opinion?\"\n\n\"We must be mad, indeed, if that were the case,\" said the old man; \"here\nwe are all of one opinion, and we know not what you mean by monks.\"\n\nDuring this whole discourse Candide was in raptures, and he said to\nhimself:\n\n\"This is vastly different from Westphalia and the Baron's castle. Had\nour friend Pangloss seen El Dorado he would no longer have said that the\ncastle of Thunder-ten-Tronckh was the finest upon earth. It is evident\nthat one must travel.\"\n\nAfter this long conversation the old man ordered a coach and six sheep\nto be got ready, and twelve of his domestics to conduct the travellers\nto Court.\n\n\"Excuse me,\" said he, \"if my age deprives me of the honour of\naccompanying you. The King will receive you in a manner that cannot\ndisplease you; and no doubt you will make an allowance for the customs\nof the country, if some things should not be to your liking.\"\n\nCandide and Cacambo got into the coach, the six sheep flew, and in less\nthan four hours they reached the King's palace situated at the extremity\nof the capital. The portal was two hundred and twenty feet high, and one\nhundred wide; but words are wanting to express the materials of which it\nwas built. It is plain such materials must have prodigious superiority\nover those pebbles and sand which we call gold and precious stones.\n\nTwenty beautiful damsels of the King's guard received Candide and\nCacambo as they alighted from the coach, conducted them to the bath, and\ndressed them in robes woven of the down of humming-birds; after which\nthe great crown officers, of both sexes, led them to the King's\napartment, between two files of musicians, a thousand on each side. When\nthey drew near to the audience chamber Cacambo asked one of the great\nofficers in what way he should pay his obeisance to his Majesty; whether\nthey should throw themselves upon their knees or on their stomachs;\nwhether they should put their hands upon their heads or behind their\nbacks; whether they should lick the dust off the floor; in a word, what\nwas the ceremony?\n\n\"The custom,\" said the great officer, \"is to embrace the King, and to\nkiss him on each cheek.\"\n\nCandide and Cacambo threw themselves round his Majesty's neck. He\nreceived them with all the goodness imaginable, and politely invited\nthem to supper.\n\nWhile waiting they were shown the city, and saw the public edifices\nraised as high as the clouds, the market places ornamented with a\nthousand columns, the fountains of spring water, those of rose water,\nthose of liqueurs drawn from sugar-cane, incessantly flowing into the\ngreat squares, which were paved with a kind of precious stone, which\ngave off a delicious fragrancy like that of cloves and cinnamon. Candide\nasked to see the court of justice, the parliament. They told him they\nhad none, and that they were strangers to lawsuits. He asked if they had\nany prisons, and they answered no. But what surprised him most and gave\nhim the greatest pleasure was the palace of sciences, where he saw a\ngallery two thousand feet long, and filled with instruments employed in\nmathematics and physics.\n\nAfter rambling about the city the whole afternoon, and seeing but a\nthousandth part of it, they were reconducted to the royal palace, where\nCandide sat down to table with his Majesty, his valet Cacambo, and\nseveral ladies. Never was there a better entertainment, and never was\nmore wit shown at a table than that which fell from his Majesty. Cacambo\nexplained the King's _bon-mots_ to Candide, and notwithstanding they\nwere translated they still appeared to be _bon-mots_. Of all the things\nthat surprised Candide this was not the least.\n\nThey spent a month in this hospitable place. Candide frequently said to\nCacambo:\n\n\"I own, my friend, once more that the castle where I was born is nothing\nin comparison with this; but, after all, Miss Cunegonde is not here, and\nyou have, without doubt, some mistress in Europe. If we abide here we\nshall only be upon a footing with the rest, whereas, if we return to our\nold world, only with twelve sheep laden with the pebbles of El Dorado,\nwe shall be richer than all the kings in Europe. We shall have no more\nInquisitors to fear, and we may easily recover Miss Cunegonde.\"\n\nThis speech was agreeable to Cacambo; mankind are so fond of roving, of\nmaking a figure in their own country, and of boasting of what they have\nseen in their travels, that the two happy ones resolved to be no longer\nso, but to ask his Majesty's leave to quit the country.\n\n\"You are foolish,\" said the King. \"I am sensible that my kingdom is but\na small place, but when a person is comfortably settled in any part he\nshould abide there. I have not the right to detain strangers. It is a\ntyranny which neither our manners nor our laws permit. All men are free.\nGo when you wish, but the going will be very difficult. It is impossible\nto ascend that rapid river on which you came as by a miracle, and which\nruns under vaulted rocks. The mountains which surround my kingdom are\nten thousand feet high, and as steep as walls; they are each over ten\nleagues in breadth, and there is no other way to descend them than by\nprecipices. However, since you absolutely wish to depart, I shall give\norders to my engineers to construct a machine that will convey you very\nsafely. When we have conducted you over the mountains no one can\naccompany you further, for my subjects have made a vow never to quit the\nkingdom, and they are too wise to break it. Ask me besides anything that\nyou please.\"\n\n\"We desire nothing of your Majesty,\" says Candide, \"but a few sheep\nladen with provisions, pebbles, and the earth of this country.\"\n\nThe King laughed.\n\n\"I cannot conceive,\" said he, \"what pleasure you Europeans find in our\nyellow clay, but take as much as you like, and great good may it do\nyou.\"\n\nAt once he gave directions that his engineers should construct a machine\nto hoist up these two extraordinary men out of the kingdom. Three\nthousand good mathematicians went to work; it was ready in fifteen days,\nand did not cost more than twenty million sterling in the specie of that\ncountry. They placed Candide and Cacambo on the machine. There were two\ngreat red sheep saddled and bridled to ride upon as soon as they were\nbeyond the mountains, twenty pack-sheep laden with provisions, thirty\nwith presents of the curiosities of the country, and fifty with gold,\ndiamonds, and precious stones. The King embraced the two wanderers very\ntenderly.\n\nTheir departure, with the ingenious manner in which they and their sheep\nwere hoisted over the mountains, was a splendid spectacle. The\nmathematicians took their leave after conveying them to a place of\nsafety, and Candide had no other desire, no other aim, than to present\nhis sheep to Miss Cunegonde.\n\n\"Now,\" said he, \"we are able to pay the Governor of Buenos Ayres if Miss\nCunegonde can be ransomed. Let us journey towards Cayenne. Let us\nembark, and we will afterwards see what kingdom we shall be able to\npurchase.\"\n\n\n\n\nXIX\n\nWHAT HAPPENED TO THEM AT SURINAM AND HOW CANDIDE GOT ACQUAINTED WITH\nMARTIN.\n\n\nOur travellers spent the first day very agreeably. They were delighted\nwith possessing more treasure than all Asia, Europe, and Africa could\nscrape together. Candide, in his raptures, cut Cunegonde's name on the\ntrees. The second day two of their sheep plunged into a morass, where\nthey and their burdens were lost; two more died of fatigue a few days\nafter; seven or eight perished with hunger in a desert; and others\nsubsequently fell down precipices. At length, after travelling a hundred\ndays, only two sheep remained. Said Candide to Cacambo:\n\n\"My friend, you see how perishable are the riches of this world; there\nis nothing solid but virtue, and the happiness of seeing Cunegonde once\nmore.\"\n\n\"I grant all you say,\" said Cacambo, \"but we have still two sheep\nremaining, with more treasure than the King of Spain will ever have; and\nI see a town which I take to be Surinam, belonging to the Dutch. We are\nat the end of all our troubles, and at the beginning of happiness.\"\n\nAs they drew near the town, they saw a negro stretched upon the ground,\nwith only one moiety of his clothes, that is, of his blue linen drawers;\nthe poor man had lost his left leg and his right hand.\n\n\"Good God!\" said Candide in Dutch, \"what art thou doing there, friend,\nin that shocking condition?\"\n\n\"I am waiting for my master, Mynheer Vanderdendur, the famous merchant,\"\nanswered the negro.\n\n\"Was it Mynheer Vanderdendur,\" said Candide, \"that treated thee thus?\"\n\n\"Yes, sir,\" said the negro, \"it is the custom. They give us a pair of\nlinen drawers for our whole garment twice a year. When we work at the\nsugar-canes, and the mill snatches hold of a finger, they cut off the\nhand; and when we attempt to run away, they cut off the leg; both cases\nhave happened to me. This is the price at which you eat sugar in Europe.\nYet when my mother sold me for ten patagons[20] on the coast of Guinea,\nshe said to me: 'My dear child, bless our fetiches, adore them for ever;\nthey will make thee live happily; thou hast the honour of being the\nslave of our lords, the whites, which is making the fortune of thy\nfather and mother.' Alas! I know not whether I have made their fortunes;\nthis I know, that they have not made mine. Dogs, monkeys, and parrots\nare a thousand times less wretched than I. The Dutch fetiches, who have\nconverted me, declare every Sunday that we are all of us children of\nAdam--blacks as well as whites. I am not a genealogist, but if these\npreachers tell truth, we are all second cousins. Now, you must agree,\nthat it is impossible to treat one's relations in a more barbarous\nmanner.\"\n\n\"Oh, Pangloss!\" cried Candide, \"thou hadst not guessed at this\nabomination; it is the end. I must at last renounce thy optimism.\"\n\n\"What is this optimism?\" said Cacambo.\n\n\"Alas!\" said Candide, \"it is the madness of maintaining that everything\nis right when it is wrong.\"\n\nLooking at the negro, he shed tears, and weeping, he entered Surinam.\n\nThe first thing they inquired after was whether there was a vessel in\nthe harbour which could be sent to Buenos Ayres. The person to whom they\napplied was a Spanish sea-captain, who offered to agree with them upon\nreasonable terms. He appointed to meet them at a public-house, whither\nCandide and the faithful Cacambo went with their two sheep, and awaited\nhis coming.\n\nCandide, who had his heart upon his lips, told the Spaniard all his\nadventures, and avowed that he intended to elope with Miss Cunegonde.\n\n\"Then I will take good care not to carry you to Buenos Ayres,\" said the\nseaman. \"I should be hanged, and so would you. The fair Cunegonde is my\nlord's favourite mistress.\"\n\nThis was a thunderclap for Candide: he wept for a long while. At last he\ndrew Cacambo aside.\n\n\"Here, my dear friend,\" said he to him, \"this thou must do. We have,\neach of us in his pocket, five or six millions in diamonds; you are more\nclever than I; you must go and bring Miss Cunegonde from Buenos Ayres.\nIf the Governor makes any difficulty, give him a million; if he will not\nrelinquish her, give him two; as you have not killed an Inquisitor, they\nwill have no suspicion of you; I'll get another ship, and go and wait\nfor you at Venice; that's a free country, where there is no danger\neither from Bulgarians, Abares, Jews, or Inquisitors.\"\n\nCacambo applauded this wise resolution. He despaired at parting from so\ngood a master, who had become his intimate friend; but the pleasure of\nserving him prevailed over the pain of leaving him. They embraced with\ntears; Candide charged him not to forget the good old woman. Cacambo\nset out that very same day. This Cacambo was a very honest fellow.\n\nCandide stayed some time longer in Surinam, waiting for another captain\nto carry him and the two remaining sheep to Italy. After he had hired\ndomestics, and purchased everything necessary for a long voyage, Mynheer\nVanderdendur, captain of a large vessel, came and offered his services.\n\n\"How much will you charge,\" said he to this man, \"to carry me straight\nto Venice--me, my servants, my baggage, and these two sheep?\"\n\nThe skipper asked ten thousand piastres. Candide did not hesitate.\n\n\"Oh! oh!\" said the prudent Vanderdendur to himself, \"this stranger gives\nten thousand piastres unhesitatingly! He must be very rich.\"\n\nReturning a little while after, he let him know that upon second\nconsideration, he could not undertake the voyage for less than twenty\nthousand piastres.\n\n\"Well, you shall have them,\" said Candide.\n\n\"Ay!\" said the skipper to himself, \"this man agrees to pay twenty\nthousand piastres with as much ease as ten.\"\n\nHe went back to him again, and declared that he could not carry him to\nVenice for less than thirty thousand piastres.\n\n\"Then you shall have thirty thousand,\" replied Candide.\n\n\"Oh! oh!\" said the Dutch skipper once more to himself, \"thirty thousand\npiastres are a trifle to this man; surely these sheep must be laden with\nan immense treasure; let us say no more about it. First of all, let him\npay down the thirty thousand piastres; then we shall see.\"\n\nCandide sold two small diamonds, the least of which was worth more than\nwhat the skipper asked for his freight. He paid him in advance. The two\nsheep were put on board. Candide followed in a little boat to join the\nvessel in the roads. The skipper seized his opportunity, set sail, and\nput out to sea, the wind favouring him. Candide, dismayed and stupefied,\nsoon lost sight of the vessel.\n\n\"Alas!\" said he, \"this is a trick worthy of the old world!\"\n\nHe put back, overwhelmed with sorrow, for indeed he had lost sufficient\nto make the fortune of twenty monarchs. He waited upon the Dutch\nmagistrate, and in his distress he knocked over loudly at the door. He\nentered and told his adventure, raising his voice with unnecessary\nvehemence. The magistrate began by fining him ten thousand piastres for\nmaking a noise; then he listened patiently, promised to examine into his\naffair at the skipper's return, and ordered him to pay ten thousand\npiastres for the expense of the hearing.\n\nThis drove Candide to despair; he had, indeed, endured misfortunes a\nthousand times worse; the coolness of the magistrate and of the skipper\nwho had robbed him, roused his choler and flung him into a deep\nmelancholy. The villainy of mankind presented itself before his\nimagination in all its deformity, and his mind was filled with gloomy\nideas. At length hearing that a French vessel was ready to set sail for\nBordeaux, as he had no sheep laden with diamonds to take along with him\nhe hired a cabin at the usual price. He made it known in the town that\nhe would pay the passage and board and give two thousand piastres to any\nhonest man who would make the voyage with him, upon condition that this\nman was the most dissatisfied with his state, and the most unfortunate\nin the whole province.\n\nSuch a crowd of candidates presented themselves that a fleet of ships\ncould hardly have held them. Candide being desirous of selecting from\namong the best, marked out about one-twentieth of them who seemed to be\nsociable men, and who all pretended to merit his preference. He\nassembled them at his inn, and gave them a supper on condition that each\ntook an oath to relate his history faithfully, promising to choose him\nwho appeared to be most justly discontented with his state, and to\nbestow some presents upon the rest.\n\nThey sat until four o'clock in the morning. Candide, in listening to all\ntheir adventures, was reminded of what the old woman had said to him in\ntheir voyage to Buenos Ayres, and of her wager that there was not a\nperson on board the ship but had met with very great misfortunes. He\ndreamed of Pangloss at every adventure told to him.\n\n\"This Pangloss,\" said he, \"would be puzzled to demonstrate his system. I\nwish that he were here. Certainly, if all things are good, it is in El\nDorado and not in the rest of the world.\"\n\nAt length he made choice of a poor man of letters, who had worked ten\nyears for the booksellers of Amsterdam. He judged that there was not in\nthe whole world a trade which could disgust one more.\n\nThis philosopher was an honest man; but he had been robbed by his wife,\nbeaten by his son, and abandoned by his daughter who got a Portuguese to\nrun away with her. He had just been deprived of a small employment, on\nwhich he subsisted; and he was persecuted by the preachers of Surinam,\nwho took him for a Socinian. We must allow that the others were at least\nas wretched as he; but Candide hoped that the philosopher would\nentertain him during the voyage. All the other candidates complained\nthat Candide had done them great injustice; but he appeased them by\ngiving one hundred piastres to each.\n\n\n\n\nXX\n\nWHAT HAPPENED AT SEA TO CANDIDE AND MARTIN.\n\n\nThe old philosopher, whose name was Martin, embarked then with Candide\nfor Bordeaux. They had both seen and suffered a great deal; and if the\nvessel had sailed from Surinam to Japan, by the Cape of Good Hope, the\nsubject of moral and natural evil would have enabled them to entertain\none another during the whole voyage.\n\nCandide, however, had one great advantage over Martin, in that he always\nhoped to see Miss Cunegonde; whereas Martin had nothing at all to hope.\nBesides, Candide was possessed of money and jewels, and though he had\nlost one hundred large red sheep, laden with the greatest treasure upon\nearth; though the knavery of the Dutch skipper still sat heavy upon his\nmind; yet when he reflected upon what he had still left, and when he\nmentioned the name of Cunegonde, especially towards the latter end of a\nrepast, he inclined to Pangloss's doctrine.\n\n\"But you, Mr. Martin,\" said he to the philosopher, \"what do you think\nof all this? what are your ideas on moral and natural evil?\"\n\n\"Sir,\" answered Martin, \"our priests accused me of being a Socinian, but\nthe real fact is I am a Manichean.\"[21]\n\n\"You jest,\" said Candide; \"there are no longer Manicheans in the world.\"\n\n\"I am one,\" said Martin. \"I cannot help it; I know not how to think\notherwise.\"\n\n\"Surely you must be possessed by the devil,\" said Candide.\n\n\"He is so deeply concerned in the affairs of this world,\" answered\nMartin, \"that he may very well be in me, as well as in everybody else;\nbut I own to you that when I cast an eye on this globe, or rather on\nthis little ball, I cannot help thinking that God has abandoned it to\nsome malignant being. I except, always, El Dorado. I scarcely ever knew\na city that did not desire the destruction of a neighbouring city, nor a\nfamily that did not wish to exterminate some other family. Everywhere\nthe weak execrate the powerful, before whom they cringe; and the\npowerful beat them like sheep whose wool and flesh they sell. A million\nregimented assassins, from one extremity of Europe to the other, get\ntheir bread by disciplined depredation and murder, for want of more\nhonest employment. Even in those cities which seem to enjoy peace, and\nwhere the arts flourish, the inhabitants are devoured by more envy,\ncare, and uneasiness than are experienced by a besieged town. Secret\ngriefs are more cruel than public calamities. In a word I have seen so\nmuch, and experienced so much that I am a Manichean.\"\n\n\"There are, however, some things good,\" said Candide.\n\n\"That may be,\" said Martin; \"but I know them not.\"\n\nIn the middle of this dispute they heard the report of cannon; it\nredoubled every instant. Each took out his glass. They saw two ships in\nclose fight about three miles off. The wind brought both so near to the\nFrench vessel that our travellers had the pleasure of seeing the fight\nat their ease. At length one let off a broadside, so low and so truly\naimed, that the other sank to the bottom. Candide and Martin could\nplainly perceive a hundred men on the deck of the sinking vessel; they\nraised their hands to heaven and uttered terrible outcries, and the next\nmoment were swallowed up by the sea.\n\n\"Well,\" said Martin, \"this is how men treat one another.\"\n\n\"It is true,\" said Candide; \"there is something diabolical in this\naffair.\"\n\nWhile speaking, he saw he knew not what, of a shining red, swimming\nclose to the vessel. They put out the long-boat to see what it could\nbe: it was one of his sheep! Candide was more rejoiced at the recovery\nof this one sheep than he had been grieved at the loss of the hundred\nladen with the large diamonds of El Dorado.\n\nThe French captain soon saw that the captain of the victorious vessel\nwas a Spaniard, and that the other was a Dutch pirate, and the very same\none who had robbed Candide. The immense plunder which this villain had\namassed, was buried with him in the sea, and out of the whole only one\nsheep was saved.\n\n\"You see,\" said Candide to Martin, \"that crime is sometimes punished.\nThis rogue of a Dutch skipper has met with the fate he deserved.\"\n\n\"Yes,\" said Martin; \"but why should the passengers be doomed also to\ndestruction? God has punished the knave, and the devil has drowned the\nrest.\"\n\nThe French and Spanish ships continued their course, and Candide\ncontinued his conversation with Martin. They disputed fifteen successive\ndays, and on the last of those fifteen days, they were as far advanced\nas on the first. But, however, they chatted, they communicated ideas,\nthey consoled each other. Candide caressed his sheep.\n\n\"Since I have found thee again,\" said he, \"I may likewise chance to find\nmy Cunegonde.\"\n\n\n\n\nXXI\n\nCANDIDE AND MARTIN, REASONING, DRAW NEAR THE COAST OF FRANCE.\n\n\nAt length they descried the coast of France.\n\n\"Were you ever in France, Mr. Martin?\" said Candide.\n\n\"Yes,\" said Martin, \"I have been in several provinces. In some one-half\nof the people are fools, in others they are too cunning; in some they\nare weak and simple, in others they affect to be witty; in all, the\nprincipal occupation is love, the next is slander, and the third is\ntalking nonsense.\"\n\n\"But, Mr. Martin, have you seen Paris?\"\n\n\"Yes, I have. All these kinds are found there. It is a chaos--a confused\nmultitude, where everybody seeks pleasure and scarcely any one finds it,\nat least as it appeared to me. I made a short stay there. On my arrival\nI was robbed of all I had by pickpockets at the fair of St. Germain. I\nmyself was taken for a robber and was imprisoned for eight days, after\nwhich I served as corrector of the press to gain the money necessary for\nmy return to Holland on foot. I knew the whole scribbling rabble, the\nparty rabble, the fanatic rabble. It is said that there are very polite\npeople in that city, and I wish to believe it.\"\n\n\"For my part, I have no curiosity to see France,\" said Candide. \"You may\neasily imagine that after spending a month at El Dorado I can desire to\nbehold nothing upon earth but Miss Cunegonde. I go to await her at\nVenice. We shall pass through France on our way to Italy. Will you bear\nme company?\"\n\n\"With all my heart,\" said Martin. \"It is said that Venice is fit only\nfor its own nobility, but that strangers meet with a very good reception\nif they have a good deal of money. I have none of it; you have,\ntherefore I will follow you all over the world.\"\n\n\"But do you believe,\" said Candide, \"that the earth was originally a\nsea, as we find it asserted in that large book belonging to the\ncaptain?\"\n\n\"I do not believe a word of it,\" said Martin, \"any more than I do of the\nmany ravings which have been published lately.\"\n\n\"But for what end, then, has this world been formed?\" said Candide.\n\n\"To plague us to death,\" answered Martin.\n\n\"Are you not greatly surprised,\" continued Candide, \"at the love which\nthese two girls of the Oreillons had for those monkeys, of which I have\nalready told you?\"\n\n\"Not at all,\" said Martin. \"I do not see that that passion was strange.\nI have seen so many extraordinary things that I have ceased to be\nsurprised.\"\n\n\"Do you believe,\" said Candide, \"that men have always massacred each\nother as they do to-day, that they have always been liars, cheats,\ntraitors, ingrates, brigands, idiots, thieves, scoundrels, gluttons,\ndrunkards, misers, envious, ambitious, bloody-minded, calumniators,\ndebauchees, fanatics, hypocrites, and fools?\"\n\n\"Do you believe,\" said Martin, \"that hawks have always eaten pigeons\nwhen they have found them?\"\n\n\"Yes, without doubt,\" said Candide.\n\n\"Well, then,\" said Martin, \"if hawks have always had the same character\nwhy should you imagine that men may have changed theirs?\"\n\n\"Oh!\" said Candide, \"there is a vast deal of difference, for free\nwill----\"\n\nAnd reasoning thus they arrived at Bordeaux.\n\n\n\n\nXXII\n\nWHAT HAPPENED IN FRANCE TO CANDIDE AND MARTIN.\n\n\nCandide stayed in Bordeaux no longer than was necessary for the selling\nof a few of the pebbles of El Dorado, and for hiring a good chaise to\nhold two passengers; for he could not travel without his Philosopher\nMartin. He was only vexed at parting with his sheep, which he left to\nthe Bordeaux Academy of Sciences, who set as a subject for that year's\nprize, \"to find why this sheep's wool was red;\" and the prize was\nawarded to a learned man of the North, who demonstrated by A plus B\nminus C divided by Z, that the sheep must be red, and die of the rot.\n\nMeanwhile, all the travellers whom Candide met in the inns along his\nroute, said to him, \"We go to Paris.\" This general eagerness at length\ngave him, too, a desire to see this capital; and it was not so very\ngreat a _detour_ from the road to Venice.\n\nHe entered Paris by the suburb of St. Marceau, and fancied that he was\nin the dirtiest village of Westphalia.\n\nScarcely was Candide arrived at his inn, than he found himself attacked\nby a slight illness, caused by fatigue. As he had a very large diamond\non his finger, and the people of the inn had taken notice of a\nprodigiously heavy box among his baggage, there were two physicians to\nattend him, though he had never sent for them, and two devotees who\nwarmed his broths.\n\n\"I remember,\" Martin said, \"also to have been sick at Paris in my first\nvoyage; I was very poor, thus I had neither friends, devotees, nor\ndoctors, and I recovered.\"\n\nHowever, what with physic and bleeding, Candide's illness became\nserious. A parson of the neighborhood came with great meekness to ask\nfor a bill for the other world payable to the bearer. Candide would do\nnothing for him; but the devotees assured him it was the new fashion. He\nanswered that he was not a man of fashion. Martin wished to throw the\npriest out of the window. The priest swore that they would not bury\nCandide. Martin swore that he would bury the priest if he continued to\nbe troublesome. The quarrel grew heated. Martin took him by the\nshoulders and roughly turned him out of doors; which occasioned great\nscandal and a law-suit.\n\nCandide got well again, and during his convalescence he had very good\ncompany to sup with him. They played high. Candide wondered why it was\nthat the ace never came to him; but Martin was not at all astonished.\n\nAmong those who did him the honours of the town was a little Abbe of\nPerigord, one of those busybodies who are ever alert, officious,\nforward, fawning, and complaisant; who watch for strangers in their\npassage through the capital, tell them the scandalous history of the\ntown, and offer them pleasure at all prices. He first took Candide and\nMartin to La Comedie, where they played a new tragedy. Candide happened\nto be seated near some of the fashionable wits. This did not prevent his\nshedding tears at the well-acted scenes. One of these critics at his\nside said to him between the acts:\n\n\"Your tears are misplaced; that is a shocking actress; the actor who\nplays with her is yet worse; and the play is still worse than the\nactors. The author does not know a word of Arabic, yet the scene is in\nArabia; moreover he is a man that does not believe in innate ideas; and\nI will bring you, to-morrow, twenty pamphlets written against him.\"[22]\n\n\"How many dramas have you in France, sir?\" said Candide to the Abbe.\n\n\"Five or six thousand.\"\n\n\"What a number!\" said Candide. \"How many good?\"\n\n\"Fifteen or sixteen,\" replied the other.\n\n\"What a number!\" said Martin.\n\nCandide was very pleased with an actress who played Queen Elizabeth in a\nsomewhat insipid tragedy[23] sometimes acted.\n\n\"That actress,\" said he to Martin, \"pleases me much; she has a likeness\nto Miss Cunegonde; I should be very glad to wait upon her.\"\n\nThe Perigordian Abbe offered to introduce him. Candide, brought up in\nGermany, asked what was the etiquette, and how they treated queens of\nEngland in France.\n\n\"It is necessary to make distinctions,\" said the Abbe. \"In the provinces\none takes them to the inn; in Paris, one respects them when they are\nbeautiful, and throws them on the highway when they are dead.\"[24]\n\n\"Queens on the highway!\" said Candide.\n\n\"Yes, truly,\" said Martin, \"the Abbe is right. I was in Paris when Miss\nMonime passed, as the saying is, from this life to the other. She was\nrefused what people call the _honours of sepulture_--that is to say, of\nrotting with all the beggars of the neighbourhood in an ugly cemetery;\nshe was interred all alone by her company at the corner of the Rue de\nBourgogne, which ought to trouble her much, for she thought nobly.\"\n\n\"That was very uncivil,\" said Candide.\n\n\"What would you have?\" said Martin; \"these people are made thus. Imagine\nall contradictions, all possible incompatibilities--you will find them\nin the government, in the law-courts, in the churches, in the public\nshows of this droll nation.\"\n\n\"Is it true that they always laugh in Paris?\" said Candide.\n\n\"Yes,\" said the Abbe, \"but it means nothing, for they complain of\neverything with great fits of laughter; they even do the most detestable\nthings while laughing.\"\n\n\"Who,\" said Candide, \"is that great pig who spoke so ill of the piece at\nwhich I wept, and of the actors who gave me so much pleasure?\"\n\n\"He is a bad character,\" answered the Abbe, \"who gains his livelihood by\nsaying evil of all plays and of all books. He hates whatever succeeds,\nas the eunuchs hate those who enjoy; he is one of the serpents of\nliterature who nourish themselves on dirt and spite; he is a\n_folliculaire_.\"\n\n\"What is a _folliculaire_?\" said Candide.\n\n\"It is,\" said the Abbe, \"a pamphleteer--a Freron.\"[25]\n\nThus Candide, Martin, and the Perigordian conversed on the staircase,\nwhile watching every one go out after the performance.\n\n\"Although I am eager to see Cunegonde again,\" said Candide, \"I should\nlike to sup with Miss Clairon, for she appears to me admirable.\"\n\nThe Abbe was not the man to approach Miss Clairon, who saw only good\ncompany.\n\n\"She is engaged for this evening,\" he said, \"but I shall have the honour\nto take you to the house of a lady of quality, and there you will know\nParis as if you had lived in it for years.\"\n\nCandide, who was naturally curious, let himself be taken to this lady's\nhouse, at the end of the Faubourg St. Honore. The company was occupied\nin playing faro; a dozen melancholy punters held each in his hand a\nlittle pack of cards; a bad record of his misfortunes. Profound silence\nreigned; pallor was on the faces of the punters, anxiety on that of the\nbanker, and the hostess, sitting near the unpitying banker, noticed with\nlynx-eyes all the doubled and other increased stakes, as each player\ndog's-eared his cards; she made them turn down the edges again with\nsevere, but polite attention; she showed no vexation for fear of losing\nher customers. The lady insisted upon being called the Marchioness of\nParolignac. Her daughter, aged fifteen, was among the punters, and\nnotified with a covert glance the cheatings of the poor people who\ntried to repair the cruelties of fate. The Perigordian Abbe, Candide and\nMartin entered; no one rose, no one saluted them, no one looked at them;\nall were profoundly occupied with their cards.\n\n\"The Baroness of Thunder-ten-Tronckh was more polite,\" said Candide.\n\nHowever, the Abbe whispered to the Marchioness, who half rose, honoured\nCandide with a gracious smile, and Martin with a condescending nod; she\ngave a seat and a pack of cards to Candide, who lost fifty thousand\nfrancs in two deals, after which they supped very gaily, and every one\nwas astonished that Candide was not moved by his loss; the servants said\namong themselves, in the language of servants:--\n\n\"Some English lord is here this evening.\"\n\nThe supper passed at first like most Parisian suppers, in silence,\nfollowed by a noise of words which could not be distinguished, then with\npleasantries of which most were insipid, with false news, with bad\nreasoning, a little politics, and much evil speaking; they also\ndiscussed new books.\n\n\"Have you seen,\" said the Perigordian Abbe, \"the romance of Sieur\nGauchat, doctor of divinity?\"[26]\n\n\"Yes,\" answered one of the guests, \"but I have not been able to finish\nit. We have a crowd of silly writings, but all together do not approach\nthe impertinence of 'Gauchat, Doctor of Divinity.' I am so satiated with\nthe great number of detestable books with which we are inundated that I\nam reduced to punting at faro.\"\n\n\"And the _Melanges_ of Archdeacon Trublet,[27] what do you say of that?\"\nsaid the Abbe.\n\n\"Ah!\" said the Marchioness of Parolignac, \"the wearisome mortal! How\ncuriously he repeats to you all that the world knows! How heavily he\ndiscusses that which is not worth the trouble of lightly remarking upon!\nHow, without wit, he appropriates the wit of others! How he spoils what\nhe steals! How he disgusts me! But he will disgust me no longer--it is\nenough to have read a few of the Archdeacon's pages.\"\n\nThere was at table a wise man of taste, who supported the Marchioness.\nThey spoke afterwards of tragedies; the lady asked why there were\ntragedies which were sometimes played and which could not be read. The\nman of taste explained very well how a piece could have some interest,\nand have almost no merit; he proved in few words that it was not enough\nto introduce one or two of those situations which one finds in all\nromances, and which always seduce the spectator, but that it was\nnecessary to be new without being odd, often sublime and always\nnatural, to know the human heart and to make it speak; to be a great\npoet without allowing any person in the piece to appear to be a poet; to\nknow language perfectly--to speak it with purity, with continuous\nharmony and without rhythm ever taking anything from sense.\n\n\"Whoever,\" added he, \"does not observe all these rules can produce one\nor two tragedies, applauded at a theatre, but he will never be counted\nin the ranks of good writers. There are very few good tragedies; some\nare idylls in dialogue, well written and well rhymed, others political\nreasonings which lull to sleep, or amplifications which repel; others\ndemoniac dreams in barbarous style, interrupted in sequence, with long\napostrophes to the gods, because they do not know how to speak to men,\nwith false maxims, with bombastic commonplaces!\"\n\nCandide listened with attention to this discourse, and conceived a great\nidea of the speaker, and as the Marchioness had taken care to place him\nbeside her, he leaned towards her and took the liberty of asking who was\nthe man who had spoken so well.\n\n\"He is a scholar,\" said the lady, \"who does not play, whom the Abbe\nsometimes brings to supper; he is perfectly at home among tragedies and\nbooks, and he has written a tragedy which was hissed, and a book of\nwhich nothing has ever been seen outside his bookseller's shop\nexcepting the copy which he dedicated to me.\"\n\n\"The great man!\" said Candide. \"He is another Pangloss!\"\n\nThen, turning towards him, he said:\n\n\"Sir, you think doubtless that all is for the best in the moral and\nphysical world, and that nothing could be otherwise than it is?\"\n\n\"I, sir!\" answered the scholar, \"I know nothing of all that; I find that\nall goes awry with me; that no one knows either what is his rank, nor\nwhat is his condition, what he does nor what he ought to do; and that\nexcept supper, which is always gay, and where there appears to be enough\nconcord, all the rest of the time is passed in impertinent quarrels;\nJansenist against Molinist, Parliament against the Church, men of\nletters against men of letters, courtesans against courtesans,\nfinanciers against the people, wives against husbands, relatives against\nrelatives--it is eternal war.\"\n\n\"I have seen the worst,\" Candide replied. \"But a wise man, who since has\nhad the misfortune to be hanged, taught me that all is marvellously\nwell; these are but the shadows on a beautiful picture.\"\n\n\"Your hanged man mocked the world,\" said Martin. \"The shadows are\nhorrible blots.\"\n\n\"They are men who make the blots,\" said Candide, \"and they cannot be\ndispensed with.\"\n\n\"It is not their fault then,\" said Martin.\n\nMost of the punters, who understood nothing of this language, drank, and\nMartin reasoned with the scholar, and Candide related some of his\nadventures to his hostess.\n\nAfter supper the Marchioness took Candide into her boudoir, and made him\nsit upon a sofa.\n\n\"Ah, well!\" said she to him, \"you love desperately Miss Cunegonde of\nThunder-ten-Tronckh?\"\n\n\"Yes, madame,\" answered Candide.\n\nThe Marchioness replied to him with a tender smile:\n\n\"You answer me like a young man from Westphalia. A Frenchman would have\nsaid, 'It is true that I have loved Miss Cunegonde, but seeing you,\nmadame, I think I no longer love her.'\"\n\n\"Alas! madame,\" said Candide, \"I will answer you as you wish.\"\n\n\"Your passion for her,\" said the Marchioness, \"commenced by picking up\nher handkerchief. I wish that you would pick up my garter.\"\n\n\"With all my heart,\" said Candide. And he picked it up.\n\n\"But I wish that you would put it on,\" said the lady.\n\nAnd Candide put it on.\n\n\"You see,\" said she, \"you are a foreigner. I sometimes make my Parisian\nlovers languish for fifteen days, but I give myself to you the first\nnight because one must do the honours of one's country to a young man\nfrom Westphalia.\"\n\nThe lady having perceived two enormous diamonds upon the hands of the\nyoung foreigner praised them with such good faith that from Candide's\nfingers they passed to her own.\n\nCandide, returning with the Perigordian Abbe, felt some remorse in\nhaving been unfaithful to Miss Cunegonde. The Abbe sympathised in his\ntrouble; he had had but a light part of the fifty thousand francs lost\nat play and of the value of the two brilliants, half given, half\nextorted. His design was to profit as much as he could by the advantages\nwhich the acquaintance of Candide could procure for him. He spoke much\nof Cunegonde, and Candide told him that he should ask forgiveness of\nthat beautiful one for his infidelity when he should see her in Venice.\n\nThe Abbe redoubled his politeness and attentions, and took a tender\ninterest in all that Candide said, in all that he did, in all that he\nwished to do.\n\n\"And so, sir, you have a rendezvous at Venice?\"\n\n\"Yes, monsieur Abbe,\" answered Candide. \"It is absolutely necessary\nthat I go to meet Miss Cunegonde.\"\n\nAnd then the pleasure of talking of that which he loved induced him to\nrelate, according to his custom, part of his adventures with the fair\nWestphalian.\n\n\"I believe,\" said the Abbe, \"that Miss Cunegonde has a great deal of\nwit, and that she writes charming letters?\"\n\n\"I have never received any from her,\" said Candide, \"for being expelled\nfrom the castle on her account I had not an opportunity for writing to\nher. Soon after that I heard she was dead; then I found her alive; then\nI lost her again; and last of all, I sent an express to her two thousand\nfive hundred leagues from here, and I wait for an answer.\"\n\nThe Abbe listened attentively, and seemed to be in a brown study. He\nsoon took his leave of the two foreigners after a most tender embrace.\nThe following day Candide received, on awaking, a letter couched in\nthese terms:\n\n\"My very dear love, for eight days I have been ill in this town. I learn\nthat you are here. I would fly to your arms if I could but move. I was\ninformed of your passage at Bordeaux, where I left faithful Cacambo and\nthe old woman, who are to follow me very soon. The Governor of Buenos\nAyres has taken all, but there remains to me your heart. Come! your\npresence will either give me life or kill me with pleasure.\"\n\nThis charming, this unhoped-for letter transported Candide with an\ninexpressible joy, and the illness of his dear Cunegonde overwhelmed him\nwith grief. Divided between those two passions, he took his gold and his\ndiamonds and hurried away, with Martin, to the hotel where Miss\nCunegonde was lodged. He entered her room trembling, his heart\npalpitating, his voice sobbing; he wished to open the curtains of the\nbed, and asked for a light.\n\n\"Take care what you do,\" said the servant-maid; \"the light hurts her,\"\nand immediately she drew the curtain again.\n\n\"My dear Cunegonde,\" said Candide, weeping, \"how are you? If you cannot\nsee me, at least speak to me.\"\n\n\"She cannot speak,\" said the maid.\n\nThe lady then put a plump hand out from the bed, and Candide bathed it\nwith his tears and afterwards filled it with diamonds, leaving a bag of\ngold upon the easy chair.\n\nIn the midst of these transports in came an officer, followed by the\nAbbe and a file of soldiers.\n\n\"There,\" said he, \"are the two suspected foreigners,\" and at the same\ntime he ordered them to be seized and carried to prison.\n\n\"Travellers are not treated thus in El Dorado,\" said Candide.\n\n\"I am more a Manichean now than ever,\" said Martin.\n\n\"But pray, sir, where are you going to carry us?\" said Candide.\n\n\"To a dungeon,\" answered the officer.\n\nMartin, having recovered himself a little, judged that the lady who\nacted the part of Cunegonde was a cheat, that the Perigordian Abbe was a\nknave who had imposed upon the honest simplicity of Candide, and that\nthe officer was another knave whom they might easily silence.\n\nCandide, advised by Martin and impatient to see the real Cunegonde,\nrather than expose himself before a court of justice, proposed to the\nofficer to give him three small diamonds, each worth about three\nthousand pistoles.\n\n\"Ah, sir,\" said the man with the ivory baton, \"had you committed all the\nimaginable crimes you would be to me the most honest man in the world.\nThree diamonds! Each worth three thousand pistoles! Sir, instead of\ncarrying you to jail I would lose my life to serve you. There are orders\nfor arresting all foreigners, but leave it to me. I have a brother at\nDieppe in Normandy! I'll conduct you thither, and if you have a diamond\nto give him he'll take as much care of you as I would.\"\n\n\"And why,\" said Candide, \"should all foreigners be arrested?\"\n\n\"It is,\" the Perigordian Abbe then made answer, \"because a poor beggar\nof the country of Atrebatie[28] heard some foolish things said. This\ninduced him to commit a parricide, not such as that of 1610 in the month\nof May,[29] but such as that of 1594 in the month of December,[30] and\nsuch as others which have been committed in other years and other months\nby other poor devils who had heard nonsense spoken.\"\n\nThe officer then explained what the Abbe meant.\n\n\"Ah, the monsters!\" cried Candide. \"What horrors among a people who\ndance and sing! Is there no way of getting quickly out of this country\nwhere monkeys provoke tigers? I have seen no bears in my country, but\n_men_ I have beheld nowhere except in El Dorado. In the name of God,\nsir, conduct me to Venice, where I am to await Miss Cunegonde.\"\n\n\"I can conduct you no further than lower Normandy,\" said the officer.\n\nImmediately he ordered his irons to be struck off, acknowledged himself\nmistaken, sent away his men, set out with Candide and Martin for Dieppe,\nand left them in the care of his brother.\n\nThere was then a small Dutch ship in the harbour. The Norman, who by the\nvirtue of three more diamonds had become the most subservient of men,\nput Candide and his attendants on board a vessel that was just ready to\nset sail for Portsmouth in England.\n\nThis was not the way to Venice, but Candide thought he had made his way\nout of hell, and reckoned that he would soon have an opportunity for\nresuming his journey.\n\n\n\n\nXXIII\n\nCANDIDE AND MARTIN TOUCHED UPON THE COAST OF ENGLAND, AND WHAT THEY SAW\nTHERE.\n\n\n\"Ah, Pangloss! Pangloss! Ah, Martin! Martin! Ah, my dear Cunegonde, what\nsort of a world is this?\" said Candide on board the Dutch ship.\n\n\"Something very foolish and abominable,\" said Martin.\n\n\"You know England? Are they as foolish there as in France?\"\n\n\"It is another kind of folly,\" said Martin. \"You know that these two\nnations are at war for a few acres of snow in Canada,[31] and that they\nspend over this beautiful war much more than Canada is worth. To tell\nyou exactly, whether there are more people fit to send to a madhouse in\none country than the other, is what my imperfect intelligence will not\npermit. I only know in general that the people we are going to see are\nvery atrabilious.\"\n\nTalking thus they arrived at Portsmouth. The coast was lined with crowds\nof people, whose eyes were fixed on a fine man kneeling, with his eyes\nbandaged, on board one of the men of war in the harbour. Four soldiers\nstood opposite to this man; each of them fired three balls at his head,\nwith all the calmness in the world; and the whole assembly went away\nvery well satisfied.\n\n\"What is all this?\" said Candide; \"and what demon is it that exercises\nhis empire in this country?\"\n\nHe then asked who was that fine man who had been killed with so much\nceremony. They answered, he was an Admiral.[32]\n\n\"And why kill this Admiral?\"\n\n\"It is because he did not kill a sufficient number of men himself. He\ngave battle to a French Admiral; and it has been proved that he was not\nnear enough to him.\"\n\n\"But,\" replied Candide, \"the French Admiral was as far from the English\nAdmiral.\"\n\n\"There is no doubt of it; but in this country it is found good, from\ntime to time, to kill one Admiral to encourage the others.\"\n\nCandide was so shocked and bewildered by what he saw and heard, that he\nwould not set foot on shore, and he made a bargain with the Dutch\nskipper (were he even to rob him like the Surinam captain) to conduct\nhim without delay to Venice.\n\nThe skipper was ready in two days. They coasted France; they passed in\nsight of Lisbon, and Candide trembled. They passed through the Straits,\nand entered the Mediterranean. At last they landed at Venice.\n\n\"God be praised!\" said Candide, embracing Martin. \"It is here that I\nshall see again my beautiful Cunegonde. I trust Cacambo as myself. All\nis well, all will be well, all goes as well as possible.\"\n\n\n\n\nXXIV\n\nOF PAQUETTE AND FRIAR GIROFLEE.\n\n\nUpon their arrival at Venice, Candide went to search for Cacambo at\nevery inn and coffee-house, and among all the ladies of pleasure, but to\nno purpose. He sent every day to inquire on all the ships that came in.\nBut there was no news of Cacambo.\n\n\"What!\" said he to Martin, \"I have had time to voyage from Surinam to\nBordeaux, to go from Bordeaux to Paris, from Paris to Dieppe, from\nDieppe to Portsmouth, to coast along Portugal and Spain, to cross the\nwhole Mediterranean, to spend some months, and yet the beautiful\nCunegonde has not arrived! Instead of her I have only met a Parisian\nwench and a Perigordian Abbe. Cunegonde is dead without doubt, and there\nis nothing for me but to die. Alas! how much better it would have been\nfor me to have remained in the paradise of El Dorado than to come back\nto this cursed Europe! You are in the right, my dear Martin: all is\nmisery and illusion.\"\n\nHe fell into a deep melancholy, and neither went to see the opera, nor\nany of the other diversions of the Carnival; nay, he was proof against\nthe temptations of all the ladies.\n\n\"You are in truth very simple,\" said Martin to him, \"if you imagine that\na mongrel valet, who has five or six millions in his pocket, will go to\nthe other end of the world to seek your mistress and bring her to you to\nVenice. If he find her, he will keep her to himself; if he do not find\nher he will get another. I advise you to forget your valet Cacambo and\nyour mistress Cunegonde.\"\n\nMartin was not consoling. Candide's melancholy increased; and Martin\ncontinued to prove to him that there was very little virtue or happiness\nupon earth, except perhaps in El Dorado, where nobody could gain\nadmittance.\n\nWhile they were disputing on this important subject and waiting for\nCunegonde, Candide saw a young Theatin friar in St. Mark's Piazza,\nholding a girl on his arm. The Theatin looked fresh coloured, plump, and\nvigorous; his eyes were sparkling, his air assured, his look lofty, and\nhis step bold. The girl was very pretty, and sang; she looked amorously\nat her Theatin, and from time to time pinched his fat cheeks.\n\n\"At least you will allow me,\" said Candide to Martin, \"that these two\nare happy. Hitherto I have met with none but unfortunate people in the\nwhole habitable globe, except in El Dorado; but as to this pair, I would\nventure to lay a wager that they are very happy.\"\n\n\"I lay you they are not,\" said Martin.\n\n\"We need only ask them to dine with us,\" said Candide, \"and you will see\nwhether I am mistaken.\"\n\nImmediately he accosted them, presented his compliments, and invited\nthem to his inn to eat some macaroni, with Lombard partridges, and\ncaviare, and to drink some Montepulciano, Lachrymae Christi, Cyprus and\nSamos wine. The girl blushed, the Theatin accepted the invitation and\nshe followed him, casting her eyes on Candide with confusion and\nsurprise, and dropping a few tears. No sooner had she set foot in\nCandide's apartment than she cried out:\n\n\"Ah! Mr. Candide does not know Paquette again.\"\n\nCandide had not viewed her as yet with attention, his thoughts being\nentirely taken up with Cunegonde; but recollecting her as she spoke.\n\n\"Alas!\" said he, \"my poor child, it is you who reduced Doctor Pangloss\nto the beautiful condition in which I saw him?\"\n\n\"Alas! it was I, sir, indeed,\" answered Paquette. \"I see that you have\nheard all. I have been informed of the frightful disasters that befell\nthe family of my lady Baroness, and the fair Cunegonde. I swear to you\nthat my fate has been scarcely less sad. I was very innocent when you\nknew me. A Grey Friar, who was my confessor, easily seduced me. The\nconsequences were terrible. I was obliged to quit the castle some time\nafter the Baron had sent you away with kicks on the backside. If a\nfamous surgeon had not taken compassion on me, I should have died. For\nsome time I was this surgeon's mistress, merely out of gratitude. His\nwife, who was mad with jealousy, beat me every day unmercifully; she was\na fury. The surgeon was one of the ugliest of men, and I the most\nwretched of women, to be continually beaten for a man I did not love.\nYou know, sir, what a dangerous thing it is for an ill-natured woman to\nbe married to a doctor. Incensed at the behaviour of his wife, he one\nday gave her so effectual a remedy to cure her of a slight cold, that\nshe died two hours after, in most horrid convulsions. The wife's\nrelations prosecuted the husband; he took flight, and I was thrown into\njail. My innocence would not have saved me if I had not been\ngood-looking. The judge set me free, on condition that he succeeded the\nsurgeon. I was soon supplanted by a rival, turned out of doors quite\ndestitute, and obliged to continue this abominable trade, which appears\nso pleasant to you men, while to us women it is the utmost abyss of\nmisery. I have come to exercise the profession at Venice. Ah! sir, if\nyou could only imagine what it is to be obliged to caress indifferently\nan old merchant, a lawyer, a monk, a gondolier, an abbe, to be exposed\nto abuse and insults; to be often reduced to borrowing a petticoat, only\nto go and have it raised by a disagreeable man; to be robbed by one of\nwhat one has earned from another; to be subject to the extortions of the\nofficers of justice; and to have in prospect only a frightful old age, a\nhospital, and a dung-hill; you would conclude that I am one of the most\nunhappy creatures in the world.\"[33]\n\nPaquette thus opened her heart to honest Candide, in the presence of\nMartin, who said to his friend:\n\n\"You see that already I have won half the wager.\"\n\nFriar Giroflee stayed in the dining-room, and drank a glass or two of\nwine while he was waiting for dinner.\n\n\"But,\" said Candide to Paquette, \"you looked so gay and content when I\nmet you; you sang and you behaved so lovingly to the Theatin, that you\nseemed to me as happy as you pretend to be now the reverse.\"\n\n\"Ah! sir,\" answered Paquette, \"this is one of the miseries of the trade.\nYesterday I was robbed and beaten by an officer; yet to-day I must put\non good humour to please a friar.\"\n\nCandide wanted no more convincing; he owned that Martin was in the\nright. They sat down to table with Paquette and the Theatin; the repast\nwas entertaining; and towards the end they conversed with all\nconfidence.\n\n\"Father,\" said Candide to the Friar, \"you appear to me to enjoy a state\nthat all the world might envy; the flower of health shines in your face,\nyour expression makes plain your happiness; you have a very pretty girl\nfor your recreation, and you seem well satisfied with your state as a\nTheatin.\"\n\n\"My faith, sir,\" said Friar Giroflee, \"I wish that all the Theatins were\nat the bottom of the sea. I have been tempted a hundred times to set\nfire to the convent, and go and become a Turk. My parents forced me at\nthe age of fifteen to put on this detestable habit, to increase the\nfortune of a cursed elder brother, whom God confound. Jealousy, discord,\nand fury, dwell in the convent. It is true I have preached a few bad\nsermons that have brought me in a little money, of which the prior stole\nhalf, while the rest serves to maintain my girls; but when I return at\nnight to the monastery, I am ready to dash my head against the walls of\nthe dormitory; and all my fellows are in the same case.\"\n\nMartin turned towards Candide with his usual coolness.\n\n\"Well,\" said he, \"have I not won the whole wager?\"\n\nCandide gave two thousand piastres to Paquette, and one thousand to\nFriar Giroflee.\n\n\"I'll answer for it,\" said he, \"that with this they will be happy.\"\n\n\"I do not believe it at all,\" said Martin; \"you will, perhaps, with\nthese piastres only render them the more unhappy.\"\n\n\"Let that be as it may,\" said Candide, \"but one thing consoles me. I see\nthat we often meet with those whom we expected never to see more; so\nthat, perhaps, as I have found my red sheep and Paquette, it may well be\nthat I shall also find Cunegonde.\"\n\n\"I wish,\" said Martin, \"she may one day make you very happy; but I doubt\nit very much.\"\n\n\"You are very hard of belief,\" said Candide.\n\n\"I have lived,\" said Martin.\n\n\"You see those gondoliers,\" said Candide, \"are they not perpetually\nsinging?\"\n\n\"You do not see them,\" said Martin, \"at home with their wives and brats.\nThe Doge has his troubles, the gondoliers have theirs. It is true that,\nall things considered, the life of a gondolier is preferable to that of\na Doge; but I believe the difference to be so trifling that it is not\nworth the trouble of examining.\"\n\n\"People talk,\" said Candide, \"of the Senator Pococurante, who lives in\nthat fine palace on the Brenta, where he entertains foreigners in the\npolitest manner. They pretend that this man has never felt any\nuneasiness.\"\n\n\"I should be glad to see such a rarity,\" said Martin.\n\nCandide immediately sent to ask the Lord Pococurante permission to wait\nupon him the next day.\n\n\n\n\nXXV\n\nTHE VISIT TO LORD POCOCURANTE, A NOBLE VENETIAN.\n\n\nCandide and Martin went in a gondola on the Brenta, and arrived at the\npalace of the noble Signor Pococurante. The gardens, laid out with\ntaste, were adorned with fine marble statues. The palace was beautifully\nbuilt. The master of the house was a man of sixty, and very rich. He\nreceived the two travellers with polite indifference, which put Candide\na little out of countenance, but was not at all disagreeable to Martin.\n\nFirst, two pretty girls, very neatly dressed, served them with\nchocolate, which was frothed exceedingly well. Candide could not refrain\nfrom commending their beauty, grace, and address.\n\n\"They are good enough creatures,\" said the Senator. \"I make them lie\nwith me sometimes, for I am very tired of the ladies of the town, of\ntheir coquetries, of their jealousies, of their quarrels, of their\nhumours, of their pettinesses, of their prides, of their follies, and of\nthe sonnets which one must make, or have made, for them. But after all,\nthese two girls begin to weary me.\"\n\nAfter breakfast, Candide walking into a long gallery was surprised by\nthe beautiful pictures. He asked, by what master were the two first.\n\n\"They are by Raphael,\" said the Senator. \"I bought them at a great\nprice, out of vanity, some years ago. They are said to be the finest\nthings in Italy, but they do not please me at all. The colours are too\ndark, the figures are not sufficiently rounded, nor in good relief; the\ndraperies in no way resemble stuffs. In a word, whatever may be said, I\ndo not find there a true imitation of nature. I only care for a picture\nwhen I think I see nature itself; and there are none of this sort. I\nhave a great many pictures, but I prize them very little.\"\n\nWhile they were waiting for dinner Pococurante ordered a concert.\nCandide found the music delicious.\n\n\"This noise,\" said the Senator, \"may amuse one for half an hour; but if\nit were to last longer it would grow tiresome to everybody, though they\ndurst not own it. Music, to-day, is only the art of executing difficult\nthings, and that which is only difficult cannot please long. Perhaps I\nshould be fonder of the opera if they had not found the secret of making\nof it a monster which shocks me. Let who will go to see bad tragedies\nset to music, where the scenes are contrived for no other end than to\nintroduce two or three songs ridiculously out of place, to show off an\nactress's voice. Let who will, or who can, die away with pleasure at the\nsight of an eunuch quavering the _role_ of Caesar, or of Cato, and\nstrutting awkwardly upon the stage. For my part I have long since\nrenounced those paltry entertainments which constitute the glory of\nmodern Italy, and are purchased so dearly by sovereigns.\"\n\nCandide disputed the point a little, but with discretion. Martin was\nentirely of the Senator's opinion.\n\nThey sat down to table, and after an excellent dinner they went into the\nlibrary. Candide, seeing a Homer magnificently bound, commended the\nvirtuoso on his good taste.\n\n\"There,\" said he, \"is a book that was once the delight of the great\nPangloss, the best philosopher in Germany.\"\n\n\"It is not mine,\" answered Pococurante coolly. \"They used at one time to\nmake me believe that I took a pleasure in reading him. But that\ncontinual repetition of battles, so extremely like one another; those\ngods that are always active without doing anything decisive; that Helen\nwho is the cause of the war, and who yet scarcely appears in the piece;\nthat Troy, so long besieged without being taken; all these together\ncaused me great weariness. I have sometimes asked learned men whether\nthey were not as weary as I of that work. Those who were sincere have\nowned to me that the poem made them fall asleep; yet it was necessary to\nhave it in their library as a monument of antiquity, or like those rusty\nmedals which are no longer of use in commerce.\"\n\n\"But your Excellency does not think thus of Virgil?\" said Candide.\n\n\"I grant,\" said the Senator, \"that the second, fourth, and sixth books\nof his _AEneid_ are excellent, but as for his pious AEneas, his strong\nCloanthus, his friend Achates, his little Ascanius, his silly King\nLatinus, his bourgeois Amata, his insipid Lavinia, I think there can be\nnothing more flat and disagreeable. I prefer Tasso a good deal, or even\nthe soporific tales of Ariosto.\"\n\n\"May I presume to ask you, sir,\" said Candide, \"whether you do not\nreceive a great deal of pleasure from reading Horace?\"\n\n\"There are maxims in this writer,\" answered Pococurante, \"from which a\nman of the world may reap great benefit, and being written in energetic\nverse they are more easily impressed upon the memory. But I care little\nfor his journey to Brundusium, and his account of a bad dinner, or of\nhis low quarrel between one Rupilius whose words he says were full of\npoisonous filth, and another whose language was imbued with vinegar. I\nhave read with much distaste his indelicate verses against old women and\nwitches; nor do I see any merit in telling his friend Maecenas that if he\nwill but rank him in the choir of lyric poets, his lofty head shall\ntouch the stars. Fools admire everything in an author of reputation. For\nmy part, I read only to please myself. I like only that which serves my\npurpose.\"\n\nCandide, having been educated never to judge for himself, was much\nsurprised at what he heard. Martin found there was a good deal of reason\nin Pococurante's remarks.\n\n\"Oh! here is Cicero,\" said Candide. \"Here is the great man whom I fancy\nyou are never tired of reading.\"\n\n\"I never read him,\" replied the Venetian. \"What is it to me whether he\npleads for Rabirius or Cluentius? I try causes enough myself; his\nphilosophical works seem to me better, but when I found that he doubted\nof everything, I concluded that I knew as much as he, and that I had no\nneed of a guide to learn ignorance.\"\n\n\"Ha! here are four-score volumes of the Academy of Sciences,\" cried\nMartin. \"Perhaps there is something valuable in this collection.\"\n\n\"There might be,\" said Pococurante, \"if only one of those rakers of\nrubbish had shown how to make pins; but in all these volumes there is\nnothing but chimerical systems, and not a single useful thing.\"\n\n\"And what dramatic works I see here,\" said Candide, \"in Italian,\nSpanish, and French.\"\n\n\"Yes,\" replied the Senator, \"there are three thousand, and not three\ndozen of them good for anything. As to those collections of sermons,\nwhich altogether are not worth a single page of Seneca, and those huge\nvolumes of theology, you may well imagine that neither I nor any one\nelse ever opens them.\"\n\nMartin saw some shelves filled with English books.\n\n\"I have a notion,\" said he, \"that a Republican must be greatly pleased\nwith most of these books, which are written with a spirit of freedom.\"\n\n\"Yes,\" answered Pococurante, \"it is noble to write as one thinks; this\nis the privilege of humanity. In all our Italy we write only what we do\nnot think; those who inhabit the country of the Caesars and the\nAntoninuses dare not acquire a single idea without the permission of a\nDominican friar. I should be pleased with the liberty which inspires the\nEnglish genius if passion and party spirit did not corrupt all that is\nestimable in this precious liberty.\"\n\nCandide, observing a Milton, asked whether he did not look upon this\nauthor as a great man.\n\n\"Who?\" said Pococurante, \"that barbarian, who writes a long commentary\nin ten books of harsh verse on the first chapter of Genesis; that coarse\nimitator of the Greeks, who disfigures the Creation, and who, while\nMoses represents the Eternal producing the world by a word, makes the\nMessiah take a great pair of compasses from the armoury of heaven to\ncircumscribe His work? How can I have any esteem for a writer who has\nspoiled Tasso's hell and the devil, who transforms Lucifer sometimes\ninto a toad and other times into a pigmy, who makes him repeat the same\nthings a hundred times, who makes him dispute on theology, who, by a\nserious imitation of Ariosto's comic invention of firearms, represents\nthe devils cannonading in heaven? Neither I nor any man in Italy could\ntake pleasure in those melancholy extravagances; and the marriage of Sin\nand Death, and the snakes brought forth by Sin, are enough to turn the\nstomach of any one with the least taste, [and his long description of a\npest-house is good only for a grave-digger]. This obscure, whimsical,\nand disagreeable poem was despised upon its first publication, and I\nonly treat it now as it was treated in its own country by\ncontemporaries. For the matter of that I say what I think, and I care\nvery little whether others think as I do.\"\n\nCandide was grieved at this speech, for he had a respect for Homer and\nwas fond of Milton.\n\n\"Alas!\" said he softly to Martin, \"I am afraid that this man holds our\nGerman poets in very great contempt.\"\n\n\"There would not be much harm in that,\" said Martin.\n\n\"Oh! what a superior man,\" said Candide below his breath. \"What a great\ngenius is this Pococurante! Nothing can please him.\"\n\nAfter their survey of the library they went down into the garden, where\nCandide praised its several beauties.\n\n\"I know of nothing in so bad a taste,\" said the master. \"All you see\nhere is merely trifling. After to-morrow I will have it planted with a\nnobler design.\"\n\n\"Well,\" said Candide to Martin when they had taken their leave, \"you\nwill agree that this is the happiest of mortals, for he is above\neverything he possesses.\"\n\n\"But do you not see,\" answered Martin, \"that he is disgusted with all he\npossesses? Plato observed a long while ago that those stomachs are not\nthe best that reject all sorts of food.\"\n\n\"But is there not a pleasure,\" said Candide, \"in criticising\neverything, in pointing out faults where others see nothing but\nbeauties?\"\n\n\"That is to say,\" replied Martin, \"that there is some pleasure in having\nno pleasure.\"\n\n\"Well, well,\" said Candide, \"I find that I shall be the only happy man\nwhen I am blessed with the sight of my dear Cunegonde.\"\n\n\"It is always well to hope,\" said Martin.\n\nHowever, the days and the weeks passed. Cacambo did not come, and\nCandide was so overwhelmed with grief that he did not even reflect that\nPaquette and Friar Giroflee did not return to thank him.\n\n\n\n\nXXVI\n\nOF A SUPPER WHICH CANDIDE AND MARTIN TOOK WITH SIX STRANGERS, AND WHO\nTHEY WERE.[34]\n\n\nOne evening that Candide and Martin were going to sit down to supper\nwith some foreigners who lodged in the same inn, a man whose complexion\nwas as black as soot, came behind Candide, and taking him by the arm,\nsaid:\n\n\"Get yourself ready to go along with us; do not fail.\"\n\nUpon this he turned round and saw--Cacambo! Nothing but the sight of\nCunegonde could have astonished and delighted him more. He was on the\npoint of going mad with joy. He embraced his dear friend.\n\n\"Cunegonde is here, without doubt; where is she? Take me to her that I\nmay die of joy in her company.\"\n\n\"Cunegonde is not here,\" said Cacambo, \"she is at Constantinople.\"\n\n\"Oh, heavens! at Constantinople! But were she in China I would fly\nthither; let us be off.\"\n\n\"We shall set out after supper,\" replied Cacambo. \"I can tell you\nnothing more; I am a slave, my master awaits me, I must serve him at\ntable; speak not a word, eat, and then get ready.\"\n\nCandide, distracted between joy and grief, delighted at seeing his\nfaithful agent again, astonished at finding him a slave, filled with the\nfresh hope of recovering his mistress, his heart palpitating, his\nunderstanding confused, sat down to table with Martin, who saw all these\nscenes quite unconcerned, and with six strangers who had come to spend\nthe Carnival at Venice.\n\nCacambo waited at table upon one of the strangers; towards the end of\nthe entertainment he drew near his master, and whispered in his ear:\n\n\"Sire, your Majesty may start when you please, the vessel is ready.\"\n\nOn saying these words he went out. The company in great surprise looked\nat one another without speaking a word, when another domestic approached\nhis master and said to him:\n\n\"Sire, your Majesty's chaise is at Padua, and the boat is ready.\"\n\nThe master gave a nod and the servant went away. The company all stared\nat one another again, and their surprise redoubled. A third valet came\nup to a third stranger, saying:\n\n\"Sire, believe me, your Majesty ought not to stay here any longer. I am\ngoing to get everything ready.\"\n\nAnd immediately he disappeared. Candide and Martin did not doubt that\nthis was a masquerade of the Carnival. Then a fourth domestic said to a\nfourth master:\n\n\"Your Majesty may depart when you please.\"\n\nSaying this he went away like the rest. The fifth valet said the same\nthing to the fifth master. But the sixth valet spoke differently to the\nsixth stranger, who sat near Candide. He said to him:\n\n\"Faith, Sire, they will no longer give credit to your Majesty nor to me,\nand we may perhaps both of us be put in jail this very night. Therefore\nI will take care of myself. Adieu.\"\n\nThe servants being all gone, the six strangers, with Candide and Martin,\nremained in a profound silence. At length Candide broke it.\n\n\"Gentlemen,\" said he, \"this is a very good joke indeed, but why should\nyou all be kings? For me I own that neither Martin nor I is a king.\"\n\nCacambo's master then gravely answered in Italian:\n\n\"I am not at all joking. My name is Achmet III. I was Grand Sultan many\nyears. I dethroned my brother; my nephew dethroned me, my viziers were\nbeheaded, and I am condemned to end my days in the old Seraglio. My\nnephew, the great Sultan Mahmoud, permits me to travel sometimes for my\nhealth, and I am come to spend the Carnival at Venice.\"\n\nA young man who sat next to Achmet, spoke then as follows:\n\n\"My name is Ivan. I was once Emperor of all the Russias, but was\ndethroned in my cradle. My parents were confined in prison and I was\neducated there; yet I am sometimes allowed to travel in company with\npersons who act as guards; and I am come to spend the Carnival at\nVenice.\"\n\nThe third said:\n\n\"I am Charles Edward, King of England; my father has resigned all his\nlegal rights to me. I have fought in defence of them; and above eight\nhundred of my adherents have been hanged, drawn, and quartered. I have\nbeen confined in prison; I am going to Rome, to pay a visit to the King,\nmy father, who was dethroned as well as myself and my grandfather, and I\nam come to spend the Carnival at Venice.\"\n\nThe fourth spoke thus in his turn:\n\n\"I am the King of Poland; the fortune of war has stripped me of my\nhereditary dominions; my father underwent the same vicissitudes; I\nresign myself to Providence in the same manner as Sultan Achmet, the\nEmperor Ivan, and King Charles Edward, whom God long preserve; and I am\ncome to the Carnival at Venice.\"\n\nThe fifth said:\n\n\"I am King of Poland also; I have been twice dethroned; but Providence\nhas given me another country, where I have done more good than all the\nSarmatian kings were ever capable of doing on the banks of the Vistula;\nI resign myself likewise to Providence, and am come to pass the Carnival\nat Venice.\"\n\nIt was now the sixth monarch's turn to speak:\n\n\"Gentlemen,\" said he, \"I am not so great a prince as any of you;\nhowever, I am a king. I am Theodore, elected King of Corsica; I had the\ntitle of Majesty, and now I am scarcely treated as a gentleman. I have\ncoined money, and now am not worth a farthing; I have had two\nsecretaries of state, and now I have scarce a valet; I have seen myself\non a throne, and I have seen myself upon straw in a common jail in\nLondon. I am afraid that I shall meet with the same treatment here\nthough, like your majesties, I am come to see the Carnival at Venice.\"\n\nThe other five kings listened to this speech with generous compassion.\nEach of them gave twenty sequins to King Theodore to buy him clothes and\nlinen; and Candide made him a present of a diamond worth two thousand\nsequins.\n\n\"Who can this private person be,\" said the five kings to one another,\n\"who is able to give, and really has given, a hundred times as much as\nany of us?\"\n\nJust as they rose from table, in came four Serene Highnesses, who had\nalso been stripped of their territories by the fortune of war, and were\ncome to spend the Carnival at Venice. But Candide paid no regard to\nthese newcomers, his thoughts were entirely employed on his voyage to\nConstantinople, in search of his beloved Cunegonde.\n\n\n\n\nXXVII\n\nCANDIDE'S VOYAGE TO CONSTANTINOPLE.\n\n\nThe faithful Cacambo had already prevailed upon the Turkish skipper, who\nwas to conduct the Sultan Achmet to Constantinople, to receive Candide\nand Martin on his ship. They both embarked after having made their\nobeisance to his miserable Highness.\n\n\"You see,\" said Candide to Martin on the way, \"we supped with six\ndethroned kings, and of those six there was one to whom I gave charity.\nPerhaps there are many other princes yet more unfortunate. For my part,\nI have only lost a hundred sheep; and now I am flying into Cunegonde's\narms. My dear Martin, yet once more Pangloss was right: all is for the\nbest.\"\n\n\"I wish it,\" answered Martin.\n\n\"But,\" said Candide, \"it was a very strange adventure we met with at\nVenice. It has never before been seen or heard that six dethroned kings\nhave supped together at a public inn.\"\n\n\"It is not more extraordinary,\" said Martin, \"than most of the things\nthat have happened to us. It is a very common thing for kings to be\ndethroned; and as for the honour we have had of supping in their\ncompany, it is a trifle not worth our attention.\"\n\nNo sooner had Candide got on board the vessel than he flew to his old\nvalet and friend Cacambo, and tenderly embraced him.\n\n\"Well,\" said he, \"what news of Cunegonde? Is she still a prodigy of\nbeauty? Does she love me still? How is she? Thou hast doubtless bought\nher a palace at Constantinople?\"\n\n\"My dear master,\" answered Cacambo, \"Cunegonde washes dishes on the\nbanks of the Propontis, in the service of a prince, who has very few\ndishes to wash; she is a slave in the family of an ancient sovereign\nnamed Ragotsky,[35] to whom the Grand Turk allows three crowns a day in\nhis exile. But what is worse still is, that she has lost her beauty and\nhas become horribly ugly.\"\n\n\"Well, handsome or ugly,\" replied Candide, \"I am a man of honour, and it\nis my duty to love her still. But how came she to be reduced to so\nabject a state with the five or six millions that you took to her?\"\n\n\"Ah!\" said Cacambo, \"was I not to give two millions to Senor Don\nFernando d'Ibaraa, y Figueora, y Mascarenes, y Lampourdos, y Souza,\nGovernor of Buenos Ayres, for permitting Miss Cunegonde to come away?\nAnd did not a corsair bravely rob us of all the rest? Did not this\ncorsair carry us to Cape Matapan, to Milo, to Nicaria, to Samos, to\nPetra, to the Dardanelles, to Marmora, to Scutari? Cunegonde and the old\nwoman serve the prince I now mentioned to you, and I am slave to the\ndethroned Sultan.\"\n\n\"What a series of shocking calamities!\" cried Candide. \"But after all, I\nhave some diamonds left; and I may easily pay Cunegonde's ransom. Yet it\nis a pity that she is grown so ugly.\"\n\nThen, turning towards Martin: \"Who do you think,\" said he, \"is most to\nbe pitied--the Sultan Achmet, the Emperor Ivan, King Charles Edward, or\nI?\"\n\n\"How should I know!\" answered Martin. \"I must see into your hearts to be\nable to tell.\"\n\n\"Ah!\" said Candide, \"if Pangloss were here, he could tell.\"\n\n\"I know not,\" said Martin, \"in what sort of scales your Pangloss would\nweigh the misfortunes of mankind and set a just estimate on their\nsorrows. All that I can presume to say is, that there are millions of\npeople upon earth who have a hundred times more to complain of than King\nCharles Edward, the Emperor Ivan, or the Sultan Achmet.\"\n\n\"That may well be,\" said Candide.\n\nIn a few days they reached the Bosphorus, and Candide began by paying a\nvery high ransom for Cacambo. Then without losing time, he and his\ncompanions went on board a galley, in order to search on the banks of\nthe Propontis for his Cunegonde, however ugly she might have become.\n\nAmong the crew there were two slaves who rowed very badly, and to whose\nbare shoulders the Levantine captain would now and then apply blows from\na bull's pizzle. Candide, from a natural impulse, looked at these two\nslaves more attentively than at the other oarsmen, and approached them\nwith pity. Their features though greatly disfigured, had a slight\nresemblance to those of Pangloss and the unhappy Jesuit and Westphalian\nBaron, brother to Miss Cunegonde. This moved and saddened him. He looked\nat them still more attentively.\n\n\"Indeed,\" said he to Cacambo, \"if I had not seen Master Pangloss hanged,\nand if I had not had the misfortune to kill the Baron, I should think it\nwas they that were rowing.\"\n\nAt the names of the Baron and of Pangloss, the two galley-slaves uttered\na loud cry, held fast by the seat, and let drop their oars. The captain\nran up to them and redoubled his blows with the bull's pizzle.\n\n\"Stop! stop! sir,\" cried Candide. \"I will give you what money you\nplease.\"\n\n\"What! it is Candide!\" said one of the slaves.\n\n\"What! it is Candide!\" said the other.\n\n\"Do I dream?\" cried Candide; \"am I awake? or am I on board a galley? Is\nthis the Baron whom I killed? Is this Master Pangloss whom I saw\nhanged?\"\n\n\"It is we! it is we!\" answered they.\n\n\"Well! is this the great philosopher?\" said Martin.\n\n\"Ah! captain,\" said Candide, \"what ransom will you take for Monsieur de\nThunder-ten-Tronckh, one of the first barons of the empire, and for\nMonsieur Pangloss, the profoundest metaphysician in Germany?\"\n\n\"Dog of a Christian,\" answered the Levantine captain, \"since these two\ndogs of Christian slaves are barons and metaphysicians, which I doubt\nnot are high dignities in their country, you shall give me fifty\nthousand sequins.\"\n\n\"You shall have them, sir. Carry me back at once to Constantinople, and\nyou shall receive the money directly. But no; carry me first to Miss\nCunegonde.\"\n\nUpon the first proposal made by Candide, however, the Levantine captain\nhad already tacked about, and made the crew ply their oars quicker than\na bird cleaves the air.\n\nCandide embraced the Baron and Pangloss a hundred times.\n\n\"And how happened it, my dear Baron, that I did not kill you? And, my\ndear Pangloss, how came you to life again after being hanged? And why\nare you both in a Turkish galley?\"\n\n\"And it is true that my dear sister is in this country?\" said the Baron.\n\n\"Yes,\" answered Cacambo.\n\n\"Then I behold, once more, my dear Candide,\" cried Pangloss.\n\nCandide presented Martin and Cacambo to them; they embraced each other,\nand all spoke at once. The galley flew; they were already in the port.\nInstantly Candide sent for a Jew, to whom he sold for fifty thousand\nsequins a diamond worth a hundred thousand, though the fellow swore to\nhim by Abraham that he could give him no more. He immediately paid the\nransom for the Baron and Pangloss. The latter threw himself at the feet\nof his deliverer, and bathed them with his tears; the former thanked him\nwith a nod, and promised to return him the money on the first\nopportunity.\n\n\"But is it indeed possible that my sister can be in Turkey?\" said he.\n\n\"Nothing is more possible,\" said Cacambo, \"since she scours the dishes\nin the service of a Transylvanian prince.\"\n\nCandide sent directly for two Jews and sold them some more diamonds, and\nthen they all set out together in another galley to deliver Cunegonde\nfrom slavery.\n\n\n\n\nXXVIII\n\nWHAT HAPPENED TO CANDIDE, CUNEGONDE, PANGLOSS, MARTIN, ETC.\n\n\n\"I ask your pardon once more,\" said Candide to the Baron, \"your pardon,\nreverend father, for having run you through the body.\"\n\n\"Say no more about it,\" answered the Baron. \"I was a little too hasty, I\nown, but since you wish to know by what fatality I came to be a\ngalley-slave I will inform you. After I had been cured by the surgeon of\nthe college of the wound you gave me, I was attacked and carried off by\na party of Spanish troops, who confined me in prison at Buenos Ayres at\nthe very time my sister was setting out thence. I asked leave to return\nto Rome to the General of my Order. I was appointed chaplain to the\nFrench Ambassador at Constantinople. I had not been eight days in this\nemployment when one evening I met with a young Ichoglan, who was a very\nhandsome fellow. The weather was warm. The young man wanted to bathe,\nand I took this opportunity of bathing also. I did not know that it was\na capital crime for a Christian to be found naked with a young\nMussulman. A cadi ordered me a hundred blows on the soles of the feet,\nand condemned me to the galleys. I do not think there ever was a greater\nact of injustice. But I should be glad to know how my sister came to be\nscullion to a Transylvanian prince who has taken shelter among the\nTurks.\"\n\n\"But you, my dear Pangloss,\" said Candide, \"how can it be that I behold\nyou again?\"\n\n\"It is true,\" said Pangloss, \"that you saw me hanged. I should have been\nburnt, but you may remember it rained exceedingly hard when they were\ngoing to roast me; the storm was so violent that they despaired of\nlighting the fire, so I was hanged because they could do no better. A\nsurgeon purchased my body, carried me home, and dissected me. He began\nwith making a crucial incision on me from the navel to the clavicula.\nOne could not have been worse hanged than I was. The executioner of the\nHoly Inquisition was a sub-deacon, and knew how to burn people\nmarvellously well, but he was not accustomed to hanging. The cord was\nwet and did not slip properly, and besides it was badly tied; in short,\nI still drew my breath, when the crucial incision made me give such a\nfrightful scream that my surgeon fell flat upon his back, and imagining\nthat he had been dissecting the devil he ran away, dying with fear, and\nfell down the staircase in his flight. His wife, hearing the noise,\nflew from the next room. She saw me stretched out upon the table with my\ncrucial incision. She was seized with yet greater fear than her husband,\nfled, and tumbled over him. When they came to themselves a little, I\nheard the wife say to her husband: 'My dear, how could you take it into\nyour head to dissect a heretic? Do you not know that these people always\nhave the devil in their bodies? I will go and fetch a priest this minute\nto exorcise him.' At this proposal I shuddered, and mustering up what\nlittle courage I had still remaining I cried out aloud, 'Have mercy on\nme!' At length the Portuguese barber plucked up his spirits. He sewed up\nmy wounds; his wife even nursed me. I was upon my legs at the end of\nfifteen days. The barber found me a place as lackey to a knight of Malta\nwho was going to Venice, but finding that my master had no money to pay\nme my wages I entered the service of a Venetian merchant, and went with\nhim to Constantinople. One day I took it into my head to step into a\nmosque, where I saw an old Iman and a very pretty young devotee who was\nsaying her paternosters. Her bosom was uncovered, and between her\nbreasts she had a beautiful bouquet of tulips, roses, anemones,\nranunculus, hyacinths, and auriculas. She dropped her bouquet; I picked\nit up, and presented it to her with a profound reverence. I was so long\nin delivering it that the Iman began to get angry, and seeing that I was\na Christian he called out for help. They carried me before the cadi, who\nordered me a hundred lashes on the soles of the feet and sent me to the\ngalleys. I was chained to the very same galley and the same bench as the\nyoung Baron. On board this galley there were four young men from\nMarseilles, five Neapolitan priests, and two monks from Corfu, who told\nus similar adventures happened daily. The Baron maintained that he had\nsuffered greater injustice than I, and I insisted that it was far more\ninnocent to take up a bouquet and place it again on a woman's bosom than\nto be found stark naked with an Ichoglan. We were continually disputing,\nand received twenty lashes with a bull's pizzle when the concatenation\nof universal events brought you to our galley, and you were good enough\nto ransom us.\"\n\n\"Well, my dear Pangloss,\" said Candide to him, \"when you had been\nhanged, dissected, whipped, and were tugging at the oar, did you always\nthink that everything happens for the best?\"\n\n\"I am still of my first opinion,\" answered Pangloss, \"for I am a\nphilosopher and I cannot retract, especially as Leibnitz could never be\nwrong; and besides, the pre-established harmony is the finest thing in\nthe world, and so is his _plenum_ and _materia subtilis_.\"\n\n\n\n\nXXIX\n\nHOW CANDIDE FOUND CUNEGONDE AND THE OLD WOMAN AGAIN.\n\n\nWhile Candide, the Baron, Pangloss, Martin, and Cacambo were relating\ntheir several adventures, were reasoning on the contingent or\nnon-contingent events of the universe, disputing on effects and causes,\non moral and physical evil, on liberty and necessity, and on the\nconsolations a slave may feel even on a Turkish galley, they arrived at\nthe house of the Transylvanian prince on the banks of the Propontis. The\nfirst objects which met their sight were Cunegonde and the old woman\nhanging towels out to dry.\n\nThe Baron paled at this sight. The tender, loving Candide, seeing his\nbeautiful Cunegonde embrowned, with blood-shot eyes, withered neck,\nwrinkled cheeks, and rough, red arms, recoiled three paces, seized with\nhorror, and then advanced out of good manners. She embraced Candide and\nher brother; they embraced the old woman, and Candide ransomed them\nboth.\n\nThere was a small farm in the neighbourhood which the old woman\nproposed to Candide to make a shift with till the company could be\nprovided for in a better manner. Cunegonde did not know she had grown\nugly, for nobody had told her of it; and she reminded Candide of his\npromise in so positive a tone that the good man durst not refuse her. He\ntherefore intimated to the Baron that he intended marrying his sister.\n\n\"I will not suffer,\" said the Baron, \"such meanness on her part, and\nsuch insolence on yours; I will never be reproached with this scandalous\nthing; my sister's children would never be able to enter the church in\nGermany. No; my sister shall only marry a baron of the empire.\"\n\nCunegonde flung herself at his feet, and bathed them with her tears;\nstill he was inflexible.\n\n\"Thou foolish fellow,\" said Candide; \"I have delivered thee out of the\ngalleys, I have paid thy ransom, and thy sister's also; she was a\nscullion, and is very ugly, yet I am so condescending as to marry her;\nand dost thou pretend to oppose the match? I should kill thee again,\nwere I only to consult my anger.\"\n\n\"Thou mayest kill me again,\" said the Baron, \"but thou shalt not marry\nmy sister, at least whilst I am living.\"\n\n\n\n\nXXX\n\nTHE CONCLUSION.\n\n\nAt the bottom of his heart Candide had no wish to marry Cunegonde. But\nthe extreme impertinence of the Baron determined him to conclude the\nmatch, and Cunegonde pressed him so strongly that he could not go from\nhis word. He consulted Pangloss, Martin, and the faithful Cacambo.\nPangloss drew up an excellent memorial, wherein he proved that the Baron\nhad no right over his sister, and that according to all the laws of the\nempire, she might marry Candide with her left hand. Martin was for\nthrowing the Baron into the sea; Cacambo decided that it would be better\nto deliver him up again to the captain of the galley, after which they\nthought to send him back to the General Father of the Order at Rome by\nthe first ship. This advice was well received, the old woman approved\nit; they said not a word to his sister; the thing was executed for a\nlittle money, and they had the double pleasure of entrapping a Jesuit,\nand punishing the pride of a German baron.\n\nIt is natural to imagine that after so many disasters Candide married,\nand living with the philosopher Pangloss, the philosopher Martin, the\nprudent Cacambo, and the old woman, having besides brought so many\ndiamonds from the country of the ancient Incas, must have led a very\nhappy life. But he was so much imposed upon by the Jews that he had\nnothing left except his small farm; his wife became uglier every day,\nmore peevish and unsupportable; the old woman was infirm and even more\nfretful than Cunegonde. Cacambo, who worked in the garden, and took\nvegetables for sale to Constantinople, was fatigued with hard work, and\ncursed his destiny. Pangloss was in despair at not shining in some\nGerman university. For Martin, he was firmly persuaded that he would be\nas badly off elsewhere, and therefore bore things patiently. Candide,\nMartin, and Pangloss sometimes disputed about morals and metaphysics.\nThey often saw passing under the windows of their farm boats full of\nEffendis, Pashas, and Cadis, who were going into banishment to Lemnos,\nMitylene, or Erzeroum. And they saw other Cadis, Pashas, and Effendis\ncoming to supply the place of the exiles, and afterwards exiled in their\nturn. They saw heads decently impaled for presentation to the Sublime\nPorte. Such spectacles as these increased the number of their\ndissertations; and when they did not dispute time hung so heavily upon\ntheir hands, that one day the old woman ventured to say to them:\n\n\"I want to know which is worse, to be ravished a hundred times by negro\npirates, to have a buttock cut off, to run the gauntlet among the\nBulgarians, to be whipped and hanged at an _auto-da-fe_, to be\ndissected, to row in the galleys--in short, to go through all the\nmiseries we have undergone, or to stay here and have nothing to do?\"\n\n\"It is a great question,\" said Candide.\n\nThis discourse gave rise to new reflections, and Martin especially\nconcluded that man was born to live either in a state of distracting\ninquietude or of lethargic disgust. Candide did not quite agree to that,\nbut he affirmed nothing. Pangloss owned that he had always suffered\nhorribly, but as he had once asserted that everything went wonderfully\nwell, he asserted it still, though he no longer believed it.\n\nWhat helped to confirm Martin in his detestable principles, to stagger\nCandide more than ever, and to puzzle Pangloss, was that one day they\nsaw Paquette and Friar Giroflee land at the farm in extreme misery. They\nhad soon squandered their three thousand piastres, parted, were\nreconciled, quarrelled again, were thrown into gaol, had escaped, and\nFriar Giroflee had at length become Turk. Paquette continued her trade\nwherever she went, but made nothing of it.\n\n\"I foresaw,\" said Martin to Candide, \"that your presents would soon be\ndissipated, and only make them the more miserable. You have rolled in\nmillions of money, you and Cacambo; and yet you are not happier than\nFriar Giroflee and Paquette.\"\n\n\"Ha!\" said Pangloss to Paquette, \"Providence has then brought you\namongst us again, my poor child! Do you know that you cost me the tip of\nmy nose, an eye, and an ear, as you may see? What a world is this!\"\n\nAnd now this new adventure set them philosophising more than ever.\n\nIn the neighbourhood there lived a very famous Dervish who was esteemed\nthe best philosopher in all Turkey, and they went to consult him.\nPangloss was the speaker.\n\n\"Master,\" said he, \"we come to beg you to tell why so strange an animal\nas man was made.\"\n\n\"With what meddlest thou?\" said the Dervish; \"is it thy business?\"\n\n\"But, reverend father,\" said Candide, \"there is horrible evil in this\nworld.\"\n\n\"What signifies it,\" said the Dervish, \"whether there be evil or good?\nWhen his highness sends a ship to Egypt, does he trouble his head\nwhether the mice on board are at their ease or not?\"\n\n\"What, then, must we do?\" said Pangloss.\n\n\"Hold your tongue,\" answered the Dervish.\n\n\"I was in hopes,\" said Pangloss, \"that I should reason with you a little\nabout causes and effects, about the best of possible worlds, the origin\nof evil, the nature of the soul, and the pre-established harmony.\"\n\nAt these words, the Dervish shut the door in their faces.\n\nDuring this conversation, the news was spread that two Viziers and the\nMufti had been strangled at Constantinople, and that several of their\nfriends had been impaled. This catastrophe made a great noise for some\nhours. Pangloss, Candide, and Martin, returning to the little farm, saw\na good old man taking the fresh air at his door under an orange bower.\nPangloss, who was as inquisitive as he was argumentative, asked the old\nman what was the name of the strangled Mufti.\n\n\"I do not know,\" answered the worthy man, \"and I have not known the name\nof any Mufti, nor of any Vizier. I am entirely ignorant of the event you\nmention; I presume in general that they who meddle with the\nadministration of public affairs die sometimes miserably, and that they\ndeserve it; but I never trouble my head about what is transacting at\nConstantinople; I content myself with sending there for sale the fruits\nof the garden which I cultivate.\"\n\nHaving said these words, he invited the strangers into his house; his\ntwo sons and two daughters presented them with several sorts of sherbet,\nwhich they made themselves, with Kaimak enriched with the candied-peel\nof citrons, with oranges, lemons, pine-apples, pistachio-nuts, and Mocha\ncoffee unadulterated with the bad coffee of Batavia or the American\nislands. After which the two daughters of the honest Mussulman perfumed\nthe strangers' beards.\n\n\"You must have a vast and magnificent estate,\" said Candide to the Turk.\n\n\"I have only twenty acres,\" replied the old man; \"I and my children\ncultivate them; our labour preserves us from three great\nevils--weariness, vice, and want.\"\n\nCandide, on his way home, made profound reflections on the old man's\nconversation.\n\n\"This honest Turk,\" said he to Pangloss and Martin, \"seems to be in a\nsituation far preferable to that of the six kings with whom we had the\nhonour of supping.\"\n\n\"Grandeur,\" said Pangloss, \"is extremely dangerous according to the\ntestimony of philosophers. For, in short, Eglon, King of Moab, was\nassassinated by Ehud; Absalom was hung by his hair, and pierced with\nthree darts; King Nadab, the son of Jeroboam, was killed by Baasa; King\nEla by Zimri; Ahaziah by Jehu; Athaliah by Jehoiada; the Kings\nJehoiakim, Jeconiah, and Zedekiah, were led into captivity. You know how\nperished Croesus, Astyages, Darius, Dionysius of Syracuse, Pyrrhus,\nPerseus, Hannibal, Jugurtha, Ariovistus, Caesar, Pompey, Nero, Otho,\nVitellius, Domitian, Richard II. of England, Edward II., Henry VI.,\nRichard III., Mary Stuart, Charles I., the three Henrys of France, the\nEmperor Henry IV.! You know----\"\n\n\"I know also,\" said Candide, \"that we must cultivate our garden.\"\n\n\"You are right,\" said Pangloss, \"for when man was first placed in the\nGarden of Eden, he was put there _ut operaretur eum_, that he might\ncultivate it; which shows that man was not born to be idle.\"\n\n\"Let us work,\" said Martin, \"without disputing; it is the only way to\nrender life tolerable.\"\n\nThe whole little society entered into this laudable design, according to\ntheir different abilities. Their little plot of land produced plentiful\ncrops. Cunegonde was, indeed, very ugly, but she became an excellent\npastry cook; Paquette worked at embroidery; the old woman looked after\nthe linen. They were all, not excepting Friar Giroflee, of some service\nor other; for he made a good joiner, and became a very honest man.\n\nPangloss sometimes said to Candide:\n\n\"There is a concatenation of events in this best of all possible worlds:\nfor if you had not been kicked out of a magnificent castle for love of\nMiss Cunegonde: if you had not been put into the Inquisition: if you had\nnot walked over America: if you had not stabbed the Baron: if you had\nnot lost all your sheep from the fine country of El Dorado: you would\nnot be here eating preserved citrons and pistachio-nuts.\"\n\n\"All that is very well,\" answered Candide, \"but let us cultivate our\ngarden.\"\n\n\n\n\nFOOTNOTES:\n\n[1] P. 2. The name Pangloss is derived from two Greek words signifying\n\"all\" and \"language.\"\n\n[2] P. 8. The Abares were a tribe of Tartars settled on the shores of\nthe Danube, who later dwelt in part of Circassia.\n\n[3] P. 15. Venereal disease was said to have been first brought from\nHispaniola, in the West Indies, by some followers of Columbus who were\nlater employed in the siege of Naples. From this latter circumstance it\nwas at one time known as the Neapolitan disease.\n\n[4] P. 19. The great earthquake of Lisbon happened on the first of\nNovember, 1755.\n\n[5] P. 20. Such was the aversion of the Japanese to the Christian faith\nthat they compelled Europeans trading with their islands to trample on\nthe cross, renounce all marks of Christianity, and swear that it was not\ntheir religion. See chap. xi. of the voyage to Laputa in Swift's\n_Gulliver's Travels_.\n\n[6] P. 23. This _auto-da-fe_ actually took place, some months after the\nearthquake, on June 20, 1756.\n\n[7] P. 23. The rejection of bacon convicting them, of course, of being\nJews, and therefore fitting victims for an _auto-da-fe_.\n\n[8] P. 24. The _San-benito_ was a kind of loose over-garment painted\nwith flames, figures of devils, the victim's own portrait, etc., worn by\npersons condemned to death by the Inquisition when going to the stake on\nthe occasion of an _auto-da-fe_. Those who expressed repentance for\ntheir errors wore a garment of the same kind covered with flames\ndirected downwards, while that worn by Jews, sorcerers, and renegades\nbore a St. Andrew's cross before and behind.\n\n[9] P. 26. \"This Notre-Dame is of wood; every year she weeps on the day\nof her _fete_, and the people weep also. One day the preacher, seeing a\ncarpenter with dry eyes, asked him how it was that he did not dissolve\nin tears when the Holy Virgin wept. 'Ah, my reverend father,' replied\nhe, 'it is I who refastened her in her niche yesterday. I drove three\ngreat nails through her behind; it is then she would have wept if she\nhad been able.'\"--Voltaire, _Melanges_.\n\n[10] P. 42. The following posthumous note of Voltaire's was first added\nto M. Beuchot's edition of his works issued in 1829; \"See the extreme\ndiscretion of the author; there has not been up to the present any Pope\nnamed Urban X.; he feared to give a bastard to a known Pope. What\ncircumspection! What delicacy of conscience!\" The last Pope Urban was\nthe eighth, and he died in 1644.\n\n[11] P. 45. Muley-Ismael was Emperor of Morocco from 1672 to 1727, and\nwas a notoriously cruel tyrant.\n\n[12] P. 47. \"Oh, what a misfortune to be an eunuch!\"\n\n[13] P. 48. Carlo Broschi, called Farinelli, an Italian singer, born at\nNaples in 1705, without being exactly Minister, governed Spain under\nFerdinand VI.; he died in 1782. He has been made one of the chief\npersons in one of the comic operas of MM. Auber and Scribe.\n\n[14] P. 53. Jean Robeck, a Swede, who was born in 1672, will be found\nmentioned in Rousseau's _Nouvelle Heloise_. He drowned himself in the\nWeser at Bremen in 1729, and was the author of a Latin treatise on\nvoluntary death, first printed in 1735.\n\n[15] P. 60. A spontoon was a kind of half-pike, a military weapon\ncarried by officers of infantry and used as a medium for signalling\norders to the regiment.\n\n[16] P. 64. Later Voltaire substituted the name of the Father Croust for\nthat of Didrie. Of Croust he said in the _Dictionnaire Philosophique_\nthat he was \"the most brutal of the Society.\"\n\n[17] P. 68. By the _Journal of Trevoux_ Voltaire meant a critical\nperiodical printed by the Jesuits at Trevoux under the title of\n_Memoires pour servir a l'Historie des Sciences et des Beaux-Arts_. It\nexisted from 1701 until 1767, during which period its title underwent\nmany changes.\n\n[18] P. 76. It has been suggested that Voltaire, in speaking of red\nsheep, referred to the llama, a South American ruminant allied to the\ncamel. These animals are sometimes of a reddish colour, and were notable\nas pack-carriers and for their fleetness.\n\n[19] P. 78. The first English translator curiously gives \"a tourene of\nbouilli that weighed two hundred pounds,\" as the equivalent of \"_un\ncontour bouilli qui pesait deux cent livres_.\" The French editor of the\n1869 reprint points out that the South American vulture, or condor, is\nmeant; the name of this bird, it may be added, is taken from \"_cuntur_,\"\nthat given it by the aborigines.\n\n[20] P. 90. Spanish half-crowns.\n\n[21] P. 99. _Socinians_; followers of the teaching of Lalius and Faustus\nSocinus (16th century), which denied the doctrine of the Trinity, the\ndeity of Christ, the personality of the devil, the native and total\ndepravity of man, the vicarious atonement and eternal punishment. The\nSocinians are now represented by the Unitarians. _Manicheans_; followers\nof Manes or Manichaeus (3rd century), a Persian who maintained that there\nare two principles, the one good and the other evil, each equally\npowerful in the government of the world.\n\n[22] P. 107. In the 1759 editions, in place of the long passage in\nbrackets from here to page 215, there was only the following: \"'Sir,'\nsaid the Perigordian Abbe to him, 'have you noticed that young person\nwho has so roguish a face and so fine a figure? You may have her for ten\nthousand francs a month, and fifty thousand crowns in diamonds.' 'I have\nonly a day or two to give her,' answered Candide, 'because I have a\nrendezvous at Venice.' In the evening after supper the insinuating\nPerigordian redoubled his politeness and attentions.\"\n\n[23] P. 108. The play referred to is supposed to be \"Le Comte d'Essex,\"\nby Thomas Corneille.\n\n[24] P. 108. In France actors were at one time looked upon as\nexcommunicated persons, not worthy of burial in holy ground or with\nChristian rites. In 1730 the \"honours of sepulture\" were refused to\nMademoiselle Lecouvreur (doubtless the Miss Monime of this passage).\nVoltaire's miscellaneous works contain a paper on the matter.\n\n[25] P. 109. Elie-Catherine Freron was a French critic (1719-1776) who\nincurred the enmity of Voltaire. In 1752 Freron, in _Lettres sur\nquelques ecrits du temps_, wrote pointedly of Voltaire as one who chose\nto be all things to all men, and Voltaire retaliated by references such\nas these in _Candide_.\n\n[26] P. 111. Gabriel Gauchat (1709-1779), French ecclesiastical writer,\nwas author of a number of works on religious subjects.\n\n[27] P. 112. Nicholas Charles Joseph Trublet (1697-1770) was a French\nwriter whose criticism of Voltaire was revenged in passages such as this\none in _Candide_, and one in the _Pauvre Diable_ beginning:\n\n    L'abbe Trublet avait alors le rage\n    D'etre a Paris un petit personage.\n\n[28] P. 120. Damiens, who attempted the life of Louis XV. in 1757, was\nborn at Arras, capital of Artois (Atrebatie).\n\n[29] P. 120. On May 14, 1610, Ravaillac assassinated Henry VI.\n\n[30] P. 120. On December 27, 1594, Jean Chatel attempted to assassinate\nHenry IV.\n\n[31] P. 122. This same curiously inept criticism of the war which cost\nFrance her American provinces occurs in Voltaire's _Memoirs_, wherein he\nsays, \"In 1756 England made a piratical war upon France for some acres\nof snow.\" See also his _Precis du Siecle de Louis_ XV.\n\n[32] P. 123. Admiral Byng was shot on March 14, 1757.\n\n[33] P. 129. Commenting upon this passage, M. Sarcey says admirably:\n\"All is there! In those ten lines Voltaire has gathered all the griefs\nand all the terrors of these creatures; the picture is admirable for its\ntruth and power! But do you not feel the pity and sympathy of the\npainter? Here irony becomes sad, and in a way an avenger. Voltaire cries\nout with horror against the society which throws some of its members\ninto such an abyss. He has his 'Bartholomew' fever; we tremble with him\nthrough contagion.\"\n\n[34] P. 142. The following particulars of the six monarchs may prove not\nuninteresting. Achmet III. (_b._ 1673, _d._ 1739) was dethroned in 1730.\nIvan VI. (_b._ 1740, _d._ 1762) was dethroned in 1741. Charles Edward\nStuart, the Pretender (_b._ 1720, _d._ 1788). Auguste III. (_b._ 1696,\n_d._ 1763). Stanislaus (_b._ 1682, _d._ 1766). Theodore (_b._ 1690, _d._\n1755). It will be observed that, although quite impossible for the six\nkings ever to have met, five of them might have been made to do so\nwithout any anachronism.\n\n[35] P. 149. Francois Leopold Ragotsky (1676-1735).\n\n       *       *       *       *       *\n\n    +------------------------------------------------------------+\n    | Typographical errors corrected in text:                    |\n    |                                                            |\n    | Page xiv: Chapter XIII heading in Table of Contents        |\n    | amended to match chapter heading on page 54.               |\n    | Page 2: metaphysicotheo-logico-cosmolo-nigology            |\n    | amended to metaphysico-theologico-cosmolo-nigology.        |\n    | Page 158: Liebnitz amended to Leibnitz.                    |\n    | Page 168: perserved amended to preserved.                  |\n    | Page 172: rougish amended to roguish; crows amended to     |\n    | crowns.                                                    |\n    |                                                            |\n    | Where there is an equal number of instances of a word      |\n    | being hyphenated and unhyphenated, both versions           |\n    | of the word have been retained: dung-hill/dunghill;        |\n    | and new-comers/newcomers.                                  |\n    |                                                            |\n    | A single footnote on page 90 has been moved                |\n    | to the endnotes, and the notes numbers re-indexed. A       |\n    | page reference was added to the moved footnote to          |\n    | match the format of other endnotes.                        |\n    |                                                            |\n    | Modern Library blurb: \"mail complete list of titles\" left  |\n    | as is.                                                     |\n    |                                                            |\n    | There are two instances of Massa Carara (pp. 43 and 45)    |\n    | and one instance of Massa-Carrara (page ix). As this       |\n    | latter is in the Introduction, i.e. distinct from the book |\n    | proper, it has been retained.                              |\n    |                                                            |\n    | The different spellings of Cunegonde (which occurs only    |\n    | in the Introduction) and Robeck (which occurs in the       |\n    | Notes [p. 170]; spelt Robek in the text [p. 53]) have      |\n    | been retained for the same reason.                         |\n    |                                                            |\n    +------------------------------------------------------------+\n\n       *       *       *       *       *", "title": "Candide"}