{"summary": "\nThe story describes a two-dimensional world occupied by geometric figures, whereof women are simple line-segments, while men are polygons with various numbers of sides. The narrator is a square named A Square, a member of the caste of gentlemen and professionals, who guides the readers through some of the implications of life in two dimensions. The first half of the story goes through the practicalities of existing in a two-dimensional universe as well as a history leading up to the year 1999 on the eve of the 3rd Millennium.\nOn New Year's Eve, the Square dreams about a visit to a one-dimensional world (Lineland) inhabited by \"lustrous points\", in which he attempts to convince the realm's monarch of a second dimension; but is unable to do so. In the end, the monarch of Lineland tries to kill A Square rather than tolerate his nonsense any further.\nFollowing this vision, he is himself visited by a three-dimensional sphere named A Sphere, which he cannot comprehend until he sees Spaceland (a tridimensional world) for himself. This Sphere visits Flatland at the turn of each millennium to introduce a new apostle to the idea of a third dimension in the hopes of eventually educating the population of Flatland. From the safety of Spaceland, they are able to observe the leaders of Flatland secretly acknowledging the existence of the sphere and prescribing the silencing of anyone found preaching the truth of Spaceland and the third dimension. After this proclamation is made, many witnesses are massacred or imprisoned (according to caste), including A Square's brother, B.\nAfter the Square's mind is opened to new dimensions, he tries to convince the Sphere of the theoretical possibility of the existence of a fourth (and fifth, and sixth ...) spatial dimension; but the Sphere returns his student to Flatland in disgrace.\nThe Square then has a dream in which the Sphere visits him again, this time to introduce him to Pointland, whereof the point (sole inhabitant, monarch, and universe in one) perceives any communication as a thought originating in his own mind (cf. Solipsism):\n\n\"You see,\" said my Teacher, \"how little your words have done. So far as the Monarch understands them at all, he accepts them as his own – for he cannot conceive of any other except himself – and plumes himself upon the variety of Its Thought as an instance of creative Power. Let us leave this God of Pointland to the ignorant fruition of his omnipresence and omniscience: nothing that you or I can do can rescue him from his self-satisfaction.\"\n\nThe Square recognizes the identity of the ignorance of the monarchs of Pointland and Lineland with his own (and the Sphere's) previous ignorance of the existence of higher dimensions. Once returned to Flatland, the Square cannot convince anyone of Spaceland's existence, especially after official decrees are announced that anyone preaching the existence of three dimensions will be imprisoned (or executed, depending on caste). Eventually the Square himself is imprisoned for just this reason, with only occasional contact with his brother who is imprisoned in the same facility. He does not manage to convince his brother, even after all they have both seen. Seven years after being imprisoned, A Square writes out the book Flatland in the form of a memoir, hoping to keep it as posterity for a future generation that can see beyond their two-dimensional existence.\n\n", "full_text": "Flatland:  A Romance of Many Dimensions\n\nEdwin A. Abbott (1838-1926.  English scholar, theologian, and writer.)\n\n\n\n  -----------------------------------------------------------------\n  |        \"O day and night, but this is wondrous strange\"        |\n  |        ______                                                 |\n  |       /       /     /|   ------  /     /|      /|    /  /-.   |\n  |     /----   /     /__|    /    /     /__|    /  |  /  /   /   |\n  |   /       /___  /    |  /    /___  /    |  /    |/  /__.-'    |\n  |                                                               |\n  | No Dimensions                                  One Dimension  |\n  |       .         A ROMANCE OF MANY DIMENSIONS       -----      |\n  |   POINTLAND                                      LINELAND     |\n  |                                                               |\n  | Two Dimensions                               Three Dimensions |\n  |      ___                                             __       |\n  |     |   |                                          /__/|      |\n  |     |___|                                         |__|/       |\n  |   FLATLAND                                       SPACELAND    |\n  |          \"Fie, fie, how franticly I square my talk!\"          |\n  -----------------------------------------------------------------\n\nWith Illustrations by the Author, A SQUARE (Edwin A. Abbott)\n\n\n\n\n\n\n                                  To\n                  The Inhabitants of SPACE IN GENERAL\n                        And H. C. IN PARTICULAR\n                        This Work is Dedicated\n                    By a Humble Native of Flatland\n                           In the Hope that\n              Even as he was Initiated into the Mysteries\n                          Of THREE Dimensions\n                   Having been previously conversant\n                             With ONLY TWO\n               So the Citizens of that Celestial Region\n                   May aspire yet higher and higher\n          To the Secrets of FOUR FIVE OR EVEN SIX Dimensions\n                         Thereby contributing\n                 To the Enlargement of THE IMAGINATION\n                     And the possible Development\n            Of that most rare and excellent Gift of MODESTY\n                       Among the Superior Races\n                           Of SOLID HUMANITY\n\n\n\n\n\n\nPreface to the Second and Revised Edition, 1884.\n\nBy the Editor\n\n\n\nIf my poor Flatland friend retained the vigour of mind which he enjoyed\nwhen he began to compose these Memoirs, I should not now need to\nrepresent him in this preface, in which he desires, firstly, to return\nhis thanks to his readers and critics in Spaceland, whose appreciation\nhas, with unexpected celerity, required a second edition of his work;\nsecondly, to apologize for certain errors and misprints (for which,\nhowever, he is not entirely responsible); and, thirdly, to explain one\nor two misconceptions.  But he is not the Square he once was.  Years of\nimprisonment, and the still heavier burden of general incredulity and\nmockery, have combined with the natural decay of old age to erase from\nhis mind many of the thoughts and notions, and much also of the\nterminology, which he acquired during his short stay in Spaceland.  He\nhas, therefore, requested me to reply in his behalf to two special\nobjections, one of an intellectual, the other of a moral nature.\n\nThe first objection is, that a Flatlander, seeing a Line, sees\nsomething that must be THICK to the eye as well as LONG to the eye\n(otherwise it would not be visible, if it had not some thickness); and\nconsequently he ought (it is argued) to acknowledge that his countrymen\nare not only long and broad, but also (though doubtless in a very\nslight degree) THICK or HIGH.  This objection is plausible, and, to\nSpacelanders, almost irresistible, so that, I confess, when I first\nheard it, I knew not what to reply.  But my poor old friend's answer\nappears to me completely to meet it.\n\n\"I admit,\" said he--when I mentioned to him this objection--\"I admit\nthe truth of your critic's facts, but I deny his conclusions.  It is\ntrue that we have really in Flatland a Third unrecognized Dimension\ncalled 'height', just as it is also true that you have really in\nSpaceland a Fourth unrecognized Dimension, called by no name at\npresent, but which I will call 'extra-height'.  But we can no more take\ncognizance of our 'height' than you can of your 'extra-height'.  Even\nI--who have been in Spaceland, and have had the privilege of\nunderstanding for twenty-four hours the meaning of 'height'--even I\ncannot now comprehend it, nor realize it by the sense of sight or by\nany process of reason; I can but apprehend it by faith.\n\n\"The reason is obvious.  Dimension implies direction, implies\nmeasurement, implies the more and the less.  Now, all our lines are\nEQUALLY and INFINITESIMALLY thick (or high, whichever you like);\nconsequently, there is nothing in them to lead our minds to the\nconception of that Dimension.  No 'delicate micrometer'--as has been\nsuggested by one too hasty Spaceland critic--would in the least avail\nus; for we should not know WHAT TO MEASURE, NOR IN WHAT DIRECTION.\nWhen we see a Line, we see something that is long and BRIGHT;\nBRIGHTNESS, as well as length, is necessary to the existence of a Line;\nif the brightness vanishes, the Line is extinguished.  Hence, all my\nFlatland friends--when I talk to them about the unrecognized Dimension\nwhich is somehow visible in a Line--say, 'Ah, you mean BRIGHTNESS':\nand when I reply, 'No, I mean a real Dimension', they at once retort,\n'Then measure it, or tell us in what direction it extends'; and this\nsilences me, for I can do neither.  Only yesterday, when the Chief\nCircle (in other words our High Priest) came to inspect the State\nPrison and paid me his seventh annual visit, and when for the seventh\ntime he put me the question, 'Was I any better?' I tried to prove to\nhim that he was 'high', as well as long and broad, although he did not\nknow it.  But what was his reply?  'You say I am \"high\"; measure my\n\"high-ness\" and I will believe you.'  What could I do?  How could I\nmeet his challenge?  I was crushed; and he left the room triumphant.\n\n\"Does this still seem strange to you?  Then put yourself in a similar\nposition.  Suppose a person of the Fourth Dimension, condescending to\nvisit you, were to say, 'Whenever you open your eyes, you see a Plane\n(which is of Two Dimensions) and you INFER a Solid (which is of Three);\nbut in reality you also see (though you do not recognize) a Fourth\nDimension, which is not colour nor brightness nor anything of the kind,\nbut a true Dimension, although I cannot point out to you its direction,\nnor can you possibly measure it.'  What would you say to such a\nvisitor?  Would not you have him locked up?  Well, that is my fate: and\nit is as natural for us Flatlanders to lock up a Square for preaching\nthe Third Dimension, as it is for you Spacelanders to lock up a Cube\nfor preaching the Fourth.  Alas, how strong a family likeness runs\nthrough blind and persecuting humanity in all Dimensions!  Points,\nLines, Squares, Cubes, Extra-Cubes--we are all liable to the same\nerrors, all alike the Slaves of our respective Dimensional prejudices,\nas one of your Spaceland poets has said--\n\n     'One touch of Nature makes all worlds akin'.\"\n\n[Note:  The Author desires me to add, that the misconception of some of\nhis critics on this matter has induced him to insert in his dialogue\nwith the Sphere, certain remarks which have a bearing on the point in\nquestion, and which he had previously omitted as being tedious and\nunnecessary.]\n\nOn this point the defence of the Square seems to me to be impregnable.\nI wish I could say that his answer to the second (or moral) objection\nwas equally clear and cogent.  It has been objected that he is a\nwoman-hater; and as this objection has been vehemently urged by those\nwhom Nature's decree has constituted the somewhat larger half of the\nSpaceland race, I should like to remove it, so far as I can honestly do\nso.  But the Square is so unaccustomed to the use of the moral\nterminology of Spaceland that I should be doing him an injustice if I\nwere literally to transcribe his defence against this charge.  Acting,\ntherefore, as his interpreter and summarizer, I gather that in the\ncourse of an imprisonment of seven years he has himself modified his\nown personal views, both as regards Women and as regards the Isosceles\nor Lower Classes.  Personally, he now inclines to the opinion of the\nSphere that the Straight Lines are in many important respects superior\nto the Circles.  But, writing as a Historian, he has identified himself\n(perhaps too closely) with the views generally adopted by Flatland, and\n(as he has been informed) even by Spaceland, Historians; in whose pages\n(until very recent times) the destinies of Women and of the masses of\nmankind have seldom been deemed worthy of mention and never of careful\nconsideration.\n\nIn a still more obscure passage he now desires to disavow the Circular\nor aristocratic tendencies with which some critics have naturally\ncredited him.  While doing justice to the intellectual power with which\na few Circles have for many generations maintained their supremacy over\nimmense multitudes of their countrymen, he believes that the facts of\nFlatland, speaking for themselves without comment on his part, declare\nthat Revolutions cannot always be suppressed by slaughter, and that\nNature, in sentencing the Circles to infecundity, has condemned them to\nultimate failure--\"and herein,\" he says, \"I see a fulfilment of the\ngreat Law of all worlds, that while the wisdom of Man thinks it is\nworking one thing, the wisdom of Nature constrains it to work another,\nand quite a different and far better thing.\"  For the rest, he begs his\nreaders not to suppose that every minute detail in the daily life of\nFlatland must needs correspond to some other detail in Spaceland; and\nyet he hopes that, taken as a whole, his work may prove suggestive as\nwell as amusing, to those Spacelanders of moderate and modest minds\nwho--speaking of that which is of the highest importance, but lies\nbeyond experience--decline to say on the one hand, \"This can never be,\"\nand on the other hand, \"It must needs be precisely thus, and we know\nall about it.\"\n\n\n\n\n\n\nCONTENTS:\n\n\n\nPART I:  THIS WORLD\n\nSection\n\n   1.  Of the Nature of Flatland\n   2.  Of the Climate and Houses in Flatland\n   3.  Concerning the Inhabitants of Flatland\n   4.  Concerning the Women\n   5.  Of our Methods of Recognizing one another\n   6.  Of Recognition by Sight\n   7.  Concerning Irregular Figures\n   8.  Of the Ancient Practice of Painting\n   9.  Of the Universal Colour Bill\n  10.  Of the Suppression of the Chromatic Sedition\n  11.  Concerning our Priests\n  12.  Of the Doctrine of our Priests\n\nPART II:  OTHER WORLDS\n\n  13.  How I had a Vision of Lineland\n  14.  How I vainly tried to explain the nature of Flatland\n  15.  Concerning a Stranger from Spaceland\n  16.  How the Stranger vainly endeavoured to reveal to me\n         in words the mysteries of Spaceland\n  17.  How the Sphere, having in vain tried words,\n         resorted to deeds\n  18.  How I came to Spaceland, and what I saw there\n  19.  How, though the Sphere shewed me other mysteries\n         of Spaceland, I still desired more; and what came of it\n  20.  How the Sphere encouraged me in a Vision\n  21.  How I tried to teach the Theory of Three Dimensions\n         to my Grandson, and with what success\n  22.  How I then tried to diffuse the Theory\n         of Three Dimensions by other means, and of the result\n\n\n\n\n\n\nPART I:  THIS WORLD\n\n\"Be patient, for the world is broad and wide.\"\n\n\n\n\n\n\nSection 1.  Of the Nature of Flatland\n\n\n\nI call our world Flatland, not because we call it so, but to make its\nnature clearer to you, my happy readers, who are privileged to live in\nSpace.\n\nImagine a vast sheet of paper on which straight Lines, Triangles,\nSquares, Pentagons, Hexagons, and other figures, instead of remaining\nfixed in their places, move freely about, on or in the surface, but\nwithout the power of rising above or sinking below it, very much like\nshadows--only hard and with luminous edges--and you will then have a\npretty correct notion of my country and countrymen.  Alas, a few years\nago, I should have said \"my universe\":  but now my mind has been opened\nto higher views of things.\n\nIn such a country, you will perceive at once that it is impossible that\nthere should be anything of what you call a \"solid\" kind; but I dare\nsay you will suppose that we could at least distinguish by sight the\nTriangles, Squares, and other figures, moving about as I have described\nthem.  On the contrary, we could see nothing of the kind, not at least\nso as to distinguish one figure from another.  Nothing was visible, nor\ncould be visible, to us, except Straight Lines; and the necessity of\nthis I will speedily demonstrate.\n\nPlace a penny on the middle of one of your tables in Space; and leaning\nover it, look down upon it.  It will appear a circle.\n\nBut now, drawing back to the edge of the table, gradually lower your\neye (thus bringing yourself more and more into the condition of the\ninhabitants of Flatland), and you will find the penny becoming more and\nmore oval to your view, and at last when you have placed your eye\nexactly on the edge of the table (so that you are, as it were, actually\na Flatlander) the penny will then have ceased to appear oval at all,\nand will have become, so far as you can see, a straight line.\n\nThe same thing would happen if you were to treat in the same way a\nTriangle, or Square, or any other figure cut out of pasteboard.  As\nsoon as you look at it with your eye on the edge on the table, you will\nfind that it ceases to appear to you a figure, and that it becomes in\nappearance a straight line.  Take for example an equilateral\nTriangle--who represents with us a Tradesman of the respectable class.\nFig. 1 represents the Tradesman as you would see him while you were\nbending over him from above; figs. 2 and 3 represent the Tradesman, as\nyou would see him if your eye were close to the level, or all but on\nthe level of the table; and if your eye were quite on the level of the\ntable (and that is how we see him in Flatland) you would see nothing\nbut a straight line.\n\n\n[Illustration 1]\n\n[ASCII approximation follows]\n\n\n  (1)     __________     (2)    ___________     (3)     _________\n          \\        /             --__ __--                 ---\n            \\    /                   -\n              \\/\n\n\nWhen I was in Spaceland I heard that your sailors have very similar\nexperiences while they traverse your seas and discern some distant\nisland or coast lying on the horizon.  The far-off land may have bays,\nforelands, angles in and out to any number and extent; yet at a\ndistance you see none of these (unless indeed your sun shines bright\nupon them revealing the projections and retirements by means of light\nand shade), nothing but a grey unbroken line upon the water.\n\nWell, that is just what we see when one of our triangular or other\nacquaintances comes toward us in Flatland.  As there is neither sun\nwith us, nor any light of such a kind as to make shadows, we have none\nof the helps to the sight that you have in Spaceland.  If our friend\ncomes closer to us we see his line becomes larger; if he leaves us it\nbecomes smaller:  but still he looks like a straight line; be he a\nTriangle, Square, Pentagon, Hexagon, Circle, what you will--a straight\nLine he looks and nothing else.\n\nYou may perhaps ask how under these disadvantageous circumstances we\nare able to distinguish our friends from one another: but the answer to\nthis very natural question will be more fitly and easily given when I\ncome to describe the inhabitants of Flatland.  For the present let me\ndefer this subject, and say a word or two about the climate and houses\nin our country.\n\n\n\n\nSection 2.  Of the Climate and Houses in Flatland\n\n\n\nAs with you, so also with us, there are four points of the compass\nNorth, South, East, and West.\n\nThere being no sun nor other heavenly bodies, it is impossible for us\nto determine the North in the usual way; but we have a method of our\nown.  By a Law of Nature with us, there is a constant attraction to the\nSouth; and, although in temperate climates this is very slight--so that\neven a Woman in reasonable health can journey several furlongs\nnorthward without much difficulty--yet the hampering effect of the\nsouthward attraction is quite sufficient to serve as a compass in most\nparts of our earth.  Moreover, the rain (which falls at stated\nintervals) coming always from the North, is an additional assistance;\nand in the towns we have the guidance of the houses, which of course\nhave their side-walls running for the most part North and South, so\nthat the roofs may keep off the rain from the North.  In the country,\nwhere there are no houses, the trunks of the trees serve as some sort\nof guide.  Altogether, we have not so much difficulty as might be\nexpected in determining our bearings.\n\nYet in our more temperate regions, in which the southward attraction is\nhardly felt, walking sometimes in a perfectly desolate plain where\nthere have been no houses nor trees to guide me, I have been\noccasionally compelled to remain stationary for hours together, waiting\ntill the rain came before continuing my journey.  On the weak and aged,\nand especially on delicate Females, the force of attraction tells much\nmore heavily than on the robust of the Male Sex, so that it is a point\nof breeding, if you meet a Lady in the street, always to give her the\nNorth side of the way--by no means an easy thing to do always at short\nnotice when you are in rude health and in a climate where it is\ndifficult to tell your North from your South.\n\nWindows there are none in our houses:  for the light comes to us alike\nin our homes and out of them, by day and by night, equally at all times\nand in all places, whence we know not.  It was in old days, with our\nlearned men, an interesting and oft-investigated question, \"What is the\norigin of light?\" and the solution of it has been repeatedly attempted,\nwith no other result than to crowd our lunatic asylums with the\nwould-be solvers.  Hence, after fruitless attempts to suppress such\ninvestigations indirectly by making them liable to a heavy tax, the\nLegislature, in comparatively recent times, absolutely prohibited them.\nI--alas, I alone in Flatland--know now only too well the true solution\nof this mysterious problem; but my knowledge cannot be made\nintelligible to a single one of my countrymen; and I am mocked at--I,\nthe sole possessor of the truths of Space and of the theory of the\nintroduction of Light from the world of three Dimensions--as if I were\nthe maddest of the mad!  But a truce to these painful digressions:  let\nme return to our houses.\n\nThe most common form for the construction of a house is five-sided or\npentagonal, as in the annexed figure.  The two Northern sides RO, OF,\nconstitute the roof, and for the most part have no doors; on the East\nis a small door for the Women; on the West a much larger one for the\nMen; the South side or floor is usually doorless.\n\nSquare and triangular houses are not allowed, and for this reason.  The\nangles of a Square (and still more those of an equilateral Triangle),\nbeing much more pointed than those of a Pentagon, and the lines of\ninanimate objects (such as houses) being dimmer than the lines of Men\nand Women, it follows that there is no little danger lest the points of\na square or triangular house residence might do serious injury to an\ninconsiderate or perhaps absent-minded traveller suddenly therefore,\nrunning against them:  and as early as the eleventh century of our era,\ntriangular houses were universally forbidden by Law, the only\nexceptions being fortifications, powder-magazines, barracks, and other\nstate buildings, which it is not desirable that the general public\nshould approach without circumspection.\n\n\n[Illustration 2]\n\n[ASCII approximation follows]\n\n\n                             O\n                             /\\\n                           /    \\\n                         /        \\\n                       /            \\\n                     /                \\\n                  R/                    \\F\n                   \\_                   /\n                                      _/\n          Men's door                 _   Women's door\n                       _             /\n                       \\____________/\n                       A            B\n\n\nAt this period, square houses were still everywhere permitted, though\ndiscouraged by a special tax.  But, about three centuries afterwards,\nthe Law decided that in all towns containing a population above ten\nthousand, the angle of a Pentagon was the smallest house-angle that\ncould be allowed consistently with the public safety.  The good sense\nof the community has seconded the efforts of the Legislature; and now,\neven in the country, the pentagonal construction has superseded every\nother.  It is only now and then in some very remote and backward\nagricultural district that an antiquarian may still discover a square\nhouse.\n\n\n\n\nSection 3.  Concerning the Inhabitants of Flatland\n\n\n\nThe greatest length or breadth of a full grown inhabitant of Flatland\nmay be estimated at about eleven of your inches.  Twelve inches may be\nregarded as a maximum.\n\nOur Women are Straight Lines.\n\nOur Soldiers and Lowest Classes of Workmen are Triangles with two equal\nsides, each about eleven inches long, and a base or third side so short\n(often not exceeding half an inch) that they form at their vertices a\nvery sharp and formidable angle.  Indeed when their bases are of the\nmost degraded type (not more than the eighth part of an inch in size),\nthey can hardly be distinguished from Straight Lines or Women; so\nextremely pointed are their vertices.  With us, as with you, these\nTriangles are distinguished from others by being called Isosceles; and\nby this name I shall refer to them in the following pages.\n\nOur Middle Class consists of Equilateral or Equal-Sided Triangles.\n\nOur Professional Men and Gentlemen are Squares (to which class I myself\nbelong) and Five-Sided Figures or Pentagons.\n\nNext above these come the Nobility, of whom there are several degrees,\nbeginning at Six-Sided Figures, or Hexagons, and from thence rising in\nthe number of their sides till they receive the honourable title of\nPolygonal, or many-sided.  Finally when the number of the sides becomes\nso numerous, and the sides themselves so small, that the figure cannot\nbe distinguished from a circle, he is included in the Circular or\nPriestly order; and this is the highest class of all.\n\nIt is a Law of Nature with us that a male child shall have one more\nside than his father, so that each generation shall rise (as a rule)\none step in the scale of development and nobility.  Thus the son of a\nSquare is a Pentagon; the son of a Pentagon, a Hexagon; and so on.\n\nBut this rule applies not always to the Tradesmen, and still less often\nto the Soldiers, and to the Workmen; who indeed can hardly be said to\ndeserve the name of human Figures, since they have not all their sides\nequal.  With them therefore the Law of Nature does not hold; and the\nson of an Isosceles (i.e. a Triangle with two sides equal) remains\nIsosceles still.  Nevertheless, all hope is not shut out, even from the\nIsosceles, that his posterity may ultimately rise above his degraded\ncondition.  For, after a long series of military successes, or diligent\nand skilful labours, it is generally found that the more intelligent\namong the Artisan and Soldier classes manifest a slight increase of\ntheir third side or base, and a shrinkage of the two other sides.\nIntermarriages (arranged by the Priests) between the sons and daughters\nof these more intellectual members of the lower classes generally\nresult in an offspring approximating still more to the type of the\nEqual-Sided Triangle.\n\nRarely--in proportion to the vast numbers of Isosceles births--is a\ngenuine and certifiable Equal-Sided Triangle produced from Isosceles\nparents.  [Note:  \"What need of a certificate?\" a Spaceland critic may\nask:  \"Is not the procreation of a Square Son a certificate from Nature\nherself, proving the Equal-sidedness of the Father?\"  I reply that no\nLady of any position will marry an uncertified Triangle.  Square\noffspring has sometimes resulted from a slightly Irregular Triangle;\nbut in almost every such case the Irregularity of the first generation\nis visited on the third; which either fails to attain the Pentagonal\nrank, or relapses to the Triangular.]  Such a birth requires, as its\nantecedents, not only a series of carefully arranged intermarriages,\nbut also a long, continued exercise of frugality and self-control on\nthe part of the would-be ancestors of the coming Equilateral, and a\npatient, systematic, and continuous development of the Isosceles\nintellect through many generations.\n\nThe birth of a True Equilateral Triangle from Isosceles parents is the\nsubject of rejoicing in our country for many furlongs around.  After a\nstrict examination conducted by the Sanitary and Social Board, the\ninfant, if certified as Regular, is with solemn ceremonial admitted\ninto the class of Equilaterals.  He is then immediately taken from his\nproud yet sorrowing parents and adopted by some childless Equilateral,\nwho is bound by oath never to permit the child henceforth to enter his\nformer home or so much as to look upon his relations again, for fear\nlest the freshly developed organism may, by force of unconscious\nimitation, fall back again into his hereditary level.\n\nThe occasional emergence of an Equilateral from the ranks of his\nserf-born ancestors is welcomed, not only by the poor serfs themselves,\nas a gleam of light and hope shed upon the monotonous squalor of their\nexistence, but also by the Aristocracy at large; for all the higher\nclasses are well aware that these rare phenomena, while they do little\nor nothing to vulgarize their own privileges, serve as a most useful\nbarrier against revolution from below.\n\nHad the acute-angled rabble been all, without exception, absolutely\ndestitute of hope and of ambition, they might have found leaders in\nsome of their many seditious outbreaks, so able as to render their\nsuperior numbers and strength too much even for the wisdom of the\nCircles.  But a wise ordinance of Nature has decreed that, in\nproportion as the working-classes increase in intelligence, knowledge,\nand all virtue, in that same proportion their acute angle (which makes\nthem physically terrible) shall increase also and approximate to the\ncomparatively harmless angle of the Equilateral Triangle.  Thus, in the\nmost brutal and formidable of the soldier class--creatures almost on a\nlevel with women in their lack of intelligence--it is found that, as\nthey wax in the mental ability necessary to employ their tremendous\npenetrating power to advantage, so do they wane in the power of\npenetration itself.\n\nHow admirable is this Law of Compensation!  And how perfect a proof of\nthe natural fitness and, I may almost say, the divine origin of the\naristocratic constitution of the States in Flatland!  By a judicious\nuse of this Law of Nature, the Polygons and Circles are almost always\nable to stifle sedition in its very cradle, taking advantage of the\nirrepressible and boundless hopefulness of the human mind.  Art also\ncomes to the aid of Law and Order.  It is generally found possible--by\na little artificial compression or expansion on the part of the State\nphysicians--to make some of the more intelligent leaders of a rebellion\nperfectly Regular, and to admit them at once into the privileged\nclasses; a much larger number, who are still below the standard,\nallured by the prospect of being ultimately ennobled, are induced to\nenter the State Hospitals, where they are kept in honourable\nconfinement for life; one or two alone of the more obstinate, foolish,\nand hopelessly irregular are led to execution.\n\nThen the wretched rabble of the Isosceles, planless and leaderless, are\neither transfixed without resistance by the small body of their\nbrethren whom the Chief Circle keeps in pay for emergencies of this\nkind; or else more often, by means of jealousies and suspicions\nskilfully fomented among them by the Circular party, they are stirred\nto mutual warfare, and perish by one another's angles.  No less than\none hundred and twenty rebellions are recorded in our annals, besides\nminor outbreaks numbered at two hundred and thirty-five; and they have\nall ended thus.\n\n\n\n\nSection 4.  Concerning the Women\n\n\n\nIf our highly pointed Triangles of the Soldier class are formidable, it\nmay be readily inferred that far more formidable are our Women.  For if\na Soldier is a wedge, a Woman is a needle; being, so to speak, ALL\npoint, at least at the two extremities.  Add to this the power of\nmaking herself practically invisible at will, and you will perceive\nthat a Female, in Flatland, is a creature by no means to be trifled\nwith.\n\nBut here, perhaps, some of my younger Readers may ask HOW a woman in\nFlatland can make herself invisible.  This ought, I think, to be\napparent without any explanation.  However, a few words will make it\nclear to the most unreflecting.\n\nPlace a needle on a table.  Then, with your eye on the level of the\ntable, look at it side-ways, and you see the whole length of it; but\nlook at it end-ways, and you see nothing but a point, it has become\npractically invisible.  Just so is it with one of our Women.  When her\nside is turned towards us, we see her as a straight line; when the end\ncontaining her eye or mouth--for with us these two organs are\nidentical--is the part that meets our eye, then we see nothing but a\nhighly lustrous point; but when the back is presented to our view,\nthen--being only sub-lustrous, and, indeed, almost as dim as an\ninanimate object--her hinder extremity serves her as a kind of\nInvisible Cap.\n\nThe dangers to which we are exposed from our Women must now be manifest\nto the meanest capacity in Spaceland.  If even the angle of a\nrespectable Triangle in the middle class is not without its dangers; if\nto run against a Working Man involves a gash; if collision with an\nofficer of the military class necessitates a serious wound; if a mere\ntouch from the vertex of a Private Soldier brings with it danger of\ndeath;--what can it be to run against a Woman, except absolute and\nimmediate destruction?  And when a Woman is invisible, or visible only\nas a dim sub-lustrous point, how difficult must it be, even for the\nmost cautious, always to avoid collision!\n\nMany are the enactments made at different times in the different States\nof Flatland, in order to minimize this peril; and in the Southern and\nless temperate climates where the force of gravitation is greater, and\nhuman beings more liable to casual and involuntary motions, the Laws\nconcerning Women are naturally much more stringent.  But a general view\nof the Code may be obtained from the following summary:--\n\n\n1.  Every house shall have one entrance in the Eastern side, for the\nuse of Females only; by which all females shall enter \"in a becoming\nand respectful manner\" and not by the Men's or Western door.  [Note:\nWhen I was in Spaceland I understood that some of your Priestly circles\nhave in the same way a separate entrance for Villagers, Farmers and\nTeachers of Board Schools (`Spectator', Sept. 1884, p. 1255) that they\nmay \"approach in a becoming and respectful manner.\"]\n\n2.  No Female shall walk in any public place without continually\nkeeping up her Peace-cry, under penalty of death.\n\n3.  Any Female, duly certified to be suffering from St. Vitus's Dance,\nfits, chronic cold accompanied by violent sneezing, or any disease\nnecessitating involuntary motions, shall be instantly destroyed.\n\n\nIn some of the States there is an additional Law forbidding Females,\nunder penalty of death, from walking or standing in any public place\nwithout moving their backs constantly from right to left so as to\nindicate their presence to those behind them; others oblige a Woman,\nwhen travelling, to be followed by one of her sons, or servants, or by\nher husband; others confine Women altogether to their houses except\nduring the religious festivals.  But it has been found by the wisest of\nour Circles or Statesmen that the multiplication of restrictions on\nFemales tends not only to the debilitation and diminution of the race,\nbut also to the increase of domestic murders to such an extent that a\nState loses more than it gains by a too prohibitive Code.\n\nFor whenever the temper of the Women is thus exasperated by confinement\nat home or hampering regulations abroad, they are apt to vent their\nspleen upon their husbands and children; and in the less temperate\nclimates the whole male population of a village has been sometimes\ndestroyed in one or two hours of simultaneous female outbreak.  Hence\nthe Three Laws, mentioned above, suffice for the better regulated\nStates, and may be accepted as a rough exemplification of our Female\nCode.\n\nAfter all, our principal safeguard is found, not in Legislature, but in\nthe interests of the Women themselves.  For, although they can inflict\ninstantaneous death by a retrograde movement, yet unless they can at\nonce disengage their stinging extremity from the struggling body of\ntheir victim, their own frail bodies are liable to be shattered.\n\nThe power of Fashion is also on our side.  I pointed out that in some\nless civilized States no female is suffered to stand in any public\nplace without swaying her back from right to left.  This practice has\nbeen universal among ladies of any pretensions to breeding in all\nwell-governed States, as far back as the memory of Figures can reach.\nIt is considered a disgrace to any State that legislation should have\nto enforce what ought to be, and is in every respectable female, a\nnatural instinct.  The rhythmical and, if I may so say, well-modulated\nundulation of the back in our ladies of Circular rank is envied and\nimitated by the wife of a common Equilateral, who can achieve nothing\nbeyond a mere monotonous swing, like the ticking of a pendulum; and the\nregular tick of the Equilateral is no less admired and copied by the\nwife of the progressive and aspiring Isosceles, in the females of whose\nfamily no \"back-motion\" of any kind has become as yet a necessity of\nlife.  Hence, in every family of position and consideration, \"back\nmotion\" is as prevalent as time itself; and the husbands and sons in\nthese households enjoy immunity at least from invisible attacks.\n\nNot that it must be for a moment supposed that our Women are destitute\nof affection.  But unfortunately the passion of the moment\npredominates, in the Frail Sex, over every other consideration.  This\nis, of course, a necessity arising from their unfortunate conformation.\nFor as they have no pretensions to an angle, being inferior in this\nrespect to the very lowest of the Isosceles, they are consequently\nwholly devoid of brain-power, and have neither reflection, judgment nor\nforethought, and hardly any memory.  Hence, in their fits of fury, they\nremember no claims and recognize no distinctions.  I have actually\nknown a case where a Woman has exterminated her whole household, and\nhalf an hour afterwards, when her rage was over and the fragments swept\naway, has asked what has become of her husband and her children.\n\nObviously then a Woman is not to be irritated as long as she is in a\nposition where she can turn round.  When you have them in their\napartments--which are constructed with a view to denying them that\npower--you can say and do what you like; for they are then wholly\nimpotent for mischief, and will not remember a few minutes hence the\nincident for which they may be at this moment threatening you with\ndeath, nor the promises which you may have found it necessary to make\nin order to pacify their fury.\n\nOn the whole we get on pretty smoothly in our domestic relations,\nexcept in the lower strata of the Military Classes.  There the want of\ntact and discretion on the part of the husbands produces at times\nindescribable disasters.  Relying too much on the offensive weapons of\ntheir acute angles instead of the defensive organs of good sense and\nseasonable simulation, these reckless creatures too often neglect the\nprescribed construction of the women's apartments, or irritate their\nwives by ill-advised expressions out of doors, which they refuse\nimmediately to retract.  Moreover a blunt and stolid regard for literal\ntruth indisposes them to make those lavish promises by which the more\njudicious Circle can in a moment pacify his consort.  The result is\nmassacre; not, however, without its advantages, as it eliminates the\nmore brutal and troublesome of the Isosceles; and by many of our\nCircles the destructiveness of the Thinner Sex is regarded as one among\nmany providential arrangements for suppressing redundant population,\nand nipping Revolution in the bud.\n\nYet even in our best regulated and most approximately Circular families\nI cannot say that the ideal of family life is so high as with you in\nSpaceland.  There is peace, in so far as the absence of slaughter may\nbe called by that name, but there is necessarily little harmony of\ntastes or pursuits; and the cautious wisdom of the Circles has ensured\nsafety at the cost of domestic comfort.  In every Circular or Polygonal\nhousehold it has been a habit from time immemorial--and now has become\na kind of instinct among the women of our higher classes--that the\nmothers and daughters should constantly keep their eyes and mouths\ntowards their husband and his male friends; and for a lady in a family\nof distinction to turn her back upon her husband would be regarded as a\nkind of portent, involving loss of STATUS.  But, as I shall soon shew,\nthis custom, though it has the advantage of safety, is not without its\ndisadvantages.\n\nIn the house of the Working Man or respectable Tradesman--where the\nwife is allowed to turn her back upon her husband, while pursuing her\nhousehold avocations--there are at least intervals of quiet, when the\nwife is neither seen nor heard, except for the humming sound of the\ncontinuous Peace-cry; but in the homes of the upper classes there is\ntoo often no peace.  There the voluble mouth and bright penetrating eye\nare ever directed towards the Master of the household; and light itself\nis not more persistent than the stream of feminine discourse.  The tact\nand skill which suffice to avert a Woman's sting are unequal to the\ntask of stopping a Woman's mouth; and as the wife has absolutely\nnothing to say, and absolutely no constraint of wit, sense, or\nconscience to prevent her from saying it, not a few cynics have been\nfound to aver that they prefer the danger of the death-dealing but\ninaudible sting to the safe sonorousness of a Woman's other end.\n\nTo my readers in Spaceland the condition of our Women may seem truly\ndeplorable, and so indeed it is.  A Male of the lowest type of the\nIsosceles may look forward to some improvement of his angle, and to the\nultimate elevation of the whole of his degraded caste; but no Woman can\nentertain such hopes for her sex.  \"Once a Woman, always a Woman\" is a\nDecree of Nature; and the very Laws of Evolution seem suspended in her\ndisfavour.  Yet at least we can admire the wise Prearrangement which\nhas ordained that, as they have no hopes, so they shall have no memory\nto recall, and no forethought to anticipate, the miseries and\nhumiliations which are at once a necessity of their existence and the\nbasis of the constitution of Flatland.\n\n\n\n\nSection 5.  Of our Methods of Recognizing one another\n\n\n\nYou, who are blessed with shade as well as light, you, who are gifted\nwith two eyes, endowed with a knowledge of perspective, and charmed\nwith the enjoyment of various colours, you, who can actually SEE an\nangle, and contemplate the complete circumference of a circle in the\nhappy region of the Three Dimensions--how shall I make clear to you the\nextreme difficulty which we in Flatland experience in recognizing one\nanother's configuration?\n\nRecall what I told you above.  All beings in Flatland, animate or\ninanimate, no matter what their form, present TO OUR VIEW the same, or\nnearly the same, appearance, viz. that of a straight Line.  How then\ncan one be distinguished from another, where all appear the same?\n\nThe answer is threefold.  The first means of recognition is the sense\nof hearing; which with us is far more highly developed than with you,\nand which enables us not only to distinguish by the voice our personal\nfriends, but even to discriminate between different classes, at least\nso far as concerns the three lowest orders, the Equilateral, the\nSquare, and the Pentagon--for of the Isosceles I take no account.  But\nas we ascend in the social scale, the process of discriminating and\nbeing discriminated by hearing increases in difficulty, partly because\nvoices are assimilated, partly because the faculty of\nvoice-discrimination is a plebeian virtue not much developed among the\nAristocracy.  And wherever there is any danger of imposture we cannot\ntrust to this method.  Amongst our lowest orders, the vocal organs are\ndeveloped to a degree more than correspondent with those of hearing, so\nthat an Isosceles can easily feign the voice of a Polygon, and, with\nsome training, that of a Circle himself.  A second method is therefore\nmore commonly resorted to.\n\nFEELING is, among our Women and lower classes--about our upper classes\nI shall speak presently--the principal test of recognition, at all\nevents between strangers, and when the question is, not as to the\nindividual, but as to the class.  What therefore \"introduction\" is\namong the higher classes in Spaceland, that the process of \"feeling\" is\nwith us.  \"Permit me to ask you to feel and be felt by my friend Mr.\nSo-and-so\"--is still, among the more old-fashioned of our country\ngentlemen in districts remote from towns, the customary formula for a\nFlatland introduction.  But in the towns, and among men of business,\nthe words \"be felt by\" are omitted and the sentence is abbreviated to,\n\"Let me ask you to feel Mr. So-and-so\"; although it is assumed, of\ncourse, that the \"feeling\" is to be reciprocal.  Among our still more\nmodern and dashing young gentlemen--who are extremely averse to\nsuperfluous effort and supremely indifferent to the purity of their\nnative language--the formula is still further curtailed by the use of\n\"to feel\" in a technical sense, meaning, \"to\nrecommend-for-the-purposes-of-feeling-and-being-felt\"; and at this\nmoment the \"slang\" of polite or fast society in the upper classes\nsanctions such a barbarism as \"Mr. Smith, permit me to feel Mr. Jones.\"\n\nLet not my Reader however suppose that \"feeling\" is with us the tedious\nprocess that it would be with you, or that we find it necessary to feel\nright round all the sides of every individual before we determine the\nclass to which he belongs.  Long practice and training, begun in the\nschools and continued in the experience of daily life, enable us to\ndiscriminate at once by the sense of touch, between the angles of an\nequal-sided Triangle, Square, and Pentagon; and I need not say that the\nbrainless vertex of an acute-angled Isosceles is obvious to the dullest\ntouch.  It is therefore not necessary, as a rule, to do more than feel\na single angle of an individual; and this, once ascertained, tells us\nthe class of the person whom we are addressing, unless indeed he\nbelongs to the higher sections of the nobility.  There the difficulty\nis much greater.  Even a Master of Arts in our University of Wentbridge\nhas been known to confuse a ten-sided with a twelve-sided Polygon; and\nthere is hardly a Doctor of Science in or out of that famous University\nwho could pretend to decide promptly and unhesitatingly between a\ntwenty-sided and a twenty-four sided member of the Aristocracy.\n\nThose of my readers who recall the extracts I gave above from the\nLegislative code concerning Women, will readily perceive that the\nprocess of introduction by contact requires some care and discretion.\nOtherwise the angles might inflict on the unwary Feeler irreparable\ninjury.  It is essential for the safety of the Feeler that the Felt\nshould stand perfectly still.  A start, a fidgety shifting of the\nposition, yes, even a violent sneeze, has been known before now to\nprove fatal to the incautious, and to nip in the bud many a promising\nfriendship.  Especially is this true among the lower classes of the\nTriangles.  With them, the eye is situated so far from their vertex\nthat they can scarcely take cognizance of what goes on at that\nextremity of their frame.  They are, moreover, of a rough coarse\nnature, not sensitive to the delicate touch of the highly organized\nPolygon.  What wonder then if an involuntary toss of the head has ere\nnow deprived the State of a valuable life!\n\nI have heard that my excellent Grandfather--one of the least irregular\nof his unhappy Isosceles class, who indeed obtained, shortly before his\ndecease, four out of seven votes from the Sanitary and Social Board for\npassing him into the class of the Equal-sided--often deplored, with a\ntear in his venerable eye, a miscarriage of this kind, which had\noccured to his great-great-great-Grandfather, a respectable Working Man\nwith an angle or brain of 59 degrees 30 minutes.  According to his\naccount, my unfortunate Ancestor, being afflicted with rheumatism, and\nin the act of being felt by a Polygon, by one sudden start accidentally\ntransfixed the Great Man through the diagonal; and thereby, partly in\nconsequence of his long imprisonment and degradation, and partly\nbecause of the moral shock which pervaded the whole of my Ancestor's\nrelations, threw back our family a degree and a half in their ascent\ntowards better things.  The result was that in the next generation the\nfamily brain was registered at only 58 degrees, and not till the lapse\nof five generations was the lost ground recovered, the full 60 degrees\nattained, and the Ascent from the Isosceles finally achieved.  And all\nthis series of calamities from one little accident in the process of\nFeeling.\n\nAt this point I think I hear some of my better educated readers\nexclaim, \"How could you in Flatland know anything about angles and\ndegrees, or minutes?  We can SEE an angle, because we, in the region of\nSpace, can see two straight lines inclined to one another; but you, who\ncan see nothing but one straight line at a time, or at all events only\na number of bits of straight lines all in one straight line--how can\nyou ever discern any angle, and much less register angles of different\nsizes?\"\n\nI answer that though we cannot SEE angles, we can INFER them, and this\nwith great precision.  Our sense of touch, stimulated by necessity, and\ndeveloped by long training, enables us to distinguish angles far more\naccurately than your sense of sight, when unaided by a rule or measure\nof angles.  Nor must I omit to explain that we have great natural\nhelps.  It is with us a Law of Nature that the brain of the Isosceles\nclass shall begin at half a degree, or thirty minutes, and shall\nincrease (if it increases at all) by half a degree in every generation;\nuntil the goal of 60 degrees is reached, when the condition of serfdom\nis quitted, and the freeman enters the class of Regulars.\n\nConsequently, Nature herself supplies us with an ascending scale or\nAlphabet of angles for half a degree up to 60 degrees, Specimens of\nwhich are placed in every Elementary School throughout the land.  Owing\nto occasional retrogressions, to still more frequent moral and\nintellectual stagnation, and to the extraordinary fecundity of the\nCriminal and Vagabond Classes, there is always a vast superfluity of\nindividuals of the half degree and single degree class, and a fair\nabundance of Specimens up to 10 degrees.  These are absolutely\ndestitute of civic rights; and a great number of them, not having even\nintelligence enough for the purposes of warfare, are devoted by the\nStates to the service of education.  Fettered immovably so as to remove\nall possibility of danger, they are placed in the class rooms of our\nInfant Schools, and there they are utilized by the Board of Education\nfor the purpose of imparting to the offspring of the Middle Classes\nthat tact and intelligence of which these wretched creatures themselves\nare utterly devoid.\n\nIn some States the Specimens are occasionally fed and suffered to exist\nfor several years; but in the more temperate and better regulated\nregions, it is found in the long run more advantageous for the\neducational interests of the young, to dispense with food, and to renew\nthe Specimens every month--which is about the average duration of the\nfoodless existence of the Criminal class.  In the cheaper schools, what\nis gained by the longer existence of the Specimen is lost, partly in\nthe expenditure for food, and partly in the diminished accuracy of the\nangles, which are impaired after a few weeks of constant \"feeling\".\nNor must we forget to add, in enumerating the advantages of the more\nexpensive system, that it tends, though slightly yet perceptibly, to\nthe diminution of the redundant Isosceles population--an object which\nevery statesman in Flatland constantly keeps in view.  On the whole\ntherefore--although I am not ignorant that, in many popularly elected\nSchool Boards, there is a reaction in favour of \"the cheap system\" as\nit is called--I am myself disposed to think that this is one of the\nmany cases in which expense is the truest economy.\n\nBut I must not allow questions of School Board politics to divert me\nfrom my subject.  Enough has been said, I trust, to shew that\nRecognition by Feeling is not so tedious or indecisive a process as\nmight have been supposed; and it is obviously more trustworthy than\nRecognition by hearing.  Still there remains, as has been pointed out\nabove, the objection that this method is not without danger.  For this\nreason many in the Middle and Lower classes, and all without exception\nin the Polygonal and Circular orders, prefer a third method, the\ndescription of which shall be reserved for the next section.\n\n\n\n\nSection 6.  Of Recognition by Sight\n\n\n\nI am about to appear very inconsistent.  In previous sections I have\nsaid that all figures in Flatland present the appearance of a straight\nline; and it was added or implied, that it is consequently impossible\nto distinguish by the visual organ between individuals of different\nclasses:  yet now I am about to explain to my Spaceland critics how we\nare able to recognize one another by the sense of sight.\n\nIf however the Reader will take the trouble to refer to the passage in\nwhich Recognition by Feeling is stated to be universal, he will find\nthis qualification--\"among the lower classes\".  It is only among the\nhigher classes and in our temperate climates that Sight Recognition is\npractised.\n\nThat this power exists in any regions and for any classes is the result\nof Fog; which prevails during the greater part of the year in all parts\nsave the torrid zones.  That which is with you in Spaceland an unmixed\nevil, blotting out the landscape, depressing the spirits, and\nenfeebling the health, is by us recognized as a blessing scarcely\ninferior to air itself, and as the Nurse of arts and Parent of\nsciences.  But let me explain my meaning, without further eulogies on\nthis beneficent Element.\n\nIf Fog were non-existent, all lines would appear equally and\nindistinguishably clear; and this is actually the case in those unhappy\ncountries in which the atmosphere is perfectly dry and transparent.\nBut wherever there is a rich supply of Fog objects that are at a\ndistance, say of three feet, are appreciably dimmer than those at a\ndistance of two feet eleven inches; and the result is that by careful\nand constant experimental observation of comparative dimness and\nclearness, we are enabled to infer with great exactness the\nconfiguration of the object observed.\n\nAn instance will do more than a volume of generalities to make my\nmeaning clear.\n\nSuppose I see two individuals approaching whose rank I wish to\nascertain.  They are, we will suppose, a Merchant and a Physician, or\nin other words, an Equilateral Triangle and a Pentagon: how am I to\ndistinguish them?\n\n\n[Illustration 3]\n\n[ASCII approximation follows]\n\n\n                                     C   (1)\n                                    |\\  -  _ D\n                                    |  \\    ||-  _\n                                    |    \\  ||      -  _\n                                    | <--- >|| -----------+(> Eye-glance\n              ___C' (2)             |    / A||      _  -\n        ___---   \\  -  _D'          |  /    ||_  -\n   __---          \\    || -  _      |/  _  - E\n  |                \\   ||       -  _ B\n  |                 \\  ||             -  _\n  |     Eye-glance   \\ ||                   -  _\n  |    <----------- A'>|| ------------------------+(>\n  |                  / ||                   _  -\n  |                 /  ||             _  -\n  |__              /   ||       _  -\n     ---___       /    || _  -\n           ---___/  _  -E'\n                 B'\n\n\nIt will be obvious, to every child in Spaceland who has touched the\nthreshold of Geometrical Studies, that, if I can bring my eye so that\nits glance may bisect an angle (A) of the approaching stranger, my view\nwill lie as it were evenly between his two sides that are next to me\n(viz. CA and AB), so that I shall contemplate the two impartially, and\nboth will appear of the same size.\n\nNow in the case of (1) the Merchant, what shall I see?  I shall see a\nstraight line DAE, in which the middle point (A) will be very bright\nbecause it is nearest to me; but on either side the line will shade\naway RAPIDLY INTO DIMNESS, because the sides AC and AB RECEDE RAPIDLY\nINTO THE FOG and what appear to me as the Merchant's extremities, viz.\nD and E, will be VERY DIM INDEED.\n\nOn the other hand in the case of (2) the Physician, though I shall here\nalso see a line (D'A'E') with a bright centre (A'), yet it will shade\naway LESS RAPIDLY into dimness, because the sides (A'C', A'B') RECEDE\nLESS RAPIDLY INTO THE FOG:  and what appear to me the Physician's\nextremities, viz. D' and E', will not be NOT SO DIM as the extremities\nof the Merchant.\n\nThe Reader will probably understand from these two instances how--after\na very long training supplemented by constant experience--it is\npossible for the well-educated classes among us to discriminate with\nfair accuracy between the middle and lowest orders, by the sense of\nsight.  If my Spaceland Patrons have grasped this general conception,\nso far as to conceive the possibility of it and not to reject my\naccount as altogether incredible--I shall have attained all I can\nreasonably expect.  Were I to attempt further details I should only\nperplex.  Yet for the sake of the young and inexperienced, who may\nperchance infer--from the two simple instances I have given above, of\nthe manner in which I should recognize my Father and my Sons--that\nRecognition by sight is an easy affair, it may be needful to point out\nthat in actual life most of the problems of Sight Recognition are far\nmore subtle and complex.\n\nIf for example, when my Father, the Triangle, approaches me, he happens\nto present his side to me instead of his angle, then, until I have\nasked him to rotate, or until I have edged my eye round him, I am for\nthe moment doubtful whether he may not be a Straight Line, or, in other\nwords, a Woman.  Again, when I am in the company of one of my two\nhexagonal Grandsons, contemplating one of his sides (AB) full front, it\nwill be evident from the accompanying diagram that I shall see one\nwhole line (AB) in comparative brightness (shading off hardly at all at\nthe ends) and two smaller lines (CA and BD) dim throughout and shading\naway into greater dimness towards the extremities C and D.\n\n\n[Illustration 4]\n\n[ASCII approximation follows]\n\n\n         /\\ -  _  C\n       /    \\    ||  _\n     /        \\  ||     -  _\n   /            \\||           -  _\n  |            A ||                 -  _\n  |              ||                       -+(> (Eye)\n  |            B ||                 _  -\n   \\            /||           _  -\n     \\        /  ||     _  -\n       \\    /    ||  -\n         \\/ _  -  D\n\n\nBut I must not give way to the temptation of enlarging on these topics.\nThe meanest mathematician in Spaceland will readily believe me when I\nassert that the problems of life, which present themselves to the\nwell-educated--when they are themselves in motion, rotating, advancing\nor retreating, and at the same time attempting to discriminate by the\nsense of sight between a number of Polygons of high rank moving in\ndifferent directions, as for example in a ball-room or\nconversazione--must be of a nature to task the angularity of the most\nintellectual, and amply justify the rich endowments of the Learned\nProfessors of Geometry, both Static and Kinetic, in the illustrious\nUniversity of Wentbridge, where the Science and Art of Sight\nRecognition are regularly taught to large classes of the ELITE of the\nStates.\n\nIt is only a few of the scions of our noblest and wealthiest houses,\nwho are able to give the time and money necessary for the thorough\nprosecution of this noble and valuable Art.  Even to me, a\nMathematician of no mean standing, and the Grandfather of two most\nhopeful and perfectly regular Hexagons, to find myself in the midst of\na crowd of rotating Polygons of the higher classes, is occasionally\nvery perplexing.  And of course to a common Tradesman, or Serf, such a\nsight is almost as unintelligible as it would be to you, my Reader,\nwere you suddenly transported into our country.\n\nIn such a crowd you could see on all sides of you nothing but a Line,\napparently straight, but of which the parts would vary irregularly and\nperpetually in brightness or dimness.  Even if you had completed your\nthird year in the Pentagonal and Hexagonal classes in the University,\nand were perfect in the theory of the subject, you would still find\nthat there was need of many years of experience, before you could move\nin a fashionable crowd without jostling against your betters, whom it\nis against etiquette to ask to \"feel\", and who, by their superior\nculture and breeding, know all about your movements, while you know\nvery little or nothing about theirs.  In a word, to comport oneself\nwith perfect propriety in Polygonal society, one ought to be a Polygon\noneself.  Such at least is the painful teaching of my experience.\n\nIt is astonishing how much the Art--or I may almost call it\ninstinct--of Sight Recognition is developed by the habitual practice of\nit and by the avoidance of the custom of \"Feeling\".  Just as, with you,\nthe deaf and dumb, if once allowed to gesticulate and to use the\nhand-alphabet, will never acquire the more difficult but far more\nvaluable art of lipspeech and lip-reading, so it is with us as regards\n\"Seeing\" and \"Feeling\".  None who in early life resort to \"Feeling\"\nwill ever learn \"Seeing\" in perfection.\n\nFor this reason, among our Higher Classes, \"Feeling\" is discouraged or\nabsolutely forbidden.  From the cradle their children, instead of going\nto the Public Elementary schools (where the art of Feeling is taught),\nare sent to higher Seminaries of an exclusive character; and at our\nillustrious University, to \"feel\" is regarded as a most serious fault,\ninvolving Rustication for the first offence, and Expulsion for the\nsecond.\n\nBut among the lower classes the art of Sight Recognition is regarded as\nan unattainable luxury.  A common Tradesman cannot afford to let his\nson spend a third of his life in abstract studies.  The children of the\npoor are therefore allowed to \"feel\" from their earliest years, and\nthey gain thereby a precocity and an early vivacity which contrast at\nfirst most favourably with the inert, undeveloped, and listless\nbehaviour of the half-instructed youths of the Polygonal class; but\nwhen the latter have at last completed their University course, and are\nprepared to put their theory into practice, the change that comes over\nthem may almost be described as a new birth, and in every art, science,\nand social pursuit they rapidly overtake and distance their Triangular\ncompetitors.\n\nOnly a few of the Polygonal Class fail to pass the Final Test or\nLeaving Examination at the University.  The condition of the\nunsuccessful minority is truly pitiable.  Rejected from the higher\nclass, they are also despised by the lower.  They have neither the\nmatured and systematically trained powers of the Polygonal Bachelors\nand Masters of Arts, nor yet the native precocity and mercurial\nversatility of the youthful Tradesman.  The professions, the public\nservices, are closed against them; and though in most States they are\nnot actually debarred from marriage, yet they have the greatest\ndifficulty in forming suitable alliances, as experience shews that the\noffspring of such unfortunate and ill-endowed parents is generally\nitself unfortunate, if not positively Irregular.\n\nIt is from these specimens of the refuse of our Nobility that the great\nTumults and Seditions of past ages have generally derived their\nleaders; and so great is the mischief thence arising that an increasing\nminority of our more progressive Statesmen are of opinion that true\nmercy would dictate their entire suppression, by enacting that all who\nfail to pass the Final Examination of the University should be either\nimprisoned for life, or extinguished by a painless death.\n\nBut I find myself digressing into the subject of Irregularities, a\nmatter of such vital interest that it demands a separate section.\n\n\n\n\nSection 7.  Concerning Irregular Figures\n\n\n\nThroughout the previous pages I have been assuming--what perhaps should\nhave been laid down at the beginning as a distinct and fundamental\nproposition--that every human being in Flatland is a Regular Figure,\nthat is to say of regular construction.  By this I mean that a Woman\nmust not only be a line, but a straight line; that an Artisan or\nSoldier must have two of his sides equal; that Tradesmen must have\nthree sides equal; Lawyers (of which class I am a humble member), four\nsides equal, and generally, that in every Polygon, all the sides must\nbe equal.\n\nThe size of the sides would of course depend upon the age of the\nindividual.  A Female at birth would be about an inch long, while a\ntall adult Woman might extend to a foot.  As to the Males of every\nclass, it may be roughly said that the length of an adult's sides, when\nadded together, is two feet or a little more.  But the size of our\nsides is not under consideration.  I am speaking of the EQUALITY of\nsides, and it does not need much reflection to see that the whole of\nthe social life in Flatland rests upon the fundamental fact that Nature\nwills all Figures to have their sides equal.\n\nIf our sides were unequal our angles might be unequal.  Instead of its\nbeing sufficient to feel, or estimate by sight, a single angle in order\nto determine the form of an individual, it would be necessary to\nascertain each angle by the experiment of Feeling.  But life would be\ntoo short for such a tedious grouping.  The whole science and art of\nSight Recognition would at once perish; Feeling, so far as it is an\nart, would not long survive; intercourse would become perilous or\nimpossible; there would be an end to all confidence, all forethought;\nno one would be safe in making the most simple social arrangements; in\na word, civilization would relapse into barbarism.\n\nAm I going too fast to carry my Readers with me to these obvious\nconclusions?  Surely a moment's reflection, and a single instance from\ncommon life, must convince every one that our whole social system is\nbased upon Regularity, or Equality of Angles.  You meet, for example,\ntwo or three Tradesmen in the street, whom you recognize at once to be\nTradesmen by a glance at their angles and rapidly bedimmed sides, and\nyou ask them to step into your house to lunch.  This you do at present\nwith perfect confidence, because everyone knows to an inch or two the\narea occupied by an adult Triangle:  but imagine that your Tradesman\ndrags behind his regular and respectable vertex, a parallelogram of\ntwelve or thirteen inches in diagonal:--what are you to do with such a\nmonster sticking fast in your house door?\n\nBut I am insulting the intelligence of my Readers by accumulating\ndetails which must be patent to everyone who enjoys the advantages of a\nResidence in Spaceland.  Obviously the measurements of a single angle\nwould no longer be sufficient under such portentous circumstances;\none's whole life would be taken up in feeling or surveying the\nperimeter of one's acquaintances.  Already the difficulties of avoiding\na collision in a crowd are enough to tax the sagacity of even a\nwell-educated Square; but if no one could calculate the Regularity of a\nsingle figure in the company, all would be chaos and confusion, and the\nslightest panic would cause serious injuries, or--if there happened to\nbe any Women or Soldiers present--perhaps considerable loss of life.\n\nExpediency therefore concurs with Nature in stamping the seal of its\napproval upon Regularity of conformation:  nor has the Law been\nbackward in seconding their efforts.  \"Irregularity of Figure\" means\nwith us the same as, or more than, a combination of moral obliquity and\ncriminality with you, and is treated accordingly.  There are not\nwanting, it is true, some promulgators of paradoxes who maintain that\nthere is no necessary connection between geometrical and moral\nIrregularity.  \"The Irregular\", they say, \"is from his birth scouted by\nhis own parents, derided by his brothers and sisters, neglected by the\ndomestics, scorned and suspected by society, and excluded from all\nposts of responsibility, trust, and useful activity.  His every\nmovement is jealously watched by the police till he comes of age and\npresents himself for inspection; then he is either destroyed, if he is\nfound to exceed the fixed margin of deviation, or else immured in a\nGovernment Office as a clerk of the seventh class; prevented from\nmarriage; forced to drudge at an uninteresting occupation for a\nmiserable stipend; obliged to live and board at the office, and to take\neven his vacation under close supervision; what wonder that human\nnature, even in the best and purest, is embittered and perverted by\nsuch surroundings!\"\n\nAll this very plausible reasoning does not convince me, as it has not\nconvinced the wisest of our Statesmen, that our ancestors erred in\nlaying it down as an axiom of policy that the toleration of\nIrregularity is incompatible with the safety of the State.  Doubtless,\nthe life of an Irregular is hard; but the interests of the Greater\nNumber require that it shall be hard.  If a man with a triangular front\nand a polygonal back were allowed to exist and to propagate a still\nmore Irregular posterity, what would become of the arts of life?  Are\nthe houses and doors and churches in Flatland to be altered in order to\naccommodate such monsters?  Are our ticket-collectors to be required to\nmeasure every man's perimeter before they allow him to enter a theatre\nor to take his place in a lecture room?  Is an Irregular to be exempted\nfrom the militia?  And if not, how is he to be prevented from carrying\ndesolation into the ranks of his comrades?  Again, what irresistible\ntemptations to fraudulent impostures must needs beset such a creature!\nHow easy for him to enter a shop with his polygonal front foremost, and\nto order goods to any extent from a confiding tradesman!  Let the\nadvocates of a falsely called Philanthropy plead as they may for the\nabrogation of the Irregular Penal Laws, I for my part have never known\nan Irregular who was not also what Nature evidently intended him to\nbe--a hypocrite, a misanthropist, and, up to the limits of his power, a\nperpetrator of all manner of mischief.\n\nNot that I should be disposed to recommend (at present) the extreme\nmeasures adopted by some States, where an infant whose angle deviates\nby half a degree from the correct angularity is summarily destroyed at\nbirth.  Some of our highest and ablest men, men of real genius, have\nduring their earliest days laboured under deviations as great as, or\neven greater than, forty-five minutes: and the loss of their precious\nlives would have been an irreparable injury to the State.  The art of\nhealing also has achieved some of its most glorious triumphs in the\ncompressions, extensions, trepannings, colligations, and other surgical\nor diaetetic operations by which Irregularity has been partly or wholly\ncured.  Advocating therefore a VIA MEDIA, I would lay down no fixed or\nabsolute line of demarcation; but at the period when the frame is just\nbeginning to set, and when the Medical Board has reported that recovery\nis improbable, I would suggest that the Irregular offspring be\npainlessly and mercifully consumed.\n\n\n\n\nSection 8.  Of the Ancient Practice of Painting\n\n\n\nIf my Readers have followed me with any attention up to this point,\nthey will not be surprised to hear that life is somewhat dull in\nFlatland.  I do not, of course, mean that there are not battles,\nconspiracies, tumults, factions, and all those other phenomena which\nare supposed to make History interesting; nor would I deny that the\nstrange mixture of the problems of life and the problems of\nMathematics, continually inducing conjecture and giving the opportunity\nof immediate verification, imparts to our existence a zest which you in\nSpaceland can hardly comprehend.  I speak now from the aesthetic and\nartistic point of view when I say that life with us is dull;\naesthetically and artistically, very dull indeed.\n\nHow can it be otherwise, when all one's prospect, all one's landscapes,\nhistorical pieces, portraits, flowers, still life, are nothing but a\nsingle line, with no varieties except degrees of brightness and\nobscurity?\n\nIt was not always thus.  Colour, if Tradition speaks the truth, once\nfor the space of half a dozen centuries or more, threw a transient\nsplendour over the lives of our ancestors in the remotest ages.  Some\nprivate individual--a Pentagon whose name is variously reported--having\ncasually discovered the constituents of the simpler colours and a\nrudimentary method of painting, is said to have begun decorating first\nhis house, then his slaves, then his Father, his Sons, and Grandsons,\nlastly himself.  The convenience as well as the beauty of the results\ncommended themselves to all.  Wherever Chromatistes,--for by that name\nthe most trustworthy authorities concur in calling him,--turned his\nvariegated frame, there he at once excited attention, and attracted\nrespect.  No one now needed to \"feel\" him; no one mistook his front for\nhis back; all his movements were readily ascertained by his neighbours\nwithout the slightest strain on their powers of calculation; no one\njostled him, or failed to make way for him; his voice was saved the\nlabour of that exhausting utterance by which we colourless Squares and\nPentagons are often forced to proclaim our individuality when we move\namid a crowd of ignorant Isosceles.\n\nThe fashion spread like wildfire.  Before a week was over, every Square\nand Triangle in the district had copied the example of Chromatistes,\nand only a few of the more conservative Pentagons still held out.  A\nmonth or two found even the Dodecagons infected with the innovation.  A\nyear had not elapsed before the habit had spread to all but the very\nhighest of the Nobility.  Needless to say, the custom soon made its way\nfrom the district of Chromatistes to surrounding regions; and within\ntwo generations no one in all Flatland was colourless except the Women\nand the Priests.\n\nHere Nature herself appeared to erect a barrier, and to plead against\nextending the innovation to these two classes.  Many-sidedness was\nalmost essential as a pretext for the Innovators.  \"Distinction of\nsides is intended by Nature to imply distinction of colours\"--such was\nthe sophism which in those days flew from mouth to mouth, converting\nwhole towns at a time to the new culture.  But manifestly to our\nPriests and Women this adage did not apply.  The latter had only one\nside, and therefore--plurally and pedantically speaking--NO SIDES.  The\nformer--if at least they would assert their claim to be really and\ntruly Circles, and not mere high-class Polygons with an infinitely\nlarge number of infinitesimally small sides--were in the habit of\nboasting (what Women confessed and deplored) that they also had no\nsides, being blessed with a perimeter of one line, or, in other words,\na Circumference.  Hence it came to pass that these two Classes could\nsee no force in the so-called axiom about \"Distinction of Sides\nimplying Distinction of Colour\"; and when all others had succumbed to\nthe fascinations of corporal decoration, the Priests and the Women\nalone still remained pure from the pollution of paint.\n\nImmoral, licentious, anarchical, unscientific--call them by what names\nyou will--yet, from an aesthetic point of view, those ancient days of\nthe Colour Revolt were the glorious childhood of Art in Flatland--a\nchildhood, alas, that never ripened into manhood, nor even reached the\nblossom of youth.  To live was then in itself a delight, because living\nimplied seeing.  Even at a small party, the company was a pleasure to\nbehold; the richly varied hues of the assembly in a church or theatre\nare said to have more than once proved too distracting for our greatest\nteachers and actors; but most ravishing of all is said to have been the\nunspeakable magnificence of a military review.\n\nThe sight of a line of battle of twenty thousand Isosceles suddenly\nfacing about, and exchanging the sombre black of their bases for the\norange and purple of the two sides including their acute angle; the\nmilitia of the Equilateral Triangles tricoloured in red, white, and\nblue; the mauve, ultra-marine, gamboge, and burnt umber of the Square\nartillerymen rapidly rotating near their vermilion guns; the dashing\nand flashing of the five-coloured and six-coloured Pentagons and\nHexagons careering across the field in their offices of surgeons,\ngeometricians and aides-de-camp--all these may well have been\nsufficient to render credible the famous story how an illustrious\nCircle, overcome by the artistic beauty of the forces under his\ncommand, threw aside his marshal's baton and his royal crown,\nexclaiming that he henceforth exchanged them for the artist's pencil.\nHow great and glorious the sensuous development of these days must have\nbeen is in part indicated by the very language and vocabulary of the\nperiod.  The commonest utterances of the commonest citizens in the time\nof the Colour Revolt seem to have been suffused with a richer tinge of\nword or thought; and to that era we are even now indebted for our\nfinest poetry and for whatever rhythm still remains in the more\nscientific utterance of these modern days.\n\n\n\n\nSection 9.  Of the Universal Colour Bill\n\n\n\nBut meanwhile the intellectual Arts were fast decaying.\n\nThe Art of Sight Recognition, being no longer needed, was no longer\npractised; and the studies of Geometry, Statics, Kinetics, and other\nkindred subjects, came soon to be considered superfluous, and fell into\ndisrespect and neglect even at our University.  The inferior Art of\nFeeling speedily experienced the same fate at our Elementary Schools.\nThen the Isosceles classes, asserting that the Specimens were no longer\nused nor needed, and refusing to pay the customary tribute from the\nCriminal classes to the service of Education, waxed daily more numerous\nand more insolent on the strength of their immunity from the old burden\nwhich had formerly exercised the twofold wholesome effect of at once\ntaming their brutal nature and thinning their excessive numbers.\n\nYear by year the Soldiers and Artisans began more vehemently to\nassert--and with increasing truth--that there was no great difference\nbetween them and the very highest class of Polygons, now that they were\nraised to an equality with the latter, and enabled to grapple with all\nthe difficulties and solve all the problems of life, whether Statical\nor Kinetical, by the simple process of Colour Recognition.  Not content\nwith the natural neglect into which Sight Recognition was falling, they\nbegan boldly to demand the legal prohibition of all \"monopolizing and\naristocratic Arts\" and the consequent abolition of all endowments for\nthe studies of Sight Recognition, Mathematics, and Feeling.  Soon, they\nbegan to insist that inasmuch as Colour, which was a second Nature, had\ndestroyed the need of aristocratic distinctions, the Law should follow\nin the same path, and that henceforth all individuals and all classes\nshould be recognized as absolutely equal and entitled to equal rights.\n\nFinding the higher Orders wavering and undecided, the leaders of the\nRevolution advanced still further in their requirements, and at last\ndemanded that all classes alike, the Priests and the Women not\nexcepted, should do homage to Colour by submitting to be painted.  When\nit was objected that Priests and Women had no sides, they retorted that\nNature and Expediency concurred in dictating that the front half of\nevery human being (that is to say, the half containing his eye and\nmouth) should be distinguishable from his hinder half.  They therefore\nbrought before a general and extraordinary Assembly of all the States\nof Flatland a Bill proposing that in every Woman the half containing\nthe eye and mouth should be coloured red, and the other half green.\nThe Priests were to be painted in the same way, red being applied to\nthat semicircle in which the eye and mouth formed the middle point;\nwhile the other or hinder semicircle was to be coloured green.\n\nThere was no little cunning in this proposal, which indeed emanated not\nfrom any Isosceles--for no being so degraded would have had angularity\nenough to appreciate, much less to devise, such a model of\nstate-craft--but from an Irregular Circle who, instead of being\ndestroyed in his childhood, was reserved by a foolish indulgence to\nbring desolation on his country and destruction on myriads of his\nfollowers.\n\nOn the one hand the proposition was calculated to bring the Women in\nall classes over to the side of the Chromatic Innovation.  For by\nassigning to the Women the same two colours as were assigned to the\nPriests, the Revolutionists thereby ensured that, in certain positions,\nevery Woman would appear like a Priest, and be treated with\ncorresponding respect and deference--a prospect that could not fail to\nattract the Female Sex in a mass.\n\nBut by some of my Readers the possibility of the identical appearance\nof Priests and Women, under the new Legislation, may not be recognized;\nif so, a word or two will make it obvious.\n\nImagine a woman duly decorated, according to the new Code; with the\nfront half (i.e. the half containing eye and mouth) red, and with the\nhinder half green.  Look at her from one side.  Obviously you will see\na straight line, HALF RED, HALF GREEN.\n\n\n[Illustration 5]\n\n[ASCII approximation follows]\n\n[for simplicity's sake, the circle is approximated as an octogon]\n\n\n          M\n        _____\n      /       \\ - C_\n    /           \\||   -  _\n   |             ||         -  _\n  A|- - - - - - -||B- - - - - -_-+(> (Eye)\n   |             ||      _  -\n    \\           /||_  -\n      \\ _____ / - D\n\n\nNow imagine a Priest, whose mouth is at M, and whose front semicircle\n(AMB) is consequently coloured red, while his hinder semicircle is\ngreen; so that the diameter AB divides the green from the red.  If you\ncontemplate the Great Man so as to have your eye in the same straight\nline as his dividing diameter (AB), what you will see will be a\nstraight line (CBD), of which ONE HALF (CB) WILL BE RED, AND THE OTHER\n(BD) GREEN.  The whole line (CD) will be rather shorter perhaps than\nthat of a full-sized Woman, and will shade off more rapidly towards its\nextremities; but the identity of the colours would give you an\nimmediate impression of identity of Class, making you neglectful of\nother details.  Bear in mind the decay of Sight Recognition which\nthreatened society at the time of the Colour Revolt; add too the\ncertainty that Women would speedily learn to shade off their\nextremities so as to imitate the Circles; it must then be surely\nobvious to you, my dear Reader, that the Colour Bill placed us under a\ngreat danger of confounding a Priest with a young Woman.\n\nHow attractive this prospect must have been to the Frail Sex may\nreadily be imagined.  They anticipated with delight the confusion that\nwould ensue.  At home they might hear political and ecclesiastical\nsecrets intended not for them but for their husbands and brothers, and\nmight even issue commands in the name of a priestly Circle; out of\ndoors the striking combination of red and green, without addition of\nany other colours, would be sure to lead the common people into endless\nmistakes, and the Women would gain whatever the Circles lost, in the\ndeference of the passers by.  As for the scandal that would befall the\nCircular Class if the frivolous and unseemly conduct of the Women were\nimputed to them, and as to the consequent subversion of the\nConstitution, the Female Sex could not be expected to give a thought to\nthese considerations.  Even in the households of the Circles, the Women\nwere all in favour of the Universal Colour Bill.\n\nThe second object aimed at by the Bill was the gradual demoralization\nof the Circles themselves.  In the general intellectual decay they\nstill preserved their pristine clearness and strength of understanding.\nFrom their earliest childhood, familiarized in their Circular\nhouseholds with the total absence of Colour, the Nobles alone preserved\nthe Sacred Art of Sight Recognition, with all the advantages that\nresult from that admirable training of the intellect.  Hence, up to the\ndate of the introduction of the Universal Colour Bill, the Circles had\nnot only held their own, but even increased their lead of the other\nclasses by abstinence from the popular fashion.\n\nNow therefore the artful Irregular whom I described above as the real\nauthor of this diabolical Bill, determined at one blow to lower the\nstatus of the Hierarchy by forcing them to submit to the pollution of\nColour, and at the same time to destroy their domestic opportunities of\ntraining in the Art of Sight Recognition, so as to enfeeble their\nintellects by depriving them of their pure and colourless homes.  Once\nsubjected to the chromatic taint, every parental and every childish\nCircle would demoralize each other.  Only in discerning between the\nFather and the Mother would the Circular infant find problems for the\nexercise of its understanding--problems too often likely to be\ncorrupted by maternal impostures with the result of shaking the child's\nfaith in all logical conclusions.  Thus by degrees the intellectual\nlustre of the Priestly Order would wane, and the road would then lie\nopen for a total destruction of all Aristocratic Legislature and for\nthe subversion of our Privileged Classes.\n\n\n\n\nSection 10.  Of the Suppression of the Chromatic Sedition\n\n\n\nThe agitation for the Universal Colour Bill continued for three years;\nand up to the last moment of that period it seemed as though Anarchy\nwere destined to triumph.\n\nA whole army of Polygons, who turned out to fight as private soldiers,\nwas utterly annihilated by a superior force of Isosceles Triangles--the\nSquares and Pentagons meanwhile remaining neutral.  Worse than all,\nsome of the ablest Circles fell a prey to conjugal fury.  Infuriated by\npolitical animosity, the wives in many a noble household wearied their\nlords with prayers to give up their opposition to the Colour Bill; and\nsome, finding their entreaties fruitless, fell on and slaughtered their\ninnocent children and husband, perishing themselves in the act of\ncarnage.  It is recorded that during that triennial agitation no less\nthan twenty-three Circles perished in domestic discord.\n\nGreat indeed was the peril.  It seemed as though the Priests had no\nchoice between submission and extermination; when suddenly the course\nof events was completely changed by one of those picturesque incidents\nwhich Statesmen ought never to neglect, often to anticipate, and\nsometimes perhaps to originate, because of the absurdly\ndisproportionate power with which they appeal to the sympathies of the\npopulace.\n\nIt happened that an Isosceles of a low type, with a brain little if at\nall above four degrees--accidentally dabbling in the colours of some\nTradesman whose shop he had plundered--painted himself, or caused\nhimself to be painted (for the story varies) with the twelve colours of\na Dodecagon.  Going into the Market Place he accosted in a feigned\nvoice a maiden, the orphan daughter of a noble Polygon, whose affection\nin former days he had sought in vain; and by a series of\ndeceptions--aided, on the one side, by a string of lucky accidents too\nlong to relate, and on the other, by an almost inconceivable fatuity\nand neglect of ordinary precautions on the part of the relations of the\nbride--he succeeded in consummating the marriage.  The unhappy girl\ncommitted suicide on discovering the fraud to which she had been\nsubjected.\n\nWhen the news of this catastrophe spread from State to State the minds\nof the Women were violently agitated.  Sympathy with the miserable\nvictim and anticipations of similar deceptions for themselves, their\nsisters, and their daughters, made them now regard the Colour Bill in\nan entirely new aspect.  Not a few openly avowed themselves converted\nto antagonism; the rest needed only a slight stimulus to make a similar\navowal.  Seizing this favourable opportunity, the Circles hastily\nconvened an extraordinary Assembly of the States; and besides the usual\nguard of Convicts, they secured the attendance of a large number of\nreactionary Women.\n\nAmidst an unprecedented concourse, the Chief Circle of those days--by\nname Pantocyclus--arose to find himself hissed and hooted by a hundred\nand twenty thousand Isosceles.  But he secured silence by declaring\nthat henceforth the Circles would enter on a policy of Concession;\nyielding to the wishes of the majority, they would accept the Colour\nBill.  The uproar being at once converted to applause, he invited\nChromatistes, the leader of the Sedition, into the centre of the hall,\nto receive in the name of his followers the submission of the\nHierarchy.  Then followed a speech, a masterpiece of rhetoric, which\noccupied nearly a day in the delivery, and to which no summary can do\njustice.\n\nWith a grave appearance of impartiality he declared that as they were\nnow finally committing themselves to Reform or Innovation, it was\ndesirable that they should take one last view of the perimeter of the\nwhole subject, its defects as well as its advantages.  Gradually\nintroducing the mention of the dangers to the Tradesmen, the\nProfessional Classes and the Gentlemen, he silenced the rising murmurs\nof the Isosceles by reminding them that, in spite of all these defects,\nhe was willing to accept the Bill if it was approved by the majority.\nBut it was manifest that all, except the Isosceles, were moved by his\nwords and were either neutral or averse to the Bill.\n\nTurning now to the Workmen he asserted that their interests must not be\nneglected, and that, if they intended to accept the Colour Bill, they\nought at least to do so with full view of the consequences.  Many of\nthem, he said, were on the point of being admitted to the class of the\nRegular Triangles; others anticipated for their children a distinction\nthey could not hope for themselves.  That honourable ambition would now\nhave to be sacrificed.  With the universal adoption of Colour, all\ndistinctions would cease; Regularity would be confused with\nIrregularity; development would give place to retrogression; the\nWorkman would in a few generations be degraded to the level of the\nMilitary, or even the Convict Class; political power would be in the\nhands of the greatest number, that is to say the Criminal Classes, who\nwere already more numerous than the Workmen, and would soon out-number\nall the other Classes put together when the usual Compensative Laws of\nNature were violated.\n\nA subdued murmur of assent ran through the ranks of the Artisans, and\nChromatistes, in alarm, attempted to step forward and address them.\nBut he found himself encompassed with guards and forced to remain\nsilent while the Chief Circle in a few impassioned words made a final\nappeal to the Women, exclaiming that, if the Colour Bill passed, no\nmarriage would henceforth be safe, no woman's honour secure; fraud,\ndeception, hypocrisy would pervade every household; domestic bliss\nwould share the fate of the Constitution and pass to speedy perdition.\n\"Sooner than this,\" he cried, \"Come death.\"\n\nAt these words, which were the preconcerted signal for action, the\nIsosceles Convicts fell on and transfixed the wretched Chromatistes;\nthe Regular Classes, opening their ranks, made way for a band of Women\nwho, under direction of the Circles, moved, back foremost, invisibly\nand unerringly upon the unconscious soldiers; the Artisans, imitating\nthe example of their betters, also opened their ranks.  Meantime bands\nof Convicts occupied every entrance with an impenetrable phalanx.\n\nThe battle, or rather carnage, was of short duration.  Under the\nskillful generalship of the Circles almost every Woman's charge was\nfatal and very many extracted their sting uninjured, ready for a second\nslaughter.  But no second blow was needed; the rabble of the Isosceles\ndid the rest of the business for themselves.  Surprised, leader-less,\nattacked in front by invisible foes, and finding egress cut off by the\nConvicts behind them, they at once--after their manner--lost all\npresence of mind, and raised the cry of \"treachery\".  This sealed their\nfate.  Every Isosceles now saw and felt a foe in every other.  In half\nan hour not one of that vast multitude was living; and the fragments of\nseven score thousand of the Criminal Class slain by one another's\nangles attested the triumph of Order.\n\nThe Circles delayed not to push their victory to the uttermost.  The\nWorking Men they spared but decimated.  The Militia of the Equilaterals\nwas at once called out; and every Triangle suspected of Irregularity on\nreasonable grounds, was destroyed by Court Martial, without the\nformality of exact measurement by the Social Board.  The homes of the\nMilitary and Artisan classes were inspected in a course of visitations\nextending through upwards of a year; and during that period every town,\nvillage, and hamlet was systematically purged of that excess of the\nlower orders which had been brought about by the neglect to pay the\ntribute of Criminals to the Schools and University, and by the\nviolation of the other natural Laws of the Constitution of Flatland.\nThus the balance of classes was again restored.\n\nNeedless to say that henceforth the use of Colour was abolished, and\nits possession prohibited.  Even the utterance of any word denoting\nColour, except by the Circles or by qualified scientific teachers, was\npunished by a severe penalty.  Only at our University in some of the\nvery highest and most esoteric classes--which I myself have never been\nprivileged to attend--it is understood that the sparing use of Colour\nis still sanctioned for the purpose of illustrating some of the deeper\nproblems of mathematics.  But of this I can only speak from hearsay.\n\nElsewhere in Flatland, Colour is now non-existent.  The art of making\nit is known to only one living person, the Chief Circle for the time\nbeing; and by him it is handed down on his death-bed to none but his\nSuccessor.  One manufactory alone produces it; and, lest the secret\nshould be betrayed, the Workmen are annually consumed, and fresh ones\nintroduced.  So great is the terror with which even now our Aristocracy\nlooks back to the far-distant days of the agitation for the Universal\nColour Bill.\n\n\n\n\nSection 11.  Concerning our Priests\n\n\n\nIt is high time that I should pass from these brief and discursive\nnotes about things in Flatland to the central event of this book, my\ninitiation into the mysteries of Space.  THAT is my subject; all that\nhas gone before is merely preface.\n\nFor this reason I must omit many matters of which the explanation would\nnot, I flatter myself, be without interest for my Readers: as for\nexample, our method of propelling and stopping ourselves, although\ndestitute of feet; the means by which we give fixity to structures of\nwood, stone, or brick, although of course we have no hands, nor can we\nlay foundations as you can, nor avail ourselves of the lateral pressure\nof the earth; the manner in which the rain originates in the intervals\nbetween our various zones, so that the northern regions do not\nintercept the moisture from falling on the southern; the nature of our\nhills and mines, our trees and vegetables, our seasons and harvests;\nour Alphabet and method of writing, adapted to our linear tablets;\nthese and a hundred other details of our physical existence I must pass\nover, nor do I mention them now except to indicate to my readers that\ntheir omission proceeds not from forgetfulness on the part of the\nauthor, but from his regard for the time of the Reader.\n\nYet before I proceed to my legitimate subject some few final remarks\nwill no doubt be expected by my Readers upon those pillars and\nmainstays of the Constitution of Flatland, the controllers of our\nconduct and shapers of our destiny, the objects of universal homage and\nalmost of adoration: need I say that I mean our Circles or Priests?\n\nWhen I call them Priests, let me not be understood as meaning no more\nthan the term denotes with you.  With us, our Priests are\nAdministrators of all Business, Art, and Science; Directors of Trade,\nCommerce, Generalship, Architecture, Engineering, Education,\nStatesmanship, Legislature, Morality, Theology; doing nothing\nthemselves, they are the Causes of everything worth doing, that is done\nby others.\n\nAlthough popularly everyone called a Circle is deemed a Circle, yet\namong the better educated Classes it is known that no Circle is really\na Circle, but only a Polygon with a very large number of very small\nsides.  As the number of the sides increases, a Polygon approximates to\na Circle; and, when the number is very great indeed, say for example\nthree or four hundred, it is extremely difficult for the most delicate\ntouch to feel any polygonal angles.  Let me say rather, it WOULD be\ndifficult: for, as I have shown above, Recognition by Feeling is\nunknown among the highest society, and to FEEL a Circle would be\nconsidered a most audacious insult.  This habit of abstention from\nFeeling in the best society enables a Circle the more easily to sustain\nthe veil of mystery in which, from his earliest years, he is wont to\nenwrap the exact nature of his Perimeter or Circumference.  Three feet\nbeing the average Perimeter it follows that, in a Polygon of three\nhundred sides each side will be no more than the hundredth part of a\nfoot in length, or little more than the tenth part of an inch; and in a\nPolygon of six or seven hundred sides the sides are little larger than\nthe diameter of a Spaceland pin-head.  It is always assumed, by\ncourtesy, that the Chief Circle for the time being has ten thousand\nsides.\n\nThe ascent of the posterity of the Circles in the social scale is not\nrestricted, as it is among the lower Regular classes, by the Law of\nNature which limits the increase of sides to one in each generation.\nIf it were so, the number of sides in a Circle would be a mere question\nof pedigree and arithmetic, and the four hundred and ninety-seventh\ndescendant of an Equilateral Triangle would necessarily be a Polygon\nwith five hundred sides.  But this is not the case.  Nature's Law\nprescribes two antagonistic decrees affecting Circular propagation;\nfirst, that as the race climbs higher in the scale of development, so\ndevelopment shall proceed at an accelerated pace; second, that in the\nsame proportion, the race shall become less fertile.  Consequently in\nthe home of a Polygon of four or five hundred sides it is rare to find\na son; more than one is never seen.  On the other hand the son of a\nfive-hundred-sided Polygon has been known to possess five hundred and\nfifty, or even six hundred sides.\n\nArt also steps in to help the process of the higher Evolution.  Our\nphysicians have discovered that the small and tender sides of an infant\nPolygon of the higher class can be fractured, and his whole frame\nre-set, with such exactness that a Polygon of two or three hundred\nsides sometimes--by no means always, for the process is attended with\nserious risk--but sometimes overleaps two or three hundred generations,\nand as it were doubles at a stroke, the number of his progenitors and\nthe nobility of his descent.\n\nMany a promising child is sacrificed in this way.  Scarcely one out of\nten survives.  Yet so strong is the parental ambition among those\nPolygons who are, as it were, on the fringe of the Circular class, that\nit is very rare to find a Nobleman of that position in society, who has\nneglected to place his first-born in the Circular Neo-Therapeutic\nGymnasium before he has attained the age of a month.\n\nOne year determines success or failure.  At the end of that time the\nchild has, in all probability, added one more to the tombstones that\ncrowd the Neo-Therapeutic Cemetery; but on rare occasions a glad\nprocession bears back the little one to his exultant parents, no longer\na Polygon, but a Circle, at least by courtesy: and a single instance of\nso blessed a result induces multitudes of Polygonal parents to submit\nto similar domestic sacrifices, which have a dissimilar issue.\n\n\n\n\nSection 12.  Of the Doctrine of our Priests\n\n\n\nAs to the doctrine of the Circles it may briefly be summed up in a\nsingle maxim, \"Attend to your Configuration.\"  Whether political,\necclesiastical, or moral, all their teaching has for its object the\nimprovement of individual and collective Configuration--with special\nreference of course to the Configuration of the Circles, to which all\nother objects are subordinated.\n\nIt is the merit of the Circles that they have effectually suppressed\nthose ancient heresies which led men to waste energy and sympathy in\nthe vain belief that conduct depends upon will, effort, training,\nencouragement, praise, or anything else but Configuration.  It was\nPantocyclus--the illustrious Circle mentioned above, as the queller of\nthe Colour Revolt--who first convinced mankind that Configuration makes\nthe man; that if, for example, you are born an Isosceles with two\nuneven sides, you will assuredly go wrong unless you have them made\neven--for which purpose you must go to the Isosceles Hospital;\nsimilarly, if you are a Triangle, or Square, or even a Polygon, born\nwith any Irregularity, you must be taken to one of the Regular\nHospitals to have your disease cured; otherwise you will end your days\nin the State Prison or by the angle of the State Executioner.\n\nAll faults or defects, from the slightest misconduct to the most\nflagitious crime, Pantocyclus attributed to some deviation from perfect\nRegularity in the bodily figure, caused perhaps (if not congenital) by\nsome collision in a crowd; by neglect to take exercise, or by taking\ntoo much of it; or even by a sudden change of temperature, resulting in\na shrinkage or expansion in some too susceptible part of the frame.\nTherefore, concluded that illustrious Philosopher, neither good conduct\nnor bad conduct is a fit subject, in any sober estimation, for either\npraise or blame.  For why should you praise, for example, the integrity\nof a Square who faithfully defends the interests of his client, when\nyou ought in reality rather to admire the exact precision of his right\nangles?  Or again, why blame a lying, thievish Isosceles when you ought\nrather to deplore the incurable inequality of his sides?\n\nTheoretically, this doctrine is unquestionable; but it has practical\ndrawbacks.  In dealing with an Isosceles, if a rascal pleads that he\ncannot help stealing because of his unevenness, you reply that for that\nvery reason, because he cannot help being a nuisance to his neighbours,\nyou, the Magistrate, cannot help sentencing him to be consumed--and\nthere's an end of the matter.  But in little domestic difficulties,\nwhere the penalty of consumption, or death, is out of the question,\nthis theory of Configuration sometimes comes in awkwardly; and I must\nconfess that occasionally when one of my own Hexagonal Grandsons pleads\nas an excuse for his disobedience that a sudden change of the\ntemperature has been too much for his Perimeter, and that I ought to\nlay the blame not on him but on his Configuration, which can only be\nstrengthened by abundance of the choicest sweetmeats, I neither see my\nway logically to reject, nor practically to accept, his conclusions.\n\nFor my own part, I find it best to assume that a good sound scolding or\ncastigation has some latent and strengthening influence on my\nGrandson's Configuration; though I own that I have no grounds for\nthinking so.  At all events I am not alone in my way of extricating\nmyself from this dilemma; for I find that many of the highest Circles,\nsitting as Judges in law courts, use praise and blame towards Regular\nand Irregular Figures; and in their homes I know by experience that,\nwhen scolding their children, they speak about \"right\" or \"wrong\" as\nvehemently and passionately as if they believed that these names\nrepresented real existences, and that a human Figure is really capable\nof choosing between them.\n\nConstantly carrying out their policy of making Configuration the\nleading idea in every mind, the Circles reverse the nature of that\nCommandment which in Spaceland regulates the relations between parents\nand children.  With you, children are taught to honour their parents;\nwith us--next to the Circles, who are the chief object of universal\nhomage--a man is taught to honour his Grandson, if he has one; or, if\nnot, his Son.  By \"honour\", however, is by no means meant \"indulgence\",\nbut a reverent regard for their highest interests:  and the Circles\nteach that the duty of fathers is to subordinate their own interests to\nthose of posterity, thereby advancing the welfare of the whole State as\nwell as that of their own immediate descendants.\n\nThe weak point in the system of the Circles--if a humble Square may\nventure to speak of anything Circular as containing any element of\nweakness--appears to me to be found in their relations with Women.\n\nAs it is of the utmost importance for Society that Irregular births\nshould be discouraged, it follows that no Woman who has any\nIrregularities in her ancestry is a fit partner for one who desires\nthat his posterity should rise by regular degrees in the social scale.\n\nNow the Irregularity of a Male is a matter of measurement; but as all\nWomen are straight, and therefore visibly Regular so to speak, one has\nto devise some other means of ascertaining what I may call their\ninvisible Irregularity, that is to say their potential Irregularities\nas regards possible offspring.  This is effected by carefully-kept\npedigrees, which are preserved and supervised by the State; and without\na certified pedigree no Woman is allowed to marry.\n\nNow it might have been supposed that a Circle--proud of his ancestry\nand regardful for a posterity which might possibly issue hereafter in a\nChief Circle--would be more careful than any other to choose a wife who\nhad no blot on her escutcheon.  But it is not so.  The care in choosing\na Regular wife appears to diminish as one rises in the social scale.\nNothing would induce an aspiring Isosceles, who had hopes of generating\nan Equilateral Son, to take a wife who reckoned a single Irregularity\namong her Ancestors; a Square or Pentagon, who is confident that his\nfamily is steadily on the rise, does not inquire above the\nfive-hundredth generation; a Hexagon or Dodecagon is even more careless\nof the wife's pedigree; but a Circle has been known deliberately to\ntake a wife who has had an Irregular Great-Grandfather, and all because\nof some slight superiority of lustre, or because of the charms of a low\nvoice--which, with us, even more than you, is thought \"an excellent\nthing in Woman\".\n\nSuch ill-judged marriages are, as might be expected, barren, if they do\nnot result in positive Irregularity or in diminution of sides; but none\nof these evils have hitherto proved sufficiently deterrent.  The loss\nof a few sides in a highly-developed Polygon is not easily noticed, and\nis sometimes compensated by a successful operation in the\nNeo-Therapeutic Gymnasium, as I have described above; and the Circles\nare too much disposed to acquiesce in infecundity as a Law of the\nsuperior development.  Yet, if this evil be not arrested, the gradual\ndiminution of the Circular class may soon become more rapid, and the\ntime may be not far distant when, the race being no longer able to\nproduce a Chief Circle, the Constitution of Flatland must fall.\n\nOne other word of warning suggests itself to me, though I cannot so\neasily mention a remedy; and this also refers to our relations with\nWomen.  About three hundred years ago, it was decreed by the Chief\nCircle that, since women are deficient in Reason but abundant in\nEmotion, they ought no longer to be treated as rational, nor receive\nany mental education.  The consequence was that they were no longer\ntaught to read, nor even to master Arithmetic enough to enable them to\ncount the angles of their husband or children; and hence they sensibly\ndeclined during each generation in intellectual power.  And this system\nof female non-education or quietism still prevails.\n\nMy fear is that, with the best intentions, this policy has been carried\nso far as to react injuriously on the Male Sex.\n\nFor the consequence is that, as things now are, we Males have to lead a\nkind of bi-lingual, and I may almost say bi-mental, existence.  With\nWomen, we speak of \"love\", \"duty\", \"right\", \"wrong\", \"pity\", \"hope\",\nand other irrational and emotional conceptions, which have no\nexistence, and the fiction of which has no object except to control\nfeminine exuberances; but among ourselves, and in our books, we have an\nentirely different vocabulary and I may almost say, idiom.  \"Love\" then\nbecomes \"the anticipation of benefits\"; \"duty\" becomes \"necessity\" or\n\"fitness\"; and other words are correspondingly transmuted.  Moreover,\namong Women, we use language implying the utmost deference for their\nSex; and they fully believe that the Chief Circle Himself is not more\ndevoutly adored by us than they are:  but behind their backs they are\nboth regarded and spoken of--by all except the very young--as being\nlittle better than \"mindless organisms\".\n\nOur Theology also in the Women's chambers is entirely different from\nour Theology elsewhere.\n\nNow my humble fear is that this double training, in language as well as\nin thought, imposes somewhat too heavy a burden upon the young,\nespecially when, at the age of three years old, they are taken from the\nmaternal care and taught to unlearn the old language--except for the\npurpose of repeating it in the presence of their Mothers and\nNurses--and to learn the vocabulary and idiom of science.  Already\nmethinks I discern a weakness in the grasp of mathematical truth at the\npresent time as compared with the more robust intellect of our\nancestors three hundred years ago.  I say nothing of the possible\ndanger if a Woman should ever surreptitiously learn to read and convey\nto her Sex the result of her perusal of a single popular volume; nor of\nthe possibility that the indiscretion or disobedience of some infant\nMale might reveal to a Mother the secrets of the logical dialect.  On\nthe simple ground of the enfeebling of the Male intellect, I rest this\nhumble appeal to the highest Authorities to reconsider the regulations\nof Female education.\n\n\n\n\n\n\nPART II:  OTHER WORLDS\n\n\"O brave new worlds, that have such people in them!\"\n\n\n\n\n\n\nSection 13.  How I had a Vision of Lineland\n\n\n\nIt was the last day but one of the 1999th year of our era, and the\nfirst day of the Long Vacation.  Having amused myself till a late hour\nwith my favourite recreation of Geometry, I had retired to rest with an\nunsolved problem in my mind.  In the night I had a dream.\n\nI saw before me a vast multitude of small Straight Lines (which I\nnaturally assumed to be Women) interspersed with other Beings still\nsmaller and of the nature of lustrous points--all moving to and fro in\none and the same Straight Line, and, as nearly as I could judge, with\nthe same velocity.\n\nA noise of confused, multitudinous chirping or twittering issued from\nthem at intervals as long as they were moving; but sometimes they\nceased from motion, and then all was silence.\n\nApproaching one of the largest of what I thought to be Women, I\naccosted her, but received no answer.  A second and a third appeal on\nmy part were equally ineffectual.  Losing patience at what appeared to\nme intolerable rudeness, I brought my mouth into a position full in\nfront of her mouth so as to intercept her motion, and loudly repeated\nmy question, \"Woman, what signifies this concourse, and this strange\nand confused chirping, and this monotonous motion to and fro in one and\nthe same Straight Line?\"\n\n\n[Illustration 6]\n\n[ASCII approximation follows]\n\n\n                           My view of Lineland\n\n                                ---------\n                                |       |\n                                | Myself|\n                                |       |\n                        My eye  o--------\n\n\n   Women  A boy       Men        The KING        Men       A boy  Women\n  + + + +   -   --- -- -- -- --  (>----<)  -- -- -- -- ---   -   + + + +\n                                  ^    ^\n                                The KING'S eyes\n                                much larger than the reality\n                                shewing that HIS MAJESTY\n                                could see nothing but a point.\n\n\n\"I am no Woman,\" replied the small Line.  \"I am the Monarch of the\nworld.  But thou, whence intrudest thou into my realm of Lineland?\"\nReceiving this abrupt reply, I begged pardon if I had in any way\nstartled or molested his Royal Highness; and describing myself as a\nstranger I besought the King to give me some account of his dominions.\nBut I had the greatest possible difficulty in obtaining any information\non points that really interested me; for the Monarch could not refrain\nfrom constantly assuming that whatever was familiar to him must also be\nknown to me and that I was simulating ignorance in jest.  However, by\npersevering questions I elicited the following facts:\n\nIt seemed that this poor ignorant Monarch--as he called himself--was\npersuaded that the Straight Line which he called his Kingdom, and in\nwhich he passed his existence, constituted the whole of the world, and\nindeed the whole of Space.  Not being able either to move or to see,\nsave in his Straight Line, he had no conception of anything out of it.\nThough he had heard my voice when I first addressed him, the sounds had\ncome to him in a manner so contrary to his experience that he had made\nno answer, \"seeing no man\", as he expressed it, \"and hearing a voice as\nit were from my own intestines.\"  Until the moment when I placed my\nmouth in his World, he had neither seen me, nor heard anything except\nconfused sounds beating against--what I called his side, but what he\ncalled his INSIDE or STOMACH; nor had he even now the least conception\nof the region from which I had come.  Outside his World, or Line, all\nwas a blank to him; nay, not even a blank, for a blank implies Space;\nsay, rather, all was non-existent.\n\nHis subjects--of whom the small Lines were men and the Points\nWomen--were all alike confined in motion and eye-sight to that single\nStraight Line, which was their World.  It need scarcely be added that\nthe whole of their horizon was limited to a Point; nor could any one\never see anything but a Point.  Man, woman, child, thing--each was a\nPoint to the eye of a Linelander.  Only by the sound of the voice could\nsex or age be distinguished.  Moreover, as each individual occupied the\nwhole of the narrow path, so to speak, which constituted his Universe,\nand no one could move to the right or left to make way for passers by,\nit followed that no Linelander could ever pass another.  Once\nneighbours, always neighbours.  Neighbourhood with them was like\nmarriage with us.  Neighbours remained neighbours till death did them\npart.\n\nSuch a life, with all vision limited to a Point, and all motion to a\nStraight Line, seemed to me inexpressibly dreary; and I was surprised\nto note the vivacity and cheerfulness of the King.  Wondering whether\nit was possible, amid circumstances so unfavourable to domestic\nrelations, to enjoy the pleasures of conjugal union, I hesitated for\nsome time to question his Royal Highness on so delicate a subject; but\nat last I plunged into it by abruptly inquiring as to the health of his\nfamily.  \"My wives and children,\" he replied, \"are well and happy.\"\n\nStaggered at this answer--for in the immediate proximity of the Monarch\n(as I had noted in my dream before I entered Lineland) there were none\nbut Men--I ventured to reply, \"Pardon me, but I cannot imagine how your\nRoyal Highness can at any time either see or approach their Majesties,\nwhen there are at least half a dozen intervening individuals, whom you\ncan neither see through, nor pass by?  Is it possible that in Lineland\nproximity is not necessary for marriage and for the generation of\nchildren?\"\n\n\"How can you ask so absurd a question?\" replied the Monarch.  \"If it\nwere indeed as you suggest, the Universe would soon be depopulated.\nNo, no; neighbourhood is needless for the union of hearts; and the\nbirth of children is too important a matter to have been allowed to\ndepend upon such an accident as proximity.  You cannot be ignorant of\nthis.  Yet since you are pleased to affect ignorance, I will instruct\nyou as if you were the veriest baby in Lineland.  Know, then, that\nmarriages are consummated by means of the faculty of sound and the\nsense of hearing.\n\n\"You are of course aware that every Man has two mouths or voices--as\nwell as two eyes--a bass at one and a tenor at the other of his\nextremities.  I should not mention this, but that I have been unable to\ndistinguish your tenor in the course of our conversation.\" I replied\nthat I had but one voice, and that I had not been aware that his Royal\nHighness had two.  \"That confirms my impression,\" said the King, \"that\nyou are not a Man, but a feminine Monstrosity with a bass voice, and an\nutterly uneducated ear.  But to continue.\n\n\"Nature having herself ordained that every Man should wed two wives--\"\n\"Why two?\" asked I.  \"You carry your affected simplicity too far\", he\ncried.  \"How can there be a completely harmonious union without the\ncombination of the Four in One, viz. the Bass and Tenor of the Man and\nthe Soprano and Contralto of the two Women?\" \"But supposing,\" said I,\n\"that a man should prefer one wife or three?\" \"It is impossible,\" he\nsaid; \"it is as inconceivable as that two and one should make five, or\nthat the human eye should see a Straight Line.\"  I would have\ninterrupted him; but he proceeded as follows:\n\n\"Once in the middle of each week a Law of Nature compels us to move to\nand fro with a rhythmic motion of more than usual violence, which\ncontinues for the time you would take to count a hundred and one.  In\nthe midst of this choral dance, at the fifty-first pulsation, the\ninhabitants of the Universe pause in full career, and each individual\nsends forth his richest, fullest, sweetest strain.  It is in this\ndecisive moment that all our marriages are made.  So exquisite is the\nadaptation of Bass to Treble, of Tenor to Contralto, that oftentimes\nthe Loved Ones, though twenty thousand leagues away, recognize at once\nthe responsive note of their destined Lover; and, penetrating the\npaltry obstacles of distance, Love unites the three.  The marriage in\nthat instant consummated results in a threefold Male and Female\noffspring which takes its place in Lineland.\"\n\n\"What!  Always threefold?\" said I.  \"Must one wife then always have\ntwins?\"\n\n\"Bass-voiced Monstrosity! yes,\" replied the King.  \"How else could the\nbalance of the Sexes be maintained, if two girls were not born for\nevery boy?  Would you ignore the very Alphabet of Nature?\" He ceased,\nspeechless for fury; and some time elapsed before I could induce him to\nresume his narrative.\n\n\"You will not, of course, suppose that every bachelor among us finds\nhis mates at the first wooing in this universal Marriage Chorus.  On\nthe contrary, the process is by most of us many times repeated.  Few\nare the hearts whose happy lot it is at once to recognize in each\nother's voices the partner intended for them by Providence, and to fly\ninto a reciprocal and perfectly harmonious embrace.  With most of us\nthe courtship is of long duration.  The Wooer's voices may perhaps\naccord with one of the future wives, but not with both; or not, at\nfirst, with either; or the Soprano and Contralto may not quite\nharmonize.  In such cases Nature has provided that every weekly Chorus\nshall bring the three Lovers into closer harmony.  Each trial of voice,\neach fresh discovery of discord, almost imperceptibly induces the less\nperfect to modify his or her vocal utterance so as to approximate to\nthe more perfect.  And after many trials and many approximations, the\nresult is at last achieved.  There comes a day at last, when, while the\nwonted Marriage Chorus goes forth from universal Lineland, the three\nfar-off Lovers suddenly find themselves in exact harmony, and, before\nthey are awake, the wedded Triplet is rapt vocally into a duplicate\nembrace; and Nature rejoices over one more marriage and over three more\nbirths.\"\n\n\n\n\nSection 14.  How I vainly tried to explain the nature of Flatland\n\n\n\nThinking that it was time to bring down the Monarch from his raptures\nto the level of common sense, I determined to endeavour to open up to\nhim some glimpses of the truth, that is to say of the nature of things\nin Flatland.  So I began thus: \"How does your Royal Highness\ndistinguish the shapes and positions of his subjects?  I for my part\nnoticed by the sense of sight, before I entered your Kingdom, that some\nof your people are Lines and others Points, and that some of the Lines\nare larger--\" \"You speak of an impossibility,\" interrupted the King;\n\"you must have seen a vision; for to detect the difference between a\nLine and a Point by the sense of sight is, as every one knows, in the\nnature of things, impossible; but it can be detected by the sense of\nhearing, and by the same means my shape can be exactly ascertained.\nBehold me--I am a Line, the longest in Lineland, over six inches of\nSpace--\"  \"Of Length\", I ventured to suggest.  \"Fool,\" said he, \"Space\nis Length.  Interrupt me again, and I have done.\"\n\nI apologized; but he continued scornfully, \"Since you are impervious to\nargument, you shall hear with your ears how by means of my two voices I\nreveal my shape to my Wives, who are at this moment six thousand miles\nseventy yards two feet eight inches away, the one to the North, the\nother to the South.  Listen, I call to them.\"\n\nHe chirruped, and then complacently continued:  \"My wives at this\nmoment receiving the sound of one of my voices, closely followed by the\nother, and perceiving that the latter reaches them after an interval in\nwhich sound can traverse 6.457 inches, infer that one of my mouths is\n6.457 inches further from them than the other, and accordingly know my\nshape to be 6.457 inches.  But you will of course understand that my\nwives do not make this calculation every time they hear my two voices.\nThey made it, once for all, before we were married.  But they COULD\nmake it at any time.  And in the same way I can estimate the shape of\nany of my Male subjects by the sense of sound.\"\n\n\"But how,\" said I, \"if a Man feigns a Woman's voice with one of his two\nvoices, or so disguises his Southern voice that it cannot be recognized\nas the echo of the Northern?  May not such deceptions cause great\ninconvenience?  And have you no means of checking frauds of this kind\nby commanding your neighbouring subjects to feel one another?\"  This of\ncourse was a very stupid question, for feeling could not have answered\nthe purpose; but I asked with the view of irritating the Monarch, and I\nsucceeded perfectly.\n\n\"What!\" cried he in horror, \"explain your meaning.\"  \"Feel, touch, come\ninto contact,\" I replied.  \"If you mean by FEELING,\" said the King,\n\"approaching so close as to leave no space between two individuals,\nknow, Stranger, that this offence is punishable in my dominions by\ndeath.  And the reason is obvious.  The frail form of a Woman, being\nliable to be shattered by such an approximation, must be preserved by\nthe State; but since Women cannot be distinguished by the sense of\nsight from Men, the Law ordains universally that neither Man nor Woman\nshall be approached so closely as to destroy the interval between the\napproximator and the approximated.\n\n\"And indeed what possible purpose would be served by this illegal and\nunnatural excess of approximation which you call TOUCHING, when all the\nends of so brutal and coarse a process are attained at once more easily\nand more exactly by the sense of hearing?  As to your suggested danger\nof deception, it is non-existent: for the Voice, being the essence of\none's Being, cannot be thus changed at will.  But come, suppose that I\nhad the power of passing through solid things, so that I could\npenetrate my subjects, one after another, even to the number of a\nbillion, verifying the size and distance of each by the sense of\nFEELING:  how much time and energy would be wasted in this clumsy and\ninaccurate method!  Whereas now, in one moment of audition, I take as\nit were the census and statistics, local, corporeal, mental and\nspiritual, of every living being in Lineland.  Hark, only hark!\"\n\nSo saying he paused and listened, as if in an ecstasy, to a sound which\nseemed to me no better than a tiny chirping from an innumerable\nmultitude of lilliputian grasshoppers.\n\n\"Truly,\" replied I, \"your sense of hearing serves you in good stead,\nand fills up many of your deficiencies.  But permit me to point out\nthat your life in Lineland must be deplorably dull.  To see nothing but\na Point!  Not even to be able to contemplate a Straight Line!  Nay, not\neven to know what a Straight Line is!  To see, yet be cut off from\nthose Linear prospects which are vouchsafed to us in Flatland!  Better\nsurely to have no sense of sight at all than to see so little!  I grant\nyou I have not your discriminative faculty of hearing; for the concert\nof all Lineland which gives you such intense pleasure, is to me no\nbetter than a multitudinous twittering or chirping.  But at least I can\ndiscern, by sight, a Line from a Point.  And let me prove it.  Just\nbefore I came into your kingdom, I saw you dancing from left to right,\nand then from right to left, with Seven Men and a Woman in your\nimmediate proximity on the left, and eight Men and two Women on your\nright.  Is not this correct?\"\n\n\"It is correct,\" said the King, \"so far as the numbers and sexes are\nconcerned, though I know not what you mean by 'right' and 'left'.  But\nI deny that you saw these things.  For how could you see the Line, that\nis to say the inside, of any Man?  But you must have heard these\nthings, and then dreamed that you saw them.  And let me ask what you\nmean by those words 'left' and 'right'.  I suppose it is your way of\nsaying Northward and Southward.\"\n\n\"Not so,\" replied I; \"besides your motion of Northward and Southward,\nthere is another motion which I call from right to left.\"\n\nKING.  Exhibit to me, if you please, this motion from left to right.\n\nI.  Nay, that I cannot do, unless you could step out of your Line\naltogether.\n\nKING.  Out of my Line?  Do you mean out of the world?  Out of Space?\n\nI.  Well, yes.  Out of YOUR World.  Out of YOUR Space.  For your Space\nis not the true Space.  True Space is a Plane; but your Space is only a\nLine.\n\nKING.  If you cannot indicate this motion from left to right by\nyourself moving in it, then I beg you to describe it to me in words.\n\nI.  If you cannot tell your right side from your left, I fear that no\nwords of mine can make my meaning clear to you.  But surely you cannot\nbe ignorant of so simple a distinction.\n\nKING.  I do not in the least understand you.\n\nI.  Alas!  How shall I make it clear?  When you move straight on, does\nit not sometimes occur to you that you COULD move in some other way,\nturning your eye round so as to look in the direction towards which\nyour side is now fronting?  In other words, instead of always moving in\nthe direction of one of your extremities, do you never feel a desire to\nmove in the direction, so to speak, of your side?\n\nKING.  Never.  And what do you mean?  How can a man's inside \"front\" in\nany direction?  Or how can a man move in the direction of his inside?\n\nI.  Well then, since words cannot explain the matter, I will try deeds,\nand will move gradually out of Lineland in the direction which I desire\nto indicate to you.\n\nAt the word I began to move my body out of Lineland.  As long as any\npart of me remained in his dominion and in his view, the King kept\nexclaiming, \"I see you, I see you still; you are not moving.\"  But when\nI had at last moved myself out of his Line, he cried in his shrillest\nvoice, \"She is vanished; she is dead.\"  \"I am not dead,\" replied I; \"I\nam simply out of Lineland, that is to say, out of the Straight Line\nwhich you call Space, and in the true Space, where I can see things as\nthey are.  And at this moment I can see your Line, or side--or inside\nas you are pleased to call it; and I can see also the Men and Women on\nthe North and South of you, whom I will now enumerate, describing their\norder, their size, and the interval between each.\"\n\n\n[Illustration 7]\n\n[ASCII approximation follows]\n\n\n            My body just before I disappeared\n                      +---------+\n                      |\\ \\ \\ \\ \\|\n                      |\\ \\ \\ \\ \\|\n                      |\\ \\ \\ \\ \\|\n  Lineland ---->      |\\ \\ \\ \\ \\|              The King\n  --------------------+---------+--------------========\n\n\nWhen I had done this at great length, I cried triumphantly, \"Does that\nat last convince you?\"  And, with that, I once more entered Lineland,\ntaking up the same position as before.\n\nBut the Monarch replied, \"If you were a Man of sense--though, as you\nappear to have only one voice I have little doubt you are not a Man but\na Woman--but, if you had a particle of sense, you would listen to\nreason.  You ask me to believe that there is another Line besides that\nwhich my senses indicate, and another motion besides that of which I am\ndaily conscious.  I, in return, ask you to describe in words or\nindicate by motion that other Line of which you speak.  Instead of\nmoving, you merely exercise some magic art of vanishing and returning\nto sight; and instead of any lucid description of your new World, you\nsimply tell me the numbers and sizes of some forty of my retinue, facts\nknown to any child in my capital.  Can anything be more irrational or\naudacious?  Acknowledge your folly or depart from my dominions.\"\n\nFurious at his perversity, and especially indignant that he professed\nto be ignorant of my sex, I retorted in no measured terms, \"Besotted\nBeing!  You think yourself the perfection of existence, while you are\nin reality the most imperfect and imbecile.  You profess to see,\nwhereas you can see nothing but a Point!  You plume yourself on\ninferring the existence of a Straight Line; but I CAN SEE Straight\nLines, and infer the existence of Angles, Triangles, Squares,\nPentagons, Hexagons, and even Circles.  Why waste more words?  Suffice\nit that I am the completion of your incomplete self.  You are a Line,\nbut I am a Line of Lines, called in my country a Square:  and even I,\ninfinitely superior though I am to you, am of little account among the\ngreat nobles of Flatland, whence I have come to visit you, in the hope\nof enlightening your ignorance.\"\n\nHearing these words the King advanced towards me with a menacing cry as\nif to pierce me through the diagonal; and in that same moment there\narose from myriads of his subjects a multitudinous war-cry, increasing\nin vehemence till at last methought it rivalled the roar of an army of\na hundred thousand Isosceles, and the artillery of a thousand\nPentagons.  Spell-bound and motionless, I could neither speak nor move\nto avert the impending destruction; and still the noise grew louder,\nand the King came closer, when I awoke to find the breakfast-bell\nrecalling me to the realities of Flatland.\n\n\n\n\nSection 15.  Concerning a Stranger from Spaceland\n\n\n\nFrom dreams I proceed to facts.\n\nIt was the last day of the 1999th year of our era.  The pattering of\nthe rain had long ago announced nightfall; and I was sitting in the\ncompany of my wife, musing on the events of the past and the prospects\nof the coming year, the coming century, the coming Millennium.\n\n[Note:  When I say \"sitting\", of course I do not mean any change of\nattitude such as you in Spaceland signify by that word; for as we have\nno feet, we can no more \"sit\" nor \"stand\" (in your sense of the word)\nthan one of your soles or flounders.\n\nNevertheless, we perfectly well recognize the different mental states\nof volition implied in \"lying\", \"sitting\", and \"standing\", which are to\nsome extent indicated to a beholder by a slight increase of lustre\ncorresponding to the increase of volition.\n\nBut on this, and a thousand other kindred subjects, time forbids me to\ndwell.]\n\nMy four Sons and two orphan Grandchildren had retired to their several\napartments; and my wife alone remained with me to see the old\nMillennium out and the new one in.\n\nI was rapt in thought, pondering in my mind some words that had\ncasually issued from the mouth of my youngest Grandson, a most\npromising young Hexagon of unusual brilliancy and perfect angularity.\nHis uncles and I had been giving him his usual practical lesson in\nSight Recognition, turning ourselves upon our centres, now rapidly, now\nmore slowly, and questioning him as to our positions; and his answers\nhad been so satisfactory that I had been induced to reward him by\ngiving him a few hints on Arithmetic, as applied to Geometry.\n\nTaking nine Squares, each an inch every way, I had put them together so\nas to make one large Square, with a side of three inches, and I had\nhence proved to my little Grandson that--though it was impossible for\nus to SEE the inside of the Square--yet we might ascertain the number\nof square inches in a Square by simply squaring the number of inches in\nthe side:  \"and thus,\" said I, \"we know that 3^2, or 9, represents the\nnumber of square inches in a Square whose side is 3 inches long.\"\n\nThe little Hexagon meditated on this a while and then said to me; \"But\nyou have been teaching me to raise numbers to the third power: I\nsuppose 3^3 must mean something in Geometry; what does it mean?\"\n\"Nothing at all,\" replied I, \"not at least in Geometry; for Geometry\nhas only Two Dimensions.\"  And then I began to shew the boy how a Point\nby moving through a length of three inches makes a Line of three\ninches, which may be represented by 3; and how a Line of three inches,\nmoving parallel to itself through a length of three inches, makes a\nSquare of three inches every way, which may be represented by 3^2.\n\nUpon this, my Grandson, again returning to his former suggestion, took\nme up rather suddenly and exclaimed, \"Well, then, if a Point by moving\nthree inches, makes a Line of three inches represented by 3; and if a\nstraight Line of three inches, moving parallel to itself, makes a\nSquare of three inches every way, represented by 3^2; it must be that a\nSquare of three inches every way, moving somehow parallel to itself\n(but I don't see how) must make Something else (but I don't see what)\nof three inches every way--and this must be represented by 3^3.\"\n\n\"Go to bed,\" said I, a little ruffled by this interruption: \"if you\nwould talk less nonsense, you would remember more sense.\"\n\nSo my Grandson had disappeared in disgrace; and there I sat by my\nWife's side, endeavouring to form a retrospect of the year 1999 and of\nthe possibilities of the year 2000, but not quite able to shake off the\nthoughts suggested by the prattle of my bright little Hexagon.  Only a\nfew sands now remained in the half-hour glass.  Rousing myself from my\nreverie I turned the glass Northward for the last time in the old\nMillennium; and in the act, I exclaimed aloud, \"The boy is a fool.\"\n\nStraightway I became conscious of a Presence in the room, and a\nchilling breath thrilled through my very being.  \"He is no such thing,\"\ncried my Wife, \"and you are breaking the Commandments in thus\ndishonouring your own Grandson.\" But I took no notice of her.  Looking\nround in every direction I could see nothing; yet still I FELT a\nPresence, and shivered as the cold whisper came again.  I started up.\n\"What is the matter?\" said my Wife, \"there is no draught; what are you\nlooking for?  There is nothing.\"  There was nothing; and I resumed my\nseat, again exclaiming, \"The boy is a fool, I say; 3^3 can have no\nmeaning in Geometry.\"  At once there came a distinctly audible reply,\n\"The boy is not a fool; and 3^3 has an obvious Geometrical meaning.\"\n\nMy Wife as well as myself heard the words, although she did not\nunderstand their meaning, and both of us sprang forward in the\ndirection of the sound.  What was our horror when we saw before us a\nFigure!  At the first glance it appeared to be a Woman, seen sideways;\nbut a moment's observation shewed me that the extremities passed into\ndimness too rapidly to represent one of the Female Sex; and I should\nhave thought it a Circle, only that it seemed to change its size in a\nmanner impossible for a Circle or for any regular Figure of which I had\nhad experience.\n\nBut my Wife had not my experience, nor the coolness necessary to note\nthese characteristics.  With the usual hastiness and unreasoning\njealousy of her Sex, she flew at once to the conclusion that a Woman\nhad entered the house through some small aperture.  \"How comes this\nperson here?\" she exclaimed, \"you promised me, my dear, that there\nshould be no ventilators in our new house.\" \"Nor are there any,\" said\nI; \"but what makes you think that the stranger is a Woman?  I see by my\npower of Sight Recognition----\" \"Oh, I have no patience with your Sight\nRecognition,\" replied she, \"'Feeling is believing' and 'A Straight Line\nto the touch is worth a Circle to the sight'\"--two Proverbs, very\ncommon with the Frailer Sex in Flatland.\n\n\"Well,\" said I, for I was afraid of irritating her, \"if it must be so,\ndemand an introduction.\"  Assuming her most gracious manner, my Wife\nadvanced towards the Stranger, \"Permit me, Madam, to feel and be felt\nby----\" then, suddenly recoiling, \"Oh!  it is not a Woman, and there\nare no angles either, not a trace of one.  Can it be that I have so\nmisbehaved to a perfect Circle?\"\n\n\"I am indeed, in a certain sense a Circle,\" replied the Voice, \"and a\nmore perfect Circle than any in Flatland; but to speak more accurately,\nI am many Circles in one.\"  Then he added more mildly, \"I have a\nmessage, dear Madam, to your husband, which I must not deliver in your\npresence; and, if you would suffer us to retire for a few minutes----\"\nBut my Wife would not listen to the proposal that our august Visitor\nshould so incommode himself, and assuring the Circle that the hour of\nher own retirement had long passed, with many reiterated apologies for\nher recent indiscretion, she at last retreated to her apartment.\n\nI glanced at the half-hour glass.  The last sands had fallen.  The\nthird Millennium had begun.\n\n\n\n\nSection 16.  How the Stranger vainly endeavoured to reveal to me\n               in words the mysteries of Spaceland\n\n\n\nAs soon as the sound of the Peace-cry of my departing Wife had died\naway, I began to approach the Stranger with the intention of taking a\nnearer view and of bidding him be seated: but his appearance struck me\ndumb and motionless with astonishment.  Without the slightest symptoms\nof angularity he nevertheless varied every instant with gradations of\nsize and brightness scarcely possible for any Figure within the scope\nof my experience.  The thought flashed across me that I might have\nbefore me a burglar or cut-throat, some monstrous Irregular Isosceles,\nwho, by feigning the voice of a Circle, had obtained admission somehow\ninto the house, and was now preparing to stab me with his acute angle.\n\nIn a sitting-room, the absence of Fog (and the season happened to be\nremarkably dry), made it difficult for me to trust to Sight\nRecognition, especially at the short distance at which I was standing.\nDesperate with fear, I rushed forward with an unceremonious, \"You must\npermit me, Sir--\" and felt him.  My Wife was right.  There was not the\ntrace of an angle, not the slightest roughness or inequality:  never in\nmy life had I met with a more perfect Circle.  He remained motionless\nwhile I walked round him, beginning from his eye and returning to it\nagain.  Circular he was throughout, a perfectly satisfactory Circle;\nthere could not be a doubt of it.  Then followed a dialogue, which I\nwill endeavour to set down as near as I can recollect it, omitting only\nsome of my profuse apologies--for I was covered with shame and\nhumiliation that I, a Square, should have been guilty of the\nimpertinence of feeling a Circle.  It was commenced by the Stranger\nwith some impatience at the lengthiness of my introductory process.\n\nSTRANGER.  Have you felt me enough by this time?  Are you not\nintroduced to me yet?\n\nI.  Most illustrious Sir, excuse my awkwardness, which arises not from\nignorance of the usages of polite society, but from a little surprise\nand nervousness, consequent on this somewhat unexpected visit.  And I\nbeseech you to reveal my indiscretion to no one, and especially not to\nmy Wife.  But before your Lordship enters into further communications,\nwould he deign to satisfy the curiosity of one who would gladly know\nwhence his Visitor came?\n\nSTRANGER.  From Space, from Space, Sir:  whence else?\n\nI.  Pardon me, my Lord, but is not your Lordship already in Space, your\nLordship and his humble servant, even at this moment?\n\nSTRANGER.  Pooh! what do you know of Space?  Define Space.\n\nI.  Space, my Lord, is height and breadth indefinitely prolonged.\n\nSTRANGER.  Exactly:  you see you do not even know what Space is.  You\nthink it is of Two Dimensions only; but I have come to announce to you\na Third--height, breadth, and length.\n\nI.  Your Lordship is pleased to be merry.  We also speak of length and\nheight, or breadth and thickness, thus denoting Two Dimensions by four\nnames.\n\nSTRANGER.  But I mean not only three names, but Three Dimensions.\n\nI.  Would your Lordship indicate or explain to me in what direction is\nthe Third Dimension, unknown to me?\n\nSTRANGER.  I came from it.  It is up above and down below.\n\nI.  My Lord means seemingly that it is Northward and Southward.\n\nSTRANGER.  I mean nothing of the kind.  I mean a direction in which you\ncannot look, because you have no eye in your side.\n\nI.  Pardon me, my Lord, a moment's inspection will convince your\nLordship that I have a perfect luminary at the juncture of two of my\nsides.\n\nSTRANGER.  Yes:  but in order to see into Space you ought to have an\neye, not on your Perimeter, but on your side, that is, on what you\nwould probably call your inside; but we in Spaceland should call it\nyour side.\n\nI.  An eye in my inside!  An eye in my stomach!  Your Lordship jests.\n\nSTRANGER.  I am in no jesting humour.  I tell you that I come from\nSpace, or, since you will not understand what Space means, from the\nLand of Three Dimensions whence I but lately looked down upon your\nPlane which you call Space forsooth.  From that position of advantage I\ndiscerned all that you speak of as SOLID (by which you mean \"enclosed\non four sides\"), your houses, your churches, your very chests and\nsafes, yes even your insides and stomachs, all lying open and exposed\nto my view.\n\nI.  Such assertions are easily made, my Lord.\n\nSTRANGER.  But not easily proved, you mean.  But I mean to prove mine.\n\nWhen I descended here, I saw your four Sons, the Pentagons, each in his\napartment, and your two Grandsons the Hexagons; I saw your youngest\nHexagon remain a while with you and then retire to his room, leaving\nyou and your Wife alone.  I saw your Isosceles servants, three in\nnumber, in the kitchen at supper, and the little Page in the scullery.\nThen I came here, and how do you think I came?\n\nI.  Through the roof, I suppose.\n\nSTRANGER.  Not so.  Your roof, as you know very well, has been recently\nrepaired, and has no aperture by which even a Woman could penetrate.  I\ntell you I come from Space.  Are you not convinced by what I have told\nyou of your children and household?\n\nI.  Your Lordship must be aware that such facts touching the belongings\nof his humble servant might be easily ascertained by any one in the\nneighbourhood possessing your Lordship's ample means of obtaining\ninformation.\n\nSTRANGER.  (TO HIMSELF.)  What must I do?  Stay; one more argument\nsuggests itself to me.  When you see a Straight Line--your wife, for\nexample--how many Dimensions do you attribute to her?\n\nI.  Your Lordship would treat me as if I were one of the vulgar who,\nbeing ignorant of Mathematics, suppose that a Woman is really a\nStraight Line, and only of One Dimension.  No, no, my Lord; we Squares\nare better advised, and are as well aware as your Lordship that a\nWoman, though popularly called a Straight Line, is, really and\nscientifically, a very thin Parallelogram, possessing Two Dimensions,\nlike the rest of us, viz., length and breadth (or thickness).\n\nSTRANGER.  But the very fact that a Line is visible implies that it\npossesses yet another Dimension.\n\nI.  My Lord, I have just acknowledged that a Woman is broad as well as\nlong.  We see her length, we infer her breadth; which, though very\nslight, is capable of measurement.\n\nSTRANGER.  You do not understand me.  I mean that when you see a Woman,\nyou ought--besides inferring her breadth--to see her length, and to SEE\nwhat we call her HEIGHT; although that last Dimension is infinitesimal\nin your country.  If a Line were mere length without \"height\", it would\ncease to occupy Space and would become invisible.  Surely you must\nrecognize this?\n\nI.  I must indeed confess that I do not in the least understand your\nLordship.  When we in Flatland see a Line, we see length and\nBRIGHTNESS.  If the brightness disappears, the Line is extinguished,\nand, as you say, ceases to occupy Space.  But am I to suppose that your\nLordship gives to brightness the title of a Dimension, and that what we\ncall \"bright\" you call \"high\"?\n\nSTRANGER.  No, indeed.  By \"height\" I mean a Dimension like your\nlength:  only, with you, \"height\" is not so easily perceptible, being\nextremely small.\n\nI.  My Lord, your assertion is easily put to the test.  You say I have\na Third Dimension, which you call \"height\".  Now, Dimension implies\ndirection and measurement.  Do but measure my \"height\", or merely\nindicate to me the direction in which my \"height\" extends, and I will\nbecome your convert.  Otherwise, your Lordship's own understanding must\nhold me excused.\n\nSTRANGER.  (TO HIMSELF.)  I can do neither.  How shall I convince him?\nSurely a plain statement of facts followed by ocular demonstration\nought to suffice. --Now, Sir; listen to me.\n\nYou are living on a Plane.  What you style Flatland is the vast level\nsurface of what I may call a fluid, on, or in, the top of which you and\nyour countrymen move about, without rising above it or falling below it.\n\nI am not a plane Figure, but a Solid.  You call me a Circle; but in\nreality I am not a Circle, but an infinite number of Circles, of size\nvarying from a Point to a Circle of thirteen inches in diameter, one\nplaced on the top of the other.  When I cut through your plane as I am\nnow doing, I make in your plane a section which you, very rightly, call\na Circle.  For even a Sphere--which is my proper name in my own\ncountry--if he manifest himself at all to an inhabitant of\nFlatland--must needs manifest himself as a Circle.\n\nDo you not remember--for I, who see all things, discerned last night\nthe phantasmal vision of Lineland written upon your brain--do you not\nremember, I say, how, when you entered the realm of Lineland, you were\ncompelled to manifest yourself to the King, not as a Square, but as a\nLine, because that Linear Realm had not Dimensions enough to represent\nthe whole of you, but only a slice or section of you?  In precisely the\nsame way, your country of Two Dimensions is not spacious enough to\nrepresent me, a being of Three, but can only exhibit a slice or section\nof me, which is what you call a Circle.\n\nThe diminished brightness of your eye indicates incredulity.  But now\nprepare to receive proof positive of the truth of my assertions.  You\ncannot indeed see more than one of my sections, or Circles, at a time;\nfor you have no power to raise your eye out of the plane of Flatland;\nbut you can at least see that, as I rise in Space, so my sections\nbecome smaller.  See now, I will rise; and the effect upon your eye\nwill be that my Circle will become smaller and smaller till it dwindles\nto a point and finally vanishes.\n\n\n[Illustration 8]\n\n[ASCII approximation follows]\n\n\n                                                The Sphere on the\n                                                point of vanishing\n                                  (2)                __-----__\n    The Sphere with       The Sphere rising        /           \\     (3)\n      his section              __-----__         /               \\\n      at full size           /           \\      |                 |\n         __-----__         /               \\    |                 |\n       /           \\      |                 |   |                 |\n     /    __ - __    \\    |                 |    \\               /   My\n    |  --         --  |   |   __  ---  __   |      \\ __     __ /     Eye\n  --|-----------------|----\\--__-------__--/------------===----------+(>\n    |  -- __   __ --  |      \\ __ --- __ /\n     \\       -       /           -----\n       \\ __     __ /\n           -----\n\n\nThere was no \"rising\" that I could see; but he diminished and finally\nvanished.  I winked once or twice to make sure that I was not dreaming.\nBut it was no dream.  For from the depths of nowhere came forth a\nhollow voice--close to my heart it seemed--\"Am I quite gone?  Are you\nconvinced now?  Well, now I will gradually return to Flatland and you\nshall see my section become larger and larger.\"\n\nEvery reader in Spaceland will easily understand that my mysterious\nGuest was speaking the language of truth and even of simplicity.  But\nto me, proficient though I was in Flatland Mathematics, it was by no\nmeans a simple matter.  The rough diagram given above will make it\nclear to any Spaceland child that the Sphere, ascending in the three\npositions indicated there, must needs have manifested himself to me, or\nto any Flatlander, as a Circle, at first of full size, then small, and\nat last very small indeed, approaching to a Point.  But to me, although\nI saw the facts before me, the causes were as dark as ever.  All that I\ncould comprehend was, that the Circle had made himself smaller and\nvanished, and that he had now reappeared and was rapidly making himself\nlarger.\n\nWhen he regained his original size, he heaved a deep sigh; for he\nperceived by my silence that I had altogether failed to comprehend him.\nAnd indeed I was now inclining to the belief that he must be no Circle\nat all, but some extremely clever juggler; or else that the old wives'\ntales were true, and that after all there were such people as\nEnchanters and Magicians.\n\nAfter a long pause he muttered to himself, \"One resource alone remains,\nif I am not to resort to action.  I must try the method of Analogy.\"\nThen followed a still longer silence, after which he continued our\ndialogue.\n\nSPHERE.  Tell me, Mr. Mathematician; if a Point moves Northward, and\nleaves a luminous wake, what name would you give to the wake?\n\nI.  A straight Line.\n\nSPHERE.  And a straight Line has how many extremities?\n\nI.  Two.\n\nSPHERE.  Now conceive the Northward straight Line moving parallel to\nitself, East and West, so that every point in it leaves behind it the\nwake of a straight Line.  What name will you give to the Figure thereby\nformed?  We will suppose that it moves through a distance equal to the\noriginal straight Line. --What name, I say?\n\nI.  A Square.\n\nSPHERE.  And how many sides has a Square?  How many angles?\n\nI.  Four sides and four angles.\n\nSPHERE.  Now stretch your imagination a little, and conceive a Square\nin Flatland, moving parallel to itself upward.\n\nI.  What?  Northward?\n\nSPHERE.  No, not Northward; upward; out of Flatland altogether.\n\nIf it moved Northward, the Southern points in the Square would have to\nmove through the positions previously occupied by the Northern points.\nBut that is not my meaning.\n\nI mean that every Point in you--for you are a Square and will serve the\npurpose of my illustration--every Point in you, that is to say in what\nyou call your inside, is to pass upwards through Space in such a way\nthat no Point shall pass through the position previously occupied by\nany other Point; but each Point shall describe a straight Line of its\nown.  This is all in accordance with Analogy; surely it must be clear\nto you.\n\nRestraining my impatience--for I was now under a strong temptation to\nrush blindly at my Visitor and to precipitate him into Space, or out of\nFlatland, anywhere, so that I could get rid of him--I replied:--\n\n\"And what may be the nature of the Figure which I am to shape out by\nthis motion which you are pleased to denote by the word 'upward'?  I\npresume it is describable in the language of Flatland.\"\n\nSPHERE.  Oh, certainly.  It is all plain and simple, and in strict\naccordance with Analogy--only, by the way, you must not speak of the\nresult as being a Figure, but as a Solid.  But I will describe it to\nyou.  Or rather not I, but Analogy.\n\nWe began with a single Point, which of course--being itself a\nPoint--has only ONE terminal Point.\n\nOne Point produces a Line with TWO terminal Points.\n\nOne Line produces a Square with FOUR terminal Points.\n\nNow you can give yourself the answer to your own question:  1, 2, 4,\nare evidently in Geometrical Progression.  What is the next number?\n\nI.  Eight.\n\nSPHERE.  Exactly.  The one Square produces a SOMETHING-WHICH-\nYOU-DO-NOT-AS-YET-KNOW-A-NAME-FOR-BUT-WHICH-WE-CALL-A-CUBE with EIGHT\nterminal Points.  Now are you convinced?\n\nI.  And has this Creature sides, as well as angles or what you call\n\"terminal Points\"?\n\nSPHERE.  Of course; and all according to Analogy.  But, by the way, not\nwhat YOU call sides, but what WE call sides.  You would call them\nSOLIDS.\n\nI.  And how many solids or sides will appertain to this Being whom I am\nto generate by the motion of my inside in an \"upward\" direction, and\nwhom you call a Cube?\n\nSPHERE.  How can you ask?  And you a mathematician!  The side of\nanything is always, if I may so say, one Dimension behind the thing.\nConsequently, as there is no Dimension behind a Point, a Point has 0\nsides; a Line, if I may say, has 2 sides (for the Points of a Line may\nbe called by courtesy, its sides); a Square has 4 sides; 0, 2, 4; what\nProgression do you call that?\n\nI.  Arithmetical.\n\nSPHERE.  And what is the next number?\n\nI.  Six.\n\nSPHERE.  Exactly.  Then you see you have answered your own question.\nThe Cube which you will generate will be bounded by six sides, that is\nto say, six of your insides.  You see it all now, eh?\n\n\"Monster,\" I shrieked, \"be thou juggler, enchanter, dream, or devil, no\nmore will I endure thy mockeries.  Either thou or I must perish.\" And\nsaying these words I precipitated myself upon him.\n\n\n\n\nSection 17.  How the Sphere, having in vain tried words,\n               resorted to deeds\n\n\n\nIt was in vain.  I brought my hardest right angle into violent\ncollision with the Stranger, pressing on him with a force sufficient to\nhave destroyed any ordinary Circle:  but I could feel him slowly and\nunarrestably slipping from my contact; no edging to the right nor to\nthe left, but moving somehow out of the world, and vanishing to\nnothing.  Soon there was a blank.  But still I heard the Intruder's\nvoice.\n\nSPHERE.  Why will you refuse to listen to reason?  I had hoped to find\nin you--as being a man of sense and an accomplished mathematician--a\nfit apostle for the Gospel of the Three Dimensions, which I am allowed\nto preach once only in a thousand years:  but now I know not how to\nconvince you.  Stay, I have it.  Deeds, and not words, shall proclaim\nthe truth.  Listen, my friend.\n\nI have told you I can see from my position in Space the inside of all\nthings that you consider closed.  For example, I see in yonder cupboard\nnear which you are standing, several of what you call boxes (but like\neverything else in Flatland, they have no tops nor bottoms) full of\nmoney; I see also two tablets of accounts.  I am about to descend into\nthat cupboard and to bring you one of those tablets.  I saw you lock\nthe cupboard half an hour ago, and I know you have the key in your\npossession.  But I descend from Space; the doors, you see, remain\nunmoved.  Now I am in the cupboard and am taking the tablet.  Now I\nhave it.  Now I ascend with it.\n\nI rushed to the closet and dashed the door open.  One of the tablets\nwas gone.  With a mocking laugh, the Stranger appeared in the other\ncorner of the room, and at the same time the tablet appeared upon the\nfloor.  I took it up.  There could be no doubt--it was the missing\ntablet.\n\nI groaned with horror, doubting whether I was not out of my senses; but\nthe Stranger continued:  \"Surely you must now see that my explanation,\nand no other, suits the phenomena.  What you call Solid things are\nreally superficial; what you call Space is really nothing but a great\nPlane.  I am in Space, and look down upon the insides of the things of\nwhich you only see the outsides.  You could leave this Plane yourself,\nif you could but summon up the necessary volition.  A slight upward or\ndownward motion would enable you to see all that I can see.\n\n\"The higher I mount, and the further I go from your Plane, the more I\ncan see, though of course I see it on a smaller scale.  For example, I\nam ascending; now I can see your neighbour the Hexagon and his family\nin their several apartments; now I see the inside of the Theatre, ten\ndoors off, from which the audience is only just departing; and on the\nother side a Circle in his study, sitting at his books.  Now I shall\ncome back to you.  And, as a crowning proof, what do you say to my\ngiving you a touch, just the least touch, in your stomach?  It will not\nseriously injure you, and the slight pain you may suffer cannot be\ncompared with the mental benefit you will receive.\"\n\nBefore I could utter a word of remonstrance, I felt a shooting pain in\nmy inside, and a demoniacal laugh seemed to issue from within me.  A\nmoment afterwards the sharp agony had ceased, leaving nothing but a\ndull ache behind, and the Stranger began to reappear, saying, as he\ngradually increased in size, \"There, I have not hurt you much, have I?\nIf you are not convinced now, I don't know what will convince you.\nWhat say you?\"\n\nMy resolution was taken.  It seemed intolerable that I should endure\nexistence subject to the arbitrary visitations of a Magician who could\nthus play tricks with one's very stomach.  If only I could in any way\nmanage to pin him against the wall till help came!\n\nOnce more I dashed my hardest angle against him, at the same time\nalarming the whole household by my cries for aid.  I believe, at the\nmoment of my onset, the Stranger had sunk below our Plane, and really\nfound difficulty in rising.  In any case he remained motionless, while\nI, hearing, as I thought, the sound of some help approaching, pressed\nagainst him with redoubled vigour, and continued to shout for\nassistance.\n\nA convulsive shudder ran through the Sphere.  \"This must not be,\" I\nthought I heard him say:  \"either he must listen to reason, or I must\nhave recourse to the last resource of civilization.\" Then, addressing\nme in a louder tone, he hurriedly exclaimed, \"Listen:  no stranger must\nwitness what you have witnessed.  Send your Wife back at once, before\nshe enters the apartment.  The Gospel of Three Dimensions must not be\nthus frustrated.  Not thus must the fruits of one thousand years of\nwaiting be thrown away.  I hear her coming.  Back! back!  Away from me,\nor you must go with me--whither you know not--into the Land of Three\nDimensions!\"\n\n\"Fool!  Madman!  Irregular!\" I exclaimed; \"never will I release thee;\nthou shalt pay the penalty of thine impostures.\"\n\n\"Ha!  Is it come to this?\" thundered the Stranger:  \"then meet your\nfate:  out of your Plane you go.  Once, twice, thrice!  'Tis done!\"\n\n\n\n\nSection 18.  How I came to Spaceland, and what I saw there\n\n\n\nAn unspeakable horror seized me.  There was a darkness; then a dizzy,\nsickening sensation of sight that was not like seeing; I saw a Line\nthat was no Line; Space that was not Space: I was myself, and not\nmyself.  When I could find voice, I shrieked aloud in agony, \"Either\nthis is madness or it is Hell.\" \"It is neither,\" calmly replied the\nvoice of the Sphere, \"it is Knowledge; it is Three Dimensions:  open\nyour eye once again and try to look steadily.\"\n\nI looked, and, behold, a new world!  There stood before me, visibly\nincorporate, all that I had before inferred, conjectured, dreamed, of\nperfect Circular beauty.  What seemed the centre of the Stranger's form\nlay open to my view:  yet I could see no heart, nor lungs, nor\narteries, only a beautiful harmonious Something--for which I had no\nwords; but you, my Readers in Spaceland, would call it the surface of\nthe Sphere.\n\nProstrating myself mentally before my Guide, I cried, \"How is it, O\ndivine ideal of consummate loveliness and wisdom that I see thy inside,\nand yet cannot discern thy heart, thy lungs, thy arteries, thy liver?\"\n\"What you think you see, you see not,\" he replied; \"it is not given to\nyou, nor to any other Being to behold my internal parts.  I am of a\ndifferent order of Beings from those in Flatland.  Were I a Circle, you\ncould discern my intestines, but I am a Being, composed as I told you\nbefore, of many Circles, the Many in the One, called in this country a\nSphere.  And, just as the outside of a Cube is a Square, so the outside\nof a Sphere presents the appearance of a Circle.\"\n\nBewildered though I was by my Teacher's enigmatic utterance, I no\nlonger chafed against it, but worshipped him in silent adoration.  He\ncontinued, with more mildness in his voice.  \"Distress not yourself if\nyou cannot at first understand the deeper mysteries of Spaceland.  By\ndegrees they will dawn upon you.  Let us begin by casting back a glance\nat the region whence you came.  Return with me a while to the plains of\nFlatland, and I will shew you that which you have often reasoned and\nthought about, but never seen with the sense of sight--a visible\nangle.\"  \"Impossible!\" I cried; but, the Sphere leading the way, I\nfollowed as if in a dream, till once more his voice arrested me:  \"Look\nyonder, and behold your own Pentagonal house, and all its inmates.\"\n\nI looked below, and saw with my physical eye all that domestic\nindividuality which I had hitherto merely inferred with the\nunderstanding.  And how poor and shadowy was the inferred conjecture in\ncomparison with the reality which I now beheld!  My four Sons calmly\nasleep in the North-Western rooms, my two orphan Grandsons to the\nSouth; the Servants, the Butler, my Daughter, all in their several\napartments.  Only my affectionate Wife, alarmed by my continued\nabsence, had quitted her room and was roving up and down in the Hall,\nanxiously awaiting my return.  Also the Page, aroused by my cries, had\nleft his room, and under pretext of ascertaining whether I had fallen\nsomewhere in a faint, was prying into the cabinet in my study.  All\nthis I could now SEE, not merely infer; and as we came nearer and\nnearer, I could discern even the contents of my cabinet, and the two\nchests of gold, and the tablets of which the Sphere had made mention.\n\n\n[Illustration 9]\n\n[ASCII approximation follows]\n\n\n                                    /\\\n                                 /  |My \\\n                              /  <> |Study \\\n                           /______  |  ___    \\\n                        /  <> My Sons\\  \\|The    \\\n                     /______/          \\  Page   /  \\\n     N            /   <>                   \\  /  My    \\\n     ^         /______/      THE HALL         \\  Bedroom  \\\n     |         \\  <>                           My\\        /\n     |          \\____|                        /\\Wife's   /\n  W--+--E        \\           My Wife         / Apartment/\n     |                       -------        /\\ --- \\ WOMEN'S DOOR\n     |        MEN'S DOOR                       \\My Daughter\n     |                                   /\\ --== \\   /  The Scullion\n     S               \\  My Grandsons        \\ -==# \\/  The Footman\n                      \\___  ___  _   _/       \\-=#|/  The Butler\n                       \\  <> | <> | |THE CELLAR \\ /\n                        \\____|____|_|____________/\n\n                   ###===---                  ---===###\n                   Policeman                  Policeman\n\n\nTouched by my Wife's distress, I would have sprung downward to reassure\nher, but I found myself incapable of motion.  \"Trouble not yourself\nabout your Wife,\" said my Guide: \"she will not be long left in anxiety;\nmeantime, let us take a survey of Flatland.\"\n\nOnce more I felt myself rising through space.  It was even as the\nSphere had said.  The further we receded from the object we beheld, the\nlarger became the field of vision.  My native city, with the interior\nof every house and every creature therein, lay open to my view in\nminiature.  We mounted higher, and lo, the secrets of the earth, the\ndepths of mines and inmost caverns of the hills, were bared before me.\n\nAwestruck at the sight of the mysteries of the earth, thus unveiled\nbefore my unworthy eye, I said to my Companion, \"Behold, I am become as\na God.  For the wise men in our country say that to see all things, or\nas they express it, OMNIVIDENCE, is the attribute of God alone.\"  There\nwas something of scorn in the voice of my Teacher as he made answer:\n\"Is it so indeed?  Then the very pick-pockets and cut-throats of my\ncountry are to be worshipped by your wise men as being Gods: for there\nis not one of them that does not see as much as you see now.  But trust\nme, your wise men are wrong.\"\n\nI.  Then is omnividence the attribute of others besides Gods?\n\nSPHERE.  I do not know.  But, if a pick-pocket or a cut-throat of our\ncountry can see everything that is in your country, surely that is no\nreason why the pick-pocket or cut-throat should be accepted by you as a\nGod.  This omnividence, as you call it--it is not a common word in\nSpaceland--does it make you more just, more merciful, less selfish,\nmore loving?  Not in the least.  Then how does it make you more divine?\n\nI.  \"More merciful, more loving!\"  But these are the qualities of\nwomen!  And we know that a Circle is a higher Being than a Straight\nLine, in so far as knowledge and wisdom are more to be esteemed than\nmere affection.\n\nSPHERE.  It is not for me to classify human faculties according to\nmerit.  Yet many of the best and wisest in Spaceland think more of the\naffections than of the understanding, more of your despised Straight\nLines than of your belauded Circles.  But enough of this.  Look yonder.\nDo you know that building?\n\nI looked, and afar off I saw an immense Polygonal structure, in which I\nrecognized the General Assembly Hall of the States of Flatland,\nsurrounded by dense lines of Pentagonal buildings at right angles to\neach other, which I knew to be streets; and I perceived that I was\napproaching the great Metropolis.\n\n\"Here we descend,\" said my Guide.  It was now morning, the first hour\nof the first day of the two thousandth year of our era.  Acting, as was\ntheir wont, in strict accordance with precedent, the highest Circles of\nthe realm were meeting in solemn conclave, as they had met on the first\nhour of the first day of the year 1000, and also on the first hour of\nthe first day of the year 0.\n\nThe minutes of the previous meetings were now read by one whom I at\nonce recognized as my brother, a perfectly Symmetrical Square, and the\nChief Clerk of the High Council.  It was found recorded on each\noccasion that:  \"Whereas the States had been troubled by divers\nill-intentioned persons pretending to have received revelations from\nanother World, and professing to produce demonstrations whereby they\nhad instigated to frenzy both themselves and others, it had been for\nthis cause unanimously resolved by the Grand Council that on the first\nday of each millenary, special injunctions be sent to the Prefects in\nthe several districts of Flatland, to make strict search for such\nmisguided persons, and without formality of mathematical examination,\nto destroy all such as were Isosceles of any degree, to scourge and\nimprison any regular Triangle, to cause any Square or Pentagon to be\nsent to the district Asylum, and to arrest any one of higher rank,\nsending him straightway to the Capital to be examined and judged by the\nCouncil.\"\n\n\"You hear your fate,\" said the Sphere to me, while the Council was\npassing for the third time the formal resolution.  \"Death or\nimprisonment awaits the Apostle of the Gospel of Three Dimensions.\"\n\"Not so,\" replied I, \"the matter is now so clear to me, the nature of\nreal space so palpable, that methinks I could make a child understand\nit.  Permit me but to descend at this moment and enlighten them.\"  \"Not\nyet,\" said my Guide, \"the time will come for that.  Meantime I must\nperform my mission.  Stay thou there in thy place.\"  Saying these\nwords, he leaped with great dexterity into the sea (if I may so call\nit) of Flatland, right in the midst of the ring of Counsellors.  \"I\ncome,\" cried he, \"to proclaim that there is a land of Three Dimensions.\"\n\nI could see many of the younger Counsellors start back in manifest\nhorror, as the Sphere's circular section widened before them.  But on a\nsign from the presiding Circle--who shewed not the slightest alarm or\nsurprise--six Isosceles of a low type from six different quarters\nrushed upon the Sphere.  \"We have him,\" they cried; \"No; yes; we have\nhim still! he's going!  he's gone!\"\n\n\"My Lords,\" said the President to the Junior Circles of the Council,\n\"there is not the slightest need for surprise; the secret archives, to\nwhich I alone have access, tell me that a similar occurrence happened\non the last two millennial commencements.  You will, of course, say\nnothing of these trifles outside the Cabinet.\"\n\nRaising his voice, he now summoned the guards.  \"Arrest the policemen;\ngag them.  You know your duty.\"  After he had consigned to their fate\nthe wretched policemen--ill-fated and unwilling witnesses of a\nState-secret which they were not to be permitted to reveal--he again\naddressed the Counsellors.  \"My Lords, the business of the Council\nbeing concluded, I have only to wish you a happy New Year.\"  Before\ndeparting, he expressed, at some length, to the Clerk, my excellent but\nmost unfortunate brother, his sincere regret that, in accordance with\nprecedent and for the sake of secrecy, he must condemn him to perpetual\nimprisonment, but added his satisfaction that, unless some mention were\nmade by him of that day's incident, his life would be spared.\n\n\n\n\nSection 19.  How, though the Sphere shewed me other mysteries\n               of Spaceland, I still desired more; and what came of it\n\n\n\nWhen I saw my poor brother led away to imprisonment, I attempted to\nleap down into the Council Chamber, desiring to intercede on his\nbehalf, or at least bid him farewell.  But I found that I had no motion\nof my own.  I absolutely depended on the volition of my Guide, who said\nin gloomy tones, \"Heed not thy brother; haply thou shalt have ample\ntime hereafter to condole with him.  Follow me.\"\n\n\n[Illustration 10]\n\n[ASCII approximation follows]\n\n\n         (1)                    (2)\n      __________             __________\n     |\\         |\\          |           \\\n     |  \\       |  \\        |             \\\n     |    \\ ____|____\\      |               \\\n     |     |    |     |     |                |\n     |_____|____|     |     |                |\n      \\    |     \\    |      \\               |\n        \\  |       \\  |        \\             |\n          \\|_________\\|          \\ __________|\n\n\nOnce more we ascended into space.  \"Hitherto,\" said the Sphere, \"I have\nshewn you naught save Plane Figures and their interiors.  Now I must\nintroduce you to Solids, and reveal to you the plan upon which they are\nconstructed.  Behold this multitude of moveable square cards.  See, I\nput one on another, not, as you supposed, Northward of the other, but\nON the other.  Now a second, now a third.  See, I am building up a\nSolid by a multitude of Squares parallel to one another.  Now the Solid\nis complete, being as high as it is long and broad, and we call it a\nCube.\"\n\n\"Pardon me, my Lord,\" replied I; \"but to my eye the appearance is as of\nan Irregular Figure whose inside is laid open to the view; in other\nwords, methinks I see no Solid, but a Plane such as we infer in\nFlatland; only of an Irregularity which betokens some monstrous\ncriminal, so that the very sight of it is painful to my eyes.\"\n\n\"True,\" said the Sphere, \"it appears to you a Plane, because you are\nnot accustomed to light and shade and perspective; just as in Flatland\na Hexagon would appear a Straight Line to one who has not the Art of\nSight Recognition.  But in reality it is a Solid, as you shall learn by\nthe sense of Feeling.\"\n\nHe then introduced me to the Cube, and I found that this marvellous\nBeing was indeed no Plane, but a Solid; and that he was endowed with\nsix plane sides and eight terminal points called solid angles; and I\nremembered the saying of the Sphere that just such a Creature as this\nwould be formed by a Square moving, in Space, parallel to himself:  and\nI rejoiced to think that so insignificant a Creature as I could in some\nsense be called the Progenitor of so illustrious an offspring.\n\nBut still I could not fully understand the meaning of what my Teacher\nhad told me concerning \"light\" and \"shade\" and \"perspective\"; and I did\nnot hesitate to put my difficulties before him.\n\nWere I to give the Sphere's explanation of these matters, succinct and\nclear though it was, it would be tedious to an inhabitant of Space, who\nknows these things already.  Suffice it, that by his lucid statements,\nand by changing the position of objects and lights, and by allowing me\nto feel the several objects and even his own sacred Person, he at last\nmade all things clear to me, so that I could now readily distinguish\nbetween a Circle and a Sphere, a Plane Figure and a Solid.\n\nThis was the Climax, the Paradise, of my strange eventful History.\nHenceforth I have to relate the story of my miserable Fall:--most\nmiserable, yet surely most undeserved!  For why should the thirst for\nknowledge be aroused, only to be disappointed and punished?  My\nvolition shrinks from the painful task of recalling my humiliation;\nyet, like a second Prometheus, I will endure this and worse, if by any\nmeans I may arouse in the interiors of Plane and Solid Humanity a\nspirit of rebellion against the Conceit which would limit our\nDimensions to Two or Three or any number short of Infinity.  Away then\nwith all personal considerations!  Let me continue to the end, as I\nbegan, without further digressions or anticipations, pursuing the plain\npath of dispassionate History.  The exact facts, the exact words,--and\nthey are burnt in upon my brain,--shall be set down without alteration\nof an iota; and let my Readers judge between me and Destiny.\n\nThe Sphere would willingly have continued his lessons by indoctrinating\nme in the conformation of all regular Solids, Cylinders, Cones,\nPyramids, Pentahedrons, Hexahedrons, Dodecahedrons, and Spheres:  but I\nventured to interrupt him.  Not that I was wearied of knowledge.  On\nthe contrary, I thirsted for yet deeper and fuller draughts than he was\noffering to me.\n\n\"Pardon me,\" said I, \"O Thou Whom I must no longer address as the\nPerfection of all Beauty; but let me beg thee to vouchsafe thy servant\na sight of thine interior.\"\n\nSPHERE.  My what?\n\nI.  Thine interior:  thy stomach, thy intestines.\n\nSPHERE.  Whence this ill-timed impertinent request?  And what mean you\nby saying that I am no longer the Perfection of all Beauty?\n\nI.  My Lord, your own wisdom has taught me to aspire to One even more\ngreat, more beautiful, and more closely approximate to Perfection than\nyourself.  As you yourself, superior to all Flatland forms, combine\nmany Circles in One, so doubtless there is One above you who combines\nmany Spheres in One Supreme Existence, surpassing even the Solids of\nSpaceland.  And even as we, who are now in Space, look down on Flatland\nand see the insides of all things, so of a certainty there is yet above\nus some higher, purer region, whither thou dost surely purpose to lead\nme--O Thou Whom I shall always call, everywhere and in all Dimensions,\nmy Priest, Philosopher, and Friend--some yet more spacious Space, some\nmore dimensionable Dimensionality, from the vantage-ground of which we\nshall look down together upon the revealed insides of Solid things, and\nwhere thine own intestines, and those of thy kindred Spheres, will lie\nexposed to the view of the poor wandering exile from Flatland, to whom\nso much has already been vouchsafed.\n\nSPHERE.  Pooh!  Stuff!  Enough of this trifling!  The time is short,\nand much remains to be done before you are fit to proclaim the Gospel\nof Three Dimensions to your blind benighted countrymen in Flatland.\n\nI.  Nay, gracious Teacher, deny me not what I know it is in thy power\nto perform.  Grant me but one glimpse of thine interior, and I am\nsatisfied for ever, remaining henceforth thy docile pupil, thy\nunemancipable slave, ready to receive all thy teachings and to feed\nupon the words that fall from thy lips.\n\nSPHERE.  Well, then, to content and silence you, let me say at once, I\nwould shew you what you wish if I could; but I cannot.  Would you have\nme turn my stomach inside out to oblige you?\n\nI.  But my Lord has shewn me the intestines of all my countrymen in the\nLand of Two Dimensions by taking me with him into the Land of Three.\nWhat therefore more easy than now to take his servant on a second\njourney into the blessed region of the Fourth Dimension, where I shall\nlook down with him once more upon this land of Three Dimensions, and\nsee the inside of every three-dimensioned house, the secrets of the\nsolid earth, the treasures of the mines in Spaceland, and the\nintestines of every solid living creature, even of the noble and\nadorable Spheres.\n\nSPHERE.  But where is this land of Four Dimensions?\n\nI.  I know not:  but doubtless my Teacher knows.\n\nSPHERE.  Not I.  There is no such land.  The very idea of it is utterly\ninconceivable.\n\nI.  Not inconceivable, my Lord, to me, and therefore still less\ninconceivable to my Master.  Nay, I despair not that, even here, in\nthis region of Three Dimensions, your Lordship's art may make the\nFourth Dimension visible to me; just as in the Land of Two Dimensions\nmy Teacher's skill would fain have opened the eyes of his blind servant\nto the invisible presence of a Third Dimension, though I saw it not.\n\nLet me recall the past.  Was I not taught below that when I saw a Line\nand inferred a Plane, I in reality saw a Third unrecognized Dimension,\nnot the same as brightness, called \"height\"?  And does it not now\nfollow that, in this region, when I see a Plane and infer a Solid, I\nreally see a Fourth unrecognized Dimension, not the same as colour, but\nexistent, though infinitesimal and incapable of measurement?\n\nAnd besides this, there is the Argument from Analogy of Figures.\n\nSPHERE.  Analogy!  Nonsense:  what analogy?\n\nI.  Your Lordship tempts his servant to see whether he remembers the\nrevelations imparted to him.  Trifle not with me, my Lord; I crave, I\nthirst, for more knowledge.  Doubtless we cannot SEE that other higher\nSpaceland now, because we we have no eye in our stomachs.  But, just as\nthere WAS the realm of Flatland, though that poor puny Lineland Monarch\ncould neither turn to left nor right to discern it, and just as there\nWAS close at hand, and touching my frame, the land of Three Dimensions,\nthough I, blind senseless wretch, had no power to touch it, no eye in\nmy interior to discern it, so of a surety there is a Fourth Dimension,\nwhich my Lord perceives with the inner eye of thought.  And that it\nmust exist my Lord himself has taught me.  Or can he have forgotten\nwhat he himself imparted to his servant?\n\nIn One Dimension, did not a moving Point produce a Line with TWO\nterminal points?\n\nIn Two Dimensions, did not a moving Line produce a Square with FOUR\nterminal points?\n\nIn Three Dimensions, did not a moving Square produce--did not this eye\nof mine behold it--that blessed Being, a Cube, with EIGHT terminal\npoints?\n\nAnd in Four Dimensions shall not a moving Cube--alas, for Analogy, and\nalas for the Progress of Truth, if it be not so--shall not, I say, the\nmotion of a divine Cube result in a still more divine Organization with\nSIXTEEN terminal points?\n\nBehold the infallible confirmation of the Series, 2, 4, 8, 16: is not\nthis a Geometrical Progression?  Is not this--if I might quote my\nLord's own words--\"strictly according to Analogy\"?\n\nAgain, was I not taught by my Lord that as in a Line there are TWO\nbounding Points, and in a Square there are FOUR bounding Lines, so in a\nCube there must be SIX bounding Squares?  Behold once more the\nconfirming Series, 2, 4, 6:  is not this an Arithmetical Progression?\nAnd consequently does it not of necessity follow that the more divine\noffspring of the divine Cube in the Land of Four Dimensions, must have\n8 bounding Cubes: and is not this also, as my Lord has taught me to\nbelieve, \"strictly according to Analogy\"?\n\nO, my Lord, my Lord, behold, I cast myself in faith upon conjecture,\nnot knowing the facts; and I appeal to your Lordship to confirm or deny\nmy logical anticipations.  If I am wrong, I yield, and will no longer\ndemand a fourth Dimension; but, if I am right, my Lord will listen to\nreason.\n\nI ask therefore, is it, or is it not, the fact, that ere now your\ncountrymen also have witnessed the descent of Beings of a higher order\nthan their own, entering closed rooms, even as your Lordship entered\nmine, without the opening of doors or windows, and appearing and\nvanishing at will?  On the reply to this question I am ready to stake\neverything.  Deny it, and I am henceforth silent.  Only vouchsafe an\nanswer.\n\nSPHERE.  (AFTER A PAUSE).  It is reported so.  But men are divided in\nopinion as to the facts.  And even granting the facts, they explain\nthem in different ways.  And in any case, however great may be the\nnumber of different explanations, no one has adopted or suggested the\ntheory of a Fourth Dimension.  Therefore, pray have done with this\ntrifling, and let us return to business.\n\nI.  I was certain of it.  I was certain that my anticipations would be\nfulfilled.  And now have patience with me and answer me yet one more\nquestion, best of Teachers!  Those who have thus appeared--no one knows\nwhence--and have returned--no one knows whither--have they also\ncontracted their sections and vanished somehow into that more Spacious\nSpace, whither I now entreat you to conduct me?\n\nSPHERE (MOODILY).  They have vanished, certainly--if they ever\nappeared.  But most people say that these visions arose from the\nthought--you will not understand me--from the brain; from the perturbed\nangularity of the Seer.\n\nI.  Say they so?  Oh, believe them not.  Or if it indeed be so, that\nthis other Space is really Thoughtland, then take me to that blessed\nRegion where I in Thought shall see the insides of all solid things.\nThere, before my ravished eye, a Cube, moving in some altogether new\ndirection, but strictly according to Analogy, so as to make every\nparticle of his interior pass through a new kind of Space, with a wake\nof its own--shall create a still more perfect perfection than himself,\nwith sixteen terminal Extra-solid angles, and Eight solid Cubes for his\nPerimeter.  And once there, shall we stay our upward course?  In that\nblessed region of Four Dimensions, shall we linger on the threshold of\nthe Fifth, and not enter therein?  Ah, no!  Let us rather resolve that\nour ambition shall soar with our corporal ascent.  Then, yielding to\nour intellectual onset, the gates of the Sixth Dimension shall fly\nopen; after that a Seventh, and then an Eighth-- How long I should have\ncontinued I know not.  In vain did the Sphere, in his voice of thunder,\nreiterate his command of silence, and threaten me with the direst\npenalties if I persisted.  Nothing could stem the flood of my ecstatic\naspirations.  Perhaps I was to blame; but indeed I was intoxicated with\nthe recent draughts of Truth to which he himself had introduced me.\nHowever, the end was not long in coming.  My words were cut short by a\ncrash outside, and a simultaneous crash inside me, which impelled me\nthrough space with a velocity that precluded speech.  Down! down! down!\nI was rapidly descending; and I knew that return to Flatland was my\ndoom.  One glimpse, one last and never-to-be-forgotten glimpse I had of\nthat dull level wilderness--which was now to become my Universe\nagain--spread out before my eye.  Then a darkness.  Then a final,\nall-consummating thunder-peal; and, when I came to myself, I was once\nmore a common creeping Square, in my Study at home, listening to the\nPeace-Cry of my approaching Wife.\n\n\n\n\nSection 20.  How the Sphere encouraged me in a Vision\n\n\n\nAlthough I had less than a minute for reflection, I felt, by a kind of\ninstinct, that I must conceal my experiences from my Wife.  Not that I\napprehended, at the moment, any danger from her divulging my secret,\nbut I knew that to any Woman in Flatland the narrative of my adventures\nmust needs be unintelligible.  So I endeavoured to reassure her by some\nstory, invented for the occasion, that I had accidentally fallen\nthrough the trap-door of the cellar, and had there lain stunned.\n\nThe Southward attraction in our country is so slight that even to a\nWoman my tale necessarily appeared extraordinary and well-nigh\nincredible; but my Wife, whose good sense far exceeds that of the\naverage of her Sex, and who perceived that I was unusually excited, did\nnot argue with me on the subject, but insisted that I was ill and\nrequired repose.  I was glad of an excuse for retiring to my chamber to\nthink quietly over what had happened.  When I was at last by myself, a\ndrowsy sensation fell on me; but before my eyes closed I endeavoured to\nreproduce the Third Dimension, and especially the process by which a\nCube is constructed through the motion of a Square.  It was not so\nclear as I could have wished; but I remembered that it must be \"Upward,\nand yet not Northward\", and I determined steadfastly to retain these\nwords as the clue which, if firmly grasped, could not fail to guide me\nto the solution.  So mechanically repeating, like a charm, the words,\n\"Upward, yet not Northward\", I fell into a sound refreshing sleep.\n\nDuring my slumber I had a dream.  I thought I was once more by the side\nof the Sphere, whose lustrous hue betokened that he had exchanged his\nwrath against me for perfect placability.  We were moving together\ntowards a bright but infinitesimally small Point, to which my Master\ndirected my attention.  As we approached, methought there issued from\nit a slight humming noise as from one of your Spaceland bluebottles,\nonly less resonant by far, so slight indeed that even in the perfect\nstillness of the Vacuum through which we soared, the sound reached not\nour ears till we checked our flight at a distance from it of something\nunder twenty human diagonals.\n\n\"Look yonder,\" said my Guide, \"in Flatland thou hast lived; of Lineland\nthou hast received a vision; thou hast soared with me to the heights of\nSpaceland; now, in order to complete the range of thy experience, I\nconduct thee downward to the lowest depth of existence, even to the\nrealm of Pointland, the Abyss of No dimensions.\n\n\"Behold yon miserable creature.  That Point is a Being like ourselves,\nbut confined to the non-dimensional Gulf.  He is himself his own World,\nhis own Universe; of any other than himself he can form no conception;\nhe knows not Length, nor Breadth, nor Height, for he has had no\nexperience of them; he has no cognizance even of the number Two; nor\nhas he a thought of Plurality; for he is himself his One and All, being\nreally Nothing.  Yet mark his perfect self-contentment, and hence learn\nthis lesson, that to be self-contented is to be vile and ignorant, and\nthat to aspire is better than to be blindly and impotently happy.  Now\nlisten.\"\n\nHe ceased; and there arose from the little buzzing creature a tiny,\nlow, monotonous, but distinct tinkling, as from one of your Spaceland\nphonographs, from which I caught these words, \"Infinite beatitude of\nexistence!  It is; and there is none else beside It.\"\n\n\"What,\" said I, \"does the puny creature mean by 'it'?\" \"He means\nhimself,\" said the Sphere:  \"have you not noticed before now, that\nbabies and babyish people who cannot distinguish themselves from the\nworld, speak of themselves in the Third Person?  But hush!\"\n\n\"It fills all Space,\" continued the little soliloquizing Creature, \"and\nwhat It fills, It is.  What It thinks, that It utters; and what It\nutters, that It hears; and It itself is Thinker, Utterer, Hearer,\nThought, Word, Audition; it is the One, and yet the All in All.  Ah,\nthe happiness ah, the happiness of Being!\"\n\n\"Can you not startle the little thing out of its complacency?\" said I.\n\"Tell it what it really is, as you told me; reveal to it the narrow\nlimitations of Pointland, and lead it up to something higher.\"  \"That\nis no easy task,\" said my Master; \"try you.\"\n\nHereon, raising my voice to the uttermost, I addressed the Point as\nfollows:\n\n\"Silence, silence, contemptible Creature.  You call yourself the All in\nAll, but you are the Nothing:  your so-called Universe is a mere speck\nin a Line, and a Line is a mere shadow as compared with--\"  \"Hush,\nhush, you have said enough,\" interrupted the Sphere, \"now listen, and\nmark the effect of your harangue on the King of Pointland.\"\n\nThe lustre of the Monarch, who beamed more brightly than ever upon\nhearing my words, shewed clearly that he retained his complacency; and\nI had hardly ceased when he took up his strain again.  \"Ah, the joy,\nah, the joy of Thought!  What can It not achieve by thinking!  Its own\nThought coming to Itself, suggestive of Its disparagement, thereby to\nenhance Its happiness! Sweet rebellion stirred up to result in triumph!\nAh, the divine creative power of the All in One!  Ah, the joy, the joy\nof Being!\"\n\n\"You see,\" said my Teacher, \"how little your words have done.  So far\nas the Monarch understands them at all, he accepts them as his own--for\nhe cannot conceive of any other except himself--and plumes himself upon\nthe variety of 'Its Thought' as an instance of creative Power.  Let us\nleave this God of Pointland to the ignorant fruition of his\nomnipresence and omniscience:  nothing that you or I can do can rescue\nhim from his self-satisfaction.\"\n\nAfter this, as we floated gently back to Flatland, I could hear the\nmild voice of my Companion pointing the moral of my vision, and\nstimulating me to aspire, and to teach others to aspire.  He had been\nangered at first--he confessed--by my ambition to soar to Dimensions\nabove the Third; but, since then, he had received fresh insight, and he\nwas not too proud to acknowledge his error to a Pupil.  Then he\nproceeded to initiate me into mysteries yet higher than those I had\nwitnessed, shewing me how to construct Extra-Solids by the motion of\nSolids, and Double Extra-Solids by the motion of Extra-Solids, and all\n\"strictly according to Analogy\", all by methods so simple, so easy, as\nto be patent even to the Female Sex.\n\n\n\n\nSection 21.  How I tried to teach the Theory of Three Dimensions\n               to my Grandson, and with what success\n\n\n\nI awoke rejoicing, and began to reflect on the glorious career before\nme.  I would go forth, methought, at once, and evangelize the whole of\nFlatland.  Even to Women and Soldiers should the Gospel of Three\nDimensions be proclaimed.  I would begin with my Wife.\n\nJust as I had decided on the plan of my operations, I heard the sound\nof many voices in the street commanding silence.  Then followed a\nlouder voice.  It was a herald's proclamation.  Listening attentively,\nI recognized the words of the Resolution of the Council, enjoining the\narrest, imprisonment, or execution of any one who should pervert the\nminds of the people by delusions, and by professing to have received\nrevelations from another World.\n\nI reflected.  This danger was not to be trifled with.  It would be\nbetter to avoid it by omitting all mention of my Revelation, and by\nproceeding on the path of Demonstration--which after all, seemed so\nsimple and so conclusive that nothing would be lost by discarding the\nformer means.  \"Upward, not Northward\"--was the clue to the whole\nproof.  It had seemed to me fairly clear before I fell asleep; and when\nI first awoke, fresh from my dream, it had appeared as patent as\nArithmetic; but somehow it did not seem to me quite so obvious now.\nThough my Wife entered the room opportunely just at that moment, I\ndecided, after we had exchanged a few words of commonplace\nconversation, not to begin with her.\n\nMy Pentagonal Sons were men of character and standing, and physicians\nof no mean reputation, but not great in mathematics, and, in that\nrespect, unfit for my purpose.  But it occurred to me that a young and\ndocile Hexagon, with a mathematical turn, would be a most suitable\npupil.  Why therefore not make my first experiment with my little\nprecocious Grandson, whose casual remarks on the meaning of 3^3 had met\nwith the approval of the Sphere?  Discussing the matter with him, a\nmere boy, I should be in perfect safety; for he would know nothing of\nthe Proclamation of the Council; whereas I could not feel sure that my\nSons--so greatly did their patriotism and reverence for the Circles\npredominate over mere blind affection--might not feel compelled to hand\nme over to the Prefect, if they found me seriously maintaining the\nseditious heresy of the Third Dimension.\n\nBut the first thing to be done was to satisfy in some way the curiosity\nof my Wife, who naturally wished to know something of the reasons for\nwhich the Circle had desired that mysterious interview, and of the\nmeans by which he had entered the house.  Without entering into the\ndetails of the elaborate account I gave her,--an account, I fear, not\nquite so consistent with truth as my Readers in Spaceland might\ndesire,--I must be content with saying that I succeeded at last in\npersuading her to return quietly to her household duties without\neliciting from me any reference to the World of Three Dimensions.  This\ndone, I immediately sent for my Grandson; for, to confess the truth, I\nfelt that all that I had seen and heard was in some strange way\nslipping away from me, like the image of a half-grasped, tantalizing\ndream, and I longed to essay my skill in making a first disciple.\n\nWhen my Grandson entered the room I carefully secured the door.  Then,\nsitting down by his side and taking our mathematical tablets,--or, as\nyou would call them, Lines--I told him we would resume the lesson of\nyesterday.  I taught him once more how a Point by motion in One\nDimension produces a Line, and how a straight Line in Two Dimensions\nproduces a Square.  After this, forcing a laugh, I said, \"And now, you\nscamp, you wanted to make me believe that a Square may in the same way\nby motion 'Upward, not Northward' produce another figure, a sort of\nextra Square in Three Dimensions.  Say that again, you young rascal.\"\n\nAt this moment we heard once more the herald's \"O yes! O yes!\" outside\nin the street proclaiming the Resolution of the Council.  Young though\nhe was, my Grandson--who was unusually intelligent for his age, and\nbred up in perfect reverence for the authority of the Circles--took in\nthe situation with an acuteness for which I was quite unprepared.  He\nremained silent till the last words of the Proclamation had died away,\nand then, bursting into tears, \"Dear Grandpapa,\" he said, \"that was\nonly my fun, and of course I meant nothing at all by it; and we did not\nknow anything then about the new Law; and I don't think I said anything\nabout the Third Dimension; and I am sure I did not say one word about\n'Upward, not Northward', for that would be such nonsense, you know.\nHow could a thing move Upward, and not Northward?  Upward and not\nNorthward!  Even if I were a baby, I could not be so absurd as that.\nHow silly it is!  Ha! ha! ha!\"\n\n\"Not at all silly,\" said I, losing my temper; \"here for example, I take\nthis Square,\" and, at the word, I grasped a moveable Square, which was\nlying at hand--\"and I move it, you see, not Northward but--yes, I move\nit Upward--that is to say, not Northward, but I move it somewhere--not\nexactly like this, but somehow--\" Here I brought my sentence to an\ninane conclusion, shaking the Square about in a purposeless manner,\nmuch to the amusement of my Grandson, who burst out laughing louder\nthan ever, and declared that I was not teaching him, but joking with\nhim; and so saying he unlocked the door and ran out of the room.  Thus\nended my first attempt to convert a pupil to the Gospel of Three\nDimensions.\n\n\n\n\nSection 22.  How I then tried to diffuse the Theory\n               of Three Dimensions by other means, and of the result\n\n\n\nMy failure with my Grandson did not encourage me to communicate my\nsecret to others of my household; yet neither was I led by it to\ndespair of success.  Only I saw that I must not wholly rely on the\ncatch-phrase, \"Upward, not Northward\", but must rather endeavour to\nseek a demonstration by setting before the public a clear view of the\nwhole subject; and for this purpose it seemed necessary to resort to\nwriting.\n\nSo I devoted several months in privacy to the composition of a treatise\non the mysteries of Three Dimensions.  Only, with the view of evading\nthe Law, if possible, I spoke not of a physical Dimension, but of a\nThoughtland whence, in theory, a Figure could look down upon Flatland\nand see simultaneously the insides of all things, and where it was\npossible that there might be supposed to exist a Figure environed, as\nit were, with six Squares, and containing eight terminal Points.  But\nin writing this book I found myself sadly hampered by the impossibility\nof drawing such diagrams as were necessary for my purpose; for of\ncourse, in our country of Flatland, there are no tablets but Lines, and\nno diagrams but Lines, all in one straight Line and only\ndistinguishable by difference of size and brightness; so that, when I\nhad finished my treatise (which I entitled, \"Through Flatland to\nThoughtland\") I could not feel certain that many would understand my\nmeaning.\n\nMeanwhile my life was under a cloud.  All pleasures palled upon me; all\nsights tantalized and tempted me to outspoken treason, because I could\nnot but compare what I saw in Two Dimensions with what it really was if\nseen in Three, and could hardly refrain from making my comparisons\naloud.  I neglected my clients and my own business to give myself to\nthe contemplation of the mysteries which I had once beheld, yet which I\ncould impart to no one, and found daily more difficult to reproduce\neven before my own mental vision.\n\nOne day, about eleven months after my return from Spaceland, I tried to\nsee a Cube with my eye closed, but failed; and though I succeeded\nafterwards, I was not then quite certain (nor have I been ever\nafterwards) that I had exactly realized the original.  This made me\nmore melancholy than before, and determined me to take some step; yet\nwhat, I knew not.  I felt that I would have been willing to sacrifice\nmy life for the Cause, if thereby I could have produced conviction.\nBut if I could not convince my Grandson, how could I convince the\nhighest and most developed Circles in the land?\n\nAnd yet at times my spirit was too strong for me, and I gave vent to\ndangerous utterances.  Already I was considered heterodox if not\ntreasonable, and I was keenly alive to the danger of my position;\nnevertheless I could not at times refrain from bursting out into\nsuspicious or half-seditious utterances, even among the highest\nPolygonal and Circular society.  When, for example, the question arose\nabout the treatment of those lunatics who said that they had received\nthe power of seeing the insides of things, I would quote the saying of\nan ancient Circle, who declared that prophets and inspired people are\nalways considered by the majority to be mad; and I could not help\noccasionally dropping such expressions as \"the eye that discerns the\ninteriors of things\", and \"the all-seeing land\"; once or twice I even\nlet fall the forbidden terms \"the Third and Fourth Dimensions\".  At\nlast, to complete a series of minor indiscretions, at a meeting of our\nLocal Speculative Society held at the palace of the Prefect\nhimself,--some extremely silly person having read an elaborate paper\nexhibiting the precise reasons why Providence has limited the number of\nDimensions to Two, and why the attribute of omnividence is assigned to\nthe Supreme alone--I so far forgot myself as to give an exact account\nof the whole of my voyage with the Sphere into Space, and to the\nAssembly Hall in our Metropolis, and then to Space again, and of my\nreturn home, and of everything that I had seen and heard in fact or\nvision.  At first, indeed, I pretended that I was describing the\nimaginary experiences of a fictitious person; but my enthusiasm soon\nforced me to throw off all disguise, and finally, in a fervent\nperoration, I exhorted all my hearers to divest themselves of prejudice\nand to become believers in the Third Dimension.\n\nNeed I say that I was at once arrested and taken before the Council?\n\nNext morning, standing in the very place where but a very few months\nago the Sphere had stood in my company, I was allowed to begin and to\ncontinue my narration unquestioned and uninterrupted.  But from the\nfirst I foresaw my fate; for the President, noting that a guard of the\nbetter sort of Policemen was in attendance, of angularity little, if at\nall, under 55 degrees, ordered them to be relieved before I began my\ndefence, by an inferior class of 2 or 3 degrees.  I knew only too well\nwhat that meant.  I was to be executed or imprisoned, and my story was\nto be kept secret from the world by the simultaneous destruction of the\nofficials who had heard it; and, this being the case, the President\ndesired to substitute the cheaper for the more expensive victims.\n\nAfter I had concluded my defence, the President, perhaps perceiving\nthat some of the junior Circles had been moved by my evident\nearnestness, asked me two questions:--\n\n1.  Whether I could indicate the direction which I meant when I used\nthe words \"Upward, not Northward\"?\n\n2.  Whether I could by any diagrams or descriptions (other than the\nenumeration of imaginary sides and angles) indicate the Figure I was\npleased to call a Cube?\n\nI declared that I could say nothing more, and that I must commit myself\nto the Truth, whose cause would surely prevail in the end.\n\nThe President replied that he quite concurred in my sentiment, and that\nI could not do better.  I must be sentenced to perpetual imprisonment;\nbut if the Truth intended that I should emerge from prison and\nevangelize the world, the Truth might be trusted to bring that result\nto pass.  Meanwhile I should be subjected to no discomfort that was not\nnecessary to preclude escape, and, unless I forfeited the privilege by\nmisconduct, I should be occasionally permitted to see my brother who\nhad preceded me to my prison.\n\nSeven years have elapsed and I am still a prisoner, and--if I except\nthe occasional visits of my brother--debarred from all companionship\nsave that of my jailers.  My brother is one of the best of Squares,\njust, sensible, cheerful, and not without fraternal affection; yet I\nconfess that my weekly interviews, at least in one respect, cause me\nthe bitterest pain.  He was present when the Sphere manifested himself\nin the Council Chamber; he saw the Sphere's changing sections; he heard\nthe explanation of the phenomena then given to the Circles.  Since that\ntime, scarcely a week has passed during seven whole years, without his\nhearing from me a repetition of the part I played in that\nmanifestation, together with ample descriptions of all the phenomena in\nSpaceland, and the arguments for the existence of Solid things\nderivable from Analogy.  Yet--I take shame to be forced to confess\nit--my brother has not yet grasped the nature of the Third Dimension,\nand frankly avows his disbelief in the existence of a Sphere.\n\nHence I am absolutely destitute of converts, and, for aught that I can\nsee, the millennial Revelation has been made to me for nothing.\nPrometheus up in Spaceland was bound for bringing down fire for\nmortals, but I--poor Flatland Prometheus--lie here in prison for\nbringing down nothing to my countrymen.  Yet I exist in the hope that\nthese memoirs, in some manner, I know not how, may find their way to\nthe minds of humanity in Some Dimension, and may stir up a race of\nrebels who shall refuse to be confined to limited Dimensionality.\n\nThat is the hope of my brighter moments.  Alas, it is not always so.\nHeavily weighs on me at times the burdensome reflection that I cannot\nhonestly say I am confident as to the exact shape of the once-seen,\noft-regretted Cube; and in my nightly visions the mysterious precept,\n\"Upward, not Northward\", haunts me like a soul-devouring Sphinx.  It is\npart of the martyrdom which I endure for the cause of the Truth that\nthere are seasons of mental weakness, when Cubes and Spheres flit away\ninto the background of scarce-possible existences; when the Land of\nThree Dimensions seems almost as visionary as the Land of One or None;\nnay, when even this hard wall that bars me from my freedom, these very\ntablets on which I am writing, and all the substantial realities of\nFlatland itself, appear no better than the offspring of a diseased\nimagination, or the baseless fabric of a dream.\n\n\n\n\n                           THE END of FLATLAND\n  -----------------------------------------------------------------\n  |                          THE END of                           |\n  |        ______                                                 |\n  |       /       /     /|   ------  /     /|      /|    /  /-.   |\n  |     /----   /     /__|    /    /     /__|    /  |  /  /   /   |\n  |   /       /___  /    |  /    /___  /    |  /    |/  /__.-'    |\n  |                                                               |\n  | The baseless fabric of my vision                              |\n  |                                 Melted into air into thin air |\n  | Such stuff as dreams are made of                              |\n  -----------------------------------------------------------------", "title": "Flatland: A Romance of Many Dimensions (Illustrated)"}