{"summary": "As originally published, De Quincey's account was organized into two parts:\nPart I begins with a notice \"To the Reader\", to establish the narrative frame: \"I here present you, courteous reader, with the record of a remarkable period in my life....\" It is followed by the substance of Part I,\nPreliminary Confessions, devoted to the author's childhood and youth, and concentrated upon the emotional and psychological factors that underlay the later opium experiences — especially the period in his late teens that de Quincey spent as a homeless runaway in Oxford Street in London in 1802 and 1803.\n\nPart II is split into several sections:\nA relatively brief introduction and connecting passage, followed by\nThe Pleasures of Opium, which discusses the early and largely positive phase of the author's experience with the drug, from 1804 until 1812;\nIntroduction to the Pains of Opium, which delivers a second installment of autobiography, taking De Quincey from youth to maturity; and\nThe Pains of Opium, which recounts the extreme of the author's opium experience (up to that time), with insomnia, nightmares, frightening visions, and difficult physical symptoms.\n\nAnother \"Notice to the Reader\" attempts to clarify the chronology of the whole.\n\nThough De Quincey was later criticized for giving too much attention to the pleasure of opium and not enough to the harsh negatives of addiction, The Pains of Opium is in fact significantly longer than The Pleasures. However, even when trying to convey darker truths, De Quincey's language can seem seduced by the compelling nature of the opium experience:\n\n\"The sense of space, and in the end, the sense of time, were both powerfully affected. Buildings, landscapes, &c. were exhibited in proportions so vast as the bodily eye is not fitted to conceive. Space swelled, and was amplified to an extent of unutterable infinity. This, however, did not disturb me so much as the vast expansion of time; I sometimes seemed to have lived for 70 or 100 years in one night; nay, sometimes had feelings representative of a millennium passed in that time, or, however, of a duration far beyond the limits of any human experience.\"\n\n", "full_text": "Transcribed from the 1886 George Routledge and Sons edition--first\nedition (London Magazine) text, by David Price, email\nccx074@coventry.ac.uk\n\n\n\n\n\nCONFESSIONS OF AN ENGLISH OPIUM-EATER:\nBEING AN EXTRACT FROM THE\nLIFE OF A SCHOLAR.\n\n\n_From the \"London Magazine\" for September_ 1821.\n\n\n\n\nTO THE READER\n\n\nI here present you, courteous reader, with the record of a remarkable\nperiod in my life: according to my application of it, I trust that it\nwill prove not merely an interesting record, but in a considerable degree\nuseful and instructive.  In _that_ hope it is that I have drawn it up;\nand _that_ must be my apology for breaking through that delicate and\nhonourable reserve which, for the most part, restrains us from the public\nexposure of our own errors and infirmities.  Nothing, indeed, is more\nrevolting to English feelings than the spectacle of a human being\nobtruding on our notice his moral ulcers or scars, and tearing away that\n\"decent drapery\" which time or indulgence to human frailty may have drawn\nover them; accordingly, the greater part of _our_ confessions (that is,\nspontaneous and extra-judicial confessions) proceed from demireps,\nadventurers, or swindlers: and for any such acts of gratuitous\nself-humiliation from those who can be supposed in sympathy with the\ndecent and self-respecting part of society, we must look to French\nliterature, or to that part of the German which is tainted with the\nspurious and defective sensibility of the French.  All this I feel so\nforcibly, and so nervously am I alive to reproach of this tendency, that\nI have for many months hesitated about the propriety of allowing this or\nany part of my narrative to come before the public eye until after my\ndeath (when, for many reasons, the whole will be published); and it is\nnot without an anxious review of the reasons for and against this step\nthat I have at last concluded on taking it.\n\nGuilt and misery shrink, by a natural instinct, from public notice: they\ncourt privacy and solitude: and even in their choice of a grave will\nsometimes sequester themselves from the general population of the\nchurchyard, as if declining to claim fellowship with the great family of\nman, and wishing (in the affecting language of Mr. Wordsworth)\n\n      Humbly to express\n   A penitential loneliness.\n\nIt is well, upon the whole, and for the interest of us all, that it\nshould be so: nor would I willingly in my own person manifest a disregard\nof such salutary feelings, nor in act or word do anything to weaken them;\nbut, on the one hand, as my self-accusation does not amount to a\nconfession of guilt, so, on the other, it is possible that, if it _did_,\nthe benefit resulting to others from the record of an experience\npurchased at so heavy a price might compensate, by a vast overbalance,\nfor any violence done to the feelings I have noticed, and justify a\nbreach of the general rule.  Infirmity and misery do not of necessity\nimply guilt.  They approach or recede from shades of that dark alliance,\nin proportion to the probable motives and prospects of the offender, and\nthe palliations, known or secret, of the offence; in proportion as the\ntemptations to it were potent from the first, and the resistance to it,\nin act or in effort, was earnest to the last.  For my own part, without\nbreach of truth or modesty, I may affirm that my life has been, on the\nwhole, the life of a philosopher: from my birth I was made an\nintellectual creature, and intellectual in the highest sense my pursuits\nand pleasures have been, even from my schoolboy days.  If opium-eating be\na sensual pleasure, and if I am bound to confess that I have indulged in\nit to an excess not yet _recorded_ {1} of any other man, it is no less\ntrue that I have struggled against this fascinating enthralment with a\nreligious zeal, and have at length accomplished what I never yet heard\nattributed to any other man--have untwisted, almost to its final links,\nthe accursed chain which fettered me.  Such a self-conquest may\nreasonably be set off in counterbalance to any kind or degree of self-\nindulgence.  Not to insist that in my case the self-conquest was\nunquestionable, the self-indulgence open to doubts of casuistry,\naccording as that name shall be extended to acts aiming at the bare\nrelief of pain, or shall be restricted to such as aim at the excitement\nof positive pleasure.\n\nGuilt, therefore, I do not acknowledge; and if I did, it is possible that\nI might still resolve on the present act of confession in consideration\nof the service which I may thereby render to the whole class of opium-\neaters.  But who are they?  Reader, I am sorry to say a very numerous\nclass indeed.  Of this I became convinced some years ago by computing at\nthat time the number of those in one small class of English society (the\nclass of men distinguished for talents, or of eminent station) who were\nknown to me, directly or indirectly, as opium-eaters; such, for instance,\nas the eloquent and benevolent ---, the late Dean of ---, Lord ---, Mr.\n--- the philosopher, a late Under-Secretary of State (who described to me\nthe sensation which first drove him to the use of opium in the very same\nwords as the Dean of ---, viz., \"that he felt as though rats were gnawing\nand abrading the coats of his stomach\"), Mr. ---, and many others hardly\nless known, whom it would be tedious to mention.  Now, if one class,\ncomparatively so limited, could furnish so many scores of cases (and\n_that_ within the knowledge of one single inquirer), it was a natural\ninference that the entire population of England would furnish a\nproportionable number.  The soundness of this inference, however, I\ndoubted, until some facts became known to me which satisfied me that it\nwas not incorrect.  I will mention two.  (1) Three respectable London\ndruggists, in widely remote quarters of London, from whom I happened\nlately to be purchasing small quantities of opium, assured me that the\nnumber of _amateur_ opium-eaters (as I may term them) was at this time\nimmense; and that the difficulty of distinguishing those persons to whom\nhabit had rendered opium necessary from such as were purchasing it with a\nview to suicide, occasioned them daily trouble and disputes.  This\nevidence respected London only.  But (2)--which will possibly surprise\nthe reader more--some years ago, on passing through Manchester, I was\ninformed by several cotton manufacturers that their workpeople were\nrapidly getting into the practice of opium-eating; so much so, that on a\nSaturday afternoon the counters of the druggists were strewed with pills\nof one, two, or three grains, in preparation for the known demand of the\nevening.  The immediate occasion of this practice was the lowness of\nwages, which at that time would not allow them to indulge in ale or\nspirits, and wages rising, it may be thought that this practice would\ncease; but as I do not readily believe that any man having once tasted\nthe divine luxuries of opium will afterwards descend to the gross and\nmortal enjoyments of alcohol, I take it for granted\n\n   That those eat now who never ate before;\n   And those who always ate, now eat the more.\n\nIndeed, the fascinating powers of opium are admitted even by medical\nwriters, who are its greatest enemies.  Thus, for instance, Awsiter,\napothecary to Greenwich Hospital, in his \"Essay on the Effects of Opium\"\n(published in the year 1763), when attempting to explain why Mead had not\nbeen sufficiently explicit on the properties, counteragents, &c., of this\ndrug, expresses himself in the following mysterious terms ([Greek text]):\n\"Perhaps he thought the subject of too delicate a nature to be made\ncommon; and as many people might then indiscriminately use it, it would\ntake from that necessary fear and caution which should prevent their\nexperiencing the extensive power of this drug, _for there are many\nproperties in it, if universally known, that would habituate the use, and\nmake it more in request with us than with Turks themselves_; the result\nof which knowledge,\" he adds, \"must prove a general misfortune.\"  In the\nnecessity of this conclusion I do not altogether concur; but upon that\npoint I shall have occasion to speak at the close of my Confessions,\nwhere I shall present the reader with the _moral_ of my narrative.\n\n\n\n\nPRELIMINARY CONFESSIONS\n\n\nThese preliminary confessions, or introductory narrative of the youthful\nadventures which laid the foundation of the writer's habit of\nopium-eating in after-life, it has been judged proper to premise, for\nthree several reasons:\n\n1.  As forestalling that question, and giving it a satisfactory answer,\nwhich else would painfully obtrude itself in the course of the Opium\nConfessions--\"How came any reasonable being to subject himself to such a\nyoke of misery; voluntarily to incur a captivity so servile, and\nknowingly to fetter himself with such a sevenfold chain?\"--a question\nwhich, if not somewhere plausibly resolved, could hardly fail, by the\nindignation which it would be apt to raise as against an act of wanton\nfolly, to interfere with that degree of sympathy which is necessary in\nany case to an author's purposes.\n\n2.  As furnishing a key to some parts of that tremendous scenery which\nafterwards peopled the dreams of the Opium-eater.\n\n3.  As creating some previous interest of a personal sort in the\nconfessing subject, apart from the matter of the confessions, which\ncannot fail to render the confessions themselves more interesting.  If a\nman \"whose talk is of oxen\" should become an opium-eater, the probability\nis that (if he is not too dull to dream at all) he will dream about oxen;\nwhereas, in the case before him, the reader will find that the\nOpium-eater boasteth himself to be a philosopher; and accordingly, that\nthe phantasmagoria of _his_ dreams (waking or sleeping, day-dreams or\nnight-dreams) is suitable to one who in that character\n\n   Humani nihil a se alienum putat.\n\nFor amongst the conditions which he deems indispensable to the sustaining\nof any claim to the title of philosopher is not merely the possession of\na superb intellect in its _analytic_ functions (in which part of the\npretensions, however, England can for some generations show but few\nclaimants; at least, he is not aware of any known candidate for this\nhonour who can be styled emphatically _a subtle thinker_, with the\nexception of _Samuel Taylor Coleridge_, and in a narrower department of\nthought with the recent illustrious exception {2} of _David Ricardo_) but\nalso on such a constitution of the _moral_ faculties as shall give him an\ninner eye and power of intuition for the vision and the mysteries of our\nhuman nature: _that_ constitution of faculties, in short, which (amongst\nall the generations of men that from the beginning of time have deployed\ninto life, as it were, upon this planet) our English poets have possessed\nin the highest degree, and Scottish professors {3} in the lowest.\n\nI have often been asked how I first came to be a regular opium-eater, and\nhave suffered, very unjustly, in the opinion of my acquaintance from\nbeing reputed to have brought upon myself all the sufferings which I\nshall have to record, by a long course of indulgence in this practice\npurely for the sake of creating an artificial state of pleasurable\nexcitement.  This, however, is a misrepresentation of my case.  True it\nis that for nearly ten years I did occasionally take opium for the sake\nof the exquisite pleasure it gave me; but so long as I took it with this\nview I was effectually protected from all material bad consequences by\nthe necessity of interposing long intervals between the several acts of\nindulgence, in order to renew the pleasurable sensations.  It was not for\nthe purpose of creating pleasure, but of mitigating pain in the severest\ndegree, that I first began to use opium as an article of daily diet.  In\nthe twenty-eighth year of my age a most painful affection of the stomach,\nwhich I had first experienced about ten years before, attacked me in\ngreat strength.  This affection had originally been caused by extremities\nof hunger, suffered in my boyish days.  During the season of hope and\nredundant happiness which succeeded (that is, from eighteen to twenty-\nfour) it had slumbered; for the three following years it had revived at\nintervals; and now, under unfavourable circumstances, from depression of\nspirits, it attacked me with a violence that yielded to no remedies but\nopium.  As the youthful sufferings which first produced this derangement\nof the stomach were interesting in themselves, and in the circumstances\nthat attended them, I shall here briefly retrace them.\n\nMy father died when I was about seven years old, and left me to the care\nof four guardians.  I was sent to various schools, great and small; and\nwas very early distinguished for my classical attainments, especially for\nmy knowledge of Greek.  At thirteen I wrote Greek with ease; and at\nfifteen my command of that language was so great that I not only composed\nGreek verses in lyric metres, but could converse in Greek fluently and\nwithout embarrassment--an accomplishment which I have not since met with\nin any scholar of my times, and which in my case was owing to the\npractice of daily reading off the newspapers into the best Greek I could\nfurnish _extempore_; for the necessity of ransacking my memory and\ninvention for all sorts and combinations of periphrastic expressions as\nequivalents for modern ideas, images, relations of things, &c., gave me a\ncompass of diction which would never have been called out by a dull\ntranslation of moral essays, &c.  \"That boy,\" said one of my masters,\npointing the attention of a stranger to me, \"that boy could harangue an\nAthenian mob better than you and I could address an English one.\"  He who\nhonoured me with this eulogy was a scholar, \"and a ripe and a good one,\"\nand of all my tutors was the only one whom I loved or reverenced.\nUnfortunately for me (and, as I afterwards learned, to this worthy man's\ngreat indignation), I was transferred to the care, first of a blockhead,\nwho was in a perpetual panic lest I should expose his ignorance; and\nfinally to that of a respectable scholar at the head of a great school on\nan ancient foundation.  This man had been appointed to his situation by\n--- College, Oxford, and was a sound, well-built scholar, but (like most\nmen whom I have known from that college) coarse, clumsy, and inelegant.  A\nmiserable contrast he presented, in my eyes, to the Etonian brilliancy of\nmy favourite master; and beside, he could not disguise from my hourly\nnotice the poverty and meagreness of his understanding.  It is a bad\nthing for a boy to be and to know himself far beyond his tutors, whether\nin knowledge or in power of mind.  This was the case, so far as regarded\nknowledge at least, not with myself only, for the two boys, who jointly\nwith myself composed the first form, were better Grecians than the head-\nmaster, though not more elegant scholars, nor at all more accustomed to\nsacrifice to the Graces.  When I first entered I remember that we read\nSophocles; and it was a constant matter of triumph to us, the learned\ntriumvirate of the first form, to see our \"Archididascalus\" (as he loved\nto be called) conning our lessons before we went up, and laying a regular\ntrain, with lexicon and grammar, for blowing up and blasting (as it were)\nany difficulties he found in the choruses; whilst _we_ never condescended\nto open our books until the moment of going up, and were generally\nemployed in writing epigrams upon his wig or some such important matter.\nMy two class-fellows were poor, and dependent for their future prospects\nat the university on the recommendation of the head-master; but I, who\nhad a small patrimonial property, the income of which was sufficient to\nsupport me at college, wished to be sent thither immediately.  I made\nearnest representations on the subject to my guardians, but all to no\npurpose.  One, who was more reasonable and had more knowledge of the\nworld than the rest, lived at a distance; two of the other three resigned\nall their authority into the hands of the fourth; and this fourth, with\nwhom I had to negotiate, was a worthy man in his way, but haughty,\nobstinate, and intolerant of all opposition to his will.  After a certain\nnumber of letters and personal interviews, I found that I had nothing to\nhope for, not even a compromise of the matter, from my guardian.\nUnconditional submission was what he demanded, and I prepared myself,\ntherefore, for other measures.  Summer was now coming on with hasty\nsteps, and my seventeenth birthday was fast approaching, after which day\nI had sworn within myself that I would no longer be numbered amongst\nschoolboys.  Money being what I chiefly wanted, I wrote to a woman of\nhigh rank, who, though young herself, had known me from a child, and had\nlatterly treated me with great distinction, requesting that she would\n\"lend\" me five guineas.  For upwards of a week no answer came, and I was\nbeginning to despond, when at length a servant put into my hands a double\nletter with a coronet on the seal.  The letter was kind and obliging.  The\nfair writer was on the sea-coast, and in that way the delay had arisen;\nshe enclosed double of what I had asked, and good-naturedly hinted that\nif I should _never_ repay her, it would not absolutely ruin her.  Now,\nthen, I was prepared for my scheme.  Ten guineas, added to about two\nwhich I had remaining from my pocket-money, seemed to me sufficient for\nan indefinite length of time; and at that happy age, if no _definite_\nboundary can be assigned to one's power, the spirit of hope and pleasure\nmakes it virtually infinite.\n\nIt is a just remark of Dr. Johnson's (and, what cannot often be said of\nhis remarks, it is a very feeling one), that we never do anything\nconsciously for the last time (of things, that is, which we have long\nbeen in the habit of doing) without sadness of heart.  This truth I felt\ndeeply when I came to leave ---, a place which I did not love, and where\nI had not been happy.  On the evening before I left --- for ever, I\ngrieved when the ancient and lofty schoolroom resounded with the evening\nservice, performed for the last time in my hearing; and at night, when\nthe muster-roll of names was called over, and mine (as usual) was called\nfirst, I stepped forward, and passing the head-master, who was standing\nby, I bowed to him, and looked earnestly in his face, thinking to myself,\n\"He is old and infirm, and in this world I shall not see him again.\"  I\nwas right; I never _did_ see him again, nor ever shall.  He looked at me\ncomplacently, smiled good-naturedly, returned my salutation (or rather my\nvalediction), and we parted (though he knew it not) for ever.  I could\nnot reverence him intellectually, but he had been uniformly kind to me,\nand had allowed me many indulgences; and I grieved at the thought of the\nmortification I should inflict upon him.\n\nThe morning came which was to launch me into the world, and from which my\nwhole succeeding life has in many important points taken its colouring.  I\nlodged in the head-master's house, and had been allowed from my first\nentrance the indulgence of a private room, which I used both as a\nsleeping-room and as a study.  At half after three I rose, and gazed with\ndeep emotion at the ancient towers of ---, \"drest in earliest light,\" and\nbeginning to crimson with the radiant lustre of a cloudless July morning.\nI was firm and immovable in my purpose; but yet agitated by anticipation\nof uncertain danger and troubles; and if I could have foreseen the\nhurricane and perfect hail-storm of affliction which soon fell upon me,\nwell might I have been agitated.  To this agitation the deep peace of the\nmorning presented an affecting contrast, and in some degree a medicine.\nThe silence was more profound than that of midnight; and to me the\nsilence of a summer morning is more touching than all other silence,\nbecause, the light being broad and strong as that of noonday at other\nseasons of the year, it seems to differ from perfect day chiefly because\nman is not yet abroad; and thus the peace of nature and of the innocent\ncreatures of God seems to be secure and deep only so long as the presence\nof man and his restless and unquiet spirit are not there to trouble its\nsanctity.  I dressed myself, took my hat and gloves, and lingered a\nlittle in the room.  For the last year and a half this room had been my\n\"pensive citadel\": here I had read and studied through all the hours of\nnight, and though true it was that for the latter part of this time I,\nwho was framed for love and gentle affections, had lost my gaiety and\nhappiness during the strife and fever of contention with my guardian,\nyet, on the other hand, as a boy so passionately fond of books, and\ndedicated to intellectual pursuits, I could not fail to have enjoyed many\nhappy hours in the midst of general dejection.  I wept as I looked round\non the chair, hearth, writing-table, and other familiar objects, knowing\ntoo certainly that I looked upon them for the last time.  Whilst I write\nthis it is eighteen years ago, and yet at this moment I see distinctly,\nas if it were yesterday, the lineaments and expression of the object on\nwhich I fixed my parting gaze.  It was a picture of the lovely ---, which\nhung over the mantelpiece, the eyes and mouth of which were so beautiful,\nand the whole countenance so radiant with benignity and divine\ntranquillity, that I had a thousand times laid down my pen or my book to\ngather consolation from it, as a devotee from his patron saint.  Whilst I\nwas yet gazing upon it the deep tones of --- clock proclaimed that it was\nfour o'clock.  I went up to the picture, kissed it, and then gently\nwalked out and closed the door for ever!\n\n* * * * *\n\nSo blended and intertwisted in this life are occasions of laughter and of\ntears, that I cannot yet recall without smiling an incident which\noccurred at that time, and which had nearly put a stop to the immediate\nexecution of my plan.  I had a trunk of immense weight, for, besides my\nclothes, it contained nearly all my library.  The difficulty was to get\nthis removed to a carrier's: my room was at an aerial elevation in the\nhouse, and (what was worse) the staircase which communicated with this\nangle of the building was accessible only by a gallery, which passed the\nhead-master's chamber door.  I was a favourite with all the servants, and\nknowing that any of them would screen me and act confidentially, I\ncommunicated my embarrassment to a groom of the head-master's.  The groom\nswore he would do anything I wished, and when the time arrived went\nupstairs to bring the trunk down.  This I feared was beyond the strength\nof any one man; however, the groom was a man\n\n   Of Atlantean shoulders, fit to bear\n   The weight of mightiest monarchies;\n\nand had a back as spacious as Salisbury Plain.  Accordingly he persisted\nin bringing down the trunk alone, whilst I stood waiting at the foot of\nthe last flight in anxiety for the event.  For some time I heard him\ndescending with slow and firm steps; but unfortunately, from his\ntrepidation, as he drew near the dangerous quarter, within a few steps of\nthe gallery, his foot slipped, and the mighty burden falling from his\nshoulders, gained such increase of impetus at each step of the descent,\nthat on reaching the bottom it trundled, or rather leaped, right across,\nwith the noise of twenty devils, against the very bedroom door of the\nArchididascalus.  My first thought was that all was lost, and that my\nonly chance for executing a retreat was to sacrifice my baggage.  However,\non reflection I determined to abide the issue.  The groom was in the\nutmost alarm, both on his own account and on mine, but, in spite of this,\nso irresistibly had the sense of the ludicrous in this unhappy\n_contretemps_ taken possession of his fancy, that he sang out a long,\nloud, and canorous peal of laughter, that might have wakened the Seven\nSleepers.  At the sound of this resonant merriment, within the very ears\nof insulted authority, I could not myself forbear joining in it; subdued\nto this, not so much by the unhappy _etourderie_ of the trunk, as by the\neffect it had upon the groom.  We both expected, as a matter of course,\nthat Dr. --- would sally, out of his room, for in general, if but a mouse\nstirred, he sprang out like a mastiff from his kennel.  Strange to say,\nhowever, on this occasion, when the noise of laughter had ceased, no\nsound, or rustling even, was to be heard in the bedroom.  Dr. --- had a\npainful complaint, which, sometimes keeping him awake, made his sleep\nperhaps, when it did come, the deeper.  Gathering courage from the\nsilence, the groom hoisted his burden again, and accomplished the\nremainder of his descent without accident.  I waited until I saw the\ntrunk placed on a wheelbarrow and on its road to the carrier's; then,\n\"with Providence my guide,\" I set off on foot, carrying a small parcel\nwith some articles of dress under my arm; a favourite English poet in one\npocket, and a small 12mo volume, containing about nine plays of\nEuripides, in the other.\n\nIt had been my intention originally to proceed to Westmoreland, both from\nthe love I bore to that country and on other personal accounts.  Accident,\nhowever, gave a different direction to my wanderings, and I bent my steps\ntowards North Wales.\n\nAfter wandering about for some time in Denbighshire, Merionethshire, and\nCarnarvonshire, I took lodgings in a small neat house in B---.  Here I\nmight have stayed with great comfort for many weeks, for provisions were\ncheap at B---, from the scarcity of other markets for the surplus produce\nof a wide agricultural district.  An accident, however, in which perhaps\nno offence was designed, drove me out to wander again.  I know not\nwhether my reader may have remarked, but I have often remarked, that the\nproudest class of people in England (or at any rate the class whose pride\nis most apparent) are the families of bishops.  Noblemen and their\nchildren carry about with them, in their very titles, a sufficient\nnotification of their rank.  Nay, their very names (and this applies also\nto the children of many untitled houses) are often, to the English ear,\nadequate exponents of high birth or descent.  Sackville, Manners,\nFitzroy, Paulet, Cavendish, and scores of others, tell their own tale.\nSuch persons, therefore, find everywhere a due sense of their claims\nalready established, except among those who are ignorant of the world by\nvirtue of their own obscurity: \"Not to know _them_, argues one's self\nunknown.\"  Their manners take a suitable tone and colouring, and for once\nthey find it necessary to impress a sense of their consequence upon\nothers, they meet with a thousand occasions for moderating and tempering\nthis sense by acts of courteous condescension.  With the families of\nbishops it is otherwise: with them, it is all uphill work to make known\ntheir pretensions; for the proportion of the episcopal bench taken from\nnoble families is not at any time very large, and the succession to these\ndignities is so rapid that the public ear seldom has time to become\nfamiliar with them, unless where they are connected with some literary\nreputation.  Hence it is that the children of bishops carry about with\nthem an austere and repulsive air, indicative of claims not generally\nacknowledged, a sort of _noli me tangere_ manner, nervously apprehensive\nof too familiar approach, and shrinking with the sensitiveness of a gouty\nman from all contact with the [Greek text].  Doubtless, a powerful\nunderstanding, or unusual goodness of nature, will preserve a man from\nsuch weakness, but in general the truth of my representation will be\nacknowledged; pride, if not of deeper root in such families, appears at\nleast more upon the surface of their manners.  This spirit of manners\nnaturally communicates itself to their domestics and other dependants.\nNow, my landlady had been a lady's maid or a nurse in the family of the\nBishop of ---, and had but lately married away and \"settled\" (as such\npeople express it) for life.  In a little town like B---, merely to have\nlived in the bishop's family conferred some distinction; and my good\nlandlady had rather more than her share of the pride I have noticed on\nthat score.  What \"my lord\" said and what \"my lord\" did, how useful he\nwas in Parliament and how indispensable at Oxford, formed the daily\nburden of her talk.  All this I bore very well, for I was too\ngood-natured to laugh in anybody's face, and I could make an ample\nallowance for the garrulity of an old servant.  Of necessity, however, I\nmust have appeared in her eyes very inadequately impressed with the\nbishop's importance, and, perhaps to punish me for my indifference, or\npossibly by accident, she one day repeated to me a conversation in which\nI was indirectly a party concerned.  She had been to the palace to pay\nher respects to the family, and, dinner being over, was summoned into the\ndining-room.  In giving an account of her household economy she happened\nto mention that she had let her apartments.  Thereupon the good bishop\n(it seemed) had taken occasion to caution her as to her selection of\ninmates, \"for,\" said he, \"you must recollect, Betty, that this place is\nin the high road to the Head; so that multitudes of Irish swindlers\nrunning away from their debts into England, and of English swindlers\nrunning away from their debts to the Isle of Man, are likely to take this\nplace in their route.\"  This advice certainly was not without reasonable\ngrounds, but rather fitted to be stored up for Mrs. Betty's private\nmeditations than specially reported to me.  What followed, however, was\nsomewhat worse.  \"Oh, my lord,\" answered my landlady (according to her\nown representation of the matter), \"I really don't think this young\ngentleman is a swindler, because ---\"  \"You don't _think_ me a swindler?\"\nsaid I, interrupting her, in a tumult of indignation: \"for the future I\nshall spare you the trouble of thinking about it.\"  And without delay I\nprepared for my departure.  Some concessions the good woman seemed\ndisposed to make; but a harsh and contemptuous expression, which I fear\nthat I applied to the learned dignitary himself, roused her indignation\nin turn, and reconciliation then became impossible.  I was indeed greatly\nirritated at the bishop's having suggested any grounds of suspicion,\nhowever remotely, against a person whom he had never seen; and I thought\nof letting him know my mind in Greek, which, at the same time that it\nwould furnish some presumption that I was no swindler, would also (I\nhoped) compel the bishop to reply in the same language; in which case I\ndoubted not to make it appear that if I was not so rich as his lordship,\nI was a far better Grecian.  Calmer thoughts, however, drove this boyish\ndesign out of my mind; for I considered that the bishop was in the right\nto counsel an old servant; that he could not have designed that his\nadvice should be reported to me; and that the same coarseness of mind\nwhich had led Mrs. Betty to repeat the advice at all, might have coloured\nit in a way more agreeable to her own style of thinking than to the\nactual expressions of the worthy bishop.\n\nI left the lodgings the very same hour, and this turned out a very\nunfortunate occurrence for me, because, living henceforward at inns, I\nwas drained of my money very rapidly.  In a fortnight I was reduced to\nshort allowance; that is, I could allow myself only one meal a day.  From\nthe keen appetite produced by constant exercise and mountain air, acting\non a youthful stomach, I soon began to suffer greatly on this slender\nregimen, for the single meal which I could venture to order was coffee or\ntea.  Even this, however, was at length withdrawn; and afterwards, so\nlong as I remained in Wales, I subsisted either on blackberries, hips,\nhaws, &c., or on the casual hospitalities which I now and then received\nin return for such little services as I had an opportunity of rendering.\nSometimes I wrote letters of business for cottagers who happened to have\nrelatives in Liverpool or in London; more often I wrote love-letters to\ntheir sweethearts for young women who had lived as servants at Shrewsbury\nor other towns on the English border.  On all such occasions I gave great\nsatisfaction to my humble friends, and was generally treated with\nhospitality; and once in particular, near the village of Llan-y-styndw\n(or some such name), in a sequestered part of Merionethshire, I was\nentertained for upwards of three days by a family of young people with an\naffectionate and fraternal kindness that left an impression upon my heart\nnot yet impaired.  The family consisted at that time of four sisters and\nthree brothers, all grown up, and all remarkable for elegance and\ndelicacy of manners.  So much beauty, and so much native good breeding\nand refinement, I do not remember to have seen before or since in any\ncottage, except once or twice in Westmoreland and Devonshire.  They spoke\nEnglish, an accomplishment not often met with in so many members of one\nfamily, especially in villages remote from the high road.  Here I wrote,\non my first introduction, a letter about prize-money, for one of the\nbrothers, who had served on board an English man-of-war; and, more\nprivately, two love-letters for two of the sisters.  They were both\ninteresting-looking girls, and one of uncommon loveliness.  In the midst\nof their confusion and blushes, whilst dictating, or rather giving me\ngeneral instructions, it did not require any great penetration to\ndiscover that what they wished was that their letters should be as kind\nas was consistent with proper maidenly pride.  I contrived so to temper\nmy expressions as to reconcile the gratification of both feelings; and\nthey were as much pleased with the way in which I had expressed their\nthoughts as (in their simplicity) they were astonished at my having so\nreadily discovered them.  The reception one meets with from the women of\na family generally determines the tenor of one's whole entertainment.  In\nthis case I had discharged my confidential duties as secretary so much to\nthe general satisfaction, perhaps also amusing them with my conversation,\nthat I was pressed to stay with a cordiality which I had little\ninclination to resist.  I slept with the brothers, the only unoccupied\nbed standing in the apartment of the young women; but in all other points\nthey treated me with a respect not usually paid to purses as light as\nmine--as if my scholarship were sufficient evidence that I was of \"gentle\nblood.\"  Thus I lived with them for three days and great part of a\nfourth; and, from the undiminished kindness which they continued to show\nme, I believe I might have stayed with them up to this time, if their\npower had corresponded with their wishes.  On the last morning, however,\nI perceived upon their countenances, as they sate at breakfast, the\nexpression of some unpleasant communication which was at hand; and soon\nafter, one of the brothers explained to me that their parents had gone,\nthe day before my arrival, to an annual meeting of Methodists, held at\nCarnarvon, and were that day expected to return; \"and if they should not\nbe so civil as they ought to be,\" he begged, on the part of all the young\npeople, that I would not take it amiss.  The parents returned with\nchurlish faces, and \"_Dym Sassenach_\" (_no English_) in answer to all my\naddresses.  I saw how matters stood; and so, taking an affectionate leave\nof my kind and interesting young hosts, I went my way; for, though they\nspoke warmly to their parents in my behalf, and often excused the manner\nof the old people by saying it was \"only their way,\" yet I easily\nunderstood that my talent for writing love-letters would do as little to\nrecommend me with two grave sexagenarian Welsh Methodists as my Greek\nsapphics or alcaics; and what had been hospitality when offered to me\nwith the gracious courtesy of my young friends, would become charity when\nconnected with the harsh demeanour of these old people.  Certainly, Mr.\nShelley is right in his notions about old age: unless powerfully\ncounteracted by all sorts of opposite agencies, it is a miserable\ncorrupter and blighter to the genial charities of the human heart.\n\nSoon after this I contrived, by means which I must omit for want of room,\nto transfer myself to London.  And now began the latter and fiercer stage\nof my long sufferings; without using a disproportionate expression I\nmight say, of my agony.  For I now suffered, for upwards of sixteen\nweeks, the physical anguish of hunger in.  I various degrees of\nintensity, but as bitter perhaps as ever any human being can have\nsuffered who has survived it would not needlessly harass my reader's\nfeelings by a detail of all that I endured; for extremities such as\nthese, under any circumstances of heaviest misconduct or guilt, cannot be\ncontemplated, even in description, without a rueful pity that is painful\nto the natural goodness of the human heart.  Let it suffice, at least on\nthis occasion, to say that a few fragments of bread from the breakfast-\ntable of one individual (who supposed me to be ill, but did not know of\nmy being in utter want), and these at uncertain intervals, constituted my\nwhole support.  During the former part of my sufferings (that is,\ngenerally in Wales, and always for the first two months in London) I was\nhouseless, and very seldom slept under a roof.   To this constant\nexposure to the open air I ascribe it mainly that I did not sink under my\ntorments.  Latterly, however, when colder and more inclement weather came\non, and when, from the length of my sufferings, I had begun to sink into\na more languishing condition, it was no doubt fortunate for me that the\nsame person to whose breakfast-table I had access, allowed me to sleep in\na large unoccupied house of which he was tenant.  Unoccupied I call it,\nfor there was no household or establishment in it; nor any furniture,\nindeed, except a table and a few chairs.  But I found, on taking\npossession of my new quarters, that the house already contained one\nsingle inmate, a poor friendless child, apparently ten years old; but she\nseemed hunger-bitten, and sufferings of that sort often make children\nlook older than they are.  From this forlorn child I learned that she had\nslept and lived there alone for some time before I came; and great joy\nthe poor creature expressed when she found that I was in future to be her\ncompanion through the hours of darkness.  The house was large, and, from\nthe want of furniture, the noise of the rats made a prodigious echoing on\nthe spacious staircase and hall; and amidst the real fleshly ills of cold\nand, I fear, hunger, the forsaken child had found leisure to suffer still\nmore (it appeared) from the self-created one of ghosts.  I promised her\nprotection against all ghosts whatsoever, but alas! I could offer her no\nother assistance.  We lay upon the floor, with a bundle of cursed law\npapers for a pillow, but with no other covering than a sort of large\nhorseman's cloak; afterwards, however, we discovered in a garret an old\nsofa-cover, a small piece of rug, and some fragments of other articles,\nwhich added a little to our warmth.  The poor child crept close to me for\nwarmth, and for security against her ghostly enemies.  When I was not\nmore than usually ill I took her into my arms, so that in general she was\ntolerably warm, and often slept when I could not, for during the last two\nmonths of my sufferings I slept much in daytime, and was apt to fall into\ntransient dosings at all hours.  But my sleep distressed me more than my\nwatching, for beside the tumultuousness of my dreams (which were only not\nso awful as those which I shall have to describe hereafter as produced by\nopium), my sleep was never more than what is called _dog-sleep_; so that\nI could hear myself moaning, and was often, as it seemed to me, awakened\nsuddenly by my own voice; and about this time a hideous sensation began\nto haunt me as soon as I fell into a slumber, which has since returned\nupon me at different periods of my life--viz., a sort of twitching (I\nknow not where, but apparently about the region of the stomach) which\ncompelled me violently to throw out my feet for the sake of relieving it.\nThis sensation coming on as soon as I began to sleep, and the effort to\nrelieve it constantly awaking me, at length I slept only from exhaustion;\nand from increasing weakness (as I said before) I was constantly falling\nasleep and constantly awaking.  Meantime, the master of the house\nsometimes came in upon us suddenly, and very early; sometimes not till\nten o'clock, sometimes not at all.  He was in constant fear of bailiffs.\nImproving on the plan of Cromwell, every night he slept in a different\nquarter of London; and I observed that he never failed to examine through\na private window the appearance of those who knocked at the door before\nhe would allow it to be opened.  He breaksfasted alone; indeed, his tea\nequipage would hardly have admitted of his hazarding an invitation to a\nsecond person, any more than the quantity of esculent _materiel_, which\nfor the most part was little more than a roll or a few biscuits which he\nhad bought on his road from the place where he had slept.  Or, if he\n_had_ asked a party--as I once learnedly and facetiously observed to\nhim--the several members of it must have _stood_ in the relation to each\nother (not _sate_ in any relation whatever) of succession, as the\nmetaphysicians have it, and not of a coexistence; in the relation of the\nparts of time, and not of the parts of space.  During his breakfast I\ngenerally contrived a reason for lounging in, and, with an air of as much\nindifference as I could assume, took up such fragments as he had left;\nsometimes, indeed, there were none at all.  In doing this I committed no\nrobbery except upon the man himself, who was thus obliged (I believe) now\nand then to send out at noon for an extra biscuit; for as to the poor\nchild, _she_ was never admitted into his study (if I may give that name\nto his chief depository of parchments, law writings, &c.); that room was\nto her the Bluebeard room of the house, being regularly locked on his\ndeparture to dinner, about six o'clock, which usually was his final\ndeparture for the night.  Whether this child were an illegitimate\ndaughter of Mr. ---, or only a servant, I could not ascertain; she did\nnot herself know; but certainly she was treated altogether as a menial\nservant.  No sooner did Mr. --- make his appearance than she went below\nstairs, brushed his shoes, coat, &c.; and, except when she was summoned\nto run an errand, she never emerged from the dismal Tartarus of the\nkitchen, &c., to the upper air until my welcome knock at night called up\nher little trembling footsteps to the front door.  Of her life during the\ndaytime, however, I knew little but what I gathered from her own account\nat night, for as soon as the hours of business commenced I saw that my\nabsence would be acceptable, and in general, therefore, I went off and\nsate in the parks or elsewhere until nightfall.\n\nBut who and what, meantime, was the master of the house himself?  Reader,\nhe was one of those anomalous practitioners in lower departments of the\nlaw who--what shall I say?--who on prudential reasons, or from necessity,\ndeny themselves all indulgence in the luxury of too delicate a\nconscience, (a periphrasis which might be abridged considerably, but\n_that_ I leave to the reader's taste): in many walks of life a conscience\nis a more expensive encumbrance than a wife or a carriage; and just as\npeople talk of \"laying down\" their carriages, so I suppose my friend Mr.\n--- had \"laid down\" his conscience for a time, meaning, doubtless, to\nresume it as soon as he could afford it.  The inner economy of such a\nman's daily life would present a most strange picture, if I could allow\nmyself to amuse the reader at his expense.  Even with my limited\nopportunities for observing what went on, I saw many scenes of London\nintrigues and complex chicanery, \"cycle and epicycle, orb in orb,\" at\nwhich I sometimes smile to this day, and at which I smiled then, in spite\nof my misery.  My situation, however, at that time gave me little\nexperience in my own person of any qualities in Mr. ---'s character but\nsuch as did him honour; and of his whole strange composition I must\nforget everything but that towards me he was obliging, and to the extent\nof his power, generous.\n\nThat power was not, indeed, very extensive; however, in common with the\nrats, I sate rent free; and as Dr. Johnson has recorded that he never but\nonce in his life had as much wall-fruit as he could eat, so let me be\ngrateful that on that single occasion I had as large a choice of\napartments in a London mansion as I could possibly desire.  Except the\nBluebeard room, which the poor child believed to be haunted, all others,\nfrom the attics to the cellars, were at our service; \"the world was all\nbefore us,\" and we pitched our tent for the night in any spot we chose.\nThis house I have already described as a large one; it stands in a\nconspicuous situation and in a well-known part of London.  Many of my\nreaders will have passed it, I doubt not, within a few hours of reading\nthis.  For myself, I never fail to visit it when business draws me to\nLondon; about ten o'clock this very night, August 15, 1821--being my\nbirthday--I turned aside from my evening walk down Oxford Street,\npurposely to take a glance at it; it is now occupied by a respectable\nfamily, and by the lights in the front drawing-room I observed a domestic\nparty assembled, perhaps at tea, and apparently cheerful and gay.\nMarvellous contrast, in my eyes, to the darkness, cold, silence, and\ndesolation of that same house eighteen years ago, when its nightly\noccupants were one famishing scholar and a neglected child.  Her, by-the-\nbye, in after-years I vainly endeavoured to trace.  Apart from her\nsituation, she was not what would be called an interesting child; she was\nneither pretty, nor quick in understanding, nor remarkably pleasing in\nmanners.  But, thank God! even in those years I needed not the\nembellishments of novel accessories to conciliate my affections: plain\nhuman nature, in its humblest and most homely apparel, was enough for me,\nand I loved the child because she was my partner in wretchedness.  If she\nis now living she is probably a mother, with children of her own; but, as\nI have said, I could never trace her.\n\nThis I regret; but another person there was at that time whom I have\nsince sought to trace with far deeper earnestness, and with far deeper\nsorrow at my failure.  This person was a young woman, and one of that\nunhappy class who subsist upon the wages of prostitution.  I feel no\nshame, nor have any reason to feel it, in avowing that I was then on\nfamiliar and friendly terms with many women in that unfortunate\ncondition.  The reader needs neither smile at this avowal nor frown; for,\nnot to remind my classical readers of the old Latin proverb, \"_Sine\ncerere_,\" &c., it may well be supposed that in the existing state of my\npurse my connection with such women could not have been an impure one.\nBut the truth is, that at no time of my life have I been a person to hold\nmyself polluted by the touch or approach of any creature that wore a\nhuman shape; on the contrary, from my very earliest youth it has been my\npride to converse familiarly, _more Socratio_, with all human beings,\nman, woman, and child, that chance might fling in my way; a practice\nwhich is friendly to the knowledge of human nature, to good feelings, and\nto that frankness of address which becomes a man who would be thought a\nphilosopher.  For a philosopher should not see with the eyes of the poor\nlimitary creature calling himself a man of the world, and filled with\nnarrow and self-regarding prejudices of birth and education, but should\nlook upon himself as a catholic creature, and as standing in equal\nrelation to high and low, to educated and uneducated, to the guilty and\nthe innocent.  Being myself at that time of necessity a peripatetic, or a\nwalker of the streets, I naturally fell in more frequently with those\nfemale peripatetics who are technically called street-walkers.  Many of\nthese women had occasionally taken my part against watchmen who wished to\ndrive me off the steps of houses where I was sitting.  But one amongst\nthem, the one on whose account I have at all introduced this subject--yet\nno! let me not class the, oh! noble-minded Ann--with that order of women.\nLet me find, if it be possible, some gentler name to designate the\ncondition of her to whose bounty and compassion, ministering to my\nnecessities when all the world had forsaken me, I owe it that I am at\nthis time alive.  For many weeks I had walked at nights with this poor\nfriendless girl up and down Oxford Street, or had rested with her on\nsteps and under the shelter of porticoes.  She could not be so old as\nmyself; she told me, indeed, that she had not completed her sixteenth\nyear.  By such questions as my interest about her prompted I had\ngradually drawn forth her simple history.  Hers was a case of ordinary\noccurrence (as I have since had reason to think), and one in which, if\nLondon beneficence had better adapted its arrangements to meet it, the\npower of the law might oftener be interposed to protect and to avenge.\nBut the stream of London charity flows in a channel which, though deep\nand mighty, is yet noiseless and underground; not obvious or readily\naccessible to poor houseless wanderers; and it cannot be denied that the\noutside air and framework of London society is harsh, cruel, and\nrepulsive.  In any case, however, I saw that part of her injuries might\neasily have been redressed, and I urged her often and earnestly to lay\nher complaint before a magistrate.  Friendless as she was, I assured her\nthat she would meet with immediate attention, and that English justice,\nwhich was no respecter of persons, would speedily and amply avenge her on\nthe brutal ruffian who had plundered her little property.  She promised\nme often that she would, but she delayed taking the steps I pointed out\nfrom time to time, for she was timid and dejected to a degree which\nshowed how deeply sorrow had taken hold of her young heart; and perhaps\nshe thought justly that the most upright judge and the most righteous\ntribunals could do nothing to repair her heaviest wrongs.  Something,\nhowever, would perhaps have been done, for it had been settled between us\nat length, but unhappily on the very last time but one that I was ever to\nsee her, that in a day or two we should go together before a magistrate,\nand that I should speak on her behalf.  This little service it was\ndestined, however, that I should never realise.  Meantime, that which she\nrendered to me, and which was greater than I could ever have repaid her,\nwas this:--One night, when we were pacing slowly along Oxford Street, and\nafter a day when I had felt more than usually ill and faint, I requested\nher to turn off with me into Soho Square.  Thither we went, and we sat\ndown on the steps of a house, which to this hour I never pass without a\npang of grief and an inner act of homage to the spirit of that unhappy\ngirl, in memory of the noble action which she there performed.  Suddenly,\nas we sate, I grew much worse.  I had been leaning my head against her\nbosom, and all at once I sank from her arms and fell backwards on the\nsteps.  From the sensations I then had, I felt an inner conviction of the\nliveliest kind, that without some powerful and reviving stimulus I should\neither have died on the spot, or should at least have sunk to a point of\nexhaustion from which all reascent under my friendless circumstances\nwould soon have become hopeless.  Then it was, at this crisis of my fate,\nthat my poor orphan companion, who had herself met with little but\ninjuries in this world, stretched out a saving hand to me.  Uttering a\ncry of terror, but without a moment's delay, she ran off into Oxford\nStreet, and in less time than could be imagined returned to me with a\nglass of port wine and spices, that acted upon my empty stomach, which at\nthat time would have rejected all solid food, with an instantaneous power\nof restoration; and for this glass the generous girl without a murmur\npaid out of her humble purse at a time--be it remembered!--when she had\nscarcely wherewithal to purchase the bare necessaries of life, and when\nshe could have no reason to expect that I should ever be able to\nreimburse her.\n\nOh, youthful benefactress! how often in succeeding years, standing in\nsolitary places, and thinking of thee with grief of heart and perfect\nlove--how often have I wished that, as in ancient times, the curse of a\nfather was believed to have a supernatural power, and to pursue its\nobject with a fatal necessity of self-fulfilment; even so the benediction\nof a heart oppressed with gratitude might have a like prerogative, might\nhave power given to it from above to chase, to haunt, to waylay, to\novertake, to pursue thee into the central darkness of a London brothel,\nor (if it were possible) into the darkness of the grave, there to awaken\nthee with an authentic message of peace and forgiveness, and of final\nreconciliation!\n\nI do not often weep: for not only do my thoughts on subjects connected\nwith the chief interests of man daily, nay hourly, descend a thousand\nfathoms \"too deep for tears;\" not only does the sternness of my habits of\nthought present an antagonism to the feelings which prompt tears--wanting\nof necessity to those who, being protected usually by their levity from\nany tendency to meditative sorrow, would by that same levity be made\nincapable of resisting it on any casual access of such feelings; but\nalso, I believe that all minds which have contemplated such objects as\ndeeply as I have done, must, for their own protection from utter\ndespondency, have early encouraged and cherished some tranquillising\nbelief as to the future balances and the hieroglyphic meanings of human\nsufferings.  On these accounts I am cheerful to this hour, and, as I have\nsaid, I do not often weep.  Yet some feelings, though not deeper or more\npassionate, are more tender than others; and often, when I walk at this\ntime in Oxford Street by dreamy lamplight, and hear those airs played on\na barrel-organ which years ago solaced me and my dear companion (as I\nmust always call her), I shed tears, and muse with myself at the\nmysterious dispensation which so suddenly and so critically separated us\nfor ever.  How it happened the reader will understand from what remains\nof this introductory narration.\n\nSoon after the period of the last incident I have recorded I met in\nAlbemarle Street a gentleman of his late Majesty's household.  This\ngentleman had received hospitalities on different occasions from my\nfamily, and he challenged me upon the strength of my family likeness.  I\ndid not attempt any disguise; I answered his questions ingenuously, and,\non his pledging his word of honour that he would not betray me to my\nguardians, I gave him an address to my friend the attorney's.  The next\nday I received from him a 10 pound bank-note.  The letter enclosing it\nwas delivered with other letters of business to the attorney, but though\nhis look and manner informed me that he suspected its contents, he gave\nit up to me honourably and without demur.\n\nThis present, from the particular service to which it was applied, leads\nme naturally to speak of the purpose which had allured me up to London,\nand which I had been (to use a forensic word) soliciting from the first\nday of my arrival in London to that of my final departure.\n\nIn so mighty a world as London it will surprise my readers that I should\nnot have found some means of starving off the last extremities, of\npenury; and it will strike them that two resources at least must have\nbeen open to me--viz., either to seek assistance from the friends of my\nfamily, or to turn my youthful talents and attainments into some channel\nof pecuniary emolument.  As to the first course, I may observe generally,\nthat what I dreaded beyond all other evils was the chance of being\nreclaimed by my guardians; not doubting that whatever power the law gave\nthem would have been enforced against me to the utmost--that is, to the\nextremity of forcibly restoring me to the school which I had quitted, a\nrestoration which, as it would in my eyes have been a dishonour, even if\nsubmitted to voluntarily, could not fail, when extorted from me in\ncontempt and defiance of my own wishes and efforts, to have been a\nhumiliation worse to me than death, and which would indeed have\nterminated in death.  I was therefore shy enough of applying for\nassistance even in those quarters where I was sure of receiving it, at\nthe risk of furnishing my guardians with any clue of recovering me.  But\nas to London in particular, though doubtless my father had in his\nlifetime had many friends there, yet (as ten years had passed since his\ndeath) I remembered few of them even by name; and never having seen\nLondon before, except once for a few hours, I knew not the address of\neven those few.  To this mode of gaining help, therefore, in part the\ndifficulty, but much more the paramount fear which I have mentioned,\nhabitually indisposed me.  In regard to the other mode, I now feel half\ninclined to join my reader in wondering that I should have overlooked it.\nAs a corrector of Greek proofs (if in no other way) I might doubtless\nhave gained enough for my slender wants.  Such an office as this I could\nhave discharged with an exemplary and punctual accuracy that would soon\nhave gained me the confidence of my employers.  But it must not be\nforgotten that, even for such an office as this, it was necessary that I\nshould first of all have an introduction to some respectable publisher,\nand this I had no means of obtaining.  To say the truth, however, it had\nnever once occurred to me to think of literary labours as a source of\nprofit.  No mode sufficiently speedy of obtaining money had ever occurred\nto me but that of borrowing it on the strength of my future claims and\nexpectations.  This mode I sought by every avenue to compass; and amongst\nother persons I applied to a Jew named D--- {4}\n\nTo this Jew, and to other advertising money-lenders (some of whom were, I\nbelieve, also Jews), I had introduced myself with an account of my\nexpectations; which account, on examining my father's will at Doctors'\nCommons, they had ascertained to be correct.  The person there mentioned\nas the second son of --- was found to have all the claims (or more than\nall) that I had stated; but one question still remained, which the faces\nof the Jews pretty significantly suggested--was _I_ that person?  This\ndoubt had never occurred to me as a possible one; I had rather feared,\nwhenever my Jewish friends scrutinised me keenly, that I might be too\nwell known to be that person, and that some scheme might be passing in\ntheir minds for entrapping me and selling me to my guardians.  It was\nstrange to me to find my own self _materialiter_ considered (so I\nexpressed it, for I doated on logical accuracy of distinctions), accused,\nor at least suspected, of counterfeiting my own self _formaliter_\nconsidered.  However, to satisfy their scruples, I took the only course\nin my power.  Whilst I was in Wales I had received various letters from\nyoung friends these I produced, for I carried them constantly in my\npocket, being, indeed, by this time almost the only relics of my personal\nencumbrances (excepting the clothes I wore) which I had not in one way or\nother disposed of.  Most of these letters were from the Earl of ---, who\nwas at that time my chief (or rather only) confidential friend.  These\nletters were dated from Eton.  I had also some from the Marquis of ---,\nhis father, who, though absorbed in agricultural pursuits, yet having\nbeen an Etonian himself, and as good a scholar as a nobleman needs to be,\nstill retained an affection for classical studies and for youthful\nscholars.  He had accordingly, from the time that I was fifteen,\ncorresponded with me; sometimes upon the great improvements which he had\nmade or was meditating in the counties of M--- and Sl--- since I had been\nthere, sometimes upon the merits of a Latin poet, and at other times\nsuggesting subjects to me on which he wished me to write verses.\n\nOn reading the letters, one of my Jewish friends agreed to furnish me\nwith two or three hundred pounds on my personal security, provided I\ncould persuade the young Earl --- who was, by the way, not older than\nmyself--to guarantee the payment on our coming of age; the Jew's final\nobject being, as I now suppose, not the trifling profit he could expect\nto make by me, but the prospect of establishing a connection with my\nnoble friend, whose immense expectations were well known to him.  In\npursuance of this proposal on the part of the Jew, about eight or nine\ndays after I had received the 10 pounds, I prepared to go down to Eton.\nNearly 3 pounds of the money I had given to my money-lending friend, on\nhis alleging that the stamps must be bought, in order that the writings\nmight be preparing whilst I was away from London.  I thought in my heart\nthat he was lying; but I did not wish to give him any excuse for charging\nhis own delays upon me.  A smaller sum I had given to my friend the\nattorney (who was connected with the money-lenders as their lawyer), to\nwhich, indeed, he was entitled for his unfurnished lodgings.  About\nfifteen shillings I had employed in re-establishing (though in a very\nhumble way) my dress.  Of the remainder I gave one quarter to Ann,\nmeaning on my return to have divided with her whatever might remain.\nThese arrangements made, soon after six o'clock on a dark winter evening\nI set off, accompanied by Ann, towards Piccadilly; for it was my\nintention to go down as far as Salthill on the Bath or Bristol mail.  Our\ncourse lay through a part of the town which has now all disappeared, so\nthat I can no longer retrace its ancient boundaries--Swallow Street, I\nthink it was called.  Having time enough before us, however, we bore away\nto the left until we came into Golden Square; there, near the corner of\nSherrard Street, we sat down, not wishing to part in the tumult and blaze\nof Piccadilly.  I had told her of my plans some time before, and I now\nassured her again that she should share in my good fortune, if I met with\nany, and that I would never forsake her as soon as I had power to protect\nher.  This I fully intended, as much from inclination as from a sense of\nduty; for setting aside gratitude, which in any case must have made me\nher debtor for life, I loved her as affectionately as if she had been my\nsister; and at this moment with sevenfold tenderness, from pity at\nwitnessing her extreme dejection.  I had apparently most reason for\ndejection, because I was leaving the saviour of my life; yet I,\nconsidering the shock my health had received, was cheerful and full of\nhope.  She, on the contrary, who was parting with one who had had little\nmeans of serving her, except by kindness and brotherly treatment, was\novercome by sorrow; so that, when I kissed her at our final farewell, she\nput her arms about my neck and wept without speaking a word.  I hoped to\nreturn in a week at farthest, and I agreed with her that on the fifth\nnight from that, and every night afterwards, she would wait for me at six\no'clock near the bottom of Great Titchfield Street, which had been our\ncustomary haven, as it were, of rendezvous, to prevent our missing each\nother in the great Mediterranean of Oxford Street.  This and other\nmeasures of precaution I took; one only I forgot.  She had either never\ntold me, or (as a matter of no great interest) I had forgotten her\nsurname.  It is a general practice, indeed, with girls of humble rank in\nher unhappy condition, not (as novel-reading women of higher pretensions)\nto style themselves _Miss Douglas_, _Miss Montague_, &c., but simply by\ntheir Christian names--_Mary_, _Jane_, _Frances_, &c.  Her surname, as\nthe surest means of tracing her hereafter, I ought now to have inquired;\nbut the truth is, having no reason to think that our meeting could, in\nconsequence of a short interruption, be more difficult or uncertain than\nit had been for so many weeks, I had scarcely for a moment adverted to it\nas necessary, or placed it amongst my memoranda against this parting\ninterview; and my final anxieties being spent in comforting her with\nhopes, and in pressing upon her the necessity of getting some medicines\nfor a violent cough and hoarseness with which she was troubled, I wholly\nforgot it until it was too late to recall her.\n\nIt was past eight o'clock when I reached the Gloucester Coffee-house, and\nthe Bristol mail being on the point of going off, I mounted on the\noutside.  The fine fluent motion {5} of this mail soon laid me asleep: it\nis somewhat remarkable that the first easy or refreshing sleep which I\nhad enjoyed for some months, was on the outside of a mail-coach--a bed\nwhich at this day I find rather an uneasy one.  Connected with this sleep\nwas a little incident which served, as hundreds of others did at that\ntime, to convince me how easily a man who has never been in any great\ndistress may pass through life without knowing, in his own person at\nleast, anything of the possible goodness of the human heart--or, as I\nmust add with a sigh, of its possible vileness.  So thick a curtain of\n_manners_ is drawn over the features and expression of men's _natures_,\nthat to the ordinary observer the two extremities, and the infinite field\nof varieties which lie between them, are all confounded; the vast and\nmultitudinous compass of their several harmonies reduced to the meagre\noutline of differences expressed in the gamut or alphabet of elementary\nsounds.  The case was this: for the first four or five miles from London\nI annoyed my fellow-passenger on the roof by occasionally falling against\nhim when the coach gave a lurch to his: side; and indeed, if the road had\nbeen less smooth and level than it is, I should have fallen off from\nweakness.  Of this annoyance he complained heavily, as perhaps, in the\nsame circumstances, most people would; he expressed his complaint,\nhowever, more morosely than the occasion seemed to warrant, and if I had\nparted with him at that moment I should have thought of him (if I had\nconsidered it worth while to think of him at all) as a surly and almost\nbrutal fellow.  However, I was conscious that I had given him some cause\nfor complaint, and therefore I apologized to him, and assured him I would\ndo what I could to avoid falling asleep for the future; and at the same\ntime, in as few words as possible, I explained to him that I was ill and\nin a weak state from long suffering, and that I could not afford at that\ntime to take an inside place.  This man's manner changed, upon hearing\nthis explanation, in an instant; and when I next woke for a minute from\nthe noise and lights of Hounslow (for in spite of my wishes and efforts I\nhad fallen asleep again within two minutes from the time I had spoken to\nhim) I found that he had put his arm round me to protect me from falling\noff, and for the rest of my journey he behaved to me with the gentleness\nof a woman, so that at length I almost lay in his arms; and this was the\nmore kind, as he could not have known that I was not going the whole way\nto Bath or Bristol.  Unfortunately, indeed, I _did_ go rather farther\nthan I intended, for so genial and so refreshing was my sleep, that the\nnext time after leaving Hounslow that I fully awoke was upon the sudden\npulling up of the mail (possibly at a post-office), and on inquiry I\nfound that we had reached Maidenhead--six or seven miles, I think, ahead\nof Salthill.  Here I alighted, and for the half-minute that the mail\nstopped I was entreated by my friendly companion (who, from the transient\nglimpse I had had of him in Piccadilly, seemed to me to be a gentleman's\nbutler, or person of that rank) to go to bed without delay.  This I\npromised, though with no intention of doing so; and in fact I immediately\nset forward, or rather backward, on foot.  It must then have been nearly\nmidnight, but so slowly did I creep along that I heard a clock in a\ncottage strike four before I turned down the lane from Slough to Eton.\nThe air and the sleep had both refreshed me; but I was weary\nnevertheless.  I remember a thought (obvious enough, and which has been\nprettily expressed by a Roman poet) which gave me some consolation at\nthat moment under my poverty.  There had been some time before a murder\ncommitted on or near Hounslow Heath.  I think I cannot be mistaken when I\nsay that the name of the murdered person was _Steele_, and that he was\nthe owner of a lavender plantation in that neighbourhood.  Every step of\nmy progress was bringing me nearer to the Heath, and it naturally\noccurred to me that I and the accused murderer, if he were that night\nabroad, might at every instant be unconsciously approaching each other\nthrough the darkness; in which case, said I--supposing I, instead of\nbeing (as indeed I am) little better than an outcast--\n\n   Lord of my learning, and no land beside--\n\nwere, like my friend Lord ---, heir by general repute to 70,000 pounds\nper annum, what a panic should I be under at this moment about my throat!\nIndeed, it was not likely that Lord --- should ever be in my situation.\nBut nevertheless, the spirit of the remark remains true--that vast power\nand possessions make a man shamefully afraid of dying; and I am convinced\nthat many of the most intrepid adventurers, who, by fortunately being\npoor, enjoy the full use of their natural courage, would, if at the very\ninstant of going into action news were brought to them that they had\nunexpectedly succeeded to an estate in England of 50,000 pounds a-year,\nfeel their dislike to bullets considerably sharpened, {6} and their\nefforts at perfect equanimity and self-possession proportionably\ndifficult.  So true it is, in the language of a wise man whose own\nexperience had made him acquainted with both fortunes, that riches are\nbetter fitted\n\n   To slacken virtue, and abate her edge,\n   Than tempt her to do ought may merit praise.\n\n   _Paradise Regained_.\n\nI dally with my subject because, to myself, the remembrance of these\ntimes is profoundly interesting.  But my reader shall not have any\nfurther cause to complain, for I now hasten to its close.  In the road\nbetween Slough and Eton I fell asleep, and just as the morning began to\ndawn I was awakened by the voice of a man standing over me and surveying\nme.  I know not what he was: he was an ill-looking fellow, but not\ntherefore of necessity an ill-meaning fellow; or, if he were, I suppose\nhe thought that no person sleeping out-of-doors in winter could be worth\nrobbing.  In which conclusion, however, as it regarded myself, I beg to\nassure him, if he should be among my readers, that he was mistaken.  After\na slight remark he passed on; and I was not sorry at his disturbance, as\nit enabled me to pass through Eton before people were generally up.  The\nnight had been heavy and lowering, but towards the morning it had changed\nto a slight frost, and the ground and the trees were now covered with\nrime.  I slipped through Eton unobserved; washed myself, and as far as\npossible adjusted my dress, at a little public-house in Windsor; and\nabout eight o'clock went down towards Pote's.  On my road I met some\njunior boys, of whom I made inquiries.  An Etonian is always a gentleman;\nand, in spite of my shabby habiliments, they answered me civilly.  My\nfriend Lord --- was gone to the University of ---.  \"Ibi omnis effusus\nlabor!\"  I had, however, other friends at Eton; but it is not to all that\nwear that name in prosperity that a man is willing to present himself in\ndistress.  On recollecting myself, however, I asked for the Earl of D---,\nto whom (though my acquaintance with him was not so intimate as with some\nothers) I should not have shrunk from presenting myself under any\ncircumstances.  He was still at Eton, though I believe on the wing for\nCambridge.  I called, was received kindly, and asked to breakfast.\n\nHere let me stop for a moment to check my reader from any erroneous\nconclusions.  Because I have had occasion incidentally to speak of\nvarious patrician friends, it must not be supposed that I have myself any\npretension to rank and high blood.  I thank God that I have not.  I am\nthe son of a plain English merchant, esteemed during his life for his\ngreat integrity, and strongly attached to literary pursuits (indeed, he\nwas himself, anonymously, an author).  If he had lived it was expected\nthat he would have been very rich; but dying prematurely, he left no more\nthan about 30,000 pounds amongst seven different claimants.  My mother I\nmay mention with honour, as still more highly gifted; for though\nunpretending to the name and honours of a _literary_ woman, I shall\npresume to call her (what many literary women are not) an _intellectual_\nwoman; and I believe that if ever her letters should be collected and\npublished, they would be thought generally to exhibit as much strong and\nmasculine sense, delivered in as pure \"mother English,\" racy and fresh\nwith idiomatic graces, as any in our language--hardly excepting those of\nLady M. W. Montague.  These are my honours of descent, I have no other;\nand I have thanked God sincerely that I have not, because, in my\njudgment, a station which raises a man too eminently above the level of\nhis fellow-creatures is not the most favourable to moral or to\nintellectual qualities.\n\nLord D--- placed before me a most magnificent breakfast.  It was really\nso; but in my eyes it seemed trebly magnificent, from being the first\nregular meal, the first \"good man's table,\" that I had sate down to for\nmonths.  Strange to say, however, I could scarce eat anything.  On the\nday when I first received my 10 pound bank-note I had gone to a baker's\nshop and bought a couple of rolls; this very shop I had two months or six\nweeks before surveyed with an eagerness of desire which it was almost\nhumiliating to me to recollect.  I remembered the story about Otway, and\nfeared that there might be danger in eating too rapidly.  But I had no\nneed for alarm; my appetite was quite sunk, and I became sick before I\nhad eaten half of what I had bought.  This effect from eating what\napproached to a meal I continued to feel for weeks; or, when I did not\nexperience any nausea, part of what I ate was rejected, sometimes with\nacidity, sometimes immediately and without any acidity.  On the present\noccasion, at Lord D-'s table, I found myself not at all better than\nusual, and in the midst of luxuries I had no appetite.  I had, however,\nunfortunately, at all times a craving for wine; I explained my situation,\ntherefore, to Lord D---, and gave him a short account of my late\nsufferings, at which he expressed great compassion, and called for wine.\nThis gave me a momentary relief and pleasure; and on all occasions when I\nhad an opportunity I never failed to drink wine, which I worshipped then\nas I have since worshipped opium.  I am convinced, however, that this\nindulgence in wine contributed to strengthen my malady, for the tone of\nmy stomach was apparently quite sunk, and by a better regimen it might\nsooner, and perhaps effectually, have been revived.  I hope that it was\nnot from this love of wine that I lingered in the neighbourhood of my\nEton friends; I persuaded myself then that it was from reluctance to ask\nof Lord D---, on whom I was conscious I had not sufficient claims, the\nparticular service in quest of which I had come down to Eton.  I was,\nhowever unwilling to lose my journey, and--I asked it.  Lord D---, whose\ngood nature was unbounded, and which, in regard to myself, had been\nmeasured rather by his compassion perhaps for my condition, and his\nknowledge of my intimacy with some of his relatives, than by an\nover-rigorous inquiry into the extent of my own direct claims, faltered,\nnevertheless, at this request.  He acknowledged that he did not like to\nhave any dealings with money-lenders, and feared lest such a transaction\nmight come to the ears of his connexions.  Moreover, he doubted whether\n_his_ signature, whose expectations were so much more bounded than those\nof ---, would avail with my unchristian friends.  However, he did not\nwish, as it seemed, to mortify me by an absolute refusal; for after a\nlittle consideration he promised, under certain conditions which he\npointed out, to give his security.  Lord D--- was at this time not\neighteen years of age; but I have often doubted, on recollecting since\nthe good sense and prudence which on this occasion he mingled with so\nmuch urbanity of manner (an urbanity which in him wore the grace of\nyouthful sincerity), whether any statesman--the oldest and the most\naccomplished in diplomacy--could have acquitted himself better under the\nsame circumstances.  Most people, indeed, cannot be addressed on such a\nbusiness without surveying you with looks as austere and unpropitious as\nthose of a Saracen's head.\n\nRecomforted by this promise, which was not quite equal to the best but\nfar above the worst that I had pictured to myself as possible, I returned\nin a Windsor coach to London three days after I had quitted it.  And now\nI come to the end of my story.  The Jews did not approve of Lord D---'s\nterms; whether they would in the end have acceded to them, and were only\nseeking time for making due inquiries, I know not; but many delays were\nmade, time passed on, the small fragment of my bank-note had just melted\naway, and before any conclusion could have been put to the business I\nmust have relapsed into my former state of wretchedness.  Suddenly,\nhowever, at this crisis, an opening was made, almost by accident, for\nreconciliation with my friends; I quitted London in haste for a remote\npart of England; after some time I proceeded to the university, and it\nwas not until many months had passed away that I had it in my power again\nto revisit the ground which had become so interesting to me, and to this\nday remains so, as the chief scene of my youthful sufferings.\n\nMeantime, what had become of poor Ann?  For her I have reserved my\nconcluding words.  According to our agreement, I sought her daily, and\nwaited for her every night, so long as I stayed in London, at the corner\nof Titchfield Street.  I inquired for her of every one who was likely to\nknow her, and during the last hours of my stay in London I put into\nactivity every means of tracing her that my knowledge of London suggested\nand the limited extent of my power made possible.  The street where she\nhad lodged I knew, but not the house; and I remembered at last some\naccount which she had given me of ill-treatment from her landlord, which\nmade it probable that she had quitted those lodgings before we parted.\nShe had few acquaintances; most people, besides, thought that the\nearnestness of my inquiries arose from motives which moved their laughter\nor their slight regard; and others, thinking I was in chase of a girl who\nhad robbed me of some trifles, were naturally and excusably indisposed to\ngive me any clue to her, if indeed they had any to give.  Finally as my\ndespairing resource, on the day I left London I put into the hands of the\nonly person who (I was sure) must know Ann by sight, from having been in\ncompany with us once or twice, an address to ---, in ---shire, at that\ntime the residence of my family.  But to this hour I have never heard a\nsyllable about her.  This, amongst such troubles as most men meet with in\nthis life, has been my heaviest affliction.  If she lived, doubtless we\nmust have been some time in search of each other, at the very same\nmoment, through the mighty labyrinths of London; perhaps even within a\nfew feet of each other--a barrier no wider than a London street often\namounting in the end to a separation for eternity!  During some years I\nhoped that she _did_ live; and I suppose that, in the literal and\nunrhetorical use of the word _myriad_, I may say that on my different\nvisits to London I have looked into many, many myriads of female faces,\nin the hope of meeting her.  I should know her again amongst a thousand,\nif I saw her for a moment; for though not handsome, she had a sweet\nexpression of countenance and a peculiar and graceful carriage of the\nhead.  I sought her, I have said, in hope.  So it was for years; but now\nI should fear to see her; and her cough, which grieved me when I parted\nwith her, is now my consolation.  I now wish to see her no longer; but\nthink of her, more gladly, as one long since laid in the grave--in the\ngrave, I would hope, of a Magdalen; taken away, before injuries and\ncruelty had blotted out and transfigured her ingenuous nature, or the\nbrutalities of ruffians had completed the ruin they had begun.\n\n[The remainder of this very interesting article will be given in the next\nnumber.--ED.]\n\n\n\n\nPART II\n\n\nFrom the London Magazine for October 1821.\n\nSo then, Oxford Street, stony-hearted step-mother! thou that listenest to\nthe sighs of orphans and drinkest the tears of children, at length I was\ndismissed from thee; the time was come at last that I no more should pace\nin anguish thy never-ending terraces, no more should dream and wake in\ncaptivity to the pangs of hunger.  Successors too many, to myself and\nAnn, have doubtless since then trodden in our footsteps, inheritors of\nour calamities; other orphans than Ann have sighed; tears have been shed\nby other children; and thou, Oxford Street, hast since doubtless echoed\nto the groans of innumerable hearts.  For myself, however, the storm\nwhich I had outlived seemed to have been the pledge of a long\nfair-weather--the premature sufferings which I had paid down to have been\naccepted as a ransom for many years to come, as a price of long immunity\nfrom sorrow; and if again I walked in London a solitary and contemplative\nman (as oftentimes I did), I walked for the most part in serenity and\npeace of mind.  And although it is true that the calamities of my\nnoviciate in London had struck root so deeply in my bodily constitution,\nthat afterwards they shot up and flourished afresh, and grew into a\nnoxious umbrage that has overshadowed and darkened my latter years, yet\nthese second assaults of suffering were met with a fortitude more\nconfirmed, with the resources of a maturer intellect, and with\nalleviations from sympathising affection--how deep and tender!\n\nThus, however, with whatsoever alleviations, years that were far asunder\nwere bound together by subtle links of suffering derived from a common\nroot.  And herein I notice an instance of the short-sightedness of human\ndesires, that oftentimes on moonlight nights, during my first mournful\nabode in London, my consolation was (if such it could be thought) to gaze\nfrom Oxford Street up every avenue in succession which pierces through\nthe heart of Marylebone to the fields and the woods; for _that_, said I,\ntravelling with my eyes up the long vistas which lay part in light and\npart in shade, \"_that_ is the road to the North, and therefore to, and if\nI had the wings of a dove, _that_ way I would fly for comfort.\"  Thus I\nsaid, and thus I wished, in my blindness.  Yet even in that very northern\nregion it was, even in that very valley, nay, in that very house to which\nmy erroneous wishes pointed, that this second birth of my sufferings\nbegan, and that they again threatened to besiege the citadel of life and\nhope.  There it was that for years I was persecuted by visions as ugly,\nand as ghastly phantoms as ever haunted the couch of an Orestes; and in\nthis unhappier than he, that sleep, which comes to all as a respite and a\nrestoration, and to him especially as a blessed {7} balm for his wounded\nheart and his haunted brain, visited me as my bitterest scourge.  Thus\nblind was I in my desires; yet if a veil interposes between the\ndim-sightedness of man and his future calamities, the same veil hides\nfrom him their alleviations, and a grief which had not been feared is met\nby consolations which had not been hoped.  I therefore, who participated,\nas it were, in the troubles of Orestes (excepting only in his agitated\nconscience), participated no less in all his supports.  My Eumenides,\nlike his, were at my bed-feet, and stared in upon me through the\ncurtains; but watching by my pillow, or defrauding herself of sleep to\nbear me company through the heavy watches of the night, sate my Electra;\nfor thou, beloved M., dear companion of my later years, thou wast my\nElectra! and neither in nobility of mind nor in long-suffering affection\nwouldst permit that a Grecian sister should excel an English wife.  For\nthou thoughtest not much to stoop to humble offices of kindness and to\nservile {8} ministrations of tenderest affection--to wipe away for years\nthe unwholesome dews upon the forehead, or to refresh the lips when\nparched and baked with fever; nor even when thy own peaceful slumbers had\nby long sympathy become infected with the spectacle of my dread contest\nwith phantoms and shadowy enemies that oftentimes bade me \"sleep no\nmore!\"--not even then didst thou utter a complaint or any murmur, nor\nwithdraw thy angelic smiles, nor shrink from thy service of love, more\nthan Electra did of old.  For she too, though she was a Grecian woman,\nand the daughter of the king {9} of men, yet wept sometimes, and hid her\nface {10} in her robe.\n\nBut these troubles are past; and thou wilt read records of a period so\ndolorous to us both as the legend of some hideous dream that can return\nno more.  Meantime, I am again in London, and again I pace the terraces\nof Oxford Street by night; and oftentimes, when I am oppressed by\nanxieties that demand all my philosophy and the comfort of thy presence\nto support, and yet remember that I am separated from thee by three\nhundred miles and the length of three dreary months, I look up the\nstreets that run northwards from Oxford Street, upon moonlight nights,\nand recollect my youthful ejaculation of anguish; and remembering that\nthou art sitting alone in that same valley, and mistress of that very\nhouse to which my heart turned in its blindness nineteen years ago, I\nthink that, though blind indeed, and scattered to the winds of late, the\npromptings of my heart may yet have had reference to a remoter time, and\nmay be justified if read in another meaning; and if I could allow myself\nto descend again to the impotent wishes of childhood, I should again say\nto myself, as I look to the North, \"Oh, that I had the wings of a dove--\"\nand with how just a confidence in thy good and gracious nature might I\nadd the other half of my early ejaculation--\"And _that_ way I would fly\nfor comfort!\"\n\n\n\nTHE PLEASURES OF OPIUM\n\n\nIt is so long since I first took opium that if it had been a trifling\nincident in my life I might have forgotten its date; but cardinal events\nare not to be forgotten, and from circumstances connected with it I\nremember that it must be referred to the autumn of 1804.  During that\nseason I was in London, having come thither for the first time since my\nentrance at college.  And my introduction to opium arose in the following\nway.  From an early age I had been accustomed to wash my head in cold\nwater at least once a day: being suddenly seized with toothache, I\nattributed it to some relaxation caused by an accidental intermission of\nthat practice, jumped out of bed, plunged my head into a basin of cold\nwater, and with hair thus wetted went to sleep.  The next morning, as I\nneed hardly say, I awoke with excruciating rheumatic pains of the head\nand face, from which I had hardly any respite for about twenty days.  On\nthe twenty-first day I think it was, and on a Sunday, that I went out\ninto the streets, rather to run away, if possible, from my torments, than\nwith any distinct purpose.  By accident I met a college acquaintance, who\nrecommended opium.  Opium! dread agent of unimaginable pleasure and pain!\nI had heard of it as I had of manna or of ambrosia, but no further.  How\nunmeaning a sound was it at that time: what solemn chords does it now\nstrike upon my heart! what heart-quaking vibrations of sad and happy\nremembrances!  Reverting for a moment to these, I feel a mystic\nimportance attached to the minutest circumstances connected with the\nplace and the time and the man (if man he was) that first laid open to me\nthe Paradise of Opium-eaters.  It was a Sunday afternoon, wet and\ncheerless: and a duller spectacle this earth of ours has not to show than\na rainy Sunday in London.  My road homewards lay through Oxford Street;\nand near \"the stately Pantheon\" (as Mr. Wordsworth has obligingly called\nit) I saw a druggist's shop.  The druggist--unconscious minister of\ncelestial pleasures!--as if in sympathy with the rainy Sunday, looked\ndull and stupid, just as any mortal druggist might be expected to look on\na Sunday; and when I asked for the tincture of opium, he gave it to me as\nany other man might do, and furthermore, out of my shilling returned me\nwhat seemed to be real copper halfpence, taken out of a real wooden\ndrawer.  Nevertheless, in spite of such indications of humanity, he has\never since existed in my mind as the beatific vision of an immortal\ndruggist, sent down to earth on a special mission to myself.  And it\nconfirms me in this way of considering him, that when I next came up to\nLondon I sought him near the stately Pantheon, and found him not; and\nthus to me, who knew not his name (if indeed he had one), he seemed\nrather to have vanished from Oxford Street than to have removed in any\nbodily fashion.  The reader may choose to think of him as possibly no\nmore than a sublunary druggist; it may be so, but my faith is better--I\nbelieve him to have evanesced, {11} or evaporated.  So unwillingly would\nI connect any mortal remembrances with that hour, and place, and\ncreature, that first brought me acquainted with the celestial drug.\n\nArrived at my lodgings, it may be supposed that I lost not a moment in\ntaking the quantity prescribed.  I was necessarily ignorant of the whole\nart and mystery of opium-taking, and what I took I took under every\ndisadvantage.  But I took it--and in an hour--oh, heavens! what a\nrevulsion! what an upheaving, from its lowest depths, of inner spirit!\nwhat an apocalypse of the world within me!  That my pains had vanished\nwas now a trifle in my eyes: this negative effect was swallowed up in the\nimmensity of those positive effects which had opened before me--in the\nabyss of divine enjoyment thus suddenly revealed.  Here was a panacea, a\n[Greek text] for all human woes; here was the secret of happiness, about\nwhich philosophers had disputed for so many ages, at once discovered:\nhappiness might now be bought for a penny, and carried in the waistcoat\npocket; portable ecstacies might be had corked up in a pint bottle, and\npeace of mind could be sent down in gallons by the mail-coach.  But if I\ntalk in this way the reader will think I am laughing, and I can assure\nhim that nobody will laugh long who deals much with opium: its pleasures\neven are of a grave and solemn complexion, and in his happiest state the\nopium-eater cannot present himself in the character of _L'Allegro_: even\nthen he speaks and thinks as becomes _Il Penseroso_.  Nevertheless, I\nhave a very reprehensible way of jesting at times in the midst of my own\nmisery; and unless when I am checked by some more powerful feelings, I am\nafraid I shall be guilty of this indecent practice even in these annals\nof suffering or enjoyment.  The reader must allow a little to my infirm\nnature in this respect; and with a few indulgences of that sort I shall\nendeavour to be as grave, if not drowsy, as fits a theme like opium, so\nanti-mercurial as it really is, and so drowsy as it is falsely reputed.\n\nAnd first, one word with respect to its bodily effects; for upon all that\nhas been hitherto written on the subject of opium, whether by travellers\nin Turkey (who may plead their privilege of lying as an old immemorial\nright), or by professors of medicine, writing _ex cathedra_, I have but\none emphatic criticism to pronounce--Lies! lies! lies!  I remember once,\nin passing a book-stall, to have caught these words from a page of some\nsatiric author: \"By this time I became convinced that the London\nnewspapers spoke truth at least twice a week, viz., on Tuesday and\nSaturday, and might safely be depended upon for--the list of bankrupts.\"\nIn like manner, I do by no means deny that some truths have been\ndelivered to the world in regard to opium.  Thus it has been repeatedly\naffirmed by the learned that opium is a dusky brown in colour; and this,\ntake notice, I grant.  Secondly, that it is rather dear, which also I\ngrant, for in my time East Indian opium has been three guineas a pound,\nand Turkey eight.  And thirdly, that if you eat a good deal of it, most\nprobably you must--do what is particularly disagreeable to any man of\nregular habits, viz., die. {12}  These weighty propositions are, all and\nsingular, true: I cannot gainsay them, and truth ever was, and will be,\ncommendable.  But in these three theorems I believe we have exhausted the\nstock of knowledge as yet accumulated by men on the subject of opium.\n\nAnd therefore, worthy doctors, as there seems to be room for further\ndiscoveries, stand aside, and allow me to come forward and lecture on\nthis matter.\n\nFirst, then, it is not so much affirmed as taken for granted, by all who\never mention opium, formally or incidentally, that it does or can produce\nintoxication.  Now, reader, assure yourself, _meo perieulo_, that no\nquantity of opium ever did or could intoxicate.  As to the tincture of\nopium (commonly called laudanum) _that_ might certainly intoxicate if a\nman could bear to take enough of it; but why?  Because it contains so\nmuch proof spirit, and not because it contains so much opium.  But crude\nopium, I affirm peremptorily, is incapable of producing any state of body\nat all resembling that which is produced by alcohol, and not in _degree_\nonly incapable, but even in _kind_: it is not in the quantity of its\neffects merely, but in the quality, that it differs altogether.  The\npleasure given by wine is always mounting and tending to a crisis, after\nwhich it declines; that from opium, when once generated, is stationary\nfor eight or ten hours: the first, to borrow a technical distinction from\nmedicine, is a case of acute--the second, the chronic pleasure; the one\nis a flame, the other a steady and equable glow.  But the main\ndistinction lies in this, that whereas wine disorders the mental\nfaculties, opium, on the contrary (if taken in a proper manner),\nintroduces amongst them the most exquisite order, legislation, and\nharmony.  Wine robs a man of his self-possession; opium greatly\ninvigorates it.  Wine unsettles and clouds the judgement, and gives a\npreternatural brightness and a vivid exaltation to the contempts and the\nadmirations, the loves and the hatreds of the drinker; opium, on the\ncontrary, communicates serenity and equipoise to all the faculties,\nactive or passive, and with respect to the temper and moral feelings in\ngeneral it gives simply that sort of vital warmth which is approved by\nthe judgment, and which would probably always accompany a bodily\nconstitution of primeval or antediluvian health.  Thus, for instance,\nopium, like wine, gives an expansion to the heart and the benevolent\naffections; but then, with this remarkable difference, that in the sudden\ndevelopment of kind-heartedness which accompanies inebriation there is\nalways more or less of a maudlin character, which exposes it to the\ncontempt of the bystander.  Men shake hands, swear eternal friendship,\nand shed tears, no mortal knows why; and the sensual creature is clearly\nuppermost.  But the expansion of the benigner feelings incident to opium\nis no febrile access, but a healthy restoration to that state which the\nmind would naturally recover upon the removal of any deep-seated\nirritation of pain that had disturbed and quarrelled with the impulses of\na heart originally just and good.  True it is that even wine, up to a\ncertain point and with certain men, rather tends to exalt and to steady\nthe intellect; I myself, who have never been a great wine-drinker, used\nto find that half-a-dozen glasses of wine advantageously affected the\nfaculties--brightened and intensified the consciousness, and gave to the\nmind a feeling of being \"ponderibus librata suis;\" and certainly it is\nmost absurdly said, in popular language, of any man that he is\n_disguised_ in liquor; for, on the contrary, most men are disguised by\nsobriety, and it is when they are drinking (as some old gentleman says in\nAthenaeus), that men [Greek text]--display themselves in their true\ncomplexion of character, which surely is not disguising themselves.  But\nstill, wine constantly leads a man to the brink of absurdity and\nextravagance, and beyond a certain point it is sure to volatilise and to\ndisperse the intellectual energies: whereas opium always seems to compose\nwhat had been agitated, and to concentrate what had been distracted.  In\nshort, to sum up all in one word, a man who is inebriated, or tending to\ninebriation, is, and feels that he is, in a condition which calls up into\nsupremacy the merely human, too often the brutal part of his nature; but\nthe opium-eater (I speak of him who is not suffering from any disease or\nother remote effects of opium) feels that the divines part of his nature\nis paramount; that is, the moral affections are in a state of cloudless\nserenity, and over all is the great light of the majestic intellect.\n\nThis is the doctrine of the true church on the subject of opium: of which\nchurch I acknowledge myself to be the only member--the alpha and the\nomega: but then it is to be recollected that I speak from the ground of a\nlarge and profound personal experience: whereas most of the unscientific\n{13} authors who have at all treated of opium, and even of those who have\nwritten expressly on the materia medica, make it evident, from the horror\nthey express of it, that their experimental knowledge of its action is\nnone at all.  I will, however, candidly acknowledge that I have met with\none person who bore evidence to its intoxicating power, such as staggered\nmy own incredulity; for he was a surgeon, and had himself taken opium\nlargely.  I happened to say to him that his enemies (as I had heard)\ncharged him with talking nonsense on politics, and that his friends\napologized for him by suggesting that he was constantly in a state of\nintoxication from opium.  Now the accusation, said I, is not _prima\nfacie_ and of necessity an absurd one; but the defence _is_.  To my\nsurprise, however, he insisted that both his enemies and his friends were\nin the right.  \"I will maintain,\" said he, \"that I _do_ talk nonsense;\nand secondly, I will maintain that I do not talk nonsense upon principle,\nor with any view to profit, but solely and simply, said he, solely and\nsimply--solely and simply (repeating it three times over), because I am\ndrunk with opium, and _that_ daily.\"  I replied that, as to the\nallegation of his enemies, as it seemed to be established upon such\nrespectable testimony, seeing that the three parties concerned all agree\nin it, it did not become me to question it; but the defence set up I must\ndemur to.  He proceeded to discuss the matter, and to lay down his\nreasons; but it seemed to me so impolite to pursue an argument which must\nhave presumed a man mistaken in a point belonging to his own profession,\nthat I did not press him even when his course of argument seemed open to\nobjection; not to mention that a man who talks nonsense, even though\n\"with no view to profit,\" is not altogether the most agreeable partner in\na dispute, whether as opponent or respondent.  I confess, however, that\nthe authority of a surgeon, and one who was reputed a good one, may seem\na weighty one to my prejudice; but still I must plead my experience,\nwhich was greater than his greatest by 7,000 drops a-day; and though it\nwas not possible to suppose a medical man unacquainted with the\ncharacteristic symptoms of vinous intoxication, it yet struck me that he\nmight proceed on a logical error of using the word intoxication with too\ngreat latitude, and extending it generically to all modes of nervous\nexcitement, instead of restricting it as the expression for a specific\nsort of excitement connected with certain diagnostics.  Some people have\nmaintained in my hearing that they had been drunk upon green tea; and a\nmedical student in London, for whose knowledge in his profession I have\nreason to feel great respect, assured me the other day that a patient in\nrecovering from an illness had got drunk on a beef-steak.\n\nHaving dwelt so much on this first and leading error in respect to opium,\nI shall notice very briefly a second and a third, which are, that the\nelevation of spirits produced by opium is necessarily followed by a\nproportionate depression, and that the natural and even immediate\nconsequence of opium is torpor and stagnation, animal and mental.  The\nfirst of these errors I shall content myself with simply denying;\nassuring my reader that for ten years, during which I took opium at\nintervals, the day succeeding to that on which I allowed myself this\nluxury was always a day of unusually good spirits.\n\nWith respect to the torpor supposed to follow, or rather (if we were to\ncredit the numerous pictures of Turkish opium-eaters) to accompany the\npractice of opium-eating, I deny that also.  Certainly opium is classed\nunder the head of narcotics, and some such effect it may produce in the\nend; but the primary effects of opium are always, and in the highest\ndegree, to excite and stimulate the system.  This first stage of its\naction always lasted with me, during my noviciate, for upwards of eight\nhours; so that it must be the fault of the opium-eater himself if he does\nnot so time his exhibition of the dose (to speak medically) as that the\nwhole weight of its narcotic influence may descend upon his sleep.\nTurkish opium-eaters, it seems, are absurd enough to sit, like so many\nequestrian statues, on logs of wood as stupid as themselves.  But that\nthe reader may judge of the degree in which opium is likely to stupefy\nthe faculties of an Englishman, I shall (by way of treating the question\nillustratively, rather than argumentatively) describe the way in which I\nmyself often passed an opium evening in London during the period between\n1804-1812.  It will be seen that at least opium did not move me to seek\nsolitude, and much less to seek inactivity, or the torpid state of self-\ninvolution ascribed to the Turks.  I give this account at the risk of\nbeing pronounced a crazy enthusiast or visionary; but I regard _that_\nlittle.  I must desire my reader to bear in mind that I was a hard\nstudent, and at severe studies for all the rest of my time; and certainly\nI had a right occasionally to relaxations as well as other people.  These,\nhowever, I allowed myself but seldom.\n\nThe late Duke of --- used to say, \"Next Friday, by the blessing of\nheaven, I purpose to be drunk;\" and in like manner I used to fix\nbeforehand how often within a given time, and when, I would commit a\ndebauch of opium.  This was seldom more than once in three weeks, for at\nthat time I could not have ventured to call every day, as I did\nafterwards, for \"_a glass of laudanum negus, warm, and without sugar_.\"\nNo, as I have said, I seldom drank laudanum, at that time, more than once\nin three weeks: This was usually on a Tuesday or a Saturday night; my\nreason for which was this.  In those days Grassini sang at the Opera, and\nher voice was delightful to me beyond all that I had ever heard.  I know\nnot what may be the state of the Opera-house now, having never been\nwithin its walls for seven or eight years, but at that time it was by\nmuch the most pleasant place of public resort in London for passing an\nevening.  Five shillings admitted one to the gallery, which was subject\nto far less annoyance than the pit of the theatres; the orchestra was\ndistinguished by its sweet and melodious grandeur from all English\norchestras, the composition of which, I confess, is not acceptable to my\near, from the predominance of the clamorous instruments and the absolute\ntyranny of the violin.  The choruses were divine to hear, and when\nGrassini appeared in some interlude, as she often did, and poured forth\nher passionate soul as Andromache at the tomb of Hector, &c., I question\nwhether any Turk, of all that ever entered the Paradise of Opium-eaters,\ncan have had half the pleasure I had.  But, indeed, I honour the\nbarbarians too much by supposing them capable of any pleasures\napproaching to the intellectual ones of an Englishman.  For music is an\nintellectual or a sensual pleasure according to the temperament of him\nwho hears it.  And, by-the-bye, with the exception of the fine\nextravaganza on that subject in \"Twelfth Night,\" I do not recollect more\nthan one thing said adequately on the subject of music in all literature;\nit is a passage in the _Religio Medici_ {14} of Sir T. Brown, and though\nchiefly remarkable for its sublimity, has also a philosophic value,\ninasmuch as it points to the true theory of musical effects.  The mistake\nof most people is to suppose that it is by the ear they communicate with\nmusic, and therefore that they are purely passive to its effects.  But\nthis is not so; it is by the reaction of the mind upon the notices of the\near (the _matter_ coming by the senses, the _form_ from the mind) that\nthe pleasure is constructed, and therefore it is that people of equally\ngood ear differ so much in this point from one another.  Now, opium, by\ngreatly increasing the activity of the mind, generally increases, of\nnecessity, that particular mode of its activity by which we are able to\nconstruct out of the raw material of organic sound an elaborate\nintellectual pleasure.  But, says a friend, a succession of musical\nsounds is to me like a collection of Arabic characters; I can attach no\nideas to them.  Ideas! my good sir?  There is no occasion for them; all\nthat class of ideas which can be available in such a case has a language\nof representative feelings.  But this is a subject foreign to my present\npurposes; it is sufficient to say that a chorus, &c., of elaborate\nharmony displayed before me, as in a piece of arras work, the whole of my\npast life--not as if recalled by an act of memory, but as if present and\nincarnated in the music; no longer painful to dwell upon; but the detail\nof its incidents removed or blended in some hazy abstraction, and its\npassions exalted, spiritualized, and sublimed.  All this was to be had\nfor five shillings.  And over and above the music of the stage and the\norchestra, I had all around me, in the intervals of the performance, the\nmusic of the Italian language talked by Italian women--for the gallery\nwas usually crowded with Italians--and I listened with a pleasure such as\nthat with which Weld the traveller lay and listened, in Canada, to the\nsweet laughter of Indian women; for the less you understand of a\nlanguage, the more sensible you are to the melody or harshness of its\nsounds.  For such a purpose, therefore, it was an advantage to me that I\nwas a poor Italian scholar, reading it but little, and not speaking it at\nall, nor understanding a tenth part of what I heard spoken.\n\nThese were my opera pleasures; but another pleasure I had which, as it\ncould be had only on a Saturday night, occasionally struggled with my\nlove of the Opera; for at that time Tuesday and Saturday were the regular\nopera nights.  On this subject I am afraid I shall be rather obscure, but\nI can assure the reader not at all more so than Marinus in his Life of\nProclus, or many other biographers and autobiographers of fair\nreputation.  This pleasure, I have said, was to be had only on a Saturday\nnight.  What, then, was Saturday night to me more than any other night?  I\nhad no labours that I rested from, no wages to receive; what needed I to\ncare for Saturday night, more than as it was a summons to hear Grassini?\nTrue, most logical reader; what you say is unanswerable.  And yet so it\nwas and is, that whereas different men throw their feelings into\ndifferent channels, and most are apt to show their interest in the\nconcerns of the poor chiefly by sympathy, expressed in some shape or\nother, with their distresses and sorrows, I at that time was disposed to\nexpress my interest by sympathising with their pleasures.  The pains of\npoverty I had lately seen too much of, more than I wished to remember;\nbut the pleasures of the poor, their consolations of spirit, and their\nreposes from bodily toil, can never become oppressive to contemplate.  Now\nSaturday night is the season for the chief, regular, and periodic return\nof rest of the poor; in this point the most hostile sects unite, and\nacknowledge a common link of brotherhood; almost all Christendom rests\nfrom its labours.  It is a rest introductory to another rest, and divided\nby a whole day and two nights from the renewal of toil.  On this account\nI feel always, on a Saturday night, as though I also were released from\nsome yoke of labour, had some wages to receive, and some luxury of repose\nto enjoy.  For the sake, therefore, of witnessing, upon as large a scale\nas possible, a spectacle with which my sympathy was so entire, I used\noften on Saturday nights, after I had taken opium, to wander forth,\nwithout much regarding the direction or the distance, to all the markets\nand other parts of London to which the poor resort of a Saturday night,\nfor laying out their wages.  Many a family party, consisting of a man,\nhis wife, and sometimes one or two of his children, have I listened to,\nas they stood consulting on their ways and means, or the strength of\ntheir exchequer, or the price of household articles.  Gradually I became\nfamiliar with their wishes, their difficulties, and their opinions.\nSometimes there might be heard murmurs of discontent, but far oftener\nexpressions on the countenance, or uttered in words, of patience, hope,\nand tranquillity.  And taken generally, I must say that, in this point at\nleast, the poor are more philosophic than the rich--that they show a more\nready and cheerful submission to what they consider as irremediable evils\nor irreparable losses.  Whenever I saw occasion, or could do it without\nappearing to be intrusive, I joined their parties, and gave my opinion\nupon the matter in discussion, which, if not always judicious, was always\nreceived indulgently.  If wages were a little higher or expected to be\nso, or the quartern loaf a little lower, or it was reported that onions\nand butter were expected to fall, I was glad; yet, if the contrary were\ntrue, I drew from opium some means of consoling myself.  For opium (like\nthe bee, that extracts its materials indiscriminately from roses and from\nthe soot of chimneys) can overrule all feelings into compliance with the\nmaster-key.  Some of these rambles led me to great distances, for an\nopium-eater is too happy to observe the motion of time; and sometimes in\nmy attempts to steer homewards, upon nautical principles, by fixing my\neye on the pole-star, and seeking ambitiously for a north-west passage,\ninstead of circumnavigating all the capes and head-lands I had doubled in\nmy outward voyage, I came suddenly upon such knotty problems of alleys,\nsuch enigmatical entries, and such sphynx's riddles of streets without\nthoroughfares, as must, I conceive, baffle the audacity of porters and\nconfound the intellects of hackney-coachmen.  I could almost have\nbelieved at times that I must be the first discoverer of some of these\n_terrae incognitae_, and doubted whether they had yet been laid down in\nthe modern charts of London.  For all this, however, I paid a heavy price\nin distant years, when the human face tyrannised over my dreams, and the\nperplexities of my steps in London came back and haunted my sleep, with\nthe feeling of perplexities, moral and intellectual, that brought\nconfusion to the reason, or anguish and remorse to the conscience.\n\nThus I have shown that opium does not of necessity produce inactivity or\ntorpor, but that, on the contrary, it often led me into markets and\ntheatres.  Yet, in candour, I will admit that markets and theatres are\nnot the appropriate haunts of the opium-eater when in the divinest state\nincident to his enjoyment.  In that state, crowds become an oppression to\nhim; music even, too sensual and gross.  He naturally seeks solitude and\nsilence, as indispensable conditions of those trances, or profoundest\nreveries, which are the crown and consummation of what opium can do for\nhuman nature.  I, whose disease it was to meditate too much and to\nobserve too little, and who upon my first entrance at college was nearly\nfalling into a deep melancholy, from brooding too much on the sufferings\nwhich I had witnessed in London, was sufficiently aware of the tendencies\nof my own thoughts to do all I could to counteract them.  I was, indeed,\nlike a person who, according to the old legend, had entered the cave of\nTrophonius; and the remedies I sought were to force myself into society,\nand to keep my understanding in continual activity upon matters of\nscience.  But for these remedies I should certainly have become\nhypochondriacally melancholy.  In after years, however, when my\ncheerfulness was more fully re-established, I yielded to my natural\ninclination for a solitary life.  And at that time I often fell into\nthese reveries upon taking opium; and more than once it has happened to\nme, on a summer night, when I have been at an open window, in a room from\nwhich I could overlook the sea at a mile below me, and could command a\nview of the great town of L---, at about the same distance, that I have\nsate from sunset to sunrise, motionless, and without wishing to move.\n\nI shall be charged with mysticism, Behmenism, quietism, &c., but _that_\nshall not alarm me.  Sir H. Vane, the younger, was one of our wisest men;\nand let my reader see if he, in his philosophical works, be half as\nunmystical as I am.  I say, then, that it has often struck me that the\nscene itself was somewhat typical of what took place in such a reverie.\nThe town of L--- represented the earth, with its sorrows and its graves\nleft behind, yet not out of sight, nor wholly forgotten.  The ocean, in\neverlasting but gentle agitation, and brooded over by a dove-like calm,\nmight not unfitly typify the mind and the mood which then swayed it.  For\nit seemed to me as if then first I stood at a distance and aloof from the\nuproar of life; as if the tumult, the fever, and the strife were\nsuspended; a respite granted from the secret burthens of the heart; a\nsabbath of repose; a resting from human labours.  Here were the hopes\nwhich blossom in the paths of life reconciled with the peace which is in\nthe grave; motions of the intellect as unwearied as the heavens, yet for\nall anxieties a halcyon calm; a tranquillity that seemed no product of\ninertia, but as if resulting from mighty and equal antagonisms; infinite\nactivities, infinite repose.\n\nOh, just, subtle, and mighty opium! that to the hearts of poor and rich\nalike, for the wounds that will never heal, and for \"the pangs that tempt\nthe spirit to rebel,\" bringest an assuaging balm; eloquent opium! that\nwith thy potent rhetoric stealest away the purposes of wrath; and to the\nguilty man for one night givest back the hopes of his youth, and hands\nwashed pure from blood; and to the proud man a brief oblivion for\n\n   Wrongs undress'd and insults unavenged;\n\nthat summonest to the chancery of dreams, for the triumphs of suffering\ninnocence, false witnesses; and confoundest perjury, and dost reverse the\nsentences of unrighteous judges;--thou buildest upon the bosom of\ndarkness, out of the fantastic imagery of the brain, cities and temples\nbeyond the art of Phidias and Praxiteles--beyond the splendour of Babylon\nand Hekatompylos, and \"from the anarchy of dreaming sleep\" callest into\nsunny light the faces of long-buried beauties and the blessed household\ncountenances cleansed from the \"dishonours of the grave.\"  Thou only\ngivest these gifts to man; and thou hast the keys of Paradise, oh, just,\nsubtle, and mighty opium!\n\n\n\nINTRODUCTION TO THE PAINS OF OPIUM\n\n\nCourteous, and I hope indulgent, reader (for all _my_ readers must be\nindulgent ones, or else I fear I shall shock them too much to count on\ntheir courtesy), having accompanied me thus far, now let me request you\nto move onwards for about eight years; that is to say, from 1804 (when I\nhave said that my acquaintance with opium first began) to 1812.  The\nyears of academic life are now over and gone--almost forgotten; the\nstudent's cap no longer presses my temples; if my cap exist at all, it\npresses those of some youthful scholar, I trust, as happy as myself, and\nas passionate a lover of knowledge.  My gown is by this time, I dare say,\nin the same condition with many thousand excellent books in the Bodleian,\nviz., diligently perused by certain studious moths and worms; or\ndeparted, however (which is all that I know of his fate), to that great\nreservoir of _somewhere_ to which all the tea-cups, tea-caddies,\ntea-pots, tea-kettles, &c., have departed (not to speak of still frailer\nvessels, such as glasses, decanters, bed-makers, &c.), which occasional\nresemblances in the present generation of tea-cups, &c., remind me of\nhaving once possessed, but of whose departure and final fate I, in common\nwith most gownsmen of either university, could give, I suspect, but an\nobscure and conjectural history.  The persecutions of the chapel-bell,\nsounding its unwelcome summons to six o'clock matins, interrupts my\nslumbers no longer, the porter who rang it, upon whose beautiful nose\n(bronze, inlaid with copper) I wrote, in retaliation so many Greek\nepigrams whilst I was dressing, is dead, and has ceased to disturb\nanybody; and I, and many others who suffered much from his tintinnabulous\npropensities, have now agreed to overlook his errors, and have forgiven\nhim.  Even with the bell I am now in charity; it rings, I suppose, as\nformerly, thrice a-day, and cruelly annoys, I doubt not, many worthy\ngentlemen, and disturbs their peace of mind; but as to me, in this year\n1812, I regard its treacherous voice no longer (treacherous I call it,\nfor, by some refinement of malice, it spoke in as sweet and silvery tones\nas if it had been inviting one to a party); its tones have no longer,\nindeed, power to reach me, let the wind sit as favourable as the malice\nof the bell itself could wish, for I am 250 miles away from it, and\nburied in the depth of mountains.  And what am I doing among the\nmountains?  Taking opium.  Yes; but what else?  Why reader, in 1812, the\nyear we are now arrived at, as well as for some years previous, I have\nbeen chiefly studying German metaphysics in the writings of Kant, Fichte,\nSchelling, &c.  And how and in what manner do I live?--in short, what\nclass or description of men do I belong to?  I am at this period--viz. in\n1812--living in a cottage and with a single female servant (_honi soit\nqui mal y pense_), who amongst my neighbours passes by the name of my\n\"housekeeper.\"  And as a scholar and a man of learned education, and in\nthat sense a gentleman, I may presume to class myself as an unworthy\nmember of that indefinite body called _gentlemen_.  Partly on the ground\nI have assigned perhaps, partly because from my having no visible calling\nor business, it is rightly judged that I must be living on my private\nfortune; I am so classed by my neighbours; and by the courtesy of modern\nEngland I am usually addressed on letters, &c., \"Esquire,\" though having,\nI fear, in the rigorous construction of heralds, but slender pretensions\nto that distinguished honour; yet in popular estimation I am X. Y. Z.,\nEsquire, but not justice of the Peace nor Custos Rotulorum.  Am I\nmarried?  Not yet.  And I still take opium?  On Saturday nights.  And\nperhaps have taken it unblushingly ever since \"the rainy Sunday,\" and\n\"the stately Pantheon,\" and \"the beatific druggist\" of 1804?  Even so.\nAnd how do I find my health after all this opium-eating?  In short, how\ndo I do?  Why, pretty well, I thank you, reader; in the phrase of ladies\nin the straw, \"as well as can be expected.\"  In fact, if I dared to say\nthe real and simple truth, though, to satisfy the theories of medical\nmen, I _ought_ to be ill, I never was better in my life than in the\nspring of 1812; and I hope sincerely that the quantity of claret, port,\nor \"particular Madeira,\" which in all probability you, good reader, have\ntaken, and design to take for every term of eight years during your\nnatural life, may as little disorder your health as mine was disordered\nby the opium I had taken for eight years, between 1804 and 1812.  Hence\nyou may see again the danger of taking any medical advice from\n_Anastasius_; in divinity, for aught I know, or law, he may be a safe\ncounsellor; but not in medicine.  No; it is far better to consult Dr.\nBuchan, as I did; for I never forgot that worthy man's excellent\nsuggestion, and I was \"particularly careful not to take above five-and-\ntwenty ounces of laudanum.\"  To this moderation and temperate use of the\narticle I may ascribe it, I suppose, that as yet, at least (_i.e_. in\n1812), I am ignorant and unsuspicious of the avenging terrors which opium\nhas in store for those who abuse its lenity.  At the same time, it must\nnot be forgotten that hitherto I have been only a dilettante eater of\nopium; eight years' practice even, with a single precaution of allowing\nsufficient intervals between every indulgence, has not been sufficient to\nmake opium necessary to me as an article of daily diet.  But now comes a\ndifferent era.  Move on, if you please, reader, to 1813.  In the summer\nof the year we have just quitted I have suffered much in bodily health\nfrom distress of mind connected with a very melancholy event.  This event\nbeing no ways related to the subject now before me, further than through\nthe bodily illness which it produced, I need not more particularly\nnotice.  Whether this illness of 1812 had any share in that of 1813 I\nknow not; but so it was, that in the latter year I was attacked by a most\nappalling irritation of the stomach, in all respects the same as that\nwhich had caused me so much suffering in youth, and accompanied by a\nrevival of all the old dreams.  This is the point of my narrative on\nwhich, as respects my own self-justification, the whole of what follows\nmay be said to hinge.  And here I find myself in a perplexing dilemma.\nEither, on the one hand, I must exhaust the reader's patience by such a\ndetail of my malady, or of my struggles with it, as might suffice to\nestablish the fact of my inability to wrestle any longer with irritation\nand constant suffering; or, on the other hand, by passing lightly over\nthis critical part of my story, I must forego the benefit of a stronger\nimpression left on the mind of the reader, and must lay myself open to\nthe misconstruction of having slipped, by the easy and gradual steps of\nself-indulging persons, from the first to the final stage of opium-eating\n(a misconstruction to which there will be a lurking predisposition in\nmost readers, from my previous acknowledgements).  This is the dilemma,\nthe first horn of which would be sufficient to toss and gore any column\nof patient readers, though drawn up sixteen deep and constantly relieved\nby fresh men; consequently that is not to be thought of.  It remains,\nthen, that I _postulale_ so much as is necessary for my purpose.  And let\nme take as full credit for what I postulate as if I had demonstrated it,\ngood reader, at the expense of your patience and my own.  Be not so\nungenerous as to let me suffer in your good opinion through my own\nforbearance and regard for your comfort.  No; believe all that I ask of\nyou--viz., that I could resist no longer; believe it liberally and as an\nact of grace, or else in mere prudence; for if not, then in the next\nedition of my Opium Confessions, revised and enlarged, I will make you\nbelieve and tremble; and _a force d'ennuyer_, by mere dint of\npandiculation I will terrify all readers of mine from ever again\nquestioning any postulate that I shall think fit to make.\n\nThis, then, let me repeat, I postulate--that at the time I began to take\nopium daily I could not have done otherwise.  Whether, indeed, afterwards\nI might not have succeeded in breaking off the habit, even when it seemed\nto me that all efforts would be unavailing, and whether many of the\ninnumerable efforts which I did make might not have been carried much\nfurther, and my gradual reconquests of ground lost might not have been\nfollowed up much more energetically--these are questions which I must\ndecline.  Perhaps I might make out a case of palliation; but shall I\nspeak ingenuously?  I confess it, as a besetting infirmity of mine, that\nI am too much of an Eudaemonist; I hanker too much after a state of\nhappiness, both for myself and others; I cannot face misery, whether my\nown or not, with an eye of sufficient firmness, and am little capable of\nencountering present pain for the sake of any reversionary benefit.  On\nsome other matters I can agree with the gentlemen in the cotton trade\n{15} at Manchester in affecting the Stoic philosophy, but not in this.\nHere I take the liberty of an Eclectic philosopher, and I look out for\nsome courteous and considerate sect that will condescend more to the\ninfirm condition of an opium-eater; that are \"sweet men,\" as Chaucer\nsays, \"to give absolution,\" and will show some conscience in the penances\nthey inflict, and the efforts of abstinence they exact from poor sinners\nlike myself.  An inhuman moralist I can no more endure in my nervous\nstate than opium that has not been boiled.  At any rate, he who summons\nme to send out a large freight of self-denial and mortification upon any\ncruising voyage of moral improvement, must make it clear to my\nunderstanding that the concern is a hopeful one.  At my time of life (six-\nand-thirty years of age) it cannot be supposed that I have much energy to\nspare; in fact, I find it all little enough for the intellectual labours\nI have on my hands, and therefore let no man expect to frighten me by a\nfew hard words into embarking any part of it upon desperate adventures of\nmorality.\n\nWhether desperate or not, however, the issue of the struggle in 1813 was\nwhat I have mentioned, and from this date the reader is to consider me as\na regular and confirmed opium-eater, of whom to ask whether on any\nparticular day he had or had not taken opium, would be to ask whether his\nlungs had performed respiration, or the heart fulfilled its functions.\nYou understand now, reader, what I am, and you are by this time aware\nthat no old gentleman \"with a snow-white beard\" will have any chance of\npersuading me to surrender \"the little golden receptacle of the\npernicious drug.\"  No; I give notice to all, whether moralists or\nsurgeons, that whatever be their pretensions and skill in their\nrespective lines of practice, they must not hope for any countenance from\nme, if they think to begin by any savage proposition for a Lent or a\nRamadan of abstinence from opium.  This, then, being all fully understood\nbetween us, we shall in future sail before the wind.  Now then, reader,\nfrom 1813, where all this time we have been sitting down and loitering,\nrise up, if you please, and walk forward about three years more.  Now\ndraw up the curtain, and you shall see me in a new character.\n\nIf any man, poor or rich, were to say that he would tell us what had been\nthe happiest day in his life, and the why and the wherefore, I suppose\nthat we should all cry out--Hear him!  Hear him!  As to the happiest\n_day_, that must be very difficult for any wise man to name, because any\nevent that could occupy so distinguished a place in a man's retrospect of\nhis life, or be entitled to have shed a special felicity on any one day,\nought to be of such an enduring character as that (accidents apart) it\nshould have continued to shed the same felicity, or one not\ndistinguishably less, on many years together.  To the happiest _lustrum_,\nhowever, or even to the happiest _year_, it may be allowed to any man to\npoint without discountenance from wisdom.  This year, in my case, reader,\nwas the one which we have now reached; though it stood, I confess, as a\nparenthesis between years of a gloomier character.  It was a year of\nbrilliant water (to speak after the manner of jewellers), set as it were,\nand insulated, in the gloom and cloudy melancholy of opium.  Strange as\nit may sound, I had a little before this time descended suddenly, and\nwithout any considerable effort, from 320 grains of opium (_i.e_. eight\n{16} thousand drops of laudanum) per day, to forty grains, or one-eighth\npart.  Instantaneously, and as if by magic, the cloud of profoundest\nmelancholy which rested upon my brain, like some black vapours that I\nhave seen roll away from the summits of mountains, drew off in one day\n([Greek text]); passed off with its murky banners as simultaneously as a\nship that has been stranded, and is floated off by a spring tide--\n\n   That moveth altogether, if it move at all.\n\nNow, then, I was again happy; I now took only 1000 drops of laudanum per\nday; and what was that?  A latter spring had come to close up the season\nof youth; my brain performed its functions as healthily as ever before; I\nread Kant again, and again I understood him, or fancied that I did.  Again\nmy feelings of pleasure expanded themselves to all around me; and if any\nman from Oxford or Cambridge, or from neither, had been announced to me\nin my unpretending cottage, I should have welcomed him with as sumptuous\na reception as so poor a man could offer.  Whatever else was wanting to a\nwise man's happiness, of laudanum I would have given him as much as he\nwished, and in a golden cup.  And, by the way, now that I speak of giving\nlaudanum away, I remember about this time a little incident, which I\nmention because, trifling as it was, the reader will soon meet it again\nin my dreams, which it influenced more fearfully than could be imagined.\nOne day a Malay knocked at my door.  What business a Malay could have to\ntransact amongst English mountains I cannot conjecture; but possibly he\nwas on his road to a seaport about forty miles distant.\n\nThe servant who opened the door to him was a young girl, born and bred\namongst the mountains, who had never seen an Asiatic dress of any sort;\nhis turban therefore confounded her not a little; and as it turned out\nthat his attainments in English were exactly of the same extent as hers\nin the Malay, there seemed to be an impassable gulf fixed between all\ncommunication of ideas, if either party had happened to possess any.  In\nthis dilemma, the girl, recollecting the reputed learning of her master\n(and doubtless giving me credit for a knowledge of all the languages of\nthe earth besides perhaps a few of the lunar ones), came and gave me to\nunderstand that there was a sort of demon below, whom she clearly\nimagined that my art could exorcise from the house.  I did not\nimmediately go down, but when I did, the group which presented itself,\narranged as it was by accident, though not very elaborate, took hold of\nmy fancy and my eye in a way that none of the statuesque attitudes\nexhibited in the ballets at the Opera-house, though so ostentatiously\ncomplex, had ever done.  In a cottage kitchen, but panelled on the wall\nwith dark wood that from age and rubbing resembled oak, and looking more\nlike a rustic hall of entrance than a kitchen, stood the Malay--his\nturban and loose trousers of dingy white relieved upon the dark\npanelling.  He had placed himself nearer to the girl than she seemed to\nrelish, though her native spirit of mountain intrepidity contended with\nthe feeling of simple awe which her countenance expressed as she gazed\nupon the tiger-cat before her.  And a more striking picture there could\nnot be imagined than the beautiful English face of the girl, and its\nexquisite fairness, together with her erect and independent attitude,\ncontrasted with the sallow and bilious skin of the Malay, enamelled or\nveneered with mahogany by marine air, his small, fierce, restless eyes,\nthin lips, slavish gestures and adorations.  Half-hidden by the ferocious-\nlooking Malay was a little child from a neighbouring cottage who had\ncrept in after him, and was now in the act of reverting its head and\ngazing upwards at the turban and the fiery eyes beneath it, whilst with\none hand he caught at the dress of the young woman for protection.  My\nknowledge of the Oriental tongues is not remarkably extensive, being\nindeed confined to two words--the Arabic word for barley and the Turkish\nfor opium (madjoon), which I have learned from _Anastasius_; and as I had\nneither a Malay dictionary nor even Adelung's _Mithridates_, which might\nhave helped me to a few words, I addressed him in some lines from the\nIliad, considering that, of such languages as I possessed, Greek, in\npoint of longitude, came geographically nearest to an Oriental one.  He\nworshipped me in a most devout manner, and replied in what I suppose was\nMalay.  In this way I saved my reputation with my neighbours, for the\nMalay had no means of betraying the secret.  He lay down upon the floor\nfor about an hour, and then pursued his journey.  On his departure I\npresented him with a piece of opium.  To him, as an Orientalist, I\nconcluded that opium must be familiar; and the expression of his face\nconvinced me that it was.  Nevertheless, I was struck with some little\nconsternation when I saw him suddenly raise his hand to his mouth, and,\nto use the schoolboy phrase, bolt the whole, divided into three pieces,\nat one mouthful.  The quantity was enough to kill three dragoons and\ntheir horses, and I felt some alarm for the poor creature; but what could\nbe done?  I had given him the opium in compassion for his solitary life,\non recollecting that if he had travelled on foot from London it must be\nnearly three weeks since he could have exchanged a thought with any human\nbeing.  I could not think of violating the laws of hospitality by having\nhim seized and drenched with an emetic, and thus frightening him into a\nnotion that we were going to sacrifice him to some English idol.  No:\nthere was clearly no help for it.  He took his leave, and for some days I\nfelt anxious, but as I never heard of any Malay being found dead, I\nbecame convinced that he was used {17} to opium; and that I must have\ndone him the service I designed by giving him one night of respite from\nthe pains of wandering.\n\nThis incident I have digressed to mention, because this Malay (partly\nfrom the picturesque exhibition he assisted to frame, partly from the\nanxiety I connected with his image for some days) fastened afterwards\nupon my dreams, and brought other Malays with him, worse than himself,\nthat ran \"a-muck\" {18} at me, and led me into a world of troubles.  But\nto quit this episode, and to return to my intercalary year of happiness.\nI have said already, that on a subject so important to us all as\nhappiness, we should listen with pleasure to any man's experience or\nexperiments, even though he were but a plough-boy, who cannot be supposed\nto have ploughed very deep into such an intractable soil as that of human\npains and pleasures, or to have conducted his researches upon any very\nenlightened principles.  But I who have taken happiness both in a solid\nand liquid shape, both boiled and unboiled, both East India and\nTurkey--who have conducted my experiments upon this interesting subject\nwith a sort of galvanic battery, and have, for the general benefit of the\nworld, inoculated myself, as it were, with the poison of 8000 drops of\nlaudanum per day (just for the same reason as a French surgeon inoculated\nhimself lately with cancer, an English one twenty years ago with plague,\nand a third, I know not of what nation, with hydrophobia), I (it will be\nadmitted) must surely know what happiness is, if anybody does.  And\ntherefore I will here lay down an analysis of happiness; and as the most\ninteresting mode of communicating it, I will give it, not didactically,\nbut wrapped up and involved in a picture of one evening, as I spent every\nevening during the intercalary year when laudanum, though taken daily,\nwas to me no more than the elixir of pleasure.  This done, I shall quit\nthe subject of happiness altogether, and pass to a very different\none--_the pains of opium_.\n\nLet there be a cottage standing in a valley, eighteen miles from any\ntown--no spacious valley, but about two miles long by three-quarters of a\nmile in average width; the benefit of which provision is that all the\nfamily resident within its circuit will compose, as it were, one larger\nhousehold, personally familiar to your eye, and more or less interesting\nto your affections.  Let the mountains be real mountains, between 3,000\nand 4,000 feet high, and the cottage a real cottage, not (as a witty\nauthor has it) \"a cottage with a double coach-house;\" let it be, in fact\n(for I must abide by the actual scene), a white cottage, embowered with\nflowering shrubs, so chosen as to unfold a succession of flowers upon the\nwalls and clustering round the windows through all the months of spring,\nsummer, and autumn--beginning, in fact, with May roses, and ending with\njasmine.  Let it, however, _not_ be spring, nor summer, nor autumn, but\nwinter in his sternest shape.  This is a most important point in the\nscience of happiness.  And I am surprised to see people overlook it, and\nthink it matter of congratulation that winter is going, or, if coming, is\nnot likely to be a severe one.  On the contrary, I put up a petition\nannually for as much snow, hail, frost, or storm, of one kind or other,\nas the skies can possibly afford us.  Surely everybody is aware of the\ndivine pleasures which attend a winter fireside, candles at four o'clock,\nwarm hearth-rugs, tea, a fair tea-maker, shutters closed, curtains\nflowing in ample draperies on the floor, whilst the wind and rain are\nraging audibly without,\n\n   And at the doors and windows seem to call,\n   As heav'n and earth they would together mell;\n   Yet the least entrance find they none at all;\n   Whence sweeter grows our rest secure in massy hall.\n\n   _Castle of Indolence_.\n\nAll these are items in the description of a winter evening which must\nsurely be familiar to everybody born in a high latitude.  And it is\nevident that most of these delicacies, like ice-cream, require a very low\ntemperature of the atmosphere to produce them; they are fruits which\ncannot be ripened without weather stormy or inclement in some way or\nother.  I am not \"_particular_,\" as people say, whether it be snow, or\nblack frost, or wind so strong that (as Mr. --- says) \"you may lean your\nback against it like a post.\"  I can put up even with rain, provided it\nrains cats and dogs; but something of the sort I must have, and if I have\nit not, I think myself in a manner ill-used; for why am I called on to\npay so heavily for winter, in coals and candles, and various privations\nthat will occur even to gentlemen, if I am not to have the article good\nof its kind?  No, a Canadian winter for my money, or a Russian one, where\nevery man is but a co-proprietor with the north wind in the fee-simple of\nhis own ears.  Indeed, so great an epicure am I in this matter that I\ncannot relish a winter night fully if it be much past St. Thomas's day,\nand have degenerated into disgusting tendencies to vernal appearances.\nNo, it must be divided by a thick wall of dark nights from all return of\nlight and sunshine.  From the latter weeks of October to Christmas Eve,\ntherefore, is the period during which happiness is in season, which, in\nmy judgment, enters the room with the tea-tray; for tea, though ridiculed\nby those who are naturally of coarse nerves, or are become so from wine-\ndrinking, and are not susceptible of influence from so refined a\nstimulant, will always be the favourite beverage of the intellectual;\nand, for my part, I would have joined Dr. Johnson in a _bellum\ninternecinum_ against Jonas Hanway, or any other impious person, who\nshould presume to disparage it.  But here, to save myself the trouble of\ntoo much verbal description, I will introduce a painter, and give him\ndirections for the rest of the picture.  Painters do not like white\ncottages, unless a good deal weather-stained; but as the reader now\nunderstands that it is a winter night, his services will not be required\nexcept for the inside of the house.\n\nPaint me, then, a room seventeen feet by twelve, and not more than seven\nand a half feet high.  This, reader, is somewhat ambitiously styled in my\nfamily the drawing-room; but being contrived \"a double debt to pay,\" it\nis also, and more justly, termed the library, for it happens that books\nare the only article of property in which I am richer than my neighbours.\nOf these I have about five thousand, collected gradually since my\neighteenth year.  Therefore, painter, put as many as you can into this\nroom.  Make it populous with books, and, furthermore, paint me a good\nfire, and furniture plain and modest, befitting the unpretending cottage\nof a scholar.  And near the fire paint me a tea-table, and (as it is\nclear that no creature can come to see one such a stormy night) place\nonly two cups and saucers on the tea-tray; and, if you know how to paint\nsuch a thing symbolically or otherwise, paint me an eternal\ntea-pot--eternal _a parte ante_ and _a parte post_--for I usually drink\ntea from eight o'clock at night to four o'clock in the morning.  And as\nit is very unpleasant to make tea or to pour it out for oneself, paint me\na lovely young woman sitting at the table.  Paint her arms like Aurora's\nand her smiles like Hebe's.  But no, dear M., not even in jest let me\ninsinuate that thy power to illuminate my cottage rests upon a tenure so\nperishable as mere personal beauty, or that the witchcraft of angelic\nsmiles lies within the empire of any earthly pencil.  Pass then, my good\npainter, to something more within its power; and the next article brought\nforward should naturally be myself--a picture of the Opium-eater, with\nhis \"little golden receptacle of the pernicious drug\" lying beside him on\nthe table.  As to the opium, I have no objection to see a picture of\n_that_, though I would rather see the original.  You may paint it if you\nchoose, but I apprise you that no \"little\" receptacle would, even in\n1816, answer _my_ purpose, who was at a distance from the \"stately\nPantheon,\" and all druggists (mortal or otherwise).  No, you may as well\npaint the real receptacle, which was not of gold, but of glass, and as\nmuch like a wine-decanter as possible.  Into this you may put a quart of\nruby-coloured laudanum; that, and a book of German Metaphysics placed by\nits side, will sufficiently attest my being in the neighbourhood.  But as\nto myself--there I demur.  I admit that, naturally, I ought to occupy the\nforeground of the picture; that being the hero of the piece, or (if you\nchoose) the criminal at the bar, my body should be had into court.  This\nseems reasonable; but why should I confess on this point to a painter? or\nwhy confess at all?  If the public (into whose private ear I am\nconfidentially whispering my confessions, and not into any painter's)\nshould chance to have framed some agreeable picture for itself of the\nOpium-eater's exterior, should have ascribed to him, romantically an\nelegant person or a handsome face, why should I barbarously tear from it\nso pleasing a delusion--pleasing both to the public and to me?  No; paint\nme, if at all, according to your own fancy, and as a painter's fancy\nshould teem with beautiful creations, I cannot fail in that way to be a\ngainer.  And now, reader, we have run through all the ten categories of\nmy condition as it stood about 1816-17, up to the middle of which latter\nyear I judge myself to have been a happy man, and the elements of that\nhappiness I have endeavoured to place before you in the above sketch of\nthe interior of a scholar's library, in a cottage among the mountains, on\na stormy winter evening.\n\nBut now, farewell--a long farewell--to happiness, winter or summer!\nFarewell to smiles and laughter!  Farewell to peace of mind!  Farewell to\nhope and to tranquil dreams, and to the blessed consolations of sleep.\nFor more than three years and a half I am summoned away from these.  I am\nnow arrived at an Iliad of woes, for I have now to record\n\n\n\nTHE PAINS OF OPIUM\n\n\n   As when some great painter dips\n   His pencil in the gloom of earthquake and eclipse.\n\n   SHELLEY'S _Revolt of Islam_.\n\nReader, who have thus far accompanied me, I must request your attention\nto a brief explanatory note on three points:\n\n1.  For several reasons I have not been able to compose the notes for\nthis part of my narrative into any regular and connected shape.  I give\nthe notes disjointed as I find them, or have now drawn them up from\nmemory.  Some of them point to their own date, some I have dated, and\nsome are undated.  Whenever it could answer my purpose to transplant them\nfrom the natural or chronological order, I have not scrupled to do so.\nSometimes I speak in the present, sometimes in the past tense.  Few of\nthe notes, perhaps, were written exactly at the period of time to which\nthey relate; but this can little affect their accuracy, as the\nimpressions were such that they can never fade from my mind.  Much has\nbeen omitted.  I could not, without effort, constrain myself to the task\nof either recalling, or constructing into a regular narrative, the whole\nburthen of horrors which lies upon my brain.  This feeling partly I plead\nin excuse, and partly that I am now in London, and am a helpless sort of\nperson, who cannot even arrange his own papers without assistance; and I\nam separated from the hands which are wont to perform for me the offices\nof an amanuensis.\n\n2.  You will think perhaps that I am too confidential and communicative\nof my own private history.  It may be so.  But my way of writing is\nrather to think aloud, and follow my own humours, than much to consider\nwho is listening to me; and if I stop to consider what is proper to be\nsaid to this or that person, I shall soon come to doubt whether any part\nat all is proper.  The fact is, I place myself at a distance of fifteen\nor twenty years ahead of this time, and suppose myself writing to those\nwho will be interested about me hereafter; and wishing to have some\nrecord of time, the entire history of which no one can know but myself, I\ndo it as fully as I am able with the efforts I am now capable of making,\nbecause I know not whether I can ever find time to do it again.\n\n3.  It will occur to you often to ask, why did I not release myself from\nthe horrors of opium by leaving it off or diminishing it?  To this I must\nanswer briefly: it might be supposed that I yielded to the fascinations\nof opium too easily; it cannot be supposed that any man can be charmed by\nits terrors.  The reader may be sure, therefore, that I made attempts\ninnumerable to reduce the quantity.  I add, that those who witnessed the\nagonies of those attempts, and not myself, were the first to beg me to\ndesist.  But could not have I reduced it a drop a day, or, by adding\nwater, have bisected or trisected a drop?  A thousand drops bisected\nwould thus have taken nearly six years to reduce, and that way would\ncertainly not have answered.  But this is a common mistake of those who\nknow nothing of opium experimentally; I appeal to those who do, whether\nit is not always found that down to a certain point it can be reduced\nwith ease and even pleasure, but that after that point further reduction\ncauses intense suffering.  Yes, say many thoughtless persons, who know\nnot what they are talking of, you will suffer a little low spirits and\ndejection for a few days.  I answer, no; there is nothing like low\nspirits; on the contrary, the mere animal spirits are uncommonly raised:\nthe pulse is improved: the health is better.  It is not there that the\nsuffering lies.  It has no resemblance to the sufferings caused by\nrenouncing wine.  It is a state of unutterable irritation of stomach\n(which surely is not much like dejection), accompanied by intense\nperspirations, and feelings such as I shall not attempt to describe\nwithout more space at my command.\n\nI shall now enter _in medias res_, and shall anticipate, from a time when\nmy opium pains might be said to be at their _acme_, an account of their\npalsying effects on the intellectual faculties.\n\n* * * * *\n\nMy studies have now been long interrupted.  I cannot read to myself with\nany pleasure, hardly with a moment's endurance.  Yet I read aloud\nsometimes for the pleasure of others, because reading is an\naccomplishment of mine, and, in the slang use of the word\n\"accomplishment\" as a superficial and ornamental attainment, almost the\nonly one I possess; and formerly, if I had any vanity at all connected\nwith any endowment or attainment of mine, it was with this, for I had\nobserved that no accomplishment was so rare.  Players are the worst\nreaders of all:--reads vilely; and Mrs. ---, who is so celebrated, can\nread nothing well but dramatic compositions: Milton she cannot read\nsufferably.  People in general either read poetry without any passion at\nall, or else overstep the modesty of nature, and read not like scholars.\nOf late, if I have felt moved by anything it has been by the grand\nlamentations of Samson Agonistes, or the great harmonies of the Satanic\nspeeches in Paradise Regained, when read aloud by myself.  A young lady\nsometimes comes and drinks tea with us: at her request and M.'s, I now\nand then read W-'s poems to them.  (W., by-the-bye is the only poet I\never met who could read his own verses: often indeed he reads admirably.)\n\nFor nearly two years I believe that I read no book, but one; and I owe it\nto the author, in discharge of a great debt of gratitude, to mention what\nthat was.  The sublimer and more passionate poets I still read, as I have\nsaid, by snatches, and occasionally.  But my proper vocation, as I well\nknow, was the exercise of the analytic understanding.  Now, for the most\npart analytic studies are continuous, and not to be pursued by fits and\nstarts, or fragmentary efforts.  Mathematics, for instance, intellectual\nphilosophy, &c, were all become insupportable to me; I shrunk from them\nwith a sense of powerless and infantine feebleness that gave me an\nanguish the greater from remembering the time when I grappled with them\nto my own hourly delight; and for this further reason, because I had\ndevoted the labour of my whole life, and had dedicated my intellect,\nblossoms and fruits, to the slow and elaborate toil of constructing one\nsingle work, to which I had presumed to give the title of an unfinished\nwork of Spinosa's--viz., _De Emendatione Humani Intellectus_.  This was\nnow lying locked up, as by frost, like any Spanish bridge or aqueduct,\nbegun upon too great a scale for the resources of the architect; and\ninstead of reviving me as a monument of wishes at least, and aspirations,\nand a life of labour dedicated to the exaltation of human nature in that\nway in which God had best fitted me to promote so great an object, it was\nlikely to stand a memorial to my children of hopes defeated, of baffled\nefforts, of materials uselessly accumulated, of foundations laid that\nwere never to support a super-structure--of the grief and the ruin of the\narchitect.  In this state of imbecility I had, for amusement, turned my\nattention to political economy; my understanding, which formerly had been\nas active and restless as a hyaena, could not, I suppose (so long as I\nlived at all) sink into utter lethargy; and political economy offers this\nadvantage to a person in my state, that though it is eminently an organic\nscience (no part, that is to say, but what acts on the whole as the whole\nagain reacts on each part), yet the several parts may be detached and\ncontemplated singly.  Great as was the prostration of my powers at this\ntime, yet I could not forget my knowledge; and my understanding had been\nfor too many years intimate with severe thinkers, with logic, and the\ngreat masters of knowledge, not to be aware of the utter feebleness of\nthe main herd of modern economists.  I had been led in 1811 to look into\nloads of books and pamphlets on many branches of economy; and, at my\ndesire, M. sometimes read to me chapters from more recent works, or parts\nof parliamentary debates.  I saw that these were generally the very dregs\nand rinsings of the human intellect; and that any man of sound head, and\npractised in wielding logic with a scholastic adroitness, might take up\nthe whole academy of modern economists, and throttle them between heaven\nand earth with his finger and thumb, or bray their fungus-heads to powder\nwith a lady's fan.  At length, in 1819, a friend in Edinburgh sent me\ndown Mr. Ricardo's book; and recurring to my own prophetic anticipation\nof the advent of some legislator for this science, I said, before I had\nfinished the first chapter, \"Thou art the man!\"  Wonder and curiosity\nwere emotions that had long been dead in me.  Yet I wondered once more: I\nwondered at myself that I could once again be stimulated to the effort of\nreading, and much more I wondered at the book.  Had this profound work\nbeen really written in England during the nineteenth century?  Was it\npossible?  I supposed thinking {19} had been extinct in England.  Could\nit be that an Englishman, and he not in academic bowers, but oppressed by\nmercantile and senatorial cares, had accomplished what all the\nuniversities of Europe and a century of thought had failed even to\nadvance by one hair's breadth?  All other writers had been crushed and\noverlaid by the enormous weight of facts and documents.  Mr. Ricardo had\ndeduced _a priori_ from the understanding itself laws which first gave a\nray of light into the unwieldy chaos of materials, and had constructed\nwhat had been but a collection of tentative discussions into a science of\nregular proportions, now first standing on an eternal basis.\n\nThus did one single work of a profound understanding avail to give me a\npleasure and an activity which I had not known for years.  It roused me\neven to write, or at least to dictate what M. wrote for me.  It seemed to\nme that some important truths had escaped even \"the inevitable eye\" of\nMr. Ricardo; and as these were for the most part of such a nature that I\ncould express or illustrate them more briefly and elegantly by algebraic\nsymbols than in the usual clumsy and loitering diction of economists, the\nwhole would not have filled a pocket-book; and being so brief, with M.\nfor my amanuensis, even at this time, incapable as I was of all general\nexertion, I drew up my _Prolegomena to all future Systems of Political\nEconomy_.  I hope it will not be found redolent of opium; though, indeed,\nto most people the subject is a sufficient opiate.\n\nThis exertion, however, was but a temporary flash, as the sequel showed;\nfor I designed to publish my work.  Arrangements were made at a\nprovincial press, about eighteen miles distant, for printing it.  An\nadditional compositor was retained for some days on this account.  The\nwork was even twice advertised, and I was in a manner pledged to the\nfulfilment of my intention.  But I had a preface to write, and a\ndedication, which I wished to make a splendid one, to Mr. Ricardo.  I\nfound myself quite unable to accomplish all this.  The arrangements were\ncountermanded, the compositor dismissed, and my \"Prolegomena\" rested\npeacefully by the side of its elder and more dignified brother.\n\nI have thus described and illustrated my intellectual torpor in terms\nthat apply more or less to every part of the four years during which I\nwas under the Circean spells of opium.  But for misery and suffering, I\nmight indeed be said to have existed in a dormant state.  I seldom could\nprevail on myself to write a letter; an answer of a few words to any that\nI received was the utmost that I could accomplish, and often _that_ not\nuntil the letter had lain weeks or even months on my writing-table.\nWithout the aid of M. all records of bills paid or _to be_ paid must have\nperished, and my whole domestic economy, whatever became of Political\nEconomy, must have gone into irretrievable confusion.  I shall not\nafterwards allude to this part of the case.  It is one, however, which\nthe opium-eater will find, in the end, as oppressive and tormenting as\nany other, from the sense of incapacity and feebleness, from the direct\nembarrassments incident to the neglect or procrastination of each day's\nappropriate duties, and from the remorse which must often exasperate the\nstings of these evils to a reflective and conscientious mind.  The opium-\neater loses none of his moral sensibilities or aspirations.  He wishes\nand longs as earnestly as ever to realize what he believes possible, and\nfeels to be exacted by duty; but his intellectual apprehension of what is\npossible infinitely outruns his power, not of execution only, but even of\npower to attempt.  He lies under the weight of incubus and nightmare; he\nlies in sight of all that he would fain perform, just as a man forcibly\nconfined to his bed by the mortal languor of a relaxing disease, who is\ncompelled to witness injury or outrage offered to some object of his\ntenderest love: he curses the spells which chain him down from motion; he\nwould lay down his life if he might but get up and walk; but he is\npowerless as an infant, and cannot even attempt to rise.\n\nI now pass to what is the main subject of these latter confessions, to\nthe history and journal of what took place in my dreams, for these were\nthe immediate and proximate cause of my acutest suffering.\n\nThe first notice I had of any important change going on in this part of\nmy physical economy was from the reawakening of a state of eye generally\nincident to childhood, or exalted states of irritability.  I know not\nwhether my reader is aware that many children, perhaps most, have a power\nof painting, as it were upon the darkness, all sorts of phantoms.  In\nsome that power is simply a mechanical affection of the eye; others have\na voluntary or semi-voluntary power to dismiss or to summon them; or, as\na child once said to me when I questioned him on this matter, \"I can tell\nthem to go, and they go ---, but sometimes they come when I don't tell\nthem to come.\"  Whereupon I told him that he had almost as unlimited a\ncommand over apparitions as a Roman centurion over his soldiers.--In the\nmiddle of 1817, I think it was, that this faculty became positively\ndistressing to me: at night, when I lay awake in bed, vast processions\npassed along in mournful pomp; friezes of never-ending stories, that to\nmy feelings were as sad and solemn as if they were stories drawn from\ntimes before OEdipus or Priam, before Tyre, before Memphis.  And at the\nsame time a corresponding change took place in my dreams; a theatre\nseemed suddenly opened and lighted up within my brain, which presented\nnightly spectacles of more than earthly splendour.  And the four\nfollowing facts may be mentioned as noticeable at this time:\n\n1.  That as the creative state of the eye increased, a sympathy seemed to\narise between the waking and the dreaming states of the brain in one\npoint--that whatsoever I happened to call up and to trace by a voluntary\nact upon the darkness was very apt to transfer itself to my dreams, so\nthat I feared to exercise this faculty; for, as Midas turned all things\nto gold that yet baffled his hopes and defrauded his human desires, so\nwhatsoever things capable of being visually represented I did but think\nof in the darkness, immediately shaped themselves into phantoms of the\neye; and by a process apparently no less inevitable, when thus once\ntraced in faint and visionary colours, like writings in sympathetic ink,\nthey were drawn out by the fierce chemistry of my dreams into\ninsufferable splendour that fretted my heart.\n\n2.  For this and all other changes in my dreams were accompanied by deep-\nseated anxiety and gloomy melancholy, such as are wholly incommunicable\nby words.  I seemed every night to descend, not metaphorically, but\nliterally to descend, into chasms and sunless abysses, depths below\ndepths, from which it seemed hopeless that I could ever reascend.  Nor\ndid I, by waking, feel that I _had_ reascended.  This I do not dwell\nupon; because the state of gloom which attended these gorgeous\nspectacles, amounting at last to utter darkness, as of some suicidal\ndespondency, cannot be approached by words.\n\n3.  The sense of space, and in the end the sense of time, were both\npowerfully affected.  Buildings, landscapes, &c., were exhibited in\nproportions so vast as the bodily eye is not fitted to receive.  Space\nswelled, and was amplified to an extent of unutterable infinity.  This,\nhowever, did not disturb me so much as the vast expansion of time; I\nsometimes seemed to have lived for 70 or 100 years in one night--nay,\nsometimes had feelings representative of a millennium passed in that\ntime, or, however, of a duration far beyond the limits of any human\nexperience.\n\n4.  The minutest incidents of childhood, or forgotten scenes of later\nyears, were often revived: I could not be said to recollect them, for if\nI had been told of them when waking, I should not have been able to\nacknowledge them as parts of my past experience.  But placed as they were\nbefore me, in dreams like intuitions, and clothed in all their evanescent\ncircumstances and accompanying feelings, I _recognised_ them\ninstantaneously.  I was once told by a near relative of mine, that having\nin her childhood fallen into a river, and being on the very verge of\ndeath but for the critical assistance which reached her, she saw in a\nmoment her whole life, in its minutest incidents, arrayed before her\nsimultaneously as in a mirror; and she had a faculty developed as\nsuddenly for comprehending the whole and every part.  This, from some\nopium experiences of mine, I can believe; I have indeed seen the same\nthing asserted twice in modern books, and accompanied by a remark which I\nam convinced is true; viz., that the dread book of account which the\nScriptures speak of is in fact the mind itself of each individual.  Of\nthis at least I feel assured, that there is no such thing as _forgetting_\npossible to the mind; a thousand accidents may and will interpose a veil\nbetween our present consciousness and the secret inscriptions on the\nmind; accidents of the same sort will also rend away this veil; but\nalike, whether veiled or unveiled, the inscription remains for ever, just\nas the stars seem to withdraw before the common light of day, whereas in\nfact we all know that it is the light which is drawn over them as a veil,\nand that they are waiting to be revealed when the obscuring daylight\nshall have withdrawn.\n\nHaving noticed these four facts as memorably distinguishing my dreams\nfrom those of health, I shall now cite a case illustrative of the first\nfact, and shall then cite any others that I remember, either in their\nchronological order, or any other that may give them more effect as\npictures to the reader.\n\nI had been in youth, and even since, for occasional amusement, a great\nreader of Livy, whom I confess that I prefer, both for style and matter,\nto any other of the Roman historians; and I had often felt as most solemn\nand appalling sounds, and most emphatically representative of the majesty\nof the Roman people, the two words so often occurring in Livy--_Consul\nRomanus_, especially when the consul is introduced in his military\ncharacter.  I mean to say that the words king, sultan, regent, &c., or\nany other titles of those who embody in their own persons the collective\nmajesty of a great people, had less power over my reverential feelings.  I\nhad also, though no great reader of history, made myself minutely and\ncritically familiar with one period of English history, viz., the period\nof the Parliamentary War, having been attracted by the moral grandeur of\nsome who figured in that day, and by the many interesting memoirs which\nsurvive those unquiet times.  Both these parts of my lighter reading,\nhaving furnished me often with matter of reflection, now furnished me\nwith matter for my dreams.  Often I used to see, after painting upon the\nblank darkness a sort of rehearsal whilst waking, a crowd of ladies, and\nperhaps a festival and dances.  And I heard it said, or I said to myself,\n\"These are English ladies from the unhappy times of Charles I.  These are\nthe wives and the daughters of those who met in peace, and sate at the\nsame table, and were allied by marriage or by blood; and yet, after a\ncertain day in August 1642, never smiled upon each other again, nor met\nbut in the field of battle; and at Marston Moor, at Newbury, or at\nNaseby, cut asunder all ties of love by the cruel sabre, and washed away\nin blood the memory of ancient friendship.\"  The ladies danced, and\nlooked as lovely as the court of George IV.  Yet I knew, even in my\ndream, that they had been in the grave for nearly two centuries.  This\npageant would suddenly dissolve; and at a clapping of hands would be\nheard the heart-quaking sound _of Consul Romanus_; and immediately came\n\"sweeping by,\" in gorgeous paludaments, Paulus or Marius, girt round by a\ncompany of centurions, with the crimson tunic hoisted on a spear, and\nfollowed by the _alalagmos_ of the Roman legions.\n\nMany years ago, when I was looking over Piranesi's, Antiquities of Rome,\nMr. Coleridge, who was standing by, described to me a set of plates by\nthat artist, called his _Dreams_, and which record the scenery of his own\nvisions during the delirium of a fever.  Some of them (I describe only\nfrom memory of Mr. Coleridge's account) represented vast Gothic halls, on\nthe floor of which stood all sorts of engines and machinery, wheels,\ncables, pulleys, levers, catapults, &c. &c., expressive of enormous power\nput forth and resistance overcome.  Creeping along the sides of the walls\nyou perceived a staircase; and upon it, groping his way upwards, was\nPiranesi himself: follow the stairs a little further and you perceive it\ncome to a sudden and abrupt termination without any balustrade, and\nallowing no step onwards to him who had reached the extremity except into\nthe depths below.  Whatever is to become of poor Piranesi, you suppose at\nleast that his labours must in some way terminate here.  But raise your\neyes, and behold a second flight of stairs still higher, on which again\nPiranesi is perceived, but this time standing on the very brink of the\nabyss.  Again elevate your eye, and a still more aerial flight of stairs\nis beheld, and again is poor Piranesi busy on his aspiring labours; and\nso on, until the unfinished stairs and Piranesi both are lost in the\nupper gloom of the hall.  With the same power of endless growth and self-\nreproduction did my architecture proceed in dreams.  In the early stage\nof my malady the splendours of my dreams were indeed chiefly\narchitectural; and I beheld such pomp of cities and palaces as was never\nyet beheld by the waking eye unless in the clouds.  From a great modern\npoet I cite part of a passage which describes, as an appearance actually\nbeheld in the clouds, what in many of its circumstances I saw frequently\nin sleep:\n\n   The appearance, instantaneously disclosed,\n   Was of a mighty city--boldly say\n   A wilderness of building, sinking far\n   And self-withdrawn into a wondrous depth,\n   Far sinking into splendour--without end!\n   Fabric it seem'd of diamond, and of gold,\n   With alabaster domes, and silver spires,\n   And blazing terrace upon terrace, high\n   Uplifted; here, serene pavilions bright\n   In avenues disposed; there towers begirt\n   With battlements that on their restless fronts\n   Bore stars--illumination of all gems!\n   By earthly nature had the effect been wrought\n   Upon the dark materials of the storm\n   Now pacified; on them, and on the coves,\n   And mountain-steeps and summits, whereunto\n   The vapours had receded,--taking there\n   Their station under a cerulean sky.  &c. &c.\n\nThe sublime circumstance, \"battlements that on their _restless_ fronts\nbore stars,\" might have been copied from my architectural dreams, for it\noften occurred.  We hear it reported of Dryden and of Fuseli, in modern\ntimes, that they thought proper to eat raw meat for the sake of obtaining\nsplendid dreams: how much better for such a purpose to have eaten opium,\nwhich yet I do not remember that any poet is recorded to have done,\nexcept the dramatist Shadwell; and in ancient days Homer is I think\nrightly reputed to have known the virtues of opium.\n\nTo my architecture succeeded dreams of lakes and silvery expanses of\nwater: these haunted me so much that I feared (though possibly it will\nappear ludicrous to a medical man) that some dropsical state or tendency\nof the brain might thus be making itself (to use a metaphysical word)\n_objective_; and the sentient organ _project_ itself as its own object.\nFor two months I suffered greatly in my head, a part of my bodily\nstructure which had hitherto been so clear from all touch or taint of\nweakness (physically I mean) that I used to say of it, as the last Lord\nOrford said of his stomach, that it seemed likely to survive the rest of\nmy person.  Till now I had never felt a headache even, or any the\nslightest pain, except rheumatic pains caused by my own folly.  However,\nI got over this attack, though it must have been verging on something\nvery dangerous.\n\nThe waters now changed their character--from translucent lakes shining\nlike mirrors they now became seas and oceans.  And now came a tremendous\nchange, which, unfolding itself slowly like a scroll through many months,\npromised an abiding torment; and in fact it never left me until the\nwinding up of my case.  Hitherto the human face had mixed often in my\ndreams, but not despotically nor with any special power of tormenting.\nBut now that which I have called the tyranny of the human face began to\nunfold itself.  Perhaps some part of my London life might be answerable\nfor this.  Be that as it may, now it was that upon the rocking waters of\nthe ocean the human face began to appear; the sea appeared paved with\ninnumerable faces upturned to the heavens--faces imploring, wrathful,\ndespairing, surged upwards by thousands, by myriads, by generations, by\ncenturies: my agitation was infinite; my mind tossed and surged with the\nocean.\n\n\n\nMay 1818\n\n\nThe Malay has been a fearful enemy for months.  I have been every night,\nthrough his means, transported into Asiatic scenes.  I know not whether\nothers share in my feelings on this point; but I have often thought that\nif I were compelled to forego England, and to live in China, and among\nChinese manners and modes of life and scenery, I should go mad.  The\ncauses of my horror lie deep, and some of them must be common to others.\nSouthern Asia in general is the seat of awful images and associations.  As\nthe cradle of the human race, it would alone have a dim and reverential\nfeeling connected with it.  But there are other reasons.  No man can\npretend that the wild, barbarous, and capricious superstitions of Africa,\nor of savage tribes elsewhere, affect him in the way that he is affected\nby the ancient, monumental, cruel, and elaborate religions of Indostan,\n&c.  The mere antiquity of Asiatic things, of their institutions,\nhistories, modes of faith, &c., is so impressive, that to me the vast age\nof the race and name overpowers the sense of youth in the individual.  A\nyoung Chinese seems to me an antediluvian man renewed.  Even Englishmen,\nthough not bred in any knowledge of such institutions, cannot but shudder\nat the mystic sublimity of _castes_ that have flowed apart, and refused\nto mix, through such immemorial tracts of time; nor can any man fail to\nbe awed by the names of the Ganges or the Euphrates.  It contributes much\nto these feelings that southern Asia is, and has been for thousands of\nyears, the part of the earth most swarming with human life, the great\n_officina gentium_.  Man is a weed in those regions.  The vast empires\nalso in which the enormous population of Asia has always been cast, give\na further sublimity to the feelings associated with all Oriental names or\nimages.  In China, over and above what it has in common with the rest of\nsouthern Asia, I am terrified by the modes of life, by the manners, and\nthe barrier of utter abhorrence and want of sympathy placed between us by\nfeelings deeper than I can analyse.  I could sooner live with lunatics or\nbrute animals.  All this, and much more than I can say or have time to\nsay, the reader must enter into before he can comprehend the unimaginable\nhorror which these dreams of Oriental imagery and mythological tortures\nimpressed upon me.  Under the connecting feeling of tropical heat and\nvertical sunlights I brought together all creatures, birds, beasts,\nreptiles, all trees and plants, usages and appearances, that are found in\nall tropical regions, and assembled them together in China or Indostan.\nFrom kindred feelings, I soon brought Egypt and all her gods under the\nsame law.  I was stared at, hooted at, grinned at, chattered at, by\nmonkeys, by parroquets, by cockatoos.  I ran into pagodas, and was fixed\nfor centuries at the summit or in secret rooms: I was the idol; I was the\npriest; I was worshipped; I was sacrificed.  I fled from the wrath of\nBrama through all the forests of Asia: Vishnu hated me: Seeva laid wait\nfor me.  I came suddenly upon Isis and Osiris: I had done a deed, they\nsaid, which the ibis and the crocodile trembled at.  I was buried for a\nthousand years in stone coffins, with mummies and sphynxes, in narrow\nchambers at the heart of eternal pyramids.  I was kissed, with cancerous\nkisses, by crocodiles; and laid, confounded with all unutterable slimy\nthings, amongst reeds and Nilotic mud.\n\nI thus give the reader some slight abstraction of my Oriental dreams,\nwhich always filled me with such amazement at the monstrous scenery that\nhorror seemed absorbed for a while in sheer astonishment.  Sooner or\nlater came a reflux of feeling that swallowed up the astonishment, and\nleft me not so much in terror as in hatred and abomination of what I saw.\nOver every form, and threat, and punishment, and dim sightless\nincarceration, brooded a sense of eternity and infinity that drove me\ninto an oppression as of madness.  Into these dreams only it was, with\none or two slight exceptions, that any circumstances of physical horror\nentered.  All before had been moral and spiritual terrors.  But here the\nmain agents were ugly birds, or snakes, or crocodiles; especially the\nlast.  The cursed crocodile became to me the object of more horror than\nalmost all the rest.  I was compelled to live with him, and (as was\nalways the case almost in my dreams) for centuries.  I escaped sometimes,\nand found myself in Chinese houses, with cane tables, &c.  All the feet\nof the tables, sofas, &c., soon became instinct with life: the abominable\nhead of the crocodile, and his leering eyes, looked out at me, multiplied\ninto a thousand repetitions; and I stood loathing and fascinated.  And so\noften did this hideous reptile haunt my dreams that many times the very\nsame dream was broken up in the very same way: I heard gentle voices\nspeaking to me (I hear everything when I am sleeping), and instantly I\nawoke.  It was broad noon, and my children were standing, hand in hand,\nat my bedside--come to show me their coloured shoes, or new frocks, or to\nlet me see them dressed for going out.  I protest that so awful was the\ntransition from the damned crocodile, and the other unutterable monsters\nand abortions of my dreams, to the sight of innocent _human_ natures and\nof infancy, that in the mighty and sudden revulsion of mind I wept, and\ncould not forbear it, as I kissed their faces.\n\n\n\nJune 1819\n\n\nI have had occasion to remark, at various periods of my life, that the\ndeaths of those whom we love, and indeed the contemplation of death\ngenerally, is (_caeteris paribus_) more affecting in summer than in any\nother season of the year.  And the reasons are these three, I think:\nfirst, that the visible heavens in summer appear far higher, more\ndistant, and (if such a solecism may be excused) more infinite; the\nclouds, by which chiefly the eye expounds the distance of the blue\npavilion stretched over our heads, are in summer more voluminous, massed\nand accumulated in far grander and more towering piles.  Secondly, the\nlight and the appearances of the declining and the setting sun are much\nmore fitted to be types and characters of the Infinite.  And thirdly\n(which is the main reason), the exuberant and riotous prodigality of life\nnaturally forces the mind more powerfully upon the antagonist thought of\ndeath, and the wintry sterility of the grave.  For it may be observed\ngenerally, that wherever two thoughts stand related to each other by a\nlaw of antagonism, and exist, as it were, by mutual repulsion, they are\napt to suggest each other.  On these accounts it is that I find it\nimpossible to banish the thought of death when I am walking alone in the\nendless days of summer; and any particular death, if not more affecting,\nat least haunts my mind more obstinately and besiegingly in that season.\nPerhaps this cause, and a slight incident which I omit, might have been\nthe immediate occasions of the following dream, to which, however, a\npredisposition must always have existed in my mind; but having been once\nroused it never left me, and split into a thousand fantastic varieties,\nwhich often suddenly reunited, and composed again the original dream.\n\nI thought that it was a Sunday morning in May, that it was Easter Sunday,\nand as yet very early in the morning.  I was standing, as it seemed to\nme, at the door of my own cottage.  Right before me lay the very scene\nwhich could really be commanded from that situation, but exalted, as was\nusual, and solemnised by the power of dreams.  There were the same\nmountains, and the same lovely valley at their feet; but the mountains\nwere raised to more than Alpine height, and there was interspace far\nlarger between them of meadows and forest lawns; the hedges were rich\nwith white roses; and no living creature was to be seen, excepting that\nin the green churchyard there were cattle tranquilly reposing upon the\nverdant graves, and particularly round about the grave of a child whom I\nhad tenderly loved, just as I had really beheld them, a little before\nsunrise in the same summer, when that child died.  I gazed upon the well-\nknown scene, and I said aloud (as I thought) to myself, \"It yet wants\nmuch of sunrise, and it is Easter Sunday; and that is the day on which\nthey celebrate the first fruits of resurrection.  I will walk abroad; old\ngriefs shall be forgotten to-day; for the air is cool and still, and the\nhills are high and stretch away to heaven; and the forest glades are as\nquiet as the churchyard, and with the dew I can wash the fever from my\nforehead, and then I shall be unhappy no longer.\"  And I turned as if to\nopen my garden gate, and immediately I saw upon the left a scene far\ndifferent, but which yet the power of dreams had reconciled into harmony\nwith the other.  The scene was an Oriental one, and there also it was\nEaster Sunday, and very early in the morning.  And at a vast distance\nwere visible, as a stain upon the horizon, the domes and cupolas of a\ngreat city--an image or faint abstraction, caught perhaps in childhood\nfrom some picture of Jerusalem.  And not a bow-shot from me, upon a stone\nand shaded by Judean palms, there sat a woman, and I looked, and it\nwas--Ann!  She fixed her eyes upon me earnestly, and I said to her at\nlength: \"So, then, I have found you at last.\"  I waited, but she answered\nme not a word.  Her face was the same as when I saw it last, and yet\nagain how different!  Seventeen years ago, when the lamplight fell upon\nher face, as for the last time I kissed her lips (lips, Ann, that to me\nwere not polluted), her eyes were streaming with tears: the tears were\nnow wiped away; she seemed more beautiful than she was at that time, but\nin all other points the same, and not older.  Her looks were tranquil,\nbut with unusual solemnity of expression, and I now gazed upon her with\nsome awe; but suddenly her countenance grew dim, and turning to the\nmountains I perceived vapours rolling between us.  In a moment all had\nvanished, thick darkness came on, and in the twinkling of an eye I was\nfar away from mountains, and by lamplight in Oxford Street, walking again\nwith Ann--just as we walked seventeen years before, when we were both\nchildren.\n\nAs a final specimen, I cite one of a different character, from 1820.\n\nThe dream commenced with a music which now I often heard in dreams--a\nmusic of preparation and of awakening suspense, a music like the opening\nof the Coronation Anthem, and which, like _that_, gave the feeling of a\nvast march, of infinite cavalcades filing off, and the tread of\ninnumerable armies.  The morning was come of a mighty day--a day of\ncrisis and of final hope for human nature, then suffering some mysterious\neclipse, and labouring in some dread extremity.  Somewhere, I knew not\nwhere--somehow, I knew not how--by some beings, I knew not whom--a\nbattle, a strife, an agony, was conducting, was evolving like a great\ndrama or piece of music, with which my sympathy was the more\ninsupportable from my confusion as to its place, its cause, its nature,\nand its possible issue.  I, as is usual in dreams (where of necessity we\nmake ourselves central to every movement), had the power, and yet had not\nthe power, to decide it.  I had the power, if I could raise myself to\nwill it, and yet again had not the power, for the weight of twenty\nAtlantics was upon me, or the oppression of inexpiable guilt.  \"Deeper\nthan ever plummet sounded,\" I lay inactive.  Then like a chorus the\npassion deepened.  Some greater interest was at stake, some mightier\ncause than ever yet the sword had pleaded, or trumpet had proclaimed.\nThen came sudden alarms, hurryings to and fro, trepidations of\ninnumerable fugitives--I knew not whether from the good cause or the bad,\ndarkness and lights, tempest and human faces, and at last, with the sense\nthat all was lost, female forms, and the features that were worth all the\nworld to me, and but a moment allowed--and clasped hands, and\nheart-breaking partings, and then--everlasting farewells!  And with a\nsigh, such as the caves of Hell sighed when the incestuous mother uttered\nthe abhorred name of death, the sound was reverberated--everlasting\nfarewells!  And again and yet again reverberated--everlasting farewells!\n\nAnd I awoke in struggles, and cried aloud--\"I will sleep no more.\"\n\nBut I am now called upon to wind up a narrative which has already\nextended to an unreasonable length.  Within more spacious limits the\nmaterials which I have used might have been better unfolded, and much\nwhich I have not used might have been added with effect.  Perhaps,\nhowever, enough has been given.  It now remains that I should say\nsomething of the way in which this conflict of horrors was finally\nbrought to a crisis.  The reader is already aware (from a passage near\nthe beginning of the introduction to the first part) that the Opium-eater\nhas, in some way or other, \"unwound almost to its final links the\naccursed chain which bound him.\"  By what means?  To have narrated this\naccording to the original intention would have far exceeded the space\nwhich can now be allowed.  It is fortunate, as such a cogent reason\nexists for abridging it, that I should, on a maturer view of the case,\nhave been exceedingly unwilling to injure, by any such unaffecting\ndetails, the impression of the history itself, as an appeal to the\nprudence and the conscience of the yet unconfirmed opium-eater--or even\n(though a very inferior consideration) to injure its effect as a\ncomposition.  The interest of the judicious reader will not attach itself\nchiefly to the subject of the fascinating spells, but to the fascinating\npower.  Not the Opium-eater, but the opium, is the true hero of the tale,\nand the legitimate centre on which the interest revolves.  The object was\nto display the marvellous agency of opium, whether for pleasure or for\npain: if that is done, the action of the piece has closed.\n\nHowever, as some people, in spite of all laws to the contrary, will\npersist in asking what became of the Opium-eater, and in what state he\nnow is, I answer for him thus: The reader is aware that opium had long\nceased to found its empire on spells of pleasure; it was solely by the\ntortures connected with the attempt to abjure it that it kept its hold.\nYet, as other tortures, no less it may be thought, attended the\nnon-abjuration of such a tyrant, a choice only of evils was left; and\n_that_ might as well have been adopted which, however terrific in itself,\nheld out a prospect of final restoration to happiness.  This appears\ntrue; but good logic gave the author no strength to act upon it.  However,\na crisis arrived for the author's life, and a crisis for other objects\nstill dearer to him--and which will always be far dearer to him than his\nlife, even now that it is again a happy one.  I saw that I must die if I\ncontinued the opium.  I determined, therefore, if that should be\nrequired, to die in throwing it off.  How much I was at that time taking\nI cannot say, for the opium which I used had been purchased for me by a\nfriend, who afterwards refused to let me pay him; so that I could not\nascertain even what quantity I had used within the year.  I apprehend,\nhowever, that I took it very irregularly, and that I varied from about\nfifty or sixty grains to 150 a day.  My first task was to reduce it to\nforty, to thirty, and as fast as I could to twelve grains.\n\nI triumphed.  But think not, reader, that therefore my sufferings were\nended, nor think of me as of one sitting in a _dejected_ state.  Think of\nme as one, even when four months had passed, still agitated, writhing,\nthrobbing, palpitating, shattered, and much perhaps in the situation of\nhim who has been racked, as I collect the torments of that state from the\naffecting account of them left by a most innocent sufferer {20} of the\ntimes of James I.  Meantime, I derived no benefit from any medicine,\nexcept one prescribed to me by an Edinburgh surgeon of great eminence,\nviz., ammoniated tincture of valerian.  Medical account, therefore, of my\nemancipation I have not much to give, and even that little, as managed by\na man so ignorant of medicine as myself, would probably tend only to\nmislead.  At all events, it would be misplaced in this situation.  The\nmoral of the narrative is addressed to the opium-eater, and therefore of\nnecessity limited in its application.  If he is taught to fear and\ntremble, enough has been effected.  But he may say that the issue of my\ncase is at least a proof that opium, after a seventeen years' use and an\neight years' abuse of its powers, may still be renounced, and that _he_\nmay chance to bring to the task greater energy than I did, or that with a\nstronger constitution than mine he may obtain the same results with less.\nThis may be true.  I would not presume to measure the efforts of other\nmen by my own.  I heartily wish him more energy.  I wish him the same\nsuccess.  Nevertheless, I had motives external to myself which he may\nunfortunately want, and these supplied me with conscientious supports\nwhich mere personal interests might fail to supply to a mind debilitated\nby opium.\n\nJeremy Taylor conjectures that it may be as painful to be born as to die.\nI think it probable; and during the whole period of diminishing the opium\nI had the torments of a man passing out of one mode of existence into\nanother.  The issue was not death, but a sort of physical regeneration;\nand I may add that ever since, at intervals, I have had a restoration of\nmore than youthful spirits, though under the pressure of difficulties\nwhich in a less happy state of mind I should have called misfortunes.\n\nOne memorial of my former condition still remains--my dreams are not yet\nperfectly calm; the dread swell and agitation of the storm have not\nwholly subsided; the legions that encamped in them are drawing off, but\nnot all departed; my sleep is still tumultuous, and, like the gates of\nParadise to our first parents when looking back from afar, it is still\n(in the tremendous line of Milton)\n\n   With dreadful faces throng'd, and fiery arms.\n\n\n\n\nAPPENDIX\n\n\nFrom the \"London Magazine\" for December 1822.\n\nThe interest excited by the two papers bearing this title, in our numbers\nfor September and October 1821, will have kept our promise of a Third\nPart fresh in the remembrance of our readers.  That we are still unable\nto fulfil our engagement in its original meaning will, we, are sure, be\nmatter of regret to them as to ourselves, especially when they have\nperused the following affecting narrative.  It was composed for the\npurpose of being appended to an edition of the Confessions in a separate\nvolume, which is already before the public, and we have reprinted it\nentire, that our subscribers may be in possession of the whole of this\nextraordinary history.\n\n* * * * *\n\nThe proprietors of this little work having determined on reprinting it,\nsome explanation seems called for, to account for the non-appearance of a\nthird part promised in the _London Magazine_ of December last; and the\nmore so because the proprietors, under whose guarantee that promise was\nissued, might otherwise be implicated in the blame--little or\nmuch--attached to its non-fulfilment.  This blame, in mere justice, the\nauthor takes wholly upon himself.  What may be the exact amount of the\nguilt which he thus appropriates is a very dark question to his own\njudgment, and not much illuminated by any of the masters in casuistry\nwhom he has consulted on the occasion.  On the one hand it seems\ngenerally agreed that a promise is binding in the inverse ratio of the\nnumbers to whom it is made; for which reason it is that we see many\npersons break promises without scruple that are made to a whole nation,\nwho keep their faith religiously in all private engagements, breaches of\npromise towards the stronger party being committed at a man's own peril;\non the other hand, the only parties interested in the promises of an\nauthor are his readers, and these it is a point of modesty in any author\nto believe as few as possible--or perhaps only one, in which case any\npromise imposes a sanctity of moral obligation which it is shocking to\nthink of.  Casuistry dismissed, however, the author throws himself on the\nindulgent consideration of all who may conceive themselves aggrieved by\nhis delay, in the following account of his own condition from the end of\nlast year, when the engagement was made, up nearly to the present time.\nFor any purpose of self-excuse it might be sufficient to say that\nintolerable bodily suffering had totally disabled him for almost any\nexertion of mind, more especially for such as demands and presupposes a\npleasurable and genial state of feeling; but, as a case that may by\npossibility contribute a trifle to the medical history of opium, in a\nfurther stage of its action than can often have been brought under the\nnotice of professional men, he has judged that it might be acceptable to\nsome readers to have it described more at length.  _Fiat experimentum in\ncorpore vili_ is a just rule where there is any reasonable presumption of\nbenefit to arise on a large scale.  What the benefit may be will admit of\na doubt, but there can be none as to the value of the body; for a more\nworthless body than his own the author is free to confess cannot be.  It\nis his pride to believe that it is the very ideal of a base, crazy,\ndespicable human system, that hardly ever could have been meant to be\nseaworthy for two days under the ordinary storms and wear and tear of\nlife; and indeed, if that were the creditable way of disposing of human\nbodies, he must own that he should almost be ashamed to bequeath his\nwretched structure to any respectable dog.  But now to the case, which,\nfor the sake of avoiding the constant recurrence of a cumbersome\nperiphrasis, the author will take the liberty of giving in the first\nperson.\n\n* * * * *\n\nThose who have read the Confessions will have closed them with the\nimpression that I had wholly renounced the use of opium.  This impression\nI meant to convey, and that for two reasons: first, because the very act\nof deliberately recording such a state of suffering necessarily presumes\nin the recorder a power of surveying his own case as a cool spectator,\nand a degree of spirits for adequately describing it which it would be\ninconsistent to suppose in any person speaking from the station of an\nactual sufferer; secondly, because I, who had descended from so large a\nquantity as 8,000 drops to so small a one (comparatively speaking) as a\nquantity ranging between 300 and 160 drops, might well suppose that the\nvictory was in effect achieved.  In suffering my readers, therefore, to\nthink of me as of a reformed opium-eater, I left no impression but what I\nshared myself; and, as may be seen, even this impression was left to be\ncollected from the general tone of the conclusion, and not from any\nspecific words, which are in no instance at variance with the literal\ntruth.  In no long time after that paper was written I became sensible\nthat the effort which remained would cost me far more energy than I had\nanticipated, and the necessity for making it was more apparent every\nmonth.  In particular I became aware of an increasing callousness or\ndefect of sensibility in the stomach, and this I imagined might imply a\nscirrhous state of that organ, either formed or forming.  An eminent\nphysician, to whose kindness I was at that time deeply indebted, informed\nme that such a termination of my case was not impossible, though likely\nto be forestalled by a different termination in the event of my\ncontinuing the use of opium.  Opium therefore I resolved wholly to abjure\nas soon as I should find myself at liberty to bend my undivided attention\nand energy to this purpose.  It was not, however, until the 24th of June\nlast that any tolerable concurrence of facilities for such an attempt\narrived.  On that day I began my experiment, having previously settled in\nmy own mind that I would not flinch, but would \"stand up to the scratch\"\nunder any possible \"punishment.\"  I must premise that about 170 or 180\ndrops had been my ordinary allowance for many months; occasionally I had\nrun up as high as 500, and once nearly to 700; in repeated preludes to my\nfinal experiment I had also gone as low as 100 drops; but had found it\nimpossible to stand it beyond the fourth day--which, by the way, I have\nalways found more difficult to get over than any of the preceding three.\nI went off under easy sail--130 drops a day for three days; on the fourth\nI plunged at once to 80.  The misery which I now suffered \"took the\nconceit\" out of me at once, and for about a month I continued off and on\nabout this mark; then I sunk to 60, and the next day to--none at all.\nThis was the first day for nearly ten years that I had existed without\nopium.  I persevered in my abstinence for ninety hours; i.e., upwards of\nhalf a week.  Then I took--ask me not how much; say, ye severest, what\nwould ye have done?  Then I abstained again--then took about 25 drops\nthen abstained; and so on.\n\nMeantime the symptoms which attended my case for the first six weeks of\nmy experiment were these: enormous irritability and excitement of the\nwhole system; the stomach in particular restored to a full feeling of\nvitality and sensibility, but often in great pain; unceasing restlessness\nnight and day; sleep--I scarcely knew what it was; three hours out of the\ntwenty-four was the utmost I had, and that so agitated and shallow that I\nheard every sound that was near me.  Lower jaw constantly swelling, mouth\nulcerated, and many other distressing symptoms that would be tedious to\nrepeat; amongst which, however, I must mention one, because it had never\nfailed to accompany any attempt to renounce opium--viz., violent\nsternutation.  This now became exceedingly troublesome, sometimes lasting\nfor two hours at once, and recurring at least twice or three times a day.\nI was not much surprised at this on recollecting what I had somewhere\nheard or read, that the membrane which lines the nostrils is a\nprolongation of that which lines the stomach; whence, I believe, are\nexplained the inflammatory appearances about the nostrils of dram\ndrinkers.  The sudden restoration of its original sensibility to the\nstomach expressed itself, I suppose, in this way.  It is remarkable also\nthat during the whole period of years through which I had taken opium I\nhad never once caught cold (as the phrase is), nor even the slightest\ncough.  But now a violent cold attacked me, and a cough soon after.  In\nan unfinished fragment of a letter begun about this time to--I find these\nwords: \"You ask me to write the--Do you know Beaumont and Fletcher's play\nof \"Thierry and Theodore\"?  There you will see my case as to sleep; nor\nis it much of an exaggeration in other features.  I protest to you that I\nhave a greater influx of thoughts in one hour at present than in a whole\nyear under the reign of opium.  It seems as though all the thoughts which\nhad been frozen up for a decade of years by opium had now, according to\nthe old fable, been thawed at once--such a multitude stream in upon me\nfrom all quarters.  Yet such is my impatience and hideous irritability\nthat for one which I detain and write down fifty escape me: in spite of\nmy weariness from suffering and want of sleep, I cannot stand still or\nsit for two minutes together.  'I nunc, et versus tecum meditare\ncanoros.'\"\n\nAt this stage of my experiment I sent to a neighbouring surgeon,\nrequesting that he would come over to see me.  In the evening he came;\nand after briefly stating the case to him, I asked this question; Whether\nhe did not think that the opium might have acted as a stimulus to the\ndigestive organs, and that the present state of suffering in the stomach,\nwhich manifestly was the cause of the inability to sleep, might arise\nfrom indigestion?  His answer was; No; on the contrary, he thought that\nthe suffering was caused by digestion itself, which should naturally go\non below the consciousness, but which from the unnatural state of the\nstomach, vitiated by so long a use of opium, was become distinctly\nperceptible.  This opinion was plausible; and the unintermitting nature\nof the suffering disposes me to think that it was true, for if it had\nbeen any mere _irregular_ affection of the stomach, it should naturally\nhave intermitted occasionally, and constantly fluctuated as to degree.\nThe intention of nature, as manifested in the healthy state, obviously is\nto withdraw from our notice all the vital motions, such as the\ncirculation of the blood, the expansion and contraction of the lungs, the\nperistaltic action of the stomach, &c., and opium, it seems, is able in\nthis, as in other instances, to counteract her purposes.  By the advice\nof the surgeon I tried _bitters_.  For a short time these greatly\nmitigated the feelings under which I laboured, but about the forty-second\nday of the experiment the symptoms already noticed began to retire, and\nnew ones to arise of a different and far more tormenting class; under\nthese, but with a few intervals of remission, I have since continued to\nsuffer.  But I dismiss them undescribed for two reasons: first, because\nthe mind revolts from retracing circumstantially any sufferings from\nwhich it is removed by too short or by no interval.  To do this with\nminuteness enough to make the review of any use would be indeed _infandum\nrenovare dolorem_, and possibly without a sufficient motive; for\nsecondly, I doubt whether this latter state be anyway referable to\nopium--positively considered, or even negatively; that is, whether it is\nto be numbered amongst the last evils from the direct action of opium, or\neven amongst the earliest evils consequent upon a _want_ of opium in a\nsystem long deranged by its use.  Certainly one part of the symptoms\nmight be accounted for from the time of year (August), for though the\nsummer was not a hot one, yet in any case the sum of all the heat\n_funded_ (if one may say so) during the previous months, added to the\nexisting heat of that month, naturally renders August in its better half\nthe hottest part of the year; and it so happened that--the excessive\nperspiration which even at Christmas attends any great reduction in the\ndaily quantum of opium--and which in July was so violent as to oblige me\nto use a bath five or six times a day--had about the setting-in of the\nhottest season wholly retired, on which account any bad effect of the\nheat might be the more unmitigated.  Another symptom--viz., what in my\nignorance I call internal rheumatism (sometimes affecting the shoulders,\n&c., but more often appearing to be seated in the stomach)--seemed again\nless probably attributable to the opium, or the want of opium, than to\nthe dampness of the house {21} which I inhabit, which had about this time\nattained its maximum, July having been, as usual, a month of incessant\nrain in our most rainy part of England.\n\nUnder these reasons for doubting whether opium had any connexion with the\nlatter stage of my bodily wretchedness--except, indeed, as an occasional\ncause, as having left the body weaker and more crazy, and thus\npredisposed to any mal-influence whatever--I willingly spare my reader\nall description of it; let it perish to him, and would that I could as\neasily say let it perish to my own remembrances, that any future hours of\ntranquillity may not be disturbed by too vivid an ideal of possible human\nmisery!\n\nSo much for the sequel of my experiment.  As to the former stage, in\nwhich probably lies the experiment and its application to other cases, I\nmust request my reader not to forget the reasons for which I have\nrecorded it.  These were two: First, a belief that I might add some\ntrifle to the history of opium as a medical agent.  In this I am aware\nthat I have not at all fulfilled my own intentions, in consequence of the\ntorpor of mind, pain of body, and extreme disgust to the subject which\nbesieged me whilst writing that part of my paper; which part being\nimmediately sent off to the press (distant about five degrees of\nlatitude), cannot be corrected or improved.  But from this account,\nrambling as it may be, it is evident that thus much of benefit may arise\nto the persons most interested in such a history of opium, viz., to opium-\neaters in general, that it establishes, for their consolation and\nencouragement, the fact that opium may be renounced, and without greater\nsufferings than an ordinary resolution may support, and by a pretty rapid\ncourse {22} of descent.\n\nTo communicate this result of my experiment was my foremost purpose.\nSecondly, as a purpose collateral to this, I wished to explain how it had\nbecome impossible for me to compose a Third Part in time to accompany\nthis republication; for during the time of this experiment the\nproof-sheets of this reprint were sent to me from London, and such was my\ninability to expand or to improve them, that I could not even bear to\nread them over with attention enough to notice the press errors or to\ncorrect any verbal inaccuracies.  These were my reasons for troubling my\nreader with any record, long or short, of experiments relating to so\ntruly base a subject as my own body; and I am earnest with the reader\nthat he will not forget them, or so far misapprehend me as to believe it\npossible that I would condescend to so rascally a subject for its own\nsake, or indeed for any less object than that of general benefit to\nothers.  Such an animal as the self-observing valetudinarian I know there\nis; I have met him myself occasionally, and I know that he is the worst\nimaginable _heautontimoroumenos_; aggravating and sustaining, by calling\ninto distinct consciousness, every symptom that would else perhaps, under\na different direction given to the thoughts, become evanescent.  But as\nto myself, so profound is my contempt for this undignified and selfish\nhabit, that I could as little condescend to it as I could to spend my\ntime in watching a poor servant girl, to whom at this moment I hear some\nlad or other making love at the back of my house.  Is it for a\nTranscendental Philosopher to feel any curiosity on such an occasion?  Or\ncan I, whose life is worth only eight and a half years' purchase, be\nsupposed to have leisure for such trivial employments?  However, to put\nthis out of question, I shall say one thing, which will perhaps shock\nsome readers, but I am sure it ought not to do so, considering the\nmotives on which I say it.  No man, I suppose, employs much of his time\non the phenomena of his own body without some regard for it; whereas the\nreader sees that, so far from looking upon mine with any complacency or\nregard, I hate it, and make it the object of my bitter ridicule and\ncontempt; and I should not be displeased to know that the last\nindignities which the law inflicts upon the bodies of the worst\nmalefactors might hereafter fall upon it.  And, in testification of my\nsincerity in saying this, I shall make the following offer.  Like other\nmen, I have particular fancies about the place of my burial; having lived\nchiefly in a mountainous region, I rather cleave to the conceit, that a\ngrave in a green churchyard amongst the ancient and solitary hills will\nbe a sublimer and more tranquil place of repose for a philosopher than\nany in the hideous Golgothas of London.  Yet if the gentlemen of\nSurgeons' Hall think that any benefit can redound to their science from\ninspecting the appearances in the body of an opium-eater, let them speak\nbut a word, and I will take care that mine shall be legally secured to\nthem--i.e., as soon as I have done with it myself.  Let them not hesitate\nto express their wishes upon any scruples of false delicacy and\nconsideration for my feelings; I assure them they will do me too much\nhonour by \"demonstrating\" on such a crazy body as mine, and it will give\nme pleasure to anticipate this posthumous revenge and insult inflicted\nupon that which has caused me so much suffering in this life.  Such\nbequests are not common; reversionary benefits contingent upon the death\nof the testator are indeed dangerous to announce in many cases: of this\nwe have a remarkable instance in the habits of a Roman prince, who used,\nupon any notification made to him by rich persons that they had left him\na handsome estate in their wills, to express his entire satisfaction at\nsuch arrangements and his gracious acceptance of those loyal legacies;\nbut then, if the testators neglected to give him immediate possession of\nthe property, if they traitorously \"persisted in living\" (_si vivere\nperseverarent_, as Suetonius expresses it), he was highly provoked, and\ntook his measures accordingly.  In those times, and from one of the worst\nof the Caesars, we might expect such conduct; but I am sure that from\nEnglish surgeons at this day I need look for no expressions of\nimpatience, or of any other feelings but such as are answerable to that\npure love of science and all its interests which induces me to make such\nan offer.\n\nSept 30, 1822\n\n\n\n\nFOOTNOTES\n\n\n{1}  \"Not yet _recorded_,\" I say; for there is one celebrated man of the\npresent day, who, if all be true which is reported of him, has greatly\nexceeded me in quantity.\n\n{2}  A third exception might perhaps have been added; and my reason for\nnot adding that exception is chiefly because it was only in his juvenile\nefforts that the writer whom I allude to expressly addressed hints to\nphilosophical themes; his riper powers having been all dedicated (on very\nexcusable and very intelligible grounds, under the present direction of\nthe popular mind in England) to criticism and the Fine Arts.  This reason\napart, however, I doubt whether he is not rather to be considered an\nacute thinker than a subtle one.  It is, besides, a great drawback on his\nmastery over philosophical subjects that he has obviously not had the\nadvantage of a regular scholastic education: he has not read Plato in his\nyouth (which most likely was only his misfortune), but neither has he\nread Kant in his manhood (which is his fault).\n\n{3}  I disclaim any allusion to _existing_ professors, of whom indeed I\nknow only one.\n\n{4}  To this same Jew, by the way, some eighteen months afterwards, I\napplied again on the same business; and, dating at that time from a\nrespectable college, I was fortunate enough to gain his serious attention\nto my proposals.  My necessities had not arisen from any extravagance or\nyouthful levities (these my habits and the nature of my pleasures raised\nme far above), but simply from the vindictive malice of my guardian, who,\nwhen he found himself no longer able to prevent me from going to the\nuniversity, had, as a parting token of his good nature, refused to sign\nan order for granting me a shilling beyond the allowance made to me at\nschool--viz., 100 pounds per annum.  Upon this sum it was in my time\nbarely possible to have lived in college, and not possible to a man who,\nthough above the paltry affectation of ostentatious disregard for money,\nand without any expensive tastes, confided nevertheless rather too much\nin servants, and did not delight in the petty details of minute economy.\nI soon, therefore, became embarrassed, and at length, after a most\nvoluminous negotiation with the Jew (some parts of which, if I had\nleisure to rehearse them, would greatly amuse my readers), I was put in\npossession of the sum I asked for, on the \"regular\" terms of paying the\nJew seventeen and a half per cent. by way of annuity on all the money\nfurnished; Israel, on his part, graciously resuming no more than about\nninety guineas of the said money, on account of an attorney's bill (for\nwhat services, to whom rendered, and when, whether at the siege of\nJerusalem, at the building of the second Temple, or on some earlier\noccasion, I have not yet been able to discover).  How many perches this\nbill measured I really forget; but I still keep it in a cabinet of\nnatural curiosities, and some time or other I believe I shall present it\nto the British Museum.\n\n{5}  The Bristol mail is the best appointed in the Kingdom, owing to the\ndouble advantages of an unusually good road and of an extra sum for the\nexpenses subscribed by the Bristol merchants.\n\n{6}  It will be objected that many men, of the highest rank and wealth,\nhave in our own day, as well as throughout our history, been amongst the\nforemost in courting danger in battle.  True; but this is not the case\nsupposed; long familiarity with power has to them deadened its effect and\nits attractions.\n\n{7}  [Greek text].\n\n{8}  [Greek text].  EURIP.  Orest.\n\n{9}  [Greek text].\n\n{10}  [Greek text].  The scholar will know that throughout this passage I\nrefer to the early scenes of the Orestes; one of the most beautiful\nexhibitions of the domestic affections which even the dramas of Euripides\ncan furnish.  To the English reader it may be necessary to say that the\nsituation at the opening of the drama is that of a brother attended only\nby his sister during the demoniacal possession of a suffering conscience\n(or, in the mythology of the play, haunted by the Furies), and in\ncircumstances of immediate danger from enemies, and of desertion or cold\nregard from nominal friends.\n\n{11}  _Evanesced_: this way of going off the stage of life appears to\nhave been well known in the 17th century, but at that time to have been\nconsidered a peculiar privilege of blood-royal, and by no means to be\nallowed to druggists.  For about the year 1686 a poet of rather ominous\nname (and who, by-the-bye, did ample justice to his name), viz., Mr.\n_Flat-man_, in speaking of the death of Charles II. expresses his\nsurprise that any prince should commit so absurd an act as dying,\nbecause, says he,\n\n   \"Kings should disdain to die, and only _disappear_.\"\n\nThey should _abscond_, that is, into the other world.\n\n{12}  Of this, however, the learned appear latterly to have doubted; for\nin a pirated edition of Buchan's _Domestic Medicine_, which I once saw in\nthe hands of a farmer's wife, who was studying it for the benefit of her\nhealth, the Doctor was made to say--\"Be particularly careful never to\ntake above five-and-twenty _ounces_ of laudanum at once;\" the true\nreading being probably five-and-twenty _drops_, which are held equal to\nabout one grain of crude opium.\n\n{13}  Amongst the great herd of travellers, &c., who show sufficiently by\ntheir stupidity that they never held any intercourse with opium, I must\ncaution my readers specially against the brilliant author of\n_Anastasius_.  This gentleman, whose wit would lead one to presume him an\nopium-eater, has made it impossible to consider him in that character,\nfrom the grievous misrepresentation which he gives of its effects at pp.\n215-17 of vol. i.  Upon consideration it must appear such to the author\nhimself, for, waiving the errors I have insisted on in the text, which\n(and others) are adopted in the fullest manner, he will himself admit\nthat an old gentleman \"with a snow-white beard,\" who eats \"ample doses of\nopium,\" and is yet able to deliver what is meant and received as very\nweighty counsel on the bad effects of that practice, is but an\nindifferent evidence that opium either kills people prematurely or sends\nthem into a madhouse.  But for my part, I see into this old gentleman and\nhis motives: the fact is, he was enamoured of \"the little golden\nreceptacle of the pernicious drug\" which Anastasius carried about him;\nand no way of obtaining it so safe and so feasible occurred as that of\nfrightening its owner out of his wits (which, by the bye, are none of the\nstrongest).  This commentary throws a new light upon the case, and\ngreatly improves it as a story; for the old gentleman's speech,\nconsidered as a lecture on pharmacy, is highly absurd; but considered as\na hoax on Anastasius, it reads excellently.\n\n{14}  I have not the book at this moment to consult; but I think the\npassage begins--\"And even that tavern music, which makes one man merry,\nanother mad, in me strikes a deep fit of devotion,\" &c.\n\n{15}  A handsome newsroom, of which I was very politely made free in\npassing through Manchester by several gentlemen of that place, is called,\nI think, _The Porch_; whence I, who am a stranger in Manchester, inferred\nthat the subscribers meant to profess themselves followers of Zeno.  But\nI have been since assured that this is a mistake.\n\n{16}  I here reckon twenty-five drops of laudanum as equivalent to one\ngrain of opium, which, I believe, is the common estimate.  However, as\nboth may be considered variable quantities (the crude opium varying much\nin strength, and the tincture still more), I suppose that no\ninfinitesimal accuracy can be had in such a calculation.  Teaspoons vary\nas much in size as opium in strength.  Small ones hold about 100 drops;\nso that 8,000 drops are about eighty times a teaspoonful.  The reader\nsees how much I kept within Dr. Buchan's indulgent allowance.\n\n{17}  This, however, is not a necessary conclusion; the varieties of\neffect produced by opium on different constitutions are infinite.  A\nLondon magistrate (Harriott's _Struggles through Life_, vol. iii. p. 391,\nthird edition) has recorded that, on the first occasion of his trying\nlaudanum for the gout he took _forty_ drops, the next night _sixty_, and\non the fifth night _eighty_, without any effect whatever; and this at an\nadvanced age.  I have an anecdote from a country surgeon, however, which\nsinks Mr. Harriott's case into a trifle; and in my projected medical\ntreatise on opium, which I will publish provided the College of Surgeons\nwill pay me for enlightening their benighted understandings upon this\nsubject, I will relate it; but it is far too good a story to be published\ngratis.\n\n{18}  See the common accounts in any Eastern traveller or voyager of the\nfrantic excesses committed by Malays who have taken opium, or are reduced\nto desperation by ill-luck at gambling.\n\n{19}  The reader must remember what I here mean by _thinking_, because\nelse this would be a very presumptuous expression.  England, of late, has\nbeen rich to excess in fine thinkers, in the departments of creative and\ncombining thought; but there is a sad dearth of masculine thinkers in any\nanalytic path.  A Scotchman of eminent name has lately told us that he is\nobliged to quit even mathematics for want of encouragement.\n\n{20}  William Lithgow.  His book (Travels, &c.) is ill and pedantically\nwritten; but the account of his own sufferings on the rack at Malaga is\noverpoweringly affecting.\n\n{21}  In saying this I mean no disrespect to the individual house, as the\nreader will understand when I tell him that, with the exception of one or\ntwo princely mansions, and some few inferior ones that have been coated\nwith Roman cement, I am not acquainted with any house in this mountainous\ndistrict which is wholly waterproof.  The architecture of books, I\nflatter myself, is conducted on just principles in this country; but for\nany other architecture, it is in a barbarous state, and what is worse, in\na retrograde state.\n\n{22}  On which last notice I would remark that mine was _too_ rapid, and\nthe suffering therefore needlessly aggravated; or rather, perhaps, it was\nnot sufficiently continuous and equably graduated.  But that the reader\nmay judge for himself, and above all that the Opium-eater, who is\npreparing to retire from business, may have every sort of information\nbefore him, I subjoin my diary:--\n\nFirst Week                   Second Week\n       Drops of Laud.           Drops of Laud.\nMond. June 24 ... 130    Mond. July  1 ...  80\n           25 ... 140                2 ...  80\n           26 ... 130                3 ...  90\n           27 ...  80                4 ... 100\n           28 ...  80                5 ...  80\n           29 ...  80                6 ...  80\n           30 ...  80                7 ...  80\nThird Week                   Fourth Week\nMond. July  8 ... 300    Mond. July 15 ...  76\n            9 ...  50               16 ...  73.5\n           10 }                     17 ...  73.5\n           11 } Hiatus in           18 ...  70\n           12 } MS.                 19 ... 240\n           13 }                     20 ...  80\n           14 ...  76               21 ... 350\nFifth Week\nMond. July 22 ...  60\n           23 ... none.\n           24 ... none.\n           25 ... none.\n           26 ... 200\n           27 ... none.\n\nWhat mean these abrupt relapses, the reader will ask perhaps, to such\nnumbers as 300, 350, &c.?  The _impulse_ to these relapses was mere\ninfirmity of purpose; the _motive_, where any motive blended with this\nimpulse, was either the principle, of \"_reculer pour mieux sauter_;\" (for\nunder the torpor of a large dose, which lasted for a day or two, a less\nquantity satisfied the stomach, which on awakening found itself partly\naccustomed to this new ration); or else it was this principle--that of\nsufferings otherwise equal, those will be borne best which meet with a\nmood of anger.  Now, whenever I ascended to my large dose I was furiously\nincensed on the following day, and could then have borne anything.", "title": "Confessions of an English Opium-Eater"}