{"summary": "An unnamed narrator listens to Douglas, a friend, read a manuscript written by a former governess whom Douglas claims to have known and who is now dead. The manuscript tells the story of how the young governess is hired by a man who has become responsible for his young nephew and niece after the deaths of their parents. He lives mainly in London and is uninterested in raising the children himself.\nThe boy, Miles, is attending a boarding school, while his younger sister, Flora, is living at a country estate in Essex. She is currently being cared for by the housekeeper, Mrs. Grose. The governess' new employer, Miles and Flora's uncle, gives her full charge of the children and explicitly states that she is not to bother him with communications of any sort. The governess travels to her new employer's country house, Bly, and begins her duties.\nMiles soon returns from school for the summer just after a letter arrives from the headmaster stating that he has been expelled. Miles never speaks of the matter, and the governess is hesitant to raise the issue. She fears there is some horrible secret behind the expulsion but is too charmed by the adorable young boy to want to press the issue. Soon thereafter, the governess begins to see around the grounds of the estate the figures of a man and woman whom she does not recognize. These figures come and go at will without ever being seen or challenged by other members of the household, and they seem to the governess to be supernatural. She learns from Mrs. Grose that her predecessor, Miss Jessel, and another employee, Peter Quint, had had a sexual relationship. Prior to their deaths, Jessel and Quint spent much of their time with Flora and Miles, and this fact has grim significance for the governess when she becomes convinced that the two children are secretly aware of the ghosts' presence.\nLater, without permission, Flora leaves the house while Miles is playing music for the governess. The governess notices Flora's absence and goes with Mrs. Grose in search of her. They find her in a clearing in the wood, and the governess is convinced that Flora has been talking to the ghost of Miss Jessel. When the governess finally confronts Flora, the girl denies seeing Miss Jessel and demands never to see the governess again. At the governess' suggestion Mrs. Grose takes Flora away to her uncle, leaving the governess with Miles, who that night at last talks to her about his expulsion; the ghost of Quint appears to the governess at the window. The governess shields Miles, who attempts to see the ghost. The governess tells Miles he is no longer controlled by the ghost and then finds that Miles has died in her arms, and the ghost has gone.\n\n", "full_text": "THE TURN OF THE SCREW\n\nby Henry James\n\n\n[The text is take from the first American appearance of this book.]\n\n\n\n\n\nTHE TURN OF THE SCREW\n\n\nThe story had held us, round the fire, sufficiently breathless, but\nexcept the obvious remark that it was gruesome, as, on Christmas Eve\nin an old house, a strange tale should essentially be, I remember no\ncomment uttered till somebody happened to say that it was the only case\nhe had met in which such a visitation had fallen on a child. The case, I\nmay mention, was that of an apparition in just such an old house as had\ngathered us for the occasion--an appearance, of a dreadful kind, to a\nlittle boy sleeping in the room with his mother and waking her up in the\nterror of it; waking her not to dissipate his dread and soothe him to\nsleep again, but to encounter also, herself, before she had succeeded\nin doing so, the same sight that had shaken him. It was this observation\nthat drew from Douglas--not immediately, but later in the evening--a\nreply that had the interesting consequence to which I call attention.\nSomeone else told a story not particularly effective, which I saw he was\nnot following. This I took for a sign that he had himself something to\nproduce and that we should only have to wait. We waited in fact till two\nnights later; but that same evening, before we scattered, he brought out\nwhat was in his mind.\n\n\"I quite agree--in regard to Griffin's ghost, or whatever it was--that\nits appearing first to the little boy, at so tender an age, adds a\nparticular touch. But it's not the first occurrence of its charming\nkind that I know to have involved a child. If the child gives the effect\nanother turn of the screw, what do you say to TWO children--?\"\n\n\"We say, of course,\" somebody exclaimed, \"that they give two turns! Also\nthat we want to hear about them.\"\n\nI can see Douglas there before the fire, to which he had got up to\npresent his back, looking down at his interlocutor with his hands in\nhis pockets. \"Nobody but me, till now, has ever heard. It's quite too\nhorrible.\" This, naturally, was declared by several voices to give the\nthing the utmost price, and our friend, with quiet art, prepared his\ntriumph by turning his eyes over the rest of us and going on: \"It's\nbeyond everything. Nothing at all that I know touches it.\"\n\n\"For sheer terror?\" I remember asking.\n\nHe seemed to say it was not so simple as that; to be really at a loss\nhow to qualify it. He passed his hand over his eyes, made a little\nwincing grimace. \"For dreadful--dreadfulness!\"\n\n\"Oh, how delicious!\" cried one of the women.\n\nHe took no notice of her; he looked at me, but as if, instead of me,\nhe saw what he spoke of. \"For general uncanny ugliness and horror and\npain.\"\n\n\"Well then,\" I said, \"just sit right down and begin.\"\n\nHe turned round to the fire, gave a kick to a log, watched it an\ninstant. Then as he faced us again: \"I can't begin. I shall have to send\nto town.\" There was a unanimous groan at this, and much reproach; after\nwhich, in his preoccupied way, he explained. \"The story's written. It's\nin a locked drawer--it has not been out for years. I could write to my\nman and enclose the key; he could send down the packet as he finds it.\"\nIt was to me in particular that he appeared to propound this--appeared\nalmost to appeal for aid not to hesitate. He had broken a thickness\nof ice, the formation of many a winter; had had his reasons for a long\nsilence. The others resented postponement, but it was just his scruples\nthat charmed me. I adjured him to write by the first post and to agree\nwith us for an early hearing; then I asked him if the experience in\nquestion had been his own. To this his answer was prompt. \"Oh, thank\nGod, no!\"\n\n\"And is the record yours? You took the thing down?\"\n\n\"Nothing but the impression. I took that HERE\"--he tapped his heart.\n\"I've never lost it.\"\n\n\"Then your manuscript--?\"\n\n\"Is in old, faded ink, and in the most beautiful hand.\" He hung fire\nagain. \"A woman's. She has been dead these twenty years. She sent me the\npages in question before she died.\" They were all listening now, and\nof course there was somebody to be arch, or at any rate to draw the\ninference. But if he put the inference by without a smile it was also\nwithout irritation. \"She was a most charming person, but she was ten\nyears older than I. She was my sister's governess,\" he quietly said.\n\"She was the most agreeable woman I've ever known in her position;\nshe would have been worthy of any whatever. It was long ago, and this\nepisode was long before. I was at Trinity, and I found her at home on\nmy coming down the second summer. I was much there that year--it was a\nbeautiful one; and we had, in her off-hours, some strolls and talks in\nthe garden--talks in which she struck me as awfully clever and nice. Oh\nyes; don't grin: I liked her extremely and am glad to this day to think\nshe liked me, too. If she hadn't she wouldn't have told me. She had\nnever told anyone. It wasn't simply that she said so, but that I knew\nshe hadn't. I was sure; I could see. You'll easily judge why when you\nhear.\"\n\n\"Because the thing had been such a scare?\"\n\nHe continued to fix me. \"You'll easily judge,\" he repeated: \"YOU will.\"\n\nI fixed him, too. \"I see. She was in love.\"\n\nHe laughed for the first time. \"You ARE acute. Yes, she was in love.\nThat is, she had been. That came out--she couldn't tell her story\nwithout its coming out. I saw it, and she saw I saw it; but neither of\nus spoke of it. I remember the time and the place--the corner of the\nlawn, the shade of the great beeches and the long, hot summer afternoon.\nIt wasn't a scene for a shudder; but oh--!\" He quitted the fire and\ndropped back into his chair.\n\n\"You'll receive the packet Thursday morning?\" I inquired.\n\n\"Probably not till the second post.\"\n\n\"Well then; after dinner--\"\n\n\"You'll all meet me here?\" He looked us round again. \"Isn't anybody\ngoing?\" It was almost the tone of hope.\n\n\"Everybody will stay!\"\n\n\"_I_ will\"--and \"_I_ will!\" cried the ladies whose departure had been\nfixed. Mrs. Griffin, however, expressed the need for a little more\nlight. \"Who was it she was in love with?\"\n\n\"The story will tell,\" I took upon myself to reply.\n\n\"Oh, I can't wait for the story!\"\n\n\"The story WON'T tell,\" said Douglas; \"not in any literal, vulgar way.\"\n\n\"More's the pity, then. That's the only way I ever understand.\"\n\n\"Won't YOU tell, Douglas?\" somebody else inquired.\n\nHe sprang to his feet again. \"Yes--tomorrow. Now I must go to bed.\nGood night.\" And quickly catching up a candlestick, he left us slightly\nbewildered. From our end of the great brown hall we heard his step on\nthe stair; whereupon Mrs. Griffin spoke. \"Well, if I don't know who she\nwas in love with, I know who HE was.\"\n\n\"She was ten years older,\" said her husband.\n\n\"Raison de plus--at that age! But it's rather nice, his long reticence.\"\n\n\"Forty years!\" Griffin put in.\n\n\"With this outbreak at last.\"\n\n\"The outbreak,\" I returned, \"will make a tremendous occasion of Thursday\nnight;\" and everyone so agreed with me that, in the light of it, we lost\nall attention for everything else. The last story, however incomplete\nand like the mere opening of a serial, had been told; we handshook and\n\"candlestuck,\" as somebody said, and went to bed.\n\nI knew the next day that a letter containing the key had, by the first\npost, gone off to his London apartments; but in spite of--or perhaps\njust on account of--the eventual diffusion of this knowledge we quite\nlet him alone till after dinner, till such an hour of the evening, in\nfact, as might best accord with the kind of emotion on which our hopes\nwere fixed. Then he became as communicative as we could desire and\nindeed gave us his best reason for being so. We had it from him again\nbefore the fire in the hall, as we had had our mild wonders of the\nprevious night. It appeared that the narrative he had promised to read\nus really required for a proper intelligence a few words of prologue.\nLet me say here distinctly, to have done with it, that this narrative,\nfrom an exact transcript of my own made much later, is what I shall\npresently give. Poor Douglas, before his death--when it was in\nsight--committed to me the manuscript that reached him on the third of\nthese days and that, on the same spot, with immense effect, he began\nto read to our hushed little circle on the night of the fourth. The\ndeparting ladies who had said they would stay didn't, of course, thank\nheaven, stay: they departed, in consequence of arrangements made, in a\nrage of curiosity, as they professed, produced by the touches with\nwhich he had already worked us up. But that only made his little final\nauditory more compact and select, kept it, round the hearth, subject to\na common thrill.\n\nThe first of these touches conveyed that the written statement took up\nthe tale at a point after it had, in a manner, begun. The fact to be in\npossession of was therefore that his old friend, the youngest of several\ndaughters of a poor country parson, had, at the age of twenty, on taking\nservice for the first time in the schoolroom, come up to London, in\ntrepidation, to answer in person an advertisement that had already\nplaced her in brief correspondence with the advertiser. This person\nproved, on her presenting herself, for judgment, at a house in Harley\nStreet, that impressed her as vast and imposing--this prospective patron\nproved a gentleman, a bachelor in the prime of life, such a figure as\nhad never risen, save in a dream or an old novel, before a fluttered,\nanxious girl out of a Hampshire vicarage. One could easily fix his type;\nit never, happily, dies out. He was handsome and bold and pleasant,\noffhand and gay and kind. He struck her, inevitably, as gallant and\nsplendid, but what took her most of all and gave her the courage she\nafterward showed was that he put the whole thing to her as a kind of\nfavor, an obligation he should gratefully incur. She conceived him\nas rich, but as fearfully extravagant--saw him all in a glow of high\nfashion, of good looks, of expensive habits, of charming ways with\nwomen. He had for his own town residence a big house filled with the\nspoils of travel and the trophies of the chase; but it was to his\ncountry home, an old family place in Essex, that he wished her\nimmediately to proceed.\n\nHe had been left, by the death of their parents in India, guardian to\na small nephew and a small niece, children of a younger, a military\nbrother, whom he had lost two years before. These children were, by the\nstrangest of chances for a man in his position--a lone man without the\nright sort of experience or a grain of patience--very heavily on his\nhands. It had all been a great worry and, on his own part doubtless, a\nseries of blunders, but he immensely pitied the poor chicks and had done\nall he could; had in particular sent them down to his other house, the\nproper place for them being of course the country, and kept them there,\nfrom the first, with the best people he could find to look after them,\nparting even with his own servants to wait on them and going down\nhimself, whenever he might, to see how they were doing. The awkward\nthing was that they had practically no other relations and that his\nown affairs took up all his time. He had put them in possession of Bly,\nwhich was healthy and secure, and had placed at the head of their little\nestablishment--but below stairs only--an excellent woman, Mrs. Grose,\nwhom he was sure his visitor would like and who had formerly been maid\nto his mother. She was now housekeeper and was also acting for the time\nas superintendent to the little girl, of whom, without children of her\nown, she was, by good luck, extremely fond. There were plenty of people\nto help, but of course the young lady who should go down as governess\nwould be in supreme authority. She would also have, in holidays, to look\nafter the small boy, who had been for a term at school--young as he was\nto be sent, but what else could be done?--and who, as the holidays were\nabout to begin, would be back from one day to the other. There had\nbeen for the two children at first a young lady whom they had had the\nmisfortune to lose. She had done for them quite beautifully--she was a\nmost respectable person--till her death, the great awkwardness of which\nhad, precisely, left no alternative but the school for little Miles.\nMrs. Grose, since then, in the way of manners and things, had done as\nshe could for Flora; and there were, further, a cook, a housemaid, a\ndairywoman, an old pony, an old groom, and an old gardener, all likewise\nthoroughly respectable.\n\nSo far had Douglas presented his picture when someone put a question.\n\"And what did the former governess die of?--of so much respectability?\"\n\nOur friend's answer was prompt. \"That will come out. I don't\nanticipate.\"\n\n\"Excuse me--I thought that was just what you ARE doing.\"\n\n\"In her successor's place,\" I suggested, \"I should have wished to learn\nif the office brought with it--\"\n\n\"Necessary danger to life?\" Douglas completed my thought. \"She did wish\nto learn, and she did learn. You shall hear tomorrow what she learned.\nMeanwhile, of course, the prospect struck her as slightly grim. She was\nyoung, untried, nervous: it was a vision of serious duties and little\ncompany, of really great loneliness. She hesitated--took a couple of\ndays to consult and consider. But the salary offered much exceeded\nher modest measure, and on a second interview she faced the music, she\nengaged.\" And Douglas, with this, made a pause that, for the benefit of\nthe company, moved me to throw in--\n\n\"The moral of which was of course the seduction exercised by the\nsplendid young man. She succumbed to it.\"\n\nHe got up and, as he had done the night before, went to the fire, gave\na stir to a log with his foot, then stood a moment with his back to us.\n\"She saw him only twice.\"\n\n\"Yes, but that's just the beauty of her passion.\"\n\nA little to my surprise, on this, Douglas turned round to me. \"It WAS\nthe beauty of it. There were others,\" he went on, \"who hadn't succumbed.\nHe told her frankly all his difficulty--that for several applicants the\nconditions had been prohibitive. They were, somehow, simply afraid. It\nsounded dull--it sounded strange; and all the more so because of his\nmain condition.\"\n\n\"Which was--?\"\n\n\"That she should never trouble him--but never, never: neither appeal\nnor complain nor write about anything; only meet all questions herself,\nreceive all moneys from his solicitor, take the whole thing over and let\nhim alone. She promised to do this, and she mentioned to me that when,\nfor a moment, disburdened, delighted, he held her hand, thanking her for\nthe sacrifice, she already felt rewarded.\"\n\n\"But was that all her reward?\" one of the ladies asked.\n\n\"She never saw him again.\"\n\n\"Oh!\" said the lady; which, as our friend immediately left us again, was\nthe only other word of importance contributed to the subject till, the\nnext night, by the corner of the hearth, in the best chair, he opened\nthe faded red cover of a thin old-fashioned gilt-edged album. The whole\nthing took indeed more nights than one, but on the first occasion the\nsame lady put another question. \"What is your title?\"\n\n\"I haven't one.\"\n\n\"Oh, _I_ have!\" I said. But Douglas, without heeding me, had begun to\nread with a fine clearness that was like a rendering to the ear of the\nbeauty of his author's hand.\n\n\n\n\nI\n\n\nI remember the whole beginning as a succession of flights and drops, a\nlittle seesaw of the right throbs and the wrong. After rising, in town,\nto meet his appeal, I had at all events a couple of very bad days--found\nmyself doubtful again, felt indeed sure I had made a mistake. In this\nstate of mind I spent the long hours of bumping, swinging coach that\ncarried me to the stopping place at which I was to be met by a vehicle\nfrom the house. This convenience, I was told, had been ordered, and\nI found, toward the close of the June afternoon, a commodious fly in\nwaiting for me. Driving at that hour, on a lovely day, through a country\nto which the summer sweetness seemed to offer me a friendly welcome, my\nfortitude mounted afresh and, as we turned into the avenue, encountered\na reprieve that was probably but a proof of the point to which it had\nsunk. I suppose I had expected, or had dreaded, something so melancholy\nthat what greeted me was a good surprise. I remember as a most pleasant\nimpression the broad, clear front, its open windows and fresh curtains\nand the pair of maids looking out; I remember the lawn and the bright\nflowers and the crunch of my wheels on the gravel and the clustered\ntreetops over which the rooks circled and cawed in the golden sky. The\nscene had a greatness that made it a different affair from my own scant\nhome, and there immediately appeared at the door, with a little girl in\nher hand, a civil person who dropped me as decent a curtsy as if I had\nbeen the mistress or a distinguished visitor. I had received in Harley\nStreet a narrower notion of the place, and that, as I recalled it, made\nme think the proprietor still more of a gentleman, suggested that what I\nwas to enjoy might be something beyond his promise.\n\nI had no drop again till the next day, for I was carried triumphantly\nthrough the following hours by my introduction to the younger of my\npupils. The little girl who accompanied Mrs. Grose appeared to me on the\nspot a creature so charming as to make it a great fortune to have to\ndo with her. She was the most beautiful child I had ever seen, and I\nafterward wondered that my employer had not told me more of her. I slept\nlittle that night--I was too much excited; and this astonished me, too,\nI recollect, remained with me, adding to my sense of the liberality with\nwhich I was treated. The large, impressive room, one of the best in\nthe house, the great state bed, as I almost felt it, the full, figured\ndraperies, the long glasses in which, for the first time, I could see\nmyself from head to foot, all struck me--like the extraordinary charm of\nmy small charge--as so many things thrown in. It was thrown in as\nwell, from the first moment, that I should get on with Mrs. Grose in\na relation over which, on my way, in the coach, I fear I had rather\nbrooded. The only thing indeed that in this early outlook might have\nmade me shrink again was the clear circumstance of her being so glad\nto see me. I perceived within half an hour that she was so glad--stout,\nsimple, plain, clean, wholesome woman--as to be positively on her guard\nagainst showing it too much. I wondered even then a little why she\nshould wish not to show it, and that, with reflection, with suspicion,\nmight of course have made me uneasy.\n\nBut it was a comfort that there could be no uneasiness in a connection\nwith anything so beatific as the radiant image of my little girl, the\nvision of whose angelic beauty had probably more than anything else to\ndo with the restlessness that, before morning, made me several times\nrise and wander about my room to take in the whole picture and prospect;\nto watch, from my open window, the faint summer dawn, to look at such\nportions of the rest of the house as I could catch, and to listen,\nwhile, in the fading dusk, the first birds began to twitter, for the\npossible recurrence of a sound or two, less natural and not without,\nbut within, that I had fancied I heard. There had been a moment when I\nbelieved I recognized, faint and far, the cry of a child; there had been\nanother when I found myself just consciously starting as at the passage,\nbefore my door, of a light footstep. But these fancies were not marked\nenough not to be thrown off, and it is only in the light, or the gloom,\nI should rather say, of other and subsequent matters that they now come\nback to me. To watch, teach, \"form\" little Flora would too evidently\nbe the making of a happy and useful life. It had been agreed between us\ndownstairs that after this first occasion I should have her as a matter\nof course at night, her small white bed being already arranged, to that\nend, in my room. What I had undertaken was the whole care of her, and\nshe had remained, just this last time, with Mrs. Grose only as an effect\nof our consideration for my inevitable strangeness and her natural\ntimidity. In spite of this timidity--which the child herself, in the\noddest way in the world, had been perfectly frank and brave about,\nallowing it, without a sign of uncomfortable consciousness, with the\ndeep, sweet serenity indeed of one of Raphael's holy infants, to be\ndiscussed, to be imputed to her, and to determine us--I feel quite sure\nshe would presently like me. It was part of what I already liked Mrs.\nGrose herself for, the pleasure I could see her feel in my admiration\nand wonder as I sat at supper with four tall candles and with my pupil,\nin a high chair and a bib, brightly facing me, between them, over bread\nand milk. There were naturally things that in Flora's presence could\npass between us only as prodigious and gratified looks, obscure and\nroundabout allusions.\n\n\"And the little boy--does he look like her? Is he too so very\nremarkable?\"\n\nOne wouldn't flatter a child. \"Oh, miss, MOST remarkable. If you think\nwell of this one!\"--and she stood there with a plate in her hand,\nbeaming at our companion, who looked from one of us to the other with\nplacid heavenly eyes that contained nothing to check us.\n\n\"Yes; if I do--?\"\n\n\"You WILL be carried away by the little gentleman!\"\n\n\"Well, that, I think, is what I came for--to be carried away. I'm\nafraid, however,\" I remember feeling the impulse to add, \"I'm rather\neasily carried away. I was carried away in London!\"\n\nI can still see Mrs. Grose's broad face as she took this in. \"In Harley\nStreet?\"\n\n\"In Harley Street.\"\n\n\"Well, miss, you're not the first--and you won't be the last.\"\n\n\"Oh, I've no pretension,\" I could laugh, \"to being the only one. My\nother pupil, at any rate, as I understand, comes back tomorrow?\"\n\n\"Not tomorrow--Friday, miss. He arrives, as you did, by the coach, under\ncare of the guard, and is to be met by the same carriage.\"\n\nI forthwith expressed that the proper as well as the pleasant and\nfriendly thing would be therefore that on the arrival of the public\nconveyance I should be in waiting for him with his little sister; an\nidea in which Mrs. Grose concurred so heartily that I somehow took\nher manner as a kind of comforting pledge--never falsified, thank\nheaven!--that we should on every question be quite at one. Oh, she was\nglad I was there!\n\nWhat I felt the next day was, I suppose, nothing that could be fairly\ncalled a reaction from the cheer of my arrival; it was probably at the\nmost only a slight oppression produced by a fuller measure of the\nscale, as I walked round them, gazed up at them, took them in, of my new\ncircumstances. They had, as it were, an extent and mass for which I had\nnot been prepared and in the presence of which I found myself, freshly,\na little scared as well as a little proud. Lessons, in this agitation,\ncertainly suffered some delay; I reflected that my first duty was, by\nthe gentlest arts I could contrive, to win the child into the sense of\nknowing me. I spent the day with her out-of-doors; I arranged with her,\nto her great satisfaction, that it should be she, she only, who might\nshow me the place. She showed it step by step and room by room and\nsecret by secret, with droll, delightful, childish talk about it and\nwith the result, in half an hour, of our becoming immense friends.\nYoung as she was, I was struck, throughout our little tour, with\nher confidence and courage with the way, in empty chambers and dull\ncorridors, on crooked staircases that made me pause and even on the\nsummit of an old machicolated square tower that made me dizzy, her\nmorning music, her disposition to tell me so many more things than she\nasked, rang out and led me on. I have not seen Bly since the day I left\nit, and I daresay that to my older and more informed eyes it would now\nappear sufficiently contracted. But as my little conductress, with her\nhair of gold and her frock of blue, danced before me round corners and\npattered down passages, I had the view of a castle of romance inhabited\nby a rosy sprite, such a place as would somehow, for diversion of the\nyoung idea, take all color out of storybooks and fairytales. Wasn't it\njust a storybook over which I had fallen adoze and adream? No; it was a\nbig, ugly, antique, but convenient house, embodying a few features of\na building still older, half-replaced and half-utilized, in which I had\nthe fancy of our being almost as lost as a handful of passengers in a\ngreat drifting ship. Well, I was, strangely, at the helm!\n\n\n\n\nII\n\n\nThis came home to me when, two days later, I drove over with Flora to\nmeet, as Mrs. Grose said, the little gentleman; and all the more for\nan incident that, presenting itself the second evening, had deeply\ndisconcerted me. The first day had been, on the whole, as I have\nexpressed, reassuring; but I was to see it wind up in keen apprehension.\nThe postbag, that evening--it came late--contained a letter for me,\nwhich, however, in the hand of my employer, I found to be composed but\nof a few words enclosing another, addressed to himself, with a seal\nstill unbroken. \"This, I recognize, is from the headmaster, and the\nheadmaster's an awful bore. Read him, please; deal with him; but mind\nyou don't report. Not a word. I'm off!\" I broke the seal with a great\neffort--so great a one that I was a long time coming to it; took the\nunopened missive at last up to my room and only attacked it just before\ngoing to bed. I had better have let it wait till morning, for it gave me\na second sleepless night. With no counsel to take, the next day, I\nwas full of distress; and it finally got so the better of me that I\ndetermined to open myself at least to Mrs. Grose.\n\n\"What does it mean? The child's dismissed his school.\"\n\nShe gave me a look that I remarked at the moment; then, visibly, with a\nquick blankness, seemed to try to take it back. \"But aren't they all--?\"\n\n\"Sent home--yes. But only for the holidays. Miles may never go back at\nall.\"\n\nConsciously, under my attention, she reddened. \"They won't take him?\"\n\n\"They absolutely decline.\"\n\nAt this she raised her eyes, which she had turned from me; I saw them\nfill with good tears. \"What has he done?\"\n\nI hesitated; then I judged best simply to hand her my letter--which,\nhowever, had the effect of making her, without taking it, simply put her\nhands behind her. She shook her head sadly. \"Such things are not for me,\nmiss.\"\n\nMy counselor couldn't read! I winced at my mistake, which I attenuated\nas I could, and opened my letter again to repeat it to her; then,\nfaltering in the act and folding it up once more, I put it back in my\npocket. \"Is he really BAD?\"\n\nThe tears were still in her eyes. \"Do the gentlemen say so?\"\n\n\"They go into no particulars. They simply express their regret that it\nshould be impossible to keep him. That can have only one meaning.\"\nMrs. Grose listened with dumb emotion; she forbore to ask me what\nthis meaning might be; so that, presently, to put the thing with some\ncoherence and with the mere aid of her presence to my own mind, I went\non: \"That he's an injury to the others.\"\n\nAt this, with one of the quick turns of simple folk, she suddenly flamed\nup. \"Master Miles! HIM an injury?\"\n\nThere was such a flood of good faith in it that, though I had not yet\nseen the child, my very fears made me jump to the absurdity of the idea.\nI found myself, to meet my friend the better, offering it, on the spot,\nsarcastically. \"To his poor little innocent mates!\"\n\n\"It's too dreadful,\" cried Mrs. Grose, \"to say such cruel things! Why,\nhe's scarce ten years old.\"\n\n\"Yes, yes; it would be incredible.\"\n\nShe was evidently grateful for such a profession. \"See him, miss, first.\nTHEN believe it!\" I felt forthwith a new impatience to see him; it was\nthe beginning of a curiosity that, for all the next hours, was to deepen\nalmost to pain. Mrs. Grose was aware, I could judge, of what she had\nproduced in me, and she followed it up with assurance. \"You might as\nwell believe it of the little lady. Bless her,\" she added the next\nmoment--\"LOOK at her!\"\n\nI turned and saw that Flora, whom, ten minutes before, I had established\nin the schoolroom with a sheet of white paper, a pencil, and a copy of\nnice \"round o's,\" now presented herself to view at the open door.\nShe expressed in her little way an extraordinary detachment from\ndisagreeable duties, looking to me, however, with a great childish\nlight that seemed to offer it as a mere result of the affection she had\nconceived for my person, which had rendered necessary that she should\nfollow me. I needed nothing more than this to feel the full force of\nMrs. Grose's comparison, and, catching my pupil in my arms, covered her\nwith kisses in which there was a sob of atonement.\n\nNonetheless, the rest of the day I watched for further occasion to\napproach my colleague, especially as, toward evening, I began to fancy\nshe rather sought to avoid me. I overtook her, I remember, on the\nstaircase; we went down together, and at the bottom I detained her,\nholding her there with a hand on her arm. \"I take what you said to me at\nnoon as a declaration that YOU'VE never known him to be bad.\"\n\nShe threw back her head; she had clearly, by this time, and very\nhonestly, adopted an attitude. \"Oh, never known him--I don't pretend\nTHAT!\"\n\nI was upset again. \"Then you HAVE known him--?\"\n\n\"Yes indeed, miss, thank God!\"\n\nOn reflection I accepted this. \"You mean that a boy who never is--?\"\n\n\"Is no boy for ME!\"\n\nI held her tighter. \"You like them with the spirit to be naughty?\" Then,\nkeeping pace with her answer, \"So do I!\" I eagerly brought out. \"But not\nto the degree to contaminate--\"\n\n\"To contaminate?\"--my big word left her at a loss. I explained it. \"To\ncorrupt.\"\n\nShe stared, taking my meaning in; but it produced in her an odd laugh.\n\"Are you afraid he'll corrupt YOU?\" She put the question with such a\nfine bold humor that, with a laugh, a little silly doubtless, to match\nher own, I gave way for the time to the apprehension of ridicule.\n\nBut the next day, as the hour for my drive approached, I cropped up in\nanother place. \"What was the lady who was here before?\"\n\n\"The last governess? She was also young and pretty--almost as young and\nalmost as pretty, miss, even as you.\"\n\n\"Ah, then, I hope her youth and her beauty helped her!\" I recollect\nthrowing off. \"He seems to like us young and pretty!\"\n\n\"Oh, he DID,\" Mrs. Grose assented: \"it was the way he liked everyone!\"\nShe had no sooner spoken indeed than she caught herself up. \"I mean\nthat's HIS way--the master's.\"\n\nI was struck. \"But of whom did you speak first?\"\n\nShe looked blank, but she colored. \"Why, of HIM.\"\n\n\"Of the master?\"\n\n\"Of who else?\"\n\nThere was so obviously no one else that the next moment I had lost my\nimpression of her having accidentally said more than she meant; and I\nmerely asked what I wanted to know. \"Did SHE see anything in the boy--?\"\n\n\"That wasn't right? She never told me.\"\n\nI had a scruple, but I overcame it. \"Was she careful--particular?\"\n\nMrs. Grose appeared to try to be conscientious. \"About some\nthings--yes.\"\n\n\"But not about all?\"\n\nAgain she considered. \"Well, miss--she's gone. I won't tell tales.\"\n\n\"I quite understand your feeling,\" I hastened to reply; but I thought\nit, after an instant, not opposed to this concession to pursue: \"Did she\ndie here?\"\n\n\"No--she went off.\"\n\nI don't know what there was in this brevity of Mrs. Grose's that struck\nme as ambiguous. \"Went off to die?\" Mrs. Grose looked straight out of\nthe window, but I felt that, hypothetically, I had a right to know what\nyoung persons engaged for Bly were expected to do. \"She was taken ill,\nyou mean, and went home?\"\n\n\"She was not taken ill, so far as appeared, in this house. She left it,\nat the end of the year, to go home, as she said, for a short holiday,\nto which the time she had put in had certainly given her a right. We\nhad then a young woman--a nursemaid who had stayed on and who was a good\ngirl and clever; and SHE took the children altogether for the interval.\nBut our young lady never came back, and at the very moment I was\nexpecting her I heard from the master that she was dead.\"\n\nI turned this over. \"But of what?\"\n\n\"He never told me! But please, miss,\" said Mrs. Grose, \"I must get to my\nwork.\"\n\n\n\n\nIII\n\n\nHer thus turning her back on me was fortunately not, for my just\npreoccupations, a snub that could check the growth of our mutual esteem.\nWe met, after I had brought home little Miles, more intimately than ever\non the ground of my stupefaction, my general emotion: so monstrous was I\nthen ready to pronounce it that such a child as had now been revealed to\nme should be under an interdict. I was a little late on the scene, and\nI felt, as he stood wistfully looking out for me before the door of the\ninn at which the coach had put him down, that I had seen him, on the\ninstant, without and within, in the great glow of freshness, the same\npositive fragrance of purity, in which I had, from the first moment,\nseen his little sister. He was incredibly beautiful, and Mrs. Grose had\nput her finger on it: everything but a sort of passion of tenderness for\nhim was swept away by his presence. What I then and there took him to\nmy heart for was something divine that I have never found to the same\ndegree in any child--his indescribable little air of knowing nothing in\nthe world but love. It would have been impossible to carry a bad name\nwith a greater sweetness of innocence, and by the time I had got back to\nBly with him I remained merely bewildered--so far, that is, as I was not\noutraged--by the sense of the horrible letter locked up in my room, in\na drawer. As soon as I could compass a private word with Mrs. Grose I\ndeclared to her that it was grotesque.\n\nShe promptly understood me. \"You mean the cruel charge--?\"\n\n\"It doesn't live an instant. My dear woman, LOOK at him!\"\n\nShe smiled at my pretention to have discovered his charm. \"I assure\nyou, miss, I do nothing else! What will you say, then?\" she immediately\nadded.\n\n\"In answer to the letter?\" I had made up my mind. \"Nothing.\"\n\n\"And to his uncle?\"\n\nI was incisive. \"Nothing.\"\n\n\"And to the boy himself?\"\n\nI was wonderful. \"Nothing.\"\n\nShe gave with her apron a great wipe to her mouth. \"Then I'll stand by\nyou. We'll see it out.\"\n\n\"We'll see it out!\" I ardently echoed, giving her my hand to make it a\nvow.\n\nShe held me there a moment, then whisked up her apron again with her\ndetached hand. \"Would you mind, miss, if I used the freedom--\"\n\n\"To kiss me? No!\" I took the good creature in my arms and, after we had\nembraced like sisters, felt still more fortified and indignant.\n\nThis, at all events, was for the time: a time so full that, as I recall\nthe way it went, it reminds me of all the art I now need to make it a\nlittle distinct. What I look back at with amazement is the situation I\naccepted. I had undertaken, with my companion, to see it out, and I was\nunder a charm, apparently, that could smooth away the extent and the\nfar and difficult connections of such an effort. I was lifted aloft on a\ngreat wave of infatuation and pity. I found it simple, in my ignorance,\nmy confusion, and perhaps my conceit, to assume that I could deal with\na boy whose education for the world was all on the point of beginning.\nI am unable even to remember at this day what proposal I framed for the\nend of his holidays and the resumption of his studies. Lessons with me,\nindeed, that charming summer, we all had a theory that he was to have;\nbut I now feel that, for weeks, the lessons must have been rather my\nown. I learned something--at first, certainly--that had not been one\nof the teachings of my small, smothered life; learned to be amused, and\neven amusing, and not to think for the morrow. It was the first time, in\na manner, that I had known space and air and freedom, all the music\nof summer and all the mystery of nature. And then there was\nconsideration--and consideration was sweet. Oh, it was a trap--not\ndesigned, but deep--to my imagination, to my delicacy, perhaps to my\nvanity; to whatever, in me, was most excitable. The best way to picture\nit all is to say that I was off my guard. They gave me so little\ntrouble--they were of a gentleness so extraordinary. I used to\nspeculate--but even this with a dim disconnectedness--as to how the\nrough future (for all futures are rough!) would handle them and might\nbruise them. They had the bloom of health and happiness; and yet, as\nif I had been in charge of a pair of little grandees, of princes of the\nblood, for whom everything, to be right, would have to be enclosed and\nprotected, the only form that, in my fancy, the afteryears could take\nfor them was that of a romantic, a really royal extension of the garden\nand the park. It may be, of course, above all, that what suddenly broke\ninto this gives the previous time a charm of stillness--that hush in\nwhich something gathers or crouches. The change was actually like the\nspring of a beast.\n\nIn the first weeks the days were long; they often, at their finest,\ngave me what I used to call my own hour, the hour when, for my pupils,\nteatime and bedtime having come and gone, I had, before my final\nretirement, a small interval alone. Much as I liked my companions, this\nhour was the thing in the day I liked most; and I liked it best of all\nwhen, as the light faded--or rather, I should say, the day lingered and\nthe last calls of the last birds sounded, in a flushed sky, from the\nold trees--I could take a turn into the grounds and enjoy, almost with\na sense of property that amused and flattered me, the beauty and dignity\nof the place. It was a pleasure at these moments to feel myself\ntranquil and justified; doubtless, perhaps, also to reflect that by my\ndiscretion, my quiet good sense and general high propriety, I was giving\npleasure--if he ever thought of it!--to the person to whose pressure\nI had responded. What I was doing was what he had earnestly hoped and\ndirectly asked of me, and that I COULD, after all, do it proved even a\ngreater joy than I had expected. I daresay I fancied myself, in short,\na remarkable young woman and took comfort in the faith that this would\nmore publicly appear. Well, I needed to be remarkable to offer a front\nto the remarkable things that presently gave their first sign.\n\nIt was plump, one afternoon, in the middle of my very hour: the children\nwere tucked away, and I had come out for my stroll. One of the thoughts\nthat, as I don't in the least shrink now from noting, used to be with me\nin these wanderings was that it would be as charming as a charming story\nsuddenly to meet someone. Someone would appear there at the turn of a\npath and would stand before me and smile and approve. I didn't ask more\nthan that--I only asked that he should KNOW; and the only way to be sure\nhe knew would be to see it, and the kind light of it, in his handsome\nface. That was exactly present to me--by which I mean the face\nwas--when, on the first of these occasions, at the end of a long June\nday, I stopped short on emerging from one of the plantations and coming\ninto view of the house. What arrested me on the spot--and with a shock\nmuch greater than any vision had allowed for--was the sense that my\nimagination had, in a flash, turned real. He did stand there!--but high\nup, beyond the lawn and at the very top of the tower to which, on that\nfirst morning, little Flora had conducted me. This tower was one of\na pair--square, incongruous, crenelated structures--that were\ndistinguished, for some reason, though I could see little difference,\nas the new and the old. They flanked opposite ends of the house and were\nprobably architectural absurdities, redeemed in a measure indeed by\nnot being wholly disengaged nor of a height too pretentious, dating, in\ntheir gingerbread antiquity, from a romantic revival that was already a\nrespectable past. I admired them, had fancies about them, for we could\nall profit in a degree, especially when they loomed through the dusk,\nby the grandeur of their actual battlements; yet it was not at such an\nelevation that the figure I had so often invoked seemed most in place.\n\nIt produced in me, this figure, in the clear twilight, I remember, two\ndistinct gasps of emotion, which were, sharply, the shock of my first\nand that of my second surprise. My second was a violent perception of\nthe mistake of my first: the man who met my eyes was not the person\nI had precipitately supposed. There came to me thus a bewilderment of\nvision of which, after these years, there is no living view that I can\nhope to give. An unknown man in a lonely place is a permitted object\nof fear to a young woman privately bred; and the figure that faced me\nwas--a few more seconds assured me--as little anyone else I knew as\nit was the image that had been in my mind. I had not seen it in\nHarley Street--I had not seen it anywhere. The place, moreover, in the\nstrangest way in the world, had, on the instant, and by the very fact of\nits appearance, become a solitude. To me at least, making my statement\nhere with a deliberation with which I have never made it, the whole\nfeeling of the moment returns. It was as if, while I took in--what I did\ntake in--all the rest of the scene had been stricken with death. I can\nhear again, as I write, the intense hush in which the sounds of evening\ndropped. The rooks stopped cawing in the golden sky, and the friendly\nhour lost, for the minute, all its voice. But there was no other change\nin nature, unless indeed it were a change that I saw with a stranger\nsharpness. The gold was still in the sky, the clearness in the air,\nand the man who looked at me over the battlements was as definite as a\npicture in a frame. That's how I thought, with extraordinary quickness,\nof each person that he might have been and that he was not. We were\nconfronted across our distance quite long enough for me to ask myself\nwith intensity who then he was and to feel, as an effect of my inability\nto say, a wonder that in a few instants more became intense.\n\nThe great question, or one of these, is, afterward, I know, with regard\nto certain matters, the question of how long they have lasted. Well,\nthis matter of mine, think what you will of it, lasted while I caught at\na dozen possibilities, none of which made a difference for the better,\nthat I could see, in there having been in the house--and for how long,\nabove all?--a person of whom I was in ignorance. It lasted while I\njust bridled a little with the sense that my office demanded that there\nshould be no such ignorance and no such person. It lasted while this\nvisitant, at all events--and there was a touch of the strange freedom,\nas I remember, in the sign of familiarity of his wearing no hat--seemed\nto fix me, from his position, with just the question, just the scrutiny\nthrough the fading light, that his own presence provoked. We were too\nfar apart to call to each other, but there was a moment at which, at\nshorter range, some challenge between us, breaking the hush, would have\nbeen the right result of our straight mutual stare. He was in one of the\nangles, the one away from the house, very erect, as it struck me, and\nwith both hands on the ledge. So I saw him as I see the letters I\nform on this page; then, exactly, after a minute, as if to add to the\nspectacle, he slowly changed his place--passed, looking at me hard\nall the while, to the opposite corner of the platform. Yes, I had the\nsharpest sense that during this transit he never took his eyes from me,\nand I can see at this moment the way his hand, as he went, passed from\none of the crenelations to the next. He stopped at the other corner, but\nless long, and even as he turned away still markedly fixed me. He turned\naway; that was all I knew.\n\n\n\n\nIV\n\n\nIt was not that I didn't wait, on this occasion, for more, for I was\nrooted as deeply as I was shaken. Was there a \"secret\" at Bly--a mystery\nof Udolpho or an insane, an unmentionable relative kept in unsuspected\nconfinement? I can't say how long I turned it over, or how long, in\na confusion of curiosity and dread, I remained where I had had my\ncollision; I only recall that when I re-entered the house darkness had\nquite closed in. Agitation, in the interval, certainly had held me and\ndriven me, for I must, in circling about the place, have walked three\nmiles; but I was to be, later on, so much more overwhelmed that this\nmere dawn of alarm was a comparatively human chill. The most singular\npart of it, in fact--singular as the rest had been--was the part I\nbecame, in the hall, aware of in meeting Mrs. Grose. This picture comes\nback to me in the general train--the impression, as I received it on my\nreturn, of the wide white panelled space, bright in the lamplight and\nwith its portraits and red carpet, and of the good surprised look of\nmy friend, which immediately told me she had missed me. It came to\nme straightway, under her contact, that, with plain heartiness, mere\nrelieved anxiety at my appearance, she knew nothing whatever that could\nbear upon the incident I had there ready for her. I had not suspected\nin advance that her comfortable face would pull me up, and I somehow\nmeasured the importance of what I had seen by my thus finding myself\nhesitate to mention it. Scarce anything in the whole history seems to\nme so odd as this fact that my real beginning of fear was one, as I\nmay say, with the instinct of sparing my companion. On the spot,\naccordingly, in the pleasant hall and with her eyes on me, I, for\na reason that I couldn't then have phrased, achieved an inward\nresolution--offered a vague pretext for my lateness and, with the plea\nof the beauty of the night and of the heavy dew and wet feet, went as\nsoon as possible to my room.\n\nHere it was another affair; here, for many days after, it was a queer\naffair enough. There were hours, from day to day--or at least there were\nmoments, snatched even from clear duties--when I had to shut myself up\nto think. It was not so much yet that I was more nervous than I could\nbear to be as that I was remarkably afraid of becoming so; for the truth\nI had now to turn over was, simply and clearly, the truth that I could\narrive at no account whatever of the visitor with whom I had been so\ninexplicably and yet, as it seemed to me, so intimately concerned. It\ntook little time to see that I could sound without forms of inquiry\nand without exciting remark any domestic complications. The shock I had\nsuffered must have sharpened all my senses; I felt sure, at the end of\nthree days and as the result of mere closer attention, that I had not\nbeen practiced upon by the servants nor made the object of any \"game.\"\nOf whatever it was that I knew, nothing was known around me. There was\nbut one sane inference: someone had taken a liberty rather gross. That\nwas what, repeatedly, I dipped into my room and locked the door to say\nto myself. We had been, collectively, subject to an intrusion; some\nunscrupulous traveler, curious in old houses, had made his way in\nunobserved, enjoyed the prospect from the best point of view, and then\nstolen out as he came. If he had given me such a bold hard stare, that\nwas but a part of his indiscretion. The good thing, after all, was that\nwe should surely see no more of him.\n\nThis was not so good a thing, I admit, as not to leave me to judge that\nwhat, essentially, made nothing else much signify was simply my charming\nwork. My charming work was just my life with Miles and Flora, and\nthrough nothing could I so like it as through feeling that I could throw\nmyself into it in trouble. The attraction of my small charges was a\nconstant joy, leading me to wonder afresh at the vanity of my original\nfears, the distaste I had begun by entertaining for the probable gray\nprose of my office. There was to be no gray prose, it appeared, and no\nlong grind; so how could work not be charming that presented itself as\ndaily beauty? It was all the romance of the nursery and the poetry of\nthe schoolroom. I don't mean by this, of course, that we studied\nonly fiction and verse; I mean I can express no otherwise the sort\nof interest my companions inspired. How can I describe that except by\nsaying that instead of growing used to them--and it's a marvel for a\ngoverness: I call the sisterhood to witness!--I made constant fresh\ndiscoveries. There was one direction, assuredly, in which these\ndiscoveries stopped: deep obscurity continued to cover the region of the\nboy's conduct at school. It had been promptly given me, I have noted,\nto face that mystery without a pang. Perhaps even it would be nearer the\ntruth to say that--without a word--he himself had cleared it up. He had\nmade the whole charge absurd. My conclusion bloomed there with the\nreal rose flush of his innocence: he was only too fine and fair for the\nlittle horrid, unclean school world, and he had paid a price for it. I\nreflected acutely that the sense of such differences, such superiorities\nof quality, always, on the part of the majority--which could include\neven stupid, sordid headmasters--turn infallibly to the vindictive.\n\nBoth the children had a gentleness (it was their only fault, and it\nnever made Miles a muff) that kept them--how shall I express it?--almost\nimpersonal and certainly quite unpunishable. They were like the cherubs\nof the anecdote, who had--morally, at any rate--nothing to whack! I\nremember feeling with Miles in especial as if he had had, as it were, no\nhistory. We expect of a small child a scant one, but there was in\nthis beautiful little boy something extraordinarily sensitive, yet\nextraordinarily happy, that, more than in any creature of his age I have\nseen, struck me as beginning anew each day. He had never for a second\nsuffered. I took this as a direct disproof of his having really been\nchastised. If he had been wicked he would have \"caught\" it, and I should\nhave caught it by the rebound--I should have found the trace. I found\nnothing at all, and he was therefore an angel. He never spoke of his\nschool, never mentioned a comrade or a master; and I, for my part, was\nquite too much disgusted to allude to them. Of course I was under the\nspell, and the wonderful part is that, even at the time, I perfectly\nknew I was. But I gave myself up to it; it was an antidote to any\npain, and I had more pains than one. I was in receipt in these days of\ndisturbing letters from home, where things were not going well. But with\nmy children, what things in the world mattered? That was the question\nI used to put to my scrappy retirements. I was dazzled by their\nloveliness.\n\nThere was a Sunday--to get on--when it rained with such force and for so\nmany hours that there could be no procession to church; in consequence\nof which, as the day declined, I had arranged with Mrs. Grose that,\nshould the evening show improvement, we would attend together the late\nservice. The rain happily stopped, and I prepared for our walk, which,\nthrough the park and by the good road to the village, would be a matter\nof twenty minutes. Coming downstairs to meet my colleague in the hall,\nI remembered a pair of gloves that had required three stitches and that\nhad received them--with a publicity perhaps not edifying--while I sat\nwith the children at their tea, served on Sundays, by exception, in that\ncold, clean temple of mahogany and brass, the \"grown-up\" dining room.\nThe gloves had been dropped there, and I turned in to recover them.\nThe day was gray enough, but the afternoon light still lingered, and it\nenabled me, on crossing the threshold, not only to recognize, on a chair\nnear the wide window, then closed, the articles I wanted, but to become\naware of a person on the other side of the window and looking straight\nin. One step into the room had sufficed; my vision was instantaneous;\nit was all there. The person looking straight in was the person who had\nalready appeared to me. He appeared thus again with I won't say\ngreater distinctness, for that was impossible, but with a nearness that\nrepresented a forward stride in our intercourse and made me, as I met\nhim, catch my breath and turn cold. He was the same--he was the same,\nand seen, this time, as he had been seen before, from the waist up, the\nwindow, though the dining room was on the ground floor, not going down\nto the terrace on which he stood. His face was close to the glass,\nyet the effect of this better view was, strangely, only to show me how\nintense the former had been. He remained but a few seconds--long enough\nto convince me he also saw and recognized; but it was as if I had been\nlooking at him for years and had known him always. Something, however,\nhappened this time that had not happened before; his stare into my face,\nthrough the glass and across the room, was as deep and hard as then, but\nit quitted me for a moment during which I could still watch it, see it\nfix successively several other things. On the spot there came to me the\nadded shock of a certitude that it was not for me he had come there. He\nhad come for someone else.\n\nThe flash of this knowledge--for it was knowledge in the midst of\ndread--produced in me the most extraordinary effect, started as I stood\nthere, a sudden vibration of duty and courage. I say courage because\nI was beyond all doubt already far gone. I bounded straight out of the\ndoor again, reached that of the house, got, in an instant, upon the\ndrive, and, passing along the terrace as fast as I could rush, turned\na corner and came full in sight. But it was in sight of nothing now--my\nvisitor had vanished. I stopped, I almost dropped, with the real relief\nof this; but I took in the whole scene--I gave him time to reappear. I\ncall it time, but how long was it? I can't speak to the purpose today\nof the duration of these things. That kind of measure must have left me:\nthey couldn't have lasted as they actually appeared to me to last. The\nterrace and the whole place, the lawn and the garden beyond it, all I\ncould see of the park, were empty with a great emptiness. There were\nshrubberies and big trees, but I remember the clear assurance I felt\nthat none of them concealed him. He was there or was not there: not\nthere if I didn't see him. I got hold of this; then, instinctively,\ninstead of returning as I had come, went to the window. It was\nconfusedly present to me that I ought to place myself where he had\nstood. I did so; I applied my face to the pane and looked, as he had\nlooked, into the room. As if, at this moment, to show me exactly what\nhis range had been, Mrs. Grose, as I had done for himself just before,\ncame in from the hall. With this I had the full image of a repetition of\nwhat had already occurred. She saw me as I had seen my own visitant; she\npulled up short as I had done; I gave her something of the shock that\nI had received. She turned white, and this made me ask myself if I had\nblanched as much. She stared, in short, and retreated on just MY lines,\nand I knew she had then passed out and come round to me and that I\nshould presently meet her. I remained where I was, and while I waited\nI thought of more things than one. But there's only one I take space to\nmention. I wondered why SHE should be scared.\n\n\n\n\nV\n\n\nOh, she let me know as soon as, round the corner of the house, she\nloomed again into view. \"What in the name of goodness is the matter--?\"\nShe was now flushed and out of breath.\n\nI said nothing till she came quite near. \"With me?\" I must have made a\nwonderful face. \"Do I show it?\"\n\n\"You're as white as a sheet. You look awful.\"\n\nI considered; I could meet on this, without scruple, any innocence. My\nneed to respect the bloom of Mrs. Grose's had dropped, without a rustle,\nfrom my shoulders, and if I wavered for the instant it was not with what\nI kept back. I put out my hand to her and she took it; I held her hard\na little, liking to feel her close to me. There was a kind of support in\nthe shy heave of her surprise. \"You came for me for church, of course,\nbut I can't go.\"\n\n\"Has anything happened?\"\n\n\"Yes. You must know now. Did I look very queer?\"\n\n\"Through this window? Dreadful!\"\n\n\"Well,\" I said, \"I've been frightened.\" Mrs. Grose's eyes expressed\nplainly that SHE had no wish to be, yet also that she knew too well her\nplace not to be ready to share with me any marked inconvenience. Oh,\nit was quite settled that she MUST share! \"Just what you saw from the\ndining room a minute ago was the effect of that. What _I_ saw--just\nbefore--was much worse.\"\n\nHer hand tightened. \"What was it?\"\n\n\"An extraordinary man. Looking in.\"\n\n\"What extraordinary man?\"\n\n\"I haven't the least idea.\"\n\nMrs. Grose gazed round us in vain. \"Then where is he gone?\"\n\n\"I know still less.\"\n\n\"Have you seen him before?\"\n\n\"Yes--once. On the old tower.\"\n\nShe could only look at me harder. \"Do you mean he's a stranger?\"\n\n\"Oh, very much!\"\n\n\"Yet you didn't tell me?\"\n\n\"No--for reasons. But now that you've guessed--\"\n\nMrs. Grose's round eyes encountered this charge. \"Ah, I haven't\nguessed!\" she said very simply. \"How can I if YOU don't imagine?\"\n\n\"I don't in the very least.\"\n\n\"You've seen him nowhere but on the tower?\"\n\n\"And on this spot just now.\"\n\nMrs. Grose looked round again. \"What was he doing on the tower?\"\n\n\"Only standing there and looking down at me.\"\n\nShe thought a minute. \"Was he a gentleman?\"\n\nI found I had no need to think. \"No.\" She gazed in deeper wonder. \"No.\"\n\n\"Then nobody about the place? Nobody from the village?\"\n\n\"Nobody--nobody. I didn't tell you, but I made sure.\"\n\nShe breathed a vague relief: this was, oddly, so much to the good. It\nonly went indeed a little way. \"But if he isn't a gentleman--\"\n\n\"What IS he? He's a horror.\"\n\n\"A horror?\"\n\n\"He's--God help me if I know WHAT he is!\"\n\nMrs. Grose looked round once more; she fixed her eyes on the duskier\ndistance, then, pulling herself together, turned to me with abrupt\ninconsequence. \"It's time we should be at church.\"\n\n\"Oh, I'm not fit for church!\"\n\n\"Won't it do you good?\"\n\n\"It won't do THEM--! I nodded at the house.\n\n\"The children?\"\n\n\"I can't leave them now.\"\n\n\"You're afraid--?\"\n\nI spoke boldly. \"I'm afraid of HIM.\"\n\nMrs. Grose's large face showed me, at this, for the first time, the\nfaraway faint glimmer of a consciousness more acute: I somehow made out\nin it the delayed dawn of an idea I myself had not given her and that\nwas as yet quite obscure to me. It comes back to me that I thought\ninstantly of this as something I could get from her; and I felt it to be\nconnected with the desire she presently showed to know more. \"When was\nit--on the tower?\"\n\n\"About the middle of the month. At this same hour.\"\n\n\"Almost at dark,\" said Mrs. Grose.\n\n\"Oh, no, not nearly. I saw him as I see you.\"\n\n\"Then how did he get in?\"\n\n\"And how did he get out?\" I laughed. \"I had no opportunity to ask him!\nThis evening, you see,\" I pursued, \"he has not been able to get in.\"\n\n\"He only peeps?\"\n\n\"I hope it will be confined to that!\" She had now let go my hand; she\nturned away a little. I waited an instant; then I brought out: \"Go to\nchurch. Goodbye. I must watch.\"\n\nSlowly she faced me again. \"Do you fear for them?\"\n\nWe met in another long look. \"Don't YOU?\" Instead of answering she came\nnearer to the window and, for a minute, applied her face to the glass.\n\"You see how he could see,\" I meanwhile went on.\n\nShe didn't move. \"How long was he here?\"\n\n\"Till I came out. I came to meet him.\"\n\nMrs. Grose at last turned round, and there was still more in her face.\n\"_I_ couldn't have come out.\"\n\n\"Neither could I!\" I laughed again. \"But I did come. I have my duty.\"\n\n\"So have I mine,\" she replied; after which she added: \"What is he like?\"\n\n\"I've been dying to tell you. But he's like nobody.\"\n\n\"Nobody?\" she echoed.\n\n\"He has no hat.\" Then seeing in her face that she already, in this, with\na deeper dismay, found a touch of picture, I quickly added stroke to\nstroke. \"He has red hair, very red, close-curling, and a pale face, long\nin shape, with straight, good features and little, rather queer whiskers\nthat are as red as his hair. His eyebrows are, somehow, darker; they\nlook particularly arched and as if they might move a good deal. His eyes\nare sharp, strange--awfully; but I only know clearly that they're rather\nsmall and very fixed. His mouth's wide, and his lips are thin, and\nexcept for his little whiskers he's quite clean-shaven. He gives me a\nsort of sense of looking like an actor.\"\n\n\"An actor!\" It was impossible to resemble one less, at least, than Mrs.\nGrose at that moment.\n\n\"I've never seen one, but so I suppose them. He's tall, active, erect,\"\nI continued, \"but never--no, never!--a gentleman.\"\n\nMy companion's face had blanched as I went on; her round eyes started\nand her mild mouth gaped. \"A gentleman?\" she gasped, confounded,\nstupefied: \"a gentleman HE?\"\n\n\"You know him then?\"\n\nShe visibly tried to hold herself. \"But he IS handsome?\"\n\nI saw the way to help her. \"Remarkably!\"\n\n\"And dressed--?\"\n\n\"In somebody's clothes.\" \"They're smart, but they're not his own.\"\n\nShe broke into a breathless affirmative groan: \"They're the master's!\"\n\nI caught it up. \"You DO know him?\"\n\nShe faltered but a second. \"Quint!\" she cried.\n\n\"Quint?\"\n\n\"Peter Quint--his own man, his valet, when he was here!\"\n\n\"When the master was?\"\n\nGaping still, but meeting me, she pieced it all together. \"He never wore\nhis hat, but he did wear--well, there were waistcoats missed. They were\nboth here--last year. Then the master went, and Quint was alone.\"\n\nI followed, but halting a little. \"Alone?\"\n\n\"Alone with US.\" Then, as from a deeper depth, \"In charge,\" she added.\n\n\"And what became of him?\"\n\nShe hung fire so long that I was still more mystified. \"He went, too,\"\nshe brought out at last.\n\n\"Went where?\"\n\nHer expression, at this, became extraordinary. \"God knows where! He\ndied.\"\n\n\"Died?\" I almost shrieked.\n\nShe seemed fairly to square herself, plant herself more firmly to utter\nthe wonder of it. \"Yes. Mr. Quint is dead.\"\n\n\n\n\nVI\n\n\nIt took of course more than that particular passage to place us together\nin presence of what we had now to live with as we could--my dreadful\nliability to impressions of the order so vividly exemplified, and my\ncompanion's knowledge, henceforth--a knowledge half consternation and\nhalf compassion--of that liability. There had been, this evening, after\nthe revelation left me, for an hour, so prostrate--there had been, for\neither of us, no attendance on any service but a little service of tears\nand vows, of prayers and promises, a climax to the series of mutual\nchallenges and pledges that had straightway ensued on our retreating\ntogether to the schoolroom and shutting ourselves up there to have\neverything out. The result of our having everything out was simply to\nreduce our situation to the last rigor of its elements. She herself had\nseen nothing, not the shadow of a shadow, and nobody in the house but\nthe governess was in the governess's plight; yet she accepted without\ndirectly impugning my sanity the truth as I gave it to her, and ended by\nshowing me, on this ground, an awestricken tenderness, an expression\nof the sense of my more than questionable privilege, of which the very\nbreath has remained with me as that of the sweetest of human charities.\n\nWhat was settled between us, accordingly, that night, was that we\nthought we might bear things together; and I was not even sure that,\nin spite of her exemption, it was she who had the best of the burden. I\nknew at this hour, I think, as well as I knew later, what I was capable\nof meeting to shelter my pupils; but it took me some time to be wholly\nsure of what my honest ally was prepared for to keep terms with so\ncompromising a contract. I was queer company enough--quite as queer as\nthe company I received; but as I trace over what we went through I see\nhow much common ground we must have found in the one idea that, by good\nfortune, COULD steady us. It was the idea, the second movement, that led\nme straight out, as I may say, of the inner chamber of my dread. I could\ntake the air in the court, at least, and there Mrs. Grose could join me.\nPerfectly can I recall now the particular way strength came to me before\nwe separated for the night. We had gone over and over every feature of\nwhat I had seen.\n\n\"He was looking for someone else, you say--someone who was not you?\"\n\n\"He was looking for little Miles.\" A portentous clearness now possessed\nme. \"THAT'S whom he was looking for.\"\n\n\"But how do you know?\"\n\n\"I know, I know, I know!\" My exaltation grew. \"And YOU know, my dear!\"\n\nShe didn't deny this, but I required, I felt, not even so much telling\nas that. She resumed in a moment, at any rate: \"What if HE should see\nhim?\"\n\n\"Little Miles? That's what he wants!\"\n\nShe looked immensely scared again. \"The child?\"\n\n\"Heaven forbid! The man. He wants to appear to THEM.\" That he might was\nan awful conception, and yet, somehow, I could keep it at bay; which,\nmoreover, as we lingered there, was what I succeeded in practically\nproving. I had an absolute certainty that I should see again what I\nhad already seen, but something within me said that by offering myself\nbravely as the sole subject of such experience, by accepting, by\ninviting, by surmounting it all, I should serve as an expiatory victim\nand guard the tranquility of my companions. The children, in especial,\nI should thus fence about and absolutely save. I recall one of the last\nthings I said that night to Mrs. Grose.\n\n\"It does strike me that my pupils have never mentioned--\"\n\nShe looked at me hard as I musingly pulled up. \"His having been here and\nthe time they were with him?\"\n\n\"The time they were with him, and his name, his presence, his history,\nin any way.\"\n\n\"Oh, the little lady doesn't remember. She never heard or knew.\"\n\n\"The circumstances of his death?\" I thought with some intensity.\n\"Perhaps not. But Miles would remember--Miles would know.\"\n\n\"Ah, don't try him!\" broke from Mrs. Grose.\n\nI returned her the look she had given me. \"Don't be afraid.\" I continued\nto think. \"It IS rather odd.\"\n\n\"That he has never spoken of him?\"\n\n\"Never by the least allusion. And you tell me they were 'great\nfriends'?\"\n\n\"Oh, it wasn't HIM!\" Mrs. Grose with emphasis declared. \"It was Quint's\nown fancy. To play with him, I mean--to spoil him.\" She paused a moment;\nthen she added: \"Quint was much too free.\"\n\nThis gave me, straight from my vision of his face--SUCH a face!--a\nsudden sickness of disgust. \"Too free with MY boy?\"\n\n\"Too free with everyone!\"\n\nI forbore, for the moment, to analyze this description further than by\nthe reflection that a part of it applied to several of the members of\nthe household, of the half-dozen maids and men who were still of our\nsmall colony. But there was everything, for our apprehension, in the\nlucky fact that no discomfortable legend, no perturbation of scullions,\nhad ever, within anyone's memory attached to the kind old place. It had\nneither bad name nor ill fame, and Mrs. Grose, most apparently, only\ndesired to cling to me and to quake in silence. I even put her, the very\nlast thing of all, to the test. It was when, at midnight, she had her\nhand on the schoolroom door to take leave. \"I have it from you then--for\nit's of great importance--that he was definitely and admittedly bad?\"\n\n\"Oh, not admittedly. _I_ knew it--but the master didn't.\"\n\n\"And you never told him?\"\n\n\"Well, he didn't like tale-bearing--he hated complaints. He was terribly\nshort with anything of that kind, and if people were all right to HIM--\"\n\n\"He wouldn't be bothered with more?\" This squared well enough with my\nimpressions of him: he was not a trouble-loving gentleman, nor so very\nparticular perhaps about some of the company HE kept. All the same, I\npressed my interlocutress. \"I promise you _I_ would have told!\"\n\nShe felt my discrimination. \"I daresay I was wrong. But, really, I was\nafraid.\"\n\n\"Afraid of what?\"\n\n\"Of things that man could do. Quint was so clever--he was so deep.\"\n\nI took this in still more than, probably, I showed. \"You weren't afraid\nof anything else? Not of his effect--?\"\n\n\"His effect?\" she repeated with a face of anguish and waiting while I\nfaltered.\n\n\"On innocent little precious lives. They were in your charge.\"\n\n\"No, they were not in mine!\" she roundly and distressfully returned.\n\"The master believed in him and placed him here because he was supposed\nnot to be well and the country air so good for him. So he had everything\nto say. Yes\"--she let me have it--\"even about THEM.\"\n\n\"Them--that creature?\" I had to smother a kind of howl. \"And you could\nbear it!\"\n\n\"No. I couldn't--and I can't now!\" And the poor woman burst into tears.\n\nA rigid control, from the next day, was, as I have said, to follow them;\nyet how often and how passionately, for a week, we came back together\nto the subject! Much as we had discussed it that Sunday night, I was, in\nthe immediate later hours in especial--for it may be imagined whether I\nslept--still haunted with the shadow of something she had not told me.\nI myself had kept back nothing, but there was a word Mrs. Grose had kept\nback. I was sure, moreover, by morning, that this was not from a failure\nof frankness, but because on every side there were fears. It seems to me\nindeed, in retrospect, that by the time the morrow's sun was high I had\nrestlessly read into the fact before us almost all the meaning they were\nto receive from subsequent and more cruel occurrences. What they gave me\nabove all was just the sinister figure of the living man--the dead one\nwould keep awhile!--and of the months he had continuously passed at Bly,\nwhich, added up, made a formidable stretch. The limit of this evil time\nhad arrived only when, on the dawn of a winter's morning, Peter Quint\nwas found, by a laborer going to early work, stone dead on the road\nfrom the village: a catastrophe explained--superficially at least--by a\nvisible wound to his head; such a wound as might have been produced--and\nas, on the final evidence, HAD been--by a fatal slip, in the dark and\nafter leaving the public house, on the steepish icy slope, a wrong\npath altogether, at the bottom of which he lay. The icy slope, the turn\nmistaken at night and in liquor, accounted for much--practically, in\nthe end and after the inquest and boundless chatter, for everything; but\nthere had been matters in his life--strange passages and perils, secret\ndisorders, vices more than suspected--that would have accounted for a\ngood deal more.\n\nI scarce know how to put my story into words that shall be a credible\npicture of my state of mind; but I was in these days literally able to\nfind a joy in the extraordinary flight of heroism the occasion demanded\nof me. I now saw that I had been asked for a service admirable and\ndifficult; and there would be a greatness in letting it be seen--oh, in\nthe right quarter!--that I could succeed where many another girl might\nhave failed. It was an immense help to me--I confess I rather applaud\nmyself as I look back!--that I saw my service so strongly and so simply.\nI was there to protect and defend the little creatures in the world the\nmost bereaved and the most lovable, the appeal of whose helplessness had\nsuddenly become only too explicit, a deep, constant ache of one's own\ncommitted heart. We were cut off, really, together; we were united in\nour danger. They had nothing but me, and I--well, I had THEM. It was\nin short a magnificent chance. This chance presented itself to me in an\nimage richly material. I was a screen--I was to stand before them. The\nmore I saw, the less they would. I began to watch them in a stifled\nsuspense, a disguised excitement that might well, had it continued too\nlong, have turned to something like madness. What saved me, as I now\nsee, was that it turned to something else altogether. It didn't last as\nsuspense--it was superseded by horrible proofs. Proofs, I say, yes--from\nthe moment I really took hold.\n\nThis moment dated from an afternoon hour that I happened to spend in the\ngrounds with the younger of my pupils alone. We had left Miles indoors,\non the red cushion of a deep window seat; he had wished to finish a\nbook, and I had been glad to encourage a purpose so laudable in a young\nman whose only defect was an occasional excess of the restless. His\nsister, on the contrary, had been alert to come out, and I strolled with\nher half an hour, seeking the shade, for the sun was still high and the\nday exceptionally warm. I was aware afresh, with her, as we went, of\nhow, like her brother, she contrived--it was the charming thing in both\nchildren--to let me alone without appearing to drop me and to accompany\nme without appearing to surround. They were never importunate and yet\nnever listless. My attention to them all really went to seeing them\namuse themselves immensely without me: this was a spectacle they seemed\nactively to prepare and that engaged me as an active admirer. I walked\nin a world of their invention--they had no occasion whatever to draw\nupon mine; so that my time was taken only with being, for them, some\nremarkable person or thing that the game of the moment required and that\nwas merely, thanks to my superior, my exalted stamp, a happy and highly\ndistinguished sinecure. I forget what I was on the present occasion;\nI only remember that I was something very important and very quiet and\nthat Flora was playing very hard. We were on the edge of the lake, and,\nas we had lately begun geography, the lake was the Sea of Azof.\n\nSuddenly, in these circumstances, I became aware that, on the other\nside of the Sea of Azof, we had an interested spectator. The way this\nknowledge gathered in me was the strangest thing in the world--the\nstrangest, that is, except the very much stranger in which it quickly\nmerged itself. I had sat down with a piece of work--for I was something\nor other that could sit--on the old stone bench which overlooked the\npond; and in this position I began to take in with certitude, and yet\nwithout direct vision, the presence, at a distance, of a third person.\nThe old trees, the thick shrubbery, made a great and pleasant shade, but\nit was all suffused with the brightness of the hot, still hour. There\nwas no ambiguity in anything; none whatever, at least, in the conviction\nI from one moment to another found myself forming as to what I should\nsee straight before me and across the lake as a consequence of raising\nmy eyes. They were attached at this juncture to the stitching in which I\nwas engaged, and I can feel once more the spasm of my effort not to move\nthem till I should so have steadied myself as to be able to make up my\nmind what to do. There was an alien object in view--a figure whose right\nof presence I instantly, passionately questioned. I recollect counting\nover perfectly the possibilities, reminding myself that nothing was more\nnatural, for instance, then the appearance of one of the men about the\nplace, or even of a messenger, a postman, or a tradesman's boy, from the\nvillage. That reminder had as little effect on my practical certitude\nas I was conscious--still even without looking--of its having upon the\ncharacter and attitude of our visitor. Nothing was more natural than\nthat these things should be the other things that they absolutely were\nnot.\n\nOf the positive identity of the apparition I would assure myself as\nsoon as the small clock of my courage should have ticked out the right\nsecond; meanwhile, with an effort that was already sharp enough, I\ntransferred my eyes straight to little Flora, who, at the moment, was\nabout ten yards away. My heart had stood still for an instant with the\nwonder and terror of the question whether she too would see; and I\nheld my breath while I waited for what a cry from her, what some sudden\ninnocent sign either of interest or of alarm, would tell me. I waited,\nbut nothing came; then, in the first place--and there is something\nmore dire in this, I feel, than in anything I have to relate--I was\ndetermined by a sense that, within a minute, all sounds from her had\npreviously dropped; and, in the second, by the circumstance that, also\nwithin the minute, she had, in her play, turned her back to the water.\nThis was her attitude when I at last looked at her--looked with the\nconfirmed conviction that we were still, together, under direct personal\nnotice. She had picked up a small flat piece of wood, which happened to\nhave in it a little hole that had evidently suggested to her the idea\nof sticking in another fragment that might figure as a mast and make\nthe thing a boat. This second morsel, as I watched her, she was\nvery markedly and intently attempting to tighten in its place. My\napprehension of what she was doing sustained me so that after some\nseconds I felt I was ready for more. Then I again shifted my eyes--I\nfaced what I had to face.\n\n\n\n\nVII\n\n\nI got hold of Mrs. Grose as soon after this as I could; and I can give\nno intelligible account of how I fought out the interval. Yet I still\nhear myself cry as I fairly threw myself into her arms: \"They KNOW--it's\ntoo monstrous: they know, they know!\"\n\n\"And what on earth--?\" I felt her incredulity as she held me.\n\n\"Why, all that WE know--and heaven knows what else besides!\" Then, as\nshe released me, I made it out to her, made it out perhaps only now with\nfull coherency even to myself. \"Two hours ago, in the garden\"--I could\nscarce articulate--\"Flora SAW!\"\n\nMrs. Grose took it as she might have taken a blow in the stomach. \"She\nhas told you?\" she panted.\n\n\"Not a word--that's the horror. She kept it to herself! The child of\neight, THAT child!\" Unutterable still, for me, was the stupefaction of\nit.\n\nMrs. Grose, of course, could only gape the wider. \"Then how do you\nknow?\"\n\n\"I was there--I saw with my eyes: saw that she was perfectly aware.\"\n\n\"Do you mean aware of HIM?\"\n\n\"No--of HER.\" I was conscious as I spoke that I looked prodigious\nthings, for I got the slow reflection of them in my companion's face.\n\"Another person--this time; but a figure of quite as unmistakable horror\nand evil: a woman in black, pale and dreadful--with such an air also,\nand such a face!--on the other side of the lake. I was there with the\nchild--quiet for the hour; and in the midst of it she came.\"\n\n\"Came how--from where?\"\n\n\"From where they come from! She just appeared and stood there--but not\nso near.\"\n\n\"And without coming nearer?\"\n\n\"Oh, for the effect and the feeling, she might have been as close as\nyou!\"\n\nMy friend, with an odd impulse, fell back a step. \"Was she someone\nyou've never seen?\"\n\n\"Yes. But someone the child has. Someone YOU have.\" Then, to show how I\nhad thought it all out: \"My predecessor--the one who died.\"\n\n\"Miss Jessel?\"\n\n\"Miss Jessel. You don't believe me?\" I pressed.\n\nShe turned right and left in her distress. \"How can you be sure?\"\n\nThis drew from me, in the state of my nerves, a flash of impatience.\n\"Then ask Flora--SHE'S sure!\" But I had no sooner spoken than I caught\nmyself up. \"No, for God's sake, DON'T! She'll say she isn't--she'll\nlie!\"\n\nMrs. Grose was not too bewildered instinctively to protest. \"Ah, how CAN\nyou?\"\n\n\"Because I'm clear. Flora doesn't want me to know.\"\n\n\"It's only then to spare you.\"\n\n\"No, no--there are depths, depths! The more I go over it, the more I see\nin it, and the more I see in it, the more I fear. I don't know what I\nDON'T see--what I DON'T fear!\"\n\nMrs. Grose tried to keep up with me. \"You mean you're afraid of seeing\nher again?\"\n\n\"Oh, no; that's nothing--now!\" Then I explained. \"It's of NOT seeing\nher.\"\n\nBut my companion only looked wan. \"I don't understand you.\"\n\n\"Why, it's that the child may keep it up--and that the child assuredly\nWILL--without my knowing it.\"\n\nAt the image of this possibility Mrs. Grose for a moment collapsed, yet\npresently to pull herself together again, as if from the positive force\nof the sense of what, should we yield an inch, there would really be to\ngive way to. \"Dear, dear--we must keep our heads! And after all, if she\ndoesn't mind it--!\" She even tried a grim joke. \"Perhaps she likes it!\"\n\n\"Likes SUCH things--a scrap of an infant!\"\n\n\"Isn't it just a proof of her blessed innocence?\" my friend bravely\ninquired.\n\nShe brought me, for the instant, almost round. \"Oh, we must clutch at\nTHAT--we must cling to it! If it isn't a proof of what you say, it's a\nproof of--God knows what! For the woman's a horror of horrors.\"\n\nMrs. Grose, at this, fixed her eyes a minute on the ground; then at last\nraising them, \"Tell me how you know,\" she said.\n\n\"Then you admit it's what she was?\" I cried.\n\n\"Tell me how you know,\" my friend simply repeated.\n\n\"Know? By seeing her! By the way she looked.\"\n\n\"At you, do you mean--so wickedly?\"\n\n\"Dear me, no--I could have borne that. She gave me never a glance. She\nonly fixed the child.\"\n\nMrs. Grose tried to see it. \"Fixed her?\"\n\n\"Ah, with such awful eyes!\"\n\nShe stared at mine as if they might really have resembled them. \"Do you\nmean of dislike?\"\n\n\"God help us, no. Of something much worse.\"\n\n\"Worse than dislike?--this left her indeed at a loss.\n\n\"With a determination--indescribable. With a kind of fury of intention.\"\n\nI made her turn pale. \"Intention?\"\n\n\"To get hold of her.\" Mrs. Grose--her eyes just lingering on mine--gave\na shudder and walked to the window; and while she stood there looking\nout I completed my statement. \"THAT'S what Flora knows.\"\n\nAfter a little she turned round. \"The person was in black, you say?\"\n\n\"In mourning--rather poor, almost shabby. But--yes--with extraordinary\nbeauty.\" I now recognized to what I had at last, stroke by stroke,\nbrought the victim of my confidence, for she quite visibly weighed\nthis. \"Oh, handsome--very, very,\" I insisted; \"wonderfully handsome. But\ninfamous.\"\n\nShe slowly came back to me. \"Miss Jessel--WAS infamous.\" She once more\ntook my hand in both her own, holding it as tight as if to fortify me\nagainst the increase of alarm I might draw from this disclosure. \"They\nwere both infamous,\" she finally said.\n\nSo, for a little, we faced it once more together; and I found absolutely\na degree of help in seeing it now so straight. \"I appreciate,\" I said,\n\"the great decency of your not having hitherto spoken; but the time has\ncertainly come to give me the whole thing.\" She appeared to assent to\nthis, but still only in silence; seeing which I went on: \"I must have it\nnow. Of what did she die? Come, there was something between them.\"\n\n\"There was everything.\"\n\n\"In spite of the difference--?\"\n\n\"Oh, of their rank, their condition\"--she brought it woefully out. \"SHE\nwas a lady.\"\n\nI turned it over; I again saw. \"Yes--she was a lady.\"\n\n\"And he so dreadfully below,\" said Mrs. Grose.\n\nI felt that I doubtless needn't press too hard, in such company, on the\nplace of a servant in the scale; but there was nothing to prevent an\nacceptance of my companion's own measure of my predecessor's abasement.\nThere was a way to deal with that, and I dealt; the more readily for\nmy full vision--on the evidence--of our employer's late clever,\ngood-looking \"own\" man; impudent, assured, spoiled, depraved. \"The\nfellow was a hound.\"\n\nMrs. Grose considered as if it were perhaps a little a case for a sense\nof shades. \"I've never seen one like him. He did what he wished.\"\n\n\"With HER?\"\n\n\"With them all.\"\n\nIt was as if now in my friend's own eyes Miss Jessel had again appeared.\nI seemed at any rate, for an instant, to see their evocation of her\nas distinctly as I had seen her by the pond; and I brought out with\ndecision: \"It must have been also what SHE wished!\"\n\nMrs. Grose's face signified that it had been indeed, but she said at the\nsame time: \"Poor woman--she paid for it!\"\n\n\"Then you do know what she died of?\" I asked.\n\n\"No--I know nothing. I wanted not to know; I was glad enough I didn't;\nand I thanked heaven she was well out of this!\"\n\n\"Yet you had, then, your idea--\"\n\n\"Of her real reason for leaving? Oh, yes--as to that. She couldn't have\nstayed. Fancy it here--for a governess! And afterward I imagined--and I\nstill imagine. And what I imagine is dreadful.\"\n\n\"Not so dreadful as what _I_ do,\" I replied; on which I must have shown\nher--as I was indeed but too conscious--a front of miserable defeat. It\nbrought out again all her compassion for me, and at the renewed touch of\nher kindness my power to resist broke down. I burst, as I had, the other\ntime, made her burst, into tears; she took me to her motherly breast,\nand my lamentation overflowed. \"I don't do it!\" I sobbed in despair; \"I\ndon't save or shield them! It's far worse than I dreamed--they're lost!\"\n\n\n\n\nVIII\n\n\nWhat I had said to Mrs. Grose was true enough: there were in the matter\nI had put before her depths and possibilities that I lacked resolution\nto sound; so that when we met once more in the wonder of it we were of a\ncommon mind about the duty of resistance to extravagant fancies. We were\nto keep our heads if we should keep nothing else--difficult indeed as\nthat might be in the face of what, in our prodigious experience, was\nleast to be questioned. Late that night, while the house slept, we had\nanother talk in my room, when she went all the way with me as to its\nbeing beyond doubt that I had seen exactly what I had seen. To hold her\nperfectly in the pinch of that, I found I had only to ask her how, if\nI had \"made it up,\" I came to be able to give, of each of the persons\nappearing to me, a picture disclosing, to the last detail, their\nspecial marks--a portrait on the exhibition of which she had instantly\nrecognized and named them. She wished of course--small blame to her!--to\nsink the whole subject; and I was quick to assure her that my own\ninterest in it had now violently taken the form of a search for the way\nto escape from it. I encountered her on the ground of a probability that\nwith recurrence--for recurrence we took for granted--I should get\nused to my danger, distinctly professing that my personal exposure had\nsuddenly become the least of my discomforts. It was my new suspicion\nthat was intolerable; and yet even to this complication the later hours\nof the day had brought a little ease.\n\nOn leaving her, after my first outbreak, I had of course returned to my\npupils, associating the right remedy for my dismay with that sense of\ntheir charm which I had already found to be a thing I could positively\ncultivate and which had never failed me yet. I had simply, in other\nwords, plunged afresh into Flora's special society and there become\naware--it was almost a luxury!--that she could put her little conscious\nhand straight upon the spot that ached. She had looked at me in sweet\nspeculation and then had accused me to my face of having \"cried.\" I had\nsupposed I had brushed away the ugly signs: but I could literally--for\nthe time, at all events--rejoice, under this fathomless charity, that\nthey had not entirely disappeared. To gaze into the depths of blue of\nthe child's eyes and pronounce their loveliness a trick of premature\ncunning was to be guilty of a cynicism in preference to which I\nnaturally preferred to abjure my judgment and, so far as might be, my\nagitation. I couldn't abjure for merely wanting to, but I could repeat\nto Mrs. Grose--as I did there, over and over, in the small hours--that\nwith their voices in the air, their pressure on one's heart, and their\nfragrant faces against one's cheek, everything fell to the ground but\ntheir incapacity and their beauty. It was a pity that, somehow, to\nsettle this once for all, I had equally to re-enumerate the signs of\nsubtlety that, in the afternoon, by the lake had made a miracle of my\nshow of self-possession. It was a pity to be obliged to reinvestigate\nthe certitude of the moment itself and repeat how it had come to me as\na revelation that the inconceivable communion I then surprised was a\nmatter, for either party, of habit. It was a pity that I should have had\nto quaver out again the reasons for my not having, in my delusion,\nso much as questioned that the little girl saw our visitant even as I\nactually saw Mrs. Grose herself, and that she wanted, by just so much as\nshe did thus see, to make me suppose she didn't, and at the same time,\nwithout showing anything, arrive at a guess as to whether I myself did!\nIt was a pity that I needed once more to describe the portentous little\nactivity by which she sought to divert my attention--the perceptible\nincrease of movement, the greater intensity of play, the singing, the\ngabbling of nonsense, and the invitation to romp.\n\nYet if I had not indulged, to prove there was nothing in it, in this\nreview, I should have missed the two or three dim elements of comfort\nthat still remained to me. I should not for instance have been able to\nasseverate to my friend that I was certain--which was so much to the\ngood--that _I_ at least had not betrayed myself. I should not have been\nprompted, by stress of need, by desperation of mind--I scarce know what\nto call it--to invoke such further aid to intelligence as might spring\nfrom pushing my colleague fairly to the wall. She had told me, bit by\nbit, under pressure, a great deal; but a small shifty spot on the wrong\nside of it all still sometimes brushed my brow like the wing of a bat;\nand I remember how on this occasion--for the sleeping house and the\nconcentration alike of our danger and our watch seemed to help--I felt\nthe importance of giving the last jerk to the curtain. \"I don't\nbelieve anything so horrible,\" I recollect saying; \"no, let us put it\ndefinitely, my dear, that I don't. But if I did, you know, there's\na thing I should require now, just without sparing you the least bit\nmore--oh, not a scrap, come!--to get out of you. What was it you had in\nmind when, in our distress, before Miles came back, over the letter from\nhis school, you said, under my insistence, that you didn't pretend for\nhim that he had not literally EVER been 'bad'? He has NOT literally\n'ever,' in these weeks that I myself have lived with him and so closely\nwatched him; he has been an imperturbable little prodigy of delightful,\nlovable goodness. Therefore you might perfectly have made the claim for\nhim if you had not, as it happened, seen an exception to take. What was\nyour exception, and to what passage in your personal observation of him\ndid you refer?\"\n\nIt was a dreadfully austere inquiry, but levity was not our note, and,\nat any rate, before the gray dawn admonished us to separate I had got\nmy answer. What my friend had had in mind proved to be immensely to the\npurpose. It was neither more nor less than the circumstance that for\na period of several months Quint and the boy had been perpetually\ntogether. It was in fact the very appropriate truth that she had\nventured to criticize the propriety, to hint at the incongruity, of\nso close an alliance, and even to go so far on the subject as a frank\noverture to Miss Jessel. Miss Jessel had, with a most strange manner,\nrequested her to mind her business, and the good woman had, on this,\ndirectly approached little Miles. What she had said to him, since I\npressed, was that SHE liked to see young gentlemen not forget their\nstation.\n\nI pressed again, of course, at this. \"You reminded him that Quint was\nonly a base menial?\"\n\n\"As you might say! And it was his answer, for one thing, that was bad.\"\n\n\"And for another thing?\" I waited. \"He repeated your words to Quint?\"\n\n\"No, not that. It's just what he WOULDN'T!\" she could still impress upon\nme. \"I was sure, at any rate,\" she added, \"that he didn't. But he denied\ncertain occasions.\"\n\n\"What occasions?\"\n\n\"When they had been about together quite as if Quint were his tutor--and\na very grand one--and Miss Jessel only for the little lady. When he had\ngone off with the fellow, I mean, and spent hours with him.\"\n\n\"He then prevaricated about it--he said he hadn't?\" Her assent was clear\nenough to cause me to add in a moment: \"I see. He lied.\"\n\n\"Oh!\" Mrs. Grose mumbled. This was a suggestion that it didn't matter;\nwhich indeed she backed up by a further remark. \"You see, after all,\nMiss Jessel didn't mind. She didn't forbid him.\"\n\nI considered. \"Did he put that to you as a justification?\"\n\nAt this she dropped again. \"No, he never spoke of it.\"\n\n\"Never mentioned her in connection with Quint?\"\n\nShe saw, visibly flushing, where I was coming out. \"Well, he didn't show\nanything. He denied,\" she repeated; \"he denied.\"\n\nLord, how I pressed her now! \"So that you could see he knew what was\nbetween the two wretches?\"\n\n\"I don't know--I don't know!\" the poor woman groaned.\n\n\"You do know, you dear thing,\" I replied; \"only you haven't my dreadful\nboldness of mind, and you keep back, out of timidity and modesty and\ndelicacy, even the impression that, in the past, when you had, without\nmy aid, to flounder about in silence, most of all made you miserable.\nBut I shall get it out of you yet! There was something in the boy that\nsuggested to you,\" I continued, \"that he covered and concealed their\nrelation.\"\n\n\"Oh, he couldn't prevent--\"\n\n\"Your learning the truth? I daresay! But, heavens,\" I fell, with\nvehemence, athinking, \"what it shows that they must, to that extent,\nhave succeeded in making of him!\"\n\n\"Ah, nothing that's not nice NOW!\" Mrs. Grose lugubriously pleaded.\n\n\"I don't wonder you looked queer,\" I persisted, \"when I mentioned to you\nthe letter from his school!\"\n\n\"I doubt if I looked as queer as you!\" she retorted with homely force.\n\"And if he was so bad then as that comes to, how is he such an angel\nnow?\"\n\n\"Yes, indeed--and if he was a fiend at school! How, how, how? Well,\"\nI said in my torment, \"you must put it to me again, but I shall not be\nable to tell you for some days. Only, put it to me again!\" I cried in a\nway that made my friend stare. \"There are directions in which I must\nnot for the present let myself go.\" Meanwhile I returned to her first\nexample--the one to which she had just previously referred--of the boy's\nhappy capacity for an occasional slip. \"If Quint--on your remonstrance\nat the time you speak of--was a base menial, one of the things Miles\nsaid to you, I find myself guessing, was that you were another.\" Again\nher admission was so adequate that I continued: \"And you forgave him\nthat?\"\n\n\"Wouldn't YOU?\"\n\n\"Oh, yes!\" And we exchanged there, in the stillness, a sound of the\noddest amusement. Then I went on: \"At all events, while he was with the\nman--\"\n\n\"Miss Flora was with the woman. It suited them all!\"\n\nIt suited me, too, I felt, only too well; by which I mean that it suited\nexactly the particularly deadly view I was in the very act of forbidding\nmyself to entertain. But I so far succeeded in checking the expression\nof this view that I will throw, just here, no further light on it than\nmay be offered by the mention of my final observation to Mrs. Grose.\n\"His having lied and been impudent are, I confess, less engaging\nspecimens than I had hoped to have from you of the outbreak in him of\nthe little natural man. Still,\" I mused, \"They must do, for they make me\nfeel more than ever that I must watch.\"\n\nIt made me blush, the next minute, to see in my friend's face how much\nmore unreservedly she had forgiven him than her anecdote struck me as\npresenting to my own tenderness an occasion for doing. This came out\nwhen, at the schoolroom door, she quitted me. \"Surely you don't accuse\nHIM--\"\n\n\"Of carrying on an intercourse that he conceals from me? Ah, remember\nthat, until further evidence, I now accuse nobody.\" Then, before\nshutting her out to go, by another passage, to her own place, \"I must\njust wait,\" I wound up.\n\n\n\n\nIX\n\n\nI waited and waited, and the days, as they elapsed, took something from\nmy consternation. A very few of them, in fact, passing, in constant\nsight of my pupils, without a fresh incident, sufficed to give to\ngrievous fancies and even to odious memories a kind of brush of the\nsponge. I have spoken of the surrender to their extraordinary childish\ngrace as a thing I could actively cultivate, and it may be imagined if\nI neglected now to address myself to this source for whatever it\nwould yield. Stranger than I can express, certainly, was the effort to\nstruggle against my new lights; it would doubtless have been, however,\na greater tension still had it not been so frequently successful. I\nused to wonder how my little charges could help guessing that I thought\nstrange things about them; and the circumstances that these things only\nmade them more interesting was not by itself a direct aid to keeping\nthem in the dark. I trembled lest they should see that they WERE so\nimmensely more interesting. Putting things at the worst, at all events,\nas in meditation I so often did, any clouding of their innocence could\nonly be--blameless and foredoomed as they were--a reason the more for\ntaking risks. There were moments when, by an irresistible impulse, I\nfound myself catching them up and pressing them to my heart. As soon as\nI had done so I used to say to myself: \"What will they think of that?\nDoesn't it betray too much?\" It would have been easy to get into a sad,\nwild tangle about how much I might betray; but the real account, I feel,\nof the hours of peace that I could still enjoy was that the immediate\ncharm of my companions was a beguilement still effective even under the\nshadow of the possibility that it was studied. For if it occurred to me\nthat I might occasionally excite suspicion by the little outbreaks of my\nsharper passion for them, so too I remember wondering if I mightn't see\na queerness in the traceable increase of their own demonstrations.\n\nThey were at this period extravagantly and preternaturally fond of me;\nwhich, after all, I could reflect, was no more than a graceful response\nin children perpetually bowed over and hugged. The homage of which they\nwere so lavish succeeded, in truth, for my nerves, quite as well as if\nI never appeared to myself, as I may say, literally to catch them at a\npurpose in it. They had never, I think, wanted to do so many things for\ntheir poor protectress; I mean--though they got their lessons better and\nbetter, which was naturally what would please her most--in the way of\ndiverting, entertaining, surprising her; reading her passages, telling\nher stories, acting her charades, pouncing out at her, in disguises, as\nanimals and historical characters, and above all astonishing her by the\n\"pieces\" they had secretly got by heart and could interminably recite. I\nshould never get to the bottom--were I to let myself go even now--of the\nprodigious private commentary, all under still more private correction,\nwith which, in these days, I overscored their full hours. They had shown\nme from the first a facility for everything, a general faculty which,\ntaking a fresh start, achieved remarkable flights. They got their little\ntasks as if they loved them, and indulged, from the mere exuberance of\nthe gift, in the most unimposed little miracles of memory. They not\nonly popped out at me as tigers and as Romans, but as Shakespeareans,\nastronomers, and navigators. This was so singularly the case that it had\npresumably much to do with the fact as to which, at the present day,\nI am at a loss for a different explanation: I allude to my unnatural\ncomposure on the subject of another school for Miles. What I remember\nis that I was content not, for the time, to open the question, and that\ncontentment must have sprung from the sense of his perpetually striking\nshow of cleverness. He was too clever for a bad governess, for a\nparson's daughter, to spoil; and the strangest if not the brightest\nthread in the pensive embroidery I just spoke of was the impression I\nmight have got, if I had dared to work it out, that he was under some\ninfluence operating in his small intellectual life as a tremendous\nincitement.\n\nIf it was easy to reflect, however, that such a boy could postpone\nschool, it was at least as marked that for such a boy to have been\n\"kicked out\" by a schoolmaster was a mystification without end. Let me\nadd that in their company now--and I was careful almost never to be out\nof it--I could follow no scent very far. We lived in a cloud of music\nand love and success and private theatricals. The musical sense in each\nof the children was of the quickest, but the elder in especial had a\nmarvelous knack of catching and repeating. The schoolroom piano\nbroke into all gruesome fancies; and when that failed there were\nconfabulations in corners, with a sequel of one of them going out in\nthe highest spirits in order to \"come in\" as something new. I had had\nbrothers myself, and it was no revelation to me that little girls could\nbe slavish idolaters of little boys. What surpassed everything was that\nthere was a little boy in the world who could have for the inferior age,\nsex, and intelligence so fine a consideration. They were extraordinarily\nat one, and to say that they never either quarreled or complained is\nto make the note of praise coarse for their quality of sweetness.\nSometimes, indeed, when I dropped into coarseness, I perhaps came across\ntraces of little understandings between them by which one of them should\nkeep me occupied while the other slipped away. There is a naive side,\nI suppose, in all diplomacy; but if my pupils practiced upon me, it was\nsurely with the minimum of grossness. It was all in the other quarter\nthat, after a lull, the grossness broke out.\n\nI find that I really hang back; but I must take my plunge. In going on\nwith the record of what was hideous at Bly, I not only challenge the\nmost liberal faith--for which I little care; but--and this is another\nmatter--I renew what I myself suffered, I again push my way through it\nto the end. There came suddenly an hour after which, as I look back, the\naffair seems to me to have been all pure suffering; but I have at least\nreached the heart of it, and the straightest road out is doubtless to\nadvance. One evening--with nothing to lead up or to prepare it--I felt\nthe cold touch of the impression that had breathed on me the night of\nmy arrival and which, much lighter then, as I have mentioned, I should\nprobably have made little of in memory had my subsequent sojourn been\nless agitated. I had not gone to bed; I sat reading by a couple of\ncandles. There was a roomful of old books at Bly--last-century fiction,\nsome of it, which, to the extent of a distinctly deprecated renown,\nbut never to so much as that of a stray specimen, had reached the\nsequestered home and appealed to the unavowed curiosity of my youth. I\nremember that the book I had in my hand was Fielding's Amelia; also that\nI was wholly awake. I recall further both a general conviction that it\nwas horribly late and a particular objection to looking at my watch. I\nfigure, finally, that the white curtain draping, in the fashion of those\ndays, the head of Flora's little bed, shrouded, as I had assured myself\nlong before, the perfection of childish rest. I recollect in short that,\nthough I was deeply interested in my author, I found myself, at the turn\nof a page and with his spell all scattered, looking straight up from\nhim and hard at the door of my room. There was a moment during which\nI listened, reminded of the faint sense I had had, the first night, of\nthere being something undefinably astir in the house, and noted the soft\nbreath of the open casement just move the half-drawn blind. Then, with\nall the marks of a deliberation that must have seemed magnificent had\nthere been anyone to admire it, I laid down my book, rose to my feet,\nand, taking a candle, went straight out of the room and, from the\npassage, on which my light made little impression, noiselessly closed\nand locked the door.\n\nI can say now neither what determined nor what guided me, but I went\nstraight along the lobby, holding my candle high, till I came within\nsight of the tall window that presided over the great turn of the\nstaircase. At this point I precipitately found myself aware of three\nthings. They were practically simultaneous, yet they had flashes of\nsuccession. My candle, under a bold flourish, went out, and I perceived,\nby the uncovered window, that the yielding dusk of earliest morning\nrendered it unnecessary. Without it, the next instant, I saw that there\nwas someone on the stair. I speak of sequences, but I required no lapse\nof seconds to stiffen myself for a third encounter with Quint. The\napparition had reached the landing halfway up and was therefore on the\nspot nearest the window, where at sight of me, it stopped short and\nfixed me exactly as it had fixed me from the tower and from the garden.\nHe knew me as well as I knew him; and so, in the cold, faint twilight,\nwith a glimmer in the high glass and another on the polish of the\noak stair below, we faced each other in our common intensity. He was\nabsolutely, on this occasion, a living, detestable, dangerous presence.\nBut that was not the wonder of wonders; I reserve this distinction for\nquite another circumstance: the circumstance that dread had unmistakably\nquitted me and that there was nothing in me there that didn't meet and\nmeasure him.\n\nI had plenty of anguish after that extraordinary moment, but I had,\nthank God, no terror. And he knew I had not--I found myself at the end\nof an instant magnificently aware of this. I felt, in a fierce rigor of\nconfidence, that if I stood my ground a minute I should cease--for\nthe time, at least--to have him to reckon with; and during the minute,\naccordingly, the thing was as human and hideous as a real interview:\nhideous just because it WAS human, as human as to have met alone, in\nthe small hours, in a sleeping house, some enemy, some adventurer,\nsome criminal. It was the dead silence of our long gaze at such close\nquarters that gave the whole horror, huge as it was, its only note of\nthe unnatural. If I had met a murderer in such a place and at such an\nhour, we still at least would have spoken. Something would have passed,\nin life, between us; if nothing had passed, one of us would have moved.\nThe moment was so prolonged that it would have taken but little more to\nmake me doubt if even _I_ were in life. I can't express what followed it\nsave by saying that the silence itself--which was indeed in a manner\nan attestation of my strength--became the element into which I saw the\nfigure disappear; in which I definitely saw it turn as I might have\nseen the low wretch to which it had once belonged turn on receipt of an\norder, and pass, with my eyes on the villainous back that no hunch could\nhave more disfigured, straight down the staircase and into the darkness\nin which the next bend was lost.\n\n\n\n\nX\n\n\nI remained awhile at the top of the stair, but with the effect presently\nof understanding that when my visitor had gone, he had gone: then I\nreturned to my room. The foremost thing I saw there by the light of the\ncandle I had left burning was that Flora's little bed was empty; and on\nthis I caught my breath with all the terror that, five minutes before,\nI had been able to resist. I dashed at the place in which I had left her\nlying and over which (for the small silk counterpane and the sheets were\ndisarranged) the white curtains had been deceivingly pulled forward;\nthen my step, to my unutterable relief, produced an answering sound: I\nperceived an agitation of the window blind, and the child, ducking down,\nemerged rosily from the other side of it. She stood there in so much of\nher candor and so little of her nightgown, with her pink bare feet and\nthe golden glow of her curls. She looked intensely grave, and I had\nnever had such a sense of losing an advantage acquired (the thrill\nof which had just been so prodigious) as on my consciousness that\nshe addressed me with a reproach. \"You naughty: where HAVE you\nbeen?\"--instead of challenging her own irregularity I found myself\narraigned and explaining. She herself explained, for that matter, with\nthe loveliest, eagerest simplicity. She had known suddenly, as she lay\nthere, that I was out of the room, and had jumped up to see what had\nbecome of me. I had dropped, with the joy of her reappearance, back\ninto my chair--feeling then, and then only, a little faint; and she had\npattered straight over to me, thrown herself upon my knee, given herself\nto be held with the flame of the candle full in the wonderful little\nface that was still flushed with sleep. I remember closing my eyes an\ninstant, yieldingly, consciously, as before the excess of something\nbeautiful that shone out of the blue of her own. \"You were looking for\nme out of the window?\" I said. \"You thought I might be walking in the\ngrounds?\"\n\n\"Well, you know, I thought someone was\"--she never blanched as she\nsmiled out that at me.\n\nOh, how I looked at her now! \"And did you see anyone?\"\n\n\"Ah, NO!\" she returned, almost with the full privilege of childish\ninconsequence, resentfully, though with a long sweetness in her little\ndrawl of the negative.\n\nAt that moment, in the state of my nerves, I absolutely believed she\nlied; and if I once more closed my eyes it was before the dazzle of the\nthree or four possible ways in which I might take this up. One of these,\nfor a moment, tempted me with such singular intensity that, to withstand\nit, I must have gripped my little girl with a spasm that, wonderfully,\nshe submitted to without a cry or a sign of fright. Why not break out\nat her on the spot and have it all over?--give it to her straight in her\nlovely little lighted face? \"You see, you see, you KNOW that you do and\nthat you already quite suspect I believe it; therefore, why not frankly\nconfess it to me, so that we may at least live with it together and\nlearn perhaps, in the strangeness of our fate, where we are and what\nit means?\" This solicitation dropped, alas, as it came: if I could\nimmediately have succumbed to it I might have spared myself--well,\nyou'll see what. Instead of succumbing I sprang again to my feet,\nlooked at her bed, and took a helpless middle way. \"Why did you pull the\ncurtain over the place to make me think you were still there?\"\n\nFlora luminously considered; after which, with her little divine smile:\n\"Because I don't like to frighten you!\"\n\n\"But if I had, by your idea, gone out--?\"\n\nShe absolutely declined to be puzzled; she turned her eyes to the flame\nof the candle as if the question were as irrelevant, or at any rate as\nimpersonal, as Mrs. Marcet or nine-times-nine. \"Oh, but you know,\" she\nquite adequately answered, \"that you might come back, you dear, and that\nyou HAVE!\" And after a little, when she had got into bed, I had, for a\nlong time, by almost sitting on her to hold her hand, to prove that I\nrecognized the pertinence of my return.\n\nYou may imagine the general complexion, from that moment, of my nights.\nI repeatedly sat up till I didn't know when; I selected moments when my\nroommate unmistakably slept, and, stealing out, took noiseless turns in\nthe passage and even pushed as far as to where I had last met Quint. But\nI never met him there again; and I may as well say at once that I on no\nother occasion saw him in the house. I just missed, on the staircase,\non the other hand, a different adventure. Looking down it from the top I\nonce recognized the presence of a woman seated on one of the lower steps\nwith her back presented to me, her body half-bowed and her head, in an\nattitude of woe, in her hands. I had been there but an instant, however,\nwhen she vanished without looking round at me. I knew, nonetheless,\nexactly what dreadful face she had to show; and I wondered whether, if\ninstead of being above I had been below, I should have had, for going\nup, the same nerve I had lately shown Quint. Well, there continued to\nbe plenty of chance for nerve. On the eleventh night after my latest\nencounter with that gentleman--they were all numbered now--I had an\nalarm that perilously skirted it and that indeed, from the particular\nquality of its unexpectedness, proved quite my sharpest shock. It was\nprecisely the first night during this series that, weary with watching,\nI had felt that I might again without laxity lay myself down at my\nold hour. I slept immediately and, as I afterward knew, till about one\no'clock; but when I woke it was to sit straight up, as completely roused\nas if a hand had shook me. I had left a light burning, but it was now\nout, and I felt an instant certainty that Flora had extinguished it.\nThis brought me to my feet and straight, in the darkness, to her bed,\nwhich I found she had left. A glance at the window enlightened me\nfurther, and the striking of a match completed the picture.\n\nThe child had again got up--this time blowing out the taper, and had\nagain, for some purpose of observation or response, squeezed in behind\nthe blind and was peering out into the night. That she now saw--as she\nhad not, I had satisfied myself, the previous time--was proved to me by\nthe fact that she was disturbed neither by my reillumination nor by the\nhaste I made to get into slippers and into a wrap. Hidden, protected,\nabsorbed, she evidently rested on the sill--the casement opened\nforward--and gave herself up. There was a great still moon to help her,\nand this fact had counted in my quick decision. She was face to face\nwith the apparition we had met at the lake, and could now communicate\nwith it as she had not then been able to do. What I, on my side, had to\ncare for was, without disturbing her, to reach, from the corridor, some\nother window in the same quarter. I got to the door without her hearing\nme; I got out of it, closed it, and listened, from the other side, for\nsome sound from her. While I stood in the passage I had my eyes on her\nbrother's door, which was but ten steps off and which, indescribably,\nproduced in me a renewal of the strange impulse that I lately spoke\nof as my temptation. What if I should go straight in and march to HIS\nwindow?--what if, by risking to his boyish bewilderment a revelation of\nmy motive, I should throw across the rest of the mystery the long halter\nof my boldness?\n\nThis thought held me sufficiently to make me cross to his threshold and\npause again. I preternaturally listened; I figured to myself what might\nportentously be; I wondered if his bed were also empty and he too were\nsecretly at watch. It was a deep, soundless minute, at the end of which\nmy impulse failed. He was quiet; he might be innocent; the risk was\nhideous; I turned away. There was a figure in the grounds--a figure\nprowling for a sight, the visitor with whom Flora was engaged; but it\nwas not the visitor most concerned with my boy. I hesitated afresh, but\non other grounds and only for a few seconds; then I had made my choice.\nThere were empty rooms at Bly, and it was only a question of choosing\nthe right one. The right one suddenly presented itself to me as the\nlower one--though high above the gardens--in the solid corner of the\nhouse that I have spoken of as the old tower. This was a large, square\nchamber, arranged with some state as a bedroom, the extravagant size of\nwhich made it so inconvenient that it had not for years, though kept by\nMrs. Grose in exemplary order, been occupied. I had often admired it and\nI knew my way about in it; I had only, after just faltering at the first\nchill gloom of its disuse, to pass across it and unbolt as quietly as I\ncould one of the shutters. Achieving this transit, I uncovered the\nglass without a sound and, applying my face to the pane, was able, the\ndarkness without being much less than within, to see that I commanded\nthe right direction. Then I saw something more. The moon made the\nnight extraordinarily penetrable and showed me on the lawn a person,\ndiminished by distance, who stood there motionless and as if fascinated,\nlooking up to where I had appeared--looking, that is, not so much\nstraight at me as at something that was apparently above me. There was\nclearly another person above me--there was a person on the tower; but\nthe presence on the lawn was not in the least what I had conceived and\nhad confidently hurried to meet. The presence on the lawn--I felt sick\nas I made it out--was poor little Miles himself.\n\n\n\n\nXI\n\n\nIt was not till late next day that I spoke to Mrs. Grose; the rigor with\nwhich I kept my pupils in sight making it often difficult to meet\nher privately, and the more as we each felt the importance of not\nprovoking--on the part of the servants quite as much as on that of the\nchildren--any suspicion of a secret flurry or that of a discussion of\nmysteries. I drew a great security in this particular from her mere\nsmooth aspect. There was nothing in her fresh face to pass on to others\nmy horrible confidences. She believed me, I was sure, absolutely: if she\nhadn't I don't know what would have become of me, for I couldn't have\nborne the business alone. But she was a magnificent monument to the\nblessing of a want of imagination, and if she could see in our little\ncharges nothing but their beauty and amiability, their happiness and\ncleverness, she had no direct communication with the sources of my\ntrouble. If they had been at all visibly blighted or battered, she would\ndoubtless have grown, on tracing it back, haggard enough to match them;\nas matters stood, however, I could feel her, when she surveyed them,\nwith her large white arms folded and the habit of serenity in all her\nlook, thank the Lord's mercy that if they were ruined the pieces would\nstill serve. Flights of fancy gave place, in her mind, to a steady\nfireside glow, and I had already begun to perceive how, with the\ndevelopment of the conviction that--as time went on without a public\naccident--our young things could, after all, look out for themselves,\nshe addressed her greatest solicitude to the sad case presented by their\ninstructress. That, for myself, was a sound simplification: I could\nengage that, to the world, my face should tell no tales, but it would\nhave been, in the conditions, an immense added strain to find myself\nanxious about hers.\n\nAt the hour I now speak of she had joined me, under pressure, on the\nterrace, where, with the lapse of the season, the afternoon sun was now\nagreeable; and we sat there together while, before us, at a distance,\nbut within call if we wished, the children strolled to and fro in one\nof their most manageable moods. They moved slowly, in unison, below us,\nover the lawn, the boy, as they went, reading aloud from a storybook and\npassing his arm round his sister to keep her quite in touch. Mrs. Grose\nwatched them with positive placidity; then I caught the suppressed\nintellectual creak with which she conscientiously turned to take from me\na view of the back of the tapestry. I had made her a receptacle of\nlurid things, but there was an odd recognition of my superiority--my\naccomplishments and my function--in her patience under my pain. She\noffered her mind to my disclosures as, had I wished to mix a witch's\nbroth and proposed it with assurance, she would have held out a large\nclean saucepan. This had become thoroughly her attitude by the time\nthat, in my recital of the events of the night, I reached the point of\nwhat Miles had said to me when, after seeing him, at such a monstrous\nhour, almost on the very spot where he happened now to be, I had gone\ndown to bring him in; choosing then, at the window, with a concentrated\nneed of not alarming the house, rather that method than a signal more\nresonant. I had left her meanwhile in little doubt of my small hope of\nrepresenting with success even to her actual sympathy my sense of the\nreal splendor of the little inspiration with which, after I had got him\ninto the house, the boy met my final articulate challenge. As soon as I\nappeared in the moonlight on the terrace, he had come to me as straight\nas possible; on which I had taken his hand without a word and led him,\nthrough the dark spaces, up the staircase where Quint had so hungrily\nhovered for him, along the lobby where I had listened and trembled, and\nso to his forsaken room.\n\nNot a sound, on the way, had passed between us, and I had wondered--oh,\nHOW I had wondered!--if he were groping about in his little mind for\nsomething plausible and not too grotesque. It would tax his invention,\ncertainly, and I felt, this time, over his real embarrassment, a curious\nthrill of triumph. It was a sharp trap for the inscrutable! He couldn't\nplay any longer at innocence; so how the deuce would he get out of it?\nThere beat in me indeed, with the passionate throb of this question an\nequal dumb appeal as to how the deuce _I_ should. I was confronted at\nlast, as never yet, with all the risk attached even now to sounding my\nown horrid note. I remember in fact that as we pushed into his little\nchamber, where the bed had not been slept in at all and the window,\nuncovered to the moonlight, made the place so clear that there was no\nneed of striking a match--I remember how I suddenly dropped, sank upon\nthe edge of the bed from the force of the idea that he must know how he\nreally, as they say, \"had\" me. He could do what he liked, with all his\ncleverness to help him, so long as I should continue to defer to the\nold tradition of the criminality of those caretakers of the young who\nminister to superstitions and fears. He \"had\" me indeed, and in a cleft\nstick; for who would ever absolve me, who would consent that I should go\nunhung, if, by the faintest tremor of an overture, I were the first to\nintroduce into our perfect intercourse an element so dire? No, no: it\nwas useless to attempt to convey to Mrs. Grose, just as it is scarcely\nless so to attempt to suggest here, how, in our short, stiff brush in\nthe dark, he fairly shook me with admiration. I was of course thoroughly\nkind and merciful; never, never yet had I placed on his little shoulders\nhands of such tenderness as those with which, while I rested against the\nbed, I held him there well under fire. I had no alternative but, in form\nat least, to put it to him.\n\n\"You must tell me now--and all the truth. What did you go out for? What\nwere you doing there?\"\n\nI can still see his wonderful smile, the whites of his beautiful eyes,\nand the uncovering of his little teeth shine to me in the dusk. \"If I\ntell you why, will you understand?\" My heart, at this, leaped into my\nmouth. WOULD he tell me why? I found no sound on my lips to press it,\nand I was aware of replying only with a vague, repeated, grimacing nod.\nHe was gentleness itself, and while I wagged my head at him he stood\nthere more than ever a little fairy prince. It was his brightness indeed\nthat gave me a respite. Would it be so great if he were really going to\ntell me? \"Well,\" he said at last, \"just exactly in order that you should\ndo this.\"\n\n\"Do what?\"\n\n\"Think me--for a change--BAD!\" I shall never forget the sweetness and\ngaiety with which he brought out the word, nor how, on top of it, he\nbent forward and kissed me. It was practically the end of everything.\nI met his kiss and I had to make, while I folded him for a minute in my\narms, the most stupendous effort not to cry. He had given exactly the\naccount of himself that permitted least of my going behind it, and it\nwas only with the effect of confirming my acceptance of it that, as I\npresently glanced about the room, I could say--\n\n\"Then you didn't undress at all?\"\n\nHe fairly glittered in the gloom. \"Not at all. I sat up and read.\"\n\n\"And when did you go down?\"\n\n\"At midnight. When I'm bad I AM bad!\"\n\n\"I see, I see--it's charming. But how could you be sure I would know\nit?\"\n\n\"Oh, I arranged that with Flora.\" His answers rang out with a readiness!\n\"She was to get up and look out.\"\n\n\"Which is what she did do.\" It was I who fell into the trap!\n\n\"So she disturbed you, and, to see what she was looking at, you also\nlooked--you saw.\"\n\n\"While you,\" I concurred, \"caught your death in the night air!\"\n\nHe literally bloomed so from this exploit that he could afford radiantly\nto assent. \"How otherwise should I have been bad enough?\" he asked.\nThen, after another embrace, the incident and our interview closed on my\nrecognition of all the reserves of goodness that, for his joke, he had\nbeen able to draw upon.\n\n\n\n\nXII\n\n\nThe particular impression I had received proved in the morning light,\nI repeat, not quite successfully presentable to Mrs. Grose, though I\nreinforced it with the mention of still another remark that he had made\nbefore we separated. \"It all lies in half a dozen words,\" I said to her,\n\"words that really settle the matter. 'Think, you know, what I MIGHT\ndo!' He threw that off to show me how good he is. He knows down to\nthe ground what he 'might' do. That's what he gave them a taste of at\nschool.\"\n\n\"Lord, you do change!\" cried my friend.\n\n\"I don't change--I simply make it out. The four, depend upon it,\nperpetually meet. If on either of these last nights you had been with\neither child, you would clearly have understood. The more I've watched\nand waited the more I've felt that if there were nothing else to make it\nsure it would be made so by the systematic silence of each. NEVER, by a\nslip of the tongue, have they so much as alluded to either of their old\nfriends, any more than Miles has alluded to his expulsion. Oh, yes,\nwe may sit here and look at them, and they may show off to us there to\ntheir fill; but even while they pretend to be lost in their fairytale\nthey're steeped in their vision of the dead restored. He's not reading\nto her,\" I declared; \"they're talking of THEM--they're talking horrors!\nI go on, I know, as if I were crazy; and it's a wonder I'm not. What\nI've seen would have made YOU so; but it has only made me more lucid,\nmade me get hold of still other things.\"\n\nMy lucidity must have seemed awful, but the charming creatures who were\nvictims of it, passing and repassing in their interlocked sweetness,\ngave my colleague something to hold on by; and I felt how tight she held\nas, without stirring in the breath of my passion, she covered them still\nwith her eyes. \"Of what other things have you got hold?\"\n\n\"Why, of the very things that have delighted, fascinated, and yet, at\nbottom, as I now so strangely see, mystified and troubled me. Their more\nthan earthly beauty, their absolutely unnatural goodness. It's a game,\"\nI went on; \"it's a policy and a fraud!\"\n\n\"On the part of little darlings--?\"\n\n\"As yet mere lovely babies? Yes, mad as that seems!\" The very act of\nbringing it out really helped me to trace it--follow it all up and piece\nit all together. \"They haven't been good--they've only been absent. It\nhas been easy to live with them, because they're simply leading a\nlife of their own. They're not mine--they're not ours. They're his and\nthey're hers!\"\n\n\"Quint's and that woman's?\"\n\n\"Quint's and that woman's. They want to get to them.\"\n\nOh, how, at this, poor Mrs. Grose appeared to study them! \"But for\nwhat?\"\n\n\"For the love of all the evil that, in those dreadful days, the pair put\ninto them. And to ply them with that evil still, to keep up the work of\ndemons, is what brings the others back.\"\n\n\"Laws!\" said my friend under her breath. The exclamation was homely, but\nit revealed a real acceptance of my further proof of what, in the bad\ntime--for there had been a worse even than this!--must have occurred.\nThere could have been no such justification for me as the plain assent\nof her experience to whatever depth of depravity I found credible in\nour brace of scoundrels. It was in obvious submission of memory that she\nbrought out after a moment: \"They WERE rascals! But what can they now\ndo?\" she pursued.\n\n\"Do?\" I echoed so loud that Miles and Flora, as they passed at their\ndistance, paused an instant in their walk and looked at us. \"Don't\nthey do enough?\" I demanded in a lower tone, while the children, having\nsmiled and nodded and kissed hands to us, resumed their exhibition. We\nwere held by it a minute; then I answered: \"They can destroy them!\" At\nthis my companion did turn, but the inquiry she launched was a silent\none, the effect of which was to make me more explicit. \"They don't know,\nas yet, quite how--but they're trying hard. They're seen only across,\nas it were, and beyond--in strange places and on high places, the top of\ntowers, the roof of houses, the outside of windows, the further edge\nof pools; but there's a deep design, on either side, to shorten the\ndistance and overcome the obstacle; and the success of the tempters is\nonly a question of time. They've only to keep to their suggestions of\ndanger.\"\n\n\"For the children to come?\"\n\n\"And perish in the attempt!\" Mrs. Grose slowly got up, and I\nscrupulously added: \"Unless, of course, we can prevent!\"\n\nStanding there before me while I kept my seat, she visibly turned things\nover. \"Their uncle must do the preventing. He must take them away.\"\n\n\"And who's to make him?\"\n\nShe had been scanning the distance, but she now dropped on me a foolish\nface. \"You, miss.\"\n\n\"By writing to him that his house is poisoned and his little nephew and\nniece mad?\"\n\n\"But if they ARE, miss?\"\n\n\"And if I am myself, you mean? That's charming news to be sent him by a\ngoverness whose prime undertaking was to give him no worry.\"\n\nMrs. Grose considered, following the children again. \"Yes, he do hate\nworry. That was the great reason--\"\n\n\"Why those fiends took him in so long? No doubt, though his indifference\nmust have been awful. As I'm not a fiend, at any rate, I shouldn't take\nhim in.\"\n\nMy companion, after an instant and for all answer, sat down again and\ngrasped my arm. \"Make him at any rate come to you.\"\n\nI stared. \"To ME?\" I had a sudden fear of what she might do. \"'Him'?\"\n\n\"He ought to BE here--he ought to help.\"\n\nI quickly rose, and I think I must have shown her a queerer face than\never yet. \"You see me asking him for a visit?\" No, with her eyes on\nmy face she evidently couldn't. Instead of it even--as a woman reads\nanother--she could see what I myself saw: his derision, his amusement,\nhis contempt for the breakdown of my resignation at being left alone and\nfor the fine machinery I had set in motion to attract his attention to\nmy slighted charms. She didn't know--no one knew--how proud I had been\nto serve him and to stick to our terms; yet she nonetheless took the\nmeasure, I think, of the warning I now gave her. \"If you should so lose\nyour head as to appeal to him for me--\"\n\nShe was really frightened. \"Yes, miss?\"\n\n\"I would leave, on the spot, both him and you.\"\n\n\n\n\nXIII\n\n\nIt was all very well to join them, but speaking to them proved quite as\nmuch as ever an effort beyond my strength--offered, in close quarters,\ndifficulties as insurmountable as before. This situation continued a\nmonth, and with new aggravations and particular notes, the note above\nall, sharper and sharper, of the small ironic consciousness on the part\nof my pupils. It was not, I am as sure today as I was sure then, my mere\ninfernal imagination: it was absolutely traceable that they were aware\nof my predicament and that this strange relation made, in a manner, for\na long time, the air in which we moved. I don't mean that they had their\ntongues in their cheeks or did anything vulgar, for that was not one\nof their dangers: I do mean, on the other hand, that the element of the\nunnamed and untouched became, between us, greater than any other, and\nthat so much avoidance could not have been so successfully effected\nwithout a great deal of tacit arrangement. It was as if, at moments, we\nwere perpetually coming into sight of subjects before which we must stop\nshort, turning suddenly out of alleys that we perceived to be blind,\nclosing with a little bang that made us look at each other--for, like\nall bangs, it was something louder than we had intended--the doors we\nhad indiscreetly opened. All roads lead to Rome, and there were times\nwhen it might have struck us that almost every branch of study or\nsubject of conversation skirted forbidden ground. Forbidden ground was\nthe question of the return of the dead in general and of whatever, in\nespecial, might survive, in memory, of the friends little children had\nlost. There were days when I could have sworn that one of them had, with\na small invisible nudge, said to the other: \"She thinks she'll do it\nthis time--but she WON'T!\" To \"do it\" would have been to indulge for\ninstance--and for once in a way--in some direct reference to the lady\nwho had prepared them for my discipline. They had a delightful endless\nappetite for passages in my own history, to which I had again and\nagain treated them; they were in possession of everything that had\never happened to me, had had, with every circumstance the story of my\nsmallest adventures and of those of my brothers and sisters and of the\ncat and the dog at home, as well as many particulars of the eccentric\nnature of my father, of the furniture and arrangement of our house, and\nof the conversation of the old women of our village. There were things\nenough, taking one with another, to chatter about, if one went very fast\nand knew by instinct when to go round. They pulled with an art of their\nown the strings of my invention and my memory; and nothing else perhaps,\nwhen I thought of such occasions afterward, gave me so the suspicion\nof being watched from under cover. It was in any case over MY life, MY\npast, and MY friends alone that we could take anything like our ease--a\nstate of affairs that led them sometimes without the least pertinence\nto break out into sociable reminders. I was invited--with no visible\nconnection--to repeat afresh Goody Gosling's celebrated mot or to\nconfirm the details already supplied as to the cleverness of the\nvicarage pony.\n\nIt was partly at such junctures as these and partly at quite different\nones that, with the turn my matters had now taken, my predicament, as I\nhave called it, grew most sensible. The fact that the days passed for\nme without another encounter ought, it would have appeared, to have done\nsomething toward soothing my nerves. Since the light brush, that second\nnight on the upper landing, of the presence of a woman at the foot of\nthe stair, I had seen nothing, whether in or out of the house, that one\nhad better not have seen. There was many a corner round which I expected\nto come upon Quint, and many a situation that, in a merely sinister way,\nwould have favored the appearance of Miss Jessel. The summer had turned,\nthe summer had gone; the autumn had dropped upon Bly and had blown out\nhalf our lights. The place, with its gray sky and withered garlands,\nits bared spaces and scattered dead leaves, was like a theater after\nthe performance--all strewn with crumpled playbills. There were exactly\nstates of the air, conditions of sound and of stillness, unspeakable\nimpressions of the KIND of ministering moment, that brought back to me,\nlong enough to catch it, the feeling of the medium in which, that June\nevening out of doors, I had had my first sight of Quint, and in which,\ntoo, at those other instants, I had, after seeing him through the\nwindow, looked for him in vain in the circle of shrubbery. I recognized\nthe signs, the portents--I recognized the moment, the spot. But they\nremained unaccompanied and empty, and I continued unmolested; if\nunmolested one could call a young woman whose sensibility had, in the\nmost extraordinary fashion, not declined but deepened. I had said in my\ntalk with Mrs. Grose on that horrid scene of Flora's by the lake--and\nhad perplexed her by so saying--that it would from that moment distress\nme much more to lose my power than to keep it. I had then expressed what\nwas vividly in my mind: the truth that, whether the children really\nsaw or not--since, that is, it was not yet definitely proved--I greatly\npreferred, as a safeguard, the fullness of my own exposure. I was ready\nto know the very worst that was to be known. What I had then had an ugly\nglimpse of was that my eyes might be sealed just while theirs were\nmost opened. Well, my eyes WERE sealed, it appeared, at present--a\nconsummation for which it seemed blasphemous not to thank God. There\nwas, alas, a difficulty about that: I would have thanked him with all\nmy soul had I not had in a proportionate measure this conviction of the\nsecret of my pupils.\n\nHow can I retrace today the strange steps of my obsession? There were\ntimes of our being together when I would have been ready to swear that,\nliterally, in my presence, but with my direct sense of it closed, they\nhad visitors who were known and were welcome. Then it was that, had I\nnot been deterred by the very chance that such an injury might prove\ngreater than the injury to be averted, my exultation would have broken\nout. \"They're here, they're here, you little wretches,\" I would have\ncried, \"and you can't deny it now!\" The little wretches denied it with\nall the added volume of their sociability and their tenderness, in just\nthe crystal depths of which--like the flash of a fish in a stream--the\nmockery of their advantage peeped up. The shock, in truth, had sunk into\nme still deeper than I knew on the night when, looking out to see either\nQuint or Miss Jessel under the stars, I had beheld the boy over\nwhose rest I watched and who had immediately brought in with him--had\nstraightway, there, turned it on me--the lovely upward look with which,\nfrom the battlements above me, the hideous apparition of Quint had\nplayed. If it was a question of a scare, my discovery on this occasion\nhad scared me more than any other, and it was in the condition of nerves\nproduced by it that I made my actual inductions. They harassed me so\nthat sometimes, at odd moments, I shut myself up audibly to rehearse--it\nwas at once a fantastic relief and a renewed despair--the manner in\nwhich I might come to the point. I approached it from one side and the\nother while, in my room, I flung myself about, but I always broke down\nin the monstrous utterance of names. As they died away on my lips, I\nsaid to myself that I should indeed help them to represent something\ninfamous, if, by pronouncing them, I should violate as rare a little\ncase of instinctive delicacy as any schoolroom, probably, had ever\nknown. When I said to myself: \"THEY have the manners to be silent, and\nyou, trusted as you are, the baseness to speak!\" I felt myself crimson\nand I covered my face with my hands. After these secret scenes I\nchattered more than ever, going on volubly enough till one of our\nprodigious, palpable hushes occurred--I can call them nothing else--the\nstrange, dizzy lift or swim (I try for terms!) into a stillness, a pause\nof all life, that had nothing to do with the more or less noise that at\nthe moment we might be engaged in making and that I could hear through\nany deepened exhilaration or quickened recitation or louder strum of the\npiano. Then it was that the others, the outsiders, were there. Though\nthey were not angels, they \"passed,\" as the French say, causing me,\nwhile they stayed, to tremble with the fear of their addressing to their\nyounger victims some yet more infernal message or more vivid image than\nthey had thought good enough for myself.\n\nWhat it was most impossible to get rid of was the cruel idea that,\nwhatever I had seen, Miles and Flora saw MORE--things terrible and\nunguessable and that sprang from dreadful passages of intercourse in the\npast. Such things naturally left on the surface, for the time, a chill\nwhich we vociferously denied that we felt; and we had, all three, with\nrepetition, got into such splendid training that we went, each time,\nalmost automatically, to mark the close of the incident, through the\nvery same movements. It was striking of the children, at all events,\nto kiss me inveterately with a kind of wild irrelevance and never to\nfail--one or the other--of the precious question that had helped us\nthrough many a peril. \"When do you think he WILL come? Don't you think\nwe OUGHT to write?\"--there was nothing like that inquiry, we found by\nexperience, for carrying off an awkwardness. \"He\" of course was their\nuncle in Harley Street; and we lived in much profusion of theory that he\nmight at any moment arrive to mingle in our circle. It was impossible to\nhave given less encouragement than he had done to such a doctrine, but\nif we had not had the doctrine to fall back upon we should have\ndeprived each other of some of our finest exhibitions. He never wrote to\nthem--that may have been selfish, but it was a part of the flattery of\nhis trust of me; for the way in which a man pays his highest tribute to\na woman is apt to be but by the more festal celebration of one of the\nsacred laws of his comfort; and I held that I carried out the spirit of\nthe pledge given not to appeal to him when I let my charges understand\nthat their own letters were but charming literary exercises. They were\ntoo beautiful to be posted; I kept them myself; I have them all to this\nhour. This was a rule indeed which only added to the satiric effect of\nmy being plied with the supposition that he might at any moment be among\nus. It was exactly as if my charges knew how almost more awkward than\nanything else that might be for me. There appears to me, moreover, as\nI look back, no note in all this more extraordinary than the mere fact\nthat, in spite of my tension and of their triumph, I never lost patience\nwith them. Adorable they must in truth have been, I now reflect, that I\ndidn't in these days hate them! Would exasperation, however, if relief\nhad longer been postponed, finally have betrayed me? It little matters,\nfor relief arrived. I call it relief, though it was only the relief that\na snap brings to a strain or the burst of a thunderstorm to a day of\nsuffocation. It was at least change, and it came with a rush.\n\n\n\n\nXIV\n\n\nWalking to church a certain Sunday morning, I had little Miles at my\nside and his sister, in advance of us and at Mrs. Grose's, well in\nsight. It was a crisp, clear day, the first of its order for some time;\nthe night had brought a touch of frost, and the autumn air, bright\nand sharp, made the church bells almost gay. It was an odd accident of\nthought that I should have happened at such a moment to be particularly\nand very gratefully struck with the obedience of my little charges. Why\ndid they never resent my inexorable, my perpetual society? Something or\nother had brought nearer home to me that I had all but pinned the boy to\nmy shawl and that, in the way our companions were marshaled before me,\nI might have appeared to provide against some danger of rebellion. I\nwas like a gaoler with an eye to possible surprises and escapes. But all\nthis belonged--I mean their magnificent little surrender--just to the\nspecial array of the facts that were most abysmal. Turned out for Sunday\nby his uncle's tailor, who had had a free hand and a notion of\npretty waistcoats and of his grand little air, Miles's whole title to\nindependence, the rights of his sex and situation, were so stamped upon\nhim that if he had suddenly struck for freedom I should have had nothing\nto say. I was by the strangest of chances wondering how I should meet\nhim when the revolution unmistakably occurred. I call it a revolution\nbecause I now see how, with the word he spoke, the curtain rose on the\nlast act of my dreadful drama, and the catastrophe was precipitated.\n\"Look here, my dear, you know,\" he charmingly said, \"when in the world,\nplease, am I going back to school?\"\n\nTranscribed here the speech sounds harmless enough, particularly\nas uttered in the sweet, high, casual pipe with which, at all\ninterlocutors, but above all at his eternal governess, he threw off\nintonations as if he were tossing roses. There was something in\nthem that always made one \"catch,\" and I caught, at any rate, now so\neffectually that I stopped as short as if one of the trees of the\npark had fallen across the road. There was something new, on the spot,\nbetween us, and he was perfectly aware that I recognized it, though,\nto enable me to do so, he had no need to look a whit less candid and\ncharming than usual. I could feel in him how he already, from my at\nfirst finding nothing to reply, perceived the advantage he had gained. I\nwas so slow to find anything that he had plenty of time, after a minute,\nto continue with his suggestive but inconclusive smile: \"You know, my\ndear, that for a fellow to be with a lady ALWAYS--!\" His \"my dear\" was\nconstantly on his lips for me, and nothing could have expressed more the\nexact shade of the sentiment with which I desired to inspire my pupils\nthan its fond familiarity. It was so respectfully easy.\n\nBut, oh, how I felt that at present I must pick my own phrases! I\nremember that, to gain time, I tried to laugh, and I seemed to see in\nthe beautiful face with which he watched me how ugly and queer I looked.\n\"And always with the same lady?\" I returned.\n\nHe neither blanched nor winked. The whole thing was virtually out\nbetween us. \"Ah, of course, she's a jolly, 'perfect' lady; but, after\nall, I'm a fellow, don't you see? that's--well, getting on.\"\n\nI lingered there with him an instant ever so kindly. \"Yes, you're\ngetting on.\" Oh, but I felt helpless!\n\nI have kept to this day the heartbreaking little idea of how he seemed\nto know that and to play with it. \"And you can't say I've not been\nawfully good, can you?\"\n\nI laid my hand on his shoulder, for, though I felt how much better it\nwould have been to walk on, I was not yet quite able. \"No, I can't say\nthat, Miles.\"\n\n\"Except just that one night, you know--!\"\n\n\"That one night?\" I couldn't look as straight as he.\n\n\"Why, when I went down--went out of the house.\"\n\n\"Oh, yes. But I forget what you did it for.\"\n\n\"You forget?\"--he spoke with the sweet extravagance of childish\nreproach. \"Why, it was to show you I could!\"\n\n\"Oh, yes, you could.\"\n\n\"And I can again.\"\n\nI felt that I might, perhaps, after all, succeed in keeping my wits\nabout me. \"Certainly. But you won't.\"\n\n\"No, not THAT again. It was nothing.\"\n\n\"It was nothing,\" I said. \"But we must go on.\"\n\nHe resumed our walk with me, passing his hand into my arm. \"Then when AM\nI going back?\"\n\nI wore, in turning it over, my most responsible air. \"Were you very\nhappy at school?\"\n\nHe just considered. \"Oh, I'm happy enough anywhere!\"\n\n\"Well, then,\" I quavered, \"if you're just as happy here--!\"\n\n\"Ah, but that isn't everything! Of course YOU know a lot--\"\n\n\"But you hint that you know almost as much?\" I risked as he paused.\n\n\"Not half I want to!\" Miles honestly professed. \"But it isn't so much\nthat.\"\n\n\"What is it, then?\"\n\n\"Well--I want to see more life.\"\n\n\"I see; I see.\" We had arrived within sight of the church and of various\npersons, including several of the household of Bly, on their way to it\nand clustered about the door to see us go in. I quickened our step;\nI wanted to get there before the question between us opened up much\nfurther; I reflected hungrily that, for more than an hour, he would have\nto be silent; and I thought with envy of the comparative dusk of the pew\nand of the almost spiritual help of the hassock on which I might bend\nmy knees. I seemed literally to be running a race with some confusion\nto which he was about to reduce me, but I felt that he had got in first\nwhen, before we had even entered the churchyard, he threw out--\n\n\"I want my own sort!\"\n\nIt literally made me bound forward. \"There are not many of your own\nsort, Miles!\" I laughed. \"Unless perhaps dear little Flora!\"\n\n\"You really compare me to a baby girl?\"\n\nThis found me singularly weak. \"Don't you, then, LOVE our sweet Flora?\"\n\n\"If I didn't--and you, too; if I didn't--!\" he repeated as if retreating\nfor a jump, yet leaving his thought so unfinished that, after we had\ncome into the gate, another stop, which he imposed on me by the pressure\nof his arm, had become inevitable. Mrs. Grose and Flora had passed into\nthe church, the other worshippers had followed, and we were, for the\nminute, alone among the old, thick graves. We had paused, on the path\nfrom the gate, by a low, oblong, tablelike tomb.\n\n\"Yes, if you didn't--?\"\n\nHe looked, while I waited, at the graves. \"Well, you know what!\" But\nhe didn't move, and he presently produced something that made me drop\nstraight down on the stone slab, as if suddenly to rest. \"Does my uncle\nthink what YOU think?\"\n\nI markedly rested. \"How do you know what I think?\"\n\n\"Ah, well, of course I don't; for it strikes me you never tell me. But I\nmean does HE know?\"\n\n\"Know what, Miles?\"\n\n\"Why, the way I'm going on.\"\n\nI perceived quickly enough that I could make, to this inquiry, no answer\nthat would not involve something of a sacrifice of my employer. Yet it\nappeared to me that we were all, at Bly, sufficiently sacrificed to make\nthat venial. \"I don't think your uncle much cares.\"\n\nMiles, on this, stood looking at me. \"Then don't you think he can be\nmade to?\"\n\n\"In what way?\"\n\n\"Why, by his coming down.\"\n\n\"But who'll get him to come down?\"\n\n\"_I_ will!\" the boy said with extraordinary brightness and emphasis. He\ngave me another look charged with that expression and then marched off\nalone into church.\n\n\n\n\nXV\n\n\nThe business was practically settled from the moment I never followed\nhim. It was a pitiful surrender to agitation, but my being aware of this\nhad somehow no power to restore me. I only sat there on my tomb and read\ninto what my little friend had said to me the fullness of its meaning;\nby the time I had grasped the whole of which I had also embraced, for\nabsence, the pretext that I was ashamed to offer my pupils and the rest\nof the congregation such an example of delay. What I said to myself\nabove all was that Miles had got something out of me and that the proof\nof it, for him, would be just this awkward collapse. He had got out\nof me that there was something I was much afraid of and that he should\nprobably be able to make use of my fear to gain, for his own purpose,\nmore freedom. My fear was of having to deal with the intolerable\nquestion of the grounds of his dismissal from school, for that was\nreally but the question of the horrors gathered behind. That his uncle\nshould arrive to treat with me of these things was a solution that,\nstrictly speaking, I ought now to have desired to bring on; but I\ncould so little face the ugliness and the pain of it that I simply\nprocrastinated and lived from hand to mouth. The boy, to my deep\ndiscomposure, was immensely in the right, was in a position to say\nto me: \"Either you clear up with my guardian the mystery of this\ninterruption of my studies, or you cease to expect me to lead with you\na life that's so unnatural for a boy.\" What was so unnatural for the\nparticular boy I was concerned with was this sudden revelation of a\nconsciousness and a plan.\n\nThat was what really overcame me, what prevented my going in. I walked\nround the church, hesitating, hovering; I reflected that I had already,\nwith him, hurt myself beyond repair. Therefore I could patch up nothing,\nand it was too extreme an effort to squeeze beside him into the pew: he\nwould be so much more sure than ever to pass his arm into mine and make\nme sit there for an hour in close, silent contact with his commentary\non our talk. For the first minute since his arrival I wanted to get away\nfrom him. As I paused beneath the high east window and listened to the\nsounds of worship, I was taken with an impulse that might master me,\nI felt, completely should I give it the least encouragement. I might\neasily put an end to my predicament by getting away altogether. Here\nwas my chance; there was no one to stop me; I could give the whole thing\nup--turn my back and retreat. It was only a question of hurrying again,\nfor a few preparations, to the house which the attendance at church of\nso many of the servants would practically have left unoccupied. No one,\nin short, could blame me if I should just drive desperately off. What\nwas it to get away if I got away only till dinner? That would be in\na couple of hours, at the end of which--I had the acute prevision--my\nlittle pupils would play at innocent wonder about my nonappearance in\ntheir train.\n\n\"What DID you do, you naughty, bad thing? Why in the world, to worry us\nso--and take our thoughts off, too, don't you know?--did you desert us\nat the very door?\" I couldn't meet such questions nor, as they asked\nthem, their false little lovely eyes; yet it was all so exactly what I\nshould have to meet that, as the prospect grew sharp to me, I at last\nlet myself go.\n\nI got, so far as the immediate moment was concerned, away; I came\nstraight out of the churchyard and, thinking hard, retraced my steps\nthrough the park. It seemed to me that by the time I reached the house\nI had made up my mind I would fly. The Sunday stillness both of the\napproaches and of the interior, in which I met no one, fairly excited\nme with a sense of opportunity. Were I to get off quickly, this way, I\nshould get off without a scene, without a word. My quickness would have\nto be remarkable, however, and the question of a conveyance was the\ngreat one to settle. Tormented, in the hall, with difficulties\nand obstacles, I remember sinking down at the foot of the\nstaircase--suddenly collapsing there on the lowest step and then, with a\nrevulsion, recalling that it was exactly where more than a month before,\nin the darkness of night and just so bowed with evil things, I had\nseen the specter of the most horrible of women. At this I was able\nto straighten myself; I went the rest of the way up; I made, in my\nbewilderment, for the schoolroom, where there were objects belonging to\nme that I should have to take. But I opened the door to find again, in a\nflash, my eyes unsealed. In the presence of what I saw I reeled straight\nback upon my resistance.\n\nSeated at my own table in clear noonday light I saw a person whom,\nwithout my previous experience, I should have taken at the first blush\nfor some housemaid who might have stayed at home to look after the place\nand who, availing herself of rare relief from observation and of the\nschoolroom table and my pens, ink, and paper, had applied herself to the\nconsiderable effort of a letter to her sweetheart. There was an effort\nin the way that, while her arms rested on the table, her hands with\nevident weariness supported her head; but at the moment I took this in\nI had already become aware that, in spite of my entrance, her attitude\nstrangely persisted. Then it was--with the very act of its announcing\nitself--that her identity flared up in a change of posture. She rose,\nnot as if she had heard me, but with an indescribable grand melancholy\nof indifference and detachment, and, within a dozen feet of me, stood\nthere as my vile predecessor. Dishonored and tragic, she was all before\nme; but even as I fixed and, for memory, secured it, the awful image\npassed away. Dark as midnight in her black dress, her haggard beauty and\nher unutterable woe, she had looked at me long enough to appear to say\nthat her right to sit at my table was as good as mine to sit at hers.\nWhile these instants lasted, indeed, I had the extraordinary chill of\nfeeling that it was I who was the intruder. It was as a wild protest\nagainst it that, actually addressing her--\"You terrible, miserable\nwoman!\"--I heard myself break into a sound that, by the open door, rang\nthrough the long passage and the empty house. She looked at me as if\nshe heard me, but I had recovered myself and cleared the air. There was\nnothing in the room the next minute but the sunshine and a sense that I\nmust stay.\n\n\n\n\nXVI\n\n\nI had so perfectly expected that the return of my pupils would be marked\nby a demonstration that I was freshly upset at having to take into\naccount that they were dumb about my absence. Instead of gaily\ndenouncing and caressing me, they made no allusion to my having failed\nthem, and I was left, for the time, on perceiving that she too said\nnothing, to study Mrs. Grose's odd face. I did this to such purpose that\nI made sure they had in some way bribed her to silence; a silence that,\nhowever, I would engage to break down on the first private opportunity.\nThis opportunity came before tea: I secured five minutes with her in the\nhousekeeper's room, where, in the twilight, amid a smell of lately baked\nbread, but with the place all swept and garnished, I found her sitting\nin pained placidity before the fire. So I see her still, so I see her\nbest: facing the flame from her straight chair in the dusky, shining\nroom, a large clean image of the \"put away\"--of drawers closed and\nlocked and rest without a remedy.\n\n\"Oh, yes, they asked me to say nothing; and to please them--so long as\nthey were there--of course I promised. But what had happened to you?\"\n\n\"I only went with you for the walk,\" I said. \"I had then to come back to\nmeet a friend.\"\n\nShe showed her surprise. \"A friend--YOU?\"\n\n\"Oh, yes, I have a couple!\" I laughed. \"But did the children give you a\nreason?\"\n\n\"For not alluding to your leaving us? Yes; they said you would like it\nbetter. Do you like it better?\"\n\nMy face had made her rueful. \"No, I like it worse!\" But after an instant\nI added: \"Did they say why I should like it better?\"\n\n\"No; Master Miles only said, 'We must do nothing but what she likes!'\"\n\n\"I wish indeed he would. And what did Flora say?\"\n\n\"Miss Flora was too sweet. She said, 'Oh, of course, of course!'--and I\nsaid the same.\"\n\nI thought a moment. \"You were too sweet, too--I can hear you all. But\nnonetheless, between Miles and me, it's now all out.\"\n\n\"All out?\" My companion stared. \"But what, miss?\"\n\n\"Everything. It doesn't matter. I've made up my mind. I came home, my\ndear,\" I went on, \"for a talk with Miss Jessel.\"\n\nI had by this time formed the habit of having Mrs. Grose literally well\nin hand in advance of my sounding that note; so that even now, as\nshe bravely blinked under the signal of my word, I could keep her\ncomparatively firm. \"A talk! Do you mean she spoke?\"\n\n\"It came to that. I found her, on my return, in the schoolroom.\"\n\n\"And what did she say?\" I can hear the good woman still, and the candor\nof her stupefaction.\n\n\"That she suffers the torments--!\"\n\nIt was this, of a truth, that made her, as she filled out my picture,\ngape. \"Do you mean,\" she faltered, \"--of the lost?\"\n\n\"Of the lost. Of the damned. And that's why, to share them-\" I faltered\nmyself with the horror of it.\n\nBut my companion, with less imagination, kept me up. \"To share them--?\"\n\n\"She wants Flora.\" Mrs. Grose might, as I gave it to her, fairly have\nfallen away from me had I not been prepared. I still held her there, to\nshow I was. \"As I've told you, however, it doesn't matter.\"\n\n\"Because you've made up your mind? But to what?\"\n\n\"To everything.\"\n\n\"And what do you call 'everything'?\"\n\n\"Why, sending for their uncle.\"\n\n\"Oh, miss, in pity do,\" my friend broke out. \"ah, but I will, I WILL! I\nsee it's the only way. What's 'out,' as I told you, with Miles is that\nif he thinks I'm afraid to--and has ideas of what he gains by that--he\nshall see he's mistaken. Yes, yes; his uncle shall have it here from me\non the spot (and before the boy himself, if necessary) that if I'm to be\nreproached with having done nothing again about more school--\"\n\n\"Yes, miss--\" my companion pressed me.\n\n\"Well, there's that awful reason.\"\n\nThere were now clearly so many of these for my poor colleague that she\nwas excusable for being vague. \"But--a--which?\"\n\n\"Why, the letter from his old place.\"\n\n\"You'll show it to the master?\"\n\n\"I ought to have done so on the instant.\"\n\n\"Oh, no!\" said Mrs. Grose with decision.\n\n\"I'll put it before him,\" I went on inexorably, \"that I can't undertake\nto work the question on behalf of a child who has been expelled--\"\n\n\"For we've never in the least known what!\" Mrs. Grose declared.\n\n\"For wickedness. For what else--when he's so clever and beautiful and\nperfect? Is he stupid? Is he untidy? Is he infirm? Is he ill-natured?\nHe's exquisite--so it can be only THAT; and that would open up the whole\nthing. After all,\" I said, \"it's their uncle's fault. If he left here\nsuch people--!\"\n\n\"He didn't really in the least know them. The fault's mine.\" She had\nturned quite pale.\n\n\"Well, you shan't suffer,\" I answered.\n\n\"The children shan't!\" she emphatically returned.\n\nI was silent awhile; we looked at each other. \"Then what am I to tell\nhim?\"\n\n\"You needn't tell him anything. _I_'ll tell him.\"\n\nI measured this. \"Do you mean you'll write--?\" Remembering she couldn't,\nI caught myself up. \"How do you communicate?\"\n\n\"I tell the bailiff. HE writes.\"\n\n\"And should you like him to write our story?\"\n\nMy question had a sarcastic force that I had not fully intended, and\nit made her, after a moment, inconsequently break down. The tears were\nagain in her eyes. \"Ah, miss, YOU write!\"\n\n\"Well--tonight,\" I at last answered; and on this we separated.\n\n\n\n\nXVII\n\n\nI went so far, in the evening, as to make a beginning. The weather had\nchanged back, a great wind was abroad, and beneath the lamp, in my room,\nwith Flora at peace beside me, I sat for a long time before a blank\nsheet of paper and listened to the lash of the rain and the batter of\nthe gusts. Finally I went out, taking a candle; I crossed the passage\nand listened a minute at Miles's door. What, under my endless obsession,\nI had been impelled to listen for was some betrayal of his not being at\nrest, and I presently caught one, but not in the form I had expected.\nHis voice tinkled out. \"I say, you there--come in.\" It was a gaiety in\nthe gloom!\n\nI went in with my light and found him, in bed, very wide awake, but very\nmuch at his ease. \"Well, what are YOU up to?\" he asked with a grace of\nsociability in which it occurred to me that Mrs. Grose, had she been\npresent, might have looked in vain for proof that anything was \"out.\"\n\nI stood over him with my candle. \"How did you know I was there?\"\n\n\"Why, of course I heard you. Did you fancy you made no noise? You're\nlike a troop of cavalry!\" he beautifully laughed.\n\n\"Then you weren't asleep?\"\n\n\"Not much! I lie awake and think.\"\n\nI had put my candle, designedly, a short way off, and then, as he held\nout his friendly old hand to me, had sat down on the edge of his bed.\n\"What is it,\" I asked, \"that you think of?\"\n\n\"What in the world, my dear, but YOU?\"\n\n\"Ah, the pride I take in your appreciation doesn't insist on that! I had\nso far rather you slept.\"\n\n\"Well, I think also, you know, of this queer business of ours.\"\n\nI marked the coolness of his firm little hand. \"Of what queer business,\nMiles?\"\n\n\"Why, the way you bring me up. And all the rest!\"\n\nI fairly held my breath a minute, and even from my glimmering taper\nthere was light enough to show how he smiled up at me from his pillow.\n\"What do you mean by all the rest?\"\n\n\"Oh, you know, you know!\"\n\nI could say nothing for a minute, though I felt, as I held his hand and\nour eyes continued to meet, that my silence had all the air of admitting\nhis charge and that nothing in the whole world of reality was perhaps at\nthat moment so fabulous as our actual relation. \"Certainly you shall go\nback to school,\" I said, \"if it be that that troubles you. But not to\nthe old place--we must find another, a better. How could I know it did\ntrouble you, this question, when you never told me so, never spoke of it\nat all?\" His clear, listening face, framed in its smooth whiteness, made\nhim for the minute as appealing as some wistful patient in a children's\nhospital; and I would have given, as the resemblance came to me, all I\npossessed on earth really to be the nurse or the sister of charity who\nmight have helped to cure him. Well, even as it was, I perhaps might\nhelp! \"Do you know you've never said a word to me about your school--I\nmean the old one; never mentioned it in any way?\"\n\nHe seemed to wonder; he smiled with the same loveliness. But he clearly\ngained time; he waited, he called for guidance. \"Haven't I?\" It wasn't\nfor ME to help him--it was for the thing I had met!\n\nSomething in his tone and the expression of his face, as I got this from\nhim, set my heart aching with such a pang as it had never yet known;\nso unutterably touching was it to see his little brain puzzled and his\nlittle resources taxed to play, under the spell laid on him, a part\nof innocence and consistency. \"No, never--from the hour you came back.\nYou've never mentioned to me one of your masters, one of your comrades,\nnor the least little thing that ever happened to you at school. Never,\nlittle Miles--no, never--have you given me an inkling of anything that\nMAY have happened there. Therefore you can fancy how much I'm in the\ndark. Until you came out, that way, this morning, you had, since the\nfirst hour I saw you, scarce even made a reference to anything in your\nprevious life. You seemed so perfectly to accept the present.\" It was\nextraordinary how my absolute conviction of his secret precocity (or\nwhatever I might call the poison of an influence that I dared but half\nto phrase) made him, in spite of the faint breath of his inward trouble,\nappear as accessible as an older person--imposed him almost as an\nintellectual equal. \"I thought you wanted to go on as you are.\"\n\nIt struck me that at this he just faintly colored. He gave, at any rate,\nlike a convalescent slightly fatigued, a languid shake of his head. \"I\ndon't--I don't. I want to get away.\"\n\n\"You're tired of Bly?\"\n\n\"Oh, no, I like Bly.\"\n\n\"Well, then--?\"\n\n\"Oh, YOU know what a boy wants!\"\n\nI felt that I didn't know so well as Miles, and I took temporary refuge.\n\"You want to go to your uncle?\"\n\nAgain, at this, with his sweet ironic face, he made a movement on the\npillow. \"Ah, you can't get off with that!\"\n\nI was silent a little, and it was I, now, I think, who changed color.\n\"My dear, I don't want to get off!\"\n\n\"You can't, even if you do. You can't, you can't!\"--he lay beautifully\nstaring. \"My uncle must come down, and you must completely settle\nthings.\"\n\n\"If we do,\" I returned with some spirit, \"you may be sure it will be to\ntake you quite away.\"\n\n\"Well, don't you understand that that's exactly what I'm working for?\nYou'll have to tell him--about the way you've let it all drop: you'll\nhave to tell him a tremendous lot!\"\n\nThe exultation with which he uttered this helped me somehow, for the\ninstant, to meet him rather more. \"And how much will YOU, Miles, have to\ntell him? There are things he'll ask you!\"\n\nHe turned it over. \"Very likely. But what things?\"\n\n\"The things you've never told me. To make up his mind what to do with\nyou. He can't send you back--\"\n\n\"Oh, I don't want to go back!\" he broke in. \"I want a new field.\"\n\nHe said it with admirable serenity, with positive unimpeachable\ngaiety; and doubtless it was that very note that most evoked for me the\npoignancy, the unnatural childish tragedy, of his probable reappearance\nat the end of three months with all this bravado and still more\ndishonor. It overwhelmed me now that I should never be able to bear\nthat, and it made me let myself go. I threw myself upon him and in the\ntenderness of my pity I embraced him. \"Dear little Miles, dear little\nMiles--!\"\n\nMy face was close to his, and he let me kiss him, simply taking it with\nindulgent good humor. \"Well, old lady?\"\n\n\"Is there nothing--nothing at all that you want to tell me?\"\n\nHe turned off a little, facing round toward the wall and holding up his\nhand to look at as one had seen sick children look. \"I've told you--I\ntold you this morning.\"\n\nOh, I was sorry for him! \"That you just want me not to worry you?\"\n\nHe looked round at me now, as if in recognition of my understanding him;\nthen ever so gently, \"To let me alone,\" he replied.\n\nThere was even a singular little dignity in it, something that made me\nrelease him, yet, when I had slowly risen, linger beside him. God knows\nI never wished to harass him, but I felt that merely, at this, to turn\nmy back on him was to abandon or, to put it more truly, to lose him.\n\"I've just begun a letter to your uncle,\" I said.\n\n\"Well, then, finish it!\"\n\nI waited a minute. \"What happened before?\"\n\nHe gazed up at me again. \"Before what?\"\n\n\"Before you came back. And before you went away.\"\n\nFor some time he was silent, but he continued to meet my eyes. \"What\nhappened?\"\n\nIt made me, the sound of the words, in which it seemed to me that\nI caught for the very first time a small faint quaver of consenting\nconsciousness--it made me drop on my knees beside the bed and seize\nonce more the chance of possessing him. \"Dear little Miles, dear little\nMiles, if you KNEW how I want to help you! It's only that, it's nothing\nbut that, and I'd rather die than give you a pain or do you a wrong--I'd\nrather die than hurt a hair of you. Dear little Miles\"--oh, I brought it\nout now even if I SHOULD go too far--\"I just want you to help me to save\nyou!\" But I knew in a moment after this that I had gone too far. The\nanswer to my appeal was instantaneous, but it came in the form of an\nextraordinary blast and chill, a gust of frozen air, and a shake of the\nroom as great as if, in the wild wind, the casement had crashed in. The\nboy gave a loud, high shriek, which, lost in the rest of the shock of\nsound, might have seemed, indistinctly, though I was so close to him,\na note either of jubilation or of terror. I jumped to my feet again and\nwas conscious of darkness. So for a moment we remained, while I stared\nabout me and saw that the drawn curtains were unstirred and the window\ntight. \"Why, the candle's out!\" I then cried.\n\n\"It was I who blew it, dear!\" said Miles.\n\n\n\n\nXVIII\n\n\nThe next day, after lessons, Mrs. Grose found a moment to say to me\nquietly: \"Have you written, miss?\"\n\n\"Yes--I've written.\" But I didn't add--for the hour--that my letter,\nsealed and directed, was still in my pocket. There would be time enough\nto send it before the messenger should go to the village. Meanwhile\nthere had been, on the part of my pupils, no more brilliant, more\nexemplary morning. It was exactly as if they had both had at heart to\ngloss over any recent little friction. They performed the dizziest feats\nof arithmetic, soaring quite out of MY feeble range, and perpetrated,\nin higher spirits than ever, geographical and historical jokes. It was\nconspicuous of course in Miles in particular that he appeared to wish to\nshow how easily he could let me down. This child, to my memory, really\nlives in a setting of beauty and misery that no words can translate;\nthere was a distinction all his own in every impulse he revealed; never\nwas a small natural creature, to the uninitiated eye all frankness and\nfreedom, a more ingenious, a more extraordinary little gentleman. I had\nperpetually to guard against the wonder of contemplation into which my\ninitiated view betrayed me; to check the irrelevant gaze and discouraged\nsigh in which I constantly both attacked and renounced the enigma of\nwhat such a little gentleman could have done that deserved a penalty.\nSay that, by the dark prodigy I knew, the imagination of all evil HAD\nbeen opened up to him: all the justice within me ached for the proof\nthat it could ever have flowered into an act.\n\nHe had never, at any rate, been such a little gentleman as when, after\nour early dinner on this dreadful day, he came round to me and asked if\nI shouldn't like him, for half an hour, to play to me. David playing\nto Saul could never have shown a finer sense of the occasion. It was\nliterally a charming exhibition of tact, of magnanimity, and quite\ntantamount to his saying outright: \"The true knights we love to read\nabout never push an advantage too far. I know what you mean now: you\nmean that--to be let alone yourself and not followed up--you'll cease to\nworry and spy upon me, won't keep me so close to you, will let me go\nand come. Well, I 'come,' you see--but I don't go! There'll be plenty of\ntime for that. I do really delight in your society, and I only want to\nshow you that I contended for a principle.\" It may be imagined whether I\nresisted this appeal or failed to accompany him again, hand in hand, to\nthe schoolroom. He sat down at the old piano and played as he had never\nplayed; and if there are those who think he had better have been kicking\na football I can only say that I wholly agree with them. For at the\nend of a time that under his influence I had quite ceased to measure, I\nstarted up with a strange sense of having literally slept at my post. It\nwas after luncheon, and by the schoolroom fire, and yet I hadn't\nreally, in the least, slept: I had only done something much worse--I had\nforgotten. Where, all this time, was Flora? When I put the question to\nMiles, he played on a minute before answering and then could only say:\n\"Why, my dear, how do _I_ know?\"--breaking moreover into a happy laugh\nwhich, immediately after, as if it were a vocal accompaniment, he\nprolonged into incoherent, extravagant song.\n\nI went straight to my room, but his sister was not there; then, before\ngoing downstairs, I looked into several others. As she was nowhere\nabout she would surely be with Mrs. Grose, whom, in the comfort of that\ntheory, I accordingly proceeded in quest of. I found her where I had\nfound her the evening before, but she met my quick challenge with blank,\nscared ignorance. She had only supposed that, after the repast, I had\ncarried off both the children; as to which she was quite in her right,\nfor it was the very first time I had allowed the little girl out of my\nsight without some special provision. Of course now indeed she might be\nwith the maids, so that the immediate thing was to look for her without\nan air of alarm. This we promptly arranged between us; but when, ten\nminutes later and in pursuance of our arrangement, we met in the hall,\nit was only to report on either side that after guarded inquiries we\nhad altogether failed to trace her. For a minute there, apart from\nobservation, we exchanged mute alarms, and I could feel with what high\ninterest my friend returned me all those I had from the first given her.\n\n\"She'll be above,\" she presently said--\"in one of the rooms you haven't\nsearched.\"\n\n\"No; she's at a distance.\" I had made up my mind. \"She has gone out.\"\n\nMrs. Grose stared. \"Without a hat?\"\n\nI naturally also looked volumes. \"Isn't that woman always without one?\"\n\n\"She's with HER?\"\n\n\"She's with HER!\" I declared. \"We must find them.\"\n\nMy hand was on my friend's arm, but she failed for the moment,\nconfronted with such an account of the matter, to respond to my\npressure. She communed, on the contrary, on the spot, with her\nuneasiness. \"And where's Master Miles?\"\n\n\"Oh, HE'S with Quint. They're in the schoolroom.\"\n\n\"Lord, miss!\" My view, I was myself aware--and therefore I suppose my\ntone--had never yet reached so calm an assurance.\n\n\"The trick's played,\" I went on; \"they've successfully worked their\nplan. He found the most divine little way to keep me quiet while she\nwent off.\"\n\n\"'Divine'?\" Mrs. Grose bewilderedly echoed.\n\n\"Infernal, then!\" I almost cheerfully rejoined. \"He has provided for\nhimself as well. But come!\"\n\nShe had helplessly gloomed at the upper regions. \"You leave him--?\"\n\n\"So long with Quint? Yes--I don't mind that now.\"\n\nShe always ended, at these moments, by getting possession of my hand,\nand in this manner she could at present still stay me. But after gasping\nan instant at my sudden resignation, \"Because of your letter?\" she\neagerly brought out.\n\nI quickly, by way of answer, felt for my letter, drew it forth, held it\nup, and then, freeing myself, went and laid it on the great hall table.\n\"Luke will take it,\" I said as I came back. I reached the house door and\nopened it; I was already on the steps.\n\nMy companion still demurred: the storm of the night and the early\nmorning had dropped, but the afternoon was damp and gray. I came down to\nthe drive while she stood in the doorway. \"You go with nothing on?\"\n\n\"What do I care when the child has nothing? I can't wait to dress,\" I\ncried, \"and if you must do so, I leave you. Try meanwhile, yourself,\nupstairs.\"\n\n\"With THEM?\" Oh, on this, the poor woman promptly joined me!\n\n\n\n\nXIX\n\n\nWe went straight to the lake, as it was called at Bly, and I daresay\nrightly called, though I reflect that it may in fact have been a sheet\nof water less remarkable than it appeared to my untraveled eyes. My\nacquaintance with sheets of water was small, and the pool of Bly, at all\nevents on the few occasions of my consenting, under the protection of\nmy pupils, to affront its surface in the old flat-bottomed boat moored\nthere for our use, had impressed me both with its extent and its\nagitation. The usual place of embarkation was half a mile from the\nhouse, but I had an intimate conviction that, wherever Flora might\nbe, she was not near home. She had not given me the slip for any small\nadventure, and, since the day of the very great one that I had shared\nwith her by the pond, I had been aware, in our walks, of the quarter to\nwhich she most inclined. This was why I had now given to Mrs. Grose's\nsteps so marked a direction--a direction that made her, when she\nperceived it, oppose a resistance that showed me she was freshly\nmystified. \"You're going to the water, Miss?--you think she's IN--?\"\n\n\"She may be, though the depth is, I believe, nowhere very great. But\nwhat I judge most likely is that she's on the spot from which, the other\nday, we saw together what I told you.\"\n\n\"When she pretended not to see--?\"\n\n\"With that astounding self-possession? I've always been sure she wanted\nto go back alone. And now her brother has managed it for her.\"\n\nMrs. Grose still stood where she had stopped. \"You suppose they really\nTALK of them?\"\n\n\"I could meet this with a confidence! They say things that, if we heard\nthem, would simply appall us.\"\n\n\"And if she IS there--\"\n\n\"Yes?\"\n\n\"Then Miss Jessel is?\"\n\n\"Beyond a doubt. You shall see.\"\n\n\"Oh, thank you!\" my friend cried, planted so firm that, taking it in, I\nwent straight on without her. By the time I reached the pool, however,\nshe was close behind me, and I knew that, whatever, to her apprehension,\nmight befall me, the exposure of my society struck her as her least\ndanger. She exhaled a moan of relief as we at last came in sight of the\ngreater part of the water without a sight of the child. There was no\ntrace of Flora on that nearer side of the bank where my observation of\nher had been most startling, and none on the opposite edge, where, save\nfor a margin of some twenty yards, a thick copse came down to the water.\nThe pond, oblong in shape, had a width so scant compared to its length\nthat, with its ends out of view, it might have been taken for a scant\nriver. We looked at the empty expanse, and then I felt the suggestion\nof my friend's eyes. I knew what she meant and I replied with a negative\nheadshake.\n\n\"No, no; wait! She has taken the boat.\"\n\nMy companion stared at the vacant mooring place and then again across\nthe lake. \"Then where is it?\"\n\n\"Our not seeing it is the strongest of proofs. She has used it to go\nover, and then has managed to hide it.\"\n\n\"All alone--that child?\"\n\n\"She's not alone, and at such times she's not a child: she's an old,\nold woman.\" I scanned all the visible shore while Mrs. Grose took again,\ninto the queer element I offered her, one of her plunges of submission;\nthen I pointed out that the boat might perfectly be in a small refuge\nformed by one of the recesses of the pool, an indentation masked, for\nthe hither side, by a projection of the bank and by a clump of trees\ngrowing close to the water.\n\n\"But if the boat's there, where on earth's SHE?\" my colleague anxiously\nasked.\n\n\"That's exactly what we must learn.\" And I started to walk further.\n\n\"By going all the way round?\"\n\n\"Certainly, far as it is. It will take us but ten minutes, but it's\nfar enough to have made the child prefer not to walk. She went straight\nover.\"\n\n\"Laws!\" cried my friend again; the chain of my logic was ever too\nmuch for her. It dragged her at my heels even now, and when we had got\nhalfway round--a devious, tiresome process, on ground much broken and by\na path choked with overgrowth--I paused to give her breath. I sustained\nher with a grateful arm, assuring her that she might hugely help me; and\nthis started us afresh, so that in the course of but few minutes more we\nreached a point from which we found the boat to be where I had supposed\nit. It had been intentionally left as much as possible out of sight and\nwas tied to one of the stakes of a fence that came, just there, down to\nthe brink and that had been an assistance to disembarking. I recognized,\nas I looked at the pair of short, thick oars, quite safely drawn up, the\nprodigious character of the feat for a little girl; but I had lived, by\nthis time, too long among wonders and had panted to too many livelier\nmeasures. There was a gate in the fence, through which we passed, and\nthat brought us, after a trifling interval, more into the open. Then,\n\"There she is!\" we both exclaimed at once.\n\nFlora, a short way off, stood before us on the grass and smiled as if\nher performance was now complete. The next thing she did, however, was\nto stoop straight down and pluck--quite as if it were all she was there\nfor--a big, ugly spray of withered fern. I instantly became sure she\nhad just come out of the copse. She waited for us, not herself taking a\nstep, and I was conscious of the rare solemnity with which we presently\napproached her. She smiled and smiled, and we met; but it was all done\nin a silence by this time flagrantly ominous. Mrs. Grose was the first\nto break the spell: she threw herself on her knees and, drawing the\nchild to her breast, clasped in a long embrace the little tender,\nyielding body. While this dumb convulsion lasted I could only watch\nit--which I did the more intently when I saw Flora's face peep at me\nover our companion's shoulder. It was serious now--the flicker had left\nit; but it strengthened the pang with which I at that moment envied Mrs.\nGrose the simplicity of HER relation. Still, all this while, nothing\nmore passed between us save that Flora had let her foolish fern again\ndrop to the ground. What she and I had virtually said to each other was\nthat pretexts were useless now. When Mrs. Grose finally got up she kept\nthe child's hand, so that the two were still before me; and the singular\nreticence of our communion was even more marked in the frank look she\nlaunched me. \"I'll be hanged,\" it said, \"if _I_'ll speak!\"\n\nIt was Flora who, gazing all over me in candid wonder, was the first.\nShe was struck with our bareheaded aspect. \"Why, where are your things?\"\n\n\"Where yours are, my dear!\" I promptly returned.\n\nShe had already got back her gaiety, and appeared to take this as an\nanswer quite sufficient. \"And where's Miles?\" she went on.\n\nThere was something in the small valor of it that quite finished me:\nthese three words from her were, in a flash like the glitter of a drawn\nblade, the jostle of the cup that my hand, for weeks and weeks, had\nheld high and full to the brim that now, even before speaking, I felt\noverflow in a deluge. \"I'll tell you if you'll tell ME--\" I heard myself\nsay, then heard the tremor in which it broke.\n\n\"Well, what?\"\n\nMrs. Grose's suspense blazed at me, but it was too late now, and I\nbrought the thing out handsomely. \"Where, my pet, is Miss Jessel?\"\n\n\n\n\nXX\n\n\nJust as in the churchyard with Miles, the whole thing was upon us. Much\nas I had made of the fact that this name had never once, between us,\nbeen sounded, the quick, smitten glare with which the child's face now\nreceived it fairly likened my breach of the silence to the smash of a\npane of glass. It added to the interposing cry, as if to stay the blow,\nthat Mrs. Grose, at the same instant, uttered over my violence--the\nshriek of a creature scared, or rather wounded, which, in turn, within a\nfew seconds, was completed by a gasp of my own. I seized my colleague's\narm. \"She's there, she's there!\"\n\nMiss Jessel stood before us on the opposite bank exactly as she had\nstood the other time, and I remember, strangely, as the first feeling\nnow produced in me, my thrill of joy at having brought on a proof. She\nwas there, and I was justified; she was there, and I was neither cruel\nnor mad. She was there for poor scared Mrs. Grose, but she was there\nmost for Flora; and no moment of my monstrous time was perhaps so\nextraordinary as that in which I consciously threw out to her--with\nthe sense that, pale and ravenous demon as she was, she would catch and\nunderstand it--an inarticulate message of gratitude. She rose erect on\nthe spot my friend and I had lately quitted, and there was not, in all\nthe long reach of her desire, an inch of her evil that fell short. This\nfirst vividness of vision and emotion were things of a few seconds,\nduring which Mrs. Grose's dazed blink across to where I pointed struck\nme as a sovereign sign that she too at last saw, just as it carried my\nown eyes precipitately to the child. The revelation then of the manner\nin which Flora was affected startled me, in truth, far more than it\nwould have done to find her also merely agitated, for direct dismay\nwas of course not what I had expected. Prepared and on her guard as our\npursuit had actually made her, she would repress every betrayal; and I\nwas therefore shaken, on the spot, by my first glimpse of the particular\none for which I had not allowed. To see her, without a convulsion of\nher small pink face, not even feign to glance in the direction of the\nprodigy I announced, but only, instead of that, turn at ME an expression\nof hard, still gravity, an expression absolutely new and unprecedented\nand that appeared to read and accuse and judge me--this was a stroke\nthat somehow converted the little girl herself into the very presence\nthat could make me quail. I quailed even though my certitude that\nshe thoroughly saw was never greater than at that instant, and in the\nimmediate need to defend myself I called it passionately to witness.\n\"She's there, you little unhappy thing--there, there, THERE, and you see\nher as well as you see me!\" I had said shortly before to Mrs. Grose\nthat she was not at these times a child, but an old, old woman, and that\ndescription of her could not have been more strikingly confirmed than in\nthe way in which, for all answer to this, she simply showed me, without\na concession, an admission, of her eyes, a countenance of deeper and\ndeeper, of indeed suddenly quite fixed, reprobation. I was by this\ntime--if I can put the whole thing at all together--more appalled at\nwhat I may properly call her manner than at anything else, though it was\nsimultaneously with this that I became aware of having Mrs. Grose\nalso, and very formidably, to reckon with. My elder companion, the next\nmoment, at any rate, blotted out everything but her own flushed face and\nher loud, shocked protest, a burst of high disapproval. \"What a dreadful\nturn, to be sure, miss! Where on earth do you see anything?\"\n\nI could only grasp her more quickly yet, for even while she spoke the\nhideous plain presence stood undimmed and undaunted. It had already\nlasted a minute, and it lasted while I continued, seizing my colleague,\nquite thrusting her at it and presenting her to it, to insist with my\npointing hand. \"You don't see her exactly as WE see?--you mean to say\nyou don't now--NOW? She's as big as a blazing fire! Only look, dearest\nwoman, LOOK--!\" She looked, even as I did, and gave me, with her deep\ngroan of negation, repulsion, compassion--the mixture with her pity of\nher relief at her exemption--a sense, touching to me even then, that she\nwould have backed me up if she could. I might well have needed that, for\nwith this hard blow of the proof that her eyes were hopelessly sealed\nI felt my own situation horribly crumble, I felt--I saw--my livid\npredecessor press, from her position, on my defeat, and I was conscious,\nmore than all, of what I should have from this instant to deal with in\nthe astounding little attitude of Flora. Into this attitude Mrs. Grose\nimmediately and violently entered, breaking, even while there pierced\nthrough my sense of ruin a prodigious private triumph, into breathless\nreassurance.\n\n\"She isn't there, little lady, and nobody's there--and you never see\nnothing, my sweet! How can poor Miss Jessel--when poor Miss Jessel's\ndead and buried? WE know, don't we, love?\"--and she appealed, blundering\nin, to the child. \"It's all a mere mistake and a worry and a joke--and\nwe'll go home as fast as we can!\"\n\nOur companion, on this, had responded with a strange, quick primness of\npropriety, and they were again, with Mrs. Grose on her feet, united, as\nit were, in pained opposition to me. Flora continued to fix me with\nher small mask of reprobation, and even at that minute I prayed God to\nforgive me for seeming to see that, as she stood there holding tight\nto our friend's dress, her incomparable childish beauty had suddenly\nfailed, had quite vanished. I've said it already--she was literally,\nshe was hideously, hard; she had turned common and almost ugly. \"I don't\nknow what you mean. I see nobody. I see nothing. I never HAVE. I think\nyou're cruel. I don't like you!\" Then, after this deliverance, which\nmight have been that of a vulgarly pert little girl in the street, she\nhugged Mrs. Grose more closely and buried in her skirts the dreadful\nlittle face. In this position she produced an almost furious wail. \"Take\nme away, take me away--oh, take me away from HER!\"\n\n\"From ME?\" I panted.\n\n\"From you--from you!\" she cried.\n\nEven Mrs. Grose looked across at me dismayed, while I had nothing to\ndo but communicate again with the figure that, on the opposite bank,\nwithout a movement, as rigidly still as if catching, beyond the\ninterval, our voices, was as vividly there for my disaster as it was not\nthere for my service. The wretched child had spoken exactly as if she\nhad got from some outside source each of her stabbing little words, and\nI could therefore, in the full despair of all I had to accept, but sadly\nshake my head at her. \"If I had ever doubted, all my doubt would at\npresent have gone. I've been living with the miserable truth, and now\nit has only too much closed round me. Of course I've lost you: I've\ninterfered, and you've seen--under HER dictation\"--with which I faced,\nover the pool again, our infernal witness--\"the easy and perfect way to\nmeet it. I've done my best, but I've lost you. Goodbye.\" For Mrs.\nGrose I had an imperative, an almost frantic \"Go, go!\" before which, in\ninfinite distress, but mutely possessed of the little girl and clearly\nconvinced, in spite of her blindness, that something awful had occurred\nand some collapse engulfed us, she retreated, by the way we had come, as\nfast as she could move.\n\nOf what first happened when I was left alone I had no subsequent memory.\nI only knew that at the end of, I suppose, a quarter of an hour, an\nodorous dampness and roughness, chilling and piercing my trouble, had\nmade me understand that I must have thrown myself, on my face, on the\nground and given way to a wildness of grief. I must have lain there long\nand cried and sobbed, for when I raised my head the day was almost done.\nI got up and looked a moment, through the twilight, at the gray pool and\nits blank, haunted edge, and then I took, back to the house, my dreary\nand difficult course. When I reached the gate in the fence the boat,\nto my surprise, was gone, so that I had a fresh reflection to make on\nFlora's extraordinary command of the situation. She passed that night,\nby the most tacit, and I should add, were not the word so grotesque a\nfalse note, the happiest of arrangements, with Mrs. Grose. I saw\nneither of them on my return, but, on the other hand, as by an ambiguous\ncompensation, I saw a great deal of Miles. I saw--I can use no other\nphrase--so much of him that it was as if it were more than it had ever\nbeen. No evening I had passed at Bly had the portentous quality of\nthis one; in spite of which--and in spite also of the deeper depths of\nconsternation that had opened beneath my feet--there was literally, in\nthe ebbing actual, an extraordinarily sweet sadness. On reaching the\nhouse I had never so much as looked for the boy; I had simply gone\nstraight to my room to change what I was wearing and to take in, at\na glance, much material testimony to Flora's rupture. Her little\nbelongings had all been removed. When later, by the schoolroom fire, I\nwas served with tea by the usual maid, I indulged, on the article of my\nother pupil, in no inquiry whatever. He had his freedom now--he might\nhave it to the end! Well, he did have it; and it consisted--in part at\nleast--of his coming in at about eight o'clock and sitting down with me\nin silence. On the removal of the tea things I had blown out the candles\nand drawn my chair closer: I was conscious of a mortal coldness and felt\nas if I should never again be warm. So, when he appeared, I was sitting\nin the glow with my thoughts. He paused a moment by the door as if to\nlook at me; then--as if to share them--came to the other side of the\nhearth and sank into a chair. We sat there in absolute stillness; yet he\nwanted, I felt, to be with me.\n\n\n\n\nXXI\n\n\nBefore a new day, in my room, had fully broken, my eyes opened to Mrs.\nGrose, who had come to my bedside with worse news. Flora was so markedly\nfeverish that an illness was perhaps at hand; she had passed a night of\nextreme unrest, a night agitated above all by fears that had for their\nsubject not in the least her former, but wholly her present, governess.\nIt was not against the possible re-entrance of Miss Jessel on the scene\nthat she protested--it was conspicuously and passionately against mine.\nI was promptly on my feet of course, and with an immense deal to ask;\nthe more that my friend had discernibly now girded her loins to meet me\nonce more. This I felt as soon as I had put to her the question of\nher sense of the child's sincerity as against my own. \"She persists in\ndenying to you that she saw, or has ever seen, anything?\"\n\nMy visitor's trouble, truly, was great. \"Ah, miss, it isn't a matter\non which I can push her! Yet it isn't either, I must say, as if I much\nneeded to. It has made her, every inch of her, quite old.\"\n\n\"Oh, I see her perfectly from here. She resents, for all the world like\nsome high little personage, the imputation on her truthfulness and,\nas it were, her respectability. 'Miss Jessel indeed--SHE!' Ah, she's\n'respectable,' the chit! The impression she gave me there yesterday was,\nI assure you, the very strangest of all; it was quite beyond any of the\nothers. I DID put my foot in it! She'll never speak to me again.\"\n\nHideous and obscure as it all was, it held Mrs. Grose briefly silent;\nthen she granted my point with a frankness which, I made sure, had more\nbehind it. \"I think indeed, miss, she never will. She do have a grand\nmanner about it!\"\n\n\"And that manner\"--I summed it up--\"is practically what's the matter\nwith her now!\"\n\nOh, that manner, I could see in my visitor's face, and not a little else\nbesides! \"She asks me every three minutes if I think you're coming in.\"\n\n\"I see--I see.\" I, too, on my side, had so much more than worked it\nout. \"Has she said to you since yesterday--except to repudiate her\nfamiliarity with anything so dreadful--a single other word about Miss\nJessel?\"\n\n\"Not one, miss. And of course you know,\" my friend added, \"I took it\nfrom her, by the lake, that, just then and there at least, there WAS\nnobody.\"\n\n\"Rather! and, naturally, you take it from her still.\"\n\n\"I don't contradict her. What else can I do?\"\n\n\"Nothing in the world! You've the cleverest little person to deal with.\nThey've made them--their two friends, I mean--still cleverer even than\nnature did; for it was wondrous material to play on! Flora has now her\ngrievance, and she'll work it to the end.\"\n\n\"Yes, miss; but to WHAT end?\"\n\n\"Why, that of dealing with me to her uncle. She'll make me out to him\nthe lowest creature--!\"\n\nI winced at the fair show of the scene in Mrs. Grose's face; she looked\nfor a minute as if she sharply saw them together. \"And him who thinks so\nwell of you!\"\n\n\"He has an odd way--it comes over me now,\" I laughed,\"--of proving it!\nBut that doesn't matter. What Flora wants, of course, is to get rid of\nme.\"\n\nMy companion bravely concurred. \"Never again to so much as look at you.\"\n\n\"So that what you've come to me now for,\" I asked, \"is to speed me on my\nway?\" Before she had time to reply, however, I had her in check. \"I've a\nbetter idea--the result of my reflections. My going WOULD seem the right\nthing, and on Sunday I was terribly near it. Yet that won't do. It's YOU\nwho must go. You must take Flora.\"\n\nMy visitor, at this, did speculate. \"But where in the world--?\"\n\n\"Away from here. Away from THEM. Away, even most of all, now, from me.\nStraight to her uncle.\"\n\n\"Only to tell on you--?\"\n\n\"No, not 'only'! To leave me, in addition, with my remedy.\"\n\nShe was still vague. \"And what IS your remedy?\"\n\n\"Your loyalty, to begin with. And then Miles's.\"\n\nShe looked at me hard. \"Do you think he--?\"\n\n\"Won't, if he has the chance, turn on me? Yes, I venture still to think\nit. At all events, I want to try. Get off with his sister as soon as\npossible and leave me with him alone.\" I was amazed, myself, at the\nspirit I had still in reserve, and therefore perhaps a trifle the more\ndisconcerted at the way in which, in spite of this fine example of it,\nshe hesitated. \"There's one thing, of course,\" I went on: \"they mustn't,\nbefore she goes, see each other for three seconds.\" Then it came over me\nthat, in spite of Flora's presumable sequestration from the instant of\nher return from the pool, it might already be too late. \"Do you mean,\" I\nanxiously asked, \"that they HAVE met?\"\n\nAt this she quite flushed. \"Ah, miss, I'm not such a fool as that! If\nI've been obliged to leave her three or four times, it has been each\ntime with one of the maids, and at present, though she's alone, she's\nlocked in safe. And yet--and yet!\" There were too many things.\n\n\"And yet what?\"\n\n\"Well, are you so sure of the little gentleman?\"\n\n\"I'm not sure of anything but YOU. But I have, since last evening, a new\nhope. I think he wants to give me an opening. I do believe that--poor\nlittle exquisite wretch!--he wants to speak. Last evening, in the\nfirelight and the silence, he sat with me for two hours as if it were\njust coming.\"\n\nMrs. Grose looked hard, through the window, at the gray, gathering day.\n\"And did it come?\"\n\n\"No, though I waited and waited, I confess it didn't, and it was without\na breach of the silence or so much as a faint allusion to his sister's\ncondition and absence that we at last kissed for good night. All the\nsame,\" I continued, \"I can't, if her uncle sees her, consent to his\nseeing her brother without my having given the boy--and most of all\nbecause things have got so bad--a little more time.\"\n\nMy friend appeared on this ground more reluctant than I could quite\nunderstand. \"What do you mean by more time?\"\n\n\"Well, a day or two--really to bring it out. He'll then be on MY\nside--of which you see the importance. If nothing comes, I shall only\nfail, and you will, at the worst, have helped me by doing, on your\narrival in town, whatever you may have found possible.\" So I put it\nbefore her, but she continued for a little so inscrutably embarrassed\nthat I came again to her aid. \"Unless, indeed,\" I wound up, \"you really\nwant NOT to go.\"\n\nI could see it, in her face, at last clear itself; she put out her hand\nto me as a pledge. \"I'll go--I'll go. I'll go this morning.\"\n\nI wanted to be very just. \"If you SHOULD wish still to wait, I would\nengage she shouldn't see me.\"\n\n\"No, no: it's the place itself. She must leave it.\" She held me a moment\nwith heavy eyes, then brought out the rest. \"Your idea's the right one.\nI myself, miss--\"\n\n\"Well?\"\n\n\"I can't stay.\"\n\nThe look she gave me with it made me jump at possibilities. \"You mean\nthat, since yesterday, you HAVE seen--?\"\n\nShe shook her head with dignity. \"I've HEARD--!\"\n\n\"Heard?\"\n\n\"From that child--horrors! There!\" she sighed with tragic relief. \"On my\nhonor, miss, she says things--!\" But at this evocation she broke down;\nshe dropped, with a sudden sob, upon my sofa and, as I had seen her do\nbefore, gave way to all the grief of it.\n\nIt was quite in another manner that I, for my part, let myself go. \"Oh,\nthank God!\"\n\nShe sprang up again at this, drying her eyes with a groan. \"'Thank\nGod'?\"\n\n\"It so justifies me!\"\n\n\"It does that, miss!\"\n\nI couldn't have desired more emphasis, but I just hesitated. \"She's so\nhorrible?\"\n\nI saw my colleague scarce knew how to put it. \"Really shocking.\"\n\n\"And about me?\"\n\n\"About you, miss--since you must have it. It's beyond everything, for a\nyoung lady; and I can't think wherever she must have picked up--\"\n\n\"The appalling language she applied to me? I can, then!\" I broke in with\na laugh that was doubtless significant enough.\n\nIt only, in truth, left my friend still more grave. \"Well, perhaps I\nought to also--since I've heard some of it before! Yet I can't bear it,\"\nthe poor woman went on while, with the same movement, she glanced, on my\ndressing table, at the face of my watch. \"But I must go back.\"\n\nI kept her, however. \"Ah, if you can't bear it--!\"\n\n\"How can I stop with her, you mean? Why, just FOR that: to get her away.\nFar from this,\" she pursued, \"far from THEM-\"\n\n\"She may be different? She may be free?\" I seized her almost with joy.\n\"Then, in spite of yesterday, you BELIEVE--\"\n\n\"In such doings?\" Her simple description of them required, in the light\nof her expression, to be carried no further, and she gave me the whole\nthing as she had never done. \"I believe.\"\n\nYes, it was a joy, and we were still shoulder to shoulder: if I might\ncontinue sure of that I should care but little what else happened. My\nsupport in the presence of disaster would be the same as it had been\nin my early need of confidence, and if my friend would answer for my\nhonesty, I would answer for all the rest. On the point of taking leave\nof her, nonetheless, I was to some extent embarrassed. \"There's one\nthing, of course--it occurs to me--to remember. My letter, giving the\nalarm, will have reached town before you.\"\n\nI now perceived still more how she had been beating about the bush and\nhow weary at last it had made her. \"Your letter won't have got there.\nYour letter never went.\"\n\n\"What then became of it?\"\n\n\"Goodness knows! Master Miles--\"\n\n\"Do you mean HE took it?\" I gasped.\n\nShe hung fire, but she overcame her reluctance. \"I mean that I saw\nyesterday, when I came back with Miss Flora, that it wasn't where you\nhad put it. Later in the evening I had the chance to question Luke, and\nhe declared that he had neither noticed nor touched it.\" We could only\nexchange, on this, one of our deeper mutual soundings, and it was Mrs.\nGrose who first brought up the plumb with an almost elated \"You see!\"\n\n\"Yes, I see that if Miles took it instead he probably will have read it\nand destroyed it.\"\n\n\"And don't you see anything else?\"\n\nI faced her a moment with a sad smile. \"It strikes me that by this time\nyour eyes are open even wider than mine.\"\n\nThey proved to be so indeed, but she could still blush, almost, to show\nit. \"I make out now what he must have done at school.\" And she gave, in\nher simple sharpness, an almost droll disillusioned nod. \"He stole!\"\n\nI turned it over--I tried to be more judicial. \"Well--perhaps.\"\n\nShe looked as if she found me unexpectedly calm. \"He stole LETTERS!\"\n\nShe couldn't know my reasons for a calmness after all pretty shallow; so\nI showed them off as I might. \"I hope then it was to more purpose than\nin this case! The note, at any rate, that I put on the table yesterday,\"\nI pursued, \"will have given him so scant an advantage--for it contained\nonly the bare demand for an interview--that he is already much ashamed\nof having gone so far for so little, and that what he had on his mind\nlast evening was precisely the need of confession.\" I seemed to myself,\nfor the instant, to have mastered it, to see it all. \"Leave us, leave\nus\"--I was already, at the door, hurrying her off. \"I'll get it out of\nhim. He'll meet me--he'll confess. If he confesses, he's saved. And if\nhe's saved--\"\n\n\"Then YOU are?\" The dear woman kissed me on this, and I took her\nfarewell. \"I'll save you without him!\" she cried as she went.\n\n\n\n\nXXII\n\n\nYet it was when she had got off--and I missed her on the spot--that the\ngreat pinch really came. If I had counted on what it would give me to\nfind myself alone with Miles, I speedily perceived, at least, that it\nwould give me a measure. No hour of my stay in fact was so assailed\nwith apprehensions as that of my coming down to learn that the carriage\ncontaining Mrs. Grose and my younger pupil had already rolled out of the\ngates. Now I WAS, I said to myself, face to face with the elements, and\nfor much of the rest of the day, while I fought my weakness, I could\nconsider that I had been supremely rash. It was a tighter place still\nthan I had yet turned round in; all the more that, for the first time,\nI could see in the aspect of others a confused reflection of the crisis.\nWhat had happened naturally caused them all to stare; there was too\nlittle of the explained, throw out whatever we might, in the suddenness\nof my colleague's act. The maids and the men looked blank; the effect\nof which on my nerves was an aggravation until I saw the necessity of\nmaking it a positive aid. It was precisely, in short, by just clutching\nthe helm that I avoided total wreck; and I dare say that, to bear up\nat all, I became, that morning, very grand and very dry. I welcomed the\nconsciousness that I was charged with much to do, and I caused it to be\nknown as well that, left thus to myself, I was quite remarkably firm. I\nwandered with that manner, for the next hour or two, all over the place\nand looked, I have no doubt, as if I were ready for any onset. So, for\nthe benefit of whom it might concern, I paraded with a sick heart.\n\nThe person it appeared least to concern proved to be, till dinner,\nlittle Miles himself. My perambulations had given me, meanwhile, no\nglimpse of him, but they had tended to make more public the change\ntaking place in our relation as a consequence of his having at the\npiano, the day before, kept me, in Flora's interest, so beguiled and\nbefooled. The stamp of publicity had of course been fully given by her\nconfinement and departure, and the change itself was now ushered in\nby our nonobservance of the regular custom of the schoolroom. He had\nalready disappeared when, on my way down, I pushed open his door, and\nI learned below that he had breakfasted--in the presence of a couple of\nthe maids--with Mrs. Grose and his sister. He had then gone out, as he\nsaid, for a stroll; than which nothing, I reflected, could better have\nexpressed his frank view of the abrupt transformation of my office. What\nhe would not permit this office to consist of was yet to be settled:\nthere was a queer relief, at all events--I mean for myself in\nespecial--in the renouncement of one pretension. If so much had sprung\nto the surface, I scarce put it too strongly in saying that what had\nperhaps sprung highest was the absurdity of our prolonging the fiction\nthat I had anything more to teach him. It sufficiently stuck out that,\nby tacit little tricks in which even more than myself he carried out the\ncare for my dignity, I had had to appeal to him to let me off straining\nto meet him on the ground of his true capacity. He had at any rate\nhis freedom now; I was never to touch it again; as I had amply shown,\nmoreover, when, on his joining me in the schoolroom the previous night,\nI had uttered, on the subject of the interval just concluded, neither\nchallenge nor hint. I had too much, from this moment, my other ideas.\nYet when he at last arrived, the difficulty of applying them, the\naccumulations of my problem, were brought straight home to me by the\nbeautiful little presence on which what had occurred had as yet, for the\neye, dropped neither stain nor shadow.\n\nTo mark, for the house, the high state I cultivated I decreed that my\nmeals with the boy should be served, as we called it, downstairs; so\nthat I had been awaiting him in the ponderous pomp of the room outside\nof the window of which I had had from Mrs. Grose, that first scared\nSunday, my flash of something it would scarce have done to call light.\nHere at present I felt afresh--for I had felt it again and again--how my\nequilibrium depended on the success of my rigid will, the will to shut\nmy eyes as tight as possible to the truth that what I had to deal with\nwas, revoltingly, against nature. I could only get on at all by taking\n\"nature\" into my confidence and my account, by treating my monstrous\nordeal as a push in a direction unusual, of course, and unpleasant, but\ndemanding, after all, for a fair front, only another turn of the screw\nof ordinary human virtue. No attempt, nonetheless, could well require\nmore tact than just this attempt to supply, one's self, ALL the nature.\nHow could I put even a little of that article into a suppression of\nreference to what had occurred? How, on the other hand, could I make\nreference without a new plunge into the hideous obscure? Well, a sort\nof answer, after a time, had come to me, and it was so far confirmed as\nthat I was met, incontestably, by the quickened vision of what was rare\nin my little companion. It was indeed as if he had found even now--as he\nhad so often found at lessons--still some other delicate way to ease me\noff. Wasn't there light in the fact which, as we shared our solitude,\nbroke out with a specious glitter it had never yet quite worn?--the fact\nthat (opportunity aiding, precious opportunity which had now come) it\nwould be preposterous, with a child so endowed, to forego the help one\nmight wrest from absolute intelligence? What had his intelligence been\ngiven him for but to save him? Mightn't one, to reach his mind, risk the\nstretch of an angular arm over his character? It was as if, when we were\nface to face in the dining room, he had literally shown me the way.\nThe roast mutton was on the table, and I had dispensed with attendance.\nMiles, before he sat down, stood a moment with his hands in his pockets\nand looked at the joint, on which he seemed on the point of passing some\nhumorous judgment. But what he presently produced was: \"I say, my dear,\nis she really very awfully ill?\"\n\n\"Little Flora? Not so bad but that she'll presently be better. London\nwill set her up. Bly had ceased to agree with her. Come here and take\nyour mutton.\"\n\nHe alertly obeyed me, carried the plate carefully to his seat, and,\nwhen he was established, went on. \"Did Bly disagree with her so terribly\nsuddenly?\"\n\n\"Not so suddenly as you might think. One had seen it coming on.\"\n\n\"Then why didn't you get her off before?\"\n\n\"Before what?\"\n\n\"Before she became too ill to travel.\"\n\nI found myself prompt. \"She's NOT too ill to travel: she only might\nhave become so if she had stayed. This was just the moment to seize. The\njourney will dissipate the influence\"--oh, I was grand!--\"and carry it\noff.\"\n\n\"I see, I see\"--Miles, for that matter, was grand, too. He settled to\nhis repast with the charming little \"table manner\" that, from the day of\nhis arrival, had relieved me of all grossness of admonition. Whatever\nhe had been driven from school for, it was not for ugly feeding. He\nwas irreproachable, as always, today; but he was unmistakably more\nconscious. He was discernibly trying to take for granted more things\nthan he found, without assistance, quite easy; and he dropped into\npeaceful silence while he felt his situation. Our meal was of the\nbriefest--mine a vain pretense, and I had the things immediately\nremoved. While this was done Miles stood again with his hands in his\nlittle pockets and his back to me--stood and looked out of the wide\nwindow through which, that other day, I had seen what pulled me up. We\ncontinued silent while the maid was with us--as silent, it whimsically\noccurred to me, as some young couple who, on their wedding journey, at\nthe inn, feel shy in the presence of the waiter. He turned round only\nwhen the waiter had left us. \"Well--so we're alone!\"\n\n\n\n\nXXIII\n\n\n\"Oh, more or less.\" I fancy my smile was pale. \"Not absolutely. We\nshouldn't like that!\" I went on.\n\n\"No--I suppose we shouldn't. Of course we have the others.\"\n\n\"We have the others--we have indeed the others,\" I concurred.\n\n\"Yet even though we have them,\" he returned, still with his hands in\nhis pockets and planted there in front of me, \"they don't much count, do\nthey?\"\n\nI made the best of it, but I felt wan. \"It depends on what you call\n'much'!\"\n\n\"Yes\"--with all accommodation--\"everything depends!\" On this, however,\nhe faced to the window again and presently reached it with his vague,\nrestless, cogitating step. He remained there awhile, with his forehead\nagainst the glass, in contemplation of the stupid shrubs I knew and the\ndull things of November. I had always my hypocrisy of \"work,\" behind\nwhich, now, I gained the sofa. Steadying myself with it there as I had\nrepeatedly done at those moments of torment that I have described as the\nmoments of my knowing the children to be given to something from which\nI was barred, I sufficiently obeyed my habit of being prepared for the\nworst. But an extraordinary impression dropped on me as I extracted a\nmeaning from the boy's embarrassed back--none other than the impression\nthat I was not barred now. This inference grew in a few minutes to sharp\nintensity and seemed bound up with the direct perception that it was\npositively HE who was. The frames and squares of the great window were a\nkind of image, for him, of a kind of failure. I felt that I saw him, at\nany rate, shut in or shut out. He was admirable, but not comfortable: I\ntook it in with a throb of hope. Wasn't he looking, through the haunted\npane, for something he couldn't see?--and wasn't it the first time in\nthe whole business that he had known such a lapse? The first, the very\nfirst: I found it a splendid portent. It made him anxious, though he\nwatched himself; he had been anxious all day and, even while in his\nusual sweet little manner he sat at table, had needed all his small\nstrange genius to give it a gloss. When he at last turned round to meet\nme, it was almost as if this genius had succumbed. \"Well, I think I'm\nglad Bly agrees with ME!\"\n\n\"You would certainly seem to have seen, these twenty-four hours, a good\ndeal more of it than for some time before. I hope,\" I went on bravely,\n\"that you've been enjoying yourself.\"\n\n\"Oh, yes, I've been ever so far; all round about--miles and miles away.\nI've never been so free.\"\n\nHe had really a manner of his own, and I could only try to keep up with\nhim. \"Well, do you like it?\"\n\nHe stood there smiling; then at last he put into two words--\"Do\nYOU?\"--more discrimination than I had ever heard two words contain.\nBefore I had time to deal with that, however, he continued as if with\nthe sense that this was an impertinence to be softened. \"Nothing could\nbe more charming than the way you take it, for of course if we're alone\ntogether now it's you that are alone most. But I hope,\" he threw in,\n\"you don't particularly mind!\"\n\n\"Having to do with you?\" I asked. \"My dear child, how can I help\nminding? Though I've renounced all claim to your company--you're so\nbeyond me--I at least greatly enjoy it. What else should I stay on for?\"\n\nHe looked at me more directly, and the expression of his face, graver\nnow, struck me as the most beautiful I had ever found in it. \"You stay\non just for THAT?\"\n\n\"Certainly. I stay on as your friend and from the tremendous interest\nI take in you till something can be done for you that may be more worth\nyour while. That needn't surprise you.\" My voice trembled so that I felt\nit impossible to suppress the shake. \"Don't you remember how I told you,\nwhen I came and sat on your bed the night of the storm, that there was\nnothing in the world I wouldn't do for you?\"\n\n\"Yes, yes!\" He, on his side, more and more visibly nervous, had a tone\nto master; but he was so much more successful than I that, laughing out\nthrough his gravity, he could pretend we were pleasantly jesting. \"Only\nthat, I think, was to get me to do something for YOU!\"\n\n\"It was partly to get you to do something,\" I conceded. \"But, you know,\nyou didn't do it.\"\n\n\"Oh, yes,\" he said with the brightest superficial eagerness, \"you wanted\nme to tell you something.\"\n\n\"That's it. Out, straight out. What you have on your mind, you know.\"\n\n\"Ah, then, is THAT what you've stayed over for?\"\n\nHe spoke with a gaiety through which I could still catch the finest\nlittle quiver of resentful passion; but I can't begin to express the\neffect upon me of an implication of surrender even so faint. It was as\nif what I had yearned for had come at last only to astonish me. \"Well,\nyes--I may as well make a clean breast of it, it was precisely for\nthat.\"\n\nHe waited so long that I supposed it for the purpose of repudiating the\nassumption on which my action had been founded; but what he finally said\nwas: \"Do you mean now--here?\"\n\n\"There couldn't be a better place or time.\" He looked round him\nuneasily, and I had the rare--oh, the queer!--impression of the very\nfirst symptom I had seen in him of the approach of immediate fear.\nIt was as if he were suddenly afraid of me--which struck me indeed as\nperhaps the best thing to make him. Yet in the very pang of the effort\nI felt it vain to try sternness, and I heard myself the next instant so\ngentle as to be almost grotesque. \"You want so to go out again?\"\n\n\"Awfully!\" He smiled at me heroically, and the touching little bravery\nof it was enhanced by his actually flushing with pain. He had picked up\nhis hat, which he had brought in, and stood twirling it in a way that\ngave me, even as I was just nearly reaching port, a perverse horror of\nwhat I was doing. To do it in ANY way was an act of violence, for what\ndid it consist of but the obtrusion of the idea of grossness and guilt\non a small helpless creature who had been for me a revelation of the\npossibilities of beautiful intercourse? Wasn't it base to create for a\nbeing so exquisite a mere alien awkwardness? I suppose I now read into\nour situation a clearness it couldn't have had at the time, for I seem\nto see our poor eyes already lighted with some spark of a prevision\nof the anguish that was to come. So we circled about, with terrors and\nscruples, like fighters not daring to close. But it was for each other\nwe feared! That kept us a little longer suspended and unbruised. \"I'll\ntell you everything,\" Miles said--\"I mean I'll tell you anything you\nlike. You'll stay on with me, and we shall both be all right, and I WILL\ntell you--I WILL. But not now.\"\n\n\"Why not now?\"\n\nMy insistence turned him from me and kept him once more at his window\nin a silence during which, between us, you might have heard a pin drop.\nThen he was before me again with the air of a person for whom, outside,\nsomeone who had frankly to be reckoned with was waiting. \"I have to see\nLuke.\"\n\nI had not yet reduced him to quite so vulgar a lie, and I felt\nproportionately ashamed. But, horrible as it was, his lies made up my\ntruth. I achieved thoughtfully a few loops of my knitting. \"Well, then,\ngo to Luke, and I'll wait for what you promise. Only, in return for\nthat, satisfy, before you leave me, one very much smaller request.\"\n\nHe looked as if he felt he had succeeded enough to be able still a\nlittle to bargain. \"Very much smaller--?\"\n\n\"Yes, a mere fraction of the whole. Tell me\"--oh, my work preoccupied\nme, and I was offhand!--\"if, yesterday afternoon, from the table in the\nhall, you took, you know, my letter.\"\n\n\n\n\nXXIV\n\n\nMy sense of how he received this suffered for a minute from something\nthat I can describe only as a fierce split of my attention--a stroke\nthat at first, as I sprang straight up, reduced me to the mere blind\nmovement of getting hold of him, drawing him close, and, while I just\nfell for support against the nearest piece of furniture, instinctively\nkeeping him with his back to the window. The appearance was full upon us\nthat I had already had to deal with here: Peter Quint had come into view\nlike a sentinel before a prison. The next thing I saw was that, from\noutside, he had reached the window, and then I knew that, close to the\nglass and glaring in through it, he offered once more to the room his\nwhite face of damnation. It represents but grossly what took place\nwithin me at the sight to say that on the second my decision was made;\nyet I believe that no woman so overwhelmed ever in so short a time\nrecovered her grasp of the ACT. It came to me in the very horror of the\nimmediate presence that the act would be, seeing and facing what I saw\nand faced, to keep the boy himself unaware. The inspiration--I can\ncall it by no other name--was that I felt how voluntarily, how\ntranscendently, I MIGHT. It was like fighting with a demon for a\nhuman soul, and when I had fairly so appraised it I saw how the human\nsoul--held out, in the tremor of my hands, at arm's length--had a\nperfect dew of sweat on a lovely childish forehead. The face that was\nclose to mine was as white as the face against the glass, and out of it\npresently came a sound, not low nor weak, but as if from much further\naway, that I drank like a waft of fragrance.\n\n\"Yes--I took it.\"\n\nAt this, with a moan of joy, I enfolded, I drew him close; and while\nI held him to my breast, where I could feel in the sudden fever of his\nlittle body the tremendous pulse of his little heart, I kept my eyes on\nthe thing at the window and saw it move and shift its posture. I have\nlikened it to a sentinel, but its slow wheel, for a moment, was rather\nthe prowl of a baffled beast. My present quickened courage, however, was\nsuch that, not too much to let it through, I had to shade, as it were,\nmy flame. Meanwhile the glare of the face was again at the window, the\nscoundrel fixed as if to watch and wait. It was the very confidence that\nI might now defy him, as well as the positive certitude, by this time,\nof the child's unconsciousness, that made me go on. \"What did you take\nit for?\"\n\n\"To see what you said about me.\"\n\n\"You opened the letter?\"\n\n\"I opened it.\"\n\nMy eyes were now, as I held him off a little again, on Miles's own face,\nin which the collapse of mockery showed me how complete was the ravage\nof uneasiness. What was prodigious was that at last, by my success, his\nsense was sealed and his communication stopped: he knew that he was in\npresence, but knew not of what, and knew still less that I also was and\nthat I did know. And what did this strain of trouble matter when my eyes\nwent back to the window only to see that the air was clear again and--by\nmy personal triumph--the influence quenched? There was nothing there. I\nfelt that the cause was mine and that I should surely get ALL. \"And you\nfound nothing!\"--I let my elation out.\n\nHe gave the most mournful, thoughtful little headshake. \"Nothing.\"\n\n\"Nothing, nothing!\" I almost shouted in my joy.\n\n\"Nothing, nothing,\" he sadly repeated.\n\nI kissed his forehead; it was drenched. \"So what have you done with it?\"\n\n\"I've burned it.\"\n\n\"Burned it?\" It was now or never. \"Is that what you did at school?\"\n\nOh, what this brought up! \"At school?\"\n\n\"Did you take letters?--or other things?\"\n\n\"Other things?\" He appeared now to be thinking of something far off and\nthat reached him only through the pressure of his anxiety. Yet it did\nreach him. \"Did I STEAL?\"\n\nI felt myself redden to the roots of my hair as well as wonder if it\nwere more strange to put to a gentleman such a question or to see him\ntake it with allowances that gave the very distance of his fall in the\nworld. \"Was it for that you mightn't go back?\"\n\nThe only thing he felt was rather a dreary little surprise. \"Did you\nknow I mightn't go back?\"\n\n\"I know everything.\"\n\nHe gave me at this the longest and strangest look. \"Everything?\"\n\n\"Everything. Therefore DID you--?\" But I couldn't say it again.\n\nMiles could, very simply. \"No. I didn't steal.\"\n\nMy face must have shown him I believed him utterly; yet my hands--but it\nwas for pure tenderness--shook him as if to ask him why, if it was all\nfor nothing, he had condemned me to months of torment. \"What then did\nyou do?\"\n\nHe looked in vague pain all round the top of the room and drew his\nbreath, two or three times over, as if with difficulty. He might have\nbeen standing at the bottom of the sea and raising his eyes to some\nfaint green twilight. \"Well--I said things.\"\n\n\"Only that?\"\n\n\"They thought it was enough!\"\n\n\"To turn you out for?\"\n\nNever, truly, had a person \"turned out\" shown so little to explain it\nas this little person! He appeared to weigh my question, but in a manner\nquite detached and almost helpless. \"Well, I suppose I oughtn't.\"\n\n\"But to whom did you say them?\"\n\nHe evidently tried to remember, but it dropped--he had lost it. \"I don't\nknow!\"\n\nHe almost smiled at me in the desolation of his surrender, which was\nindeed practically, by this time, so complete that I ought to have left\nit there. But I was infatuated--I was blind with victory, though even\nthen the very effect that was to have brought him so much nearer was\nalready that of added separation. \"Was it to everyone?\" I asked.\n\n\"No; it was only to--\" But he gave a sick little headshake. \"I don't\nremember their names.\"\n\n\"Were they then so many?\"\n\n\"No--only a few. Those I liked.\"\n\nThose he liked? I seemed to float not into clearness, but into a darker\nobscure, and within a minute there had come to me out of my very pity\nthe appalling alarm of his being perhaps innocent. It was for the\ninstant confounding and bottomless, for if he WERE innocent, what then\non earth was _I_? Paralyzed, while it lasted, by the mere brush of the\nquestion, I let him go a little, so that, with a deep-drawn sigh, he\nturned away from me again; which, as he faced toward the clear window,\nI suffered, feeling that I had nothing now there to keep him from. \"And\ndid they repeat what you said?\" I went on after a moment.\n\nHe was soon at some distance from me, still breathing hard and again\nwith the air, though now without anger for it, of being confined against\nhis will. Once more, as he had done before, he looked up at the dim\nday as if, of what had hitherto sustained him, nothing was left but an\nunspeakable anxiety. \"Oh, yes,\" he nevertheless replied--\"they must have\nrepeated them. To those THEY liked,\" he added.\n\nThere was, somehow, less of it than I had expected; but I turned it\nover. \"And these things came round--?\"\n\n\"To the masters? Oh, yes!\" he answered very simply. \"But I didn't know\nthey'd tell.\"\n\n\"The masters? They didn't--they've never told. That's why I ask you.\"\n\nHe turned to me again his little beautiful fevered face. \"Yes, it was\ntoo bad.\"\n\n\"Too bad?\"\n\n\"What I suppose I sometimes said. To write home.\"\n\nI can't name the exquisite pathos of the contradiction given to such\na speech by such a speaker; I only know that the next instant I heard\nmyself throw off with homely force: \"Stuff and nonsense!\" But the next\nafter that I must have sounded stern enough. \"What WERE these things?\"\n\nMy sternness was all for his judge, his executioner; yet it made him\navert himself again, and that movement made ME, with a single bound and\nan irrepressible cry, spring straight upon him. For there again, against\nthe glass, as if to blight his confession and stay his answer, was the\nhideous author of our woe--the white face of damnation. I felt a sick\nswim at the drop of my victory and all the return of my battle, so that\nthe wildness of my veritable leap only served as a great betrayal. I\nsaw him, from the midst of my act, meet it with a divination, and on the\nperception that even now he only guessed, and that the window was still\nto his own eyes free, I let the impulse flame up to convert the climax\nof his dismay into the very proof of his liberation. \"No more, no\nmore, no more!\" I shrieked, as I tried to press him against me, to my\nvisitant.\n\n\"Is she HERE?\" Miles panted as he caught with his sealed eyes the\ndirection of my words. Then as his strange \"she\" staggered me and, with\na gasp, I echoed it, \"Miss Jessel, Miss Jessel!\" he with a sudden fury\ngave me back.\n\nI seized, stupefied, his supposition--some sequel to what we had done to\nFlora, but this made me only want to show him that it was better still\nthan that. \"It's not Miss Jessel! But it's at the window--straight\nbefore us. It's THERE--the coward horror, there for the last time!\"\n\nAt this, after a second in which his head made the movement of a baffled\ndog's on a scent and then gave a frantic little shake for air and light,\nhe was at me in a white rage, bewildered, glaring vainly over the place\nand missing wholly, though it now, to my sense, filled the room like the\ntaste of poison, the wide, overwhelming presence. \"It's HE?\"\n\nI was so determined to have all my proof that I flashed into ice to\nchallenge him. \"Whom do you mean by 'he'?\"\n\n\"Peter Quint--you devil!\" His face gave again, round the room, its\nconvulsed supplication. \"WHERE?\"\n\nThey are in my ears still, his supreme surrender of the name and his\ntribute to my devotion. \"What does he matter now, my own?--what will he\nEVER matter? _I_ have you,\" I launched at the beast, \"but he has lost\nyou forever!\" Then, for the demonstration of my work, \"There, THERE!\" I\nsaid to Miles.\n\nBut he had already jerked straight round, stared, glared again, and\nseen but the quiet day. With the stroke of the loss I was so proud of he\nuttered the cry of a creature hurled over an abyss, and the grasp with\nwhich I recovered him might have been that of catching him in his fall.\nI caught him, yes, I held him--it may be imagined with what a passion;\nbut at the end of a minute I began to feel what it truly was that\nI held. We were alone with the quiet day, and his little heart,\ndispossessed, had stopped.", "title": "The Turn of the Screw"}