{"summary": "The setting is a society in which aging has been cured, individuals have indefinite lifespans, and population control is used to limit the population of the United States to forty million. This is maintained through a combination of infanticide and government-assisted suicide - in short, in order for someone to be born, someone must first volunteer to die. As a result, births are few and far between, and deaths occur primarily by accident.\nThe scene is a waiting room at the Chicago Lying-In Hospital, where Edward K. Wehling, Jr. is faced with the situation that his wife is about to give birth to triplets, but he has found only one person - his maternal grandfather - who will volunteer to die. A painter on a stepladder is redecorating the room with a mural depicting famous doctors and nurses - in particular, Dr. Benjamin Hitz, the hospital's Chief Obstetrician. Leora Duncan, from the Service Division of the Federal Bureau of Termination, arrives to pose for the mural. The mural is a picture of a garden that's well taken care of. It is a metaphor for the United States at that time. Later, Dr. Hitz enters the scene, conversing with everyone but the painter of the mural.\nIt becomes apparent to all that Wehling is in a state of despair, wanting not to send his grandfather and two of his children to death. Dr. Hitz questions Wehling's belief in the system, and tries to make Wehling feel better by explaining how the surviving child will \"live on a happy, roomy, clean, rich planet.\" Suddenly, Wehling draws a revolver and kills Dr. Hitz, Leora Duncan, and himself - \"making room for all three children.\"\nThe painter, who is about two hundred years old, is left to reflect on the scene, and thinks about life, war, plague, and starvation. Descending the stepladder, he initially takes the revolver, intending to kill himself, but he can't do it. The last line is from the receptionist at the Bureau:\n\n", "full_text": "2_B_R_0_2_B\n\n           By\n    Kurt Vonnegut, Jr.\n\n\nTranscriber note: This etext was produced from Worlds of If, January 1962.\nExtensive research did not uncover any evidence that the U.S. copyright on\nthis publication was renewed.\n\n\n\n\nGot a problem? Just pick up the phone.\nIt solved them all--and all the same way!\n\n\n     2\n     B\n     R\n     0\n     2\n     B\n\n\nby KURT VONNEGUT, JR.\n\n\n\n\nEverything was perfectly swell.\n\nThere were no prisons, no slums, no insane asylums, no cripples, no\npoverty, no wars.\n\nAll diseases were conquered. So was old age.\n\nDeath, barring accidents, was an adventure for volunteers.\n\nThe population of the United States was stabilized at forty-million\nsouls.\n\nOne bright morning in the Chicago Lying-in Hospital, a man named Edward\nK. Wehling, Jr., waited for his wife to give birth. He was the only man\nwaiting. Not many people were born a day any more.\n\nWehling was fifty-six, a mere stripling in a population whose average\nage was one hundred and twenty-nine.\n\nX-rays had revealed that his wife was going to have triplets. The\nchildren would be his first.\n\nYoung Wehling was hunched in his chair, his head in his hand. He was so\nrumpled, so still and colorless as to be virtually invisible. His\ncamouflage was perfect, since the waiting room had a disorderly and\ndemoralized air, too. Chairs and ashtrays had been moved away from the\nwalls. The floor was paved with spattered dropcloths.\n\nThe room was being redecorated. It was being redecorated as a memorial\nto a man who had volunteered to die.\n\nA sardonic old man, about two hundred years old, sat on a stepladder,\npainting a mural he did not like. Back in the days when people aged\nvisibly, his age would have been guessed at thirty-five or so. Aging had\ntouched him that much before the cure for aging was found.\n\nThe mural he was working on depicted a very neat garden. Men and women\nin white, doctors and nurses, turned the soil, planted seedlings,\nsprayed bugs, spread fertilizer.\n\nMen and women in purple uniforms pulled up weeds, cut down plants that\nwere old and sickly, raked leaves, carried refuse to trash-burners.\n\nNever, never, never--not even in medieval Holland nor old Japan--had a\ngarden been more formal, been better tended. Every plant had all the\nloam, light, water, air and nourishment it could use.\n\nA hospital orderly came down the corridor, singing under his breath a\npopular song:\n\n     If you don't like my kisses, honey,\n     Here's what I will do:\n     I'll go see a girl in purple,\n     Kiss this sad world toodle-oo.\n     If you don't want my lovin',\n     Why should I take up all this space?\n     I'll get off this old planet,\n     Let some sweet baby have my place.\n\nThe orderly looked in at the mural and the muralist. \"Looks so real,\"\nhe said, \"I can practically imagine I'm standing in the middle of it.\"\n\n\"What makes you think you're not in it?\" said the painter. He gave a\nsatiric smile. \"It's called 'The Happy Garden of Life,' you know.\"\n\n\"That's good of Dr. Hitz,\" said the orderly.\n\n       *       *       *       *       *\n\nHe was referring to one of the male figures in white, whose head was a\nportrait of Dr. Benjamin Hitz, the hospital's Chief Obstetrician. Hitz\nwas a blindingly handsome man.\n\n\"Lot of faces still to fill in,\" said the orderly. He meant that the\nfaces of many of the figures in the mural were still blank. All blanks\nwere to be filled with portraits of important people on either the\nhospital staff or from the Chicago Office of the Federal Bureau of\nTermination.\n\n\"Must be nice to be able to make pictures that look like something,\"\nsaid the orderly.\n\nThe painter's face curdled with scorn. \"You think I'm proud of this\ndaub?\" he said. \"You think this is my idea of what life really looks\nlike?\"\n\n\"What's your idea of what life looks like?\" said the orderly.\n\nThe painter gestured at a foul dropcloth. \"There's a good picture of\nit,\" he said. \"Frame that, and you'll have a picture a damn sight more\nhonest than this one.\"\n\n\"You're a gloomy old duck, aren't you?\" said the orderly.\n\n\"Is that a crime?\" said the painter.\n\nThe orderly shrugged. \"If you don't like it here, Grandpa--\" he said,\nand he finished the thought with the trick telephone number that people\nwho didn't want to live any more were supposed to call. The zero in the\ntelephone number he pronounced \"naught.\"\n\nThe number was: \"2 B R 0 2 B.\"\n\nIt was the telephone number of an institution whose fanciful sobriquets\nincluded: \"Automat,\" \"Birdland,\" \"Cannery,\" \"Catbox,\" \"De-louser,\"\n\"Easy-go,\" \"Good-by, Mother,\" \"Happy Hooligan,\" \"Kiss-me-quick,\" \"Lucky\nPierre,\" \"Sheepdip,\" \"Waring Blendor,\" \"Weep-no-more\" and \"Why Worry?\"\n\n\"To be or not to be\" was the telephone number of the municipal gas\nchambers of the Federal Bureau of Termination.\n\n       *       *       *       *       *\n\nThe painter thumbed his nose at the orderly. \"When I decide it's time to\ngo,\" he said, \"it won't be at the Sheepdip.\"\n\n\"A do-it-yourselfer, eh?\" said the orderly. \"Messy business, Grandpa.\nWhy don't you have a little consideration for the people who have to\nclean up after you?\"\n\nThe painter expressed with an obscenity his lack of concern for the\ntribulations of his survivors. \"The world could do with a good deal more\nmess, if you ask me,\" he said.\n\nThe orderly laughed and moved on.\n\nWehling, the waiting father, mumbled something without raising his head.\nAnd then he fell silent again.\n\nA coarse, formidable woman strode into the waiting room on spike heels.\nHer shoes, stockings, trench coat, bag and overseas cap were all purple,\nthe purple the painter called \"the color of grapes on Judgment Day.\"\n\nThe medallion on her purple musette bag was the seal of the Service\nDivision of the Federal Bureau of Termination, an eagle perched on a\nturnstile.\n\nThe woman had a lot of facial hair--an unmistakable mustache, in fact. A\ncurious thing about gas-chamber hostesses was that, no matter how lovely\nand feminine they were when recruited, they all sprouted mustaches\nwithin five years or so.\n\n\"Is this where I'm supposed to come?\" she said to the painter.\n\n\"A lot would depend on what your business was,\" he said. \"You aren't\nabout to have a baby, are you?\"\n\n\"They told me I was supposed to pose for some picture,\" she said. \"My\nname's Leora Duncan.\" She waited.\n\n\"And you dunk people,\" he said.\n\n\"What?\" she said.\n\n\"Skip it,\" he said.\n\n\"That sure is a beautiful picture,\" she said. \"Looks just like heaven or\nsomething.\"\n\n\"Or something,\" said the painter. He took a list of names from his smock\npocket. \"Duncan, Duncan, Duncan,\" he said, scanning the list. \"Yes--here\nyou are. You're entitled to be immortalized. See any faceless body here\nyou'd like me to stick your head on? We've got a few choice ones left.\"\n\nShe studied the mural bleakly. \"Gee,\" she said, \"they're all the same to\nme. I don't know anything about art.\"\n\n\"A body's a body, eh?\" he said, \"All righty. As a master of fine art, I\nrecommend this body here.\" He indicated a faceless figure of a woman who\nwas carrying dried stalks to a trash-burner.\n\n\"Well,\" said Leora Duncan, \"that's more the disposal people, isn't it? I\nmean, I'm in service. I don't do any disposing.\"\n\nThe painter clapped his hands in mock delight. \"You say you don't know\nanything about art, and then you prove in the next breath that you know\nmore about it than I do! Of course the sheave-carrier is wrong for a\nhostess! A snipper, a pruner--that's more your line.\" He pointed to a\nfigure in purple who was sawing a dead branch from an apple tree. \"How\nabout her?\" he said. \"You like her at all?\"\n\n\"Gosh--\" she said, and she blushed and became humble--\"that--that puts\nme right next to Dr. Hitz.\"\n\n\"That upsets you?\" he said.\n\n\"Good gravy, no!\" she said. \"It's--it's just such an honor.\"\n\n\"Ah, You admire him, eh?\" he said.\n\n\"Who doesn't admire him?\" she said, worshiping the portrait of Hitz. It\nwas the portrait of a tanned, white-haired, omnipotent Zeus, two hundred\nand forty years old. \"Who doesn't admire him?\" she said again. \"He was\nresponsible for setting up the very first gas chamber in Chicago.\"\n\n\"Nothing would please me more,\" said the painter, \"than to put you next\nto him for all time. Sawing off a limb--that strikes you as\nappropriate?\"\n\n\"That is kind of like what I do,\" she said. She was demure about what\nshe did. What she did was make people comfortable while she killed them.\n\n       *       *       *       *       *\n\nAnd, while Leora Duncan was posing for her portrait, into the\nwaitingroom bounded Dr. Hitz himself. He was seven feet tall, and he\nboomed with importance, accomplishments, and the joy of living.\n\n\"Well, Miss Duncan! Miss Duncan!\" he said, and he made a joke. \"What\nare you doing here?\" he said. \"This isn't where the people leave. This\nis where they come in!\"\n\n\"We're going to be in the same picture together,\" she said shyly.\n\n\"Good!\" said Dr. Hitz heartily. \"And, say, isn't that some picture?\"\n\n\"I sure am honored to be in it with you,\" she said.\n\n\"Let me tell you,\" he said, \"I'm honored to be in it with you. Without\nwomen like you, this wonderful world we've got wouldn't be possible.\"\n\nHe saluted her and moved toward the door that led to the delivery rooms.\n\"Guess what was just born,\" he said.\n\n\"I can't,\" she said.\n\n\"Triplets!\" he said.\n\n\"Triplets!\" she said. She was exclaiming over the legal implications of\ntriplets.\n\nThe law said that no newborn child could survive unless the parents of\nthe child could find someone who would volunteer to die. Triplets, if\nthey were all to live, called for three volunteers.\n\n\"Do the parents have three volunteers?\" said Leora Duncan.\n\n\"Last I heard,\" said Dr. Hitz, \"they had one, and were trying to scrape\nanother two up.\"\n\n\"I don't think they made it,\" she said. \"Nobody made three appointments\nwith us. Nothing but singles going through today, unless somebody\ncalled in after I left. What's the name?\"\n\n\"Wehling,\" said the waiting father, sitting up, red-eyed and frowzy.\n\"Edward K. Wehling, Jr., is the name of the happy father-to-be.\"\n\nHe raised his right hand, looked at a spot on the wall, gave a hoarsely\nwretched chuckle. \"Present,\" he said.\n\n\"Oh, Mr. Wehling,\" said Dr. Hitz, \"I didn't see you.\"\n\n\"The invisible man,\" said Wehling.\n\n\"They just phoned me that your triplets have been born,\" said Dr. Hitz.\n\"They're all fine, and so is the mother. I'm on my way in to see them\nnow.\"\n\n\"Hooray,\" said Wehling emptily.\n\n\"You don't sound very happy,\" said Dr. Hitz.\n\n\"What man in my shoes wouldn't be happy?\" said Wehling. He gestured with\nhis hands to symbolize care-free simplicity. \"All I have to do is pick\nout which one of the triplets is going to live, then deliver my maternal\ngrandfather to the Happy Hooligan, and come back here with a receipt.\"\n\n       *       *       *       *       *\n\nDr. Hitz became rather severe with Wehling, towered over him. \"You don't\nbelieve in population control, Mr. Wehling?\" he said.\n\n\"I think it's perfectly keen,\" said Wehling tautly.\n\n\"Would you like to go back to the good old days, when the population of\nthe Earth was twenty billion--about to become forty billion, then eighty\nbillion, then one hundred and sixty billion? Do you know what a drupelet\nis, Mr. Wehling?\" said Hitz.\n\n\"Nope,\" said Wehling sulkily.\n\n\"A drupelet, Mr. Wehling, is one of the little knobs, one of the little\npulpy grains of a blackberry,\" said Dr. Hitz. \"Without population\ncontrol, human beings would now be packed on this surface of this old\nplanet like drupelets on a blackberry! Think of it!\"\n\nWehling continued to stare at the same spot on the wall.\n\n\"In the year 2000,\" said Dr. Hitz, \"before scientists stepped in and\nlaid down the law, there wasn't even enough drinking water to go around,\nand nothing to eat but sea-weed--and still people insisted on their\nright to reproduce like jackrabbits. And their right, if possible, to\nlive forever.\"\n\n\"I want those kids,\" said Wehling quietly. \"I want all three of them.\"\n\n\"Of course you do,\" said Dr. Hitz. \"That's only human.\"\n\n\"I don't want my grandfather to die, either,\" said Wehling.\n\n\"Nobody's really happy about taking a close relative to the Catbox,\"\nsaid Dr. Hitz gently, sympathetically.\n\n\"I wish people wouldn't call it that,\" said Leora Duncan.\n\n\"What?\" said Dr. Hitz.\n\n\"I wish people wouldn't call it 'the Catbox,' and things like that,\" she\nsaid. \"It gives people the wrong impression.\"\n\n\"You're absolutely right,\" said Dr. Hitz. \"Forgive me.\" He corrected\nhimself, gave the municipal gas chambers their official title, a title\nno one ever used in conversation. \"I should have said, 'Ethical Suicide\nStudios,'\" he said.\n\n\"That sounds so much better,\" said Leora Duncan.\n\n\"This child of yours--whichever one you decide to keep, Mr. Wehling,\"\nsaid Dr. Hitz. \"He or she is going to live on a happy, roomy, clean,\nrich planet, thanks to population control. In a garden like that mural\nthere.\" He shook his head. \"Two centuries ago, when I was a young man,\nit was a hell that nobody thought could last another twenty years. Now\ncenturies of peace and plenty stretch before us as far as the\nimagination cares to travel.\"\n\nHe smiled luminously.\n\nThe smile faded as he saw that Wehling had just drawn a revolver.\n\nWehling shot Dr. Hitz dead. \"There's room for one--a great big one,\" he\nsaid.\n\nAnd then he shot Leora Duncan. \"It's only death,\" he said to her as she\nfell. \"There! Room for two.\"\n\nAnd then he shot himself, making room for all three of his children.\n\nNobody came running. Nobody, seemingly, heard the shots.\n\nThe painter sat on the top of his stepladder, looking down reflectively\non the sorry scene.\n\n       *       *       *       *       *\n\nThe painter pondered the mournful puzzle of life demanding to be born\nand, once born, demanding to be fruitful ... to multiply and to live as\nlong as possible--to do all that on a very small planet that would have\nto last forever.\n\nAll the answers that the painter could think of were grim. Even grimmer,\nsurely, than a Catbox, a Happy Hooligan, an Easy Go. He thought of war.\nHe thought of plague. He thought of starvation.\n\nHe knew that he would never paint again. He let his paintbrush fall to\nthe dropcloths below. And then he decided he had had about enough of\nlife in the Happy Garden of Life, too, and he came slowly down from the\nladder.\n\nHe took Wehling's pistol, really intending to shoot himself.\n\nBut he didn't have the nerve.\n\nAnd then he saw the telephone booth in the corner of the room. He went\nto it, dialed the well-remembered number: \"2 B R 0 2 B.\"\n\n\"Federal Bureau of Termination,\" said the very warm voice of a hostess.\n\n\"How soon could I get an appointment?\" he asked, speaking very\ncarefully.\n\n\"We could probably fit you in late this afternoon, sir,\" she said. \"It\nmight even be earlier, if we get a cancellation.\"\n\n\"All right,\" said the painter, \"fit me in, if you please.\" And he gave\nher his name, spelling it out.\n\n\"Thank you, sir,\" said the hostess. \"Your city thanks you; your country\nthanks you; your planet thanks you. But the deepest thanks of all is\nfrom future generations.\"\n\n\nEND", "title": "2 B R 0 2 B"}