{"summary": "The play is set in the court of Malfi (Amalfi), Italy 1504 to 1510. The recently widowed Duchess falls in love with Antonio, a lowly steward, but her brothers, not wishing her to share their inheritance and desperate to evade a degrading association with their social inferiors, forbid her from remarrying. She marries Antonio in secret and bears him three children before they are found out.\nThe Duchess's lunatic and incestuously obsessed brother, Ferdinand threatens and disowns her. In an attempt to escape, she and Antonio concoct a story that he has swindled her out of her fortune and has to flee into exile. She takes Bosola into her confidence, not knowing that he is Ferdinand's spy, and arranges that he will deliver her jewellery to Antonio at his hiding-place in Ancona. She will join them later, whilst pretending to make a pilgrimage to a town nearby. The Cardinal hears of the plan, instructs Bosola to banish the two lovers, and sends soldiers to capture them. Antonio escapes with their eldest son, but the Duchess, her maid, and her two younger children are returned to Malfi and, under instructions from Ferdinand, die at the hands of Bosola's executioners. This experience, combined with a long-standing sense of injustice and his own feeling of a lack of identity, turns Bosola against the Cardinal and his brother, deciding to take up the cause of \"Revenge for the Duchess of Malfi\" (V.2).\nThe Cardinal confesses to his mistress, Julia, his part in the killing of the Duchess and then murders her to silence her, using a poisoned Bible. Next, Bosola overhears the Cardinal plotting to kill him (though he accepts what he sees as punishment for his actions) and so visits the darkened chapel to kill the Cardinal at his prayers. Instead, he mistakenly kills Antonio, who has just returned to Malfi to attempt a reconciliation with the Cardinal. Bosola then stabs the Cardinal, who dies. In the brawl that follows, Ferdinand and Bosola stab each other to death.\nAntonio's elder son by the Duchess appears in the final scene and takes his place as the heir to the Malfi fortune, despite his father's explicit wish that he \"fly the court of princes\", a corrupt and increasingly deadly environment.\n\nAct 1\nScene 1—The Duchess’s palace in Malfi: Antonio and Delio are discussing the former's return from France, and discussing how the French king runs his court, comparing it to an easily poisoned fountain. They are interrupted by the entry of Bosola and the Cardinal. Antonio and Delio hold their conversation, stepping to the background to watch as Bosola angrily tries to gain the Cardinal’s pardon, speaking of the time he has spent in the galleys in penal servitude, and in the service of the Cardinal. Bosola declares that he is surely done with service, but the Cardinal is not interested in Bosola’s new merit, and takes his leave. Bosola compares himself to Tantalus, never able to acquire the thing he most desires, like an injured soldier who can only depend on his crutches for support of any kind. When he leaves, Antonio and Delio comment on his past offence, and how he will surely come to no good if he is kept in neglect. Ferdinand comes into the palace, talking to his courtiers about a tournament that Antonio has just won. When the Cardinal, Duchess, and Cariola enter to speak with Ferdinand, Antonio and Delio have a moment to themselves to discuss the Cardinal’s character; he is found to be a very dishonest, disagreeable person, as is his brother, Ferdinand. Only their sister, the Duchess, earns the approval of everyone, a very pleasant and gracious woman. After the two gentlemen leave, Ferdinand petitions his sister to make Bosola the manager of her horses; when everyone else leaves, Ferdinand and the Cardinal reveal that it is because Bosola is to spy on their sister. When Bosola is brought in and made aware of this plan, he at first refuses, but ultimately is given no choice. The Cardinal and Ferdinand then turn their attention to their sister, urging her not to marry again, now that she is a widow, going so far as to threaten her with death, in Ferdinand’s case. She refuses to be bullied, and once her brothers are out of sight, she proposes to Antonio by giving him her wedding ring. Having Cariola, the Duchess's maid, as their witness, this private ceremony is legally binding and the Duchess and Antonio become husband and wife.\nAct 2\nScene 1—The Duchess’s palace in Malfi, nine months later: Bosola and Castruchio enter, Bosola criticising his companion’s appearance, and telling him that he would make a ridiculous judge. When an old woman intrudes on their conversation, Bosola’s insults turn on her, calling her hideous to the point that no amount of make-up would help. He also accuses her of being too like a witch; the old lady and Castruchio leave Bosola alone to muse on the mysterious way the Duchess is acting of late. He believes she is pregnant (no one but Delio and Cariola know that the Duchess and Antonio are married), and aims to prove it by using apricots both to spark her pregnant appetite and to induce labour, as apricots were believed to do. The Duchess, when she enters, accepts the fruit from Bosola, and quickly starts going into labour. She then retires to her chamber claiming to be ill, with a worried Antonio following in her wake.\nScene 2—Same place and time as the previous scene: Bosola, alone, realises that the Duchess is indeed pregnant. After accosting the hapless old lady again, he watches as Antonio and the servants in a commotion about a Swiss mercenary who had invaded the Duchess’s room, and the loss of several jewels and gold utensils. Even with all the uproar, Antonio is not distracted from his wife’s “illness”; she is actually in labour. Cariola, the lady’s maid, enters with good news once Antonio is alone—he is the father of a son.\nScene 3—Same place and time as the previous scene: Bosola re-enters the now empty room, having heard a woman (the Duchess) shriek. Antonio discovers him, and questions his purpose in being there, since everyone had been commanded to keep to their rooms. Antonio tells him to stay away from the Duchess, since he doesn’t trust Bosola. In Antonio’s agitation, he accidentally drops a horoscope for his son’s birth, which Bosola retrieves. He realises what it means, and resolves to send it to the Duchess’s brothers with Castruchio.\nScene 4—The Cardinal’s rooms: The Cardinal and his mistress, Julia, are discussing their rendezvous, when a messenger calls the Cardinal away with an important message. Delio enters to find Julia alone. He was once a suitor of hers, and offers her money. Julia leaves to meet her husband, Castruchio, and Delio fears that her husband’s arrival means Antonio’s secret marriage is about to be revealed.\nScene 5—Rome, in Ferdinand’s private apartments: An enraged Ferdinand, with the letter from Bosola, and his brother the Cardinal, meet to discuss what they think is an awful treachery by their sister. Ferdinand is angry to the point of shouting about his sister’s “whorish” behaviour (he knows of the child, but not of the marriage), and the Cardinal struggles to control his brother’s temperamental outburst. Ferdinand resolves to discover the man his sister is seeing, threatening all and sundry.\nAct 3\nScene 1—The Duchess’s palace in Malfi, after some time has passed: Antonio greets the returning Delio, who has come from Rome with Ferdinand. Antonio reveals that the Duchess has had two more children in the time Delio was gone. Antonio fears the wrath of the recently arrived Ferdinand, and Delio tells him the ordinary people think the Duchess is a whore. While they talk, the Duchess and Ferdinand enter. He tells her that he has found a husband for her, the Count Malateste. She disregards this, as she is already married (still secretly of course) to Antonio. When left alone, Ferdinand consults with Bosola to discover the father of the three seemingly illegitimate children; Bosola has acquired a skeleton key to the Duchess’s room, which Ferdinand takes, telling him to guess what will happen next.\nScene 2—The Duchess’s bedchamber: Antonio comes up to the Duchess’s bedroom to spend the night, and they banter back and forth about the point of lovers just sleeping together. Antonio and Cariola leave to allow the Duchess to complete her night-time preparations, but she is not alone; Ferdinand sneaks in and startles her. He gives her a knife, intending her to kill herself, and his fury increases when she tells him she is married without his knowledge. Ferdinand leaves, declaring he will never see her again. He exits just in time, for Antonio bursts in brandishing a pistol, but the Duchess forces him to leave again when Bosola knocks at the door. Bosola informs the Duchess that Ferdinand has left for Rome again, and she tells him that Ferdinand’s bills of exchange (he has so far dealt with her accounts) will no longer work, since Antonio has been false with her accounts. This is, of course, a trick to get Antonio out of Malfi; she calls Antonio back in (once Bosola exits) to tell him to flee to Ancona, where she will send him all her treasure and valuables. The couple puts on a show argument for the benefit of the returning Bosola and officers, where she criticises his faulty record keeping and banishes him. Bosola does not believe the Duchess was justified in banishing Antonio, and tells her that Antonio is a good, honest man. This speech prompts the Duchess to confide the secret marriage to Bosola. He is then left on stage to lament his role as a spy, for now he must reveal all to Ferdinand.\nScene 3—A room in a palace at Rome: The Cardinal, Ferdinand, Malateste, Pescara, Silvio and Delio are discussing the new fortifications that are being made in Naples. Ferdinand and his men, leaving the Cardinal and Malateste to speak privately, are very harsh in their critique of Malateste, considering him too cowardly to fight in an upcoming battle. Bosola, meanwhile, interrupts the Cardinal's private conference with news of his sister. The Cardinal leaves to petition for her and her family’s exile from Ancona, while Bosola goes to tell the Duchess’s first child (from her first husband) what has happened with his mother. Ferdinand goes to find Antonio.\nScene 4—The shrine of Our Lady of Loreto, Italy, in the Ancona province: Two pilgrims are visiting the shrine in Ancona, and witness the Cardinal being symbolically prepared for war. The Cardinal then proceeds to take the Duchess’s wedding ring, banish her, Antonio, and their children, while the pilgrims muse over the reason for what they have just seen.\nScene 5—Near Loreto: The newly banished family, and the maid Coriola, enter Loreto. Shortly after their arrival, Bosola comes and presents the Duchess with a letter from Ferdinand, which indirectly states that Ferdinand wants Antonio dead. Antonio tells Bosola that he will not go to Ferdinand, and the Duchess urges him to take the oldest child and go to Milan to find safety, which he promptly does. Bosola and masked guards then take the Duchess and her remaining children captive, on the orders of her brothers.\nAct 4\nScene 1—A prison (or the Duchess’s lodgings serving as a prison) near Loreto: Ferdinand comes in with Bosola, who is describing to him how the Duchess is dealing with her imprisonment. It seems she is not affected to Ferdinand’s satisfaction, and he leaves angrily. Bosola greets the Duchess, telling her that her brother wishes to speak with her, but will not do so where he can see her. She agrees to meet with her brother in the darkness. Once the lights are out, Ferdinand returns. He presents her with a dead man’s hand, leading her to believe that it is Antonio’s, with her wedding ring on it. He then exits, leaving Bosola to show the Duchess lifelike figures of her husband and children, made to appear as though her family was dead. The Duchess believes them to be the genuine articles, and resolves to die—her despair is so deep it affects Bosola. When she leaves, Ferdinand re-enters; Bosola pleads with him to send his sister to a convent, refusing to be a part of the plot any more. Ferdinand is beyond reason at this point, and tells Bosola to go to Milan to find the real Antonio.\nScene 2—Same place and time as the previous scene: The Duchess and her maid, Cariola, come back, distracted by the noises being made by a group of madmen (Ferdinand brought them in to terrorise her). A servant tells her that they were brought for sport, and lets in several of the madmen. Bosola, too, sneaks in with them, disguised as an old man, and tells the Duchess that he is there to make her tomb. When she tries to pull rank on him, executioners with cords and a coffin come in. Cariola is removed from the room, leaving Bosola and the executioners with the Duchess. The Duchess makes a brave show, telling the executioners to “pull, and pull strongly”, welcoming her strangulation. Cariola is brought back, and after struggling fiercely, she too is strangled. Ferdinand comes to view the scene, and is also shown the bodies of his sister’s children, who were murdered as well. Ferdinand reveals that he and the Duchess were twins, and that he had hoped, if she had remained a widow, to inherit all her wealth. Bosola, sensing that Ferdinand is ready to turn on him next, demands payment for his atrocities. Ferdinand, distracted, leaves him alone with the bodies. Astonishingly, the Duchess is not dead. A shocked Bosola has no time to call for medicine; he manages to tell the Duchess that Antonio is not really dead; that the figures she saw were fake, before she finally dies. Bosola, remorseful at last, takes her body to the care of some good women, planning to leave immediately thereafter for Milan.\nAct 5\nScene 1—Outside Ferdinand and the Cardinal’s palace in Milan: Antonio returns to see if he can reconcile with Ferdinand and the Cardinal, but Delio is dubious as to the wisdom of this. Delio asks Pescara, a marquis, to give him possession of Antonio’s estate for safekeeping, but Pescara denies him. Julia presents Pescara with a letter from the Cardinal, which states that she should receive Antonio’s property, and which Pescara grants to her. When Delio confronts him about this, Pescara says that he would not give an innocent man a property that was taken from someone by such vile means (the Cardinal took the property for himself once Antonio was banished), for it will now become an appropriate place for the Cardinal’s mistress. This statement impresses the hidden Antonio. When Pescara leaves to visit an ill Ferdinand, Antonio decides to pay a night-time visit to the Cardinal.\nScene 2—Inside the same palace: Pescara, come to visit Ferdinand, is discussing his condition with the doctor, who believes Ferdinand may have lycanthropia: a condition whereby he believes he is a wolf. The doctor thinks there is a chance of a relapse, in which case Ferdinand's diseased behaviour would return; namely, digging up dead bodies at night. Pescara and the doctor make way for the mad Ferdinand, who attacks his own shadow. The Cardinal, who has entered with Ferdinand, manages to catch Bosola, who has been watching Ferdinand's ravings. The Cardinal assigns Bosola to seek out Antonio (by following Delio) and then slay him. After the Cardinal leaves, Bosola does not even make it to the door before he is stopped by Julia, who is brandishing a pistol. She accuses him of having given her a love potion, and threatens to kill him to end her love. Bosola manages to disarm her and convince her to gather intelligence for him about the Cardinal. Bosola then hides while Julia uses all of her persuasive powers to get the Cardinal to reveal his part in the death of his sister and her children. The Cardinal then makes Julia swear to keep silent, forcing her to kiss the poisoned cover of a bible, causing her to die almost instantly. Bosola comes out of hiding to confront the Cardinal, although he declares that he still intends to kill Antonio. Giving him a master key, the Cardinal takes his leave. However, once he is alone, Bosola swears to protect Antonio, and goes off to bury Julia's body.\nScene 3—A courtyard outside the same palace: Delio and Antonio are near the Duchess’s tomb; as they talk, an echo from the tomb mirrors their conversation. Delio leaves to find Antonio’s eldest son, and Antonio leaves to escape the distressing echo of his wife’s resting place.\nScene 4—The Cardinal’s apartments in Milan: The Cardinal enters, trying to dissuade Pescara, Malateste, Roderigo and Grisolan from staying to keep watch over Ferdinand. He goes so far as to say that he might feign mad fits to test their obedience; if they come to help, they will be in trouble. They unwillingly exit, and Bosola enters to find the Cardinal planning to have him killed. Antonio, unaware of Bosola, sneaks in while it is dark, planning to seek audience with the Cardinal. Not realising who has entered, Bosola attacks Antonio; he is horrified to see his mistake. He manages to relate the death of the Duchess and children to the dying Antonio, who is glad to be dying in sadness, now that life is pointless for him. Bosola then leaves to bring down the Cardinal.\nScene 5—The same apartments, near Julia’s lodging: The Cardinal, unaware of what has just happened, is reading a book when Bosola enter with a servant, who is bearing Antonio’s body. He threatens the Cardinal, who calls for help. Help is not forthcoming, for the gentlemen from the beginning of the previous scene, while they can hear him calling, have no desire to go to his aid (because of his previous order to not at any cost try to help Ferdinand). Bosola kills the servant of the Cardinal first, and then stabs the Cardinal. Ferdinand bursts in, also attacking his brother; in the fight, he accidentally wounds Bosola. Bosola kills Ferdinand, and is left with the dying Cardinal. The gentlemen who heard the cries now enter the room to witness the deaths of the Cardinal and Bosola. Delio enters too late with Antonio’s eldest son, and laments the unfortunate events that have passed.\n\n", "full_text": "THE DUCHESS OF MALFI\n\nby John Webster\n\n\n\n\nINTRODUCTORY NOTE\n\nOf John Webster's life almost nothing is known.  The dates 1580-1625\ngiven for his birth and death are conjectural inferences, about which\nthe best that can be said is that no known facts contradict them.\n\nThe first notice of Webster so far discovered shows that he was\ncollaborating in the production of plays for the theatrical manager,\nHenslowe, in 1602, and of such collaboration he seems to have done\na considerable amount.  Four plays exist which he wrote alone,\n\"The White Devil,\" \"The Duchess of Malfi,\" \"The Devil's Law-Case,\"\nand \"Appius and Virginia.\"\n\n\"The Duchess of Malfi\" was published in 1623, but the date of writing\nmay have been as early as 1611.  It is based on a story in Painter's\n\"Palace of Pleasure,\" translated from the Italian novelist, Bandello;\nand it is entirely possible that it has a foundation in fact.  In any\ncase, it portrays with a terrible vividness one side of the court\nlife of the Italian Renaissance; and its picture of the fierce quest\nof pleasure, the recklessness of crime, and the worldliness of the\ngreat princes of the Church finds only too ready corroboration in\nthe annals of the time.\n\nWebster's tragedies come toward the close of the great series\nof tragedies of blood and revenge, in which \"The Spanish Tragedy\"\nand \"Hamlet\" are landmarks, but before decadence can fairly be said\nto have set in.  He, indeed, loads his scene with horrors almost past\nthe point which modern taste can bear; but the intensity of his\ndramatic situations, and his superb power of flashing in a single\nline a light into the recesses of the human heart at the crises\nof supreme emotion, redeems him from mere sensationalism, and places\nhis best things in the first rank of dramatic writing.\n\n\n\n\nTHE DUCHESS OF MALFI\n\n\nDramatis Personae:\n\nFERDINAND [Duke of Calabria].\nCARDINAL [his brother].\nANTONIO [BOLOGNA, Steward of the Household to the Duchess].\nDELIO [his friend].\nDANIEL DE BOSOLA [Gentleman of the Horse to the Duchess].\n[CASTRUCCIO, an old Lord].\nMARQUIS OF PESCARA.\n[COUNT] MALATESTI.\nRODERIGO, ]\nSILVIO,   ] [Lords].\nGRISOLAN, ]\nDOCTOR.\nThe Several Madmen.\n\nDUCHESS [OF MALFI].\nCARIOLA [her woman].\n[JULIA, Castruccio's wife, and] the Cardinal's mistress.\n[Old Lady].\n\nLadies, Three Young Children, Two Pilgrims, Executioners,\nCourt Officers, and Attendants.\n\n\n\n       ACT I\n\n\n       SCENE I[1]\n\n       [Enter] ANTONIO and DELIO\n\n  DELIO.  You are welcome to your country, dear Antonio;\n  You have been long in France, and you return\n  A very formal Frenchman in your habit:\n  How do you like the French court?\n\n  ANTONIO.                          I admire it:\n  In seeking to reduce both state and people\n  To a fix'd order, their judicious king\n  Begins at home; quits first his royal palace\n  Of flattering sycophants, of dissolute\n  And infamous persons,--which he sweetly terms\n  His master's master-piece, the work of heaven;\n  Considering duly that a prince's court\n  Is like a common fountain, whence should flow\n  Pure silver drops in general, but if 't chance\n  Some curs'd example poison 't near the head,\n  Death and diseases through the whole land spread.\n  And what is 't makes this blessed government\n  But a most provident council, who dare freely\n  Inform him the corruption of the times?\n  Though some o' the court hold it presumption\n  To instruct princes what they ought to do,\n  It is a noble duty to inform them\n  What they ought to foresee.[2]--Here comes Bosola,\n  The only court-gall; yet I observe his railing\n  Is not for simple love of piety:\n  Indeed, he rails at those things which he wants;\n  Would be as lecherous, covetous, or proud,\n  Bloody, or envious, as any man,\n  If he had means to be so.--Here's the cardinal.\n\n       [Enter CARDINAL and BOSOLA]\n\n  BOSOLA.  I do haunt you still.\n\n  CARDINAL.  So.\n\n  BOSOLA.  I have done you better service than to be slighted thus.\n  Miserable age, where only the reward of doing well is the doing\n  of it!\n\n  CARDINAL.  You enforce your merit too much.\n\n  BOSOLA.  I fell into the galleys in your service:  where, for two\n  years together, I wore two towels instead of a shirt, with a knot\n  on the shoulder, after the fashion of a Roman mantle.  Slighted thus!\n  I will thrive some way.  Black-birds fatten best in hard weather;\n  why not I in these dog-days?\n\n  CARDINAL.  Would you could become honest!\n\n  BOSOLA.  With all your divinity do but direct me the way to it.\n  I have known many travel far for it, and yet return as arrant knaves\n  as they went forth, because they carried themselves always along with\n  them.  [Exit CARDINAL.] Are you gone?  Some fellows, they say,\n  are possessed with the devil, but this great fellow were able\n  to possess the greatest devil, and make him worse.\n\n  ANTONIO.  He hath denied thee some suit?\n\n  BOSOLA.  He and his brother are like plum-trees that grow crooked\n  over standing-pools; they are rich and o'erladen with fruit, but none\n  but crows, pies, and caterpillars feed on them.  Could I be one\n  of their flattering panders, I would hang on their ears like a\n  horseleech, till I were full, and then drop off.  I pray, leave me.\n  Who would rely upon these miserable dependencies, in expectation\n  to be advanc'd to-morrow?  What creature ever fed worse than hoping\n  Tantalus?  Nor ever died any man more fearfully than he that hoped\n  for a pardon.  There are rewards for hawks and dogs when they have\n  done us service; but for a soldier that hazards his limbs in a\n  battle, nothing but a kind of geometry is his last supportation.\n\n  DELIO.  Geometry?\n\n  BOSOLA.  Ay, to hang in a fair pair of slings, take his latter swing\n  in the world upon an honourable pair of crutches, from hospital\n  to hospital.  Fare ye well, sir:  and yet do not you scorn us;\n  for places in the court are but like beds in the hospital, where\n  this man's head lies at that man's foot, and so lower and lower.\n       [Exit.]\n\n  DELIO.  I knew this fellow seven years in the galleys\n  For a notorious murder; and 'twas thought\n  The cardinal suborn'd it:  he was releas'd\n  By the French general, Gaston de Foix,\n  When he recover'd Naples.\n\n  ANTONIO.                  'Tis great pity\n  He should be thus neglected:  I have heard\n  He 's very valiant.  This foul melancholy\n  Will poison all his goodness; for, I 'll tell you,\n  If too immoderate sleep be truly said\n  To be an inward rust unto the soul,\n  If then doth follow want of action\n  Breeds all black malcontents; and their close rearing,\n  Like moths in cloth, do hurt for want of wearing.\n\n\n       SCENE II[3]\n\n       ANTONIO, DELIO, [Enter SILVIO, CASTRUCCIO, JULIA, RODERIGO\n       and GRISOLAN]\n\n  DELIO.  The presence 'gins to fill:  you promis'd me\n  To make me the partaker of the natures\n  Of some of your great courtiers.\n\n  ANTONIO.                          The lord cardinal's\n  And other strangers' that are now in court?\n  I shall.--Here comes the great Calabrian duke.\n\n       [Enter FERDINAND and Attendants]\n\n  FERDINAND.  Who took the ring oftenest?[4]\n\n  SILVIO.  Antonio Bologna, my lord.\n\n  FERDINAND.  Our sister duchess' great-master of her household?\n  Give him the jewel.--When shall we leave this sportive action,\n  and fall to action indeed?\n\n  CASTRUCCIO.  Methinks, my lord, you should not desire to go to war\n  in person.\n\n  FERDINAND.  Now for some gravity.--Why, my lord?\n\n  CASTRUCCIO.  It is fitting a soldier arise to be a prince, but not\n  necessary a prince descend to be a captain.\n\n  FERDINAND.  No?\n\n  CASTRUCCIO.  No, my lord; he were far better do it by a deputy.\n\n  FERDINAND.  Why should he not as well sleep or eat by a deputy?\n  This might take idle, offensive, and base office from him, whereas\n  the other deprives him of honour.\n\n  CASTRUCCIO.  Believe my experience, that realm is never long in quiet\n  where the ruler is a soldier.\n\n  FERDINAND.  Thou toldest me thy wife could not endure fighting.\n\n  CASTRUCCIO.  True, my lord.\n\n  FERDINAND.  And of a jest she broke of[5] a captain she met full of\n  wounds:  I have forgot it.\n\n  CASTRUCCIO.  She told him, my lord, he was a pitiful fellow, to lie,\n  like the children of Ismael, all in tents.[6]\n\n  FERDINAND.  Why, there's a wit were able to undo all the\n  chirurgeons[7] o' the city; for although gallants should quarrel,\n  and had drawn their weapons, and were ready to go to it, yet her\n  persuasions would make them put up.\n\n  CASTRUCCIO.  That she would, my lord.--How do you like my Spanish\n  gennet?[8]\n\n  RODERIGO.  He is all fire.\n\n  FERDINAND.  I am of Pliny's opinion, I think he was begot\n  by the wind; he runs as if he were ballass'd[9] with quicksilver.\n\n  SILVIO.  True, my lord, he reels from the tilt often.\n\n  RODERIGO, GRISOLAN.  Ha, ha, ha!\n\n  FERDINAND.  Why do you laugh?  Methinks you that are courtiers\n  should be my touch-wood, take fire when I give fire; that is,\n  laugh when I laugh, were the subject never so witty.\n\n  CASTRUCCIO.  True, my lord:  I myself have heard a very good jest,\n  and have scorn'd to seem to have so silly a wit as to understand it.\n\n  FERDINAND.  But I can laugh at your fool, my lord.\n\n  CASTRUCCIO.  He cannot speak, you know, but he makes faces; my lady\n  cannot abide him.\n\n  FERDINAND.  No?\n\n  CASTRUCCIO.  Nor endure to be in merry company; for she says too much\n  laughing, and too much company, fills her too full of the wrinkle.\n\n  FERDINAND.  I would, then, have a mathematical instrument made\n  for her face, that she might not laugh out of compass.--I shall\n  shortly visit you at Milan, Lord Silvio.\n\n  SILVIO.  Your grace shall arrive most welcome.\n\n  FERDINAND.  You are a good horseman, Antonio; you have excellent\n  riders in France:  what do you think of good horsemanship?\n\n  ANTONIO.  Nobly, my lord:  as out of the Grecian horse issued many\n  famous princes, so out of brave horsemanship arise the first sparks\n  of growing resolution, that raise the mind to noble action.\n\n  FERDINAND.  You have bespoke it worthily.\n\n  SILVIO.  Your brother, the lord cardinal, and sister duchess.\n\n       [Enter CARDINAL, with DUCHESS, and CARIOLA]\n\n  CARDINAL.  Are the galleys come about?\n\n  GRISOLAN.                               They are, my lord.\n\n  FERDINAND.  Here 's the Lord Silvio is come to take his leave.\n\n  DELIO.  Now, sir, your promise:  what 's that cardinal?\n  I mean his temper?  They say he 's a brave fellow,\n  Will play his five thousand crowns at tennis, dance,\n  Court ladies, and one that hath fought single combats.\n\n  ANTONIO.  Some such flashes superficially hang on him for form;\n  but observe his inward character:  he is a melancholy churchman.\n  The spring in his face is nothing but the engend'ring of toads;\n  where he is jealous of any man, he lays worse plots for them than\n  ever was impos'd on Hercules, for he strews in his way flatterers,\n  panders, intelligencers, atheists, and a thousand such political\n  monsters.  He should have been Pope; but instead of coming to it\n  by the primitive decency of the church, he did bestow bribes\n  so largely and so impudently as if he would have carried it away\n  without heaven's knowledge.  Some good he hath done----\n\n  DELIO.  You have given too much of him.  What 's his brother?\n\n  ANTONIO.  The duke there?  A most perverse and turbulent nature.\n  What appears in him mirth is merely outside;\n  If he laught heartily, it is to laugh\n  All honesty out of fashion.\n\n  DELIO.                       Twins?\n\n  ANTONIO.                             In quality.\n  He speaks with others' tongues, and hears men's suits\n  With others' ears; will seem to sleep o' the bench\n  Only to entrap offenders in their answers;\n  Dooms men to death by information;\n  Rewards by hearsay.\n\n  DELIO.              Then the law to him\n  Is like a foul, black cobweb to a spider,--\n  He makes it his dwelling and a prison\n  To entangle those shall feed him.\n\n  ANTONIO.                           Most true:\n  He never pays debts unless they be shrewd turns,\n  And those he will confess that he doth owe.\n  Last, for this brother there, the cardinal,\n  They that do flatter him most say oracles\n  Hang at his lips; and verily I believe them,\n  For the devil speaks in them.\n  But for their sister, the right noble duchess,\n  You never fix'd your eye on three fair medals\n  Cast in one figure, of so different temper.\n  For her discourse, it is so full of rapture,\n  You only will begin then to be sorry\n  When she doth end her speech, and wish, in wonder,\n  She held it less vain-glory to talk much,\n  Than your penance to hear her.  Whilst she speaks,\n  She throws upon a man so sweet a look\n  That it were able to raise one to a galliard.[10]\n  That lay in a dead palsy, and to dote\n  On that sweet countenance; but in that look\n  There speaketh so divine a continence\n  As cuts off all lascivious and vain hope.\n  Her days are practis'd in such noble virtue,\n  That sure her nights, nay, more, her very sleeps,\n  Are more in heaven than other ladies' shrifts.\n  Let all sweet ladies break their flatt'ring glasses,\n  And dress themselves in her.\n\n  DELIO.                        Fie, Antonio,\n  You play the wire-drawer with her commendations.\n\n  ANTONIO.  I 'll case the picture up:  only thus much;\n  All her particular worth grows to this sum,--\n  She stains[11] the time past, lights the time to come.\n\n  CARIOLA.  You must attend my lady in the gallery,\n  Some half and hour hence.\n\n  ANTONIO.                   I shall.\n       [Exeunt ANTONIO and DELIO.]\n\n  FERDINAND.  Sister, I have a suit to you.\n\n  DUCHESS.                                   To me, sir?\n\n  FERDINAND.  A gentleman here, Daniel de Bosola,\n  One that was in the galleys----\n\n  DUCHESS.                       Yes, I know him.\n\n  FERDINAND.  A worthy fellow he is:  pray, let me entreat for\n  The provisorship of your horse.\n\n  DUCHESS.                         Your knowledge of him\n  Commends him and prefers him.\n\n  FERDINAND.                     Call him hither.\n       [Exit Attendant.]\n  We [are] now upon[12] parting.  Good Lord Silvio,\n  Do us commend to all our noble friends\n  At the leaguer.\n\n  SILVIO.          Sir, I shall.\n\n  [DUCHESS.]                      You are for Milan?\n\n  SILVIO.  I am.\n\n  DUCHESS.        Bring the caroches.[13]--We 'll bring you down\n  To the haven.\n       [Exeunt DUCHESS, SILVIO, CASTRUCCIO, RODERIGO, GRISOLAN,\n       CARIOLA, JULIA, and Attendants.]\n\n  CARDINAL.      Be sure you entertain that Bosola\n  For your intelligence.[14]  I would not be seen in 't;\n  And therefore many times I have slighted him\n  When he did court our furtherance, as this morning.\n\n  FERDINAND.  Antonio, the great-master of her household,\n  Had been far fitter.\n\n  CARDINAL.             You are deceiv'd in him.\n  His nature is too honest for such business.--\n  He comes:  I 'll leave you.\n       [Exit.]\n\n       [Re-enter BOSOLA]\n\n  BOSOLA.                      I was lur'd to you.\n\n  FERDINAND.  My brother, here, the cardinal, could never\n  Abide you.\n\n  BOSOLA.     Never since he was in my debt.\n\n  FERDINAND.  May be some oblique character in your face\n  Made him suspect you.\n\n  BOSOLA.                Doth he study physiognomy?\n  There 's no more credit to be given to the face\n  Than to a sick man's urine, which some call\n  The physician's whore, because she cozens[15] him.\n  He did suspect me wrongfully.\n\n  FERDINAND.                     For that\n  You must give great men leave to take their times.\n  Distrust doth cause us seldom be deceiv'd.\n  You see the oft shaking of the cedar-tree\n  Fastens it more at root.\n\n  BOSOLA.                   Yet take heed;\n  For to suspect a friend unworthily\n  Instructs him the next way to suspect you,\n  And prompts him to deceive you.\n\n  FERDINAND.                       There 's gold.\n\n  BOSOLA.                                          So:\n  What follows?  [Aside.] Never rain'd such showers as these\n  Without thunderbolts i' the tail of them.--Whose throat must I cut?\n\n  FERDINAND.  Your inclination to shed blood rides post\n  Before my occasion to use you.  I give you that\n  To live i' the court here, and observe the duchess;\n  To note all the particulars of her haviour,\n  What suitors do solicit her for marriage,\n  And whom she best affects.  She 's a young widow:\n  I would not have her marry again.\n\n  BOSOLA.                            No, sir?\n\n  FERDINAND.  Do not you ask the reason; but be satisfied.\n  I say I would not.\n\n  BOSOLA.             It seems you would create me\n  One of your familiars.\n\n  FERDINAND.              Familiar!  What 's that?\n\n  BOSOLA.  Why, a very quaint invisible devil in flesh,--\n  An intelligencer.[16]\n\n  FERDINAND.          Such a kind of thriving thing\n  I would wish thee; and ere long thou mayst arrive\n  At a higher place by 't.\n\n  BOSOLA.                   Take your devils,\n  Which hell calls angels!  These curs'd gifts would make\n  You a corrupter, me an impudent traitor;\n  And should I take these, they'd take me [to] hell.\n\n  FERDINAND.  Sir, I 'll take nothing from you that I have given.\n  There is a place that I procur'd for you\n  This morning, the provisorship o' the horse;\n  Have you heard on 't?\n\n  BOSOLA.                No.\n\n  FERDINAND.                  'Tis yours:  is 't not worth thanks?\n\n  BOSOLA.  I would have you curse yourself now, that your bounty\n  (Which makes men truly noble) e'er should make me\n  A villain.  O, that to avoid ingratitude\n  For the good deed you have done me, I must do\n  All the ill man can invent!  Thus the devil\n  Candies all sins o'er; and what heaven terms vile,\n  That names he complimental.\n\n  FERDINAND.                   Be yourself;\n  Keep your old garb of melancholy; 'twill express\n  You envy those that stand above your reach,\n  Yet strive not to come near 'em.  This will gain\n  Access to private lodgings, where yourself\n  May, like a politic dormouse----\n\n  BOSOLA.                         As I have seen some\n  Feed in a lord's dish, half asleep, not seeming\n  To listen to any talk; and yet these rogues\n  Have cut his throat in a dream.  What 's my place?\n  The provisorship o' the horse?  Say, then, my corruption\n  Grew out of horse-dung:  I am your creature.\n\n  FERDINAND.                                    Away!\n       [Exit.]\n\n  BOSOLA.  Let good men, for good deeds, covet good fame,\n  Since place and riches oft are bribes of shame.\n  Sometimes the devil doth preach.\n       [Exit.]\n\n\n       [Scene III][17]\n\n       [Enter FERDINAND, DUCHESS, CARDINAL, and CARIOLA]\n\n  CARDINAL.  We are to part from you; and your own discretion\n  Must now be your director.\n\n  FERDINAND.                  You are a widow:\n  You know already what man is; and therefore\n  Let not youth, high promotion, eloquence----\n\n  CARDINAL.  No,\n  Nor anything without the addition, honour,\n  Sway your high blood.\n\n  FERDINAND.             Marry! they are most luxurious[18]\n  Will wed twice.\n\n  CARDINAL.        O, fie!\n\n  FERDINAND.                Their livers are more spotted\n  Than Laban's sheep.[19]\n\n  DUCHESS.              Diamonds are of most value,\n  They say, that have pass'd through most jewellers' hands.\n\n  FERDINAND.  Whores by that rule are precious.\n\n  DUCHESS.                                       Will you hear me?\n  I 'll never marry.\n\n  CARDINAL.           So most widows say;\n  But commonly that motion lasts no longer\n  Than the turning of an hour-glass:  the funeral sermon\n  And it end both together.\n\n  FERDINAND.                 Now hear me:\n  You live in a rank pasture, here, i' the court;\n  There is a kind of honey-dew that 's deadly;\n  'T will poison your fame; look to 't.  Be not cunning;\n  For they whose faces do belie their hearts\n  Are witches ere they arrive at twenty years,\n  Ay, and give the devil suck.\n\n  DUCHESS.  This is terrible good counsel.\n\n  FERDINAND.  Hypocrisy is woven of a fine small thread,\n  Subtler than Vulcan's engine:[20] yet, believe 't,\n  Your darkest actions, nay, your privat'st thoughts,\n  Will come to light.\n\n  CARDINAL.            You may flatter yourself,\n  And take your own choice; privately be married\n  Under the eaves of night----\n\n  FERDINAND.                  Think 't the best voyage\n  That e'er you made; like the irregular crab,\n  Which, though 't goes backward, thinks that it goes right\n  Because it goes its own way:  but observe,\n  Such weddings may more properly be said\n  To be executed than celebrated.\n\n  CARDINAL.                        The marriage night\n  Is the entrance into some prison.\n\n  FERDINAND.                         And those joys,\n  Those lustful pleasures, are like heavy sleeps\n  Which do fore-run man's mischief.\n\n  CARDINAL.                          Fare you well.\n  Wisdom begins at the end:  remember it.\n       [Exit.]\n\n  DUCHESS.  I think this speech between you both was studied,\n  It came so roundly off.\n\n  FERDINAND.               You are my sister;\n  This was my father's poniard, do you see?\n  I 'd be loth to see 't look rusty, 'cause 'twas his.\n  I would have you give o'er these chargeable revels:\n  A visor and a mask are whispering-rooms\n  That were never built for goodness,--fare ye well--\n  And women like variety of courtship.\n  What cannot a neat knave with a smooth tale\n  Make a woman believe?  Farewell, lusty widow.\n       [Exit.]\n\n  DUCHESS.  Shall this move me?  If all my royal kindred\n  Lay in my way unto this marriage,\n  I 'd make them my low footsteps.  And even now,\n  Even in this hate, as men in some great battles,\n  By apprehending danger, have achiev'd\n  Almost impossible actions (I have heard soldiers say so),\n  So I through frights and threatenings will assay\n  This dangerous venture.  Let old wives report\n  I wink'd and chose a husband.--Cariola,\n  To thy known secrecy I have given up\n  More than my life,--my fame.\n\n  CARIOLA.                      Both shall be safe;\n  For I 'll conceal this secret from the world\n  As warily as those that trade in poison\n  Keep poison from their children.\n\n  DUCHESS.                          Thy protestation\n  Is ingenious and hearty; I believe it.\n  Is Antonio come?\n\n  CARIOLA.          He attends you.\n\n  DUCHESS.                           Good dear soul,\n  Leave me; but place thyself behind the arras,\n  Where thou mayst overhear us.  Wish me good speed;\n  For I am going into a wilderness,\n  Where I shall find nor path nor friendly clue\n  To be my guide.\n       [Cariola goes behind the arras.]\n       [Enter ANTONIO]\n                   I sent for you:  sit down;\n  Take pen and ink, and write:  are you ready?\n\n  ANTONIO.                                      Yes.\n\n  DUCHESS.  What did I say?\n\n  ANTONIO.  That I should write somewhat.\n\n  DUCHESS.                                 O, I remember.\n  After these triumphs and this large expense\n  It 's fit, like thrifty husbands,[21] we inquire\n  What 's laid up for to-morrow.\n\n  ANTONIO.  So please your beauteous excellence.\n\n  DUCHESS.                                        Beauteous!\n  Indeed, I thank you.  I look young for your sake;\n  You have ta'en my cares upon you.\n\n  ANTONIO.                           I 'll fetch your grace\n  The particulars of your revenue and expense.\n\n  DUCHESS.  O, you are\n  An upright treasurer:  but you mistook;\n  For when I said I meant to make inquiry\n  What 's laid up for to-morrow, I did mean\n  What 's laid up yonder for me.\n\n  ANTONIO.                        Where?\n\n  DUCHESS.                                In heaven.\n  I am making my will (as 'tis fit princes should,\n  In perfect memory), and, I pray, sir, tell me,\n  Were not one better make it smiling, thus,\n  Than in deep groans and terrible ghastly looks,\n  As if the gifts we parted with procur'd[22]\n  That violent distraction?\n\n  ANTONIO.                   O, much better.\n\n  DUCHESS.  If I had a husband now, this care were quit:\n  But I intend to make you overseer.\n  What good deed shall we first remember?  Say.\n\n  ANTONIO.  Begin with that first good deed began i' the world\n  After man's creation, the sacrament of marriage;\n  I 'd have you first provide for a good husband;\n  Give him all.\n\n  DUCHESS.       All!\n\n  ANTONIO.             Yes, your excellent self.\n\n  DUCHESS.  In a winding-sheet?\n\n  ANTONIO.                       In a couple.\n\n  DUCHESS.  Saint Winifred, that were a strange will!\n\n  ANTONIO.  'Twere stranger[23] if there were no will in you\n  To marry again.\n\n  DUCHESS.         What do you think of marriage?\n\n  ANTONIO.  I take 't, as those that deny purgatory,\n  It locally contains or heaven or hell;\n  There 's no third place in 't.\n\n  DUCHESS.                        How do you affect it?\n\n  ANTONIO.  My banishment, feeding my melancholy,\n  Would often reason thus.\n\n  DUCHESS.                  Pray, let 's hear it.\n\n  ANTONIO.  Say a man never marry, nor have children,\n  What takes that from him?  Only the bare name\n  Of being a father, or the weak delight\n  To see the little wanton ride a-cock-horse\n  Upon a painted stick, or hear him chatter\n  Like a taught starling.\n\n  DUCHESS.                 Fie, fie, what 's all this?\n  One of your eyes is blood-shot; use my ring to 't.\n  They say 'tis very sovereign.  'Twas my wedding-ring,\n  And I did vow never to part with it\n  But to my second husband.\n\n  ANTONIO.  You have parted with it now.\n\n  DUCHESS.  Yes, to help your eye-sight.\n\n  ANTONIO.  You have made me stark blind.\n\n  DUCHESS.  How?\n\n  ANTONIO.  There is a saucy and ambitious devil\n  Is dancing in this circle.\n\n  DUCHESS.                    Remove him.\n\n  ANTONIO.  How?\n\n  DUCHESS.  There needs small conjuration, when your finger\n  May do it:  thus.  Is it fit?\n       [She puts the ring upon his finger]: he kneels.\n\n  ANTONIO.                       What said you?\n\n  DUCHESS.                                       Sir,\n  This goodly roof of yours is too low built;\n  I cannot stand upright in 't nor discourse,\n  Without I raise it higher.  Raise yourself;\n  Or, if you please, my hand to help you:  so.\n       [Raises him.]\n\n  ANTONIO.  Ambition, madam, is a great man's madness,\n  That is not kept in chains and close-pent rooms,\n  But in fair lightsome lodgings, and is girt\n  With the wild noise of prattling visitants,\n  Which makes it lunatic beyond all cure.\n  Conceive not I am so stupid but I aim[24]\n  Whereto your favours tend:  but he 's a fool\n  That, being a-cold, would thrust his hands i' the fire\n  To warm them.\n\n  DUCHESS.       So, now the ground 's broke,\n  You may discover what a wealthy mine\n  I make your lord of.\n\n  ANTONIO.              O my unworthiness!\n\n  DUCHESS.  You were ill to sell yourself:\n  This dark'ning of your worth is not like that\n  Which tradesmen use i' the city; their false lights\n  Are to rid bad wares off:  and I must tell you,\n  If you will know where breathes a complete man\n  (I speak it without flattery), turn your eyes,\n  And progress through yourself.\n\n  ANTONIO.  Were there nor heaven nor hell,\n  I should be honest:  I have long serv'd virtue,\n  And ne'er ta'en wages of her.\n\n  DUCHESS.                       Now she pays it.\n  The misery of us that are born great!\n  We are forc'd to woo, because none dare woo us;\n  And as a tyrant doubles with his words,\n  And fearfully equivocates, so we\n  Are forc'd to express our violent passions\n  In riddles and in dreams, and leave the path\n  Of simple virtue, which was never made\n  To seem the thing it is not.  Go, go brag\n  You have left me heartless; mine is in your bosom:\n  I hope 'twill multiply love there.  You do tremble:\n  Make not your heart so dead a piece of flesh,\n  To fear more than to love me.  Sir, be confident:\n  What is 't distracts you?  This is flesh and blood, sir;\n  'Tis not the figure cut in alabaster\n  Kneels at my husband's tomb.  Awake, awake, man!\n  I do here put off all vain ceremony,\n  And only do appear to you a young widow\n  That claims you for her husband, and, like a widow,\n  I use but half a blush in 't.\n\n  ANTONIO.                       Truth speak for me;\n  I will remain the constant sanctuary\n  Of your good name.\n\n  DUCHESS.            I thank you, gentle love:\n  And 'cause you shall not come to me in debt,\n  Being now my steward, here upon your lips\n  I sign your Quietus est.[25]  This you should have begg'd now.\n  I have seen children oft eat sweetmeats thus,\n  As fearful to devour them too soon.\n\n  ANTONIO.  But for your brothers?\n\n  DUCHESS.                          Do not think of them:\n  All discord without this circumference\n  Is only to be pitied, and not fear'd:\n  Yet, should they know it, time will easily\n  Scatter the tempest.\n\n  ANTONIO.              These words should be mine,\n  And all the parts you have spoke, if some part of it\n  Would not have savour'd flattery.\n\n  DUCHESS.  Kneel.\n       [Cariola comes from behind the arras.]\n\n  ANTONIO.          Ha!\n\n  DUCHESS.  Be not amaz'd; this woman 's of my counsel:\n  I have heard lawyers say, a contract in a chamber\n  Per verba [de] presenti[26] is absolute marriage.\n       [She and ANTONIO kneel.]\n  Bless, heaven, this sacred gordian[27] which let violence\n  Never untwine!\n\n  ANTONIO.  And may our sweet affections, like the spheres,\n  Be still in motion!\n\n  DUCHESS.             Quickening, and make\n  The like soft music!\n\n  ANTONIO.  That we may imitate the loving palms,\n  Best emblem of a peaceful marriage,\n  That never bore fruit, divided!\n\n  DUCHESS.  What can the church force more?\n\n  ANTONIO.  That fortune may not know an accident,\n  Either of joy or sorrow, to divide\n  Our fixed wishes!\n\n  DUCHESS.           How can the church build faster?[28]\n  We now are man and wife, and 'tis the church\n  That must but echo this.--Maid, stand apart:\n  I now am blind.\n\n  ANTONIO.         What 's your conceit in this?\n\n  DUCHESS.  I would have you lead your fortune by the hand\n  Unto your marriage-bed:\n  (You speak in me this, for we now are one:)\n  We 'll only lie and talk together, and plot\n  To appease my humorous[29] kindred; and if you please,\n  Like the old tale in ALEXANDER AND LODOWICK,\n  Lay a naked sword between us, keep us chaste.\n  O, let me shrowd my blushes in your bosom,\n  Since 'tis the treasury of all my secrets!\n       [Exeunt DUCHESS and ANTONIO.]\n\n  CARIOLA.  Whether the spirit of greatness or of woman\n  Reign most in her, I know not; but it shows\n  A fearful madness.  I owe her much of pity.\n       [Exit.]\n\n\n\n       Act II\n\n\n       Scene I[30]\n\n       [Enter] BOSOLA and CASTRUCCIO\n\n  BOSOLA.  You say you would fain be taken for an eminent courtier?\n\n  CASTRUCCIO.  'Tis the very main[31] of my ambition.\n\n  BOSOLA.  Let me see:  you have a reasonable good face for 't already,\n  and your night-cap expresses your ears sufficient largely.  I would\n  have you learn to twirl the strings of your band with a good grace,\n  and in a set speech, at th' end of every sentence, to hum three\n  or four times, or blow your nose till it smart again, to recover your\n  memory.  When you come to be a president in criminal causes, if you\n  smile upon a prisoner, hang him; but if you frown upon him and\n  threaten him, let him be sure to scape the gallows.\n\n  CASTRUCCIO.  I would be a very merry president.\n\n  BOSOLA.  Do not sup o' nights; 'twill beget you an admirable wit.\n\n  CASTRUCCIO.  Rather it would make me have a good stomach to quarrel;\n  for they say, your roaring boys eat meat seldom, and that makes them\n  so valiant.  But how shall I know whether the people take me for\n  an eminent fellow?\n\n  BOSOLA.  I will teach a trick to know it:  give out you lie a-dying,\n  and if you hear the common people curse you, be sure you are taken\n  for one of the prime night-caps.[32]\n       [Enter an Old Lady]\n  You come from painting now.\n\n  OLD LADY.  From what?\n\n  BOSOLA.  Why, from your scurvy face-physic.  To behold thee not\n  painted inclines somewhat near a miracle.  These in thy face here\n  were deep ruts and foul sloughs the last progress.[33] There was\n  a lady in France that, having had the small-pox, flayed the skin off\n  her face to make it more level; and whereas before she looked\n  like a nutmeg-grater, after she resembled an abortive hedge-hog.\n\n  OLD LADY.  Do you call this painting?\n\n  BOSOLA.  No, no, but you call [it] careening[34] of an old\n  morphewed[35] lady, to make her disembogue[36] again:\n  there 's rough-cast phrase to your plastic.[37]\n\n  OLD LADY.  It seems you are well acquainted with my closet.\n\n  BOSOLA.  One would suspect it for a shop of witchcraft, to find in it\n  the fat of serpents, spawn of snakes, Jews' spittle, and their young\n  children's ordure; and all these for the face.  I would sooner eat\n  a dead pigeon taken from the soles of the feet of one sick of the\n  plague, than kiss one of you fasting.  Here are two of you, whose sin\n  of your youth is the very patrimony of the physician; makes him renew\n  his foot-cloth with the spring, and change his high-pric'd courtezan\n  with the fall of the leaf.  I do wonder you do not loathe yourselves.\n  Observe my meditation now.\n  What thing is in this outward form of man\n  To be belov'd?  We account it ominous,\n  If nature do produce a colt, or lamb,\n  A fawn, or goat, in any limb resembling\n  A man, and fly from 't as a prodigy:\n  Man stands amaz'd to see his deformity\n  In any other creature but himself.\n  But in our own flesh though we bear diseases\n  Which have their true names only ta'en from beasts,--\n  As the most ulcerous wolf and swinish measle,--\n  Though we are eaten up of lice and worms,\n  And though continually we bear about us\n  A rotten and dead body, we delight\n  To hide it in rich tissue:  all our fear,\n  Nay, all our terror, is, lest our physician\n  Should put us in the ground to be made sweet.--\n  Your wife 's gone to Rome:  you two couple, and get you to\n  the wells at Lucca to recover your aches.  I have other work on foot.\n       [Exeunt CASTRUCCIO and Old Lady]\n  I observe our duchess\n  Is sick a-days, she pukes, her stomach seethes,\n  The fins of her eye-lids look most teeming blue,[38]\n  She wanes i' the cheek, and waxes fat i' the flank,\n  And, contrary to our Italian fashion,\n  Wears a loose-bodied gown:  there 's somewhat in 't.\n  I have a trick may chance discover it,\n  A pretty one; I have bought some apricocks,\n  The first our spring yields.\n\n       [Enter ANTONIO and DELIO, talking together apart]\n\n  DELIO.                        And so long since married?\n  You amaze me.\n\n  ANTONIO.       Let me seal your lips for ever:\n  For, did I think that anything but th' air\n  Could carry these words from you, I should wish\n  You had no breath at all.--Now, sir, in your contemplation?\n  You are studying to become a great wise fellow.\n\n  BOSOLA.  O, sir, the opinion of wisdom is a foul tetter[39]\n  that runs all over a man's body:  if simplicity direct us to have\n  no evil, it directs us to a happy being; for the subtlest folly\n  proceeds from the subtlest wisdom:  let me be simply honest.\n\n  ANTONIO.  I do understand your inside.\n\n  BOSOLA.                                 Do you so?\n\n  ANTONIO.  Because you would not seem to appear to th' world\n  Puff'd up with your preferment, you continue\n  This out-of-fashion melancholy:  leave it, leave it.\n\n  BOSOLA.  Give me leave to be honest in any phrase, in any compliment\n  whatsoever.  Shall I confess myself to you?  I look no higher than\n  I can reach:  they are the gods that must ride on winged horses.\n  A lawyer's mule of a slow pace will both suit my disposition and\n  business; for, mark me, when a man's mind rides faster than his horse\n  can gallop, they quickly both tire.\n\n  ANTONIO.  You would look up to heaven, but I think\n  The devil, that rules i' th' air, stands in your light.\n\n  BOSOLA.  O, sir, you are lord of the ascendant,[40] chief man with\n  the duchess:  a duke was your cousin-german remov'd.  Say you were\n  lineally descended from King Pepin, or he himself, what of this?\n  Search the heads of the greatest rivers in the world, you shall find\n  them but bubbles of water.  Some would think the souls of princes\n  were brought forth by some more weighty cause than those of meaner\n  persons:  they are deceiv'd, there 's the same hand to them; the like\n  passions sway them; the same reason that makes a vicar go to law for\n  a tithe-pig, and undo his neighbours, makes them spoil a whole\n  province, and batter down goodly cities with the cannon.\n\n       [Enter DUCHESS and Ladies]\n\n  DUCHESS.  Your arm, Antonio:  do I not grow fat?\n  I am exceeding short-winded.--Bosola,\n  I would have you, sir, provide for me a litter;\n  Such a one as the Duchess of Florence rode in.\n\n  BOSOLA.  The duchess us'd one when she was great with child.\n\n  DUCHESS.  I think she did.--Come hither, mend my ruff:\n  Here, when? thou art such a tedious lady; and\n  Thy breath smells of lemon-pills:  would thou hadst done!\n  Shall I swoon under thy fingers?  I am\n  So troubled with the mother![41]\n\n  BOSOLA.  [Aside.]             I fear too much.\n\n  DUCHESS.  I have heard you say that the French courtiers\n  Wear their hats on 'fore that king.\n\n  ANTONIO.  I have seen it.\n\n  DUCHESS.                   In the presence?\n\n  ANTONIO.                                     Yes.\n\n  DUCHESS.  Why should not we bring up that fashion?\n  'Tis ceremony more than duty that consists\n  In the removing of a piece of felt.\n  Be you the example to the rest o' th' court;\n  Put on your hat first.\n\n  ANTONIO.                You must pardon me:\n  I have seen, in colder countries than in France,\n  Nobles stand bare to th' prince; and the distinction\n  Methought show'd reverently.\n\n  BOSOLA.  I have a present for your grace.\n\n  DUCHESS.                                   For me, sir?\n\n  BOSOLA.  Apricocks, madam.\n\n  DUCHESS.                    O, sir, where are they?\n  I have heard of none to-year[42]\n\n  BOSOLA.  [Aside.]              Good; her colour rises.\n\n  DUCHESS.  Indeed, I thank you:  they are wondrous fair ones.\n  What an unskilful fellow is our gardener!\n  We shall have none this month.\n\n  BOSOLA.  Will not your grace pare them?\n\n  DUCHESS.  No:  they taste of musk, methinks; indeed they do.\n\n  BOSOLA.  I know not:  yet I wish your grace had par'd 'em.\n\n  DUCHESS.  Why?\n\n  BOSOLA.         I forgot to tell you, the knave gardener,\n  Only to raise his profit by them the sooner,\n  Did ripen them in horse-dung.\n\n  DUCHESS.                       O, you jest.--\n  You shall judge:  pray, taste one.\n\n  ANTONIO.                            Indeed, madam,\n  I do not love the fruit.\n\n  DUCHESS.                  Sir, you are loth\n  To rob us of our dainties.  'Tis a delicate fruit;\n  They say they are restorative.\n\n  BOSOLA.                        'Tis a pretty art,\n  This grafting.\n\n  DUCHESS.  'Tis so; a bettering of nature.\n\n  BOSOLA.  To make a pippin grow upon a crab,\n  A damson on a black-thorn.--[Aside.] How greedily she eats them!\n  A whirlwind strike off these bawd farthingales!\n  For, but for that and the loose-bodied gown,\n  I should have discover'd apparently[43]\n  The young springal[44] cutting a caper in her belly.\n\n  DUCHESS.  I thank you, Bosola:  they were right good ones,\n  If they do not make me sick.\n\n  ANTONIO.                      How now, madam!\n\n  DUCHESS.  This green fruit and my stomach are not friends:\n  How they swell me!\n\n  BOSOLA.  [Aside.]    Nay, you are too much swell'd already.\n\n  DUCHESS.  O, I am in an extreme cold sweat!\n\n  BOSOLA.                                      I am very sorry.\n       [Exit.]\n\n  DUCHESS.  Lights to my chamber!--O good Antonio,\n  I fear I am undone!\n\n  DELIO.               Lights there, lights!\n      Exeunt DUCHESS [and Ladies.]\n\n  ANTONIO.  O my most trusty Delio, we are lost!\n  I fear she 's fall'n in labour; and there 's left\n  No time for her remove.\n\n  DELIO.                   Have you prepar'd\n  Those ladies to attend her; and procur'd\n  That politic safe conveyance for the midwife\n  Your duchess plotted?\n\n  ANTONIO.               I have.\n\n  DELIO.  Make use, then, of this forc'd occasion.\n  Give out that Bosola hath poison'd her\n  With these apricocks; that will give some colour\n  For her keeping close.\n\n  ANTONIO.                Fie, fie, the physicians\n  Will then flock to her.\n\n  DELIO.  For that you may pretend\n  She'll use some prepar'd antidote of her own,\n  Lest the physicians should re-poison her.\n\n  ANTONIO.  I am lost in amazement:  I know not what to think on 't.\n       Exeunt.\n\n\n       Scene II[45]\n\n       [Enter] BOSOLA and Old Lady\n\n  BOSOLA.  So, so, there 's no question but her techiness[46]\n  and most vulturous eating of the apricocks are apparent signs\n  of breeding, now?\n\n  OLD LADY.  I am in haste, sir.\n\n  BOSOLA.  There was a young waiting-woman had a monstrous desire\n  to see the glass-house----\n\n  OLD LADY.  Nay, pray, let me go.  I will hear no more\n  of the glass-house.  You are still[47] abusing women!\n\n  BOSOLA.  Who, I?  No; only, by the way now and then, mention your\n  frailties.  The orange-tree bears ripe and green fruit and blossoms\n  all together; and some of you give entertainment for pure love,\n  but more for more precious reward.  The lusty spring smells well;\n  but drooping autumn tastes well.  If we have the same golden showers\n  that rained in the time of Jupiter the thunderer, you have the same\n  Danaes still, to hold up their laps to receive them.  Didst thou\n  never study the mathematics?\n\n  OLD LADY.  What 's that, sir?\n\n  BOSOLA.  Why, to know the trick how to make a many lines meet in one\n  centre.  Go, go, give your foster-daughters good counsel:  tell them,\n  that the devil takes delight to hang at a woman's girdle, like\n  a false rusty watch, that she cannot discern how the time passes.\n       [Exit Old Lady.]\n\n       [Enter ANTONIO, RODERIGO, and GRISOLAN]\n\n  ANTONIO.  Shut up the court-gates.\n\n  RODERIGO.                           Why, sir?  What 's the danger?\n\n  ANTONIO.  Shut up the posterns presently, and call\n  All the officers o' th' court.\n\n  GRISOLAN.                       I shall instantly.\n       [Exit.]\n\n  ANTONIO.  Who keeps the key o' th' park-gate?\n\n  RODERIGO.                                      Forobosco.\n\n  ANTONIO.  Let him bring 't presently.\n\n       [Re-enter GRISOLAN with Servants]\n\n  FIRST SERVANT.  O, gentleman o' th' court, the foulest treason!\n\n  BOSOLA.  [Aside.] If that these apricocks should be poison'd now,\n  Without my knowledge?\n\n  FIRST SERVANT.\n  There was taken even now a Switzer in the duchess' bed-chamber----\n\n  SECOND SERVANT.  A Switzer!\n\n  FIRST SERVANT.  With a pistol----\n\n  SECOND SERVANT.  There was a cunning traitor!\n\n  FIRST SERVANT.\n  And all the moulds of his buttons were leaden bullets.\n\n  SECOND SERVANT.  O wicked cannibal!\n\n  FIRST SERVANT.  'Twas a French plot, upon my life.\n\n  SECOND SERVANT.  To see what the devil can do!\n\n  ANTONIO.  [Are] all the officers here?\n\n  SERVANTS.  We are.\n\n  ANTONIO.  Gentlemen,\n  We have lost much plate, you know; and but this evening\n  Jewels, to the value of four thousand ducats,\n  Are missing in the duchess' cabinet.\n  Are the gates shut?\n\n  SERVANT.             Yes.\n\n  ANTONIO.                   'Tis the duchess' pleasure\n  Each officer be lock'd into his chamber\n  Till the sun-rising; and to send the keys\n  Of all their chests and of their outward doors\n  Into her bed-chamber.  She is very sick.\n\n  RODERIGO.  At her pleasure.\n\n  ANTONIO.  She entreats you take 't not ill:  the innocent\n  Shall be the more approv'd by it.\n\n  BOSOLA.  Gentlemen o' the wood-yard, where 's your Switzer now?\n\n  FIRST SERVANT.  By this hand, 'twas credibly reported by one\n  o' the black guard.[48]\n       [Exeunt all except ANTONIO and DELIO.]\n\n  DELIO.  How fares it with the duchess?\n\n  ANTONIO.                                She 's expos'd\n  Unto the worst of torture, pain, and fear.\n\n  DELIO.  Speak to her all happy comfort.\n\n  ANTONIO.  How I do play the fool with mine own danger!\n  You are this night, dear friend, to post to Rome:\n  My life lies in your service.\n\n  DELIO.                         Do not doubt me.\n\n  ANTONIO.  O, 'tis far from me:  and yet fear presents me\n  Somewhat that looks like danger.\n\n  DELIO.                            Believe it,\n  'Tis but the shadow of your fear, no more:\n  How superstitiously we mind our evils!\n  The throwing down salt, or crossing of a hare,\n  Bleeding at nose, the stumbling of a horse,\n  Or singing of a cricket, are of power\n  To daunt whole man in us.  Sir, fare you well:\n  I wish you all the joys of a bless'd father;\n  And, for my faith, lay this unto your breast,--\n  Old friends, like old swords, still are trusted best.\n       [Exit.]\n\n       [Enter CARIOLA]\n\n  CARIOLA.  Sir, you are the happy father of a son:\n  Your wife commends him to you.\n\n  ANTONIO.                        Blessed comfort!--\n  For heaven' sake, tend her well: I 'll presently[49]\n  Go set a figure for 's nativity.[50]\n       Exeunt.\n\n\n       Scene III[51]\n\n       [Enter BOSOLA, with a dark lantern]\n\n  BOSOLA.  Sure I did hear a woman shriek:  list, ha!\n  And the sound came, if I receiv'd it right,\n  ]From the duchess' lodgings.  There 's some stratagem\n  In the confining all our courtiers\n  To their several wards:  I must have part of it;\n  My intelligence will freeze else.  List, again!\n  It may be 'twas the melancholy bird,\n  Best friend of silence and of solitariness,\n  The owl, that screamed so.--Ha! Antonio!\n\n       [Enter ANTONIO with a candle, his sword drawn]\n\n  ANTONIO.  I heard some noise.--Who 's there?  What art thou?  Speak.\n\n  BOSOLA.  Antonio, put not your face nor body\n  To such a forc'd expression of fear;\n  I am Bosola, your friend.\n\n  ANTONIO.                   Bosola!--\n  [Aside.] This mole does undermine me.--Heard you not\n  A noise even now?\n\n  BOSOLA.            From whence?\n\n  ANTONIO.                         From the duchess' lodging.\n\n  BOSOLA.  Not I:  did you?\n\n  ANTONIO.                   I did, or else I dream'd.\n\n  BOSOLA.  Let 's walk towards it.\n\n  ANTONIO.                          No:  it may be 'twas\n  But the rising of the wind.\n\n  BOSOLA.                      Very likely.\n  Methinks 'tis very cold, and yet you sweat:\n  You look wildly.\n\n  ANTONIO.          I have been setting a figure[52]\n  For the duchess' jewels.\n\n  BOSOLA.                   Ah, and how falls your question?\n  Do you find it radical?[53]\n\n  ANTONIO.                 What 's that to you?\n  'Tis rather to be question'd what design,\n  When all men were commanded to their lodgings,\n  Makes you a night-walker.\n\n  BOSOLA.                    In sooth, I 'll tell you:\n  Now all the court 's asleep, I thought the devil\n  Had least to do here; I came to say my prayers;\n  And if it do offend you I do so,\n  You are a fine courtier.\n\n  ANTONIO. [Aside.]         This fellow will undo me.--\n  You gave the duchess apricocks to-day:\n  Pray heaven they were not poison'd!\n\n  BOSOLA.  Poison'd! a Spanish fig\n  For the imputation!\n\n  ANTONIO.             Traitors are ever confident\n  Till they are discover'd.  There were jewels stol'n too:\n  In my conceit, none are to be suspected\n  More than yourself.\n\n  BOSOLA.              You are a false steward.\n\n  ANTONIO.  Saucy slave, I 'll pull thee up by the roots.\n\n  BOSOLA.  May be the ruin will crush you to pieces.\n\n  ANTONIO.  You are an impudent snake indeed, sir:\n  Are you scarce warm, and do you show your sting?\n  You libel[54] well, sir?\n\n  BOSOLA.                   No, sir:  copy it out,\n  And I will set my hand to 't.\n\n  ANTONIO. [Aside.]              My nose bleeds.\n  One that were superstitious would count\n  This ominous, when it merely comes by chance.\n  Two letters, that are wrought here for my name,[55]\n  Are drown'd in blood!\n  Mere accident.--For you, sir, I 'll take order\n  I' the morn you shall be safe.--[Aside.] 'Tis that must colour\n  Her lying-in.--Sir, this door you pass not:\n  I do not hold it fit that you come near\n  The duchess' lodgings, till you have quit yourself.--\n  [Aside.] The great are like the base, nay, they are the same,\n  When they seek shameful ways to avoid shame.\n       Exit.\n\n  BOSOLA.  Antonio hereabout did drop a paper:--\n  Some of your help, false friend.[56]--O, here it is.\n  What 's here? a child's nativity calculated!\n       [Reads.]\n  'The duchess was deliver'd of a son, 'tween the hours\n  twelve and one in the night, Anno Dom. 1504,'--that 's\n  this year--'decimo nono Decembris,'--that 's this night--\n  'taken according to the meridian of Malfi,'--that 's our\n  duchess:  happy discovery!--'The lord of the first house\n  being combust in the ascendant, signifies short life;\n  and Mars being in a human sign, joined to the tail of the\n  Dragon, in the eighth house, doth threaten a violent death.\n  Caetera non scrutantur.'[57]\n\n  Why, now 'tis most apparent; this precise fellow\n  Is the duchess' bawd:--I have it to my wish!\n  This is a parcel of intelligency[58]\n  Our courtiers were cas'd up for:  it needs must follow\n  That I must be committed on pretence\n  Of poisoning her; which I 'll endure, and laugh at.\n  If one could find the father now! but that\n  Time will discover.  Old Castruccio\n  I' th' morning posts to Rome:  by him I 'll send\n  A letter that shall make her brothers' galls\n  O'erflow their livers.  This was a thrifty[59] way!\n  Though lust do mask in ne'er so strange disguise,\n  She 's oft found witty, but is never wise.\n       [Exit.]\n\n\n       Scene IV[60]\n\n       [Enter] CARDINAL and JULIA\n\n  CARDINAL.  Sit:  thou art my best of wishes.  Prithee, tell me\n  What trick didst thou invent to come to Rome\n  Without thy husband?\n\n  JULIA.                Why, my lord, I told him\n  I came to visit an old anchorite[61]\n  Here for devotion.\n\n  CARDINAL.           Thou art a witty false one,--\n  I mean, to him.\n\n  JULIA.  You have prevail'd with me\n  Beyond my strongest thoughts; I would not now\n  Find you inconstant.\n\n  CARDINAL.             Do not put thyself\n  To such a voluntary torture, which proceeds\n  Out of your own guilt.\n\n  JULIA.                  How, my lord!\n\n  CARDINAL.                              You fear\n  My constancy, because you have approv'd[62]\n  Those giddy and wild turnings in yourself.\n\n  JULIA.  Did you e'er find them?\n\n  CARDINAL.                        Sooth, generally for women,\n  A man might strive to make glass malleable,\n  Ere he should make them fixed.\n\n  JULIA.                          So, my lord.\n\n  CARDINAL.  We had need go borrow that fantastic glass\n  Invented by Galileo the Florentine\n  To view another spacious world i' th' moon,\n  And look to find a constant woman there.\n\n  JULIA.  This is very well, my lord.\n\n  CARDINAL.                            Why do you weep?\n  Are tears your justification?  The self-same tears\n  Will fall into your husband's bosom, lady,\n  With a loud protestation that you love him\n  Above the world.  Come, I 'll love you wisely,\n  That 's jealously; since I am very certain\n  You cannot make me cuckold.\n\n  JULIA.                       I 'll go home\n  To my husband.\n\n  CARDINAL.       You may thank me, lady,\n  I have taken you off your melancholy perch,\n  Bore you upon my fist, and show'd you game,\n  And let you fly at it.--I pray thee, kiss me.--\n  When thou wast with thy husband, thou wast watch'd\n  Like a tame elephant:--still you are to thank me:--\n  Thou hadst only kisses from him and high feeding;\n  But what delight was that?  'Twas just like one\n  That hath a little fing'ring on the lute,\n  Yet cannot tune it:--still you are to thank me.\n\n  JULIA.  You told me of a piteous wound i' th' heart,\n  And a sick liver, when you woo'd me first,\n  And spake like one in physic.[63]\n\n  CARDINAL.                      Who 's that?----\n       [Enter Servant]\n  Rest firm, for my affection to thee,\n  Lightning moves slow to 't.\n\n  SERVANT.                     Madam, a gentleman,\n  That 's come post from Malfi, desires to see you.\n\n  CARDINAL.  Let him enter:  I 'll withdraw.\n       Exit.\n\n  SERVANT.                                    He says\n  Your husband, old Castruccio, is come to Rome,\n  Most pitifully tir'd with riding post.\n       [Exit.]\n\n       [Enter DELIO]\n\n  JULIA.  [Aside.] Signior Delio! 'tis one of my old suitors.\n\n  DELIO.  I was bold to come and see you.\n\n  JULIA.                                   Sir, you are welcome.\n\n  DELIO.  Do you lie here?\n\n  JULIA.                    Sure, your own experience\n  Will satisfy you no:  our Roman prelates\n  Do not keep lodging for ladies.\n\n  DELIO.                           Very well:\n  I have brought you no commendations from your husband,\n  For I know none by him.\n\n  JULIA.                   I hear he 's come to Rome.\n\n  DELIO.  I never knew man and beast, of a horse and a knight,\n  So weary of each other.  If he had had a good back,\n  He would have undertook to have borne his horse,\n  His breech was so pitifully sore.\n\n  JULIA.                             Your laughter\n  Is my pity.\n\n  DELIO.  Lady, I know not whether\n  You want money, but I have brought you some.\n\n  JULIA.  From my husband?\n\n  DELIO.                    No, from mine own allowance.\n\n  JULIA.  I must hear the condition, ere I be bound to take it.\n\n  DELIO.  Look on 't, 'tis gold; hath it not a fine colour?\n\n  JULIA.  I have a bird more beautiful.\n\n  DELIO.                                 Try the sound on 't.\n\n  JULIA.  A lute-string far exceeds it.\n  It hath no smell, like cassia or civet;\n  Nor is it physical,[64] though some fond doctors\n  Persuade us seethe 't in cullises.[65] I 'll tell you,\n  This is a creature bred by----\n\n       [Re-enter Servant]\n\n  SERVANT.                         Your husband 's come,\n  Hath deliver'd a letter to the Duke of Calabria\n  That, to my thinking, hath put him out of his wits.\n       [Exit.]\n\n  JULIA.  Sir, you hear:\n  Pray, let me know your business and your suit\n  As briefly as can be.\n\n  DELIO.  With good speed:  I would wish you,\n  At such time as you are non-resident\n  With your husband, my mistress.\n\n  JULIA.  Sir, I 'll go ask my husband if I shall,\n  And straight return your answer.\n       Exit.\n\n  DELIO.                            Very fine!\n  Is this her wit, or honesty, that speaks thus?\n  I heard one say the duke was highly mov'd\n  With a letter sent from Malfi.  I do fear\n  Antonio is betray'd.  How fearfully\n  Shows his ambition now!  Unfortunate fortune!\n  They pass through whirl-pools, and deep woes do shun,\n  Who the event weigh ere the action 's done.\n       Exit.\n\n\n       Scene V[66]\n\n       [Enter] CARDINAL and FERDINAND with a letter\n\n  FERDINAND.  I have this night digg'd up a mandrake.[67]\n\n  CARDINAL.                                            Say you?\n\n  FERDINAND.  And I am grown mad with 't.\n\n  CARDINAL.                                What 's the prodigy[?]\n\n  FERDINAND.\n  Read there,--a sister damn'd:  she 's loose i' the hilts;[68]\n  Grown a notorious strumpet.\n\n  CARDINAL.                    Speak lower.\n\n  FERDINAND.                                 Lower!\n  Rogues do not whisper 't now, but seek to publish 't\n  (As servants do the bounty of their lords)\n  Aloud; and with a covetous searching eye,\n  To mark who note them.  O, confusion seize her!\n  She hath had most cunning bawds to serve her turn,\n  And more secure conveyances for lust\n  Than towns of garrison for service.\n\n  CARDINAL.                            Is 't possible?\n  Can this be certain?\n\n  FERDINAND.            Rhubarb, O, for rhubarb\n  To purge this choler!  Here 's the cursed day\n  To prompt my memory; and here 't shall stick\n  Till of her bleeding heart I make a sponge\n  To wipe it out.\n\n  CARDINAL.        Why do you make yourself\n  So wild a tempest?\n\n  FERDINAND.          Would I could be one,\n  That I might toss her palace 'bout her ears,\n  Root up her goodly forests, blast her meads,\n  And lay her general territory as waste\n  As she hath done her honours.\n\n  CARDINAL.                      Shall our blood,\n  The royal blood of Arragon and Castile,\n  Be thus attainted?\n\n  FERDINAND.          Apply desperate physic:\n  We must not now use balsamum, but fire,\n  The smarting cupping-glass, for that 's the mean\n  To purge infected blood, such blood as hers.\n  There is a kind of pity in mine eye,--\n  I 'll give it to my handkercher; and now 'tis here,\n  I 'll bequeath this to her bastard.\n\n  CARDINAL.                            What to do?\n\n  FERDINAND.  Why, to make soft lint for his mother's wounds,\n  When I have hew'd her to pieces.\n\n  CARDINAL.                         Curs'd creature!\n  Unequal nature, to place women's hearts\n  So far upon the left side![69]\n\n  FERDINAND.                  Foolish men,\n  That e'er will trust their honour in a bark\n  Made of so slight weak bulrush as is woman,\n  Apt every minute to sink it!\n\n  CARDINAL.  Thus ignorance, when it hath purchas'd honour,\n  It cannot wield it.\n\n  FERDINAND.           Methinks I see her laughing,--\n  Excellent hyena!  Talk to me somewhat quickly,\n  Or my imagination will carry me\n  To see her in the shameful act of sin.\n\n  CARDINAL.  With whom?\n\n  FERDINAND.             Happily with some strong-thigh'd bargeman,\n  Or one o' th' wood-yard that can quoit the sledge[70]\n  Or toss the bar, or else some lovely squire\n  That carries coals up to her privy lodgings.\n\n  CARDINAL.  You fly beyond your reason.\n\n  FERDINAND.                              Go to, mistress!\n  'Tis not your whore's milk that shall quench my wild-fire,\n  But your whore's blood.\n\n  CARDINAL.  How idly shows this rage, which carries you,\n  As men convey'd by witches through the air,\n  On violent whirlwinds!  This intemperate noise\n  Fitly resembles deaf men's shrill discourse,\n  Who talk aloud, thinking all other men\n  To have their imperfection.\n\n  FERDINAND.                   Have not you\n  My palsy?\n\n  CARDINAL.    Yes, [but] I can be angry\n  Without this rupture.  There is not in nature\n  A thing that makes man so deform'd, so beastly,\n  As doth intemperate anger.  Chide yourself.\n  You have divers men who never yet express'd\n  Their strong desire of rest but by unrest,\n  By vexing of themselves.  Come, put yourself\n  In tune.\n\n  FERDINAND.  So I will only study to seem\n  The thing I am not.  I could kill her now,\n  In you, or in myself; for I do think\n  It is some sin in us heaven doth revenge\n  By her.\n\n  CARDINAL.  Are you stark mad?\n\n  FERDINAND.                     I would have their bodies\n  Burnt in a coal-pit with the ventage stopp'd,\n  That their curs'd smoke might not ascend to heaven;\n  Or dip the sheets they lie in in pitch or sulphur,\n  Wrap them in 't, and then light them like a match;\n  Or else to-boil[71] their bastard to a cullis,\n  And give 't his lecherous father to renew\n  The sin of his back.\n\n  CARDINAL.             I 'll leave you.\n\n  FERDINAND.                              Nay, I have done.\n  I am confident, had I been damn'd in hell,\n  And should have heard of this, it would have put me\n  Into a cold sweat.  In, in; I 'll go sleep.\n  Till I know who [loves] my sister, I 'll not stir:\n  That known, I 'll find scorpions to string my whips,\n  And fix her in a general eclipse.\n       Exeunt.\n\n\n\n       Act III\n\n\n       Scene I[72]\n\n       [Enter] ANTONIO and DELIO\n\n  ANTONIO.  Our noble friend, my most beloved Delio!\n  O, you have been a stranger long at court:\n  Came you along with the Lord Ferdinand?\n\n  DELIO.  I did, sir:  and how fares your noble duchess?\n\n  ANTONIO.  Right fortunately well:  she 's an excellent\n  Feeder of pedigrees; since you last saw her,\n  She hath had two children more, a son and daughter.\n\n  DELIO.  Methinks 'twas yesterday.  Let me but wink,\n  And not behold your face, which to mine eye\n  Is somewhat leaner, verily I should dream\n  It were within this half hour.\n\n  ANTONIO.  You have not been in law, friend Delio,\n  Nor in prison, nor a suitor at the court,\n  Nor begg'd the reversion of some great man's place,\n  Nor troubled with an old wife, which doth make\n  Your time so insensibly hasten.\n\n  DELIO.                           Pray, sir, tell me,\n  Hath not this news arriv'd yet to the ear\n  Of the lord cardinal?\n\n  ANTONIO.               I fear it hath:\n  The Lord Ferdinand, that 's newly come to court,\n  Doth bear himself right dangerously.\n\n  DELIO.                                Pray, why?\n\n  ANTONIO.  He is so quiet that he seems to sleep\n  The tempest out, as dormice do in winter.\n  Those houses that are haunted are most still\n  Till the devil be up.\n\n  DELIO.                 What say the common people?\n\n  ANTONIO.  The common rabble do directly say\n  She is a strumpet.\n\n  DELIO.              And your graver heads\n  Which would be politic, what censure they?\n\n  ANTONIO.  They do observe I grow to infinite purchase,[73]\n  The left hand way; and all suppose the duchess\n  Would amend it, if she could; for, say they,\n  Great princes, though they grudge their officers\n  Should have such large and unconfined means\n  To get wealth under them, will not complain,\n  Lest thereby they should make them odious\n  Unto the people.  For other obligation\n  Of love or marriage between her and me\n  They never dream of.\n\n  DELIO.                The Lord Ferdinand\n  Is going to bed.\n\n       [Enter DUCHESS, FERDINAND, and Attendants]\n\n  FERDINAND.        I 'll instantly to bed,\n  For I am weary.--I am to bespeak\n  A husband for you.\n\n  DUCHESS.            For me, sir!  Pray, who is 't?\n\n  FERDINAND.  The great Count Malatesti.\n\n  DUCHESS.                                Fie upon him!\n  A count!  He 's a mere stick of sugar-candy;\n  You may look quite through him.  When I choose\n  A husband, I will marry for your honour.\n\n  FERDINAND.  You shall do well in 't.--How is 't, worthy Antonio?\n\n  DUCHESS.  But, sir, I am to have private conference with you\n  About a scandalous report is spread\n  Touching mine honour.\n\n  FERDINAND.             Let me be ever deaf to 't:\n  One of Pasquil's paper-bullets,[74] court-calumny,\n  A pestilent air, which princes' palaces\n  Are seldom purg'd of.  Yet, say that it were true,\n  I pour it in your bosom, my fix'd love\n  Would strongly excuse, extenuate, nay, deny\n  Faults, were they apparent in you.  Go, be safe\n  In your own innocency.\n\n  DUCHESS.  [Aside.]      O bless'd comfort!\n  This deadly air is purg'd.\n       Exeunt [DUCHESS, ANTONIO, DELIO, and Attendants.]\n\n  FERDINAND.                  Her guilt treads on\n  Hot-burning coulters.[75]\n       Enter BOSOLA\n                         Now, Bosola,\n  How thrives our intelligence?[76]\n\n  BOSOLA.                        Sir, uncertainly:\n  'Tis rumour'd she hath had three bastards, but\n  By whom we may go read i' the stars.\n\n  FERDINAND.                            Why, some\n  Hold opinion all things are written there.\n\n  BOSOLA.  Yes, if we could find spectacles to read them.\n  I do suspect there hath been some sorcery\n  Us'd on the duchess.\n\n  FERDINAND.            Sorcery! to what purpose?\n\n  BOSOLA.  To make her dote on some desertless fellow\n  She shames to acknowledge.\n\n  FERDINAND.                  Can your faith give way\n  To think there 's power in potions or in charms,\n  To make us love whether we will or no?\n\n  BOSOLA.  Most certainly.\n\n  FERDINAND.  Away! these are mere gulleries,[77] horrid things,\n  Invented by some cheating mountebanks\n  To abuse us.  Do you think that herbs or charms\n  Can force the will?  Some trials have been made\n  In this foolish practice, but the ingredients\n  Were lenitive[78] poisons, such as are of force\n  To make the patient mad; and straight the witch\n  Swears by equivocation they are in love.\n  The witch-craft lies in her rank blood.  This night\n  I will force confession from her.  You told me\n  You had got, within these two days, a false key\n  Into her bed-chamber.\n\n  BOSOLA.                I have.\n\n  FERDINAND.                      As I would wish.\n\n  BOSOLA.  What do you intend to do?\n\n  FERDINAND.                          Can you guess?\n\n  BOSOLA.                                             No.\n\n  FERDINAND.  Do not ask, then:\n  He that can compass me, and know my drifts,\n  May say he hath put a girdle 'bout the world,\n  And sounded all her quick-sands.\n\n  BOSOLA.                           I do not\n  Think so.\n\n  FERDINAND.  What do you think, then, pray?\n\n  BOSOLA.                                     That you\n  Are your own chronicle too much, and grossly\n  Flatter yourself.\n\n  FERDINAND.         Give me thy hand; I thank thee:\n  I never gave pension but to flatterers,\n  Till I entertained thee.  Farewell.\n  That friend a great man's ruin strongly checks,\n  Who rails into his belief all his defects.\n       Exeunt.\n\n\n       Scene II[79]\n\n       [Enter] DUCHESS, ANTONIO, and CARIOLA\n\n  DUCHESS.  Bring me the casket hither, and the glass.--\n  You get no lodging here to-night, my lord.\n\n  ANTONIO.  Indeed, I must persuade one.\n\n  DUCHESS.                                Very good:\n  I hope in time 'twill grow into a custom,\n  That noblemen shall come with cap and knee\n  To purchase a night's lodging of their wives.\n\n  ANTONIO.  I must lie here.\n\n  DUCHESS.                    Must!  You are a lord of mis-rule.\n\n  ANTONIO.  Indeed, my rule is only in the night.\n\n  DUCHESS.  I 'll stop your mouth.\n       [Kisses him.]\n\n  ANTONIO.  Nay, that 's but one; Venus had two soft doves\n  To draw her chariot; I must have another.--\n       [She kisses him again.]\n  When wilt thou marry, Cariola?\n\n  CARIOLA.                        Never, my lord.\n\n  ANTONIO.  O, fie upon this single life! forgo it.\n  We read how Daphne, for her peevish [flight,][80]\n  Became a fruitless bay-tree; Syrinx turn'd\n  To the pale empty reed; Anaxarete\n  Was frozen into marble:  whereas those\n  Which married, or prov'd kind unto their friends,\n  Were by a gracious influence transhap'd\n  Into the olive, pomegranate, mulberry,\n  Became flowers, precious stones, or eminent stars.\n\n  CARIOLA.  This is a vain poetry:  but I pray you, tell me,\n  If there were propos'd me, wisdom, riches, and beauty,\n  In three several young men, which should I choose?\n\n  ANTONIO.  'Tis a hard question.  This was Paris' case,\n  And he was blind in 't, and there was a great cause;\n  For how was 't possible he could judge right,\n  Having three amorous goddesses in view,\n  And they stark naked?  'Twas a motion\n  Were able to benight the apprehension\n  Of the severest counsellor of Europe.\n  Now I look on both your faces so well form'd,\n  It puts me in mind of a question I would ask.\n\n  CARIOLA.  What is 't?\n\n  ANTONIO.               I do wonder why hard-favour'd ladies,\n  For the most part, keep worse-favour'd waiting-women\n  To attend them, and cannot endure fair ones.\n\n  DUCHESS.  O, that 's soon answer'd.\n  Did you ever in your life know an ill painter\n  Desire to have his dwelling next door to the shop\n  Of an excellent picture-maker?  'Twould disgrace\n  His face-making, and undo him.  I prithee,\n  When were we so merry?--My hair tangles.\n\n  ANTONIO.  Pray thee, Cariola, let 's steal forth the room,\n  And let her talk to herself:  I have divers times\n  Serv'd her the like, when she hath chaf'd extremely.\n  I love to see her angry.  Softly, Cariola.\n       Exeunt [ANTONIO and CARIOLA.]\n\n  DUCHESS.  Doth not the colour of my hair 'gin to change?\n  When I wax gray, I shall have all the court\n  Powder their hair with arras,[81] to be like me.\n  You have cause to love me; I ent'red you into my heart\n       [Enter FERDINAND unseen]\n  Before you would vouchsafe to call for the keys.\n  We shall one day have my brothers take you napping.\n  Methinks his presence, being now in court,\n  Should make you keep your own bed; but you 'll say\n  Love mix'd with fear is sweetest.  I 'll assure you,\n  You shall get no more children till my brothers\n  Consent to be your gossips.  Have you lost your tongue?\n  'Tis welcome:\n  For know, whether I am doom'd to live or die,\n  I can do both like a prince.\n\n  FERDINAND.                    Die, then, quickly!\n       Giving her a poniard.\n  Virtue, where art thou hid?  What hideous thing\n  Is it that doth eclipse thee?\n\n  DUCHESS.                       Pray, sir, hear me.\n\n  FERDINAND.  Or is it true thou art but a bare name,\n  And no essential thing?\n\n  DUCHESS.                 Sir----\n\n  FERDINAND.                        Do not speak.\n\n  DUCHESS.  No, sir:\n  I will plant my soul in mine ears, to hear you.\n\n  FERDINAND.  O most imperfect light of human reason,\n  That mak'st [us] so unhappy to foresee\n  What we can least prevent!  Pursue thy wishes,\n  And glory in them:  there 's in shame no comfort\n  But to be past all bounds and sense of shame.\n\n  DUCHESS.  I pray, sir, hear me:  I am married.\n\n  FERDINAND.                                      So!\n\n  DUCHESS.  Happily, not to your liking:  but for that,\n  Alas, your shears do come untimely now\n  To clip the bird's wings that 's already flown!\n  Will you see my husband?\n\n  FERDINAND.                Yes, if I could change\n  Eyes with a basilisk.\n\n  DUCHESS.               Sure, you came hither\n  By his confederacy.\n\n  FERDINAND.           The howling of a wolf\n  Is music to thee, screech-owl:  prithee, peace.--\n  Whate'er thou art that hast enjoy'd my sister,\n  For I am sure thou hear'st me, for thine own sake\n  Let me not know thee.  I came hither prepar'd\n  To work thy discovery; yet am now persuaded\n  It would beget such violent effects\n  As would damn us both.  I would not for ten millions\n  I had beheld thee:  therefore use all means\n  I never may have knowledge of thy name;\n  Enjoy thy lust still, and a wretched life,\n  On that condition.--And for thee, vile woman,\n  If thou do wish thy lecher may grow old\n  In thy embracements, I would have thee build\n  Such a room for him as our anchorites\n  To holier use inhabit.  Let not the sun\n  Shine on him till he 's dead; let dogs and monkeys\n  Only converse with him, and such dumb things\n  To whom nature denies use to sound his name;\n  Do not keep a paraquito, lest she learn it;\n  If thou do love him, cut out thine own tongue,\n  Lest it bewray him.\n\n  DUCHESS.             Why might not I marry?\n  I have not gone about in this to create\n  Any new world or custom.\n\n  FERDINAND.                Thou art undone;\n  And thou hast ta'en that massy sheet of lead\n  That hid thy husband's bones, and folded it\n  About my heart.\n\n  DUCHESS.         Mine bleeds for 't.\n\n  FERDINAND.                            Thine! thy heart!\n  What should I name 't unless a hollow bullet\n  Fill'd with unquenchable wild-fire?\n\n  DUCHESS.                             You are in this\n  Too strict; and were you not my princely brother,\n  I would say, too wilful:  my reputation\n  Is safe.\n\n  FERDINAND.  Dost thou know what reputation is?\n  I 'll tell thee,--to small purpose, since the instruction\n  Comes now too late.\n  Upon a time Reputation, Love, and Death,\n  Would travel o'er the world; and it was concluded\n  That they should part, and take three several ways.\n  Death told them, they should find him in great battles,\n  Or cities plagu'd with plagues:  Love gives them counsel\n  To inquire for him 'mongst unambitious shepherds,\n  Where dowries were not talk'd of, and sometimes\n  'Mongst quiet kindred that had nothing left\n  By their dead parents:  'Stay,' quoth Reputation,\n  'Do not forsake me; for it is my nature,\n  If once I part from any man I meet,\n  I am never found again.' And so for you:\n  You have shook hands with Reputation,\n  And made him invisible.  So, fare you well:\n  I will never see you more.\n\n  DUCHESS.                    Why should only I,\n  Of all the other princes of the world,\n  Be cas'd up, like a holy relic?  I have youth\n  And a little beauty.\n\n  FERDINAND.            So you have some virgins\n  That are witches.  I will never see thee more.\n       Exit.\n\n       Re-enter ANTONIO with a pistol, [and CARIOLA]\n\n  DUCHESS.  You saw this apparition?\n\n  ANTONIO.                            Yes:  we are\n  Betray'd.  How came he hither?  I should turn\n  This to thee, for that.\n\n  CARIOLA.                 Pray, sir, do; and when\n  That you have cleft my heart, you shall read there\n  Mine innocence.\n\n  DUCHESS.         That gallery gave him entrance.\n\n  ANTONIO.  I would this terrible thing would come again,\n  That, standing on my guard, I might relate\n  My warrantable love.--\n       (She shows the poniard.)\n                          Ha! what means this?\n\n  DUCHESS.  He left this with me.\n\n  ANTONIO.                         And it seems did wish\n  You would use it on yourself.\n\n  DUCHESS.                       His action seem'd\n  To intend so much.\n\n  ANTONIO.            This hath a handle to 't,\n  As well as a point:  turn it towards him, and\n  So fasten the keen edge in his rank gall.\n       [Knocking within.]\n  How now! who knocks?  More earthquakes?\n\n  DUCHESS.                                 I stand\n  As if a mine beneath my feet were ready\n  To be blown up.\n\n  CARIOLA.         'Tis Bosola.\n\n  DUCHESS.                       Away!\n  O misery! methinks unjust actions\n  Should wear these masks and curtains, and not we.\n  You must instantly part hence:  I have fashion'd it already.\n       Exit ANTONIO.\n\n       Enter BOSOLA\n\n  BOSOLA.  The duke your brother is ta'en up in a whirlwind;\n  Hath took horse, and 's rid post to Rome.\n\n  DUCHESS.                                   So late?\n\n  BOSOLA.  He told me, as he mounted into the saddle,\n  You were undone.\n\n  DUCHESS.          Indeed, I am very near it.\n\n  BOSOLA.  What 's the matter?\n\n  DUCHESS.  Antonio, the master of our household,\n  Hath dealt so falsely with me in 's accounts.\n  My brother stood engag'd with me for money\n  Ta'en up of certain Neapolitan Jews,\n  And Antonio lets the bonds be forfeit.\n\n  BOSOLA.  Strange!--[Aside.] This is cunning.\n\n  DUCHESS.  And hereupon\n  My brother's bills at Naples are protested\n  Against.--Call up our officers.\n\n  BOSOLA.                          I shall.\n       Exit.\n\n       [Re-enter ANTONIO]\n\n  DUCHESS.  The place that you must fly to is Ancona:\n  Hire a house there; I 'll send after you\n  My treasure and my jewels.  Our weak safety\n  Runs upon enginous wheels:[82] short syllables\n  Must stand for periods.  I must now accuse you\n  Of such a feigned crime as Tasso calls\n  Magnanima menzogna, a noble lie,\n  'Cause it must shield our honours.--Hark! they are coming.\n\n       [Re-enter BOSOLA and Officers]\n\n  ANTONIO.  Will your grace hear me?\n\n  DUCHESS.  I have got well by you; you have yielded me\n  A million of loss:  I am like to inherit\n  The people's curses for your stewardship.\n  You had the trick in audit-time to be sick,\n  Till I had sign'd your quietus;[83] and that cur'd you\n  Without help of a doctor.--Gentlemen,\n  I would have this man be an example to you all;\n  So shall you hold my favour; I pray, let him;\n  For h'as done that, alas, you would not think of,\n  And, because I intend to be rid of him,\n  I mean not to publish.--Use your fortune elsewhere.\n\n  ANTONIO.  I am strongly arm'd to brook my overthrow,\n  As commonly men bear with a hard year.\n  I will not blame the cause on 't; but do think\n  The necessity of my malevolent star\n  Procures this, not her humour.  O, the inconstant\n  And rotten ground of service!  You may see,\n  'Tis even like him, that in a winter night,\n  Takes a long slumber o'er a dying fire,\n  A-loth to part from 't; yet parts thence as cold\n  As when he first sat down.\n\n  DUCHESS.                    We do confiscate,\n  Towards the satisfying of your accounts,\n  All that you have.\n\n  ANTONIO.            I am all yours; and 'tis very fit\n  All mine should be so.\n\n  DUCHESS.                So, sir, you have your pass.\n\n  ANTONIO.  You may see, gentlemen, what 'tis to serve\n  A prince with body and soul.\n       Exit.\n\n  BOSOLA.  Here 's an example for extortion:  what moisture is drawn\n  out of the sea, when foul weather comes, pours down, and runs into\n  the sea again.\n\n  DUCHESS.  I would know what are your opinions\n  Of this Antonio.\n\n  SECOND OFFICER.  He could not abide to see a pig's head gaping:\n  I thought your grace would find him a Jew.\n\n  THIRD OFFICER.  I would you had been his officer, for your own sake.\n\n  FOURTH OFFICER.  You would have had more money.\n\n  FIRST OFFICER.  He stopped his ears with black wool, and to those came\n  to him for money said he was thick of hearing.\n\n  SECOND OFFICER.  Some said he was an hermaphrodite, for he could not\n  abide a woman.\n\n  FOURTH OFFICER.  How scurvy proud he would look when the treasury\n  was full!  Well, let him go.\n\n  FIRST OFFICER.  Yes, and the chippings of the buttery fly after him,\n  to scour his gold chain.[84]\n\n  DUCHESS.  Leave us.\n       Exeunt [Officers.]\n  What do you think of these?\n\n  BOSOLA.  That these are rogues that in 's prosperity,\n  But to have waited on his fortune, could have wish'd\n  His dirty stirrup riveted through their noses,\n  And follow'd after 's mule, like a bear in a ring;\n  Would have prostituted their daughters to his lust;\n  Made their first-born intelligencers;[85] thought none happy\n  But such as were born under his blest planet,\n  And wore his livery:  and do these lice drop off now?\n  Well, never look to have the like again:\n  He hath left a sort[86] of flattering rogues behind him;\n  Their doom must follow.  Princes pay flatterers\n  In their own money:  flatterers dissemble their vices,\n  And they dissemble their lies; that 's justice.\n  Alas, poor gentleman!\n\n  DUCHESS.  Poor! he hath amply fill'd his coffers.\n\n  BOSOLA.  Sure, he was too honest.  Pluto,[87] the god of riches,\n  When he 's sent by Jupiter to any man,\n  He goes limping, to signify that wealth\n  That comes on God's name comes slowly; but when he's sent\n  On the devil's errand, he rides post and comes in by scuttles.[88]\n  Let me show you what a most unvalu'd jewel\n  You have in a wanton humour thrown away,\n  To bless the man shall find him.  He was an excellent\n  Courtier and most faithful; a soldier that thought it\n  As beastly to know his own value too little\n  As devilish to acknowledge it too much.\n  Both his virtue and form deserv'd a far better fortune:\n  His discourse rather delighted to judge itself than show itself:\n  His breast was fill'd with all perfection,\n  And yet it seemed a private whisp'ring-room,\n  It made so little noise of 't.\n\n  DUCHESS.  But he was basely descended.\n\n  BOSOLA.  Will you make yourself a mercenary herald,\n  Rather to examine men's pedigrees than virtues?\n  You shall want[89] him:\n  For know an honest statesman to a prince\n  Is like a cedar planted by a spring;\n  The spring bathes the tree's root, the grateful tree\n  Rewards it with his shadow:  you have not done so.\n  I would sooner swim to the Bermoothes on\n  Two politicians' rotten bladders, tied\n  Together with an intelligencer's heart-string,\n  Than depend on so changeable a prince's favour.\n  Fare thee well, Antonio!  Since the malice of the world\n  Would needs down with thee, it cannot be said yet\n  That any ill happen'd unto thee, considering thy fall\n  Was accompanied with virtue.\n\n  DUCHESS.  O, you render me excellent music!\n\n  BOSOLA.                                      Say you?\n\n  DUCHESS.  This good one that you speak of is my husband.\n\n  BOSOLA.  Do I not dream?  Can this ambitious age\n  Have so much goodness in 't as to prefer\n  A man merely for worth, without these shadows\n  Of wealth and painted honours?  Possible?\n\n  DUCHESS.  I have had three children by him.\n\n  BOSOLA.                                      Fortunate lady!\n  For you have made your private nuptial bed\n  The humble and fair seminary of peace,\n  No question but:  many an unbenefic'd scholar\n  Shall pray for you for this deed, and rejoice\n  That some preferment in the world can yet\n  Arise from merit.  The virgins of your land\n  That have no dowries shall hope your example\n  Will raise them to rich husbands.  Should you want\n  Soldiers, 'twould make the very Turks and Moors\n  Turn Christians, and serve you for this act.\n  Last, the neglected poets of your time,\n  In honour of this trophy of a man,\n  Rais'd by that curious engine, your white hand,\n  Shall thank you, in your grave, for 't; and make that\n  More reverend than all the cabinets\n  Of living princes.  For Antonio,\n  His fame shall likewise flow from many a pen,\n  When heralds shall want coats to sell to men.\n\n  DUCHESS.  As I taste comfort in this friendly speech,\n  So would I find concealment.\n\n  BOSOLA.  O, the secret of my prince,\n  Which I will wear on th' inside of my heart!\n\n  DUCHESS.  You shall take charge of all my coin and jewels,\n  And follow him; for he retires himself\n  To Ancona.\n\n  BOSOLA.     So.\n\n  DUCHESS.         Whither, within few days,\n  I mean to follow thee.\n\n  BOSOLA.                 Let me think:\n  I would wish your grace to feign a pilgrimage\n  To our Lady of Loretto, scarce seven leagues\n  ]From fair Ancona; so may you depart\n  Your country with more honour, and your flight\n  Will seem a princely progress, retaining\n  Your usual train about you.\n\n  DUCHESS.                     Sir, your direction\n  Shall lead me by the hand.\n\n  CARIOLA.                    In my opinion,\n  She were better progress to the baths at Lucca,\n  Or go visit the Spa\n  In Germany; for, if you will believe me,\n  I do not like this jesting with religion,\n  This feigned pilgrimage.\n\n  DUCHESS.  Thou art a superstitious fool:\n  Prepare us instantly for our departure.\n  Past sorrows, let us moderately lament them,\n  For those to come, seek wisely to prevent them.\n       [Exeunt DUCHESS and CARIOLA.]\n\n  BOSOLA.  A politician is the devil's quilted anvil;\n  He fashions all sins on him, and the blows\n  Are never heard:  he may work in a lady's chamber,\n  As here for proof.  What rests[90] but I reveal\n  All to my lord?  O, this base quality[91]\n  Of intelligencer!  Why, every quality i' the world\n  Prefers but gain or commendation:\n  Now, for this act I am certain to be rais'd,\n  And men that paint weeds to the life are prais'd.\n       [Exit.]\n\n\n       Scene III[92]\n\n       [Enter] CARDINAL, FERDINAND, MALATESTI, PESCARA, DELIO,\n       and SILVIO\n\n  CARDINAL.  Must we turn soldier, then?\n\n  MALATESTI.                              The emperor,\n  Hearing your worth that way, ere you attain'd\n  This reverend garment, joins you in commission\n  With the right fortunate soldier the Marquis of Pescara,\n  And the famous Lannoy.\n\n  CARDINAL.               He that had the honour\n  Of taking the French king prisoner?\n\n  MALATESTI.                           The same.\n  Here 's a plot drawn for a new fortification\n  At Naples.\n\n  FERDINAND.  This great Count Malatesti, I perceive,\n  Hath got employment?\n\n  DELIO.                No employment, my lord;\n  A marginal note in the muster-book, that he is\n  A voluntary lord.\n\n  FERDINAND.         He 's no soldier.\n\n  DELIO.  He has worn gun-powder in 's hollow tooth for the tooth-ache.\n\n  SILVIO.  He comes to the leaguer with a full intent\n  To eat fresh beef and garlic, means to stay\n  Till the scent be gone, and straight return to court.\n\n  DELIO.  He hath read all the late service\n  As the City-Chronicle relates it;\n  And keeps two pewterers going, only to express\n  Battles in model.\n\n  SILVIO.            Then he 'll fight by the book.\n\n  DELIO.  By the almanac, I think,\n  To choose good days and shun the critical;\n  That 's his mistress' scarf.\n\n  SILVIO.                       Yes, he protests\n  He would do much for that taffeta.\n\n  DELIO.  I think he would run away from a battle,\n  To save it from taking prisoner.\n\n  SILVIO.                           He is horribly afraid\n  Gun-powder will spoil the perfume on 't.\n\n  DELIO.  I saw a Dutchman break his pate once\n  For calling him pot-gun; he made his head\n  Have a bore in 't like a musket.\n\n  SILVIO.  I would he had made a touch-hole to 't.\n  He is indeed a guarded sumpter-cloth,[93]\n  Only for the remove of the court.\n\n       [Enter BOSOLA]\n\n  PESCARA.  Bosola arriv'd!  What should be the business?\n  Some falling-out amongst the cardinals.\n  These factions amongst great men, they are like\n  Foxes, when their heads are divided,\n  They carry fire in their tails, and all the country\n  About them goes to wrack for 't.\n\n  SILVIO.                           What 's that Bosola?\n\n  DELIO.  I knew him in Padua,--a fantastical scholar, like such who\n  study to know how many knots was in Hercules' club, of what colour\n  Achilles' beard was, or whether Hector were not troubled with the\n  tooth-ache.  He hath studied himself half blear-eyed to know the true\n  symmetry of Caesar's nose by a shoeing-horn; and this he did to gain\n  the name of a speculative man.\n\n  PESCARA.  Mark Prince Ferdinand:\n  A very salamander lives in 's eye,\n  To mock the eager violence of fire.\n\n  SILVIO.  That cardinal hath made more bad faces with his oppression\n  than ever Michael Angelo made good ones.  He lifts up 's nose, like\n  a foul porpoise before a storm.\n\n  PESCARA.  The Lord Ferdinand laughs.\n\n  DELIO.                                Like a deadly cannon\n  That lightens ere it smokes.\n\n  PESCARA.  These are your true pangs of death,\n  The pangs of life, that struggle with great statesmen.\n\n  DELIO.  In such a deformed silence witches whisper their charms.\n\n  CARDINAL.  Doth she make religion her riding-hood\n  To keep her from the sun and tempest?\n\n  FERDINAND.  That, that damns her.  Methinks her fault and beauty,\n  Blended together, show like leprosy,\n  The whiter, the fouler.  I make it a question\n  Whether her beggarly brats were ever christ'ned.\n\n  CARDINAL.  I will instantly solicit the state of Ancona\n  To have them banish'd.\n\n  FERDINAND.              You are for Loretto:\n  I shall not be at your ceremony; fare you well.--\n  Write to the Duke of Malfi, my young nephew\n  She had by her first husband, and acquaint him\n  With 's mother's honesty.\n\n  BOSOLA.                    I will.\n\n  FERDINAND.                          Antonio!\n  A slave that only smell'd of ink and counters,\n  And never in 's life look'd like a gentleman,\n  But in the audit-time.--Go, go presently,\n  Draw me out an hundred and fifty of our horse,\n  And meet me at the foot-bridge.\n       Exeunt.\n\n\n       Scene IV\n\n       [Enter] Two Pilgrims to the Shrine of our Lady of Loretto\n\n  FIRST PILGRIM.  I have not seen a goodlier shrine than this;\n  Yet I have visited many.\n\n  SECOND PILGRIM.           The Cardinal of Arragon\n  Is this day to resign his cardinal's hat:\n  His sister duchess likewise is arriv'd\n  To pay her vow of pilgrimage.  I expect\n  A noble ceremony.\n\n  FIRST PILGRIM.     No question.--They come.\n\n       [Here the ceremony of the Cardinal's instalment, in the habit\n       of a soldier, perform'd in delivering up his cross, hat, robes,\n       and ring, at the shrine, and investing him with sword, helmet,\n       shield, and spurs; then ANTONIO, the DUCHESS and their children,\n       having presented themselves at the shrine, are, by a form\n       of banishment in dumb-show expressed towards them by the\n       CARDINAL and the state of Ancona, banished:  during all which\n       ceremony, this ditty is sung, to very solemn music, by divers\n       churchmen:  and then exeunt [all except the] Two Pilgrims.\n\n  Arms and honours deck thy story,\n  To thy fame's eternal glory!\n  Adverse fortune ever fly thee;\n  No disastrous fate come nigh thee!\n\n  I alone will sing thy praises,\n  Whom to honour virtue raises,\n  And thy study, that divine is,\n  Bent to martial discipline is,\n  Lay aside all those robes lie by thee;\n  Crown thy arts with arms, they 'll beautify thee.\n\n  O worthy of worthiest name, adorn'd in this manner,\n  Lead bravely thy forces on under war's warlike banner!\n  O, mayst thou prove fortunate in all martial courses!\n  Guide thou still by skill in arts and forces!\n  Victory attend thee nigh, whilst fame sings loud thy powers;\n  Triumphant conquest crown thy head, and blessings pour down\n       showers![94]\n\n  FIRST PILGRIM.\n  Here 's a strange turn of state! who would have thought\n  So great a lady would have match'd herself\n  Unto so mean a person?  Yet the cardinal\n  Bears himself much too cruel.\n\n  SECOND PILGRIM.                They are banish'd.\n\n  FIRST PILGRIM.  But I would ask what power hath this state\n  Of Ancona to determine of a free prince?\n\n  SECOND PILGRIM.  They are a free state, sir, and her brother show'd\n  How that the Pope, fore-hearing of her looseness,\n  Hath seiz'd into th' protection of the church\n  The dukedom which she held as dowager.\n\n  FIRST PILGRIM.  But by what justice?\n\n  SECOND PILGRIM.                       Sure, I think by none,\n  Only her brother's instigation.\n\n  FIRST PILGRIM.  What was it with such violence he took\n  Off from her finger?\n\n  SECOND PILGRIM.       'Twas her wedding-ring;\n  Which he vow'd shortly he would sacrifice\n  To his revenge.\n\n  FIRST PILGRIM.      Alas, Antonio!\n  If that a man be thrust into a well,\n  No matter who sets hand to 't, his own weight\n  Will bring him sooner to th' bottom.  Come, let 's hence.\n  Fortune makes this conclusion general,\n  All things do help th' unhappy man to fall.\n       Exeunt.\n\n\n       Scene V[95]\n\n       [Enter] DUCHESS, ANTONIO, Children, CARIOLA, and Servants\n\n  DUCHESS.  Banish'd Ancona!\n\n  ANTONIO.                    Yes, you see what power\n  Lightens in great men's breath.\n\n  DUCHESS.                         Is all our train\n  Shrunk to this poor remainder?\n\n  ANTONIO.                        These poor men\n  Which have got little in your service, vow\n  To take your fortune:  but your wiser buntings,[96]\n  Now they are fledg'd, are gone.\n\n  DUCHESS.                         They have done wisely.\n  This puts me in mind of death:  physicians thus,\n  With their hands full of money, use to give o'er\n  Their patients.\n\n  ANTONIO.         Right the fashion of the world:\n  ]From decay'd fortunes every flatterer shrinks;\n  Men cease to build where the foundation sinks.\n\n  DUCHESS.  I had a very strange dream to-night.\n\n  ANTONIO.                                        What was 't?\n\n  DUCHESS.  Methought I wore my coronet of state,\n  And on a sudden all the diamonds\n  Were chang'd to pearls.\n\n  ANTONIO.                 My interpretation\n  Is, you 'll weep shortly; for to me the pearls\n  Do signify your tears.\n\n  DUCHESS.                The birds that live i' th' field\n  On the wild benefit of nature live\n  Happier than we; for they may choose their mates,\n  And carol their sweet pleasures to the spring.\n\n       [Enter BOSOLA with a letter]\n\n  BOSOLA.  You are happily o'erta'en.\n\n  DUCHESS.                             From my brother?\n\n  BOSOLA.  Yes, from the Lord Ferdinand your brother\n  All love and safety.\n\n  DUCHESS.              Thou dost blanch mischief,\n  Would'st make it white.  See, see, like to calm weather\n  At sea before a tempest, false hearts speak fair\n  To those they intend most mischief.\n  [Reads.] 'Send Antonio to me; I want his head in a business.'\n  A politic equivocation!\n  He doth not want your counsel, but your head;\n  That is, he cannot sleep till you be dead.\n  And here 's another pitfall that 's strew'd o'er\n  With roses; mark it, 'tis a cunning one:\n       [Reads.]\n    'I stand engaged for your husband for several debts at Naples:\n    let not that trouble him; I had rather have his heart than his\n    money':--\n  And I believe so too.\n\n  BOSOLA.                What do you believe?\n\n  DUCHESS.  That he so much distrusts my husband's love,\n  He will by no means believe his heart is with him\n  Until he see it:  the devil is not cunning enough\n  To circumvent us In riddles.\n\n  BOSOLA.  Will you reject that noble and free league\n  Of amity and love which I present you?\n\n  DUCHESS.  Their league is like that of some politic kings,\n  Only to make themselves of strength and power\n  To be our after-ruin; tell them so.\n\n  BOSOLA.  And what from you?\n\n  ANTONIO.                     Thus tell him; I will not come.\n\n  BOSOLA.  And what of this?\n\n  ANTONIO.                    My brothers have dispers'd\n  Bloodhounds abroad; which till I hear are muzzl'd,\n  No truce, though hatch'd with ne'er such politic skill,\n  Is safe, that hangs upon our enemies' will.\n  I 'll not come at them.\n\n  BOSOLA.                  This proclaims your breeding.\n  Every small thing draws a base mind to fear,\n  As the adamant draws iron.  Fare you well, sir;\n  You shall shortly hear from 's.\n       Exit.\n\n  DUCHESS.                         I suspect some ambush;\n  Therefore by all my love I do conjure you\n  To take your eldest son, and fly towards Milan.\n  Let us not venture all this poor remainder\n  In one unlucky bottom.\n\n  ANTONIO.                You counsel safely.\n  Best of my life, farewell.  Since we must part,\n  Heaven hath a hand in 't; but no otherwise\n  Than as some curious artist takes in sunder\n  A clock or watch, when it is out of frame,\n  To bring 't in better order.\n\n  DUCHESS.  I know not which is best,\n  To see you dead, or part with you.--Farewell, boy:\n  Thou art happy that thou hast not understanding\n  To know thy misery; for all our wit\n  And reading brings us to a truer sense\n  Of sorrow.--In the eternal church, sir,\n  I do hope we shall not part thus.\n\n  ANTONIO.                           O, be of comfort!\n  Make patience a noble fortitude,\n  And think not how unkindly we are us'd:\n  Man, like to cassia, is prov'd best, being bruis'd.\n\n  DUCHESS.  Must I, like to slave-born Russian,\n  Account it praise to suffer tyranny?\n  And yet, O heaven, thy heavy hand is in 't!\n  I have seen my little boy oft scourge his top,\n  And compar'd myself to 't:  naught made me e'er\n  Go right but heaven's scourge-stick.\n\n  ANTONIO.                              Do not weep:\n  Heaven fashion'd us of nothing; and we strive\n  To bring ourselves to nothing.--Farewell, Cariola,\n  And thy sweet armful.--If I do never see thee more,\n  Be a good mother to your little ones,\n  And save them from the tiger:  fare you well.\n\n  DUCHESS.  Let me look upon you once more, for that speech\n  Came from a dying father.  Your kiss is colder\n  Than that I have seen an holy anchorite\n  Give to a dead man's skull.\n\n  ANTONIO.  My heart is turn'd to a heavy lump of lead,\n  With which I sound my danger:  fare you well.\n       Exeunt [ANTONIO and his son.]\n\n  DUCHESS.  My laurel is all withered.\n\n  CARIOLA.  Look, madam, what a troop of armed men\n  Make toward us!\n\n       Re-enter BOSOLA [visarded,] with a Guard\n\n  DUCHESS.         O, they are very welcome:\n  When Fortune's wheel is over-charg'd with princes,\n  The weight makes it move swift:  I would have my ruin\n  Be sudden.--I am your adventure, am I not?\n\n  BOSOLA.  You are:  you must see your husband no more.\n\n  DUCHESS.  What devil art thou that counterfeit'st heaven's thunder?\n\n  BOSOLA.  Is that terrible?  I would have you tell me whether\n  Is that note worse that frights the silly birds\n  Out of the corn, or that which doth allure them\n  To the nets?  You have heark'ned to the last too much.\n\n  DUCHESS.  O misery! like to a rusty o'ercharg'd cannon,\n  Shall I never fly in pieces?--Come, to what prison?\n\n  BOSOLA.  To none.\n\n  DUCHESS.           Whither, then?\n\n  BOSOLA.                            To your palace.\n\n  DUCHESS.                                            I have heard\n  That Charon's boat serves to convey all o'er\n  The dismal lake, but brings none back again.\n\n  BOSOLA.  Your brothers mean you safety and pity.\n\n  DUCHESS.                                          Pity!\n  With such a pity men preserve alive\n  Pheasants and quails, when they are not fat enough\n  To be eaten.\n\n  BOSOLA.  These are your children?\n\n  DUCHESS.                           Yes.\n\n  BOSOLA.                                  Can they prattle?\n\n  DUCHESS.  No:\n  But I intend, since they were born accurs'd,\n  Curses shall be their first language.\n\n  BOSOLA.                                Fie, madam!\n  Forget this base, low fellow----\n\n  DUCHESS.                          Were I a man,\n  I 'd beat that counterfeit face[97] into thy other.\n\n  BOSOLA.  One of no birth.\n\n  DUCHESS.                   Say that he was born mean,\n  Man is most happy when 's own actions\n  Be arguments and examples of his virtue.\n\n  BOSOLA.  A barren, beggarly virtue.\n\n  DUCHESS.  I prithee, who is greatest?  Can you tell?\n  Sad tales befit my woe:  I 'll tell you one.\n  A salmon, as she swam unto the sea.\n  Met with a dog-fish, who encounters her\n  With this rough language; 'Why art thou so bold\n  To mix thyself with our high state of floods,\n  Being no eminent courtier, but one\n  That for the calmest and fresh time o' th' year\n  Dost live in shallow rivers, rank'st thyself\n  With silly smelts and shrimps?  And darest thou\n  Pass by our dog-ship without reverence?'\n  'O,' quoth the salmon, 'sister, be at peace:\n  Thank Jupiter we both have pass'd the net!\n  Our value never can be truly known,\n  Till in the fisher's basket we be shown:\n  I' th' market then my price may be the higher,\n  Even when I am nearest to the cook and fire.'\n  So to great men the moral may be stretched;\n  Men oft are valu'd high, when they're most wretched.--\n  But come, whither you please.  I am arm'd 'gainst misery;\n  Bent to all sways of the oppressor's will:\n  There 's no deep valley but near some great hill.\n       Exeunt.\n\n\n\n       Act IV\n\n\n       Scene I[98]\n\n       [Enter] FERDINAND and BOSOLA\n\n  FERDINAND.  How doth our sister duchess bear herself\n  In her imprisonment?\n\n  BOSOLA.               Nobly:  I 'll describe her.\n  She 's sad as one long us'd to 't, and she seems\n  Rather to welcome the end of misery\n  Than shun it; a behaviour so noble\n  As gives a majesty to adversity:\n  You may discern the shape of loveliness\n  More perfect in her tears than in her smiles:\n  She will muse for hours together; and her silence,\n  Methinks, expresseth more than if she spake.\n\n  FERDINAND.  Her melancholy seems to be fortified\n  With a strange disdain.\n\n  BOSOLA.                  'Tis so; and this restraint,\n  Like English mastives that grow fierce with tying,\n  Makes her too passionately apprehend\n  Those pleasures she is kept from.\n\n  FERDINAND.                         Curse upon her!\n  I will no longer study in the book\n  Of another's heart.  Inform her what I told you.\n       Exit.\n\n       [Enter DUCHESS and Attendants]\n\n  BOSOLA.  All comfort to your grace!\n\n  DUCHESS.                             I will have none.\n  Pray thee, why dost thou wrap thy poison'd pills\n  In gold and sugar?\n\n  BOSOLA.  Your elder brother, the Lord Ferdinand,\n  Is come to visit you, and sends you word,\n  'Cause once he rashly made a solemn vow\n  Never to see you more, he comes i' th' night;\n  And prays you gently neither torch nor taper\n  Shine in your chamber.  He will kiss your hand,\n  And reconcile himself; but for his vow\n  He dares not see you.\n\n  DUCHESS.               At his pleasure.--\n  Take hence the lights.--He 's come.\n       [Exeunt Attendants with lights.]\n\n       [Enter FERDINAND]\n\n  FERDINAND.                           Where are you?\n\n  DUCHESS.                                             Here, sir.\n\n  FERDINAND.  This darkness suits you well.\n\n  DUCHESS.                                   I would ask you pardon.\n\n  FERDINAND.  You have it;\n  For I account it the honorabl'st revenge,\n  Where I may kill, to pardon.--Where are your cubs?\n\n  DUCHESS.  Whom?\n\n  FERDINAND.       Call them your children;\n  For though our national law distinguish bastards\n  ]From true legitimate issue, compassionate nature\n  Makes them all equal.\n\n  DUCHESS.               Do you visit me for this?\n  You violate a sacrament o' th' church\n  Shall make you howl in hell for 't.\n\n  FERDINAND.                           It had been well,\n  Could you have liv'd thus always; for, indeed,\n  You were too much i' th' light:--but no more;\n  I come to seal my peace with you.  Here 's a hand\n       Gives her a dead man's hand.\n  To which you have vow'd much love; the ring upon 't\n  You gave.\n\n  DUCHESS.  I affectionately kiss it.\n\n  FERDINAND.  Pray, do, and bury the print of it in your heart.\n  I will leave this ring with you for a love-token;\n  And the hand as sure as the ring; and do not doubt\n  But you shall have the heart too.  When you need a friend,\n  Send it to him that ow'd it; you shall see\n  Whether he can aid you.\n\n  DUCHESS.                 You are very cold:\n  I fear you are not well after your travel.--\n  Ha! lights!----O, horrible!\n\n  FERDINAND.                   Let her have lights enough.\n       Exit.\n\n  DUCHESS.  What witchcraft doth he practise, that he hath left\n  A dead man's hand here?\n       [Here is discovered, behind a traverse,[99] the artificial\n       figures of ANTONIO and his children, appearing as if\n       they were dead.\n\n  BOSOLA.  Look you, here 's the piece from which 'twas ta'en.\n  He doth present you this sad spectacle,\n  That, now you know directly they are dead,\n  Hereafter you may wisely cease to grieve\n  For that which cannot be recovered.\n\n  DUCHESS.  There is not between heaven and earth one wish\n  I stay for after this.  It wastes me more\n  Than were 't my picture, fashion'd out of wax,\n  Stuck with a magical needle, and then buried\n  In some foul dunghill; and yon 's an excellent property\n  For a tyrant, which I would account mercy.\n\n  BOSOLA.                                     What 's that?\n\n  DUCHESS.  If they would bind me to that lifeless trunk,\n  And let me freeze to death.\n\n  BOSOLA.                      Come, you must live.\n\n  DUCHESS.  That 's the greatest torture souls feel in hell,\n  In hell, that they must live, and cannot die.\n  Portia,[100] I 'll new kindle thy coals again,\n  And revive the rare and almost dead example\n  Of a loving wife.\n\n  BOSOLA.            O, fie! despair?  Remember\n  You are a Christian.\n\n  DUCHESS.              The church enjoins fasting:\n  I 'll starve myself to death.\n\n  BOSOLA.                        Leave this vain sorrow.\n  Things being at the worst begin to mend:  the bee\n  When he hath shot his sting into your hand,\n  May then play with your eye-lid.\n\n  DUCHESS.                          Good comfortable fellow,\n  Persuade a wretch that 's broke upon the wheel\n  To have all his bones new set; entreat him live\n  To be executed again.  Who must despatch me?\n  I account this world a tedious theatre,\n  For I do play a part in 't 'gainst my will.\n\n  BOSOLA.  Come, be of comfort; I will save your life.\n\n  DUCHESS.  Indeed, I have not leisure to tend so small a business.\n\n  BOSOLA.  Now, by my life, I pity you.\n\n  DUCHESS.                               Thou art a fool, then,\n  To waste thy pity on a thing so wretched\n  As cannot pity itself.  I am full of daggers.\n  Puff, let me blow these vipers from me.\n       [Enter Servant]\n  What are you?\n\n  SERVANT.       One that wishes you long life.\n\n  DUCHESS.  I would thou wert hang'd for the horrible curse\n  Thou hast given me:  I shall shortly grow one\n  Of the miracles of pity.  I 'll go pray;--\n       [Exit Servant.]\n  No, I 'll go curse.\n\n  BOSOLA.              O, fie!\n\n  DUCHESS.                      I could curse the stars.\n\n  BOSOLA.                                                 O, fearful!\n\n  DUCHESS.  And those three smiling seasons of the year\n  Into a Russian winter; nay, the world\n  To its first chaos.\n\n  BOSOLA.              Look you, the stars shine still[.]\n\n  DUCHESS.  O, but you must\n  Remember, my curse hath a great way to go.--\n  Plagues, that make lanes through largest families,\n  Consume them!--\n\n  BOSOLA.          Fie, lady!\n\n  DUCHESS.                     Let them, like tyrants,\n  Never be remembered but for the ill they have done;\n  Let all the zealous prayers of mortified\n  Churchmen forget them!--\n\n  BOSOLA.                   O, uncharitable!\n\n  DUCHESS.  Let heaven a little while cease crowning martyrs,\n  To punish them!--\n  Go, howl them this, and say, I long to bleed:\n  It is some mercy when men kill with speed.\n       Exit.\n\n       [Re-enter FERDINAND]\n\n  FERDINAND.  Excellent, as I would wish; she 's plagu'd in art.[101]\n  These presentations are but fram'd in wax\n  By the curious master in that quality,[102]\n  Vincentio Lauriola, and she takes them\n  For true substantial bodies.\n\n  BOSOLA.                       Why do you do this?\n\n  FERDINAND.  To bring her to despair.\n\n  BOSOLA.                               Faith, end here,\n  And go no farther in your cruelty:\n  Send her a penitential garment to put on\n  Next to her delicate skin, and furnish her\n  With beads and prayer-books.\n\n  FERDINAND.                    Damn her! that body of hers.\n  While that my blood run pure in 't, was more worth\n  Than that which thou wouldst comfort, call'd a soul.\n  I will send her masques of common courtezans,\n  Have her meat serv'd up by bawds and ruffians,\n  And, 'cause she 'll needs be mad, I am resolv'd\n  To move forth the common hospital\n  All the mad-folk, and place them near her lodging;\n  There let them practise together, sing and dance,\n  And act their gambols to the full o' th' moon:\n  If she can sleep the better for it, let her.\n  Your work is almost ended.\n\n  BOSOLA.                     Must I see her again?\n\n  FERDINAND.  Yes.\n\n  BOSOLA.           Never.\n\n  FERDINAND.                You must.\n\n  BOSOLA.                              Never in mine own shape;\n  That 's forfeited by my intelligence[103]\n  And this last cruel lie:  when you send me next,\n  The business shall be comfort.\n\n  FERDINAND.                      Very likely;\n  Thy pity is nothing of kin to thee, Antonio\n  Lurks about Milan:  thou shalt shortly thither,\n  To feed a fire as great as my revenge,\n  Which nev'r will slack till it hath spent his fuel:\n  Intemperate agues make physicians cruel.\n       Exeunt.\n\n       Scene II[104]\n\n       [Enter] DUCHESS and CARIOLA\n\n  DUCHESS.  What hideous noise was that?\n\n  CARIOLA.                                'Tis the wild consort[105]\n  Of madmen, lady, which your tyrant brother\n  Hath plac'd about your lodging.  This tyranny,\n  I think, was never practis'd till this hour.\n\n  DUCHESS.  Indeed, I thank him.  Nothing but noise and folly\n  Can keep me in my right wits; whereas reason\n  And silence make me stark mad.  Sit down;\n  Discourse to me some dismal tragedy.\n\n  CARIOLA.  O, 'twill increase your melancholy!\n\n  DUCHESS.                                       Thou art deceiv'd:\n  To hear of greater grief would lessen mine.\n  This is a prison?\n\n  CARIOLA.           Yes, but you shall live\n  To shake this durance off.\n\n  DUCHESS.                    Thou art a fool:\n  The robin-red-breast and the nightingale\n  Never live long in cages.\n\n  CARIOLA.                   Pray, dry your eyes.\n  What think you of, madam?\n\n  DUCHESS.                   Of nothing;\n  When I muse thus, I sleep.\n\n  CARIOLA.  Like a madman, with your eyes open?\n\n  DUCHESS.  Dost thou think we shall know one another\n  In th' other world?\n\n  CARIOLA.             Yes, out of question.\n\n  DUCHESS.  O, that it were possible we might\n  But hold some two days' conference with the dead!\n  ]From them I should learn somewhat, I am sure,\n  I never shall know here.  I 'll tell thee a miracle:\n  I am not mad yet, to my cause of sorrow:\n  Th' heaven o'er my head seems made of molten brass,\n  The earth of flaming sulphur, yet I am not mad.\n  I am acquainted with sad misery\n  As the tann'd galley-slave is with his oar;\n  Necessity makes me suffer constantly,\n  And custom makes it easy.  Who do I look like now?\n\n  CARIOLA.  Like to your picture in the gallery,\n  A deal of life in show, but none in practice;\n  Or rather like some reverend monument\n  Whose ruins are even pitied.\n\n  DUCHESS.                      Very proper;\n  And Fortune seems only to have her eye-sight\n  To behold my tragedy.--How now!\n  What noise is that?\n\n       [Enter Servant]\n\n  SERVANT.             I am come to tell you\n  Your brother hath intended you some sport.\n  A great physician, when the Pope was sick\n  Of a deep melancholy, presented him\n  With several sorts[106] of madmen, which wild object\n  Being full of change and sport, forc'd him to laugh,\n  And so the imposthume[107] broke:  the self-same cure\n  The duke intends on you.\n\n  DUCHESS.                  Let them come in.\n\n  SERVANT.  There 's a mad lawyer; and a secular priest;\n  A doctor that hath forfeited his wits\n  By jealousy; an astrologian\n  That in his works said such a day o' the month\n  Should be the day of doom, and, failing of 't,\n  Ran mad; an English tailor craz'd i' the brain\n  With the study of new fashions; a gentleman-usher\n  Quite beside himself with care to keep in mind\n  The number of his lady's salutations\n  Or 'How do you,' she employ'd him in each morning;\n  A farmer, too, an excellent knave in grain,[108]\n  Mad 'cause he was hind'red transportation:[109]\n  And let one broker that 's mad loose to these,\n  You'd think the devil were among them.\n\n  DUCHESS.  Sit, Cariola.--Let them loose when you please,\n  For I am chain'd to endure all your tyranny.\n\n       [Enter Madman]\n\n       Here by a Madman this song is sung to a dismal kind of music\n\n  O, let us howl some heavy note,\n    Some deadly dogged howl,\n  Sounding as from the threatening throat\n    Of beasts and fatal fowl!\n  As ravens, screech-owls, bulls, and bears,\n    We 'll bell, and bawl our parts,\n  Till irksome noise have cloy'd your ears\n    And corrosiv'd your hearts.\n  At last, whenas our choir wants breath,\n    Our bodies being blest,\n  We 'll sing, like swans, to welcome death,\n    And die in love and rest.\n\n  FIRST MADMAN.  Doom's-day not come yet!  I 'll draw it nearer by\n  a perspective,[110] or make a glass that shall set all the world\n  on fire upon an instant.  I cannot sleep; my pillow is stuffed\n  with a litter of porcupines.\n\n  SECOND MADMAN.  Hell is a mere glass-house, where the devils\n  are continually blowing up women's souls on hollow irons,\n  and the fire never goes out.\n\n  FIRST MADMAN.  I have skill in heraldry.\n\n  SECOND MADMAN.  Hast?\n\n  FIRST MADMAN.  You do give for your crest a woodcock's head\n  with the brains picked out on 't; you are a very ancient gentleman.\n\n  THIRD MADMAN.  Greek is turned Turk:  we are only to be saved by\n  the Helvetian translation.[111]\n\n  FIRST MADMAN.  Come on, sir, I will lay the law to you.\n\n  SECOND MADMAN.  O, rather lay a corrosive:  the law will eat\n  to the bone.\n\n  THIRD MADMAN.  He that drinks but to satisfy nature is damn'd.\n\n  FOURTH MADMAN.  If I had my glass here, I would show a sight should\n  make all the women here call me mad doctor.\n\n  FIRST MADMAN.  What 's he? a rope-maker?\n\n  SECOND MADMAN.  No, no, no, a snuffling knave that, while he shows\n  the tombs, will have his hand in a wench's placket.[112]\n\n  THIRD MADMAN.  Woe to the caroche[113] that brought home my wife\n  from the masque at three o'clock in the morning!  It had a large\n  feather-bed in it.\n\n  FOURTH MADMAN.  I have pared the devil's nails forty times, roasted\n  them in raven's eggs, and cured agues with them.\n\n  THIRD MADMAN.  Get me three hundred milch-bats, to make possets[114]\n  to procure sleep.\n\n  FOURTH MADMAN.  All the college may throw their caps at me:\n  I have made a soap-boiler costive; it was my masterpiece.\n\n       Here the dance, consisting of Eight Madmen, with music\n       answerable thereunto; after which, BOSOLA, like an old man,\n       enters.\n\n  DUCHESS.  Is he mad too?\n\n  SERVANT.                  Pray, question him.  I 'll leave you.\n       [Exeunt Servant and Madmen.]\n\n  BOSOLA.  I am come to make thy tomb.\n\n  DUCHESS.                              Ha! my tomb!\n  Thou speak'st as if I lay upon my death-bed,\n  Gasping for breath.  Dost thou perceive me sick?\n\n  BOSOLA.\n  Yes, and the more dangerously, since thy sickness is insensible.\n\n  DUCHESS.  Thou art not mad, sure:  dost know me?\n\n  BOSOLA.                                           Yes.\n\n  DUCHESS.                                                Who am I?\n\n  BOSOLA.  Thou art a box of worm-seed, at best but a salvatory[115]\n  of green mummy.[116] What 's this flesh? a little crudded[117] milk,\n  fantastical puff-paste.  Our bodies are weaker than those paper-\n  prisons boys use to keep flies in; more contemptible, since ours\n  is to preserve earth-worms.  Didst thou ever see a lark in a cage?\n  Such is the soul in the body:  this world is like her little turf\n  of grass, and the heaven o'er our heads like her looking-glass, only\n  gives us a miserable knowledge of the small compass of our prison.\n\n  DUCHESS.  Am not I thy duchess?\n\n  BOSOLA.  Thou art some great woman, sure, for riot begins to sit\n  on thy forehead (clad in gray hairs) twenty years sooner than on\n  a merry milk-maid's.  Thou sleepest worse than if a mouse should be\n  forced to take up her lodging in a cat's ear:  a little infant that\n  breeds its teeth, should it lie with thee, would cry out, as if thou\n  wert the more unquiet bedfellow.\n\n  DUCHESS.  I am Duchess of Malfi still.\n\n  BOSOLA.  That makes thy sleep so broken:\n  Glories, like glow-worms, afar off shine bright,\n  But, look'd to near, have neither heat nor light.\n\n  DUCHESS.  Thou art very plain.\n\n  BOSOLA.  My trade is to flatter the dead, not the living;\n  I am a tomb-maker.\n\n  DUCHESS.  And thou comest to make my tomb?\n\n  BOSOLA.  Yes.\n\n  DUCHESS.  Let me be a little merry:--of what stuff wilt thou make it?\n\n  BOSOLA.  Nay, resolve me first, of what fashion?\n\n  DUCHESS.  Why, do we grow fantastical on our deathbed?\n  Do we affect fashion in the grave?\n\n  BOSOLA.  Most ambitiously.  Princes' images on their tombs do not\n  lie, as they were wont, seeming to pray up to heaven; but with their\n  hands under their cheeks, as if they died of the tooth-ache.  They\n  are not carved with their eyes fix'd upon the stars, but as their\n  minds were wholly bent upon the world, the selfsame way they seem\n  to turn their faces.\n\n  DUCHESS.  Let me know fully therefore the effect\n  Of this thy dismal preparation,\n  This talk fit for a charnel.\n\n  BOSOLA.                       Now I shall:--\n       [Enter Executioners, with] a coffin, cords, and a bell\n  Here is a present from your princely brothers;\n  And may it arrive welcome, for it brings\n  Last benefit, last sorrow.\n\n  DUCHESS.                    Let me see it:\n  I have so much obedience in my blood,\n  I wish it in their veins to do them good.\n\n  BOSOLA.  This is your last presence-chamber.\n\n  CARIOLA.  O my sweet lady!\n\n  DUCHESS.                    Peace; it affrights not me.\n\n  BOSOLA.  I am the common bellman\n  That usually is sent to condemn'd persons\n  The night before they suffer.\n\n  DUCHESS.                       Even now thou said'st\n  Thou wast a tomb-maker.\n\n  BOSOLA.                  'Twas to bring you\n  By degrees to mortification.  Listen.\n\n    Hark, now everything is still,\n    The screech-owl and the whistler shrill\n    Call upon our dame aloud,\n    And bid her quickly don her shroud!\n    Much you had of land and rent;\n    Your length in clay 's now competent:\n    A long war disturb'd your mind;\n    Here your perfect peace is sign'd.\n    Of what is 't fools make such vain keeping?\n    Sin their conception, their birth weeping,\n    Their life a general mist of error,\n    Their death a hideous storm of terror.\n    Strew your hair with powders sweet,\n    Don clean linen, bathe your feet,\n    And (the foul fiend more to check)\n    A crucifix let bless your neck.\n    'Tis now full tide 'tween night and day;\n    End your groan, and come away.\n\n  CARIOLA.  Hence, villains, tyrants, murderers! Alas!\n  What will you do with my lady?--Call for help!\n\n  DUCHESS.  To whom?  To our next neighbours?  They are mad-folks.\n\n  BOSOLA.  Remove that noise.\n\n  DUCHESS.                     Farewell, Cariola.\n  In my last will I have not much to give:\n  A many hungry guests have fed upon me;\n  Thine will be a poor reversion.\n\n  CARIOLA.                         I will die with her.\n\n  DUCHESS.  I pray thee, look thou giv'st my little boy\n  Some syrup for his cold, and let the girl\n  Say her prayers ere she sleep.\n       [Cariola is forced out by the Executioners.]\n  Now what you please:\n  What death?\n\n  BOSOLA.       Strangling; here are your executioners.\n\n  DUCHESS.  I forgive them:\n  The apoplexy, catarrh, or cough o' th' lungs,\n  Would do as much as they do.\n\n  BOSOLA.  Doth not death fright you?\n\n  DUCHESS.                             Who would be afraid on 't,\n  Knowing to meet such excellent company\n  In th' other world?\n\n  BOSOLA.  Yet, methinks,\n  The manner of your death should much afflict you:\n  This cord should terrify you.\n\n  DUCHESS.                       Not a whit:\n  What would it pleasure me to have my throat cut\n  With diamonds? or to be smothered\n  With cassia? or to be shot to death with pearls?\n  I know death hath ten thousand several doors\n  For men to take their exits; and 'tis found\n  They go on such strange geometrical hinges,\n  You may open them both ways:  any way, for heaven-sake,\n  So I were out of your whispering.  Tell my brothers\n  That I perceive death, now I am well awake,\n  Best gift is they can give or I can take.\n  I would fain put off my last woman's-fault,\n  I 'd not be tedious to you.\n\n  FIRST EXECUTIONER.           We are ready.\n\n  DUCHESS.  Dispose my breath how please you; but my body\n  Bestow upon my women, will you?\n\n  FIRST EXECUTIONER.               Yes.\n\n  DUCHESS.  Pull, and pull strongly, for your able strength\n  Must pull down heaven upon me:--\n  Yet stay; heaven-gates are not so highly arch'd\n  As princes' palaces; they that enter there\n  Must go upon their knees [Kneels].--Come, violent death,\n  Serve for mandragora to make me sleep!--\n  Go tell my brothers, when I am laid out,\n  They then may feed in quiet.\n       They strangle her.\n\n  BOSOLA.  Where 's the waiting-woman??\n  Fetch her:  some other strangle the children.\n       [Enter CARIOLA]\n  Look you, there sleeps your mistress.\n\n  CARIOLA.                               O, you are damn'd\n  Perpetually for this!  My turn is next;\n  Is 't not so ordered?\n\n  BOSOLA.                Yes, and I am glad\n  You are so well prepar'd for 't.\n\n  CARIOLA.                          You are deceiv'd, sir,\n  I am not prepar'd for 't, I will not die;\n  I will first come to my answer,[118] and know\n  How I have offended.\n\n  BOSOLA.               Come, despatch her.--\n  You kept her counsel; now you shall keep ours.\n\n  CARIOLA.  I will not die, I must not; I am contracted\n  To a young gentleman.\n\n  FIRST EXECUTIONER.     Here 's your wedding-ring.\n\n  CARIOLA.  Let me but speak with the duke.  I 'll discover\n  Treason to his person.\n\n  BOSOLA.                 Delays:--throttle her.\n\n  FIRST EXECUTIONER.  She bites and scratches.\n\n  CARIOLA.                                      If you kill me now,\n  I am damn'd; I have not been at confession\n  This two years.\n\n  BOSOLA.  [To Executioners.] When?[119]\n\n  CARIOLA.                           I am quick with child.\n\n  BOSOLA.                                                    Why, then,\n  Your credit 's saved.\n       [Executioners strangle Cariola.]\n                         Bear her into the next room;\n  Let these lie still.\n       [Exeunt the Executioners with the body of CARIOLA.]\n\n       [Enter FERDINAND]\n\n  FERDINAND.            Is she dead?\n\n  BOSOLA.                             She is what\n  You 'd have her.  But here begin your pity:\n       Shows the Children strangled.\n  Alas, how have these offended?\n\n  FERDINAND.                      The death\n  Of young wolves is never to be pitied.\n\n  BOSOLA.  Fix your eye here.\n\n  FERDINAND.                   Constantly.\n\n  BOSOLA.                                   Do you not weep?\n  Other sins only speak; murder shrieks out.\n  The element of water moistens the earth,\n  But blood flies upwards and bedews the heavens.\n\n  FERDINAND.  Cover her face; mine eyes dazzle:  she died young.\n\n  BOSOLA.  I think not so; her infelicity\n  Seem'd to have years too many.\n\n  FERDINAND.  She and I were twins;\n  And should I die this instant, I had liv'd\n  Her time to a minute.\n\n  BOSOLA.                It seems she was born first:\n  You have bloodily approv'd the ancient truth,\n  That kindred commonly do worse agree\n  Than remote strangers.\n\n  FERDINAND.              Let me see her face\n  Again.  Why didst thou not pity her?  What\n  An excellent honest man mightst thou have been,\n  If thou hadst borne her to some sanctuary!\n  Or, bold in a good cause, oppos'd thyself,\n  With thy advanced sword above thy head,\n  Between her innocence and my revenge!\n  I bade thee, when I was distracted of my wits,\n  Go kill my dearest friend, and thou hast done 't.\n  For let me but examine well the cause:\n  What was the meanness of her match to me?\n  Only I must confess I had a hope,\n  Had she continu'd widow, to have gain'd\n  An infinite mass of treasure by her death:\n  And that was the main cause,--her marriage,\n  That drew a stream of gall quite through my heart.\n  For thee, as we observe in tragedies\n  That a good actor many times is curs'd\n  For playing a villain's part, I hate thee for 't,\n  And, for my sake, say, thou hast done much ill well.\n\n  BOSOLA.  Let me quicken your memory, for I perceive\n  You are falling into ingratitude:  I challenge\n  The reward due to my service.\n\n  FERDINAND.                     I 'll tell thee\n  What I 'll give thee.\n\n  BOSOLA.                Do.\n\n  FERDINAND.                  I 'll give thee a pardon\n  For this murder.\n\n  BOSOLA.           Ha!\n\n  FERDINAND.             Yes, and 'tis\n  The largest bounty I can study to do thee.\n  By what authority didst thou execute\n  This bloody sentence?\n\n  BOSOLA.                By yours.\n\n  FERDINAND.  Mine! was I her judge?\n  Did any ceremonial form of law\n  Doom her to not-being?  Did a complete jury\n  Deliver her conviction up i' the court?\n  Where shalt thou find this judgment register'd,\n  Unless in hell?  See, like a bloody fool,\n  Thou 'st forfeited thy life, and thou shalt die for 't.\n\n  BOSOLA.  The office of justice is perverted quite\n  When one thief hangs another.  Who shall dare\n  To reveal this?\n\n  FERDINAND.       O, I 'll tell thee;\n  The wolf shall find her grave, and scrape it up,\n  Not to devour the corpse, but to discover\n  The horrid murder.\n\n  BOSOLA.             You, not I, shall quake for 't.\n\n  FERDINAND.  Leave me.\n\n  BOSOLA.                I will first receive my pension.\n\n  FERDINAND.  You are a villain.\n\n  BOSOLA.                         When your ingratitude\n  Is judge, I am so.\n\n  FERDINAND.          O horror,\n  That not the fear of him which binds the devils\n  Can prescribe man obedience!--\n  Never look upon me more.\n\n  BOSOLA.                   Why, fare thee well.\n  Your brother and yourself are worthy men!\n  You have a pair of hearts are hollow graves,\n  Rotten, and rotting others; and your vengeance,\n  Like two chain'd-bullets, still goes arm in arm:\n  You may be brothers; for treason, like the plague,\n  Doth take much in a blood.  I stand like one\n  That long hath ta'en a sweet and golden dream:\n  I am angry with myself, now that I wake.\n\n  FERDINAND.  Get thee into some unknown part o' the world,\n  That I may never see thee.\n\n  BOSOLA.                     Let me know\n  Wherefore I should be thus neglected.  Sir,\n  I serv'd your tyranny, and rather strove\n  To satisfy yourself than all the world:\n  And though I loath'd the evil, yet I lov'd\n  You that did counsel it; and rather sought\n  To appear a true servant than an honest man.\n\n  FERDINAND.  I 'll go hunt the badger by owl-light:\n  'Tis a deed of darkness.\n       Exit.\n\n  BOSOLA.  He 's much distracted.  Off, my painted honour!\n  While with vain hopes our faculties we tire,\n  We seem to sweat in ice and freeze in fire.\n  What would I do, were this to do again?\n  I would not change my peace of conscience\n  For all the wealth of Europe.--She stirs; here 's life:--\n  Return, fair soul, from darkness, and lead mine\n  Out of this sensible hell:--she 's warm, she breathes:--\n  Upon thy pale lips I will melt my heart,\n  To store them with fresh colour.--Who 's there?\n  Some cordial drink!--Alas!  I dare not call:\n  So pity would destroy pity.--Her eye opes,\n  And heaven in it seems to ope, that late was shut,\n  To take me up to mercy.\n\n  DUCHESS.  Antonio!\n\n  BOSOLA.             Yes, madam, he is living;\n  The dead bodies you saw were but feign'd statues.\n  He 's reconcil'd to your brothers; the Pope hath wrought\n  The atonement.\n\n  DUCHESS.        Mercy!\n       Dies.\n\n  BOSOLA.  O, she 's gone again! there the cords of life broke.\n  O sacred innocence, that sweetly sleeps\n  On turtles' feathers, whilst a guilty conscience\n  Is a black register wherein is writ\n  All our good deeds and bad, a perspective\n  That shows us hell!  That we cannot be suffer'd\n  To do good when we have a mind to it!\n  This is manly sorrow;\n  These tears, I am very certain, never grew\n  In my mother's milk.  My estate is sunk\n  Below the degree of fear:  where were\n  These penitent fountains while she was living?\n  O, they were frozen up!  Here is a sight\n  As direful to my soul as is the sword\n  Unto a wretch hath slain his father.\n  Come, I 'll bear thee hence,\n  And execute thy last will; that 's deliver\n  Thy body to the reverend dispose\n  Of some good women:  that the cruel tyrant\n  Shall not deny me.  Then I 'll post to Milan,\n  Where somewhat I will speedily enact\n  Worth my dejection.\n       Exit [with the body].\n\n\n\n       Act V\n\n\n       Scene I[120]\n\n       [Enter] ANTONIO and DELIO\n\n  ANTONIO.  What think you of my hope of reconcilement\n  To the Arragonian brethren?\n\n  DELIO.                       I misdoubt it;\n  For though they have sent their letters of safe-conduct\n  For your repair to Milan, they appear\n  But nets to entrap you.  The Marquis of Pescara,\n  Under whom you hold certain land in cheat,[121]\n  Much 'gainst his noble nature hath been mov'd\n  To seize those lands; and some of his dependants\n  Are at this instant making it their suit\n  To be invested in your revenues.\n  I cannot think they mean well to your life\n  That do deprive you of your means of life,\n  Your living.\n\n  ANTONIO.      You are still an heretic[122]\n  To any safety I can shape myself.\n\n  DELIO.  Here comes the marquis:  I will make myself\n  Petitioner for some part of your land,\n  To know whither it is flying.\n\n  ANTONIO.                       I pray, do.\n       [Withdraws.]\n\n       [Enter PESCARA]\n  DELIO.  Sir, I have a suit to you.\n\n  PESCARA.                            To me?\n\n  DELIO.                                      An easy one:\n  There is the Citadel of Saint Bennet,\n  With some demesnes, of late in the possession\n  Of Antonio Bologna,--please you bestow them on me.\n\n  PESCARA.  You are my friend; but this is such a suit,\n  Nor fit for me to give, nor you to take.\n\n  DELIO.  No, sir?\n\n  PESCARA.          I will give you ample reason for 't\n  Soon in private:--here 's the cardinal's mistress.\n\n       [Enter JULIA]\n\n  JULIA.  My lord, I am grown your poor petitioner,\n  And should be an ill beggar, had I not\n  A great man's letter here, the cardinal's,\n  To court you in my favour.\n       [Gives a letter.]\n\n  PESCARA.                    He entreats for you\n  The Citadel of Saint Bennet, that belong'd\n  To the banish'd Bologna.\n\n  JULIA.                    Yes.\n\n  PESCARA.  I could not have thought of a friend I could rather\n  Pleasure with it:  'tis yours.\n\n  JULIA.                          Sir, I thank you;\n  And he shall know how doubly I am engag'd\n  Both in your gift, and speediness of giving\n  Which makes your grant the greater.\n       Exit.\n\n  ANTONIO.                             How they fortify\n  Themselves with my ruin!\n\n  DELIO.                    Sir, I am\n  Little bound to you.\n\n  PESCARA.              Why?\n\n  DELIO.  Because you deni'd this suit to me, and gave 't\n  To such a creature.\n\n  PESCARA.             Do you know what it was?\n  It was Antonio's land; not forfeited\n  By course of law, but ravish'd from his throat\n  By the cardinal's entreaty.  It were not fit\n  I should bestow so main a piece of wrong\n  Upon my friend; 'tis a gratification\n  Only due to a strumpet, for it is injustice.\n  Shall I sprinkle the pure blood of innocents\n  To make those followers I call my friends\n  Look ruddier upon me?  I am glad\n  This land, ta'en from the owner by such wrong,\n  Returns again unto so foul an use\n  As salary for his lust.  Learn, good Delio,\n  To ask noble things of me, and you shall find\n  I 'll be a noble giver.\n\n  DELIO.                   You instruct me well.\n\n  ANTONIO.  Why, here 's a man now would fright impudence\n  ]From sauciest beggars.\n\n  PESCARA.                Prince Ferdinand 's come to Milan,\n  Sick, as they give out, of an apoplexy;\n  But some say 'tis a frenzy:  I am going\n  To visit him.\n       Exit.\n\n  ANTONIO.       'Tis a noble old fellow.\n\n  DELIO.  What course do you mean to take, Antonio?\n\n  ANTONIO.  This night I mean to venture all my fortune,\n  Which is no more than a poor ling'ring life,\n  To the cardinal's worst of malice.  I have got\n  Private access to his chamber; and intend\n  To visit him about the mid of night,\n  As once his brother did our noble duchess.\n  It may be that the sudden apprehension\n  Of danger,--for I 'll go in mine own shape,--\n  When he shall see it fraight[123] with love and duty,\n  May draw the poison out of him, and work\n  A friendly reconcilement.  If it fail,\n  Yet it shall rid me of this infamous calling;\n  For better fall once than be ever falling.\n\n  DELIO.  I 'll second you in all danger; and howe'er,\n  My life keeps rank with yours.\n\n  ANTONIO.  You are still my lov'd and best friend.\n       Exeunt.\n\n\n       Scene II[124]\n\n       [Enter] PESCARA and DOCTOR\n\n  PESCARA.  Now, doctor, may I visit your patient?\n\n  DOCTOR.  If 't please your lordship; but he 's instantly\n  To take the air here in the gallery\n  By my direction.\n\n  PESCARA.          Pray thee, what 's his disease?\n\n  DOCTOR.  A very pestilent disease, my lord,\n  They call lycanthropia.\n\n  PESCARA.                 What 's that?\n  I need a dictionary to 't.\n\n  DOCTOR.                     I 'll tell you.\n  In those that are possess'd with 't there o'erflows\n  Such melancholy humour they imagine\n  Themselves to be transformed into wolves;\n  Steal forth to church-yards in the dead of night,\n  And dig dead bodies up:  as two nights since\n  One met the duke 'bout midnight in a lane\n  Behind Saint Mark's church, with the leg of a man\n  Upon his shoulder; and he howl'd fearfully;\n  Said he was a wolf, only the difference\n  Was, a wolf's skin was hairy on the outside,\n  His on the inside; bade them take their swords,\n  Rip up his flesh, and try.  Straight I was sent for,\n  And, having minister'd to him, found his grace\n  Very well recover'd.\n\n  PESCARA.  I am glad on 't.\n\n  DOCTOR.                     Yet not without some fear\n  Of a relapse.  If he grow to his fit again,\n  I 'll go a nearer way to work with him\n  Than ever Paracelsus dream'd of; if\n  They 'll give me leave, I 'll buffet his madness out of him.\n  Stand aside; he comes.\n\n       [Enter FERDINAND, CARDINAL, MALATESTI, and BOSOLA]\n\n  FERDINAND.  Leave me.\n\n  MALATESTI.  Why doth your lordship love this solitariness?\n\n  FERDINAND.  Eagles commonly fly alone:  they are crows, daws,\n  and starlings that flock together.  Look, what 's that follows me?\n\n  MALATESTI.  Nothing, my lord.\n\n  FERDINAND.  Yes.\n\n  MALATESTI.  'Tis your shadow.\n\n  FERDINAND.  Stay it; let it not haunt me.\n\n  MALATESTI.  Impossible, if you move, and the sun shine.\n\n  FERDINAND.  I will throttle it.\n       [Throws himself down on his shadow.]\n\n  MALATESTI.  O, my lord, you are angry with nothing.\n\n  FERDINAND.  You are a fool:  how is 't possible I should catch\n  my shadow, unless I fall upon 't?  When I go to hell, I mean\n  to carry a bribe; for, look you, good gifts evermore make way\n  for the worst persons.\n\n  PESCARA.  Rise, good my lord.\n\n  FERDINAND.  I am studying the art of patience.\n\n  PESCARA.  'Tis a noble virtue.\n\n  FERDINAND.  To drive six snails before me from this town to Moscow;\n  neither use goad nor whip to them, but let them take their own time;\n  --the patient'st man i' th' world match me for an experiment:--\n  an I 'll crawl after like a sheep-biter.[125]\n\n  CARDINAL.  Force him up.\n       [They raise him.]\n\n  FERDINAND.  Use me well, you were best.  What I have done, I have\n  done:  I 'll confess nothing.\n\n  DOCTOR.  Now let me come to him.--Are you mad, my lord? are you out\n  of your princely wits?\n\n  FERDINAND.              What 's he?\n\n  PESCARA.                             Your doctor.\n\n  FERDINAND.  Let me have his beard saw'd off, and his eye-brows\n  fil'd more civil.\n\n  DOCTOR.  I must do mad tricks with him, for that 's the only way\n  on 't.--I have brought your grace a salamander's skin to keep\n  you from sun-burning.\n\n  FERDINAND.  I have cruel sore eyes.\n\n  DOCTOR.  The white of a cockatrix's[126] egg is present remedy.\n\n  FERDINAND.  Let it be a new-laid one, you were best.\n  Hide me from him:  physicians are like kings,--\n  They brook no contradiction.\n\n  DOCTOR.  Now he begins to fear me:  now let me alone with him.\n\n  CARDINAL.  How now! put off your gown!\n\n  DOCTOR.  Let me have some forty urinals filled with rosewater:\n  he and I 'll go pelt one another with them.--Now he begins to fear\n  me.--Can you fetch a frisk,[127] sir?--Let him go, let him go, upon\n  my peril:  I find by his eye he stands in awe of me; I 'll make him\n  as tame as a dormouse.\n\n  FERDINAND.  Can you fetch your frisks, sir!--I will stamp him into\n  a cullis,[128] flay off his skin to cover one of the anatomies[129]\n  this rogue hath set i' th' cold yonder in Barber-Chirurgeon's-hall.\n  --Hence, hence! you are all of you like beasts for sacrifice.\n       [Throws the DOCTOR down and beats him.]\n  There 's nothing left of you but tongue and belly, flattery and\n  lechery.\n       [Exit.]\n\n  PESCARA.  Doctor, he did not fear you thoroughly.\n\n  DOCTOR.  True; I was somewhat too forward.\n\n  BOSOLA.  Mercy upon me, what a fatal judgment\n  Hath fall'n upon this Ferdinand!\n\n  PESCARA.                          Knows your grace\n  What accident hath brought unto the prince\n  This strange distraction?\n\n  CARDINAL.  [Aside.] I must feign somewhat.--Thus they say it grew.\n  You have heard it rumour'd, for these many years\n  None of our family dies but there is seen\n  The shape of an old woman, which is given\n  By tradition to us to have been murder'd\n  By her nephews for her riches.  Such a figure\n  One night, as the prince sat up late at 's book,\n  Appear'd to him; when crying out for help,\n  The gentleman of 's chamber found his grace\n  All on a cold sweat, alter'd much in face\n  And language:  since which apparition,\n  He hath grown worse and worse, and I much fear\n  He cannot live.\n\n  BOSOLA.          Sir, I would speak with you.\n\n  PESCARA.  We 'll leave your grace,\n  Wishing to the sick prince, our noble lord,\n  All health of mind and body.\n\n  CARDINAL.                     You are most welcome.\n       [Exeunt PESCARA, MALATESTI, and DOCTOR.]\n  Are you come? so.--[Aside.] This fellow must not know\n  By any means I had intelligence\n  In our duchess' death; for, though I counsell'd it,\n  The full of all th' engagement seem'd to grow\n  ]From Ferdinand.--Now, sir, how fares our sister?\n  I do not think but sorrow makes her look\n  Like to an oft-dy'd garment:  she shall now\n  Take comfort from me.  Why do you look so wildly?\n  O, the fortune of your master here the prince\n  Dejects you; but be you of happy comfort:\n  If you 'll do one thing for me I 'll entreat,\n  Though he had a cold tomb-stone o'er his bones,\n  I 'd make you what you would be.\n\n  BOSOLA.                           Any thing;\n  Give it me in a breath, and let me fly to 't.\n  They that think long small expedition win,\n  For musing much o' th' end cannot begin.\n\n       [Enter JULIA]\n\n  JULIA.  Sir, will you come into supper?\n\n  CARDINAL.                                I am busy; leave me[.]\n\n  JULIA [Aside.]  What an excellent shape hath that fellow!\n       Exit.\n\n  CARDINAL.  'Tis thus.  Antonio lurks here in Milan:\n  Inquire him out, and kill him.  While he lives,\n  Our sister cannot marry; and I have thought\n  Of an excellent match for her.  Do this, and style me\n  Thy advancement.\n\n  BOSOLA.  But by what means shall I find him out?\n\n  CARDINAL.  There is a gentleman call'd Delio\n  Here in the camp, that hath been long approv'd\n  His loyal friend.  Set eye upon that fellow;\n  Follow him to mass; may be Antonio,\n  Although he do account religion\n  But a school-name, for fashion of the world\n  May accompany him; or else go inquire out\n  Delio's confessor, and see if you can bribe\n  Him to reveal it.  There are a thousand ways\n  A man might find to trace him; as to know\n  What fellows haunt the Jews for taking up\n  Great sums of money, for sure he 's in want;\n  Or else to go to the picture-makers, and learn\n  Who bought[130] her picture lately:  some of these\n  Happily may take.\n\n  BOSOLA.            Well, I 'll not freeze i' th' business:\n  I would see that wretched thing, Antonio,\n  Above all sights i' th' world.\n\n  CARDINAL.                       Do, and be happy.\n       Exit.\n\n  BOSOLA.  This fellow doth breed basilisks in 's eyes,\n  He 's nothing else but murder; yet he seems\n  Not to have notice of the duchess' death.\n  'Tis his cunning:  I must follow his example;\n  There cannot be a surer way to trace\n  Than that of an old fox.\n\n       [Re-enter JULIA, with a pistol]\n\n  JULIA.  So, sir, you are well met.\n\n  BOSOLA.                             How Now!\n\n  JULIA.  Nay, the doors are fast enough:\n  Now, sir, I will make you confess your treachery.\n\n  BOSOLA.  Treachery!\n\n  JULIA.               Yes, confess to me\n  Which of my women 'twas you hir'd to put\n  Love-powder into my drink?\n\n  BOSOLA.  Love-powder!\n\n  JULIA.                 Yes, when I was at Malfi.\n  Why should I fall in love with such a face else?\n  I have already suffer'd for thee so much pain,\n  The only remedy to do me good\n  Is to kill my longing.\n\n  BOSOLA.                 Sure, your pistol holds\n  Nothing but perfumes or kissing-comfits.[131]\n  Excellent lady!\n  You have a pretty way on 't to discover\n  Your longing.  Come, come, I 'll disarm you,\n  And arm you thus:  yet this is wondrous strange.\n\n  JULIA.  Compare thy form and my eyes together,\n  You 'll find my love no such great miracle.\n  Now you 'll say\n  I am wanton:  this nice modesty in ladies\n  Is but a troublesome familiar\n  That haunts them.\n\n  BOSOLA.  Know you me, I am a blunt soldier.\n\n  JULIA.                                       The better:\n  Sure, there wants fire where there are no lively sparks\n  Of roughness.\n\n  BOSOLA.  And I want compliment.\n\n  JULIA.                           Why, ignorance\n  In courtship cannot make you do amiss,\n  If you have a heart to do well.\n\n  BOSOLA.                          You are very fair.\n\n  JULIA.  Nay, if you lay beauty to my charge,\n  I must plead unguilty.\n\n  BOSOLA.                 Your bright eyes\n  Carry a quiver of darts in them sharper\n  Than sun-beams.\n\n  JULIA.           You will mar me with commendation,\n  Put yourself to the charge of courting me,\n  Whereas now I woo you.\n\n  BOSOLA.  [Aside.] I have it, I will work upon this creature.--\n  Let us grow most amorously familiar:\n  If the great cardinal now should see me thus,\n  Would he not count me a villain?\n\n  JULIA.  No; he might count me a wanton,\n  Not lay a scruple of offence on you;\n  For if I see and steal a diamond,\n  The fault is not i' th' stone, but in me the thief\n  That purloins it.  I am sudden with you.\n  We that are great women of pleasure use to cut off\n  These uncertain wishes and unquiet longings,\n  And in an instant join the sweet delight\n  And the pretty excuse together.  Had you been i' th' street,\n  Under my chamber-window, even there\n  I should have courted you.\n\n  BOSOLA.  O, you are an excellent lady!\n\n  JULIA.  Bid me do somewhat for you presently\n  To express I love you.\n\n  BOSOLA.                 I will; and if you love me,\n  Fail not to effect it.\n  The cardinal is grown wondrous melancholy;\n  Demand the cause, let him not put you off\n  With feign'd excuse; discover the main ground on 't.\n\n  JULIA.  Why would you know this?\n\n  BOSOLA.                           I have depended on him,\n  And I hear that he is fall'n in some disgrace\n  With the emperor:  if he be, like the mice\n  That forsake falling houses, I would shift\n  To other dependance.\n\n  JULIA.                You shall not need\n  Follow the wars:  I 'll be your maintenance.\n\n  BOSOLA.  And I your loyal servant:  but I cannot\n  Leave my calling.\n\n  JULIA.             Not leave an ungrateful\n  General for the love of a sweet lady!\n  You are like some cannot sleep in feather-beds,\n  But must have blocks for their pillows.\n\n  BOSOLA.                                  Will you do this?\n\n  JULIA.  Cunningly.\n\n  BOSOLA.  To-morrow I 'll expect th' intelligence.\n\n  JULIA.  To-morrow! get you into my cabinet;\n  You shall have it with you.  Do not delay me,\n  No more than I do you:  I am like one\n  That is condemn'd; I have my pardon promis'd,\n  But I would see it seal'd.  Go, get you in:\n  You shall see my wind my tongue about his heart\n  Like a skein of silk.\n       [Exit BOSOLA.]\n\n       [Re-enter CARDINAL]\n\n  CARDINAL.              Where are you?\n\n       [Enter Servants.]\n\n  SERVANTS.                              Here.\n\n  CARDINAL.  Let none, upon your lives, have conference\n  With the Prince Ferdinand, unless I know it.--\n  [Aside] In this distraction he may reveal\n  The murder.\n       [Exeunt Servants.]\n               Yond 's my lingering consumption:\n  I am weary of her, and by any means\n  Would be quit of.\n\n  JULIA.             How now, my lord! what ails you?\n\n  CARDINAL.  Nothing.\n\n  JULIA.               O, you are much alter'd:\n  Come, I must be your secretary, and remove\n  This lead from off your bosom:  what 's the matter?\n\n  CARDINAL.  I may not tell you.\n\n  JULIA.  Are you so far in love with sorrow\n  You cannot part with part of it?  Or think you\n  I cannot love your grace when you are sad\n  As well as merry?  Or do you suspect\n  I, that have been a secret to your heart\n  These many winters, cannot be the same\n  Unto your tongue?\n\n  CARDINAL.          Satisfy thy longing,--\n  The only way to make thee keep my counsel\n  Is, not to tell thee.\n\n  JULIA.                 Tell your echo this,\n  Or flatterers, that like echoes still report\n  What they hear though most imperfect, and not me;\n  For if that you be true unto yourself,\n  I 'll know.\n\n  CARDINAL.     Will you rack me?\n\n  JULIA.                           No, judgment shall\n  Draw it from you:  it is an equal fault,\n  To tell one's secrets unto all or none.\n\n  CARDINAL.  The first argues folly.\n\n  JULIA.  But the last tyranny.\n\n  CARDINAL.  Very well:  why, imagine I have committed\n  Some secret deed which I desire the world\n  May never hear of.\n\n  JULIA.              Therefore may not I know it?\n  You have conceal'd for me as great a sin\n  As adultery.  Sir, never was occasion\n  For perfect trial of my constancy\n  Till now:  sir, I beseech you----\n\n  CARDINAL.                           You 'll repent it.\n\n  JULIA.  Never.\n\n  CARDINAL.  It hurries thee to ruin:  I 'll not tell thee.\n  Be well advis'd, and think what danger 'tis\n  To receive a prince's secrets.  They that do,\n  Had need have their breasts hoop'd with adamant\n  To contain them.  I pray thee, yet be satisfi'd;\n  Examine thine own frailty; 'tis more easy\n  To tie knots than unloose them.  'Tis a secret\n  That, like a ling'ring poison, may chance lie\n  Spread in thy veins, and kill thee seven year hence.\n\n  JULIA.  Now you dally with me.\n\n  CARDINAL.                       No more; thou shalt know it.\n  By my appointment the great Duchess of Malfi\n  And two of her young children, four nights since,\n  Were strangl'd.\n\n  JULIA.           O heaven! sir, what have you done!\n\n  CARDINAL.  How now?  How settles this?  Think you your bosom\n  Will be a grave dark and obscure enough\n  For such a secret?\n\n  JULIA.              You have undone yourself, sir.\n\n  CARDINAL.  Why?\n\n  JULIA.           It lies not in me to conceal it.\n\n  CARDINAL.                                          No?\n  Come, I will swear you to 't upon this book.\n\n  JULIA.  Most religiously.\n\n  CARDINAL.                  Kiss it.\n       [She kisses the book.]\n  Now you shall never utter it; thy curiosity\n  Hath undone thee; thou 'rt poison'd with that book.\n  Because I knew thou couldst not keep my counsel,\n  I have bound thee to 't by death.\n\n       [Re-enter BOSOLA]\n\n  BOSOLA.  For pity-sake, hold!\n\n  CARDINAL.                      Ha, Bosola!\n\n  JULIA.                                      I forgive you\n  This equal piece of justice you have done;\n  For I betray'd your counsel to that fellow.\n  He over-heard it; that was the cause I said\n  It lay not in me to conceal it.\n\n  BOSOLA.  O foolish woman,\n  Couldst not thou have poison'd him?\n\n  JULIA.                               'Tis weakness,\n  Too much to think what should have been done.  I go,\n  I know not whither.\n       [Dies.]\n\n  CARDINAL.            Wherefore com'st thou hither?\n\n  BOSOLA.  That I might find a great man like yourself,\n  Not out of his wits, as the Lord Ferdinand,\n  To remember my service.\n\n  CARDINAL.  I 'll have thee hew'd in pieces.\n\n  BOSOLA.  Make not yourself such a promise of that life\n  Which is not yours to dispose of.\n\n  CARDINAL.                          Who plac'd thee here?\n\n  BOSOLA.  Her lust, as she intended.\n\n  CARDINAL.                            Very well:\n  Now you know me for your fellow-murderer.\n\n  BOSOLA.  And wherefore should you lay fair marble colours\n  Upon your rotten purposes to me?\n  Unless you imitate some that do plot great treasons,\n  And when they have done, go hide themselves i' th' grave\n  Of those were actors in 't?\n\n  CARDINAL.                    No more; there is\n  A fortune attends thee.\n\n  BOSOLA.  Shall I go sue to Fortune any longer?\n  'Tis the fool's pilgrimage.\n\n  CARDINAL.  I have honours in store for thee.\n\n  BOSOLA.  There are a many ways that conduct to seeming\n  Honour, and some of them very dirty ones.\n\n  CARDINAL.  Throw to the devil\n  Thy melancholy.  The fire burns well;\n  What need we keep a stirring of 't, and make\n  A greater smother?[132] Thou wilt kill Antonio?\n\n  BOSOLA.  Yes.\n\n  CARDINAL.      Take up that body.\n\n  BOSOLA.                            I think I shall\n  Shortly grow the common bier for church-yards.\n\n  CARDINAL.  I will allow thee some dozen of attendants\n  To aid thee in the murder.\n\n  BOSOLA.  O, by no means.  Physicians that apply horse-leeches\n  to any rank swelling use to cut off their tails, that the blood\n  may run through them the faster:  let me have no train when I go\n  to shed blood, less it make me have a greater when I ride\n  to the gallows.\n\n  CARDINAL.  Come to me after midnight, to help to remove\n  That body to her own lodging.  I 'll give out\n  She died o' th' plague; 'twill breed the less inquiry\n  After her death.\n\n  BOSOLA.  Where 's Castruccio her husband?\n\n  CARDINAL.  He 's rode to Naples, to take possession\n  Of Antonio's citadel.\n\n  BOSOLA.  Believe me, you have done a very happy turn.\n\n  CARDINAL.  Fail not to come.  There is the master-key\n  Of our lodgings; and by that you may conceive\n  What trust I plant in you.\n\n  BOSOLA.                     You shall find me ready.\n       Exit CARDINAL.\n  O poor Antonio, though nothing be so needful\n  To thy estate as pity, yet I find\n  Nothing so dangerous!  I must look to my footing:\n  In such slippery ice-pavements men had need\n  To be frost-nail'd well, they may break their necks else;\n  The precedent 's here afore me.  How this man\n  Bears up in blood! seems fearless!  Why, 'tis well;\n  Security some men call the suburbs of hell,\n  Only a dead wall between.  Well, good Antonio,\n  I 'll seek thee out; and all my care shall be\n  To put thee into safety from the reach\n  Of these most cruel biters that have got\n  Some of thy blood already.  It may be,\n  I 'll join with thee in a most just revenge.\n  The weakest arm is strong enough that strikes\n  With the sword of justice.  Still methinks the duchess\n  Haunts me:  there, there!--'Tis nothing but my melancholy.\n  O Penitence, let me truly taste thy cup,\n  That throws men down only to raise them up!\n       Exit.\n\n\n       Scene III[133]\n\n       [Enter] ANTONIO and DELIO.  Echo (from the DUCHESS'S Grave)\n\n  DELIO.  Yond 's the cardinal's window.  This fortification\n  Grew from the ruins of an ancient abbey;\n  And to yond side o' th' river lies a wall,\n  Piece of a cloister, which in my opinion\n  Gives the best echo that you ever heard,\n  So hollow and so dismal, and withal\n  So plain in the distinction of our words,\n  That many have suppos'd it is a spirit\n  That answers.\n\n  ANTONIO.       I do love these ancient ruins.\n  We never tread upon them but we set\n  Our foot upon some reverend history;\n  And, questionless, here in this open court,\n  Which now lies naked to the injuries\n  Of stormy weather, some men lie interr'd\n  Lov'd the church so well, and gave so largely to 't,\n  They thought it should have canopied their bones\n  Till dooms-day.  But all things have their end;\n  Churches and cities, which have diseases like to men,\n  Must have like death that we have.\n\n  ECHO.                               Like death that we have.\n\n  DELIO.  Now the echo hath caught you.\n\n  ANTONIO.  It groan'd methought, and gave\n  A very deadly accent.\n\n  ECHO.                  Deadly accent.\n\n  DELIO.  I told you 'twas a pretty one.  You may make it\n  A huntsman, or a falconer, a musician,\n  Or a thing of sorrow.\n\n  ECHO.                  A thing of sorrow.\n\n  ANTONIO.  Ay, sure, that suits it best.\n\n  ECHO.                                    That suits it best.\n\n  ANTONIO.  'Tis very like my wife's voice.\n\n  ECHO.                                      Ay, wife's voice.\n\n  DELIO.  Come, let us walk further from t.\n  I would not have you go to the cardinal's to-night:\n  Do not.\n\n  ECHO.  Do not.\n\n  DELIO.  Wisdom doth not more moderate wasting sorrow\n  Than time.  Take time for 't; be mindful of thy safety.\n\n  ECHO.  Be mindful of thy safety.\n\n  ANTONIO.  Necessity compels me.\n  Make scrutiny through the passages\n  Of your own life, you 'll find it impossible\n  To fly your fate.\n\n  ECHO.              O, fly your fate!\n\n  DELIO.  Hark! the dead stones seem to have pity on you,\n  And give you good counsel.\n\n  ANTONIO.  Echo, I will not talk with thee,\n  For thou art a dead thing.\n\n  ECHO.                       Thou art a dead thing.\n\n  ANTONIO.  My duchess is asleep now,\n  And her little ones, I hope sweetly.  O heaven,\n  Shall I never see her more?\n\n  ECHO.                        Never see her more.\n\n  ANTONIO.  I mark'd not one repetition of the echo\n  But that; and on the sudden a clear light\n  Presented me a face folded in sorrow.\n\n  DELIO.  Your fancy merely.\n\n  ANTONIO.                    Come, I 'll be out of this ague,\n  For to live thus is not indeed to live;\n  It is a mockery and abuse of life.\n  I will not henceforth save myself by halves;\n  Lose all, or nothing.\n\n  DELIO.                 Your own virtue save you!\n  I 'll fetch your eldest son, and second you.\n  It may be that the sight of his own blood\n  Spread in so sweet a figure may beget\n  The more compassion.  However, fare you well.\n  Though in our miseries Fortune have a part,\n  Yet in our noble sufferings she hath none.\n  Contempt of pain, that we may call our own.\n       Exeunt.\n\n\n       Scene IV[134]\n\n       [Enter] CARDINAL, PESCARA, MALATESTI, RODERIGO, and GRISOLAN\n\n  CARDINAL.  You shall not watch to-night by the sick prince;\n  His grace is very well recover'd.\n\n  MALATESTI.  Good my lord, suffer us.\n\n  CARDINAL.                             O, by no means;\n  The noise, and change of object in his eye,\n  Doth more distract him.  I pray, all to bed;\n  And though you hear him in his violent fit,\n  Do not rise, I entreat you.\n\n  PESCARA.  So, sir; we shall not.\n\n  CARDINAL.                         Nay, I must have you promise\n  Upon your honours, for I was enjoin'd to 't\n  By himself; and he seem'd to urge it sensibly.\n\n  PESCARA.  Let our honours bind this trifle.\n\n  CARDINAL.  Nor any of your followers.\n\n  MALATESTI.  Neither.\n\n  CARDINAL.  It may be, to make trial of your promise,\n  When he 's asleep, myself will rise and feign\n  Some of his mad tricks, and cry out for help,\n  And feign myself in danger.\n\n  MALATESTI.  If your throat were cutting,\n  I 'd not come at you, now I have protested against it.\n\n  CARDINAL.  Why, I thank you.\n\n  GRISOLAN.                     'Twas a foul storm to-night.\n\n  RODERIGO.  The Lord Ferdinand's chamber shook like an osier.\n\n  MALATESTI.  'Twas nothing put pure kindness in the devil\n  To rock his own child.\n       Exeunt [all except the CARDINAL].\n\n  CARDINAL.  The reason why I would not suffer these\n  About my brother, is, because at midnight\n  I may with better privacy convey\n  Julia's body to her own lodging.  O, my conscience!\n  I would pray now; but the devil takes away my heart\n  For having any confidence in prayer.\n  About this hour I appointed Bosola\n  To fetch the body.  When he hath serv'd my turn,\n  He dies.\n       Exit.\n\n       [Enter BOSOLA]\n\n  BOSOLA.  Ha! 'twas the cardinal's voice; I heard him name\n  Bosola and my death.  Listen; I hear one's footing.\n\n       [Enter FERDINAND]\n\n  FERDINAND.  Strangling is a very quiet death.\n\n  BOSOLA.  [Aside.] Nay, then, I see I must stand upon my guard.\n\n  FERDINAND.  What say to that?  Whisper softly:  do you agree to 't?\n  So; it must be done i' th' dark; the cardinal would not for\n  a thousand pounds the doctor should see it.\n       Exit.\n\n  BOSOLA.  My death is plotted; here 's the consequence of murder.\n  We value not desert nor Christian breath,\n  When we know black deeds must be cur'd with death.\n\n       [Enter ANTONIO and Servant]\n\n  SERVANT.  Here stay, sir, and be confident, I pray;\n  I 'll fetch you a dark lantern.\n       Exit.\n\n  ANTONIO.  Could I take him at his prayers,\n  There were hope of pardon.\n\n  BOSOLA.  Fall right, my sword!--\n       [Stabs him.]\n  I 'll not give thee so much leisure as to pray.\n\n  ANTONIO.  O, I am gone!  Thou hast ended a long suit\n  In a minute.\n\n  BOSOLA.       What art thou?\n\n  ANTONIO.                      A most wretched thing,\n  That only have thy benefit in death,\n  To appear myself.\n\n       [Re-enter Servant with a lantern]\n\n  SERVANT.  Where are you, sir?\n\n  ANTONIO.  Very near my home.--Bosola!\n\n  SERVANT.  O, misfortune!\n\n  BOSOLA.  Smother thy pity, thou art dead else.--Antonio!\n  The man I would have sav'd 'bove mine own life!\n  We are merely the stars' tennis-balls, struck and banded\n  Which way please them.--O good Antonio,\n  I 'll whisper one thing in thy dying ear\n  Shall make thy heart break quickly!  Thy fair duchess\n  And two sweet children----\n\n  ANTONIO.                    Their very names\n  Kindle a little life in me.\n\n  BOSOLA.                      Are murder'd.\n\n  ANTONIO.  Some men have wish'd to die\n  At the hearing of sad tidings; I am glad\n  That I shall do 't in sadness.[135] I would not now\n  Wish my wounds balm'd nor heal'd, for I have no use\n  To put my life to.  In all our quest of greatness,\n  Like wanton boys whose pastime is their care,\n  We follow after bubbles blown in th' air.\n  Pleasure of life, what is 't?  Only the good hours\n  Of an ague; merely a preparative to rest,\n  To endure vexation.  I do not ask\n  The process of my death; only commend me\n  To Delio.\n\n  BOSOLA.     Break, heart!\n\n  ANTONIO.  And let my son fly the courts to princes.\n       [Dies.]\n\n  BOSOLA.  Thou seem'st to have lov'd Antonio.\n\n  SERVANT.  I brought him hither,\n  To have reconcil'd him to the cardinal.\n\n  BOSOLA.  I do not ask thee that.\n  Take him up, if thou tender thine own life,\n  And bear him where the lady Julia\n  Was wont to lodge.--O, my fate moves swift!\n  I have this cardinal in the forge already;\n  Now I 'll bring him to th' hammer.  O direful misprision![136]\n  I will not imitate things glorious.\n  No more than base; I 'll be mine own example.--\n  On, on, and look thou represent, for silence,\n  The thing thou bear'st.[137]\n       Exeunt.\n\n\n       Scene V[138]\n\n       [Enter] CARDINAL, with a book\n\n  CARDINAL.  I am puzzl'd in a question about hell;\n  He says, in hell there 's one material fire,\n  And yet it shall not burn all men alike.\n  Lay him by.  How tedious is a guilty conscience!\n  When I look into the fish-ponds in my garden,\n  Methinks I see a thing arm'd with a rake,\n  That seems to strike at me.\n       [Enter BOSOLA, and Servant bearing ANTONIO'S body]\n                               Now, art thou come?\n  Thou look'st ghastly;\n  There sits in thy face some great determination\n  Mix'd with some fear.\n\n  BOSOLA.                Thus it lightens into action:\n  I am come to kill thee.\n\n  CARDINAL.                Ha!--Help! our guard!\n\n  BOSOLA.  Thou art deceiv'd; they are out of thy howling.\n\n  CARDINAL.  Hold; and I will faithfully divide\n  Revenues with thee.\n\n  BOSOLA.              Thy prayers and proffers\n  Are both unseasonable.\n\n  CARDINAL.               Raise the watch!\n  We are betray'd!\n\n  BOSOLA.           I have confin'd your flight:\n  I 'll suffer your retreat to Julia's chamber,\n  But no further.\n\n  CARDINAL.        Help! we are betray'd!\n\n       [Enter, above, PESCARA, MALATESTI, RODERIGO, and GRISOLAN]\n\n  MALATESTI.  Listen.\n\n  CARDINAL.  My dukedom for rescue!\n\n  RODERIGO.  Fie upon his counterfeiting!\n\n  MALATESTI.  Why, 'tis not the cardinal.\n\n  RODERIGO.  Yes, yes, 'tis he:\n  But, I 'll see him hang'd ere I 'll go down to him.\n\n  CARDINAL.  Here 's a plot upon me; I am assaulted!  I am lost,\n  Unless some rescue!\n\n  GRISOLAN.            He doth this pretty well;\n  But it will not serve to laugh me out of mine honour.\n\n  CARDINAL.  The sword's at my throat!\n\n  RODERIGO.                             You would not bawl so loud then.\n\n  MALATESTI.\n  Come, come, let 's go to bed:  he told us this much aforehand.\n\n  PESCARA.  He wish'd you should not come at him; but, believe 't,\n  The accent of the voice sounds not in jest:\n  I 'll down to him, howsoever, and with engines\n  Force ope the doors.\n       [Exit above.]\n\n  RODERIGO.             Let 's follow him aloof,\n  And note how the cardinal will laugh at him.\n       [Exeunt, above, MALATESTI, RODERIGO, and GRISOLAN.]\n\n  BOSOLA.  There 's for you first,\n  'Cause you shall not unbarricade the door\n  To let in rescue.\n       Kills the Servant.\n\n  CARDINAL.  What cause hast thou to pursue my life?\n\n  BOSOLA.                                             Look there.\n\n  CARDINAL.  Antonio!\n\n  BOSOLA.              Slain by my hand unwittingly.\n  Pray, and be sudden.  When thou kill'd'st thy sister,\n  Thou took'st from Justice her most equal balance,\n  And left her naught but her sword.\n\n  CARDINAL.                           O, mercy!\n\n  BOSOLA.  Now it seems thy greatness was only outward;\n  For thou fall'st faster of thyself than calamity\n  Can drive thee.  I 'll not waste longer time; there!\n       [Stabs him.]\n\n  CARDINAL.  Thou hast hurt me.\n\n  BOSOLA.                        Again!\n\n  CARDINAL.                              Shall I die like a leveret,\n  Without any resistance?--Help, help, help!\n  I am slain!\n\n       [Enter FERDINAND]\n\n  FERDINAND.    Th' alarum!  Give me a fresh horse;\n  Rally the vaunt-guard, or the day is lost,\n  Yield, yield!  I give you the honour of arms\n  Shake my sword over you; will you yield?\n\n  CARDINAL.  Help me; I am your brother!\n\n  FERDINAND.                              The devil!\n  My brother fight upon the adverse party!\n       He wounds the CARDINAL, and, in the scuffle, gives BOSOLA\n       his death-wound.\n  There flies your ransom.\n\n  CARDINAL.  O justice!\n  I suffer now for what hath former bin:\n  Sorrow is held the eldest child of sin.\n\n  FERDINAND.  Now you 're brave fellows.  Caesar's fortune was harder\n  than Pompey's; Caesar died in the arms of prosperity, Pompey at the\n  feet of disgrace.  You both died in the field.  The pain 's nothing;\n  pain many times is taken away with the apprehension of greater,\n  as the tooth-ache with the sight of a barber that comes to pull\n  it out.  There 's philosophy for you.\n\n  BOSOLA.  Now my revenge is perfect.--Sink, thou main cause\n       Kills FERDINAND.\n  Of my undoing!--The last part of my life\n  Hath done me best service.\n\n  FERDINAND.  Give me some wet hay; I am broken-winded.\n  I do account this world but a dog-kennel:\n  I will vault credit and affect high pleasures\n  Beyond death.\n\n  BOSOLA.        He seems to come to himself,\n  Now he 's so near the bottom.\n\n  FERDINAND.  My sister, O my sister! there 's the cause on 't.\n  Whether we fall by ambition, blood, or lust,\n  Like diamonds, we are cut with our own dust.\n       [Dies.]\n\n  CARDINAL.  Thou hast thy payment too.\n\n  BOSOLA.  Yes, I hold my weary soul in my teeth;\n  'Tis ready to part from me.  I do glory\n  That thou, which stood'st like a huge pyramid\n  Begun upon a large and ample base,\n  Shalt end in a little point, a kind of nothing.\n\n       [Enter, below, PESCARA, MALATESTI, RODERIGO, and GRISOLAN]\n\n  PESCARA.  How now, my lord!\n\n  MALATESTI.                   O sad disaster!\n\n  RODERIGO.                                     How comes this?\n\n  BOSOLA.  Revenge for the Duchess of Malfi murdered\n  By the Arragonian brethren; for Antonio\n  Slain by this hand; for lustful Julia\n  Poison'd by this man; and lastly for myself,\n  That was an actor in the main of all\n  Much 'gainst mine own good nature, yet i' the end\n  Neglected.\n\n  PESCARA.    How now, my lord!\n\n  CARDINAL.                      Look to my brother:\n  He gave us these large wounds, as we were struggling\n  Here i' th' rushes.  And now, I pray, let me\n  Be laid by and never thought of.\n       [Dies.]\n\n  PESCARA.  How fatally, it seems, he did withstand\n  His own rescue!\n\n  MALATESTI.       Thou wretched thing of blood,\n  How came Antonio by his death?\n\n  BOSOLA.  In a mist; I know not how:\n  Such a mistake as I have often seen\n  In a play.  O, I am gone!\n  We are only like dead walls or vaulted graves,\n  That, ruin'd, yield no echo.  Fare you well.\n  It may be pain, but no harm, to me to die\n  In so good a quarrel.  O, this gloomy world!\n  In what a shadow, or deep pit of darkness,\n  Doth womanish and fearful mankind live!\n  Let worthy minds ne'er stagger in distrust\n  To suffer death or shame for what is just:\n  Mine is another voyage.\n       [Dies.]\n\n  PESCARA.  The noble Delio, as I came to th' palace,\n  Told me of Antonio's being here, and show'd me\n  A pretty gentleman, his son and heir.\n\n       [Enter DELIO, and ANTONIO'S Son]\n\n  MALATESTI.  O sir, you come too late!\n\n  DELIO.                                 I heard so, and\n  Was arm'd for 't, ere I came.  Let us make noble use\n  Of this great ruin; and join all our force\n  To establish this young hopeful gentleman\n  In 's mother's right.  These wretched eminent things\n  Leave no more fame behind 'em, than should one\n  Fall in a frost, and leave his print in snow;\n  As soon as the sun shines, it ever melts,\n  Both form and matter.  I have ever thought\n  Nature doth nothing so great for great men\n  As when she 's pleas'd to make them lords of truth:\n  Integrity of life is fame's best friend,\n  Which nobly, beyond death, shall crown the end.\n       Exeunt.\n\n\n\nFOOTNOTES:\n\n[Footnote 1: Malfi.  The presence-chamber in the palace of the Duchess.]\n\n[Footnote 2: Prevent.]\n\n[Footnote 3: The same.]\n\n[Footnote 4: The reference is to the knightly sport of riding at the ring.]\n\n[Footnote 5: At the expense of.]\n\n[Footnote 6: Rolls of lint used to dress wounds.]\n\n[Footnote 7: Surgeons.]\n\n[Footnote 8: A small horse.]\n\n[Footnote 9: Ballasted.]\n\n[Footnote 10: A lively dance.]\n\n[Footnote 11: Throws into the shade.]\n\n[Footnote 12: At the point of.]\n\n[Footnote 13: Coaches.]\n\n[Footnote 14: Spy.]\n\n[Footnote 15: Cheats.]\n\n[Footnote 16: Spy.]\n\n[Footnote 17: Malfi.  Gallery in the Duchess' palace.]\n\n[Footnote 18: Lustful.]\n\n[Footnote 19: Genesis xxxi., 31-42.]\n\n[Footnote 20: The net in which he caught Venus and Mars.]\n\n[Footnote 21: Housekeepers.]\n\n[Footnote 22: Produced.]\n\n[Footnote 23: Qq. read STRANGE.]\n\n[Footnote 24: Guess.]\n\n[Footnote 25: The phrase used to indicate that accounts had been examined\nand found correct.]\n\n[Footnote 26: Using words of present time; i.e., \"I take,\" not \"I will take.\"]\n\n[Footnote 27: Knot.]\n\n[Footnote 28: More firmly.]\n\n[Footnote 29: Of difficult disposition.]\n\n[Footnote 30: Malfi.  An apartment in the palace of the Duchess.]\n\n[Footnote 31: Chief part.]\n\n[Footnote 32: Bullies (Hazlitt); lawyers (Vaughan).]\n\n[Footnote 33: Royal journey.]\n\n[Footnote 34: Turning a boat on its side for repairs.]\n\n[Footnote 35: Scabbed.]\n\n[Footnote 36: Empty.]\n\n[Footnote 37: Face-modeling (Sampson).  \"There's a plain statement of your\npractises.\"]\n\n[Footnote 38: Blue like those of a woman with child.]\n\n[Footnote 39: Scurf.]\n\n[Footnote 40: Person of highest influence.]\n\n[Footnote 41: Hysteria.]\n\n[Footnote 42: This year.]\n\n[Footnote 43: Clearly.]\n\n[Footnote 44: Youngster.]\n\n[Footnote 45: A hall in the same palace.]\n\n[Footnote 46: Crossness.]\n\n[Footnote 47: Always.]\n\n[Footnote 48: The meaner servants.]\n\n[Footnote 49: At once.]\n\n[Footnote 50: Cast his horoscope.]\n\n[Footnote 51: The court of the same palace.]\n\n[Footnote 52: Making an astrological calculation.]\n\n[Footnote 53: Going to the root of the matter.]\n\n[Footnote 54: Write.]\n\n[Footnote 55: i.e., on his handkerchief.]\n\n[Footnote 56: Addressing the lantern.]\n\n[Footnote 57: \"The rest not considered.\"]\n\n[Footnote 58: A piece of news.]\n\n[Footnote 59: Cleverly contrived.]\n\n[Footnote 60: Rome.  An apartment in the palace of the Cardinal.]\n\n[Footnote 61: Religious recluse.]\n\n[Footnote 62: Experienced.]\n\n[Footnote 63: Sick.]\n\n[Footnote 64: Medicinal.]\n\n[Footnote 65: Strong broth.]\n\n[Footnote 66: Another apartment in the same palace.]\n\n[Footnote 67: The mandrake was supposed to give forth shrieks when uprooted,\nwhich drove the hearer mad.]\n\n[Footnote 68: Unchaste.]\n\n[Footnote 69: Supposed to be a sign of folly.]\n\n[Footnote 70: Throw the hammer.]\n\n[Footnote 71: Boil to shreds.  (Dyce.) Qq, TO BOIL.]\n\n[Footnote 72: Malfi.  An apartment in the palace of the Duchess.]\n\n[Footnote 73: Wealth.]\n\n[Footnote 74: Lampoons.]\n\n[Footnote 75: Plowshares.]\n\n[Footnote 76: Spying.]\n\n[Footnote 77: Deceptions.]\n\n[Footnote 78: Soothing.]\n\n[Footnote 79: The bed-chamber of the Duchess in the same.]\n\n[Footnote 80: Qq. read SLIGHT.]\n\n[Footnote 81: Powder of orris-root.]\n\n[Footnote 82: Wheels of craft.]\n\n[Footnote 83: Certificate that the books were found correct.]\n\n[Footnote 84: The badge of a steward.]\n\n[Footnote 85: Spies.]\n\n[Footnote 86: Lot.]\n\n[Footnote 87: For Plutus.]\n\n[Footnote 88: Quick steps.]\n\n[Footnote 89: Miss.]\n\n[Footnote 90: Remains.]\n\n[Footnote 91: Profession.]\n\n[Footnote 92: An apartment in the Cardinal's palace at Rome.]\n\n[Footnote 93: A decorated horse-cloth, used only when the court is traveling.]\n\n[Footnote 94: The first quarto has in the margin:  \"The Author disclaims\nthis Ditty to be his.\"]\n\n[Footnote 95: Near Loretto.]\n\n[Footnote 96: Small birds.]\n\n[Footnote 97: His vizard.]\n\n[Footnote 98: Malfi.  An apartment in the palace of the Duchess.]\n\n[Footnote 99: Curtain.]\n\n[Footnote 100: The wife of Brutus, who died by swallowing fire.]\n\n[Footnote 101: By artificial means.]\n\n[Footnote 102: Profession.]\n\n[Footnote 103: Spying.]\n\n[Footnote 104: Another room in the lodging of the Duchess.]\n\n[Footnote 105: Band.]\n\n[Footnote 106: Bands.]\n\n[Footnote 107: Boil.]\n\n[Footnote 108: Punning on the two senses of \"dye\" and \"corn.\"]\n\n[Footnote 109: From exporting his grain.]\n\n[Footnote 110: Optical glass.]\n\n[Footnote 111: The Geneva Bible.]\n\n[Footnote 112: Petticoat.]\n\n[Footnote 113: Coach.]\n\n[Footnote 114: A warm drink containing milk, wine, etc.]\n\n[Footnote 115: Receptacle.]\n\n[Footnote 116: A drug supposed to ooze from embalmed bodies.]\n\n[Footnote 117: Curdled.]\n\n[Footnote 118: Trial.]\n\n[Footnote 119: An exclamation of impatience.]\n\n[Footnote 120: Milan.  A public place.]\n\n[Footnote 121: In escheat; here, in fee.]\n\n[Footnote 122: Disbeliever.]\n\n[Footnote 123: Fraught.]\n\n[Footnote 124: A gallery in the residence of the Cardinal and Ferdinand.]\n\n[Footnote 125: A dog which worries sheep.]\n\n[Footnote 126: A fabulous serpent that killed by its glance.]\n\n[Footnote 127: Cut a caper.]\n\n[Footnote 128: Broth.]\n\n[Footnote 129: Skeletons.]\n\n[Footnote 130: So Dyce.  Qq. BROUGHT.]\n\n[Footnote 131: Perfumed sweetmeats for the breath.]\n\n[Footnote 132: Smoke.]\n\n[Footnote 133: A fortification.]\n\n[Footnote 134: Milan.  An apartment in the residence of the Cardinal\nand Ferdinand.]\n\n[Footnote 135: Reality.]\n\n[Footnote 136: Mistake.]\n\n[Footnote 137: i.e., the dead body.]\n\n[Footnote 138: Another apartment in the same.\n\n\n\nEND OF PLAY\n\n\nTranscriber's Note:\n\nComments on the preparation of this e-text:\n\nAll of the footnotes have been re-numbered, in the form [xxx].\n\nA few punctuation marks have been added.  These are always set\noff by angle brackets.  Eg. [?]\n\nThe names of the characters have been spelled out in full.\nEg. CARDINAL was CARD.\n\nLeading blanks are reproduced from the printed text.  Eg.:\n\nFERDINAND.  Sister, I have a suit to you.\nDUCHESS.                                   To me, sir?", "title": "The Duchess of Malfi"}