{"summary": "\nThe play opens with Roderigo, a rich and dissolute gentleman, complaining to Iago, an ensign, that Iago has not told him about the secret marriage between Desdemona, the daughter of a Senator named Brabantio, and Othello, a Moorish general in the Venetian army. He is upset by this development because he loves Desdemona and had asked her father for her hand in marriage. Iago hates Othello for promoting a younger man named Michael Cassio above him, and tells Roderigo that he plans to use Othello for his own advantage. Iago is also angry because he believes, or at least gives the pretence of belief, that Othello slept with his wife Emilia. Iago denounces Cassio as a scholarly tactician with no real battle experience; in contrast, Iago is a battle-tested soldier. By emphasising Roderigo's failed bid for Desdemona, and his own dissatisfaction with serving under Othello, Iago convinces Roderigo to wake Brabantio, Desdemona's father, and tell him about his daughter's elopement. Iago sneaks away to find Othello and warns him that Brabantio is coming for him.\nBrabantio, provoked by Roderigo, is enraged and will not rest until he has beheaded Othello, but even before Brabantio reaches Othello news arrives in Venice that the Turks are going to attack Cyprus; therefore Othello is summoned to advise the senators. When Brabantio arrives at Othello's residence, he is met by the messengers and guards of the Duke who keep him away from Othello. The Senator has no option but to accompany Othello to the Duke's residence, where he accuses Othello of seducing Desdemona by witchcraft, but Othello defends himself before an assembly that includes the Duke of Venice, Brabantio's kinsmen Lodovico and Gratiano, and various senators.\nOthello explains that Desdemona became enamoured of him for the sad and compelling stories he told of his life before Venice, not because of any witchcraft. The senate is satisfied, once Desdemona confirms that she loves Othello and even declares that she will accompany him wherever he goes: \"That I did love the Moor to live with him,\" but Brabantio leaves saying that Desdemona will betray Othello: \"Look to her, Moor, if thou hast eyes to see:/She has deceived her father, and may thee.\" By order of the Duke, Othello leaves Venice to command the Venetian armies against invading Turks on the island of Cyprus, accompanied by his new wife, his new lieutenant Cassio, his ensign Iago, and Iago's wife, Emilia as Desdemona's attendant.\nThe party arrives in Cyprus to find that a storm has destroyed the Turkish fleet. Othello orders a general celebration and leaves to spend private time with Desdemona. In his absence, Iago schemes to get Cassio drunk, after Cassio's own admission that he cannot hold his wine. He then persuades Roderigo to draw Cassio into a fight. The resulting brawl alarms the citizenry, and Othello is forced to quell the disturbance. Othello blames Cassio for the disturbance and strips him of his rank. Cassio is distraught, but, as part of his plan to convince Othello that Cassio and Desdemona are having an affair, Iago persuades Cassio to importune Desdemona to act as an intermediary between himself and Othello, in order to convince her husband to reinstate him.\nIago now persuades Othello to be suspicious of Cassio and Desdemona. Othello drops a handkerchief (with which Desdemona was trying to bind his headache) that was Othello's first gift to Desdemona and which he has stated holds great significance to him in the context of their relationship. Emilia finds it, and gives it to Iago, at his request, unaware of what he plans to do with the handkerchief. Iago plants it in Cassio's lodgings as evidence of Cassio and Desdemona's affair. After he has planted the handkerchief, Iago tells Othello to stand apart and watch Cassio's reactions while Iago questions him about the handkerchief. Iago goads Cassio on to talk about his affair with Bianca, a local courtesan with whom Cassio has been spending time, but speaks her name so quietly that Othello believes the two men are talking about Desdemona. Bianca, on discovering the handkerchief, chastises Cassio, accusing him of giving her a second-hand gift which he received from another lover. Othello sees this, and Iago convinces him that Cassio has received the handkerchief from Desdemona. Enraged and hurt, Othello resolves to kill his wife and asks Iago to kill Cassio. Othello proceeds to make Desdemona's life miserable, hitting her in front of visiting Venetian nobles.\nRoderigo complains that he has received nothing from Iago in return for his money and efforts to win Desdemona, but Iago convinces him to kill Cassio. Roderigo attacks Cassio in the street after Cassio leaves Bianca's lodgings. They fight, and Cassio wounds Roderigo. During the scuffle, Iago comes from behind Cassio and badly cuts his leg. In the darkness, Iago manages to hide his identity, and when Lodovico and Gratiano hear Cassio's cries for help, Iago joins them, pretending to help Cassio. When Cassio identifies Roderigo as one of his attackers, Iago quietly stabs Roderigo to stop him from revealing the plot. He then accuses Bianca of the failed conspiracy to kill Cassio.\n\nIn the night, Othello confronts Desdemona, and then smothers her to death in their bed. When Emilia arrives, Othello tries to justify his actions by accusing Desdemona of adultery. Emilia calls for help. The former governor Montano arrives, with Gratiano and Iago, and Emilia begins to explain the situation. When Othello mentions the handkerchief as proof, Emilia realizes what Iago has done, and she exposes him, whereupon Iago kills her. Othello, belatedly realising Desdemona's innocence, stabs Iago but not fatally, saying that he would rather have Iago live the rest of his life in pain. For his part, Iago refuses to explain his motives, vowing to remain silent from that moment on. Lodovico, a Venetian nobleman, apprehends both Iago and Othello for the murders, but Othello commits suicide with a dagger he has hidden. Lodovico then declares Gratiano to be Othello's successor and exhorts Cassio to have Iago justly punished.\n\n", "full_text": "Project Gutenberg's Etext of Shakespeare's The Tragedie of Othello,\nthe Moore of Venice\n\n\n\n\nExecutive Director's Notes:\n\nIn addition to the notes below, and so you will *NOT* think all\nthe spelling errors introduced by the printers of the time have\nbeen corrected, here are the first few lines of Hamlet, as they\nare presented herein:\n\n  Barnardo. Who's there?\n  Fran. Nay answer me: Stand & vnfold\nyour selfe\n\n   Bar. Long liue the King\n\n***\n\nAs I understand it, the printers often ran out of certain words\nor letters they had often packed into a \"cliche\". . .this is the\noriginal meaning of the term cliche. . .and thus, being unwilling\nto unpack the cliches, and thus you will see some substitutions\nthat look very odd. . .such as the exchanges of u for v, v for u,\nabove. . .and you may wonder why they did it this way, presuming\nShakespeare did not actually write the play in this manner. . . .\n\nThe answer is that they MAY have packed \"liue\" into a cliche at a\ntime when they were out of \"v\"'s. . .possibly having used \"vv\" in\nplace of some \"w\"'s, etc.  This was a common practice of the day,\nas print was still quite expensive, and they didn't want to spend\nmore on a wider selection of characters than they had to.\n\nYou will find a lot of these kinds of \"errors\" in this text, as I\nhave mentioned in other times and places, many \"scholars\" have an\nextreme attachment to these errors, and many have accorded them a\nvery high place in the \"canon\" of Shakespeare.  My father read an\nassortment of these made available to him by Cambridge University\nin England for several months in a glass room constructed for the\npurpose.  To the best of my knowledge he read ALL those available\n. . .in great detail. . .and determined from the various changes,\nthat Shakespeare most likely did not write in nearly as many of a\nvariety of errors we credit him for, even though he was in/famous\nfor signing his name with several different spellings.\n\nSo, please take this into account when reading the comments below\nmade by our volunteer who prepared this file:  you may see errors\nthat are \"not\" errors. . . .\n\nSo. . .with this caveat. . .we have NOT changed the canon errors,\nhere is the Project Gutenberg Etext of Shakespeare's The Tragedie\nof Othello, the Moore of Venice.\n\nMichael S. Hart\nProject Gutenberg\nExecutive Director\n\n\n***\n\n\nScanner's Notes: What this is and isn't.  This was taken from\na copy of Shakespeare's first folio and it is as close as I can\ncome in ASCII to the printed text.\n\nThe elongated S's have been changed to small s's and the\nconjoined ae have been changed to ae.  I have left the spelling,\npunctuation, capitalization as close as possible to the\nprinted text.  I have corrected some spelling mistakes (I have put\ntogether a spelling dictionary devised from the spellings of the\nGeneva Bible and Shakespeare's First Folio and have unified\nspellings according to this template), typo's and expanded\nabbreviations as I have come across them.  Everything within\nbrackets [] is what I have added.  So if you don't like that\nyou can delete everything within the brackets if you want a\npurer Shakespeare.\n\nAnother thing that you should be aware of is that there are textual\ndifferences between various copies of the first folio.  So there may\nbe differences (other than what I have mentioned above) between\nthis and other first folio editions.  This is due to the printer's\nhabit of setting the type and running off a number of copies and\nthen proofing the printed copy and correcting the type and then\ncontinuing the printing run.  The proof run wasn't thrown away but\nincorporated into the printed copies.  This is just the way it is.\nThe text I have used was a composite of more than 30 different\nFirst Folio editions' best pages.\n\nIf you find any scanning errors, out and out typos, punctuation\nerrors, or if you disagree with my spelling choices please feel\nfree to email me those errors.  I wish to make this the best\netext possible.  My email address for right now are haradda@aol.com\nand davidr@inconnect.com.  I hope that you enjoy this.\n\nDavid Reed\n\nThe Tragedie of Othello, the Moore of Venice\n\nActus Primus. Scoena Prima.\n\nEnter Rodorigo, and Iago.\n\n  Rodorigo. Neuer tell me, I take it much vnkindly\nThat thou (Iago) who hast had my purse,\nAs if y strings were thine, should'st know of this\n\n   Ia. But you'l not heare me. If euer I did dream\nOf such a matter, abhorre me\n\n   Rodo. Thou told'st me,\nThou did'st hold him in thy hate\n\n   Iago. Despise me\nIf I do not. Three Great-ones of the Cittie,\n(In personall suite to make me his Lieutenant)\nOff-capt to him: and by the faith of man\nI know my price, I am worth no worsse a place.\nBut he (as louing his owne pride, and purposes)\nEuades them, with a bumbast Circumstance,\nHorribly stufft with Epithites of warre,\nNon-suites my Mediators. For certes, saies he,\nI haue already chose my Officer. And what was he?\nFor-sooth, a great Arithmatician,\nOne Michaell Cassio, a Florentine,\n(A Fellow almost damn'd in a faire Wife)\nThat neuer set a Squadron in the Field,\nNor the deuision of a Battaile knowes\nMore then a Spinster. Vnlesse the Bookish Theoricke:\nWherein the Tongued Consuls can propose\nAs Masterly as he. Meere pratle (without practise)\nIs all his Souldiership. But he (Sir) had th' election;\nAnd I (of whom his eies had seene the proofe\nAt Rhodes, at Ciprus, and on others grounds\nChristen'd, and Heathen) must be be-leed, and calm'd\nBy Debitor, and Creditor. This Counter-caster,\nHe (in good time) must his Lieutenant be,\nAnd I (blesse the marke) his Mooreships Auntient\n\n   Rod. By heauen, I rather would haue bin his hangman\n\n   Iago. Why, there's no remedie.\n'Tis the cursse of Seruice;\nPreferment goes by Letter, and affection,\nAnd not by old gradation, where each second\nStood Heire to'th' first. Now Sir, be iudge your selfe,\nWhether I in any iust terme am Affin'd\nTo loue the Moore?\n  Rod. I would not follow him then\n\n   Iago. O Sir content you.\nI follow him, to serue my turne vpon him.\nWe cannot all be Masters, nor all Masters\nCannot be truely follow'd. You shall marke\nMany a dutious and knee-crooking knaue;\nThat (doting on his owne obsequious bondage)\nWeares out his time, much like his Masters Asse,\nFor naught but Prouender, & when he's old Casheer'd.\nWhip me such honest knaues. Others there are\nWho trym'd in Formes, and visages of Dutie,\nKeepe yet their hearts attending on themselues,\nAnd throwing but showes of Seruice on their Lords\nDoe well thriue by them.\nAnd when they haue lin'd their Coates\nDoe themselues Homage.\nThese Fellowes haue some soule,\nAnd such a one do I professe my selfe. For (Sir)\nIt is as sure as you are Rodorigo,\nWere I the Moore, I would not be Iago:\nIn following him, I follow but my selfe.\nHeauen is my Iudge, not I for loue and dutie,\nBut seeming so, for my peculiar end:\nFor when my outward Action doth demonstrate\nThe natiue act, and figure of my heart\nIn Complement externe, 'tis not long after\nBut I will weare my heart vpon my sleeue\nFor Dawes to pecke at; I am not what I am\n\n   Rod. What a fall Fortune do's the Thicks-lips owe\nIf he can carry't thus?\n  Iago. Call vp her Father:\nRowse him, make after him, poyson his delight,\nProclaime him in the Streets. Incense her kinsmen,\nAnd though he in a fertile Clymate dwell,\nPlague him with Flies: though that his Ioy be Ioy,\nYet throw such chances of vexation on't,\nAs it may loose some colour\n\n   Rodo. Heere is her Fathers house, Ile call aloud\n\n   Iago. Doe, with like timerous accent, and dire yell,\nAs when (by Night and Negligence) the Fire\nIs spied in populus Citties\n\n   Rodo. What hoa: Brabantio, Signior Brabantio, hoa\n\n   Iago. Awake: what hoa, Brabantio: Theeues, Theeues.\nLooke to your house, your daughter, and your Bags,\nTheeues, Theeues\n\n   Bra. Aboue. What is the reason of this terrible\nSummons? What is the matter there?\n  Rodo. Signior is all your Familie within?\n  Iago. Are your Doores lock'd?\n  Bra. Why? Wherefore ask you this?\n  Iago. Sir, y'are rob'd, for shame put on your Gowne,\nYour heart is burst, you haue lost halfe your soule\nEuen now, now, very now, an old blacke Ram\nIs tupping your white Ewe. Arise, arise,\nAwake the snorting Cittizens with the Bell,\nOr else the deuill will make a Grand-sire of you.\nArise I say\n\n   Bra. What, haue you lost your wits?\n  Rod. Most reuerend Signior, do you know my voice?\n  Bra. Not I: what are you?\n  Rod. My name is Rodorigo\n\n   Bra. The worsser welcome:\nI haue charg'd thee not to haunt about my doores:\nIn honest plainenesse thou hast heard me say,\nMy Daughter is not for thee. And now in madnesse\n(Being full of Supper, and distempring draughtes)\nVpon malitious knauerie, dost thou come\nTo start my quiet\n\n   Rod. Sir, Sir, Sir\n\n   Bra. But thou must needs be sure,\nMy spirits and my place haue in their power\nTo make this bitter to thee\n\n   Rodo. Patience good Sir\n\n   Bra. What tell'st thou me of Robbing?\nThis is Venice: my house is not a Grange\n\n   Rodo. Most graue Brabantio,\nIn simple and pure soule, I come to you\n\n   Ia. Sir: you are one of those that will not serue God,\nif the deuill bid you. Because we come to do you seruice,\nand you thinke we are Ruffians, you'le haue your Daughter\ncouer'd with a Barbary horse, you'le haue your Nephewes\nneigh to you, you'le haue Coursers for Cozens:\nand Gennets for Germaines\n\n   Bra. What prophane wretch art thou?\n  Ia. I am one Sir, that comes to tell you, your Daughter\nand the Moore, are making the Beast with two backs\n\n   Bra. Thou art a Villaine\n\n   Iago. You are a Senator\n\n   Bra. This thou shalt answere. I know thee Rodorigo\n\n   Rod. Sir, I will answere any thing. But I beseech you\nIf't be your pleasure, and most wise consent,\n(As partly I find it is) that your faire Daughter,\nAt this odde Euen and dull watch o'th' night\nTransported with no worse nor better guard,\nBut with a knaue of common hire, a Gundelier,\nTo the grosse claspes of a Lasciuious Moore:\nIf this be knowne to you, and your Allowance,\nWe then haue done you bold, and saucie wrongs.\nBut if you know not this, my Manners tell me,\nWe haue your wrong rebuke. Do not beleeue\nThat from the sence of all Ciuilitie,\nI thus would play and trifle with your Reuerence.\nYour Daughter (if you haue not giuen her leaue)\nI say againe, hath made a grosse reuolt,\nTying her Dutie, Beautie, Wit, and Fortunes\nIn an extrauagant, and wheeling Stranger,\nOf here, and euery where: straight satisfie your selfe.\nIf she be in her Chamber, or your house,\nLet loose on me the Iustice of the State\nFor thus deluding you\n\n   Bra. Strike on the Tinder, hoa:\nGiue me a Taper: call vp all my people,\nThis Accident is not vnlike my dreame,\nBeleefe of it oppresses me alreadie.\nLight, I say, light.\nEnter.\n\n  Iag. Farewell: for I must leaue you.\nIt seemes not meete, nor wholesome to my place\nTo be producted, (as if I stay, I shall,)\nAgainst the Moore. For I do know the State,\n(How euer this may gall him with some checke)\nCannot with safetie cast-him. For he's embark'd\nWith such loud reason to the Cyprus Warres,\n(Which euen now stands in Act) that for their soules\nAnother of his Fadome, they haue none,\nTo lead their Businesse. In which regard,\nThough I do hate him as I do hell paines,\nYet, for necessitie of present life,\nI must show out a Flag, and signe of Loue,\n(Which is indeed but signe) that you shal surely find him\nLead to the Sagitary the raised Search:\nAnd there will I be with him. So farewell.\n\nEnter.\n\nEnter Brabantio, with Seruants and Torches.\n\n  Bra. It is too true an euill. Gone she is,\nAnd what's to come of my despised time,\nIs naught but bitternesse. Now Rodorigo,\nWhere didst thou see her? (Oh vnhappie Girle)\nWith the Moore saist thou? (Who would be a Father?)\nHow didst thou know 'twas she? (Oh she deceaues me\nPast thought:) what said she to you? Get moe Tapers.\nRaise all my Kindred. Are they married thinke you?\n  Rodo. Truely I thinke they are\n\n   Bra. Oh Heauen: how got she out?\nOh treason of the blood.\nFathers, from hence trust not your Daughters minds\nBy what you see them act. Is there not Charmes,\nBy which the propertie of Youth, and Maidhood\nMay be abus'd? Haue you not read Rodorigo,\nOf some such thing?\n  Rod. Yes Sir: I haue indeed\n\n   Bra. Call vp my Brother: oh would you had had her.\nSome one way, some another. Doe you know\nWhere we may apprehend her, and the Moore?\n  Rod. I thinke I can discouer him, if you please\nTo get good Guard, and go along with me\n\n   Bra. Pray you lead on. At euery house Ile call,\n(I may command at most) get Weapons (hoa)\nAnd raise some speciall Officers of might:\nOn good Rodorigo, I will deserue your paines.\n\nExeunt.\n\n\nScena Secunda.\n\nEnter Othello, Iago, Attendants, with Torches.\n\n  Ia. Though in the trade of Warre I haue slaine men,\nYet do I hold it very stuffe o'th' conscience\nTo do no contriu'd Murder: I lacke Iniquitie\nSometime to do me seruice. Nine, or ten times\nI had thought t'haue yerk'd him here vnder the Ribbes\n\n   Othello. 'Tis better as it is\n\n   Iago. Nay but he prated,\nAnd spoke such scuruy, and prouoking termes\nAgainst your Honor, that with the little godlinesse I haue\nI did full hard forbeare him. But I pray you Sir,\nAre you fast married? Be assur'd of this,\nThat the Magnifico is much belou'd,\nAnd hath in his effect a voice potentiall\nAs double as the Dukes: He will diuorce you.\nOr put vpon you, what restraint or greeuance,\nThe Law (with all his might, to enforce it on)\nWill giue him Cable\n\n   Othel. Let him do his spight;\nMy Seruices, which I haue done the Signorie\nShall out-tongue his Complaints. 'Tis yet to know,\nWhich when I know, that boasting is an Honour,\nI shall promulgate. I fetch my life and being,\nFrom Men of Royall Seige. And my demerites\nMay speake (vnbonnetted) to as proud a Fortune\nAs this that I haue reach'd. For know Iago,\nBut that I loue the gentle Desdemona,\nI would not my vnhoused free condition\nPut into Circumscription, and Confine,\nFor the Seas worth. But looke, what Lights come yond?\n\nEnter Cassio, with Torches.\n\n  Iago. Those are the raised Father, and his Friends:\nYou were best go in\n\n   Othel. Not I: I must be found.\nMy Parts, my Title, and my perfect Soule\nShall manifest me rightly. Is it they?\n  Iago. By Ianus, I thinke no\n\n   Othel. The Seruants of the Dukes?\nAnd my Lieutenant?\nThe goodnesse of the Night vpon you (Friends)\nWhat is the Newes?\n  Cassio. The Duke do's greet you (Generall)\nAnd he requires your haste, Post-haste appearance,\nEuen on the instant\n\n   Othello. What is the matter, thinke you?\n  Cassio. Something from Cyprus, as I may diuine:\nIt is a businesse of some heate. The Gallies\nHaue sent a dozen sequent Messengers\nThis very night, at one anothers heeles:\nAnd many of the Consuls, rais'd and met,\nAre at the Dukes already. You haue bin hotly call'd for,\nWhen being not at your Lodging to be found,\nThe Senate hath sent about three seuerall Quests,\nTo search you out\n\n   Othel. 'Tis well I am found by you:\nI will but spend a word here in the house,\nAnd goe with you\n\n   Cassio. Aunciant, what makes he heere?\n  Iago. Faith, he to night hath boarded a Land Carract,\nIf it proue lawfull prize, he's made for euer\n\n   Cassio. I do not vnderstand\n\n   Iago. He's married\n\n   Cassio. To who?\n  Iago. Marry to- Come Captaine, will you go?\n  Othel. Haue with you\n\n   Cassio. Here comes another Troope to seeke for you.\n\nEnter Brabantio, Rodorigo, with Officers, and Torches.\n\n  Iago. It is Brabantio: Generall be aduis'd,\nHe comes to bad intent\n\n   Othello. Holla, stand there\n\n   Rodo. Signior, it is the Moore\n\n   Bra. Downe with him, Theefe\n\n   Iago. You, Rodorigo? Come Sir, I am for you\n\n   Othe. Keepe vp your bright Swords, for the dew will\nrust them. Good Signior, you shall more command with\nyeares, then with your Weapons\n\n   Bra. Oh thou foule Theefe,\nWhere hast thou stow'd my Daughter?\nDamn'd as thou art, thou hast enchaunted her\nFor Ile referre me to all things of sense,\n(If she in Chaines of Magick were not bound)\nWhether a Maid, so tender, Faire, and Happie,\nSo opposite to Marriage, that she shun'd\nThe wealthy curled Deareling of our Nation,\nWould euer haue (t' encurre a generall mocke)\nRun from her Guardage to the sootie bosome,\nOf such a thing as thou: to feare, not to delight?\nIudge me the world, if 'tis not grosse in sense,\nThat thou hast practis'd on her with foule Charmes,\nAbus'd her delicate Youth, with Drugs or Minerals,\nThat weakens Motion. Ile haue't disputed on,\n'Tis probable, and palpable to thinking;\nI therefore apprehend and do attach thee,\nFor an abuser of the World, a practiser\nOf Arts inhibited, and out of warrant;\nLay hold vpon him, if he do resist\nSubdue him, at his perill\n\n   Othe. Hold your hands\nBoth you of my inclining, and the rest.\nWere it my Cue to fight, I should haue knowne it\nWithout a Prompter. Whether will you that I goe\nTo answere this your charge?\n  Bra. To Prison, till fit time\nOf Law, and course of direct Session\nCall thee to answer\n\n   Othe. What if I do obey?\nHow may the Duke be therewith satisfi'd,\nWhose Messengers are heere about my side,\nVpon some present businesse of the State,\nTo bring me to him\n\n   Officer. 'Tis true most worthy Signior,\nThe Dukes in Counsell, and your Noble selfe,\nI am sure is sent for\n\n   Bra. How? The Duke in Counsell?\nIn this time of the night? Bring him away;\nMine's not an idle Cause. The Duke himselfe,\nOr any of my Brothers of the State,\nCannot but feele this wrong, as 'twere their owne:\nFor if such Actions may haue passage free,\nBond-slaues, and Pagans shall our Statesmen be.\n\nExeunt.\n\nScaena Tertia.\n\nEnter Duke, Senators, and Officers.\n\n  Duke. There's no composition in this Newes,\nThat giues them Credite\n\n   1.Sen. Indeed, they are disproportioned;\nMy Letters say, a Hundred and seuen Gallies\n\n   Duke. And mine a Hundred fortie\n\n   2.Sena. And mine two Hundred:\nBut though they iumpe not on a iust accompt,\n(As in these Cases where the ayme reports,\n'Tis oft with difference) yet do they all confirme\nA Turkish Fleete, and bearing vp to Cyprus\n\n   Duke. Nay, it is possible enough to iudgement:\nI do not so secure me in the Error,\nBut the maine Article I do approue\nIn fearefull sense\n\n   Saylor within. What hoa, what hoa, what hoa.\n\nEnter Saylor.\n\n  Officer. A Messenger from the Gallies\n\n   Duke. Now? What's the businesse?\n  Sailor. The Turkish Preparation makes for Rhodes,\nSo was I bid report here to the State,\nBy Signior Angelo\n\n   Duke. How say you by this change?\n  1.Sen. This cannot be\nBy no assay of reason. 'Tis a Pageant\nTo keepe vs in false gaze, when we consider\nTh' importancie of Cyprus to the Turke;\nAnd let our selues againe but vnderstand,\nThat as it more concernes the Turke then Rhodes,\nSo may he with more facile question beare it,\nFor that it stands not in such Warrelike brace,\nBut altogether lackes th' abilities\nThat Rhodes is dress'd in. If we make thought of this,\nWe must not thinke the Turke is so vnskillfull,\nTo leaue that latest, which concernes him first,\nNeglecting an attempt of ease, and gaine\nTo wake, and wage a danger profitlesse\n\n   Duke. Nay, in all confidence he's not for Rhodes\n\n   Officer. Here is more Newes.\n\nEnter a Messenger.\n\n  Messen. The Ottamites, Reueren'd, and Gracious,\nSteering with due course toward the Ile of Rhodes,\nHaue there inioynted them with an after Fleete\n\n   1.Sen. I, so I thought: how many, as you guesse?\n  Mess. Of thirtie Saile: and now they do re-stem\nTheir backward course, bearing with frank appearance\nTheir purposes toward Cyprus. Signior Montano,\nYour trustie and most Valiant Seruitour,\nWith his free dutie, recommends you thus,\nAnd prayes you to beleeue him\n\n   Duke. 'Tis certaine then for Cyprus:\nMarcus Luccicos is not he in Towne?\n  1.Sen. He's now in Florence\n\n   Duke. Write from vs,\nTo him, Post, Post-haste, dispatch\n\n   1.Sen. Here comes Brabantio, and the Valiant Moore.\n\nEnter Brabantio, Othello, Cassio, Iago, Rodorigo, and Officers.\n\n  Duke. Valiant Othello, we must straight employ you,\nAgainst the generall Enemy Ottoman.\nI did not see you: welcome gentle Signior,\nWe lack't your Counsaile, and your helpe to night\n\n   Bra. So did I yours: Good your Grace pardon me.\nNeither my place, nor ought I heard of businesse\nHath rais'd me from my bed; nor doth the generall care\nTake hold on me. For my perticular griefe\nIs of so flood-gate, and ore-bearing Nature,\nThat it engluts, and swallowes other sorrowes,\nAnd it is still it selfe\n\n   Duke. Why? What's the matter?\n  Bra. My Daughter: oh my Daughter!\n  Sen. Dead?\n  Bra. I, to me.\nShe is abus'd, stolne from me, and corrupted\nBy Spels, and Medicines, bought of Mountebanks;\nFor Nature, so prepostrously to erre,\n(Being not deficient, blind, or lame of sense,)\nSans witch-craft could not\n\n   Duke. Who ere he be, that in this foule proceeding\nHath thus beguil'd your Daughter of her selfe,\nAnd you of her; the bloodie Booke of Law,\nYou shall your selfe read, in the bitter letter,\nAfter your owne sense: yea, though our proper Son\nStood in your Action\n\n   Bra. Humbly I thanke your Grace,\nHere is the man; this Moore, whom now it seemes\nYour speciall Mandate, for the State affaires\nHath hither brought\n\n   All. We are verie sorry for't\n\n   Duke. What in your owne part, can you say to this?\n  Bra. Nothing, but this is so\n\n   Othe. Most Potent, Graue, and Reueren'd Signiors,\nMy very Noble, and approu'd good Masters;\nThat I haue tane away this old mans Daughter,\nIt is most true: true I haue married her;\nThe verie head, and front of my offending,\nHath this extent; no more. Rude am I, in my speech,\nAnd little bless'd with the soft phrase of Peace;\nFor since these Armes of mine, had seuen yeares pith,\nTill now, some nine Moones wasted, they haue vs'd\nTheir deerest action, in the Tented Field:\nAnd little of this great world can I speake,\nMore then pertaines to Feats of Broiles, and Battaile,\nAnd therefore little shall I grace my cause,\nIn speaking for my selfe. Yet, (by your gratious patience)\nI will a round vn-varnish'd Tale deliuer,\nOf my whole course of Loue.\nWhat Drugges, what Charmes,\nWhat Coniuration, and what mighty Magicke,\n(For such proceeding I am charg'd withall)\nI won his Daughter\n\n   Bra. A Maiden, neuer bold:\nOf Spirit so still, and quiet, that her Motion\nBlush'd at her selfe, and she, in spight of Nature,\nOf Yeares, of Country, Credite, euery thing\nTo fall in Loue, with what she fear'd to looke on;\nIt is a iudgement main'd, and most imperfect.\nThat will confesse Perfection so could erre\nAgainst all rules of Nature, and must be driuen\nTo find out practises of cunning hell\nWhy this should be. I therefore vouch againe,\nThat with some Mixtures, powrefull o're the blood,\nOr with some Dram, (coniur'd to this effect)\nHe wrought vpon her.\nTo vouch this, is no proofe,\nWithout more wider, and more ouer Test\nThen these thin habits, and poore likely-hoods\nOf moderne seeming, do prefer against him\n\n   Sen. But Othello, speake,\nDid you, by indirect, and forced courses\nSubdue, and poyson this yong Maides affections?\nOr came it by request, and such faire question\nAs soule, to soule affordeth?\n  Othel. I do beseech you,\nSend for the Lady to the Sagitary,\nAnd let her speake of me before her Father;\nIf you do finde me foule, in her report,\nThe Trust, the Office, I do hold of you,\nNot onely take away, but let your Sentence\nEuen fall vpon my life\n\n   Duke. Fetch Desdemona hither\n\n   Othe. Aunciant, conduct them:\nYou best know the place.\nAnd tell she come, as truely as to heauen,\nI do confesse the vices of my blood,\nSo iustly to your Graue eares, Ile present\nHow I did thriue in this faire Ladies loue,\nAnd she in mine\n\n   Duke. Say it Othello\n\n   Othe. Her Father lou'd me, oft inuited me:\nStill question'd me the Storie of my life,\nFrom yeare to yeare: the Battaile, Sieges, Fortune,\nThat I haue past.\nI ran it through, euen from my boyish daies,\nToth' very moment that he bad me tell it.\nWherein I spoke of most disastrous chances:\nOf mouing Accidents by Flood and Field,\nOf haire-breadth scapes i'th' imminent deadly breach;\nOf being taken by the Insolent Foe,\nAnd sold to slauery. Of my redemption thence,\nAnd portance in my Trauellours historie.\nWherein of Antars vast, and Desarts idle,\nRough Quarries, Rocks, Hills, whose head touch heauen,\nIt was my hint to speake. Such was my Processe,\nAnd of the Canibals that each others eate,\nThe Antropophague, and men whose heads\nGrew beneath their shoulders. These things to heare,\nWould Desdemona seriously incline:\nBut still the house Affaires would draw her hence:\nWhich euer as she could with haste dispatch,\nShe'l'd come againe, and with a greedie eare\nDeuoure vp my discourse. Which I obseruing,\nTooke once a pliant houre, and found good meanes\nTo draw from her a prayer of earnest heart,\nThat I would all my Pilgrimage dilate,\nWhereof by parcels she had something heard,\nBut not instinctiuely: I did consent,\nAnd often did beguile her of her teares,\nWhen I did speake of some distressefull stroke\nThat my youth suffer'd: My Storie being done,\nShe gaue me for my paines a world of kisses:\nShe swore in faith 'twas strange: 'twas passing strange,\n'Twas pittifull: 'twas wondrous pittifull.\nShe wish'd she had not heard it, yet she wish'd\nThat Heauen had made her such a man. She thank'd me,\nAnd bad me, if I had a Friend that lou'd her,\nI should but teach him how to tell my Story,\nAnd that would wooe her. Vpon this hint I spake,\nShe lou'd me for the dangers I had past,\nAnd I lou'd her, that she did pitty them.\nThis onely is the witch-craft I haue vs'd.\nHere comes the Ladie: Let her witnesse it.\n\nEnter Desdemona, Iago, Attendants.\n\n  Duke. I thinke this tale would win my Daughter too,\nGood Brabantio, take vp this mangled matter at the best:\nMen do their broken Weapons rather vse,\nThen their bare hands\n\n   Bra. I pray you heare her speake?\nIf she confesse that she was halfe the wooer,\nDestruction on my head, if my bad blame\nLight on the man. Come hither gentle Mistris,\nDo you perceiue in all this Noble Companie,\nWhere most you owe obedience?\n  Des. My Noble Father,\nI do perceiue heere a diuided dutie.\nTo you I am bound for life, and education:\nMy life and education both do learne me,\nHow to respect you. You are the Lord of duty,\nI am hitherto your Daughter. But heere's my Husband;\nAnd so much dutie, as my Mother shew'd\nTo you, preferring you before her Father:\nSo much I challenge, that I may professe\nDue to the Moore my Lord\n\n   Bra. God be with you: I haue done.\nPlease it your Grace, on to the State Affaires;\nI had rather to adopt a Child, then get it.\nCome hither Moore;\nI here do giue thee that with all my heart,\nWhich but thou hast already, with all my heart\nI would keepe from thee. For your sake (Iewell)\nI am glad at soule, I haue no other Child,\nFor thy escape would teach me Tirranie\nTo hang clogges on them. I haue done my Lord\n\n   Duke. Let me speake like your selfe:\nAnd lay a Sentence,\nWhich as a grise, or step may helpe these Louers.\nWhen remedies are past, the griefes are ended\nBy seeing the worst, which late on hopes depended.\nTo mourne a Mischeefe that is past and gon,\nIs the next way to draw new mischiefe on.\nWhat cannot be preseru'd, when Fortune takes:\nPatience, her Iniury a mock'ry makes.\nThe rob'd that smiles, steales something from the Thiefe,\nHe robs himselfe, that spends a bootelesse griefe\n\n   Bra. So let the Turke of Cyprus vs beguile,\nWe loose it not so long as we can smile:\nHe beares the Sentence well, that nothing beares,\nBut the free comfort which from thence he heares.\nBut he beares both the Sentence, and the sorrow,\nThat to pay griefe, must of poore Patience borrow.\nThese Sentences, to Sugar, or to Gall,\nBeing strong on both sides, are Equiuocall.\nBut words are words, I neuer yet did heare:\nThat the bruized heart was pierc'd through the eares.\nI humbly beseech you proceed to th' Affaires of State\n\n   Duke. The Turke with a most mighty Preparation\nmakes for Cyprus: Othello, the Fortitude of the place is\nbest knowne to you. And though we haue there a Substitute\nof most allowed sufficiencie; yet opinion, a more\nsoueraigne Mistris of Effects, throwes a more safer\nvoice on you: you must therefore be content to slubber\nthe glosse of your new Fortunes, with this more stubborne,\nand boystrous expedition\n\n   Othe. The Tirant Custome, most Graue Senators,\nHath made the flinty and Steele Coach of Warre\nMy thrice-driuen bed of Downe. I do agnize\nA Naturall and prompt Alacratie,\nI finde in hardnesse: and do vndertake\nThis present Warres against the Ottamites.\nMost humbly therefore bending to your State,\nI craue fit disposition for my Wife,\nDue reference of Place, and Exhibition,\nWith such Accomodation and besort\nAs leuels with her breeding\n\n   Duke. Why at her Fathers?\n  Bra. I will not haue it so\n\n   Othe. Nor I\n\n   Des. Nor would I there recide,\nTo put my Father in impatient thoughts\nBy being in his eye. Most Gracious Duke,\nTo my vnfolding, lend your prosperous eare,\nAnd let me finde a Charter in your voice\nT' assist my simplenesse\n\n   Duke. What would you Desdemona?\n  Des. That I loue the Moore, to liue with him,\nMy downe-right violence, and storme of Fortunes,\nMay trumpet to the world. My heart's subdu'd\nEuen to the very quality of my Lord;\nI saw Othello's visage in his mind,\nAnd to his Honours and his valiant parts,\nDid I my soule and Fortunes consecrate.\nSo that (deere Lords) if I be left behind\nA Moth of Peace, and he go to the Warre,\nThe Rites for why I loue him, are bereft me:\nAnd I a heauie interim shall support\nBy his deere absence. Let me go with him\n\n   Othe. Let her haue your voice.\nVouch with me Heauen, I therefore beg it not\nTo please the pallate of my Appetite:\nNor to comply with heat the yong affects\nIn my defunct, and proper satisfaction.\nBut to be free, and bounteous to her minde:\nAnd Heauen defend your good soules, that you thinke\nI will your serious and great businesse scant\nWhen she is with me. No, when light wing'd Toyes\nOf feather'd Cupid, seele with wanton dulnesse\nMy speculatiue, and offic'd Instrument:\nThat my Disports corrupt, and taint my businesse:\nLet House-wiues make a Skillet of my Helme,\nAnd all indigne, and base aduersities,\nMake head against my Estimation\n\n   Duke. Be it as you shall priuately determine,\nEither for her stay, or going: th' Affaire cries hast:\nAnd speed must answer it\n\n   Sen. You must away to night\n\n   Othe. With all my heart\n\n   Duke. At nine i'th' morning, here wee'l meete againe.\nOthello, leaue some Officer behind\nAnd he shall our Commission bring to you:\nAnd such things else of qualitie and respect\nAs doth import you\n\n   Othe. So please your Grace, my Ancient,\nA man he is of honesty and trust:\nTo his conueyance I assigne my wife,\nWith what else needfull, your good Grace shall think\nTo be sent after me\n\n   Duke. Let it be so:\nGood night to euery one. And Noble Signior,\nIf Vertue no delighted Beautie lacke,\nYour Son-in-law is farre more Faire then Blacke\n\n   Sen. Adieu braue Moore, vse Desdemona well\n\n   Bra. Looke to her (Moore) if thou hast eies to see:\nShe ha's deceiu'd her Father, and may thee.\nEnter.\n\n  Othe. My life vpon her faith. Honest Iago,\nMy Desdemona must I leaue to thee:\nI prythee let thy wife attend on her,\nAnd bring them after in the best aduantage.\nCome Desdemona, I haue but an houre\nOf Loue, of wordly matter, and direction\nTo spend with thee. We must obey the time.\nEnter.\n\n  Rod. Iago\n\n   Iago. What saist thou Noble heart?\n  Rod. What will I do, think'st thou?\n  Iago. Why go to bed and sleepe\n\n   Rod. I will incontinently drowne my selfe\n\n   Iago. If thou do'st, I shall neuer loue thee after. Why\nthou silly Gentleman?\n  Rod. It is sillynesse to liue, when to liue is torment:\nand then haue we a prescription to dye, when death is\nour Physition\n\n   Iago. Oh villanous: I haue look'd vpon the world\nfor foure times seuen yeares, and since I could distinguish\nbetwixt a Benefit, and an Iniurie: I neuer found man that\nknew how to loue himselfe. Ere I would say, I would\ndrowne my selfe for the loue of a Gynney Hen, I would\nchange my Humanity with a Baboone\n\n   Rod. What should I do? I confesse it is my shame\nto be so fond, but it is not in my vertue to amend it\n\n   Iago. Vertue? A figge, 'tis in our selues that we are\nthus, or thus. Our Bodies are our Gardens, to the which,\nour Wills are Gardiners. So that if we will plant Nettels,\nor sowe Lettice: Set Hisope, and weede vp Time:\nSupplie it with one gender of Hearbes, or distract it with\nmany: either to haue it sterrill with idlenesse, or manured\nwith Industry, why the power, and Corrigeable authoritie\nof this lies in our Wills. If the braine of our liues\nhad not one Scale of Reason, to poize another of Sensualitie,\nthe blood, and basenesse of our Natures would\nconduct vs to most prepostrous Conclusions. But we\nhaue Reason to coole our raging Motions, our carnall\nStings, or vnbitted Lusts: whereof I take this, that you\ncall Loue, to be a Sect, or Seyen\n\n   Rod. It cannot be\n\n   Iago. It is meerly a Lust of the blood, and a permission\nof the will. Come, be a man: drowne thy selfe? Drown\nCats, and blind Puppies. I haue profest me thy Friend,\nand I confesse me knit to thy deseruing, with Cables of\nperdurable toughnesse. I could neuer better steed thee\nthen now. Put Money in thy purse: follow thou the\nWarres, defeate thy fauour, with an vsurp'd Beard. I say\nput Money in thy purse. It cannot be long that Desdemona\nshould continue her loue to the Moore. Put Money in\nthy purse: nor he his to her. It was a violent Commencement\nin her, and thou shalt see an answerable Sequestration,\nput but Money in thy purse. These Moores\nare changeable in their wils: fill thy purse with Money.\nThe Food that to him now is as lushious as Locusts,\nshalbe to him shortly, as bitter as Coloquintida. She\nmust change for youth: when she is sated with his body\nshe will find the errors of her choice. Therefore, put Money\nin thy purse. If thou wilt needs damne thy selfe, do\nit a more delicate way then drowning. Make all the Money\nthou canst: If Sanctimonie, and a fraile vow, betwixt\nan erring Barbarian, and super-subtle Venetian be\nnot too hard for my wits, and all the Tribe of hell, thou\nshalt enioy her: therefore make Money: a pox of drowning\nthy selfe, it is cleane out of the way. Seeke thou rather\nto be hang'd in Compassing thy ioy, then to be\ndrown'd, and go without her\n\n   Rodo. Wilt thou be fast to my hopes, if I depend on\nthe issue?\n  Iago. Thou art sure of me: Go make Money: I haue\ntold thee often, and I re-tell thee againe, and againe, I\nhate the Moore. My cause is hearted; thine hath no lesse\nreason. Let vs be coniunctiue in our reuenge, against\nhim. If thou canst Cuckold him, thou dost thy selfe a\npleasure, me a sport. There are many Euents in the\nWombe of Time, which wilbe deliuered. Trauerse, go,\nprouide thy Money. We will haue more of this to morrow.\nAdieu\n\n   Rod. Where shall we meete i'th' morning?\n  Iago. At my Lodging\n\n   Rod. Ile be with thee betimes\n\n   Iago. Go too, farewell. Do you heare Rodorigo?\n  Rod. Ile sell all my Land.\nEnter.\n\n  Iago. Thus do I euer make my Foole, my purse:\nFor I mine owne gain'd knowledge should prophane\nIf I would time expend with such Snipe,\nBut for my Sport, and Profit: I hate the Moore,\nAnd it is thought abroad, that 'twixt my sheets\nShe ha's done my Office. I know not if't be true,\nBut I, for meere suspition in that kinde,\nWill do, as if for Surety. He holds me well,\nThe better shall my purpose worke on him:\nCassio's a proper man: Let me see now,\nTo get his Place, and to plume vp my will\nIn double Knauery. How? How? Let's see.\nAfter some time, to abuse Othello's eares,\nThat he is too familiar with his wife:\nHe hath a person, and a smooth dispose\nTo be suspected: fram'd to make women false.\nThe Moore is of a free, and open Nature,\nThat thinkes men honest, that but seeme to be so,\nAnd will as tenderly be lead by'th' Nose\nAs Asses are:\nI hau't: it is engendred: Hell, and Night,\nMust bring this monstrous Birth, to the worlds light.\n\nActus Secundus. Scena Prima.\n\nEnter Montano, and two Gentlemen.\n\n  Mon. What from the Cape, can you discerne at Sea?\n  1.Gent. Nothing at all, it is a high wrought Flood:\nI cannot 'twixt the Heauen, and the Maine,\nDescry a Saile\n\n   Mon. Me thinks, the wind hath spoke aloud at Land,\nA fuller blast ne're shooke our Battlements:\nIf it hath ruffiand so vpon the Sea,\nWhat ribbes of Oake, when Mountaines melt on them,\nCan hold the Morties. What shall we heare of this?\n  2 A Segregation of the Turkish Fleet:\nFor do but stand vpon the Foaming Shore,\nThe chidden Billow seemes to pelt the Clowds,\nThe winde-shak'd-Surge, with high & monstrous Maine\nSeemes to cast water on the burning Beare,\nAnd quench the Guards of th' euer-fixed Pole:\nI neuer did like mollestation view\nOn the enchafed Flood\n\n   Men. If that the Turkish Fleete\nBe not enshelter'd, and embay'd, they are drown'd,\nIt is impossible to beare it out.\nEnter a Gentleman.\n\n  3 Newes Laddes: our warres are done:\nThe desperate Tempest hath so bang'd the Turkes,\nThat their designement halts. A Noble ship of Venice,\nHath seene a greeuous wracke and sufferance\nOn most part of their Fleet\n\n   Mon. How? Is this true?\n  3 The Ship is heere put in: A Verennessa, Michael Cassio\nLieutenant to the warlike Moore, Othello,\nIs come on Shore: the Moore himselfe at Sea,\nAnd is in full Commission heere for Cyprus\n\n   Mon. I am glad on't:\n'Tis a worthy Gouernour\n\n   3 But this same Cassio, though he speake of comfort,\nTouching the Turkish losse, yet he lookes sadly,\nAnd praye the Moore be safe; for they were parted\nWith fowle and violent Tempest\n\n   Mon. Pray Heauens he be:\nFor I haue seru'd him, and the man commands\nLike a full Soldier. Let's to the Sea-side (hoa)\nAs well to see the Vessell that's come in,\nAs to throw-out our eyes for braue Othello,\nEuen till we make the Maine, and th' Eriall blew,\nAn indistinct regard\n\n   Gent. Come, let's do so;\nFor euery Minute is expectancie\nOf more Arriuancie.\nEnter Cassio.\n\n  Cassi. Thankes you, the valiant of the warlike Isle,\nThat so approoue the Moore: Oh let the Heauens\nGiue him defence against the Elements,\nFor I haue lost him on a dangerous Sea\n\n   Mon. Is he well ship'd?\n  Cassio. His Barke is stoutly Timber'd, and his Pylot\nOf verie expert, and approu'd Allowance;\nTherefore my hope's (not surfetted to death)\nStand in bold Cure\n\n   Within. A Saile, a Saile, a Saile\n\n   Cassio. What noise?\n  Gent. The Towne is empty; on the brow o'th' Sea\nStand rankes of People and they cry, a Saile\n\n   Cassio. My hopes do shape him for the Gouernor\n\n   Gent. They do discharge their Shot of Courtesie,\nOur Friends, at least\n\n   Cassio. I pray you Sir, go forth,\nAnd giue vs truth who 'tis that is arriu'd\n\n   Gent. I shall.\nEnter.\n\n  Mon. But good Lieutenant, is your Generall wiu'd?\n  Cassio. Most fortunately: he hath atchieu'd a Maid\nThat paragons description, and wilde Fame:\nOne that excels the quirkes of Blazoning pens,\nAnd in th' essentiall Vesture of Creation,\nDo's tyre the Ingeniuer.\nEnter Gentleman.\n\nHow now? Who ha's put in?\n  Gent. 'Tis one Iago, Auncient to the Generall\n\n   Cassio. Ha's had most fauourable, and happie speed:\nTempests themselues, high Seas, and howling windes,\nThe gutter'd-Rockes, and Congregated Sands,\nTraitors ensteep'd, to enclogge the guiltlesse Keele,\nAs hauing sence of Beautie, do omit\nTheir mortall Natures, letting go safely by\nThe Diuine Desdemona\n\n   Mon. What is she?\n  Cassio. She that I spake of:\nOur great Captains Captaine,\nLeft in the conduct of the bold Iago,\nWhose footing heere anticipates our thoughts,\nA Senights speed. Great Ioue, Othello guard,\nAnd swell his Saile with thine owne powrefull breath,\nThat he may blesse this Bay with his tall Ship,\nMake loues quicke pants in Desdemonaes Armes,\nGiue renew'd fire to our extincted Spirits.\n\nEnter Desdemona, Iago, Rodorigo, and Aemilia.\n\nOh behold,\nThe Riches of the Ship is come on shore:\nYou men of Cyprus, let her haue your knees.\nHaile to thee Ladie: and the grace of Heauen,\nBefore, behinde thee, and on euery hand\nEnwheele thee round\n\n   Des. I thanke you, Valiant Cassio,\nWhat tydings can you tell of my Lord?\n  Cas. He is not yet arriu'd, nor know I ought\nBut that he's well, and will be shortly heere\n\n   Des. Oh, but I feare:\nHow lost you company?\n  Cassio. The great Contention of Sea, and Skies\nParted our fellowship. But hearke, a Saile\n\n   Within. A Saile, a Saile\n\n   Gent. They giue this greeting to the Cittadell:\nThis likewise is a Friend\n\n   Cassio. See for the Newes:\nGood Ancient, you are welcome. Welcome Mistris:\nLet it not gaule your patience (good Iago)\nThat I extend my Manners. 'Tis my breeding,\nThat giues me this bold shew of Curtesie\n\n   Iago. Sir, would she giue you so much of her lippes,\nAs of her tongue she oft bestowes on me,\nYou would haue enough\n\n   Des. Alas: she ha's no speech\n\n   Iago. Infaith too much:\nI finde it still, when I haue leaue to sleepe.\nMarry before your Ladyship, I grant,\nShe puts her tongue a little in her heart,\nAnd chides with thinking\n\n   aemil. You haue little cause to say so\n\n   Iago. Come on, come on: you are Pictures out of\ndoore: Bells in your Parlours: Wilde-Cats in your Kitchens:\nSaints in your Iniuries: Diuels being offended:\nPlayers in your Huswiferie, and Huswiues in your\nBeds\n\n   Des. Oh, fie vpon thee, Slanderer\n\n   Iago. Nay, it is true: or else I am a Turke,\nYou rise to play, and go to bed to worke.\nAemil. You shall not write my praise\n\n   Iago. No, let me not\n\n   Desde. What would'st write of me, if thou should'st\npraise me?\n  Iago. Oh, gentle Lady, do not put me too't,\nFor I am nothing, if not Criticall\n\n   Des. Come on, assay.\nThere's one gone to the Harbour?\n  Iago. I Madam\n\n   Des. I am not merry: but I do beguile\nThe thing I am, by seeming otherwise.\nCome, how would'st thou praise me?\n  Iago. I am about it, but indeed my inuention comes\nfrom my pate, as Birdlyme do's from Freeze, it pluckes\nout Braines and all. But my Muse labours, and thus she\nis deliuer'd.\nIf she be faire, and wise: fairenesse, and wit,\nThe ones for vse, the other vseth it\n\n   Des. Well prais'd:\nHow if she be Blacke and Witty?\n  Iago. If she be blacke, and thereto haue a wit,\nShe'le find a white, that shall her blacknesse fit\n\n   Des. Worse, and worse.\nAemil. How if Faire, and Foolish?\n  Iago. She neuer yet was foolish that was faire,\nFor euen her folly helpt her to an heire\n\n   Desde. These are old fond Paradoxes, to make Fooles\nlaugh i'th' Alehouse. What miserable praise hast thou\nfor her that's Foule, and Foolish\n\n   Iago. There's none so foule and foolish thereunto,\nBut do's foule pranks, which faire, and wise-ones do\n\n   Desde. Oh heauy ignorance: thou praisest the worst\nbest. But what praise could'st thou bestow on a deseruing\nwoman indeed? One, that in the authorithy of her\nmerit, did iustly put on the vouch of very malice it\nselfe\n\n   Iago. She that was euer faire, and neuer proud,\nHad Tongue at will, and yet was neuer loud:\nNeuer lackt Gold, and yet went neuer gay,\nFled from her wish, and yet said now I may.\nShe that being angred, her reuenge being nie,\nBad her wrong stay, and her displeasure flie:\nShe that in wisedome neuer was so fraile,\nTo change the Cods-head for the Salmons taile:\nShe that could thinke, and neu'r disclose her mind,\nSee Suitors following, and not looke behind:\nShe was a wight, (if euer such wightes were)\n  Des. To do what?\n  Iago. To suckle Fooles, and chronicle small Beere\n\n   Desde. Oh most lame and impotent conclusion. Do\nnot learne of him aemillia, though he be thy husband.\nHow say you (Cassio) is he not a most prophane, and liberall\nCounsailor?\n  Cassio. He speakes home (Madam) you may rellish\nhim more in the Souldier, then in the Scholler\n\n   Iago. He takes her by the palme: I, well said, whisper.\nWith as little a web as this, will I ensnare as great\na Fly as Cassio. I smile vpon her, do: I will giue thee\nin thine owne Courtship. You say true, 'tis so indeed.\nIf such tricks as these strip you out of your Lieutenantrie,\nit had beene better you had not kiss'd your three fingers\nso oft, which now againe you are most apt to play\nthe Sir, in. Very good: well kiss'd, and excellent Curtsie:\n'tis so indeed. Yet againe, your fingers to your\nlippes? Would they were Cluster-pipes for your\nsake.\nThe Moore I know his Trumpet\n\n   Cassio. 'Tis truely so\n\n   Des. Let's meete him, and recieue him\n\n   Cassio. Loe, where he comes.\nEnter Othello, and Attendants.\n\n  Oth. O, my faire Warriour\n\n   Des. My deere Othello\n\n   Othe. It giues me wonder great, as my content\nTo see you heere before me.\nOh my Soules Ioy:\nIf after euery Tempest, come such Calmes,\nMay the windes blow, till they haue waken'd death:\nAnd let the labouring Barke climbe hills of Seas\nOlympus high: and duck againe as low,\nAs hell's from Heauen. If it were now to dye,\n'Twere now to be most happy. For I feare,\nMy Soule hath her content so absolute,\nThat not another comfort like to this,\nSucceedes in vnknowne Fate\n\n   Des. The Heauens forbid\nBut that our Loues\nAnd Comforts should encrease\nEuen as our dayes do grow\n\n   Othe. Amen to that (sweet Powers)\nI cannot speake enough of this content,\nIt stoppes me heere: it is too much of ioy.\nAnd this, and this the greatest discords be\nThat ere our hearts shall make\n\n   Iago. Oh you are well tun'd now: But Ile set downe\nthe peggs that make this Musicke, as honest as I am\n\n   Othe. Come: let vs to the Castle.\nNewes (Friends) our Warres are done:\nThe Turkes are drown'd.\nHow do's my old Acquaintance of this Isle?\n(Hony) you shall be well desir'd in Cyprus,\nI haue found great loue among'st them. Oh my Sweet,\nI prattle out of fashion, and I doate\nIn mine owne comforts. I prythee, good Iago,\nGo to the Bay, and disimbarke my Coffers:\nBring thou the Master to the Cittadell,\nHe is a good one, and his worthynesse\nDo's challenge much respect. Come Desdemona,\nOnce more well met at Cyprus.\n\nExit Othello and Desdemona.\n\n  Iago. Do thou meet me presently at the Harbour.\nCome thither, if thou be'st Valiant, (as they say base men\nbeing in Loue, haue then a Nobilitie in their Natures,\nmore then is natiue to them) list-me; the Lieutenant to\nnight watches on the Court of Guard. First, I must tell\nthee this: Desdemona, is directly in loue with him\n\n   Rod. With him? Why, 'tis not possible\n\n   Iago. Lay thy finger thus: and let thy soule be instructed.\nMarke me with what violence she first lou'd\nthe Moore, but for bragging, and telling her fantasticall\nlies. To loue him still for prating, let not thy discreet\nheart thinke it. Her eye must be fed. And what delight\nshall she haue to looke on the diuell? When the Blood\nis made dull with the Act of Sport, there should be a\ngame to enflame it, and to giue Satiety a fresh appetite.\nLouelinesse in fauour, simpathy in yeares, Manners,\nand Beauties: all which the Moore is defectiue in. Now\nfor want of these requir'd Conueniences, her delicate\ntendernesse wil finde it selfe abus'd, begin to heaue the,\ngorge, disrellish and abhorre the Moore, very Nature wil\ninstruct her in it, and compell her to some second choice.\nNow Sir, this granted (as it is a most pregnant and vnforc'd\nposition) who stands so eminent in the degree of\nthis Fortune, as Cassio do's: a knaue very voluble: no\nfurther conscionable, then in putting on the meere forme\nof Ciuill, and Humaine seeming, for the better compasse\nof his salt, and most hidden loose Affection? Why none,\nwhy none: A slipper, and subtle knaue, a finder of occasion:\nthat he's an eye can stampe, and counterfeit Aduantages,\nthough true Aduantage neuer present it selfe.\nA diuelish knaue: besides, the knaue is handsome, young:\nand hath all those requisites in him, that folly and greene\nmindes looke after. A pestilent compleat knaue, and the\nwoman hath found him already\n\n   Rodo. I cannot beleeue that in her, she's full of most\nbless'd condition\n\n   Iago. Bless'd figges-end. The Wine she drinkes is\nmade of grapes. If shee had beene bless'd, shee would\nneuer haue lou'd the Moore: Bless'd pudding. Didst thou\nnot see her paddle with the palme of his hand? Didst not\nmarke that?\n  Rod. Yes, that I did: but that was but curtesie\n\n   Iago . Leacherie by this hand: an Index, and obscure\nprologue to the History of Lust and foule Thoughts.\nThey met so neere with their lippes, that their breathes\nembrac'd together. Villanous thoughts Rodorigo, when\nthese mutabilities so marshall the way, hard at hand\ncomes the Master, and maine exercise, th' incorporate\nconclusion: Pish. But Sir, be you rul'd by me. I haue\nbrought you from Venice. Watch you to night: for\nthe Command, Ile lay't vpon you. Cassio knowes you\nnot: Ile not be farre from you. Do you finde some occasion\nto anger Cassio, either by speaking too loud, or\ntainting his discipline, or from what other course\nyou please, which the time shall more fauorably minister\n\n   Rod. Well\n\n   Iago. Sir, he's rash, and very sodaine in Choller: and\nhappely may strike at you, prouoke him that he may: for\neuen out of that will I cause these of Cyprus to Mutiny.\nWhose qualification shall come into no true taste againe,\nbut by the displanting of Cassio. So shall you\nhaue a shorter iourney to your desires, by the meanes I\nshall then haue to preferre them. And the impediment\nmost profitably remoued, without the which there were\nno expectation of our prosperitie\n\n   Rodo. I will do this, if you can bring it to any opportunity\n\n   Iago. I warrant thee. Meete me by and by at the\nCittadell. I must fetch his Necessaries a Shore. Farewell\n\n   Rodo. Adieu.\nEnter.\n\n  Iago. That Cassio loues her, I do well beleeu't:\nThat she loues him, 'tis apt, and of great Credite.\nThe Moore (howbeit that I endure him not)\nIs of a constant, louing, Noble Nature,\nAnd I dare thinke, he'le proue to Desdemona\nA most deere husband. Now I do loue her too,\nNot out of absolute Lust, (though peraduenture\nI stand accomptant for as great a sin)\nBut partely led to dyet my Reuenge,\nFor that I do suspect the lustie Moore\nHath leap'd into my Seate. The thought whereof,\nDoth (like a poysonous Minerall) gnaw my Inwardes:\nAnd nothing can, or shall content my Soule\nTill I am eeuen'd with him, wife, for wife.\nOr fayling so, yet that I put the Moore,\nAt least into a Ielouzie so strong\nThat iudgement cannot cure. Which thing to do,\nIf this poore Trash of Venice, whom I trace\nFor his quicke hunting, stand the putting on,\nIle haue our Michael Cassio on the hip,\nAbuse him to the Moore, in the right garbe\n(For I feare Cassio with my Night-Cape too)\nMake the Moore thanke me, loue me, and reward me,\nFor making him egregiously an Asse,\nAnd practising vpon his peace, and quiet,\nEuen to madnesse. 'Tis heere: but yet confus'd,\nKnaueries plaine face, is neuer seene, till vs'd.\nEnter.\n\n\nScena Secunda.\n\nEnter Othello's Herald with a Proclamation.\n\n  Herald. It is Othello's pleasure, our Noble and Valiant\nGenerall. That vpon certaine tydings now arriu'd,\nimporting the meere perdition of the Turkish Fleete:\neuery man put himselfe into Triumph. Some to daunce,\nsome to make Bonfires, each man, to what Sport and\nReuels his addition leads him. For besides these beneficiall\nNewes, it is the Celebration of his Nuptiall. So\nmuch was his pleasure should be proclaimed. All offices\nare open, & there is full libertie of Feasting from this\npresent houre of fiue, till the Bell haue told eleuen.\nBlesse the Isle of Cyprus, and our Noble Generall Othello.\nEnter.\n\nEnter Othello, Desdemona, Cassio, and Attendants.\n\n  Othe. Good Michael, looke you to the guard to night.\nLet's teach our selues that Honourable stop,\nNot to out-sport discretion\n\n   Cas. Iago, hath direction what to do.\nBut notwithstanding with my personall eye\nWill I looke to't\n\n   Othe. Iago, is most honest:\nMichael, goodnight. To morrow with your earliest,\nLet me haue speech with you. Come my deere Loue,\nThe purchase made, the fruites are to ensue,\nThat profit's yet to come 'tweene me, and you.\nGoodnight.\nEnter.\n\nEnter Iago.\n\n  Cas. Welcome Iago: we must to the Watch\n\n   Iago. Not this houre Lieutenant: 'tis not yet ten\no'th' clocke. Our Generall cast vs thus earely for the\nloue of his Desdemona: Who, let vs not therefore blame;\nhe hath not yet made wanton the night with her: and\nshe is sport for Ioue\n\n   Cas. She's a most exquisite Lady\n\n   Iago. And Ile warrant her, full of Game\n\n   Cas. Indeed shes a most fresh and delicate creature\n\n   Iago. What an eye she ha's?\nMe thinkes it sounds a parley to prouocation\n\n   Cas. An inuiting eye:\nAnd yet me thinkes right modest\n\n   Iago. And when she speakes,\nIs it not an Alarum to Loue?\n  Cas. She is indeed perfection\n\n   Iago. Well: happinesse to their Sheetes. Come Lieutenant,\nI haue a stope of Wine, and heere without are a\nbrace of Cyprus Gallants, that would faine haue a measure\nto the health of blacke Othello\n\n   Cas. Not to night, good Iago, I haue very poore,\nand vnhappie Braines for drinking. I could well wish\nCurtesie would inuent some other Custome of entertainment\n\n   Iago. Oh, they are our Friends: but one Cup, Ile\ndrinke for you\n\n   Cassio. I haue drunke but one Cup to night, and that\nwas craftily qualified too: and behold what inouation\nit makes heere. I am infortunate in the infirmity, and\ndare not taske my weakenesse with any more\n\n   Iago. What man? 'Tis a night of Reuels, the Gallants\ndesire it\n\n   Cas. Where are they?\n  Iago. Heere, at the doore: I pray you call them in\n\n   Cas. Ile do't, but it dislikes me.\nEnter.\n\n  Iago. If I can fasten but one Cup vpon him\nWith that which he hath drunke to night alreadie,\nHe'l be as full of Quarrell, and offence\nAs my yong Mistris dogge.\nNow my sicke Foole Rodorigo,\nWhom Loue hath turn'd almost the wrong side out,\nTo Desdemona hath to night Carrows'd.\nPotations, pottle-deepe; and he's to watch.\nThree else of Cyprus, Noble swelling Spirites,\n(That hold their Honours in a wary distance,\nThe very Elements of this Warrelike Isle)\nHaue I to night fluster'd with flowing Cups,\nAnd they Watch too.\nNow 'mongst this Flocke of drunkards\nAm I put to our Cassio in some Action\nThat may offend the Isle. But here they come.\nEnter Cassio, Montano, and Gentlemen.\n\nIf Consequence do but approue my dreame,\nMy Boate sailes freely, both with winde and Streame\n\n   Cas. 'Fore heauen, they haue giuen me a rowse already\n\n   Mon. Good-faith a litle one: not past a pint, as I am a\nSouldier\n\n   Iago. Some Wine hoa.\nAnd let me the Cannakin clinke, clinke:\nAnd let me the Cannakin clinke.\nA Souldiers a man: Oh, mans life's but a span,\nWhy then let a Souldier drinke.\nSome Wine Boyes\n\n   Cas. 'Fore Heauen: an excellent Song\n\n   Iago. I learn'd it in England: where indeed they are\nmost potent in Potting. Your Dane, your Germaine,\nand your swag-belly'd Hollander, (drinke hoa) are\nnothing to your English\n\n   Cassio. Is your Englishmen so exquisite in his drinking?\n  Iago. Why, he drinkes you with facillitie, your Dane\ndead drunke. He sweates not to ouerthrow your Almaine.\nHe giues your Hollander a vomit, ere the next\nPottle can be fill'd\n\n   Cas. To the health of our Generall\n\n   Mon. I am for it Lieutenant: and Ile do you Iustice\n\n   Iago. Oh sweet England.\nKing Stephen was anda worthy Peere,\nHis Breeches cost him but a Crowne,\nHe held them Six pence all to deere,\nWith that he cal'd the Tailor Lowne:\nHe was a wight of high Renowne,\nAnd thou art but of low degree:\n'Tis Pride that pulls the Country downe,\nAnd take thy awl'd Cloake about thee.\nSome Wine hoa\n\n   Cassio. Why this is a more exquisite Song then the other\n\n   Iago. Will you heare't againe?\n  Cas. No: for I hold him to be vnworthy of his Place,\nthat do's those things. Well: heau'ns aboue all: and\nthere be soules must be saued, and there be soules must\nnot be saued\n\n   Iago. It's true, good Lieutenant\n\n   Cas. For mine owne part, no offence to the Generall,\nnor any man of qualitie: I hope to be saued\n\n   Iago. And so do I too Lieutenant\n\n   Cassio. I: (but by your leaue) not before me. The\nLieutenant is to be saued before the Ancient. Let's haue\nno more of this: let's to our Affaires. Forgiue vs our\nsinnes: Gentlemen let's looke to our businesse. Do not\nthinke Gentlemen, I am drunke: this is my Ancient, this\nis my right hand, and this is my left. I am not drunke\nnow: I can stand well enough, and I speake well enough\n\n   Gent. Excellent well\n\n   Cas. Why very well then: you must not thinke then,\nthat I am drunke.\nEnter.\n\n  Monta. To th' Platforme (Masters) come, let's set the\nWatch\n\n   Iago. You see this Fellow, that is gone before,\nHe's a Souldier, fit to stand by Caesar,\nAnd giue direction. And do but see his vice,\n'Tis to his vertue, a iust Equinox,\nThe one as long as th' other. 'Tis pittie of him:\nI feare the trust Othello puts him in,\nOn some odde time of his infirmitie\nWill shake this Island\n\n   Mont. But is he often thus?\n  Iago. 'Tis euermore his prologue to his sleepe,\nHe'le watch the Horologe a double Set,\nIf Drinke rocke not his Cradle\n\n   Mont. It were well\nThe Generall were put in mind of it:\nPerhaps he sees it not, or his good nature\nPrizes the vertue that appeares in Cassio,\nAnd lookes not on his euills: is not this true?\nEnter Rodorigo.\n\n  Iago. How now Rodorigo?\nI pray you after the Lieutenant, go\n\n   Mon. And 'tis great pitty, that the Noble Moore\nShould hazard such a Place, as his owne Second\nWith one of an ingraft Infirmitie,\nIt were an honest Action, to say so\nTo the Moore\n\n   Iago. Not I, for this faire Island,\nI do loue Cassio well: and would do much\nTo cure him of this euill, But hearke, what noise?\nEnter Cassio pursuing Rodorigo.\n\n  Cas. You Rogue: you Rascall\n\n   Mon. What's the matter Lieutenant?\n  Cas. A Knaue teach me my dutie? Ile beate the\nKnaue in to a Twiggen-Bottle\n\n   Rod. Beate me?\n  Cas. Dost thou prate, Rogue?\n  Mon. Nay, good Lieutenant:\nI pray you Sir, hold your hand\n\n   Cassio. Let me go (Sir)\nOr Ile knocke you o're the Mazard\n\n   Mon. Come, come: you're drunke\n\n   Cassio. Drunke?\n  Iago. Away I say: go out and cry a Mutinie.\nNay good Lieutenant. Alas Gentlemen:\nHelpe hoa. Lieutenant. Sir Montano:\nHelpe Masters. Heere's a goodly Watch indeed.\nWho's that which rings the Bell: Diablo, hoa:\nThe Towne will rise. Fie, fie Lieutenant,\nYou'le be asham'd for euer.\nEnter Othello, and Attendants.\n\n  Othe. What is the matter heere?\n  Mon. I bleed still, I am hurt to th' death. He dies\n\n   Othe. Hold for your liues\n\n   Iag. Hold hoa: Lieutenant, Sir Montano, Gentlemen:\nHaue you forgot all place of sense and dutie?\nHold. The Generall speaks to you: hold for shame\n\n   Oth. Why how now hoa? From whence ariseth this?\nAre we turn'd Turkes? and to our selues do that\nWhich Heauen hath forbid the Ottamittes.\nFor Christian shame, put by this barbarous Brawle:\nHe that stirs next, to carue for his owne rage,\nHolds his soule light: He dies vpon his Motion.\nSilence that dreadfull Bell, it frights the Isle,\nFrom her propriety. What is the matter, Masters?\nHonest Iago, that lookes dead with greeuing,\nSpeake: who began this? On thy loue I charge thee?\n  Iago. I do not know: Friends all, but now, euen now.\nIn Quarter, and in termes like Bride, and Groome\nDeuesting them for Bed: and then, but now:\n(As if some Planet had vnwitted men)\nSwords out, and tilting one at others breastes,\nIn opposition bloody. I cannot speake\nAny begining to this peeuish oddes.\nAnd would, in Action glorious, I had lost\nThose legges, that brought me to a part of it\n\n   Othe. How comes it (Michaell) you are thus forgot?\n  Cas. I pray you pardon me, I cannot speake\n\n   Othe. Worthy Montano, you were wont to be ciuill:\nThe grauitie, and stillnesse of your youth\nThe world hath noted. And your name is great\nIn mouthes of wisest Censure. What's the matter\nThat you vnlace your reputation thus,\nAnd spend your rich opinion, for the name\nOf a night-brawler? Giue me answer to it\n\n   Mon. Worthy Othello, I am hurt to danger,\nYour Officer Iago, can informe you,\nWhile I spare speech which something now offends me.\nOf all that I do know, nor know I ought\nBy me, that's said, or done amisse this night,\nVnlesse selfe-charitie be sometimes a vice,\nAnd to defend our selues, it be a sinne\nWhen violence assailes vs\n\n   Othe. Now by Heauen,\nMy blood begins my safer Guides to rule,\nAnd passion (hauing my best iudgement collied)\nAssaies to leade the way. If I once stir,\nOr do but lift this Arme, the best of you\nShall sinke in my rebuke. Giue me to know\nHow this foule Rout began: Who set it on,\nAnd he that is approu'd in this offence,\nThough he had twinn'd with me, both at a birth,\nShall loose me. What in a Towne of warre,\nYet wilde, the peoples hearts brim-full of feare,\nTo Manage priuate, and domesticke Quarrell?\nIn night, and on the Court and Guard of safetie?\n'Tis monstrous: Iago, who began't?\n  Mon. If partially Affin'd, or league in office,\nThou dost deliuer more, or lesse then Truth,\nThou art no Souldier\n\n   Iago. Touch me not so neere,\nI had rather haue this tongue cut from my mouth,\nThen it should do offence to Michaell Cassio.\nYet I perswade my selfe, to speake the truth\nShall nothing wrong him. This it is Generall:\nMontano and my selfe being in speech,\nThere comes a Fellow, crying out for helpe,\nAnd Cassio following him with determin'd Sword\nTo execute vpon him. Sir, this Gentleman,\nSteppes in to Cassio, and entreats his pause:\nMy selfe, the crying Fellow did pursue,\nLeast by his clamour (as it so fell out)\nThe Towne might fall in fright. He, (swift of foote)\nOut-ran my purpose: and I return'd then rather\nFor that I heard the clinke, and fall of Swords,\nAnd Cassio high in oath: Which till to night\nI nere might say before. When I came backe\n(For this was briefe) I found them close together\nAt blow, and thrust, euen as againe they were\nWhen you your selfe did part them.\nMore of this matter cannot I report,\nBut Men are Men: The best sometimes forget,\nThough Cassio did some little wrong to him,\nAs men in rage strike those that wish them best,\nYet surely Cassio, I beleeue receiu'd\nFrom him that fled, some strange Indignitie,\nWhich patience could not passe\n\n   Othe. I know Iago\nThy honestie, and loue doth mince this matter,\nMaking it light to Cassio: Cassio, I loue thee,\nBut neuer more be Officer of mine.\nEnter Desdemona attended.\n\nLooke if my gentle Loue be not rais'd vp:\nIle make thee an example\n\n   Des. What is the matter (Deere?)\n  Othe. All's well, Sweeting:\nCome away to bed. Sir for your hurts,\nMy selfe will be your Surgeon. Lead him off:\nIago, looke with care about the Towne,\nAnd silence those whom this vil'd brawle distracted.\nCome Desdemona, 'tis the Soldiers life,\nTo haue their Balmy slumbers wak'd with strife.\nEnter.\n\n  Iago. What are you hurt Lieutenant?\n  Cas. I, past all Surgery\n\n   Iago. Marry Heauen forbid\n\n   Cas. Reputation, Reputation, Reputation: Oh I haue\nlost my Reputation. I haue lost the immortall part of\nmyselfe, and what remaines is bestiall. My Reputation,\nIago, my Reputation\n\n   Iago. As I am an honest man I had thought you had\nreceiued some bodily wound; there is more sence in that\nthen in Reputation. Reputation is an idle, and most false\nimposition; oft got without merit, and lost without deseruing.\nYou haue lost no Reputation at all, vnlesse you\nrepute your selfe such a looser. What man, there are\nmore wayes to recouer the Generall againe. You are\nbut now cast in his moode, (a punishment more in policie,\nthen in malice) euen so as one would beate his offencelesse\ndogge, to affright an Imperious Lyon. Sue to\nhim againe, and he's yours\n\n   Cas. I will rather sue to be despis'd, then to deceiue\nso good a Commander, with so slight, so drunken, and so\nindiscreet an Officer. Drunke? And speake Parrat? And\nsquabble? Swagger? Sweare? And discourse Fustian\nwith ones owne shadow? Oh thou invisible spirit of\nWine, if thou hast no name to be knowne by, let vs call\nthee Diuell\n\n   Iago. What was he that you follow'd with your\nSword? What had he done to you?\n  Cas. I know not\n\n   Iago. Is't possible?\n  Cas. I remember a masse of things, but nothing distinctly:\na Quarrell, but nothing wherefore. Oh, that\nmen should put an Enemie in their mouthes, to steale away\ntheir Braines? that we should with ioy, pleasance,\nreuell and applause, transforme our selues into Beasts\n\n   Iago. Why? But you are now well enough: how\ncame you thus recouered?\n  Cas. It hath pleas'd the diuell drunkennesse, to giue\nplace to the diuell wrath, one vnperfectnesse, shewes me\nanother to make me frankly despise my selfe\n\n   Iago. Come, you are too seuere a Moraller. As the\nTime, the Place, & the Condition of this Country stands\nI could hartily wish this had not befalne: but since it is, as\nit is, mend it for your owne good\n\n   Cas. I will aske him for my Place againe, he shall tell\nme, I am a drunkard: had I as many mouthes as Hydra,\nsuch an answer would stop them all. To be now a sensible\nman, by and by a Foole, and presently a Beast. Oh\nstrange! Euery inordinate cup is vnbless'd, and the Ingredient\nis a diuell\n\n   Iago. Come, come: good wine, is a good familiar\nCreature, if it be well vs'd: exclaime no more against it.\nAnd good Lieutenant, I thinke, you thinke I loue\nyou\n\n   Cassio. I haue well approued it, Sir. I drunke?\n  Iago. You, or any man liuing, may be drunke at a\ntime man. I tell you what you shall do: Our General's\nWife, is now the Generall. I may say so, in this respect,\nfor that he hath deuoted, and giuen vp himselfe to the\nContemplation, marke: and deuotement of her parts\nand Graces. Confesse your selfe freely to her: Importune\nher helpe to put you in your place againe. She is\nof so free, so kinde, so apt, so blessed a disposition,\nshe holds it a vice in her goodnesse, not to do more\nthen she is requested. This broken ioynt betweene\nyou, and her husband, entreat her to splinter. And my\nFortunes against any lay worth naming, this cracke of\nyour Loue, shall grow stronger, then it was before\n\n   Cassio. You aduise me well\n\n   Iago. I protest in the sinceritie of Loue, and honest\nkindnesse\n\n   Cassio. I thinke it freely: and betimes in the morning,\nI will beseech the vertuous Desdemona to vndertake\nfor me: I am desperate of my Fortunes if they check me\n\n   Iago. You are in the right: good night Lieutenant, I\nmust to the Watch\n\n   Cassio. Good night, honest Iago.\n\nExit Cassio.\n\n  Iago. And what's he then,\nThat saies I play the Villaine?\nWhen this aduise is free I giue, and honest,\nProball to thinking, and indeed the course\nTo win the Moore againe.\nFor 'tis most easie\nTh' inclyning Desdemona to subdue\nIn any honest Suite. She's fram'd as fruitefull\nAs the free Elements. And then for her\nTo win the Moore, were to renownce his Baptisme,\nAll Seales, and Simbols of redeemed sin:\nHis Soule is so enfetter'd to her Loue,\nThat she may make, vnmake, do what she list,\nEuen as her Appetite shall play the God,\nWith his weake Function. How am I then a Villaine,\nTo Counsell Cassio to this paralell course,\nDirectly to his good? Diuinitie of hell,\nWhen diuels will the blackest sinnes put on,\nThey do suggest at first with heauenly shewes,\nAs I do now. For whiles this honest Foole\nPlies Desdemona, to repaire his Fortune,\nAnd she for him, pleades strongly to the Moore,\nIle powre this pestilence into his eare:\nThat she repeales him, for her bodies Lust,\nAnd by how much she striues to do him good,\nShe shall vndo her Credite with the Moore.\nSo will I turne her vertue into pitch.\nAnd out of her owne goodnesse make the Net,\nThat shall en-mash them all.\nHow now Rodorigo?\nEnter Rodorigo.\n\n  Rodorigo. I do follow heere in the Chace, not\nlike a Hound that hunts, but one that filles vp the\nCrie. My Money is almost spent; I haue bin to night\nexceedingly well Cudgell'd: And I thinke the issue\nwill bee, I shall haue so much experience for my paines;\nAnd so, with no money at all, and a little more Wit, returne\nagaine to Venice\n\n   Iago. How poore are they that haue not Patience?\nWhat wound did euer heale but by degrees?\nThou know'st we worke by Wit, and not by Witchcraft\nAnd Wit depends on dilatory time:\nDos't not go well? Cassio hath beaten thee,\nAnd thou by that small hurt hath casheer'd Cassio:\nThough other things grow faire against the Sun,\nYet Fruites that blossome first, will first be ripe:\nContent thy selfe, a-while. Introth 'tis Morning;\nPleasure, and Action, make the houres seeme short.\nRetire thee, go where thou art Billited:\nAway, I say, thou shalt know more heereafter:\nNay get thee gone.\n\nExit Roderigo.\n\nTwo things are to be done:\nMy Wife must moue for Cassio to her Mistris:\nIle set her on my selfe, a while, to draw the Moor apart,\nAnd bring him iumpe, when he may Cassio finde\nSoliciting his wife: I, that's the way:\nDull not Deuice, by coldnesse, and delay.\nEnter.\n\n\nActus Tertius. Scena Prima.\n\nEnter Cassio, Musitians, and Clowne.\n\n  Cassio. Masters, play heere, I wil content your paines,\nSomething that's briefe: and bid, goodmorrow General\n\n   Clo. Why Masters, haue your Instruments bin in Naples,\nthat they speake i'th' Nose thus?\n  Mus. How Sir? how?\n  Clo. Are these I pray you, winde Instruments?\n  Mus. I marry are they sir\n\n   Clo. Oh, thereby hangs a tale\n\n   Mus. Whereby hangs a tale, sir?\n  Clow. Marry sir, by many a winde Instrument that I\nknow. But Masters, heere's money for you: and the Generall\nso likes your Musick, that he desires you for loues\nsake to make no more noise with it\n\n   Mus. Well Sir, we will not\n\n   Clo. If you haue any Musicke that may not be heard,\ntoo't againe. But (as they say) to heare Musicke, the Generall\ndo's not greatly care\n\n   Mus. We haue none such, sir\n\n   Clow. Then put vp your Pipes in your bagge, for Ile\naway. Go, vanish into ayre, away.\n\nExit Mu.\n\n  Cassio. Dost thou heare me, mine honest Friend?\n  Clo. No, I heare not your honest Friend:\nI heare you\n\n   Cassio. Prythee keepe vp thy Quillets, ther's a poore\npeece of Gold for thee: if the Gentlewoman that attends\nthe Generall be stirring, tell her, there's one Cassio entreats\nher a little fauour of Speech. Wilt thou do this?\n  Clo. She is stirring sir: if she will stirre hither, I shall\nseeme to notifie vnto her.\n\nExit Clo.\n\nEnter Iago.\n\nIn happy time, Iago\n\n   Iago. You haue not bin a-bed then?\n  Cassio. Why no: the day had broke before we parted.\nI haue made bold (Iago) to send in to your wife:\nMy suite to her is, that she will to vertuous Desdemona\nProcure me some accesse\n\n   Iago. Ile send her to you presently:\nAnd Ile deuise a meane to draw the Moore\nOut of the way, that your conuerse and businesse\nMay be more free.\n\nExit\n\n  Cassio. I humbly thanke you for't. I neuer knew\nA Florentine more kinde, and honest.\nEnter aemilia.\n\nAemil. Goodmorrow (good Lieutenant) I am sorrie\nFor your displeasure: but all will sure be well.\nThe Generall and his wife are talking of it,\nAnd she speakes for you stoutly. The Moore replies,\nThat he you hurt is of great Fame in Cyprus,\nAnd great Affinitie: and that in wholsome Wisedome\nHe might not but refuse you. But he protests he loues you\nAnd needs no other Suitor, but his likings\nTo bring you in againe\n\n   Cassio. Yet I beseech you,\nIf you thinke fit, or that it may be done,\nGiue me aduantage of some breefe Discourse\nWith Desdemon alone.\nAemil. Pray you come in:\nI will bestow you where you shall haue time\nTo speake your bosome freely\n\n   Cassio. I am much bound to you.\n\nScoena Secunda.\n\nEnter Othello, Iago, and Gentlemen.\n\n  Othe. These Letters giue (Iago) to the Pylot,\nAnd by him do my duties to the Senate:\nThat done, I will be walking on the Workes,\nRepaire there to mee\n\n   Iago. Well, my good Lord, Ile doo't\n\n   Oth. This Fortification (Gentlemen) shall we see't?\n  Gent. Well waite vpon your Lordship.\n\nExeunt.\n\nScoena Tertia.\n\nEnter Desdemona, Cassio, and aemilia.\n\n  Des. Be thou assur'd (good Cassio) I will do\nAll my abilities in thy behalfe.\nAemil. Good Madam do:\nI warrant it greeues my Husband,\nAs if the cause were his\n\n   Des. Oh that's an honest Fellow, Do not doubt Cassio\nBut I will haue my Lord, and you againe\nAs friendly as you were\n\n   Cassio. Bounteous Madam,\nWhat euer shall become of Michael Cassio,\nHe's neuer any thing but your true Seruant\n\n   Des. I know't: I thanke you: you do loue my Lord:\nYou haue knowne him long, and be you well assur'd\nHe shall in strangenesse stand no farther off,\nThen in a politique distance\n\n   Cassio. I, but Lady,\nThat policie may either last so long,\nOr feede vpon such nice and waterish diet,\nOr breede it selfe so out of Circumstances,\nThat I being absent, and my place supply'd,\nMy Generall will forget my Loue, and Seruice\n\n   Des. Do not doubt that: before aemilia here,\nI giue thee warrant of thy place. Assure thee,\nIf I do vow a friendship, Ile performe it\nTo the last Article. My Lord shall neuer rest,\nIle watch him tame, and talke him out of patience;\nHis Bed shall seeme a Schoole, his Boord a Shrift,\nIle intermingle euery thing he do's\nWith Cassio's suite: Therefore be merry Cassio,\nFor thy Solicitor shall rather dye,\nThen giue thy cause away.\nEnter Othello, and Iago.\n\nAemil. Madam, heere comes my Lord\n\n   Cassio. Madam, Ile take my leaue\n\n   Des. Why stay, and heare me speake\n\n   Cassio. Madam, not now: I am very ill at ease,\nVnfit for mine owne purposes\n\n   Des. Well, do your discretion.\n\nExit Cassio.\n\n  Iago. Hah? I like not that\n\n   Othel. What dost thou say?\n  Iago. Nothing my Lord; or if- I know not what\n\n   Othel. Was not that Cassio parted from my wife?\n  Iago. Cassio my Lord? No sure, I cannot thinke it\nThat he would steale away so guilty-like,\nSeeing your comming\n\n   Oth. I do beleeue 'twas he\n\n   Des. How now my Lord?\nI haue bin talking with a Suitor heere,\nA man that languishes in your displeasure\n\n   Oth. Who is't you meane?\n  Des. Why your Lieutenant Cassio: Good my Lord,\nIf I haue any grace, or power to moue you,\nHis present reconciliation take.\nFor if he be not one, that truly loues you,\nThat erres in Ignorance, and not in Cunning,\nI haue no iudgement in an honest face.\nI prythee call him backe\n\n   Oth. Went he hence now?\n  Des. I sooth; so humbled,\nThat he hath left part of his greefe with mee\nTo suffer with him. Good Loue, call him backe\n\n   Othel. Not now (sweet Desdemon) some other time\n\n   Des. But shall't be shortly?\n  Oth. The sooner (Sweet) for you\n\n   Des. Shall't be to night, at Supper?\n  Oth. No, not to night\n\n   Des. To morrow Dinner then?\n  Oth. I shall not dine at home:\nI meete the Captaines at the Cittadell\n\n   Des. Why then to morrow night, on Tuesday morne,\nOn Tuesday noone, or night; on Wensday Morne.\nI prythee name the time, but let it not\nExceed three dayes. Infaith hee's penitent:\nAnd yet his Trespasse, in our common reason\n(Saue that they say the warres must make example)\nOut of her best, is not almost a fault\nT' encurre a priuate checke. When shall he come?\nTell me Othello. I wonder in my Soule\nWhat you would aske me, that I should deny,\nOr stand so mam'ring on? What? Michael Cassio,\nThat came a woing with you? and so many a time\n(When I haue spoke of you dispraisingly)\nHath tane your part, to haue so much to do\nTo bring him in? Trust me, I could do much\n\n   Oth. Prythee no more: Let him come when he will:\nI will deny thee nothing\n\n   Des. Why, this is not a Boone:\n'Tis as I should entreate you weare your Gloues,\nOr feede on nourishing dishes, or keepe you warme,\nOr sue to you, to do a peculiar profit\nTo your owne person. Nay, when I haue a suite\nWherein I meane to touch your Loue indeed,\nIt shall be full of poize, and difficult waight,\nAnd fearefull to be granted\n\n   Oth. I will deny thee nothing.\nWhereon, I do beseech thee, grant me this,\nTo leaue me but a little to my selfe\n\n   Des. Shall I deny you? No: farewell my Lord\n\n   Oth. Farewell my Desdemona, Ile come to thee strait\n\n   Des. aemilia come; be as your Fancies teach you:\nWhat ere you be, I am obedient.\nEnter.\n\n  Oth. Excellent wretch: Perdition catch my Soule\nBut I do loue thee: and when I loue thee not,\nChaos is come againe\n\n   Iago. My Noble Lord\n\n   Oth. What dost thou say, Iago?\n  Iago. Did Michael Cassio\nWhen he woo'd my Lady, know of your loue?\n  Oth. He did, from first to last:\nWhy dost thou aske?\n  Iago. But for a satisfaction of my Thought,\nNo further harme\n\n   Oth. Why of thy thought, Iago?\n  Iago. I did not thinke he had bin acquainted with hir\n\n   Oth. O yes, and went betweene vs very oft\n\n   Iago. Indeed?\n  Oth. Indeed? I indeed. Discern'st thou ought in that?\nIs he not honest?\n  Iago. Honest, my Lord?\n  Oth. Honest? I, Honest\n\n   Iago. My Lord, for ought I know\n\n   Oth. What do'st thou thinke?\n  Iago. Thinke, my Lord?\n  Oth. Thinke, my Lord? Alas, thou ecchos't me;\nAs if there were some Monster in thy thought\nToo hideous to be shewne. Thou dost mean somthing:\nI heard thee say euen now, thou lik'st not that,\nWhen Cassio left my wife. What didd'st not like?\nAnd when I told thee, he was of my Counsaile,\nOf my whole course of wooing; thou cried'st, Indeede?\nAnd didd'st contract, and purse thy brow together,\nAs if thou then hadd'st shut vp in thy Braine\nSome horrible Conceite. If thou do'st loue me,\nShew me thy thought\n\n   Iago. My Lord, you know I loue you\n\n   Oth. I thinke thou do'st:\nAnd for I know thou'rt full of Loue, and Honestie,\nAnd weigh'st thy words before thou giu'st them breath,\nTherefore these stops of thine, fright me the more:\nFor such things in a false disloyall Knaue\nAre trickes of Custome: but in a man that's iust,\nThey're close dilations, working from the heart,\nThat Passion cannot rule\n\n   Iago. For Michael Cassio,\nI dare be sworne, I thinke that he is honest\n\n   Oth. I thinke so too\n\n   Iago. Men should be what they seeme,\nOr those that be not, would they might seeme none\n\n   Oth. Certaine, men should be what they seeme\n\n   Iago. Why then I thinke Cassio's an honest man\n\n   Oth. Nay, yet there's more in this?\nI prythee speake to me, as to thy thinkings,\nAs thou dost ruminate, and giue thy worst of thoughts\nThe worst of words\n\n   Iago. Good my Lord pardon me,\nThough I am bound to euery Acte of dutie,\nI am not bound to that: All Slaues are free:\nVtter my Thoughts? Why say, they are vild, and falce?\nAs where's that Palace, whereinto foule things\nSometimes intrude not? Who ha's that breast so pure,\nWherein vncleanly Apprehensions\nKeepe Leetes, and Law-dayes, and in Sessions sit\nWith meditations lawfull?\n  Oth. Thou do'st conspire against thy Friend (Iago)\nIf thou but think'st him wrong'd, and mak'st his eare\nA stranger to thy Thoughts\n\n   Iago. I do beseech you,\nThough I perchance am vicious in my guesse\n(As I confesse it is my Natures plague\nTo spy into Abuses, and of my iealousie\nShapes faults that are not) that your wisedome\nFrom one, that so imperfectly conceits,\nWould take no notice, nor build your selfe a trouble\nOut of his scattering, and vnsure obseruance:\nIt were not for your quiet, nor your good,\nNor for my Manhood, Honesty, and Wisedome,\nTo let you know my thoughts\n\n   Oth. What dost thou meane?\n  Iago. Good name in Man, & woman (deere my Lord)\nIs the immediate Iewell of their Soules;\nWho steales my purse, steales trash:\n'Tis something, nothing;\n'Twas mine, 'tis his, and has bin slaue to thousands:\nBut he that filches from me my good Name,\nRobs me of that, which not enriches him,\nAnd makes me poore indeed\n\n   Oth. Ile know thy Thoughts\n\n   Iago. You cannot, if my heart were in your hand,\nNor shall not, whil'st 'tis in my custodie\n\n   Oth. Ha?\n  Iago. Oh, beware my Lord, of iealousie,\nIt is the greene-ey'd Monster, which doth mocke\nThe meate it feeds on. That Cuckold liues in blisse,\nWho certaine of his Fate, loues not his wronger:\nBut oh, what damned minutes tels he ore,\nWho dotes, yet doubts: Suspects, yet soundly loues?\n  Oth. O miserie\n\n   Iago. Poore, and Content, is rich, and rich enough,\nBut Riches finelesse, is as poore as Winter,\nTo him that euer feares he shall be poore:\nGood Heauen, the Soules of all my Tribe defend\nFrom Iealousie\n\n   Oth. Why? why is this?\nThink'st thou, I'ld make a Life of Iealousie;\nTo follow still the changes of the Moone\nWith fresh suspitions? No: to be once in doubt,\nIs to be resolu'd: Exchange me for a Goat,\nWhen I shall turne the businesse of my Soule\nTo such exufflicate, and blow'd Surmises,\nMatching thy inference. 'Tis not to make me Iealious,\nTo say my wife is faire, feeds well, loues company,\nIs free of Speech, Sings, Playes, and Dances:\nWhere Vertue is, these are more vertuous.\nNor from mine owne weake merites, will I draw\nThe smallest feare, or doubt of her reuolt,\nFor she had eyes, and chose me. No Iago,\nIle see before I doubt; when I doubt, proue;\nAnd on the proofe, there is no more but this,\nAway at once with Loue, or Iealousie\n\n   Ia. I am glad of this: For now I shall haue reason\nTo shew the Loue and Duty that I beare you\nWith franker spirit. Therefore (as I am bound)\nReceiue it from me. I speake not yet of proofe:\nLooke to your wife, obserue her well with Cassio,\nWeare your eyes, thus: not Iealious, nor Secure:\nI would not haue your free, and Noble Nature,\nOut of selfe-Bounty, be abus'd: Looke too't:\nI know our Country disposition well:\nIn Venice, they do let Heauen see the prankes\nThey dare not shew their Husbands.\nTheir best Conscience,\nIs not to leaue't vndone, but kept vnknowne\n\n   Oth. Dost thou say so?\n  Iago. She did deceiue her Father, marrying you,\nAnd when she seem'd to shake, and feare your lookes,\nShe lou'd them most\n\n   Oth. And so she did\n\n   Iago. Why go too then:\nShee that so young could giue out such a Seeming\nTo seele her Fathers eyes vp, close as Oake,\nHe thought 'twas Witchcraft.\nBut I am much too blame:\nI humbly do beseech you of your pardon\nFor too much louing you\n\n   Oth. I am bound to thee for euer\n\n   Iago. I see this hath a little dash'd your Spirits:\n  Oth. Not a iot, not a iot\n\n   Iago. Trust me, I feare it has:\nI hope you will consider what is spoke\nComes from your Loue.\nBut I do see y'are moou'd:\nI am to pray you, not to straine my speech\nTo grosser issues, nor to larger reach,\nThen to Suspition\n\n   Oth. I will not\n\n   Iago. Should you do so (my Lord)\nMy speech should fall into such vilde successe,\nWhich my Thoughts aym'd not.\nCassio's my worthy Friend:\nMy Lord, I see y'are mou'd\n\n   Oth. No, not much mou'd:\nI do not thinke but Desdemona's honest\n\n   Iago. Long liue she so;\nAnd long liue you to thinke so\n\n   Oth. And yet how Nature erring from it selfe\n\n   Iago. I, there's the point:\nAs (to be bold with you)\nNot to affect many proposed Matches\nOf her owne Clime, Complexion, and Degree,\nWhereto we see in all things, Nature tends:\nFoh, one may smel in such, a will most ranke,\nFoule disproportions, Thoughts vnnaturall.\nBut (pardon me) I do not in position\nDistinctly speake of her, though I may feare\nHer will, recoyling to her better iudgement,\nMay fal to match you with her Country formes,\nAnd happily repent\n\n   Oth. Farewell, farewell:\nIf more thou dost perceiue, let me know more:\nSet on thy wife to obserue.\nLeaue me Iago\n\n   Iago. My Lord, I take my leaue\n\n   Othel. Why did I marry?\nThis honest Creature (doubtlesse)\nSees, and knowes more, much more then he vnfolds\n\n   Iago. My Lord, I would I might intreat your Honor\nTo scan this thing no farther: Leaue it to time,\nAlthough 'tis fit that Cassio haue his Place;\nFor sure he filles it vp with great Ability;\nYet if you please, to him off a-while:\nYou shall by that perceiue him, and his meanes:\nNote if your Lady straine his Entertainment\nWith any strong, or vehement importunitie,\nMuch will be seene in that: In the meane time,\nLet me be thought too busie in my feares,\n(As worthy cause I haue to feare I am)\nAnd hold her free, I do beseech your Honor\n\n   Oth. Feare not my gouernment\n\n   Iago. I once more take my leaue.\nEnter.\n\n  Oth. This Fellow's of exceeding honesty,\nAnd knowes all Quantities with a learn'd Spirit\nOf humane dealings. If I do proue her Haggard,\nThough that her Iesses were my deere heart-strings,\nI'ld whistle her off, and let her downe the winde\nTo prey at Fortune. Haply, for I am blacke,\nAnd haue not those soft parts of Conuersation\nThat Chamberers haue: Or for I am declin'd\nInto the vale of yeares (yet that's not much)\nShee's gone. I am abus'd, and my releefe\nMust be to loath her. Oh Curse of Marriage!\nThat we can call these delicate Creatures ours,\nAnd not their Appetites? I had rather be a Toad,\nAnd liue vpon the vapour of a Dungeon,\nThen keepe a corner in the thing I loue\nFor others vses. Yet 'tis the plague to Great-ones,\nPrerogatiu'd are they lesse then the Base,\n'Tis destiny vnshunnable, like death:\nEuen then, this forked plague is Fated to vs,\nWhen we do quicken. Looke where she comes:\nEnter Desdemona and aemilia.\n\nIf she be false, Heauen mock'd it selfe:\nIle not beleeue't\n\n   Des. How now, my deere Othello?\nYour dinner, and the generous Islanders\nBy you inuited, do attend your presence\n\n   Oth. I am too blame\n\n   Des. Why do you speake so faintly?\nAre you not well?\n  Oth. I haue a paine vpon my Forehead, heere\n\n   Des. Why that's with watching, 'twill away againe.\nLet me but binde it hard, within this houre\nIt will be well\n\n   Oth. Your Napkin is too little:\nLet it alone: Come, Ile go in with you.\nEnter.\n\n  Des. I am very sorry that you are not well.\nAemil. I am glad I haue found this Napkin:\nThis was her first remembrance from the Moore,\nMy wayward Husband hath a hundred times\nWoo'd me to steale it. But she so loues the Token,\n(For he coniur'd her, she should euer keepe it)\nThat she reserues it euermore about her,\nTo kisse, and talke too. Ile haue the worke tane out,\nAnd giu't Iago: what he will do with it\nHeauen knowes, not I:\nI nothing, but to please his Fantasie.\nEnter Iago.\n\n  Iago. How now? What do you heere alone?\nAemil. Do not you chide: I haue a thing for you\n\n   Iago. You haue a thing for me?\nIt is a common thing-\nAemil. Hah?\n  Iago. To haue a foolish wife.\nAemil. Oh, is that all? What will you giue me now\nFor that same Handkerchiefe\n\n   Iago. What Handkerchiefe?\nAemil. What Handkerchiefe?\nWhy that the Moore first gaue to Desdemona,\nThat which so often you did bid me steale\n\n   Iago. Hast stolne it from her?\nAemil. No: but she let it drop by negligence,\nAnd to th' aduantage, I being heere, took't vp:\nLooke, heere 'tis\n\n   Iago. A good wench, giue it me.\nAemil. What will you do with't, that you haue bene\nso earnest to haue me filch it?\n  Iago. Why, what is that to you?\nAemil. If it be not for some purpose of import,\nGiu't me againe. Poore Lady, shee'l run mad\nWhen she shall lacke it\n\n   Iago. Be not acknowne on't:\nI haue vse for it. Go, leaue me.\n\nExit aemil.\n\nI will in Cassio's Lodging loose this Napkin,\nAnd let him finde it. Trifles light as ayre,\nAre to the iealious, confirmations strong,\nAs proofes of holy Writ. This may do something.\nThe Moore already changes with my poyson:\nDangerous conceites, are in their Natures poysons,\nWhich at the first are scarse found to distaste:\nBut with a little acte vpon the blood,\nBurne like the Mines of Sulphure. I did say so.\nEnter Othello.\n\nLooke where he comes: Not Poppy, nor Mandragora,\nNor all the drowsie Syrrups of the world\nShall euer medicine thee to that sweete sleepe\nWhich thou owd'st yesterday\n\n   Oth. Ha, ha, false to mee?\n  Iago. Why how now Generall? No more of that\n\n   Oth. Auant, be gone: Thou hast set me on the Racke:\nI sweare 'tis better to be much abus'd,\nThen but to know't a little\n\n   Iago. How now, my Lord?\n  Oth. What sense had I, in her stolne houres of Lust?\nI saw't not, thought it not: it harm'd not me:\nI slept the next night well, fed well, was free, and merrie.\nI found not Cassio's kisses on her Lippes:\nHe that is robb'd, not wanting what is stolne,\nLet him not know't, and he's not robb'd at all\n\n   Iago. I am sorry to heare this?\n  Oth. I had beene happy, if the generall Campe,\nPyoners and all, had tasted her sweet Body,\nSo I had nothing knowne. Oh now, for euer\nFarewell the Tranquill minde; farewell Content;\nFarewell the plumed Troopes, and the bigge Warres,\nThat makes Ambition, Vertue! Oh farewell,\nFarewell the neighing Steed, and the shrill Trumpe,\nThe Spirit-stirring Drum, th' Eare-piercing Fife,\nThe Royall Banner, and all Qualitie,\nPride, Pompe, and Circumstance of glorious Warre:\nAnd O you mortall Engines, whose rude throates\nTh' immortall Ioues dread Clamours, counterfet,\nFarewell: Othello's Occupation's gone\n\n   Iago. Is't possible my Lord?\n  Oth. Villaine, be sure thou proue my Loue a Whore;\nBe sure of it: Giue me the Occular proofe,\nOr by the worth of mine eternall Soule,\nThou had'st bin better haue bin borne a Dog\nThen answer my wak'd wrath\n\n   Iago. Is't come to this?\n  Oth. Make me to see't: or (at the least) so proue it,\nThat the probation beare no Hindge, nor Loope,\nTo hang a doubt on: Or woe vpon thy life\n\n   Iago. My Noble Lord\n\n   Oth. If thou dost slander her, and torture me,\nNeuer pray more: Abandon all remorse\nOn Horrors head, Horrors accumulate:\nDo deeds to make Heauen weepe, all Earth amaz'd;\nFor nothing canst thou to damnation adde,\nGreater then that\n\n   Iago. O Grace! O Heauen forgiue me!\nAre you a Man? Haue you a Soule? or Sense?\nGod buy you: take mine Office. Oh wretched Foole,\nThat lou'st to make thine Honesty, a Vice!\nOh monstrous world! Take note, take note (O World)\nTo be direct and honest, is not safe.\nI thanke you for this profit, and from hence\nIle loue no Friend, sith Loue breeds such offence\n\n   Oth. Nay stay: thou should'st be honest\n\n   Iago. I should be wise; for Honestie's a Foole,\nAnd looses that it workes for\n\n   Oth. By the World,\nI thinke my Wife be honest, and thinke she is not:\nI thinke that thou art iust, and thinke thou art not:\nIle haue some proofe. My name that was as fresh\nAs Dians Visage, is now begrim'd and blacke\nAs mine owne face. If there be Cords, or Kniues,\nPoyson, or Fire, or suffocating streames,\nIle not indure it. Would I were satisfied\n\n   Iago. I see you are eaten vp with Passion:\nI do repent me, that I put it to you.\nYou would be satisfied?\n  Oth. Would? Nay, and I will\n\n   Iago. And may: but how? How satisfied, my Lord?\nWould you the super-vision grossely gape on?\nBehold her top'd?\n  Oth. Death, and damnation. Oh!\n  Iago. It were a tedious difficulty, I thinke,\nTo bring them to that Prospect: Damne them then,\nIf euer mortall eyes do see them boulster\nMore then their owne. What then? How then?\nWhat shall I say? Where's Satisfaction?\nIt is impossible you should see this,\nWere they as prime as Goates, as hot as Monkeyes,\nAs salt as Wolues in pride, and Fooles as grosse\nAs Ignorance, made drunke. But yet, I say,\nIf imputation, and strong circumstances,\nWhich leade directly to the doore of Truth,\nWill giue you satisfaction, you might haue't\n\n   Oth. Giue me a liuing reason she's disloyall\n\n   Iago. I do not like the Office.\nBut sith I am entred in this cause so farre\n(Prick'd too't by foolish Honesty, and Loue)\nI will go on. I lay with Cassio lately,\nAnd being troubled with a raging tooth,\nI could not sleepe. There are a kinde of men,\nSo loose of Soule, that in their sleepes will mutter\nTheir Affayres: one of this kinde is Cassio:\nIn sleepe I heard him say, sweet Desdemona,\nLet vs be wary, let vs hide our Loues,\nAnd then (Sir) would he gripe, and wring my hand:\nCry, oh sweet Creature: then kisse me hard,\nAs if he pluckt vp kisses by the rootes,\nThat grew vpon my lippes, laid his Leg ore my Thigh,\nAnd sigh, and kisse, and then cry cursed Fate,\nThat gaue thee to the Moore\n\n   Oth. O monstrous! monstrous!\n  Iago. Nay, this was but his Dreame\n\n   Oth. But this denoted a fore-gone conclusion,\n'Tis a shrew'd doubt, though it be but a Dreame\n\n   Iago. And this may helpe to thicken other proofes,\nThat do demonstrate thinly\n\n   Oth. Ile teare her all to peeces\n\n   Iago. Nay yet be wise; yet we see nothing done,\nShe may be honest yet: Tell me but this,\nHaue you not sometimes seene a Handkerchiefe\nSpotted with Strawberries, in your wiues hand?\n  Oth. I gaue her such a one: 'twas my first gift\n\n   Iago. I know not that: but such a Handkerchiefe\n(I am sure it was your wiues) did I to day\nSee Cassio wipe his Beard with\n\n   Oth. If it be that\n\n   Iago. If it be that, or any, it was here.\nIt speakes against her with the other proofes\n\n   Othel. O that the Slaue had forty thousand liues:\nOne is too poore, too weake for my reuenge.\nNow do I see 'tis true. Looke heere Iago,\nAll my fond loue thus do I blow to Heauen. 'Tis gone.\nArise blacke vengeance, from the hollow hell,\nYeeld vp (O Loue) thy Crowne, and hearted Throne\nTo tyrannous Hate. Swell bosome with thy fraught,\nFor 'tis of Aspickes tongues\n\n   Iago. Yet be content\n\n   Oth. Oh blood, blood, blood\n\n   Iago. Patience I say: your minde may change\n\n   Oth. Neuer Iago. Like to the Ponticke Sea,\nWhose Icie Current, and compulsiue course,\nNeu'r keepes retyring ebbe, but keepes due on\nTo the Proponticke, and the Hellespont:\nEuen so my bloody thoughts, with violent pace\nShall neu'r looke backe, neu'r ebbe to humble Loue,\nTill that a capeable, and wide Reuenge\nSwallow them vp. Now by yond Marble Heauen,\nIn the due reuerence of a Sacred vow,\nI heere engage my words\n\n   Iago. Do not rise yet:\nWitnesse you euer-burning Lights aboue,\nYou Elements, that clip vs round about,\nWitnesse that heere Iago doth giue vp\nThe execution of his wit, hands, heart,\nTo wrong'd Othello's Seruice. Let him command,\nAnd to obey shall be in me remorse,\nWhat bloody businesse euer\n\n   Oth. I greet thy loue,\nNot with vaine thanks, but with acceptance bounteous,\nAnd will vpon the instant put thee too't.\nWithin these three dayes let me heare thee say,\nThat Cassio's not aliue\n\n   Iago. My Friend is dead:\n'Tis done at your Request.\nBut let her liue\n\n   Oth. Damne her lewde Minx:\nO damne her, damne her.\nCome go with me a-part, I will withdraw\nTo furnish me with some swift meanes of death\nFor the faire Diuell.\nNow art thou my Lieutenant\n\n   Iago. I am your owne for euer.\n\nExeunt.\n\n\nScaena Quarta.\n\nEnter Desdemona, aemilia, and Clown.\n\n  Des. Do you know Sirrah, where Lieutenant Cassio\nlyes?\n  Clow. I dare not say he lies any where\n\n   Des. Why man?\n  Clo. He's a Soldier, and for me to say a Souldier lyes,\n'tis stabbing\n\n   Des. Go too: where lodges he?\n  Clo. To tell you where he lodges, is to tel you where\nI lye\n\n   Des. Can any thing be made of this?\n  Clo. I know not where he lodges, and for mee to deuise\na lodging, and say he lies heere, or he lies there, were\nto lye in mine owne throat\n\n   Des. Can you enquire him out? and be edified by report?\n  Clo. I will Catechize the world for him, that is, make\nQuestions, and by them answer\n\n   Des. Seeke him, bidde him come hither: tell him, I\nhaue moou'd my Lord on his behalfe, and hope all will\nbe well\n\n   Clo. To do this, is within the compasse of mans Wit,\nand therefore I will attempt the doing it.\n\nExit Clo.\n\n  Des. Where should I loose the Handkerchiefe, aemilia?\nAemil. I know not Madam\n\n   Des. Beleeue me, I had rather haue lost my purse\nFull of Cruzadoes. And but my Noble Moore\nIs true of minde, and made of no such basenesse,\nAs iealious Creatures are, it were enough\nTo put him to ill-thinking.\nAemil. Is he not iealious?\n  Des. Who, he? I thinke the Sun where he was borne,\nDrew all such humors from him.\nAemil. Looke where he comes.\nEnter Othello.\n\n  Des. I will not leaue him now, till Cassio be\nCall'd to him. How is't with you, my Lord?\n  Oth. Well my good Lady. Oh hardnes to dissemble!\nHow do you, Desdemona?\n  Des. Well, my good Lord\n\n   Oth. Giue me your hand.\nThis hand is moist, my Lady\n\n   Des. It hath felt no age, nor knowne no sorrow\n\n   Oth. This argues fruitfulnesse, and liberall heart:\nHot, hot, and moyst. This hand of yours requires\nA sequester from Liberty: Fasting, and Prayer,\nMuch Castigation, Exercise deuout,\nFor heere's a yong, and sweating Diuell heere\nThat commonly rebels: 'Tis a good hand,\nA franke one\n\n   Des. You may (indeed) say so:\nFor 'twas that hand that gaue away my heart\n\n   Oth. A liberall hand. The hearts of old, gaue hands:\nBut our new Heraldry is hands, not hearts\n\n   Des. I cannot speake of this:\nCome, now your promise\n\n   Oth. What promise, Chucke?\n  Des. I haue sent to bid Cassio come speake with you\n\n   Oth. I haue a salt and sorry Rhewme offends me:\nLend me thy Handkerchiefe\n\n   Des. Heere my Lord\n\n   Oth. That which I gaue you\n\n   Des. I haue it not about me\n\n   Oth. Not?\n  Des. No indeed, my Lord\n\n   Oth. That's a fault: That Handkerchiefe\nDid an aegyptian to my Mother giue:\nShe was a Charmer, and could almost read\nThe thoughts of people. She told her, while she kept it,\n'T would make her Amiable, and subdue my Father\nIntirely to her loue: But if she lost it,\nOr made a Guift of it, my Fathers eye\nShould hold her loathed, and his Spirits should hunt\nAfter new Fancies. She dying, gaue it me,\nAnd bid me (when my Fate would haue me Wiu'd)\nTo giue it her. I did so; and take heede on't,\nMake it a Darling, like your precious eye:\nTo loose't, or giue't away, were such perdition,\nAs nothing else could match\n\n   Des. Is't possible?\n  Oth. 'Tis true: There's Magicke in the web of it:\nA Sybill that had numbred in the world\nThe Sun to course, two hundred compasses,\nIn her Prophetticke furie sow'd the Worke:\nThe Wormes were hallowed, that did breede the Silke,\nAnd it was dyde in Mummey, which the Skilfull\nConseru'd of Maidens hearts\n\n   Des. Indeed? Is't true?\n  Oth. Most veritable, therefore looke too't well\n\n   Des. Then would to Heauen, that I had neuer seene't?\n  Oth. Ha? wherefore?\n  Des. Why do you speake so startingly, and rash?\n  Oth. Is't lost? Is't gon? Speak, is't out o'th' way?\n  Des. Blesse vs\n\n   Oth. Say you?\n  Des. It is not lost: but what and if it were?\n  Oth. How?\n  Des. I say it is not lost\n\n   Oth. Fetcht, let me see't\n\n   Des. Why so I can: but I will not now:\nThis is a tricke to put me from my suite,\nPray you let Cassio be receiu'd againe\n\n   Oth. Fetch me the Handkerchiefe,\nMy minde mis-giues\n\n   Des. Come, come: you'l neuer meete a more sufficient\nman\n\n   Oth. The Handkerchiefe\n\n   Des. A man that all his time\nHath founded his good Fortunes on your loue;\nShar'd dangers with you\n\n   Oth. The Handkerchiefe\n\n   Des. Insooth, you are too blame\n\n   Oth. Away.\n\nExit Othello.\n\nAemil. Is not this man iealious?\n  Des. I neu'r saw this before.\nSure, there's some wonder in this Handkerchiefe,\nI am most vnhappy in the losse of it.\nAemil. 'Tis not a yeare or two shewes vs a man:\nThey are all but Stomackes, and we all but Food,\nThey eate vs hungerly, and when they are full\nThey belch vs.\nEnter Iago, and Cassio.\n\nLooke you, Cassio and my Husband\n\n   Iago. There is no other way: 'tis she must doo't:\nAnd loe the happinesse: go, and importune her\n\n   Des. How now (good Cassio) what's the newes with\nyou?\n  Cassio. Madam, my former suite. I do beseech you,\nThat by your vertuous meanes, I may againe\nExist, and be a member of his loue,\nWhom I, with all the Office of my heart\nIntirely honour, I would not be delayd.\nIf my offence, be of such mortall kinde,\nThat nor my Seruice past, nor present Sorrowes,\nNor purpos'd merit in futurity,\nCan ransome me into his loue againe,\nBut to know so, must be my benefit:\nSo shall I cloath me in a forc'd content,\nAnd shut my selfe vp in some other course\nTo Fortunes Almes\n\n   Des. Alas (thrice-gentle Cassio)\nMy Aduocation is not now in Tune;\nMy Lord, is not my Lord; nor should I know him,\nWere he in Fauour, as in Humour alter'd.\nSo helpe me euery spirit sanctified,\nAs I haue spoken for you all my best,\nAnd stood within the blanke of his displeasure\nFor my free speech. You must awhile be patient:\nWhat I can do, I will: and more I will\nThen for my selfe, I dare. Let that suffice you\n\n   Iago. Is my Lord angry?\nAemil. He went hence but now:\nAnd certainly in strange vnquietnesse\n\n   Iago. Can he be angry? I haue seen the Cannon\nWhen it hath blowne his Rankes into the Ayre,\nAnd like the Diuell from his very Arme\nPuff't his owne Brother: And is he angry?\nSomething of moment then: I will go meet him,\nThere's matter in't indeed, if he be angry.\n\nExit\n\n  Des. I prythee do so. Something sure of State,\nEither from Venice, or some vnhatch'd practise\nMade demonstrable heere in Cyprus, to him,\nHath pudled his cleare Spirit: and in such cases,\nMens Natures wrangle with inferiour things,\nThough great ones are their obiect. 'Tis euen so.\nFor let our finger ake, and it endues\nOur other healthfull members, euen to a sense\nOf paine. Nay, we must thinke men are not Gods,\nNor of them looke for such obseruancie\nAs fits the Bridall. Beshrew me much, aemilia,\nI was (vnhandsome Warrior, as I am)\nArraigning his vnkindnesse with my soule:\nBut now I finde, I had suborn'd the Witnesse,\nAnd he's Indited falsely.\nAemil. Pray heauen it bee\nState matters, as you thinke, and no Conception,\nNor no Iealious Toy, concerning you\n\n   Des. Alas the day, I neuer gaue him cause.\nAemil. But Iealious soules will not be answer'd so;\nThey are not euer iealious for the cause,\nBut iealious, for they're iealious. It is a Monster\nBegot vpon it selfe, borne on it selfe\n\n   Des. Heauen keepe the Monster from Othello's mind.\nAemil. Lady, Amen\n\n   Des. I will go seeke him. Cassio, walke heere about:\nIf I doe finde him fit, Ile moue your suite,\nAnd seeke to effect it to my vttermost.\n\nExit\n\n  Cas. I humbly thanke your Ladyship.\nEnter Bianca.\n\n  Bian. 'Saue you (Friend Cassio.)\n  Cassio. What make you from home?\nHow is't with you, my most faire Bianca?\nIndeed (sweet Loue) I was comming to your house\n\n   Bian. And I was going to your Lodging, Cassio.\nWhat? keepe a weeke away? Seuen dayes, and Nights?\nEight score eight houres? And Louers absent howres\nMore tedious then the Diall, eight score times?\nOh weary reck'ning\n\n   Cassio. Pardon me, Bianca:\nI haue this while with leaden thoughts beene prest,\nBut I shall in a more continuate time\nStrike off this score of absence. Sweet Bianca\nTake me this worke out\n\n   Bianca. Oh Cassio, whence came this?\nThis is some Token from a newer Friend,\nTo the felt-Absence: now I feele a Cause:\nIs't come to this? Well, well\n\n   Cassio. Go too, woman:\nThrow your vilde gesses in the Diuels teeth,\nFrom whence you haue them. You are iealious now,\nThat this is from some Mistris, some remembrance;\nNo, in good troth Bianca\n\n   Bian. Why, who's is it?\n  Cassio. I know not neither:\nI found it in my Chamber,\nI like the worke well; Ere it be demanded\n(As like enough it will) I would haue it coppied:\nTake it, and doo't, and leaue me for this time\n\n   Bian. Leaue you? Wherefore?\n  Cassio. I do attend heere on the Generall,\nAnd thinke it no addition, nor my wish\nTo haue him see me woman'd\n\n   Bian. Why, I pray you?\n  Cassio. Not that I loue you not\n\n   Bian. But that you do not loue me.\nI pray you bring me on the way a little,\nAnd say, if I shall see you soone at night?\n  Cassio. 'Tis but a little way that I can bring you,\nFor I attend heere: But Ile see you soone\n\n   Bian. 'Tis very good: I must be circumstanc'd.\n\nExeunt. omnes.\n\n\nActus Quartus. Scena Prima.\n\nEnter Othello, and Iago.\n\n  Iago. Will you thinke so?\n  Oth. Thinke so, Iago?\n  Iago. What, to kisse in priuate?\n  Oth. An vnauthoriz'd kisse?\n  Iago. Or to be naked with her Friend in bed,\nAn houre, or more, not meaning any harme?\n  Oth. Naked in bed (Iago) and not meane harme?\nIt is hypocrisie against the Diuell:\nThey that meane vertuously, and yet do so,\nThe Diuell their vertue tempts, and they tempt Heauen\n\n   Iago. If they do nothing, 'tis a Veniall slip:\nBut if I giue my wife a Handkerchiefe\n\n   Oth. What then?\n  Iago. Why then 'tis hers (my Lord) and being hers,\nShe may (I thinke) bestow't on any man\n\n   Oth. She is Protectresse of her honor too:\nMay she giue that?\n  Iago. Her honor is an Essence that's not seene,\nThey haue it very oft, that haue it not.\nBut for the Handkerchiefe\n\n   Othe. By heauen, I would most gladly haue forgot it:\nThou saidst (oh, it comes ore my memorie,\nAs doth the Rauen o're the infectious house:\nBoading to all) he had my Handkerchiefe\n\n   Iago . I: what of that?\n  Othe. That's not so good now\n\n   Iag. What if I had said, I had seene him do you wrong?\nOr heard him say (as Knaues be such abroad,\nWho hauing by their owne importunate suit,\nOr voluntary dotage of some Mistris,\nConuinced or supply'd them, cannot chuse\nBut they must blab.)\n  Oth. Hath he said any thing?\n  Iago. He hath (my Lord) but be you well assur'd,\nNo more then he'le vn-sweare\n\n   Oth. What hath he said?\n  Iago. Why, that he did: I know not what he did\n\n   Othe. What? What?\n  Iago. Lye\n\n   Oth. With her?\n  Iago. With her? On her: what you will\n\n   Othe. Lye with her? lye on her? We say lye on her,\nwhen they be-lye-her. Lye with her: that's fullsome:\nHandkerchiefe: Confessions: Handkerchiefe. To confesse,\nand be hang'd for his labour. First, to be hang'd,\nand then to confesse: I tremble at it. Nature would not\ninuest her selfe in such shadowing passion, without some\nInstruction. It is not words that shakes me thus, (pish)\nNoses, Eares, and Lippes: is't possible. Confesse? Handkerchiefe?\nO diuell.\n\nFalls in a Traunce.\n\n  Iago. Worke on,\nMy Medicine workes. Thus credulous Fooles are caught,\nAnd many worthy, and chast Dames euen thus,\n(All guiltlesse) meete reproach: what hoa? My Lord?\nMy Lord, I say: Othello.\nEnter Cassio.\n\nHow now Cassio?\n  Cas. What's the matter?\n  Iago. My Lord is falne into an Epilepsie,\nThis is his second Fit: he had one yesterday\n\n   Cas. Rub him about the Temples\n\n   Iago. The Lethargie must haue his quyet course:\nIf not, he foames at mouth: and by and by\nBreakes out to sauage madnesse. Looke, he stirres:\nDo you withdraw your selfe a little while,\nHe will recouer straight: when he is gone,\nI would on great occasion, speake with you.\nHow is it Generall? Haue you not hurt your head?\n  Othe. Dost thou mocke me?\n  Iago. I mocke you not, by Heauen:\nWould you would beare your Fortune like a Man\n\n   Othe. A Horned man's a Monster, and a Beast\n\n   Iago. Ther's many a Beast then in a populous Citty,\nAnd many a ciuill Monster\n\n   Othe. Did he confesse it?\n  Iago. Good Sir, be a man:\nThinke euery bearded fellow that's but yoak'd\nMay draw with you. There's Millions now aliue,\nThat nightly lye in those vnproper beds,\nWhich they dare sweare peculiar. Your case is better.\nOh, 'tis the spight of hell, the Fiends Arch-mock,\nTo lip a wanton in a secure Cowch;\nAnd to suppose her chast. No, let me know,\nAnd knowing what I am, I know what she shallbe\n\n   Oth. Oh, thou art wise: 'tis certaine\n\n   Iago. Stand you a while apart,\nConfine your selfe but in a patient List,\nWhil'st you were heere, o're-whelmed with your griefe\n(A passion most resulting such a man)\nCassio came hither: I shifted him away,\nAnd layd good scuses vpon your Extasie,\nBad him anon returne: and heere speake with me,\nThe which he promis'd. Do but encaue your selfe,\nAnd marke the Fleeres, the Gybes, and notable Scornes\nThat dwell in euery Region of his face.\nFor I will make him tell the Tale anew;\nWhere, how, how oft, how long ago, and when\nHe hath, and is againe to cope your wife.\nI say, but marke his gesture: marry Patience,\nOr I shall say y'are all in all in Spleene,\nAnd nothing of a man\n\n   Othe. Do'st thou heare, Iago,\nI will be found most cunning in my Patience:\nBut (do'st thou heare) most bloody\n\n   Iago. That's not amisse,\nBut yet keepe time in all: will you withdraw?\nNow will I question Cassio of Bianca,\nA Huswife that by selling her desires\nBuyes her selfe Bread, and Cloath. It is a Creature\nThat dotes on Cassio, (as 'tis the Strumpets plague\nTo be-guile many, and be be-guil'd by one)\nHe, when he heares of her, cannot restraine\nFrom the excesse of Laughter. Heere he comes.\nEnter Cassio.\n\nAs he shall smile, Othello shall go mad:\nAnd his vnbookish Ielousie must conserue\nPoore Cassio's smiles, gestures, and light behauiours\nQuite in the wrong. How do you Lieutenant?\n  Cas. The worser, that you giue me the addition,\nWhose want euen killes me\n\n   Iago. Ply Desdemona well, and you are sure on't:\nNow, if this Suit lay in Bianca's dowre,\nHow quickely should you speed?\n  Cas. Alas poore Caitiffe\n\n   Oth. Looke how he laughes already\n\n   Iago. I neuer knew woman loue man so\n\n   Cas. Alas poore Rogue, I thinke indeed she loues me\n\n   Oth. Now he denies it faintly: and laughes it out\n\n   Iago. Do you heare Cassio?\n  Oth. Now he importunes him\nTo tell it o're: go too, well said, well said\n\n   Iago. She giues it out, that you shall marry her.\nDo you intend it?\n  Cas. Ha, ha, ha\n\n   Oth. Do ye triumph, Romaine? do you triumph?\n  Cas. I marry. What? A customer; prythee beare\nSome Charitie to my wit, do not thinke it\nSo vnwholesome. Ha, ha, ha\n\n   Oth. So, so, so, so: they laugh, that winnes\n\n   Iago. Why the cry goes, that you marry her\n\n   Cas. Prythee say true\n\n   Iago. I am a very Villaine else\n\n   Oth. Haue you scoar'd me? Well\n\n   Cas. This is the Monkeys owne giuing out:\nShe is perswaded I will marry her\nOut of her owne loue & flattery, not out of my promise\n\n   Oth. Iago becomes me: now he begins the story\n\n   Cassio. She was heere euen now: she haunts me in euery\nplace. I was the other day talking on the Seabanke\nwith certaine Venetians, and thither comes the\nBauble, and falls me thus about my neck\n\n   Oth. Crying oh deere Cassio, as it were: his iesture imports\nit\n\n   Cassio. So hangs, and lolls, and weepes vpon me:\nSo shakes, and pulls me. Ha, ha, ha\n\n   Oth. Now he tells how she pluckt him to my Chamber:\noh, I see that nose of yours, but not that dogge, I\nshall throw it to\n\n   Cassio. Well, I must leaue her companie\n\n   Iago. Before me: looke where she comes.\nEnter Bianca.\n\n  Cas. 'Tis such another Fitchew: marry a perfum'd one?\nWhat do you meane by this haunting of me?\n  Bian. Let the diuell, and his dam haunt you: what\ndid you meane by that same Handkerchiefe, you gaue\nme euen now? I was a fine Foole to take it: I must take\nout the worke? A likely piece of worke, that you should\nfinde it in your Chamber, and know not who left it there.\nThis is some Minxes token, & I must take out the worke?\nThere, giue it your Hobbey-horse, wheresoeuer you had\nit, Ile take out no worke on't\n\n   Cassio. How now, my sweete Bianca?\nHow now? How now?\n  Othe. By Heauen, that should be my Handkerchiefe\n\n   Bian. If you'le come to supper to night you may, if\nyou will not come when you are next prepar'd for.\n\nExit\n\n  Iago. After her: after her\n\n   Cas. I must, shee'l rayle in the streets else\n\n   Iago. Will you sup there?\n  Cassio. Yes, I intend so\n\n   Iago. Well, I may chance to see you: for I would very\nfaine speake with you\n\n   Cas. Prythee come: will you?\n  Iago. Go too; say no more\n\n   Oth. How shall I murther him, Iago\n\n   Iago. Did you perceiue how he laugh'd at his vice?\n  Oth. Oh, Iago\n\n   Iago. And did you see the Handkerchiefe?\n  Oth. Was that mine?\n  Iago. Yours by this hand: and to see how he prizes\nthe foolish woman your wife: she gaue it him and, he\nhath giu'n it his whore\n\n   Oth. I would haue him nine yeeres a killing:\nA fine woman, a faire woman, a sweete woman?\n  Iago. Nay, you must forget that\n\n   Othello. I, let her rot and perish, and be damn'd to\nnight, for she shall not liue. No, my heart is turn'd to\nstone: I strike it, and it hurts my hand. Oh, the world\nhath not a sweeter Creature: she might lye by an Emperours\nside, and command him Taskes\n\n   Iago. Nay, that's not your way\n\n   Othe. Hang her, I do but say what she is: so delicate\nwith her Needle: an admirable Musitian. Oh she will\nsing the Sauagenesse out of a Beare: of so high and plenteous\nwit, and inuention?\n  Iago. She's the worse for all this\n\n   Othe. Oh, a thousand, a thousand times:\nAnd then of so gentle a condition?\n  Iago. I too gentle\n\n   Othe. Nay that's certaine:\nBut yet the pitty of it, Iago: oh Iago, the pitty of it\nIago\n\n   Iago. If you are so fond ouer her iniquitie: giue her\npattent to offend, for if it touch not you, it comes neere\nno body\n\n   Oth. I will chop her into Messes: Cuckold me?\n  Iago. Oh, 'tis foule in her\n\n   Oth. With mine Officer?\n  Iago. That's fouler\n\n   Othe. Get me some poyson, Iago, this night. Ile not\nexpostulate with her: least her body and beautie vnprouide\nmy mind againe: this night Iago\n\n   Iago. Do it not with poyson, strangle her in her bed,\nEuen the bed she hath contaminated\n\n   Oth. Good, good:\nThe Iustice of it pleases: very good\n\n   Iago. And for Cassio, let me be his vndertaker:\nYou shall heare more by midnight.\nEnter Lodouico, Desdemona, and Attendants.\n\n  Othe. Excellent good: What Trumpet is that same?\n  Iago. I warrant something from Venice,\n'Tis Lodouico, this, comes from the Duke.\nSee, your wife's with him\n\n   Lodo. Saue you worthy Generall\n\n   Othe. With all my heart Sir\n\n   Lod. The Duke, and the Senators of Venice greet you\n\n   Othe. I kisse the Instrument of their pleasures\n\n   Des. And what's the newes, good cozen Lodouico\n  Iago. I am very glad to see you Signior:\nWelcome to Cyprus\n\n   Lod. I thanke you: how do's Lieutenant Cassio?\n  Iago. Liues Sir,\n  Des. Cozen, there's falne betweene him, & my Lord,\nAn vnkind breach: but you shall make all well\n\n   Othe. Are you sure of that?\n  Des. My Lord?\n  Othe. This faile you not to do, as you will-\n  Lod. He did not call: he's busie in the paper,\nIs there deuision 'twixt my Lord, and Cassio?\n  Des. A most vnhappy one: I would do much\nT' attone, them, for the loue I beare to Cassio\n\n   Oth. Fire, and brimestone\n\n   Des. My Lord\n\n   Oth. Are you wise?\n  Des. What is he angrie?\n  Lod. May be the Letter mou'd him.\nFor as I thinke, they do command him home,\nDeputing Cassio in his Gouernment\n\n   Des. Trust me, I am glad on't\n\n   Othe. Indeed?\n  Des. My Lord?\n  Othe. I am glad to see you mad\n\n   Des. Why, sweete Othello?\n  Othe. Diuell\n\n   Des. I haue not deseru'd this\n\n   Lod. My Lord, this would not be beleeu'd in Venice,\nThough I should sweare I saw't. 'Tis very much,\nMake her amends: she weepes\n\n   Othe. Oh diuell, diuell:\nIf that the Earth could teeme with womans teares,\nEach drop she falls, would proue a Crocodile:\nOut of my sight\n\n   Des. I will not stay to offend you\n\n   Lod. Truely obedient Lady:\nI do beseech your Lordship call her backe\n\n   Othe. Mistris\n\n   Des. My Lord\n\n   Othe. What would you with her, Sir?\n  Lod. Who I, my Lord?\n  Othe. I, you did wish, that I would make her turne:\nSir, she can turne, and turne: and yet go on\nAnd turne againe. And she can weepe, Sir, weepe.\nAnd she's obedient: as you say obedient.\nVery obedient: proceed you in your teares.\nConcerning this Sir, (oh well-painted passion)\nI am commanded home: get you away:\nIle send for you anon. Sir I obey the Mandate,\nAnd will returne to Venice. Hence, auaunt:\nCassio shall haue my Place. And Sir, to night\nI do entreat, that we may sup together.\nYou are welcome Sir to Cyprus.\nGoates, and Monkeys.\nEnter.\n\n  Lod. Is this the Noble Moore, whom our full Senate\nCall all in all sufficient? Is this the Nature\nWhom Passion could not shake? Whose solid vertue\nThe shot of Accident, nor dart of Chance\nCould neither graze, nor pierce?\n  Iago. He is much chang'd\n\n   Lod. Are his wits safe? Is he not light of Braine?\n  Iago. He's that he is: I may not breath my censure.\nWhat he might be: if what he might, he is not,\nI would to heauen he were\n\n   Lod. What? Strike his wife?\n  Iago. 'Faith that was not so well: yet would I knew\nThat stroke would proue the worst\n\n   Lod. Is it his vse?\nOr did the Letters, worke vpon his blood,\nAnd new create his fault?\n  Iago. Alas, alas:\nIt is not honestie in me to speake\nWhat I haue seene, and knowne. You shall obserue him,\nAnd his owne courses will denote him so,\nThat I may saue my speech: do but go after\nAnd marke how he continues\n\n   Lod. I am sorry that I am deceiu'd in him.\n\nExeunt.\n\n\nScena Secunda.\n\nEnter Othello and aemilia.\n\n  Othe. You haue seene nothing then?\nAemil. Nor euer heard: nor euer did suspect\n\n   Othe. Yes, you haue seene Cassio, and she together\n\n   Aemi. But then I saw no harme: and then I heard,\nEach syllable that breath made vp betweene them\n\n   Othe. What? Did they neuer whisper?\nAemil. Neuer my Lord\n\n   Othe. Nor send you out o'th' way?\nAemil. Neuer\n\n   Othe. To fetch her Fan, her Gloues, her Mask, nor nothing?\nAemil. Neuer my Lord\n\n   Othe. That's strange.\nAemil. I durst (my Lord) to wager, she is honest:\nLay downe my Soule at stake: If you thinke other,\nRemoue your thought. It doth abuse your bosome:\nIf any wretch haue put this in your head,\nLet Heauen requit it with the Serpents curse,\nFor if she be not honest, chaste, and true,\nThere's no man happy. The purest of their Wiues\nIs foule as Slander\n\n   Othe. Bid her come hither: go.\n\nExit aemilia.\n\nShe saies enough: yet she's a simple Baud\nThat cannot say as much. This is a subtile Whore:\nA Closset Locke and Key of Villanous Secrets,\nAnd yet she'le kneele, and pray: I haue seene her do't.\nEnter Desdemona, and aemilia.\n\n  Des. My Lord, what is your will?\n  Othe. Pray you Chucke come hither\n\n   Des. What is your pleasure?\n  Oth. Let me see your eyes: looke in my face\n\n   Des. What horrible Fancie's this?\n  Othe. Some of your Function Mistris:\nLeaue Procreants alone, and shut the doore:\nCough, or cry hem; if any body come:\nYour Mystery, your Mystery: May dispatch.\n\nExit aemi.\n\n  Des. Vpon my knee, what doth your speech import?\nI vnderstand a Fury in your words\n\n   Othe. Why? What art thou?\n  Des. Your wife my Lord: your true and loyall wife\n\n   Othello. Come sweare it: damne thy selfe, least\nbeing like one of Heauen, the diuells themselues should\nfeare to ceaze thee. Therefore be double damn'd: sweare\nthou art honest\n\n   Des. Heauen doth truely know it\n\n   Othe. Heauen truely knowes, that thou art false as hell\n\n   Des. To whom my Lord?\nWith whom? How am I false?\n  Othe. Ah Desdemon, away, away, away\n\n   Des. Alas the heauy day: why do you weepe?\nAm I the motiue of these teares my Lord?\nIf happely you my Father do suspect,\nAn Instrument of this your calling backe,\nLay not your blame on me: if you haue lost him,\nI haue lost him too\n\n   Othe. Had it pleas'd Heauen,\nTo try me with Affliction, had they rain'd\nAll kind of Sores, and Shames on my bare-head:\nSteep'd me in pouertie to the very lippes.\nGiuen to Captiuitie, me, and my vtmost hopes,\nI should haue found in some place of my Soule\nA drop of patience. But alas, to make me\nThe fixed Figure for the time of Scorne,\nTo point his slow, and mouing finger at.\nYet could I beare that too, well, very well:\nBut there where I haue garnerd vp my heart,\nWhere either I must liue, or beare no life,\nThe Fountaine from the which my currant runnes,\nOr else dries vp: to be discarded thence,\nOr keepe it as a Cesterne, for foule Toades\nTo knot and gender in. Turne thy complexion there:\nPatience, thou young and Rose-lip'd Cherubin,\nI heere looke grim as hell\n\n   Des. I hope my Noble Lord esteemes me honest\n\n   Othe. Oh I, as Sommer Flyes are in the Shambles,\nThat quicken euen with blowing. Oh thou weed:\nWho art so louely faire, and smell'st so sweete,\nThat the Sense akes at thee,\nWould thou had'st neuer bin borne\n\n   Des. Alas, what ignorant sin haue I committed?\n  Othe. Was this faire Paper? This most goodly Booke\nMade to write Whore vpon? What commited,\nCommitted? Oh, thou publicke Commoner,\nI should make very Forges of my cheekes,\nThat would to Cynders burne vp Modestie,\nDid I but speake thy deedes. What commited?\nHeauen stoppes the Nose at it, and the Moone winks:\nThe baudy winde that kisses all it meetes,\nIs hush'd within the hollow Myne of Earth\nAnd will not hear't. What commited?\n  Des. By Heauen you do me wrong\n\n   Othe. Are not you a Strumpet?\n  Des. No, as I am a Christian.\nIf to preserue this vessell for my Lord,\nFrom any other foule vnlawfull touch\nBe not to be a Strumpet, I am none\n\n   Othe. What, not a Whore?\n  Des. No, as I shall be sau'd\n\n   Othe. Is't possible?\n  Des. Oh Heauen forgiue vs\n\n   Othe. I cry you mercy then.\nI tooke you for that cunning Whore of Venice,\nThat married with Othello. You Mistris,\nEnter aemilia.\n\nThat haue the office opposite to Saint Peter,\nAnd keepes the gate of hell. You, you: I you.\nWe haue done our course: there's money for your paines:\nI pray you turne the key, and keepe our counsaile.\nEnter.\n\nAemil. Alas, what do's this Gentleman conceiue?\nHow do you Madam? how do you my good Lady?\n  Des. Faith, halfe a sleepe\n\n   Aemi. Good Madam,\nWhat's the matter with my Lord?\n  Des. With who?\nAemil. Why, with my Lord, Madam?\n  Des. Who is thy Lord?\nAemil. He that is yours, sweet Lady\n\n   Des. I haue none: do not talke to me, aemilia,\nI cannot weepe: nor answeres haue I none,\nBut what should go by water. Prythee to night,\nLay on my bed my wedding sheetes, remember,\nAnd call thy husband hither.\nAemil. Heere's a change indeed.\nEnter.\n\n  Des. 'Tis meete I should be vs'd so: very meete.\nHow haue I bin behau'd, that he might sticke\nThe small'st opinion on my least misvse?\nEnter Iago, and aemilia.\n\n  Iago. What is your pleasure Madam?\nHow is't with you?\n  Des. I cannot tell: those that do teach yong Babes\nDo it with gentle meanes, and easie taskes.\nHe might haue chid me so; for in good faith\nI am a Child to chiding\n\n   Iago. What is the matter Lady?\nAemil. Alas (Iago) my Lord hath so bewhor'd her,\nThrowne such dispight, and heauy termes vpon her\nThat true hearts cannot beare it\n\n   Des. Am I that name, Iago?\n  Iago. What name, (faire Lady?)\n  Des. Such as she said my Lord did say I was.\nAemil. He call'd her whore: a Begger in his drinke:\nCould not haue laid such termes vpon his Callet\n\n   Iago. Why did he so?\n  Des. I do not know: I am sure I am none such\n\n   Iago. Do not weepe, do not weepe: alas the day.\nAemil. Hath she forsooke so many Noble Matches?\nHer Father? And her Country? And her Friends?\nTo be call'd Whore? Would it not make one weepe?\n  Des. It is my wretched Fortune\n\n   Iago. Beshrew him for't:\nHow comes this Tricke vpon him?\n  Des. Nay, Heauen doth know\n\n   Aemi. I will be hang'd, if some eternall Villaine,\nSome busie and insinuating Rogue,\nSome cogging, cozening Slaue, to get some Office,\nHaue not deuis'd this Slander: I will be hang'd else\n\n   Iago. Fie, there is no such man: it is impossible\n\n   Des. If any such there be, Heauen pardon him.\nAemil. A halter pardon him:\nAnd hell gnaw his bones.\nWhy should he call her Whore?\nWho keepes her companie?\nWhat Place? What Time?\nWhat Forme? What liklyhood?\nThe Moore's abus'd by some most villanous Knaue,\nSome base notorious Knaue, some scuruy Fellow.\nOh Heauens, that such companions thou'd'st vnfold,\nAnd put in euery honest hand a whip\nTo lash the Rascalls naked through the world,\nEuen from the East to th' West\n\n   Iago. Speake within doore.\nAemil. Oh fie vpon them: some such Squire he was\nThat turn'd your wit, the seamy-side without,\nAnd made you to suspect me with the Moore\n\n   Iago. You are a Foole: go too\n\n   Des. Alas Iago,\nWhat shall I do to win my Lord againe?\nGood Friend, go to him: for by this light of Heauen,\nI know not how I lost him. Heere I kneele:\nIf ere my will did trespasse 'gainst his Loue,\nEither in discourse of thought, or actuall deed,\nOr that mine Eyes, mine Eares, or any Sence\nDelighted them: or any other Forme.\nOr that I do not yet, and euer did,\nAnd euer will, (though he do shake me off\nTo beggerly diuorcement) Loue him deerely,\nComfort forsweare me. Vnkindnesse may do much,\nAnd his vnkindnesse may defeat my life,\nBut neuer taynt my Loue. I cannot say Whore,\nIt do's abhorre me now I speake the word,\nTo do the Act, that might the addition earne,\nNot the worlds Masse of vanitie could make me\n\n   Iago. I pray you be content: 'tis but his humour:\nThe businesse of the State do's him offence\n\n   Des. If 'twere no other\n\n   Iago. It is but so, I warrant,\nHearke how these Instruments summon to supper:\nThe Messengers of Venice staies the meate,\nGo in, and weepe not: all things shall be well.\n\nExeunt. Desdemona and aemilia.\n\nEnter Rodorigo.\n\nHow now Rodorigo?\n  Rod. I do not finde\nThat thou deal'st iustly with me\n\n   Iago. What in the contrarie?\n  Rodori. Euery day thou dafts me with some deuise\nIago, and rather, as it seemes to me now, keep'st from\nme all conueniencie, then suppliest me with the least aduantage\nof hope: I will indeed no longer endure it. Nor\nam I yet perswaded to put vp in peace, what already I\nhaue foolishly suffred\n\n   Iago. Will you heare me Rodorigo?\n  Rodori. I haue heard too much: and your words and\nPerformances are no kin together\n\n   Iago. You charge me most vniustly\n\n   Rodo. With naught but truth: I haue wasted my\nselfe out of my meanes. The Iewels you haue had from\nme to deliuer Desdemona, would halfe haue corrupted a\nVotarist. You haue told me she hath receiu'd them,\nand return'd me expectations and comforts of sodaine\nrespect, and acquaintance, but I finde none\n\n   Iago. Well, go too: very well\n\n   Rod. Very well, go too: I cannot go too, (man) nor\n'tis not very well. Nay I think it is scuruy: and begin to\nfinde my selfe fopt in it\n\n   Iago. Very well\n\n   Rodor. I tell you, 'tis not very well: I will make my\nselfe knowne to Desdemona. If she will returne me my\nIewels, I will giue ouer my Suit, and repent my vnlawfull\nsolicitation. If not, assure your selfe, I will seeke\nsatisfaction of you\n\n   Iago. You haue said now\n\n   Rodo. I: and said nothing but what I protest intendment\nof doing\n\n   Iago. Why, now I see there's mettle in thee: and\neuen from this instant do build on thee a better opinion\nthen euer before: giue me thy hand Rodorigo.\nThou hast taken against me a most iust exception:\nbut yet I protest I haue dealt most directly in thy\nAffaire\n\n   Rod. It hath not appeer'd\n\n   Iago. I grant indeed it hath not appeer'd: and\nyour suspition is not without wit and iudgement.\nBut Rodorigo, if thou hast that in thee indeed, which\nI haue greater reason to beleeue now then euer (I\nmeane purpose, Courage, and Valour) this night\nshew it. If thou the next night following enioy not\nDesdemona, take me from this world with Treacherie,\nand deuise Engines for my life\n\n   Rod. Well: what is it? Is it within, reason and compasse?\n  Iago. Sir, there is especiall Commission come from\nVenice to depute Cassio in Othello's place\n\n   Rod. Is that true? Why then Othello and Desdemona\nreturne againe to Venice\n\n   Iago. Oh no: he goes into Mauritania and taketh\naway with him the faire Desdemona, vnlesse his abode\nbe lingred heere by some accident. Wherein\nnone can be so determinate, as the remouing of\nCassio\n\n   Rod. How do you meane remouing him?\n  Iago. Why, by making him vncapable of Othello's\nplace: knocking out his braines\n\n   Rod. And that you would haue me to do\n\n   Iago. I: if you dare do your selfe a profit, and a\nright. He sups to night with a Harlotry: and thither\nwill I go to him. He knowes not yet of his Honourable\nFortune, if you will watch his going thence (which\nI will fashion to fall out betweene twelue and one)\nyou may take him at your pleasure. I will be neere\nto second your Attempt, and he shall fall betweene\nvs. Come, stand not amaz'd at it, but go along with\nme: I will shew you such a necessitie in his death, that\nyou shall thinke your selfe bound to put it on him. It\nis now high supper time: and the night growes to wast.\nAbout it\n\n   Rod. I will heare further reason for this\n\n   Iago. And you shalbe satisfi'd.\n\nExeunt.\n\n\nScena Tertia.\n\nEnter Othello, Lodouico, Desdemona, aemilia, and Atendants.\n\n  Lod. I do beseech you Sir, trouble your selfe no further\n\n   Oth. Oh pardon me: 'twill do me good to walke\n\n   Lodoui. Madam, good night: I humbly thanke your\nLadyship\n\n   Des. Your Honour is most welcome\n\n   Oth. Will you walke Sir? Oh Desdemona\n\n   Des. My Lord\n\n   Othello. Get you to bed on th' instant, I will be return'd\nforthwith: dismisse your Attendant there: look't\nbe done.\nEnter.\n\n  Des. I will my Lord\n\n   Aem. How goes it now? He lookes gentler then he did\n\n   Des. He saies he will returne incontinent,\nAnd hath commanded me to go to bed,\nAnd bid me to dismisse you\n\n   Aemi. Dismisse me?\n  Des. It was his bidding: therefore good aemilia,\nGiue me my nightly wearing, and adieu.\nWe must not now displease him.\nAemil. I, would you had neuer seene him\n\n   Des. So would not I: my loue doth so approue him,\nThat euen his stubbornesse, his checks, his frownes,\n(Prythee vn-pin me) haue grace and fauour\n\n   Aemi. I haue laid those Sheetes you bad me on the bed\n\n   Des. All's one: good Father, how foolish are our minds?\nIf I do die before, prythee shrow'd me\nIn one of these same Sheetes.\nAemil. Come, come: you talke\n\n   Des. My Mother had a Maid call'd Barbarie,\nShe was in loue: and he she lou'd prou'd mad,\nAnd did forsake her. She had a Song of Willough,\nAn old thing 'twas: but it express'd her Fortune,\nAnd she dy'd singing it. That Song to night,\nWill not go from my mind: I haue much to do,\nBut to go hang my head all at one side\nAnd sing it like poore Barbarie: prythee dispatch\n\n   Aemi. Shall I go fetch your Night-gowne?\n  Des. No, vn-pin me here,\nThis Lodouico is a proper man.\nAemil. A very handsome man\n\n   Des. He speakes well.\nAemil. I know a Lady in Venice would haue walk'd\nbarefoot to Palestine for a touch of his nether lip\n\n   Des. The poore Soule sat singing, by a Sicamour tree.\nSing all a greene Willough:\nHer hand on her bosome her head on her knee,\nSing Willough, Willough, Willough.\nThe fresh Streames ran by her, and murmur'd her moanes\nSing Willough, &c.\nHer salt teares fell from her, and softned the stones,\nSing Willough, &c. (Lay by these)\nWillough, Willough. (Prythee high thee: he'le come anon)\nSing all a greene Willough must be my Garland.\nLet no body blame him, his scorne I approue.\n(Nay that's not next. Harke, who is't that knocks?\nAemil. It's the wind\n\n   Des. I call'd my Loue false Loue: but what said he then?\nSing Willough, &c.\nIf I court mo women, you'le couch with mo men.\nSo get thee gone, good night: mine eyes do itch:\nDoth that boade weeping?\nAemil. 'Tis neyther heere, nor there\n\n   Des. I haue heard it said so. O these Men, these men!\nDo'st thou in conscience thinke (tell me aemilia)\nThat there be women do abuse their husbands\nIn such grosse kinde?\nAemil. There be some such, no question\n\n   Des. Would'st thou do such a deed for all the world?\nAemil. Why, would not you?\n  Des. No, by this Heauenly light.\nAemil. Nor I neither, by this Heauenly light:\nI might doo't as well i'th' darke\n\n   Des. Would'st thou do such a deed for al the world?\nAemil. The world's a huge thing:\nIt is a great price, for a small vice\n\n   Des. Introth, I thinke thou would'st not.\nAemil. Introth I thinke I should, and vndoo't when\nI had done. Marry, I would not doe such a thing for a\nioynt Ring, nor for measures of Lawne, nor for Gownes,\nPetticoats, nor Caps, nor any petty exhibition. But for\nall the whole world: why, who would not make her husband\na Cuckold, to make him a Monarch? I should venture\nPurgatory for't\n\n   Des. Beshrew me, if I would do such a wrong\nFor the whole world.\nAemil. Why, the wrong is but a wrong i'th' world;\nand hauing the world for your labour, 'tis a wrong in\nyour owne world, and you might quickly make it right\n\n   Des. I do not thinke there is any such woman.\nAemil. Yes, a dozen: and as many to'th' vantage, as\nwould store the world they plaid for.\nBut I do thinke it is their Husbands faults\nIf Wiues do fall: (Say, that they slacke their duties,\nAnd powre our Treasures into forraigne laps;\nOr else breake out in peeuish Iealousies,\nThrowing restraint vpon vs: Or say they strike vs,\nOr scant our former hauing in despight)\nWhy we haue galles: and though we haue some Grace,\nYet haue we some Reuenge. Let Husbands know,\nTheir wiues haue sense like them: They see, and smell,\nAnd haue their Palats both for sweet, and sowre,\nAs Husbands haue. What is it that they do,\nWhen they change vs for others? Is it Sport?\nI thinke it is: and doth Affection breed it?\nI thinke it doth. Is't Frailty that thus erres?\nIt is so too. And haue not we Affections?\nDesires for Sport? and Frailty, as men haue?\nThen let them vse vs well: else let them know,\nThe illes we do, their illes instruct vs so\n\n   Des. Good night, good night:\nHeauen me such vses send,\nNot to picke bad, from bad; but by bad, mend.\n\nExeunt.\n\nActus Quintus. Scena Prima.\n\nEnter Iago, and Rodorigo.\n\n  Iago. Heere, stand behinde this Barke,\nStraight will he come:\nWeare thy good Rapier bare, and put it home:\nQuicke, quicke, feare nothing; Ile be at thy Elbow,\nIt makes vs, or it marres vs, thinke on that,\nAnd fixe most firme thy Resolution\n\n   Rod. Be neere at hand, I may miscarry in't\n\n   Iago. Heere, at thy hand: Be bold, & take thy stand\n\n   Rod. I haue no great deuotion to the deed,\nAnd yet he hath giuen me satisfying Reasons:\n'Tis but a man gone. Forth my Sword: he dies\n\n   Iago. I haue rub'd this yong Quat almost to the sense,\nAnd he growes angry. Now, whether he kill Cassio,\nOr Cassio him, or each do kill the other,\nEuery way makes my gaine. Liue Rodorigo,\nHe calles me to a restitution large\nOf Gold, and Iewels, that I bob'd from him,\nAs Guifts to Desdemona.\nIt must not be: If Cassio do remaine,\nHe hath a dayly beauty in his life,\nThat makes me vgly: and besides, the Moore\nMay vnfold me to him: there stand I in much perill:\nNo, he must dye. But so, I heard him comming.\nEnter Cassio.\n\n  Rod. I know his gate, 'tis he: Villaine thou dyest\n\n   Cas. That thrust had beene mine enemy indeed,\nBut that my Coate is better then thou know'st:\nI will make proofe of thine\n\n   Rod. Oh, I am slaine\n\n   Cassio. I am maym'd for euer:\nHelpe hoa: Murther, murther.\nEnter Othello.\n\n  Oth. The voyce of Cassio. Iago keepes his word\n\n   Rod. O Villaine that I am\n\n   Oth. It is euen so\n\n   Cas. Oh helpe hoa: Light, a Surgeon\n\n   Oth. 'Tis he: O braue Iago, honest, and iust,\nThat hast such Noble sense of thy Friends wrong,\nThou teachest me. Minion, your deere lyes dead,\nAnd your vnblest Fate highes: Strumpet I come:\nFor of my heart, those Charmes thine Eyes, are blotted.\nThy Bed lust-stain'd, shall with Lusts blood bee spotted.\n\nExit Othello.\n\nEnter Lodouico and Gratiano.\n\n  Cas. What hoa? no Watch? No passage?\nMurther, Murther\n\n   Gra. 'Tis some mischance, the voyce is very direfull\n\n   Cas. Oh helpe\n\n   Lodo. Hearke\n\n   Rod. Oh wretched Villaine\n\n   Lod. Two or three groane. 'Tis heauy night;\nThese may be counterfeits: Let's think't vnsafe\nTo come into the cry, without more helpe\n\n   Rod. Nobody come: then shall I bleed to death.\nEnter Iago.\n\n  Lod. Hearke\n\n   Gra. Here's one comes in his shirt, with Light, and\nWeapons\n\n   Iago. Who's there?\nWho's noyse is this that cries on murther?\n  Lodo. We do not know\n\n   Iago. Do not you heare a cry?\n  Cas. Heere, heere: for heauen sake helpe me\n\n   Iago. What's the matter?\n  Gra. This is Othello's Ancient, as I take it\n\n   Lodo. The same indeede, a very valiant Fellow\n\n   Iago. What are you heere, that cry so greeuously?\n  Cas. Iago? Oh I am spoyl'd, vndone by Villaines:\nGiue me some helpe\n\n   Iago. O mee, Lieutenant!\nWhat Villaines haue done this?\n  Cas. I thinke that one of them is heereabout.\nAnd cannot make away\n\n   Iago. Oh treacherous Villaines:\nWhat are you there? Come in, and giue some helpe\n\n   Rod. O helpe me there\n\n   Cassio. That's one of them\n\n   Iago. Oh murd'rous Slaue! O Villaine!\n  Rod. O damn'd Iago! O inhumane Dogge!\n  Iago. Kill men i'th' darke?\nWhere be these bloody Theeues?\nHow silent is this Towne? Hoa, murther, murther.\nWhat may you be? Are you of good, or euill?\n  Lod. As you shall proue vs, praise vs\n\n   Iago. Signior Lodouico?\n  Lod. He Sir\n\n   Iago. I cry you mercy: here's Cassio hurt by Villaines\n\n   Gra. Cassio?\n  Iago. How is't Brother?\n  Cas. My Legge is cut in two\n\n   Iago. Marry heauen forbid:\nLight Gentlemen, Ile binde it with my shirt.\nEnter Bianca.\n\n  Bian. What is the matter hoa? Who is't that cry'd?\n  Iago. Who is't that cry'd?\n  Bian. Oh my deere Cassio,\nMy sweet Cassio: Oh Cassio, Cassio, Cassio\n\n   Iago. O notable Strumpet. Cassio, may you suspect\nWho they should be, that haue thus mangled you?\n  Cas. No\n\n   Gra. I am sorry to finde you thus;\nI haue beene to seeke you\n\n   Iago. Lend me a Garter. So: - Oh for a Chaire\nTo beare him easily hence\n\n   Bian. Alas he faints. Oh Cassio, Cassio, Cassio\n\n   Iago. Gentlemen all, I do suspect this Trash\nTo be a party in this Iniurie.\nPatience awhile, good Cassio. Come, come;\nLend me a Light: know we this face, or no?\nAlas my Friend, and my deere Countryman\nRodorigo? No: Yes sure: Yes, 'tis Rodorigo\n\n   Gra. What, of Venice?\n  Iago. Euen he Sir: Did you know him?\n  Gra. Know him? I\n\n   Iago. Signior Gratiano? I cry your gentle pardon:\nThese bloody accidents must excuse my Manners,\nThat so neglected you\n\n   Gra. I am glad to see you\n\n   Iago. How do you Cassio? Oh, a Chaire, a Chaire\n\n   Gra. Rodorigo?\n  Iago. He, he, 'tis he:\nOh that's well said, the Chaire.\nSome good man beare him carefully from hence,\nIle fetch the Generall's Surgeon. For you Mistris,\nSaue you your labour. He that lies slaine heere (Cassio)\nWas my deere friend. What malice was between you\n\n   Cas. None in the world: nor do I know the man?\n  Iago. What? looke you pale? Oh beare him o'th' Ayre.\nStay you good Gentlemen. Looke you pale, Mistris?\nDo you perceiue the gastnesse of her eye?\nNay, if you stare, we shall heare more anon.\nBehold her well: I pray you looke vpon her:\nDo you see Gentlemen? Nay, guiltinesse will speake\nThough tongues were out of vse.\nAemil. Alas, what is the matter?\nWhat is the matter, Husband?\n  Iago. Cassio hath heere bin set on in the darke\nBy Rodorigo, and Fellowes that are scap'd:\nHe's almost slaine, and Rodorigo quite dead.\nAemil. Alas good Gentleman: alas good Cassio\n\n   Iago. This is the fruits of whoring. Prythe aemilia,\nGo know of Cassio where he supt to night.\nWhat, do you shake at that?\n  Bian. He supt at my house, but I therefore shake not\n\n   Iago. O did he so? I charge you go with me.\nAemil. Oh fie vpon thee Strumpet\n\n   Bian. I am no Strumpet, but of life as honest,\nAs you that thus abuse me.\nAemil. As I? Fie vpon thee\n\n   Iago. Kinde Gentlemen:\nLet's go see poore Cassio drest.\nCome Mistris, you must tel's another Tale.\naemilia, run you to the Cittadell,\nAnd tell my Lord and Lady, what hath happ'd:\nWill you go on afore? This is the night\nThat either makes me, or foredoes me quight.\n\nExeunt.\n\nScoena Secunda.\n\nEnter Othello, and Desdemona in her bed.\n\n  Oth. It is the Cause, it is the Cause (my Soule)\nLet me not name it to you, you chaste Starres,\nIt is the Cause. Yet Ile not shed her blood,\nNor scarre that whiter skin of hers, then Snow,\nAnd smooth as Monumentall Alablaster:\nYet she must dye, else shee'l betray more men:\nPut out the Light, and then put out the Light:\nIf I quench thee, thou flaming Minister,\nI can againe thy former light restore,\nShould I repent me. But once put out thy Light,\nThou cunning'st Patterne of excelling Nature,\nI know not where is that Promethaean heate\nThat can thy Light re-Lume.\nWhen I haue pluck'd thy Rose,\nI cannot giue it vitall growth againe,\nIt needs must wither. Ile smell thee on the Tree.\nOh Balmy breath, that dost almost perswade\nIustice to breake her Sword. One more, one more:\nBe thus when thou art dead, and I will kill thee,\nAnd loue thee after. One more, and that's the last.\nSo sweet, was ne're so fatall. I must weepe,\nBut they are cruell Teares: This sorrow's heauenly,\nIt strikes, where it doth loue. She wakes\n\n   Des. Who's there? Othello?\n  Othel. I Desdemona\n\n   Des. Will you come to bed, my Lord?\n  Oth. Haue you pray'd to night, Desdemon?\n  Des. I my Lord\n\n   Oth. If you bethinke your selfe of any Crime\nVnreconcil'd as yet to Heauen, and Grace,\nSolicite for it straight\n\n   Des. Alacke, my Lord,\nWhat may you meane by that?\n  Oth. Well, do it, and be breefe, I will walke by:\nI would not kill thy vnprepared Spirit,\nNo, Heauens fore-fend) I would not kill thy Soule\n\n   Des. Talke you of killing?\n  Oth. I, I do\n\n   Des. Then Heauen haue mercy on mee\n\n   Oth. Amen, with all my heart\n\n   Des. If you say, I hope you will not kill me\n\n   Oth. Humh\n\n   Des. And yet I feare you: for you're fatall then\nWhen your eyes rowle so.\nWhy I should feare, I know not,\nSince guiltinesse I know not: But yet I feele I feare\n\n   Oth. Thinke on thy sinnes\n\n   Des. They are Loues I beare to you\n\n   Oth. I, and for that thou dy'st\n\n   Des. That death's vnnaturall, that kils for louing.\nAlas, why gnaw you so your nether-lip?\nSome bloody passion shakes your very Frame:\nThese are portents: but yet I hope, I hope,\nThey do not point on me\n\n   Oth. Peace, and be still\n\n   Des. I will so: What's the matter?\n  Oth. That Handkerchiefe\nWhich I so lou'd, and gaue thee, thou gau'st to Cassio\n\n   Des. No by my Life, and Soule: send for the man,\nAnd aske him\n\n   Oth. Sweet Soule, take heed, take heed of Periury,\nThou art on thy death-bed\n\n   Des. I, but not yet to dye\n\n   Oth. Presently.\nTherefore confesse thee freely of thy sinne:\nFor to deny each Article with Oath,\nCannot remoue, nor choake the strong Conception\nThat I do grone withall. Thou art to dye\n\n   Des. O Heauen haue mercy on me\n\n   Oth. I say, Amen\n\n   Des. And haue you mercy too. I neuer did\nOffend you in my life: neuer lou'd Cassio,\nBut with such generall warrantie of Heauen,\nAs I might loue. I neuer gaue him Token\n\n   Oth. By Heauen I saw my Handkerchiefe in's hand.\nO periur'd woman, thou do'st stone my heart,\nAnd makes me call, what I intend to do,\nA Murther, which I thought a Sacrifice.\nI saw the Handkerchiefe\n\n   Des. He found it then:\nI neuer gaue it him: Send, for him hither:\nLet him confesse a truth\n\n   Oth. He hath confest\n\n   Des. What, my Lord?\n  Oth. That he hath vs'd thee\n\n   Des. How? vnlawfully?\n  Oth. I\n\n   Des. He will not say so\n\n   Oth. No: his mouth is stopp'd:\nHonest Iago hath 'tane order for't\n\n   Des. Oh, my feare interprets. What is he dead?\n  Oth. Had all his haires bin liues, my great Reuenge\nHad stomacke for them all\n\n   Des. Alas, he is betray'd, and I vndone\n\n   Oth. Out Strumpet: weep'st thou for him to my face?\n  Des. O banish me, my Lord, but kill me not\n\n   Oth. Downe Strumpet\n\n   Des. Kill me to morrow, let me liue to night\n\n   Oth. Nay, if you striue\n\n   Des. But halfe an houre\n\n   Oth. Being done, there is no pawse\n\n   Des. But while I say one prayer\n\n   Oth. It is too late.\n\nSmothers her.\n\naemilia at the doore.\n\nAemil. My Lord, my Lord? What hoa?\nMy Lord, my Lord\n\n   Oth. What noise is this? Not dead? not yet quite dead?\nI that am cruell, am yet mercifull,\nI would not haue thee linger in thy paine?\nSo, so.\nAemil. within. What hoa? my Lord, my Lord?\n  Oth. Who's there?\nAemil. Oh good my Lord, I would speake a word\nwith you\n\n   Oth. Yes: 'Tis aemilia: by and by. Shee's dead.\n'Tis like she comes to speake of Cassio's death:\nThe noise was high. Hah, no more moouing?\nStill as the Graue. Shall she come in? Wer't good?\nI thinke she stirres againe. No, what's best to do?\nIf she come in, shee'l sure speake to my wife:\nMy wife, my wife: what wife? I haue no wife.\nOh insupportable! Oh heauy houre!\nMe thinkes, it should be now a huge Eclipse\nOf Sunne, and Moone; and that th' affrighted Globe\nDid yawne at Alteration.\nAemil. I do beseech you\nThat I may speake with you. Oh good my Lord\n\n   Oth. I had forgot thee: oh come in aemilia.\nSoft, by and by, let me the Curtaines draw.\nWhere art thou? What's the matter with thee now?\nEnter aemilia.\n\nAemil. Oh my good Lord, yonders foule Murthers\ndone\n\n   Oth. What? now?\nAemil. But now, my Lord\n\n   Oth. It is the very error of the Moone,\nShe comes more neerer Earth then she was wont,\nAnd makes men mad.\nAemil. Cassio, my Lord, hath kill'd\nA young Venetian, call'd Rodorigo\n\n   Oth. Rodorigo kill'd? and Cassio kill'd?\nAemil. No, Cassio is not kill'd\n\n   Oth. Not Cassio kill'd? Then Murther's out of tune,\nAnd sweet Reuenge growes harsh\n\n   Des. O falsely, falsely murder'd.\nAemil. Alas! what cry is that?\n  Oth. That? What?\nAemil. Out, and alas, that was my Ladies voice.\nHelpe, helpe hoa, helpe. Oh Ladie speake againe,\nSweet Desdemona, oh sweet Mistris, speake\n\n   Des. A guiltlesse death, I dye.\nAemil. Oh who hath done this deed?\n  Des. No body: I my selfe, farewell:\nCommend me to my kinde Lord: oh farewell\n\n   Oth. Why, how should she be murdred?\nAemil. Alas: who knowes?\n  Oth. You heare her say her selfe, it was not I.\nAemil. She said so: I must needs report the truth\n\n   Oth. She's like a Liar gone to burning hell,\n'Twas I that kill'd her.\nAemil. Oh the more Angell she, and you the blacker\nDiuell\n\n   Oth. She turn'd to folly: and she was a whore.\nAemil. Thou do'st bely her, and thou art a diuell\n\n   Oth. She was false as water.\nAemil. Thou art rash as fire, to say\nThat she was false. Oh she was heauenly true\n\n   Oth. Cassio did top her: Ask thy husband else.\nO, I were damn'd beneath all depth in hell:\nBut that I did proceed vpon iust grounds\nTo this extremity. Thy Husband knew it all.\nAemil. My Husband?\n  Oth. Thy Husband.\nAemil. That she was false to Wedlocke?\n  Oth. I, with Cassio: had she bin true,\nIf Heauen would make me such another world,\nOf one entyre and perfect Chrysolite,\nI'ld not haue sold her for it.\nAemil. My Husband?\n  Oth. I, 'twas he that told me on her first,\nAn honest man he is, and hates the slime\nThat stickes on filthy deeds.\nAemil. My Husband?\n  Oth. What needs this itterance, Woman?\nI say, thy Husband.\nAemil. Oh Mistris,\nVillany hath made mockes with loue:\nMy Husband say she was false?\n  Oth. He, Woman;\nI say thy Husband: Do'st vnderstand the word?\nMy Friend, thy Husband; honest, honest Iago.\nAemil. If he say so, may his pernicious Soule\nRot halfe a graine a day: he lyes to'th' heart,\nShe was too fond of her most filthy Bargaine\n\n   Oth. Hah?\nAemil. Do thy worst:\nThis deede of thine is no more worthy Heauen,\nThen thou was't worthy her\n\n   Oth. Peace, you were best.\nAemil. Thou hast not halfe that powre to do me harm,\nAs I haue to be hurt. Oh Gull, oh dolt,\nAs ignorant as durt: thou hast done a deed\n(I care not for thy Sword) Ile make thee known,\nThough I lost twenty liues. Helpe, helpe, hoa, helpe:\nThe Moore hath kill'd my Mistris. Murther, murther.\nEnter Montano, Gratiano, and Iago.\n\n  Mon. What is the matter? How now Generall?\nAemil. Oh, are you come, Iago: you haue done well,\nThat men must lay their Murthers on your necke\n\n   Gra. What is the matter?\nAemil. Disproue this Villaine, if thou bee'st a man:\nHe sayes, thou told'st him that his wife was false:\nI know thou did'st not: thou'rt not such a Villain.\nSpeake, for my heart is full\n\n   Iago. I told him what I thought,\nAnd told no more\nThen what he found himselfe was apt, and true.\nAemil. But did you euer tell him,\nShe was false?\n  Iago. I did.\nAemil. You told a Lye an odious damned Lye:\nVpon my Soule, a Lye; a wicked Lye.\nShee false with Cassio?\nDid you say with Cassio?\n  Iago. With Cassio, Mistris?\nGo too, charme your tongue\n\n   Emil. I will not charme my Tongue;\nI am bound to speake,\nMy Mistris heere lyes murthered in her bed\n\n   All. Oh Heauens, forefend\n\n   Emil. And your reports haue set the Murder on\n\n   Othello. Nay stare not Masters,\nIt is true indeede\n\n   Gra. 'Tis a strange Truth\n\n   Mont. O monstrous Acte\n\n   Emil. Villany, villany, villany:\nI thinke vpon't, I thinke: I smel't: O Villany:\nI thought so then: Ile kill my selfe for greefe.\nO villany! villany!\n  Iago. What, are you mad?\nI charge you get you home\n\n   Emil. Good Gentlemen, let me haue leaue to speake:\n'Tis proper I obey him; but not now:\nPerchance Iago, I will ne're go home\n\n   Oth. Oh, oh, oh\n\n   Emil. Nay, lay thee downe, and roare:\nFor thou hast kill'd the sweetest innocent,\nThat ere did lift vp eye\n\n   Oth. Oh she was fowle!\nI scarse did know you Vnkle, there lies your Neece,\nWhose breath (indeed) these hands haue newly stopp'd:\nI know this acte shewes horrible and grim\n\n   Gra. Poore Desdemon:\nI am glad thy Father's dead,\nThy Match was mortall to him: and pure greefe\nShore his old thred in twaine. Did he liue now,\nThis sight would make him do a desperate turne:\nYea, curse his better Angell from his side,\nAnd fall to Reprobance\n\n   Oth. 'Tis pittifull: but yet Iago knowes\nThat she with Cassio, hath the Act of shame\nA thousand times committed. Cassio confest it,\nAnd she did gratifie his amorous workes\nWith that Recognizance and pledge of Loue\nWhich I first gaue her: I saw it in his hand:\nIt was a Handkerchiefe, an Antique Token\nMy Father gaue my Mother\n\n   Emil. Oh Heauen! oh heauenly Powres!\n  Iago. Come, hold your peace\n\n   Emil. 'Twill out, 'twill out. I peace?\nNo, I will speake as liberall as the North;\nLet Heauen, and Men, and Diuels, let them all,\nAll, all, crie shame against me, yet Ile speake\n\n   Iago. Be wise, and get you home\n\n   Emil. I will not\n\n   Gra. Fye, your Sword vpon a Woman\n\n   Emil. Oh thou dull Moore,\nThat Handkerchiefe thou speak'st of\nI found by Fortune, and did giue my Husband:\nFor often, with a solemne earnestnesse,\n(More then indeed belong'd to such a Trifle)\nHe begg'd of me, to steale't\n\n   Iago. Villanous Whore\n\n   Emil. She giue it Cassio? No, alas I found it,\nAnd I did giu't my Husband\n\n   Iago. Filth, thou lyest\n\n   Emil. By Heauen I do not, I do not Gentlemen:\nOh murd'rous Coxcombe, what should such a Foole\nDo with so good a wife?\n  Oth. Are there no stones in Heauen,\nBut what serues for the Thunder?\nPrecious Villaine\n\n   Gra. The woman falles:\nSure he hath kill'd his Wife\n\n   Emil. I, I: oh lay me by my Mistris side\n\n   Gra. Hee's gone, but his wife's kill'd\n\n   Mon. 'Tis a notorious Villain: take you this weapon\nWhich I haue recouer'd from the Moore:\nCome guard the doore without, let him not passe,\nBut kill him rather. Ile after that same villaine,\nFor 'tis a damned Slaue.\nEnter.\n\n  Oth. I am not valiant neither:\nBut euery Punie whipster gets my Sword.\nBut why should Honor out-liue Honesty?\nLet it go all.\nAemil. What did thy Song boad Lady?\nHearke, canst thou heare me? I will play the Swan,\nAnd dye in Musicke: Willough, Willough, Willough.\nMoore, she was chaste: She lou'd thee, cruell Moore,\nSo come my Soule to blisse, as I speake true:\nSo speaking as I thinke, alas, I dye\n\n   Oth. I haue another weapon in this Chamber,\nIt was a Sword of Spaine, the Ice brookes temper:\nOh heere it is: Vnkle I must come forth\n\n   Gra. If thou attempt it, it will cost thee deere;\nThou hast no weapon, and perforce must suffer\n\n   Oth. Looke in vpon me then, and speake with me,\nOr naked as I am I will assault thee\n\n   Gra. What is the matter?\n  Othel. Behold, I haue a weapon:\nA better neuer did it selfe sustaine\nVpon a Soldiers Thigh. I haue seene the day,\nThat with this little Arme, and this good Sword,\nI haue made my way through more impediments\nThen twenty times your stop. But (oh vaine boast)\nWho can controll his Fate? 'Tis not so now.\nBe not affraid, though you do see me weapon'd:\nHeere is my iournies end, heere is my butt\nAnd verie Sea-marke of my vtmost Saile.\nDo you go backe dismaid? 'Tis a lost feare:\nMan but a Rush against Othello's brest,\nAnd he retires. Where should Othello go?\nNow: how dost thou looke now? Oh ill-Starr'd wench,\nPale as thy Smocke: when we shall meete at compt,\nThis looke of thine will hurle my Soule from Heauen,\nAnd Fiends will snatch at it. Cold, cold, my Girle?\nEuen like thy Chastity. O cursed, cursed Slaue!\nWhip me ye Diuels,\nFrom the possession of this Heauenly sight:\nBlow me about in windes, roast me in Sulphure,\nWash me in steepe-downe gulfes of Liquid fire.\nOh Desdemon! dead Desdemon: dead. Oh, oh!\nEnter Lodouico, Cassio, Montano, and Iago, with Officers.\n\n  Lod. Where is this rash, and most vnfortunate man?\n  Oth. That's he that was Othello: heere I am\n\n   Lod. Where is that Viper?\nBring the Villaine forth\n\n   Oth. I look down towards his feet; but that's a Fable,\nIf that thou bee'st a Diuell, I cannot kill thee\n\n   Lod. Wrench his Sword from him\n\n   Iago. I bleed Sir, but not kill'd\n\n   Othel. I am not sorry neither, Il'd haue thee liue:\nFor in my sense, 'tis happinesse to die\n\n   Lod. Oh thou Othello, that was once so good,\nFalne in the practise of a cursed Slaue,\nWhat shall be saide to thee\n\n   Oth. Why any thing:\nAn honourable Murderer, if you will:\nFor nought I did in hate, but all in Honour\n\n   Lod. This wretch hath part confest his Villany:\nDid you and he consent in Cassio's death\n\n   Oth. I\n\n   Cas. Deere Generall, I neuer gaue you cause\n\n   Oth. I do beleeue it, and I aske your pardon:\nWill you, I pray, demand that demy-Diuell,\nWhy he hath thus ensnar'd my Soule and Body\n\n   Iag. Demand me nothing: what you know, you know:\nFrom this time forth, I neuer will speake word\n\n   Lod. What? not to pray?\n  Gra. Torments will ope your lips\n\n   Oth. Well, thou dost best\n\n   Lod. Sir,\nYou shall vnderstand what hath befalne,\n(Which, as I thinke, you know not) heere is a Letter\nFound in the pocket of the slaine Rodorigo,\nAnd heere another, the one of them imports\nThe death of Cassio, to be vndertooke\nBy Rodorigo\n\n   Oth. O Villaine!\n  Cassio. Most Heathenish, and most grosse\n\n   Lod. Now, heere's another discontented paper\nFound in his pocket too: and this it seemes\nRodorigo meant t'haue sent this damned villaine:\nBut that (belike) Iago in the interim\nCame in, and satisfi'd him\n\n   Oth. Oh thou pernitious Caitiffe;\nHow came you (Cassio) by that Handkerchiefe\nThat was my wiues?\n  Cassio. I found it in my Chamber:\nAnd he himselfe confest it but euen now,\nThat there he dropt it for a speciall purpose,\nWhich wrought to his desire\n\n   Othel. O Foole, foole, foole!\n  Cassio. There is besides, in Rodorigo's Letter,\nHow he vpbraides Iago, that he made him\nBraue me vpon the Watch: whereon it came\nThat I was cast: and euen but now he spake\n(After long seeming dead) Iago hurt him,\nIago set him on\n\n   Lod. You must forsake this roome, and go with vs:\nYour Power, and your Command is taken off,\nAnd Cassio rules in Cyprus. For this Slaue,\nIf there be any cunning Crueltie,\nThat can torment him much, and hold him long,\nIt shall be his. You shall close Prisoner rest,\nTill that the Nature of your fault be knowne\nTo the Venetian State. Come, bring away\n\n   Oth. Soft you; a word or two before you goe:\nI haue done the State some seruice, and they know't:\nNo more of that. I pray you in your Letters,\nWhen you shall these vnluckie deeds relate,\nSpeake of me, as I am. Nothing extenuate,\nNor set downe ought in malice.\nThen must you speake,\nOf one that lou'd not wisely, but too well:\nOf one, not easily Iealious, but being wrought,\nPerplexed in the extreame: Of one, whose hand\n(Like the base Iudean) threw a Pearle away\nRicher then all his Tribe: Of one, whose subdu'd Eyes,\nAlbeit vn-vsed to the melting moode,\nDrops teares as fast as the Arabian Trees\nTheir Medicinable gumme. Set you downe this:\nAnd say besides, that in Aleppo once,\nWhere a malignant, and a Turbond-Turke\nBeate a Venetian, and traduc'd the State,\nI tooke by th' throat the circumcised Dogge,\nAnd smoate him, thus\n\n   Lod. Oh bloody period\n\n   Gra. All that is spoke, is marr'd\n\n   Oth. I kist thee, ere I kill'd thee: No way but this,\nKilling my selfe, to dye vpon a kisse.\n\nDyes\n\n  Cas. This did I feare, but thought he had no weapon:\nFor he was great of heart\n\n   Lod. Oh Sparton Dogge:\nMore fell then Anguish, Hunger, or the Sea:\nLooke on the Tragicke Loading of this bed:\nThis is thy worke:\nThe Obiect poysons Sight,\nLet it be hid. Gratiano, keepe the house,\nAnd seize vpon the Fortunes of the Moore,\nFor they succeede on you. To you, Lord Gouernor,\nRemaines the Censure of this hellish villaine:\nThe Time, the Place, the Torture, oh inforce it:\nMy selfe will straight aboord, and to the State,\nThis heauie Act, with heauie heart relate.\n\nExeunt.\n\n\nFINIS.\n\nThe Names of the Actors.\n\nOthello, the Moore.\nBrabantio, Father to Desdemona.\nCassio, an Honourable Lieutenant.\nIago, a Villaine.\nRodorigo, a gull'd Gentleman.\nDuke of Venice.\nSenators.\nMontano, Gouernour of Cyprus.\nGentlemen of Cyprus.\nLodouico, and Gratiano, two Noble Venetians.\nSaylors.\nClowne.\nDesdemona, Wife to Othello.\nAemilia, Wife to Iago.\nBianca, a Curtezan.\n\nTHE TRAGEDIE OF Othello, the Moore of Venice.", "title": "Othello"}