{"summary": "\nThe Magician, Prospero, rightful Duke of Milan, and his daughter, Miranda, have been stranded for twelve years on an island after Prospero's jealous brother Antonio (aided by Alonso, the King of Naples) deposed him and set him adrift with the then-3-year-old Miranda. Gonzalo, Alonso's counselor, had secretly supplied their boat with some food, fresh water, \"rich garments, linens, stuffs and necessaries,\" and \"volumes\" (books) that Prospero prizes. Possessing magic powers due to his great learning, Prospero is reluctantly served by a spirit, Ariel, whom Prospero had rescued from a tree in which he had been trapped by the cruel witch, Sycorax, after he had refused to obey her. Prospero maintains Ariel's loyalty by repeatedly promising to release the \"airy spirit\" from servitude. Sycorax had been exiled from Algiers to the island for wreaking havoc with her magic, and had died before Prospero's arrival. Her son, Caliban, a deformed monster and the only non-spiritual inhabitant before the arrival of Prospero, was initially adopted and raised by him. He taught Prospero how to survive on the island, while Prospero and Miranda taught Caliban religion and their own language. Following Caliban's attempted rape of Miranda, he had been compelled by Prospero to serve as the magician's so-called slave. In slavery, Caliban has come to view Prospero as a usurper and has grown to resent him and his daughter. Prospero and Miranda in turn view Caliban with disappointment, contempt and disgust. Prospero only performs one act of magic himself directly on stage: he disarms Ferdinand, causing his nerves to become \"in their infancy again.\" The rest of his magic is through controlling spirits (or mentioned as happening previously), which is how magicians of the time were believed to operate.\nThe play opens as Prospero, having divined that his brother Antonio is on a nearby ship, has raised a tempest that causes the passengers to believe they are shipwrecked and marooned. Also on the ship are Antonio's friend and fellow conspirator, King Alonso of Naples, Alonso's brother and son (Sebastian and Ferdinand, respectively) and Alonso's \"trusted counselor,\" Gonzalo. All these passengers are returning from the wedding of Alonso's daughter Claribel and the King of Tunis. Prospero contrives to separate the shipwreck survivors into several groups by his spells, and so Alonso and Ferdinand are separated, each believing the other to be dead.\n\nThree plots then alternate through the play. In one, Caliban falls in with Stephano and Trinculo, two drunkards, believing Stephano to be a \"brave god\" who \"bears celestial liquor.\" They attempt to raise a coup against Prospero, which ultimately fails. In another, Prospero works to encourage a romantic relationship between Ferdinand and Miranda; the two fall immediately in love, but Prospero worries that \"too light winning [may] make the prize light,\" and compels Ferdinand to become his servant, pretending that he regards him as a spy. In the third subplot, Antonio and Sebastian conspire to kill Alonso and Gonzalo so that Sebastian can become King. Ariel thwarts them, at Prospero's command. Ariel appears to the \"three men of sin\" (Alonso, Antonio and Sebastian) as a harpy, reprimanding them for their betrayal of Prospero. Prospero, who has witnessed this, leaves to visit Ferdinand and Miranda. The three guilty nobles run off, distracted and in a frenzy, and Gonzalo and the attendant lords chase after to prevent them from doing \"what this ecstasy may now provoke them to.\"\nProspero then explains that he tested Ferdinand, and betroths a willing Miranda to him. He then asks Ariel to bring some other spirits and create a masque to entertain the young couple. These spirits present a blessing by Iris, Ceres, and Juno, followed by dancing. Prospero suddenly remembers the plot against his life, dismisses the spirits and Miranda and Ferdinand, and sets a trap for Caliban, Trinculo, and Stephano. They are chased offstage by goblins in the shape of hounds.\nProspero, all his enemies in his power, discovers that Ariel would pity them if he were \"human,\" and decides to forgive the people who tried to kill him. He tells Ariel to fetch the nobles while he breaks his charms.\nIn the conclusion, all the main characters are brought together before Prospero, who forgives Alonso, Antonio and Sebastian. Ariel is charged to prepare the proper sailing weather to guide the King's ship back to the Royal fleet and then to Naples, where Ferdinand and Miranda will be married. After discharging this task, Ariel will finally be free. Prospero pardons Caliban, who is sent to prepare Prospero's cell, to which Alonso and his party are invited for a final night before their departure. (It is however not made clear whether, after their departure, Caliban will remain on the island or whether he will be taken to Naples). Prospero indicates that he intends to entertain them with the story of his life on the island. Prospero has resolved to break and bury his magic staff, and \"drown\" his book of magic, and in his epilogue, shorn of his magic powers, he invites the audience to set him free from the island with their applause.\n\n", "full_text": "file was produced from images generously made available\nby The Internet Archive/Canadian Libraries)\n\n\n\n\n\n\n[Transcriber's Note:\n\nThis e-text is for readers who cannot use the \"real\" (unicode, utf-8)\nversion of the file. A few changes have been made. In particular,\nthe ligatures \"ae\" and \"oe\" have been unpacked to two letters. In\nNotes XI and XVIII, stressed syllables originally printed with accent\nmarks over the relevant vowels are here shown in ALL CAPITALS.\n\nThe text of _The Tempest_ is from Volume I of the nine-volume 1863\nCambridge edition of Shakespeare. The Preface (e-text 23041) and the\nother plays from this volume are each available as separate e-texts.\n\nGeneral Notes are in their original location at the end of the play.\nText-critical notes are grouped at the end of each Scene. All line\nnumbers are from the original text; line breaks in dialogue--including\nprose passages--are unchanged. Brackets are also unchanged; to avoid\nambiguity, footnotes and linenotes are given without added brackets.\nIn the notes, numerals printed as subscripts are shown inline as\nF1, F2, Q1....\n\nTexts cited in the Notes are listed at the end of the e-text.]\n\n\n\n\n  THE WORKS\n\n  of\n\n  WILLIAM SHAKESPEARE\n\n\n  Edited by\n\n  WILLIAM GEORGE CLARK, M.A.\n  Fellow and Tutor of Trinity College, and Public Orator\n  in the University of Cambridge;\n\n  and JOHN GLOVER, M.A.\n  Librarian Of Trinity College, Cambridge.\n\n\n  _VOLUME I._\n\n\n  Cambridge and London:\n  MACMILLAN AND CO.\n  1863.\n\n\n\n\nTHE TEMPEST.\n\n\n\n\nDRAMATIS PERSONAE[1].\n\n\n  ALONSO, King of Naples.\n  SEBASTIAN, his brother.\n  PROSPERO, the right Duke of Milan.\n  ANTONIO, his brother, the usurping Duke of Milan.\n  FERDINAND, son to the King of Naples.\n  GONZALO, an honest old Counsellor.\n  ADRIAN, Lord\n  FRANCISCO, \"\n  CALIBAN, a savage and deformed Slave.\n  TRINCULO, a Jester.\n  STEPHANO, a drunken Butler.\n  Master of a Ship.\n  Boatswain.\n  Mariners.\n\n  MIRANDA, daughter to Prospero.\n\n  ARIEL, an airy Spirit.\n  IRIS, presented by[2] Spirits.\n  CERES,     \"             \"\n  JUNO,      \"             \"\n  Nymphs,    \"             \"\n  Reapers,   \"             \"\n\n  Other Spirits attending on Prospero[3].\n\nSCENE--_A ship at sea[4]: an uninhabited island._\n\n\n  Footnotes:\n\n  1: DRAMATIS PERSONAE] NAMES OF THE ACTORS F1 at the end of the Play.\n  2: _presented by_] Edd.\n  3: _Other ... Prospero_] Theobald.\n  4: A ship at sea:] At sea: Capell.]\n\n\n\n\nTHE TEMPEST.\n\n\n\n\nACT I.\n\n\nSCENE I. _On a ship at sea: a tempestuous noise of thunder\nand lightning heard._\n\n  _Enter _a Ship-Master_ and _a Boatswain_._\n\n_Mast._ Boatswain!\n\n_Boats._ Here, master: what cheer?\n\n_Mast._ Good, speak to the mariners: fall to't, yarely, or\nwe run ourselves aground: bestir, bestir.    [_Exit._\n\n  _Enter _Mariners_._\n\n_Boats._ Heigh, my hearts! cheerly, cheerly, my hearts!              5\nyare, yare! Take in the topsail. Tend to the master's\nwhistle. Blow, till thou burst thy wind, if room enough!\n\n  _Enter ALONSO, SEBASTIAN, ANTONIO, FERDINAND, GONZALO,\n  and others._\n\n_Alon._ Good boatswain, have care. Where's the master?\nPlay the men.\n\n_Boats._ I pray now, keep below.                                    10\n\n_Ant._ Where is the master, boatswain?\n\n_Boats._ Do you not hear him? You mar our labour:\nkeep your cabins: you do assist the storm.\n\n_Gon._ Nay, good, be patient.\n\n_Boats._ When the sea is. Hence! What cares these                   15\nroarers for the name of king? To cabin: silence! trouble\nus not.\n\n_Gon._ Good, yet remember whom thou hast aboard.\n\n_Boats._ None that I more love than myself. You are a\nCounsellor; if you can command these elements to silence,           20\nand work the peace of the present, we will not hand a rope\nmore; use your authority: if you cannot, give thanks you\nhave lived so long, and make yourself ready in your cabin\nfor the mischance of the hour, if it so hap. Cheerly, good\nhearts! Out of our way, I say.    [_Exit._                          25\n\n_Gon._ I have great comfort from this fellow: methinks\nhe hath no drowning mark upon him; his complexion is\nperfect gallows. Stand fast, good Fate, to his hanging:\nmake the rope of his destiny our cable, for our own doth\nlittle advantage. If he be not born to be hanged, our case          30\nis miserable.    [_Exeunt._\n\n  _Re-enter Boatswain._\n\n_Boats._ Down with the topmast! yare! lower, lower!\nBring her to try with main-course. [_A cry within._] A\nplague upon this howling! they are louder than the weather\nor our office.                                                      35\n\n  _Re-enter SEBASTIAN, ANTONIO, and GONZALO._\n\nYet again! what do you here? Shall we give o'er, and\ndrown? Have you a mind to sink?\n\n_Seb._ A pox o' your throat, you bawling, blasphemous,\nincharitable dog!\n\n_Boats._ Work you, then.                                            40\n\n_Ant._ Hang, cur! hang, you whoreson, insolent noise-maker.\nWe are less afraid to be drowned than thou art.\n\n_Gon._ I'll warrant him for drowning; though the ship\nwere no stronger than a nutshell, and as leaky as an unstanched\nwench.                                                              45\n\n_Boats._ Lay her a-hold, a-hold! set her two courses off\nto sea again; lay her off.\n\n  _Enter _Mariners_ wet._\n\n_Mariners._ All lost! to prayers, to prayers! all lost!\n\n_Boats._ What, must our mouths be cold?\n\n_Gon._ The king and prince at prayers! let's assist them,           50\nFor our case is as theirs.\n\n_Seb._                   I'm out of patience.\n\n_Ant._ We are merely cheated of our lives by drunkards:\nThis wide-chapp'd rascal,--would thou mightst lie drowning\nThe washing of ten tides!\n\n_Gon._                  He'll be hang'd yet,\nThough every drop of water swear against it,                        55\nAnd gape at widest to glut him.\n\n  [_A confused noise within:_ \"Mercy on us!\"--\n  \"We split, we split!\"-- \"Farewell my wife and children!\"--\n  \"Farewell, brother!\"-- \"We split, we split, we split!\"]\n\n_Ant._ Let's all sink with the king.                                60\n\n_Seb._ Let's take leave of him. [_Exeunt Ant. and Seb._\n\n_Gon._ Now would I give a thousand furlongs of sea for\nan acre of barren ground, long heath, brown furze, any\nthing. The wills above be done! but I would fain die a\ndry death.    [_Exeunt._                                            65\n\n\n  Notes: I, 1.\n\n  SC. I. On a ship at sea] Pope.\n  Enter ... Boatswain] Collier MS. adds 'shaking off wet.'\n  3: _Good,_] Rowe. _Good:_ Ff. _Good._ Collier.\n  7: _till thou burst thy wind_] _till thou burst, wind_ Johnson conj.\n    _till thou burst thee, wind_ Steevens conj.\n  8: Capell adds stage direction [Exeunt Mariners aloft.\n  11: _boatswain_] Pope. _boson_ Ff.\n  11-18: Verse. S. Walker conj.\n  15: _cares_] _care_ Rowe. See note (I).\n  31:  [Exeunt] Theobald. [Exit. Ff.\n  33: _Bring her to try_] F4. _Bring her to Try_ F1 F2 F3.\n    _Bring her to. Try_ Story conj.\n  33-35: Text as in Capell. _A plague_--A cry within. Enter Sebastian,\n    Anthonio, and Gonzalo. _upon this howling._ Ff.\n  34-37: Verse. S. Walker conj.\n  43: _for_] _from_ Theobald.\n  46: _two courses off to sea_] _two courses; off to sea_ Steevens\n    (Holt conj.).\n  46: [Enter...] [Re-enter... Dyce.\n  47: [Exeunt. Theobald.\n  50: _at_] _are at_ Rowe.\n  50-54: Printed as prose in Ff.\n  56: _to glut_] _t' englut_ Johnson conj.\n  57: See note (II).\n  59: _Farewell, brother!_] _Brother, farewell!_ Theobald.\n  60: _with the_] Rowe. _with'_ F1 F2. _with_ F3 F4.\n  61: [Exeunt A. and S.] [Exit. Ff.\n  63: _furze_ Rowe. _firrs_ F1 F2 F3. _firs_ F4.\n  _long heath, brown furze_] _ling, heath, broom, furze_ Hanmer.]\n  65: [Exeunt] [Exit F1, om. F2 F3 F4.]\n\n\nSCENE II. _The island. Before PROSPERO'S cell._\n\n  _Enter PROSPERO and MIRANDA._\n\n_Mir._ If by your art, my dearest father, you have\nPut the wild waters in this roar, allay them.\nThe sky, it seems, would pour down stinking pitch,\nBut that the sea, mounting to the welkin's cheek,\nDashes the fire out. O, I have suffer'd                              5\nWith those that I saw suffer! a brave vessel,\nWho had, no doubt, some noble creature in her,\nDash'd all to pieces. O, the cry did knock\nAgainst my very heart! Poor souls, they perish'd!\nHad I been any god of power, I would                                10\nHave sunk the sea within the earth, or ere\nIt should the good ship so have swallow'd and\nThe fraughting souls within her.\n\n_Pros._                        Be collected:\nNo more amazement: tell your piteous heart\nThere's no harm done.\n\n_Mir._              O, woe the day!\n\n_Pros._                           No harm.                          15\nI have done nothing but in care of thee,\nOf thee, my dear one, thee, my daughter, who\nArt ignorant of what thou art, nought knowing\nOf whence I am, nor that I am more better\nThan Prospero, master of a full poor cell,                          20\nAnd thy no greater father.\n\n_Mir._                   More to know\nDid never meddle with my thoughts.\n\n_Pros._                          'Tis time\nI should inform thee farther. Lend thy hand,\nAnd pluck my magic garment from me. --So:\n                                [_Lays down his mantle._\nLie there, my art. Wipe thou thine eyes; have comfort.              25\nThe direful spectacle of the wreck, which touch'd\nThe very virtue of compassion in thee,\nI have with such provision in mine art\nSo safely order'd, that there is no soul,\nNo, not so much perdition as an hair                                30\nBetid to any creature in the vessel\nWhich thou heard'st cry, which thou saw'st sink. Sit down;\nFor thou must now know farther.\n\n_Mir._                        You have often\nBegun to tell me what I am; but stopp'd,\nAnd left me to a bootless inquisition,                              35\nConcluding \"Stay: not yet.\"\n\n_Pros._                The hour's now come;\nThe very minute bids thee ope thine ear;\nObey, and be attentive. Canst thou remember\nA time before we came unto this cell?\nI do not think thou canst, for then thou wast not                   40\nOut three years old.\n\n_Mir._             Certainly, sir, I can.\n\n_Pros._ By what? by any other house or person?\nOf any thing the image tell me that\nHath kept with thy remembrance.\n\n_Mir._                        'Tis far off,\nAnd rather like a dream than an assurance                           45\nThat my remembrance warrants. Had I not\nFour or five women once that tended me?\n\n_Pros._ Thou hadst, and more, Miranda. But how is it\nThat this lives in thy mind? What seest thou else\nIn the dark backward and abysm of time?                             50\nIf thou remember'st ought ere thou camest here,\nHow thou camest here thou mayst.\n\n_Mir._                         But that I do not.\n\n_Pros._ Twelve year since, Miranda, twelve year since,\nThy father was the Duke of Milan, and\nA prince of power.\n\n_Mir._           Sir, are not you my father?                        55\n\n_Pros._ Thy mother was a piece of virtue, and\nShe said thou wast my daughter; and thy father\nWas Duke of Milan; and his only heir\nAnd princess, no worse issued.\n\n_Mir._                       O the heavens!\nWhat foul play had we, that we came from thence?                    60\nOr blessed was't we did?\n\n_Pros._                Both, both, my girl:\nBy foul play, as thou say'st, were we heaved thence;\nBut blessedly holp hither.\n\n_Mir._                   O, my heart bleeds\nTo think o' the teen that I have turn'd you to.\nWhich is from my remembrance! Please you, farther.                  65\n\n_Pros._ My brother, and thy uncle, call'd Antonio,--\nI pray thee, mark me,--that a brother should\nBe so perfidious!--he whom, next thyself,\nOf all the world I loved, and to him put\nThe manage of my state; as, at that time,                           70\nThrough all the signories it was the first,\nAnd Prospero the prime duke, being so reputed\nIn dignity, and for the liberal arts\nWithout a parallel; those being all my study,\nThe government I cast upon my brother,                              75\nAnd to my state grew stranger, being transported\nAnd rapt in secret studies. Thy false uncle--\nDost thou attend me?\n\n_Mir._             Sir, most heedfully.\n\n_Pros._ Being once perfected how to grant suits,\nHow to deny them, whom to advance, and whom                         80\nTo trash for over-topping, new created\nThe creatures that were mine, I say, or changed 'em,\nOr else new form'd 'em; having both the key\nOf officer and office, set all hearts i' the state\nTo what tune pleased his ear; that now he was                       85\nThe ivy which had hid my princely trunk,\nAnd suck'd my verdure out on't. Thou attend'st not.\n\n_Mir._ O, good sir, I do.\n\n_Pros._                 I pray thee, mark me.\nI, thus neglecting worldly ends, all dedicated\nTo closeness and the bettering of my mind                           90\nWith that which, but by being so retired,\nO'er-prized all popular rate, in my false brother\nAwaked an evil nature; and my trust,\nLike a good parent, did beget of him\nA falsehood in its contrary, as great                               95\nAs my trust was; which had indeed no limit,\nA confidence sans bound. He being thus lorded,\nNot only with what my revenue yielded,\nBut what my power might else exact, like one\nWho having into truth, by telling of it,                           100\nMade such a sinner of his memory,\nTo credit his own lie, he did believe\nHe was indeed the duke; out o' the substitution,\nAnd executing the outward face of royalty,\nWith all prerogative:--hence his ambition growing,--               105\nDost thou hear?\n\n_Mir._        Your tale, sir, would cure deafness.\n\n_Pros._ To have no screen between this part he play'd\nAnd him he play'd it for, he needs will be\nAbsolute Milan. Me, poor man, my library\nWas dukedom large enough: of temporal royalties                    110\nHe thinks me now incapable; confederates,\nSo dry he was for sway, wi' the King of Naples\nTo give him annual tribute, do him homage,\nSubject his coronet to his crown, and bend\nThe dukedom, yet unbow'd,--alas, poor Milan!--                     115\nTo most ignoble stooping.\n\n_Mir._                  O the heavens!\n\n_Pros._ Mark his condition, and th' event; then tell me\nIf this might be a brother.\n\n_Mir._                    I should sin\nTo think but nobly of my grandmother:\nGood wombs have borne bad sons.\n\n_Pros._                       Now the condition.                   120\nThis King of Naples, being an enemy\nTo me inveterate, hearkens my brother's suit;\nWhich was, that he, in lieu o' the premises,\nOf homage and I know not how much tribute,\nShould presently extirpate me and mine                             125\nOut of the dukedom, and confer fair Milan,\nWith all the honours, on my brother: whereon,\nA treacherous army levied, one midnight\nFated to the purpose, did Antonio open\nThe gates of Milan; and, i' the dead of darkness,                  130\nThe ministers for the purpose hurried thence\nMe and thy crying self.\n\n_Mir._                Alack, for pity!\nI, not remembering how I cried out then,\nWill cry it o'er again: it is a hint\nThat wrings mine eyes to't.\n\n_Pros._                   Hear a little further,                   135\nAnd then I'll bring thee to the present business\nWhich now's upon 's; without the which, this story\nWere most impertinent.\n\n_Mir._               Wherefore did they not\nThat hour destroy us?\n\n_Pros._             Well demanded, wench:\nMy tale provokes that question. Dear, they durst not,              140\nSo dear the love my people bore me; nor set\nA mark so bloody on the business; but\nWith colours fairer painted their foul ends.\nIn few, they hurried us aboard a bark,\nBore us some leagues to sea; where they prepared                   145\nA rotten carcass of a boat, not rigg'd,\nNor tackle, sail, nor mast; the very rats\nInstinctively have quit it: there they hoist us,\nTo cry to the sea that roar'd to us; to sigh\nTo the winds, whose pity, sighing back again,                      150\nDid us but loving wrong.\n\n_Mir._                 Alack, what trouble\nWas I then to you!\n\n_Pros._          O, a cherubin\nThou wast that did preserve me. Thou didst smile,\nInfused with a fortitude from heaven,\nWhen I have deck'd the sea with drops full salt,                   155\nUnder my burthen groan'd; which raised in me\nAn undergoing stomach, to bear up\nAgainst what should ensue.\n\n_Mir._                   How came we ashore?\n\n_Pros._ By Providence divine.\nSome food we had, and some fresh water, that                       160\nA noble Neapolitan, Gonzalo,\nOut of his charity, who being then appointed\nMaster of this design, did give us, with\nRich garments, linens, stuffs and necessaries,\nWhich since have steaded much; so, of his gentleness,              165\nKnowing I loved my books, he furnish'd me\nFrom mine own library with volumes that\nI prize above my dukedom.\n\n_Mir._                  Would I might\nBut ever see that man!\n\n_Pros._              Now I arise:  [_Resumes his mantle._\nSit still, and hear the last of our sea-sorrow.                    170\nHere in this island we arrived; and here\nHave I, thy schoolmaster, made thee more profit\nThan other princesses can, that have more time\nFor vainer hours, and tutors not so careful.\n\n_Mir._ Heavens thank you for't! And now, I pray you, sir,          175\nFor still 'tis beating in my mind, your reason\nFor raising this sea-storm?\n\n_Pros._                   Know thus far forth.\nBy accident most strange, bountiful Fortune,\nNow my dear lady, hath mine enemies\nBrought to this shore; and by my prescience                        180\nI find my zenith doth depend upon\nA most auspicious star, whose influence\nIf now I court not, but omit, my fortunes\nWill ever after droop. Here cease more questions:\nThou art inclined to sleep; 'tis a good dulness,                   185\nAnd give it way: I know thou canst not choose.\n                                        [_Miranda sleeps._\nCome away, servant, come. I am ready now.\nApproach, my Ariel, come.\n\n  _Enter _ARIEL_._\n\n_Ari._ All hail, great master! grave sir, hail! I come\nTo answer thy best pleasure; be't to fly,                          190\nTo swim, to dive into the fire, to ride\nOn the curl'd clouds, to thy strong bidding task\nAriel and all his quality.\n\n_Pros._                  Hast thou, spirit,\nPerform'd to point the tempest that I bade thee?\n\n_Ari._ To every article.                                           195\nI boarded the king's ship; now on the beak,\nNow in the waist, the deck, in every cabin,\nI flamed amazement: sometime I'ld divide,\nAnd burn in many places; on the topmast,\nThe yards and bowsprit, would I flame distinctly,                  200\nThen meet and join. Jove's lightnings, the precursors\nO' the dreadful thunder-claps, more momentary\nAnd sight-outrunning were not: the fire and cracks\nOf sulphurous roaring the most mighty Neptune\nSeem to besiege, and make his bold waves tremble,                  205\nYea, his dread trident shake.\n\n_Pros._                     My brave spirit!\nWho was so firm, so constant, that this coil\nWould not infect his reason?\n\n_Ari._                     Not a soul\nBut felt a fever of the mad, and play'd\nSome tricks of desperation. All but mariners                       210\nPlunged in the foaming brine, and quit the vessel,\nThen all afire with me: the king's son, Ferdinand,\nWith hair up-staring,--then like reeds, not hair,--\nWas the first man that leap'd; cried, \"Hell is empty,\nAnd all the devils are here.\"\n\n_Pros._                 Why, that's my spirit!                     215\nBut was not this nigh shore?\n\n_Ari._                    Close by, my master.\n\n_Pros._ But are they, Ariel, safe?\n\n_Ari._                           Not a hair perish'd;\nOn their sustaining garments not a blemish,\nBut fresher than before: and, as thou badest me,\nIn troops I have dispersed them 'bout the isle.                    220\nThe king's son have I landed by himself;\nWhom I left cooling of the air with sighs\nIn an odd angle of the isle, and sitting,\nHis arms in this sad knot.\n\n_Pros._                  Of the king's ship\nThe mariners, say how thou hast disposed,                          225\nAnd all the rest o' the fleet.\n\n_Ari._                       Safely in harbour\nIs the king's ship; in the deep nook, where once\nThou call'dst me up at midnight to fetch dew\nFrom the still-vex'd Bermoothes, there she's hid:\nThe mariners all under hatches stow'd;                             230\nWho, with a charm join'd to their suffer'd labour,\nI have left asleep: and for the rest o' the fleet,\nWhich I dispersed, they all have met again,\nAnd are upon the Mediterranean flote,\nBound sadly home for Naples;                                       235\nSupposing that they saw the king's ship wreck'd,\nAnd his great person perish.\n\n_Pros._                    Ariel, thy charge\nExactly is perform'd: but there's more work.\nWhat is the time o' the day?\n\n_Ari._                     Past the mid season.\n\n_Pros._ At least two glasses. The time 'twixt six and now          240\nMust by us both be spent most preciously.\n\n_Ari._ Is there more toil? Since thou dost give me pains,\nLet me remember thee what thou hast promised,\nWhich is not yet perform'd me.\n\n_Pros._                      How now? moody?\nWhat is't thou canst demand?\n\n_Ari._                     My liberty.                             245\n\n_Pros._ Before the time be out? no more!\n\n_Ari._                                 I prithee,\nRemember I have done thee worthy service;\nTold thee no lies, made thee no mistakings, served\nWithout or grudge or grumblings: thou didst promise\nTo bate me a full year.\n\n_Pros._               Dost thou forget                             250\nFrom what a torment I did free thee?\n\n_Ari._                             No.\n\n_Pros._ Thou dost; and think'st it much to tread the ooze\nOf the salt deep,\nTo run upon the sharp wind of the north,\nTo do me business in the veins o' the earth                        255\nWhen it is baked with frost.\n\n_Ari._                     I do not, sir.\n\n_Pros._ Thou liest, malignant thing! Hast thou forgot\nThe foul witch Sycorax, who with age and envy\nWas grown into a hoop? hast thou forgot her?\n\n_Ari._ No, sir.\n\n_Pros._       Thou hast. Where was she born? speak; tell me.       260\n\n_Ari._ Sir, in Argier.\n\n_Pros._              O, was she so? I must\nOnce in a month recount what thou hast been,\nWhich thou forget'st. This damn'd witch Sycorax,\nFor mischiefs manifold, and sorceries terrible\nTo enter human hearing, from Argier,                               265\nThou know'st, was banish'd: for one thing she did\nThey would not take her life. Is not this true?\n\n_Ari._ Ay, sir.\n\n_Pros._ This blue-eyed hag was hither brought with child,\nAnd here was left by the sailors. Thou, my slave,                  270\nAs thou report'st thyself, wast then her servant;\nAnd, for thou wast a spirit too delicate\nTo act her earthy and abhorr'd commands,\nRefusing her grand hests, she did confine thee,\nBy help of her more potent ministers,                              275\nAnd in her most unmitigable rage,\nInto a cloven pine; within which rift\nImprison'd thou didst painfully remain\nA dozen years; within which space she died,\nAnd left thee there; where thou didst vent thy groans              280\nAs fast as mill-wheels strike. Then was this island--\nSave for the son that she did litter here,\nA freckled whelp hag-born--not honour'd with\nA human shape.\n\n_Ari._       Yes, Caliban her son.\n\n_Pros._ Dull thing, I say so; he, that Caliban,                    285\nWhom now I keep in service. Thou best know'st\nWhat torment I did find thee in; thy groans\nDid make wolves howl, and penetrate the breasts\nOf ever-angry bears: it was a torment\nTo lay upon the damn'd, which Sycorax                              290\nCould not again undo: it was mine art,\nWhen I arrived and heard thee, that made gape\nThe pine, and let thee out.\n\n_Ari._                    I thank thee, master.\n\n_Pros._ If thou more murmur'st, I will rend an oak,\nAnd peg thee in his knotty entrails, till                          295\nThou hast howl'd away twelve winters.\n\n_Ari._                              Pardon, master:\nI will be correspondent to command,\nAnd do my spiriting gently.\n\n_Pros._                   Do so; and after two days\nI will discharge thee.\n\n_Ari._               That's my noble master!\nWhat shall I do? say what; what shall I do?                        300\n\n_Pros._ Go make thyself like a nymph o' the sea:\nBe subject to no sight but thine and mine; invisible\nTo every eyeball else. Go take this shape,\nAnd hither come in't: go, hence with diligence!\n\n    [_Exit Ariel._\n\nAwake, dear heart, awake! thou hast slept well;                    305\nAwake!\n\n_Mir._ The strangeness of your story put\nHeaviness in me.\n\n_Pros._        Shake it off. Come on;\nWe'll visit Caliban my slave, who never\nYields us kind answer.\n\n_Mir._               'Tis a villain, sir,\nI do not love to look on.\n\n_Pros._                 But, as 'tis,                              310\nWe cannot miss him: he does make our fire,\nFetch in our wood, and serves in offices\nThat profit us. What, ho! slave! Caliban!\nThou earth, thou! speak.\n\n_Cal._ [_within_] There's wood enough within.\n\n_Pros._ Come forth, I say! there's other business for thee:        315\nCome, thou tortoise! when?\n\n  _Re-enter ARIEL like a water-nymph._\n\nFine apparition! My quaint Ariel,\nHark in thine ear.\n\n_Ari._           My lord, it shall be done.    [_Exit._\n\n_Pros._ Thou poisonous slave, got by the devil himself\nUpon thy wicked dam, come forth!                                   320\n\n  _Enter CALIBAN._\n\n_Cal._ As wicked dew as e'er my mother brush'd\nWith raven's feather from unwholesome fen\nDrop on you both! a south-west blow on ye\nAnd blister you all o'er!\n\n_Pros._ For this, be sure, to-night thou shalt have cramps,        325\nSide-stitches that shall pen thy breath up; urchins\nShall, for that vast of night that they may work,\nAll exercise on thee; thou shalt be pinch'd\nAs thick as honeycomb, each pinch more stinging\nThan bees that made 'em.\n\n_Cal._                 I must eat my dinner.                       330\nThis island's mine, by Sycorax my mother,\nWhich thou takest from me. When thou camest first,\nThou strokedst me, and madest much of me; wouldst give me\nWater with berries in't; and teach me how\nTo name the bigger light, and how the less,                        335\nThat burn by day and night: and then I loved thee,\nAnd show'd thee all the qualities o' th' isle,\nThe fresh springs, brine-pits, barren place and fertile:\nCurs'd be I that did so! All the charms\nOf Sycorax, toads, beetles, bats, light on you!                    340\nFor I am all the subjects that you have,\nWhich first was mine own king: and here you sty me\nIn this hard rock, whiles you do keep from me\nThe rest o' th' island.\n\n_Pros._               Thou most lying slave,\nWhom stripes may move, not kindness! I have used thee,             345\nFilth as thou art, with human care; and lodged thee\nIn mine own cell, till thou didst seek to violate\nThe honour of my child.\n\n_Cal._ O ho, O ho! would 't had been done!\nThou didst prevent me; I had peopled else                          350\nThis isle with Calibans.\n\n_Pros._                Abhorred slave,\nWhich any print of goodness wilt not take,\nBeing capable of all ill! I pitied thee,\nTook pains to make thee speak, taught thee each hour\nOne thing or other: when thou didst not, savage,                   355\nKnow thine own meaning, but wouldst gabble like\nA thing most brutish, I endow'd thy purposes\nWith words that made them known. But thy vile race,\nThough thou didst learn, had that in't which good natures\nCould not abide to be with; therefore wast thou                    360\nDeservedly confined into this rock,\nWho hadst deserved more than a prison.\n\n_Cal._ You taught me language; and my profit on't\nIs, I know how to curse. The red plague rid you\nFor learning me your language!\n\n_Pros._                      Hag-seed, hence!                      365\nFetch us in fuel; and be quick, thou'rt best,\nTo answer other business. Shrug'st thou, malice?\nIf thou neglect'st, or dost unwillingly\nWhat I command, I'll rack thee with old cramps,\nFill all thy bones with aches, make thee roar,                     370\nThat beasts shall tremble at thy din.\n\n_Cal._                              No, pray thee.\n[_Aside_] I must obey: his art is of such power,\nIt would control my dam's god, Setebos,\nAnd make a vassal of him.\n\n_Pros._                 So, slave; hence!    [_Exit Caliban._\n\n  _Re-enter ARIEL, invisible, playing and singing; FERDINAND\n  following._\n\n_ARIEL'S song._\n\n    Come unto these yellow sands,                                  375\n        And then take hands:\n    Courtsied when you have and kiss'd\n        The wild waves whist:\n    Foot it featly here and there;\n    And, sweet sprites, the burthen bear.                          380\n\n _Burthen_ [_dispersedly_]. Hark, hark!\n                           Bow-wow.\n        The watch-dogs bark:\n                            Bow-wow.\n\n_Ari._  Hark, hark! I hear\n        The strain of strutting chanticleer                        385\n        Cry, Cock-a-diddle-dow.\n\n_Fer._ Where should this music be? i' th' air or th' earth?\nIt sounds no more: and, sure, it waits upon\nSome god o' th' island. Sitting on a bank,\nWeeping again the king my father's wreck,                          390\nThis music crept by me upon the waters,\nAllaying both their fury and my passion\nWith its sweet air: thence I have follow'd it.\nOr it hath drawn me rather. But 'tis gone.\nNo, it begins again.                                               395\n\n_ARIEL sings._\n\n    Full fathom five thy father lies;\n        Of his bones are coral made;\n    Those are pearls that were his eyes:\n        Nothing of him that doth fade,\n    But doth suffer a sea-change                                   400\n    Into something rich and strange.\n    Sea-nymphs hourly ring his knell:\n\n                    _Burthen:_ Ding-dong.\n\n_Ari._ Hark! now I hear them,--Ding-dong, bell.\n\n_Fer._ The ditty does remember my drown'd father.                  405\nThis is no mortal business, nor no sound\nThat the earth owes:--I hear it now above me.\n\n_Pros._ The fringed curtains of thine eye advance,\nAnd say what thou seest yond.\n\n_Mir._                      What is't? a spirit?\nLord, how it looks about! Believe me, sir,                         410\nIt carries a brave form. But 'tis a spirit.\n\n_Pros._ No, wench; it eats and sleeps and hath such senses\nAs we have, such. This gallant which thou seest\nWas in the wreck; and, but he's something stain'd\nWith grief, that's beauty's canker, thou mightst call him          415\nA goodly person: he hath lost his fellows,\nAnd strays about to find 'em.\n\n_Mir._                      I might call him\nA thing divine; for nothing natural\nI ever saw so noble.\n\n_Pros._ [_Aside_] It goes on, I see,\nAs my soul prompts it. Spirit, fine spirit! I'll free thee         420\nWithin two days for this.\n\n_Fer._                  Most sure, the goddess\nOn whom these airs attend! Vouchsafe my prayer\nMay know if you remain upon this island;\nAnd that you will some good instruction give\nHow I may bear me here: my prime request,                          425\nWhich I do last pronounce, is, O you wonder!\nIf you be maid or no?\n\n_Mir._              No wonder, sir;\nBut certainly a maid.\n\n_Fer._              My language! heavens!\nI am the best of them that speak this speech,\nWere I but where 'tis spoken.\n\n_Pros._                     How? the best?                         430\nWhat wert thou, if the King of Naples heard thee?\n\n_Fer._ A single thing, as I am now, that wonders\nTo hear thee speak of Naples. He does hear me;\nAnd that he does I weep: myself am Naples,\nWho with mine eyes, never since at ebb, beheld                     435\nThe king my father wreck'd.\n\n_Mir._                    Alack, for mercy!\n\n_Fer._ Yes, faith, and all his lords; the Duke of Milan\nAnd his brave son being twain.\n\n_Pros._                      [_Aside_] The Duke of Milan\nAnd his more braver daughter could control thee,\nIf now 'twere fit to do't. At the first sight                      440\nThey have changed eyes. Delicate Ariel,\nI'll set thee free for this. [_To Fer._] A word, good sir;\nI fear you have done yourself some wrong: a word.\n\n_Mir._ Why speaks my father so ungently? This\nIs the third man that e'er I saw; the first                        445\nThat e'er I sigh'd for: pity move my father\nTo be inclined my way!\n\n_Fer._               O, if a virgin,\nAnd your affection not gone forth, I'll make you\nThe queen of Naples.\n\n_Pros._            Soft, sir! one word more.\n[_Aside_] They are both in either's powers:\n        but this swift business                                    450\nI must uneasy make, lest too light winning\nMake the prize light. [_To Fer._] One word more; I charge thee\nThat thou attend me: thou dost here usurp\nThe name thou owest not; and hast put thyself\nUpon this island as a spy, to win it                               455\nFrom me, the lord on't.\n\n_Fer._                No, as I am a man.\n\n_Mir._ There's nothing ill can dwell in such a temple:\nIf the ill spirit have so fair a house,\nGood things will strive to dwell with't.\n\n_Pros._                                Follow me.\nSpeak not you for him; he's a traitor. Come;                       460\nI'll manacle thy neck and feet together:\nSea-water shalt thou drink; thy food shall be\nThe fresh-brook muscles, wither'd roots, and husks\nWherein the acorn cradled. Follow.\n\n_Fer._                           No;\nI will resist such entertainment till                              465\nMine enemy has more power.\n            [_Draws, and is charmed from moving._\n\n_Mir._                O dear father,\nMake not too rash a trial of him, for\nHe's gentle, and not fearful.\n\n_Pros._                     What! I say,\nMy foot my tutor? Put thy sword up, traitor;\nWho makest a show, but darest not strike, thy conscience           470\nIs so possess'd with guilt: come from thy ward;\nFor I can here disarm thee with this stick\nAnd make thy weapon drop.\n\n_Mir._                  Beseech you, father.\n\n_Pros._ Hence! hang not on my garments.\n\n_Mir._                                Sir, have pity;\nI'll be his surety.\n\n_Pros._           Silence! one word more                           475\nShall make me chide thee, if not hate thee. What!\nAn advocate for an impostor! hush!\nThou think'st there is no more such shapes as he,\nHaving seen but him and Caliban: foolish wench!\nTo the most of men this is a Caliban,                              480\nAnd they to him are angels.\n\n_Mir._                    My affections\nAre, then, most humble; I have no ambition\nTo see a goodlier man.\n\n_Pros._              Come on; obey:\nThy nerves are in their infancy again,\nAnd have no vigour in them.\n\n_Fer._             So they are:                                    485\nMy spirits, as in a dream, are all bound up.\nMy father's loss, the weakness which I feel,\nThe wreck of all my friends, nor this man's threats,\nTo whom I am subdued, are but light to me,\nMight I but through my prison once a day                           490\nBehold this maid: all corners else o' th' earth\nLet liberty make use of; space enough\nHave I in such a prison.\n\n_Pros._ [_Aside_]      It works. [_To Fer._] Come on.\nThou hast done well, fine Ariel! [_To Fer._] Follow me.\n[_To Ari._] Hark what thou else shalt do me.\n\n_Mir._                                     Be of comfort;          495\nMy father's of a better nature, sir,\nThan he appears by speech: this is unwonted\nWhich now came from him.\n\n_Pros._                Thou shalt be as free\nAs mountain winds: but then exactly do\nAll points of my command.\n\n_Ari._                  To the syllable.                           500\n\n_Pros._ Come, follow. Speak not for him.    [_Exeunt._\n\n\n  Notes: I, 2.\n\n  3: _stinking_] _flaming_ Singer conj. _kindling_ S. Verges conj.\n  4: _cheek_] _heat_ Collier MS. _crack_ Staunton conj.\n  7: _creature_] _creatures_ Theobald.\n  13: _fraughting_] Ff. _fraighted_ Pope. _fraighting_ Theobald.\n    _freighting_ Steevens.\n  15: Mir. _O, woe the day!_ Pros. _No harm._] Mir. _O woe the day!\n    no harm?_ Johnson conj.\n  19: _I am more better_] _I'm more or better_ Pope.\n  24: [Lays ... mantle] Pope.\n  28: _provision_] F1. _compassion_ F2 F3 F4. _prevision_ Hunter conj.\n  29: _soul_] _soul lost_ Rowe. _foyle_ Theobald. _soil_ Johnson conj.\n    _loss_ Capell. _foul_ Wright conj.\n  31: _betid_] F1. _betide_ F2 F3 F4.\n  35: _a_] F1. _the_ F2 F3 F4.\n  38: _thou_] om. Pope.\n  41: _Out_] _Full_ Pope (after Dryden). _Quite_ Collier MS.\n  44: _with_] _in_ Pope (after Dryden).\n  53: _Twelve year ... year_] _Tis twelve years ... years_ Pope.\n  58, 59: _and his only heir And princess_] _and his only heir\n    A princess_ Pope. _thou his only heir And princess_ Steevens.\n    _and though his only heir A princess_] Johnson conj.\n  63: _holp_] _help'd_ Pope.\n  _O, my heart_] _My heart_ Pope.\n  78: _me_] om. F3 F4.\n  80: _whom ... whom_] F2 F3 F4. _who ... who_ F1.\n  81: _trash_] _plash_ Hanmer.\n  82, 83: _'em ... 'em_] _them ... them_ Capell.\n  84: _i' the state_] _i'th state_ F1. _e'th state_ F2.\n    _o'th state_ F3 F4. om. Pope.\n  88: _O, good sir ... mark me._] _Good sir ... mark me then._ Pope.\n    _O yes, good sir ... mark me._ Capell.\n  Mir. _O, ... do._ Pros. _I ... me_] _I ... me._ Mir. _O ... do._\n    Steevens.\n  89: _dedicated_] _dedicate_ Steevens (Ritson conj.).\n  91: _so_] F1. om. F2 F3 F4.\n  97: _lorded_] _loaded_ Collier MS.\n  99: _exact, like_] _exact. Like_ Ff.\n  100: _having into truth ... of it_] _loving an untruth, and telling\n    't oft_ Hanmer. _having unto truth ... oft_ Warburton. _having to\n    untruth ... of it_ Collier MS. _having sinn'd to truth ... oft_\n    Musgrave conj.\n  _telling_] _quelling_ S. Verges conj.\n  101: _Made ... memory_] _Makes ... memory_ Hanmer. _Makes ...\n    memory too_ Musgrave conj.\n  103: _indeed the duke_] _the duke_ Steevens. _indeed duke_ S. Walker\n    conj.\n  _out o' the_] _from_ Pope.\n  105: _his_] _is_ F2.\n  105, 106: _ambition growing_] _ambition Growing_ Steevens.\n  106: _hear?_] _hear, child?_ Hanmer.\n  109: _Milan_] _Millanie_ F1 (Capell's copy).\n  112: _wi' the_] Capell. _with_ Ff. _wi' th'_ Rowe. _with the_\n    Steevens.\n  116: _most_] F1. _much_ F2 F3 F4.\n  119: _but_] _not_ Pope.\n  120: _Good ... sons_] Theobald suggested that these words should be\n    given to Prospero. Hanmer prints them so.\n  122: _hearkens_] _hears_ Pope. _hearks_ Theobald.\n  129: _Fated_] _Mated_ Dryden's version.\n  _purpose_] _practise_ Collier MS.\n  131: _ministers_] _minister_ Rowe.\n  133: _out_] _on't_ Steevens conj.\n  135: _to 't_] om. Steevens (Farmer conj.).\n  138: _Wherefore_] _Why_ Pope.\n  141: _me_] om. Pope.\n  146: _boat_] Rowe (after Dryden). _butt_ F1 F2 F3. _but_ F4.\n    _busse_ Black conj.\n  147: _sail_] F1. _nor sail_ F2 F3 F4.\n  148: _have_] _had_ Rowe (after Dryden).\n  150: _the winds_] _winds_ Pope.\n  155: _deck'd_] _brack'd_ Hanmer. _mock'd_ Warburton. _fleck'd_\n    Johnson conj. _degg'd_ anon. ap. Reed conj.\n  162: _who_] om. Pope. _he_ Steevens conj.\n  169: _Now I arise_] Continued to Miranda. Blackstone conj.\n  [Resumes his mantle] om. Ff. [Put on robe again. Collier MS.\n  173: _princesses_] _princesse_ F1 F2 F3. _princess_ F4.\n    _princes_ Rowe. _princess'_ Dyce (S. Walker conj.). See note (III).\n  186: [M. sleeps] Theobald.\n  189: SCENE III. Pope.\n  190: _be't_] F1. _be it_ F2 F3 F4.\n  193: _quality_] _qualities_ Pope (after Dryden).\n  198: _sometime_] F1. _sometimes_ F2 F3 F4.\n  200: _bowsprit_] _bore-sprit_ Ff. _bolt-sprit_ Rowe.\n  201: _lightnings_] Theobald. _lightning_ Ff.\n  202: _o' the_] _of_ Pope.\n  _thunder-claps_] _thunder-clap_ Johnson.\n  205: _Seem_] _Seem'd_ Theobald.\n  206: _dread_] F1. _dead_ F2 F3 F4.\n  _My brave_] _My brave, brave_ Theobald. _That's my brave_ Hanmer.\n  209: _mad_] _mind_ Pope (after Dryden).\n  211, 212: _vessel, ... son_] _vessell; Then all a fire with me\n    the King's sonne_ Ff.\n  218: _sustaining_] _sea-stained_ Edwards conj. _unstaining_ or\n    _sea-staining_ Spedding conj.\n  229: _Bermoothes_] _Bermudas_ Theobald.\n  231: _Who_] _Whom_ Hanmer.\n  234: _are_] _all_ Collier MS.\n  _upon_] _on_ Pope.\n  239-240: Ari. _Past the mid season._ Pros. _At least two glasses_]\n    Ari. _Past the mid season at least two glasses._ Warburton.\n    Pros. _... Past the mid season?_ Ari. _At least two glasses_\n    Johnson conj.\n  244: _How now? moody?_] _How now, moody!_ Dyce (so Dryden, ed. 1808).\n  245: _What_] F1. _Which_ F2 F3 F4.\n  248: _made thee_] Ff. _made_ Pope.\n  249: _didst_] F3 F4. _did_ F1 F2.\n  264: _and sorceries_] _sorceries too_ Hanmer.\n  267: _Is not this true?_] _Is this not true?_ Pope.\n  271: _wast then_] Rowe (after Dryden). _was then_ Ff.\n  273: _earthy_] _earthly_ Pope.\n  282: _son_] F1. _sunne_ F2. _sun_ F3 F4.\n  _she_] Rowe (after Dryden). _he_ Ff.\n  298: See note (IV).\n  301: _like_] F1. _like to_ F2 F3 F4.\n  302: _Be subject to_] _be subject To_ Malone.\n  _but thine and mine_] _but mine_ Pope.\n  304: _in't_] _in it_ Pope.\n  _go, hence_] _goe: hence_ Ff. _go hence_ Pope. _hence_ Hanmer.\n  307: _Heaviness_] _Strange heaviness_ Edd. conj.\n  312: _serves in offices_] F1. _serves offices_ F2 F3 F4.\n    _serveth offices_ Collier MS.\n  316: _Come, thou tortoise! when?_] om. Pope.\n  _Come_] _Come forth_ Steevens.]\n  320: _come forth!_] _come forth, thou tortoise!_ Pope.\n  321: SCENE IV. Pope.\n  332: _camest_] Rowe. _cam'st_ Ff. _cam'st here_ Ritson conj.\n  333: _madest_] Rowe (after Dryden). _made_ Ff.\n  339: _Curs'd be I that_] F1. _Curs'd be I that I_ F2 F3 F4.\n    _cursed be I that_ Steevens.\n  342: _Which_] _Who_ Pope, and at line 351.\n  346: _thee_] om. F4.\n  349: _would 't_] Ff. _I wou'd it_ Pope.\n  351: Pros.] Theobald (after Dryden). Mira. Ff.\n  352: _wilt_] F1. _will_ F2 F3 F4.\n  355, 356: _didst not ... Know_] _couldst not ... Shew_ Hanmer.\n  356: _wouldst_] _didst_ Hanmer.\n  361, 362: _Deservedly ... deserved_] _Justly ... who hadst Deserv'd_\n    S. Walker conj. _Confin'd ... deserv'd_ id. conj.\n  362: _Who ... prison_] om. Pope (after Dryden).\n  366: _thou'rt_] F1 F2 F3. _thou art_ F4. _thou wer't_ Rowe.\n  375: SCENE V. Pope.\n  following.] Malone.\n  378: _The wild waves whist_] Printed as a parenthesis by Steevens.\n    See note (V).\n  380: _the burthen bear_] Pope. _bear the burthen_ Ff.\n  381-383: Steevens gives _Hark, hark! The watch-dogs bark_ to Ariel.\n  387: _i' th' air or th' earth?_] _in air or earth?_ Pope.\n  390: _again_] _against_ Rowe (after Dryden).\n  407: _owes_] _owns_ Pope (after Dryden), but leaves _ow'st_ 454.\n  408: SCENE VI. Pope.\n  419: _It goes on, I see,_] _It goes, I see_ Capell. _It goes on_\n    Steevens.\n  420: _fine spirit!_] om. Hanmer.\n  427: _maid_] F3. _mayd_ F1 F2. _made_ F4.\n  443: See note (VI).\n  444: _ungently_] F1. _urgently_ F2 F3 F4.\n  451: _lest_] F4. _least_ F1 F2 F3.\n  452: _One_] _Sir, one_ Pope.\n    _I charge thee_] _I charge thee_ [to Ariel. Pope.\n  460: Pros. prefixed again to this line in Ff.\n  468: _and_] _tho'_ Hanmer.\n  469: _foot_] _fool_ S. Walker conj. _child_ Dryden's version.\n  470: _makest_] _mak'st_ F1. _makes_ F2 F3 F4.\n  471: _so_] F1. om. F2 F3 F4. _all_ Pope.\n  478: _is_] _are_ Rowe.\n  488: _nor_] _and_ Rowe (after Dryden). _or_ Capell.\n  489: _are_] _were_ Malone conj.\n\n\n\n\nACT II.\n\n\nSCENE I. _Another part of the island._\n\n  _Enter ALONSO, SEBASTIAN, ANTONIO, GONZALO, ADRIAN, FRANCISCO,\n  and others._\n\n_Gon._ Beseech you, sir, be merry; you have cause,\nSo have we all, of joy; for our escape\nIs much beyond our loss. Our hint of woe\nIs common; every day, some sailor's wife,\nThe masters of some merchant, and the merchant,                      5\nHave just our theme of woe; but for the miracle,\nI mean our preservation, few in millions\nCan speak like us: then wisely, good sir, weigh\nOur sorrow with our comfort.\n\n_Alon._                    Prithee, peace.\n\n_Seb._ He receives comfort like cold porridge.                      10\n\n_Ant._ The visitor will not give him o'er so.\n\n_Seb._ Look, he's winding up the watch of his wit; by\nand by it will strike.\n\n_Gon._ Sir,--\n\n_Seb._ One: tell.                                                   15\n\n_Gon._ When every grief is entertain'd that's offer'd,\nComes to the entertainer--\n\n_Seb._ A dollar.\n\n_Gon._ Dolour comes to him, indeed: you have spoken\ntruer than you purposed.                                            20\n\n_Seb._ You have taken it wiselier than I meant you should.\n\n_Gon._ Therefore, my lord,--\n\n_Ant._ Fie, what a spendthrift is he of his tongue!\n\n_Alon._ I prithee, spare.\n\n_Gon._ Well, I have done: but yet,--                                25\n\n_Seb._ He will be talking.\n\n_Ant._ Which, of he or Adrian, for a good wager, first\nbegins to crow?\n\n_Seb._ The old cock.\n\n_Ant._ The cockerel.                                                30\n\n_Seb._ Done. The wager?\n\n_Ant._ A laughter.\n\n_Seb._ A match!\n\n_Adr._ Though this island seem to be desert,--\n\n_Seb._ Ha, ha, ha!--So, you're paid.                                35\n\n_Adr._ Uninhabitable, and almost inaccessible,--\n\n_Seb._ Yet,--\n\n_Adr._ Yet,--\n\n_Ant._ He could not miss't.\n\n_Adr._ It must needs be of subtle, tender and delicate              40\ntemperance.\n\n_Ant._ Temperance was a delicate wench.\n\n_Seb._ Ay, and a subtle; as he most learnedly delivered.\n\n_Adr._ The air breathes upon us here most sweetly.\n\n_Seb._ As if it had lungs, and rotten ones.                         45\n\n_Ant._ Or as 'twere perfumed by a fen.\n\n_Gon._ Here is every thing advantageous to life.\n\n_Ant._ True; save means to live.\n\n_Seb._ Of that there's none, or little.\n\n_Gon._ How lush and lusty the grass looks! how green!               50\n\n_Ant._ The ground, indeed, is tawny.\n\n_Seb._ With an eye of green in't.\n\n_Ant._ He misses not much.\n\n_Seb._ No; he doth but mistake the truth totally.\n\n_Gon._ But the rarity of it is,--which is indeed almost             55\nbeyond credit,--\n\n_Seb._ As many vouched rarities are.\n\n_Gon._ That our garments, being, as they were, drenched\nin the sea, hold, notwithstanding, their freshness and glosses,\nbeing rather new-dyed than stained with salt water.                 60\n\n_Ant._ If but one of his pockets could speak, would it\nnot say he lies?\n\n_Seb._ Ay, or very falsely pocket up his report.\n\n_Gon._ Methinks our garments are now as fresh as when\nwe put them on first in Afric, at the marriage of the king's        65\nfair daughter Claribel to the King of Tunis.\n\n_Seb._ 'Twas a sweet marriage, and we prosper well in\nour return.\n\n_Adr._ Tunis was never graced before with such a paragon\nto their queen.                                                     70\n\n_Gon._ Not since widow Dido's time.\n\n_Ant._ Widow! a pox o' that! How came that widow\nin? widow Dido!\n\n_Seb._ What if he had said 'widower Aeneas' too? Good\nLord, how you take it!                                              75\n\n_Adr._ 'Widow Dido' said you? you make me study of\nthat: she was of Carthage, not of Tunis.\n\n_Gon._ This Tunis, sir, was Carthage.\n\n_Adr._ Carthage?\n\n_Gon._ I assure you, Carthage.                                      80\n\n_Seb._ His word is more than the miraculous harp; he\nhath raised the wall, and houses too.\n\n_Ant._ What impossible matter will he make easy next?\n\n_Seb._ I think he will carry this island home in his\npocket, and give it his son for an apple.                           85\n\n_Ant._ And, sowing the kernels of it in the sea, bring\nforth more islands.\n\n_Gon._ Ay.\n\n_Ant._ Why, in good time.\n\n_Gon._ Sir, we were talking that our garments seem now              90\nas fresh as when we were at Tunis at the marriage of your\ndaughter, who is now queen.\n\n_Ant._ And the rarest that e'er came there.\n\n_Seb._ Bate, I beseech you, widow Dido.\n\n_Ant._ O, widow Dido! ay, widow Dido.                               95\n\n_Gon._ Is not, sir, my doublet as fresh as the first day I\nwore it? I mean, in a sort.\n\n_Ant._ That sort was well fished for.\n\n_Gon._ When I wore it at your daughter's marriage?\n\n_Alon._ You cram these words into mine ears against                100\nThe stomach of my sense. Would I had never\nMarried my daughter there! for, coming thence,\nMy son is lost, and, in my rate, she too.\nWho is so far from Italy removed\nI ne'er again shall see her. O thou mine heir                      105\nOf Naples and of Milan, what strange fish\nHath made his meal on thee?\n\n_Fran._                   Sir, he may live:\nI saw him beat the surges under him,\nAnd ride upon their backs; he trod the water.\nWhose enmity he flung aside, and breasted                          110\nThe surge most swoln that met him; his bold head\n'Bove the contentious waves he kept, and oar'd\nHimself with his good arms in lusty stroke\nTo the shore, that o'er his wave-worn basis bow'd,\nAs stooping to relieve him: I not doubt                            115\nHe came alive to land.\n\n_Alon._              No, no, he's gone.\n\n_Seb._ Sir, you may thank yourself for this great loss,\nThat would not bless our Europe with your daughter,\nBut rather lose her to an African;\nWhere she, at least, is banish'd from your eye,                    120\nWho hath cause to wet the grief on't.\n\n_Alon._                             Prithee, peace.\n\n_Seb._ You were kneel'd to, and importuned otherwise,\nBy all of us; and the fair soul herself\nWeigh'd between loathness and obedience, at\nWhich end o' the beam should bow. We have lost your son,           125\nI fear, for ever: Milan and Naples have\nMore widows in them of this business' making\nThan we bring men to comfort them:\nThe fault's your own.\n\n_Alon._             So is the dear'st o' the loss.\n\n_Gon._ My lord Sebastian,                                          130\nThe truth you speak doth lack some gentleness,\nAnd time to speak it in: you rub the sore,\nWhen you should bring the plaster.\n\n_Seb._                           Very well.\n\n_Ant._ And most chirurgeonly.\n\n_Gon._ It is foul weather in us all, good sir,                     135\nWhen you are cloudy.\n\n_Seb._             Foul weather?\n\n_Ant._                         Very foul.\n\n_Gon._ Had I plantation of this isle, my lord,--\n\n_Ant._ He'ld sow't with nettle-seed.\n\n_Seb._                             Or docks, or mallows.\n\n_Gon._ And were the king on't, what would I do?\n\n_Seb._ 'Scape being drunk for want of wine.                        140\n\n_Gon._ I' the commonwealth I would by contraries\nExecute all things; for no kind of traffic\nWould I admit; no name of magistrate;\nLetters should not be known; riches, poverty,\nAnd use of service, none; contract, succession,                    145\nBourn, bound of land, tilth, vineyard, none;\nNo use of metal, corn, or wine, or oil;\nNo occupation; all men idle, all;\nAnd women too, but innocent and pure;\nNo sovereignty;--                                                  150\n\n_Seb._      Yet he would be king on't.\n\n_Ant._ The latter end of his commonwealth forgets the\nbeginning.\n\n_Gon._ All things in common nature should produce\nWithout sweat or endeavour: treason, felony,\nSword, pike, knife, gun, or need of any engine,                    155\nWould I not have; but nature should bring forth,\nOf its own kind, all foison, all abundance,\nTo feed my innocent people.\n\n_Seb._ No marrying 'mong his subjects?\n\n_Ant._ None, man; all idle; whores and knaves.                     160\n\n_Gon._ I would with such perfection govern, sir,\nTo excel the golden age.\n\n_Seb._                 'Save his majesty!\n\n_Ant._ Long live Gonzalo!\n\n_Gon._                  And,--do you mark me, sir?\n\n_Alon._ Prithee, no more: thou dost talk nothing to me.\n\n_Gon._ I do well believe your highness; and did it to minister     165\noccasion to these gentlemen, who are of such sensible\nand nimble lungs that they always use to laugh at nothing.\n\n_Ant._ 'Twas you we laughed at.\n\n_Gon._ Who in this kind of merry fooling am nothing to\nyou: so you may continue, and laugh at nothing still.              170\n\n_Ant._ What a blow was there given!\n\n_Seb._ An it had not fallen flat-long.\n\n_Gon._ You are gentlemen of brave mettle; you would\nlift the moon out of her sphere, if she would continue in it\nfive weeks without changing.                                       175\n\n\n  _Enter ARIEL (invisible) playing solemn music._\n\n_Seb._ We would so, and then go a bat-fowling.\n\n_Ant._ Nay, good my lord, be not angry.\n\n_Gon._ No, I warrant you; I will not adventure my discretion\nso weakly. Will you laugh me asleep, for I am very\nheavy?                                                             180\n\n_Ant._ Go sleep, and hear us.\n            [_All sleep except Alon., Seb., and Ant._\n\n_Alon._ What, all so soon asleep! I wish mine eyes\nWould, with themselves, shut up my thoughts: I find\nThey are inclined to do so.\n\n_Seb._                    Please you, sir,\nDo not omit the heavy offer of it:                                 185\nIt seldom visits sorrow; when it doth,\nIt is a comforter.\n\n_Ant._           We two, my lord,\nWill guard your person while you take your rest,\nAnd watch your safety.\n\n_Alon._              Thank you.--Wondrous heavy.\n                                [_Alonso sleeps. Exit Ariel._\n\n_Seb._ What a strange drowsiness possesses them!                   190\n\n_Ant._ It is the quality o' the climate.\n\n_Seb._                                 Why\nDoth it not then our eyelids sink? I find not\nMyself disposed to sleep.\n\n_Ant._                  Nor I; my spirits are nimble.\nThey fell together all, as by consent;\nThey dropp'd, as by a thunder-stroke. What might,                  195\nWorthy Sebastian?--O, what might?--No more:--\nAnd yet methinks I see it in thy face,\nWhat thou shouldst be: the occasion speaks thee; and\nMy strong imagination sees a crown\nDropping upon thy head.\n\n_Seb._                What, art thou waking?                       200\n\n_Ant._ Do you not hear me speak?\n\n_Seb._                         I do; and surely\nIt is a sleepy language, and thou speak'st\nOut of thy sleep. What is it thou didst say?\nThis is a strange repose, to be asleep\nWith eyes wide open; standing, speaking, moving,                   205\nAnd yet so fast asleep.\n\n_Ant._                Noble Sebastian,\nThou let'st thy fortune sleep--die, rather; wink'st\nWhiles thou art waking.\n\n_Seb._                Thou dost snore distinctly;\nThere's meaning in thy snores.\n\n_Ant._ I am more serious than my custom: you                       210\nMust be so too, if heed me; which to do\nTrebles thee o'er.\n\n_Seb._           Well, I am standing water.\n\n_Ant._ I'll teach you how to flow.\n\n_Seb._                           Do so: to ebb\nHereditary sloth instructs me.\n\n_Ant._                       O,\nIf you but knew how you the purpose cherish                        215\nWhiles thus you mock it! how, in stripping it,\nYou more invest it! Ebbing men, indeed,\nMost often do so near the bottom run\nBy their own fear or sloth.\n\n_Seb._                    Prithee, say on:\nThe setting of thine eye and cheek proclaim                        220\nA matter from thee; and a birth, indeed,\nWhich throes thee much to yield.\n\n_Ant._                         Thus, sir:\nAlthough this lord of weak remembrance, this,\nWho shall be of as little memory\nWhen he is earth'd, hath here almost persuaded,--                  225\nFor he's a spirit of persuasion, only\nProfesses to persuade,--the king his son's alive,\n'Tis as impossible that he's undrown'd\nAs he that sleeps here swims.\n\n_Seb._                      I have no hope\nThat he's undrown'd.\n\n_Ant._             O, out of that 'no hope'                        230\nWhat great hope have you! no hope that way is\nAnother way so high a hope that even\nAmbition cannot pierce a wink beyond,\nBut doubt discovery there. Will you grant with me\nThat Ferdinand is drown'd?\n\n_Seb._                   He's gone.\n\n_Ant._                            Then, tell me,                   235\nWho's the next heir of Naples?\n\n_Seb._                       Claribel.\n\n_Ant._ She that is queen of Tunis; she that dwells\nTen leagues beyond man's life; she that from Naples\nCan have no note, unless the sun were post,--\nThe man i' the moon's too slow,--till new-born chins               240\nBe rough and razorable; she that from whom\nWe all were sea-swallow'd, though some cast again,\nAnd by that destiny, to perform an act\nWhereof what's past is prologue; what to come,\nIn yours and my discharge.\n\n_Seb._                   What stuff is this! How say you?          245\n'Tis true, my brother's daughter's queen of Tunis;\nSo is she heir of Naples; 'twixt which regions\nThere is some space.\n\n_Ant._             A space whose every cubit\nSeems to cry out, \"How shall that Claribel\nMeasure us back to Naples? Keep in Tunis,                          250\nAnd let Sebastian wake.\" Say, this were death\nThat now hath seized them; why, they were no worse\nThan now they are. There be that can rule Naples\nAs well as he that sleeps; lords that can prate\nAs amply and unnecessarily                                         255\nAs this Gonzalo; I myself could make\nA chough of as deep chat. O, that you bore\nThe mind that I do! what a sleep were this\nFor your advancement! Do you understand me?\n\n_Seb._ Methinks I do.\n\n_Ant._              And how does your content                      260\nTender your own good fortune?\n\n_Seb._                      I remember\nYou did supplant your brother Prospero.\n\n_Ant._                                True:\nAnd look how well my garments sit upon me;\nMuch feater than before: my brother's servants\nWere then my fellows; now they are my men.                         265\n\n_Seb._ But for your conscience.\n\n_Ant._ Ay, sir; where lies that? if 'twere a kibe,\n'Twould put me to my slipper: but I feel not\nThis deity in my bosom: twenty consciences,\nThat stand 'twixt me and Milan, candied be they,                   270\nAnd melt, ere they molest! Here lies your brother,\nNo better than the earth he lies upon,\nIf he were that which now he's like, that's dead;\nWhom I, with this obedient steel, three inches of it,\nCan lay to bed for ever; whiles you, doing thus,                   275\nTo the perpetual wink for aye might put\nThis ancient morsel, this Sir Prudence, who\nShould not upbraid our course. For all the rest,\nThey'll take suggestion as a cat laps milk;\nThey'll tell the clock to any business that                        280\nWe say befits the hour.\n\n_Seb._                Thy case, dear friend,\nShall be my precedent; as thou got'st Milan,\nI'll come by Naples. Draw thy sword: one stroke\nShall free thee from the tribute which thou payest;\nAnd I the king shall love thee.\n\n_Ant._                        Draw together;                       285\nAnd when I rear my hand, do you the like,\nTo fall it on Gonzalo.\n\n_Seb._               O, but one word.      [_They talk apart._\n\n  _Re-enter ARIEL invisible._\n\n_Ari._ My master through his art foresees the danger\nThat you, his friend, are in; and sends me forth,--\nFor else his project dies,--to keep them living.                   290\n                            [_Sings in Gonzalo's ear._\n\nWhile you here do snoring lie,\nOpen-eyed conspiracy\n    His time doth take.\nIf of life you keep a care,\nShake off slumber, and beware:                                     295\n    Awake, awake!\n\n_Ant._ Then let us both be sudden.\n\n_Gon._                           Now, good angels\nPreserve the king!                          [_They wake._\n\n_Alon._ Why, how now? ho, awake!--Why are you drawn?\nWherefore this ghastly looking?\n\n_Gon._                        What's the matter?                   300\n\n_Seb._ Whiles we stood here securing your repose,\nEven now, we heard a hollow burst of bellowing\nLike bulls, or rather lions: did't not wake you?\nIt struck mine ear most terribly.\n\n_Alon._                         I heard nothing.\n\n_Ant._ O, 'twas a din to fright a monster's ear,                   305\nTo make an earthquake! sure, it was the roar\nOf a whole herd of lions.\n\n_Alon._                 Heard you this, Gonzalo?\n\n_Gon._ Upon mine honour, sir, I heard a humming,\nAnd that a strange one too, which did awake me:\nI shaked you, sir, and cried: as mine eyes open'd,                 310\nI saw their weapons drawn:--there was a noise,\nThat's verily. 'Tis best we stand upon our guard,\nOr that we quit this place: let's draw our weapons.\n\n_Alon._ Lead off this ground; and let's make further search\nFor my poor son.\n\n_Gon._         Heavens keep him from these beasts!                 315\nFor he is, sure, i' th' island.\n\n_Alon._                       Lead away.\n\n_Ari._ Prospero my lord shall know what I have done:\nSo, king, go safely on to seek thy son.    [_Exeunt._\n\n\n  Notes: II, 1.\n\n  3: _hint_] _stint_ Warburton.\n  5: _masters_] _master_ Johnson. _mistress_ Steevens conj.\n    _master's_ Edd. conj.\n  6: _of woe_] om. Steevens conj.\n  11-99: Marked as interpolated by Pope.\n  11: _visitor_] _'viser_ Warburton.\n  _him_] om. Rowe.\n  15: _one_] F1. _on_ F2 F3 F4.\n  16: _entertain'd ... Comes_] Capell. _entertain'd, That's offer'd\n    comes_] Ff. Printed as prose by Pope.\n  27: _of he_] Ff. _of them, he_ Pope. _or he_ Collier MS.\n    See note (VII).\n  35: Seb. _Ha, ha, ha!--So you're paid_] Theobald. Seb. _Ha, ha, ha!_\n    Ant. _So you'r paid_ Ff. Ant. _So you've paid_ Capell.\n  81, 82: Seb. _His ... too_] Edd. Ant. _His ... harp._\n    Seb. _He ... too_ Ff.\n  88: _Ay._] I. Ff. _Ay?_ Pope.\n  96: _sir, my doublet_] F1. _my doublet, sir_ F2 F3 F4.\n  113: _stroke_] F1 F2 F3. _strokes_ F4.\n  124: _Weigh'd_] _Sway'd_ S. Verges conj.\n  _at_] _as_ Collier MS.]\n  125: _o' the_] _the_ Pope.\n  _should_] _she'd_ Malone.\n  129: _The fault's your own_] _the fault's your own_ (at the end\n    of 128) Capell. _the fault's Your own_ Malone.\n  137: _plantation_] _the plantation_ Rowe. _the planting_ Hanmer.\n  139: _on't_] _of it_ Hanmer.\n  144: _riches, poverty_] _wealth, poverty_ Pope. _poverty, riches_\n    Capell.\n  145: _contract, succession_] _succession, Contract_ Malone conj.\n    _succession, None_ id. conj.\n  146: _none_] _olives, none_ Hanmer.\n  157: _its_] F3 F4. _it_ F1 F2. See note (VIII).\n  162: _'Save_] F1 F2 F3. _Save_ F4. _God save_ Edd. conj.\n  175: Enter ... invisible ... music.] Malone. Enter Ariel, playing\n    solemn music. Ff. om. Pope. [Solemn music. Capell.\n  181: [All sleep ... Ant.] Stage direction to the same effect,\n    first inserted by Capell.\n  182-189: Text as in Pope. In Ff. the lines begin _Would ... I find\n    ... Do not ... It seldom ... We two ... While ... Thank._\n  189: [Exit Ariel] Malone.\n  192: _find not_ Pope. _find Not_ Ff.\n  211: _so too, if heed_] _so too, if you heed_ Rowe.\n    _so, if you heed_ Pope.\n  212: _Trebles thee o'er_] _Troubles thee o'er_ Pope.\n    _Troubles thee not_ Hanmer.\n  222: _throes_] Pope. _throwes_ F1 F2 F3. _throws_ F4.\n  _Thus, sir_] _Why then thus Sir_ Hanmer.\n  226: _he's_] _he'as_ Hanmer. _he_ Johnson conj.\n  227: _Professes to persuade_] om. Steevens.\n  234: _doubt_] _drops_ Hanmer. _doubts_ Capell.\n  241: _she that from whom_] Ff. _she from whom_ Rowe.\n    _she for whom_ Pope. _she from whom coming_ Singer.\n    _she that--from whom?_ Spedding conj. See note (IX).\n  242: _all_] om. Pope.\n  243: _And ... to perform_] _May ... perform_ Pope. _And by that\n    destin'd to perform_ Musgrave conj. _(And that by destiny)\n    to perform_ Staunton conj.\n  244: _is_] F1. _in_ F2 F3 F4.\n  245: _In_] _Is_ Pope.\n  250: _to_] F1. _by_ F2 F3 F4.\n  _Keep_] _Sleep_ Johnson conj.\n  251: See note (X).\n  267: _'twere_] _it were_ Singer.\n  267-271: Pope ends the lines with _that? ... slipper ... bosom ...\n    Milan ... molest ... brother._\n  267: See note (XI).\n  269: _twenty_] _Ten_ Pope.\n  270: _stand_] _stood_ Hanmer.\n  _candied_] _Discandy'd_ Upton conj.\n  271: _And melt_] _Would melt_ Johnson conj. _Or melt_ id. conj.\n  273, 274: _like, that's dead; Whom I, with_] _like, whom I With_\n    Steevens (Farmer conj.).\n  275: _whiles_] om. Pope.\n  277: _morsel_] _Moral_ Warburton.\n  280, 281: _business ... hour._] _hour ... business._ Farmer conj.\n  282: _precedent_] Pope. _president_ Ff.\n  _O_] om. Pope.\n  [They talk apart] Capell.\n  Re-enter Ariel invisible.] Capell. Enter Ariel with music and\n    song. Ff.\n  289: _you, his friend,_] _these, his friends_ Steevens\n    (Johnson conj.).\n  289, 290: _friend ... project dies ... them_] _friend ... projects\n    dies ... you_ Hanmer. _friend ... projects die ... them_\n    Malone conj. _friend ... project dies ... thee_ Dyce.\n  298: [They wake.] Rowe.\n  300: _this_] _thus_ Collier MS.\n  307: _Gonzalo_] om. Pope.\n  312: _verily_] _verity_ Pope.\n  _upon our guard_] _on guard_ Pope.\n\n\nSCENE II. _Another part of the island._\n\n  _Enter CALIBAN with a burden of wood. A noise of thunder heard._\n\n_Cal._ All the infections that the sun sucks up\nFrom bogs, fens, flats, on Prosper fall, and make him\nBy inch-meal a disease! His spirits hear me,\nAnd yet I needs must curse. But they'll nor pinch,\nFright me with urchin-shows, pitch me i' the mire,                   5\nNor lead me, like a firebrand, in the dark\nOut of my way, unless he bid 'em: but\nFor every trifle are they set upon me;\nSometime like apes, that mow and chatter at me,\nAnd after bite me; then like hedgehogs, which                       10\nLie tumbling in my barefoot way, and mount\nTheir pricks at my footfall; sometime am I\nAll wound with adders, who with cloven tongues\nDo hiss me into madness.\n\n  _Enter TRINCULO._\n\n                        Lo, now, lo!\nHere comes a spirit of his, and to torment me                       15\nFor bringing wood in slowly. I'll fall flat;\nPerchance he will not mind me.\n\n_Trin._ Here's neither bush nor shrub, to bear off any\nweather at all, and another storm brewing; I hear it sing i'\nthe wind: yond same black cloud, yond huge one, looks               20\nlike a foul bombard that would shed his liquor. If it should\nthunder as it did before, I know not where to hide my head:\nyond same cloud cannot choose but fall by pailfuls. What\nhave we here? a man or a fish? dead or alive? A fish: he\nsmells like a fish; a very ancient and fish-like smell; a kind      25\nof not of the newest Poor-John. A strange fish! Were I\nin England now, as once I was, and had but this fish\npainted, not a holiday fool there but would give a piece of\nsilver: there would this monster make a man; any strange\nbeast there makes a man: when they will not give a doit to          30\nrelieve a lame beggar, they will lay out ten to see a dead\nIndian. Legged like a man! and his fins like arms! Warm\no' my troth! I do now let loose my opinion; hold it no\nlonger: this is no fish, but an islander, that hath lately\nsuffered by a thunderbolt. [_Thunder._] Alas, the storm is come     35\nagain! my best way is to creep under his gaberdine; there\nis no other shelter hereabout: misery acquaints a man with\nstrange bed-fellows. I will here shroud till the dregs of the\nstorm be past.\n\n  _Enter STEPHANO, singing: a bottle in his hand._\n\n_Ste._ I shall no more to sea, to sea,                              40\n                Here shall I die a-shore,--\n\nThis is a very scurvy tune to sing at a man's funeral: well,\nhere's my comfort.                                  [_Drinks._\n\n\n[_Sings._ The master, the swabber, the boatswain, and I,\n                       The gunner, and his mate,                    45\n               Loved Mall, Meg, and Marian, and Margery,\n                   But none of us cared for Kate;\n                   For she had a tongue with a tang,\n                   Would cry to a sailor, Go hang!\n               She loved not the savour of tar nor of pitch;        50\n               Yet a tailor might scratch her where'er she did itch.\n                   Then, to sea, boys, and let her go hang!\n\nThis is a scurvy tune too: but here's my comfort. [_Drinks._\n\n_Cal._ Do not torment me:--O!\n\n_Ste._ What's the matter? Have we devils here? Do                   55\nyou put tricks upon 's with savages and men of Ind, ha? I\nhave not scaped drowning, to be afeard now of your four\nlegs; for it hath been said, As proper a man as ever went\non four legs cannot make him give ground; and it shall be\nsaid so again, while Stephano breathes at's nostrils.               60\n\n_Cal._ The spirit torments me:--O!\n\n_Ste._ This is some monster of the isle with four legs, who\nhath got, as I take it, an ague. Where the devil should he\nlearn our language? I will give him some relief, if it be\nbut for that. If I can recover him, and keep him tame, and          65\nget to Naples with him, he's a present for any emperor that\never trod on neat's-leather.\n\n_Cal._ Do not torment me, prithee; I'll bring my wood\nhome faster.\n\n_Ste._ He's in his fit now, and does not talk after the             70\nwisest. He shall taste of my bottle: if he have never drunk\nwine afore, it will go near to remove his fit. If I can recover\nhim, and keep him tame, I will not take too much for\nhim; he shall pay for him that hath him, and that soundly.\n\n_Cal._ Thou dost me yet but little hurt; thou wilt anon, I          75\nknow it by thy trembling: now Prosper works upon thee.\n\n_Ste._ Come on your ways; open your mouth; here is that\nwhich will give language to you, cat: open your mouth; this\nwill shake your shaking, I can tell you, and that soundly:\nyou cannot tell who's your friend: open your chaps again.           80\n\n_Trin._ I should know that voice: it should be--but he\nis drowned; and these are devils:--O defend me!\n\n_Ste._ Four legs and two voices,--a most delicate monster!\nHis forward voice, now, is to speak well of his friend;\nhis backward voice is to utter foul speeches and to detract.        85\nIf all the wine in my bottle will recover him, I will help\nhis ague. Come:--Amen! I will pour some in thy other\nmouth.\n\n_Trin._ Stephano!\n\n_Ste._ Doth thy other mouth call me? Mercy, mercy!                  90\nThis is a devil, and no monster: I will leave him; I have\nno long spoon.\n\n_Trin._ Stephano! If thou beest Stephano, touch me,\nand speak to me; for I am Trinculo,--be not afeard,--thy\ngood friend Trinculo.                                               95\n\n_Ste._ If thou beest Trinculo, come forth: I'll pull thee\nby the lesser legs: if any be Trinculo's legs, these are they.\nThou art very Trinculo indeed! How earnest thou to be\nthe siege of this moon-calf? can he vent Trinculos?\n\n_Trin._ I took him to be killed with a thunder-stroke.             100\nBut art thou not drowned, Stephano? I hope, now, thou\nart not drowned. Is the storm overblown? I hid me\nunder the dead moon-calf's gaberdine for fear of the storm.\nAnd art thou living, Stephano? O Stephano, two Neapolitans\nscaped!                                                            105\n\n_Ste._ Prithee, do not turn me about; my stomach is not\nconstant.\n\n_Cal._ [_aside_] These be fine things, an if they be not sprites.\nThat's a brave god, and bears celestial liquor:\nI will kneel to him.                                               110\n\n_Ste._ How didst thou 'scape? How camest thou hither?\nswear, by this bottle, how thou camest hither. I escaped\nupon a butt of sack, which the sailors heaved o'erboard, by\nthis bottle! which I made of the bark of a tree with mine\nown hands, since I was cast ashore.                                115\n\n_Cal._ I'll swear, upon that bottle, to be thy true subject;\nfor the liquor is not earthly.\n\n_Ste._ Here; swear, then, how thou escapedst.\n\n_Trin._ Swum ashore, man, like a duck: I can swim\nlike a duck, I'll be sworn.                                        120\n\n_Ste._ Here, kiss the book. Though thou canst swim\nlike a duck, thou art made like a goose.\n\n_Trin._ O Stephano, hast any more of this?\n\n_Ste._ The whole butt, man: my cellar is in a rock by\nthe sea-side, where my wine is hid. How now, moon-calf!            125\nhow does thine ague?\n\n_Cal._ Hast thou not dropp'd from heaven?\n\n_Ste._ Out o' the moon, I do assure thee: I was the man\ni' the moon when time was.\n\n_Cal._ I have seen thee in her, and I do adore thee:               130\nMy mistress show'd me thee, and thy dog, and thy bush.\n\n_Ste._ Come, swear to that; kiss the book: I will furnish\nit anon with new contents: swear.\n\n_Trin._ By this good light, this is a very shallow monster!\nI afeard of him! A very weak monster! The                          135\nman i' the moon! A most poor credulous monster! Well\ndrawn, monster, in good sooth!\n\n_Cal._ I'll show thee every fertile inch o' th' island;\nAnd I will kiss thy foot: I prithee, be my god.\n\n_Trin._ By this light, a most perfidious and drunken               140\nmonster! when's god's asleep, he'll rob his bottle.\n\n_Cal._ I'll kiss thy foot; I'll swear myself thy subject.\n\n_Ste._ Come on, then; down, and swear.\n\n_Trin._ I shall laugh myself to death at this puppy-headed\nmonster. A most scurvy monster! I could find in                    145\nmy heart to beat him,--\n\n_Ste._ Come, kiss.\n\n_Trin._ But that the poor monster's in drink: an abominable\nmonster!\n\n_Cal._ I'll show thee the best springs; I'll pluck thee berries;   150\nI'll fish for thee, and get thee wood enough.\nA plague upon the tyrant that I serve!\nI'll bear him no more sticks, but follow thee,\nThou wondrous man.\n\n_Trin._ A most ridiculous monster, to make a wonder                155\nof a poor drunkard!\n\n_Cal._ I prithee, let me bring thee where crabs grow;\nAnd I with my long nails will dig thee pig-nuts;\nShow thee a jay's nest, and instruct thee how\nTo snare the nimble marmoset; I'll bring thee                      160\nTo clustering filberts, and sometimes I'll get thee\nYoung scamels from the rock. Wilt thou go with me?\n\n_Ste._ I prithee now, lead the way, without any more\ntalking. Trinculo, the king and all our company else being\ndrowned, we will inherit here: here; bear my bottle: fellow        165\nTrinculo, we'll fill him by and by again.\n\n_Cal. sings drunkenly._] Farewell, master; farewell, farewell!\n\n_Trin._ A howling monster; a drunken monster!\n\n_Cal._ No more dams I'll make for fish;\n                Nor fetch in firing                                170\n                At requiring;\n             Nor scrape trencher, nor wash dish:\n                'Ban, 'Ban, Cacaliban\n                Has a new master:--get a new man.\n\nFreedom, hey-day! hey-day, freedom! freedom, hey-day,              175\nfreedom!\n\n_Ste._ O brave monster! Lead the way.    [_Exeunt._\n\n\n  Notes: II, 2.\n\n  4: _nor_] F1 F2. _not_ F3 F4.\n  15: _and_] _now_ Pope. _sent_ Edd. conj. (so Dryden).\n  21: _foul_] _full_ Upton conj.\n  35: [Thunder] Capell.\n  38: _dregs_] _drench_ Collier MS.\n  40: SCENE III. Pope.\n  [a bottle in his hand] Capell.]\n  46: _and Marian_] _Mirian_ Pope.\n  56: _savages_] _salvages_ Ff.\n  60: _at's nostrils_] Edd. _at 'nostrils_ F1. _at nostrils_ F2 F3 F4.\n    _at his nostrils_ Pope.\n  78: _you, cat_] _you Cat_ Ff. _a cat_ Hanmer. _your cat_ Edd. conj.\n  84: _well_] F1 om. F2 F3 F4.\n  115, 116: Steevens prints as verse, _I'll ... thy True ... earthly._\n  118: _swear, then, how thou escapedst_] _swear then: how escapedst\n    thou?_ Pope.\n  119: _Swum_] _Swom_ Ff.\n  131: _and thy dog, and thy bush_] _thy dog and bush_ Steevens.\n  133: _new_] F1. _the new_ F2 F3 F4.\n  135: _weak_] F1. _shallow_ F2 F3 F4.\n  138: _island_] F1. _isle_ F2 F3 F4.\n  150-154, 157-162, printed as verse by Pope (after Dryden).\n  162: _scamels_] _shamois_ Theobald. _seamalls, stannels_ id. conj.\n  163: Ste.] F1. Cal. F2 F3 F4.\n  165: Before _here; bear my bottle_ Capell inserts [To Cal.].\n    See note (XII).\n  172: _trencher_] Pope (after Dryden). _trenchering_ Ff.\n  175: _hey-day_] Rowe. _high-day_ Ff.\n\n\n\n\nACT III.\n\n\nSCENE I. _Before PROSPERO'S cell._\n\n  _Enter FERDINAND, bearing a log._\n\n_Fer._ There be some sports are painful, and their labour\nDelight in them sets off: some kinds of baseness\nAre nobly undergone, and most poor matters\nPoint to rich ends. This my mean task\nWould be as heavy to me as odious, but                               5\nThe mistress which I serve quickens what's dead,\nAnd makes my labours pleasures: O, she is\nTen times more gentle than her father's crabbed.\nAnd he's composed of harshness. I must remove\nSome thousands of these logs, and pile them up,                     10\nUpon a sore injunction: my sweet mistress\nWeeps when she sees me work, and says, such baseness\nHad never like executor. I forget:\nBut these sweet thoughts do even refresh my labours,\nMost busy lest, when I do it.\n\n  _Enter MIRANDA; and PROSPERO at a distance, unseen._\n\n_Mir._                  Alas, now, pray you,                        15\nWork not so hard: I would the lightning had\nBurnt up those logs that you are enjoin'd to pile!\nPray, set it down, and rest you: when this burns,\n'Twill weep for having wearied you. My father\nIs hard at study; pray, now, rest yourself;                         20\nHe's safe for these three hours.\n\n_Fer._                         O most dear mistress,\nThe sun will set before I shall discharge\nWhat I must strive to do.\n\n_Mir._                  If you'll sit down,\nI'll bear your logs the while: pray, give me that;\nI'll carry it to the pile.\n\n_Fer._                   No, precious creature;                     25\nI had rather crack my sinews, break my back,\nThan you should such dishonour undergo,\nWhile I sit lazy by.\n\n_Mir._             It would become me\nAs well as it does you: and I should do it\nWith much more ease; for my good will is to it,                     30\nAnd yours it is against.\n\n_Pros._                Poor worm, thou art infected!\nThis visitation shows it.\n\n_Mir._                  You look wearily.\n\n_Fer._ No, noble mistress; 'tis fresh morning with me\nWhen you are by at night. I do beseech you,--\nChiefly that I might set it in my prayers,--                        35\nWhat is your name?\n\n_Mir._           Miranda. --O my father,\nI have broke your hest to say so!\n\n_Fer._                          Admired Miranda!\nIndeed the top of admiration! worth\nWhat's dearest to the world! Full many a lady\nI have eyed with best regard, and many a time                       40\nThe harmony of their tongues hath into bondage\nBrought my too diligent ear: for several virtues\nHave I liked several women; never any\nWith so full soul, but some defect in her\nDid quarrel with the noblest grace she owed,                        45\nAnd put it to the foil: but you, O you,\nSo perfect and so peerless, are created\nOf every creature's best!\n\n_Mir._             I do not know\nOne of my sex; no woman's face remember,\nSave, from my glass, mine own; nor have I seen                      50\nMore that I may call men than you, good friend,\nAnd my dear father: how features are abroad,\nI am skilless of; but, by my modesty,\nThe jewel in my dower, I would not wish\nAny companion in the world but you;                                 55\nNor can imagination form a shape,\nBesides yourself, to like of. But I prattle\nSomething too wildly, and my father's precepts\nI therein do forget.\n\n_Fer._             I am, in my condition,\nA prince, Miranda; I do think, a king;                              60\nI would, not so!--and would no more endure\nThis wooden slavery than to suffer\nThe flesh-fly blow my mouth. Hear my soul speak:\nThe very instant that I saw you, did\nMy heart fly to your service; there resides,                        65\nTo make me slave to it; and for your sake\nAm I this patient log-man.\n\n_Mir._                   Do you love me?\n\n_Fer._ O heaven, O earth, bear witness to this sound,\nAnd crown what I profess with kind event,\nIf I speak true! if hollowly, invert                                70\nWhat best is boded me to mischief! I,\nBeyond all limit of what else i' the world,\nDo love, prize, honour you.\n\n_Mir._                    I am a fool\nTo weep at what I am glad of.\n\n_Pros._                     Fair encounter\nOf two most rare affections! Heavens rain grace                     75\nOn that which breeds between 'em!\n\n_Fer._                          Wherefore weep you?\n\n_Mir._ At mine unworthiness, that dare not offer\nWhat I desire to give; and much less take\nWhat I shall die to want. But this is trifling;\nAnd all the more it seeks to hide itself,                           80\nThe bigger bulk it shows. Hence, bashful cunning!\nAnd prompt me, plain and holy innocence!\nI am your wife, if you will marry me;\nIf not, I'll die your maid: to be your fellow\nYou may deny me; but I'll be your servant,                          85\nWhether you will or no.\n\n_Fer._                My mistress, dearest;\nAnd I thus humble ever.\n\n_Mir._                My husband, then?\n\n_Fer._ Ay, with a heart as willing\nAs bondage e'er of freedom: here's my hand.\n\n_Mir._ And mine, with my heart in't: and now farewell               90\nTill half an hour hence.\n\n_Fer._                 A thousand thousand!\n\n    [_Exeunt Fer. and Mir. severally._\n\n_Pros._ So glad of this as they I cannot be,\nWho are surprised withal; but my rejoicing\nAt nothing can be more. I'll to my book;\nFor yet, ere supper-time, must I perform                            95\nMuch business appertaining.    [_Exit._\n\n\n  Notes: III, 1.\n\n  1: _and_] _but_ Pope.\n  2: _sets_] Rowe. _set_ Ff.\n  4, 5: _my ... odious_] _my mean task would be As heavy to me as\n    'tis odious_ Pope.\n  9: _remove_] _move_ Pope.\n  14: _labours_] _labour_ Hanmer.\n  15: _Most busy lest_] F1. _Most busy least_ F2 F3 F4. _Least busy_\n    Pope. _Most busie-less_ Theobald._ Most busiest_ Holt White conj.\n    _Most busy felt_ Staunton. _Most busy still_ Staunton conj.\n    _Most busy-blest_ Collier MS. _Most busiliest_ Bullock conj.\n  _Most busy lest, when I do_ (_doe_ F1 F2 F3) _it_] _Most busy when\n    least I do it_ Brae conj. _Most busiest when idlest_ Spedding\n    conj. _Most busy left when idlest_ Edd. conj. See note (XIII).\n  at a distance, unseen] Rowe.\n  17: _you are_] F1. _thou art_ F2 F3 F4.\n  31: _it is_] _is it_ Steevens conj. (ed. 1, 2, and 3). om. Steevens\n    (ed. 4) (Farmer conj.).\n  34, 35: _I do beseech you,--Chiefly_] _I do beseech you Chiefly_ Ff.\n  59: _I therein do_] _I do_ Pope. _Therein_ Steevens.\n  62: _wooden_] _wodden_ F1.\n  _than to_] _than I would_ Pope.\n  72: _what else_] _aught else_ Malone conj. (withdrawn).\n  80: _seeks_] _seekd_ F3 F4.\n  88: _as_] F1. _so_ F2 F3 F4.\n  91: _severally_] Capell.\n  93: _withal_] Theobald. _with all_ Ff.\n\n\nSCENE II. _Another part of the island._\n\n  _Enter CALIBAN, STEPHANO, and TRINCULO._\n\n_Ste._ Tell not me;--when the butt is out, we will drink\nwater; not a drop before: therefore bear up, and board 'em.\nServant-monster, drink to me.\n\n_Trin._ Servant-monster! the folly of this island! They\nsay there's but five upon this isle: we are three of them; if        5\nth' other two be brained like us, the state totters.\n\n_Ste._ Drink, servant-monster, when I bid thee: thy eyes\nare almost set in thy head.\n\n_Trin._ Where should they be set else? he were a brave\nmonster indeed, if they were set in his tail.                       10\n\n_Ste._ My man-monster hath drowned his tongue in sack:\nfor my part, the sea cannot drown me; I swam, ere I could\nrecover the shore, five-and-thirty leagues off and on. By\nthis light, thou shalt be my lieutenant, monster, or my\nstandard.                                                           15\n\n_Trin._ Your lieutenant, if you list; he's no standard.\n\n_Ste._ We'll not run, Monsieur Monster.\n\n_Trin._ Nor go neither; but you'll lie, like dogs, and\nyet say nothing neither.\n\n_Ste._ Moon-calf, speak once in thy life, if thou beest a           20\ngood moon-calf.\n\n_Cal._ How does thy honour? Let me lick thy shoe.\nI'll not serve him, he is not valiant.\n\n_Trin._ Thou liest, most ignorant monster: I am in case\nto justle a constable. Why, thou debauched fish, thou, was          25\nthere ever man a coward that hath drunk so much sack as\nI to-day? Wilt thou tell a monstrous lie, being but half a\nfish and half a monster?\n\n_Cal._ Lo, how he mocks me! wilt thou let him, my lord?\n\n_Trin._ 'Lord,' quoth he! That a monster should be                  30\nsuch a natural!\n\n_Cal._ Lo, lo, again! bite him to death, I prithee.\n\n_Ste._ Trinculo, keep a good tongue in your head: if you\nprove a mutineer,--the next tree! The poor monster's my\nsubject, and he shall not suffer indignity.                         35\n\n_Cal._ I thank my noble lord. Wilt thou be pleased to\nhearken once again to the suit I made to thee?\n\n_Ste._ Marry, will I: kneel and repeat it; I will stand,\nand so shall Trinculo.\n\n  _Enter ARIEL, invisible._\n\n_Cal._ As I told thee before, I am subject to a tyrant, a           40\nsorcerer, that by his cunning hath cheated me of the island.\n\n_Ari._ Thou liest.\n\n_Cal._           Thou liest, thou jesting monkey, thou:\nI would my valiant master would destroy thee!\nI do not lie.\n\n_Ste._ Trinculo, if you trouble him any more in's tale, by          45\nthis hand, I will supplant some of your teeth.\n\n_Trin._ Why, I said nothing.\n\n_Ste._ Mum, then, and no more. Proceed.\n\n_Cal._ I say, by sorcery he got this isle;\nFrom me he got it. If thy greatness will                            50\nRevenge it on him,--for I know thou darest,\nBut this thing dare not,--\n\n_Ste._ That's most certain.\n\n_Cal._ Thou shalt be lord of it, and I'll serve thee.\n\n_Ste._ How now shall this be compassed? Canst thou                  55\nbring me to the party?\n\n_Cal._ Yea, yea, my lord: I'll yield him thee asleep,\nWhere thou mayst knock a nail into his head.\n\n_Ari._ Thou liest; thou canst not.\n\n_Cal._ What a pied ninny's this! Thou scurvy patch!                 60\nI do beseech thy Greatness, give him blows,\nAnd take his bottle from him: when that's gone,\nHe shall drink nought but brine; for I'll not show him\nWhere the quick freshes are.\n\n_Ste._ Trinculo, run into no further danger: interrupt the          65\nmonster one word further, and, by this hand, I'll turn my\nmercy out o' doors, and make a stock-fish of thee.\n\n_Trin._ Why, what did I? I did nothing. I'll go farther\noff.\n\n_Ste._ Didst thou not say he lied?                                  70\n\n_Ari._ Thou liest.\n\n_Ste._ Do I so? take thou that. [_Beats him._] As you\nlike this, give me the lie another time.\n\n_Trin._ I did not give the lie. Out o' your wits, and\nhearing too? A pox o' your bottle! this can sack and                75\ndrinking do. A murrain on your monster, and the devil\ntake your fingers!\n\n_Cal._ Ha, ha, ha!\n\n_Ste._ Now, forward with your tale. --Prithee, stand farther\noff.                                                                80\n\n_Cal._ Beat him enough: after a little time,\nI'll beat him too.\n\n_Ste._ Stand farther. Come, proceed.\n\n_Cal._ Why, as I told thee, 'tis a custom with him\nI' th' afternoon to sleep: there thou mayst brain him,\nHaving first seized his books; or with a log                        85\nBatter his skull, or paunch him with a stake,\nOr cut his wezand with thy knife. Remember\nFirst to possess his books; for without them\nHe's but a sot, as I am, nor hath not\nOne spirit to command: they all do hate him                         90\nAs rootedly as I. Burn but his books.\nHe has brave utensils,--for so he calls them,--\nWhich, when he has a house, he'll deck withal.\nAnd that most deeply to consider is\nThe beauty of his daughter; he himself                              95\nCalls her a nonpareil: I never saw a woman,\nBut only Sycorax my dam and she;\nBut she as far surpasseth Sycorax\nAs great'st does least.\n\n_Ste._                Is it so brave a lass?\n\n_Cal._ Ay, lord; she will become thy bed, I warrant,               100\nAnd bring thee forth brave brood.\n\n_Ste._ Monster, I will kill this man: his daughter and I\nwill be king and queen,--save our Graces!--and Trinculo\nand thyself shall be viceroys. Dost thou like the plot,\nTrinculo?                                                          105\n\n_Trin._ Excellent.\n\n_Ste._ Give me thy hand: I am sorry I beat thee; but,\nwhile thou livest, keep a good tongue in thy head.\n\n_Cal._ Within this half hour will he be asleep:\nWilt thou destroy him then?\n\n_Ste._                    Ay, on mine honour.                      110\n\n_Ari._ This will I tell my master.\n\n_Cal._ Thou makest me merry; I am full of pleasure:\nLet us be jocund: will you troll the catch\nYou taught me but while-ere?\n\n_Ste._ At thy request, monster, I will do reason, any              115\nreason. --Come on. Trinculo, let us sing.      [_Sings._\n\n  Flout 'em and scout 'em, and scout 'em and flout 'em;\n  Thought is free.\n\n_Cal._ That's not the tune.\n\n  [_Ariel plays the tune on a tabor and pipe._\n\n_Ste._ What is this same?                                          120\n\n_Trin._ This is the tune of our catch, played by the picture\nof Nobody.\n\n_Ste._ If thou beest a man, show thyself in thy likeness:\nif thou beest a devil, take't as thou list.\n\n_Trin._ O, forgive me my sins!                                     125\n\n_Ste._ He that dies pays all debts: I defy thee. Mercy\nupon us!\n\n_Cal._ Art thou afeard?\n\n_Ste._ No, monster, not I.\n\n_Cal._ Be not afeard; the isle is full of noises,                  130\nSounds and sweet airs, that give delight, and hurt not.\nSometimes a thousand twangling instruments\nWill hum about mine ears; and sometime voices,\nThat, if I then had waked after long sleep,\nWill make me sleep again: and then, in dreaming,                   135\nThe clouds methought would open, and show riches\nReady to drop upon me; that, when I waked,\nI cried to dream again.\n\n_Ste._ This will prove a brave kingdom to me, where I\nshall have my music for nothing.                                   140\n\n_Cal._ When Prospero is destroyed.\n\n_Ste._ That shall be by and by: I remember the story.\n\n_Trin._ The sound is going away; let's follow it, and\nafter do our work.\n\n_Ste._ Lead, monster; we'll follow. I would I could see            145\nthis taborer; he lays it on.\n\n_Trin._ Wilt come? I'll follow, Stephano.    [_Exeunt._\n\n\n  Notes: III, 2.\n\n  SCENE II. Another...] Theobald. The other... Pope.\n  Enter ...] Enter S. and T. reeling, Caliban following with a bottle.\n    Capell. Enter C. S. and T. with a bottle. Johnson.]\n  8: _head_] F1. _heart_ F2 F3 F4.\n  13, 14: _on. By this light, thou_] _on, by this light thou_ Ff.\n    _on, by this light. --Thou_ Capell.\n  25: _debauched_] _debosh'd_ Ff.\n  37: _to the suit I made to thee_] _the suit I made thee_ Steevens,\n    who prints all Caliban's speeches as verse.\n  60: Johnson conjectured that this line was spoken by Stephano.\n  68: _farther_] F1 _no further_ F2 F3 F4.\n  72: [Beats him.] Rowe.\n  84: _there_] _then_ Collier MS.\n  89: _nor_] _and_ Pope.\n  93: _deck_] _deck't_ Hanmer.\n  96: _I never saw a woman_] _I ne'er saw woman_ Pope.\n  99: _great'st does least_] _greatest does the least_ Rowe.\n  115, 116:] Printed as verse in Ff.\n  115: _any_] F1. _and_ F2 F3 F4.\n  117: _scout 'em, and scout 'em_] Pope. _cout 'em and skowt 'em_ Ff.\n  125: _sins_] _sin_ F4.\n  132: _twangling_] _twanging_ Pope.\n  133: _sometime_] F1. _sometimes_ F2 F3 F4.\n  137: _that_] om. Pope.\n  147: Trin. _Will come? I'll follow, Stephano_] Trin. _Wilt come?_\n    Ste. _I'll follow._ Capell. Ste. _... Wilt come?_\n    Trin. _I'll follow, Stephano._ Ritson conj.\n\n\nSCENE III. _Another part of the island._\n\n  _Enter ALONSO, SEBASTIAN, ANTONIO, GONZALO, ADRIAN, FRANCISCO,\n  and others._\n\n_Gon._ By'r lakin, I can go no further, sir;\nMy old bones ache: here's a maze trod, indeed,\nThrough forth-rights and meanders! By your patience,\nI needs must rest me.\n\n_Alon._             Old lord, I cannot blame thee,\nWho am myself attach'd with weariness,                               5\nTo the dulling of my spirits: sit down, and rest.\nEven here I will put off my hope, and keep it\nNo longer for my flatterer: he is drown'd\nWhom thus we stray to find; and the sea mocks\nOur frustrate search on land. Well, let him go.                     10\n\n_Ant._ [_Aside to Seb._] I am right glad that he's so out of hope.\nDo not, for one repulse, forego the purpose\nThat you resolved to effect.\n\n_Seb._ [_Aside to Ant._] The next advantage\nWill we take throughly.\n\n_Ant._ [_Aside to Seb._] Let it be to-night;\nFor, now they are oppress'd with travel, they                       15\nWill not, nor cannot, use such vigilance\nAs when they are fresh.\n\n_Seb._ [_Aside to Ant._] I say, to-night: no more.\n\n  [_Solemn and strange music._\n\n_Alon._ What harmony is this?--My good friends, hark!\n\n_Gon._ Marvellous sweet music!\n\n  _Enter PROSPERO above, invisible. Enter several strange Shapes,\n  bringing in a banquet: they dance about it with gentle actions of\n  salutation; and, inviting the King, &c. to eat, they depart._\n\n_Alon._ Give us kind keepers, heavens!--What were these?            20\n\n_Seb._ A living drollery. Now I will believe\nThat there are unicorns; that in Arabia\nThere is one tree, the phoenix' throne; one phoenix\nAt this hour reigning there.\n\n_Ant._                     I'll believe both;\nAnd what does else want credit, come to me,                         25\nAnd I'll be sworn 'tis true: travellers ne'er did lie,\nThough fools at home condemn 'em.\n\n_Gon._                          If in Naples\nI should report this now, would they believe me?\nIf I should say, I saw such islanders,--\nFor, certes, these are people of the island,--                      30\nWho, though they are of monstrous shape, yet, note,\nTheir manners are more gentle-kind than of\nOur human generation you shall find\nMany, nay, almost any.\n\n_Pros._              [_Aside_] Honest lord,\nThou hast said well; for some of you there present                  35\nAre worse than devils.\n\n_Alon._              I cannot too much muse\nSuch shapes, such gesture, and such sound, expressing--\nAlthough they want the use of tongue--a kind\nOf excellent dumb discourse.\n\n_Pros._                    [_Aside_] Praise in departing.\n\n_Fran._ They vanish'd strangely.\n\n_Seb._                         No matter, since                     40\nThey have left their viands behind; for we have stomachs.--\nWill't please you taste of what is here?\n\n_Alon._                                Not I.\n\n_Gon._ Faith, sir, you need not fear. When we were boys,\nWho would believe that there were mountaineers\nDew-lapp'd like bulls, whose throats had hanging at 'em             45\nWallets of flesh? or that there were such men\nWhose heads stood in their breasts? which now we find\nEach putter-out of five for one will bring us\nGood warrant of.\n\n_Alon._        I will stand to, and feed,\nAlthough my last: no matter, since I feel                           50\nThe best is past. Brother, my lord the duke,\nStand to, and do as we.\n\n  _Thunder and lightning. Enter ARIEL, like a harpy; claps his\n  wings upon the table; and, with a quaint device, the banquet\n  vanishes._\n\n_Ari._ You are three men of sin, whom Destiny,--\nThat hath to instrument this lower world\nAnd what is in't,--the never-surfeited sea                          55\nHath caused to belch up you; and on this island,\nWhere man doth not inhabit,--you 'mongst men\nBeing most unfit to live. I have made you mad;\nAnd even with such-like valour men hang and drown\nTheir proper selves.    [_Alon., Seb. &c. draw their swords._\n                   You fools! I and my fellows                      60\nAre ministers of Fate: the elements,\nOf whom your swords are temper'd, may as well\nWound the loud winds, or with bemock'd-at stabs\nKill the still-closing waters, as diminish\nOne dowle that's in my plume: my fellow-ministers                   65\nAre like invulnerable. If you could hurt,\nYour swords are now too massy for your strengths,\nAnd will not be uplifted. But remember,--\nFor that's my business to you,--that you three\nFrom Milan did supplant good Prospero;                              70\nExposed unto the sea, which hath requit it,\nHim and his innocent child: for which foul deed\nThe powers, delaying, not forgetting, have\nIncensed the seas and shores, yea, all the creatures,\nAgainst your peace. Thee of thy son, Alonso,                        75\nThey have bereft; and do pronounce by me:\nLingering perdition--worse than any death\nCan be at once--shall step by step attend\nYou and your ways; whose wraths to guard you from,--\nWhich here, in this most desolate isle, else falls                  80\nUpon your heads,--is nothing but heart-sorrow\nAnd a clear life ensuing.\n\n  _He vanishes in thunder; then, to soft music, enter the Shapes\n  again, and dance, with mocks and mows, and carrying out the\n  table._\n\n_Pros._ Bravely the figure of this harpy hast thou\nPerform'd, my Ariel; a grace it had, devouring:\nOf my instruction hast thou nothing bated                           85\nIn what thou hadst to say: so, with good life\nAnd observation strange, my meaner ministers\nTheir several kinds have done. My high charms work,\nAnd these mine enemies are all knit up\nIn their distractions: they now are in my power;                    90\nAnd in these fits I leave them, while I visit\nYoung Ferdinand,--whom they suppose is drown'd,--\nAnd his and mine loved darling.    [_Exit above._\n\n_Gon._ I' the name of something holy, sir, why stand you\nIn this strange stare?\n\n_Alon._              O, it is monstrous, monstrous!                 95\nMethought the billows spoke, and told me of it;\nThe winds did sing it to me; and the thunder,\nThat deep and dreadful organ-pipe, pronounced\nThe name of Prosper: it did bass my trespass.\nTherefore my son i' th' ooze is bedded; and                        100\nI'll seek him deeper than e'er plummet sounded,\nAnd with him there lie mudded.    [_Exit._\n\n_Seb._                       But one fiend at a time,\nI'll fight their legions o'er.\n\n_Ant._                       I'll be thy second.\n\n    [_Exeunt Seb. and Ant._\n\n_Gon._ All three of them are desperate: their great guilt,\nLike poison given to work a great time after,                      105\nNow 'gins to bite the spirits. I do beseech you,\nThat are of suppler joints, follow them swiftly,\nAnd hinder them from what this ecstasy\nMay now provoke them to.\n\n_Adr._                 Follow, I pray you.    [_Exeunt._\n\n\n  Notes: III, 3.\n\n  2: _ache_] _ake_ F2 F3 F4. _akes_ F1.\n  3: _forth-rights_] F2 F3 F4. _fourth rights_ F1.\n  8: _flatterer_] F1. _flatterers_ F2 F3 F4.\n  17: Prospero above] Malone. Prosper on the top Ff. See note (XIV).\n  20: _were_] F1 F2 F3. _are_ F4.\n  26: _'tis true_] _to 't_ Steevens conj.\n  _did lie_] _lied_ Hanmer.\n  29: _islanders_] F2 F3 F4. _islands_ F1.\n  32: _gentle-kind_] Theobald. _gentle, kind_ Ff. _gentle kind_ Rowe.\n  36: _muse_] F1 F2 F3. _muse_, F4. _muse_; Capell.\n  48: _of five for one_] Ff. _on five for one_ Theobald.\n    _of one for five_ Malone, (Thirlby conj.) See note (XV).\n  49-51: _I will ... past_] Mason conjectured that these lines formed\n    a rhyming couplet.\n  53: SCENE IV. Pope.\n  54: _instrument_] _instruments_ F4.\n  56: _belch up you_] F1 F2 F3. _belch you up_ F4. _belch up_ Theobald.\n  60: [... draw their swords] Hanmer.\n  65: _dowle_] _down_ Pope.]\n  _plume_] Rowe. _plumbe_ F1 F2 F3. _plumb_ F4.\n  67: _strengths_] _strength_ F4.\n  79: _wraths_] _wrath_ Theobald.\n  81: _heart-sorrow_] Edd. _hearts-sorrow_ Ff. _heart's-sorrow_ Rowe.\n    _heart's sorrow_ Pope.\n  82: mocks] mopps Theobald.\n  86: _life_] _list_ Johnson conj.\n  90: _now_] om. Pope.\n  92: _whom_] _who_ Hanmer.\n  93: _mine_] _my_ Rowe.\n  [Exit above] Theobald.]\n  94: _something holy, sir_,] _something, holy Sir_, F4.\n  99: _bass_] Johnson. _base_ Ff.\n  106: _do_] om. Pope.\n\n\n\n\nACT IV.\n\n\nSCENE I. _Before PROSPERO'S cell._\n\n  _Enter PROSPERO, FERDINAND, and MIRANDA._\n\n_Pros._ If I have too austerely punish'd you,\nYour compensation makes amends; for I\nHave given you here a third of mine own life,\nOr that for which I live; who once again\nI tender to thy hand: all thy vexations                              5\nWere but my trials of thy love, and thou\nHast strangely stood the test: here, afore Heaven,\nI ratify this my rich gift. O Ferdinand,\nDo not smile at me that I boast her off,\nFor thou shalt find she will outstrip all praise,                   10\nAnd make it halt behind her.\n\n_Fer._                     I do believe it\nAgainst an oracle.\n\n_Pros._          Then, as my gift, and thine own acquisition\nWorthily purchased, take my daughter: but\nIf thou dost break her virgin-knot before                           15\nAll sanctimonious ceremonies may\nWith full and holy rite be minister'd,\nNo sweet aspersion shall the heavens let fall\nTo make this contract grow; but barren hate,\nSour-eyed disdain and discord shall bestrew                         20\nThe union of your bed with weeds so loathly\nThat you shall hate it both: therefore take heed,\nAs Hymen's lamps shall light you.\n\n_Fer._                          As I hope\nFor quiet days, fair issue and long life,\nWith such love as 'tis now, the murkiest den,                       25\nThe most opportune place, the strong'st suggestion\nOur worser Genius can, shall never melt\nMine honour into lust, to take away\nThe edge of that day's celebration\nWhen I shall think, or Phoebus' steeds are founder'd,               30\nOr Night kept chain'd below.\n\n_Pros._                    Fairly spoke.\nSit, then, and talk with her; she is thine own.\nWhat, Ariel! my industrious servant, Ariel!\n\n  _Enter ARIEL._\n\n_Ari._ What would my potent master? here I am.\n\n_Pros._ Thou and thy meaner fellows your last service               35\nDid worthily perform; and I must use you\nIn such another trick. Go bring the rabble,\nO'er whom I give thee power, here to this place:\nIncite them to quick motion; for I must\nBestow upon the eyes of this young couple                           40\nSome vanity of mine art: it is my promise,\nAnd they expect it from me.\n\n_Ari._                    Presently?\n\n_Pros._ Ay, with a twink.\n\n_Ari._ Before you can say, 'come,' and 'go,'\n            And breathe twice, and cry, 'so, so,'                   45\n            Each one, tripping on his toe,\n            Will be here with mop and mow.\n            Do you love me, master? no?\n\n_Pros._ Dearly, my delicate Ariel. Do not approach\nTill thou dost hear me call.\n\n_Ari._                     Well, I conceive.    [_Exit._            50\n\n_Pros._ Look thou be true; do not give dalliance\nToo much the rein: the strongest oaths are straw\nTo the fire i' the blood: be more abstemious,\nOr else, good night your vow!\n\n_Fer._                      I warrant you, sir;\nThe white cold virgin snow upon my heart                            55\nAbates the ardour of my liver.\n\n_Pros._                      Well.\nNow come, my Ariel! bring a corollary,\nRather than want a spirit: appear, and pertly!\nNo tongue! all eyes! be silent.                  [_Soft music._\n\n    _Enter IRIS._\n\n  _Iris._ Ceres, most bounteous lady, thy rich leas                 60\n    Of wheat, rye, barley, vetches, oats, and pease;\n    Thy turfy mountains, where live nibbling sheep,\n    And flat meads thatch'd with stover, them to keep;\n    Thy banks with pioned and twilled brims,\n    Which spongy April at thy best betrims,                         65\n    To make cold nymphs chaste crowns; and thy broom-groves,\n    Whose shadow the dismissed bachelor loves,\n    Being lass-lorn; thy pole-clipt vineyard;\n    And thy sea-marge, sterile and rocky-hard,\n    Where thou thyself dost air;--the queen o' the sky,             70\n    Whose watery arch and messenger am I,\n    Bids thee leave these; and with her sovereign grace,\n    Here on this grass-plot, in this very place,\n    To come and sport:--her peacocks fly amain:\n    Approach, rich Ceres, her to entertain.                         75\n\n    _Enter CERES._\n\n  _Cer._ Hail, many-colour'd messenger, that ne'er\n    Dost disobey the wife of Jupiter;\n    Who, with thy saffron wings, upon my flowers\n    Diffusest honey-drops, refreshing showers;\n    And with each end of thy blue bow dost crown                    80\n    My bosky acres and my unshrubb'd down,\n    Rich scarf to my proud earth;--why hath thy queen\n    Summon'd me hither, to this short-grass'd green?\n\n  _Iris._ A contract of true love to celebrate;\n    And some donation freely to estate                              85\n    On the blest lovers.\n\n  _Cer._             Tell me, heavenly bow,\n    If Venus or her son, as thou dost know,\n    Do now attend the queen? Since they did plot\n    The means that dusky Dis my daughter got,\n    Her and her blind boy's scandal'd company                       90\n    I have forsworn.\n\n  _Iris._        Of her society\n    Be not afraid: I met her Deity\n    Cutting the clouds towards Paphos, and her son\n    Dove-drawn with her. Here thought they to have done\n    Some wanton charm upon this man and maid,                       95\n    Whose vows are, that no bed-right shall be paid\n    Till Hymen's torch be lighted: but in vain;\n    Mars's hot minion is returned again;\n    Her waspish-headed son has broke his arrows,\n    Swears he will shoot no more, but play with sparrows,          100\n    And be a boy right out.\n\n  _Cer._                High'st queen of state,\n    Great Juno, comes; I know her by her gait.\n\n    _Enter JUNO._\n\n  _Juno._ How does my bounteous sister? Go with me\n    To bless this twain, that they may prosperous be,\n    And honour'd in their issue.         [_They sing:_             105\n\n  _Juno._ Honour, riches, marriage-blessing,\n            Long continuance, and increasing,\n            Hourly joys be still upon you!\n            Juno sings her blessings on you.\n\n  _Cer._  Earth's increase, foison plenty,                         110\n            Barns and garners never empty;\n            Vines with clustering bunches growing;\n            Plants with goodly burthen bowing;\n            Spring come to you at the farthest\n            In the very end of harvest!                            115\n            Scarcity and want shall shun you;\n            Ceres' blessing so is on you.\n\n_Fer._ This is a most majestic vision, and\nHarmonious charmingly. May I be bold\nTo think these spirits?\n\n_Pros._               Spirits, which by mine art                   120\nI have from their confines call'd to enact\nMy present fancies.\n\n_Fer._            Let me live here ever;\nSo rare a wonder'd father and a wife\nMakes this place Paradise.\n\n    [_Juno and Ceres whisper, and send Iris on employment._\n\n_Pros._                  Sweet, now, silence!\nJuno and Ceres whisper seriously;                                  125\nThere's something else to do: hush, and be mute,\nOr else our spell is marr'd.\n\n  _Iris._ You nymphs, call'd Naiads, of the windring brooks,\n            With your sedged crowns and ever-harmless looks,\n            Leave your crisp channels, and on this green land      130\n            Answer your summons; Juno does command:\n            Come, temperate nymphs, and help to celebrate\n            A contract of true love; be not too late.\n\n    _Enter certain Nymphs._\n\n            You sunburnt sicklemen, of August weary,\n            Come hither from the furrow, and be merry:             135\n            Make holiday; your rye-straw hats put on,\n            And these fresh nymphs encounter every one\n            In country footing.\n\n    _Enter certain Reapers, properly habited: they join with the\n    Nymphs in a graceful dance; towards the end whereof PROSPERO\n    starts suddenly, and speaks; after which, to a strange, hollow,\n    and confused noise, they heavily vanish._\n\n_Pros._ [_Aside_] I had forgot that foul conspiracy\nOf the beast Caliban and his confederates                          140\nAgainst my life: the minute of their plot\nIs almost come. [_To the Spirits._] Well done! avoid; no more!\n\n_Fer._ This is strange: your father's in some passion\nThat works him strongly.\n\n_Mir._                 Never till this day\nSaw I him touch'd with anger so distemper'd.                       145\n\n_Pros._ You do look, my son, in a moved sort,\nAs if you were dismay'd: be cheerful, sir.\nOur revels now are ended. These our actors,\nAs I foretold you, were all spirits, and\nAre melted into air, into thin air:                                150\nAnd, like the baseless fabric of this vision,\nThe cloud-capp'd towers, the gorgeous palaces,\nThe solemn temples, the great globe itself,\nYea, all which it inherit, shall dissolve,\nAnd, like this insubstantial pageant faded,                        155\nLeave not a rack behind. We are such stuff\nAs dreams are made on; and our little life\nIs rounded with a sleep. Sir, I am vex'd;\nBear with my weakness; my old brain is troubled:\nBe not disturb'd with my infirmity:                                160\nIf you be pleased, retire into my cell,\nAnd there repose: a turn or two I'll walk,\nTo still my beating mind.\n\n_Fer._ _Mir._           We wish your peace.    [_Exeunt._\n\n_Pros._ Come with a thought. I thank thee, Ariel: come.\n\n  _Enter ARIEL._\n\n_Ari._ Thy thoughts I cleave to. What's thy pleasure?              165\n\n_Pros._                                             Spirit,\nWe must prepare to meet with Caliban.\n\n_Ari._ Ay, my commander: when I presented Ceres,\nI thought to have told thee of it; but I fear'd\nLest I might anger thee.\n\n_Pros._ Say again, where didst thou leave these varlets?           170\n\n_Ari._ I told you, sir, they were red-hot with drinking;\nSo full of valour that they smote the air\nFor breathing in their faces; beat the ground\nFor kissing of their feet; yet always bending\nTowards their project. Then I beat my tabor;                       175\nAt which, like unback'd colts, they prick'd their ears,\nAdvanced their eyelids, lifted up their noses\nAs they smelt music: so I charm'd their ears,\nThat, calf-like, they my lowing follow'd through\nTooth'd briers, sharp furzes, pricking goss, and thorns,           180\nWhich enter'd their frail shins: at last I left them\nI' the filthy-mantled pool beyond your cell,\nThere dancing up to the chins, that the foul lake\nO'erstunk their feet.\n\n_Pros._             This was well done, my bird.\nThy shape invisible retain thou still:                             185\nThe trumpery in my house, go bring it hither,\nFor stale to catch these thieves.\n\n_Ari._                          I go, I go.    [_Exit._\n\n_Pros._ A devil, a born devil, on whose nature\nNurture can never stick; on whom my pains,\nHumanely taken, all, all lost, quite lost;                         190\nAnd as with age his body uglier grows,\nSo his mind cankers. I will plague them all,\nEven to roaring.\n\n  _Re-enter ARIEL, loaden with glistering apparel, &c._\n\nCome, hang them on this line.\n\n  _PROSPERO and ARIEL remain, invisible. Enter CALIBAN, STEPHANO,\n  and TRINCULO, all wet._\n\n_Cal._ Pray you, tread softly, that the blind mole may not\nHear a foot fall: we now are near his cell.                        195\n\n_Ste._ Monster, your fairy, which you say is a harmless\nfairy, has done little better than played the Jack with us.\n\n_Trin._ Monster, I do smell all horse-piss; at which my\nnose is in great indignation.\n\n_Ste._ So is mine. Do you hear, monster? If I should               200\ntake a displeasure against you, look you,--\n\n_Trin._ Thou wert but a lost monster.\n\n_Cal._ Good my lord, give me thy favour still.\nBe patient, for the prize I'll bring thee to\nShall hoodwink this mischance: therefore speak softly.             205\nAll's hush'd as midnight yet.\n\n_Trin._ Ay, but to lose our bottles in the pool,--\n\n_Ste._ There is not only disgrace and dishonour in that,\nmonster, but an infinite loss.\n\n_Trin._ That's more to me than my wetting: yet this is             210\nyour harmless fairy, monster.\n\n_Ste._ I will fetch off my bottle, though I be o'er ears for\nmy labour.\n\n_Cal._ Prithee, my king, be quiet. See'st thou here,\nThis is the mouth o' the cell: no noise, and enter.                215\nDo that good mischief which may make this island\nThine own for ever, and I, thy Caliban,\nFor aye thy foot-licker.\n\n_Ste._ Give me thy hand. I do begin to have bloody\nthoughts.                                                          220\n\n_Trin._ O King Stephano! O peer! O worthy Stephano!\nlook what a wardrobe here is for thee!\n\n_Cal._ Let it alone, thou fool; it is but trash.\n\n_Trin._ O, ho, monster! we know what belongs to a frippery.\nO King Stephano!                                                   225\n\n_Ste._ Put off that gown, Trinculo; by this hand, I'll\nhave that gown.\n\n_Trin._ Thy Grace shall have it.\n\n_Cal._ The dropsy drown this fool! what do you mean\nTo dote thus on such luggage? Let's alone,                         230\nAnd do the murder first: if he awake,\nFrom toe to crown he'll fill our skins with pinches,\nMake us strange stuff.\n\n_Ste._ Be you quiet, monster. Mistress line, is not this\nmy jerkin? Now is the jerkin under the line: now, jerkin,          235\nyou are like to lose your hair, and prove a bald jerkin.\n\n_Trin._ Do, do: we steal by line and level, an't like your\nGrace.\n\n_Ste._ I thank thee for that jest; here's a garment for't:\nwit shall not go unrewarded while I am king of this country.       240\n'Steal by line and level' is an excellent pass of pate;\nthere's another garment for't.\n\n_Trin._ Monster, come, put some lime upon your fingers,\nand away with the rest.\n\n_Cal._ I will have none on't: we shall lose our time,              245\nAnd all be turn'd to barnacles, or to apes\nWith foreheads villanous low.\n\n_Ste._ Monster, lay-to your fingers: help to bear this\naway where my hogshead of wine is, or I'll turn you out\nof my kingdom: go to, carry this.                                  250\n\n_Trin._ And this.\n\n_Ste._ Ay, and this.\n\n  _A noise of hunters heard. Enter divers Spirits, in shape of\n  dogs and hounds, and hunt them about, PROSPERO and ARIEL setting\n  them on._\n\n_Pros._ Hey, Mountain, hey!\n\n_Ari._ Silver! there it goes, Silver!\n\n_Pros._ Fury, fury! there, Tyrant, there! hark, hark!              255\n                        [_Cal., Ste., and Trin. are driven out._\n\nGo charge my goblins that they grind their joints\nWith dry convulsions; shorten up their sinews\nWith aged cramps; and more pinch-spotted make them\nThen pard or cat o' mountain.\n\n_Ari._                      Hark, they roar!\n\n_Pros._ Let them be hunted soundly. At this hour                   260\nLie at my mercy all mine enemies:\nShortly shall all my labours end, and thou\nShalt have the air at freedom: for a little\nFollow, and do me service.    [_Exeunt._\n\n\n  Notes: IV, 1.\n\n  3: _a third_] _a thread_ Theobald. _the thread_ Williams conj.\n  4: _who_] _whom_ Pope.\n  7: _test_] F1. _rest_ F2 F3 F4.\n  9: _off_] F2 F3 F4. _of_ F1.\n  11: _do_] om. Pope.\n  13: _gift_] Rowe. _guest_ Ff.\n  14: _but_] F1. om. F2 F3 F4.\n  25: _'tis_] _is_ Capell.\n  30: _Phoebus'_] _Phoebus_ F1. _Phoedus_ F2 F3. _Phoeduus_ F4.\n  34: SCENE II. Pope.\n  41: _vanity_] _rarity_ S. Walker conj.\n  48: _no_?] _no_. Rowe.\n  53: _abstemious_] _abstenious_ F1.\n  60: SCENE III. A MASQUE. Pope.]\n  _thy_] F1. _the_ F2 F3 F4.\n  64: _pioned_] _pionied_ Warburton. _peonied_ Steevens.\n  _twilled_] _tulip'd_ Rowe. _tilled_ Capell (Holt conj.). _lilied_\n    Steevens.]\n  66: _broom-groves_] _brown groves_ Hanmer.\n  68: _pole-clipt_] _pale-clipt_ Hanmer.\n  72: After this line Ff. have the stage direction, '_Juno descends._'\n  74: _her_] Rowe. _here_ Ff.\n  83: _short-grass'd_] F3 F4. _short gras'd_ F1 F2. _short-grass_ Pope.\n  96: _bed-right_] _bed-rite_ Singer.\n  101: _High'st_] _High_ Pope.\n  102: Enter JUNO] om. Ff.\n  110: Cer.] Theobald. om. Ff.\n  _foison_] F1 _and foison_ F2 F3 F4.\n  114: _Spring_] _Rain_ Collier MS.\n  119: _charmingly_] _charming lay_ Hanmer. _charming lays_ Warburton.\n    _Harmoniously charming_ Steevens conj.\n  121: _from their_] F1. _from all their_ F2 F3 F4.\n  123: _wife_] F1 (var.). Rowe. _wise_ F1 (var.) F2 F3 F4.\n  124: _Makes_] _make_ Pope.\n  _sweet, now, silence_] _now, silence, sweet_ Hanmer.\n  124: In Ff. the stage direction [Juno, &c. follows line 127.\n    Capell made the change.\n  128: _windring_] _winding_ Rowe. _wand'ring_ Steevens.\n  129: _sedged_] _sedge_ Collier MS.\n  136: _holiday_] _holly day_ F1 F2 F3. _holy-day_ F4.\n  139: SCENE IV. Pope.\n  143: _This is_] _This'_ (for This 's) S. Walker conj.]\n  _strange_] _most strange_ Hanmer.\n  145: Ff put a comma after _anger_. Warburton omitted it.\n  146: _do_] om. Pope. See note (XVI).\n  151: _this_] F1. _their_ F2 F3 F4. _th' air visions_ Warburton.\n  156: _rack_] F3 F4. _racke_ F1 F2. _track_ Hanmer. _wreck_ Dyce\n    (Malone conj.).\n  163: _your_] F1 F2 F3. _you_ F4.\n  164: _I thank thee, Ariel: come._] _I thank you:--Ariel, come._\n    Theobald.\n  169: _Lest_] F4. _Least_ F1 F2 F3.\n  170: _Say again_] _Well, say again_ Capell.\n  180: _furzes_] Rowe. _firzes_ Ff.\n  181: _shins_] _skins_ Warburton conj. (note, V. 1. p. 87).\n  182: _filthy-mantled_] _filthy mantled_ Ff. _filth-ymantled_\n    Steevens conj.\n  184: _feet_] _fear_ Spedding conj.\n  190: _all, all_] _are all_ Malone conj.\n  193: _them on_ Rowe. _on them_ Ff.\n  Prospero ... invisible. Theobald, Capell. om. Ff.\n  194: SCENE V. Pope.\n  230: _Let's alone_] _Let's along_ Theobald. _Let it alone_ Hanmer.\n    _Let 't alone_ Collier. See note (XVII).\n  246: _to apes_] om. _to_ Pope.\n  255: Stage direction added by Theobald.\n  256: _they_] F1 F3 F4. _thou_ F2.\n  261: _Lie_] Rowe. _lies_ Ff.\n\n\n\n\nACT V.\n\n\nSCENE I. _Before the cell of Prospero._\n\n  _Enter PROSPERO in his magic robes, and ARIEL._\n\n_Pros._ Now does my project gather to a head:\nMy charms crack not; my spirits obey; and time\nGoes upright with his carriage. How's the day?\n\n_Ari._ On the sixth hour; at which time, my lord,\nYou said our work should cease.\n\n_Pros._                       I did say so,                          5\nWhen first I raised the tempest. Say, my spirit,\nHow fares the king and's followers?\n\n_Ari._                            Confined together\nIn the same fashion as you gave in charge,\nJust as you left them; all prisoners, sir,\nIn the line-grove which weather-fends your cell;                    10\nThey cannot budge till your release. The king,\nHis brother, and yours, abide all three distracted,\nAnd the remainder mourning over them,\nBrimful of sorrow and dismay; but chiefly\nHim that you term'd, sir, \"The good old lord, Gonzalo;\"             15\nHis tears run down his beard, like winter's drops\nFrom eaves of reeds. Your charm so strongly works 'em,\nThat if you now beheld them, your affections\nWould become tender.\n\n_Pros._            Dost thou think so, spirit?\n\n_Ari._ Mine would, sir, were I human.\n\n_Pros._                             And mine shall.                 20\nHast thou, which art but air, a touch, a feeling\nOf their afflictions, and shall not myself,\nOne of their kind, that relish all as sharply,\nPassion as they, be kindlier moved than thou art?\nThough with their high wrongs I am struck to the quick,             25\nYet with my nobler reason 'gainst my fury\nDo I take part: the rarer action is\nIn virtue than in vengeance: they being penitent,\nThe sole drift of my purpose doth extend\nNot a frown further. Go release them, Ariel:                        30\nMy charms I'll break, their senses I'll restore,\nAnd they shall be themselves.\n\n_Ari._                      I'll fetch them, sir.    [_Exit._\n\n_Pros._ Ye elves of hills, brooks, standing lakes, and groves;\nAnd ye that on the sands with printless foot\nDo chase the ebbing Neptune, and do fly him                         35\nWhen he comes back; you demi-puppets that\nBy moonshine do the green sour ringlets make,\nWhereof the ewe not bites; and you whose pastime\nIs to make midnight mushrooms, that rejoice\nTo hear the solemn curfew; by whose aid--                           40\nWeak masters though ye be--I have bedimm'd\nThe noontide sun, call'd forth the mutinous winds.\nAnd 'twixt the green sea and the azured vault\nSet roaring war: to the dread rattling thunder\nHave I given fire, and rifted Jove's stout oak                      45\nWith his own bolt; the strong-based promontory\nHave I made shake, and by the spurs pluck'd up\nThe pine and cedar: graves at my command\nHave waked their sleepers, oped, and let 'em forth\nBy my so potent art. But this rough magic                           50\nI here abjure; and, when I have required\nSome heavenly music,--which even now I do,--\nTo work mine end upon their senses, that\nThis airy charm is for, I'll break my staff,\nBury it certain fathoms in the earth,                               55\nAnd deeper than did ever plummet sound\nI'll drown my book.                    [_Solemn music._\n\n  _Re-enter ARIEL before: then ALONSO, with a frantic gesture,\n  attended by GONZALO; SEBASTIAN and ANTONIO in like manner,\n  attended by ADRIAN and FRANCISCO: they all enter the circle\n  which PROSPERO had made, and there stand charmed; which PROSPERO\n  observing, speaks:_\n\nA solemn air, and the best comforter\nTo an unsettled fancy, cure thy brains,\nNow useless, boil'd within thy skull! There stand,                  60\nFor you are spell-stopp'd.\nHoly Gonzalo, honourable man,\nMine eyes, even sociable to the show of thine,\nFall fellowly drops. The charm dissolves apace;\nAnd as the morning steals upon the night,                           65\nMelting the darkness, so their rising senses\nBegin to chase the ignorant fumes that mantle\nTheir clearer reason. O good Gonzalo,\nMy true preserver, and a loyal sir\nTo him thou follow'st! I will pay thy graces                        70\nHome both in word and deed. Most cruelly\nDidst thou, Alonso, use me and my daughter:\nThy brother was a furtherer in the act.\nThou art pinch'd for't now, Sebastian. Flesh and blood,\nYou, brother mine, that entertain'd ambition,                       75\nExpell'd remorse and nature; who, with Sebastian,--\nWhose inward pinches therefore are most strong,--\nWould here have kill'd your king; I do forgive thee,\nUnnatural though thou art. Their understanding\nBegins to swell; and the approaching tide                           80\nWill shortly fill the reasonable shore,\nThat now lies foul and muddy. Not one of them\nThat yet looks on me, or would know me: Ariel,\nFetch me the hat and rapier in my cell:\nI will discase me, and myself present                               85\nAs I was sometime Milan: quickly, spirit;\nThou shalt ere long be free.\n\n_ARIEL sings and helps to attire him._\n\n    Where the bee sucks, there suck I:\n    In a cowslip's bell I lie;\n    There I couch when owls do cry.                                 90\n    On the bat's back I do fly\n    After summer merrily.\nMerrily, merrily shall I live now\nUnder the blossom that hangs on the bough.\n\n_Pros._ Why, that's my dainty Ariel! I shall miss thee;             95\nBut yet thou shalt have freedom: so, so, so.\nTo the king's ship, invisible as thou art:\nThere shalt thou find the mariners asleep\nUnder the hatches; the master and the boatswain\nBeing awake, enforce them to this place,                           100\nAnd presently, I prithee.\n\n_Ari._ I drink the air before me, and return\nOr ere your pulse twice beat.    [_Exit._\n\n_Gon._ All torment, trouble, wonder and amazement\nInhabits here: some heavenly power guide us                        105\nOut of this fearful country!\n\n_Pros._                    Behold, sir king,\nThe wronged Duke of Milan, Prospero:\nFor more assurance that a living prince\nDoes now speak to thee, I embrace thy body;\nAnd to thee and thy company I bid                                  110\nA hearty welcome.\n\n_Alon._         Whether thou be'st he or no,\nOr some enchanted trifle to abuse me,\nAs late I have been, I not know: thy pulse\nBeats, as of flesh and blood; and, since I saw thee,\nThe affliction of my mind amends, with which,                      115\nI fear, a madness held me: this must crave--\nAn if this be at all--a most strange story.\nThy dukedom I resign, and do entreat\nThou pardon me my wrongs. --But how should Prospero\nBe living and be here?\n\n_Pros._              First, noble friend,                          120\nLet me embrace thine age, whose honour cannot\nBe measured or confined.\n\n_Gon._                 Whether this be\nOr be not, I'll not swear.\n\n_Pros._                  You do yet taste\nSome subtilties o' the isle, that will not let you\nBelieve things certain. Welcome, my friends all!                   125\n[_Aside to Seb. and Ant._]\n    But you, my brace of lords, were I so minded,\nI here could pluck his Highness' frown upon you,\nAnd justify you traitors: at this time\nI will tell no tales.\n\n_Seb._ [_Aside_]    The devil speaks in him.\n\n_Pros._                                    No.\nFor you, most wicked sir, whom to call brother                     130\nWould even infect my mouth, I do forgive\nThy rankest fault,--all of them; and require\nMy dukedom of thee, which perforce, I know,\nThou must restore.\n\n_Alon._          If thou be'st Prospero,\nGive us particulars of thy preservation;                           135\nHow thou hast met us here, who three hours since\nWere wreck'd upon this shore; where I have lost--\nHow sharp the point of this remembrance is!--\nMy dear son Ferdinand.\n\n_Pros._              I am woe for't, sir.\n\n_Alon._ Irreparable is the loss; and patience                      140\nSays it is past her cure.\n\n_Pros._                 I rather think\nYou have not sought her help, of whose soft grace\nFor the like loss I have her sovereign aid,\nAnd rest myself content.\n\n_Alon._                You the like loss!\n\n_Pros._ As great to me as late; and, supportable                   145\nTo make the dear loss, have I means much weaker\nThan you may call to comfort you, for I\nHave lost my daughter.\n\n_Alon._              A daughter?\nO heavens, that they were living both in Naples,\nThe king and queen there! that they were, I wish                   150\nMyself were mudded in that oozy bed\nWhere my son lies. When did you lose you daughter?\n\n_Pros._ In this last tempest. I perceive, these lords\nAt this encounter do so much admire,\nThat they devour their reason, and scarce think                    155\nTheir eyes do offices of truth, their words\nAre natural breath: but, howsoe'er you have\nBeen justled from your senses, know for certain\nThat I am Prospero, and that very duke\nWhich was thrust forth of Milan; who most strangely                160\nUpon this shore, where you were wreck'd, was landed,\nTo be the Lord on't. No more yet of this;\nFor 'tis a chronicle of day by day,\nNot a relation for a breakfast, nor\nBefitting this first meeting. Welcome, sir;                        165\nThis cell's my court: here have I few attendants,\nAnd subjects none abroad: pray you, look in.\nMy dukedom since you have given me again,\nI will requite you with as good a thing;\nAt least bring forth a wonder, to content ye                       170\nAs much as me my dukedom.\n\n  _Here Prospero discovers FERDINAND and MIRANDA playing at chess._\n\n_Mir._ Sweet lord, you play me false.\n\n_Fer._                              No, my dear'st love,\nI would not for the world.\n\n_Mir._ Yes, for a score of kingdoms you should wrangle,\nAnd I would call it fair play.\n\n_Alon._                      If this prove                         175\nA vision of the island, one dear son\nShall I twice lose.\n\n_Seb._            A most high miracle!\n\n_Fer._ Though the seas threaten, they are merciful;\nI have cursed them without cause.               [_Kneels._\n\n_Alon._                          Now all the blessings\nOf a glad father compass thee about!                               180\nArise, and say how thou camest here.\n\n_Mir._                             O, wonder!\nHow many goodly creatures are there here!\nHow beauteous mankind is! O brave new world,\nThat has such people in't!\n\n_Pros._                  'Tis new to thee.\n\n_Alon._ What is this maid with whom thou wast at play?             185\nYour eld'st acquaintance cannot be three hours:\nIs she the goddess that hath sever'd us,\nAnd brought us thus together?\n\n_Fer._                      Sir, she is mortal;\nBut by immortal Providence she's mine:\nI chose her when I could not ask my father                         190\nFor his advice, nor thought I had one. She\nIs daughter to this famous Duke of Milan,\nOf whom so often I have heard renown,\nBut never saw before; of whom I have\nReceived a second life; and second father                          195\nThis lady makes him to me.\n\n_Alon._                  I am hers:\nBut, O, how oddly will it sound that I\nMust ask my child forgiveness!\n\n_Pros._                      There, sir, stop:\nLet us not burthen our remembrances with\nA heaviness that's gone.\n\n_Gon._                 I have inly wept,                           200\nOr should have spoke ere this. Look down, you gods,\nAnd on this couple drop a blessed crown!\nFor it is you that have chalk'd forth the way\nWhich brought us hither.\n\n_Alon._                I say, Amen, Gonzalo!\n\n_Gon._ Was Milan thrust from Milan, that his issue                 205\nShould become kings of Naples? O, rejoice\nBeyond a common joy! and set it down\nWith gold on lasting pillars: In one voyage\nDid Claribel her husband find at Tunis,\nAnd Ferdinand, her brother, found a wife                           210\nWhere he himself was lost, Prospero his dukedom\nIn a poor isle, and all of us ourselves\nWhen no man was his own.\n\n_Alon._ [_to Fer. and Mir._] Give me your hands:\nLet grief and sorrow still embrace his heart\nThat doth not wish you joy!\n\n_Gon._                    Be it so! Amen!                          215\n\n  _Re-enter ARIEL, with the _Master_ and _Boatswain_ amazedly\n  following._\n\nO, look, sir, look, sir! here is more of us:\nI prophesied, if a gallows were on land,\nThis fellow could not drown. Now, blasphemy,\nThat swear'st grace o'erboard, not an oath on shore?\nHast thou no mouth by land? What is the news?                      220\n\n_Boats._ The best news is, that we have safely found\nOur king and company; the next, our ship--\nWhich, but three glasses since, we gave out split--\nIs tight and yare and bravely rigg'd, as when\nWe first put out to sea.\n\n_Ari._ [_Aside to Pros._] Sir, all this service                    225\nHave I done since I went.\n\n_Pros._ [_Aside to Ari._] My tricksy spirit!\n\n_Alon._ These are not natural events; they strengthen\nFrom strange to stranger. Say, how came you hither?\n\n_Boats._ If I did think, sir, I were well awake,\nI'ld strive to tell you. We were dead of sleep,                    230\nAnd--how we know not--all clapp'd under hatches;\nWhere, but even now, with strange and several noises\nOf roaring, shrieking, howling, jingling chains,\nAnd more diversity of sounds, all horrible,\nWe were awaked; straightway, at liberty;                           235\nWhere we, in all her trim, freshly beheld\nOur royal, good, and gallant ship; our master\nCapering to eye her:--on a trice, so please you,\nEven in a dream, were we divided from them,\nAnd were brought moping hither.\n\n_Ari._ [_Aside to Pros._] Was't well done?                         240\n\n_Pros._ [_Aside to Ari._] Bravely, my diligence. Thou shalt be free.\n\n_Alon._ This is as strange a maze as e'er men trod;\nAnd there is in this business more than nature\nWas ever conduct of: some oracle\nMust rectify our knowledge.\n\n_Pros._                   Sir, my liege,                           245\nDo not infest your mind with beating on\nThe strangeness of this business; at pick'd leisure\nWhich shall be shortly, single I'll resolve you,\nWhich to you shall seem probable, of every\nThese happen'd accidents; till when, be cheerful,                  250\nAnd think of each thing well.\n    [_Aside to Ari._] Come hither, spirit:\nSet Caliban and his companions free;\nUntie the spell. [_Exit Ariel._] How fares my gracious sir?\nThere are yet missing of your company\nSome few odd lads that you remember not.                           255\n\n  _Re-enter ARIEL, driving in CALIBAN, STEPHANO, and TRINCULO,\n  in their stolen apparel._\n\n_Ste._ Every man shift for all the rest, and let no man\ntake care for himself; for all is but fortune. --Coragio,\nbully-monster, coragio!\n\n_Trin._ If these be true spies which I wear in my head,\nhere's a goodly sight.                                             260\n\n_Cal._ O Setebos, these be brave spirits indeed!\nHow fine my master is! I am afraid\nHe will chastise me.\n\n_Seb._             Ha, ha!\nWhat things are these, my lord Antonio?\nWill money buy 'em?\n\n_Ant._            Very like; one of them                           265\nIs a plain fish, and, no doubt, marketable.\n\n_Pros._ Mark but the badges of these men, my lords,\nThen say if they be true. This mis-shapen knave,\nHis mother was a witch; and one so strong\nThat could control the moon, make flows and ebbs,                  270\nAnd deal in her command, without her power.\nThese three have robb'd me; and this demi-devil--\nFor he's a bastard one--had plotted with them\nTo take my life. Two of these fellows you\nMust know and own; this thing of darkness I                        275\nAcknowledge mine.\n\n_Cal._          I shall be pinch'd to death.\n\n_Alon._ Is not this Stephano, my drunken butler?\n\n_Seb._ He is drunk now: where had he wine?\n\n_Alon._ And Trinculo is reeling ripe: where should they\nFind this grand liquor that hath gilded 'em?--                     280\nHow camest thou in this pickle?\n\n_Trin._ I have been in such a pickle, since I saw you\nlast, that, I fear me, will never out of my bones: I shall not\nfear fly-blowing.\n\n_Seb._ Why, how now, Stephano!                                     285\n\n_Ste._ O, touch me not;--I am not Stephano, but a cramp.\n\n_Pros._ You'ld be king o' the isle, sirrah?\n\n_Ste._ I should have been a sore one, then.\n\n_Alon._ This is a strange thing as e'er I look'd on.\n                                [_Pointing to Caliban._\n\n_Pros._ He is as disproportion'd in his manners                    290\nAs in his shape. Go, sirrah, to my cell;\nTake with you your companions; as you look\nTo have my pardon, trim it handsomely.\n\n_Cal._ Ay, that I will; and I'll be wise hereafter,\nAnd seek for grace. What a thrice-double ass                       295\nWas I, to take this drunkard for a god,\nAnd worship this dull fool!\n\n_Pros._                Go to; away!\n\n_Alon._ Hence, and bestow your luggage where you found it.\n\n_Seb._ Or stole it, rather.    [_Exeunt Cal., Ste., and Trin._\n\n_Pros._ Sir, I invite your Highness and your train                 300\nTo my poor cell, where you shall take your rest\nFor this one night; which, part of it, I'll waste\nWith such discourse as, I not doubt, shall make it\nGo quick away: the story of my life,\nAnd the particular accidents gone by                               305\nSince I came to this isle: and in the morn\nI'll bring you to your ship, and so to Naples,\nWhere I have hope to see the nuptial\nOf these our dear-beloved solemnized;\nAnd thence retire me to my Milan, where                            310\nEvery third thought shall be my grave.\n\n_Alon._                              I long\nTo hear the story of your life, which must\nTake the ear strangely.\n\n_Pros._               I'll deliver all;\nAnd promise you calm seas, auspicious gales,\nAnd sail so expeditious, that shall catch\nYour royal fleet far off. [_Aside to Ari._] My Ariel, chick,       315\nThat is thy charge: then to the elements\nBe free, and fare thou well! Please you, draw near.\n    [_Exeunt._\n\n\n  Notes: V, 1.\n\n  7: _together_] om. Pope.\n  9: _all_] _all your_ Pope.\n  10: _line-grove_] _lime-grove_ Rowe.\n  11: _your_] F1 F2. _you_ F3 F4.\n  15: _sir_] om. Pope.\n  16: _run_] _runs_ F1.\n  _winter's_] _winter_ F4.]\n  23: F1 F2 put a comma after _sharply_. F3 F4 omit it.\n  24: _Passion_] _Passion'd_ Pope.\n  26: _'gainst_] Pope. _gainst_ F1 F2. _against_ F3 F4.\n  33: SCENE II. Pope.\n  37: _green sour_] _green-sward_ Douce conj.\n  46: _strong-based_] Rowe. _strong-bass'd_ Ff.\n  58: SCENE III. Pope.\n  60: _boil'd_] Pope. _boile_ F1 F2. _boil_ F3 F4.\n  62: _Holy_] _Noble_ Collier MS.\n  63: _show_] _shew_ Ff. _flow_ Collier MS.\n  64: _fellowly_] _fellow_ Pope.\n  68: _O_] _O my_ Pope. _O thou_ S. Walker conj.\n  69: _sir_] _servant_ Collier MS.\n  72: _Didst_] F3 F4. _Did_ F1 F2.\n  74: _Sebastian. Flesh and blood,_] _Sebastian, flesh and blood._\n    Theobald.\n  75: _entertain'd_] _entertaine_ F1.\n  76: _who_] Rowe. _whom_ Ff.\n  82: _lies_] F3 F4. _ly_ F1 F2.\n  83: _or_] _e'er_ Collier MS.\n  84: Theobald gives as stage direction \"Exit Ariel and returns\n    immediately.\"\n  88: _suck_] _lurk_ Theobald.\n  90: _couch_] _crowch_ F3 F4.\n  [Capell punctuates _There I couch: when owls do cry,_]\n  92: _summer_] _sun-set_ Theobald.\n  106: _Behold,_] _lo!_ Pope.\n  111: _Whether thou be'st_] _Where thou beest_ Ff. _Be'st thou_ Pope.\n    _Whe'r thou be'st_ Capell.\n  112: _trifle_] _devil_ Collier MS.\n  119: _my_] _thy_ Collier MS.\n  124: _not_] F3 F4. _nor_ F1 F2.\n  132: _fault_] _faults_ F4.\n  136: _who_] F2 F3 F4. _whom_ F1.\n  145: _and,_] _sir, and_ Capell.\n  _supportable_] F1 F2. _insupportable_ F3 F4. _portable_ Steevens.\n  148: _my_] _my only_ Hanmer.\n  _A daughter_] _Only daughter_ Hanmer. _Daughter_ Capell.\n  156: _eyes_] F1. _eye_ F2 F3 F4.\n  _their_] _these_ Capell.]\n  172: SCENE IV. Pope.\n  Here Prospero discovers...] Ff. SCENE opens to the entrance of\n    the cell. Here Prospero discovers... Theobald. Cell opens and\n    discovers... Capell.]\n  172: _dear'st_] _dearest_ Ff.\n  179: [Kneels] Theobald.\n  191: _advice_] F4. _advise_ F1 F2 F3.\n  199, 200: _remembrances with_] _remembrance with_ Pope.\n    _remembrances With_ Malone.\n  213: _When_] _Where_ Johnson conj.]\n  _and_] om. Capell.\n  216: SCENE V. Pope.\n  _sir, look, sir_] _sir, look_ F3 F4.]\n  _is_] _are_ Pope.]\n  221: _safely_] _safe_ F3 F4.\n  230: _of sleep_] _a-sleep_ Pope.\n  234: _more_] Rowe. _mo_ F1 F2. _moe_ F3 F4.\n  236: _her_] Theobald (Thirlby conj.). _our_ Ff.\n  242-245: Given to Ariel in F2 F3 F4.\n  247: _leisure_] F1. _seisure_ F2. _seizure_ F3 F4.\n  248: _Which shall be shortly, single_] Pope. _(which shall be\n    shortly single)_ Ff.\n  253: [Exit Ariel] Capell.\n  256: SCENE VI. Pope.\n  258: _Coragio_] _corasio_ F1.\n  268: _mis-shapen_] _mis-shap'd_ Pope.\n  271: _command, without her power._] _command. Without her power,_\n    anon. conj.\n  _without_] _with all_ Collier MS.\n  280: _liquor_] _'lixir_ Theobald.\n  282-284: Printed as verse in Ff.\n  289: _This is_] F1 F2. _'Tis_ F3 F4.]\n  _e'er I_] _I ever_ Hanmer.\n  [Pointing to Caliban.] Steevens.]\n  299: [Exeunt... Trin.] Capell.\n  308: _nuptial_] _nuptiall_ F1. _nuptials_ F2 F3 F4.\n  309: See note (XVIII).\n\n\n\n\nEPILOGUE.\n\nSPOKEN BY PROSPERO.\n\nNow my charms are all o'erthrown,\nAnd what strength I have's mine own,\nWhich is most faint: now, 'tis true,\nI must be here confined by you,\nOr sent to Naples. Let me not,                                       5\nSince I have my dukedom got,\nAnd pardon'd the deceiver, dwell\nIn this bare island by your spell;\nBut release me from my bands\nWith the help of your good hands:                                   10\nGentle breath of yours my sails\nMust fill, or else my project fails,\nWhich was to please. Now I want\nSpirits to enforce, art to enchant;\nAnd my ending is despair,                                           15\nUnless I be relieved by prayer,\nWhich pierces so, that it assaults\nMercy itself, and frees all faults.\nAs you from crimes would pardon'd be,\nLet your indulgence set me free.                                    20\n\n\n  Notes: Epilogue.\n\n  EPILOGUE ... PROSPERO.] advancing, Capell.]\n  1: _Now_] _Now, now_ F3 F4.\n  3: _now_] _and now_ Pope.\n  13: _Now_] _For now_ Pope.\n\n\n\n\nNOTES.\n\n\nNOTE I.\n\nI. 1. 15. _What cares these roarers._ This grammatical inaccuracy, which\nescaped correction in the later folios, probably came from Shakespeare's\npen. Similar cases occur frequently, especially when the verb precedes\nits nominative. For example, _Tempest_, IV. 1. 262, 'Lies at my mercy\nall mine enemies,' and _Measure for Measure_, II. 1. 22, 'What knows the\nlaws, &c.' We correct it in those passages where the occurrence of a\nvulgarism would be likely to annoy the reader. In the mouth of a\nBoatswain it can offend no one. We therefore leave it.\n\n\nNOTE II.\n\nI. 1. 57-59. _Mercy on us!--we split, &c._ It may be doubtful whether\nthe printer of the first folio intended these broken speeches to express\n'a confused noise within.' Without question such was the author's\nmeaning. Rowe, however, and subsequent editors, printed them as part of\nGonzalo's speech. Capell was the first editor who gave the true\narrangement.\n\n\nNOTE III.\n\nI. 2. 173. _princesses._ See Mr Sidney Walker's _Shakespeare's\nVersification_, p. 243 sqq. 'The plurals of substantives ending in _s_,\nin certain instances, in _se_, _ss_, _ce_, and sometimes _ge_, ... are\nfound without the usual addition of _s_ or _es_, in pronunciation at\nleast, although in many instances the plural affix is added in printing,\nwhere the metre shows that it is not to be pronounced.'\n\nIn this and other instances, we have thought it better to trust to the\near of the reader for the rhythm than to introduce an innovation in\northography which might perplex him as to the sense. The form\n'princesses,' the use of which in Shakespeare's time was doubted by one\nof our correspondents, is found in the _History of King Leir_.\n\nRowe's reading 'princes' might be defended on the ground that the\nsentiment is general, and applicable to royal children of both sexes; or\nthat Sir Philip Sidney, in the first book of the _Arcadia_, calls Pamela\nand Philoclea 'princes.'\n\n\nNOTE IV.\n\nI. 2. 298. The metre of this line, as well as of lines 301, 302, is\ndefective, but as no mode of correction can be regarded as completely\nsatisfactory we have in accordance with our custom left the lines as\nthey are printed in the Folio. The defect, indeed, in the metre of line\n298 has not been noticed except by Hanmer, who makes a line thus:\n\n  'Do so, and after two days I'll discharge thee.'\n\nPossibly it ought to be printed thus:\n\n              'Do so; and\n  After two days\n  I will discharge thee.'\n\nThere is a broken line, also of four syllables, 253 of the same scene,\nanother of seven, 235.\n\nThere is no reason to doubt that the _words_ are as Shakespeare wrote\nthem, for, although the action of the play terminates in less than four\nhours (I. 2. 240 and V. 1. 186), yet Ariel's ministry is not to end till\nthe voyage to Naples shall be over. Prospero, too, repeats his promise,\nand marks his contentment by further shortening the time of servitude,\n'within two days,' I. 2. 420. Possibly 'Invisible' (301) should have a\nline to itself. Words thus occupying a broken line acquire a marked\nemphasis.\n\nBut the truth is that in dialogue Shakespeare's language passes so\nrapidly from verse to prose and from prose to verse, sometimes even\nhovering, as it were, over the confines, being rhythmical rather than\nmetrical, that all attempts to give regularity to the metre must be made\nwith diffidence and received with doubt.\n\n\nNOTE V.\n\nI. 2. 377, 378:\n\n  _Courtsied when you have and kiss'd_\n  _The wild waves whist._\n\nThis punctuation seems to be supported by what Ferdinand says (391,\n392):\n\n  'The music crept by me upon the waters,\n  Allaying both their fury and my passion, &c.'\n\nAt the end of the stanza we have printed _Hark, hark! ... The watch-dogs\nbark_ as that part of the burthen which 'sweet sprites bear.' The other\npart is borne by distant watch-dogs.\n\n\nNOTE VI.\n\nI. 2. 443. _I fear you have done yourself some wrong._ See this phrase\nused in a similar sense, _Measure for Measure_, I. 11. 39.\n\n\nNOTE VII.\n\nII. 1. 27. _Which, of he or Adrian._ 'Of' is found in the same\nconstruction, _Midsummer Night's Dream_, III. 2. 336,\n\n  'Now follow if thou darest to try whose right,\n  Of thine or mine, is most in Helena.'\n\n\nNOTE VIII.\n\nII. 1. 157. _Of its own kind._ There is no doubt, as Dr Guest has shewn,\nthat 'it,' which is the reading of the 1st and 2nd folios, was commonly\nused as a genitive in Shakespeare's time, as it is still in some\nprovincial dialects. 'Its,' however, was coming into use. One instance\noccurs in this play, I. 11. 95, 'in its contrary.'\n\n\nNOTE IX.\n\nII. 1. 241. _she that from whom._ Mr Spedding writes: 'The received\nemendation is not satisfactory to me. I would rather read, \"She\nthat--From whom? All were sea-swallow'd &c., i.e. from whom should she\nhave note? The report from Naples will be that all were drowned. We\nshall be the only survivors.\" The break in the construction seems to me\ncharacteristic of the speaker. But you must read the whole speech to\nfeel the effect.'\n\n\nNOTE X.\n\nII. 1. 249-251. All editors except Mr Staunton have printed in italics\n(or between inverted commas) only as far as '_Naples?_', but as '_keep_'\nis printed with a small k in the folios, they seem to sanction the\narrangement given in our text.\n\n\nNOTE XI.\n\nII. 1. 267. _Ay, sir; where lies that? if 'twere a kibe._ Mr Singer and\nMr Dyce have changed ''twere' to 'it were' for the sake of the metre.\nBut then the first part of the line must be read with a wrong emphasis.\nThe proper emphasis clearly falls on the first, third, and fifth\nsyllables, 'AY, sir; WHERE lies THAT?' See Preface.\n\n\nNOTE XII.\n\nII. 2. 165. Before 'here; bear my bottle' Capell inserts a stage\ndirection [_To Cal._], but it appears from III. 2. 62, that Trinculo was\nentrusted with the office of bottle-bearer.\n\n\nNOTE XIII.\n\nIII. 1. 15. _Most busy lest, when I do it._ As none of the proposed\nemendations can be regarded as certain, we have left the reading of F1,\nthough it is manifestly corrupt. The spelling 'doe' makes Mr Spedding's\nconjecture 'idlest' for 'I doe it' more probable.\n\n\nNOTE XIV.\n\nIII. 3. 17. The stage direction, which we have divided into two parts,\nis placed all at once in the folios after 'as when they are fresh'\n[Solemne and strange Musicke; and Prosper on the top (invisible:) Enter\n... depart].\n\nPope transferred it to follow Sebastian's words, 'I say, to night: no\nmore.'\n\n\nNOTE XV.\n\nIII. 3. 48. _Each putter out of five for one._ See Beaumont and\nFletcher, _The Noble Gentleman_, I. 1. (Vol. II. p. 261, ed. Moxon):\n'The return will give you five for one.' MARINE is about to travel.\n\n\nNOTE XVI.\n\nIV. 1. 146. _You do look, my son, in a moved sort._ Seymour suggests a\ntransposition: 'you do, my son, look in a moved sort.' This line however\ncan scarcely have come from Shakespeare's pen. Perhaps the writer who\ncomposed the Masque was allowed to join it, as best he might, to\nShakespeare's words, which re-commence at 'Our revels now are ended,'\n&c.\n\n\nNOTE XVII.\n\nIV. 1. 230. _Let's alone._ See Staunton's \"Shakespeare,\" Vol. I. p. 81,\nnote (b).\n\n\nNOTE XVIII.\n\nV. 1. 309. _Of these our dear-beloved solemnized._ The Folios have\n'belov'd'; a mode of spelling, which in this case is convenient as\nindicating the probable rhythm of the verse. We have written 'beloved,'\nin accordance with the general rule mentioned in the Preface.\n\n'Solemnized' occurs in four other verse passages of Shakespeare. It is\nthree times to be accented 'SOlemnized' and once (_Love's Labour's\nLost_, II. 1. 41) 'soLEMnized.'\n\n       *       *       *       *       *\n           *       *       *       *\n       *       *       *       *       *\n\nSources:\n\nThe editors' Preface (e-text 23041) discusses the 17th- and\n18th-century editions in detail; the newer (19th-century) editions\nare simply listed by name. The following editions may appear in the\nNotes. All inset text is quoted from the Preface.\n\n  Folios:\n  F1 1623; F2 (no date given); F3 1663; F4 1685.\n    \"The five plays contained in this volume occur in the first Folio\n    in the same order, and ... were there printed for the first time.\"\n\n  Early editions:\n  Rowe 1709\n  Pope 1715\n    \"Pope was the first to indicate the _place_ of each new scene;\n    as, for instance, _Tempest_, I. 1. 'On a ship at sea.' He also\n    subdivided the scenes as given by the Folios and Rowe, making\n    a fresh scene whenever a new character entered--an arrangement\n    followed by Hanmer, Warburton, and Johnson. For convenience of\n    reference to these editions, we have always recorded the\n    commencement of Pope's scenes.\"\n  Theobald 1733\n  Hanmer (\"Oxford edition\") 1744\n  Warburton 1747\n  Johnson 1765\n  Capell 1768; _also Capell's annotated copy of F2_\n  Steevens 1773\n  Malone 1790\n  Reed 1803\n\n  Later editions:\n  Singer, Knight, Cornwall, Collier, Phelps, Halliwell, Dyce, Staunton\n\n  Dryden:\n    \"_The Tempest_ was altered by Dryden and D'Avenant, and published\n    as _The Tempest; or the Enchanted Island_, in 1669. We mark the\n    emendations derived from it: 'Dryden's version.'\"\n\n\nErrors and inconsistencies:\n\n  _Re-enter Boatswain._\n    [printed BOATSWAIN in small capitals]\n  _Enter _Ariel_._\n    [printed \"Ariel\" in lower case]\n  Where my son lies. When did you lose you daughter?\n    [Text unchanged: error for \"your\"?]\n\n  [Text-critical notes]\n\n  I. 2. 135: _to 't_] om. Steevens (Farmer conj.).\n    [Here and elsewhere in the volume, body text has unspaced \"to't\"\n    while line notes have spaced \"to 't\".]\n  I. 2. 202: _o' the_] _of_ Pope.\n    [Text unchanged: body text is capitalized \"O' the\"]\n  II. 1. 88: _Ay._] I. Ff. _Ay?_ Pope.\n    [Text unchanged: apparent error for italic _I._]\n  III. 3. 17: Prospero above]\n    [Text unchanged: stage direction is after l. 19]\n\n  [Endnotes]\n\n  I: I. 1. 15.  [I. 1. 16]\n  V: 377, 378.  [376-377]\n  XVI: IV. 1. 146  [IV. 1. 147]", "title": "The Tempest"}