{"summary": "\nThe Play opens in Dr. Stockmann's household. Mrs. Stockmann is entertaining the dinner guests. As the evening progresses the Mayor (also Dr. Stockmann's brother) and Hovstad (the editor of the newspaper) have come to the house. Dr. Stockmann and his two sons Ejlif and Morten have come home from a walk. As they all gather in the house, the Mayor needs to confront his brother about an article regarding the town health baths and the rumors that have been raised about them being contaminated. The Brothers get into an argument about their positions on hiding the truth and shaping the truth to get the results that are convenient. Petra (the Doctor's daughter) brings in the letter that her father has been waiting for. After Dr. Stockmann reads the letter, he discover his suspicions were right and the water from the baths is in fact contaminated. Hovstad now agrees to print the article and unfold the story. This will bring a great deal of attention to the baths and possibly will be the end of them (which will have repercussions on the town's economy). But Dr. Stockmann is overwhelmed with all that has happened and quickly believes he is the savior of the town.\n\nThe next morning in Dr. Stockmann house, Mrs. Stockmann gives the news to her husband that his brother Peter will stop by to talk about the baths. Meantime Morten Kiil (Dr. Stockmann's father in law) stops by the house to congratulate him on his discovery and what this will mean to the town. Hovstad and Aslaksen (the printer) stop by the house as well to reinforce their commitment to the doctor and extend their gratitude. The new alliance between the paper and Dr. Stockmann has a deeper interest than just the baths. The paper wants to confront the government of the town and expose the corruption that happens behind closed doors, and this opportunity is a way to start.\nPeter (the mayor) enters the house, and everything becomes tense. Peter tells Dr. Stockmann that if he proceeds with this article and exposes this information to the town, he will be partially culpable for the ruin of the town. Peter accuses Dr. Stockmann of being selfish and not thinking of the bigger picture. He is encouraging Dr. Stockmann to retract himself from this article and to solve this problem in a more quiet way. The Doctor refuses his brother's propositions and the mayor reiterates that there will be terrible consequences for him and his family.\n\nIn the newspaper office Hovstad and Billing discuss the pros and cons of running Dr. Stockmann's article bashing the reputation of the government of the town. They are ready to proceed and help bring the privileged classes down. Dr. Stockmann comes into the office and tells them to print the article, but at this moment the whole office has a change of heart and are questioning how valuable is it really to expose the government and the town's baths in this way. They are realizing that printing this article will do more damage than help with the situation. Instead the paper is now on the side of the mayor, and has decided to print a statement of him talking about the baths and how good they are. Out of desperation, Dr. Stockmann decides that he doesn't need the paper to print anything and that he can fight this battle on his own. Dr. Stockmann decides to call a town meeting and spread the information that way. Mrs. Stockmann is present during all of this, and although she knows that her husband is making an extreme decision and is risking his reputation, she stands by his side.\n\nAt the town meeting in Captain Horster's house, Dr. Stockmann is about to read his water report to the townspeople. Billing, the family, the mayor, Aslaksen, and Hovstad are there. Aslaksen is elected the chair of the meeting to serve as a mediator. What ends up happening is that Aslaksen is trying to sabotage the doctor and stop him from communicating the report. When Stockmann finally gets a chance to speak, he talks about the contamination of the water but also gets into the town leaders and how they are the ones who know what is going on. He talks to the town about education and corruption too. The town feels insulted by these accusations and anger starts growing in the room. By the end of the meeting the town has rebelled as a mob against Dr. Stockmann and have marked him as an enemy of the people. Dr. Stockmann is exiled from the town.\n\nIt is the morning after at Dr. Stockmann's study. The windows of the house have been smashed. The town has turned against the family, and no one they know will help them. The landlord is evicting them from the house, and Petra got fired from school for having progressive opinions. Peter comes to the house to present Dr. Stockmann with a letter from the board of directors of the baths terminating his contract and a resolution from the householders association stating that no one should hire Dr. Stockmann in this town again.\nOn the other hand, Morten Kiil just bought an interest in the bath business. He expects that because his tannery is causing all the contamination, his son in law Dr. Stockmann will back off and let the issue go because now his family's money is also at jeopardy if he continues this battle. Dr. Stockmann refuses Morten Kiil's suggestions, and also ignores Peter's advice of leaving town for a few months. Dr. Stockmann has alienated everyone but stays true to his principles, even though he is standing alone. Dr. Stockmann knows that his family will always be by his side, and decides to accept his fate and become \"the enemy of the people\" if that is what it takes to do what is right.\n\n", "full_text": "AN ENEMY OF THE PEOPLE\n\n\nby\n\nHenrik Ibsen\n\n\n\nTranslated by R. Farquharson Sharp\n\n\n\n\nAN ENEMY OF THE PEOPLE\n\nA play in five acts\n\nDRAMATIS PERSONAE\n\n  Dr. Thomas Stockmann, Medical Officer of the Municipal Baths.\n  Mrs. Stockmann, his wife.\n  Petra (their daughter) a teacher.\n  Ejlif & Morten (their sons, aged 13 and 10 respectively).\n  Peter Stockmann (the Doctor's elder brother), Mayor of the\n  Town and Chief Constable, Chairman of the Baths' Committee, etc.\n  Morten Kiil, a tanner (Mrs. Stockmann's adoptive father).\n  Hovstad, editor of the \"People's Messenger.\"\n  Billing, sub-editor.\n  Captain Horster.\n  Aslaksen, a printer.\n\nMen of various conditions and occupations, a few women, and a troop of\nschoolboys--the audience at a public meeting.\n\nThe action takes place in a coastal town in southern Norway,\n\n\n\n\nAN ENEMY OF THE PEOPLE\n\n\n\n\nACT I\n\n\n(SCENE.--DR. STOCKMANN'S sitting-room. It is evening. The room is\nplainly but neatly appointed and furnished. In the right-hand wall are\ntwo doors; the farther leads out to the hall, the nearer to the\ndoctor's study. In the left-hand wall, opposite the door leading to the\nhall, is a door leading to the other rooms occupied by the family. In\nthe middle of the same wall stands the stove, and, further forward, a\ncouch with a looking-glass hanging over it and an oval table in front\nof it. On the table, a lighted lamp, with a lampshade. At the back of\nthe room, an open door leads to the dining-room. BILLING is seen\nsitting at the dining table, on which a lamp is burning. He has a\nnapkin tucked under his chin, and MRS. STOCKMANN is standing by the\ntable handing him a large plate-full of roast beef. The other places at\nthe table are empty, and the table somewhat in disorder, evidently a\nmeal having recently been finished.)\n\nMrs. Stockmann. You see, if you come an hour late, Mr. Billing, you\nhave to put up with cold meat.\n\nBilling (as he eats). It is uncommonly good, thank you--remarkably good.\n\nMrs. Stockmann. My husband makes such a point of having his meals\npunctually, you know.\n\nBilling. That doesn't affect me a bit. Indeed, I almost think I enjoy a\nmeal all the better when I can sit down and eat all by myself, and\nundisturbed.\n\nMrs. Stockmann. Oh well, as long as you are enjoying it--. (Turns to\nthe hall door, listening.) I expect that is Mr. Hovstad coming too.\n\nBilling. Very likely.\n\n(PETER STOCKMANN comes in. He wears an overcoat and his official hat,\nand carries a stick.)\n\nPeter Stockmann. Good evening, Katherine.\n\nMrs. Stockmann (coming forward into the sitting-room). Ah, good\nevening--is it you? How good of you to come up and see us!\n\nPeter Stockmann. I happened to be passing, and so--(looks into the\ndining-room). But you have company with you, I see.\n\nMrs. Stockmann (a little embarrassed). Oh, no--it was quite by chance\nhe came in. (Hurriedly.) Won't you come in and have something, too?\n\nPeter Stockmann. I! No, thank you. Good gracious--hot meat at night!\nNot with my digestion.\n\nMrs. Stockmann. Oh, but just once in a way--\n\nPeter Stockmann. No, no, my dear lady; I stick to my tea and bread and\nbutter. It is much more wholesome in the long run--and a little more\neconomical, too.\n\nMrs. Stockmann (smiling). Now you mustn't think that Thomas and I are\nspendthrifts.\n\nPeter Stockmann. Not you, my dear; I would never think that of you.\n(Points to the Doctor's study.) Is he not at home?\n\nMrs. Stockmann. No, he went out for a little turn after supper--he and\nthe boys.\n\nPeter Stockmann. I doubt if that is a wise thing to do. (Listens.) I\nfancy I hear him coming now.\n\nMrs. Stockmann. No, I don't think it is he. (A knock is heard at the\ndoor.) Come in! (HOVSTAD comes in from the hall.) Oh, it is you, Mr.\nHovstad!\n\nHovstad. Yes, I hope you will forgive me, but I was delayed at the\nprinters. Good evening, Mr. Mayor.\n\nPeter Stockmann (bowing a little distantly). Good evening. You have\ncome on business, no doubt.\n\nHovstad. Partly. It's about an article for the paper.\n\nPeter Stockmann. So I imagined. I hear my brother has become a prolific\ncontributor to the \"People's Messenger.\"\n\nHovstad. Yes, he is good enough to write in the \"People's Messenger\"\nwhen he has any home truths to tell.\n\nMrs. Stockmann (to HOVSTAD). But won't you--? (Points to the\ndining-room.)\n\nPeter Stockmann. Quite so, quite so. I don't blame him in the least, as\na writer, for addressing himself to the quarters where he will find the\nreadiest sympathy. And, besides that, I personally have no reason to\nbear any ill will to your paper, Mr. Hovstad.\n\nHovstad. I quite agree with you.\n\nPeter Stockmann. Taking one thing with another, there is an excellent\nspirit of toleration in the town--an admirable municipal spirit. And it\nall springs from the fact of our having a great common interest to\nunite us--an interest that is in an equally high degree the concern of\nevery right-minded citizen.\n\nHovstad. The Baths, yes.\n\nPeter Stockmann. Exactly---our fine, new, handsome Baths. Mark my\nwords, Mr. Hovstad--the Baths will become the focus of our municipal\nlife! Not a doubt of it!\n\nMrs. Stockmann. That is just what Thomas says.\n\nPeter Stockmann. Think how extraordinarily the place has developed\nwithin the last year or two! Money has been flowing in, and there is\nsome life and some business doing in the town. Houses and landed\nproperty are rising in value every day.\n\nHovstad. And unemployment is diminishing,\n\nPeter Stockmann. Yes, that is another thing. The burden on the poor\nrates has been lightened, to the great relief of the propertied\nclasses; and that relief will be even greater if only we get a really\ngood summer this year, and lots of visitors--plenty of invalids, who\nwill make the Baths talked about.\n\nHovstad. And there is a good prospect of that, I hear.\n\nPeter Stockmann. It looks very promising. Inquiries about apartments\nand that sort of thing are reaching us, every day.\n\nHovstad. Well, the doctor's article will come in very suitably.\n\nPeter Stockmann. Has he been writing something just lately?\n\nHovstad. This is something he wrote in the winter; a recommendation of\nthe Baths--an account of the excellent sanitary conditions here. But I\nheld the article over, temporarily.\n\nPeter Stockmann. Ah,--some little difficulty about it, I suppose?\n\nHovstad. No, not at all; I thought it would be better to wait until the\nspring, because it is just at this time that people begin to think\nseriously about their summer quarters.\n\nPeter Stockmann. Quite right; you were perfectly right, Mr. Hovstad.\n\nHovstad. Yes, Thomas is really indefatigable when it is a question of\nthe Baths.\n\nPeter Stockmann. Well remember, he is the Medical Officer to the Baths.\n\nHovstad. Yes, and what is more, they owe their existence to him.\n\nPeter Stockmann. To him? Indeed! It is true I have heard from time to\ntime that some people are of that opinion. At the same time I must say\nI imagined that I took a modest part in the enterprise.\n\nMrs. Stockmann. Yes, that is what Thomas is always saying.\n\nHovstad. But who denies it, Mr. Stockmann? You set the thing going and\nmade a practical concern of it; we all know that. I only meant that the\nidea of it came first from the doctor.\n\nPeter Stockmann. Oh, ideas yes! My brother has had plenty of them in\nhis time--unfortunately. But when it is a question of putting an idea\ninto practical shape, you have to apply to a man of different mettle.\nMr. Hovstad. And I certainly should have thought that in this house at\nleast...\n\nMrs. Stockmann. My dear Peter--\n\nHovstad. How can you think that--?\n\nMrs. Stockmann. Won't you go in and have something, Mr. Hovstad? My\nhusband is sure to be back directly.\n\nHovstad. Thank you, perhaps just a morsel. (Goes into the dining-room.)\n\nPeter Stockmann (lowering his voice a little). It is a curious thing\nthat these farmers' sons never seem to lose their want of tact.\n\nMrs. Stockmann. Surely it is not worth bothering about! Cannot you and\nThomas share the credit as brothers?\n\nPeter Stockmann. I should have thought so; but apparently some people\nare not satisfied with a share.\n\nMrs. Stockmann. What nonsense! You and Thomas get on so capitally\ntogether. (Listens.) There he is at last, I think. (Goes out and opens\nthe door leading to the hall.)\n\nDr. Stockmann (laughing and talking outside). Look here--here is\nanother guest for you, Katherine. Isn't that jolly! Come in, Captain\nHorster; hang your coat up on this peg. Ah, you don't wear an overcoat.\nJust think, Katherine; I met him in the street and could hardly\npersuade him to come up! (CAPTAIN HORSTER comes into the room and\ngreets MRS. STOCKMANN. He is followed by DR. STOCKMANN.) Come along in,\nboys. They are ravenously hungry again, you know. Come along, Captain\nHorster; you must have a slice of beef. (Pushes HORSTER into the\ndining-room. EJLIF and MORTEN go in after them.)\n\nMrs. Stockmann. But, Thomas, don't you see--?\n\nDr. Stockmann (turning in the doorway). Oh, is it you, Peter? (Shakes\nhands with him.) Now that is very delightful.\n\nPeter Stockmann. Unfortunately I must go in a moment--\n\nDr. Stockmann. Rubbish! There is some toddy just coming in. You haven't\nforgotten the toddy, Katherine?\n\nMrs. Stockmann. Of course not; the water is boiling now. (Goes into the\ndining-room.)\n\nPeter Stockmann. Toddy too!\n\nDr. Stockmann. Yes, sit down and we will have it comfortably.\n\nPeter Stockmann. Thanks, I never care about an evening's drinking.\n\nDr. Stockmann. But this isn't an evening's drinking.\n\nPeter Stockmann. It seems to me--. (Looks towards the dining-room.) It\nis extraordinary how they can put away all that food.\n\nDr. Stockmann (rubbing his hands). Yes, isn't it splendid to see young\npeople eat? They have always got an appetite, you know! That's as it\nshould be. Lots of food--to build up their strength! They are the\npeople who are going to stir up the fermenting forces of the future,\nPeter.\n\nPeter Stockmann. May I ask what they will find here to \"stir up,\" as\nyou put it?\n\nDr. Stockmann. Ah, you must ask the young people that--when the times\ncomes. We shan't be able to see it, of course. That stands to\nreason--two old fogies, like us.\n\nPeter Stockmann. Really, really! I must say that is an extremely odd\nexpression to--\n\nDr. Stockmann. Oh, you mustn't take me too literally, Peter. I am so\nheartily happy and contented, you know. I think it is such an\nextraordinary piece of good fortune to be in the middle of all this\ngrowing, germinating life. It is a splendid time to live in! It is as\nif a whole new world were being created around one.\n\nPeter Stockmann. Do you really think so?\n\nDr. Stockmann. Ah, naturally you can't appreciate it as keenly as I.\nYou have lived all your life in these surroundings, and your\nimpressions have been blunted. But I, who have been buried all these\nyears in my little corner up north, almost without ever seeing a\nstranger who might bring new ideas with him--well, in my case it has\njust the same effect as if I had been transported into the middle of a\ncrowded city.\n\nPeter Stockmann. Oh, a city--!\n\nDr. Stockmann. I know, I know; it is all cramped enough here, compared\nwith many other places. But there is life here--there is promise--there\nare innumerable things to work for and fight for; and that is the main\nthing. (Calls.) Katherine, hasn't the postman been here?\n\nMrs. Stockmann (from the dining-room). No.\n\nDr. Stockmann. And then to be comfortably off, Peter! That is something\none learns to value, when one has been on the brink of starvation, as\nwe have.\n\nPeter Stockmann. Oh, surely--\n\nDr. Stockmann. Indeed I can assure you we have often been very hard put\nto it, up there. And now to be able to live like a lord! Today, for\ninstance, we had roast beef for dinner--and, what is more, for supper\ntoo. Won't you come and have a little bit? Or let me show it you, at\nany rate? Come here--\n\nPeter Stockmann. No, no--not for worlds!\n\nDr. Stockmann. Well, but just come here then. Do you see, we have got a\ntable-cover?\n\nPeter Stockmann. Yes, I noticed it.\n\nDr. Stockmann. And we have got a lamp-shade too. Do you see? All out of\nKatherine's savings! It makes the room so cosy. Don't you think so?\nJust stand here for a moment--no, no, not there--just here, that's it!\nLook now, when you get the light on it altogether. I really think it\nlooks very nice, doesn't it?\n\nPeter Stockmann. Oh, if you can afford luxuries of this kind--\n\nDr. Stockmann. Yes, I can afford it now. Katherine tells me I earn\nalmost as much as we spend.\n\nPeter Stockmann. Almost--yes!\n\nDr. Stockmann. But a scientific man must live in a little bit of style.\nI am quite sure an ordinary civil servant spends more in a year than I\ndo.\n\nPeter Stockmann. I daresay. A civil servant--a man in a well-paid\nposition...\n\nDr. Stockmann. Well, any ordinary merchant, then! A man in that\nposition spends two or three times as much as--\n\nPeter Stockmann. It just depends on circumstances.\n\nDr. Stockmann. At all events I assure you I don't waste money\nunprofitably. But I can't find it in my heart to deny myself the\npleasure of entertaining my friends. I need that sort of thing, you\nknow. I have lived for so long shut out of it all, that it is a\nnecessity of life to me to mix with young, eager, ambitious men, men of\nliberal and active minds; and that describes every one of those fellows\nwho are enjoying their supper in there. I wish you knew more of Hovstad.\n\nPeter Stockmann. By the way, Hovstad was telling me he was going to\nprint another article of yours.\n\nDr. Stockmann. An article of mine?\n\nPeter Stockmann. Yes, about the Baths. An article you wrote in the\nwinter.\n\nDr. Stockmann. Oh, that one! No, I don't intend that to appear just for\nthe present.\n\nPeter Stockmann. Why not? It seems to me that this would be the most\nopportune moment.\n\nDr. Stockmann. Yes, very likely--under normal conditions. (Crosses the\nroom.)\n\nPeter Stockmann (following him with his eyes). Is there anything\nabnormal about the present conditions?\n\nDr. Stockmann (standing still). To tell you the truth, Peter, I can't\nsay just at this moment--at all events not tonight. There may be much\nthat is very abnormal about the present conditions--and it is possible\nthere may be nothing abnormal about them at all. It is quite possible\nit may be merely my imagination.\n\nPeter Stockmann. I must say it all sounds most mysterious. Is there\nsomething going on that I am to be kept in ignorance of? I should have\nimagined that I, as Chairman of the governing body of the Baths--\n\nDr. Stockmann. And I should have imagined that I--. Oh, come, don't let\nus fly out at one another, Peter.\n\nPeter Stockmann. Heaven forbid! I am not in the habit of flying out at\npeople, as you call it. But I am entitled to request most emphatically\nthat all arrangements shall be made in a businesslike manner, through\nthe proper channels, and shall be dealt with by the legally constituted\nauthorities. I can allow no going behind our backs by any roundabout\nmeans.\n\nDr. Stockmann. Have I ever at any time tried to go behind your backs?\n\nPeter Stockmann. You have an ingrained tendency to take your own way,\nat all events; and, that is almost equally inadmissible in a well\nordered community, The individual ought undoubtedly to acquiesce in\nsubordinating himself to the community--or, to speak more accurately,\nto the authorities who have the care of the community's welfare.\n\nDr. Stockmann. Very likely. But what the deuce has all this got to do\nwith me?\n\nPeter Stockmann. That is exactly what you never appear to be willing to\nlearn, my dear Thomas. But, mark my words, some day you will have to\nsuffer for it--sooner or later. Now I have told you. Good-bye.\n\nDr. Stockmann. Have you taken leave of your senses? You are on the\nwrong scent altogether.\n\nPeter Stockmann. I am not usually that. You must excuse me now if I--\n(calls into the dining-room). Good night, Katherine. Good night,\ngentlemen. (Goes out.)\n\nMrs. Stockmann (coming from the dining-room). Has he gone?\n\nDr. Stockmann. Yes, and in such a bad temper.\n\nMrs. Stockmann. But, dear Thomas, what have you been doing to him again?\n\nDr. Stockmann. Nothing at all. And, anyhow, he can't oblige me to make\nmy report before the proper time.\n\nMrs. Stockmann. What have you got to make a report to him about?\n\nDr. Stockmann. Hm! Leave that to me, Katherine. It is an extraordinary\nthing that the postman doesn't come.\n\n(HOVSTAD, BILLING and HORSTER have got up from the table and come into\nthe sitting-room. EJLIF and MORTEN come in after them.)\n\nBilling (stretching himself). Ah!--one feels a new man after a meal\nlike that.\n\nHovstad. The mayor wasn't in a very sweet temper tonight, then.\n\nDr. Stockmann. It is his stomach; he has wretched digestion.\n\nHovstad. I rather think it was us two of the \"People's Messenger\" that\nhe couldn't digest.\n\nMrs. Stockmann. I thought you came out of it pretty well with him.\n\nHovstad. Oh yes; but it isn't anything more than a sort of truce.\n\nBilling. That is just what it is! That word sums up the situation.\n\nDr. Stockmann. We must remember that Peter is a lonely man, poor chap.\nHe has no home comforts of any kind; nothing but everlasting business.\nAnd all that infernal weak tea wash that he pours into himself! Now\nthen, my boys, bring chairs up to the table. Aren't we going to have\nthat toddy, Katherine?\n\nMrs. Stockmann (going into the dining-room). I am just getting it.\n\nDr. Stockmann. Sit down here on the couch beside me, Captain Horster.\nWe so seldom see you. Please sit down, my friends. (They sit down at\nthe table. MRS. STOCKMANN brings a tray, with a spirit-lamp, glasses,\nbottles, etc., upon it.)\n\nMrs. Stockmann. There you are! This is arrack, and this is rum, and\nthis one is the brandy. Now every one must help themselves.\n\nDr. Stockmann (taking a glass). We will. (They all mix themselves some\ntoddy.) And let us have the cigars. Ejlif, you know where the box is.\nAnd you, Morten, can fetch my pipe. (The two boys go into the room on\nthe right.) I have a suspicion that Ejlif pockets a cigar now and\nthen!--but I take no notice of it. (Calls out.) And my smoking-cap too,\nMorten. Katherine, you can tell him where I left it. Ah, he has got it.\n(The boys bring the various things.) Now, my friends. I stick to my\npipe, you know. This one has seen plenty of bad weather with me up\nnorth. (Touches glasses with them.) Your good health! Ah, it is good to\nbe sitting snug and warm here.\n\nMrs. Stockmann (who sits knitting). Do you sail soon, Captain Horster?\n\nHorster. I expect to be ready to sail next week.\n\nMrs. Stockmann. I suppose you are going to America?\n\nHorster. Yes, that is the plan.\n\nMrs. Stockmann. Then you won't be able to take part in the coming\nelection?\n\nHorster. Is there going to be an election?\n\nBilling. Didn't you know?\n\nHorster. No, I don't mix myself up with those things.\n\nBilling. But do you not take an interest in public affairs?\n\nHorster. No, I don't know anything about politics.\n\nBilling. All the same, one ought to vote, at any rate.\n\nHorster. Even if one doesn't know anything about what is going on?\n\nBilling. Doesn't know! What do you mean by that? A community is like a\nship; everyone ought to be prepared to take the helm.\n\nHorster. Maybe that is all very well on shore; but on board ship it\nwouldn't work.\n\nHovstad. It is astonishing how little most sailors care about what goes\non on shore.\n\nBilling. Very extraordinary.\n\nDr. Stockmann. Sailors are like birds of passage; they feel equally at\nhome in any latitude. And that is only an additional reason for our\nbeing all the more keen, Hovstad. Is there to be anything of public\ninterest in tomorrow's \"Messenger\"?\n\nHovstad. Nothing about municipal affairs. But the day after tomorrow I\nwas thinking of printing your article--\n\nDr. Stockmann. Ah, devil take it--my article! Look here, that must wait\na bit.\n\nHovstad. Really? We had just got convenient space for it, and I thought\nit was just the opportune moment--\n\nDr. Stockmann. Yes, yes, very likely you are right; but it must wait\nall the same. I will explain to you later. (PETRA comes in from the\nhall, in hat and cloak and with a bundle of exercise books under her\narm.)\n\nPetra. Good evening.\n\nDr. Stockmann. Good evening, Petra; come along.\n\n(Mutual greetings; PETRA takes off her things and puts them down on a\nchair by the door.)\n\nPetra. And you have all been sitting here enjoying yourselves, while I\nhave been out slaving!\n\nDr. Stockmann. Well, come and enjoy yourself too!\n\nBilling. May I mix a glass for you?\n\nPetra (coming to the table). Thanks, I would rather do it; you always\nmix it too strong. But I forgot, father--I have a letter for you. (Goes\nto the chair where she has laid her things.)\n\nDr. Stockmann. A letter? From whom?\n\nPetra (looking in her coat pocket). The postman gave it to me just as I\nwas going out.\n\nDr. Stockmann (getting up and going to her). And you only give to me\nnow!\n\nPetra. I really had not time to run up again. There it is!\n\nDr. Stockmann (seizing the letter). Let's see, let's see, child! (Looks\nat the address.) Yes, that's all right!\n\nMrs. Stockmann. Is it the one you have been expecting go anxiously,\nThomas?\n\nDr. Stockmann. Yes, it is. I must go to my room now and-- Where shall I\nget a light, Katherine? Is there no lamp in my room again?\n\nMrs. Stockmann. Yes, your lamp is already lit on your desk.\n\nDr. Stockmann. Good, good. Excuse me for a moment--, (Goes into his\nstudy.)\n\nPetra. What do you suppose it is, mother?\n\nMrs. Stockmann. I don't know; for the last day or two he has always\nbeen asking if the postman has not been.\n\nBilling. Probably some country patient.\n\nPetra. Poor old dad!--he will overwork himself soon. (Mixes a glass for\nherself.) There, that will taste good!\n\nHovstad. Have you been teaching in the evening school again today?\n\nPetra (sipping from her glass). Two hours.\n\nBilling. And four hours of school in the morning?\n\nPetra. Five hours.\n\nMrs. Stockmann. And you have still got exercises to correct, I see.\n\nPetra. A whole heap, yes.\n\nHorster. You are pretty full up with work too, it seems to me.\n\nPetra. Yes--but that is good. One is so delightfully tired after it.\n\nBilling. Do you like that?\n\nPetra. Yes, because one sleeps so well then.\n\nMorten. You must be dreadfully wicked, Petra.\n\nPetra. Wicked?\n\nMorten. Yes, because you work so much. Mr. Rorlund says work is a\npunishment for our sins.\n\nEjlif. Pooh, what a duffer, you are, to believe a thing like that!\n\nMrs. Stockmann. Come, come, Ejlif!\n\nBilling (laughing). That's capital!\n\nHovstad. Don't you want to work as hard as that, Morten?\n\nMorten. No, indeed I don't.\n\nHovstad. What do you want to be, then?\n\nMorten. I should like best to be a Viking,\n\nEjlif. You would have to be a pagan then.\n\nMorten. Well, I could become a pagan, couldn't I?\n\nBilling. I agree with you, Morten! My sentiments, exactly.\n\nMrs. Stockmann (signalling to him). I am sure that is not true, Mr.\nBilling.\n\nBilling. Yes, I swear it is! I am a pagan, and I am proud of it.\nBelieve me, before long we shall all be pagans.\n\nMorten. And then shall be allowed to do anything we like?\n\nBilling. Well, you'll see, Morten.\n\nMrs. Stockmann. You must go to your room now, boys; I am sure you have\nsome lessons to learn for tomorrow.\n\nEjlif. I should like so much to stay a little longer--\n\nMrs. Stockmann. No, no; away you go, both of you, (The boys say good\nnight and go into the room on the left.)\n\nHovstad. Do you really think it can do the boys any harm to hear such\nthings?\n\nMrs. Stockmann. I don't know; but I don't like it.\n\nPetra. But you know, mother, I think you really are wrong about it.\n\nMrs. Stockmann. Maybe, but I don't like it--not in our own home.\n\nPetra. There is so much falsehood both at home and at school. At home\none must not speak, and at school we have to stand and tell lies to the\nchildren.\n\nHorster. Tell lies?\n\nPetra. Yes, don't you suppose we have to teach them all sorts of things\nthat we don't believe?\n\nBilling. That is perfectly true.\n\nPetra. If only I had the means, I would start a school of my own; and\nit would be conducted on very different lines.\n\nBilling. Oh, bother the means--!\n\nHorster. Well if you are thinking of that, Miss Stockmann, I shall be\ndelighted to provide you with a schoolroom. The great big old house my\nfather left me is standing almost empty; there is an immense\ndining-room downstairs--\n\nPetra (laughing). Thank you very much; but I am afraid nothing will\ncome of it.\n\nHovstad. No, Miss Petra is much more likely to take to journalism, I\nexpect. By the way, have you had time to do anything with that English\nstory you promised to translate for us?\n\nPetra. No, not yet, but you shall have it in good time.\n\n(DR. STOCKMANN comes in from his room with an open letter in his hand.)\n\nDr. Stockmann (waving the letter). Well, now the town will have\nsomething new to talk about, I can tell you!\n\nBilling. Something new?\n\nMrs. Stockmann. What is this?\n\nDr. Stockmann. A great discovery, Katherine.\n\nHovstad. Really?\n\nMrs. Stockmann. A discovery of yours?\n\nDr. Stockmann. A discovery of mine. (Walks up and down.) Just let them\ncome saying, as usual, that it is all fancy and a crazy man's\nimagination! But they will be careful what they say this time, I can\ntell you!\n\nPetra. But, father, tell us what it is.\n\nDr. Stockmann. Yes, yes--only give me time, and you shall know all\nabout it. If only I had Peter here now! It just shows how we men can go\nabout forming our judgments, when in reality we are as blind as any\nmoles--\n\nHovstad. What are you driving at, Doctor?\n\nDr. Stockmann (standing still by the table). Isn't it the universal\nopinion that our town is a healthy spot?\n\nHovstad. Certainly.\n\nDr. Stockmann. Quite an unusually healthy spot, in fact--a place that\ndeserves to be recommended in the warmest possible manner either for\ninvalids or for people who are well--\n\nMrs. Stockmann. Yes, but my dear Thomas--\n\nDr. Stockmann. And we have been recommending it and praising it--I have\nwritten and written, both in the \"Messenger\" and in pamphlets...\n\nHovstad. Well, what then?\n\nDr. Stockmann. And the Baths--we have called them the \"main artery of\nthe town's life-blood,\" the \"nerve-centre of our town,\" and the devil\nknows what else--\n\nBilling. \"The town's pulsating heart\" was the expression I once used on\nan important occasion.\n\nDr. Stockmann. Quite so. Well, do you know what they really are, these\ngreat, splendid, much praised Baths, that have cost so much money--do\nyou know what they are?\n\nHovstad. No, what are they?\n\nMrs. Stockmann. Yes, what are they?\n\nDr. Stockmann. The whole place is a pest-house!\n\nPetra. The Baths, father?\n\nMrs. Stockmann (at the same time), Our Baths?\n\nHovstad. But, Doctor--\n\nBilling. Absolutely incredible!\n\nDr. Stockmann. The whole Bath establishment is a whited, poisoned\nsepulchre, I tell you--the gravest possible danger to the public\nhealth! All the nastiness up at Molledal, all that stinking filth, is\ninfecting the water in the conduit-pipes leading to the reservoir; and\nthe same cursed, filthy poison oozes out on the shore too--\n\nHorster. Where the bathing-place is?\n\nDr. Stockmann. Just there.\n\nHovstad. How do you come to be so certain of all this, Doctor?\n\nDr. Stockmann. I have investigated the matter most conscientiously. For\na long time past I have suspected something of the kind. Last year we\nhad some very strange cases of illness among the visitors--typhoid\ncases, and cases of gastric fever--\n\nMrs. Stockmann. Yes, that is quite true.\n\nDr. Stockmann. At the time, we supposed the visitors had been infected\nbefore they came; but later on, in the winter, I began to have a\ndifferent opinion; and so I set myself to examine the water, as well as\nI could.\n\nMrs. Stockmann. Then that is what you have been so busy with?\n\nDr. Stockmann. Indeed I have been busy, Katherine. But here I had none\nof the necessary scientific apparatus; so I sent samples, both of the\ndrinking-water and of the sea-water, up to the University, to have an\naccurate analysis made by a chemist.\n\nHovstad. And have you got that?\n\nDr. Stockmann (showing him the letter). Here it is! It proves the\npresence of decomposing organic matter in the water--it is full of\ninfusoria. The water is absolutely dangerous to use, either internally\nor externally.\n\nMrs. Stockmann. What a mercy you discovered it in time.\n\nDr. Stockmann. You may well say so.\n\nHovstad. And what do you propose to do now, Doctor?\n\nDr. Stockmann. To see the matter put right, naturally.\n\nHovstad. Can that be done?\n\nDr. Stockmann. It must be done. Otherwise the Baths will be absolutely\nuseless and wasted. But we need not anticipate that; I have a very\nclear idea what we shall have to do.\n\nMrs. Stockmann. But why have you kept this all so secret, dear?\n\nDr. Stockmann. Do you suppose I was going to run about the town\ngossiping about it, before I had absolute proof? No, thank you. I am\nnot such a fool.\n\nPetra. Still, you might have told us--\n\nDr. Stockmann. Not a living soul. But tomorrow you may run around to\nthe old Badger--\n\nMrs. Stockmann. Oh, Thomas! Thomas!\n\nDr. Stockmann. Well, to your grandfather, then. The old boy will have\nsomething to be astonished at! I know he thinks I am cracked--and there\nare lots of other people who think so too, I have noticed. But now\nthese good folks shall see--they shall just see! (Walks about, rubbing\nhis hands.) There will be a nice upset in the town, Katherine; you\ncan't imagine what it will be. All the conduit-pipes will have to be\nrelaid.\n\nHovstad (getting up). All the conduit-pipes--?\n\nDr. Stockmann. Yes, of course. The intake is too low down; it will have\nto be lifted to a position much higher up.\n\nPetra. Then you were right after all.\n\nDr. Stockmann. Ah, you remember, Petra--I wrote opposing the plans\nbefore the work was begun. But at that time no one would listen to me.\nWell, I am going to let them have it now.  Of course I have prepared a\nreport for the Baths Committee; I have had it ready for a week, and was\nonly waiting for this to come. (Shows the letter.) Now it shall go off\nat once. (Goes into his room and comes back with some papers.) Look at\nthat! Four closely written sheets!--and the letter shall go with them.\nGive me a bit of paper, Katherine--something to wrap them up in. That\nwill do! Now give it to-to-(stamps his foot)--what the deuce is her\nname?--give it to the maid, and tell her to take it at once to the\nMayor.\n\n(Mrs. Stockmann takes the packet and goes out through the dining-room.)\n\nPetra. What do you think Uncle Peter will say, father?\n\nDr. Stockmann. What is there for him to say? I should think he would be\nvery glad that such an important truth has been brought to light.\n\nHovstad. Will you let me print a short note about your discovery in the\n\"Messenger?\"\n\nDr. Stockmann. I shall be very much obliged if you will.\n\nHovstad. It is very desirable that the public should be informed of it\nwithout delay.\n\nDr. Stockmann. Certainly.\n\nMrs. Stockmann (coming back). She has just gone with it.\n\nBilling. Upon my soul, Doctor, you are going to be the foremost man in\nthe town!\n\n Dr. Stockmann (walking about happily). Nonsense! As a matter of\nfact I have done nothing more than my duty. I have only made a lucky\nfind--that's all. Still, all the same...\n\nBilling. Hovstad, don't you think the town ought to give Dr. Stockmann\nsome sort of testimonial?\n\nHovstad. I will suggest it, anyway.\n\nBilling. And I will speak to Aslaksen about it.\n\nDr. Stockmann. No, my good friends, don't let us have any of that\nnonsense. I won't hear anything of the kind. And if the Baths Committee\nshould think of voting me an increase of salary, I will not accept it.\nDo you hear, Katherine?--I won't accept it.\n\nMrs. Stockmann. You are quite right, Thomas.\n\nPetra (lifting her glass). Your health, father!\n\nHovstad and Billing. Your health, Doctor! Good health!\n\nHorster (touches glasses with DR. STOCKMANN). I hope it will bring you\nnothing but good luck.\n\nDr. Stockmann. Thank you, thank you, my dear fellows! I feel\ntremendously happy! It is a splendid thing for a man to be able to feel\nthat he has done a service to his native town and to his\nfellow-citizens. Hurrah, Katherine! (He puts his arms round her and\nwhirls her round and round, while she protests with laughing cries.\nThey all laugh, clap their hands, and cheer the DOCTOR. The boys put\ntheir heads in at the door to see what is going on.)\n\n\n\n\nACT II\n\n\n(SCENE,--The same. The door into the dining room is shut. It is\nmorning. MRS. STOCKMANN, with a sealed letter in her hand, comes in\nfrom the dining room, goes to the door of the DOCTOR'S study, and peeps\nin.)\n\nMrs. Stockmann. Are you in, Thomas?\n\nDr. Stockmann (from within his room). Yes, I have just come in. (Comes\ninto the room.) What is it?\n\nMrs. Stockmann. A letter from your brother.\n\nDr. Stockmann. Aha, let us see! (Opens the letter and reads:) \"I return\nherewith the manuscript you sent me\" (reads on in a low murmur) H'm!--\n\nMrs. Stockmann. What does he say?\n\nDr. Stockmann (putting the papers in his pocket). Oh, he only writes\nthat he will come up here himself about midday.\n\nMrs. Stockmann. Well, try and remember to be at home this time.\n\nDr. Stockmann. That will be all right; I have got through all my\nmorning visits.\n\nMrs. Stockmann. I am extremely curious to know how he takes it.\n\nDr. Stockmann. You will see he won't like it's having been I, and not\nhe, that made the discovery.\n\nMrs. Stockmann. Aren't you a little nervous about that?\n\nDr. Stockmann. Oh, he really will be pleased enough, you know. But, at\nthe same time, Peter is so confoundedly afraid of anyone's doing any\nservice to the town except himself.\n\nMrs. Stockmann. I will tell you what, Thomas--you should be good\nnatured, and share the credit of this with him. Couldn't you make out\nthat it was he who set you on the scent of this discovery?\n\nDr. Stockmann. I am quite willing. If only I can get the thing set\nright. I--\n\n(MORTEN KIIL puts his head in through the door leading from the hall,\nlooks around in an enquiring manner, and chuckles.)\n\nMorten Kiil (slyly). Is it--is it true?\n\nMrs. Stockmann (going to the door). Father!--is it you?\n\nDr. Stockmann. Ah, Mr. Kiil--good morning, good morning!\n\nMrs. Stockmann. But come along in.\n\nMorten Kiil. If it is true, I will; if not, I am off.\n\nDr. Stockmann. If what is true?\n\nMorten Kiil. This tale about the water supply, is it true?\n\nDr. Stockmann. Certainly it is true, but how did you come to hear it?\n\nMorten Kid (coming in). Petra ran in on her way to the school--\n\nDr. Stockmann. Did she?\n\nMorten Kiil. Yes; and she declares that--I thought she was only making\na fool of me--but it isn't like Petra to do that.\n\nDr. Stockmann. Of course not. How could you imagine such a thing!\n\nMorten Kiil. Oh well, it is better never to trust anybody; you may find\nyou have been made a fool of before you know where you are. But it is\nreally true, all the same?\n\nDr. Stockmann. You can depend upon it that it is true. Won't you sit\ndown? (Settles him on the couch.) Isn't it a real bit of luck for the\ntown--\n\nMorten Kiil (suppressing his laughter). A bit of luck for the town?\n\nDr. Stockmann. Yes, that I made the discovery in good time.\n\nMorten Kiil (as before). Yes, yes, Yes!--But I should never have\nthought you the sort of man to pull your own brother's leg like this!\n\nDr. Stockmann. Pull his leg!\n\nMrs. Stockmann. Really, father dear--\n\nMorten Kiil (resting his hands and his chin on the handle of his stick\nand winking slyly at the DOCTOR). Let me see, what was the story? Some\nkind of beast that had got into the water-pipes, wasn't it?\n\nDr. Stockmann. Infusoria--yes.\n\nMorten Kiil. And a lot of these beasts had got in, according to\nPetra--a tremendous lot.\n\nDr. Stockmann. Certainly; hundreds of thousands of them, probably.\n\nMorten Kiil. But no one can see them--isn't that so?\n\nDr. Stockmann. Yes; you can't see them,\n\nMorten Kiil (with a quiet chuckle). Damn--it's the finest story I have\never heard!\n\nDr. Stockmann. What do you mean?\n\nMorten Kiil. But you will never get the Mayor to believe a thing like\nthat.\n\nDr. Stockmann. We shall see.\n\nMorten Kiil. Do you think he will be fool enough to--?\n\nDr. Stockmann. I hope the whole town will be fools enough.\n\nMorten Kiil. The whole town! Well, it wouldn't be a bad thing. It would\njust serve them right, and teach them a lesson. They think themselves\nso much cleverer than we old fellows. They hounded me out of the\ncouncil; they did, I tell you--they hounded me out. Now they shall pay\nfor it. You pull their legs too, Thomas!\n\nDr. Stockmann. Really, I--\n\nMorten Kiil. You pull their legs! (Gets up.) If you can work it so that\nthe Mayor and his friends all swallow the same bait, I will give ten\npounds to a charity--like a shot!\n\nDr. Stockmann. That is very kind of you.\n\nMorten Kiil. Yes, I haven't got much money to throw away, I can tell\nyou; but, if you can work this, I will give five pounds to a charity at\nChristmas.\n\n(HOVSTAD comes in by the hall door.)\n\nHovstad. Good morning! (Stops.) Oh, I beg your pardon\n\nDr. Stockmann. Not at all; come in.\n\nMorten Kiil (with another chuckle). Oho!--is he in this too?\n\nHovstad. What do you mean?\n\nDr. Stockmann. Certainly he is.\n\nMorten Kiil. I might have known it! It must get into the papers. You\nknow how to do it, Thomas! Set your wits to work. Now I must go.\n\nDr. Stockmann. Won't you stay a little while?\n\nMorten Kiil. No, I must be off now. You keep up this game for all it is\nworth; you won't repent it, I'm damned if you will!\n\n(He goes out; MRS. STOCKMANN follows him into the hall.)\n\nDr. Stockmann (laughing). Just imagine--the old chap doesn't believe a\nword of all this about the water supply.\n\nHovstad. Oh that was it, then?\n\nDr. Stockmann. Yes, that was what we were talking about. Perhaps it is\nthe same thing that brings you here?\n\nHovstad. Yes, it is, Can you spare me a few minutes, Doctor?\n\nDr. Stockmann. As long as you like, my dear fellow.\n\nHovstad. Have you heard from the Mayor yet?\n\nDr. Stockmann. Not yet. He is coming here later.\n\nHovstad. I have given the matter a great deal of thought since last\nnight.\n\nDr. Stockmann. Well?\n\nHovstad. From your point of view, as a doctor and a man of science,\nthis affair of the water supply is an isolated matter. I mean, you do\nnot realise that it involves a great many other things.\n\nDr. Stockmann. How, do you mean?--Let us sit down, my dear fellow. No,\nsit here on the couch. (HOVSTAD Sits down on the couch, DR. STOCKMANN\nOn a chair on the other side of the table.) Now then. You mean that--?\n\nHovstad. You said yesterday that the pollution of the water was due to\nimpurities in the soil.\n\nDr. Stockmann. Yes, unquestionably it is due to that poisonous morass\nup at Molledal.\n\nHovstad. Begging your pardon, Doctor, I fancy it is due to quite\nanother morass altogether.\n\nDr. Stockmann. What morass?\n\nHovstad. The morass that the whole life of our town is built on and is\nrotting in.\n\nDr. Stockmann. What the deuce are you driving at, Hovstad?\n\nHovstad. The whole of the town's interests have, little by little, got\ninto the hands of a pack of officials.\n\nDr. Stockmann. Oh, come!--they are not all officials.\n\nHovstad. No, but those that are not officials are at any rate the\nofficials' friends and adherents; it is the wealthy folk, the old\nfamilies in the town, that have got us entirely in their hands.\n\nDr. Stockmann. Yes, but after all they are men of ability and knowledge.\n\nHovstad. Did they show any ability or knowledge when they laid the\nconduit pipes where they are now?\n\nDr. Stockmann. No, of course that was a great piece of stupidity on\ntheir part. But that is going to be set right now.\n\nHovstad. Do you think that will be all such plain sailing?\n\nDr. Stockmann. Plain sailing or no, it has got to be done, anyway.\n\nHovstad. Yes, provided the press takes up the question.\n\nDr. Stockmann. I don't think that will be necessary, my dear fellow, I\nam certain my brother--\n\nHovstad. Excuse me, doctor; I feel bound to tell you I am inclined to\ntake the matter up.\n\nDr. Stockmann. In the paper?\n\nHovstad. Yes. When I took over the \"People's Messenger\" my idea was to\nbreak up this ring of self-opinionated old fossils who had got hold of\nall the influence.\n\nDr. Stockmann. But you know you told me yourself what the result had\nbeen; you nearly ruined your paper.\n\nHovstad. Yes, at the time we were obliged to climb down a peg or two,\nit is quite true--because there was a danger of the whole project of\nthe Baths coming to nothing if they failed us. But now the scheme has\nbeen carried through, and we can dispense with these grand gentlemen.\n\nDr. Stockmann. Dispense with them, yes; but, we owe them a great debt\nof gratitude.\n\nHovstad. That shall be recognised ungrudgingly, But a journalist of my\ndemocratic tendencies cannot let such an opportunity as this slip. The\nbubble of official infallibility must be pricked. This superstition\nmust be destroyed, like any other.\n\nDr. Stockmann. I am whole-heartedly with you in that, Mr. Hovstad; if\nit is a superstition, away with it!\n\nHovstad. I should be very reluctant to bring the Mayor into it, because\nhe is your brother. But I am sure you will agree with me that truth\nshould be the first consideration.\n\nDr. Stockmann. That goes without saying. (With sudden emphasis.) Yes,\nbut--but--\n\nHovstad. You must not misjudge me. I am neither more self-interested\nnor more ambitious than most men.\n\nDr. Stockmann. My dear fellow--who suggests anything of the kind?\n\nHovstad. I am of humble origin, as you know; and that has given me\nopportunities of knowing what is the most crying need in the humbler\nranks of life. It is that they should be allowed some part in the\ndirection of public affairs, Doctor. That is what will develop their\nfaculties and intelligence and self respect--\n\nDr. Stockmann. I quite appreciate that.\n\nHovstad. Yes--and in my opinion a journalist incurs a heavy\nresponsibility if he neglects a favourable opportunity of emancipating\nthe masses--the humble and oppressed. I know well enough that in\nexalted circles I shall be called an agitator, and all that sort of\nthing; but they may call what they like. If only my conscience doesn't\nreproach me, then--\n\nDr. Stockmann. Quite right! Quite right, Mr. Hovstad. But all the\nsame--devil take it! (A knock is heard at the door.) Come in!\n\n(ASLAKSEN appears at the door. He is poorly but decently dressed, in\nblack, with a slightly crumpled white neckcloth; he wears gloves and\nhas a felt hat in his hand.)\n\nAslaksen (bowing). Excuse my taking the liberty, Doctor--\n\nDr. Stockmann (getting up). Ah, it is you, Aslaksen!\n\nAslaksen. Yes, Doctor.\n\nHovstad (standing up). Is it me you want, Aslaksen?\n\nAslaksen. No; I didn't know I should find you here. No, it was the\nDoctor I--\n\nDr. Stockmann. I am quite at your service. What is it?\n\nAslaksen. Is what I heard from Mr. Billing true, sir--that you mean to\nimprove our water supply?\n\nDr. Stockmann. Yes, for the Baths.\n\nAslaksen. Quite so, I understand. Well, I have come to say that I will\nback that up by every means in my power.\n\nHovstad (to the DOCTOR). You see!\n\nDr. Stockmann. I shall be very grateful to you, but--\n\nAslaksen. Because it may be no bad thing to have us small tradesmen at\nyour back. We form, as it were, a compact majority in the town--if we\nchoose. And it is always a good thing to have the majority with you,\nDoctor.\n\nDr. Stockmann. That is undeniably true; but I confess I don't see why\nsuch unusual precautions should be necessary in this case. It seems to\nme that such a plain, straightforward thing.\n\nAslaksen. Oh, it may be very desirable, all the same. I know our local\nauthorities so well; officials are not generally very ready to act on\nproposals that come from other people. That is why I think it would not\nbe at all amiss if we made a little demonstration.\n\nHovstad. That's right.\n\nDr. Stockmann. Demonstration, did you say? What on earth are you going\nto make a demonstration about?\n\nAslaksen. We shall proceed with the greatest moderation, Doctor.\nModeration is always my aim; it is the greatest virtue in a citizen--at\nleast, I think so.\n\nDr. Stockmann. It is well known to be a characteristic of yours, Mr.\nAslaksen.\n\nAslaksen. Yes, I think I may pride myself on that. And this matter of\nthe water supply is of the greatest importance to us small tradesmen.\nThe Baths promise to be a regular gold-mine for the town. We shall all\nmake our living out of them, especially those of us who are\nhouseholders. That is why we will back up the project as strongly as\npossible. And as I am at present Chairman of the Householders'\nAssociation.\n\nDr. Stockmann. Yes--?\n\nAslaksen. And, what is more, local secretary of the Temperance\nSociety--you know, sir, I suppose, that I am a worker in the temperance\ncause?\n\nDr. Stockmann. Of course, of course.\n\nAslaksen. Well, you can understand that I come into contact with a\ngreat many people. And as I have the reputation of a temperate and\nlaw-abiding citizen--like yourself, Doctor--I have a certain influence\nin the town, a little bit of power, if I may be allowed to say so.\n\nDr. Stockmann. I know that quite well, Mr. Aslaksen.\n\nAslaksen. So you see it would be an easy matter for me to set on foot\nsome testimonial, if necessary.\n\nDr. Stockmann. A testimonial?\n\nAslaksen. Yes, some kind of an address of thanks from the townsmen for\nyour share in a matter of such importance to the community. I need\nscarcely say that it would have to be drawn up with the greatest regard\nto moderation, so as not to offend the authorities--who, after all,\nhave the reins in their hands. If we pay strict attention to that, no\none can take it amiss, I should think!\n\nHovstad. Well, and even supposing they didn't like it--\n\nAslaksen. No, no, no; there must be no discourtesy to the authorities,\nMr. Hovstad. It is no use falling foul of those upon whom our welfare\nso closely depends. I have done that in my time, and no good ever comes\nof it. But no one can take exception to a reasonable and frank\nexpression of a citizen's views.\n\nDr. Stockmann (shaking him by the hand). I can't tell you, dear Mr.\nAslaksen, how extremely pleased I am to find such hearty support among\nmy fellow-citizens. I am delighted--delighted! Now, you will take a\nsmall glass of sherry, eh?\n\nAslaksen. No, thank you; I never drink alcohol of that kind.\n\nDr. Stockmann. Well, what do you say to a glass of beer, then?\n\nAslaksen. Nor that either, thank you, Doctor. I never drink anything as\nearly as this. I am going into town now to talk this over with one or\ntwo householders, and prepare the ground.\n\nDr. Stockmann. It is tremendously kind of you, Mr. Aslaksen; but I\nreally cannot understand the necessity for all these precautions. It\nseems to me that the thing should go of itself.\n\nAslaksen. The authorities are somewhat slow to move, Doctor. Far be it\nfrom me to seem to blame them--\n\nHovstad. We are going to stir them up in the paper tomorrow, Aslaksen.\n\nAslaksen. But not violently, I trust, Mr. Hovstad. Proceed with\nmoderation, or you will do nothing with them. You may take my advice; I\nhave gathered my experience in the school of life. Well, I must say\ngoodbye, Doctor. You know now that we small tradesmen are at your back\nat all events, like a solid wall. You have the compact majority on your\nside Doctor.\n\nDr. Stockmann. I am very much obliged, dear Mr. Aslaksen, (Shakes hands\nwith him.) Goodbye, goodbye.\n\nAslaksen. Are you going my way, towards the printing-office. Mr.\nHovstad?\n\nHovstad, I will come later; I have something to settle up first.\n\nAslaksen. Very well. (Bows and goes out; STOCKMANN follows him into the\nhall.)\n\nHovstad (as STOCKMANN comes in again). Well, what do you think of that,\nDoctor? Don't you think it is high time we stirred a little life into\nall this slackness and vacillation and cowardice?\n\nDr. Stockmann. Are you referring to Aslaksen?\n\nHovstad, Yes, I am. He is one of those who are floundering in a\nbog--decent enough fellow though he may be, otherwise. And most of the\npeople here are in just the same case--see-sawing and edging first to\none side and then to the other, so overcome with caution and scruple\nthat they never dare to take any decided step.\n\nDr. Stockmann, Yes, but Aslaksen seemed to me so thoroughly\nwell-intentioned.\n\nHovstad. There is one thing I esteem higher than that; and that is for\na man to be self-reliant and sure of himself.\n\nDr. Stockmann. I think you are perfectly right there.\n\nHovstad. That is why I want to seize this opportunity, and try if I\ncannot manage to put a little virility into these well-intentioned\npeople for once. The idol of Authority must be shattered in this town.\nThis gross and inexcusable blunder about the water supply must be\nbrought home to the mind of every municipal voter.\n\nDr. Stockmann. Very well; if you are of opinion that it is for the good\nof the community, so be it. But not until I have had a talk with my\nbrother.\n\nHovstad. Anyway, I will get a leading article ready; and if the Mayor\nrefuses to take the matter up--\n\nDr. Stockmann. How can you suppose such a thing possible!\n\nHovstad. It is conceivable. And in that case--\n\nDr. Stockmann. In that case I promise you--. Look here, in that case\nyou may print my report--every word of it.\n\nHovstad. May I? Have I your word for it?\n\nDr. Stockmann (giving him the MS.). Here it is; take it with you. It\ncan do no harm for you to read it through, and you can give it me back\nlater on.\n\nHovstad. Good, good! That is what I will do. And now goodbye, Doctor.\n\nDr. Stockmann. Goodbye, goodbye. You will see everything will run quite\nsmoothly, Mr. Hovstad--quite smoothly.\n\nHovstad. Hm!--we shall see. (Bows and goes out.)\n\nDr. Stockmann (opens the dining-room door and looks in). Katherine! Oh,\nyou are back, Petra?\n\nPetra (coming in). Yes, I have just come from the school.\n\nMrs. Stockmann (coming in). Has he not been here yet?\n\nDr. Stockmann. Peter? No, but I have had a long talk with Hovstad. He\nis quite excited about my discovery, I find it has a much wider bearing\nthan I at first imagined. And he has put his paper at my disposal if\nnecessity should arise.\n\nMrs. Stockmann. Do you think it will?\n\nDr. Stockmann. Not for a moment. But at all events it makes me feel\nproud to know that I have the liberal-minded independent press on my\nside. Yes, and just imagine--I have had a visit from the Chairman of\nthe Householders' Association!\n\nMrs. Stockmann. Oh! What did he want?\n\nDr. Stockmann. To offer me his support too. They will support me in a\nbody if it should be necessary. Katherine--do you know what I have got\nbehind me?\n\nMrs. Stockmann. Behind you? No, what have you got behind you?\n\nDr. Stockmann. The compact majority.\n\nMrs. Stockmann. Really? Is that a good thing for you Thomas?\n\nDr. Stockmann. I should think it was a good thing. (Walks up and down\nrubbing his hands.) By Jove, it's a fine thing to feel this bond of\nbrotherhood between oneself and one's fellow citizens!\n\nPetra. And to be able to do so much that is good and useful, father!\n\nDr. Stockmann. And for one's own native town into the bargain, my child!\n\nMrs. Stockmann. That was a ring at the bell.\n\nDr. Stockmann. It must be he, then. (A knock is heard at the door.)\nCome in!\n\nPeter Stockmann (comes in from the hall). Good morning.\n\nDr. Stockmann. Glad to see you, Peter!\n\nMrs. Stockmann. Good morning, Peter, How are you?\n\nPeter Stockmann. So so, thank you. (To DR. STOCKMANN.) I received from\nyou yesterday, after office hours, a report dealing with the condition\nof the water at the Baths.\n\nDr. Stockmann. Yes. Have you read it?\n\nPeter Stockmann. Yes, I have,\n\nDr. Stockmann. And what have you to say to it?\n\nPeter Stockmann (with a sidelong glance). Hm!--\n\nMrs. Stockmann. Come along, Petra. (She and PETRA go into the room on\nthe left.)\n\nPeter Stockmann (after a pause). Was it necessary to make all these\ninvestigations behind my back?\n\nDr. Stockmann. Yes, because until I was absolutely certain about it--\n\nPeter Stockmann. Then you mean that you are absolutely certain now?\n\nDr. Stockmann. Surely you are convinced of that.\n\nPeter Stockmann. Is it your intention to bring this document before the\nBaths Committee as a sort of official communication?\n\nDr. Stockmann. Certainly. Something must be done in the matter--and\nthat quickly.\n\nPeter Stockmann. As usual, you employ violent expressions in your\nreport. You say, amongst other things, that what we offer visitors in\nour Baths is a permanent supply of poison.\n\nDr. Stockmann. Well, can you describe it any other way, Peter? Just\nthink--water that is poisonous, whether you drink it or bathe in it!\nAnd this we offer to the poor sick folk who come to us trustfully and\npay us at an exorbitant rate to be made well again!\n\nPeter Stockmann. And your reasoning leads you to this conclusion, that\nwe must build a sewer to draw off the alleged impurities from Molledal\nand must relay the water conduits.\n\nDr. Stockmann. Yes. Do you see any other way out of it? I don't.\n\nPeter Stockmann. I made a pretext this morning to go and see the town\nengineer, and, as if only half seriously, broached the subject of these\nproposals as a thing we might perhaps have to take under consideration\nsome time later on.\n\nDr. Stockmann. Some time later on!\n\nPeter Stockmann. He smiled at what he considered to be my extravagance,\nnaturally. Have you taken the trouble to consider what your proposed\nalterations would cost? According to the information I obtained, the\nexpenses would probably mount up to fifteen or twenty thousand pounds.\n\nDr. Stockmann. Would it cost so much?\n\nPeter Stockmann. Yes; and the worst part of it would be that the work\nwould take at least two years.\n\nDr. Stockmann. Two years? Two whole years?\n\nPeter Stockmann. At least. And what are we to do with the Baths in the\nmeantime? Close them? Indeed we should be obliged to. And do you\nsuppose anyone would come near the place after it had got out that the\nwater was dangerous?\n\nDr. Stockmann. Yes but, Peter, that is what it is.\n\nPeter Stockmann. And all this at this juncture--just as the Baths are\nbeginning to be known. There are other towns in the neighbourhood with\nqualifications to attract visitors for bathing purposes. Don't you\nsuppose they would immediately strain every nerve to divert the entire\nstream of strangers to themselves? Unquestionably they would; and then\nwhere should we be? We should probably have to abandon the whole thing,\nwhich has cost us so much money-and then you would have ruined your\nnative town.\n\nDr. Stockmann. I--should have ruined--!\n\nPeter Stockmann. It is simply and solely through the Baths that the\ntown has before it any future worth mentioning. You know that just as\nwell as I.\n\nDr. Stockmann. But what do you think ought to be done, then?\n\nPeter Stockmann. Your report has not convinced me that the condition of\nthe water at the Baths is as bad as you represent it to be.\n\nDr. Stockmann. I tell you it is even worse!--or at all events it will\nbe in summer, when the warm weather comes.\n\nPeter Stockmann. As I said, I believe you exaggerate the matter\nconsiderably. A capable physician ought to know what measures to\ntake--he ought to be capable of preventing injurious influences or of\nremedying them if they become obviously persistent.\n\nDr. Stockmann. Well? What more?\n\nPeter Stockmann. The water supply for the Baths is now an established\nfact, and in consequence must be treated as such. But probably the\nCommittee, at its discretion, will not be disinclined to consider the\nquestion of how far it might be possible to introduce certain\nimprovements consistently with a reasonable expenditure.\n\nDr. Stockmann. And do you suppose that I will have anything to do with\nsuch a piece of trickery as that?\n\nPeter Stockmann. Trickery!!\n\nDr. Stockmann. Yes, it would be a trick--a fraud, a lie, a downright\ncrime towards the public, towards the whole community!\n\nPeter Stockmann. I have not, as I remarked before, been able to\nconvince myself that there is actually any imminent danger.\n\nDr. Stockmann. You have! It is impossible that you should not be\nconvinced. I know I have represented the facts absolutely truthfully\nand fairly. And you know it very well, Peter, only you won't\nacknowledge it. It was owing to your action that both the Baths and the\nwater conduits were built where they are; and that is what you won't\nacknowledge--that damnable blunder of yours. Pooh!--do you suppose I\ndon't see through you?\n\nPeter Stockmann. And even if that were true? If I perhaps guard my\nreputation somewhat anxiously, it is in the interests of the town.\nWithout moral authority I am powerless to direct public affairs as\nseems, to my judgment, to be best for the common good. And on that\naccount--and for various other reasons too--it appears to me to be a\nmatter of importance that your report should not be delivered to the\nCommittee. In the interests of the public, you must withhold it. Then,\nlater on, I will raise the question and we will do our best, privately;\nbut, nothing of this unfortunate affair not a single word of it--must\ncome to the ears of the public.\n\nDr. Stockmann. I am afraid you will not be able to prevent that now, my\ndear Peter.\n\nPeter Stockmann. It must and shall be prevented.\n\nDr. Stockmann. It is no use, I tell you. There are too many people that\nknow about it.\n\nPeter Stockmann. That know about it? Who? Surely you don't mean those\nfellows on the \"People's Messenger\"?\n\nDr. Stockmann. Yes, they know. The liberal-minded independent press is\ngoing to see that you do your duty.\n\nPeter Stockmann (after a short pause). You are an extraordinarily\nindependent man, Thomas. Have you given no thought to the consequences\nthis may have for yourself?\n\nDr. Stockmann. Consequences?--for me?\n\nPeter Stockmann. For you and yours, yes.\n\nDr. Stockmann. What the deuce do you mean?\n\nPeter Stockmann. I believe I have always behaved in a brotherly way to\nyou--haven't I always been ready to oblige or to help you?\n\nDr. Stockmann. Yes, you have, and I am grateful to you for it.\n\nPeter Stockmann. There is no need. Indeed, to some extent I was forced\nto do so--for my own sake. I always hoped that, if I helped to improve\nyour financial position, I should be able to keep some check on you.\n\nDr. Stockmann. What! Then it was only for your own sake--!\n\nPeter Stockmann. Up to a certain point, yes. It is painful for a man in\nan official position to have his nearest relative compromising himself\ntime after time.\n\nDr. Stockmann. And do you consider that I do that?\n\nPeter Stockmann. Yes, unfortunately, you do, without even being aware\nof it. You have a restless, pugnacious, rebellious disposition. And\nthen there is that disastrous propensity of yours to want to write\nabout every sort of possible and impossible thing. The moment an idea\ncomes into your head, you must needs go and write a newspaper article\nor a whole pamphlet about it.\n\nDr. Stockmann. Well, but is it not the duty of a citizen to let the\npublic share in any new ideas he may have?\n\nPeter Stockmann. Oh, the public doesn't require any new ideas. The\npublic is best served by the good, old established ideas it already has.\n\nDr. Stockmann. And that is your honest opinion?\n\nPeter Stockmann. Yes, and for once I must talk frankly to you. Hitherto\nI have tried to avoid doing so, because I know how irritable you are;\nbut now I must tell you the truth, Thomas. You have no conception what\nan amount of harm you do yourself by your impetuosity. You complain of\nthe authorities, you even complain of the government--you are always\npulling them to pieces; you insist that you have been neglected and\npersecuted. But what else can such a cantankerous man as you expect?\n\nDr. Stockmann. What next! Cantankerous, am I?\n\nPeter Stockmann. Yes, Thomas, you are an extremely cantankerous man to\nwork with--I know that to my cost. You disregard everything that you\nought to have consideration for. You seem completely to forget that it\nis me you have to thank for your appointment here as medical officer to\nthe Baths.\n\nDr. Stockmann. I was entitled to it as a matter of course!--I and\nnobody else! I was the first person to see that the town could be made\ninto a flourishing watering-place, and I was the only one who saw it at\nthat time. I had to fight single-handed in support of the idea for many\nyears; and I wrote and wrote--\n\nPeter Stockmann. Undoubtedly. But things were not ripe for the scheme\nthen--though, of course, you could not judge of that in your\nout-of-the-way corner up north. But as soon as the opportune moment\ncame I--and the others--took the matter into our hands.\n\nDr. Stockmann. Yes, and made this mess of all my beautiful plan. It is\npretty obvious now what clever fellows you were!\n\nPeter Stockmann. To my mind the whole thing only seems to mean that you\nare seeking another outlet for your combativeness. You want to pick a\nquarrel with your superiors--an old habit of yours. You cannot put up\nwith any authority over you. You look askance at anyone who occupies a\nsuperior official position; you regard him as a personal enemy, and\nthen any stick is good enough to beat him with. But now I have called\nyour attention to the fact that the town's interests are at stake--and,\nincidentally, my own too. And therefore, I must tell you, Thomas, that\nyou will find me inexorable with regard to what I am about to require\nyou to do.\n\nDr. Stockmann. And what is that?\n\nPeter Stockmann. As you have been so indiscreet as to speak of this\ndelicate matter to outsiders, despite the fact that you ought to have\ntreated it as entirely official and confidential, it is obviously\nimpossible to hush it up now. All sorts of rumours will get about\ndirectly, and everybody who has a grudge against us will take care to\nembellish these rumours. So it will be necessary for you to refute them\npublicly.\n\nDr. Stockmann. I! How? I don't understand.\n\nPeter Stockmann. What we shall expect is that, after making further\ninvestigations, you will come to the conclusion that the matter is not\nby any means as dangerous or as critical as you imagined in the first\ninstance.\n\nDr. Stockmann. Oho!--so that is what you expect!\n\nPeter Stockmann. And, what is more, we shall expect you to make public\nprofession of your confidence in the Committee and in their readiness\nto consider fully and conscientiously what steps may be necessary to\nremedy any possible defects.\n\nDr. Stockmann. But you will never be able to do that by patching and\ntinkering at it--never! Take my word for it, Peter; I mean what I say,\nas deliberately and emphatically as possible.\n\nPeter Stockmann. As an officer under the Committee, you have no right\nto any individual opinion.\n\nDr. Stockmann (amazed). No right?\n\nPeter Stockmann. In your official capacity, no. As a private person, it\nis quite another matter. But as a subordinate member of the staff of\nthe Baths, you have no right to express any opinion which runs contrary\nto that of your superiors.\n\nDr. Stockmann. This is too much! I, a doctor, a man of science, have no\nright to--!\n\nPeter Stockmann. The matter in hand is not simply a scientific one. It\nis a complicated matter, and has its economic as well as its technical\nside.\n\nDr. Stockmann. I don't care what it is! I intend to be free to express\nmy opinion on any subject under the sun.\n\nPeter Stockmann. As you please--but not on any subject concerning the\nBaths. That we forbid.\n\nDr. Stockmann (shouting). You forbid--! You! A pack of--\n\nPeter Stockmann.  I forbid it--I, your chief; and if I forbid it, you\nhave to obey.\n\nDr. Stockmann (controlling himself). Peter--if you were not my brother--\n\nPetra (throwing open the door). Father, you shan't stand this!\n\nMrs. Stockmann (coming in after her). Petra, Petra!\n\nPeter Stockmann. Oh, so you have been eavesdropping.\n\nMrs. Stockmann. You were talking so loud, we couldn't help it!\n\nPetra. Yes, I was listening.\n\nPeter Stockmann. Well, after all, I am very glad--\n\nDr. Stockmann (going up to him). You were saying something about\nforbidding and obeying?\n\nPeter Stockmann. You obliged me to take that tone with you.\n\nDr. Stockmann. And so I am to give myself the lie, publicly?\n\nPeter Stockmann. We consider it absolutely necessary that you should\nmake some such public statement as I have asked for.\n\nDr. Stockmann. And if I do not--obey?\n\nPeter Stockmann. Then we shall publish a statement ourselves to\nreassure the public.\n\nDr. Stockmann. Very well; but in that case I shall use my pen against\nyou. I stick to what I have said; I will show that I am right and that\nyou are wrong. And what will you do then?\n\nPeter Stockmann. Then I shall not be able to prevent your being\ndismissed.\n\nDr. Stockmann. What--?\n\nPetra. Father--dismissed!\n\nMrs. Stockmann. Dismissed!\n\nPeter Stockmann. Dismissed from the staff of the Baths. I shall be\nobliged to propose that you shall immediately be given notice, and\nshall not be allowed any further participation in the Baths' affairs.\n\nDr. Stockmann. You would dare to do that!\n\nPeter Stockmann. It is you that are playing the daring game.\n\nPetra. Uncle, that is a shameful way to treat a man like father!\n\nMrs. Stockmann. Do hold your tongue, Petra!\n\nPeter Stockmann (looking at PETRA). Oh, so we volunteer our opinions\nalready, do we? Of course. (To MRS. STOCKMANN.) Katherine, I imagine\nyou are the most sensible person in this house. Use any influence you\nmay have over your husband, and make him see what this will entail for\nhis family as well as--\n\nDr. Stockmann. My family is my own concern and nobody else's!\n\nPeter Stockmann. --for his own family, as I was saying, as well as for\nthe town he lives in.\n\nDr. Stockmann. It is I who have the real good of the town at heart! I\nwant to lay bare the defects that sooner or later must come to the\nlight of day. I will show whether I love my native town.\n\nPeter Stockmann. You, who in your blind obstinacy want to cut off the\nmost important source of the town's welfare?\n\nDr. Stockmann. The source is poisoned, man! Are you mad? We are making\nour living by retailing filth and corruption! The whole of our\nflourishing municipal life derives its sustenance from a lie!\n\nPeter Stockmann. All imagination--or something even worse. The man who\ncan throw out such offensive insinuations about his native town must be\nan enemy to our community.\n\nDr. Stockmann (going up to him). Do you dare to--!\n\nMrs. Stockmann (throwing herself between them). Thomas!\n\nPetra (catching her father by the arm). Don't lose your temper, father!\n\nPeter Stockmann. I will not expose myself to violence. Now you have had\na warning; so reflect on what you owe to yourself and your family.\nGoodbye. (Goes out.)\n\nDr. Stockmann (walking up and down). Am I to put up with such treatment\nas this? In my own house, Katherine! What do you think of that!\n\nMrs. Stockmann. Indeed it is both shameful and absurd, Thomas--\n\nPetra. If only I could give uncle a piece of my mind--\n\nDr. Stockmann. It is my own fault. I ought to have flown out at him\nlong ago!--shown my teeth!--bitten! To hear him call me an enemy to our\ncommunity! Me! I shall not take that lying down, upon my soul!\n\nMrs. Stockmann. But, dear Thomas, your brother has power on his side.\n\nDr. Stockmann. Yes, but I have right on mine, I tell you.\n\nMrs. Stockmann. Oh yes, right--right. What is the use of having right\non your side if you have not got might?\n\nPetra. Oh, mother!--how can you say such a thing!\n\nDr. Stockmann. Do you imagine that in a free country it is no use\nhaving right on your side? You are absurd, Katherine. Besides, haven't\nI got the liberal-minded, independent press to lead the way, and the\ncompact majority behind me? That is might enough, I should think!\n\nMrs. Stockmann. But, good heavens, Thomas, you don't mean to?\n\nDr. Stockmann. Don't mean to what?\n\nMrs. Stockmann. To set yourself up in opposition to your brother.\n\nDr. Stockmann. In God's name, what else do you suppose I should do but\ntake my stand on right and truth?\n\nPetra. Yes, I was just going to say that.\n\nMrs. Stockmann. But it won't do you any earthly good. If they won't do\nit, they won't.\n\nDr. Stockmann. Oho, Katherine! Just give me time, and you will see how\nI will carry the war into their camp.\n\nMrs. Stockmann. Yes, you carry the war into their camp, and you get\nyour dismissal--that is what you will do.\n\nDr. Stockmann. In any case I shall have done my duty towards the\npublic--towards the community, I, who am called its enemy!\n\nMrs. Stockmann. But towards your family, Thomas? Towards your own home!\nDo you think that is doing your duty towards those you have to provide\nfor?\n\nPetra. Ah, don't think always first of us, mother.\n\nMrs. Stockmann. Oh, it is easy for you to talk; you are able to shift\nfor yourself, if need be. But remember the boys, Thomas; and think a\nlittle of yourself too, and of me--\n\nDr. Stockmann. I think you are out of your senses, Katherine! If I were\nto be such a miserable coward as to go on my knees to Peter and his\ndamned crew, do you suppose I should ever know an hour's peace of mind\nall my life afterwards?\n\nMrs. Stockmann. I don't know anything about that; but God preserve us\nfrom the peace of mind we shall have, all the same, if you go on\ndefying him! You will find yourself again without the means of\nsubsistence, with no income to count upon. I should think we had had\nenough of that in the old days. Remember that, Thomas; think what that\nmeans.\n\nDr. Stockmann (collecting himself with a struggle and clenching his\nfists). And this is what this slavery can bring upon a free, honourable\nman! Isn't it horrible, Katherine?\n\nMrs. Stockmann. Yes, it is sinful to treat you so, it is perfectly\ntrue. But, good heavens, one has to put up with so much injustice in\nthis world. There are the boys, Thomas! Look at them! What is to become\nof them? Oh, no, no, you can never have the heart--. (EJLIF and MORTEN\nhave come in, while she was speaking, with their school books in their\nhands.)\n\nDr. Stockmann. The boys-- I (Recovers himself suddenly.) No, even if\nthe whole world goes to pieces, I will never bow my neck to this yokel\n(Goes towards his room.)\n\nMrs. Stockmann (following him). Thomas--what are you going to do!\n\nDr. Stockmann (at his door). I mean to have the right to look my sons\nin the face when they are grown men. (Goes into his room.)\n\nMrs. Stockmann (bursting into tears). God help us all!\n\nPetra. Father is splendid! He will not give in.\n\n(The boys look on in amazement; PETRA signs to them not to speak.)\n\n\n\n\nACT III\n\n\n(SCENE.--The editorial office of the \"People's Messenger.\" The entrance\ndoor is on the left-hand side of the back wall; on the right-hand side\nis another door with glass panels through which the printing room can\nbe seen. Another door in the right-hand wall. In the middle of the room\nis a large table covered with papers, newspapers and books. In the\nforeground on the left a window, before which stands a desk and a high\nstool. There are a couple of easy chairs by the table, and other chairs\nstanding along the wall. The room is dingy and uncomfortable; the\nfurniture is old, the chairs stained and torn. In the printing room the\ncompositors are seen at work, and a printer is working a handpress.\nHOVSTAD is sitting at the desk, writing. BILLING comes in from the\nright with DR. STOCKMANN'S manuscript in his hand.)\n\nBilling. Well, I must say!\n\nHovstad (still writing). Have you read it through?\n\nBilling (laying the MS. on the desk). Yes, indeed I have.\n\nHovstad. Don't you think the Doctor hits them pretty hard?\n\nBilling. Hard? Bless my soul, he's crushing! Every word falls like--how\nshall I put it?--like the blow of a sledgehammer.\n\nHovstad. Yes, but they are not the people to throw up the sponge at the\nfirst blow.\n\nBilling. That is true; and for that reason we must strike blow upon\nblow until the whole of this aristocracy tumbles to pieces. As I sat in\nthere reading this, I almost seemed to see a revolution in being.\n\nHovstad (turning round). Hush!--Speak so that Aslaksen cannot hear you.\n\nBilling (lowering his voice). Aslaksen is a chicken-hearted chap, a\ncoward; there is nothing of the man in him. But this time you will\ninsist on your own way, won't you? You will put the Doctor's article in?\n\nHovstad. Yes, and if the Mayor doesn't like it--\n\nBilling. That will be the devil of a nuisance.\n\nHovstad. Well, fortunately we can turn the situation to good account,\nwhatever happens. If the Mayor will not fall in with the Doctor's\nproject, he will have all the small tradesmen down on him--the whole of\nthe Householders' Association and the rest of them. And if he does fall\nin with it, he will fall out with the whole crowd of large shareholders\nin the Baths, who up to now have been his most valuable supporters--\n\nBilling. Yes, because they will certainly have to fork out a pretty\npenny--\n\nHovstad. Yes, you may be sure they will. And in this way the ring will\nbe broken up, you see, and then in every issue of the paper we will\nenlighten the public on the Mayor's incapability on one point and\nanother, and make it clear that all the positions of trust in the town,\nthe whole control of municipal affairs, ought to be put in the hands of\nthe Liberals.\n\nBilling. That is perfectly true! I see it coming--I see it coming; we\nare on the threshold of a revolution!\n\n(A knock is heard at the door.)\n\nHovstad. Hush! (Calls out.) Come in! (DR. STOCKMANN comes in by the\nstreet door. HOVSTAD goes to meet him.) Ah, it is you, Doctor! Well?\n\nDr. Stockmann. You may set to work and print it, Mr. Hovstad!\n\nHovstad. Has it come to that, then?\n\nBilling. Hurrah!\n\nDr. Stockmann. Yes, print away. Undoubtedly it has come to that. Now\nthey must take what they get. There is going to be a fight in the town,\nMr. Billing!\n\nBilling. War to the knife, I hope! We will get our knives to their\nthroats, Doctor!\n\nDr. Stockmann. This article is only a beginning. I have already got\nfour or five more sketched out in my head. Where is Aslaksen?\n\nBilling (calls into the printing-room). Aslaksen, just come here for a\nminute!\n\nHovstad. Four or five more articles, did you say? On the same subject?\n\nDr. Stockmann. No--far from it, my dear fellow. No, they are about\nquite another matter. But they all spring from the question of the\nwater supply and the drainage. One thing leads to another, you know. It\nis like beginning to pull down an old house, exactly.\n\nBilling. Upon my soul, it's true; you find you are not done till you\nhave pulled all the old rubbish down.\n\nAslaksen (coming in). Pulled down? You are not thinking of pulling down\nthe Baths surely, Doctor?\n\nHovstad. Far from it, don't be afraid.\n\nDr. Stockmann. No, we meant something quite different. Well, what do\nyou think of my article, Mr. Hovstad?\n\nHovstad. I think it is simply a masterpiece.\n\nDr. Stockmann. Do you really think so? Well, I am very pleased, very\npleased.\n\nHovstad. It is so clear and intelligible. One need have no special\nknowledge to understand the bearing of it. You will have every\nenlightened man on your side.\n\nAslaksen. And every prudent man too, I hope?\n\nBilling. The prudent and the imprudent--almost the whole town.\n\nAslaksen. In that case we may venture to print it.\n\nDr. Stockmann. I should think so!\n\nHovstad. We will put it in tomorrow morning.\n\nDr. Stockmann. Of course--you must not lose a single day. What I wanted\nto ask you, Mr. Aslaksen, was if you would supervise the printing of it\nyourself.\n\nAslaksen. With pleasure.\n\nDr. Stockmann. Take care of it as if it were a treasure! No\nmisprints--every word is important. I will look in again a little\nlater; perhaps you will be able to let me see a proof. I can't tell you\nhow eager I am to see it in print, and see it burst upon the public--\n\nBilling. Burst upon them--yes, like a flash of lightning!\n\nDr. Stockmann. --and to have it submitted to the judgment of my\nintelligent fellow townsmen. You cannot imagine what I have gone\nthrough today. I have been threatened first with one thing and then\nwith another; they have tried to rob me of my most elementary rights as\na man--\n\nBilling. What! Your rights as a man!\n\nDr. Stockmann. --they have tried to degrade me, to make a coward of me,\nto force me to put personal interests before my most sacred convictions.\n\nBilling. That is too much--I'm damned if it isn't.\n\nHovstad. Oh, you mustn't be surprised at anything from that quarter.\n\nDr. Stockmann. Well, they will get the worst of it with me; they may\nassure themselves of that. I shall consider the \"People's Messenger\" my\nsheet-anchor now, and every single day I will bombard them with one\narticle after another, like bombshells--\n\nAslaksen. Yes, but\n\nBilling. Hurrah!--it is war, it is war!\n\nDr. Stockmann. I shall smite them to the ground--I shall crush them--I\nshall break down all their defenses, before the eyes of the honest\npublic! That is what I shall do!\n\nAslaksen, Yes, but in moderation, Doctor--proceed with moderation.\n\nBilling. Not a bit of it, not a bit of it! Don't spare the dynamite!\n\nDr. Stockmann. Because it is not merely a question of water-supply and\ndrains now, you know. No--it is the whole of our social life that we\nhave got to purify and disinfect--\n\nBilling. Spoken like a deliverer!\n\nDr. Stockmann. All the incapables must be turned out, you\nunderstand--and that in every walk of life! Endless vistas have opened\nthemselves to my mind's eye today. I cannot see it all quite clearly\nyet, but I shall in time. Young and vigorous standard-bearers--those\nare what we need and must seek, my friends; we must have new men in\ncommand at all our outposts.\n\nBilling. Hear hear!\n\nDr. Stockmann. We only need to stand by one another, and it will all be\nperfectly easy. The revolution will be launched like a ship that runs\nsmoothly off the stocks. Don't you think so?\n\nHovstad. For my part I think we have now a prospect of getting the\nmunicipal authority into the hands where it should lie.\n\nAslaksen. And if only we proceed with moderation, I cannot imagine that\nthere will be any risk.\n\nDr. Stockmann. Who the devil cares whether there is any risk or not!\nWhat I am doing, I am doing in the name of truth and for the sake of my\nconscience.\n\nHovstad. You are a man who deserves to be supported, Doctor.\n\nAslaksen. Yes, there is no denying that the Doctor is a true friend to\nthe town--a real friend to the community, that he is.\n\nBilling. Take my word for it, Aslaksen, Dr. Stockmann is a friend of\nthe people.\n\nAslaksen. I fancy the Householders' Association will make use of that\nexpression before long.\n\nDr. Stockmann (affected, grasps their hands). Thank you, thank you, my\ndear staunch friends. It is very refreshing to me to hear you say that;\nmy brother called me something quite different. By Jove, he shall have\nit back, with interest! But now I must be off to see a poor devil--I\nwill come back, as I said. Keep a very careful eye on the manuscript,\nAslaksen, and don't for worlds leave out any of my notes of\nexclamation! Rather put one or two more in! Capital, capital! Well,\ngood-bye for the present--goodbye, goodbye! (They show him to the door,\nand bow him out.)\n\nHovstad. He may prove an invaluably useful man to us.\n\nAslaksen. Yes, so long as he confines himself to this matter of the\nBaths. But if he goes farther afield, I don't think it would be\nadvisable to follow him.\n\nHovstad. Hm!--that all depends--\n\nBilling. You are so infernally timid, Aslaksen!\n\nAslaksen. Timid? Yes, when it is a question of the local authorities, I\nam timid, Mr. Billing; it is a lesson I have learned in the school of\nexperience, let me tell you. But try me in higher politics, in matters\nthat concern the government itself, and then see if I am timid.\n\nBilling. No, you aren't, I admit. But this is simply contradicting\nyourself.\n\nAslaksen. I am a man with a conscience, and that is the whole matter.\nIf you attack the government, you don't do the community any harm,\nanyway; those fellows pay no attention to attacks, you see--they go on\njust as they are, in spite of them. But local authorities are\ndifferent; they can be turned out, and then perhaps you may get an\nignorant lot into office who may do irreparable harm to the\nhouseholders and everybody else.\n\nHovstad. But what of the education of citizens by self\ngovernment--don't you attach any importance to that?\n\nAslaksen. When a man has interests of his own to protect, he cannot\nthink of everything, Mr. Hovstad.\n\nHovstad. Then I hope I shall never have interests of my own to protect!\n\nBilling. Hear, hear!\n\nAslaksen (with a smile). Hm! (Points to the desk.) Mr. Sheriff\nStensgaard was your predecessor at that editorial desk.\n\nBilling (spitting). Bah! That turncoat.\n\nHovstad. I am not a weathercock--and never will be.\n\nAslaksen. A politician should never be too certain of anything, Mr.\nHovstad. And as for you, Mr. Billing, I should think it is time for you\nto be taking in a reef or two in your sails, seeing that you are\napplying for the post of secretary to the Bench.\n\nBilling. I--!\n\nHovstad. Are you, Billing?\n\nBilling. Well, yes--but you must clearly understand I am only doing it\nto annoy the bigwigs.\n\nAslaksen. Anyhow, it is no business of mine. But if I am to be accused\nof timidity and of inconsistency in my principles, this is what I want\nto point out: my political past is an open book. I have never changed,\nexcept perhaps to become a little more moderate, you see. My heart is\nstill with the people; but I don't deny that my reason has a certain\nbias towards the authorities--the local ones, I mean. (Goes into the\nprinting room.)\n\nBilling. Oughtn't we to try and get rid of him, Hovstad?\n\nHovstad. Do you know anyone else who will advance the money for our\npaper and printing bill?\n\nBilling. It is an infernal nuisance that we don't possess some capital\nto trade on.\n\nHovstad (sitting down at his desk). Yes, if we only had that, then--\n\nBilling. Suppose you were to apply to Dr. Stockmann?\n\nHovstad (turning over some papers). What is the use? He has got nothing.\n\nBilling. No, but he has got a warm man in the background, old Morten\nKiil--\"the Badger,\" as they call him.\n\nHovstad (writing). Are you so sure he has got anything?\n\nBilling. Good Lord, of course he has! And some of it must come to the\nStockmanns. Most probably he will do something for the children, at all\nevents.\n\nHovstad (turning half round). Are you counting on that?\n\nBilling. Counting on it? Of course I am not counting on anything.\n\nHovstad. That is right. And I should not count on the secretaryship to\nthe Bench either, if I were you; for I can assure you--you won't get it.\n\nBilling. Do you think I am not quite aware of that? My object is\nprecisely not to get it. A slight of that kind stimulates a man's\nfighting power--it is like getting a supply of fresh bile--and I am\nsure one needs that badly enough in a hole-and-corner place like this,\nwhere it is so seldom anything happens to stir one up.\n\nHovstad (writing). Quite so, quite so.\n\nBilling. Ah, I shall be heard of yet!--Now I shall go and write the\nappeal to the Householders' Association. (Goes into the room on the\nright.)\n\nHovstad (sitting al his desk, biting his penholder, says slowly).\nHm!--that's it, is it. (A knock is heard.) Come in! (PETRA comes in by\nthe outer door. HOVSTAD gets up.) What, you!--here?\n\nPetra. Yes, you must forgive me--\n\nHovstad (pulling a chair forward). Won't you sit down?\n\nPetra. No, thank you; I must go again in a moment.\n\nHovstad. Have you come with a message from your father, by any chance?\n\nPetra. No, I have come on my own account. (Takes a book out of her coat\npocket.) Here is the English story.\n\nHovstad. Why have you brought it back?\n\nPetra. Because I am not going to translate it.\n\nHovstad. But you promised me faithfully.\n\nPetra. Yes, but then I had not read it, I don't suppose you have read\nit either?\n\nHovstad. No, you know quite well I don't understand English; but--\n\nPetra. Quite so. That is why I wanted to tell you that you must find\nsomething else. (Lays the book on the table.) You can't use this for\nthe \"People's Messenger.\"\n\nHovstad. Why not?\n\nPetra. Because it conflicts with all your opinions.\n\nHovstad. Oh, for that matter--\n\nPetra. You don't understand me. The burden of this story is that there\nis a supernatural power that looks after the so-called good people in\nthis world and makes everything happen for the best in their\ncase--while all the so-called bad people are punished.\n\nHovstad. Well, but that is all right. That is just what our readers\nwant.\n\nPetra. And are you going to be the one to give it to them? For myself,\nI do not believe a word of it. You know quite well that things do not\nhappen so in reality.\n\nHovstad. You are perfectly right; but an editor cannot always act as he\nwould prefer. He is often obliged to bow to the wishes of the public in\nunimportant matters. Politics are the most important thing in life--for\na newspaper, anyway; and if I want to carry my public with me on the\npath that leads to liberty and progress, I must not frighten them away.\nIf they find a moral tale of this sort in the serial at the bottom of\nthe page, they will be all the more ready to read what is printed above\nit; they feel more secure, as it were.\n\nPetra. For shame! You would never go and set a snare like that for your\nreaders; you are not a spider!\n\nHovstad (smiling). Thank you for having such a good opinion of me. No;\nas a matter of fact that is Billing's idea and not mine.\n\nPetra. Billing's!\n\nHovstad. Yes; anyway, he propounded that theory here one day. And it is\nBilling who is so anxious to have that story in the paper; I don't know\nanything about the book.\n\nPetra. But how can Billing, with his emancipated views--\n\nHovstad. Oh, Billing is a many-sided man. He is applying for the post\nof secretary to the Bench, too, I hear.\n\nPetra. I don't believe it, Mr. Hovstad. How could he possibly bring\nhimself to do such a thing?\n\nHovstad. Ah, you must ask him that.\n\nPetra. I should never have thought it of him.\n\nHovstad (looking more closely at her). No? Does it really surprise you\nso much?\n\nPetra. Yes. Or perhaps not altogether. Really, I don't quite know\n\nHovstad. We journalists are not much worth, Miss Stockmann.\n\nPetra. Do you really mean that?\n\nHovstad. I think so sometimes.\n\nPetra. Yes, in the ordinary affairs of everyday life, perhaps; I can\nunderstand that. But now, when you have taken a weighty matter in hand--\n\nHovstad. This matter of your father's, you mean?\n\nPetra. Exactly. It seems to me that now you must feel you are a man\nworth more than most.\n\nHovstad. Yes, today I do feel something of that sort.\n\nPetra. Of course you do, don't you? It is a splendid vocation you have\nchosen--to smooth the way for the march of unappreciated truths, and\nnew and courageous lines of thought. If it were nothing more than\nbecause you stand fearlessly in the open and take up the cause of an\ninjured man--\n\nHovstad. Especially when that injured man is--ahem!--I don't rightly\nknow how to--\n\nPetra. When that man is so upright and so honest, you mean?\n\nHovstad (more gently). Especially when he is your father I meant.\n\nPetra (suddenly checked). That?\n\nHovstad. Yes, Petra--Miss Petra.\n\nPetra. Is it that, that is first and foremost with you? Not the matter\nitself? Not the truth?--not my father's big generous heart?\n\nHovstad. Certainly--of course--that too.\n\nPetra. No, thank you; you have betrayed yourself, Mr. Hovstad, and now\nI shall never trust you again in anything.\n\nHovstad. Can you really take it so amiss in me that it is mostly for\nyour sake--?\n\nPetra. What I am angry with you for, is for not having been honest with\nmy father. You talked to him as if the truth and the good of the\ncommunity were what lay nearest to your heart. You have made fools of\nboth my father and me. You are not the man you made yourself out to be.\nAnd that I shall never forgive you-never!\n\nHovstad. You ought not to speak so bitterly, Miss Petra--least of all\nnow.\n\nPetra. Why not now, especially?\n\nHovstad. Because your father cannot do without my help.\n\nPetra (looking him up and down). Are you that sort of man too? For\nshame!\n\nHovstad. No, no, I am not. This came upon me so unexpectedly--you must\nbelieve that.\n\nPetra. I know what to believe. Goodbye.\n\nAslaksen (coming from the printing room, hurriedly and with an air of\nmystery). Damnation, Hovstad!--(Sees PETRA.) Oh, this is awkward--\n\nPetra. There is the book; you must give it to some one else. (Goes\ntowards the door.)\n\nHovstad (following her). But, Miss Stockmann--\n\nPetra. Goodbye. (Goes out.)\n\nAslaksen. I say--Mr. Hovstad--\n\nHovstad. Well well!--what is it?\n\nAslaksen. The Mayor is outside in the printing room.\n\nHovstad. The Mayor, did you say?\n\nAslaksen. Yes he wants to speak to you. He came in by the back\ndoor--didn't want to be seen, you understand.\n\nHovstad. What can he want? Wait a bit--I will go myself. (Goes to the\ndoor of the printing room, opens it, bows and invites PETER STOCKMANN\nin.) Just see, Aslaksen, that no one--\n\nAslaksen. Quite so. (Goes into the printing-room.)\n\nPeter Stockmann. You did not expect to see me here, Mr. Hovstad?\n\nHovstad. No, I confess I did not.\n\nPeter Stockmann (looking round). You are very snug in here--very nice\nindeed.\n\nHovstad. Oh--\n\nPeter Stockmann. And here I come, without any notice, to take up your\ntime!\n\nHovstad. By all means, Mr. Mayor. I am at your service. But let me\nrelieve you of your--(takes STOCKMANN's hat and stick and puts them on\na chair). Won't you sit down?\n\nPeter Stockmann (sitting down by the table). Thank you. (HOVSTAD sits\ndown.) I have had an extremely annoying experience to-day, Mr. Hovstad.\n\nHovstad. Really? Ah well, I expect with all the various business you\nhave to attend to--\n\nPeter Stockmann. The Medical Officer of the Baths is responsible for\nwhat happened today.\n\nHovstad. Indeed? The Doctor?\n\nPeter Stockmann. He has addressed a kind of report to the Baths\nCommittee on the subject of certain supposed defects in the Baths.\n\nHovstad. Has he indeed?\n\nPeter Stockmann. Yes--has he not told you? I thought he said--\n\nHovstad. Ah, yes--it is true he did mention something about--\n\nAslaksen (coming from the printing-room). I ought to have that copy.\n\nHovstad (angrily). Ahem!--there it is on the desk.\n\nAslaksen (taking it). Right.\n\nPeter Stockmann. But look there--that is the thing I was speaking of!\n\nAslaksen. Yes, that is the Doctor's article, Mr. Mayor.\n\nHovstad. Oh, is THAT what you were speaking about?\n\nPeter Stockmann. Yes, that is it. What do you think of it?\n\nHovstad. Oh, I am only a layman--and I have only taken a very cursory\nglance at it.\n\nPeter Stockmann. But you are going to print it?\n\nHovstad. I cannot very well refuse a distinguished man.\n\nAslaksen. I have nothing to do with editing the paper, Mr. Mayor--\n\nPeter Stockmann. I understand.\n\nAslaksen. I merely print what is put into my hands.\n\nPeter Stockmann. Quite so.\n\nAslaksen. And so I must-- (moves off towards the printing-room).\n\nPeter Stockmann. No, but wait a moment, Mr. Aslaksen. You will allow\nme, Mr. Hovstad?\n\nHovstad. If you please, Mr. Mayor.\n\nPeter Stockmann. You are a discreet and thoughtful man, Mr. Aslaksen.\n\nAslaksen. I am delighted to hear you think so, sir.\n\nPeter Stockmann. And a man of very considerable influence.\n\nAslaksen. Chiefly among the small tradesmen, sir.\n\nPeter Stockmann. The small tax-payers are the majority--here as\neverywhere else.\n\nAslaksen. That is true.\n\nPeter Stockmann. And I have no doubt you know the general trend of\nopinion among them, don't you?\n\nAslaksen. Yes I think I may say I do, Mr. Mayor.\n\nPeter Stockmann. Yes. Well, since there is such a praiseworthy spirit\nof self-sacrifice among the less wealthy citizens of our town--\n\nAslaksen. What?\n\nHovstad. Self-sacrifice?\n\nPeter Stockmann. It is pleasing evidence of a public-spirited feeling,\nextremely pleasing evidence. I might almost say I hardly expected it.\nBut you have a closer knowledge of public opinion than I.\n\nAslaksen. But, Mr. Mayor--\n\nPeter Stockmann. And indeed it is no small sacrifice that the town is\ngoing to make.\n\nHovstad. The town?\n\nAslaksen. But I don't understand. Is it the Baths--?\n\nPeter Stockmann. At a provisional estimate, the alterations that the\nMedical Officer asserts to be desirable will cost somewhere about\ntwenty thousand pounds.\n\nAslaksen. That is a lot of money, but--\n\nPeter Stockmann. Of course it will be necessary to raise a municipal\nloan.\n\nHovstad (getting up). Surely you never mean that the town must pay--?\n\nAslaksen. Do you mean that it must come out of the municipal\nfunds?--out of the ill-filled pockets of the small tradesmen?\n\nPeter Stockmann. Well, my dear Mr. Aslaksen, where else is the money to\ncome from?\n\nAslaksen. The gentlemen who own the Baths ought to provide that.\n\nPeter Stockmann. The proprietors of the Baths are not in a position to\nincur any further expense.\n\nAslaksen. Is that absolutely certain, Mr. Mayor?\n\nPeter Stockmann. I have satisfied myself that it is so. If the town\nwants these very extensive alterations, it will have to pay for them.\n\nAslaksen. But, damn it all--I beg your pardon--this is quite another\nmatter, Mr. Hovstad!\n\nHovstad. It is, indeed.\n\nPeter Stockmann. The most fatal part of it is that we shall be obliged\nto shut the Baths for a couple of years.\n\nHovstad. Shut them? Shut them altogether?\n\nAslaksen. For two years?\n\nPeter Stockmann. Yes, the work will take as long as that--at least.\n\nAslaksen. I'm damned if we will stand that, Mr. Mayor! What are we\nhouseholders to live upon in the meantime?\n\nPeter Stockmann. Unfortunately, that is an extremely difficult question\nto answer, Mr. Aslaksen. But what would you have us do? Do you suppose\nwe shall have a single visitor in the town, if we go about proclaiming\nthat our water is polluted, that we are living over a plague spot, that\nthe entire town--\n\nAslaksen. And the whole thing is merely imagination?\n\nPeter Stockmann. With the best will in the world, I have not been able\nto come to any other conclusion.\n\nAslaksen. Well then I must say it is absolutely unjustifiable of Dr.\nStockmann--I beg your pardon, Mr. Mayor.\n\nPeter Stockmann. What you say is lamentably true, Mr. Aslaksen. My\nbrother has unfortunately always been a headstrong man.\n\nAslaksen. After this, do you mean to give him your support, Mr. Hovstad?\n\nHovstad. Can you suppose for a moment that I--?\n\nPeter Stockmann. I have drawn up a short resume of the situation as it\nappears from a reasonable man's point of view. In it I have indicated\nhow certain possible defects might suitably be remedied without\noutrunning the resources of the Baths Committee.\n\nHovstad. Have you got it with you, Mr. Mayor?\n\nPeter Stockmann (fumbling in his pocket). Yes, I brought it with me in\ncase you should--\n\nAslaksen. Good Lord, there he is!\n\nPeter Stockmann. Who? My brother?\n\nHovstad. Where? Where?\n\nAslaksen. He has just gone through the printing room.\n\nPeter Stockmann. How unlucky! I don't want to meet him here, and I had\nstill several things to speak to you about.\n\nHovstad (pointing to the door on the right). Go in there for the\npresent.\n\nPeter Stockmann. But--?\n\nHovstad. You will only find Billing in there.\n\nAslaksen. Quick, quick, Mr. Mayor--he is just coming.\n\nPeter Stockmann. Yes, very well; but see that you get rid of him\nquickly. (Goes out through the door on the right, which ASLAKSEN opens\nfor him and shuts after him.)\n\nHovstad. Pretend to be doing something, Aslaksen. (Sits down and\nwrites. ASLAKSEN begins foraging among a heap of newspapers that are\nlying on a chair.)\n\nDr. Stockmann (coming in from the printing room). Here I am again.\n(Puts down his hat and stick.)\n\nHovstad (writing). Already, Doctor? Hurry up with what we were speaking\nabout, Aslaksen. We are very pressed for time today.\n\nDr. Stockmann (to ASLAKSEN). No proof for me to see yet, I hear.\n\nAslaksen (without turning round). You couldn't expect it yet, Doctor.\n\nDr. Stockmann. No, no; but I am impatient, as you can understand. I\nshall not know a moment's peace of mind until I see it in print.\n\nHovstad. Hm!--It will take a good while yet, won't it, Aslaksen?\n\nAslaksen. Yes, I am almost afraid it will.\n\nDr. Stockmann. All right, my dear friends; I will come back. I do not\nmind coming back twice if necessary. A matter of such great\nimportance--the welfare of the town at stake--it is no time to shirk\ntrouble, (is just going, but stops and comes back.) Look here--there is\none thing more I want to speak to you about.\n\nHovstad. Excuse me, but could it not wait till some other time?\n\nDr. Stockmann. I can tell you in half a dozen words. It is only this.\nWhen my article is read tomorrow and it is realised that I have been\nquietly working the whole winter for the welfare of the town--\n\nHovstad. Yes but, Doctor--\n\nDr. Stockmann. I know what you are going to say. You don't see how on\nearth it was any more than my duty--my obvious duty as a citizen. Of\ncourse it wasn't; I know that as well as you. But my fellow citizens,\nyou know--! Good Lord, think of all the good souls who think so highly\nof me--!\n\nAslaksen. Yes, our townsfolk have had a very high opinion of you so\nfar, Doctor.\n\nDr. Stockmann. Yes, and that is just why I am afraid they--. Well, this\nis the point; when this reaches them, especially the poorer classes,\nand sounds in their ears like a summons to take the town's affairs into\ntheir own hands for the future...\n\nHovstad (getting up). Ahem I Doctor, I won't conceal from you the fact--\n\nDr. Stockmann. Ah I--I knew there was something in the wind! But I\nwon't hear a word of it. If anything of that sort is being set on foot--\n\nHovstad. Of what sort?\n\nDr. Stockmann. Well, whatever it is--whether it is a demonstration in\nmy honour, or a banquet, or a subscription list for some presentation\nto me--whatever it is, you most promise me solemnly and faithfully to\nput a stop to it. You too, Mr. Aslaksen; do you understand?\n\nHovstad. You must forgive me, Doctor, but sooner or later we must tell\nyou the plain truth--\n\n(He is interrupted by the entrance Of MRS. STOCKMANN, who comes in from\nthe street door.)\n\nMrs. Stockmann (seeing her husband). Just as I thought!\n\nHovstad (going towards her). You too, Mrs. Stockmann?\n\nDr. Stockmann. What on earth do you want here, Katherine?\n\nMrs. Stockmann. I should think you know very well what I want.\n\nHovstad, Won't you sit down? Or perhaps--\n\nMrs. Stockmann. No, thank you; don't trouble. And you must not be\noffended at my coming to fetch my husband; I am the mother of three\nchildren, you know.\n\nDr. Stockmann. Nonsense!--we know all about that.\n\nMrs. Stockmann. Well, one would not give you credit for much thought\nfor your wife and children today; if you had had that, you would not\nhave gone and dragged us all into misfortune.\n\nDr. Stockmann. Are you out of your senses, Katherine! Because a man has\na wife and children, is he not to be allowed to proclaim the truth-is\nhe not to be allowed to be an actively useful citizen--is he not to be\nallowed to do a service to his native town!\n\nMrs. Stockmann. Yes, Thomas--in reason.\n\nAslaksen. Just what I say. Moderation in everything.\n\nMrs. Stockmann. And that is why you wrong us, Mr. Hovstad, in enticing\nmy husband away from his home and making a dupe of him in all this.\n\nHovstad. I certainly am making a dupe of no one--\n\nDr. Stockmann. Making a dupe of me! Do you suppose I should allow\nmyself to be duped!\n\nMrs. Stockmann. It is just what you do. I know quite well you have more\nbrains than anyone in the town, but you are extremely easily duped,\nThomas. (To Hovstad.) Please do realise that he loses his post at the\nBaths if you print what he has written.\n\nAslaksen. What!\n\nHovstad. Look here, Doctor!\n\nDr. Stockmann (laughing). Ha-ha!--just let them try! No, no--they will\ntake good care not to. I have got the compact majority behind me, let\nme tell you!\n\nMrs. Stockmann. Yes, that is just the worst of it--your having any such\nhorrid thing behind you.\n\nDr. Stockmann. Rubbish, Katherine!--Go home and look after your house\nand leave me to look after the community. How can you be so afraid,\nwhen I am so confident and happy? (Walks up and down, rubbing his\nhands.) Truth and the People will win the fight, you may be certain! I\nsee the whole of the broad-minded middle class marching like a\nvictorious army--! (Stops beside a chair.) What the deuce is that lying\nthere?\n\nAslaksen Good Lord!\n\nHovstad. Ahem!\n\nDr. Stockmann. Here we have the topmost pinnacle of authority! (Takes\nthe Mayor's official hat carefully between his finger-tips and holds it\nup in the air.)\n\nMrs. Stockmann. The Mayor's hat!\n\nDr. Stockmann. And here is the staff of office too. How in the name of\nall that's wonderful--?\n\nHovstad. Well, you see--\n\nDr. Stockmann. Oh, I understand. He has been here trying to talk you\nover. Ha-ha!--he made rather a mistake there! And as soon as he caught\nsight of me in the printing room. (Bursts out laughing.) Did he run\naway, Mr. Aslaksen?\n\nAslaksen (hurriedly). Yes, he ran away, Doctor.\n\nDr. Stockmann. Ran away without his stick or his--. Fiddlesticks! Peter\ndoesn't run away and leave his belongings behind him. But what the\ndeuce have you done with him? Ah!--in there, of course. Now you shall\nsee, Katherine!\n\nMrs. Stockmann. Thomas--please don't--!\n\nAslaksen. Don't be rash, Doctor.\n\n(DR. STOCKMANN has put on the Mayor's hat and taken his stick in his\nhand. He goes up to the door, opens it, and stands with his hand to his\nhat at the salute. PETER STOCKMANN comes in, red with anger. BILLING\nfollows him.)\n\nPeter Stockmann. What does this tomfoolery mean?\n\nDr. Stockmann. Be respectful, my good Peter. I am the chief authority\nin the town now. (Walks up and down.)\n\nMrs. Stockmann (almost in tears). Really, Thomas!\n\nPeter Stockmann (following him about). Give me my hat and stick.\n\nDr. Stockmann (in the same tone as before). If you are chief constable,\nlet me tell you that I am the Mayor--I am the master of the whole town,\nplease understand!\n\nPeter Stockmann. Take off my hat, I tell you. Remember it is part of an\nofficial uniform.\n\nDr. Stockmann. Pooh! Do you think the newly awakened lionhearted people\nare going to be frightened by an official hat? There is going to be a\nrevolution in the town tomorrow, let me tell you. You thought you could\nturn me out; but now I shall turn you out--turn you out of all your\nvarious offices. Do you think I cannot? Listen to me. I have triumphant\nsocial forces behind me. Hovstad and Billing will thunder in the\n\"People's Messenger,\" and Aslaksen will take the field at the head of\nthe whole Householders' Association--\n\nAslaksen. That I won't, Doctor.\n\nDr. Stockmann. Of course you will--\n\nPeter Stockmann. Ah!--may I ask then if Mr. Hovstad intends to join\nthis agitation?\n\nHovstad. No, Mr. Mayor.\n\nAslaksen. No, Mr. Hovstad is not such a fool as to go and ruin his\npaper and himself for the sake of an imaginary grievance.\n\nDr. Stockmann (looking round him). What does this mean?\n\nHovstad. You have represented your case in a false light, Doctor, and\ntherefore I am unable to give you my support.\n\nBilling. And after what the Mayor was so kind as to tell me just now,\nI--\n\nDr. Stockmann. A false light! Leave that part of it to me. Only print\nmy article; I am quite capable of defending it.\n\nHovstad. I am not going to print it. I cannot and will not and dare not\nprint it.\n\nDr. Stockmann. You dare not? What nonsense!--you are the editor; and an\neditor controls his paper, I suppose!\n\nAslaksen. No, it is the subscribers, Doctor.\n\nPeter Stockmann. Fortunately, yes.\n\nAslaksen. It is public opinion--the enlightened public--householders\nand people of that kind; they control the newspapers.\n\nDr. Stockmann (composedly). And I have all these influences against me?\n\nAslaksen. Yes, you have. It would mean the absolute ruin of the\ncommunity if your article were to appear.\n\nDr. Stockmann. Indeed.\n\nPeter Stockmann. My hat and stick, if you please. (DR. STOCKMANN takes\noff the hat and lays it on the table with the stick. PETER STOCKMANN\ntakes them up.) Your authority as mayor has come to an untimely end.\n\nDr. Stockmann. We have not got to the end yet. (To HOVSTAD.) Then it is\nquite impossible for you to print my article in the \"People's\nMessenger\"?\n\nHovstad. Quite impossible--out of regard for your family as well.\n\nMrs. Stockmann. You need not concern yourself about his family, thank\nyou, Mr. Hovstad.\n\nPeter Stockmann (taking a paper from his pocket). It will be\nsufficient, for the guidance of the public, if this appears. It is an\nofficial statement. May I trouble you?\n\nHovstad (taking the paper). Certainly; I will see that it is printed.\n\nDr. Stockmann. But not mine. Do you imagine that you can silence me and\nstifle the truth! You will not find it so easy as you suppose. Mr.\nAslaksen, kindly take my manuscript at once and print it as a\npamphlet--at my expense. I will have four hundred copies--no, five or\nsix hundred.\n\nAslaksen. If you offered me its weight in gold, I could not lend my\npress for any such purpose, Doctor. It would be flying in the face of\npublic opinion. You will not get it printed anywhere in the town.\n\nDr. Stockmann. Then give it me back.\n\nHovstad (giving him the MS.). Here it is.\n\nDr. Stockmann (taking his hat and stick). It shall be made public all\nthe same. I will read it out at a mass meeting of the townspeople. All\nmy fellow-citizens shall hear the voice of truth!\n\nPeter Stockmann. You will not find any public body in the town that\nwill give you the use of their hall for such a purpose.\n\nAslaksen. Not a single one, I am certain.\n\nBilling. No, I'm damned if you will find one.\n\nMrs. Stockmann. But this is too shameful! Why should every one turn\nagainst you like that?\n\nDr. Stockmann (angrily). I will tell you why. It is because all the men\nin this town are old women--like you; they all think of nothing but\ntheir families, and never of the community.\n\nMrs. Stockmann (putting her arm into his). Then I will show them that\nan old woman can be a man for once. I am going to stand by you, Thomas!\n\nDr. Stockmann. Bravely said, Katherine! It shall be made public--as I\nam a living soul! If I can't hire a hall, I shall hire a drum, and\nparade the town with it and read it at every street-corner.\n\nPeter Stockmann. You are surely not such an errant fool as that!\n\nDr. Stockmann. Yes, I am.\n\nAslaksen. You won't find a single man in the whole town to go with you.\n\nBilling. No, I'm damned if you will.\n\nMrs. Stockmann. Don't give in, Thomas. I will tell the boys to go with\nyou.\n\nDr. Stockmann. That is a splendid idea!\n\nMrs. Stockmann. Morten will be delighted; and Ejlif will do whatever he\ndoes.\n\nDr. Stockmann. Yes, and Petra!--and you too, Katherine!\n\nMrs. Stockmann. No, I won't do that; but I will stand at the window and\nwatch you, that's what I will do.\n\nDr. Stockmann (puts his arms round her and kisses her). Thank you, my\ndear! Now you and I are going to try a fall, my fine gentlemen! I am\ngoing to see whether a pack of cowards can succeed in gagging a patriot\nwho wants to purify society! (He and his wife go out by the street\ndoor.)\n\nPeter Stockmann (shaking his head seriously). Now he has sent her out\nof her senses, too.\n\n\n\n\nACT IV\n\n\n(SCENE.--A big old-fashioned room in CAPTAIN HORSTER'S house. At the\nback folding-doors, which are standing open, lead to an ante-room.\nThree windows in the left-hand wall. In the middle of the opposite wall\na platform has been erected. On this is a small table with two candles,\na water-bottle and glass, and a bell. The room is lit by lamps placed\nbetween the windows. In the foreground on the left there is a table\nwith candles and a chair. To the right is a door and some chairs\nstanding near it. The room is nearly filled with a crowd of townspeople\nof all sorts, a few women and schoolboys being amongst them. People are\nstill streaming in from the back, and the room is soon filled.)\n\n1st Citizen (meeting another). Hullo, Lamstad! You here too?\n\n2nd Citizen. I go to every public meeting, I do.\n\n3rd Citizen. Brought your whistle too, I expect!\n\n2nd Citizen. I should think so. Haven't you?\n\n3rd Citizen. Rather! And old Evensen said he was going to bring a\ncow-horn, he did.\n\n2nd Citizen. Good old Evensen! (Laughter among the crowd.)\n\n4th Citizen (coming up to them). I say, tell me what is going on here\ntonight?\n\n2nd Citizen. Dr. Stockmann is going to deliver an address attacking the\nMayor.\n\n4th Citizen. But the Mayor is his brother.\n\n1st Citizen. That doesn't matter; Dr. Stockmann's not the chap to be\nafraid.\n\nPeter Stockmann. For various reasons, which you will easily understand,\nI must beg to be excused. But fortunately we have amongst us a man who\nI think will be acceptable to you all. I refer to the President of the\nHouseholders' Association, Mr. Aslaksen.\n\nSeveral voices. Yes--Aslaksen! Bravo Aslaksen!\n\n(DR. STOCKMANN takes up his MS. and walks up and down the platform.)\n\nAslaksen. Since my fellow-citizens choose to entrust me with this duty,\nI cannot refuse.\n\n(Loud applause. ASLAKSEN mounts the platform.)\n\nBilling (writing), \"Mr. Aslaksen was elected with enthusiasm.\"\n\nAslaksen. And now, as I am in this position, I should like to say a few\nbrief words. I am a quiet and peaceable man, who believes in discreet\nmoderation, and--and--in moderate discretion. All my friends can bear\nwitness to that.\n\nSeveral Voices. That's right! That's right, Aslaksen!\n\nAslaksen. I have learned in the school of life and experience that\nmoderation is the most valuable virtue a citizen can possess--\n\nPeter Stockmann. Hear, hear!\n\nAslaksen. --And moreover, that discretion and moderation are what\nenable a man to be of most service to the community. I would therefore\nsuggest to our esteemed fellow-citizen, who has called this meeting,\nthat he should strive to keep strictly within the bounds of moderation.\n\nA Man by the door. Three cheers for the Moderation Society!\n\nA Voice. Shame!\n\nSeveral Voices. Sh!-Sh!\n\nAslaksen. No interruptions, gentlemen, please! Does anyone wish to make\nany remarks?\n\nPeter Stockmann. Mr. Chairman.\n\nAslaksen. The Mayor will address the meeting.\n\nPeter Stockmann. In consideration of the close relationship in which,\nas you all know, I stand to the present Medical Officer of the Baths, I\nshould have preferred not to speak this evening. But my official\nposition with regard to the Baths and my solicitude for the vital\ninterests of the town compel me to bring forward a motion. I venture to\npresume that there is not a single one of our citizens present who\nconsiders it desirable that unreliable and exaggerated accounts of the\nsanitary condition of the Baths and the town should be spread abroad.\n\nSeveral Voices. No, no! Certainly not! We protest against it!\n\nPeter Stockmann. Therefore, I should like to propose that the meeting\nshould not permit the Medical Officer either to read or to comment on\nhis proposed lecture.\n\nDr. Stockmann (impatiently). Not permit--! What the devil--!\n\nMrs. Stockmann (coughing). Ahem!-ahem!\n\nDr. Stockmann (collecting himself). Very well, Go ahead!\n\nPeter Stockmann. In my communication to the \"People's Messenger,\" I\nhave put the essential facts before the public in such a way that every\nfair-minded citizen can easily form his own opinion. From it you will\nsee that the main result of the Medical Officer's proposals--apart from\ntheir constituting a vote of censure on the leading men of the\ntown--would be to saddle the ratepayers with an unnecessary expenditure\nof at least some thousands of pounds.\n\n(Sounds of disapproval among the audience, and some cat-calls.)\n\nAslaksen (ringing his bell). Silence, please, gentlemen! I beg to\nsupport the Mayor's motion. I quite agree with him that there is\nsomething behind this agitation started by the Doctor. He talks about\nthe Baths; but it is a revolution he is aiming at--he wants to get the\nadministration of the town put into new hands. No one doubts the\nhonesty of the Doctor's intentions--no one will suggest that there can\nbe any two opinions as to that, I myself am a believer in\nself-government for the people, provided it does not fall too heavily\non the ratepayers. But that would be the case here; and that is why I\nwill see Dr. Stockmann damned--I beg your pardon--before I go with him\nin the matter. You can pay too dearly for a thing sometimes; that is my\nopinion.\n\n(Loud applause on all sides.)\n\nHovstad. I, too, feel called upon to explain my position. Dr.\nStockmann's agitation appeared to be gaining a certain amount of\nsympathy at first, so I supported it as impartially as I could. But\npresently we had reason to suspect that we had allowed ourselves to be\nmisled by misrepresentation of the state of affairs--\n\nDr. Stockmann. Misrepresentation--!\n\nHovstad. Well, let us say a not entirely trustworthy representation.\nThe Mayor's statement has proved that. I hope no one here has any doubt\nas to my liberal principles; the attitude of the \"People's Messenger\"\ntowards important political questions is well known to everyone. But\nthe advice of experienced and thoughtful men has convinced me that in\npurely local matters a newspaper ought to proceed with a certain\ncaution.\n\nAslaksen. I entirely agree with the speaker.\n\nHovstad. And, in the matter before us, it is now an undoubted fact that\nDr. Stockmann has public opinion against him. Now, what is an editor's\nfirst and most obvious duty, gentlemen? Is it not to work in harmony\nwith his readers? Has he not received a sort of tacit mandate to work\npersistently and assiduously for the welfare of those whose opinions he\nrepresents? Or is it possible I am mistaken in that?\n\nVoices from the crowd. No, no! You are quite right!\n\nHovstad. It has cost me a severe struggle to break with a man in whose\nhouse I have been lately a frequent guest--a man who till today has\nbeen able to pride himself on the undivided goodwill of his\nfellow-citizens--a man whose only, or at all events whose essential,\nfailing is that he is swayed by his heart rather than his head.\n\nA few scattered voices. That is true! Bravo, Stockmann!\n\nHovstad. But my duty to the community obliged me to break with him. And\nthere is another consideration that impels me to oppose him, and, as\nfar as possible, to arrest him on the perilous course he has adopted;\nthat is, consideration for his family--\n\nDr. Stockmann. Please stick to the water-supply and drainage!\n\nHovstad. --consideration, I repeat, for his wife and his children for\nwhom he has made no provision.\n\nMorten. Is that us, mother?\n\nMrs. Stockmann. Hush!\n\nAslaksen. I will now put the Mayor's proposition to the vote.\n\nDr. Stockmann. There is no necessity! Tonight I have no intention of\ndealing with all that filth down at the Baths. No; I have something\nquite different to say to you.\n\nPeter Stockmann (aside). What is coming now?\n\nA Drunken Man (by the entrance door). I am a ratepayer! And therefore,\nI have a right to speak too! And my entire--firm--inconceivable opinion\nis--\n\nA number of voices. Be quiet, at the back there!\n\nOthers. He is drunk! Turn him out! (They turn him out.)\n\nDr. Stockmann. Am I allowed to speak?\n\nAslaksen (ringing his bell). Dr. Stockmann will address the meeting.\n\nDr. Stockmann. I should like to have seen anyone, a few days ago, dare\nto attempt to silence me as has been done tonight! I would have\ndefended my sacred rights as a man, like a lion! But now it is all one\nto me; I have something of even weightier importance to say to you.\n(The crowd presses nearer to him, MORTEN Kiil conspicuous among them.)\n\nDr. Stockmann (continuing). I have thought and pondered a great deal,\nthese last few days--pondered over such a variety of things that in the\nend my head seemed too full to hold them--\n\nPeter Stockmann (with a cough). Ahem!\n\nDr. Stockmann. --but I got them clear in my mind at last, and then I\nsaw the whole situation lucidly. And that is why I am standing here\nto-night. I have a great revelation to make to you, my fellow-citizens!\nI will impart to you a discovery of a far wider scope than the trifling\nmatter that our water supply is poisoned and our medicinal Baths are\nstanding on pestiferous soil.\n\nA number of voices (shouting). Don't talk about the Baths! We won't\nhear you! None of that!\n\nDr. Stockmann. I have already told you that what I want to speak about\nis the great discovery I have made lately--the discovery that all the\nsources of our moral life are poisoned and that the whole fabric of our\ncivic community is founded on the pestiferous soil of falsehood.\n\nVoices of disconcerted Citizens. What is that he says?\n\nPeter Stockmann. Such an insinuation--!\n\nAslaksen (with his hand on his bell). I call upon the speaker to\nmoderate his language.\n\nDr. Stockmann. I have always loved my native town as a man only can\nlove the home of his youthful days. I was not old when I went away from\nhere; and exile, longing and memories cast as it were an additional\nhalo over both the town and its inhabitants. (Some clapping and\napplause.) And there I stayed, for many years, in a horrible hole far\naway up north. When I came into contact with some of the people that\nlived scattered about among the rocks, I often thought it would of been\nmore service to the poor half-starved creatures if a veterinary doctor\nhad been sent up there, instead of a man like me. (Murmurs among the\ncrowd.)\n\nBilling (laying down his pen). I'm damned if I have ever heard--!\n\nHovstad. It is an insult to a respectable population!\n\nDr. Stockmann. Wait a bit! I do not think anyone will charge me with\nhaving forgotten my native town up there. I was like one of the\neider-ducks brooding on its nest, and what I hatched was the plans for\nthese Baths. (Applause and protests.) And then when fate at last\ndecreed for me the great happiness of coming home again--I assure you,\ngentlemen, I thought I had nothing more in the world to wish for. Or\nrather, there was one thing I wished for--eagerly, untiringly,\nardently--and that was to be able to be of service to my native town\nand the good of the community.\n\nPeter Stockmann (looking at the ceiling). You chose a strange way of\ndoing it--ahem!\n\nDr. Stockmann. And so, with my eyes blinded to the real facts, I\nrevelled in happiness. But yesterday morning--no, to be precise, it was\nyesterday afternoon--the eyes of my mind were opened wide, and the\nfirst thing I realised was the colossal stupidity of the authorities--.\n(Uproar, shouts and laughter, MRS. STOCKMANN coughs persistently.)\n\nPeter Stockmann. Mr. Chairman!\n\nAslaksen (ringing his bell). By virtue of my authority--!\n\nDr. Stockmann. It is a petty thing to catch me up on a word, Mr.\nAslaksen. What I mean is only that I got scent of the unbelievable\npiggishness our leading men had been responsible for down at the Baths.\nI can't stand leading men at any price!--I have had enough of such\npeople in my time. They are like billy-goats on a young plantation;\nthey do mischief everywhere. They stand in a free man's way, whichever\nway he turns, and what I should like best would be to see them\nexterminated like any other vermin--. (Uproar.)\n\nPeter Stockmann. Mr. Chairman, can we allow such expressions to pass?\n\nAslaksen (with his hand on his bell). Doctor--!\n\nDr. Stockmann. I cannot understand how it is that I have only now\nacquired a clear conception of what these gentry are, when I had almost\ndaily before my eyes in this town such an excellent specimen of\nthem--my brother Peter--slow-witted and hide-bound in prejudice--.\n(Laughter, uproar and hisses. MRS. STOCKMANN Sits coughing assiduously.\nASLAKSEN rings his bell violently.)\n\nThe Drunken Man (who has got in again). Is it me he is talking about?\nMy name's Petersen, all right--but devil take me if I--\n\nAngry Voices. Turn out that drunken man! Turn him out. (He is turned\nout again.)\n\nPeter Stockmann. Who was that person?\n\n1st Citizen. I don't know who he is, Mr. Mayor.\n\n2nd Citizen. He doesn't belong here.\n\n3rd Citizen. I expect he is a navvy from over at--(the rest is\ninaudible).\n\nAslaksen. He had obviously had too much beer. Proceed, Doctor; but\nplease strive to be moderate in your language.\n\nDr. Stockmann. Very well, gentlemen, I will say no more about our\nleading men. And if anyone imagines, from what I have just said, that\nmy object is to attack these people this evening, he is\nwrong--absolutely wide of the mark. For I cherish the comforting\nconviction that these parasites--all these venerable relics of a dying\nschool of thought--are most admirably paving the way for their own\nextinction; they need no doctor's help to hasten their end. Nor is it\nfolk of that kind who constitute the most pressing danger to the\ncommunity. It is not they who are most instrumental in poisoning the\nsources of our moral life and infecting the ground on which we stand.\nIt is not they who are the most dangerous enemies of truth and freedom\namongst us.\n\nShouts from all sides. Who then? Who is it? Name! Name!\n\nDr. Stockmann. You may depend upon it--I shall name them! That is\nprecisely the great discovery I made yesterday. (Raises his voice.) The\nmost dangerous enemy of truth and freedom amongst us is the compact\nmajority--yes, the damned compact Liberal majority--that is it! Now you\nknow! (Tremendous uproar. Most of the crowd are shouting, stamping and\nhissing. Some of the older men among them exchange stolen glances and\nseem to be enjoying themselves. MRS. STOCKMANN gets up, looking\nanxious. EJLIF and MORTEN advance threateningly upon some schoolboys\nwho are playing pranks. ASLAKSEN rings his bell and begs for silence.\nHOVSTAD and BILLING both talk at once, but are inaudible. At last quiet\nis restored.)\n\nAslaksen. As Chairman, I call upon the speaker to withdraw the\nill-considered expressions he has just used.\n\nDr. Stockmann. Never, Mr. Aslaksen! It is the majority in our community\nthat denies me my freedom and seeks to prevent my speaking the truth.\n\nHovstad. The majority always has right on its side.\n\nBilling. And truth too, by God!\n\nDr. Stockmann. The majority never has right on its side. Never, I say!\nThat is one of these social lies against which an independent,\nintelligent man must wage war. Who is it that constitute the majority\nof the population in a country? Is it the clever folk, or the stupid? I\ndon't imagine you will dispute the fact that at present the stupid\npeople are in an absolutely overwhelming majority all the world over.\nBut, good Lord!--you can never pretend that it is right that the stupid\nfolk should govern the clever ones I (Uproar and cries.) Oh, yes--you\ncan shout me down, I know! But you cannot answer me. The majority has\nmight on its side--unfortunately; but right it has not. I am in the\nright--I and a few other scattered individuals. The minority is always\nin the right. (Renewed uproar.)\n\nHovstad. Aha!--so Dr. Stockmann has become an aristocrat since the day\nbefore yesterday!\n\nDr. Stockmann. I have already said that I don't intend to waste a word\non the puny, narrow-chested, short-winded crew whom we are leaving\nastern. Pulsating life no longer concerns itself with them. I am\nthinking of the few, the scattered few amongst us, who have absorbed\nnew and vigorous truths. Such men stand, as it were, at the outposts,\nso far ahead that the compact majority has not yet been able to come up\nwith them; and there they are fighting for truths that are too\nnewly-born into the world of consciousness to have any considerable\nnumber of people on their side as yet.\n\nHovstad. So the Doctor is a revolutionary now!\n\nDr. Stockmann. Good heavens--of course I am, Mr. Hovstad! I propose to\nraise a revolution against the lie that the majority has the monopoly\nof the truth. What sort of truths are they that the majority usually\nsupports? They are truths that are of such advanced age that they are\nbeginning to break up. And if a truth is as old as that, it is also in\na fair way to become a lie, gentlemen. (Laughter and mocking cries.)\nYes, believe me or not, as you like; but truths are by no means as\nlong-lived at Methuselah--as some folk imagine. A normally constituted\ntruth lives, let us say, as a rule seventeen or eighteen, or at most\ntwenty years--seldom longer. But truths as aged as that are always worn\nfrightfully thin, and nevertheless it is only then that the majority\nrecognises them and recommends them to the community as wholesome moral\nnourishment. There is no great nutritive value in that sort of fare, I\ncan assure you; and, as a doctor, I ought to know. These \"majority\ntruths\" are like last year's cured meat--like rancid, tainted ham; and\nthey are the origin of the moral scurvy that is rampant in our\ncommunities.\n\nAslaksen. It appears to me that the speaker is wandering a long way\nfrom his subject.\n\nPeter Stockmann. I quite agree with the Chairman.\n\nDr. Stockmann. Have you gone clean out of your senses, Peter? I am\nsticking as closely to my subject as I can; for my subject is precisely\nthis, that it is the masses, the majority--this infernal compact\nmajority--that poisons the sources of our moral life and infects the\nground we stand on.\n\nHovstad. And all this because the great, broadminded majority of the\npeople is prudent enough to show deference only to well-ascertained and\nwell-approved truths?\n\nDr. Stockmann. Ah, my good Mr. Hovstad, don't talk nonsense about\nwell-ascertained truths! The truths of which the masses now approve are\nthe very truths that the fighters at the outposts held to in the days\nof our grandfathers. We fighters at the outposts nowadays no longer\napprove of them; and I do not believe there is any other\nwell-ascertained truth except this, that no community can live a\nhealthy life if it is nourished only on such old marrowless truths.\n\nHovstad. But, instead of standing there using vague generalities, it\nwould be interesting if you would tell us what these old marrowless\ntruths are, that we are nourished on.\n\n(Applause from many quarters.)\n\nDr. Stockmann. Oh, I could give you a whole string of such\nabominations; but to begin with I will confine myself to one\nwell-approved truth, which at bottom is a foul lie, but upon which\nnevertheless Mr. Hovstad and the \"People's Messenger\" and all the\n\"Messenger's\" supporters are nourished.\n\nHovstad. And that is--?\n\nDr. Stockmann. That is, the doctrine you have inherited from your\nforefathers and proclaim thoughtlessly far and wide--the doctrine that\nthe public, the crowd, the masses, are the essential part of the\npopulation--that they constitute the People--that the common folk, the\nignorant and incomplete element in the community, have the same right\nto pronounce judgment and to, approve, to direct and to govern, as the\nisolated, intellectually superior personalities in it.\n\nBilling. Well, damn me if ever I--\n\nHovstad (at the same time, shouting out). Fellow-citizens, take good\nnote of that!\n\nA number of voices (angrily). Oho!--we are not the People! Only the\nsuperior folk are to govern, are they!\n\nA Workman. Turn the fellow out for talking such rubbish!\n\nAnother. Out with him!\n\nAnother (calling out). Blow your horn, Evensen!\n\n(A horn is blown loudly, amidst hisses and an angry uproar.)\n\nDr. Stockmann (when the noise has somewhat abated). Be reasonable!\nCan't you stand hearing the voice of truth for once? I don't in the\nleast expect you to agree with me all at once; but I must say I did\nexpect Mr. Hovstad to admit I was right, when he had recovered his\ncomposure a little. He claims to be a freethinker--\n\nVoices (in murmurs of astonishment). Freethinker, did he say? Is\nHovstad a freethinker?\n\nHovstad (shouting). Prove it, Dr. Stockmann! When have I said so in\nprint?\n\nDr. Stockmann (reflecting). No, confound it, you are right!--you have\nnever had the courage to. Well, I won't put you in a hole, Mr. Hovstad.\nLet us say it is I that am the freethinker, then. I am going to prove\nto you, scientifically, that the \"People's Messenger\" leads you by the\nnose in a shameful manner when it tells you that you--that the common\npeople, the crowd, the masses, are the real essence of the People. That\nis only a newspaper lie, I tell you! The common people are nothing more\nthan the raw material of which a People is made. (Groans, laughter and\nuproar.) Well, isn't that the case? Isn't there an enormous difference\nbetween a well-bred and an ill-bred strain of animals? Take, for\ninstance, a common barn-door hen. What sort of eating do you get from a\nshrivelled up old scrag of a fowl like that? Not much, do you! And what\nsort of eggs does it lay? A fairly good crow or a raven can lay pretty\nnearly as good an egg. But take a well-bred Spanish or Japanese hen, or\na good pheasant or a turkey--then you will see the difference. Or take\nthe case of dogs, with whom we humans are on such intimate terms. Think\nfirst of an ordinary common cur--I mean one of the horrible,\ncoarse-haired, low-bred curs that do nothing but run about the streets\nand befoul the walls of the houses. Compare one of these curs with a\npoodle whose sires for many generations have been bred in a gentleman's\nhouse, where they have had the best of food and had the opportunity of\nhearing soft voices and music. Do you not think that the poodle's brain\nis developed to quite a different degree from that of the cur? Of\ncourse it is. It is puppies of well-bred poodles like that, that\nshowmen train to do incredibly clever tricks--things that a common cur\ncould never learn to do even if it stood on its head. (Uproar and\nmocking cries.)\n\nA Citizen (calls out). Are you going to make out we are dogs, now?\n\nAnother Citizen. We are not animals, Doctor!\n\nDr. Stockmann. Yes but, bless my soul, we are, my friend! It is true we\nare the finest animals anyone could wish for; but, even among us,\nexceptionally fine animals are rare. There is a tremendous difference\nbetween poodle-men and cur-men. And the amusing part of it is, that Mr.\nHovstad quite agrees with me as long as it is a question of four-footed\nanimals--\n\nHovstad. Yes, it is true enough as far as they are concerned.\n\nDr. Stockmann. Very well. But as soon as I extend the principle and\napply it to two-legged animals, Mr. Hovstad stops short. He no longer\ndares to think independently, or to pursue his ideas to their logical\nconclusion; so, he turns the whole theory upside down and proclaims in\nthe \"People's Messenger\" that it is the barn-door hens and street curs\nthat are the finest specimens in the menagerie. But that is always the\nway, as long as a man retains the traces of common origin and has not\nworked his way up to intellectual distinction.\n\nHovstad. I lay no claim to any sort of distinction, I am the son of\nhumble country-folk, and I am proud that the stock I come from is\nrooted deep among the common people he insults.\n\nVoices. Bravo, Hovstad! Bravo! Bravo!\n\nDr. Stockmann. The kind of common people I mean are not only to be\nfound low down in the social scale; they crawl and swarm all around\nus--even in the highest social positions. You have only to look at your\nown fine, distinguished Mayor! My brother Peter is every bit as\nplebeian as anyone that walks in two shoes-- (laughter and hisses)\n\nPeter Stockmann. I protest against personal allusions of this kind.\n\nDr. Stockmann (imperturbably).--and that, not because he is like\nmyself, descended from some old rascal of a pirate from Pomerania or\nthereabouts--because that is who we are descended from--\n\nPeter Stockmann. An absurd legend. I deny it!\n\nDr. Stockmann. --but because he thinks what his superiors think, and\nholds the same opinions as they, People who do that are, intellectually\nspeaking, common people; and, that is why my magnificent brother Peter\nis in reality so very far from any distinction--and consequently also\nso far from being liberal-minded.\n\nPeter Stockmann. Mr. Chairman--!\n\nHovstad. So it is only the distinguished men that are liberal-minded in\nthis country? We are learning something quite new! (Laughter.)\n\nDr. Stockmann. Yes, that is part of my new discovery too. And another\npart of it is that broad-mindedness is almost precisely the same thing\nas morality. That is why I maintain that it is absolutely inexcusable\nin the \"People's Messenger\" to proclaim, day in and day out, the false\ndoctrine that it is the masses, the crowd, the compact majority, that\nhave the monopoly of broad-mindedness and morality--and that vice and\ncorruption and every kind of intellectual depravity are the result of\nculture, just as all the filth that is draining into our Baths is the\nresult of the tanneries up at Molledal! (Uproar and interruptions. DR.\nSTOCKMANN is undisturbed, and goes on, carried away by his ardour, with\na smile.) And yet this same \"People's Messenger\" can go on preaching\nthat the masses ought to be elevated to higher conditions of life! But,\nbless my soul, if the \"Messenger's\" teaching is to be depended upon,\nthis very raising up the masses would mean nothing more or less than\nsetting them straightway upon the paths of depravity! Happily the\ntheory that culture demoralises is only an old falsehood that our\nforefathers believed in and we have inherited. No, it is ignorance,\npoverty, ugly conditions of life, that do the devil's work! In a house\nwhich does not get aired and swept every day--my wife Katherine\nmaintains that the floor ought to be scrubbed as well, but that is a\ndebatable question--in such a house, let me tell you, people will lose\nwithin two or three years the power of thinking or acting in a moral\nmanner. Lack of oxygen weakens the conscience. And there must be a\nplentiful lack of oxygen in very many houses in this town, I should\nthink, judging from the fact that the whole compact majority can be\nunconscientious enough to wish to build the town's prosperity on a\nquagmire of falsehood and deceit.\n\nAslaksen. We cannot allow such a grave accusation to be flung at a\ncitizen community.\n\nA Citizen. I move that the Chairman direct the speaker to sit down.\n\nVoices (angrily). Hear, hear! Quite right! Make him sit down!\n\nDr. Stockmann (losing his self-control). Then I will go and shout the\ntruth at every street corner! I will write it in other towns'\nnewspapers! The whole country shall know what is going on here!\n\nHovstad. It almost seems as if Dr. Stockmann's intention were to ruin\nthe town.\n\nDr. Stockmann. Yes, my native town is so dear to me that I would rather\nruin it than see it flourishing upon a lie.\n\nAslaksen. This is really serious. (Uproar and cat-calls MRS. STOCKMANN\ncoughs, but to no purpose; her husband does not listen to her any\nlonger.)\n\nHovstad (shouting above the din). A man must be a public enemy to wish\nto ruin a whole community!\n\nDr. Stockmann (with growing fervor). What does the destruction of a\ncommunity matter, if it lives on lies? It ought to be razed to the\nground. I tell you-- All who live by lies ought to be exterminated like\nvermin! You will end by infecting the whole country; you will bring\nabout such a state of things that the whole country will deserve to be\nruined. And if things come to that pass, I shall say from the bottom of\nmy heart: Let the whole country perish, let all these people be\nexterminated!\n\nVoices from the crowd. That is talking like an out-and-out enemy of the\npeople!\n\nBilling. There sounded the voice of the people, by all that's holy!\n\nThe whole crowd (shouting). Yes, yes! He is an enemy of the people! He\nhates his country! He hates his own people!\n\nAslaksen. Both as a citizen and as an individual, I am profoundly\ndisturbed by what we have had to listen to. Dr. Stockmann has shown\nhimself in a light I should never have dreamed of. I am unhappily\nobliged to subscribe to the opinion which I have just heard my\nestimable fellow-citizens utter; and I propose that we should give\nexpression to that opinion in a resolution. I propose a resolution as\nfollows: \"This meeting declares that it considers Dr. Thomas Stockmann,\nMedical Officer of the Baths, to be an enemy of the people.\" (A storm\nof cheers and applause. A number of men surround the DOCTOR and hiss\nhim. MRS. STOCKMANN and PETRA have got up from their seats. MORTEN and\nEJLIF are fighting the other schoolboys for hissing; some of their\nelders separate them.)\n\nDr. Stockmann (to the men who are hissing him). Oh, you fools! I tell\nyou that--\n\nAslaksen (ringing his bell). We cannot hear you now, Doctor. A formal\nvote is about to be taken; but, out of regard for personal feelings, it\nshall be by ballot and not verbal. Have you any clean paper, Mr.\nBilling?\n\nBilling. I have both blue and white here.\n\nAslaksen (going to him). That will do nicely; we shall get on more\nquickly that way. Cut it up into small strips--yes, that's it. (To the\nmeeting.) Blue means no; white means yes. I will come round myself and\ncollect votes. (PETER STOCKMANN leaves the hall. ASLAKSEN and one or\ntwo others go round the room with the slips of paper in their hats.)\n\n1st Citizen (to HOVSTAD). I say, what has come to the Doctor? What are\nwe to think of it?\n\nHovstad. Oh, you know how headstrong he is.\n\n2nd Citizen (to BILLING). Billing, you go to their house--have you ever\nnoticed if the fellow drinks?\n\nBilling. Well I'm hanged if I know what to say. There are always\nspirits on the table when you go.\n\n3rd Citizen. I rather think he goes quite off his head sometimes.\n\n1st Citizen. I wonder if there is any madness in his family?\n\nBilling. I shouldn't wonder if there were.\n\n4th Citizen. No, it is nothing more than sheer malice; he wants to get\neven with somebody for something or other.\n\nBilling. Well certainly he suggested a rise in his salary on one\noccasion lately, and did not get it.\n\nThe Citizens (together). Ah!--then it is easy to understand how it is!\n\nThe Drunken Man (who has got among the audience again). I want a blue\none, I do! And I want a white one too!\n\nVoices. It's that drunken chap again! Turn him out!\n\nMorten Kiil. (going up to DR. STOCKMANN). Well, Stockmann, do you see\nwhat these monkey tricks of yours lead to?\n\nDr. Stockmann. I have done my duty.\n\nMorten Kiil. What was that you said about the tanneries at Molledal?\n\nDr. Stockmann. You heard well enough. I said they were the source of\nall the filth.\n\nMorten Kiil. My tannery too?\n\nDr. Stockmann. Unfortunately your tannery is by far the worst.\n\nMorten Kiil. Are you going to put that in the papers?\n\nDr. Stockmann. I shall conceal nothing.\n\nMorten Kiil. That may cost you dearly, Stockmann. (Goes out.)\n\nA Stout Man (going UP to CAPTAIN HORSTER, Without taking any notice of\nthe ladies). Well, Captain, so you lend your house to enemies of the\npeople?\n\nHorster. I imagine I can do what I like with my own possessions, Mr.\nVik.\n\nThe Stout Man. Then you can have no objection to my doing the same with\nmine.\n\nHorster. What do you mean, sir?\n\nThe Stout Man. You shall hear from me in the morning. (Turns his back\non him and moves off.)\n\nPetra. Was that not your owner, Captain Horster?\n\nHorster. Yes, that was Mr. Vik the shipowner.\n\nAslaksen (with the voting-papers in his hands, gets up on to the\nplatform and rings his bell). Gentlemen, allow me to announce the\nresult. By the votes of every one here except one person--\n\nA Young Man. That is the drunk chap!\n\nAslaksen. By the votes of everyone here except a tipsy man, this\nmeeting of citizens declares Dr. Thomas Stockmann to be an enemy of the\npeople. (Shouts and applause.) Three cheers for our ancient and\nhonourable citizen community! (Renewed applause.) Three cheers for our\nable and energetic Mayor, who has so loyally suppressed the promptings\nof family feeling! (Cheers.) The meeting is dissolved. (Gets down.)\n\nBilling. Three cheers for the Chairman!\n\nThe whole crowd. Three cheers for Aslaksen! Hurrah!\n\nDr. Stockmann. My hat and coat, Petra! Captain, have you room on your\nship for passengers to the New World?\n\nHorster. For you and yours we will make room, Doctor.\n\nDr. Stockmann (as PETRA helps him into his coat), Good. Come,\nKatherine! Come, boys!\n\nMrs. Stockmann (in an undertone). Thomas, dear, let us go out by the\nback way.\n\nDr. Stockmann. No back ways for me, Katherine, (Raising his voice.) You\nwill hear more of this enemy of the people, before he shakes the dust\noff his shoes upon you! I am not so forgiving as a certain Person; I do\nnot say: \"I forgive you, for ye know not what ye do.\"\n\nAslaksen (shouting). That is a blasphemous comparison, Dr. Stockmann!\n\nBilling. It is, by God! It's dreadful for an earnest man to listen to.\n\nA Coarse Voice. Threatens us now, does he!\n\nOther Voices (excitedly). Let's go and break his windows! Duck him in\nthe fjord!\n\nAnother Voice. Blow your horn, Evensen! Pip, pip!\n\n(Horn-blowing, hisses, and wild cries. DR. STOCKMANN goes out through\nthe hall with his family, HORSTER elbowing a way for them.)\n\nThe Whole Crowd (howling after them as they go). Enemy of the People!\nEnemy of the People!\n\nBilling (as he puts his papers together). Well, I'm damned if I go and\ndrink toddy with the Stockmanns tonight!\n\n(The crowd press towards the exit. The uproar continues outside; shouts\nof \"Enemy of the People!\" are heard from without.)\n\n\n\n\nACT V\n\n\n(SCENE.--DR. STOCKMANN'S study. Bookcases and cabinets containing\nspecimens, line the walls. At the back is a door leading to the hall;\nin the foreground on the left, a door leading to the sitting-room. In\nthe righthand wall are two windows, of which all the panes are broken.\nThe DOCTOR'S desk, littered with books and papers, stands in the middle\nof the room, which is in disorder. It is morning. DR. STOCKMANN in\ndressing-gown, slippers and a smoking-cap, is bending down and raking\nwith an umbrella under one of the cabinets. After a little while he\nrakes out a stone.)\n\nDr. Stockmann (calling through the open sitting-room door). Katherine,\nI have found another one.\n\nMrs. Stockmann (from the sitting-room). Oh, you will find a lot more\nyet, I expect.\n\nDr. Stockmann (adding the stone to a heap of others on the table). I\nshall treasure these stones as relics. Ejlif and Morten shall look at\nthem every day, and when they are grown up they shall inherit them as\nheirlooms. (Rakes about under a bookcase.) Hasn't--what the deuce is\nher name?--the girl, you know--hasn't she been to fetch the glazier yet?\n\nMrs. Stockmann (coming in). Yes, but he said he didn't know if he would\nbe able to come today.\n\nDr. Stockmann. You will see he won't dare to come.\n\nMrs. Stockmann. Well, that is just what Randine thought--that he didn't\ndare to, on account of the neighbours. (Calls into the sitting-room.)\nWhat is it you want, Randine? Give it to me. (Goes in, and comes out\nagain directly.) Here is a letter for you, Thomas.\n\nDr. Stockmann. Let me see it. (Opens and reads it.) Ah!--of course.\n\nMrs. Stockmann. Who is it from?\n\nDr. Stockmann. From the landlord. Notice to quit.\n\nMrs. Stockmann. Is it possible? Such a nice man\n\nDr. Stockmann (looking at the letter). Does not dare do otherwise, he\nsays. Doesn't like doing it, but dare not do otherwise--on account of\nhis fellow-citizens--out of regard for public opinion. Is in a\ndependent position--dares not offend certain influential men.\n\nMrs. Stockmann. There, you see, Thomas!\n\nDr. Stockmann. Yes, yes, I see well enough; the whole lot of them in\nthe town are cowards; not a man among them dares do anything for fear\nof the others. (Throws the letter on to the table.) But it doesn't\nmatter to us, Katherine. We are going to sail away to the New World,\nand--\n\nMrs. Stockmann. But, Thomas, are you sure we are well advised to take\nthis step?\n\nDr. Stockmann. Are you suggesting that I should stay here, where they\nhave pilloried me as an enemy of the people--branded me--broken my\nwindows! And just look here, Katherine--they have torn a great rent in\nmy black trousers too!\n\nMrs. Stockmann. Oh, dear!--and they are the best pair you have got!\n\nDr. Stockmann. You should never wear your best trousers when you go out\nto fight for freedom and truth. It is not that I care so much about the\ntrousers, you know; you can always sew them up again for me. But that\nthe common herd should dare to make this attack on me, as if they were\nmy equals--that is what I cannot, for the life of me, swallow!\n\nMrs. Stockmann. There is no doubt they have behaved very ill toward\nyou, Thomas; but is that sufficient reason for our leaving our native\ncountry for good and all?\n\nDr. Stockmann. If we went to another town, do you suppose we should not\nfind the common people just as insolent as they are here? Depend upon\nit, there is not much to choose between them. Oh, well, let the curs\nsnap--that is not the worst part of it. The worst is that, from one end\nof this country to the other, every man is the slave of his Party.\nAlthough, as far as that goes, I daresay it is not much better in the\nfree West either; the compact majority, and liberal public opinion, and\nall that infernal old bag of tricks are probably rampant there too. But\nthere things are done on a larger scale, you see. They may kill you,\nbut they won't put you to death by slow torture. They don't squeeze a\nfree man's soul in a vice, as they do here. And, if need be, one can\nlive in solitude. (Walks up and down.) If only I knew where there was a\nvirgin forest or a small South Sea island for sale, cheap--\n\nMrs. Stockmann. But think of the boys, Thomas!\n\nDr. Stockmann (standing still). What a strange woman you are,\nKatherine! Would you prefer to have the boys grow up in a society like\nthis? You saw for yourself last night that half the population are out\nof their minds; and if the other half have not lost their senses, it is\nbecause they are mere brutes, with no sense to lose.\n\nMrs. Stockmann. But, Thomas dear, the imprudent things you said had\nsomething to do with it, you know.\n\nDr. Stockmann. Well, isn't what I said perfectly true? Don't they turn\nevery idea topsy-turvy? Don't they make a regular hotchpotch of right\nand wrong? Don't they say that the things I know are true, are lies?\nThe craziest part of it all is the fact of these \"liberals,\" men of\nfull age, going about in crowds imagining that they are the\nbroad-minded party! Did you ever hear anything like it, Katherine!\n\nMrs. Stockmann. Yes, yes, it's mad enough of them, certainly;\nbut--(PETRA comes in from the silting-room). Back from school already?\n\nPetra. Yes. I have been given notice of dismissal.\n\nMrs. Stockmann. Dismissal?\n\nDr. Stockmann. You too?\n\nPetra. Mrs. Busk gave me my notice; so I thought it was best to go at\nonce.\n\nDr. Stockmann. You were perfectly right, too!\n\nMrs. Stockmann. Who would have thought Mrs. Busk was a woman like that!\n\nPetra. Mrs. Busk isn't a bit like that, mother; I saw quite plainly how\nit hurt her to do it. But she didn't dare do otherwise, she said; and\nso I got my notice.\n\nDr. Stockmann (laughing and rubbing his hands). She didn't dare do\notherwise, either! It's delicious!\n\nMrs. Stockmann. Well, after the dreadful scenes last night--\n\nPetra. It was not only that. Just listen to this, father!\n\nDr. Stockmann. Well?\n\nPetra. Mrs. Busk showed me no less than three letters she received this\nmorning--\n\nDr. Stockmann. Anonymous, I suppose?\n\nPetra. Yes.\n\nDr. Stockmann. Yes, because they didn't dare to risk signing their\nnames, Katherine!\n\nPetra. And two of them were to the effect that a man, who has been our\nguest here, was declaring last night at the Club that my views on\nvarious subjects are extremely emancipated--\n\nDr. Stockmann. You did not deny that, I hope?\n\nPetra. No, you know I wouldn't. Mrs. Busk's own views are tolerably\nemancipated, when we are alone together; but now that this report about\nme is being spread, she dare not keep me on any longer.\n\nMrs. Stockmann. And someone who had been a guest of ours! That shows\nyou the return you get for your hospitality, Thomas!\n\nDr. Stockmann. We won't live in such a disgusting hole any longer. Pack\nup as quickly as you can, Katherine; the sooner we can get away, the\nbetter.\n\nMrs. Stockmann. Be quiet--I think I hear someone in the hall. See who\nit is, Petra.\n\nPetra (opening the door). Oh, it's you, Captain Horster! Do come in.\n\nHorster (coming in). Good morning. I thought I would just come in and\nsee how you were.\n\nDr. Stockmann (shaking his hand). Thanks--that is really kind of you.\n\nMrs. Stockmann. And thank you, too, for helping us through the crowd,\nCaptain Horster.\n\nPetra. How did you manage to get home again?\n\nHorster. Oh, somehow or other. I am fairly strong, and there is more\nsound than fury about these folk.\n\nDr. Stockmann. Yes, isn't their swinish cowardice astonishing? Look\nhere, I will show you something! There are all the stones they have\nthrown through my windows. Just look at them! I'm hanged if there are\nmore than two decently large bits of hard stone in the whole heap; the\nrest are nothing but gravel--wretched little things. And yet they stood\nout there bawling and swearing that they would do me some violence; but\nas for doing anything--you don't see much of that in this town.\n\nHorster. Just as well for you this time, doctor!\n\nDr. Stockmann. True enough. But it makes one angry all the same;\nbecause if some day it should be a question of a national fight in real\nearnest, you will see that public opinion will be in favour of taking\nto one's heels, and the compact majority will turn tail like a flock of\nsheep, Captain Horster. That is what is so mournful to think of; it\ngives me so much concern, that--. No, devil take it, it is ridiculous\nto care about it! They have called me an enemy of the people, so an\nenemy of the people let me be!\n\nMrs. Stockmann. You will never be that, Thomas.\n\nDr. Stockmann. Don't swear to that, Katherine. To be called an ugly\nname may have the same effect as a pin-scratch in the lung. And that\nhateful name--I can't get quit of it. It is sticking here in the pit of\nmy stomach, eating into me like a corrosive acid. And no magnesia will\nremove it.\n\nPetra. Bah!--you should only laugh at them, father,\n\nHorster. They will change their minds some day, Doctor.\n\nMrs. Stockmann. Yes, Thomas, as sure as you are standing here.\n\nDr. Stockmann. Perhaps, when it is too late. Much good may it do them!\nThey may wallow in their filth then and rue the day when they drove a\npatriot into exile. When do you sail, Captain Horster?\n\nHorster. Hm!--that was just what I had come to speak about--\n\nDr. Stockmann. Why, has anything gone wrong with the ship?\n\nHorster. No; but what has happened is that I am not to sail in it.\n\nPetra. Do you mean that you have been dismissed from your command?\n\nHorster (smiling). Yes, that's just it.\n\nPetra. You too.\n\nMrs. Stockmann. There, you see, Thomas!\n\nDr. Stockmann. And that for the truth's sake! Oh, if I had thought such\na thing possible--\n\nHorster. You mustn't take it to heart; I shall be sure to find a job\nwith some ship-owner or other, elsewhere.\n\nDr. Stockmann. And that is this man Vik--a wealthy man, independent of\neveryone and everything--! Shame on him!\n\nHorster. He is quite an excellent fellow otherwise; he told me himself\nhe would willingly have kept me on, if only he had dared--\n\nDr. Stockmann. But he didn't dare? No, of course not.\n\nHorster. It is not such an easy matter, he said, for a party man--\n\nDr. Stockmann. The worthy man spoke the truth. A party is like a\nsausage machine; it mashes up all sorts of heads together into the same\nmincemeat--fatheads and blockheads, all in one mash!\n\nMrs. Stockmann. Come, come, Thomas dear!\n\nPetra (to HORSTER). If only you had not come home with us, things might\nnot have come to this pass.\n\nHorster. I do not regret it.\n\nPetra (holding out her hand to him). Thank you for that!\n\nHorster (to DR. STOCKMANN). And so what I came to say was that if you\nare determined to go away, I have thought of another plan--\n\nDr. Stockmann. That's splendid!--if only we can get away at once.\n\nMrs. Stockmann. Hush!--wasn't that some one knocking?\n\nPetra. That is uncle, surely.\n\nDr. Stockmann. Aha! (Calls out.) Come in!\n\nMrs. Stockmann. Dear Thomas, promise me definitely--. (PETER STOCKMANN\ncomes in from the hall.)\n\nPeter Stockmann. Oh, you are engaged. In that case, I will--\n\nDr. Stockmann. No, no, come in.\n\nPeter Stockmann. But I wanted to speak to you alone.\n\nMrs. Stockmann. We will go into the sitting-room in the meanwhile.\n\nHorster. And I will look in again later.\n\nDr. Stockmann. No, go in there with them, Captain Horster; I want to\nhear more about--.\n\nHorster. Very well, I will wait, then. (He follows MRS. STOCKMANN and\nPETRA into the sitting-room.)\n\nDr. Stockmann. I daresay you find it rather draughty here today. Put\nyour hat on.\n\nPeter Stockmann. Thank you, if I may. (Does so.) I think I caught cold\nlast night; I stood and shivered--\n\nDr. Stockmann. Really? I found it warm enough.\n\nPeter Stockmann. I regret that it was not in my power to prevent those\nexcesses last night.\n\nDr. Stockmann. Have you anything in particular to say to me besides\nthat?\n\nPeter Stockmann (taking a big letter from his pocket). I have this\ndocument for you, from the Baths Committee.\n\nDr. Stockmann. My dismissal?\n\nPeter Stockmann. Yes, dating from today. (Lays the letter on the\ntable.) It gives us pain to do it; but, to speak frankly, we dared not\ndo otherwise on account of public opinion.\n\nDr. Stockmann (smiling). Dared not? I seem to have heard that word\nbefore, today.\n\nPeter Stockmann. I must beg you to understand your position clearly.\nFor the future you must not count on any practice whatever in the town.\n\nDr. Stockmann. Devil take the practice! But why are you so sure of that?\n\nPeter Stockmann. The Householders' Association is circulating a list\nfrom house to house. All right-minded citizens are being called upon to\ngive up employing you; and I can assure you that not a single head of a\nfamily will risk refusing his signature. They simply dare not.\n\nDr. Stockmann. No, no; I don't doubt it. But what then?\n\nPeter Stockmann. If I might advise you, it would be best to leave the\nplace for a little while--\n\nDr. Stockmann. Yes, the propriety of leaving the place has occurred to\nme.\n\nPeter Stockmann. Good. And then, when you have had six months to think\nthings over, if, after mature consideration, you can persuade yourself\nto write a few words of regret, acknowledging your error--\n\nDr. Stockmann. I might have my appointment restored to me, do you mean?\n\nPeter Stockmann. Perhaps. It is not at all impossible.\n\nDr. Stockmann. But what about public opinion, then? Surely you would\nnot dare to do it on account of public feeling...\n\nPeter Stockmann. Public opinion is an extremely mutable thing. And, to\nbe quite candid with you, it is a matter of great importance to us to\nhave some admission of that sort from you in writing.\n\nDr. Stockmann. Oh, that's what you are after, is it! I will just\ntrouble you to remember what I said to you lately about foxy tricks of\nthat sort!\n\nPeter Stockmann. Your position was quite different then. At that time\nyou had reason to suppose you had the whole town at your back--\n\nDr. Stockmann. Yes, and now I feel I have the whole town ON my\nback--(flaring up). I would not do it if I had the devil and his dam on\nmy back--! Never--never, I tell you!\n\nPeter Stockmann. A man with a family has no right to behave as you do.\nYou have no right to do it, Thomas.\n\nDr. Stockmann. I have no right! There is only one single thing in the\nworld a free man has no right to do. Do you know what that is?\n\nPeter Stockmann. No.\n\nDr. Stockmann. Of course you don't, but I will tell you. A free man has\nno right to soil himself with filth; he has no right to behave in a way\nthat would justify his spitting in his own face.\n\nPeter Stockmann. This sort of thing sounds extremely plausible, of\ncourse; and if there were no other explanation for your obstinacy--.\nBut as it happens that there is.\n\nDr. Stockmann. What do you mean?\n\nPeter Stockmann. You understand, very well what I mean. But, as your\nbrother and as a man of discretion, I advise you not to build too much\nupon expectations and prospects that may so very easily fail you.\n\nDr. Stockmann. What in the world is all this about?\n\nPeter Stockmann. Do you really ask me to believe that you are ignorant\nof the terms of Mr. Kiil's will?\n\nDr. Stockmann. I know that the small amount he possesses is to go to an\ninstitution for indigent old workpeople. How does that concern me?\n\nPeter Stockmann. In the first place, it is by no means a small amount\nthat is in question. Mr. Kiil is a fairly wealthy man.\n\nDr. Stockmann. I had no notion of that!\n\nPeter Stockmann. Hm!--hadn't you really? Then I suppose you had no\nnotion, either, that a considerable portion of his wealth will come to\nyour children, you and your wife having a life-rent of the capital. Has\nhe never told you so?\n\nDr. Stockmann. Never, on my honour! Quite the reverse; he has\nconsistently done nothing but fume at being so unconscionably heavily\ntaxed. But are you perfectly certain of this, Peter?\n\nPeter Stockmann. I have it from an absolutely reliable source.\n\nDr. Stockmann. Then, thank God, Katherine is provided for--and the\nchildren too! I must tell her this at once--(calls out) Katherine,\nKatherine!\n\nPeter Stockmann (restraining him). Hush, don't say a word yet!\n\nMrs. Stockmann (opening the door). What is the matter?\n\nDr. Stockmann. Oh, nothing, nothing; you can go back. (She shuts the\ndoor. DR. STOCKMANN walks up and down in his excitement.) Provided\nfor!--Just think of it, we are all provided for! And for life! What a\nblessed feeling it is to know one is provided for!\n\nPeter Stockmann. Yes, but that is just exactly what you are not. Mr.\nKiil can alter his will any day he likes.\n\nDr. Stockmann. But he won't do that, my dear Peter. The \"Badger\" is\nmuch too delighted at my attack on you and your wise friends.\n\nPeter Stockmann (starts and looks intently at him). Ali, that throws a\nlight on various things.\n\nDr. Stockmann. What things?\n\nPeter Stockmann. I see that the whole thing was a combined manoeuvre on\nyour part and his. These violent, reckless attacks that you have made\nagainst the leading men of the town, under the pretence that it was in\nthe name of truth--\n\nDr. Stockmann. What about them?\n\nPeter Stockmann. I see that they were nothing else than the stipulated\nprice for that vindictive old man's will.\n\nDr. Stockmann (almost speechless). Peter--you are the most disgusting\nplebeian I have ever met in all my life.\n\nPeter Stockmann. All is over between us. Your dismissal is\nirrevocable--we have a weapon against you now. (Goes out.)\n\nDr. Stockmann. For shame! For shame! (Calls out.) Katherine, you must\nhave the floor scrubbed after him! Let--what's her name--devil take it,\nthe girl who has always got soot on her nose--\n\nMrs. Stockmann. (in the sitting-room). Hush, Thomas, be quiet!\n\nPetra (coming to the door). Father, grandfather is here, asking if he\nmay speak to you alone.\n\nDr. Stockmann. Certainly he may. (Going to the door.) Come in, Mr.\nKiil. (MORTEN KIIL comes in. DR. STOCKMANN shuts the door after him.)\nWhat can I do for you? Won't you sit down?\n\nMorten Kiil. I won't sit. (Looks around.) You look very comfortable\nhere today, Thomas.\n\nDr. Stockmann. Yes, don't we!\n\nMorten Kiil. Very comfortable--plenty of fresh air. I should think you\nhave got enough to-day of that oxygen you were talking about yesterday.\nYour conscience must be in splendid order to-day, I should think.\n\nDr. Stockmann. It is.\n\nMorten Kiil. So I should think. (Taps his chest.) Do you know what I\nhave got here?\n\nDr. Stockmann. A good conscience, too, I hope.\n\nMorten Kiil. Bah!--No, it is something better than that. (He takes a\nthick pocket-book from his breast-pocket, opens it, and displays a\npacket of papers.)\n\nDr. Stockmann (looking at him in astonishment). Shares in the Baths?\n\nMorten Kiil. They were not difficult to get today.\n\nDr. Stockmann. And you have been buying--?\n\nMorten Kiil. As many as I could pay for.\n\nDr. Stockmann. But, my dear Mr. Kiil--consider the state of the Baths'\naffairs!\n\nMorten Kiil. If you behave like a reasonable man, you can soon set the\nBaths on their feet again.\n\nDr. Stockmann. Well, you can see for yourself that I have done all I\ncan, but--. They are all mad in this town!\n\nMorten Kiil. You said yesterday that the worst of this pollution came\nfrom my tannery. If that is true, then my grandfather and my father\nbefore me, and I myself, for many years past, have been poisoning the\ntown like three destroying angels. Do you think I am going to sit quiet\nunder that reproach?\n\nDr. Stockmann. Unfortunately I am afraid you will have to.\n\nMorten Kiil. No, thank you. I am jealous of my name and reputation.\nThey call me \"the Badger,\" I am told. A badger is a kind of pig, I\nbelieve; but I am not going to give them the right to call me that. I\nmean to live and die a clean man.\n\nDr. Stockmann. And how are you going to set about it?\n\nMorten Kiil. You shall cleanse me, Thomas.\n\nDr. Stockmann. I!\n\nMorten Kiil. Do you know what money I have bought these shares with?\nNo, of course you can't know--but I will tell you. It is the money that\nKatherine and Petra and the boys will have when I am gone. Because I\nhave been able to save a little bit after all, you know.\n\nDr. Stockmann (flaring up). And you have gone and taken Katherine's\nmoney for this!\n\nMorten Kiil. Yes, the whole of the money is invested in the Baths now.\nAnd now I just want to see whether you are quite stark, staring mad,\nThomas! If you still make out that these animals and other nasty things\nof that sort come from my tannery, it will be exactly as if you were to\nflay broad strips of skin from Katherine's body, and Petra's, and the\nboys'; and no decent man would do that--unless he were mad.\n\nDr. Stockmann (walking up and down). Yes, but I am mad; I am mad!\n\nMorten Kiil. You cannot be so absurdly mad as all that, when it is a\nquestion of your wife and children.\n\nDr. Stockmann (standing still in front of him). Why couldn't you\nconsult me about it, before you went and bought all that trash?\n\nMorten Kiil. What is done cannot be undone.\n\nDr. Stockmann (walks about uneasily). If only I were not so certain\nabout it--! But I am absolutely convinced that I am right.\n\nMorten Kiil (weighing the pocket-book in his hand). If you stick to\nyour mad idea, this won't be worth much, you know. (Puts the\npocket-book in his pocket.)\n\nDr. Stockmann. But, hang it all! It might be possible for science to\ndiscover some prophylactic, I should think--or some antidote of some\nkind--\n\nMorten Kiil. To kill these animals, do you mean?\n\nDr. Stockmann. Yes, or to make them innocuous.\n\nMorten Kiil. Couldn't you try some rat's-bane?\n\nDr. Stockmann. Don't talk nonsense! They all say it is only\nimagination, you know. Well, let it go at that! Let them have their own\nway about it! Haven't the ignorant, narrow-minded curs reviled me as an\nenemy of the people?--and haven't they been ready to tear the clothes\noff my back too?\n\nMorten Kiil. And broken all your windows to pieces!\n\nDr. Stockmann. And then there is my duty to my family. I must talk it\nover with Katherine; she is great on those things.\n\nMorten Kiil. That is right; be guided by a reasonable woman's advice.\n\nDr. Stockmann (advancing towards him). To think you could do such a\npreposterous thing!  Risking Katherine's money in this way, and putting\nme in such a horribly painful dilemma! When I look at you, I think I\nsee the devil himself--.\n\nMorten Kiil. Then I had better go. But I must have an answer from you\nbefore two o'clock--yes or no. If it is no, the shares go to a charity,\nand that this very day.\n\nDr. Stockmann. And what does Katherine get?\n\nMorten Kiil. Not a halfpenny. (The door leading to the hall opens, and\nHOVSTAD and ASLAKSEN make their appearance.) Look at those two!\n\nDr. Stockmann (staring at them). What the devil!--have YOU actually the\nface to come into my house?\n\nHovstad. Certainly.\n\nAslaksen. We have something to say to you, you see.\n\nMorten Kiil (in a whisper). Yes or no--before two o'clock.\n\nAslaksen (glancing at HOVSTAD). Aha! (MORTEN KIIL goes out.)\n\nDr. Stockmann. Well, what do you want with me? Be brief.\n\nHovstad. I can quite understand that you are annoyed with us for our\nattitude at the meeting yesterday.\n\nDr. Stockmann. Attitude, do you call it? Yes, it was a charming\nattitude! I call it weak, womanish--damnably shameful!\n\nHovstad. Call it what you like, we could not do otherwise.\n\nDr. Stockmann. You DARED not do otherwise--isn't that it?\n\nHovstad. Well, if you like to put it that way.\n\nAslaksen. But why did you not let us have word of it beforehand?--just\na hint to Mr. Hovstad or to me?\n\nDr. Stockmann. A hint? Of what?\n\nAslaksen. Of what was behind it all.\n\nDr. Stockmann. I don't understand you in the least--\n\nAslaksen (with a confidential nod). Oh yes, you do, Dr. Stockmann.\n\nHovstad. It is no good making a mystery of it any longer.\n\nDr. Stockmann (looking first at one of them and then at the other).\nWhat the devil do you both mean?\n\nAslaksen. May I ask if your father-in-law is not going round the town\nbuying up all the shares in the Baths?\n\nDr. Stockmann. Yes, he has been buying Baths shares today; but--\n\nAslaksen. It would have been more prudent to get someone else to do\nit--someone less nearly related to you.\n\nHovstad. And you should not have let your name appear in the affair.\nThere was no need for anyone to know that the attack on the Baths came\nfrom you. You ought to have consulted me, Dr. Stockmann.\n\nDr. Stockmann (looks in front of him; then a light seems to dawn on him\nand he says in amazement.) Are such things conceivable? Are such things\npossible?\n\nAslaksen (with a smile). Evidently they are. But it is better to use a\nlittle finesse, you know.\n\nHovstad. And it is much better to have several persons in a thing of\nthat sort; because the responsibility of each individual is lessened,\nwhen there are others with him.\n\nDr. Stockmann (composedly). Come to the point, gentlemen. What do you\nwant?\n\nAslaksen. Perhaps Mr. Hovstad had better--\n\nHovstad. No, you tell him, Aslaksen.\n\nAslaksen. Well, the fact is that, now we know the bearings of the whole\naffair, we think we might venture to put the \"People's Messenger\" at\nyour disposal.\n\nDr. Stockmann. Do you dare do that now? What about public opinion? Are\nyou not afraid of a storm breaking upon our heads?\n\nHovstad. We will try to weather it.\n\nAslaksen. And you must be ready to go off quickly on a new tack,\nDoctor. As soon as your invective has done its work--\n\nDr. Stockmann. Do you mean, as soon as my father-in-law and I have got\nhold of the shares at a low figure?\n\nHovstad. Your reasons for wishing to get the control of the Baths are\nmainly scientific, I take it.\n\nDr. Stockmann. Of course; it was for scientific reasons that I\npersuaded the old \"Badger\" to stand in with me in the matter. So we\nwill tinker at the conduit-pipes a little, and dig up a little bit of\nthe shore, and it shan't cost the town a sixpence. That will be all\nright--eh?\n\nHovstad. I think so--if you have the \"People's Messenger\" behind you.\n\nAslaksen. The Press is a power in a free community. Doctor.\n\nDr. Stockmann. Quite so. And so is public opinion. And you, Mr.\nAslaksen--I suppose you will be answerable for the Householders'\nAssociation?\n\nAslaksen. Yes, and for the Temperance Society. You may rely on that.\n\nDr. Stockmann. But, gentlemen--I really am ashamed to ask the\nquestion--but, what return do you--?\n\nHovstad. We should prefer to help you without any return whatever,\nbelieve me. But the \"People's Messenger\" is in rather a shaky\ncondition; it doesn't go really well; and I should be very unwilling to\nsuspend the paper now, when there is so much work to do here in the\npolitical way.\n\nDr. Stockmann. Quite so; that would be a great trial to such a friend\nof the people as you are. (Flares up.) But I am an enemy of the people,\nremember! (Walks about the room.) Where have I put my stick? Where the\ndevil is my stick?\n\nHovstad. What's that?\n\nAslaksen. Surely you never mean--\n\nDr. Stockmann (standing still.) And suppose I don't give you a single\npenny of all I get out of it? Money is not very easy to get out of us\nrich folk, please to remember!\n\nHovstad. And you please to remember that this affair of the shares can\nbe represented in two ways!\n\nDr. Stockmann. Yes, and you are just the man to do it. If I don't come\nto the rescue of the \"People's Messenger,\" you will certainly take an\nevil view of the affair; you will hunt me down, I can well\nimagine--pursue me--try to throttle me as a dog does a hare.\n\nHovstad. It is a natural law; every animal must fight for its own\nlivelihood.\n\nAslaksen. And get its food where it can, you know.\n\nDr. Stockmann (walking about the room). Then you go and look for yours\nin the gutter; because I am going to show you which is the strongest\nanimal of us three! (Finds an umbrella and brandishes it above his\nhead.) Ah, now--!\n\nHovstad. You are surely not going to use violence!\n\nAslaksen. Take care what you are doing with that umbrella.\n\nDr. Stockmann. Out of the window with you, Mr. Hovstad!\n\nHovstad (edging to the door). Are you quite mad!\n\nDr. Stockmann. Out of the window, Mr. Aslaksen! Jump, I tell you! You\nwill have to do it, sooner or later.\n\nAslaksen (running round the writing-table). Moderation, Doctor--I am a\ndelicate man--I can stand so little--(calls out) help, help!\n\n(MRS. STOCKMANN, PETRA and HORSTER come in from the sitting-room.)\n\nMrs. Stockmann. Good gracious, Thomas! What is happening?\n\nDr. Stockmann (brandishing the umbrella). Jump out, I tell you! Out\ninto the gutter!\n\nHovstad. An assault on an unoffending man! I call you to witness,\nCaptain Horster. (Hurries out through the hall.)\n\nAslaksen (irresolutely). If only I knew the way about here--. (Steals\nout through the sitting-room.)\n\nMrs. Stockmann (holding her husband back). Control yourself, Thomas!\n\nDr. Stockmann (throwing down the umbrella). Upon my soul, they have\nescaped after all.\n\nMrs. Stockmann. What did they want you to do?\n\nDr. Stockmann. I will tell you later on; I have something else to think\nabout now. (Goes to the table and writes something on a calling-card.)\nLook there, Katherine; what is written there?\n\nMrs. Stockmann. Three big Noes; what does that mean.\n\nDr. Stockmann. I will tell you that too, later on. (Holds out the card\nto PETRA.) There, Petra; tell sooty-face to run over to the \"Badger's\"\nwith that, as quick as she can. Hurry up! (PETRA takes the card and\ngoes out to the hall.)\n\nDr. Stockmann. Well, I think I have had a visit from every one of the\ndevil's messengers to-day! But now I am going to sharpen my pen till\nthey can feel its point; I shall dip it in venom and gall; I shall hurl\nmy inkpot at their heads!\n\nMrs. Stockmann. Yes, but we are going away, you know, Thomas.\n\n(PETRA comes back.)\n\nDr. Stockmann. Well?\n\nPetra. She has gone with it.\n\nDr. Stockmann. Good.--Going away, did you say? No, I'll be hanged if we\nare going away! We are going to stay where we are, Katherine!\n\nPetra. Stay here?\n\nMrs. Stockmann. Here, in the town?\n\nDr. Stockmann. Yes, here. This is the field of battle--this is where\nthe fight will be. This is where I shall triumph! As soon as I have had\nmy trousers sewn up I shall go out and look for another house. We must\nhave a roof over our heads for the winter.\n\nHorster. That you shall have in my house.\n\nDr. Stockmann. Can I?\n\nHorsier. Yes, quite well. I have plenty of room, and I am almost never\nat home.\n\nMrs. Stockmann. How good of you, Captain Horster!\n\nPetra. Thank you!\n\nDr. Stockmann (grasping his hand). Thank you, thank you! That is one\ntrouble over! Now I can set to work in earnest at once. There is an\nendless amount of things to look through here, Katherine! Luckily I\nshall have all my time at my disposal; because I have been dismissed\nfrom the Baths, you know.\n\nMrs. Stockmann (with a sigh). Oh yes, I expected that.\n\nDr. Stockmann. And they want to take my practice away from me too. Let\nthem! I have got the poor people to fall back upon, anyway--those that\ndon't pay anything; and, after all, they need me most, too. But, by\nJove, they will have to listen to me; I shall preach to them in season\nand out of season, as it says somewhere.\n\nMrs. Stockmann. But, dear Thomas, I should have thought events had\nshowed you what use it is to preach.\n\nDr. Stockmann. You are really ridiculous, Katherine. Do you want me to\nlet myself be beaten off the field by public opinion and the compact\nmajority and all that devilry? No, thank you! And what I want to do is\nso simple and clear and straightforward. I only want to drum into the\nheads of these curs the fact that the liberals are the most insidious\nenemies of freedom--that party programmes strangle every young and\nvigorous truth--that considerations of expediency turn morality and\njustice upside down--and that they will end by making life here\nunbearable. Don't you think, Captain Horster, that I ought to be able\nto make people understand that?\n\nHorster. Very likely; I don't know much about such things myself.\n\nDr. Stockmann. Well, look here--I will explain! It is the party leaders\nthat must be exterminated. A party leader is like a wolf, you see--like\na voracious wolf. He requires a certain number of smaller victims to\nprey upon every year, if he is to live. Just look at Hovstad and\nAslaksen! How many smaller victims have they not put an end to--or at\nany rate maimed and mangled until they are fit for nothing except to be\nhouseholders or subscribers to the \"People's Messenger\"! (Sits down on\nthe edge of the table.) Come here, Katherine--look how beautifully the\nsun shines to-day! And this lovely spring air I am drinking in!\n\nMrs. Stockmann. Yes, if only we could live on sunshine and spring air,\nThomas.\n\nDr. Stockmann. Oh, you will have to pinch and save a bit--then we shall\nget along. That gives me very little concern. What is much worse is,\nthat I know of no one who is liberal-minded and high-minded enough to\nventure to take up my work after me.\n\nPetra. Don't think about that, father; you have plenty of time before\nyou.--Hello, here are the boys already!\n\n(EJLIF and MORTEN come in from the sitting-room.)\n\nMrs. Stockmann. Have you got a holiday?\n\nMorten. No; but we were fighting with the other boys between lessons--\n\nEjlif. That isn't true; it was the other boys were fighting with us.\n\nMorten. Well, and then Mr. Rorlund said we had better stay at home for\na day or two.\n\nDr. Stockmann (snapping his fingers and getting up from the table). I\nhave it! I have it, by Jove! You shall never set foot in the school\nagain!\n\nThe Boys. No more school!\n\nMrs. Stockmann. But, Thomas--\n\nDr. Stockmann. Never, I say. I will educate you myself; that is to say,\nyou shan't learn a blessed thing--\n\nMorten. Hooray!\n\nDr. Stockmann. --but I will make liberal-minded and high-minded men of\nyou. You must help me with that, Petra.\n\nPetra, Yes, father, you may be sure I will.\n\nDr. Stockmann. And my school shall be in the room where they insulted\nme and called me an enemy of the people. But we are too few as we are;\nI must have at least twelve boys to begin with.\n\nMrs. Stockmann. You will certainly never get them in this town.\n\nDr. Stockmann. We shall. (To the boys.) Don't you know any street\nurchins--regular ragamuffins--?\n\nMorten. Yes, father, I know lots!\n\nDr. Stockmann. That's capital! Bring me some specimens of them. I am\ngoing to experiment with curs, just for once; there may be some\nexceptional heads among them.\n\nMorten. And what are we going to do, when you have made liberal-minded\nand high-minded men of us?\n\nDr. Stockmann. Then you shall drive all the wolves out of the country,\nmy boys!\n\n(EJLIF looks rather doubtful about it; MORTEN jumps about crying\n\"Hurrah!\")\n\nMrs. Stockmann. Let us hope it won't be the wolves that will drive you\nout of the country, Thomas.\n\nDr. Stockmann. Are you out of your mind, Katherine? Drive me out!\nNow--when I am the strongest man in the town!\n\nMrs. Stockmann. The strongest--now?\n\nDr. Stockmann. Yes, and I will go so far as to say that now I am the\nstrongest man in the whole world.\n\nMorten. I say!\n\nDr. Stockmann (lowering his voice). Hush! You mustn't say anything\nabout it yet; but I have made a great discovery.\n\nMrs. Stockmann. Another one?\n\nDr. Stockmann. Yes. (Gathers them round him, and says confidentially:)\nIt is this, let me tell you--that the strongest man in the world is he\nwho stands most alone.\n\nMrs. Stockmann (smiling and shaking her head). Oh, Thomas, Thomas!\n\nPetra (encouragingly, as she grasps her father's hands). Father!", "title": "En folkefiende. English"}