{"summary": "\nMost of The Sorrows of Young Werther is presented as a collection of letters written by Werther, a young artist of a sensitive and passionate temperament, to his friend Wilhelm. These give an intimate account of his stay in the fictional village of Wahlheim (based on Garbenheim, near Wetzlar), whose peasants have enchanted him with their simple ways. There he meets Charlotte, a beautiful young girl who takes care of her siblings after the death of their mother. Werther falls in love with Charlotte despite knowing beforehand that she is engaged to a man named Albert eleven years her senior.\nDespite the pain it causes him, Werther spends the next few months cultivating a close friendship with them both. His pain eventually becomes so great that he is forced to leave Wahlheim for Weimar, where he makes the acquaintance of Fräulein von B. He suffers great embarrassment when he forgetfully visits a friend and has to face the normal weekly gathering there of the entire aristocratic set. He then returns to Wahlheim, where he suffers still more than before, partly because Charlotte and Albert are now married. Every day becomes a torturing reminder that Charlotte will never be able to requite his love. She, out of pity for her friend and respect for her husband, decides that Werther must not visit her so frequently. He visits her one final time, and they are both overcome with emotion after he recites to her a passage of Ossian.\nEven before that incident, Werther had realized that one member of the love triangle – Charlotte, Albert or Werther himself – had to die to resolve the situation. Unable to hurt anyone else or seriously consider murder, Werther sees no other choice but to take his own life. After composing a farewell letter to be found after his death, he writes to Albert asking for his two pistols, on the pretext that he is going \"on a journey\". Charlotte receives the request with great emotion and sends the pistols. Werther then shoots himself in the head, but does not die until twelve hours later. He is buried under a linden tree that he has mentioned frequently in his letters. The funeral is not attended by any clergy, or by Albert or Charlotte. The book ends with an intimation that Charlotte may die of a broken heart. \"I shall say nothing of... Charlotte's grief.... Charlotte's life was despaired of,\" etc.\n\n", "full_text": "THE SORROWS OF YOUNG WERTHER\n\nBy J.W. von Goethe\n\nTranslated by R.D. Boylan\n\nEdited by Nathen Haskell Dole\n\nThe Sorrows of Young Werther\n\n\n\n\nPREFACE\n\n\nI have carefully collected whatever I have been able to learn of the\nstory of poor Werther, and here present it to you, knowing that you\nwill thank me for it. To his spirit and character you cannot refuse your\nadmiration and love: to his fate you will not deny your tears.\n\nAnd thou, good soul, who sufferest the same distress as he endured once,\ndraw comfort from his sorrows; and let this little book be thy friend,\nif, owing to fortune or through thine own fault, thou canst not find a\ndearer companion.\n\n\n\n\nBOOK I\n\nMAY 4.\n\nHow happy I am that I am gone! My dear friend, what a thing is the heart\nof man! To leave you, from whom I have been inseparable, whom I love\nso dearly, and yet to feel happy! I know you will forgive me. Have not\nother attachments been specially appointed by fate to torment a head\nlike mine? Poor Leonora! and yet I was not to blame. Was it my fault,\nthat, whilst the peculiar charms of her sister afforded me an agreeable\nentertainment, a passion for me was engendered in her feeble heart? And\nyet am I wholly blameless? Did I not encourage her emotions? Did I not\nfeel charmed at those truly genuine expressions of nature, which, though\nbut little mirthful in reality, so often amused us? Did I not--but\noh! what is man, that he dares so to accuse himself? My dear friend I\npromise you I will improve; I will no longer, as has ever been my habit,\ncontinue to ruminate on every petty vexation which fortune may dispense;\nI will enjoy the present, and the past shall be for me the past.\nNo doubt you are right, my best of friends, there would be far less\nsuffering amongst mankind, if men--and God knows why they are so\nfashioned--did not employ their imaginations so assiduously in recalling\nthe memory of past sorrow, instead of bearing their present lot with\nequanimity. Be kind enough to inform my mother that I shall attend to\nher business to the best of my ability, and shall give her the earliest\ninformation about it. I have seen my aunt, and find that she is very far\nfrom being the disagreeable person our friends allege her to be. She is\na lively, cheerful woman, with the best of hearts. I explained to her my\nmother's wrongs with regard to that part of her portion which has\nbeen withheld from her. She told me the motives and reasons of her own\nconduct, and the terms on which she is willing to give up the whole,\nand to do more than we have asked. In short, I cannot write further upon\nthis subject at present; only assure my mother that all will go on well.\nAnd I have again observed, my dear friend, in this trifling affair, that\nmisunderstandings and neglect occasion more mischief in the world than\neven malice and wickedness. At all events, the two latter are of less\nfrequent occurrence.\n\nIn other respects I am very well off here. Solitude in this terrestrial\nparadise is a genial balm to my mind, and the young spring cheers with\nits bounteous promises my oftentimes misgiving heart. Every tree, every\nbush, is full of flowers; and one might wish himself transformed into a\nbutterfly, to float about in this ocean of perfume, and find his whole\nexistence in it.\n\nThe town itself is disagreeable; but then, all around, you find an\ninexpressible beauty of nature. This induced the late Count M to lay\nout a garden on one of the sloping hills which here intersect each other\nwith the most charming variety, and form the most lovely valleys. The\ngarden is simple; and it is easy to perceive, even upon your first\nentrance, that the plan was not designed by a scientific gardener, but\nby a man who wished to give himself up here to the enjoyment of his own\nsensitive heart. Many a tear have I already shed to the memory of its\ndeparted master in a summer-house which is now reduced to ruins, but\nwas his favourite resort, and now is mine. I shall soon be master of the\nplace. The gardener has become attached to me within the last few days,\nand he will lose nothing thereby.\n\nMAY 10.\n\nA wonderful serenity has taken possession of my entire soul, like these\nsweet mornings of spring which I enjoy with my whole heart. I am alone,\nand feel the charm of existence in this spot, which was created for the\nbliss of souls like mine. I am so happy, my dear friend, so absorbed\nin the exquisite sense of mere tranquil existence, that I neglect my\ntalents. I should be incapable of drawing a single stroke at the present\nmoment; and yet I feel that I never was a greater artist than now. When,\nwhile the lovely valley teems with vapour around me, and the meridian\nsun strikes the upper surface of the impenetrable foliage of my trees,\nand but a few stray gleams steal into the inner sanctuary, I throw\nmyself down among the tall grass by the trickling stream; and, as I lie\nclose to the earth, a thousand unknown plants are noticed by me: when\nI hear the buzz of the little world among the stalks, and grow familiar\nwith the countless indescribable forms of the insects and flies, then I\nfeel the presence of the Almighty, who formed us in his own image, and\nthe breath of that universal love which bears and sustains us, as it\nfloats around us in an eternity of bliss; and then, my friend, when\ndarkness overspreads my eyes, and heaven and earth seem to dwell in my\nsoul and absorb its power, like the form of a beloved mistress, then I\noften think with longing, Oh, would I could describe these conceptions,\ncould impress upon paper all that is living so full and warm within me,\nthat it might be the mirror of my soul, as my soul is the mirror of the\ninfinite God! O my friend--but it is too much for my strength--I sink\nunder the weight of the splendour of these visions!\n\nMAY 12.\n\nI know not whether some deceitful spirits haunt this spot, or whether\nit be the warm, celestial fancy in my own heart which makes everything\naround me seem like paradise. In front of the house is a fountain,--a\nfountain to which I am bound by a charm like Melusina and her sisters.\nDescending a gentle slope, you come to an arch, where, some twenty steps\nlower down, water of the clearest crystal gushes from the marble rock.\nThe narrow wall which encloses it above, the tall trees which encircle\nthe spot, and the coolness of the place itself,--everything imparts\na pleasant but sublime impression. Not a day passes on which I do not\nspend an hour there. The young maidens come from the town to fetch\nwater,--innocent and necessary employment, and formerly the occupation\nof the daughters of kings. As I take my rest there, the idea of the old\npatriarchal life is awakened around me. I see them, our old ancestors,\nhow they formed their friendships and contracted alliances at the\nfountain-side; and I feel how fountains and streams were guarded by\nbeneficent spirits. He who is a stranger to these sensations has never\nreally enjoyed cool repose at the side of a fountain after the fatigue\nof a weary summer day.\n\nMAY 13.\n\nYou ask if you shall send me books. My dear friend, I beseech you,\nfor the love of God, relieve me from such a yoke! I need no more to be\nguided, agitated, heated. My heart ferments sufficiently of itself.\nI want strains to lull me, and I find them to perfection in my Homer.\nOften do I strive to allay the burning fever of my blood; and you have\nnever witnessed anything so unsteady, so uncertain, as my heart. But\nneed I confess this to you, my dear friend, who have so often endured\nthe anguish of witnessing my sudden transitions from sorrow to\nimmoderate joy, and from sweet melancholy to violent passions? I treat\nmy poor heart like a sick child, and gratify its every fancy. Do not\nmention this again: there are people who would censure me for it.\n\nMAY 15.\n\nThe common people of the place know me already, and love me,\nparticularly the children. When at first I associated with them, and\ninquired in a friendly tone about their various trifles, some fancied\nthat I wished to ridicule them, and turned from me in exceeding\nill-humour. I did not allow that circumstance to grieve me: I only felt\nmost keenly what I have often before observed. Persons who can claim\na certain rank keep themselves coldly aloof from the common people,\nas though they feared to lose their importance by the contact; whilst\nwanton idlers, and such as are prone to bad joking, affect to descend\nto their level, only to make the poor people feel their impertinence all\nthe more keenly.\n\nI know very well that we are not all equal, nor can be so; but it is my\nopinion that he who avoids the common people, in order not to lose their\nrespect, is as much to blame as a coward who hides himself from his\nenemy because he fears defeat.\n\nThe other day I went to the fountain, and found a young servant-girl,\nwho had set her pitcher on the lowest step, and looked around to see\nif one of her companions was approaching to place it on her head. I ran\ndown, and looked at her. \"Shall I help you, pretty lass?\" said I. She\nblushed deeply. \"Oh, sir!\" she exclaimed. \"No ceremony!\" I replied. She\nadjusted her head-gear, and I helped her. She thanked me, and ascended\nthe steps.\n\nMAY 17.\n\nI have made all sorts of acquaintances, but have as yet found no\nsociety. I know not what attraction I possess for the people, so many\nof them like me, and attach themselves to me; and then I feel sorry when\nthe road we pursue together goes only a short distance. If you inquire\nwhat the people are like here, I must answer, \"The same as everywhere.\"\nThe human race is but a monotonous affair. Most of them labour the\ngreater part of their time for mere subsistence; and the scanty portion\nof freedom which remains to them so troubles them that they use every\nexertion to get rid of it. Oh, the destiny of man!\n\nBut they are a right good sort of people. If I occasionally forget\nmyself, and take part in the innocent pleasures which are not yet\nforbidden to the peasantry, and enjoy myself, for instance, with\ngenuine freedom and sincerity, round a well-covered table, or arrange an\nexcursion or a dance opportunely, and so forth, all this produces a good\neffect upon my disposition; only I must forget that there lie dormant\nwithin me so many other qualities which moulder uselessly, and which\nI am obliged to keep carefully concealed. Ah! this thought affects my\nspirits fearfully. And yet to be misunderstood is the fate of the like\nof us.\n\nAlas, that the friend of my youth is gone! Alas, that I ever knew her! I\nmight say to myself, \"You are a dreamer to seek what is not to be found\nhere below.\" But she has been mine. I have possessed that heart, that\nnoble soul, in whose presence I seemed to be more than I really was,\nbecause I was all that I could be. Good heavens! did then a single power\nof my soul remain unexercised? In her presence could I not display, to\nits full extent, that mysterious feeling with which my heart embraces\nnature? Was not our intercourse a perpetual web of the finest emotions,\nof the keenest wit, the varieties of which, even in their very\neccentricity, bore the stamp of genius? Alas! the few years by which she\nwas my senior brought her to the grave before me. Never can I forget her\nfirm mind or her heavenly patience.\n\nA few days ago I met a certain young V--, a frank, open fellow, with\na most pleasing countenance. He has just left the university, does not\ndeem himself overwise, but believes he knows more than other people.\nHe has worked hard, as I can perceive from many circumstances, and, in\nshort, possesses a large stock of information. When he heard that I am\ndrawing a good deal, and that I know Greek (two wonderful things for\nthis part of the country), he came to see me, and displayed his whole\nstore of learning, from Batteaux to Wood, from De Piles to Winkelmann:\nhe assured me he had read through the first part of Sultzer's theory,\nand also possessed a manuscript of Heyne's work on the study of the\nantique. I allowed it all to pass.\n\nI have become acquainted, also, with a very worthy person, the district\njudge, a frank and open-hearted man. I am told it is a most delightful\nthing to see him in the midst of his children, of whom he has nine. His\neldest daughter especially is highly spoken of. He has invited me to go\nand see him, and I intend to do so on the first opportunity. He lives\nat one of the royal hunting-lodges, which can be reached from here in an\nhour and a half by walking, and which he obtained leave to inhabit after\nthe loss of his wife, as it is so painful to him to reside in town and\nat the court.\n\nThere have also come in my way a few other originals of a questionable\nsort, who are in all respects undesirable, and most intolerable in their\ndemonstration of friendship. Good-bye. This letter will please you: it\nis quite historical.\n\nMAY 22.\n\nThat the life of man is but a dream, many a man has surmised heretofore;\nand I, too, am everywhere pursued by this feeling. When I consider\nthe narrow limits within which our active and inquiring faculties are\nconfined; when I see how all our energies are wasted in providing for\nmere necessities, which again have no further end than to prolong\na wretched existence; and then that all our satisfaction concerning\ncertain subjects of investigation ends in nothing better than a passive\nresignation, whilst we amuse ourselves painting our prison-walls with\nbright figures and brilliant landscapes,--when I consider all this,\nWilhelm, I am silent. I examine my own being, and find there a world,\nbut a world rather of imagination and dim desires, than of distinctness\nand living power. Then everything swims before my senses, and I smile\nand dream while pursuing my way through the world.\n\nAll learned professors and doctors are agreed that children do not\ncomprehend the cause of their desires; but that the grown-up should\nwander about this earth like children, without knowing whence they come,\nor whither they go, influenced as little by fixed motives, but guided\nlike them by biscuits, sugar-plums, and the rod,--this is what nobody is\nwilling to acknowledge; and yet I think it is palpable.\n\nI know what you will say in reply; for I am ready to admit that they are\nhappiest, who, like children, amuse themselves with their playthings,\ndress and undress their dolls, and attentively watch the cupboard,\nwhere mamma has locked up her sweet things, and, when at last they get\na delicious morsel, eat it greedily, and exclaim, \"More!\" These are\ncertainly happy beings; but others also are objects of envy, who dignify\ntheir paltry employments, and sometimes even their passions, with\npompous titles, representing them to mankind as gigantic achievements\nperformed for their welfare and glory. But the man who humbly\nacknowledges the vanity of all this, who observes with what pleasure\nthe thriving citizen converts his little garden into a paradise, and how\npatiently even the poor man pursues his weary way under his burden,\nand how all wish equally to behold the light of the sun a little\nlonger,--yes, such a man is at peace, and creates his own world within\nhimself; and he is also happy, because he is a man. And then, however\nlimited his sphere, he still preserves in his bosom the sweet feeling of\nliberty, and knows that he can quit his prison whenever he likes.\n\nMAY 26.\n\nYou know of old my ways of settling anywhere, of selecting a little\ncottage in some cosy spot, and of putting up in it with every\ninconvenience. Here, too, I have discovered such a snug, comfortable\nplace, which possesses peculiar charms for me.\n\nAbout a league from the town is a place called Walheim. (The reader\nneed not take the trouble to look for the place thus designated. We have\nfound it necessary to change the names given in the original.) It is\ndelightfully situated on the side of a hill; and, by proceeding along\none of the footpaths which lead out of the village, you can have a view\nof the whole valley. A good old woman lives there, who keeps a small\ninn. She sells wine, beer, and coffee, and is cheerful and pleasant\nnotwithstanding her age. The chief charm of this spot consists in two\nlinden-trees, spreading their enormous branches over the little green\nbefore the church, which is entirely surrounded by peasants' cottages,\nbarns, and homesteads. I have seldom seen a place so retired and\npeaceable; and there often have my table and chair brought out from\nthe little inn, and drink my coffee there, and read my Homer. Accident\nbrought me to the spot one fine afternoon, and I found it perfectly\ndeserted. Everybody was in the fields except a little boy about four\nyears of age, who was sitting on the ground, and held between his knees\na child about six months old: he pressed it to his bosom with both\narms, which thus formed a sort of arm-chair; and, notwithstanding the\nliveliness which sparkled in its black eyes, it remained perfectly\nstill. The sight charmed me. I sat down upon a plough opposite, and\nsketched with great delight this little picture of brotherly tenderness.\nI added the neighbouring hedge, the barn-door, and some broken\ncart-wheels, just as they happened to lie; and I found in about an hour\nthat I had made a very correct and interesting drawing, without putting\nin the slightest thing of my own. This confirmed me in my resolution\nof adhering, for the future, entirely to nature. She alone is\ninexhaustible, and capable of forming the greatest masters. Much may be\nalleged in favour of rules, as much may be likewise advanced in favour\nof the laws of society: an artist formed upon them will never produce\nanything absolutely bad or disgusting; as a man who observes the laws,\nand obeys decorum, can never be an absolutely intolerable neighbour, nor\na decided villain: but yet, say what you will of rules, they destroy the\ngenuine feeling of nature, as well as its true expression. Do not tell\nme \"that this is too hard, that they only restrain and prune superfluous\nbranches, etc.\" My good friend, I will illustrate this by an analogy.\nThese things resemble love. A warmhearted youth becomes strongly\nattached to a maiden: he spends every hour of the day in her company,\nwears out his health, and lavishes his fortune, to afford continual\nproof that he is wholly devoted to her. Then comes a man of the world, a\nman of place and respectability, and addresses him thus: \"My good young\nfriend, love is natural; but you must love within bounds. Divide your\ntime: devote a portion to business, and give the hours of recreation to\nyour mistress. Calculate your fortune; and out of the superfluity you\nmay make her a present, only not too often,--on her birthday, and such\noccasions.\" Pursuing this advice, he may become a useful member of\nsociety, and I should advise every prince to give him an appointment;\nbut it is all up with his love, and with his genius if he be an artist.\nO my friend! why is it that the torrent of genius so seldom bursts\nforth, so seldom rolls in full-flowing stream, overwhelming your\nastounded soul? Because, on either side of this stream, cold and\nrespectable persons have taken up their abodes, and, forsooth, their\nsummer-houses and tulip-beds would suffer from the torrent; wherefore\nthey dig trenches, and raise embankments betimes, in order to avert the\nimpending danger.\n\nMAY 27.\n\nI find I have fallen into raptures, declamation, and similes, and have\nforgotten, in consequence, to tell you what became of the children.\nAbsorbed in my artistic contemplations, which I briefly described in my\nletter of yesterday, I continued sitting on the plough for two hours.\nToward evening a young woman, with a basket on her arm, came running\ntoward the children, who had not moved all that time. She exclaimed\nfrom a distance, \"You are a good boy, Philip!\" She gave me greeting: I\nreturned it, rose, and approached her. I inquired if she were the mother\nof those pretty children. \"Yes,\" she said; and, giving the eldest a\npiece of bread, she took the little one in her arms and kissed it with\na mother's tenderness. \"I left my child in Philip's care,\" she said,\n\"whilst I went into the town with my eldest boy to buy some wheaten\nbread, some sugar, and an earthen pot.\" I saw the various articles in\nthe basket, from which the cover had fallen. \"I shall make some broth\nto-night for my little Hans (which was the name of the youngest):\nthat wild fellow, the big one, broke my pot yesterday, whilst he was\nscrambling with Philip for what remained of the contents.\" I inquired\nfor the eldest; and she had scarcely time to tell me that he was driving\na couple of geese home from the meadow, when he ran up, and handed\nPhilip an osier-twig. I talked a little longer with the woman, and found\nthat she was the daughter of the schoolmaster, and that her husband was\ngone on a journey into Switzerland for some money a relation had left\nhim. \"They wanted to cheat him,\" she said, \"and would not answer\nhis letters; so he is gone there himself. I hope he has met with no\naccident, as I have heard nothing of him since his departure.\" I left\nthe woman, with regret, giving each of the children a kreutzer, with an\nadditional one for the youngest, to buy some wheaten bread for his broth\nwhen she went to town next; and so we parted. I assure you, my dear\nfriend, when my thoughts are all in tumult, the sight of such a\ncreature as this tranquillises my disturbed mind. She moves in a\nhappy thoughtlessness within the confined circle of her existence; she\nsupplies her wants from day to day; and, when she sees the leaves fall,\nthey raise no other idea in her mind than that winter is approaching.\nSince that time I have gone out there frequently. The children have\nbecome quite familiar with me; and each gets a lump of sugar when I\ndrink my coffee, and they share my milk and bread and butter in the\nevening. They always receive their kreutzer on Sundays, for the good\nwoman has orders to give it to them when I do not go there after evening\nservice. They are quite at home with me, tell me everything; and I am\nparticularly amused with observing their tempers, and the simplicity of\ntheir behaviour, when some of the other village children are assembled\nwith them.\n\nIt has given me a deal of trouble to satisfy the anxiety of the mother,\nlest (as she says) \"they should inconvenience the gentleman.\"\n\nMAY 30.\n\nWhat I have lately said of painting is equally true with respect to\npoetry. It is only necessary for us to know what is really excellent,\nand venture to give it expression; and that is saying much in few words.\nTo-day I have had a scene, which, if literally related, would, make the\nmost beautiful idyl in the world. But why should I talk of poetry and\nscenes and idyls? Can we never take pleasure in nature without having\nrecourse to art?\n\nIf you expect anything grand or magnificent from this introduction,\nyou will be sadly mistaken. It relates merely to a peasant-lad, who\nhas excited in me the warmest interest. As usual, I shall tell my story\nbadly; and you, as usual, will think me extravagant. It is Walheim once\nmore--always Walheim--which produces these wonderful phenomena.\n\nA party had assembled outside the house under the linden-trees, to drink\ncoffee. The company did not exactly please me; and, under one pretext or\nanother, I lingered behind.\n\nA peasant came from an adjoining house, and set to work arranging some\npart of the same plough which I had lately sketched. His appearance\npleased me; and I spoke to him, inquired about his circumstances, made\nhis acquaintance, and, as is my wont with persons of that class, was\nsoon admitted into his confidence. He said he was in the service of\na young widow, who set great store by him. He spoke so much of his\nmistress, and praised her so extravagantly, that I could soon see he was\ndesperately in love with her. \"She is no longer young,\" he said: \"and\nshe was treated so badly by her former husband that she does not mean\nto marry again.\" From his account it was so evident what incomparable\ncharms she possessed for him, and how ardently he wished she would\nselect him to extinguish the recollection of her first husband's\nmisconduct, that I should have to repeat his own words in order to\ndescribe the depth of the poor fellow's attachment, truth, and devotion.\nIt would, in fact, require the gifts of a great poet to convey the\nexpression of his features, the harmony of his voice, and the heavenly\nfire of his eye. No words can portray the tenderness of his every\nmovement and of every feature: no effort of mine could do justice to the\nscene. His alarm lest I should misconceive his position with regard\nto his mistress, or question the propriety of her conduct, touched me\nparticularly. The charming manner with which he described her form and\nperson, which, without possessing the graces of youth, won and attached\nhim to her, is inexpressible, and must be left to the imagination. I\nhave never in my life witnessed or fancied or conceived the possibility\nof such intense devotion, such ardent affections, united with so much\npurity. Do not blame me if I say that the recollection of this innocence\nand truth is deeply impressed upon my very soul; that this picture of\nfidelity and tenderness haunts me everywhere; and that my own heart, as\nthough enkindled by the flame, glows and burns within me.\n\nI mean now to try and see her as soon as I can: or perhaps, on second\nthoughts, I had better not; it is better I should behold her through the\neyes of her lover. To my sight, perhaps, she would not appear as she now\nstands before me; and why should I destroy so sweet a picture?\n\nJUNE 16.\n\n\"Why do I not write to you?\" You lay claim to learning, and ask such a\nquestion. You should have guessed that I am well--that is to say--in a\nword, I have made an acquaintance who has won my heart: I have--I know\nnot.\n\nTo give you a regular account of the manner in which I have become\nacquainted with the most amiable of women would be a difficult task. I\nam a happy and contented mortal, but a poor historian.\n\nAn angel! Nonsense! Everybody so describes his mistress; and yet I find\nit impossible to tell you how perfect she is, or why she is so perfect:\nsuffice it to say she has captivated all my senses.\n\nSo much simplicity with so much understanding--so mild, and yet so\nresolute--a mind so placid, and a life so active.\n\nBut all this is ugly balderdash, which expresses not a single character\nnor feature. Some other time--but no, not some other time, now, this\nvery instant, will I tell you all about it. Now or never. Well, between\nourselves, since I commenced my letter, I have been three times on the\npoint of throwing down my pen, of ordering my horse, and riding out.\nAnd yet I vowed this morning that I would not ride to-day, and yet every\nmoment I am rushing to the window to see how high the sun is.\n\nI could not restrain myself--go to her I must. I have just returned,\nWilhelm; and whilst I am taking supper I will write to you. What\na delight it was for my soul to see her in the midst of her dear,\nbeautiful children,--eight brothers and sisters!\n\nBut, if I proceed thus, you will be no wiser at the end of my letter\nthan you were at the beginning. Attend, then, and I will compel myself\nto give you the details.\n\nI mentioned to you the other day that I had become acquainted with S--,\nthe district judge, and that he had invited me to go and visit him in\nhis retirement, or rather in his little kingdom. But I neglected going,\nand perhaps should never have gone, if chance had not discovered to me\nthe treasure which lay concealed in that retired spot. Some of our young\npeople had proposed giving a ball in the country, at which I consented\nto be present. I offered my hand for the evening to a pretty and\nagreeable, but rather commonplace, sort of girl from the immediate\nneighbourhood; and it was agreed that I should engage a carriage, and\ncall upon Charlotte, with my partner and her aunt, to convey them to the\nball. My companion informed me, as we drove along through the park\nto the hunting-lodge, that I should make the acquaintance of a very\ncharming young lady. \"Take care,\" added the aunt, \"that you do not lose\nyour heart.\" \"Why?\" said I. \"Because she is already engaged to a very\nworthy man,\" she replied, \"who is gone to settle his affairs upon\nthe death of his father, and will succeed to a very considerable\ninheritance.\" This information possessed no interest for me. When\nwe arrived at the gate, the sun was setting behind the tops of the\nmountains. The atmosphere was heavy; and the ladies expressed their\nfears of an approaching storm, as masses of low black clouds were\ngathering in the horizon. I relieved their anxieties by pretending to be\nweather-wise, although I myself had some apprehensions lest our pleasure\nshould be interrupted.\n\nI alighted; and a maid came to the door, and requested us to wait a\nmoment for her mistress. I walked across the court to a well-built\nhouse, and, ascending the flight of steps in front, opened the door,\nand saw before me the most charming spectacle I had ever witnessed. Six\nchildren, from eleven to two years old, were running about the hall, and\nsurrounding a lady of middle height, with a lovely figure, dressed in a\nrobe of simple white, trimmed with pink ribbons. She was holding a rye\nloaf in her hand, and was cutting slices for the little ones all around,\nin proportion to their age and appetite. She performed her task in a\ngraceful and affectionate manner; each claimant awaiting his turn with\noutstretched hands, and boisterously shouting his thanks. Some of them\nran away at once, to enjoy their evening meal; whilst others, of a\ngentler disposition, retired to the courtyard to see the strangers, and\nto survey the carriage in which their Charlotte was to drive away. \"Pray\nforgive me for giving you the trouble to come for me, and for keeping\nthe ladies waiting: but dressing, and arranging some household duties\nbefore I leave, had made me forget my children's supper; and they do\nnot like to take it from any one but me.\" I uttered some indifferent\ncompliment: but my whole soul was absorbed by her air, her voice, her\nmanner; and I had scarcely recovered myself when she ran into her room\nto fetch her gloves and fan. The young ones threw inquiring glances at\nme from a distance; whilst I approached the youngest, a most delicious\nlittle creature. He drew back; and Charlotte, entering at the very\nmoment, said, \"Louis, shake hands with your cousin.\" The little fellow\nobeyed willingly; and I could not resist giving him a hearty kiss,\nnotwithstanding his rather dirty face. \"Cousin,\" said I to Charlotte,\nas I handed her down, \"do you think I deserve the happiness of being\nrelated to you?\" She replied, with a ready smile, \"Oh! I have such\na number of cousins, that I should be sorry if you were the most\nundeserving of them.\" In taking leave, she desired her next sister,\nSophy, a girl about eleven years old, to take great care of the\nchildren, and to say good-bye to papa for her when he came home from his\nride. She enjoined to the little ones to obey their sister Sophy as they\nwould herself, upon which some promised that they would; but a little\nfair-haired girl, about six years old, looked discontented, and said,\n\"But Sophy is not you, Charlotte; and we like you best.\" The two eldest\nboys had clambered up the carriage; and, at my request, she permitted\nthem to accompany us a little way through the forest, upon their\npromising to sit very still, and hold fast.\n\nWe were hardly seated, and the ladies had scarcely exchanged\ncompliments, making the usual remarks upon each other's dress, and upon\nthe company they expected to meet, when Charlotte stopped the carriage,\nand made her brothers get down. They insisted upon kissing her hands\nonce more; which the eldest did with all the tenderness of a youth\nof fifteen, but the other in a lighter and more careless manner. She\ndesired them again to give her love to the children, and we drove off.\n\nThe aunt inquired of Charlotte whether she had finished the book she had\nlast sent her. \"No,\" said Charlotte; \"I did not like it: you can have\nit again. And the one before was not much better.\" I was surprised, upon\nasking the title, to hear that it was ____. (We feel obliged to suppress\nthe passage in the letter, to prevent any one from feeling aggrieved;\nalthough no author need pay much attention to the opinion of a mere\ngirl, or that of an unsteady young man.)\n\nI found penetration and character in everything she said: every\nexpression seemed to brighten her features with new charms,--with\nnew rays of genius,--which unfolded by degrees, as she felt herself\nunderstood.\n\n\"When I was younger,\" she observed, \"I loved nothing so much as\nromances. Nothing could equal my delight when, on some holiday, I could\nsettle down quietly in a corner, and enter with my whole heart and soul\ninto the joys or sorrows of some fictitious Leonora. I do not deny that\nthey even possess some charms for me yet. But I read so seldom, that I\nprefer books suited exactly to my taste. And I like those authors best\nwhose scenes describe my own situation in life,--and the friends who are\nabout me, whose stories touch me with interest, from resembling my own\nhomely existence,--which, without being absolutely paradise, is, on the\nwhole, a source of indescribable happiness.\"\n\nI endeavoured to conceal the emotion which these words occasioned, but\nit was of slight avail; for, when she had expressed so truly her opinion\nof \"The Vicar of Wakefield,\" and of other works, the names of which I\nomit (Though the names are omitted, yet the authors mentioned deserve\nCharlotte's approbation, and will feel it in their hearts when they read\nthis passage. It concerns no other person.), I could no longer contain\nmyself, but gave full utterance to what I thought of it: and it was not\nuntil Charlotte had addressed herself to the two other ladies, that\nI remembered their presence, and observed them sitting mute with\nastonishment. The aunt looked at me several times with an air of\nraillery, which, however, I did not at all mind.\n\nWe talked of the pleasures of dancing. \"If it is a fault to love it,\"\nsaid Charlotte, \"I am ready to confess that I prize it above all other\namusements. If anything disturbs me, I go to the piano, play an air to\nwhich I have danced, and all goes right again directly.\"\n\nYou, who know me, can fancy how steadfastly I gazed upon her rich dark\neyes during these remarks, how my very soul gloated over her warm lips\nand fresh, glowing cheeks, how I became quite lost in the delightful\nmeaning of her words, so much so, that I scarcely heard the actual\nexpressions. In short, I alighted from the carriage like a person in a\ndream, and was so lost to the dim world around me, that I scarcely heard\nthe music which resounded from the illuminated ballroom.\n\nThe two Messrs. Andran and a certain N. N. (I cannot trouble myself with\nthe names), who were the aunt's and Charlotte's partners, received us\nat the carriage-door, and took possession of their ladies, whilst I\nfollowed with mine.\n\nWe commenced with a minuet. I led out one lady after another, and\nprecisely those who were the most disagreeable could not bring\nthemselves to leave off. Charlotte and her partner began an English\ncountry dance, and you must imagine my delight when it was their turn\nto dance the figure with us. You should see Charlotte dance. She dances\nwith her whole heart and soul: her figure is all harmony, elegance,\nand grace, as if she were conscious of nothing else, and had no\nother thought or feeling; and, doubtless, for the moment, every other\nsensation is extinct.\n\nShe was engaged for the second country dance, but promised me the third,\nand assured me, with the most agreeable freedom, that she was very\nfond of waltzing. \"It is the custom here,\" she said, \"for the previous\npartners to waltz together; but my partner is an indifferent waltzer,\nand will feel delighted if I save him the trouble. Your partner is not\nallowed to waltz, and, indeed, is equally incapable: but I observed\nduring the country dance that you waltz well; so, if you will waltz with\nme, I beg you would propose it to my partner, and I will propose it to\nyours.\" We agreed, and it was arranged that our partners should mutually\nentertain each other.\n\nWe set off, and, at first, delighted ourselves with the usual graceful\nmotions of the arms. With what grace, with what ease, she moved! When\nthe waltz commenced, and the dancers whirled around each other in the\ngiddy maze, there was some confusion, owing to the incapacity of some of\nthe dancers. We judiciously remained still, allowing the others to weary\nthemselves; and, when the awkward dancers had withdrawn, we joined in,\nand kept it up famously together with one other couple,--Andran and his\npartner. Never did I dance more lightly. I felt myself more than mortal,\nholding this loveliest of creatures in my arms, flying, with her as\nrapidly as the wind, till I lost sight of every other object; and O\nWilhelm, I vowed at that moment, that a maiden whom I loved, or for whom\nI felt the slightest attachment, never, never should waltz with any one\nelse but with me, if I went to perdition for it!--you will understand\nthis.\n\nWe took a few turns in the room to recover our breath. Charlotte sat\ndown, and felt refreshed by partaking of some oranges which I had had\nsecured,--the only ones that had been left; but at every slice which,\nfrom politeness, she offered to her neighbours, I felt as though a\ndagger went through my heart.\n\nWe were the second couple in the third country dance. As we were going\ndown (and Heaven knows with what ecstasy I gazed at her arms and eyes,\nbeaming with the sweetest feeling of pure and genuine enjoyment),\nwe passed a lady whom I had noticed for her charming expression of\ncountenance; although she was no longer young. She looked at Charlotte\nwith a smile, then, holding up her finger in a threatening attitude,\nrepeated twice in a very significant tone of voice the name of \"Albert.\"\n\n\"Who is Albert,\" said I to Charlotte, \"if it is not impertinent to ask?\"\nShe was about to answer, when we were obliged to separate, in order to\nexecute a figure in the dance; and, as we crossed over again in front of\neach other, I perceived she looked somewhat pensive. \"Why need I conceal\nit from you?\" she said, as she gave me her hand for the promenade.\n\"Albert is a worthy man, to whom I am engaged.\" Now, there was nothing\nnew to me in this (for the girls had told me of it on the way); but it\nwas so far new that I had not thought of it in connection with her whom,\nin so short a time, I had learned to prize so highly. Enough, I became\nconfused, got out in the figure, and occasioned general confusion; so\nthat it required all Charlotte's presence of mind to set me right by\npulling and pushing me into my proper place.\n\nThe dance was not yet finished when the lightning which had for some\ntime been seen in the horizon, and which I had asserted to proceed\nentirely from heat, grew more violent; and the thunder was heard above\nthe music. When any distress or terror surprises us in the midst of our\namusements, it naturally makes a deeper impression than at other times,\neither because the contrast makes us more keenly susceptible, or rather\nperhaps because our senses are then more open to impressions, and the\nshock is consequently stronger. To this cause I must ascribe the fright\nand shrieks of the ladies. One sagaciously sat down in a corner with\nher back to the window, and held her fingers to her ears; a second knelt\ndown before her, and hid her face in her lap; a third threw herself\nbetween them, and embraced her sister with a thousand tears; some\ninsisted on going home; others, unconscious of their actions, wanted\nsufficient presence of mind to repress the impertinence of their young\npartners, who sought to direct to themselves those sighs which the lips\nof our agitated beauties intended for heaven. Some of the gentlemen had\ngone down-stairs to smoke a quiet cigar, and the rest of the company\ngladly embraced a happy suggestion of the hostess to retire into another\nroom which was provided with shutters and curtains. We had hardly got\nthere, when Charlotte placed the chairs in a circle; and, when the\ncompany had sat down in compliance with her request, she forthwith\nproposed a round game.\n\nI noticed some of the company prepare their mouths and draw themselves\nup at the prospect of some agreeable forfeit. \"Let us play at counting,\"\nsaid Charlotte. \"Now, pay attention: I shall go round the circle from\nright to left; and each person is to count, one after the other, the\nnumber that comes to him, and must count fast; whoever stops or\nmistakes is to have a box on the ear, and so on, till we have counted a\nthousand.\" It was delightful to see the fun. She went round the circle\nwith upraised arm. \"One,\" said the first; \"two,\" the second; \"three,\"\nthe third; and so on, till Charlotte went faster and faster. One made a\nmistake, instantly a box on the ear; and, amid the laughter that ensued,\ncame another box; and so on, faster and faster. I myself came in for\ntwo. I fancied they were harder than the rest, and felt quite delighted.\nA general laughter and confusion put an end to the game long before\nwe had counted as far as a thousand. The party broke up into little\nseparate knots: the storm had ceased, and I followed Charlotte into the\nballroom. On the way she said, \"The game banished their fears of the\nstorm.\" I could make no reply. \"I myself,\" she continued, \"was as much\nfrightened as any of them; but by affecting courage, to keep up the\nspirits of the others, I forgot my apprehensions.\" We went to the\nwindow. It was still thundering at a distance: a soft rain was pouring\ndown over the country, and filled the air around us with delicious\nodours. Charlotte leaned forward on her arm; her eyes wandered over the\nscene; she raised them to the sky, and then turned them upon me;\nthey were moistened with tears; she placed her hand on mine and said,\n\"Klopstock!\" at once I remembered the magnificent ode which was in her\nthoughts: I felt oppressed with the weight of my sensations, and sank\nunder them. It was more than I could bear. I bent over her hand, kissed\nit in a stream of delicious tears, and again looked up to her eyes.\nDivine Klopstock! why didst thou not see thy apotheosis in those eyes?\nAnd thy name so often profaned, would that I never heard it repeated!\n\nJUNE 19.\n\nI no longer remember where I stopped in my narrative: I only know it was\ntwo in the morning when I went to bed; and if you had been with me,\nthat I might have talked instead of writing to you, I should, in all\nprobability, have kept you up till daylight.\n\nI think I have not yet related what happened as we rode home from\nthe ball, nor have I time to tell you now. It was a most magnificent\nsunrise: the whole country was refreshed, and the rain fell drop by\ndrop from the trees in the forest. Our companions were asleep. Charlotte\nasked me if I did not wish to sleep also, and begged of me not to make\nany ceremony on her account. Looking steadfastly at her, I answered, \"As\nlong as I see those eyes open, there is no fear of my falling asleep.\"\nWe both continued awake till we reached her door. The maid opened it\nsoftly, and assured her, in answer to her inquiries, that her father and\nthe children were well, and still sleeping. I left her asking permission\nto visit her in the course of the day. She consented, and I went, and,\nsince that time, sun, moon, and stars may pursue their course: I know\nnot whether it is day or night; the whole world is nothing to me.\n\nJUNE 21.\n\nMy days are as happy as those reserved by God for his elect; and,\nwhatever be my fate hereafter, I can never say that I have not tasted\njoy,--the purest joy of life. You know Walheim. I am now completely\nsettled there. In that spot I am only half a league from Charlotte; and\nthere I enjoy myself, and taste all the pleasure which can fall to the\nlot of man.\n\nLittle did I imagine, when I selected Walheim for my pedestrian\nexcursions, that all heaven lay so near it. How often in my wanderings\nfrom the hillside or from the meadows across the river, have I beheld\nthis hunting-lodge, which now contains within it all the joy of my\nheart!\n\nI have often, my dear Wilhelm, reflected on the eagerness men feel to\nwander and make new discoveries, and upon that secret impulse which\nafterward inclines them to return to their narrow circle, conform to\nthe laws of custom, and embarrass themselves no longer with what passes\naround them.\n\nIt is so strange how, when I came here first, and gazed upon that\nlovely valley from the hillside, I felt charmed with the entire scene\nsurrounding me. The little wood opposite--how delightful to sit under\nits shade! How fine the view from that point of rock! Then, that\ndelightful chain of hills, and the exquisite valleys at their feet!\nCould I but wander and lose myself amongst them! I went, and returned\nwithout finding what I wished. Distance, my friend, is like futurity. A\ndim vastness is spread before our souls: the perceptions of our mind are\nas obscure as those of our vision; and we desire earnestly to surrender\nup our whole being, that it may be filled with the complete and perfect\nbliss of one glorious emotion. But alas! when we have attained our\nobject, when the distant there becomes the present here, all is changed:\nwe are as poor and circumscribed as ever, and our souls still languish\nfor unattainable happiness.\n\nSo does the restless traveller pant for his native soil, and find in his\nown cottage, in the arms of his wife, in the affections of his children,\nand in the labour necessary for their support, that happiness which he\nhad sought in vain through the wide world.\n\nWhen, in the morning at sunrise, I go out to Walheim, and with my own\nhands gather in the garden the pease which are to serve for my dinner,\nwhen I sit down to shell them, and read my Homer during the intervals,\nand then, selecting a saucepan from the kitchen, fetch my own butter,\nput my mess on the fire, cover it up, and sit down to stir it as\noccasion requires, I figure to myself the illustrious suitors of\nPenelope, killing, dressing, and preparing their own oxen and swine.\nNothing fills me with a more pure and genuine sense of happiness than\nthose traits of patriarchal life which, thank Heaven! I can imitate\nwithout affectation. Happy is it, indeed, for me that my heart is\ncapable of feeling the same simple and innocent pleasure as the peasant\nwhose table is covered with food of his own rearing, and who not only\nenjoys his meal, but remembers with delight the happy days and sunny\nmornings when he planted it, the soft evenings when he watered it, and\nthe pleasure he experienced in watching its daily growth.\n\nJUNE 29.\n\nThe day before yesterday, the physician came from the town to pay a\nvisit to the judge. He found me on the floor playing with Charlotte's\nchildren. Some of them were scrambling over me, and others romped with\nme; and, as I caught and tickled them, they made a great noise. The\ndoctor is a formal sort of personage: he adjusts the plaits of his\nruffles, and continually settles his frill whilst he is talking to you;\nand he thought my conduct beneath the dignity of a sensible man. I could\nperceive this by his countenance. But I did not suffer myself to be\ndisturbed. I allowed him to continue his wise conversation, whilst I\nrebuilt the children's card houses for them as fast as they threw them\ndown. He went about the town afterward, complaining that the judge's\nchildren were spoiled enough before, but that now Werther was completely\nruining them.\n\nYes, my dear Wilhelm, nothing on this earth affects my heart so much\nas children. When I look on at their doings; when I mark in the little\ncreatures the seeds of all those virtues and qualities which they will\none day find so indispensable; when I behold in the obstinate all the\nfuture firmness and constancy of a noble character; in the capricious,\nthat levity and gaiety of temper which will carry them lightly over\nthe dangers and troubles of life, their whole nature simple and\nunpolluted,--then I call to mind the golden words of the Great Teacher\nof mankind, \"Unless ye become like one of these!\" And now, my friend,\nthese children, who are our equals, whom we ought to consider as our\nmodels, we treat them as though they were our subjects. They are allowed\nno will of their own. And have we, then, none ourselves? Whence comes\nour exclusive right? Is it because we are older and more experienced?\nGreat God! from the height of thy heaven thou beholdest great children\nand little children, and no others; and thy Son has long since declared\nwhich afford thee greatest pleasure. But they believe in him, and hear\nhim not,--that, too, is an old story; and they train their children\nafter their own image, etc.\n\nAdieu, Wilhelm: I will not further bewilder myself with this subject.\n\nJULY 1.\n\nThe consolation Charlotte can bring to an invalid I experience from my\nown heart, which suffers more from her absence than many a poor creature\nlingering on a bed of sickness. She is gone to spend a few days in the\ntown with a very worthy woman, who is given over by the physicians, and\nwishes to have Charlotte near her in her last moments. I accompanied\nher last week on a visit to the Vicar of S--, a small village in\nthe mountains, about a league hence. We arrived about four o'clock:\nCharlotte had taken her little sister with her. When we entered the\nvicarage court, we found the good old man sitting on a bench before\nthe door, under the shade of two large walnut-trees. At the sight\nof Charlotte he seemed to gain new life, rose, forgot his stick, and\nventured to walk toward her. She ran to him, and made him sit down\nagain; then, placing herself by his side, she gave him a number of\nmessages from her father, and then caught up his youngest child, a\ndirty, ugly little thing, the joy of his old age, and kissed it. I wish\nyou could have witnessed her attention to this old man,--how she raised\nher voice on account of his deafness; how she told him of healthy young\npeople, who had been carried off when it was least expected; praised\nthe virtues of Carlsbad, and commended his determination to spend the\nensuing summer there; and assured him that he looked better and stronger\nthan he did when she saw him last. I, in the meantime, paid attention to\nhis good lady. The old man seemed quite in spirits; and as I could\nnot help admiring the beauty of the walnut-trees, which formed such\nan agreeable shade over our heads, he began, though with some little\ndifficulty, to tell us their history. \"As to the oldest,\" said he, \"we\ndo not know who planted it,--some say one clergyman, and some another:\nbut the younger one, there behind us, is exactly the age of my wife,\nfifty years old next October; her father planted it in the morning,\nand in the evening she came into the world. My wife's father was my\npredecessor here, and I cannot tell you how fond he was of that tree;\nand it is fully as dear to me. Under the shade of that very tree, upon\na log of wood, my wife was seated knitting, when I, a poor student, came\ninto this court for the first time, just seven and twenty years ago.\"\nCharlotte inquired for his daughter. He said she was gone with Herr\nSchmidt to the meadows, and was with the haymakers. The old man then\nresumed his story, and told us how his predecessor had taken a fancy\nto him, as had his daughter likewise; and how he had become first his\ncurate, and subsequently his successor. He had scarcely finished his\nstory when his daughter returned through the garden, accompanied by the\nabove-mentioned Herr Schmidt. She welcomed Charlotte affectionately,\nand I confess I was much taken with her appearance. She was a\nlively-looking, good-humoured brunette, quite competent to amuse one for\na short time in the country. Her lover (for such Herr Schmidt evidently\nappeared to be) was a polite, reserved personage, and would not join\nour conversation, notwithstanding all Charlotte's endeavours to draw\nhim out. I was much annoyed at observing, by his countenance, that\nhis silence did not arise from want of talent, but from caprice and\nill-humour. This subsequently became very evident, when we set out to\ntake a walk, and Frederica joining Charlotte, with whom I was talking,\nthe worthy gentleman's face, which was naturally rather sombre, became\nso dark and angry that Charlotte was obliged to touch my arm, and remind\nme that I was talking too much to Frederica. Nothing distresses me more\nthan to see men torment each other; particularly when in the flower of\ntheir age, in the very season of pleasure, they waste their few short\ndays of sunshine in quarrels and disputes, and only perceive their error\nwhen it is too late to repair it. This thought dwelt upon my mind; and\nin the evening, when we returned to the vicar's, and were sitting round\nthe table with our bread end milk, the conversation turned on the joys\nand sorrows of the world, I could not resist the temptation to inveigh\nbitterly against ill-humour. \"We are apt,\" said I, \"to complain,\nbut--with very little cause, that our happy days are few, and our evil\ndays many. If our hearts were always disposed to receive the benefits\nHeaven sends us, we should acquire strength to support evil when it\ncomes.\" \"But,\" observed the vicar's wife, \"we cannot always command our\ntempers, so much depends upon the constitution: when the body suffers,\nthe mind is ill at ease.\" \"I acknowledge that,\" I continued; \"but we\nmust consider such a disposition in the light of a disease, and inquire\nwhether there is no remedy for it.\"\n\n\"I should be glad to hear one,\" said Charlotte: \"at least, I think very\nmuch depends upon ourselves; I know it is so with me. When anything\nannoys me, and disturbs my temper, I hasten into the garden, hum a\ncouple of country dances, and it is all right with me directly.\" \"That\nis what I meant,\" I replied; \"ill-humour resembles indolence: it is\nnatural to us; but if once we have courage to exert ourselves, we find\nour work run fresh from our hands, and we experience in the activity\nfrom which we shrank a real enjoyment.\" Frederica listened very\nattentively: and the young man objected, that we were not masters of\nourselves, and still less so of our feelings. \"The question is about a\ndisagreeable feeling,\" I added, \"from which every one would willingly\nescape, but none know their own power without trial. Invalids are glad\nto consult physicians, and submit to the most scrupulous regimen, the\nmost nauseous medicines, in order to recover their health.\" I observed\nthat the good old man inclined his head, and exerted himself to hear our\ndiscourse; so I raised my voice, and addressed myself directly to\nhim. \"We preach against a great many crimes,\" I observed, \"but I never\nremember a sermon delivered against ill-humour.\" \"That may do very\nwell for your town clergymen,\" said he: \"country people are never\nill-humoured; though, indeed, it might be useful, occasionally, to my\nwife for instance, and the judge.\" We all laughed, as did he likewise\nvery cordially, till he fell into a fit of coughing, which interrupted\nour conversation for a time. Herr Schmidt resumed the subject. \"You\ncall ill humour a crime,\" he remarked, \"but I think you use too strong\na term.\" \"Not at all,\" I replied, \"if that deserves the name which is\nso pernicious to ourselves and our neighbours. Is it not enough that we\nwant the power to make one another happy, must we deprive each other of\nthe pleasure which we can all make for ourselves? Show me the man who\nhas the courage to hide his ill-humour, who bears the whole burden\nhimself, without disturbing the peace of those around him. No:\nill-humour arises from an inward consciousness of our own want of merit,\nfrom a discontent which ever accompanies that envy which foolish vanity\nengenders. We see people happy, whom we have not made so, and cannot\nendure the sight.\" Charlotte looked at me with a smile; she observed\nthe emotion with which I spoke: and a tear in the eyes of Frederica\nstimulated me to proceed. \"Woe unto those,\" I said, \"who use their power\nover a human heart to destroy the simple pleasures it would naturally\nenjoy! All the favours, all the attentions, in the world cannot\ncompensate for the loss of that happiness which a cruel tyranny has\ndestroyed.\" My heart was full as I spoke. A recollection of many things\nwhich had happened pressed upon my mind, and filled my eyes with tears.\n\"We should daily repeat to ourselves,\" I exclaimed, \"that we should not\ninterfere with our friends, unless to leave them in possession of their\nown joys, and increase their happiness by sharing it with them! But when\ntheir souls are tormented by a violent passion, or their hearts\nrent with grief, is it in your power to afford them the slightest\nconsolation?\n\n\"And when the last fatal malady seizes the being whose untimely grave\nyou have prepared, when she lies languid and exhausted before you, her\ndim eyes raised to heaven, and the damp of death upon her pallid brow,\nthere you stand at her bedside like a condemned criminal, with the\nbitter feeling that your whole fortune could not save her; and the\nagonising thought wrings you, that all your efforts are powerless to\nimpart even a moment's strength to the departing soul, or quicken her\nwith a transitory consolation.\"\n\nAt these words the remembrance of a similar scene at which I had been\nonce present fell with full force upon my heart. I buried my face in my\nhandkerchief, and hastened from the room, and was only recalled to my\nrecollection by Charlotte's voice, who reminded me that it was time to\nreturn home. With what tenderness she chid me on the way for the too\neager interest I took in everything! She declared it would do me injury,\nand that I ought to spare myself. Yes, my angel! I will do so for your\nsake.\n\nJULY 6.\n\nShe is still with her dying friend, and is still the same bright,\nbeautiful creature whose presence softens pain, and sheds happiness\naround whichever way she turns. She went out yesterday with her little\nsisters: I knew it, and went to meet them; and we walked together. In\nabout an hour and a half we returned to the town. We stopped at the\nspring I am so fond of, and which is now a thousand times dearer to me\nthan ever. Charlotte seated herself upon the low wall, and we gathered\nabout her. I looked around, and recalled the time when my heart was\nunoccupied and free. \"Dear fountain!\" I said, \"since that time I have no\nmore come to enjoy cool repose by thy fresh stream: I have passed thee\nwith careless steps, and scarcely bestowed a glance upon thee.\" I looked\ndown, and observed Charlotte's little sister, Jane, coming up the\nsteps with a glass of water. I turned toward Charlotte, and I felt her\ninfluence over me. Jane at the moment approached with the glass. Her\nsister, Marianne, wished to take it from her. \"No!\" cried the child,\nwith the sweetest expression of face, \"Charlotte must drink first.\"\n\nThe affection and simplicity with which this was uttered so charmed\nme, that I sought to express my feelings by catching up the child and\nkissing her heartily. She was frightened, and began to cry. \"You should\nnot do that,\" said Charlotte: I felt perplexed. \"Come, Jane,\" she\ncontinued, taking her hand, and leading her down the steps again, \"it\nis no matter: wash yourself quickly in the fresh water.\" I stood and\nwatched them; and when I saw the little dear rubbing her cheeks with\nher wet hands, in full belief that all the impurities contracted from my\nugly beard would be washed off by the miraculous water, and how, though\nCharlotte said it would do, she continued still to wash with all her\nmight, as though she thought too much were better than too little, I\nassure you, Wilhelm, I never attended a baptism with greater reverence;\nand, when Charlotte came up from the well, I could have prostrated\nmyself as before the prophet of an Eastern nation.\n\nIn the evening I would not resist telling the story to a person who,\nI thought, possessed some natural feeling, because he was a man of\nunderstanding. But what a mistake I made. He maintained it was very\nwrong of Charlotte, that we should not deceive children, that such\nthings occasioned countless mistakes and superstitions, from which we\nwere bound to protect the young. It occurred to me then, that this very\nman had been baptised only a week before; so I said nothing further,\nbut maintained the justice of my own convictions. We should deal with\nchildren as God deals with us, we are happiest under the influence of\ninnocent delusions.\n\nJULY 8.\n\nWhat a child is man that he should be so solicitous about a look! What a\nchild is man! We had been to Walheim: the ladies went in a carriage;\nbut during our walk I thought I saw in Charlotte's dark eyes--I am a\nfool--but forgive me! you should see them,--those eyes.--However, to be\nbrief (for my own eyes are weighed down with sleep), you must know,\nwhen the ladies stepped into their carriage again, young W. Seldstadt,\nAndran, and I were standing about the door. They are a merry set of\nfellows, and they were all laughing and joking together. I watched\nCharlotte's eyes. They wandered from one to the other; but they did not\nlight on me, on me, who stood there motionless, and who saw nothing but\nher! My heart bade her a thousand times adieu, but she noticed me not.\nThe carriage drove off; and my eyes filled with tears. I looked after\nher: suddenly I saw Charlotte's bonnet leaning out of the window, and\nshe turned to look back, was it at me? My dear friend, I know not; and\nin this uncertainty I find consolation. Perhaps she turned to look at\nme. Perhaps! Good-night--what a child I am!\n\nJULY 10.\n\nYou should see how foolish I look in company when her name is mentioned,\nparticularly when I am asked plainly how I like her. How I like her!\nI detest the phrase. What sort of creature must he be who merely liked\nCharlotte, whose whole heart and senses were not entirely absorbed by\nher. Like her! Some one asked me lately how I liked Ossian.\n\nJULY 11.\n\nMadame M--is very ill. I pray for her recovery, because Charlotte shares\nmy sufferings. I see her occasionally at my friend's house, and to-day\nshe has told me the strangest circumstance. Old M--is a covetous,\nmiserly fellow, who has long worried and annoyed the poor lady sadly;\nbut she has borne her afflictions patiently. A few days ago, when the\nphysician informed us that her recovery was hopeless, she sent for\nher husband (Charlotte was present), and addressed him thus: \"I have\nsomething to confess, which, after my decease, may occasion trouble\nand confusion. I have hitherto conducted your household as frugally and\neconomically as possible, but you must pardon me for having defrauded\nyou for thirty years. At the commencement of our married life, you\nallowed a small sum for the wants of the kitchen, and the other\nhousehold expenses. When our establishment increased and our property\ngrew larger, I could not persuade you to increase the weekly allowance\nin proportion: in short, you know, that, when our wants were greatest,\nyou required me to supply everything with seven florins a week. I\ntook the money from you without an observation, but made up the weekly\ndeficiency from the money-chest; as nobody would suspect your wife of\nrobbing the household bank. But I have wasted nothing, and should have\nbeen content to meet my eternal Judge without this confession, if she,\nupon whom the management of your establishment will devolve after my\ndecease, would be free from embarrassment upon your insisting that the\nallowance made to me, your former wife, was sufficient.\"\n\nI talked with Charlotte of the inconceivable manner in which men allow\nthemselves to be blinded; how any one could avoid suspecting some\ndeception, when seven florins only were allowed to defray expenses\ntwice as great. But I have myself known people who believed, without\nany visible astonishment, that their house possessed the prophet's\nnever-failing cruse of oil.\n\nJULY 13.\n\nNo, I am not deceived. In her dark eyes I read a genuine interest in me\nand in my fortunes. Yes, I feel it; and I may believe my own heart which\ntells me--dare I say it?--dare I pronounce the divine words?--that she\nloves me!\n\nThat she loves me! How the idea exalts me in my own eyes! And, as you\ncan understand my feelings, I may say to you, how I honour myself since\nshe loves me!\n\nIs this presumption, or is it a consciousness of the truth? I do not\nknow a man able to supplant me in the heart of Charlotte; and yet when\nshe speaks of her betrothed with so much warmth and affection, I feel\nlike the soldier who has been stripped of his honours and titles, and\ndeprived of his sword.\n\nJULY 16.\n\nHow my heart beats when by accident I touch her finger, or my feet meet\nhers under the table! I draw back as if from a furnace; but a secret\nforce impels me forward again, and my senses become disordered.\nHer innocent, unconscious heart never knows what agony these little\nfamiliarities inflict upon me. Sometimes when we are talking she lays\nher hand upon mine, and in the eagerness of conversation comes closer to\nme, and her balmy breath reaches my lips,--when I feel as if lightning\nhad struck me, and that I could sink into the earth. And yet, Wilhelm,\nwith all this heavenly confidence,--if I know myself, and should ever\ndare--you understand me. No, no! my heart is not so corrupt, it is weak,\nweak enough but is not that a degree of corruption?\n\nShe is to me a sacred being. All passion is still in her presence: I\ncannot express my sensations when I am near her. I feel as if my soul\nbeat in every nerve of my body. There is a melody which she plays on the\npiano with angelic skill,--so simple is it, and yet so spiritual! It is\nher favourite air; and, when she plays the first note, all pain, care,\nand sorrow disappear from me in a moment.\n\nI believe every word that is said of the magic of ancient music. How her\nsimple song enchants me! Sometimes, when I am ready to commit suicide,\nshe sings that air; and instantly the gloom and madness which hung over\nme are dispersed, and I breathe freely again.\n\nJULY 18.\n\nWilhelm, what is the world to our hearts without love? What is a\nmagic-lantern without light? You have but to kindle the flame within,\nand the brightest figures shine on the white wall; and, if love only\nshow us fleeting shadows, we are yet happy, when, like mere children, we\nbehold them, and are transported with the splendid phantoms. I have not\nbeen able to see Charlotte to-day. I was prevented by company from which\nI could not disengage myself. What was to be done? I sent my servant to\nher house, that I might at least see somebody to-day who had been near\nher. Oh, the impatience with which I waited for his return! the joy with\nwhich I welcomed him! I should certainly have caught him in my arms, and\nkissed him, if I had not been ashamed.\n\nIt is said that the Bonona stone, when placed in the sun, attracts the\nrays, and for a time appears luminous in the dark. So was it with me\nand this servant. The idea that Charlotte's eyes had dwelt on his\ncountenance, his cheek, his very apparel, endeared them all inestimably\nto me, so that at the moment I would not have parted from him for a\nthousand crowns. His presence made me so happy! Beware of laughing at\nme, Wilhelm. Can that be a delusion which makes us happy?\n\nJULY 19.\n\n\"I shall see her today!\" I exclaim with delight, when I rise in the\nmorning, and look out with gladness of heart at the bright, beautiful\nsun. \"I shall see her today!\" And then I have no further wish to form:\nall, all is included in that one thought.\n\nJULY 20.\n\nI cannot assent to your proposal that I should accompany the ambassador\nto ------. I do not love subordination; and we all know that he is\na rough, disagreeable person to be connected with. You say my mother\nwishes me to be employed. I could not help laughing at that. Am I not\nsufficiently employed? And is it not in reality the same, whether\nI shell peas or count lentils? The world runs on from one folly to\nanother; and the man who, solely from regard to the opinion of others,\nand without any wish or necessity of his own, toils after gold, honour,\nor any other phantom, is no better than a fool.\n\nJULY 24.\n\nYou insist so much on my not neglecting my drawing, that it would be as\nwell for me to say nothing as to confess how little I have lately done.\n\nI never felt happier, I never understood nature better, even down to the\nveriest stem or smallest blade of grass; and yet I am unable to express\nmyself: my powers of execution are so weak, everything seems to swim\nand float before me, so that I cannot make a clear, bold outline. But\nI fancy I should succeed better if I had some clay or wax to model. I\nshall try, if this state of mind continues much longer, and will take to\nmodelling, if I only knead dough.\n\nI have commenced Charlotte's portrait three times, and have as often\ndisgraced myself. This is the more annoying, as I was formerly very\nhappy in taking likenesses. I have since sketched her profile, and must\ncontent myself with that.\n\nJULY 25.\n\nYes, dear Charlotte! I will order and arrange everything. Only give\nme more commissions, the more the better. One thing, however, I must\nrequest: use no more writing-sand with the dear notes you send me. Today\nI raised your letter hastily to my lips, and it set my teeth on edge.\n\nJULY 26.\n\nI have often determined not to see her so frequently. But who could keep\nsuch a resolution? Every day I am exposed to the temptation, and promise\nfaithfully that to-morrow I will really stay away: but, when tomorrow\ncomes, I find some irresistible reason for seeing her; and, before I can\naccount for it, I am with her again. Either she has said on the previous\nevening \"You will be sure to call to-morrow,\"--and who could stay away\nthen?--or she gives me some commission, and I find it essential to take\nher the answer in person; or the day is fine, and I walk to Walheim;\nand, when I am there, it is only half a league farther to her. I am\nwithin the charmed atmosphere, and soon find myself at her side. My\ngrandmother used to tell us a story of a mountain of loadstone. When any\nvessels came near it, they were instantly deprived of their ironwork:\nthe nails flew to the mountain, and the unhappy crew perished amidst the\ndisjointed planks.\n\nJULY 30.\n\nAlbert is arrived, and I must take my departure. Were he the best and\nnoblest of men, and I in every respect his inferior, I could not endure\nto see him in possession of such a perfect being. Possession!--enough,\nWilhelm: her betrothed is here,--a fine, worthy fellow, whom one cannot\nhelp liking. Fortunately I was not present at their meeting. It would\nhave broken my heart! And he is so considerate: he has not given\nCharlotte one kiss in my presence. Heaven reward him for it! I must love\nhim for the respect with which he treats her. He shows a regard for me,\nbut for this I suspect I am more indebted to Charlotte than to his own\nfancy for me. Women have a delicate tact in such matters, and it should\nbe so. They cannot always succeed in keeping two rivals on terms with\neach other; but, when they do, they are the only gainers.\n\nI cannot help esteeming Albert. The coolness of his temper contrasts\nstrongly with the impetuosity of mine, which I cannot conceal. He has\na great deal of feeling, and is fully sensible of the treasure he\npossesses in Charlotte. He is free from ill-humour, which you know is\nthe fault I detest most.\n\nHe regards me as a man of sense; and my attachment to Charlotte, and the\ninterest I take in all that concerns her, augment his triumph and his\nlove. I shall not inquire whether he may not at times tease her with\nsome little jealousies; as I know, that, were I in his place, I should\nnot be entirely free from such sensations.\n\nBut, be that as it may, my pleasure with Charlotte is over. Call it\nfolly or infatuation, what signifies a name? The thing speaks for\nitself. Before Albert came, I knew all that I know now. I knew I could\nmake no pretensions to her, nor did I offer any, that is, as far as it\nwas possible, in the presence of so much loveliness, not to pant for\nits enjoyment. And now, behold me like a silly fellow, staring with\nastonishment when another comes in, and deprives me of my love.\n\nI bite my lips, and feel infinite scorn for those who tell me to be\nresigned, because there is no help for it. Let me escape from the yoke\nof such silly subterfuges! I ramble through the woods; and when I return\nto Charlotte, and find Albert sitting by her side in the summer-house\nin the garden, I am unable to bear it, behave like a fool, and commit a\nthousand extravagances. \"For Heaven's sake,\" said Charlotte today, \"let\nus have no more scenes like those of last night! You terrify me when you\nare so violent.\" Between ourselves, I am always away now when he visits\nher: and I feel delighted when I find her alone.\n\nAUGUST 8.\n\nBelieve me, dear Wilhelm, I did not allude to you when I spoke so\nseverely of those who advise resignation to inevitable fate. I did not\nthink it possible for you to indulge such a sentiment. But in fact you\nare right. I only suggest one objection. In this world one is seldom\nreduced to make a selection between two alternatives. There are as many\nvarieties of conduct and opinion as there are turns of feature between\nan aquiline nose and a flat one.\n\nYou will, therefore, permit me to concede your entire argument, and yet\ncontrive means to escape your dilemma.\n\nYour position is this, I hear you say: \"Either you have hopes of\nobtaining Charlotte, or you have none. Well, in the first case, pursue\nyour course, and press on to the fulfilment of your wishes. In the\nsecond, be a man, and shake off a miserable passion, which will enervate\nand destroy you.\" My dear friend, this is well and easily said.\n\nBut would you require a wretched being, whose life is slowly wasting\nunder a lingering disease, to despatch himself at once by the stroke of\na dagger? Does not the very disorder which consumes his strength deprive\nhim of the courage to effect his deliverance?\n\nYou may answer me, if you please, with a similar analogy, \"Who would\nnot prefer the amputation of an arm to the periling of life by doubt and\nprocrastination!\" But I know not if I am right, and let us leave these\ncomparisons.\n\nEnough! There are moments, Wilhelm, when I could rise up and shake it\nall off, and when, if I only knew where to go, I could fly from this\nplace.\n\nTHE SAME EVENING.\n\nMy diary, which I have for some time neglected, came before me today;\nand I am amazed to see how deliberately I have entangled myself step by\nstep. To have seen my position so clearly, and yet to have acted so like\na child! Even still I behold the result plainly, and yet have no thought\nof acting with greater prudence.\n\nAUGUST 10.\n\nIf I were not a fool, I could spend the happiest and most delightful\nlife here. So many agreeable circumstances, and of a kind to ensure\na worthy man's happiness, are seldom united. Alas! I feel it too\nsensibly,--the heart alone makes our happiness! To be admitted into\nthis most charming family, to be loved by the father as a son, by the\nchildren as a father, and by Charlotte! then the noble Albert, who never\ndisturbs my happiness by any appearance of ill-humour, receiving me with\nthe heartiest affection, and loving me, next to Charlotte, better\nthan all the world! Wilhelm, you would be delighted to hear us in our\nrambles, and conversations about Charlotte. Nothing in the world can be\nmore absurd than our connection, and yet the thought of it often moves\nme to tears.\n\nHe tells me sometimes of her excellent mother; how, upon her death-bed,\nshe had committed her house and children to Charlotte, and had given\nCharlotte herself in charge to him; how, since that time, a new spirit\nhad taken possession of her; how, in care and anxiety for their welfare,\nshe became a real mother to them; how every moment of her time was\ndevoted to some labour of love in their behalf,--and yet her mirth and\ncheerfulness had never forsaken her. I walk by his side, pluck flowers\nby the way, arrange them carefully into a nosegay, then fling them into\nthe first stream I pass, and watch them as they float gently away. I\nforget whether I told you that Albert is to remain here. He has received\na government appointment, with a very good salary; and I understand\nhe is in high favour at court. I have met few persons so punctual and\nmethodical in business.\n\nAUGUST 12.\n\nCertainly Albert is the best fellow in the world. I had a strange scene\nwith him yesterday. I went to take leave of him; for I took it into my\nhead to spend a few days in these mountains, from where I now write\nto you. As I was walking up and down his room, my eye fell upon his\npistols. \"Lend me those pistols,\" said I, \"for my journey.\" \"By all\nmeans,\" he replied, \"if you will take the trouble to load them; for they\nonly hang there for form.\" I took down one of them; and he continued,\n\"Ever since I was near suffering for my extreme caution, I will have\nnothing to do with such things.\" I was curious to hear the story. \"I was\nstaying,\" said he, \"some three months ago, at a friend's house in the\ncountry. I had a brace of pistols with me, unloaded; and I slept without\nany anxiety. One rainy afternoon I was sitting by myself, doing nothing,\nwhen it occurred to me I do not know how that the house might be\nattacked, that we might require the pistols, that we might in short, you\nknow how we go on fancying, when we have nothing better to do. I gave\nthe pistols to the servant, to clean and load. He was playing with the\nmaid, and trying to frighten her, when the pistol went off--God knows\nhow!--the ramrod was in the barrel; and it went straight through\nher right hand, and shattered the thumb. I had to endure all the\nlamentation, and to pay the surgeon's bill; so, since that time, I have\nkept all my weapons unloaded. But, my dear friend, what is the use of\nprudence? We can never be on our guard against all possible dangers.\nHowever,\"--now, you must know I can tolerate all men till they come to\n\"however;\"--for it is self-evident that every universal rule must have\nits exceptions. But he is so exceedingly accurate, that, if he only\nfancies he has said a word too precipitate, or too general, or only half\ntrue, he never ceases to qualify, to modify, and extenuate, till at last\nhe appears to have said nothing at all. Upon this occasion, Albert was\ndeeply immersed in his subject: I ceased to listen to him, and became\nlost in reverie. With a sudden motion, I pointed the mouth of the pistol\nto my forehead, over the right eye. \"What do you mean?\" cried Albert,\nturning back the pistol. \"It is not loaded,\" said I. \"And even if not,\"\nhe answered with impatience, \"what can you mean? I cannot comprehend how\na man can be so mad as to shoot himself, and the bare idea of it shocks\nme.\"\n\n\"But why should any one,\" said I, \"in speaking of an action, venture\nto pronounce it mad or wise, or good or bad? What is the meaning of all\nthis? Have you carefully studied the secret motives of our actions? Do\nyou understand--can you explain the causes which occasion them, and make\nthem inevitable? If you can, you will be less hasty with your decision.\"\n\n\"But you will allow,\" said Albert; \"that some actions are criminal, let\nthem spring from whatever motives they may.\" I granted it, and shrugged\nmy shoulders.\n\n\"But still, my good friend,\" I continued, \"there are some exceptions\nhere too. Theft is a crime; but the man who commits it from extreme\npoverty, with no design but to save his family from perishing, is he an\nobject of pity, or of punishment? Who shall throw the first stone at a\nhusband, who, in the heat of just resentment, sacrifices his faithless\nwife and her perfidious seducer? or at the young maiden, who, in her\nweak hour of rapture, forgets herself in the impetuous joys of love?\nEven our laws, cold and cruel as they are, relent in such cases, and\nwithhold their punishment.\"\n\n\"That is quite another thing,\" said Albert; \"because a man under the\ninfluence of violent passion loses all power of reflection, and is\nregarded as intoxicated or insane.\"\n\n\"Oh! you people of sound understandings,\" I replied, smiling, \"are ever\nready to exclaim 'Extravagance, and madness, and intoxication!' You\nmoral men are so calm and so subdued! You abhor the drunken man, and\ndetest the extravagant; you pass by, like the Levite, and thank God,\nlike the Pharisee, that you are not like one of them. I have been more\nthan once intoxicated, my passions have always bordered on extravagance:\nI am not ashamed to confess it; for I have learned, by my own\nexperience, that all extraordinary men, who have accomplished great and\nastonishing actions, have ever been decried by the world as drunken or\ninsane. And in private life, too, is it not intolerable that no one can\nundertake the execution of a noble or generous deed, without giving rise\nto the exclamation that the doer is intoxicated or mad? Shame upon you,\nye sages!\"\n\n\"This is another of your extravagant humours,\" said Albert: \"you always\nexaggerate a case, and in this matter you are undoubtedly wrong; for we\nwere speaking of suicide, which you compare with great actions, when it\nis impossible to regard it as anything but a weakness. It is much easier\nto die than to bear a life of misery with fortitude.\"\n\nI was on the point of breaking off the conversation, for nothing puts me\nso completely out of patience as the utterance of a wretched commonplace\nwhen I am talking from my inmost heart. However, I composed myself, for\nI had often heard the same observation with sufficient vexation; and\nI answered him, therefore, with a little warmth, \"You call this a\nweakness--beware of being led astray by appearances. When a nation,\nwhich has long groaned under the intolerable yoke of a tyrant, rises at\nlast and throws off its chains, do you call that weakness? The man\nwho, to rescue his house from the flames, finds his physical strength\nredoubled, so that he lifts burdens with ease, which, in the absence of\nexcitement, he could scarcely move; he who, under the rage of an insult,\nattacks and puts to flight half a score of his enemies, are such persons\nto be called weak? My good friend, if resistance be strength, how can\nthe highest degree of resistance be a weakness?\"\n\nAlbert looked steadfastly at me, and said, \"Pray forgive me, but I do\nnot see that the examples you have adduced bear any relation to the\nquestion.\" \"Very likely,\" I answered; \"for I have often been told that\nmy style of illustration borders a little on the absurd. But let us see\nif we cannot place the matter in another point of view, by inquiring\nwhat can be a man's state of mind who resolves to free himself from\nthe burden of life,--a burden often so pleasant to bear,--for we cannot\notherwise reason fairly upon the subject.\n\n\"Human nature,\" I continued, \"has its limits. It is able to endure a\ncertain degree of joy, sorrow, and pain, but becomes annihilated as soon\nas this measure is exceeded. The question, therefore, is, not whether a\nman is strong or weak, but whether he is able to endure the measure\nof his sufferings. The suffering may be moral or physical; and in\nmy opinion it is just as absurd to call a man a coward who destroys\nhimself, as to call a man a coward who dies of a malignant fever.\"\n\n\"Paradox, all paradox!\" exclaimed Albert. \"Not so paradoxical as you\nimagine,\" I replied. \"You allow that we designate a disease as mortal\nwhen nature is so severely attacked, and her strength so far exhausted,\nthat she cannot possibly recover her former condition under any change\nthat may take place.\n\n\"Now, my good friend, apply this to the mind; observe a man in\nhis natural, isolated condition; consider how ideas work, and how\nimpressions fasten on him, till at length a violent passion seizes him,\ndestroying all his powers of calm reflection, and utterly ruining him.\n\n\"It is in vain that a man of sound mind and cool temper understands the\ncondition of such a wretched being, in vain he counsels him. He can no\nmore communicate his own wisdom to him than a healthy man can instil his\nstrength into the invalid, by whose bedside he is seated.\"\n\nAlbert thought this too general. I reminded him of a girl who had\ndrowned herself a short time previously, and I related her history.\n\nShe was a good creature, who had grown up in the narrow sphere of\nhousehold industry and weekly appointed labour; one who knew no pleasure\nbeyond indulging in a walk on Sundays, arrayed in her best attire,\naccompanied by her friends, or perhaps joining in the dance now and then\nat some festival, and chatting away her spare hours with a neighbour,\ndiscussing the scandal or the quarrels of the village, trifles\nsufficient to occupy her heart. At length the warmth of her nature is\ninfluenced by certain new and unknown wishes. Inflamed by the flatteries\nof men, her former pleasures become by degrees insipid, till at length\nshe meets with a youth to whom she is attracted by an indescribable\nfeeling; upon him she now rests all her hopes; she forgets the world\naround her; she sees, hears, desires nothing but him, and him only. He\nalone occupies all her thoughts. Uncorrupted by the idle indulgence of\nan enervating vanity, her affection moving steadily toward its object,\nshe hopes to become his, and to realise, in an everlasting union with\nhim, all that happiness which she sought, all that bliss for which\nshe longed. His repeated promises confirm her hopes: embraces and\nendearments, which increase the ardour of her desires, overmaster her\nsoul. She floats in a dim, delusive anticipation of her happiness; and\nher feelings become excited to their utmost tension. She stretches out\nher arms finally to embrace the object of all her wishes and her lover\nforsakes her. Stunned and bewildered, she stands upon a precipice. All\nis darkness around her. No prospect, no hope, no consolation--forsaken\nby him in whom her existence was centred! She sees nothing of the wide\nworld before her, thinks nothing of the many individuals who might\nsupply the void in her heart; she feels herself deserted, forsaken by\nthe world; and, blinded and impelled by the agony which wrings her soul,\nshe plunges into the deep, to end her sufferings in the broad embrace of\ndeath. See here, Albert, the history of thousands; and tell me, is not\nthis a case of physical infirmity? Nature has no way to escape from the\nlabyrinth: her powers are exhausted: she can contend no longer, and the\npoor soul must die.\n\n\"Shame upon him who can look on calmly, and exclaim, 'The foolish girl!\nshe should have waited; she should have allowed time to wear off the\nimpression; her despair would have been softened, and she would have\nfound another lover to comfort her.' One might as well say, 'The fool,\nto die of a fever! why did he not wait till his strength was restored,\ntill his blood became calm? all would then have gone well, and he would\nhave been alive now.'\"\n\nAlbert, who could not see the justice of the comparison, offered some\nfurther objections, and, amongst others, urged that I had taken the\ncase of a mere ignorant girl. But how any man of sense, of more enlarged\nviews and experience, could be excused, he was unable to comprehend. \"My\nfriend!\" I exclaimed, \"man is but man; and, whatever be the extent\nof his reasoning powers, they are of little avail when passion rages\nwithin, and he feels himself confined by the narrow limits of nature.\nIt were better, then--but we will talk of this some other time,\" I said,\nand caught up my hat. Alas! my heart was full; and we parted without\nconviction on either side. How rarely in this world do men understand\neach other!\n\nAUGUST 15.\n\nThere can be no doubt that in this world nothing is so indispensable as\nlove. I observe that Charlotte could not lose me without a pang, and the\nvery children have but one wish; that is, that I should visit them again\nto-morrow. I went this afternoon to tune Charlotte's piano. But I could\nnot do it, for the little ones insisted on my telling them a story; and\nCharlotte herself urged me to satisfy them. I waited upon them at tea,\nand they are now as fully contented with me as with Charlotte; and\nI told them my very best tale of the princess who was waited upon by\ndwarfs. I improve myself by this exercise, and am quite surprised at the\nimpression my stories create. If I sometimes invent an incident which I\nforget upon the next narration, they remind one directly that the story\nwas different before; so that I now endeavour to relate with exactness\nthe same anecdote in the same monotonous tone, which never changes. I\nfind by this, how much an author injures his works by altering them,\neven though they be improved in a poetical point of view. The first\nimpression is readily received. We are so constituted that we believe\nthe most incredible things; and, once they are engraved upon the memory,\nwoe to him who would endeavour to efface them.\n\nAUGUST 18.\n\nMust it ever be thus,--that the source of our happiness must also be the\nfountain of our misery? The full and ardent sentiment which animated\nmy heart with the love of nature, overwhelming me with a torrent of\ndelight, and which brought all paradise before me, has now become an\ninsupportable torment, a demon which perpetually pursues and harasses\nme. When in bygone days I gazed from these rocks upon yonder mountains\nacross the river, and upon the green, flowery valley before me, and saw\nall nature budding and bursting around; the hills clothed from foot\nto peak with tall, thick forest trees; the valleys in all their varied\nwindings, shaded with the loveliest woods; and the soft river gliding\nalong amongst the lisping reeds, mirroring the beautiful clouds which\nthe soft evening breeze wafted across the sky,--when I heard the groves\nabout me melodious with the music of birds, and saw the million swarms\nof insects dancing in the last golden beams of the sun, whose setting\nrays awoke the humming beetles from their grassy beds, whilst the\nsubdued tumult around directed my attention to the ground, and I there\nobserved the arid rock compelled to yield nutriment to the dry moss,\nwhilst the heath flourished upon the barren sands below me, all this\ndisplayed to me the inner warmth which animates all nature, and filled\nand glowed within my heart. I felt myself exalted by this overflowing\nfulness to the perception of the Godhead, and the glorious forms of\nan infinite universe became visible to my soul! Stupendous mountains\nencompassed me, abysses yawned at my feet, and cataracts fell headlong\ndown before me; impetuous rivers rolled through the plain, and rocks\nand mountains resounded from afar. In the depths of the earth I saw\ninnumerable powers in motion, and multiplying to infinity; whilst\nupon its surface, and beneath the heavens, there teemed ten thousand\nvarieties of living creatures. Everything around is alive with an\ninfinite number of forms; while mankind fly for security to their petty\nhouses, from the shelter of which they rule in their imaginations over\nthe wide-extended universe. Poor fool! in whose petty estimation all\nthings are little. From the inaccessible mountains, across the desert\nwhich no mortal foot has trod, far as the confines of the unknown ocean,\nbreathes the spirit of the eternal Creator; and every atom to which he\nhas given existence finds favour in his sight. Ah, how often at that\ntime has the flight of a bird, soaring above my head, inspired me\nwith the desire of being transported to the shores of the immeasurable\nwaters, there to quaff the pleasures of life from the foaming goblet\nof the Infinite, and to partake, if but for a moment even, with\nthe confined powers of my soul, the beatitude of that Creator who\naccomplishes all things in himself, and through himself!\n\nMy dear friend, the bare recollection of those hours still consoles me.\nEven this effort to recall those ineffable sensations, and give them\nutterance, exalts my soul above itself, and makes me doubly feel the\nintensity of my present anguish.\n\nIt is as if a curtain had been drawn from before my eyes, and, instead\nof prospects of eternal life, the abyss of an ever open grave yawned\nbefore me. Can we say of anything that it exists when all passes away,\nwhen time, with the speed of a storm, carries all things onward,--and\nour transitory existence, hurried along by the torrent, is either\nswallowed up by the waves or dashed against the rocks? There is not a\nmoment but preys upon you,--and upon all around you, not a moment in\nwhich you do not yourself become a destroyer. The most innocent walk\ndeprives of life thousands of poor insects: one step destroys the fabric\nof the industrious ant, and converts a little world into chaos. No:\nit is not the great and rare calamities of the world, the floods which\nsweep away whole villages, the earthquakes which swallow up our towns,\nthat affect me. My heart is wasted by the thought of that destructive\npower which lies concealed in every part of universal nature. Nature has\nformed nothing that does not consume itself, and every object near\nit: so that, surrounded by earth and air, and all the active powers, I\nwander on my way with aching heart; and the universe is to me a fearful\nmonster, for ever devouring its own offspring.\n\nAUGUST 21.\n\nIn vain do I stretch out my arms toward her when I awaken in the morning\nfrom my weary slumbers. In vain do I seek for her at night in my bed,\nwhen some innocent dream has happily deceived me, and placed her near me\nin the fields, when I have seized her hand and covered it with countless\nkisses. And when I feel for her in the half confusion of sleep, with the\nhappy sense that she is near, tears flow from my oppressed heart; and,\nbereft of all comfort, I weep over my future woes.\n\nAUGUST 22.\n\nWhat a misfortune, Wilhelm! My active spirits have degenerated into\ncontented indolence. I cannot be idle, and yet I am unable to set to\nwork. I cannot think: I have no longer any feeling for the beauties of\nnature, and books are distasteful to me. Once we give ourselves up, we\nare totally lost. Many a time and oft I wish I were a common labourer;\nthat, awakening in the morning, I might have but one prospect, one\npursuit, one hope, for the day which has dawned. I often envy Albert\nwhen I see him buried in a heap of papers and parchments, and I fancy I\nshould be happy were I in his place. Often impressed with this feeling\nI have been on the point of writing to you and to the minister, for the\nappointment at the embassy, which you think I might obtain. I believe I\nmight procure it. The minister has long shown a regard for me, and has\nfrequently urged me to seek employment. It is the business of an\nhour only. Now and then the fable of the horse recurs to me. Weary of\nliberty, he suffered himself to be saddled and bridled, and was ridden\nto death for his pains. I know not what to determine upon. For is not\nthis anxiety for change the consequence of that restless spirit which\nwould pursue me equally in every situation of life?\n\nAUGUST 28.\n\nIf my ills would admit of any cure, they would certainly be cured here.\nThis is my birthday, and early in the morning I received a packet from\nAlbert. Upon opening it, I found one of the pink ribbons which Charlotte\nwore in her dress the first time I saw her, and which I had several\ntimes asked her to give me. With it were two volumes in duodecimo\nof Wetstein's \"Homer,\" a book I had often wished for, to save me the\ninconvenience of carrying the large Ernestine edition with me upon my\nwalks. You see how they anticipate my wishes, how well they understand\nall those little attentions of friendship, so superior to the costly\npresents of the great, which are humiliating. I kissed the ribbon a\nthousand times, and in every breath inhaled the remembrance of those\nhappy and irrevocable days which filled me with the keenest joy. Such,\nWilhelm, is our fate. I do not murmur at it: the flowers of life are but\nvisionary. How many pass away, and leave no trace behind--how few yield\nany fruit--and the fruit itself, how rarely does it ripen! And yet there\nare flowers enough! and is it not strange, my friend, that we should\nsuffer the little that does really ripen, to rot, decay, and perish\nunenjoyed? Farewell! This is a glorious summer. I often climb into the\ntrees in Charlotte's orchard, and shake down the pears that hang on the\nhighest branches. She stands below, and catches them as they fall.\n\nAUGUST 30.\n\nUnhappy being that I am! Why do I thus deceive myself? What is to come\nof all this wild, aimless, endless passion? I cannot pray except to her.\nMy imagination sees nothing but her: all surrounding objects are of no\naccount, except as they relate to her. In this dreamy state I enjoy many\nhappy hours, till at length I feel compelled to tear myself away from\nher. Ah, Wilhelm, to what does not my heart often compel me! When I have\nspent several hours in her company, till I feel completely absorbed by\nher figure, her grace, the divine expression of her thoughts, my mind\nbecomes gradually excited to the highest excess, my sight grows dim,\nmy hearing confused, my breathing oppressed as if by the hand of a\nmurderer, and my beating heart seeks to obtain relief for my aching\nsenses. I am sometimes unconscious whether I really exist. If in such\nmoments I find no sympathy, and Charlotte does not allow me to enjoy\nthe melancholy consolation of bathing her hand with my tears, I feel\ncompelled to tear myself from her, when I either wander through the\ncountry, climb some precipitous cliff, or force a path through the\ntrackless thicket, where I am lacerated and torn by thorns and briers;\nand thence I find relief. Sometimes I lie stretched on the ground,\novercome with fatigue and dying with thirst; sometimes, late in the\nnight, when the moon shines above me, I recline against an aged tree\nin some sequestered forest, to rest my weary limbs, when, exhausted\nand worn, I sleep till break of day. O Wilhelm! the hermit's cell, his\nsackcloth, and girdle of thorns would be luxury and indulgence compared\nwith what I suffer. Adieu! I see no end to this wretchedness except the\ngrave.\n\nSEPTEMBER 3.\n\nI must away. Thank you, Wilhelm, for determining my wavering purpose.\nFor a whole fortnight I have thought of leaving her. I must away.\nShe has returned to town, and is at the house of a friend. And then,\nAlbert--yes, I must go.\n\nSEPTEMBER 10.\n\nOh, what a night, Wilhelm! I can henceforth bear anything. I shall never\nsee her again. Oh, why cannot I fall on your neck, and, with floods of\ntears and raptures, give utterance to all the passions which distract my\nheart! Here I sit gasping for breath, and struggling to compose myself.\nI wait for day, and at sunrise the horses are to be at the door.\n\nAnd she is sleeping calmly, little suspecting that she has seen me for\nthe last time. I am free. I have had the courage, in an interview of\ntwo hours' duration, not to betray my intention. And O Wilhelm, what a\nconversation it was!\n\nAlbert had promised to come to Charlotte in the garden immediately\nafter supper. I was upon the terrace under the tall chestnut trees, and\nwatched the setting sun. I saw him sink for the last time beneath this\ndelightful valley and silent stream. I had often visited the same\nspot with Charlotte, and witnessed that glorious sight; and now--I was\nwalking up and down the very avenue which was so dear to me. A secret\nsympathy had frequently drawn me thither before I knew Charlotte; and\nwe were delighted when, in our early acquaintance, we discovered that we\neach loved the same spot, which is indeed as romantic as any that ever\ncaptivated the fancy of an artist.\n\nFrom beneath the chestnut trees, there is an extensive view. But I\nremember that I have mentioned all this in a former letter, and have\ndescribed the tall mass of beech trees at the end, and how the avenue\ngrows darker and darker as it winds its way among them, till it ends\nin a gloomy recess, which has all the charm of a mysterious solitude. I\nstill remember the strange feeling of melancholy which came over me the\nfirst time I entered that dark retreat, at bright midday. I felt some\nsecret foreboding that it would, one day, be to me the scene of some\nhappiness or misery.\n\nI had spent half an hour struggling between the contending thoughts of\ngoing and returning, when I heard them coming up the terrace. I ran to\nmeet them. I trembled as I took her hand, and kissed it. As we reached\nthe top of the terrace, the moon rose from behind the wooded hill. We\nconversed on many subjects, and, without perceiving it, approached the\ngloomy recess. Charlotte entered, and sat down. Albert seated himself\nbeside her. I did the same, but my agitation did not suffer me to remain\nlong seated. I got up, and stood before her, then walked backward and\nforward, and sat down again. I was restless and miserable. Charlotte\ndrew our attention to the beautiful effect of the moonlight, which threw\na silver hue over the terrace in front of us, beyond the beech trees.\nIt was a glorious sight, and was rendered more striking by the darkness\nwhich surrounded the spot where we were. We remained for some time\nsilent, when Charlotte observed, \"Whenever I walk by moonlight, it\nbrings to my remembrance all my beloved and departed friends, and I\nam filled with thoughts of death and futurity. We shall live again,\nWerther!\" she continued, with a firm but feeling voice; \"but shall we\nknow one another again what do you think? what do you say?\"\n\n\"Charlotte,\" I said, as I took her hand in mine, and my eyes filled with\ntears, \"we shall see each other again--here and hereafter we shall meet\nagain.\" I could say no more. Why, Wilhelm, should she put this question\nto me, just at the moment when the fear of our cruel separation filled\nmy heart?\n\n\"And oh! do those departed ones know how we are employed here? do they\nknow when we are well and happy? do they know when we recall their\nmemories with the fondest love? In the silent hour of evening the shade\nof my mother hovers around me; when seated in the midst of my children,\nI see them assembled near me, as they used to assemble near her; and\nthen I raise my anxious eyes to heaven, and wish she could look down\nupon us, and witness how I fulfil the promise I made to her in her last\nmoments, to be a mother to her children. With what emotion do I then\nexclaim, 'Pardon, dearest of mothers, pardon me, if I do not adequately\nsupply your place! Alas! I do my utmost. They are clothed and fed; and,\nstill better, they are loved and educated. Could you but see, sweet\nsaint! the peace and harmony that dwells amongst us, you would glorify\nGod with the warmest feelings of gratitude, to whom, in your last hour,\nyou addressed such fervent prayers for our happiness.'\" Thus did she\nexpress herself; but O Wilhelm! who can do justice to her language? how\ncan cold and passionless words convey the heavenly expressions of the\nspirit? Albert interrupted her gently. \"This affects you too deeply,\nmy dear Charlotte. I know your soul dwells on such recollections with\nintense delight; but I implore--\" \"O Albert!\" she continued, \"I am sure\nyou do not forget the evenings when we three used to sit at the little\nround table, when papa was absent, and the little ones had retired. You\noften had a good book with you, but seldom read it; the conversation of\nthat noble being was preferable to everything,--that beautiful,\nbright, gentle, and yet ever-toiling woman. God alone knows how I have\nsupplicated with tears on my nightly couch, that I might be like her.\"\n\nI threw myself at her feet, and, seizing her hand, bedewed it with\na thousand tears. \"Charlotte!\" I exclaimed, \"God's blessing and your\nmother's spirit are upon you.\" \"Oh! that you had known her,\" she said,\nwith a warm pressure of the hand. \"She was worthy of being known to\nyou.\" I thought I should have fainted: never had I received praise so\nflattering. She continued, \"And yet she was doomed to die in the flower\nof her youth, when her youngest child was scarcely six months old. Her\nillness was but short, but she was calm and resigned; and it was only\nfor her children, especially the youngest, that she felt unhappy. When\nher end drew nigh, she bade me bring them to her. I obeyed. The younger\nones knew nothing of their approaching loss, while the elder ones were\nquite overcome with grief. They stood around the bed; and she raised\nher feeble hands to heaven, and prayed over them; then, kissing them in\nturn, she dismissed them, and said to me, 'Be you a mother to them.'\nI gave her my hand. 'You are promising much, my child,' she said: 'a\nmother's fondness and a mother's care! I have often witnessed, by your\ntears of gratitude, that you know what is a mother's tenderness: show it\nto your brothers and sisters, and be dutiful and faithful to your\nfather as a wife; you will be his comfort.' She inquired for him. He\nhad retired to conceal his intolerable anguish,--he was heartbroken,\n'Albert, you were in the room.' She heard some one moving: she inquired\nwho it was, and desired you to approach. She surveyed us both with a\nlook of composure and satisfaction, expressive of her conviction that\nwe should be happy,--happy with one another.\" Albert fell upon her neck,\nand kissed her, and exclaimed, \"We are so, and we shall be so!\" Even\nAlbert, generally so tranquil, had quite lost his composure; and I was\nexcited beyond expression.\n\n\"And such a being,\" She continued, \"was to leave us, Werther! Great God,\nmust we thus part with everything we hold dear in this world? Nobody\nfelt this more acutely than the children: they cried and lamented for\na long time afterward, complaining that men had carried away their dear\nmamma.\"\n\nCharlotte rose. It aroused me; but I continued sitting, and held her\nhand. \"Let us go,\" she said: \"it grows late.\" She attempted to withdraw\nher hand: I held it still. \"We shall see each other again,\" I exclaimed:\n\"we shall recognise each other under every possible change! I am going,\"\nI continued, \"going willingly; but, should I say for ever, perhaps I may\nnot keep my word. Adieu, Charlotte; adieu, Albert. We shall meet again.\"\n\"Yes: tomorrow, I think,\" she answered with a smile. Tomorrow! how I\nfelt the word! Ah! she little thought, when she drew her hand away from\nmine. They walked down the avenue. I stood gazing after them in the\nmoonlight. I threw myself upon the ground, and wept: I then sprang\nup, and ran out upon the terrace, and saw, under the shade of the\nlinden-trees, her white dress disappearing near the garden-gate. I\nstretched out my arms, and she vanished.\n\n\n\n\nBOOK II.\n\nOCTOBER 20.\n\nWe arrived here yesterday. The ambassador is indisposed, and will not\ngo out for some days. If he were less peevish and morose, all would\nbe well. I see but too plainly that Heaven has destined me to severe\ntrials; but courage! a light heart may bear anything. A light heart!\nI smile to find such a word proceeding from my pen. A little more\nlightheartedness would render me the happiest being under the sun.\nBut must I despair of my talents and faculties, whilst others of far\ninferior abilities parade before me with the utmost self-satisfaction?\nGracious Providence, to whom I owe all my powers, why didst thou not\nwithhold some of those blessings I possess, and substitute in their\nplace a feeling of self-confidence and contentment?\n\nBut patience! all will yet be well; for I assure you, my dear friend,\nyou were right: since I have been obliged to associate continually with\nother people, and observe what they do, and how they employ themselves,\nI have become far better satisfied with myself. For we are so\nconstituted by nature, that we are ever prone to compare ourselves with\nothers; and our happiness or misery depends very much on the objects\nand persons around us. On this account, nothing is more dangerous than\nsolitude: there our imagination, always disposed to rise, taking a new\nflight on the wings of fancy, pictures to us a chain of beings of whom\nwe seem the most inferior. All things appear greater than they really\nare, and all seem superior to us. This operation of the mind is quite\nnatural: we so continually feel our own imperfections, and fancy we\nperceive in others the qualities we do not possess, attributing to them\nalso all that we enjoy ourselves, that by this process we form the idea\nof a perfect, happy man,--a man, however, who only exists in our own\nimagination.\n\nBut when, in spite of weakness and disappointments, we set to work in\nearnest, and persevere steadily, we often find, that, though obliged\ncontinually to tack, we make more way than others who have the\nassistance of wind and tide; and, in truth, there can be no greater\nsatisfaction than to keep pace with others or outstrip them in the race.\n\nNovember 26.\n\nI begin to find my situation here more tolerable, considering all\ncircumstances. I find a great advantage in being much occupied; and the\nnumber of persons I meet, and their different pursuits, create a varied\nentertainment for me. I have formed the acquaintance of the Count\nC--and I esteem him more and more every day. He is a man of strong\nunderstanding and great discernment; but, though he sees farther than\nother people, he is not on that account cold in his manner, but capable\nof inspiring and returning the warmest affection. He appeared interested\nin me on one occasion, when I had to transact some business with him. He\nperceived, at the first word, that we understood each other, and that\nhe could converse with me in a different tone from what he used with\nothers. I cannot sufficiently esteem his frank and open kindness to me.\nIt is the greatest and most genuine of pleasures to observe a great mind\nin sympathy with our own.\n\nDECEMBER 24.\n\nAs I anticipated, the ambassador occasions me infinite annoyance. He is\nthe most punctilious blockhead under heaven. He does everything step by\nstep, with the trifling minuteness of an old woman; and he is a man whom\nit is impossible to please, because he is never pleased with himself. I\nlike to do business regularly and cheerfully, and, when it is finished,\nto leave it. But he constantly returns my papers to me, saying, \"They\nwill do,\" but recommending me to look over them again, as \"one may\nalways improve by using a better word or a more appropriate particle.\"\nI then lose all patience, and wish myself at the devil's. Not a\nconjunction, not an adverb, must be omitted: he has a deadly antipathy\nto all those transpositions of which I am so fond; and, if the music\nof our periods is not tuned to the established, official key, he cannot\ncomprehend our meaning. It is deplorable to be connected with such a\nfellow.\n\nMy acquaintance with the Count C--is the only compensation for such an\nevil. He told me frankly, the other day, that he was much displeased\nwith the difficulties and delays of the ambassador; that people like him\nare obstacles, both to themselves and to others. \"But,\" added he, \"one\nmust submit, like a traveller who has to ascend a mountain: if the\nmountain was not there, the road would be both shorter and pleasanter;\nbut there it is, and he must get over it.\"\n\nThe old man perceives the count's partiality for me: this annoys him,\nand, he seizes every opportunity to depreciate the count in my hearing.\nI naturally defend him, and that only makes matters worse. Yesterday he\nmade me indignant, for he also alluded to me. \"The count,\" he said, \"is\na man of the world, and a good man of business: his style is good,\nand he writes with facility; but, like other geniuses, he has no solid\nlearning.\" He looked at me with an expression that seemed to ask if I\nfelt the blow. But it did not produce the desired effect: I despise a\nman who can think and act in such a manner. However, I made a stand, and\nanswered with not a little warmth. The count, I said, was a man entitled\nto respect, alike for his character and his acquirements. I had never\nmet a person whose mind was stored with more useful and extensive\nknowledge,--who had, in fact, mastered such an infinite variety of\nsubjects, and who yet retained all his activity for the details of\nordinary business. This was altogether beyond his comprehension; and I\ntook my leave, lest my anger should be too highly excited by some new\nabsurdity of his.\n\nAnd you are to blame for all this, you who persuaded me to bend my\nneck to this yoke by preaching a life of activity to me. If the man who\nplants vegetables, and carries his corn to town on market-days, is not\nmore usefully employed than I am, then let me work ten years longer at\nthe galleys to which I am now chained.\n\nOh, the brilliant wretchedness, the weariness, that one is doomed\nto witness among the silly people whom we meet in society here! The\nambition of rank! How they watch, how they toil, to gain precedence!\nWhat poor and contemptible passions are displayed in their utter\nnakedness! We have a woman here, for example, who never ceases to\nentertain the company with accounts of her family and her estates. Any\nstranger would consider her a silly being, whose head was turned by\nher pretensions to rank and property; but she is in reality even\nmore ridiculous, the daughter of a mere magistrate's clerk from this\nneighbourhood. I cannot understand how human beings can so debase\nthemselves.\n\nEvery day I observe more and more the folly of judging of others by\nourselves; and I have so much trouble with myself, and my own heart is\nin such constant agitation, that I am well content to let others pursue\ntheir own course, if they only allow me the same privilege.\n\nWhat provokes me most is the unhappy extent to which distinctions of\nrank are carried. I know perfectly well how necessary are inequalities\nof condition, and I am sensible of the advantages I myself derive\ntherefrom; but I would not have these institutions prove a barrier to\nthe small chance of happiness which I may enjoy on this earth.\n\nI have lately become acquainted with a Miss B--, a very agreeable girl,\nwho has retained her natural manners in the midst of artificial life.\nOur first conversation pleased us both equally; and, at taking leave,\nI requested permission to visit her. She consented in so obliging a\nmanner, that I waited with impatience for the arrival of the happy\nmoment. She is not a native of this place, but resides here with her\naunt. The countenance of the old lady is not prepossessing. I paid her\nmuch attention, addressing the greater part of my conversation to her;\nand, in less than half an hour, I discovered what her niece subsequently\nacknowledged to me, that her aged aunt, having but a small fortune, and\na still smaller share of understanding, enjoys no satisfaction except\nin the pedigree of her ancestors, no protection save in her noble birth,\nand no enjoyment but in looking from her castle over the heads of the\nhumble citizens. She was, no doubt, handsome in her youth, and in her\nearly years probably trifled away her time in rendering many a poor\nyouth the sport of her caprice: in her riper years she has submitted\nto the yoke of a veteran officer, who, in return for her person and her\nsmall independence, has spent with her what we may designate her age of\nbrass. He is dead; and she is now a widow, and deserted. She spends her\niron age alone, and would not be approached, except for the loveliness\nof her niece.\n\nJANUARY 8, 1772.\n\nWhat beings are men, whose whole thoughts are occupied with form and\nceremony, who for years together devote their mental and physical\nexertions to the task of advancing themselves but one step, and\nendeavouring to occupy a higher place at the table. Not that such\npersons would otherwise want employment: on the contrary, they give\nthemselves much trouble by neglecting important business for such petty\ntrifles. Last week a question of precedence arose at a sledging-party,\nand all our amusement was spoiled.\n\nThe silly creatures cannot see that it is not place which constitutes\nreal greatness, since the man who occupies the first place but\nseldom plays the principal part. How many kings are governed by their\nministers--how many ministers by their secretaries? Who, in such cases,\nis really the chief? He, as it seems to me, who can see through the\nothers, and possesses strength or skill enough to make their power or\npassions subservient to the execution of his own designs.\n\nJANUARY 20.\n\nI must write to you from this place, my dear Charlotte, from a small\nroom in a country inn, where I have taken shelter from a severe storm.\nDuring my whole residence in that wretched place D--, where I lived\namongst strangers,--strangers, indeed, to this heart,--I never at any\ntime felt the smallest inclination to correspond with you; but in this\ncottage, in this retirement, in this solitude, with the snow and hail\nbeating against my lattice-pane, you are my first thought. The instant\nI entered, your figure rose up before me, and the remembrance! O my\nCharlotte, the sacred, tender remembrance! Gracious Heaven! restore to\nme the happy moment of our first acquaintance.\n\nCould you but see me, my dear Charlotte, in the whirl of\ndissipation,--how my senses are dried up, but my heart is at no time\nfull. I enjoy no single moment of happiness: all is vain--nothing\ntouches me. I stand, as it were, before the raree-show: I see the little\npuppets move, and I ask whether it is not an optical illusion. I am\namused with these puppets, or, rather, I am myself one of them: but,\nwhen I sometimes grasp my neighbour's hand, I feel that it is not\nnatural; and I withdraw mine with a shudder. In the evening I say I will\nenjoy the next morning's sunrise, and yet I remain in bed: in the day I\npromise to ramble by moonlight; and I, nevertheless, remain at home. I\nknow not why I rise, nor why I go to sleep.\n\nThe leaven which animated my existence is gone: the charm which cheered\nme in the gloom of night, and aroused me from my morning slumbers, is\nfor ever fled.\n\nI have found but one being here to interest me, a Miss B--. She\nresembles you, my dear Charlotte, if any one can possibly resemble you.\n\"Ah!\" you will say, \"he has learned how to pay fine compliments.\" And\nthis is partly true. I have been very agreeable lately, as it was not\nin my power to be otherwise. I have, moreover, a deal of wit: and the\nladies say that no one understands flattery better, or falsehoods you\nwill add; since the one accomplishment invariably accompanies the\nother. But I must tell you of Miss B--. She has abundance of soul,\nwhich flashes from her deep blue eyes. Her rank is a torment to her, and\nsatisfies no one desire of her heart. She would gladly retire from\nthis whirl of fashion, and we often picture to ourselves a life of\nundisturbed happiness in distant scenes of rural retirement: and then we\nspeak of you, my dear Charlotte; for she knows you, and renders homage\nto your merits; but her homage is not exacted, but voluntary, she loves\nyou, and delights to hear you made the subject of conversation.\n\nOh, that I were sitting at your feet in your favourite little room, with\nthe dear children playing around us! If they became troublesome to you,\nI would tell them some appalling goblin story; and they would crowd\nround me with silent attention. The sun is setting in glory; his last\nrays are shining on the snow, which covers the face of the country: the\nstorm is over, and I must return to my dungeon. Adieu!--Is Albert with\nyou? and what is he to you? God forgive the question.\n\nFEBRUARY 8.\n\nFor a week past we have had the most wretched weather: but this to me\nis a blessing; for, during my residence here, not a single fine day has\nbeamed from the heavens, but has been lost to me by the intrusion\nof somebody. During the severity of rain, sleet, frost, and storm, I\ncongratulate myself that it cannot be worse indoors than abroad, nor\nworse abroad than it is within doors; and so I become reconciled. When\nthe sun rises bright in the morning, and promises a glorious day, I\nnever omit to exclaim, \"There, now, they have another blessing\nfrom Heaven, which they will be sure to destroy: they spoil\neverything,--health, fame, happiness, amusement; and they do this\ngenerally through folly, ignorance, or imbecility, and always, according\nto their own account, with the best intentions!\" I could often\nbeseech them, on my bended knees, to be less resolved upon their own\ndestruction.\n\nFEBRUARY 17.\n\nI fear that my ambassador and I shall not continue much longer together.\nHe is really growing past endurance. He transacts his business in so\nridiculous a manner, that I am often compelled to contradict him, and do\nthings my own way; and then, of course, he thinks them very ill done. He\ncomplained of me lately on this account at court; and the minister gave\nme a reprimand,--a gentle one it is true, but still a reprimand. In\nconsequence of this, I was about to tender my resignation, when I\nreceived a letter, to which I submitted with great respect, on\naccount of the high, noble, and generous spirit which dictated it. He\nendeavoured to soothe my excessive sensibility, paid a tribute to my\nextreme ideas of duty, of good example, and of perseverance in business,\nas the fruit of my youthful ardour, an impulse which he did not seek\nto destroy, but only to moderate, that it might have proper play and be\nproductive of good. So now I am at rest for another week, and no longer\nat variance with myself. Content and peace of mind are valuable things:\nI could wish, my dear friend, that these precious jewels were less\ntransitory.\n\nFEBRUARY 20.\n\nGod bless you, my dear friends, and may he grant you that happiness\nwhich he denies to me!\n\nI thank you, Albert, for having deceived me. I waited for the news that\nyour wedding-day was fixed; and I intended on that day, with solemnity,\nto take down Charlotte's profile from the wall, and to bury it with\nsome other papers I possess. You are now united, and her picture still\nremains here. Well, let it remain! Why should it not? I know that I\nam still one of your society, that I still occupy a place uninjured in\nCharlotte's heart, that I hold the second place therein; and I intend\nto keep it. Oh, I should become mad if she could forget! Albert, that\nthought is hell! Farewell, Albert farewell, angel of heaven farewell,\nCharlotte!\n\nMARCH 15.\n\nI have just had a sad adventure, which will drive me away from here. I\nlose all patience!--Death!--It is not to be remedied; and you alone are\nto blame, for you urged and impelled me to fill a post for which I was\nby no means suited. I have now reason to be satisfied, and so have you!\nBut, that you may not again attribute this fatality to my impetuous\ntemper, I send you, my dear sir, a plain and simple narration of the\naffair, as a mere chronicler of facts would describe it.\n\nThe Count of O--likes and distinguishes me. It is well known, and I have\nmentioned this to you a hundred times. Yesterday I dined with him. It is\nthe day on which the nobility are accustomed to assemble at his house\nin the evening. I never once thought of the assembly, nor that we\nsubalterns did not belong to such society. Well, I dined with the count;\nand, after dinner, we adjourned to the large hall. We walked up and down\ntogether: and I conversed with him, and with Colonel B--, who joined us;\nand in this manner the hour for the assembly approached. God knows, I\nwas thinking of nothing, when who should enter but the honourable Lady\naccompanied by her noble husband and their silly, scheming daughter,\nwith her small waist and flat neck; and, with disdainful looks and a\nhaughty air they passed me by. As I heartily detest the whole race,\nI determined upon going away; and only waited till the count had\ndisengaged himself from their impertinent prattle, to take leave, when\nthe agreeable Miss B--came in. As I never meet her without experiencing\na heartfelt pleasure, I stayed and talked to her, leaning over the\nback of her chair, and did not perceive, till after some time, that she\nseemed a little confused, and ceased to answer me with her usual ease\nof manner. I was struck with it. \"Heavens!\" I said to myself, \"can she,\ntoo, be like the rest?\" I felt annoyed, and was about to withdraw; but I\nremained, notwithstanding, forming excuses for her conduct, fancying she\ndid not mean it, and still hoping to receive some friendly recognition.\nThe rest of the company now arrived. There was the Baron F--, in an\nentire suit that dated from the coronation of Francis I.; the Chancellor\nN--, with his deaf wife; the shabbily-dressed I--, whose old-fashioned\ncoat bore evidence of modern repairs: this crowned the whole.\nI conversed with some of my acquaintances, but they answered me\nlaconically. I was engaged in observing Miss B--, and did not notice\nthat the women were whispering at the end of the room, that the murmur\nextended by degrees to the men, that Madame S--addressed the count with\nmuch warmth (this was all related to me subsequently by Miss B--); till\nat length the count came up to me, and took me to the window. \"You know\nour ridiculous customs,\" he said. \"I perceive the company is rather\ndispleased at your being here. I would not on any account--\" \"I beg\nyour excellency's pardon!\" I exclaimed. \"I ought to have thought of\nthis before, but I know you will forgive this little inattention. I was\ngoing,\" I added, \"some time ago, but my evil genius detained me.\" And I\nsmiled and bowed, to take my leave. He shook me by the hand, in a manner\nwhich expressed everything. I hastened at once from the illustrious\nassembly, sprang into a carriage, and drove to M--. I contemplated the\nsetting sun from the top of the hill, and read that beautiful passage in\nHomer, where Ulysses is entertained by the hospitable herdsmen. This was\nindeed delightful.\n\nI returned home to supper in the evening. But few persons were assembled\nin the room. They had turned up a corner of the table-cloth, and were\nplaying at dice. The good-natured A--came in. He laid down his hat when\nhe saw me, approached me, and said in a low tone, \"You have met with\na disagreeable adventure.\" \"I!\" I exclaimed. \"The count obliged you to\nwithdraw from the assembly!\" \"Deuce take the assembly!\" said I. \"I was\nvery glad to be gone.\" \"I am delighted,\" he added, \"that you take it\nso lightly. I am only sorry that it is already so much spoken of.\" The\ncircumstance then began to pain me. I fancied that every one who sat\ndown, and even looked at me, was thinking of this incident; and my heart\nbecame embittered.\n\nAnd now I could plunge a dagger into my bosom, when I hear myself\neverywhere pitied, and observe the triumph of my enemies, who say that\nthis is always the case with vain persons, whose heads are turned with\nconceit, who affect to despise forms and such petty, idle nonsense.\n\nSay what you will of fortitude, but show me the man who can patiently\nendure the laughter of fools, when they have obtained an advantage over\nhim. 'Tis only when their nonsense is without foundation that one can\nsuffer it without complaint.\n\nMarch 16.\n\nEverything conspires against me. I met Miss B--walking to-day. I could\nnot help joining her; and, when we were at a little distance from her\ncompanions, I expressed my sense of her altered manner toward me. \"O\nWerther!\" she said, in a tone of emotion, \"you, who know my heart, how\ncould you so ill interpret my distress? What did I not suffer for you,\nfrom the moment you entered the room! I foresaw it all, a hundred times\nwas I on the point of mentioning it to you. I knew that the S----s and\nT----s, with their husbands, would quit the room, rather than remain in\nyour company. I knew that the count would not break with them: and\nnow so much is said about it.\" \"How!\" I exclaimed, and endeavoured to\nconceal my emotion; for all that Adelin had mentioned to me yesterday\nrecurred to me painfully at that moment. \"Oh, how much it has already\ncost me!\" said this amiable girl, while her eyes filled with tears.\nI could scarcely contain myself, and was ready to throw myself at her\nfeet. \"Explain yourself!\" I cried. Tears flowed down her cheeks. I\nbecame quite frantic. She wiped them away, without attempting to conceal\nthem. \"You know my aunt,\" she continued; \"she was present: and in\nwhat light does she consider the affair! Last night, and this morning,\nWerther, I was compelled to listen to a lecture upon my acquaintance\nwith you. I have been obliged to hear you condemned and depreciated; and\nI could not--I dared not--say much in your defence.\"\n\nEvery word she uttered was a dagger to my heart. She did not feel what a\nmercy it would have been to conceal everything from me. She told me, in\naddition, all the impertinence that would be further circulated, and how\nthe malicious would triumph; how they would rejoice over the punishment\nof my pride, over my humiliation for that want of esteem for others with\nwhich I had often been reproached. To hear all this, Wilhelm, uttered by\nher in a voice of the most sincere sympathy, awakened all my passions;\nand I am still in a state of extreme excitement. I wish I could find a\nman to jeer me about this event. I would sacrifice him to my resentment.\nThe sight of his blood might possibly be a relief to my fury. A hundred\ntimes have I seized a dagger, to give ease to this oppressed heart.\nNaturalists tell of a noble race of horses that instinctively open a\nvein with their teeth, when heated and exhausted by a long course, in\norder to breathe more freely. I am often tempted to open a vein, to\nprocure for myself everlasting liberty.\n\nMARCH 24.\n\nI have tendered my resignation to the court. I hope it will be accepted,\nand you will forgive me for not having previously consulted you. It\nis necessary I should leave this place. I know all you will urge me to\nstay, and therefore I beg you will soften this news to my mother. I am\nunable to do anything for myself: how, then, should I be competent to\nassist others? It will afflict her that I should have interrupted that\ncareer which would have made me first a privy councillor, and then\nminister, and that I should look behind me, in place of advancing. Argue\nas you will, combine all the reasons which should have induced me\nto remain, I am going: that is sufficient. But, that you may not be\nignorant of my destination, I may mention that the Prince of--is here.\nHe is much pleased with my company; and, having heard of my intention\nto resign, he has invited me to his country house, to pass the spring\nmonths with him. I shall be left completely my own master; and, as we\nagree on all subjects but one, I shall try my fortune, and accompany\nhim.\n\nAPRIL 19.\n\nThanks for both your letters. I delayed my reply, and withheld this\nletter, till I should obtain an answer from the court. I feared my\nmother might apply to the minister to defeat my purpose. But my request\nis granted, my resignation is accepted. I shall not recount with what\nreluctance it was accorded, nor relate what the minister has written:\nyou would only renew your lamentations. The crown prince has sent me\na present of five and twenty ducats; and, indeed, such goodness has\naffected me to tears. For this reason I shall not require from my mother\nthe money for which I lately applied.\n\nMAY 5.\n\nI leave this place to-morrow; and, as my native place is only six miles\nfrom the high road, I intend to visit it once more, and recall the happy\ndreams of my childhood. I shall enter at the same gate through which\nI came with my mother, when, after my father's death, she left that\ndelightful retreat to immure herself in your melancholy town. Adieu, my\ndear friend: you shall hear of my future career.\n\nMAY 9.\n\nI have paid my visit to my native place with all the devotion of a\npilgrim, and have experienced many unexpected emotions. Near the great\nelm tree, which is a quarter of a league from the village, I got out of\nthe carriage, and sent it on before, that alone, and on foot, I might\nenjoy vividly and heartily all the pleasure of my recollections. I stood\nthere under that same elm which was formerly the term and object of my\nwalks. How things have since changed! Then, in happy ignorance, I sighed\nfor a world I did not know, where I hoped to find every pleasure and\nenjoyment which my heart could desire; and now, on my return from that\nwide world, O my friend, how many disappointed hopes and unsuccessful\nplans have I brought back!\n\nAs I contemplated the mountains which lay stretched out before me, I\nthought how often they had been the object of my dearest desires. Here\nused I to sit for hours together with my eyes bent upon them, ardently\nlonging to wander in the shade of those woods, to lose myself in those\nvalleys, which form so delightful an object in the distance. With what\nreluctance did I leave this charming spot; when my hour of recreation\nwas over, and my leave of absence expired! I drew near to the village:\nall the well-known old summerhouses and gardens were recognised again; I\ndisliked the new ones, and all other alterations which had taken place.\nI entered the village, and all my former feelings returned. I cannot,\nmy dear friend, enter into details, charming as were my sensations:\nthey would be dull in the narration. I had intended to lodge in the\nmarket-place, near our old house. As soon as I entered, I perceived that\nthe schoolroom, where our childhood had been taught by that good old\nwoman, was converted into a shop. I called to mind the sorrow, the\nheaviness, the tears, and oppression of heart, which I experienced in\nthat confinement. Every step produced some particular impression. A\npilgrim in the Holy Land does not meet so many spots pregnant with\ntender recollections, and his soul is hardly moved with greater\ndevotion. One incident will serve for illustration. I followed the\ncourse of a stream to a farm, formerly a delightful walk of mine, and\npaused at the spot, where, when boys, we used to amuse ourselves making\nducks and drakes upon the water. I recollected so well how I used\nformerly to watch the course of that same stream, following it with\ninquiring eagerness, forming romantic ideas of the countries it was to\npass through; but my imagination was soon exhausted: while the\nwater continued flowing farther and farther on, till my fancy became\nbewildered by the contemplation of an invisible distance. Exactly such,\nmy dear friend, so happy and so confined, were the thoughts of our good\nancestors. Their feelings and their poetry were fresh as childhood.\nAnd, when Ulysses talks of the immeasurable sea and boundless earth,\nhis epithets are true, natural, deeply felt, and mysterious. Of what\nimportance is it that I have learned, with every schoolboy, that the\nworld is round? Man needs but little earth for enjoyment, and still less\nfor his final repose.\n\nI am at present with the prince at his hunting lodge. He is a man with\nwhom one can live happily. He is honest and unaffected. There are,\nhowever, some strange characters about him, whom I cannot at all\nunderstand. They do not seem vicious, and yet they do not carry the\nappearance of thoroughly honest men. Sometimes I am disposed to believe\nthem honest, and yet I cannot persuade myself to confide in them. It\ngrieves me to hear the prince occasionally talk of things which he has\nonly read or heard of, and always with the same view in which they have\nbeen represented by others.\n\nHe values my understanding and talents more highly than my heart, but I\nam proud of the latter only. It is the sole source of everything of our\nstrength, happiness, and misery. All the knowledge I possess every one\nelse can acquire, but my heart is exclusively my own.\n\nMAY 25.\n\nI have had a plan in my head of which I did not intend to speak to you\nuntil it was accomplished: now that it has failed, I may as well mention\nit. I wished to enter the army, and had long been desirous of taking\nthe step. This, indeed, was the chief reason for my coming here with the\nprince, as he is a general in the service. I communicated my design to\nhim during one of our walks together. He disapproved of it, and it would\nhave been actual madness not to have listened to his reasons.\n\nJUNE 11.\n\nSay what you will, I can remain here no longer. Why should I remain?\nTime hangs heavy upon my hands. The prince is as gracious to me as any\none could be, and yet I am not at my ease. There is, indeed, nothing\nin common between us. He is a man of understanding, but quite of the\nordinary kind. His conversation affords me no more amusement than I\nshould derive from the perusal of a well-written book. I shall remain\nhere a week longer, and then start again on my travels. My drawings are\nthe best things I have done since I came here. The prince has a taste\nfor the arts, and would improve if his mind were not fettered by cold\nrules and mere technical ideas. I often lose patience, when, with\na glowing imagination, I am giving expression to art and nature, he\ninterferes with learned suggestions, and uses at random the technical\nphraseology of artists.\n\nJULY 16.\n\nOnce more I am a wanderer, a pilgrim, through the world. But what else\nare you!\n\nJULY 18.\n\nWhither am I going? I will tell you in confidence. I am obliged to\ncontinue a fortnight longer here, and then I think it would be better\nfor me to visit the mines in--. But I am only deluding myself thus. The\nfact is, I wish to be near Charlotte again, that is all. I smile at the\nsuggestions of my heart, and obey its dictates.\n\nJULY 29.\n\nNo, no! it is yet well all is well! I her husband! O God, who gave me\nbeing, if thou hadst destined this happiness for me, my whole life would\nhave been one continual thanksgiving! But I will not murmur--forgive\nthese tears, forgive these fruitless wishes. She--my wife! Oh, the very\nthought of folding that dearest of Heaven's creatures in my arms! Dear\nWilhelm, my whole frame feels convulsed when I see Albert put his arms\naround her slender waist!\n\nAnd shall I avow it? Why should I not, Wilhelm? She would have been\nhappier with me than with him. Albert is not the man to satisfy the\nwishes of such a heart. He wants a certain sensibility; he wants--in\nshort, their hearts do not beat in unison. How often, my dear friend,\nI'm reading a passage from some interesting book, when my heart and\nCharlotte's seemed to meet, and in a hundred other instances when our\nsentiments were unfolded by the story of some fictitious character, have\nI felt that we were made for each other! But, dear Wilhelm, he loves her\nwith his whole soul; and what does not such a love deserve?\n\nI have been interrupted by an insufferable visit. I have dried my tears,\nand composed my thoughts. Adieu, my best friend!\n\nAUGUST 4.\n\nI am not alone unfortunate. All men are disappointed in their hopes, and\ndeceived in their expectations. I have paid a visit to my good old woman\nunder the lime-trees. The eldest boy ran out to meet me: his exclamation\nof joy brought out his mother, but she had a very melancholy look. Her\nfirst word was, \"Alas! dear sir, my little John is dead.\" He was the\nyoungest of her children. I was silent. \"And my husband has returned\nfrom Switzerland without any money; and, if some kind people had not\nassisted him, he must have begged his way home. He was taken ill with\nfever on his journey.\" I could answer nothing, but made the little one\na present. She invited me to take some fruit: I complied, and left the\nplace with a sorrowful heart.\n\nAUGUST 21.\n\nMy sensations are constantly changing. Sometimes a happy prospect opens\nbefore me; but alas! it is only for a moment; and then, when I am\nlost in reverie, I cannot help saying to myself, \"If Albert were\nto die?--Yes, she would become--and I should be\"--and so I pursue a\nchimera, till it leads me to the edge of a precipice at which I shudder.\n\nWhen I pass through the same gate, and walk along the same road which\nfirst conducted me to Charlotte, my heart sinks within me at the change\nthat has since taken place. All, all, is altered! No sentiment, no\npulsation of my heart, is the same. My sensations are such as would\noccur to some departed prince whose spirit should return to visit the\nsuperb palace which he had built in happy times, adorned with costly\nmagnificence, and left to a beloved son, but whose glory he should find\ndeparted, and its halls deserted and in ruins.\n\nSEPTEMBER 3.\n\nI sometimes cannot understand how she can love another, how she dares\nlove another, when I love nothing in this world so completely, so\ndevotedly, as I love her, when I know only her, and have no other\npossession.\n\nSEPTEMBER 4.\n\nIt is even so! As nature puts on her autumn tints it becomes autumn with\nme and around me. My leaves are sere and yellow, and the neighbouring\ntrees are divested of their foliage. Do you remember my writing to you\nabout a peasant boy shortly after my arrival here? I have just made\ninquiries about him in Walheim. They say he has been dismissed from his\nservice, and is now avoided by every one. I met him yesterday on the\nroad, going to a neighbouring village. I spoke to him, and he told me\nhis story. It interested me exceedingly, as you will easily understand\nwhen I repeat it to you. But why should I trouble you? Why should I\nnot reserve all my sorrow for myself? Why should I continue to give you\noccasion to pity and blame me? But no matter: this also is part of my\ndestiny.\n\nAt first the peasant lad answered my inquiries with a sort of subdued\nmelancholy, which seemed to me the mark of a timid disposition; but, as\nwe grew to understand each other, he spoke with less reserve, and openly\nconfessed his faults, and lamented his misfortune. I wish, my dear\nfriend, I could give proper expression to his language. He told me\nwith a sort of pleasurable recollection, that, after my departure, his\npassion for his mistress increased daily, until at last he neither knew\nwhat he did nor what he said, nor what was to become of him. He could\nneither eat nor drink nor sleep: he felt a sense of suffocation; he\ndisobeyed all orders, and forgot all commands involuntarily; he seemed\nas if pursued by an evil spirit, till one day, knowing that his mistress\nhad gone to an upper chamber, he had followed, or, rather, been drawn\nafter her. As she proved deaf to his entreaties, he had recourse to\nviolence. He knows not what happened; but he called God to witness that\nhis intentions to her were honourable, and that he desired nothing more\nsincerely than that they should marry, and pass their lives together.\nWhen he had come to this point, he began to hesitate, as if there\nwas something which he had not courage to utter, till at length he\nacknowledged with some confusion certain little confidences she had\nencouraged, and liberties she had allowed. He broke off two or three\ntimes in his narration, and assured me most earnestly that he had\nno wish to make her bad, as he termed it, for he loved her still as\nsincerely as ever; that the tale had never before escaped his lips,\nand was only now told to convince me that he was not utterly lost and\nabandoned. And here, my dear friend, I must commence the old song which\nyou know I utter eternally. If I could only represent the man as he\nstood, and stands now before me, could I only give his true expressions,\nyou would feel compelled to sympathise in his fate. But enough: you,\nwho know my misfortune and my disposition, can easily comprehend\nthe attraction which draws me toward every unfortunate being, but\nparticularly toward him whose story I have recounted.\n\nOn perusing this letter a second time, I find I have omitted the\nconclusion of my tale; but it is easily supplied. She became reserved\ntoward him, at the instigation of her brother who had long hated him,\nand desired his expulsion from the house, fearing that his sister's\nsecond marriage might deprive his children of the handsome fortune they\nexpected from her; as she is childless. He was dismissed at length; and\nthe whole affair occasioned so much scandal, that the mistress dared not\ntake him back, even if she had wished it. She has since hired another\nservant, with whom, they say, her brother is equally displeased, and\nwhom she is likely to marry; but my informant assures me that he himself\nis determined not to survive such a catastrophe.\n\nThis story is neither exaggerated nor embellished: indeed, I have\nweakened and impaired it in the narration, by the necessity of using the\nmore refined expressions of society.\n\nThis love, then, this constancy, this passion, is no poetical fiction.\nIt is actual, and dwells in its greatest purity amongst that class of\nmankind whom we term rude, uneducated. We are the educated, not the\nperverted. But read this story with attention, I implore you. I am\ntranquil to-day, for I have been employed upon this narration: you see\nby my writing that I am not so agitated as usual. I read and re-read\nthis tale, Wilhelm: it is the history of your friend! My fortune has\nbeen and will be similar; and I am neither half so brave nor half so\ndetermined as the poor wretch with whom I hesitate to compare myself.\n\nSEPTEMBER 5.\n\nCharlotte had written a letter to her husband in the country, where he\nwas detained by business. It commenced, \"My dearest love, return as\nsoon as possible: I await you with a thousand raptures.\" A friend who\narrived, brought word, that, for certain reasons, he could not return\nimmediately. Charlotte's letter was not forwarded, and the same evening\nit fell into my hands. I read it, and smiled. She asked the reason.\n\"What a heavenly treasure is imagination:\" I exclaimed; \"I fancied for a\nmoment that this was written to me.\" She paused, and seemed displeased.\nI was silent.\n\nSEPTEMBER 6.\n\nIt cost me much to part with the blue coat which I wore the first time I\ndanced with Charlotte. But I could not possibly wear it any longer.\nBut I have ordered a new one, precisely similar, even to the collar and\nsleeves, as well as a new waistcoat and pantaloons.\n\nBut it does not produce the same effect upon me. I know not how it is,\nbut I hope in time I shall like it better.\n\nSEPTEMBER 12.\n\nShe has been absent for some days. She went to meet Albert. To-day\nI visited her: she rose to receive me, and I kissed her hand most\ntenderly.\n\nA canary at the moment flew from a mirror, and settled upon her\nshoulder. \"Here is a new friend,\" she observed, while she made him perch\nupon her hand: \"he is a present for the children. What a dear he is!\nLook at him! When I feed him, he flutters with his wings, and pecks so\nnicely. He kisses me, too, only look!\"\n\nShe held the bird to her mouth; and he pressed her sweet lips with\nso much fervour that he seemed to feel the excess of bliss which he\nenjoyed.\n\n\"He shall kiss you too,\" she added; and then she held the bird toward\nme. His little beak moved from her mouth to mine, and the delightful\nsensation seemed like the forerunner of the sweetest bliss.\n\n\"A kiss,\" I observed, \"does not seem to satisfy him: he wishes for food,\nand seems disappointed by these unsatisfactory endearments.\"\n\n\"But he eats out of my mouth,\" she continued, and extended her lips to\nhim containing seed; and she smiled with all the charm of a being who\nhas allowed an innocent participation of her love.\n\nI turned my face away. She should not act thus. She ought not to excite\nmy imagination with such displays of heavenly innocence and happiness,\nnor awaken my heart from its slumbers, in which it dreams of the\nworthlessness of life! And why not? Because she knows how much I love\nher.\n\nSEPTEMBER 15.\n\nIt makes me wretched, Wilhelm, to think that there should be men\nincapable of appreciating the few things which possess a real value in\nlife. You remember the walnut trees at S--, under which I used to sit\nwith Charlotte, during my visits to the worthy old vicar. Those glorious\ntrees, the very sight of which has so often filled my heart with\njoy, how they adorned and refreshed the parsonage yard, with their\nwide-extended branches! and how pleasing was our remembrance of the\ngood old pastor, by whose hands they were planted so many years ago:\nThe schoolmaster has frequently mentioned his name. He had it from his\ngrandfather. He must have been a most excellent man; and, under the\nshade of those old trees, his memory was ever venerated by me. The\nschoolmaster informed us yesterday, with tears in his eyes, that those\ntrees had been felled. Yes, cut to the ground! I could, in my wrath,\nhave slain the monster who struck the first stroke. And I must endure\nthis!--I, who, if I had had two such trees in my own court, and one had\ndied from old age, should have wept with real affliction. But there is\nsome comfort left, such a thing is sentiment, the whole village murmurs\nat the misfortune; and I hope the vicar's wife will soon find, by the\ncessation of the villagers' presents, how much she has wounded the\nfeelings of the neighborhhood. It was she who did it, the wife of the\npresent incumbent (our good old man is dead), a tall, sickly creature\nwho is so far right to disregard the world, as the world totally\ndisregards her. The silly being affects to be learned, pretends to\nexamine the canonical books, lends her aid toward the new-fashioned\nreformation of Christendom, moral and critical, and shrugs up her\nshoulders at the mention of Lavater's enthusiasm. Her health is\ndestroyed, on account of which she is prevented from having any\nenjoyment here below. Only such a creature could have cut down my walnut\ntrees! I can never pardon it. Hear her reasons. The falling leaves made\nthe court wet and dirty; the branches obstructed the light; boys threw\nstones at the nuts when they were ripe, and the noise affected her\nnerves; and disturbed her profound meditations, when she was weighing\nthe difficulties of Kennicot, Semler, and Michaelis. Finding that all\nthe parish, particularly the old people, were displeased, I asked \"why\nthey allowed it?\" \"Ah, sir!\" they replied, \"when the steward orders,\nwhat can we poor peasants do?\" But one thing has happened well. The\nsteward and the vicar (who, for once, thought to reap some advantage\nfrom the caprices of his wife) intended to divide the trees between\nthem. The revenue-office, being informed of it, revived an old claim to\nthe ground where the trees had stood, and sold them to the best bidder.\nThere they still lie on the ground. If I were the sovereign, I should\nknow how to deal with them all, vicar, steward, and revenue-office.\nSovereign, did I say? I should, in that case, care little about the\ntrees that grew in the country.\n\nOCTOBER 10.\n\nOnly to gaze upon her dark eyes is to me a source of happiness! And\nwhat grieves me, is, that Albert does not seem so happy as he--hoped to\nbe--as I should have been--if--I am no friend to these pauses, but here\nI cannot express it otherwise; and probably I am explicit enough.\n\nOCTOBER 12.\n\nOssian has superseded Homer in my heart. To what a world does the\nillustrious bard carry me! To wander over pathless wilds, surrounded by\nimpetuous whirlwinds, where, by the feeble light of the moon, we see the\nspirits of our ancestors; to hear from the mountain-tops, mid the roar\nof torrents, their plaintive sounds issuing from deep caverns, and the\nsorrowful lamentations of a maiden who sighs and expires on the mossy\ntomb of the warrior by whom she was adored. I meet this bard with silver\nhair; he wanders in the valley; he seeks the footsteps of his fathers,\nand, alas! he finds only their tombs. Then, contemplating the pale moon,\nas she sinks beneath the waves of the rolling sea, the memory of\nbygone days strikes the mind of the hero, days when approaching danger\ninvigorated the brave, and the moon shone upon his bark laden with\nspoils, and returning in triumph. When I read in his countenance deep\nsorrow, when I see his dying glory sink exhausted into the grave, as he\ninhales new and heart-thrilling delight from his approaching union with\nhis beloved, and he casts a look on the cold earth and the tall grass\nwhich is so soon to cover him, and then exclaims, \"The traveller will\ncome,--he will come who has seen my beauty, and he will ask, 'Where is\nthe bard, where is the illustrious son of Fingal?' He will walk over my\ntomb, and will seek me in vain!\" Then, O my friend, I could instantly,\nlike a true and noble knight, draw my sword, and deliver my prince from\nthe long and painful languor of a living death, and dismiss my own soul\nto follow the demigod whom my hand had set free!\n\nOCTOBER 19.\n\nAlas! the void the fearful void, which I feel in my bosom! Sometimes\nI think, if I could only once but once, press her to my heart, this\ndreadful void would be filled.\n\nOCTOBER 26.\n\nYes, I feel certain, Wilhelm, and every day I become more certain, that\nthe existence of any being whatever is of very little consequence. A\nfriend of Charlotte's called to see her just now. I withdrew into a\nneighbouring apartment, and took up a book; but, finding I could not\nread, I sat down to write. I heard them converse in an undertone: they\nspoke upon indifferent topics, and retailed the news of the town. One\nwas going to be married; another was ill, very ill, she had a dry cough,\nher face was growing thinner daily, and she had occasional fits. \"N--is\nvery unwell too,\" said Charlotte. \"His limbs begin to swell already,\"\nanswered the other; and my lively imagination carried me at once to the\nbeds of the infirm. There I see them struggling against death, with all\nthe agonies of pain and horror; and these women, Wilhelm, talk of all\nthis with as much indifference as one would mention the death of a\nstranger. And when I look around the apartment where I now am--when I\nsee Charlotte's apparel lying before me, and Albert's writings, and all\nthose articles of furniture which are so familiar to me, even to\nthe very inkstand which I am using,--when I think what I am to this\nfamily--everything. My friends esteem me; I often contribute to their\nhappiness, and my heart seems as if it could not beat without them; and\nyet---if I were to die, if I were to be summoned from the midst of this\ncircle, would they feel--or how long would they feel the void which my\nloss would make in their existence? How long! Yes, such is the frailty\nof man, that even there, where he has the greatest consciousness of his\nown being, where he makes the strongest and most forcible impression,\neven in the memory, in the heart, of his beloved, there also he must\nperish,--vanish,--and that quickly.\n\nOCTOBER 27.\n\nI could tear open my bosom with vexation to think how little we\nare capable of influencing the feelings of each other. No one can\ncommunicate to me those sensations of love, joy, rapture, and delight\nwhich I do not naturally possess; and, though my heart may glow with the\nmost lively affection, I cannot make the happiness of one in whom the\nsame warmth is not inherent.\n\nOCTOBER 27: Evening.\n\nI possess so much, but my love for her absorbs it all. I possess so\nmuch, but without her I have nothing.\n\nOCTOBER 30.\n\nOne hundred times have I been on the point of embracing her. Heavens!\nwhat a torment it is to see so much loveliness passing and repassing\nbefore us, and yet not dare to lay hold of it! And laying hold is the\nmost natural of human instincts. Do not children touch everything they\nsee? And I!\n\nNOVEMBER 3.\n\nWitness, Heaven, how often I lie down in my bed with a wish, and even a\nhope, that I may never awaken again. And in the morning, when I open my\neyes, I behold the sun once more, and am wretched. If I were whimsical,\nI might blame the weather, or an acquaintance, or some personal\ndisappointment, for my discontented mind; and then this insupportable\nload of trouble would not rest entirely upon myself. But, alas! I feel\nit too sadly. I am alone the cause of my own woe, am I not? Truly,\nmy own bosom contains the source of all my sorrow, as it previously\ncontained the source of all my pleasure. Am I not the same being who\nonce enjoyed an excess of happiness, who, at every step, saw paradise\nopen before him, and whose heart was ever expanded toward the whole\nworld? And this heart is now dead, no sentiment can revive it; my eyes\nare dry; and my senses, no more refreshed by the influence of soft\ntears, wither and consume my brain. I suffer much, for I have lost\nthe only charm of life: that active, sacred power which created worlds\naround me,--it is no more. When I look from my window at the distant\nhills, and behold the morning sun breaking through the mists, and\nilluminating the country around, which is still wrapped in silence,\nwhilst the soft stream winds gently through the willows, which have shed\ntheir leaves; when glorious nature displays all her beauties before me,\nand her wondrous prospects are ineffectual to extract one tear of joy\nfrom my withered heart, I feel that in such a moment I stand like a\nreprobate before heaven, hardened, insensible, and unmoved. Oftentimes\ndo I then bend my knee to the earth, and implore God for the blessing\nof tears, as the desponding labourer in some scorching climate prays for\nthe dews of heaven to moisten his parched corn.\n\nBut I feel that God does not grant sunshine or rain to our importunate\nentreaties. And oh, those bygone days, whose memory now torments me!\nwhy were they so fortunate? Because I then waited with patience for\nthe blessings of the Eternal, and received his gifts with the grateful\nfeelings of a thankful heart.\n\nNOVEMBER 8.\n\nCharlotte has reproved me for my excesses, with so much tenderness and\ngoodness! I have lately been in the habit of drinking more wine than\nheretofore. \"Don't do it,\" she said. \"Think of Charlotte!\" \"Think of\nyou!\" I answered; \"need you bid me do so? Think of you--I do not think\nof you: you are ever before my soul! This very morning I sat on the\nspot where, a few days ago, you descended from the carriage, and--\" She\nimmediately changed the subject to prevent me from pursuing it farther.\nMy dear friend, my energies are all prostrated: she can do with me what\nshe pleases.\n\nNOVEMBER 15.\n\nI thank you, Wilhelm, for your cordial sympathy, for your excellent\nadvice; and I implore you to be quiet. Leave me to my sufferings. In\nspite of my wretchedness, I have still strength enough for endurance.\nI revere religion--you know I do. I feel that it can impart strength\nto the feeble and comfort to the afflicted, but does it affect all men\nequally? Consider this vast universe: you will see thousands for whom it\nhas never existed, thousands for whom it will never exist, whether it be\npreached to them, or not; and must it, then, necessarily exist for me?\nDoes not the Son of God himself say that they are his whom the Father\nhas given to him? Have I been given to him? What if the Father will\nretain me for himself, as my heart sometimes suggests? I pray you, do\nnot misinterpret this. Do not extract derision from my harmless words. I\npour out my whole soul before you. Silence were otherwise preferable to\nme, but I need not shrink from a subject of which few know more than I\ndo myself. What is the destiny of man, but to fill up the measure of\nhis sufferings, and to drink his allotted cup of bitterness? And if that\nsame cup proved bitter to the God of heaven, under a human form, why\nshould I affect a foolish pride, and call it sweet? Why should I be\nashamed of shrinking at that fearful moment, when my whole being will\ntremble between existence and annihilation, when a remembrance of\nthe past, like a flash of lightning, will illuminate the dark gulf of\nfuturity, when everything shall dissolve around me, and the whole world\nvanish away? Is not this the voice of a creature oppressed beyond all\nresource, self-deficient, about to plunge into inevitable destruction,\nand groaning deeply at its inadequate strength, \"My God! my God! why\nhast thou forsaken me?\" And should I feel ashamed to utter the same\nexpression? Should I not shudder at a prospect which had its fears, even\nfor him who folds up the heavens like a garment?\n\nNOVEMBER 21.\n\nShe does not feel, she does not know, that she is preparing a poison\nwhich will destroy us both; and I drink deeply of the draught which is\nto prove my destruction. What mean those looks of kindness with which\nshe often--often? no, not often, but sometimes, regards me, that\ncomplacency with which she hears the involuntary sentiments which\nfrequently escape me, and the tender pity for my sufferings which\nappears in her countenance?\n\nYesterday, when I took leave she seized me by the hand, and said,\n\"Adieu, dear Werther.\" Dear Werther! It was the first time she ever\ncalled me dear: the sound sunk deep into my heart. I have repeated it a\nhundred times; and last night, on going to bed, and talking to myself\nof various things, I suddenly said, \"Good night, dear Werther!\" and then\ncould not but laugh at myself.\n\nNOVEMBER 22\n\nI cannot pray, \"Leave her to me!\" and yet she often seems to belong to\nme. I cannot pray, \"Give her to me!\" for she is another's. In this way\nI affect mirth over my troubles; and, if I had time, I could compose a\nwhole litany of antitheses.\n\nNOVEMBER 24.\n\nShe is sensible of my sufferings. This morning her look pierced my very\nsoul. I found her alone, and she was silent: she steadfastly surveyed\nme. I no longer saw in her face the charms of beauty or the fire of\ngenius: these had disappeared. But I was affected by an expression much\nmore touching, a look of the deepest sympathy and of the softest pity.\nWhy was I afraid to throw myself at her feet? Why did I not dare to take\nher in my arms, and answer her by a thousand kisses? She had recourse to\nher piano for relief, and in a low and sweet voice accompanied the music\nwith delicious sounds. Her lips never appeared so lovely: they seemed\nbut just to open, that they might imbibe the sweet tones which issued\nfrom the instrument, and return the heavenly vibration from her lovely\nmouth. Oh! who can express my sensations? I was quite overcome, and,\nbending down, pronounced this vow: \"Beautiful lips, which the angels\nguard, never will I seek to profane your purity with a kiss.\" And\nyet, my friend, oh, I wish--but my heart is darkened by doubt and\nindecision--could I but taste felicity, and then die to expiate the sin!\nWhat sin?\n\nNOVEMBER 26.\n\nOftentimes I say to myself, \"Thou alone art wretched: all other mortals\nare happy, none are distressed like thee!\" Then I read a passage in an\nancient poet, and I seem to understand my own heart. I have so much to\nendure! Have men before me ever been so wretched?\n\nNOVEMBER 30.\n\nI shall never be myself again! Wherever I go, some fatality occurs to\ndistract me. Even to-day alas--for our destiny! alas for human nature!\n\nAbout dinner-time I went to walk by the river-side, for I had no\nappetite. Everything around seemed gloomy: a cold and damp easterly wind\nblew from the mountains, and black, heavy clouds spread over the plain.\nI observed at a distance a man in a tattered coat: he was wandering\namong the rocks, and seemed to be looking for plants. When I approached,\nhe turned round at the noise; and I saw that he had an interesting\ncountenance in which a settled melancholy, strongly marked by\nbenevolence, formed the principal feature. His long black hair was\ndivided, and flowed over his shoulders. As his garb betokened a person\nof the lower order, I thought he would not take it ill if I inquired\nabout his business; and I therefore asked what he was seeking. He\nreplied, with a deep sigh, that he was looking for flowers, and could\nfind none. \"But it is not the season,\" I observed, with a smile. \"Oh,\nthere are so many flowers!\" he answered, as he came nearer to me. \"In my\ngarden there are roses and honeysuckles of two sorts: one sort was\ngiven to me by my father! they grow as plentifully as weeds; I have been\nlooking for them these two days, and cannot find them. There are flowers\nout there, yellow, blue, and red; and that centaury has a very pretty\nblossom: but I can find none of them.\" I observed his peculiarity, and\ntherefore asked him, with an air of indifference, what he intended to\ndo with his flowers. A strange smile overspread his countenance. Holding\nhis finger to his mouth, he expressed a hope that I would not betray\nhim; and he then informed me that he had promised to gather a nosegay\nfor his mistress. \"That is right,\" said I. \"Oh!\" he replied, \"she\npossesses many other things as well: she is very rich.\" \"And yet,\" I\ncontinued, \"she likes your nosegays.\" \"Oh, she has jewels and crowns!\"\nhe exclaimed. I asked who she was. \"If the states-general would but pay\nme,\" he added, \"I should be quite another man. Alas! there was a time\nwhen I was so happy; but that is past, and I am now--\" He raised his\nswimming eyes to heaven. \"And you were happy once?\" I observed. \"Ah,\nwould I were so still!\" was his reply. \"I was then as gay and contented\nas a man can be.\" An old woman, who was coming toward us, now called\nout, \"Henry, Henry! where are you? We have been looking for you\neverywhere: come to dinner.\" \"Is he your son?\" I inquired, as I went\ntoward her. \"Yes,\" she said: \"he is my poor, unfortunate son. The Lord\nhas sent me a heavy affliction.\" I asked whether he had been long in\nthis state. She answered, \"He has been as calm as he is at present for\nabout six months. I thank Heaven that he has so far recovered: he was\nfor one whole year quite raving, and chained down in a madhouse. Now he\ninjures no one, but talks of nothing else than kings and queens. He used\nto be a very good, quiet youth, and helped to maintain me; he wrote a\nvery fine hand; but all at once he became melancholy, was seized with a\nviolent fever, grew distracted, and is now as you see. If I were only to\ntell you, sir--\" I interrupted her by asking what period it was in which\nhe boasted of having been so happy. \"Poor boy!\" she exclaimed, with a\nsmile of compassion, \"he means the time when he was completely deranged,\na time he never ceases to regret, when he was in the madhouse, and\nunconscious of everything.\" I was thunderstruck: I placed a piece of\nmoney in her hand, and hastened away.\n\n\"You were happy!\" I exclaimed, as I returned quickly to the town, \"'as\ngay and contented as a man can be!'\" God of heaven! and is this the\ndestiny of man? Is he only happy before he has acquired his reason, or\nafter he has lost it? Unfortunate being! And yet I envy your fate: I\nenvy the delusion to which you are a victim. You go forth with joy to\ngather flowers for your princess,--in winter,--and grieve when you can\nfind none, and cannot understand why they do not grow. But I wander\nforth without joy, without hope, without design; and I return as I came.\nYou fancy what a man you would be if the states general paid you. Happy\nmortal, who can ascribe your wretchedness to an earthly cause! You\ndo not know, you do not feel, that in your own distracted heart and\ndisordered brain dwells the source of that unhappiness which all the\npotentates on earth cannot relieve.\n\nLet that man die unconsoled who can deride the invalid for undertaking\na journey to distant, healthful springs, where he often finds only a\nheavier disease and a more painful death, or who can exult over the\ndespairing mind of a sinner, who, to obtain peace of conscience and an\nalleviation of misery, makes a pilgrimage to the Holy Sepulchre. Each\nlaborious step which galls his wounded feet in rough and untrodden paths\npours a drop of balm into his troubled soul, and the journey of many a\nweary day brings a nightly relief to his anguished heart. Will you dare\ncall this enthusiasm, ye crowd of pompous declaimers? Enthusiasm! O God!\nthou seest my tears. Thou hast allotted us our portion of misery: must\nwe also have brethren to persecute us, to deprive us of our consolation,\nof our trust in thee, and in thy love and mercy? For our trust in the\nvirtue of the healing root, or in the strength of the vine, what is it\nelse than a belief in thee from whom all that surrounds us derives its\nhealing and restoring powers? Father, whom I know not,--who wert once\nwont to fill my soul, but who now hidest thy face from me,--call me back\nto thee; be silent no longer; thy silence shall not delay a soul which\nthirsts after thee. What man, what father, could be angry with a son for\nreturning to him suddenly, for falling on his neck, and exclaiming, \"I\nam here again, my father! forgive me if I have anticipated my journey,\nand returned before the appointed time! The world is everywhere the\nsame,--a scene of labour and pain, of pleasure and reward; but what does\nit all avail? I am happy only where thou art, and in thy presence am I\ncontent to suffer or enjoy.\" And wouldst thou, heavenly Father, banish\nsuch a child from thy presence?\n\nDECEMBER 1.\n\nWilhelm, the man about whom I wrote to you--that man so enviable in his\nmisfortunes--was secretary to Charlotte's father; and an unhappy passion\nfor her which he cherished, concealed, and at length discovered, caused\nhim to be dismissed from his situation. This made him mad. Think, whilst\nyou peruse this plain narration, what an impression the circumstance has\nmade upon me! But it was related to me by Albert with as much calmness\nas you will probably peruse it.\n\nDECEMBER 4.\n\nI implore your attention. It is all over with me. I can support this\nstate no longer. To-day I was sitting by Charlotte. She was playing\nupon her piano a succession of delightful melodies, with such intense\nexpression! Her little sister was dressing her doll upon my lap. The\ntears came into my eyes. I leaned down, and looked intently at her\nwedding-ring: my tears fell--immediately she began to play that\nfavourite, that divine, air which has so often enchanted me. I felt\ncomfort from a recollection of the past, of those bygone days when that\nair was familiar to me; and then I recalled all the sorrows and the\ndisappointments which I had since endured. I paced with hasty strides\nthrough the room, my heart became convulsed with painful emotions. At\nlength I went up to her, and exclaimed With eagerness, \"For Heaven's\nsake, play that air no longer!\" She stopped, and looked steadfastly at\nme. She then said, with a smile which sunk deep into my heart, \"Werther,\nyou are ill: your dearest food is distasteful to you. But go, I entreat\nyou, and endeavour to compose yourself.\" I tore myself away. God, thou\nseest my torments, and wilt end them!\n\nDECEMBER 6.\n\nHow her image haunts me! Waking or asleep, she fills my entire soul!\nSoon as I close my eyes, here, in my brain, where all the nerves of\nvision are concentrated, her dark eyes are imprinted. Here--I do not\nknow how to describe it; but, if I shut my eyes, hers are immediately\nbefore me: dark as an abyss they open upon me, and absorb my senses.\n\nAnd what is man--that boasted demigod? Do not his powers fail when he\nmost requires their use? And whether he soar in joy, or sink in sorrow,\nis not his career in both inevitably arrested? And, whilst he fondly\ndreams that he is grasping at infinity, does he not feel compelled to\nreturn to a consciousness of his cold, monotonous existence?\n\nTHE EDITOR TO THE READER.\n\nIt is a matter of extreme regret that we want original evidence of the\nlast remarkable days of our friend; and we are, therefore, obliged\nto interrupt the progress of his correspondence, and to supply the\ndeficiency by a connected narration.\n\nI have felt it my duty to collect accurate information from the mouths\nof persons well acquainted with his history. The story is simple; and\nall the accounts agree, except in some unimportant particulars. It is\ntrue, that, with respect to the characters of the persons spoken of,\nopinions and judgments vary.\n\nWe have only, then, to relate conscientiously the facts which our\ndiligent labour has enabled us to collect, to give the letters of the\ndeceased, and to pay particular attention to the slightest fragment from\nhis pen, more especially as it is so difficult to discover the real and\ncorrect motives of men who are not of the common order.\n\nSorrow and discontent had taken deep root in Werther's soul, and\ngradually imparted their character to his whole being. The harmony of\nhis mind became completely disturbed; a perpetual excitement and mental\nirritation, which weakened his natural powers, produced the saddest\neffects upon him, and rendered him at length the victim of an exhaustion\nagainst which he struggled with still more painful efforts than he had\ndisplayed, even in contending with his other misfortunes. His mental\nanxiety weakened his various good qualities; and he was soon converted\ninto a gloomy companion, always unhappy and unjust in his ideas, the\nmore wretched he became. This was, at least, the opinion of Albert's\nfriends. They assert, moreover, that the character of Albert himself had\nundergone no change in the meantime: he was still the same being whom\nWerther had loved, honoured, and respected from the commencement. His\nlove for Charlotte was unbounded: he was proud of her, and desired that\nshe should be recognised by every one as the noblest of created beings.\nWas he, however, to blame for wishing to avert from her every appearance\nof suspicion? or for his unwillingness to share his rich prize with\nanother, even for a moment, and in the most innocent manner? It is\nasserted that Albert frequently retired from his wife's apartment during\nWerther's visits; but this did not arise from hatred or aversion to\nhis friend, but only from a feeling that his presence was oppressive to\nWerther.\n\nCharlotte's father, who was confined to the house by indisposition, was\naccustomed to send his carriage for her, that she might make excursions\nin the neighbourhood. One day the weather had been unusually severe, and\nthe whole country was covered with snow.\n\nWerther went for Charlotte the following morning, in order that, if\nAlbert were absent, he might conduct her home.\n\nThe beautiful weather produced but little impression on his troubled\nspirit. A heavy weight lay upon his soul, deep melancholy had taken\npossession of him, and his mind knew no change save from one painful\nthought to another.\n\nAs he now never enjoyed internal peace, the condition of his fellow\ncreatures was to him a perpetual source of trouble and distress. He\nbelieved he had disturbed the happiness of Albert and his wife; and,\nwhilst he censured himself strongly for this, he began to entertain a\nsecret dislike to Albert.\n\nHis thoughts were occasionally directed to this point. \"Yes,\" he would\nrepeat to himself, with ill-concealed dissatisfaction, \"yes, this is,\nafter all, the extent of that confiding, dear, tender, and sympathetic\nlove, that calm and eternal fidelity! What do I behold but satiety and\nindifference? Does not every frivolous engagement attract him more than\nhis charming and lovely wife? Does he know how to prize his happiness?\nCan he value her as she deserves? He possesses her, it is true, I know\nthat, as I know much more, and I have become accustomed to the thought\nthat he will drive me mad, or, perhaps, murder me. Is his friendship\ntoward me unimpaired? Does he not view my attachment to Charlotte as\nan infringement upon his rights, and consider my attention to her as a\nsilent rebuke to himself? I know, and indeed feel, that he dislikes me,\nthat he wishes for my absence, that my presence is hateful to him.\"\n\nHe would often pause when on his way to visit Charlotte, stand still, as\nthough in doubt, and seem desirous of returning, but would nevertheless\nproceed; and, engaged in such thoughts and soliloquies as we have\ndescribed, he finally reached the hunting-lodge, with a sort of\ninvoluntary consent.\n\nUpon one occasion he entered the house; and, inquiring for Charlotte,\nhe observed that the inmates were in a state of unusual confusion.\nThe eldest boy informed him that a dreadful misfortune had occurred\nat Walheim,--that a peasant had been murdered! But this made little\nimpression upon him. Entering the apartment, he found Charlotte engaged\nreasoning with her father, who, in spite of his infirmity, insisted on\ngoing to the scene of the crime, in order to institute an inquiry. The\ncriminal was unknown; the victim had been found dead at his own door\nthat morning. Suspicions were excited: the murdered man had been in\nthe service of a widow, and the person who had previously filled the\nsituation had been dismissed from her employment.\n\nAs soon as Werther heard this, he exclaimed with great excitement,\n\"Is it possible! I must go to the spot--I cannot delay a moment!\" He\nhastened to Walheim. Every incident returned vividly to his remembrance;\nand he entertained not the slightest doubt that that man was the\nmurderer to whom he had so often spoken, and for whom he entertained\nso much regard. His way took him past the well-known lime trees, to the\nhouse where the body had been carried; and his feelings were greatly\nexcited at the sight of the fondly recollected spot. That threshold\nwhere the neighbours' children had so often played together was stained\nwith blood; love and attachment, the noblest feelings of human nature,\nhad been converted into violence and murder. The huge trees stood there\nleafless and covered with hoarfrost; the beautiful hedgerows which\nsurrounded the old churchyard wall were withered; and the gravestones,\nhalf covered with snow, were visible through the openings.\n\nAs he approached the inn, in front of which the whole village was\nassembled, screams were suddenly heard. A troop of armed peasants was\nseen approaching, and every one exclaimed that the criminal had been\napprehended. Werther looked, and was not long in doubt. The prisoner\nwas no other than the servant, who had been formerly so attached to the\nwidow, and whom he had met prowling about, with that suppressed anger\nand ill-concealed despair, which we have before described.\n\n\"What have you done, unfortunate man?\" inquired Werther, as he advanced\ntoward the prisoner. The latter turned his eyes upon him in silence, and\nthen replied with perfect composure; \"No one will now marry her, and\nshe will marry no one.\" The prisoner was taken into the inn, and Werther\nleft the place. The mind of Werther was fearfully excited by this\nshocking occurrence. He ceased, however, to be oppressed by his usual\nfeeling of melancholy, moroseness, and indifference to everything\nthat passed around him. He entertained a strong degree of pity for the\nprisoner, and was seized with an indescribable anxiety to save him from\nhis impending fate. He considered him so unfortunate, he deemed his\ncrime so excusable, and thought his own condition so nearly similar,\nthat he felt convinced he could make every one else view the matter in\nthe light in which he saw it himself. He now became anxious to undertake\nhis defence, and commenced composing an eloquent speech for the\noccasion; and, on his way to the hunting-lodge, he could not refrain\nfrom speaking aloud the statement which he resolved to make to the\njudge.\n\nUpon his arrival, he found Albert had been before him: and he was a\nlittle perplexed by this meeting; but he soon recovered himself, and\nexpressed his opinion with much warmth to the judge. The latter shook,\nhis head doubtingly; and although Werther urged his case with the utmost\nzeal, feeling, and determination in defence of his client, yet, as we\nmay easily suppose, the judge was not much influenced by his appeal.\nOn the contrary, he interrupted him in his address, reasoned with\nhim seriously, and even administered a rebuke to him for becoming\nthe advocate of a murderer. He demonstrated, that, according to this\nprecedent, every law might be violated, and the public security utterly\ndestroyed. He added, moreover, that in such a case he could himself do\nnothing, without incurring the greatest responsibility; that everything\nmust follow in the usual course, and pursue the ordinary channel.\n\nWerther, however, did not abandon his enterprise, and even besought the\njudge to connive at the flight of the prisoner. But this proposal\nwas peremptorily rejected. Albert, who had taken some part in the\ndiscussion, coincided in opinion with the judge. At this Werther became\nenraged, and took his leave in great anger, after the judge had more\nthan once assured him that the prisoner could not be saved.\n\nThe excess of his grief at this assurance may be inferred from a note we\nhave found amongst his papers, and which was doubtless written upon this\nvery occasion.\n\n\"You cannot be saved, unfortunate man! I see clearly that we cannot be\nsaved!\"\n\nWerther was highly incensed at the observations which Albert had made\nto the judge in this matter of the prisoner. He thought he could detect\ntherein a little bitterness toward himself personally; and although,\nupon reflection, it could not escape his sound judgment that their view\nof the matter was correct, he felt the greatest possible reluctance to\nmake such an admission.\n\nA memorandum of Werther's upon this point, expressive of his general\nfeelings toward Albert, has been found amongst his papers.\n\n\"What is the use of my continually repeating that he is a good and\nestimable man? He is an inward torment to me, and I am incapable of\nbeing just toward him.\"\n\nOne fine evening in winter, when the weather seemed inclined to thaw,\nCharlotte and Albert were returning home together. The former looked\nfrom time to time about her, as if she missed Werther's company. Albert\nbegan to speak of him, and censured him for his prejudices. He\nalluded to his unfortunate attachment, and wished it were possible\nto discontinue his acquaintance. \"I desire it on our own account,\" he\nadded; \"and I request you will compel him to alter his deportment toward\nyou, and to visit you less frequently. The world is censorious, and I\nknow that here and there we are spoken of.\" Charlotte made no reply,\nand Albert seemed to feel her silence. At least, from that time he never\nagain spoke of Werther; and, when she introduced the subject, he allowed\nthe conversation to die away, or else he directed the discourse into\nanother channel.\n\nThe vain attempt Werther had made to save the unhappy murderer was the\nlast feeble glimmering of a flame about to be extinguished. He sank\nalmost immediately afterward into a state of gloom and inactivity, until\nhe was at length brought to perfect distraction by learning that he\nwas to be summoned as a witness against the prisoner, who asserted his\ncomplete innocence.\n\nHis mind now became oppressed by the recollection of every misfortune\nof his past life. The mortification he had suffered at the ambassador's,\nand his subsequent troubles, were revived in his memory. He became\nutterly inactive. Destitute of energy, he was cut off from every pursuit\nand occupation which compose the business of common life; and he became\na victim to his own susceptibility, and to his restless passion for the\nmost amiable and beloved of women, whose peace he destroyed. In this\nunvarying monotony of existence his days were consumed; and his powers\nbecame exhausted without aim or design, until they brought him to a\nsorrowful end.\n\nA few letters which he left behind, and which we here subjoin, afford\nthe best proofs of his anxiety of mind and of the depth of his passion,\nas well as of his doubts and struggles, and of his weariness of life.\n\nDECEMBER 12.\n\nDear Wilhelm, I am reduced to the condition of those unfortunate\nwretches who believe they are pursued by an evil spirit. Sometimes I am\noppressed, not by apprehension or fear, but by an inexpressible internal\nsensation, which weighs upon my heart, and impedes my breath! Then\nI wander forth at night, even in this tempestuous season, and feel\npleasure in surveying the dreadful scenes around me.\n\nYesterday evening I went forth. A rapid thaw had suddenly set in: I\nhad been informed that the river had risen, that the brooks had all\noverflowed their banks, and that the whole vale of Walheim was under\nwater! Upon the stroke of twelve I hastened forth. I beheld a\nfearful sight. The foaming torrents rolled from the mountains in the\nmoonlight,--fields and meadows, trees and hedges, were confounded\ntogether; and the entire valley was converted into a deep lake, which\nwas agitated by the roaring wind! And when the moon shone forth, and\ntinged the black clouds with silver, and the impetuous torrent at\nmy feet foamed and resounded with awful and grand impetuosity, I was\novercome by a mingled sensation of apprehension and delight. With\nextended arms I looked down into the yawning abyss, and cried,\n\"Plunge!'\" For a moment my senses forsook me, in the intense delight of\nending my sorrows and my sufferings by a plunge into that gulf! And then\nI felt as if I were rooted to the earth, and incapable of seeking an end\nto my woes! But my hour is not yet come: I feel it is not. O Wilhelm,\nhow willingly could I abandon my existence to ride the whirlwind, or to\nembrace the torrent! and then might not rapture perchance be the portion\nof this liberated soul?\n\nI turned my sorrowful eyes toward a favourite spot, where I was\naccustomed to sit with Charlotte beneath a willow after a fatiguing\nwalk. Alas! it was covered with water, and with difficulty I found even\nthe meadow. And the fields around the hunting-lodge, thought I. Has our\ndear bower been destroyed by this unpitying storm? And a beam of past\nhappiness streamed upon me, as the mind of a captive is illumined by\ndreams of flocks and herds and bygone joys of home! But I am free from\nblame. I have courage to die! Perhaps I have,--but I still sit here,\nlike a wretched pauper, who collects fagots, and begs her bread from\ndoor to door, that she may prolong for a few days a miserable existence\nwhich she is unwilling to resign.\n\nDECEMBER 15.\n\nWhat is the matter with me, dear Wilhelm? I am afraid of myself! Is not\nmy love for her of the purest, most holy, and most brotherly nature? Has\nmy soul ever been sullied by a single sensual desire? but I will make no\nprotestations. And now, ye nightly visions, how truly have those mortals\nunderstood you, who ascribe your various contradictory effects to some\ninvincible power! This night I tremble at the avowal--I held her in my\narms, locked in a close embrace: I pressed her to my bosom, and covered\nwith countless kisses those dear lips which murmured in reply soft\nprotestations of love. My sight became confused by the delicious\nintoxication of her eyes. Heavens! is it sinful to revel again in such\nhappiness, to recall once more those rapturous moments with intense\ndelight? Charlotte! Charlotte! I am lost! My senses are bewildered, my\nrecollection is confused, mine eyes are bathed in tears--I am ill; and\nyet I am well--I wish for nothing--I have no desires--it were better I\nwere gone.\n\nUnder the circumstances narrated above, a determination to quit\nthis world had now taken fixed possession of Werther's soul. Since\nCharlotte's return, this thought had been the final object of all his\nhopes and wishes; but he had resolved that such a step should not be\ntaken with precipitation, but with calmness and tranquillity, and with\nthe most perfect deliberation.\n\nHis troubles and internal struggles may be understood from the following\nfragment, which was found, without any date, amongst his papers, and\nappears to have formed the beginning of a letter to Wilhelm.\n\n\"Her presence, her fate, her sympathy for me, have power still to\nextract tears from my withered brain.\n\n\"One lifts up the curtain, and passes to the other side,--that is\nall! And why all these doubts and delays? Because we know not what is\nbehind--because there is no returning--and because our mind infers that\nall is darkness and confusion, where we have nothing but uncertainty.\"\n\nHis appearance at length became quite altered by the effect of his\nmelancholy thoughts; and his resolution was now finally and irrevocably\ntaken, of which the following ambiguous letter, which he addressed to\nhis friend, may appear to afford some proof.\n\nDECEMBER 20.\n\nI am grateful to your love, Wilhelm, for having repeated your advice so\nseasonably. Yes, you are right: it is undoubtedly better that I should\ndepart. But I do not entirely approve your scheme of returning at\nonce to your neighbourhood; at least, I should like to make a little\nexcursion on the way, particularly as we may now expect a continued\nfrost, and consequently good roads. I am much pleased with your\nintention of coming to fetch me; only delay your journey for a\nfortnight, and wait for another letter from me. One should gather\nnothing before it is ripe, and a fortnight sooner or later makes a great\ndifference. Entreat my mother to pray for her son, and tell her I beg\nher pardon for all the unhappiness I have occasioned her. It has\never been my fate to give pain to those whose happiness I should have\npromoted. Adieu, my dearest friend. May every blessing of Heaven attend\nyou! Farewell.\n\nWe find it difficult to express the emotions with which Charlotte's soul\nwas agitated during the whole of this time, whether in relation to her\nhusband or to her unfortunate friend; although we are enabled, by our\nknowledge of her character, to understand their nature.\n\nIt is certain that she had formed a determination, by every means in\nher power to keep Werther at a distance; and, if she hesitated in her\ndecision, it was from a sincere feeling of friendly pity, knowing how\nmuch it would cost him, indeed, that he would find it almost impossible\nto comply with her wishes. But various causes now urged her to be firm.\nHer husband preserved a strict silence about the whole matter; and she\nnever made it a subject of conversation, feeling bound to prove to him\nby her conduct that her sentiments agreed with his.\n\nThe same day, which was the Sunday before Christmas, after Werther had\nwritten the last-mentioned letter to his friend, he came in the evening\nto Charlotte's house, and found her alone. She was busy preparing some\nlittle gifts for her brothers and sisters, which were to be distributed\nto them on Christmas Day. He began talking of the delight of\nthe children, and of that age when the sudden appearance of the\nChristmas-tree, decorated with fruit and sweetmeats, and lighted up with\nwax candles, causes such transports of joy. \"You shall have a gift too,\nif you behave well,\" said Charlotte, hiding her embarrassment under\nsweet smile. \"And what do you call behaving well? What should I do, what\ncan I do, my dear Charlotte?\" said he. \"Thursday night,\" she answered,\n\"is Christmas Eve. The children are all to be here, and my father too:\nthere is a present for each; do you come likewise, but do not come\nbefore that time.\" Werther started. \"I desire you will not: it must be\nso,\" she continued. \"I ask it of you as a favour, for my own peace and\ntranquillity. We cannot go on in this manner any longer.\" He turned away\nhis face walked hastily up and down the room, muttering indistinctly,\n\"We cannot go on in this manner any longer!\" Charlotte, seeing the\nviolent agitation into which these words had thrown him, endeavoured\nto divert his thoughts by different questions, but in vain. \"No,\nCharlotte!\" he exclaimed; \"I will never see you any more!\" \"And why so?\"\nshe answered. \"We may--we must see each other again; only let it be\nwith more discretion. Oh! why were you born with that excessive, that\nungovernable passion for everything that is dear to you?\" Then, taking\nhis hand, she said, \"I entreat of you to be more calm: your talents,\nyour understanding, your genius, will furnish you with a thousand\nresources. Be a man, and conquer an unhappy attachment toward a creature\nwho can do nothing but pity you.\" He bit his lips, and looked at her\nwith a gloomy countenance. She continued to hold his hand. \"Grant me but\na moment's patience, Werther,\" she said. \"Do you not see that you are\ndeceiving yourself, that you are seeking your own destruction? Why must\nyou love me, me only, who belong to another? I fear, I much fear, that\nit is only the impossibility of possessing me which makes your desire\nfor me so strong.\" He drew back his hand, whilst he surveyed her with a\nwild and angry look. \"'Tis well!\" he exclaimed, \"'tis very well! Did not\nAlbert furnish you with this reflection? It is profound, a very profound\nremark.\" \"A reflection that any one might easily make,\" she answered;\n\"and is there not a woman in the whole world who is at liberty, and has\nthe power to make you happy? Conquer yourself: look for such a being,\nand believe me when I say that you will certainly find her. I have long\nfelt for you, and for us all: you have confined yourself too long within\nthe limits of too narrow a circle. Conquer yourself; make an effort: a\nshort journey will be of service to you. Seek and find an object worthy\nof your love; then return hither, and let us enjoy together all the\nhappiness of the most perfect friendship.\"\n\n\"This speech,\" replied Werther with a cold smile, \"this speech should\nbe printed, for the benefit of all teachers. My dear Charlotte, allow me\nbut a short time longer, and all will be well.\" \"But however, Werther,\"\nshe added, \"do not come again before Christmas.\" He was about to make\nsome answer, when Albert came in. They saluted each other coldly, and\nwith mutual embarrassment paced up and down the room. Werther made\nsome common remarks; Albert did the same, and their conversation soon\ndropped. Albert asked his wife about some household matters; and,\nfinding that his commissions were not executed, he used some expressions\nwhich, to Werther's ear, savoured of extreme harshness. He wished to go,\nbut had not power to move; and in this situation he remained till eight\no'clock, his uneasiness and discontent continually increasing. At length\nthe cloth was laid for supper, and he took up his hat and stick. Albert\ninvited him to remain; but Werther, fancying that he was merely paying a\nformal compliment, thanked him coldly, and left the house.\n\nWerther returned home, took the candle from his servant, and retired\nto his room alone. He talked for some time with great earnestness to\nhimself, wept aloud, walked in a state of great excitement through his\nchamber; till at length, without undressing, he threw himself on the\nbed, where he was found by his servant at eleven o'clock, when the\nlatter ventured to enter the room, and take off his boots. Werther did\nnot prevent him, but forbade him to come in the morning till he should\nring.\n\nOn Monday morning, the 21st of December, he wrote to Charlotte the\nfollowing letter, which was found, sealed, on his bureau after his\ndeath, and was given to her. I shall insert it in fragments; as it\nappears, from several circumstances, to have been written in that\nmanner.\n\n\"It is all over, Charlotte: I am resolved to die! I make this\ndeclaration deliberately and coolly, without any romantic passion, on\nthis morning of the day when I am to see you for the last time. At the\nmoment you read these lines, O best of women, the cold grave will hold\nthe inanimate remains of that restless and unhappy being who, in the\nlast moments of his existence, knew no pleasure so great as that of\nconversing with you! I have passed a dreadful night or rather, let me\nsay, a propitious one; for it has given me resolution, it has fixed my\npurpose. I am resolved to die. When I tore myself from you yesterday,\nmy senses were in tumult and disorder; my heart was oppressed, hope and\npleasure had fled from me for ever, and a petrifying cold had seized\nmy wretched being. I could scarcely reach my room. I threw myself on\nmy knees; and Heaven, for the last time, granted me the consolation of\nshedding tears. A thousand ideas, a thousand schemes, arose within my\nsoul; till at length one last, fixed, final thought took possession of\nmy heart. It was to die. I lay down to rest; and in the morning, in the\nquiet hour of awakening, the same determination was upon me. To die! It\nis not despair: it is conviction that I have filled up the measure of\nmy sufferings, that I have reached my appointed term, and must sacrifice\nmyself for thee. Yes, Charlotte, why should I not avow it? One of us\nthree must die: it shall be Werther. O beloved Charlotte! this heart,\nexcited by rage and fury, has often conceived the horrid idea of\nmurdering your husband--you--myself! The lot is cast at length. And in\nthe bright, quiet evenings of summer, when you sometimes wander toward\nthe mountains, let your thoughts then turn to me: recollect how often\nyou have watched me coming to meet you from the valley; then bend your\neyes upon the churchyard which contains my grave, and, by the light of\nthe setting sun, mark how the evening breeze waves the tall grass\nwhich grows above my tomb. I was calm when I began this letter, but the\nrecollection of these scenes makes me weep like a child.\"\n\nAbout ten in the morning, Werther called his servant, and, whilst he\nwas dressing, told him that in a few days he intended to set out upon\na journey, and bade him therefore lay his clothes in order, and prepare\nthem for packing up, call in all his accounts, fetch home the books\nhe had lent, and give two months' pay to the poor dependants who were\naccustomed to receive from him a weekly allowance.\n\nHe breakfasted in his room, and then mounted his horse, and went to\nvisit the steward, who, however, was not at home. He walked pensively\nin the garden, and seemed anxious to renew all the ideas that were most\npainful to him.\n\nThe children did not suffer him to remain alone long. They followed him,\nskipping and dancing before him, and told him, that after to-morrow and\ntomorrow and one day more, they were to receive their Christmas gift\nfrom Charlotte; and they then recounted all the wonders of which they\nhad formed ideas in their child imaginations. \"Tomorrow and tomorrow,\"\nsaid he, \"and one day more!\" And he kissed them tenderly. He was going;\nbut the younger boy stopped him, to whisper something in his ear. He\ntold him that his elder brothers had written splendid New-Year's wishes\nso large! one for papa, and another for Albert and Charlotte, and one\nfor Werther; and they were to be presented early in the morning, on\nNew Year's Day. This quite overcame him. He made each of the children\na present, mounted his horse, left his compliments for papa and mamma,\nand, with tears in his eyes, rode away from the place.\n\nHe returned home about five o'clock, ordered his servant to keep up\nhis fire, desired him to pack his books and linen at the bottom of the\ntrunk, and to place his coats at the top. He then appears to have made\nthe following addition to the letter addressed to Charlotte:\n\n\"You do not expect me. You think I will obey you, and not visit you\nagain till Christmas Eve. O Charlotte, today or never! On Christmas Eve\nyou will hold this paper in your hand; you will tremble, and moisten it\nwith your tears. I will--I must! Oh, how happy I feel to be determined!\"\n\nIn the meantime, Charlotte was in a pitiable state of mind. After her\nlast conversation with Werther, she found how painful to herself it\nwould be to decline his visits, and knew how severely he would suffer\nfrom their separation.\n\nShe had, in conversation with Albert, mentioned casually that Werther\nwould not return before Christmas Eve; and soon afterward Albert went\non horseback to see a person in the neighbourhood, with whom he had to\ntransact some business which would detain him all night.\n\nCharlotte was sitting alone. None of her family were near, and she gave\nherself up to the reflections that silently took possession of her mind.\nShe was for ever united to a husband whose love and fidelity she had\nproved, to whom she was heartily devoted, and who seemed to be a special\ngift from Heaven to ensure her happiness. On the other hand, Werther had\nbecome dear to her. There was a cordial unanimity of sentiment between\nthem from the very first hour of their acquaintance, and their long\nassociation and repeated interviews had made an indelible impression\nupon her heart. She had been accustomed to communicate to him every\nthought and feeling which interested her, and his absence threatened to\nopen a void in her existence which it might be impossible to fill. How\nheartily she wished that she might change him into her brother,--that\nshe could induce him to marry one of her own friends, or could\nreestablish his intimacy with Albert.\n\nShe passed all her intimate friends in review before her mind, but found\nsomething objectionable in each, and could decide upon none to whom she\nwould consent to give him.\n\nAmid all these considerations she felt deeply but indistinctly that her\nown real but unexpressed wish was to retain him for herself, and her\npure and amiable heart felt from this thought a sense of oppression\nwhich seemed to forbid a prospect of happiness. She was wretched: a dark\ncloud obscured her mental vision.\n\nIt was now half-past six o'clock, and she heard Werther's step on the\nstairs. She at once recognised his voice, as he inquired if she were at\nhome. Her heart beat audibly--we could almost say for the first time--at\nhis arrival. It was too late to deny herself; and, as he entered, she\nexclaimed, with a sort of ill concealed confusion, \"You have not kept\nyour word!\" \"I promised nothing,\" he answered. \"But you should have\ncomplied, at least for my sake,\" she continued. \"I implore you, for both\nour sakes.\"\n\nShe scarcely knew what she said or did; and sent for some friends, who,\nby their presence, might prevent her being left alone with Werther. He\nput down some books he had brought with him, then made inquiries about\nsome others, until she began to hope that her friends might arrive\nshortly, entertaining at the same time a desire that they might stay\naway.\n\nAt one moment she felt anxious that the servant should remain in the\nadjoining room, then she changed her mind. Werther, meanwhile, walked\nimpatiently up and down. She went to the piano, and determined not\nto retire. She then collected her thoughts, and sat down quietly at\nWerther's side, who had taken his usual place on the sofa.\n\n\"Have you brought nothing to read?\" she inquired. He had nothing. \"There\nin my drawer,\" she continued, \"you will find your own translation of\nsome of the songs of Ossian. I have not yet read them, as I have still\nhoped to hear you recite them; but, for some time past, I have not been\nable to accomplish such a wish.\" He smiled, and went for the manuscript,\nwhich he took with a shudder. He sat down; and, with eyes full of tears,\nhe began to read.\n\n\"Star of descending night! fair is thy light in the west! thou liftest\nthy unshorn head from thy cloud; thy steps are stately on thy hill. What\ndost thou behold in the plain? The stormy winds are laid. The murmur of\nthe torrent comes from afar. Roaring waves climb the distant rock. The\nflies of evening are on their feeble wings: the hum of their course is\non the field. What dost thou behold, fair light? But thou dost smile and\ndepart. The waves come with joy around thee: they bathe thy lovely hair.\nFarewell, thou silent beam! Let the light of Ossian's soul arise!\n\n\"And it does arise in its strength! I behold my departed friends. Their\ngathering is on Lora, as in the days of other years. Fingal comes like a\nwatery column of mist! his heroes are around: and see the bards of song,\ngray-haired Ullin! stately Ryno! Alpin with the tuneful voice: the soft\ncomplaint of Minona! How are ye changed, my friends, since the days of\nSelma's feast! when we contended, like gales of spring as they fly along\nthe hill, and bend by turns the feebly whistling grass.\n\n\"Minona came forth in her beauty, with downcast look and tearful eye.\nHer hair was flying slowly with the blast that rushed unfrequent from\nthe hill. The souls of the heroes were sad when she raised the tuneful\nvoice. Oft had they seen the grave of Salgar, the dark dwelling of\nwhite-bosomed Colma. Colma left alone on the hill with all her voice of\nsong! Salgar promised to come! but the night descended around. Hear the\nvoice of Colma, when she sat alone on the hill!\n\n\"Colma. It is night: I am alone, forlorn on the hill of storms. The wind\nis heard on the mountain. The torrent is howling down the rock. No hut\nreceives me from the rain: forlorn on the hill of winds!\n\n\"Rise moon! from behind thy clouds. Stars of the night, arise! Lead me,\nsome light, to the place where my love rests from the chase alone! His\nbow near him unstrung, his dogs panting around him! But here I must\nsit alone by the rock of the mossy stream. The stream and the wind roar\naloud. I hear not the voice of my love! Why delays my Salgar; why the\nchief of the hill his promise? Here is the rock and here the tree! here\nis the roaring stream! Thou didst promise with night to be here. Ah!\nwhither is my Salgar gone? With thee I would fly from my father, with\nthee from my brother of pride. Our race have long been foes: we are not\nfoes, O Salgar!\n\n\"Cease a little while, O wind! stream, be thou silent awhile! let my\nvoice be heard around! let my wanderer hear me! Salgar! it is Colma who\ncalls. Here is the tree and the rock. Salgar, my love, I am here! Why\ndelayest thou thy coming? Lo! the calm moon comes forth. The flood is\nbright in the vale. The rocks are gray on the steep. I see him not\non the brow. His dogs come not before him with tidings of his near\napproach. Here I must sit alone!\n\n\"Who lie on the heath beside me? Are they my love and my brother? Speak\nto me, O my friends! To Colma they give no reply. Speak to me: I am\nalone! My soul is tormented with fears. Ah, they are dead! Their swords\nare red from the fight. O my brother! my brother! why hast thou slain my\nSalgar! Why, O Salgar, hast thou slain my brother! Dear were ye both to\nme! what shall I say in your praise? Thou wert fair on the hill among\nthousands! he was terrible in fight! Speak to me! hear my voice! hear\nme, sons of my love! They are silent! silent for ever! Cold, cold, are\ntheir breasts of clay! Oh, from the rock on the hill, from the top of\nthe windy steep, speak, ye ghosts of the dead! Speak, I will not be\nafraid! Whither are ye gone to rest? In what cave of the hill shall\nI find the departed? No feeble voice is on the gale: no answer half\ndrowned in the storm!\n\n\"I sit in my grief: I wait for morning in my tears! Rear the tomb, ye\nfriends of the dead. Close it not till Colma come. My life flies away\nlike a dream. Why should I stay behind? Here shall I rest with my\nfriends, by the stream of the sounding rock. When night comes on the\nhill when the loud winds arise my ghost shall stand in the blast, and\nmourn the death of my friends. The hunter shall hear from his booth;\nhe shall fear, but love my voice! For sweet shall my voice be for my\nfriends: pleasant were her friends to Colma.\n\n\"Such was thy song, Minona, softly blushing daughter of Torman. Our\ntears descended for Colma, and our souls were sad! Ullin came with his\nharp; he gave the song of Alpin. The voice of Alpin was pleasant, the\nsoul of Ryno was a beam of fire! But they had rested in the narrow\nhouse: their voice had ceased in Selma! Ullin had returned one day from\nthe chase before the heroes fell. He heard their strife on the hill:\ntheir song was soft, but sad! They mourned the fall of Morar, first of\nmortal men! His soul was like the soul of Fingal: his sword like the\nsword of Oscar. But he fell, and his father mourned: his sister's eyes\nwere full of tears. Minona's eyes were full of tears, the sister of\ncar-borne Morar. She retired from the song of Ullin, like the moon in\nthe west, when she foresees the shower, and hides her fair head in a\ncloud. I touched the harp with Ullin: the song of morning rose!\n\n\"Ryno. The wind and the rain are past, calm is the noon of day. The\nclouds are divided in heaven. Over the green hills flies the inconstant\nsun. Red through the stony vale comes down the stream of the hill. Sweet\nare thy murmurs, O stream! but more sweet is the voice I hear. It is the\nvoice of Alpin, the son of song, mourning for the dead! Bent is his head\nof age: red his tearful eye. Alpin, thou son of song, why alone on the\nsilent hill? why complainest thou, as a blast in the wood as a wave on\nthe lonely shore?\n\n\"Alpin. My tears, O Ryno! are for the dead my voice for those that have\npassed away. Tall thou art on the hill; fair among the sons of the vale.\nBut thou shalt fall like Morar: the mourner shall sit on thy tomb. The\nhills shall know thee no more: thy bow shall lie in thy hall unstrung!\n\n\"Thou wert swift, O Morar! as a roe on the desert: terrible as a meteor\nof fire. Thy wrath was as the storm. Thy sword in battle as lightning in\nthe field. Thy voice was as a stream after rain, like thunder on distant\nhills. Many fell by thy arm: they were consumed in the flames of thy\nwrath. But when thou didst return from war, how peaceful was thy brow.\nThy face was like the sun after rain: like the moon in the silence of\nnight: calm as the breast of the lake when the loud wind is laid.\n\n\"Narrow is thy dwelling now! dark the place of thine abode! With three\nsteps I compass thy grave, O thou who wast so great before! Four stones,\nwith their heads of moss, are the only memorial of thee. A tree with\nscarce a leaf, long grass which whistles in the wind, mark to the\nhunter's eye the grave of the mighty Morar. Morar! thou art low indeed.\nThou hast no mother to mourn thee, no maid with her tears of love. Dead\nis she that brought thee forth. Fallen is the daughter of Morglan.\n\n\"Who on his staff is this? Who is this whose head is white with age,\nwhose eyes are red with tears, who quakes at every step? It is thy\nfather, O Morar! the father of no son but thee. He heard of thy fame in\nwar, he heard of foes dispersed. He heard of Morar's renown, why did\nhe not hear of his wound? Weep, thou father of Morar! Weep, but thy son\nheareth thee not. Deep is the sleep of the dead, low their pillow of\ndust. No more shall he hear thy voice, no more awake at thy call. When\nshall it be morn in the grave, to bid the slumberer awake? Farewell,\nthou bravest of men! thou conqueror in the field! but the field shall\nsee thee no more, nor the dark wood be lightened with the splendour\nof thy steel. Thou has left no son. The song shall preserve thy name.\nFuture times shall hear of thee they shall hear of the fallen Morar!\n\n\"The grief of all arose, but most the bursting sigh of Armin. He\nremembers the death of his son, who fell in the days of his youth.\nCarmor was near the hero, the chief of the echoing Galmal. Why burst the\nsigh of Armin? he said. Is there a cause to mourn? The song comes with\nits music to melt and please the soul. It is like soft mist that, rising\nfrom a lake, pours on the silent vale; the green flowers are filled with\ndew, but the sun returns in his strength, and the mist is gone. Why art\nthou sad, O Armin, chief of sea-surrounded Gorma?\n\n\"Sad I am! nor small is my cause of woe! Carmor, thou hast lost no son;\nthou hast lost no daughter of beauty. Colgar the valiant lives, and\nAnnira, fairest maid. The boughs of thy house ascend, O Carmor! but\nArmin is the last of his race. Dark is thy bed, O Daura! deep thy sleep\nin the tomb! When shalt thou wake with thy songs? with all thy voice of\nmusic?\n\n\"Arise, winds of autumn, arise: blow along the heath. Streams of the\nmountains, roar; roar, tempests in the groves of my oaks! Walk through\nbroken clouds, O moon! show thy pale face at intervals; bring to my mind\nthe night when all my children fell, when Arindal the mighty fell--when\nDaura the lovely failed. Daura, my daughter, thou wert fair, fair as\nthe moon on Fura, white as the driven snow, sweet as the breathing gale.\nArindal, thy bow was strong, thy spear was swift on the field, thy look\nwas like mist on the wave, thy shield a red cloud in a storm! Armar,\nrenowned in war, came and sought Daura's love. He was not long refused:\nfair was the hope of their friends.\n\n\"Erath, son of Odgal, repined: his brother had been slain by Armar. He\ncame disguised like a son of the sea: fair was his cliff on the wave,\nwhite his locks of age, calm his serious brow. Fairest of women, he\nsaid, lovely daughter of Armin! a rock not distant in the sea bears\na tree on its side; red shines the fruit afar. There Armar waits for\nDaura. I come to carry his love! she went she called on Armar. Nought\nanswered, but the son of the rock. Armar, my love, my love! why\ntormentest thou me with fear? Hear, son of Arnart, hear! it is Daura who\ncalleth thee. Erath, the traitor, fled laughing to the land. She lifted\nup her voice--she called for her brother and her father. Arindal! Armin!\nnone to relieve you, Daura.\n\n\"Her voice came over the sea. Arindal, my son, descended from the hill,\nrough in the spoils of the chase. His arrows rattled by his side; his\nbow was in his hand, five dark-gray dogs attended his steps. He saw\nfierce Erath on the shore; he seized and bound him to an oak. Thick wind\nthe thongs of the hide around his limbs; he loads the winds with his\ngroans. Arindal ascends the deep in his boat to bring Daura to land.\nArmar came in his wrath, and let fly the gray-feathered shaft. It sung,\nit sunk in thy heart, O Arindal, my son! for Erath the traitor thou\ndiest. The oar is stopped at once: he panted on the rock, and expired.\nWhat is thy grief, O Daura, when round thy feet is poured thy brother's\nblood. The boat is broken in twain. Armar plunges into the sea to rescue\nhis Daura, or die. Sudden a blast from a hill came over the waves; he\nsank, and he rose no more.\n\n\"Alone, on the sea-beat rock, my daughter was heard to complain;\nfrequent and loud were her cries. What could her father do? All night I\nstood on the shore: I saw her by the faint beam of the moon. All night\nI heard her cries. Loud was the wind; the rain beat hard on the hill.\nBefore morning appeared, her voice was weak; it died away like the\nevening breeze among the grass of the rocks. Spent with grief, she\nexpired, and left thee, Armin, alone. Gone is my strength in war, fallen\nmy pride among women. When the storms aloft arise, when the north lifts\nthe wave on high, I sit by the sounding shore, and look on the fatal\nrock.\n\n\"Often by the setting moon I see the ghosts of my children; half\nviewless they walk in mournful conference together.\"\n\nA torrent of tears which streamed from Charlotte's eyes and gave relief\nto her bursting heart, stopped Werther's recitation. He threw down the\nbook, seized her hand, and wept bitterly. Charlotte leaned upon her\nhand, and buried her face in her handkerchief: the agitation of both was\nexcessive. They felt that their own fate was pictured in the misfortunes\nof Ossian's heroes, they felt this together, and their tears redoubled.\nWerther supported his forehead on Charlotte's arm: she trembled, she\nwished to be gone; but sorrow and sympathy lay like a leaden weight upon\nher soul. She recovered herself shortly, and begged Werther, with broken\nsobs, to leave her, implored him with the utmost earnestness to comply\nwith her request. He trembled; his heart was ready to burst: then,\ntaking up the book again, he recommenced reading, in a voice broken by\nsobs.\n\n\"Why dost thou waken me, O spring? Thy voice woos me, exclaiming,\nI refresh thee with heavenly dews; but the time of my decay is\napproaching, the storm is nigh that shall whither my leaves. Tomorrow\nthe traveller shall come, he shall come, who beheld me in beauty: his\neye shall seek me in the field around, but he shall not find me.\"\n\nThe whole force of these words fell upon the unfortunate Werther. Full\nof despair, he threw himself at Charlotte's feet, seized her hands, and\npressed them to his eyes and to his forehead. An apprehension of\nhis fatal project now struck her for the first time. Her senses were\nbewildered: she held his hands, pressed them to her bosom; and, leaning\ntoward him with emotions of the tenderest pity, her warm cheek touched\nhis. They lost sight of everything. The world disappeared from their\neyes. He clasped her in his arms, strained her to his bosom, and covered\nher trembling lips with passionate kisses. \"Werther!\" she cried with a\nfaint voice, turning herself away; \"Werther!\" and, with a feeble hand,\nshe pushed him from her. At length, with the firm voice of virtue, she\nexclaimed, \"Werther!\" He resisted not, but, tearing himself from her\narms, fell on his knees before her. Charlotte rose, and, with disordered\ngrief, in mingled tones of love and resentment, she exclaimed, \"It is\nthe last time, Werther! You shall never see me any more!\" Then, casting\none last, tender look upon her unfortunate lover, she rushed into the\nadjoining room, and locked the door. Werther held out his arms, but\ndid not dare to detain her. He continued on the ground, with his head\nresting on the sofa, for half an hour, till he heard a noise which\nbrought him to his senses. The servant entered. He then walked up and\ndown the room; and, when he was again left alone, he went to Charlotte's\ndoor, and, in a low voice, said, \"Charlotte, Charlotte! but one word\nmore, one last adieu!\" She returned no answer. He stopped, and listened\nand entreated; but all was silent. At length he tore himself from the\nplace, crying, \"Adieu, Charlotte, adieu for ever!\"\n\nWerther ran to the gate of the town. The guards, who knew him, let him\npass in silence. The night was dark and stormy,--it rained and snowed.\nHe reached his own door about eleven. His servant, although seeing him\nenter the house without his hat, did not venture to say anything; and;\nas he undressed his master, he found that his clothes were wet. His hat\nwas afterward found on the point of a rock overhanging the valley; and\nit is inconceivable how he could have climbed to the summit on such a\ndark, tempestuous night without losing his life.\n\nHe retired to bed, and slept to a late hour. The next morning his\nservant, upon being called to bring his coffee, found him writing. He\nwas adding, to Charlotte, what we here annex.\n\n\"For the last, last time I open these eyes. Alas! they will behold the\nsun no more. It is covered by a thick, impenetrable cloud. Yes, Nature!\nput on mourning: your child, your friend, your lover, draws near his\nend! This thought, Charlotte, is without parallel; and yet it seems\nlike a mysterious dream when I repeat--this is my last day! The last!\nCharlotte, no word can adequately express this thought. The last! To-day\nI stand erect in all my strength to-morrow, cold and stark, I shall lie\nextended upon the ground. To die! what is death? We do but dream in our\ndiscourse upon it. I have seen many human beings die; but, so straitened\nis our feeble nature, we have no clear conception of the beginning or\nthe end of our existence. At this moment I am my own--or rather I am\nthine, thine, my adored! and the next we are parted, severed--perhaps\nfor ever! No, Charlotte, no! How can I, how can you, be annihilated? We\nexist. What is annihilation? A mere word, an unmeaning sound that fixes\nno impression on the mind. Dead, Charlotte! laid in the cold earth, in\nthe dark and narrow grave! I had a friend once who was everything to me\nin early youth. She died. I followed her hearse; I stood by her grave\nwhen the coffin was lowered; and when I heard the creaking of the cords\nas they were loosened and drawn up, when the first shovelful of earth\nwas thrown in, and the coffin returned a hollow sound, which grew\nfainter and fainter till all was completely covered over, I threw myself\non the ground; my heart was smitten, grieved, shattered, rent--but I\nneither knew what had happened, nor what was to happen to me. Death!\nthe grave! I understand not the words.--Forgive, oh, forgive me!\nYesterday--ah, that day should have been the last of my life! Thou\nangel! for the first time in my existence, I felt rapture glow within\nmy inmost soul. She loves, she loves me! Still burns upon my lips the\nsacred fire they received from thine. New torrents of delight overwhelm\nmy soul. Forgive me, oh, forgive!\n\n\"I knew that I was dear to you; I saw it in your first entrancing look,\nknew it by the first pressure of your hand; but when I was absent from\nyou, when I saw Albert at your side, my doubts and fears returned.\n\n\"Do you remember the flowers you sent me, when, at that crowded\nassembly, you could neither speak nor extend your hand to me? Half the\nnight I was on my knees before those flowers, and I regarded them as the\npledges of your love; but those impressions grew fainter, and were at\nlength effaced.\n\n\"Everything passes away; but a whole eternity could not extinguish the\nliving flame which was yesterday kindled by your lips, and which now\nburns within me. She loves me! These arms have encircled her waist,\nthese lips have trembled upon hers. She is mine! Yes, Charlotte, you are\nmine for ever!\n\n\"And what do they mean by saying Albert is your husband? He may be so\nfor this world; and in this world it is a sin to love you, to wish\nto tear you from his embrace. Yes, it is a crime; and I suffer the\npunishment, but I have enjoyed the full delight of my sin. I have\ninhaled a balm that has revived my soul. From this hour you are mine;\nyes, Charlotte, you are mine! I go before you. I go to my Father and to\nyour Father. I will pour out my sorrows before him, and he will give me\ncomfort till you arrive. Then will I fly to meet you. I will claim you,\nand remain your eternal embrace, in the presence of the Almighty.\n\n\"I do not dream, I do not rave. Drawing nearer to the grave my\nperceptions become clearer. We shall exist; we shall see each other\nagain; we shall behold your mother; I shall behold her, and expose to\nher my inmost heart. Your mother--your image!\"\n\nAbout eleven o'clock Werther asked his servant if Albert had returned.\nHe answered, \"Yes;\" for he had seen him pass on horseback: upon which\nWerther sent him the following note, unsealed:\n\n\"Be so good as to lend me your pistols for a journey. Adieu.\"\n\nCharlotte had slept little during the past night. All her apprehensions\nwere realised in a way that she could neither foresee nor avoid. Her\nblood was boiling in her veins, and a thousand painful sensations rent\nher pure heart. Was it the ardour of Werther's passionate embraces that\nshe felt within her bosom? Was it anger at his daring? Was it the sad\ncomparison of her present condition with former days of innocence,\ntranquillity, and self-confidence? How could she approach her husband,\nand confess a scene which she had no reason to conceal, and which she\nyet felt, nevertheless, unwilling to avow? They had preserved so long a\nsilence toward each other and should she be the first to break it by so\nunexpected a discovery? She feared that the mere statement of Werther's\nvisit would trouble him, and his distress would be heightened by her\nperfect candour. She wished that he could see her in her true light, and\njudge her without prejudice; but was she anxious that he should read her\ninmost soul? On the other hand, could she deceive a being to whom all\nher thoughts had ever been exposed as clearly as crystal, and from whom\nno sentiment had ever been concealed? These reflections made her anxious\nand thoughtful. Her mind still dwelt on Werther, who was now lost to\nher, but whom she could not bring herself to resign, and for whom she\nknew nothing was left but despair if she should be lost to him for ever.\n\nA recollection of that mysterious estrangement which had lately\nsubsisted between herself and Albert, and which she could never\nthoroughly understand, was now beyond measure painful to her. Even the\nprudent and the good have before now hesitated to explain their mutual\ndifferences, and have dwelt in silence upon their imaginary grievances,\nuntil circumstances have become so entangled, that in that critical\njuncture, when a calm explanation would have saved all parties, an\nunderstanding was impossible. And thus if domestic confidence had been\nearlier established between them, if love and kind forbearance had\nmutually animated and expanded their hearts, it might not, perhaps, even\nyet have been too late to save our friend.\n\nBut we must not forget one remarkable circumstance. We may observe from\nthe character of Werther's correspondence, that he had never affected\nto conceal his anxious desire to quit this world. He had often discussed\nthe subject with Albert; and, between the latter and Charlotte, it had\nnot unfrequently formed a topic of conversation. Albert was so opposed\nto the very idea of such an action, that, with a degree of irritation\nunusual in him, he had more than once given Werther to understand that\nhe doubted the seriousness of his threats, and not only turned them into\nridicule, but caused Charlotte to share his feelings of incredulity.\nHer heart was thus tranquillised when she felt disposed to view\nthe melancholy subject in a serious point of view, though she never\ncommunicated to her husband the apprehensions she sometimes experienced.\n\nAlbert, upon his return, was received by Charlotte with ill-concealed\nembarrassment. He was himself out of humour; his business was\nunfinished; and he had just discovered that the neighbouring official\nwith whom he had to deal, was an obstinate and narrow-minded personage.\nMany things had occurred to irritate him.\n\nHe inquired whether anything had happened during his absence, and\nCharlotte hastily answered that Werther had been there on the evening\npreviously. He then inquired for his letters, and was answered that\nseveral packages had been left in his study. He thereon retired, leaving\nCharlotte alone.\n\nThe presence of the being she loved and honoured produced a new\nimpression on her heart. The recollection of his generosity, kindness,\nand affection had calmed her agitation: a secret impulse prompted her\nto follow him; she took her work and went to his study, as was often\nher custom. He was busily employed opening and reading his letters.\nIt seemed as if the contents of some were disagreeable. She asked some\nquestions: he gave short answers, and sat down to write.\n\nSeveral hours passed in this manner, and Charlotte's feelings became\nmore and more melancholy. She felt the extreme difficulty of explaining\nto her husband, under any circumstances, the weight that lay upon her\nheart; and her depression became every moment greater, in proportion as\nshe endeavoured to hide her grief, and to conceal her tears.\n\nThe arrival of Werther's servant occasioned her the greatest\nembarrassment. He gave Albert a note, which the latter coldly handed to\nhis wife, saying, at the same time, \"Give him the pistols. I wish him\na pleasant journey,\" he added, turning to the servant. These words\nfell upon Charlotte like a thunderstroke: she rose from her seat\nhalf-fainting, and unconscious of what she did. She walked mechanically\ntoward the wall, took down the pistols with a trembling hand, slowly\nwiped the dust from them, and would have delayed longer, had not Albert\nhastened her movements by an impatient look. She then delivered the\nfatal weapons to the servant, without being able to utter a word. As\nsoon as he had departed, she folded up her work, and retired at once\nto her room, her heart overcome with the most fearful forebodings. She\nanticipated some dreadful calamity. She was at one moment on the point\nof going to her husband, throwing herself at his feet, and acquainting\nhim with all that had happened on the previous evening, that she might\nacknowledge her fault, and explain her apprehensions; then she saw that\nsuch a step would be useless, as she would certainly be unable to induce\nAlbert to visit Werther. Dinner was served; and a kind friend whom she\nhad persuaded to remain assisted to sustain the conversation, which was\ncarried on by a sort of compulsion, till the events of the morning were\nforgotten.\n\nWhen the servant brought the pistols to Werther, the latter received\nthem with transports of delight upon hearing that Charlotte had given\nthem to him with her own hand. He ate some bread, drank some wine, sent\nhis servant to dinner, and then sat down to write as follows:\n\n\"They have been in your hands you wiped the dust from them. I kiss them\na thousand times--you have touched them. Yes, Heaven favours my design,\nand you, Charlotte, provide me with the fatal instruments. It was my\ndesire to receive my death from your hands, and my wish is gratified.\nI have made inquiries of my servant. You trembled when you gave him the\npistols, but you bade me no adieu. Wretched, wretched that I am--not one\nfarewell! How could you shut your heart against me in that hour which\nmakes you mine for ever? Charlotte, ages cannot efface the impression--I\nfeel you cannot hate the man who so passionately loves you!\"\n\nAfter dinner he called his servant, desired him to finish the packing\nup, destroyed many papers, and then went out to pay some trifling debts.\nHe soon returned home, then went out again, notwithstanding the rain,\nwalked for some time in the count's garden, and afterward proceeded\nfarther into the country. Toward evening he came back once more, and\nresumed his writing.\n\n\"Wilhelm, I have for the last time beheld the mountains, the forests,\nand the sky. Farewell! And you, my dearest mother, forgive me! Console\nher, Wilhelm. God bless you! I have settled all my affairs! Farewell! We\nshall meet again, and be happier than ever.\"\n\n\"I have requited you badly, Albert; but you will forgive me. I have\ndisturbed the peace of your home. I have sowed distrust between you.\nFarewell! I will end all this wretchedness. And oh, that my death\nmay render you happy! Albert, Albert! make that angel happy, and the\nblessing of Heaven be upon you!\"\n\nHe spent the rest of the evening in arranging his papers: he tore and\nburned a great many; others he sealed up, and directed to Wilhelm.\nThey contained some detached thoughts and maxims, some of which I have\nperused. At ten o'clock he ordered his fire to be made up, and a bottle\nof wine to be brought to him. He then dismissed his servant, whose room,\nas well as the apartments of the rest of the family, was situated in\nanother part of the house. The servant lay down without undressing, that\nhe might be the sooner ready for his journey in the morning, his master\nhaving informed him that the post-horses would be at the door before six\no'clock.\n\n\"Past eleven o'clock! All is silent around me, and my soul is calm. I\nthank thee, O God, that thou bestowest strength and courage upon me in\nthese last moments! I approach the window, my dearest of friends; and\nthrough the clouds, which are at this moment driven rapidly along by the\nimpetuous winds, I behold the stars which illumine the eternal heavens.\nNo, you will not fall, celestial bodies: the hand of the Almighty\nsupports both you and me! I have looked for the last time upon the\nconstellation of the Greater Bear: it is my favourite star; for when\nI bade you farewell at night, Charlotte, and turned my steps from your\ndoor, it always shone upon me. With what rapture have I at times beheld\nit! How often have I implored it with uplifted hands to witness my\nfelicity! and even still--But what object is there, Charlotte, which\nfails to summon up your image before me? Do you not surround me on all\nsides? and have I not, like a child, treasured up every trifle which you\nhave consecrated by your touch?\n\n\"Your profile, which was so dear to me, I return to you; and I pray\nyou to preserve it. Thousands of kisses have I imprinted upon it, and a\nthousand times has it gladdened my heart on departing from and returning\nto my home.\n\n\"I have implored your father to protect my remains. At the corner of the\nchurchyard, looking toward the fields, there are two lime-trees--there\nI wish to lie. Your father can, and doubtless will, do this much for his\nfriend. Implore it of him. But perhaps pious Christians will not choose\nthat their bodies should be buried near the corpse of a poor, unhappy\nwretch like me. Then let me be laid in some remote valley, or near the\nhighway, where the priest and Levite may bless themselves as they pass\nby my tomb, whilst the Samaritan will shed a tear for my fate.\n\n\"See, Charlotte, I do not shudder to take the cold and fatal cup, from\nwhich I shall drink the draught of death. Your hand presents it to me,\nand I do not tremble. All, all is now concluded: the wishes and the\nhopes of my existence are fulfilled. With cold, unflinching hand I knock\nat the brazen portals of Death. Oh, that I had enjoyed the bliss of\ndying for you! how gladly would I have sacrificed myself for you;\nCharlotte! And could I but restore peace and joy to your bosom, with\nwhat resolution, with what joy, would I not meet my fate! But it is the\nlot of only a chosen few to shed their blood for their friends, and by\ntheir death to augment, a thousand times, the happiness of those by whom\nthey are beloved.\n\n\"I wish, Charlotte, to be buried in the dress I wear at present: it has\nbeen rendered sacred by your touch. I have begged this favour of your\nfather. My spirit soars above my sepulchre. I do not wish my pockets to\nbe searched. The knot of pink ribbon which you wore on your bosom\nthe first time I saw you, surrounded by the children--Oh, kiss them a\nthousand times for me, and tell them the fate of their unhappy friend! I\nthink I see them playing around me. The dear children! How warmly have\nI been attached to you, Charlotte! Since the first hour I saw you, how\nimpossible have I found it to leave you. This ribbon must be buried\nwith me: it was a present from you on my birthday. How confused it all\nappears! Little did I then think that I should journey this road. But\npeace! I pray you, peace!\n\n\"They are loaded--the clock strikes twelve. I say amen. Charlotte,\nCharlotte! farewell, farewell!\"\n\nA neighbour saw the flash, and heard the report of the pistol; but, as\neverything remained quiet, he thought no more of it.\n\nIn the morning, at six o'clock, the servant went into Werther's room\nwith a candle. He found his master stretched upon the floor, weltering\nin his blood, and the pistols at his side. He called, he took him in\nhis arms, but received no answer. Life was not yet quite extinct. The\nservant ran for a surgeon, and then went to fetch Albert. Charlotte\nheard the ringing of the bell: a cold shudder seized her. She wakened\nher husband, and they both rose. The servant, bathed in tears faltered\nforth the dreadful news. Charlotte fell senseless at Albert's feet.\n\nWhen the surgeon came to the unfortunate Werther, he was still lying\non the floor; and his pulse beat, but his limbs were cold. The bullet,\nentering the forehead, over the right eye, had penetrated the skull. A\nvein was opened in his right arm: the blood came, and he still continued\nto breathe.\n\nFrom the blood which flowed from the chair, it could be inferred that he\nhad committed the rash act sitting at his bureau, and that he afterward\nfell upon the floor. He was found lying on his back near the window. He\nwas in full-dress costume.\n\nThe house, the neighbourhood, and the whole town were immediately in\ncommotion. Albert arrived. They had laid Werther on the bed: his head\nwas bound up, and the paleness of death was upon his face. His limbs\nwere motionless; but he still breathed, at one time strongly, then\nweaker--his death was momently expected.\n\nHe had drunk only one glass of the wine. \"Emilia Galotti\" lay open upon\nhis bureau.\n\nI shall say nothing of Albert's distress, or of Charlotte's grief.\n\nThe old steward hastened to the house immediately upon hearing the news:\nhe embraced his dying friend amid a flood of tears. His eldest boys\nsoon followed him on foot. In speechless sorrow they threw themselves on\ntheir knees by the bedside, and kissed his hands and face. The eldest,\nwho was his favourite, hung over him till he expired; and even then he\nwas removed by force. At twelve o'clock Werther breathed his last. The\npresence of the steward, and the precautions he had adopted, prevented\na disturbance; and that night, at the hour of eleven, he caused the body\nto be interred in the place which Werther had selected for himself.\n\nThe steward and his sons followed the corpse to the grave. Albert was\nunable to accompany them. Charlotte's life was despaired of. The body\nwas carried by labourers. No priest attended.", "title": "The Sorrows of Young Werther"}