{"summary": "\n\nRosaura walks through the mountains of Poland, dressed as a man. She finds Clarín, a jester, who tries to make her forget how miserably Poland receives visitors. They arrive at a tower, where they find Segismundo imprisoned, bound in chains. He tells them that his only crime was being born. Clotaldo, Segismundo's old warden and tutor, arrives and orders his guards to disarm and kill the intruders. But he recognizes Rosaura's sword as his own that he had left behind in Muskovy years ago for his child to bear. Suspecting that Rosaura is his child (he thinks she is male), he takes Rosaura and Clarin with him to court.\n\nAt the palace, Astolfo, Duke of Muscovy, discusses with his cousin, Princess Estrella, that as they are the nephew and niece of King Basilio of Poland, they would be his successors if they married each other. Estrella is troubled by the locket that Astolfo wears, with another woman's portrait. Basilio reveals to them that he imprisoned his infant son, Segismundo, due to a prophecy by an oracle that the prince would bring disgrace to Poland and would kill his father, but he wants to grant his son a chance to prove the oracle wrong. If he finds him evil and unworthy, he will send him back to his cell, making way for Astolfo and Estrella to become the new king and queen. Clotaldo enters with Rosaura, telling Basilio that the intruders know about Segismundo. He begs for the king's pardon, as he knows he should have killed them. The king says he should not worry, for his secret has already been revealed. Rosaura tells Clotaldo that she wants revenge against Astolfo, but she won't say why. Clotaldo is reluctant to reveal that he thinks he is Rosaura's father.\n\nClotaldo gives Segismundo a sedative that puts him to sleep. At the castle, Clotaldo has learned that Rosaura is a woman; Clarin explains that Rosaura is Princess Estrella's maid but has been going by the name of Astrea. When Segismundo is awakened and arrives at court, Clotaldo tells him that he is the prince of Poland and heir to the throne. He resents Clotaldo for keeping this secret from him for all those years. He finds Duke Astolfo irritating and is dazzled by Estrella's beauty. When a servant warns him about the princess's betrothal to Astolfo, Segismundo is enraged by the news and throws the servant from the balcony.\nThe king demands an explanation from his son. He tries to reason with him, but Segismundo announces he will fight everyone, for his rights were denied him for a long time. Basilio warns him that he must behave, or he might find out he's dreaming. Segismundo interrupts a conversation between Rosaura and Clarin. Rosaura wants to leave, but Segismundo tries to seduce her. Clotaldo steps up to defend his child, but Segismundo pulls out a dagger threatening to kill him. As Clotaldo begs for his life, Astolfo challenges Segismundo to a duel. Before they proceed, the king sedates the prince again and sends him back to his cell.\nAfter recriminating Astolfo for wearing another woman's portrait around his neck, Estrella commands Rosaura (still going by Astrea) to fetch this locket for her. When she approaches Astolfo for the locket, he says he recognized her as Rosaura and refuses to give her the locket, because the portrait inside is hers. Estrella walks in and demands to see it immediately, but, afraid of being discovered, Rosaura says the locket in Astolfo's hand is actually her own, and that he has hidden the one she was sent to fetch. Estrella leaves furious. Meanwhile, Clotaldo sends Clarin to prison, believing that Clarin knows his secret.\nSegismundo mutters in his sleep about murder and revenge. When the prince wakes up, he tells Clotaldo about his \"dream\". Clotaldo tells him that even in dreams, people must act with kindness and justice. When he leaves, Segismundo is left reflecting on dreams and life.\n\nThe people find out that they have a prince and many rebel, breaking him out of his prison tower, although at first they comically mistake Clarin for the prince. Segismundo finds Clotaldo, who is afraid of his reaction. Segismundo forgives him, asking to join his cause, but Clotaldo refuses, swearing allegiance to the king. Back in the palace, everyone prepares for battle, and Clotaldo speaks with Rosaura. She asks him to take Astolfo's life, as he had taken her honor before leaving her. Clotaldo refuses, reminding her that Duke Astolfo is now the heir to the throne. When Rosaura asks what will be of her honor, Clotaldo suggests that she spend her days in a nunnery. Disheartened, Rosaura runs away.\nAs war nears, Segismundo sees Rosaura, who tells him that she was the youth who found him in his prison and also the woman who he tried to seduce in court. She tells him that she was born in Muscovy of a noble woman who was disgraced and abandoned. She had the same fate, falling in love with Astolfo and giving him her honor before he abandoned her to marry Estrella. She followed him to Poland for revenge, finding that Clotaldo is her father, but he is unwilling to fight for her honor. Rosaura compares herself to female warriors Athena and Diana. She wants to join Segismundo's battle and to kill Astolfo or to die fighting. Segismundo agrees. While soldiers cheer for Segismundo, Rosaura and Clarin are reunited, and the king's soldiers approach.\nSegismundo's army is winning the battle. Basilio, Clotaldo, and Astolfo are preparing to escape when Clarin is killed in front of them. Segismundo arrives and Basilio faces his son, waiting for his death, but Segismundo spares his life. In light of the Prince's generous attitude, the King proclaims Segismundo heir to his throne. As King, Segismundo decides that Astolfo must keep his promise to marry Rosaura to preserve her honor. At first Astolfo is hesitant because she is not of noble birth, but when Clotaldo reveals that she is his daughter, Astolfo consents. Segismundo then claims Estrella in marriage himself. Segismundo resolves to live by the motto that \"God is God\", acknowledging that, whether asleep or awake, one must strive for goodness.\n\n", "full_text": "LIFE IS A DREAM\n\nBy Pedro Calderon De La Barca\n\n\n\nTranslated by Edward Fitzgerald\n\n\n\n\nINTRODUCTORY NOTE\n\nPedro Calderon de la Barca was born in Madrid, January 17, 1600, of\ngood family. He was educated at the Jesuit College in Madrid and at the\nUniversity of Salamanca; and a doubtful tradition says that he began\nto write plays at the age of thirteen. His literary activity was\ninterrupted for ten years, 1625-1635, by military service in Italy and\nthe Low Countries, and again for a year or more in Catalonia. In 1637\nhe became a Knight of the Order of Santiago, and in 1651 he entered the\npriesthood, rising to the dignity of Superior of the Brotherhood of San\nPedro in Madrid. He held various offices in the court of Philip IV, who\nrewarded his services with pensions, and had his plays produced with\ngreat splendor. He died May 5, 1681.\n\nAt the time when Calderon began to compose for the stage, the Spanish\ndrama was at its height. Lope de Vega, the most prolific and, with\nCalderon, the greatest, of Spanish dramatists, was still alive; and by\nhis applause gave encouragement to the beginner whose fame was to rival\nhis own. The national type of drama which Lope had established was\nmaintained in its essential characteristics by Calderon, and he produced\nabundant specimens of all its varieties. Of regular plays he has left\na hundred and twenty; of \"Autos Sacramentales,\" the peculiar Spanish\nallegorical development of the medieval mystery, we have seventy-three;\nbesides a considerable number of farces.\n\nThe dominant motives in Calderon's dramas are characteristically\nnational: fervid loyalty to Church and King, and a sense of honor\nheightened almost to the point of the fantastic. Though his plays\nare laid in a great variety of scenes and ages, the sentiment and the\ncharacters remain essentially Spanish; and this intensely local quality\nhas probably lessened the vogue of Calderon in other countries. In the\nconstruction and conduct of his plots he showed great skill, yet the\ningenuity expended in the management of the story did not restrain the\nfiery emotion and opulent imagination which mark his finest speeches\nand give them a lyric quality which some critics regard as his greatest\ndistinction.\n\nOf all Calderon's works, \"Life is a Dream\" may be regarded as the most\nuniversal in its theme. It seeks to teach a lesson that may be learned\nfrom the philosophers and religious thinkers of many ages--that the\nworld of our senses is a mere shadow, and that the only reality is to be\nfound in the invisible and eternal. The story which forms its basis\nis Oriental in origin, and in the form of the legend of \"Barlaam and\nJosaphat\" was familiar in all the literatures of the Middle Ages.\nCombined with this in the plot is the tale of Abou Hassan from the\n\"Arabian Nights,\" the main situations in which are turned to farcical\npurposes in the Induction to the Shakespearean \"Taming of the Shrew.\"\nBut with Calderon the theme is lifted altogether out of the atmosphere\nof comedy, and is worked up with poetic sentiment and a touch of\nmysticism into a symbolic drama of profound and universal philosophical\nsignificance.\n\n\n\n\n\nLIFE IS A DREAM\n\n\n\nDRAMATIS PERSONAE\n\n     Basilio           King of Poland.\n     Segismund         his Son.\n     Astolfo           his Nephew.\n     Estrella          his Niece.\n     Clotaldo          a General in Basilio's Service.\n     Rosaura           a Muscovite Lady.\n     Fife              her Attendant.\n\n     Chamberlain, Lords in Waiting, Officers,\n     Soldiers, etc., in Basilio's Service.\n\n\nThe Scene of the first and third Acts lies on the Polish frontier: of\nthe second Act, in Warsaw.\n\nAs this version of Calderon's drama is not for acting, a higher and\nwider mountain-scene than practicable may be imagined for Rosaura's\ndescent in the first Act and the soldiers' ascent in the last. The bad\nwatch kept by the sentinels who guarded their state-prisoner, together\nwith much else (not all!) that defies sober sense in this wild drama, I\nmust leave Calderon to answer for; whose audience were not critical of\ndetail and probability, so long as a good story, with strong, rapid, and\npicturesque action and situation, was set before them.\n\n\n\n\nACT I\n\n\n\n\nSCENE I--A pass of rocks, over which a storm is rolling away,\n\nand the sun setting: in the foreground, half-way down, a fortress.\n\n\n(Enter first from the topmost rock Rosaura, as from horseback, in man's\nattire; and, after her, Fife.)\n\n     ROSAURA.\n     There, four-footed Fury, blast\n     Engender'd brute, without the wit\n     Of brute, or mouth to match the bit\n     Of man--art satisfied at last?\n     Who, when thunder roll'd aloof,\n     Tow'rd the spheres of fire your ears\n     Pricking, and the granite kicking\n     Into lightning with your hoof,\n     Among the tempest-shatter'd crags\n     Shattering your luckless rider\n     Back into the tempest pass'd?\n     There then lie to starve and die,\n     Or find another Phaeton\n     Mad-mettled as yourself; for I,\n     Wearied, worried, and for-done,\n     Alone will down the mountain try,\n     That knits his brows against the sun.\n\n     FIFE (as to his mule).\n     There, thou mis-begotten thing,\n     Long-ear'd lightning, tail'd tornado,\n     Griffin-hoof-in hurricano,\n     (I might swear till I were almost\n     Hoarse with roaring Asonante)\n     Who forsooth because our betters\n     Would begin to kick and fling\n     You forthwith your noble mind\n     Must prove, and kick me off behind,\n     Tow'rd the very centre whither\n     Gravity was most inclined.\n     There where you have made your bed\n     In it lie; for, wet or dry,\n     Let what will for me betide you,\n     Burning, blowing, freezing, hailing;\n     Famine waste you: devil ride you:\n     Tempest baste you black and blue:\n     (To Rosaura.)\n     There! I think in downright railing\n     I can hold my own with you.\n\n     ROS.\n     Ah, my good Fife, whose merry loyal pipe,\n     Come weal, come woe, is never out of tune\n     What, you in the same plight too?\n\n     FIFE.\n     Ay; And madam--sir--hereby desire,\n     When you your own adventures sing\n     Another time in lofty rhyme,\n     You don't forget the trusty squire\n     Who went with you Don-quixoting.\n\n     ROS.\n     Well, my good fellow--to leave Pegasus\n     Who scarce can serve us than our horses worse--\n     They say no one should rob another of\n     The single satisfaction he has left\n     Of singing his own sorrows; one so great,\n     So says some great philosopher, that trouble\n     Were worth encount'ring only for the sake\n     Of weeping over--what perhaps you know\n     Some poet calls the 'luxury of woe.'\n\n     FIFE.\n     Had I the poet or philosopher\n     In the place of her that kick'd me off to ride,\n     I'd test his theory upon his hide.\n     But no bones broken, madam--sir, I mean?--\n\n     ROS.\n     A scratch here that a handkerchief will heal--\n     And you?--\n\n     FIFE.\n     A scratch in _quiddity_, or kind:\n     But not in '_quo_'--my wounds are all behind.\n     But, as you say, to stop this strain,\n     Which, somehow, once one's in the vein,\n     Comes clattering after--there again!--\n     What are we twain--deuce take't!--we two,\n     I mean, to do--drench'd through and through--\n     Oh, I shall choke of rhymes, which I believe\n     Are all that we shall have to live on here.\n\n     ROS.\n     What, is our victual gone too?--\n\n     FIFE.\n     Ay, that brute\n     Has carried all we had away with her,\n     Clothing, and cate, and all.\n\n     ROS.\n     And now the sun,\n     Our only friend and guide, about to sink\n     Under the stage of earth.\n\n     FIFE.\n     And enter Night,\n     With Capa y Espada--and--pray heaven!\n     With but her lanthorn also.\n\n     ROS.\n     Ah, I doubt\n     To-night, if any, with a dark one--or\n     Almost burnt out after a month's consumption.\n     Well! well or ill, on horseback or afoot,\n     This is the gate that lets me into Poland;\n     And, sorry welcome as she gives a guest\n     Who writes his own arrival on her rocks\n     In his own blood--\n     Yet better on her stony threshold die,\n     Than live on unrevenged in Muscovy.\n\n     FIFE.\n     Oh, what a soul some women have--I mean\n     Some men--\n\n     ROS.\n     Oh, Fife, Fife, as you love me, Fife,\n     Make yourself perfect in that little part,\n     Or all will go to ruin!\n\n     FIFE.\n     Oh, I will,\n     Please God we find some one to try it on.\n     But, truly, would not any one believe\n     Some fairy had exchanged us as we lay\n     Two tiny foster-children in one cradle?\n\n     ROS.\n     Well, be that as it may, Fife, it reminds me\n     Of what perhaps I should have thought before,\n     But better late than never--You know I love you,\n     As you, I know, love me, and loyally\n     Have follow'd me thus far in my wild venture.\n     Well! now then--having seen me safe thus far\n     Safe if not wholly sound--over the rocks\n     Into the country where my business lies\n     Why should not you return the way we came,\n     The storm all clear'd away, and, leaving me\n     (Who now shall want you, though not thank you, less,\n     Now that our horses gone) this side the ridge,\n     Find your way back to dear old home again;\n     While I--Come, come!--\n     What, weeping my poor fellow?\n\n     FIFE.\n     Leave you here\n     Alone--my Lady--Lord! I mean my Lord--\n     In a strange country--among savages--\n     Oh, now I know--you would be rid of me\n     For fear my stumbling speech--\n\n     ROS.\n     Oh, no, no, no!--\n     I want you with me for a thousand sakes\n     To which that is as nothing--I myself\n     More apt to let the secret out myself\n     Without your help at all--Come, come, cheer up!\n     And if you sing again, 'Come weal, come woe,'\n     Let it be that; for we will never part\n     Until you give the signal.\n\n     FIFE.\n     'Tis a bargain.\n\n     ROS.\n     Now to begin, then. 'Follow, follow me,\n     'You fairy elves that be.'\n\n     FIFE.\n     Ay, and go on--\n     Something of 'following darkness like a dream,'\n     For that we're after.\n\n     ROS.\n     No, after the sun;\n     Trying to catch hold of his glittering skirts\n     That hang upon the mountain as he goes.\n\n     FIFE.\n     Ah, he's himself past catching--as you spoke\n     He heard what you were saying, and--just so--\n     Like some scared water-bird,\n     As we say in my country, _dove_ below.\n\n     ROS.\n     Well, we must follow him as best we may.\n     Poland is no great country, and, as rich\n     In men and means, will but few acres spare\n     To lie beneath her barrier mountains bare.\n     We cannot, I believe, be very far\n     From mankind or their dwellings.\n\n     FIFE.\n     Send it so!\n     And well provided for man, woman, and beast.\n     No, not for beast. Ah, but my heart begins\n     To yearn for her--\n\n     ROS.\n     Keep close, and keep your feet\n     From serving you as hers did.\n\n     FIFE.\n     As for beasts,\n     If in default of other entertainment,\n     We should provide them with ourselves to eat--\n     Bears, lions, wolves--\n\n     ROS.\n     Oh, never fear.\n\n     FIFE.\n     Or else,\n     Default of other beasts, beastlier men,\n     Cannibals, Anthropophagi, bare Poles\n     Who never knew a tailor but by taste.\n\n     ROS.\n     Look, look! Unless my fancy misconceive\n     With twilight--down among the rocks there, Fife--\n     Some human dwelling, surely--\n     Or think you but a rock torn from the rocks\n     In some convulsion like to-day's, and perch'd\n     Quaintly among them in mock-masonry?\n\n     FIFE.\n     Most likely that, I doubt.\n\n     ROS.\n     No, no--for look!\n     A square of darkness opening in it--\n\n     FIFE.\n     Oh, I don't half like such openings!--\n\n     ROS.\n     Like the loom\n     Of night from which she spins her outer gloom--\n\n     FIFE.\n     Lord, Madam, pray forbear this tragic vein\n     In such a time and place--\n\n     ROS.\n     And now again\n     Within that square of darkness, look! a light\n     That feels its way with hesitating pulse,\n     As we do, through the darkness that it drives\n     To blacken into deeper night beyond.\n\n     FIFE.\n     In which could we follow that light's example,\n     As might some English Bardolph with his nose,\n     We might defy the sunset--Hark, a chain!\n\n     ROS.\n     And now a lamp, a lamp! And now the hand\n     That carries it.\n\n     FIFE.\n     Oh, Lord! that dreadful chain!\n\n     ROS.\n     And now the bearer of the lamp; indeed\n     As strange as any in Arabian tale,\n     So giant-like, and terrible, and grand,\n     Spite of the skin he's wrapt in.\n\n     FIFE.\n     Why, 'tis his own:\n     Oh, 'tis some wild man of the woods; I've heard\n     They build and carry torches--\n\n     ROS.\n     Never Ape\n     Bore such a brow before the heavens as that--\n     Chain'd as you say too!--\n\n     FIFE.\n     Oh, that dreadful chain!\n\n     ROS.\n     And now he sets the lamp down by his side,\n     And with one hand clench'd in his tangled hair\n     And with a sigh as if his heart would break--\n\n     (During this Segismund has entered from the fortress, with a\n          torch.)\n\n     SEGISMUND.\n     Once more the storm has roar'd itself away,\n     Splitting the crags of God as it retires;\n     But sparing still what it should only blast,\n     This guilty piece of human handiwork,\n     And all that are within it. Oh, how oft,\n     How oft, within or here abroad, have I\n     Waited, and in the whisper of my heart\n     Pray'd for the slanting hand of heaven to strike\n     The blow myself I dared not, out of fear\n     Of that Hereafter, worse, they say, than here,\n     Plunged headlong in, but, till dismissal waited,\n     To wipe at last all sorrow from men's eyes,\n     And make this heavy dispensation clear.\n     Thus have I borne till now, and still endure,\n     Crouching in sullen impotence day by day,\n     Till some such out-burst of the elements\n     Like this rouses the sleeping fire within;\n     And standing thus upon the threshold of\n     Another night about to close the door\n     Upon one wretched day to open it\n     On one yet wretcheder because one more;--\n     Once more, you savage heavens, I ask of you--\n     I, looking up to those relentless eyes\n     That, now the greater lamp is gone below,\n     Begin to muster in the listening skies;\n     In all the shining circuits you have gone\n     About this theatre of human woe,\n     What greater sorrow have you gazed upon\n     Than down this narrow chink you witness still;\n     And which, did you yourselves not fore-devise,\n     You registered for others to fulfil!\n\n     FIFE.\n     This is some Laureate at a birthday ode;\n     No wonder we went rhyming.\n\n     ROS.\n     Hush! And now\n     See, starting to his feet, he strides about\n     Far as his tether'd steps--\n\n     SEG.\n     And if the chain\n     You help'd to rivet round me did contract\n     Since guiltless infancy from guilt in act;\n     Of what in aspiration or in thought\n     Guilty, but in resentment of the wrong\n     That wreaks revenge on wrong I never wrought\n     By excommunication from the free\n     Inheritance that all created life,\n     Beside myself, is born to--from the wings\n     That range your own immeasurable blue,\n     Down to the poor, mute, scale-imprison'd things,\n     That yet are free to wander, glide, and pass\n     About that under-sapphire, whereinto\n     Yourselves transfusing you yourselves englass!\n\n     ROS.\n     What mystery is this?\n\n     FIFE.\n     Why, the man's mad:\n     That's all the mystery. That's why he's chain'd--\n     And why--\n\n     SEG.\n     Nor Nature's guiltless life alone--\n     But that which lives on blood and rapine; nay,\n     Charter'd with larger liberty to slay\n     Their guiltless kind, the tyrants of the air\n     Soar zenith-upward with their screaming prey,\n     Making pure heaven drop blood upon the stage\n     Of under earth, where lion, wolf, and bear,\n     And they that on their treacherous velvet wear\n     Figure and constellation like your own,\n     With their still living slaughter bound away\n     Over the barriers of the mountain cage,\n     Against which one, blood-guiltless, and endued\n     With aspiration and with aptitude\n     Transcending other creatures, day by day\n     Beats himself mad with unavailing rage!\n\n     FIFE.\n     Why, that must be the meaning of my mule's\n     Rebellion--\n\n     ROS.\n     Hush!\n\n     SEG.\n     But then if murder be\n     The law by which not only conscience-blind\n     Creatures, but man too prospers with his kind;\n     Who leaving all his guilty fellows free,\n     Under your fatal auspice and divine\n     Compulsion, leagued in some mysterious ban\n     Against one innocent and helpless man,\n     Abuse their liberty to murder mine:\n     And sworn to silence, like their masters mute\n     In heaven, and like them twirling through the mask\n     Of darkness, answering to all I ask,\n     Point up to them whose work they execute!\n\n     ROS.\n     Ev'n as I thought, some poor unhappy wretch,\n     By man wrong'd, wretched, unrevenged, as I!\n     Nay, so much worse than I, as by those chains\n     Clipt of the means of self-revenge on those\n     Who lay on him what they deserve. And I,\n     Who taunted Heaven a little while ago\n     With pouring all its wrath upon my head--\n     Alas! like him who caught the cast-off husk\n     Of what another bragg'd of feeding on,\n     Here's one that from the refuse of my sorrows\n     Could gather all the banquet he desires!\n     Poor soul, poor soul!\n\n     FIFE.\n     Speak lower--he will hear you.\n\n     ROS.\n     And if he should, what then? Why, if he would,\n     He could not harm me--Nay, and if he could,\n     Methinks I'd venture something of a life\n     I care so little for--\n\n     SEG.\n     Who's that? Clotaldo? Who are you, I say,\n     That, venturing in these forbidden rocks,\n     Have lighted on my miserable life,\n     And your own death?\n\n     ROS.\n     You would not hurt me, surely?\n\n     SEG.\n     Not I; but those that, iron as the chain\n     In which they slay me with a lingering death,\n     Will slay you with a sudden--Who are you?\n\n     ROS.\n     A stranger from across the mountain there,\n     Who, having lost his way in this strange land\n     And coming night, drew hither to what seem'd\n     A human dwelling hidden in these rocks,\n     And where the voice of human sorrow soon\n     Told him it was so.\n\n     SEG.\n     Ay? But nearer--nearer--\n     That by this smoky supplement of day\n     But for a moment I may see who speaks\n     So pitifully sweet.\n\n     FIFE.\n     Take care! take care!\n\n     ROS.\n     Alas, poor man, that I, myself so helpless,\n     Could better help you than by barren pity,\n     And my poor presence--\n\n     SEG.\n     Oh, might that be all!\n     But that--a few poor moments--and, alas!\n     The very bliss of having, and the dread\n     Of losing, under such a penalty\n     As every moment's having runs more near,\n     Stifles the very utterance and resource\n     They cry for quickest; till from sheer despair\n     Of holding thee, methinks myself would tear\n     To pieces--\n\n     FIFE.\n     There, his word's enough for it.\n\n     SEG.\n     Oh, think, if you who move about at will,\n     And live in sweet communion with your kind,\n     After an hour lost in these lonely rocks\n     Hunger and thirst after some human voice\n     To drink, and human face to feed upon;\n     What must one do where all is mute, or harsh,\n     And ev'n the naked face of cruelty\n     Were better than the mask it works beneath?--\n     Across the mountain then! Across the mountain!\n     What if the next world which they tell one of\n     Be only next across the mountain then,\n     Though I must never see it till I die,\n     And you one of its angels?\n\n     ROS.\n     Alas; alas!\n     No angel! And the face you think so fair,\n     'Tis but the dismal frame-work of these rocks\n     That makes it seem so; and the world I come from--\n     Alas, alas, too many faces there\n     Are but fair vizors to black hearts below,\n     Or only serve to bring the wearer woe!\n     But to yourself--If haply the redress\n     That I am here upon may help to yours.\n     I heard you tax the heavens with ordering,\n     And men for executing, what, alas!\n     I now behold. But why, and who they are\n     Who do, and you who suffer--\n\n     SEG. (pointing upwards).\n     Ask of them,\n     Whom, as to-night, I have so often ask'd,\n     And ask'd in vain.\n\n     ROS.\n     But surely, surely--\n\n     SEG.\n     Hark!\n     The trumpet of the watch to shut us in.\n     Oh, should they find you!--Quick! Behind the rocks!\n     To-morrow--if to-morrow--\n\n     ROS. (flinging her sword toward him).\n     Take my sword!\n\n     (Rosaura and Fife hide in the rocks; Enter Clotaldo)\n\n     CLOTALDO.\n     These stormy days you like to see the last of\n     Are but ill opiates, Segismund, I think,\n     For night to follow: and to-night you seem\n     More than your wont disorder'd. What! A sword?\n     Within there!\n\n     (Enter Soldiers with black vizors and torches)\n\n     FIFE.\n     Here's a pleasant masquerade!\n\n     CLO.\n     Whosever watch this was\n     Will have to pay head-reckoning. Meanwhile,\n     This weapon had a wearer. Bring him here,\n     Alive or dead.\n\n     SEG.\n     Clotaldo! good Clotaldo!--\n\n     CLO. (to Soldiers who enclose Segismund; others\n           searching the rocks).\n     You know your duty.\n\n     SOLDIERS (bringing in Rosaura and Fife).\n     Here are two of them,\n     Whoever more to follow--\n\n     CLO.\n     Who are you,\n     That in defiance of known proclamation\n     Are found, at night-fall too, about this place?\n\n     FIFE.\n     Oh, my Lord, she--I mean he--\n\n     ROS.\n     Silence, Fife,\n     And let me speak for both.--Two foreign men,\n     To whom your country and its proclamations\n     Are equally unknown; and had we known,\n     Ourselves not masters of our lawless beasts\n     That, terrified by the storm among your rocks,\n     Flung us upon them to our cost.\n\n     FIFE.\n     My mule--\n\n     CLO.\n     Foreigners? Of what country?\n\n     ROS.\n     Muscovy.\n\n     CLO.\n     And whither bound?\n\n     ROS.\n     Hither--if this be Poland;\n     But with no ill design on her, and therefore\n     Taking it ill that we should thus be stopt\n     Upon her threshold so uncivilly.\n\n     CLO.\n     Whither in Poland?\n\n     ROS.\n     To the capital.\n\n     CLO.\n     And on what errand?\n\n     ROS.\n     Set me on the road,\n     And you shall be the nearer to my answer.\n\n     CLO. (aside).\n     So resolute and ready to reply,\n     And yet so young--and--\n     (Aloud.)\n     Well,--\n     Your business was not surely with the man\n     We found you with?\n\n     ROS.\n     He was the first we saw,--\n     And strangers and benighted, as we were,\n     As you too would have done in a like case,\n     Accosted him at once.\n\n     CLO.\n     Ay, but this sword?\n\n     ROS.\n     I flung it toward him.\n\n     CLO.\n     Well, and why?\n\n     ROS.\n     And why? But to revenge himself on those who thus\n     Injuriously misuse him.\n\n     CLO.\n     So--so--so!\n     'Tis well such resolution wants a beard\n     And, I suppose, is never to attain one.\n     Well, I must take you both, you and your sword,\n     Prisoners.\n\n     FIFE. (offering a cudgel).\n     Pray take mine, and welcome, sir;\n     I'm sure I gave it to that mule of mine\n     To mighty little purpose.\n\n     ROS.\n     Mine you have;\n     And may it win us some more kindliness\n     Than we have met with yet.\n\n     CLO (examining the sword).\n     More mystery!\n     How came you by this weapon?\n\n     ROS.\n     From my father.\n\n     CLO.\n     And do you know whence he?\n\n     ROS.\n     Oh, very well:\n     From one of this same Polish realm of yours,\n     Who promised a return, should come the chance,\n     Of courtesies that he received himself\n     In Muscovy, and left this pledge of it--\n     Not likely yet, it seems, to be redeem'd.\n\n     CLO (aside).\n     Oh, wondrous chance--or wondrous Providence!\n     The sword that I myself in Muscovy,\n     When these white hairs were black, for keepsake left\n     Of obligation for a like return\n     To him who saved me wounded as I lay\n     Fighting against his country; took me home;\n     Tended me like a brother till recover'd,\n     Perchance to fight against him once again\n     And now my sword put back into my hand\n     By his--if not his son--still, as so seeming,\n     By me, as first devoir of gratitude,\n     To seem believing, till the wearer's self\n     See fit to drop the ill-dissembling mask.\n     (Aloud.)\n     Well, a strange turn of fortune has arrested\n     The sharp and sudden penalty that else\n     Had visited your rashness or mischance:\n     In part, your tender youth too--pardon me,\n     And touch not where your sword is not to answer--\n     Commends you to my care; not your life only,\n     Else by this misadventure forfeited;\n     But ev'n your errand, which, by happy chance,\n     Chimes with the very business I am on,\n     And calls me to the very point you aim at.\n\n     ROS.\n     The capital?\n\n     CLO.\n     Ay, the capital; and ev'n\n     That capital of capitals, the Court:\n     Where you may plead, and, I may promise, win\n     Pardon for this, you say unwilling, trespass,\n     And prosecute what else you have at heart,\n     With me to help you forward all I can;\n     Provided all in loyalty to those\n     To whom by natural allegiance\n     I first am bound to.\n\n     ROS.\n     As you make, I take\n     Your offer: with like promise on my side\n     Of loyalty to you and those you serve,\n     Under like reservation for regards\n     Nearer and dearer still.\n\n     CLO.\n     Enough, enough;\n     Your hand; a bargain on both sides. Meanwhile,\n     Here shall you rest to-night. The break of day\n     Shall see us both together on the way.\n\n     ROS.\n     Thus then what I for misadventure blamed,\n     Directly draws me where my wishes aim'd.\n\n     (Exeunt.)\n\n\n\n\nSCENE II.--The Palace at Warsaw\n\n\nEnter on one side Astolfo, Duke of Muscovy, with his train: and, on the\nother, the Princess Estrella, with hers.\n\n     ASTOLFO.\n     My royal cousin, if so near in blood,\n     Till this auspicious meeting scarcely known,\n     Till all that beauty promised in the bud\n     Is now to its consummate blossom blown,\n     Well met at last; and may--\n\n     ESTRELLA.\n     Enough, my Lord,\n     Of compliment devised for you by some\n     Court tailor, and, believe me, still too short\n     To cover the designful heart below.\n\n     AST.\n     Nay, but indeed, fair cousin--\n\n     EST.\n     Ay, let Deed\n     Measure your words, indeed your flowers of speech\n     Ill with your iron equipage atone;\n     Irony indeed, and wordy compliment.\n\n     AST.\n     Indeed, indeed, you wrong me, royal cousin,\n     And fair as royal, misinterpreting\n     What, even for the end you think I aim at,\n     If false to you, were fatal to myself.\n\n     EST.\n     Why, what else means the glittering steel, my Lord,\n     That bristles in the rear of these fine words?\n     What can it mean, but, failing to cajole,\n     To fight or force me from my just pretension?\n\n     AST.\n     Nay, might I not ask ev'n the same of you,\n     The nodding helmets of whose men-at-arms\n     Out-crest the plumage of your lady court?\n\n     EST.\n     But to defend what yours would force from me.\n\n     AST.\n     Might not I, lady, say the same of mine?\n     But not to come to battle, ev'n of words,\n     With a fair lady, and my kinswoman;\n     And as averse to stand before your face,\n     Defenceless, and condemn'd in your disgrace,\n     Till the good king be here to clear it all--\n     Will you vouchsafe to hear me?\n\n     EST.\n     As you will.\n\n     AST.\n     You know that, when about to leave this world,\n     Our royal grandsire, King Alfonso, left\n     Three children; one a son, Basilio,\n     Who wears--long may he wear! the crown of Poland;\n     And daughters twain: of whom the elder was\n     Your mother, Clorilena, now some while\n     Exalted to a more than mortal throne;\n     And Recisunda, mine, the younger sister,\n     Who, married to the Prince of Muscovy,\n     Gave me the light which may she live to see\n     Herself for many, many years to come.\n     Meanwhile, good King Basilio, as you know,\n     Deep in abstruser studies than this world,\n     And busier with the stars than lady's eyes,\n     Has never by a second marriage yet\n     Replaced, as Poland ask'd of him, the heir\n     An early marriage brought and took away;\n     His young queen dying with the son she bore him;\n     And in such alienation grown so old\n     As leaves no other hope of heir to Poland\n     Than his two sisters' children; you, fair cousin,\n     And me; for whom the Commons of the realm\n     Divide themselves into two several factions;\n     Whether for you, the elder sister's child;\n     Or me, born of the younger, but, they say,\n     My natural prerogative of man\n     Outweighing your priority of birth.\n     Which discord growing loud and dangerous,\n     Our uncle, King Basilio, doubly sage\n     In prophesying and providing for\n     The future, as to deal with it when come,\n     Bids us here meet to-day in solemn council\n     Our several pretensions to compose.\n     And, but the martial out-burst that proclaims\n     His coming, makes all further parley vain,\n     Unless my bosom, by which only wise\n     I prophesy, now wrongly prophesies,\n     By such a happy compact as I dare\n     But glance at till the Royal Sage declare.\n\n     (Trumpets, etc. Enter King Basilio with his Council.)\n\n     ALL.\n     The King! God save the King!\n\n     ESTRELLA (Kneeling.)\n     Oh, Royal Sir!--\n\n     ASTOLFO (Kneeling.)\n     God save your Majesty--\n\n     KING.\n     Rise both of you,\n     Rise to my arms, Astolfo and Estrella;\n     As my two sisters' children always mine,\n     Now more than ever, since myself and Poland\n     Solely to you for our succession look'd.\n     And now give ear, you and your several factions,\n     And you, the Peers and Princes of this realm,\n     While I reveal the purport of this meeting\n     In words whose necessary length I trust\n     No unsuccessful issue shall excuse.\n     You and the world who have surnamed me \"Sage\"\n     Know that I owe that title, if my due,\n     To my long meditation on the book\n     Which ever lying open overhead--\n     The book of heaven, I mean--so few have read;\n     Whose golden letters on whose sapphire leaf,\n     Distinguishing the page of day and night,\n     And all the revolution of the year;\n     So with the turning volume where they lie\n     Still changing their prophetic syllables,\n     They register the destinies of men:\n     Until with eyes that, dim with years indeed,\n     Are quicker to pursue the stars than rule them,\n     I get the start of Time, and from his hand\n     The wand of tardy revelation draw.\n     Oh, had the self-same heaven upon his page\n     Inscribed my death ere I should read my life\n     And, by fore-casting of my own mischance,\n     Play not the victim but the suicide\n     In my own tragedy!--But you shall hear.\n     You know how once, as kings must for their people,\n     And only once, as wise men for themselves,\n     I woo'd and wedded: know too that my Queen\n     In childing died; but not, as you believe,\n     With her, the son she died in giving life to.\n     For, as the hour of birth was on the stroke,\n     Her brain conceiving with her womb, she dream'd\n     A serpent tore her entrail. And too surely\n     (For evil omen seldom speaks in vain)\n     The man-child breaking from that living tomb\n     That makes our birth the antitype of death,\n     Man-grateful, for the life she gave him paid\n     By killing her: and with such circumstance\n     As suited such unnatural tragedy;\n     He coming into light, if light it were\n     That darken'd at his very horoscope,\n     When heaven's two champions--sun and moon I mean--\n     Suffused in blood upon each other fell\n     In such a raging duel of eclipse\n     As hath not terrified the universe\n     Since that which wept in blood the death of Christ:\n     When the dead walk'd, the waters turn'd to blood,\n     Earth and her cities totter'd, and the world\n     Seem'd shaken to its last paralysis.\n     In such a paroxysm of dissolution\n     That son of mine was born; by that first act\n     Heading the monstrous catalogue of crime,\n     I found fore-written in his horoscope;\n     As great a monster in man's history\n     As was in nature his nativity;\n     So savage, bloody, terrible, and impious,\n     Who, should he live, would tear his country's entrails,\n     As by his birth his mother's; with which crime\n     Beginning, he should clench the dreadful tale\n     By trampling on his father's silver head.\n     All which fore-reading, and his act of birth\n     Fate's warrant that I read his life aright;\n     To save his country from his mother's fate,\n     I gave abroad that he had died with her\n     His being slew; with midnight secrecy\n     I had him carried to a lonely tower\n     Hewn from the mountain-barriers of the realm,\n     And under strict anathema of death\n     Guarded from men's inquisitive approach,\n     Save from the trusty few one needs must trust;\n     Who while his fasten'd body they provide\n     With salutary garb and nourishment,\n     Instruct his soul in what no soul may miss\n     Of holy faith, and in such other lore\n     As may solace his life-imprisonment,\n     And tame perhaps the Savage prophesied\n     Toward such a trial as I aim at now,\n     And now demand your special hearing to.\n     What in this fearful business I have done,\n     Judge whether lightly or maliciously,--\n     I, with my own and only flesh and blood,\n     And proper lineal inheritor!\n     I swear, had his foretold atrocities\n     Touch'd me alone. I had not saved myself\n     At such a cost to him; but as a king,--\n     A Christian king,--I say, advisedly,\n     Who would devote his people to a tyrant\n     Worse than Caligula fore-chronicled?\n     But even this not without grave mis-giving,\n     Lest by some chance mis-reading of the stars,\n     Or mis-direction of what rightly read,\n     I wrong my son of his prerogative,\n     And Poland of her rightful sovereign.\n     For, sure and certain prophets as the stars,\n     Although they err not, he who reads them may;\n     Or rightly reading--seeing there is One\n     Who governs them, as, under Him, they us,\n     We are not sure if the rough diagram\n     They draw in heaven and we interpret here,\n     Be sure of operation, if the Will\n     Supreme, that sometimes for some special end\n     The course of providential nature breaks\n     By miracle, may not of these same stars\n     Cancel his own first draft, or overrule\n     What else fore-written all else overrules.\n     As, for example, should the Will Almighty\n     Permit the Free-will of particular man\n     To break the meshes of else strangling fate--\n     Which Free-will, fearful of foretold abuse,\n     I have myself from my own son fore-closed\n     From ever possible self-extrication;\n     A terrible responsibility,\n     Not to the conscience to be reconciled\n     Unless opposing almost certain evil\n     Against so slight contingency of good.\n     Well--thus perplex'd, I have resolved at last\n     To bring the thing to trial: whereunto\n     Here have I summon'd you, my Peers, and you\n     Whom I more dearly look to, failing him,\n     As witnesses to that which I propose;\n     And thus propose the doing it. Clotaldo,\n     Who guards my son with old fidelity,\n     Shall bring him hither from his tower by night\n     Lockt in a sleep so fast as by my art\n     I rivet to within a link of death,\n     But yet from death so far, that next day's dawn\n     Shall wake him up upon the royal bed,\n     Complete in consciousness and faculty,\n     When with all princely pomp and retinue\n     My loyal Peers with due obeisance\n     Shall hail him Segismund, the Prince of Poland.\n     Then if with any show of human kindness\n     He fling discredit, not upon the stars,\n     But upon me, their misinterpreter,\n     With all apology mistaken age\n     Can make to youth it never meant to harm,\n     To my son's forehead will I shift the crown\n     I long have wish'd upon a younger brow;\n     And in religious humiliation,\n     For what of worn-out age remains to me,\n     Entreat my pardon both of Heaven and him\n     For tempting destinies beyond my reach.\n     But if, as I misdoubt, at his first step\n     The hoof of the predicted savage shows;\n     Before predicted mischief can be done,\n     The self-same sleep that loosed him from the chain\n     Shall re-consign him, not to loose again.\n     Then shall I, having lost that heir direct,\n     Look solely to my sisters' children twain\n     Each of a claim so equal as divides\n     The voice of Poland to their several sides,\n     But, as I trust, to be entwined ere long\n     Into one single wreath so fair and strong\n     As shall at once all difference atone,\n     And cease the realm's division with their own.\n     Cousins and Princes, Peers and Councillors,\n     Such is the purport of this invitation,\n     And such is my design. Whose furtherance\n     If not as Sovereign, if not as Seer,\n     Yet one whom these white locks, if nothing else,\n     to patient acquiescence consecrate,\n     I now demand and even supplicate.\n\n     AST.\n     Such news, and from such lips, may well suspend\n     The tongue to loyal answer most attuned;\n     But if to me as spokesman of my faction\n     Your Highness looks for answer; I reply\n     For one and all--Let Segismund, whom now\n     We first hear tell of as your living heir,\n     Appear, and but in your sufficient eye\n     Approve himself worthy to be your son,\n     Then we will hail him Poland's rightful heir.\n     What says my cousin?\n\n     EST.\n     Ay, with all my heart.\n     But if my youth and sex upbraid me not\n     That I should dare ask of so wise a king--\n\n     KING.\n     Ask, ask, fair cousin! Nothing, I am sure,\n     Not well consider'd; nay, if 'twere, yet nothing\n     But pardonable from such lips as those.\n\n     EST.\n     Then, with your pardon, Sir--if Segismund,\n     My cousin, whom I shall rejoice to hail\n     As Prince of Poland too, as you propose,\n     Be to a trial coming upon which\n     More, as I think, than life itself depends,\n     Why, Sir, with sleep-disorder'd senses brought\n     To this uncertain contest with his stars?\n\n     KING.\n     Well ask'd indeed! As wisely be it answer'd!\n     _Because_ it is uncertain, see you not?\n     For as I think I can discern between\n     The sudden flaws of a sleep-startled man,\n     And of the savage thing we have to dread;\n     If but bewilder'd, dazzled, and uncouth,\n     As might the sanest and the civilest\n     In circumstance so strange--nay, more than that,\n     If moved to any out-break short of blood,\n     All shall be well with him; and how much more,\n     If 'mid the magic turmoil of the change,\n     He shall so calm a resolution show\n     As scarce to reel beneath so great a blow!\n     But if with savage passion uncontroll'd\n     He lay about him like the brute foretold,\n     And must as suddenly be caged again;\n     Then what redoubled anguish and despair,\n     From that brief flash of blissful liberty\n     Remitted--and for ever--to his chain!\n     Which so much less, if on the stage of glory\n     Enter'd and exited through such a door\n     Of sleep as makes a dream of all between.\n\n     EST.\n     Oh kindly answer, Sir, to question that\n     To charitable courtesy less wise\n     Might call for pardon rather! I shall now\n     Gladly, what, uninstructed, loyally\n     I should have waited.\n\n     AST.\n     Your Highness doubts not me,\n     Nor how my heart follows my cousin's lips,\n     Whatever way the doubtful balance fall,\n     Still loyal to your bidding.\n\n     OMNES.\n     So say all.\n\n     KING.\n     I hoped, and did expect, of all no less--\n     And sure no sovereign ever needed more\n     From all who owe him love or loyalty.\n     For what a strait of time I stand upon,\n     When to this issue not alone I bring\n     My son your Prince, but e'en myself your King:\n     And, whichsoever way for him it turn,\n     Of less than little honour to myself.\n     For if this coming trial justify\n     My thus withholding from my son his right,\n     Is not the judge himself justified in\n     The father's shame? And if the judge proved wrong,\n     My son withholding from his right thus long,\n     Shame and remorse to judge and father both:\n     Unless remorse and shame together drown'd\n     In having what I flung for worthless found.\n     But come--already weary with your travel,\n     And ill refresh'd by this strange history,\n     Until the hours that draw the sun from heaven\n     Unite us at the customary board,\n     Each to his several chamber: you to rest;\n     I to contrive with old Clotaldo best\n     The method of a stranger thing than old\n     Time has a yet among his records told.\n\n     Exeunt.\n\n\n\n\nACT II\n\n\n\n\nSCENE I--A Throne-room in the Palace. Music within.\n\n\n     (Enter King and Clotaldo, meeting a Lord in waiting)\n\n     KING.\n     You, for a moment beckon'd from your office,\n     Tell me thus far how goes it. In due time\n     The potion left him?\n\n     LORD.\n     At the very hour\n     To which your Highness temper'd it. Yet not\n     So wholly but some lingering mist still hung\n     About his dawning senses--which to clear,\n     We fill'd and handed him a morning drink\n     With sleep's specific antidote suffused;\n     And while with princely raiment we invested\n     What nature surely modell'd for a Prince--\n     All but the sword--as you directed--\n\n     KING.\n     Ay--\n\n     LORD.\n     If not too loudly, yet emphatically\n     Still with the title of a Prince address'd him.\n\n     KING.\n     How bore he that?\n\n     LORD.\n     With all the rest, my liege,\n     I will not say so like one in a dream\n     As one himself misdoubting that he dream'd.\n\n     KING.\n     So far so well, Clotaldo, either way,\n     And best of all if tow'rd the worse I dread.\n     But yet no violence?\n\n     LORD.\n     At most, impatience;\n     Wearied perhaps with importunities\n     We yet were bound to offer.\n\n     KING.\n     Oh, Clotaldo!\n     Though thus far well, yet would myself had drunk\n     The potion he revives from! such suspense\n     Crowds all the pulses of life's residue\n     Into the present moment; and, I think,\n     Whichever way the trembling scale may turn,\n     Will leave the crown of Poland for some one\n     To wait no longer than the setting sun!\n\n     CLO.\n     Courage, my liege! The curtain is undrawn,\n     And each must play his part out manfully,\n     Leaving the rest to heaven.\n\n     KING.\n     Whose written words\n     If I should misinterpret or transgress!\n     But as you say--\n     (To the Lord, who exit.)\n     You, back to him at once;\n     Clotaldo, you, when he is somewhat used\n     To the new world of which they call him Prince,\n     Where place and face, and all, is strange to him,\n     With your known features and familiar garb\n     Shall then, as chorus to the scene, accost him,\n     And by such earnest of that old and too\n     Familiar world, assure him of the new.\n     Last in the strange procession, I myself\n     Will by one full and last development\n     Complete the plot for that catastrophe\n     That he must put to all; God grant it be\n     The crown of Poland on his brows!--Hark! hark!--\n     Was that his voice within!--Now louder--Oh,\n     Clotaldo, what! so soon begun to roar!--\n     Again! above the music--But betide\n     What may, until the moment, we must hide.\n\n     (Exeunt King and Clotaldo.)\n\n     SEGISMUND (within).\n     Forbear! I stifle with your perfume! Cease\n     Your crazy salutations! peace, I say\n     Begone, or let me go, ere I go mad\n     With all this babble, mummery, and glare,\n     For I am growing dangerous--Air! room! air!--\n     (He rushes in. Music ceases.)\n     Oh but to save the reeling brain from wreck\n     With its bewilder'd senses!\n     (He covers his eyes for a while.)\n     What! E'en now\n     That Babel left behind me, but my eyes\n     Pursued by the same glamour, that--unless\n     Alike bewitch'd too--the confederate sense\n     Vouches for palpable: bright-shining floors\n     That ring hard answer back to the stamp'd heel,\n     And shoot up airy columns marble-cold,\n     That, as they climb, break into golden leaf\n     And capital, till they embrace aloft\n     In clustering flower and fruitage over walls\n     Hung with such purple curtain as the West\n     Fringes with such a gold; or over-laid\n     With sanguine-glowing semblances of men,\n     Each in his all but living action busied,\n     Or from the wall they look from, with fix'd eyes\n     Pursuing me; and one most strange of all\n     That, as I pass'd the crystal on the wall,\n     Look'd from it--left it--and as I return,\n     Returns, and looks me face to face again--\n     Unless some false reflection of my brain,\n     The outward semblance of myself--Myself?\n     How know that tawdry shadow for myself,\n     But that it moves as I move; lifts his hand\n     With mine; each motion echoing so close\n     The immediate suggestion of the will\n     In which myself I recognize--Myself!--\n     What, this fantastic Segismund the same\n     Who last night, as for all his nights before,\n     Lay down to sleep in wolf-skin on the ground\n     In a black turret which the wolf howl'd round,\n     And woke again upon a golden bed,\n     Round which as clouds about a rising sun,\n     In scarce less glittering caparison,\n     Gather'd gay shapes that, underneath a breeze\n     Of music, handed him upon their knees\n     The wine of heaven in a cup of gold,\n     And still in soft melodious under-song\n     Hailing me Prince of Poland!--'Segismund,'\n     They said, 'Our Prince! The Prince of Poland!' and\n     Again, 'Oh, welcome, welcome, to his own,\n     'Our own Prince Segismund--'\n     Oh, but a blast--\n     One blast of the rough mountain air! one look\n     At the grim features--\n     (He goes to the window.)\n     What they disvizor'd also! shatter'd chaos\n     Cast into stately shape and masonry,\n     Between whose channel'd and perspective sides\n     Compact with rooted towers, and flourishing\n     To heaven with gilded pinnacle and spire,\n     Flows the live current ever to and fro\n     With open aspect and free step!--Clotaldo!\n     Clotaldo!--calling as one scarce dares call\n     For him who suddenly might break the spell\n     One fears to walk without him--Why, that I,\n     With unencumber'd step as any there,\n     Go stumbling through my glory--feeling for\n     That iron leading-string--ay, for myself--\n     For that fast-anchor'd self of yesterday,\n     Of yesterday, and all my life before,\n     Ere drifted clean from self-identity\n     Upon the fluctuation of to-day's\n     Mad whirling circumstance!--And, fool, why not?\n     If reason, sense, and self-identity\n     Obliterated from a worn-out brain,\n     Art thou not maddest striving to be sane,\n     And catching at that Self of yesterday\n     That, like a leper's rags, best flung away!\n     Or if not mad, then dreaming--dreaming?--well--\n     Dreaming then--Or, if self to self be true,\n     Not mock'd by that, but as poor souls have been\n     By those who wrong'd them, to give wrong new relish?\n     Or have those stars indeed they told me of\n     As masters of my wretched life of old,\n     Into some happier constellation roll'd,\n     And brought my better fortune out on earth\n     Clear as themselves in heaven!--Prince Segismund\n     They call'd me--and at will I shook them off--\n     Will they return again at my command\n     Again to call me so?--Within there! You!\n     Segismund calls--Prince Segismund--\n\n     (He has seated himself on the throne.\n     Enter Chamberlain, with lords in waiting.)\n\n     CHAMB.\n     I rejoice\n     That unadvised of any but the voice\n     Of royal instinct in the blood, your Highness\n     Has ta'en the chair that you were born to fill.\n\n     SEG.\n     The chair?\n\n     CHAMB.\n     The royal throne of Poland, Sir,\n     Which may your Royal Highness keep as long\n     As he that now rules from it shall have ruled\n     When heaven has call'd him to itself.\n\n     SEG.\n     When he?--\n\n     CHAMB.\n     Your royal father, King Basilio, Sir.\n\n     SEG.\n     My royal father--King Basilio.\n     You see I answer but as Echo does,\n     Not knowing what she listens or repeats.\n     This is my throne--this is my palace--Oh,\n     But this out of the window?--\n\n     CHAMB.\n     Warsaw, Sir,\n     Your capital--\n\n     SEG.\n     And all the moving people?\n\n     CHAMB.\n     Your subjects and your vassals like ourselves.\n\n     SEG.\n     Ay, ay--my subjects--in my capital--\n     Warsaw--and I am Prince of it--You see\n     It needs much iteration to strike sense\n     Into the human echo.\n\n     CHAMB.\n     Left awhile\n     In the quick brain, the word will quickly to\n     Full meaning blow.\n\n     SEG.\n     You think so?\n\n     CHAMB.\n     And meanwhile\n     Lest our obsequiousness, which means no worse\n     Than customary honour to the Prince\n     We most rejoice to welcome, trouble you,\n     Should we retire again? or stand apart?\n     Or would your Highness have the music play\n     Again, which meditation, as they say,\n     So often loves to float upon?\n\n     SEG.\n     The music?\n     No--yes--perhaps the trumpet--\n     (Aside)\n     Yet if that\n     Brought back the troop!\n\n     A LORD.\n     The trumpet! There again\n     How trumpet-like spoke out the blood of Poland!\n\n     CHAMB.\n     Before the morning is far up, your Highness\n     Will have the trumpet marshalling your soldiers\n     Under the Palace windows.\n\n     SEG.\n     Ah, my soldiers--\n     My soldiers--not black-vizor'd?--\n\n     CHAMB.\n     Sir?\n\n     SEG.\n     No matter.\n     But--one thing--for a moment--in your ear--\n     Do you know one Clotaldo?\n\n     CHAMB.\n     Oh, my Lord,\n     He and myself together, I may say,\n     Although in different vocations,\n     Have silver'd in your royal father's service;\n     And, as I trust, with both of us a few\n     White hairs to fall in yours.\n\n     SEG.\n     Well said, well said!\n     Basilio, my father--well--Clotaldo\n     Is he my kinsman too?\n\n     CHAMB.\n     Oh, my good Lord,\n     A General simply in your Highness' service,\n     Than whom your Highness has no trustier.\n\n     SEG.\n     Ay, so you said before, I think. And you\n     With that white wand of yours--\n     Why, now I think on't, I have read of such\n     A silver-hair'd magician with a wand,\n     Who in a moment, with a wave of it,\n     Turn'd rags to jewels, clowns to emperors,\n     By some benigner magic than the stars\n     Spirited poor good people out of hand\n     From all their woes; in some enchanted sleep\n     Carried them off on cloud or dragon-back\n     Over the mountains, over the wide Deep,\n     And set them down to wake in Fairyland.\n\n     CHAMB.\n     Oh, my good Lord, you laugh at me--and I\n     Right glad to make you laugh at such a price:\n     You know me no enchanter: if I were,\n     I and my wand as much as your Highness',\n     As now your chamberlain--\n\n     SEG.\n     My chamberlain?--\n     And these that follow you?--\n\n     CHAMB.\n     On you, my Lord,\n     Your Highness' lords in waiting.\n\n     SEG.\n     Lords in waiting.\n     Well, I have now learn'd to repeat, I think,\n     If only but by rote--This is my palace,\n     And this my throne--which unadvised--And that\n     Out of the window there my Capital;\n     And all the people moving up and down\n     My subjects and my vassals like yourselves,\n     My chamberlain--and lords in waiting--and\n     Clotaldo--and Clotaldo?--\n     You are an aged, and seem a reverend man--\n     You do not--though his fellow-officer--\n     You do not mean to mock me?\n\n     CHAMB.\n     Oh, my Lord!\n\n     SEG.\n     Well then--If no magician, as you say,\n     Yet setting me a riddle, that my brain,\n     With all its senses whirling, cannot solve,\n     Yourself or one of these with you must answer--\n     How I--that only last night fell asleep\n     Not knowing that the very soil of earth\n     I lay down--chain'd--to sleep upon was Poland--\n     Awake to find myself the Lord of it,\n     With Lords, and Generals, and Chamberlains,\n     And ev'n my very Gaoler, for my vassals!\n\n     Enter suddenly Clotaldo\n\n     CLOTALDO.\n     Stand all aside\n     That I may put into his hand the clue\n     To lead him out of this amazement. Sir,\n     Vouchsafe your Highness from my bended knee\n     Receive my homage first.\n\n     SEG.\n     Clotaldo! What,\n     At last--his old self--undisguised where all\n     Is masquerade--to end it!--You kneeling too!\n     What! have the stars you told me long ago\n     Laid that old work upon you, added this,\n     That, having chain'd your prisoner so long,\n     You loose his body now to slay his wits,\n     Dragging him--how I know not--whither scarce\n     I understand--dressing him up in all\n     This frippery, with your dumb familiars\n     Disvizor'd, and their lips unlock'd to lie,\n     Calling him Prince and King, and, madman-like,\n     Setting a crown of straw upon his head?\n\n     CLO.\n     Would but your Highness, as indeed I now\n     Must call you--and upon his bended knee\n     Never bent Subject more devotedly--\n     However all about you, and perhaps\n     You to yourself incomprehensiblest,\n     But rest in the assurance of your own\n     Sane waking senses, by these witnesses\n     Attested, till the story of it all,\n     Of which I bring a chapter, be reveal'd,\n     Assured of all you see and hear as neither\n     Madness nor mockery--\n\n     SEG.\n     What then?\n\n     CLO.\n     All it seems:\n     This palace with its royal garniture;\n     This capital of which it is the eye,\n     With all its temples, marts, and arsenals;\n     This realm of which this city is the head,\n     With all its cities, villages, and tilth,\n     Its armies, fleets, and commerce; all your own;\n     And all the living souls that make them up,\n     From those who now, and those who shall, salute you,\n     Down to the poorest peasant of the realm,\n     Your subjects--Who, though now their mighty voice\n     Sleeps in the general body unapprized,\n     Wait but a word from those about you now\n     To hail you Prince of Poland, Segismund.\n\n     SEG.\n     All this is so?\n\n     CLO.\n     As sure as anything\n     Is, or can be.\n\n     SEG.\n     You swear it on the faith\n     You taught me--elsewhere?--\n\n     CLO (kissing the hilt of his sword).\n     Swear it upon this Symbol,\n     and champion of the holy faith\n     I wear it to defend.\n\n     SEG (to himself).\n     My eyes have not deceived me, nor my ears,\n     With this transfiguration, nor the strain\n     Of royal welcome that arose and blew,\n     Breathed from no lying lips, along with it.\n     For here Clotaldo comes, his own old self,\n     Who, if not Lie and phantom with the rest--\n     (Aloud)\n     Well, then, all this is thus.\n     For have not these fine people told me so,\n     And you, Clotaldo, sworn it? And the Why\n     And Wherefore are to follow by and bye!\n     And yet--and yet--why wait for that which you\n     Who take your oath on it can answer--and\n     Indeed it presses hard upon my brain--\n     What I was asking of these gentlemen\n     When you came in upon us; how it is\n     That I--the Segismund you know so long\n     No longer than the sun that rose to-day\n     Rose--and from what you know--\n     Rose to be Prince of Poland?\n\n     CLO.\n     So to be\n     Acknowledged and entreated, Sir.\n\n     SEG.\n     So be\n     Acknowledged and entreated--\n     Well--But if now by all, by some at least\n     So known--if not entreated--heretofore--\n     Though not by you--For, now I think again,\n     Of what should be your attestation worth,\n     You that of all my questionable subjects\n     Who knowing what, yet left me where I was,\n     You least of all, Clotaldo, till the dawn\n     Of this first day that told it to myself?\n\n     CLO.\n     Oh, let your Highness draw the line across\n     Fore-written sorrow, and in this new dawn\n     Bury that long sad night.\n\n     SEG.\n     Not ev'n the Dead,\n     Call'd to the resurrection of the blest,\n     Shall so directly drop all memory\n     Of woes and wrongs foregone!\n\n     CLO.\n     But not resent--\n     Purged by the trial of that sorrow past\n     For full fruition of their present bliss.\n\n     SEG.\n     But leaving with the Judge what, till this earth\n     Be cancell'd in the burning heavens, He leaves\n     His earthly delegates to execute,\n     Of retribution in reward to them\n     And woe to those who wrong'd them--Not as you,\n     Not you, Clotaldo, knowing not--And yet\n     Ev'n to the guiltiest wretch in all the realm,\n     Of any treason guilty short of that,\n     Stern usage--but assuredly not knowing,\n     Not knowing 'twas your sovereign lord, Clotaldo,\n     You used so sternly.\n\n     CLO.\n     Ay, sir; with the same\n     Devotion and fidelity that now\n     Does homage to him for my sovereign.\n\n     SEG.\n     Fidelity that held his Prince in chains!\n\n     CLO.\n     Fidelity more fast than had it loosed him--\n\n     SEG.\n     Ev'n from the very dawn of consciousness\n     Down at the bottom of the barren rocks,\n     Where scarce a ray of sunshine found him out,\n     In which the poorest beggar of my realm\n     At least to human-full proportion grows--\n     Me! Me--whose station was the kingdom's top\n     To flourish in, reaching my head to heaven,\n     And with my branches overshadowing\n     The meaner growth below!\n\n     CLO.\n     Still with the same\n     Fidelity--\n\n     SEG.\n     To me!--\n\n     CLO.\n     Ay, sir, to you,\n     Through that divine allegiance upon which\n     All Order and Authority is based;\n     Which to revolt against--\n\n     SEG.\n     Were to revolt\n     Against the stars, belike!\n\n     CLO.\n     And him who reads them;\n     And by that right, and by the sovereignty\n     He wears as you shall wear it after him;\n     Ay, one to whom yourself--\n     Yourself, ev'n more than any subject here,\n     Are bound by yet another and more strong\n     Allegiance--King Basilio--your Father--\n\n     SEG.\n     Basilio--King--my father!--\n\n     CLO.\n     Oh, my Lord,\n     Let me beseech you on my bended knee,\n     For your own sake--for Poland's--and for his,\n     Who, looking up for counsel to the skies,\n     Did what he did under authority\n     To which the kings of earth themselves are subject,\n     And whose behest not only he that suffers,\n     But he that executes, not comprehends,\n     But only He that orders it--\n\n     SEG.\n     The King--\n     My father!--Either I am mad already,\n     Or that way driving fast--or I should know\n     That fathers do not use their children so,\n     Or men were loosed from all allegiance\n     To fathers, kings, and heaven that order'd all.\n     But, mad or not, my hour is come, and I\n     Will have my reckoning--Either you lie,\n     Under the skirt of sinless majesty\n     Shrouding your treason; or if _that_ indeed,\n     Guilty itself, take refuge in the stars\n     That cannot hear the charge, or disavow--\n     You, whether doer or deviser, who\n     Come first to hand, shall pay the penalty\n     By the same hand you owe it to--\n     (Seizing Clotaldo's sword and about to strike him.)\n\n     (Enter Rosaura suddenly.)\n\n     ROSAURA.\n     Fie, my Lord--forbear,\n     What! a young hand raised against silver hair!--\n\n     (She retreats through the crowd.)\n\n     SEG.\n     Stay! stay! What come and vanish'd as before--\n     I scarce remember how--but--\n\n     (Voices within. Room for Astolfo, Duke of Muscovy!)\n\n     (Enter Astolfo)\n\n     ASTOLFO.\n     Welcome, thrice welcome, the auspicious day,\n     When from the mountain where he darkling lay,\n     The Polish sun into the firmament\n     Sprung all the brighter for his late ascent,\n     And in meridian glory--\n\n     SEG.\n     Where is he?\n     Why must I ask this twice?--\n\n     A LORD.\n     The Page, my Lord?\n     I wonder at his boldness--\n\n     SEG.\n     But I tell you\n     He came with Angel written in his face\n     As now it is, when all was black as hell\n     About, and none of you who now--he came,\n     And Angel-like flung me a shining sword\n     To cut my way through darkness; and again\n     Angel-like wrests it from me in behalf\n     Of one--whom I will spare for sparing him:\n     But he must come and plead with that same voice\n     That pray'd for me--in vain.\n\n     CHAMB.\n     He is gone for,\n     And shall attend your pleasure, sir. Meanwhile,\n     Will not your Highness, as in courtesy,\n     Return your royal cousin's greeting?\n\n     SEG.\n     Whose?\n\n     CHAMB.\n     Astolfo, Duke of Muscovy, my Lord,\n     Saluted, and with gallant compliment\n     Welcomed you to your royal title.\n\n     SEG. (to Astolfo).\n     Oh--\n     You knew of this then?\n\n     AST.\n     Knew of what, my Lord?\n\n     SEG.\n     That I was Prince of Poland all the while,\n     And you my subject?\n\n     AST.\n     Pardon me, my Lord,\n     But some few hours ago myself I learn'd\n     Your dignity; but, knowing it, no more\n     Than when I knew it not, your subject.\n\n     SEG.\n     What then?\n\n     AST.\n     Your Highness' chamberlain ev'n now has told you;\n     Astolfo, Duke of Muscovy,\n     Your father's sister's son; your cousin, sir:\n     And who as such, and in his own right Prince,\n     Expects from you the courtesy he shows.\n\n     CHAMB.\n     His Highness is as yet unused to Court,\n     And to the ceremonious interchange\n     Of compliment, especially to those\n     Who draw their blood from the same royal fountain.\n\n     SEG.\n     Where is the lad? I weary of all this--\n     Prince, cousins, chamberlains, and compliments--\n     Where are my soldiers? Blow the trumpet, and\n     With one sharp blast scatter these butterflies\n     And bring the men of iron to my side,\n     With whom a king feels like a king indeed!\n\n     (Voices within. Within there! room for the Princess Estrella!)\n\n     (Enter Estrella with Ladies.)\n\n     ESTRELLA.\n     Welcome, my Lord, right welcome to the throne\n     That much too long has waited for your coming:\n     And, in the general voice of Poland, hear\n     A kinswoman and cousin's no less sincere.\n\n     SEG.\n     Ay, this is welcome-worth indeed,\n     And cousin cousin-worth! Oh, I have thus\n     Over the threshold of the mountain seen,\n     Leading a bevy of fair stars, the moon\n     Enter the court of heaven--My kinswoman!\n     My cousin! But my subject?--\n\n     EST.\n     If you please\n     To count your cousin for your subject, sir,\n     You shall not find her a disloyal.\n\n     SEG.\n     Oh,\n     But there are twin stars in that heavenly face,\n     That now I know for having over-ruled\n     Those evil ones that darken'd all my past\n     And brought me forth from that captivity\n     To be the slave of her who set me free.\n\n     EST.\n     Indeed, my Lord, these eyes have no such power\n     Over the past or present: but perhaps\n     They brighten at your welcome to supply\n     The little that a lady's speech commends;\n     And in the hope that, let whichever be\n     The other's subject, we may both be friends.\n\n     SEG.\n     Your hand to that--But why does this warm hand\n     Shoot a cold shudder through me?\n\n     EST.\n     In revenge\n     For likening me to that cold moon, perhaps.\n\n     SEG.\n     Oh, but the lip whose music tells me so\n     Breathes of a warmer planet, and that lip\n     Shall remedy the treason of the hand!\n     (He catches to embrace her.)\n\n     EST.\n     Release me, sir!\n\n     CHAMB.\n     And pardon me, my Lord.\n     This lady is a Princess absolute,\n     As Prince he is who just saluted you,\n     And claims her by affiance.\n\n     SEG.\n     Hence, old fool,\n     For ever thrusting that white stick of yours\n     Between me and my pleasure!\n\n     AST.\n     This cause is mine.\n     Forbear, sir--\n\n     SEG.\n     What, sir mouth-piece, you again?\n\n     AST.\n     My Lord, I waive your insult to myself\n     In recognition of the dignity\n     You yet are new to, and that greater still\n     You look in time to wear. But for this lady--\n     Whom, if my cousin now, I hope to claim\n     Henceforth by yet a nearer, dearer name--\n\n     SEG.\n     And what care I? She is my cousin too:\n     And if you be a Prince--well, am not I\n     Lord of the very soil you stand upon?\n     By that, and by that right beside of blood\n     That like a fiery fountain hitherto\n     Pent in the rock leaps toward her at her touch,\n     Mine, before all the cousins in Muscovy!\n     You call me Prince of Poland, and yourselves\n     My subjects--traitors therefore to this hour,\n     Who let me perish all my youth away\n     Chain'd there among the mountains; till, forsooth,\n     Terrified at your treachery foregone,\n     You spirit me up here, I know not how,\n     Popinjay-like invest me like yourselves,\n     Choke me with scent and music that I loathe,\n     And, worse than all the music and the scent,\n     With false, long-winded, fulsome compliment,\n     That 'Oh, you are my subjects!' and in word\n     Reiterating still obedience,\n     Thwart me in deed at every step I take:\n     When just about to wreak a just revenge\n     Upon that old arch-traitor of you all,\n     Filch from my vengeance him I hate; and him\n     I loved--the first and only face--till this--\n     I cared to look on in your ugly court--\n     And now when palpably I grasp at last\n     What hitherto but shadow'd in my dreams--\n     Affiances and interferences,\n     The first who dares to meddle with me more--\n     Princes and chamberlains and counsellors,\n     Touch her who dares!--\n\n     AST.\n     That dare I--\n\n     SEG. (seizing him by the throat).\n     You dare!\n\n     CHAMB.\n     My Lord!--\n\n     A LORD.\n     His strength's a lion's--\n\n     (Voices within. The King! The King!--)\n\n     (Enter King.)\n\n     A LORD.\n     And on a sudden how he stands at gaze\n     As might a wolf just fasten'd on his prey,\n     Glaring at a suddenly encounter'd lion.\n\n     KING.\n     And I that hither flew with open arms\n     To fold them round my son, must now return\n     To press them to an empty heart again!\n     (He sits on the throne.)\n\n     SEG.\n     That is the King?--My father?\n     (After a long pause.)\n     I have heard\n     That sometimes some blind instinct has been known\n     To draw to mutual recognition those\n     Of the same blood, beyond all memory\n     Divided, or ev'n never met before.\n     I know not how this is--perhaps in brutes\n     That live by kindlier instincts--but I know\n     That looking now upon that head whose crown\n     Pronounces him a sovereign king, I feel\n     No setting of the current in my blood\n     Tow'rd him as sire. How is't with you, old man,\n     Tow'rd him they call your son?--\n\n     KING.\n     Alas! Alas!\n\n     SEG.\n     Your sorrow, then?\n\n     KING.\n     Beholding what I do.\n\n     SEG.\n     Ay, but how know this sorrow that has grown\n     And moulded to this present shape of man,\n     As of your own creation?\n\n     KING.\n     Ev'n from birth.\n\n     SEG.\n     But from that hour to this, near, as I think,\n     Some twenty such renewals of the year\n     As trace themselves upon the barren rocks,\n     I never saw you, nor you me--unless,\n     Unless, indeed, through one of those dark masks\n     Through which a son might fail to recognize\n     The best of fathers.\n\n     KING.\n     Be that as you will:\n     But, now we see each other face to face,\n     Know me as you I know; which did I not,\n     By whatsoever signs, assuredly\n     You were not here to prove it at my risk.\n\n     SEG.\n     You are my father.\n     And is it true then, as Clotaldo swears,\n     'Twas you that from the dawning birth of one\n     Yourself brought into being,--you, I say,\n     Who stole his very birthright; not alone\n     That secondary and peculiar right\n     Of sovereignty, but even that prime\n     Inheritance that all men share alike,\n     And chain'd him--chain'd him!--like a wild beast's whelp.\n     Among as savage mountains, to this hour?\n     Answer if this be thus.\n\n     KING.\n     Oh, Segismund,\n     In all that I have done that seems to you,\n     And, without further hearing, fairly seems,\n     Unnatural and cruel--'twas not I,\n     But One who writes His order in the sky\n     I dared not misinterpret nor neglect,\n     Who knows with what reluctance--\n\n     SEG.\n     Oh, those stars,\n     Those stars, that too far up from human blame\n     To clear themselves, or careless of the charge,\n     Still bear upon their shining shoulders all\n     The guilt men shift upon them!\n\n     KING.\n     Nay, but think:\n     Not only on the common score of kind,\n     But that peculiar count of sovereignty--\n     If not behind the beast in brain as heart,\n     How should I thus deal with my innocent child,\n     Doubly desired, and doubly dear when come,\n     As that sweet second-self that all desire,\n     And princes more than all, to root themselves\n     By that succession in their people's hearts,\n     Unless at that superior Will, to which\n     Not kings alone, but sovereign nature bows?\n\n     SEG.\n     And what had those same stars to tell of me\n     That should compel a father and a king\n     So much against that double instinct?\n\n     KING.\n     That,\n     Which I have brought you hither, at my peril,\n     Against their written warning, to disprove,\n     By justice, mercy, human kindliness.\n\n     SEG.\n     And therefore made yourself their instrument\n     To make your son the savage and the brute\n     They only prophesied?--Are you not afear'd,\n     Lest, irrespective as such creatures are\n     Of such relationship, the brute you made\n     Revenge the man you marr'd--like sire, like son.\n     To do by you as you by me have done?\n\n     KING.\n     You never had a savage heart from me;\n     I may appeal to Poland.\n\n     SEG.\n     Then from whom?\n     If pure in fountain, poison'd by yourself\n     When scarce begun to flow.--To make a man\n     Not, as I see, degraded from the mould\n     I came from, nor compared to those about,\n     And then to throw your own flesh to the dogs!--\n     Why not at once, I say, if terrified\n     At the prophetic omens of my birth,\n     Have drown'd or stifled me, as they do whelps\n     Too costly or too dangerous to keep?\n\n     KING.\n     That, living, you might learn to live, and rule\n     Yourself and Poland.\n\n     SEG.\n     By the means you took\n     To spoil for either?\n\n     KING.\n     Nay, but, Segismund!\n     You know not--cannot know--happily wanting\n     The sad experience on which knowledge grows,\n     How the too early consciousness of power\n     Spoils the best blood; nor whether for your long\n     Constrain'd disheritance (which, but for me,\n     Remember, and for my relenting love\n     Bursting the bond of fate, had been eternal)\n     You have not now a full indemnity;\n     Wearing the blossom of your youth unspent\n     In the voluptuous sunshine of a court,\n     That often, by too early blossoming,\n     Too soon deflowers the rose of royalty.\n\n     SEG.\n     Ay, but what some precocious warmth may spill,\n     May not an early frost as surely kill?\n\n     KING.\n     But, Segismund, my son, whose quick discourse\n     Proves I have not extinguish'd and destroy'd\n     The Man you charge me with extinguishing,\n     However it condemn me for the fault\n     Of keeping a good light so long eclipsed,\n     Reflect! This is the moment upon which\n     Those stars, whose eyes, although we see them not,\n     By day as well as night are on us still,\n     Hang watching up in the meridian heaven\n     Which way the balance turns; and if to you--\n     As by your dealing God decide it may,\n     To my confusion!--let me answer it\n     Unto yourself alone, who shall at once\n     Approve yourself to be your father's judge,\n     And sovereign of Poland in his stead,\n     By justice, mercy, self-sobriety,\n     And all the reasonable attributes\n     Without which, impotent to rule himself,\n     Others one cannot, and one must not rule;\n     But which if you but show the blossom of--\n     All that is past we shall but look upon\n     As the first out-fling of a generous nature\n     Rioting in first liberty; and if\n     This blossom do but promise such a flower\n     As promises in turn its kindly fruit:\n     Forthwith upon your brows the royal crown,\n     That now weighs heavy on my aged brows,\n     I will devolve; and while I pass away\n     Into some cloister, with my Maker there\n     To make my peace in penitence and prayer,\n     Happily settle the disorder'd realm\n     That now cries loudly for a lineal heir.\n\n     SEG.\n     And so--\n     When the crown falters on your shaking head,\n     And slips the sceptre from your palsied hand,\n     And Poland for her rightful heir cries out;\n     When not only your stol'n monopoly\n     Fails you of earthly power, but 'cross the grave\n     The judgment-trumpet of another world\n     Calls you to count for your abuse of this;\n     Then, oh then, terrified by the double danger,\n     You drag me from my den--\n     Boast not of giving up at last the power\n     You can no longer hold, and never rightly\n     Held, but in fee for him you robb'd it from;\n     And be assured your Savage, once let loose,\n     Will not be caged again so quickly; not\n     By threat or adulation to be tamed,\n     Till he have had his quarrel out with those\n     Who made him what he is.\n\n     KING.\n     Beware! Beware!\n     Subdue the kindled Tiger in your eye,\n     Nor dream that it was sheer necessity\n     Made me thus far relax the bond of fate,\n     And, with far more of terror than of hope\n     Threaten myself, my people, and the State.\n     Know that, if old, I yet have vigour left\n     To wield the sword as well as wear the crown;\n     And if my more immediate issue fail,\n     Not wanting scions of collateral blood,\n     Whose wholesome growth shall more than compensate\n     For all the loss of a distorted stem.\n\n     SEG.\n     That will I straightway bring to trial--Oh,\n     After a revelation such as this,\n     The Last Day shall have little left to show\n     Of righted wrong and villainy requited!\n     Nay, Judgment now beginning upon earth,\n     Myself, methinks, in sight of all my wrongs,\n     Appointed heaven's avenging minister,\n     Accuser, judge, and executioner\n     Sword in hand, cite the guilty--First, as worst,\n     The usurper of his son's inheritance;\n     Him and his old accomplice, time and crime\n     Inveterate, and unable to repay\n     The golden years of life they stole away.\n     What, does he yet maintain his state, and keep\n     The throne he should be judged from? Down with him,\n     That I may trample on the false white head\n     So long has worn my crown! Where are my soldiers?\n     Of all my subjects and my vassals here\n     Not one to do my bidding? Hark! A trumpet!\n     The trumpet--\n\n     (He pauses as the trumpet sounds as in Act I.,\n      and masked Soldiers gradually fill in behind the Throne.)\n\n     KING (rising before his throne).\n     Ay, indeed, the trumpet blows\n     A memorable note, to summon those\n     Who, if forthwith you fall not at the feet\n     Of him whose head you threaten with the dust,\n     Forthwith shall draw the curtain of the Past\n     About you; and this momentary gleam\n     Of glory that you think to hold life-fast,\n     So coming, so shall vanish, as a dream.\n\n     SEG.\n     He prophesies; the old man prophesies;\n     And, at his trumpet's summons, from the tower\n     The leash-bound shadows loosen'd after me\n     My rising glory reach and over-lour--\n     But, reach not I my height, he shall not hold,\n     But with me back to his own darkness!\n\n     (He dashes toward the throne and is enclosed by the soldiers.)\n\n     Traitors!\n     Hold off! Unhand me!--Am not I your king?\n     And you would strangle him!--\n     But I am breaking with an inward Fire\n     Shall scorch you off, and wrap me on the wings\n     Of conflagration from a kindled pyre\n     Of lying prophecies and prophet-kings\n     Above the extinguish'd stars--Reach me the sword\n     He flung me--Fill me such a bowl of wine\n     As that you woke the day with--\n\n     KING.\n     And shall close,--\n     But of the vintage that Clotaldo knows.\n\n     (Exeunt.)\n\n\n\n\nACT III.\n\n\n\n\nSCENE I.--The Tower, etc., as in Act I. Scene I.\n\nSegismund, as at first, and Clotaldo.\n\n     CLOTALDO.\n     Princes and princesses, and counsellors\n     Fluster'd to right and left--my life made at--\n     But that was nothing\n     Even the white-hair'd, venerable King\n     Seized on--Indeed, you made wild work of it;\n     And so discover'd in your outward action,\n     Flinging your arms about you in your sleep,\n     Grinding your teeth--and, as I now remember,\n     Woke mouthing out judgment and execution,\n     On those about you.\n\n     SEG.\n     Ay, I did indeed.\n\n     CLO.\n     Ev'n now your eyes stare wild; your hair stands up--\n     Your pulses throb and flutter, reeling still\n     Under the storm of such a dream--\n\n     SEG.\n     A dream!\n     That seem'd as swearable reality\n     As what I wake in now.\n\n     CLO.\n     Ay--wondrous how\n     Imagination in a sleeping brain\n     Out of the uncontingent senses draws\n     Sensations strong as from the real touch;\n     That we not only laugh aloud, and drench\n     With tears our pillow; but in the agony\n     Of some imaginary conflict, fight\n     And struggle--ev'n as you did; some, 'tis thought,\n     Under the dreamt-of stroke of death have died.\n\n     SEG.\n     And what so very strange too--In that world\n     Where place as well as people all was strange,\n     Ev'n I almost as strange unto myself,\n     You only, you, Clotaldo--you, as much\n     And palpably yourself as now you are,\n     Came in this very garb you ever wore,\n     By such a token of the past, you said,\n     To assure me of that seeming present.\n\n     CLO.\n     Ay?\n\n     SEG.\n     Ay; and even told me of the very stars\n     You tell me here of--how in spite of them,\n     I was enlarged to all that glory.\n\n     CLO.\n     Ay, By the false spirits' nice contrivance thus\n     A little truth oft leavens all the false,\n     The better to delude us.\n\n     SEG.\n     For you know\n     'Tis nothing but a dream?\n\n     CLO.\n     Nay, you yourself\n     Know best how lately you awoke from that\n     You know you went to sleep on?--\n     Why, have you never dreamt the like before?\n\n     SEG.\n     Never, to such reality.\n\n     CLO.\n     Such dreams\n     Are oftentimes the sleeping exhalations\n     Of that ambition that lies smouldering\n     Under the ashes of the lowest fortune;\n     By which, when reason slumbers, or has lost\n     The reins of sensible comparison,\n     We fly at something higher than we are--\n     Scarce ever dive to lower--to be kings,\n     Or conquerors, crown'd with laurel or with gold,\n     Nay, mounting heaven itself on eagle wings.\n     Which, by the way, now that I think of it,\n     May furnish us the key to this high flight\n     That royal Eagle we were watching, and\n     Talking of as you went to sleep last night.\n\n     SEG.\n     Last night? Last night?\n\n     CLO.\n     Ay, do you not remember\n     Envying his immunity of flight,\n     As, rising from his throne of rock, he sail'd\n     Above the mountains far into the West,\n     That burn'd about him, while with poising wings\n     He darkled in it as a burning brand\n     Is seen to smoulder in the fire it feeds?\n\n     SEG.\n     Last night--last night--Oh, what a day was that\n     Between that last night and this sad To-day!\n\n     CLO.\n     And yet, perhaps,\n     Only some few dark moments, into which\n     Imagination, once lit up within\n     And unconditional of time and space,\n     Can pour infinities.\n\n     SEG.\n     And I remember\n     How the old man they call'd the King, who wore\n     The crown of gold about his silver hair,\n     And a mysterious girdle round his waist,\n     Just when my rage was roaring at its height,\n     And after which it all was dark again,\n     Bid me beware lest all should be a dream.\n\n     CLO.\n     Ay--there another specialty of dreams,\n     That once the dreamer 'gins to dream he dreams,\n     His foot is on the very verge of waking.\n\n     SEG.\n     Would it had been upon the verge of death\n     That knows no waking--\n     Lifting me up to glory, to fall back,\n     Stunn'd, crippled--wretcheder than ev'n before.\n\n     CLO.\n     Yet not so glorious, Segismund, if you\n     Your visionary honour wore so ill\n     As to work murder and revenge on those\n     Who meant you well.\n\n     SEG.\n     Who meant me!--me! their Prince\n     Chain'd like a felon--\n\n     CLO.\n     Stay, stay--Not so fast,\n     You dream'd the Prince, remember.\n\n     SEG.\n     Then in dream\n     Revenged it only.\n\n     CLO.\n     True. But as they say\n     Dreams are rough copies of the waking soul\n     Yet uncorrected of the higher Will,\n     So that men sometimes in their dreams confess\n     An unsuspected, or forgotten, self;\n     One must beware to check--ay, if one may,\n     Stifle ere born, such passion in ourselves\n     As makes, we see, such havoc with our sleep,\n     And ill reacts upon the waking day.\n     And, by the bye, for one test, Segismund,\n     Between such swearable realities--\n     Since Dreaming, Madness, Passion, are akin\n     In missing each that salutary rein\n     Of reason, and the guiding will of man:\n     One test, I think, of waking sanity\n     Shall be that conscious power of self-control,\n     To curb all passion, but much most of all\n     That evil and vindictive, that ill squares\n     With human, and with holy canon less,\n     Which bids us pardon ev'n our enemies,\n     And much more those who, out of no ill will,\n     Mistakenly have taken up the rod\n     Which heaven, they think, has put into their hands.\n\n     SEG.\n     I think I soon shall have to try again--\n     Sleep has not yet done with me.\n\n     CLO.\n     Such a sleep.\n     Take my advice--'tis early yet--the sun\n     Scarce up above the mountain; go within,\n     And if the night deceived you, try anew\n     With morning; morning dreams they say come true.\n\n     SEG.\n     Oh, rather pray for me a sleep so fast\n     As shall obliterate dream and waking too.\n\n     (Exit into the tower.)\n\n     CLO.\n     So sleep; sleep fast: and sleep away those two\n     Night-potions, and the waking dream between\n     Which dream thou must believe; and, if to see\n     Again, poor Segismund! that dream must be.--\n     And yet, and yet, in these our ghostly lives,\n     Half night, half day, half sleeping, half awake,\n     How if our waking life, like that of sleep,\n     Be all a dream in that eternal life\n     To which we wake not till we sleep in death?\n     How if, I say, the senses we now trust\n     For date of sensible comparison,--\n     Ay, ev'n the Reason's self that dates with them,\n     Should be in essence or intensity\n     Hereafter so transcended, and awake\n     To a perceptive subtlety so keen\n     As to confess themselves befool'd before,\n     In all that now they will avouch for most?\n     One man--like this--but only so much longer\n     As life is longer than a summer's day,\n     Believed himself a king upon his throne,\n     And play'd at hazard with his fellows' lives,\n     Who cheaply dream'd away their lives to him.\n     The sailor dream'd of tossing on the flood:\n     The soldier of his laurels grown in blood:\n     The lover of the beauty that he knew\n     Must yet dissolve to dusty residue:\n     The merchant and the miser of his bags\n     Of finger'd gold; the beggar of his rags:\n     And all this stage of earth on which we seem\n     Such busy actors, and the parts we play'd,\n     Substantial as the shadow of a shade,\n     And Dreaming but a dream within a dream!\n\n     FIFE.\n     Was it not said, sir,\n     By some philosopher as yet unborn,\n     That any chimney-sweep who for twelve hours\n     Dreams himself king is happy as the king\n     Who dreams himself twelve hours a chimney-sweep?\n\n     CLO.\n     A theme indeed for wiser heads than yours\n     To moralize upon--How came you here?--\n\n     FIFE.\n     Not of my own will, I assure you, sir.\n     No matter for myself: but I would know\n     About my mistress--I mean, master--\n\n     CLO.\n     Oh, Now I remember--Well, your master-mistress\n     Is well, and deftly on its errand speeds,\n     As you shall--if you can but hold your tongue.\n     Can you?\n\n     FIFE.\n     I'd rather be at home again.\n\n     CLO.\n     Where you shall be the quicker if while here\n     You can keep silence.\n\n     FIFE.\n     I may whistle, then?\n     Which by the virtue of my name I do,\n     And also as a reasonable test\n     Of waking sanity--\n\n     CLO.\n     Well, whistle then;\n     And for another reason you forgot,\n     That while you whistle, you can chatter not.\n     Only remember--if you quit this pass--\n\n     FIFE.\n     (His rhymes are out, or he had call'd it spot)--\n\n     CLO.\n     A bullet brings you to.\n     I must forthwith to court to tell the King\n     The issue of this lamentable day,\n     That buries all his hope in night.\n     (To FIFE.)\n     Farewell. Remember.\n\n     FIFE.\n     But a moment--but a word!\n     When shall I see my mis--mas--\n\n     CLO.\n     Be content:\n     All in good time; and then, and not before,\n     Never to miss your master any more.\n     (Exit.)\n\n     FIFE.\n     Such talk of dreaming--dreaming--I begin\n     To doubt if I be dreaming I am Fife,\n     Who with a lad who call'd herself a boy\n     Because--I doubt there's some confusion here--\n     He wore no petticoat, came on a time\n     Riding from Muscovy on half a horse,\n     Who must have dreamt she was a horse entire,\n     To cant me off upon my hinder face\n     Under this tower, wall-eyed and musket-tongued,\n     With sentinels a-pacing up and down,\n     Crying All's well when all is far from well,\n     All the day long, and all the night, until\n     I dream--if what is dreaming be not waking--\n     Of bells a-tolling and processions rolling\n     With candles, crosses, banners, San-benitos,\n     Of which I wear the flamy-finingest,\n     Through streets and places throng'd with fiery faces\n     To some back platform--\n     Oh, I shall take a fire into my hand\n     With thinking of my own dear Muscovy--\n     Only just over that Sierra there,\n     By which we tumbled headlong into--No-land.\n     Now, if without a bullet after me,\n     I could but get a peep of my old home\n     Perhaps of my own mule to take me there--\n     All's still--perhaps the gentlemen within\n     Are dreaming it is night behind their masks--\n     God send 'em a good nightmare!--Now then--Hark!\n     Voices--and up the rocks--and armed men\n     Climbing like cats--Puss in the corner then.\n\n     (He hides.)\n\n     (Enter Soldiers cautiously up the rocks.)\n\n     CAPTAIN.\n     This is the frontier pass, at any rate,\n     Where Poland ends and Muscovy begins.\n\n     SOLDIER.\n     We must be close upon the tower, I know,\n     That half way up the mountain lies ensconced.\n\n     CAPT.\n     How know you that?\n\n     SOL.\n     He told me so--the Page\n     Who put us on the scent.\n\n     SOL. 2.\n     And, as I think,\n     Will soon be here to run it down with us.\n\n     CAPT.\n     Meantime, our horses on these ugly rocks\n     Useless, and worse than useless with their clatter--\n     Leave them behind, with one or two in charge,\n     And softly, softly, softly.\n\n     SOLDIERS.\n     --There it is!\n     --There what?\n     --The tower--the fortress--\n     --That the tower!--\n     --That mouse-trap! We could pitch it down the rocks\n     With our own hands.\n     --The rocks it hangs among\n     Dwarf its proportions and conceal its strength;\n     Larger and stronger than you think.\n     --No matter;\n     No place for Poland's Prince to be shut up in.\n     At it at once!\n\n     CAPT.\n     No--no--I tell you wait--\n     Till those within give signal. For as yet\n     We know not who side with us, and the fort\n     Is strong in man and musket.\n\n     SOL.\n     Shame to wait\n     For odds with such a cause at stake.\n\n     CAPT.\n     Because\n     Of such a cause at stake we wait for odds--\n     For if not won at once, for ever lost:\n     For any long resistance on their part\n     Would bring Basilio's force to succour them\n     Ere we had rescued him we come to rescue.\n     So softly, softly, softly, still--\n\n     A SOLDIER (discovering Fife).\n     Hilloa!\n\n     SOLDIERS.\n     --Hilloa! Here's some one skulking--\n     --Seize and gag him!\n     --Stab him at once, say I: the only way\n     To make all sure.\n     --Hold, every man of you!\n     And down upon your knees!--Why, 'tis the Prince!\n     --The Prince!--\n     --Oh, I should know him anywhere,\n     And anyhow disguised.\n     --But the Prince is chain'd.\n     --And of a loftier presence--\n     --'Tis he, I tell you;\n     Only bewilder'd as he was before.\n     God save your Royal Highness! On our knees\n     Beseech you answer us!\n\n     FIFE.\n     Just as you please.\n     Well--'tis this country's custom, I suppose,\n     To take a poor man every now and then\n     And set him ON the throne; just for the fun\n     Of tumbling him again into the dirt.\n     And now my turn is come. 'Tis very pretty.\n\n     SOL.\n     His wits have been distemper'd with their drugs.\n     But do you ask him, Captain.\n\n     CAPT.\n     On my knees,\n     And in the name of all who kneel with me,\n     I do beseech your Highness answer to\n     Your royal title.\n\n     FIFE.\n     Still, just as you please.\n     In my own poor opinion of myself--\n     But that may all be dreaming, which it seems\n     Is very much the fashion in this country\n     No Polish prince at all, but a poor lad\n     From Muscovy; where only help me back,\n     I promise never to contest the crown\n     Of Poland with whatever gentleman\n     You fancy to set up.\n\n     SOLDIERS.\n     --From Muscovy?\n     --A spy then--\n     --Of Astolfo's--\n     --Spy! a spy\n     --Hang him at once!\n\n     FIFE.\n     No, pray don't dream of that!\n\n     SOL.\n     How dared you then set yourself up for our Prince Segismund?\n\n     FIFE.\n     _I_ set up!--_I_ like that\n     When 'twas yourselves be-siegesmunded me.\n\n     CAPT.\n     No matter--Look!--The signal from the tower.\n     Prince Segismund!\n\n     SOL. (from the tower).\n     Prince Segismund!\n\n     CAPT.\n     All's well. Clotaldo safe secured?--\n\n     SOL. (from the tower).\n     No--by ill luck,\n     Instead of coming in, as we had look'd for,\n     He sprang on horse at once, and off at gallop.\n\n     CAPT.\n     To Court, no doubt--a blunder that--And yet\n     Perchance a blunder that may work as well\n     As better forethought. Having no suspicion\n     So will he carry none where his not going\n     Were of itself suspicious. But of those\n     Within, who side with us?\n\n     SOL.\n     Oh, one and all\n     To the last man, persuaded or compell'd.\n\n     CAPT.\n     Enough: whatever be to be retrieved\n     No moment to be lost. For though Clotaldo\n     Have no revolt to tell of in the tower,\n     The capital will soon awake to ours,\n     And the King's force come blazing after us.\n     Where is the Prince?\n\n     SOL.\n     Within; so fast asleep\n     We woke him not ev'n striking off the chain\n     We had so cursedly help bind him with,\n     Not knowing what we did; but too ashamed\n     Not to undo ourselves what we had done.\n\n     CAPT.\n     No matter, nor by whosesoever hands,\n     Provided done. Come; we will bring him forth\n     Out of that stony darkness here abroad,\n     Where air and sunshine sooner shall disperse\n     The sleepy fume which they have drugg'd him with.\n\n     (They enter the tower, and thence bring out Segismund asleep on a\n     pallet, and set him in the middle of the stage.)\n\n     CAPT.\n     Still, still so dead asleep, the very noise\n     And motion that we make in carrying him\n     Stirs not a leaf in all the living tree.\n\n     SOLDIERS.\n     If living--But if by some inward blow\n     For ever and irrevocably fell'd\n     By what strikes deeper to the root than sleep?\n     --He's dead! He's dead! They've kill'd him--\n     --No--he breathes--\n     And the heart beats--and now he breathes again\n     Deeply, as one about to shake away\n     The load of sleep.\n\n     CAPT.\n     Come, let us all kneel round,\n     And with a blast of warlike instruments,\n     And acclamation of all loyal hearts,\n     Rouse and restore him to his royal right,\n     From which no royal wrong shall drive him more.\n\n     (They all kneel round his bed: trumpets, drums, etc.)\n\n     SOLDIERS.\n     --Segismund! Segismund! Prince Segismund!\n     --King Segismund! Down with Basilio!\n     --Down with Astolfo! Segismund our King! etc.\n     --He stares upon us wildly. He cannot speak.\n     --I said so--driv'n him mad.\n     --Speak to him, Captain.\n\n     CAPTAIN.\n     Oh Royal Segismund, our Prince and King,\n     Look on us--listen to us--answer us,\n     Your faithful soldiery and subjects, now\n     About you kneeling, but on fire to rise\n     And cleave a passage through your enemies,\n     Until we seat you on your lawful throne.\n     For though your father, King Basilio,\n     Now King of Poland, jealous of the stars\n     That prophesy his setting with your rise,\n     Here holds you ignominiously eclipsed,\n     And would Astolfo, Duke of Muscovy,\n     Mount to the throne of Poland after him;\n     So will not we, your loyal soldiery\n     And subjects; neither those of us now first\n     Apprised of your existence and your right:\n     Nor those that hitherto deluded by\n     Allegiance false, their vizors now fling down,\n     And craving pardon on their knees with us\n     For that unconscious disloyalty,\n     Offer with us the service of their blood;\n     Not only we and they; but at our heels\n     The heart, if not the bulk, of Poland follows\n     To join their voices and their arms with ours,\n     In vindicating with our lives our own\n     Prince Segismund to Poland and her throne.\n\n     SOLDIERS.\n     --Segismund, Segismund, Prince Segismund!\n     --Our own King Segismund, etc.\n     (They all rise.)\n\n     SEG.\n     Again? So soon?--What, not yet done with me?\n     The sun is little higher up, I think,\n     Than when I last lay down,\n     To bury in the depth of your own sea\n     You that infest its shallows.\n\n     CAPT.\n     Sir!\n\n     SEG.\n     And now,\n     Not in a palace, not in the fine clothes\n     We all were in; but here, in the old place,\n     And in our old accoutrement--\n     Only your vizors off, and lips unlock'd\n     To mock me with that idle title--\n\n     CAPT.\n     Nay,\n     Indeed no idle title, but your own,\n     Then, now, and now for ever. For, behold,\n     Ev'n as I speak, the mountain passes fill\n     And bristle with the advancing soldiery\n     That glitters in your rising glory, sir;\n     And, at our signal, echo to our cry,\n     'Segismund, King of Poland!' etc.\n\n     (Shouts, trumpets, etc.)\n\n     SEG.\n     Oh, how cheap\n     The muster of a countless host of shadows,\n     As impotent to do with as to keep!\n     All this they said before--to softer music.\n\n     CAPT.\n     Soft music, sir, to what indeed were shadows,\n     That, following the sunshine of a Court,\n     Shall back be brought with it--if shadows still,\n     Yet to substantial reckoning.\n\n     SEG.\n     They shall?\n     The white-hair'd and white-wanded chamberlain,\n     So busy with his wand too--the old King\n     That I was somewhat hard on--he had been\n     Hard upon me--and the fine feather'd Prince\n     Who crow'd so loud--my cousin,--and another,\n     Another cousin, we will not bear hard on--\n     And--But Clotaldo?\n\n     CAPT.\n     Fled, my lord, but close\n     Pursued; and then--\n\n     SEG.\n     Then, as he fled before,\n     And after he had sworn it on his knees,\n     Came back to take me--where I am!--No more,\n     No more of this! Away with you! Begone!\n     Whether but visions of ambitious night\n     That morning ought to scatter, or grown out\n     Of night's proportions you invade the day\n     To scare me from my little wits yet left,\n     Begone! I know I must be near awake,\n     Knowing I dream; or, if not at my voice,\n     Then vanish at the clapping of my hands,\n     Or take this foolish fellow for your sport:\n     Dressing me up in visionary glories,\n     Which the first air of waking consciousness\n     Scatters as fast as from the almander--\n     That, waking one fine morning in full flower,\n     One rougher insurrection of the breeze\n     Of all her sudden honour disadorns\n     To the last blossom, and she stands again\n     The winter-naked scare-crow that she was!\n\n     CAPT.\n     I know not what to do, nor what to say,\n     With all this dreaming; I begin to doubt\n     They have driv'n him mad indeed, and he and we\n     Are lost together.\n\n     A SOLDIER (to Captain).\n     Stay, stay; I remember--\n     Hark in your ear a moment.\n     (Whispers.)\n\n     CAPT.\n     So--so--so?--\n     Oh, now indeed I do not wonder, sir,\n     Your senses dazzle under practices\n     Which treason, shrinking from its own device,\n     Would now persuade you only was a dream;\n     But waking was as absolute as this\n     You wake in now, as some who saw you then,\n     Prince as you were and are, can testify:\n     Not only saw, but under false allegiance\n     Laid hands upon--\n\n     SOLDIER 1.\n     I, to my shame!\n\n     SOLDIER 2.\n     And I!\n\n     CAPT.\n     Who, to wipe out that shame, have been the first\n     To stir and lead us--Hark!\n     (Shouts, trumpets, etc.)\n\n     A SOLDIER.\n     Our forces, sir,\n     Challenging King Basilio's, now in sight,\n     And bearing down upon us.\n\n     CAPT.\n     Sir, you hear;\n     A little hesitation and delay,\n     And all is lost--your own right, and the lives\n     Of those who now maintain it at that cost;\n     With you all saved and won; without, all lost.\n     That former recognition of your right\n     Grant but a dream, if you will have it so;\n     Great things forecast themselves by shadows great:\n     Or will you have it, this like that dream too,\n     People, and place, and time itself, all dream\n     Yet, being in't, and as the shadows come\n     Quicker and thicker than you can escape,\n     Adopt your visionary soldiery,\n     Who, having struck a solid chain away,\n     Now put an airy sword into your hand,\n     And harnessing you piece-meal till you stand\n     Amidst us all complete in glittering,\n     If unsubstantial, steel--\n\n     ROSAURA (without).\n     The Prince! The Prince!\n\n     CAPT.\n     Who calls for him?\n\n     SOL.\n     The Page who spurr'd us hither,\n     And now, dismounted from a foaming horse--\n\n     (Enter Rosaura)\n\n     ROSAURA.\n     Where is--but where I need no further ask\n     Where the majestic presence, all in arms,\n     Mutely proclaims and vindicates himself.\n\n     FIFE.\n     My darling Lady-lord--\n\n     ROS.\n     My own good Fife,\n     Keep to my side--and silence!--Oh, my Lord,\n     For the third time behold me here where first\n     You saw me, by a happy misadventure\n     Losing my own way here to find it out\n     For you to follow with these loyal men,\n     Adding the moment of my little cause\n     To yours; which, so much mightier as it is,\n     By a strange chance runs hand in hand with mine;\n     The self-same foe who now pretends your right,\n     Withholding mine--that, of itself alone,\n     I know the royal blood that runs in you\n     Would vindicate, regardless of your own:\n     The right of injured innocence; and, more,\n     Spite of this epicene attire, a woman's;\n     And of a noble stock I will not name\n     Till I, who brought it, have retrieved the shame.\n     Whom Duke Astolfo, Prince of Muscovy,\n     With all the solemn vows of wedlock won,\n     And would have wedded, as I do believe,\n     Had not the cry of Poland for a Prince\n     Call'd him from Muscovy to join the prize\n     Of Poland with the fair Estrella's eyes.\n     I, following him hither, as you saw,\n     Was cast upon these rocks; arrested by\n     Clotaldo: who, for an old debt of love\n     He owes my family, with all his might\n     Served, and had served me further, till my cause\n     Clash'd with his duty to his sovereign,\n     Which, as became a loyal subject, sir,\n     (And never sovereign had a loyaller,)\n     Was still his first. He carried me to Court,\n     Where, for the second time, I crossed your path;\n     Where, as I watch'd my opportunity,\n     Suddenly broke this public passion out;\n     Which, drowning private into public wrong,\n     Yet swiftlier sweeps it to revenge along.\n\n     SEG.\n     Oh God, if this be dreaming, charge it not\n     To burst the channel of enclosing sleep\n     And drown the waking reason! Not to dream\n     Only what dreamt shall once or twice again\n     Return to buzz about the sleeping brain\n     Till shaken off for ever--\n     But reassailing one so quick, so thick--\n     The very figure and the circumstance\n     Of sense-confess'd reality foregone\n     In so-call'd dream so palpably repeated,\n     The copy so like the original,\n     We know not which is which; and dream so-call'd\n     Itself inweaving so inextricably\n     Into the tissue of acknowledged truth;\n     The very figures that empeople it\n     Returning to assert themselves no phantoms\n     In something so much like meridian day,\n     And in the very place that not my worst\n     And veriest disenchanter shall deny\n     For the too well-remember'd theatre\n     Of my long tragedy--Strike up the drums!\n     If this be Truth, and all of us awake,\n     Indeed a famous quarrel is at stake:\n     If but a Vision I will see it out,\n     And, drive the Dream, I can but join the rout.\n\n     CAPT.\n     And in good time, sir, for a palpable\n     Touchstone of truth and rightful vengeance too,\n     Here is Clotaldo taken.\n\n     SOLDIERS.\n     In with him!\n     In with the traitor!\n\n     (Clotaldo brought in.)\n\n     SEG.\n     Ay, Clotaldo, indeed--\n     Himself--in his old habit--his old self--\n     What! back again, Clotaldo, for a while\n     To swear me this for truth, and afterwards\n     All for a dreaming lie?\n\n     CLO.\n     Awake or dreaming,\n     Down with that sword, and down these traitors theirs,\n     Drawn in rebellion 'gainst their Sovereign.\n\n     SEG. (about to strike).\n     Traitor! Traitor yourself!--\n     But soft--soft--soft!--\n     You told me, not so very long ago,\n     Awake or dreaming--I forget--my brain\n     Is not so clear about it--but I know\n     One test you gave me to discern between,\n     Which mad and dreaming people cannot master;\n     Or if the dreamer could, so best secure\n     A comfortable waking--Was't not so?\n     (To Rosaura).\n     Needs not your intercession now, you see,\n     As in the dream before--\n     Clotaldo, rough old nurse and tutor too\n     That only traitor wert, to me if true--\n     Give him his sword; set him on a fresh horse;\n     Conduct him safely through my rebel force;\n     And so God speed him to his sovereign's side!\n     Give me your hand; and whether all awake\n     Or all a-dreaming, ride, Clotaldo, ride--\n     Dream-swift--for fear we dreams should overtake.\n\n     (A Battle may be supposed to take place; after which)\n\n\n\n\nACT IV.\n\n\n\n\nSCENE I.--A wooded pass near the field of battle:\n\ndrums, trumpets, firing, etc. Cries of 'God save Basilio!\nSegismund,' etc.\n\n     (Enter Fife, running.)\n\n     FIFE.\n     God save them both, and save them all! say I!--\n     Oh--what hot work!--Whichever way one turns\n     The whistling bullet at one's ears--I've drifted\n     Far from my mad young--master--whom I saw\n     Tossing upon the very crest of battle,\n     Beside the Prince--God save her first of all!\n     With all my heart I say and pray--and so\n     Commend her to His keeping--bang!--bang!--bang!\n     And for myself--scarce worth His thinking of--\n     I'll see what I can do to save myself\n     Behind this rock, until the storm blows over.\n\n     (Skirmishes, shouts, firing, etc. After some time enter King\n          Basilio,\n     Astolfo, and Clotaldo)\n\n     KING.\n     The day is lost!\n\n     AST.\n     Do not despair--the rebels--\n\n     KING.\n     Alas! the vanquish'd only are the rebels.\n\n     CLOTALDO.\n     Ev'n if this battle lost us, 'tis but one\n     Gain'd on their side, if you not lost in it;\n     Another moment and too late: at once\n     Take horse, and to the capital, my liege,\n     Where in some safe and holy sanctuary\n     Save Poland in your person.\n\n     AST.\n     Be persuaded:\n     You know your son: have tasted of his temper;\n     At his first onset threatening unprovoked\n     The crime predicted for his last and worst.\n     How whetted now with such a taste of blood,\n     And thus far conquest!\n\n     KING.\n     Ay, and how he fought!\n     Oh how he fought, Astolfo; ranks of men\n     Falling as swathes of grass before the mower;\n     I could but pause to gaze at him, although,\n     Like the pale horseman of the Apocalypse,\n     Each moment brought him nearer--Yet I say,\n     I could but pause and gaze on him, and pray\n     Poland had such a warrior for her king.\n\n     AST.\n     The cry of triumph on the other side\n     Gains ground upon us here--there's but a moment\n     For you, my liege, to do, for me to speak,\n     Who back must to the field, and what man may\n     Do, to retrieve the fortune of the day.\n     (Firing.)\n\n     FIFE (falling forward, shot).\n     Oh, Lord, have mercy on me.\n\n     KING.\n     What a shriek--\n     Oh, some poor creature wounded in a cause\n     Perhaps not worth the loss of one poor life!--\n     So young too--and no soldier--\n\n     FIFE.\n     A poor lad,\n     Who choosing play at hide and seek with death,\n     Just hid where death just came to look for him;\n     For there's no place, I think, can keep him out,\n     Once he's his eye upon you. All grows dark--\n     You glitter finely too--Well--we are dreaming\n     But when the bullet's off--Heaven save the mark!\n     So tell my mister--mastress--\n     (Dies.)\n\n     KING.\n     Oh God! How this poor creature's ignorance\n     Confounds our so-call'd wisdom! Even now\n     When death has stopt his lips, the wound through which\n     His soul went out, still with its bloody tongue\n     Preaching how vain our struggle against fate!\n\n     (Voices within).\n     After them! After them! This way! This way!\n     The day is ours--Down with Basilio, etc.\n\n     AST.\n     Fly, sir--\n\n     KING.\n     And slave-like flying not out-ride\n     The fate which better like a King abide!\n\n     (Enter Segismund, Rosaura, Soldiers, etc.)\n\n     SEG.\n     Where is the King?\n\n     KING (prostrating himself).\n     Behold him,--by this late\n     Anticipation of resistless fate,\n     Thus underneath your feet his golden crown,\n     And the white head that wears it, laying down,\n     His fond resistance hope to expiate.\n\n     SEG.\n     Princes and warriors of Poland--you\n     That stare on this unnatural sight aghast,\n     Listen to one who, Heaven-inspired to do\n     What in its secret wisdom Heaven forecast,\n     By that same Heaven instructed prophet-wise\n     To justify the present in the past.\n     What in the sapphire volume of the skies\n     Is writ by God's own finger misleads none,\n     But him whose vain and misinstructed eyes,\n     They mock with misinterpretation,\n     Or who, mistaking what he rightly read,\n     Ill commentary makes, or misapplies\n     Thinking to shirk or thwart it. Which has done\n     The wisdom of this venerable head;\n     Who, well provided with the secret key\n     To that gold alphabet, himself made me,\n     Himself, I say, the savage he fore-read\n     Fate somehow should be charged with; nipp'd the growth\n     Of better nature in constraint and sloth,\n     That only bring to bear the seed of wrong\n     And turn'd the stream to fury whose out-burst\n     Had kept his lawful channel uncoerced,\n     And fertilized the land he flow'd along.\n     Then like to some unskilful duellist,\n     Who having over-reached himself pushing too hard\n     His foe, or but a moment off his guard--\n     What odds, when Fate is one's antagonist!--\n     Nay, more, this royal father, self-dismay'd\n     At having Fate against himself array'd,\n     Upon himself the very sword he knew\n     Should wound him, down upon his bosom drew,\n     That might well handled, well have wrought; or, kept\n     Undrawn, have harmless in the scabbard slept.\n     But Fate shall not by human force be broke,\n     Nor foil'd by human feint; the Secret learn'd\n     Against the scholar by that master turn'd\n     Who to himself reserves the master-stroke.\n     Witness whereof this venerable Age,\n     Thrice crown'd as Sire, and Sovereign, and Sage,\n     Down to the very dust dishonour'd by\n     The very means he tempted to defy\n     The irresistible. And shall not I,\n     Till now the mere dumb instrument that wrought\n     The battle Fate has with my father fought,\n     Now the mere mouth-piece of its victory\n     Oh, shall not I, the champions' sword laid down,\n     Be yet more shamed to wear the teacher's gown,\n     And, blushing at the part I had to play,\n     Down where that honour'd head I was to lay\n     By this more just submission of my own,\n     The treason Fate has forced on me atone?\n\n     KING.\n     Oh, Segismund, in whom I see indeed,\n     Out of the ashes of my self-extinction\n     A better self revive; if not beneath\n     Your feet, beneath your better wisdom bow'd,\n     The Sovereignty of Poland I resign,\n     With this its golden symbol; which if thus\n     Saved with its silver head inviolate,\n     Shall nevermore be subject to decline;\n     But when the head that it alights on now\n     Falls honour'd by the very foe that must,\n     As all things mortal, lay it in the dust,\n     Shall star-like shift to his successor's brow.\n\n     (Shouts, trumpets, etc. God save King Segismund!)\n\n     SEG.\n     For what remains--\n     As for my own, so for my people's peace,\n     Astolfo's and Estrella's plighted hands\n     I disunite, and taking hers to mine,\n     His to one yet more dearly his resign.\n\n     (Shouts, etc. God save Estrella, Queen of Poland!)\n\n     SEG (to Clotaldo).\n     You\n     That with unflinching duty to your King,\n     Till countermanded by the mightier Power,\n     Have held your Prince a captive in the tower,\n     Henceforth as strictly guard him on the throne\n     No less my people's keeper than my own.\n     You stare upon me all, amazed to hear\n     The word of civil justice from such lips\n     As never yet seem'd tuned to such discourse.\n     But listen--In that same enchanted tower,\n     Not long ago I learn'd it from a dream\n     Expounded by this ancient prophet here;\n     And which he told me, should it come again,\n     How I should bear myself beneath it; not\n     As then with angry passion all on fire,\n     Arguing and making a distemper'd soul;\n     But ev'n with justice, mercy, self-control,\n     As if the dream I walk'd in were no dream,\n     And conscience one day to account for it.\n     A dream it was in which I thought myself,\n     And you that hail'd me now then hail'd me King,\n     In a brave palace that was all my own,\n     Within, and all without it, mine; until,\n     Drunk with excess of majesty and pride,\n     Methought I tower'd so high and swell'd so wide,\n     That of myself I burst the glittering bubble,\n     That my ambition had about me blown,\n     And all again was darkness. Such a dream\n     As this in which I may be walking now;\n     Dispensing solemn justice to you shadows,\n     Who make believe to listen; but anon,\n     With all your glittering arms and equipage,\n     King, princes, captains, warriors, plume and steel,\n     Ay, ev'n with all your airy theatre,\n     May flit into the air you seem to rend\n     With acclamation, leaving me to wake\n     In the dark tower; or dreaming that I wake\n     From this that waking is; or this and that\n     Both waking or both dreaming; such a doubt\n     Confounds and clouds our mortal life about.\n     And, whether wake or dreaming, this I know,\n     How dream-wise human glories come and go;\n     Whose momentary tenure not to break,\n     Walking as one who knows he soon may wake,\n     So fairly carry the full cup, so well\n     Disorder'd insolence and passion quell,\n     That there be nothing after to upbraid\n     Dreamer or doer in the part he play'd,\n     Whether To-morrow's dawn shall break the spell,\n     Or the Last Trumpet of the eternal Day,\n     When Dreaming with the Night shall pass away.\n     (Exeunt.)", "title": "Life Is a Dream"}