{"summary": "\"Second Variety\" occurs in the aftermath of an extensive nuclear war between the Soviet Union (sometimes referred to as Russia) and the United Nations. Early Soviet victories forced the North American government and production to flee to a Moon Base, leaving the majority of their troops behind. To counter the almost complete Soviet victory, U.N. technicians develop robots, nicknamed claws—the basic models are \"a churning sphere of blades and metal\" that ambush their unsuspecting victims \"spinning, creeping, shaking themselves up suddenly from the gray ash and darting toward… [any warm body].\" U.N. forces are protected from the claws by a special radiation-emitting wrist tab. Within six years, the sophisticated and independent claws have destroyed the Soviet forces, repairing and redesigning themselves in automated underground factories run without any human oversight.\nThe U.N. forces receive a message from the Soviets asking for a policy-level officer to go to them for a gravely urgent conference. The U.N. victory was costlier than they had expected. Major Joseph Hendricks is sent to negotiate with the Soviets. En route to the rendezvous, he meets a small boy named David who asks to accompany Hendricks. When they near the Soviet bunker, soldiers immediately kill the boy, revealing him to be an android. The claws' development program has evolved to develop sophisticated robots, indistinguishable from humans, designed to infiltrate and kill. The three Soviets met by Major Hendricks—soldiers Klaus, Rudi, and a young woman named Tasso—reveal that the entire Soviet army and command structure collapsed under the onslaught of the new robots - they are all that are left in the command center.\nFrom salvaged internal metal identification plates, two varieties are identified: I-V, a wounded soldier, and III-V, David. II-V—the \"second variety\"—remains unknown. The different models are produced independently of each other in different factories. The Soviets also reveal that the U.N. protective tabs are ineffective against the new robots. Hendricks attempts to transmit a warning to his H.Q. bunker, but is unable to do so.\nDuring the night, Klaus claims Rudi is the II-V and kills him, however Rudi's internal organs are human. The next morning, Hendricks and the two remaining Soviets return to the U.N. lines. When they reach the bunker, they discover it overrun: a crowd of David and Wounded Soldier robots attack, but Tasso destroys them with a very powerful hand grenade, stating that it was designed to destroy the robots. Hendricks and Tasso flee, leaving Klaus to the old-style claws. However, Klaus survives both the claws and the bomb blast only to be shot by Tasso, sending \"gears and wheels\" flying. Tasso tells Hendricks that Klaus must have been the II-V robot.\nHendricks, now suffering from a wounded arm and internal injuries, hopes to escape to the Moon Base. He and Tasso search for a hidden escape rocket, which is found to be a single-seat spacecraft. Hendricks attempts to leave, but Tasso convinces him to let her leave and send back help. In his injured state, he has no choice but to agree. Hendricks provides Tasso with the signal code needed to find the Moon Base.\nAlone and armed with Tasso's pistol, Hendricks returns to Klaus' remains and discovers from the parts that the robot was not a II-V, but a IV-V. A group of robots then attack Hendricks, including Davids, Wounded Soldiers, and several Tasso—the true II-V—models. Hendricks recognizes that he has doomed the Moon Base by sending a robot to them, and that he cannot withstand the onslaught of robots attacking him. As the Tasso models approach, Hendricks notices the bombs clipped to their belts, and recalls that the first Tasso used one to destroy other claws. At his end, Hendricks is vaguely comforted by the thought that the claws are designing, developing, and producing weapons meant for killing other claws.\n\n", "full_text": "This etext was produced from Space Science Fiction May 1953.\n    Extensive research did not uncover any evidence that the U.S.\n    copyright on this publication was renewed.\n\n\n\n\n[Illustration]\n\n\n\n\nSECOND VARIETY\n\n\nBY PHILIP K. DICK\n\n\nILLUSTRATED BY EBEL\n\n    The claws were bad enough in the first place--nasty, crawling\n    little death-robots. But when they began to imitate their\n    creators, it was time for the human race to make peace--if it\n    could!\n\n\nThe Russian soldier made his way nervously up the ragged side of the\nhill, holding his gun ready. He glanced around him, licking his dry\nlips, his face set. From time to time he reached up a gloved hand and\nwiped perspiration from his neck, pushing down his coat collar.\n\nEric turned to Corporal Leone. \"Want him? Or can I have him?\" He\nadjusted the view sight so the Russian's features squarely filled the\nglass, the lines cutting across his hard, somber features.\n\nLeone considered. The Russian was close, moving rapidly, almost\nrunning. \"Don't fire. Wait.\" Leone tensed. \"I don't think we're\nneeded.\"\n\nThe Russian increased his pace, kicking ash and piles of debris out of\nhis way. He reached the top of the hill and stopped, panting, staring\naround him. The sky was overcast, drifting clouds of gray particles.\nBare trunks of trees jutted up occasionally; the ground was level and\nbare, rubble-strewn, with the ruins of buildings standing out here and\nthere like yellowing skulls.\n\nThe Russian was uneasy. He knew something was wrong. He started down\nthe hill. Now he was only a few paces from the bunker. Eric was\ngetting fidgety. He played with his pistol, glancing at Leone.\n\n\"Don't worry,\" Leone said. \"He won't get here. They'll take care of\nhim.\"\n\n\"Are you sure? He's got damn far.\"\n\n\"They hang around close to the bunker. He's getting into the bad part.\nGet set!\"\n\nThe Russian began to hurry, sliding down the hill, his boots sinking\ninto the heaps of gray ash, trying to keep his gun up. He stopped for\na moment, lifting his fieldglasses to his face.\n\n\"He's looking right at us,\" Eric said.\n\n       *       *       *       *       *\n\nThe Russian came on. They could see his eyes, like two blue stones.\nHis mouth was open a little. He needed a shave; his chin was stubbled.\nOn one bony cheek was a square of tape, showing blue at the edge. A\nfungoid spot. His coat was muddy and torn. One glove was missing. As\nhe ran his belt counter bounced up and down against him.\n\nLeone touched Eric's arm. \"Here one comes.\"\n\nAcross the ground something small and metallic came, flashing in the\ndull sunlight of mid-day. A metal sphere. It raced up the hill after\nthe Russian, its treads flying. It was small, one of the baby ones.\nIts claws were out, two razor projections spinning in a blur of white\nsteel. The Russian heard it. He turned instantly, firing. The sphere\ndissolved into particles. But already a second had emerged and was\nfollowing the first. The Russian fired again.\n\nA third sphere leaped up the Russian's leg, clicking and whirring. It\njumped to the shoulder. The spinning blades disappeared into the\nRussian's throat.\n\nEric relaxed. \"Well, that's that. God, those damn things give me the\ncreeps. Sometimes I think we were better off before.\"\n\n\"If we hadn't invented them, they would have.\" Leone lit a cigarette\nshakily. \"I wonder why a Russian would come all this way alone. I\ndidn't see anyone covering him.\"\n\nLt. Scott came slipping up the tunnel, into the bunker. \"What\nhappened? Something entered the screen.\"\n\n\"An Ivan.\"\n\n\"Just one?\"\n\nEric brought the view screen around. Scott peered into it. Now there\nwere numerous metal spheres crawling over the prostrate body, dull\nmetal globes clicking and whirring, sawing up the Russian into small\nparts to be carried away.\n\n\"What a lot of claws,\" Scott murmured.\n\n\"They come like flies. Not much game for them any more.\"\n\nScott pushed the sight away, disgusted. \"Like flies. I wonder why he\nwas out there. They know we have claws all around.\"\n\nA larger robot had joined the smaller spheres. It was directing\noperations, a long blunt tube with projecting eyepieces. There was not\nmuch left of the soldier. What remained was being brought down the\nhillside by the host of claws.\n\n\"Sir,\" Leone said. \"If it's all right, I'd like to go out there and\ntake a look at him.\"\n\n\"Why?\"\n\n\"Maybe he came with something.\"\n\nScott considered. He shrugged. \"All right. But be careful.\"\n\n\"I have my tab.\" Leone patted the metal band at his wrist. \"I'll be\nout of bounds.\"\n\n       *       *       *       *       *\n\nHe picked up his rifle and stepped carefully up to the mouth of the\nbunker, making his way between blocks of concrete and steel prongs,\ntwisted and bent. The air was cold at the top. He crossed over the\nground toward the remains of the soldier, striding across the soft\nash. A wind blew around him, swirling gray particles up in his face.\nHe squinted and pushed on.\n\nThe claws retreated as he came close, some of them stiffening into\nimmobility. He touched his tab. The Ivan would have given something\nfor that! Short hard radiation emitted from the tab neutralized the\nclaws, put them out of commission. Even the big robot with its two\nwaving eyestalks retreated respectfully as he approached.\n\nHe bent down over the remains of the soldier. The gloved hand was\nclosed tightly. There was something in it. Leone pried the fingers\napart. A sealed container, aluminum. Still shiny.\n\nHe put it in his pocket and made his way back to the bunker. Behind\nhim the claws came back to life, moving into operation again. The\nprocession resumed, metal spheres moving through the gray ash with\ntheir loads. He could hear their treads scrabbling against the ground.\nHe shuddered.\n\nScott watched intently as he brought the shiny tube out of his pocket.\n\"He had that?\"\n\n\"In his hand.\" Leone unscrewed the top. \"Maybe you should look at it,\nsir.\"\n\nScott took it. He emptied the contents out in the palm of his hand. A\nsmall piece of silk paper, carefully folded. He sat down by the light\nand unfolded it.\n\n\"What's it say, sir?\" Eric said. Several officers came up the tunnel.\nMajor Hendricks appeared.\n\n\"Major,\" Scott said. \"Look at this.\"\n\nHendricks read the slip. \"This just come?\"\n\n\"A single runner. Just now.\"\n\n\"Where is he?\" Hendricks asked sharply.\n\n\"The claws got him.\"\n\nMajor Hendricks grunted. \"Here.\" He passed it to his companions. \"I\nthink this is what we've been waiting for. They certainly took their\ntime about it.\"\n\n\"So they want to talk terms,\" Scott said. \"Are we going along with\nthem?\"\n\n\"That's not for us to decide.\" Hendricks sat down. \"Where's the\ncommunications officer? I want the Moon Base.\"\n\nLeone pondered as the communications officer raised the outside\nantenna cautiously, scanning the sky above the bunker for any sign of\na watching Russian ship.\n\n\"Sir,\" Scott said to Hendricks. \"It's sure strange they suddenly came\naround. We've been using the claws for almost a year. Now all of a\nsudden they start to fold.\"\n\n\"Maybe claws have been getting down in their bunkers.\"\n\n\"One of the big ones, the kind with stalks, got into an Ivan bunker\nlast week,\" Eric said. \"It got a whole platoon of them before they got\ntheir lid shut.\"\n\n\"How do you know?\"\n\n\"A buddy told me. The thing came back with--with remains.\"\n\n\"Moon Base, sir,\" the communications officer said.\n\nOn the screen the face of the lunar monitor appeared. His crisp\nuniform contrasted to the uniforms in the bunker. And he was clean\nshaven. \"Moon Base.\"\n\n\"This is forward command L-Whistle. On Terra. Let me have General\nThompson.\"\n\nThe monitor faded. Presently General Thompson's heavy features came\ninto focus. \"What is it, Major?\"\n\n\"Our claws got a single Russian runner with a message. We don't know\nwhether to act on it--there have been tricks like this in the past.\"\n\n\"What's the message?\"\n\n\"The Russians want us to send a single officer on policy level over to\ntheir lines. For a conference. They don't state the nature of the\nconference. They say that matters of--\" He consulted the slip.\n\"--Matters of grave urgency make it advisable that discussion be\nopened between a representative of the UN forces and themselves.\"\n\nHe held the message up to the screen for the general to scan.\nThompson's eyes moved.\n\n\"What should we do?\" Hendricks said.\n\n\"Send a man out.\"\n\n\"You don't think it's a trap?\"\n\n\"It might be. But the location they give for their forward command is\ncorrect. It's worth a try, at any rate.\"\n\n\"I'll send an officer out. And report the results to you as soon as he\nreturns.\"\n\n\"All right, Major.\" Thompson broke the connection. The screen died. Up\nabove, the antenna came slowly down.\n\nHendricks rolled up the paper, deep in thought.\n\n\"I'll go,\" Leone said.\n\n\"They want somebody at policy level.\" Hendricks rubbed his jaw.\n\"Policy level. I haven't been outside in months. Maybe I could use a\nlittle air.\"\n\n\"Don't you think it's risky?\"\n\nHendricks lifted the view sight and gazed into it. The remains of the\nRussian were gone. Only a single claw was in sight. It was folding\nitself back, disappearing into the ash, like a crab. Like some hideous\nmetal crab....\n\n\"That's the only thing that bothers me.\" Hendricks rubbed his wrist.\n\"I know I'm safe as long as I have this on me. But there's something\nabout them. I hate the damn things. I wish we'd never invented them.\nThere's something wrong with them. Relentless little--\"\n\n\"If we hadn't invented them, the Ivans would have.\"\n\nHendricks pushed the sight back. \"Anyhow, it seems to be winning the\nwar. I guess that's good.\"\n\n\"Sounds like you're getting the same jitters as the Ivans.\" Hendricks\nexamined his wrist watch. \"I guess I had better get started, if I want\nto be there before dark.\"\n\n       *       *       *       *       *\n\nHe took a deep breath and then stepped out onto the gray, rubbled\nground. After a minute he lit a cigarette and stood gazing around him.\nThe landscape was dead. Nothing stirred. He could see for miles,\nendless ash and slag, ruins of buildings. A few trees without leaves\nor branches, only the trunks. Above him the eternal rolling clouds of\ngray, drifting between Terra and the sun.\n\nMajor Hendricks went on. Off to the right something scuttled,\nsomething round and metallic. A claw, going lickety-split after\nsomething. Probably after a small animal, a rat. They got rats, too.\nAs a sort of sideline.\n\nHe came to the top of the little hill and lifted his fieldglasses. The\nRussian lines were a few miles ahead of him. They had a forward\ncommand post there. The runner had come from it.\n\nA squat robot with undulating arms passed by him, its arms weaving\ninquiringly. The robot went on its way, disappearing under some\ndebris. Hendricks watched it go. He had never seen that type before.\nThere were getting to be more and more types he had never seen, new\nvarieties and sizes coming up from the underground factories.\n\nHendricks put out his cigarette and hurried on. It was interesting,\nthe use of artificial forms in warfare. How had they got started?\nNecessity. The Soviet Union had gained great initial success, usual\nwith the side that got the war going. Most of North America had been\nblasted off the map. Retaliation was quick in coming, of course. The\nsky was full of circling disc-bombers long before the war began; they\nhad been up there for years. The discs began sailing down all over\nRussia within hours after Washington got it.\n\n       *       *       *       *       *\n\nBut that hadn't helped Washington.\n\nThe American bloc governments moved to the Moon Base the first year.\nThere was not much else to do. Europe was gone; a slag heap with dark\nweeds growing from the ashes and bones. Most of North America was\nuseless; nothing could be planted, no one could live. A few million\npeople kept going up in Canada and down in South America. But during\nthe second year Soviet parachutists began to drop, a few at first,\nthen more and more. They wore the first really effective\nanti-radiation equipment; what was left of American production moved\nto the moon along with the governments.\n\nAll but the troops. The remaining troops stayed behind as best they\ncould, a few thousand here, a platoon there. No one knew exactly where\nthey were; they stayed where they could, moving around at night,\nhiding in ruins, in sewers, cellars, with the rats and snakes. It\nlooked as if the Soviet Union had the war almost won. Except for a\nhandful of projectiles fired off from the moon daily, there was almost\nno weapon in use against them. They came and went as they pleased. The\nwar, for all practical purposes, was over. Nothing effective opposed\nthem.\n\n       *       *       *       *       *\n\nAnd then the first claws appeared. And overnight the complexion of the\nwar changed.\n\nThe claws were awkward, at first. Slow. The Ivans knocked them off\nalmost as fast as they crawled out of their underground tunnels. But\nthen they got better, faster and more cunning. Factories, all on\nTerra, turned them out. Factories a long way under ground, behind the\nSoviet lines, factories that had once made atomic projectiles, now\nalmost forgotten.\n\nThe claws got faster, and they got bigger. New types appeared, some\nwith feelers, some that flew. There were a few jumping kinds.\n\nThe best technicians on the moon were working on designs, making them\nmore and more intricate, more flexible. They became uncanny; the Ivans\nwere having a lot of trouble with them. Some of the little claws were\nlearning to hide themselves, burrowing down into the ash, lying in\nwait.\n\nAnd then they started getting into the Russian bunkers, slipping down\nwhen the lids were raised for air and a look around. One claw inside a\nbunker, a churning sphere of blades and metal--that was enough. And\nwhen one got in others followed. With a weapon like that the war\ncouldn't go on much longer.\n\nMaybe it was already over.\n\nMaybe he was going to hear the news. Maybe the Politburo had decided\nto throw in the sponge. Too bad it had taken so long. Six years. A\nlong time for war like that, the way they had waged it. The automatic\nretaliation discs, spinning down all over Russia, hundreds of\nthousands of them. Bacteria crystals. The Soviet guided missiles,\nwhistling through the air. The chain bombs. And now this, the robots,\nthe claws--\n\nThe claws weren't like other weapons. They were _alive_, from any\npractical standpoint, whether the Governments wanted to admit it or\nnot. They were not machines. They were living things, spinning,\ncreeping, shaking themselves up suddenly from the gray ash and darting\ntoward a man, climbing up him, rushing for his throat. And that was\nwhat they had been designed to do. Their job.\n\nThey did their job well. Especially lately, with the new designs\ncoming up. Now they repaired themselves. They were on their own.\nRadiation tabs protected the UN troops, but if a man lost his tab he\nwas fair game for the claws, no matter what his uniform. Down below\nthe surface automatic machinery stamped them out. Human beings stayed\na long way off. It was too risky; nobody wanted to be around them.\nThey were left to themselves. And they seemed to be doing all right.\nThe new designs were faster, more complex. More efficient.\n\nApparently they had won the war.\n\n       *       *       *       *       *\n\nMajor Hendricks lit a second cigarette. The landscape depressed him.\nNothing but ash and ruins. He seemed to be alone, the only living\nthing in the whole world. To the right the ruins of a town rose up, a\nfew walls and heaps of debris. He tossed the dead match away,\nincreasing his pace. Suddenly he stopped, jerking up his gun, his body\ntense. For a minute it looked like--\n\nFrom behind the shell of a ruined building a figure came, walking\nslowly toward him, walking hesitantly.\n\nHendricks blinked. \"Stop!\"\n\nThe boy stopped. Hendricks lowered his gun. The boy stood silently,\nlooking at him. He was small, not very old. Perhaps eight. But it was\nhard to tell. Most of the kids who remained were stunted. He wore a\nfaded blue sweater, ragged with dirt, and short pants. His hair was\nlong and matted. Brown hair. It hung over his face and around his\nears. He held something in his arms.\n\n\"What's that you have?\" Hendricks said sharply.\n\nThe boy held it out. It was a toy, a bear. A teddy bear. The boy's\neyes were large, but without expression.\n\nHendricks relaxed. \"I don't want it. Keep it.\"\n\nThe boy hugged the bear again.\n\n\"Where do you live?\" Hendricks said.\n\n\"In there.\"\n\n\"The ruins?\"\n\n\"Yes.\"\n\n\"Underground?\"\n\n\"Yes.\"\n\n\"How many are there?\"\n\n\"How--how many?\"\n\n\"How many of you. How big's your settlement?\"\n\nThe boy did not answer.\n\nHendricks frowned. \"You're not all by yourself, are you?\"\n\nThe boy nodded.\n\n\"How do you stay alive?\"\n\n\"There's food.\"\n\n\"What kind of food?\"\n\n\"Different.\"\n\nHendricks studied him. \"How old are you?\"\n\n\"Thirteen.\"\n\n       *       *       *       *       *\n\nIt wasn't possible. Or was it? The boy was thin, stunted. And probably\nsterile. Radiation exposure, years straight. No wonder he was so\nsmall. His arms and legs were like pipecleaners, knobby, and thin.\nHendricks touched the boy's arm. His skin was dry and rough; radiation\nskin. He bent down, looking into the boy's face. There was no\nexpression. Big eyes, big and dark.\n\n\"Are you blind?\" Hendricks said.\n\n\"No. I can see some.\"\n\n\"How do you get away from the claws?\"\n\n\"The claws?\"\n\n\"The round things. That run and burrow.\"\n\n\"I don't understand.\"\n\nMaybe there weren't any claws around. A lot of areas were free. They\ncollected mostly around bunkers, where there were people. The claws\nhad been designed to sense warmth, warmth of living things.\n\n\"You're lucky.\" Hendricks straightened up. \"Well? Which way are you\ngoing? Back--back there?\"\n\n\"Can I come with you?\"\n\n\"With _me_?\" Hendricks folded his arms. \"I'm going a long way. Miles.\nI have to hurry.\" He looked at his watch. \"I have to get there by\nnightfall.\"\n\n\"I want to come.\"\n\nHendricks fumbled in his pack. \"It isn't worth it. Here.\" He tossed\ndown the food cans he had with him. \"You take these and go back.\nOkay?\"\n\nThe boy said nothing.\n\n\"I'll be coming back this way. In a day or so. If you're around here\nwhen I come back you can come along with me. All right?\"\n\n\"I want to go with you now.\"\n\n\"It's a long walk.\"\n\n\"I can walk.\"\n\nHendricks shifted uneasily. It made too good a target, two people\nwalking along. And the boy would slow him down. But he might not come\nback this way. And if the boy were really all alone--\n\n\"Okay. Come along.\"\n\n       *       *       *       *       *\n\nThe boy fell in beside him. Hendricks strode along. The boy walked\nsilently, clutching his teddy bear.\n\n\"What's your name?\" Hendricks said, after a time.\n\n\"David Edward Derring.\"\n\n\"David? What--what happened to your mother and father?\"\n\n\"They died.\"\n\n\"How?\"\n\n\"In the blast.\"\n\n\"How long ago?\"\n\n\"Six years.\"\n\nHendricks slowed down. \"You've been alone six years?\"\n\n\"No. There were other people for awhile. They went away.\"\n\n\"And you've been alone since?\"\n\n\"Yes.\"\n\nHendricks glanced down. The boy was strange, saying very little.\nWithdrawn. But that was the way they were, the children who had\nsurvived. Quiet. Stoic. A strange kind of fatalism gripped them.\nNothing came as a surprise. They accepted anything that came along.\nThere was no longer any _normal_, any natural course of things, moral\nor physical, for them to expect. Custom, habit, all the determining\nforces of learning were gone; only brute experience remained.\n\n\"Am I walking too fast?\" Hendricks said.\n\n\"No.\"\n\n\"How did you happen to see me?\"\n\n\"I was waiting.\"\n\n\"Waiting?\" Hendricks was puzzled. \"What were you waiting for?\"\n\n\"To catch things.\"\n\n\"What kind of things?\"\n\n\"Things to eat.\"\n\n\"Oh.\" Hendricks set his lips grimly. A thirteen year old boy, living\non rats and gophers and half-rotten canned food. Down in a hole under\nthe ruins of a town. With radiation pools and claws, and Russian\ndive-mines up above, coasting around in the sky.\n\n\"Where are we going?\" David asked.\n\n\"To the Russian lines.\"\n\n\"Russian?\"\n\n\"The enemy. The people who started the war. They dropped the first\nradiation bombs. They began all this.\"\n\nThe boy nodded. His face showed no expression.\n\n\"I'm an American,\" Hendricks said.\n\nThere was no comment. On they went, the two of them, Hendricks walking\na little ahead, David trailing behind him, hugging his dirty teddy\nbear against his chest.\n\n       *       *       *       *       *\n\nAbout four in the afternoon they stopped to eat. Hendricks built a\nfire in a hollow between some slabs of concrete. He cleared the weeds\naway and heaped up bits of wood. The Russians' lines were not very far\nahead. Around him was what had once been a long valley, acres of fruit\ntrees and grapes. Nothing remained now but a few bleak stumps and the\nmountains that stretched across the horizon at the far end. And the\nclouds of rolling ash that blew and drifted with the wind, settling\nover the weeds and remains of buildings, walls here and there, once in\nawhile what had been a road.\n\nHendricks made coffee and heated up some boiled mutton and bread.\n\"Here.\" He handed bread and mutton to David. David squatted by the\nedge of the fire, his knees knobby and white. He examined the food and\nthen passed it back, shaking his head.\n\n\"No.\"\n\n\"No? Don't you want any?\"\n\n\"No.\"\n\nHendricks shrugged. Maybe the boy was a mutant, used to special food.\nIt didn't matter. When he was hungry he would find something to eat.\nThe boy was strange. But there were many strange changes coming over\nthe world. Life was not the same, anymore. It would never be the same\nagain. The human race was going to have to realize that.\n\n\"Suit yourself,\" Hendricks said. He ate the bread and mutton by\nhimself, washing it down with coffee. He ate slowly, finding the food\nhard to digest. When he was done he got to his feet and stamped the\nfire out.\n\nDavid rose slowly, watching him with his young-old eyes.\n\n\"We're going,\" Hendricks said.\n\n\"All right.\"\n\nHendricks walked along, his gun in his arms. They were close; he was\ntense, ready for anything. The Russians should be expecting a runner,\nan answer to their own runner, but they were tricky. There was always\nthe possibility of a slipup. He scanned the landscape around him.\nNothing but slag and ash, a few hills, charred trees. Concrete walls.\nBut someplace ahead was the first bunker of the Russian lines, the\nforward command. Underground, buried deep, with only a periscope\nshowing, a few gun muzzles. Maybe an antenna.\n\n\"Will we be there soon?\" David asked.\n\n\"Yes. Getting tired?\"\n\n\"No.\"\n\n\"Why, then?\"\n\nDavid did not answer. He plodded carefully along behind, picking his\nway over the ash. His legs and shoes were gray with dust. His pinched\nface was streaked, lines of gray ash in riverlets down the pale white\nof his skin. There was no color to his face. Typical of the new\nchildren, growing up in cellars and sewers and underground shelters.\n\n       *       *       *       *       *\n\nHendricks slowed down. He lifted his fieldglasses and studied the\nground ahead of him. Were they there, someplace, waiting for him?\nWatching him, the way his men had watched the Russian runner? A chill\nwent up his back. Maybe they were getting their guns ready, preparing\nto fire, the way his men had prepared, made ready to kill.\n\nHendricks stopped, wiping perspiration from his face. \"Damn.\" It made\nhim uneasy. But he should be expected. The situation was different.\n\nHe strode over the ash, holding his gun tightly with both hands.\nBehind him came David. Hendricks peered around, tight-lipped. Any\nsecond it might happen. A burst of white light, a blast, carefully\naimed from inside a deep concrete bunker.\n\nHe raised his arm and waved it around in a circle.\n\nNothing moved. To the right a long ridge ran, topped with dead tree\ntrunks. A few wild vines had grown up around the trees, remains of\narbors. And the eternal dark weeds. Hendricks studied the ridge. Was\nanything up there? Perfect place for a lookout. He approached the\nridge warily, David coming silently behind. If it were his command\nhe'd have a sentry up there, watching for troops trying to infiltrate\ninto the command area. Of course, if it were his command there would\nbe the claws around the area for full protection.\n\nHe stopped, feet apart, hands on his hips.\n\n\"Are we there?\" David said.\n\n\"Almost.\"\n\n\"Why have we stopped?\"\n\n\"I don't want to take any chances.\" Hendricks advanced slowly. Now the\nridge lay directly beside him, along his right. Overlooking him. His\nuneasy feeling increased. If an Ivan were up there he wouldn't have a\nchance. He waved his arm again. They should be expecting someone in\nthe UN uniform, in response to the note capsule. Unless the whole\nthing was a trap.\n\n\"Keep up with me.\" He turned toward David. \"Don't drop behind.\"\n\n\"With you?\"\n\n\"Up beside me! We're close. We can't take any chances. Come on.\"\n\n\"I'll be all right.\" David remained behind him, in the rear, a few\npaces away, still clutching his teddy bear.\n\n\"Have it your way.\" Hendricks raised his glasses again, suddenly\ntense. For a moment--had something moved? He scanned the ridge\ncarefully. Everything was silent. Dead. No life up there, only tree\ntrunks and ash. Maybe a few rats. The big black rats that had survived\nthe claws. Mutants--built their own shelters out of saliva and ash.\nSome kind of plaster. Adaptation. He started forward again.\n\n       *       *       *       *       *\n\nA tall figure came out on the ridge above him, cloak flapping.\nGray-green. A Russian. Behind him a second soldier appeared, another\nRussian. Both lifted their guns, aiming.\n\nHendricks froze. He opened his mouth. The soldiers were kneeling,\nsighting down the side of the slope. A third figure had joined them on\nthe ridge top, a smaller figure in gray-green. A woman. She stood\nbehind the other two.\n\nHendricks found his voice. \"Stop!\" He waved up at them frantically.\n\"I'm--\"\n\nThe two Russians fired. Behind Hendricks there was a faint _pop_.\nWaves of heat lapped against him, throwing him to the ground. Ash tore\nat his face, grinding into his eyes and nose. Choking, he pulled\nhimself to his knees. It was all a trap. He was finished. He had come\nto be killed, like a steer. The soldiers and the woman were coming\ndown the side of the ridge toward him, sliding down through the soft\nash. Hendricks was numb. His head throbbed. Awkwardly, he got his\nrifle up and took aim. It weighed a thousand tons; he could hardly\nhold it. His nose and cheeks stung. The air was full of the blast\nsmell, a bitter acrid stench.\n\n\"Don't fire,\" the first Russian said, in heavily accented English.\n\nThe three of them came up to him, surrounding him. \"Put down your\nrifle, Yank,\" the other said.\n\nHendricks was dazed. Everything had happened so fast. He had been\ncaught. And they had blasted the boy. He turned his head. David was\ngone. What remained of him was strewn across the ground.\n\nThe three Russians studied him curiously. Hendricks sat, wiping blood\nfrom his nose, picking out bits of ash. He shook his head, trying to\nclear it. \"Why did you do it?\" he murmured thickly. \"The boy.\"\n\n\"Why?\" One of the soldiers helped him roughly to his feet. He turned\nHendricks around. \"Look.\"\n\nHendricks closed his eyes.\n\n\"Look!\" The two Russians pulled him forward. \"See. Hurry up. There\nisn't much time to spare, Yank!\"\n\nHendricks looked. And gasped.\n\n\"See now? Now do you understand?\"\n\n       *       *       *       *       *\n\nFrom the remains of David a metal wheel rolled. Relays, glinting\nmetal. Parts, wiring. One of the Russians kicked at the heap of\nremains. Parts popped out, rolling away, wheels and springs and rods.\nA plastic section fell in, half charred. Hendricks bent shakily down.\nThe front of the head had come off. He could make out the intricate\nbrain, wires and relays, tiny tubes and switches, thousands of minute\nstuds--\n\n\"A robot,\" the soldier holding his arm said. \"We watched it tagging\nyou.\"\n\n\"Tagging me?\"\n\n\"That's their way. They tag along with you. Into the bunker. That's\nhow they get in.\"\n\nHendricks blinked, dazed. \"But--\"\n\n\"Come on.\" They led him toward the ridge. \"We can't stay here. It\nisn't safe. There must be hundreds of them all around here.\"\n\nThe three of them pulled him up the side of the ridge, sliding and\nslipping on the ash. The woman reached the top and stood waiting for\nthem.\n\n\"The forward command,\" Hendricks muttered. \"I came to negotiate with\nthe Soviet--\"\n\n\"There is no more forward command. _They_ got in. We'll explain.\" They\nreached the top of the ridge. \"We're all that's left. The three of us.\nThe rest were down in the bunker.\"\n\n\"This way. Down this way.\" The woman unscrewed a lid, a gray manhole\ncover set in the ground. \"Get in.\"\n\nHendricks lowered himself. The two soldiers and the woman came behind\nhim, following him down the ladder. The woman closed the lid after\nthem, bolting it tightly into place.\n\n\"Good thing we saw you,\" one of the two soldiers grunted. \"It had\ntagged you about as far as it was going to.\"\n\n       *       *       *       *       *\n\n\"Give me one of your cigarettes,\" the woman said. \"I haven't had an\nAmerican cigarette for weeks.\"\n\nHendricks pushed the pack to her. She took a cigarette and passed the\npack to the two soldiers. In the corner of the small room the lamp\ngleamed fitfully. The room was low-ceilinged, cramped. The four of\nthem sat around a small wood table. A few dirty dishes were stacked to\none side. Behind a ragged curtain a second room was partly visible.\nHendricks saw the corner of a cot, some blankets, clothes hung on a\nhook.\n\n\"We were here,\" the soldier beside him said. He took off his helmet,\npushing his blond hair back. \"I'm Corporal Rudi Maxer. Polish.\nImpressed in the Soviet Army two years ago.\" He held out his hand.\n\nHendricks hesitated and then shook. \"Major Joseph Hendricks.\"\n\n\"Klaus Epstein.\" The other soldier shook with him, a small dark man\nwith thinning hair. Epstein plucked nervously at his ear. \"Austrian.\nImpressed God knows when. I don't remember. The three of us were here,\nRudi and I, with Tasso.\" He indicated the woman. \"That's how we\nescaped. All the rest were down in the bunker.\"\n\n\"And--and _they_ got in?\"\n\nEpstein lit a cigarette. \"First just one of them. The kind that tagged\nyou. Then it let others in.\"\n\nHendricks became alert. \"The _kind_? Are there more than one kind?\"\n\n\"The little boy. David. David holding his teddy bear. That's Variety\nThree. The most effective.\"\n\n\"What are the other types?\"\n\nEpstein reached into his coat. \"Here.\" He tossed a packet of\nphotographs onto the table, tied with a string. \"Look for yourself.\"\n\nHendricks untied the string.\n\n\"You see,\" Rudi Maxer said, \"that was why we wanted to talk terms. The\nRussians, I mean. We found out about a week ago. Found out that your\nclaws were beginning to make up new designs on their own. New types of\ntheir own. Better types. Down in your underground factories behind our\nlines. You let them stamp themselves, repair themselves. Made them\nmore and more intricate. It's your fault this happened.\"\n\n       *       *       *       *       *\n\nHendricks examined the photos. They had been snapped hurriedly; they\nwere blurred and indistinct. The first few showed--David. David\nwalking along a road, by himself. David and another David. Three\nDavids. All exactly alike. Each with a ragged teddy bear.\n\nAll pathetic.\n\n\"Look at the others,\" Tasso said.\n\nThe next pictures, taken at a great distance, showed a towering\nwounded soldier sitting by the side of a path, his arm in a sling, the\nstump of one leg extended, a crude crutch on his lap. Then two wounded\nsoldiers, both the same, standing side by side.\n\n\"That's Variety One. The Wounded Soldier.\" Klaus reached out and took\nthe pictures. \"You see, the claws were designed to get to human\nbeings. To find them. Each kind was better than the last. They got\nfarther, closer, past most of our defenses, into our lines. But as\nlong as they were merely _machines_, metal spheres with claws and\nhorns, feelers, they could be picked off like any other object. They\ncould be detected as lethal robots as soon as they were seen. Once we\ncaught sight of them--\"\n\n\"Variety One subverted our whole north wing,\" Rudi said. \"It was a\nlong time before anyone caught on. Then it was too late. They came in,\nwounded soldiers, knocking and begging to be let in. So we let them\nin. And as soon as they were in they took over. We were watching out\nfor machines....\"\n\n\"At that time it was thought there was only the one type,\" Klaus\nEpstein said. \"No one suspected there were other types. The pictures\nwere flashed to us. When the runner was sent to you, we knew of just\none type. Variety One. The big Wounded Soldier. We thought that was\nall.\"\n\n\"Your line fell to--\"\n\n\"To Variety Three. David and his bear. That worked even better.\" Klaus\nsmiled bitterly. \"Soldiers are suckers for children. We brought them\nin and tried to feed them. We found out the hard way what they were\nafter. At least, those who were in the bunker.\"\n\n\"The three of us were lucky,\" Rudi said. \"Klaus and I were--were\nvisiting Tasso when it happened. This is her place.\" He waved a big\nhand around. \"This little cellar. We finished and climbed the ladder\nto start back. From the ridge we saw. There they were, all around the\nbunker. Fighting was still going on. David and his bear. Hundreds of\nthem. Klaus took the pictures.\"\n\nKlaus tied up the photographs again.\n\n       *       *       *       *       *\n\n\"And it's going on all along your line?\" Hendricks said.\n\n\"Yes.\"\n\n\"How about _our_ lines?\" Without thinking, he touched the tab on his\narm. \"Can they--\"\n\n\"They're not bothered by your radiation tabs. It makes no difference\nto them, Russian, American, Pole, German. It's all the same. They're\ndoing what they were designed to do. Carrying out the original idea.\nThey track down life, wherever they find it.\"\n\n\"They go by warmth,\" Klaus said. \"That was the way you constructed\nthem from the very start. Of course, those you designed were kept back\nby the radiation tabs you wear. Now they've got around that. These new\nvarieties are lead-lined.\"\n\n\"What's the other variety?\" Hendricks asked. \"The David type, the\nWounded Soldier--what's the other?\"\n\n\"We don't know.\" Klaus pointed up at the wall. On the wall were two\nmetal plates, ragged at the edges. Hendricks got up and studied them.\nThey were bent and dented.\n\n\"The one on the left came off a Wounded Soldier,\" Rudi said. \"We got\none of them. It was going along toward our old bunker. We got it from\nthe ridge, the same way we got the David tagging you.\"\n\nThe plate was stamped: I-V. Hendricks touched the other plate. \"And\nthis came from the David type?\"\n\n\"Yes.\" The plate was stamped: III-V.\n\nKlaus took a look at them, leaning over Hendricks' broad shoulder.\n\"You can see what we're up against. There's another type. Maybe it was\nabandoned. Maybe it didn't work. But there must be a Second Variety.\nThere's One and Three.\"\n\n\"You were lucky,\" Rudi said. \"The David tagged you all the way here\nand never touched you. Probably thought you'd get it into a bunker,\nsomewhere.\"\n\n\"One gets in and it's all over,\" Klaus said. \"They move fast. One lets\nall the rest inside. They're inflexible. Machines with one purpose.\nThey were built for only one thing.\" He rubbed sweat from his lip. \"We\nsaw.\"\n\nThey were silent.\n\n\"Let me have another cigarette, Yank,\" Tasso said. \"They are good. I\nalmost forgot how they were.\"\n\n       *       *       *       *       *\n\nIt was night. The sky was black. No stars were visible through the\nrolling clouds of ash. Klaus lifted the lid cautiously so that\nHendricks could look out.\n\nRudi pointed into the darkness. \"Over that way are the bunkers. Where\nwe used to be. Not over half a mile from us. It was just chance Klaus\nand I were not there when it happened. Weakness. Saved by our lusts.\"\n\n\"All the rest must be dead,\" Klaus said in a low voice. \"It came\nquickly. This morning the Politburo reached their decision. They\nnotified us--forward command. Our runner was sent out at once. We saw\nhim start toward the direction of your lines. We covered him until he\nwas out of sight.\"\n\n\"Alex Radrivsky. We both knew him. He disappeared about six o'clock.\nThe sun had just come up. About noon Klaus and I had an hour relief.\nWe crept off, away from the bunkers. No one was watching. We came\nhere. There used to be a town here, a few houses, a street. This\ncellar was part of a big farmhouse. We knew Tasso would be here,\nhiding down in her little place. We had come here before. Others from\nthe bunkers came here. Today happened to be our turn.\"\n\n\"So we were saved,\" Klaus said. \"Chance. It might have been others.\nWe--we finished, and then we came up to the surface and started back\nalong the ridge. That was when we saw them, the Davids. We understood\nright away. We had seen the photos of the First Variety, the Wounded\nSoldier. Our Commissar distributed them to us with an explanation. If\nwe had gone another step they would have seen us. As it was we had to\nblast two Davids before we got back. There were hundreds of them, all\naround. Like ants. We took pictures and slipped back here, bolting the\nlid tight.\"\n\n\"They're not so much when you catch them alone. We moved faster than\nthey did. But they're inexorable. Not like living things. They came\nright at us. And we blasted them.\"\n\nMajor Hendricks rested against the edge of the lid, adjusting his eyes\nto the darkness. \"Is it safe to have the lid up at all?\"\n\n\"If we're careful. How else can you operate your transmitter?\"\n\nHendricks lifted the small belt transmitter slowly. He pressed it\nagainst his ear. The metal was cold and damp. He blew against the\nmike, raising up the short antenna. A faint hum sounded in his ear.\n\"That's true, I suppose.\"\n\nBut he still hesitated.\n\n\"We'll pull you under if anything happens,\" Klaus said.\n\n\"Thanks.\" Hendricks waited a moment, resting the transmitter against\nhis shoulder. \"Interesting, isn't it?\"\n\n\"What?\"\n\n\"This, the new types. The new varieties of claws. We're completely at\ntheir mercy, aren't we? By now they've probably gotten into the UN\nlines, too. It makes me wonder if we're not seeing the beginning of a\nnow species. _The_ new species. Evolution. The race to come after\nman.\"\n\n       *       *       *       *       *\n\nRudi grunted. \"There is no race after man.\"\n\n\"No? Why not? Maybe we're seeing it now, the end of human beings, the\nbeginning of the new society.\"\n\n\"They're not a race. They're mechanical killers. You made them to\ndestroy. That's all they can do. They're machines with a job.\"\n\n\"So it seems now. But how about later on? After the war is over.\nMaybe, when there aren't any humans to destroy, their real\npotentialities will begin to show.\"\n\n\"You talk as if they were alive!\"\n\n\"Aren't they?\"\n\nThere was silence. \"They're machines,\" Rudi said. \"They look like\npeople, but they're machines.\"\n\n\"Use your transmitter, Major,\" Klaus said. \"We can't stay up here\nforever.\"\n\nHolding the transmitter tightly Hendricks called the code of the\ncommand bunker. He waited, listening. No response. Only silence. He\nchecked the leads carefully. Everything was in place.\n\n\"Scott!\" he said into the mike. \"Can you hear me?\"\n\nSilence. He raised the gain up full and tried again. Only static.\n\n\"I don't get anything. They may hear me but they may not want to\nanswer.\"\n\n\"Tell them it's an emergency.\"\n\n\"They'll think I'm being forced to call. Under your direction.\" He\ntried again, outlining briefly what he had learned. But still the\nphone was silent, except for the faint static.\n\n\"Radiation pools kill most transmission,\" Klaus said, after awhile.\n\"Maybe that's it.\"\n\nHendricks shut the transmitter up. \"No use. No answer. Radiation\npools? Maybe. Or they hear me, but won't answer. Frankly, that's what\nI would do, if a runner tried to call from the Soviet lines. They have\nno reason to believe such a story. They may hear everything I say--\"\n\n\"Or maybe it's too late.\"\n\nHendricks nodded.\n\n\"We better get the lid down,\" Rudi said nervously. \"We don't want to\ntake unnecessary chances.\"\n\n       *       *       *       *       *\n\nThey climbed slowly back down the tunnel. Klaus bolted the lid\ncarefully into place. They descended into the kitchen. The air was\nheavy and close around them.\n\n\"Could they work that fast?\" Hendricks said. \"I left the bunker this\nnoon. Ten hours ago. How could they move so quickly?\"\n\n\"It doesn't take them long. Not after the first one gets in. It goes\nwild. You know what the little claws can do. Even _one_ of these is\nbeyond belief. Razors, each finger. Maniacal.\"\n\n\"All right.\" Hendricks moved away impatiently. He stood with his back\nto them.\n\n\"What's the matter?\" Rudi said.\n\n\"The Moon Base. God, if they've gotten there--\"\n\n\"The Moon Base?\"\n\nHendricks turned around. \"They couldn't have got to the Moon Base. How\nwould they get there? It isn't possible. I can't believe it.\"\n\n\"What is this Moon Base? We've heard rumors, but nothing definite.\nWhat is the actual situation? You seem concerned.\"\n\n\"We're supplied from the moon. The governments are there, under the\nlunar surface. All our people and industries. That's what keeps us\ngoing. If they should find some way of getting off Terra, onto the\nmoon--\"\n\n\"It only takes one of them. Once the first one gets in it admits the\nothers. Hundreds of them, all alike. You should have seen them.\nIdentical. Like ants.\"\n\n\"Perfect socialism,\" Tasso said. \"The ideal of the communist state.\nAll citizens interchangeable.\"\n\nKlaus grunted angrily. \"That's enough. Well? What next?\"\n\nHendricks paced back and forth, around the small room. The air was\nfull of smells of food and perspiration. The others watched him.\nPresently Tasso pushed through the curtain, into the other room. \"I'm\ngoing to take a nap.\"\n\nThe curtain closed behind her. Rudi and Klaus sat down at the table,\nstill watching Hendricks.\n\n\"It's up to you,\" Klaus said. \"We don't know your situation.\"\n\nHendricks nodded.\n\n\"It's a problem.\" Rudi drank some coffee, filling his cup from a rusty\npot. \"We're safe here for awhile, but we can't stay here forever. Not\nenough food or supplies.\"\n\n\"But if we go outside--\"\n\n\"If we go outside they'll get us. Or probably they'll get us. We\ncouldn't go very far. How far is your command bunker, Major?\"\n\n\"Three or four miles.\"\n\n\"We might make it. The four of us. Four of us could watch all sides.\nThey couldn't slip up behind us and start tagging us. We have three\nrifles, three blast rifles. Tasso can have my pistol.\" Rudi tapped his\nbelt. \"In the Soviet army we didn't have shoes always, but we had\nguns. With all four of us armed one of us might get to your command\nbunker. Preferably you, Major.\"\n\n\"What if they're already there?\" Klaus said.\n\nRudi shrugged. \"Well, then we come back here.\"\n\n       *       *       *       *       *\n\nHendricks stopped pacing. \"What do you think the chances are they're\nalready in the American lines?\"\n\n\"Hard to say. Fairly good. They're organized. They know exactly what\nthey're doing. Once they start they go like a horde of locusts. They\nhave to keep moving, and fast. It's secrecy and speed they depend on.\nSurprise. They push their way in before anyone has any idea.\"\n\n\"I see,\" Hendricks murmured.\n\nFrom the other room Tasso stirred. \"Major?\"\n\nHendricks pushed the curtain back. \"What?\"\n\n[Illustration]\n\nTasso looked up at him lazily from the cot. \"Have you any more\nAmerican cigarettes left?\"\n\nHendricks went into the room and sat down across from her, on a wood\nstool. He felt in his pockets. \"No. All gone.\"\n\n\"Too bad.\"\n\n\"What nationality are you?\" Hendricks asked after awhile.\n\n\"Russian.\"\n\n\"How did you get here?\"\n\n\"Here?\"\n\n\"This used to be France. This was part of Normandy. Did you come with\nthe Soviet army?\"\n\n\"Why?\"\n\n\"Just curious.\" He studied her. She had taken off her coat, tossing it\nover the end of the cot. She was young, about twenty. Slim. Her long\nhair stretched out over the pillow. She was staring at him silently,\nher eyes dark and large.\n\n\"What's on your mind?\" Tasso said.\n\n\"Nothing. How old are you?\"\n\n\"Eighteen.\" She continued to watch him, unblinking, her arms behind\nher head. She had on Russian army pants and shirt. Gray-green. Thick\nleather belt with counter and cartridges. Medicine kit.\n\n\"You're in the Soviet army?\"\n\n\"No.\"\n\n\"Where did you get the uniform?\"\n\nShe shrugged. \"It was given to me,\" she told him.\n\n\"How--how old were you when you came here?\"\n\n\"Sixteen.\"\n\n\"That young?\"\n\nHer eyes narrowed. \"What do you mean?\"\n\n       *       *       *       *       *\n\nHendricks rubbed his jaw. \"Your life would have been a lot different\nif there had been no war. Sixteen. You came here at sixteen. To live\nthis way.\"\n\n\"I had to survive.\"\n\n\"I'm not moralizing.\"\n\n\"Your life would have been different, too,\" Tasso murmured. She\nreached down and unfastened one of her boots. She kicked the boot off,\nonto the floor. \"Major, do you want to go in the other room? I'm\nsleepy.\"\n\n\"It's going to be a problem, the four of us here. It's going to be\nhard to live in these quarters. Are there just the two rooms?\"\n\n\"Yes.\"\n\n\"How big was the cellar originally? Was it larger than this? Are there\nother rooms filled up with debris? We might be able to open one of\nthem.\"\n\n\"Perhaps. I really don't know.\" Tasso loosened her belt. She made\nherself comfortable on the cot, unbuttoning her shirt. \"You're sure\nyou have no more cigarettes?\"\n\n\"I had only the one pack.\"\n\n\"Too bad. Maybe if we get back to your bunker we can find some.\" The\nother boot fell. Tasso reached up for the light cord. \"Good night.\"\n\n\"You're going to sleep?\"\n\n\"That's right.\"\n\nThe room plunged into darkness. Hendricks got up and made his way past\nthe curtain, into the kitchen.\n\nAnd stopped, rigid.\n\nRudi stood against the wall, his face white and gleaming. His mouth\nopened and closed but no sounds came. Klaus stood in front of him, the\nmuzzle of his pistol in Rudi's stomach. Neither of them moved. Klaus,\nhis hand tight around his gun, his features set. Rudi, pale and\nsilent, spread-eagled against the wall.\n\n\"What--\" Hendricks muttered, but Klaus cut him off.\n\n\"Be quiet, Major. Come over here. Your gun. Get out your gun.\"\n\nHendricks drew his pistol. \"What is it?\"\n\n\"Cover him.\" Klaus motioned him forward. \"Beside me. Hurry!\"\n\nRudi moved a little, lowering his arms. He turned to Hendricks,\nlicking his lips. The whites of his eyes shone wildly. Sweat dripped\nfrom his forehead, down his cheeks. He fixed his gaze on Hendricks.\n\"Major, he's gone insane. Stop him.\" Rudi's voice was thin and hoarse,\nalmost inaudible.\n\n\"What's going on?\" Hendricks demanded.\n\nWithout lowering his pistol Klaus answered. \"Major, remember our\ndiscussion? The Three Varieties? We knew about One and Three. But we\ndidn't know about Two. At least, we didn't know before.\" Klaus'\nfingers tightened around the gun butt. \"We didn't know before, but we\nknow now.\"\n\nHe pressed the trigger. A burst of white heat rolled out of the gun,\nlicking around Rudi.\n\n\"Major, this is the Second Variety.\"\n\n       *       *       *       *       *\n\nTasso swept the curtain aside. \"Klaus! What did you do?\"\n\nKlaus turned from the charred form, gradually sinking down the wall\nonto the floor. \"The Second Variety, Tasso. Now we know. We have all\nthree types identified. The danger is less. I--\"\n\nTasso stared past him at the remains of Rudi, at the blackened,\nsmouldering fragments and bits of cloth. \"You killed him.\"\n\n\"Him? _It_, you mean. I was watching. I had a feeling, but I wasn't\nsure. At least, I wasn't sure before. But this evening I was certain.\"\nKlaus rubbed his pistol butt nervously. \"We're lucky. Don't you\nunderstand? Another hour and it might--\"\n\n\"You were _certain_?\" Tasso pushed past him and bent down, over the\nsteaming remains on the floor. Her face became hard. \"Major, see for\nyourself. Bones. Flesh.\"\n\nHendricks bent down beside her. The remains were human remains. Seared\nflesh, charred bone fragments, part of a skull. Ligaments, viscera,\nblood. Blood forming a pool against the wall.\n\n\"No wheels,\" Tasso said calmly. She straightened up. \"No wheels, no\nparts, no relays. Not a claw. Not the Second Variety.\" She folded her\narms. \"You're going to have to be able to explain this.\"\n\nKlaus sat down at the table, all the color drained suddenly from his\nface. He put his head in his hands and rocked back and forth.\n\n\"Snap out of it.\" Tasso's fingers closed over his shoulder. \"Why did\nyou do it? Why did you kill him?\"\n\n\"He was frightened,\" Hendricks said. \"All this, the whole thing,\nbuilding up around us.\"\n\n\"Maybe.\"\n\n\"What, then? What do you think?\"\n\n\"I think he may have had a reason for killing Rudi. A good reason.\"\n\n\"What reason?\"\n\n\"Maybe Rudi learned something.\"\n\nHendricks studied her bleak face. \"About what?\" he asked.\n\n\"About him. About Klaus.\"\n\n       *       *       *       *       *\n\nKlaus looked up quickly. \"You can see what she's trying to say. She\nthinks I'm the Second Variety. Don't you see, Major? Now she wants you\nto believe I killed him on purpose. That I'm--\"\n\n\"Why did you kill him, then?\" Tasso said.\n\n\"I told you.\" Klaus shook his head wearily. \"I thought he was a claw.\nI thought I knew.\"\n\n\"Why?\"\n\n\"I had been watching him. I was suspicious.\"\n\n\"Why?\"\n\n\"I thought I had seen something. Heard something. I thought I--\" He\nstopped.\n\n\"Go on.\"\n\n\"We were sitting at the table. Playing cards. You two were in the\nother room. It was silent. I thought I heard him--_whirr_.\"\n\nThere was silence.\n\n\"Do you believe that?\" Tasso said to Hendricks.\n\n\"Yes. I believe what he says.\"\n\n\"I don't. I think he killed Rudi for a good purpose.\" Tasso touched\nthe rifle, resting in the corner of the room. \"Major--\"\n\n\"No.\" Hendricks shook his head. \"Let's stop it right now. One is\nenough. We're afraid, the way he was. If we kill him we'll be doing\nwhat he did to Rudi.\"\n\nKlaus looked gratefully up at him. \"Thanks. I was afraid. You\nunderstand, don't you? Now she's afraid, the way I was. She wants to\nkill me.\"\n\n\"No more killing.\" Hendricks moved toward the end of the ladder. \"I'm\ngoing above and try the transmitter once more. If I can't get them\nwe're moving back toward my lines tomorrow morning.\"\n\nKlaus rose quickly. \"I'll come up with you and give you a hand.\"\n\n       *       *       *       *       *\n\nThe night air was cold. The earth was cooling off. Klaus took a deep\nbreath, filling his lungs. He and Hendricks stepped onto the ground,\nout of the tunnel. Klaus planted his feet wide apart, the rifle up,\nwatching and listening. Hendricks crouched by the tunnel mouth, tuning\nthe small transmitter.\n\n\"Any luck?\" Klaus asked presently.\n\n\"Not yet.\"\n\n\"Keep trying. Tell them what happened.\"\n\nHendricks kept trying. Without success. Finally he lowered the\nantenna. \"It's useless. They can't hear me. Or they hear me and won't\nanswer. Or--\"\n\n\"Or they don't exist.\"\n\n\"I'll try once more.\" Hendricks raised the antenna. \"Scott, can you\nhear me? Come in!\"\n\nHe listened. There was only static. Then, still very faintly--\n\n\"This is Scott.\"\n\nHis fingers tightened. \"Scott! Is it you?\"\n\n\"This is Scott.\"\n\nKlaus squatted down. \"Is it your command?\"\n\n\"Scott, listen. Do you understand? About them, the claws. Did you get\nmy message? Did you hear me?\"\n\n\"Yes.\" Faintly. Almost inaudible. He could hardly make out the word.\n\n\"You got my message? Is everything all right at the bunker? None of\nthem have got in?\"\n\n\"Everything is all right.\"\n\n\"Have they tried to get in?\"\n\nThe voice was weaker.\n\n\"No.\"\n\nHendricks turned to Klaus. \"They're all right.\"\n\n\"Have they been attacked?\"\n\n\"No.\" Hendricks pressed the phone tighter to his ear. \"Scott, I can\nhardly hear you. Have you notified the Moon Base? Do they know? Are\nthey alerted?\"\n\nNo answer.\n\n\"Scott! Can you hear me?\"\n\nSilence.\n\nHendricks relaxed, sagging. \"Faded out. Must be radiation pools.\"\n\n       *       *       *       *       *\n\nHendricks and Klaus looked at each other. Neither of them said\nanything. After a time Klaus said, \"Did it sound like any of your men?\nCould you identify the voice?\"\n\n\"It was too faint.\"\n\n\"You couldn't be certain?\"\n\n\"No.\"\n\n\"Then it could have been--\"\n\n\"I don't know. Now I'm not sure. Let's go back down and get the lid\nclosed.\"\n\nThey climbed back down the ladder slowly, into the warm cellar. Klaus\nbolted the lid behind them. Tasso waited for them, her face\nexpressionless.\n\n\"Any luck?\" she asked.\n\nNeither of them answered. \"Well?\" Klaus said at last. \"What do you\nthink, Major? Was it your officer, or was it one of _them_?\"\n\n\"I don't know.\"\n\n\"Then we're just where we were before.\"\n\nHendricks stared down at the floor, his jaw set. \"We'll have to go. To\nbe sure.\"\n\n\"Anyhow, we have food here for only a few weeks. We'd have to go up\nafter that, in any case.\"\n\n\"Apparently so.\"\n\n\"What's wrong?\" Tasso demanded. \"Did you get across to your bunker?\nWhat's the matter?\"\n\n\"It may have been one of my men,\" Hendricks said slowly. \"Or it may\nhave been one of _them_. But we'll never know standing here.\" He\nexamined his watch. \"Let's turn in and get some sleep. We want to be\nup early tomorrow.\"\n\n\"Early?\"\n\n\"Our best chance to get through the claws should be early in the\nmorning,\" Hendricks said.\n\n       *       *       *       *       *\n\nThe morning was crisp and clear. Major Hendricks studied the\ncountryside through his fieldglasses.\n\n\"See anything?\" Klaus said.\n\n\"No.\"\n\n\"Can you make out our bunkers?\"\n\n\"Which way?\"\n\n\"Here.\" Klaus took the glasses and adjusted them. \"I know where to\nlook.\" He looked a long time, silently.\n\nTasso came to the top of the tunnel and stepped up onto the ground.\n\"Anything?\"\n\n\"No.\" Klaus passed the glasses back to Hendricks. \"They're out of\nsight. Come on. Let's not stay here.\"\n\nThe three of them made their way down the side of the ridge, sliding\nin the soft ash. Across a flat rock a lizard scuttled. They stopped\ninstantly, rigid.\n\n\"What was it?\" Klaus muttered.\n\n\"A lizard.\"\n\nThe lizard ran on, hurrying through the ash. It was exactly the same\ncolor as the ash.\n\n\"Perfect adaptation,\" Klaus said. \"Proves we were right. Lysenko, I\nmean.\"\n\nThey reached the bottom of the ridge and stopped, standing close\ntogether, looking around them.\n\n\"Let's go.\" Hendricks started off. \"It's a good long trip, on foot.\"\n\nKlaus fell in beside him. Tasso walked behind, her pistol held\nalertly. \"Major, I've been meaning to ask you something,\" Klaus said.\n\"How did you run across the David? The one that was tagging you.\"\n\n\"I met it along the way. In some ruins.\"\n\n\"What did it say?\"\n\n\"Not much. It said it was alone. By itself.\"\n\n\"You couldn't tell it was a machine? It talked like a living person?\nYou never suspected?\"\n\n\"It didn't say much. I noticed nothing unusual.\n\n\"It's strange, machines so much like people that you can be fooled.\nAlmost alive. I wonder where it'll end.\"\n\n\"They're doing what you Yanks designed them to do,\" Tasso said. \"You\ndesigned them to hunt out life and destroy. Human life. Wherever they\nfind it.\"\n\n       *       *       *       *       *\n\nHendricks was watching Klaus intently. \"Why did you ask me? What's on\nyour mind?\"\n\n\"Nothing,\" Klaus answered.\n\n\"Klaus thinks you're the Second Variety,\" Tasso said calmly, from\nbehind them. \"Now he's got his eye on you.\"\n\nKlaus flushed. \"Why not? We sent a runner to the Yank lines and he\ncomes back. Maybe he thought he'd find some good game here.\"\n\nHendricks laughed harshly. \"I came from the UN bunkers. There were\nhuman beings all around me.\"\n\n\"Maybe you saw an opportunity to get into the Soviet lines. Maybe you\nsaw your chance. Maybe you--\"\n\n\"The Soviet lines had already been taken over. Your lines had been\ninvaded before I left my command bunker. Don't forget that.\"\n\nTasso came up beside him. \"That proves nothing at all, Major.\"\n\n\"Why not?\"\n\n\"There appears to be little communication between the varieties. Each\nis made in a different factory. They don't seem to work together. You\nmight have started for the Soviet lines without knowing anything about\nthe work of the other varieties. Or even what the other varieties were\nlike.\"\n\n\"How do you know so much about the claws?\" Hendricks said.\n\n\"I've seen them. I've observed them. I observed them take over the\nSoviet bunkers.\"\n\n\"You know quite a lot,\" Klaus said. \"Actually, you saw very little.\nStrange that you should have been such an acute observer.\"\n\nTasso laughed. \"Do you suspect me, now?\"\n\n\"Forget it,\" Hendricks said. They walked on in silence.\n\n\"Are we going the whole way on foot?\" Tasso said, after awhile. \"I'm\nnot used to walking.\" She gazed around at the plain of ash, stretching\nout on all sides of them, as far as they could see. \"How dreary.\"\n\n\"It's like this all the way,\" Klaus said.\n\n\"In a way I wish you had been in your bunker when the attack came.\"\n\n\"Somebody else would have been with you, if not me,\" Klaus muttered.\n\nTasso laughed, putting her hands in her pockets. \"I suppose so.\"\n\nThey walked on, keeping their eyes on the vast plain of silent ash\naround them.\n\n       *       *       *       *       *\n\nThe sun was setting. Hendricks made his way forward slowly, waving\nTasso and Klaus back. Klaus squatted down, resting his gun butt\nagainst the ground.\n\nTasso found a concrete slab and sat down with a sigh. \"It's good to\nrest.\"\n\n\"Be quiet,\" Klaus said sharply.\n\nHendricks pushed up to the top of the rise ahead of them. The same\nrise the Russian runner had come up, the day before. Hendricks dropped\ndown, stretching himself out, peering through his glasses at what lay\nbeyond.\n\nNothing was visible. Only ash and occasional trees. But there, not\nmore than fifty yards ahead, was the entrance of the forward command\nbunker. The bunker from which he had come. Hendricks watched silently.\nNo motion. No sign of life. Nothing stirred.\n\nKlaus slithered up beside him. \"Where is it?\"\n\n\"Down there.\" Hendricks passed him the glasses. Clouds of ash rolled\nacross the evening sky. The world was darkening. They had a couple of\nhours of light left, at the most. Probably not that much.\n\n\"I don't see anything,\" Klaus said.\n\n\"That tree there. The stump. By the pile of bricks. The entrance is to\nthe right of the bricks.\"\n\n\"I'll have to take your word for it.\"\n\n\"You and Tasso cover me from here. You'll be able to sight all the way\nto the bunker entrance.\"\n\n\"You're going down alone?\"\n\n\"With my wrist tab I'll be safe. The ground around the bunker is a\nliving field of claws. They collect down in the ash. Like crabs.\nWithout tabs you wouldn't have a chance.\"\n\n\"Maybe you're right.\"\n\n\"I'll walk slowly all the way. As soon as I know for certain--\"\n\n\"If they're down inside the bunker you won't be able to get back up\nhere. They go fast. You don't realize.\"\n\n\"What do you suggest?\"\n\nKlaus considered. \"I don't know. Get them to come up to the surface.\nSo you can see.\"\n\nHendricks brought his transmitter from his belt, raising the antenna.\n\"Let's get started.\"\n\n       *       *       *       *       *\n\nKlaus signalled to Tasso. She crawled expertly up the side of the rise\nto where they were sitting.\n\n\"He's going down alone,\" Klaus said. \"We'll cover him from here. As\nsoon as you see him start back, fire past him at once. They come\nquick.\"\n\n\"You're not very optimistic,\" Tasso said.\n\n\"No, I'm not.\"\n\nHendricks opened the breech of his gun, checking it carefully. \"Maybe\nthings are all right.\"\n\n\"You didn't see them. Hundreds of them. All the same. Pouring out like\nants.\"\n\n\"I should be able to find out without going down all the way.\"\nHendricks locked his gun, gripping it in one hand, the transmitter in\nthe other. \"Well, wish me luck.\"\n\nKlaus put out his hand. \"Don't go down until you're sure. Talk to them\nfrom up here. Make them show themselves.\"\n\n       *       *       *       *       *\n\nHendricks stood up. He stepped down the side of the rise.\n\nA moment later he was walking slowly toward the pile of bricks and\ndebris beside the dead tree stump. Toward the entrance of the forward\ncommand bunker.\n\nNothing stirred. He raised the transmitter, clicking it on. \"Scott?\nCan you hear me?\"\n\nSilence.\n\n\"Scott! This is Hendricks. Can you hear me? I'm standing outside the\nbunker. You should be able to see me in the view sight.\"\n\nHe listened, the transmitter gripped tightly. No sound. Only static.\nHe walked forward. A claw burrowed out of the ash and raced toward\nhim. It halted a few feet away and then slunk off. A second claw\nappeared, one of the big ones with feelers. It moved toward him,\nstudied him intently, and then fell in behind him, dogging\nrespectfully after him, a few paces away. A moment later a second big\nclaw joined it. Silently, the claws trailed him, as he walked slowly\ntoward the bunker.\n\nHendricks stopped, and behind him, the claws came to a halt. He was\nclose, now. Almost to the bunker steps.\n\n\"Scott! Can you hear me? I'm standing right above you. Outside. On the\nsurface. Are you picking me up?\"\n\n       *       *       *       *       *\n\nHe waited, holding his gun against his side, the transmitter tightly\nto his ear. Time passed. He strained to hear, but there was only\nsilence. Silence, and faint static.\n\nThen, distantly, metallically--\n\n\"This is Scott.\"\n\nThe voice was neutral. Cold. He could not identify it. But the\nearphone was minute.\n\n\"Scott! Listen. I'm standing right above you. I'm on the surface,\nlooking down into the bunker entrance.\"\n\n\"Yes.\"\n\n\"Can you see me?\"\n\n\"Yes.\"\n\n\"Through the view sight? You have the sight trained on me?\"\n\n\"Yes.\"\n\nHendricks pondered. A circle of claws waited quietly around him,\ngray-metal bodies on all sides of him. \"Is everything all right in the\nbunker? Nothing unusual has happened?\"\n\n\"Everything is all right.\"\n\n\"Will you come up to the surface? I want to see you for a moment.\"\nHendricks took a deep breath. \"Come up here with me. I want to talk to\nyou.\"\n\n\"Come down.\"\n\n\"I'm giving you an order.\"\n\nSilence.\n\n\"Are you coming?\" Hendricks listened. There was no response. \"I order\nyou to come to the surface.\"\n\n\"Come down.\"\n\nHendricks set his jaw. \"Let me talk to Leone.\"\n\nThere was a long pause. He listened to the static. Then a voice came,\nhard, thin, metallic. The same as the other. \"This is Leone.\"\n\n\"Hendricks. I'm on the surface. At the bunker entrance. I want one of\nyou to come up here.\"\n\n\"Come down.\"\n\n\"Why come down? I'm giving you an order!\"\n\nSilence. Hendricks lowered the transmitter. He looked carefully around\nhim. The entrance was just ahead. Almost at his feet. He lowered the\nantenna and fastened the transmitter to his belt. Carefully, he\ngripped his gun with both hands. He moved forward, a step at a time.\nIf they could see him they knew he was starting toward the entrance.\nHe closed his eyes a moment.\n\nThen he put his foot on the first step that led downward.\n\nTwo Davids came up at him, their faces identical and expressionless.\nHe blasted them into particles. More came rushing silently up, a whole\npack of them. All exactly the same.\n\nHendricks turned and raced back, away from the bunker, back toward the\nrise.\n\nAt the top of the rise Tasso and Klaus were firing down. The small\nclaws were already streaking up toward them, shining metal spheres\ngoing fast, racing frantically through the ash. But he had no time to\nthink about that. He knelt down, aiming at the bunker entrance, gun\nagainst his cheek. The Davids were coming out in groups, clutching\ntheir teddy bears, their thin knobby legs pumping as they ran up the\nsteps to the surface. Hendricks fired into the main body of them. They\nburst apart, wheels and springs flying in all directions. He fired\nagain through the mist of particles.\n\nA giant lumbering figure rose up in the bunker entrance, tall and\nswaying. Hendricks paused, amazed. A man, a soldier. With one leg,\nsupporting himself with a crutch.\n\n\"Major!\" Tasso's voice came. More firing. The huge figure moved\nforward, Davids swarming around it. Hendricks broke out of his freeze.\nThe First Variety. The Wounded Soldier.\n\nHe aimed and fired. The soldier burst into bits, parts and relays\nflying. Now many Davids were out on the flat ground, away from the\nbunker. He fired again and again, moving slowly back, half-crouching\nand aiming.\n\nFrom the rise, Klaus fired down. The side of the rise was alive with\nclaws making their way up. Hendricks retreated toward the rise,\nrunning and crouching. Tasso had left Klaus and was circling slowly to\nthe right, moving away from the rise.\n\nA David slipped up toward him, its small white face expressionless,\nbrown hair hanging down in its eyes. It bent over suddenly, opening\nits arms. Its teddy bear hurtled down and leaped across the ground,\nbounding toward him. Hendricks fired. The bear and the David both\ndissolved. He grinned, blinking. It was like a dream.\n\n\"Up here!\" Tasso's voice. Hendricks made his way toward her. She was\nover by some columns of concrete, walls of a ruined building. She was\nfiring past him, with the hand pistol Klaus had given her.\n\n\"Thanks.\" He joined her, grasping for breath. She pulled him back,\nbehind the concrete, fumbling at her belt.\n\n\"Close your eyes!\" She unfastened a globe from her waist. Rapidly, she\nunscrewed the cap, locking it into place. \"Close your eyes and get\ndown.\"\n\n       *       *       *       *       *\n\nShe threw the bomb. It sailed in an arc, an expert, rolling and\nbouncing to the entrance of the bunker. Two Wounded Soldiers stood\nuncertainly by the brick pile. More Davids poured from behind them,\nout onto the plain. One of the Wounded Soldiers moved toward the bomb,\nstooping awkwardly down to pick it up.\n\nThe bomb went off. The concussion whirled Hendricks around, throwing\nhim on his face. A hot wind rolled over him. Dimly he saw Tasso\nstanding behind the columns, firing slowly and methodically at the\nDavids coming out of the raging clouds of white fire.\n\nBack along the rise Klaus struggled with a ring of claws circling\naround him. He retreated, blasting at them and moving back, trying to\nbreak through the ring.\n\nHendricks struggled to his feet. His head ached. He could hardly see.\nEverything was licking at him, raging and whirling. His right arm\nwould not move.\n\nTasso pulled back toward him. \"Come on. Let's go.\"\n\n\"Klaus--He's still up there.\"\n\n\"Come on!\" Tasso dragged Hendricks back, away from the columns.\nHendricks shook his head, trying to clear it. Tasso led him rapidly\naway, her eyes intense and bright, watching for claws that had escaped\nthe blast.\n\nOne David came out of the rolling clouds of flame. Tasso blasted it.\nNo more appeared.\n\n\"But Klaus. What about him?\" Hendricks stopped, standing unsteadily.\n\"He--\"\n\n\"Come on!\"\n\n       *       *       *       *       *\n\nThey retreated, moving farther and farther away from the bunker. A few\nsmall claws followed them for a little while and then gave up, turning\nback and going off.\n\nAt last Tasso stopped. \"We can stop here and get our breaths.\"\n\nHendricks sat down on some heaps of debris. He wiped his neck,\ngasping. \"We left Klaus back there.\"\n\nTasso said nothing. She opened her gun, sliding a fresh round of blast\ncartridges into place.\n\nHendricks stared at her, dazed. \"You left him back there on purpose.\"\n\nTasso snapped the gun together. She studied the heaps of rubble around\nthem, her face expressionless. As if she were watching for something.\n\n\"What is it?\" Hendricks demanded. \"What are you looking for? Is\nsomething coming?\" He shook his head, trying to understand. What was\nshe doing? What was she waiting for? He could see nothing. Ash lay all\naround them, ash and ruins. Occasional stark tree trunks, without\nleaves or branches. \"What--\"\n\nTasso cut him off. \"Be still.\" Her eyes narrowed. Suddenly her gun\ncame up. Hendricks turned, following her gaze.\n\n       *       *       *       *       *\n\nBack the way they had come a figure appeared. The figure walked\nunsteadily toward them. Its clothes were torn. It limped as it made\nits way along, going very slowly and carefully. Stopping now and then,\nresting and getting its strength. Once it almost fell. It stood for a\nmoment, trying to steady itself. Then it came on.\n\nKlaus.\n\nHendricks stood up. \"Klaus!\" He started toward him. \"How the hell did\nyou--\"\n\nTasso fired. Hendricks swung back. She fired again, the blast passing\nhim, a searing line of heat. The beam caught Klaus in the chest. He\nexploded, gears and wheels flying. For a moment he continued to walk.\nThen he swayed back and forth. He crashed to the ground, his arms\nflung out. A few more wheels rolled away.\n\nSilence.\n\nTasso turned to Hendricks. \"Now you understand why he killed Rudi.\"\n\nHendricks sat down again slowly. He shook his head. He was numb. He\ncould not think.\n\n\"Do you see?\" Tasso said. \"Do you understand?\"\n\nHendricks said nothing. Everything was slipping away from him, faster\nand faster. Darkness, rolling and plucking at him.\n\nHe closed his eyes.\n\n       *       *       *       *       *\n\nHendricks opened his eyes slowly. His body ached all over. He tried to\nsit up but needles of pain shot through his arm and shoulder. He\ngasped.\n\n\"Don't try to get up,\" Tasso said. She bent down, putting her cold\nhand against his forehead.\n\nIt was night. A few stars glinted above, shining through the drifting\nclouds of ash. Hendricks lay back, his teeth locked. Tasso watched him\nimpassively. She had built a fire with some wood and weeds. The fire\nlicked feebly, hissing at a metal cup suspended over it. Everything\nwas silent. Unmoving darkness, beyond the fire.\n\n\"So he was the Second Variety,\" Hendricks murmured.\n\n\"I had always thought so.\"\n\n\"Why didn't you destroy him sooner?\" he wanted to know.\n\n\"You held me back.\" Tasso crossed to the fire to look into the metal\ncup. \"Coffee. It'll be ready to drink in awhile.\"\n\nShe came back and sat down beside him. Presently she opened her pistol\nand began to disassemble the firing mechanism, studying it intently.\n\n\"This is a beautiful gun,\" Tasso said, half-aloud. \"The construction\nis superb.\"\n\n\"What about them? The claws.\"\n\n\"The concussion from the bomb put most of them out of action. They're\ndelicate. Highly organized, I suppose.\"\n\n\"The Davids, too?\"\n\n\"Yes.\"\n\n\"How did you happen to have a bomb like that?\"\n\nTasso shrugged. \"We designed it. You shouldn't underestimate our\ntechnology, Major. Without such a bomb you and I would no longer\nexist.\"\n\n\"Very useful.\"\n\nTasso stretched out her legs, warming her feet in the heat of the\nfire. \"It surprised me that you did not seem to understand, after he\nkilled Rudi. Why did you think he--\"\n\n\"I told you. I thought he was afraid.\"\n\n\"Really? You know, Major, for a little while I suspected you. Because\nyou wouldn't let me kill him. I thought you might be protecting him.\"\nShe laughed.\n\n\"Are we safe here?\" Hendricks asked presently.\n\n\"For awhile. Until they get reinforcements from some other area.\"\nTasso began to clean the interior of the gun with a bit of rag. She\nfinished and pushed the mechanism back into place. She closed the gun,\nrunning her finger along the barrel.\n\n\"We were lucky,\" Hendricks murmured.\n\n\"Yes. Very lucky.\"\n\n\"Thanks for pulling me away.\"\n\n       *       *       *       *       *\n\nTasso did not answer. She glanced up at him, her eyes bright in the\nfire light. Hendricks examined his arm. He could not move his fingers.\nHis whole side seemed numb. Down inside him was a dull steady ache.\n\n\"How do you feel?\" Tasso asked.\n\n\"My arm is damaged.\"\n\n\"Anything else?\"\n\n\"Internal injuries.\"\n\n\"You didn't get down when the bomb went off.\"\n\nHendricks said nothing. He watched Tasso pour the coffee from the cup\ninto a flat metal pan. She brought it over to him.\n\n\"Thanks.\" He struggled up enough to drink. It was hard to swallow. His\ninsides turned over and he pushed the pan away. \"That's all I can\ndrink now.\"\n\nTasso drank the rest. Time passed. The clouds of ash moved across the\ndark sky above them. Hendricks rested, his mind blank. After awhile he\nbecame aware that Tasso was standing over him, gazing down at him.\n\n\"What is it?\" he murmured.\n\n\"Do you feel any better?\"\n\n\"Some.\"\n\n\"You know, Major, if I hadn't dragged you away they would have got\nyou. You would be dead. Like Rudi.\"\n\n\"I know.\"\n\n\"Do you want to know why I brought you out? I could have left you. I\ncould have left you there.\"\n\n\"Why did you bring me out?\"\n\n\"Because we have to get away from here.\" Tasso stirred the fire with a\nstick, peering calmly down into it. \"No human being can live here.\nWhen their reinforcements come we won't have a chance. I've pondered\nabout it while you were unconscious. We have perhaps three hours\nbefore they come.\"\n\n\"And you expect me to get us away?\"\n\n\"That's right. I expect you to get us out of here.\"\n\n\"Why me?\"\n\n\"Because I don't know any way.\" Her eyes shone at him in the\nhalf-light, bright and steady. \"If you can't get us out of here\nthey'll kill us within three hours. I see nothing else ahead. Well,\nMajor? What are you going to do? I've been waiting all night. While\nyou were unconscious I sat here, waiting and listening. It's almost\ndawn. The night is almost over.\"\n\n       *       *       *       *       *\n\nHendricks considered. \"It's curious,\" he said at last.\n\n\"Curious?\"\n\n\"That you should think I can get us out of here. I wonder what you\nthink I can do.\"\n\n\"Can you get us to the Moon Base?\"\n\n\"The Moon Base? How?\"\n\n\"There must be some way.\"\n\nHendricks shook his head. \"No. There's no way that I know of.\"\n\nTasso said nothing. For a moment her steady gaze wavered. She ducked\nher head, turning abruptly away. She scrambled to her feet. \"More\ncoffee?\"\n\n\"No.\"\n\n\"Suit yourself.\" Tasso drank silently. He could not see her face. He\nlay back against the ground, deep in thought, trying to concentrate.\nIt was hard to think. His head still hurt. And the numbing daze still\nhung over him.\n\n\"There might be one way,\" he said suddenly.\n\n\"Oh?\"\n\n\"How soon is dawn?\"\n\n\"Two hours. The sun will be coming up shortly.\"\n\n\"There's supposed to be a ship near here. I've never seen it. But I\nknow it exists.\"\n\n\"What kind of a ship?\" Her voice was sharp.\n\n\"A rocket cruiser.\"\n\n\"Will it take us off? To the Moon Base?\"\n\n\"It's supposed to. In case of emergency.\" He rubbed his forehead.\n\n\"What's wrong?\"\n\n\"My head. It's hard to think. I can hardly--hardly concentrate. The\nbomb.\"\n\n\"Is the ship near here?\" Tasso slid over beside him, settling down on\nher haunches. \"How far is it? Where is it?\"\n\n\"I'm trying to think.\"\n\nHer fingers dug into his arm. \"Nearby?\" Her voice was like iron.\n\"Where would it be? Would they store it underground? Hidden\nunderground?\"\n\n\"Yes. In a storage locker.\"\n\n\"How do we find it? Is it marked? Is there a code marker to identify\nit?\"\n\nHendricks concentrated. \"No. No markings. No code symbol.\"\n\n\"What, then?\"\n\n\"A sign.\"\n\n\"What sort of sign?\"\n\n       *       *       *       *       *\n\nHendricks did not answer. In the flickering light his eyes were\nglazed, two sightless orbs. Tasso's fingers dug into his arm.\n\n\"What sort of sign? What is it?\"\n\n\"I--I can't think. Let me rest.\"\n\n\"All right.\" She let go and stood up. Hendricks lay back against the\nground, his eyes closed. Tasso walked away from him, her hands in her\npockets. She kicked a rock out of her way and stood staring up at the\nsky. The night blackness was already beginning to fade into gray.\nMorning was coming.\n\nTasso gripped her pistol and walked around the fire in a circle, back\nand forth. On the ground Major Hendricks lay, his eyes closed,\nunmoving. The grayness rose in the sky, higher and higher. The\nlandscape became visible, fields of ash stretching out in all\ndirections. Ash and ruins of buildings, a wall here and there, heaps\nof concrete, the naked trunk of a tree.\n\nThe air was cold and sharp. Somewhere a long way off a bird made a few\nbleak sounds.\n\nHendricks stirred. He opened his eyes. \"Is it dawn? Already?\"\n\n\"Yes.\"\n\nHendricks sat up a little. \"You wanted to know something. You were\nasking me.\"\n\n\"Do you remember now?\"\n\n\"Yes.\"\n\n\"What is it?\" She tensed. \"What?\" she repeated sharply.\n\n\"A well. A ruined well. It's in a storage locker under a well.\"\n\n\"A well.\" Tasso relaxed. \"Then we'll find a well.\" She looked at her\nwatch. \"We have about an hour, Major. Do you think we can find it in\nan hour?\"\n\n       *       *       *       *       *\n\n\"Give me a hand up,\" Hendricks said.\n\nTasso put her pistol away and helped him to his feet. \"This is going\nto be difficult.\"\n\n\"Yes it is.\" Hendricks set his lips tightly. \"I don't think we're\ngoing to go very far.\"\n\nThey began to walk. The early sun cast a little warmth down on them.\nThe land was flat and barren, stretching out gray and lifeless as far\nas they could see. A few birds sailed silently, far above them,\ncircling slowly.\n\n\"See anything?\" Hendricks said. \"Any claws?\"\n\n\"No. Not yet.\"\n\nThey passed through some ruins, upright concrete and bricks. A cement\nfoundation. Rats scuttled away. Tasso jumped back warily.\n\n\"This used to be a town,\" Hendricks said. \"A village. Provincial\nvillage. This was all grape country, once. Where we are now.\"\n\nThey came onto a ruined street, weeds and cracks criss-crossing it.\nOver to the right a stone chimney stuck up.\n\n\"Be careful,\" he warned her.\n\nA pit yawned, an open basement. Ragged ends of pipes jutted up,\ntwisted and bent. They passed part of a house, a bathtub turned on its\nside. A broken chair. A few spoons and bits of china dishes. In the\ncenter of the street the ground had sunk away. The depression was\nfilled with weeds and debris and bones.\n\n\"Over here,\" Hendricks murmured.\n\n\"This way?\"\n\n\"To the right.\"\n\nThey passed the remains of a heavy duty tank. Hendricks' belt counter\nclicked ominously. The tank had been radiation blasted. A few feet\nfrom the tank a mummified body lay sprawled out, mouth open. Beyond\nthe road was a flat field. Stones and weeds, and bits of broken glass.\n\n\"There,\" Hendricks said.\n\n       *       *       *       *       *\n\nA stone well jutted up, sagging and broken. A few boards lay across\nit. Most of the well had sunk into rubble. Hendricks walked unsteadily\ntoward it, Tasso beside him.\n\n\"Are you certain about this?\" Tasso said. \"This doesn't look like\nanything.\"\n\n\"I'm sure.\" Hendricks sat down at the edge of the well, his teeth\nlocked. His breath came quickly. He wiped perspiration from his face.\n\"This was arranged so the senior command officer could get away. If\nanything happened. If the bunker fell.\"\n\n\"That was you?\"\n\n\"Yes.\"\n\n\"Where is the ship? Is it here?\"\n\n\"We're standing on it.\" Hendricks ran his hands over the surface of\nthe well stones. \"The eye-lock responds to me, not to anybody else.\nIt's my ship. Or it was supposed to be.\"\n\nThere was a sharp click. Presently they heard a low grating sound from\nbelow them.\n\n\"Step back,\" Hendricks said. He and Tasso moved away from the well.\n\nA section of the ground slid back. A metal frame pushed slowly up\nthrough the ash, shoving bricks and weeds out of the way. The action\nceased, as the ship nosed into view.\n\n\"There it is,\" Hendricks said.\n\nThe ship was small. It rested quietly, suspended in its mesh frame,\nlike a blunt needle. A rain of ash sifted down into the dark cavity\nfrom which the ship had been raised. Hendricks made his way over to\nit. He mounted the mesh and unscrewed the hatch, pulling it back.\nInside the ship the control banks and the pressure seat were visible.\n\n       *       *       *       *       *\n\nTasso came and stood beside him, gazing into the ship. \"I'm not\naccustomed to rocket piloting,\" she said, after awhile.\n\nHendricks glanced at her. \"I'll do the piloting.\"\n\n\"Will you? There's only one seat, Major. I can see it's built to carry\nonly a single person.\"\n\nHendricks' breathing changed. He studied the interior of the ship\nintently. Tasso was right. There was only one seat. The ship was built\nto carry only one person. \"I see,\" he said slowly. \"And the one person\nis you.\"\n\nShe nodded.\n\n\"Of course.\"\n\n\"Why?\"\n\n\"_You_ can't go. You might not live through the trip. You're injured.\nYou probably wouldn't get there.\"\n\n\"An interesting point. But you see, I know where the Moon Base is. And\nyou don't. You might fly around for months and not find it. It's well\nhidden. Without knowing what to look for--\"\n\n\"I'll have to take my chances. Maybe I won't find it. Not by myself.\nBut I think you'll give me all the information I need. Your life\ndepends on it.\"\n\n\"How?\"\n\n\"If I find the Moon Base in time, perhaps I can get them to send a\nship back to pick you up. _If_ I find the Base in time. If not, then\nyou haven't a chance. I imagine there are supplies on the ship. They\nwill last me long enough--\"\n\nHendricks moved quickly. But his injured arm betrayed him. Tasso\nducked, sliding lithely aside. Her hand came up, lightning fast.\nHendricks saw the gun butt coming. He tried to ward off the blow, but\nshe was too fast. The metal butt struck against the side of his head,\njust above his ear. Numbing pain rushed through him. Pain and rolling\nclouds of blackness. He sank down, sliding to the ground.\n\n       *       *       *       *       *\n\nDimly, he was aware that Tasso was standing over him, kicking him with\nher toe.\n\n\"Major! Wake up.\"\n\nHe opened his eyes, groaning.\n\n\"Listen to me.\" She bent down, the gun pointed at his face. \"I have to\nhurry. There isn't much time left. The ship is ready to go, but you\nmust tell me the information I need before I leave.\"\n\nHendricks shook his head, trying to clear it.\n\n\"Hurry up! Where is the Moon Base? How do I find it? What do I look\nfor?\"\n\nHendricks said nothing.\n\n\"Answer me!\"\n\n\"Sorry.\"\n\n\"Major, the ship is loaded with provisions. I can coast for weeks.\nI'll find the Base eventually. And in a half hour you'll be dead. Your\nonly chance of survival--\" She broke off.\n\nAlong the slope, by some crumbling ruins, something moved. Something\nin the ash. Tasso turned quickly, aiming. She fired. A puff of flame\nleaped. Something scuttled away, rolling across the ash. She fired\nagain. The claw burst apart, wheels flying.\n\n\"See?\" Tasso said. \"A scout. It won't be long.\"\n\n\"You'll bring them back here to get me?\"\n\n\"Yes. As soon as possible.\"\n\nHendricks looked up at her. He studied her intently. \"You're telling\nthe truth?\" A strange expression had come over his face, an avid\nhunger. \"You will come back for me? You'll get me to the Moon Base?\"\n\n\"I'll get you to the Moon Base. But tell me where it is! There's only\na little time left.\"\n\n\"All right.\" Hendricks picked up a piece of rock, pulling himself to a\nsitting position. \"Watch.\"\n\nHendricks began to scratch in the ash. Tasso stood by him, watching\nthe motion of the rock. Hendricks was sketching a crude lunar map.\n\n       *       *       *       *       *\n\n\"This is the Appenine range. Here is the Crater of Archimedes. The\nMoon Base is beyond the end of the Appenine, about two hundred miles.\nI don't know exactly where. No one on Terra knows. But when you're\nover the Appenine, signal with one red flare and a green flare,\nfollowed by two red flares in quick succession. The Base monitor will\nrecord your signal. The Base is under the surface, of course. They'll\nguide you down with magnetic grapples.\"\n\n\"And the controls? Can I operate them?\"\n\n\"The controls are virtually automatic. All you have to do is give the\nright signal at the right time.\"\n\n\"I will.\"\n\n\"The seat absorbs most of the take-off shock. Air and temperature are\nautomatically controlled. The ship will leave Terra and pass out into\nfree space. It'll line itself up with the moon, falling into an orbit\naround it, about a hundred miles above the surface. The orbit will\ncarry you over the Base. When you're in the region of the Appenine,\nrelease the signal rockets.\"\n\nTasso slid into the ship and lowered herself into the pressure seat.\nThe arm locks folded automatically around her. She fingered the\ncontrols. \"Too bad you're not going, Major. All this put here for you,\nand you can't make the trip.\"\n\n\"Leave me the pistol.\"\n\nTasso pulled the pistol from her belt. She held it in her hand,\nweighing it thoughtfully. \"Don't go too far from this location. It'll\nbe hard to find you, as it is.\"\n\n\"No. I'll stay here by the well.\"\n\nTasso gripped the take-off switch, running her fingers over the smooth\nmetal. \"A beautiful ship, Major. Well built. I admire your\nworkmanship. You people have always done good work. You build fine\nthings. Your work, your creations, are your greatest achievement.\"\n\n\"Give me the pistol,\" Hendricks said impatiently, holding out his\nhand. He struggled to his feet.\n\n\"Good-bye, Major.\" Tasso tossed the pistol past Hendricks. The pistol\nclattered against the ground, bouncing and rolling away. Hendricks\nhurried after it. He bent down, snatching it up.\n\nThe hatch of the ship clanged shut. The bolts fell into place.\nHendricks made his way back. The inner door was being sealed. He\nraised the pistol unsteadily.\n\n       *       *       *       *       *\n\nThere was a shattering roar. The ship burst up from its metal cage,\nfusing the mesh behind it. Hendricks cringed, pulling back. The ship\nshot up into the rolling clouds of ash, disappearing into the sky.\n\nHendricks stood watching a long time, until even the streamer had\ndissipated. Nothing stirred. The morning air was chill and silent. He\nbegan to walk aimlessly back the way they had come. Better to keep\nmoving around. It would be a long time before help came--if it came at\nall.\n\nHe searched his pockets until he found a package of cigarettes. He lit\none grimly. They had all wanted cigarettes from him. But cigarettes\nwere scarce.\n\nA lizard slithered by him, through the ash. He halted, rigid. The\nlizard disappeared. Above, the sun rose higher in the sky. Some flies\nlanded on a flat rock to one side of him. Hendricks kicked at them\nwith his foot.\n\nIt was getting hot. Sweat trickled down his face, into his collar. His\nmouth was dry.\n\nPresently he stopped walking and sat down on some debris. He\nunfastened his medicine kit and swallowed a few narcotic capsules. He\nlooked around him. Where was he?\n\nSomething lay ahead. Stretched out on the ground. Silent and unmoving.\n\nHendricks drew his gun quickly. It looked like a man. Then he\nremembered. It was the remains of Klaus. The Second Variety. Where\nTasso had blasted him. He could see wheels and relays and metal parts,\nstrewn around on the ash. Glittering and sparkling in the sunlight.\n\nHendricks got to his feet and walked over. He nudged the inert form\nwith his foot, turning it over a little. He could see the metal hull,\nthe aluminum ribs and struts. More wiring fell out. Like viscera.\nHeaps of wiring, switches and relays. Endless motors and rods.\n\nHe bent down. The brain cage had been smashed by the fall. The\nartificial brain was visible. He gazed at it. A maze of circuits.\nMiniature tubes. Wires as fine as hair. He touched the brain cage. It\nswung aside. The type plate was visible. Hendricks studied the plate.\n\nAnd blanched.\n\nIV--IV.\n\nFor a long time he stared at the plate. Fourth Variety. Not the\nSecond. They had been wrong. There were more types. Not just three.\nMany more, perhaps. At least four. And Klaus wasn't the Second\nVariety.\n\nBut if Klaus wasn't the Second Variety--\n\nSuddenly he tensed. Something was coming, walking through the ash\nbeyond the hill. What was it? He strained to see. Figures. Figures\ncoming slowly along, making their way through the ash.\n\nComing toward him.\n\nHendricks crouched quickly, raising his gun. Sweat dripped down into\nhis eyes. He fought down rising panic, as the figures neared.\n\nThe first was a David. The David saw him and increased its pace. The\nothers hurried behind it. A second David. A third. Three Davids, all\nalike, coming toward him silently, without expression, their thin legs\nrising and falling. Clutching their teddy bears.\n\nHe aimed and fired. The first two Davids dissolved into particles. The\nthird came on. And the figure behind it. Climbing silently toward him\nacross the gray ash. A Wounded Soldier, towering over the David. And--\n\n       *       *       *       *       *\n\nAnd behind the Wounded Soldier came two Tassos, walking side by side.\nHeavy belt, Russian army pants, shirt, long hair. The familiar figure,\nas he had seen her only a little while before. Sitting in the pressure\nseat of the ship. Two slim, silent figures, both identical.\n\nThey were very near. The David bent down suddenly, dropping its teddy\nbear. The bear raced across the ground. Automatically, Hendricks'\nfingers tightened around the trigger. The bear was gone, dissolved\ninto mist. The two Tasso Types moved on, expressionless, walking side\nby side, through the gray ash.\n\nWhen they were almost to him, Hendricks raised the pistol waist high\nand fired.\n\nThe two Tassos dissolved. But already a new group was starting up the\nrise, five or six Tassos, all identical, a line of them coming rapidly\ntoward him.\n\nAnd he had given her the ship and the signal code. Because of him she\nwas on her way to the moon, to the Moon Base. He had made it possible.\n\nHe had been right about the bomb, after all. It had been designed with\nknowledge of the other types, the David Type and the Wounded Soldier\nType. And the Klaus Type. Not designed by human beings. It had been\ndesigned by one of the underground factories, apart from all human\ncontact.\n\nThe line of Tassos came up to him. Hendricks braced himself, watching\nthem calmly. The familiar face, the belt, the heavy shirt, the bomb\ncarefully in place.\n\nThe bomb--\n\nAs the Tassos reached for him, a last ironic thought drifted through\nHendricks' mind. He felt a little better, thinking about it. The bomb.\nMade by the Second Variety to destroy the other varieties. Made for\nthat end alone.\n\nThey were already beginning to design weapons to use against each\nother.", "title": "Second Variety"}