{"summary": "The book's protagonist is an English scientist and gentleman inventor living in Richmond, Surrey in Victorian England, and identified by a narrator simply as the Time Traveller. The narrator recounts the Traveller's lecture to his weekly dinner guests that time is simply a fourth dimension, and his demonstration of a tabletop model machine for travelling through it. He reveals that he has built a machine capable of carrying a person through time, and returns at dinner the following week to recount a remarkable tale, becoming the new narrator.\nIn the new narrative, the Time Traveller tests his device with a journey that takes him to A.D. 802,701, where he meets the Eloi, a society of small, elegant, childlike adults. They live in small communities within large and futuristic yet slowly deteriorating buildings, doing no work and having a frugivorous diet. His efforts to communicate with them are hampered by their lack of curiosity or discipline, and he speculates that they are a peaceful, common society, the result of humanity conquering nature with technology, and subsequently evolving to adapt to an environment in which strength and intellect are no longer advantageous to survival.\nReturning to the site where he arrived, the Time Traveller is shocked to find his time machine missing, and eventually concludes that it has been dragged by some unknown party into a nearby structure with heavy doors, locked from the inside, which resembles a Sphinx. Luckily, he had removed the machine's levers before leaving it. Later in the dark, he is approached menacingly by the Morlocks, ape-like troglodytes who live in darkness underground and surface only at night. Within their dwellings he discovers the machinery and industry that makes the above-ground paradise possible. He alters his theory, speculating that the human race has evolved into two species: the leisured classes have become the ineffectual Eloi, and the downtrodden working classes have become the brutish light-fearing Morlocks. Deducing that the Morlocks have taken his time machine, he explores the Morlock tunnels, learning that due to a lack of any other means of sustenance, they feed on the Eloi. His revised analysis is that their relationship is not one of lords and servants, but of livestock and ranchers. The Time Traveller theorizes that intelligence is the result of and response to danger; with no real challenges facing the Eloi, they have lost the spirit, intelligence, and physical fitness of humanity at its peak.\nMeanwhile, he saves an Eloi named Weena from drowning as none of the other Eloi take any notice of her plight, and they develop an innocently affectionate relationship over the course of several days. He takes Weena with him on an expedition to a distant structure that turns out to be the remains of a museum, where he finds a fresh supply of matches and fashions a crude weapon against Morlocks, whom he must fight to get back his machine. He plans to take Weena back to his own time. Because the long and tiring journey back to Weena's home is too much for them, they stop in the forest, and they are then overcome by Morlocks in the night, and Weena faints. The Traveller escapes when a small fire he had left behind them to distract the Morlocks catches up to them as a forest fire; Weena and the pursuing Morlocks are lost in the fire.\nThe Morlocks open the Sphinx and use the time machine as bait to capture the Traveller, not understanding that he will use it to escape. He reattaches the levers before he travels further ahead to roughly 30 million years from his own time. There he sees some of the last living things on a dying Earth: menacing reddish crab-like creatures slowly wandering the blood-red beaches chasing enormous, huge butterflies in a world covered in simple lichenous vegetation. He continues to make short jumps through time, seeing Earth's rotation gradually cease and the sun grow larger, redder, and dimmer, and the world falling silent and freezing as the last degenerate living things die out.\nOverwhelmed, he goes back to the machine and returns to Victorian time, arriving at his laboratory just three hours after he originally left. Interrupting dinner, he relates his adventures to his disbelieving visitors, producing as evidence two strange white flowers Weena had put in his pocket. The original narrator then takes over and relates that he returned to the Time Traveller's house the next day, finding him preparing for another journey.\n\n", "full_text": "The Time Machine, by H. G. Wells [1898]\n\n\n\n\nI\n\n\nThe Time Traveller (for so it will be convenient to speak of him)\nwas expounding a recondite matter to us. His grey eyes shone and\ntwinkled, and his usually pale face was flushed and animated. The\nfire burned brightly, and the soft radiance of the incandescent\nlights in the lilies of silver caught the bubbles that flashed and\npassed in our glasses. Our chairs, being his patents, embraced and\ncaressed us rather than submitted to be sat upon, and there was that\nluxurious after-dinner atmosphere when thought roams gracefully\nfree of the trammels of precision. And he put it to us in this\nway--marking the points with a lean forefinger--as we sat and lazily\nadmired his earnestness over this new paradox (as we thought it)\nand his fecundity.\n\n'You must follow me carefully. I shall have to controvert one or two\nideas that are almost universally accepted. The geometry, for\ninstance, they taught you at school is founded on a misconception.'\n\n'Is not that rather a large thing to expect us to begin upon?'\nsaid Filby, an argumentative person with red hair.\n\n'I do not mean to ask you to accept anything without reasonable\nground for it. You will soon admit as much as I need from you. You\nknow of course that a mathematical line, a line of thickness _nil_,\nhas no real existence. They taught you that? Neither has a\nmathematical plane. These things are mere abstractions.'\n\n'That is all right,' said the Psychologist.\n\n'Nor, having only length, breadth, and thickness, can a cube have a\nreal existence.'\n\n'There I object,' said Filby. 'Of course a solid body may exist. All\nreal things--'\n\n'So most people think. But wait a moment. Can an _instantaneous_\ncube exist?'\n\n'Don't follow you,' said Filby.\n\n'Can a cube that does not last for any time at all, have a real\nexistence?'\n\nFilby became pensive. 'Clearly,' the Time Traveller proceeded, 'any\nreal body must have extension in _four_ directions: it must have\nLength, Breadth, Thickness, and--Duration. But through a natural\ninfirmity of the flesh, which I will explain to you in a moment, we\nincline to overlook this fact. There are really four dimensions,\nthree which we call the three planes of Space, and a fourth, Time.\nThere is, however, a tendency to draw an unreal distinction between\nthe former three dimensions and the latter, because it happens that\nour consciousness moves intermittently in one direction along the\nlatter from the beginning to the end of our lives.'\n\n'That,' said a very young man, making spasmodic efforts to relight\nhis cigar over the lamp; 'that ... very clear indeed.'\n\n'Now, it is very remarkable that this is so extensively overlooked,'\ncontinued the Time Traveller, with a slight accession of\ncheerfulness. 'Really this is what is meant by the Fourth Dimension,\nthough some people who talk about the Fourth Dimension do not know\nthey mean it. It is only another way of looking at Time. _There is\nno difference between Time and any of the three dimensions of Space\nexcept that our consciousness moves along it_. But some foolish\npeople have got hold of the wrong side of that idea. You have all\nheard what they have to say about this Fourth Dimension?'\n\n'_I_ have not,' said the Provincial Mayor.\n\n'It is simply this. That Space, as our mathematicians have it, is\nspoken of as having three dimensions, which one may call Length,\nBreadth, and Thickness, and is always definable by reference to\nthree planes, each at right angles to the others. But some\nphilosophical people have been asking why _three_ dimensions\nparticularly--why not another direction at right angles to the other\nthree?--and have even tried to construct a Four-Dimension geometry.\nProfessor Simon Newcomb was expounding this to the New York\nMathematical Society only a month or so ago. You know how on a flat\nsurface, which has only two dimensions, we can represent a figure of\na three-dimensional solid, and similarly they think that by models\nof three dimensions they could represent one of four--if they could\nmaster the perspective of the thing. See?'\n\n'I think so,' murmured the Provincial Mayor; and, knitting his\nbrows, he lapsed into an introspective state, his lips moving as one\nwho repeats mystic words. 'Yes, I think I see it now,' he said after\nsome time, brightening in a quite transitory manner.\n\n'Well, I do not mind telling you I have been at work upon this\ngeometry of Four Dimensions for some time. Some of my results\nare curious. For instance, here is a portrait of a man at eight\nyears old, another at fifteen, another at seventeen, another at\ntwenty-three, and so on. All these are evidently sections, as it\nwere, Three-Dimensional representations of his Four-Dimensioned\nbeing, which is a fixed and unalterable thing.\n\n'Scientific people,' proceeded the Time Traveller, after the pause\nrequired for the proper assimilation of this, 'know very well that\nTime is only a kind of Space. Here is a popular scientific diagram,\na weather record. This line I trace with my finger shows the\nmovement of the barometer. Yesterday it was so high, yesterday night\nit fell, then this morning it rose again, and so gently upward to\nhere. Surely the mercury did not trace this line in any of the\ndimensions of Space generally recognized? But certainly it traced\nsuch a line, and that line, therefore, we must conclude was along\nthe Time-Dimension.'\n\n'But,' said the Medical Man, staring hard at a coal in the fire, 'if\nTime is really only a fourth dimension of Space, why is it, and why\nhas it always been, regarded as something different? And why cannot\nwe move in Time as we move about in the other dimensions of Space?'\n\nThe Time Traveller smiled. 'Are you sure we can move freely in\nSpace? Right and left we can go, backward and forward freely enough,\nand men always have done so. I admit we move freely in two\ndimensions. But how about up and down? Gravitation limits us there.'\n\n'Not exactly,' said the Medical Man. 'There are balloons.'\n\n'But before the balloons, save for spasmodic jumping and the\ninequalities of the surface, man had no freedom of vertical\nmovement.'\n\n'Still they could move a little up and down,' said the Medical Man.\n\n'Easier, far easier down than up.'\n\n'And you cannot move at all in Time, you cannot get away from the\npresent moment.'\n\n'My dear sir, that is just where you are wrong. That is just where\nthe whole world has gone wrong. We are always getting away from the\npresent moment. Our mental existences, which are immaterial and have\nno dimensions, are passing along the Time-Dimension with a uniform\nvelocity from the cradle to the grave. Just as we should travel _down_\nif we began our existence fifty miles above the earth's surface.'\n\n'But the great difficulty is this,' interrupted the Psychologist.\n'You _can_ move about in all directions of Space, but you cannot\nmove about in Time.'\n\n'That is the germ of my great discovery. But you are wrong to say\nthat we cannot move about in Time. For instance, if I am recalling\nan incident very vividly I go back to the instant of its occurrence:\nI become absent-minded, as you say. I jump back for a moment. Of\ncourse we have no means of staying back for any length of Time, any\nmore than a savage or an animal has of staying six feet above the\nground. But a civilized man is better off than the savage in this\nrespect. He can go up against gravitation in a balloon, and why\nshould he not hope that ultimately he may be able to stop or\naccelerate his drift along the Time-Dimension, or even turn about\nand travel the other way?'\n\n'Oh, _this_,' began Filby, 'is all--'\n\n'Why not?' said the Time Traveller.\n\n'It's against reason,' said Filby.\n\n'What reason?' said the Time Traveller.\n\n'You can show black is white by argument,' said Filby, 'but you will\nnever convince me.'\n\n'Possibly not,' said the Time Traveller. 'But now you begin to see\nthe object of my investigations into the geometry of Four\nDimensions. Long ago I had a vague inkling of a machine--'\n\n'To travel through Time!' exclaimed the Very Young Man.\n\n'That shall travel indifferently in any direction of Space and Time,\nas the driver determines.'\n\nFilby contented himself with laughter.\n\n'But I have experimental verification,' said the Time Traveller.\n\n'It would be remarkably convenient for the historian,' the\nPsychologist suggested. 'One might travel back and verify the\naccepted account of the Battle of Hastings, for instance!'\n\n'Don't you think you would attract attention?' said the Medical Man.\n'Our ancestors had no great tolerance for anachronisms.'\n\n'One might get one's Greek from the very lips of Homer and Plato,'\nthe Very Young Man thought.\n\n'In which case they would certainly plough you for the Little-go.\nThe German scholars have improved Greek so much.'\n\n'Then there is the future,' said the Very Young Man. 'Just think!\nOne might invest all one's money, leave it to accumulate at\ninterest, and hurry on ahead!'\n\n'To discover a society,' said I, 'erected on a strictly communistic\nbasis.'\n\n'Of all the wild extravagant theories!' began the Psychologist.\n\n'Yes, so it seemed to me, and so I never talked of it until--'\n\n'Experimental verification!' cried I. 'You are going to verify\n_that_?'\n\n'The experiment!' cried Filby, who was getting brain-weary.\n\n'Let's see your experiment anyhow,' said the Psychologist, 'though\nit's all humbug, you know.'\n\nThe Time Traveller smiled round at us. Then, still smiling faintly,\nand with his hands deep in his trousers pockets, he walked slowly\nout of the room, and we heard his slippers shuffling down the long\npassage to his laboratory.\n\nThe Psychologist looked at us. 'I wonder what he's got?'\n\n'Some sleight-of-hand trick or other,' said the Medical Man, and\nFilby tried to tell us about a conjurer he had seen at Burslem; but\nbefore he had finished his preface the Time Traveller came back, and\nFilby's anecdote collapsed.\n\nThe thing the Time Traveller held in his hand was a glittering\nmetallic framework, scarcely larger than a small clock, and very\ndelicately made. There was ivory in it, and some transparent\ncrystalline substance. And now I must be explicit, for this that\nfollows--unless his explanation is to be accepted--is an absolutely\nunaccountable thing. He took one of the small octagonal tables that\nwere scattered about the room, and set it in front of the fire, with\ntwo legs on the hearthrug. On this table he placed the mechanism.\nThen he drew up a chair, and sat down. The only other object on the\ntable was a small shaded lamp, the bright light of which fell upon\nthe model. There were also perhaps a dozen candles about, two in\nbrass candlesticks upon the mantel and several in sconces, so that\nthe room was brilliantly illuminated. I sat in a low arm-chair\nnearest the fire, and I drew this forward so as to be almost between\nthe Time Traveller and the fireplace. Filby sat behind him, looking\nover his shoulder. The Medical Man and the Provincial Mayor watched\nhim in profile from the right, the Psychologist from the left. The\nVery Young Man stood behind the Psychologist. We were all on the\nalert. It appears incredible to me that any kind of trick, however\nsubtly conceived and however adroitly done, could have been played\nupon us under these conditions.\n\nThe Time Traveller looked at us, and then at the mechanism. 'Well?'\nsaid the Psychologist.\n\n'This little affair,' said the Time Traveller, resting his elbows\nupon the table and pressing his hands together above the apparatus,\n'is only a model. It is my plan for a machine to travel through\ntime. You will notice that it looks singularly askew, and that there\nis an odd twinkling appearance about this bar, as though it was in\nsome way unreal.' He pointed to the part with his finger. 'Also,\nhere is one little white lever, and here is another.'\n\nThe Medical Man got up out of his chair and peered into the thing.\n'It's beautifully made,' he said.\n\n'It took two years to make,' retorted the Time Traveller. Then, when\nwe had all imitated the action of the Medical Man, he said: 'Now I\nwant you clearly to understand that this lever, being pressed over,\nsends the machine gliding into the future, and this other reverses\nthe motion. This saddle represents the seat of a time traveller.\nPresently I am going to press the lever, and off the machine will\ngo. It will vanish, pass into future Time, and disappear. Have a\ngood look at the thing. Look at the table too, and satisfy\nyourselves there is no trickery. I don't want to waste this model,\nand then be told I'm a quack.'\n\nThere was a minute's pause perhaps. The Psychologist seemed about to\nspeak to me, but changed his mind. Then the Time Traveller put forth\nhis finger towards the lever. 'No,' he said suddenly. 'Lend me your\nhand.' And turning to the Psychologist, he took that individual's\nhand in his own and told him to put out his forefinger. So that it\nwas the Psychologist himself who sent forth the model Time Machine\non its interminable voyage. We all saw the lever turn. I am\nabsolutely certain there was no trickery. There was a breath of\nwind, and the lamp flame jumped. One of the candles on the mantel\nwas blown out, and the little machine suddenly swung round, became\nindistinct, was seen as a ghost for a second perhaps, as an eddy of\nfaintly glittering brass and ivory; and it was gone--vanished! Save\nfor the lamp the table was bare.\n\nEveryone was silent for a minute. Then Filby said he was damned.\n\nThe Psychologist recovered from his stupor, and suddenly looked\nunder the table. At that the Time Traveller laughed cheerfully.\n'Well?' he said, with a reminiscence of the Psychologist. Then,\ngetting up, he went to the tobacco jar on the mantel, and with his\nback to us began to fill his pipe.\n\nWe stared at each other. 'Look here,' said the Medical Man, 'are you\nin earnest about this? Do you seriously believe that that machine\nhas travelled into time?'\n\n'Certainly,' said the Time Traveller, stooping to light a spill at\nthe fire. Then he turned, lighting his pipe, to look at the\nPsychologist's face. (The Psychologist, to show that he was not\nunhinged, helped himself to a cigar and tried to light it uncut.)\n'What is more, I have a big machine nearly finished in there'--he\nindicated the laboratory--'and when that is put together I mean to\nhave a journey on my own account.'\n\n'You mean to say that that machine has travelled into the future?'\nsaid Filby.\n\n'Into the future or the past--I don't, for certain, know which.'\n\nAfter an interval the Psychologist had an inspiration. 'It must have\ngone into the past if it has gone anywhere,' he said.\n\n'Why?' said the Time Traveller.\n\n'Because I presume that it has not moved in space, and if it\ntravelled into the future it would still be here all this time,\nsince it must have travelled through this time.'\n\n'But,' I said, 'If it travelled into the past it would have been\nvisible when we came first into this room; and last Thursday when we\nwere here; and the Thursday before that; and so forth!'\n\n'Serious objections,' remarked the Provincial Mayor, with an air of\nimpartiality, turning towards the Time Traveller.\n\n'Not a bit,' said the Time Traveller, and, to the Psychologist: 'You\nthink. You can explain that. It's presentation below the threshold,\nyou know, diluted presentation.'\n\n'Of course,' said the Psychologist, and reassured us. 'That's a\nsimple point of psychology. I should have thought of it. It's plain\nenough, and helps the paradox delightfully. We cannot see it, nor\ncan we appreciate this machine, any more than we can the spoke of\na wheel spinning, or a bullet flying through the air. If it is\ntravelling through time fifty times or a hundred times faster than\nwe are, if it gets through a minute while we get through a second,\nthe impression it creates will of course be only one-fiftieth or\none-hundredth of what it would make if it were not travelling in\ntime. That's plain enough.' He passed his hand through the space in\nwhich the machine had been. 'You see?' he said, laughing.\n\nWe sat and stared at the vacant table for a minute or so. Then the\nTime Traveller asked us what we thought of it all.\n\n'It sounds plausible enough to-night,' said the Medical Man; 'but\nwait until to-morrow. Wait for the common sense of the morning.'\n\n'Would you like to see the Time Machine itself?' asked the Time\nTraveller. And therewith, taking the lamp in his hand, he led the\nway down the long, draughty corridor to his laboratory. I remember\nvividly the flickering light, his queer, broad head in silhouette,\nthe dance of the shadows, how we all followed him, puzzled but\nincredulous, and how there in the laboratory we beheld a larger\nedition of the little mechanism which we had seen vanish from before\nour eyes. Parts were of nickel, parts of ivory, parts had certainly\nbeen filed or sawn out of rock crystal. The thing was generally\ncomplete, but the twisted crystalline bars lay unfinished upon the\nbench beside some sheets of drawings, and I took one up for a better\nlook at it. Quartz it seemed to be.\n\n'Look here,' said the Medical Man, 'are you perfectly serious?\nOr is this a trick--like that ghost you showed us last Christmas?'\n\n'Upon that machine,' said the Time Traveller, holding the lamp\naloft, 'I intend to explore time. Is that plain? I was never more\nserious in my life.'\n\nNone of us quite knew how to take it.\n\nI caught Filby's eye over the shoulder of the Medical Man, and he\nwinked at me solemnly.\n\n\n\n\nII\n\n\nI think that at that time none of us quite believed in the Time\nMachine. The fact is, the Time Traveller was one of those men who\nare too clever to be believed: you never felt that you saw all round\nhim; you always suspected some subtle reserve, some ingenuity in\nambush, behind his lucid frankness. Had Filby shown the model and\nexplained the matter in the Time Traveller's words, we should have\nshown _him_ far less scepticism. For we should have perceived his\nmotives; a pork butcher could understand Filby. But the Time\nTraveller had more than a touch of whim among his elements, and we\ndistrusted him. Things that would have made the frame of a less\nclever man seemed tricks in his hands. It is a mistake to do things\ntoo easily. The serious people who took him seriously never felt\nquite sure of his deportment; they were somehow aware that trusting\ntheir reputations for judgment with him was like furnishing a\nnursery with egg-shell china. So I don't think any of us said very\nmuch about time travelling in the interval between that Thursday and\nthe next, though its odd potentialities ran, no doubt, in most of\nour minds: its plausibility, that is, its practical incredibleness,\nthe curious possibilities of anachronism and of utter confusion it\nsuggested. For my own part, I was particularly preoccupied with the\ntrick of the model. That I remember discussing with the Medical Man,\nwhom I met on Friday at the Linnaean. He said he had seen a similar\nthing at Tubingen, and laid considerable stress on the blowing out\nof the candle. But how the trick was done he could not explain.\n\nThe next Thursday I went again to Richmond--I suppose I was one of\nthe Time Traveller's most constant guests--and, arriving late, found\nfour or five men already assembled in his drawing-room. The Medical\nMan was standing before the fire with a sheet of paper in one hand\nand his watch in the other. I looked round for the Time Traveller,\nand--'It's half-past seven now,' said the Medical Man. 'I suppose\nwe'd better have dinner?'\n\n'Where's----?' said I, naming our host.\n\n'You've just come? It's rather odd. He's unavoidably detained. He\nasks me in this note to lead off with dinner at seven if he's not\nback. Says he'll explain when he comes.'\n\n'It seems a pity to let the dinner spoil,' said the Editor of a\nwell-known daily paper; and thereupon the Doctor rang the bell.\n\nThe Psychologist was the only person besides the Doctor and myself\nwho had attended the previous dinner. The other men were Blank, the\nEditor aforementioned, a certain journalist, and another--a quiet,\nshy man with a beard--whom I didn't know, and who, as far as my\nobservation went, never opened his mouth all the evening. There was\nsome speculation at the dinner-table about the Time Traveller's\nabsence, and I suggested time travelling, in a half-jocular spirit.\nThe Editor wanted that explained to him, and the Psychologist\nvolunteered a wooden account of the 'ingenious paradox and trick' we\nhad witnessed that day week. He was in the midst of his exposition\nwhen the door from the corridor opened slowly and without noise. I\nwas facing the door, and saw it first. 'Hallo!' I said. 'At last!'\nAnd the door opened wider, and the Time Traveller stood before us.\nI gave a cry of surprise. 'Good heavens! man, what's the matter?'\ncried the Medical Man, who saw him next. And the whole tableful\nturned towards the door.\n\nHe was in an amazing plight. His coat was dusty and dirty, and\nsmeared with green down the sleeves; his hair disordered, and as it\nseemed to me greyer--either with dust and dirt or because its colour\nhad actually faded. His face was ghastly pale; his chin had a brown\ncut on it--a cut half healed; his expression was haggard and drawn,\nas by intense suffering. For a moment he hesitated in the doorway,\nas if he had been dazzled by the light. Then he came into the room.\nHe walked with just such a limp as I have seen in footsore tramps.\nWe stared at him in silence, expecting him to speak.\n\nHe said not a word, but came painfully to the table, and made a\nmotion towards the wine. The Editor filled a glass of champagne, and\npushed it towards him. He drained it, and it seemed to do him good:\nfor he looked round the table, and the ghost of his old smile\nflickered across his face. 'What on earth have you been up to, man?'\nsaid the Doctor. The Time Traveller did not seem to hear. 'Don't let\nme disturb you,' he said, with a certain faltering articulation.\n'I'm all right.' He stopped, held out his glass for more, and took\nit off at a draught. 'That's good,' he said. His eyes grew brighter,\nand a faint colour came into his cheeks. His glance flickered over\nour faces with a certain dull approval, and then went round the warm\nand comfortable room. Then he spoke again, still as it were feeling\nhis way among his words. 'I'm going to wash and dress, and then I'll\ncome down and explain things ... Save me some of that mutton. I'm\nstarving for a bit of meat.'\n\nHe looked across at the Editor, who was a rare visitor, and hoped he\nwas all right. The Editor began a question. 'Tell you presently,'\nsaid the Time Traveller. 'I'm--funny! Be all right in a minute.'\n\nHe put down his glass, and walked towards the staircase door. Again\nI remarked his lameness and the soft padding sound of his footfall,\nand standing up in my place, I saw his feet as he went out. He had\nnothing on them but a pair of tattered, blood-stained socks. Then the\ndoor closed upon him. I had half a mind to follow, till I remembered\nhow he detested any fuss about himself. For a minute, perhaps, my\nmind was wool-gathering. Then, 'Remarkable Behaviour of an Eminent\nScientist,' I heard the Editor say, thinking (after his wont) in\nheadlines. And this brought my attention back to the bright\ndinner-table.\n\n'What's the game?' said the Journalist. 'Has he been doing the\nAmateur Cadger? I don't follow.' I met the eye of the Psychologist,\nand read my own interpretation in his face. I thought of the Time\nTraveller limping painfully upstairs. I don't think any one else had\nnoticed his lameness.\n\nThe first to recover completely from this surprise was the Medical\nMan, who rang the bell--the Time Traveller hated to have servants\nwaiting at dinner--for a hot plate. At that the Editor turned to his\nknife and fork with a grunt, and the Silent Man followed suit. The\ndinner was resumed. Conversation was exclamatory for a little while,\nwith gaps of wonderment; and then the Editor got fervent in his\ncuriosity. 'Does our friend eke out his modest income with a\ncrossing? or has he his Nebuchadnezzar phases?' he inquired. 'I feel\nassured it's this business of the Time Machine,' I said, and took up\nthe Psychologist's account of our previous meeting. The new guests\nwere frankly incredulous. The Editor raised objections. 'What _was_\nthis time travelling? A man couldn't cover himself with dust by\nrolling in a paradox, could he?' And then, as the idea came home to\nhim, he resorted to caricature. Hadn't they any clothes-brushes in\nthe Future? The Journalist too, would not believe at any price, and\njoined the Editor in the easy work of heaping ridicule on the whole\nthing. They were both the new kind of journalist--very joyous,\nirreverent young men. 'Our Special Correspondent in the Day\nafter To-morrow reports,' the Journalist was saying--or rather\nshouting--when the Time Traveller came back. He was dressed in\nordinary evening clothes, and nothing save his haggard look remained\nof the change that had startled me.\n\n'I say,' said the Editor hilariously, 'these chaps here say you have\nbeen travelling into the middle of next week! Tell us all about\nlittle Rosebery, will you? What will you take for the lot?'\n\nThe Time Traveller came to the place reserved for him without a\nword. He smiled quietly, in his old way. 'Where's my mutton?' he\nsaid. 'What a treat it is to stick a fork into meat again!'\n\n'Story!' cried the Editor.\n\n'Story be damned!' said the Time Traveller. 'I want something to\neat. I won't say a word until I get some peptone into my arteries.\nThanks. And the salt.'\n\n'One word,' said I. 'Have you been time travelling?'\n\n'Yes,' said the Time Traveller, with his mouth full, nodding his\nhead.\n\n'I'd give a shilling a line for a verbatim note,' said the Editor.\nThe Time Traveller pushed his glass towards the Silent Man and rang\nit with his fingernail; at which the Silent Man, who had been\nstaring at his face, started convulsively, and poured him wine.\nThe rest of the dinner was uncomfortable. For my own part, sudden\nquestions kept on rising to my lips, and I dare say it was the same\nwith the others. The Journalist tried to relieve the tension by\ntelling anecdotes of Hettie Potter. The Time Traveller devoted his\nattention to his dinner, and displayed the appetite of a tramp.\nThe Medical Man smoked a cigarette, and watched the Time Traveller\nthrough his eyelashes. The Silent Man seemed even more clumsy than\nusual, and drank champagne with regularity and determination out of\nsheer nervousness. At last the Time Traveller pushed his plate away,\nand looked round us. 'I suppose I must apologize,' he said. 'I was\nsimply starving. I've had a most amazing time.' He reached out his\nhand for a cigar, and cut the end. 'But come into the smoking-room.\nIt's too long a story to tell over greasy plates.' And ringing the\nbell in passing, he led the way into the adjoining room.\n\n'You have told Blank, and Dash, and Chose about the machine?' he\nsaid to me, leaning back in his easy-chair and naming the three new\nguests.\n\n'But the thing's a mere paradox,' said the Editor.\n\n'I can't argue to-night. I don't mind telling you the story, but\nI can't argue. I will,' he went on, 'tell you the story of what\nhas happened to me, if you like, but you must refrain from\ninterruptions. I want to tell it. Badly. Most of it will sound like\nlying. So be it! It's true--every word of it, all the same. I was in\nmy laboratory at four o'clock, and since then ... I've lived eight\ndays ... such days as no human being ever lived before! I'm nearly\nworn out, but I shan't sleep till I've told this thing over to you.\nThen I shall go to bed. But no interruptions! Is it agreed?'\n\n'Agreed,' said the Editor, and the rest of us echoed 'Agreed.' And\nwith that the Time Traveller began his story as I have set it forth.\nHe sat back in his chair at first, and spoke like a weary man.\nAfterwards he got more animated. In writing it down I feel with only\ntoo much keenness the inadequacy of pen and ink--and, above all, my\nown inadequacy--to express its quality. You read, I will suppose,\nattentively enough; but you cannot see the speaker's white,\nsincere face in the bright circle of the little lamp, nor hear the\nintonation of his voice. You cannot know how his expression followed\nthe turns of his story! Most of us hearers were in shadow, for the\ncandles in the smoking-room had not been lighted, and only the face\nof the Journalist and the legs of the Silent Man from the knees\ndownward were illuminated. At first we glanced now and again at each\nother. After a time we ceased to do that, and looked only at the\nTime Traveller's face.\n\n\n\n\nIII\n\n\n'I told some of you last Thursday of the principles of the Time\nMachine, and showed you the actual thing itself, incomplete in the\nworkshop. There it is now, a little travel-worn, truly; and one of\nthe ivory bars is cracked, and a brass rail bent; but the rest of\nit's sound enough. I expected to finish it on Friday, but on Friday,\nwhen the putting together was nearly done, I found that one of the\nnickel bars was exactly one inch too short, and this I had to get\nremade; so that the thing was not complete until this morning. It\nwas at ten o'clock to-day that the first of all Time Machines began\nits career. I gave it a last tap, tried all the screws again, put\none more drop of oil on the quartz rod, and sat myself in the\nsaddle. I suppose a suicide who holds a pistol to his skull feels\nmuch the same wonder at what will come next as I felt then. I took\nthe starting lever in one hand and the stopping one in the other,\npressed the first, and almost immediately the second. I seemed to\nreel; I felt a nightmare sensation of falling; and, looking round,\nI saw the laboratory exactly as before. Had anything happened? For\na moment I suspected that my intellect had tricked me. Then I noted\nthe clock. A moment before, as it seemed, it had stood at a minute\nor so past ten; now it was nearly half-past three!\n\n'I drew a breath, set my teeth, gripped the starting lever with both\nhands, and went off with a thud. The laboratory got hazy and went\ndark. Mrs. Watchett came in and walked, apparently without seeing\nme, towards the garden door. I suppose it took her a minute or so to\ntraverse the place, but to me she seemed to shoot across the room\nlike a rocket. I pressed the lever over to its extreme position. The\nnight came like the turning out of a lamp, and in another moment\ncame to-morrow. The laboratory grew faint and hazy, then fainter\nand ever fainter. To-morrow night came black, then day again, night\nagain, day again, faster and faster still. An eddying murmur filled\nmy ears, and a strange, dumb confusedness descended on my mind.\n\n'I am afraid I cannot convey the peculiar sensations of time\ntravelling. They are excessively unpleasant. There is a feeling\nexactly like that one has upon a switchback--of a helpless headlong\nmotion! I felt the same horrible anticipation, too, of an imminent\nsmash. As I put on pace, night followed day like the flapping of a\nblack wing. The dim suggestion of the laboratory seemed presently to\nfall away from me, and I saw the sun hopping swiftly across the sky,\nleaping it every minute, and every minute marking a day. I supposed\nthe laboratory had been destroyed and I had come into the open air.\nI had a dim impression of scaffolding, but I was already going too\nfast to be conscious of any moving things. The slowest snail that\never crawled dashed by too fast for me. The twinkling succession of\ndarkness and light was excessively painful to the eye. Then, in the\nintermittent darknesses, I saw the moon spinning swiftly through her\nquarters from new to full, and had a faint glimpse of the circling\nstars. Presently, as I went on, still gaining velocity, the\npalpitation of night and day merged into one continuous greyness;\nthe sky took on a wonderful deepness of blue, a splendid luminous\ncolor like that of early twilight; the jerking sun became a streak\nof fire, a brilliant arch, in space; the moon a fainter fluctuating\nband; and I could see nothing of the stars, save now and then a\nbrighter circle flickering in the blue.\n\n'The landscape was misty and vague. I was still on the hill-side\nupon which this house now stands, and the shoulder rose above me\ngrey and dim. I saw trees growing and changing like puffs of vapour,\nnow brown, now green; they grew, spread, shivered, and passed away.\nI saw huge buildings rise up faint and fair, and pass like dreams.\nThe whole surface of the earth seemed changed--melting and flowing\nunder my eyes. The little hands upon the dials that registered my\nspeed raced round faster and faster. Presently I noted that the sun\nbelt swayed up and down, from solstice to solstice, in a minute or\nless, and that consequently my pace was over a year a minute; and\nminute by minute the white snow flashed across the world, and\nvanished, and was followed by the bright, brief green of spring.\n\n'The unpleasant sensations of the start were less poignant now. They\nmerged at last into a kind of hysterical exhilaration. I remarked\nindeed a clumsy swaying of the machine, for which I was unable to\naccount. But my mind was too confused to attend to it, so with a\nkind of madness growing upon me, I flung myself into futurity. At\nfirst I scarce thought of stopping, scarce thought of anything but\nthese new sensations. But presently a fresh series of impressions\ngrew up in my mind--a certain curiosity and therewith a certain\ndread--until at last they took complete possession of me. What\nstrange developments of humanity, what wonderful advances upon our\nrudimentary civilization, I thought, might not appear when I came to\nlook nearly into the dim elusive world that raced and fluctuated\nbefore my eyes! I saw great and splendid architecture rising about\nme, more massive than any buildings of our own time, and yet, as it\nseemed, built of glimmer and mist. I saw a richer green flow up the\nhill-side, and remain there, without any wintry intermission. Even\nthrough the veil of my confusion the earth seemed very fair. And so\nmy mind came round to the business of stopping.\n\n'The peculiar risk lay in the possibility of my finding some\nsubstance in the space which I, or the machine, occupied. So long\nas I travelled at a high velocity through time, this scarcely\nmattered; I was, so to speak, attenuated--was slipping like a vapour\nthrough the interstices of intervening substances! But to come to\na stop involved the jamming of myself, molecule by molecule, into\nwhatever lay in my way; meant bringing my atoms into such intimate\ncontact with those of the obstacle that a profound chemical\nreaction--possibly a far-reaching explosion--would result, and blow\nmyself and my apparatus out of all possible dimensions--into the\nUnknown. This possibility had occurred to me again and again while I\nwas making the machine; but then I had cheerfully accepted it as an\nunavoidable risk--one of the risks a man has got to take! Now the\nrisk was inevitable, I no longer saw it in the same cheerful light.\nThe fact is that, insensibly, the absolute strangeness of everything,\nthe sickly jarring and swaying of the machine, above all, the\nfeeling of prolonged falling, had absolutely upset my nerve. I told\nmyself that I could never stop, and with a gust of petulance I\nresolved to stop forthwith. Like an impatient fool, I lugged over\nthe lever, and incontinently the thing went reeling over, and I was\nflung headlong through the air.\n\n'There was the sound of a clap of thunder in my ears. I may have\nbeen stunned for a moment. A pitiless hail was hissing round me,\nand I was sitting on soft turf in front of the overset machine.\nEverything still seemed grey, but presently I remarked that the\nconfusion in my ears was gone. I looked round me. I was on what\nseemed to be a little lawn in a garden, surrounded by rhododendron\nbushes, and I noticed that their mauve and purple blossoms were\ndropping in a shower under the beating of the hail-stones. The\nrebounding, dancing hail hung in a cloud over the machine, and drove\nalong the ground like smoke. In a moment I was wet to the skin.\n\"Fine hospitality,\" said I, \"to a man who has travelled innumerable\nyears to see you.\"\n\n'Presently I thought what a fool I was to get wet. I stood up and\nlooked round me. A colossal figure, carved apparently in some white\nstone, loomed indistinctly beyond the rhododendrons through the hazy\ndownpour. But all else of the world was invisible.\n\n'My sensations would be hard to describe. As the columns of hail\ngrew thinner, I saw the white figure more distinctly. It was very\nlarge, for a silver birch-tree touched its shoulder. It was of white\nmarble, in shape something like a winged sphinx, but the wings,\ninstead of being carried vertically at the sides, were spread so\nthat it seemed to hover. The pedestal, it appeared to me, was of\nbronze, and was thick with verdigris. It chanced that the face was\ntowards me; the sightless eyes seemed to watch me; there was the\nfaint shadow of a smile on the lips. It was greatly weather-worn,\nand that imparted an unpleasant suggestion of disease. I stood\nlooking at it for a little space--half a minute, perhaps, or half an\nhour. It seemed to advance and to recede as the hail drove before it\ndenser or thinner. At last I tore my eyes from it for a moment and\nsaw that the hail curtain had worn threadbare, and that the sky was\nlightening with the promise of the sun.\n\n'I looked up again at the crouching white shape, and the full\ntemerity of my voyage came suddenly upon me. What might appear when\nthat hazy curtain was altogether withdrawn? What might not have\nhappened to men? What if cruelty had grown into a common passion?\nWhat if in this interval the race had lost its manliness and had\ndeveloped into something inhuman, unsympathetic, and overwhelmingly\npowerful? I might seem some old-world savage animal, only the more\ndreadful and disgusting for our common likeness--a foul creature to\nbe incontinently slain.\n\n'Already I saw other vast shapes--huge buildings with intricate\nparapets and tall columns, with a wooded hill-side dimly creeping\nin upon me through the lessening storm. I was seized with a panic\nfear. I turned frantically to the Time Machine, and strove hard to\nreadjust it. As I did so the shafts of the sun smote through the\nthunderstorm. The grey downpour was swept aside and vanished like\nthe trailing garments of a ghost. Above me, in the intense blue\nof the summer sky, some faint brown shreds of cloud whirled into\nnothingness. The great buildings about me stood out clear and\ndistinct, shining with the wet of the thunderstorm, and picked out\nin white by the unmelted hailstones piled along their courses. I\nfelt naked in a strange world. I felt as perhaps a bird may feel in\nthe clear air, knowing the hawk wings above and will swoop. My fear\ngrew to frenzy. I took a breathing space, set my teeth, and again\ngrappled fiercely, wrist and knee, with the machine. It gave under\nmy desperate onset and turned over. It struck my chin violently. One\nhand on the saddle, the other on the lever, I stood panting heavily\nin attitude to mount again.\n\n'But with this recovery of a prompt retreat my courage recovered. I\nlooked more curiously and less fearfully at this world of the remote\nfuture. In a circular opening, high up in the wall of the nearer\nhouse, I saw a group of figures clad in rich soft robes. They had\nseen me, and their faces were directed towards me.\n\n'Then I heard voices approaching me. Coming through the bushes by\nthe White Sphinx were the heads and shoulders of men running. One of\nthese emerged in a pathway leading straight to the little lawn upon\nwhich I stood with my machine. He was a slight creature--perhaps\nfour feet high--clad in a purple tunic, girdled at the waist with a\nleather belt. Sandals or buskins--I could not clearly distinguish\nwhich--were on his feet; his legs were bare to the knees, and his\nhead was bare. Noticing that, I noticed for the first time how warm\nthe air was.\n\n'He struck me as being a very beautiful and graceful creature, but\nindescribably frail. His flushed face reminded me of the more\nbeautiful kind of consumptive--that hectic beauty of which we used\nto hear so much. At the sight of him I suddenly regained confidence.\nI took my hands from the machine.\n\n\n\n\nIV\n\n\n'In another moment we were standing face to face, I and this fragile\nthing out of futurity. He came straight up to me and laughed into my\neyes. The absence from his bearing of any sign of fear struck me at\nonce. Then he turned to the two others who were following him and\nspoke to them in a strange and very sweet and liquid tongue.\n\n'There were others coming, and presently a little group of perhaps\neight or ten of these exquisite creatures were about me. One of them\naddressed me. It came into my head, oddly enough, that my voice was\ntoo harsh and deep for them. So I shook my head, and, pointing to my\nears, shook it again. He came a step forward, hesitated, and then\ntouched my hand. Then I felt other soft little tentacles upon my\nback and shoulders. They wanted to make sure I was real. There was\nnothing in this at all alarming. Indeed, there was something in\nthese pretty little people that inspired confidence--a graceful\ngentleness, a certain childlike ease. And besides, they looked so\nfrail that I could fancy myself flinging the whole dozen of them\nabout like nine-pins. But I made a sudden motion to warn them when I\nsaw their little pink hands feeling at the Time Machine. Happily\nthen, when it was not too late, I thought of a danger I had hitherto\nforgotten, and reaching over the bars of the machine I unscrewed the\nlittle levers that would set it in motion, and put these in my\npocket. Then I turned again to see what I could do in the way of\ncommunication.\n\n'And then, looking more nearly into their features, I saw some\nfurther peculiarities in their Dresden-china type of prettiness.\nTheir hair, which was uniformly curly, came to a sharp end at the\nneck and cheek; there was not the faintest suggestion of it on the\nface, and their ears were singularly minute. The mouths were small,\nwith bright red, rather thin lips, and the little chins ran to a\npoint. The eyes were large and mild; and--this may seem egotism on\nmy part--I fancied even that there was a certain lack of the\ninterest I might have expected in them.\n\n'As they made no effort to communicate with me, but simply stood\nround me smiling and speaking in soft cooing notes to each other, I\nbegan the conversation. I pointed to the Time Machine and to myself.\nThen hesitating for a moment how to express time, I pointed to the\nsun. At once a quaintly pretty little figure in chequered purple and\nwhite followed my gesture, and then astonished me by imitating the\nsound of thunder.\n\n'For a moment I was staggered, though the import of his gesture was\nplain enough. The question had come into my mind abruptly: were\nthese creatures fools? You may hardly understand how it took me.\nYou see I had always anticipated that the people of the year Eight\nHundred and Two Thousand odd would be incredibly in front of us in\nknowledge, art, everything. Then one of them suddenly asked me a\nquestion that showed him to be on the intellectual level of one of\nour five-year-old children--asked me, in fact, if I had come from\nthe sun in a thunderstorm! It let loose the judgment I had suspended\nupon their clothes, their frail light limbs, and fragile features.\nA flow of disappointment rushed across my mind. For a moment I felt\nthat I had built the Time Machine in vain.\n\n'I nodded, pointed to the sun, and gave them such a vivid rendering\nof a thunderclap as startled them. They all withdrew a pace or so\nand bowed. Then came one laughing towards me, carrying a chain of\nbeautiful flowers altogether new to me, and put it about my neck.\nThe idea was received with melodious applause; and presently they\nwere all running to and fro for flowers, and laughingly flinging\nthem upon me until I was almost smothered with blossom. You who\nhave never seen the like can scarcely imagine what delicate and\nwonderful flowers countless years of culture had created. Then\nsomeone suggested that their plaything should be exhibited in the\nnearest building, and so I was led past the sphinx of white marble,\nwhich had seemed to watch me all the while with a smile at my\nastonishment, towards a vast grey edifice of fretted stone. As I\nwent with them the memory of my confident anticipations of a\nprofoundly grave and intellectual posterity came, with irresistible\nmerriment, to my mind.\n\n'The building had a huge entry, and was altogether of colossal\ndimensions. I was naturally most occupied with the growing crowd of\nlittle people, and with the big open portals that yawned before me\nshadowy and mysterious. My general impression of the world I saw\nover their heads was a tangled waste of beautiful bushes and\nflowers, a long neglected and yet weedless garden. I saw a number\nof tall spikes of strange white flowers, measuring a foot perhaps\nacross the spread of the waxen petals. They grew scattered, as if\nwild, among the variegated shrubs, but, as I say, I did not examine\nthem closely at this time. The Time Machine was left deserted on the\nturf among the rhododendrons.\n\n'The arch of the doorway was richly carved, but naturally I did\nnot observe the carving very narrowly, though I fancied I saw\nsuggestions of old Phoenician decorations as I passed through, and\nit struck me that they were very badly broken and weather-worn.\nSeveral more brightly clad people met me in the doorway, and so we\nentered, I, dressed in dingy nineteenth-century garments, looking\ngrotesque enough, garlanded with flowers, and surrounded by an\neddying mass of bright, soft-colored robes and shining white limbs,\nin a melodious whirl of laughter and laughing speech.\n\n'The big doorway opened into a proportionately great hall hung with\nbrown. The roof was in shadow, and the windows, partially glazed\nwith coloured glass and partially unglazed, admitted a tempered\nlight. The floor was made up of huge blocks of some very hard white\nmetal, not plates nor slabs--blocks, and it was so much worn, as I\njudged by the going to and fro of past generations, as to be deeply\nchannelled along the more frequented ways. Transverse to the length\nwere innumerable tables made of slabs of polished stone, raised\nperhaps a foot from the floor, and upon these were heaps of fruits.\nSome I recognized as a kind of hypertrophied raspberry and orange,\nbut for the most part they were strange.\n\n'Between the tables was scattered a great number of cushions.\nUpon these my conductors seated themselves, signing for me to do\nlikewise. With a pretty absence of ceremony they began to eat the\nfruit with their hands, flinging peel and stalks, and so forth, into\nthe round openings in the sides of the tables. I was not loath to\nfollow their example, for I felt thirsty and hungry. As I did so I\nsurveyed the hall at my leisure.\n\n'And perhaps the thing that struck me most was its dilapidated look.\nThe stained-glass windows, which displayed only a geometrical\npattern, were broken in many places, and the curtains that hung\nacross the lower end were thick with dust. And it caught my eye that\nthe corner of the marble table near me was fractured. Nevertheless,\nthe general effect was extremely rich and picturesque. There were,\nperhaps, a couple of hundred people dining in the hall, and most of\nthem, seated as near to me as they could come, were watching me with\ninterest, their little eyes shining over the fruit they were eating.\nAll were clad in the same soft and yet strong, silky material.\n\n'Fruit, by the by, was all their diet. These people of the remote\nfuture were strict vegetarians, and while I was with them, in spite\nof some carnal cravings, I had to be frugivorous also. Indeed, I\nfound afterwards that horses, cattle, sheep, dogs, had followed the\nIchthyosaurus into extinction. But the fruits were very delightful;\none, in particular, that seemed to be in season all the time I was\nthere--a floury thing in a three-sided husk--was especially good,\nand I made it my staple. At first I was puzzled by all these strange\nfruits, and by the strange flowers I saw, but later I began to\nperceive their import.\n\n'However, I am telling you of my fruit dinner in the distant future\nnow. So soon as my appetite was a little checked, I determined to\nmake a resolute attempt to learn the speech of these new men of\nmine. Clearly that was the next thing to do. The fruits seemed a\nconvenient thing to begin upon, and holding one of these up I began\na series of interrogative sounds and gestures. I had some\nconsiderable difficulty in conveying my meaning. At first my efforts\nmet with a stare of surprise or inextinguishable laughter, but\npresently a fair-haired little creature seemed to grasp my intention\nand repeated a name. They had to chatter and explain the business\nat great length to each other, and my first attempts to make the\nexquisite little sounds of their language caused an immense amount\nof amusement. However, I felt like a schoolmaster amidst children,\nand persisted, and presently I had a score of noun substantives at\nleast at my command; and then I got to demonstrative pronouns, and\neven the verb \"to eat.\" But it was slow work, and the little people\nsoon tired and wanted to get away from my interrogations, so I\ndetermined, rather of necessity, to let them give their lessons in\nlittle doses when they felt inclined. And very little doses I found\nthey were before long, for I never met people more indolent or more\neasily fatigued.\n\n'A queer thing I soon discovered about my little hosts, and that was\ntheir lack of interest. They would come to me with eager cries of\nastonishment, like children, but like children they would soon stop\nexamining me and wander away after some other toy. The dinner and my\nconversational beginnings ended, I noted for the first time that\nalmost all those who had surrounded me at first were gone. It is\nodd, too, how speedily I came to disregard these little people. I\nwent out through the portal into the sunlit world again as soon as\nmy hunger was satisfied. I was continually meeting more of these men\nof the future, who would follow me a little distance, chatter and\nlaugh about me, and, having smiled and gesticulated in a friendly\nway, leave me again to my own devices.\n\n'The calm of evening was upon the world as I emerged from the great\nhall, and the scene was lit by the warm glow of the setting sun.\nAt first things were very confusing. Everything was so entirely\ndifferent from the world I had known--even the flowers. The big\nbuilding I had left was situated on the slope of a broad river\nvalley, but the Thames had shifted perhaps a mile from its present\nposition. I resolved to mount to the summit of a crest, perhaps a\nmile and a half away, from which I could get a wider view of this\nour planet in the year Eight Hundred and Two Thousand Seven Hundred\nand One A.D. For that, I should explain, was the date the little\ndials of my machine recorded.\n\n'As I walked I was watching for every impression that could possibly\nhelp to explain the condition of ruinous splendour in which I\nfound the world--for ruinous it was. A little way up the hill, for\ninstance, was a great heap of granite, bound together by masses of\naluminium, a vast labyrinth of precipitous walls and crumpled\nheaps, amidst which were thick heaps of very beautiful pagoda-like\nplants--nettles possibly--but wonderfully tinted with brown about\nthe leaves, and incapable of stinging. It was evidently the derelict\nremains of some vast structure, to what end built I could not\ndetermine. It was here that I was destined, at a later date, to have\na very strange experience--the first intimation of a still stranger\ndiscovery--but of that I will speak in its proper place.\n\n'Looking round with a sudden thought, from a terrace on which I\nrested for a while, I realized that there were no small houses to be\nseen. Apparently the single house, and possibly even the household,\nhad vanished. Here and there among the greenery were palace-like\nbuildings, but the house and the cottage, which form such\ncharacteristic features of our own English landscape, had\ndisappeared.\n\n'\"Communism,\" said I to myself.\n\n'And on the heels of that came another thought. I looked at the\nhalf-dozen little figures that were following me. Then, in a flash,\nI perceived that all had the same form of costume, the same soft\nhairless visage, and the same girlish rotundity of limb. It may seem\nstrange, perhaps, that I had not noticed this before. But everything\nwas so strange. Now, I saw the fact plainly enough. In costume, and\nin all the differences of texture and bearing that now mark off the\nsexes from each other, these people of the future were alike. And\nthe children seemed to my eyes to be but the miniatures of their\nparents. I judged, then, that the children of that time were\nextremely precocious, physically at least, and I found afterwards\nabundant verification of my opinion.\n\n'Seeing the ease and security in which these people were living, I\nfelt that this close resemblance of the sexes was after all what\none would expect; for the strength of a man and the softness of a\nwoman, the institution of the family, and the differentiation of\noccupations are mere militant necessities of an age of physical\nforce; where population is balanced and abundant, much childbearing\nbecomes an evil rather than a blessing to the State; where\nviolence comes but rarely and off-spring are secure, there is less\nnecessity--indeed there is no necessity--for an efficient family,\nand the specialization of the sexes with reference to their\nchildren's needs disappears. We see some beginnings of this even\nin our own time, and in this future age it was complete. This, I\nmust remind you, was my speculation at the time. Later, I was to\nappreciate how far it fell short of the reality.\n\n'While I was musing upon these things, my attention was attracted by\na pretty little structure, like a well under a cupola. I thought in\na transitory way of the oddness of wells still existing, and then\nresumed the thread of my speculations. There were no large buildings\ntowards the top of the hill, and as my walking powers were evidently\nmiraculous, I was presently left alone for the first time. With a\nstrange sense of freedom and adventure I pushed on up to the crest.\n\n'There I found a seat of some yellow metal that I did not recognize,\ncorroded in places with a kind of pinkish rust and half smothered\nin soft moss, the arm-rests cast and filed into the resemblance of\ngriffins' heads. I sat down on it, and I surveyed the broad view of\nour old world under the sunset of that long day. It was as sweet and\nfair a view as I have ever seen. The sun had already gone below the\nhorizon and the west was flaming gold, touched with some horizontal\nbars of purple and crimson. Below was the valley of the Thames, in\nwhich the river lay like a band of burnished steel. I have already\nspoken of the great palaces dotted about among the variegated\ngreenery, some in ruins and some still occupied. Here and there rose\na white or silvery figure in the waste garden of the earth, here and\nthere came the sharp vertical line of some cupola or obelisk. There\nwere no hedges, no signs of proprietary rights, no evidences of\nagriculture; the whole earth had become a garden.\n\n'So watching, I began to put my interpretation upon the things I had\nseen, and as it shaped itself to me that evening, my interpretation\nwas something in this way. (Afterwards I found I had got only a\nhalf-truth--or only a glimpse of one facet of the truth.)\n\n'It seemed to me that I had happened upon humanity upon the wane.\nThe ruddy sunset set me thinking of the sunset of mankind. For the\nfirst time I began to realize an odd consequence of the social\neffort in which we are at present engaged. And yet, come to think,\nit is a logical consequence enough. Strength is the outcome of need;\nsecurity sets a premium on feebleness. The work of ameliorating the\nconditions of life--the true civilizing process that makes life more\nand more secure--had gone steadily on to a climax. One triumph of a\nunited humanity over Nature had followed another. Things that are\nnow mere dreams had become projects deliberately put in hand and\ncarried forward. And the harvest was what I saw!\n\n'After all, the sanitation and the agriculture of to-day are still\nin the rudimentary stage. The science of our time has attacked but\na little department of the field of human disease, but even so,\nit spreads its operations very steadily and persistently. Our\nagriculture and horticulture destroy a weed just here and there and\ncultivate perhaps a score or so of wholesome plants, leaving the\ngreater number to fight out a balance as they can. We improve our\nfavourite plants and animals--and how few they are--gradually by\nselective breeding; now a new and better peach, now a seedless\ngrape, now a sweeter and larger flower, now a more convenient breed\nof cattle. We improve them gradually, because our ideals are vague\nand tentative, and our knowledge is very limited; because Nature,\ntoo, is shy and slow in our clumsy hands. Some day all this will\nbe better organized, and still better. That is the drift of the\ncurrent in spite of the eddies. The whole world will be intelligent,\neducated, and co-operating; things will move faster and faster\ntowards the subjugation of Nature. In the end, wisely and carefully\nwe shall readjust the balance of animal and vegetable life to suit\nour human needs.\n\n'This adjustment, I say, must have been done, and done well; done\nindeed for all Time, in the space of Time across which my machine\nhad leaped. The air was free from gnats, the earth from weeds or\nfungi; everywhere were fruits and sweet and delightful flowers;\nbrilliant butterflies flew hither and thither. The ideal of\npreventive medicine was attained. Diseases had been stamped out. I\nsaw no evidence of any contagious diseases during all my stay. And I\nshall have to tell you later that even the processes of putrefaction\nand decay had been profoundly affected by these changes.\n\n'Social triumphs, too, had been effected. I saw mankind housed in\nsplendid shelters, gloriously clothed, and as yet I had found them\nengaged in no toil. There were no signs of struggle, neither social\nnor economical struggle. The shop, the advertisement, traffic, all\nthat commerce which constitutes the body of our world, was gone. It\nwas natural on that golden evening that I should jump at the idea of\na social paradise. The difficulty of increasing population had been\nmet, I guessed, and population had ceased to increase.\n\n'But with this change in condition comes inevitably adaptations to\nthe change. What, unless biological science is a mass of errors, is\nthe cause of human intelligence and vigour? Hardship and freedom:\nconditions under which the active, strong, and subtle survive and\nthe weaker go to the wall; conditions that put a premium upon the\nloyal alliance of capable men, upon self-restraint, patience, and\ndecision. And the institution of the family, and the emotions that\narise therein, the fierce jealousy, the tenderness for offspring,\nparental self-devotion, all found their justification and support in\nthe imminent dangers of the young. _Now_, where are these imminent\ndangers? There is a sentiment arising, and it will grow, against\nconnubial jealousy, against fierce maternity, against passion\nof all sorts; unnecessary things now, and things that make us\nuncomfortable, savage survivals, discords in a refined and pleasant\nlife.\n\n'I thought of the physical slightness of the people, their lack of\nintelligence, and those big abundant ruins, and it strengthened my\nbelief in a perfect conquest of Nature. For after the battle comes\nQuiet. Humanity had been strong, energetic, and intelligent, and had\nused all its abundant vitality to alter the conditions under which\nit lived. And now came the reaction of the altered conditions.\n\n'Under the new conditions of perfect comfort and security, that\nrestless energy, that with us is strength, would become weakness.\nEven in our own time certain tendencies and desires, once necessary\nto survival, are a constant source of failure. Physical courage and\nthe love of battle, for instance, are no great help--may even be\nhindrances--to a civilized man. And in a state of physical balance\nand security, power, intellectual as well as physical, would be out\nof place. For countless years I judged there had been no danger of\nwar or solitary violence, no danger from wild beasts, no wasting\ndisease to require strength of constitution, no need of toil. For\nsuch a life, what we should call the weak are as well equipped as\nthe strong, are indeed no longer weak. Better equipped indeed they\nare, for the strong would be fretted by an energy for which there\nwas no outlet. No doubt the exquisite beauty of the buildings I saw\nwas the outcome of the last surgings of the now purposeless energy\nof mankind before it settled down into perfect harmony with the\nconditions under which it lived--the flourish of that triumph which\nbegan the last great peace. This has ever been the fate of energy in\nsecurity; it takes to art and to eroticism, and then come languor\nand decay.\n\n'Even this artistic impetus would at last die away--had almost died\nin the Time I saw. To adorn themselves with flowers, to dance, to\nsing in the sunlight: so much was left of the artistic spirit, and\nno more. Even that would fade in the end into a contented\ninactivity. We are kept keen on the grindstone of pain and\nnecessity, and, it seemed to me, that here was that hateful\ngrindstone broken at last!\n\n'As I stood there in the gathering dark I thought that in this\nsimple explanation I had mastered the problem of the world--mastered\nthe whole secret of these delicious people. Possibly the checks they\nhad devised for the increase of population had succeeded too well,\nand their numbers had rather diminished than kept stationary.\nThat would account for the abandoned ruins. Very simple was my\nexplanation, and plausible enough--as most wrong theories are!\n\n\n\n\nV\n\n\n'As I stood there musing over this too perfect triumph of man, the\nfull moon, yellow and gibbous, came up out of an overflow of silver\nlight in the north-east. The bright little figures ceased to move\nabout below, a noiseless owl flitted by, and I shivered with the\nchill of the night. I determined to descend and find where I could\nsleep.\n\n'I looked for the building I knew. Then my eye travelled along to\nthe figure of the White Sphinx upon the pedestal of bronze, growing\ndistinct as the light of the rising moon grew brighter. I could see\nthe silver birch against it. There was the tangle of rhododendron\nbushes, black in the pale light, and there was the little lawn.\nI looked at the lawn again. A queer doubt chilled my complacency.\n\"No,\" said I stoutly to myself, \"that was not the lawn.\"\n\n'But it _was_ the lawn. For the white leprous face of the sphinx was\ntowards it. Can you imagine what I felt as this conviction came\nhome to me? But you cannot. The Time Machine was gone!\n\n'At once, like a lash across the face, came the possibility of\nlosing my own age, of being left helpless in this strange new world.\nThe bare thought of it was an actual physical sensation. I could\nfeel it grip me at the throat and stop my breathing. In another\nmoment I was in a passion of fear and running with great leaping\nstrides down the slope. Once I fell headlong and cut my face; I lost\nno time in stanching the blood, but jumped up and ran on, with a\nwarm trickle down my cheek and chin. All the time I ran I was saying\nto myself: \"They have moved it a little, pushed it under the bushes\nout of the way.\" Nevertheless, I ran with all my might. All the\ntime, with the certainty that sometimes comes with excessive dread,\nI knew that such assurance was folly, knew instinctively that the\nmachine was removed out of my reach. My breath came with pain. I\nsuppose I covered the whole distance from the hill crest to the\nlittle lawn, two miles perhaps, in ten minutes. And I am not a young\nman. I cursed aloud, as I ran, at my confident folly in leaving the\nmachine, wasting good breath thereby. I cried aloud, and none\nanswered. Not a creature seemed to be stirring in that moonlit\nworld.\n\n'When I reached the lawn my worst fears were realized. Not a trace\nof the thing was to be seen. I felt faint and cold when I faced the\nempty space among the black tangle of bushes. I ran round it\nfuriously, as if the thing might be hidden in a corner, and then\nstopped abruptly, with my hands clutching my hair. Above me towered\nthe sphinx, upon the bronze pedestal, white, shining, leprous, in\nthe light of the rising moon. It seemed to smile in mockery of my\ndismay.\n\n'I might have consoled myself by imagining the little people had put\nthe mechanism in some shelter for me, had I not felt assured of\ntheir physical and intellectual inadequacy. That is what dismayed\nme: the sense of some hitherto unsuspected power, through whose\nintervention my invention had vanished. Yet, for one thing I felt\nassured: unless some other age had produced its exact duplicate,\nthe machine could not have moved in time. The attachment of the\nlevers--I will show you the method later--prevented any one from\ntampering with it in that way when they were removed. It had moved,\nand was hid, only in space. But then, where could it be?\n\n'I think I must have had a kind of frenzy. I remember running\nviolently in and out among the moonlit bushes all round the sphinx,\nand startling some white animal that, in the dim light, I took for a\nsmall deer. I remember, too, late that night, beating the bushes\nwith my clenched fist until my knuckles were gashed and bleeding\nfrom the broken twigs. Then, sobbing and raving in my anguish of\nmind, I went down to the great building of stone. The big hall was\ndark, silent, and deserted. I slipped on the uneven floor, and fell\nover one of the malachite tables, almost breaking my shin. I lit a\nmatch and went on past the dusty curtains, of which I have told you.\n\n'There I found a second great hall covered with cushions, upon\nwhich, perhaps, a score or so of the little people were sleeping. I\nhave no doubt they found my second appearance strange enough, coming\nsuddenly out of the quiet darkness with inarticulate noises and the\nsplutter and flare of a match. For they had forgotten about matches.\n\"Where is my Time Machine?\" I began, bawling like an angry child,\nlaying hands upon them and shaking them up together. It must have\nbeen very queer to them. Some laughed, most of them looked sorely\nfrightened. When I saw them standing round me, it came into my head\nthat I was doing as foolish a thing as it was possible for me to do\nunder the circumstances, in trying to revive the sensation of fear.\nFor, reasoning from their daylight behaviour, I thought that fear\nmust be forgotten.\n\n'Abruptly, I dashed down the match, and, knocking one of the people\nover in my course, went blundering across the big dining-hall again,\nout under the moonlight. I heard cries of terror and their little\nfeet running and stumbling this way and that. I do not remember all\nI did as the moon crept up the sky. I suppose it was the unexpected\nnature of my loss that maddened me. I felt hopelessly cut off from\nmy own kind--a strange animal in an unknown world. I must have raved\nto and fro, screaming and crying upon God and Fate. I have a memory\nof horrible fatigue, as the long night of despair wore away; of\nlooking in this impossible place and that; of groping among moon-lit\nruins and touching strange creatures in the black shadows; at last,\nof lying on the ground near the sphinx and weeping with absolute\nwretchedness. I had nothing left but misery. Then I slept, and when\nI woke again it was full day, and a couple of sparrows were hopping\nround me on the turf within reach of my arm.\n\n'I sat up in the freshness of the morning, trying to remember how\nI had got there, and why I had such a profound sense of desertion\nand despair. Then things came clear in my mind. With the plain,\nreasonable daylight, I could look my circumstances fairly in the\nface. I saw the wild folly of my frenzy overnight, and I could\nreason with myself. \"Suppose the worst?\" I said. \"Suppose the\nmachine altogether lost--perhaps destroyed? It behoves me to be\ncalm and patient, to learn the way of the people, to get a clear\nidea of the method of my loss, and the means of getting materials\nand tools; so that in the end, perhaps, I may make another.\" That\nwould be my only hope, perhaps, but better than despair. And, after\nall, it was a beautiful and curious world.\n\n'But probably, the machine had only been taken away. Still, I must\nbe calm and patient, find its hiding-place, and recover it by force\nor cunning. And with that I scrambled to my feet and looked about\nme, wondering where I could bathe. I felt weary, stiff, and\ntravel-soiled. The freshness of the morning made me desire an equal\nfreshness. I had exhausted my emotion. Indeed, as I went about\nmy business, I found myself wondering at my intense excitement\novernight. I made a careful examination of the ground about the\nlittle lawn. I wasted some time in futile questionings, conveyed, as\nwell as I was able, to such of the little people as came by. They\nall failed to understand my gestures; some were simply stolid, some\nthought it was a jest and laughed at me. I had the hardest task in\nthe world to keep my hands off their pretty laughing faces. It was\na foolish impulse, but the devil begotten of fear and blind anger\nwas ill curbed and still eager to take advantage of my perplexity.\nThe turf gave better counsel. I found a groove ripped in it, about\nmidway between the pedestal of the sphinx and the marks of my feet\nwhere, on arrival, I had struggled with the overturned machine.\nThere were other signs of removal about, with queer narrow\nfootprints like those I could imagine made by a sloth. This directed\nmy closer attention to the pedestal. It was, as I think I have said,\nof bronze. It was not a mere block, but highly decorated with deep\nframed panels on either side. I went and rapped at these. The\npedestal was hollow. Examining the panels with care I found them\ndiscontinuous with the frames. There were no handles or keyholes,\nbut possibly the panels, if they were doors, as I supposed, opened\nfrom within. One thing was clear enough to my mind. It took no very\ngreat mental effort to infer that my Time Machine was inside that\npedestal. But how it got there was a different problem.\n\n'I saw the heads of two orange-clad people coming through the bushes\nand under some blossom-covered apple-trees towards me. I turned\nsmiling to them and beckoned them to me. They came, and then,\npointing to the bronze pedestal, I tried to intimate my wish to open\nit. But at my first gesture towards this they behaved very oddly. I\ndon't know how to convey their expression to you. Suppose you were\nto use a grossly improper gesture to a delicate-minded woman--it is\nhow she would look. They went off as if they had received the last\npossible insult. I tried a sweet-looking little chap in white next,\nwith exactly the same result. Somehow, his manner made me feel\nashamed of myself. But, as you know, I wanted the Time Machine, and\nI tried him once more. As he turned off, like the others, my temper\ngot the better of me. In three strides I was after him, had him by\nthe loose part of his robe round the neck, and began dragging him\ntowards the sphinx. Then I saw the horror and repugnance of his\nface, and all of a sudden I let him go.\n\n'But I was not beaten yet. I banged with my fist at the bronze\npanels. I thought I heard something stir inside--to be explicit,\nI thought I heard a sound like a chuckle--but I must have been\nmistaken. Then I got a big pebble from the river, and came and\nhammered till I had flattened a coil in the decorations, and the\nverdigris came off in powdery flakes. The delicate little people\nmust have heard me hammering in gusty outbreaks a mile away on\neither hand, but nothing came of it. I saw a crowd of them upon the\nslopes, looking furtively at me. At last, hot and tired, I sat down\nto watch the place. But I was too restless to watch long; I am too\nOccidental for a long vigil. I could work at a problem for years,\nbut to wait inactive for twenty-four hours--that is another matter.\n\n'I got up after a time, and began walking aimlessly through the\nbushes towards the hill again. \"Patience,\" said I to myself. \"If you\nwant your machine again you must leave that sphinx alone. If they\nmean to take your machine away, it's little good your wrecking their\nbronze panels, and if they don't, you will get it back as soon as\nyou can ask for it. To sit among all those unknown things before a\npuzzle like that is hopeless. That way lies monomania. Face this\nworld. Learn its ways, watch it, be careful of too hasty guesses\nat its meaning. In the end you will find clues to it all.\" Then\nsuddenly the humour of the situation came into my mind: the thought\nof the years I had spent in study and toil to get into the future\nage, and now my passion of anxiety to get out of it. I had made\nmyself the most complicated and the most hopeless trap that ever a\nman devised. Although it was at my own expense, I could not help\nmyself. I laughed aloud.\n\n'Going through the big palace, it seemed to me that the little\npeople avoided me. It may have been my fancy, or it may have had\nsomething to do with my hammering at the gates of bronze. Yet I felt\ntolerably sure of the avoidance. I was careful, however, to show no\nconcern and to abstain from any pursuit of them, and in the course\nof a day or two things got back to the old footing. I made what\nprogress I could in the language, and in addition I pushed my\nexplorations here and there. Either I missed some subtle point or\ntheir language was excessively simple--almost exclusively composed\nof concrete substantives and verbs. There seemed to be few, if any,\nabstract terms, or little use of figurative language. Their\nsentences were usually simple and of two words, and I failed to\nconvey or understand any but the simplest propositions. I determined\nto put the thought of my Time Machine and the mystery of the bronze\ndoors under the sphinx as much as possible in a corner of memory,\nuntil my growing knowledge would lead me back to them in a natural\nway. Yet a certain feeling, you may understand, tethered me in a\ncircle of a few miles round the point of my arrival.\n\n'So far as I could see, all the world displayed the same exuberant\nrichness as the Thames valley. From every hill I climbed I saw the\nsame abundance of splendid buildings, endlessly varied in material\nand style, the same clustering thickets of evergreens, the same\nblossom-laden trees and tree-ferns. Here and there water shone like\nsilver, and beyond, the land rose into blue undulating hills, and\nso faded into the serenity of the sky. A peculiar feature, which\npresently attracted my attention, was the presence of certain\ncircular wells, several, as it seemed to me, of a very great depth.\nOne lay by the path up the hill, which I had followed during my\nfirst walk. Like the others, it was rimmed with bronze, curiously\nwrought, and protected by a little cupola from the rain. Sitting by\nthe side of these wells, and peering down into the shafted darkness,\nI could see no gleam of water, nor could I start any reflection\nwith a lighted match. But in all of them I heard a certain sound:\na thud--thud--thud, like the beating of some big engine; and I\ndiscovered, from the flaring of my matches, that a steady current of\nair set down the shafts. Further, I threw a scrap of paper into the\nthroat of one, and, instead of fluttering slowly down, it was at\nonce sucked swiftly out of sight.\n\n'After a time, too, I came to connect these wells with tall towers\nstanding here and there upon the slopes; for above them there was\noften just such a flicker in the air as one sees on a hot day above\na sun-scorched beach. Putting things together, I reached a strong\nsuggestion of an extensive system of subterranean ventilation, whose\ntrue import it was difficult to imagine. I was at first inclined to\nassociate it with the sanitary apparatus of these people. It was an\nobvious conclusion, but it was absolutely wrong.\n\n'And here I must admit that I learned very little of drains and\nbells and modes of conveyance, and the like conveniences, during my\ntime in this real future. In some of these visions of Utopias and\ncoming times which I have read, there is a vast amount of detail\nabout building, and social arrangements, and so forth. But while\nsuch details are easy enough to obtain when the whole world is\ncontained in one's imagination, they are altogether inaccessible to\na real traveller amid such realities as I found here. Conceive the\ntale of London which a negro, fresh from Central Africa, would take\nback to his tribe! What would he know of railway companies, of\nsocial movements, of telephone and telegraph wires, of the Parcels\nDelivery Company, and postal orders and the like? Yet we, at least,\nshould be willing enough to explain these things to him! And even of\nwhat he knew, how much could he make his untravelled friend either\napprehend or believe? Then, think how narrow the gap between a negro\nand a white man of our own times, and how wide the interval between\nmyself and these of the Golden Age! I was sensible of much which was\nunseen, and which contributed to my comfort; but save for a general\nimpression of automatic organization, I fear I can convey very\nlittle of the difference to your mind.\n\n'In the matter of sepulture, for instance, I could see no signs of\ncrematoria nor anything suggestive of tombs. But it occurred to me\nthat, possibly, there might be cemeteries (or crematoria) somewhere\nbeyond the range of my explorings. This, again, was a question I\ndeliberately put to myself, and my curiosity was at first entirely\ndefeated upon the point. The thing puzzled me, and I was led to make\na further remark, which puzzled me still more: that aged and infirm\namong this people there were none.\n\n'I must confess that my satisfaction with my first theories of an\nautomatic civilization and a decadent humanity did not long endure.\nYet I could think of no other. Let me put my difficulties. The\nseveral big palaces I had explored were mere living places, great\ndining-halls and sleeping apartments. I could find no machinery, no\nappliances of any kind. Yet these people were clothed in pleasant\nfabrics that must at times need renewal, and their sandals, though\nundecorated, were fairly complex specimens of metalwork. Somehow\nsuch things must be made. And the little people displayed no vestige\nof a creative tendency. There were no shops, no workshops, no sign\nof importations among them. They spent all their time in playing\ngently, in bathing in the river, in making love in a half-playful\nfashion, in eating fruit and sleeping. I could not see how things\nwere kept going.\n\n'Then, again, about the Time Machine: something, I knew not what,\nhad taken it into the hollow pedestal of the White Sphinx. Why? For\nthe life of me I could not imagine. Those waterless wells, too,\nthose flickering pillars. I felt I lacked a clue. I felt--how shall\nI put it? Suppose you found an inscription, with sentences here and\nthere in excellent plain English, and interpolated therewith, others\nmade up of words, of letters even, absolutely unknown to you? Well,\non the third day of my visit, that was how the world of Eight\nHundred and Two Thousand Seven Hundred and One presented itself to\nme!\n\n'That day, too, I made a friend--of a sort. It happened that, as I\nwas watching some of the little people bathing in a shallow, one of\nthem was seized with cramp and began drifting downstream. The main\ncurrent ran rather swiftly, but not too strongly for even a moderate\nswimmer. It will give you an idea, therefore, of the strange\ndeficiency in these creatures, when I tell you that none made the\nslightest attempt to rescue the weakly crying little thing which\nwas drowning before their eyes. When I realized this, I hurriedly\nslipped off my clothes, and, wading in at a point lower down, I\ncaught the poor mite and drew her safe to land. A little rubbing of\nthe limbs soon brought her round, and I had the satisfaction of\nseeing she was all right before I left her. I had got to such a low\nestimate of her kind that I did not expect any gratitude from her.\nIn that, however, I was wrong.\n\n'This happened in the morning. In the afternoon I met my little\nwoman, as I believe it was, as I was returning towards my centre\nfrom an exploration, and she received me with cries of delight and\npresented me with a big garland of flowers--evidently made for me\nand me alone. The thing took my imagination. Very possibly I had\nbeen feeling desolate. At any rate I did my best to display my\nappreciation of the gift. We were soon seated together in a little\nstone arbour, engaged in conversation, chiefly of smiles. The\ncreature's friendliness affected me exactly as a child's might have\ndone. We passed each other flowers, and she kissed my hands. I did\nthe same to hers. Then I tried talk, and found that her name was\nWeena, which, though I don't know what it meant, somehow seemed\nappropriate enough. That was the beginning of a queer friendship\nwhich lasted a week, and ended--as I will tell you!\n\n'She was exactly like a child. She wanted to be with me always. She\ntried to follow me everywhere, and on my next journey out and about\nit went to my heart to tire her down, and leave her at last,\nexhausted and calling after me rather plaintively. But the problems\nof the world had to be mastered. I had not, I said to myself, come\ninto the future to carry on a miniature flirtation. Yet her distress\nwhen I left her was very great, her expostulations at the parting\nwere sometimes frantic, and I think, altogether, I had as much\ntrouble as comfort from her devotion. Nevertheless she was, somehow,\na very great comfort. I thought it was mere childish affection that\nmade her cling to me. Until it was too late, I did not clearly know\nwhat I had inflicted upon her when I left her. Nor until it was too\nlate did I clearly understand what she was to me. For, by merely\nseeming fond of me, and showing in her weak, futile way that she\ncared for me, the little doll of a creature presently gave my return\nto the neighbourhood of the White Sphinx almost the feeling of\ncoming home; and I would watch for her tiny figure of white and gold\nso soon as I came over the hill.\n\n'It was from her, too, that I learned that fear had not yet left the\nworld. She was fearless enough in the daylight, and she had the\noddest confidence in me; for once, in a foolish moment, I made\nthreatening grimaces at her, and she simply laughed at them. But she\ndreaded the dark, dreaded shadows, dreaded black things. Darkness\nto her was the one thing dreadful. It was a singularly passionate\nemotion, and it set me thinking and observing. I discovered then,\namong other things, that these little people gathered into the great\nhouses after dark, and slept in droves. To enter upon them without a\nlight was to put them into a tumult of apprehension. I never found\none out of doors, or one sleeping alone within doors, after dark.\nYet I was still such a blockhead that I missed the lesson of that\nfear, and in spite of Weena's distress I insisted upon sleeping away\nfrom these slumbering multitudes.\n\n'It troubled her greatly, but in the end her odd affection for me\ntriumphed, and for five of the nights of our acquaintance, including\nthe last night of all, she slept with her head pillowed on my arm.\nBut my story slips away from me as I speak of her. It must have been\nthe night before her rescue that I was awakened about dawn. I had\nbeen restless, dreaming most disagreeably that I was drowned, and\nthat sea anemones were feeling over my face with their soft palps.\nI woke with a start, and with an odd fancy that some greyish animal\nhad just rushed out of the chamber. I tried to get to sleep again,\nbut I felt restless and uncomfortable. It was that dim grey hour\nwhen things are just creeping out of darkness, when everything is\ncolourless and clear cut, and yet unreal. I got up, and went down\ninto the great hall, and so out upon the flagstones in front of the\npalace. I thought I would make a virtue of necessity, and see the\nsunrise.\n\n'The moon was setting, and the dying moonlight and the first pallor\nof dawn were mingled in a ghastly half-light. The bushes were inky\nblack, the ground a sombre grey, the sky colourless and cheerless.\nAnd up the hill I thought I could see ghosts. There several times,\nas I scanned the slope, I saw white figures. Twice I fancied I saw\na solitary white, ape-like creature running rather quickly up the\nhill, and once near the ruins I saw a leash of them carrying some\ndark body. They moved hastily. I did not see what became of them.\nIt seemed that they vanished among the bushes. The dawn was still\nindistinct, you must understand. I was feeling that chill,\nuncertain, early-morning feeling you may have known. I doubted\nmy eyes.\n\n'As the eastern sky grew brighter, and the light of the day came on\nand its vivid colouring returned upon the world once more, I scanned\nthe view keenly. But I saw no vestige of my white figures. They were\nmere creatures of the half light. \"They must have been ghosts,\" I\nsaid; \"I wonder whence they dated.\" For a queer notion of Grant\nAllen's came into my head, and amused me. If each generation die and\nleave ghosts, he argued, the world at last will get overcrowded with\nthem. On that theory they would have grown innumerable some Eight\nHundred Thousand Years hence, and it was no great wonder to see four\nat once. But the jest was unsatisfying, and I was thinking of these\nfigures all the morning, until Weena's rescue drove them out of my\nhead. I associated them in some indefinite way with the white animal\nI had startled in my first passionate search for the Time Machine.\nBut Weena was a pleasant substitute. Yet all the same, they were\nsoon destined to take far deadlier possession of my mind.\n\n'I think I have said how much hotter than our own was the weather\nof this Golden Age. I cannot account for it. It may be that the sun\nwas hotter, or the earth nearer the sun. It is usual to assume that\nthe sun will go on cooling steadily in the future. But people,\nunfamiliar with such speculations as those of the younger Darwin,\nforget that the planets must ultimately fall back one by one into\nthe parent body. As these catastrophes occur, the sun will blaze\nwith renewed energy; and it may be that some inner planet had\nsuffered this fate. Whatever the reason, the fact remains that the\nsun was very much hotter than we know it.\n\n'Well, one very hot morning--my fourth, I think--as I was seeking\nshelter from the heat and glare in a colossal ruin near the great\nhouse where I slept and fed, there happened this strange thing:\nClambering among these heaps of masonry, I found a narrow gallery,\nwhose end and side windows were blocked by fallen masses of stone.\nBy contrast with the brilliancy outside, it seemed at first\nimpenetrably dark to me. I entered it groping, for the change from\nlight to blackness made spots of colour swim before me. Suddenly I\nhalted spellbound. A pair of eyes, luminous by reflection against\nthe daylight without, was watching me out of the darkness.\n\n'The old instinctive dread of wild beasts came upon me. I clenched\nmy hands and steadfastly looked into the glaring eyeballs. I was\nafraid to turn. Then the thought of the absolute security in which\nhumanity appeared to be living came to my mind. And then I\nremembered that strange terror of the dark. Overcoming my fear to\nsome extent, I advanced a step and spoke. I will admit that my\nvoice was harsh and ill-controlled. I put out my hand and touched\nsomething soft. At once the eyes darted sideways, and something\nwhite ran past me. I turned with my heart in my mouth, and saw a\nqueer little ape-like figure, its head held down in a peculiar\nmanner, running across the sunlit space behind me. It blundered\nagainst a block of granite, staggered aside, and in a moment was\nhidden in a black shadow beneath another pile of ruined masonry.\n\n'My impression of it is, of course, imperfect; but I know it was a\ndull white, and had strange large greyish-red eyes; also that there\nwas flaxen hair on its head and down its back. But, as I say, it\nwent too fast for me to see distinctly. I cannot even say whether it\nran on all-fours, or only with its forearms held very low. After an\ninstant's pause I followed it into the second heap of ruins. I could\nnot find it at first; but, after a time in the profound obscurity, I\ncame upon one of those round well-like openings of which I have told\nyou, half closed by a fallen pillar. A sudden thought came to me.\nCould this Thing have vanished down the shaft? I lit a match, and,\nlooking down, I saw a small, white, moving creature, with large\nbright eyes which regarded me steadfastly as it retreated. It made\nme shudder. It was so like a human spider! It was clambering down\nthe wall, and now I saw for the first time a number of metal foot\nand hand rests forming a kind of ladder down the shaft. Then the\nlight burned my fingers and fell out of my hand, going out as it\ndropped, and when I had lit another the little monster had\ndisappeared.\n\n'I do not know how long I sat peering down that well. It was not for\nsome time that I could succeed in persuading myself that the thing I\nhad seen was human. But, gradually, the truth dawned on me: that\nMan had not remained one species, but had differentiated into two\ndistinct animals: that my graceful children of the Upper-world were\nnot the sole descendants of our generation, but that this bleached,\nobscene, nocturnal Thing, which had flashed before me, was also heir\nto all the ages.\n\n'I thought of the flickering pillars and of my theory of an\nunderground ventilation. I began to suspect their true import. And\nwhat, I wondered, was this Lemur doing in my scheme of a perfectly\nbalanced organization? How was it related to the indolent serenity\nof the beautiful Upper-worlders? And what was hidden down there,\nat the foot of that shaft? I sat upon the edge of the well telling\nmyself that, at any rate, there was nothing to fear, and that there\nI must descend for the solution of my difficulties. And withal I\nwas absolutely afraid to go! As I hesitated, two of the beautiful\nUpper-world people came running in their amorous sport across the\ndaylight in the shadow. The male pursued the female, flinging\nflowers at her as he ran.\n\n'They seemed distressed to find me, my arm against the overturned\npillar, peering down the well. Apparently it was considered bad form\nto remark these apertures; for when I pointed to this one, and tried\nto frame a question about it in their tongue, they were still more\nvisibly distressed and turned away. But they were interested by my\nmatches, and I struck some to amuse them. I tried them again about\nthe well, and again I failed. So presently I left them, meaning to\ngo back to Weena, and see what I could get from her. But my mind was\nalready in revolution; my guesses and impressions were slipping and\nsliding to a new adjustment. I had now a clue to the import of these\nwells, to the ventilating towers, to the mystery of the ghosts; to\nsay nothing of a hint at the meaning of the bronze gates and the\nfate of the Time Machine! And very vaguely there came a suggestion\ntowards the solution of the economic problem that had puzzled me.\n\n'Here was the new view. Plainly, this second species of Man was\nsubterranean. There were three circumstances in particular which\nmade me think that its rare emergence above ground was the outcome\nof a long-continued underground habit. In the first place, there was\nthe bleached look common in most animals that live largely in the\ndark--the white fish of the Kentucky caves, for instance. Then,\nthose large eyes, with that capacity for reflecting light, are\ncommon features of nocturnal things--witness the owl and the cat.\nAnd last of all, that evident confusion in the sunshine, that hasty\nyet fumbling awkward flight towards dark shadow, and that peculiar\ncarriage of the head while in the light--all reinforced the theory\nof an extreme sensitiveness of the retina.\n\n'Beneath my feet, then, the earth must be tunnelled enormously, and\nthese tunnellings were the habitat of the new race. The presence of\nventilating shafts and wells along the hill slopes--everywhere, in\nfact, except along the river valley--showed how universal were its\nramifications. What so natural, then, as to assume that it was in\nthis artificial Underworld that such work as was necessary to the\ncomfort of the daylight race was done? The notion was so plausible\nthat I at once accepted it, and went on to assume the _how_ of this\nsplitting of the human species. I dare say you will anticipate the\nshape of my theory; though, for myself, I very soon felt that it\nfell far short of the truth.\n\n'At first, proceeding from the problems of our own age, it seemed\nclear as daylight to me that the gradual widening of the present\nmerely temporary and social difference between the Capitalist and\nthe Labourer, was the key to the whole position. No doubt it will\nseem grotesque enough to you--and wildly incredible!--and yet even\nnow there are existing circumstances to point that way. There is\na tendency to utilize underground space for the less ornamental\npurposes of civilization; there is the Metropolitan Railway in\nLondon, for instance, there are new electric railways, there are\nsubways, there are underground workrooms and restaurants, and they\nincrease and multiply. Evidently, I thought, this tendency had\nincreased till Industry had gradually lost its birthright in the\nsky. I mean that it had gone deeper and deeper into larger and ever\nlarger underground factories, spending a still-increasing amount of\nits time therein, till, in the end--! Even now, does not an East-end\nworker live in such artificial conditions as practically to be cut\noff from the natural surface of the earth?\n\n'Again, the exclusive tendency of richer people--due, no doubt, to\nthe increasing refinement of their education, and the widening gulf\nbetween them and the rude violence of the poor--is already leading\nto the closing, in their interest, of considerable portions of the\nsurface of the land. About London, for instance, perhaps half the\nprettier country is shut in against intrusion. And this same\nwidening gulf--which is due to the length and expense of the higher\neducational process and the increased facilities for and temptations\ntowards refined habits on the part of the rich--will make that\nexchange between class and class, that promotion by intermarriage\nwhich at present retards the splitting of our species along lines\nof social stratification, less and less frequent. So, in the end,\nabove ground you must have the Haves, pursuing pleasure and comfort\nand beauty, and below ground the Have-nots, the Workers getting\ncontinually adapted to the conditions of their labour. Once they\nwere there, they would no doubt have to pay rent, and not a little\nof it, for the ventilation of their caverns; and if they refused,\nthey would starve or be suffocated for arrears. Such of them as were\nso constituted as to be miserable and rebellious would die; and, in\nthe end, the balance being permanent, the survivors would become as\nwell adapted to the conditions of underground life, and as happy in\ntheir way, as the Upper-world people were to theirs. As it seemed to\nme, the refined beauty and the etiolated pallor followed naturally\nenough.\n\n'The great triumph of Humanity I had dreamed of took a different\nshape in my mind. It had been no such triumph of moral education and\ngeneral co-operation as I had imagined. Instead, I saw a real\naristocracy, armed with a perfected science and working to a logical\nconclusion the industrial system of to-day. Its triumph had not been\nsimply a triumph over Nature, but a triumph over Nature and the\nfellow-man. This, I must warn you, was my theory at the time. I had\nno convenient cicerone in the pattern of the Utopian books. My\nexplanation may be absolutely wrong. I still think it is the\nmost plausible one. But even on this supposition the balanced\ncivilization that was at last attained must have long since passed\nits zenith, and was now far fallen into decay. The too-perfect\nsecurity of the Upper-worlders had led them to a slow movement of\ndegeneration, to a general dwindling in size, strength, and\nintelligence. That I could see clearly enough already. What had\nhappened to the Under-grounders I did not yet suspect; but from what\nI had seen of the Morlocks--that, by the by, was the name by which\nthese creatures were called--I could imagine that the modification\nof the human type was even far more profound than among the \"Eloi,\"\nthe beautiful race that I already knew.\n\n'Then came troublesome doubts. Why had the Morlocks taken my Time\nMachine? For I felt sure it was they who had taken it. Why, too, if\nthe Eloi were masters, could they not restore the machine to me? And\nwhy were they so terribly afraid of the dark? I proceeded, as I have\nsaid, to question Weena about this Under-world, but here again I was\ndisappointed. At first she would not understand my questions, and\npresently she refused to answer them. She shivered as though the\ntopic was unendurable. And when I pressed her, perhaps a little\nharshly, she burst into tears. They were the only tears, except my\nown, I ever saw in that Golden Age. When I saw them I ceased\nabruptly to trouble about the Morlocks, and was only concerned in\nbanishing these signs of the human inheritance from Weena's eyes.\nAnd very soon she was smiling and clapping her hands, while I\nsolemnly burned a match.\n\n\n\n\nVI\n\n\n'It may seem odd to you, but it was two days before I could follow\nup the new-found clue in what was manifestly the proper way. I felt\na peculiar shrinking from those pallid bodies. They were just the\nhalf-bleached colour of the worms and things one sees preserved in\nspirit in a zoological museum. And they were filthily cold to the\ntouch. Probably my shrinking was largely due to the sympathetic\ninfluence of the Eloi, whose disgust of the Morlocks I now began\nto appreciate.\n\n'The next night I did not sleep well. Probably my health was a\nlittle disordered. I was oppressed with perplexity and doubt. Once\nor twice I had a feeling of intense fear for which I could perceive\nno definite reason. I remember creeping noiselessly into the great\nhall where the little people were sleeping in the moonlight--that\nnight Weena was among them--and feeling reassured by their presence.\nIt occurred to me even then, that in the course of a few days the\nmoon must pass through its last quarter, and the nights grow dark,\nwhen the appearances of these unpleasant creatures from below, these\nwhitened Lemurs, this new vermin that had replaced the old, might be\nmore abundant. And on both these days I had the restless feeling of\none who shirks an inevitable duty. I felt assured that the Time\nMachine was only to be recovered by boldly penetrating these\nunderground mysteries. Yet I could not face the mystery. If only I\nhad had a companion it would have been different. But I was so\nhorribly alone, and even to clamber down into the darkness of the\nwell appalled me. I don't know if you will understand my feeling,\nbut I never felt quite safe at my back.\n\n'It was this restlessness, this insecurity, perhaps, that drove me\nfurther and further afield in my exploring expeditions. Going to the\nsouth-westward towards the rising country that is now called Combe\nWood, I observed far off, in the direction of nineteenth-century\nBanstead, a vast green structure, different in character from any\nI had hitherto seen. It was larger than the largest of the palaces\nor ruins I knew, and the facade had an Oriental look: the face\nof it having the lustre, as well as the pale-green tint, a kind\nof bluish-green, of a certain type of Chinese porcelain. This\ndifference in aspect suggested a difference in use, and I was minded\nto push on and explore. But the day was growing late, and I had come\nupon the sight of the place after a long and tiring circuit; so I\nresolved to hold over the adventure for the following day, and I\nreturned to the welcome and the caresses of little Weena. But next\nmorning I perceived clearly enough that my curiosity regarding the\nPalace of Green Porcelain was a piece of self-deception, to enable\nme to shirk, by another day, an experience I dreaded. I resolved I\nwould make the descent without further waste of time, and started\nout in the early morning towards a well near the ruins of granite\nand aluminium.\n\n'Little Weena ran with me. She danced beside me to the well, but\nwhen she saw me lean over the mouth and look downward, she seemed\nstrangely disconcerted. \"Good-bye, little Weena,\" I said, kissing\nher; and then putting her down, I began to feel over the parapet\nfor the climbing hooks. Rather hastily, I may as well confess, for\nI feared my courage might leak away! At first she watched me in\namazement. Then she gave a most piteous cry, and running to me, she\nbegan to pull at me with her little hands. I think her opposition\nnerved me rather to proceed. I shook her off, perhaps a little\nroughly, and in another moment I was in the throat of the well. I\nsaw her agonized face over the parapet, and smiled to reassure her.\nThen I had to look down at the unstable hooks to which I clung.\n\n'I had to clamber down a shaft of perhaps two hundred yards. The\ndescent was effected by means of metallic bars projecting from\nthe sides of the well, and these being adapted to the needs of\na creature much smaller and lighter than myself, I was speedily\ncramped and fatigued by the descent. And not simply fatigued! One of\nthe bars bent suddenly under my weight, and almost swung me off into\nthe blackness beneath. For a moment I hung by one hand, and after\nthat experience I did not dare to rest again. Though my arms and\nback were presently acutely painful, I went on clambering down the\nsheer descent with as quick a motion as possible. Glancing upward,\nI saw the aperture, a small blue disk, in which a star was visible,\nwhile little Weena's head showed as a round black projection. The\nthudding sound of a machine below grew louder and more oppressive.\nEverything save that little disk above was profoundly dark, and when\nI looked up again Weena had disappeared.\n\n'I was in an agony of discomfort. I had some thought of trying to go\nup the shaft again, and leave the Under-world alone. But even while\nI turned this over in my mind I continued to descend. At last, with\nintense relief, I saw dimly coming up, a foot to the right of me, a\nslender loophole in the wall. Swinging myself in, I found it was the\naperture of a narrow horizontal tunnel in which I could lie down and\nrest. It was not too soon. My arms ached, my back was cramped, and I\nwas trembling with the prolonged terror of a fall. Besides this, the\nunbroken darkness had had a distressing effect upon my eyes. The air\nwas full of the throb and hum of machinery pumping air down the\nshaft.\n\n'I do not know how long I lay. I was roused by a soft hand touching\nmy face. Starting up in the darkness I snatched at my matches and,\nhastily striking one, I saw three stooping white creatures similar\nto the one I had seen above ground in the ruin, hastily retreating\nbefore the light. Living, as they did, in what appeared to me\nimpenetrable darkness, their eyes were abnormally large and\nsensitive, just as are the pupils of the abysmal fishes, and they\nreflected the light in the same way. I have no doubt they could see\nme in that rayless obscurity, and they did not seem to have any fear\nof me apart from the light. But, so soon as I struck a match in\norder to see them, they fled incontinently, vanishing into dark\ngutters and tunnels, from which their eyes glared at me in the\nstrangest fashion.\n\n'I tried to call to them, but the language they had was apparently\ndifferent from that of the Over-world people; so that I was needs\nleft to my own unaided efforts, and the thought of flight before\nexploration was even then in my mind. But I said to myself, \"You are\nin for it now,\" and, feeling my way along the tunnel, I found the\nnoise of machinery grow louder. Presently the walls fell away from\nme, and I came to a large open space, and striking another match,\nsaw that I had entered a vast arched cavern, which stretched into\nutter darkness beyond the range of my light. The view I had of it\nwas as much as one could see in the burning of a match.\n\n'Necessarily my memory is vague. Great shapes like big machines rose\nout of the dimness, and cast grotesque black shadows, in which dim\nspectral Morlocks sheltered from the glare. The place, by the by,\nwas very stuffy and oppressive, and the faint halitus of freshly\nshed blood was in the air. Some way down the central vista was a\nlittle table of white metal, laid with what seemed a meal. The\nMorlocks at any rate were carnivorous! Even at the time, I remember\nwondering what large animal could have survived to furnish the red\njoint I saw. It was all very indistinct: the heavy smell, the big\nunmeaning shapes, the obscene figures lurking in the shadows, and\nonly waiting for the darkness to come at me again! Then the match\nburned down, and stung my fingers, and fell, a wriggling red spot\nin the blackness.\n\n'I have thought since how particularly ill-equipped I was for such\nan experience. When I had started with the Time Machine, I had\nstarted with the absurd assumption that the men of the Future would\ncertainly be infinitely ahead of ourselves in all their appliances.\nI had come without arms, without medicine, without anything to\nsmoke--at times I missed tobacco frightfully--even without enough\nmatches. If only I had thought of a Kodak! I could have flashed that\nglimpse of the Underworld in a second, and examined it at leisure.\nBut, as it was, I stood there with only the weapons and the powers\nthat Nature had endowed me with--hands, feet, and teeth; these, and\nfour safety-matches that still remained to me.\n\n'I was afraid to push my way in among all this machinery in the\ndark, and it was only with my last glimpse of light I discovered\nthat my store of matches had run low. It had never occurred to me\nuntil that moment that there was any need to economize them, and I\nhad wasted almost half the box in astonishing the Upper-worlders, to\nwhom fire was a novelty. Now, as I say, I had four left, and while I\nstood in the dark, a hand touched mine, lank fingers came feeling\nover my face, and I was sensible of a peculiar unpleasant odour. I\nfancied I heard the breathing of a crowd of those dreadful little\nbeings about me. I felt the box of matches in my hand being gently\ndisengaged, and other hands behind me plucking at my clothing. The\nsense of these unseen creatures examining me was indescribably\nunpleasant. The sudden realization of my ignorance of their ways of\nthinking and doing came home to me very vividly in the darkness. I\nshouted at them as loudly as I could. They started away, and then\nI could feel them approaching me again. They clutched at me more\nboldly, whispering odd sounds to each other. I shivered violently,\nand shouted again--rather discordantly. This time they were not so\nseriously alarmed, and they made a queer laughing noise as they came\nback at me. I will confess I was horribly frightened. I determined\nto strike another match and escape under the protection of its\nglare. I did so, and eking out the flicker with a scrap of paper\nfrom my pocket, I made good my retreat to the narrow tunnel. But I\nhad scarce entered this when my light was blown out and in the\nblackness I could hear the Morlocks rustling like wind among leaves,\nand pattering like the rain, as they hurried after me.\n\n'In a moment I was clutched by several hands, and there was no\nmistaking that they were trying to haul me back. I struck another\nlight, and waved it in their dazzled faces. You can scarce imagine\nhow nauseatingly inhuman they looked--those pale, chinless faces\nand great, lidless, pinkish-grey eyes!--as they stared in their\nblindness and bewilderment. But I did not stay to look, I promise\nyou: I retreated again, and when my second match had ended, I struck\nmy third. It had almost burned through when I reached the opening\ninto the shaft. I lay down on the edge, for the throb of the great\npump below made me giddy. Then I felt sideways for the projecting\nhooks, and, as I did so, my feet were grasped from behind, and I\nwas violently tugged backward. I lit my last match ... and it\nincontinently went out. But I had my hand on the climbing bars now,\nand, kicking violently, I disengaged myself from the clutches of the\nMorlocks and was speedily clambering up the shaft, while they stayed\npeering and blinking up at me: all but one little wretch who\nfollowed me for some way, and well-nigh secured my boot as a trophy.\n\n'That climb seemed interminable to me. With the last twenty or\nthirty feet of it a deadly nausea came upon me. I had the greatest\ndifficulty in keeping my hold. The last few yards was a frightful\nstruggle against this faintness. Several times my head swam, and I\nfelt all the sensations of falling. At last, however, I got over the\nwell-mouth somehow, and staggered out of the ruin into the blinding\nsunlight. I fell upon my face. Even the soil smelt sweet and clean.\nThen I remember Weena kissing my hands and ears, and the voices of\nothers among the Eloi. Then, for a time, I was insensible.\n\n\n\n\nVII\n\n\n'Now, indeed, I seemed in a worse case than before. Hitherto,\nexcept during my night's anguish at the loss of the Time Machine,\nI had felt a sustaining hope of ultimate escape, but that hope was\nstaggered by these new discoveries. Hitherto I had merely thought\nmyself impeded by the childish simplicity of the little people, and\nby some unknown forces which I had only to understand to overcome;\nbut there was an altogether new element in the sickening quality of\nthe Morlocks--a something inhuman and malign. Instinctively I\nloathed them. Before, I had felt as a man might feel who had fallen\ninto a pit: my concern was with the pit and how to get out of it.\nNow I felt like a beast in a trap, whose enemy would come upon him\nsoon.\n\n'The enemy I dreaded may surprise you. It was the darkness of the\nnew moon. Weena had put this into my head by some at first\nincomprehensible remarks about the Dark Nights. It was not now\nsuch a very difficult problem to guess what the coming Dark Nights\nmight mean. The moon was on the wane: each night there was a longer\ninterval of darkness. And I now understood to some slight degree at\nleast the reason of the fear of the little Upper-world people for\nthe dark. I wondered vaguely what foul villainy it might be that\nthe Morlocks did under the new moon. I felt pretty sure now that\nmy second hypothesis was all wrong. The Upper-world people might\nonce have been the favoured aristocracy, and the Morlocks their\nmechanical servants: but that had long since passed away. The two\nspecies that had resulted from the evolution of man were sliding\ndown towards, or had already arrived at, an altogether new\nrelationship. The Eloi, like the Carolingian kings, had decayed\nto a mere beautiful futility. They still possessed the earth on\nsufferance: since the Morlocks, subterranean for innumerable\ngenerations, had come at last to find the daylit surface\nintolerable. And the Morlocks made their garments, I inferred, and\nmaintained them in their habitual needs, perhaps through the\nsurvival of an old habit of service. They did it as a standing horse\npaws with his foot, or as a man enjoys killing animals in sport:\nbecause ancient and departed necessities had impressed it on the\norganism. But, clearly, the old order was already in part reversed.\nThe Nemesis of the delicate ones was creeping on apace. Ages ago,\nthousands of generations ago, man had thrust his brother man out of\nthe ease and the sunshine. And now that brother was coming back\nchanged! Already the Eloi had begun to learn one old lesson anew.\nThey were becoming reacquainted with Fear. And suddenly there came\ninto my head the memory of the meat I had seen in the Under-world.\nIt seemed odd how it floated into my mind: not stirred up as it\nwere by the current of my meditations, but coming in almost like a\nquestion from outside. I tried to recall the form of it. I had a\nvague sense of something familiar, but I could not tell what it was\nat the time.\n\n'Still, however helpless the little people in the presence of their\nmysterious Fear, I was differently constituted. I came out of this\nage of ours, this ripe prime of the human race, when Fear does not\nparalyse and mystery has lost its terrors. I at least would defend\nmyself. Without further delay I determined to make myself arms and a\nfastness where I might sleep. With that refuge as a base, I could\nface this strange world with some of that confidence I had lost in\nrealizing to what creatures night by night I lay exposed. I felt\nI could never sleep again until my bed was secure from them. I\nshuddered with horror to think how they must already have examined\nme.\n\n'I wandered during the afternoon along the valley of the Thames, but\nfound nothing that commended itself to my mind as inaccessible. All\nthe buildings and trees seemed easily practicable to such dexterous\nclimbers as the Morlocks, to judge by their wells, must be. Then the\ntall pinnacles of the Palace of Green Porcelain and the polished\ngleam of its walls came back to my memory; and in the evening,\ntaking Weena like a child upon my shoulder, I went up the hills\ntowards the south-west. The distance, I had reckoned, was seven or\neight miles, but it must have been nearer eighteen. I had first seen\nthe place on a moist afternoon when distances are deceptively\ndiminished. In addition, the heel of one of my shoes was loose, and\na nail was working through the sole--they were comfortable old shoes\nI wore about indoors--so that I was lame. And it was already long\npast sunset when I came in sight of the palace, silhouetted black\nagainst the pale yellow of the sky.\n\n'Weena had been hugely delighted when I began to carry her, but\nafter a while she desired me to let her down, and ran along by the\nside of me, occasionally darting off on either hand to pick flowers\nto stick in my pockets. My pockets had always puzzled Weena, but at\nthe last she had concluded that they were an eccentric kind of vase\nfor floral decoration. At least she utilized them for that purpose.\nAnd that reminds me! In changing my jacket I found...'\n\nThe Time Traveller paused, put his hand into his pocket, and\nsilently placed two withered flowers, not unlike very large white\nmallows, upon the little table. Then he resumed his narrative.\n\n'As the hush of evening crept over the world and we proceeded over\nthe hill crest towards Wimbledon, Weena grew tired and wanted to\nreturn to the house of grey stone. But I pointed out the distant\npinnacles of the Palace of Green Porcelain to her, and contrived to\nmake her understand that we were seeking a refuge there from her\nFear. You know that great pause that comes upon things before the\ndusk? Even the breeze stops in the trees. To me there is always an\nair of expectation about that evening stillness. The sky was clear,\nremote, and empty save for a few horizontal bars far down in the\nsunset. Well, that night the expectation took the colour of my\nfears. In that darkling calm my senses seemed preternaturally\nsharpened. I fancied I could even feel the hollowness of the ground\nbeneath my feet: could, indeed, almost see through it the Morlocks\non their ant-hill going hither and thither and waiting for the dark.\nIn my excitement I fancied that they would receive my invasion of\ntheir burrows as a declaration of war. And why had they taken my\nTime Machine?\n\n'So we went on in the quiet, and the twilight deepened into night.\nThe clear blue of the distance faded, and one star after another\ncame out. The ground grew dim and the trees black. Weena's fears and\nher fatigue grew upon her. I took her in my arms and talked to her\nand caressed her. Then, as the darkness grew deeper, she put her\narms round my neck, and, closing her eyes, tightly pressed her face\nagainst my shoulder. So we went down a long slope into a valley, and\nthere in the dimness I almost walked into a little river. This I\nwaded, and went up the opposite side of the valley, past a number\nof sleeping houses, and by a statue--a Faun, or some such figure,\n_minus_ the head. Here too were acacias. So far I had seen nothing of\nthe Morlocks, but it was yet early in the night, and the darker hours\nbefore the old moon rose were still to come.\n\n'From the brow of the next hill I saw a thick wood spreading wide\nand black before me. I hesitated at this. I could see no end to\nit, either to the right or the left. Feeling tired--my feet, in\nparticular, were very sore--I carefully lowered Weena from my\nshoulder as I halted, and sat down upon the turf. I could no\nlonger see the Palace of Green Porcelain, and I was in doubt of my\ndirection. I looked into the thickness of the wood and thought of\nwhat it might hide. Under that dense tangle of branches one would\nbe out of sight of the stars. Even were there no other lurking\ndanger--a danger I did not care to let my imagination loose\nupon--there would still be all the roots to stumble over and the\ntree-boles to strike against.\n\n'I was very tired, too, after the excitements of the day; so I\ndecided that I would not face it, but would pass the night upon the\nopen hill.\n\n'Weena, I was glad to find, was fast asleep. I carefully wrapped her\nin my jacket, and sat down beside her to wait for the moonrise. The\nhill-side was quiet and deserted, but from the black of the wood\nthere came now and then a stir of living things. Above me shone the\nstars, for the night was very clear. I felt a certain sense of\nfriendly comfort in their twinkling. All the old constellations\nhad gone from the sky, however: that slow movement which is\nimperceptible in a hundred human lifetimes, had long since\nrearranged them in unfamiliar groupings. But the Milky Way, it\nseemed to me, was still the same tattered streamer of star-dust as\nof yore. Southward (as I judged it) was a very bright red star that\nwas new to me; it was even more splendid than our own green Sirius.\nAnd amid all these scintillating points of light one bright planet\nshone kindly and steadily like the face of an old friend.\n\n'Looking at these stars suddenly dwarfed my own troubles and all\nthe gravities of terrestrial life. I thought of their unfathomable\ndistance, and the slow inevitable drift of their movements out of\nthe unknown past into the unknown future. I thought of the great\nprecessional cycle that the pole of the earth describes. Only forty\ntimes had that silent revolution occurred during all the years that\nI had traversed. And during these few revolutions all the activity,\nall the traditions, the complex organizations, the nations,\nlanguages, literatures, aspirations, even the mere memory of Man as\nI knew him, had been swept out of existence. Instead were these\nfrail creatures who had forgotten their high ancestry, and the white\nThings of which I went in terror. Then I thought of the Great Fear\nthat was between the two species, and for the first time, with a\nsudden shiver, came the clear knowledge of what the meat I had seen\nmight be. Yet it was too horrible! I looked at little Weena sleeping\nbeside me, her face white and starlike under the stars, and\nforthwith dismissed the thought.\n\n'Through that long night I held my mind off the Morlocks as well as\nI could, and whiled away the time by trying to fancy I could find\nsigns of the old constellations in the new confusion. The sky kept\nvery clear, except for a hazy cloud or so. No doubt I dozed at\ntimes. Then, as my vigil wore on, came a faintness in the eastward\nsky, like the reflection of some colourless fire, and the old moon\nrose, thin and peaked and white. And close behind, and overtaking\nit, and overflowing it, the dawn came, pale at first, and then\ngrowing pink and warm. No Morlocks had approached us. Indeed, I had\nseen none upon the hill that night. And in the confidence of renewed\nday it almost seemed to me that my fear had been unreasonable. I\nstood up and found my foot with the loose heel swollen at the ankle\nand painful under the heel; so I sat down again, took off my shoes,\nand flung them away.\n\n'I awakened Weena, and we went down into the wood, now green and\npleasant instead of black and forbidding. We found some fruit\nwherewith to break our fast. We soon met others of the dainty ones,\nlaughing and dancing in the sunlight as though there was no such\nthing in nature as the night. And then I thought once more of the\nmeat that I had seen. I felt assured now of what it was, and from\nthe bottom of my heart I pitied this last feeble rill from the great\nflood of humanity. Clearly, at some time in the Long-Ago of human\ndecay the Morlocks' food had run short. Possibly they had lived on\nrats and such-like vermin. Even now man is far less discriminating\nand exclusive in his food than he was--far less than any monkey. His\nprejudice against human flesh is no deep-seated instinct. And so\nthese inhuman sons of men----! I tried to look at the thing in a\nscientific spirit. After all, they were less human and more remote\nthan our cannibal ancestors of three or four thousand years ago.\nAnd the intelligence that would have made this state of things a\ntorment had gone. Why should I trouble myself? These Eloi were mere\nfatted cattle, which the ant-like Morlocks preserved and preyed\nupon--probably saw to the breeding of. And there was Weena dancing\nat my side!\n\n'Then I tried to preserve myself from the horror that was coming\nupon me, by regarding it as a rigorous punishment of human\nselfishness. Man had been content to live in ease and delight upon\nthe labours of his fellow-man, had taken Necessity as his watchword\nand excuse, and in the fullness of time Necessity had come home to\nhim. I even tried a Carlyle-like scorn of this wretched aristocracy\nin decay. But this attitude of mind was impossible. However great\ntheir intellectual degradation, the Eloi had kept too much of the\nhuman form not to claim my sympathy, and to make me perforce a\nsharer in their degradation and their Fear.\n\n'I had at that time very vague ideas as to the course I should\npursue. My first was to secure some safe place of refuge, and to\nmake myself such arms of metal or stone as I could contrive. That\nnecessity was immediate. In the next place, I hoped to procure some\nmeans of fire, so that I should have the weapon of a torch at hand,\nfor nothing, I knew, would be more efficient against these Morlocks.\nThen I wanted to arrange some contrivance to break open the doors of\nbronze under the White Sphinx. I had in mind a battering ram. I had\na persuasion that if I could enter those doors and carry a blaze of\nlight before me I should discover the Time Machine and escape. I\ncould not imagine the Morlocks were strong enough to move it far\naway. Weena I had resolved to bring with me to our own time. And\nturning such schemes over in my mind I pursued our way towards the\nbuilding which my fancy had chosen as our dwelling.\n\n\n\n\nVIII\n\n\n'I found the Palace of Green Porcelain, when we approached it about\nnoon, deserted and falling into ruin. Only ragged vestiges of glass\nremained in its windows, and great sheets of the green facing had\nfallen away from the corroded metallic framework. It lay very high\nupon a turfy down, and looking north-eastward before I entered it, I\nwas surprised to see a large estuary, or even creek, where I judged\nWandsworth and Battersea must once have been. I thought then--though\nI never followed up the thought--of what might have happened, or\nmight be happening, to the living things in the sea.\n\n'The material of the Palace proved on examination to be indeed\nporcelain, and along the face of it I saw an inscription in some\nunknown character. I thought, rather foolishly, that Weena might\nhelp me to interpret this, but I only learned that the bare idea of\nwriting had never entered her head. She always seemed to me, I\nfancy, more human than she was, perhaps because her affection was so\nhuman.\n\n'Within the big valves of the door--which were open and broken--we\nfound, instead of the customary hall, a long gallery lit by many\nside windows. At the first glance I was reminded of a museum.\nThe tiled floor was thick with dust, and a remarkable array of\nmiscellaneous objects was shrouded in the same grey covering. Then\nI perceived, standing strange and gaunt in the centre of the hall,\nwhat was clearly the lower part of a huge skeleton. I recognized\nby the oblique feet that it was some extinct creature after the\nfashion of the Megatherium. The skull and the upper bones lay\nbeside it in the thick dust, and in one place, where rain-water had\ndropped through a leak in the roof, the thing itself had been worn\naway. Further in the gallery was the huge skeleton barrel of a\nBrontosaurus. My museum hypothesis was confirmed. Going towards the\nside I found what appeared to be sloping shelves, and clearing away\nthe thick dust, I found the old familiar glass cases of our own\ntime. But they must have been air-tight to judge from the fair\npreservation of some of their contents.\n\n'Clearly we stood among the ruins of some latter-day South\nKensington! Here, apparently, was the Palaeontological Section,\nand a very splendid array of fossils it must have been, though the\ninevitable process of decay that had been staved off for a time, and\nhad, through the extinction of bacteria and fungi, lost ninety-nine\nhundredths of its force, was nevertheless, with extreme sureness if\nwith extreme slowness at work again upon all its treasures. Here and\nthere I found traces of the little people in the shape of rare\nfossils broken to pieces or threaded in strings upon reeds. And the\ncases had in some instances been bodily removed--by the Morlocks as\nI judged. The place was very silent. The thick dust deadened our\nfootsteps. Weena, who had been rolling a sea urchin down the sloping\nglass of a case, presently came, as I stared about me, and very\nquietly took my hand and stood beside me.\n\n'And at first I was so much surprised by this ancient monument of an\nintellectual age, that I gave no thought to the possibilities it\npresented. Even my preoccupation about the Time Machine receded a\nlittle from my mind.\n\n'To judge from the size of the place, this Palace of Green Porcelain\nhad a great deal more in it than a Gallery of Palaeontology;\npossibly historical galleries; it might be, even a library! To me,\nat least in my present circumstances, these would be vastly more\ninteresting than this spectacle of oldtime geology in decay.\nExploring, I found another short gallery running transversely to the\nfirst. This appeared to be devoted to minerals, and the sight of a\nblock of sulphur set my mind running on gunpowder. But I could find\nno saltpeter; indeed, no nitrates of any kind. Doubtless they had\ndeliquesced ages ago. Yet the sulphur hung in my mind, and set up a\ntrain of thinking. As for the rest of the contents of that gallery,\nthough on the whole they were the best preserved of all I saw, I had\nlittle interest. I am no specialist in mineralogy, and I went on\ndown a very ruinous aisle running parallel to the first hall I had\nentered. Apparently this section had been devoted to natural\nhistory, but everything had long since passed out of recognition. A\nfew shrivelled and blackened vestiges of what had once been stuffed\nanimals, desiccated mummies in jars that had once held spirit, a\nbrown dust of departed plants: that was all! I was sorry for that,\nbecause I should have been glad to trace the patent readjustments by\nwhich the conquest of animated nature had been attained. Then we\ncame to a gallery of simply colossal proportions, but singularly\nill-lit, the floor of it running downward at a slight angle from the\nend at which I entered. At intervals white globes hung from the\nceiling--many of them cracked and smashed--which suggested that\noriginally the place had been artificially lit. Here I was more in\nmy element, for rising on either side of me were the huge bulks of\nbig machines, all greatly corroded and many broken down, but some\nstill fairly complete. You know I have a certain weakness for\nmechanism, and I was inclined to linger among these; the more so as\nfor the most part they had the interest of puzzles, and I could make\nonly the vaguest guesses at what they were for. I fancied that if\nI could solve their puzzles I should find myself in possession of\npowers that might be of use against the Morlocks.\n\n'Suddenly Weena came very close to my side. So suddenly that she\nstartled me. Had it not been for her I do not think I should have\nnoticed that the floor of the gallery sloped at all. [Footnote: It\nmay be, of course, that the floor did not slope, but that the museum\nwas built into the side of a hill.--ED.] The end I had come in at\nwas quite above ground, and was lit by rare slit-like windows. As\nyou went down the length, the ground came up against these windows,\nuntil at last there was a pit like the \"area\" of a London house\nbefore each, and only a narrow line of daylight at the top. I went\nslowly along, puzzling about the machines, and had been too intent\nupon them to notice the gradual diminution of the light, until\nWeena's increasing apprehensions drew my attention. Then I saw that\nthe gallery ran down at last into a thick darkness. I hesitated, and\nthen, as I looked round me, I saw that the dust was less abundant\nand its surface less even. Further away towards the dimness, it\nappeared to be broken by a number of small narrow footprints. My\nsense of the immediate presence of the Morlocks revived at that.\nI felt that I was wasting my time in the academic examination of\nmachinery. I called to mind that it was already far advanced in the\nafternoon, and that I had still no weapon, no refuge, and no means\nof making a fire. And then down in the remote blackness of the\ngallery I heard a peculiar pattering, and the same odd noises I had\nheard down the well.\n\n'I took Weena's hand. Then, struck with a sudden idea, I left her\nand turned to a machine from which projected a lever not unlike\nthose in a signal-box. Clambering upon the stand, and grasping this\nlever in my hands, I put all my weight upon it sideways. Suddenly\nWeena, deserted in the central aisle, began to whimper. I had judged\nthe strength of the lever pretty correctly, for it snapped after a\nminute's strain, and I rejoined her with a mace in my hand more than\nsufficient, I judged, for any Morlock skull I might encounter. And I\nlonged very much to kill a Morlock or so. Very inhuman, you may\nthink, to want to go killing one's own descendants! But it was\nimpossible, somehow, to feel any humanity in the things. Only my\ndisinclination to leave Weena, and a persuasion that if I began to\nslake my thirst for murder my Time Machine might suffer, restrained\nme from going straight down the gallery and killing the brutes I\nheard.\n\n'Well, mace in one hand and Weena in the other, I went out of that\ngallery and into another and still larger one, which at the first\nglance reminded me of a military chapel hung with tattered flags.\nThe brown and charred rags that hung from the sides of it, I\npresently recognized as the decaying vestiges of books. They had\nlong since dropped to pieces, and every semblance of print had left\nthem. But here and there were warped boards and cracked metallic\nclasps that told the tale well enough. Had I been a literary man I\nmight, perhaps, have moralized upon the futility of all ambition.\nBut as it was, the thing that struck me with keenest force was the\nenormous waste of labour to which this sombre wilderness of rotting\npaper testified. At the time I will confess that I thought chiefly\nof the _Philosophical Transactions_ and my own seventeen papers upon\nphysical optics.\n\n'Then, going up a broad staircase, we came to what may once have\nbeen a gallery of technical chemistry. And here I had not a little\nhope of useful discoveries. Except at one end where the roof had\ncollapsed, this gallery was well preserved. I went eagerly to every\nunbroken case. And at last, in one of the really air-tight cases,\nI found a box of matches. Very eagerly I tried them. They were\nperfectly good. They were not even damp. I turned to Weena. \"Dance,\"\nI cried to her in her own tongue. For now I had a weapon indeed\nagainst the horrible creatures we feared. And so, in that derelict\nmuseum, upon the thick soft carpeting of dust, to Weena's huge\ndelight, I solemnly performed a kind of composite dance, whistling\n_The Land of the Leal_ as cheerfully as I could. In part it was a\nmodest _cancan_, in part a step dance, in part a skirt-dance (so far\nas my tail-coat permitted), and in part original. For I am naturally\ninventive, as you know.\n\n'Now, I still think that for this box of matches to have escaped\nthe wear of time for immemorial years was a most strange, as for\nme it was a most fortunate thing. Yet, oddly enough, I found a far\nunlikelier substance, and that was camphor. I found it in a sealed\njar, that by chance, I suppose, had been really hermetically sealed.\nI fancied at first that it was paraffin wax, and smashed the glass\naccordingly. But the odour of camphor was unmistakable. In the\nuniversal decay this volatile substance had chanced to survive,\nperhaps through many thousands of centuries. It reminded me of a\nsepia painting I had once seen done from the ink of a fossil\nBelemnite that must have perished and become fossilized millions\nof years ago. I was about to throw it away, but I remembered that\nit was inflammable and burned with a good bright flame--was, in\nfact, an excellent candle--and I put it in my pocket. I found no\nexplosives, however, nor any means of breaking down the bronze\ndoors. As yet my iron crowbar was the most helpful thing I had\nchanced upon. Nevertheless I left that gallery greatly elated.\n\n'I cannot tell you all the story of that long afternoon. It would\nrequire a great effort of memory to recall my explorations in at all\nthe proper order. I remember a long gallery of rusting stands of\narms, and how I hesitated between my crowbar and a hatchet or a\nsword. I could not carry both, however, and my bar of iron promised\nbest against the bronze gates. There were numbers of guns, pistols,\nand rifles. The most were masses of rust, but many were of some\nnew metal, and still fairly sound. But any cartridges or powder\nthere may once have been had rotted into dust. One corner I saw was\ncharred and shattered; perhaps, I thought, by an explosion among the\nspecimens. In another place was a vast array of idols--Polynesian,\nMexican, Grecian, Phoenician, every country on earth I should think.\nAnd here, yielding to an irresistible impulse, I wrote my name upon\nthe nose of a steatite monster from South America that particularly\ntook my fancy.\n\n'As the evening drew on, my interest waned. I went through gallery\nafter gallery, dusty, silent, often ruinous, the exhibits sometimes\nmere heaps of rust and lignite, sometimes fresher. In one place I\nsuddenly found myself near the model of a tin-mine, and then by the\nmerest accident I discovered, in an air-tight case, two dynamite\ncartridges! I shouted \"Eureka!\" and smashed the case with joy. Then\ncame a doubt. I hesitated. Then, selecting a little side gallery,\nI made my essay. I never felt such a disappointment as I did in\nwaiting five, ten, fifteen minutes for an explosion that never came.\nOf course the things were dummies, as I might have guessed from\ntheir presence. I really believe that had they not been so, I should\nhave rushed off incontinently and blown Sphinx, bronze doors, and\n(as it proved) my chances of finding the Time Machine, all together\ninto non-existence.\n\n'It was after that, I think, that we came to a little open court\nwithin the palace. It was turfed, and had three fruit-trees. So we\nrested and refreshed ourselves. Towards sunset I began to consider\nour position. Night was creeping upon us, and my inaccessible\nhiding-place had still to be found. But that troubled me very little\nnow. I had in my possession a thing that was, perhaps, the best of\nall defences against the Morlocks--I had matches! I had the camphor\nin my pocket, too, if a blaze were needed. It seemed to me that\nthe best thing we could do would be to pass the night in the open,\nprotected by a fire. In the morning there was the getting of the\nTime Machine. Towards that, as yet, I had only my iron mace. But\nnow, with my growing knowledge, I felt very differently towards\nthose bronze doors. Up to this, I had refrained from forcing them,\nlargely because of the mystery on the other side. They had never\nimpressed me as being very strong, and I hoped to find my bar of\niron not altogether inadequate for the work.\n\n\n\n\nIX\n\n\n'We emerged from the palace while the sun was still in part above\nthe horizon. I was determined to reach the White Sphinx early the\nnext morning, and ere the dusk I purposed pushing through the woods\nthat had stopped me on the previous journey. My plan was to go as\nfar as possible that night, and then, building a fire, to sleep\nin the protection of its glare. Accordingly, as we went along I\ngathered any sticks or dried grass I saw, and presently had my arms\nfull of such litter. Thus loaded, our progress was slower than I had\nanticipated, and besides Weena was tired. And I began to suffer from\nsleepiness too; so that it was full night before we reached the\nwood. Upon the shrubby hill of its edge Weena would have stopped,\nfearing the darkness before us; but a singular sense of impending\ncalamity, that should indeed have served me as a warning, drove me\nonward. I had been without sleep for a night and two days, and I was\nfeverish and irritable. I felt sleep coming upon me, and the\nMorlocks with it.\n\n'While we hesitated, among the black bushes behind us, and dim\nagainst their blackness, I saw three crouching figures. There was\nscrub and long grass all about us, and I did not feel safe from\ntheir insidious approach. The forest, I calculated, was rather\nless than a mile across. If we could get through it to the bare\nhill-side, there, as it seemed to me, was an altogether safer\nresting-place; I thought that with my matches and my camphor I could\ncontrive to keep my path illuminated through the woods. Yet it was\nevident that if I was to flourish matches with my hands I should\nhave to abandon my firewood; so, rather reluctantly, I put it down.\nAnd then it came into my head that I would amaze our friends behind\nby lighting it. I was to discover the atrocious folly of this\nproceeding, but it came to my mind as an ingenious move for covering\nour retreat.\n\n'I don't know if you have ever thought what a rare thing flame must\nbe in the absence of man and in a temperate climate. The sun's\nheat is rarely strong enough to burn, even when it is focused by\ndewdrops, as is sometimes the case in more tropical districts.\nLightning may blast and blacken, but it rarely gives rise to\nwidespread fire. Decaying vegetation may occasionally smoulder with\nthe heat of its fermentation, but this rarely results in flame. In\nthis decadence, too, the art of fire-making had been forgotten on\nthe earth. The red tongues that went licking up my heap of wood were\nan altogether new and strange thing to Weena.\n\n'She wanted to run to it and play with it. I believe she would have\ncast herself into it had I not restrained her. But I caught her up,\nand in spite of her struggles, plunged boldly before me into the\nwood. For a little way the glare of my fire lit the path. Looking\nback presently, I could see, through the crowded stems, that from my\nheap of sticks the blaze had spread to some bushes adjacent, and a\ncurved line of fire was creeping up the grass of the hill. I laughed\nat that, and turned again to the dark trees before me. It was very\nblack, and Weena clung to me convulsively, but there was still, as\nmy eyes grew accustomed to the darkness, sufficient light for me to\navoid the stems. Overhead it was simply black, except where a gap of\nremote blue sky shone down upon us here and there. I struck none of\nmy matches because I had no hand free. Upon my left arm I carried my\nlittle one, in my right hand I had my iron bar.\n\n'For some way I heard nothing but the crackling twigs under my feet,\nthe faint rustle of the breeze above, and my own breathing and the\nthrob of the blood-vessels in my ears. Then I seemed to know of a\npattering about me. I pushed on grimly. The pattering grew more\ndistinct, and then I caught the same queer sound and voices I had\nheard in the Under-world. There were evidently several of the\nMorlocks, and they were closing in upon me. Indeed, in another\nminute I felt a tug at my coat, then something at my arm. And Weena\nshivered violently, and became quite still.\n\n'It was time for a match. But to get one I must put her down. I did\nso, and, as I fumbled with my pocket, a struggle began in the\ndarkness about my knees, perfectly silent on her part and with the\nsame peculiar cooing sounds from the Morlocks. Soft little hands,\ntoo, were creeping over my coat and back, touching even my neck.\nThen the match scratched and fizzed. I held it flaring, and saw the\nwhite backs of the Morlocks in flight amid the trees. I hastily took\na lump of camphor from my pocket, and prepared to light it as soon\nas the match should wane. Then I looked at Weena. She was lying\nclutching my feet and quite motionless, with her face to the ground.\nWith a sudden fright I stooped to her. She seemed scarcely to\nbreathe. I lit the block of camphor and flung it to the ground,\nand as it split and flared up and drove back the Morlocks and the\nshadows, I knelt down and lifted her. The wood behind seemed full of\nthe stir and murmur of a great company!\n\n'She seemed to have fainted. I put her carefully upon my shoulder\nand rose to push on, and then there came a horrible realization. In\nmanoeuvring with my matches and Weena, I had turned myself about\nseveral times, and now I had not the faintest idea in what direction\nlay my path. For all I knew, I might be facing back towards the\nPalace of Green Porcelain. I found myself in a cold sweat. I had to\nthink rapidly what to do. I determined to build a fire and encamp\nwhere we were. I put Weena, still motionless, down upon a turfy\nbole, and very hastily, as my first lump of camphor waned, I began\ncollecting sticks and leaves. Here and there out of the darkness\nround me the Morlocks' eyes shone like carbuncles.\n\n'The camphor flickered and went out. I lit a match, and as I did so,\ntwo white forms that had been approaching Weena dashed hastily away.\nOne was so blinded by the light that he came straight for me, and I\nfelt his bones grind under the blow of my fist. He gave a whoop of\ndismay, staggered a little way, and fell down. I lit another piece\nof camphor, and went on gathering my bonfire. Presently I noticed\nhow dry was some of the foliage above me, for since my arrival\non the Time Machine, a matter of a week, no rain had fallen. So,\ninstead of casting about among the trees for fallen twigs, I began\nleaping up and dragging down branches. Very soon I had a choking\nsmoky fire of green wood and dry sticks, and could economize my\ncamphor. Then I turned to where Weena lay beside my iron mace. I\ntried what I could to revive her, but she lay like one dead. I could\nnot even satisfy myself whether or not she breathed.\n\n'Now, the smoke of the fire beat over towards me, and it must have\nmade me heavy of a sudden. Moreover, the vapour of camphor was in\nthe air. My fire would not need replenishing for an hour or so. I\nfelt very weary after my exertion, and sat down. The wood, too, was\nfull of a slumbrous murmur that I did not understand. I seemed just\nto nod and open my eyes. But all was dark, and the Morlocks had\ntheir hands upon me. Flinging off their clinging fingers I hastily\nfelt in my pocket for the match-box, and--it had gone! Then they\ngripped and closed with me again. In a moment I knew what had\nhappened. I had slept, and my fire had gone out, and the bitterness\nof death came over my soul. The forest seemed full of the smell of\nburning wood. I was caught by the neck, by the hair, by the arms,\nand pulled down. It was indescribably horrible in the darkness to\nfeel all these soft creatures heaped upon me. I felt as if I was in\na monstrous spider's web. I was overpowered, and went down. I felt\nlittle teeth nipping at my neck. I rolled over, and as I did so my\nhand came against my iron lever. It gave me strength. I struggled\nup, shaking the human rats from me, and, holding the bar short,\nI thrust where I judged their faces might be. I could feel the\nsucculent giving of flesh and bone under my blows, and for a moment\nI was free.\n\n'The strange exultation that so often seems to accompany hard\nfighting came upon me. I knew that both I and Weena were lost, but I\ndetermined to make the Morlocks pay for their meat. I stood with my\nback to a tree, swinging the iron bar before me. The whole wood was\nfull of the stir and cries of them. A minute passed. Their voices\nseemed to rise to a higher pitch of excitement, and their movements\ngrew faster. Yet none came within reach. I stood glaring at the\nblackness. Then suddenly came hope. What if the Morlocks were\nafraid? And close on the heels of that came a strange thing. The\ndarkness seemed to grow luminous. Very dimly I began to see the\nMorlocks about me--three battered at my feet--and then I recognized,\nwith incredulous surprise, that the others were running, in an\nincessant stream, as it seemed, from behind me, and away through the\nwood in front. And their backs seemed no longer white, but reddish.\nAs I stood agape, I saw a little red spark go drifting across a gap\nof starlight between the branches, and vanish. And at that I\nunderstood the smell of burning wood, the slumbrous murmur that was\ngrowing now into a gusty roar, the red glow, and the Morlocks'\nflight.\n\n'Stepping out from behind my tree and looking back, I saw, through\nthe black pillars of the nearer trees, the flames of the burning\nforest. It was my first fire coming after me. With that I looked for\nWeena, but she was gone. The hissing and crackling behind me, the\nexplosive thud as each fresh tree burst into flame, left little\ntime for reflection. My iron bar still gripped, I followed in the\nMorlocks' path. It was a close race. Once the flames crept forward\nso swiftly on my right as I ran that I was outflanked and had to\nstrike off to the left. But at last I emerged upon a small open\nspace, and as I did so, a Morlock came blundering towards me, and\npast me, and went on straight into the fire!\n\n'And now I was to see the most weird and horrible thing, I think, of\nall that I beheld in that future age. This whole space was as bright\nas day with the reflection of the fire. In the centre was a hillock\nor tumulus, surmounted by a scorched hawthorn. Beyond this was\nanother arm of the burning forest, with yellow tongues already\nwrithing from it, completely encircling the space with a fence of\nfire. Upon the hill-side were some thirty or forty Morlocks, dazzled\nby the light and heat, and blundering hither and thither against\neach other in their bewilderment. At first I did not realize their\nblindness, and struck furiously at them with my bar, in a frenzy of\nfear, as they approached me, killing one and crippling several more.\nBut when I had watched the gestures of one of them groping under the\nhawthorn against the red sky, and heard their moans, I was assured\nof their absolute helplessness and misery in the glare, and I struck\nno more of them.\n\n'Yet every now and then one would come straight towards me, setting\nloose a quivering horror that made me quick to elude him. At one\ntime the flames died down somewhat, and I feared the foul creatures\nwould presently be able to see me. I was thinking of beginning the\nfight by killing some of them before this should happen; but the\nfire burst out again brightly, and I stayed my hand. I walked about\nthe hill among them and avoided them, looking for some trace of\nWeena. But Weena was gone.\n\n'At last I sat down on the summit of the hillock, and watched this\nstrange incredible company of blind things groping to and fro, and\nmaking uncanny noises to each other, as the glare of the fire beat\non them. The coiling uprush of smoke streamed across the sky, and\nthrough the rare tatters of that red canopy, remote as though they\nbelonged to another universe, shone the little stars. Two or three\nMorlocks came blundering into me, and I drove them off with blows\nof my fists, trembling as I did so.\n\n'For the most part of that night I was persuaded it was a nightmare.\nI bit myself and screamed in a passionate desire to awake. I beat\nthe ground with my hands, and got up and sat down again, and\nwandered here and there, and again sat down. Then I would fall to\nrubbing my eyes and calling upon God to let me awake. Thrice I saw\nMorlocks put their heads down in a kind of agony and rush into the\nflames. But, at last, above the subsiding red of the fire, above the\nstreaming masses of black smoke and the whitening and blackening\ntree stumps, and the diminishing numbers of these dim creatures,\ncame the white light of the day.\n\n'I searched again for traces of Weena, but there were none. It was\nplain that they had left her poor little body in the forest. I\ncannot describe how it relieved me to think that it had escaped the\nawful fate to which it seemed destined. As I thought of that, I was\nalmost moved to begin a massacre of the helpless abominations about\nme, but I contained myself. The hillock, as I have said, was a kind\nof island in the forest. From its summit I could now make out\nthrough a haze of smoke the Palace of Green Porcelain, and from that\nI could get my bearings for the White Sphinx. And so, leaving the\nremnant of these damned souls still going hither and thither and\nmoaning, as the day grew clearer, I tied some grass about my feet\nand limped on across smoking ashes and among black stems, that still\npulsated internally with fire, towards the hiding-place of the Time\nMachine. I walked slowly, for I was almost exhausted, as well as\nlame, and I felt the intensest wretchedness for the horrible death\nof little Weena. It seemed an overwhelming calamity. Now, in this\nold familiar room, it is more like the sorrow of a dream than an\nactual loss. But that morning it left me absolutely lonely\nagain--terribly alone. I began to think of this house of mine, of\nthis fireside, of some of you, and with such thoughts came a longing\nthat was pain.\n\n'But as I walked over the smoking ashes under the bright morning\nsky, I made a discovery. In my trouser pocket were still some loose\nmatches. The box must have leaked before it was lost.\n\n\n\n\nX\n\n\n'About eight or nine in the morning I came to the same seat of\nyellow metal from which I had viewed the world upon the evening of\nmy arrival. I thought of my hasty conclusions upon that evening and\ncould not refrain from laughing bitterly at my confidence. Here\nwas the same beautiful scene, the same abundant foliage, the same\nsplendid palaces and magnificent ruins, the same silver river\nrunning between its fertile banks. The gay robes of the beautiful\npeople moved hither and thither among the trees. Some were bathing\nin exactly the place where I had saved Weena, and that suddenly gave\nme a keen stab of pain. And like blots upon the landscape rose the\ncupolas above the ways to the Under-world. I understood now what all\nthe beauty of the Over-world people covered. Very pleasant was their\nday, as pleasant as the day of the cattle in the field. Like the\ncattle, they knew of no enemies and provided against no needs. And\ntheir end was the same.\n\n'I grieved to think how brief the dream of the human intellect had\nbeen. It had committed suicide. It had set itself steadfastly\ntowards comfort and ease, a balanced society with security and\npermanency as its watchword, it had attained its hopes--to come\nto this at last. Once, life and property must have reached almost\nabsolute safety. The rich had been assured of his wealth and\ncomfort, the toiler assured of his life and work. No doubt in that\nperfect world there had been no unemployed problem, no social\nquestion left unsolved. And a great quiet had followed.\n\n'It is a law of nature we overlook, that intellectual versatility\nis the compensation for change, danger, and trouble. An animal\nperfectly in harmony with its environment is a perfect mechanism.\nNature never appeals to intelligence until habit and instinct are\nuseless. There is no intelligence where there is no change and no\nneed of change. Only those animals partake of intelligence that have\nto meet a huge variety of needs and dangers.\n\n'So, as I see it, the Upper-world man had drifted towards his\nfeeble prettiness, and the Under-world to mere mechanical industry.\nBut that perfect state had lacked one thing even for mechanical\nperfection--absolute permanency. Apparently as time went on, the\nfeeding of the Under-world, however it was effected, had become\ndisjointed. Mother Necessity, who had been staved off for a\nfew thousand years, came back again, and she began below. The\nUnder-world being in contact with machinery, which, however perfect,\nstill needs some little thought outside habit, had probably retained\nperforce rather more initiative, if less of every other human\ncharacter, than the Upper. And when other meat failed them, they\nturned to what old habit had hitherto forbidden. So I say I saw it\nin my last view of the world of Eight Hundred and Two Thousand Seven\nHundred and One. It may be as wrong an explanation as mortal wit\ncould invent. It is how the thing shaped itself to me, and as that I\ngive it to you.\n\n'After the fatigues, excitements, and terrors of the past days, and\nin spite of my grief, this seat and the tranquil view and the warm\nsunlight were very pleasant. I was very tired and sleepy, and soon\nmy theorizing passed into dozing. Catching myself at that, I took my\nown hint, and spreading myself out upon the turf I had a long and\nrefreshing sleep.\n\n'I awoke a little before sunsetting. I now felt safe against being\ncaught napping by the Morlocks, and, stretching myself, I came on\ndown the hill towards the White Sphinx. I had my crowbar in one\nhand, and the other hand played with the matches in my pocket.\n\n'And now came a most unexpected thing. As I approached the pedestal\nof the sphinx I found the bronze valves were open. They had slid\ndown into grooves.\n\n'At that I stopped short before them, hesitating to enter.\n\n'Within was a small apartment, and on a raised place in the corner\nof this was the Time Machine. I had the small levers in my pocket.\nSo here, after all my elaborate preparations for the siege of the\nWhite Sphinx, was a meek surrender. I threw my iron bar away, almost\nsorry not to use it.\n\n'A sudden thought came into my head as I stooped towards the portal.\nFor once, at least, I grasped the mental operations of the Morlocks.\nSuppressing a strong inclination to laugh, I stepped through the\nbronze frame and up to the Time Machine. I was surprised to find it\nhad been carefully oiled and cleaned. I have suspected since that\nthe Morlocks had even partially taken it to pieces while trying in\ntheir dim way to grasp its purpose.\n\n'Now as I stood and examined it, finding a pleasure in the mere\ntouch of the contrivance, the thing I had expected happened. The\nbronze panels suddenly slid up and struck the frame with a clang.\nI was in the dark--trapped. So the Morlocks thought. At that I\nchuckled gleefully.\n\n'I could already hear their murmuring laughter as they came towards\nme. Very calmly I tried to strike the match. I had only to fix on\nthe levers and depart then like a ghost. But I had overlooked one\nlittle thing. The matches were of that abominable kind that light\nonly on the box.\n\n'You may imagine how all my calm vanished. The little brutes were\nclose upon me. One touched me. I made a sweeping blow in the dark at\nthem with the levers, and began to scramble into the saddle of the\nmachine. Then came one hand upon me and then another. Then I had\nsimply to fight against their persistent fingers for my levers, and\nat the same time feel for the studs over which these fitted. One,\nindeed, they almost got away from me. As it slipped from my hand,\nI had to butt in the dark with my head--I could hear the Morlock's\nskull ring--to recover it. It was a nearer thing than the fight in\nthe forest, I think, this last scramble.\n\n'But at last the lever was fitted and pulled over. The clinging\nhands slipped from me. The darkness presently fell from my eyes.\nI found myself in the same grey light and tumult I have already\ndescribed.\n\n\n\n\nXI\n\n\n'I have already told you of the sickness and confusion that comes\nwith time travelling. And this time I was not seated properly in the\nsaddle, but sideways and in an unstable fashion. For an indefinite\ntime I clung to the machine as it swayed and vibrated, quite\nunheeding how I went, and when I brought myself to look at the dials\nagain I was amazed to find where I had arrived. One dial records\ndays, and another thousands of days, another millions of days, and\nanother thousands of millions. Now, instead of reversing the levers,\nI had pulled them over so as to go forward with them, and when I\ncame to look at these indicators I found that the thousands hand was\nsweeping round as fast as the seconds hand of a watch--into\nfuturity.\n\n'As I drove on, a peculiar change crept over the appearance of\nthings. The palpitating greyness grew darker; then--though I was\nstill travelling with prodigious velocity--the blinking succession\nof day and night, which was usually indicative of a slower pace,\nreturned, and grew more and more marked. This puzzled me very much\nat first. The alternations of night and day grew slower and slower,\nand so did the passage of the sun across the sky, until they seemed\nto stretch through centuries. At last a steady twilight brooded over\nthe earth, a twilight only broken now and then when a comet glared\nacross the darkling sky. The band of light that had indicated the\nsun had long since disappeared; for the sun had ceased to set--it\nsimply rose and fell in the west, and grew ever broader and more\nred. All trace of the moon had vanished. The circling of the stars,\ngrowing slower and slower, had given place to creeping points of\nlight. At last, some time before I stopped, the sun, red and very\nlarge, halted motionless upon the horizon, a vast dome glowing with\na dull heat, and now and then suffering a momentary extinction. At\none time it had for a little while glowed more brilliantly again,\nbut it speedily reverted to its sullen red heat. I perceived by this\nslowing down of its rising and setting that the work of the tidal\ndrag was done. The earth had come to rest with one face to the sun,\neven as in our own time the moon faces the earth. Very cautiously,\nfor I remembered my former headlong fall, I began to reverse\nmy motion. Slower and slower went the circling hands until the\nthousands one seemed motionless and the daily one was no longer a\nmere mist upon its scale. Still slower, until the dim outlines of a\ndesolate beach grew visible.\n\n'I stopped very gently and sat upon the Time Machine, looking round.\nThe sky was no longer blue. North-eastward it was inky black,\nand out of the blackness shone brightly and steadily the pale\nwhite stars. Overhead it was a deep Indian red and starless, and\nsouth-eastward it grew brighter to a glowing scarlet where, cut by\nthe horizon, lay the huge hull of the sun, red and motionless. The\nrocks about me were of a harsh reddish colour, and all the trace of\nlife that I could see at first was the intensely green vegetation\nthat covered every projecting point on their south-eastern face. It\nwas the same rich green that one sees on forest moss or on the\nlichen in caves: plants which like these grow in a perpetual\ntwilight.\n\n'The machine was standing on a sloping beach. The sea stretched away\nto the south-west, to rise into a sharp bright horizon against the\nwan sky. There were no breakers and no waves, for not a breath of\nwind was stirring. Only a slight oily swell rose and fell like a\ngentle breathing, and showed that the eternal sea was still moving\nand living. And along the margin where the water sometimes broke was\na thick incrustation of salt--pink under the lurid sky. There was a\nsense of oppression in my head, and I noticed that I was breathing\nvery fast. The sensation reminded me of my only experience of\nmountaineering, and from that I judged the air to be more rarefied\nthan it is now.\n\n'Far away up the desolate slope I heard a harsh scream, and saw a\nthing like a huge white butterfly go slanting and fluttering up into\nthe sky and, circling, disappear over some low hillocks beyond. The\nsound of its voice was so dismal that I shivered and seated myself\nmore firmly upon the machine. Looking round me again, I saw that,\nquite near, what I had taken to be a reddish mass of rock was moving\nslowly towards me. Then I saw the thing was really a monstrous\ncrab-like creature. Can you imagine a crab as large as yonder table,\nwith its many legs moving slowly and uncertainly, its big claws\nswaying, its long antennae, like carters' whips, waving and feeling,\nand its stalked eyes gleaming at you on either side of its metallic\nfront? Its back was corrugated and ornamented with ungainly bosses,\nand a greenish incrustation blotched it here and there. I could see\nthe many palps of its complicated mouth flickering and feeling as it\nmoved.\n\n'As I stared at this sinister apparition crawling towards me, I felt\na tickling on my cheek as though a fly had lighted there. I tried to\nbrush it away with my hand, but in a moment it returned, and almost\nimmediately came another by my ear. I struck at this, and caught\nsomething threadlike. It was drawn swiftly out of my hand. With a\nfrightful qualm, I turned, and I saw that I had grasped the antenna\nof another monster crab that stood just behind me. Its evil eyes\nwere wriggling on their stalks, its mouth was all alive with\nappetite, and its vast ungainly claws, smeared with an algal slime,\nwere descending upon me. In a moment my hand was on the lever, and\nI had placed a month between myself and these monsters. But I was\nstill on the same beach, and I saw them distinctly now as soon as I\nstopped. Dozens of them seemed to be crawling here and there, in the\nsombre light, among the foliated sheets of intense green.\n\n'I cannot convey the sense of abominable desolation that hung over\nthe world. The red eastern sky, the northward blackness, the salt\nDead Sea, the stony beach crawling with these foul, slow-stirring\nmonsters, the uniform poisonous-looking green of the lichenous\nplants, the thin air that hurts one's lungs: all contributed to an\nappalling effect. I moved on a hundred years, and there was the same\nred sun--a little larger, a little duller--the same dying sea, the\nsame chill air, and the same crowd of earthy crustacea creeping in\nand out among the green weed and the red rocks. And in the westward\nsky, I saw a curved pale line like a vast new moon.\n\n'So I travelled, stopping ever and again, in great strides of a\nthousand years or more, drawn on by the mystery of the earth's fate,\nwatching with a strange fascination the sun grow larger and duller\nin the westward sky, and the life of the old earth ebb away. At\nlast, more than thirty million years hence, the huge red-hot dome of\nthe sun had come to obscure nearly a tenth part of the darkling\nheavens. Then I stopped once more, for the crawling multitude of\ncrabs had disappeared, and the red beach, save for its livid green\nliverworts and lichens, seemed lifeless. And now it was flecked with\nwhite. A bitter cold assailed me. Rare white flakes ever and again\ncame eddying down. To the north-eastward, the glare of snow lay\nunder the starlight of the sable sky and I could see an undulating\ncrest of hillocks pinkish white. There were fringes of ice along the\nsea margin, with drifting masses further out; but the main expanse\nof that salt ocean, all bloody under the eternal sunset, was still\nunfrozen.\n\n'I looked about me to see if any traces of animal life remained. A\ncertain indefinable apprehension still kept me in the saddle of the\nmachine. But I saw nothing moving, in earth or sky or sea. The green\nslime on the rocks alone testified that life was not extinct. A\nshallow sandbank had appeared in the sea and the water had receded\nfrom the beach. I fancied I saw some black object flopping about\nupon this bank, but it became motionless as I looked at it, and I\njudged that my eye had been deceived, and that the black object was\nmerely a rock. The stars in the sky were intensely bright and seemed\nto me to twinkle very little.\n\n'Suddenly I noticed that the circular westward outline of the sun\nhad changed; that a concavity, a bay, had appeared in the curve. I\nsaw this grow larger. For a minute perhaps I stared aghast at this\nblackness that was creeping over the day, and then I realized that\nan eclipse was beginning. Either the moon or the planet Mercury was\npassing across the sun's disk. Naturally, at first I took it to be\nthe moon, but there is much to incline me to believe that what I\nreally saw was the transit of an inner planet passing very near to\nthe earth.\n\n'The darkness grew apace; a cold wind began to blow in freshening\ngusts from the east, and the showering white flakes in the air\nincreased in number. From the edge of the sea came a ripple and\nwhisper. Beyond these lifeless sounds the world was silent. Silent?\nIt would be hard to convey the stillness of it. All the sounds of\nman, the bleating of sheep, the cries of birds, the hum of insects,\nthe stir that makes the background of our lives--all that was over.\nAs the darkness thickened, the eddying flakes grew more abundant,\ndancing before my eyes; and the cold of the air more intense. At\nlast, one by one, swiftly, one after the other, the white peaks of\nthe distant hills vanished into blackness. The breeze rose to a\nmoaning wind. I saw the black central shadow of the eclipse sweeping\ntowards me. In another moment the pale stars alone were visible. All\nelse was rayless obscurity. The sky was absolutely black.\n\n'A horror of this great darkness came on me. The cold, that smote\nto my marrow, and the pain I felt in breathing, overcame me. I\nshivered, and a deadly nausea seized me. Then like a red-hot bow\nin the sky appeared the edge of the sun. I got off the machine to\nrecover myself. I felt giddy and incapable of facing the return\njourney. As I stood sick and confused I saw again the moving thing\nupon the shoal--there was no mistake now that it was a moving\nthing--against the red water of the sea. It was a round thing, the\nsize of a football perhaps, or, it may be, bigger, and tentacles\ntrailed down from it; it seemed black against the weltering\nblood-red water, and it was hopping fitfully about. Then I felt I\nwas fainting. But a terrible dread of lying helpless in that remote\nand awful twilight sustained me while I clambered upon the saddle.\n\n\n\n\nXII\n\n\n'So I came back. For a long time I must have been insensible upon\nthe machine. The blinking succession of the days and nights was\nresumed, the sun got golden again, the sky blue. I breathed with\ngreater freedom. The fluctuating contours of the land ebbed and\nflowed. The hands spun backward upon the dials. At last I saw again\nthe dim shadows of houses, the evidences of decadent humanity.\nThese, too, changed and passed, and others came. Presently, when the\nmillion dial was at zero, I slackened speed. I began to recognize\nour own pretty and familiar architecture, the thousands hand ran back\nto the starting-point, the night and day flapped slower and slower.\nThen the old walls of the laboratory came round me. Very gently,\nnow, I slowed the mechanism down.\n\n'I saw one little thing that seemed odd to me. I think I have told\nyou that when I set out, before my velocity became very high, Mrs.\nWatchett had walked across the room, travelling, as it seemed to me,\nlike a rocket. As I returned, I passed again across that minute when\nshe traversed the laboratory. But now her every motion appeared to\nbe the exact inversion of her previous ones. The door at the lower\nend opened, and she glided quietly up the laboratory, back foremost,\nand disappeared behind the door by which she had previously entered.\nJust before that I seemed to see Hillyer for a moment; but he passed\nlike a flash.\n\n'Then I stopped the machine, and saw about me again the old familiar\nlaboratory, my tools, my appliances just as I had left them. I got\noff the thing very shakily, and sat down upon my bench. For several\nminutes I trembled violently. Then I became calmer. Around me was\nmy old workshop again, exactly as it had been. I might have slept\nthere, and the whole thing have been a dream.\n\n'And yet, not exactly! The thing had started from the south-east\ncorner of the laboratory. It had come to rest again in the\nnorth-west, against the wall where you saw it. That gives you the\nexact distance from my little lawn to the pedestal of the White\nSphinx, into which the Morlocks had carried my machine.\n\n'For a time my brain went stagnant. Presently I got up and came\nthrough the passage here, limping, because my heel was still\npainful, and feeling sorely begrimed. I saw the _Pall Mall Gazette_\non the table by the door. I found the date was indeed to-day, and\nlooking at the timepiece, saw the hour was almost eight o'clock. I\nheard your voices and the clatter of plates. I hesitated--I felt so\nsick and weak. Then I sniffed good wholesome meat, and opened the\ndoor on you. You know the rest. I washed, and dined, and now I am\ntelling you the story.\n\n'I know,' he said, after a pause, 'that all this will be absolutely\nincredible to you. To me the one incredible thing is that I am here\nto-night in this old familiar room looking into your friendly faces\nand telling you these strange adventures.'\n\nHe looked at the Medical Man. 'No. I cannot expect you to believe\nit. Take it as a lie--or a prophecy. Say I dreamed it in the\nworkshop. Consider I have been speculating upon the destinies of our\nrace until I have hatched this fiction. Treat my assertion of its\ntruth as a mere stroke of art to enhance its interest. And taking\nit as a story, what do you think of it?'\n\nHe took up his pipe, and began, in his old accustomed manner, to tap\nwith it nervously upon the bars of the grate. There was a momentary\nstillness. Then chairs began to creak and shoes to scrape upon the\ncarpet. I took my eyes off the Time Traveller's face, and looked\nround at his audience. They were in the dark, and little spots of\ncolour swam before them. The Medical Man seemed absorbed in the\ncontemplation of our host. The Editor was looking hard at the end\nof his cigar--the sixth. The Journalist fumbled for his watch. The\nothers, as far as I remember, were motionless.\n\nThe Editor stood up with a sigh. 'What a pity it is you're not\na writer of stories!' he said, putting his hand on the Time\nTraveller's shoulder.\n\n'You don't believe it?'\n\n'Well----'\n\n'I thought not.'\n\nThe Time Traveller turned to us. 'Where are the matches?' he said.\nHe lit one and spoke over his pipe, puffing. 'To tell you the truth\n... I hardly believe it myself.... And yet...'\n\nHis eye fell with a mute inquiry upon the withered white flowers\nupon the little table. Then he turned over the hand holding his\npipe, and I saw he was looking at some half-healed scars on his\nknuckles.\n\nThe Medical Man rose, came to the lamp, and examined the flowers.\n'The gynaeceum's odd,' he said. The Psychologist leant forward to\nsee, holding out his hand for a specimen.\n\n'I'm hanged if it isn't a quarter to one,' said the Journalist.\n'How shall we get home?'\n\n'Plenty of cabs at the station,' said the Psychologist.\n\n'It's a curious thing,' said the Medical Man; 'but I certainly don't\nknow the natural order of these flowers. May I have them?'\n\nThe Time Traveller hesitated. Then suddenly: 'Certainly not.'\n\n'Where did you really get them?' said the Medical Man.\n\nThe Time Traveller put his hand to his head. He spoke like one who\nwas trying to keep hold of an idea that eluded him. 'They were put\ninto my pocket by Weena, when I travelled into Time.' He stared\nround the room. 'I'm damned if it isn't all going. This room and you\nand the atmosphere of every day is too much for my memory. Did I\never make a Time Machine, or a model of a Time Machine? Or is it all\nonly a dream? They say life is a dream, a precious poor dream at\ntimes--but I can't stand another that won't fit. It's madness. And\nwhere did the dream come from? ... I must look at that machine. If\nthere is one!'\n\nHe caught up the lamp swiftly, and carried it, flaring red, through\nthe door into the corridor. We followed him. There in the flickering\nlight of the lamp was the machine sure enough, squat, ugly, and\naskew; a thing of brass, ebony, ivory, and translucent glimmering\nquartz. Solid to the touch--for I put out my hand and felt the rail\nof it--and with brown spots and smears upon the ivory, and bits of\ngrass and moss upon the lower parts, and one rail bent awry.\n\nThe Time Traveller put the lamp down on the bench, and ran his hand\nalong the damaged rail. 'It's all right now,' he said. 'The story I\ntold you was true. I'm sorry to have brought you out here in the\ncold.' He took up the lamp, and, in an absolute silence, we\nreturned to the smoking-room.\n\nHe came into the hall with us and helped the Editor on with his\ncoat. The Medical Man looked into his face and, with a certain\nhesitation, told him he was suffering from overwork, at which he\nlaughed hugely. I remember him standing in the open doorway, bawling\ngood night.\n\nI shared a cab with the Editor. He thought the tale a 'gaudy lie.'\nFor my own part I was unable to come to a conclusion. The story was\nso fantastic and incredible, the telling so credible and sober. I\nlay awake most of the night thinking about it. I determined to go\nnext day and see the Time Traveller again. I was told he was in the\nlaboratory, and being on easy terms in the house, I went up to him.\nThe laboratory, however, was empty. I stared for a minute at the\nTime Machine and put out my hand and touched the lever. At that the\nsquat substantial-looking mass swayed like a bough shaken by the\nwind. Its instability startled me extremely, and I had a queer\nreminiscence of the childish days when I used to be forbidden to\nmeddle. I came back through the corridor. The Time Traveller met me\nin the smoking-room. He was coming from the house. He had a small\ncamera under one arm and a knapsack under the other. He laughed when\nhe saw me, and gave me an elbow to shake. 'I'm frightfully busy,'\nsaid he, 'with that thing in there.'\n\n'But is it not some hoax?' I said. 'Do you really travel through\ntime?'\n\n'Really and truly I do.' And he looked frankly into my eyes. He\nhesitated. His eye wandered about the room. 'I only want half an\nhour,' he said. 'I know why you came, and it's awfully good of you.\nThere's some magazines here. If you'll stop to lunch I'll prove you\nthis time travelling up to the hilt, specimen and all. If you'll\nforgive my leaving you now?'\n\nI consented, hardly comprehending then the full import of his words,\nand he nodded and went on down the corridor. I heard the door of\nthe laboratory slam, seated myself in a chair, and took up a daily\npaper. What was he going to do before lunch-time? Then suddenly\nI was reminded by an advertisement that I had promised to meet\nRichardson, the publisher, at two. I looked at my watch, and saw\nthat I could barely save that engagement. I got up and went down the\npassage to tell the Time Traveller.\n\nAs I took hold of the handle of the door I heard an exclamation,\noddly truncated at the end, and a click and a thud. A gust of air\nwhirled round me as I opened the door, and from within came the\nsound of broken glass falling on the floor. The Time Traveller was\nnot there. I seemed to see a ghostly, indistinct figure sitting in\na whirling mass of black and brass for a moment--a figure so\ntransparent that the bench behind with its sheets of drawings was\nabsolutely distinct; but this phantasm vanished as I rubbed my eyes.\nThe Time Machine had gone. Save for a subsiding stir of dust, the\nfurther end of the laboratory was empty. A pane of the skylight had,\napparently, just been blown in.\n\nI felt an unreasonable amazement. I knew that something strange had\nhappened, and for the moment could not distinguish what the strange\nthing might be. As I stood staring, the door into the garden opened,\nand the man-servant appeared.\n\nWe looked at each other. Then ideas began to come. 'Has Mr. ----\ngone out that way?' said I.\n\n'No, sir. No one has come out this way. I was expecting to find him\nhere.'\n\nAt that I understood. At the risk of disappointing Richardson I\nstayed on, waiting for the Time Traveller; waiting for the second,\nperhaps still stranger story, and the specimens and photographs he\nwould bring with him. But I am beginning now to fear that I must\nwait a lifetime. The Time Traveller vanished three years ago. And,\nas everybody knows now, he has never returned.\n\n\n\n\nEPILOGUE\n\n\nOne cannot choose but wonder. Will he ever return? It may be that he\nswept back into the past, and fell among the blood-drinking, hairy\nsavages of the Age of Unpolished Stone; into the abysses of the\nCretaceous Sea; or among the grotesque saurians, the huge reptilian\nbrutes of the Jurassic times. He may even now--if I may use the\nphrase--be wandering on some plesiosaurus-haunted Oolitic coral\nreef, or beside the lonely saline lakes of the Triassic Age. Or did\nhe go forward, into one of the nearer ages, in which men are still\nmen, but with the riddles of our own time answered and its wearisome\nproblems solved? Into the manhood of the race: for I, for my own\npart, cannot think that these latter days of weak experiment,\nfragmentary theory, and mutual discord are indeed man's culminating\ntime! I say, for my own part. He, I know--for the question had been\ndiscussed among us long before the Time Machine was made--thought\nbut cheerlessly of the Advancement of Mankind, and saw in the\ngrowing pile of civilization only a foolish heaping that must\ninevitably fall back upon and destroy its makers in the end. If that\nis so, it remains for us to live as though it were not so. But to me\nthe future is still black and blank--is a vast ignorance, lit at a\nfew casual places by the memory of his story. And I have by me, for\nmy comfort, two strange white flowers--shrivelled now, and brown and\nflat and brittle--to witness that even when mind and strength had\ngone, gratitude and a mutual tenderness still lived on in the heart\nof man.", "title": "The Time Machine"}