{"summary": "Hedda, the daughter of an aristocratic and enigmatic general, has just returned to her villa in Kristiania (now Oslo) from her honeymoon. Her husband is George Tesman, a young, aspiring, and reliable (but not brilliant) academic who continued his research during their honeymoon. It becomes clear in the course of the play that she has never loved him but married him because she thinks her years of youthful abandon are over. It is also suggested that she may be pregnant.\nThe reappearance of George's academic rival, Eilert Lövborg, throws their lives into disarray. Eilert, a writer, is also a recovered alcoholic who has wasted his talent until now. Thanks to a relationship with Hedda's old schoolmate Thea Elvsted (who has left her husband for him), Eilert shows signs of rehabilitation and has just published a bestseller in the same field as George. When Hedda and Eilert talk privately together, it becomes apparent that they are former lovers.\nThe critical success of his recently published work makes Eilert a threat to George, as Eilert is now a competitor for the university professorship George had been counting on. George and Hedda are financially overstretched, and George tells Hedda that he will not be able to finance the regular entertaining or luxurious housekeeping that she had been expecting. Upon meeting Eilert, however, the couple discover that he has no intention of competing for the professorship, but rather has spent the last few years labouring with Thea over what he considers to be his masterpiece, the \"sequel\" to his recently published work.\nApparently jealous of Thea's influence over Eilert, Hedda hopes to come between them. Despite his drinking problem, she encourages Eilert to accompany George and his associate, Judge Brack, to a party. George returns home from the party and reveals that he found the complete manuscript of Eilert's great work, which the latter lost while drunk. When Eilert next sees Hedda, he confesses to her, despairingly, that he has lost the manuscript. Instead of telling him that the manuscript has been found, Hedda encourages him to commit suicide, giving him a pistol. She then burns the manuscript and tells George she has destroyed it to secure their future.\nWhen the news comes that Eilert has indeed killed himself, George and Thea are determined to try to reconstruct his book from Eilert's notes, which Thea has kept. Hedda is shocked to discover from Judge Brack that Eilert's death, in a brothel, was messy and probably accidental; this \"ridiculous and vile\" death contrasts with the \"beautiful and free\" one that Hedda had imagined for him. Worse, Brack knows the origins of the pistol. He tells Hedda that if he reveals what he knows, a scandal will likely arise around her. Hedda realizes that this places Brack in a position of power over her. Leaving the others, she goes into her smaller room and shoots herself in the head. The others in the room assume that Hedda is simply firing shots, and they follow the sound to investigate. The play ends with George, Brack, and Thea discovering her body.\n\n", "full_text": "HEDDA GABLER\n\nBy Henrik Ibsen\n\n\nTranslated by Edmund Gosse and William Archer\n\n\nIntroduction by William Archer\n\n\n\n\n\nINTRODUCTION.\n\n\nFrom Munich, on June 29, 1890, Ibsen wrote to the Swedish poet, Count\nCarl Soilsky: \"Our intention has all along been to spend the summer in\nthe Tyrol again. But circumstances are against our doing so. I am at\npresent engaged upon a new dramatic work, which for several reasons has\nmade very slow progress, and I do not leave Munich until I can take with\nme the completed first draft. There is little or no prospect of my being\nable to complete it in July.\" Ibsen did not leave Munich at all that\nseason. On October 30 he wrote: \"At present I am utterly engrossed in\na new play. Not one leisure hour have I had for several months.\" Three\nweeks later (November 20) he wrote to his French translator, Count\nProzor: \"My new play is finished; the manuscript went off to Copenhagen\nthe day before yesterday.... It produces a curious feeling of emptiness\nto be thus suddenly separated from a work which has occupied one's time\nand thoughts for several months, to the exclusion of all else. But it is\na good thing, too, to have done with it. The constant intercourse with\nthe fictitious personages was beginning to make me quite nervous.\" To\nthe same correspondent he wrote on December 4: \"The title of the play is\n_Hedda Gabler_. My intention in giving it this name was to indicate\nthat Hedda, as a personality, is to be regarded rather as her father's\ndaughter than as her husband's wife. It was not my desire to deal in\nthis play with so-called problems. What I principally wanted to do was\nto depict human beings, human emotions, and human destinies, upon a\ngroundwork of certain of the social conditions and principles of the\npresent day.\"\n\nSo far we read the history of the play in the official\n\"Correspondence.\"(1) Some interesting glimpses into the poet's moods\nduring the period between the completion of _The Lady from the Sea_\nand the publication of _Hedda Gabler_ are to be found in the series of\nletters to Fraulein Emilie Bardach, of Vienna, published by Dr. George\nBrandes.(2) This young lady Ibsen met at Gossensass in the Tyrol in\nthe autumn of 1889. The record of their brief friendship belongs to the\nhistory of _The Master Builder_ rather than to that of _Hedda Gabler_,\nbut the allusions to his work in his letters to her during the winter of\n1889 demand some examination.\n\nSo early as October 7, 1889, he writes to her: \"A new poem begins to\ndawn in me. I will execute it this winter, and try to transfer to it\nthe bright atmosphere of the summer. But I feel that it will end in\nsadness--such is my nature.\" Was this \"dawning\" poem _Hedda Gabler_? Or\nwas it rather _The Master Builder_ that was germinating in his mind? Who\nshall say? The latter hypothesis seems the more probable, for it is hard\nto believe that at any stage in the incubation of _Hedda Gabler_ he can\nhave conceived it as even beginning in gaiety. A week later, however,\nhe appears to have made up his mind that the time had not come for the\npoetic utilisation of his recent experiences. He writes on October 15:\n\"Here I sit as usual at my writing-table. Now I would fain work, but\nam unable to. My fancy, indeed, is very active. But it always wanders\naway ours. I cannot repress my summer memories--nor do I wish to. I live\nthrough my experience again and again and yet again. To transmute it\nall into a poem, I find, in the meantime, impossible.\" Clearly, then,\nhe felt that his imagination ought to have been engaged on some theme\nhaving no relation to his summer experiences--the theme, no doubt, of\n_Hedda Gabler_. In his next letter, dated October 29, he writes: \"Do not\nbe troubled because I cannot, in the meantime, create (_dichten_). In\nreality I am for ever creating, or, at any rate, dreaming of something\nwhich, when in the fulness of time it ripens, will reveal itself as\na creation (_Dichtung_).\" On November 19 he says: \"I am very busily\noccupied with preparations for my new poem. I sit almost the whole day\nat my writing-table. Go out only in the evening for a little while.\" The\nfive following letters contain no allusion to the play; but on September\n18, 1890, he wrote: \"My wife and son are at present at Riva, on the Lake\nof Garda, and will probably remain there until the middle of October,\nor even longer. Thus I am quite alone here, and cannot get away. The new\nplay on which I am at present engaged will probably not be ready until\nNovember, though I sit at my writing-table daily, and almost the whole\nday long.\"\n\nHere ends the history of _Hedda Gabler_, so far as the poet's\nletters carry us. Its hard clear outlines, and perhaps somewhat bleak\natmosphere, seem to have resulted from a sort of reaction against the\nsentimental \"dreamery\" begotten of his Gossensass experiences. He\nsought refuge in the chill materialism of Hedda from the ardent\ntranscendentalism of Hilda, whom he already heard knocking at the door.\nHe was not yet in the mood to deal with her on the plane of poetry.(3)\n\n_Hedda Gabler_ was published in Copenhagen on December 16, 1890. This\nwas the first of Ibsen's plays to be translated from proof-sheets and\npublished in England and America almost simultaneously with its first\nappearance in Scandinavia. The earliest theatrical performance took\nplace at the Residenz Theater, Munich, on the last day of January 1891,\nin the presence of the poet, Frau Conrad-Ramlo playing the title-part.\nThe Lessing Theater, Berlin, followed suit on February 10. Not till\nFebruary 25 was the play seen in Copenhagen, with Fru Hennings as Hedda.\nOn the following night it was given for the first time in Christiania,\nthe Norwegian Hedda being Froken Constance Bruun. It was this production\nwhich the poet saw when he visited the Christiania Theater for the first\ntime after his return to Norway, August 28, 1891. It would take pages\nto give even the baldest list of the productions and revivals of _Hedda\nGabler_ in Scandinavia and Germany, where it has always ranked among\nIbsen's most popular works. The admirable production of the play by Miss\nElizabeth Robins and Miss Marion Lea, at the Vaudeville Theatre,\nLondon, April 20, 1891, may rank as the second great step towards\nthe popularisation of Ibsen in England, the first being the\nCharrington-Achurch production of _A Doll's House_ in 1889. Miss Robins\nafterwards repeated her fine performance of Hedda many times, in London,\nin the English provinces, and in New York. The character has also been\nacted in London by Eleonora Duse, and as I write (March, 5, 1907) by\nMrs. Patrick Campbell, at the Court Theatre. In Australia and America,\nHedda has frequently been acted by Miss Nance O'Neill and other\nactresses--quite recently by a Russian actress, Madame Alla Nazimova,\nwho (playing in English) seems to have made a notable success both in\nthis part and in Nora. The first French Hedda Gabler was Mlle. Marthe\nBrandes, who played the part at the Vaudeville Theatre, Paris, on\nDecember 17, 1891, the performance being introduced by a lecture by M.\nJules Lemaitre. In Holland, in Italy, in Russia, the play has been acted\ntimes without number. In short (as might easily have been foretold) it\nhas rivalled _A Doll's House_ in world-wide popularity.\n\nIt has been suggested,(4) I think without sufficient ground, that Ibsen\ndeliberately conceived _Hedda Gabler_ as an \"international\" play, and\nthat the scene is really the \"west end\" of any European city. To me\nit seems quite clear that Ibsen had Christiania in mind, and the\nChristiania of a somewhat earlier period than the 'nineties. The\nelectric cars, telephones, and other conspicuous factors in the life of\na modern capital are notably absent from the play. There is no electric\nlight in Secretary Falk's villa. It is still the habit for ladies to\nreturn on foot from evening parties, with gallant swains escorting them.\nThis \"suburbanism,\" which so distressed the London critics of 1891,\nwas characteristic of the Christiania Ibsen himself had known in the\n'sixties--the Christiania of _Love's Comedy_--rather than of the\ngreatly extended and modernised city of the end of the century. Moreover\nLovborg's allusions to the fiord, and the suggested picture of Sheriff\nElvsted, his family and his avocations are all distinctively Norwegian.\nThe truth seems to be very simple--the environment and the subsidiary\npersonages are all thoroughly national, but Hedda herself is an\n\"international\" type, a product of civilisation by no means peculiar to\nNorway.\n\nWe cannot point to any individual model or models who \"sat to\" Ibsen for\nthe character of Hedda.(5) The late Grant Allen declared that Hedda was\n\"nothing more nor less than the girl we take down to dinner in London\nnineteen times out of twenty\"; in which case Ibsen must have suffered\nfrom a superfluidity of models, rather than from any difficulty in\nfinding one. But the fact is that in this, as in all other instances,\nthe word \"model\" must be taken in a very different sense from that in\nwhich it is commonly used in painting. Ibsen undoubtedly used models for\nthis trait and that, but never for a whole figure. If his characters can\nbe called portraits at all, they are composite portraits. Even when it\nseems pretty clear that the initial impulse towards the creation of a\nparticular character came from some individual, the original figure is\nentirely transmuted in the process of harmonisation with the dramatic\nscheme. We need not, therefore, look for a definite prototype of Hedda;\nbut Dr. Brandes shows that two of that lady's exploits were probably\nsuggested by the anecdotic history of the day.\n\nIbsen had no doubt heard how the wife of a well-known Norwegian\ncomposer, in a fit of raging jealousy excited by her husband's prolonged\nabsence from home, burnt the manuscript of a symphony which he had just\nfinished. The circumstances under which Hedda burns Lovborg's manuscript\nare, of course, entirely different and infinitely more dramatic;\nbut here we have merely another instance of the dramatisation or\n\"poetisation\" of the raw material of life. Again, a still more painful\nincident probably came to his knowledge about the same time. A beautiful\nand very intellectual woman was married to a well-known man who had been\naddicted to drink, but had entirely conquered the vice. One day a mad\nwhim seized her to put his self-mastery and her power over him to the\ntest. As it happened to be his birthday, she rolled into his study a\nsmall keg of brandy, and then withdrew. She returned some time after\nwards to find that he had broached the keg, and lay insensible on the\nfloor. In this anecdote we cannot but recognise the germ, not only of\nHedda's temptation of Lovborg, but of a large part of her character.\n\n\"Thus,\" says Dr. Brandes, \"out of small and scattered traits of reality\nIbsen fashioned his close-knit and profoundly thought-out works of art.\"\n\nFor the character of Eilert Lovborg, again, Ibsen seem unquestionably\nto have borrowed several traits from a definite original. A young Danish\nman of letters, whom Dr. Brandes calls Holm, was an enthusiastic admirer\nof Ibsen, and came to be on very friendly terms with him. One day Ibsen\nwas astonished to receive, in Munich, a parcel addressed from Berlin by\nthis young man, containing, without a word of explanation, a packet of\nhis (Ibsen's) letters, and a photograph which he had presented to Holm.\nIbsen brooded and brooded over the incident, and at last came to the\nconclusion that the young man had intended to return her letters and\nphotograph to a young lady to whom he was known to be attached, and had\nin a fit of aberration mixed up the two objects of his worship. Some\ntime after, Holm appeared at Ibsen's rooms. He talked quite rationally,\nbut professed to have no knowledge whatever of the letter-incident,\nthough he admitted the truth of Ibsen's conjecture that the \"belle dame\nsans merci\" had demanded the return of her letters and portrait. Ibsen\nwas determined to get at the root of the mystery; and a little inquiry\ninto his young friend's habits revealed the fact that he broke his fast\non a bottle of port wine, consumed a bottle of Rhine wine at lunch, of\nBurgundy at dinner, and finished off the evening with one or two more\nbottles of port. Then he heard, too, how, in the course of a night's\ncarouse, Holm had lost the manuscript of a book; and in these traits he\nsaw the outline of the figure of Eilert Lovborg.\n\nSome time elapsed, and again Ibsen received a postal packet from Holm.\nThis one contained his will, in which Ibsen figured as his residuary\nlegatee. But many other legatees were mentioned in the instrument--all\nof them ladies, such as Fraulein Alma Rothbart, of Bremen, and Fraulein\nElise Kraushaar, of Berlin. The bequests to these meritorious spinsters\nwere so generous that their sum considerably exceeded the amount of\nthe testator's property. Ibsen gently but firmly declined the proffered\ninheritance; but Holm's will no doubt suggested to him the figure of\nthat red-haired \"Mademoiselle Diana,\" who is heard of but not seen\nin _Hedda Gabler_, and enabled him to add some further traits to the\nportraiture of Lovborg. When the play appeared, Holm recognised\nhimself with glee in the character of the bibulous man of letters,\nand thereafter adopted \"Eilert Lovborg\" as his pseudonym. I do not,\ntherefore, see why Dr. Brandes should suppress his real name; but I\nwillingly imitate him in erring on the side of discretion. The poor\nfellow died several years ago.\n\nSome critics have been greatly troubled as to the precise meaning of\nHedda's fantastic vision of Lovborg \"with vine-leaves in his hair.\"\nSurely this is a very obvious image or symbol of the beautiful, the\nideal, aspect of bacchic elation and revelry. Antique art, or I am much\nmistaken, shows us many figures of Dionysus himself and his followers\nwith vine-leaves entwined their hair. To Ibsen's mind, at any rate, the\nimage had long been familiar. In _Peer Gynt_ (Act iv. sc. 8), when Peer,\nhaving carried off Anitra, finds himself in a particularly festive mood,\nhe cries: \"Were there vine-leaves around, I would garland my brow.\"\nAgain, in _Emperor and Galilean_ (Pt. ii. Act 1) where Julian, in the\nprocession of Dionysus, impersonates the god himself, it is directed\nthat he shall wear a wreath of vine-leaves. Professor Dietrichson\nrelates that among the young artists whose society Ibsen frequented\nduring his first years in Rome, it was customary, at their little\nfestivals, for the revellers to deck themselves in this fashion. But the\nimage is so obvious that there is no need to trace it to any personal\nexperience. The attempt to place Hedda's vine-leaves among Ibsen's\nobscurities is an example of the firm resolution not to understand which\nanimated the criticism of the 'nineties.\n\nDr. Brandes has dealt very severely with the character of Eilert\nLovborg, alleging that we cannot believe in the genius attributed to\nhim. But where is he described as a genius? The poet represents him as a\nvery able student of sociology; but that is quite a different thing from\nattributing to him such genius as must necessarily shine forth in every\nword he utters. Dr. Brandes, indeed, declines to believe even in his\nability as a sociologist, on the ground that it is idle to write about\nthe social development of the future. \"To our prosaic minds,\" he says,\n\"it may seem as if the most sensible utterance on the subject is that of\nthe fool of the play: 'The future! Good heavens, we know nothing of the\nfuture.'\" The best retort to this criticism is that which Eilert himself\nmakes: \"There's a thing or two to be said about it all the same.\" The\nintelligent forecasting of the future (as Mr. H. G. Wells has shown)\nis not only clearly distinguishable from fantastic Utopianism, but is\nindispensable to any large statesmanship or enlightened social activity.\nWith very real and very great respect for Dr. Brandes, I cannot think\nthat he has been fortunate in his treatment of Lovborg's character.\nIt has been represented as an absurdity that he would think of reading\nabstracts from his new book to a man like Tesman, whom he despises. But\nthough Tesman is a ninny, he is, as Hedda says, a \"specialist\"--he is a\ncompetent, plodding student of his subject. Lovborg may quite naturally\nwish to see how his new method, or his excursion into a new field,\nstrikes the average scholar of the Tesman type. He is, in fact, \"trying\nit on the dog\"--neither an unreasonable nor an unusual proceeding. There\nis, no doubt, a certain improbability in the way in which Lovborg is\nrepresented as carrying his manuscript around, and especially in Mrs.\nElvsted's production of his rough draft from her pocket; but these are\nmechanical trifles, on which only a niggling criticism would dream of\nlaying stress.\n\nOf all Ibsen's works, _Hedda Gabler_ is the most detached, the most\nobjective--a character-study pure and simple. It is impossible--or so\nit seems to me--to extract any sort of general idea from it. One cannot\neven call it a satire, unless one is prepared to apply that term to the\nrecord of a \"case\" in a work of criminology. Reverting to Dumas's dictum\nthat a play should contain \"a painting, a judgment, an ideal,\" we may\nsay the _Hedda Gabler_ fulfils only the first of these requirements. The\npoet does not even pass judgment on his heroine: he simply paints her\nfull-length portrait with scientific impassivity. But what a portrait!\nHow searching in insight, how brilliant in colouring, how rich in\ndetail! Grant Allen's remark, above quoted, was, of course, a whimsical\nexaggeration; the Hedda type is not so common as all that, else the\nworld would quickly come to an end. But particular traits and tendencies\nof the Hedda type are very common in modern life, and not only among\nwomen. Hyperaesthesia lies at the root of her tragedy. With a keenly\ncritical, relentlessly solvent intelligence, she combines a morbid\nshrinking from all the gross and prosaic detail of the sensual life.\nShe has nothing to take her out of herself--not a single intellectual\ninterest or moral enthusiasm. She cherishes, in a languid way, a petty\nsocial ambition; and even that she finds obstructed and baffled. At the\nsame time she learns that another woman has had the courage to love and\nventure all, where she, in her cowardice, only hankered and refrained.\nHer malign egoism rises up uncontrolled, and calls to its aid her quick\nand subtle intellect. She ruins the other woman's happiness, but in\ndoing so incurs a danger from which her sense of personal dignity\nrevolts. Life has no such charm for her that she cares to purchase it at\nthe cost of squalid humiliation and self-contempt. The good and the bad\nin her alike impel her to have done with it all; and a pistol-shot\nends what is surely one of the most poignant character-tragedies in\nliterature. Ibsen's brain never worked at higher pressure than in the\nconception and adjustment of those \"crowded hours\" in which Hedda,\ntangled in the web of Will and Circumstance, struggles on till she is\ntoo weary to struggle any more.\n\nIt may not be superfluous to note that the \"a\" in \"Gabler\" should be\nsounded long and full, like the \"a\" in \"Garden\"--NOT like the \"a\" in\n\"gable\" or in \"gabble.\"\n\n\nW. A.\n\n\nFOOTNOTES.\n\n   (1)Letters 214, 216, 217, 219.\n\n   (2)In the Ibsen volume of _Die Literatur_ (Berlin).\n\n   (3)Dr. Julius Elias (_Neue deutsche Rundschau_, December 1906, p. 1462)\n     makes the curious assertion that the character of Thea Elvsted was\n     in part borrowed from this \"Gossensasser Hildetypus.\"  It is hard to\n     see how even Gibes' ingenuity could distil from the same flower two\n     such different essences as Thea and Hilda.\n\n   (4)See article by Herman Bang in _Neue deutsche Rundschau_, December\n     1906, p. 1495.\n\n   (5)Dr. Brahm (_Neue deutsche Rundschau_, December 1906, P. 1422) says\n     that after the first performance of _Hedda Gabler_ in Berlin Ibsen\n     confided to him that the character had been suggested by a German\n     lady whom he met in Munich, and who did not shoot, but poisoned\n     herself.  Nothing more seems to be known of this lady.  See, too,\n     an article by Julius Elias in the same magazine, p. 1460.\n\n\nTranscriber's Note:\n\nThe inclusion or omission of commas between repeated words (\"well,\nwell\"; \"there there\", etc.) in this etext is reproduced faithfully from\nboth the 1914 and 1926 editions of _Hedda Gabler_, copyright 1907 by\nCharles Scribner's Sons. Modern editions of the same translation use the\ncommas consistently throughout.--D.L.\n\n\n\n\n\nHEDDA GABLER.\n\nPLAY IN FOUR ACTS.\n\n\n\nCHARACTERS.\n\n\n  GEORGE TESMAN.*\n  HEDDA TESMAN, his wife.\n  MISS JULIANA TESMAN, his aunt.\n  MRS. ELVSTED.\n  JUDGE** BRACK.\n  EILERT LOVBORG.\n  BERTA, servant at the Tesmans.\n\n  *Tesman, whose Christian name in the original is \"Jorgen,\" is\n  described as \"stipendiat i kulturhistorie\"--that is to say, the\n  holder of a scholarship for purposes of research into the History\n  of Civilisation.\n\n  **In the original \"Assessor.\"\n\n\n  The scene of the action is Tesman's villa, in the west end\n  of Christiania.\n\n\n\n\nACT FIRST.\n\n\n  A spacious, handsome, and tastefully furnished drawing room,\n  decorated in dark colours.  In the back, a wide doorway with\n  curtains drawn back, leading into a smaller room decorated\n  in the same style as the drawing-room.  In the right-hand\n  wall of the front room, a folding door leading out to the\n  hall.  In the opposite wall, on the left, a glass door, also\n  with curtains drawn back.  Through the panes can be seen\n  part of a verandah outside, and trees covered with autumn\n  foliage.  An oval table, with a cover on it, and surrounded\n  by chairs, stands well forward.  In front, by the wall on\n  the right, a wide stove of dark porcelain, a high-backed\n  arm-chair, a cushioned foot-rest, and two footstools.  A\n  settee, with a small round table in front of it, fills the\n  upper right-hand corner.  In front, on the left, a little\n  way from the wall, a sofa.  Further back than the glass\n  door, a piano.  On either side of the doorway at the back\n  a whatnot with terra-cotta and majolica ornaments.--\n  Against the back wall of the inner room a sofa, with a\n  table, and one or two chairs.  Over the sofa hangs the\n  portrait of a handsome elderly man in a General's uniform.\n  Over the table a hanging lamp, with an opal glass shade.--A\n  number of bouquets are arranged about the drawing-room, in\n  vases and glasses.  Others lie upon the tables.  The floors\n  in both rooms are covered with thick carpets.--Morning light.\n  The sun shines in through the glass door.\n\n  MISS JULIANA TESMAN, with her bonnet on a carrying a parasol,\n  comes in from the hall, followed by BERTA, who carries a\n  bouquet wrapped in paper.  MISS TESMAN is a comely and pleasant-\n  looking lady of about sixty-five.  She is nicely but simply\n  dressed in a grey walking-costume.  BERTA is a middle-aged\n  woman of plain and rather countrified appearance.\n\n\nMISS TESMAN.\n\n[Stops close to the door, listens, and says softly:] Upon my word, I\ndon't believe they are stirring yet!\n\n\nBERTA.\n\n[Also softly.] I told you so, Miss. Remember how late the steamboat got\nin last night. And then, when they got home!--good Lord, what a lot the\nyoung mistress had to unpack before she could get to bed.\n\n\nMISS TESMAN.\n\nWell well--let them have their sleep out. But let us see that they get a\ngood breath of the fresh morning air when they do appear.\n\n     [She goes to the glass door and throws it open.\n\n\nBERTA.\n\n[Beside the table, at a loss what to do with the bouquet in her hand.]\nI declare there isn't a bit of room left. I think I'll put it down here,\nMiss. [She places it on the piano.\n\n\nMISS TESMAN.\n\nSo you've got a new mistress now, my dear Berta. Heaven knows it was a\nwrench to me to part with you.\n\n\nBERTA.\n\n[On the point of weeping.] And do you think it wasn't hard for me, too,\nMiss? After all the blessed years I've been with you and Miss Rina.(1)\n\n\nMISS TESMAN.\n\nWe must make the best of it, Berta. There was nothing else to be done.\nGeorge can't do without you, you see-he absolutely can't. He has had you\nto look after him ever since he was a little boy.\n\n\nBERTA.\n\nAh but, Miss Julia, I can't help thinking of Miss Rina lying helpless\nat home there, poor thing. And with only that new girl too! She'll never\nlearn to take proper care of an invalid.\n\n\nMISS TESMAN.\n\nOh, I shall manage to train her. And of course, you know, I shall take\nmost of it upon myself. You needn't be uneasy about my poor sister, my\ndear Berta.\n\n\nBERTA.\n\nWell, but there's another thing, Miss. I'm so mortally afraid I shan't\nbe able to suit the young mistress.\n\n\nMISS TESMAN.\n\nOh well--just at first there may be one or two things--\n\n\nBERTA.\n\nMost like she'll be terrible grand in her ways.\n\n\nMISS TESMAN.\n\nWell, you can't wonder at that--General Gabler's daughter! Think of\nthe sort of life she was accustomed to in her father's time. Don't you\nremember how we used to see her riding down the road along with the\nGeneral? In that long black habit--and with feathers in her hat?\n\n\nBERTA.\n\nYes, indeed--I remember well enough!--But, good Lord, I should never\nhave dreamt in those days that she and Master George would make a match\nof it.\n\n\nMISS TESMAN.\n\nNor I.--But by-the-bye, Berta--while I think of it: in future you\nmustn't say Master George. You must say Dr. Tesman.\n\n\nBERTA.\n\nYes, the young mistress spoke of that too--last night--the moment they\nset foot in the house. Is it true then, Miss?\n\n\nMISS TESMAN.\n\nYes, indeed it is. Only think, Berta--some foreign university has made\nhim a doctor--while he has been abroad, you understand. I hadn't heard a\nword about it, until he told me himself upon the pier.\n\n\nBERTA.\n\nWell well, he's clever enough for anything, he is. But I didn't think\nhe'd have gone in for doctoring people.\n\n\nMISS TESMAN.\n\nNo no, it's not that sort of doctor he is. [Nods significantly.] But\nlet me tell you, we may have to call him something still grander before\nlong.\n\n\nBERTA.\n\nYou don't say so! What can that be, Miss?\n\n\nMISS TESMAN.\n\n[Smiling.] H'm--wouldn't you like to know! [With emotion.] Ah, dear\ndear--if my poor brother could only look up from his grave now, and\nsee what his little boy has grown into! [Looks around.] But bless me,\nBerta--why have you done this? Taken the chintz covers off all the\nfurniture.\n\n\nBERTA.\n\nThe mistress told me to. She can't abide covers on the chairs, she says.\n\n\nMISS TESMAN.\n\nAre they going to make this their everyday sitting-room then?\n\n\nBERTA.\n\nYes, that's what I understood--from the mistress. Master George--the\ndoctor--he said nothing.\n\n\n  GEORGE TESMAN comes from the right into the inner room,\n  humming to himself, and carrying an unstrapped empty\n  portmanteau.  He is a middle-sized, young-looking man of\n  thirty-three, rather stout, with a round, open, cheerful\n  face, fair hair and beard.  He wears spectacles, and is\n  somewhat carelessly dressed in comfortable indoor clothes.\n\n\nMISS TESMAN.\n\nGood morning, good morning, George.\n\n\nTESMAN.\n\n[In the doorway between the rooms.] Aunt Julia! Dear Aunt Julia! [Goes\nup to her and shakes hands warmly.] Come all this way--so early! Eh?\n\n\nMISS TESMAN.\n\nWhy, of course I had to come and see how you were getting on.\n\n\nTESMAN.\n\nIn spite of your having had no proper night's rest?\n\n\nMISS TESMAN.\n\nOh, that makes no difference to me.\n\n\nTESMAN.\n\nWell, I suppose you got home all right from the pier? Eh?\n\n\nMISS TESMAN.\n\nYes, quite safely, thank goodness. Judge Brack was good enough to see me\nright to my door.\n\n\nTESMAN.\n\nWe were so sorry we couldn't give you a seat in the carriage. But you\nsaw what a pile of boxes Hedda had to bring with her.\n\n\nMISS TESMAN.\n\nYes, she had certainly plenty of boxes.\n\n\nBERTA.\n\n[To TESMAN.] Shall I go in and see if there's anything I can do for the\nmistress?\n\n\nTESMAN.\n\nNo thank you, Berta--you needn't. She said she would ring if she wanted\nanything.\n\n\nBERTA.\n\n[Going towards the right.] Very well.\n\n\nTESMAN.\n\nBut look here--take this portmanteau with you.\n\n\nBERTA.\n\n[Taking it.] I'll put it in the attic.\n\n     [She goes out by the hall door.\n\n\nTESMAN.\n\nFancy, Auntie--I had the whole of that portmanteau chock full of copies\nof the documents. You wouldn't believe how much I have picked up from\nall the archives I have been examining--curious old details that no one\nhas had any idea of--\n\n\nMISS TESMAN.\n\nYes, you don't seem to have wasted your time on your wedding trip,\nGeorge.\n\n\nTESMAN.\n\nNo, that I haven't. But do take off your bonnet, Auntie. Look here! Let\nme untie the strings--eh?\n\n\nMISS TESMAN.\n\n[While he does so.] Well well--this is just as if you were still at home\nwith us.\n\n\nTESMAN.\n\n[With the bonnet in his hand, looks at it from all sides.] Why, what a\ngorgeous bonnet you've been investing in!\n\n\nMISS TESMAN.\n\nI bought it on Hedda's account.\n\n\nTESMAN.\n\nOn Hedda's account? Eh?\n\n\nMISS TESMAN.\n\nYes, so that Hedda needn't be ashamed of me if we happened to go out\ntogether.\n\n\nTESMAN.\n\n[Patting her cheek.] You always think of everything, Aunt Julia. [Lays\nthe bonnet on a chair beside the table.] And now, look here--suppose we\nsit comfortably on the sofa and have a little chat, till Hedda comes.\n\n     [They seat themselves.  She places her parasol in the corner\n       of the sofa.\n\n\nMISS TESMAN.\n\n[Takes both his hands and looks at him.] What a delight it is to have\nyou again, as large as life, before my very eyes, George! My George--my\npoor brother's own boy!\n\n\nTESMAN.\n\nAnd it's a delight for me, too, to see you again, Aunt Julia! You, who\nhave been father and mother in one to me.\n\n\nMISS TESMAN.\n\nOh yes, I know you will always keep a place in your heart for your old\naunts.\n\n\nTESMAN.\n\nAnd what about Aunt Rina? No improvement--eh?\n\n\nMISS TESMAN.\n\nOh, no--we can scarcely look for any improvement in her case, poor\nthing. There she lies, helpless, as she has lain for all these years.\nBut heaven grant I may not lose her yet awhile! For if I did, I don't\nknow what I should make of my life, George--especially now that I\nhaven't you to look after any more.\n\n\nTESMAN.\n\n[Patting her back.] There there there--!\n\n\nMISS TESMAN.\n\n[Suddenly changing her tone.] And to think that here are you a married\nman, George!--And that you should be the one to carry off Hedda Gabler\n--the beautiful Hedda Gabler! Only think of it--she, that was so beset\nwith admirers!\n\n\nTESMAN.\n\n[Hums a little and smiles complacently.] Yes, I fancy I have several\ngood friends about town who would like to stand in my shoes--eh?\n\n\nMISS TESMAN.\n\nAnd then this fine long wedding-tour you have had! More than five--\nnearly six months--\n\n\nTESMAN.\n\nWell, for me it has been a sort of tour of research as well. I have had\nto do so much grubbing among old records--and to read no end of books\ntoo, Auntie.\n\n\nMISS TESMAN.\n\nOh yes, I suppose so. [More confidentially, and lowering her voice a\nlittle.] But listen now, George,--have you nothing--nothing special to\ntell me?\n\n\nTESMAN.\n\nAs to our journey?\n\n\nMISS TESMAN.\n\nYes.\n\n\nTESMAN.\n\nNo, I don't know of anything except what I have told you in my letters.\nI had a doctor's degree conferred on me--but that I told you yesterday.\n\n\nMISS TESMAN.\n\nYes, yes, you did. But what I mean is--haven't you any--any--\nexpectations--?\n\n\nTESMAN.\n\nExpectations?\n\n\nMISS TESMAN.\n\nWhy you know, George--I'm your old auntie!\n\n\nTESMAN.\n\nWhy, of course I have expectations.\n\n\nMISS TESMAN.\n\nAh!\n\n\nTESMAN.\n\nI have every expectation of being a professor one of these days.\n\n\nMISS TESMAN.\n\nOh yes, a professor--\n\n\nTESMAN.\n\nIndeed, I may say I am certain of it. But my dear Auntie--you know all\nabout that already!\n\n\nMISS TESMAN.\n\n[Laughing to herself.] Yes, of course I do. You are quite right there.\n[Changing the subject.] But we were talking about your journey. It must\nhave cost a great deal of money, George?\n\n\nTESMAN.\n\nWell, you see--my handsome travelling-scholarship went a good way.\n\n\nMISS TESMAN.\n\nBut I can't understand how you can have made it go far enough for two.\n\n\nTESMAN.\n\nNo, that's not easy to understand--eh?\n\n\nMISS TESMAN.\n\nAnd especially travelling with a lady--they tell me that makes it ever\nso much more expensive.\n\n\nTESMAN.\n\nYes, of course--it makes it a little more expensive. But Hedda had to\nhave this trip, Auntie! She really had to. Nothing else would have done.\n\n\nMISS TESMAN.\n\nNo no, I suppose not. A wedding-tour seems to be quite indispensable\nnowadays.--But tell me now--have you gone thoroughly over the house yet?\n\n\nTESMAN.\n\nYes, you may be sure I have. I have been afoot ever since daylight.\n\n\nMISS TESMAN.\n\nAnd what do you think of it all?\n\n\nTESMAN.\n\nI'm delighted! Quite delighted! Only I can't think what we are to do\nwith the two empty rooms between this inner parlour and Hedda's bedroom.\n\n\nMISS TESMAN.\n\n[Laughing.] Oh my dear George, I daresay you may find some use for\nthem--in the course of time.\n\n\nTESMAN.\n\nWhy of course you are quite right, Aunt Julia! You mean as my library\nincreases--eh?\n\n\nMISS TESMAN.\n\nYes, quite so, my dear boy. It was your library I was thinking of.\n\n\nTESMAN.\n\nI am specially pleased on Hedda's account. Often and often, before we\nwere engaged, she said that she would never care to live anywhere but in\nSecretary Falk's villa.(2)\n\n\nMISS TESMAN.\n\nYes, it was lucky that this very house should come into the market, just\nafter you had started.\n\n\nTESMAN.\n\nYes, Aunt Julia, the luck was on our side, wasn't it--eh?\n\n\nMISS TESMAN.\n\nBut the expense, my dear George! You will find it very expensive, all\nthis.\n\n\nTESMAN.\n\n[Looks at her, a little cast down.] Yes, I suppose I shall, Aunt!\n\n\nMISS TESMAN.\n\nOh, frightfully!\n\n\nTESMAN.\n\nHow much do you think? In round numbers?--Eh?\n\n\nMISS TESMAN.\n\nOh, I can't even guess until all the accounts come in.\n\n\nTESMAN.\n\nWell, fortunately, Judge Brack has secured the most favourable terms for\nme, so he said in a letter to Hedda.\n\n\nMISS TESMAN.\n\nYes, don't be uneasy, my dear boy.--Besides, I have given security for\nthe furniture and all the carpets.\n\n\nTESMAN.\n\nSecurity? You? My dear Aunt Julia--what sort of security could you give?\n\n\nMISS TESMAN.\n\nI have given a mortgage on our annuity.\n\n\nTESMAN.\n\n[Jumps up.] What! On your--and Aunt Rina's annuity!\n\n\nMISS TESMAN.\n\nYes, I knew of no other plan, you see.\n\n\nTESMAN.\n\n[Placing himself before her.] Have you gone out of your senses, Auntie?\nYour annuity--it's all that you and Aunt Rina have to live upon.\n\n\nMISS TESMAN.\n\nWell well--don't get so excited about it. It's only a matter of form you\nknow--Judge Brack assured me of that. It was he that was kind enough to\narrange the whole affair for me. A mere matter of form, he said.\n\n\nTESMAN.\n\nYes, that may be all very well. But nevertheless--\n\n\nMISS TESMAN.\n\nYou will have your own salary to depend upon now. And, good heavens,\neven if we did have to pay up a little--! To eke things out a bit at\nthe start--! Why, it would be nothing but a pleasure to us.\n\n\nTESMAN.\n\nOh Auntie--will you never be tired of making sacrifices for me!\n\n\nMISS TESMAN.\n\n[Rises and lays her hand on his shoulders.] Have I any other happiness\nin this world except to smooth your way for you, my dear boy. You, who\nhave had neither father nor mother to depend on. And now we have reached\nthe goal, George! Things have looked black enough for us, sometimes;\nbut, thank heaven, now you have nothing to fear.\n\n\nTESMAN.\n\nYes, it is really marvellous how every thing has turned out for the\nbest.\n\n\nMISS TESMAN.\n\nAnd the people who opposed you--who wanted to bar the way for you--\nnow you have them at your feet. They have fallen, George. Your most\ndangerous rival--his fall was the worst.--And now he has to lie on the\nbed he has made for himself--poor misguided creature.\n\n\nTESMAN.\n\nHave you heard anything of Eilert? Since I went away, I mean.\n\n\nMISS TESMAN.\n\nOnly that he is said to have published a new book.\n\n\nTESMAN.\n\nWhat! Eilert Lovborg! Recently--eh?\n\n\nMISS TESMAN.\n\nYes, so they say. Heaven knows whether it can be worth anything! Ah,\nwhen your new book appears--that will be another story, George! What is\nit to be about?\n\n\nTESMAN.\n\nIt will deal with the domestic industries of Brabant during the Middle\nAges.\n\n\nMISS TESMAN.\n\nFancy--to be able to write on such a subject as that!\n\n\nTESMAN.\n\nHowever, it may be some time before the book is ready. I have all these\ncollections to arrange first, you see.\n\n\nMISS TESMAN.\n\nYes, collecting and arranging--no one can beat you at that. There you\nare my poor brother's own son.\n\n\nTESMAN.\n\nI am looking forward eagerly to setting to work at it; especially now\nthat I have my own delightful home to work in.\n\n\nMISS TESMAN.\n\nAnd, most of all, now that you have got the wife of your heart, my dear\nGeorge.\n\n\nTESMAN.\n\n[Embracing her.] Oh yes, yes, Aunt Julia! Hedda--she is the best part of\nit all! I believe I hear her coming--eh?\n\n\n  HEDDA enters from the left through the inner room.  Her face\n  and figure show refinement and distinction.  Her complexion\n  is pale and opaque.  Her steel-grey eyes express a cold,\n  unruffled repose.  Her hair is of an agreeable brown, but\n  not particularly abundant.  She is dressed in a tasteful,\n  somewhat loose-fitting morning gown.\n\n\nMISS TESMAN.\n\n[Going to meet HEDDA.] Good morning, my dear Hedda! Good morning, and a\nhearty welcome!\n\n\nHEDDA.\n\n[Holds out her hand.] Good morning, dear Miss Tesman! So early a call!\nThat is kind of you.\n\n\nMISS TESMAN.\n\n[With some embarrassment.] Well--has the bride slept well in her new\nhome?\n\n\nHEDDA.\n\nOh yes, thanks. Passably.\n\n\nTESMAN.\n\n[Laughing.] Passably! Come, that's good, Hedda! You were sleeping like a\nstone when I got up.\n\n\nHEDDA.\n\nFortunately. Of course one has always to accustom one's self to new\nsurroundings, Miss Tesman--little by little. [Looking towards the left.]\nOh, there the servant has gone and opened the veranda door, and let in a\nwhole flood of sunshine.\n\n\nMISS TESMAN.\n\n[Going towards the door.] Well, then we will shut it.\n\n\nHEDDA.\n\nNo no, not that! Tesman, please draw the curtains. That will give a\nsofter light.\n\n\nTESMAN.\n\n[At the door.] All right--all right.--There now, Hedda, now you have\nboth shade and fresh air.\n\n\nHEDDA.\n\nYes, fresh air we certainly must have, with all these stacks of\nflowers--. But--won't you sit down, Miss Tesman?\n\n\nMISS TESMAN.\n\nNo, thank you. Now that I have seen that everything is all right\nhere--thank heaven!--I must be getting home again. My sister is lying\nlonging for me, poor thing.\n\n\nTESMAN.\n\nGive her my very best love, Auntie; and say I shall look in and see her\nlater in the day.\n\n\nMISS TESMAN.\n\nYes, yes, I'll be sure to tell her. But by-the-bye, George--[Feeling\nin her dress pocket]--I had almost forgotten--I have something for you\nhere.\n\n\nTESMAN.\n\nWhat is it, Auntie? Eh?\n\n\nMISS TESMAN.\n\n[Produces a flat parcel wrapped in newspaper and hands it to him.] Look\nhere, my dear boy.\n\n\nTESMAN.\n\n[Opening the parcel.] Well, I declare!--Have you really saved\nthem for me, Aunt Julia! Hedda! isn't this touching--eh?\n\n\nHEDDA.\n\n[Beside the whatnot on the right.] Well, what is it?\n\n\nTESMAN.\n\nMy old morning-shoes! My slippers.\n\n\nHEDDA.\n\nIndeed. I remember you often spoke of them while we were abroad.\n\n\nTESMAN.\n\nYes, I missed them terribly. [Goes up to her.] Now you shall see them,\nHedda!\n\n\nHEDDA.\n\n[Going towards the stove.] Thanks, I really don't care about it.\n\n\nTESMAN.\n\n[Following her.] Only think--ill as she was, Aunt Rina embroidered these\nfor me. Oh you can't think how many associations cling to them.\n\n\nHEDDA.\n\n[At the table.] Scarcely for me.\n\n\nMISS TESMAN.\n\nOf course not for Hedda, George.\n\nTESMAN.\n\nWell, but now that she belongs to the family, I thought--\n\n\nHEDDA.\n\n[Interrupting.] We shall never get on with this servant, Tesman.\n\n\nMISS TESMAN.\n\nNot get on with Berta?\n\n\nTESMAN.\n\nWhy, dear, what puts that in your head? Eh?\n\n\nHEDDA.\n\n[Pointing.] Look there! She has left her old bonnet lying about on a\nchair.\n\nTESMAN.\n\n[In consternation, drops the slippers on the floor.] Why, Hedda--\n\n\nHEDDA.\n\nJust fancy, if any one should come in and see it!\n\n\nTESMAN.\n\nBut Hedda--that's Aunt Julia's bonnet.\n\n\nHEDDA.\n\nIs it!\n\n\nMISS TESMAN.\n\n[Taking up the bonnet.] Yes, indeed it's mine. And, what's more, it's\nnot old, Madam Hedda.\n\n\nHEDDA.\n\nI really did not look closely at it, Miss Tesman.\n\n\nMISS TESMAN.\n\n[Trying on the bonnet.] Let me tell you it's the first time I have worn\nit--the very first time.\n\n\nTESMAN.\n\nAnd a very nice bonnet it is too--quite a beauty!\n\n\nMISS TESMAN.\n\nOh, it's no such great things, George. [Looks around her.] My\nparasol--? Ah, here. [Takes it.] For this is mine too-- [mutters] --not\nBerta's.\n\n\nTESMAN.\n\nA new bonnet and a new parasol! Only think, Hedda.\n\n\nHEDDA.\n\nVery handsome indeed.\n\n\nTESMAN.\n\nYes, isn't it? Eh? But Auntie, take a good look at Hedda before you go!\nSee how handsome she is!\n\n\nMISS TESMAN.\n\nOh, my dear boy, there's nothing new in that. Hedda was always lovely.\n\n     [She nods and goes toward the right.\n\n\nTESMAN.\n\n[Following.] Yes, but have you noticed what splendid condition she is\nin? How she has filled out on the journey?\n\n\nHEDDA.\n\n[Crossing the room.] Oh, do be quiet--!\n\n\nMISS TESMAN.\n\n[Who has stopped and turned.] Filled out?\n\n\nTESMAN.\n\nOf course you don't notice it so much now that she has that dress on.\nBut I, who can see--\n\n\nHEDDA.\n\n[At the glass door, impatiently.] Oh, you can't see anything.\n\n\nTESMAN.\n\nIt must be the mountain air in the Tyrol--\n\n\nHEDDA.\n\n[Curtly, interrupting.] I am exactly as I was when I started.\n\n\nTESMAN.\n\nSo you insist; but I'm quite certain you are not. Don't you agree with\nme, Auntie?\n\n\nMISS TESMAN.\n\n[Who has been gazing at her with folded hands.] Hedda is lovely--\nlovely--lovely. [Goes up to her, takes her head between both hands,\ndraws it downwards, and kisses her hair.] God bless and preserve Hedda\nTesman--for George's sake.\n\n\nHEDDA.\n\n[Gently freeing herself.] Oh--! Let me go.\n\n\nMISS TESMAN.\n\n[In quiet emotion.] I shall not let a day pass without coming to see\nyou.\n\n\nTESMAN.\n\nNo you won't, will you, Auntie? Eh?\n\n\nMISS TESMAN.\n\nGood-bye--good-bye!\n\n     [She goes out by the hall door.  TESMAN accompanies her.  The\n       door remains half open.  TESMAN can be heard repeating his\n       message to Aunt Rina and his thanks for the slippers.\n\n     [In the meantime, HEDDA walks about the room, raising her arms\n       and clenching her hands as if in desperation.  Then she flings\n       back the curtains from the glass door, and stands there looking\n       out.\n\n     [Presently, TESMAN returns and closes the door behind him.\n\n\nTESMAN.\n\n[Picks up the slippers from the floor.] What are you looking at, Hedda?\n\n\nHEDDA.\n\n[Once more calm and mistress of herself.] I am only looking at the\nleaves. They are so yellow--so withered.\n\n\nTESMAN.\n\n[Wraps up the slippers and lays them on the table.] Well, you see, we\nare well into September now.\n\n\nHEDDA.\n\n[Again restless.] Yes, to think of it!--already in--in September.\n\n\nTESMAN.\n\nDon't you think Aunt Julia's manner was strange, dear? Almost solemn?\nCan you imagine what was the matter with her? Eh?\n\n\nHEDDA.\n\nI scarcely know her, you see. Is she not often like that?\n\n\nTESMAN.\n\nNo, not as she was to-day.\n\n\nHEDDA.\n\n[Leaving the glass door.] Do you think she was annoyed about the bonnet?\n\n\nTESMAN.\n\nOh, scarcely at all. Perhaps a little, just at the moment--\n\n\nHEDDA.\n\nBut what an idea, to pitch her bonnet about in the drawing-room! No one\ndoes that sort of thing.\n\n\nTESMAN.\n\nWell you may be sure Aunt Julia won't do it again.\n\n\nHEDDA.\n\nIn any case, I shall manage to make my peace with her.\n\n\nTESMAN.\n\nYes, my dear, good Hedda, if you only would.\n\n\nHEDDA.\n\nWhen you call this afternoon, you might invite her to spend the evening\nhere.\n\n\nTESMAN.\n\nYes, that I will. And there's one thing more you could do that would\ndelight her heart.\n\n\nHEDDA.\n\nWhat is it?\n\n\nTESMAN.\n\nIf you could only prevail on yourself to say _du_(3) to her. For my\nsake, Hedda? Eh?\n\n\nHEDDA.\n\nNo, no, Tesman--you really mustn't ask that of me. I have told you so\nalready. I shall try to call her \"Aunt\"; and you must be satisfied with\nthat.\n\n\nTESMAN.\n\nWell well. Only I think now that you belong to the family, you--\n\n\nHEDDA.\n\nH'm--I can't in the least see why--\n\n     [She goes up towards the middle doorway.\n\n\nTESMAN.\n\n[After a pause.] Is there anything the matter with you, Hedda? Eh?\n\n\nHEDDA.\n\nI'm only looking at my old piano. It doesn't go at all well with all the\nother things.\n\n\nTESMAN.\n\nThe first time I draw my salary, we'll see about exchanging it.\n\n\nHEDDA.\n\nNo, no--no exchanging. I don't want to part with it. Suppose we put it\nthere in the inner room, and then get another here in its place. When\nit's convenient, I mean.\n\n\nTESMAN.\n\n[A little taken aback.] Yes--of course we could do that.\n\n\nHEDDA.\n\n[Takes up the bouquet from the piano.] These flowers were not here last\nnight when we arrived.\n\n\nTESMAN.\n\nAunt Julia must have brought them for you.\n\n\nHEDDA.\n\n[Examining the bouquet.] A visiting-card. [Takes it out and reads:]\n\"Shall return later in the day.\" Can you guess whose card it is?\n\n\nTESMAN.\n\nNo. Whose? Eh?\n\n\nHEDDA.\n\nThe name is \"Mrs. Elvsted.\"\n\n\nTESMAN.\n\nIs it really? Sheriff Elvsted's wife? Miss Rysing that was.\n\n\nHEDDA.\n\nExactly. The girl with the irritating hair, that she was always showing\noff. An old flame of yours I've been told.\n\n\nTESMAN.\n\n[Laughing.] Oh, that didn't last long; and it was before I met you,\nHedda. But fancy her being in town!\n\n\nHEDDA.\n\nIt's odd that she should call upon us. I have scarcely seen her since we\nleft school.\n\n\nTESMAN.\n\nI haven't see her either for--heaven knows how long. I wonder how she\ncan endure to live in such an out-of-the way hole--eh?\n\n\nHEDDA.\n\n[After a moment's thought, says suddenly.] Tell me, Tesman--isn't it\nsomewhere near there that he--that--Eilert Lovborg is living?\n\n\nTESMAN.\n\nYes, he is somewhere in that part of the country.\n\n\n  BERTA enters by the hall door.\n\n\nBERTA.\n\nThat lady, ma'am, that brought some flowers a little while ago, is here\nagain. [Pointing.] The flowers you have in your hand, ma'am.\n\n\nHEDDA.\n\nAh, is she? Well, please show her in.\n\n\n  BERTA opens the door for MRS. ELVSTED, and goes out herself.\n  --MRS. ELVSTED is a woman of fragile figure, with pretty,\n  soft features.  Her eyes are light blue, large, round, and\n  somewhat prominent, with a startled, inquiring expression.\n  Her hair is remarkably light, almost flaxen, and unusually\n  abundant and wavy.  She is a couple of years younger than\n  HEDDA.  She wears a dark visiting dress, tasteful, but not\n  quite in the latest fashion.\n\n\nHEDDA.\n\n[Receives her warmly.] How do you do, my dear Mrs. Elvsted? It's\ndelightful to see you again.\n\n\nMRS. ELVSTED.\n\n[Nervously, struggling for self-control.] Yes, it's a very long time\nsince we met.\n\n\nTESMAN.\n\n[Gives her his hand.] And we too--eh?\n\n\nHEDDA.\n\nThanks for your lovely flowers--\n\n\nMRS. ELVSTED.\n\nOh, not at all--. I would have come straight here yesterday afternoon;\nbut I heard that you were away--\n\n\nTESMAN.\n\nHave you just come to town? Eh?\n\n\nMRS. ELVSTED.\n\nI arrived yesterday, about midday. Oh, I was quite in despair when I\nheard that you were not at home.\n\n\nHEDDA.\n\nIn despair! How so?\n\n\nTESMAN.\n\nWhy, my dear Mrs. Rysing--I mean Mrs. Elvsted--\n\n\nHEDDA.\n\nI hope that you are not in any trouble?\n\n\nMRS. ELVSTED.\n\nYes, I am. And I don't know another living creature here that I can turn\nto.\n\n\nHEDDA.\n\n[Laying the bouquet on the table.] Come--let us sit here on the sofa--\n\n\nMRS. ELVSTED.\n\nOh, I am too restless to sit down.\n\n\nHEDDA.\n\nOh no, you're not. Come here.\n\n     [She draws MRS. ELVSTED down upon the sofa and sits at her side.\n\n\nTESMAN.\n\nWell? What is it, Mrs. Elvsted--?\n\n\nHEDDA.\n\nHas anything particular happened to you at home?\n\n\nMRS. ELVSTED.\n\nYes--and no. Oh--I am so anxious you should not misunderstand me--\n\n\nHEDDA.\n\nThen your best plan is to tell us the whole story, Mrs. Elvsted.\n\n\nTESMAN.\n\nI suppose that's what you have come for--eh?\n\n\nMRS. ELVSTED.\n\nYes, yes--of course it is. Well then, I must tell you--if you don't\nalready know--that Eilert Lovborg is in town, too.\n\n\nHEDDA.\n\nLovborg--!\n\n\nTESMAN.\n\nWhat! Has Eilert Lovborg come back? Fancy that, Hedda!\n\n\nHEDDA.\n\nWell well--I hear it.\n\n\nMRS. ELVSTED.\n\nHe has been here a week already. Just fancy--a whole week! In this\nterrible town, alone! With so many temptations on all sides.\n\n\nHEDDA.\n\nBut, my dear Mrs. Elvsted--how does he concern you so much?\n\n\nMRS. ELVSTED.\n\n[Looks at her with a startled air, and says rapidly.] He was the\nchildren's tutor.\n\n\nHEDDA.\n\nYour children's?\n\n\nMRS. ELVSTED.\n\nMy husband's. I have none.\n\n\nHEDDA.\n\nYour step-children's, then?\n\n\nMRS. ELVSTED.\n\nYes.\n\n\nTESMAN.\n\n[Somewhat hesitatingly.] Then was he--I don't know how to express\nit--was he--regular enough in his habits to be fit for the post? Eh?\n\n\nMRS. ELVSTED.\n\nFor the last two years his conduct has been irreproachable.\n\n\nTESMAN.\n\nHas it indeed? Fancy that, Hedda!\n\n\nHEDDA.\n\nI hear it.\n\n\nMRS. ELVSTED.\n\nPerfectly irreproachable, I assure you! In every respect. But all the\nsame--now that I know he is here--in this great town--and with a large\nsum of money in his hands--I can't help being in mortal fear for him.\n\n\nTESMAN.\n\nWhy did he not remain where he was? With you and your husband? Eh?\n\n\nMRS. ELVSTED.\n\nAfter his book was published he was too restless and unsettled to remain\nwith us.\n\n\nTESMAN.\n\nYes, by-the-bye, Aunt Julia told me he had published a new book.\n\n\nMRS. ELVSTED.\n\nYes, a big book, dealing with the march of civilisation--in broad\noutline, as it were. It came out about a fortnight ago. And since it has\nsold so well, and been so much read--and made such a sensation--\n\n\nTESMAN.\n\nHas it indeed? It must be something he has had lying by since his better\ndays.\n\n\nMRS. ELVSTED.\n\nLong ago, you mean?\n\n\nTESMAN.\n\nYes.\n\n\nMRS. ELVSTED.\n\nNo, he has written it all since he has been with us--within the last\nyear.\n\n\nTESMAN.\n\nIsn't that good news, Hedda? Think of that.\n\n\nMRS. ELVSTED.\n\nAh yes, if only it would last!\n\n\nHEDDA.\n\nHave you seen him here in town?\n\n\nMRS. ELVSTED.\n\nNo, not yet. I have had the greatest difficulty in finding out his\naddress. But this morning I discovered it at last.\n\n\nHEDDA.\n\n[Looks searchingly at her.] Do you know, it seems to me a little odd of\nyour husband--h'm--\n\n\nMRS. ELVSTED.\n\n[Starting nervously.] Of my husband! What?\n\n\nHEDDA.\n\nThat he should send you to town on such an errand--that he does not come\nhimself and look after his friend.\n\n\nMRS. ELVSTED.\n\nOh no, no--my husband has no time. And besides, I--I had some shopping\nto do.\n\n\nHEDDA.\n\n[With a slight smile.] Ah, that is a different matter.\n\n\nMRS. ELVSTED.\n\n[Rising quickly and uneasily.] And now I beg and implore you, Mr.\nTesman--receive Eilert Lovborg kindly if he comes to you! And that he\nis sure to do. You see you were such great friends in the old days.\nAnd then you are interested in the same studies--the same branch of\nscience--so far as I can understand.\n\n\nTESMAN.\n\nWe used to be at any rate.\n\n\nMRS. ELVSTED.\n\nThat is why I beg so earnestly that you--you too--will keep a sharp eye\nupon him. Oh, you will promise me that, Mr. Tesman--won't you?\n\n\nTESMAN.\n\nWith the greatest of pleasure, Mrs. Rysing--\n\n\nHEDDA.\n\nElvsted.\n\n\nTESMAN.\n\nI assure you I shall do all I possibly can for Eilert. You may rely upon\nme.\n\n\nMRS. ELVSTED.\n\nOh, how very, very kind of you! [Presses his hands.] Thanks, thanks,\nthanks! [Frightened.] You see, my husband is so very fond of him!\n\n\nHEDDA.\n\n[Rising.] You ought to write to him, Tesman. Perhaps he may not care to\ncome to you of his own accord.\n\n\nTESMAN.\n\nWell, perhaps it would be the right thing to do, Hedda? Eh?\n\n\nHEDDA.\n\nAnd the sooner the better. Why not at once?\n\n\nMRS. ELVSTED.\n\n[Imploringly.] Oh, if you only would!\n\n\nTESMAN.\n\nI'll write this moment. Have you his address, Mrs.--Mrs. Elvsted.\n\n\nMRS. ELVSTED.\n\nYes. [Takes a slip of paper from her pocket, and hands it to him.] Here\nit is.\n\n\nTESMAN.\n\nGood, good. Then I'll go in-- [Looks about him.] By-the-bye,--my\nslippers? Oh, here. [Takes the packet and is about to go.\n\n\nHEDDA.\n\nBe sure you write him a cordial, friendly letter. And a good long one\ntoo.\n\n\nTESMAN.\n\nYes, I will.\n\n\nMRS. ELVSTED.\n\nBut please, please don't say a word to show that I have suggested it.\n\n\nTESMAN.\n\nNo, how could you think I would? Eh?\n\n     [He goes out to the right, through the inner room.\n\n\nHEDDA.\n\n[Goes up to MRS. ELVSTED, smiles, and says in a low voice.] There! We\nhave killed two birds with one stone.\n\n\nMRS. ELVSTED.\n\nWhat do you mean?\n\n\nHEDDA.\n\nCould you not see that I wanted him to go?\n\n\nMRS. ELVSTED.\n\nYes, to write the letter--\n\n\nHEDDA.\n\nAnd that I might speak to you alone.\n\n\nMRS. ELVSTED.\n\n[Confused.] About the same thing?\n\n\nHEDDA.\n\nPrecisely.\n\n\nMRS. ELVSTED.\n\n[Apprehensively.] But there is nothing more, Mrs. Tesman! Absolutely\nnothing!\n\n\nHEDDA.\n\nOh yes, but there is. There is a great deal more--I can see that. Sit\nhere--and we'll have a cosy, confidential chat.\n\n   [She forces MRS. ELVSTED to sit in the easy-chair beside the\n       stove, and seats herself on one of the footstools.\n\n\nMRS. ELVSTED.\n\n[Anxiously, looking at her watch.] But, my dear Mrs. Tesman--I was\nreally on the point of going.\n\n\nHEDDA.\n\nOh, you can't be in such a hurry.--Well? Now tell me something about\nyour life at home.\n\n\nMRS. ELVSTED.\n\nOh, that is just what I care least to speak about.\n\n\nHEDDA.\n\nBut to me, dear--? Why, weren't we schoolfellows?\n\n\nMRS. ELVSTED.\n\nYes, but you were in the class above me. Oh, how dreadfully afraid of\nyou I was then!\n\n\nHEDDA.\n\nAfraid of me?\n\n\nMRS. ELVSTED.\n\nYes, dreadfully. For when we met on the stairs you used always to pull\nmy hair.\n\n\nHEDDA.\n\nDid I, really?\n\n\nMRS. ELVSTED.\n\nYes, and once you said you would burn it off my head.\n\n\nHEDDA.\n\nOh that was all nonsense, of course.\n\n\nMRS. ELVSTED.\n\nYes, but I was so silly in those days.--And since then, too--we have\ndrifted so far--far apart from each other. Our circles have been so\nentirely different.\n\n\nHEDDA.\n\nWell then, we must try to drift together again. Now listen. At school\nwe said _du_(4) to each other; and we called each other by our Christian\nnames--\n\n\nMRS. ELVSTED.\n\nNo, I am sure you must be mistaken.\n\n\nHEDDA.\n\nNo, not at all! I can remember quite distinctly. So now we are going to\nrenew our old friendship. [Draws the footstool closer to MRS. ELVSTED.]\nThere now! [Kisses her cheek.] You must say _du_ to me and call me\nHedda.\n\n\nMRS. ELVSTED.\n\n[Presses and pats her hands.] Oh, how good and kind you are! I am not\nused to such kindness.\n\n\nHEDDA.\n\nThere, there, there! And I shall say _du_ to you, as in the old days,\nand call you my dear Thora.\n\n\nMRS. ELVSTED.\n\nMy name is Thea.(5)\n\n\nHEDDA.\n\nWhy, of course! I meant Thea. [Looks at her compassionately.] So you are\nnot accustomed to goodness and kindness, Thea? Not in your own home?\n\n\nMRS. ELVSTED.\n\nOh, if I only had a home! But I haven't any; I have never had a home.\n\n\nHEDDA.\n\n[Looks at her for a moment.] I almost suspected as much.\n\n\nMRS. ELVSTED.\n\n[Gazing helplessly before her.] Yes--yes--yes.\n\n\nHEDDA.\n\nI don't quite remember--was it not as housekeeper that you first went to\nMr. Elvsted's?\n\n\nMRS. ELVSTED.\n\nI really went as governess. But his wife--his late wife--was an\ninvalid,--and rarely left her room. So I had to look after the\nhousekeeping as well.\n\n\nHEDDA.\n\nAnd then--at last--you became mistress of the house.\n\n\nMRS. ELVSTED.\n\n[Sadly.] Yes, I did.\n\n\nHEDDA.\n\nLet me see--about how long ago was that?\n\n\nMRS. ELVSTED.\n\nMy marriage?\n\n\nHEDDA.\n\nYes.\n\n\nMRS. ELVSTED.\n\nFive years ago.\n\n\nHEDDA.\n\nTo be sure; it must be that.\n\n\nMRS. ELVSTED.\n\nOh those five years--! Or at all events the last two or three of them!\nOh, if you(6) could only imagine--\n\n\nHEDDA.\n\n[Giving her a little slap on the hand.] De? Fie, Thea!\n\n\nMRS. ELVSTED.\n\nYes, yes, I will try--. Well, if--you could only imagine and\nunderstand--\n\n\nHEDDA.\n\n[Lightly.] Eilert Lovborg has been in your neighbourhood about three\nyears, hasn't he?\n\n\nMRS. ELVSTED.\n\n[Looks at here doubtfully.] Eilert Lovborg? Yes--he has.\n\n\nHEDDA.\n\nHad you known him before, in town here?\n\n\nMRS. ELVSTED.\n\nScarcely at all. I mean--I knew him by name of course.\n\n\nHEDDA.\n\nBut you saw a good deal of him in the country?\n\n\nMRS. ELVSTED.\n\nYes, he came to us every day. You see, he gave the children lessons; for\nin the long run I couldn't manage it all myself.\n\n\nHEDDA.\n\nNo, that's clear.--And your husband--? I suppose he is often away from\nhome?\n\n\nMRS. ELVSTED.\n\nYes. Being sheriff, you know, he has to travel about a good deal in his\ndistrict.\n\n\nHEDDA.\n\n[Leaning against the arm of the chair.] Thea--my poor, sweet Thea--now\nyou must tell me everything--exactly as it stands.\n\n\nMRS. ELVSTED.\n\nWell, then you must question me.\n\n\nHEDDA.\n\nWhat sort of a man is your husband, Thea? I mean--you know--in everyday\nlife. Is he kind to you?\n\n\nMRS. ELVSTED.\n\n[Evasively.] I am sure he means well in everything.\n\n\nHEDDA.\n\nI should think he must be altogether too old for you. There is at least\ntwenty years' difference between you, is there not?\n\n\nMRS. ELVSTED.\n\n[Irritably.] Yes, that is true, too. Everything about him is repellent\nto me! We have not a thought in common. We have no single point of\nsympathy--he and I.\n\n\nHEDDA.\n\nBut is he not fond of you all the same? In his own way?\n\n\nMRS. ELVSTED.\n\nOh I really don't know. I think he regards me simply as a useful\nproperty. And then it doesn't cost much to keep me. I am not expensive.\n\n\nHEDDA.\n\nThat is stupid of you.\n\n\nMRS. ELVSTED.\n\n[Shakes her head.] It cannot be otherwise--not with him. I don't think\nhe really cares for any one but himself--and perhaps a little for the\nchildren.\n\n\nHEDDA.\n\nAnd for Eilert Lovborg, Thea?\n\n\nMRS. ELVSTED.\n\n[Looking at her.] For Eilert Lovborg? What puts that into your head?\n\n\nHEDDA.\n\nWell, my dear--I should say, when he sends you after him all the way\nto town-- [Smiling almost imperceptibly.] And besides, you said so\nyourself, to Tesman.\n\n\nMRS. ELVSTED.\n\n[With a little nervous twitch.] Did I? Yes, I suppose I did.\n[Vehemently, but not loudly.] No--I may just as well make a clean breast\nof it at once! For it must all come out in any case.\n\n\nHEDDA.\n\nWhy, my dear Thea--?\n\n\nMRS. ELVSTED.\n\nWell, to make a long story short: My husband did not know that I was\ncoming.\n\n\nHEDDA.\n\nWhat! Your husband didn't know it!\n\n\nMRS. ELVSTED.\n\nNo, of course not. For that matter, he was away from home himself--\nhe was travelling. Oh, I could bear it no longer, Hedda! I couldn't\nindeed--so utterly alone as I should have been in future.\n\n\nHEDDA.\n\nWell? And then?\n\n\nMRS. ELVSTED.\n\nSo I put together some of my things--what I needed most--as quietly as\npossible. And then I left the house.\n\n\nHEDDA.\n\nWithout a word?\n\n\nMRS. ELVSTED.\n\nYes--and took the train to town.\n\n\nHEDDA.\n\nWhy, my dear, good Thea--to think of you daring to do it!\n\n\nMRS. ELVSTED.\n\n[Rises and moves about the room.] What else could I possibly do?\n\n\nHEDDA.\n\nBut what do you think your husband will say when you go home again?\n\n\nMRS. ELVSTED.\n\n[At the table, looks at her.] Back to him?\n\n\nHEDDA.\n\nOf course.\n\n\nMRS. ELVSTED.\n\nI shall never go back to him again.\n\n\nHEDDA.\n\n[Rising and going towards her.] Then you have left your home--for good\nand all?\n\n\nMRS. ELVSTED.\n\nYes. There was nothing else to be done.\n\n\nHEDDA.\n\nBut then--to take flight so openly.\n\n\nMRS. ELVSTED.\n\nOh, it's impossible to keep things of that sort secret.\n\n\nHEDDA.\n\nBut what do you think people will say of you, Thea?\n\n\nMRS. ELVSTED.\n\nThey may say what they like, for aught _I_ care. [Seats herself wearily\nand sadly on the sofa.] I have done nothing but what I had to do.\n\n\nHEDDA.\n\n[After a short silence.] And what are your plans now? What do you think\nof doing.\n\n\nMRS. ELVSTED.\n\nI don't know yet. I only know this, that I must live here, where Eilert\nLovborg is--if I am to live at all.\n\n\nHEDDA.\n\n[Takes a chair from the table, seats herself beside her, and strokes\nher hands.] My dear Thea--how did this--this friendship--between you and\nEilert Lovborg come about?\n\n\nMRS. ELVSTED.\n\nOh it grew up gradually. I gained a sort of influence over him.\n\n\nHEDDA.\n\nIndeed?\n\n\nMRS. ELVSTED.\n\nHe gave up his old habits. Not because I asked him to, for I never dared\ndo that. But of course he saw how repulsive they were to me; and so he\ndropped them.\n\n\nHEDDA.\n\n[Concealing an involuntary smile of scorn.] Then you have reclaimed\nhim--as the saying goes--my little Thea.\n\n\nMRS. ELVSTED.\n\nSo he says himself, at any rate. And he, on his side, has made a real\nhuman being of me--taught me to think, and to understand so many things.\n\n\nHEDDA.\n\nDid he give you lessons too, then?\n\n\nMRS. ELVSTED.\n\nNo, not exactly lessons. But he talked to me--talked about such an\ninfinity of things. And then came the lovely, happy time when I began to\nshare in his work--when he allowed me to help him!\n\n\nHEDDA.\n\nOh he did, did he?\n\n\nMRS. ELVSTED.\n\nYes! He never wrote anything without my assistance.\n\n\nHEDDA.\n\nYou were two good comrades, in fact?\n\n\nMRS. ELVSTED.\n\n[Eagerly.] Comrades! Yes, fancy, Hedda--that is the very word he\nused!--Oh, I ought to feel perfectly happy; and yet I cannot; for I\ndon't know how long it will last.\n\n\nHEDDA.\n\nAre you no surer of him than that?\n\n\nMRS. ELVSTED.\n\n[Gloomily.] A woman's shadow stands between Eilert Lovborg and me.\n\n\nHEDDA.\n\n[Looks at her anxiously.] Who can that be?\n\n\nMRS. ELVSTED.\n\nI don't know. Some one he knew in his--in his past. Some one he has\nnever been able wholly to forget.\n\n\nHEDDA.\n\nWhat has he told you--about this?\n\n\nMRS. ELVSTED.\n\nHe has only once--quite vaguely--alluded to it.\n\n\nHEDDA.\n\nWell! And what did he say?\n\n\nMRS. ELVSTED.\n\nHe said that when they parted, she threatened to shoot him with a\npistol.\n\n\nHEDDA.\n\n[With cold composure.] Oh nonsense! No one does that sort of thing here.\n\n\nMRS. ELVSTED.\n\nNo. And that is why I think it must have been that red-haired\nsinging-woman whom he once--\n\nHEDDA.\n\nYes, very likely.\n\n\nMRS. ELVSTED.\n\nFor I remember they used to say of her that she carried loaded firearms.\n\n\nHEDDA.\n\nOh--then of course it must have been she.\n\n\nMRS. ELVSTED.\n\n[Wringing her hands.] And now just fancy, Hedda--I hear that this\nsinging-woman--that she is in town again! Oh, I don't know what to do--\n\n\nHEDDA.\n\n[Glancing towards the inner room.] Hush! Here comes Tesman. [Rises and\nwhispers.] Thea--all this must remain between you and me.\n\n\nMRS. ELVSTED.\n\n[Springing up.] Oh yes--yes! For heaven's sake--!\n\n\n  GEORGE TESMAN, with a letter in his hand, comes from the right\n  through the inner room.\n\n\nTESMAN.\n\nThere now--the epistle is finished.\n\n\nHEDDA.\n\nThat's right. And now Mrs. Elvsted is just going. Wait a moment--I'll\ngo with you to the garden gate.\n\n\nTESMAN.\n\nDo you think Berta could post the letter, Hedda dear?\n\n\nHEDDA.\n\n[Takes it.] I will tell her to.\n\n\n  BERTA enters from the hall.\n\n\nBERTA.\n\nJudge Brack wishes to know if Mrs. Tesman will receive him.\n\n\nHEDDA.\n\nYes, ask Judge Brack to come in. And look here--put this letter in the\npost.\n\n\nBERTA. [Taking the letter.] Yes, ma'am.\n\n   [She opens the door for JUDGE BRACK and goes out herself.  Brack\n       is a main of forty-five; thick set, but well-built and elastic\n       in his movements.  His face is roundish with an aristocratic\n       profile.  His hair is short, still almost black, and carefully\n       dressed.  His eyebrows thick.  His moustaches are also thick,\n       with short-cut ends.  He wears a well-cut walking-suit, a\n       little too youthful for his age.  He uses an eye-glass, which\n       he now and then lets drop.\n\n\nJUDGE BRACK.\n\n[With his hat in his hand, bowing.] May one venture to call so early in\nthe day?\n\n\nHEDDA.\n\nOf course one may.\n\n\nTESMAN.\n\n[Presses his hand.] You are welcome at any time. [Introducing him.]\nJudge Brack--Miss Rysing--\n\n\nHEDDA.\n\nOh--!\n\n\nBRACK.\n\n[Bowing.] Ah--delighted--\n\n\nHEDDA.\n\n[Looks at him and laughs.] It's nice to have a look at you by daylight,\nJudge!\n\n\nBRACK.\n\nSo you find me--altered?\n\n\nHEDDA.\n\nA little younger, I think.\n\n\nBRACK.\n\nThank you so much.\n\n\nTESMAN.\n\nBut what do you think of Hedda--eh? Doesn't she look flourishing? She\nhas actually--\n\n\nHEDDA.\n\nOh, do leave me alone. You haven't thanked Judge Brack for all the\ntrouble he has taken--\n\n\nBRACK.\n\nOh, nonsense--it was a pleasure to me--\n\n\nHEDDA.\n\nYes, you are a friend indeed. But here stands Thea all impatience to be\noff--so _au revoir_ Judge. I shall be back again presently.\n\n   [Mutual salutations.  MRS. ELVSTED and HEDDA go out by the hall\n       door.\n\n\nBRACK.\n\nWell,--is your wife tolerably satisfied--\n\n\nTESMAN.\n\nYes, we can't thank you sufficiently. Of course she talks of a little\nre-arrangement here and there; and one or two things are still wanting.\nWe shall have to buy some additional trifles.\n\n\nBRACK.\n\nIndeed!\n\n\nTESMAN.\n\nBut we won't trouble you about these things. Hedda say she herself will\nlook after what is wanting.--Shan't we sit down? Eh?\n\n\nBRACK.\n\nThanks, for a moment. [Seats himself beside the table.] There is\nsomething I wanted to speak to about, my dear Tesman.\n\n\nTESMAN.\n\nIndeed? Ah, I understand! [Seating himself.] I suppose it's the serious\npart of the frolic that is coming now. Eh?\n\n\nBRACK.\n\nOh, the money question is not so very pressing; though, for that matter,\nI wish we had gone a little more economically to work.\n\n\nTESMAN.\n\nBut that would never have done, you know! Think of Hedda, my dear\nfellow! You, who know her so well--! I couldn't possibly ask her to put\nup with a shabby style of living!\n\n\nBRACK.\n\nNo, no--that is just the difficulty.\n\n\nTESMAN.\n\nAnd then--fortunately--it can't be long before I receive my appointment.\n\n\nBRACK.\n\nWell, you see--such things are often apt to hang fire for a long time.\n\n\nTESMAN.\n\nHave you heard anything definite? Eh?\n\n\nBRACK.\n\nNothing exactly definite--. [Interrupting himself.] But by-the-bye--I\nhave one piece of news for you.\n\n\nTESMAN.\n\nWell?\n\n\nBRACK.\n\nYour old friend, Eilert Lovborg, has returned to town.\n\n\nTESMAN.\n\nI know that already.\n\n\nBRACK.\n\nIndeed! How did you learn it?\n\n\nTESMAN.\n\nFrom that lady who went out with Hedda.\n\n\nBRACK.\n\nReally? What was her name? I didn't quite catch it.\n\n\nTESMAN.\n\nMrs. Elvsted.\n\n\nBRACK.\n\nAha--Sheriff Elvsted's wife? Of course--he has been living up in their\nregions.\n\n\nTESMAN.\n\nAnd fancy--I'm delighted to hear that he is quite a reformed character.\n\n\nBRACK.\n\nSo they say.\n\n\nTESMAN.\n\nAnd then he has published a new book--eh?\n\n\nBRACK.\n\nYes, indeed he has.\n\n\nTESMAN.\n\nAnd I hear it has made some sensation!\n\n\nBRACK.\n\nQuite an unusual sensation.\n\n\nTESMAN.\n\nFancy--isn't that good news! A man of such extraordinary talents--. I\nfelt so grieved to think that he had gone irretrievably to ruin.\n\n\nBRACK.\n\nThat was what everybody thought.\n\n\nTESMAN.\n\nBut I cannot imagine what he will take to now! How in the world will he\nbe able to make his living? Eh?\n\n   [During the last words, HEDDA has entered by the hall door.\n\n\nHEDDA.\n\n[To BRACK, laughing with a touch of scorn.] Tesman is for ever worrying\nabout how people are to make their living.\n\n\nTESMAN.\n\nWell you see, dear--we were talking about poor Eilert Lovborg.\n\n\nHEDDA.\n\n[Glancing at him rapidly.] Oh, indeed? [Sets herself in the arm-chair\nbeside the stove and asks indifferently:] What is the matter with him?\n\n\nTESMAN.\n\nWell--no doubt he has run through all his property long ago; and he can\nscarcely write a new book every year--eh? So I really can't see what is\nto become of him.\n\n\nBRACK.\n\nPerhaps I can give you some information on that point.\n\n\nTESMAN.\n\nIndeed!\n\n\nBRACK.\n\nYou must remember that his relations have a good deal of influence.\n\n\nTESMAN.\n\nOh, his relations, unfortunately, have entirely washed their hands of\nhim.\n\n\nBRACK.\n\nAt one time they called him the hope of the family.\n\n\nTESMAN.\n\nAt one time, yes! But he has put an end to all that.\n\n\nHEDDA.\n\nWho knows? [With a slight smile.] I hear they have reclaimed him up at\nSheriff Elvsted's--\n\n\nBRACK.\n\nAnd then this book that he has published--\n\n\nTESMAN.\n\nWell well, I hope to goodness they may find something for him to do. I\nhave just written to him. I asked him to come and see us this evening,\nHedda dear.\n\n\nBRACK.\n\nBut my dear fellow, you are booked for my bachelor's party this evening.\nYou promised on the pier last night.\n\n\nHEDDA.\n\nHad you forgotten, Tesman?\n\n\nTESMAN.\n\nYes, I had utterly forgotten.\n\n\nBRACK.\n\nBut it doesn't matter, for you may be sure he won't come.\n\n\nTESMAN.\n\nWhat makes you think that? Eh?\n\n\nBRACK.\n\n[With a little hesitation, rising and resting his hands on the back of\nhis chair.] My dear Tesman--and you too, Mrs. Tesman--I think I ought\nnot to keep you in the dark about something that--that--\n\n\nTESMAN.\n\nThat concerns Eilert--?\n\n\nBRACK.\n\nBoth you and him.\n\n\nTESMAN.\n\nWell, my dear Judge, out with it.\n\n\nBRACK.\n\nYou must be prepared to find your appointment deferred longer than you\ndesired or expected.\n\n\nTESMAN.\n\n[Jumping up uneasily.] Is there some hitch about it? Eh?\n\n\nBRACK.\n\nThe nomination may perhaps be made conditional on the result of a\ncompetition--\n\n\nTESMAN.\n\nCompetition! Think of that, Hedda!\n\n\nHEDDA.\n\n[Leans further back in the chair.] Aha--aha!\n\n\nTESMAN.\n\nBut who can my competitor be? Surely not--?\n\n\nBRACK.\n\nYes, precisely--Eilert Lovborg.\n\n\nTESMAN.\n\n[Clasping his hands.] No, no--it's quite impossible! Eh?\n\n\nBRACK.\n\nH'm--that is what it may come to, all the same.\n\n\nTESMAN.\n\nWell but, Judge Brack--it would show the most incredible lack of\nconsideration for me. [Gesticulates with his arms.] For--just think--I'm\na married man! We have married on the strength of these prospects, Hedda\nand I; and run deep into debt; and borrowed money from Aunt Julia too.\nGood heavens, they had as good as promised me the appointment. Eh?\n\n\nBRACK.\n\nWell, well, well--no doubt you will get it in the end; only after a\ncontest.\n\n\nHEDDA.\n\n[Immovable in her arm-chair.] Fancy, Tesman, there will be a sort of\nsporting interest in that.\n\n\nTESMAN.\n\nWhy, my dearest Hedda, how can you be so indifferent about it?\n\n\nHEDDA.\n\n[As before.] I am not at all indifferent. I am most eager to see who\nwins.\n\n\nBRACK.\n\nIn any case, Mrs. Tesman, it is best that you should know how matters\nstand. I mean--before you set about the little purchases I hear you are\nthreatening.\n\n\nHEDDA.\n\nThis can make no difference.\n\n\nBRACK.\n\nIndeed! Then I have no more to say. Good-bye! [To TESMAN.] I shall look\nin on my way back from my afternoon walk, and take you home with me.\n\n\nTESMAN.\n\nOh yes, yes--your news has quite upset me.\n\n\nHEDDA.\n\n[Reclining, holds out her hand.] Good-bye, Judge; and be sure you call\nin the afternoon.\n\n\nBRACK.\n\nMany thanks. Good-bye, good-bye!\n\n\nTESMAN.\n\n[Accompanying him to the door.] Good-bye my dear Judge! You must really\nexcuse me-- [JUDGE BRACK goes out by the hall door.\n\n\nTESMAN.\n\n[Crosses the room.] Oh Hedda--one should never rush into adventures. Eh?\n\n\nHEDDA.\n\n[Looks at him, smiling.] Do you do that?\n\n\nTESMAN.\n\nYes, dear--there is no denying--it was adventurous to go and marry and\nset up house upon mere expectations.\n\n\nHEDDA.\n\nPerhaps you are right there.\n\n\nTESMAN.\n\nWell--at all events, we have our delightful home, Hedda! Fancy, the home\nwe both dreamed of--the home we were in love with, I may almost say. Eh?\n\n\nHEDDA.\n\n[Rising slowly and wearily.] It was part of our compact that we were to\ngo into society--to keep open house.\n\n\nTESMAN.\n\nYes, if you only knew how I had been looking forward to it! Fancy--to\nsee you as hostess--in a select circle! Eh? Well, well, well--for the\npresent we shall have to get on without society, Hedda--only to invite\nAunt Julia now and then.--Oh, I intended you to lead such an utterly\ndifferent life, dear--!\n\n\nHEDDA.\n\nOf course I cannot have my man in livery just yet.\n\n\nTESMAN.\n\nOh, no, unfortunately. It would be out of the question for us to keep a\nfootman, you know.\n\n\nHEDDA.\n\nAnd the saddle-horse I was to have had--\n\n\nTESMAN.\n\n[Aghast.] The saddle-horse!\n\n\nHEDDA.\n\n--I suppose I must not think of that now.\n\n\nTESMAN.\n\nGood heavens, no!--that's as clear as daylight!\n\n\nHEDDA.\n\n[Goes up the room.] Well, I shall have one thing at least to kill time\nwith in the meanwhile.\n\n\nTESMAN.\n\n[Beaming.] Oh thank heaven for that! What is it, Hedda. Eh?\n\n\nHEDDA.\n\n[In the middle doorway, looks at him with covert scorn.] My pistols,\nGeorge.\n\n\nTESMAN.\n\n[In alarm.] Your pistols!\n\n\nHEDDA.\n\n[With cold eyes.] General Gabler's pistols.\n\n   [She goes out through the inner room, to the left.\n\n\nTESMAN.\n\n[Rushes up to the middle doorway and calls after her:] No, for heaven's\nsake, Hedda darling--don't touch those dangerous things! For my sake\nHedda! Eh?\n\n\n\n\nACT SECOND.\n\n\n  The room at the TESMANS' as in the first Act, except that the\n  piano has been removed, and an elegant little writing-table\n  with the book-shelves put in its place.  A smaller table\n  stands near the sofa on the left.  Most of the bouquets have\n  been taken away.  MRS. ELVSTED'S bouquet is upon the large\n  table in front.--It is afternoon.\n\n  HEDDA, dressed to receive callers, is alone in the room. She\n  stands by the open glass door, loading a revolver.  The\n  fellow to it lies in an open pistol-case on the writing-\n  table.\n\n\nHEDDA.\n\n[Looks down the garden, and calls:] So you are here again, Judge!\n\n\nBRACK.\n\n[Is heard calling from a distance.] As you see, Mrs. Tesman!\n\n\nHEDDA.\n\n[Raises the pistol and points.] Now I'll shoot you, Judge Brack!\n\n\nBRACK.\n\n[Calling unseen.] No, no, no! Don't stand aiming at me!\n\n\nHEDDA.\n\nThis is what comes of sneaking in by the back way.(7) [She fires.\n\n\nBRACK.\n\n[Nearer.] Are you out of your senses--!\n\n\nHEDDA.\n\nDear me--did I happen to hit you?\n\n\nBRACK.\n\n[Still outside.] I wish you would let these pranks alone!\n\n\nHEDDA.\n\nCome in then, Judge.\n\n\n  JUDGE BRACK, dressed as though for a men's party, enters by\n  the glass door.  He carries a light overcoat over his arm.\n\n\nBRACK.\n\nWhat the deuce--haven't you tired of that sport, yet? What are you\nshooting at?\n\n\nHEDDA.\n\nOh, I am only firing in the air.\n\n\nBRACK.\n\n[Gently takes the pistol out of her hand.] Allow me, madam! [Looks at\nit.] Ah--I know this pistol well! [Looks around.] Where is the case? Ah,\nhere it is. [Lays the pistol in it, and shuts it.] Now we won't play at\nthat game any more to-day.\n\n\nHEDDA.\n\nThen what in heaven's name would you have me do with myself?\n\n\nBRACK.\n\nHave you had no visitors?\n\n\nHEDDA.\n\n[Closing the glass door.] Not one. I suppose all our set are still out\nof town.\n\n\nBRACK.\n\nAnd is Tesman not at home either?\n\n\nHEDDA.\n\n[At the writing-table, putting the pistol-case in a drawer which she\nshuts.] No. He rushed off to his aunt's directly after lunch; he didn't\nexpect you so early.\n\n\nBRACK.\n\nH'm--how stupid of me not to have thought of that!\n\n\nHEDDA.\n\n[Turning her head to look at him.] Why stupid?\n\n\nBRACK.\n\nBecause if I had thought of it I should have come a little--earlier.\n\n\nHEDDA.\n\n[Crossing the room.] Then you would have found no one to receive you;\nfor I have been in my room changing my dress ever since lunch.\n\n\nBRACK.\n\nAnd is there no sort of little chink that we could hold a parley\nthrough?\n\n\nHEDDA.\n\nYou have forgotten to arrange one.\n\n\nBRACK.\n\nThat was another piece of stupidity.\n\n\nHEDDA.\n\nWell, we must just settle down here--and wait. Tesman is not likely to\nbe back for some time yet.\n\n\nBRACK.\n\nNever mind; I shall not be impatient.\n\n\n  HEDDA seats herself in the corner of the sofa.  BRACK lays his\n  overcoat over the back of the nearest chair, and sits down, but\n  keeps his hat in his hand.  A short silence.  They look at each\n  other.\n\n\nHEDDA.\n\nWell?\n\n\nBRACK.\n\n[In the same tone.] Well?\n\n\nHEDDA.\n\nI spoke first.\n\n\nBRACK.\n\n[Bending a little forward.] Come, let us have a cosy little chat, Mrs.\nHedda.(8)\n\n\nHEDDA.\n\n[Leaning further back in the sofa.] Does it not seem like a whole\neternity since our last talk? Of course I don't count those few words\nyesterday evening and this morning.\n\n\nBRACK.\n\nYou mean since out last confidential talk? Our last _tete-a-tete_?\n\n\nHEDDA.\n\nWell yes--since you put it so.\n\n\nBRACK.\n\nNot a day passed but I have wished that you were home again.\n\n\nHEDDA.\n\nAnd I have done nothing but wish the same thing.\n\n\nBRACK.\n\nYou? Really, Mrs. Hedda? And I thought you had been enjoying your tour\nso much!\n\n\nHEDDA.\n\nOh yes, you may be sure of that!\n\n\nBRACK.\n\nBut Tesman's letters spoke of nothing but happiness.\n\n\nHEDDA.\n\nOh, Tesman! You see, he thinks nothing is so delightful as grubbing\nin libraries and making copies of old parchments, or whatever you call\nthem.\n\n\nBRACK.\n\n[With a smile of malice.] Well, that is his vocation in life--or part of\nit at any rate.\n\n\nHEDDA.\n\nYes, of course; and no doubt when it's your vocation--. But _I_! Oh, my\ndear Mr. Brack, how mortally bored I have been.\n\n\nBRACK.\n\n[Sympathetically.] Do you really say so? In downright earnest?\n\n\nHEDDA.\n\nYes, you can surely understand it--! To go for six whole months without\nmeeting a soul that knew anything of our circle, or could talk about\nthings we were interested in.\n\n\nBRACK.\n\nYes, yes--I too should feel that a deprivation.\n\n\nHEDDA.\n\nAnd then, what I found most intolerable of all--\n\n\nBRACK.\n\nWell?\n\n\nHEDDA.\n\n--was being everlastingly in the company of--one and the same person--\n\n\nBRACK.\n\n[With a nod of assent.] Morning, noon, and night, yes--at all possible\ntimes and seasons.\n\n\nHEDDA.\n\nI said \"everlastingly.\"\n\n\nBRACK.\n\nJust so. But I should have thought, with our excellent Tesman, one\ncould--\n\n\nHEDDA.\n\nTesman is--a specialist, my dear Judge.\n\n\nBRACK.\n\nUndeniable.\n\n\nHEDDA.\n\nAnd specialists are not at all amusing to travel with. Not in the long\nrun at any rate.\n\n\nBRACK.\n\nNot even--the specialist one happens to love?\n\n\nHEDDA.\n\nFaugh--don't use that sickening word!\n\n\nBRACK.\n\n[Taken aback.] What do you say, Mrs. Hedda?\n\n\nHEDDA.\n\n[Half laughing, half irritated.] You should just try it! To hear of\nnothing but the history of civilisation, morning, noon, and night--\n\n\nBRACK.\n\nEverlastingly.\n\n\nHEDDA.\n\nYes yes yes! And then all this about the domestic industry of the middle\nages--! That's the most disgusting part of it!\n\n\nBRACK.\n\n[Looks searchingly at her.] But tell me--in that case, how am I to\nunderstand your--? H'm--\n\n\nHEDDA.\n\nMy accepting George Tesman, you mean?\n\n\nBRACK.\n\nWell, let us put it so.\n\n\nHEDDA.\n\nGood heavens, do you see anything so wonderful in that?\n\n\nBRACK.\n\nYes and no--Mrs. Hedda.\n\n\nHEDDA.\n\nI had positively danced myself tired, my dear Judge. My day was\ndone-- [With a slight shudder.] Oh no--I won't say that; nor think\nit either!\n\n\nBRACK.\n\nYou have assuredly no reason to.\n\n\nHEDDA.\n\nOh, reasons-- [Watching him closely.] And George Tesman--after all, you\nmust admit that he is correctness itself.\n\n\nBRACK.\n\nHis correctness and respectability are beyond all question.\n\n\nHEDDA.\n\nAnd I don't see anything absolutely ridiculous about him.--Do you?\n\n\nBRACK.\n\nRidiculous? N--no--I shouldn't exactly say so--\n\n\nHEDDA.\n\nWell--and his powers of research, at all events, are untiring.--I see no\nreason why he should not one day come to the front, after all.\n\n\nBRACK.\n\n[Looks at her hesitatingly.] I thought that you, like every one else,\nexpected him to attain the highest distinction.\n\n\nHEDDA.\n\n[With an expression of fatigue.] Yes, so I did.--And then, since he was\nbent, at all hazards, on being allowed to provide for me--I really don't\nknow why I should not have accepted his offer?\n\n\nBRACK.\n\nNo--if you look at it in that light--\n\n\nHEDDA.\n\nIt was more than my other adorers were prepared to do for me, my dear\nJudge.\n\n\nBRACK.\n\n[Laughing.] Well, I can't answer for all the rest; but as for myself,\nyou know quite well that I have always entertained a--a certain respect\nfor the marriage tie--for marriage as an institution, Mrs. Hedda.\n\n\nHEDDA.\n\n[Jestingly.] Oh, I assure you I have never cherished any hopes with\nrespect to you.\n\n\nBRACK.\n\nAll I require is a pleasant and intimate interior, where I can make\nmyself useful in every way, and am free to come and go as--as a trusted\nfriend--\n\n\nHEDDA.\n\nOf the master of the house, do you mean?\n\n\nBRACK.\n\n[Bowing.] Frankly--of the mistress first of all; but of course of the\nmaster too, in the second place. Such a triangular friendship--if I may\ncall it so--is really a great convenience for all the parties, let me\ntell you.\n\n\nHEDDA.\n\nYes, I have many a time longed for some one to make a third on our\ntravels. Oh--those railway-carriage _tete-a-tetes_--!\n\n\nBRACK.\n\nFortunately your wedding journey is over now.\n\n\nHEDDA.\n\n[Shaking her head.] Not by a long--long way. I have only arrived at a\nstation on the line.\n\n\nBRACK.\n\nWell, then the passengers jump out and move about a little, Mrs. Hedda.\n\n\nHEDDA.\n\nI never jump out.\n\n\nBRACK.\n\nReally?\n\n\nHEDDA.\n\nNo--because there is always some one standing by to--\n\n\nBRACK.\n\n[Laughing.] To look at your ankles, do you mean?\n\n\nHEDDA.\n\nPrecisely.\n\n\nBRACK.\n\nWell but, dear me--\n\n\nHEDDA.\n\n[With a gesture of repulsion.] I won't have it. I would rather keep my\nseat where I happen to be--and continue the _tete-a-tete_.\n\n\nBRACK.\n\nBut suppose a third person were to jump in and join the couple.\n\n\nHEDDA.\n\nAh--that is quite another matter!\n\n\nBRACK.\n\nA trusted, sympathetic friend--\n\n\nHEDDA.\n\n--with a fund of conversation on all sorts of lively topics--\n\n\nBRACK.\n\n--and not the least bit of a specialist!\n\n\nHEDDA.\n\n[With an audible sigh.] Yes, that would be a relief indeed.\n\n\nBRACK.\n\n[Hears the front door open, and glances in that direction.] The triangle\nis completed.\n\n\nHEDDA.\n\n[Half aloud.] And on goes the train.\n\n\n  GEORGE TESMAN, in a grey walking-suit, with a soft felt hat,\n  enters from the hall.  He has a number of unbound books under\n  his arm and in his pockets.\n\n\nTESMAN.\n\n[Goes up to the table beside the corner settee.] Ouf--what a load for\na warm day--all these books. [Lays them on the table.] I'm positively\nperspiring, Hedda. Hallo--are you there already, my dear Judge? Eh?\nBerta didn't tell me.\n\n\nBRACK.\n\n[Rising.] I came in through the garden.\n\n\nHEDDA.\n\nWhat books have you got there?\n\n\nTESMAN.\n\n[Stands looking them through.] Some new books on my special subjects\n--quite indispensable to me.\n\n\nHEDDA.\n\nYour special subjects?\n\n\nBRACK.\n\nYes, books on his special subjects, Mrs. Tesman.\n\n   [BRACK and HEDDA exchange a confidential smile.\n\n\nHEDDA.\n\nDo you need still more books on your special subjects?\n\n\nTESMAN.\n\nYes, my dear Hedda, one can never have too many of them. Of course one\nmust keep up with all that is written and published.\n\n\nHEDDA.\n\nYes, I suppose one must.\n\n\nTESMAN.\n\n[Searching among his books.] And look here--I have got hold of Eilert\nLovborg's new book too. [Offering it to her.] Perhaps you would like to\nglance through it, Hedda? Eh?\n\n\nHEDDA.\n\nNo, thank you. Or rather--afterwards perhaps.\n\n\nTESMAN.\n\nI looked into it a little on the way home.\n\n\nBRACK.\n\nWell, what do you think of it--as a specialist?\n\n\nTESMAN.\n\nI think it shows quite remarkable soundness of judgment. He never wrote\nlike that before. [Putting the books together.] Now I shall take all\nthese into my study. I'm longing to cut the leaves--! And then I must\nchange my clothes. [To BRACK.] I suppose we needn't start just yet? Eh?\n\n\nBRACK.\n\nOh, dear no--there is not the slightest hurry.\n\n\nTESMAN.\n\nWell then, I will take my time. [Is going with his books, but stops in\nthe doorway and turns.] By-the-bye, Hedda--Aunt Julia is not coming this\nevening.\n\n\nHEDDA.\n\nNot coming? Is it that affair of the bonnet that keeps her away?\n\n\nTESMAN.\n\nOh, not at all. How could you think such a thing of Aunt Julia? Just\nfancy--! The fact is, Aunt Rina is very ill.\n\n\nHEDDA.\n\nShe always is.\n\n\nTESMAN.\n\nYes, but to-day she is much worse than usual, poor dear.\n\n\nHEDDA.\n\nOh, then it's only natural that her sister should remain with her. I\nmust bear my disappointment.\n\n\nTESMAN.\n\nAnd you can't imagine, dear, how delighted Aunt Julia seemed to be--\nbecause you had come home looking so flourishing!\n\n\nHEDDA.\n\n[Half aloud, rising.] Oh, those everlasting Aunts!\n\n\nTESMAN.\n\nWhat?\n\n\nHEDDA.\n\n[Going to the glass door.] Nothing.\n\n\nTESMAN.\n\nOh, all right. [He goes through the inner room, out to the right.\n\n\nBRACK.\n\nWhat bonnet were you talking about?\n\n\nHEDDA.\n\nOh, it was a little episode with Miss Tesman this morning. She had laid\ndown her bonnet on the chair there--[Looks at him and smiles.]--and I\npretended to think it was the servant's.\n\n\nBRACK.\n\n[Shaking his head.] Now my dear Mrs. Hedda, how could you do such a\nthing? To the excellent old lady, too!\n\n\nHEDDA.\n\n[Nervously crossing the room.] Well, you see--these impulses come over\nme all of a sudden; and I cannot resist them. [Throws herself down in\nthe easy-chair by the stove.] Oh, I don't know how to explain it.\n\n\nBRACK.\n\n[Behind the easy-chair.] You are not really happy--that is at the bottom\nof it.\n\n\nHEDDA.\n\n[Looking straight before her.] I know of no reason why I should be--\nhappy. Perhaps you can give me one?\n\n\nBRACK.\n\nWell-amongst other things, because you have got exactly the home you had\nset your heart on.\n\n\nHEDDA.\n\n[Looks up at him and laughs.] Do you too believe in that legend?\n\n\nBRACK.\n\nIs there nothing in it, then?\n\n\nHEDDA.\n\nOh yes, there is something in it.\n\n\nBRACK.\n\nWell?\n\n\nHEDDA.\n\nThere is this in it, that I made use of Tesman to see me home from\nevening parties last summer--\n\n\nBRACK.\n\nI, unfortunately, had to go quite a different way.\n\n\nHEDDA.\n\nThat's true. I know you were going a different way last summer.\n\n\nBRACK.\n\n[Laughing.] Oh fie, Mrs. Hedda! Well, then--you and Tesman--?\n\n\nHEDDA.\n\nWell, we happened to pass here one evening; Tesman, poor fellow, was\nwrithing in the agony of having to find conversation; so I took pity on\nthe learned man--\n\n\nBRACK.\n\n[Smiles doubtfully.] You took pity? H'm--\n\n\nHEDDA.\n\nYes, I really did. And so--to help him out of his torment--I happened to\nsay, in pure thoughtlessness, that I should like to live in this villa.\n\n\nBRACK.\n\nNo more than that?\n\n\nHEDDA.\n\nNot that evening.\n\n\nBRACK.\n\nBut afterwards?\n\n\nHEDDA.\n\nYes, my thoughtlessness had consequences, my dear Judge.\n\n\nBRACK.\n\nUnfortunately that too often happens, Mrs. Hedda.\n\n\nHEDDA.\n\nThanks! So you see it was this enthusiasm for Secretary Falk's villa\nthat first constituted a bond of sympathy between George Tesman and me.\nFrom that came our engagement and our marriage, and our wedding journey,\nand all the rest of it. Well, well, my dear Judge--as you make your bed\nso you must lie, I could almost say.\n\n\nBRACK.\n\nThis is exquisite! And you really cared not a rap about it all the time?\n\n\nHEDDA.\n\nNo, heaven knows I didn't.\n\n\nBRACK.\n\nBut now? Now that we have made it so homelike for you?\n\n\nHEDDA.\n\nUh--the rooms all seem to smell of lavender and dried rose-leaves.--But\nperhaps it's Aunt Julia that has brought that scent with her.\n\n\nBRACK.\n\n[Laughing.] No, I think it must be a legacy from the late Mrs. Secretary\nFalk.\n\n\nHEDDA.\n\nYes, there is an odour of mortality about it. It reminds me of a\nbouquet--the day after the ball. [Clasps her hands behind her head,\nleans back in her chair and looks at him.] Oh, my dear Judge--you cannot\nimagine how horribly I shall bore myself here.\n\n\nBRACK.\n\nWhy should not you, too, find some sort of vocation in life, Mrs. Hedda?\n\n\nHEDDA.\n\nA vocation--that should attract me?\n\n\nBRACK.\n\nIf possible, of course.\n\n\nHEDDA.\n\nHeaven knows what sort of a vocation that could be. I often wonder\nwhether-- [Breaking off.] But that would never do either.\n\n\nBRACK.\n\nWho can tell? Let me hear what it is.\n\n\nHEDDA.\n\nWhether I might not get Tesman to go into politics, I mean.\n\n\nBRACK.\n\n[Laughing.] Tesman? No really now, political life is not the thing for\nhim--not at all in his line.\n\n\nHEDDA.\n\nNo, I daresay not.--But if I could get him into it all the same?\n\n\nBRACK.\n\nWhy--what satisfaction could you find in that? If he is not fitted for\nthat sort of thing, why should you want to drive him into it?\n\n\nHEDDA.\n\nBecause I am bored, I tell you! [After a pause.] So you think it quite\nout of the question that Tesman should ever get into the ministry?\n\n\nBRACK.\n\nH'm--you see, my dear Mrs. Hedda--to get into the ministry, he would\nhave to be a tolerably rich man.\n\n\nHEDDA.\n\n[Rising impatiently.] Yes, there we have it! It is this genteel poverty\nI have managed to drop into--! [Crosses the room.] That is what makes\nlife so pitiable! So utterly ludicrous!--For that's what it is.\n\n\nBRACK.\n\nNow _I_ should say the fault lay elsewhere.\n\n\nHEDDA.\n\nWhere, then?\n\n\nBRACK.\n\nYou have never gone through any really stimulating experience.\n\n\nHEDDA.\n\nAnything serious, you mean?\n\n\nBRACK.\n\nYes, you may call it so. But now you may perhaps have one in store.\n\n\nHEDDA.\n\n[Tossing her head.] Oh, you're thinking of the annoyances about this\nwretched professorship! But that must be Tesman's own affair. I assure\nyou I shall not waste a thought upon it.\n\n\nBRACK.\n\nNo, no, I daresay not. But suppose now that what people call--in elegant\nlanguage--a solemn responsibility were to come upon you? [Smiling.] A\nnew responsibility, Mrs. Hedda?\n\n\nHEDDA.\n\n[Angrily.] Be quiet! Nothing of that sort will ever happen!\n\n\nBRACK.\n\n[Warily.] We will speak of this again a year hence--at the very outside.\n\n\nHEDDA.\n\n[Curtly.] I have no turn for anything of the sort, Judge Brack. No\nresponsibilities for me!\n\n\nBRACK.\n\nAre you so unlike the generality of women as to have no turn for duties\nwhich--?\n\n\nHEDDA.\n\n[Beside the glass door.] Oh, be quiet, I tell you!--I often think there\nis only one thing in the world I have any turn for.\n\n\nBRACK.\n\n[Drawing near to her.] And what is that, if I may ask?\n\n\nHEDDA.\n\n[Stands looking out.] Boring myself to death. Now you know it. [Turns,\nlooks towards the inner room, and laughs.] Yes, as I thought! Here comes\nthe Professor.\n\n\nBRACK.\n\n[Softly, in a tone of warning.] Come, come, come, Mrs. Hedda!\n\n\n  GEORGE TESMAN, dressed for the party, with his gloves and hat\n  in his hand, enters from the right through the inner room.\n\n\nTESMAN.\n\nHedda, has no message come from Eilert Lovborg? Eh?\n\n\nHEDDA.\n\nNo.\n\n\nTESMAN.\n\nThen you'll see he'll be here presently.\n\n\nBRACK.\n\nDo you really think he will come?\n\n\nTESMAN.\n\nYes, I am almost sure of it. For what you were telling us this morning\nmust have been a mere floating rumour.\n\n\nBRACK.\n\nYou think so?\n\n\nTESMAN.\n\nAt any rate, Aunt Julia said she did not believe for a moment that he\nwould ever stand in my way again. Fancy that!\n\n\nBRACK.\n\nWell then, that's all right.\n\n\nTESMAN.\n\n[Placing his hat and gloves on a chair on the right.] Yes, but you must\nreally let me wait for him as long as possible.\n\n\nBRACK.\n\nWe have plenty of time yet. None of my guests will arrive before seven\nor half-past.\n\n\nTESMAN.\n\nThen meanwhile we can keep Hedda company, and see what happens. Eh?\n\n\nHEDDA.\n\n[Placing BRACK'S hat and overcoat upon the corner settee.] And at the\nworst Mr. Lovborg can remain here with me.\n\n\nBRACK.\n\n[Offering to take his things.] Oh, allow me, Mrs. Tesman!--What do you\nmean by \"At the worst\"?\n\n\nHEDDA.\n\nIf he won't go with you and Tesman.\n\n\nTESMAN.\n\n[Looks dubiously at her.] But, Hedda dear--do you think it would quite\ndo for him to remain here with you? Eh? Remember, Aunt Julia can't come.\n\n\nHEDDA.\n\nNo, but Mrs. Elvsted is coming. We three can have a cup of tea together.\n\n\nTESMAN.\n\nOh yes, that will be all right.\n\n\nBRACK.\n\n[Smiling.] And that would perhaps be the safest plan for him.\n\n\nHEDDA.\n\nWhy so?\n\n\nBRACK.\n\nWell, you know, Mrs. Tesman, how you used to gird at my little bachelor\nparties. You declared they were adapted only for men of the strictest\nprinciples.\n\n\nHEDDA.\n\nBut no doubt Mr. Lovborg's principles are strict enough now. A converted\nsinner-- [BERTA appears at the hall door.\n\n\nBERTA.\n\nThere's a gentleman asking if you are at home, ma'am--\n\n\nHEDDA.\n\nWell, show him in.\n\n\nTESMAN.\n\n[Softly.] I'm sure it is he! Fancy that!\n\n\n  EILERT LOVBORG enters from the hall.  He is slim and lean;\n  of the same age as TESMAN, but looks older and somewhat\n  worn-out.  His hair and beard are of a blackish brown, his\n  face long and pale, but with patches of colour on the cheeks.\n  He is dressed in a well-cut black visiting suit, quite new.\n  He has dark gloves and a silk hat.  He stops near the door,\n  and makes a rapid bow, seeming somewhat embarrassed.\n\n\nTESMAN.\n\n[Goes up to him and shakes him warmly by the hand.] Well, my dear\nEilert--so at last we meet again!\n\n\nEILERT LOVBORG.\n\n[Speaks in a subdued voice.] Thanks for your letter, Tesman.\n[Approaching HEDDA.] Will you too shake hands with me, Mrs. Tesman?\n\n\nHEDDA.\n\n[Taking his hand.] I am glad to see you, Mr. Lovborg. [With a motion of\nher hand.] I don't know whether you two gentlemen--?\n\n\nLOVBORG.\n\n[Bowing slightly.] Judge Brack, I think.\n\n\nBRACK.\n\n[Doing likewise.] Oh yes,--in the old days--\n\n\nTESMAN.\n\n[To LOVBORG, with his hands on his shoulders.] And now you must make\nyourself entirely at home, Eilert! Mustn't he, Hedda?--For I hear you\nare going to settle in town again? Eh?\n\n\nLOVBORG.\n\nYes, I am.\n\n\nTESMAN.\n\nQuite right, quite right. Let me tell you, I have got hold of your new\nbook; but I haven't had time to read it yet.\n\n\nLOVBORG.\n\nYou may spare yourself the trouble.\n\n\nTESMAN.\n\nWhy so?\n\n\nLOVBORG.\n\nBecause there is very little in it.\n\n\nTESMAN.\n\nJust fancy--how can you say so?\n\n\nBRACK.\n\nBut it has been very much praised, I hear.\n\n\nLOVBORG.\n\nThat was what I wanted; so I put nothing into the book but what every\none would agree with.\n\n\nBRACK.\n\nVery wise of you.\n\n\nTESMAN.\n\nWell but, my dear Eilert--!\n\n\nLOVBORG.\n\nFor now I mean to win myself a position again--to make a fresh start.\n\n\nTESMAN.\n\n[A little embarrassed.] Ah, that is what you wish to do? Eh?\n\n\nLOVBORG.\n\n[Smiling, lays down his hat, and draws a packet wrapped in paper, from\nhis coat pocket.] But when this one appears, George Tesman, you will\nhave to read it. For this is the real book--the book I have put my true\nself into.\n\n\nTESMAN.\n\nIndeed? And what is it?\n\n\nLOVBORG.\n\nIt is the continuation.\n\n\nTESMAN.\n\nThe continuation? Of what?\n\n\nLOVBORG.\n\nOf the book.\n\n\nTESMAN.\n\nOf the new book?\n\n\nLOVBORG.\n\nOf course.\n\n\nTESMAN.\n\n\nWhy, my dear Eilert--does it not come down to our own days?\n\n\nLOVBORG.\n\nYes, it does; and this one deals with the future.\n\n\nTESMAN.\n\nWith the future! But, good heavens, we know nothing of the future!\n\n\nLOVBORG.\n\nNo; but there is a thing or two to be said about it all the same. [Opens\nthe packet.] Look here--\n\n\nTESMAN.\n\nWhy, that's not your handwriting.\n\n\nLOVBORG.\n\nI dictated it. [Turning over the pages.] It falls into two sections. The\nfirst deals with the civilising forces of the future. And here is the\nsecond--[running through the pages towards the end]--forecasting the\nprobable line of development.\n\n\nTESMAN.\n\nHow odd now! I should never have thought of writing anything of that\nsort.\n\n\nHEDDA.\n\n[At the glass door, drumming on the pane.] H'm--. I daresay not.\n\n\nLOVBORG.\n\n[Replacing the manuscript in its paper and laying the packet on the\ntable.] I brought it, thinking I might read you a little of it this\nevening.\n\n\nTESMAN.\n\nThat was very good of you, Eilert. But this evening--? [Looking back at\nBRACK.] I don't see how we can manage it--\n\n\nLOVBORG.\n\nWell then, some other time. There is no hurry.\n\n\nBRACK.\n\nI must tell you, Mr. Lovborg--there is a little gathering at my house\nthis evening--mainly in honour of Tesman, you know--\n\n\nLOVBORG.\n\n[Looking for his hat.] Oh--then I won't detain you--\n\n\nBRACK.\n\nNo, but listen--will you not do me the favour of joining us?\n\n\nLOVBORG.\n\n[Curtly and decidedly.] No, I can't--thank you very much.\n\n\nBRACK.\n\nOh, nonsense--do! We shall be quite a select little circle. And I assure\nyou we shall have a \"lively time,\" as Mrs. Hed--as Mrs. Tesman says.\n\n\nLOVBORG.\n\nI have no doubt of it. But nevertheless--\n\n\nBRACK.\n\nAnd then you might bring your manuscript with you, and read it to Tesman\nat my house. I could give you a room to yourselves.\n\n\nTESMAN.\n\nYes, think of that, Eilert,--why shouldn't you? Eh?\n\n\nHEDDA.\n\n[Interposing.] But, Tesman, if Mr. Lovborg would really rather not! I\nam sure Mr. Lovborg is much more inclined to remain here and have supper\nwith me.\n\n\nLOVBORG.\n\n[Looking at her.] With you, Mrs. Tesman?\n\n\nHEDDA.\n\nAnd with Mrs. Elvsted.\n\n\nLOVBORG.\n\nAh-- [Lightly.] I saw her for a moment this morning.\n\n\nHEDDA.\n\nDid you? Well, she is coming this evening. So you see you are almost\nbound to remain, Mr. Lovborg, or she will have no one to see her home.\n\n\nLOVBORG.\n\nThat's true. Many thanks, Mrs. Tesman--in that case I will remain.\n\n\nHEDDA.\n\nThen I have one or two orders to give the servant--\n\n   [She goes to the hall door and rings.  BERTA enters. HEDDA talks\n       to her in a whisper, and points towards the inner room.  BERTA\n       nods and goes out again.\n\n\nTESMAN.\n\n[At the same time, to LOVBORG.] Tell me, Eilert--is it this new\nsubject--the future--that you are going to lecture about?\n\n\nLOVBORG.\n\nYes.\n\n\nTESMAN.\n\nThey told me at the bookseller's that you are going to deliver a course\nof lectures this autumn.\n\n\nLOVBORG.\n\nThat is my intention. I hope you won't take it ill, Tesman.\n\n\nTESMAN.\n\nOh no, not in the least! But--?\n\n\nLOVBORG.\n\nI can quite understand that it must be very disagreeable to you.\n\n\nTESMAN.\n\n[Cast down.] Oh, I can't expect you, out of consideration for me, to--\n\n\nLOVBORG.\n\nBut I shall wait till you have received your appointment.\n\n\nTESMAN.\n\nWill you wait? Yes but--yes but--are you not going to compete with me?\nEh?\n\n\nLOVBORG.\n\nNo; it is only the moral victory I care for.\n\n\nTESMAN.\n\nWhy, bless me--then Aunt Julia was right after all! Oh yes--I knew it!\nHedda! Just fancy--Eilert Lovborg is not going to stand in our way!\n\n\nHEDDA.\n\n[Curtly.] Our way? Pray leave me out of the question.\n\n   [She goes up towards the inner room, where BERTA is placing a\n       tray with decanters and glasses on the table.  HEDDA nods\n       approval, and comes forward again.  BERTA goes out.\n\n\nTESMAN.\n\n[At the same time.] And you, Judge Brack--what do you say to this? Eh?\n\n\nBRACK.\n\nWell, I say that a moral victory--h'm--may be all very fine--\n\n\nTESMAN.\n\nYes, certainly. But all the same--\n\n\nHEDDA.\n\n[Looking at TESMAN with a cold smile.] You stand there looking as if you\nwere thunderstruck--\n\n\nTESMAN.\n\nYes--so I am--I almost think--\n\n\nBRACK.\n\nDon't you see, Mrs. Tesman, a thunderstorm has just passed over?\n\n\nHEDDA.\n\n[Pointing towards the room.] Will you not take a glass of cold punch,\ngentlemen?\n\n\nBRACK.\n\n[Looking at his watch.] A stirrup-cup? Yes, it wouldn't come amiss.\n\n\nTESMAN.\n\nA capital idea, Hedda! Just the thing! Now that the weight has been\ntaken off my mind--\n\n\nHEDDA.\n\nWill you not join them, Mr. Lovborg?\n\n\nLOVBORG.\n\n[With a gesture of refusal.] No, thank you. Nothing for me.\n\n\nBRACK.\n\nWhy bless me--cold punch is surely not poison.\n\n\nLOVBORG.\n\nPerhaps not for everyone.\n\n\nHEDDA.\n\nI will keep Mr. Lovborg company in the meantime.\n\n\nTESMAN.\n\nYes, yes, Hedda dear, do.\n\n     [He and BRACK go into the inner room, seat themselves, drink\n       punch, smoke cigarettes, and carry on a lively conversation\n       during what follows.  EILERT LOVBORG remains standing beside\n       the stove.  HEDDA goes to the writing-table.\n\n\nHEDDA.\n\n[Raising he voice a little.] Do you care to look at some photographs,\nMr. Lovborg? You know Tesman and I made a tour in the Tyrol on our way\nhome?\n\n     [She takes up an album, and places it on the table beside the\n       sofa, in the further corner of which she seats herself.  EILERT\n       LOVBORG approaches, stops, and looks at her.  Then he takes a\n       chair and seats himself to her left.\n\n\nHEDDA.\n\n[Opening the album.] Do you see this range of mountains, Mr. Lovborg?\nIt's the Ortler group. Tesman has written the name underneath. Here it\nis: \"The Ortler group near Meran.\"\n\n\nLOVBORG.\n\n[Who has never taken his eyes off her, says softly and slowly:]\nHedda--Gabler!\n\n\nHEDDA.\n\n[Glancing hastily at him.] Ah! Hush!\n\n\nLOVBORG.\n\n[Repeats softly.] Hedda Gabler!\n\n\nHEDDA.\n\n[Looking at the album.] That was my name in the old days--when we two\nknew each other.\n\n\nLOVBORG.\n\nAnd I must teach myself never to say Hedda Gabler again--never, as long\nas I live.\n\n\nHEDDA.\n\n[Still turning over the pages.] Yes, you must. And I think you ought to\npractise in time. The sooner the better, I should say.\n\n\nLOVBORG.\n\n[In a tone of indignation.] Hedda Gabler married? And married to--\nGeorge Tesman!\n\n\nHEDDA.\n\nYes--so the world goes.\n\n\nLOVBORG.\n\nOh, Hedda, Hedda--how could you(9) throw yourself away!\n\n\nHEDDA.\n\n[Looks sharply at him.] What? I can't allow this!\n\n\nLOVBORG.\n\nWhat do you mean?\n\n     [TESMAN comes into the room and goes towards the sofa.\n\n\nHEDDA.\n\n[Hears him coming and says in an indifferent tone.] And this is a view\nfrom the Val d'Ampezzo, Mr. Lovborg. Just look at these peaks! [Looks\naffectionately up at TESMAN.] What's the name of these curious peaks,\ndear?\n\n\nTESMAN.\n\nLet me see. Oh, those are the Dolomites.\n\n\nHEDDA.\n\nYes, that's it!--Those are the Dolomites, Mr. Lovborg.\n\n\nTESMAN.\n\nHedda, dear,--I only wanted to ask whether I shouldn't bring you a\nlittle punch after all? For yourself at any rate--eh?\n\n\nHEDDA.\n\nYes, do, please; and perhaps a few biscuits.\n\n\nTESMAN.\n\nNo cigarettes?\n\n\nHEDDA.\n\nNo.\n\n\nTESMAN.\n\nVery well.\n\n     [He goes into the inner room and out to the right.  BRACK sits\n       in the inner room, and keeps an eye from time to time on HEDDA\n       and LOVBORG.\n\n\nLOVBORG.\n\n[Softly, as before.] Answer me, Hedda--how could you go and do this?\n\n\nHEDDA.\n\n[Apparently absorbed in the album.] If you continue to say _du_ to me I\nwon't talk to you.\n\n\nLOVBORG.\n\nMay I not say _du_ even when we are alone?\n\n\nHEDDA.\n\nNo. You may think it; but you mustn't say it.\n\n\nLOVBORG.\n\nAh, I understand. It is an offence against George Tesman, whom\nyou(10)--love.\n\n\nHEDDA.\n\n[Glances at him and smiles.] Love? What an idea!\n\n\nLOVBORG.\n\nYou don't love him then!\n\n\nHEDDA.\n\nBut I won't hear of any sort of unfaithfulness! Remember that.\n\n\nLOVBORG.\n\nHedda--answer me one thing--\n\n\nHEDDA.\n\nHush! [TESMAN enters with a small tray from the inner room.\n\n\nTESMAN.\n\nHere you are! Isn't this tempting? [He puts the tray on the table.\n\n\nHEDDA.\n\nWhy do you bring it yourself?\n\n\nTESMAN.\n\n[Filling the glasses.] Because I think it's such fun to wait upon you,\nHedda.\n\n\nHEDDA.\n\nBut you have poured out two glasses. Mr. Lovborg said he wouldn't have\nany--\n\n\nTESMAN.\n\nNo, but Mrs. Elvsted will soon be here, won't she?\n\n\nHEDDA.\n\nYes, by-the-bye--Mrs. Elvsted--\n\n\nTESMAN.\n\nHad you forgotten her? Eh?\n\n\nHEDDA.\n\nWe were so absorbed in these photographs. [Shows him a picture.] Do you\nremember this little village?\n\n\nTESMAN.\n\nOh, it's that one just below the Brenner Pass. It was there we passed\nthe night--\n\n\nHEDDA.\n\n--and met that lively party of tourists.\n\n\nTESMAN.\n\nYes, that was the place. Fancy--if we could only have had you with us,\nEilert! Eh?\n\n     [He returns to the inner room and sits beside BRACK.\n\n\nLOVBORG.\n\nAnswer me one thing, Hedda--\n\n\nHEDDA.\n\nWell?\n\n\nLOVBORG.\n\nWas there no love in your friendship for me either? Not a spark--not a\ntinge of love in it?\n\n\nHEDDA.\n\nI wonder if there was? To me it seems as though we were two good\ncomrades--two thoroughly intimate friends. [Smilingly.] You especially\nwere frankness itself.\n\n\nLOVBORG.\n\nIt was you that made me so.\n\n\nHEDDA.\n\nAs I look back upon it all, I think there was really something\nbeautiful, something fascinating--something daring--in--in that secret\nintimacy--that comradeship which no living creature so much as dreamed\nof.\n\n\nLOVBORG.\n\nYes, yes, Hedda! Was there not?--When I used to come to your father's\nin the afternoon--and the General sat over at the window reading his\npapers--with his back towards us--\n\n\nHEDDA.\n\nAnd we two on the corner sofa--\n\n\nLOVBORG.\n\nAlways with the same illustrated paper before us--\n\n\nHEDDA.\n\nFor want of an album, yes.\n\n\nLOVBORG.\n\nYes, Hedda, and when I made my confessions to you--told you about\nmyself, things that at that time no one else knew! There I would sit\nand tell you of my escapades--my days and nights of devilment. Oh,\nHedda--what was the power in you that forced me to confess these things?\n\n\nHEDDA.\n\nDo you think it was any power in me?\n\n\nLOVBORG.\n\nHow else can I explain it? And all those--those roundabout questions you\nused to put to me--\n\n\nHEDDA.\n\nWhich you understood so particularly well--\n\n\nLOVBORG.\n\nHow could you sit and question me like that? Question me quite\nfrankly--\n\n\nHEDDA.\n\nIn roundabout terms, please observe.\n\n\nLOVBORG.\n\nYes, but frankly nevertheless. Cross-question me about--all that sort of\nthing?\n\n\nHEDDA.\n\nAnd how could you answer, Mr. Lovborg?\n\n\nLOVBORG.\n\nYes, that is just what I can't understand--in looking back upon it. But\ntell me now, Hedda--was there not love at the bottom of our friendship?\nOn your side, did you not feel as though you might purge my stains\naway--if I made you my confessor? Was it not so?\n\n\nHEDDA.\n\nNo, not quite.\n\n\nLOVBORG.\n\nWhat was you motive, then?\n\n\nHEDDA.\n\nDo think it quite incomprehensible that a young girl--when it can be\ndone--without any one knowing--\n\n\nLOVBORG.\n\nWell?\n\n\nHEDDA.\n\n--should be glad to have a peep, now and then, into a world which--?\n\n\nLOVBORG.\n\nWhich--?\n\n\nHEDDA.\n\n--which she is forbidden to know anything about?\n\n\nLOVBORG.\n\nSo that was it?\n\n\nHEDDA.\n\nPartly. Partly--I almost think.\n\n\nLOVBORG.\n\nComradeship in the thirst for life. But why should not that, at any\nrate, have continued?\n\n\nHEDDA.\n\nThe fault was yours.\n\n\nLOVBORG.\n\nIt was you that broke with me.\n\n\nHEDDA.\n\nYes, when our friendship threatened to develop into something more\nserious. Shame upon you, Eilert Lovborg! How could you think of wronging\nyour--your frank comrade.\n\n\nLOVBORG.\n\n[Clenches his hands.] Oh, why did you not carry out your threat? Why did\nyou not shoot me down?\n\n\nHEDDA.\n\nBecause I have such a dread of scandal.\n\n\nLOVBORG.\n\nYes, Hedda, you are a coward at heart.\n\n\nHEDDA.\n\nA terrible coward. [Changing her tone.] But it was a lucky thing for\nyou. And now you have found ample consolation at the Elvsteds'.\n\n\nLOVBORG.\n\nI know what Thea has confided to you.\n\n\nHEDDA.\n\nAnd perhaps you have confided to her something about us?\n\n\nLOVBORG.\n\nNot a word. She is too stupid to understand anything of that sort.\n\n\nHEDDA.\n\nStupid?\n\n\nLOVBORG.\n\nShe is stupid about matters of that sort.\n\n\nHEDDA.\n\nAnd I am cowardly. [Bends over towards him, without looking him in the\nface, and says more softly:] But now I will confide something to you.\n\n\nLOVBORG.\n\n[Eagerly.] Well?\n\n\nHEDDA.\n\nThe fact that I dared not shoot you down--\n\n\nLOVBORG.\n\nYes!\n\n\nHEDDA.\n\n--that was not my arrant cowardice--that evening.\n\n\nLOVBORG.\n\n[Looks at her a moment, understands, and whispers passionately.] Oh,\nHedda! Hedda Gabler! Now I begin to see a hidden reason beneath our\ncomradeship! You(11) and I--! After all, then, it was your craving for\nlife--\n\n\nHEDDA.\n\n[Softly, with a sharp glance.] Take care! Believe nothing of the sort!\n\n   [Twilight has begun to fall.  The hall door is opened from\n       without by BERTA.\n\n\nHEDDA.\n\n[Closes the album with a bang and calls smilingly:] Ah, at last! My\ndarling Thea,--come along!\n\n  MRS. ELVSTED enters from the hall.  She is in evening dress.\n  The door is closed behind her.\n\n\nHEDDA.\n\n[On the sofa, stretches out her arms towards her.] My sweet Thea--you\ncan't think how I have been longing for you!\n\n     [MRS. ELVSTED, in passing, exchanges slight salutations with\n       the gentlemen in the inner room, then goes up to the table\n       and gives HEDDA her hand.  EILERT LOVBORG has risen.  He and\n       MRS. ELVSTED greet each other with a silent nod.\n\n\nMRS. ELVSTED.\n\nOught I to go in and talk to your husband for a moment?\n\n\nHEDDA.\n\nOh, not at all. Leave those two alone. They will soon be going.\n\n\nMRS. ELVSTED.\n\nAre they going out?\n\n\nHEDDA.\n\nYes, to a supper-party.\n\n\nMRS. ELVSTED.\n\n[Quickly, to LOVBORG.] Not you?\n\n\nLOVBORG.\n\nNo.\n\n\nHEDDA.\n\nMr. Lovborg remains with us.\n\n\nMRS. ELVSTED.\n\n[Takes a chair and is about to seat herself at his side.] Oh, how nice\nit is here!\n\n\nHEDDA.\n\nNo, thank you, my little Thea! Not there! You'll be good enough to come\nover here to me. I will sit between you.\n\n\nMRS. ELVSTED.\n\nYes, just as you please.\n\n   [She goes round the table and seats herself on the sofa on\n       HEDDA'S right.  LOVBORG re-seats himself on his chair.\n\n\nLOVBORG.\n\n[After a short pause, to HEDDA.] Is not she lovely to look at?\n\n\nHEDDA.\n\n[Lightly stroking her hair.] Only to look at!\n\n\nLOVBORG.\n\nYes. For we two--she and I--we are two real comrades. We have absolute\nfaith in each other; so we can sit and talk with perfect frankness--\n\n\nHEDDA.\n\nNot round about, Mr. Lovborg?\n\n\nLOVBORG.\n\nWell--\n\n\nMRS. ELVSTED.\n\n[Softly clinging close to HEDDA.] Oh, how happy I am, Hedda! For only\nthink, he says I have inspired him too.\n\n\nHEDDA.\n\n[Looks at her with a smile.] Ah! Does he say that, dear?\n\n\nLOVBORG.\n\nAnd then she is so brave, Mrs. Tesman!\n\n\nMRS. ELVSTED.\n\nGood heavens--am I brave?\n\n\nLOVBORG.\n\nExceedingly--where your comrade is concerned.\n\n\nHEDDA.\n\nExceedingly--where your comrade is concerned.\n\n\nHEDDA.\n\nAh, yes--courage! If one only had that!\n\n\nLOVBORG.\n\nWhat then? What do you mean?\n\n\nHEDDA.\n\nThen life would perhaps be liveable, after all. [With a sudden change\nof tone.] But now, my dearest Thea, you really must have a glass of cold\npunch.\n\n\nMRS. ELVSTED.\n\nNo, thanks--I never take anything of that kind.\n\n\nHEDDA.\n\nWell then, you, Mr. Lovborg.\n\n\nLOVBORG.\n\nNor I, thank you.\n\n\nMRS. ELVSTED.\n\nNo, he doesn't either.\n\n\nHEDDA.\n\n[Looks fixedly at him.] But if I say you shall?\n\n\nLOVBORG.\n\nIt would be of no use.\n\n\nHEDDA.\n\n[Laughing.] Then I, poor creature, have no sort of power over you?\n\n\nLOVBORG.\n\nNot in that respect.\n\n\nHEDDA.\n\nBut seriously, I think you ought to--for your own sake.\n\n\nMRS. ELVSTED.\n\nWhy, Hedda--!\n\n\nLOVBORG.\n\nHow so?\n\n\nHEDDA.\n\nOr rather on account of other people.\n\n\nLOVBORG.\n\nIndeed?\n\n\nHEDDA.\n\nOtherwise people might be apt to suspect that--in your heart of\nhearts--you did not feel quite secure--quite confident in yourself.\n\n\nMRS. ELVSTED.\n\n[Softly.] Oh please, Hedda--!\n\nLOVBORG.\n\nPeople may suspect what they like--for the present.\n\n\nMRS. ELVSTED.\n\n[Joyfully.] Yes, let them!\n\n\nHEDDA.\n\nI saw it plainly in Judge Brack's face a moment ago.\n\n\nLOVBORG.\n\nWhat did you see?\n\n\nHEDDA.\n\nHis contemptuous smile, when you dared not go with them into the inner\nroom.\n\n\nLOVBORG.\n\nDared not? Of course I preferred to stop here and talk to you.\n\n\nMRS. ELVSTED.\n\nWhat could be more natural, Hedda?\n\n\nHEDDA.\n\nBut the Judge could not guess that. And I say, too, the way he smiled\nand glanced at Tesman when you dared not accept his invitation to this\nwretched little supper-party of his.\n\n\nLOVBORG.\n\nDared not! Do you say I dared not?\n\n\nHEDDA.\n\n_I_ don't say so. But that was how Judge Brack understood it.\n\n\nLOVBORG.\n\nWell, let him.\n\n\nHEDDA.\n\nThen you are not going with them?\n\n\nLOVBORG.\n\nI will stay here with you and Thea.\n\n\nMRS. ELVSTED.\n\nYes, Hedda--how can you doubt that?\n\n\nHEDDA.\n\n[Smiles and nods approvingly to LOVBORG.] Firm as a rock! Faithful to\nyour principles, now and for ever! Ah, that is how a man should be!\n[Turns to MRS. ELVSTED and caresses her.] Well now, what did I tell you,\nwhen you came to us this morning in such a state of distraction--\n\n\nLOVBORG.\n\n[Surprised.] Distraction!\n\n\nMRS. ELVSTED.\n\n[Terrified.] Hedda--oh Hedda--!\n\n\nHEDDA.\n\nYou can see for yourself! You haven't the slightest reason to be in such\nmortal terror-- [Interrupting herself.] There! Now we can all three\nenjoy ourselves!\n\n\nLOVBORG.\n\n[Who has given a start.] Ah--what is all this, Mrs. Tesman?\n\n\nMRS. ELVSTED.\n\nOh my God, Hedda! What are you saying? What are you doing?\n\n\nHEDDA.\n\nDon't get excited! That horrid Judge Brack is sitting watching you.\n\n\nLOVBORG.\n\nSo she was in mortal terror! On my account!\n\n\nMRS. ELVSTED.\n\n[Softly and piteously.] Oh, Hedda--now you have ruined everything!\n\n\nLOVBORG.\n\n[Looks fixedly at her for a moment. His face is distorted.] So that was\nmy comrade's frank confidence in me?\n\n\nMRS. ELVSTED.\n\n[Imploringly.] Oh, my dearest friend--only let me tell you--\n\n\nLOVBORG.\n\n[Takes one of the glasses of punch, raises it to his lips, and says in a\nlow, husky voice.] Your health, Thea!\n\n   [He empties the glass, puts it down, and takes the second.\n\n\nMRS. ELVSTED.\n\n[Softly.] Oh, Hedda, Hedda--how could you do this?\n\n\nHEDDA.\n\n_I_ do it? _I_? Are you crazy?\n\n\nLOVBORG.\n\nHere's to your health too, Mrs. Tesman. Thanks for the truth. Hurrah for\nthe truth!\n\n   [He empties the glass and is about to re-fill it.\n\n\nHEDDA.\n\n[Lays her hand on his arm.] Come, come--no more for the present.\nRemember you are going out to supper.\n\n\nMRS. ELVSTED.\n\nNo, no, no!\n\n\nHEDDA.\n\nHush! They are sitting watching you.\n\n\nLOVBORG.\n\n[Putting down the glass.] Now, Thea--tell me the truth--\n\n\nMRS. ELVSTED.\n\nYes.\n\n\nLOVBORG.\n\nDid your husband know that you had come after me?\n\n\nMRS. ELVSTED.\n\n[Wringing her hands.] Oh, Hedda--do you hear what his is asking?\n\n\nLOVBORG.\n\nWas it arranged between you and him that you were to come to town and\nlook after me? Perhaps it was the Sheriff himself that urged you to\ncome? Aha, my dear--no doubt he wanted my help in his office! Or was it\nat the card-table that he missed me?\n\n\nMRS. ELVSTED.\n\n[Softly, in agony.] Oh, Lovborg, Lovborg--!\n\n\nLOVBORG.\n\n[Seizes a glass and is on the point of filling it.] Here's a glass for\nthe old Sheriff too!\n\n\nHEDDA.\n\n[Preventing him.] No more just now. Remember, you have to read your\nmanuscript to Tesman.\n\n\nLOVBORG.\n\n[Calmly, putting down the glass.] It was stupid of me all this. Thea--to\ntake it in this way, I mean. Don't be angry with me, my dear, dear\ncomrade. You shall see--both you and the others--that if I was fallen\nonce--now I have risen again! Thanks to you, Thea.\n\n\nMRS. ELVSTED.\n\n[Radiant with joy.] Oh, heaven be praised--!\n\n     [BRACK has in the meantime looked at his watch.  He and TESMAN\n       rise and come into the drawing-room.\n\n\nBRACK.\n\n[Takes his hat and overcoat.] Well, Mrs. Tesman, our time has come.\n\n\nHEDDA.\n\nI suppose it has.\n\n\nLOVBORG.\n\n[Rising.] Mine too, Judge Brack.\n\n\nMRS. ELVSTED.\n\n[Softly and imploringly.] Oh, Lovborg, don't do it!\n\n\nHEDDA.\n\n[Pinching her arm.] They can hear you!\n\n\nMRS. ELVSTED.\n\n[With a suppressed shriek.] Ow!\n\n\nLOVBORG.\n\n[To BRACK.] You were good enough to invite me.\n\n\nJUDGE BRACK.\n\nWell, are you coming after all?\n\n\nLOVBORG.\n\nYes, many thanks.\n\n\nBRACK.\n\nI'm delighted--\n\n\nLOVBORG.\n\n[To TESMAN, putting the parcel of MS. in his pocket.] I should like to\nshow you one or two things before I send it to the printers.\n\n\nTESMAN.\n\nFancy--that will be delightful. But, Hedda dear, how is Mrs. Elvsted to\nget home? Eh?\n\n\nHEDDA.\n\nOh, that can be managed somehow.\n\n\nLOVBORG.\n\n[Looking towards the ladies.] Mrs. Elvsted? Of course, I'll come again\nand fetch her. [Approaching.] At ten or thereabouts, Mrs. Tesman? Will\nthat do?\n\n\nHEDDA.\n\nCertainly. That will do capitally.\n\n\nTESMAN.\n\nWell, then, that's all right. But you must not expect me so early,\nHedda.\n\n\nHEDDA.\n\nOh, you may stop as long--as long as ever you please.\n\n\nMRS. ELVSTED.\n\n[Trying to conceal her anxiety.] Well then, Mr. Lovborg--I shall remain\nhere until you come.\n\n\nLOVBORG.\n\n[With his hat in his hand.] Pray do, Mrs. Elvsted.\n\n\nBRACK.\n\nAnd now off goes the excursion train, gentlemen! I hope we shall have a\nlively time, as a certain fair lady puts it.\n\n\nHEDDA.\n\nAh, if only the fair lady could be present unseen--!\n\n\nBRACK.\n\nWhy unseen?\n\n\nHEDDA.\n\nIn order to hear a little of your liveliness at first hand, Judge Brack.\n\n\nBRACK.\n\n[Laughing.] I should not advise the fair lady to try it.\n\n\nTESMAN.\n\n[Also laughing.] Come, you're a nice one Hedda! Fancy that!\n\n\nBRACK.\n\nWell, good-bye, good-bye, ladies.\n\n\nLOVBORG.\n\n[Bowing.] About ten o'clock, then,\n\n   [BRACK, LOVBORG, and TESMAN go out by the hall door.  At the\n       same time, BERTA enters from the inner room with a lighted\n       lamp, which she places on the drawing-room table; she goes\n       out by the way she came.\n\n\nMRS. ELVSTED.\n\n[Who has risen and is wandering restlessly about the room.] Hedda--\nHedda--what will come of all this?\n\n\nHEDDA.\n\nAt ten o'clock--he will be here. I can see him already--with vine-leaves\nin his hair--flushed and fearless--\n\n\nMRS. ELVSTED.\n\nOh, I hope he may.\n\n\nHEDDA.\n\nAnd then, you see--then he will have regained control over himself. Then\nhe will be a free man for all his days.\n\n\nMRS. ELVSTED.\n\nOh God!--if he would only come as you see him now!\n\n\nHEDDA.\n\nHe will come as I see him--so, and not otherwise! [Rises and approaches\nTHEA.] You may doubt him as long as you please; _I_ believe in him. And\nnow we will try--\n\n\nMRS. ELVSTED.\n\nYou have some hidden motive in this, Hedda!\n\n\nHEDDA.\n\nYes, I have. I want for once in my life to have power to mould a human\ndestiny.\n\n\nMRS. ELVSTED.\n\nHave you not the power?\n\n\nHEDDA.\n\nI have not--and have never had it.\n\n\nMRS. ELVSTED.\n\nNot your husband's?\n\n\nHEDDA.\n\nDo you think that is worth the trouble? Oh, if you could only understand\nhow poor I am. And fate has made you so rich! [Clasps her passionately\nin her arms.] I think I must burn your hair off after all.\n\n\nMRS. ELVSTED.\n\nLet me go! Let me go! I am afraid of you, Hedda!\n\n\nBERTA.\n\n[In the middle doorway.] Tea is laid in the dining-room, ma'am.\n\n\nHEDDA.\n\nVery well. We are coming\n\n\nMRS. ELVSTED.\n\nNo, no, no! I would rather go home alone! At once!\n\n\nHEDDA.\n\nNonsense! First you shall have a cup of tea, you little stupid. And\nthen--at ten o'clock--Eilert Lovborg will be here--with vine-leaves in\nhis hair.\n\n   [She drags MRS. ELVSTED almost by force to the middle doorway.\n\n\n\n\nACT THIRD.\n\n\n  The room at the TESMANS'.  The curtains are drawn over the\n  middle doorway, and also over the glass door.  The lamp,\n  half turned down, and with a shade over it, is burning on\n  the table.  In the stove, the door of which stands open,\n  there has been a fire, which is now nearly burnt out.\n\n  MRS. ELVSTED, wrapped in a large shawl, and with her feet\n  upon a foot-rest, sits close to the stove, sunk back in\n  the arm-chair.  HEDDA, fully dressed, lies sleeping upon\n  the sofa, with a sofa-blanket over her.\n\n\nMRS. ELVSTED.\n\n[After a pause, suddenly sits up in her chair, and listens eagerly. Then\nshe sinks back again wearily, moaning to herself.] Not yet!--Oh God--oh\nGod--not yet!\n\n\n  BERTA slips cautiously in by the hall door.  She has a letter in\n  her hand.\n\n\nMRS. ELVSTED.\n\n[Turns and whispers eagerly.] Well--has any one come?\n\n\nBERTA.\n\n[Softly.] Yes, a girl has just brought this letter.\n\n\nMRS. ELVSTED.\n\n[Quickly, holding out her hand.] A letter! Give it to me!\n\n\nBERTA.\n\nNo, it's for Dr. Tesman, ma'am.\n\n\nMRS. ELVSTED.\n\nOh, indeed.\n\n\nBERTA.\n\nIt was Miss Tesman's servant that brought it. I'll lay it here on the\ntable.\n\n\nMRS. ELVSTED.\n\nYes, do.\n\n\nBERTA.\n\n[Laying down the letter.] I think I had better put out the lamp. It's\nsmoking.\n\n\nMRS. ELVSTED.\n\nYes, put it out. It must soon be daylight now.\n\n\nBERTA.\n\n[Putting out the lamp.] It is daylight already, ma'am.\n\n\nMRS. ELVSTED.\n\nYes, broad day! And no one come back yet--!\n\n\nBERTA.\n\nLord bless you, ma'am--I guessed how it would be.\n\n\nMRS. ELVSTED.\n\nYou guessed?\n\n\nBERTA.\n\nYes, when I saw that a certain person had come back to town--and that he\nwent off with them. For we've heard enough about that gentleman before\nnow.\n\n\nMRS. ELVSTED.\n\nDon't speak so loud. You will waken Mrs. Tesman.\n\n\nBERTA.\n\n[Looks towards the sofa and sighs.] No, no--let her sleep, poor thing.\nShan't I put some wood on the fire?\n\n\nMRS. ELVSTED.\n\nThanks, not for me.\n\n\nBERTA.\n\nOh, very well. [She goes softly out by the hall door.\n\n\nHEDDA.\n\n[Is wakened by the shutting of the door, and looks up.] What's that--?\n\n\nMRS. ELVSTED.\n\nIt was only the servant.\n\n\nHEDDA.\n\n[Looking about her.] Oh, we're here--! Yes, now I remember. [Sits erect\nupon the sofa, stretches herself, and rubs her eyes.] What o'clock is\nit, Thea?\n\n\nMRS. ELVSTED.\n\n[Looks at her watch.] It's past seven.\n\n\nHEDDA.\n\nWhen did Tesman come home?\n\n\nMRS. ELVSTED.\n\nHe has not come.\n\n\nHEDDA.\n\nNot come home yet?\n\n\nMRS. ELVSTED.\n\n[Rising.] No one has come.\n\n\nHEDDA.\n\nThink of our watching and waiting here till four in the morning--\n\n\nMRS. ELVSTED.\n\n[Wringing her hands.] And how I watched and waited for him!\n\n\nHEDDA.\n\n[Yawns, and says with her hand before her mouth.] Well well--we might\nhave spared ourselves the trouble.\n\n\nMRS. ELVSTED.\n\nDid you get a little sleep?\n\n\nHEDDA.\n\nOh yes; I believe I have slept pretty well. Have you not?\n\n\nMRS. ELVSTED.\n\nNot for a moment. I couldn't, Hedda!--not to save my life.\n\n\nHEDDA.\n\n[Rises and goes towards her.] There there there! There's nothing to be\nso alarmed about. I understand quite well what has happened.\n\n\nMRS. ELVSTED.\n\nWell, what do you think? Won't you tell me?\n\n\nHEDDA.\n\nWhy, of course it has been a very late affair at Judge Brack's--\n\n\nMRS. ELVSTED.\n\nYes, yes--that is clear enough. But all the same--\n\n\nHEDDA.\n\nAnd then, you see, Tesman hasn't cared to come home and ring us up in\nthe middle of the night. [Laughing.] Perhaps he wasn't inclined to show\nhimself either--immediately after a jollification.\n\n\nMRS. ELVSTED.\n\nBut in that case--where can he have gone?\n\n\nHEDDA.\n\nOf course he has gone to his Aunts' and slept there. They have his old\nroom ready for him.\n\n\nMRS. ELVSTED.\n\nNo, he can't be with them for a letter has just come for him from Miss\nTesman. There it lies.\n\n\nHEDDA.\n\nIndeed? [Looks at the address.] Why yes, it's addressed in Aunt Julia's\nhand. Well then, he has remained at Judge Brack's. And as for Eilert\nLovborg--he is sitting, with vine-leaves in his hair, reading his\nmanuscript.\n\n\nMRS. ELVSTED.\n\nOh, Hedda, you are just saying things you don't believe a bit.\n\n\nHEDDA.\n\nYou really are a little blockhead, Thea.\n\n\nMRS. ELVSTED.\n\nOh yes, I suppose I am.\n\n\nHEDDA.\n\nAnd how mortally tired you look.\n\n\nMRS. ELVSTED.\n\nYes, I am mortally tired.\n\n\nHEDDA.\n\nWell then, you must do as I tell you. You must go into my room and lie\ndown for a little while.\n\n\nMRS. ELVSTED.\n\nOh no, no--I shouldn't be able to sleep.\n\n\nHEDDA.\n\nI am sure you would.\n\n\nMRS. ELVSTED.\n\nWell, but you husband is certain to come soon now; and then I want to\nknow at once--\n\n\nHEDDA.\n\nI shall take care to let you know when he comes.\n\n\nMRS. ELVSTED.\n\nDo you promise me, Hedda?\n\n\nHEDDA.\n\nYes, rely upon me. Just you go in and have a sleep in the meantime.\n\n\nMRS. ELVSTED.\n\nThanks; then I'll try. [She goes off to the inner room.\n\n     [HEDDA goes up to the glass door and draws back the curtains.\n       The broad daylight streams into the room.  Then she takes a\n       little hand-glass from the writing-table, looks at herself\n       in it, and arranges her hair.  Next she goes to the hall\n       door and presses the bell-button.\n\n\n  BERTA presently appears at the hall door.\n\n\nBERTA.\n\nDid you want anything, ma'am?\n\n\nHEDDA.\n\nYes; you must put some more wood in the stove. I am shivering.\n\n\nBERTA.\n\nBless me--I'll make up the fire at once. [She rakes the embers together\nand lays a piece of wood upon them; then stops and listens.] That was a\nring at the front door, ma'am.\n\n\nHEDDA.\n\nThen go to the door. I will look after the fire.\n\n\nBERTA.\n\nIt'll soon burn up. [She goes out by the hall door.\n\n     [HEDDA kneels on the foot-rest and lays some more pieces of\n       wood in the stove.\n\n\n   After a short pause, GEORGE TESMAN enters from the hall.  He\n   steals on tiptoe towards the middle doorway and is about to\n   slip through the curtains.\n\n\nHEDDA.\n\n[At the stove, without looking up.] Good morning.\n\n\nTESMAN.\n\n[Turns.] Hedda! [Approaching her.] Good heavens--are you up so early?\nEh?\n\n\nHEDDA.\n\nYes, I am up very early this morning.\n\n\nTESMAN.\n\nAnd I never doubted you were still sound asleep! Fancy that, Hedda!\n\n\nHEDDA.\n\nDon't speak so loud. Mrs. Elvsted is resting in my room.\n\n\nTESMAN.\n\nHas Mrs. Elvsted been here all night?\n\n\nHEDDA.\n\nYes, since no one came to fetch her.\n\n\nTESMAN.\n\nAh, to be sure.\n\n\nHEDDA.\n\n[Closes the door of the stove and rises.] Well, did you enjoy yourselves\nat Judge Brack's?\n\n\nTESMAN.\n\nHave you been anxious about me? Eh?\n\n\nHEDDA.\n\nNo, I should never think of being anxious. But I asked if you had\nenjoyed yourself.\n\n\nTESMAN.\n\nOh yes,--for once in a way. Especially the beginning of the evening; for\nthen Eilert read me part of his book. We arrived more than an hour too\nearly--fancy that! And Brack had all sorts of arrangements to make--so\nEilert read to me.\n\n\nHEDDA.\n\n[Seating herself by the table on the right.] Well? Tell me then--\n\n\nTESMAN.\n\n[Sitting on a footstool near the stove.] Oh, Hedda, you can't conceive\nwhat a book that is going to be! I believe it is one of the most\nremarkable things that have ever been written. Fancy that!\n\n\nHEDDA.\n\nYes yes; I don't care about that--\n\n\nTESMAN.\n\nI must make a confession to you, Hedda. When he had finished reading--a\nhorrid feeling came over me.\n\n\nHEDDA.\n\nA horrid feeling?\n\n\nTESMAN.\n\nI felt jealous of Eilert for having had it in him to write such a book.\nOnly think, Hedda!\n\n\nHEDDA.\n\nYes, yes, I am thinking!\n\n\nTESMAN.\n\nAnd then how pitiful to think that he--with all his gifts--should be\nirreclaimable, after all.\n\n\nHEDDA.\n\nI suppose you mean that he has more courage than the rest?\n\n\nTESMAN.\n\nNo, not at all--I mean that he is incapable of taking his pleasure in\nmoderation.\n\n\nHEDDA.\n\nAnd what came of it all--in the end?\n\n\nTESMAN.\n\nWell, to tell the truth, I think it might best be described as an orgie,\nHedda.\n\n\nHEDDA.\n\nHad he vine-leaves in his hair?\n\n\nTESMAN.\n\nVine-leaves? No, I saw nothing of the sort. But he made a long, rambling\nspeech in honour of the woman who had inspired him in his work--that was\nthe phrase he used.\n\n\nHEDDA.\n\nDid he name her?\n\n\nTESMAN.\n\nNo, he didn't; but I can't help thinking he meant Mrs. Elvsted. You may\nbe sure he did.\n\n\nHEDDA.\n\nWell--where did you part from him?\n\n\nTESMAN.\n\nOn the way to town. We broke up--the last of us at any rate--all\ntogether; and Brack came with us to get a breath of fresh air. And then,\nyou see, we agreed to take Eilert home; for he had had far more than was\ngood for him.\n\n\nHEDDA.\n\nI daresay.\n\n\nTESMAN.\n\nBut now comes the strange part of it, Hedda; or, I should rather say,\nthe melancholy part of it. I declare I am almost ashamed--on Eilert's\naccount--to tell you--\n\n\nHEDDA.\n\nOh, go on--!\n\n\nTESMAN.\n\nWell, as we were getting near town, you see, I happened to drop a little\nbehind the others. Only for a minute or two--fancy that!\n\n\nHEDDA.\n\nYes yes yes, but--?\n\n\nTESMAN.\n\nAnd then, as I hurried after them--what do you think I found by the\nwayside? Eh?\n\n\nHEDDA.\n\nOh, how should I know!\n\n\nTESMAN.\n\nYou mustn't speak of it to a soul, Hedda! Do you hear! Promise me, for\nEilert's sake. [Draws a parcel, wrapped in paper, from his coat pocket.]\nFancy, dear--I found this.\n\n\nHEDDA.\n\nIs not that the parcel he had with him yesterday?\n\n\nTESMAN.\n\nYes, it is the whole of his precious, irreplaceable manuscript! And he\nhad gone and lost it, and knew nothing about it. Only fancy, Hedda! So\ndeplorably--\n\n\nHEDDA.\n\nBut why did you not give him back the parcel at once?\n\n\nTESMAN.\n\nI didn't dare to--in the state he was then in--\n\n\nHEDDA.\n\nDid you not tell any of the others that you had found it?\n\n\nTESMAN.\n\nOh, far from it! You can surely understand that, for Eilert's sake, I\nwouldn't do that.\n\n\nHEDDA.\n\nSo no one knows that Eilert Lovborg's manuscript is in your possession?\n\n\nTESMAN.\n\nNo. And no one must know it.\n\nHEDDA.\n\nThen what did you say to him afterwards?\n\n\nTESMAN.\n\nI didn't talk to him again at all; for when we got in among the streets,\nhe and two or three of the others gave us the slip and disappeared.\nFancy that!\n\n\nHEDDA.\n\nIndeed! They must have taken him home then.\n\n\nTESMAN.\n\nYes, so it would appear. And Brack, too, left us.\n\n\nHEDDA.\n\nAnd what have you been doing with yourself since?\n\n\nTESMAN.\n\nWell, I and some of the others went home with one of the party, a jolly\nfellow, and took our morning coffee with him; or perhaps I should rather\ncall it our night coffee--eh? But now, when I have rested a little, and\ngiven Eilert, poor fellow, time to have his sleep out, I must take this\nback to him.\n\n\nHEDDA.\n\n[Holds out her hand for the packet.] No--don't give it to him! Not in\nsuch a hurry, I mean. Let me read it first.\n\n\nTESMAN.\n\nNo, my dearest Hedda, I mustn't, I really mustn't.\n\n\nHEDDA.\n\nYou must not?\n\n\nTESMAN.\n\nNo--for you can imagine what a state of despair he will be in when he\nwakens and misses the manuscript. He has no copy of it, you must know!\nHe told me so.\n\n\nHEDDA.\n\n[Looking searchingly at him.] Can such a thing not be reproduced?\nWritten over again?\n\n\nTESMAN.\n\nNo, I don't think that would be possible. For the inspiration, you\nsee--\n\n\nHEDDA.\n\nYes, yes--I suppose it depends on that--[Lightly.] But, by-the-bye\n--here is a letter for you.\n\n\nTESMAN.\n\nFancy--!\n\n\nHEDDA.\n\n[Handing it to him.] It came early this morning.\n\n\nTESMAN.\n\nIt's from Aunt Julia! What can it be? [He lays the packet on the other\nfootstool, opens the letter, runs his eye through it, and jumps up.] Oh,\nHedda--she says that poor Aunt Rina is dying!\n\n\nHEDDA.\n\nWell, we were prepared for that.\n\n\nTESMAN.\n\nAnd that if I want to see her again, I must make haste. I'll run in to\nthem at once.\n\n\nHEDDA.\n\n[Suppressing a smile.] Will you run?\n\n\nTESMAN.\n\nOh, my dearest Hedda--if you could only make up your mind to come with\nme! Just think!\n\n\nHEDDA.\n\n[Rises and says wearily, repelling the idea.] No, no don't ask me. I\nwill not look upon sickness and death. I loathe all sorts of ugliness.\n\n\nTESMAN.\n\nWell, well, then--! [Bustling around.] My hat--? My overcoat--? Oh,\nin the hall--. I do hope I mayn't come too late, Hedda! Eh?\n\n\nHEDDA.\n\nOh, if you run-- [BERTA appears at the hall door.\n\n\nBERTA.\n\nJudge Brack is at the door, and wishes to know if he may come in.\n\n\nTESMAN.\n\nAt this time! No, I can't possibly see him.\n\n\nHEDDA.\n\nBut I can. [To BERTA.] Ask Judge Brack to come in. [BERTA goes out.\n\n\nHEDDA.\n\n[Quickly, whispering.] The parcel, Tesman!\n\n   [She snatches it up from the stool.\n\n\nTESMAN.\n\nYes, give it to me!\n\n\nHEDDA.\n\nNo, no, I will keep it till you come back.\n\n     [She goes to the writing-table and places it in the bookcase.\n       TESMAN stands in a flurry of haste, and cannot get his\n       gloves on.\n\n\n  JUDGE BRACK enters from the hall.\n\n\nHEDDA.\n\n[Nodding to him.] You are an early bird, I must say.\n\n\nBRACK.\n\nYes, don't you think so! [To TESMAN.] Are you on the move, too?\n\n\nTESMAN.\n\nYes, I must rush of to my aunts'. Fancy--the invalid one is lying at\ndeath's door, poor creature.\n\n\nBRACK.\n\nDear me, is she indeed? Then on no account let me detain you. At such a\ncritical moment--\n\n\nTESMAN.\n\nYes, I must really rush-- Good-bye! Good-bye!\n\n   [He hastens out by the hall door.\n\n\nHEDDA.\n\n[Approaching.] You seem to have made a particularly lively night of it\nat your rooms, Judge Brack.\n\n\nBRACK.\n\nI assure you I have not had my clothes off, Mrs. Hedda.\n\n\nHEDDA.\n\nNot you, either?\n\n\nBRACK.\n\nNo, as you may see. But what has Tesman been telling you of the night's\nadventures?\n\n\nHEDDA.\n\nOh, some tiresome story. Only that they went and had coffee somewhere or\nother.\n\n\nBRACK.\n\nI have heard about that coffee-party already. Eilert Lovborg was not\nwith them, I fancy?\n\n\nHEDDA.\n\nNo, they had taken him home before that.\n\n\nBRACK.\n\nTesman too?\n\n\nHEDDA.\n\nNo, but some of the others, he said.\n\n\nBRACK.\n\n[Smiling.] George Tesman is really an ingenuous creature, Mrs. Hedda.\n\n\nHEDDA.\n\nYes, heaven knows he is. Then is there something behind all this?\n\n\nBRACK.\n\nYes, perhaps there may be.\n\n\nHEDDA.\n\nWell then, sit down, my dear Judge, and tell your story in comfort.\n\n     [She seats herself to the left of the table.  BRACK sits near\n       her, at the long side of the table.\n\n\nHEDDA.\n\nNow then?\n\n\nBRACK.\n\nI had special reasons for keeping track of my guests--last night.\n\n\nHEDDA.\n\nOf Eilert Lovborg among the rest, perhaps?\n\n\nBRACK.\n\nFrankly, yes.\n\n\nHEDDA.\n\nNow you make me really curious--\n\n\nBRACK.\n\nDo you know where he and one or two of the others finished the night,\nMrs. Hedda?\n\n\nHEDDA.\n\nIf it is not quite unmentionable, tell me.\n\n\nBRACK.\n\nOh no, it's not at all unmentionable. Well, they put in an appearance at\na particularly animated soiree.\n\n\nHEDDA.\n\nOf the lively kind?\n\n\nBRACK.\n\nOf the very liveliest--\n\n\nHEDDA.\n\nTell me more of this, Judge Brack--\n\n\nBRACK.\n\nLovborg, as well as the others, had been invited in advance. I knew all\nabout it. But he had declined the invitation; for now, as you know, he\nhas become a new man.\n\n\nHEDDA.\n\nUp at the Elvsteds', yes. But he went after all, then?\n\n\nBRACK.\n\nWell, you see, Mrs. Hedda--unhappily the spirit moved him at my rooms\nlast evening--\n\n\nHEDDA.\n\nYes, I hear he found inspiration.\n\n\nBRACK.\n\nPretty violent inspiration. Well, I fancy that altered his purpose; for\nwe menfolk are unfortunately not always so firm in our principles as we\nought to be.\n\n\nHEDDA.\n\nOh, I am sure you are an exception, Judge Brack. But as to Lovborg--?\n\n\nBRACK.\n\nTo make a long story short--he landed at last in Mademoiselle Diana's\nrooms.\n\n\nHEDDA.\n\nMademoiselle Diana's?\n\n\nBRACK.\n\nIt was Mademoiselle Diana that was giving the soiree, to a select circle\nof her admirers and her lady friends.\n\n\nHEDDA.\n\nIs she a red-haired woman?\n\n\nBRACK.\n\nPrecisely.\n\n\nHEDDA.\n\nA sort of a--singer?\n\n\nBRACK.\n\nOh yes--in her leisure moments. And moreover a mighty huntress--of\nmen--Mrs. Hedda. You have no doubt heard of her. Eilert Lovborg was one\nof her most enthusiastic protectors--in the days of his glory.\n\n\nHEDDA.\n\nAnd how did all this end?\n\n\nBRACK.\n\nFar from amicably, it appears. After a most tender meeting, they seem to\nhave come to blows--\n\n\nHEDDA.\n\nLovborg and she?\n\n\nBRACK.\n\nYes. He accused her or her friends of having robbed him. He declared\nthat his pocket-book had disappeared--and other things as well. In\nshort, he seems to have made a furious disturbance.\n\n\nHEDDA.\n\nAnd what came of it all?\n\n\nBRACK.\n\nIt came to a general scrimmage, in which the ladies as well as the\ngentlemen took part. Fortunately the police at last appeared on the\nscene.\n\n\nHEDDA.\n\nThe police too?\n\n\nBRACK.\n\nYes. I fancy it will prove a costly frolic for Eilert Lovborg, crazy\nbeing that he is.\n\n\nHEDDA.\n\nHow so?\n\n\nBRACK.\n\nHe seems to have made a violent resistance--to have hit one of the\nconstables on the head and torn the coat off his back. So they had to\nmarch him off to the police-station with the rest.\n\n\nHEDDA.\n\nHow have you learnt all this?\n\n\nBRACK.\n\nFrom the police themselves.\n\n\nHEDDA.\n\n[Gazing straight before her.] So that is what happened. Then he had no\nvine-leaves in his hair.\n\n\nBRACK.\n\nVine-leaves, Mrs. Hedda?\n\n\nHEDDA.\n\n[Changing her tone.] But tell me now, Judge--what is your real reason\nfor tracking out Eilert Lovborg's movements so carefully?\n\n\nBRACK.\n\nIn the first place, it could not be entirely indifferent to me if it\nshould appear in the police-court that he came straight from my house.\n\n\nHEDDA.\n\nWill the matter come into court then?\n\n\nBRACK.\n\nOf course. However, I should scarcely have troubled so much about that.\nBut I thought that, as a friend of the family, it was my duty to supply\nyou and Tesman with a full account of his nocturnal exploits.\n\n\nHEDDA.\n\nWhy so, Judge Brack?\n\n\nBRACK.\n\nWhy, because I have a shrewd suspicion that he intends to use you as a\nsort of blind.\n\n\nHEDDA.\n\nOh, how can you think such a thing!\n\n\nBRACK.\n\nGood heavens, Mrs. Hedda--we have eyes in our head. Mark my words! This\nMrs. Elvsted will be in no hurry to leave town again.\n\n\nHEDDA.\n\nWell, even if there should be anything between them, I suppose there are\nplenty of other places where they could meet.\n\n\nBRACK.\n\nNot a single home. Henceforth, as before, every respectable house will\nbe closed against Eilert Lovborg.\n\n\nHEDDA.\n\nAnd so ought mine to be, you mean?\n\n\nBRACK.\n\nYes. I confess it would be more than painful to me if this personage\nwere to be made free of your house. How superfluous, how intrusive, he\nwould be, if he were to force his way into--\n\n\nHEDDA.\n\n--into the triangle?\n\n\nBRACK.\n\nPrecisely. It would simply mean that I should find myself homeless.\n\n\nHEDDA.\n\n[Looks at him with a smile.] So you want to be the one cock in the\nbasket(12)--that is your aim.\n\n\nBRACK.\n\n[Nods slowly and lowers his voice.] Yes, that is my aim. And for that I\nwill fight--with every weapon I can command.\n\n\nHEDDA.\n\n[Her smile vanishing.] I see you are a dangerous person--when it comes\nto the point.\n\n\nBRACK.\n\nDo you think so?\n\n\nHEDDA.\n\nI am beginning to think so. And I am exceedingly glad to think--that you\nhave no sort of hold over me.\n\n\nBRACK.\n\n[Laughing equivocally.] Well well, Mrs. Hedda--perhaps you are right\nthere. If I had, who knows what I might be capable of?\n\n\nHEDDA.\n\nCome come now, Judge Brack! That sounds almost like a threat.\n\n\nBRACK.\n\n[Rising.] Oh, not at all! The triangle, you know, ought, if possible, to\nbe spontaneously constructed.\n\n\nHEDDA.\n\nThere I agree with you.\n\n\nBRACK.\n\nWell, now I have said all I had to say; and I had better be getting back\nto town. Good-bye, Mrs. Hedda. [He goes towards the glass door.\n\n\nHEDDA.\n\n[Rising.] Are you going through the garden?\n\n\nBRACK.\n\nYes, it's a short cut for me.\n\n\nHEDDA.\n\nAnd then it is a back way, too.\n\n\nBRACK.\n\nQuite so. I have no objection to back ways. They may be piquant enough\nat times.\n\n\nHEDDA.\n\nWhen there is ball practice going on, you mean?\n\n\nBRACK.\n\n[In the doorway, laughing to her.] Oh, people don't shoot their tame\npoultry, I fancy.\n\n\nHEDDA.\n\n[Also laughing.] Oh no, when there is only one cock in the basket--\n\n     [They exchange laughing nods of farewell.  He goes.  She closes\n       the door behind him.\n\n     [HEDDA, who has become quite serious, stands for a moment\n       looking out.  Presently she goes and peeps through the\n       curtain over the middle doorway.  Then she goes to the\n       writing-table, takes LOVBORG'S packet out of the bookcase,\n       and is on the point of looking through its contents.  BERTA\n       is heard speaking loudly in the hall.  HEDDA turns and\n       listens.  Then she hastily locks up the packet in the drawer,\n       and lays the key on the inkstand.\n\n\n  EILERT LOVBORG, with his greatcoat on and his hat in his\n  hand, tears open the hall door.  He looks somewhat confused\n  and irritated.\n\n\nLOVBORG.\n\n[Looking towards the hall.] and I tell you I must and will come in!\nThere!\n\n     [He closes the door, turns, sees HEDDA, at once regains his self-\n       control, and bows.\n\n\nHEDDA.\n\n[At the writing-table.] Well, Mr Lovborg, this is rather a late hour to\ncall for Thea.\n\n\nLOVBORG.\n\nYou mean rather an early hour to call on you. Pray pardon me.\n\n\nHEDDA.\n\nHow do you know that she is still here?\n\n\nLOVBORG.\n\nThey told me at her lodgings that she had been out all night.\n\n\nHEDDA.\n\n[Going to the oval table.] Did you notice anything about the people of\nthe house when they said that?\n\n\nLOVBORG.\n\n[Looks inquiringly at her.] Notice anything about them?\n\n\nHEDDA.\n\nI mean, did they seem to think it odd?\n\n\nLOVBORG.\n\n[Suddenly understanding.] Oh yes, of course! I am dragging her down with\nme! However, I didn't notice anything.--I suppose Tesman is not up yet.\n\n\nHEDDA.\n\nNo--I think not--\n\n\nLOVBORG.\n\nWhen did he come home?\n\n\nHEDDA.\n\nVery late.\n\n\nLOVBORG.\n\nDid he tell you anything?\n\n\nHEDDA.\n\nYes, I gathered that you had had an exceedingly jolly evening at Judge\nBrack's.\n\n\nLOVBORG.\n\nNothing more?\n\n\nHEDDA.\n\nI don't think so. However, I was so dreadfully sleepy--\n\n\n    MRS. ELVSTED enters through the curtains of the middle doorway.\n\n\nMRS. ELVSTED.\n\n[Going towards him.] Ah, Lovborg! At last--!\n\n\nLOVBORG.\n\nYes, at last. And too late!\n\n\nMRS. ELVSTED.\n\n[Looks anxiously at him.] What is too late?\n\n\nLOVBORG.\n\nEverything is too late now. It is all over with me.\n\n\nMRS. ELVSTED.\n\nOh no, no--don't say that!\n\n\nLOVBORG.\n\nYou will say the same when you hear--\n\n\nMRS. ELVSTED.\n\nI won't hear anything!\n\n\nHEDDA.\n\nPerhaps you would prefer to talk to her alone? If so, I will leave you.\n\n\nLOVBORG.\n\nNo, stay--you too. I beg you to stay.\n\n\nMRS. ELVSTED.\n\nYes, but I won't hear anything, I tell you.\n\n\nLOVBORG.\n\nIt is not last night's adventures that I want to talk about.\n\n\nMRS. ELVSTED.\n\nWhat is it then--?\n\n\nLOVBORG.\n\nI want to say that now our ways must part.\n\n\nMRS. ELVSTED.\n\nPart!\n\n\nHEDDA.\n\n[Involuntarily.] I knew it!\n\n\nLOVBORG.\n\nYou can be of no more service to me, Thea.\n\n\nMRS. ELVSTED.\n\nHow can you stand there and say that! No more service to you! Am I not\nto help you now, as before? Are we not to go on working together?\n\n\nLOVBORG.\n\nHenceforward I shall do no work.\n\n\nMRS. ELVSTED.\n\n[Despairingly.] Then what am I to do with my life?\n\n\nLOVBORG.\n\nYou must try to live your life as if you had never know me.\n\n\nMRS. ELVSTED.\n\nBut you know I cannot do that!\n\n\nLOVBORG.\n\nTry if you cannot, Thea. You must go home again--\n\n\nMRS. ELVSTED.\n\n[In vehement protest.] Never in this world! Where you are, there will I\nbe also! I will not let myself be driven away like this! I will remain\nhere! I will be with you when the book appears.\n\n\nHEDDA.\n\n[Half aloud, in suspense.] Ah yes--the book!\n\n\nLOVBORG.\n\n[Looks at her.] My book and Thea's; for that is what it is.\n\n\nMRS. ELVSTED.\n\nYes, I feel that it is. And that is why I have a right to be with you\nwhen it appears! I will see with my own eyes how respect and honour pour\nin upon you afresh. And the happiness--the happiness--oh, I must share\nit with you!\n\n\nLOVBORG.\n\nThea--our book will never appear.\n\n\nHEDDA.\n\nAh!\n\n\nMRS. ELVSTED.\n\nNever appear!\n\n\nLOVBORG.\n\nCan never appear.\n\n\nMRS. ELVSTED.\n\n[In agonised foreboding.] Lovborg--what have you done with the\nmanuscript?\n\n\nHEDDA.\n\n[Looks anxiously at him.] Yes, the manuscript--?\n\n\nMRS. ELVSTED.\n\nWhere is it?\n\n\nLOVBORG.\n\nThe manuscript--. Well then--I have torn the manuscript into a thousand\npieces.\n\n\nMRS. ELVSTED.\n\n[Shrieks.] Oh no, no--!\n\n\nHEDDA.\n\n[Involuntarily.] But that's not--\n\n\nLOVBORG.\n\n[Looks at her.] Not true, you think?\n\n\nHEDDA.\n\n[Collecting herself.] Oh well, of course--since you say so. But it\nsounded so improbable--\n\n\nLOVBORG.\n\nIt is true, all the same.\n\n\nMRS. ELVSTED.\n\n[Wringing her hands.] Oh God--oh God, Hedda--torn his own work to\npieces!\n\n\nLOVBORG.\n\nI have torn my own life to pieces. So why should I not tear my\nlife-work too--?\n\n\nMRS. ELVSTED.\n\nAnd you did this last night?\n\n\nLOVBORG.\n\nYes, I tell you! Tore it into a thousand pieces--and scattered them on\nthe fiord--far out. There there is cool sea-water at any rate--let them\ndrift upon it--drift with the current and the wind. And then presently\nthey will sink--deeper and deeper--as I shall, Thea.\n\n\nMRS. ELVSTED.\n\nDo you know, Lovborg, that what you have done with the book--I shall\nthink of it to my dying day as though you had killed a little child.\n\n\nLOVBORG.\n\nYes, you are right. It is a sort of child-murder.\n\n\nMRS. ELVSTED.\n\nHow could you, then--! Did not the child belong to me too?\n\n\nHEDDA.\n\n[Almost inaudibly.] Ah, the child--\n\n\nMRS. ELVSTED.\n\n[Breathing heavily.] It is all over then. Well well, now I will go,\nHedda.\n\n\nHEDDA.\n\nBut you are not going away from town?\n\n\nMRS. ELVSTED.\n\nOh, I don't know what I shall do. I see nothing but darkness before me.\n[She goes out by the hall door.\n\n\nHEDDA.\n\n[Stands waiting for a moment.] So you are not going to see her home, Mr.\nLovborg?\n\n\nLOVBORG.\n\nI? Through the streets? Would you have people see her walking with me?\n\n\nHEDDA.\n\nOf course I don't know what else may have happened last night. But is it\nso utterly irretrievable?\n\n\nLOVBORG.\n\nIt will not end with last night--I know that perfectly well. And the\nthing is that now I have no taste for that sort of life either. I won't\nbegin it anew. She has broken my courage and my power of braving life\nout.\n\n\nHEDDA.\n\n[Looking straight before her.] So that pretty little fool has had her\nfingers in a man's destiny. [Looks at him.] But all the same, how could\nyou treat her so heartlessly.\n\n\nLOVBORG.\n\nOh, don't say that I was heartless!\n\n\nHEDDA.\n\nTo go and destroy what has filled her whole soul for months and years!\nYou do not call that heartless!\n\n\nLOVBORG.\n\nTo you I can tell the truth, Hedda.\n\n\nHEDDA.\n\nThe truth?\n\n\nLOVBORG.\n\nFirst promise me--give me your word--that what I now confide in you Thea\nshall never know.\n\n\nHEDDA.\n\nI give you my word.\n\n\nLOVBORG.\n\nGood. Then let me tell you that what I said just now was untrue.\n\n\nHEDDA.\n\nAbout the manuscript?\n\n\nLOVBORG.\n\nYes. I have not torn it to pieces--nor thrown it into the fiord.\n\n\nHEDDA.\n\nNo, no--. But--where is it then?\n\n\nLOVBORG.\n\nI have destroyed it none the less--utterly destroyed it, Hedda!\n\n\nHEDDA.\n\nI don't understand.\n\n\nLOVBORG.\n\nThea said that what I had done seemed to her like a child-murder.\n\n\nHEDDA.\n\nYes, so she said.\n\n\nLOVBORG.\n\nBut to kill his child--that is not the worst thing a father can do to\nit.\n\n\nHEDDA.\n\nNot the worst?\n\n\nLOVBORG.\n\nSuppose now, Hedda, that a man--in the small hours of the morning--came\nhome to his child's mother after a night of riot and debauchery, and\nsaid: \"Listen--I have been here and there--in this place and in that.\nAnd I have taken our child with--to this place and to that. And I have\nlost the child--utterly lost it. The devil knows into what hands it may\nhave fallen--who may have had their clutches on it.\"\n\n\nHEDDA.\n\nWell--but when all is said and done, you know--this was only a book--\n\n\nLOVBORG.\n\nThea's pure soul was in that book.\n\n\nHEDDA.\n\nYes, so I understand.\n\n\nLOVBORG.\n\nAnd you can understand, too, that for her and me together no future is\npossible.\n\n\nHEDDA.\n\nWhat path do you mean to take then?\n\n\nLOVBORG.\n\nNone. I will only try to make an end of it all--the sooner the better.\n\n\nHEDDA.\n\n[A step nearer him.] Eilert Lovborg--listen to me.--Will you not try\nto--to do it beautifully?\n\n\nLOVBORG.\n\nBeautifully? [Smiling.] With vine-leaves in my hair, as you used to\ndream in the old days--?\n\n\nHEDDA.\n\nNo, no. I have lost my faith in the vine-leaves. But beautifully\nnevertheless! For once in a way!--Good-bye! You must go now--and do not\ncome here any more.\n\n\nLOVBORG.\n\nGood-bye, Mrs. Tesman. And give George Tesman my love.\n\n   [He is on the point of going.\n\n\nHEDDA.\n\nNo, wait! I must give you a memento to take with you.\n\n     [She goes to the writing-table and opens the drawer and the\n       pistol-case; then returns to LOVBORG with one of the pistols.\n\n\nLOVBORG.\n\n[Looks at her.] This? Is this the memento?\n\n\nHEDDA.\n\n[Nodding slowly.] Do you recognise it? It was aimed at you once.\n\n\nLOVBORG.\n\nYou should have used it then.\n\n\nHEDDA.\n\nTake it--and do you use it now.\n\n\nLOVBORG.\n\n[Puts the pistol in his breast pocket.] Thanks!\n\n\nHEDDA.\n\nAnd beautifully, Eilert Lovborg. Promise me that!\n\n\nLOVBORG.\n\nGood-bye, Hedda Gabler. [He goes out by the hall door.\n\n     [HEDDA listens for a moment at the door.  Then she goes up to\n       the writing-table, takes out the packet of manuscript, peeps\n       under the cover, draws a few of the sheets half out, and\n       looks at them.  Next she goes over and seats herself in the\n       arm-chair beside the stove, with the packet in her lap.\n       Presently she opens the stove door, and then the packet.\n\n\nHEDDA.\n\n[Throws one of the quires into the fire and whispers to herself.] Now I\nam burning your child, Thea!--Burning it, curly-locks! [Throwing one\nor two more quires into the stove.] Your child and Eilert Lovborg's.\n[Throws the rest in.] I am burning--I am burning your child.\n\n\n\n\nACT FOURTH.\n\n  The same rooms at the TESMANS'.  It is evening.  The drawing-\n  room is in darkness.  The back room is light by the hanging\n  lamp over the table.  The curtains over the glass door are\n  drawn close.\n\n  HEDDA, dressed in black, walks to and fro in the dark room.\n  Then she goes into the back room and disappears for a moment\n  to the left.  She is heard to strike a few chords on the\n  piano.  Presently she comes in sight again, and returns to\n  the drawing-room.\n\n  BERTA enters from the right, through the inner room, with a\n  lighted lamp, which she places on the table in front of the\n  corner settee in the drawing-room.  Her eyes are red with\n  weeping, and she has black ribbons in her cap.  She goes\n  quietly and circumspectly out to the right.  HEDDA goes up\n  to the glass door, lifts the curtain a little aside, and\n  looks out into the darkness.\n\n  Shortly afterwards, MISS TESMAN, in mourning, with a bonnet\n  and veil on, comes in from the hall.  HEDDA goes towards her\n  and holds out her hand.\n\n\nMISS TESMAN.\n\nYes, Hedda, here I am, in mourning and forlorn; for now my poor sister\nhas at last found peace.\n\n\nHEDDA.\n\nI have heard the news already, as you see. Tesman sent me a card.\n\n\nMISS TESMAN.\n\nYes, he promised me he would. But nevertheless I thought that to\nHedda--here in the house of life--I ought myself to bring the tidings of\ndeath.\n\n\nHEDDA.\n\nThat was very kind of you.\n\n\nMISS TESMAN.\n\nAh, Rina ought not to have left us just now. This is not the time for\nHedda's house to be a house of mourning.\n\n\nHEDDA.\n\n[Changing the subject.] She died quite peacefully, did she not, Miss\nTesman?\n\n\nMISS TESMAN.\n\nOh, her end was so calm, so beautiful. And then she had the unspeakable\nhappiness of seeing George once more--and bidding him good-bye.--Has he\nnot come home yet?\n\n\nHEDDA.\n\nNo. He wrote that he might be detained. But won't you sit down?\n\n\nMISS TESMAN.\n\nNo thank you, my dear, dear Hedda. I should like to, but I have so much\nto do. I must prepare my dear one for her rest as well as I can. She\nshall go to her grave looking her best.\n\n\nHEDDA.\n\nCan I not help you in any way?\n\n\nMISS TESMAN.\n\nOh, you must not think of it! Hedda Tesman must have no hand in such\nmournful work. Nor let her thought dwell on it either--not at this time.\n\n\nHEDDA.\n\nOne is not always mistress of one's thoughts--\n\n\nMISS TESMAN.\n\n[Continuing.] Ah yes, it is the way of the world. At home we shall be\nsewing a shroud; and here there will soon be sewing too, I suppose--but\nof another sort, thank God!\n\n\n  GEORGE TESMAN enters by the hall door.\n\n\nHEDDA.\n\nAh, you have come at last!\n\n\nTESMAN.\n\nYou here, Aunt Julia? With Hedda? Fancy that!\n\n\nMISS TESMAN.\n\nI was just going, my dear boy. Well, have you done all you promised?\n\n\nTESMAN.\n\nNo; I'm really afraid I have forgotten half of it. I must come to you\nagain to-morrow. To-day my brain is all in a whirl. I can't keep my\nthoughts together.\n\n\nMISS TESMAN.\n\nWhy, my dear George, you mustn't take it in this way.\n\n\nTESMAN.\n\nMustn't--? How do you mean?\n\n\nMISS TESMAN.\n\nEven in your sorrow you must rejoice, as I do--rejoice that she is at\nrest.\n\n\nTESMAN.\n\nOh yes, yes--you are thinking of Aunt Rina.\n\n\nHEDDA.\n\nYou will feel lonely now, Miss Tesman.\n\n\nMISS TESMAN.\n\nJust at first, yes. But that will not last very long, I hope. I daresay\nI shall soon find an occupant for Rina's little room.\n\n\nTESMAN.\n\nIndeed? Who do you think will take it? Eh?\n\n\nMISS TESMAN.\n\nOh, there's always some poor invalid or other in want of nursing,\nunfortunately.\n\n\nHEDDA.\n\nWould you really take such a burden upon you again?\n\n\nMISS TESMAN.\n\nA burden! Heaven forgive you, child--it has been no burden to me.\n\n\nHEDDA.\n\nBut suppose you had a total stranger on your hands--\n\n\nMISS TESMAN.\n\nOh, one soon makes friends with sick folk; and it's such an absolute\nnecessity for me to have some one to live for. Well, heaven be praised,\nthere may soon be something in this house, too, to keep an old aunt\nbusy.\n\n\nHEDDA.\n\nOh, don't trouble about anything here.\n\n\nTESMAN.\n\nYes, just fancy what a nice time we three might have together, if--?\n\n\nHEDDA.\n\nIf--?\n\n\nTESMAN.\n\n[Uneasily.] Oh nothing. It will all come right. Let us hope so--eh?\n\n\nMISS TESMAN.\n\nWell well, I daresay you two want to talk to each other. [Smiling.] And\nperhaps Hedda may have something to tell you too, George. Good-bye! I\nmust go home to Rina. [Turning at the door.] How strange it is to think\nthat now Rina is with me and with my poor brother as well!\n\n\nTESMAN.\n\nYes, fancy that, Aunt Julia! Eh?\n\n   [MISS TESMAN goes out by the hall door.\n\n\nHEDDA.\n\n[Follows TESMAN coldly and searchingly with her eyes.] I almost believe\nyour Aunt Rina's death affects you more than it does your Aunt Julia.\n\n\nTESMAN.\n\nOh, it's not that alone. It's Eilert I am so terribly uneasy about.\n\n\nHEDDA.\n\n[Quickly.] Is there anything new about him?\n\n\nTESMAN.\n\nI looked in at his rooms this afternoon, intending to tell him the\nmanuscript was in safe keeping.\n\n\nHEDDA.\n\nWell, did you find him?\n\n\nTESMAN.\n\nNo. He wasn't at home. But afterwards I met Mrs. Elvsted, and she told\nme that he had been here early this morning.\n\n\nHEDDA.\n\nYes, directly after you had gone.\n\n\nTESMAN.\n\nAnd he said that he had torn his manuscript to pieces--eh?\n\n\nHEDDA.\n\nYes, so he declared.\n\n\nTESMAN.\n\nWhy, good heavens, he must have been completely out of his mind! And I\nsuppose you thought it best not to give it back to him, Hedda?\n\n\nHEDDA.\n\nNo, he did not get it.\n\n\nTESMAN.\n\nBut of course you told him that we had it?\n\n\nHEDDA.\n\nNo. [Quickly.] Did you tell Mrs. Elvsted?\n\n\nTESMAN.\n\nNo; I thought I had better not. But you ought to have told him. Fancy,\nif, in desperation, he should go and do himself some injury! Let me have\nthe manuscript, Hedda! I will take it to him at once. Where is it?\n\n\nHEDDA.\n\n[Cold and immovable, leaning on the arm-chair.] I have not got it.\n\n\nTESMAN.\n\nHave not got it? What in the world do you mean?\n\n\nHEDDA.\n\nI have burnt it--every line of it.\n\n\nTESMAN.\n\n[With a violent movement of terror.] Burnt! Burnt Eilert's manuscript!\n\n\nHEDDA.\n\nDon't scream so. The servant might hear you.\n\n\nTESMAN.\n\nBurnt! Why, good God--! No, no, no! It's impossible!\n\n\nHEDDA.\n\nIt is so, nevertheless.\n\n\nTESMAN.\n\nDo you know what you have done, Hedda? It's unlawful appropriation of\nlost property. Fancy that! Just ask Judge Brack, and he'll tell you what\nit is.\n\n\nHEDDA.\n\nI advise you not to speak of it--either to Judge Brack or to anyone\nelse.\n\n\nTESMAN.\n\nBut how could you do anything so unheard-of? What put it into your head?\nWhat possessed you? Answer me that--eh?\n\n\nHEDDA.\n\n[Suppressing an almost imperceptible smile.] I did it for your sake,\nGeorge.\n\n\nTESMAN.\n\nFor my sake!\n\n\nHEDDA.\n\nThis morning, when you told me about what he had read to you--\n\n\nTESMAN.\n\nYes yes--what then?\n\n\nHEDDA.\n\nYou acknowledged that you envied him his work.\n\n\nTESMAN.\n\nOh, of course I didn't mean that literally.\n\n\nHEDDA.\n\nNo matter--I could not bear the idea that any one should throw you into\nthe shade.\n\n\nTESMAN.\n\n[In an outburst of mingled doubt and joy.] Hedda! Oh, is this true?\nBut--but--I never knew you show your love like that before. Fancy that!\n\n\nHEDDA.\n\nWell, I may as well tell you that--just at this time-- [Impatiently\nbreaking off.] No, no; you can ask Aunt Julia. She well tell you, fast\nenough.\n\n\nTESMAN.\n\nOh, I almost think I understand you, Hedda! [Clasps his hands together.]\nGreat heavens! do you really mean it! Eh?\n\n\nHEDDA.\n\nDon't shout so. The servant might hear.\n\n\nTESMAN.\n\n[Laughing in irrepressible glee.] The servant! Why, how absurd you are,\nHedda. It's only my old Berta! Why, I'll tell Berta myself.\n\n\nHEDDA.\n\n[Clenching her hands together in desperation.] Oh, it is killing me,\n--it is killing me, all this!\n\n\nTESMAN.\n\nWhat is, Hedda? Eh?\n\n\nHEDDA.\n\n[Coldly, controlling herself.] All this--absurdity--George.\n\n\nTESMAN.\n\nAbsurdity! Do you see anything absurd in my being overjoyed at the news!\nBut after all--perhaps I had better not say anything to Berta.\n\n\nHEDDA.\n\nOh--why not that too?\n\n\nTESMAN.\n\nNo, no, not yet! But I must certainly tell Aunt Julia. And then that you\nhave begun to call me George too! Fancy that! Oh, Aunt Julia will be so\nhappy--so happy!\n\n\nHEDDA.\n\nWhen she hears that I have burnt Eilert Lovborg's manuscript--for your\nsake?\n\n\nTESMAN.\n\nNo, by-the-bye--that affair of the manuscript--of course nobody must\nknow about that. But that you love me so much,(13) Hedda--Aunt Julia\nmust really share my joy in that! I wonder, now, whether this sort of\nthing is usual in young wives? Eh?\n\n\nHEDDA.\n\nI think you had better ask Aunt Julia that question too.\n\n\nTESMAN.\n\nI will indeed, some time or other. [Looks uneasy and downcast again.]\nAnd yet the manuscript--the manuscript! Good God! it is terrible to\nthink what will become of poor Eilert now.\n\n\n  MRS. ELVSTED, dressed as in the first Act, with hat and cloak,\n  enters by the hall door.\n\n\nMRS. ELVSTED.\n\n[Greets them hurriedly, and says in evident agitation.] Oh, dear Hedda,\nforgive my coming again.\n\n\nHEDDA.\n\nWhat is the matter with you, Thea?\n\n\nTESMAN.\n\nSomething about Eilert Lovborg again--eh?\n\n\nMRS. ELVSTED.\n\nYes! I am dreadfully afraid some misfortune has happened to him.\n\n\nHEDDA.\n\n[Seized her arm.] Ah,--do you think so?\n\n\nTESMAN.\n\nWhy, good Lord--what makes you think that, Mrs. Elvsted?\n\n\nMRS. ELVSTED.\n\nI heard them talking of him at my boarding-house--just as I came in. Oh,\nthe most incredible rumours are afloat about him to-day.\n\n\nTESMAN.\n\nYes, fancy, so I heard too! And I can bear witness that he went straight\nhome to bed last night. Fancy that!\n\n\nHEDDA.\n\nWell, what did they say at the boarding-house?\n\n\nMRS. ELVSTED.\n\nOh, I couldn't make out anything clearly. Either they knew nothing\ndefinite, or else--. They stopped talking when the saw me; and I did\nnot dare to ask.\n\n\nTESMAN.\n\n[Moving about uneasily.] We must hope--we must hope that you\nmisunderstood them, Mrs. Elvsted.\n\n\nMRS. ELVSTED.\n\nNo, no; I am sure it was of him they were talking. And I heard something\nabout the hospital or--\n\n\nTESMAN.\n\nThe hospital?\n\n\nHEDDA.\n\nNo--surely that cannot be!\n\n\nMRS. ELVSTED.\n\nOh, I was in such mortal terror! I went to his lodgings and asked for\nhim there.\n\n\nHEDDA.\n\nYou could make up your mind to that, Thea!\n\n\nMRS. ELVSTED.\n\nWhat else could I do? I really could bear the suspense no longer.\n\n\nTESMAN.\n\nBut you didn't find him either--eh?\n\n\nMRS. ELVSTED.\n\nNo. And the people knew nothing about him. He hadn't been home since\nyesterday afternoon, they said.\n\n\nTESMAN.\n\nYesterday! Fancy, how could they say that?\n\n\nMRS. ELVSTED.\n\nOh, I am sure something terrible must have happened to him.\n\n\nTESMAN.\n\nHedda dear--how would it be if I were to go and make inquiries--?\n\n\nHEDDA.\n\nNo, no--don't you mix yourself up in this affair.\n\n\n  JUDGE BRACK, with his hat in his hand, enters by the hall\n  door, which BERTA opens, and closes behind him.  He looks\n  grave and bows in silence.\n\n\nTESMAN.\n\nOh, is that you, my dear Judge? Eh?\n\n\nBRACK.\n\nYes. It was imperative I should see you this evening.\n\n\nTESMAN.\n\nI can see you have heard the news about Aunt Rina?\n\n\nBRACK.\n\nYes, that among other things.\n\n\nTESMAN.\n\nIsn't it sad--eh?\n\n\nBRACK.\n\nWell, my dear Tesman, that depends on how you look at it.\n\n\nTESMAN.\n\n[Looks doubtfully at him.] Has anything else happened?\n\n\nBRACK.\n\nYes.\n\n\nHEDDA.\n\n[In suspense.] Anything sad, Judge Brack?\n\n\nBRACK.\n\nThat, too, depends on how you look at it, Mrs. Tesman.\n\n\nMRS. ELVSTED.\n\n[Unable to restrain her anxiety.] Oh! it is something about Eilert\nLovborg!\n\n\nBRACK.\n\n[With a glance at her.] What makes you think that, Madam? Perhaps you\nhave already heard something--?\n\n\nMRS. ELVSTED.\n\n[In confusion.] No, nothing at all, but--\n\n\nTESMAN.\n\nOh, for heaven's sake, tell us!\n\n\nBRACK.\n\n[Shrugging his shoulders.] Well, I regret to say Eilert Lovborg has been\ntaken to the hospital. He is lying at the point of death.\n\n\nMRS. ELVSTED.\n\n[Shrieks.] Oh God! oh God--!\n\n\nTESMAN.\n\nTo the hospital! And at the point of death!\n\n\nHEDDA.\n\n[Involuntarily.] So soon then--\n\n\nMRS. ELVSTED.\n\n[Wailing.] And we parted in anger, Hedda!\n\n\nHEDDA.\n\n[Whispers.] Thea--Thea--be careful!\n\n\nMRS. ELVSTED.\n\n[Not heeding her.] I must go to him! I must see him alive!\n\n\nBRACK.\n\nIt is useless, Madam. No one will be admitted.\n\n\nMRS. ELVSTED.\n\nOh, at least tell me what has happened to him? What is it?\n\n\nTESMAN.\n\nYou don't mean to say that he has himself-- Eh?\n\n\nHEDDA.\n\nYes, I am sure he has.\n\n\nBRACK.\n\n[Keeping his eyes fixed upon her.] Unfortunately you have guessed quite\ncorrectly, Mrs. Tesman.\n\n\nMRS. ELVSTED.\n\nOh, how horrible!\n\n\nTESMAN.\n\nHimself, then! Fancy that!\n\n\nHEDDA.\n\nShot himself!\n\n\nBRACK.\n\nRightly guessed again, Mrs. Tesman.\n\n\nMRS. ELVSTED.\n\n[With an effort at self-control.] When did it happen, Mr. Brack?\n\n\nBRACK.\n\nThis afternoon--between three and four.\n\n\nTESMAN.\n\nBut, good Lord, where did he do it? Eh?\n\n\nBRACK.\n\n[With some hesitation.] Where? Well--I suppose at his lodgings.\n\n\nMRS. ELVSTED.\n\nNo, that cannot be; for I was there between six and seven.\n\n\nBRACK.\n\nWell then, somewhere else. I don't know exactly. I only know that he was\nfound--. He had shot himself--in the breast.\n\n\nMRS. ELVSTED.\n\nOh, how terrible! That he should die like that!\n\n\nHEDDA.\n\n[To BRACK.] Was it in the breast?\n\n\nBRACK.\n\nYes--as I told you.\n\n\nHEDDA.\n\nNot in the temple?\n\n\nBRACK.\n\nIn the breast, Mrs. Tesman.\n\n\nHEDDA.\n\nWell, well--the breast is a good place, too.\n\n\nBRACK.\n\nHow do you mean, Mrs. Tesman?\n\n\nHEDDA.\n\n[Evasively.] Oh, nothing--nothing.\n\n\nTESMAN.\n\nAnd the wound is dangerous, you say--eh?\n\n\nBRACK.\n\nAbsolutely mortal. The end has probably come by this time.\n\n\nMRS. ELVSTED.\n\nYes, yes, I feel it. The end! The end! Oh, Hedda--!\n\n\nTESMAN.\n\nBut tell me, how have you learnt all this?\n\n\nBRACK.\n\n[Curtly.] Through one of the police. A man I had some business with.\n\n\nHEDDA.\n\n[In a clear voice.] At last a deed worth doing!\n\n\nTESMAN.\n\n[Terrified.] Good heavens, Hedda! what are you saying?\n\n\nHEDDA.\n\nI say there is beauty in this.\n\n\nBRACK.\n\nH'm, Mrs. Tesman--\n\n\nMRS. ELVSTED.\n\nOh, Hedda, how can you talk of beauty in such an act!\n\n\nHEDDA.\n\nEilert Lovborg has himself made up his account with life. He has had the\ncourage to do--the one right thing.\n\n\nMRS. ELVSTED.\n\nNo, you must never think that was how it happened! It must have been in\ndelirium that he did it.\n\n\nTESMAN.\n\nIn despair!\n\n\nHEDDA.\n\nThat he did not. I am certain of that.\n\n\nMRS. ELVSTED.\n\nYes, yes! In delirium! Just as when he tore up our manuscript.\n\n\nBRACK.\n\n[Starting.] The manuscript? Has he torn that up?\n\n\nMRS. ELVSTED.\n\nYes, last night.\n\n\nTESMAN.\n\n[Whispers softly.] Oh, Hedda, we shall never get over this.\n\n\nBRACK.\n\nH'm, very extraordinary.\n\n\nTESMAN.\n\n[Moving about the room.] To think of Eilert going out of the world\nin this way! And not leaving behind him the book that would have\nimmortalised his name--\n\n\nMRS. ELVSTED.\n\nOh, if only it could be put together again!\n\n\nTESMAN.\n\nYes, if it only could! I don't know what I would not give--\n\n\nMRS. ELVSTED.\n\nPerhaps it can, Mr. Tesman.\n\n\nTESMAN.\n\nWhat do you mean?\n\n\nMRS. ELVSTED.\n\n[Searches in the pocket of her dress.] Look here. I have kept all the\nloose notes he used to dictate from.\n\n\nHEDDA.\n\n[A step forward.] Ah--!\n\n\nTESMAN.\n\nYou have kept them, Mrs. Elvsted! Eh?\n\n\nMRS. ELVSTED.\n\nYes, I have them here. I put them in my pocket when I left home. Here\nthey still are--\n\n\nTESMAN.\n\nOh, do let me see them!\n\n\nMRS. ELVSTED.\n\n[Hands him a bundle of papers.] But they are in such disorder--all mixed\nup.\n\n\nTESMAN.\n\nFancy, if we could make something out of them, after all! Perhaps if we\ntwo put our heads together--\n\n\nMRS. ELVSTED.\n\nOh yes, at least let us try--\n\n\nTESMAN.\n\nWe will manage it! We must! I will dedicate my life to this task.\n\n\nHEDDA.\n\nYou, George? Your life?\n\n\nTESMAN.\n\nYes, or rather all the time I can spare. My own collections must wait in\nthe meantime. Hedda--you understand, eh? I owe this to Eilert's memory.\n\n\nHEDDA.\n\nPerhaps.\n\n\nTESMAN.\n\nAnd so, my dear Mrs. Elvsted, we will give our whole minds to it. There\nis no use in brooding over what can't be undone--eh? We must try to\ncontrol our grief as much as possible, and--\n\n\nMRS. ELVSTED.\n\nYes, yes, Mr. Tesman, I will do the best I can.\n\n\nTESMAN.\n\nWell then, come here. I can't rest until we have looked through the\nnotes. Where shall we sit? Here? No, in there, in the back room. Excuse\nme, my dear Judge. Come with me, Mrs. Elvsted.\n\n\nMRS. ELVSTED.\n\nOh, if only it were possible!\n\n     [TESMAN and MRS. ELVSTED go into the back room.  She takes\n       off her hat and cloak.  They both sit at the table under the\n       hanging lamp, and are soon deep in an eager examination of\n       the papers.  HEDDA crosses to the stove and sits in the arm-\n       chair.  Presently BRACK goes up to her.\n\n\nHEDDA.\n\n[In a low voice.] Oh, what a sense of freedom it gives one, this act of\nEilert Lovborg's.\n\n\nBRACK.\n\nFreedom, Mrs. Hedda? Well, of course, it is a release for him--\n\n\nHEDDA.\n\nI mean for me. It gives me a sense of freedom to know that a deed\nof deliberate courage is still possible in this world,--a deed of\nspontaneous beauty.\n\n\nBRACK.\n\n[Smiling.] H'm--my dear Mrs. Hedda--\n\n\nHEDDA.\n\nOh, I know what you are going to say. For you are a kind of specialist\ntoo, like--you know!\n\n\nBRACK.\n\n[Looking hard at her.] Eilert Lovborg was more to you than perhaps you\nare willing to admit to yourself. Am I wrong?\n\n\nHEDDA.\n\nI don't answer such questions. I only know that Eilert Lovborg has had\nthe courage to live his life after his own fashion. And then--the last\ngreat act, with its beauty! Ah! that he should have the will and the\nstrength to turn away from the banquet of life--so early.\n\n\nBRACK.\n\nI am sorry, Mrs. Hedda,--but I fear I must dispel an amiable illusion.\n\n\nHEDDA.\n\nIllusion?\n\n\nBRACK.\n\nWhich could not have lasted long in any case.\n\n\nHEDDA.\n\nWhat do you mean?\n\n\nBRACK.\n\nEilert Lovborg did not shoot himself--voluntarily.\n\n\nHEDDA.\n\nNot voluntarily?\n\n\nBRACK.\n\nNo. The thing did not happen exactly as I told it.\n\n\nHEDDA.\n\n[In suspense.] Have you concealed something? What is it?\n\n\nBRACK.\n\nFor poor Mrs. Elvsted's sake I idealised the facts a little.\n\n\nHEDDA.\n\nWhat are the facts?\n\n\nBRACK.\n\nFirst, that he is already dead.\n\n\nHEDDA.\n\nAt the hospital?\n\n\nBRACK.\n\nYes--without regaining consciousness.\n\n\nHEDDA.\n\nWhat more have you concealed?\n\n\nBRACK.\n\nThis--the event did not happen at his lodgings.\n\n\nHEDDA.\n\nOh, that can make no difference.\n\n\nBRACK.\n\nPerhaps it may. For I must tell you--Eilert Lovborg was found shot\nin--in Mademoiselle Diana's boudoir.\n\n\nHEDDA.\n\n[Makes a motion as if to rise, but sinks back again.] That is\nimpossible, Judge Brack! He cannot have been there again to-day.\n\n\nBRACK.\n\nHe was there this afternoon. He went there, he said, to demand the\nreturn of something which they had taken from him. Talked wildly about a\nlost child--\n\n\nHEDDA.\n\nAh--so that is why--\n\n\nBRACK.\n\nI thought probably he meant his manuscript; but now I hear he destroyed\nthat himself. So I suppose it must have been his pocket-book.\n\n\nHEDDA.\n\nYes, no doubt. And there--there he was found?\n\n\nBRACK.\n\nYes, there. With a pistol in his breast-pocket, discharged. The ball had\nlodged in a vital part.\n\n\nHEDDA.\n\nIn the breast--yes?\n\n\nBRACK.\n\nNo--in the bowels.\n\n\nHEDDA.\n\n[Looks up at him with an expression of loathing.] That too! Oh, what\ncurse is it that makes everything I touch turn ludicrous and mean?\n\n\nBRACK.\n\nThere is one point more, Mrs. Hedda--another disagreeable feature in the\naffair.\n\n\nHEDDA.\n\nAnd what is that?\n\n\nBRACK.\n\nThe pistol he carried--\n\n\nHEDDA.\n\n[Breathless.] Well? What of it?\n\n\nBRACK.\n\nHe must have stolen it.\n\n\nHEDDA.\n\n[Leaps up.] Stolen it! That is not true! He did not steal it!\n\n\nBRACK.\n\nNo other explanation is possible. He must have stolen it--. Hush!\n\n\n  TESMAN and MRS. ELVSTED have risen from the table in the back-\n  room, and come into the drawing-room.\n\n\nTESMAN.\n\n[With the papers in both his hands.] Hedda, dear, it is almost\nimpossible to see under that lamp. Think of that!\n\n\nHEDDA.\n\nYes, I am thinking.\n\n\nTESMAN.\n\nWould you mind our sitting at you writing-table--eh?\n\n\nHEDDA.\n\nIf you like. [Quickly.] No, wait! Let me clear it first!\n\n\nTESMAN.\n\nOh, you needn't trouble, Hedda. There is plenty of room.\n\n\nHEDDA.\n\nNo no, let me clear it, I say! I will take these things in and put them\non the piano. There!\n\n     [She has drawn out an object, covered with sheet music, from\n       under the bookcase, places several other pieces of music upon\n       it, and carries the whole into the inner room, to the left.\n       TESMAN lays the scraps of paper on the writing-table, and moves\n       the lamp there from the corner table.  He and Mrs. Elvsted sit\n       down and proceed with their work.  HEDDA returns.\n\n\nHEDDA.\n\n[Behind Mrs. Elvsted's chair, gently ruffling her hair.] Well, my sweet\nThea,--how goes it with Eilert Lovborg's monument?\n\n\nMRS. ELVSTED.\n\n[Looks dispiritedly up at her.] Oh, it will be terribly hard to put in\norder.\n\n\nTESMAN.\n\nWe must manage it. I am determined. And arranging other people's papers\nis just the work for me.\n\n     [HEDDA goes over to the stove, and seats herself on one of the\n       footstools.  BRACK stands over her, leaning on the arm-chair.\n\n\nHEDDA.\n\n[Whispers.] What did you say about the pistol?\n\n\nBRACK.\n\n[Softly.] That he must have stolen it.\n\n\nHEDDA.\n\nWhy stolen it?\n\n\nBRACK.\n\nBecause every other explanation ought to be impossible, Mrs. Hedda.\n\n\nHEDDA.\n\nIndeed?\n\n\nBRACK.\n\n[Glances at her.] Of course Eilert Lovborg was here this morning. Was he\nnot?\n\n\nHEDDA.\n\nYes.\n\n\nBRACK.\n\nWere you alone with him?\n\n\nHEDDA.\n\nPart of the time.\n\n\nBRACK.\n\nDid you not leave the room whilst he was here?\n\n\nHEDDA.\n\nNo.\n\n\nBRACK.\n\nTry to recollect. Were you not out of the room a moment?\n\n\nHEDDA.\n\nYes, perhaps just a moment--out in the hall.\n\n\nBRACK.\n\nAnd where was you pistol-case during that time?\n\n\nHEDDA.\n\nI had it locked up in--\n\n\nBRACK.\n\nWell, Mrs. Hedda?\n\n\nHEDDA.\n\nThe case stood there on the writing-table.\n\n\nBRACK.\n\nHave you looked since, to see whether both the pistols are there?\n\n\nHEDDA.\n\nNo.\n\n\nBRACK.\n\nWell, you need not. I saw the pistol found in Lovborg's pocket, and I\nknew it at once as the one I had seen yesterday--and before, too.\n\n\nHEDDA.\n\nHave you it with you?\n\n\nBRACK.\n\nNo; the police have it.\n\n\nHEDDA.\n\nWhat will the police do with it?\n\n\nBRACK.\n\nSearch till they find the owner.\n\n\nHEDDA.\n\nDo you think they will succeed?\n\n\nBRACK.\n\n[Bends over her and whispers.] No, Hedda Gabler--not so long as I say\nnothing.\n\n\nHEDDA.\n\n[Looks frightened at him.] And if you do not say nothing,--what then?\n\n\nBRACK.\n\n[Shrugs his shoulders.] There is always the possibility that the pistol\nwas stolen.\n\n\nHEDDA.\n\n[Firmly.] Death rather than that.\n\n\nBRACK.\n\n[Smiling.] People say such things--but they don't do them.\n\n\nHEDDA.\n\n[Without replying.] And supposing the pistol was not stolen, and the\nowner is discovered? What then?\n\n\nBRACK.\n\nWell, Hedda--then comes the scandal!\n\n\nHEDDA.\n\nThe scandal!\n\n\nBRACK.\n\nYes, the scandal--of which you are so mortally afraid. You will, of\ncourse, be brought before the court--both you and Mademoiselle Diana.\nShe will have to explain how the thing happened--whether it was an\naccidental shot or murder. Did the pistol go off as he was trying to\ntake it out of his pocket, to threaten her with? Or did she tear the\npistol out of his hand, shoot him, and push it back into his pocket?\nThat would be quite like her; for she is an able-bodied young person,\nthis same Mademoiselle Diana.\n\n\nHEDDA.\n\nBut _I_ have nothing to do with all this repulsive business.\n\n\nBRACK.\n\nNo. But you will have to answer the question: Why did you give Eilert\nthe pistol? And what conclusions will people draw from the fact that you\ndid give it to him?\n\n\nHEDDA.\n\n[Lets her head sink.] That is true. I did not think of that.\n\n\nBRACK.\n\nWell, fortunately, there is no danger, so long as I say nothing.\n\n\nHEDDA.\n\n[Looks up at him.] So I am in your power, Judge Brack. You have me at\nyour beck and call, from this time forward.\n\n\nBRACK.\n\n[Whispers softly.] Dearest Hedda--believe me--I shall not abuse my\nadvantage.\n\n\nHEDDA.\n\nI am in your power none the less. Subject to your will and your demands.\nA slave, a slave then! [Rises impetuously.] No, I cannot endure the\nthought of that! Never!\n\n\nBRACK.\n\n[Looks half-mockingly at her.] People generally get used to the\ninevitable.\n\n\nHEDDA.\n\n[Returns his look.] Yes, perhaps. [She crosses to the writing-table.\nSuppressing an involuntary smile, she imitates TESMAN'S intonations.]\nWell? Are you getting on, George? Eh?\n\n\nTESMAN.\n\nHeaven knows, dear. In any case it will be the work of months.\n\n\nHEDDA.\n\n[As before.] Fancy that! [Passes her hands softly through Mrs. Elvsted's\nhair.] Doesn't it seem strange to you, Thea? Here are you sitting with\nTesman--just as you used to sit with Eilert Lovborg?\n\n\nMRS. ELVSTED.\n\nAh, if I could only inspire your husband in the same way!\n\n\nHEDDA.\n\nOh, that will come too--in time.\n\n\nTESMAN.\n\nYes, do you know, Hedda--I really think I begin to feel something of the\nsort. But won't you go and sit with Brack again?\n\n\nHEDDA.\n\nIs there nothing I can do to help you two?\n\n\nTESMAN.\n\nNo, nothing in the world. [Turning his head.] I trust to you to keep\nHedda company, my dear Brack.\n\n\nBRACK.\n\n[With a glance at HEDDA.] With the very greatest of pleasure.\n\n\nHEDDA.\n\nThanks. But I am tired this evening. I will go in and lie down a little\non the sofa.\n\n\nTESMAN.\n\nYes, do dear--eh?\n\n     [HEDDA goes into the back room and draws the curtains.  A short\n       pause.  Suddenly she is heard playing a wild dance on the piano.\n\n\nMRS. ELVSTED.\n\n[Starts from her chair.] Oh--what is that?\n\n\nTESMAN.\n\n[Runs to the doorway.] Why, my dearest Hedda--don't play dance-music\nto-night! Just think of Aunt Rina! And of Eilert too!\n\n\nHEDDA.\n\n[Puts her head out between the curtains.] And of Aunt Julia. And of all\nthe rest of them.--After this, I will be quiet. [Closes the curtains\nagain.]\n\n\nTESMAN.\n\n[At the writing-table.] It's not good for her to see us at this\ndistressing work. I'll tell you what, Mrs. Elvsted,--you shall take the\nempty room at Aunt Julia's, and then I will come over in the evenings,\nand we can sit and work there--eh?\n\n\nHEDDA.\n\n[In the inner room.] I hear what you are saying, Tesman. But how am _I_\nto get through the evenings out here?\n\n\nTESMAN.\n\n[Turning over the papers.] Oh, I daresay Judge Brack will be so kind as\nto look in now and then, even though I am out.\n\n\nBRACK.\n\n[In the arm-chair, calls out gaily.] Every blessed evening, with all the\npleasure in life, Mrs. Tesman! We shall get on capitally together, we\ntwo!\n\n\nHEDDA.\n\n[Speaking loud and clear.] Yes, don't you flatter yourself we will,\nJudge Brack? Now that you are the one cock in the basket--\n\n     [A shot is heard within.  TESMAN, MRS. ELVSTED, and BRACK leap\n       to their feet.\n\n\nTESMAN.\n\nOh, now she is playing with those pistols again.\n\n   [He throws back the curtains and runs in, followed by MRS.\n       ELVSTED.  HEDDA lies stretched on the sofa, lifeless.\n       Confusion and cries.  BERTA enters in alarm from the right.\n\n\nTESMAN.\n\n[Shrieks to BRACK.] Shot herself! Shot herself in the temple! Fancy\nthat!\n\n\nBRACK.\n\n[Half-fainting in the arm-chair.] Good God!--people don't do such\nthings.\n\n\nTHE END\n\n\nFOOTNOTES.\n\n\n  (1)Pronounce _Reena_.\n\n  (2)In the original \"Statsradinde Falks villa\"--showing that it had\n    belonged to the widow of a cabinet minister.\n\n  (3)_Du_ equals thou: Tesman means, \"If you could persuade yourself\n    to _tutoyer_ her.\"\n\n  (4)See previous note.\n\n  (5)Pronounce _Tora_ and _Taya_.\n\n  (6)Mrs. Elvsted here uses the formal pronoun _De_, whereupon Hedda\n    rebukes her.  In her next speech Mrs. Elvsted says _du_.\n\n  (7)\"Bagveje\" means both \"back ways\" and \"underhand courses.\"\n\n  (8)As this form of address is contrary to English usage, and as the\n    note of familiarity would be lacking in \"Mrs. Tesman,\" Brack may,\n    in stage representation, say \"Miss Hedda,\" thus ignoring her\n    marriage and reverting to the form of address no doubt customary\n    between them of old.\n\n  (9)He uses the familiar _du_.\n\n  (10)From this point onward Lovborg use the formal _De_.\n\n  (11)In this speech he once more says _du_.  Hedda addresses him\n    throughout as _De_.\n\n  (12)\"Enest hane i kurven\"--a proverbial saying.\n\n  (13)Literally, \"That you burn for me.\"", "title": "Hedda Gabler"}