{"summary": "After Finn saves Princess Bubblegum from falling from her tower, she decides that he is worthy of reading the Enchiridion: a tome of heroic knowledge. The book can only be acquired by \"for heroes whose hearts are righteous\". Bubblegum reveals that the book is located at the top of Mount Cragdor, past several trials.\nAfter passing the doorkeeper (voiced by John Moschitta, Jr), Finn and Jake encounter gnomes who cause Finn to doubt himself. When Jake tries to cheer him up, he is eaten by an ogre. Believing his friend to be dead, Finn steals a giant dollar from the ogre and attacks him, hitting him in the stomach. The Ogre vomits Jake up, and the two glide to the end of the trials. Finn, however, makes sure to send the dollar back to the Ogre, causing Jake to call his act \"righteous\".\nOnce inside the top-most building of Mount Cragdor, a malevolent entity (voiced by Mark Hamill) takes Finn to his \"Brain World\", wherein he is first told to slay an evil heart beast, and then slay an \"unaligned\" ant. Finn kills the evil creature, but refuses to kill the neutral one, defeating the being. Finn is then confronted by Mannish Man, the keeper of the Enchiridion, who gives it to Finn. Finn's first act is to read a chapter about kissing princesses.\n\n", "full_text": "The Library of Liberal Arts\n                     OSKAR PIEST, _General Editor_\n                             [NUMBER EIGHT]\n\n\n                               EPICTETUS\n                            The Enchiridion\n\n\n\n\n                            The Enchiridion\n                                   By\n                               EPICTETUS\n\n\n                             Translated by\n                          THOMAS W. HIGGINSON\n\n                        With an Introduction by\n                             ALBERT SALOMON\n                        _Professor of Sociology\n                    New School for Social Research_\n\n\n                         THE LIBERAL ARTS PRESS\n                                NEW YORK\n\n\n                            COPYRIGHT, 1948\n                      THE LIBERAL ARTS PRESS, INC.\n\n                     First Edition, _October, 1948_\n                               Reprinted\n                    _December, 1950_; _August, 1954_\n                    Second Edition, _November, 1955_\n\n         Published at 153 West 72nd Street, New York 23, N. Y.\n                Printed in the United States of America\n\n\n\n\n                                CONTENTS\n\n\n  Note on the Text                                                     6\n  Introduction                                                         7\n  Selected Bibliography                                               13\n  The Enchiridion                                                     17\n\n\n\n\n                            NOTE ON THE TEXT\n\n\nThe text of the second edition is a reprint of the first edition except\nfor a few minor corrections in style, punctuation, and spelling, which\nhave been revised to conform to current American usage.\n\nThe editorial staff of the publishers has added a few explanatory notes\nwhich are set in brackets and marked \"Ed.\"\n\n                                                                    O.P.\n\n\n\n\n                              INTRODUCTION\n\n\nThe little book by Epictetus called _Enchiridion_ or \"manual\" has played\na disproportionately large role in the rise of modern attitudes and\nmodern philosophy. As soon as it had been translated into the vernacular\nlanguages, it became a bestseller among independent intellectuals, among\nanti-Christian thinkers, and among philosophers of a subjective cast.\nMontaigne had a copy of the _Enchiridion_ among his books. Pascal\nviolently rejected the megalomaniac pride of the Stoic philosopher.\nFrederick the Great carried the book with him on all campaigns. It was a\nsource of inspiration and encouragement to Anthony, Earl of Shaftesbury,\nin the serious illness which ended only in his death; many pages of his\ndiaries contain passages copied from the _Enchiridion_. It has been\nstudied and widely quoted by Scottish philosophers like Francis\nHutcheson, Adam Smith, and Adam Ferguson who valued Stoic moral\nphilosophy for its reconciliation of social dependency and personal\nindependence.\n\nThat there was a rebirth of Stoicism in the centuries of rebirth which\nmarked the emergence of the modern age was not mere chance.\nPhilosophical, moral, and social conditions of the time united to cause\nit. Roman Stoicism had been developed in times of despotism as a\nphilosophy of lonely and courageous souls who had recognized the\nredeeming power of philosophical reason in all the moral and social\npurposes of life. Philosophy as a way of life makes men free. It is the\nlast ditch stand of liberty in a world of servitude. Many elements in the\nnew age led to thought which had structural affinity with Roman Stoicism.\nModern times had created the independent thinker, the free intellectual\nin a secular civilization. Modern times had destroyed medieval liberties\nand had established the new despotism of the absolute state supported by\necclesiastical authority. Modern philosophies continued the basic trend\nin Stoicism in making the subjective consciousness the foundation of\nphilosophy. The Stoic emphasis on moral problems was also appealing in an\nera of rapid transition when all the values which had previously been\ntaken for granted were questioned and reconsidered.\n\nWhile it is interesting to observe how varied were the effects produced\nby this small volume, this epitome of the Stoic system of moral\nphilosophy, these effects seem still more remarkable when we consider\nthat it was not intended to be a philosophical treatise on Stoicism for\nstudents. It was, rather, to be a guide for the advanced student of\nStoicism to show him the best roads toward the goal of becoming a true\nphilosopher. Thus Epictetus and his _Enchiridion_ have a unique position\nin Roman Stoicism. Seneca and Marcus Aurelius had selected Stoic\nphilosophy as the most adequate system for expressing their existential\nproblems of independence, solitude, and history. In this enterprise,\nSeneca made tremendous strides toward the insights of social psychology\nas a by-product of his consciousness of decadence (in this he was close\nto Nietzsche), but he was not primarily concerned with the unity of the\nStoic system. Marcus Aurelius changed the philosophical doctrine into the\nregimen of the lonesome ruler. In contrast to both, Epictetus was\nteaching Stoic philosophy as a doctrine and as a way of life. The\n_Enchiridion_ is a summary of theoretical and applied Stoicism.\n\nEpictetus was the son of a woman slave, born between 50 and 60 A.D. at\nHieropolis in Phrygia. We do not know how he came to Rome. He was there\nas slave to one of Nero's distinguished freedmen who served as the\nEmperor's secretary. While still in service, Epictetus took courses with\nMusonius Rufus, the fashionable Stoic philosopher, who was impressed by\nthe sincere and dynamic personality of the young slave and trained him to\nbe a Stoic philosopher. Epictetus became a free man and began teaching\nphilosophy on street corners, in the market, but he was not successful.\nDuring the rule of Domitian, Epictetus with many other philosophers was\nexiled from Rome, probably between 89 and 92 A.D. He went to Nicopolis,\nacross Actium in Epirus, where he conducted his own school. He was so\nwell regarded and highly esteemed that he established the reputation of\nthe place as the town of Epictetus' school. Students came from Athens and\nRome to attend his classes. Private citizens came to ask his advice and\nguidance. Some of his students returned to their homes to enter the\ntraditional careers to which they were socially obligated. Others assumed\nthe philosophic way of life in order to escape into the sphere of Stoic\nfreedom.\n\nAmong the students was a young Roman, Flavius Arrian, who took courses at\nNicopolis when Epictetus was already old. Flavius, who was born in 108\nA.D., was one of the intimates of Hadrian, who made him consul in 130\nA.D. He probably studied with Epictetus between the years 123 and 126\nA.D. The informal philosophical talks which Epictetus had with his\nstudents fascinated him. Needless to say there were also systematic\ncourses in the fields of philosophy. But it was the informal discourses\nwhich convinced Arrian that he had finally discovered a Stoic Socrates or\na Stoic Diogenes, who was not merely teaching a doctrine, but also living\nthe truth. Arrian recorded many of the discourses and informal\nconversations of Epictetus with his intimate students. He took them down\nin shorthand in order not to lose the ineffable liveliness, grace, and\nwit of the beloved teacher. Arrian retired into private life after the\ndeath of Hadrian in 138 A.D. and dedicated himself to his literary work.\nHe published his notes on Epictetus' teaching under the title:\n_Discourses in Four Books_. The _Enchiridion_, which was also arranged by\nArrian, is a brief summary of the basic ideas of Stoic philosophy and an\nintroduction to the techniques required to transform Stoic philosophy\ninto a way of life.\n\nThus we do not have any original writings of Epictetus. Like G. H. Mead\nin recent times, he was completely dedicated to the human and\nintellectual problems of his students. He left it for them to preserve\nwhat they considered to be the lasting message of the teacher. In\ncontrast to Seneca and Marcus Aurelius, Epictetus had no subjective\napproach to the Stoic doctrines. Moral philosophy was the center of his\nteaching, and epistemology was only instrumental. It is even permissible\nto say that he took physics or cosmology too lightly. If this is granted,\nwe must admit that he is completely absorbed by the fundamentals of Stoic\nthought as presented in the _Enchiridion_. Epictetus' personality is\ntotally integrated in the act of reasoning which establishes conformity\nwith nature.\n\nA remarkable difference between the _Discourses_ and the _Enchiridion_\nshould be mentioned. The _Discourses_ are a living image of the teacher\nin action; they present the process of philosophizing, not the finished\nproduct. They show the enthusiastic and sober, the realistic and pathetic\nmoralist in constantly changing perspectives determined by the changing\nstudents with their various concerns, problems, and questions; his\nteachings, his formulations, have direct reference to the various life\nsituations in which the students should apply and practice the master's\nStoic teaching. No human situation is omitted; as a guide to conduct,\nphilosophy has relevance for all. Whether the students have to attend a\ndinner party, whether they are among competitors in a stadium or in a\nswimming pool, whether they have to present themselves at court or in an\noffice, whether they are in the company of their mothers and sisters or\nof girl friends, in all human situations the philosopher knows the\ncorrect advice for the philosophical apprentice. Thus, in the\n_Discourses_, Arrian presents the unique individuality of the philosopher\nand of his applied moral method in living contact with various students\nin concrete situations. Epictetus as teacher anticipates very modern\neducational methods in his regard for the structure of situations and the\nchanging perspectives in human relationships.\n\nNothing like this is revealed in the _Enchiridion_. Gone is the Stoic\nphilosopher as living spirit. What remains is the living spirit of\nStoicism. The _Enchiridion_ is a manual for the combat officer. This\nanalogy should be taken seriously. The Roman Stoics coined the formula:\n_Vivere militare!_ (Life is being a soldier.) The student of philosophy\nis a private, the advancing Stoic is a non-commissioned officer, and the\nphilosopher is the combat officer. For this reason all Roman Stoics apply\nmetaphors and images derived from military life. Apprentice students of\nStoicism are described as messengers, as scouts of God, as\nrepresentatives of divine nature. The advancing student who is close to\nthe goal of being a philosopher has the rank of an officer. He is already\nable to establish inner freedom and independence. He understands the\nbasic Stoic truth of subjective consciousness, which is to distinguish\nwhat is in our power from what is not in our power. Not in our power are\nall the elements which constitute our environment, such as wealth,\nhealth, reputation, social prestige, power, the lives of those we love,\nand death. In our power are our thinking, our intentions, our desires,\nour decisions. These make it possible for us to control ourselves and to\nmake of ourselves elements and parts of the universe of nature. This\nknowledge of ourselves makes us free in a world of dependencies. This\nsuperiority of our powers enables us to live in conformity with nature.\nThe rational philosophy of control of Self and of adjustment to the Whole\nimplies an asceticism of the emotional and the sensitive life. The\nphilosopher must examine and control his passions, his love, his\ntenderness at all times in order always to be ready for the inevitable\nmoment of farewell. The Stoics practiced a Jesuitism _avant la lettre_.\nThey were able to live in the world as if they did not live in it. To the\nStoic, life is a military camp, a play on the stage, a banquet to which\nwe are invited. The _Enchiridion_ briefly indicated the techniques which\nthe philosopher should apply in acting well the diverse roles which God\nmight assign to those whom he loves, the Stoic philosophers. From the\nrules of social conduct to the recommendations of sexual asceticism\nbefore marriage, and the method of true thinking, the advanced Stoic will\nfind all principles of perfection and all precepts for realizing\nphilosophical principles in his conduct in this tiny volume.\n\nThus the _Enchiridion_ was liberating for all intellectuals who learned\nfrom it that there are philosophical ways of self-redemption. From its\ntime, the secular thinker could feel jubilant because he was not in need\nof a divine grace. Epictetus had taught him that philosophical reason\ncould make him free and that he was capable of redeeming himself by sound\nreasoning.\n\nIn the Stoic distinctions of personality and world, of I and mine, of\nsubjective consciousness and the world of objects, of freedom and\ndependence, we find implicit the basic elements of modern philosophies of\nrationalism and of objective idealism or pantheism. For this reason there\nis a continuous renascence of Stoicism from Descartes, Grotius, and\nBishop Butler, to Montesquieu, Adam Smith, and Kant. In this long\ndevelopment in modern times, the tiny _Enchiridion_ of Epictetus played a\nremarkable part.\n\nThe translations of Epictetus and of all other Stoics had the widest\neffect on philosophers, theologians, and lay thinkers. They were studied\nby the clergy of the various Christian denominations, by the scientists\nwho were striving for a natural religion, and by the independent\nphilosophers who were eager to separate philosophy from religion. There\nwere many outstanding bishops in the Catholic and Anglican Churches who\nwere eager to transform the traditions of Roman Stoicism into Christian\nStoicism. Among the Calvinistic denominations were many thinkers who were\nin sympathy with Stoic moral principles because of their praise of the\nausterity of life and of the control of passions. Likewise the adherents\nof natural religion were propagating Stoicism as the ideal pattern of\nuniversally valid and intelligible religion. Renascent Stoicism had three\nfunctions in the rise of the modern world. First, it reconciled Christian\ntraditions to modern rationalistic philosophies; secondly, it established\nan ideal pattern of natural religion; and, thirdly, it opened the way for\nthe autonomy of morals.\n\n                                                          ALBERT SALOMON\n\n  The New School\n    for Social Research\n  _July, 1948_\n\n\n\n\n                         SELECTED BIBLIOGRAPHY\n\n\n                       _Epictetus: Life and Work_\n\nArnim, Hans V., \"Epictetos\" in Pauli-Wissowa (ed), _Real-Encyclopaedie\n        der classischen Altertumswissenschaft_, VI, col. 126-131.\n\nArnold, E. V., \"Epictetus\" in Hastings, _Encyclopedia of Religion and\n        Ethics_, 1912. Vol. V, pp. 323, 324.\n\nBonhoeffer, A., _Epiktet und die Stoa_. Stuttgart, 1890.\n\n----, _Ethik des Stoikers Epiktet_. Stuttgart, 1894.\n\n----, _Epiktet und das Neue Testament_. Giessen, 1911.\n\nBruns, Ivo, _De schola Epicteti_. Kiel, 1897.\n\nBultmann, Rudolf, \"Das religioese Moment in der ethischen Unterweisung des\n        Epiktets und das Neue Testament,\" _Zeitschrift fuer die\n        neutestamentliche Wissenschaft und die Kunde des Urchristentums_,\n        Vol. XIII, 1912; pp. 97-110; 177-191.\n\nColardeau, Th., _Etude sur Epictete_. Paris, 1903.\n\nHartmann, K., \"Arrian und Epiktet,\" _Neue Jahrbuecher fuer das klassische\n        Altertum_, Vol. XV, 1905.\n\nJagu, Amand, _Epictete et Platon_. Paris, 1944.\n\nLagrange, M. J., \"La philosophie religieuse d'Epictete et le\n        Christianisme,\" _Revue Biblique_, Vol. IX, 1912; pp. 5-21,\n        192-212.\n\nOldfather, W. A., \"Introduction\" to _Epictetus_, \"Loeb Classics,\" Vol. I.\n\nSouilhe, J., \"Introduction\" to _Entretiens_. Paris, 1943.\n\nWeber, Louis, \"La morale d'Epictete et les besoins presents de\n        l'enseignment moral,\" _Revue de Metaphysique et de Morale_, 1905,\n        pp. 830-858; 1906, pp. 342-360; 1907, pp. 327-347; 1909, pp.\n        203-326.\n\n\n             _Main Works on Stoicism and Related Problems_\n\nArnold, E. V., _Roman Stoicism_. Cambridge, E., 1911.\n\nBevan, E., _Stoics and Sceptics_. Oxford, 1913.\n\nBrochard, V., _Etudes de philosophie ancienne et de philosophie moderne_,\n        Paris, 1912.\n\nHicks, R. D., _Stoic and Epicurean_. New York, 1910.\n\nMartha, C., _Les moralistes sur l'Empire Romain_. Paris, 1886.\n\nMurray, Gilbert, _Stoic, Christian, Humanist_. London, 1940.\n\nRobin, L., _La morale antique_. Paris, 1938, pp. 57, 130, 152, 167.\n\nWendland, Paul, _Philo und die cynisch-stoische Diatribe_. Berlin, 1895.\n\n----, _Die hellenistische Kultur in ihren Beziehungen zum Judentum und\n        Christentum_. Tuebingen, 1912.\n\nZanta, L., _La renaissance du Stoicisme au XVIieme siecle_. Paris, 1914.\n\nZeller, E., _The Stoics, Epicureans, and Sceptics_. London, 1892.\n\n\n                        _Influence of Stoicism_\n\nBusson, Henry, _La pensee religieuse Francaise de Charron a Pascal_.\n        Paris, 1933. Chap. VIII: Stoiciens et Epicuriens, pp. 379-429.\n\nDilthey, Wilhelm, _Gesammelte Werke_, Vol. II. \"Einfluss der Stoa auf die\n        Ausbildung des natuerlichen Systems der Geisteswissenschaften,\"\n        pp. 153-162; \"Anthropologie, Stoa und natuerliches System im XVII.\n        Jahrhundert,\" pp. 439-457.\n\nGroethuysen, Bernard, _Philosophische Anthropologie_. Muenchen, 1928.\n        (Chap. \"Die roemisch-griechische Lebensphilosophie.\")\n\nRand, B., _The Life, Letters, etc. of Anthony, Earl of Shaftesbury_.\n        London, 1900.\n\nSaunders, Jason L., _Justus Lipsius. The Philosophy of Renaissance\n        Stoicism_. New York, 1955.\n\nWenley, R. M., _Stoicism and Its Influence_. New York, 1927.\n\n\n\n\n                            THE ENCHIRIDION\n\n\n                                   I\n\nThere are things which are within our power, and there are things which\nare beyond our power. Within our power are opinion, aim, desire,\naversion, and, in one word, whatever affairs are our own. Beyond our\npower are body, property, reputation, office, and, in one word, whatever\nare not properly our own affairs.\n\nNow the things within our power are by nature free, unrestricted,\nunhindered; but those beyond our power are weak, dependent, restricted,\nalien. Remember, then, that if you attribute freedom to things by nature\ndependent and take what belongs to others for your own, you will be\nhindered, you will lament, you will be disturbed, you will find fault\nboth with gods and men. But if you take for your own only that which is\nyour own and view what belongs to others just as it really is, then no\none will ever compel you, no one will restrict you; you will find fault\nwith no one, you will accuse no one, you will do nothing against your\nwill; no one will hurt you, you will not have an enemy, nor will you\nsuffer any harm.\n\nAiming, therefore, at such great things, remember that you must not allow\nyourself any inclination, however slight, toward the attainment of the\nothers; but that you must entirely quit some of them, and for the present\npostpone the rest. But if you would have these, and possess power and\nwealth likewise, you may miss the latter in seeking the former; and you\nwill certainly fail of that by which alone happiness and freedom are\nprocured.\n\nSeek at once, therefore, to be able to say to every unpleasing semblance,\n\"You are but a semblance and by no means the real thing.\" And then\nexamine it by those rules which you have; and first and chiefly by this:\nwhether it concerns the things which are within our own power or those\nwhich are not; and if it concerns anything beyond our power, be prepared\nto say that it is nothing to you.\n\n\n                                   II\n\nRemember that desire demands the attainment of that of which you are\ndesirous; and aversion demands the avoidance of that to which you are\naverse; that he who fails of the object of his desires is disappointed;\nand he who incurs the object of his aversion is wretched. If, then, you\nshun only those undesirable things which you can control, you will never\nincur anything which you shun; but if you shun sickness, or death, or\npoverty, you will run the risk of wretchedness. Remove [the habit of]\naversion, then, from all things that are not within our power, and apply\nit to things undesirable which are within our power. But for the present,\naltogether restrain desire; for if you desire any of the things not\nwithin our own power, you must necessarily be disappointed; and you are\nnot yet secure of those which are within our power, and so are legitimate\nobjects of desire. Where it is practically necessary for you to pursue or\navoid anything, do even this with discretion and gentleness and\nmoderation.\n\n\n                                  III\n\nWith regard to whatever objects either delight the mind or contribute to\nuse or are tenderly beloved, remind yourself of what nature they are,\nbeginning with the merest trifles: if you have a favorite cup, that it is\nbut a cup of which you are fond of--for thus, if it is broken, you can\nbear it; if you embrace your child or your wife, that you embrace a\nmortal--and thus, if either of them dies, you can bear it.\n\n\n                                   IV\n\nWhen you set about any action, remind yourself of what nature the action\nis. If you are going to bathe, represent to yourself the incidents usual\nin the bath--some persons pouring out, others pushing in, others\nscolding, others pilfering. And thus you will more safely go about this\naction if you say to yourself, \"I will now go to bathe and keep my own\nwill in harmony with nature.\" And so with regard to every other action.\nFor thus, if any impediment arises in bathing, you will be able to say,\n\"It was not only to bathe that I desired, but to keep my will in harmony\nwith nature; and I shall not keep it thus if I am out of humor at things\nthat happen.\"\n\n\n                                   V\n\nMen are disturbed not by things, but by the views which they take of\nthings. Thus death is nothing terrible, else it would have appeared so to\nSocrates. But the terror consists in our notion of death, that it is\nterrible. When, therefore, we are hindered or disturbed, or grieved, let\nus never impute it to others, but to ourselves--that is, to our own\nviews. It is the action of an uninstructed person to reproach others for\nhis own misfortunes; of one entering upon instruction, to reproach\nhimself; and one perfectly instructed, to reproach neither others nor\nhimself.\n\n\n                                   VI\n\nBe not elated at any excellence not your own. If a horse should be\nelated, and say, \"I am handsome,\" it might be endurable. But when you are\nelated and say, \"I have a handsome horse,\" know that you are elated only\non the merit of the horse. What then is your own? The use of the\nphenomena of existence. So that when you are in harmony with nature in\nthis respect, you will be elated with some reason; for you will be elated\nat some good of your own.\n\n\n                                  VII\n\nAs in a voyage, when the ship is at anchor, if you go on shore to get\nwater, you may amuse yourself with picking up a shellfish or a truffle in\nyour way, but your thoughts ought to be bent toward the ship, and\nperpetually attentive, lest the captain should call, and then you must\nleave all these things, that you may not have to be carried on board the\nvessel, bound like a sheep; thus likewise in life, if, instead of a\ntruffle or shellfish, such a thing as a wife or a child be granted you,\nthere is no objection; but if the captain calls, run to the ship, leave\nall these things, and never look behind. But if you are old, never go far\nfrom the ship, lest you should be missing when called for.\n\n\n                                  VIII\n\nDemand not that events should happen as you wish; but wish them to happen\nas they do happen, and you will go on well.\n\n\n                                   IX\n\nSickness is an impediment to the body, but not to the will unless itself\npleases. Lameness is an impediment to the leg, but not to the will; and\nsay this to yourself with regard to everything that happens. For you will\nfind it to be an impediment to something else, but not truly to yourself.\n\n\n                                   X\n\nUpon every accident, remember to turn toward yourself and inquire what\nfaculty you have for its use. If you encounter a handsome person, you\nwill find continence the faculty needed; if pain, then fortitude; if\nreviling, then patience. And when thus habituated, the phenomena of\nexistence will not overwhelm you.\n\n\n                                   XI\n\nNever say of anything, \"I have lost it,\" but, \"I have restored it.\" Has\nyour child died? It is restored. Has your wife died? She is restored. Has\nyour estate been taken away? That likewise is restored. \"But it was a bad\nman who took it.\" What is it to you by whose hands he who gave it has\ndemanded it again? While he permits you to possess it, hold it as\nsomething not your own, as do travelers at an inn.\n\n\n                                  XII\n\nIf you would improve, lay aside such reasonings as these: \"If I neglect\nmy affairs, I shall not have a maintenance; if I do not punish my\nservant, he will be good for nothing.\" For it were better to die of\nhunger, exempt from grief and fear, than to live in affluence with\nperturbation; and it is better that your servant should be bad than you\nunhappy.\n\nBegin therefore with little things. Is a little oil spilled or a little\nwine stolen? Say to yourself, \"This is the price paid for peace and\ntranquillity; and nothing is to be had for nothing.\" And when you call\nyour servant, consider that it is possible he may not come at your call;\nor, if he does, that he may not do what you wish. But it is not at all\ndesirable for him, and very undesirable for you, that it should be in his\npower to cause you any disturbance.\n\n\n                                  XIII\n\nIf you would improve, be content to be thought foolish and dull with\nregard to externals. Do not desire to be thought to know anything; and\nthough you should appear to others to be somebody, distrust yourself. For\nbe assured, it is not easy at once to keep your will in harmony with\nnature and to secure externals; but while you are absorbed in the one,\nyou must of necessity neglect the other.\n\n\n                                  XIV\n\nIf you wish your children and your wife and your friends to live forever,\nyou are foolish, for you wish things to be in your power which are not\nso, and what belongs to others to be your own. So likewise, if you wish\nyour servant to be without fault, you are foolish, for you wish vice not\nto be vice but something else. But if you wish not to be disappointed in\nyour desires, that is in your own power. Exercise, therefore, what is in\nyour power. A man's master is he who is able to confer or remove whatever\nthat man seeks or shuns. Whoever then would be free, let him wish\nnothing, let him decline nothing, which depends on others; else he must\nnecessarily be a slave.\n\n\n                                   XV\n\nRemember that you must behave as at a banquet. Is anything brought round\nto you? Put out your hand and take a moderate share. Does it pass by you?\nDo not stop it. Is it not yet come? Do not yearn in desire toward it, but\nwait till it reaches you. So with regard to children, wife, office,\nriches; and you will some time or other be worthy to feast with the gods.\nAnd if you do not so much as take the things which are set before you,\nbut are able even to forego them, then you will not only be worthy to\nfeast with the gods, but to rule with them also. For, by thus doing,\nDiogenes and Heraclitus, and others like them, deservedly became divine,\nand were so recognized.\n\n\n                                  XVI\n\nWhen you see anyone weeping for grief, either that his son has gone\nabroad or that he has suffered in his affairs, take care not to be\novercome by the apparent evil, but discriminate and be ready to say,\n\"What hurts this man is not this occurrence itself--for another man might\nnot be hurt by it--but the view he chooses to take of it.\" As far as\nconversation goes, however, do not disdain to accommodate yourself to him\nand, if need be, to groan with him. Take heed, however, not to groan\ninwardly, too.\n\n\n                                  XVII\n\nRemember that you are an actor in a drama of such sort as the Author\nchooses--if short, then in a short one; if long, then in a long one. If\nit be his pleasure that you should enact a poor man, or a cripple, or a\nruler, or a private citizen, see that you act it well. For this is your\nbusiness--to act well the given part, but to choose it belongs to\nanother.\n\n\n                                 XVIII\n\nWhen a raven happens to croak unluckily, be not overcome by appearances,\nbut discriminate and say, \"Nothing is portended to _me_, either to my\npaltry body, or property, or reputation, or children, or wife. But to\n_me_ all portents are lucky if I will. For whatsoever happens, it belongs\nto me to derive advantage therefrom.\"\n\n\n                                  XIX\n\nYou can be unconquerable if you enter into no combat in which it is not\nin your own power to conquer. When, therefore, you see anyone eminent in\nhonors or power, or in high esteem on any other account, take heed not to\nbe bewildered by appearances and to pronounce him happy; for if the\nessence of good consists in things within our own power, there will be no\nroom for envy or emulation. But, for your part, do not desire to be a\ngeneral, or a senator, or a consul, but to be free; and the only way to\nthis is a disregard of things which lie not within our own power.\n\n\n                                   XX\n\nRemember that it is not he who gives abuse or blows, who affronts, but\nthe view we take of these things as insulting. When, therefore, anyone\nprovokes you, be assured that it is your own opinion which provokes you.\nTry, therefore, in the first place, not to be bewildered by appearances.\nFor if you once gain time and respite, you will more easily command\nyourself.\n\n\n                                  XXI\n\nLet death and exile, and all other things which appear terrible, be daily\nbefore your eyes, but death chiefly; and you will never entertain an\nabject thought, nor too eagerly covet anything.\n\n\n                                  XXII\n\nIf you have an earnest desire toward philosophy, prepare yourself from\nthe very first to have the multitude laugh and sneer, and say, \"He is\nreturned to us a philosopher all at once\"; and, \"Whence this supercilious\nlook?\" Now, for your part, do not have a supercilious look indeed, but\nkeep steadily to those things which appear best to you, as one appointed\nby God to this particular station. For remember that, if you are\npersistent, those very persons who at first ridiculed will afterwards\nadmire you. But if you are conquered by them, you will incur a double\nridicule.\n\n\n                                 XXIII\n\nIf you ever happen to turn your attention to externals, for the pleasure\nof anyone, be assured that you have ruined your scheme of life. Be\ncontent, then, in everything, with being a philosopher; and if you wish\nto seem so likewise to anyone, appear so to yourself, and it will suffice\nyou.\n\n\n                                  XXIV\n\nLet not such considerations as these distress you: \"I shall live in\ndiscredit and be nobody anywhere.\" For if discredit be an evil, you can\nno more be involved in evil through another than in baseness. Is it any\nbusiness of yours, then, to get power or to be admitted to an\nentertainment? By no means. How then, after all, is this discredit? And\nhow it is true that you will be nobody anywhere when you ought to be\nsomebody in those things only which are within your own power, in which\nyou may be of the greatest consequence? \"But my friends will be\nunassisted.\" What do you mean by \"unassisted\"? They will not have money\nfrom you, nor will you make them Roman citizens. Who told you, then, that\nthese are among the things within our own power, and not rather the\naffairs of others? And who can give to another the things which he\nhimself has not? \"Well, but get them, then, that we too may have a\nshare.\" If I can get them with the preservation of my own honor and\nfidelity and self-respect, show me the way and I will get them; but if\nyou require me to lose my own proper good, that you may gain what is no\ngood, consider how unreasonable and foolish you are. Besides, which would\nyou rather have, a sum of money or a faithful and honorable friend?\nRather assist me, then, to gain this character than require me to do\nthose things by which I may lose it. Well, but my country, say you, as\nfar as depends upon me, will be unassisted. Here, again, what assistance\nis this you mean? It will not have porticos nor baths of your providing?\nAnd what signifies that? Why, neither does a smith provide it with shoes,\nnor a shoemaker with arms. It is enough if everyone fully performs his\nown proper business. And were you to supply it with another faithful and\nhonorable citizen, would not he be of use to it? Yes. Therefore neither\nare you yourself useless to it. \"What place, then,\" say you, \"shall I\nhold in the state?\" Whatever you can hold with the preservation of your\nfidelity and honor. But if, by desiring to be useful to that, you lose\nthese, how can you serve your country when you have become faithless and\nshameless?\n\n\n                                  XXV\n\nIs anyone preferred before you at an entertainment, or in courtesies, or\nin confidential intercourse? If these things are good, you ought to\nrejoice that he has them; and if they are evil, do not be grieved that\nyou have them not. And remember that you cannot be permitted to rival\nothers in externals without using the same means to obtain them. For how\ncan he who will not haunt the door of any man, will not attend him, will\nnot praise him, have an equal share with him who does these things? You\nare unjust, then, and unreasonable if you are unwilling to pay the price\nfor which these things are sold, and would have them for nothing. For how\nmuch are lettuces sold? An obulus, for instance. If another, then, paying\nan obulus, takes the lettuces, and you, not paying it, go without them,\ndo not imagine that he has gained any advantage over you. For as he has\nthe lettuces, so you have the obulus which you did not give. So, in the\npresent case, you have not been invited to such a person's entertainment\nbecause you have not paid him the price for which a supper is sold. It is\nsold for praise; it is sold for attendance. Give him, then, the value if\nit be for your advantage. But if you would at the same time not pay the\none, and yet receive the other, you are unreasonable and foolish. Have\nyou nothing, then, in place of the supper? Yes, indeed, you have--not to\npraise him whom you do not like to praise; not to bear the insolence of\nhis lackeys.\n\n\n                                  XXVI\n\nThe will of nature may be learned from things upon which we are all\nagreed. As when our neighbor's boy has broken a cup, or the like, we are\nready at once to say, \"These are casualties that will happen\"; be\nassured, then, that when your own cup is likewise broken, you ought to be\naffected just as when another's cup was broken. Now apply this to greater\nthings. Is the child or wife of another dead? There is no one who would\nnot say, \"This is an accident of mortality.\" But if anyone's own child\nhappens to die, it is immediately, \"Alas! how wretched am I!\" It should\nbe always remembered how we are affected on hearing the same thing\nconcerning others.\n\n\n                                 XXVII\n\nAs a mark[1] is not set up for the sake of missing the aim, so neither\ndoes the nature of evil exist in the world.\n\n\n                                 XXVIII\n\nIf a person had delivered up your body to some passer-by, you would\ncertainly be angry. And do you feel no shame in delivering up your own\nmind to any reviler, to be disconcerted and confounded?\n\n\n                                XXIX[2]\n\nIn every affair consider what precedes and what follows, and then\nundertake it. Otherwise you will begin with spirit, indeed, careless of\nthe consequences, and when these are developed, you will shamefully\ndesist. \"I would conquer at the Olympic Games.\" But consider what\nprecedes and what follows, and then, if it be for your advantage, engage\nin the affair. You must conform to rules, submit to a diet, refrain from\ndainties; exercise your body, whether you choose it or not, at a stated\nhour, in heat and cold; you must drink no cold water, and sometimes no\nwine--in a word, you must give yourself up to your trainer as to a\nphysician. Then, in the combat, you may be thrown into a ditch, dislocate\nyour arm, turn your ankle, swallow an abundance of dust, receive stripes\n[for negligence], and, after all, lose the victory. When you have\nreckoned up all this, if your inclination still holds, set about the\ncombat. Otherwise, take notice, you will behave like children who\nsometimes play wrestlers, sometimes gladiators, sometimes blow a trumpet,\nand sometimes act a tragedy, when they happen to have seen and admired\nthese shows. Thus you too will be at one time a wrestler, and another a\ngladiator; now a philosopher, now an orator; but nothing in earnest. Like\nan ape you mimic all you see, and one thing after another is sure to\nplease you, but is out of favor as soon as it becomes familiar. For you\nhave never entered upon anything considerately; nor after having surveyed\nand tested the whole matter, but carelessly, and with a halfway zeal.\nThus some, when they have seen a philosopher and heard a man speaking\nlike Euphrates[3]--though, indeed, who can speak like him?--have a mind\nto be philosophers, too. Consider first, man, what the matter is, and\nwhat your own nature is able to bear. If you would be a wrestler,\nconsider your shoulders, your back, your thighs; for different persons\nare made for different things. Do you think that you can act as you do\nand be a philosopher, that you can eat, drink, be angry, be discontented,\nas you are now? You must watch, you must labor, you must get the better\nof certain appetites, must quit your acquaintances, be despised by your\nservant, be laughed at by those you meet; come off worse than others in\neverything--in offices, in honors, before tribunals. When you have fully\nconsidered all these things, approach, if you please--that is, if, by\nparting with them, you have a mind to purchase serenity, freedom, and\ntranquillity. If not, do not come hither; do not, like children, be now a\nphilosopher, then a publican, then an orator, and then one of Caesar's\nofficers. These things are not consistent. You must be one man, either\ngood or bad. You must cultivate either your own reason or else externals;\napply yourself either to things within or without you--that is, be either\na philosopher or one of the mob.\n\n\n                                  XXX\n\nDuties are universally measured by relations. Is a certain man your\nfather? In this are implied taking care of him, submitting to him in all\nthings, patiently receiving his reproaches, his correction. But he is a\nbad father. Is your natural tie, then, to a _good_ father? No, but to a\nfather. Is a brother unjust? Well, preserve your own just relation toward\nhim. Consider not what _he_ does, but what _you_ are to do to keep your\nown will in a state conformable to nature, for another cannot hurt you\nunless you please. You will then be hurt when you consent to be hurt. In\nthis manner, therefore, if you accustom yourself to contemplate the\nrelations of neighbor, citizen, commander, you can deduce from each the\ncorresponding duties.\n\n\n                                  XXXI\n\nBe assured that the essence of piety toward the gods lies in this--to\nform right opinions concerning them, as existing and as governing the\nuniverse justly and well. And fix yourself in this resolution, to obey\nthem, and yield to them, and willingly follow them amidst all events, as\nbeing ruled by the most perfect wisdom. For thus you will never find\nfault with the gods, nor accuse them of neglecting you. And it is not\npossible for this to be affected in any other way than by withdrawing\nyourself from things which are not within our own power, and by making\ngood or evil to consist only in those which are. For if you suppose any\nother things to be either good or evil, it is inevitable that, when you\nare disappointed of what you wish or incur what you would avoid, you\nshould reproach and blame their authors. For every creature is naturally\nformed to flee and abhor things that appear hurtful and that which causes\nthem; and to pursue and admire those which appear beneficial and that\nwhich causes them. It is impracticable, then, that one who supposes\nhimself to be hurt should rejoice in the person who, as he thinks, hurts\nhim, just as it is impossible to rejoice in the hurt itself. Hence, also,\na father is reviled by his son when he does not impart the things which\nseem to be good; and this made Polynices and Eteocles[4] mutually\nenemies--that empire seemed good to both. On this account the husbandman\nreviles the gods; [and so do] the sailor, the merchant, or those who have\nlost wife or child. For where our interest is, there, too, is piety\ndirected. So that whoever is careful to regulate his desires and\naversions as he ought is thus made careful of piety likewise. But it also\nbecomes incumbent on everyone to offer libations and sacrifices and first\nfruits, according to the customs of his country, purely, and not\nheedlessly nor negligently; not avariciously, nor yet extravagantly.\n\n\n                                 XXXII\n\nWhen you have recourse to divination, remember that you know not what the\nevent will be, and you come to learn it of the diviner; but of what\nnature it is you knew before coming; at least, if you are of philosophic\nmind. For if it is among the things not within our own power, it can by\nno means be either good or evil. Do not, therefore, bring with you to the\ndiviner either desire or aversion--else you will approach him\ntrembling--but first clearly understand that every event is indifferent\nand nothing to _you_, of whatever sort it may be; for it will be in your\npower to make a right use of it, and this no one can hinder. Then come\nwith confidence to the gods as your counselors; and afterwards, when any\ncounsel is given you, remember what counselors you have assumed, and\nwhose advice you will neglect if you disobey. Come to divination as\nSocrates prescribed, in cases of which the whole consideration relates to\nthe event, and in which no opportunities are afforded by reason or any\nother art to discover the matter in view. When, therefore, it is our duty\nto share the danger of a friend or of our country, we ought not to\nconsult the oracle as to whether we shall share it with them or not. For\nthough the diviner should forewarn you that the auspices are unfavorable,\nthis means no more than that either death or mutilation or exile is\nportended. But we have reason within us; and it directs us, even with\nthese hazards, to stand by our friend and our country. Attend, therefore,\nto the greater diviner, the Pythian God, who once cast out of the temple\nhim who neglected to save his friend.[5]\n\n\n                                 XXXIII\n\nBegin by prescribing to yourself some character and demeanor, such as you\nmay preserve both alone and in company.\n\nBe mostly silent, or speak merely what is needful, and in few words. We\nmay, however, enter sparingly into discourse sometimes, when occasion\ncalls for it; but let it not run on any of the common subjects, as\ngladiators, or horse races, or athletic champions, or food, or drink--the\nvulgar topics of conversation--and especially not on men, so as either to\nblame, or praise, or make comparisons. If you are able, then, by your own\nconversation, bring over that of your company to proper subjects; but if\nyou happen to find yourself among strangers, be silent.\n\nLet not your laughter be loud, frequent, or abundant.\n\nAvoid taking oaths, if possible, altogether; at any rate, so far as you\nare able.\n\nAvoid public and vulgar entertainments; but if ever an occasion calls you\nto them, keep your attention upon the stretch, that you may not\nimperceptibly slide into vulgarity. For be assured that if a person be\never so pure himself, yet, if his companion be corrupted, he who\nconverses with him will be corrupted likewise.\n\nProvide things relating to the body no further than absolute need\nrequires, as meat, drink, clothing, house, retinue. But cut off\neverything that looks toward show and luxury.\n\nBefore marriage guard yourself with all your ability from unlawful\nintercourse with women; yet be not uncharitable or severe to those who\nare led into this, nor boast frequently that you yourself do otherwise.\n\nIf anyone tells you that a certain person speaks ill of you, do not make\nexcuses about what is said of you, but answer: \"He was ignorant of my\nother faults, else he would not have mentioned these alone.\"\n\nIt is not necessary for you to appear often at public spectacles; but if\never there is a proper occasion for you to be there, do not appear more\nsolicitous for any other than for yourself--that is, wish things to be\nonly just as they are, and only the best man to win; for thus nothing\nwill go against you. But abstain entirely from acclamations and derision\nand violent emotions. And when you come away, do not discourse a great\ndeal on what has passed and what contributes nothing to your own\namendment. For it would appear by such discourse that you were dazzled by\nthe show.\n\nBe not prompt or ready to attend private recitations; but if you do\nattend, preserve your gravity and dignity, and yet avoid making yourself\ndisagreeable.\n\nWhen you are going to confer with anyone, and especially with one who\nseems your superior, represent to yourself how Socrates or Zeno[6] would\nbehave in such a case, and you will not be at a loss to meet properly\nwhatever may occur.\n\nWhen you are going before anyone in power, fancy to yourself that you may\nnot find him at home, that you may be shut out, that the doors may not be\nopened to you, that he may not notice you. If, with all this, it be your\nduty to go, bear what happens and never say to yourself, \"It was not\nworth so much\"; for this is vulgar, and like a man bewildered by\nexternals.\n\nIn company, avoid a frequent and excessive mention of your own actions\nand dangers. For however agreeable it may be to yourself to allude to the\nrisks you have run, it is not equally agreeable to others to hear your\nadventures. Avoid likewise an endeavor to excite laughter, for this may\nreadily slide you into vulgarity, and, besides, may be apt to lower you\nin the esteem of your acquaintance. Approaches to indecent discourse are\nlikewise dangerous. Therefore, when anything of this sort happens, use\nthe first fit opportunity to rebuke him who makes advances that way, or,\nat least, by silence and blushing and a serious look show yourself to be\ndispleased by such talk.\n\n\n                                 XXXIV\n\nIf you are dazzled by the semblance of any promised pleasure, guard\nyourself against being bewildered by it; but let the affair wait your\nleisure, and procure yourself some delay. Then bring to your mind both\npoints of time--that in which you shall enjoy the pleasure, and that in\nwhich you will repent and reproach yourself, after you have enjoyed\nit--and set before you, in opposition to these, how you will rejoice and\napplaud yourself if you abstain. And even though it should appear to you\na seasonable gratification, take heed that its enticements and\nallurements and seductions may not subdue you, but set in opposition to\nthis how much better it is to be conscious of having gained so great a\nvictory.\n\n\n                                  XXXV\n\nWhen you do anything from a clear judgment that it ought to be done,\nnever shrink from being seen to do it, even though the world should\nmisunderstand it; for if you are not acting rightly, shun the action\nitself; if you are, why fear those who wrongly censure you?\n\n\n                                 XXXVI\n\nAs the proposition, \"either it is day or it is night,\" has much force in\na disjunctive argument, but none at all in a conjunctive one, so, at a\nfeast, to choose the largest share is very suitable to the bodily\nappetite, but utterly inconsistent with the social spirit of the\nentertainment. Remember, then, when you eat with another, not only the\nvalue to the body of those things which are set before you, but also the\nvalue of proper courtesy toward your host.\n\n\n                                 XXXVII\n\nIf you have assumed any character beyond your strength, you have both\ndemeaned yourself ill in that and quitted one which you might have\nsupported.\n\n\n                                XXXVIII\n\nAs in walking you take care not to tread upon a nail, or turn your foot,\nso likewise take care not to hurt the ruling faculty of your mind. And if\nwe were to guard against this in every action, we should enter upon\naction more safely.\n\n\n                                 XXXIX\n\nThe body is to everyone the proper measure of its possessions, as the\nfoot is of the shoe. If, therefore, you stop at this, you will keep the\nmeasure; but if you move beyond it, you must necessarily be carried\nforward, as down a precipice; as in the case of a shoe, if you go beyond\nits fitness to the foot, it comes first to be gilded, then purple, and\nthen studded with jewels. For to that which once exceeds the fit measure\nthere is no bound.\n\n\n                                   XL\n\nWomen from fourteen years old are flattered by men with the title of\nmistresses. Therefore, perceiving that they are regarded only as\nqualified to give men pleasure, they begin to adorn themselves, and in\nthat to place all their hopes. It is worth while, therefore, to try that\nthey may perceive themselves honored only so far as they appear beautiful\nin their demeanor and modestly virtuous.\n\n\n                                  XLI\n\nIt is a mark of want of intellect to spend much time in things relating\nto the body, as to be immoderate in exercises, in eating and drinking,\nand in the discharge of other animal functions. These things should be\ndone incidentally and our main strength be applied to our reason.\n\n\n                                  XLII\n\nWhen any person does ill by you, or speaks ill of you, remember that he\nacts or speaks from an impression that it is right for him to do so. Now\nit is not possible that he should follow what appears right to you, but\nonly what appears so to himself. Therefore, if he judges from false\nappearances, he is the person hurt, since he, too, is the person\ndeceived. For if anyone takes a true proposition to be false, the\nproposition is not hurt, but only the man is deceived. Setting out, then,\nfrom these principles, you will meekly bear with a person who reviles\nyou, for you will say upon every occasion, \"It seemed so to him.\"\n\n\n                                 XLIII\n\nEverything has two handles: one by which it may be borne, another by\nwhich it cannot. If your brother acts unjustly, do not lay hold on the\naffair by the handle of his injustice, for by that it cannot be borne,\nbut rather by the opposite--that he is your brother, that he was brought\nup with you; and thus you will lay hold on it as it is to be borne.\n\n\n                                  XLIV\n\nThese reasonings have no logical connection: \"I am richer than you,\ntherefore I am your superior.\" \"I am more eloquent than you, therefore I\nam your superior.\" The true logical connection is rather this: \"I am\nricher than you, therefore my possessions must exceed yours.\" \"I am more\neloquent than you, therefore my style must surpass yours.\" But you, after\nall, consist neither in property nor in style.\n\n\n                                  XLV\n\nDoes anyone bathe hastily? Do not say that he does it ill, but hastily.\nDoes anyone drink much wine? Do not say that he does ill, but that he\ndrinks a great deal. For unless you perfectly understand his motives, how\nshould you know if he acts ill? Thus you will not risk yielding to any\nappearances but such as you fully comprehend.\n\n\n                                  XLVI\n\nNever proclaim yourself a philosopher, nor make much talk among the\nignorant about your principles, but show them by actions. Thus, at an\nentertainment, do not discourse how people ought to eat, but eat as you\nought. For remember that thus Socrates also universally avoided all\nostentation. And when persons came to him and desired to be introduced by\nhim to philosophers, he took them and introduced them; so well did he\nbear being overlooked. So if ever there should be among the ignorant any\ndiscussion of principles, be for the most part silent. For there is great\ndanger in hastily throwing out what is undigested. And if anyone tells\nyou that you know nothing, and you are not nettled at it, then you may be\nsure that you have really entered on your work. For sheep do not hastily\nthrow up the grass to show the shepherds how much they have eaten, but,\ninwardly digesting their food, they produce it outwardly in wool and\nmilk. Thus, therefore, do you not make an exhibition before the ignorant\nof your principles, but of the actions to which their digestion gives\nrise.\n\n\n                                 XLVII\n\nWhen you have learned to nourish your body frugally, do not pique\nyourself upon it; nor, if you drink water, be saying upon every occasion,\n\"I drink water.\" But first consider how much more frugal are the poor\nthan we, and how much more patient of hardship. If at any time you would\ninure yourself by exercise to labor and privation, for your own sake and\nnot for the public, do not attempt great feats; but when you are\nviolently thirsty, just rinse your mouth with water, and tell nobody.\n\n\n                                 XLVIII\n\nThe condition and characteristic of a vulgar person is that he never\nlooks for either help or harm from himself, but only from externals. The\ncondition and characteristic of a philosopher is that he looks to himself\nfor all help or harm. The marks of a proficient are that he censures no\none, praises no one, blames no one, accuses no one; says nothing\nconcerning himself as being anybody or knowing anything. When he is in\nany instance hindered or restrained, he accuses himself; and if he is\npraised, he smiles to himself at the person who praises him; and if he is\ncensured, he makes no defense. But he goes about with the caution of a\nconvalescent, careful of interference with anything that is doing well\nbut not yet quite secure. He restrains desire; he transfers his aversion\nto those things only which thwart the proper use of our own will; he\nemploys his energies moderately in all directions; if he appears stupid\nor ignorant, he does not care; and, in a word, he keeps watch over\nhimself as over an enemy and one in ambush.\n\n\n                                  XLIX\n\nWhen anyone shows himself vain on being able to understand and interpret\nthe works of Chrysippus,[7] say to yourself: \"Unless Chrysippus had\nwritten obscurely, this person would have had nothing to be vain of. But\nwhat do I desire? To understand nature, and follow her. I ask, then, who\ninterprets her; and hearing that Chrysippus does, I have recourse to him.\nI do not understand his writings. I seek, therefore, one to interpret\n_them_.\" So far there is nothing to value myself upon. And when I find an\ninterpreter, what remains is to make use of his instructions. This alone\nis the valuable thing. But if I admire merely the interpretation, what do\nI become more than a grammarian, instead of a philosopher, except,\nindeed, that instead of Homer I interpret Chrysippus? When anyone,\ntherefore, desires me to read Chrysippus to him, I rather blush when I\ncannot exhibit actions that are harmonious and consonant with his\ndiscourse.\n\n\n                                   L\n\nWhatever rules you have adopted, abide by them as laws, and as if you\nwould be impious to transgress them; and do not regard what anyone says\nof you, for this, after all, is no concern of yours. How long, then, will\nyou delay to demand of yourself the noblest improvements, and in no\ninstance to transgress the judgments of reason? You have received the\nphilosophic principles with which you ought to be conversant; and you\nhave been conversant with them. For what other master, then, do you wait\nas an excuse for this delay in self-reformation? You are no longer a boy\nbut a grown man. If, therefore, you will be negligent and slothful, and\nalways add procrastination to procrastination, purpose to purpose, and\nfix day after day in which you will attend to yourself, you will\ninsensibly continue to accomplish nothing and, living and dying, remain\nof vulgar mind. This instant, then, think yourself worthy of living as a\nman grown up and a proficient. Let whatever appears to be the best be to\nyou an inviolable law. And if any instance of pain or pleasure, glory or\ndisgrace, be set before you, remember that now is the combat, now the\nOlympiad comes on, nor can it be put off; and that by one failure and\ndefeat honor may be lost or--won. Thus Socrates became perfect, improving\nhimself by everything, following reason alone. And though you are not yet\na Socrates, you ought, however, to live as one seeking to be a Socrates.\n\n\n                                   LI\n\nThe first and most necessary topic in philosophy is the practical\napplication of principles, as, _We ought not to lie_; the second is that\nof demonstrations as, _Why it is that we ought not to lie_; the third,\nthat which gives strength and logical connection to the other two, as,\n_Why this is a demonstration_. For what is demonstration? What is a\nconsequence? What a contradiction? What truth? What falsehood? The third\npoint is then necessary on account of the second; and the second on\naccount of the first. But the most necessary, and that whereon we ought\nto rest, is the first. But we do just the contrary. For we spend all our\ntime on the third point and employ all our diligence about that, and\nentirely neglect the first. Therefore, at the same time that we lie, we\nare very ready to show how it is demonstrated that lying is wrong.\n\nUpon all occasions we ought to have these maxims ready at hand:\n\n  Conduct me, Zeus, and thou, O Destiny,\n  Wherever your decrees have fixed my lot.\n  I follow cheerfully; and, did I not,\n  Wicked and wretched, I must follow still.[8]\n\n  Who'er yields properly to Fate is deemed\n  Wise among men, and knows the laws of Heaven.[9]\n\nAnd this third:\n\n  \"O Crito, if it thus pleases the gods, thus let it be.\"[10]\n\n  \"Anytus and Melitus may kill me indeed; but hurt me they cannot.\"[11]\n\n\n\n\n                               Footnotes\n\n\n[1]Happiness, the effect of virtue, is the mark which God has set up for\n   us to aim at. Our missing it is no work of His; nor so properly\n   anything real, as a mere negative and failure of our own.\n\n[2][Chapter XV of the third book of the _Discourses_, which, with the\n   exception of some very trifling differences, is the same as chapter\n   XXIX of the _Enchiridion_.--Ed.]\n\n[3]Euphrates was a philosopher of Syria, whose character is described,\n   with the highest encomiums, by Pliny the Younger, _Letters_ I. 10.\n\n[4][The two inimical sons of Oedipus, who killed each other in\n   battle.--Ed.]\n\n[5][This refers to an anecdote given in full by Simplicius, in his\n   commentary on this passage, of a man assaulted and killed on his way\n   to consult the oracle, while his companion, deserting him, took refuge\n   in the temple till cast out by the Deity.--Tr.]\n\n[6][Reference is to Zeno of Cyprus (335-263 B.C.), the founder of the\n   Stoic school.--Ed.]\n\n[7][Chrysippus (_c._ 280-207 B.C.) was a Stoic philosopher who became\n   head of the Stoa after Cleanthes. His works, which are lost, were most\n   influential and were generally accepted as the authoritative\n   interpretation of orthodox Stoic philosophy.--Ed.]\n\n[8]Cleanthes, in Diogenes Laertius, quoted also by Seneca, _Epistle_ 107.\n\n[9]Euripides, Fragments.\n\n[10]Plato, _Crito_, Chap. XVII.\n\n[11]Plato, _Apology_, Chap. XVIII.\n\n\n\n\n                      The Library of Liberal Arts\n\n\n  Aeschylus: _Prometheus Bound_. Tr. E. B. Browning. (LLA 24)        .40\n  *Alembert, d': _Introduction to the Encyclopedie of 1751_. Tr. T.\n          D. Lockwood. (LLA 88)                                      .80\n  *Aristotle: _Nicomachean Ethics_. Tr. M. Ostwald. (LLA 75)         .80\n  ----: _On the Art of Poetry_. Tr. S. H. Butcher. (LLA 6)           .50\n  *----: _On Poetry and Style_. Tr. G. M. A. Grube. (LLA 68)         .75\n  Augustine: _On Christian Doctrine_. Tr. D. W. Robertson, Jr. (LLA\n          80)                                                        .95\n  *Bacon: _The New Organon_. (LLA 97)                               1.00\n  *Beccaria: _Of Crimes and Punishments_. Tr. H. Paolucci & V.\n          Caporale. (LLA 107)                                        .60\n  Bergson: _An Introduction to Metaphysics_. Tr. T. E. Hulme. (LLA\n          10)                                                        .40\n  *Berkeley: _An Essay Toward a New Theory of Vision & The Theory\n          of Vision Vindicated_. (LLA 83)                            .80\n  ----: _A Treatise Concerning the Principles of Human Knowledge_.\n          (LLA 53)                                                   .75\n  ----: _Three Dialogues between Hylas and Philonous_. (LLA 39)      .75\n  _Boccaccio on Poetry._ Tr. C. G. Osgood. (LLA 82)     _cl. $3.50_ 1.25\n  *Boethius: _The Consolation of Philosophy_. Tr. R. H. Green. (LLA\n          86)                                                        .95\n  Bonaventura: _The Mind's Road to God_. Tr. G. Boas. (LLA 32)       .50\n  Bowman: _The Absurdity of Christianity and Other Essays_. (LLA\n          56)                                                        .75\n  Bradley: _Ethical Studies (Selected Essays)_. (LLA 28) _cl. $2.00_ .85\n  *Burke: _On the Sublime and Beautiful_. (LLA 99)                   .90\n  ----: _Reflections on the Revolution in France_. (LLA 46)\n                                                        _cl. $3.50_ 1.25\n  Butler: _Five Sermons_. (LLA 21)                                   .60\n  Calvin: _On the Christian Faith_. (LLA 93)                         .95\n  ----: _On God and Political Duty_. (LLA 23)                        .60\n  *_The Cid._ Tr. J. G. Markley. (LLA 77)                            .75\n  Cornford: _Plato and Parmenides_. (LLA 102)                       1.60\n  ----: _Plato's Cosmology_. (LLA 101)                              1.75\n  ----: _Plato's Theory of Knowledge_. (LLA 100)                    1.75\n  *Dante: _De vulgari eloquentia_. Tr. W. T. H. Jackson. (LLA 85)    .60\n  ----: _On World-Government (De Monarchia)_. Tr. H. W. Schneider.\n          (LLA 15)                                                   .60\n  Descartes: _Discourse on Method_. Tr. L. J. Lafleur. (LLA 19)      .50\n  *----: _Discourse on Method and Meditations_. Tr. L. J. Lafleur.\n          (LLA 89)                                                   .90\n  ----: _Meditations_. Tr. L. J. Lafleur. (LLA 29)                   .60\n  Dostoevski: _The Grand Inquisitor on the Nature of Man_. Tr. C.\n          Garnett. (LLA 63)                                          .40\n  *Dryden: _An Essay of Dramatic Poesy_. (LLA 104)                   .60\n  Emerson: _Nature_. (LLA 2)                                         .40\n  Epictetus: _The Enchiridion_. Tr. T. W. Higginson. (LLA 8)         .40\n  Erasmus: _Ten Colloquies of Erasmus_. Tr. C. R. Thompson. (LLA\n          48)                                            _cl. $3.00_ .90\n  Euripides: _Electra_. Tr. M. Hadas. (LLA 26)                       .40\n  Fichte: _The Vocation of Man_. Tr. W. Smith. (LLA 50)              .75\n  Goethe: _Faust I._ Tr. B. Q. Morgan. (LLA 33)          _cl. $2.50_ .75\n  Grotius: _Prolegomena to the Law of War and Peace_. Tr. F. W.\n          Kelsey. (LLA 65)                                           .50\n  Hanslick: _The Beautiful in Music_. (LLA 45)           _cl. $2.50_ .80\n  Harrington: _The Political Writings of James Harrington_. (LLA\n          38)                                            _cl. $3.00_ .90\n  Hegel: _Reason in History_. Tr. R. S. Hartman. (LLA 35)\n                                                         _cl. $2.75_ .75\n  Hesiod: _Theogony_. Tr. N. O. Brown. (LLA 36)                      .50\n  Hobbes: _Leviathan I-II_. (LLA 69)                                1.00\n  *Hume.: _David Hume's Literary Essays_. (LLA 84)                   .90\n  ----: _David Hume's Political Essays_. (LLA 34)        _cl. $3.00_ .90\n  ----: _An Inquiry Concerning Human Understanding_. (LLA 49)        .80\n  ----: _An Inquiry Concerning the Principles of Morals_. (LLA 62)   .75\n  *Kant: _Critique of the Aesthetic Judgment_. Tr. W. Cerf. (LLA\n          73)                                                       1.25\n  ----: _Critique of Practical Reason_. Tr. L. W. Beck. (LLA 52)     .90\n  ----: _Fundamental Principles of the Metaphysic of Morals_. Tr.\n          T. K. Abbott. (LLA 16)                                     .60\n  ----: _Perpetual Peace_. Tr. M. C. Smith. (LLA 3)                  .45\n  ----: _Perpetual Peace_. Tr. L. W. Beck. (LLA 54)                  .50\n  *----: _Perpetual Peace and the Idea of a Universal\n          Commonwealth_. Tr. L. W. Beck. (LLA 96)                    .75\n  *----: _Philosophy of Right_. Tr. J. Ladd. (LLA 72)               1.25\n  ----: _Prolegomena to Any Future Metaphysics_. Tr. Mahaffy-Carus;\n          rev. L. W. Beck. (LLA 27)                      _cl. $2.00_ .85\n  *----: _Religion within the Limits of Reason_. Tr. T. M. Green.\n          (LLA 108)                                     _cl. $3.50_ 1.00\n  Kleist: _The Prince of Homburg_. Tr. C. E. Passage. (LLA 60)       .75\n  *Le Bon: _Mass Psychology (The Crowd)_. (LLA 90)                   .80\n  *Leibniz: _Monadology and Other Philosophical Essays_. Tr. P. &\n          A. Schrecker. (LLA 94)                                     .90\n  *Lessing: _Laocooen_. Tr. E. A. McCormick. (LLA 78)                 .95\n  _The Life of Lazarillo de Tormes._ Tr. J. G. Markley. (LLA 37)     .50\n  Locke: _A Letter Concerning Toleration_. (LLA 22)                  .40\n  ----: _The Second Treatise of Government_. (LLA 31)    _cl. $2.50_ .80\n  Longinus: _On Great Writing (On the Sublime)_. Tr. G. M. A.\n          Grube. (LLA 79)                                            .60\n  Machiavelli: _Mandragola_. Tr. A. & H. Paolucci. (LLA 58)          .60\n  Mill, J.: _An Essay on Government_. (LLA 47)                       .50\n  Mill, J. S.: _Autobiography_. (LLA 91)                             .90\n  *----: _Nature and Utility of Religion; Two Essays_. (LLA 81)      .60\n  ----: _On Liberty_. (LLA 61)                                       .65\n  ----: _Considerations on Representative Government_. (LLA 71)      .90\n  Mill, J. S. (cont'd): _Theism_. (LLA 64)                           .75\n  ----: _Utilitarianism_. (LLA 1)                                    .50\n  *Moliere: _Tartuffe_. Tr. R. W. Hartle. (LLA 87)                   .50\n  Nietzsche: _The Use and Abuse of History_. (LLA 11)                .50\n  Paine: _The Age of Reason_. (LLA 5)                                .50\n  Plato: _Euthyphro, Apology, Crito_. Tr. F. J. Church. (LLA 4)      .50\n  ----: _Gorgias_. Tr. W. C. Helmbold. (LLA 20)                      .75\n  ----: _Meno_. Tr. B. Jowett. (LLA 12)                              .40\n  ----: _Phaedo_. Tr. F. J. Church. (LLA 30)                         .50\n  ----: _Phaedrus_. Tr. W. C. Helmbold & W. G. Rabinowitz. (LLA 40)  .60\n  *----: _Philebus_. Tr. K. Herbert. (LLA 41)                        .75\n  ----: _Protagoras_. Tr. B. Jowett. (LLA 59)                        .75\n  ----: _Statesman_. Tr. J. B. Skemp. (LLA 57)                       .75\n  ----: _Symposium_. Tr. B. Jowett. (LLA 7)                          .40\n  *----: _Theaetetus_. Tr. F. M. Cornford. (LLA 105)                 .80\n  ----: _Timaeus_. Tr. F. M. Cornford. (LLA 106)                     .80\n  Plautus: _The Haunted House (Mostellaria)_. Tr. F. O. Copley.\n          (LLA 42)                                                   .45\n  ----: _The Menaechmi_. Tr. F. O. Copley. (LLA 17)                  .45\n  ----: _The Rope (Rudens)_. Tr. F. O. Copley. (LLA 43)              .45\n  *Pope: _Essay on Man_. (LLA 103)                                   .50\n  Post: _Significant Cases in British Constitutional Law_. (LLA 66)\n                                                        _cl. $3.50_ 1.25\n  *Rousseau: _Two Discourses_. Tr. V. Gourevitch. (LLA 109)          .80\n  *Russell: _Selected Essays_. (LLA 74)                              .90\n  Schneider: _Sources of Contemporary Philosophical Realism in\n          America_. (LLA 92)                                         .60\n  *Schopenhauer: _Essay on the Freedom of the Will_. Tr. K.\n          Kolenda. (LLA 70)                                          .80\n  Seneca: _Medea_. Tr. M. Hadas. (LLA 55)                            .45\n  ----: _Oedipus_. Tr. M. Hadas. (LLA 44)                            .45\n  ----: _Thyestes_. Tr. M. Hadas. (LLA 76)                           .45\n  *Shelley: _Defence of Poetry_. (LLA 98)                            .50\n  Sophocles: _Electra_. Tr. R. C. Jebb. (LLA 25)                     .40\n  Spinoza: _On the Improvement of the Understanding_. Tr. J. Katz.\n          (LLA 67)                                                   .50\n  Terence: _Phormio_. Tr. F. O. Copley. (LLA 95)                     .45\n  ----: _The Woman of Andros_. Tr. F. O. Copley. (LLA 18)            .45\n  *Tolstoy: _What Is Art?_ Tr. A. Maude. (LLA 51)                    .90\n  Whitman: _Democratic Vistas_. (LLA 9)                              .50\n\n\n                (_Complete catalogue sent upon request_)\n\n* _In preparation._\n\n\n                      THE LIBERAL ARTS PRESS, INC.\n                 153 W. 72nd Street, New York 23, N. Y.\n\n\n\n\n                          Transcriber's Notes\n\n\n--Retained copyright information from the printed edition, althogh this\n  text is public-domain in the country of publication.\n\n--Silently corrected several palpable typos.\n\n--Provided an original cover, released for unrestricted use with this\n  Distributed-Proofreaders eBook.", "title": "The Enchiridion"}