{"summary": "\nA carpenter finds a talking piece of wood and gives it to his poor neighbor, Geppetto, who wants to build a marionette. Geppetto carves the block into a marionette puppet and names him his son, Pinocchio. However, Pinocchio runs away as soon as he learns to walk. The marionette is caught by a Carabiniere, but he assumes that Pinocchio has been mistreated and imprisons Geppetto. Pinocchio goes back to Geppetto's house where he accidentally kills a talking cricket who had warned Pinocchio of the perils of disobedience and hedonism. That evening, Pinocchio falls asleep with his feet on the stove, and wakes to find that they have burned off. Geppetto is released from prison and makes Pinocchio a new pair of feet. In gratitude, Pinocchio promises to attend school, and Geppetto sells his only coat to buy him a school book.\n\nOn his way to school the next morning, Pinocchio encounters the Great Marionette Theatre, and he sells his school book in order to buy a ticket for the show. The marionettes on stage recognize him in the audience and call out to him, angering the puppet master Mangiafuoco. The puppet master initially decides to use Pinocchio as firewood but ultimately releases him and gives him five gold pieces to give to Geppetto.\n\nAs Pinocchio travels home to give the coins to his father, he meets a fox and a cat. The Cat pretends to be blind, and the Fox pretends to be lame. A white blackbird tries to warn Pinocchio of their lies, but the blackbird is eaten by the Cat, at which point the Fox states that the blackbird talked too much and had to be silenced. The two animals convince Pinocchio that if he plants his coins in the Field of Miracles outside the city of Catchfools, then they will grow into a tree with one or two thousand gold coins. On the way to the field, they stop at an inn, where the Fox and the Cat gorge themselves on food at Pinocchio's expense and ask to be awoken by midnight. Two hours before the set time, the pair abandon Pinocchio, leaving him to pay for the meal with one of his coins. They instruct the innkeeper to tell Pinocchio that they left after receiving a message stating that the Cat's eldest kitten had fallen ill and that they would meet Pinocchio at the Field of Miracles in the morning. They take off ahead of Pinocchio and disguise themselves as bandits while Pinocchio continues on toward Catchfools, despite warnings from the Ghost of the Talking Cricket that he had killed earlier. The disguised Fox and Cat ambush Pinocchio, but the puppet escapes to a white house after biting off the Cat's paw. Upon knocking on the door, Pinocchio is greeted by a young fairy with turquoise hair who says she is dead and waiting for a hearse. Unfortunately, while Pinocchio is speaking with the Fairy, the bandits catch him and hang him in a tree. After a while, the Fox and Cat get tired of waiting for the puppet to suffocate, and they leave.\n\nThe Fairy has Pinocchio rescued by summoning a falcon to get him down and having her poodle servant Medoro pick him up in her stagecoach. The Fairy calls in three famous doctors to tell her whether Pinocchio is dead. Two of them, an owl and a crow, are unsure of Pinocchio's status. The third doctor is the Ghost of the Talking Cricket, who says that the puppet is fine, but has been disobedient and hurt his father. The Fairy administers medicine to Pinocchio who consents to take it after four undertaker rabbits arrive to carry away his body, as he will be dead soon if he does not take the medicine. Recovered, Pinocchio lies to the Fairy when she asks what has happened to the gold coins, and his nose grows until it is so long that he cannot turn around in the room. The Fairy explains that Pinocchio's lies are making his nose grow and calls in a flock of 1,000 woodpeckers to chisel it down to normal size. The Fairy sends for Geppetto to come and live with them in the forest cottage.\n\nWhen Pinocchio heads out to meet his father, he once again encounters the Fox and the Cat, who are no longer wearing their disguises. When Pinocchio notices the Cat's missing paw with the right arm in a sling, the Fox claims that they had to sacrifice it to feed a hungry old wolf. They remind the puppet of the Field of Miracles, and finally, he agrees to go with them and plant his gold. After half a day's journey, they reach the city of Catchfools, where every animal in town has done something exceedingly foolish and now suffers as a result. While traversing through Catchfools with the Fox and the Cat, Pinocchio sees that the streets are filled with hairless dogs yawning from hunger, sheared sheep trembling with cold, combless chickens begging for a grain of wheat, large butterflies unable to use their wings because they sold all their lovely colors, tailless peacocks ashamed to show themselves, and bedraggled pheasants scuttling away hurriedly and grieving for their bright feathers of gold and silver lost to them forever. Out of those paupers and beggars, Pinocchio also sees that there are beautiful coaches containing a fox, a hawk, and a vulture. Upon reaching the Field of Miracles, Pinocchio buries his coins and then leaves for the twenty minutes that it will take for his gold to grow into gold coin trees. After Pinocchio leaves, the Fox and the Cat dig up the coins and run away.\n\nOnce Pinocchio returns, he finds no trees and no gold coins and learns of the Fox and the Cat's treachery from a parrot who mocks Pinocchio for falling for their tricks. Pinocchio rushes to the Catchfools courthouse where he reports the theft of the coins to a gorilla judge. Although he is moved by Pinocchio's plea, the judge sentences Pinocchio to four months in prison for the crime of foolishness, and Pinocchio is locked up by the Mastiff Carabiniere. Fortunately, all criminals are released early by the jailers when the unseen young Emperor of Catchfools declares a celebration following his army's victory over the town's enemies. Upon being released, Pinocchio leaves Catchfools.\n\nPinocchio then heads back to the Fairy's house in the forest. He encounters a large serpent stretched across the road. The serpent laughs at Pinocchio and dies upon bursting an artery. While sneaking into a farmer's yard to steal some grapes, Pinocchio is caught in a weasel trap where he encounters a glowworm. The farmer finds Pinocchio and ties him up in the doghouse of his late watch dog Melampo to guard his chicken coop. When Pinocchio foils the chicken-stealing plot of a group of weasels, the farmer frees the puppet as a reward. Pinocchio finally comes to where the cottage was, finds nothing but a gravestone, and believes that the Fairy has died of sorrow.\n\nA friendly pigeon sees Pinocchio mourning the Fairy's death and offers to give him a ride to the seashore, where Geppetto is building a boat in which to search for Pinocchio. They fly to the seashore and see Geppetto out in a boat, but Pinocchio is washed ashore when he tries to swim to his father. Geppetto is then swallowed by The Terrible Dogfish. Pinocchio then accepts a ride from a dolphin to the nearest island called the Island of Busy. Upon arriving on the Island of Busy, Pinocchio can only get food in return for labor. After some encounters with a coal man and a bricklayer, Pinocchio finally offers to carry a lady's jug home in return for food and water. When they get to the lady's house, Pinocchio recognizes the lady as the Fairy, now miraculously old enough to be his mother. She says she will act as Pinocchio's mother, and Pinocchio will begin going to school. She hints that if Pinocchio does well in school and tries his hardest to be good for one whole year, then he will become a real boy. Pinocchio studies hard and rises to the top of his class, but this makes the other schoolboys jealous. The other boys trick Pinocchio into playing hookey by saying they saw a large sea monster at the beach, the same one that swallowed Geppetto. However, the boys were lying and a fight breaks out. One boy named Eugene is hit by Pinocchio's school book, though Pinocchio did not throw it. Pinocchio is accused of injuring Eugene by two Carabinieres, but the puppet escapes. During his escape, Pinocchio saves a drowning Mastiff named Alidoro, a police dog who was chasing him.\n\nIn exchange, Alidoro later saves Pinocchio from The Green Fisherman, who was going to eat the marionette, as Pinocchio returns home. After meeting the Snail that works for the Fairy, Pinocchio is given another chance by the Fairy.\nPinocchio does excellently in school and passes with high honors. The Fairy promises that Pinocchio will be a real boy the next day and says he should invite all his friends to a party. He goes to invite everyone, but he is sidetracked when he meets a boy nicknamed Candlewick who is about to go to a place called Toyland where everyone plays all day and never works. Pinocchio goes along with him when they are taken there by The Coachman, and they have a wonderful time for the next five months.\n\nOne morning in the fifth month, Pinocchio and Candlewick awake with donkeys' ears. A squirrel tells Pinocchio that boys who do nothing but play and never work always turn into donkeys while they are in Toyland. Soon both Pinocchio and Candlewick are fully transformed, and Pinocchio is sold to a circus by The Coachman. He is trained by the ringmaster to do tricks until he falls and sprains his leg. The ringmaster then sells Pinocchio to a man who wants to skin him and make a drum. The man throws the donkey into the sea to drown him. But when the man goes to retrieve the corpse, all he finds is a living marionette. Pinocchio explains that the fish ate all the donkey skin off him, and he is now a puppet again.\n\nPinocchio dives back into the water and swims out to sea. When the Terrible Dogfish appears, Pinocchio swims from it at the advice of the Fairy in the form of a little blue-furred goat from atop a high rock. Pinocchio does his best to outswim the Dogfish but is swallowed by it. Inside the Dogfish, Pinocchio sees a light from far off and follows it. At the other end is Geppetto who has been living on a ship inside the Dogfish. Pinocchio and Geppetto manage to escape the monster and search for a place to stay.\nPinocchio and Geppetto pass two beggars: the Fox and the Cat. The Cat has really become blind, and the Fox has really become lame and is also thin, is almost hairless, and has chopped off his tail to sell for food. The Fox and the Cat plead for food or money, but Pinocchio rebuffs them and tells them that their misfortunes have served them right for their wickedness. Gepetto and Pinocchio arrive at a small house, which is home to the Ghost of the Talking Cricket. The Talking Cricket says they can stay and reveals that he got his house from a little goat with turquoise hair. Pinocchio gets a job doing work for a farmer named Giangio and recognizes the farmer's dying donkey as his friend Candlewick.\n\nAfter long months of working for the farmer and supporting the ailing Geppetto, Pinocchio goes to town with the forty pennies he has saved to buy himself a new suit. He discovers that the Fairy is ill and needs money. Pinocchio instantly gives the Snail he met back on the Island of Busy all the money he has, promising that he will help his mother as much as he is helping his father. That night, he dreams that he is visited by the Fairy, who kisses him. When he wakes up, he is a real boy at last. His former puppet body lies lifeless on a chair. Furthermore, Pinocchio finds that the Fairy has left him a new suit, boots, and a bag in which he thinks are the forty pennies that he originally gave to her. Instead, the boy is shocked to find forty freshly-minted gold coins. Geppetto also returns to health and resumes woodcarving.\n\n", "full_text": "Dashes; small checks; quick pass; gutchecked twice; jeebies; spellcheck\n\n\nTHE ADVENTURES OF PINOCCHIO\n\nby C. Collodi\n\n[Pseudonym of Carlo Lorenzini]\n\n\nTranslated from the Italian by Carol Della Chiesa\n\n\n\n\n\nCHAPTER 1\n\nHow it happened that Mastro Cherry, carpenter, found a piece of wood\nthat wept and laughed like a child.\n\n\nCenturies ago there lived--\n\n\"A king!\" my little readers will say immediately.\n\nNo, children, you are mistaken. Once upon a time there was a piece of\nwood. It was not an expensive piece of wood. Far from it. Just a common\nblock of firewood, one of those thick, solid logs that are put on the\nfire in winter to make cold rooms cozy and warm.\n\nI do not know how this really happened, yet the fact remains that\none fine day this piece of wood found itself in the shop of an old\ncarpenter. His real name was Mastro Antonio, but everyone called him\nMastro Cherry, for the tip of his nose was so round and red and shiny\nthat it looked like a ripe cherry.\n\nAs soon as he saw that piece of wood, Mastro Cherry was filled with joy.\nRubbing his hands together happily, he mumbled half to himself:\n\n\"This has come in the nick of time. I shall use it to make the leg of a\ntable.\"\n\nHe grasped the hatchet quickly to peel off the bark and shape the wood.\nBut as he was about to give it the first blow, he stood still with arm\nuplifted, for he had heard a wee, little voice say in a beseeching tone:\n\"Please be careful! Do not hit me so hard!\"\n\nWhat a look of surprise shone on Mastro Cherry's face! His funny face\nbecame still funnier.\n\nHe turned frightened eyes about the room to find out where that wee,\nlittle voice had come from and he saw no one! He looked under the\nbench--no one! He peeped inside the closet--no one! He searched among\nthe shavings--no one! He opened the door to look up and down the\nstreet--and still no one!\n\n\"Oh, I see!\" he then said, laughing and scratching his Wig. \"It can\neasily be seen that I only thought I heard the tiny voice say the words!\nWell, well--to work once more.\"\n\nHe struck a most solemn blow upon the piece of wood.\n\n\"Oh, oh! You hurt!\" cried the same far-away little voice.\n\nMastro Cherry grew dumb, his eyes popped out of his head, his mouth\nopened wide, and his tongue hung down on his chin.\n\nAs soon as he regained the use of his senses, he said, trembling and\nstuttering from fright:\n\n\"Where did that voice come from, when there is no one around? Might it\nbe that this piece of wood has learned to weep and cry like a child? I\ncan hardly believe it. Here it is--a piece of common firewood, good\nonly to burn in the stove, the same as any other. Yet--might someone be\nhidden in it? If so, the worse for him. I'll fix him!\"\n\nWith these words, he grabbed the log with both hands and started to\nknock it about unmercifully. He threw it to the floor, against the walls\nof the room, and even up to the ceiling.\n\nHe listened for the tiny voice to moan and cry. He waited two\nminutes--nothing; five minutes--nothing; ten minutes--nothing.\n\n\"Oh, I see,\" he said, trying bravely to laugh and ruffling up his wig\nwith his hand. \"It can easily be seen I only imagined I heard the tiny\nvoice! Well, well--to work once more!\"\n\nThe poor fellow was scared half to death, so he tried to sing a gay song\nin order to gain courage.\n\nHe set aside the hatchet and picked up the plane to make the wood smooth\nand even, but as he drew it to and fro, he heard the same tiny voice.\nThis time it giggled as it spoke:\n\n\"Stop it! Oh, stop it! Ha, ha, ha! You tickle my stomach.\"\n\nThis time poor Mastro Cherry fell as if shot. When he opened his eyes,\nhe found himself sitting on the floor.\n\nHis face had changed; fright had turned even the tip of his nose from\nred to deepest purple.\n\n\n\nCHAPTER 2\n\nMastro Cherry gives the piece of wood to his friend Geppetto, who\ntakes it to make himself a Marionette that will dance, fence, and turn\nsomersaults.\n\n\nIn that very instant, a loud knock sounded on the door. \"Come in,\" said\nthe carpenter, not having an atom of strength left with which to stand\nup.\n\nAt the words, the door opened and a dapper little old man came in.\nHis name was Geppetto, but to the boys of the neighborhood he was\nPolendina,* on account of the wig he always wore which was just the\ncolor of yellow corn.\n\n     * Cornmeal mush\n\nGeppetto had a very bad temper. Woe to the one who called him Polendina!\nHe became as wild as a beast and no one could soothe him.\n\n\"Good day, Mastro Antonio,\" said Geppetto. \"What are you doing on the\nfloor?\"\n\n\"I am teaching the ants their A B C's.\"\n\n\"Good luck to you!\"\n\n\"What brought you here, friend Geppetto?\"\n\n\"My legs. And it may flatter you to know, Mastro Antonio, that I have\ncome to you to beg for a favor.\"\n\n\"Here I am, at your service,\" answered the carpenter, raising himself on\nto his knees.\n\n\"This morning a fine idea came to me.\"\n\n\"Let's hear it.\"\n\n\"I thought of making myself a beautiful wooden Marionette. It must be\nwonderful, one that will be able to dance, fence, and turn somersaults.\nWith it I intend to go around the world, to earn my crust of bread and\ncup of wine. What do you think of it?\"\n\n\"Bravo, Polendina!\" cried the same tiny voice which came from no one\nknew where.\n\nOn hearing himself called Polendina, Mastro Geppetto turned the color of\na red pepper and, facing the carpenter, said to him angrily:\n\n\"Why do you insult me?\"\n\n\"Who is insulting you?\"\n\n\"You called me Polendina.\"\n\n\"I did not.\"\n\n\"I suppose you think _I_ did! Yet I KNOW it was you.\"\n\n\"No!\"\n\n\"Yes!\"\n\n\"No!\"\n\n\"Yes!\"\n\nAnd growing angrier each moment, they went from words to blows, and\nfinally began to scratch and bite and slap each other.\n\nWhen the fight was over, Mastro Antonio had Geppetto's yellow wig in his\nhands and Geppetto found the carpenter's curly wig in his mouth.\n\n\"Give me back my wig!\" shouted Mastro Antonio in a surly voice.\n\n\"You return mine and we'll be friends.\"\n\nThe two little old men, each with his own wig back on his own head,\nshook hands and swore to be good friends for the rest of their lives.\n\n\"Well then, Mastro Geppetto,\" said the carpenter, to show he bore him no\nill will, \"what is it you want?\"\n\n\"I want a piece of wood to make a Marionette. Will you give it to me?\"\n\nMastro Antonio, very glad indeed, went immediately to his bench to get\nthe piece of wood which had frightened him so much. But as he was about\nto give it to his friend, with a violent jerk it slipped out of his\nhands and hit against poor Geppetto's thin legs.\n\n\"Ah! Is this the gentle way, Mastro Antonio, in which you make your\ngifts? You have made me almost lame!\"\n\n\"I swear to you I did not do it!\"\n\n\"It was _I_, of course!\"\n\n\"It's the fault of this piece of wood.\"\n\n\"You're right; but remember you were the one to throw it at my legs.\"\n\n\"I did not throw it!\"\n\n\"Liar!\"\n\n\"Geppetto, do not insult me or I shall call you Polendina.\"\n\n\"Idiot.\"\n\n\"Polendina!\"\n\n\"Donkey!\"\n\n\"Polendina!\"\n\n\"Ugly monkey!\"\n\n\"Polendina!\"\n\nOn hearing himself called Polendina for the third time, Geppetto lost\nhis head with rage and threw himself upon the carpenter. Then and there\nthey gave each other a sound thrashing.\n\nAfter this fight, Mastro Antonio had two more scratches on his nose,\nand Geppetto had two buttons missing from his coat. Thus having settled\ntheir accounts, they shook hands and swore to be good friends for the\nrest of their lives.\n\nThen Geppetto took the fine piece of wood, thanked Mastro Antonio, and\nlimped away toward home.\n\n\n\nCHAPTER 3\n\nAs soon as he gets home, Geppetto fashions the Marionette and calls it\nPinocchio. The first pranks  of the Marionette.\n\n\nLittle as Geppetto's house was, it was neat and comfortable. It was a\nsmall room on the ground floor, with a tiny window under the stairway.\nThe furniture could not have been much simpler: a very old chair, a\nrickety old bed, and a tumble-down table. A fireplace full of burning\nlogs was painted on the wall opposite the door. Over the fire, there\nwas painted a pot full of something which kept boiling happily away and\nsending up clouds of what looked like real steam.\n\nAs soon as he reached home, Geppetto took his tools and began to cut and\nshape the wood into a Marionette.\n\n\"What shall I call him?\" he said to himself. \"I think I'll call him\nPINOCCHIO. This name will make his fortune. I knew a whole family of\nPinocchi once--Pinocchio the father, Pinocchia the mother, and Pinocchi\nthe children--and they were all lucky. The richest of them begged for\nhis living.\"\n\nAfter choosing the name for his Marionette, Geppetto set seriously to\nwork to make the hair, the forehead, the eyes. Fancy his surprise\nwhen he noticed that these eyes moved and then stared fixedly at him.\nGeppetto, seeing this, felt insulted and said in a grieved tone:\n\n\"Ugly wooden eyes, why do you stare so?\"\n\nThere was no answer.\n\nAfter the eyes, Geppetto made the nose, which began to stretch as soon\nas finished. It stretched and stretched and stretched till it became so\nlong, it seemed endless.\n\nPoor Geppetto kept cutting it and cutting it, but the more he cut, the\nlonger grew that impertinent nose. In despair he let it alone.\n\nNext he made the mouth.\n\nNo sooner was it finished than it began to laugh and poke fun at him.\n\n\"Stop laughing!\" said Geppetto angrily; but he might as well have spoken\nto the wall.\n\n\"Stop laughing, I say!\" he roared in a voice of thunder.\n\nThe mouth stopped laughing, but it stuck out a long tongue.\n\nNot wishing to start an argument, Geppetto made believe he saw nothing\nand went on with his work. After the mouth, he made the chin, then the\nneck, the shoulders, the stomach, the arms, and the hands.\n\nAs he was about to put the last touches on the finger tips, Geppetto\nfelt his wig being pulled off. He glanced up and what did he see? His\nyellow wig was in the Marionette's hand. \"Pinocchio, give me my wig!\"\n\nBut instead of giving it back, Pinocchio put it on his own head, which\nwas half swallowed up in it.\n\nAt that unexpected trick, Geppetto became very sad and downcast, more so\nthan he had ever been before.\n\n\"Pinocchio, you wicked boy!\" he cried out. \"You are not yet finished,\nand you start out by being impudent to your poor old father. Very bad,\nmy son, very bad!\"\n\nAnd he wiped away a tear.\n\nThe legs and feet still had to be made. As soon as they were done,\nGeppetto felt a sharp kick on the tip of his nose.\n\n\"I deserve it!\" he said to himself. \"I should have thought of this\nbefore I made him. Now it's too late!\"\n\nHe took hold of the Marionette under the arms and put him on the floor\nto teach him to walk.\n\nPinocchio's legs were so stiff that he could not move them, and Geppetto\nheld his hand and showed him how to put out one foot after the other.\n\nWhen his legs were limbered up, Pinocchio started walking by himself and\nran all around the room. He came to the open door, and with one leap he\nwas out into the street. Away he flew!\n\nPoor Geppetto ran after him but was unable to catch him, for Pinocchio\nran in leaps and bounds, his two wooden feet, as they beat on the stones\nof the street, making as much noise as twenty peasants in wooden shoes.\n\n\"Catch him! Catch him!\" Geppetto kept shouting. But the people in the\nstreet, seeing a wooden Marionette running like the wind, stood still to\nstare and to laugh until they cried.\n\nAt last, by sheer luck, a Carabineer* happened along, who, hearing all\nthat noise, thought that it might be a runaway colt, and stood bravely\nin the middle of the street, with legs wide apart, firmly resolved to\nstop it and prevent any trouble.\n\n     * A military policeman\n\nPinocchio saw the Carabineer from afar and tried his best to escape\nbetween the legs of the big fellow, but without success.\n\nThe Carabineer grabbed him by the nose (it was an extremely long one and\nseemed made on purpose for that very thing) and returned him to Mastro\nGeppetto.\n\nThe little old man wanted to pull Pinocchio's ears. Think how he felt\nwhen, upon searching for them, he discovered that he had forgotten to\nmake them!\n\nAll he could do was to seize Pinocchio by the back of the neck and take\nhim home. As he was doing so, he shook him two or three times and said\nto him angrily:\n\n\"We're going home now. When we get home, then we'll settle this matter!\"\n\nPinocchio, on hearing this, threw himself on the ground and refused to\ntake another step. One person after another gathered around the two.\n\nSome said one thing, some another.\n\n\"Poor Marionette,\" called out a man. \"I am not surprised he doesn't want\nto go home. Geppetto, no doubt, will beat him unmercifully, he is so\nmean and cruel!\"\n\n\"Geppetto looks like a good man,\" added another, \"but with boys he's a\nreal tyrant. If we leave that poor Marionette in his hands he may tear\nhim to pieces!\"\n\nThey said so much that, finally, the Carabineer ended matters by setting\nPinocchio at liberty and dragging Geppetto to prison. The poor old\nfellow did not know how to defend himself, but wept and wailed like a\nchild and said between his sobs:\n\n\"Ungrateful boy! To think I tried so hard to make you a well-behaved\nMarionette! I deserve it, however! I should have given the matter more\nthought.\"\n\nWhat happened after this is an almost unbelievable story, but you may\nread it, dear children, in the chapters that follow.\n\n\n\nCHAPTER 4\n\nThe story of Pinocchio and the Talking Cricket, in which one sees that\nbad children do not like to be corrected by those who know more than\nthey do.\n\n\nVery little time did it take to get poor old Geppetto to prison. In\nthe meantime that rascal, Pinocchio, free now from the clutches of the\nCarabineer, was running wildly across fields and meadows, taking one\nshort cut after another toward home. In his wild flight, he leaped over\nbrambles and bushes, and across brooks and ponds, as if he were a goat\nor a hare chased by hounds.\n\nOn reaching home, he found the house door half open. He slipped into\nthe room, locked the door, and threw himself on the floor, happy at his\nescape.\n\nBut his happiness lasted only a short time, for just then he heard\nsomeone saying:\n\n\"Cri-cri-cri!\"\n\n\"Who is calling me?\" asked Pinocchio, greatly frightened.\n\n\"I am!\"\n\nPinocchio turned and saw a large cricket crawling slowly up the wall.\n\n\"Tell me, Cricket, who are you?\"\n\n\"I am the Talking Cricket and I have been living in this room for more\nthan one hundred years.\"\n\n\"Today, however, this room is mine,\" said the Marionette, \"and if you\nwish to do me a favor, get out now, and don't turn around even once.\"\n\n\"I refuse to leave this spot,\" answered the Cricket, \"until I have told\nyou a great truth.\"\n\n\"Tell it, then, and hurry.\"\n\n\"Woe to boys who refuse to obey their parents and run away from home!\nThey will never be happy in this world, and when they are older they\nwill be very sorry for it.\"\n\n\"Sing on, Cricket mine, as you please. What I know is, that tomorrow,\nat dawn, I leave this place forever. If I stay here the same thing will\nhappen to me which happens to all other boys and girls. They are sent to\nschool, and whether they want to or not, they must study. As for me,\nlet me tell you, I hate to study! It's much more fun, I think, to chase\nafter butterflies, climb trees, and steal birds' nests.\"\n\n\"Poor little silly! Don't you know that if you go on like that, you\nwill grow into a perfect donkey and that you'll be the laughingstock of\neveryone?\"\n\n\"Keep still, you ugly Cricket!\" cried Pinocchio.\n\nBut the Cricket, who was a wise old philosopher, instead of being\noffended at Pinocchio's impudence, continued in the same tone:\n\n\"If you do not like going to school, why don't you at least learn a\ntrade, so that you can earn an honest living?\"\n\n\"Shall I tell you something?\" asked Pinocchio, who was beginning to lose\npatience. \"Of all the trades in the world, there is only one that really\nsuits me.\"\n\n\"And what can that be?\"\n\n\"That of eating, drinking, sleeping, playing, and wandering around from\nmorning till night.\"\n\n\"Let me tell you, for your own good, Pinocchio,\" said the Talking\nCricket in his calm voice, \"that those who follow that trade always end\nup in the hospital or in prison.\"\n\n\"Careful, ugly Cricket! If you make me angry, you'll be sorry!\"\n\n\"Poor Pinocchio, I am sorry for you.\"\n\n\"Why?\"\n\n\"Because you are a Marionette and, what is much worse, you have a wooden\nhead.\"\n\nAt these last words, Pinocchio jumped up in a fury, took a hammer from\nthe bench, and threw it with all his strength at the Talking Cricket.\n\nPerhaps he did not think he would strike it. But, sad to relate, my dear\nchildren, he did hit the Cricket, straight on its head.\n\nWith a last weak \"cri-cri-cri\" the poor Cricket fell from the wall,\ndead!\n\n\n\nCHAPTER 5\n\nPinocchio is hungry and looks for an egg to cook himself an omelet; but,\nto his surprise, the omelet flies out of the window.\n\n\nIf the Cricket's death scared Pinocchio at all, it was only for a very\nfew moments. For, as night came on, a queer, empty feeling at the pit of\nhis stomach reminded the Marionette that he had eaten nothing as yet.\n\nA boy's appetite grows very fast, and in a few moments the queer, empty\nfeeling had become hunger, and the hunger grew bigger and bigger, until\nsoon he was as ravenous as a bear.\n\nPoor Pinocchio ran to the fireplace where the pot was boiling and\nstretched out his hand to take the cover off, but to his amazement the\npot was only painted! Think how he felt! His long nose became at least\ntwo inches longer.\n\nHe ran about the room, dug in all the boxes and drawers, and even looked\nunder the bed in search of a piece of bread, hard though it might be,\nor a cookie, or perhaps a bit of fish. A bone left by a dog would have\ntasted good to him! But he found nothing.\n\nAnd meanwhile his hunger grew and grew. The only relief poor Pinocchio\nhad was to yawn; and he certainly did yawn, such a big yawn that his\nmouth stretched out to the tips of his ears. Soon he became dizzy and\nfaint. He wept and wailed to himself: \"The Talking Cricket was right. It\nwas wrong of me to disobey Father and to run away from home. If he were\nhere now, I wouldn't be so hungry! Oh, how horrible it is to be hungry!\"\n\nSuddenly, he saw, among the sweepings in a corner, something round and\nwhite that looked very much like a hen's egg. In a jiffy he pounced upon\nit. It was an egg.\n\nThe Marionette's joy knew no bounds. It is impossible to describe it,\nyou must picture it to yourself. Certain that he was dreaming, he turned\nthe egg over and over in his hands, fondled it, kissed it, and talked to\nit:\n\n\"And now, how shall I cook you? Shall I make an omelet? No, it is better\nto fry you in a pan! Or shall I drink you? No, the best way is to fry\nyou in the pan. You will taste better.\"\n\nNo sooner said than done. He placed a little pan over a foot warmer full\nof hot coals. In the pan, instead of oil or butter, he poured a\nlittle water. As soon as the water started to boil--tac!--he broke the\neggshell. But in place of the white and the yolk of the egg, a little\nyellow Chick, fluffy and gay and smiling, escaped from it. Bowing\npolitely to Pinocchio, he said to him:\n\n\"Many, many thanks, indeed, Mr. Pinocchio, for having saved me the\ntrouble of breaking my shell! Good-by and good luck to you and remember\nme to the family!\"\n\nWith these words he spread out his wings and, darting to the open\nwindow, he flew away into space till he was out of sight.\n\nThe poor Marionette stood as if turned to stone, with wide eyes, open\nmouth, and the empty halves of the egg-shell in his hands. When he came\nto himself, he began to cry and shriek at the top of his lungs, stamping\nhis feet on the ground and wailing all the while:\n\n\"The Talking Cricket was right! If I had not run away from home and if\nFather were here now, I should not be dying of hunger. Oh, how horrible\nit is to be hungry!\"\n\nAnd as his stomach kept grumbling more than ever and he had nothing\nto quiet it with, he thought of going out for a walk to the near-by\nvillage, in the hope of finding some charitable person who might give\nhim a bit of bread.\n\n\n\nCHAPTER 6\n\nPinocchio falls asleep with his feet on a foot warmer, and awakens the\nnext day with his feet all burned off.\n\n\nPinocchio hated the dark street, but he was so hungry that, in spite of\nit, he ran out of the house. The night was pitch black. It thundered,\nand bright flashes of lightning now and again shot across the sky,\nturning it into a sea of fire. An angry wind blew cold and raised dense\nclouds of dust, while the trees shook and moaned in a weird way.\n\nPinocchio was greatly afraid of thunder and lightning, but the hunger he\nfelt was far greater than his fear. In a dozen leaps and bounds, he\ncame to the village, tired out, puffing like a whale, and with tongue\nhanging.\n\nThe whole village was dark and deserted. The stores were closed, the\ndoors, the windows. In the streets, not even a dog could be seen. It\nseemed the Village of the Dead.\n\nPinocchio, in desperation, ran up to a doorway, threw himself upon the\nbell, and pulled it wildly, saying to himself: \"Someone will surely\nanswer that!\"\n\nHe was right. An old man in a nightcap opened the window and looked out.\nHe called down angrily:\n\n\"What do you want at this hour of night?\"\n\n\"Will you be good enough to give me a bit of bread? I am hungry.\"\n\n\"Wait a minute and I'll come right back,\" answered the old fellow,\nthinking he had to deal with one of those boys who love to roam around\nat night ringing people's bells while they are peacefully asleep.\n\nAfter a minute or two, the same voice cried:\n\n\"Get under the window and hold out your hat!\"\n\nPinocchio had no hat, but he managed to get under the window just in\ntime to feel a shower of ice-cold water pour down on his poor wooden\nhead, his shoulders, and over his whole body.\n\nHe returned home as wet as a rag, and tired out from weariness and\nhunger.\n\nAs he no longer had any strength left with which to stand, he sat down\non a little stool and put his two feet on the stove to dry them.\n\nThere he fell asleep, and while he slept, his wooden feet began to burn.\nSlowly, very slowly, they blackened and turned to ashes.\n\nPinocchio snored away happily as if his feet were not his own. At dawn\nhe opened his eyes just as a loud knocking sounded at the door.\n\n\"Who is it?\" he called, yawning and rubbing his eyes.\n\n\"It is I,\" answered a voice.\n\nIt was the voice of Geppetto.\n\n\n\nCHAPTER 7\n\nGeppetto returns home and gives his own breakfast to the Marionette\n\n\nThe poor Marionette, who was still half asleep, had not yet found out\nthat his two feet were burned and gone. As soon as he heard his Father's\nvoice, he jumped up from his seat to open the door, but, as he did so,\nhe staggered and fell headlong to the floor.\n\nIn falling, he made as much noise as a sack of wood falling from the\nfifth story of a house.\n\n\"Open the door for me!\" Geppetto shouted from the street.\n\n\"Father, dear Father, I can't,\" answered the Marionette in despair,\ncrying and rolling on the floor.\n\n\"Why can't you?\"\n\n\"Because someone has eaten my feet.\"\n\n\"And who has eaten them?\"\n\n\"The cat,\" answered Pinocchio, seeing that little animal busily playing\nwith some shavings in the corner of the room.\n\n\"Open! I say,\" repeated Geppetto, \"or I'll give you a sound whipping\nwhen I get in.\"\n\n\"Father, believe me, I can't stand up. Oh, dear! Oh, dear! I shall have\nto walk on my knees all my life.\"\n\nGeppetto, thinking that all these tears and cries were only other pranks\nof the Marionette, climbed up the side of the house and went in through\nthe window.\n\nAt first he was very angry, but on seeing Pinocchio stretched out on the\nfloor and really without feet, he felt very sad and sorrowful. Picking\nhim up from the floor, he fondled and caressed him, talking to him while\nthe tears ran down his cheeks:\n\n\"My little Pinocchio, my dear little Pinocchio! How did you burn your\nfeet?\"\n\n\"I don't know, Father, but believe me, the night has been a terrible one\nand I shall remember it as long as I live. The thunder was so noisy and\nthe lightning so bright--and I was hungry. And then the Talking Cricket\nsaid to me, 'You deserve it; you were bad;' and I said to him, 'Careful,\nCricket;' and he said to me, 'You are a Marionette and you have a wooden\nhead;' and I threw the hammer at him and killed him. It was his own\nfault, for I didn't want to kill him. And I put the pan on the coals,\nbut the Chick flew away and said, 'I'll see you again! Remember me to\nthe family.' And my hunger grew, and I went out, and the old man with a\nnightcap looked out of the window and threw water on me, and I came home\nand put my feet on the stove to dry them because I was still hungry,\nand I fell asleep and now my feet are gone but my hunger isn't!\nOh!--Oh!--Oh!\" And poor Pinocchio began to scream and cry so loudly that\nhe could be heard for miles around.\n\nGeppetto, who had understood nothing of all that jumbled talk, except\nthat the Marionette was hungry, felt sorry for him, and pulling three\npears out of his pocket, offered them to him, saying:\n\n\"These three pears were for my breakfast, but I give them to you gladly.\nEat them and stop weeping.\"\n\n\"If you want me to eat them, please peel them for me.\"\n\n\"Peel them?\" asked Geppetto, very much surprised. \"I should never have\nthought, dear boy of mine, that you were so dainty and fussy about your\nfood. Bad, very bad! In this world, even as children, we must accustom\nourselves to eat of everything, for we never know what life may hold in\nstore for us!\"\n\n\"You may be right,\" answered Pinocchio, \"but I will not eat the pears if\nthey are not peeled. I don't like them.\"\n\nAnd good old Geppetto took out a knife, peeled the three pears, and put\nthe skins in a row on the table.\n\nPinocchio ate one pear in a twinkling and started to throw the core\naway, but Geppetto held his arm.\n\n\"Oh, no, don't throw it away! Everything in this world may be of some\nuse!\"\n\n\"But the core I will not eat!\" cried Pinocchio in an angry tone.\n\n\"Who knows?\" repeated Geppetto calmly.\n\nAnd later the three cores were placed on the table next to the skins.\n\nPinocchio had eaten the three pears, or rather devoured them. Then he\nyawned deeply, and wailed:\n\n\"I'm still hungry.\"\n\n\"But I have no more to give you.\"\n\n\"Really, nothing--nothing?\"\n\n\"I have only these three cores and these skins.\"\n\n\"Very well, then,\" said Pinocchio, \"if there is nothing else I'll eat\nthem.\"\n\nAt first he made a wry face, but, one after another, the skins and the\ncores disappeared.\n\n\"Ah! Now I feel fine!\" he said after eating the last one.\n\n\"You see,\" observed Geppetto, \"that I was right when I told you that one\nmust not be too fussy and too dainty about food. My dear, we never know\nwhat life may have in store for us!\"\n\n\n\nCHAPTER 8\n\nGeppetto makes Pinocchio a new pair of feet, and sells his coat to buy\nhim an A-B-C book.\n\n\nThe Marionette, as soon as his hunger was appeased, started to grumble\nand cry that he wanted a new pair of feet.\n\nBut Mastro Geppetto, in order to punish him for his mischief, let him\nalone the whole morning. After dinner he said to him:\n\n\"Why should I make your feet over again? To see you run away from home\nonce more?\"\n\n\"I promise you,\" answered the Marionette, sobbing, \"that from now on\nI'll be good--\"\n\n\"Boys always promise that when they want something,\" said Geppetto.\n\n\"I promise to go to school every day, to study, and to succeed--\"\n\n\"Boys always sing that song when they want their own will.\"\n\n\"But I am not like other boys! I am better than all of them and I always\ntell the truth. I promise you, Father, that I'll learn a trade, and I'll\nbe the comfort and staff of your old age.\"\n\nGeppetto, though trying to look very stern, felt his eyes fill with\ntears and his heart soften when he saw Pinocchio so unhappy. He said\nno more, but taking his tools and two pieces of wood, he set to work\ndiligently.\n\nIn less than an hour the feet were finished, two slender, nimble little\nfeet, strong and quick, modeled as if by an artist's hands.\n\n\"Close your eyes and sleep!\" Geppetto then said to the Marionette.\n\nPinocchio closed his eyes and pretended to be asleep, while Geppetto\nstuck on the two feet with a bit of glue melted in an eggshell, doing\nhis work so well that the joint could hardly be seen.\n\nAs soon as the Marionette felt his new feet, he gave one leap from the\ntable and started to skip and jump around, as if he had lost his head\nfrom very joy.\n\n\"To show you how grateful I am to you, Father, I'll go to school now.\nBut to go to school I need a suit of clothes.\"\n\nGeppetto did not have a penny in his pocket, so he made his son a little\nsuit of flowered paper, a pair of shoes from the bark of a tree, and a\ntiny cap from a bit of dough.\n\nPinocchio ran to look at himself in a bowl of water, and he felt so\nhappy that he said proudly:\n\n\"Now I look like a gentleman.\"\n\n\"Truly,\" answered Geppetto. \"But remember that fine clothes do not make\nthe man unless they be neat and clean.\"\n\n\"Very true,\" answered Pinocchio, \"but, in order to go to school, I still\nneed something very important.\"\n\n\"What is it?\"\n\n\"An A-B-C book.\"\n\n\"To be sure! But how shall we get it?\"\n\n\"That's easy. We'll go to a bookstore and buy it.\"\n\n\"And the money?\"\n\n\"I have none.\"\n\n\"Neither have I,\" said the old man sadly.\n\nPinocchio, although a happy boy always, became sad and downcast at these\nwords. When poverty shows itself, even mischievous boys understand what\nit means.\n\n\"What does it matter, after all?\" cried Geppetto all at once, as he\njumped up from his chair. Putting on his old coat, full of darns and\npatches, he ran out of the house without another word.\n\nAfter a while he returned. In his hands he had the A-B-C book for his\nson, but the old coat was gone. The poor fellow was in his shirt sleeves\nand the day was cold.\n\n\"Where's your coat, Father?\"\n\n\"I have sold it.\"\n\n\"Why did you sell your coat?\"\n\n\"It was too warm.\"\n\nPinocchio understood the answer in a twinkling, and, unable to restrain\nhis tears, he jumped on his father's neck and kissed him over and over.\n\n\n\nCHAPTER 9\n\nPinocchio sells his A-B-C book to pay his way into the Marionette\nTheater.\n\n\nSee Pinocchio hurrying off to school with his new A-B-C book under\nhis arm! As he walked along, his brain was busy planning hundreds of\nwonderful things, building hundreds of castles in the air. Talking to\nhimself, he said:\n\n\"In school today, I'll learn to read, tomorrow to write, and the day\nafter tomorrow I'll do arithmetic. Then, clever as I am, I can earn a\nlot of money. With the very first pennies I make, I'll buy Father a new\ncloth coat. Cloth, did I say? No, it shall be of gold and silver with\ndiamond buttons. That poor man certainly deserves it; for, after all,\nisn't he in his shirt sleeves because he was good enough to buy a\nbook for me? On this cold day, too! Fathers are indeed good to their\nchildren!\"\n\nAs he talked to himself, he thought he heard sounds of pipes and drums\ncoming from a distance: pi-pi-pi, pi-pi-pi. . .zum, zum, zum, zum.\n\nHe stopped to listen. Those sounds came from a little street that led to\na small village along the shore.\n\n\"What can that noise be? What a nuisance that I have to go to school!\nOtherwise. . .\"\n\nThere he stopped, very much puzzled. He felt he had to make up his mind\nfor either one thing or another. Should he go to school, or should he\nfollow the pipes?\n\n\"Today I'll follow the pipes, and tomorrow I'll go to school. There's\nalways plenty of time to go to school,\" decided the little rascal at\nlast, shrugging his shoulders.\n\nNo sooner said than done. He started down the street, going like the\nwind. On he ran, and louder grew the sounds of pipe and drum: pi-pi-pi,\npi-pi-pi, pi-pi-pi . . .zum, zum, zum, zum.\n\nSuddenly, he found himself in a large square, full of people standing in\nfront of a little wooden building painted in brilliant colors.\n\n\"What is that house?\" Pinocchio asked a little boy near him.\n\n\"Read the sign and you'll know.\"\n\n\"I'd like to read, but somehow I can't today.\"\n\n\"Oh, really? Then I'll read it to you. Know, then, that written in\nletters of fire I see the words: GREAT MARIONETTE THEATER.\n\n\"When did the show start?\"\n\n\"It is starting now.\"\n\n\"And how much does one pay to get in?\"\n\n\"Four pennies.\"\n\nPinocchio, who was wild with curiosity to know what was going on inside,\nlost all his pride and said to the boy shamelessly:\n\n\"Will you give me four pennies until tomorrow?\"\n\n\"I'd give them to you gladly,\" answered the other, poking fun at him,\n\"but just now I can't give them to you.\"\n\n\"For the price of four pennies, I'll sell you my coat.\"\n\n\"If it rains, what shall I do with a coat of flowered paper? I could not\ntake it off again.\"\n\n\"Do you want to buy my shoes?\"\n\n\"They are only good enough to light a fire with.\"\n\n\"What about my hat?\"\n\n\"Fine bargain, indeed! A cap of dough! The mice might come and eat it\nfrom my head!\"\n\nPinocchio was almost in tears. He was just about to make one last offer,\nbut he lacked the courage to do so. He hesitated, he wondered, he could\nnot make up his mind. At last he said:\n\n\"Will you give me four pennies for the book?\"\n\n\"I am a boy and I buy nothing from boys,\" said the little fellow with\nfar more common sense than the Marionette.\n\n\"I'll give you four pennies for your A-B-C book,\" said a ragpicker who\nstood by.\n\nThen and there, the book changed hands. And to think that poor old\nGeppetto sat at home in his shirt sleeves, shivering with cold, having\nsold his coat to buy that little book for his son!\n\n\n\nCHAPTER 10\n\nThe Marionettes recognize their brother Pinocchio, and greet him with\nloud cheers; but the Director, Fire Eater, happens along and poor\nPinocchio almost loses his life.\n\n\nQuick as a flash, Pinocchio disappeared into the Marionette Theater. And\nthen something happened which almost caused a riot.\n\nThe curtain was up and the performance had started.\n\nHarlequin and Pulcinella were reciting on the stage and, as usual, they\nwere threatening each other with sticks and blows.\n\nThe theater was full of people, enjoying the spectacle and laughing till\nthey cried at the antics of the two Marionettes.\n\nThe play continued for a few minutes, and then suddenly, without any\nwarning, Harlequin stopped talking. Turning toward the audience, he\npointed to the rear of the orchestra, yelling wildly at the same time:\n\n\"Look, look! Am I asleep or awake? Or do I really see Pinocchio there?\"\n\n\"Yes, yes! It is Pinocchio!\" screamed Pulcinella.\n\n\"It is! It is!\" shrieked Signora Rosaura, peeking in from the side of\nthe stage.\n\n\"It is Pinocchio! It is Pinocchio!\" yelled all the Marionettes, pouring\nout of the wings. \"It is Pinocchio. It is our brother Pinocchio! Hurrah\nfor Pinocchio!\"\n\n\"Pinocchio, come up to me!\" shouted Harlequin. \"Come to the arms of your\nwooden brothers!\"\n\nAt such a loving invitation, Pinocchio, with one leap from the back of\nthe orchestra, found himself in the front rows. With another leap,\nhe was on the orchestra leader's head. With a third, he landed on the\nstage.\n\nIt is impossible to describe the shrieks of joy, the warm embraces, the\nknocks, and the friendly greetings with which that strange company of\ndramatic actors and actresses received Pinocchio.\n\nIt was a heart-rending spectacle, but the audience, seeing that the play\nhad stopped, became angry and began to yell:\n\n\"The play, the play, we want the play!\"\n\nThe yelling was of no use, for the Marionettes, instead of going on\nwith their act, made twice as much racket as before, and, lifting up\nPinocchio on their shoulders, carried him around the stage in triumph.\n\nAt that very moment, the Director came out of his room. He had such a\nfearful appearance that one look at him would fill you with horror. His\nbeard was as black as pitch, and so long that it reached from his chin\ndown to his feet. His mouth was as wide as an oven, his teeth like\nyellow fangs, and his eyes, two glowing red coals. In his huge, hairy\nhands, a long whip, made of green snakes and black cats' tails twisted\ntogether, swished through the air in a dangerous way.\n\nAt the unexpected apparition, no one dared even to breathe. One could\nalmost hear a fly go by. Those poor Marionettes, one and all, trembled\nlike leaves in a storm.\n\n\"Why have you brought such excitement into my theater;\" the huge fellow\nasked Pinocchio with the voice of an ogre suffering with a cold.\n\n\"Believe me, your Honor, the fault was not mine.\"\n\n\"Enough! Be quiet! I'll take care of you later.\"\n\nAs soon as the play was over, the Director went to the kitchen, where\na fine big lamb was slowly turning on the spit. More wood was needed to\nfinish cooking it. He called Harlequin and Pulcinella and said to them:\n\n\"Bring that Marionette to me! He looks as if he were made of\nwell-seasoned wood. He'll make a fine fire for this spit.\"\n\nHarlequin and Pulcinella hesitated a bit. Then, frightened by a look\nfrom their master, they left the kitchen to obey him. A few minutes\nlater they returned, carrying poor Pinocchio, who was wriggling and\nsquirming like an eel and crying pitifully:\n\n\"Father, save me! I don't want to die! I don't want to die!\"\n\n\n\nCHAPTER 11\n\nFire Eater sneezes and forgives Pinocchio, who saves his friend,\nHarlequin, from death.\n\n\nIn the theater, great excitement reigned.\n\nFire Eater (this was really his name) was very ugly, but he was far from\nbeing as bad as he looked. Proof of this is that, when he saw the poor\nMarionette being brought in to him, struggling with fear and crying, \"I\ndon't want to die! I don't want to die!\" he felt sorry for him and began\nfirst to waver and then to weaken. Finally, he could control himself no\nlonger and gave a loud sneeze.\n\nAt that sneeze, Harlequin, who until then had been as sad as a weeping\nwillow, smiled happily and leaning toward the Marionette, whispered to\nhim:\n\n\"Good news, brother mine! Fire Eater has sneezed and this is a sign that\nhe feels sorry for you. You are saved!\"\n\nFor be it known, that, while other people, when sad and sorrowful, weep\nand wipe their eyes, Fire Eater, on the other hand, had the strange\nhabit of sneezing each time he felt unhappy. The way was just as good as\nany other to show the kindness of his heart.\n\nAfter sneezing, Fire Eater, ugly as ever, cried to Pinocchio:\n\n\"Stop crying! Your wails give me a funny feeling down here in my stomach\nand--E--tchee!--E--tchee!\" Two loud sneezes finished his speech.\n\n\"God bless you!\" said Pinocchio.\n\n\"Thanks! Are your father and mother still living?\" demanded Fire Eater.\n\n\"My father, yes. My mother I have never known.\"\n\n\"Your poor father would suffer terribly if I were to use you as\nfirewood. Poor old man! I feel sorry for him! E--tchee! E--tchee!\nE--tchee!\" Three more sneezes sounded, louder than ever.\n\n\"God bless you!\" said Pinocchio.\n\n\"Thanks! However, I ought to be sorry for myself, too, just now. My good\ndinner is spoiled. I have no more wood for the fire, and the lamb\nis only half cooked. Never mind! In your place I'll burn some other\nMarionette. Hey there! Officers!\"\n\nAt the call, two wooden officers appeared, long and thin as a yard of\nrope, with queer hats on their heads and swords in their hands.\n\nFire Eater yelled at them in a hoarse voice:\n\n\"Take Harlequin, tie him, and throw him on the fire. I want my lamb well\ndone!\"\n\nThink how poor Harlequin felt! He was so scared that his legs doubled up\nunder him and he fell to the floor.\n\nPinocchio, at that heartbreaking sight, threw himself at the feet of\nFire Eater and, weeping bitterly, asked in a pitiful voice which could\nscarcely be heard:\n\n\"Have pity, I beg of you, signore!\"\n\n\"There are no signori here!\"\n\n\"Have pity, kind sir!\"\n\n\"There are no sirs here!\"\n\n\"Have pity, your Excellency!\"\n\nOn hearing himself addressed as your Excellency, the Director of the\nMarionette Theater sat up very straight in his chair, stroked his long\nbeard, and becoming suddenly kind and compassionate, smiled proudly as\nhe said to Pinocchio:\n\n\"Well, what do you want from me now, Marionette?\"\n\n\"I beg for mercy for my poor friend, Harlequin, who has never done the\nleast harm in his life.\"\n\n\"There is no mercy here, Pinocchio. I have spared you. Harlequin must\nburn in your place. I am hungry and my dinner must be cooked.\"\n\n\"In that case,\" said Pinocchio proudly, as he stood up and flung away\nhis cap of dough, \"in that case, my duty is clear. Come, officers!\nTie me up and throw me on those flames. No, it is not fair for poor\nHarlequin, the best friend that I have in the world, to die in my\nplace!\"\n\nThese brave words, said in a piercing voice, made all the other\nMarionettes cry. Even the officers, who were made of wood also, cried\nlike two babies.\n\nFire Eater at first remained hard and cold as a piece of ice; but then,\nlittle by little, he softened and began to sneeze. And after four or\nfive sneezes, he opened wide his arms and said to Pinocchio:\n\n\"You are a brave boy! Come to my arms and kiss me!\"\n\nPinocchio ran to him and scurrying like a squirrel up the long black\nbeard, he gave Fire Eater a loving kiss on the tip of his nose.\n\n\"Has pardon been granted to me?\" asked poor Harlequin with a voice that\nwas hardly a breath.\n\n\"Pardon is yours!\" answered Fire Eater; and sighing and wagging his\nhead, he added: \"Well, tonight I shall have to eat my lamb only half\ncooked, but beware the next time, Marionettes.\"\n\nAt the news that pardon had been given, the Marionettes ran to the stage\nand, turning on all the lights, they danced and sang till dawn.\n\n\n\nCHAPTER 12\n\nFire Eater gives Pinocchio five gold pieces for his father, Geppetto;\nbut the Marionette meets a Fox and a Cat and follows them.\n\n\nThe next day Fire Eater called Pinocchio aside and asked him:\n\n\"What is your father's name?\"\n\n\"Geppetto.\"\n\n\"And what is his trade?\"\n\n\"He's a wood carver.\"\n\n\"Does he earn much?\"\n\n\"He earns so much that he never has a penny in his pockets. Just think\nthat, in order to buy me an A-B-C book for school, he had to sell the\nonly coat he owned, a coat so full of darns and patches that it was a\npity.\"\n\n\"Poor fellow! I feel sorry for him. Here, take these five gold pieces.\nGo, give them to him with my kindest regards.\"\n\nPinocchio, as may easily be imagined, thanked him a thousand times. He\nkissed each Marionette in turn, even the officers, and, beside himself\nwith joy, set out on his homeward journey.\n\nHe had gone barely half a mile when he met a lame Fox and a blind Cat,\nwalking together like two good friends. The lame Fox leaned on the Cat,\nand the blind Cat let the Fox lead him along.\n\n\"Good morning, Pinocchio,\" said the Fox, greeting him courteously.\n\n\"How do you know my name?\" asked the Marionette.\n\n\"I know your father well.\"\n\n\"Where have you seen him?\"\n\n\"I saw him yesterday standing at the door of his house.\"\n\n\"And what was he doing?\"\n\n\"He was in his shirt sleeves trembling with cold.\"\n\n\"Poor Father! But, after today, God willing, he will suffer no longer.\"\n\n\"Why?\"\n\n\"Because I have become a rich man.\"\n\n\"You, a rich man?\" said the Fox, and he began to laugh out loud. The Cat\nwas laughing also, but tried to hide it by stroking his long whiskers.\n\n\"There is nothing to laugh at,\" cried Pinocchio angrily. \"I am very\nsorry to make your mouth water, but these, as you know, are five new\ngold pieces.\"\n\nAnd he pulled out the gold pieces which Fire Eater had given him.\n\nAt the cheerful tinkle of the gold, the Fox unconsciously held out his\npaw that was supposed to be lame, and the Cat opened wide his two eyes\ntill they looked like live coals, but he closed them again so quickly\nthat Pinocchio did not notice.\n\n\"And may I ask,\" inquired the Fox, \"what you are going to do with all\nthat money?\"\n\n\"First of all,\" answered the Marionette, \"I want to buy a fine new coat\nfor my father, a coat of gold and silver with diamond buttons; after\nthat, I'll buy an A-B-C book for myself.\"\n\n\"For yourself?\"\n\n\"For myself. I want to go to school and study hard.\"\n\n\"Look at me,\" said the Fox. \"For the silly reason of wanting to study, I\nhave lost a paw.\"\n\n\"Look at me,\" said the Cat. \"For the same foolish reason, I have lost\nthe sight of both eyes.\"\n\nAt that moment, a Blackbird, perched on the fence along the road, called\nout sharp and clear:\n\n\"Pinocchio, do not listen to bad advice. If you do, you'll be sorry!\"\n\nPoor little Blackbird! If he had only kept his words to himself! In the\ntwinkling of an eyelid, the Cat leaped on him, and ate him, feathers and\nall.\n\nAfter eating the bird, he cleaned his whiskers, closed his eyes, and\nbecame blind once more.\n\n\"Poor Blackbird!\" said Pinocchio to the Cat. \"Why did you kill him?\"\n\n\"I killed him to teach him a lesson. He talks too much. Next time he\nwill keep his words to himself.\"\n\nBy this time the three companions had walked a long distance. Suddenly,\nthe Fox stopped in his tracks and, turning to the Marionette, said to\nhim:\n\n\"Do you want to double your gold pieces?\"\n\n\"What do you mean?\"\n\n\"Do you want one hundred, a thousand, two thousand gold pieces for your\nmiserable five?\"\n\n\"Yes, but how?\"\n\n\"The way is very easy. Instead of returning home, come with us.\"\n\n\"And where will you take me?\"\n\n\"To the City of Simple Simons.\"\n\nPinocchio thought a while and then said firmly:\n\n\"No, I don't want to go. Home is near, and I'm going where Father is\nwaiting for me. How unhappy he must be that I have not yet returned! I\nhave been a bad son, and the Talking Cricket was right when he said that\na disobedient boy cannot be happy in this world. I have learned this\nat my own expense. Even last night in the theater, when Fire Eater. . .\nBrrrr!!!!! . . . The shivers run up and down my back at the mere thought\nof it.\"\n\n\"Well, then,\" said the Fox, \"if you really want to go home, go ahead,\nbut you'll be sorry.\"\n\n\"You'll be sorry,\" repeated the Cat.\n\n\"Think well, Pinocchio, you are turning your back on Dame Fortune.\"\n\n\"On Dame Fortune,\" repeated the Cat.\n\n\"Tomorrow your five gold pieces will be two thousand!\"\n\n\"Two thousand!\" repeated the Cat.\n\n\"But how can they possibly become so many?\" asked Pinocchio wonderingly.\n\n\"I'll explain,\" said the Fox. \"You must know that, just outside the City\nof Simple Simons, there is a blessed field called the Field of Wonders.\nIn this field you dig a hole and in the hole you bury a gold piece.\nAfter covering up the hole with earth you water it well, sprinkle a bit\nof salt on it, and go to bed. During the night, the gold piece sprouts,\ngrows, blossoms, and next morning you find a beautiful tree, that is\nloaded with gold pieces.\"\n\n\"So that if I were to bury my five gold pieces,\" cried Pinocchio with\ngrowing wonder, \"next morning I should find--how many?\"\n\n\"It is very simple to figure out,\" answered the Fox. \"Why, you can\nfigure it on your fingers! Granted that each piece gives you five\nhundred, multiply five hundred by five. Next morning you will find\ntwenty-five hundred new, sparkling gold pieces.\"\n\n\"Fine! Fine!\" cried Pinocchio, dancing about with joy. \"And as soon as\nI have them, I shall keep two thousand for myself and the other five\nhundred I'll give to you two.\"\n\n\"A gift for us?\" cried the Fox, pretending to be insulted. \"Why, of\ncourse not!\"\n\n\"Of course not!\" repeated the Cat.\n\n\"We do not work for gain,\" answered the Fox. \"We work only to enrich\nothers.\"\n\n\"To enrich others!\" repeated the Cat.\n\n\"What good people,\" thought Pinocchio to himself. And forgetting his\nfather, the new coat, the A-B-C book, and all his good resolutions, he\nsaid to the Fox and to the Cat:\n\n\"Let us go. I am with you.\"\n\n\n\nCHAPTER 13\n\nThe Inn of the Red Lobster\n\n\nCat and Fox and Marionette walked and walked and walked. At last, toward\nevening, dead tired, they came to the Inn of the Red Lobster.\n\n\"Let us stop here a while,\" said the Fox, \"to eat a bite and rest for\na few hours. At midnight we'll start out again, for at dawn tomorrow we\nmust be at the Field of Wonders.\"\n\nThey went into the Inn and all three sat down at the same table.\nHowever, not one of them was very hungry.\n\nThe poor Cat felt very weak, and he was able to eat only thirty-five\nmullets with tomato sauce and four portions of tripe with cheese.\nMoreover, as he was so in need of strength, he had to have four more\nhelpings of butter and cheese.\n\nThe Fox, after a great deal of coaxing, tried his best to eat a little.\nThe doctor had put him on a diet, and he had to be satisfied with a\nsmall hare dressed with a dozen young and tender spring chickens. After\nthe hare, he ordered some partridges, a few pheasants, a couple of\nrabbits, and a dozen frogs and lizards. That was all. He felt ill, he\nsaid, and could not eat another bite.\n\nPinocchio ate least of all. He asked for a bite of bread and a few nuts\nand then hardly touched them. The poor fellow, with his mind on the\nField of Wonders, was suffering from a gold-piece indigestion.\n\nSupper over, the Fox said to the Innkeeper:\n\n\"Give us two good rooms, one for Mr. Pinocchio and the other for me and\nmy friend. Before starting out, we'll take a little nap. Remember to\ncall us at midnight sharp, for we must continue on our journey.\"\n\n\"Yes, sir,\" answered the Innkeeper, winking in a knowing way at the Fox\nand the Cat, as if to say, \"I understand.\"\n\nAs soon as Pinocchio was in bed, he fell fast asleep and began to dream.\nHe dreamed he was in the middle of a field. The field was full of\nvines heavy with grapes. The grapes were no other than gold coins which\ntinkled merrily as they swayed in the wind. They seemed to say, \"Let him\nwho wants us take us!\"\n\nJust as Pinocchio stretched out his hand to take a handful of them, he\nwas awakened by three loud knocks at the door. It was the Innkeeper who\nhad come to tell him that midnight had struck.\n\n\"Are my friends ready?\" the Marionette asked him.\n\n\"Indeed, yes! They went two hours ago.\"\n\n\"Why in such a hurry?\"\n\n\"Unfortunately the Cat received a telegram which said that his\nfirst-born was suffering from chilblains and was on the point of death.\nHe could not even wait to say good-by to you.\"\n\n\"Did they pay for the supper?\"\n\n\"How could they do such a thing? Being people of great refinement, they\ndid not want to offend you so deeply as not to allow you the honor of\npaying the bill.\"\n\n\"Too bad! That offense would have been more than pleasing to me,\" said\nPinocchio, scratching his head.\n\n\"Where did my good friends say they would wait for me?\" he added.\n\n\"At the Field of Wonders, at sunrise tomorrow morning.\"\n\nPinocchio paid a gold piece for the three suppers and started on his way\ntoward the field that was to make him a rich man.\n\nHe walked on, not knowing where he was going, for it was dark, so dark\nthat not a thing was visible. Round about him, not a leaf stirred. A few\nbats skimmed his nose now and again and scared him half to death. Once\nor twice he shouted, \"Who goes there?\" and the far-away hills echoed\nback to him, \"Who goes there? Who goes there? Who goes. . . ?\"\n\nAs he walked, Pinocchio noticed a tiny insect glimmering on the trunk of\na tree, a small being that glowed with a pale, soft light.\n\n\"Who are you?\" he asked.\n\n\"I am the ghost of the Talking Cricket,\" answered the little being in a\nfaint voice that sounded as if it came from a far-away world.\n\n\"What do you want?\" asked the Marionette.\n\n\"I want to give you a few words of good advice. Return home and give the\nfour gold pieces you have left to your poor old father who is weeping\nbecause he has not seen you for many a day.\"\n\n\"Tomorrow my father will be a rich man, for these four gold pieces will\nbecome two thousand.\"\n\n\"Don't listen to those who promise you wealth overnight, my boy. As a\nrule they are either fools or swindlers! Listen to me and go home.\"\n\n\"But I want to go on!\"\n\n\"The hour is late!\"\n\n\"I want to go on.\"\n\n\"The night is very dark.\"\n\n\"I want to go on.\"\n\n\"The road is dangerous.\"\n\n\"I want to go on.\"\n\n\"Remember that boys who insist on having their own way, sooner or later\ncome to grief.\"\n\n\"The same nonsense. Good-by, Cricket.\"\n\n\"Good night, Pinocchio, and may Heaven preserve you from the Assassins.\"\n\nThere was silence for a minute and the light of the Talking Cricket\ndisappeared suddenly, just as if someone had snuffed it out. Once again\nthe road was plunged in darkness.\n\n\n\nCHAPTER 14\n\nPinocchio, not having listened to the good advice of the Talking\nCricket, falls into the hands of the Assassins.\n\n\n\"Dear, oh, dear! When I come to think of it,\" said the Marionette to\nhimself, as he once more set out on his journey, \"we boys are really\nvery unlucky. Everybody scolds us, everybody gives us advice, everybody\nwarns us. If we were to allow it, everyone would try to be father and\nmother to us; everyone, even the Talking Cricket. Take me, for example.\nJust because I would not listen to that bothersome Cricket, who knows\nhow many misfortunes may be awaiting me! Assassins indeed! At least I\nhave never believed in them, nor ever will. To speak sensibly, I think\nassassins have been invented by fathers and mothers to frighten children\nwho want to run away at night. And then, even if I were to meet them\non the road, what matter? I'll just run up to them, and say, 'Well,\nsignori, what do you want? Remember that you can't fool with me! Run\nalong and mind your business.' At such a speech, I can almost see those\npoor fellows running like the wind. But in case they don't run away, I\ncan always run myself. . .\"\n\nPinocchio was not given time to argue any longer, for he thought he\nheard a slight rustle among the leaves behind him.\n\nHe turned to look and behold, there in the darkness stood two big black\nshadows, wrapped from head to foot in black sacks. The two figures\nleaped toward him as softly as if they were ghosts.\n\n\"Here they come!\" Pinocchio said to himself, and, not knowing where to\nhide the gold pieces, he stuck all four of them under his tongue.\n\nHe tried to run away, but hardly had he taken a step, when he felt his\narms grasped and heard two horrible, deep voices say to him: \"Your money\nor your life!\"\n\nOn account of the gold pieces in his mouth, Pinocchio could not say\na word, so he tried with head and hands and body to show, as best he\ncould, that he was only a poor Marionette without a penny in his pocket.\n\n\"Come, come, less nonsense, and out with your money!\" cried the two\nthieves in threatening voices.\n\nOnce more, Pinocchio's head and hands said, \"I haven't a penny.\"\n\n\"Out with that money or you're a dead man,\" said the taller of the two\nAssassins.\n\n\"Dead man,\" repeated the other.\n\n\"And after having killed you, we will kill your father also.\"\n\n\"Your father also!\"\n\n\"No, no, no, not my Father!\" cried Pinocchio, wild with terror; but as\nhe screamed, the gold pieces tinkled together in his mouth.\n\n\"Ah, you rascal! So that's the game! You have the money hidden under\nyour tongue. Out with it!\"\n\nBut Pinocchio was as stubborn as ever.\n\n\"Are you deaf? Wait, young man, we'll get it from you in a twinkling!\"\n\nOne of them grabbed the Marionette by the nose and the other by the\nchin, and they pulled him unmercifully from side to side in order to\nmake him open his mouth.\n\nAll was of no use. The Marionette's lips might have been nailed\ntogether. They would not open.\n\nIn desperation the smaller of the two Assassins pulled out a long knife\nfrom his pocket, and tried to pry Pinocchio's mouth open with it.\n\nQuick as a flash, the Marionette sank his teeth deep into the Assassin's\nhand, bit it off and spat it out. Fancy his surprise when he saw that it\nwas not a hand, but a cat's paw.\n\nEncouraged by this first victory, he freed himself from the claws of\nhis assailers and, leaping over the bushes along the road, ran swiftly\nacross the fields. His pursuers were after him at once, like two dogs\nchasing a hare.\n\nAfter running seven miles or so, Pinocchio was well-nigh exhausted.\nSeeing himself lost, he climbed up a giant pine tree and sat there\nto see what he could see. The Assassins tried to climb also, but they\nslipped and fell.\n\nFar from giving up the chase, this only spurred them on. They gathered a\nbundle of wood, piled it up at the foot of the pine, and set fire to it.\nIn a twinkling the tree began to sputter and burn like a candle blown by\nthe wind. Pinocchio saw the flames climb higher and higher. Not wishing\nto end his days as a roasted Marionette, he jumped quickly to the ground\nand off he went, the Assassins close to him, as before.\n\nDawn was breaking when, without any warning whatsoever, Pinocchio found\nhis path barred by a deep pool full of water the color of muddy coffee.\n\nWhat was there to do? With a \"One, two, three!\" he jumped clear across\nit. The Assassins jumped also, but not having measured their distance\nwell--splash!!!--they fell right into the middle of the pool. Pinocchio\nwho heard the splash and felt it, too, cried out, laughing, but never\nstopping in his race:\n\n\"A pleasant bath to you, signori!\"\n\nHe thought they must surely be drowned and turned his head to see. But\nthere were the two somber figures still following him, though their\nblack sacks were drenched and dripping with water.\n\n\n\nCHAPTER 15\n\nThe Assassins chase Pinocchio, catch him, and hang him to the branch of\na giant oak tree.\n\n\nAs he ran, the Marionette felt more and more certain that he would have\nto give himself up into the hands of his pursuers. Suddenly he saw a\nlittle cottage gleaming white as the snow among the trees of the forest.\n\n\"If I have enough breath left with which to reach that little house, I\nmay be saved,\" he said to himself.\n\nNot waiting another moment, he darted swiftly through the woods, the\nAssassins still after him.\n\nAfter a hard race of almost an hour, tired and out of breath, Pinocchio\nfinally reached the door of the cottage and knocked. No one answered.\n\nHe knocked again, harder than before, for behind him he heard the steps\nand the labored breathing of his persecutors. The same silence followed.\n\nAs knocking was of no use, Pinocchio, in despair, began to kick and bang\nagainst the door, as if he wanted to break it. At the noise, a window\nopened and a lovely maiden looked out. She had azure hair and a face\nwhite as wax. Her eyes were closed and her hands crossed on her breast.\nWith a voice so weak that it hardly could be heard, she whispered:\n\n\"No one lives in this house. Everyone is dead.\"\n\n\"Won't you, at least, open the door for me?\" cried Pinocchio in a\nbeseeching voice.\n\n\"I also am dead.\"\n\n\"Dead? What are you doing at the window, then?\"\n\n\"I am waiting for the coffin to take me away.\"\n\nAfter these words, the little girl disappeared and the window closed\nwithout a sound.\n\n\"Oh, Lovely Maiden with Azure Hair,\" cried Pinocchio, \"open, I beg of\nyou. Take pity on a poor boy who is being chased by two Assass--\"\n\nHe did not finish, for two powerful hands grasped him by the neck and\nthe same two horrible voices growled threateningly: \"Now we have you!\"\n\nThe Marionette, seeing death dancing before him, trembled so hard that\nthe joints of his legs rattled and the coins tinkled under his tongue.\n\n\"Well,\" the Assassins asked, \"will you open your mouth now or not? Ah!\nYou do not answer? Very well, this time you shall open it.\"\n\nTaking out two long, sharp knives, they struck two heavy blows on the\nMarionette's back.\n\nHappily for him, Pinocchio was made of very hard wood and the knives\nbroke into a thousand pieces. The Assassins looked at each other in\ndismay, holding the handles of the knives in their hands.\n\n\"I understand,\" said one of them to the other, \"there is nothing left to\ndo now but to hang him.\"\n\n\"To hang him,\" repeated the other.\n\nThey tied Pinocchio's hands behind his shoulders and slipped the noose\naround his neck. Throwing the rope over the high limb of a giant oak\ntree, they pulled till the poor Marionette hung far up in space.\n\nSatisfied with their work, they sat on the grass waiting for Pinocchio\nto give his last gasp. But after three hours the Marionette's eyes were\nstill open, his mouth still shut and his legs kicked harder than ever.\n\nTired of waiting, the Assassins called to him mockingly: \"Good-by till\ntomorrow. When we return in the morning, we hope you'll be polite enough\nto let us find you dead and gone and with your mouth wide open.\" With\nthese words they went.\n\nA few minutes went by and then a wild wind started to blow. As it\nshrieked and moaned, the poor little sufferer was blown to and fro\nlike the hammer of a bell. The rocking made him seasick and the noose,\nbecoming tighter and tighter, choked him. Little by little a film\ncovered his eyes.\n\nDeath was creeping nearer and nearer, and the Marionette still hoped\nfor some good soul to come to his rescue, but no one appeared. As he was\nabout to die, he thought of his poor old father, and hardly conscious of\nwhat he was saying, murmured to himself:\n\n\"Oh, Father, dear Father! If you were only here!\"\n\nThese were his last words. He closed his eyes, opened his mouth,\nstretched out his legs, and hung there, as if he were dead.\n\n\n\nCHAPTER 16\n\nThe Lovely Maiden with Azure Hair sends for the poor Marionette, puts\nhim to bed, and calls three Doctors to tell her if Pinocchio is dead or\nalive.\n\n\nIf the poor Marionette had dangled there much longer, all hope would\nhave been lost. Luckily for him, the Lovely Maiden with Azure Hair once\nagain looked out of her window. Filled with pity at the sight of the\npoor little fellow being knocked helplessly about by the wind, she\nclapped her hands sharply together three times.\n\nAt the signal, a loud whirr of wings in quick flight was heard and a\nlarge Falcon came and settled itself on the window ledge.\n\n\"What do you command, my charming Fairy?\" asked the Falcon, bending his\nbeak in deep reverence (for it must be known that, after all, the Lovely\nMaiden with Azure Hair was none other than a very kind Fairy who had\nlived, for more than a thousand years, in the vicinity of the forest).\n\n\"Do you see that Marionette hanging from the limb of that giant oak\ntree?\"\n\n\"I see him.\"\n\n\"Very well. Fly immediately to him. With your strong beak, break the\nknot which holds him tied, take him down, and lay him softly on the\ngrass at the foot of the oak.\"\n\nThe Falcon flew away and after two minutes returned, saying, \"I have\ndone what you have commanded.\"\n\n\"How did you find him? Alive or dead?\"\n\n\"At first glance, I thought he was dead. But I found I was wrong, for\nas soon as I loosened the knot around his neck, he gave a long sigh and\nmumbled with a faint voice, 'Now I feel better!'\"\n\nThe Fairy clapped her hands twice. A magnificent Poodle appeared,\nwalking on his hind legs just like a man. He was dressed in court\nlivery. A tricorn trimmed with gold lace was set at a rakish angle over\na wig of white curls that dropped down to his waist. He wore a jaunty\ncoat of chocolate-colored velvet, with diamond buttons, and with two\nhuge pockets which were always filled with bones, dropped there\nat dinner by his loving mistress. Breeches of crimson velvet, silk\nstockings, and low, silver-buckled slippers completed his costume. His\ntail was encased in a blue silk covering, which was to protect it from\nthe rain.\n\n\"Come, Medoro,\" said the Fairy to him. \"Get my best coach ready and set\nout toward the forest. On reaching the oak tree, you will find a poor,\nhalf-dead Marionette stretched out on the grass. Lift him up tenderly,\nplace him on the silken cushions of the coach, and bring him here to\nme.\"\n\nThe Poodle, to show that he understood, wagged his silk-covered tail two\nor three times and set off at a quick pace.\n\nIn a few minutes, a lovely little coach, made of glass, with lining as\nsoft as whipped cream and chocolate pudding, and stuffed with canary\nfeathers, pulled out of the stable. It was drawn by one hundred pairs\nof white mice, and the Poodle sat on the coachman's seat and snapped his\nwhip gayly in the air, as if he were a real coachman in a hurry to get\nto his destination.\n\nIn a quarter of an hour the coach was back. The Fairy, who was waiting\nat the door of the house, lifted the poor little Marionette in her arms,\ntook him to a dainty room with mother-of-pearl walls, put him to bed,\nand sent immediately for the most famous doctors of the neighborhood to\ncome to her.\n\nOne after another the doctors came, a Crow, and Owl, and a Talking\nCricket.\n\n\"I should like to know, signori,\" said the Fairy, turning to the three\ndoctors gathered about Pinocchio's bed, \"I should like to know if this\npoor Marionette is dead or alive.\"\n\nAt this invitation, the Crow stepped out and felt Pinocchio's pulse, his\nnose, his little toe. Then he solemnly pronounced the following words:\n\n\"To my mind this Marionette is dead and gone; but if, by any evil\nchance, he were not, then that would be a sure sign that he is still\nalive!\"\n\n\"I am sorry,\" said the Owl, \"to have to contradict the Crow, my famous\nfriend and colleague. To my mind this Marionette is alive; but if, by\nany evil chance, he were not, then that would be a sure sign that he is\nwholly dead!\"\n\n\"And do you hold any opinion?\" the Fairy asked the Talking Cricket.\n\n\"I say that a wise doctor, when he does not know what he is talking\nabout, should know enough to keep his mouth shut. However, that\nMarionette is not a stranger to me. I have known him a long time!\"\n\nPinocchio, who until then had been very quiet, shuddered so hard that\nthe bed shook.\n\n\"That Marionette,\" continued the Talking Cricket, \"is a rascal of the\nworst kind.\"\n\nPinocchio opened his eyes and closed them again.\n\n\"He is rude, lazy, a runaway.\"\n\nPinocchio hid his face under the sheets.\n\n\"That Marionette is a disobedient son who is breaking his father's\nheart!\"\n\nLong shuddering sobs were heard, cries, and deep sighs. Think how\nsurprised everyone was when, on raising the sheets, they discovered\nPinocchio half melted in tears!\n\n\"When the dead weep, they are beginning to recover,\" said the Crow\nsolemnly.\n\n\"I am sorry to contradict my famous friend and colleague,\" said the Owl,\n\"but as far as I'm concerned, I think that when the dead weep, it means\nthey do not want to die.\"\n\n\n\nCHAPTER 17\n\nPinocchio eats sugar, but refuses to take medicine. When the undertakers\ncome for him, he drinks the medicine and feels better. Afterwards he\ntells a lie and, in punishment, his nose grows longer and longer.\n\n\nAs soon as the three doctors had left the room, the Fairy went to\nPinocchio's bed and, touching him on the forehead, noticed that he was\nburning with fever.\n\nShe took a glass of water, put a white powder into it, and, handing it\nto the Marionette, said lovingly to him:\n\n\"Drink this, and in a few days you'll be up and well.\"\n\nPinocchio looked at the glass, made a wry face, and asked in a whining\nvoice: \"Is it sweet or bitter?\"\n\n\"It is bitter, but it is good for you.\"\n\n\"If it is bitter, I don't want it.\"\n\n\"Drink it!\"\n\n\"I don't like anything bitter.\"\n\n\"Drink it and I'll give you a lump of sugar to take the bitter taste\nfrom your mouth.\"\n\n\"Where's the sugar?\"\n\n\"Here it is,\" said the Fairy, taking a lump from a golden sugar bowl.\n\n\"I want the sugar first, then I'll drink the bitter water.\"\n\n\"Do you promise?\"\n\n\"Yes.\"\n\nThe Fairy gave him the sugar and Pinocchio, after chewing and swallowing\nit in a twinkling, said, smacking his lips:\n\n\"If only sugar were medicine! I should take it every day.\"\n\n\"Now keep your promise and drink these few drops of water. They'll be\ngood for you.\"\n\nPinocchio took the glass in both hands and stuck his nose into it. He\nlifted it to his mouth and once more stuck his nose into it.\n\n\"It is too bitter, much too bitter! I can't drink it.\"\n\n\"How do you know, when you haven't even tasted it?\"\n\n\"I can imagine it. I smell it. I want another lump of sugar, then I'll\ndrink it.\"\n\nThe Fairy, with all the patience of a good mother, gave him more sugar\nand again handed him the glass.\n\n\"I can't drink it like that,\" the Marionette said, making more wry\nfaces.\n\n\"Why?\"\n\n\"Because that feather pillow on my feet bothers me.\"\n\nThe Fairy took away the pillow.\n\n\"It's no use. I can't drink it even now.\"\n\n\"What's the matter now?\"\n\n\"I don't like the way that door looks. It's half open.\"\n\nThe Fairy closed the door.\n\n\"I won't drink it,\" cried Pinocchio, bursting out crying. \"I won't drink\nthis awful water. I won't. I won't! No, no, no, no!\"\n\n\"My boy, you'll be sorry.\"\n\n\"I don't care.\"\n\n\"You are very sick.\"\n\n\"I don't care.\"\n\n\"In a few hours the fever will take you far away to another world.\"\n\n\"I don't care.\"\n\n\"Aren't you afraid of death?\"\n\n\"Not a bit. I'd rather die than drink that awful medicine.\"\n\nAt that moment, the door of the room flew open and in came four Rabbits\nas black as ink, carrying a small black coffin on their shoulders.\n\n\"What do you want from me?\" asked Pinocchio.\n\n\"We have come for you,\" said the largest Rabbit.\n\n\"For me? But I'm not dead yet!\"\n\n\"No, not dead yet; but you will be in a few moments since you have\nrefused to take the medicine which would have made you well.\"\n\n\"Oh, Fairy, my Fairy,\" the Marionette cried out, \"give me that glass!\nQuick, please! I don't want to die! No, no, not yet--not yet!\"\n\nAnd holding the glass with his two hands, he swallowed the medicine at\none gulp.\n\n\"Well,\" said the four Rabbits, \"this time we have made the trip for\nnothing.\"\n\nAnd turning on their heels, they marched solemnly out of the room,\ncarrying their little black coffin and muttering and grumbling between\ntheir teeth.\n\nIn a twinkling, Pinocchio felt fine. With one leap he was out of bed and\ninto his clothes.\n\nThe Fairy, seeing him run and jump around the room gay as a bird on\nwing, said to him:\n\n\"My medicine was good for you, after all, wasn't it?\"\n\n\"Good indeed! It has given me new life.\"\n\n\"Why, then, did I have to beg you so hard to make you drink it?\"\n\n\"I'm a boy, you see, and all boys hate medicine more than they do\nsickness.\"\n\n\"What a shame! Boys ought to know, after all, that medicine, taken in\ntime, can save them from much pain and even from death.\"\n\n\"Next time I won't have to be begged so hard. I'll remember those black\nRabbits with the black coffin on their shoulders and I'll take the glass\nand pouf!--down it will go!\"\n\n\"Come here now and tell me how it came about that you found yourself in\nthe hands of the Assassins.\"\n\n\"It happened that Fire Eater gave me five gold pieces to give to my\nFather, but on the way, I met a Fox and a Cat, who asked me, 'Do you\nwant the five pieces to become two thousand?' And I said, 'Yes.' And\nthey said, 'Come with us to the Field of Wonders.' And I said, 'Let's\ngo.' Then they said, 'Let us stop at the Inn of the Red Lobster for\ndinner and after midnight we'll set out again.' We ate and went to\nsleep. When I awoke they were gone and I started out in the darkness all\nalone. On the road I met two Assassins dressed in black coal sacks,\nwho said to me, 'Your money or your life!' and I said, 'I haven't any\nmoney'; for, you see, I had put the money under my tongue. One of them\ntried to put his hand in my mouth and I bit it off and spat it out; but\nit wasn't a hand, it was a cat's paw. And they ran after me and I ran\nand ran, till at last they caught me and tied my neck with a rope and\nhanged me to a tree, saying, 'Tomorrow we'll come back for you and\nyou'll be dead and your mouth will be open, and then we'll take the gold\npieces that you have hidden under your tongue.'\"\n\n\"Where are the gold pieces now?\" the Fairy asked.\n\n\"I lost them,\" answered Pinocchio, but he told a lie, for he had them in\nhis pocket.\n\nAs he spoke, his nose, long though it was, became at least two inches\nlonger.\n\n\"And where did you lose them?\"\n\n\"In the wood near by.\"\n\nAt this second lie, his nose grew a few more inches.\n\n\"If you lost them in the near-by wood,\" said the Fairy, \"we'll look for\nthem and find them, for everything that is lost there is always found.\"\n\n\"Ah, now I remember,\" replied the Marionette, becoming more and more\nconfused. \"I did not lose the gold pieces, but I swallowed them when I\ndrank the medicine.\"\n\nAt this third lie, his nose became longer than ever, so long that he\ncould not even turn around. If he turned to the right, he knocked it\nagainst the bed or into the windowpanes; if he turned to the left, he\nstruck the walls or the door; if he raised it a bit, he almost put the\nFairy's eyes out.\n\nThe Fairy sat looking at him and laughing.\n\n\"Why do you laugh?\" the Marionette asked her, worried now at the sight\nof his growing nose.\n\n\"I am laughing at your lies.\"\n\n\"How do you know I am lying?\"\n\n\"Lies, my boy, are known in a moment. There are two kinds of lies, lies\nwith short legs and lies with long noses. Yours, just now, happen to\nhave long noses.\"\n\nPinocchio, not knowing where to hide his shame, tried to escape from the\nroom, but his nose had become so long that he could not get it out of\nthe door.\n\n\n\nCHAPTER 18\n\nPinocchio finds the Fox and the Cat again, and goes with them to sow the\ngold pieces in the Field of Wonders.\n\n\nCrying as if his heart would break, the Marionette mourned for hours\nover the length of his nose. No matter how he tried, it would not go\nthrough the door. The Fairy showed no pity toward him, as she was trying\nto teach him a good lesson, so that he would stop telling lies, the\nworst habit any boy may acquire. But when she saw him, pale with fright\nand with his eyes half out of his head from terror, she began to feel\nsorry for him and clapped her hands together. A thousand woodpeckers\nflew in through the window and settled themselves on Pinocchio's nose.\nThey pecked and pecked so hard at that enormous nose that in a few\nmoments, it was the same size as before.\n\n\"How good you are, my Fairy,\" said Pinocchio, drying his eyes, \"and how\nmuch I love you!\"\n\n\"I love you, too,\" answered the Fairy, \"and if you wish to stay with me,\nyou may be my little brother and I'll be your good little sister.\"\n\n\"I should like to stay--but what about my poor father?\"\n\n\"I have thought of everything. Your father has been sent for and before\nnight he will be here.\"\n\n\"Really?\" cried Pinocchio joyfully. \"Then, my good Fairy, if you are\nwilling, I should like to go to meet him. I cannot wait to kiss that\ndear old man, who has suffered so much for my sake.\"\n\n\"Surely; go ahead, but be careful not to lose your way. Take the wood\npath and you'll surely meet him.\"\n\nPinocchio set out, and as soon as he found himself in the wood, he\nran like a hare. When he reached the giant oak tree he stopped, for he\nthought he heard a rustle in the brush. He was right. There stood the\nFox and the Cat, the two traveling companions with whom he had eaten at\nthe Inn of the Red Lobster.\n\n\"Here comes our dear Pinocchio!\" cried the Fox, hugging and kissing him.\n\"How did you happen here?\"\n\n\"How did you happen here?\" repeated the Cat.\n\n\"It is a long story,\" said the Marionette. \"Let me tell it to you. The\nother night, when you left me alone at the Inn, I met the Assassins on\nthe road--\"\n\n\"The Assassins? Oh, my poor friend! And what did they want?\"\n\n\"They wanted my gold pieces.\"\n\n\"Rascals!\" said the Fox.\n\n\"The worst sort of rascals!\" added the Cat.\n\n\"But I began to run,\" continued the Marionette, \"and they after me,\nuntil they overtook me and hanged me to the limb of that oak.\"\n\nPinocchio pointed to the giant oak near by.\n\n\"Could anything be worse?\" said the Fox.\n\n\"What an awful world to live in! Where shall we find a safe place for\ngentlemen like ourselves?\"\n\nAs the Fox talked thus, Pinocchio noticed that the Cat carried his right\npaw in a sling.\n\n\"What happened to your paw?\" he asked.\n\nThe Cat tried to answer, but he became so terribly twisted in his speech\nthat the Fox had to help him out.\n\n\"My friend is too modest to answer. I'll answer for him. About an hour\nago, we met an old wolf on the road. He was half starved and begged for\nhelp. Having nothing to give him, what do you think my friend did out\nof the kindness of his heart? With his teeth, he bit off the paw of\nhis front foot and threw it at that poor beast, so that he might have\nsomething to eat.\"\n\nAs he spoke, the Fox wiped off a tear.\n\nPinocchio, almost in tears himself, whispered in the Cat's ear:\n\n\"If all the cats were like you, how lucky the mice would be!\"\n\n\"And what are you doing here?\" the Fox asked the Marionette.\n\n\"I am waiting for my father, who will be here at any moment now.\"\n\n\"And your gold pieces?\"\n\n\"I still have them in my pocket, except one which I spent at the Inn of\nthe Red Lobster.\"\n\n\"To think that those four gold pieces might become two thousand\ntomorrow. Why don't you listen to me? Why don't you sow them in the\nField of Wonders?\"\n\n\"Today it is impossible. I'll go with you some other time.\"\n\n\"Another day will be too late,\" said the Fox.\n\n\"Why?\"\n\n\"Because that field has been bought by a very rich man, and today is the\nlast day that it will be open to the public.\"\n\n\"How far is this Field of Wonders?\"\n\n\"Only two miles away. Will you come with us? We'll be there in half an\nhour. You can sow the money, and, after a few minutes, you will gather\nyour two thousand coins and return home rich. Are you coming?\"\n\nPinocchio hesitated a moment before answering, for he remembered the\ngood Fairy, old Geppetto, and the advice of the Talking Cricket. Then\nhe ended by doing what all boys do, when they have no heart and little\nbrain. He shrugged his shoulders and said to the Fox and the Cat:\n\n\"Let us go! I am with you.\"\n\nAnd they went.\n\nThey walked and walked for a half a day at least and at last they came\nto the town called the City of Simple Simons. As soon as they entered\nthe town, Pinocchio noticed that all the streets were filled with\nhairless dogs, yawning from hunger; with sheared sheep, trembling with\ncold; with combless chickens, begging for a grain of wheat; with large\nbutterflies, unable to use their wings because they had sold all their\nlovely colors; with tailless peacocks, ashamed to show themselves; and\nwith bedraggled pheasants, scuttling away hurriedly, grieving for their\nbright feathers of gold and silver, lost to them forever.\n\nThrough this crowd of paupers and beggars, a beautiful coach passed now\nand again. Within it sat either a Fox, a Hawk, or a Vulture.\n\n\"Where is the Field of Wonders?\" asked Pinocchio, growing tired of\nwaiting.\n\n\"Be patient. It is only a few more steps away.\"\n\nThey passed through the city and, just outside the walls, they stepped\ninto a lonely field, which looked more or less like any other field.\n\n\"Here we are,\" said the Fox to the Marionette. \"Dig a hole here and put\nthe gold pieces into it.\"\n\nThe Marionette obeyed. He dug the hole, put the four gold pieces into\nit, and covered them up very carefully. \"Now,\" said the Fox, \"go to that\nnear-by brook, bring back a pail full of water, and sprinkle it over the\nspot.\"\n\nPinocchio followed the directions closely, but, as he had no pail, he\npulled off his shoe, filled it with water, and sprinkled the earth which\ncovered the gold. Then he asked:\n\n\"Anything else?\"\n\n\"Nothing else,\" answered the Fox. \"Now we can go. Return here within\ntwenty minutes and you will find the vine grown and the branches filled\nwith gold pieces.\"\n\nPinocchio, beside himself with joy, thanked the Fox and the Cat many\ntimes and promised them each a beautiful gift.\n\n\"We don't want any of your gifts,\" answered the two rogues. \"It is\nenough for us that we have helped you to become rich with little or no\ntrouble. For this we are as happy as kings.\"\n\nThey said good-by to Pinocchio and, wishing him good luck, went on their\nway.\n\n\n\nCHAPTER 19\n\nPinocchio is robbed of his gold pieces and, in punishment, is sentenced\nto four months in prison.\n\n\nIf the Marionette had been told to wait a day instead of twenty minutes,\nthe time could not have seemed longer to him. He walked impatiently to\nand fro and finally turned his nose toward the Field of Wonders.\n\nAnd as he walked with hurried steps, his heart beat with an excited tic,\ntac, tic, tac, just as if it were a wall clock, and his busy brain kept\nthinking:\n\n\"What if, instead of a thousand, I should find two thousand? Or if,\ninstead of two thousand, I should find five thousand--or one hundred\nthousand? I'll build myself a beautiful palace, with a thousand stables\nfilled with a thousand wooden horses to play with, a cellar overflowing\nwith lemonade and ice cream soda, and a library of candies and fruits,\ncakes and cookies.\"\n\nThus amusing himself with fancies, he came to the field. There he\nstopped to see if, by any chance, a vine filled with gold coins was\nin sight. But he saw nothing! He took a few steps forward, and still\nnothing! He stepped into the field. He went up to the place where he had\ndug the hole and buried the gold pieces. Again nothing! Pinocchio became\nvery thoughtful and, forgetting his good manners altogether, he pulled a\nhand out of his pocket and gave his head a thorough scratching.\n\nAs he did so, he heard a hearty burst of laughter close to his head. He\nturned sharply, and there, just above him on the branch of a tree, sat a\nlarge Parrot, busily preening his feathers.\n\n\"What are you laughing at?\" Pinocchio asked peevishly.\n\n\"I am laughing because, in preening my feathers, I tickled myself under\nthe wings.\"\n\nThe Marionette did not answer. He walked to the brook, filled his shoe\nwith water, and once more sprinkled the ground which covered the gold\npieces.\n\nAnother burst of laughter, even more impertinent than the first, was\nheard in the quiet field.\n\n\"Well,\" cried the Marionette, angrily this time, \"may I know, Mr.\nParrot, what amuses you so?\"\n\n\"I am laughing at those simpletons who believe everything they hear and\nwho allow themselves to be caught so easily in the traps set for them.\"\n\n\"Do you, perhaps, mean me?\"\n\n\"I certainly do mean you, poor Pinocchio--you who are such a little\nsilly as to believe that gold can be sown in a field just like beans\nor squash. I, too, believed that once and today I am very sorry for it.\nToday (but too late!) I have reached the conclusion that, in order to\ncome by money honestly, one must work and know how to earn it with hand\nor brain.\"\n\n\"I don't know what you are talking about,\" said the Marionette, who was\nbeginning to tremble with fear.\n\n\"Too bad! I'll explain myself better,\" said the Parrot. \"While you were\naway in the city the Fox and the Cat returned here in a great hurry.\nThey took the four gold pieces which you have buried and ran away as\nfast as the wind. If you can catch them, you're a brave one!\"\n\nPinocchio's mouth opened wide. He would not believe the Parrot's words\nand began to dig away furiously at the earth. He dug and he dug till\nthe hole was as big as himself, but no money was there. Every penny was\ngone.\n\nIn desperation, he ran to the city and went straight to the courthouse\nto report the robbery to the magistrate. The Judge was a Monkey, a large\nGorilla venerable with age. A flowing white beard covered his chest and\nhe wore gold-rimmed spectacles from which the glasses had dropped\nout. The reason for wearing these, he said, was that his eyes had been\nweakened by the work of many years.\n\nPinocchio, standing before him, told his pitiful tale, word by word.\nHe gave the names and the descriptions of the robbers and begged for\njustice.\n\nThe Judge listened to him with great patience. A kind look shone in his\neyes. He became very much interested in the story; he felt moved; he\nalmost wept. When the Marionette had no more to say, the Judge put out\nhis hand and rang a bell.\n\nAt the sound, two large Mastiffs appeared, dressed in Carabineers'\nuniforms.\n\nThen the magistrate, pointing to Pinocchio, said in a very solemn voice:\n\n\"This poor simpleton has been robbed of four gold pieces. Take him,\ntherefore, and throw him into prison.\" The Marionette, on hearing this\nsentence passed upon him, was thoroughly stunned. He tried to protest,\nbut the two officers clapped their paws on his mouth and hustled him\naway to jail.\n\nThere he had to remain for four long, weary months. And if it had not\nbeen for a very lucky chance, he probably would have had to stay there\nlonger. For, my dear children, you must know that it happened just then\nthat the young emperor who ruled over the City of Simple Simons had\ngained a great victory over his enemy, and in celebration thereof, he\nhad ordered illuminations, fireworks, shows of all kinds, and, best of\nall, the opening of all prison doors.\n\n\"If the others go, I go, too,\" said Pinocchio to the Jailer.\n\n\"Not you,\" answered the Jailer. \"You are one of those--\"\n\n\"I beg your pardon,\" interrupted Pinocchio, \"I, too, am a thief.\"\n\n\"In that case you also are free,\" said the Jailer. Taking off his cap,\nhe bowed low and opened the door of the prison, and Pinocchio ran out\nand away, with never a look backward.\n\n\nCHAPTER 20\n\nFreed from prison, Pinocchio sets out to return to the Fairy; but on the\nway he meets a Serpent and later is caught in a trap.\n\n\nFancy the happiness of Pinocchio on finding himself free! Without saying\nyes or no, he fled from the city and set out on the road that was to\ntake him back to the house of the lovely Fairy.\n\nIt had rained for many days, and the road was so muddy that, at times,\nPinocchio sank down almost to his knees.\n\nBut he kept on bravely.\n\nTormented by the wish to see his father and his fairy sister with azure\nhair, he raced like a greyhound. As he ran, he was splashed with mud\neven up to his cap.\n\n\"How unhappy I have been,\" he said to himself. \"And yet I deserve\neverything, for I am certainly very stubborn and stupid! I will always\nhave my own way. I won't listen to those who love me and who have more\nbrains than I. But from now on, I'll be different and I'll try to become\na most obedient boy. I have found out, beyond any doubt whatever, that\ndisobedient boys are certainly far from happy, and that, in the long\nrun, they always lose out. I wonder if Father is waiting for me. Will\nI find him at the Fairy's house? It is so long, poor man, since I have\nseen him, and I do so want his love and his kisses. And will the Fairy\never forgive me for all I have done? She who has been so good to me and\nto whom I owe my life! Can there be a worse or more heartless boy than I\nam anywhere?\"\n\nAs he spoke, he stopped suddenly, frozen with terror.\n\nWhat was the matter? An immense Serpent lay stretched across the road--a\nSerpent with a bright green skin, fiery eyes which glowed and burned,\nand a pointed tail that smoked like a chimney.\n\nHow frightened was poor Pinocchio! He ran back wildly for half a mile,\nand at last settled himself atop a heap of stones to wait for the\nSerpent to go on his way and leave the road clear for him.\n\nHe waited an hour; two hours; three hours; but the Serpent was always\nthere, and even from afar one could see the flash of his red eyes and\nthe column of smoke which rose from his long, pointed tail.\n\nPinocchio, trying to feel very brave, walked straight up to him and said\nin a sweet, soothing voice:\n\n\"I beg your pardon, Mr. Serpent, would you be so kind as to step aside\nto let me pass?\"\n\nHe might as well have talked to a wall. The Serpent never moved.\n\nOnce more, in the same sweet voice, he spoke:\n\n\"You must know, Mr. Serpent, that I am going home where my father is\nwaiting for me. It is so long since I have seen him! Would you mind very\nmuch if I passed?\"\n\nHe waited for some sign of an answer to his questions, but the answer\ndid not come. On the contrary, the green Serpent, who had seemed, until\nthen, wide awake and full of life, became suddenly very quiet and still.\nHis eyes closed and his tail stopped smoking.\n\n\"Is he dead, I wonder?\" said Pinocchio, rubbing his hands together\nhappily. Without a moment's hesitation, he started to step over him, but\nhe had just raised one leg when the Serpent shot up like a spring and\nthe Marionette fell head over heels backward. He fell so awkwardly that\nhis head stuck in the mud, and there he stood with his legs straight up\nin the air.\n\nAt the sight of the Marionette kicking and squirming like a young\nwhirlwind, the Serpent laughed so heartily and so long that at last he\nburst an artery and died on the spot.\n\nPinocchio freed himself from his awkward position and once more began\nto run in order to reach the Fairy's house before dark. As he went, the\npangs of hunger grew so strong that, unable to withstand them, he jumped\ninto a field to pick a few grapes that tempted him. Woe to him!\n\nNo sooner had he reached the grapevine than--crack! went his legs.\n\nThe poor Marionette was caught in a trap set there by a Farmer for some\nWeasels which came every night to steal his chickens.\n\n\n\nCHAPTER 21\n\nPinocchio is caught by a Farmer, who uses him as a watchdog for his\nchicken coop.\n\n\nPinocchio, as you may well imagine, began to scream and weep and beg;\nbut all was of no use, for no houses were to be seen and not a soul\npassed by on the road.\n\nNight came on.\n\nA little because of the sharp pain in his legs, a little because of\nfright at finding himself alone in the darkness of the field, the\nMarionette was about to faint, when he saw a tiny Glowworm flickering\nby. He called to her and said:\n\n\"Dear little Glowworm, will you set me free?\"\n\n\"Poor little fellow!\" replied the Glowworm, stopping to look at him with\npity. \"How came you to be caught in this trap?\"\n\n\"I stepped into this lonely field to take a few grapes and--\"\n\n\"Are the grapes yours?\"\n\n\"No.\"\n\n\"Who has taught you to take things that do not belong to you?\"\n\n\"I was hungry.\"\n\n\"Hunger, my boy, is no reason for taking something which belongs to\nanother.\"\n\n\"It's true, it's true!\" cried Pinocchio in tears. \"I won't do it again.\"\n\nJust then, the conversation was interrupted by approaching footsteps.\nIt was the owner of the field, who was coming on tiptoes to see if, by\nchance, he had caught the Weasels which had been eating his chickens.\n\nGreat was his surprise when, on holding up his lantern, he saw that,\ninstead of a Weasel, he had caught a boy!\n\n\"Ah, you little thief!\" said the Farmer in an angry voice. \"So you are\nthe one who steals my chickens!\"\n\n\"Not I! No, no!\" cried Pinocchio, sobbing bitterly. \"I came here only to\ntake a very few grapes.\"\n\n\"He who steals grapes may very easily steal chickens also. Take my word\nfor it, I'll give you a lesson that you'll remember for a long while.\"\n\nHe opened the trap, grabbed the Marionette by the collar, and carried\nhim to the house as if he were a puppy. When he reached the yard in\nfront of the house, he flung him to the ground, put a foot on his neck,\nand said to him roughly: \"It is late now and it's time for bed. Tomorrow\nwe'll settle matters. In the meantime, since my watchdog died today, you\nmay take his place and guard my henhouse.\"\n\nNo sooner said than done. He slipped a dog collar around Pinocchio's\nneck and tightened it so that it would not come off. A long iron chain\nwas tied to the collar. The other end of the chain was nailed to the\nwall.\n\n\"If tonight it should happen to rain,\" said the Farmer, \"you can sleep\nin that little doghouse near-by, where you will find plenty of straw for\na soft bed. It has been Melampo's bed for three years, and it will be\ngood enough for you. And if, by any chance, any thieves should come, be\nsure to bark!\"\n\nAfter this last warning, the Farmer went into the house and closed the\ndoor and barred it.\n\nPoor Pinocchio huddled close to the doghouse more dead than alive from\ncold, hunger, and fright. Now and again he pulled and tugged at the\ncollar which nearly choked him and cried out in a weak voice:\n\n\"I deserve it! Yes, I deserve it! I have been nothing but a truant and\na vagabond. I have never obeyed anyone and I have always done as I\npleased. If I were only like so many others and had studied and worked\nand stayed with my poor old father, I should not find myself here\nnow, in this field and in the darkness, taking the place of a farmer's\nwatchdog. Oh, if I could start all over again! But what is done can't be\nundone, and I must be patient!\"\n\nAfter this little sermon to himself, which came from the very depths of\nhis heart, Pinocchio went into the doghouse and fell asleep.\n\n\n\nCHAPTER 22\n\nPinocchio discovers the thieves and, as a reward for faithfulness, he\nregains his liberty.\n\n\nEven though a boy may be very unhappy, he very seldom loses sleep over\nhis worries. The Marionette, being no exception to this rule, slept on\npeacefully for a few hours till well along toward midnight, when he\nwas awakened by strange whisperings and stealthy sounds coming from the\nyard. He stuck his nose out of the doghouse and saw four slender, hairy\nanimals. They were Weasels, small animals very fond of both eggs and\nchickens. One of them left her companions and, going to the door of the\ndoghouse, said in a sweet voice:\n\n\"Good evening, Melampo.\"\n\n\"My name is not Melampo,\" answered Pinocchio.\n\n\"Who are you, then?\"\n\n\"I am Pinocchio.\"\n\n\"What are you doing here?\"\n\n\"I'm the watchdog.\"\n\n\"But where is Melampo? Where is the old dog who used to live in this\nhouse?\"\n\n\"He died this morning.\"\n\n\"Died? Poor beast! He was so good! Still, judging by your face, I think\nyou, too, are a good-natured dog.\"\n\n\"I beg your pardon, I am not a dog!\"\n\n\"What are you, then?\"\n\n\"I am a Marionette.\"\n\n\"Are you taking the place of the watchdog?\"\n\n\"I'm sorry to say that I am. I'm being punished.\"\n\n\"Well, I shall make the same terms with you that we had with the dead\nMelampo. I am sure you will be glad to hear them.\"\n\n\"And what are the terms?\"\n\n\"This is our plan: We'll come once in a while, as in the past, to pay\na visit to this henhouse, and we'll take away eight chickens. Of these,\nseven are for us, and one for you, provided, of course, that you will\nmake believe you are sleeping and will not bark for the Farmer.\"\n\n\"Did Melampo really do that?\" asked Pinocchio.\n\n\"Indeed he did, and because of that we were the best of friends. Sleep\naway peacefully, and remember that before we go we shall leave you a\nnice fat chicken all ready for your breakfast in the morning. Is that\nunderstood?\"\n\n\"Even too well,\" answered Pinocchio. And shaking his head in a\nthreatening manner, he seemed to say, \"We'll talk this over in a few\nminutes, my friends.\"\n\nAs soon as the four Weasels had talked things over, they went straight\nto the chicken coop which stood close to the doghouse. Digging busily\nwith teeth and claws, they opened the little door and slipped in. But\nthey were no sooner in than they heard the door close with a sharp bang.\n\nThe one who had done the trick was Pinocchio, who, not satisfied with\nthat, dragged a heavy stone in front of it. That done, he started to\nbark. And he barked as if he were a real watchdog: \"Bow, wow, wow! Bow,\nwow!\"\n\nThe Farmer heard the loud barks and jumped out of bed. Taking his gun,\nhe leaped to the window and shouted: \"What's the matter?\"\n\n\"The thieves are here,\" answered Pinocchio.\n\n\"Where are they?\"\n\n\"In the chicken coop.\"\n\n\"I'll come down in a second.\"\n\nAnd, in fact, he was down in the yard in a twinkling and running toward\nthe chicken coop.\n\nHe opened the door, pulled out the Weasels one by one, and, after tying\nthem in a bag, said to them in a happy voice: \"You're in my hands at\nlast! I could punish you now, but I'll wait! In the morning you may come\nwith me to the inn and there you'll make a fine dinner for some hungry\nmortal. It is really too great an honor for you, one you do not deserve;\nbut, as you see, I am really a very kind and generous man and I am going\nto do this for you!\"\n\nThen he went up to Pinocchio and began to pet and caress him.\n\n\"How did you ever find them out so quickly? And to think that Melampo,\nmy faithful Melampo, never saw them in all these years!\"\n\nThe Marionette could have told, then and there, all he knew about the\nshameful contract between the dog and the Weasels, but thinking of\nthe dead dog, he said to himself: \"Melampo is dead. What is the use of\naccusing him? The dead are gone and they cannot defend themselves. The\nbest thing to do is to leave them in peace!\"\n\n\"Were you awake or asleep when they came?\" continued the Farmer.\n\n\"I was asleep,\" answered Pinocchio, \"but they awakened me with their\nwhisperings. One of them even came to the door of the doghouse and said\nto me, 'If you promise not to bark, we will make you a present of one\nof the chickens for your breakfast.' Did you hear that? They had the\naudacity to make such a proposition as that to me! For you must know\nthat, though I am a very wicked Marionette full of faults, still I never\nhave been, nor ever shall be, bribed.\"\n\n\"Fine boy!\" cried the Farmer, slapping him on the shoulder in a friendly\nway. \"You ought to be proud of yourself. And to show you what I think of\nyou, you are free from this instant!\"\n\nAnd he slipped the dog collar from his neck.\n\n\n\nCHAPTER 23\n\nPinocchio weeps upon learning that the Lovely Maiden with Azure Hair\nis dead. He meets a Pigeon, who carries him to the seashore. He throws\nhimself into the sea to go to the aid of his father.\n\n\nAs soon as Pinocchio no longer felt the shameful weight of the dog\ncollar around his neck, he started to run across the fields and meadows,\nand never stopped till he came to the main road that was to take him to\nthe Fairy's house.\n\nWhen he reached it, he looked into the valley far below him and there\nhe saw the wood where unluckily he had met the Fox and the Cat, and the\ntall oak tree where he had been hanged; but though he searched far and\nnear, he could not see the house where the Fairy with the Azure Hair\nlived.\n\nHe became terribly frightened and, running as fast as he could, he\nfinally came to the spot where it had once stood. The little house was\nno longer there. In its place lay a small marble slab, which bore this\nsad inscription:\n\n     HERE LIES\n     THE LOVELY FAIRY WITH AZURE HAIR\n     WHO DIED OF GRIEF\n     WHEN ABANDONED BY\n     HER LITTLE BROTHER PINOCCHIO\n\nThe poor Marionette was heartbroken at reading these words. He fell to\nthe ground and, covering the cold marble with kisses, burst into bitter\ntears. He cried all night, and dawn found him still there, though his\ntears had dried and only hard, dry sobs shook his wooden frame. But\nthese were so loud that they could be heard by the faraway hills.\n\nAs he sobbed he said to himself:\n\n\"Oh, my Fairy, my dear, dear Fairy, why did you die? Why did I not die,\nwho am so bad, instead of you, who are so good? And my father--where can\nhe be? Please dear Fairy, tell me where he is and I shall never, never\nleave him again! You are not really dead, are you? If you love me, you\nwill come back, alive as before. Don't you feel sorry for me? I'm so\nlonely. If the two Assassins come, they'll hang me again from the giant\noak tree and I will really die, this time. What shall I do alone in the\nworld? Now that you are dead and my father is lost, where shall I eat?\nWhere shall I sleep? Who will make my new clothes? Oh, I want to die!\nYes, I want to die! Oh, oh, oh!\"\n\nPoor Pinocchio! He even tried to tear his hair, but as it was only\npainted on his wooden head, he could not even pull it.\n\nJust then a large Pigeon flew far above him. Seeing the Marionette, he\ncried to him:\n\n\"Tell me, little boy, what are you doing there?\"\n\n\"Can't you see? I'm crying,\" cried Pinocchio, lifting his head toward\nthe voice and rubbing his eyes with his sleeve.\n\n\"Tell me,\" asked the Pigeon, \"do you by chance know of a Marionette,\nPinocchio by name?\"\n\n\"Pinocchio! Did you say Pinocchio?\" replied the Marionette, jumping to\nhis feet. \"Why, I am Pinocchio!\"\n\nAt this answer, the Pigeon flew swiftly down to the earth. He was much\nlarger than a turkey.\n\n\"Then you know Geppetto also?\"\n\n\"Do I know him? He's my father, my poor, dear father! Has he, perhaps,\nspoken to you of me? Will you take me to him? Is he still alive? Answer\nme, please! Is he still alive?\"\n\n\"I left him three days ago on the shore of a large sea.\"\n\n\"What was he doing?\"\n\n\"He was building a little boat with which to cross the ocean. For\nthe last four months, that poor man has been wandering around Europe,\nlooking for you. Not having found you yet, he has made up his mind to\nlook for you in the New World, far across the ocean.\"\n\n\"How far is it from here to the shore?\" asked Pinocchio anxiously.\n\n\"More than fifty miles.\"\n\n\"Fifty miles? Oh, dear Pigeon, how I wish I had your wings!\"\n\n\"If you want to come, I'll take you with me.\"\n\n\"How?\"\n\n\"Astride my back. Are you very heavy?\"\n\n\"Heavy? Not at all. I'm only a feather.\"\n\n\"Very well.\"\n\nSaying nothing more, Pinocchio jumped on the Pigeon's back and, as he\nsettled himself, he cried out gayly:\n\n\"Gallop on, gallop on, my pretty steed! I'm in a great hurry.\"\n\nThe Pigeon flew away, and in a few minutes he had reached the clouds.\nThe Marionette looked to see what was below them. His head swam and he\nwas so frightened that he clutched wildly at the Pigeon's neck to keep\nhimself from falling.\n\nThey flew all day. Toward evening the Pigeon said:\n\n\"I'm very thirsty!\"\n\n\"And I'm very hungry!\" said Pinocchio.\n\n\"Let us stop a few minutes at that pigeon coop down there. Then we can\ngo on and be at the seashore in the morning.\"\n\nThey went into the empty coop and there they found nothing but a bowl of\nwater and a small basket filled with chick-peas.\n\nThe Marionette had always hated chick-peas. According to him, they had\nalways made him sick; but that night he ate them with a relish. As he\nfinished them, he turned to the Pigeon and said:\n\n\"I never should have thought that chick-peas could be so good!\"\n\n\"You must remember, my boy,\" answered the Pigeon, \"that hunger is the\nbest sauce!\"\n\nAfter resting a few minutes longer, they set out again. The next morning\nthey were at the seashore.\n\nPinocchio jumped off the Pigeon's back, and the Pigeon, not wanting any\nthanks for a kind deed, flew away swiftly and disappeared.\n\nThe shore was full of people, shrieking and tearing their hair as they\nlooked toward the sea.\n\n\"What has happened?\" asked Pinocchio of a little old woman.\n\n\"A poor old father lost his only son some time ago and today he built a\ntiny boat for himself in order to go in search of him across the ocean.\nThe water is very rough and we're afraid he will be drowned.\"\n\n\"Where is the little boat?\"\n\n\"There. Straight down there,\" answered the little old woman, pointing to\na tiny shadow, no bigger than a nutshell, floating on the sea.\n\nPinocchio looked closely for a few minutes and then gave a sharp cry:\n\n\"It's my father! It's my father!\"\n\nMeanwhile, the little boat, tossed about by the angry waters, appeared\nand disappeared in the waves. And Pinocchio, standing on a high rock,\ntired out with searching, waved to him with hand and cap and even with\nhis nose.\n\nIt looked as if Geppetto, though far away from the shore, recognized his\nson, for he took off his cap and waved also. He seemed to be trying to\nmake everyone understand that he would come back if he were able, but\nthe sea was so heavy that he could do nothing with his oars. Suddenly a\nhuge wave came and the boat disappeared.\n\nThey waited and waited for it, but it was gone.\n\n\"Poor man!\" said the fisher folk on the shore, whispering a prayer as\nthey turned to go home.\n\nJust then a desperate cry was heard. Turning around, the fisher folk saw\nPinocchio dive into the sea and heard him cry out:\n\n\"I'll save him! I'll save my father!\"\n\nThe Marionette, being made of wood, floated easily along and swam like\na fish in the rough water. Now and again he disappeared only to reappear\nonce more. In a twinkling, he was far away from land. At last he was\ncompletely lost to view.\n\n\"Poor boy!\" cried the fisher folk on the shore, and again they mumbled a\nfew prayers, as they returned home.\n\n\n\nCHAPTER 24\n\nPinocchio reaches the Island of the Busy Bees and finds the Fairy once\nmore.\n\n\nPinocchio, spurred on by the hope of finding his father and of being in\ntime to save him, swam all night long.\n\nAnd what a horrible night it was! It poured rain, it hailed, it\nthundered, and the lightning was so bright that it turned the night into\nday.\n\nAt dawn, he saw, not far away from him, a long stretch of sand. It was\nan island in the middle of the sea.\n\nPinocchio tried his best to get there, but he couldn't. The waves played\nwith him and tossed him about as if he were a twig or a bit of straw. At\nlast, and luckily for him, a tremendous wave tossed him to the very spot\nwhere he wanted to be. The blow from the wave was so strong that, as he\nfell to the ground, his joints cracked and almost broke. But, nothing\ndaunted, he jumped to his feet and cried:\n\n\"Once more I have escaped with my life!\"\n\nLittle by little the sky cleared. The sun came out in full splendor and\nthe sea became as calm as a lake.\n\nThen the Marionette took off his clothes and laid them on the sand to\ndry. He looked over the waters to see whether he might catch sight of\na boat with a little man in it. He searched and he searched, but he saw\nnothing except sea and sky and far away a few sails, so small that they\nmight have been birds.\n\n\"If only I knew the name of this island!\" he said to himself. \"If I even\nknew what kind of people I would find here! But whom shall I ask? There\nis no one here.\"\n\nThe idea of finding himself in so lonesome a spot made him so sad that\nhe was about to cry, but just then he saw a big Fish swimming near-by,\nwith his head far out of the water.\n\nNot knowing what to call him, the Marionette said to him:\n\n\"Hey there, Mr. Fish, may I have a word with you?\"\n\n\"Even two, if you want,\" answered the fish, who happened to be a very\npolite Dolphin.\n\n\"Will you please tell me if, on this island, there are places where one\nmay eat without necessarily being eaten?\"\n\n\"Surely, there are,\" answered the Dolphin. \"In fact you'll find one not\nfar from this spot.\"\n\n\"And how shall I get there?\"\n\n\"Take that path on your left and follow your nose. You can't go wrong.\"\n\n\"Tell me another thing. You who travel day and night through the sea,\ndid you not perhaps meet a little boat with my father in it?\"\n\n\"And who is you father?\"\n\n\"He is the best father in the world, even as I am the worst son that can\nbe found.\"\n\n\"In the storm of last night,\" answered the Dolphin, \"the little boat\nmust have been swamped.\"\n\n\"And my father?\"\n\n\"By this time, he must have been swallowed by the Terrible Shark, which,\nfor the last few days, has been bringing terror to these waters.\"\n\n\"Is this Shark very big?\" asked Pinocchio, who was beginning to tremble\nwith fright.\n\n\"Is he big?\" replied the Dolphin. \"Just to give you an idea of his size,\nlet me tell you that he is larger than a five story building and that\nhe has a mouth so big and so deep, that a whole train and engine could\neasily get into it.\"\n\n\"Mother mine!\" cried the Marionette, scared to death; and dressing\nhimself as fast as he could, he turned to the Dolphin and said:\n\n\"Farewell, Mr. Fish. Pardon the bother, and many thanks for your\nkindness.\"\n\nThis said, he took the path at so swift a gait that he seemed to fly,\nand at every small sound he heard, he turned in fear to see whether the\nTerrible Shark, five stories high and with a train in his mouth, was\nfollowing him.\n\nAfter walking a half hour, he came to a small country called the Land\nof the Busy Bees. The streets were filled with people running to and fro\nabout their tasks. Everyone worked, everyone had something to do. Even\nif one were to search with a lantern, not one idle man or one tramp\ncould have been found.\n\n\"I understand,\" said Pinocchio at once wearily, \"this is no place for\nme! I was not born for work.\"\n\nBut in the meantime, he began to feel hungry, for it was twenty-four\nhours since he had eaten.\n\nWhat was to be done?\n\nThere were only two means left to him in order to get a bite to eat. He\nhad either to work or to beg.\n\nHe was ashamed to beg, because his father had always preached to him\nthat begging should be done only by the sick or the old. He had said\nthat the real poor in this world, deserving of our pity and help, were\nonly those who, either through age or sickness, had lost the means of\nearning their bread with their own hands. All others should work, and if\nthey didn't, and went hungry, so much the worse for them.\n\nJust then a man passed by, worn out and wet with perspiration, pulling,\nwith difficulty, two heavy carts filled with coal.\n\nPinocchio looked at him and, judging him by his looks to be a kind man,\nsaid to him with eyes downcast in shame:\n\n\"Will you be so good as to give me a penny, for I am faint with hunger?\"\n\n\"Not only one penny,\" answered the Coal Man. \"I'll give you four if you\nwill help me pull these two wagons.\"\n\n\"I am surprised!\" answered the Marionette, very much offended. \"I wish\nyou to know that I never have been a donkey, nor have I ever pulled a\nwagon.\"\n\n\"So much the better for you!\" answered the Coal Man. \"Then, my boy, if\nyou are really faint with hunger, eat two slices of your pride; and I\nhope they don't give you indigestion.\"\n\nA few minutes after, a Bricklayer passed by, carrying a pail full of\nplaster on his shoulder.\n\n\"Good man, will you be kind enough to give a penny to a poor boy who is\nyawning from hunger?\"\n\n\"Gladly,\" answered the Bricklayer. \"Come with me and carry some plaster,\nand instead of one penny, I'll give you five.\"\n\n\"But the plaster is heavy,\" answered Pinocchio, \"and the work too hard\nfor me.\"\n\n\"If the work is too hard for you, my boy, enjoy your yawns and may they\nbring you luck!\"\n\nIn less than a half hour, at least twenty people passed and Pinocchio\nbegged of each one, but they all answered:\n\n\"Aren't you ashamed? Instead of being a beggar in the streets, why don't\nyou look for work and earn your own bread?\"\n\nFinally a little woman went by carrying two water jugs.\n\n\"Good woman, will you allow me to have a drink from one of your jugs?\"\nasked Pinocchio, who was burning up with thirst.\n\n\"With pleasure, my boy!\" she answered, setting the two jugs on the\nground before him.\n\nWhen Pinocchio had had his fill, he grumbled, as he wiped his mouth:\n\n\"My thirst is gone. If I could only as easily get rid of my hunger!\"\n\nOn hearing these words, the good little woman immediately said:\n\n\"If you help me to carry these jugs home, I'll give you a slice of\nbread.\"\n\nPinocchio looked at the jug and said neither yes nor no.\n\n\"And with the bread, I'll give you a nice dish of cauliflower with white\nsauce on it.\"\n\nPinocchio gave the jug another look and said neither yes nor no.\n\n\"And after the cauliflower, some cake and jam.\"\n\nAt this last bribery, Pinocchio could no longer resist and said firmly:\n\n\"Very well. I'll take the jug home for you.\"\n\nThe jug was very heavy, and the Marionette, not being strong enough to\ncarry it with his hands, had to put it on his head.\n\nWhen they arrived home, the little woman made Pinocchio sit down at a\nsmall table and placed before him the bread, the cauliflower, and\nthe cake. Pinocchio did not eat; he devoured. His stomach seemed a\nbottomless pit.\n\nHis hunger finally appeased, he raised his head to thank his kind\nbenefactress. But he had not looked at her long when he gave a cry of\nsurprise and sat there with his eyes wide open, his fork in the air, and\nhis mouth filled with bread and cauliflower.\n\n\"Why all this surprise?\" asked the good woman, laughing.\n\n\"Because--\" answered Pinocchio, stammering and stuttering, \"because--you\nlook like--you remind me of--yes, yes, the same voice, the same eyes,\nthe same hair--yes, yes, yes, you also have the same azure hair she\nhad--Oh, my little Fairy, my little Fairy! Tell me that it is you! Don't\nmake me cry any longer! If you only knew! I have cried so much, I have\nsuffered so!\"\n\nAnd Pinocchio threw himself on the floor and clasped the knees of the\nmysterious little woman.\n\n\n\nCHAPTER 25\n\nPinocchio promises the Fairy to be good and to study, as he is growing\ntired of being a Marionette, and wishes to become a real boy.\n\n\nIf Pinocchio cried much longer, the little woman thought he would melt\naway, so she finally admitted that she was the little Fairy with Azure\nHair.\n\n\"You rascal of a Marionette! How did you know it was I?\" she asked,\nlaughing.\n\n\"My love for you told me who you were.\"\n\n\"Do you remember? You left me when I was a little girl and now you find\nme a grown woman. I am so old, I could almost be your mother!\"\n\n\"I am very glad of that, for then I can call you mother instead of\nsister. For a long time I have wanted a mother, just like other boys.\nBut how did you grow so quickly?\"\n\n\"That's a secret!\"\n\n\"Tell it to me. I also want to grow a little. Look at me! I have never\ngrown higher than a penny's worth of cheese.\"\n\n\"But you can't grow,\" answered the Fairy.\n\n\"Why not?\"\n\n\"Because Marionettes never grow. They are born Marionettes, they live\nMarionettes, and they die Marionettes.\"\n\n\"Oh, I'm tired of always being a Marionette!\" cried Pinocchio\ndisgustedly. \"It's about time for me to grow into a man as everyone else\ndoes.\"\n\n\"And you will if you deserve it--\"\n\n\"Really? What can I do to deserve it?\"\n\n\"It's a very simple matter. Try to act like a well-behaved child.\"\n\n\"Don't you think I do?\"\n\n\"Far from it! Good boys are obedient, and you, on the contrary--\"\n\n\"And I never obey.\"\n\n\"Good boys love study and work, but you--\"\n\n\"And I, on the contrary, am a lazy fellow and a tramp all year round.\"\n\n\"Good boys always tell the truth.\"\n\n\"And I always tell lies.\"\n\n\"Good boys go gladly to school.\"\n\n\"And I get sick if I go to school. From now on I'll be different.\"\n\n\"Do you promise?\"\n\n\"I promise. I want to become a good boy and be a comfort to my father.\nWhere is my poor father now?\"\n\n\"I do not know.\"\n\n\"Will I ever be lucky enough to find him and embrace him once more?\"\n\n\"I think so. Indeed, I am sure of it.\"\n\nAt this answer, Pinocchio's happiness was very great. He grasped the\nFairy's hands and kissed them so hard that it looked as if he had lost\nhis head. Then lifting his face, he looked at her lovingly and asked:\n\"Tell me, little Mother, it isn't true that you are dead, is it?\"\n\n\"It doesn't seem so,\" answered the Fairy, smiling.\n\n\"If you only knew how I suffered and how I wept when I read 'Here\nlies--'\"\n\n\"I know it, and for that I have forgiven you. The depth of your sorrow\nmade me see that you have a kind heart. There is always hope for boys\nwith hearts such as yours, though they may often be very mischievous.\nThis is the reason why I have come so far to look for you. From now on,\nI'll be your own little mother.\"\n\n\"Oh! How lovely!\" cried Pinocchio, jumping with joy.\n\n\"You will obey me always and do as I wish?\"\n\n\"Gladly, very gladly, more than gladly!\"\n\n\"Beginning tomorrow,\" said the Fairy, \"you'll go to school every day.\"\n\nPinocchio's face fell a little.\n\n\"Then you will choose the trade you like best.\"\n\nPinocchio became more serious.\n\n\"What are you mumbling to yourself?\" asked the Fairy.\n\n\"I was just saying,\" whined the Marionette in a whisper, \"that it seems\ntoo late for me to go to school now.\"\n\n\"No, indeed. Remember it is never too late to learn.\"\n\n\"But I don't want either trade or profession.\"\n\n\"Why?\"\n\n\"Because work wearies me!\"\n\n\"My dear boy,\" said the Fairy, \"people who speak as you do usually end\ntheir days either in a prison or in a hospital. A man, remember,\nwhether rich or poor, should do something in this world. No one can\nfind happiness without work. Woe betide the lazy fellow! Laziness is a\nserious illness and one must cure it immediately; yes, even from early\nchildhood. If not, it will kill you in the end.\"\n\nThese words touched Pinocchio's heart. He lifted his eyes to his Fairy\nand said seriously: \"I'll work; I'll study; I'll do all you tell me.\nAfter all, the life of a Marionette has grown very tiresome to me and I\nwant to become a boy, no matter how hard it is. You promise that, do you\nnot?\"\n\n\"Yes, I promise, and now it is up to you.\"\n\n\n\nCHAPTER 26\n\nPinocchio goes to the seashore with his friends to see the Terrible\nShark.\n\n\nIn the morning, bright and early, Pinocchio started for school.\n\nImagine what the boys said when they saw a Marionette enter the\nclassroom! They laughed until they cried. Everyone played tricks on him.\nOne pulled his hat off, another tugged at his coat, a third tried to\npaint a mustache under his nose. One even attempted to tie strings to\nhis feet and his hands to make him dance.\n\nFor a while Pinocchio was very calm and quiet. Finally, however, he\nlost all patience and turning to his tormentors, he said to them\nthreateningly:\n\n\"Careful, boys, I haven't come here to be made fun of. I'll respect you\nand I want you to respect me.\"\n\n\"Hurrah for Dr. Know-all! You have spoken like a printed book!\" howled\nthe boys, bursting with laughter. One of them, more impudent than the\nrest, put out his hand to pull the Marionette's nose.\n\nBut he was not quick enough, for Pinocchio stretched his leg under the\ntable and kicked him hard on the shin.\n\n\"Oh, what hard feet!\" cried the boy, rubbing the spot where the\nMarionette had kicked him.\n\n\"And what elbows! They are even harder than the feet!\" shouted another\none, who, because of some other trick, had received a blow in the\nstomach.\n\nWith that kick and that blow Pinocchio gained everybody's favor.\nEveryone admired him, danced attendance upon him, petted and caressed\nhim.\n\nAs the days passed into weeks, even the teacher praised him, for he saw\nhim attentive, hard working, and wide awake, always the first to come in\nthe morning, and the last to leave when school was over.\n\nPinocchio's only fault was that he had too many friends. Among these\nwere many well-known rascals, who cared not a jot for study or for\nsuccess.\n\nThe teacher warned him each day, and even the good Fairy repeated to him\nmany times:\n\n\"Take care, Pinocchio! Those bad companions will sooner or later make\nyou lose your love for study. Some day they will lead you astray.\"\n\n\"There's no such danger,\" answered the Marionette, shrugging his\nshoulders and pointing to his forehead as if to say, \"I'm too wise.\"\n\nSo it happened that one day, as he was walking to school, he met some\nboys who ran up to him and said:\n\n\"Have you heard the news?\"\n\n\"No!\"\n\n\"A Shark as big as a mountain has been seen near the shore.\"\n\n\"Really? I wonder if it could be the same one I heard of when my father\nwas drowned?\"\n\n\"We are going to see it. Are you coming?\"\n\n\"No, not I. I must go to school.\"\n\n\"What do you care about school? You can go there tomorrow. With a lesson\nmore or less, we are always the same donkeys.\"\n\n\"And what will the teacher say?\"\n\n\"Let him talk. He is paid to grumble all day long.\"\n\n\"And my mother?\"\n\n\"Mothers don't know anything,\" answered those scamps.\n\n\"Do you know what I'll do?\" said Pinocchio. \"For certain reasons of\nmine, I, too, want to see that Shark; but I'll go after school. I can\nsee him then as well as now.\"\n\n\"Poor simpleton!\" cried one of the boys. \"Do you think that a fish of\nthat size will stand there waiting for you? He turns and off he goes,\nand no one will ever be the wiser.\"\n\n\"How long does it take from here to the shore?\" asked the Marionette.\n\"One hour there and back.\"\n\n\n\"Very well, then. Let's see who gets there first!\" cried Pinocchio.\n\nAt the signal, the little troop, with books under their arms, dashed\nacross the fields. Pinocchio led the way, running as if on wings, the\nothers following as fast as they could.\n\nNow and again, he looked back and, seeing his followers hot and tired,\nand with tongues hanging out, he laughed out heartily. Unhappy boy! If\nhe had only known then the dreadful things that were to happen to him on\naccount of his disobedience!\n\n\n\nCHAPTER 27\n\nThe great battle between Pinocchio and his playmates. One is wounded.\nPinocchio is arrested.\n\n\nGoing like the wind, Pinocchio took but a very short time to reach the\nshore. He glanced all about him, but there was no sign of a Shark. The\nsea was as smooth as glass.\n\n\"Hey there, boys! Where's that Shark?\" he asked, turning to his\nplaymates.\n\n\"He may have gone for his breakfast,\" said one of them, laughing.\n\n\"Or, perhaps, he went to bed for a little nap,\" said another, laughing\nalso.\n\nFrom the answers and the laughter which followed them, Pinocchio\nunderstood that the boys had played a trick on him.\n\n\"What now?\" he said angrily to them. \"What's the joke?\"\n\n\"Oh, the joke's on you!\" cried his tormentors, laughing more heartily\nthan ever, and dancing gayly around the Marionette.\n\n\"And that is--?\"\n\n\"That we have made you stay out of school to come with us. Aren't you\nashamed of being such a goody-goody, and of studying so hard? You never\nhave a bit of enjoyment.\"\n\n\"And what is it to you, if I do study?\"\n\n\"What does the teacher think of us, you mean?\"\n\n\"Why?\"\n\n\"Don't you see? If you study and we don't, we pay for it. After all,\nit's only fair to look out for ourselves.\"\n\n\"What do you want me to do?\"\n\n\"Hate school and books and teachers, as we all do. They are your worst\nenemies, you know, and they like to make you as unhappy as they can.\"\n\n\"And if I go on studying, what will you do to me?\"\n\n\"You'll pay for it!\"\n\n\"Really, you amuse me,\" answered the Marionette, nodding his head.\n\n\"Hey, Pinocchio,\" cried the tallest of them all, \"that will do. We are\ntired of hearing you bragging about yourself, you little turkey cock!\nYou may not be afraid of us, but remember we are not afraid of you,\neither! You are alone, you know, and we are seven.\"\n\n\"Like the seven sins,\" said Pinocchio, still laughing.\n\n\"Did you hear that? He has insulted us all. He has called us sins.\"\n\n\"Pinocchio, apologize for that, or look out!\"\n\n\"Cuck--oo!\" said the Marionette, mocking them with his thumb to his\nnose.\n\n\"You'll be sorry!\"\n\n\"Cuck--oo!\"\n\n\"We'll whip you soundly!\"\n\n\"Cuck--oo!\"\n\n\"You'll go home with a broken nose!\"\n\n\"Cuck--oo!\"\n\n\"Very well, then! Take that, and keep it for your supper,\" called out\nthe boldest of his tormentors.\n\nAnd with the words, he gave Pinocchio a terrible blow on the head.\n\nPinocchio answered with another blow, and that was the signal for the\nbeginning of the fray. In a few moments, the fight raged hot and heavy\non both sides.\n\nPinocchio, although alone, defended himself bravely. With those two\nwooden feet of his, he worked so fast that his opponents kept at a\nrespectful distance. Wherever they landed, they left their painful mark\nand the boys could only run away and howl.\n\nEnraged at not being able to fight the Marionette at close quarters,\nthey started to throw all kinds of books at him. Readers, geographies,\nhistories, grammars flew in all directions. But Pinocchio was keen of\neye and swift of movement, and the books only passed over his head,\nlanded in the sea, and disappeared.\n\nThe fish, thinking they might be good to eat, came to the top of the\nwater in great numbers. Some took a nibble, some took a bite, but no\nsooner had they tasted a page or two, than they spat them out with a wry\nface, as if to say:\n\n\"What a horrid taste! Our own food is so much better!\"\n\nMeanwhile, the battle waxed more and more furious. At the noise, a large\nCrab crawled slowly out of the water and, with a voice that sounded like\na trombone suffering from a cold, he cried out:\n\n\"Stop fighting, you rascals! These battles between boys rarely end well.\nTrouble is sure to come to you!\"\n\nPoor Crab! He might as well have spoken to the wind. Instead of\nlistening to his good advice, Pinocchio turned to him and said as\nroughly as he knew how:\n\n\"Keep quiet, ugly Gab! It would be better for you to chew a few cough\ndrops to get rid of that cold you have. Go to bed and sleep! You will\nfeel better in the morning.\"\n\nIn the meantime, the boys, having used all their books, looked around\nfor new ammunition. Seeing Pinocchio's bundle lying idle near-by, they\nsomehow managed to get hold of it.\n\nOne of the books was a very large volume, an arithmetic text, heavily\nbound in leather. It was Pinocchio's pride. Among all his books, he\nliked that one the best.\n\nThinking it would make a fine missile, one of the boys took hold of it\nand threw it with all his strength at Pinocchio's head. But instead of\nhitting the Marionette, the book struck one of the other boys, who, as\npale as a ghost, cried out faintly: \"Oh, Mother, help! I'm dying!\" and\nfell senseless to the ground.\n\nAt the sight of that pale little corpse, the boys were so frightened\nthat they turned tail and ran. In a few moments, all had disappeared.\n\nAll except Pinocchio. Although scared to death by the horror of what\nhad been done, he ran to the sea and soaked his handkerchief in the cool\nwater and with it bathed the head of his poor little schoolmate. Sobbing\nbitterly, he called to him, saying:\n\n\"Eugene! My poor Eugene! Open your eyes and look at me! Why don't you\nanswer? I was not the one who hit you, you know. Believe me, I didn't\ndo it. Open your eyes, Eugene? If you keep them shut, I'll die, too.\nOh, dear me, how shall I ever go home now? How shall I ever look at my\nlittle mother again? What will happen to me? Where shall I go? Where\nshall I hide? Oh, how much better it would have been, a thousand times\nbetter, if only I had gone to school! Why did I listen to those boys?\nThey always were a bad influence! And to think that the teacher had told\nme--and my mother, too!--'Beware of bad company!' That's what she said.\nBut I'm stubborn and proud. I listen, but always I do as I wish. And\nthen I pay. I've never had a moment's peace since I've been born! Oh,\ndear! What will become of me? What will become of me?\"\n\nPinocchio went on crying and moaning and beating his head. Again and\nagain he called to his little friend, when suddenly he heard heavy steps\napproaching.\n\nHe looked up and saw two tall Carabineers near him.\n\n\"What are you doing stretched out on the ground?\" they asked Pinocchio.\n\n\"I'm helping this schoolfellow of mine.\"\n\n\"Has he fainted?\"\n\n\"I should say so,\" said one of the Carabineers, bending to look at\nEugene. \"This boy has been wounded on the temple. Who has hurt him?\"\n\n\"Not I,\" stammered the Marionette, who had hardly a breath left in his\nwhole body.\n\n\"If it wasn't you, who was it, then?\"\n\n\"Not I,\" repeated Pinocchio.\n\n\"And with what was he wounded?\"\n\n\"With this book,\" and the Marionette picked up the arithmetic text to\nshow it to the officer.\n\n\"And whose book is this?\"\n\n\"Mine.\"\n\n\"Enough.\"\n\n\"Not another word! Get up as quickly as you can and come along with us.\"\n\n\"But I--\"\n\n\"Come with us!\"\n\n\"But I am innocent.\"\n\n\"Come with us!\"\n\nBefore starting out, the officers called out to several fishermen\npassing by in a boat and said to them:\n\n\"Take care of this little fellow who has been hurt. Take him home and\nbind his wounds. Tomorrow we'll come after him.\"\n\nThey then took hold of Pinocchio and, putting him between them, said to\nhim in a rough voice: \"March! And go quickly, or it will be the worse\nfor you!\"\n\nThey did not have to repeat their words. The Marionette walked swiftly\nalong the road to the village. But the poor fellow hardly knew what\nhe was about. He thought he had a nightmare. He felt ill. His eyes saw\neverything double, his legs trembled, his tongue was dry, and, try as he\nmight, he could not utter a single word. Yet, in spite of this numbness\nof feeling, he suffered keenly at the thought of passing under the\nwindows of his good little Fairy's house. What would she say on seeing\nhim between two Carabineers?\n\nThey had just reached the village, when a sudden gust of wind blew off\nPinocchio's cap and made it go sailing far down the street.\n\n\"Would you allow me,\" the Marionette asked the Carabineers, \"to run\nafter my cap?\"\n\n\"Very well, go; but hurry.\"\n\nThe Marionette went, picked up his cap--but instead of putting it on his\nhead, he stuck it between his teeth and then raced toward the sea.\n\nHe went like a bullet out of a gun.\n\nThe Carabineers, judging that it would be very difficult to catch him,\nsent a large Mastiff after him, one that had won first prize in all the\ndog races. Pinocchio ran fast and the Dog ran faster. At so much noise,\nthe people hung out of the windows or gathered in the street, anxious to\nsee the end of the contest. But they were disappointed, for the Dog and\nPinocchio raised so much dust on the road that, after a few moments, it\nwas impossible to see them.\n\n\n\nCHAPTER 28\n\nPinocchio runs the danger of being fried in a pan like a fish\n\n\nDuring that wild chase, Pinocchio lived through a terrible moment when\nhe almost gave himself up as lost. This was when Alidoro (that was the\nMastiff's name), in a frenzy of running, came so near that he was on the\nvery point of reaching him.\n\nThe Marionette heard, close behind him, the labored breathing of the\nbeast who was fast on his trail, and now and again even felt his hot\nbreath blow over him.\n\nLuckily, by this time, he was very near the shore, and the sea was in\nsight; in fact, only a few short steps away.\n\nAs soon as he set foot on the beach, Pinocchio gave a leap and fell into\nthe water. Alidoro tried to stop, but as he was running very fast, he\ncouldn't, and he, too, landed far out in the sea. Strange though it may\nseem, the Dog could not swim. He beat the water with his paws to hold\nhimself up, but the harder he tried, the deeper he sank. As he stuck his\nhead out once more, the poor fellow's eyes were bulging and he barked\nout wildly, \"I drown! I drown!\"\n\n\"Drown!\" answered Pinocchio from afar, happy at his escape.\n\n\"Help, Pinocchio, dear little Pinocchio! Save me from death!\"\n\nAt those cries of suffering, the Marionette, who after all had a very\nkind heart, was moved to compassion. He turned toward the poor animal\nand said to him:\n\n\"But if I help you, will you promise not to bother me again by running\nafter me?\"\n\n\"I promise! I promise! Only hurry, for if you wait another second, I'll\nbe dead and gone!\"\n\nPinocchio hesitated still another minute. Then, remembering how his\nfather had often told him that a kind deed is never lost, he swam to\nAlidoro and, catching hold of his tail, dragged him to the shore.\n\nThe poor Dog was so weak he could not stand. He had swallowed so much\nsalt water that he was swollen like a balloon. However, Pinocchio, not\nwishing to trust him too much, threw himself once again into the sea. As\nhe swam away, he called out:\n\n\"Good-by, Alidoro, good luck and remember me to the family!\"\n\n\"Good-by, little Pinocchio,\" answered the Dog. \"A thousand thanks for\nhaving saved me from death. You did me a good turn, and, in this world,\nwhat is given is always returned. If the chance comes, I shall be\nthere.\"\n\nPinocchio went on swimming close to shore. At last he thought he had\nreached a safe place. Glancing up and down the beach, he saw the opening\nof a cave out of which rose a spiral of smoke.\n\n\"In that cave,\" he said to himself, \"there must be a fire. So much the\nbetter. I'll dry my clothes and warm myself, and then--well--\"\n\nHis mind made up, Pinocchio swam to the rocks, but as he started to\nclimb, he felt something under him lifting him up higher and higher. He\ntried to escape, but he was too late. To his great surprise, he found\nhimself in a huge net, amid a crowd of fish of all kinds and sizes, who\nwere fighting and struggling desperately to free themselves.\n\nAt the same time, he saw a Fisherman come out of the cave, a Fisherman\nso ugly that Pinocchio thought he was a sea monster. In place of hair,\nhis head was covered by a thick bush of green grass. Green was the skin\nof his body, green were his eyes, green was the long, long beard that\nreached down to his feet. He looked like a giant lizard with legs and\narms.\n\nWhen the Fisherman pulled the net out of the sea, he cried out joyfully:\n\n\"Blessed Providence! Once more I'll have a fine meal of fish!\"\n\n\"Thank Heaven, I'm not a fish!\" said Pinocchio to himself, trying with\nthese words to find a little courage.\n\nThe Fisherman took the net and the fish to the cave, a dark, gloomy,\nsmoky place. In the middle of it, a pan full of oil sizzled over a\nsmoky fire, sending out a repelling odor of tallow that took away one's\nbreath.\n\n\"Now, let's see what kind of fish we have caught today,\" said the Green\nFisherman. He put a hand as big as a spade into the net and pulled out a\nhandful of mullets.\n\n\"Fine mullets, these!\" he said, after looking at them and smelling them\nwith pleasure. After that, he threw them into a large, empty tub.\n\nMany times he repeated this performance. As he pulled each fish out of\nthe net, his mouth watered with the thought of the good dinner coming,\nand he said:\n\n\"Fine fish, these bass!\"\n\n\"Very tasty, these whitefish!\"\n\n\"Delicious flounders, these!\"\n\n\"What splendid crabs!\"\n\n\"And these dear little anchovies, with their heads still on!\"\n\nAs you can well imagine, the bass, the flounders, the whitefish, and\neven the little anchovies all went together into the tub to keep the\nmullets company. The last to come out of the net was Pinocchio.\n\nAs soon as the Fisherman pulled him out, his green eyes opened wide with\nsurprise, and he cried out in fear:\n\n\"What kind of fish is this? I don't remember ever eating anything like\nit.\"\n\nHe looked at him closely and after turning him over and over, he said at\nlast:\n\n\"I understand. He must be a crab!\"\n\nPinocchio, mortified at being taken for a crab, said resentfully:\n\n\"What nonsense! A crab indeed! I am no such thing. Beware how you deal\nwith me! I am a Marionette, I want you to know.\"\n\n\"A Marionette?\" asked the Fisherman. \"I must admit that a Marionette\nfish is, for me, an entirely new kind of fish. So much the better. I'll\neat you with greater relish.\"\n\n\"Eat me? But can't you understand that I'm not a fish? Can't you hear\nthat I speak and think as you do?\"\n\n\"It's true,\" answered the Fisherman; \"but since I see that you are a\nfish, well able to talk and think as I do, I'll treat you with all due\nrespect.\"\n\n\"And that is--\"\n\n\"That, as a sign of my particular esteem, I'll leave to you the choice\nof the manner in which you are to be cooked. Do you wish to be fried in\na pan, or do you prefer to be cooked with tomato sauce?\"\n\n\"To tell you the truth,\" answered Pinocchio, \"if I must choose, I should\nmuch rather go free so I may return home!\"\n\n\"Are you fooling? Do you think that I want to lose the opportunity to\ntaste such a rare fish? A Marionette fish does not come very often to\nthese seas. Leave it to me. I'll fry you in the pan with the others.\nI know you'll like it. It's always a comfort to find oneself in good\ncompany.\"\n\nThe unlucky Marionette, hearing this, began to cry and wail and beg.\nWith tears streaming down his cheeks, he said:\n\n\"How much better it would have been for me to go to school! I did listen\nto my playmates and now I am paying for it! Oh! Oh! Oh!\"\n\nAnd as he struggled and squirmed like an eel to escape from him, the\nGreen Fisherman took a stout cord and tied him hand and foot, and threw\nhim into the bottom of the tub with the others.\n\nThen he pulled a wooden bowl full of flour out of a cupboard and started\nto roll the fish into it, one by one. When they were white with it,\nhe threw them into the pan. The first to dance in the hot oil were the\nmullets, the bass followed, then the whitefish, the flounders, and the\nanchovies. Pinocchio's turn came last. Seeing himself so near to death\n(and such a horrible death!) he began to tremble so with fright that he\nhad no voice left with which to beg for his life.\n\nThe poor boy beseeched only with his eyes. But the Green Fisherman,\nnot even noticing that it was he, turned him over and over in the flour\nuntil he looked like a Marionette made of chalk.\n\nThen he took him by the head and . . .\n\n\n\nCHAPTER 29\n\nPinocchio returns to the Fairy's house and she promises him that, on the\nmorrow, he will cease to be a Marionette and become a boy. A wonderful\nparty of coffee-and-milk to celebrate the great event.\n\n\nMindful of what the Fisherman had said, Pinocchio knew that all hope\nof being saved had gone. He closed his eyes and waited for the final\nmoment.\n\nSuddenly, a large Dog, attracted by the odor of the boiling oil, came\nrunning into the cave.\n\n\"Get out!\" cried the Fisherman threateningly and still holding onto the\nMarionette, who was all covered with flour.\n\nBut the poor Dog was very hungry, and whining and wagging his tail, he\ntried to say:\n\n\"Give me a bite of the fish and I'll go in peace.\"\n\n\"Get out, I say!\" repeated the Fisherman.\n\nAnd he drew back his foot to give the Dog a kick.\n\nThen the Dog, who, being really hungry, would take no refusal, turned\nin a rage toward the Fisherman and bared his terrible fangs. And at that\nmoment, a pitiful little voice was heard saying: \"Save me, Alidoro; if\nyou don't, I fry!\"\n\nThe Dog immediately recognized Pinocchio's voice. Great was his surprise\nto find that the voice came from the little flour-covered bundle that\nthe Fisherman held in his hand.\n\nThen what did he do? With one great leap, he grasped that bundle in his\nmouth and, holding it lightly between his teeth, ran through the door\nand disappeared like a flash!\n\nThe Fisherman, angry at seeing his meal snatched from under his nose,\nran after the Dog, but a bad fit of coughing made him stop and turn\nback.\n\nMeanwhile, Alidoro, as soon as he had found the road which led to the\nvillage, stopped and dropped Pinocchio softly to the ground.\n\n\"How much I do thank you!\" said the Marionette.\n\n\"It is not necessary,\" answered the Dog. \"You saved me once, and what is\ngiven is always returned. We are in this world to help one another.\"\n\n\"But how did you get in that cave?\"\n\n\"I was lying here on the sand more dead than alive, when an appetizing\nodor of fried fish came to me. That odor tickled my hunger and I\nfollowed it. Oh, if I had come a moment later!\"\n\n\"Don't speak about it,\" wailed Pinocchio, still trembling with fright.\n\"Don't say a word. If you had come a moment later, I would be fried,\neaten, and digested by this time. Brrrrrr! I shiver at the mere thought\nof it.\"\n\nAlidoro laughingly held out his paw to the Marionette, who shook it\nheartily, feeling that now he and the Dog were good friends. Then they\nbid each other good-by and the Dog went home.\n\nPinocchio, left alone, walked toward a little hut near by, where an old\nman sat at the door sunning himself, and asked:\n\n\"Tell me, good man, have you heard anything of a poor boy with a wounded\nhead, whose name was Eugene?\"\n\n\"The boy was brought to this hut and now--\"\n\n\"Now he is dead?\" Pinocchio interrupted sorrowfully.\n\n\"No, he is now alive and he has already returned home.\"\n\n\"Really? Really?\" cried the Marionette, jumping around with joy. \"Then\nthe wound was not serious?\"\n\n\"But it might have been--and even mortal,\" answered the old man, \"for a\nheavy book was thrown at his head.\"\n\n\"And who threw it?\"\n\n\"A schoolmate of his, a certain Pinocchio.\"\n\n\"And who is this Pinocchio?\" asked the Marionette, feigning ignorance.\n\n\"They say he is a mischief-maker, a tramp, a street urchin--\"\n\n\"Calumnies! All calumnies!\"\n\n\"Do you know this Pinocchio?\"\n\n\"By sight!\" answered the Marionette.\n\n\"And what do you think of him?\" asked the old man.\n\n\"I think he's a very good boy, fond of study, obedient, kind to his\nFather, and to his whole family--\"\n\nAs he was telling all these enormous lies about himself, Pinocchio\ntouched his nose and found it twice as long as it should be. Scared out\nof his wits, he cried out:\n\n\"Don't listen to me, good man! All the wonderful things I have said are\nnot true at all. I know Pinocchio well and he is indeed a very wicked\nfellow, lazy and disobedient, who instead of going to school, runs away\nwith his playmates to have a good time.\"\n\nAt this speech, his nose returned to its natural size.\n\n\"Why are you so pale?\" the old man asked suddenly.\n\n\"Let me tell you. Without knowing it, I rubbed myself against a newly\npainted wall,\" he lied, ashamed to say that he had been made ready for\nthe frying pan.\n\n\"What have you done with your coat and your hat and your breeches?\"\n\n\"I met thieves and they robbed me. Tell me, my good man, have you not,\nperhaps, a little suit to give me, so that I may go home?\"\n\n\"My boy, as for clothes, I have only a bag in which I keep hops. If you\nwant it, take it. There it is.\"\n\nPinocchio did not wait for him to repeat his words. He took the bag,\nwhich happened to be empty, and after cutting a big hole at the top and\ntwo at the sides, he slipped into it as if it were a shirt. Lightly clad\nas he was, he started out toward the village.\n\nAlong the way he felt very uneasy. In fact he was so unhappy that he\nwent along taking two steps forward and one back, and as he went he said\nto himself:\n\n\"How shall I ever face my good little Fairy? What will she say when she\nsees me? Will she forgive this last trick of mine? I am sure she won't.\nOh, no, she won't. And I deserve it, as usual! For I am a rascal, fine\non promises which I never keep!\"\n\nHe came to the village late at night. It was so dark he could see\nnothing and it was raining pitchforks.\n\nPinocchio went straight to the Fairy's house, firmly resolved to knock\nat the door.\n\nWhen he found himself there, he lost courage and ran back a few steps.\nA second time he came to the door and again he ran back. A third time\nhe repeated his performance. The fourth time, before he had time to lose\nhis courage, he grasped the knocker and made a faint sound with it.\n\nHe waited and waited and waited. Finally, after a full half hour, a\ntop-floor window (the house had four stories) opened and Pinocchio saw\na large Snail look out. A tiny light glowed on top of her head. \"Who\nknocks at this late hour?\" she called.\n\n\"Is the Fairy home?\" asked the Marionette.\n\n\"The Fairy is asleep and does not wish to be disturbed. Who are you?\"\n\n\"It is I.\"\n\n\"Who's I?\"\n\n\"Pinocchio.\"\n\n\"Who is Pinocchio?\"\n\n\"The Marionette; the one who lives in the Fairy's house.\"\n\n\"Oh, I understand,\" said the Snail. \"Wait for me there. I'll come down\nto open the door for you.\"\n\n\"Hurry, I beg of you, for I am dying of cold.\"\n\n\"My boy, I am a snail and snails are never in a hurry.\"\n\nAn hour passed, two hours; and the door was still closed. Pinocchio, who\nwas trembling with fear and shivering from the cold rain on his back,\nknocked a second time, this time louder than before.\n\nAt that second knock, a window on the third floor opened and the same\nSnail looked out.\n\n\"Dear little Snail,\" cried Pinocchio from the street. \"I have been\nwaiting two hours for you! And two hours on a dreadful night like this\nare as long as two years. Hurry, please!\"\n\n\"My boy,\" answered the Snail in a calm, peaceful voice, \"my dear boy, I\nam a snail and snails are never in a hurry.\" And the window closed.\n\nA few minutes later midnight struck; then one o'clock--two o'clock. And\nthe door still remained closed!\n\nThen Pinocchio, losing all patience, grabbed the knocker with both\nhands, fully determined to awaken the whole house and street with it.\nAs soon as he touched the knocker, however, it became an eel and wiggled\naway into the darkness.\n\n\"Really?\" cried Pinocchio, blind with rage. \"If the knocker is gone, I\ncan still use my feet.\"\n\nHe stepped back and gave the door a most solemn kick. He kicked so hard\nthat his foot went straight through the door and his leg followed almost\nto the knee. No matter how he pulled and tugged, he could not pull it\nout. There he stayed as if nailed to the door.\n\nPoor Pinocchio! The rest of the night he had to spend with one foot\nthrough the door and the other one in the air.\n\nAs dawn was breaking, the door finally opened. That brave little animal,\nthe Snail, had taken exactly nine hours to go from the fourth floor to\nthe street. How she must have raced!\n\n\"What are you doing with your foot through the door?\" she asked the\nMarionette, laughing.\n\n\"It was a misfortune. Won't you try, pretty little Snail, to free me\nfrom this terrible torture?\"\n\n\"My boy, we need a carpenter here and I have never been one.\"\n\n\"Ask the Fairy to help me!\"\n\n\"The Fairy is asleep and does not want to be disturbed.\"\n\n\"But what do you want me to do, nailed to the door like this?\"\n\n\"Enjoy yourself counting the ants which are passing by.\"\n\n\"Bring me something to eat, at least, for I am faint with hunger.\"\n\n\"Immediately!\"\n\nIn fact, after three hours and a half, Pinocchio saw her return with\na silver tray on her head. On the tray there was bread, roast chicken,\nfruit.\n\n\"Here is the breakfast the Fairy sends to you,\" said the Snail.\n\nAt the sight of all these good things, the Marionette felt much better.\n\nWhat was his disgust, however, when on tasting the food, he found the\nbread to be made of chalk, the chicken of cardboard, and the brilliant\nfruit of colored alabaster!\n\nHe wanted to cry, he wanted to give himself up to despair, he wanted to\nthrow away the tray and all that was on it. Instead, either from pain or\nweakness, he fell to the floor in a dead faint.\n\nWhen he regained his senses, he found himself stretched out on a sofa\nand the Fairy was seated near him.\n\n\"This time also I forgive you,\" said the Fairy to him. \"But be careful\nnot to get into mischief again.\"\n\nPinocchio promised to study and to behave himself. And he kept his word\nfor the remainder of the year. At the end of it, he passed first in all\nhis examinations, and his report was so good that the Fairy said to him\nhappily:\n\n\"Tomorrow your wish will come true.\"\n\n\"And what is it?\"\n\n\"Tomorrow you will cease to be a Marionette and will become a real boy.\"\n\nPinocchio was beside himself with joy. All his friends and schoolmates\nmust be invited to celebrate the great event! The Fairy promised to\nprepare two hundred cups of coffee-and-milk and four hundred slices of\ntoast buttered on both sides.\n\nThe day promised to be a very gay and happy one, but--\n\nUnluckily, in a Marionette's life there's always a BUT which is apt to\nspoil everything.\n\n\n\nCHAPTER 30\n\nPinocchio, instead of becoming a boy, runs away to the Land of Toys with\nhis friend, Lamp-Wick.\n\n\nComing at last out of the surprise into which the Fairy's words had\nthrown him, Pinocchio asked for permission to give out the invitations.\n\n\"Indeed, you may invite your friends to tomorrow's party. Only remember\nto return home before dark. Do you understand?\"\n\n\"I'll be back in one hour without fail,\" answered the Marionette.\n\n\"Take care, Pinocchio! Boys give promises very easily, but they as\neasily forget them.\"\n\n\"But I am not like those others. When I give my word I keep it.\"\n\n\"We shall see. In case you do disobey, you will be the one to suffer,\nnot anyone else.\"\n\n\"Why?\"\n\n\"Because boys who do not listen to their elders always come to grief.\"\n\n\"I certainly have,\" said Pinocchio, \"but from now on, I obey.\"\n\n\"We shall see if you are telling the truth.\"\n\nWithout adding another word, the Marionette bade the good Fairy good-by,\nand singing and dancing, he left the house.\n\nIn a little more than an hour, all his friends were invited. Some\naccepted quickly and gladly. Others had to be coaxed, but when they\nheard that the toast was to be buttered on both sides, they all ended by\naccepting the invitation with the words, \"We'll come to please you.\"\n\nNow it must be known that, among all his friends, Pinocchio had one whom\nhe loved most of all. The boy's real name was Romeo, but everyone called\nhim Lamp-Wick, for he was long and thin and had a woebegone look about\nhim.\n\nLamp-Wick was the laziest boy in the school and the biggest\nmischief-maker, but Pinocchio loved him dearly.\n\nThat day, he went straight to his friend's house to invite him to the\nparty, but Lamp-Wick was not at home. He went a second time, and again a\nthird, but still without success.\n\nWhere could he be? Pinocchio searched here and there and everywhere, and\nfinally discovered him hiding near a farmer's wagon.\n\n\"What are you doing there?\" asked Pinocchio, running up to him.\n\n\"I am waiting for midnight to strike to go--\"\n\n\"Where?\"\n\n\"Far, far away!\"\n\n\"And I have gone to your house three times to look for you!\"\n\n\"What did you want from me?\"\n\n\"Haven't you heard the news? Don't you know what good luck is mine?\"\n\n\"What is it?\"\n\n\"Tomorrow I end my days as a Marionette and become a boy, like you and\nall my other friends.\"\n\n\"May it bring you luck!\"\n\n\"Shall I see you at my party tomorrow?\"\n\n\"But I'm telling you that I go tonight.\"\n\n\"At what time?\"\n\n\"At midnight.\"\n\n\"And where are you going?\"\n\n\"To a real country--the best in the world--a wonderful place!\"\n\n\"What is it called?\"\n\n\"It is called the Land of Toys. Why don't you come, too?\"\n\n\"I? Oh, no!\"\n\n\"You are making a big mistake, Pinocchio. Believe me, if you don't come,\nyou'll be sorry. Where can you find a place that will agree better with\nyou and me? No schools, no teachers, no books! In that blessed place\nthere is no such thing as study. Here, it is only on Saturdays that\nwe have no school. In the Land of Toys, every day, except Sunday, is a\nSaturday. Vacation begins on the first of January and ends on the last\nday of December. That is the place for me! All countries should be like\nit! How happy we should all be!\"\n\n\"But how does one spend the day in the Land of Toys?\"\n\n\"Days are spent in play and enjoyment from morn till night. At night one\ngoes to bed, and next morning, the good times begin all over again. What\ndo you think of it?\"\n\n\"H'm--!\" said Pinocchio, nodding his wooden head, as if to say, \"It's\nthe kind of life which would agree with me perfectly.\"\n\n\"Do you want to go with me, then? Yes or no? You must make up your\nmind.\"\n\n\"No, no, and again no! I have promised my kind Fairy to become a good\nboy, and I want to keep my word. Just see: The sun is setting and I must\nleave you and run. Good-by and good luck to you!\"\n\n\"Where are you going in such a hurry?\"\n\n\"Home. My good Fairy wants me to return home before night.\"\n\n\"Wait two minutes more.\"\n\n\"It's too late!\"\n\n\"Only two minutes.\"\n\n\"And if the Fairy scolds me?\"\n\n\"Let her scold. After she gets tired, she will stop,\" said Lamp-Wick.\n\n\"Are you going alone or with others?\"\n\n\"Alone? There will be more than a hundred of us!\"\n\n\"Will you walk?\"\n\n\"At midnight the wagon passes here that is to take us within the\nboundaries of that marvelous country.\"\n\n\"How I wish midnight would strike!\"\n\n\"Why?\"\n\n\"To see you all set out together.\"\n\n\"Stay here a while longer and you will see us!\"\n\n\"No, no. I want to return home.\"\n\n\"Wait two more minutes.\"\n\n\"I have waited too long as it is. The Fairy will be worried.\"\n\n\"Poor Fairy! Is she afraid the bats will eat you up?\"\n\n\"Listen, Lamp-Wick,\" said the Marionette, \"are you really sure that\nthere are no schools in the Land of Toys?\" \"Not even the shadow of one.\"\n\n\"Not even one teacher?\"\n\n\"Not one.\"\n\n\"And one does not have to study?\"\n\n\"Never, never, never!\"\n\n\"What a great land!\" said Pinocchio, feeling his mouth water. \"What a\nbeautiful land! I have never been there, but I can well imagine it.\"\n\n\"Why don't you come, too?\"\n\n\"It is useless for you to tempt me! I told you I promised my good Fairy\nto behave myself, and I am going to keep my word.\"\n\n\"Good-by, then, and remember me to the grammar schools, to the high\nschools, and even to the colleges if you meet them on the way.\"\n\n\"Good-by, Lamp-Wick. Have a pleasant trip, enjoy yourself, and remember\nyour friends once in a while.\"\n\nWith these words, the Marionette started on his way home. Turning once\nmore to his friend, he asked him:\n\n\"But are you sure that, in that country, each week is composed of six\nSaturdays and one Sunday?\"\n\n\"Very sure!\"\n\n\"And that vacation begins on the first of January and ends on the\nthirty-first of December?\"\n\n\"Very, very sure!\"\n\n\"What a great country!\" repeated Pinocchio, puzzled as to what to do.\n\nThen, in sudden determination, he said hurriedly:\n\n\"Good-by for the last time, and good luck.\"\n\n\"Good-by.\"\n\n\"How soon will you go?\"\n\n\"Within two hours.\"\n\n\"What a pity! If it were only one hour, I might wait for you.\"\n\n\"And the Fairy?\"\n\n\"By this time I'm late, and one hour more or less makes very little\ndifference.\"\n\n\"Poor Pinocchio! And if the Fairy scolds you?\"\n\n\"Oh, I'll let her scold. After she gets tired, she will stop.\"\n\nIn the meantime, the night became darker and darker. All at once in the\ndistance a small light flickered. A queer sound could be heard, soft\nas a little bell, and faint and muffled like the buzz of a far-away\nmosquito.\n\n\"There it is!\" cried Lamp-Wick, jumping to his feet.\n\n\"What?\" whispered Pinocchio.\n\n\"The wagon which is coming to get me. For the last time, are you coming\nor not?\"\n\n\"But is it really true that in that country boys never have to study?\"\n\n\"Never, never, never!\"\n\n\"What a wonderful, beautiful, marvelous country! Oh--h--h!!\"\n\n\n\nCHAPTER 31\n\nAfter five months of play, Pinocchio wakes up one fine morning and finds\na great surprise awaiting him.\n\n\nFinally the wagon arrived. It made no noise, for its wheels were bound\nwith straw and rags.\n\nIt was drawn by twelve pair of donkeys, all of the same size, but all\nof different color. Some were gray, others white, and still others a\nmixture of brown and black. Here and there were a few with large yellow\nand blue stripes.\n\nThe strangest thing of all was that those twenty-four donkeys, instead\nof being iron-shod like any other beast of burden, had on their feet\nlaced shoes made of leather, just like the ones boys wear.\n\nAnd the driver of the wagon?\n\nImagine to yourselves a little, fat man, much wider than he was long,\nround and shiny as a ball of butter, with a face beaming like an apple,\na little mouth that always smiled, and a voice small and wheedling like\nthat of a cat begging for food.\n\nNo sooner did any boy see him than he fell in love with him, and nothing\nsatisfied him but to be allowed to ride in his wagon to that lovely\nplace called the Land of Toys.\n\nIn fact the wagon was so closely packed with boys of all ages that it\nlooked like a box of sardines. They were uncomfortable, they were piled\none on top of the other, they could hardly breathe; yet not one word of\ncomplaint was heard. The thought that in a few hours they would reach a\ncountry where there were no schools, no books, no teachers, made these\nboys so happy that they felt neither hunger, nor thirst, nor sleep, nor\ndiscomfort.\n\nNo sooner had the wagon stopped than the little fat man turned to\nLamp-Wick. With bows and smiles, he asked in a wheedling tone:\n\n\"Tell me, my fine boy, do you also want to come to my wonderful\ncountry?\"\n\n\"Indeed I do.\"\n\n\"But I warn you, my little dear, there's no more room in the wagon. It\nis full.\"\n\n\"Never mind,\" answered Lamp-Wick. \"If there's no room inside, I can sit\non the top of the coach.\"\n\nAnd with one leap, he perched himself there.\n\n\"What about you, my love?\" asked the Little Man, turning politely to\nPinocchio. \"What are you going to do? Will you come with us, or do you\nstay here?\"\n\n\"I stay here,\" answered Pinocchio. \"I want to return home, as I prefer\nto study and to succeed in life.\"\n\n\"May that bring you luck!\"\n\n\"Pinocchio!\" Lamp-Wick called out. \"Listen to me. Come with us and we'll\nalways be happy.\"\n\n\"No, no, no!\"\n\n\"Come with us and we'll always be happy,\" cried four other voices from\nthe wagon.\n\n\"Come with us and we'll always be happy,\" shouted the one hundred and\nmore boys in the wagon, all together. \"And if I go with you, what will\nmy good Fairy say?\" asked the Marionette, who was beginning to waver and\nweaken in his good resolutions.\n\n\"Don't worry so much. Only think that we are going to a land where\nwe shall be allowed to make all the racket we like from morning till\nnight.\"\n\nPinocchio did not answer, but sighed deeply once--twice--a third time.\nFinally, he said:\n\n\"Make room for me. I want to go, too!\"\n\n\"The seats are all filled,\" answered the Little Man, \"but to show you\nhow much I think of you, take my place as coachman.\"\n\n\"And you?\"\n\n\"I'll walk.\"\n\n\"No, indeed. I could not permit such a thing. I much prefer riding one\nof these donkeys,\" cried Pinocchio.\n\nNo sooner said than done. He approached the first donkey and tried to\nmount it. But the little animal turned suddenly and gave him such a\nterrible kick in the stomach that Pinocchio was thrown to the ground and\nfell with his legs in the air.\n\nAt this unlooked-for entertainment, the whole company of runaways\nlaughed uproariously.\n\nThe little fat man did not laugh. He went up to the rebellious animal,\nand, still smiling, bent over him lovingly and bit off half of his right\near.\n\nIn the meantime, Pinocchio lifted himself up from the ground, and with\none leap landed on the donkey's back. The leap was so well taken that\nall the boys shouted,\n\n\"Hurrah for Pinocchio!\" and clapped their hands in hearty applause.\n\nSuddenly the little donkey gave a kick with his two hind feet and,\nat this unexpected move, the poor Marionette found himself once again\nsprawling right in the middle of the road.\n\nAgain the boys shouted with laughter. But the Little Man, instead of\nlaughing, became so loving toward the little animal that, with another\nkiss, he bit off half of his left ear.\n\n\"You can mount now, my boy,\" he then said to Pinocchio. \"Have no fear.\nThat donkey was worried about something, but I have spoken to him and\nnow he seems quiet and reasonable.\"\n\nPinocchio mounted and the wagon started on its way. While the donkeys\ngalloped along the stony road, the Marionette fancied he heard a very\nquiet voice whispering to him:\n\n\"Poor silly! You have done as you wished. But you are going to be a\nsorry boy before very long.\"\n\nPinocchio, greatly frightened, looked about him to see whence the words\nhad come, but he saw no one. The donkeys galloped, the wagon rolled\non smoothly, the boys slept (Lamp-Wick snored like a dormouse) and the\nlittle, fat driver sang sleepily between his teeth.\n\nAfter a mile or so, Pinocchio again heard the same faint voice\nwhispering: \"Remember, little simpleton! Boys who stop studying and turn\ntheir backs upon books and schools and teachers in order to give all\ntheir time to nonsense and pleasure, sooner or later come to grief. Oh,\nhow well I know this! How well I can prove it to you! A day will come\nwhen you will weep bitterly, even as I am weeping now--but it will be\ntoo late!\"\n\nAt these whispered words, the Marionette grew more and more frightened.\nHe jumped to the ground, ran up to the donkey on whose back he had been\nriding, and taking his nose in his hands, looked at him. Think how great\nwas his surprise when he saw that the donkey was weeping--weeping just\nlike a boy!\n\n\"Hey, Mr. Driver!\" cried the Marionette. \"Do you know what strange thing\nis happening here! This donkey weeps.\"\n\n\"Let him weep. When he gets married, he will have time to laugh.\"\n\n\"Have you perhaps taught him to speak?\"\n\n\"No, he learned to mumble a few words when he lived for three years with\na band of trained dogs.\"\n\n\"Poor beast!\"\n\n\"Come, come,\" said the Little Man, \"do not lose time over a donkey that\ncan weep. Mount quickly and let us go. The night is cool and the road is\nlong.\"\n\nPinocchio obeyed without another word. The wagon started again. Toward\ndawn the next morning they finally reached that much-longed-for country,\nthe Land of Toys.\n\nThis great land was entirely different from any other place in the\nworld. Its population, large though it was, was composed wholly of boys.\nThe oldest were about fourteen years of age, the youngest, eight. In\nthe street, there was such a racket, such shouting, such blowing of\ntrumpets, that it was deafening. Everywhere groups of boys were gathered\ntogether. Some played at marbles, at hopscotch, at ball. Others rode on\nbicycles or on wooden horses. Some played at blindman's buff, others at\ntag. Here a group played circus, there another sang and recited. A few\nturned somersaults, others walked on their hands with their feet in the\nair. Generals in full uniform leading regiments of cardboard soldiers\npassed by. Laughter, shrieks, howls, catcalls, hand-clapping followed\nthis parade. One boy made a noise like a hen, another like a rooster,\nand a third imitated a lion in his den. All together they created such\na pandemonium that it would have been necessary for you to put cotton\nin your ears. The squares were filled with small wooden theaters,\noverflowing with boys from morning till night, and on the walls of the\nhouses, written with charcoal, were words like these: HURRAH FOR THE\nLAND OF TOYS! DOWN WITH ARITHMETIC! NO MORE SCHOOL!\n\nAs soon as they had set foot in that land, Pinocchio, Lamp-Wick, and\nall the other boys who had traveled with them started out on a tour of\ninvestigation. They wandered everywhere, they looked into every nook and\ncorner, house and theater. They became everybody's friend. Who could be\nhappier than they?\n\nWhat with entertainments and parties, the hours, the days, the weeks\npassed like lightning.\n\n\"Oh, what a beautiful life this is!\" said Pinocchio each time that, by\nchance, he met his friend Lamp-Wick.\n\n\"Was I right or wrong?\" answered Lamp-Wick. \"And to think you did not\nwant to come! To think that even yesterday the idea came into your head\nto return home to see your Fairy and to start studying again! If today\nyou are free from pencils and books and school, you owe it to me, to\nmy advice, to my care. Do you admit it? Only true friends count, after\nall.\"\n\n\"It's true, Lamp-Wick, it's true. If today I am a really happy boy, it\nis all because of you. And to think that the teacher, when speaking of\nyou, used to say, 'Do not go with that Lamp-Wick! He is a bad companion\nand some day he will lead you astray.'\"\n\n\"Poor teacher!\" answered the other, nodding his head. \"Indeed I know how\nmuch he disliked me and how he enjoyed speaking ill of me. But I am of a\ngenerous nature, and I gladly forgive him.\"\n\n\"Great soul!\" said Pinocchio, fondly embracing his friend.\n\nFive months passed and the boys continued playing and enjoying\nthemselves from morn till night, without ever seeing a book, or a desk,\nor a school. But, my children, there came a morning when Pinocchio awoke\nand found a great surprise awaiting him, a surprise which made him feel\nvery unhappy, as you shall see.\n\n\n\nCHAPTER 32\n\nPinocchio's ears become like those of a Donkey. In a little while he\nchanges into a real Donkey and begins to bray.\n\n\nEveryone, at one time or another, has found some surprise awaiting him.\nOf the kind which Pinocchio had on that eventful morning of his life,\nthere are but few.\n\nWhat was it? I will tell you, my dear little readers. On awakening,\nPinocchio put his hand up to his head and there he found--\n\nGuess!\n\nHe found that, during the night, his ears had grown at least ten full\ninches!\n\nYou must know that the Marionette, even from his birth, had very small\nears, so small indeed that to the naked eye they could hardly be seen.\nFancy how he felt when he noticed that overnight those two dainty organs\nhad become as long as shoe brushes!\n\nHe went in search of a mirror, but not finding any, he just filled a\nbasin with water and looked at himself. There he saw what he never\ncould have wished to see. His manly figure was adorned and enriched by a\nbeautiful pair of donkey's ears.\n\nI leave you to think of the terrible grief, the shame, the despair of\nthe poor Marionette.\n\nHe began to cry, to scream, to knock his head against the wall, but the\nmore he shrieked, the longer and the more hairy grew his ears.\n\nAt those piercing shrieks, a Dormouse came into the room, a fat little\nDormouse, who lived upstairs. Seeing Pinocchio so grief-stricken, she\nasked him anxiously:\n\n\"What is the matter, dear little neighbor?\"\n\n\"I am sick, my little Dormouse, very, very sick--and from an illness\nwhich frightens me! Do you understand how to feel the pulse?\"\n\n\"A little.\"\n\n\"Feel mine then and tell me if I have a fever.\"\n\nThe Dormouse took Pinocchio's wrist between her paws and, after a few\nminutes, looked up at him sorrowfully and said: \"My friend, I am sorry,\nbut I must give you some very sad news.\"\n\n\"What is it?\"\n\n\"You have a very bad fever.\"\n\n\"But what fever is it?\"\n\n\"The donkey fever.\"\n\n\"I don't know anything about that fever,\" answered the Marionette,\nbeginning to understand even too well what was happening to him.\n\n\"Then I will tell you all about it,\" said the Dormouse. \"Know then that,\nwithin two or three hours, you will no longer be a Marionette, nor a\nboy.\"\n\n\"What shall I be?\"\n\n\"Within two or three hours you will become a real donkey, just like the\nones that pull the fruit carts to market.\"\n\n\"Oh, what have I done? What have I done?\" cried Pinocchio, grasping his\ntwo long ears in his hands and pulling and tugging at them angrily, just\nas if they belonged to another.\n\n\"My dear boy,\" answered the Dormouse to cheer him up a bit, \"why worry\nnow? What is done cannot be undone, you know. Fate has decreed that all\nlazy boys who come to hate books and schools and teachers and spend all\ntheir days with toys and games must sooner or later turn into donkeys.\"\n\n\"But is it really so?\" asked the Marionette, sobbing bitterly.\n\n\"I am sorry to say it is. And tears now are useless. You should have\nthought of all this before.\"\n\n\"But the fault is not mine. Believe me, little Dormouse, the fault is\nall Lamp-Wick's.\"\n\n\"And who is this Lamp-Wick?\"\n\n\"A classmate of mine. I wanted to return home. I wanted to be obedient.\nI wanted to study and to succeed in school, but Lamp-Wick said to me,\n'Why do you want to waste your time studying? Why do you want to go to\nschool? Come with me to the Land of Toys. There we'll never study again.\nThere we can enjoy ourselves and be happy from morn till night.'\"\n\n\"And why did you follow the advice of that false friend?\"\n\n\"Why? Because, my dear little Dormouse, I am a heedless\nMarionette--heedless and heartless. Oh! If I had only had a bit of\nheart, I should never have abandoned that good Fairy, who loved me\nso well and who has been so kind to me! And by this time, I should no\nlonger be a Marionette. I should have become a real boy, like all these\nfriends of mine! Oh, if I meet Lamp-Wick I am going to tell him what I\nthink of him--and more, too!\"\n\nAfter this long speech, Pinocchio walked to the door of the room. But\nwhen he reached it, remembering his donkey ears, he felt ashamed to show\nthem to the public and turned back. He took a large cotton bag from a\nshelf, put it on his head, and pulled it far down to his very nose.\n\nThus adorned, he went out. He looked for Lamp-Wick everywhere, along the\nstreets, in the squares, inside the theatres, everywhere; but he was\nnot to be found. He asked everyone whom he met about him, but no one had\nseen him. In desperation, he returned home and knocked at the door.\n\n\"Who is it?\" asked Lamp-Wick from within.\n\n\"It is I!\" answered the Marionette.\n\n\"Wait a minute.\"\n\nAfter a full half hour the door opened. Another surprise awaited\nPinocchio! There in the room stood his friend, with a large cotton bag\non his head, pulled far down to his very nose.\n\nAt the sight of that bag, Pinocchio felt slightly happier and thought to\nhimself:\n\n\"My friend must be suffering from the same sickness that I am! I wonder\nif he, too, has donkey fever?\"\n\nBut pretending he had seen nothing, he asked with a smile:\n\n\"How are you, my dear Lamp-Wick?\"\n\n\"Very well. Like a mouse in a Parmesan cheese.\"\n\n\"Is that really true?\"\n\n\"Why should I lie to you?\"\n\n\"I beg your pardon, my friend, but why then are you wearing that cotton\nbag over your ears?\"\n\n\"The doctor has ordered it because one of my knees hurts. And you, dear\nMarionette, why are you wearing that cotton bag down to your nose?\"\n\n\"The doctor has ordered it because I have bruised my foot.\"\n\n\"Oh, my poor Pinocchio!\"\n\n\"Oh, my poor Lamp-Wick!\"\n\nAn embarrassingly long silence followed these words, during which time\nthe two friends looked at each other in a mocking way.\n\nFinally the Marionette, in a voice sweet as honey and soft as a flute,\nsaid to his companion:\n\n\"Tell me, Lamp-Wick, dear friend, have you ever suffered from an\nearache?\"\n\n\"Never! And you?\"\n\n\"Never! Still, since this morning my ear has been torturing me.\"\n\n\"So has mine.\"\n\n\"Yours, too? And which ear is it?\"\n\n\"Both of them. And yours?\"\n\n\"Both of them, too. I wonder if it could be the same sickness.\"\n\n\"I'm afraid it is.\"\n\n\"Will you do me a favor, Lamp-Wick?\"\n\n\"Gladly! With my whole heart.\"\n\n\"Will you let me see your ears?\"\n\n\"Why not? But before I show you mine, I want to see yours, dear\nPinocchio.\"\n\n\"No. You must show yours first.\"\n\n\"No, my dear! Yours first, then mine.\"\n\n\"Well, then,\" said the Marionette, \"let us make a contract.\"\n\n\"Let's hear the contract!\"\n\n\"Let us take off our caps together. All right?\"\n\n\"All right.\"\n\n\"Ready then!\"\n\nPinocchio began to count, \"One! Two! Three!\"\n\nAt the word \"Three!\" the two boys pulled off their caps and threw them\nhigh in air.\n\nAnd then a scene took place which is hard to believe, but it is all too\ntrue. The Marionette and his friend, Lamp-Wick, when they saw each other\nboth stricken by the same misfortune, instead of feeling sorrowful and\nashamed, began to poke fun at each other, and after much nonsense, they\nended by bursting out into hearty laughter.\n\nThey laughed and laughed, and laughed again--laughed till they\nached--laughed till they cried.\n\nBut all of a sudden Lamp-Wick stopped laughing. He tottered and almost\nfell. Pale as a ghost, he turned to Pinocchio and said:\n\n\"Help, help, Pinocchio!\"\n\n\"What is the matter?\"\n\n\"Oh, help me! I can no longer stand up.\"\n\n\"I can't either,\" cried Pinocchio; and his laughter turned to tears as\nhe stumbled about helplessly.\n\nThey had hardly finished speaking, when both of them fell on all fours\nand began running and jumping around the room. As they ran, their arms\nturned into legs, their faces lengthened into snouts and their backs\nbecame covered with long gray hairs.\n\nThis was humiliation enough, but the most horrible moment was the one\nin which the two poor creatures felt their tails appear. Overcome with\nshame and grief, they tried to cry and bemoan their fate.\n\nBut what is done can't be undone! Instead of moans and cries, they burst\nforth into loud donkey brays, which sounded very much like, \"Haw! Haw!\nHaw!\"\n\nAt that moment, a loud knocking was heard at the door and a voice called\nto them:\n\n\"Open! I am the Little Man, the driver of the wagon which brought you\nhere. Open, I say, or beware!\"\n\n\n\nCHAPTER 33\n\nPinocchio, having become a Donkey, is bought by the owner of a Circus,\nwho wants to teach him to do tricks. The Donkey becomes lame and is sold\nto a man who wants to use his skin for a drumhead.\n\n\nVery sad and downcast were the two poor little fellows as they stood\nand looked at each other. Outside the room, the Little Man grew more and\nmore impatient, and finally gave the door such a violent kick that\nit flew open. With his usual sweet smile on his lips, he looked at\nPinocchio and Lamp-Wick and said to them:\n\n\"Fine work, boys! You have brayed well, so well that I recognized your\nvoices immediately, and here I am.\"\n\nOn hearing this, the two Donkeys bowed their heads in shame, dropped\ntheir ears, and put their tails between their legs.\n\nAt first, the Little Man petted and caressed them and smoothed down\ntheir hairy coats. Then he took out a currycomb and worked over them\ntill they shone like glass. Satisfied with the looks of the two little\nanimals, he bridled them and took them to a market place far away from\nthe Land of Toys, in the hope of selling them at a good price.\n\nIn fact, he did not have to wait very long for an offer. Lamp-Wick was\nbought by a farmer whose donkey had died the day before. Pinocchio went\nto the owner of a circus, who wanted to teach him to do tricks for his\naudiences.\n\nAnd now do you understand what the Little Man's profession was? This\nhorrid little being, whose face shone with kindness, went about the\nworld looking for boys. Lazy boys, boys who hated books, boys who wanted\nto run away from home, boys who were tired of school--all these were his\njoy and his fortune. He took them with him to the Land of Toys and let\nthem enjoy themselves to their heart's content. When, after months of\nall play and no work, they became little donkeys, he sold them on the\nmarket place. In a few years, he had become a millionaire.\n\nWhat happened to Lamp-Wick? My dear children, I do not know. Pinocchio,\nI can tell you, met with great hardships even from the first day.\n\nAfter putting him in a stable, his new master filled his manger with\nstraw, but Pinocchio, after tasting a mouthful, spat it out.\n\nThen the man filled the manger with hay. But Pinocchio did not like that\nany better.\n\n\"Ah, you don't like hay either?\" he cried angrily. \"Wait, my pretty\nDonkey, I'll teach you not to be so particular.\"\n\nWithout more ado, he took a whip and gave the Donkey a hearty blow\nacross the legs.\n\nPinocchio screamed with pain and as he screamed he brayed:\n\n\"Haw! Haw! Haw! I can't digest straw!\"\n\n\"Then eat the hay!\" answered his master, who understood the Donkey\nperfectly.\n\n\"Haw! Haw! Haw! Hay gives me a headache!\"\n\n\"Do you pretend, by any chance, that I should feed you duck or chicken?\"\nasked the man again, and, angrier than ever, he gave poor Pinocchio\nanother lashing.\n\nAt that second beating, Pinocchio became very quiet and said no more.\n\nAfter that, the door of the stable was closed and he was left alone. It\nwas many hours since he had eaten anything and he started to yawn from\nhunger. As he yawned, he opened a mouth as big as an oven.\n\nFinally, not finding anything else in the manger, he tasted the hay.\nAfter tasting it, he chewed it well, closed his eyes, and swallowed it.\n\n\"This hay is not bad,\" he said to himself. \"But how much happier I\nshould be if I had studied! Just now, instead of hay, I should be eating\nsome good bread and butter. Patience!\"\n\nNext morning, when he awoke, Pinocchio looked in the manger for more\nhay, but it was all gone. He had eaten it all during the night.\n\nHe tried the straw, but, as he chewed away at it, he noticed to his\ngreat disappointment that it tasted neither like rice nor like macaroni.\n\n\"Patience!\" he repeated as he chewed. \"If only my misfortune might serve\nas a lesson to disobedient boys who refuse to study! Patience! Have\npatience!\"\n\n\"Patience indeed!\" shouted his master just then, as he came into the\nstable. \"Do you think, perhaps, my little Donkey, that I have brought\nyou here only to give you food and drink? Oh, no! You are to help me\nearn some fine gold pieces, do you hear? Come along, now. I am going\nto teach you to jump and bow, to dance a waltz and a polka, and even to\nstand on your head.\"\n\nPoor Pinocchio, whether he liked it or not, had to learn all these\nwonderful things; but it took him three long months and cost him many,\nmany lashings before he was pronounced perfect.\n\nThe day came at last when Pinocchio's master was able to announce an\nextraordinary performance. The announcements, posted all around the\ntown, and written in large letters, read thus:\n\n     GREAT SPECTACLE TONIGHT\n     LEAPS AND EXERCISES BY THE GREAT ARTISTS\n     AND THE FAMOUS HORSES\n     of the\n     COMPANY\n\n     First Public Appearance\n\n     of the\n\n     FAMOUS DONKEY\n\n     called\n\n     PINOCCHIO\n\n     THE STAR OF THE DANCE\n     ----\n     The Theater will be as Light as Day\n\nThat night, as you can well imagine, the theater was filled to\noverflowing one hour before the show was scheduled to start.\n\nNot an orchestra chair could be had, not a balcony seat, nor a gallery\nseat; not even for their weight in gold.\n\nThe place swarmed with boys and girls of all ages and sizes, wriggling\nand dancing about in a fever of impatience to see the famous Donkey\ndance.\n\nWhen the first part of the performance was over, the Owner and Manager\nof the circus, in a black coat, white knee breeches, and patent leather\nboots, presented himself to the public and in a loud, pompous voice made\nthe following announcement:\n\n\"Most honored friends, Gentlemen and Ladies!\n\n\"Your humble servant, the Manager of this theater, presents himself\nbefore you tonight in order to introduce to you the greatest, the most\nfamous Donkey in the world, a Donkey that has had the great honor in his\nshort life of performing before the kings and queens and emperors of all\nthe great courts of Europe.\n\n\"We thank you for your attention!\"\n\nThis speech was greeted by much laughter and applause. And the applause\ngrew to a roar when Pinocchio, the famous Donkey, appeared in the circus\nring. He was handsomely arrayed. A new bridle of shining leather with\nbuckles of polished brass was on his back; two white camellias were tied\nto his ears; ribbons and tassels of red silk adorned his mane, which was\ndivided into many curls. A great sash of gold and silver was fastened\naround his waist and his tail was decorated with ribbons of many\nbrilliant colors. He was a handsome Donkey indeed!\n\nThe Manager, when introducing him to the public, added these words:\n\n\"Most honored audience! I shall not take your time tonight to tell you\nof the great difficulties which I have encountered while trying to tame\nthis animal, since I found him in the wilds of Africa. Observe, I beg\nof you, the savage look of his eye. All the means used by centuries of\ncivilization in subduing wild beasts failed in this case. I had finally\nto resort to the gentle language of the whip in order to bring him to\nmy will. With all my kindness, however, I never succeeded in gaining my\nDonkey's love. He is still today as savage as the day I found him. He\nstill fears and hates me. But I have found in him one great redeeming\nfeature. Do you see this little bump on his forehead? It is this bump\nwhich gives him his great talent of dancing and using his feet as nimbly\nas a human being. Admire him, O signori, and enjoy yourselves. I let\nyou, now, be the judges of my success as a teacher of animals. Before\nI leave you, I wish to state that there will be another performance\ntomorrow night. If the weather threatens rain, the great spectacle will\ntake place at eleven o'clock in the morning.\"\n\nThe Manager bowed and then turned to Pinocchio and said: \"Ready,\nPinocchio! Before starting your performance, salute your audience!\"\n\nPinocchio obediently bent his two knees to the ground and remained\nkneeling until the Manager, with the crack of the whip, cried sharply:\n\"Walk!\"\n\nThe Donkey lifted himself on his four feet and walked around the ring. A\nfew minutes passed and again the voice of the Manager called:\n\n\"Quickstep!\" and Pinocchio obediently changed his step.\n\n\"Gallop!\" and Pinocchio galloped.\n\n\"Full speed!\" and Pinocchio ran as fast as he could. As he ran the\nmaster raised his arm and a pistol shot rang in the air.\n\nAt the shot, the little Donkey fell to the ground as if he were really\ndead.\n\nA shower of applause greeted the Donkey as he arose to his feet. Cries\nand shouts and handclappings were heard on all sides.\n\nAt all that noise, Pinocchio lifted his head and raised his eyes. There,\nin front of him, in a box sat a beautiful woman. Around her neck she\nwore a long gold chain, from which hung a large medallion. On the\nmedallion was painted the picture of a Marionette.\n\n\"That picture is of me! That beautiful lady is my Fairy!\" said Pinocchio\nto himself, recognizing her. He felt so happy that he tried his best to\ncry out:\n\n\"Oh, my Fairy! My own Fairy!\"\n\nBut instead of words, a loud braying was heard in the theater, so loud\nand so long that all the spectators--men, women, and children, but\nespecially the children--burst out laughing.\n\nThen, in order to teach the Donkey that it was not good manners to bray\nbefore the public, the Manager hit him on the nose with the handle of\nthe whip.\n\nThe poor little Donkey stuck out a long tongue and licked his nose for a\nlong time in an effort to take away the pain.\n\nAnd what was his grief when on looking up toward the boxes, he saw that\nthe Fairy had disappeared!\n\nHe felt himself fainting, his eyes filled with tears, and he wept\nbitterly. No one knew it, however, least of all the Manager, who,\ncracking his whip, cried out:\n\n\"Bravo, Pinocchio! Now show us how gracefully you can jump through the\nrings.\"\n\nPinocchio tried two or three times, but each time he came near the ring,\nhe found it more to his taste to go under it. The fourth time, at a look\nfrom his master he leaped through it, but as he did so his hind legs\ncaught in the ring and he fell to the floor in a heap.\n\nWhen he got up, he was lame and could hardly limp as far as the stable.\n\n\"Pinocchio! We want Pinocchio! We want the little Donkey!\" cried the\nboys from the orchestra, saddened by the accident.\n\nNo one saw Pinocchio again that evening.\n\nThe next morning the veterinary--that is, the animal doctor--declared\nthat he would be lame for the rest of his life.\n\n\"What do I want with a lame donkey?\" said the Manager to the stableboy.\n\"Take him to the market and sell him.\"\n\nWhen they reached the square, a buyer was soon found.\n\n\"How much do you ask for that little lame Donkey?\" he asked.\n\n\"Four dollars.\"\n\n\"I'll give you four cents. Don't think I'm buying him for work. I want\nonly his skin. It looks very tough and I can use it to make myself a\ndrumhead. I belong to a musical band in my village and I need a drum.\"\n\nI leave it to you, my dear children, to picture to yourself the great\npleasure with which Pinocchio heard that he was to become a drumhead!\n\nAs soon as the buyer had paid the four cents, the Donkey changed hands.\nHis new owner took him to a high cliff overlooking the sea, put a stone\naround his neck, tied a rope to one of his hind feet, gave him a push,\nand threw him into the water.\n\nPinocchio sank immediately. And his new master sat on the cliff waiting\nfor him to drown, so as to skin him and make himself a drumhead.\n\n\n\nCHAPTER 34\n\nPinocchio is thrown into the sea, eaten by fishes, and becomes a\nMarionette once more. As he swims to land, he is swallowed by the\nTerrible Shark.\n\n\nDown into the sea, deeper and deeper, sank Pinocchio, and finally, after\nfifty minutes of waiting, the man on the cliff said to himself:\n\n\"By this time my poor little lame Donkey must be drowned. Up with him\nand then I can get to work on my beautiful drum.\"\n\nHe pulled the rope which he had tied to Pinocchio's leg--pulled and\npulled and pulled and, at last, he saw appear on the surface of the\nwater--Can you guess what? Instead of a dead donkey, he saw a very much\nalive Marionette, wriggling and squirming like an eel.\n\nSeeing that wooden Marionette, the poor man thought he was dreaming and\nsat there with his mouth wide open and his eyes popping out of his head.\n\nGathering his wits together, he said:\n\n\"And the Donkey I threw into the sea?\"\n\n\"I am that Donkey,\" answered the Marionette laughing.\n\n\"You?\"\n\n\"I.\"\n\n\"Ah, you little cheat! Are you poking fun at me?\"\n\n\"Poking fun at you? Not at all, dear Master. I am talking seriously.\"\n\n\"But, then, how is it that you, who a few minutes ago were a donkey, are\nnow standing before me a wooden Marionette?\"\n\n\"It may be the effect of salt water. The sea is fond of playing these\ntricks.\"\n\n\"Be careful, Marionette, be careful! Don't laugh at me! Woe be to you,\nif I lose my patience!\"\n\n\"Well, then, my Master, do you want to know my whole story? Untie my leg\nand I can tell it to you better.\"\n\nThe old fellow, curious to know the true story of the Marionette's life,\nimmediately untied the rope which held his foot. Pinocchio, feeling free\nas a bird of the air, began his tale:\n\n\"Know, then, that, once upon a time, I was a wooden Marionette, just\nas I am today. One day I was about to become a boy, a real boy, but on\naccount of my laziness and my hatred of books, and because I listened to\nbad companions, I ran away from home. One beautiful morning, I awoke to\nfind myself changed into a donkey--long ears, gray coat, even a tail!\nWhat a shameful day for me! I hope you will never experience one like\nit, dear Master. I was taken to the fair and sold to a Circus Owner, who\ntried to make me dance and jump through the rings. One night, during a\nperformance, I had a bad fall and became lame. Not knowing what to do\nwith a lame donkey, the Circus Owner sent me to the market place and you\nbought me.\"\n\n\"Indeed I did! And I paid four cents for you. Now who will return my\nmoney to me?\"\n\n\"But why did you buy me? You bought me to do me harm--to kill me--to\nmake a drumhead out of me!\"\n\n\"Indeed I did! And now where shall I find another skin?\"\n\n\"Never mind, dear Master. There are so many donkeys in this world.\"\n\n\"Tell me, impudent little rogue, does your story end here?\"\n\n\"One more word,\" answered the Marionette, \"and I am through. After\nbuying me, you brought me here to kill me. But feeling sorry for me, you\ntied a stone to my neck and threw me to the bottom of the sea. That was\nvery good and kind of you to want me to suffer as little as possible and\nI shall remember you always. And now my Fairy will take care of me, even\nif you--\"\n\n\"Your Fairy? Who is she?\"\n\n\"She is my mother, and, like all other mothers who love their children,\nshe never loses sight of me, even though I do not deserve it. And today\nthis good Fairy of mine, as soon as she saw me in danger of drowning,\nsent a thousand fishes to the spot where I lay. They thought I was\nreally a dead donkey and began to eat me. What great bites they took!\nOne ate my ears, another my nose, a third my neck and my mane. Some went\nat my legs and some at my back, and among the others, there was one tiny\nfish so gentle and polite that he did me the great favor of eating even\nmy tail.\"\n\n\"From now on,\" said the man, horrified, \"I swear I shall never again\ntaste fish. How I should enjoy opening a mullet or a whitefish just to\nfind there the tail of a dead donkey!\"\n\n\"I think as you do,\" answered the Marionette, laughing. \"Still, you must\nknow that when the fish finished eating my donkey coat, which covered\nme from head to foot, they naturally came to the bones--or rather, in my\ncase, to the wood, for as you know, I am made of very hard wood. After\nthe first few bites, those greedy fish found out that the wood was not\ngood for their teeth, and, afraid of indigestion, they turned and ran\nhere and there without saying good-by or even as much as thank you to\nme. Here, dear Master, you have my story. You know now why you found a\nMarionette and not a dead donkey when you pulled me out of the water.\"\n\n\"I laugh at your story!\" cried the man angrily. \"I know that I spent\nfour cents to get you and I want my money back. Do you know what I can\ndo; I am going to take you to the market once more and sell you as dry\nfirewood.\"\n\n\"Very well, sell me. I am satisfied,\" said Pinocchio. But as he spoke,\nhe gave a quick leap and dived into the sea. Swimming away as fast as he\ncould, he cried out, laughing:\n\n\"Good-by, Master. If you ever need a skin for your drum, remember me.\"\n\nHe swam on and on. After a while, he turned around again and called\nlouder than before:\n\n\"Good-by, Master. If you ever need a piece of good dry firewood,\nremember me.\"\n\nIn a few seconds he had gone so far he could hardly be seen. All that\ncould be seen of him was a very small black dot moving swiftly on the\nblue surface of the water, a little black dot which now and then lifted\na leg or an arm in the air. One would have thought that Pinocchio had\nturned into a porpoise playing in the sun.\n\nAfter swimming for a long time, Pinocchio saw a large rock in the middle\nof the sea, a rock as white as marble. High on the rock stood a little\nGoat bleating and calling and beckoning to the Marionette to come to\nher.\n\nThere was something very strange about that little Goat. Her coat was\nnot white or black or brown as that of any other goat, but azure, a deep\nbrilliant color that reminded one of the hair of the lovely maiden.\n\nPinocchio's heart beat fast, and then faster and faster. He redoubled\nhis efforts and swam as hard as he could toward the white rock. He was\nalmost halfway over, when suddenly a horrible sea monster stuck its head\nout of the water, an enormous head with a huge mouth, wide open, showing\nthree rows of gleaming teeth, the mere sight of which would have filled\nyou with fear.\n\nDo you know what it was?\n\nThat sea monster was no other than the enormous Shark, which has often\nbeen mentioned in this story and which, on account of its cruelty, had\nbeen nicknamed \"The Attila of the Sea\" by both fish and fishermen.\n\nPoor Pinocchio! The sight of that monster frightened him almost to\ndeath! He tried to swim away from him, to change his path, to escape,\nbut that immense mouth kept coming nearer and nearer.\n\n\"Hasten, Pinocchio, I beg you!\" bleated the little Goat on the high\nrock.\n\nAnd Pinocchio swam desperately with his arms, his body, his legs, his\nfeet.\n\n\"Quick, Pinocchio, the monster is coming nearer!\"\n\nPinocchio swam faster and faster, and harder and harder.\n\n\"Faster, Pinocchio! The monster will get you! There he is! There he is!\nQuick, quick, or you are lost!\"\n\nPinocchio went through the water like a shot--swifter and swifter. He\ncame close to the rock. The Goat leaned over and gave him one of her\nhoofs to help him up out of the water.\n\nAlas! It was too late. The monster overtook him and the Marionette found\nhimself in between the rows of gleaming white teeth. Only for a moment,\nhowever, for the Shark took a deep breath and, as he breathed, he drank\nin the Marionette as easily as he would have sucked an egg. Then he\nswallowed him so fast that Pinocchio, falling down into the body of the\nfish, lay stunned for a half hour.\n\nWhen he recovered his senses the Marionette could not remember where he\nwas. Around him all was darkness, a darkness so deep and so black that\nfor a moment he thought he had put his head into an inkwell. He listened\nfor a few moments and heard nothing. Once in a while a cold wind blew\non his face. At first he could not understand where that wind was coming\nfrom, but after a while he understood that it came from the lungs of the\nmonster. I forgot to tell you that the Shark was suffering from asthma,\nso that whenever he breathed a storm seemed to blow.\n\nPinocchio at first tried to be brave, but as soon as he became convinced\nthat he was really and truly in the Shark's stomach, he burst into sobs\nand tears. \"Help! Help!\" he cried. \"Oh, poor me! Won't someone come to\nsave me?\"\n\n\"Who is there to help you, unhappy boy?\" said a rough voice, like a\nguitar out of tune.\n\n\"Who is talking?\" asked Pinocchio, frozen with terror.\n\n\"It is I, a poor Tunny swallowed by the Shark at the same time as you.\nAnd what kind of a fish are you?\"\n\n\"I have nothing to do with fishes. I am a Marionette.\"\n\n\"If you are not a fish, why did you let this monster swallow you?\"\n\n\"I didn't let him. He chased me and swallowed me without even a 'by your\nleave'! And now what are we to do here in the dark?\"\n\n\"Wait until the Shark has digested us both, I suppose.\"\n\n\"But I don't want to be digested,\" shouted Pinocchio, starting to sob.\n\n\"Neither do I,\" said the Tunny, \"but I am wise enough to think that if\none is born a fish, it is more dignified to die under the water than in\nthe frying pan.\"\n\n\"What nonsense!\" cried Pinocchio.\n\n\"Mine is an opinion,\" replied the Tunny, \"and opinions should be\nrespected.\"\n\n\"But I want to get out of this place. I want to escape.\"\n\n\"Go, if you can!\"\n\n\"Is this Shark that has swallowed us very long?\" asked the Marionette.\n\n\"His body, not counting the tail, is almost a mile long.\"\n\nWhile talking in the darkness, Pinocchio thought he saw a faint light in\nthe distance.\n\n\"What can that be?\" he said to the Tunny.\n\n\"Some other poor fish, waiting as patiently as we to be digested by the\nShark.\"\n\n\"I want to see him. He may be an old fish and may know some way of\nescape.\"\n\n\"I wish you all good luck, dear Marionette.\"\n\n\"Good-by, Tunny.\"\n\n\"Good-by, Marionette, and good luck.\"\n\n\"When shall I see you again?\"\n\n\"Who knows? It is better not to think about it.\"\n\n\n\nCHAPTER 35\n\nIn the Shark's body Pinocchio finds whom? Read this chapter, my\nchildren, and you will know.\n\n\nPinocchio, as soon as he had said good-by to his good friend, the Tunny,\ntottered away in the darkness and began to walk as well as he could\ntoward the faint light which glowed in the distance.\n\nAs he walked his feet splashed in a pool of greasy and slippery water,\nwhich had such a heavy smell of fish fried in oil that Pinocchio thought\nit was Lent.\n\nThe farther on he went, the brighter and clearer grew the tiny light. On\nand on he walked till finally he found--I give you a thousand guesses,\nmy dear children! He found a little table set for dinner and lighted by\na candle stuck in a glass bottle; and near the table sat a little old\nman, white as the snow, eating live fish. They wriggled so that, now and\nagain, one of them slipped out of the old man's mouth and escaped into\nthe darkness under the table.\n\nAt this sight, the poor Marionette was filled with such great and sudden\nhappiness that he almost dropped in a faint. He wanted to laugh, he\nwanted to cry, he wanted to say a thousand and one things, but all he\ncould do was to stand still, stuttering and stammering brokenly. At\nlast, with a great effort, he was able to let out a scream of joy and,\nopening wide his arms he threw them around the old man's neck.\n\n\"Oh, Father, dear Father! Have I found you at last? Now I shall never,\nnever leave you again!\"\n\n\"Are my eyes really telling me the truth?\" answered the old man, rubbing\nhis eyes. \"Are you really my own dear Pinocchio?\"\n\n\"Yes, yes, yes! It is I! Look at me! And you have forgiven me, haven't\nyou? Oh, my dear Father, how good you are! And to think that I--Oh, but\nif you only knew how many misfortunes have fallen on my head and how\nmany troubles I have had! Just think that on the day you sold your old\ncoat to buy me my A-B-C book so that I could go to school, I ran away to\nthe Marionette Theater and the proprietor caught me and wanted to burn\nme to cook his roast lamb! He was the one who gave me the five gold\npieces for you, but I met the Fox and the Cat, who took me to the Inn of\nthe Red Lobster. There they ate like wolves and I left the Inn alone\nand I met the Assassins in the wood. I ran and they ran after me, always\nafter me, till they hanged me to the branch of a giant oak tree. Then\nthe Fairy of the Azure Hair sent the coach to rescue me and the doctors,\nafter looking at me, said, 'If he is not dead, then he is surely alive,'\nand then I told a lie and my nose began to grow. It grew and it grew,\ntill I couldn't get it through the door of the room. And then I went\nwith the Fox and the Cat to the Field of Wonders to bury the gold\npieces. The Parrot laughed at me and, instead of two thousand gold\npieces, I found none. When the Judge heard I had been robbed, he sent\nme to jail to make the thieves happy; and when I came away I saw a fine\nbunch of grapes hanging on a vine. The trap caught me and the Farmer put\na collar on me and made me a watchdog. He found out I was innocent when\nI caught the Weasels and he let me go. The Serpent with the tail that\nsmoked started to laugh and a vein in his chest broke and so I went back\nto the Fairy's house. She was dead, and the Pigeon, seeing me crying,\nsaid to me, 'I have seen your father building a boat to look for you in\nAmerica,' and I said to him, 'Oh, if I only had wings!' and he said to\nme, 'Do you want to go to your father?' and I said, 'Perhaps, but how?'\nand he said, 'Get on my back. I'll take you there.' We flew all night\nlong, and next morning the fishermen were looking toward the sea,\ncrying, 'There is a poor little man drowning,' and I knew it was you,\nbecause my heart told me so and I waved to you from the shore--\"\n\n\"I knew you also,\" put in Geppetto, \"and I wanted to go to you; but how\ncould I? The sea was rough and the whitecaps overturned the boat. Then\na Terrible Shark came up out of the sea and, as soon as he saw me in the\nwater, swam quickly toward me, put out his tongue, and swallowed me as\neasily as if I had been a chocolate peppermint.\"\n\n\"And how long have you been shut away in here?\"\n\n\"From that day to this, two long weary years--two years, my Pinocchio,\nwhich have been like two centuries.\"\n\n\"And how have you lived? Where did you find the candle? And the matches\nwith which to light it--where did you get them?\"\n\n\"You must know that, in the storm which swamped my boat, a large ship\nalso suffered the same fate. The sailors were all saved, but the ship\nwent right to the bottom of the sea, and the same Terrible Shark that\nswallowed me, swallowed most of it.\"\n\n\"What! Swallowed a ship?\" asked Pinocchio in astonishment.\n\n\"At one gulp. The only thing he spat out was the main-mast, for it\nstuck in his teeth. To my own good luck, that ship was loaded with meat,\npreserved foods, crackers, bread, bottles of wine, raisins, cheese,\ncoffee, sugar, wax candles, and boxes of matches. With all these\nblessings, I have been able to live happily on for two whole years, but\nnow I am at the very last crumbs. Today there is nothing left in the\ncupboard, and this candle you see here is the last one I have.\"\n\n\"And then?\"\n\n\"And then, my dear, we'll find ourselves in darkness.\"\n\n\"Then, my dear Father,\" said Pinocchio, \"there is no time to lose. We\nmust try to escape.\"\n\n\"Escape! How?\"\n\n\"We can run out of the Shark's mouth and dive into the sea.\"\n\n\"You speak well, but I cannot swim, my dear Pinocchio.\"\n\n\"Why should that matter? You can climb on my shoulders and I, who am a\nfine swimmer, will carry you safely to the shore.\"\n\n\"Dreams, my boy!\" answered Geppetto, shaking his head and smiling sadly.\n\"Do you think it possible for a Marionette, a yard high, to have the\nstrength to carry me on his shoulders and swim?\"\n\n\"Try it and see! And in any case, if it is written that we must die, we\nshall at least die together.\"\n\nNot adding another word, Pinocchio took the candle in his hand and going\nahead to light the way, he said to his father:\n\n\"Follow me and have no fear.\"\n\nThey walked a long distance through the stomach and the whole body of\nthe Shark. When they reached the throat of the monster, they stopped for\na while to wait for the right moment in which to make their escape.\n\nI want you to know that the Shark, being very old and suffering from\nasthma and heart trouble, was obliged to sleep with his mouth open.\nBecause of this, Pinocchio was able to catch a glimpse of the sky filled\nwith stars, as he looked up through the open jaws of his new home.\n\n\"The time has come for us to escape,\" he whispered, turning to his\nfather. \"The Shark is fast asleep. The sea is calm and the night is\nas bright as day. Follow me closely, dear Father, and we shall soon be\nsaved.\"\n\nNo sooner said than done. They climbed up the throat of the monster till\nthey came to that immense open mouth. There they had to walk on tiptoes,\nfor if they tickled the Shark's long tongue he might awaken--and where\nwould they be then? The tongue was so wide and so long that it looked\nlike a country road. The two fugitives were just about to dive into the\nsea when the Shark sneezed very suddenly and, as he sneezed, he gave\nPinocchio and Geppetto such a jolt that they found themselves thrown\non their backs and dashed once more and very unceremoniously into the\nstomach of the monster.\n\nTo make matters worse, the candle went out and father and son were left\nin the dark.\n\n\"And now?\" asked Pinocchio with a serious face.\n\n\"Now we are lost.\"\n\n\"Why lost? Give me your hand, dear Father, and be careful not to slip!\"\n\n\"Where will you take me?\"\n\n\"We must try again. Come with me and don't be afraid.\"\n\nWith these words Pinocchio took his father by the hand and, always\nwalking on tiptoes, they climbed up the monster's throat for a second\ntime. They then crossed the whole tongue and jumped over three rows of\nteeth. But before they took the last great leap, the Marionette said to\nhis father:\n\n\"Climb on my back and hold on tightly to my neck. I'll take care of\neverything else.\"\n\nAs soon as Geppetto was comfortably seated on his shoulders, Pinocchio,\nvery sure of what he was doing, dived into the water and started to\nswim. The sea was like oil, the moon shone in all splendor, and the\nShark continued to sleep so soundly that not even a cannon shot would\nhave awakened him.\n\n\n\nCHAPTER 36\n\nPinocchio finally ceases to be a Marionette and becomes a boy\n\n\n\"My dear Father, we are saved!\" cried the Marionette. \"All we have to do\nnow is to get to the shore, and that is easy.\"\n\nWithout another word, he swam swiftly away in an effort to reach land as\nsoon as possible. All at once he noticed that Geppetto was shivering and\nshaking as if with a high fever.\n\nWas he shivering from fear or from cold? Who knows? Perhaps a little\nof both. But Pinocchio, thinking his father was frightened, tried to\ncomfort him by saying:\n\n\"Courage, Father! In a few moments we shall be safe on land.\"\n\n\"But where is that blessed shore?\" asked the little old man, more and\nmore worried as he tried to pierce the faraway shadows. \"Here I am\nsearching on all sides and I see nothing but sea and sky.\"\n\n\"I see the shore,\" said the Marionette. \"Remember, Father, that I am\nlike a cat. I see better at night than by day.\"\n\nPoor Pinocchio pretended to be peaceful and contented, but he was\nfar from that. He was beginning to feel discouraged, his strength was\nleaving him, and his breathing was becoming more and more labored. He\nfelt he could not go on much longer, and the shore was still far away.\n\nHe swam a few more strokes. Then he turned to Geppetto and cried out\nweakly:\n\n\"Help me, Father! Help, for I am dying!\"\n\nFather and son were really about to drown when they heard a voice like a\nguitar out of tune call from the sea:\n\n\"What is the trouble?\"\n\n\"It is I and my poor father.\"\n\n\"I know the voice. You are Pinocchio.\"\n\n\"Exactly. And you?\"\n\n\"I am the Tunny, your companion in the Shark's stomach.\"\n\n\"And how did you escape?\"\n\n\"I imitated your example. You are the one who showed me the way and\nafter you went, I followed.\"\n\n\"Tunny, you arrived at the right moment! I implore you, for the love you\nbear your children, the little Tunnies, to help us, or we are lost!\"\n\n\"With great pleasure indeed. Hang onto my tail, both of you, and let me\nlead you. In a twinkling you will be safe on land.\"\n\nGeppetto and Pinocchio, as you can easily imagine, did not refuse the\ninvitation; indeed, instead of hanging onto the tail, they thought it\nbetter to climb on the Tunny's back.\n\n\"Are we too heavy?\" asked Pinocchio.\n\n\"Heavy? Not in the least. You are as light as sea-shells,\" answered the\nTunny, who was as large as a two-year-old horse.\n\nAs soon as they reached the shore, Pinocchio was the first to jump to\nthe ground to help his old father. Then he turned to the fish and said\nto him:\n\n\"Dear friend, you have saved my father, and I have not enough words\nwith which to thank you! Allow me to embrace you as a sign of my eternal\ngratitude.\"\n\nThe Tunny stuck his nose out of the water and Pinocchio knelt on the\nsand and kissed him most affectionately on his cheek. At this warm\ngreeting, the poor Tunny, who was not used to such tenderness, wept\nlike a child. He felt so embarrassed and ashamed that he turned quickly,\nplunged into the sea, and disappeared.\n\nIn the meantime day had dawned.\n\nPinocchio offered his arm to Geppetto, who was so weak he could hardly\nstand, and said to him:\n\n\"Lean on my arm, dear Father, and let us go. We will walk very, very\nslowly, and if we feel tired we can rest by the wayside.\"\n\n\"And where are we going?\" asked Geppetto.\n\n\"To look for a house or a hut, where they will be kind enough to give us\na bite of bread and a bit of straw to sleep on.\"\n\nThey had not taken a hundred steps when they saw two rough-looking\nindividuals sitting on a stone begging for alms.\n\nIt was the Fox and the Cat, but one could hardly recognize them, they\nlooked so miserable. The Cat, after pretending to be blind for so many\nyears had really lost the sight of both eyes. And the Fox, old, thin,\nand almost hairless, had even lost his tail. That sly thief had fallen\ninto deepest poverty, and one day he had been forced to sell his\nbeautiful tail for a bite to eat.\n\n\"Oh, Pinocchio,\" he cried in a tearful voice. \"Give us some alms, we beg\nof you! We are old, tired, and sick.\"\n\n\"Sick!\" repeated the Cat.\n\n\"Addio, false friends!\" answered the Marionette. \"You cheated me once,\nbut you will never catch me again.\"\n\n\"Believe us! Today we are truly poor and starving.\"\n\n\"Starving!\" repeated the Cat.\n\n\"If you are poor; you deserve it! Remember the old proverb which says:\n'Stolen money never bears fruit.' Addio, false friends.\"\n\n\"Have mercy on us!\"\n\n\"On us.\"\n\n\"Addio, false friends. Remember the old proverb which says: 'Bad wheat\nalways makes poor bread!'\"\n\n\"Do not abandon us.\"\n\n\"Abandon us,\" repeated the Cat.\n\n\"Addio, false friends. Remember the old proverb: 'Whoever steals his\nneighbor's shirt, usually dies without his own.'\"\n\nWaving good-by to them, Pinocchio and Geppetto calmly went on their way.\nAfter a few more steps, they saw, at the end of a long road near a clump\nof trees, a tiny cottage built of straw.\n\n\"Someone must live in that little hut,\" said Pinocchio. \"Let us see for\nourselves.\"\n\nThey went and knocked at the door.\n\n\"Who is it?\" said a little voice from within.\n\n\"A poor father and a poorer son, without food and with no roof to cover\nthem,\" answered the Marionette.\n\n\"Turn the key and the door will open,\" said the same little voice.\n\nPinocchio turned the key and the door opened. As soon as they went in,\nthey looked here and there and everywhere but saw no one.\n\n\"Oh--ho, where is the owner of the hut?\" cried Pinocchio, very much\nsurprised.\n\n\"Here I am, up here!\"\n\nFather and son looked up to the ceiling, and there on a beam sat the\nTalking Cricket.\n\n\"Oh, my dear Cricket,\" said Pinocchio, bowing politely.\n\n\"Oh, now you call me your dear Cricket, but do you remember when you\nthrew your hammer at me to kill me?\"\n\n\"You are right, dear Cricket. Throw a hammer at me now. I deserve it!\nBut spare my poor old father.\"\n\n\"I am going to spare both the father and the son. I have only wanted to\nremind you of the trick you long ago played upon me, to teach you that\nin this world of ours we must be kind and courteous to others, if we\nwant to find kindness and courtesy in our own days of trouble.\"\n\n\"You are right, little Cricket, you are more than right, and I shall\nremember the lesson you have taught me. But will you tell how you\nsucceeded in buying this pretty little cottage?\"\n\n\"This cottage was given to me yesterday by a little Goat with blue\nhair.\"\n\n\"And where did the Goat go?\" asked Pinocchio.\n\n\"I don't know.\"\n\n\"And when will she come back?\"\n\n\"She will never come back. Yesterday she went away bleating sadly, and\nit seemed to me she said: 'Poor Pinocchio, I shall never see him again.\n. .the Shark must have eaten him by this time.'\"\n\n\"Were those her real words? Then it was she--it was--my dear little\nFairy,\" cried out Pinocchio, sobbing bitterly. After he had cried a\nlong time, he wiped his eyes and then he made a bed of straw for old\nGeppetto. He laid him on it and said to the Talking Cricket:\n\n\"Tell me, little Cricket, where shall I find a glass of milk for my poor\nFather?\"\n\n\"Three fields away from here lives Farmer John. He has some cows. Go\nthere and he will give you what you want.\"\n\nPinocchio ran all the way to Farmer John's house. The Farmer said to\nhim:\n\n\"How much milk do you want?\"\n\n\"I want a full glass.\"\n\n\"A full glass costs a penny. First give me the penny.\"\n\n\"I have no penny,\" answered Pinocchio, sad and ashamed.\n\n\"Very bad, my Marionette,\" answered the Farmer, \"very bad. If you have\nno penny, I have no milk.\"\n\n\"Too bad,\" said Pinocchio and started to go.\n\n\"Wait a moment,\" said Farmer John. \"Perhaps we can come to terms. Do you\nknow how to draw water from a well?\"\n\n\"I can try.\"\n\n\"Then go to that well you see yonder and draw one hundred bucketfuls of\nwater.\"\n\n\"Very well.\"\n\n\"After you have finished, I shall give you a glass of warm sweet milk.\"\n\n\"I am satisfied.\"\n\nFarmer John took the Marionette to the well and showed him how to draw\nthe water. Pinocchio set to work as well as he knew how, but long before\nhe had pulled up the one hundred buckets, he was tired out and dripping\nwith perspiration. He had never worked so hard in his life.\n\n\"Until today,\" said the Farmer, \"my donkey has drawn the water for me,\nbut now that poor animal is dying.\"\n\n\"Will you take me to see him?\" said Pinocchio.\n\n\"Gladly.\"\n\nAs soon as Pinocchio went into the stable, he spied a little Donkey\nlying on a bed of straw in the corner of the stable. He was worn out\nfrom hunger and too much work. After looking at him a long time, he said\nto himself: \"I know that Donkey! I have seen him before.\"\n\nAnd bending low over him, he asked: \"Who are you?\"\n\nAt this question, the Donkey opened weary, dying eyes and answered in\nthe same tongue: \"I am Lamp-Wick.\"\n\nThen he closed his eyes and died.\n\n\"Oh, my poor Lamp-Wick,\" said Pinocchio in a faint voice, as he wiped\nhis eyes with some straw he had picked up from the ground.\n\n\"Do you feel so sorry for a little donkey that has cost you nothing?\"\nsaid the Farmer. \"What should I do--I, who have paid my good money for\nhim?\"\n\n\"But, you see, he was my friend.\"\n\n\"Your friend?\"\n\n\"A classmate of mine.\"\n\n\"What,\" shouted Farmer John, bursting out laughing. \"What! You had\ndonkeys in your school? How you must have studied!\"\n\nThe Marionette, ashamed and hurt by those words, did not answer, but\ntaking his glass of milk returned to his father.\n\nFrom that day on, for more than five months, Pinocchio got up every\nmorning just as dawn was breaking and went to the farm to draw water.\nAnd every day he was given a glass of warm milk for his poor old father,\nwho grew stronger and better day by day. But he was not satisfied with\nthis. He learned to make baskets of reeds and sold them. With the money\nhe received, he and his father were able to keep from starving.\n\nAmong other things, he built a rolling chair, strong and comfortable, to\ntake his old father out for an airing on bright, sunny days.\n\nIn the evening the Marionette studied by lamplight. With some of the\nmoney he had earned, he bought himself a secondhand volume that had\na few pages missing, and with that he learned to read in a very short\ntime. As far as writing was concerned, he used a long stick at one end\nof which he had whittled a long, fine point. Ink he had none, so he used\nthe juice of blackberries or cherries. Little by little his diligence\nwas rewarded. He succeeded, not only in his studies, but also in his\nwork, and a day came when he put enough money together to keep his old\nfather comfortable and happy. Besides this, he was able to save the\ngreat amount of fifty pennies. With it he wanted to buy himself a new\nsuit.\n\nOne day he said to his father:\n\n\"I am going to the market place to buy myself a coat, a cap, and a pair\nof shoes. When I come back I'll be so dressed up, you will think I am a\nrich man.\"\n\nHe ran out of the house and up the road to the village, laughing and\nsinging. Suddenly he heard his name called, and looking around to see\nwhence the voice came, he noticed a large snail crawling out of some\nbushes.\n\n\"Don't you recognize me?\" said the Snail.\n\n\"Yes and no.\"\n\n\"Do you remember the Snail that lived with the Fairy with Azure Hair? Do\nyou not remember how she opened the door for you one night and gave you\nsomething to eat?\"\n\n\"I remember everything,\" cried Pinocchio. \"Answer me quickly, pretty\nSnail, where have you left my Fairy? What is she doing? Has she forgiven\nme? Does she remember me? Does she still love me? Is she very far away\nfrom here? May I see her?\"\n\nAt all these questions, tumbling out one after another, the Snail\nanswered, calm as ever:\n\n\"My dear Pinocchio, the Fairy is lying ill in a hospital.\"\n\n\"In a hospital?\"\n\n\"Yes, indeed. She has been stricken with trouble and illness, and she\nhasn't a penny left with which to buy a bite of bread.\"\n\n\"Really? Oh, how sorry I am! My poor, dear little Fairy! If I had a\nmillion I should run to her with it! But I have only fifty pennies. Here\nthey are. I was just going to buy some clothes. Here, take them, little\nSnail, and give them to my good Fairy.\"\n\n\"What about the new clothes?\"\n\n\"What does that matter? I should like to sell these rags I have on to\nhelp her more. Go, and hurry. Come back here within a couple of days\nand I hope to have more money for you! Until today I have worked for my\nfather. Now I shall have to work for my mother also. Good-by, and I hope\nto see you soon.\"\n\nThe Snail, much against her usual habit, began to run like a lizard\nunder a summer sun.\n\nWhen Pinocchio returned home, his father asked him:\n\n\"And where is the new suit?\"\n\n\"I couldn't find one to fit me. I shall have to look again some other\nday.\"\n\nThat night, Pinocchio, instead of going to bed at ten o'clock waited\nuntil midnight, and instead of making eight baskets, he made sixteen.\n\nAfter that he went to bed and fell asleep. As he slept, he dreamed of\nhis Fairy, beautiful, smiling, and happy, who kissed him and said to\nhim, \"Bravo, Pinocchio! In reward for your kind heart, I forgive you for\nall your old mischief. Boys who love and take good care of their parents\nwhen they are old and sick, deserve praise even though they may not be\nheld up as models of obedience and good behavior. Keep on doing so well,\nand you will be happy.\"\n\nAt that very moment, Pinocchio awoke and opened wide his eyes.\n\nWhat was his surprise and his joy when, on looking himself over, he saw\nthat he was no longer a Marionette, but that he had become a real live\nboy! He looked all about him and instead of the usual walls of straw, he\nfound himself in a beautifully furnished little room, the prettiest he\nhad ever seen. In a twinkling, he jumped down from his bed to look on\nthe chair standing near. There, he found a new suit, a new hat, and a\npair of shoes.\n\nAs soon as he was dressed, he put his hands in his pockets and pulled\nout a little leather purse on which were written the following words:\n\n     The Fairy with Azure Hair returns\n     fifty pennies to her dear Pinocchio\n     with many thanks for his kind heart.\n\nThe Marionette opened the purse to find the money, and behold--there\nwere fifty gold coins!\n\nPinocchio ran to the mirror. He hardly recognized himself. The bright\nface of a tall boy looked at him with wide-awake blue eyes, dark brown\nhair and happy, smiling lips.\n\nSurrounded by so much splendor, the Marionette hardly knew what he was\ndoing. He rubbed his eyes two or three times, wondering if he were still\nasleep or awake and decided he must be awake.\n\n\"And where is Father?\" he cried suddenly. He ran into the next room, and\nthere stood Geppetto, grown years younger overnight, spick and span\nin his new clothes and gay as a lark in the morning. He was once more\nMastro Geppetto, the wood carver, hard at work on a lovely picture\nframe, decorating it with flowers and leaves, and heads of animals.\n\n\"Father, Father, what has happened? Tell me if you can,\" cried\nPinocchio, as he ran and jumped on his Father's neck.\n\n\"This sudden change in our house is all your doing, my dear Pinocchio,\"\nanswered Geppetto.\n\n\"What have I to do with it?\"\n\n\"Just this. When bad boys become good and kind, they have the power of\nmaking their homes gay and new with happiness.\"\n\n\"I wonder where the old Pinocchio of wood has hidden himself?\"\n\n\"There he is,\" answered Geppetto. And he pointed to a large Marionette\nleaning against a chair, head turned to one side, arms hanging limp, and\nlegs twisted under him.\n\nAfter a long, long look, Pinocchio said to himself with great content:\n\n\"How ridiculous I was as a Marionette! And how happy I am, now that I\nhave become a real boy!\"", "title": "The Adventures of Pinocchio"}