{"summary": "The introduction calls the poem \"the song of songs\", a superlative construction commonly used in the Scripture to show it as the greatest and most beautiful of all songs (as in Holy of Holies). It begins with the woman's expression of desire for her lover and her self-description to the \"daughters of Jerusalem\". She says she is \"black\" because she had to work in the vineyards and got burned by the sun. A dialogue between the lovers follows: the woman asks the man to meet; he replies with a lightly teasing tone. The two compete in offering flattering compliments (\"my beloved is to me as a cluster of henna blossoms in the vineyards of En Gedi\", \"an apple tree among the trees of the wood\", \"a lily among brambles\", while the bed they share is like a forest canopy). The section closes with the woman telling the daughters of Jerusalem not to stir up love such as hers until it is ready.\nThe woman recalls a visit from her lover in the springtime. She uses imagery from a shepherd's life, and she says of her lover that \"he pastures his flock among the lilies\".\nThe woman again addresses the daughters of Jerusalem, describing her fervent and ultimately successful search for her lover through the night-time streets of the city. When she finds him she takes him almost by force into the chamber in which her mother conceived her. She reveals that this a dream, seen on her \"bed at night\" and ends by again warning the daughters of Jerusalem \"not to stir up love until it is ready\".\nThe next section reports a royal wedding procession. Solomon is mentioned by name, and the daughters of Jerusalem are invited to come out and see the spectacle.\nThe man describes his beloved: Her hair is like a flock of goats, her teeth like shorn ewes, and so on from face to breasts. Place-names feature heavily: her neck is like the Tower of David, her smell like the scent of Lebanon. He hastens to summon his beloved, saying that he is ravished by even a single glance. The section becomes a \"garden poem\", in which he describes her as a \"locked garden\" (usually taken to mean that she is chaste). The woman invites the man to enter the garden and taste the fruits. The man accepts the invitation, and a third party tells them to eat, drink, \"and be drunk with love\".\nThe woman tells the daughters of Jerusalem of another dream. She was in her chamber when her lover knocked. She was slow to open, and when she did, he was gone. She searched through the streets again, but this time she failed to find him and the watchmen, who had helped her before, now beat her. She asks the daughters of Jerusalem to help her find him, and describes his physical good looks. Eventually, she admits her lover is in his garden, safe from harm, and committed to her as she is to him.\nThe man describes his beloved; the woman describes a rendezvous they have shared. (The last part is unclear and possibly corrupted.)\nThe people praise the beauty of the woman. The images are the same as those used elsewhere in the poem, but with an unusually dense use of place-names, e.g., pools of Hebron, gate of Bath-rabbim, tower of Damascus, etc. The man states his intention to enjoy the fruits of the woman's garden. The woman invites him to a tryst in the fields. She once more warns the daughters of Jerusalem against waking love until it is ready.\nThe woman compares love to death and sheol: love is as relentless and jealous as these two, and cannot be quenched by any force. She summons her lover, using the language used before: he should come \"like a gazelle or a young stag upon the mountain of spices\".\n\n", "full_text": "Online Distributed Proofreading Team at http://www.pgdp.net\n(This file was produced from images generously made\navailable by The Internet Archive)\n\n\n\n\n\n\n------------------------------------------------------------------------\n\n[Illustration: Cover; By courtesy of The New York Sunday American; FIRST\nEDITION]\n\n------------------------------------------------------------------------\n\n                          King Solomon’s Goat\n\n\n\n                                  _By_\n                            WILLARD BARTLETT\n\n                              _Author of_\n\n             “The Origin of Priestcraft,” “The Tenderfoot,”\n                    “The War of the Stomachs,” etc.\n\n\n\n                 _Apologies are due to numerous authors\n                 who have failed to receive due credit\n               through the carelessness of the compiler._\n\n\n\n\n                             EVERETT PRINT\n                             13 Otis Street\n                                 BOSTON\n\n------------------------------------------------------------------------\n\n\n\n\n                             Copyright 1918\n\n                                   BY\n\n                          G. WILLARD BARTLETT\n\n------------------------------------------------------------------------\n\n\n\n\n                               CHAPTER I.\n\n                           The Divine Moloch.\n\n\nThe genial gentleman with horns, shown on the cover hereof, is\nchrist.[1] The hybrid Christian-Egyptian religion was stolen from the\nsun-worship of Egypt and India and other religious impositions. When the\nsun, called Ra and Osiris in Egypt, identical with Jehovah, at the end\nof each cycle of about 2155 years, entered a new sign of the zodiac, it\nwas said to be reborn, or the son of god came in a character to\ncorrespond with the astronomical sign.—Gerald Massey.\n\n-----\n\nFootnote 1:\n\n  Where in this book the words God, Lord, Christ, Messiah and Lamb are\n  capitalized they refer to Christian deities, otherwise to pagan gods.\n\nWhen the sun entered the sign of Taurus, the bull, god was reborn, or\nchrist came as the bull, called Apis in Egypt and Moloch in Syria. It is\nthe latter beauty whose entrancing charms are the subject of this\npanegyric. When Jacob wrestled with the lord, the bout was with Moloch\nIho, as will be seen by reading the original Hebrew text. This is lord I\nO, the supreme, the hermaphrodite god or idol of the pagans. Read the\nBlessing that the Hebrews say before eating: “Blessed art thou Io\nElohanu Melech ... who bringeth forth bread from the earth.”—Krinsky’s\nFirst Lessons in Hebrew, 84.\n\nThe pagans claimed that their god Moloch “had his castle of fire in the\nseventh heaven.” And “Jehovah had his castle of fire over the seventh\nheaven.”—Book of Enoch, 14:7. The identity of Moloch and the Hindu god\nSiva is indicated by the bull Nardi, the sacred emblem of the latter.\nThe Persian bull christ, the son of Ormazd, killed by Ahriman, the Lord\nof Darkness, and all the other christs that sport horns must share the\ninfamy of the great god Moloch, alias Saturn, alias Israel, alias Ilda\nBaoth or Devil. The heaven of Moloch is in the Northeast, and it is\npaved with gold, and his throne is made of lapis lazuli.\n\nYou will notice that the priest is offering up a child to the great god\nwho so loved human flesh and blood that he caused his own son to be\nslaughtered. There was also another reason for the human sacrifices by\nthe priests and sorcerers and secret societies, that is, the desire to\nevoke the dead and summon up phantoms for consultation. These ghosts are\nvery fond of blood, in fact it is difficult for them to materialize\nunless they can absorb the steam arising from human blood. It is true\nthat some sorcerers have evoked the dead with the blood of kids or\nlambs, but the goat and lamb christs are ancient redeemers, whose\nefficacy is not to be compared with the man christ. Elephas Levi says\nthat a phantom will attract the vapor of blood and human corpuscles in\nthe air as a magnet attracts iron filings.\n\n“They have built the high places of Tophet in the Valley of Hinnom to\nburn their sons and daughters in the fire.” They made their children\npass through the fire to Moloch, forsooth, because young children, like\nyoung pigs, are tender and easy to chew. They cooked their own flesh and\nblood on the reeking altar of the Devil, even as the great and good Ahaz\nserved up his son for the delectation of the mob, and sitting down to\nthe delicious feast, ate up the heir and hope of Israel. Then, chopping\nup the remnants into sausages, he exposed and hawked them in the market\nplace, crying: “It is true they come high, but see what they are made\nof. Each sausage is stamped with the Tetragrammaton and stuffed with the\nroyal house of Israel. If you plebeians, decorated with dirt and adorned\nwith bugs, wish to get some blue blood into your clotted veins, now is\nthe time. Avail yourselves of this opportunity to eat a prince of the\nroyal blood, an imperial descendant of our Mother in Israel, Tamar, the\ndaughter and wife of Judah and ancestor of David and the messiah.”\n\nThe fact that the Jews worshipped on Saturn-day would indicate that they\nwere worshippers of Saturn or Moloch. The sacrifice of the first-born\nunto the Lord was required by the Old Testament. Human sacrifices by\nproxy still survive in parts of England, where at Christmas time the\ngoodman goes forth to hunt for an old wife to sacrifice, and returns\nwith an old log, which he plays is his wife, and puts her on the fire.\nThis takes the place of the human being his ancestors formerly offered\nup. In Hertfordshire, an ox, representing Moloch, is killed every\nChristmas, and the church bell tolls at its death in imitation of the\ncrucifixion of the bull christ or sun at the winter solstice. At the\norgies of Orpheus they originally sacrificed a man and tore his flesh\nfrom his body with their teeth and ate it raw, but in later times\nsubstituted a bull representing Orpheus or Christ.—“Orgies” and\n“Orpheus”, Ency. Brit. All religion originated in human sacrifices and\ncannibalism.\n\nThe wife of god is a cow, called Hathor in Egypt, also named Isis and\nMeri, which goddess we have stolen and worship under the name of Mary.\nWhen the sun entered the stable or sign of Taurus, a christ was\nproduced, or god was reborn as a bull. That is why Christ was born in a\nstable.\n\nWhen the sun entered the sign of Aries or the Ram, God was reborn, or\nChrist came as the Lamb of God, the son of the Ram, identical with Rama,\nthe seventh incarnation of the god Vishnu.—Gerald Massey. In Thebes the\nprincipal object worshipped by the pagan ancestors of Christianity was\nthe Ram.\n\nAt the eighth incarnation of God, when the sun entered the sign of\nFishes, about the beginning of the Christian Era, God was reborn as the\nGreat Fish or Fisher of Men, and was slain on Friday for the redemption\nof the world. That is why the Christians killed and ate their fish Jesus\nevery Friday to save their craven souls from Hell. That is why the\npriests of Dagon, the fish god of the Philistines, wore fish skins on\ntheir backs and the head of a fish for a miter. The miter of the church\ndignitaries was the gaping mouth of their fish god. That is why Christ\nhad such phenomenal piscatorial luck and why his disciples were\nfishermen. That is why he came up out of the waters of Jordan.—See\nAncient Pagan & Modern Christian Symbolism.\n\nWe are baptized that we may typically become fish or Christlike, but\ncomplete immersion is indispensable to save our wicked souls. A few\ndrops of water on the forehead do not make a fish. Jesus came out of the\nstellar pool in the sign of Fishes, and we have seen superstitious and\nbenighted fishes, who have been born again, come up out of the pool\nbeneath the church altar in the Hub of Universal Culture. The basin at\nthe church door or piscina, containing alleged holy water, is but a type\nof that celestial pool in which the stellar fishes swim, and into which\nthe sun plunged and washed away the sins of the world. The Egyptian\nMadonna, Isis, is represented as holding in her arms the christ Horus,\nand on her head is a fish. The Hindus worship the fish-god at the temple\nof the Golden Dagon near Rangoon, India.\n\nThe Jews sacrificed the fish-christ at each of the three meals of the\nSabbath. “One should eat fish for into them the souls of the righteous\nare transmigrated.”—Talmud. The Buddhist cross, from which the Christian\ncross was taken, is called Swastika (fishes) and consists of the two\nfishes of the zodiac crossed. “Maya or Mary, the Virgin of the skies, at\nthe moment of the birth of her son Buddha on Dec. 25, was just rising\nabove the horizon.”\n\n“The sun’s present position is in Aquarius. Our Lord’s advent was in the\nprevious sign of Pisces, but the sign which he declared should precede\nhis next coming was that of Aquarius. ‘When ye see a man bearing a\npitcher of water follow ye him.’”—Daughter of the Druids, 101.\n\nWhen the sun entered the sign of Cancer, the sun god, or the son of god\ncame as the Crab or the Good Scarabaeus, the lucky bug of Egypt, and was\nborn in the nebula of the Manger in the sign of Cancer. Still there is\nno law against believing in the story of the Jew Christ born in the\nManger of Bethlehem. Even the Church Fathers claimed that Christ was the\nGood Scarabaeus.\n\nIn the Catacombs of Rome is a picture of a supper at which seven persons\nsit down to eat seven loaves and two small fishes. Some writers have\nfailed to grasp the significance of this picture. They are assembled\nthere to eat their Christ, as we do now at every Communion Service.\nChrist is the bread of life, born in the astronomical house of\nBreadcorn. He came seven times in the ancient division of the heavens,\nand in his eighth avatar he came as the two fishes in the sign of\nPisces.\n\nOur Christmas is a new name for the old Roman Saturnalia, a festival\ncelebrating the birth of the sun-god Saturn or Moloch at the winter\nsolstice, at which time they feasted, exchanged presents, got drunk and\nplayed craps. The Christians, in celebrating the 25th of December, admit\nthat their Christ is a sun-god.—See “Saturn,” Ency. Brit.\n\n\n\n\n                              CHAPTER II.\n\n                          The Queen of Heaven.\n\n\nThe Hebrews in the wilderness indulged in this pagan idolatry and\nsacrificed bullocks and lambs on the altar for the remission of their\nsins, and erected a golden calf. The golden calf was christ, and his\nmother was the sacred cow Hathor or Mary. This Meri or Mary was an\nastral goddess, the moon goddess, the Queen of Heaven, represented as\nstanding in the crescent moon. She is identical with the foul goddesses\nAstarte, Venus, Ishtar, Asherah and Ashtoreth, the abomination of the\nSidonians. Ishtar is the same as Easter, and we celebrate Easter because\nthe sun-god arose at the full moon of Easter. The Sacred Cow of India is\nworshipped as the Mother of the Gods.—Book of all Religions, 224.\n\nYou will see in the idol stores the graven image of Mary, the Queen of\nHeaven, standing in the crescent moon, and a dog crouching before her\noffering her a cake with a hole in it. This cake is the Mark of the\nBeast, the female symbol of the cow Hathor, the Assyrian Grove, the\nsacred Eye, which was worn by the Christian and pagan priests in their\nforeheads and on their hands. It is the Sacti of the goddess Maha Deva,\ncalled Sacti because it is sacred and is offered up as a sacrifice,\nclosely related to sacrum and the caudal appendage.\n\nThe three links are the symbol of the hermaphrodite godhead. The link is\nthe female emblem and three is the sign of the male. The Eye within the\ntent or triangle or compasses is an object of worship and adoration. The\nthree-cornered triangle is the emblem of the male. In Ency. Brit., 6:\n462, a bishop is represented with the Eye on his left hand, and he holds\nup three fingers of his right hand, the sign of the male. This is just\nas efficacious as the three links, as it presents to the audience the\nmale and female emblems together, formerly the only objects of worship\nin all religions. They are the emblems of life, and must be held up\ntogether to insure the worshippers eternal life. It will be seen in this\ninvestigation that in every religious assembly, from the Witches’\nSabbath to the Elevation of the Host, the male and female emblems were\ndisplayed together for the salvation of the world. Without these emblems\nthe devotees cannot be born again. The image of the Hindu Madonna and\nChristna shows the Virgin holding up three fingers, and with the thumb\nand forefinger she makes the circle of Ashtoreth to save the souls of\nher devotees.—Plate 14, A. P. & M. C. Symbolism.\n\nThe high altars of most of the churches were rank Assyrian Groves, to\nwhich the devotees bowed low in holy reverence. See “Altar”, Stand. Dic.\nand Ency. Brit. 16:75. The deity emerging from the female symbol of the\nhigh Christian altar of Pistoia holds in his hand a book on which is\nwritten: “I A O, the Sun, the Light of the World.” When we take off our\nhats to the church, we are not doing obeisance to the pile of brick and\nstone but to this symbol above the altar. The Dabistan says that Siva\nhas a spouse called Maya, as Jehovah had Mary, and the high altar in a\nmosque of the Mussulmans is an emblem of the Bhaga or the Grove or Royal\nArch. The ancient Knights of the Royal Bhaga were also Knights of the\nCave, the Gate, the Fornix (tent of a Kadish) to the defense of which\nthey pledged their lives, their property and their sacred honors, and\neach brave knight wore emblazoned on his forehead or on his stomach the\nemblem of his goddess, the open Eye.\n\nVenus, called C U in Celtic, was the moon goddess of the round towers of\nIreland. The priests of the goddess called themselves C U R, and a cur\noffers a sacrifice to the Virgin. From C U R we derive the word\ncurate.—Stinson Jarvis. The Druid priests always wore the crescent moon\non their robes. Osiris is identical with the Egyptian god Anubis, the\ndog, and their symbol is the open Eye. They both worship at the shrine\nof Hathor or the Virgin holding the sacred Eye in their hands. That is\nwhy in Christianity, we see the dog offering to Mary the sacred\nperforated wafer.\n\nRefer to “Enthronization,” Stand. Dic., and you will see the Mark of the\nBeast on the bishop’s hand, and look at the pagan god Siva, and you will\nfind the same mark on his forehead. See “Freemason,” and you find that\nWashington wears the same symbol on his stomach. Look at Brahma, who\ncarries the rosary in his hand, a symbol of identical significance.\nRefer to “Glory,” and you see Christ standing in the Mark of the Beast.\nTurn to Vesica Piscis, where the Virgin stands in her symbol, the symbol\nof the hideous faith of the Witches’ Sabbath, a faith coeval with the\ndawn of time, spawned in the slums of chaos. Astarte or Ashtoreth was\nthe moon goddess and Queen of Heaven and patron of immorality.—Ency.\nBrit. 2:735. Mary is the same as Venus and Diana, the moon\ngoddess.—Elephas Levi, the priest.\n\nThe Hindu Litany of Our Lady Nari, the Virgin, says: “Holy Nari.\nMariama, Mother of an Incarnate God, Mother of Christna, Virgin Most\nChaste, Queen of Heaven.” The Egyptian Litany of Our Lady Isis says:\n“Holy Isis, Mother of Gods, Mother of Horus, Virgin Sacred Earth, Isis,\nQueen of Heaven.” The Christian Litany says: “Holy Mary, Mother of God,\nMother of Christ, Virgin Most Chaste, Queen of Heaven.”—Isis Unveiled,\n209.\n\nWhy does St. Peter (Petra, the Rock God) as shown by his statue in Rome,\nhold up three fingers and make the circle or Eye with the other two\nfingers? Why is the Christian Benedictional, like the Totem Pole of the\nIndians, covered with the so-called All-Seeing Eye? Why is the Eye on\nthe stomach of the Bishop, where he does not need it? This is a very\noccult matter that can be disclosed only to the initiates of the foul\nreligions.—See Book of All Religions, 467.\n\n“Religion is a monstrous fraud and delusion that has desolated the earth\nand filled the spirit world with demons.”—Antiquity Unveiled, 58.\n\nThe Gnostics claimed that it was Ilda Baoth, the Devil, that\novershadowed Mary, instead of Gabriel. “The female Serpent of the Sky,\nthe Mother, is imaged in Buddhism by the lotus, the water, the female\nfish. Her mansion is in Virgo. By Manu she is called the Spirit of God\n(the Holy Ghost) but she represents matter as well as spirit.”—Buddha &\nEarly Buddhism, 20. Mare and Mary mean the sea, and the fish god Jesus,\nof course, came out of the sea.\n\n“The bells used by the Christians came to them directly from the\nBuddhists, Thibetans and Chinese, who used them to attract the gods. The\nbeads and rosary have the same origin, and have been used by Buddhist\nmonks for over 2300 years.”—Isis Unveiled, 95. The Jews used bells to\nwarn their god that some dupe was about to adore him, so that he would\nhave a chance to change his character and not appear as the ass-headed\ngod.—Epiphanius, Gospel of Mary. In China and India they ring the church\nbell to call god and the other ghosts to dinner, and after the spirits\nhave eaten, the remnants of the sacrifices are thrown by the priests to\nthe dogs of worshippers, the scum of the earth, who furnished the\nofferings. The church bell in Japan is called “Call God,” and we, having\ncopied our religion from the Buddhist, ring our church bells to call God\nto listen to our fool prayers, and every Sunday he walks a leg off\nhustling around to the millions of places of superstition.\n\nA statue of the cow Hathor, with the moon between her horns, was\nunearthed in a temple of Egypt. This is the mother of Horus, also called\nIes and Iesu and Jesu in Egypt. And to further fix her catholicity\nbeyond question she is covered with Christian crosses. If you refer to\n“Isis,” Stand. Dic., you will see that the Egyptian Madonna wears horns\nand the full moon on her head. The moon goddess of Peru was called Mamma\nQuilka, or Mother Moon, the mother of all the Incas, and the real pious\ndevotees got soused on corn whiskey in her holy worship.\n\nThe Christians sacrificed cakes with holes in them to Mary, Queen of\nHeaven.—Ency. Brit. 15:391. This is the very idolatry for which Jehovah\ndrove the Jewish nation out of Palestine. In Jeremiah, 44:19, the Jews\nsay: “We burned incense to the Queen of Heaven and poured out drink\nofferings unto her and made cakes to worship her.” And Jeremiah says in\nverse 22: “Because of these abominations which you have committed,\ntherefore is your land a desolation and a curse, without an inhabitant\nas at this day.”\n\nThe Buddhists say: “Upon a lotus of precious stones sustaining a moon\ncrescent sits Buddha Matra” (the Mother of God). The Chinese invocation\nsays: “Hail Matra”, and they call her “Our Lady, the Queen of Heaven,\nthe Mother of Buddha.”—Buddha & Early Buddhism, 22. The fact that the\nQueen of Heaven existed as a goddess in the time of Jeremiah, before\nChristianity was spawned, shows that the Buddhists did not steal their\nQueen of Heaven from the Christians as charged.\n\nIn Josephus, Book 8, ch. 11, it is seen that Shishac subdued Israel and\nerected some charming pillars on which were carved captivating female\nsymbols, which they worshipped. Jereboam erected two aesthetic heifers,\nimages of Hathor for the worship and spiritual edification of the Jews.\nIn Judges, 3:7, it is asserted that Israel served Baalim and the Grove.\nBaalim are images of Baal, male emblems, corresponding to the candles\nand manikins (sons of man) of the Witches’ Sabbath, called images of men\nin Ezek. 16:17. I think that the christ of the Hebrews was the candle,\nand that they sacrificed him every Friday, the same as the Christians do\ntheir fish god. The candle is the appropriate offering to a goddess, and\nit may have been Ashtoreth.\n\nThe Mezuzah, which is nailed on the door post, corresponds with the\npillars erected by Shishac, for it is a miniature pillar with an oval\nhole on the side, which hole it is necessary to kiss, as we kiss the\nmale and female emblems on the Pax to secure eternal life. In the hole\nis one of the names of god, Shaday, one of the female Sephiroth or\npersons of the godhead. If you refer to “Altar,” Stand. Dic., you will\nsee the people worshipping the hole in the Mezuzah, or the Virgin\nstanding in her symbol above the altar, which is all the same.\n\nThe phylactery, worn on the forehead and on the left arm, contains\npassages of Scripture, which must be printed on the skin of the cow, the\nmother of christ, and the phylactery itself, must be made of the skin of\nchrist, the calf. God himself wore phylacteries according to the Talmud.\n\nDianus, or the sun, or god, had twelve wives, capturing a new one\nwhenever he entered a new sign of the zodiac. It was Rhea in the sign of\nthe Twins, and Hathor in the sign of Taurus, and Mary in the sign of\nPisces. One of his wives was Diana of the Ephesians, the object of a\nfoul worship in Asia Minor. She wears upon her head the crescent moon,\nand she is Mary, the Queen of Heaven. She bears six lions in her arms,\nbecause she is the mother of all the gods. Six christs have been born\nsince she ruled the heavens in the sign of Virgo. The christ who came in\nthe sign immediately following Virgo was Leo. It is one and the same\ngod, the sun, that comes in every sign, consequently they are all lions.\n\n\n\n\n                              CHAPTER III.\n\n                          Religious Symbolism.\n\n\nThis is the Egyptian Tau Cross, the symbol of Apis, the bull, and other\nmale gods: [𝝩]. Here is the male emblem shown as the Masonic square, as\nfound in the ruins of Gaza: [𝝘]. This is the Egyptian K. Ka is the\nEgyptian name of the male emblem. See “Hieroglyphics”, Ency. Brit. This\nholy god, in the form of a stone, is stuck in the wall of the Kaaba, the\nshrine at Mecca, which shrine was built by Abraham, who was fond of\nchasing after gods with tarnished reputations. This god in Mecca is a\nmeteorite seven inches long, brought down from Heaven by Gabriel, and\nabout 300,000 pilgrims annually kiss this foul, germ-laden god to save\ntheir tarnal souls.\n\nAnd this is the cross ansata of Egypt, [♀], or cross of anx (life), a\ncombination of the cross of the bull and the sacred symbol of Isis. The\nHigh Priest of Egypt wore three cross ansatas and three links on his\nbreast-plate, symbols of the trinity. Many of the pagan religions, from\nwhich ours descended, used only the main portion of the cross, the shaft\nor upright, the symbol of Siva, Baal Poer and Jehovah. It is called\nphalatz in Hebrew, meaning broken. See the broken column of the\nMasons—A. P. & M. C. Symbolism.\n\nYou place the three balls of the pawnbroker or the shamrock of Ireland\non top of the shaft, and you have the most archaic form of the cross,\nbefore which the devils tremble and fall in a fit. Christian crosses,\nwreaths, bells, squares, eyes, Asherim and Baalim have been discovered\nin the ruins of Gaza, in the fourth city that was destroyed about 1600\nB. C. The original text of Ezek. 9:4 shows that the sign of Jehovah was\nthe Signa Tau, or the cross of Taurus, the bull, with which the elect\nwere sealed in their foreheads. In the Enchiridion, a prayer book and\nbook of magic credited to Pope Leo III, he says: “By this sign [＋] Lord\nTau, deliver me.”\n\nThe male emblem, or triangle, placed in the circle of Asherah makes the\nThree in One, the profound and esoteric mystery forever hidden from the\nprofane and vulgar. That is the sacred quartet, those are the idols we\nworship.\n\nTurn to Siva, Stand. Dic., and you will see that he has stolen all the\npious Christian symbols, although he existed for ages before the\nChristians. In one hand is the circle and in another hand a trident or\nfleur de lys, a male emblem. Around his neck is a large rosary or stole.\nThrusting his male head through this female emblem is a symbol of life\nand a saving rite. Putting his hand through a rosary is just as\neffective. We can trace the spotless lineage of our beloved religion\nback through the dim vistas of time to a very archaic and rotten\nancestry.\n\nIn both the Christian and pagan symbolism the oval in which the saints\nand gods do stand is often represented as composed of roses and\nconstitutes a rosary. The horseshoe brings good luck because it is\nidentical with the cave, the arch and the grove and is the sacred emblem\nof the goddess Mary or Astarte. Both Buddha and Christ are represented\nas standing in the horseshoe or Royal Arch. I conclude that the Masonic\nHoly Royal Arch and the oval above the church altar, in which the Virgin\nstands, represent the Grove that Manasseh set up in the House of the\nLord, 2 Kings, 21, and that Josiah burnt at the brook Kidron, 2 Kings,\n23:6. The stole, worn by the priests, is equivalent to, and has all the\nmystic powers of, the cross ansata. It is well named “stole”, as the\nearly Christians stole it from the pagan worship.\n\nSerapis, the Egyptian god, is bedecked and bedizened with all the\nChristian emblems. He holds the crook of the Good Shepherd in one hand\nand the cross ansata in the other. He has the head and horns of a bull,\nshowing that he is the son of the cow Hathor or Mary. And over his head\nare the Masons’ marks, the square and the eye, showing that he is in\ngood standing in his lodge in Hell, for he, like christ, is Lord of the\nUnderworld.\n\nRefer to Vishnu, Stand. Dic., and you will see that pagan god wearing\nall the above emblems. He is christ and came as Rama in the sign of the\nRam and as Krishna in the sign of Pisces. Turn to Krishna, and you will\nsee the Hindu Madonna and christ that we kidnapped.\n\nIn the Sun. Am. Magazine, Aug. 29, 1910, we see a picture of Isis\nmourning at the bier of Osiris. At Egyptian funerals they assured the\ndead of eternal life by raising the symbol of Isis, the circle or rosary\nabove the body. You will see that the head of the deceased at the wake\nis surrounded by male emblems, which gross symbols are now replaced in\nthe present civilization by candles. You will see that Isis is bowing\ndown before the Tree of Life, and that she has at hand a basket of\nperforated cakes, which she is about to offer to the Tree of Life, which\ntree is called Osiris or Baal or Moloch or Buddha or Yahveh or Iao or\nSiva or Jove according to the country in which the religion is\nperpetrated. If you place a wreath on a dead man’s stomach and seven\ncandles around his head, he is no longer a meet candidate for Hell, but\nan heir of eternal glory. If you stick a cross through the wreath, it is\na through ticket to the seventh heaven, and you may be assured that he\nwill go through purgatory a-humping.\n\n\n\n\n                              CHAPTER IV.\n\n                The Sabbatic Goat or God of the Sabbath.\n\n\nWhen the sun entered the sign of Capricorn, it was reborn as, or christ\ncame as the goat, that individual on whom the Jews used to load all\ntheir sins and then drive him forth into the wilderness. They sacrificed\ngoats on the altar because the goat was one of the ancient redeemers.\nCaesar says of Egyptian sacrifices: “Imprecations were uttered over the\nhead of the expiatory victim, around whose horns a piece of byblus was\nrolled. The animal was generally led to some barren region sacred to\nTyphon. It is in this custom that lies the origin of the scapegoat of\nthe Jews, who, when the ass-headed god was rejected by the Egyptians,\nbegan sacrificing to another deity, the red heifer.”\n\nIt was claimed by Madam Blavatsky and Elephas Levi that the\nhermaphrodite Goat of Mendes, or Baphomet, was anciently an object of\nworship and adoration by the mystic societies and at the Witches’\nSabbath. In Mysteries of Magic, 7 and 75, the author thus describes a\nWitches’ Sabbath: “Approach stealthily this cross roads among the rocks.\nA hoarse and funeral trumpet is heard, lurid torches burn on every side,\na disorderly assembly surges around an empty seat. All look around in\nexpectation, then suddenly fall prostrate and mutter: ‘He is here, ’tis\nhimself.’ A goat-headed prince comes forward with bounds, he ascends the\nthrone, turns around and stooping presents his back to the audience,\nwhich everyone approaches, black taper in hand, to salute and to kiss.\nThen he stands up with a discordant laugh and distributes to his\nfavorites gold, secret instructions, occult medicines and poisons.”\n\nThe Goat of Mendes is pictured by Elephas Levi as a regular god. He\nwears the male emblem on his head like all gods in good standing and\nholds up three fingers, and has the double triangle in his forehead, and\nthe caduceus, or male and female emblems, on his stomach. With one hand\nhe coagulates or creates, and with the other he dissolves or destroys.\n\n“Let us say boldly and loudly that all the inferior initiates of the\noccult sciences and the betrayers of the Great Arcanum have adored, do\nand will always adore that which is signified by the frightful figure of\nthe Sabbatic Goat. Yes in our profound conviction, the Grand Masters of\nthe ancient orders of the Templars adored Baphomet.”—Elephas Levi. It\nwill be seen by the chart that the Masonic coat of arms, consisting of\nthe four zodiacal beasts, is supported on either side by the goat god\nPan.\n\nPan, the Good Shepherd, the son of Deus, with the horns and feet of a\ngoat, is the same as the Devil or christ. At the Witches’ Sabbath in\nEngland, the women made manikins, or images of men, of clay or wax, and\nthese they worshipped and played with. And when these images were\nproperly magnetized, they could perform miracles therewith and summon up\ndemons from the abyss. If they possessed sufficient will power and knew\nthe occult and secret form of words to use, they could play that the\nmanikin was an enemy, and then stick him through the heart with a\nneedle, and the next morning the enemy would be dead. If their magical\npower was sufficiently potent, they could summon a satyr or subordinate\ngoat god to take the place of the manikin and consummate the Sabbatical\nmarriage ceremony. Their spells were said to be sufficiently powerful to\nreduce a human being to the primordial protoplasm, and then cause it to\nagain pursue the path of evolution through the cell, the blastoderm, the\ndevil-fish and all the other beasts constituting eternity’s great\nhighway by which the soul walks down. This is similar to the unavoidable\ncycle, the circle of necessity, the inexorable doom of the sacred\nmysteries of the Serpents’ Catacombs of Egypt.\n\nThe countersign of the Witches’ Sabbath was the closed hand with the\nthumb between the first and second fingers pointing downward to the\nabyss. The meeting place was lighted only by the altar fire, where the\nhuman sacrifice sizzled to attract the phantoms and ghosts. And the\ndevotees, singing mystic songs, danced hand in hand in a circle around\nthe god Pan. They used the holy grail like the churches and mystic\nsocieties, and the drafts from this poisonous cup, the singing, the\nwhirling dance and the incense from the altar brought on the oft-times\nfatal frenzies in which the victims fell shrieking to the ground, as\nthey do among certain Christian sects. They were seized and possessed by\nfoul fiends from the Pit, or elementary spirits, and sometimes by the\nspirits of serpents that materialized themselves in the writhing human\nvictims and crawled out of the prostrate bodies in plain view of the\naudience. There in the blackest hour of the night the Vinum Sabbati was\nprepared, a few grains of white powder thrown into a glass of water. And\neach one that drank found himself attended by a companion, a shape of\nglamour and unearthly allurement beckoning him apart to share in joys\nmore exquisite, more piercing than the thrill of any dream.—Machen’s\nHouse of Souls, 438.\n\nSimilar to these convulsionaries are the miserable creatures in Russia\nafflicted by strange disorders, which people attributed to possession by\nthe Devil. They throng the entrance of cathedrals without daring to\nenter, lest their controlling demons cast them on the ground. At the\nElevation of the Host, these half maniacs, half mediums begin crowing\nlike cocks, barking, bellowing and braying, and finally fall down in\nfearful convulsions. They prophesy and see visions. Paracelsus, the\nmagician, could cast the demons out of the persons so possessed by the\npower of a stronger demon which he carried around in his pocket. That\nreminds us of the Salem witch that fled from a mob of Christolators who\nwere intent on burning her, but when they were about to seize her, she\ncrawled into a bottle, and nobody ever saw her afterward.\n\nIn the Devil’s Mass of the Yezdis, or Devil worshippers and sorcerers of\nMesopotamia, the Jakshas or aerial spirits carry their prayers to the\nDevil and the Afrites of the desert. In their prayer meeting they dance\nin a ring about their high priest and whirl and leap in the air and cut\neach other with daggers until they are soaked with blood for the purpose\nof attracting the ghosts. The mystic circle induces Satan to manifest\nhimself in miracles. Enormous globes of fire appear and assume the\nshapes of monsters.\n\nThe Sabbath was the Sunday of the Hebrew Kabalists, the day of their\nreligious assembly, or rather the night of their habitual meetings. This\nfestival, surrounded by mysteries as it was, found its safeguard in the\nvery fright of the vulgar and escaped persecution through the terror it\noccasioned. The early Christians celebrated the pagan Mysteries of Jesus\nand probably held a Witches’ Sabbath.—See Mystic Christianity, 212.\n\nOne should trim his finger nails on Friday, never on Thursday, otherwise\nthe nails will commence growing on the Sabbath, and it is very wicked\nfor the nails to grow on the Sabbath.—Kabala. The Israelite, after the\nendless Sabbath observances, should fold up his veil, but if he forgets\nto do so, he is to shake it thoroughly the next morning, so as to shake\nall the devils out of it. And the reason is known to the Lords of the\nKabala.—Kabala Kitzur Sh’lh. It is a very pious act to say a prayer to\nthe moon at the close of the Sabbath, for the moon is a symbol of Jacob,\nthe lesser light, (who was a christ). The full moon, the Queen of Heaven\nis his mother, and the sun is his father. The new moon is Jacob or\nChrist.—Ibid, fol. 72, col. 2. You should learn these things together\nwith all the other profound wisdom of the Talmud, for Rabbi Yochannan\nsays that it is lawful to split open an unlearned man like a fish.\n\nConstantine, the Roman Emperor and canonized saint, the\nsuperstition-besotted, the assassin, the fratricide, the parricide, the\nuxoricide, the filicide, the regicide, chosen from Heaven as the\nmurderer-in-chief of the world, according to Eusebius, “held up by God\nto the human race as an exemplary pattern of godliness and destined to\nshare the Empire of Heaven with Christ,” this was the bloated, red-faced\nprofligate who established Sunday worship in 321 A. D. and compelled the\nChristians to worship the sun-god on Dies Solis, the Day of the Sun,\nbecause his own god was Apollo.—See First Council of Nice, 28.\nConstantine was the founder of Christianity, and, like father like son,\nit followed in his footsteps. He could not obtain absolution for his\ncrimes from pagan priests, but Eusebius washed them whiter than snow.\nSome said that Constantine had to sacrifice an infant to obtain the\nblood for the absolution.\n\n\n\n\n                               CHAPTER V.\n\n                          The Great God Baal.\n\n\nThe palm tree, the candle and the Asherim are symbols and images of\nBaal, and the two last are offered up as sacrifices, corresponding to\nthe pillars and candles in the worship of Jehovah. Around the temple of\nJehovah as well as the temple of Baal, in the Holy Land, were the\nancient nunneries. The Kadishim or Holy Ladies lived in tents arranged\nin a circle about the temple, and on each side of each tent or Fornix\nstood a Knight of Kadish. The pious people who desired to worship god\ngave up to the guard a shekel (sixty cents) and entered into the tent of\nthe Kadish, and the money so collected went to the service of god, which\nmeans the priestly white slavers and the Worshipful Knights of Kadish.\nThe Kadishim were the same as the Deva Dasi, the concubines and dancing\ngirls of the Hindu temples, the slaves of the gods. “There is reason to\nbelieve that the Israelites at an early date applied the name of Baal to\nJehovah. Baal was represented on the high places by pillars,” as the\nstrange god of John’s Revelation is pictured on his throne.—“Baal,”\nEncy. Brit. One hundred of the most beautiful and seductive daughters of\nthe people, innocent girls of tender age, were torn from their homes by\nthe ruthless priests to fill the holy places of god around each temple.\nThe priests by constant iteration convinced the parents that it was a\nhigh honor to be permitted to devote their daughters to god, and that as\na reward, in the great hereafter, they would sit beside the Great White\nThrone with Abraham, Isaac and Jacob and all the other Jews, and all the\nhod-carriers, who, having washed their robes white in the blood of the\nLamb, sit on their little golden thrones with their dudeens in their\nmouths and their hats gently tilted over one eye, while they decorate\nwith tobacco juice the dazzling surface of the crystal sea.\n\nAt the great temple of Baal, they had a palm tree standing in the midst\nof the garden, and in the holy temple of Jehovah they had a stone pillar\naround which the Kadishim, at the vernal equinox, danced in the nude.\nThis is the day dedicated to Astarte, or Ishtar or Easter. This occult\nceremony is one of the most beautiful and entrancing in our refulgent\nand god-given religion. As the Tree of Life stands in the midst of the\ncircle of females, so the rays from the sun penetrate the earth and\nannually renew its life. So the rays of the sun at high noon penetrated\nthe ark, that old box in which the priests kept the male and female\nemblems, and before which King David for occult reasons danced in the\naltogether. The ark corresponds with the sacred Argha of the Hindus, an\noblong vessel, a sacrificial chalice, used in the worship of Isis,\nAstarte and Venus. It is a most holy symbol, containing, in the play,\nthe germs of all living things, and when we drink out of it at the\ncommunion service, we drink eternal life. They planted the Tree of Life\nin the midst of the garden or grove, as God planted the tree in the\nmidst of the Garden of Eden. You will notice the serpent coiled about\nthe tree in Eden. This is the symbol of Life. The serpent is a symbol of\nthe female.\n\nThe Israelites were commanded not to worship idols, but in the darkest\nhour of their history, when their own God, Jehovah, had sent upon them\nthe plague of serpents and consigned them to destruction, then they\ncalled upon the mighty sun-god, they looked upon the brazen serpent on a\ncross, the Elevation of the Host, and the remnant of Israel was saved.\nIsrael, it is said, worshipped the serpent or Devil until about 726 B.\nC. You will see this same god on the Masonic chart.\n\nThe Talmud says that when Ben Asai and Ben Zoma were to be initiated\ninto the Garden of Delights, Ben Asai looked and lost his sight, and Ben\nZoma looked and lost his reason. Eusebius shows that St. James, the\nbrother of Jesus and first Bishop of Jerusalem, never shaved or took a\nbath, and he alone could enter into the holy places.\n\nThe merry maidens who circulate about the May-pole on May-day are\ndevoted devotees of the loving god Baal Poer. And we on Palm Sunday\ncarry palm leaves from the sacred palm tree to show that we are faithful\nworshippers of the true god Baal.\n\nIn Italy, the clergy had at one time, according to Isis Unveiled, 2-5, a\nthriving trade in those things which they called the holy limbs of\nSaints Cosmo and Damiano. These male emblems were made of wax and\ncertainly beautiful to behold. The divine spirit shining through them in\nresplendent glory cast its radiance afar. He who was so fortunate as to\npossess sufficient filthy lucre to purchase one saved his immortal soul\nfrom Hell, for was it not the symbol of life and the image of the great\ngod.\n\nFor the form of the pillar as worshipped in Syria, see page 121, A. P. &\nM. C. Symbolism, and on the mall of Boston Common may be seen the same\npillar as adored by us at the Hub of Universal Culture, erected there to\ncommemorate the birth of American liberty. Let us hope that you will get\nout early in the morning and see the blue-bellied Puritans and the\ncodfish aristocracy kneeling before this sacred shrine, with their hands\nthrust through their rosaries, praying that this great god may make them\nfruitful.\n\n“The superstition of Europe instead of being diminished by the\nintroduction of Christianity was only turned into a fresh channel. The\nnew religion was corrupted by the old follies, the worship of the Virgin\nwas substituted for the worship of Cybele, the mother of the gods. March\n25th, Lady’s Day, dedicated to Mary, was formerly called Hilaria and\ndedicated to Cybele. The religion of mankind is the effect of their\nimprovement not the cause of it.”—Buckle’s Hist. Civ. 1-188.\n\n\n\n\n                              CHAPTER VI.\n\n                         Jehovah, alias Adonai.\n\n\nAccording to the Hebrew lexicon יה (Yh or Ih) is one of the names of\nGod. Y, I and J. are interchangeable, and Jehovah is identical with the\ngod Yah of the Philistines and Iach or Iachus or Bacchus and Iao or Io\nand Jove. Bel of the Babylonians is the Chaldaic form of Baal, and\naccording to Herodotus is identical with Zeus, who is the same as Deus\nor Jehovah. Ja or Jagannatha, the idol of the Hindus, is said to smile\nwhen a human blood sacrifice is thrown before his car.\n\nJehovah Binah seemed to be a favorite divinity among the Masons. The\nname of this daemon, or subordinate goddess, is written on the serpent\nin the magic circle of King Solomon, which he employed in raising the\nDevil, and as Sabbath appears in her title, and she belongs to the\nsphere of Saturn or Moloch, I conclude that she was the goddess of the\nWitches’ Sabbath. There are ten persons in the Hebrew godhead, and she\nis the third, the supernal mother, the wife of Kether, consequently the\nmother of god. See Lesser Key of King Solomon, 47.\n\nAccording to the Standard Dictionary, (see “Sephira”) Jehovah is not the\nSupreme God, there is a party named Kether above him, the Ancient of\nAncients. Baal, Bel or El is the fourth, next below Binah. He is the god\nof love and mercy, with whom we have no truck. We prefer the God of\nBattles. Baal Poer was worshipped in the groves under the name of\nAdonis. It may be seen by reference to the Hebrew Kabala, Kitzur Sh’lh,\nfol. 62, col. 1, that Adonai is called the Rock of Ages, like Christ.\nMadam Blavatsky says that Iachoh, Iach and Lord Sabaoth, the Baal Adonis\nor Bacchus, who was worshipped in the groves and public sods or\nMysteries, under the polishing hand of Ezra, becomes Adonai, the one and\nsupreme god of the Christians. The codex of the Nazarenes says: “Thou\nshalt not worship the sun, who is called Adonai and Kadush and El El.\nThis Adonai will elect to himself a nation, Jerusalem will become the\nrefuge and city of the abortive, who shall circumcise themselves with\nthe sword and shall adore Adonai.” Israel is the same as Adonis. It\nmeans son of the Lord Ra, the Egyptian sun-god. So Israel was one of the\nchrists, and it was his duty to wrestle with the Devil, Moloch. And he\nhad a right to put his brother out and take his place, as christ, the\nnew moon takes the place of the old moon (called the old and ugly\nchrist) and as Solomon killed Adonijah and took his place.\n\nHaeckel says Jehovah was originally derived from the heaven god called\nMoloch and Baal, also Seth and Typhon of the Egyptians and Saturn of the\nGreeks.\n\nDavid says: “Who shall ascend into the high place of the Lord (Iach, in\nthe original)? who shall stand in the place of his Kadishu (holy\nladies)?”—Psalms, 24:3. “Solomon went to the high place of Gibeon, for\nthere was the Tabernacle of God.”—2 Chron. 1:3. You will see that the\nhigh places were the temples of a foul worship by reference to 1 Kings,\n3:3.\n\nYahevah is the ineffable name for which the Hebrews substituted Adonai.\nThe Bacchantes, in their orgies or feasts of Iachus, pronounced the\nmystic word “Io Evohe.” Ei Eh Ei is I Am the I Am, and Ei was found\ninscribed on the temple of Apollo.—Plutarch, 1:14. Eidol is a doll or\nimage of the god Ei, or Kether.\n\nJehovah is identical with the god Brahma. Every 4,320,000,000 years all\nthe planets in our solar system are in conjunction. This is one day of\nBrahma, 365 times that is one year, and one hundred of these years is\nthe lifetime of Brahma, then god dies, and thereafter we have to worry\nalong without him.\n\nThe Trinity, instead of being a new revelation of the Christian\nreligion, was taken from the trinities of the older pagan religions. The\nChinese, the Hindus, the Babylonians, the Persians and the Egyptians\neach had a triune or hydra-headed god, a nightmare of their imagination,\nwithout foundation in nature or reason. If we have the only true\nreligion, how is it that the Mexicans, before this country was\ndiscovered by the savages of Europe, had the trinity, the rite of\nbaptism, the sign of the cross and purgatory. They had the tradition of\nthe flood and the escape of Noah, and they offered as an oblation\nlittle, dough, male images of their savior as we do at the communion\nservice.\n\nSome claimed that the astral light or ether was the supreme god, that\none portion of it was male (spirit), and the other part was female\n(matter), and that the living forms of matter produced by the union of\nthese two gods, are the third person of the trinity, the son of man.\nOthers claim that the incomprehensible god back of the ether, of which\nthe latter is an emanation, is the supreme god, and that the spiritual\nportion of the ether is the Word or Son, and the material portion of the\nether is the mother, and the union of the son and the mother produces\nthe phenomenal world. This a charming family relationship eminently\nappropriate to our pot-pourri of superstitions, called religion.\n\nManu, the Hindu lawgiver, says: “The Sovereign Master, who exists\nthrough himself, divides his body into two halves, male and female, and\nfrom the union of these two principles is born Viradj, the son, or\nmaterial forms.” The first name of this hermaphrodite god in the picture\nwriting was IO.\n\nHaeckel says that the Christian God is a gaseous vertebrate. Socrates\nwas put to death because he did not believe in the gods and introduced\nnew demoniacal beings (spirits).\n\nIn the Sunday American Magazine was also a picture of the Rock of Ages,\nin fact two pillars or Asherim or images of Asher are shown, together\nwith two circles or groves. They were found in the ruins of Gaza. These\nare the idols that Abraham, David and Solomon worshipped when they hit\nthe high places. And we still revere them and have the shafts erected\nover our graves and the wreaths placed upon the shafts so that we may be\nborn again. If you do not think that Moses worshipped this rock god read\nDeut. 32:8. “Of the rock that begat thee thou art unmindful.” There were\nonly seven thousand in all Israel that had not kissed the pillar.—1\nKings, 19:18.\n\nThere was also found in the ruins of Gaza an oval medallion in which\nstood “Horus, the strong bull, resplendent in strength.” Why is the\nInfant Jesus of Prague placed in an oval medallion? Why is the oval,\nwith the Lamb in the centre thereof, placed on the front of the Infant\nJesus, as it is on the front of the Virgin Mary? This picture of the\nInfant Jesus is a mine of esoteric symbolism. He has his name\nembroidered on his rich, elaborate dress, to wit, I E S. He holds up\nthree fingers as he was taught to do when he was the infant Buddha, and\non his head is the seven-rayed headdress of Buddha, the god of the\nseven-rayed sun.\n\nIf you have catarrh, place a medallion of the Infant Jesus on your nose,\nand the catarrh will disappear.—Miraculous Infant Jesus of Prague, 30. A\nmedal of the Divine Infant has been known to cure a sore thumb, if\nfastened in faith to the diseased member and accompanied by nine days\nprayer.—Idem 36. A man in financial difficulties made a novena (nine\ndays prayer) to the Holy Child, and at the end of the devotions somebody\ngave him $35. Then he commenced another novena and was helped to win a\nprize in a lottery. Then he commenced the third novena, and Jehovah\ncompelled a grasping mortgagee to discharge his mortgage on the\ndevotee’s house, and another party gave him $10.—Idem 52.\n\nIn the Hebrew Bible you will see that Bethel, or house of God, referred\nto in Genesis, 28:19, is spelt Bath Al, which means the house of the sun\nor sun-god, the same as Bothal or Brothel, the temple of worship of the\nDruids and Indians, a circle of twelve monoliths with a pillar in the\ncentre, also called paradise. We changed the vowels and made it read\nBeth El, as we did not care to have our God related to such trash as Al\nand Allah, the Arabian god.\n\nArius and the Council of Nice agreed that the Son is called Wisdom.\nRefer to “Sephira,” Stand. Dic., and you will see that Jehovah is named\nWisdom and that he is the son of, or first emanation from Kether,\nconsequently it is claimed that he is one of the christs. The only gods\never worshipped were the sun and his wife, the moon, to whom he was not\nlegally married. The idols are images of incarnate sun-gods.\n\n\n\n\n                              CHAPTER VII.\n\n                      The Host, a Human Sacrifice.\n\n\nThe Monstrance was a conventionalized Assyrian Grove, containing the\nHost, the male and female emblems, and corresponded with the Ark and was\ntransparent, so that the devotees could look on the blessed symbols and\nlive forever. It was called the Monstrance because it contained the\nhermaphrodite monster, now or formerly worshipped by the devotees of all\nreligions. The directions of St. Cyril, of Jerusalem, were: “After\nkissing all the brothers and sisters, you touch the consecrated things\nto the eyes, nose, mouth and ears.” See Ency. Brit. 8:632.\n\nUnder the mediumship of Eugene Vintras in Paris, the Devil placed his\nsignature on the Hosts of the Church in characters of blood. The Abbe\nCharvoz brought one of the miraculously marked Hosts, bearing the\nsignature of Satan, to Elephas Levi. One of the signatures was the\nCaduceus of the Greeks, the emblem of the Godhead, two serpents entwined\nabout a rod, but the rod was omitted. Levi calls it the Typhonian sign\nmanual because by omitting the rod, it thus denies the existence of the\nSupreme God Jehovah. The Devil, in the stigmata, asserts that there are\nonly two gods, the two powers of the astral light, attraction and\nrepulsion, the creator and the destroyer.—Mysteries of Magic.\n\n“In the case of Father Gerard in 1731, who was tried at Aix, in France,\nfor resorting to sorcery in the seduction of his parishioner, Mlle.\nCatherine Cadiere, it was shown that he breathed upon her, and that she\ninstantly conceived a violent love for him and had extatic visions and\nhysterical convulsions, and stigmata or blood marks of the Passion\nappeared upon her, that is, the bleeding marks of thorns on her brow, of\nnails in her hands and feet, and of a lance cut in her side. Of the\ntwenty five judges, twelve voted to send the priest to the stake.”—Isis\nUnveiled, 2-633.\n\nThe doctrine of transubstantiation, or the myth that the bread and wine\nbecome the actual body and blood of God, originated among the Hindus,\nand we stole it from them. The god Brahma was the astral light or\nmagnetism, and when the priests charged the hosts with magnetism, they\nwere charged with god, and consequently were gods. It is said that each\nseparate part of this blood sacrifice is a Christ, so thousands of\nChrists were served up at a feast to be eaten by the savage devotees,\nand each cannibal ate a whole Christ to save his dastard soul. It is\ncalled the Host because they knifed him or struck him down, and it is\ncalled the Eucharist because they rejoice over his death and make a\njoyful feast upon the carcass. The Eucharist is one of the oldest rites\nof antiquity, instituted many hundreds of years before the Lord’s\nSupper. It was a repetition of the drama in Eden in commemoration of the\nfall into generation. By the worship of the foul idols in the\nMonstrance, by the idolatry of the Eucharist the pagans euchred the\nDevil out of their souls.\n\nThe Eucharist was a human sacrifice. The devotees groveling in abject\nsuperstition, offered up their Christ on the reeking, blood-stained\naltar, and ate his flesh and drank his blood to wash their sins away. At\nthe twelfth general council of the Church, the bread and wine was made\nthe flesh and blood of Christ, and at the Council of Trent they added\nthe soul. So at the orgies, the depraved devotee destroyed both the body\nand soul of his savior by casting him into his carrion carcass, into\nthat charnel house, into that cavernous and loathsome inferno, from\nwhich there is no escape, there to rot and disintegrate and forever die.\nThus they subjected their savior to the foulest method of annihilation\nto save their worthless souls from Hell.\n\nAt the Passover the Jews sacrificed over 250,000 lambs to propitiate\nsome blood-loving god. The altars and courts of the Temple ran red with\nthe life blood of these innocent creatures. And certain beasts still\nsing: “And sinners plunged beneath that flood lose all their guilty\nstains.” “Such a blood-sacrifice is unworthy of any people except the\nworshippers of some heathen devil-god in darkest Africa.”—Mystic\nChristianity, 65.\n\nWhen Richard, Robert, Sarah and Isabella Bartlett, at Lincoln, England,\nin 1521, expressed their opinions too freely on religious matters, they\nwere burned at the stake by Bishop John Longland, but they were a\npestiferous and seditious lot. They even objected to eating the male\nemblems, or images of the male, on communion day, and these double-dyed\nheretics denied the real presence of either Christ or Priapus in the\nimages.\n\nHere is what Taine says as to this affair: “The Bishops had received the\nright of imprisoning without trial laymen suspected of heresy, and the\njurisdiction of all crimes, offenses and sins was given to the\necclesiastical tribunals. They burned Lord Cobham alive. With what\nshamelessness this power was transformed into a vehicle for extortions.\nA man begins to think when he is thus downtrodden. He asks himself if it\nis really by divine dispensation that mitred thieves thus practice\ntyranny and pillage. He wants to know if they themselves practice the\nregularity that they impose on others, and he learns strange things.\nCardinal Wolsey writes to the Pope that both the secular and regular\npriests were in the habit of committing atrocious crimes, for which, if\nnot in orders, they would have been promptly executed. A priest\nconvicted of incest with the prioress of Kilbourn was condemned to carry\na cross in a procession and pay a fine of 3s and 4p. In the reign of\nHenry VII the gentlemen and farmers of Carnarvonshire laid a complaint\naccusing the clergy of systematically seducing their wives and\ndaughters. The Holy Father Prior of Maiden Bradley hath but six\nchildren, and but one daughter married yet of the goods of the\nmonastery, trusting shortly to marry the rest. The royal visitors found\nconcubines in the secret apartments of the Abbots. At the nunnery of\nSion the confessors seduced the nuns and absolved them at the same time.\nThere were convents, Burnett tells us, where all the recluses were found\npregnant.”—Taine’s English Literature, 2-18.\n\n“Bishop Longland, of Lincoln, about 1521, summons the relatives of the\naccused, brothers, women and children, and administers the oath. As they\nhave already been prosecuted and have abjured, they must make oath, or\nthey are relapsed, and the fagots await them. Then they denounce their\nkinsmen and themselves. Three of the accused were charged with passing\nthe night together in reading the scriptures. Several of them at church,\nat the moment of the Elevation would not say their prayers and remained\nseated dumb as beasts. A brazier denied the real presence. Six were\nburnt alive. The children of John Scrivener were themselves obliged to\nset fire to their father’s funeral pyre. They saw him, bound by an iron\nchain, with clasped hands, praying amidst the smoke, whilst the flame\nblackened his skin and destroyed his flesh. Such sights are not\nforgotten.”—Idem.\n\n“At the peril of his life the Englishman obtains some portion of the\nBible, which Tyndale had just translated, and hides it and learns it by\nheart. Tyndale, the translator, was condemned, hunted, in concealment,\nhis mind full of the idea of a speedy death and of the Great God, for\nwhom at last he mounted the funeral pyre.”—Idem, 2-21.\n\nIf you do not believe that Priapus is christ, see Ency. Brit. 19-170,\nwhere he is represented as the shepherd god with a shepherd’s crook, and\nas the god of the vineyards and of fishermen, giving them abundant\nharvests. And sailors, in their sore distress, called upon him as Peter\ndid.\n\n“The Masons, in the darkness, hunt for Hiram Abiff, as the worshippers\nin the Eleusinian Mysteries hunted for their lost Cora.” In the grand\nfinale the Mystics say: “I have taken the emblems from the kiste, and\nafter kissing and tasting them, I have deposited in the bag, and from\nthe bag back into the kiste.”\n\nIn the first illustrated English Bible, the Devil will be seen, wearing\na pair of wings and a Hebrew nose, tempting Eve. He says: “Take this\nfruit, bite it and taste it.” You will see that the thing presented to\nher is not an apple at all, but the emblem of Ashtoreth. See Sun. Am.\nMag. Dec. 20, 1914. You will also find in another illustration there the\nangel Gabriel, with the Word strapped on his back, descending into Hell\nto deliver the souls in torment.\n\nYesterday in passing a great church, when I raised my eyes to the cross,\nI there beheld on each arm of the cross, the circle, the same revered\narticle that the Devil offered to Eve. This blessed and holy symbol is\nfound engraven over the portals of the eternal rock temples of the\nruined city of Petra, Arabia, that flourished in the time of Esau and\nhis son Edom, as well as over the doors of the ancient churches of\nIreland, and on the modern cathedrals. In fact this aesthetic Eye\nworship extends around the world, starting in the slums of India, it has\ncircled the globe.\n\nThe Christian religion was copied largely from the Eleusinian Mysteries,\nwhich were founded at the city of Eleusis, near Athens. These mysterious\nrites were employed in the worship of Demeter or Mater, the mother god,\nor Mary. In these Mysteries the worshippers indulged in the foul orgies\nof the Agape. The men carried male emblems or Signa Taus, and the\nfemales carried the kiste or box. Placing the Signa Tau in the kiste\ncaused them to be born again and saved their souls from Tophet.\n\n\n\n\n                             CHAPTER VIII.\n\n                             Jesus Christ.\n\n\nIf the clergymen tell you that there is only one christ, politely\npresent them with the seal of Belial. Each of the principal religions\nhad twelve christs. Christ was never crucified, but the human race was\ncrucified by religion from its very inception, and the Christian world\nwallowed in the Egyptian darkness of ignorance and superstition till in\nthe middle ages, the golden age, no king in Europe could read and write.\n\nChrist is the same as Agni, the sun god of the Aryans, who was called\nthe Son of God and the Son of Man. The god Agni is represented by us by\nthe idol, the Agnus Dei, the Ram God, that holds in his hoof a cross and\nsome banner, perhaps the blood-stained banner of the Inquisition. Adam\nKadmon, Enoch, Horus, Krishna, Ormazd, and Hermes, the patron of thieves\nand flocks, the son of Deus and Maia, these and many other gods are all\nidentical with christ. Noah was the christ that came in the sign of the\nWaterman 25,868 years ago. In the Babylonian legend the deluge continued\nseven days, and the ship landed on Mt. Niser. This is a resurrection of\nthe great god Dionysius or Bacchus, and the first thing he did when he\ngot ashore was to get drunk. He is also Jehovah Nissi or the Egyptian\ngod Osiris who was born on Mt. Nissa or Sinai in the month of Nisan or\nEaster.\n\nSephir Toldos Jeshu, a Kabalist, says: “A virgin named Mariam, betrothed\nto one Johannan was outraged by another man named Joseph Panther. Her\nbetrothed left her. The child born was Jesus, named Joshua, adopted by\nhis uncle Rabbi Jehosuah. He was initiated into the secret doctrines by\nRabbi Elhanan, a Kabalist, and then by the Egyptian priests, who\nconsecrated him High Pontiff of the Universal Secret Doctrine. Upon his\nreturning to Judea his learning and powers excited the jealousy of the\nrabbis, and they publicly reproached him with his origin and insulted\nhis mother.”\n\nAccording to the Pretevangelium Jacobi, “From her third to her twelfth\nyear Mary was in the Temple. When she became of nubile age, lest she\nshould defile the Sanctuary of the Lord, she was committed to the\nguardianship of Joseph, an elderly man and a widower with a family. When\nthe Virgin’s pregnancy was discovered, Joseph and she were brought\nbefore the high priest, and though asserting their innocence in all\nsincerity, were acquitted only after they had been tried with the water\nof the ordeal of the Lord.”—Ency. Brit. 15:590. Mary was then a virgin\nand ever after remained so, although she had other children.\n\nThe author does not believe that either of the above passages refers to\nthe Christian Jesus. He is an Egyptian or Hindu deity, not a Jew.\n\nThe christs were all illegitimate. Their parents, the sun and moon,\nwould have complied with the idiotic human laws if there had been any\nmagistrate in Heaven to marry them. There was Asphalius of Greece, born\nof the Virgin Ethra out of wedlock. Then there are Romulus and Remus,\nalias Castor and Pollux or Gemini, the Twins of the zodiac. They were\nsons of a Vestal Virgin named Rhea. King Amulius, corresponding with\nHerod, commanded his servant to destroy the two children, but the\nservant put them in a trough or ark, and they floated on the river as\nMoses, who was also a christ, did in his ark, and as the males and\nfemales did in Noah’s Ark. Their mother claimed that their father was\nthe god Mars. Unmarried ladies, in those halcyon days, always put their\nchildren up to the gods.—See Plutarch, 1:33.\n\nChrist is a mythical sun-god, a rebirth of the sun in a new sign of the\nzodiac. The Church Fathers, in localizing the Christ in the Holy Land,\ncould claim that any Jesus of that region was the Son of God, either\nJesus, the bandit of Galilee, or the one described above, as long as his\nname corresponded with the I E S of Egypt, and as long as he was dead\nand could not defend himself. According to Josephus, the Jesus that\nlived in the reign of King Agrippa and Herod the Tetrarch was Jesus of\nGalilee, the captain of a band of robbers, a wicked man, a seditious\nperson and an innovator, the leader of a tumult of mariners and poor\npeople. He sacked the temple at Samaria. See Life of Josephus, 5.\n\nRenan says that Philo, who died about 50 A. D., and who was born before\nJesus, and who lived in Palestine during the alleged preaching of\nChrist, had never heard of him. Josephus does not mention a Christian\nsect at all. The Emperor Adrian called the Christians worshippers of\nSerapis, and that was probably the truth. Serapis is the Devil, with\nhorns, Lord of the Underworld.\n\nChristna, Apollo, Zeus and others, like Christ, were good shepherds. The\nHindus represent Christna as crucified on the cross between two thieves,\nwith the nail marks in his hands, and with a crown of seven points to\nshow that he is the seventh avatar. His father was a carpenter, and he\nslew the great serpent Caliva and was worshipped in India ages before\nthe Christian Era.\n\nThe doctrine of Christ and the atonement originated in heathendom. It\ncame from the pagan sacrificers of human beings and the eaters of human\nflesh in human gore imbued. They took the doctrine from the Chaldean\nKabala. It is a pagan myth. Bacchus or Dionysius was the god of the\nvine, and his worshippers drank his blood to wash their sins away. He\nwas the son of Deus or Zeus and an earthly mother. He was slain or\nsacrificed at the winter solstice and went down into Hell. Hera, who\ncorresponds with Herod, sought Bacchus to slay him. He was honored by\nfestivals at Christmas, when the sun died, and at Easter when it was\nresurrected. His emblems were the bull, the ass and the goat. The\nChristians of Rome were ridiculed for worshipping an ass-headed god. The\nsymbol of the Bacchic orgies is named Eva or Heva, identical with the\nserpent raised by the Hebrews in the wilderness. Heva means a female\nserpent and constitutes a part of god, the second part of the name\nYaheva. The first part of that hermaphrodite god is Ya, the male, and\nthe last part is Heva, the female, or serpent, or Devil.\n\nChrist not only never rose from the dead, but he never existed. The\ndoctrine of vicarious atonement is a lie and a farce. The Christian’s\nhope of escaping Hell by cowardly allowing another to suffer for his\nsins, has taken wings and flown away.\n\nThe Gnostics, one of the earliest Christian sects, formerly called\nEssenes, claimed that Christ was a phantom, that he was neither born nor\nsuffered on the cross. See Book of All Religions, 213. Origen believed\nthe same. He tells of the popular irrational Christianity based on the\nfictitious gospel history devised to assist the masses, who could not\ncomprehend a spiritual christ.—Mystic Christianity, 211.\n\nMadam Blavatsky says that this abominable doctrine of the forgiveness of\nsins is the cause of three fourths of the crimes of so-called\nChristians. The murdered victim goes to Hell in the midst of his sins,\nbut the murderer receives absolution and goes to Heaven and sits with\nChrist beside the Golden Throne. The Parsis say: “If any of you commit\nsin under the belief that he shall be saved by somebody, both the\ndeceiver as well as the deceived shall be damned to the day of Rasla\nKhaz. There is no savior. In the other world you shall receive the\nreturn according to your actions. Your savior is your good deeds.” Plato\nsays in 2-187: “Even if there are gods, they can be bribed by prayers\nand offerings, so it is better to be unjust and offer of the fruits of\ninjustice to the gods. By our sinning and praying and praying and\nsinning, the gods will be propitiated, and we shall be forgiven.”\n\nThe Jews offered seven lambs at the new moon because the Lamb came seven\ntimes. It is to be noted that they gave none of the offering to God\nexcept the refuse, the extremities and the fat and the lobe of the\nliver, but the priests had the breast and the right shoulder. The Lord\nand the mob were welcome to the offal.\n\nWe are saved by the blood of christ or Priapus, but the Jews were saved\nby the blood of the circumcision of Abraham, who was also a christ.\n“Abraham was circumcised on the day of the atonement, and God looks that\nday annually on the blood of the covenant of our father Abraham’s\ncircumcision as atoning for all our iniquities.”—Talmud Yalcut Chadish,\nfol. 121, sec. 3.\n\nWhen the young and beautiful philosopher, Hypatia, disclosed these\nsacred religious secrets in Egypt about 412 A. D., she was torn from her\nchariot by a Christian mob, dragged to a Christian church, stripped\nnaked and ravished at the very feet of the idol of Christ, and then\nbeaten to death by Peter, the Reader. Her body was cut into pieces, the\nflesh scraped from the bones with oyster shells, and the remnants cast\ninto the fire by the order of the canonized saint, Bishop Cyril of\nAlexandria.—Ency. Brit. 12:596.\n\nA Nazar or Nazarene, according to Hosea, was one who had consecrated\nhimself to Bosheth, (a shameful thing, a foul idol.) It was in Nazareth\nthat the Nazarenes anciently held their Witches’ Sabbath. Bosher is the\nHebrew name of the Tree of Infamy. The “Sod of the Kadishim,” Psalms,\n89:7, is rendered by the translators “Assembly of the Saints,” when it\nwas in truth an orgy of the ladies devoted to the service of the Temple.\nSod was the name given to the vile assemblies in the ancient Mysteries\nin Sodom, and the nature of the sacred ceremonies may be gathered from\nthe name. They were the same as those of the ancient Christian Agape or\nLove Feast.\n\nIt is claimed that Apollonius of Tyana was the original of Christ, for\nthe former was worshipped in Rome in the third century as the savior of\nman, and that no such person as Jesus Christ was then known. There was a\nsect that worshipped the Hindu Christos. Their religion was a mixture of\nBuddhism and Platonism, and their chief symbol was the phallic cross\nwithin the circle. The Christian religion takes its name and symbols\nfrom this Hindu religion. See Antiquity Unveiled, 98. Lucian says that\nthe Christians spoke of Apollonius, called in Romans Apollos, as a god\nand took him for a lawgiver, and honored him with the title of Master.\n\nPrior to the sixth Ecumenical Council, 680 A. D., the Christians\nworshipped an animal idol, the lamb on a cross, but it was found from\nancient monuments that the pagans had worshipped the same idol. So the\nCouncil decreed that the figure of a man should be placed on the cross,\nChrist was not nailed to the cross until 680 A. D. and then by the\nEcumenical Council.—Idem 161.\n\nThe pagan priests, at a very early date in the present era, finding that\nthey were losing their hold on the people, concocted from pagan\noriginals a new religion called the Christian. As a sop to the depraved\nand besotted worshippers of virgin-born gods, they alleged that their\ngod was born of the Virgin Mary, and they seized upon and falsified the\nHindu gospels, containing the life of Buddha, till they were made to\nappear to apply to the life of Christ. In order to bolster up this foul\nimposition and conceal the origin of Christianity, they destroyed the\nrecords of Grecian, Egyptian and Roman civilization and sank the world\nin darkness for a thousand years, filling it with woe and bloodshed. The\nsuccess of this crime against their fellowmen set back the hands of time\ntwo thousand years. See Doubts of Infidels.\n\nThe doctrine of blood atonement came from Phoenicia, where they\ncontinually indulged in human sacrifice. In the event of an eclipse of\nthe sun, the priests burned a man on a cross at the altar of the sun-god\nto avert the threatened calamity. “From the sixth hour there was\ndarkness over all the land until the ninth hour.” And on these altars,\n2600 B. C., was I H S or I E S. As the E or H in Egyptian hieroglyphics\nis a circle, this sign was originally I O S. I represents the father\ngod, and O the mother god, and S represents the son or serpent. The\nserpent was crucified on the cross by the Egyptians and Jews as a saving\nrite.\n\nAt the church festival of Tezcatlipoca in Mexico, they chose a prisoner\nas the incarnate representative of god and placed a garland and an\nembroidered mantle upon him, as the Jews did on Christ. Then they led\nhim to the temple, where the priest cut his heart out and held the\nsacred bleeding heart up to the sun, and his body was eaten by the\nchurch members, as we eat the body of our Savior.\n\nRev. Robert Taylor says in his Diegesis: “Not a single passage written\nin the first century can be produced from any independent authority to\nshow the existence of such a person as Jesus Christ or his disciples.”\nThe silence of all contemporary writers respecting Jesus Christ is a\nnotorious fact. Philo, Seneca, Plutarch, Juvenal, Virgil, Horace, Ovid\nand Lucian, who lived in that period, make no allusion to his works, nor\neven mention his name.—Doubts of Infidels, 66.\n\nThe christ Prometheus died for the salvation of the world and was nailed\non the cross many hundreds of years before the Christian Era. And the\nchrist Esculapius, the Great Physician, healed the sick and raised the\ndead and died in the West and rose again in the East.\n\nJonah was a christ or sun-god. The sign of the Goat in the Buddhist\nzodiac is represented by a leviathan or whale vomiting out the sacred\nElephant, or sun, or Son of God. When the sun entered the sign of the\nLeviathan in December it was swallowed by the whale, but was vomited out\nagain three days later on the 25th of December, when the sun commenced\nto return. Hence the story of Jonah and the whale, which has been so\nhard to swallow, and which has taxed our piety to the limit.\n\nIes is the Phoenician name of the god Bacchus. Ies, or Iesu, or Jesus\nwas stolen from the Phoenicians and Egyptians, and the god Christos was\ntaken from the Hindus and thrown together into the melting pot of\nPotoman of Alexandria, and out came Jesus Christ. Potoman compiled the\nChristian religion from Hindu, Greek and Egyptian originals.\n\nIf God made man in his own image, why does he have to be redeemed? It is\ntrue that man stubbed his toe and fell, but it was because he obeyed the\ncommand of God to increase and multiply. The Yogis claim that Christ was\nnot virgin born, but was a virgin spirit split off of God and came to\nredeem the world. If he redeemed the world, how is it that the people\nare worse now than they ever were, that the history of his religion has\nbeen a history of depravity, vice, crime, murder and carnage, which has\nnow culminated in a world-orgy of savagery, pillage and slaughter, of\nwhich the fiends in Hell would be incapable? How is it that the beasts,\nwhich have never been redeemed, the doves, the rabbits, the lambs, the\ndeer, are far superior to us who were bought by the blood?\n\n\n\n\n                               CHAPTER IX\n\n                        Hell-fire and Brimstone.\n\n             You’ll burn in Hell ten thousand years,\n             In vain will be your cries and tears,\n             You’ll burn in Hell till ages meet,\n             And just begin to feel the heat.—Amasa Alden.\n\n\nWe are in Hell now. Rabbi Eleasher says that “the demons who were cast\nout of Heaven and the descendants of the witless progeny of matter and\nspirit became in the course of time the men of our planet, after having\npassed through every form of every one of the elements.”\n\nWhere did the Church dig up Hell? The Scandinavian Hell is not a place\nof punishment, but simply the abode of the dead. The dictionary says\nthat Hades, the Hell of the Bible, is the abode of all the departed, the\nunseen spirit world. The Shoel of the Hebrews is the place of departed\nspirits, not a region of torment. The Underworld or Amenti, of the\nEgyptians, is a region of judgment and purification. The Onderah, the\nabyss of darkness of the Hindus, is an intermediate state or purgatory.\nWhence then came the dogma of Hell, that Archimedean lever of Christian\ntheology, with which they have succeeded in holding in subjection the\nnumberless millions of Christians for nineteen centuries.—Isis Unveiled.\n\nHere is where Eusebius and the other Biblical writers got Hell.\nAccording to Mahabad, the christ and Adam of the Parsees, who wrote all\nthe laws of God, Hell is peopled with ants, serpents and scorpions,\nignorant, sick and indigent men and irreligious philosophers, and on\naccount of the detestable qualities of the later, the ants, serpents and\nscorpions pounce upon and torture them. This is the Hell of\nHells.—Dabistan, 81.\n\nIn the chart of the cosmogony of the Kabalists, representing their idea\nof the creation of the universe, the last and most insignificant\ncreation is the earth, which they have labeled Hell, the abode of the\nDevil, the Kingdom of the Great Serpent according to the Buddhists.\n\nIn the religious Mysteries, if the soul has attained the final knowledge\nof the heavenly and infernal mysteries, the gnosis, complete reunion\nwith the spirit, and knows the Word, at the death of the body, it\nbecomes a god, or is absorbed into the soul of the world, the astral\nlight, and becomes one of the creative deities or Elohim. If not, it has\nits part in the lake of fire and brimstone (the elements), the second\ndeath. This death is the gradual dissolution of the astral body into its\nprimal elements and the banishment of the human spirit or electron into\nchaos.\n\nElephas Levi and many of the wise ones have said that the astral light\nis the Great Serpent or Devil, so we will go to the Devil anyway, no\nmatter which path we pursue. What difference does it make whether we are\nunited to the astral light or the material ether? All the atoms of all\nthe elements have individual souls.\n\nKrishna, the Hindu christ, Horus, the Egyptian christ, the Scandinavian\nThor, the Greek Apollo and St. Patrick, the Irish christ, are all\nrepresented as killing the Great Serpent, the Devil. All of the christs,\nincluding Buddha, Bacchus, Hercules, Orpheus and Askelapius, as well as\nJesus, descended into Hell and ascended again the third day. According\nto the Gospel of Nicodemus, Christ found Adam, Moses, David, Isaiah and\nall the other saints there, and as they had been burning in Hell several\nthousand years, their wings were pretty well singed and they were badly\nmussed up, but Christ took them by the hands and led them up to the\nHebrew heaven, where the three balls are worshipped, together with the\nass-headed god. The Devil had no one left to rule over except the\ndepraved, uncircumcised gentiles and the elemental demons. The Gentiles\ncannot get past the gates of Tophet, but must linger for a time, and\nhalf a time, and ten thousand times while they do battle with the\nphantoms of Hell and wrestle with the Serpent of the Great Abyss.\n\n“The Presbyterian clergy of Scotland delighted in telling their hearers\nthat they would be roasted in great fires and hung up on hooks by their\ntongues. They were to be lashed with scorpions and see their companions\nwrithing and howling around them. They were to be thrown into boiling\noil and scalding lead. A river of fire and brimstone broader than the\nearth was prepared for them, their bones, their lungs and their liver\nwere to boil but never be consumed, and while worms were gnawing at\ntheir bodies, they were to be surrounded by devils mocking and making\npastime of their pains, the torment to be varied in its character as\nwell as eternal in its duration. Hell was created before man came into\nthe world, the Almighty having spent his previous leisure in preparing\nthis place of torment, so that when the human race appeared, it might be\nready for their reception.”—Buckle’s Hist. Civ. 2-293.\n\nHell is the lowest of the astral planes, in the immediate atmosphere of\nthe earth, where the most of us go. Heaven is the highest of the\nspiritual planes, where God lives, but as nobody to speak of ever goes\nthere, no one on the astral ever saw God or can make affidavit that he\nexists, and any spirit that claims that he has seen God is either\ndeceiving us or is himself mistaken. He may have seen some astral idol,\nformed from the astral substance by the imagination and worshipped by\nthe religion-besotted spirits. “The aura of the spirits in the lowest\nastral plane is the same as that of wicked human beings, a dark, cloudy\nor smoky emanation, streaked with the red flames of anger and passion.\nDeep shades of color whirl and swirl in the depths, lightning-like\nflashes shoot forth, and great bodies of lurid, smoky, clouds fly on the\nsurface, having all the appearance of an inferno, and the region itself\nhas the same aura, derived from the combined auras of its inhabitants.\nIt is not surprising that the witches and wizards of the Bible, who\ncould see by clairvoyant vision, described it as a Hell of fire and\nbrimstone.”—Human Aura, 45.\n\nAccording to the religion of Zoroaster, “Hell is the House of\nDestruction. It is the abode chiefly of the priests of bad religions,”\nthat is, all religions except the Persian, but this is not to be taken\nseriously, as every religion is a joke. Here we have the original\ndoctrine of the resurrection of the body, which our Christian ministers\nhave had the consummate nerve to preach even here in this age of the\nworld.\n\nMark Twain says in “The Mysterious Stranger”: “A God who mouths justice\nand mercy and invented Hell, mouths golden rules and forgiveness and\ninvented Hell, who mouths morals to other people and has none himself,\nwho frowns upon crimes, yet commits them all, who created man without\ninvitation, then tries to shuffle the responsibility for man’s acts upon\nman, instead of placing it where it belongs upon himself.” The trouble\nwith Mark was that he accepted as true all that silly superstition, all\nthose puerile fairy tales, all those black lies from the Pit of Hell\nwritten and taught by the old priests and prophets. God never created\nthe human race, he never made Hell. This cruel remark of Mark is\nlibelous, almost bordering on blasphemy.\n\nRead what the insane Church Fathers said: “There in Hell the intelligent\nfire burns the limbs and restores them, feeds on them and nourishes\nthem.”—Felix.\n\nThe proud monarchs and magistrates (and everybody but the Christians)\nshall liquefy in the fierce flames of Hell.—Tertullian.\n\nWe shall be compensated by a perpetual spectacle of our persecutors in\nan ever-burning Gehenna being devoured by living flames.—Cyprian.\n\nLing or the Word is the Commander-in-chief of the universe.—Clement.\n\nEvery sinner kindles for himself the flame of his own fire, and is not\nplunged into some fire kindled by another.—Origen.\n\nThe wicked will be provided not with the old earthly body, but with an\nindestructible body capable of holding out forever against everlasting\nfire.—Lactantius.\n\nThe whole mass of the human race is condemned. If we can pray the wicked\nout of Hell, we can pray the devils out.—Augustine.\n\nEverybody, infants included, go to Hell, unless they are\nbaptized.—Ambrose.\n\nThere shall be eternal torments for all devils and skeptics.—Jerome.\n\nVotive offerings by the living will reduce the torments of the dead. The\nblessed shall rejoice over the punishment of the damned.—Aquinas.\n\n\n\n\n                               CHAPTER X.\n\n                               The Devil.\n\n\nChrist overcame the Great Serpent, the Devil, and the Irish Bacchus, St.\nPatrick, drove all the snakes out of Ireland. The drunken Bacchus, whose\nSaturnalia was held on the 17th of March, when they poured out libations\nto him, was canonized and is now St. Bacchus, and his coffin and relics,\nendowed with magical and miraculous powers, were exhibited at Rome\naccording to Isis Unveiled, 1:160.\n\nDeus was Dyaus of the old Aryan or earlier Persian religion. Dyaus means\nto shine, and was a name of the sun. The followers of Zoroaster asserted\nthat Dyaus was the Devil, and if they were right, it follows that Deus\nis the Devil. In this connection read the Lord’s Prayer, in which the\nignorant worshipper endeavors to persuade the Lord not to lead him into\ntemptation. According to the writers of the Bible, who were probably\nliars, He hardened the heart of Pharaoh, commanded the Israelites to\nsteal, put an evil spirit into Saul and sent lying messages to the\nprophets. In Samuel it says that the Lord moved David to number Israel,\nbut according to Chronicles it was the Devil who put him up to it. The\nwords divine and devil are from Deva, the shining one, the Hindu god of\nlight. Light is also luc, and Lucifer is a sun-god identical with\nYahvah. The worshippers of Dyaus said that Ahura Mazda, of the\nZoroastrians was the Devil. Ahura Mazda means I Am the I Am, and he is\nour God, the supreme God of the Hebrews, Kether, the father of Jehovah.\nAccording to the early Christians, the Gnostics and Nazarenes, the\ncreator was Ilda Baoth, but in the Gospel of Nicodemus Ilda Baoth is\nSatan. Aaron sacrificed human beings to Azazel, identical with Moloch or\nthe Devil. The Bible says that “man shall devote unto the Lord of all\nthat he hath, both of man and beast. None devoted shall be redeemed, but\nshall surely be put to death.” We conclude that god and the Devil are\none, that Brahma, Buddha, Dyaus, Ahura Mazda, Baal, Osiris, Jove,\nBacchus, Christ, Priapus, Adonis, Deva and Devil are different names of\nthe same god, and that god is a myth.\n\nThe Devil is an emanation of god. He is Typhon, also called Sat and Seth\nin the Egyptian religion. The Ency. Brit. says that he is a brother or\nson of Osiris, and we have shown that Osiris and god are one, so we\nconclude that the Devil is the son of god as claimed in Job, 1:6. The\nSalvation Army says: “You must be a lover of the lord if you want to go\nto Heaven when you die.” So you must love the Devil and all these beasts\nof pagan gods, or you will have to shovel coal while the endless years\nof eternity roll.\n\nThe Pentagram, by the power of which Solomon could summon the high gods\nto his assistance or call up the goblins damned, represents God when one\nhorn of the star is in the ascendent or at the top, but when the two\nhorns are in the ascendent, it represents the Devil or the goat. When\nSolomon summoned Gabriel to help him capture a new girl, the head of the\nstar, on which is the mystic eye, was pointed toward the altar of\nevocation. But if he wished to raise the Devil, the horns of the goat\nwere pointed toward the altar. In the infernal invocation Solomon wore a\nleaden cap, on which were the signs of the Moon, Venus and Saturn. He\nhad two candles of human fat in a crescent candlestick, a copper vase\nholding the blood of the human victim, a censer containing incense\nmoistened with the blood of a goat, four nails from the coffin of an\nexecuted criminal, the head of a black cat which has been fed on human\nflesh for five days, a bat drowned in blood, the horns of an immoral\ngoat, the scull of a parricide. Then Solomon says in the evocation of\nthe Devil: “By Adonai Elohim (the Creator), Adonai Jehovah (the Son),\nAdonai Sabbaoth (the Mother), by the womb of the Mother Adonai, by the\nWord of the Python and the Mystery of the Salamanders, by the Conclave\nof the Sylphs and the Gnomes, by the Demons of God in Heaven and\nAlamousin and Gibor, Come! Come! Come!”\n\nOn the Pentagram is the mystic word יחוח, Yahvah, the spelling of which\nindicates that it represents two hermaphrodite gods. יח, Yah, is the\ngood god, and וח, Vah, is the god of evil. The good god is represented\nin a pack of cards by the king of hearts, the god of love, and his wife,\nthe queen of diamonds. And the hermaphrodite god of evil is represented\nby the king of spades and his wife, Lilith, the queen of clubs.\nAristotle said that Jehovah was Ormazd, the god of light, and Pluto, the\ngod of darkness. Jehovah is the God of Wisdom, so is the Egyptian\nserpent god, called Sat or Satan.\n\nThe serpent god is the astral light, the magnetic current. The priests\nby their great will power could direct this current at pleasure and\nperform the wonders and miracles that held enthralled their besotted\ndevotees. They claimed that they were serpents because the serpent god\nmagnetism permeated their bodies. A manuscript found among the Toltecs\nof Mexico asserted that they were descended from the house of Israel.\nVoltan, the Mexican demigod, says that he is the son of the snakes. The\nhierophants of Egypt and Babylon called themselves the sons of the\nserpent god. The chief priest of the serpent god of the Mexicans says:\n“I am a snake myself.” The Druids of Britain used to say: “I am a\nserpent, I am a Druid.”—Isis Unveiled.\n\nCneph or Cohen Eph (divine serpent) of Egypt was the supreme god, the\nflying dragon, the divine spirit permeating all creation, like the\nserpent god of the Buddhists. This spirit is electricity. The Ophites,\nChristian Gnostics, claimed that the serpent that tempted Eve was Jesus\nChrist, the Great Architect of the Universe, or Cohen Eph. Eve\nrepresented matter, and the spirit permeating matter produces living\nbeings.\n\nThe astral light is both god and the Devil, the creator and the\ndestroyer and also the Nirvana of the Buddhists. It is the Ah of the\nHindus, or Iah or Eh Ei Eh of the Hebrews. It is life or the life-giving\nfluid. It is the Od and Ob of Moses and the Kabalists. When it acts on\nthose that are drawn within its current it is the Ob or Python. Moses\nwas determined to exterminate those witches who, sensitive to its\ninfluence, allowed themselves to fall under the control of the vicious\nbeings which move in the astral waves like fish in the water.—Isis\nUnveiled, 1-158. Porphery says that “these beings are mischievous and\ndeceitful, though some are gentle and harmless, but so weak as to have\nthe greatest difficulty in communicating with mortals. Their powers of\nreasoning are in a latent state, and therefore they themselves\nirresponsible.” But St. Augustine says: “These spirits are deceitful\nthrough malice. They pass themselves off for gods and for the souls of\nthe defunct.” St. Jerome says that some of these elementary spirits or\nsatyrs, with the legs and tails of goats, were exhibited at Alexandria,\nand one of them was pickled and sent to the Emperor Constantine, which\nhe highly appreciated, as he was usually in the same condition. The\nDevil says, according to Edgar Allan Poe: “In a climate so sultry as\nmine it is frequently impossible to keep a spirit alive for more than\ntwo or three hours, and unless pickled immediately (and a pickled spirit\nis not good eating) they will smell.”\n\nThey called out sixty thousand militia in Cevennes, France, in 1700 to\ndrive the Devil out of the boys and girls and babes at the breast who\nprophesied in pure French, a language unknown to them. The Prior\nreported to Rome that the Devil was so powerful that no torture and no\namount of exorcism is able to dislodge him. He says he closed their\nhands on burning coals, and they were not even singed, that he wrapped\ntheir bodies in cotton soaked with oil and set them on fire and could\nnot even blister their skins, that balls were shot at them and found\nflattened between the skin and clothes.\n\nPerhaps the greatest number of miracles ever performed in the world were\npulled off by the Devil at the tomb of Abbe Paris from 1727 to 1749. The\nsick were cured, the deaf made to hear and the blind to see. Often a\nyoung girl among the convulsionaries would bend back into an arc, her\nloins supported by the sharpened point of an iron rod, and beg to be\npounded with a fifty pound stone suspended from the ceiling. The stone\nwas allowed to fall repeatedly with all its weight upon her abdomen, and\nthe girl enjoyed it and cried for more, and no injury was found upon her\nperson. When violent blows were struck with a sledge-hammer upon a drill\nheld against her stomach she cried out: “O! how delightful, that does me\ngood. Strike twice as hard if you can.”—Isis Unveiled.\n\n\n\n\n                               CHAPTER XI\n\n                              Life Cells.\n\n\nI Am the I Am, the Hebrew God, is supposed by Christians to be the First\nCause, but the assumption of a first cause is quite unnecessary, and\nfurther, if you postulate a creative god, some impertinent person might\nask you who made God. It is just as well to start with matter, in which\nmind and energy are inherent, which is eternal, infinite, immortal,\nself-existent and sustaining, requiring no supreme power as a basis or\nbackground, as set forth in the Sankhya System of the Hindus. See Phil.\n& Relig. of India, 55.\n\nThe attraction or love of one mass of matter for another is the energy.\nIt is that love that creates all forms. The atoms go a-chasing after\nother atoms, even as you and I. There can be no attraction without mind.\nAnaxagoras and Empedocles believed in a dualism of mind and matter. The\nlatter says: “The periods of the formation of the world depend upon the\nalternate prevalence of love and hate. During certain periods all\nheterogeneous atoms are separated from each other by hate, during others\nthey are everywhere united by love.”\n\nHaeckel says: “These three fundamental attributes, matter, force and\nsensation, are found inseparably united throughout the whole universe in\nevery atom and every molecule.”\n\nEdgar Allan Poe says: “That which is not matter is not at all. The\nultimate unparticled matter not only permeates all things but impels all\nthings. This matter is God. What men attempt to embody in the word\n‘thought’ is this matter in motion. The unparticled matter, or God, in\nquiescence is what men call mind. The motion of the unparticled matter\nis the universal thought of the universal mind. This thought creates.\nAll things are but the thought of God. For new individualities gross\nmatter is necessary. To create individual, thinking beings, it was\nnecessary to incarnate portions of the Divine Mind. Thus man is\nindividualized. Divested of corporate investiture, he were God.”\n\nAccording to the Ionic philosophy matter is by nature endowed with life,\nand life is inseparably connected with matter.—Ueberweg’s Hist. of\nPhilosophy, 1-32.\n\nIt is said that in the beginning a male electron or spirit, or purusha,\nor soul, from the spirit principle of the universe, becoming involved in\nthe material ether, formed a vortex, about which the female or material\nelectrons of the ether revolved, thus producing an atom, the basis of\nall visible forms. The electron attracts the particles of matter in the\nether as a magnet attracts steel. The electrons are called units of\nelectricity, and there are perhaps a thousand in an atom. The space\nbetween these ions is comparatively as great as the space between the\nplanets of our solar system. Leucippus, of Abdera, says that souls are\nround atoms.\n\nThe religious claim that the Divine Thought or Word originated the\nvortex movement. As John did not care to proclaim that his god was Ling,\nwhich he had stolen from the Hindus, he called it the Word, another\nmeaning of Ling, from Ling comes linguist. Word is the exoteric meaning\ndesigned for fools, and the other is the esoteric or hidden meaning\nknown only to the initiates. I think that the Christians are in error in\nclaiming John’s god as their own, but amid such a flock of gods the\nconfusion is not surprising.\n\n“New Light has arisen, coming from Heaven, it assumed a mortal form.\nVirgin receive God in thy bosom, and the Word flew into the womb.\nBecoming incarnate in time, and animated by her body, it was found in\nmortal image, and a boy was created.”—Plutarch, Isis and Osiris, 17.\nChristna or the Word, the Hindu savior, like Christ was a shepherd, and\nhe became entangled with the shepherdesses. He was born in the cave of\nVenus, as all Simon-pure christs have to be, and King Kamsa, in seeking\nto kill him, ordered the destruction of all male infants. He also had\ntwo fathers, God and Vasu Deva, the Earth god or Joseb. He and the god\nVishnu were one.—Phil. & Relig. of India, 278.\n\nThe Hindus claim that the akasa or astral light, or Brahma,\n(electricity) originated the vortex movement that formed the atoms.\nAkasa is the source of life, the reservoir of all energy, the\nall-directing and omnipotent god. It was the indispensable agent of\nevery magical performance, and the Brahmans said that they had to stir\nup Brahma in order to perform a trick in magic to delude their devotees.\nMadam Blavatsky says: “As God creates so can man create. By the action\nof the will power on the atoms he can call objective forms into being.\nThe atoms are like automatic workmen moved by the influx of the will\ndirected upon them.” “Every motion we make, every word we utter gives an\nimpulse to the ether and thus creates atoms.”—Edgar Allan Poe.\n\nAristotle says: “The world always was and always will be. The ether\nfills the celestial spaces, and of it the spheres and stars are formed.”\nThe atoms combine to form molecules, and these, being attracted\ntogether, form the gases of which nebulae are composed. These nebulae\nfollow the same circular movement that prevails in the atoms, and the\nresult of this movement is a solar system, the nucleus of which becomes\nthe sun. The rings that separate from the main body in this revolution\neventually break up and form planets. When these planets cool, we find\nall the atomic souls either in the water or imprisoned in the rocks or\nin the central fire. The sea beats up against the rocks, and the rains\ndescend upon and disintegrate them and thus release the souls that were\nimprisoned there in the process of involution. Now they commence to\nevolve toward what the egotistic have termed man’s high estate.\n\nYogi Ramacharaka says: “The Yogi teaching informs us that even in the\nmolten mass there were elementary forms that were to become the\nancestral forms of the later living beings. From these elementary forms\nthere gradually evolved, as the earth cooled and solidified, other\nforms, and so on until at last the first living form manifested. The\nlowest forms of what we call life were evolved from forms of crystal\nlife, which indeed they very much resemble.”\n\nHaeckel, the world’s greatest scientist, says: “Man descends immediately\nfrom the ape, and secondarily from a long line of lower vertebrates back\nto the Silurian fishes. The lowest man appeared on the earth about three\nmillion years ago.”—Riddle of the Universe, 82. Anaximander, of Miletus,\nsays: “Living beings arose by gradual development out of the elementary\nmoisture under the influence of heat. We land animals had in the\nbeginning the form of fishes.”—Ueberweg, 1:35.\n\nThe atoms combining by their own desire and will formed a molecule, and\nthe molecules by their own volition combined to form a life cell, our\nearliest ancestor, a minute, animate mass of protoplasm, the lowest form\nof animal life, born in the slum of the ocean bed millions of years ago.\nMyriads of these life cells form the human body. Each cell is a distinct\nindividual, having brain, mind and soul. Haeckel says that the\nprimordial living substance is plasm. We can live only by eating other\nliving beings or plasm, that is, by cannibalism. Plants create living\nplasm out of alleged non-living matter, they form carbo-hydrates, and\nfrom these form plasm by a combination with water, carbolic acid,\nammonia and nitric acid. We claim to have souls, but deny them to the\nplants, the divine creators whose chemical laboratories, the cells, are\nbeyond human comprehension.\n\nThe cells arrange themselves in the embryo in the form of a human being\nby their own will. “They use the materials which are at hand,\nfabricating organs for themselves by instinct, and in the appointed hour\nare born in the shape which they have formed for themselves.”—Enoch, ch.\n14. The human embryo in its development passes through all the forms\nthrough which the race has struggled in its evolution from stone,\nthrough the primordial cell, the worm, the fish, the saurian and\ngorilla. In the last stage, that of the gorilla, the embryo is entirely\ncovered with hair like our beloved ancestors, and sometimes development\nis arrested at this point and a hairy child is born occasionally with a\ntail.\n\nThe scientists have discovered in the cell body a god more potent than\nany known deity and have named it centrosome. It is a being of stellar\nform, located just above the nucleus or nerve centre of the cell. It is\na creator whose magic far excels the feats of gods or men. It divides\none living being into two, splitting the brain and the body of the cell\nin halves in such a manner that the two individuals produced are the\nexact duplicates of the parent cell in form and character. The cell\nbrain matter, called cromatin, is composed of strings of very minute\ngranules, termed cromosome, which are supposed to contain all the\nhereditary traits. The division of each one of these cromosomes into\nequal halves gives to the individuals produced a similar character. The\ncentrosome is one in the beginning, but before dividing the cell it\ndivides itself into two persons, so that one of the centrosomes may\naccompany each of the two cells. Each centrosome seizes one half of the\nbrain of the parent cell thus divided and draws it to one side of the\ncell to form the nucleus of one of the new cells. Then the whole body of\nthe cell is divided in the centre.—Story of the Living Machine, 100.\nWhen the centrosome divides the cell, two cells are produced capable of\nreproducing themselves in like manner. Prof. A. Dastre says that “under\nsuitable circumstances the lowest animated forms are immortal.”\n\nOur soul is formed by the combination of the souls of the two germ cells\nfrom which the embryo originated. We existed in our parents prior to our\nadvent here and in all of our ancestors for 500,000,000 years back, more\nor less. The conscious matter that constitutes me, the cromatin, existed\nin every one of my ancestors since we were washed out of the igneous\nrocks or spawned in the ocean depths. Jack London says: “I did not begin\nwhen I was born. I have been growing, developing through incalculable\nmyriads of milleniums. All these experiences of all these lives and of\ncountless other lives have gone to the making of the soul-stuff that is\nI.”\n\nElephas Levi says: “The millions of germ cells that fail to become human\nbeings are transformed into phantoms or larvae. These larvae possess\naerial bodies formed from the steam of blood. For this reason they seek\nout spilt blood, and were formerly nourished by the smoke of sacrifices.\nThe cohesion of the parts of these phantastic organisms is so feeble\nthat they fear a strong wind, large fires, and above all the points of\nswords. They are vampires.” This accounts for the craving of the gods\nfor blood sacrifices. The spirits and phantoms were mistaken for gods by\nthe drunken prophets.\n\n“The cells are spheroids and they are men in embryo,” says Plato. “God\ncaused the universe to move with a circular motion and created original\nman as a perfect circle. The sexes were originally three in number, man,\nwoman and hermaphrodite, and they had two faces and four arms and four\nlegs, but Zeus cut them in two. After the division the two parts of man,\neach desiring the other half, came together and threw their arms about\none another eager to grow into one. Each of us when separate is but the\nindenture of a man, having one side only like a flat-fish, and he is\nalways looking for his other half.”—Plato, 1-483.\n\nThe intelligence of the cells has been clearly established by\noverwhelming proofs. An egg or ovum is at first a small fertilized cell,\nand in its development or transformation into an embryo, it is at first\ndivided into several cells, to wit, the head cell, the body cell, the\ntail cell and the food cells. Prof. Oppel, in his experiments in\nembryology, separated these cells, removing them from their proper\npositions, but the cells so removed, traveled about trying first one\nplace and then another until they usually found their proper positions\nand there joined the body and grew thereon, producing a perfect animal.\nIf they made a mistake and joined the body in the wrong place, a monster\nwas produced.\n\nFurthermore, a scientist produced a mushroom-shaped being by subjecting\nmetallic salts to the action of a galvanic current. The particles of the\nmetal gathered around the pole of the magnet in the shape of a mushroom.\nThis thing was a living being, with alimentary canal in its stem,\nthrough which it drew its nourishment and added to its growth. It was\nonly necessary that a current of life or electricity be introduced among\nthe particles to cause them to assume the form of a living organism. The\nmetallic tree is produced by the same means. A copper wire and a piece\nof zinc are suspended in a bottle of a solution of acetate of lead, and\nthe particles of lead gather about the copper wire and put forth\nbranches, limbs and foliage.—Yogi Ramacharaka.\n\nEach atom of matter, each molecule and every life cell, of which man is\ncomposed, has a soul of its own. And it is claimed that beside the\nindividual cell souls, man not only has a communal soul in his brain,\nbut a soul in his Solar Plexus. After a frog is beheaded, if a drop of\nacid is placed on his body, he will wipe it off with his foot.\n\nThe development of animals out of frogs and men out of animals was held\nby Anaximenes 600 B. C., and the evolution of species was an accepted\ndoctrine before the flood. In the Hindu books it is written: “When the\nworld had issued out of the darkness, the subtle, elementary principles\nproduced the vegetal seed, which animated first the plants, from the\nplants life passed into fantastical bodies which were born in the\nwaters, then through a series of forms and various animals it reached\nman.”—Bhagavata.\n\nKapella, an Aryan sage, denied the existence of a first cause, claiming\nthat everything in nature found itself developed only in consequence of\nmaterial fatal forces. The ancient Kabalists said: “A stone becomes a\nplant, a plant a beast, a beast a man, a man a spirit, and the spirit a\ngod.”\n\n\n\n\n                              CHAPTER XII.\n\n                        Magic and Devil Worship.\n\n\nElephas Levi claimed that the attraction and repulsion of the atoms is\ncaused by the astral light. “There exists an agent which is material and\nspiritual, a universal plastic medium, a common receptacle of the\nvibrations of motions and the images of forms, a fluid and a force. By\nmeans of this force all nervous apparatuses secretly communicate with\neach other, thence come sympathy and antipathy, thence dreams and second\nsight. The existence and use of this force is the great secret of\npractical magic. The astral light attracts, repels, vivifies and\ndestroys all things under the influence of powerful wills. It can be\ndirected by the leaders of souls. By means of this agent we can\ncorrespond instantaneously from one end of the earth to the other,\ndiscern what is taking place at the antipodes, heal or hurt at a\ndistance. The Gnostics called it the burning body of the Holy Ghost.\nLife is produced by the action of the astral light on the ether or\nmatter. In man it forms the astral body, it is the first envelope of the\nsoul, and it is by combining with the most subtil fluids that it forms\nthis etherized body or phantom. The astral body is nourished by the\nastral light, as the physical body is nourished by the earth. The astral\nlight is saturated with souls, which it releases in the incessant\ngeneration of existences, and whose imperfect wills can be dominated and\nemployed by stronger ones. The elementary spirits are like children,\nthey torment those who concern themselves about them. It is these that\nproduce the raps on the walls and furniture.”—Mysteries of Magic, 65.\n\n“An individual can leave the physical body and actually travel on either\nthe material or astral plane in the astral body. Many persons are able\nto travel thus in their ordinary sleep.”—Astral World, 25.\n\nAll magic is religious, having been invented by the priests or Magi. It\nis said that the religious bodies copied their demonology from the\nKabala of the Jews, and that the latter borrowed their system of theurgy\nand theology from the Egyptian and Babylonian priests. If any one\noutside of the religious bodies started any opposition devil-worship,\nthey were promptly burnt. All the magic rituals are derived from the Key\nof King Solomon, claimed to have been found in his sepulchre at\nJerusalem.\n\nIn the Magic Grimore, ascribed to Pope Honorius, he says: “We have seen\nwith what power Jesus commanded demons, which power was transmitted to\nSt. Peter, and, as the lawful successors of St. Peter, having the keys\nof the Kingdom of Heaven, and desiring to share the power of invoking\nand commanding spirits, which has been reserved unto us alone, with our\nbrethren, we have included in this Bull the manner of their invocation.\nAnd because it is meet that the ministers of the altar should have\nauthority over rebellious spirits, we hereby depute unto them all the\npowers which we possess in virtue of the Holy Apostolic Chair.”—Book of\nBlack Magic, 100.\n\nIn invoking the Devil or other choice spirits, it is necessary to murder\nsome being. If the conjurer cannot or dare not murder a human being, he\ntakes an innocent virgin lamb and cuts its throat and tears off its skin\nto use for a magic apron or parchment. Instead of the skin of a lamb,\nthe caul of a new-born child may be used.—Idem.\n\nThe sign manual of the demon Valefor, the patron of thieves, contains\ntwo Maltese crosses rampant and three links. As Solomon and his\nentourage worshipped the demon Astaroth, they probably stole from him\nthe two pillars at the door of the Temple and the double triangle above\nthem, for they appeared in the seal of that spirit. There are two or\nmore crosses in each of the seals or signatures of Solomon’s seventy two\nblack fiends. Their motto is, “In this sign we conquer.”\n\nSolomon imprisoned the seventy two devils, with all their legions, in a\nbrazen vessel and sank it in a deep lake in Babylon. The Babylonians,\nthinking that there must be a great treasure in the vessel, took it out\nof the lake and broke it open, when out flew the chief devils\nimmediately, with all their legions following them.—See Waite’s Book of\nBlack Magic.\n\nWe still worship pagan gods. The Hexagram, or double triangle of\nSolomon, is still used by different sects and societies. On it is the\nname of Agla, a pagan sun-god, and also the name of Tau, the Egyptian\nbull christ Taurus, with the pagan symbol, the Tau cross. The god A. and\nO., Alpha and Omega, with which the Hexagram is adorned, is a foul\nBabylonian idol, the same as IO. It has been represented that the Devil\nfalls prostrate before the cross. But, to tell the truth, Lucifer uses\nthe sign himself, also the double triangle and the single triangle in\nhis signature. And Belial has four crosses by which he lies.\n\nWhen a sorcerer conjures up one of the seventy two demons, he must draw\nthe double seal of Solomon (double triangle) and the Pentagram,\n(five-pointed star) on a parchment of calfskin. These must be worn on\nhis white vestment, together with the seal of the spirit invoked. And\nthe secret seal of Solomon (the pillar standing in a circle) must be\ndrawn with the blood of a black, virgin cock on virgin parchment. This\nis part of the conjuration: “I invoke and conjure you, O Spirit, by God\nthe Father, by God the son, by God the Holy Ghost, by the Most Glorious\nand Holy Mother of God, by her Sacred Heart, by her Blessed Milk, by the\nPower and Victory of Hell, by the Ministers of the Tartarean Seat. I\nexorcise thee in the names of El, Elohim, Zabaoth &c. do thou forthwith\nappear. I conjure thee by the Living and True God Heliorem (Helios, the\nsun god) and Tetragrammaton Jehovah (the God of four letters). Come! I\nAdonai Saday, King of Kings, commands thee.” See Lesser Key of King\nSolomon, 55.\n\nThere is no use in trying to invoke spirits or perform any tricks in\nblack magic unless you have confessed and received the Holy Communion,\nand you must pray for assistance to the pagan gods Adonai, Eloim, Ariel,\nYahveh and Gibor, and fast, and abstain from the society of females for\nnine days, and take a bath, and wear the garb of a priest or a Levite,\nand you must have the sacred Masons’ implements, the sword, the staff,\nthe rod, the sickle and the poniard. See Waite’s Book of Black Magic.\n\nThat part of nature called the astral light or universal spirit was\nvirtually the supreme god of all religions. It was the Heaven or Nirvana\nof the Buddhist, (where the soul is blown out like a lamp some\nbelieved.) When he attained to perfection and was reabsorbed in this\ngodhead, he had stormed the heights of Heaven and attained eternal\nbliss. He considered that his spirit would no longer be subjected to\nendless incarnations in material forms. But there is no knowing when it\nwould again by choice or compulsion enter the ether and form another\natom and again commence the unavoidable cycle.\n\nAll the vile religions have scared the human race into ca’niption fits\nby their assertion that our souls will be lost unless we bow down to\ntheir priests and worship their idols. According to the original parent\nreligion, the Hindu, if we obey the priests faithfully, we will go to\nNirvana and become a creator or electron, or elementary spirit. And all\nthe authorities, both pagan and Christian, agree that the elementary\nspirits are mischievous, wicked entities. It would be better to lose our\nsouls, for in that case they are banished into the ether or chaos and\nbecome the nucleus of a material atom. If we go to Nirvana, we are one\nstep farther removed from the ultimate goal of all the ambitions of all\nthe heavenly electrons and material atoms, the supreme pinnacle of\nattainment, man’s high estate, which is greater than that of the gods.\n\nThe Theosophists revel in the mystic and occult. If they can construct a\nsentence that no one can understand, and that they do not know the\nmeaning of themselves, they are in the seventh heaven of delight, their\nwisdom borders on the Divine. Stating their doctrine of transmigration\nin plain language: God sits at his desk in Heaven, with a great lot of\npigeonholes before him, in each one of which is a soul in a state of\ncoma. When he receives a wireless from the earth that Pat and Biddie\nMcGee have formed in their marital relationship a psychic vortex, or\nsoul vortex, he makes a grab at the pigeonholes and lights perhaps on\nthe soul of Pythagoras and sticks it into the new-born embryo, which\nalready has a soul, and there is no room for any other. See\n“Spermatozoa,” Stand. Dic., and note those very energetic individuals in\na frantic race to enter the ovum and blossom out as human beings. You\nwill then realize that the child already has a very lively soul,\nprovided by nature, and there is no occasion for any doped soul,\nsupplied by any idiotic human plan.\n\n“The astral light keeps an unmutilated record of all that was, that is,\nor ever will be. The minutest acts of our lives are imprinted on it, and\neven our thoughts rest photographed on its eternal tablets. It is the\nBook of Life, it is the memory of God. If the medium or subject’s sight\nis ably directed by the mesmerizer, magician or spirit, the light must\nyield up its most secret records to our scrutiny.”—Astral World. It is\nclaimed that each person’s atmosphere in the astral light is peopled\nwith the images of his or her immediate family, thus accounting for the\nassertions of the mediums that they see the spirits of our lost ones.\n\nSwedenborgians claimed that the human body is sometimes abandoned by the\nsoul in consequence of overpowering fright, grief, despair or sickness,\nand that we encounter every day such living corpses. Into these bodies\nmay enter the soul of an adept sorcerer or some earth-bound, disembodied\nsoul. In insanity the astral soul is partly paralyzed, bewildered, and\nsubject to the influence of every passing spirit of any sort, or it has\ndeparted forever, and the body is taken possession of by some vampire or\nhuman soul near its own dissolution, and clinging desperately to earth,\nwhose sensual pleasures it may enjoy for a brief season longer by this\nexpedient.\n\nThe ancients claimed that the soul was located in the solar plexus, and\nit was asserted that they could read, hear, see and smell through the\nnavel. In our vermiform stage of development before evolution had\nsupplied us with heads, the soul was perhaps in the stomach, but it may\nhave moved since. Plato says that the divine part of the soul is located\nin the head. Haeckel says that the human soul is a combination of the\nsouls of all the cells of the body. It is impossible to destroy any\nsimple substance, and if it affords you any comfort, you can assume that\nthe soul or ego is an indestructible electron. The Stoics claimed that\nthe soul is in the heart, and that although it outlives the body, it is\nyet perishable and can only endure at the longest till the termination\nof the world period, 4,320,000,000 years. Epicurus claimed that “nothing\nthat exists will ever cease to exist. Atoms exist from all eternity, and\nworlds were formed by their vortical motion. The soul is material and\ncomposed of exceedingly fine atoms, and is dispersed through the whole\nbody. The rational soul is in the breast.” Stephanus, of Alexandria,\nsays that “copper is like a man, it has a soul and body.” Yoga\nRamacharaka says that “iron is alive and may be killed by poison.”\n\n“Transmigration of the soul takes place in all flesh, in beasts,\nreptiles and fowls. For one form of uncleanness the soul will pass into\na Gentile, for another into a mule, for others into an ass, a woman, a\nbat, a she-mule or a camel.”—Kabala Nishmath Chaim, Ch. 13, No. 1. It\nsometimes happens that one sacrifices an animal with a human soul in it.\nTherefore the slaughtering knife must be without defect, and the\nslaughter must needs be delicately done to avoid cutting the gizzard out\nof the human soul. “The soul of a murderer is transmigrated into water.\nLet no man drink from a running stream, lest the soul of a wicked sinner\npass into him.”—Kabala Emeh Hamelech, fol. 153, col. 1.\n\n“By a combination of the letters of the ineffable name Rava once created\na man and sent him to Rav. Zera. The man being unable to reply when\nspoken to, the Rabbi said to him: ‘Thou art a creation of the company\n(of necromancers) return to thy dust.’ By the same means a Rabbi created\npumpkins, melons, deers and roes.”—Jerusalem Talmud, Sanhedrim, ch. 7.\n\nThe soul, called Psyche, when she is at home, lives in that part of the\nbrain called the Medulla Oblongata, and the spirit, called Budhi, lives\nin the next house up the street, the Pineal Gland. When Budhi, or the\nWord, wins the affections of Psyche, and they are married, the Word\nsaves the soul, and the man who harbors these entities is illuminated\nand becomes a master.\n\nIf you read Genesis in the original Hebrew, you will find that Al or El,\nthe sun, not the Christian God, says: “To every beast of the earth I\ngave a living soul.” The souls of human beings are composed of material\nas refined and spiritual as that of the souls of cockroaches and\nbedbugs, and men, if they behave themselves, are equally as good as\nthose animals and of just as much importance in the universe.\n\n\n\n\n                             CHAPTER XIII.\n\n                         Ghosts and Hobgoblins.\n\n\nThe Hindus of the Malibar coast said they had ghosts, but they knew them\nto be bad spirits, for good ones can hardly ever appear at all. Apuleius\nsays the human soul is a demon or genius, an immortal god. According to\nPhilo Judaeus, the air is filled with an invisible host of spirits, the\nbad ones are mortal, and the good ones are immortal. The soul, upon the\ndeath of the body, transforms into a lemure (phantom). If it is wicked,\nit is called a larvae. The ghosts who, through vice, fearful crimes and\nanimal passions, are confined to the eighth sphere immediately\nsurrounding the earth, are the magnetic vampires and demons so well\nknown to mediaeval ecstatics, nuns, monks and witches, the blood demons\nof Porphery. They may be cast out by powerful magicians, but if a\nsorcerer is not available, you can take a saucer containing two ounces\nof nitre and pour over it one ounce of vitrol and place it under the bed\nof the obsessed, and the devil will take to his heels.\n\nParacelsus says: “It is possible that my spirit, without the aid of the\nbody and through a fiery will alone, and without a sword, can stab and\nwound others. I can also bring the spirit of my adversary into an image,\nand then double him up and lame him.” According to Cotton Mather some\nyoung girls had become mediums by sitting with a West Indian negro\nwoman. They declared that the spectres of various witches appeared to\nthem and bit and pinched and stuck pins into them. Some of the witches\nconfessed that they did afflict these girls by sticking pins into\nmanikins made of wax or rags, and by clutching and pinching their hands\ntogether and wishing in what part and after what manner they would have\nthe girls afflicted, and it was done.\n\nIf you are haunted by an objectionable ghost, provide yourself with a\nsword or a dagger and stab him when he makes his appearance. They are\nawfully afraid of swords, although if you cut one in two, he will join\ntogether again, or if you cut his head off or leg off, he will put the\nmember right on again. But he does not like it, and will thereafter\nleave you severely alone. Bodin says that in 1557 an elementary,\nthundering demon fell down with the lightning into the house of one\nPoudot and kept throwing stones all about the room for several days. The\nmagistrate came to investigate, and the spirit knocked his hat off and\ndrove him out of the house. At last Poudot got a sword and slashed all\naround the room, whereupon the spirit disappeared.\n\nWhere the ghosts are real troublesome, you can drive them away by\ndistributing holy medallions around the house where the ghosts can see\nthem. As the medallions have been blessed or magnetized, God has been\ninjected into them, and they consequently are gods, and mischievous\nspirits who cut up capers around the house are afraid of these deities.\nI have a blessed idol of Buddha on my desk to keep the ghosts out of the\noffice and prevent them from interfering with the composition of this\npious work.\n\nModern spirits are often lying spirits. They are ever on hand to humor\nthe respective hobbies of the persons who communicate with them at\ncircles, and deceive them. When Luther, the sorcerer, evoked the demon,\nhe was told that he should not worship the Virgin. But when St. Dominic\ncalled upon the devils, they told him that nobody was damned that\npersevered in her holy worship. The golden legend of James de Viragine\nshows that the Virgin gave to St. Dominic a miraculous rosary, by which\nhe could perform greater miracles than Christ. But a certain abandoned\nsinner was bold enough to doubt the virtues of the rosary, and\nimmediately fifteen thousand devils took possession of him, and being\nquestioned by St. Dominic, they emitted flames from the nostrils, eyes\nand ears of the demoniac and certified to the virtues of the rosary.\nOver a hundred angels appeared in golden armor, together with the\nblessed Virgin herself bearing a golden rod, with which she administered\na sound thrashing to the demoniac. The numerous theological truths\nuttered by St. Dominic’s devils were embodied in so many articles of\nfaith, according to Isis Unveiled, 2-76.\n\nOne who is unprotected, the tricky powers of the air but too often\ndelude with the semblance of voices. In all the Mysteries, strong drink\nor anaesthetics were administered to the initiates to sunder the soul\nfrom the body and produce visions. The Sankhya system teaches that the\nghost, or astral body, can shrink to such a minute space that it can\npenetrate anything, or enlarge to a gigantic body, or float through\nspace, or standing on the earth can reach the moon, that its will is\nirresistible, having dominion over all things and the ability to attain\nevery desire.\n\nIt is claimed that phantom hands have appeared at seances under test\nconditions and written messages on a table in broad daylight, when the\nmedium was six or eight feet away, but the theory is that the\nmaterialized hand is an emanation from the medium, the astral hand of\nthe medium. Madam Blavatsky says that “this is the spiritual or astral\nbody that is raised in incorruption. It is useless to argue that these\nare spirit hands. To make hands or faces objective, they are compelled\nto use either the astral limb of the medium, or material furnished by\nthe elementals, or the aural emanation of all persons present. Pure\nspirits will not and cannot show themselves objectively. Those that do\nare elementary spirits.”\n\nMadam Blavatsky tells of the following wonderful manifestations that\noccurred in Thibet. A body of traveling Bikshus, or monks, claimed the\npower to reincarnate the Buddha in any infant. A child four months old\nwas brought to their cave and set down in the middle of the room, while\nthe monks sat in a circle around it at some distance. A skeptic minister\nsat close to the child to expose the trickery. The chief Pase Budha went\ninto a trance, and his astral and spiritual body took possession of the\nchild and made it walk and talk, saying “I am Buddha, I am the old Lama,\nI am his spirit in a new body.” The minister said: “The baby looked at\nme with an expression of intelligence that was simply awful. It sent a\nchill through me, I felt a real terror, my hair rose upon my head, and\nmy blood ran cold. The eyes seemed to search my very soul with an\nexpression that made me think that it was the face of the Superior\nhimself, his eyes, his very look that was gazing upon me.”\n\nIf you wish to conjure up or materialize a spirit, purchase from the\nYogis some ancient blood of a black cat, which comes in powdered form.\nThis, together with a sparrow’s brain, burnt upon the altar will produce\na smoke or vapor of peculiar odor and a color unknown and unnamed by\nhuman beings, being a combination of many colors. From the smoke of this\nmagic altar it is possible for spirits to materialize, so that even\npersons without the astral vision can see them.\n\nSometimes a band of occultists will meet around their altar fire, which\nis kindled between the horns of the goat and fed with the ancient blood\nof a black cat and other material from which ghosts can materialize. The\noccultists stand in a row hand in hand, the Grand Master at the head by\nthe altar, and all strongly command that a spirit shall manifest. As the\ncommand passes from one brother to another it gains force, and the power\nof the will is enormously augmented, and after a time there issues from\nthe floor a thread of astral matter, which ascends perpendicularly and\nwidens out as it ascends, assuming a human form, but weak, wavering and\nlimp, bending this way and that on every breath of air. But after the\ncircle has pumped the power into him for a while, he becomes\nsufficiently strong to walk or glide about and take a seat in the circle\nand talk to the members. The materialized body is soft and moist and\ncold as a corpse. When they wish him to disappear they stand again hand\nin hand, the Grand Master next to the spirit, and send the command from\none to the other ordering the ghost to depart, and he will again become\nweak and wabbly and sink down to the floor and disappear through the\nsame nail hole from which he emerged.\n\nIf the company wishes to engage in a dangerous experiment, one half of\nthem will occupy one side of the hall and the other half the other side.\nThey must first erect between them a circle of sheet lead, over which\nthe devil cannot jump to attack any of the members. Then each bunch will\nthink evil vindictive and murderous thoughts of the other bunch, and\nconjure up dire monsters to attack them, and soon a horrible, gigantic\nand vicious thought-monster, part beast, part devil and part human, will\nmaterialize and rush at the members and endeavor to attack them, but\nfortunately for them, he cannot pass the leaden circle, for if he could\nreach those that made him, he would strike them dead with a charge of\nelectricity through the heart. In order to lay this devil they have\nconjured up, they have to clothe themselves entirely in silver-colored\ngarments. They then enter the circle from both sides and close in on the\nmonster. These silver-colored beings scare the devil to death, and he\ncrawls back in his hole.\n\nA man, named B, built a house with second-hand lumber from an old\nbuilding that had been torn down. The old building was reputed to be\nhaunted by the former owner, who was murdered there. The ghost was very\nmad because B took his lumber, and, in order to be revenged, he went\nwith the lumber to the new house and haunted that. B says that the ghost\nwould appear to him when he was going to sleep and jab him in the eye\nwith his finger and seize his arm and hurl it against the wall. When B\nwas half asleep one night, the ghost appeared with a pail of water and\nthrew it all over him. The dog could see the ghost even when B could\nnot, and would bark and show his teeth and propose to fight the phantom.\nB sold the house to some colored folks. They were scared white by the\nskilligin, gave up the property and demanded their money back, because\nthe ghost was an incumbrance on the estate and a legal defect in title,\nhe being in possession, claiming ownership.\n\nSt. Clemens Romanus says that Simon Magus (Paul), of the New Testament,\ncould make himself invisible when and to whom he pleased. He created a\nman out of air, who passed through the rocks and mountains and flew\nalong through the air. He threw himself from precipices without being\ninjured and flung himself into the fire without being burned, he\nanimated statues, he walked through the streets attended by strange\nfigures, which he said were the souls of people departed.\n\n\n\n\n                              CHAPTER XIV.\n\n                         Witches and Sorcerers.\n\n\n“Burn everybody,” the Inquisition seemed to say, “God can easily sort\nout his own.” Poor fools, hysterical women and idiots were roasted alive\nfor the crime of magic.\n\nCatherine de Medicis, the author of the Massacre of St. Bartholomew, had\nin her service an apostate Jacobin priest who was proficient in the\nblack art. King Charles lay dangerously ill, and Catherine, the queen\nmother, had everything to lose by the death of the King. In her anxiety\nshe commanded the priest to inquire of the Devil what should be done to\nsave the life of the King. The priest, taking with him a beautiful\nchild, went into the chapel and after administering to the child its\nfirst communion, decapitated it on the very steps of the altar and\nplaced the palpitating head upon the paten. Then, standing on a reversed\ncross, he celebrated the Devil’s Mass before an image of the Demon, and\ncommanded the Devil to answer by the lips of this murdered child the\nquestion of the Queen. Then a strange voice, which had nothing human\nabout it, made itself audible in this poor little martyr’s head. But the\nsorcery availed nothing, the King died.—Elephas Levi.\n\n“Pope Sylvester was publicly accused by Cardinal Benno with being a\nsorcerer and enchanter. The brazen oracular head made by his Holiness\nwas of the same kind as the one fabricated by Albertus Magnus. The\nlatter was smashed to pieces by Thomas Aquinas, not because it was the\nwork of or inhabited by a demon, but because the spook, that was fixed\ninside by mesmeric power, talked incessantly and disturbed the eloquent\nsaint. These heads and other talking statues, trophies of the magical\nskill of monks and bishops, were fac-similes of the animated gods of the\nancient temples. It was demonstrated that this Pope was constantly\nattended by demons or spirits. Benedict IX, John XX and the VI and VII\nGregory were all known as magicians. The latter Pope, it was said, could\nshake lightning out of his sleeve. In the latter part of the sixteenth\ncentury there was hardly a parish to be found in which the priests did\nnot study magic and alchemy. John Reuchlin, father of the Reformation\nand teacher of Luther, was a Kabalist and occultist. The occult\nknowledge gleaned by religion from the fat fields of theurgy was\nsedulously guarded for its own use, and it sent to the stake only those\npractitioners who poached on its preserves. Between 1580 and 1595 in the\nsingle province of Lorraine, the President Remigius burned nine hundred\nwitches.”—Isis Unveiled, 2-57.\n\n“The gorgeous standard of the Inquisition is represented as waving in\nthe Heavenly breezes at the foot of the Great White Throne of the\nAlmighty. On its crimson, damask face is the cross, the symbol of the\nSon of God who died for mankind, with an olive branch on one side and a\nsword stained to the hilt with human gore on the other.”\n\n“The true origin of the daily accusations and death sentences for\nwitchcraft are traced by Dr. Soldan, of Stuttgart, to personal,\npolitical and religious enmities. Prince Bishop, John George II, of\nBamberg, caused six hundred to be burned for sorcery in five years. The\npetty princes were not unwilling to seize upon any pretence to fill\ntheir coffers, the persons most persecuted being those whose property\nwas a matter of consideration.”—Sorcery and Magic, 2-185. A horse was\nburnt at the stake in Lisbon in 1601 for witchcraft, because it could\ntell the number of spots on a card.\n\nIn the list of twenty nine burnings, or autos da fe, in nineteen months\nin Germany, 162 persons were murdered, of whom 28 were Protestants, 100\nwealthy citizens and 34 little children, the youngest an infant. Wright\nsays that 27 little girls, from seven to ten years of age, were burnt as\nwitches. Lorente, the historian of the Inquisition, computes that\nTorquamada in eighteen years burned at the stake 10,220 persons, and\notherwise punished 97,321. In Andalusia alone, in a single year, the\nInquisition sent to the stake 2000 Jews.—Buckle’s Hist. Civ. 1-136. “We\nlearn that much money was realized by selling to the rich dispensations\nto secure them from the Inquisition.”—Conflict Between Religion and\nScience, 146.\n\nStevens says: “A monk of St. Anthony, having been at Jerusalem, brought\nhome with him a bit of the finger of the Holy Ghost, the snoot of a\nseraphim, one of the nails of a cherub, one of the ribs of the Word Made\nFlesh, some rays of the Star of the East, and a vial of St. Michael’s\nsweat. Henry III, of England, received from the Grand Master of the\nTemplars a vial containing some of the blood that Christ shed upon the\ncross, attested by the seal of the Patriarch of Jerusalem.”\n\nThe hand of one of the innocents massacred by Herod, although Herod died\nfour years B. C., was, in 1837, still preserved in the Convent at\nBethlehem. There also is the pit in which the bodies of the infants were\nthrown, and also the manger which came down from the constellation of\nthe Crab. Some depraved Christian copped the stone on which the cock\ncrowed when Peter denied his Master, and, in 1837, it was said to be in\na church in Rome. In the Church of the Holy Sepulchre at Jerusalem,\namong other wonders, is a monument erected over the grave of Adam, who\nnever existed, and there is a polished marble bathtub or sarcophagus,\nwhich they claimed was the sepulchre hewn out of the rock. See Travels\nin Holy Land, 2-163.\n\nThe fight of the fools and fakirs over the location of the grave of a\nmythical sun-god is certainly ludicrous, but more amusing was the magic\ntrick of the early Christians who stole the grave of Adam either from\nHebron or Mecca and also swiped the grave of Christ from the Damascus\nRoad, north of Jerusalem, and exhibited both, with other shell and\nthree-card-monte games, in the Church of the Holy Sepulchre, in the\ncentre of Jerusalem, for the purpose of annexing the coin of the dupes,\nfarmers and come-ons from all over the world.\n\nAccording to Tichenor, over three hundred years after the crucifixion,\nSt. Helena found the true cross, and also dug up the crosses of the two\nthieves, and this lumber was sold for centuries to millions of the\nfaithful. Even a splinter will save you from Hell and cure you of what\nails you. And the bones, hair and nails of the Apostles have been sold\nall over the world. You could formerly buy a gunnysack full of St.\nPeter’s fingers and toes if you had the necessary dough. The people not\nonly worshipped the Mother of God, but worshipped St. Ann, the\nGrandmother of God. God came unto Mary in the form of Gabriel, and to\nprove it the monk Eiseling exhibited all over Europe a pin-feather from\nGabriel’s wing, which he shed at the conference. Thorns, from the crown\nof thorns, the blood of Jesus, by the drop or the bottle, and the milk\nof the Holy Virgin were peddled out all over the world for centimes.—See\nTichenor’s Roman Religion.\n\n\n\n\n                              CHAPTER XV.\n\n                        The Great King Solomon.\n\n\nSolomon’s Song is very choice reading and would be eminently appropriate\nto the foulest book on earth, the circulation of which would be a\ncriminal offense under the law. The Christian compilers of the Bible\nhave asserted in the headings of the Song that it represents the love of\nChrist and the Church. They were not only wilful liars, but foully\nbesmirched their own church, for that was about 1200 years before their\nchurch existed. The whole context shows that it has nothing to do with\nthe Christian Church, but is evidently the hymn book of the church of\nAshtoreth, of which Solomon was a deacon. Any institution that foists\nupon the world such vile obscenity as the inspired word of God, is the\nTemple of the Devil, the antechamber of Hell, an annex of the Witches’\nSabbath. It should utterly perish from the face of the earth. In fact,\nthe die is already cast, the handwriting is on the wall, the hand of\ndeath is on it now.\n\nSolomon was Grand Master of the secret societies. Those things that were\nesoteric or secret or occult in magic and religion, claimed by the\npriests to be too sacred for the people, were either criminal or too\nvile to utter. That was the only reason for keeping them secret.\n\nSolomon had cheated his brother Adonijah out of the throne to which the\nlatter was entitled by birth, and Adonijah thought that he should at\nleast be allowed to have Abishag, the sixteen-year-old beauty that they\nhad put in bed with the dying King David to save his life. And he\ninduced Bathsheba, the mother of Solomon, to make the request of the\nking. When Solomon had heard the petition of Bathsheba he said: “And why\ndost thou ask Abishag for Adonijah, ask for him the kingdom also.”\nAbishag is the only jewel in the Jewish crown, the most priceless legacy\nthat King David left. A perfect beauty is more to be desired than the\nriches of a kingdom. I will not give her up. All the good things in\nIsrael are reserved for the king. Then Solomon swore by the Lord saying:\n“God do so to me and more also if Adonijah hath not spoken this word\nagainst his own life. Now therefore as the Lord liveth Adonijah shall be\nput to death this day.” What ho! guards, summon Benaiah, Commander of\nthe Knights of the Mystic Shrine of Asherah.\n\nWhen Benaiah appeared, he bowed low before the throne, and, raising his\nright hand, made the occult sign of the Witches’ Sabbath. Then Solomon\nsaid: “Rise, O beloved of the king, favorite of the gods of the groves\nand the gardens. The king hath weighty matters to communicate to thee.\nIt is reported that Adonijah, our brother, hath taken refuge at the\nshrine of that second-rate God Jehovah and doth cling to the horns of\nthe altar. And behold all of Adonijah’s followers are devotees of\nJehovah, while all of our partisans and all of you whom the king hath\ndeigned to grace with official rank are devotees of Baal and Asherah.\nNow the king commandeth that you seek out all of those Jehovah\nworshippers who have stood by Adonijah and eliminate them from the\nproblem of life. Go in and out among them and slay each one your father\nand your mother, your sister and your brother, if so be that they be\namong the rebels. Relieve them of life’s burdens. Do not be harsh with\nthem, show them our royal mercy, shove them gently through the gates of\nHell, cutting them with saws and with harrows of iron and with axes,\nemulating the clemency of our royal father, the bandit chief. As for\nAdonijah, fall upon him and slay him as he clings to the horns of the\naltar. It is true that the altar of a god is sacred ground and a refuge\nas a general proposition, but general propositions do not apply to the\nking, the king is above the law. What do I care for these imaginary\ngods, they are all right to scare children with, but they cut no ice\nwith your Solomon.”\n\nSolomon sat in all his glory upon the great throne of ivory and gold,\nflanked by the twelve brazen lions of the zodiac, and the Knights of the\nMystic Shrine of Asherah in dazzling regalia guarded the beloved of the\nLord. Around the throne, with naked swords and the three hundred golden\nshields, stood the Princes of the Tribes of Israel, as the rays of the\nsetting sun, reflected from the jeweled walls of cedar and gold, bathed\nin dazzling light the royal panoplies of blue and purple and crimson.\n\nAnd King Solomon’s sacred, hermaphrodite Billygoat, in trappings of\npurple and gold, wearing ribbons on his horns and ribbons on his tail,\nstood beside the golden throne with his revered back to the audience in\naccordance with the law in such case made and provided. And he informed\nthe King in no uncertain words that he did not propose to be the goat\nany longer, that the Knights of the Mystic Shrine of Asherah, that had\nbeen assigned as priests to serve him, one of the highest gods, drank up\nall the wine sacrificed to him, and thus prevented him from getting as\nfull as a goat, as required by the tenets of his religion. And further,\nthey did not give him exercise enough, they called him Baphomet and\nDevil and other hard names and took him up out of the pit for a walk\naround the town only once a month, at dead of night, in the dark of the\nmoon, when Hell yawns, and the graves give up their dead. Upon the\nconclusion of this divine oration, the whole audience crawled on their\nhands and knees up the steps of the golden throne and devoutly kissed\nthe back of Baphomet, as we kiss the male and female emblems on the Pax.\n\nThis pious ceremony being completed, the Great King, raising the royal\nsceptre, summoned to his exalted presence the Commander of the Knights\nof the Mystic Shrine of Asherah and said: “While you, Benaiah, my\nfaithful servant, go and kill Adonijah, my well beloved brother, I will\nhie me to my devotions, for I can see that at the mystic shrine on\nyonder hilltop, the luscious Asherah is yearning for me. My adored, my\nmost beautiful, my ravishing one stands in the open door of the pagoda,\nthe beautiful gate ajar, stands there in all her pristine loveliness, a\nbeauty unadorned, young and plump and enchanting. See that innocent\nradiant face beaming with loving kindness, perfect in every feature, see\nthat form divine, of which the gods in Heaven do envy me. She is my\nfavorite nun, the incarnation of the Divine Asherah, and she is calling\nme to prayer. See her beckoning me over with that sweet hand, that angel\nhand that holds me, the King of the Earth and Sea, a willing slave in\nits gentle grasp. She says the door is open wide, and all who will may\nenter in, and no one is denied.”\n\nThen while Benaiah slew Adonijah as he clung to the horns of the altar,\nSolomon and his court in gorgeous array, decked in purple and fine linen\nand blazing with jewels rare and gold to burn, marched in one grand\npageant from the house of cedar and gold, out through the Golden Gate,\nto the high place of Asherah. When they reached the oval, foliated door\nbetween the two great pillars of Baal, beneath the blazing, golden dome\nof Asher, supported by the circle of monoliths or twelve zodiacal\nredeemers, they bowed low before the open portal and crossed themselves,\nand by thus drawing upon their bodies the male symbol, they became\nthemselves male emblems and worthy to enter in, and a worthy offering to\na female divinity.\n\nThe dazzling beauty who stood in the door of the pagoda then ran and\nthrew herself into the arms of the king. He folded her pink and white\nform to his royal breast and impressed upon her ruby lips a long and\nloving caress, saying: “My divine one, my goddess, my life, my all, God\nis love, I know, I feel. Thou art the only angel e’er worshipped by\nSolomon the Magnificent. Thy lips are like the roses, like the\nsweet-scented, dew-bediamond roses in the royal gardens of Judea. Thine\neyes are fathomless wells of priceless love, at which I drink till my\nsoul is drunk and reels in its maddened delirium. Thy flesh is like the\nlilies of the valley, pure and white, meet vessel for a soul so true,\nwhite as the lilies of Asherah, white as the column of Baal, indeed so\ntempting and plump and luscious, that in thy divine and radiant neck I\nfain would bite the name of the King of the Earth and the Sea.\n\n“Solomon offered one thousand burnt offerings in the great high place of\nGibeon,” a brothel, where they worshipped the pillar and the grove.—1\nKings: 3-4. “And they set them up pillars and Asherim upon every high\nhill and under every green tree.”—2 Kings, 17-10. “Solomon loved the\nLord, and the Lord loved Solomon.” They formed a mutual admiration\nsociety, and in Gibeon the Lord said to Solomon: “Ask what I shall give\nthee.” And “Solomon built a high place before Jerusalem at the Mount of\nCorruption (Mount of Olives) dedicated to Ashtoreth,” now replaced by\nthe Church of the Ascension, erected over the footprint made by Christ\nin the rock when he jumped from the earth to Alcyone. The Bible says\nthat Ashtoreth was the abomination of the Sidonians, but it happens that\nAsher, one of the aliases of the Hebrew god, was the husband of\nAshtoreth.\n\nThe secret and mysterious name of the supreme God of the Hebrews, the\nAncient of Ancients, was Eh Ei Eh, pronounced in three breaths, with\nhand to ear and the name at low breath. This is the name that was\nengraved on the great seal of Solomon, wherewith he conjured up demons\nfrom the abyss, for he was a potent wizard. By virtue of this great name\nand by rubbing the seal, Solomon became Lord of the Demons, and\nBeelzebub, at the mighty summons, would bob up serenely and obey the\nbehests of the king. Solomon soared into the celestial altitudes and\nmastered the Divine secrets and learned the omnipotent words which\nconstitute all the power of God over the demons. He penetrated into the\nremotest haunts of the spirits, whom he bound and forced them to obey\nhim by the power of his clavicle (Key). He tells in the Key of Solomon\nthe true composition of, with directions for making the dreadful\nblasting rod which causes the spirits to tremble, and which was used by\nGod in driving Adam and Eve out of the Garden, and which he also used in\ncasting the devils out of Heaven.—Book of Black Magic, 83.\n\nAshmedai, King of the Demons, and a great mason, collaborated with\nSolomon, Hiram of Tyre and Hiram Abiff in building the Temple. He was\nthe one who fashioned the stones without the sound of hammer by means of\nan insect he had, called the Shameer, the same that Moses used in\ncutting the precious stones of the Ephod. The spirits evoked by Solomon\nsaid that Ashmedai had the Shameer, and they gave him the location of\nAshmedai’s water-hole in the mountains, where he went to drink. Benaiah\nthen went out and filled the water-hole with liquor and laid in wait\nnear by. The demon came and drank the liquor, and when he was drunk,\nBenaiah bound him with a ring and a chain, on which was the name of God,\nso that he could not break it. Thus Solomon captured the demon and\ncompelled him to call up Shameer, the insect stone-cutter, and prepare\nall the stones of the Temple.—Talmud Gittin, fol. 68, col. 1.\n\nThis jolly quartette of pagan and infernal pals, assisted by the masonic\nbug, in laying the foundation of the Temple, seized upon a hewer of wood\nand cut his throat and caught the blood in a vessel. After sprinkling\nthe corner stone with the blood, they placed the vessel of human gore\ninside the stone and buried the body of the human sacrifice beneath it,\nthat his spirit might guard the Temple and preserve it as long as grass\ngrows and water runs. Then they danced around the stone the Dance of\nDeath, or the dance of the Maccabees.\n\n\n                   King Solomon’s Signal of Distress.\n\nOne day King Solomon, being bored about to death, and finding that all\nwas vanity and vexation of spirit, wrote to his friend Manus, high\npriest of Baal, something as follows:\n\n                                      Jerusalem, 20th Nisan. A. M. 3000.\n\n  To His Eminence the High Priest of Baal, beloved of the Lord and the\n    Devil, Grand High Potentate of the Knights of Kadish, Beloved\n    Minister of the Holy of Holies, the sacred Grove of Asherah.\n\n  Behold the Great King Solomon, Lord of the Earth and the Sea, Patron\n  of God Almighty, Imperial Potentate of the Imperial Divan of\n  Ashtoreth, Grand High Mucky-Muck and Past Grand Master of the Phallic\n  Cult.\n\n  Sends Greeting. And doth herein represent that he hasn’t a thing in\n  the way of nice girls, only but just a thousand old hens that were\n  passé in three days after their respective inauspicious arrivals, and\n  the heart of the Great King doth yearn for a vision of youth and\n  beauty from the corn fields of Bethlehem. If thou wouldst save the\n  King’s life, get a move on and corral a fair virgin, with golden hair\n  and eyes of blue, for verily a brunette doth make the King tired. The\n  King recommendeth thee to bring the fair one to the back door of the\n  palace, at the entering-in of the woodshed, for behold the thousand\n  old hens have two thousand eyes, and each eye is jealous of your\n  unhappy Solomon. Verily, they are determined that we shall not have a\n  thing that is fresh and fair to look upon. They are a lot of old cats,\n  and we pray thee to promulgate a feast to Moloch and Baal, and\n  announce to the multitude that seven hundred back-number princesses\n  and three hundred fat old concubines have been devoted, and will be\n  passed through the fire to Moloch and Baal, and will be basted and\n  roasted to a turn and served to the people with the gravy oozing out.\n  May the blessings of the Great Gods Ashtoreth, Chemoth and Baal be\n  with thee and thine.\n\n                                        Yours fraternally,      SOLOMON.\n\nOne night King Solomon, together with his two old cronies, Hiram of Tyre\nand Hiram Abiff, went a-hunting in Jerusalem, which at that period was a\nnoted sporting resort, abounding in all kinds of game. At length they\ncaught a coon near the North Gate, at the high place of Asher, where\nwere worshipped the images of the male, and took her to the king’s\npalace. She says (Sol. Song, 1-4): “The King hath brought me into his\nchambers.” Having reached the King’s apartments, Solomon said to Hiram\nof Tyre: “Wouldst thy Majesty kindly rush the duck? Thou wilt find the\ncan behind the throne. And thou Abiff, wilt thou be so good as to go out\nin the woodshed and play tag with thyself for a season and half a\nseason, while I pass the salve to this colored lady?”\n\nHaving got rid of the crowd, Solomon says: “Behold thou art fair my\nlove, thou hast dove’s eyes. Thy nose is like unto the Tower of Lebanon\nthat looketh toward Damascus, and the beautiful hump in the centre\nthereof is like unto that of a camel, that wabbleth ever this way and\nthat.” And the buxom nigger wench, pouting her ruby, liver lips,\nreplies: “Kiss me with the kisses of thy mouth, for thy love is better\nthan wine. Because of the savor of thy good ointments, which counteract\nthe Jewish odor diligently collected since thy last annual bath,\ntherefore do the virgins love thee. I am black, but comely. I am not a\nnigger, but only tanned. They made me the keeper of vineyards, (deleted\nby the censor). Place thy left hand beneath my head, and thy right hand\nshall embrace me, (deleted by the censor). My beloved is mine, and I am\nhis, a bundle of myrrh is my well-beloved unto me.”\n\nDuring the tête-à-tête, the captivating beauty was absent-mindedly\npicking the Tower of Lebanon, when Solomon said: “Knowest thou not that\nour laws prohibit the touching of the unwashed fingers to the nose,\nmouth or eyes. The Talmud says: ‘The evil spirit Bath Chorin rests upon\nthe hands at night and will not depart until water is poured upon him\nthree times over.’ That fairy tale is for the ignorant rabble. You and I\nhave the gnosis. Some of the prophets say that the worship of Asherah,\nin which we indulge, is reprehensible, but who fashioned the first Grove\namong us? Ask them that.” In Jasher, 27-27, it is said that Abraham\nformed at Beersheba a Grove, and that he practiced all kinds of\nabominations. He gave to his seventeen children by Katurah charms by\nwhich they could exorcise spirits and perform all sorts of miracles in\nthe black art.\n\nWhen King Hiram returned with the booze, anticipating a jolly orgy with\nthe wise one, he pounded loudly on the door of the King’s chamber.\nSolomon, being busy, petulantly said: “Get thee hence Hiram, or I will\nhave the cop run thee in.” Then King Hiram was exceeding wroth, and\nthreatened to make war on Solomon and come up to Jerusalem with one\nhundred thousand warriors and take the fair colored charmer away from\nthe seductive Jewish King. Then Solomon replied: “Chase thyself back,\nHiram, to besotted Tyre and make love to that great pillar, which, with\nmuch pomp and ceremony, thou hast recently erected there, and which thou\ndost salute with the holy kiss every morning at sunrise.”\n\n\n\n\n                              CHAPTER XVI.\n\n                         The Mystic Societies.\n\n\nPope Pius IX was accused of saying: “Damn the clandestine societies.”\nOh, My! such shocking language, and so unjust too, for these\nquasi-religious societies, even like certain churches, were anciently\nfaithful devotees of, and expert manipulators of the mystic symbols.\n\nDr. Dalcho, a Masonic writer, asserts: “God was the first Grand Master\nand Adam the second.” And Adam initiated Eve into the profound and\narchaic mystery of the square and the eye.\n\nIt may be interesting to know what they did at the Witches’ Sabbath and\nthe meetings of the ancient mystic societies. They murdered their\nchrist, that is what they did, and the Christians have always charged\nthat they offered up human sacrifices. I should judge from the ritual of\nthe Masons that it originated in the sacrifice of a human being, that in\nancient times human beings were sacrificed in the mystic societies, from\nsome of which, perhaps, Masonry descended. Here are extracts from an old\nritual as near as the author can decipher them, not guaranteeing that\nthey are correct:\n\n\n                Opening a Lodge of Entered Apprentices.\n\nSen. War.: “Brother, the lambskin in all ages has been considered an\nemblem of purity.” This lambskin is the skin of the Lamb of God. It is\nworn on the stomach for occult reasons. The female emblem, the Eye, is\nstamped upon it for the same occult reasons. The mystic societies,\nsun-worshippers and Jews were anciently devotees of the lamb as well as\nthe cow. They sacrificed him and adorned themselves with his skin as a\nsaving rite. The Ram is identical with the god Priapus. You remember\nthat Saul sent David out to gather one hundred Philistine mementos to\nput in the Ark of the Covenant. These mementos and the lambskin are of\nequal efficacy, both being relics of the crucifixion.\n\nWhen christ came in the sign of Capricorn, he came as the goat. At the\ncelebration of Lupercalia in Rome, they sacrificed the goat christ. Two\nyoung men are chosen, and the dagger, or Signa Tau, or the Mark of the\nLiving God, is drawn in blood in their foreheads. Then they cut the\ngoatskin into thongs and run about lashing all they meet. “The young\nwives like to be lashed, fancying that it will make them fruitful.” “The\nJews in Jereboam’s time had priests for the service of their divinities,\nthe sacred billy-goats.”—Plutarch, 1-78. The religious sorcerers, who\nsought to invoke demons, formed their magic circle with strips of\ngoatskin nailed to the ground with four nails from the coffin of a dead\nchild. As the circle was made of the skin of christ, the demons dare not\npass it to attack the sorcerer. This is the circle of the Kabalists, of\nwhich King Solomon was the Most Worshipful, Sublime and Exalted Phalatz.\n\nIn the ritual ascribed to Pope Honorius, the method of raising the Devil\nwas by sacrificing a black cock, which is an emblem of Christ. The eyes,\ntongue and heart are torn out and burnt to ashes. These are religious\nsymbols and objects of adoration. The sorcerer also sacrifices a lamb,\nand places the ashes of the eye, the tongue and the heart on the\nlambskin. He prays to Jesus that the lambskin, with the signs thereon,\nmay save him from the wiles of the demons, that they may be terrified by\nthe sight of these figures. This, I think, is the origin of the figures\non the Mason’s lambskin. This ritual provided that the eye, the cross\nand the moon should be drawn on the lambskin.\n\nIn the Fellowcraft degree of the ritual, when the candidate has stuck\nthe heel of his right foot in the hollow of the left, which is a sacred\nmystic rite that will save your immortal soul from Hell, the Sen. War.\nsays: “You will now show the Worshipful Master the Degree Gag (?) and\nsign of an Entered Apprentice, and when you step forward, place the heel\nof your left foot in the hollow of the right. You will now advance with\nme to the altar. You are now to be made a Fellowcraft in due form. You\nwill now bare your left foot and side and your breast expose. You now\nreceive the mark of the square on the breast.” The Tau Cross, a symbol\nof identical significance with the square, was used in the Bacchic and\nEleusinian Mysteries. It was laid upon the breast of the initiate to\ncause him to be born again. The square is the Egyptian Ka, the idol\nworshipped by the savages in the temples of darkest Africa, and which is\nalso worshipped in the Kaaba at Mecca. Ka, Kaaba, abba, father, papa and\npope all have the same meaning. See “Kaaba” Stand. Dic.\n\nIn the initiation the candidate was allowed to play that he was Hiram\nAbiff. He was conducted around the circle of the zodiac from one door of\nthe Temple to another and encountered three of the beasts of the four\ncardinal points, that is, the gentlemen who played the parts of the\nbeasts in the heavenly drama.\n\nFirst Right. Master: Hiram, give me the sign of a Master Mason.\n\nSen. Dea.: Candidate, the sign cannot be given except in the presence of\nthree, Solomon, King of Israel, Hiram, King of Tyre, &c.\n\nMaster: For the second time I demand of you the sign of a Master Mason.\n\nSen. Dea.: You cannot have that.\n\nMaster: Hiram, for the third and last time I demand of you the sign of a\nMaster Mason. Give it to me, or I will take your life.\n\nSen. Dea.: You shall not have that (but the candidate can have this, and\nhe hits him on the head with the 24-inch gauge, in the play, as near as\nI can make out.)\n\nAt the Second Right, the Master makes the same demands.\n\nSen. Dea.: You shall not have that. Blow with the square (on the head of\nthe candidate, I presume, but as he is still alive, he is conducted to\nthe beast at the third door.)\n\nThird Right: The Master repeats the same demands.\n\nSen. Dea.: Lord of Darkness (who is about to kill the sun-christ in the\nwest) you shall not have that.\n\nThird Right: Damn thee take that, blow with gavel on forehead, (and the\ncandidate or human sacrifice falls dead, in the play.)\n\nSecond Right: We have slain our Grand Master Hiram.\n\nThird Right: What shall we do with the body?... Let us carry it a due\nWest course from the Temple (because the crucified sun is buried in the\nwest) and bury it in a grave sunk due East and West.\n\nMaster: Brother Sen. War. What is the commotion?\n\nSen. War.: Our Grand Master Hiram is assassinated.\n\nMaster: How was he assassinated?\n\nSen. War.: By the Brothers at the door of the Temple.\n\nMaster: Our Grand Master Hiram may be ill. You will cause search to be\nmade for him in the secret antichambers of the Temple and see if he can\nbe found.\n\nSen. War.: Search has been made, Worshipful, and he cannot be found.\n\nAccording to the Egyptian religion Souphis Khunfu Nefer Hept, Lord of\nthe Underworld, murdered the Great Architect. The victim, whether he be\ncalled the Great Architect, or Hiram, or Adonis, or Horus, or Christ is\nalways and ever the setting sun murdered by the darkness, or Prince of\nDarkness, called Sat in Egypt and Satan with us. The sacrifice of Hiram\nAbiff is one form of the Passion Play.\n\nA Masonic society, established in China from the earliest times, is\ncalled Our Ladyship’s Society and the Queen of Heaven Society. In the\nChinese society the candidate is made to pass through the arch of\nswords. He could not be born again or come forth into the light unless\nhe passed through the door of life and came out of the cave. The Chinese\ngod Fo was born of a virgin impregnated by a ray of the sun, as shown in\nChristian pictures of Mary. In the Indian Mysteries three hierophants\nsit in the East and the West and the South. After an invocation to the\nsun, the candidate is baptized, his shoes taken away from him, and he is\nmade to circumnavigate the cavern three times with the sun. He is\nconducted through seven dark caverns and assailed by legions of\nhobgoblins. The victim slaughtered is called Siva, and the lamentations\nof Maya for the death of Siva correspond to the weeping of Mary at the\ntomb of Christ. The sword was aimed at the throat of the candidate by\nthe Evil One, but he was brought forth at last into the light. The Eye\nwas marked on his forehead and the Tau Cross on his breast. He was\npresented with the sacred girdle or apron, the magical stone and the\ntalismanic jewel for the breast.—Isis Unveiled.\n\nIn the Mysteries of Aphrodite, a male emblem is handed to the initiate,\nand those initiated bring a piece of money to her as her hire. Demeter,\nof the Eleusinian Mysteries, is identical with Mary, and Clement says\nthat he knows not whether she is the mother or wife of the god Zeus or\nDeus. This god is a serpent. The token of the Sabazian Mysteries is this\nserpent god gliding over the human breast. The offspring of the rape of\nProserpine (Mary) by this god was christ, the bull.—Clement 1-29. If you\nwish to know what foul things were kept in the Ark of the Covenant, see\nClement 1-31.\n\nAccording to the Egyptian Book of the Dead, in the judgment in Amenti,\nor the Lower World, the deceased or candidate for Heaven is given the\nname of Osiris, and he is tried before the supreme god Osiris and forty\nother deities or beasts. An altar stands before the supreme god on which\nis placed the bribes offered by the soul to god. The forty-two deities\nare the judges of the forty-two sins. One is called the Devourer of\nShades, another the Cracker of Bones, and another the Eater of Hearts.\nIf the soul denies that he has committed the forty-two sins, the judges\nmust acquit him, but if he is convicted of being a land-grabber, he\ncannot get by, as the priests propose to attend to all that business\nthemselves. In the Christian Judgment, the judges will be the\nconfessors, monks and virgins.—The Elucidarium.\n\n“The Buddhist novice, like the Freemasons, is forced to bare his\nshoulder and breast and give up his money and bare his feet, in fact to\nsimulate the vows of poverty, chastity and obedience of the\nBuddhist.”—Buddha & Early Buddhism, 136.\n\nIn Lalita Vistara, Buddha is called the Great Physician, and at his\nappearance the sick are healed, the deaf are cured, the blind see. He\ncures by the laying on of hands or mesmerism. Akasa, the mesmeric fluid\nor the astral light, and the Spirit of God are one in the East. Buddha\nwas born of a virgin, presented in the Temple, disputed with the\ndoctors, was tempted in the wilderness, passed his life in preaching and\nworking miracles, and descended into Hell and ascended into\nHeaven.—Idem, 80.\n\nHeaven was also calmly purloined from Buddhism. The Buddhist heaven is\nthe city four square of John, with the gates of gold and silver, adorned\nwith precious stones. The great throne of God stands in the centre\nthereof by the gem lake or crystal sea, by which stands the Tree of Life\nor Tree of Infamy. The Buddhist religion is wholly phallic. See Book of\nAll Religions, 86.\n\nIf you read the life of Buddha in the Ency. Brit. you will find that it\nis almost identical with the life of Christ. In any Chinese store you\ncan buy an idol of Buddha, who, like Christ, is the god of life,\nbringing us life and life yet more abundantly. He wears a fish skin for\na miter, showing that he is the fish god, and on his divine and radiant\nforehead is the Eye, and on his stomach, between his clasped hands, is\nthe sacred Tree of Life. These divine secrets should not be disclosed to\nthe uninitiated, but, to tell the truth, I am convinced that this is the\norigin of the hermaphrodite abdominal Eye, worn and revered by all the\ngreat and good men from the time our religion found its birth in the\nfoul sties of India down to the immortal Washington.\n\n\n\n\n                             CHAPTER XVII.\n\n                              Revelations.\n\n\nIf you do not believe that all the beasts of the zodiac bear rule in\nHeaven, read Revelations with your eyes open. The Ram is the Grand\nVizier. The Bull is also there, with eyes before and behind, and the\nLion and the Man, the Waterman, in fact the four beasts of the four\ncardinal points of the zodiac.\n\nCh. 1, v 7, says: “Behold he cometh with clouds.” It is evident from\nRevelations that Christ is one of the seven Buddhas who came at the end\nof each cycle, and the seven were one, and that one was the sun in the\nheavens. Budhi means the Word, one of our beloved idols. “I am Alpha and\nOmega, the first and the last,” that is, he is the same God that came at\nfirst as Adam and last as the Lamb of God. It is claimed that the\nRevelations were stolen and the original was written before the Fish God\ncame. In verse 12, John saw seven golden candle-sticks, typifying the\nseven christs or lights of the world, “and one of the seven was like\nunto the Son of Man.” The Persian fire god Agni is called the Son of\nMan, and it is claimed that John got the Revelations from the Persians.\nIn the Clementines St. Clement says: “Christ, it is said, has changed\nhis forms and names from the beginning of the world.”—Clement, cap. 51.\n\nVerse 18 says: “I am he that liveth and was dead,” that is, the sun that\nwas crucified annually at the winter solstice, when it stood still for\nthree days, or remained in the tomb three days, and was reborn on the\n25th of December. “And have the keys of death and Hell.” The christ that\nwas crucified in the west, according to the Egyptian religion, was Judge\nof the Underworld and carried the keys and descended into Hell when the\nsun went down. They were the keys of Hell, not Heaven, that were\ntransmitted to St. Peter.\n\n                  *       *       *       *       *\n\nCh. 2, v 7 says: “To him that overcometh will I give to eat of the tree\nof life,” which being interpreted means that the successful candidate or\nworthy brother will be permitted to eat the male emblem. Verse 17 says:\n“To him that overcometh will I give to eat of the hidden manna,” which\nis a small round cake or wafer in the Mithraic Mysteries, representing\nthe female emblem. In these Mysteries they killed a lamb or bull christ\nand sprinkled the candidate with its blood, as we drink the blood of\nChrist and eat his flesh in the depths of our beastial ignorance,\nsuperstition and depravity.\n\n“And will give him a white stone, and in the stone a new name written,\nthe Word, which no man knoweth save him that receiveth it.” This stone\nis the symbol of Siva, and the new name is Ling, the secret, the\nSanscrit name of the Word. St. Clemens says: “It is difficult to exhibit\nthe pure and transparent Word to swinish hearers. (All are swine except\nthe priests and ministers.) For nothing they could hear would be more\nludicrous to the multitude. The truly sacred Word is deposited in the\nshrine (Monstrance). It is improper that these emblems should be exposed\nto those who have never been purified in soul. The Mysteries were\nestablished because it was wise that the holy and blessed contemplation\nof realities be concealed.”\n\nIn Ch. 4, v 3, the four beasts and the four and twenty elders, the\nangels and saints and all the other vermin in Heaven fall down and knock\ntheir foreheads on the ground, groveling in abject baseness, servility\nand degradation before the sardine stone or pillar that sits on the\nthrone in the royal arch of the rainbow, and before the beast, (the\nbull). This lovely pillar is worshipped throughout India. You will find\nthe above scene and this foul worship depicted in Inman’s A. P. & M. C.\nSymbolism, Plate XIX. John has set a foul pagan idol on the throne of\nHeaven.\n\nCh. 12, v 1. The woman clothed with the sun and the moon under her feet,\nwith a crown of twelve stars, is Mary, the moon goddess, the wife of the\nsun-god, and the crown of twelve stars are the twelve christs that she\nbore, or that crowned her labors in the twelve signs of the zodiac. The\ndragon that waited to devour the child is called Herod in the other\nstory of Mary and Jesus. In the Hindu myth, from which this is copied,\nthe woman fled to the wilderness, as Mary fled to Egypt. According to\nanother astronomical legend, when the sun-god is born on the 25th of\nDecember, old King Sagittarius, the Archer or Herod, who lives in the\nnext house (November), tries to kill the Son of God with the arrow of\ndeath.\n\nIf you refer to an astronomical chart, you will see depicted there all\nthe gods that ever existed. In the first sign, Leo, is the Lion of the\nTribe of Judah, the christ that came in the Golden Age, 12,934 years\nago, a Jew god, that would not do a thing to you but rend you and steal\nyour shirt.\n\nIn the sign of Gemini you see the Twins, or Castor and Pollux, or Cain\nand Abel, or Romulus and Remus, or Solomon and Adonijah, or Jacob and\nEsau. Cain has a club in his hand, with which he kills his brother god,\nas Romulus killed Remus and Solomon killed Adonijah. In the sign of\nTaurus, you will see Auriga, a Mystic of high degree kissing the goat,\nand Orion, the Lord of Darkness, killing the bull christ. And there is\nthe triangle of seven stars that Christ held in his hand. This is the\nsolar system of the Pleiades, of which the great star Alcyone is the\nsun, and around which the whole universe revolves. It is the Kingdom of\nHeaven and the home of god and his sons Jesus and the Devil.\n\nIn the sign of Aries, you see the Lamb of God and the christ Perseus,\nwho has just amputated the Medusa’s head and destroyed the serpents of\nwhich the hair was composed. In the next sign of Pisces is the beautiful\nAndromeda (mother of men), or Mary, bearing the fish-god, the Son of\nMan, under her arm, as Isis bears it on her head. In the sign of\nScorpio, you will see Christ or Orpheus overcoming the Great Serpent.\nAnd another christ, Hercules by name, holds a club in one hand and two\nserpents in the other, to whom, as representing the Devil or the\ninfernal god Cerberus, he is about to administer, in the classic\nlanguage of modern ministers, a good wallop.\n\n“When the sun shall have passed through the sign of Virgo, the Great\nCycle of 25,868 years will be ended. The sun then enters the sign of\nLeo, and this junction of Virgo and Leo, this secret of the Great Cycle,\nis expressed in the Sphinx of Egypt, the woman and the lion conjoined.\nThis is the mystery of the ages, the pillar on the border of Egypt,\nwhich shall be for a sign and a testimony.”—Daughter of the Druids, 276.\nIt is said that in that great Day Draconis will again be the pole star,\nand the great pyramid is so constructed that at the end of the Great\nYear the light from Draconis will again shine through the passage in the\npyramid that leads to the Bottomless Pit, or the dragon will be cast\ninto the Bottomless Pit.\n\nIn the sign of Virgo is the Virgin Mary, the mother of all the gods, and\nthe Great Serpent will be seen waiting there for her to deliver another\ngod for his consumption. Ch. 5, v 1, says that the book was sealed with\nseven seals, corresponding with the seven comings or avatars of Christ,\nwhen the book was opened or the word was preached. When the first seal\nwas opened, Christ appeared as Sagittarius, the Archer. “And behold a\nwhite horse and he that sat on him had a bow.” When he had opened the\nthird seal, behold a black horse, and he that sat thereon had a pair of\nbalances in his hand. This is the Christ that came in the sign of Libra\nor the Scales, who weighed them in the balance and found them wanting.\n\nCh. 4, v 6. The four beasts referred to are the four hieroglyphic beasts\nof the priests and magicians, which they placed on the playing cards of\nEgypt, the lion, the bull, the man and the eagle. They are zodiacal gods\nand sit in the North, the East, the South and the West respectively. The\nchurches declare truly that a pack of cards is the Devil’s book. Cards\nwere invented by the priests, and they are reeking with sacred, occult\nand religious emblems. The pack is composed of four sets of ten. Ten is\na Kabalistic sacred number, for there are ten persons in the Hebrew\nGodhead, and 10 or IO is the name of God. Then there are the four beasts\nor aces, and the Trinity is represented by the king, queen, and jack.\nThe clubs, or the three sacred balls of the Jews, are the symbol of the\nmale god and the Trinity. Any deeper meaning can only be disclosed to\nthe initiated. The heart is the cup or chalice or Eye of Isis, the\nsymbol of love. The queen of hearts is clothed with the sun and moon,\nand she is Mary, the Queen of Heaven. The Queen of spades holds in her\nleft hand the sacred candle, and she is adorned with another male\nemblem, the fleur de lys, and in her right hand is the flower of Isis, a\nfemale emblem, the same as the circles and rosaries with which she is\nalso decorated. The seven circles are the emblems of the seven joys that\nMary had. The twelve precious stones in the jewel on her breast\ncorrespond with the twelve christs she bore and the twelve jewels in the\nEphod of the high priest.\n\nThe jack of hearts carries the male emblem in his hand and the three\nlinks are on his belt to show that he is an Oddfellow in good standing.\nThe jack of spades holds up the three links, and the spade itself is a\npatent, combination, hermaphrodite, religious emblem of sufficient magic\npotency to save from the pains of Tophet all who gaze upon its sacred\nand occult form. The king of hearts performs the occult and saving rite\nof putting the sword or cross through the crown. This crown is adorned\nwith shamrocks, and on his coat he wears the seven hearts or chalices.\nHe belongs to the zodiacal sign of the Lion, and this is the heart sign,\nand in it is found the constellation of the Chalice. And he holds his\nhand on his breast like Buddha to show that he is a Mason in due form.\n\nRev. 7-4. The angel seals in their foreheads 144,000 Jews with the Signa\nTau or Word, the signet of the Living God. The devotees of Siva also\nwear this Tree of Infamy on their foreheads. John says that it is the\nFather’s name written in the forehead. Only those sealed with this Baum\nBosheth can sit with Abraham, Isaac and Jacob and the other beasts\naround the Throne. All but the 144,000 Jews can go to Hell. The priests\ndraw the cross or Signa Tau in ashes on the foreheads of their devotees\nevery Ash Wednesday.\n\nRev. 16-12. And the sixth angel poured out his vial upon the earth, and\nI saw three unclean spirits, like frogs, come out of the mouth of the\nDragon and out of the mouth of the beast. For they are the spirits of\ndevils which go forth unto the kings of the earth to gather them to the\ngreat day of God Almighty. The sixth angel is the angel of the sixth\nsign of the zodiac, our present sign, the Waterman, and the nations of\nthe earth are now fighting the battles of Armageddon. We are now at the\nend of a Great Cycle. The end of the world has come according to the\nastrological and theological fakirs, and the inhabitants of the earth\nare again being destroyed, this time by fire and sword. Christ now comes\nto bring a sword upon the earth.\n\nAccording to the Christians, all the nations engaged in the war, save\ntwo, march forth under the banner and protection of Jehovah, the God of\nBattles, and he divides himself into two persons and, perched upon two\nclouds, commands the two contending hosts, urging them on to kill each\nother. After this holocaust of blood and carnage, there will be found no\nfool so utter as to assert that God rules the destinies of mankind.\n\n\n\n\n                             CHAPTER XVIII.\n\n                              The Clergy.\n\n\nThe Presbyterian clergy or sorcerers of Scotland, of old times, claimed\nthat they could consign their deluded victims to Heaven or Hell by a\nword, and could by their magic power strike with death any enemy of God,\nthat is, the clergy. They would not allow anyone to remain in town who\nfailed to go and hear their sermons. Buckle says the clergy kept the\npeople in a worse than Egyptian bondage, inasmuch as they enslaved mind\nas well as body.\n\n“John Knox sanctioned the murder of the Roman Archbishop Beaton of\nScotland in 1548, and shut himself up with the assassins in the palace\nof the Archbishop. When the Catholic power was destroyed in Scotland by\nthe nobles in 1560 and the church property confiscated by them, the\nProtestant clergy claimed that it was impious to secularize\necclesiastical property, and that they should be endowed with the spoils\nof the war, that it was right for the Lords to plunder the Church of\nRome, but the loot should be turned over to them. They said that what\nrightly belonged to them was devoured by idle bellies. The Presbyterian\nclergy said that King James was a traitor and had seven devils inside of\nhim, and he ought to be seized. And their associate in crime, the Earl\nof Gourie, entrapped the King into his castle in order to murder\nhim.”—Buckle’s Hist. Civ. 2-201.\n\nThe Presbyterian clergy said that cheerfulness was to be guarded\nagainst. Smiling, provided it stopped short of laughter, might\noccasionally be allowed, still being a carnal pastime, it was a sin to\nsmile on Sunday. A Christian has no business with love or sympathy. He\nhas his own soul to attend to, that is enough for him. On Sunday in\nparticular he must never think of benefitting others and thus break the\nSabbath. On no occasion must food or shelter be given to a starving man\nunless he is a Presbyterian.\n\n“In priest-ridden Spain, Charles V, the tool of religion, in his will\nprovided that all heretics should be put to death and that the\nInquisition should be upheld. Under his orders, according to Grotius,\n100,000 persons were beheaded, buried alive and burnt at the stake in\nthe Netherlands. Phillip II, of Spain, said it was better not to reign\nat all than to reign over heretics. The Duke of Alva, in this reign,\nboasted that in five or six years he had put to death in cold blood more\nthan 18,000 heretics, beside a still greater number of infidels he had\nslain on the battlefield.”—Idem 2-14.\n\nWhen it was proposed to expel from Spain the remnant of Moors remaining,\nwho had turned Christians and were baptized by force, Bleda, the\nDominican, said that every Moor in Spain should have his throat cut,\nbecause it was impossible to tell which of them were Christians at\nheart, but God knew his own and he could sort them out. About one\nmillion of the most industrious inhabitants of Spain were hunted out\nlike wild beasts. Many were slain as they approached the coast, others\nwere beaten and plundered, and the majority in the most wretched plight\nsailed for Africa. During the passage the crew in many of the ships\nbutchered the men, ravished the women and threw the children into the\nsea. From this time Spain began to degenerate. The tyranny of religion\nwas supreme. While every other country was advancing, Spain, numbed into\na death-like torpor, spell-bound and entranced by the accursed\nsuperstition, presented to Europe a solitary instance of constant\ndecay.“—Idem, 2-53.\n\n“The French Revolution freed the world from ecclesiastical tyranny and\nopened an unobstructed path to Napoleon, who had given the death blow to\nthe Inquisition, the great slaughter house, where they butchered in the\nname of the Lamb.”—Isis Unveiled, 2-22.\n\nThe Brahmins, the clergy of India, were quite as disreputable as the\nothers. The Institutes of Manu provided that if a common person molested\na Brahmin, he was to be put to death. If he sat on the same carpet with\na Brahmin, he was to be maimed for life. If he listened to the reading\nof the sacred books, burning oil was to be poured into his ears, and if\nhe committed them to memory, he was to be killed. If he spoke\ndisrespectfully of a Brahmin, an iron stile ten fingers long was to be\nthrust red-hot into his mouth. To give to the Brahmins or will them your\nproperty was an act of the highest piety.\n\nThe laws of the clergy in certain provinces of France, ruled by them in\nold times, provided that every man that died without bequeathing part of\nhis estate to the church, should be deprived of the Sacrament (and would\nconsequently go to Hell). If he died without making a will, his\nrelatives were obliged to prevail upon the Bishop to appoint arbitrators\nto determine what sum the deceased should have given to the church in\ncase he had made a will. At one time in France, “married couples could\nnot sleep together the first three nights without purchasing leave of\nthe church.”—Montesquieu’s Spirit of the Laws, 665.\n\n“Pope John XII was assassinated in the arms of his mistress.\nCrecentious, the illegitimate son of John X, caused Benedict VI to be\nmurdered. His faction elected Boniface VII, and a third faction elected\nJohn XV, who was put to death by Boniface. We find shortly after 1044\nBenedict IX, a boy of twelve, and Rholeme and Sylvester III all reigning\nat the same time, and all leading the most profligate and scandalous\nlives.”—Doubts of Infidels, 95. Bishop Hopkins says that “the great body\nof the clergy before the seventh century were steeped in licentiousness,\navarice, simony, cruelty, violence and blood. They consecrated every\nvice in the interest of so-called religion, they graduated sins by\npecuniary amercement, they commissioned assassins, having pardoned them\nbefore the commission of the murder.”\n\nThe priests or Magi of Persia, as ecclesiastical bandits, were\nunexcelled. The people had to give up one tenth of their income to these\nmagical fakirs. Every woman in Babylon was obliged to offer her person\nfor sale one day in the year at the temple of Astarte, and the money\nwent to the priests. The pirates of Babylon ransacked the world and\nbought or stole the most beautiful women on earth for the use of the\npriests, who made a pretence of offering them up as human sacrifices to\nBaal. The god held in his hand the appropriate symbol of the traffic,\nthe circle and the pillar, that may still be seen in nearly all\nchurches. The beautiful sacrifice was placed on the lap of the god in\nthe presence of the audience, to be devoured by the lions that\nsurrounded the god. But after the meeting the priests drove the lions\nout and stole the sacrifice, as priests always did steal the offerings\nfrom god.\n\nThe Egyptian priests were the rulers of the whole, and owned one third\nthe land of Egypt. Besides the princely revenue from this immense landed\nestate, they received, in addition to their salaries, all the offerings\nand sacrifices that the fools gave up as an atonement for sin. A very\nlarge part of their income was derived from the Bethel or Brothel\nmaintained around the temple of the goddess Hathor, the cow, the wife of\nthe god Ammon, which is another name for the Ram god or the lamb of god.\nEvery woman in Egypt was obliged to sell herself for one month at this\ntemple. And then, besides, there were the regular sacred ladies who\nlived constantly in the temple. The priests chose the most beautiful,\nthen the remainder were turned over to the mob of pious dupes and\ndevotees. The young lady who earned the most money for the priests was,\nin the after life, assigned by Osiris, alias Yahvah, to a seat beside\nthe Golden Throne. This rotten pagan church subsequently changed its\nname to Christian.\n\nCalvin, the blood-drenched, the fiend incarnate, one of the founders of\nthe Protestant Churches, compelled his lady parishioners to confess on\nthe rack their indiscretions, and then threw them naked into the lake\nand drowned them. He hanged a child for cursing its parents, burned old\nwomen as witches, and burned alive Michael Servetus for contradicting\nMoses in asserting that Palestine was a desert that did not flow with\nmilk and honey. Calvin died in convulsions of fear, raving and cursing\nbecause he thought he was going to Hell.\n\nOliver Cromwell, the pious Puritan, the murder demon, the regicide, the\nusurper, with the Bible in one hand and the sword in the other, rode at\nthe head of his army of religious fanatics singing psalms. This\nsanctified Christian, upon the capture of Drogheda, Ireland, himself\nreported to Parliament that he massacred two thousand of the garrison.\nHe fired St. Peter’s Church, to which the people had fled, and put a\nthousand of them to the sword. All the friars were killed but two. And\nthe likes of him settled Boston and robbed and murdered the Indians. One\nof these Puritan buccaneers, named Will Bartlett, in Boston, in 1637,\nwas sentenced to be set in the stocks, with his tongue in a cleft stick,\nbecause he got drunk and cussed and swore and refused to go to church on\nSunday.\n\nIn those blithesome days a citizen could not vote unless he belonged to\nthe Congregational Church and kissed the big toe of Cotton Mather, the\nsuperstitious bigot, the Prosecutor of the New England Protestant\nInquisition. Ridpath says that Mather was chiefly responsible for the\nhorrors and crimes of the Salem Witchcraft, and that this massacre,\ntorture and imprisonment of 263 innocent persons was started by a Salem\nminister for the purpose of revenging himself upon those of his flock\nwho antagonized him.—Ridpath’s Hist. of U. S. 131. The Quakers were\nperhaps the only decent body of Christians up to that time, and for that\nreason the Puritan pirates and slave-dealers hung four of them, one\nwoman and three men, on Boston Common.\n\n“Infuse a few different kinds of religious poison into a community of\nhuman beings, and they hate each other like tigers. Religious creeds\nhave a worse effect on a man than booze. You can work the booze out of\nyour system and quit the stuff, but when a victim is loaded up on some\nrotten brand of orthodoxy, it is hard to do anything with him. A\nProtestant will damn the Catholics, and a Catholic will yell ‘To Hell\nwith the Protestants,’ and both will hate the Jews.”—Roman Religion, 27.\n\nThe churches have soaked the earth with the blood of their countless\nvictims. Frederick, the Emperor of Germany, sentenced heretics of all\ndescriptions alive to the flames. Sixty thousand heretics were\nslaughtered in the city of Beziers. Seventy thousand Huguenots were put\nto death in France. The Massacre of St. Bartholomew began at midnight,\nAug. 23, 1572, and the carnival of death lasted seven days. Medals\ncommemorating the holy event were distributed among the loyal\nbutchers.—Roman Religion, 35.\n\n“When the Crusaders took Jerusalem from the Moslems in 969 A. D., they\nmassacred all the Mussulmans and burned the Jews alive. Seventy thousand\npersons were put to death in a week to attest the superior morality of\nthe Christians.”—Boston Sun. American.\n\nDr. Fernald says that Sultan Bejazet wrote to Pope Alexander VI that he\nwould give him 300,000 ducats, several cities and the shirt of Jesus\nChrist if His Holiness would kill Zimzim, the brother of the Sultan,\n“and you Most Illustrious Lord will not commit a crime, since by your\nreligion Christians are ordered to exterminate heretics and infidels.”\nThe Ency. Brit. says that “the unfortunate prince was murdered by\nAlexander, who received 300,000 ducats as the reward of the crime.”\nZimzim was held captive by certain bandits in Rhodes, a Commandery of\nthe Knights of St. John, a Christian organization under the domination\nof Alexander. Alexander was a Borgia, whose children were all\nillegitimate.\n\n\n\n\n                              CHAPTER XIX.\n\n                               The Bible.\n\n\nAs the Old Testament was originally written without vowels, the Lord\nonly knows what it meant. The best the copyists could do was to make a\ngood guess at the meaning, or supply whatever vowels suited their\npurposes.—See Ency. Brit. 3-64.\n\nMoses was a magician, a thief and a murderer according to the Bible, a\nfakir who foisted upon the Hebrews a magnificent system of priestly\nplunder. In pursuance of Moses pretence that the world was created in\nsix days, and that their god El or Bel or Baal rested on the seventh, he\ncommanded the people to refrain from labor on that day and go to church,\nso that he would have frequent opportunities to pick their pockets. The\nstory of Moses’ birth and secretion in an ark of bulrushes was taken\nfrom the Babylonians, where it was applied to King Sargon, according to\ntablets excavated at Babylon.\n\nThe great, learned and profound Irenaeus says that there must be four\ngospels because there are four winds of heaven. This is a fair sample of\nthe logic of theologians. The fact is, there are four gospels because\nthose four jumped from the floor onto the table at the council of Nice.\nThere was at that time so much doubt as to what alleged sacred writings\nwere inspired by God, that the delegates put them all together under the\ncommunion table one night at the close of the session, and agreed that\nthose that got up on top of the table during the night should be\nconsidered as inspired, and those that were too weak to get up on the\ntable should be stamped as the work of the Devil.\n\n“Many of the bishops in these councils were ruffians and were followed\nby crowds of vicious supporters, who stood ready on the slightest excuse\nto maim and kill their opponents.”—Keeler’s Hist. of the Bible. Tichenor\nsays that “they decided all holy questions by a vote or a knock-down\nfight. It is doubtful if any of them drew a sober breath during the\nentire proceedings.” Millman says that “they fought in the streets and\nmuch blood was shed.”—Millman’s Hist. Christianity. “What these drunken,\nfighting, ignorant, pagan priests declared to be received from God, that\nis what is taught as Divine to-day. To this day they cram their\nabominable lies of devils and damnation into the brains of little\nchildren. The miserable, crazy creeds of Christendom were concocted by\nthese brawling pagan priests, and their poison still pollutes the souls\nof men. Fire all the gods of all the creeds into the melting pot, and\nout comes the brazen face of Mammon.”—Tichenor.\n\nAnother reason why there are four gospels, according to Irenaeus, was\nbecause the Cherubim had four faces. But he thus calls attention to the\nfact that Christianity was spawned in the sties of paganism, as the Jews\ntook the four beasts of the Cherubim, the bull, the lion, the eagle and\nthe man, from the idolatrous Babylonians. And the four Evangelists\nadopted the four beasts as their totems and placed their beastly images\non the four gospels. The Maya Indians and the Mexicans worshipped the\nsame four idols of the four quarters of the heavens.—Ency. Brit. 12-823.\nThe priests of the Ojibways wear the horns of the bull and sacrifice to\nthe dragon or great serpent (Mary) that wears on its head the crescent\nmoon. They also worship the eagle and the Tree of Life. The Ojibway\npicture writing shows that the Indian Adam and Eve had the same\ndisgraceful scandal in the garden of Eden. See “Indians,” Ency.\nAmericana.\n\nIt is claimed that Apollonius of Tyana (alleged to be the original of\nPaul and Christ) came through a medium and said: “Nine epistles were\nmade a present to me by Pharaotes, a Satrap of Taxila, between Babylon\nand India. These epistles contained all that is embraced in the present\nepistles claimed to have been written by Paul. Further, I retired to the\nIsle of Patmos in 69 and 70 A. D. and wrote in a trance state an almost\nidentical story with that attributed to St. John. The Christian Gospels\nwere all preached by me at Jerusalem, Ephesus, Philippi, Rome, Antioch,\nAlexandria and Babylon, and in all those countries I healed the sick,\ncured the blind and raised the dead. The original of the four gospels I\nobtained at Singapore. They treated of the four stages of the life of\nBuddha.”—Antiquity Unveiled, 21.\n\nMoses and God were mad at the Midianites because the Jews had entered\ninto the tents of the Midianite ladies and worshipped Baal Poer, from\nwhich ensued a plague among the Congregation of the Lord. Num. 31-18.\nAnd they warred against the Midianites, as the Lord commanded, and slew\nall the males and took all the women and children captive. Moses was\nwroth because they had saved all the women and children, and ordered all\nthe males among the children to be killed and all the females to be\nturned over to the soldiers for outrage. And he ordered all the women\nmurdered except the virgins, of whom 16,000 went to the soldiers and\n16,000 to the people, but the soldiers and the people were compelled to\npay of these into the storehouse of the Lord 3200 in tithes. “And the\npriests laid with the virgins at the door of the Tabernacle.” Such a\nmonstrosity of iniquity, such a fiend incarnate from the shades of Hell\nis the senior member of the firm of Moses and the Lamb.\n\nThe history of Moses is copied from the history of Bacchus, who was\ncalled Mises by the Egyptians. Like Moses, Bacchus was born in Egypt, he\nsojourned on Mt. Sinai, he passed through the Red Sea on dry land, he\nwas a lawgiver and wrote the laws on two tables, he was found in a box\nthat floated on the water, he smote a rock and wine gushed forth, and\nBacchus was worshipped and these deeds of his sung in Egypt, Phenicia,\nSyria, Arabia and Greece before Abraham’s day.—Doubts of Infidels, 31.\n\nThe account of creation as given in the Bible has been found on tablets\nin the ruins of Nineveh, written in a language that was dead and buried\nbefore the Jews ever existed. In this Persian cosmogony the name of the\nfirst man was Adomah, and of the woman Hevah.\n\nThe Greeks said miracles for fools. Paul boasts of lying for the glory\nof God and catching converts with guile. Chrysostom said: “Great is the\nforce of deceit.” St. Hermas, an Apostolic Father, said that he always\nlived in dissimulation and affirmed a lie for truth to all men.— Doubts\nof Infidels, 78.\n\nYou will see that the Bible is dedicated to King James, and that he is\ncanonized in the dedication, probably because he kept fifty mistresses\nand was in the habit of becoming beastly intoxicated without\nprovocation.\n\nThe only real revelations received by the priests and prophets of any\nreligion were spirit messages, and the Lord only knows whether these\nwere from God or the Devil, from good or bad spirits. In fact it is\nclaimed by some spiritualists that all the good spirits are in Heaven\nwith God and can’t get out. In other words, they are in limbo, while\nthose that were not so good are at liberty to visit the loved spots and\nfond friends of earth and indulge on the astral in their favorite\npastimes, whether it be a prayer meeting or a poker game. This is\npurgatory, the next story above Hell, which is the earth.\n\nGibbon said that Eusebius was a consummate liar. The Gospel of Matthew\nand the Epistle to the Hebrews were his work, taken from the lives of\nChristna and Apollonius and the records of the Essenes and some of the\nJewish and Phenician legends.\n\nA Coptic version of the life of Apollonius in the possession of the\nmonks of Seville, Spain, about 1458, was placed in the hands of Juan\nHermonez for translation. In the margin was a Latin translation, in\nwhich the name of Apollonius had been changed to John among many other\nfalsifications. The Latin translation was almost identical with the\nGospel of St. John. When Hermonez called the attention of the Superior\nto these changes, he was seized and thrown into a dungeon, in which he\nwas allowed to starve and rot.\n\nThe Bible has been too much neglected, due, no doubt, to the general\nimpression that, being religious, it must be dry. Far from it. For\ninstance: Elohim, the gods, made the light and days and nights four days\nbefore they made the sun. They made a firmament, probably of metal, to\ndivide the ocean above from the ocean below, and had windows in it, so\nthat they could open them and drown the inhabitants of the earth\nwhenever they got drunk and needed a little diversion. And they stuck\nthe sun, moon and stars in the metal firmament, which revolved around\nthe earth.\n\nWhen the serpent was not working, he was coiled around the Tree of Life\ntelling Eve in snake language what luscious fruit the tree bore. For\nthis interference with the plans of the gods, they made the serpent\ncrawl on his belly. He had been crawling on his back.\n\nMoses and his first assistant fakir, Aaron, destroyed all the horses and\ncattle in Egypt by a murrain, and then, as Pharaoh still had a stiff\nneck, they destroyed them all again by hail. Then, as Pharaoh still had\ntrouble with his neck, they killed all the first-born of Egypt, both men\nand cattle. Then the Israelites fled, and Pharaoh hitched up his horses,\nthat had been killed three times, to his six hundred chariots and\npursued the chosen of God, who had pinched all the jewelry of the\nEgyptians. The Bible is full of these delightful stories from beginning\nto end. If you have conscientious scruples against reading the Bible,\nyou will find them attractively set forth in Le Brun’s Doubts of\nInfidels.\n\n\n\n\n                              CHAPTER XX.\n\n                                Heaven.\n\n                    The Lord doeth all things well.\n                    He consigns the Jews to Heaven,\n                    And all the rest to Hell.\n\n\nThere are forty nine heavens to which we ordinary mortals may attain, so\nyou needn’t worry. Besides, there are certain aristocratic heavens\nreserved for the great and good men of high spirituality, such as Moses,\nthe fakir, thief and murderer, and David, the bandit, outlaw and\nassassin, and Solomon, the fratricide, Mormon and pillar of Ashtoreth,\nand all the popes, bishops, priests and ministers. We will each go to\nthat place we like the best, and to which we are fitted by our\nvibration. Some of us, like certain ministers, will go to that heaven\nwhere the beautiful fairies are. The ancient Jews will have a little\nheaven of their own, where they can worship the three balls and the\nass-headed god and the god with whiskers on, and where they will have a\nchance to cop the golden paving stones, and sell corner lots, and insure\ntheir palace not made with hands eternal in the heavens.\n\nAnd the ancient Scotch Presbyterian will walk the golden streets with\nhis savage, gore-imbued devil-god, in his paradise overlooking the abyss\nof Hell, where he can gloat over the souls in torment, as they rise up\nout of the Bottomless Pit every thousand years, each one fastened by his\ntongue to a hook on an endless chain, which rises from such a fathomless\ndepth of hellfire that it takes the victim a thousand years to make the\ncircuit. It is claimed that these heavens and hells are built up from\nthe astral substance by the imaginative power of the minds of the\ndifferent religious sects.\n\nThis region contains all the heavens that have ever been dreamed of in\ntheology, each filled with the devotees of the various creeds. Each of\nthe great religions has its own particular region in which its disciples\ngather, worship and rejoice. In each region the religious soul finds\njust what he had expected and hoped to find on the other shore. You may\neven see the golden crowns, harps and stiff halos in some cases and hear\nthe eternal chant of praise. These heavens are not eternal. Everything\non the astral plane is subject to change like all other matter. Even the\nreligious progress and change their opinions.—Astral World, 70.\n\nThe occultists do not, as a rule, disclose the process by which you may\nsee the astral visions and pass out of the physical and journey in the\nastral body. But this is one way to see the pictures in the astral\nlight: Between sleeping and waking, in the neutral state of Jagrata,\nwhen the eyes are closed and a numbness falls upon the body, and you\nexperience a floating sensation, take note of the visions that appear to\nyou, if any, and then by your will power impress them upon physical\nbrain, so that you may remember them. These visions may be pictures on\nthe astral light or scenes on the astral plane, but whatever they are,\nsome of them prove to be true prophetic visions.\n\nOne occult teacher advised those who wished to induce trance to go into\nthe silence, that is, to go into a room by yourself, where you will not\nbe disturbed, and lie down and completely relax the muscles and think of\nnothing at all. The Hindus say fix your mind on your navel, but some fix\ntheir gaze on a crystal. You will see the visions when you doze off, if\nyou can get them at all.\n\nWhen you are in the astral body it is possible to remember the\nexperiences of your previous lives, that is, the lives of your\nancestors. In the physical body heredity and memory are stored in the\ncromatin or brain matter of all the millions of cells of the body. The\nhuman astral body is made up of the astral bodies of all the cells. It\nis possible that memory is inherent in the astral matter of all the\ncells, and that in the astral we are more in rapport with the cells than\nin the physical.\n\nIn the lowest astral plane next to the earth, it is said, is the region\nwhere the astral shells or corpses disintegrate, an arm sloughing off\nhere, a leg there, and a head elsewhere. It is claimed that the spirits\nhave deserted these shells. If you should happen to meet one of these\nghosts walking in a graveyard without any legs or without any head, it\nmay scare you into a fit, but it will not do you any harm, for it is\ndead. Then there are certain spectres or phantoms whose company is very\nundesirable when you take a lonely walk in the ghoul-haunted woodlands.\nThese elemental spirits like to play practical jokes and have a little\nfun with you, but they will not do you any harm, unless you are\nsufficiently weak to allow them to obsess you. Cast out fear, cultivate\na strong will, and be, like Solomon, the master of demons and men.\n\n“There are certain entities or beings in the astral world which never\nwere human and never will be, for they belong to an entirely different\norder of nature. They are fairies, satyrs, imps and goblins. At\nspiritual seances they sometimes play elfish pranks. They seem to be\nparticularly apt to play tricks on neophytes in psychic research who\nseek to penetrate the astral without proper instruction. To such a one\nthey appear as hideous forms, monsters &c.”—Astral World, 92.\n\nSome of the elementals are electric spirits and confer upon the medium\nthe power of magnetic healing. The medium, upon the approach of the\nspirit, is charged with electricity. The spirit may appear as a bird\nwith a human face and a parrot’s bill and sharp, black eyes and body\ncovered with hair, and deliver messages which can be heard\nclairaudiently by the medium. That reminds us of the claim of Mahomet\nthat a little bird stood on his shoulder and whispered the laws of the\nKoran in his ear. They are certainly the Devil’s own laws.\n\n“Many of the angels on the astral and the ghosts that haunt houses are\nthought forms created by the people who imagine them, and obtain all\ntheir apparent mind from the action of the thought force of their\ncreators. Repeated thought and repeated belief will serve to keep alive\nand strengthen these entities, otherwise they will disappear in time.\nMany supernatural visitors, saints and semi-divine beings of all\nreligions have been formed in this way. The power of the devils arise in\nthe same way.”—Idem.\n\nAccording to the Theosophists man has two souls, the animal and the\nspiritual, and at death the animal soul or spook, together with the\nspiritual soul, passes to that part of the astral called Kamaloka, or\nplace of spooks, the lowest plane. But the spirit soon deserts the spook\nand leaves it to meet its just reward in the second death, because on\nearth it desired too much of carnal pleasures. The spooks retain all the\nimpressions accumulated in the earth life and can communicate with\nmortals through mediums. Among these are the demons that obsess human\nbeings. The spiritual soul passes on to Devachan, or the house of gods,\nwhich evidently includes those astral planes where the religious grovel\nbefore their various imaginary idols. See “What is Theosophy,” 46. This\nalleged spiritual soul, that deserts its brother soul in the depths of\nHell, receives its due reward, for in the sub-heaven to which it goes,\nit has no memory of the earth life, consequently it is not immortal, and\nit is in jail and cannot get out. It would be better to stay in Hell\nwith the spook, for it could have more fun haunting houses than\nworshipping imaginary gods with a lot of stiff-necked orthodox\nhypocrites.\n\nIn Ceylon they have twenty six heavens, and at the end of the world\nperiod they kill off all the spirits in all these heavens except those\nin the five upper spheres, the four highest of which are Nirvana.\n\nYou need not think that because you go across that you will have\nsurcease from sorrow. It is only in the highest heavens that they have\nno sorrow, and that is because they don’t know anything. You cannot\nobtain happiness here or hereafter by purchasing absolution from any\nfakir, but only by doing to others as you would be done by. The astral\nplanes of the Spiritualists in which the soul may advance, improve and\nultimately attain to the highest heaven, corresponds with Purgatory,\nthat superlative graft of religion. You can be prayed out of this limbo,\nif your relatives are willing to put up the stuff, otherwise you will be\nshoveled down into Hell. But a cheaper way is to have a Hindu prayer\nwheel. I am going to devote the immense revenues which I shall receive\nfrom this pious work to the construction of prayer wheels, which will be\nplaced at street corners on all the highways and byways, so that even he\nwho runs can turn the wheel and bring around to the open slot, so that\nGod can see it, one of the many prayers printed on the wheel, for\ninstance: “O, God, save my mother-in-law from Hell.”\n\nIn the coma, between sleeping and waking, the gates of the astral world\nare sometimes opened, and you can see the ghosts on the astral plane,\ngreat throngs of spirits, having no indication of piety, all busily\nengaged in their favorite occupations or sports. If in this state of\nJagrata you happen to float into a graveyard, you will see the ghosts\nlying or sitting on their graves or pacing up and down beside them with\nbowed heads and in deep thought, trying to figure out how they got there\nand where they are going. See Seership, 179.\n\nIt is said that two persons can exchange bodies if they wish. Or if\nsomeone else has a better body than you have, and you wish to steal it,\ninvite him to take a trip with you in his astral body on the astral\nplane. All the time keep commanding your astral body, sotto voce, to\nenter into his body, and when his astral body has emerged, prepared to\ntake a trip with you in spook-land, that is the instant for your astral\nbody to take possession of his physical body and leave his astral body\nout in the cold. But be careful to back into his body, for if your\nastral body enters his physical body face to face, you will be in wrong\nend to and will be crazy as a loon. Now there is no place for the other\nastral body to go except into your abandoned physical body, and as you\nare a wicked robber who just stole a house, he will probably hesitate\nabout entering the body of such a person, and if he delays too long, he\nwill be a lost spook, condemned to wander forever in the land of shades.\n\nDo not allow them to palm off any gods upon you. Do not allow anyone to\nassume authority over you. I charge you to teach your descendants these\nthings from father to son, down through the clanging corridors of time,\ndown through the endless vista of eternity. There is nothing but matter\nin the universe, and all matter is equal. This being so, all forms\nproduced therefrom, whether visible or invisible, must be equal, and one\nform has no right to assume authority over another. All beings are\ncomposed of matter, be they gods or be they worms, and no one mass of\nmatter is superior to another or worthy of worship. The worm that crawls\nthe earth is the equal of the king that sits upon a throne. Never bow\nthe knee to anything that walks or swims or flies, that lives in the\nflesh or that exists only in the diseased imagination of depraved\nreligious fanatics. Remember this: There is none greater than you in\nHeaven or Earth or Hell.\n\n\n\n\n                         THE DEVIL’S HALF ACRE.\n                          By Willard Bartlett.\n                           _From the Beacon._\n\n\nIn rummaging through the attic of an old wraith-haunted, country house,\nI discovered a course of lessons in Yogi Philosophy. These lessons I\ndevoured with avidity, and practiced with assiduity the occult rites,\nuntil I could readily pass into the silence and project my astral body\nor ghost to any desired place. In fact the unruly ghost would sometimes\nquit the body without my consent and leave me stranded high and dry\nwithout any soul.\n\nOne night while I lay sleeping, my astral body left the physical and\nsped through the air, as it had a very bad habit of doing, to Hapenny,\nthe very last place on earth, the place manufactured by the Devil out of\nscraps and old junk, which he had left over after building Hell. But my\nperverted soul always insisted on going there whenever it succeeded in\nbursting through the carnal and beating down its being’s door.\n\nThe soul atom or Ego is said to be located in the Medulla Oblongata. If\nthe soul is immortal, it is probably an electron. An atom is said to be\ncomposed of ions or electrons, and probably is subject to dissolution,\nand consequently not immortal. But as no one ever saw an atom or\nelectron on account of their extreme minuteness, for the purpose of this\nveracious story, we will call the soul an atom and play it is eternal.\nAn atom is a vortex ring of ether in a constant state of vibration, and\nassumed to resemble in form a ring of smoke. Some of the Hindus claim\nthat a Purusha or soul from the countless spirit ions constituting the\nspirit principle of the universe, the akasa or astral light, becoming\ninvolved in the ether, originates the vortex movement by which the atom\nis produced. The ether is the ultimate refinement of matter, a body of\nextreme tenuity that pervades the whole universe and permeates all\ngrosser bodies. By the waves of this ether all the vibrations of light,\nheat, sound, energy, electricity and life are transmitted.\n\nThe electron is an extremely minute corpuscle or particle endowed with\nlife, mind and energy. A thousand electrons, more or less, revolve in\nthe atom at a terrific rate around a central sun, thus resembling the\nsolar system. This central sun is a male or positive electron, and all\nthose revolving about it are females or negative electrons and\nconstitute the harem of the central sun, thus establishing polygamy at\nthe very basis of life. Our solar system is an atom in a great cosmic\nanimal or god called Pan, the all-god.\n\nIn my nocturnal journeys, I thought I was clothed in the carnal body,\nbut as I was transported through the air, I must necessarily conclude\nthat I traveled in the astral body and on the astral plane, in which\nastral bodies move about and ghosts manifest, together with doubles,\nwraiths, hobgoblins and dopplegangers, to which latter class I belonged.\nThe astral body, one of the bodies of the soul, is composed of fine,\nethereal matter, and in form is a duplicate of the human body. It is\nclaimed that this body persists for some time after death, but\neventually disintegrates.\n\nMany a night I have been there in Hapenny when the body lay many miles\naway. These were not ordinary dreams. I was actually there, that is, I\nbeing in the soul atom or astral body. One night I was conducted through\na new manufactory there, which I had never seen with the mortal eyes and\nnever knew existed. But the next time I went there in the body, I found\nthe building just as I had seen it in the vision.\n\nThe favorite outing place of my doppleganger is the Devil’s Half Acre,\nor Murderer’s Paradise. It always flies to that obsessed and accursed\nspot hard by the gates of Tophet, close round the hinges of Hell.\nTraveling in the astral body, I can see both the quick and the dead, but\nas I am always out there at night, the live ones are asleep, and only\nthe spooks are abroad, prowling hither and yon in the moon’s pale rays,\nvisiting again, like myself, the scenes of former crimes. These are\nearth-bound spirits who, during life, lived out a low, degraded\nexistence, and they are bound by their own desires and the vibration of\ntheir astral bodies to these astral slums. I stood out on the old road\nin front of the dilapidated shack formerly occupied by a gun-fighter,\nand watched the astral bodies as they glided to and fro in the air.\n\nThere was Mr. B. with a red gash from ear to ear and a crimson stream of\nblood running down over the white, astral, vapor-like body. Around the\nbody was the aura, a cloudy vapor extending outward to a distance of two\nor three feet in the shape of an egg, an emanation of a dark and dismal\ncolor, corresponding to his dark and dismal career. It was in back of\nthat very shack that he cut his throat and burst the door that bound him\nto the mortal clay, crying as he passed over that he was eternally lost\nand damned, as the church had hypnotized him into believing. But that\nHell is immeasurably preferable to the Devil’s Half Acre, because the\nastral body is relieved of pain, hunger and thirst and the necessity of\nlaboring for food and clothing. In fact, I believe that we are in Hell\nnow, that this is the lowest plane of existence. In the Devil’s Half\nAcre the poor and wretched outcasts of the earth, embellished with dirt\nand clad in rotting rags, lived on three cents a day.\n\nThere was something in the atmosphere of the neighborhood that urged all\nthe inhabitants on to crime. The family life was a hell on earth. The\nplace was obsessed by the Devil and accursed of God. A village will\nacquire a character of its own. It is claimed that all the evil thoughts\nof all the vicious inhabitants of a vile place will linger in the\nsurrounding atmosphere for years and exercise a baneful influence on all\nwho dwell there. In the Devil’s Half Acre you could not take a step\nwithout treading on the crimson stain of a reeking crime. The spooks\nwere and are now as thick as Tophet there; the place is haunted by\nghosts and fiends unholy in Death and Hell bedight. It was the obsession\nof the place by the powers of evil that attracted to it all the\nnotorious criminals.\n\nThe next spook to pollute the atmosphere was that of Mr. D. who, when on\nearth, was engaged in the banking business. In his left hand he carried\na jimmy and in his right a gun, and he was peering here and there\nlooking for a safe to crack or a cashier to shoot up. He was floating\nthrough the air at a height of about ten feet, and on his forehead\nblazed the blood-red mark of Cain, and his black aura was lighted by the\nfires of Tophet. When in life he lived in the house across the road.\nFrom this house also emerged a ghost with a halter around its neck. It\nwas there with the halter he had swung himself over the battlements of\ntime and dropped into eternity. The vicious influence of this house was\nirresistible. It is well to know this law of thought obsession and avoid\nthese accursed places.\n\nThe next spirit to make its appearance was my old friend Mr. E. who came\nfrom walking up and down in the earth trying to sell the girl he led by\nthe hand. He was still on his uppers as usual, as I could see by the\nragged condition of his astral body. The accompanying aura of a\nslate-green hue, embellished with dull-red flames, indicated a low,\ndeceitful and sensual character. He stopped and, looking me over, said:\n“I remember you. Don’t you want to buy my wife here again? She is in\ngood condition now. I admit that I cheated you forty years ago when I\nsold her to you for fifty cents, but now in the astral world she is a\nvision of youth and beauty.”\n\nThen came the ghost of Mr. F., a Sunday School teacher, who operated on\na class of young ladies in the vestry of the church, that time-worn\nvestry, that well-beloved vestry, where the foundations of their\nphilosophy were laid. A very genial, loving gentleman he was too, but\nhis scholars being exceedingly frivolous, he found it necessary, in\norder to impress upon them the Divine truths, to pat them on the knees\nand sort of instil religion into them by the massage process. He has\nfound his heaven. He appeared on the astral, surrounded, embraced and\nbeloved by that same dazzling galaxy of beauties, now a star-crowned\nangel band.\n\nIt is claimed that they have schools over there, in which those who so\ndesire may be instructed in virtue and wisdom and assisted to advance.\nWhen at last they learn the great secret and discover the key that\nunlocks the horns of the bull, they pass through the low and narrow\nportal between the horns of Taurus, squeeze through the needle’s eye,\nand enter the higher heaven.\n\nThen I saw a lot of ghosts and fragments of ghosts sometimes without any\nheads, and sometimes lacking limbs, floating about aimlessly without any\nrudders, for they were dead, and their spirits had fled, leaving in the\nDevil’s Half Acre their astral shells. That is what they are called when\ntheir spirits have departed in the spiritual body and left the astral\nbody to return to the elements like the carnal body.\n\nA human being in a normal condition is unable to see an astral body, or\nghost, because the vibrations on the astral plane are too rapid for the\nhuman eye to see. The vibrations of the ultra-violet or X rays, at one\nend of the spectrum are too rapid, and the infra-red rays, at the other\nend of the spectrum, are too slow for the human eye to see. But we have\nastral senses, appurtenant to the astral body, duplicates of the\nphysical senses, and persons in a trance and sometimes people asleep are\nable to use these astral senses and see and communicate with the\ndenizens of the astral world.\n\n\n\n\n                    THE BIOGRAPHY OF THE SOUL ATOM.\n                          By Willard Bartlett.\n                          _From The Nautilus._\n\n\nI will preface my story with the simple statement that I am now\n500,000,000 years old, more or less, that the atom in which my soul is\nlocated, or which constitutes my soul, first found a home in what is\ncalled a living being, a cytod or cell, in the primordial or earliest\nepoch of earth’s history. A cell is a minute mass of living protoplasm,\nor jelly-like substance, not as large as the head of a pin, a\ncombination of carbon, oxygen, hydrogen, nitrogen, ammonia, sulphur,\netc. While it is true that I existed before that, and, in fact, from all\neternity, I previously resided in what is called inanimate matter, in\nthe igneous rocks. But we will say that I was born when my soul atom\nbecame involved in the said protoplasm of one of the earliest plant\ncells.\n\nAll matter is endowed with mind, and a soul exists in every atom. It is\nimpossible to produce new life, as it is said scientists have done, and\nimpossible to create life, as God is claimed to have done, for life\nalways existed in every atom. It is by certain combinations of matter\nthat life becomes manifest in motion.\n\nEach of the thousands of atoms, of which said primitive life cell was\ncomposed, had a soul destined to take its place in some descendant, if\nit had an opportunity. And the souls are waiting in the atoms to be\nborn, and not in Heaven as asserted by the Yogi philosophers. The Yogis\nclaim that the souls are waiting in some department of the Buddhist\nheaven crying to be born. Bosh! They are waiting in the spermatozoa,\nthose little monsters, those little devils that drive their great human\nmasters to crime and murder, to the gallows and the stake; there they\nare howling to be born. In their frantic race to enter the ovum, as\nshown under “Spermatozoa,” Stand. Dic., no wonder they are excited. They\nhave been waiting 500,000,000 years for the opportunity to become human\nbeings.\n\nCells propagate by division; that is my original ancestor, a little,\nround mass of protoplasm, divided itself into two cells to produce\noffspring, and all of my ancestors have done the same through all these\nmillions of years, consequently I have in my body, in all of the cells,\nsome of the original matter of which my original cell ancestor was\ncomposed. That is eternity’s great highway by which the soul walked\ndown.\n\nThe human germ cell divides in the same manner into two individuals and\nwe propagate, as our earliest ancestors did, by casting off a cell,\nwhich, being joined by a cell of the opposite sex, becomes fertilized.\nThe human embryo develops by repeated subdivisions of this twin cell,\nand each one of the myriads of cells so produced is a living, thinking\nbeing.\n\nThe question has arisen why the cells in an embryo arrange themselves in\nthe form of the parent, and it has been asserted that they are so\ndistributed by God in pursuance of a Divine plan. But it is actually\ndone by the volition of the cells themselves. Each cell takes its proper\nposition in compliance with the instruction of its parent cell, and if\nremoved by force to some other part of the embryo, will return to its\noriginal place, thus evincing the most surprising intelligence. It must\nbe remembered that a molecule is as large as a universe, that there is\nno such thing as size, that as much ability may be stored up in the\nnerve centre of a cell as in all the debris of a human brain.\n\nWe are immortal, but with no memory of past lives. If we do not\npropagate, this life will be the end of our line that has continued\nunbroken for millions of years, and we will have to go back into the\nabysmal void, into the womb of chaos and commence all over again. That\nwill be our fate in any case. Only that cell of our bodies which may be\nincorporated in our progeny will continue in human form. That cell is a\nremote relative of ours, having descended from the ancestral germ cell\nfrom which our embryo was developed.\n\nOf the earliest plant cells, developed by spontaneous generation in the\nprimordial epoch, some developed tails, or projected filaments of\nprotoplasm from their jelly-like bodies. With these tails they propelled\nthemselves through the primeval seas, and thus separated themselves from\nthe plants and became animals. In this earliest epoch of life’s history\nall beings lived in the water. These primitive plants possessed as much\nsoul and mind as the animals that thus branched off from them, and all\nplants still possess soul and mind.\n\nBut I am sorry to say that my ancestor, who thus projected a tail and\nbecame an animal, was a degenerate, a lazy loafer, a robber, a murderer\nand a cannibal. We all have to live on protoplasm. The plants made their\nown living plasm, manufacturing it from inorganic matter, but the\nanimals were too indolent to do such laborious work, when they could\njust as well kill and eat the plant cells and subsist on them. In this\nway they lost the recipe for making plasm, and we descendants are\nconsequently born cannibals, condemned to rob, murder, despoil and eat\nour fellow beings, or starve.\n\nMy next beautiful ancestor, to whom I will introduce you, was an animal\nconsisting of numerous cells arranged in the form of a sack or stomach,\ncalled a blastoderm or gastraea. There was no central brain at this\ntime, each cell having a brain of its own.\n\nYesterday, while patrolling my beat down in the mine, in a drift in the\nlimestone, the earliest sedimentary deposit laid down on the bed of the\nprimeval ocean, I found the house of my archaic ancestor, willed to me\nby him millions of years ago, and delivered by him to me yesterday. It\nis a minute shell, with which he protected his precious stomach. This\nstomach took its flight to Heaven in the earliest dawn of time, but the\nhouse, one of the many mansions of the soul, preserved intact came down\nto me through unnumbered ages, while myriad races came into being and\nfaded into eternity, and religions sprang up and flourished and waned,\nand empires rose and rotted and fell.\n\nIn the next stage, the stomach has become elongated, and the nerve\ncentre or spinal cord makes its appearance along the whole length of the\nbody. At this period my beloved grandfather was a very aristocratic and\nexclusive worm, belonging to one of the first families, and, like them,\nhad as much brains in his tail as in his head, for no cranial brain had\nyet developed.\n\nThe remaining steps of the evolution, through which my ancestors have\npassed, are depicted in the development of the human embryo, and I will\nask you to read up on the subject of embryology, which I have found\nquite as interesting as dime novels.\n\n\n\n\n                          Transcriber's Notes\n\n  Several obvious punctuation errors have been silently corrected.\n  Signa Tau was used consistently so it was not changed to Sigma Tau.\n  On pages 2 and 55, alter was changed to altar.\n  On page 71, metalic was changed to metallic, twice.\n  On page 83, phanton was changed to phantom.\n  On page 95, colaborated was changed to collaborated.\n  On page 97, tate-a-tate was changed to tête-à-tête.\n  On page 103, bear was changed to bare.\n  On page 121, polutes was changed to pollutes.\n  On page 127, Astral Word was Changed to Astral World.\n\n  Other variations in spelling, punctuation, accents and hyphenation\n  remain as in the original.\n\n  In Chapter III, the four symbols in the UTF-8 text version have been\n  approximated with UTF-8 characters which are very similar.\n\n  Italics are represented thus _italic_.", "title": "King Solomon's Goat"}