{"summary": "After an evening of entertaining guests, an intoxicated Baron Munchausen goes to sleep only to experience a variety of disturbing and otherworldly dreams.\n\n", "full_text": "http://www.freeliterature.org (Images generously made\navailable by Gallica, Bibliothèque nationale de France.)\n\n\n\n\n\nAVENTURES DU BARON\n\nDE\n\nMÜNCHHAUSEN\n\n\n\nTRADUCTION NOUVELLE\n\nPAR\n\nTHÉOPHILE GAUTIER FILS\n\n\nLes originaux:\n\nThe Travels and Surprising Adventures of Baron Munchausen\nPar Rudolph Erich Raspe\n\nWunderbare Reisen zu Wasser und zu Lande: Feldzüge und\nlustige Abenteuer des Freiherrn von Münchhausen\nPar Gottfried August Bürger\n\n\nILLUSTRÉES PAR GUSTAVE DORÉ\n\nPARIS\n\nFURNE, JOUVET ET Cie, ÉDITEURS\n\n45, rue Saint-André-des-Arts\n\n1866\n\n\n\n\nPRÉFACE\n\n\nLes Aventures du baron de Münchhausen jouissent en Allemagne d'une\ncélébrité populaire qu'elles ne sauraient manquer, nous l'espérons\ndu moins, d'acquérir bientôt en France, malgré leur forte saveur\ngermanique, et peut-être à cause même de cela: le génie des peuples se\nrévèle surtout dans la plaisanterie. Comme les œuvres sérieuses chez\ntoutes les nations ont pour but la recherche du beau qui est un de\nsa nature, elles se ressemblent nécessairement davantage, et portent\nmoins nettement imprimé le cachet de l'individualité ethnographique.\nLe comique, au contraire, consistant dans une déviation plus ou\nmoins accentuée du modèle idéal, offre une multiplicité singulière\nde ressources: car il y a mille façons de ne pas se conformer à\nl'archétype. La gaieté française n'a aucun rapport avec l'humour\nbritannique; le _witz_ allemand diffère de la bouffonnerie italienne,\net le caractère de chaque nationalité s'y montre dans son libre\népanchement. Le baron de Münchhausen, en dépit de ses hâbleries\nincroyables, n'a nul lien de parenté avec le baron de Crac, autre\nillustre menteur. La _blague_ française, qu'on nous pardonne d'employer\nce mot, lance sa fusée, pétille et mousse comme du vin de Champagne,\nmais bientôt elle s'éteint, laissant à peine au tond de la coupe deux\nou trois perles de liqueur. Cela serait trop léger pour des gosiers\nallemands habitués aux fortes bières et aux après vins du Rhin: il\nleur faut quelque chose de plus substantiel, de plus épais, de plus\ncapiteux. La plaisanterie, pour faire impression sur ces cerveaux\npleins d'abstractions, de rêves et de fumée, a besoin de se faire un\npeu lourde; il faut qu'elle insiste, qu'elle revienne à la charge,\net ne se contente pas de demi-mots qui ne seraient pas compris. Le\npoint de départ de la plaisanterie allemande est cherché, peu naturel,\nd'une bizarrerie compliquée, et demande beaucoup d'explications\npréalables assez laborieuses; mais la chose une fois posée, vous\nentrez dans un monde étrange, grimaçant, fantasque, d'une originalité\nchimérique dont vous n'aviez aucune idée. C'est la logique de l'absurde\npoursuivie avec une outrance qui ne recule devant rien. Des détails\nd'une vérité étonnante, des raisons de l'ingéniosité la plus subtile,\nde attestations scientifiques d'un sérieux parfait servent à rendre\nprobable l'impossible. Sans doute, on n'arrive pas à croire les récits\ndu baron de Münchhausen, mais à peine a-t-on entendu deux ou trois de\nses aventures de terre ou de mer, qu'on se laisse aller à la candeur\nhonnête et minutieuse de ce style, qui ne serait pas autre, s'il avait\nà raconter une histoire vraie. Les inventions les plus monstrueusement\nextravagantes prennent un certain air de vraisemblance, déduites avec\ncette tranquillité naïve et cet aplomb parfait. La connexion intime\nde ces mensonges qui s'enchaînent si naturellement les uns aux autres\nfinit par détruire chez le lecteur le sentiment de la réalité, et\nl'harmonie du faux y est poussée si loin qu'elle produit une illusion\nrelative semblable à celle que font éprouver les voyages de Gulliver\nà _Lilliput_ et à _Brobdignag_, ou bien encore l'_Histoire véritable_\nde Lucien, type antique de ces récits fabuleux tant de fois imités\ndepuis. Ici, le crayon de Gustave Doré augmente encore le prestige;\npersonne mieux que cet artiste, qui semble avoir cet œil visionnaire\ndont parle Victor Hugo dans sa pièce à Albert Durer, ne sait faire\nvivre d'une vie mystérieuse et profonde les chimères, les rêves, les\ncauchemars, les formes insaisissables noyées de lumière et d'ombre,\nles silhouettes drôlatiquement caricaturales, et tous les monstres de\nla fantaisie; il a commenté les aventures du baron de Münchhausen de\ndessins qui semblent les planches d'un voyage de circumnavigation par\nleur fidélité caractéristique et leur exotique bizarrerie. On dirait\nque, peintre de l'expédition, il a croqué d'après nature tout ce que\ndécrit le facétieux baron allemand, et le texte en acquiert une valeur\nde bouffonnerie froide plus germanique encore.\n\n\nTHÉOPHILE GAUTIER.\n\n\n\n\nCHAPITRE PREMIER\n\n\nVOYAGE EN RUSSIE ET A SAINT-PÉTERSBOURG\n\n\nJ'entrepris mon voyage en Russie au milieu de l'hiver, ayant fait ce\nraisonnement judicieux que, par le froid et la neige, les routes du\nnord de l'Allemagne, de la Pologne, de la Courlande et de la Livonie,\nqui, selon les descriptif des voyageurs, sont plus impraticables encore\nque le chemin du temple de la vertu, s'améliorent sans qu'il en coûte\nrien à la sollicitude des gouvernements. Je voyageais à cheval, ce qui\nest assurément le plus agréable mode de transport, pourvu toutefois que\nle cavalier et la bête soient bons: de cette façon, on n'est pas exposé\nà avoir d'affaires d'honneur avec quelque honnête maître de poste\nallemand, ni forcé de séjourner devant chaque cabaret, à la merci d'un\npostillon altéré. J'étais légèrement vêtu, ce dont je me trouvai assez\nmal, à mesure que j'avançais vers le nord-est.\n\n[Illustration]\n\nReprésentez-vous maintenant, par ce temps âpre, sous ce rude climat,\nun pauvre vieillard gisant sur le bord désolé d'une route de Pologne,\nexposé à un vent glacial, ayant à peine de quoi couvrir sa nudité.\n\n[Illustration: Je levai la tête et aperçus mou cheval attaché à la\npointe du clocher.]\n\nL'aspect de ce pauvre homme me navra l'âme: et, quoi qu'il fît un\nfroid à me geler le cœur dans la poitrine, je lui jetai mon manteau.\nAu même instant, une voix retentit dans le ciel, et, me louant de ma\nmiséricorde, me cria: «Le diable m'emporte, mon fils, si cette bonne\naction reste sans récompense.»\n\nJe continuai mon voyage, jusqu'à ce que la nuit et les ténèbres me\nsurprissent. Aucun signe, aucun bruit, qui m'indiquât la présence d'un\nvillage: le pays tout entier était enseveli sous la neige, et je ne\nsavais pas la route.\n\nHarassé, n'en pouvant plus, je me décidai à descendre de cheval;\nj'attachai ma bête à une sorte de pointe d'arbre qui surgissait de la\nneige. Je plaçai, par prudence, un de mes pistolets sous mon bras,\net je m'étendis sur la neige. Je fis un si bon somme, que, lorsque\nje rouvris les yeux, il faisait grand jour. Quel fut mon étonnement\nlorsque je m'aperçus que je me trouvais au milieu d'un village, dans\nle cimetière! Au premier moment, je ne vis point mon cheval, quand,\naprès quelques instants, j'entendis hennir au-dessus de moi. Je levai\nla tête, et je pus me convaincre que ma bête était suspendue au coq du\nclocher. Je me rendis immédiatement compte de ce singulier événement:\nj'avais trouvé le village entièrement recouvert par la neige; pendant\nla nuit, le temps s'était subitement adouci, et, tandis que je\ndormais, la neige, en fondant, m'avait descendu tout doucement jusque\nsur le sol; ce que, dans l'obscurité, j'avais pris pour une pointe\nd'arbre, n'était autre chose que le coq du clocher. Sans m'embarrasser\ndavantage, je pris un de mes pistolets, je visai la bride, je rentrai\nheureusement par ce moyen en possession de mon cheval, et poursuivis\nmon voyage.\n\nTout alla bien jusqu'à mon arrivée en Russie, où l'on n'a pas\nl'habitude d'aller à cheval en hiver. Comme mon principe est de me\nconformer toujours aux usages des pays où je me trouve, je pris\nun petit traîneau à un seul cheval, et me dirigeai gaiement vers\nSaint-Pétersbourg.\n\nJe ne sais plus au juste si c'était en Esthonie ou en Ingrie, mais je\nme souviens encore parfaitement que c'était au milieu d'une effroyable\nforêt, que je me vis poursuivi par un énorme loup, rendu plus rapide\nencore par l'aiguillon de la faim. Il m'eut bientôt rejoint; il n'était\nplus possible de lui échapper: je m'étendis machinalement au fond du\ntraîneau, et laissai mon cheval se tirer d'affaire et agir au mieux\nde mes intérêts. Il arriva ce que je présumais, mais que je n'osais\nespérer. Le loup, sans s'inquiéter de mon faible individu, sauta\npar-dessus moi, tomba furieux sur le cheval, déchira et dévora d'un\nseul coup tout l'arrière-train de la pauvre bête, qui, poussée par la\nterreur et la douleur, n'en courut que plus vite encore. J'étais sauvé!\nJe relevai furtivement la tête, et je vis que le loup s'était fait jour\nà travers le cheval à mesure qu'il le mangeait: l'occasion était trop\nbelle pour la laisser échapper; je ne lis ni une ni deux, je saisis\nmon fouet, et je me mis à cingler le loup de toutes mes forces: ce\ndessert inattendu ne lui causa pas une médiocre frayeur; il s'élança\nen avant de toute sa vitesse, le cadavre de mon cheval tomba à terre\net--voyez la chose étrange!--mon loup se trouva engagé à sa place dans\nle harnais. De mon côté, je n'en fouettai que de plus belle, de sorte\nque, courant de ce train-là, nous ne tardâmes pas à atteindre sains et\nsaufs Saint-Pétersbourg, contre notre attente respective, et au grand\nétonnement des passants.\n\n[Illustration]\n\nJe ne veux pas, messieurs, vous ennuyer de bavardages sur les coutumes,\nles arts, les sciences et autres particularités de la brillante\ncapitale de la Russie: encore moins vous entretiendrai-je des intrigues\net des joyeuses aventures qu'on rencontre dans la société élégante, où\nles dames offrent aux étrangers une si large hospitalité. Je préfère\narrêter votre attention sur des objets plus grands et plus nobles, sur\nles chevaux et les chiens, par exemple, que j'ai toujours eus en grande\nestime; puis sur les renards, les loups et les ours, dont la Russie,\nsi riche déjà en toute espèce de gibier, abonde plus qu'aucun autre\npays de la terre; vous parler, enfin, de ces parties de plaisir, de ces\nexercices chevaleresques, de ces actions d'éclat qui habillent mieux un\ngentilhomme qu'un méchant bout de latin et de grec, ou que ces sachets\nd'odeur, ces grimaces et ces cabrioles des beaux esprits français.\n\nComme il se passa quelque temps avant que je pusse entrer au service,\nj'eus, pendant une couple de mois, le loisir et la liberté complète\nde dépenser mon temps et mon argent de la plus noble façon. Je passai\nmainte nuit à jouer, mainte nuit à choquer les verres. La rigueur\ndu climat et les mœurs de la nation ont assigné à la bouteille une\nimportance sociale des plus hautes, qu'elle n'a pas dans notre sobre\nAllemagne, et j'ai trouvé en Russie des gens qui peuvent passer pour\ndes virtuoses accomplis dans ce genre d'exercice; mais tous n'étaient\nque de pauvres hères à côté d'un vieux général à la moustache grise, à\nla peau cuivrée, qui dînait avec nous à table d'hôte. Ce brave homme\navait perdu, dans un combat contre les Turcs, la partie supérieure\ndu crâne; de sorte que chaque fois qu'un étranger se présentait, il\ns'excusait le plus courtoisement du monde de garder son chapeau à\ntable. Il avait coutume d'absorber, en mangeant, quelques bouteilles\nd'eau-de-vie et, pour terminer, de vider un flacon d'arak, doublant\nparfois la dose, suivant les circonstances; [Illustration R] malgré\ncela, il était impossible de saisir en lui le moindre signe d'ivresse.\nLa chose vous dépasse, sans doute; elle me fit également le même effet:\nje fus longtemps avant de pouvoir me l'expliquer, jusqu'au jour où je\ntrouvai, par hasard, la clef de l'énigme. Le général avait l'habitude\nde soulever de temps en temps son chapeau; j'avais souvent remarqué\nce mouvement, sans m'en inquiéter autrement. Rien d'étonnant à ce\nqu'il eût chaud au front, et encore moins à ce que sa tête eût besoin\nd'air. Je finis cependant par voir qu'en même temps que son chapeau,\nil soulevait une plaque d'argent qui y était fixée et lui servait de\ncrâne, et qu'alors les fumées des liqueurs spiritueuses qu'il avait\nabsorbées s'échappaient en légers nuages. L'énigme était résolue.\nJe racontai ma découverte à deux de mes amis, et m'offris à leur en\ndémontrer l'exactitude. J'allai me placer, avec ma pipe, derrière\nle général, et, au moment où il soulevait son chapeau, je mis avec\nun morceau de papier le feu à la fumée: nous pûmes jouir alors d'un\nspectacle aussi neuf qu'admirable. J'avais transformé en colonne de feu\nla colonne de fumée qui s'élevait au-dessus du général; et les vapeurs\nqui se trouvaient retenues par la chevelure du vieillard formaient\nun nimbe bleuâtre, comme il n'en brilla jamais autour de la tête du\nplus grand saint. Mon expérience ne put rester cachée au général; mais\nil s'en fâcha si peu qu'il nous permit plusieurs fois de répéter un\nexercice qui lui donnait un air si vénérable.\n\n[Illustration]\n\n\n[Illustration]\n\n\n\n\nCHAPITRE II\n\n\nHISTOIRES DE CHASSE\n\n\nJe passe sous silence maintes joyeuses scènes dont nous fûmes acteurs\nou témoins dans des circonstances analogues, parce que je veux vous\nraconter différentes histoires cynégétiques beaucoup plus merveilleuses\net plus intéressantes que tout cela.\n\nJe n'ai pas besoin de vous dire, messieurs, que ma société de\nprédilection se composait de ces braves compagnons qui savent apprécier\nle noble plaisir de la chasse. Les circonstances qui entourèrent toutes\nmes aventures, le bonheur qui guida tous mes coups, resteront parmi les\nplus beaux souvenirs de ma vie.\n\nUn matin je vis, de la fenêtre de ma chambre à coucher, un grand étang,\nqui se trouvait dans le voisinage, tout couvert de canards sauvages.\nDécrochant immédiatement mon fusil, je descendis à la hâte l'escalier\navec tant de précipitation que je heurtai du visage contre la porte:\nje vis trente-six chandelles, mais cela ne me fit pas perdre une\nseconde. J'allais tirer, lorsqu'au moment où j'ajustais je m'aperçus,\nà mon grand désespoir, que le violent coup que je m'étais donné à la\nfigure avait en même temps fait tomber la pierre de mon fusil. Que\nfaire? Je n'avais pas de temps à perdre. Heureusement, je me rappelai\nce que j'avais vu quelques instants auparavant. J'ouvris le bassinet,\nje dirigeai mon arme dans la direction du gibier et je m'envoyai le\npoing dans l'un de mes yeux. Ce coup vigoureux en fit sortir un nombre\nd'étincelles suffisant pour allumer la poudre; le fusil partit, et je\ntuai cinq couples de canards, quatre sarcelles et deux poules d'eau.\nCela prouve que la présence d'esprit est l'âme des grandes actions. Si\nelle rend d'inappréciables services au soldat et au marin, le chasseur\nlui doit aussi plus d'un heureux coup.\n\nAinsi, par exemple, je me souviens qu'un jour je vis sur un lac, au\nbord duquel m'avait amené une de mes excursions, quelques douzaines de\ncanards sauvages, trop disséminés pour qu'il me fût permis d'espérer en\natteindre d'un seul coup un nombre suffisant. Pour comble de malheur,\nma dernière charge était dans mon fusil, et j'aurais précisément voulu\nles rapporter tous, ayant à traiter chez moi nombre d'amis et de\nconnaissances.\n\n[Illustration: Il les avait enfilés comme des perles.]\n\nJe me souvins alors que j'avais encore dans ma carnassière un morceau\nde lard, reste des provisions dont je m'étais muni en partant.\nJ'attachai ce morceau de lard à la laisse de mon chien que je dédoublai\net dont j'attachai les quatre fils bout à bout; puis je me blottis dans\nles joncs du bord, lançai mon appât, et j'eus bientôt la satisfaction\nde voir un premier canard s'en approcher vivement et l'avaler. Les\nautres accoururent derrière le premier, et comme, l'onctuosité du\nlard aidant, mon appât eut bientôt traversé le canard dans toute sa\nlongueur, un second l'avala, puis un troisième, et ainsi de suite. Au\nbout de quelques instants mon morceau de lard avait voyagé à travers\ntous les canards, sans se séparer de sa ficelle: il les avait enfilés\ncomme des perles. Je revins tout joyeux sur le bord, je me passai cinq\nou six fois la ficelle autour du corps et sur les épaules, et m'en\nretournai à la maison.\n\nComme j'avais encore un bon bout de chemin à faire, et que cette\nquantité de canards m'incommodait singulièrement, je commençai à\nregretter d'en avoir tant pris. Mais sur ces entrefaites il survint\nun événement qui, au premier moment, me causa quelque inquiétude. Les\ncanards étaient encore tous vivants: revenus peu à peu de leur premier\nétourdissement, ils se mirent à battre de l'aile et à m'enlever en\nl'air avec eux. Tout autre que moi eût assurément été fort embarrassé.\nMais moi j'utilisai cette circonstance à mon profit, et, me servant\ndes basques de mon habit comme de rames, je me guidai vers ma demeure.\nArrivé au-dessus de la maison, lorsqu'il s'agit de parvenir à terre\nsans me rien casser, je tordis successivement le cou à mes canards, et\nje descendis par le tuyau de la cheminée, et, à la grande stupéfaction\nde mon cuisinier, je tombai sur le fourneau qui par bonheur n'était pas\nallumé.\n\n[Illustration]\n\nJ'eus une aventure à peu près semblable avec une compagnie de\nperdreaux. J'étais sorti pour essayer un nouveau fusil, et j'avais\népuisé ma provision de petit plomb, lorsque, contre toute attente, je\nvis se lever sous mes pieds une compagnie de perdreaux. Le désir d'en\nvoir le soir même figurer quelques-uns sur ma table m'inspira un moyen\nque, sur ma parole, messieurs, je vous conseille d'employer en pareille\ncirconstance. Dès que j'eus remarqué la place où le gibier s'était\nabattu, je chargeai rapidement mon arme et j'y glissai en guise de\nplomb ma baguette, dont je laissai dépasser l'extrémité hors du canon.\n\n[Illustration: Je me guidai vers ma demeure.]\n\nJe me dirigeai vers les perdreaux, je tirai au moment où ils prenaient\nleur vol, et, à quelques pas de là, ma baguette retomba ornée de sept\npièces, qui durent être fort surprises de se trouver si subitement\nmises à la broche; ce qui justifie le proverbe qui dit: «Aide-toi, le\nciel t'aidera.»\n\n[Illustration R]\n\nUne autre fois, je rencontrai dans une des grandes forêts de la Russie\nun magnifique renard bleu. C'eût été grand dommage de trouer cette\nprécieuse fourrure d'une balle ou d'une décharge de plomb. Maître\nrenard était tapi derrière un arbre. Je retirai aussitôt la balle du\ncanon et la remplaçai par un bon clou: je fis feu, et si habilement,\nque la queue du renard se trouva fichée à l'arbre. Alors je m'avançai\ntranquillement vers lui, je pris mon couteau de chasse et lui lis sur\nla face une double entaille en forme de croix; je pris ensuite mon\nfouet et le chassai si joliment hors de sa peau que c'était plaisir à\nvoir.\n\n[Illustration L]\n\nLe hasard et la chance se chargent souvent de réparer nos fautes; en\nvoici un exemple. Un jour, je vois dans une épaisse forêt une laie et\nun marcassin qui courent sur moi. Je tire, et les manque. Mais voilà\nle marcassin qui continue sa route, et la laie qui s'arrête immobile\ncomme fichée au sol. Je m'approche pour chercher la cause de cette\nimmobilité, et je m'aperçois que j'avais affaire à une laie aveugle,\nqui tenait entre ses dents la queue du marcassin, lequel, dans sa piété\nfiliale, lui servait de guide. Ma balle, ayant passé entre les deux\nbêtes, avait coupé le fil conducteur, dont la vieille laie conservait\nencore une extrémité: ne se sentant plus tirée par son guide, elle\ns'était arrêtée. Je saisis aussitôt ce fragment de queue, et je ramenai\nchez moi, sans peine et sans résistance, la pauvre bête infirme.\n\n[Illustration]\n\nSi dangereux que soit cet animal, le sanglier est encore plus\nredoutable et plus féroce. J'en rencontrai un jour un dans une forêt,\ndans un moment où je n'étais préparé ni à la défense ni à l'attaque.\nJ'avais à peine eu le temps de me réfugier derrière un arbre, que\nl'animal se jeta sur moi de tout son élan, pour me donner un coup de\ncôté; mais, au lieu de m'entrer dans le corps, ses défenses pénétrèrent\nsi profondément dans le tronc, qu'il ne put les retirer pour fondre une\nseconde fois sur moi.\n\n--Ha, ha! pensai-je, à nous deux maintenant!\n\nJe pris une pierre, et je cognai de toutes mes forces sur ses défenses,\nde façon qu'il lui fût absolument impossible de se dégager. Il n'avait\nqu'à attendre que je décidasse de son sort: j'allai chercher des cordes\net un chariot au village voisin, et le rapportai fortement garrotté et\nvivant à la maison.\n\nVous avez assurément entendu parler, messieurs, de saint Hubert, le\npatron des chasseurs et des tireurs, ainsi que du cerf qui lui apparut\ndans une forêt, portant la sainte croix entre ses cors. Je n'ai jamais\nmanqué de fêter chaque année ce saint en bonne compagnie, et j'ai bien\nsouvent vu son cerf représenté en peinture dans les églises, ainsi que\nsur la poitrine des chevaliers de l'ordre qui porte son nom; aussi, en\nmon âme et conscience, sur mon honneur de brave chasseur, je n'oserais\npas nier qu'il n'y ait eu autrefois des cerfs coiffés de croix, et\nmême qu'il n'en existe pas encore aujourd'hui. Mais, sans entrer dans\ncette discussion, permettez-moi de vous raconter ce que j'ai vu de mes\npropres yeux. Un jour que je n'avais plus de plomb, je donnai, par un\nhasard inespéré, sur le plus beau cerf du monde. Il s'arrêta et me\nregarda fixement, comme s'il eût su que ma poire à plomb était vide.\nAussitôt je mis dans mon fusil une charge de poudre, et j'y insinuai\nune poignée de noyaux de cerises, que j'avais aussi vite que possible\ndébarrassés de leur chair. Je lui envoyai le tout sur le front, entre\nles deux cors. Le coup l'étourdit: il chancela, puis il se remit et\ndisparut.\n\n[Illustration: J'aperçois un magnifique cerf portant entre les cors un\nsuperbe cerisier.]\n\nUn ou deux ans après, je repassais dans la même forêt, et voilà, ô\nsurprise! que j'aperçois un magnifique cerf portant entre les cors un\nsuperbe cerisier, haut de dix pieds, pour le moins. Je me souvins alors\nde ma première aventure, et, considérant l'animal comme une propriété\ndepuis longtemps mienne, d'une balle je l'étendis à terre, de sorte que\nje gagnai à la fois le rôti et le dessert; car l'arbre était chargé\nde fruits, les meilleurs et les plus délicats que j'eusse mangés de\nma vie. Qui peut dire, après cela, que quelque pieux et passionné\nchasseur, abbé ou évêque, n'ait pas semé de la même façon la croix\nentre les cors du cerf de saint Hubert? Dans les cas extrêmes, un bon\nchasseur a recours à n'importe quel expédient, plutôt que de laisser\néchapper une belle occasion, et je me suis trouvé moi-même maintes\nfois obligé de me tirer par ma seule habileté des passes les plus\npérilleuses.\n\nQue dites-vous, par exemple, du cas suivant?\n\nJe me trouvais, à la tombée de la nuit, à bout de munitions, dans\nune forêt de Pologne. Je m'en retournais à la maison, lorsqu'un ours\nénorme, furieux, la gueule ouverte, prêt à me dévorer, me barre le\npassage. En vain je cherche dans toutes mes poches de la poudre\net du plomb. Je ne trouve rien que deux pierres à fusil, que j'ai\nl'habitude d'emporter par précaution. J'en lance violemment une dans\nla gueule de l'animal, qui pénètre jusqu'au fond de son gosier. Ce\ntraitement n'étant pas du goût du monstre, ma bête fait demi-tour,\nce qui me permet de jeter une seconde pierre contre sa porte de\nderrière.--L'expédient réussit admirablement. Non-seulement le second\nsilex arriva à son adresse, mais il rencontra le premier: le choc\nproduisit du feu, et l'ours éclata avec une explosion terrible. Je\nsuis sûr qu'un argument _à priori_ lancé ainsi contre un argument _à\nposteriori_ ferait, au moral, un effet analogue sur plus d'un savant.\n\nIl était écrit que je devais être attaqué par les bêtes les plus\nterribles et les plus féroces, précisément dans les moments où j'étais\nle moins en état de leur tenir tête, comme si leur instinct les eût\naverties de ma faiblesse. C'est ainsi qu'une fois que je venais de\ndévisser la pierre de mon fusil pour la raviver, un monstre d'ours\ns'élance en hurlant vers moi.\n\n[Illustration: Et l'ours éclata avec une explosion terrible.]\n\nTout ce que je pouvais faire, c'était de me réfugier sur un arbre, afin\nde me préparer à la défense. Malheureusement, en grimpant, je laissai\ntomber mon couteau, et je n'avais plus rien que mes doigts, ce qui\nétait insuffisant, pour visser ma pierre. L'ours se dressait au pied de\nl'arbre, et je m'attendais à être dévoré d'un moment à l'autre.\n\nJ'aurais pu allumer mon amorce en tirant du feu de mes yeux, comme je\nl'avais fait dans une circonstance précédente; mais cet expédient ne me\ntentait que médiocrement: il m'avait occasionné un mal d'yeux dont je\nn'étais pas encore complètement guéri. Je regardais désespérément mon\ncouteau piqué droit dans la neige; mais tout mon désespoir n'avançait\npas les choses d'un cran. Enfin il me vint une idée aussi heureuse que\nsingulière. Vous savez tous par expérience que le vrai chasseur porte\ntoujours, comme le philosophe, tout son bien avec lui: quant à moi, ma\ngibecière est un véritable arsenal qui me fournit des ressources contre\ntoutes les éventualités. J'y fouillai et en tirai d'abord une pelote\nde ficelle, puis un morceau de fer recourbé, puis une boîte pleine\nde poix: la poix étant durcie par le froid, je la plaçai contre ma\npoitrine pour la ramollir. J'attachai ensuite à la corde le morceau de\nfer que j'enduisis abondamment de poix, et le laissai rapidement tomber\nà terre. Le morceau de fer enduit de poix se fixa au manche du couteau\nd'autant plus solidement que la poix, se refroidissant à l'air, formait\ncomme un ciment; je parvins de la sorte, en manœuvrant avec précaution,\nà remonter le couteau. A peine avais-je revissé ma pierre, que maître\nMartin se mit en devoir d'escalader l'arbre.\n\n[Illustration]\n\n--Parbleu, pensai-je, il faut être ours pour choisir si bien son moment!\n\nEt je l'accueillis avec une si belle décharge, qu'il perdit du coup\nl'envie de plus jamais monter aux arbres.\n\nUne autre fois je fus serré de si près par un loup que je n'eus, pour\nme défendre, d'autre ressource que de lui plonger mon poing dans\nla gueule. Poussé par l'instinct de ma conservation, je l'enfonçai\ntoujours de plus en plus profondément, de façon que mon bras se trouva\nengagé jusqu'à l'épaule. Mais que faire après cela? Pensez un peu à\nma situation: nez à nez avec un loup! Je vous assure que nous ne nous\nfaisions pas les yeux doux: si je retirais mon bras, la bête me sautait\ndessus infailliblement; je lisais clairement son intention dans son\nregard flamboyant. Bref, je lui empoignai les entrailles, les tirai à\nmoi, retournai mon loup comme un gant, et le laissai mort sur la neige.\n\n[Illustration]\n\nJe n'aurais assurément pas employé ce procédé à l'égard d'un chien\nenragé qui me poursuivit un jour dans une ruelle de Saint-Pétersbourg.\n\n--Cette fois, me dis-je, tu n'as qu'à prendre tes jambes à ton cou!\n\nPour mieux courir, je jetai mon manteau et me réfugiai au plus vite\nchez moi. J'envoyai ensuite mon domestique chercher mon manteau,\nqu'il replaça dans l'armoire avec mes autres habits. Le lendemain,\nj'entendis un grand tapage dans la maison, et Jean qui venait vers moi\nen s'écriant:\n\n--Au nom du ciel, monsieur le baron, votre manteau est enragé!\n\nJe m'élance aussitôt, et je vois tous mes vêtements déchirés et mis en\npièces. Le drôle avait dit vrai, mon manteau était enragé: j'arrivai\njuste au moment où le furibond se ruait sur un bel habit de gala tout\nneuf, et le secouait, et le dépeçait de la façon la plus impitoyable.\n\n[Illustration]\n\n\n[Illustration: Le drôle avait dit vrai, mon manteau était enragé.]\n\n\n\n[Illustration]\n\n\n\n\nCHAPITRE III\n\n\nDES CHIENS ET DES CHEVAUX DU BARON DE MÜNCHHAUSEN\n\n\nDans toutes ces circonstances difficiles d'où je me tirai toujours\nheureusement, quoique souvent au péril de mes jours, ce furent le\ncourage et la présence d'esprit qui me permirent de surmonter tant\nd'obstacles. Ces deux qualités font, comme chacun sait, l'heureux\nchasseur, l'heureux soldat et l'heureux marin. Cependant celui-là\nserait un chasseur, un amiral ou un général imprudent et blâmable,\nqui s'en remettrait en tout état de cause à sa présence d'esprit ou à\nson courage, sans avoir recours aux ruses, ni aux instruments, ni aux\nauxiliaires qui peuvent assurer la réussite de son entreprise. Pour ce\nqui est de moi, je suis à l'abri de ce reproche, car je puis me vanter\nd'avoir toujours été cité tant pour l'excellence de mes chevaux, de mes\nchiens et de mes armes, que pour l'habileté remarquable que je mets à\nles utiliser. Je ne voudrais pas vous entretenir des détails de mes\nécuries, de mes chenils ni de mes salles d'armes, comme ont coutume de\nle faire les palefreniers et les piqueurs, mais je ne peux pas ne pas\nvous parler de deux chiens qui se sont si particulièrement distingués à\nmon service, que je ne les oublierai jamais.\n\n[Illustration]\n\nL'un était un chien couchant, si infatigable, si intelligent, si\nprudent, qu'on ne pouvait le voir sans me l'envier. Jour et nuit, il\nétait bon; la nuit je lui attachais une lanterne à la queue, et, en cet\néquipage, il chassait tout aussi bien, peut-être mieux qu'en plein jour.\n\nPeu de temps après mon mariage, ma femme manifesta le désir de\nfaire une partie de chasse. Je pris les devants pour faire lever\nquelque chose, et je ne tardai pas à voir mon chien arrêté devant\nune compagnie de quelques centaines de perdreaux. J'attendis ma\nfemme, qui venait derrière moi, avec mon lieutenant et un domestique:\nj'attendis longtemps, personne n'arrivait; enfin, assez inquiet, je\nretournai sur mes pas, et, quand je fus à moitié chemin, j'entendis des\ngémissements lamentables: ils semblaient être tout près, et cependant\nje n'apercevais nulle part trace d'être vivant.\n\nJe descendis de cheval, j'appliquai mon oreille contre le sol, et\nnon-seulement je compris que les gémissements venaient de dessous\nterre, mais encore je reconnus les voix de ma femme, de mon lieutenant\net de mon domestique. Je remarquai en même temps que non loin de\nl'endroit où j'étais s'ouvrait un puits de mine de houille, et je ne\ndoutai plus que ma femme et ses malheureux compagnons n'y eussent\nété engloutis. Je courus ventre à terre au prochain village chercher\nles mineurs, qui après de grands efforts parvinrent à retirer les\ninfortunés de ce puits qui mesurait pour le moins quatre-vingt-dix\npieds de profondeur.\n\nIls amenèrent d'abord le domestique, son cheval, ensuite le lieutenant,\npuis son cheval; enfin ma femme, et après elle son petit barbe. Le\nplus curieux de l'affaire, c'est que, malgré cette chute effroyable,\npersonne, ni gens ni bête, n'avait été blessé, à l'exception de\nquelques contusions insignifiantes; mais ils étaient en proie à une\nextrême terreur. Comme vous pouvez l'imaginer, il n'y avait plus à\npenser à reprendre la chasse, et si, ainsi que je le suppose, vous\navez oublié mon chien pendant ce récit, vous m'excuserez de l'avoir\négalement oublié après ce terrible événement.\n\nLe lendemain même de ce jour, je dus partir pour affaire de service,\net je fus retenu quinze jours hors de chez moi. Aussitôt de retour, je\ndemandai ma Diane. Personne ne s'en était inquiété; mes gens croyaient\nqu'elle m'avait suivi; il fallait donc désespérer de la revoir jamais.\nA la fin une idée lumineuse me traversa l'esprit:\n\n--Elle est peut-être restée, me dis-je, en arrêt devant la compagnie de\nperdreaux!\n\n[Illustration: Ils amenèrent d'abord le domestique.]\n\nJe m'élance aussitôt, plein d'espoir et de joie, et qu'est-ce que je\ntrouve! ma chienne immobile à la place même où je l'avais laissée\nquinze jours auparavant. «Pille!» lui criai-je; en même temps elle\nrompit l'arrêt, fit lever les perdreaux, et j'en abattis vingt-cinq\nd'un seul coup. Mais la pauvre bête eut à peine la force de revenir\nauprès de moi, tant elle était exténuée et affamée. Je fus obligé,\npour la ramener à la maison, de la prendre avec moi sur mon cheval:\nvous pensez du reste avec quelle joie je me pliai à cette incommodité.\nQuelques jours de repos et de bons soins la rendirent aussi fraîche et\naussi vive qu'auparavant, et ce ne fut que plusieurs semaines plus tard\nque je me trouvai à même de résoudre une énigme qui, sans ma chienne,\nme fût sans doute restée éternellement incompréhensible.\n\nJe m'acharnais depuis deux jours à la poursuite d'un lièvre. Ma chienne\nle ramenait toujours et je ne parvenais jamais à le tirer. Je ne crois\npas à la sorcellerie, j'ai vu trop de choses extraordinaires pour cela,\nmais j'avoue que je perdais mon latin avec ce maudit lièvre. Enfin je\nl'atteignis de si près que je le touchais du bout de mon fusil: il\nculbuta, et que pensez-vous, messieurs, que je trouvai?--Mon lièvre\navait quatre pattes au ventre et quatre autres sur le dos. Lorsque les\ndeux paires de dessous étaient fatiguées, il se retournait comme un\nnageur habile qui fait alternativement la coupe et la planche, et il\nrepartait de plus belle avec ses deux paires fraîches.\n\n[Illustration]\n\nJe n'ai jamais revu depuis de lièvre semblable à celui-là, et je ne\nl'aurais assurément pas pris avec une autre chienne que Diane. Elle\nsurpassait tellement tous ceux de sa race, que je ne craindrais pas\nd'être taxé d'exagération en la disant unique, si un lévrier que je\npossédais ne lui avait disputé cet honneur. Cette petite bête était\nmoins remarquable par sa mine que par son incroyable rapidité. Si\nces messieurs l'avaient vue, ils l'auraient certainement admirée, et\nn'auraient point trouvé étonnant que je l'aimasse si fort, et que je\nprisse tant de plaisir à chasser avec elle. Ce lévrier courut si vite\net si longtemps à mon service, qu'il s'usa les pattes jusqu'au-dessus\ndu jarret, et que sur ses vieux jours je pus l'employer avantageusement\nen qualité de terrier.\n\n[Illustration]\n\nAlors que cette intéressante bête était encore lévrier ou, pour parler\nplus exactement, levrette, elle lit lever un lièvre qui me parut\nextraordinairement gros. Ma chienne était pleine à ce moment, et cela\nme peinait de voir les efforts qu'elle faisait pour courir aussi vite\nque d'habitude. Tout à coup j'entendis des jappements, comme si c'eût\nété une meute entière qui les poussât, mais faibles et incertains, si\nbien que je ne savais d'où cela partait: lorsque je me fus approché, je\nvis la chose la plus surprenante du monde.\n\n[Illustration]\n\nLe lièvre, ou plutôt la hase, car c'était une femelle, avait mis\nbas en courant; ma chienne en avait fait autant, et il était né\nprécisément autant de petits lièvres que de petits chiens. Par\ninstinct les premiers avaient fui, et, par instinct aussi, les seconds\nles avaient non-seulement poursuivis, mais pris, de sorte que je me\ntrouvai terminer avec six chiens et six lièvres une chasse que j'avais\ncommencée avec un seul lièvre et un seul chien.\n\nAu souvenir de cette admirable chienne, je ne puis m'empêcher de\nrattacher celui d'un excellent cheval lithuanien, une bête sans prix!\nJe l'eus par suite d'un hasard qui me donna l'occasion de montrer\nglorieusement mon adresse de cavalier. Je me trouvais dans un des biens\ndu comte Przobowski, en Lithuanie, et j'étais resté dans le salon à\nprendre le thé avec les dames, tandis que les hommes étaient allés dans\nla cour examiner un jeune cheval de sang arrivé récemment du haras.\nTout à coup nous entendîmes un cri de détresse.\n\n[Illustration: Je vins me placer sur la table même.]\n\nJe descendis en toute hâte l'escalier, et je trouvai le cheval si\nfurieux, que personne n'osait ni le monter, ni même l'approcher; les\ncavaliers les plus résolus restaient immobiles et fort embarrassés:\nl'effroi se peignait sur tous les visages, lorsque d'un seul bond je\nm'élançai sur la croupe du cheval; je le surpris et le matai tout\nd'abord par cette hardiesse; mes talents hippiques achevèrent de le\ndompter et de le rendre doux et obéissant. Afin de rassurer les dames,\nje fis sauter ma bête dans le salon en passant par la fenêtre; je fis\nplusieurs tours au pas, au trot et au galop, et, pour terminer, je\nvins me placer sur la table même, où j'exécutai les plus élégantes\névolutions de la haute école, ce qui réjouit fort la société. Ma\npetite bête se laissa si bien mener, qu'elle ne cassa pas un verre,\npas une tasse. Cet événement me mit si fort en faveur auprès des dames\net du comte, qu'il me pria avec sa courtoisie habituelle de vouloir\nbien accepter ce jeune cheval, qui me conduirait à la victoire dans\nla prochaine campagne contre les Turcs, qui allait s'ouvrir sous les\nordres du comte Munich.\n\n\n[Illustration]\n\n\n\n\nCHAPITRE IV\n\n\nAVENTURES DU BARON DE MÜNCHHAUSEN DANS LA GUERRE CONTRE LES TURCS\n\n\nCertes, il eût été difficile de me faire un cadeau plus agréable que\ncelui-là, dont je me promettais beaucoup de bien pour la prochaine\ncampagne et qui devait me servir à faire mes preuves. Un cheval aussi\ndocile, aussi courageux, aussi ardent,--un agneau et un bucéphale tout\nà la fois,--devait me rappeler les devoirs du soldat, et en même temps\nles faits héroïques accomplis par le jeune Alexandre dans ses fameuses\nguerres.\n\nLe but principal de notre campagne était de rétablir l'honneur des\narmes russes qui avait quelque peu été atteint sur le Pruth, du temps\ndu czar Pierre: nous y parvînmes après de rudes mais glorieux combats,\net grâce aux talents du grand général que j'ai nommé plus haut.\n\nLa modestie interdit aux subalternes de s'attribuer de beaux faits\nd'armes; la gloire doit en revenir communément aux chefs, si nuls\nqu'ils soient, aux rois et aux reines qui n'ont jamais senti brûler de\npoudre qu'à l'exercice, et n'ont jamais vu manœuvrer d'armée qu'à la\nparade.\n\nAinsi, je ne revendique pas la moindre part de la gloire que notre\narmée recueillit dans maint engagement. Nous fîmes tous notre devoir,\nmot qui, dans la bouche du citoyen, du soldat, de l'honnête homme, a\nune signification beaucoup plus large que ne se l'imaginent messieurs\nles buveurs de bière. Comme je commandais alors un corps de hussards,\nj'eus à exécuter différentes expéditions où l'on s'en remettait\nentièrement à mon expérience et à mon courage: pour être juste,\ncependant, je dois dire ici qu'une grande part de mes succès revient à\nces braves compagnons que je conduisais à la victoire.\n\nUn jour que nous repoussions une sortie des Turcs sous les murs\nd'Oczakow, l'avant-garde se trouva chaudement engagée. J'occupais un\nposte assez avancé; tout à coup je vis venir du côté de la ville un\nparti d'ennemis enveloppés d'un nuage de poussière qui m'empêchait d\napprécier le nombre et la distance. M'entourer d'un nuage semblable,\nc'eût été un stratagème vulgaire, et cela m'eût, en outre, fait manquer\nmon but. Je déployai mes tirailleurs sur les ailes en leur recommandant\nde taire autant de poussière qu'ils pourraient. Quant à moi, je me\ndirigeai droit sur l'ennemi, afin de savoir au juste ce qui en était.\n\n[Illustration]\n\nJe l'atteignis: il résista d'abord et tint bon jusqu'au moment où\nmes tirailleurs vinrent jeter le désordre dans ses rangs. Nous le\ndispersâmes complètement, en fîmes un grand carnage et le refoulâmes\nnon-seulement dans la place, mais encore au delà, de façon qu'il\ns'enfuit par la porte opposée, résultat que nous n'avions pas osé\nespérer.\n\n[Illustration: L'eau s'écoulait par derrière à mesure qu'elle entrait\npar devant.]\n\nComme mon lithuanien allait extrêmement vite, je me trouvai le premier\nsur le dos des fuyards, et, voyant que l'ennemi courait si bien vers\nl'autre issue de la ville, je jugeai bon de m'arrêter sur la place\ndu marché et de faire sonner le rassemblement. Mais figurez-vous mon\nétonnement, messieurs, en ne voyant autour de moi ni trompette ni aucun\nde mes hussards!\n\n--Que sont-ils devenus? me dis-je; se seraient-ils répandus dans les\nrues?\n\nIls ne pouvaient cependant pas être bien loin, et ne devaient pas\ntarder à me rejoindre. En attendant, je menai mon lithuanien à la\nfontaine qui occupait le milieu de la place, pour l'abreuver. Il se\nmit alors à boire d'une façon inconcevable, sans que cela parût le\ndésaltérer: j'eus bientôt l'explication de ce phénomène singulier,\ncar, en me retournant pour regarder si mes gens n'arrivaient pas,\nqu'imaginez-vous que je vis, messieurs? Tout l'arrière-train de mon\ncheval était absent et coupé net. L'eau s'écoulait par derrière à\nmesure qu'elle entrait par devant, sans que la bête en conservât rien.\n\nComment cela était-il arrivé? je ne pouvais m'en rendre compte,\nlorsqu'enfin mon hussard arriva du côté opposé à celui par lequel\nj'étais venu et, à travers un torrent de cordiales félicitations et\nd'énergiques jurons, me rapporta ce qui suit. Tandis que je m'étais\njeté pêle-mêle au milieu des fuyards, on avait brusquement laissé\nretomber la herse de la porte, qui avait tranché net l'arrière-train\nde mon cheval. Cette seconde partie de ma bête était d'abord restée\nau milieu des ennemis et y avait exercé de terribles ravages; puis,\nne pouvant pénétrer dans la ville, elle s'était dirigée vers un pré\nvoisin, où je la retrouverais sans aucun doute. Je tournai bride\naussitôt, et l'avant de mon cheval me mena au grand galop vers la\nprairie. A ma grande joie, j'y retrouvai en effet l'autre moitié qui\nse livrait aux évolutions les plus ingénieuses et passait gaiement le\ntemps avec les juments qui erraient sur la pelouse.\n\n[Illustration]\n\nÉtant dès lors bien assuré que les deux parties de mon cheval étaient\nvivantes, j'envoyai chercher notre vétérinaire. Sans perdre de temps,\nil les rajusta au moyen de rameaux de laurier qui se trouvaient là, et\nla blessure guérit heureusement. Il advint alors quelque chose qui ne\npouvait arriver qu'à un animal aussi supérieur. Les branches prirent\nracine dans son corps, poussèrent, et formèrent autour de moi comme un\nberceau à l'ombre duquel j'accomplis plus d'une action d'éclat.\n\nJe veux vous raconter encore ici un petit désagrément qui résulta de\ncette brillante affaire. J'avais si vigoureusement, si longtemps et\nsi impitoyablement sabré l'ennemi, que mon bras en avait conservé le\nmouvement, alors que les Turcs avaient depuis longtemps disparu. Dans\nla crainte de me blesser et surtout de blesser les miens lorsqu'ils\nm'approchaient, je me vis obligé de porter pendant huit jours mon bras\nen écharpe, comme si j'eusse été amputé.\n\nLorsqu'un homme monte un cheval tel que mon lithuanien, vous pouvez\nbien, messieurs, le croire capable d'exécuter un autre trait qui\nparaît, au premier abord, tenir du fabuleux. Nous faisions le siège\nd'une ville dont j'ai oublié le nom, et il était de la plus haute\nimportance pour le feld-maréchal de savoir ce qui se passait dans la\nplace: il paraissait impossible d'y pénétrer, car il eût fallu se faire\njour à travers les avant-postes, les grands'gardes et les ouvrages\navancés; personne n'osait se charger d'une pareille entreprise. Un\npeu trop confiant peut-être dans mon courage et emporté par mon zèle,\nj'allai me placer près d'un de nos gros canons et, au moment où le coup\npartait, je m'élançai sur le boulet, dans le but de pénétrer par ce\nmoyen dans la ville; mais lorsque je fus à moitié route, la réflexion\nme vint.\n\n[Illustration]\n\n--Hum! pensai-je, aller, c'est bien, mais comment revenir? Que va-t-il\nt'arriver une fois dans la place? On te traitera en espion et on le\npendra au premier arbre: ce n'est pas une fin digne de Münchhausen!\n\nAyant fait cette réflexion, suivie de plusieurs autres du même genre,\nj'aperçus un boulet, dirigé de la forteresse contre notre camp, qui\npassait à quelques pas de moi; je sautai dessus, et je revins au milieu\ndes miens, sans avoir, il est vrai, accompli mon projet, mais du moins\nentièrement sain et sauf.\n\n[Illustration: Si je ne m'étais enlevé par ma propre queue.]\n\nSi j'étais leste et alerte à la voltige, mon brave cheval ne l'était\npas moins. Haies ni fossés, rien ne l'arrêtait, il allait toujours\ndroit devant lui. Un jour, un lièvre que je poursuivais coupa la grande\nroute; en ce moment même, une voiture où se trouvaient deux belles\ndames vint me séparer du gibier. Mon cheval passa si rapidement et si\nlégèrement à travers la voiture, dont les glaces étaient baissées, que\nj'eus à peine le temps de retirer mon chapeau et de prier ces dames de\nm'excuser de la liberté grande.\n\nUne autre fois, je voulus sauter une mare, et, lorsque je me trouvai\nau milieu, je m'aperçus quelle était plus grande que je ne me l'étais\nfiguré d'abord: je tournai aussitôt bride au milieu de mon élan, et\nje revins sur le bord que je venais de quitter, pour reprendre plus\nde champ; cette fois encore je m'y pris mal, et tombai dans la mare\njusqu'au cou: j'aurais péri infailliblement si, par la force de mon\npropre bras, je ne m'étais enlevé par ma propre queue, moi et mon\ncheval que je serrai fortement entre les genoux.\n\n[Illustration]\n\n\n\n\nCHAPITRE V\n\n\nAVENTURES DU BARON DE MÜNCHHAUSEN PENDANT SA CAPTIVITÉ CHEZ LES TURCS.\nIL REVIENT DANS SA PATRIE\n\n\nMalgré tout mon courage, malgré la rapidité, l'adresse et la souplesse\nde mon cheval, je ne remportai pas toujours, dans la guerre contre les\nTurcs, les succès que j'eusse désirés. J'eus même le malheur, débordé\npar le nombre, d'être fait prisonnier, et, ce qui est plus triste\nencore, quoique cela soit une habitude chez ces gens-là, je fus vendu\ncomme esclave.\n\nRéduit à cet état d'humiliation, j'accomplissais un travail moins dur\nque singulier, moins avilissant qu'insupportable. J'étais chargé de\nmener chaque matin au champ les abeilles du sultan, de les garder tout\nle jour et de les ramener le soir à leur ruche. Un soir, il me manqua\nune abeille; mais je reconnus aussitôt qu'elle avait été attaquée\npar deux ours qui voulaient la mettre en pièces pour avoir son miel.\nN'ayant entre les mains d'autre arme que la hachette d'argent qui est\nle signe distinctif des jardiniers et des laboureurs du sultan, je la\nlançai contre les deux voleurs, dans le but de les effrayer. Je réussis\nen effet à délivrer la pauvre abeille; mais l'impulsion donnée par mon\nbras avait été trop forte; la hache s'éleva en l'air si haut, si haut,\nqu'elle s'en alla tomber dans la lune. Comment la ravoir? Où trouver\nune échelle pour aller la rechercher?\n\n[Illustration L]\n\nJe me rappelai alors que le pois de Turquie croît très-rapidement et à\nune hauteur extraordinaire. J'en plantai immédiatement un, qui se mit\nà pousser et alla de lui-même contourner sa pointe autour d'une des\ncornes de la lune. Je grimpai lestement vers l'astre, où j'arrivai sans\nencombre. Ce ne fut pas un petit travail que de rechercher ma hachette\nd'argent dans un endroit où tous les objets sont également en argent.\nEnfin je la trouvai sur un tas de paille.\n\n[Illustration: Lorsqu'il fut embroché, j'acourus.]\n\nAlors je songeai au retour. Mais, ô désespoir! la chaleur du soleil\navait flétri la tige de mon pois, si bien que je ne pouvais descendre\npar cette voie sans risquer de me casser le cou. Que faire? je tressai\navec la paille une corde aussi longue que je pus: je la fixai a l'une\ndes cornes de la lune, et je me laissai glisser. Je me soutenais de\nla main droite, j'avais ma hache dans la gauche: arrivé au bout de ma\ncorde, je tranchai la portion supérieure et la rattachai à l'extrémité\ninférieure: je réitérai plusieurs fois cette opération, et je finis, au\nbout de quelque temps, par discerner au-dessous de moi la campagne du\nsultan.\n\n[Illustration R]\n\nJe pouvais bien être encore à une distance de deux lieues de la terre,\ndans les nuages, lorsque la corde se cassa, et je tombai si rudement\nsur le sol, que j'en restai tout étourdi. Mon corps, dont le poids\ns'était accru par la vitesse acquise et par la distance parcourue,\ncreusa dans la terre un trou d'au moins neuf pieds de profondeur. Mais\nla nécessité est bonne conseillère. Je me taillai avec mes ongles de\nquarante ans une sorte d'escalier, et je parvins de cette façon à\nrevoir le jour.\n\n[Illustration L]\n\nInstruit par cette expérience, je trouvai un meilleur moyen de me\ndébarrasser des ours qui en voulaient à mes abeilles et à mes ruches.\nJ'enduisis de miel le timon d'un chariot, et je me plaçai non loin de\nlà en embuscade, pendant la nuit. Un ours énorme, attiré par l'odeur du\nmiel, arriva et se mit à lécher si avidement le bout du limon, qu'il\nfinit par se le passer tout entier dans la gueule, dans l'estomac\net dans les entrailles: lorsqu'il fut bien embroché, j'accourus, je\nfichai dans le trou placé à l'extrémité du timon une grosse cheville,\net coupant ainsi la retraite au gourmand, je le laissai dans celte\nposition jusqu'au lendemain matin. Le sultan, qui vint se promener dans\nles environs, faillit mourir de rire en voyant le tour que j'avais joué\na l'ours.\n\n[Illustration: Que le soleil lui-même y gagna des engelures.]\n\nPeu de temps après, les Russes conclurent la paix avec les Turcs, et\nje fus renvoyé à Saint-Pétersbourg avec nombre d'autres prisonniers de\nguerre. Je pris mon congé, et je quittai la Russie au moment de cette\ngrande révolution qui eut lieu il y a environ quarante ans, et à la\nsuite de laquelle l'empereur au berceau, avec sa mère et son père, le\nduc de Brunswick, le feld-maréchal Munich et tant d'autres, fut exilé\nen Sibérie. Il sévit cette année-là un tel froid dans toute l'Europe,\nque le soleil lui-même y gagna des engelures, dont on voit encore\nles marques qu'on observe sur sa face. Aussi eus-je beaucoup plus à\nsouffrir à mon retour que lors de mon premier voyage.\n\n[Illustration R]\n\nMon lithuanien étant resté en Turquie, j'étais obligé de voyager en\nposte. Or, il advint que, nous trouvant engagés dans un chemin creux\nbordé de baies élevées, je dis au postillon de donner avec son cor un\nsignal, afin d'empêcher une autre voiture de s'engager en même temps\ndans l'autre bout du chemin. Mon drôle obéit et souffla de toutes\nses forces dans son cor, mais ses efforts furent vains: il ne put en\ntirer une note, ce qui était d'abord incompréhensible, et ensuite fort\ngênant, car nous ne tardâmes pas à voir arriver sur nous une voiture\nqui occupait toute la largeur de la route.\n\n[Illustration L]\n\nJe descendis aussitôt et commençai par dételer les chevaux; puis je\npris sur mes épaules la voiture avec ses quatre roues et ses bagages,\net je sautai avec cette charge dans les champs, par-dessus le talus\net la haie du bord, haute d'au moins neuf pieds, ce qui n'était pas\nune bagatelle, vu le poids du fardeau: au moyen d'un second saut, je\nreportai ma chaise de poste sur la route, au delà de l'autre voiture.\nCela fait, je revins vers les chevaux, j'en pris un sous chaque bras,\net je les transportai par le même procédé auprès de la chaise; après\nquoi nous attelâmes et nous atteignîmes sans encombre la station de\nposte.\n\nJ'ai oublié de vous dire que l'un de mes chevaux, qui était tout jeune\net très-fougueux, faillit me donner beaucoup de mal: car au moment\noù je franchissais pour la seconde fois la haie, il se mit à ruer et\nà remuer les jambes si violemment que je me trouvai un instant fort\nembarrassé. Mais je l'empêchai de continuer cette gymnastique en\nfourrant ses deux jambes de derrière dans les poches de mon habit.\n\n[Illustration: J'en pris un sous chaque bras.]\n\nArrivés à l'auberge, le postillon accrocha son cor à un clou dans la\ncheminée, et nous nous mîmes à table.\n\n[Illustration]\n\nOr, écoutez, messieurs, ce qui arriva!--_Tarata, tarata, tata, tata!_\nvoilà le cor qui se met à jouer tout seul. Nous ouvrons de grands\nyeux, en nous demandant ce que cela signifie. Imaginez-vous que les\nnotes s'étaient gelées dans le cor, et que, la chaleur les dégelant\npeu à peu, elles sortaient claires et sonores, à la grande louange du\npostillon, car l'intéressant instrument nous fit pendant une demi-heure\nd'excellente musique sans qu'il fût besoin de souffler dedans. Il nous\njoua d'abord la marche prussienne, puis «_Sans amour et sans vin_,»\npuis «_Quand je suis triste_,» puis «_Hier soir le cousin Michel_,» et\nmaintes chansons populaires, entre autres la ballade «_Tout repose dans\nles bois._» Cette aventure fut la dernière de mon voyage en Russie.\n\nBeaucoup de voyageurs ont l'habitude, en narrant leurs aventures, d'en\nraconter beaucoup plus long qu'ils n'en ont vu. Il n'est donc pas\nétonnant que les lecteurs et les auditeurs soient parfois enclins à\nl'incrédulité. Toutefois, s'il était dans l'honorable société quelqu'un\nqui fût porté à douter de la véracité de ce que j'avance, je serais\nextrêmement peiné de ce manque de confiance, et je l'avertirais qu'en\nce cas ce qu'il a de mieux à faire c'est de se retirer avant que je\ncommence le récit de mes aventures de mer qui sont plus extraordinaires\nencore, bien qu'elles ne soient pas moins authentiques.\n\n\n[Illustration]\n\n\n\n[Illustration]\n\n\n\n\nCHAPITRE VI\n\n\nPREMIÈRE AVENTURE DE MER\n\n\nLe premier voyage que je fis dans ma vie, peu de temps avant celui de\nRussie dont je vous ai raconté les épisodes les plus remarquables, fut\nun voyage sur mer.\n\nJ'étais encore en procès avec les oies, comme avait coutume de me\nle répéter mon oncle le major,--une fière moustache de colonel de\nhussards,--et l'on ne savait pas encore au juste si le duvet blanc qui\nparsemait mon menton serait chiendent ou barbe, que déjà les voyages\nétaient mon unique poésie, la seule aspiration de mon cœur.\n\n\n[Illustration L]\n\nMon père avait passé la plus grande partie de sa jeunesse à voyager,\net il abrégeait les longues soirées d'hiver par le récit véridique de\nses aventures. Aussi peut-on attribuer mon goût autant à la nature\nqu'à l'influence de l'exemple paternel. Bref, je saisissais toutes les\noccasions que je croyais devoir me fournir les moyens de satisfaire mon\ninsatiable désir de voir le monde; mais tous mes efforts furent vains.\n\nSi par hasard je parvenais à faire une petite brèche à la volonté de\nmon père, ma mère et ma tante n'en résistaient que plus opiniâtrément,\net, en quelques instants, j'avais perdu les avantages que j'avais eu\ntant de peine à conquérir. Enfin le hasard voulut qu'un de mes parents\nmaternels vînt nous faire une visite. Je fus bientôt son favori; il\nme disait souvent que j'étais un gentil et joyeux garçon, et qu'il\nvoulait faire tout son possible pour m'aider dans l'accomplissement de\nmon désir. Son éloquence fut plus persuasive que la mienne, et après\nun échange de représentations et de répliques, d'objections et de\nréfutations, il fut décidé, à mon extrême joie, que je l'accompagnerais\nà Ceylan, où son oncle avait été gouverneur pendant plusieurs années.\n\nNous partîmes d'Amsterdam, chargés d'une mission importante de la\npart de Leurs Hautes Puissances les États de Hollande. Notre voyage\nne présenta rien de bien remarquable, à l'exception d'une terrible\ntempête, à laquelle je dois consacrer quelques mots, à cause des\nsingulières conséquences qu'elle amena. Elle éclata juste au moment où\nnous étions à l'ancre devant une île, pour faire de l'eau et du bois:\nelle sévissait si furieuse, qu'elle déracina et souleva en l'air nombre\nd'arbres énormes. Bien que quelques-uns pesassent plusieurs centaines\nde quintaux, la hauteur prodigieuse à laquelle ils étaient enlevés les\nfaisait paraître pas plus gros que ces petites plumes que l'on voit\nparfois voltiger dans l'air.\n\nCependant, dès que la tempête se fut apaisée, chaque arbre retomba\njuste à sa place, et reprit aussitôt racine, de sorte qu'il ne resta\npas la moindre trace des ravages causés par les éléments. Seul, le plus\ngros de ces arbres fit exception. Au moment où il avait été arraché\nde terre par la violence de la tempête, un homme était occupé avec sa\nfemme à y cueillir des concombres; car, dans cette partie du monde, cet\nexcellent fruit croît sur les arbres. L'honnête couple accomplit aussi\npatiemment que le mouton de Blanchard le voyage aérien; mais par son\npoids il modifia la direction de l'arbre, qui retomba horizontalement\nsur le sol. Or, le très-gracieux cacique de l'île avait, ainsi que\nla plupart des habitants, abandonné sa demeure, par crainte d'être\nenseveli sous les ruines de son palais; à la fin de l'ouragan il\nrevenait chez lui en passant par son jardin, lorsque l'arbre tomba\nprécisément en ce moment et, par bonheur, le tua net.\n\n[Illustration]\n\n--Par bonheur, dites-vous?\n\n--Oui, oui, par bonheur; car, messieurs, le cacique était, sauf votre\nrespect, un abominable tyran, et les habitants de l'île, sans en\nexcepter ses favoris et ses maîtresses, étaient les plus malheureuses\ncréatures qu'on pût trouver sous la calotte des cieux. Des masses\nd'approvisionnements pourrissaient dans ses magasins et dans ses\ngreniers, tandis que son peuple, à qui il les avait extorqués, mourait\nlittéralement de faim.\n\n[Illustration: Un homme était occupé avec sa femme à y cueillir des\nconcombres.]\n\nSon île n'avait rien à craindre de l'étranger: malgré cela il mettait\nla main sur tous les jeunes gens pour en faire des héros suivant\nl'ordonnance, et de temps en temps vendait sa collection au voisin le\nplus offrant, pour ajouter de nouveaux millions de coquillages aux\nmillions qu'il avait hérités de son père. On nous dit qu'il avait\nrapporté ce procédé inouï d'un voyage qu'il avait fait dans le Nord;\nc'est là une assertion que, malgré tout notre patriotisme, nous\nn'essayâmes pas de réfuter, quoique, chez ces insulaires, un voyage\ndans le Nord puisse signifier aussi bien un voyage aux Canaries qu'une\nexcursion au Groenland; mais nous avions plusieurs raisons de ne pas\ninsister sur ce point.\n\n[Illustration]\n\nEn reconnaissance du grand service que ces cueilleurs de concombres\navaient rendu à leurs compatriotes, on les plaça sur le trône laissé\nvacant par la mort du cacique. Il est vrai de dire que ces braves gens\navaient dans leur voyage aérien vu le soleil de si près, que l'éclat\nde cette lumière leur avait pas mal obscurci les yeux, et quelque peu\naussi l'intelligence; mais ils n'en régnèrent que mieux, si bien que\npersonne ne mangeait de concombres sans dire: «Dieu protège notre\ncacique!»\n\n[Illustration]\n\nAprès avoir réparé notre bâtiment, qui n'avait pas peu souffert de la\ntourmente, et pris congé des nouveaux souverains, nous mîmes à la voile\npar un vent favorable, et, au bout de six semaines, nous fûmes à Ceylan.\n\nQuinze jours environ après notre arrivée, le fils aîné du gouverneur me\nproposa d'aller à la chasse avec lui, ce que j'acceptai de grand cœur.\nMon ami était grand et fort, habitué à la chaleur du climat; mais moi,\nje ne tardai pas, quoique je ne me fusse pas beaucoup remué, à être si\naccablé, que, lorsque nous arrivâmes en forêt, je me trouvai en arrière\nde lui.\n\n[Illustration]\n\nJe me disposais à m'asseoir, pour prendre quelque repos, au bord d'une\nrivière qui depuis quelque temps attirait mon attention, lorsqu'il se\nfit tout à coup un grand bruit derrière moi. Je me retournai et restai\ncomme pétrifié en apercevant un énorme lion qui se dirigeait sur moi,\net me donnait à entendre qu'il désirait vivement déjeuner de ma pauvre\npersonne, sans m'en demander la permission. Mon fusil était chargé à\npetit plomb.\n\n[Illustration L]\n\nJe n'avais ni le temps ni la présence d'esprit nécessaires pour\nréfléchir longuement; je résolus donc de faire feu sur la bête, sinon\npour la blesser, du moins pour l'effrayer. Mais au moment où je le\nvisai, l'animal, devinant sans doute mes intentions, devint furieux et\ns'élança sur moi. Par instinct plutôt que par raisonnement, j'essayai\nune chose impossible, c'est-à-dire de fuir. Je me retourne et--j'en\nfrissonne encore rien que d'y penser!--je vois à quelques pas devant\nmoi un monstrueux crocodile, qui ouvrait déjà formidablement sa gueule\npour m'avaler.\n\nReprésentez-vous, messieurs, l'horreur de ma situation: par derrière,\nle lion; par devant, le crocodile; à gauche, une rivière rapide; à\ndroite, un précipice hanté, comme je l'appris plus tard, par des\nserpents venimeux!\n\n[Illustration: Sa tête avait pénétré jusque dans le gosier de l'autre\nbête.]\n\nÉtourdi, stupéfié,--Hercule lui-même l'eût été dans une pareille\ncirconstance,--je tombai à terre. La seule pensée qui occupait mon âme\nétait l'attente du moment où je sentirais la pression des dents du lion\nfurieux, ou bien l'étreinte des mâchoires du crocodile. Mais au bout de\nquelques secondes j'entendis un bruit violent et étrange, quoique je\nn'éprouvasse aucune douleur. Je lève doucement la tête et je vois, à\nma grande joie, que le lion, emporté par l'élan qu'il avait pris pour\nse jeter sur moi, était tombé juste dans la gueule du crocodile. Sa\ntête avait pénétré jusque dans le gosier de l'autre bête, et il faisait\nde vains efforts pour se dégager. Je me relevai aussitôt, tirai mon\ncoutelas, et d'un coup je tranchai la tête du lion, dont le corps vint\nrouler à mes pieds; puis, avec la crosse de mon fusil, j'enfonçai sa\ntête aussi avant que je pus dans le gosier du crocodile, qui ne tarda\npas à étouffer misérablement.\n\nQuelques instants après que j'eus remporté cette éclatante victoire\nsur ces deux terribles ennemis, mon camarade arriva, inquiet de mon\nabsence. Il me félicita chaudement, et nous mesurâmes le crocodile: il\ncomptait quarante pieds de Paris et sept pouces de long.\n\n[Illustration]\n\nDès que nous eûmes raconté cette aventure extraordinaire au gouverneur,\nil envoya un chariot avec des gens pour chercher les deux animaux. Un\npelletier de l'endroit me fit avec la peau du lion un certain nombre\nde blagues à tabac, dont je distribuai une partie à mes connaissances\nde Ceylan. Celles qui me restaient, j'en fis hommage plus tard aux\nbourgmestres d'Amsterdam qui voulurent absolument me faire en retour un\ncadeau de mille ducats, que j'eus toutes les peines du monde à refuser.\n\nLa peau du crocodile fut empaillée suivant la méthode ordinaire, et\nfait aujourd'hui le plus bel ornement du Muséum d'Amsterdam, dont le\ngardien raconte mon histoire à chaque visiteur. Je dois dire cependant\nqu'il y ajoute plusieurs détails de son invention, qui offensent\ngravement la vérité et la vraisemblance.\n\n[Illustration R]\n\nPar exemple, il dit que le lion a traversé le crocodile dans toute sa\nlongueur, et qu'au moment où il sortait par le côté opposé à celui par\nlequel il était entré, monsieur l'illustrissime baron--c'est ainsi\nqu'il a coutume de m'appeler--avait coupé, en lui tranchant la tête,\ntrois pieds de queue au crocodile.\n\n«Le crocodile, ajoute le drôle, profondément humilié de cette\nmutilation, se retourna, arracha le coutelas des mains de monsieur le\nbaron, et l'avala avec tant de fureur, qu'il se le fit passer droit à\ntravers le cœur, et en mourut instantanément.»\n\nJe n'ai pas besoin de vous dire, messieurs, combien je suis peiné de\nl'impudence de ce coquin. Dans le siècle de scepticisme où nous vivons,\nles gens qui ne me connaissent point pourraient être amenés, par suite\nde ces grossiers mensonges, à révoquer en doute la vérité de mes\naventures réelles, chose qui lèse gravement un homme d'honneur.\n\n\n\n[Illustration]\n\n\n\n\nCHAPITRE VII\n\n\nDEUXIÈME AVENTURE DE MER\n\n\nEn l'année 1776, je m'embarquai à Portsmouth pour l'Amérique du Nord,\nsur un vaisseau de guerre anglais de premier rang, portant cent canons\net quatorze cents hommes d'équipage. Je pourrais vous raconter ici\ndifférentes aventures qui m'arrivèrent en Angleterre, mais je les\nréserve pour une autre fois. Il en est une cependant que je veux\nmentionner.\n\n[Illustration: Le siège était occupé par un énorme cocher.]\n\nJ'eus une fois le plaisir de voir passer le roi, se rendant en grande\npompe au parlement, dans sa voiture de gala. Le siège était occupé par\nun énorme cocher dans la barbe duquel se trouvaient très-artistement\ndécoupées les armes d'Angleterre, et, avec son fouet, il décrivait dans\nl'air, de la façon la plus intelligible, le signe suivant [Illustration]\n\nDans notre traversée, il ne nous arriva rien d'extraordinaire. Le\npremier incident eut lieu à environ trois cents milles du fleuve\nSaint-Laurent: notre vaisseau heurta avec une violence extrême contre\nquelque chose qui nous sembla être un rocher.\n\n[Illustration R]\n\nCependant, quand nous jetâmes la sonde, nous ne trouvâmes pas le\nfond à cinq cents brasses. Ce qui rendait cet accident encore plus\nextraordinaire et plus incompréhensible, c'est que nous avions du\ncoup perdu notre gouvernail; notre beaupré était cassé en deux, tous\nnos mâts s'étaient fendus dans la longueur, et deux s'étaient abattus\nsur le pont. Un pauvre diable de matelot, qui était occupé dans les\nagrès à serrer la grand'voile, fut enlevé à plus de trois lieues du\nvaisseau avant de tomber à l'eau. Heureusement, pendant ce trajet' il\neut la présence d'esprit de saisir au vol la queue d'une grue, ce qui\nnon-seulement diminua la rapidité de sa chute, mais encore lui permit\nde nager jusqu'au vaisseau en se prenant au cou de la bête.\n\n[Illustration L]\n\nLe choc avait été si violent que tout l'équipage, qui se trouvait\nsur le pont, fut lancé contre le tillac. J'en eus, du coup, la tête\nrenfoncée dans les épaules, et il fallut plusieurs mois avant qu'elle\nreprît sa position naturelle.\n\n[Illustration L]\n\nNous nous trouvions tous dans un état de stupéfaction et de trouble\ndifficile à décrire, lorsque l'apparition d'une énorme baleine qui\nsommeillait sur la surface de l'Océan vint nous donner l'explication\nde cet événement. Le monstre avait trouvé mauvais que notre vaisseau\nl'eût heurté, et s'était mis à donner de grands coups de queue sur nos\nbordages; dans sa colère, il avait saisi dans sa bouche la maîtresse\nancre qui se trouvait, suivant l'usage, suspendue à l'arrière, et\nl'avait emportée en entraînant notre vaisseau sur un parcours de près\nde soixante milles, à raison de dix milles à l'heure.\n\n[Illustration: J'essayai de le boucher de tous les moyens connus.]\n\nDieu sait où nous serions allés, si par bonheur le câble de notre ancre\nne se fût rompu, de sorte que la baleine perdit noire vaisseau, et\nque nous, nous perdîmes notre ancre. Lorsque, plusieurs mois après,\nnous revînmes en Europe, nous retrouvâmes la même baleine presque à\nla même place: elle flottait morte, sur l'eau, et mesurait près d'un\ndemi-mille de long. Nous ne pouvions prendre à bord qu'une petite\npartie de cette formidable bête: nous mîmes donc nos canots à la mer,\net nous détachâmes à grand'peine la tête de la baleine: nous eûmes\nla satisfaction d'y retrouver non-seulement notre ancre, mais encore\nquarante toises de câble qui s'étaient logés dans une dent creuse,\nplacée à la gauche de sa mâchoire inférieure.\n\nCe fut l'unique événement intéressant qui marqua notre retour.--Mais\nnon! j'en oubliais un qui faillit nous être fatal à tous. Lorsque,\nà notre premier voyage, nous fûmes entraînés par la baleine, notre\nvaisseau prit une voie d'eau si large que toutes nos pompes n'eussent\npu nous empêcher de couler bas en une demi-heure. Heureusement j'avais\nété le premier à m'apercevoir de l'accident: le trou mesurait au moins\nun pied de diamètre. J'essayai de le boucher par tous les moyens\nconnus, mais en vain: enfin je parvins à sauver ce beau vaisseau et\nson nombreux équipage par la plus heureuse imagination du monde. Sans\nprendre le temps de retirer mes culottes, je m'assis intrépidement dans\nle trou; l'ouverture eût-elle été beaucoup plus vaste, j'eusse encore\nréussi à la boucher; vous ne vous en étonnerez pas, messieurs, quand\nje vous aurai dit que je descends, en lignes paternelle et maternelle,\nde familles hollandaises, ou au moins westphaliennes. A la vérité, ma\nposition sur ce trou était assez humide, mais j'en fus bientôt tiré par\nles soins du charpentier.\n\n\n[Illustration]\n\n\n[Illustration]\n\n\n\n\nCHAPITRE VIII\n\n\nTROISIÈME AVENTURE DE MER\n\n\nUn jour, je fus en grand danger de périr dans la Méditerranée. Je\nme baignais par une belle après-midi d'été non loin de Marseille,\nlorsque je vis un grand poisson s'avancer vers moi, à toute vitesse,\nla gueule ouverte. Impossible de me sauver, je n'en avais ni le temps\nni les moyens. Sans hésiter, je me fis aussi petit que possible; je me\npelotonnai en ramenant mes jambes et mes bras contre mon corps: dans\ncet état, je me glissai entre les mâchoires du monstre jusque dans son\ngosier. Arrivé là, je me trouvai plongé dans une obscurité complète, et\ndans une chaleur qui ne m'était pas désagréable. Ma présence dans son\ngosier le gênait singulièrement, et il n'aurait sans doute pas demandé\nmieux que de se débarrasser de moi: pour lui être plus insupportable\nencore, je me mis à marcher, à sauter, à danser, à me démener et à\nfaire mille tours dans ma prison. La gigue écossaise entre autres\nparaissait lui être particulièrement désagréable: il poussait des\ncris lamentables, se dressait parfois tout debout en sortant de l'eau\nà mi-corps. Il fut surpris dans cet exercice par un bateau italien\nqui accourut, le harponna, et eut raison de lui au bout de quelques\nminutes. Dès qu'on l'eut amené à bord, j'entendis l'équipage qui se\nconcertait sur les moyens de le dépecer de façon à en tirer le plus\nd'huile possible. Comme je comprenais l'italien, je fus pris d'une\ngrande frayeur, craignant d'être découpé en compagnie de l'animal.\nPour me mettre a l'abri de leurs couteaux, j'allai me placer au centre\nde l'estomac, où douze hommes eussent pu tenir aisément; je supposais\nqu'ils attaqueraient l'ouvrage par les extrémités. Mais je fus bientôt\nrassuré, car ils commencèrent par ouvrir le ventre. Dès que je vis\npoindre un filet de jour, je me mis à crier à plein gosier combien il\nm'était agréable de voir ces messieurs et d'être tiré par eux d'une\nposition où je n'eusse pas tardé à être étouffé.\n\n[Illustration: Quand ils en virent émerger un homme complètement nu.]\n\nJe ne pourrais vous décrire la stupéfaction qui se peignit sur tous les\nvisages lorsqu'ils entendirent une voix humaine sortir des entrailles\ndu poisson; leur étonnement ne lit que s'accroître quand ils en virent\némerger un homme complètement nu. Bref, messieurs, je leur racontai\nl'aventure telle que je vous l'ai rapportée; ils en rirent à en mourir.\n\nAprès avoir pris quelque rafraîchissement, je me jetai à l'eau pour me\nlaver et je nageai vers la plage, où je retrouvai mes habits à la place\noù je les avais laissés. Si je ne me trompe dans mon calcul, j'étais\nresté emprisonné environ trois quarts d'heure dans le corps de ce\nmonstre.\n\n\n\n[Illustration]\n\n\nCHAPITRE IX\n\n\nQUATRIÈME AVENTURE DE MER\n\n\nLorsque j'étais encore au service de la Turquie, je m'amusais souvent\nà me promener sur mon yacht de plaisance dans la mer de Marmara, d'où\nl'on jouit d'un coup d'œil admirable sur Constantinople et sur le\nsérail du Grand Seigneur. Un matin, que je contemplais la beauté et la\nsérénité du ciel, j'aperçus dans l'air un objet rond, gros à peu près\ncomme une boule de billard, et au-dessous duquel paraissait pendre\nquelque chose. Je saisis aussitôt la meilleure et la plus longue de\nmes carabines, sans lesquelles je ne sors ni ne voyage jamais; je la\nchargeai à balle, et je tirai sur l'objet rond, mais je ne l'atteignis\npas. Je mis alors double charge: je ne fus pas plus heureux. Enfin, au\ntroisième coup, je lui envoyai quatre ou cinq balles qui lui firent un\ntrou dans le côté et l'amenèrent.\n\n[Illustration]\n\nReprésentez-vous mon étonnement quand je vis tomber, à deux toises\nà peine de mon bateau, un petit chariot doré, suspendu à un énorme\nballon, plus grand que la plus grosse coupole. Dans le chariot se\ntrouvait un homme avec une moitié de mouton rôti. Revenu de ma première\nsurprise, je formai avec mes gens un cercle autour de ce singulier\ngroupe.\n\n[Illustration R]\n\nL'homme, qui me sembla un Français et qui l'était en effet, portait à\nla poche de son gilet une couple de belles montres avec des breloques,\nsur lesquelles étaient peints des portraits de grands seigneurs et de\ngrandes dames. A chacune de ses boutonnières était fixée une médaille\nd'or d'au moins cent ducats, et à chacun de ses doigts brillait une\nbague précieuse garnie de diamants. Les sacs d'or dont regorgeaient ses\npoches faisaient traîner jusqu'à terre les basques de son habit.\n\n--Mon Dieu! pensai-je, cet homme doit avoir rendu des services\nextraordinaires à l'humanité pour que, par la ladrerie qui court, les\ngrands personnages l'aient accablé de tant de cadeaux.\n\nLa rapidité de la chute l'avait tellement étourdi, qu'il fut quelque\ntemps avant de pouvoir parler. Il finit cependant par se remettre et\nraconta ce qui suit:\n\n[Illustration]\n\n--Je n'ai pas eu, il est vrai, assez de tête, ni assez de science pour\nimaginer cette façon de voyager; mais j'ai eu le premier l'idée de m'en\nservir pour humilier les danseurs de corde et sauteurs ordinaires, et\nm'élever plus haut qu'eux. Il y a sept ou huit jours,--je ne sais au\njuste, car j'ai perdu la notion du temps,--je fis une ascension à la\npointe de Cornouailles, en Angleterre, emportant un mouton, afin de le\nlancer de haut en bas pour divertir les spectateurs. Malheureusement\nle vent tourna dix minutes environ après mon départ, et, au lieu de me\nmener du côté d'Exeter, où je comptais descendre, il me poussa vers\nla mer, au-dessus de laquelle j'ai flotté longtemps à une hauteur\nincommensurable.\n\nJe m'applaudis alors de ne pas avoir fait mon tour avec mon mouton;\ncar, le troisième jour, la faim m'obligea à tuer la pauvre bête. Comme\nj'avais dépassé depuis longtemps la lune, et qu'au bout de soixante-dix\nheures j'étais arrivé si près du soleil que les sourcils m'en avaient\nbrûlé, je plaçai le mouton, préalablement écorché, du côté où le soleil\ndonnait avec plus de force, si bien qu'en trois quarts d'heure il fut\nconvenablement rôti: c'est de cela que j'ai vécu pendant tout mon\nvoyage.\n\nLa cause de ma longue course doit être attribuée à la rupture d'une\ncorde qui communiquait à une soupape placée à la partie inférieure de\nmon ballon et destinée à laisser échapper l'air inflammable. Si vous\nn'aviez pas tiré sur mon ballon et ne l'aviez pas crevé, j'aurais pu\nrester, comme Mahomet, suspendu entre ciel et terre jusqu'au jugement\ndernier.\n\nIl fit généreusement cadeau de son chariot à mon pilote qui était au\ngouvernail, et jeta à la merle reste du mouton. Quant au ballon, déjà\nendommagé par mes balles, la chute avait achevé de le mettre en pièces.\n\n\n\n\n[Illustration]\n\n\n\n\nCHAPITRE X\n\n\nCINQUIÈME AVENTURE DE MER\n\n\nPuisque nous avons le temps, messieurs, de vider encore une bouteille\nde vin frais, je vais vous raconter une histoire fort singulière qui\nm'arriva peu de mois avant mon retour en Europe.\n\nLe Grand Seigneur, auquel j'avais été présenté par les ambassadeurs\nde LL. MM. les empereurs de Russie et d'Autriche, ainsi que par celui\ndu roi de France, m'envoya au Caire pour une mission de la plus\nhaute importance et qui devait être accomplie de manière à rester\néternellement secrète.\n\nJe me mis en route en grande pompe et accompagné d'une nombreuse suite.\nEn chemin, j'eus l'occasion d'augmenter ma domesticité de quelques\nsujets fort intéressants: me trouvant à quelques milles à peine de\nConstantinople, j'aperçus un homme grêle et maigre qui courait en\ndroite ligne à travers champs, avec une extrême rapidité, quoiqu'il\nportât attachée à chaque pied une masse de plomb pesant au moins\ncinquante livres. Saisi d'étonnement, je l'appelai et lui dis:\n\n--Où vas-tu si vite, mon ami, et pourquoi t'alourdir d'un tel poids?\n\n--J'ai quitté Vienne il y a une demi-heure, me répondit-il; j'y étais\ndomestique chez un grand seigneur qui vient de me donner mon congé.\nN'ayant plus besoin de ma célérité, je l'ai modérée au moyen de ces\npoids; car la modération fait la durée, comme avait coutume de le dire\nmon précepteur.\n\nCe garçon me plaisait assez. Je lui demandai s'il voulait entrer à\nmon service, et il accepta aussitôt. Nous nous remîmes en route, et\ntraversâmes beaucoup de villes, parcourûmes beaucoup de pays.\n\nEn chemin, j'avisai, non loin de la route, un individu étendu immobile\nsur une pelouse: on eût dit qu'il dormait. Il n'en était rien\ncependant, car il tenait son oreille collée contre terre, comme s'il\neût voulu écouter parler les habitants du monde souterrain.\n\n[Illustration]\n\n--Qu'écoutes-tu donc ainsi, mon ami? lui criai-je.\n\n--J'écoute pousser l'herbe, pour passer le temps, répliqua-t-il.\n\n--Et tu l'entends pousser?\n\n--Oh! bagatelle que cela.\n\n--Entre donc à mon service, mon ami; qui sait s'il ne fait pas bon\nparfois avoir l'oreille fine?\n\nMon drôle se releva et me suivit.\n\nNon loin de là, je vis sur une colline un chasseur qui ajustait son\nfusil et qui tirait dans le bleu du ciel.\n\n--Bonne chance! bonne chance, chasseur! lui criai-je; mais sur quoi\ntires-tu? Je ne vois rien que le bleu du ciel.\n\n--Oh! répondit-il, j'essaye cette carabine qui me vient de chez\nKuchenreicher, de Ratisbonne. Il y avait là-bas, sur la flèche de\nStrasbourg, un moineau que je viens d'abattre.\n\n[Illustration]\n\nCeux qui connaissent ma passion pour les nobles plaisirs de la chasse\nne s'étonneront pas si je leur dis que je sautai au cou de cet\nexcellent tireur. Je n'épargnai rien pour le prendre à mon service:\ncela va de soi.\n\nNous poursuivîmes notre voyage et nous atteignîmes enfin le mont Liban.\nLà nous trouvâmes, devant une grande forêt de cèdres, un homme court et\ntrapu, attelé à une corde qui enveloppait toute la forêt.\n\n--Qu'est-ce que tu tires là, mon ami? demandai-je à ce drôle.\n\n--J'étais venu pour couper du bois de construction, et, comme j'ai\noublié ma hache à la maison, je tâche de me tirer d'affaire du mieux\nque je puis.\n\nEn disant cela, il abattit d'un seul coup toute la forêt, qui mesurait\nbien un mille carré, comme si c'eût été un bouquet de roseaux. Vous\ndevinez facilement ce que je fis. J'eusse sacrifié mon traitement\nd'ambassadeur, plutôt que de laisser échapper ce gaillard-là.\n\n[Illustration]\n\nAu moment où nous mîmes le pied sur le territoire égyptien, il s'éleva\nun ouragan si formidable que j'eus un instant peur d'être renversé\navec mes équipages, mes gens et mes chevaux, et d'être emporté dans\nles airs. A gauche de la route il y avait une file de sept moulins\ndont les ailes tournaient aussi vite que le rouet de la plus active\nfileuse. Non loin de là se trouvait un personnage d'une corpulence\ndigne de John Falstaff, et qui tenait son index appuyé sur sa narine\ndroite. Dès qu'il eut aperçu notre détresse et vu comme nous nous\ndébattions misérablement dans l'ouragan, il se tourna vers nous, et\ntira respectueusement son chapeau avec le geste d'un mousquetaire\nqui se découvre devant son colonel. Le vent était tombé comme par\nenchantement, et les sept moulins restaient immobiles. Fort surpris de\ncette circonstance qui ne me semblait pas naturelle, je criai à l'homme:\n\n[Illustration L]\n\n--Hé! drôle! qu'est-ce-là? As-tu le diable au corps, où es-tu le diable\nen personne?\n\n--Pardonnez-moi, Excellence, répondit-il; je fais un peu de vent pour\nmon maître le meunier; de peur de faire tourner ses moulins trop fort,\nje m'étais bouché une narine.\n\n--Parbleu, me dis-je à moi-même, voilà un précieux sujet: ce\ngaillard-là te servira merveilleusement, lorsque, de retour chez toi,\nl'haleine te manquera pour raconter les aventures extraordinaires qui\nte sont arrivées dans tes voyages.\n\nNous eûmes bientôt conclu notre marché. Le souffleur quitta ses moulins\net me suivit.\n\n[Illustration: De peur de faire tourner ses moulins trop fort, je\nm'étais bouché une narine.]\n\nIl était temps que nous arrivassions au Caire. Dès que j'y eus accompli\nma mission selon mes désirs, je résolus de me défaire de ma suite,\nmaintenant inutile, à l'exception de mes nouvelles acquisitions, et de\nm'en retourner seul avec ces derniers, en simple particulier. Comme\nle temps était magnifique et le Nil plus admirable qu'on ne peut le\ndire, j'eus la fantaisie de louer une barque et de remonter jusqu'à\nAlexandrie. Tout alla pour le mieux jusqu'au milieu du troisième jour.\n\n[Illustration]\n\nVous avez sans doute entendu parler, messieurs, des inondations\nannuelles du Nil. Le troisième jour, comme je viens de vous le dire,\nle Nil commença à monter avec une extrême rapidité, et le lendemain\ntoute la campagne était inondée sur plusieurs milles de chaque côté. Le\ncinquième jour, après le coucher du soleil, ma barque s'embarrassa dans\nquelque chose que je pris pour des roseaux. Mais le lendemain matin,\nquand il fit jour, nous nous trouvâmes entourés d'amandiers chargés de\nfruits parfaitement mûrs et excellents à manger. La sonde nous indiqua\nsoixante pieds au-dessus du fond: il n'y avait moyen ni de reculer, ni\nd'avancer. Vers huit ou neuf heures, autant que j'en pus juger d'après\nla hauteur du soleil, il survint une rafale qui coucha notre bateau sur\nle côté: il embarqua une masse d'eau et coula presque immédiatement.\n\n[Illustration]\n\nHeureusement nous réussîmes à nous sauver tous,--nous étions huit\nhommes et deux enfants,--en nous accrochant aux arbres dont les\nbranches, assez fortes pour nous soutenir, ne l'étaient pas assez pour\nsupporter notre barque. Nous restâmes trois jours dans cette position,\nvivant exclusivement d'amandes; je n'ai pas besoin de vous dire que\nnous avions en abondance de quoi apaiser notre soif. Vingt-trois jours\naprès notre accident, l'eau commença à baisser avec autant de rapidité\nqu'elle avait monté, et le vingt-sixième jour nous pûmes mettre pied à\nterre.\n\n[Illustration]\n\nLe premier objet qui frappa nos yeux fut notre barque. Elle gisait\nenviron à deux cents toises de l'endroit où elle avait coulé bas.\nAprès avoir fait sécher au soleil nos affaires qui en avaient grand\nbesoin, nous prîmes dans les provisions de la barque ce qui nous était\nnécessaire, et nous nous remîmes en marche pour retrouver notre route.\nD'après les calculs les plus exacts, je comptai que nous avions été\nentraînés dans les terres à plus de cinquante milles hors de notre\nchemin. Au bout de sept jours nous atteignîmes le fleuve qui était\nrentré dans son lit, et racontâmes notre aventure à un bey. Il pourvut\nà tous nos besoins avec une extrême courtoisie, et mit sa propre\nbarque à notre disposition. Six journées de voyage nous amenèrent à\nAlexandrie, où nous nous embarquâmes pour Constantinople.\n\n[Illustration]\n\nJe fus reçu avec une distinction particulièrement gracieuse par le\nGrand Seigneur, et j'eus l'honneur de voir le harem où Sa Hautesse me\nconduisit elle-même et me permit de choisir autant de dames que je\nvoudrais, sans en excepter ses favorites.\n\n[Illustration]\n\nN'ayant pas coutume de me vanter de mes aventures galantes, je termine\nici ma narration, en vous souhaitant à tous une bonne nuit.\n\n[Illustration: Sa Hautesse me permit de choisir autant de dames que je\nvoudrais.]\n\n\n\n[Illustration]\n\n\n\n\nCHAPITRE XI\n\n\nSIXIÈME AVENTURE DE MER\n\n\nAyant terminé le récit de son voyage en Égypte, le baron se disposa à\naller se coucher, juste au moment où l'attention légèrement fatiguée de\nson auditoire se réveillait à ce mot de _harem._ On aurait bien voulu\navoir des détails sur cette partie de ses aventures, mais le baron fut\ninflexible; cependant, pour satisfaire aux bruyantes insistances de ses\namis, il consentit à leur raconter quelques traits de ses singuliers\ndomestiques, et continua en ces termes:\n\n[Illustration R]\n\nDepuis mon retour d'Égypte, je faisais la pluie et le beau temps chez\nle Grand Seigneur. Sa Hautesse ne pouvait vivre sans moi, et me priait\ntous les jours à dîner et à souper chez lui. Je dois avouer, messieurs,\nque l'empereur des Turcs est de tous les potentats du monde celui qui\nfait la meilleure chère, quant au manger du moins; car, pour ce qui est\nde la boisson, vous savez que Mahomet interdit le vin à ses fidèles.\nIl ne faut donc pas songer à boire un bon verre de ce liquide quand on\ndîne chez un Turc. Mais pour ne pas se pratiquer ouvertement, la chose\nn'en a pas moins lieu fréquemment en secret; et en dépit du Coran, plus\nd'un Turc s'entend aussi bien qu'aucun prélat allemand à vider une\nbouteille. C'était le cas de Sa Hautesse.\n\nA ces dîners auxquels assistait habituellement le surintendant général,\nc'est-à-dire le mufti _in partem salarii_ qui disait le _Benedicite_\net les _Grâces_ au commencement et à la fin du repas, il n'était point\nquestion de vin. Mais lorsqu'on se levait de table, un bon petit bacon\nattendait Sa Hautesse dans son cabinet. Un jour le Grand Seigneur me\nfit signe de l'y suivre. Lorsque nous nous y fûmes enfermés, il tira\nune bouteille d'une armoire, et me dit:\n\n--Münchhausen, je sais que vous autres chrétiens vous vous connaissez\nen bon vin. Voici une bouteille de tokay, la seule que je possède, et\nje suis sûr que de votre vie vous n'en avez goûté de meilleur.\n\nSur quoi Sa Hautesse remplit son verre et le mien: nous trinquâmes, et\nnous bûmes.\n\n--Hein! reprit-il, que dites-vous de celui-là? C'est du superfin, cela!\n\n[Illustration]\n\n--Ce petit vin est bon, répondis-je. Mais, avec la permission de Votre\nHautesse, je dois lui dire que j'en ai bu de bien meilleur à Vienne,\nchez l'auguste empereur Charles VI. Mille tonnerres! je voudrais que\nvous l'eussiez goûté!\n\n--Cher Münchhausen, répliqua-t-il, je ne veux pas vous blesser; mais je\ncrois qu'il est impossible de trouver de meilleur tokay: je tiens cette\nunique bouteille d'un seigneur hongrois qui en faisait le plus grand\ncas.\n\n--Plaisanteries que tout cela, monseigneur! Il y a tokay et tokay!\nMessieurs les Hongrois d'ailleurs ne brillent pas par la générosité.\nCombien pariez-vous que d'ici à une heure je vous procure une bouteille\nde tokay, tirée de la cave impériale de Vienne, et qui aura une tout\nautre figure que celle-ci?\n\n--Münchhausen, je crois que vous extravaguez.\n\n--Je n'extravague point: dans une heure je vous apporte une bouteille\nde tokay prise dans la cave des empereurs d'Autriche, et d'un tout\nautre numéro que celle piquette-là.\n\n--Münchhausen! Münchhausen! vous voulez vous moquer de moi, cela ne me\nplaît point. Je vous ai toujours connu pour un homme raisonnable et\nvéridique, mais vraiment je suis tenté de croire que vous battez la\ncampagne.\n\n--Eh bien! que Votre Hautesse accepte le pari. Si je ne remplis\nmon engagement,--et vous savez que je suis ennemi juré des\nhâbleries,--Votre Hautesse sera libre de me faire couper la tête: et ma\ntête n'est pas une citrouille! Voilà mon enjeu, quel est le vôtre?\n\n[Illustration]\n\n--Tope! j'accepte, dit l'empereur. Si au coup de quatre heures la\nbouteille n'est pas là, je vous ferai couper la tête sans miséricorde:\ncar je n'ai pas l'habitude de me laisser jouer, même par mes meilleurs\namis. Par contre, si vous accomplissez votre promesse, vous pourrez\nprendre dans mon trésor autant d'or, d'argent, de perles et de pierres\nprécieuses que l'homme le plus fort en pourra porter.\n\n--Voilà qui est parler, répondis-je.\n\nJe demandai une plume et de l'encre, et j'écrivis à l'impératrice-reine\nMarie-Thérèse le billet suivant:\n\n«Votre Majesté a sans doute, en sa qualité d'héritière universelle de\nl'empire, hérité de la cave de son illustre père. Oserai-je la supplier\nde remettre au porteur une bouteille de ce tokay dont j'ai bu si\nsouvent avec feu son père? Mais du meilleur, car il s'agit d'un pari!\nJe saisis cette occasion pour assurer Votre Majesté du profond respect\navec lequel j'ai l'honneur d'être, etc., etc.\n\n                                               «Baron de Münchhausen.»\n\nComme il était déjà trois heures et cinq minutes, je remis ce billet\nsans le cacheter à mon coureur, qui détacha ses poids et se mit\nimmédiatement en route pour Vienne.\n\n[Illustration]\n\nCela fait, nous bûmes, le Grand Seigneur et moi, le reste de la\nbouteille, en attendant celle de Marie-Thérèse. Trois heures un quart\nsonnèrent, trois heures et demie, quatre heures moins un quart, et le\ncoureur ne revenait pas. J'avoue que je commençais à être assez mal à\nmon aise, d'autant plus que je voyais Sa Hautesse diriger de temps en\ntemps les yeux sur le cordon de la sonnette, pour appeler le bourreau.\nIl m'accorda cependant la permission de descendre dans le jardin\npour prendre un peu l'air, escorté toutefois de deux muets qui ne me\nperdaient pas de vue. L'aiguille marquait la cinquante-cinquième minute\naprès trois heures: j'étais dans une angoisse mortelle,--c'était le\ncas de le dire.--J'envoyai chercher immédiatement mon écouteur et mon\ntireur.\n\n[Illustration L]\n\nIls arrivèrent aussitôt; mon écouteur se coucha à terre pour entendre\nsi mon coureur ne venait pas: à mon grand désespoir, il m'annonça que\nle drôle se trouvait tort loin de là profondément endormi et ronflant\nde tous ses poumons. A peine mon brave tireur eut-il appris cela, qu'il\ncourut sur une terrasse élevée, et, se dressant sur ses pointes pour\nmieux voir, s'écria: «Sur mon âme! je le vois, le paresseux: il est\ncouché au pied d'un chêne, aux environs de Belgrade, avec la bouteille\nà côté de lui. Attendez, je vais le chatouiller un peu.» En même temps\nil ajusta sa carabine, et envoya la charge en plein dans le feuillage\nde l'arbre. Une grêle de glands, de branches et de feuilles s'abattit\nsur le dormeur; craignant d'avoir reposé trop longtemps, il reprit sa\ncourse avec une telle rapidité qu'il arriva au cabinet du sultan avec\nla bouteille de tokay et un billet autographe de Marie-Thérèse, à trois\nheures cinquante-neuf minutes et demie.\n\nSaisissant aussitôt la bouteille, le noble gourmet se mit à la déguster\navec une indicible volupté.\n\n[Illustration R]\n\n--Münchhausen, me dit-il, vous ne trouverez point mauvais que je garde\nce flacon pour moi tout seul. Vous avez à Vienne plus de crédit que\nmoi, et vous êtes plus à même d'en obtenir un second.\n\nLà-dessus, il enferma la bouteille dans son armoire, mit la clef dans\nla poche de son pantalon, et sonna son trésorier.--Quel ravissant\ntintement!\n\n--Il faut maintenant que je paye ma gageure, reprit-il. Écoute, dit-il\nau trésorier, tu laisseras mon ami Münchhausen prendre dans mon trésor\nautant d'or, de perles et de pierres précieuses que l'homme le plus\nfort en pourra porter. Va!\n\nLe trésorier s'inclina le nez jusqu'à terre devant son maître, qui me\nserra cordialement la main et nous congédia tous deux.\n\n[Illustration R]\n\nVous pensez bien que je ne tardai pas une seconde à faire exécuter\nl'ordre que le sultan avait donné en ma faveur; j'envoyai chercher mon\nhomme fort qui apporta sa grosse corde de chanvre, et me rendis au\ntrésor. Je vous assure que lorsque j'en sortis avec mon serviteur, il\nn'y restait plus grand'chose. Je courus incontinent avec mon butin au\nport, où j'affrétai le plus grand bâtiment que je pus trouver, et je\nfis lever l'ancre, afin de mettre mon trésor en sûreté avant qu'il ne\nme survint quelque désagrément.\n\n[Illustration L]\n\nCe que je craignais ne manqua pas d'arriver. Le trésorier, laissant\nouverte la porte du trésor,--il était assez superflu de la\nrefermer,--s'était rendu en toute hâte chez le Grand Seigneur, et\nlui avait annoncé de quelle façon j'avais profité de sa libéralité.\nSa Hautesse en était restée tout abasourdie, et s'était prise à se\nrepentir de sa précipitation. Elle avait ordonné au grand amiral de\nme poursuivre avec toute la flotte, et de me faire comprendre qu'elle\nn'avait point entendu la gageure de celle façon. Je n'avais que deux\nmilles d'avance, et lorsque je vis la flotte de guerre turque courir\nsur moi toutes voiles dehors, j'avoue que ma tête, qui commençait à se\nraffermir sur mes épaules, se remit à branler plus fort que jamais.\nMais mon souffleur était là.\n\n[Illustration]\n\n--Que Votre Excellence soit sans inquiétude, me dit-il.\n\n[Illustration]\n\nIl se posta à l'arrière du bâtiment, de façon à avoir une de ses\nnarines dirigée sur la flotte turque et l'autre sur nos voiles; puis il\nse mit à souffler avec une telle violence que la flotte fut refoulée\ndans le port avec bris de mâts, de cordages et d'agrès, et qu'en même\ntemps mon navire atteignit en quelques heures les côtes d'Italie.\n\n[Illustration]\n\nJe ne tirai cependant pas grand profit de mon trésor. Car, malgré les\naffirmations contraires de M. le bibliothécaire Jagemann de Weimar, la\nmendicité est si grande en Italie et la police si mal faite, que je\ndus distribuer en aumônes la plus grande partie de mon bien. Le reste\nme fut pris par des voleurs de grand chemin, aux environs de Rome, sur\nle territoire de Lorette. Ces drôles ne se firent aucun scrupule de me\ndépouiller ainsi, car la millième partie de ce qu'ils me volèrent eût\nsuffi à acheter à Rome une indulgence plénière pour toute la compagnie\net ses descendants et arrière-descendants.\n\nMais voici, messieurs, l'heure où j'ai l'habitude de m'aller coucher.\nAinsi donc, bonne nuit!\n\n[Illustration]\n\n\n[Illustration: Ces drôles ne se firent aucun scrupule de me dépouiller.]\n\n\n\n[Illustration]\n\n\n\n\nCHAPITRE XII\n\n\nSEPTIÈME AVENTURE DE MER RÉCITS AUTHENTIQUES D'UN PARTISAN QUI PRIT LA\nPAROLE EN L'ABSENCE DU BARON\n\n\nAprès avoir raconté l'aventure qui précède, le baron se retira,\nlaissant la société en bel le humeur; en sortant, il promit de donner\nà la première occasion les aventures de son père, jointes à d'autres\nanecdotes des plus merveilleuses.\n\nComme chacun disait son mot sur les récits du baron, une des personnes\nde la société, qui l'avait accompagné dans son voyage en Turquie,\nrapporta qu'il existait non loin de Constantinople une pièce de canon\nénorme, dont le baron Tott a fait mention dans ses Mémoires. Voici à\npeu près, autant que je m'en souviens, ce qu'il en dit:\n\n«Les Turcs avaient posé sur la citadelle, non loin de la ville, au\nbord du célèbre fleuve le Simoïs, un formidable canon. Il était coulé\nen bronze, et lançait des boulets de marbre d'au moins onze cents\nlivres. J'avais grand désir de tirer ce canon, dit le baron Tott, pour\njuger de son effet. Toute l'année tremblait à la pensée de cet acte\naudacieux, car on tenait pour certain que la commotion ferait crouler\nla citadelle et la ville entière. J'obtins cependant la permission\nque je demandais. Il ne fallut pas moins de trois cent trente livres\nde poudre pour charger la pièce; le boulet que j'y mis pesait, comme\nje l'ai dit plus haut, onze cents livres. Au moment où le canonnier\napprocha la mèche, les curieux qui m'entouraient se reculèrent à une\ndistance respectueuse. J'eus toutes les peines du monde à persuader au\npacha, qui assistait à l'expérience, qu'il n'y avait rien à redouter.\nLe canonnier lui-même, qui devait sur mon signal mettre le feu à la\npièce, était extrêmement ému. Je me postai derrière la place, dans\nun réduit; je donnai le signal, et au même instant je ressentis une\nsecousse pareille à celle que produirait un tremblement de terre. A\nenviron trois cents toises le boulet éclata en trois morceaux qui\nvolèrent par-dessus le détroit, refoulèrent les eaux sur la rive, et\ncouvrirent d'écume le canal, tout large qu'il était.»\n\nTels sont, messieurs, si ma mémoire me sert bien, les détails que donne\nle baron Tott sur le plus grand canon qu'il y ait au monde. Lorsque je\nvisitai ce pays avec le baron de Münchhausen, l'histoire du baron Tott\nétait encore citée comme un exemple inouï de courage et de sang-froid.\n\nMon protecteur, qui ne pouvait supporter qu'un Français fit plus et\nmieux que lui, prit le canon sur son épaule et, après l'avoir placé\nbien en équilibre, sauta droit dans la mer, et nagea jusqu'à l'autre\nbord du canal. Malheureusement il eut la fâcheuse idée de lancer le\ncanon dans la citadelle et de le renvoyer à sa première place: je dis\nmalheureusement, parce qu'il lui glissa de la main au moment où il le\nbalançait pour le jeter: de sorte que la pièce tomba dans le canal, où\nelle repose encore et où elle reposera probablement jusqu'au jour du\njugement dernier.\n\nCe fut cette affaire, messieurs, qui brouilla complètement le baron\navec le Grand Seigneur. L'histoire du trésor était depuis longtemps\noubliée, car le sultan possédait assez de revenus pour remplir à\nnouveau sa caisse, et c'était sur une invitation directe du Grand\nSeigneur que le baron se trouvait en ce moment en Turquie. Il y serait\nprobablement encore si la perte de cette célèbre pièce de canon n'avait\nmécontenté le souverain à ce point qu'il donna l'ordre irrévocable de\ntrancher la tête au baron.\n\n[Illustration L]\n\nMais une certaine sultane, qui avait pris mon maître en grande amitié,\nl'avertit de cette sanguinaire résolution: bien plus, elle le tint\ncaché dans sa chambre, tandis que l'officier chargé de l'exécution\nle cherchait de tous côtés. La nuit suivante, nous enfuîmes à bord\nd'un bâtiment qui mettait à la voile pour Venise, et nous échappâmes\nheureusement à cet affreux danger.\n\nLe baron n'aime pas à parler de cette histoire, parce que cette fois\nil ne réussit pas à exécuter ce qu'il avait entrepris, et aussi parce\nqu'il faillit y laisser sa peau. Cependant, comme elle n'est nullement\nde nature à blesser son honneur, j'ai coutume de la raconter quand il a\nle dos tourné.\n\nMaintenant, messieurs, vous connaissez à fond le baron de Münchhausen,\net j'espère que vous n'avez plus aucun doute à élever à l'endroit de sa\nvéracité; mais afin que vous ne puissiez point non plus soupçonner la\nmienne, il faut que je vous dise en peu de mots qui je suis.\n\n[Illustration R]\n\nMon père était originaire de Berne en Suisse. Il y exerçait l'emploi\nd'inspecteur des rues, allées, ruelles et ponts; ces sortes de\nfonctionnaires portent dans cette ville le titre, le titre ... hum!...\nle titre de balayeurs. Ma mère, native des montagnes de la Savoie,\nportait au cou un goître d'une grosseur et d'une beauté remarquables,\nce qui n'est pas rare chez les dames de ce pays. Elle abandonna fort\njeune ses parents, et sa bonne étoile l'amena dans la ville où mon père\navait reçu le jour. Elle vagabonda quelque peu: mon père ayant parfois\nle défaut analogue, ils se rencontrèrent un jour dans la maison de\ndétention.\n\nIls devinrent amoureux l'un de l'autre et se marièrent. Cette union\nne fut pas heureuse; mon père ne tarda pas à quitter ma mère en lui\nassignant pour toute pension alimentaire le revenu d'une hotte de\nchiffonnier qu'il lui mit sur le dos. La brave femme s'attacha à une\ntroupe ambulante qui montrait des marionnettes; la fortune finit par la\nconduire à Rome, où elle établit un commerce d'huîtres.\n\nVous avez sans doute entendu parler du pape Ganganelli, connu sous\nle nom de Clément XIV, et vous savez combien il aimait les huîtres.\nUn vendredi qu'il allait en grande pompe dire la messe à l'église\nde Saint-Pierre, il aperçut les huîtres de ma mère,--elles étaient\nremarquablement belles et extrêmement fraîches, m'a-t-elle dit\nsouvent,--et ne put faire autrement que de s'arrêter pour en goûter; il\nfit faire halte aux cinq cents personnes qui le suivaient, et envoya\ndire à l'église qu'il ne pourrait pas célébrer la messe ce matin-là.\nIl descendit de cheval,--car les papes vont à cheval dans les grandes\noccasions,--entra dans la boutique de ma mère, et avala toutes les\nhuîtres qui s'y trouvaient; mais comme il y en avait encore à la cave,\nil appela sa suite qui épuisa complétement la prévision: le pape et\nses gens restèrent jusqu'au soir, et avant de partir ils l'accablèrent\nd'indulgences non-seulement pour ses fautes passées et présentes, mais\nencore pour tous ses péchés à venir.\n\nMaintenant, messieurs, vous me permettrez de ne pas vous expliquer\nplus clairement ce que j'ai de commun avec cette histoire d'huîtres:\nje pense que vous m'avez suffisamment compris pour être fixé sur ma\nnaissance.\n\n\n\n[Illustration]\n\n\n\n\nCHAPITRE XIII\n\n\nLE BARON REPREND SON RÉCIT\n\n\nComme on peut bien le penser, les amis du baron ne cessaient de le\nsupplier de continuer le récit aussi instructif qu'intéressant de ses\nsingulières aventures; mais ces prières restèrent longtemps inutiles.\nLe baron avait la louable habitude de ne rien faire qu'à sa fantaisie,\net l'habitude plus louable encore de ne se laisser détourner sous aucun\nprétexte de ce principe bien arrêté. Enfin le soir tant désiré arriva,\net un gros rire du baron annonça à ses amis que l'inspiration était\nvenue, et qu'il allait satisfaire à leurs instances:\n\n    «Conticuere omnes, intentique ora tenebant;»\n\nou, pour parler plus clairement, tout le monde se tut et tendit une\noreille attentive. Semblable à Énée, Münchhausen, se soulevant sur le\nsofa bien rembourré, commença ainsi:\n\n[Illustration L]\n\nPendant le dernier siège de Gibraltar, je m'embarquai sur une flotte\ncommandée par lord Rodney et destinée à ravitailler cette forteresse;\nje voulais rendre visite à mon vieil ami, le général Elliot, qui\ngagna à la défense de cette place des lauriers que le temps ne pourra\nflétrir. Après avoir donné quelques instants aux premiers épanchements\nde l'amitié, je parcourus la forteresse avec le général, afin de\nreconnaître les travaux et les dispositions de l'ennemi. J'avais\napporté de Londres un excellent télescope à miroir, acheté chez Dollon.\nGrâce à cet instrument, je découvris que l'ennemi pointait sur le\nbastion où nous nous trouvions une pièce de trente-six. Je le dis au\ngénéral, qui vérifia le fait et vit que je ne me trompais pas.\n\n[Illustration: Je parcourus la forteresse avec le général.]\n\nAvec sa permission, je me fis apporter une pièce de quarante-huit prise\nà la batterie voisine, et je la pointai si juste,--car pour ce qui est\nde l'artillerie, je puis dire sans me vanter que je n'ai pas encore\ntrouvé mon maître,--que j'étais sûr d'atteindre mon but.\n\n[Illustration]\n\nJ'observai alors avec la plus grande attention les mouvements des\ncanonniers ennemis, et, au moment où ils approchaient la mèche de la\nlumière, je donnai aux nôtres le signal de faire feu: les deux boulets\nparvenus à moitié de leur trajet se rencontrèrent et se heurtèrent avec\nune violence terrible qui produisit un effet des plus surprenants.\nLe boulet ennemi retourna si vivement sur ses pas, que non-seulement\nil broya la tête du canonnier qui l'avait envoyé, mais qu'encore il\ndécapita seize autres soldats qui s'enfuyaient vers la côte d'Afrique.\n\n[Illustration]\n\nAvant d'atteindre le pays de Barbarie, il coupa le grand mât de\ntrois vaisseaux qui se trouvaient dans le port rangés en ligne les\nuns derrière les autres, pénétra à deux cents milles anglais dans\nl'intérieur des terres, effondra le toit d'une hutte de paysan, et,\naprès avoir enlevé à une pauvre vieille qui y dormait sur le dos la\nseule dent qui lui restait, s'arrêta enfin dans son gosier.\n\n[Illustration L]\n\nSon mari, rentrant quelques instants après, essaya de retirer le\nboulet: n'y pouvant réussir, il eut l'heureuse idée de l'enfoncer avec\nun maillet dans l'estomac de sa femme, d'où il sortit quelque temps\naprès par la méthode naturelle.\n\nCe ne fut pas là le seul service que nous rendit notre boulet: il ne\nse contenta pas de refouler de la façon que je viens de raconter celui\nde l'ennemi; mais, continuant son chemin, il enleva de sur son affût\nla pièce pointée contre nous et la lança avec une telle violence dans\nla coque d'un bâtiment, que ce dernier prit une voie d'eau énorme et\nsombra peu à peu avec un millier de matelots et un grand nombre de\nsoldats de marine qui s'y trouvaient.\n\n[Illustration]\n\nCe fut sans contredit un fait extraordinaire. Je ne veux cependant pas\nme l'attribuer à moi seul: il est vrai que l'honneur de l'idée première\nen revient à ma sagacité, mais le hasard me seconda dans une certaine\nproportion. Ainsi je m'aperçus, la chose faite, que notre pièce de\nquarante-huit avait reçu double charge de poudre; de là l'effet\nmerveilleux produit sur le boulet ennemi, et la portée extrême de notre\nprojectile.\n\nLe général Elliot, pour me récompenser de ce service signalé, m'offrit\nun brevet d'officier que je refusai, me contentant des remercîments\nqu'il me fit le soir même à dîner, en présence de tout son état-major.\n\n[Illustration]\n\nComme je suis fort porté pour les Anglais, qui sont un peuple vraiment\nbrave, je me mis dans la tête de ne pas quitter cette forteresse\nsans avoir rendu un nouveau service à ceux qui la défendaient; trois\nsemaines après l'affaire du canon de quarante-huit, il se présenta\nenfin une bonne occasion.\n\n\n[Illustration R]\n\nJe me déguisai en prêtre catholique, sortis de la forteresse vers\nune heure du matin, et réussis à pénétrer dans le camp de l'ennemi à\ntravers ses lignes. Je me rendis à la tente où le comte d'Artois avait\nréuni les chefs de corps et un grand nombre d'officiers pour leur\ncommuniquer le plan d'attaque de la forteresse, à laquelle il voulait\ndonner l'assaut le lendemain. Mon déguisement me protégea si bien, que\npersonne ne pensa à me repousser et que je pus écouter tranquillement\ntout ce qui se dit. Le conseil fini, ils allèrent se coucher, et je vis\nbientôt l'armée entière, tout le camp, jusqu'aux sentinelles, plongé\ndans le plus profond sommeil.\n\n[Illustration]\n\nJe me mis aussitôt à l'œuvre: je démontai tous leurs canons au nombre\nde plus de trois cents, depuis les pièces de quarante-huit jusqu'à\ncelles de vingt-quatre, et je les jetai à la mer, où ils tombèrent à\nenviron trois milles de là: comme je n'avais personne pour m'aider,\nje puis dire que c'est le travail le plus pénible que j'aie jamais\naccompli, à l'exception d'un seul cependant qu'on vous a fait connaître\nen mon absence: je veux parler de l'énorme canon turc décrit par le\nbaron Tott et avec lequel je traversai le canal à la nage.\n\n[Illustration]\n\nCette opération terminée, je transportai tous les affûts et tous les\ncaissons au milieu du camp, et, de peur que le roulement des roues ne\nréveillât les gens, je les pris deux à deux sous les bras. Cela faisait\nun beau tas, aussi élevé pour le moins que les rochers de Gibraltar.\nJe saisis alors un fragment d'une pièce de fer de quarante-huit, et\nme procurai du feu en le frappant contre un pan de mur, reste d'une\nconstruction mauresque, et qui était enterré de vingt pieds au moins:\nj'allumai une mèche et mis le feu au tas. J'oubliais de vous dire que\nj'avais jeté sur le sommet toutes les munitions de guerre.\n\n[Illustration]\n\nComme j'avais eu soin de placer dans le bas les matières les plus\ncombustibles, la flamme s'élança bientôt haute et éclatante. Pour\nécarter de moi tout soupçon, je fus le premier à donner l'alarme. Comme\nvous pouvez le penser, le camp se trouva saisi d'épouvante; on supposa,\npour expliquer ce désastre, que les gens de la forteresse avaient fait\nune sortie, tué les sentinelles, et étaient ainsi parvenus à détruire\nl'artillerie.\n\nM. Drinkwater, dans la relation qu'il a faite de ce siège célèbre,\nparle bien d'une grande perte éprouvée par l'ennemi à la suite d'un\nincendie, mais il n'a pas su à quoi en attribuer la cause: cela, du\nreste, ne lui était guère possible, car--bien que j'aie, à moi tout\nseul, dans cette nuit, sauvé Gibraltar--je n'ai mis personne dans ma\nconfidence, pas même le général Elliot. Le comte d'Artois, pris d'une\npanique, s'enfuit avec tous ses gens, et, sans s'arrêter en route,\narriva d'une traite à Paris. La terreur que leur avait inspirée ce\ndésastre fut telle, qu'ils ne purent manger de trois mois, et vécurent\nsimplement de l'air du temps, à la façon des caméléons.\n\n[Illustration]\n\nEnviron deux mois après que j'eus rendu cet éclatant service aux\nassiégés, je me trouvais à déjeuner avec le général Elliot, quand tout\nà coup une bombe--je n'avais pas eu le temps d'envoyer les mortiers de\nl'ennemi rejoindre ses canons--pénétra dans la chambre et tomba sur\nla table. Le général fit ce qu'aurait fait tout le monde en pareil\ncas, il sortit immédiatement de la salle. Moi, je saisis la bombe\navant qu'elle n'éclatât, et la portai au sommet du rocher. De cet\nobservatoire j'aperçus sur une falaise, non loin du camp ennemi, un\ngrand rassemblement de gens; mais je ne pouvais distinguer à l'œil nu\nce qu'ils faisaient. Je pris mon télescope, et je reconnus que c'était\nl'ennemi qui, ayant arrêté deux des nôtres, un général et un colonel\navec lesquels j'avais dîné la veille, et qui s'étaient introduits le\nsoir dans le camp des assiégeants, s'apprêtait à les pendre en qualité\nd'espions.\n\n\n[Illustration L]\n\nLa distance était trop grande pour qu'il fût possible de lancer avec\nsuccès la bombe à la main. Heureusement je me souvins que j'avais\ndans ma poche la fronde dont David se servit si avantageusement\ncontre le géant Goliath. J'y plaçai ma bombe et la projetai au milieu\ndu rassemblement. En touchant terre, elle éclata, et tua tous les\nassistants, à l'exception des deux officiers anglais, qui, pour leur\nbonheur, étaient déjà pendus: un éclat sauta contre le pied de la\npotence et la fit tomber.\n\n[Illustration]\n\nNos deux amis, dès qu'ils se sentirent sur la terre ferme, cherchèrent\nà s'expliquer ce singulier événement; et voyant les gardes, les\nbourreaux et toute l'assistance occupés à mourir, ils se débarrassèrent\nréciproquement de l'incommode cravate qui leur serrait le col,\ncoururent au rivage, sautèrent dans une barque espagnole, et se tirent\nconduire à nos vaisseaux par les deux bateliers qui s'y trouvaient.\n\n[Illustration]\n\n\nQuelques minutes après, comme j'étais en train de raconter le fait\nau général Elliot, ils arrivèrent, et, après un cordial échange de\nremercîments et d'explications, nous célébrâmes celte journée mémorable\nle plus gaiement du monde.\n\n[Illustration L]\n\nVous désirez tous, messieurs, je le lis dans vos yeux, savoir comment\nje possède un trésor aussi précieux que la fronde dont je viens de vous\nparler. Eh bien! je vais vous le dire. Je descends, vous ne l'ignorez\nsans doute pas, de la femme d'Urie, qui eut, comme vous savez, des\nrelations très-intimes avec David. Mais avec le temps--cela se voit\nsouvent--Sa Majesté se refroidit singulièrement à l'endroit de la\ncomtesse, car elle avait reçu ce titre trois mois après la mort de\nson mari. Un jour ils se prirent de querelle au sujet d'une question\nde la plus haute importance, qui était de savoir dans quelle contrée\nfut construite l'arche de Noé et à quel endroit elle s'était arrêtée\naprès le déluge. Mon aïeul avait la prétention de passer pour un grand\nantiquaire, et la comtesse était présidente d'une société historique:\nlui, avait cette faiblesse commune à la plupart des grands et à tous\nles petits, de ne pas souffrir la contradiction, et elle, ce défaut,\nspécial à son sexe, de vouloir avoir raison en toutes choses; bref, une\nséparation s'ensuivit.\n\n[Illustration: Nous célébrâmes cette journée mémorable le plus gaiement\ndu monde.]\n\nElle l'avait souvent entendu parler de cette fronde comme d'un objet\ndes plus précieux, et trouva bon de l'emporter, sous prétexte de\ngarder un souvenir de lui. Mais, avant que mon aïeule eût franchi la\nfrontière, on s'aperçut de la disparition de la fronde, et on lança six\nhommes de la garde du roi pour la reprendre. La comtesse poursuivie se\nservit si bien de cet objet qu'elle atteignit un de ces soldats qui,\nplus zélé que les autres, s'était avancé en tète de ses compagnons,\nprécisément à la place où Goliath avait été frappé par David. Les\ngardes, voyant leur camarade tomber mort, délibérèrent mûrement et\npensèrent que ce qu'il y avait de mieux à faire, c'était d'en référer\nau roi: la comtesse, de son côté, jugea prudent de continuer son voyage\nvers l'Égypte, où elle comptait de nombreux amis à la cour.\n\n[Illustration]\n\nJ'aurais dû vous dire d'abord que de plusieurs enfants qu'elle avait\neus de Sa Majesté, elle avait emmené dans son exil un fils, son fils\nbien-aimé. La fertilité de l'Égypte ayant donné à ce fils plusieurs\nfrères et sœurs, la comtesse lui laissa par un article particulier de\nson testament la fameuse fronde; et c'est de lui qu'elle m'est venue en\nligne directe.\n\nMon arrière-arrière-grand-père, qui possédait cette fronde, et qui\nvivait il y a environ deux cent cinquante ans, fit, dans un voyage\nen Angleterre, la connaissance d'un poëte qui n'était rien moins que\nplagiaire, et n'en était que d'autant plus incorrigible braconnier;\nil s'appelait Shakespeare. Ce poëte, sur les terres duquel, par droit\nde réciprocité sans doute, les Anglais et les Allemands braconnent\naujourd'hui impudemment, emprunta maintes fois cette fronde à mon\npère et tua, au moyen de cette arme, tant de gibier à sir Thomas\nLucy, qu'il faillit encourir le sort de mes deux amis de Gibraltar.\nLe pauvre homme fut jeté en prison, et mon aïeul lui fit rendre la\nliberté par un procédé tout particulier vers la fin de sa vie à charge\nà elle-même. S'habiller, se déshabiller, manger, boire, accomplir enfin\nmaintes autres fonctions que je n'énumérerai point, lui rendaient la\nvie insupportable. Mon aïeul la mit en état de faire tout cela selon\nson caprice, par elle-même ou par procuration. Et que pensez-vous que\ndemanda mon père en récompense de ce signalé service?--la liberté de\nShakespeare.--La reine ne put lui rien faire accepter de plus. Cet\nexcellent homme avait pris le poëte en telle affection, qu'il eût\nvolontiers donné une partie de sa vie pour prolonger celle de son ami.\n\n[Illustration]\n\nDu reste, je puis vous assurer, messieurs, que la méthode pratiquée par\nla reine Élisabeth, de vivre sans nourriture, n'obtint aucun succès\nauprès de ses sujets, au moins auprès de ces gourmands affamés auxquels\non a donné le nom de _mangeurs de bœufs._ Elle-même n'y résista pas\nplus de sept ans et demi, au bout desquels elle mourut d'inanition.\n\nMon père, duquel j'héritai la fronde peu de temps avant mon départ pour\nGibraltar, me raconta l'anecdote suivante, que ses amis lui ont souvent\nentendu rapporter, et dont personne de ceux qui ont connu le digne\nvieillard ne révoquera la véracité.\n\n«Dans l'un des nombreux séjours que je fis en Angleterre, me disait-il,\nje me promenais une fois sur le bord de la mer non loin de Harwick.\nTout d'un coup voilà un cheval marin qui s'élance furieux contre moi.\nJe n'avais pour toute arme que ma fronde, avec laquelle je lui envoyai\ndeux galets si adroitement lancés que je lui crevai les deux yeux. Je\nlui sautai alors sur le dos et le dirigeai vers la mer: car, en perdant\nles yeux, il avait perdu toute sa férocité, et se laissait mener comme\nun mouton. Je lui passai ma fronde dans la bouche en guise de bride, et\nle poussai au large.\n\n«En moins de trois heures nous eûmes atteint le rivage opposé: nous\navions fait trente milles dans ce court espace de temps. A Helvoetsluys\nje vendis ma monture moyennant sept cents ducats à l'hôte des Trois\nCoupes, qui montra cette bête extraordinaire pour de l'argent et s'en\nfit un joli revenu.--On peut en voir la description dans Buffon.--Mais\nsi singulière que fût cette façon de voyager, ajoutait mon père, les\nobservations et les découvertes qu'elle me permit de faire sont encore\nplus extraordinaires.\n\n[Illustration: D'autres étaient rangés en cercle et chantaient des\nchœurs d'une beauté inexprimable.]\n\n«L'animal sur le dos duquel j'étais assis ne nageait pas: il courait\navec une incroyable rapidité sur le fond de la mer, chassant devant lui\ndes millions de poissons tout différents de ceux qu'on a l'habitude\nde voir: quelques-uns avaient la tête au milieu du corps, d'autres au\nbout de la queue; d'autres étaient rangés en cercle et chantaient des\nchœurs d'une beauté inexprimable; d'autres construisaient avec l'eau\ndes édifices transparents, entourés de colonnes gigantesques dans\nlesquelles ondulait une matière fluide et éclatante comme la flamme la\nplus pure. Les chambres de ces édifices offraient toutes les commodités\ndésirables aux poissons de distinction: quelques-unes étaient\naménagées pour la conservation du frai; une suite de salles spacieuses\nétait consacrée à l'éducation des jeunes poissons. La méthode\nd'enseignement,--autant que j'en pus juger par mes yeux, car les\nparoles étaient aussi inintelligibles pour moi que le chant des oiseaux\nou le dialogue des grillons,--cette méthode me semble présenter tant\nde rapport avec cette employée de notre temps dans les établissements\nphilantropiques, que je suis persuadé qu'un de ces théoriciens a fait\nun voyage analogue au mien, et pêché ses idées dans l'eau, plutôt que\nde les avoir attrapées dans l'air. Du reste, de ce que je viens de vous\ndire vous pouvez conclure qu'il reste encore au monde un vaste champ\nouvert à l'exploitation et à l'observation. Mais je reprends mon récit.\n\n«Entre autres incidents de voyage, je passai sur une immense chaîne de\nmontagnes, aussi élevée, pour le moins, que les Alpes. Une foule de\ngrands arbres d'essences variées s'accrochaient aux flancs des rochers.\nSur ces arbres poussaient des homards, des écrevisses, des huîtres,\ndes moules, des colimaçons de mer, dont quelques-uns si monstrueux\nqu'un seul eût suffi à la charge d'un chariot, et le plus petit écrasé\nun portefaix. Toutes les pièces de cette espèce qui échouent sur nos\nrivages et qu'on vend dans nos marchés ne sont que de la misère, que\nl'eau enlève des branches, tout comme le vent fait tomber des arbres\nle menu fruit. Les arbres à homards me parurent les mieux fournis:\nmais ceux à écrevisses et à huîtres étaient les plus gros. Les petits\ncolimaçons de mer poussent sur des espèces de buissons qui se trouvent\npresque toujours au pied des arbres à écrevisses, et les enveloppent\ncomme fait le lierre sur le chêne.\n\n[Illustration: Je rencontrais de temps en temps de gros poissons.]\n\n«Je remarquai aussi le singulier phénomène produit par un navire\nnaufragé. Il avait, à ce qu'il me sembla, donné contre un rocher dont\nla pointe était à peine à trois toises au-dessous de l'eau, et en\ncoulant bas s'était couché sur le côté. Il était descendu sur un arbre\nà homards et en avait détaché quelques fruits, lesquels étaient tombés\nsur un arbre à écrevisses placé plus bas. Comme la chose se passait au\nprintemps et que les homards étaient tout jeunes, ils s'unirent aux\nécrevisses; il en résulta un fruit qui tenait des deux espèces à la\nfois. Je voulus, pour la rareté du fait, en cueillir un sujet; mais\nce poids m'aurait fort embarrassé, et puis mon Pégase ne voulait pas\ns'arrêter.\n\n«J'étais à peu près à moitié route, et me trouvais dans une vallée\nsituée à cinq cents toises au moins au-dessous de la surface de la mer:\nje commençais à souffrir du manque d'air. Au surplus, ma position était\nloin d'être agréable sous bien d'autres rapports. Je rencontrais de\ntemps en temps de gros poissons qui, autant que j'en pouvais juger par\nl'ouverture de leurs gueules, ne paraissaient pas éloignés de vouloir\nnous avaler tous deux. Ma pauvre Rossinante était aveugle, et je ne dus\nqu'à ma prudence d'échapper aux intentions hostiles de ces messieurs\naffamés. Je continuai donc à galoper, dans le but de me mettre le plus\ntôt possible à sec.\n\n«Parvenu assez près des rives de la Hollande, et n'ayant plus guère\nqu'une vingtaine de toises d'eau sur la tête, je crus apercevoir,\nétendue sur le sable, une forme humaine, qu'à ses vêtements je reconnus\nêtre un corps de femme. Il me sembla qu'elle donnait encore quelques\nsignes de vie, et, m'étant approché, je la vis, en effet, remuer la\nmain. Je saisis cette main et ramenai sur le bord ce corps d'apparence\ncadavérique. Quoique l'art de réveiller les morts fût moins avancé\nà cette époque qu'aujourd'hui, où à chaque porte d'auberge on lit\nsur un écriteau: _Secours aux noyés_, les efforts et les soins d'un\napothicaire de l'endroit parvinrent à raviver la petite étincelle\nvitale qui restait chez cette femme. Elle était la moitié chérie d'un\nhomme qui commandait un bâtiment attaché au port d'Helvoetsluys, et\nqui avait pris la mer depuis peu. Par malheur, dans la précipitation\ndu départ, il avait embarqué une autre femme que la sienne. Celle-ci\nfut aussitôt instruite du fait par quelques-unes de ces vigilantes\nprotectrices de la paix et du foyer domestique, qu'on nomme amies\nintimes; jugeant que les droits conjugaux sont aussi sacrés et aussi\nvalables sur mer que sur terre, elle s'élança dans une chaloupe à la\npoursuite de son époux; arrivée à bord du navire, elle chercha, dans\nune courte, mais intraduisible allocution, à faire triompher ses droits\nd'une façon si énergique que le mari jugea prudent de reculer de deux\npas. Le résultat de ceci fut que sa main osseuse, au lieu de rencontrer\nles oreilles de son mari, ne rencontra que l'eau, et comme cette\nsurface céda avec plus de facilité que ne l'eût fait l'autre, la pauvre\nfemme ne trouva qu'au fond de la mer la résistance qu'elle cherchait.\nCe fut en ce moment que mon étoile me fit la rencontrer et me permit de\nrendre à la terre un couple heureux et fidèle.\n\n«Je me représente aisément les bénédictions dont monsieur son mari\ndut me combler en retrouvant, à son retour, sa tendre épouse sauvée\npar moi. Au reste, pour mauvais que fût le tour que j'avais joué à ce\npauvre diable, mon cœur en reste parfaitement innocent. J'avais agi par\npure charité, sans me douter des affreuses conséquences que ma bonne\naction devait amener.»\n\nC'est là que se terminait habituellement le récit de mon père, récit\nque m'a rappelé la fameuse fronde dont je vous ai entretenu et qui,\naprès avoir été conservée si longtemps dans ma famille et lui avoir\nrendu tant de services signalés, joua son reste contre le cheval de\nmer: elle put encore me servir en envoyant par ma main, ainsi que je\nvous l'ai raconté, une bombe au milieu des Espagnols, et en sauvant\nmes deux amis de la potence; mais ce fut là son dernier exploit; elle\ns'en alla en grande partie avec la bombe, et le morceau, ce qui m'en\nresta dans la main, est conservé aujourd'hui dans les archives de notre\nfamille, à côté d'un grand nombre d'antiquités des plus précieuses.\n\nPeu de temps après, je quittai Gibraltar et retournai en Angleterre, où\nil m'arriva une des plus singulières aventures de ma vie.\n\nJe m'étais rendu à Wapping pour surveiller l'embarquement de divers\nobjets que j'envoyais à plusieurs de mes amis de Hambourg; l'opération\nterminée, je revins par le _Tower Wharf._ Il était midi, et j'étais\nhorriblement fatigué; pour échapper à l'ardeur du soleil, j'imaginai\nde me fourrer dans un des canons de la tour afin de prendre un peu de\nrepos: à peine installé, je m'endormis profondément. Or, il se trouvait\nque nous étions précisément au 1er juin, jour anniversaire\nde la naissance du roi Georges III, et, à une heure, tous les canons\ndevaient tirer pour fêter cette solennité. On les avait chargés le\nmatin, et comme personne ne pouvait soupçonner ma présence en pareil\nlieu, je fus lancé par-dessus les maisons, de l'autre côté du fleuve,\ndans une cour de ferme, entre Benmondsey et Deptford. Je tombai sur\nune grande meule de foin, où je restai sans me réveiller,--ce qui\ns'explique par l'étourdissement qui m'avait saisi dans le trajet.\n\nEnviron trois mois après, le foin haussa si considérablement de prix,\nque le fermier jugea avantageux de vendre sa provision de fourrage. La\nmeule où je me trouvais était la plus grande de toutes, et représentait\nau moins cinq cents quintaux. Ce fut donc par elle qu'on commença. Le\nbruit des gens qui y avaient appliqué leurs échelles pour l'escalader\nme réveilla enfin. Encore plongé dans un demi-sommeil, ne sachant pas\noù j'étais, je voulus m'enfuir et tombai juste sur le propriétaire du\nfoin. Je ne me fis pas la plus légère égratignure dans cette chute,\nmais le fermier n'en fut que plus maltraité: il fut tué roide, car\nje lui avais, bien innocemment, cassé le col. Pour le repos de ma\nconscience, j'appris plus tard que le drôle était un infâme juif,\nqui entassait ses fruits et ses céréales dans son grenier, jusqu'au\nmoment où leur rareté excessive lui permettait de les vendre à des prix\nexorbitants: de sorte que cette mort violente fut une juste punition de\nses crimes et un service rendu au bien public.\n\n[Illustration: Je tombai sur une grande meule de foin.]\n\nMais quel fut mon étonnement, lorsque, entièrement revenu à moi-même,\nj'essayai de rattacher mes pensées présentes à celles avec lesquelles\nje m'étais endormi trois mois auparavant! Quelle fut la surprise de\nmes amis de Londres en me voyant reparaître après les recherches\ninfructueuses qu'ils avaient faites pour me retrouver! Vous pouvez,\nmessieurs, vous l'imaginer facilement.\n\nMaintenant, messieurs, buvons un coup, que je vous raconte encore une\ncouple de mes aventures de mer.\n\n[Illustration]\n\n[Illustration]\n\n\n\n\nCHAPITRE XIV\n\n\nHUITIÈME AVENTURE DE MER\n\n\nVous avez sans doute entendu parler du dernier voyage de découverte\naccompli au pôle Nord par le capitaine Phipps, aujourd'hui lord\nMulgrave. J'accompagnais le capitaine, non pas en qualité d'officier,\nmais à titre d'ami et d'amateur. Quand nous fûmes arrivés à un degré\nfort avancé de latitude Nord, je pris mon télescope avec lequel vous\navez fait connaissance à l'occasion du récit de mes aventures à\nGibraltar, et j'examinai les objets qui nous environnaient. Car, soit\ndit en passant, je trouve qu'il est bon, surtout en voyage, de regarder\nde temps en temps ce qui se passe autour de soi.\n\nA environ un demi-mille en avant de nous flottait un immense glaçon,\naussi haut pour le moins que notre grand mât, et sur lequel je vis\ndeux ours blancs qui, autant que j'en pus juger, étaient engagés dans\nun duel acharné. Je saisis mon fusil et descendis sur la glace. Mais\nlorsque j'en eus atteint le sommet, je m'aperçus que le chemin que je\nsuivais était extrêmement dangereux et difficile. Par moments j'étais\nobligé de sauter par-dessus d'effroyables précipices; dans d'autres\nendroits la glace était polie et glissante comme un miroir, de sorte\nque je ne faisais que tomber et me relever. Je parvins cependant à\natteindre les ours, mais en même temps je reconnus qu'au lieu de se\nbattre, ils étaient simplement en train de jouer ensemble.\n\nJe calculais déjà la valeur de leur peau,--car chacun d'eux était au\nmoins aussi gros qu'un boeuf gras;--par malheur, au moment où j'ajustai\nmon arme, le pied droit me glissa, je tombai en arrière, et perdis, par\nla violence de la chute, connaissance pour plus d'un quart d'heure.\nReprésentez-vous l'épouvante dont je fus saisi, lorsque, revenant à\nmoi, je sentis qu'un des deux monstres m'avait retourné sur le ventre,\net tenait déjà entre ses dents la ceinture de ma culotte de peau.\nLa partie supérieure de mon corps était appuyée sur la poitrine de\nl'animal, et mes jambes s'étalaient en avant. Dieu sait où l'horrible\nbête m'eût entraîné; mais je ne perdis pas la tête: je tirai mon\ncouteau,--le couteau que voici, messieurs;--je saisis la patte gauche\nde l'ours et lui coupai trois doigts: il me lâcha alors et se mit à\nhurler terriblement. Je pris mon fusil, je fis feu au moment où la\nbête se mettait en devoir de s'en retourner et je l'étendis morte.\nLe monstre sanguinaire était endormi du sommeil éternel; mais le\nbruit de mon arme avait réveillé plusieurs milliers de ses compagnons\nqui reposaient sur la glace dans un rayon d'un quart de lieue. Ils\ncoururent tous sur moi à franc étrier.\n\nIl n'y avait pas de temps à perdre; c'en était fait de moi s'il ne\nm'arrivait pas une idée lumineuse et immédiate:--elle arriva! En\nmoins de temps qu'il n'en faut a un chasseur habile pour dépioter un\nlièvre, je déshabillai l'ours mort, m'enveloppai de sa robe et cachai\nma tête sous la sienne. J'avais à peine terminé cette opération, que\ntoute la troupe s'assembla autour de moi. J'avoue que je sentais,\nsous ma fourrure, des alternatives terribles de chaud et de froid.\nCependant ma ruse réussit à merveille. Ils vinrent l'un après l'autre\nme flairer, et parurent me prendre pour un de leurs confrères. J'en\navais du reste à peu près la mine; avec un peu plus de corpulence la\nressemblance eût été parfaite, et même il y avait dans l'assemblée\nplusieurs petits jeunes ours qui n'étaient guère plus gras que moi:\naprès qu'ils m'eurent bien flairé, moi et le cadavre de ma victime,\nnous nous familiarisâmes rapidement: j'imitais parfaitement tous leurs\ngestes et tous leurs mouvements; mais, pour ce qui était du grondement,\ndu mugissement et du hurlement, je dois reconnaître qu'ils étaient\nplus forts que moi. Cependant, pour ours que je parusse, je n'en étais\npas moins homme! Je commençai à chercher le meilleur moyen de mettre à\nprofit la familiarité qui s'était établie entre ces bêtes et moi.\n\n[Illustration: J'avais à peine terminé, que toute la troupe s'assembla\nautour de moi.]\n\nJ'avais entendu dire autrefois par un vieux chirurgien militaire qu'une\nincision faite à l'épine dorsale cause instantanément la mort. Je\nrésolus d'en faire l'expérience. Je repris mon couteau, et en frappai\nle plus grand des ours près de l'épaule, à la nuque: convenez que le\ncoup était hardi, et j'avais des raisons d'être inquiet. Si la bête\nsurvivait à la blessure, c'en était fait de moi, j'étais réduit en\npièces. Heureusement ma tentative réussit, l'ours tomba mort à mes\npieds, sans plus faire un mouvement. Je pris donc le parti d'expédier\nde cette façon tous les autres, et cela ne fut pas difficile: car,\nbien qu'ils vissent de droite et de gauche tomber leurs frères, ils ne\nse méfiaient de rien, ne songeant ni à la cause ni au résultat de la\nchute successive de ces infortunés: ce fut là ce qui me sauva. Quand je\nles vis tous étendus morts autour de moi, je me sentis aussi fier que\nSamson après la défaite des Philistins.\n\nBref, je retournai au navire, je demandai les trois quarts de\nl'équipage pour m'aider à retirer les peaux et à apporter les jambons à\nbord. Nous jetâmes le surplus à l'eau, bien que, convenablement salé,\ncela eût fait un aliment fort supportable.\n\nDès que nous fûmes de retour, j'envoyai, au nom du capitaine,\nquelques jambons aux lords de l'Amirauté, aux lords de l'Échiquier,\nau lord-maire et aux aldermen de Londres, aux clubs de commerce, et\ndistribuai le surplus entre mes amis. Je reçus de tous côtés les\nremercîments les plus chaleureux; la Cité me rendit mon amabilité en\nm'invitant au dîner annuel qui se célèbre lors de la nomination du\nlord-maire.\n\nJ'envoyai les peaux d'ours à l'impératrice de Russie pour servir de\npelisses d'hiver à Sa Majesté et à sa cour. Elle m'en remercia par une\nlettre autographe que m'apporta un ambassadeur extraordinaire, et où\nelle me priait de venir partager sa couronne avec elle. Mais comme je\nn'ai jamais eu beaucoup de goût pour la souveraineté, je repoussai,\ndans les termes les plus choisis, l'offre de Sa Majesté. L'ambassadeur\nqui m'avait apporté la lettre avait l'ordre d'attendre ma réponse pour\nla rapporter à sa souveraine. Une seconde lettre, que quelque temps\naprès je reçus de l'impératrice, me convainquit de l'élévation de son\nesprit et de la violence de sa passion. Sa dernière maladie, qui la\nsurprit au moment où--pauvre et tendre femme--elle s'entretenait avec\nle comte Dolgorouki, ne doit être attribuée qu'à ma cruauté envers\nelle. Je ne sais pas quel effet je produisis aux dames, mais je dois\ndire que l'impératrice de Russie n'est pas la seule de son sexe qui du\nhaut de son trône m'ait offert sa main.\n\n[Illustration: Quand je les vis tous étendus morts autour de moi.]\n\nOn a répandu le bruit que le capitaine Phipps n'était pas allé aussi\nloin vers le Nord qu'il l'aurait pu: il est de mon devoir de le\ndéfendre sur ce point. Notre bâtiment était en bon chemin d'atteindre\nle pôle, lorsque je le chargeai d'une telle quantité de peaux d'ours\net de jambons que c'eût été folie d'essayer d'aller plus loin; nous\nn'eussions pas pu naviguer contre le plus léger vent contraire, et\nmoins encore contre les glaçons qui encombrent la mer à cette latitude.\n\nLe capitaine a depuis déclaré bien souvent combien il regrettait\nde ne pas avoir pris part à cette glorieuse journée, qu'il avait\nemphatiquement surnommée la _journée des peaux d'ours._ Il jalouse ma\ngloire, et cherche par tous les moyens à la déprécier. Nous nous sommes\nsouvent querellés à ce sujet, et aujourd'hui encore nous ne sommes pas\ndans de très-bons termes. Il prétend, par exemple, qu'il n'y a pas\ngrand mérite à avoir trompé les ours en m'affublant de la peau d'un des\nleurs; et que lui serait allé sans masque au milieu d'eux, et ne s'en\nserait pas moins fait passer pour un ours.\n\nMais c'est là un point trop délicat pour qu'un homme qui a des\nprétentions à la bonne éducation se risque à en discuter avec un noble\npair d'Angleterre.\n\n\n\n[Illustration]\n\n\n\n\nCHAPITRE XV\n\n\nNEUVIÈME AVENTURE DE MER\n\n\nJe fis un autre voyage, d'Angleterre aux Indes orientales, avec le\ncapitaine Hamilton. J'emmenais un chien couchant, qui valait, dans\nl'acception propre du mot, son pesant d'or, car il ne m'a jamais\nfailli. Un jour que, d'après les meilleurs calculs, nous nous trouvions\nà trois cents milles au moins de terre, mon chien tomba en arrêt. Je\nle vis, avec étonnement, rester plus d'une heure dans cette position:\nje fis part de ce fait au capitaine et aux officiers du bord, et leur\nassurai que nous devions être près de terre, vu que mon chien flairait\ndu gibier. Je n'obtins qu'un succès de fou rire, qui ne modifia\nnullement la bonne opinion que j'avais de mon chien.\n\nAprès une longue discussion où l'on débattit mon avis, je finis par\ndéclarer ouvertement au capitaine que j'avais plus de confiance dans\nle nez de mon Traï que dans les yeux de tous les marins du bord, et\nje pariai hardiment cent guinées,--somme que j'avais destinée à ce\nvoyage,--que nous trouverions du gibier avant une demi-heure.\n\nLe capitaine, qui était un excellent homme, se remit à rire de plus\nbelle, et pria M. Crawford, notre chirurgien, de me tâter le pouls.\nL'homme de l'art obéit et déclara que j'étais en parfaite santé. Ils\nse mirent alors à causer à voix basse: je parvins cependant à saisir\nquelques mots de leur conversation.\n\n--Il n'a pas sa tête à lui, disait le capitaine, je ne peux pas\nhonnêtement accepter ce pari.\n\n--Je suis d'un avis entièrement contraire, répliquait le chirurgien;\nle baron n'est nullement dérangé; il a plus de confiance dans l'odorat\nde son chien que dans la science de nos officiers, voilà tout. En tout\ncas, il perdra, et il l'aura bien mérité.\n\n--Ce n'est pas raisonnable de ma part d'accepter un pareil pari,\nrépétait le capitaine. Toutefois je m'en tirerai à mon honneur en lui\nrendant son argent après l'avoir gagné.\n\nTraï n'avait point bougé pendant cette conversation, ce qui me confirma\ndans mon opinion. Je proposai une seconde fois le pari, qui fut enfin\naccepté.\n\nNous avions à peine prononcé le _tope là_ sacramentel que des matelots\nplacés dans la chaloupe attachée à l'arrière du bâtiment, et occupés à\npêcher à la ligne, attrapèrent un énorme chien de mer, qu'ils amenèrent\naussitôt sur le pont. On commença à le dépecer, et voilà qu'on lui\ntrouva dans le ventre six couples de perdrix vivantes!\n\nLes pauvres bêtes y habitaient depuis si longtemps, qu'une des perdrix\nétait occupée à couver cinq œufs, dont l'un était en train d'éclore\nlorsque l'on ouvrit le poisson.\n\nNous élevâmes ces jeunes oiseaux avec une portée de petits chats venus\nau monde quelques minutes auparavant. La mère chatte les chérissait\nautant que ses enfants, et se désolait chaque fois qu'un des perdreaux\ns'éloignait trop et tardait à revenir auprès d'elle. Comme dans notre\nprise il y avait quatre perdrix qui ne cessaient de couver à tour de\nrôle, notre table fut fournie de gibier tout le temps du voyage.\n\nPour récompenser mon brave Traï des cent guinées qu'il m'avait fait\ngagner, je lui donnai chaque fois les os des perdreaux que nous avions\nmangés, et de temps en temps même un perdreau tout entier.\n\n[Illustration]\n\n\n[Illustration]\n\n\n\n\nCHAPITRE XVI\n\n\nDIXIÈME AVENTURE EN MER, SECOND VOYAGE DANS LA LUNE\n\n\nJe vous ai déjà parlé, messieurs, d'un voyage que je fis dans la lune\npour retrouver ma hachette d'argent. J'eus une nouvelle occasion d'y\nretourner, mais d'une façon beaucoup plus agréable, et j'y séjournai\nassez longtemps pour y faire diverses observations que je vais vous\ncommuniquer aussi exactement que ma mémoire me le permettra.\n\nUn de mes parents éloignés s'était mis dans la tête qu'il devait\nabsolument y avoir quelque part un peuple égal en grandeur à celui que\nGulliver prétend avoir trouvé dans le royaume de Brobdignag. Il résolut\nde partir à la recherche de ce peuple, et me pria de l'accompagner.\nPour ma part, j'avais toujours considéré le récit de Gulliver comme un\nconte d'enfant, et je ne croyais pas plus à l'existence de Brobdignag\nqu'à celle de l'Eldorado; mais comme cet estimable parent m'avait\ninstitué son légataire universel, vous comprenez que je lui devais\ndes égards. Nous arrivâmes heureusement dans la mer du Sud, sans rien\nrencontrer qui mérite d'être rapporté, si ce n'est cependant quelques\nhommes et quelques femmes volants qui gambadaient et dansaient le\nmenuet en l'air.\n\n[Illustration: Lorsque nous découvrîmes une vaste terre ronde et\nbrillante.]\n\nLe dix-huitième jour après que nous eûmes dépassé Otahiti, un ouragan\nenleva notre bâtiment à près de mille lieues au-dessus de la mer,\net nous maintint dans cette position pendant assez longtemps. Enfin\nun vent propice enfla nos voiles et nous emporta avec une rapidité\nextraordinaire. Nous voyagions depuis six semaines au-dessus des\nnuages lorsque nous découvrîmes une vaste terre, ronde et brillante,\nsemblable à une île étincelante. Nous entrâmes dans un excellent port,\nnous abordâmes et trouvâmes le pays habité. Tout autour de nous, nous\nvoyions des villes, des arbres, des montagnes, des fleuves, des lacs,\nsi bien que nous nous croyions revenus sur la terre que nous avions\nquittée.\n\n[Illustration]\n\nDans la lune,--car c'était là l'île étincelante où nous venions\nd'aborder,--nous vîmes de grands êtres montés sur des vautours, dont\nchacun avait trois têtes. Pour vous donner une idée de la dimension de\nces oiseaux, je vous dirai que la distance mesurée de l'extrémité d'une\nde leurs ailes à l'autre est six fois plus grande que la plus longue de\nnos vergues. Au lieu de monter à cheval, comme nous autres habitants de\nla terre, les gens de la lune montent ces sortes d'oiseaux.\n\nA l'époque où nous arrivâmes, le roi de ce pays était en guerre avec\nle soleil. Il m'offrit un brevet d'officier; mais je n'acceptai point\nl'honneur que me faisait Sa Majesté.\n\nTout, dans ce monde-là, est extraordinairement grand: une mouche\nordinaire, par exemple, est presque aussi grosse qu'un de nos moutons.\nLes armes usuelles des habitants de la lune sont des raiforts qu'ils\nmanœuvrent comme des javelots, et qui tuent ceux qui en sont atteints.\nLorsque la saison des raiforts est passée, ils emploient des tiges\nd'asperges. Pour boucliers, ils ont de vastes champignons.\n\nJe vis en outre dans ce pays quelques naturels de Sirius venus là pour\naffaires; ils ont des têtes de bouledogue et les yeux placés au bout\ndu nez, ou plutôt à la partie inférieure de cet appendice. Ils sont\nprivés de sourcils; mais lorsqu'ils veulent dormir, ils se couvrent\nles yeux avec leur langue; leur taille moyenne est de vingt pieds;\ncelle des habitants de la lune n'est jamais au-dessous de trente-six\npieds. Le nom que portent ces derniers est assez singulier; il peut\nse traduire par celui d'_êtres vivants_; on les appelle ainsi parce\nqu'ils préparent leurs mets sur le feu, tout comme nous. Du reste, ils\nne consacrent guère de temps à leurs repas; ils ont sur le côté gauche\nun petit guichet qu'ils ouvrent et par lequel ils jettent la portion\ntout entière dans l'estomac; après quoi ils referment le guichet et\nrecommencent l'opération au bout d'un mois, jour pour jour. Ils n'ont\ndonc que douze repas par an, combinaison que tout individu sobre doit\ntrouver bien supérieure à celles usitées chez nous.\n\nLes joies de l'amour sont complètement inconnues dans la lune; car,\nchez les êtres cuisants aussi bien que chez les autres animaux, il\nn'existe qu'un seul et même sexe. Tout pousse sur des arbres qui\ndiffèrent à l'infini les uns des autres, suivant les fruits qu'ils\nportent. Ceux qui produisent les êtres cuisants ou hommes sont beaucoup\nplus beaux que les autres; ils ont de grandes branches droites et\ndes feuilles couleur de chair; leur fruit consiste en noix à écorce\ntrès-dure, et longues d'au moins six pieds. Lorsqu'elles sont mûres,\nce qu'on reconnaît à leur couleur, on les cueille avec un grand soin,\net on les conserve aussi longtemps qu'on le juge convenable. Quand on\nveut en retirer le noyau, on les jette dans une grande chaudière d'eau\nbouillante; au bout de quelques heures, l'écorce tombe, et il en sort\nune créature vivante.\n\nAvant qu'ils viennent au monde, leur esprit a déjà reçu une destination\ndéterminée par la nature.\n\nD'une écorce sort un soldat, d'une autre un philosophe, d'une troisième\nun théologien, d'une quatrième un jurisconsulte, d'une cinquième un\nfermier, d'une sixième un paysan et ainsi de suite, et chacun se met\naussitôt à pratiquer ce qu'il connaît déjà théoriquement. La difficulté\nconsiste à juger avec certitude ce que contient l'écorce; au moment où\nje me trouvais dans le pays, un savant lunaire affirmait à grand bruit\nqu'il possédait ce secret. Mais on ne fit pas attention à lui, et on le\ntint généralement pour fou.\n\nLorsque les gens de la lune deviennent vieux, ils ne meurent pas, mais\nils se dissolvent dans l'air et s'évanouissent en fumée.\n\n[Illustration]\n\nIls n'éprouvent pas le besoin de boire, n'étant asservis à aucune\nexcrétion. Ils n'ont à chaque main qu'un seul doigt avec lequel ils\nexécutent tout beaucoup mieux que nous ne le faisons avec notre pouce\net ses quatre aides.\n\nIls portent leur tête sous le bras droit, et, lorsqu'ils vont en\nvoyage ou qu'ils ont à exécuter quelque travail qui exige beaucoup de\nmouvement, ils la laissent habituellement à la maison; car ils peuvent\nlui demander conseil à n'importe quelle distance.\n\n[Illustration]\n\nLes hauts personnages de la lune, lorsqu'ils veulent savoir ce que font\nles gens du peuple, n'ont pas coutume d'aller les trouver; ils restent\nà la maison, c'est-à-dire que leur corps reste chez eux, et qu'ils\nenvoient leur tête dans la rue pour voir incognito ce qui s'y passe.\nUne fois les renseignements recueillis, elle revient dès que le maître\nla rappelle.\n\nLes pépins de raisin lunaire ressemblent exactement à nos grêlons, et\nje suis fermement convaincu que, lorsqu'une tempête détache les grains\nde leur tige, les pépins tombent sur notre terre et forment notre\ngrêle. Je suis môme porté à croire que cette observation doit être\nconnue depuis longtemps de plus d'un marchand de vin; du moins j'ai\nbien souvent bu du vin qui m'a paru fait de grêlons, et dont le goût\nrappelait celui du vin de la lune.\n\nJ'allais oublier un détail des plus intéressants. Les habitants de\nla lune se servent de leur ventre comme nous des gibecières; ils y\nfourrent tout ce dont ils ont besoin, l'ouvrent et le ferment à volonté\ncomme leur estomac, car ils ne sont pas embarrassés d'entrailles, ni de\ncœur, ni de foie; ils ne portent non plus pas de vêtements, l'absence\nde sexe les dispensant de pudeur.\n\nIls peuvent à leur gré ôter et remettre leurs yeux, et, lorsqu'ils les\ntiennent à la main, ils voient aussi bien que s'ils les avaient sur la\nfigure. Si, par hasard, ils en perdent ou en cassent un, ils peuvent\nen louer ou en acheter un nouveau, qui leur fait le même service que\nl'autre; aussi rencontre-t-on dans la lune, à chaque coin de rue, des\ngens qui vendent des yeux; ils en ont les assortiments les plus variés,\ncar la mode change souvent: tantôt ce sont les yeux bleus, tantôt les\nyeux noirs, qui sont mieux portés.\n\nJe conviens, messieurs, que tout cela doit vous paraître étrange; mais\nje prie ceux qui douteraient de ma sincérité de se rendre eux-mêmes\ndans la lune, pour se convaincre que je suis resté plus fidèle à la\nvérité qu'aucun autre voyageur.\n\n\n[Illustration]\n\n\n\n\nCHAPITRE XVII\n\n\nVOYAGE A TRAVERS LA TERRE ET AUTRES AVENTURES REMARQUABLES.\n\n\n[Illustration L]\n\nSi je m'en rapporte à vos yeux, je suis sûr que je me fatiguerais plus\nvite à vous raconter les événements extraordinaires de ma vie que\nvous à les écouter. Votre complaisance est trop flatteuse pour que je\nm'en tienne, ainsi que je me l'étais proposé, au récit de mon second\nvoyage dans la lune. Écoutez donc, s'il vous plaît, une histoire dont\nl'authenticité est aussi incontestable que celle de la précédente,\nmais qui la surpasse par l'étrangeté et le merveilleux dont elle est\nempreinte.\n\nLa lecture du Voyage de Brydone en Sicile m'inspira un vif désir de\nvisiter l'Etna. En route il ne m'arriva rien de remarquable: je dis à\nmoi, car beaucoup d'autres, pour faire payer aux lecteurs naïfs les\nfrais de leur voyage, n'eussent pas manqué de raconter longuement et\nemphatiquement maints détails vulgaires qui ne sont pas dignes de fixer\nl'attention des honnêtes gens.\n\nUn matin de bonne heure, je sortais d'une chaumière située au pied de\nla montagne, fermement résolu à examiner, dût-il m'en coûter la vie,\nl'intérieur de ce célèbre volcan. Après trois heures d'une marche\ndes plus pénibles, j'atteignis le sommet de la montagne. Depuis\ntrois semaines le volcan grondait sans discontinuer. Je ne doute\npas, messieurs, que vous ne connaissiez l'Etna par les nombreuses\ndescriptions qui en ont été faites: je n'essayerai donc pas de vous\nredire ce que vous savez aussi bien que moi, et j'épargnerai à moi une\npeine et à vous une fatigue inutile.\n\nJe fis trois fois le tour du cratère,--dont vous pouvez avoir une\nidée en vous figurant un immense entonnoir,--et reconnaissant que\nj'aurais beau tourner, cela ne m'avancerait guère, je pris bravement ma\nrésolution, et je me décidai à sauter dedans. A peine eus-je exécuté le\nsaut, que je me sentis comme plongé dans un bain de vapeur brûlante;\nles charbons ardents qui jaillissaient sans relâche endommagèrent et\nbrûlèrent en tous sens mon pauvre corps.\n\nMais quelle que fût la violence avec laquelle s'élançaient les matières\nincandescentes, je descendais plus rapidement qu'elles ne montaient,\ngrâce à la loi de la pesanteur, et au bout de quelques instants je\ntouchai le fond. La première chose que je remarquai fut un bruit\népouvantable, un concert de jurements, de cris et de hurlements qui\nsemblaient s'élever autour de moi. J'ouvris les yeux, et qu'est-ce\nque je vis?... Vulcain en personne accompagné de ses cyclopes. Ces\nmessieurs, que mon bon sens avait depuis longtemps relégués dans le\ndomaine de la fiction, étaient depuis trois semaines en querelle au\nsujet d'un article du règlement intérieur, et c'était cette dispute\nqui remuait la surface externe. Mon apparition rétablit comme par\nenchantement la paix et la concorde dans la tapageuse assemblée.\n\n[Illustration L]\n\nVulcain courut aussitôt clopin-clopant vers son armoire, en tire des\nonguents et des emplâtres qu'il m'appliqua de sa propre main, et,\nquelques minutes après, mes blessures étaient guéries. Il m'offrit\nensuite des rafraîchissements, un flacon de nectar et d'autres vins\nprécieux, comme n'en boivent que les dieux et les déesses. Dès que\nje fus à peu près remis, il me présenta à Vénus, son épouse, en lui\nrecommandant de me prodiguer tous les soins qu'exigeait ma position.\nLa somptuosité de la chambre où elle me conduisit, le moelleux du sofa\nsur lequel elle me fil asseoir, le charme divin qui régnait dans toute\nsa personne, la tendresse de son cœur, il n'y a pas de mots dans les\nlangues terrestres pour exprimer cela; rien que dépenser, la tète me\ntourne!\n\n[Illustration]\n\nVulcain me fit une description très-détaillée de l'Etna. Il m'expliqua\ncomme quoi cette montagne n'était qu'un amas de cendres sorties de la\nfournaise; qu'il était souvent obligé de sévir contre ses ouvriers;\nqu'alors, dans sa colère, il leur jetait des charbons ardents qu'ils\nparaient avec une grande adresse en les laissant passer sur la\nterre, afin de le laisser épuiser ses munitions. «Nos dissensions,\najouta-t-il, durent quelquefois plusieurs mois, et les phénomènes\nqu'elles produisent à la surface de la terre sont ce que vous appelez,\nje crois, des éruptions. Le mont Vésuve est également une de mes\nforges: une galerie de trois cent cinquante milles de longueur m'y\nconduit en passant sous le lit de la mer: là aussi des dissensions\nsemblables amènent sur la terre des accidents analogues.»\n\n[Illustration]\n\n[Illustration: Là il me tint suspendu au-dessus d'une espèce de puits\nprofond.]\n\nSi je me plaisais à la conversation instructive du mari, je goûtais\nencore davantage la société de la femme, et je n'aurais peut-être\njamais quitté ce palais souterrain, si quelques mauvaises langues\nn'avaient mis la puce à l'oreille au seigneur Vulcain, et n'avaient\nallumé dans son cœur le feu de la jalousie. Sans me prévenir le moins\ndu monde, il me saisit un matin au collet, comme j'assistais la belle\ndéesse à sa toilette, et m'emmena dans une chambre que je n'avais pas\nencore vue: là il me tint suspendu au-dessus d'une espèce de puits\nprofond, et me dit: «Ingrat mortel, retourne dans le monde d'où tu es\nvenu!»\n\n[Illustration R]\n\nEn prononçant ces mots et sans me permettre de rien répliquer\npour ma défense, il me précipita dans l'abîme. Je tombai avec une\nrapidité toujours croissante, jusqu'à ce que l'effroi m'eût lad\nperdre entièrement connaissance. Mais je fus tout d'un coup tiré de\nmon évanouissement en me sentant plongé dans une immense masse d'eau\nilluminée par les rayons du soleil: c'était le paradis et le repos, en\ncomparaison de l'affreux voyage que je venais d'accomplir.\n\n[Illustration]\n\nJe regardai tout autour de moi, mais je ne voyais de tous côtés que de\nl'eau. La température était tout autre que celle à laquelle je m'étais\naccoutumé chez le seigneur Vulcain. Enfin je découvris à quelque\ndistance un objet qui avait l'apparence d'un énorme rocher, et qui\nsemblait se diriger vers moi: Je reconnus bientôt que c'était un glaçon\nflottant. Après beaucoup de recherches, je trouvai enfin un endroit où\nje pus m'accrocher, et je parvins à gravir jusqu'au sommet. A mon grand\ndésespoir, je ne découvris aucun indice qui m'annonçât le voisinage de\nla terre. Enfin, avant la tombée de la nuit, j'aperçus un navire qui\ns'avançait de mon côté. Dès qu'il fut à portée de la voix, je le hélai\nde toutes mes forces: il me répondit en hollandais. Je me jetai à la\nmer, et nageai jusqu'au navire où l'on, m'amena à bord. Je demandai où\nnous étions. «Dans la mer du Sud,» me répondit-on. Ce fait expliquait\ntoute l'énigme. Il était évident que j'avais traversé le centre du\nglobe et que j'étais tombé par l'Etna dans la mer du Sud: ce qui est\nbeaucoup plus direct que de faire le tour du monde. Personne avant moi\nn'avait encore tenté ce passage, et si je refais jamais le voyage, je\nme promets bien d'en rapporter des observations du plus haut intérêt.\n\nJe me fis donner quelques rafraîchissements et je me couchai. Quels\ngrossiers personnages, messieurs que les Hollandais! Le lendemain\nje racontai mon aventure aux officiers aussi exactement et aussi\nsimplement que je viens de le faire ici, et plusieurs d'entre eux,\nle capitaine surtout, firent mine de douter de l'authenticité de mes\nparoles. Cependant, comme ils m'avaient donné l'hospitalité à leur\nbord, et que si je vivais c'était grâce à eux, il me fallut bien\nempocher l'humiliation sans répliquer.\n\nJe m'enquis ensuite du but de leur voyage. Ils me répondirent qu'ils\nfaisaient une expédition de découverte et que, si ce que je leur\navais raconté était vrai, leur but était atteint. Nous nous trouvions\nprécisément sur la route qu'avait suivie le capitaine Cook, et nous\narrivâmes le lendemain à Botany-Bay, lieu où le gouvernement anglais\ndevrait envoyer non pas ses mauvais garnements pour les punir, mais des\nhonnêtes gens pour les récompenser, tant ce pays est beau et richement\ndoté par la nature.\n\n[Illustration]\n\nNous ne restâmes que trois jours à Botany-Bay. Le quatrième jour après\nnotre départ il s'éleva une effroyable tempête qui déchira toutes nos\nvoiles, rompit notre beaupré, abattit notre mât de perroquet, lequel\ntomba sur la cahute où était enfermée notre boussole et la mit en\npièces. Quiconque a navigué sait quelles peuvent être les conséquences\nd'un pareil accident. Nous ne savions plus où nous étions, ni où aller.\nEnfin la tempête s'apaisa, et fut suivie d'une bonne brise continue.\nNous naviguions depuis trois mois et nous devions avoir fait énormément\nde chemin, lorsque tout à coup nous remarquâmes un changement singulier\ndans tout ce qui nous entourait. Nous nous sentions tout gais et tout\ndispos, notre nez s'emplissait des odeurs les plus douces et les plus\nbalsamiques; la mer elle-même avait changé de couleur: elle n'était\nplus verte, mais blanche.\n\nBientôt après nous aperçûmes la terre, et à quelque distance un port\nvers lequel nous nous dirigeâmes et que nous trouvâmes spacieux\net profond. Au lieu d'eau, il était rempli d'un lait exquis. Nous\ndescendîmes à terre et nous vîmes que l'île tout entière consistait\nen un immense fromage. Nous ne nous en serions peut-être pas aperçus,\nsi une circonstance particulière ne nous avait mis sur la trace. Nous\navions sur notre navire un matelot qui professait pour le fromage une\nantipathie naturelle. En posant le pied sur la terre, il tomba évanoui.\n\n[Illustration]\n\nQuand il revint à lui, il demanda qu'on retirât le fromage de dessous\nses pieds; on vérifia, et on reconnut qu'il avait parfaitement\nraison: cette île n'était, comme je viens de vous le dire, qu'un\nénorme fromage. La plupart des habitants s'en nourrissaient; les\nparties mangées pendant le jour étaient remplacées pendant la nuit.\nNous vîmes dans cette île une grande quantité de vignes chargées de\ngrosses grappes, lesquelles, lorsqu'on les pressait, ne donnaient que\ndu lait. Les insulaires étaient sveltes et beaux, la plupart avaient\nneuf pieds de haut; ils avaient trois jambes et un bras, et les adultes\nportaient sur le front une corne dont ils se servaient avec une adresse\nremarquable. Ils font des courses sur la surface du lait, et s'y\npromènent sans y enfoncer avec autant d'assurance que nous sur une\npelouse.\n\n[Illustration]\n\nIl croissait sur cette île, ou plutôt sur ce fromage, une grande\nquantité de blé, dont les épis, semblables à des champignons,\ncontenaient des pains tout cuits et prêts à être mangés. En traversant\nce fromage nous rencontrâmes sept fleuves de lait et deux de vin.\n\n[Illustration]\n\nAprès un voyage de seize jours, nous atteignîmes le rivage opposé à\ncelui où nous avions abordé. Nous trouvâmes dans cette partie de l'île\ndes plaines entières de ce fromage bleu à force de vieillesse, dont les\namateurs font si grand cas. Mais, au lieu d'y rencontrer des vers, on\ny voyait croître de magnifiques arbres fruitiers tels que cerisiers,\nabricotiers, pêchers, et vingt autres espèces que nous ne connaissons\npoint. Ces arbres, qui sont extraordinairement grands et gros,\nabritaient une immense quantité de nids d'oiseaux.\n\n[Illustration]\n\nNous remarquâmes entre autres un nid d'alcyons, dont la circonférence\nétait cinq fois grande comme la coupole de Saint-Paul à Londres; il\nétait artistement construit d'arbres gigantesques, et il contenait\n...--attendez, que je me rappelle bien le chiffre!--il contenait cinq\ncents œufs dont le plus petit était au moins aussi gros qu'un muid.\nNous ne pûmes pas voir les jeunes qui étaient dedans, mais nous les\nentendîmes siffler. Ayant ouvert à grand'peine un de ces œufs, nous en\nvîmes sortir un petit oiseau sans plumes, gros environ comme vingt de\nnos vautours. A peine avions-nous fait éclore le jeune oiseau que le\nvieux alcyon se jeta sur nous, saisit notre capitaine dans une de ses\nserres, l'enleva à la hauteur d une bonne lieue, le frappa violemment\navec ses ailes et le laissa tomber dans la mer.\n\n[Illustration: ...L'enleva à la hauteur d'une bonne lieue.]\n\nLes Hollandais nagent comme des rats d'eau; aussi le capitaine nous\neut-il bientôt rejoints, et nous regagnâmes tous ensemble notre navire.\nMais nous ne retournâmes pas par le même chemin, ce qui nous permit de\nfaire de nouvelles observations. Dans le gibier que nous tuâmes, il y\navait deux buffles d'une espèce particulière qui ne possédait qu'une\nseule corne, placée entre les deux yeux. Nous regrettâmes plus tard de\nles avoir tués, car nous apprîmes que les habitants les apprivoisaient\net s'en servaient en guise de cheval de trait ou de selle. On nous\nassura que la chair en était exquise, mais absolument inutile à un\npeuple qui ne vit que de lait et de fromage.\n\nDeux jours avant d'atteindre notre navire, nous vîmes trois individus\npendus par les jambes à de grands arbres. Je demandai quel crime leur\navait valu cette terrible punition, et j'appris qu'ils étaient allés à\nl'étranger, et qu'à leur retour ils avaient raconté à leurs amis une\nfoule de mensonges, leur décrivant des lieux qu'ils n'avaient pas vus,\net des aventures qui ne leur étaient pas arrivées. Je trouvai cette\npunition bien méritée, car le premier devoir d'un voyageur, c'est de ne\ns'écarter jamais de la vérité.\n\nRevenus à bord, nous levâmes l'ancre et nous quittâmes ce singulier\npays. Tous les arbres du rivage, dont quelques-uns énormes et\ntrès-élevés, s'inclinèrent deux fois en nous saluant en mesure. Après\nquoi ils reprirent leur première position.\n\n[Illustration]\n\nQuand nous eûmes erré trois jours durant, Dieu sait où,--car nous\nmanquions toujours de boussole,--nous arrivâmes dans une mer qui\nsemblait toute noire: nous goûtâmes ce que nous prenions pour de l'eau\nsale, et nous reconnûmes que c'était de l'excellent vin! Nous eûmes\ntoutes les peines du monde à empêcher nos matelots de se griser. Mais\nnotre joie ne fut pas de longue durée, car, quelques heures après,\nnous nous trouvâmes entourés de baleines et d'autres poissons non\nmoins gigantesques: il y en avait un d'une longueur si prodigieuse\nque même avec une lunette d'approche nous n'en pûmes voir le bout.\nMalheureusement nous n'aperçûmes le monstre qu'au moment où il était\ntout près de nous: il avala d'un trait notre bâtiment avec ses mâts\ndressés et toutes ses voiles dehors.\n\nAprès que nous eûmes passé quelque temps dans sa gueule, il la rouvrit\npour engloutir une énorme masse d'eau: notre navire, soulevé par\nce courant, fut entraîné dans l'estomac du monstre, où nous nous\ntrouvions comme si nous eussions été à l'ancre pris d'un calme plat.\nL'air était, il faut en convenir, chaud et lourd. Nous vîmes dans cet\nestomac des ancres, des câbles, des chaloupes, des barques et bon\nnombre de navires, les uns chargés, les autres vides, qui avaient subi\nle même sort que nous. Nous étions obligés de vivre à la lumière des\ntorches; il n'y avait plus pour nous ni soleil, ni lune, ni planètes.\nOrdinairement nous nous trouvions deux fois par jour à flot et deux\nfois à sec. Quand la bête buvait nous étions à flot, lorsqu'elle\nlâchait l'eau nous étions à sec. D'après les calculs exacts que nous\nfîmes, la quantité d'eau qu'elle avalait à chaque gorgée eût suffi à\nremplir le lit du lac de Genève, dont la circonférence est de trente\nmilles.\n\n[Illustration]\n\nLe second jour de notre captivité dans ce ténébreux royaume, je me\nhasardai avec le capitaine et quelques officiers à faire une petite\nexcursion au moment de la marée basse, comme nous disions. Nous nous\nétions munis de torches, et nous rencontrâmes successivement près de\ndix mille hommes de toutes nations qui se trouvaient dans la même\nposition que nous. Ils s'apprêtaient à délibérer sur les moyens à\nemployer pour recouvrer leur liberté. Quelques-uns d'entre eux avaient\ndéjà passé plusieurs années dans l'estomac du monstre. Mais au moment\noù le président nous instruisait de la question qui allait s'agiter,\nnotre diable de poisson eut soif et se mit à boire: l'eau se précipita\navec tant de violence que nous eûmes tout juste le temps de retourner\nà nos navires: plusieurs des assistants, moins prompts que les autres,\nfurent même obligés de se mettre à la nage.\n\nQuand le poisson se fut vidé, nous nous réunîmes de nouveau. On me\nchoisit pour président: je proposai de réunir bout à bout deux des\nplus grands mâts, et, lorsque le monstre ouvrirait la gueule, de les\ndresser de façon a l'empêcher de la refermer. Cette motion fut acceptée\nà l'unanimité, et cent hommes choisis parmi les plus vigoureux furent\nchargés de la mettre à exécution. A peine les deux mâts étaient-ils\ndisposés selon mes instructions, qu'il se présenta une occasion\nfavorable. Le monstre se prit à bâiller; nous dressâmes aussitôt nos\ndeux mâts de manière que l'extrémité inférieure se trouvait plantée\ndans sa langue, et que l'autre extrémité pénétrait dans la voûte de son\npalais: il lui était dès lors impossible de rapprocher ses mâchoires.\n\n[Illustration]\n\nDès que nous fûmes à flot, nous armâmes les chaloupes qui nous\nremorquèrent et nous ramenèrent dans le monde. Ce fut avec une joie\ninexprimable que nous revîmes la lumière du soleil dont nous avions été\nprivés pendant ces quinze jours de captivité. Lorsque tout le monde\nfut sorti de ce vaste estomac, nous formions une flotte de trente-cinq\nnavires de toutes les nations. Nous laissâmes nos deux mâts plantés\ndans la gorge du poisson, pour préserver d'un accident semblable au\nnôtre ceux qui se trouveraient entraînés vers ce gouffre.\n\nUne fois délivrés, notre premier désir fut de savoir dans quelle partie\ndu monde nous étions; il nous fallut longtemps avant de parvenir à une\ncertitude. Enfin, grâce à mes observations antérieures, je reconnus que\nnous nous trouvions dans la mer Caspienne. Comme cette mer est entourée\nde tous côtés par la terre et qu'elle ne communique avec aucune autre\nnappe d'eau, nous ne pouvions comprendre comment nous y étions arrivés.\nUn habitant de l'île de fromage, que j'avais emmené avec moi, nous\nexpliqua la chose fort raisonnablement. Selon lui, le monstre dans\nl'estomac duquel nous avions erré si longtemps s'était rendu dans\ncette mer par quelque route souterraine.--Bref, nous y étions et fort\ncontents d'y être; nous nous dirigeâmes à toutes voiles vers la terre.\nJe descendis le premier.\n\nA peine avais-je posé le pied sur la terre ferme, que je me vis\nassailli par un gros ours.\n\n«Ah! ah! pensai-je, tu arrives bien!»\n\nJe lui pris les pattes de devant dans mes deux mains et les serrai avec\ntant de cordialité qu'il se mit à hurler désespérément; mais moi, sans\nme laisser toucher par ses lamentations, je le tins dans cette position\njusqu'à ce qu'il mourût de faim. Grâce à cet exploit, j'inspirai un tel\nrespect à tous les ours, que depuis lors aucun d'eux n'a jamais osé me\nchercher querelle.\n\n[Illustration]\n\nDe là je me rendis à Saint-Pétersbourg, où je reçus d'un ancien ami un\ncadeau qui me fut extrêmement agréable. C'était un chien de chasse,\ndescendant de la fameuse chienne dont je vous ai parlé, et qui mit bas\nen chassant un lièvre. Malheureusement ce chien fut tué par un chasseur\nmaladroit qui l'atteignit en tirant une compagnie de perdreaux. Je\nme fis faire avec la peau de cette bête le gilet que voici, et qui,\nlorsque je vais à la chasse, me conduit toujours infailliblement là où\nest le gibier. Quand j'en suis assez près pour pouvoir tirer, un bouton\nde mon gilet saute à la place où se trouve le gibier, et, comme mon\nfusil est toujours armé et amorcé, je ne manque jamais mon coup.\n\nIl me reste encore trois boulons, comme vous voyez; mais dès que la\nchasse rouvrira, j'en ferai remettre deux rangs. Venez me trouver\nalors, et vous verrez que j'aurai de quoi vous amuser.\n\nPour aujourd'hui, je prends la liberté de me retirer et de vous\nsouhaiter une bonne nuit.\n\n[Illustration]\n\n\nFIN\n\n\n\n\nTABLE\n\n\nPréface\n\nCHAPITRE PREMIER\n\nVoyage en Russie et à Saint-Pétersbourg\n\nCHAPITRE II\n\nHistoire de chasse\n\nCHAPITRE III\n\nDes chiens et des chevaux du baron de Münchhausen\n\nCHAPITRE IV\n\nAventures du baron de Münchhausen dans la guerre contre les Turcs\n\nCHAPITRE V\n\nAventures du baron de Münchhausen pendant sa captivité chez les Turcs.\nIl revient dans sa patrie\n\nCHAPITRE VI\n\nPremière aventure de mer\n\nCHAPITRE VII\n\nDeuxième aventure de mer\n\nCHAPITRE VIII\n\nTroisième aventure de mer\n\nCHAPITRE IX\n\nQuatrième aventure de mer\n\nCHAPITRE X\n\nCinquième aventure de mer\n\nCHAPITRE XI\n\nSixième aventure de mer\n\nCHAPITRE XII\n\nSeptième aventure de mer.--Récits authentiques d'un partisan qui prit\nla parole en--l'absence du baron\n\nCHAPITRE XIII\n\nLe baron reprend son récit\n\nCHAPITRE XIV\n\nHuitième aventure de mer\n\nCHAPITRE XV\n\nNeuvième aventure de mer\n\nCHAPITRE XVI\n\nDixième aventure de mer.--Second voyage dans la lune\n\nCHAPITRE XVII\n\nVoyage à travers la terre et autres aventures remarquables", "title": "Aventures de Baron de Münchausen (French)"}