{"summary": "Tracy and his group must battle saboteurs and spies in his effort to bring down the Stark gang, a major crime family syndicate led by the vicious and brutal Pa Stark...\n\n", "full_text": "and the Online Distributed Proofreading Team at\nhttp://www.pgdp.net\n\n\n\n\n\n\n\n\n\n                               Dick Kent\n                        with the Mounted Police\n\n\n                           By MILTON RICHARDS\n\n\n                               AUTHOR OF\n                      \"Dick Kent in the Far North\"\n                      \"Dick Kent with the Eskimos\"\n                        \"Dick Kent, Fur Trader\"\n                   \"Dick Kent and the Malemute Mail\"\n\n\n                    THE SAALFIELD PUBLISHING COMPANY\n                        Akron, Ohio    New York\n\n                           Copyright MCMXXVII\n                    THE SAALFIELD PUBLISHING COMPANY\n                 _Made in the United States of America_\n\n\n\n\n                                Contents\n\n\n  CHAPTER                                                           PAGE\n  I The Scar Faced Indian                                              3\n  II At Little Moose Portage                                          14\n  III Dick Shoots the Rapids                                          27\n  IV Through the Flames                                               39\n  V MacKenzie's Landing                                               47\n  VI A Grizzly Shows Fight                                            55\n  VII The Rifled Cache                                                65\n  VIII Dick Drops a Moose                                             75\n  IX Pierre Govereau                                                  83\n  X Toma and a Cold Snap                                              94\n  XI Slush Ice                                                       102\n  XII The Blizzard                                                   110\n  XIII Dick Sees a Ghost                                             120\n  XIV An Unwelcome Visitor                                           127\n  XV Outwitting the Enemy                                            135\n  XVI A Journey Through the Night                                    145\n  XVII The Stolen Huskies                                            153\n  XVIII A Hungry Pack                                                162\n  XIX The Circle of Death                                            171\n  XX Sandy Disappears                                                179\n  XXI The Man From Crooked Stick River                               184\n  XXII A Skirmish in the Night                                       194\n  XXIII Gray Goose Lake                                              200\n  XXIV Chief Black Dog's Scheme                                      209\n  XXV The Attack on the Fort                                         216\n  XXVI Lost Underground                                              222\n\n\n\n\n                   DICK KENT WITH THE MOUNTED POLICE\n\n\n\n\n                               CHAPTER I\n                         THE SCAR FACED INDIAN\n\n\nDick Kent tossed aside the wolf trap he had been trying to repair, and\nturned to his chum, Sandy McClaren.\n\n\"Let's go back to your Uncle Walter's at Fort Good Faith,\" said Dick\nrestlessly. \"It's getting too quiet around here.\"\n\nSandy McClaren's big blue eyes turned from the marten pelt he had been\nscraping. \"I'm with you, Dick. Uncle Walt needs us, too. He's still\nhaving a lot of trouble with that outlaw, Bear Henderson.\"\n\nFor a year after finishing school in the United States, Dick Kent and\nSandy McClaren had been pursuing adventure two hundred miles north of\nHay River Landing, Canada, where they had gone to visit Sandy's uncle.\nLately they had come to Fort du Lac at the invitation of Martin MacLean,\nthe factor there. The savage northland already had woven its spell of\ndangerous adventure about them, but Fort du Lac had proved dull after\nthe excitement of the more lawless trading post supervised by Sandy's\nuncle on the northern fringe of the Hudson's Bay Company's territory.\n\nDick and Sandy had turned toward the big log store building where Martin\nMacLean bartered for furs, when they stopped dead, looking northeast\nalong the trail that curved about a high headland of pine forest.\n\n\"What's that?\" cried Dick suddenly.\n\n\"Looks like an Indian runner!\" Sandy exclaimed.\n\n\"I'll tell Mr. MacLean,\" Dick stretched his athletic legs toward the\nstore.\n\nThe fur trader came out on Dick's heels a moment later, his broad, bony\nframe and bearded face tense at the hint of trouble.\n\n\"It's a runner all right,\" confirmed the trader, watching the distant\nfigure, which was rapidly approaching.\n\nPresently a swarthy faced Indian, his coarse black hair streaming about\nhis haggard features, fell almost exhausted into their arms.\n\n\"Help me carry him in,\" Martin MacLean commanded. \"He's tuckered out.\nWe've got to get him to talk. There's trouble somewhere.\"\n\nThey tugged the limp body of the runner into the store and lay him on\nseveral bales of fur. The trader hurried for stimulant, which he forced\nbetween the Indian's teeth. The runner soon opened his eyes. All three\nbent over him as he spoke:\n\n\"Him Bear Henderson take um post--from Mister McClaren,\" gasped the\nrunner. \"Tie um up. Kill all good Injuns!\"\n\nDick Kent's face paled as he turned to Sandy. \"Henderson has captured\nyour Uncle Walter!\"\n\n\"Well, he'll get his when the mounted police get there,\" flared Sandy,\nhis Scotch temper showing itself.\n\nThe factor of the post turned to them. They fell silent. \"Boys, I can't\nleave the post,\" he said, \"and I don't trust any of the Indians around\nthe store. Can I depend on you to go down the river and get Malcolm\nMackenzie?\"\n\n\"Can you!\" Dick and Sandy chorused, \"I should smile.\"\n\n\"You know what this means,\" the trader went on sternly. \"Bear Henderson\nis a powerful man. There isn't a doubt this runner was followed here.\nThere may be men right here at Fort du Lac who are in sympathy with the\noutlaw. Henderson is plotting against the whole northern frontier held\nby Hudson's Bay Company. It's life or death.\"\n\n\"We'll do it!\" Dick cried eagerly. \"Tell us what to do.\"\n\n\"All right then. You go by canoe down the river to Mackenzie's Landing.\nTell Mackenzie I asked him to go with you to the mounted police post at\nFort Dunwoody. You know the trail that far. Malcolm knows it from the\nlanding on. There's a grub cache he might have forgotten. In case he\nhas----\" the boys followed MacLean behind the counter. From the strong\nbox the trader drew a map. \"Now here is our post,\" the trader continued,\nindicating a dot on the rough map with a match end, while Dick and Sandy\nfollowed him attentively; \"There's Little Moose Portage, and further\ndown Mackenzie's Landing, the free trader's post. Twenty miles further\nthe river swings north and you leave the water and go by land. Then\nhere's where you strike the cache of food----\"\n\nDick's sudden, startled cry interrupted. \"What was that at the window!\"\n\n\"I didn't see anything,\" whispered Sandy.\n\n\"Sure you weren't imagining something?\" said the trader.\n\n\"I know I saw a face right there a moment ago,\" Dick insisted, pointing\nto a window in the rear of the long store. \"It seemed to be an Indian's\nface which was covered with hideous scars.\"\n\nMacLean walked back and pulled the curtains shut over the window. He\nreturned and went on explaining the location of the cache and the route\nto be taken to Fort Dunwoody.\n\nOnce started, Dick and Sandy were not long in preparing for the trip\ndown the river to Mackenzie's Landing. They cleaned and oiled their\n30.30 Ross rifles, packed a canoe with flour, beans, bacon, coffee,\nsalt, sugar and camp utensils, and saw that they were well supplied with\nammunition.\n\nOn their last trip to the canoe from the storehouse, Sandy, too, had a\nsingular surprise. But he did not cry out. Instead, he called softly to\nDick, who was a little ahead of him.\n\n\"I saw the same face you saw behind those boxes over there on the\nlanding,\" Sandy said tensely. \"Make believe we didn't notice anything.\nThen we'll pick up our rifles and walk down the river till we get where\nwe can see behind the boxes.\"\n\n\"All right,\" Dick replied cooly, his dark eyes gleaming as they always\ndid at the promise of excitement.\n\n\"Don't shoot. Capture him,\" Dick added, as they deposited their packs\ninto the canoe, picked up their rifles and started off down the river\nbank, their eyes bent to the left.\n\nWhen they had advanced far enough to see behind the boxes, they turned\nand looked. The face was gone! There was no one behind the packing\nboxes.\n\nSandy scratched his head. \"Blame it, I know I saw somebody watching us.\"\n\n\"Come on, we'll look closer.\" Dick led the way forward and they examined\nall the boxes, but found each one empty.\n\n\"Looks queer,\" Dick admitted.\n\n\"Those Indians can disappear mighty suddenly,\" Sandy said. \"Let's tell\nMr. MacLean.\"\n\nThey hurried back to the store. The trader plainly was deeply concerned\nover what they had to tell. \"I tell you, boys, I hadn't ought to let you\nmake this trip,\" he said, pacing back and forth. \"Henderson has men here\nthat I know nothing about. They say he has secret operatives all over\nthe northern frontier. Sandy's uncle never would forgive me if anything\nhappened to you fellows. But I don't see what else I can do. The mounted\npolice must be notified.\"\n\n\"Well, Sandy and I aren't men,\" Dick replied modestly, \"but you know\nwe've been in the north country for a year now and so far we've taken\npretty good care of ourselves. Sandy's Uncle Walter will tell you that.\"\n\nThe trader surveyed Dick Kent's stalwart figure and Sandy's more stocky\nframe with a renewal of confidence. \"Yes,\" he concluded, \"I believe you\nfellows will come out all right. Shake.\"\n\nDick and Sandy gripped Martin MacLean's hard hand. They felt a glow of\nadmiration for the big \"sourdough\" who had so complimented two\n\"chechakos,\" or tenderfeet. The trader drew from his pocket a wallet of\nmoney and thrust it into Dick's hand, with the remark it might come in\nhandy for expenses.\n\nAn hour later the boys were gliding down the river, Dick in the stern\nsteering, Sandy in front on the lookout for snags. The dark walls of\nspruce forest on either side closed in on them with a mysterious\nsilence. They seemed to feel malevolent eyes watching them as they\nsheered the oily surface of the stream. The strange face both had seen\nat Fort du Lac remained in their memory and made them silent as they\nforged along with the current. It was the last warm days of fall;\nalready a hint of winter was in the air, and with the threat of danger\nhovering about was combined another feeling of dread, as if the very\natmosphere of the vast, lonely land heralded the approach of mercilessly\ncold weather.\n\n\"You watch the south bank, and I'll watch the north,\" Dick broke the\nsilence when the landing at Fort du Lac had faded from view around a\nbend. \"I think we'll be followed by land if our suspicions are correct\nand there's really some one on our trail.\"\n\n\"They'll have to follow by land for a ways anyway,\" rejoined Sandy. \"Mr.\nMacLean will see them if they use one of the canoes at the landing. But\nI suppose they have a canoe hidden somewhere along the river.\"\n\n\"That's about it,\" Dick agreed. \"We'll keep sharp watch and be ready to\nduck if there's any shooting.\"\n\nThey paddled on silently for a quarter of an hour, making good time and\nkeeping to the center of the stream. They were just passing a large heap\nof driftwood, lodged in an eddy near the north shore, when Sandy called\nDick's attention to something under the brush.\n\n\"What do you make of that light brown object just the other side of the\nlittle sand point sticking out into the river?\" asked Sandy.\n\n\"I was looking at it myself,\" responded Dick. \"I thought it was a log\nwith the bark off it at first, but it might be a canoe.\"\n\n\"It looks a lot like a canoe--as if they tried to hide it under some\nbrush but the brush sprung up after they left and exposed it.\"\n\n\"We'll turn in and see,\" Dick plied his paddle lustily, and the light\ncraft swerved toward the shore.\n\n\"Aren't we taking an awful risk?\" Sandy was cautious. \"Suppose they're\nclose to us.\"\n\n\"We'll take a chance,\" Dick returned. \"Better take a chance now than\nhave them catch up with us in that canoe. It's plain they're not here\nyet.\"\n\nNerves keyed high at thought of the peril they might be floating into,\nDick and Sandy bore swiftly into the sand point, and presently the\nbottom of the canoe grated on the gravel. Dick leaped out into the\nshallow water and beached the canoe, Sandy following closely.\n\n\"It's a canoe sure enough!\" Dick exclaimed when they reached the spot\nwhere they had seen the suspicious object.\n\n\"And they tried to hide it,\" Sandy came back, as they drew nearer. \"See\nthe tracks in the mud? Say! That canoe hasn't been there a day, if\nthat!\"\n\n\"You're right!\" Dick cried, \"and right here and now we're going to see\nthat nobody chases us in this canoe.\"\n\n\"Be careful,\" Sandy cautioned.\n\n\"We'll set her adrift,\" Dick went on, unheeding Sandy's precautions.\n\"Here, Sandy, you grab the bow and I'll get around behind and push. Soon\nas we get it out in the current it'll float down where they can't find\nit. We might sink it, but we'd have to tow it into the river and we\nhaven't time.\"\n\nSandy fell to work with a will. The canoe was lodged in the mud rather\nsecurely and they strained for some minutes before it at last came loose\nwith a suck and splash that nearly tumbled Sandy over. An instant later\nthey had shoved the canoe out into the stream, where the current caught\nit and carried it past the sand point.\n\nThe young adventurers paused to gaze with satisfaction upon this blow\nthey felt they had dealt the enemy, when a sound from the shore drew\ntheir startled attention.\n\n\"Listen,\" whispered Dick.\n\nThey could hear a crashing among the trees. Looking toward the forest\nthey could see nothing at first. Then suddenly, into a small clearing\nthat led down to the river bank, burst three men, running and waving\ntheir rifles menacingly.\n\n\"Quick! The canoe!\" cried Dick hoarsely. \"Don't stop to shoot. We've got\nto get away. They're after that canoe. It's the Indian with the scarred\nface!\"\n\nSandy tumbled into the stern of the canoe in one flying leap, and as\nDick shoved on the prow, he picked up his paddle and stroked backward.\nThe canoe left the beach with a lunge, and Dick was nearly precipitated\ninto the water as he leaped into his position in the bow. As they\ncrouched to paddle, three shots sounded and bullets cut the water about\nthem.\n\n\"Downstream fast,\" shouted Dick. \"Stay low, Sandy.\"\n\nRifle balls were flying thick and fast as they rounded the sand point,\npaddling frantically after the canoe they had set adrift.\n\n\"Diable!\" they could hear an enraged cry in French, as their pursuers\nfound the canoe gone and the boys escaping.\n\nDick turned and looked back. All three of the men were kneeling with\nrifles leveled. \"Duck!\" he shouted to Sandy just in time.\n\nThe rifles cracked almost as one and two bullets ripped through the\nbottom of the canoe, plowing up splinters in their wake.\n\n\"We've sprung a leak,\" called Sandy almost immediately. \"Those shots\nhave put the canoe out of commission!\"\n\nDick glanced about at the bottom of the canoe. Sandy was right. The\nbullets had struck below the waterline and the river was gurgling in\naround the packs and blankets.\n\n\n\n\n                               CHAPTER II\n                        AT LITTLE MOOSE PORTAGE\n\n\nDick Kent thought swiftly. There was no time to lose. The canoe was\nfilling fast. Already it was growing perceptibly heavier. Ahead he could\nsee the canoe they had set adrift. It was a long chance, but it was the\nonly thing to be done, aside from swimming to the other shore and\nabandoning all their packs and camp equipment.\n\n\"Sandy!\"\n\n\"What?\" panted his chum.\n\n\"We've got to switch our packs into that empty canoe.\"\n\n\"Catch it first, I'll say!\" cried Sandy.\n\nThey redoubled their efforts on the paddles. The drifting canoe was\nspinning slowly in the stream. Waterlogged as they were, they yet were\nslowly gaining on the empty craft. Out of rifle range from the sand\npoint, the bullets of their pursuers no longer endangered them as they\nskipped across the water yards short of their mark.\n\nSlowly they overhauled the empty canoe, and at last Dick reached out and\ngrasped the prow, hauling it to the side of their own sinking craft.\nDropping their paddles then, they straddled the two gunwales and with\ntheir legs held the canoes together while with all haste they\ntransferred their dunnage. Working grimly and silently they had almost\nfinished when the canoes began to whirl slowly in the current. Sandy\nlost his balance and toppled into the water, his hoarse shout of\nsurprise muffled as the river closed over his head.\n\nSandy came up from the cold bath. Dick shouted encouragement, extending\na paddle to his chum while he alone held the canoes together. In a\nmoment, spluttering and shivering, Sandy crawled back into the loaded\ncanoe.\n\nThe leaking canoe was rolling on its side when the last blanket was\ntaken from it. The young men picked up their paddles and struck out with\nall speed. They feared their pursuers, since they no longer appeared on\nthe sand point, had run back into the forest and were coming along the\nriver bank into rifle range.\n\n\"B-r-r-r, that sure was no warm bath,\" chattered Sandy.\n\n\"Keep paddling, and warm up,\" Dick called over his shoulder. \"We'll go\nashore and dry your clothes when we're sure we've got away from them.\"\n\nNo sooner were the words out of his mouth when a rifle shot sounded from\nthe shore some distance behind them. A bullet whined over their heads\nand plunked into the river.\n\n\"There they go again!\" cried Dick. \"Let's bear toward the other shore\nand see if we can't get out of range.\"\n\nCrouching over their paddles they swerved to the right and gradually\npaddled out of range once more.\n\nUntil late in the afternoon the boys kept up a killing pace with the\npaddles. Sandy, warmed by the stiff exercise, would not permit Dick to\ngo in shore on his account, and so they drew into the swift current\nabove Little Moose Portage.\n\nThe canoe was beached on the shore opposite the one where the enemy had\nput in an appearance miles behind. It was an excellent camp site. They\nwere only about three hundred yards above the rapids, whose swift\ncurrent, filled with sharp stones, made it necessary to go on by land to\na point where the river was less dangerous. They could hear the sound of\nthe rushing water.\n\n\"We'll keep sharp watch while we make camp,\" said Dick. \"Those fellows\nmay have found another canoe and caught up with us.\"\n\n\"Even if they come on by land they can't be so very far behind,\" Sandy\nadded, shivering a little now that the warming work on the paddle was\ndiscontinued.\n\nDick and Sandy had paddled many miles that day and they were very tired.\nA year before they could not have kept on that far. But the north\ncountry had hardened their already healthy bodies, until they laughed at\nthe exertion that would have put a southland boy flat on his back.\n\nA campfire of pine cones and dead wood soon was crackling cheerily. Dick\nset on the coffee pot and mixed up some flapjacks while Sandy took off\nhis moccasins and sox by the fire. By the time Sandy was fairly dry the\nmeal was ready, and the boys fell to ravenously. Now and again they were\nstartled by some sound from the forest, but each time the noise proved\nto be only that made by a wild animal investigating their campfire.\n\n\"We'll take turns on watch tonight,\" Dick said, sipping his last cup of\ncoffee.\n\n\"Let's draw straws for the first trick,\" Sandy suggested.\n\n\"No,\" Dick objected, \"that ducking you had gave you the hardest day.\nI'll take the first watch.\"\n\nSandy wanted it otherwise, but Dick insisted.\n\n\"Well, if you'll be sure to wake me up when my turn comes,\" Sandy was\nalready yawning, \"it's all right with me.\"\n\nSoon Sandy was rolled in his blankets, close by the fire, which was\nwelcome indeed in the chill of the autumn evening.\n\nDick took a position in the shadow of a clump of willows where the\nfirelight would not reveal him to any prowlers of the night that might\ninvestigate too closely. Here he squatted Indian fashion, his rifle\nacross his knees. Many thoughts passed through his mind as the time\nslowly passed. That Sandy and he were on the most perilous mission of\ntheir lives he knew. But contrary to being frightened by impending\ndanger, he was overjoyed. It was what he and Sandy had come north\nfor--adventure. And they were getting it.\n\n\"We ought to get to Mackenzie's Landing day after tomorrow,\" he mused,\ntalking low to himself to keep from going to sleep. It was too dangerous\nto walk about. \"That means three or four more camps before we get a\nguide. Gee, I wish we could go on by ourselves. If Sandy or I only knew\nthe country around Fort Dunwoody--but we'd get lost, and we can't afford\nto lose any time with Sandy's uncle in Bear Henderson's hands.\nWonder----\"\n\nDick sat up suddenly, listening. It seemed to him that above the ripple\nof the river water and the low rumble of the distant rapids he heard the\nscrape of a canoe bottom on the gravel. His heart leaped and beat on\npainfully. What if some one stole their canoe, or crept up and attacked\nthem! The thought galvanized him into action.\n\nHe dropped to his hands and knees, his rifle clutched in his right\nfingers. It was only a short distance to that part of the beach where\nthey had dragged the canoe up out of the water. Dick crawled quietly\nalong among the shadows to the fringe of undergrowth bordering the\nbeach. At first the glare of the firelight in his eyes made all appear\nvery dark by contrast, but gradually his vision was adjusted, and he\ncould make out the vague form of the canoe.\n\n\"Wonder if it was only my imagination,\" he mumbled, not seeing anything\namiss. \"But----\" he caught his breath. The canoe had moved!\n\nSure enough, difficult as it was to see distinctly, he knew the canoe\nhad rocked from side to side.\n\n\"What could it be?\" he whispered, straining his eyes.\n\nIt seemed now that he could see a darker blot of darkness moving above\nthe rim of the canoe, but he was not sure. There was but one thing to\ndo--crawl out of the sheltering bushes and across the sand to a point\nfrom which he could ascertain just what was moving the canoe.\n\nThe decision made, Dick did not hesitate a moment. Half way to the\ncanoe, he stopped and lay prone on his stomach, listening and watching.\nWhat little breeze there was blew from the canoe toward him, so that an\nanimal would not easily detect his approach unless it heard him.\nFaintly, Dick could hear a scratching sound, as if some sharp instrument\nagitated the sand and gravel. He was more puzzled than ever.\n\nHe moved on again, drawing one knee cautiously after the other, careful\nthat his rifle was ready for instant firing. Ten feet further and the\nscratching sound ceased suddenly. Dick was now within a few feet of the\nprow of the canoe. He stopped dead still, and, resting on his knees,\nraised his rifle.\n\n\"Who's there?\" he called sternly.\n\nA sudden commotion followed. Around the prow of the canoe flashed two\nround glowing eyes, and a bearded, tuft-eared cat face. Dick's rifle\ncrashed. There was an inhuman squall of pain; a ball of fur and fury\nbounded high into the air and fell writhing, spitting and snarling\nwithin three feet of Dick, who leaped to one side.\n\n\"Hi! Hi! Dick, where are you?\" It was Sandy calling from the campfire.\nHe had been awakened by the gun shot.\n\n\"It's all right, Sandy,\" Dick called back, stooping over the animal he\nhad killed. \"Only a lynx scratching around the canoe. Come and take a\nlook. Gosh! I must have hit him right between the eyes.\"\n\nSandy came running up, and bent over the dead lynx. When the cat's last\nstruggles ceased, the boys hauled it into the firelight.\n\n\"I was scared half to death,\" Sandy grinned sheepishly. \"I was dreaming\nwe were in Fort Good Faith with Uncle Walter and about a million wild\nIndians were whooping and shooting at the stockade.\"\n\n\"You can bet your bottom dollar I didn't feel so calm about the time\nthat lynx came around the canoe and looked me in the eye,\" Dick\nconfessed. \"I never took aim at all--just blazed away. Lucky shot I call\nit. I thought it was some one trying to steal our canoe.\"\n\n\"What time is it?\" Sandy inquired, getting up and stretching.\n\nDick drew out a fine watch which had been a graduation present. \"Only\nten o'clock,\" he reported. \"You can go back to bed, Sandy. My watch\nisn't half done.\"\n\nThe young adventurers talked a few minutes after Sandy was back in his\nblankets. But Sandy soon fell asleep. In spite of the excitement brought\non by the killing of the lynx, Sandy was so tired that he went back to\nsleep almost immediately.\n\nDick looked down at the lynx. \"He's sure a beauty,\" he whispered\nproudly. \"I kind of wish I hadn't killed him now. It's a shame to kill\nanimals when a fellow can't use their fur or meat.\"\n\nHe returned to his position in the shadow of the willows and sat there\npatiently until midnight, when it was time to awaken Sandy. The fire had\ndied down and he heaped more wood on it. He never felt more wide awake\nin his life. Sandy was sleeping soundly.\n\n\"Sandy, you're pretty tired,\" Dick murmured, looking down at his chum,\n\"and I feel just about as fresh as when we pitched camp. Guess I won't\nwake you up--just let you sleep until morning.\"\n\nThere was an affection like brotherhood between the two boys, who had\nbeen neighbors and chums from infancy up. And since Dick was two years\nolder than Sandy, he often felt somewhat like an older brother would\nfeel toward a younger. Perhaps this induced Dick to resume his watch\nwithout awakening Sandy.\n\nWhen Dick sat down again he was sure he could stay awake all night, but\nthe flicker of the firelight, the whispering silence of the forest, and\nthe ripple of the river were like a pleasant lullaby. Before he knew it\nhe was nodding, and presently he fell sound asleep. Head drooping over\nhis knees, Dick slept unknowing, while the fire died down and the deep\nblackness of the northland night crept over the silent camp.\n\nSandy awakened with a start at four o'clock. It still was dark, as the\ndays were shortening with the approach of winter. He did not know why\nDick had not awakened him, and he was at first fearful that something\nhad happened to his chum.\n\n\"Dick, Dick,\" he called softly, sitting up in his blankets, trying to\npierce the gloom with his eyes.\n\nThere came no answer. Quietly Sandy reached out and one hand closed on\nhis rifle. The feel of the cold steel comforted him. He had begun to\nlearn what an encouraging companion a firearm can be in those lonely\nclimes where they are necessary if one would live long.\n\nArising, Sandy began a search of the camp and quickly came upon Dick,\nsound asleep a little way off.\n\n\"Ho, ho,\" laughed Sandy mischievously, \"I've got one on you now, old\nboy. Asleep on watch, huh. I'll fix you.\"\n\nHis fears relieved, Sandy's sense of humor cropped out. He could not\nresist playing a good joke on his chum.\n\nSandy thought a moment, then hit upon an idea, which he quickly put into\nexecution. The fire had gone out, and Sandy's scheme was no other than\nto rebuild it so close to Dick that it would sizzle the sleeping lad's\nchin.\n\nSoon Sandy had the fire crackling and snapping within two feet of Dick's\nface, as he lay on the pine needles where he had fallen over during the\nnight.\n\nSetting about breakfast, Sandy chuckled as he watched Dick begin to\nsquirm and mutter in his sleep as the heat reached him.\n\nAt last Dick turned over, and flinging out one hand, almost plunged it\ninto the fire. Sandy cried out sharply, and jumped forward to keep\nDick's hand out of the fire, when his chum leaped up wide awake.\n\n\"What! How----\" Dick stammered, blinking his eyes.\n\nSandy doubled up with laughter. Dick soon saw the joke and joined Sandy\nin a hearty laugh. Then he quickly grew serious.\n\n\"That's the worst thing I could have done,\" Dick accused himself.\n\"Suppose Henderson's men had crept up on us while I was asleep. Sandy,\nI'll never forgive myself for this. I can't blame them for shooting\nsoldiers that sleep on guard duty--after tonight.\"\n\n\"Oh, never mind,\" Sandy's optimism came to the front. \"What's the\ndifference. We're safe and sound, aren't we?\"\n\n\"That doesn't excuse me for neglecting my duty,\" Dick insisted. But as\nhe reached for the tin plate of bacon and camp bread that Sandy handed\nhim, Dick cheered up. \"What beats me,\" he concluded, \"is that I was\ngoing to let you sleep till morning, Sandy. Guess I wasn't as tough as I\nthought I was.\"\n\n\"That's just like you,\" Sandy retorted. \"Just because you're a couple of\nyears older than I you think you ought to do all the heavy work.\"\n\n\"Well, I'll see that you do your night watching after this,\" Dick\npromised. \"And now we'd better get started. If those fellows kept on\nafter us they've had just about time enough to catch up.\"\n\nIt did not take the boys long to break camp. The trail that led along\nthe bank past the dangerous Little Moose Rapids to safe water was on the\nother bank of the river, and Dick and Sandy prepared to paddle across.\nOnce on the trail, they planned to shoulder their packs and the canoe\nfor the jaunt over the portage. They shoved out the canoe without mishap\nand were cutting across the swift current of the Big Smokey river above\nthe rapids, when on the other shore, at the point where they intended\nlanding, Dick thought he saw a wisp of smoke ascending, as from a\ncampfire recently extinguished.\n\n\"Sandy, do you see any one over there?\" Dick called.\n\n\"I see a kind of smoke haze among those little spruce trees,\" Sandy\nreplied.\n\n\"You know what I think?\" Dick went on, sturdily plying his paddle, \"that\ngang is waiting for us over there. They're in ambush. As soon as we get\nclose in they'll open fire. I'll bet I'm right. If I am we don't dare\ntry to land.\"\n\n\"Well, there's no trail around the rapids on the side we camped,\" Sandy\nreturned. \"We'd have to detour about twelve miles that way to get back\nto the Big Smokey.\"\n\nThey were slowly drawing closer to the opposite bank, the swift current\npulling them downstream a little in spite of their efforts. The boys\nwere silent as they drew closer, undecided which way to turn, almost\ncertain now that a warm reception awaited them on the portage trail\nlanding. Suddenly Dick spoke cooly, but tensely:\n\n\"Backwater, Sandy. Don't act excited. We don't dare go on. I just saw\ntwo rifle barrels thrust over a hump of moss on a fallen tree.\"\n\nSandy did not falter at the warning. He reversed his paddle, as Dick was\ndoing, and the canoe came almost to a standstill.\n\n\"We'll have to shoot the rapids!\" Dick's voice was like the snap of a\nwhip as he made known his daring resolve.\n\n\n\n\n                              CHAPTER III\n                         DICK SHOOTS THE RAPIDS\n\n\nAt Little Moose Rapids the Big Smokey river plunged through a gorge\nnearly a half mile long before it finally came once more to a gentler\nincline where canoeing was safe. Only the most daring of canoeists ever\nrisked piloting a frail craft through this treacherous stretch of water,\nand many who had dared had been drowned. Dick's last minute resolution\nwas one of desperation. Though he and Sandy were experts with the\npaddle, yet they never would have considered attempting to shoot any\nrapids had death or capture not threatened them.\n\n\"We'll never make it!\" the optimistic Sandy was shaken from his\ncheeriness by Dick's desperate resolve.\n\n\"We've got to!\" shouted Dick, as with one strong stroke of his paddle he\nswerved the canoe head on with the current, and they sped straight\ntoward the gorge.\n\nAt the maneuver they heard an angry shout from the shore that had been\ntheir destination. Even at that distance they could detect the menace in\nthat cry, and with added zeal they bent to their paddles.\n\nThen a rifle cracked and a ball whistled across the water behind them.\nAnother and another shot was fired while they sped on swifter and\nswifter.\n\n\"We're getting out of range!\" Dick cried.\n\n\"I hope so,\" panted Sandy.\n\n\"They're poor marksmen, anyhow,\" Dick returned.\n\nThey both fell silent as they left one danger behind, only to face one\nalmost as threatening.\n\nThe river swiftly narrowed and deepened as they swept down between the\nhigh walls of the gorge. A sullen roar of the water against the numerous\nrocks and against the solid walls could be heard. The canoe seemed to\nshoot ahead like a leaf on the wind. Louder and louder grew the sound of\nrushing water. Then the boys saw the first wave of foam and spray where\nthe water whirled among several huge boulders.\n\nSandy was in the bow, Dick in the stern when they struck the first angry\nwhirlpool.\n\n\"Use your paddle to push off the rocks,\" shouted Dick above the rumble\nof the water.\n\nThey scudded past a huge, wet boulder, seemed almost flung against\nanother, only to be whisked into a deep pool where it was all Dick and\nSandy could do to keep the canoe from turning clear around. Out of the\npool, they danced on once more. The rapids were clear of rocks for a\nspace, but they were moving so fast that it seemed no time before they\nreached a giant buttress of stone that seemed to bar the way.\n\n\"Push off,\" cried Dick. \"I'll backwater. Heave now. Here we go!\"\n\nThey shaved the bluff so closely that the grind of the canoe upon the\nrock could be heard. The dash of water against the cliff showered down\nupon them, and the canoe took in a bucketful.\n\n\"Dip the water out!\" shouted Dick, while they spun into another deep\npool, the cliff behind them.\n\nSandy began frantically bailing out the water with his hat, while Dick\ndesperately held the canoe bow against the current.\n\nThe gorge was deeper now, almost shutting out the early morning\nsunlight. All about spray flew in the air, like driving mist, and the\nroar of rushing water was almost deafening. The canoe was holding up\nwell, yet its two occupants realized its frail shell would be shattered\nto atoms if but once it was thrown upon one of the countless rocks they\nseemed to miss by inches.\n\n\"I hope we don't hit a waterfall,\" shouted Sandy as he ceased bailing\nwater and drew a long breath.\n\n\"Let 'er come,\" responded Dick daringly, swerving the canoe this way and\nthat with a lusty stroke of his paddle.\n\n\"Look out, another rock!\"\n\nSandy turned from his bailing and grasped his paddle just in time. In a\ncrouch he met the boulder with the end of the paddle and pushed. The\ncanoe forged off to the left, dodged in between two other rocks, and\nonce more they reached a space comparatively straight and free from\nobstructions. Like an arrow they shot onward.\n\nThe noise of the foaming water was fast increasing in volume. Dick\nfeared a waterfall, and silently he nerved himself for it, and none too\nsoon. Dashing down a narrow channel and bobbing around a curve like a\ncork on ocean waves, he saw ahead a mist of spray and the rumble of\nfalling water burst upon his ears.\n\nSandy could not suppress a cry of terror, but white-lipped Dick managed\nto hold his breath for what was to come. \"Hold tight!\" he shouted to his\nchum. \"I'll hold her straight, and we'll dive over. We've a chance. It's\nnot high.\"\n\nStraight toward the edge of the waterfall the canoe shot with terrific\nspeed. The rumble of the water was frightful. Then they went over. One\nglimpse they had of the whirlpools boiling below the falls as the prow\nof the canoe swept over and the light craft leaped into the misty air,\nlike a ski jumper.\n\nIt was only a short drop of about five feet, but when the canoe struck\nthe churning water, it spun and spun about, wallowing in the foam. Dick\nand Sandy were drenched to the skin in a moment. All they could do was\ncling to the canoe, hoping against hope.\n\n\"Hang to that rock ahead, if we go under!\" Dick cried, above the thunder\nof the falls.\n\n\"I can't see!\" Sandy shouted back, rubbing the water from his eyes and\ncoughing.\n\nThen the canoe struck something submerged, and turned over on its side,\ntipping Dick and Sandy into the boiling whirlpools.\n\nDick clung to the side of the canoe as the water washed over him. For an\ninstant Sandy disappeared, then Dick saw him come up, also clinging to\nthe canoe, which had not entirely turned over, but had shipped so much\nwater that it was sinking.\n\nPresently, canoe and swimmers were whipped into a deep pool below the\nfalls, and Dick and Sandy began desperately flinging water out of their\ncraft. A little later they crawled back into their canoe, wet as half\ndrowned rats, and Dick pushed off into the center of the stream.\n\nThe worst was over. Below the falls the gorge widened out slowly and the\ncurrent grew more sluggish. For a quarter of an hour they glided on\nsilently without need of their paddles, except to keep the craft in the\ncenter of the stream.\n\n\"Whew! I hope we don't run into any more rapids,\" Sandy breathed more\nfreely.\n\nDick emphatically agreed. \"Next time,\" said he, \"I'll prefer facing the\nbullets, I think. Gee, if the fellows back in the U. S. A. knew what\nwe'd just gone through they'd have a fit.\"\n\n\"They'll never believe it,\" Sandy opined.\n\n\"We'll make 'em believe it if we live to tell it,\" vowed Dick, pulling\nextra hard on his paddle and making the canoe leap forward like a live\nthing. \"But, to change the subject, I guess we left the enemy behind\nthis time.\"\n\n\"I'll say so,\" Sandy came back, \"but two duckings in two days isn't\nfair. Where can I stop off and get dry?\"\n\n\"I think we'd better keep moving till noon,\" Dick advised. \"Then we can\nkill two birds with one stone--eat and dry off too.\"\n\nSandy saw the wisdom of this and fell silent, bending his energies to\nthe paddle. They made good time until about noon, when they espied a\nsandy shoal ahead of them that promised plenty of dry firewood for a\ncampfire. They drew in, beached the canoe and made camp. An hour later,\ndry again and in good spirits, they pushed off and went on down the\nriver.\n\n\"Seems as if I smell burning wood in the air,\" Dick remarked a couple of\nmiles further on.\n\n\"I do too,\" Sandy replied, \"----must be a forest fire somewhere near.\"\n\n\"Hope it's not too near,\" said Dick, \"a forest fire would hold us up a\nwhile even if we are on the river. I've heard my father tell about the\nfires they used to have in Oregon. They're no joke.\"\n\nSandy was about to add what he knew of forest fires when they both\nsighted another canoe toiling upstream. At that distance they could not\nat first distinguish whether there was more than one in the canoe.\nHowever, they held any stranger they might meet a possible enemy, since\nMartin MacLean had told them how far-reaching was the hand of Bear\nHenderson, and so they prepared for hostility.\n\nSlowly the two canoes drew together. Sandy quietly picked up his rifle,\nwhile Dick continued paddling. They could now see there was but one man\nin the canoe.\n\n\"Hello there,\" Dick hailed.\n\nThe stranger waved a hand, ceased paddling, except to hold his canoe\nagainst the current, and waited for the boys to glide up. He was a tall\nman, with long, dark hair and a leathery face.\n\n\"Where you goin'?\" he asked as the canoe prows touched.\n\n\"Mackenzie's Landing,\" Dick replied, seeing nothing hostile in the\nother's demeanor, and seeing no reason why he should not reveal his\ndestination, if not his errand.\n\n\"I got my grub stole back river a piece,\" the stranger said, pointing\nover his shoulder with one thumb. \"Have you fellers got plenty of grub?\"\n\n\"Sure,\" Dick answered. \"Want to eat with us? Our grub's a little wet,\nbut it swallows all right.\"\n\n\"I'd be obliged,\" the stranger returned, \"but mebbe you wasn't figgerin'\nto stop jest now.\"\n\n\"We just had a snack,\" Dick admitted, \"but if you're hungry we'll split\nwhat we have.\"\n\n\"I jest need enough to get me to Fort du Lac.\"\n\n\"Fort du Lac!\" Dick and Sandy chorused. \"We just came from there!\"\n\n\"So? Wal, it'll be nigh three days canoein' up river, an' I'll need\ngrub. No time to hunt. You fellers didn't happen to run across an Injun\nwith a heap of scars on his face?\" the man asked, searching their faces.\n\n\"A scar faced Indian!\" Sandy exclaimed. \"Why----\"\n\n\"Well, yes,\" Dick broke in with a warning look at his chum. \"We noticed\na fellow of that description at the fort. Didn't think much about him,\"\nDick was cautious.\n\n\"You fellers needn't be afraid to tell me all you know,\" the stranger\nhad noticed Dick's reserve and his interruption of Sandy. \"I ain't\npublishin' my business but my name's Slade.\"\n\n\"Not Malemute Slade, the scout for the mounted!\" Dick exclaimed, for the\nman's reputation as a scout was a fable in the north country, and many\ntimes he had heard it spoken with awe and admiration.\n\n\"There's them call me Malemute Slade,\" admitted the tall man cooly, \"but\nwhat was that about this here scar faced Indian?\"\n\nDick then related the queer experiences at the fort.\n\nThe canoes were permitted to drift on down the river while they talked.\nMalemute Slade listened attentively.\n\n\"His name's Many-Scar Jackson,\" Slade told them when they had finished\nwith their story. \"He's wanted for murder down the river a piece. But\nthat's nothin' to this Henderson breakin' loose. That's news to me, an'\nit'll be news for the mounted maybe. I've heard rumors f'r a long time,\nbut didn't think much of it. A tough customer, Henderson. You fellers\nwants to watch y'r step. If I seen any of the gang that was foller'n you\nI'll square up with 'em.\"\n\nIn the keen eyes and the lean jaw of the far-famed Malemute Slade the\nboys saw that which made them confident that Slade could \"square up\"\nwith most any one or any number.\n\n\"Tell the factor you saw us and that we're all right--only got a ducking\nwhen we shot Little Moose Rapids,\" Dick said.\n\nMalemute Slade's eyes lighted up. He looked with new respect at Dick's\nwiry figure. \"So you fellers shot the Little Moose an' come through\nalive--wal, I swan. You must have toted a dozen rabbit's feet.\"\n\n\"Not a one,\" Dick replied modestly, while Sandy grinned with pride.\n\n\"Y'r apt to have somethin' worse on your hands afore you get to\nMackenzie's,\" Malemute surprised them. \"There's a forest fire whoopin'\nit up back a piece, an' it'll maybe hit the river afore you pass it.\nThere's a bit of smoke in the air now. Hey!\"\n\nDick and Sandy started up and looked where Slade pointed.\n\nNearly four hundred yards down the river a stag had come down to drink\nand was standing half in and half out of the water. The canoes were\nslowly drifting down upon it.\n\n\"You fellers want a fresh haunch o' venison f'r tonight?\" queried\nMalemute.\n\n\"You bet!\" Dick and Sandy chimed, \"but the deer's seen us and we can't\nget close enough for a shot.\"\n\n\"Reckon I can drop him from here,\" Malemute Slade replied cooly.\n\n\"What!\" Dick exclaimed incredulously.\n\nMalemute's only reply was slowly to raise his 45.70 lever action rifle\nto his shoulder. Dick and Sandy watched breathlessly. Motionless as a\nstatue, the big man took aim before his rifle crashed. As the echo of\nthe shot sounded in the silent forest, the stag leaped upward and fell\ninto the river with a soundless splash.\n\n\"Now you fellers split your grub with me, an' I'll be goin' on. If I had\ntime I'd paddle down an' cut a hunk off that deer. But I'll have to be\nmoochin'.\"\n\nMalemute Slade thought nothing of the wonderful exhibition of\nmarkmanship he had just made, and Dick and Sandy were awed to silence as\nthey undid their packs and transferred half their food into the scout's\ncanoe.\n\nMalemute Slade paid them in king's coin for the provisions.\n\n\"You'll probably see me again afore this Henderson business is over, but\nit's hard tellin',\" was Malemute's parting prophecy. \"Au revoir.\"\n\n\"Au revoir,\" the boys sang out the French \"so long,\" and started on to\nwhere the stag had fallen.\n\nLate that evening, making camp at a point they judged somewhere within\nfifty miles of Mackenzie's Landing, the smoke of the forest fire was so\nstrong it made them cough. They had paddled a little way up a small\ncreek for the night, thinking to make themselves more secure from a\npossible night attack from Henderson's men, who seemed so determined\nthey should not get to the mounted police.\n\n\"I'm afraid we're in for it,\" Dick shook his head concernedly.\n\n\"It sure feels as if we were close to a fire,\" Sandy agreed dubiously.\n\n\"Well, we'll need all the sleep we can get at any rate,\" Dick concluded,\nas he rolled into his blankets, and Sandy prepared for the first watch.\n\n\n\n\n                               CHAPTER IV\n                           THROUGH THE FLAMES\n\n\nThat night Dick slept fitfully. The place where they had camped was in a\ndeep coulee, unwooded except for a few clumps of red willow. Straight\nabove them, at the top of an almost perpendicular wall of red shale and\ncrumbling sandstone, was a dark fringe, which marked the beginning of a\nmighty forest of spruce and jack pine. Moaning in his sleep, Dick sat up\nand commenced rubbing his eyes. Then he paused to stare in open-mouthed\nwonder.\n\nThe coulee was full of smoke. It floated around them in a ever\nthickening cloud, while above, plainly visible in the glare of the\nconflagration, sweeping down from the north, he beheld a thick, dense\ncolumn of smoke, which seemed to span the coulee like a black bridge.\n\nTen feet away, Sandy, on sentinel duty, coughed and dug at his eyes. In\nalarm, Dick threw aside his blankets and crawled hurriedly forward to\nconsult with his chum.\n\n\"Sandy!\" he shouted, \"the fire is all around us. We'll die like rats in\na trap if we stay here. Why didn't you awaken me before? Let's hurry\nback to the river and our canoe.\"\n\n\"Can't,\" said Sandy laconically, \"I've been watching that. There's a\nbelt of fire between us and the river. We should never have camped so\nfar away from it.\"\n\n\"Well, you know we thought we'd be safer from Henderson's men up here,\"\nDick replied.\n\nThe boys could hear plainly the howling of the wind and the distant,\nthunderous roar of the fire. Accustomed as he had become to danger since\nhis sojourn in the north, Dick could not overcome a sudden feeling of\nfear and apprehension.\n\n\"Where will we go?\" shivered Sandy. \"It seems to be all around us.\"\n\n\"We've got to go through it somehow,\" Dick answered, not altogether\nsure, himself, what ought to be done. \"It's dangerous to remain here any\nlonger. What do you think is best?\"\n\nSandy, eyes running water, scratched his head in perplexity.\n\n\"If we could get to the river,\" he said, \"we'd be safe. I don't see any\nother way.\"\n\nA few moments later, two disconsolate figures clambered up the side of\nthe coulee and struck off hurriedly at right angles with the fire. With\na catch in his throat, Dick perceived the huge walls of flames bearing\ndown upon them. For several miles, at least, they were cut off from the\nriver. Even the sky glowed dully like a large orange disk through a\nthick blanket of smoke.\n\n\"What's that!\" exclaimed Sandy, suddenly starting back.\n\nSomething had shot past them through the underbrush--a heavy body,\nhurtling along in mute terror. Almost immediately came other bodies,\nsmall and large--rabbits scurrying almost between their legs; deer,\njumping past in a wild stampede; bear and moose, crashing their way\nforward in a cumbersome, heart-stirring panic, as they ran from the\nfire.\n\n\"If they're afraid, it's about time we were,\" Sandy declared grimly,\nthrough set teeth. \"If this smoke gets any worse we'll be suffocated in\nanother ten minutes. My throat feels as if I had been drinking liquid\nfire for a week.\"\n\nTwenty feet away a flying ember settled down on the dry grass and\nimmediately burst into flames. With the ever increasing velocity of the\nwind, similar patches of fire sprang up around them on every side.\n\n\"I'm afraid,\" said Dick, fighting bravely against mounting despair,\n\"that we'll never make it. I never saw such a wind.\"\n\nSandy did not reply. With handkerchiefs pressed to their noses and\nmouths, the boys struggled forward for another quarter of a mile.\n\nBy this time the heat had become terrific. Dick's face felt as if it had\nbeen washed in a bucket of lye. Sandy's cheeks were streaked with tears,\nnot tears of grief, but tears of misery from smoke-tortured, bloodshot\neyes.\n\n\"No use,\" choked Sandy, plunging down a short embankment with Dick at\nhis heels. \"I'm about ready to quit. You see,\" he explained, struggling\nwith the lump in his throat, \"I'm getting dizzier and dizzier every\nminute. This heat and smoke is getting me.\"\n\nDick put out his hand with an assurance he did not feel, and patted his\nchum on the shoulder.\n\n\"Buck up,\" Dick encouraged, \"we'll get out of this somehow. I tell you,\nSandy, we've got to do it. Maybe this----\"\n\nDick never finished what he was about to say. His foot slipped, and with\na startled exclamation, he pitched forward, completely upsetting Sandy.\nIn a moment both boys had rolled and slid down a steep bank. It seemed\nthere was no end to the fall, and Dick's heart almost failed him as he\nthought of what fate might meet them below. Perhaps they were rolling\ntoward the brink of a cliff hundreds of feet high, perhaps they would\nfall into some rock cluttered canyon, or again, they might be drowned in\nsome deep lake at the bottom of the bank.\n\nThen they reached the bottom with a jarring impact that shook the breath\nfrom their bodies. When they recovered enough to look each other over,\nDick was sitting upright, astride of Sandy, who lay in a crumpled,\ngroaning heap under him. Dick heard, or thought he heard, the trickle of\nrunning water. His right foot felt pleasantly cool. When he put out his\nhand to investigate his fingers encountered water.\n\nSandy was half submerged in a tiny pool, and was sinking fast, before\nDick could pull him back to safety. Dazed from the fall, Sandy sputtered\na moment, then inquired excitedly:\n\n\"Have we got to the bottom?\"\n\n\"I guess so,\" replied Dick. \"At any rate there seems to be a sort of\ncreek running along here. Are you all right, Sandy?\"\n\n\"Well, if I'm not, I soon will be,\" answered Sandy, more cheerfully.\n\"Wait till I get a drink of this water. Boy, I'm dry. Do you think we'll\nbe safe here?\"\n\nBy way of answer, Dick pointed up to the wide belt of fire. \"It's closer\nthan it was before. We're protected down here from the heat and smoke,\nbut that won't last long. In two hours this place will be as hot as a\nstove. Our only chance is to keep on moving.\"\n\n\"I hate to leave this water,\" said Sandy, gulping large mouthfuls of it.\n\n\"I don't intend leaving the water,\" Dick assured him. \"It's just\noccurred to me that our best plan will be to follow this little creek.\nIt's probably fed from a spring and will eventually run either into a\nlake or river. Once we get into more water we'll be pretty safe.\"\n\nSandy thought Dick was right, and a few minutes later, greatly\nrefreshed, they set out again, following the creek downstream.\n\nTwo miles further on the creek ran into a larger stream, and a little\nlater as they hurried around a curve, Sandy, who was in the lead, gave\nvent to an exclamation of despair.\n\n\"Look at that!\" he shouted. \"The fire has cut in ahead of us.\"\n\nSandy was right. Not more than a quarter mile downstream, the fire was\nraging on both sides of the creek, and even as they looked, a large jack\npine, flaming to the top of its highest branches, swayed suddenly in the\nwind and went crashing forward in a shower of sparks and burning embers.\n\nSick at heart, the two young adventurers stood for a short time,\nscarcely daring to think of their predicament. Apparently there was\nlittle chance of escape, the main body of the fire behind them, another\nfire sweeping ahead.\n\n\"We've got to get through,\" Dick muttered. \"We'll have to take a chance,\nSandy. The fire ahead hasn't been burning long and it's not as far\nthrough it--maybe not more than a hundred yards. Somehow, I feel certain\nthat this creek will take us straight on to the Big Smokey where we left\nthe canoe.\"\n\nSandy's face brightened a little. \"I believe you're right, Dick. If a\nburning tree or branch doesn't fall on us, we can make it. We'll have to\nwade right down through the center of the stream. If it gets too hot we\ncan dive under the water. I'm going to take off my shirt, soak it in\nwater and breathe with it around my head.\"\n\n\"A good idea,\" approved Dick. \"I'll do it too.\"\n\nA half hour later, two boys emerged, wet and blackened, from a cloud of\nsmoke and flame and advanced painfully along the creek to a point where\nit emptied into the Big Smokey river. Behind them thundered the terrible\nconflagration, getting closer every moment. Moose, deer and caribou\nstood trembling at the river's edge, or struck boldly out into the\nstream. The boys turned north and followed the river for a mile before\nthey discovered the object they sought. It was daylight now, though the\nsmoke made it difficult to see far. Yet the light, graceful Peterboro\ncanoe, loaded with supplies, did not miss their searching eyes. As they\npushed it into the river and climbed in, Dick Kent gave voice to a\nfervent exclamation.\n\n\"We made it, Sandy!\" he exulted, as he dipped his paddle once more into\nthe bosom of the Big Smokey.\n\nSandy was about to share Dick's rejoicing, when the movements of a huge\nbrown bear, which had splashed into the water behind them, attracted his\nattention. The bear was swimming straight for the canoe.\n\n\"Shove out quick!\" cried Sandy suddenly, but too late.\n\nThe brown bear, blinded by smoke, and thinking the canoe some log to\ncling to, clawed at the rim of the frail craft and pulled down. The\ncanoe went over, spilling its contents into the river, while the bear,\nfinding the craft unstable, swam on out into the river.\n\n\n\n\n                               CHAPTER V\n                          MACKENZIE'S LANDING\n\n\nThe plunge into the river revived both Dick and Sandy. Gasping, they\ncame up for air, only to breathe the choking smoke and gases of the\nburning forest. They knew that the canoe was upside down and that their\npacks were in the bottom of the river. The bear was nowhere to be seen.\n\n\"Are you all right, Sandy?\" called Dick, hoarsely.\n\n\"You bet,\" Sandy replied, a bit faintly.\n\nAmong the burning brands sizzling in the water, and the flying sparks,\nthey struggled with the canoe. In a few minutes they had righted it,\nthough it was half full of water. The paddles, they could see, had gone\nwith the packs.\n\n\"Look for a paddle!\" shouted Dick. \"They must be floating around\nsomewhere.\"\n\n\"There! I see one,\" Sandy dived off as he spoke, and swam back quickly\nwith a paddle in one hand.\n\nBut look as they did they could not locate the other paddle.\n\n\"We can't look any longer. We'll have to change off with one paddle,\"\nDick called a little later.\n\nDick paddling, they started on. The heat still was stifling, but they\nfelt that the air was growing cooler. The wind seemed in their faces,\nwhich would tend to bear the fire back along the river. Wild animals of\nall kinds still could be seen in the water, wallowing along the shore or\nswimming the stream. But they had no more dangerous encounters with the\nfrightened beasts.\n\nTwo hours of paddling, shifting the paddle back and forth between them\nas soon as one grew tired, and they came to a comparatively clear\nstretch of water. Here the fire was deeper in the forest, and had not\neaten out to the bank yet. In greedy gasps, Dick and Sandy drew in the\ngusts of cool, pure air that were wafted over them.\n\n\"Look back, Sandy,\" Dick called.\n\nThe whole sky was a mass of red flames behind them, and an ocean of\nsmoke was rolling ceaselessly upward.\n\n\"Mackenzie's Landing can't be much further,\" Sandy said when they had\nlooked their last upon the great fire.\n\n\"No, we ought to make it by night. We'll have to make it or camp without\ngrub or blankets. I prefer going on,\" Dick stated.\n\n\"So do I,\" Sandy rejoined.\n\nSome distance further on, as they rounded a huge bend in the stream,\nthey could not suppress a cheer. In the distance they could see the\nshoulder of a high, barren bluff which was the ten-mile landmark on the\ntrip to Mackenzie's Landing.\n\nIt was late in the afternoon when in the distance they at last viewed\nthe stockade and roofs of Malcolm Mackenzie's trading post. Blackened\nand disheveled, nearly exhausted, they guided their canoe to the pier,\nwhere three half-breeds were watching them curiously. The half-breeds\nhelped them secure their canoe, and listened without comment to some of\ntheir story of the eventful journey.\n\n\"Malcolm Mackenzie, he sick,\" one of the half-breeds told them. \"No can\ngo. Him burned bad when fight with fire.\"\n\n\"Did you hear that?\" Dick turned to Sandy.\n\n\"Yes--just our luck. Now what?\" Sandy returned, a little disheartened,\nas the half-breeds led the way into the stockade.\n\n\"We can talk to Mr. Mackenzie, can't we?\" Dick asked one of the men, as\nthey entered the post.\n\n\"Yah, I guess.\"\n\nPresently, they were ushered into a room smelling of liniment and\narnica. On a bunk lay Malcolm Mackenzie, his head and one arm swathed in\nbandages. Evidently he was suffering considerably from serious burns. He\nturned his head as the boys came in.\n\n\"Bear Henderson has captured Fort Good Faith,\" Dick blurted out. \"My\nfriend's uncle has been imprisoned. Mr. MacLean sent us to you. He said\nyou would lead us to the mounted police post at Fort Dunwoody.\"\n\n\"I've feared this,\" Malcolm Mackenzie's eyes narrowed, \"but you see how\nit is with me, boys. I can't travel. Got some bad burns while fighting\nthat forest fire. But I can send an Indian who knows the trail.\" He\nturned to one of the half-breeds, who was standing behind Dick and\nSandy. \"Send in Little John Toma,\" he commanded.\n\nA little later Dick and Sandy saw a young Indian enter. He was handsome\nin a dark, inscrutable way, and though not very tall, was powerfully\nbuilt. He stood respectfully at attention, seeming more intelligent than\nmany of his kind.\n\n\"Toma,\" Mackenzie spoke, \"I want you to lead these young men to Fort\nDunwoody as fast as you can. Travel light. You ought to make it in four\ndays if everything goes right.\" He turned back to the boys. \"Did MacLean\nsay anything about a cache of grub along the way?\"\n\n\"Yes,\" Dick reached into his pocket and drew out the map the trader had\ndrawn indicating the position of the cache of food on the trail to Fort\nDunwoody.\n\nMackenzie took the map, glanced at it and handed it to Toma. \"It's on\nLimping Dog Creek,\" said Mackenzie, \"just where that gorge you follow\nintersects the stream. You know the place.\" To Dick and Sandy:\n\"Introduce yourselves and get acquainted. Toma will get everything ready\nfor you to go on. Take a rest as soon as you eat. Oh, Calico, Calico!\"\nhe called to some one.\n\nAs the boys and Little John Toma passed out, a large, waddling Indian\nwoman came in. They heard Mackenzie instructing her to get a meal ready\nfor his visitors before the bear-skin curtain dropped behind them and\nthey found themselves in the spacious living room of the post.\n\nDick and Sandy awkwardly introduced themselves to the young Indian who\nwas to be their guide.\n\n\"Glad to meet,\" Toma surprised them by saying, his teeth flashing\nwhitely in a smile.\n\nDick and Sandy quickly felt that they were going to like Toma.\n\n\"I'll bet he's the son of a chief,\" Sandy said to Dick, when the young\nIndian had gone, and they were busy at the wash bench, scrubbing off\nsome of the smoke and ashes of the forest fire.\n\nThe boys ate heartily of the food the Indian woman placed before them on\nthe rough board table. As soon as they were through they were shown to a\ncomfortable bunk behind moose-hide curtains. Scarcely had they lay down\nwhen they fell into sound slumber.\n\nIt seemed to Dick Kent that he had only been asleep a moment when a\nhand, gently shaking his shoulder, awakened him. He looked up into the\nsmiling face of Toma, the young guide.\n\n\"Time to go,\" said Toma. \"You wake up other fella.\"\n\nAs the curtains fell, and Toma disappeared, Dick turned and shook Sandy.\n\nAn hour later they bid goodbye to Malcolm Mackenzie and wished him\nspeedy recovery from his burns. The canoe lay ready packed with\nprovisions at the landing when they arrived there. Toma was starting to\npush off. Dick and Sandy hopped in, and Toma sprang lightly into the\nbow.\n\n\"Now for Fort Dunwoody,\" Dick breathed a sigh of relief.\n\n\"If I wasn't an optimist,\" Sandy added, \"I'd say we aren't there yet by\na long shot.\"\n\nToma silently sculled the craft into the center of the river, and they\nwere once more floating down the stream. The boys marveled at Toma's\ndeftness with the paddle, though they themselves were experts. The young\nIndian seemed able to make the canoe fly with his quick, powerful\nstrokes.\n\nA half hour of paddling and the roofs of Mackenzie's Landing had\ndisappeared in the haze of the morning, and once more the walls of the\nsilent spruce forest closed in on either side of them.\n\nLate that night they camped some twenty miles from the trading post, in\na little clearing at the river's edge. Toma mentioned \"bear sign,\" and\nso they hung up their flour and bacon on a tree bough for fear a bear\nmight get it.\n\nSandy kept first watch while Toma and Dick slept.\n\nIt was a dark night. Only the stars were out, and when the fire died\ndown Sandy scarcely could see a dozen paces from the camp. Occasionally\nhe glanced into the shadows, listening to the mysterious sounds of the\nforest, and starting up at each crackle of a twig or rustle of\nundergrowth.\n\nSandy wondered if the men on their trail had been thrown off, and\nimagined what he would do if they would suddenly attack. As he thought\nof the dangers threatening Dick and him, his hand tightened on his\nrifle.\n\nIt was nearly eleven o'clock, the time he was to call Toma for the\nsecond watch, when Sandy became conscious of some sinister presence.\nBefore he really saw or heard anything, he shivered and looked fearfully\nabout into the gloom of the forest.\n\nA scratching and grunting noise attracted his attention to the tree\nwhere they had hung up the flour and bacon. It seemed he could hear the\nshuffle of heavy feet and the wheeze of giant lungs as he listened\nintently.\n\n\"I won't call Dick and Toma,\" thought Sandy. \"It may be only my\nimagination. I'll go see what it is.\"\n\nHeart beating wildly, Sandy commenced to creep toward the point he had\nheard the noises. He could see nothing in the dark, yet as he strained\nhis eyes it seemed to him that one portion of the blackness was blacker\nthan the rest.\n\nSuddenly, he heard the crashing of a splintered tree bough. A low,\nvibrating growl followed, and Sandy dropped upon his stomach. There came\na slapping, thumping sound, then an angry growling and tussling. The\ndark blot lurched downward. Sandy raised his rifle and blazed away at\nthe shape. A rambling roar rose in the night.\n\n\"Dick! Toma!\" cried Sandy, as he turned about and fled, hearing behind\nhim the rush of a heavy body pursuing him.\n\n\n\n\n                               CHAPTER VI\n                         A GRIZZLY SHOWS FIGHT\n\n\nToma and Dick were already on their feet when Sandy rushed toward them\nout of the gloom.\n\n\"It's a bear, a giant bear!\" cried Sandy. \"Run! I've wounded him!\"\n\nThe angry roar behind Sandy was all that was needed for Dick and Toma to\ntake to their heels with alacrity.\n\n\"Get up tree, get up tree!\" Toma called to them.\n\nFaster than they ever before had climbed a tree, Dick and Sandy shinned\nup one in the dark. The bear charged beneath them in the underbrush. The\nhuge beast wheeled on finding his prey had taken to the trees and\ncircled the trunk which supported Dick and Sandy. Toma's calm voice came\nthrough the gloom from a near-by tree:\n\n\"Him grizzly all right,\" Toma told them. \"You stay in tree. I get down\nto rifle pretty quick.\"\n\n\"You surely must have wounded the bear,\" Dick whispered to Sandy. \"I've\nheard they won't attack unless they're wounded.\"\n\n\"I don't know what I did,\" Sandy came back breathlessly. \"I just blazed\naway and ran. Believe me, I don't want to go down there again while that\nmonster is wandering around looking for me. He'd chew us up in about two\nbites and a half.\"\n\nDick knew that Sandy's caution bump was working again, and he smiled in\nthe dark. He did not intend to let Toma go down after the bear alone.\nYet he believed the young Indian would protest if he revealed his\nintentions.\n\n\"Got your rifle?\" Dick called to Toma, not intimating his resolution.\n\n\"I got gun,\" Toma called back.\n\n\"I wish I'd thought to bring mine along,\" Dick muttered, \"but then it\ntakes an Indian to shin up a tree with a heavy rifle in his hand I\nsuppose. Anyway I have my knife.\"\n\n\"Don't go down, Dick,\" whispered Sandy, as the bear crashed about in the\nbrush below them.\n\n\"Nonsense, Sandy, I've got as much chance as Toma. We can't let that\nbear wreck our camp. That's what he's up to.\"\n\n\"Then I'll go down too,\" Sandy stubbornly decided.\n\nThey could not hear Toma's movements with the bear making so much noise,\nbut Dick suspected the guide already had slipped down from his tree and\nwas stalking the wounded grizzly, perhaps close enough to get in a fatal\nshot.\n\nPresently, they could hear the bear make off into the gloom toward the\ncampfire. When Dick and Sandy dropped down out of the tree, the bear\nseemed to be on the other side of the campfire, clawing and mouthing\nover their dunnage.\n\n\"You better stay up in the tree,\" Dick said.\n\n\"Not on your tintype,\" Sandy snapped. \"If you go, I go.\"\n\n\"Well, then, we've got to get our guns,\" said Dick. \"Mine's right where\nI got out of my blankets.\"\n\n\"Seems to me I dropped mine just before I started climbing the tree,\"\nSandy was feeling around in the dark. \"Yes, here it is,\" was his\ntriumphant call.\n\nToma seemingly had vanished. Since his last words, they had heard\nnothing more from him. Dick judged the guide was stalking the bear from\nsome other direction. At any moment he expected to hear the report of\nthe Indian's rifle, and see the flash of it in the gloom.\n\nSandy alone armed, save for Dick's hunting knife, the boys began a\nstealthy advance toward the camp where they could hear the bear slashing\nand groveling about, evidently in some pain, for they were sure now that\nSandy's shot had taken effect.\n\nThe coals of the campfire shed a faint glow. As the boys drew nearer, on\nhands and knees, they could see the bulk of the grizzly outlined. He\nseemed a mammoth of his kind, and indeed was a fearful beast to meet in\nthe forest.\n\n\"I'll bet he's wrecked our camp outfit,\" Dick muttered. \"Careful, Sandy,\ndon't get too close. Let's wait till he gets away from the fire a little\nfurther, then I can get my rifle.\"\n\nScarcely were the words out of his mouth, when Toma's rifle crashed in\nthe dark on the left, and Dick and Sandy saw a streak of flame, and\nheard the roar of the bear, plainly hard hit. The grizzly rose upon his\nhind legs and turned toward the spot he believed his enemy was hidden.\nThen Sandy leveled his rifle and fired, drawing bead as best he could\njust under the huge beast's forelegs.\n\nAt this second shot, the bear seemed undecided just which way to charge.\nHe stopped, his head turning from side to side, growling horribly, not\nhit hard enough to fall.\n\nToma shot again, then Sandy. The grizzly dropped to all fours, and began\nclawing at his breast. Toma shot again from another position. The bear\nrose up again with a roar of pain and rage and started for Dick and\nSandy, who turned to flee. Then the big beast, without any apparent\nreason whatsoever, wheeled about and made off into the forest in the\nopposite direction.\n\n\"He's hit hard!\" cried Dick, hurrying forward.\n\nToma came out of the gloom like a shadow. \"He go off die,\" said the\nIndian. \"Be careful he no come back. I go see where he go.\" Toma\ndisappeared after cautioning the boys to stay where they were until he\nreturned.\n\nThe minutes passed slowly while Dick and Sandy waited the return of\nToma. Finally Dick grew impatient and was about to go on to the campfire\nfor his rifle, when Toma appeared again, as if he had risen out of the\nearth.\n\n\"She all right,\" Toma reported. \"Him keep going. Him die somewhere.\"\n\nRelieved, Dick and Sandy approached the campfire. Toma already was\nheaping on more wood. As the flames leaped upward, and the light chased\naway some of the surrounding shadows, Dick and Sandy breathed freely\nonce more. However, sleep was far from them after the narrow escape from\nbeing clawed by the wounded bear. They ventured about to see what damage\nthe big grizzly had effected.\n\nThey found Dick's and Toma's blankets torn to shreds. The coffee pot was\ncrushed flat and the sugar sack broken open, its contents scattered.\n\nDick hurried to the bough where they had hung the flour and bacon. \"Hey,\nlook here--Sandy, Toma!\"\n\nThey joined Dick. The bough had been broken down; the flour was\nscattered about as if the sack had exploded; the bacon was gone.\nSearching about in the gloom they found hunks of chewed rind among the\npine needles. Only one small chunk of bacon was left, and this they\npreserved in one of their knapsacks.\n\n\"Him no hungry,\" Toma grunted, \"him play. Him chew bacon up, spit him\nout.\"\n\n\"Well, he did us plenty of damage all right,\" Dick said ruefully.\n\n\"Looks like we were in for a hungry spell,\" Sandy added, resignedly.\n\n\"Humph! We have bear steak for breakfast,\" Toma exclaimed significantly.\n\n\"That's what I call justice,\" Dick laughed.\n\nAll three went back to the campfire then and squatted around the\ncrackling flames. The excitement had loosened Toma's tongue, it seemed,\nand he began telling stories of other bears he had known, and whom his\nfather had known. Dick and Sandy listened with rapt interest to the\nsimple tales of the young Indian.\n\nAlmost the balance of the night passed with Toma's droning voice\nrelating thrilling adventures among the tribes in the far north. Toward\ndawn Sandy turned in for an hour or so of rest, but Toma and Dick\nremained awake.\n\nThe sun had scarcely topped the distant forest skyline when Dick and\nToma awakened Sandy, and all three gathered up what they could of the\nwreckage remaining of their provisions.\n\n\"Now we gettum bear steak,\" Toma said.\n\nIn single file they followed the gliding figure of the guide, as he set\noff on the trail of the grizzly.\n\n\"See that track!\" Dick exclaimed presently, pointing with his rifle at a\nspot of soft leaf-mold.\n\n\"It's a bear track, all right,\" conceded Sandy, \"--and look! There's\nblood on that bush.\"\n\n\"We sure hit him a lot of times--I mean you and Toma,\" Dick corrected.\nHe felt disappointed that he had not actually been in on the killing of\nthe bear, since he had had no rifle. But the thrill of trailing a\nwounded grizzly made him forget.\n\nToma seemed to follow the trail as if by instinct. Where Sandy and Dick\ncould see no sign whatever, Toma went unerringly forward, always with\nthat gliding, noiseless, pigeon-toed pace, that seemed tireless, though\nit was kept up with an ease and speed that made Dick and Sandy run.\n\nFor a half mile they wound among the trees, beginning to come upon spots\nwhere the bear had dropped down to rest. At these points the blood was\ndrying in large clots. Finally, approaching a fallen tree, they came\nupon the grizzly, stone dead!\n\nDick and Sandy were about to cheer, yet the actual sight of the bear\nmade them a little sad. The great monarch of the forest never again\nwould proudly tread the forest aisles. Yet the boys felt a certain\nsatisfaction in having won in a battle with such a powerful foe.\n\nToma immediately began skinning one haunch of the great bear. \"Him old\nand tough,\" grunted Toma, \"but we cook um long time. That make um\ntender.\"\n\nDick laughed. \"The old boy will make stringy eating.\"\n\n\"I wish we could take his hide,\" Sandy sighed.\n\n\"It sure would knock the eyes out of the fellows back home,\" Dick said.\n\n\"No time to skin,\" Toma interrupted. \"Hide too heavy carry. Mister\nMackenzie say mus' travel light.\"\n\n\"Yes, it's impossible for us to have the old fellow's hide, but that's\nno reason why we can't have his scalp.\" Suiting his action to his words,\nDick drew his sharp hunting knife and stooped over the head of the\nwilderness king. With Sandy's help they took the old grizzly's scalp,\nears and all, as a trophy.\n\n\"It's yours and Toma's,\" Dick smiled, when they had finished. He held\nthe scalp out to Sandy.\n\nSandy's eyes lightened. \"Let Toma have the scalp. I'll take the claws.\"\n\nDick's hunting knife once more came into play. The bear's claws measured\nas long as five inches, and Sandy was exceedingly proud as he at last\npushed them into a side pocket of his leather coat.\n\nToma was waiting when they had finished. The guide had his knapsack\nfilled with the tenderest steaks he could cut.\n\nAt a jog trot they set out for the river and their campsite, and soon\nthey were grilling bear steaks over the fire.\n\nWhen they broke camp they had provisions for two scanty meals, including\nsome of the bear steaks which they saved from breakfast. The canoe\npacked, they once more set out down the river.\n\n\"We make um grub cache tomorrow,\" Toma encouraged them. \"Get um plenty\ngrub there.\"\n\nLate that afternoon, without mishap they reached a point where Toma said\nthey must abandon their canoe and go on by land, since the river swung\noff in another direction. They carefully hid their canoe in some\nunderbrush along with two others left by a party that had recently gone\non ahead of them, and started out on foot.\n\nDick and Sandy were very tired long before Toma showed signs of slowing\nup, but they gamely stuck to the pace without complaint.\n\nThey were angling down the side of a long ravine, toward a spring, which\nToma muttered would be a good place to camp, when of a sudden, the guide\nstopped dead.\n\n\"Hide quick!\" Toma whispered, with a significant gesture of one sinewy\nbrown hand.\n\nDick and Sandy crouched.\n\n\"Think um bad fellas ahead,\" Toma explained. \"You stay here. I go ahead;\nlook um over.\"\n\nDick and Sandy were glad to sink down and rest their weary legs. But the\nwarning in Toma's voice did not escape them. They were keyed to sharp\nwatchfulness as Toma dropped to his hands and knees and disappeared\nsilently among the bushes.\n\n\n\n\n                              CHAPTER VII\n                            THE RIFLED CACHE\n\n\nDick and Sandy had crouched in hiding for upwards of a half hour before\nToma returned. He came as he had gone, silently, like a ghost almost, so\nstealthy were his movements, so clever his woodcraft.\n\n\"What did you find?\" whispered Dick, anxiously.\n\n\"Two, t'ree--five bad fellas,\" Toma counted on his fingers. \"One Pierre\nGovereau lead um. They got um spring for tonight. We go round um. Got\nto. Them fellas friends Bear Henderson. They watch um trail for police.\n'Fraid police go to Fort Good Faith.\"\n\nDick and Sandy exchanged glances. Their weariness was temporarily\nforgotten in this new peril. They began to understand the far-reaching\npower of the man who had captured Sandy's uncle and had taken possession\nof Fort Good Faith on the edge of the northern wilderness.\n\n\"We go,\" Toma urged, his only excitement revealed by the swift movements\nof his eyes as they roved this way and that.\n\nSilently the Indian guide melted into the underbrush, Dick immediately\nbehind him, Sandy in the rear. For nearly two hundred yards they went\nonward, almost at snail's pace. It was twilight now. Long shadows of\ntree and bush stretched everywhere.\n\nAt last Toma signaled for them to stop. Dick and Sandy dropped flat. Not\nmore than three hundred feet ahead a campfire twinkled through the\ntrees, and, motionless, between them and the fire, stood a silent\nfigure, with rifle on his shoulder. It was a guard. Dick divined the\nfigure, so like the tree trunk against which it stood, had even escaped\nthe sharp eyes of Toma at first.\n\nFour men were sitting around the campfire, and they could hear the\nmutter of gruff voices. Once or twice a louder than usual exclamation in\nFrench arose above the other sounds. It seemed the leader of the party\nwas haranguing his men, or disciplining one of them.\n\nSuddenly Dick started and clutched Sandy's arm.\n\n\"That guard!\" he exclaimed under his breath. \"It's the scar faced\nIndian!\"\n\nSandy paled a little. It seemed almost impossible that the Indian could\nhave gotten ahead of them. His appearance was as mysterious as had been\ntheir glimpses of him at Fort du Lac and along the Big Smokey river.\n\nToma was motioning for them to bear to the right. They crawled off after\nthe guide in that direction.\n\nNeither Dick nor Sandy knew which of them made too much noise, or\nrevealed some part of his body, yet they had crawled no further than a\ndozen paces when the guard moved, turned and looked straight at them.\nToma, watching over his shoulder, fell flat, Dick and Sandy following\nhis example. Had they been seen?\n\nThe guard, his rifle ready for use, started slowly toward them. Tensely,\nDick and Sandy watched Toma for a sign as to what course to take. They\nsaw Toma slowly turn to his side. The guide swung his rifle to his\nshoulder as he lay.\n\nJust as the guard cried out, Toma fired.\n\nThe scar faced Indian whirled, dropped his rifle and fell to his knees,\nclutching at one shoulder. Dick and Sandy got a glimpse of the men at\nthe fire leaping up and snatching their rifles, as they took to their\nheels after Toma.\n\nFor several minutes they sprinted in the wake of the young Indian's\nflying heels, hearing behind the crash of their pursuers through the\nunderbrush, and their cries to one another.\n\nThen, before a hollow tree, half covered by the dead branches of a\nlightning-blasted pine tree, Toma halted suddenly. He motioned to them\nto follow and disappeared into the half-obscured hole in the tree. Dick\nand Sandy slipped in after him. There was barely enough room in the tree\nfor three to stand upright, but they managed to crowd in, while Toma\nquickly arranged the dead branches over the hole until their hiding\nplace was entirely covered from view.\n\nThe distant shouts grew louder, as the men beat the brush looking for\nthem. Two came closer and closer, until at last they stopped before the\nhollow tree, so near that the three hidden feared their heavy breathing\nmight be heard.\n\n\"I thought I saw 'em go this way,\" one said, in a harsh voice.\n\n\"Mebbe so,\" the other, apparently an Indian, answered. \"It look like\nthey jump in air an' fly away.\"\n\n\"Pierre sure will give us the devil if we let 'em get away,\" said the\nfirst. \"Can't blame him. Henderson will skin him alive if these trails\naren't kept clean of Hudson's Bay men and mounties.\"\n\n\"I see bush move over d'er!\" the Indian ejaculated.\n\nThe two men moved off in another direction, and the boys in the hollow\ntree breathed easier.\n\n\"No go yet,\" Toma advised. \"Wait till all quiet.\"\n\nThe minutes passed slowly while they waited in their cramped position.\nThe shouts of the searchers grew fainter as they apparently abandoned\nthe chase. Presently all was still. Toma peeped out through the branches\ncovering the entrance to the hollow tree. After looking carefully about,\nthe guide pushed back the branches and stepped out. Dick and Sandy\nfollowed. They were learning lessons in woodcraft every hour from this\nchild of the forest.\n\n\"I think we ought to go back to the camp, steal up close and see if we\ncan't learn something of your Uncle Walter, Sandy,\" Dick announced.\n\n\"Is it worth the risk?\" Sandy came back. \"Can't we do better by hurrying\non to Fort Dunwoody?\"\n\n\"It's true we can't do much without the aid of the mounted police,\" Dick\nstudied. \"Yet I'd like to know, if it's possible, just what has been\ndone with your uncle--how they're treating him.\"\n\nDick asked Toma what he thought of trying to learn something by\neavesdropping. \"If you think um best thing do,\" Toma replied. \"That scar\nface got best ears of all. He wounded now. Not much good; what say I\ntry?\"\n\n\"No, you've done plenty of this already, Toma,\" Dick was firm. \"I'll go\nthis time. You wait here where you can cover me with your guns if I am\ndetected.\"\n\nToma, assured Dick was determined to go, grunted his assent, and a\nmoment later Dick disappeared into the bushes on his perilous venture.\nSandy and Toma crawled back to within gunshot of the camp, where the men\nhad gathered again, gesticulating to one another, plainly undecided what\nto do.\n\nWhen Dick left his chum and the guide he realized the danger he faced.\nYet he knew any information he might gain would be more than valuable to\nthe police when once he got in touch with them. Govereau's men were\ntalking so loudly that he had little trouble in overhearing them. The\nleader's heavy voice broke out in French, which disappointed Dick, for\nhe knew very little French. Then Govereau changed to broken English,\nevidently for the benefit of a member of his band who did not understand\nFrench.\n\n\"We go on queeck, ketch them,\" Govereau was saying. \"Sure t'ing them\nfella are zee ver' ones come from Fort du Lac. That devil Many-Scar an'\nthem others--they let zem get through Little Moose, I bat. We go.\"\n\nThe four began breaking camp hurriedly. The scar faced Indian was\nreclining with one arm in a crude sling. He arose with the others and\nrolled up his blanket with one hand, as if nothing were wrong with him.\n\nDick was disappointed in not hearing anything regarding the situation at\nFort Good Faith. But, as he could think of nothing to do about it, he\nedged about and crept back to Sandy and Toma.\n\n\"They're breaking camp,\" he told his companions. \"They think we've gone\non ahead. Suppose we fool them and camp right here after they leave.\"\n\nToma's face lighted up and Sandy was jubilant at the chance to rest his\nweary legs. A few minutes later, hidden in the bushes, they watched\nGovereau and his four men string out on the trail and quietly disappear\ninto the forest. They got a close look at the leader of the band as he\npassed, and Dick and Sandy could not suppress a shiver of dread. The man\nhad an exceedingly evil and cruel face.\n\nDick hid his disappointment in learning nothing of Henderson's movements\nand of Sandy's uncle in his elation at this opportunity to camp where\nToma had planned. They would be fresh for a long hike next day, which\nwould take them to the hidden cache of provisions.\n\nToma said little while they prepared their scanty meal, which was for\nthe most part, bear steak. Every now and then the guide looked up at the\nsky and sniffed the air.\n\n\"Storm pretty soon. Winter come. Heap big blizzard few days,\" he finally\nconfided to Dick and Sandy.\n\n\"That means we've got to make a raise of a dog team,\" Dick said, tearing\noff a huge hunk of cold bear meat.\n\n\"Good thing Mr. MacLean gave you that money,\" Sandy observed.\n\nDick agreed with his chum, stifling a yawn. Already his eyes were\nclosing. Toma consented to take the first watch, and in a few moments\nDick and Sandy were sound asleep in their blankets.\n\nThe night passed without incident, Dick and Sandy taking their turns on\nwatch. At dawn they were on the trail again, leaving camp hungry. They\nhesitated to shoot at any small game for fear Govereau's men might be\nnear. Toward noon, however, Dick's gnawing stomach got the better of his\ncaution, and he knocked over a partridge. They made a short stop,\nbroiled the partridge and divided it.\n\nAppetites a little appeased, they were off again, hoping to make the\ncache of provisions on Limping Dog Creek by nightfall. Late in the\nafternoon they trudged down into the canyon designated by MacLean on the\nmap.\n\nIt was twilight when the canyon walls widened and grew less precipitous.\nToma said they were nearing Limping Dog Creek. Sandy was hobbling from a\nslight sprain received when he tripped over a root, and Dick was far\nfrom fresh.\n\n\"Flapjacks will sure taste good,\" Dick murmured.\n\n\"Amen,\" Sandy groaned in answer.\n\nWhen at last they came in sight of the creek, Toma stopped to compare\nlandmarks with the map.\n\n\"There um three trees,\" Toma pointed to some huge balmagiliad trees that\nstood out from the smaller jack pines like giants.\n\nThey hurried forward. Martin MacLean had said the cache was in the third\nof the three big trees nearest the creek. They speedily reached the tree\nand Toma climbed it. He was gone for some time, Dick and Sandy straining\ntheir eyes upward through the dark foliage.\n\nToma came down much slower than he had gone up. As he dropped to the\nturf, Dick and Sandy awaited anxiously his report.\n\n\"Him gone,\" said Toma briefly. \"Cache not there!\"\n\nDick's eyes narrowed, and Sandy's countenance grew glum indeed.\n\n\"Maybe this isn't the tree,\" Dick ventured.\n\n\"Him right tree,\" Toma was certain.\n\n\"It must have been Govereau's men,\" Dick spoke, after a short silence.\n\n\"Mebbe so,\" Toma grunted.\n\n\n\n\n                              CHAPTER VIII\n                           DICK DROPS A MOOSE\n\n\nThe loss of the cache, more than anything else, had cast its shadow of\ngloom over the spirits of Dick and Sandy. Toma, however, who had made\nthe discovery, seemed not so deeply concerned.\n\n\"We catch um meat,\" Toma attempted to cheer the boys. \"Mebbe bye an' bye\nwe eat.\"\n\n\"I'm not so sure about that,\" declared Sandy, thinking of the lonely\nstrip of bacon and the one handful of flour, which were all that\nremained of the provisions the grizzly had destroyed. \"To tell you the\ntruth, I haven't seen very much game lately. Have you, Dick?\"\n\nDick shook his head, forced to acknowledge the truth of Sandy's\nstatement.\n\n\"When a fellow's hungry,\" Sandy complained, rubbing his lame ankle,\n\"he's hungry, that's all, and a mouthful of bacon is about as much good\nto him as a drop of fresh water in the ocean.\"\n\n\"Me no eat one time for whole week.\" Toma reminded them.\n\nBoth boys looked up in astonishment.\n\n\"A whole week!\" gasped Dick, \"great guns! I hope we don't come to that.\"\n\n\"Mebbe set snare for rabbit tonight,\" encouraged Toma. \"Toma good ketch\num rabbit.\"\n\n\"I could eat two or three rabbits,\" Sandy grumbled, taking up the slack\nin his belt.\n\nAs they made their way onward, Dick seriously considered their plight.\nThoughts of the ruthless, cold-hearted rifling of the cache by Bear\nHenderson's men filled him with an anger that was difficult to suppress.\nBut anger or resentment could not help them now. The thing to do was to\nabandon any attempt at further progress that day and put in a few good\nhours hunting while it was yet daylight.\n\n\"Boys,\" he decided, \"we'd better pitch camp here for a while, until we\ncan bag some game. My suggestion is that each of us start off in a\ndifferent direction. We must keep track of the time and be sure to get\nback to camp by dark. The chances are that at least one of us will be\nsuccessful.\"\n\n\"It's hunt or starve,\" agreed Sandy. \"Which way do you want me to go?\"\n\n\"Toma had better try his luck here in the creek valley,\" said Dick,\n\"because game is apt to be more plentiful here and he's the best hunter.\nYou and I can make our way into the hills, keeping about half a mile\napart. Shoot anything at all that has meat on its bones,\" and he winked\nslyly at Toma.\n\n\"I could eat a skunk and like it,\" groaned Sandy. \"By the way, before we\nstart don't you think we'd better divide that bacon?\"\n\nWith a queer, inexplicable feeling, Dick produced the last morsels of\nfood from their packs and divided them carefully. If he gave Sandy a\nlittle more than an equal portion, no one, with the possible exception\nof a tiny sparrow perched on a branch overhead, could have noticed it.\nThey ate in silence, and in silence they arose immediately after their\ninadequate meal and started off for the hunt.\n\n\"I don't think I'll ever see anything,\" Dick muttered to himself, \"or if\nI do the chances are that the pesky thing will get away. Hang it all,\nwhy did Govereau, or whoever it was, have to find that cache?\"\n\nDick's mood brightened a few minutes later as he came up through the\nautumn sunshine to the foot of a slope, thickly covered with stunted\npine. It looked like a very good hiding place for ptarmigan, or possibly\neven deer. He unslung his rifle and went forward as cautiously as he\ncould, one finger hovering close to the trigger of his gun.\n\nBut, after an hour's slow progress, Dick had begun to lose hope. He had\nseen nothing. Apparently the forest was as devoid of all animal life as\na city street. Except for a hawk, circling lazily about high overhead,\nthere was neither bird nor beast anywhere in that lonely stretch of\nwilderness.\n\nMopping his perspiring brow, the young hunter finally sat down for a\nmoment's rest, before continuing his course to the top of a high ridge.\n\nThen an abrupt, totally unexpected crackling in the heavy Saskatoon\nthicket ahead caused him to start--almost in wonderment. His breath came\nquickly. He half rose, then fearing, that even his slightest sound might\nspoil everything, he sank down again, his left hand nursing the cold,\nblue barrel of his Ross rifle.\n\nMore crackling, a sudden parting of the bushes, and Dick's heart almost\nstood still. A large bull moose, majestic in his stature, crashed into\nview.\n\nBy this time Dick was fairly trembling with excitement. Twice he\nendeavored to raise his rifle to his shoulder. His arm shook so much\nthat he knew it would be worse than useless to attempt a shot while his\nnerves were in such a condition.\n\n\"I can't do it,\" thought Dick, then across his mind flashed the mental\npicture of a cache, broken into and robbed, and the sneering face of\nPierre Govereau mocking him. Then his rifle went to his shoulder, and\ntwo loud reports rang out in quick succession. The moose stumbled, but\ndid not fall. Dick heard quite plainly its sudden snort of alarm and the\ncrash of underbrush as it struck off at terrific speed directly down the\nslope in the direction from which he had but recently come.\n\nThe moose was wounded, he knew, but he also was well aware from previous\nexperience that a wounded moose will often travel for miles before it\nfalls. Galvanized into action, Dick was off, following the blood-stained\ntrail, hoping against hope that either Sandy or Toma might intercept the\nanimal before it had become lost in the intricate tangle of brush and\nwoodland that lay to the south.\n\nSliding down a particularly treacherous part of the trail, Dick's foot\ncaught in an exposed root and he fell heavily. As he bounded to his feet\nagain, he thought he heard a distant shout--but he was not entirely\nsure.\n\nFor twenty minutes more, he pushed forward rapidly, sometimes almost\nlosing the trail of the moose. Then finally he did lose it altogether.\nSearch as he would, the telltale tracks had disappeared as magically and\nas unaccountably as if the animal had leaped into the air and flown away\nto a place of safety.\n\n\"It's the most unusual thing I ever heard of,\" Dick commented aloud,\nracing about in a vain effort to discover some sign that would point out\nagain the trail that had so suddenly vanished.\n\nIn despair his eyes fell upon a level formation of rock not more than\nthirty feet away. Could it be that the moose had passed that\nway--scrambled over the level rock floor in its mad race with death? If\nso, it would explain the mysterious disappearance of the tracks; but\nthere must be blood-stains somewhere.\n\n\"Whoop-ee!\" he shouted as his quick eyes made out the signs he\nsought--small splotches of red scattered across the smooth surface of\nsandstone. And shortly thereafter, he hurried on again, like a young\nbloodhound finding fresh scent along the path ahead.\n\n\"I'll be more careful next time,\" he assured himself. \"It would be a\npity if this moose got away. I'd have been ashamed to show my face in\ncamp.\"\n\nTwo miles further on he almost forgot about the moose. Through a screen\nof willows, skirting a small creek, he caught the faint movement of some\nliving thing--something that stood concealed and which watched him\nfurtively as he made his way along through the dead and matted grass of\nthe little valley.\n\nDick felt instinctively that some danger threatened. What this was he\nhad no way of finding out, yet the feeling persisted that he was being\nwatched, spied upon by an enemy more terrible than any wild denizen of\nthe forest. As he advanced swiftly on his way, he was conscious of a\nstrange tingling of nerves, as if he half expected at any moment to be\npounced upon and overcome by an unknown assailant.\n\n\"I've never felt so queer about anything in my life,\" he confided to the\nsilent trees, as he hurried quickly along. \"I'm sure that I saw\nsomething move there in the bushes, and I'm positive that it wasn't an\nanimal that walks on four legs.\"\n\nJust then, an object lying on the ground, immediately ahead, drove every\nother thought from his mind. With a glad cry he sprang forward, and, a\nshort time later, stood looking down at the prostrate body of the bull\nmoose, majestic even in death.\n\nA lump arose in Dick's throat as he stood there silently regarding it.\n\"Poor old fellow,\" he breathed, \"it was a shame to do this. But perhaps\nyou saved us from starving. Maybe----\"\n\nA shout close at hand roused Dick from his musings. Wheeling about his\neyes lighted with pride and happiness, as he espied the approaching\nfigures of Sandy and Toma.\n\n\"Good for you!\" Sandy exclaimed, as he strode up to where his chum was\nstanding. \"I just knew you'd do it. Say, I believe it's the biggest\nmoose I ever saw.\"\n\n\"You ketch um big fella,\" complimented Toma. \"It is good.\"\n\nTogether the three young adventurers stood admiring the moose. So\ninterested had they become that not one of them caught the sound of\nstealthy footsteps until a heavy, threatening form, followed by three\nothers, pushed its way within the circle of admiring eyes.\n\nWith a cry of warning, Dick sprang back, clutching his rifle tightly.\nThen he looked at the man.\n\nIt was Pierre Govereau!\n\n\n\n\n                               CHAPTER IX\n                            PIERRE GOVEREAU\n\n\nGovereau advanced menacingly. Backed by the rifles of the three\nvillainous looking men with him, the three boys could do nothing.\n\n\"What you do wiz my moose?\" Govereau snarled.\n\n\"Do you mean to say you shot that moose!\" Dick exclaimed angrily.\n\n\"It iss so,\" Govereau avowed brazenly.\n\n\"You lie!\" Dick exclaimed hotly. \"I shot that moose. I can prove it.\nWhat do you mean by holding us up this way. We have done you no harm.\"\n\n\"It iss Henderson bizness--zat.\" Govereau turned and signaled his men to\nbind the three young men.\n\n\"You'll sweat for this,\" Dick gritted.\n\n\"Not so much as you,\" Govereau taunted. \"Young fellas like you should\nstay home wiz zee mamma.\"\n\nDick gritted his teeth again, but resolved to keep his mouth shut. He\nmust save his breath to get Sandy and Toma out of the mess. It must have\nbeen Govereau's men watching him when he had felt so queer on the trail\nof the wounded moose.\n\nDick did not resist the moose-hide thongs as they were bound mercilessly\ntight about his wrists. Sandy and Toma followed his example. There were\nother ways of getting the better of Govereau, and it might be easier if\nthey submitted, or seemed to submit, mildly to capture.\n\nThey could see one of the men slicing steaks from the moose haunch\nbefore, at a guttural command, they were started off into the woods,\nnorthward along Limping Dog Creek.\n\nAn hour's tramping brought them to Govereau's camp, four miles up the\ncreek. The scar faced Indian was there to greet them. He leered at the\ncaptives hatefully. Dick felt that the Indian knew one of them had shot\nhim at the camp forty miles away, and that the savage would do anything\nin his power to wreak vengeance.\n\nGovereau had made his headquarters in an old cabin, deserted by some\ntrapper. There were two rooms, and the three young captives were shoved\ninto the smaller of them, their hands still bound behind them. Probably\ntheir captors realized they would soon untie themselves, but since with\nthe huge oaken bolt shot on the door, there was no way of getting out of\nthe room, they did not bother themselves about it.\n\n\"Well?\" Dick turned to Toma and Sandy, when at last they were left\nalone.\n\nToma's face was as stolid as ever. Sandy had nothing to say. He sat down\non the bunk at one side of the room.\n\n\"I guess we're in a pickle, all right,\" Sandy said at last.\n\nDick paced back and forth twice, then stopped before the door, which he\ncarefully inspected. The door seemed heavy enough to repel the attack of\na battering ram, say nothing of three boys. Dick turned back to Sandy\nand Toma. \"Govereau will question us now, I suppose,\" Dick spoke\nrapidly. \"And he'll probably take us out separately to see if our\nstories are the same. He'll want to know just how much we know of\nHenderson's movements and what we are trying to do against him.\"\n\n\"What shall we say?\" Sandy scratched his head. Toma said nothing. The\nyoung Indian seemed to feel that the situation was beyond his ability to\nhandle.\n\n\"We'll tell Govereau that we have been visiting the factor at Fort du\nLac--spending our vacation there, and that we were on our way south--to\nreturn home. How's that?\"\n\n\"That sounds all right,\" Sandy responded, a little dubiously.\n\n\"No go so far east if go south from Fort du Lac,\" Toma's dark eyes\nblinked rapidly.\n\nDick thought a minute. \"Then suppose we have some one at Fort Dunwoody\nthat we want to see before we leave for home--a cousin.\"\n\n\"That's the trick,\" Sandy agreed enthusiastically.\n\n\"Then we all understand what we're to tell,\" Dick resumed. \"Toma, how\nabout it?\"\n\n\"I tell um,\" was the taciturn reply.\n\n\"If Govereau believes our story he may let us go,\" Dick concluded. \"If\nhe learns the truth he may do something worse than just hold us behind a\nlocked door.\"\n\nAll three were silent for a time while Dick paced back and forth. Upon\nhis shoulders he realized was now the bulk of responsibility. Toma might\nexcel him on the trail, where native woodcraft and instinctive stealth\nwas the chief requirement, but in the present situation Toma was at best\nonly a willing servant. And it was Sandy's nature to depend upon his\nchum, himself only offering what suggestions occurred to his lower mind.\n\n\"I've a plan to escape, if this first scheme fails!\" Dick suddenly\nstopped his pacing and looked about him.\n\nSandy jumped as if shot, so sudden was Dick's exclamation. \"Let's hear\nit,\" the young Scotch lad cried eagerly. Toma brightened.\n\nDick turned to Toma. \"Sandy or I would be glad to do this,\" he addressed\nthe young guide, \"but it's just about impossible for us. Can I depend on\nyour support, Toma?\"\n\n\"I do my best; what you say I do?\" Toma promised sincerely.\n\n\"My plan is this: when Govereau questions you, Toma, you are to express\na desire to join him--to turn against us. See? With you on the outside\nthere's much more chance of escaping than with all three of us in here.\nCan you do it, Toma?\"\n\n\"I try.\"\n\n\"Then I'll leave everything to you once you get outside. Of course,\nGovereau may get wise to what you are up to. But, again, he's no doubt\npretty anxious to get more men in his band.\"\n\nAs Dick concluded his instructions, there came a noise at the door, and\nthe bolt was shot back. A sharp, rat-like face, that of a half-breed,\nwas pushed in. \"You come,\" said the man, indicating Dick.\n\nDick and Sandy both realized that a crisis was at hand. If they revealed\ntheir real mission to Govereau they would without doubt never reach the\nmounted police. Perhaps they would not reach them anyway, yet there was\na good chance that Govereau might let them go if they convinced him of\ntheir ignorance of any of Henderson's business.\n\n\"Good luck, Dick,\" Sandy's voice was a little husky.\n\n\"Never mind, old boy, I'll make out,\" Dick cheered him.\n\nToma was visibly affected, and Dick reassured him also. Short as the\ntime had been that Toma had been with them, there seemed already a\nstrong bond of friendship between the young Indian and the two young\nadventurers.\n\nDick squared his shoulders and followed the rat-faced half-breed into\nthe other room. Dick now faced Pierre Govereau. The Frenchman was seated\nat a board table across from the door which just had been closed after\nDick. At one side of the room a huge fireplace roared and crackled. The\nrat-faced half-breed went over and squatted before the fire, picking up\na red-hot iron in a pair of tongs. Dick Kent shivered as he saw what the\nman was doing. But he met Govereau's eyes unflinchingly.\n\n\"What iss zee bizness you bean on when you make for zee Fort Dunwoody?\"\nGovereau came straight to the point.\n\n\"My friend and I are visiting in Canada,\" replied Dick cooly. \"The\nfactor at Fort du Lac was an old friend of my chum's father. I have a\ncousin in Fort Dunwoody that we wanted to call on before we went home.\"\n\n\"I zink you lie,\" growled Govereau. He sat silent for a moment, glaring\nat Dick as if he would hypnotize the young man with his snake-like eyes.\nBut Dick's gaze did not falter.\n\n\"Why you fear my men?\" Govereau's voice cracked like a whip.\n\nDick hesitated a moment. Sandy's uncle's welfare might depend upon his\nmisleading the villainous Govereau. \"We had been told there were bandits\nalong the trail to the fort,\" Dick replied in a clear voice.\n\n\"Haw!\" scoffed Henderson's lieutenant, and wheeled to the half-breed at\nthe fireplace. \"Napio, zee iron now. We make zee young upstart talk\nright.\"\n\nDick recoiled slightly as the Indian arose and came forward with a short\npiece of iron, red hot and smoking in the tongs. Govereau came out from\nbehind the table. Dick's hands were still tied behind him. The Frenchman\nseized Dick in an iron grasp and tore away his shirt front.\n\n\"You tell zee truth now,\" Govereau hissed. \"Queeck, Napio!\"\n\nThe iron was pushed close to Dick's naked breast. He could feel the heat\nof it already searing his skin.\n\nThen the door opened and the half-breed hesitated. Govereau turned,\nsnarling at the interruption. An Indian stood in the door.\n\n\"Men all go way,\" said the intruder. \"They drink firewater. M'sieu\nGovereau, you come bring them back.\"\n\n\"Throw him back in. We finish wiz him tonight,\" Govereau ordered the\nhalf-breed. \"Bring zee young white one. I come soon,\" he waved away the\nIndian at the door.\n\nDick reeled into Sandy's arms a minute later as he was roughly pushed\ninto the back room. \"He'll call you next, Sandy,\" Dick gasped a little\nweakly. \"If he asks you why you feared his men, say you thought they\nwere bandits.\"\n\nSandy pressed Dick's arm to signify he understood and followed the\nrat-faced half-breed out into the front room. Dick and Toma waited only\na few minutes before the door opened and Sandy was pushed in once more.\nGovereau had not attempted to torture Sandy. He seemed in a hurry to go\nafter his men. They could hear him cursing through even those thick, log\nwalls, for Sandy's story had tallied with Dick's.\n\nIt was Toma's turn next, and Dick talked earnestly with the guide as to\nthe method he was to use in convincing Govereau of his desires to be a\ntraitor to his white friends. Dick was now certain that Govereau would\nnot believe their story. Toma was their last chance.\n\nThey waited for some time before Toma was called. Then the half-breed\ncame again, and beckoned to the guide. In high suspense Dick and Sandy\nwatched him disappear through the door.\n\nIn a half hour they took courage. Toma had not come back. They waited an\nhour and still Toma was not thrown back among them. Their spirits rose.\nToma had then convinced Govereau of his sincerity.\n\nIt was growing dark now, and at any moment Dick expected Govereau to\ncall for him again. The Frenchman seemed to have a personal enmity for\nDick, perhaps because of the young man's refusal to be cowed by\nbrowbeating.\n\n\"What if Toma really does turn traitor?\" Sandy broke a long silence. \"I\nheard Uncle Walter say these Indians couldn't be trusted too far.\"\n\n\"I don't know why, but I trust Toma absolutely,\" Dick replied\nconfidently, \"that Indian is smarter than we think. If Govereau really\nis convinced that Toma is going in with him we'll soon be out of here.\nWhen I think what your uncle may be going through up there, I can't sit\nstill.\"\n\n\"Well, he couldn't get much worse than we have already,\" Sandy returned\ngrimly. \"Gee, I never thought we'd come to this when we left Fort du\nLac.\"\n\n\"I could stand it better if I wasn't so hungry and thirsty,\" Dick\ndeclared.\n\n\"You said it,\" Sandy heartily sanctioned. \"I guess they're going to\nstarve us too.\"\n\n\"Do you notice it's growing colder?\" Dick asked presently.\n\n\"I thought maybe it was because we didn't have any fire.\"\n\n\"I remember Toma said we were due for a blizzard,\" Dick recalled.\n\n\"Funny why Govereau doesn't call one of us out again,\" Sandy mused.\n\n\"He's after his men I expect. An Indian reported they were drinking\nwhile I was being questioned. The fellow saved me from being tortured.\"\n\nEngaging in a wandering conversation, Dick and Sandy whiled away two\nmore long hours, in which they managed to untie each other's wrists, and\nkept warm by walking back and forth and swinging their arms. They were\nalmost certain now that Govereau had gone. If so, then if Toma hadn't\nbeen forced to go with the Frenchman, he would be more able to help\nthem.\n\nIt was along toward morning when Dick started up out of a doze to hear\nthe sound of a blow and the muffled fall of a body in the front room.\nThere was a sharp stifled cry. Then Dick shook Sandy to wakefulness.\n\n\"What is it?\" whispered Sandy, leaping to his feet.\n\n\"S-s-sh,\" Dick cautioned.\n\nThrough the darkness in the room they could hear the heavy wooden bolt\non the door of their prison sliding backward.\n\n\n\n\n                               CHAPTER X\n                          TOMA AND A COLD SNAP\n\n\nWith bated breath Dick and Sandy awaited some sign of the identity of\nthe person who was entering so stealthily. Was it the scar faced Indian\ncoming for vengeance, or was it--the warmth from the other room was\nrushing in. It was Toma's voice that came to them.\n\n\"Quick! Come! Govereau gone long way.\"\n\nHearts leaping with joy, Dick and Sandy joined the young guide in the\ndarkness. He led them out into the larger room, picking his way with a\ncertainty that revealed he could see in the dark.\n\n\"Watch for one fella on floor. I hit him on head with rifle,\" Toma\nwhispered. \"Govereau's men all go to post ten miles south where they\ndrink fire-water. Govereau heap mad. Him after them. They come back\nanytime. He take me long with um. I run away. He know what I do now. You\nbet he know.\"\n\nToma swung open the cabin door, and Dick and Sandy followed him out. It\nwas so cold their teeth commenced chattering almost immediately. They\nbuttoned up their jackets and hurried off into the night.\n\n\"We'll make Fort Dunwoody yet,\" Dick shivered, almost gladly.\n\n\"I'll say we will,\" Sandy came back.\n\nThen they fell silent as they took Toma's tireless, jogging pace,\nbeneath a cloudy sky. Again the Indian's trail wisdom came in like a\nGod-send. Dick and Sandy did not know where they were going, but they\nhad a feeling that Toma certainly did.\n\nHow long they ran they did not know when they began to feel damp spots\non their cheeks and hands.\n\n\"It's snowing,\" Dick panted over his shoulder.\n\n\"I know it,\" wheezed Sandy.\n\n\"Ought to cover our trail,\" Dick came back.\n\n\"I guess so, but I can't talk. I've got to save my wind. You must be\nmade of iron.\"\n\nDick said no more, and presently Toma slowed down. It was snowing\nheavily now, and with the going getting harder underfoot, Dick and Sandy\nwere grateful for the slackening of the pace. Yet they sensed something\nunusual ahead had been the cause of it, and were not perfectly at ease\nby any means.\n\nFinally Toma came to a dead stop at the edge of a clearing. Peering\nahead through the gloom and the falling snow, they could see the lights\nof a cabin twinkling.\n\n\"You stay here; I go on,\" Toma instructed in a low voice. \"My brother\nlive here. Him give us warm clothes. I see if all right first. Wait for\nme.\"\n\nDick and Sandy hovered in the undergrowth and watched Toma's figure melt\naway into the gloom in the direction of the cabin.\n\n\"I hope he gets some clothes for us,\" Sandy chattered.\n\n\"And I'm glad Govereau didn't take my wallet,\" said Dick. \"We can pay\nfor what we get now.\"\n\n\"The Frenchman didn't think we had any money, I suppose,\" Sandy opined.\n\nThey fell silent then, for against the lighted window they could see a\nhead silhouetted through the falling snow. Toma was peering in at the\nwindow. For an instant the guide's head was outlined there, then it\ndisappeared. Presently a shaft of light shot out over the snow as the\ndoor opened and closed. A moment later the door opened again, though the\nboys could not see who entered.\n\nDick and Sandy expected Toma to come back for them almost immediately,\nor at least signal that all was right. But the minutes passed and the\nguide did not return nor make a sign. The boys began to worry.\n\n\"What do you suppose is keeping him?\" Dick wondered.\n\n\"I don't know,\" Sandy replied, \"but I do know I can't stand still in\nthis cold much longer.\"\n\n\"We'll circle around the cabin and come in closer,\" Dick directed. \"If\nsomething has happened we want to be sure we don't get into trouble,\ntoo. Toma's brother may have been killed by Henderson's men. The country\nseems to be alive with the villains.\"\n\nSilently they started around the cabin. Half way around, Dick stumbled\nand fell over something in the snow. Sandy stopped dead and a gasp of\nhorror came from his lips.\n\n\"Dick!\" he exclaimed. \"You've fallen over a dead man!\"\n\nDick got up, more shaken by the identity of the thing he had fallen over\nthan by the fall.\n\nCovered by the light film of snow that had fallen, and which was\nsteadily growing heavier, was the body of a man. In the gloom they could\nnot distinguish his features, but they were put on their guard. Armed\nonly with their hunting knives, they felt that the utmost caution must\nbe exercised in further advances.\n\n\"Toma's in trouble. I know it now!\" Dick ejaculated.\n\n\"Well, it's up to us to get him out,\" Sandy retorted.\n\nDrawing their knives they started stealthily for the cabin. They could\nhear no sound of life, and the knowledge of what was lying behind them\nunder the snow made the atmosphere doubly fearsome.\n\nAt last they reached the single window through which they had seen Toma\nlook into the cabin. Dick cautiously raised his eyes over the sill. He\nlooked only an instant, then he quickly ducked downward.\n\n\"It's the scar faced Indian!\" he made the astounding disclosure to\nSandy. \"And there's another with him. They have Toma bound. He's lying\non the bunk. I could see his eyes. They're playing cards and talking.\nHow in the world did they ever catch Toma?\"\n\n\"That Indian again,\" muttered Sandy. \"How the deuce did he get here\nanyway. We saw him last at Govereau's camp. It's ghostly the way that\nfellow shows up everywhere.\"\n\n\"Govereau must have sent him here on some dirty business,\" Dick decided.\n\"Perhaps Toma's brother had valuable furs stored here.\"\n\n\nWith mutual consent they crawled away from the cabin and hid in the\ntrees at the edge of the clearing, where they tried to decide on a plan\nby which to rescue Toma. That they had a good chance of success they\nwere sure. The scar-faced Indian had the use of but one arm since the\nwound Toma had given him, so they had but one real man to deal with.\nStill they were as well as unarmed. What could they do?\n\n\"I'll tell you what,\" Dick was speaking fast. \"You go out into the woods\nand begin calling for help, anything to get one of them out of the\ncabin. Then I'll slip in and see if I can't take care of the other one\nand get hold of a rifle. The Indian will probably stay inside, and\nwounded as he is I'm sure I can handle him.\"\n\n\"Gee! That's a ghostly job you have for me to do,\" Sandy whispered\nruefully.\n\n\"We've got to do it, Sandy,\" urged Dick. \"It won't hurt to try. You keep\nhidden, and when one of them comes out to see what's wrong, keep quiet.\nI'll do the rest.\"\n\nDick and Sandy gripped hands, then parted. Dick crept around to a point\nopposite the door of the cabin, waiting tensely until Sandy began his\npart of the ruse. He did not have to wait long. Presently, from afar in\nthe forest, a shriek as of some one in mortal agony, arose. Sandy was\ndoing well.\n\n\"H-e-l-p, oh, h-e-l-p,\" his voice rang out, high and shrill.\n\nSandy repeated his call several times, then the cabin door opened, and\nas Dick had hoped, the scar faced Indian's companion came out. He had a\nrifle in his hands.\n\nAgain Sandy's cry rang out from a little further off. The man hesitated\nno longer, but stepped from the cabin door and walked across the\nclearing into the trees to investigate. He disappeared in the direction\nof Sandy's unearthly wailing.\n\nDick ran forward across the clearing, his moccasins making no noise in\nthe snow. He remembered that the scar faced Indian had been sitting at\nthe table facing the window. Therefore, if he had not changed his\nposition, his back would be to the door.\n\nPausing before the door, Dick found it open a crack. Cautiously he\npushed it open a little more and peered in. The Indian still was sitting\nwith his back to the door. He was idly shuffling the cards. Against the\nbunk where Toma lay bound, Dick could see a rifle leaning. One leap\nacross the floor and he would have this rifle. It was a desperate\nchance, but he must make the best of it.\n\nSwift as a panther, Dick threw open the door and leaped in. The\nastonished Indian was scarcely half out of his chair when Dick had the\nrifle in his hands.\n\n\"Hands up!\" he cried.\n\nWhether the Indian understood English or not, Dick did not know, but his\nwords had the required effect. Slowly the scar-faced Indian turned his\nugly face upon his captor, his mouth twisted into an evil, smirking\ngrin. Dick stepped forward and drew the revolver from his captive's belt\nand tossed it into a corner. Then he backed toward the bunk with the\nrifle still trained on the Indian. Quickly, he drew his knife and\nslashed Toma's bonds.\n\n\"Ha! Now we got um!\" Toma tore the gag from his mouth, leaned up and\npicked up the revolver Dick had thrown away. In a trice, then, Toma had\nlashed the scar-faced Indian to his chair.\n\nDick already was expecting the return of the Indian's companion. With\nthe Indian secured, both Toma and he turned their attention to the door.\nWith bated breath they waited and listened for approaching footfalls.\n\n\n\n\n                               CHAPTER XI\n                               SLUSH ICE\n\n\nToma and Dick no longer could hear Sandy hallooing, and Dick judged that\nhis chum was safely in hiding. Yet, as they waited, guns trained on the\ndoor, a rifle shot shattered the silence. It came from the direction\ntaken by the man who had gone to investigate the calls for help. Dick's\nface paled. What did it mean? Had poor Sandy fallen? Had the man found\nhim?\n\n\"I'm going out,\" Dick said tensely to Toma a moment later.\n\nWhatever Toma's reply was Dick did not hear it, for with an impatient\nleap he flung open the door and disappeared. Toma remained behind, not\nsure that his young white friend's move had been wise, yet believing he\ncould do more to help if he stayed in the cabin.\n\nWhen Dick left the cabin he made straight for the point from which he\nthought the rifle shot had come. It was growing lighter. In the east a\nfaint gray fan of light showed over the forest--dawn. He ran on for a\nlittle way, then he came upon tracks. Pursuing these at a run, he came\nin sight of the man who had left the cabin an hour before. The meeting\nwas a surprise for both.\n\nDick dodged behind a tree as the other fired from his hip. The ball\nwhizzed harmlessly over Dick's head, and he shot hastily. His shot also\nwent wild, but the other took to his heels. Dick did not pursue him, but\nbegan calling for Sandy. Presently he was rewarded by a distant shout\nand in a few minutes the chums were reunited.\n\n\"Did he shoot at you?\" Dick queried anxiously.\n\n\"No, I don't know what he shot at. Maybe he thought it was me,\" Sandy\nreplied. \"I'm half frozen. Gosh, it seemed hours out here.\"\n\n\"Let's hurry back to the cabin,\" Dick hastened. \"Toma is there, and\nwe've captured the scar faced Indian.\"\n\nSandy was too cold to care how many Indians had been captured, and he\nhobbled along after Dick like a stiff, old man.\n\n\"I hope Toma is all right,\" Dick said anxiously as they neared the\ncabin.\n\nOn the threshold of the cabin they stood a moment later in stark\namazement. Toma lay bleeding and silent on the floor, and the scar faced\nIndian was gone!\n\n\"Well, if that doesn't beat anything!\" Dick ejaculated, rushing to Toma.\n\nThe young guide came to at the application of a little water. His head\nhad been struck with something; an overturned chair revealed what the\nescaped Indian had probably used.\n\n\"He slip out ropes some way,\" Toma explained when he could sit up once\nmore. \"I watch door when him jump on me. That all I know.\"\n\n\"I'm glad you're alive--that's all I can say,\" Dick said thankfully.\n\n\"Hello, what's this?\" Sandy hurried from the fireplace where he had been\nwarming himself to the crude wooden table. A slip of paper with writing\non it lay among the scattered playing cards. Dick also hastened forward\nand read the roughly scrawled words:\n\n  Pierre Govereau:\n\n  Send Many-Scar Jackson and Swede to Big John Toma's cabin. We want the\n  black fox fur he has hidden there.\n\n                                                         BEAR HENDERSON.\n\nDick and Sandy read it aloud to Toma.\n\n\"This my big brother's cabin,\" Toma explained simply. \"Last night I see\nno one when look in window. I go in. That Many-Scar and other fella come\nin, ketch me. I not know where Big John is. They not find um black fox.\nBig John sell um black fox t'ree weeks go by.\"\n\nDick and Sandy dropped their eyes. They now felt sure who the man was\nthat Dick had fallen over--the dead man. How could they tell Toma? At\nlast Dick took the guide's arm. Silently they went out, Sandy following.\n\nToma showed no emotion as they showed him the body partly covered with\nsnow. He might have been a wooden image as he said quietly:\n\n\"Him Big John Toma; I know before I see. I feel he dead. That\nMany-Scar----\" something choked off his voice. His dark eyes suddenly\nflashed and glowed like coals of fire.\n\n\"I wouldn't give ten cents for Many-Scar's life, slick as that Indian\nis,\" Sandy whispered.\n\nDick nodded.\n\nThough all felt they had no time to lose, since Govereau's men might be\nexpected to follow them, they could not leave Toma's brother without\nburial.\n\nAll three set to work under the spruce trees, hacking through the frozen\nsoil with axes. In a half hour they had dug a shallow grave. Wrapped in\nblankets, they gently lowered the body of Big John Toma to its last\nresting place.\n\nDick fashioned a rude cross from two saplings, which he showed to Toma.\nThe young Indian nodded. \"Good; him Christian--me too,\" said the guide.\n\nWhen they had placed the last sod on the mound, Dick and Sandy left\ntheir friend alone by the grave and went to the cabin to prepare for\ncontinuing their journey. They found much pemmican and dried fish, upon\nwhich Big John Toma had existed, but nowhere any flour or coffee. By the\ntime they had arranged shoulder packs and had donned whatever warm\nclothes they had found, Toma had joined them. He seemed his old self\nonce more, though Dick and Sandy knew that behind his mask of\nindifference was deep sorrow and a mighty resolve for the redskin's\nrevenge upon the murderer of his brother. The guide refused to take the\nmoney Dick offered him for the food and clothing they had taken from Big\nJohn's cabin.\n\n\"We three days from Fort Dunwoody now,\" Toma told them when they were\nready for the trail. \"Not sure we make um three days. Big blizzard come\npretty soon now. Mebbe tomorrow. We get um dog sled then. Need um bad.\"\n\nAll that day Toma led them due southeast, across higher ground, where\nvegetation was sparse. They crossed one shallow valley where there were\nno trees at all, and upon a ridge at the other side made camp. It was an\nadvantageous spot from which to watch the back trail, and before they\nstarted on they were disturbed by the sight of three tiny figures. The\nmen were undoubtedly on their trail. Straight across the valley they\ntoiled and they were coming fast.\n\n\"I'll bet it's Govereau!\" Dick exclaimed in alarm.\n\n\"Yes, and it looks as if we were only about three miles ahead of him,\"\nSandy declared. \"Let's get a move on. I don't want to get mixed up with\nhim again.\"\n\n\"Neither do I,\" Dick heartily agreed.\n\nToma was of the same mind, and they all set off at a fast pace when once\nmore they took to the trail. They felt confident they could lengthen the\nlead on their pursuers, but two hours after noon, when they paused to\nrest on a high ridge, they looked back and were astounded to see the\nthree men not more than a mile behind them.\n\n\"Them best trail men Govereau got,\" Toma protected his own prowess on\nfinding that he had been outpaced.\n\nThey started on again, doubling their former speed. A half hour more\nbrought them to the banks of a river.\n\n\"Him Saskatoon River,\" Toma told them. \"Him full slush ice. We make um\nraft in hurry; get over, then we safe from Govereau.\"\n\nDick and Sandy looked off across the sullen expanse of the Saskatoon. As\nToma had said, it was filled with a slow-moving mass of slush, formed by\nnight freezes and day thaws.\n\nThey fell to work like Trojans on a raft, lashing dead logs together\nwith tiny saplings and tough vines. It was a cumbersome raft that they\nat last shoved out into the icy stream. With poles to propel the\nunwieldy craft, they began the perilous trip across the river. The delay\ncaused by the building of the raft had given their pursuers time to\novertake them, and at any moment they expected to hear a shout or rifle\nshots from the shore they were slowly leaving behind.\n\nOne side of the raft was heavier than the other, and out in the current\nthey came near being spilled off, before they followed Toma's example\nand balanced the logs by shifting their weight from side to side.\n\nPushing on desperately, they reached midstream, when their pursuers\nreached the river. But the few shots that were fired fell short. The\nboys had poled the raft out of range. Waving their hands to the\nchagrined men they reached the other shore and, abandoning their raft,\nhastened on.\n\nOnce more snow was spitting out of the gray heavens, and it was growing\nsteadily colder. They hiked for three miles, then Toma advised a halt\nThe guide began immediately throwing up a shelter of boughs. Dick and\nSandy helped with a will, and they finished none too soon. With the fall\nof night the blizzard Toma had prophesied swept down upon them like a\nthousand, shrieking demons.\n\n\n\n\n                              CHAPTER XII\n                              THE BLIZZARD\n\n\nWhen the boys awoke on the following morning, numb and stiff from cold\nin spite of the protection of their crudely constructed shelter, a full\nsix inches of snow covered the surface of their blankets.\n\n\"Snow make um much warmer to sleep,\" Toma explained to them, as he\ncrawled out of his bed, very much as a husky gets out of a snowdrift.\n\nDick turned his eyes towards the open door of the shelter and shivered.\nContrary to his expectations the storm had not abated during the night.\nA shining, white wall of snow almost shut out any view of their camp\nsurroundings, while the wind continued to howl furiously.\n\nTo all appearances, the boys were shut in by the high, white walls of a\nsnow prison. Snow sifted in the door of their shelter and through the\nnumerous cracks in the walls.\n\n\"I'm not crazy about getting up,\" Sandy observed, with a seriousness\nthat brought a laugh from Dick and Toma. \"Anyhow, nobody can get\nanywhere in a storm like this.\"\n\n\"The wind, she blow from northwest,\" Toma cut in. \"No get lost when wind\nblow hard like that. Keep wind on left side. No like--but better than\nstay here.\"\n\nThe young guide counted slowly on his fingers, and went on:\n\n\"Me know place where young Indian live. Him called Raoul Testawich. Got\num cabin nice and warm, an' mebbe we ketch um good dog team there.\"\n\n\"Fine!\" exclaimed Dick, \"we'll make a try for it. Sure you won't get\nlost?\"\n\nToma shook his head.\n\n\"No,\" said the guide, with assurance. \"I find way all right. Best thing\nwe go.\"\n\nSomewhere in the back of Dick's mind there was some doubt as to the\nadvisability of facing such a storm, yet he had implicit faith in the\nprowess of Toma, and he did not question the young Indian's ability.\n\n\"It'll be great to get near a warm fireplace again,\" said Dick. \"What do\nyou say, Sandy?\"\n\nSandy's answer was to spring up out of his blankets and commence\nimmediate preparations for breakfast. A fire was started with\nconsiderable difficulty, and less than an hour later the three boys were\non the trail again, walking Indian file with Toma in the lead.\n\nBut the storm was worse even than they had anticipated. It was fury\nunleashed, it sucked the very breath out of their mouths and blew\nthrough their mackinaws as if they had been cheesecloth. Dick imagined\nthat the weight of the snow-laden air alone was sufficient to prevent\nany long continued trek across that blinding field of white.\n\nTaking turns breaking trail, they proceeded at a slow pace, puffing with\nexertion. And always they kept the wind on their left, Toma calling out\nencouragement from time to time to keep up the spirits of his\nless-hardened and less-experienced comrades.\n\nMoisture froze on their coat collars, formed by the warmth of their\nbreath against the freezing wind. Breathing became more and more\ndifficult, and Sandy, the weaker physically of the three, began to\ncomplain of aching muscles and finally stopped short, panting heavily.\n\n\"I'm tired out,\" he gasped, \"----all in. Dick, I don't believe I can go\na step further. Can't we sit down and rest?\"\n\nDick was on the point of acceding to Sandy's request, when Toma, several\npaces in the lead, came back, crying out his disapproval.\n\n\"No! No!\" shouted the guide above the howling of the wind. \"No do that;\nget um legs all stiffened up. Bye an' bye can't move. Mebbe we better go\nslower, but no sit down.\"\n\n\"I'll try to go on,\" declared Sandy bravely, \"but you fellows better\nstop now and then to give me a chance to breathe. I tell you I'm all\nin.\"\n\nAnd so they went on, bracing themselves against the fury of the wind,\nshuffling forward through mounting drifts, in places piled waist high,\nas if to block their progress. On several occasions, so violent was the\nstorm that it was impossible to see anything. Once, fighting their way\nthrough a smothering fog of white, Toma shouted out a warning.\n\nThey were traveling down a sharp incline at the time, attempting to\nreach a river bottom, where towering cliffs would protect them somewhat\nfrom the force of the wind. Toma shouted to them. His keen ears had\ndetected a sound other than that made by the blizzard. It was a\ndifferent sound, and he had heard it before--a queer rumbling, followed\nby a mighty roar.\n\nWith a quickness born of desperation, the guide seized Dick and Sandy by\nthe arms and pulled them out of the path of an almost certain death.\n\nAs the boys stood trembling and appalled at the deafening tumult about\nthem, what seemed at first a vast mountain of snow, went shooting past,\ncarrying everything before it. The snowslide left in its wake nothing\nbut a wide belt of barren ground--even huge rocks had been torn away\nfrom the earth and hurtled on into the storm.\n\n\"That was close enough to suit me,\" declared Sandy in a tragic whisper,\nas the boys continued their descent. \"I've never seen a snowslide\nbefore, and I don't wish to see another one. Do you feel shaky, Dick?\"\n\n\"Yes, I do,\" admitted Dick, his cheeks slightly pale. \"I thought the\nentire upper part of the valley wall was falling in on us.\" He turned to\nToma. \"Do you suppose,\" he inquired, \"that it'll be safe to go down?\"\n\nThe Indian lad shook his head thoughtfully.\n\n\"Me no can tell. Mebbe more snowslide after while. We take\nchance--that's all.\"\n\nDick and Sandy hesitated.\n\n\"Perhaps we'd better not go down to the river,\" said Dick. \"It may be a\nwiser plan to keep up above, where there isn't the danger from these\navalanches. No use to risk our lives needlessly,\" he pointed out.\n\nTheir guide grunted something under his breath, then looked up, his\nsober, dark eyes twinkling.\n\n\"Snowslide catch us in the valley,\" he pronounced. \"Big blizzard catch\nus on top. Which way you like die best?\"\n\nAt any other time the two boys would have seen the humor in the\nsituation, but at that particular moment neither Sandy nor Dick felt\nthat there was anything funny about it. For a brief interval they stood,\ndeep in thought, their two youthful faces clouded with apprehension.\n\n\"It makes no difference to me which way I die,\" declared Sandy at\nlength, kicking disconsolately at the trunk of a small tree, which had\nbeen uprooted by the force of the snowslide. \"We're more than half way\ndown to the river now, so what's the use of turning back. My choice is\nthe valley. At least, we can travel faster down there, with more\nprotection from the storm.\"\n\n\"You're right,\" agreed Dick, \"I choose the valley, too. Do you think we\ncan reach your friend Raoul's place before dark?\"\n\n\"Best we can do it take three hours from here,\" replied Toma, \"an' night\ncome early. One hour more mebbe an' then we no see at all. Dark all\n'round. Travel very slow then. Raoul him live on top of river bank ten,\nfifteen miles from here.\"\n\nWithout further word, the three boys made their way quickly down to the\nfloor of the valley and proceeded on their way. Beneath their feet was\nthe frozen course of the Bad Heart River, winding forth through a white\nworld of weird, irregular cliffs, now deeply mantled with snow.\n\n\"This is better,\" Sandy growled, looking up to where the storm broke\nabove their heads. \"I never would have thought it would make so much\ndifference being down here. You can actually see a little and hardly\nfeel the wind at all.\"\n\n\"Fine!\" answered Dick. \"But save your breath, Sandy. You'll need it.\"\n\nMonotonously, heavily, the moccasined feet of the three snow-covered\nfigures crunched along the unbroken trail. In the lead, Toma glided\nahead with an untiring energy that filled Dick with admiration. He\nwondered what the young half-breed was thinking about. Was he, too,\nsecretly fearful of some new impending danger lurking in their path?\n\nHe noticed presently that the shadows, flung across the floor of the\nvalley, were gradually becoming darker and darker, a heavy dusk had\nsettled around them. Toma, barely four feet away, was a vague,\nindistinct blur, completely shutting off his view of the trail in front\nof him.\n\nThat the fury of the blizzard had not abated, was easily apparent. He\ncould still hear the wind howling above their heads, and feel the snow\nas it sifted quietly down. At every step his feet sunk into the soft,\nyielding surface, and his heart pounded like a trip-hammer from the\ncontinuous, never-ending exertion.\n\n\"How much farther?\" Sandy demanded, a note of despair in his voice. \"How\nmuch farther, Toma?\"\n\n\"No can tell.\"\n\nSandy mumbled and complained to himself. He came stumbling and panting\nbehind Dick, keeping up an incessant babbling or muttering that filled\nhis friend with alarm.\n\n\"How much farther?\" he asked again.\n\nToma grunted.\n\n\"No can tell.\"\n\nA snort of fury seized upon Sandy. With a strangled, despairing cry, he\nsprang forward past Dick and seized Toma by the shoulder.\n\n\"Listen to me you, you--Indian. I've got a right to know how far we've\ngone. Come on, now--out with it!\"\n\nToma turned as if to brush off the detaining hand, when Sandy struck out\nwith all the force of his right arm. It was an unexpected blow which\nsent the young Indian guide staggering to his knees. Aghast, scarcely\nbelieving his senses, Dick stood in bewilderment for a moment unable to\nmove. With incredible speed, his companion had sprung forward again, his\nfumbling, eager hands encircling Toma's throat.\n\n\"Stop it!\" shrieked Dick.\n\nA shrill, unearthly shout, terrible in that utter desolation, seemed to\nfreeze Dick's blood. Toma and Sandy were at grips, struggling,\nrolling--a dark, almost indistinguishable ball against the gray\nbackground of billowing drifts.\n\n\"Stop it!\" roared Dick again, and, jumping in, endeavored to separate\nthem. He was still somewhat dazed over the sudden, unexpected turn\nevents had taken. What had happened to Sandy? What was the meaning of\nthat unwarranted attack upon the kindly young Indian guide? Had the\nhardship and severe nervous strain of the past few days, proved too much\nfor his friend? Desperately he tugged and pulled at the two combatants,\nfinally breathing a sigh of thankfulness as Toma rolled on top,\nsuccessfully pinning the arms of his assailant.\n\n\"Fight all gone,\" declared the victor between gasps of exhaustion,\nraising one hand to wipe away the blood trickling from a cut over his\nleft eye. \"Hm, poor fellow go sleep bye an bye. Trail too much. Worry\ntoo much. All make him mad like grizzly caught in trap, an' fight like\ngrizzly till strength all gone.\"\n\nToma arose, brushing the snow from his clothing, then placed a still\ntrembling hand on Dick's arm.\n\n\"Him lay there all night--huh?\" he inquired. \"What you think we do next?\nWhat you think?\"\n\nDisconsolately, Dick gazed out into the black pall of darkness which had\ngathered around them.\n\n\"Toma,\" he inquired presently, \"do you believe Sandy will feel better\nafter a while? Will he be able to get up and walk again?\"\n\n\"Him walk no more tonight,\" stated Toma with conviction.\n\n\"In that case, there's only one thing to do. I'll camp here with Sandy\nwhile you go on to your friend's house for help. Do you think you can\nmake it, Toma?\"\n\n\"You start 'em fire here,\" instructed the Indian. \"Me make it all right.\nGet back two, three hours, mebbe, with dog team and take poor Sandy to\nwarm bed. Please no worry if I be little late.\"\n\n\"No,\" answered Dick, gulping down a hard substance in his throat.\n\"Good-bye and good luck to you, Toma. I'll be here when you return.\"\n\nNot a suspicious moisture, but real tears were standing in Dick's eyes a\nfew minutes later as he and the young half-breed separated over the\nrecumbent body of Sandy. A single, warm hand-clasp, then Toma was away,\nhis footfalls sounding faintly through the dark.\n\n\n\n\n                              CHAPTER XIII\n                           DICK SEES A GHOST\n\n\nSeveral hours had passed since Toma's departure, and the fire Dick had\nkindled had burned down to a mass of glowing, red embers. The still\nfalling snow hissed and sputtered over the coals. Off in the distance a\nfew wolves howled. Sandy lay stretched out at Dick's feet and the owner\nof the feet himself drowsed and nodded in a futile effort to keep awake.\n\nHe recovered consciousness a few moments later, however, when a\nhalf-burned stick, lying on the outer edge of the fire, crackled forth\nsuddenly like a cap in a toy pistol. In an instant he was wide-eyed and\nalert, his eyes straining towards the outer rim of darkness. He could\nsee nothing.\n\n\"Dreaming again,\" he grumbled to himself, looking down at Sandy, and\nwondering how much time had elapsed since the young Indian guide had set\nout on his perilous journey through the storm. Then his thoughts turned\nto the happenings of the day.\n\nOne thing that bothered Dick, and which he had not yet explained\nentirely to his own satisfaction, was Sandy's strange behavior a few\nhours previous. The young Scotchman's violent and unwarranted attack\nupon Toma was not in the least like the usual happy-go-lucky conduct\nthat Dick had ascribed to his friend. Of course, he had heard many times\nbefore, of similar cases where men, driven to the limit of physical\nexertion, had acted queerly. It was a sort of temporary mental breakdown\npreceding physical collapse. What Sandy needed was a good sleep,\nfollowed by a day or two of complete rest. He'd probably feel better in\nthe morning.\n\nFor the next few minutes Dick busied himself in gathering more wood for\nthe fire. His first duty was to keep himself and Sandy warm, as warm as\npossible in their hastily improvised camp there in the inadequate\nshelter of the river bottom.\n\n\"Toma will be back in an hour or two,\" he thought to himself, \"and then\neverything will be all right.\"\n\nHe looked down at Sandy, whom he had bundled up in their two blankets\nand hoped devoutly that nothing had happened which might delay the young\nIndian's safe return. Although not in the least doubting the guide's\nprowess, Dick had learned to his sorrow that Govereau's opposition was\nnot the only factor to be considered in the successful carrying out of\ntheir plans.\n\n\"There is always this blamed wilderness to contend with,\" ruminated\nDick. \"Treacherous rivers, forest fires, wild beasts, the danger of\nfreezing to death in the extreme cold or getting lost in a blizzard.\nSometimes I think----\"\n\nExactly what Dick thought will probably never be recorded. He woke\nsuddenly from his preoccupation, a look of fear in his eyes, every nerve\ntingling as if tiny electric wires ran close to the surface of his skin.\nA slight sound somewhere out there in the enveloping darkness had caught\nhis attention. In addition, there had quickly come over him a vague\nfeeling that he and Sandy were not alone, that an actual presence,\neither an animal of some sort or a human being, had intruded within the\ncircle of their campfire and was ready to pounce down upon them.\n\nFor a brief second Dick could scarcely suppress the cry of terror that\nhad sprung to his lips. He wanted to turn his head to look at the thing\nhe knew to be immediately behind him, but, for some unknown reason, his\nbody seemed incapable of action. Instead he sat there, weak and\ntrembling, the blood pounding in his throat with a force almost\nsuffocating.\n\nWith a truly mighty effort he contrived finally to twist and squirm\naround so that his gaze could discern the thing that menaced him, and in\nthat instant he caught wildly at the trunk of the up-rooted tree upon\nwhich he sat, so frozen with horror, that the person who stood\nimmediately opposite--probably no more than ten or twelve feet\naway--might easily have advanced and overpowered him without\nencountering even the slightest resistance.\n\nIn all his life, Dick had never seen so strange an apparition. His first\nsickening impression was that he was confronted not by a man at all but\nby a real ghost, fashioned out of a substance as hard and unyielding as\na block of ice. In the glare of the campfire, the person's body gave\nforth a peculiar gleam or sparkle that so amazed and confounded Dick\nthat he found himself putting up his hands to his eyes in an effort to\nshut out the unusual sight.\n\n\"Toma, he tell me come,\" issued a friendly voice from the ghost-like\nfigure, standing there in front of him. \"You no 'fraid me.\"\n\nDick came to with a start.\n\n\"No,\" he mumbled weakly.\n\n\"Toma one mile down river,\" continued the voice. \"Him stuck in ice with\nhuskies. Mebbe no get sled out.\"\n\n\"What's that!\" demanded Dick. \"I don't think I understand you.\"\n\n\"Ice thin where river runs quick. Toma, me, drive on river too close to\nrapids. Hurry up get back here for sick fella. We go fast. Toma, me, sit\nin sled. All at once ice break. Toma, huskies, me, sled--everybody fall\nin river.\"\n\nDick sat and stared incredulously at the speaker. He understood now.\nThis was Raoul Testawich, Toma's friend, who, in his broken English, was\ntrying to describe what had taken place that night farther up the river.\nDick shivered at the thought of that unexpected, icy-cold plunge when\nthe sled with its two occupants had broken through into the river. No\nwonder that young Testawich looked like a ghost, his clothing a\nglistening ice and snow-covered mantle of white.\n\n\"Is Toma safe?\" he questioned eagerly.\n\n\"Yes,\" nodded the half-breed, \"Toma all right, but sled gone. Cut\nharness away from sled to save huskies. Toma stay back there now and\nwatch dogs. What you think; you, me take sick fella along that far?\"\n\n\"We can try,\" answered Dick in an awed voice. \"How far did you say it\nwas?\"\n\n\"About one mile,\" said Raoul.\n\n\"We can do it!\" Dick stated with conviction. \"I know we can--even if we\nare compelled to drag and carry him all the way.\"\n\nThere was admiration and wonder in Dick's eyes now as he looked at the\nice-clad form of the half-breed. What tremendous endurance Toma and this\nman must have. It seemed almost incredible.\n\nHe rose quickly, fired with new determination, walked over to the spot\nwhere Sandy lay and, as gently as possible, attempted to arouse him.\n\n\"Wake up! Wake up, Sandy!\" he called.\n\nSeveral minutes elapsed before Dick succeeded in dragging his friend to\nan upright position. Sandy swayed on his feet, mumbling incoherently,\nglaring about him with blood-shot, unseeing eyes. Supported by a\nfriendly arm on either side, he moved forward, almost a dead weight\nbetween them.\n\n\"We get there sooner you think,\" encouraged Raoul. \"Bye an' bye we turn\nbend in river an' then you see Toma's campfire. Little fella pretty\nsick.\"\n\nThey mushed on in silence. Step by step, slowly, at what seemed to Dick\na snail's pace, they plodded through the darkness towards the place\nwhere the courageous young half-breed guide awaited them. The snow had\nceased to fall. The roar of the storm above their heads had died down to\na faint murmuring. Presently Raoul spoke:\n\n\"I see light now. Pretty soon we get to campfire. Then dogs pull sick\nfella rest of way to my home.\"\n\n\"But we haven't any sled,\" interposed Dick.\n\n\"Toma tie poles together for sled by time we get there. Make 'em pole\nsled for sick fella.\"\n\nAgain they went on in silence. The light of Toma's campfire gradually\ngrew brighter as they advanced. Presently Dick discerned the lonely\nfigure of the Indian guide and after a time, five blotches in the snow,\nfive furry forms that snarled and howled as they waited impatiently for\nthe return of their master.\n\n\"We've made it!\" howled Dick, unable to suppress his exultation. \"We've\nmade it, Toma, old boy. Yip! Yip!\"\n\nToma's answering shout was drowned out by a deafening chorus from the\nhuskies.\n\n\n\n\n                              CHAPTER XIV\n                          AN UNWELCOME VISITOR\n\n\nThe cabin of Raoul Testawich, which stood in a sheltering grove of\nspruce a few miles back from Bad Heart river, loomed up through the\ndarkness several hours later as Toma, Raoul and Dick, with the team of\nhuskies in the lead, crossed a narrow coulee about thirty yards away\nfrom the house and plunged on through heavy drifts to the narrow,\ncleared space immediately in front of the door.\n\nWrapped in blankets, Sandy still lay on the hastily improvised sled. As\nhis three comrades gathered about him, a heavy door squeaked open and a\nsleepy voice, in Cree, called out a welcome. In an incredibly short time\nthey had lifted Sandy from the sled and had carried him within, gently\nplacing him in a bunk at one end of the room.\n\nA young Indian girl, whom Dick judged to be Raoul's wife or sister,\nclosed the door after them and advanced swiftly to the mud fireplace\nwhere, over crackling spruce logs, a heavy iron pot sent forth the\npleasant aroma of steaming moose meat. Close by, with growing interest\nand enthusiasm, Dick beheld a small table laden with food.\n\n\"We eat this time for sure,\" grinned Toma, nudging Dick's arm. \"Mebbe\nyou no want eat now.\"\n\n\"Like fun, I don't,\" laughed the other. \"There are two things I\nwant--food and sleep. I'm so blamed tired that Raoul will have to wait\nuntil sometime tomorrow before I buy his dog team. I believe I could\nsleep for three days.\"\n\n\"You sleep long you like,\" conceded Toma, as Raoul left the room to look\nafter the dogs. \"Him, Raoul, my very good friend. Fine fella. Like 'em\nsister, too. Mebbe some day marry girl.\"\n\nThe far away expression in the young half-breed's eyes drew a laugh from\nDick.\n\n\"I'm glad to hear that,\" he said, \"and I want to congratulate you. When\ndo you expect to get married?\"\n\n\"Four--five--six years,\" he answered, counting laboriously on his\nfingers. \"Father Girard he tell 'em me at mission too young yet. No\nmarry till get older. Get older very slow,\" he concluded, casting\nwoebegone eyes in the direction of the young lady of his choice.\n\nThe re-entrance of Raoul cut short any further reference to the subject\nof Toma's tender affair of the heart. It was well, too, for the face of\nthe owner of the huskies wore a look of concern as he strode forward and\ncommenced to remove his outer garments, still thickly encrusted with ice\nand snow. As he fumbled with the buttons of his moose-hide coat, he\nbroke forth excitedly in Cree, pausing now and again to make quick,\nexplanatory gestures with his hands.\n\n\"What's the trouble?\" demanded Dick, who though not understanding one\nword that had been spoken, could tell from the Indian's expression that\nsomething out of the ordinary had taken place. \"What did he say, Toma?\"\n\n\"He say,\" interrupted the guide, \"that he no like way huskies act.\nHuskies tired but no want to lie down and make bed in snowdrift. Huskies\nafraid of something, very much afraid.\"\n\n\"That not all,\" Toma continued as a relieved expression brightened\nDick's eyes. \"Raoul him not sure, but see track mebbe made by snowshoe.\nLook like snowshoe track only wind blow snow over it. Raoul think\nGovereau's men come here tonight and look for us. What you think? Mebbe\ncamped not far away.\"\n\nFor a brief moment, a look of apprehension, of fear, swept through Dick.\nThe supposition was not entirely impossible. Experience had taught him\nthat Govereau was both an experienced woodsman and an implacable enemy,\na man who had the disconcerting habit of putting in an appearance at\ntimes when one least expected him. On the other hand, Dick could not\nhelp but believe that the hated French half-breed had not yet succeeded\nin catching up with them. The incident at the river when he, Sandy and\nToma had crossed through the ice floe successfully, must have delayed\nhim considerably.\n\n\"I don't think he has had time to overtake us yet,\" said Dick. \"If any\none has been here today, it must be someone else.\"\n\nToma shook his head.\n\n\"Mebbe you right. I like think so. All same Govereau make you surprise\nonce in a while. Fool ever'body.\"\n\n\"That's true,\" rejoined Dick, \"but if Govereau really is here, he's here\nand that's an end to it. There's nothing that we can do except to fight\nhim and take our own risks. I think that you and Raoul had better get\ninto some dry clothes as quickly as possible. A good supper and a sound\nsleep afterwards are the first things to be considered. I wonder if I'd\nbetter wake Sandy?\"\n\n\"Him better sleep long time an' wake up himself. Him be all right then.\"\n\nDick heeded this advice from Toma and a few minutes later sat down to\none of the most enjoyable meals he had eaten in weeks. Then he and the\nyoung Indian guide tumbled into the bunk above Sandy and were almost\ninstantly fast asleep, their weary limbs stretching out in the luxurious\nsoftness of a white rabbit sleeping-bag.\n\nThey woke on the following afternoon and clambered down from their\nperch. To his amazement, Dick beheld Sandy, somewhat pale but otherwise\nquite his usual self, sitting at the table, opposite their host. He was\neating gruel from a bowl and conversing in low tones to Raoul.\n\n\"Why, Sandy!\" exclaimed Dick, unable to conceal his delight. \"What has\nhappened?\"\n\n\"What do you mean?\"\n\n\"You're up.\"\n\n\"Sure I'm up,\" the voice of the young Scotchman rose in jovial good\nhumor as he glanced across at his two friends, who were dressing\nhurriedly. \"Didn't expect me to lie in bed all night and all day too,\ndid you?\"\n\n\"Yes, but how do you feel?\"\n\nSandy put down his spoon and swung round to meet Dick's inquiring gaze.\n\n\"A little shaky, I guess, but otherwise about the same as usual. By the\nway, Dick, what happened yesterday? When I woke up this morning, I\ncouldn't imagine where I was. And funny thing--I can't remember very\nmuch of what took place on the trail. Did I get hurt?\"\n\n\"Didn't Raoul tell you?\"\n\n\"Not yet.\"\n\nDick picked up his moccasins and began absently to turn them in his\nhands. For Sandy's benefit, it had occurred to him to gloss over the\nevents of the previous day, to give his friend as little information as\npossible. It was not that Sandy's breakdown was anything to be ashamed\nof, considering what he had been through. It was not that, Dick told\nhimself. It was the possible effect the news might have on him. For\nSandy was proud, and the knowledge of even a temporary weakness on his\npart would be sure to cause him a good deal of humiliation.\n\n\"You played out on the trail, Sandy,\" Dick stated evenly. \"I was all in\nmyself. I hope we never again have so many obstacles and difficulties to\ncontend with. I can't imagine what would have happened to us if Toma\nhadn't gone for help. We have Toma and Raoul to thank for getting\nthrough safely yesterday.\"\n\n\"Toma is always doing remarkable things,\" said Sandy. \"I can't help but\nadmire the way he broke trail through that storm. Wish I had half his\nendurance.\"\n\n\"You no talk about me so much,\" Toma broke forth, pretending to be\nangry, but grinning in spite of himself. \"Me no like 'em all big words.\nMebbe make fun of me.\"\n\n\"You hurry up dress,\" interposed Raoul. \"My sister wait in next room to\nbring something to eat. Pretty soon we have breakfast middle of the\nnight.\"\n\n\"All right,\" laughed Dick, \"we'll hurry. I'll be ready as soon as I put\non these moccasins.\"\n\nHe was looking at Raoul as he spoke, but was hardly prepared for what\nsuddenly ensued. The young Indian was abruptly on his feet and had\ndashed forward to one side of the room, where he caught up a rifle,\nwhich had been leaning there against the wall. Amazed at first, Dick\nquickly caught the significance of Raoul's actions, as there came to his\nears the dull tromping of feet outside, followed quickly by a loud\nthumping at the door. A moment later, a towering, heavy form broke into\nthe room and stood blinking across at them.\n\n\"What you want!\" demanded Raoul, flourishing his rifle.\n\nThe intruder closed the door behind him, his shifting eyes regarding\neach of them in turn. He was a big man, clothed almost entirely in fur,\na parka concealing the lower part of his face. As the four other\noccupants of the room stood or sat watching him, he shook off his heavy\nmitts, kicked the snow from his feet and removed his parka. His general\nappearance, Dick observed, was far from prepossessing.\n\n\"What you want!\" repeated Raoul.\n\n\"You don't need to be afeered o' me,\" finally grumbled their unexpected\nguest, rubbing one burly hand against his bearded cheek. \"Put down yer\ngun, brother, I ain't gonna hurt nobody. I jes' came in to get warm an'\nask fer something to eat. Been hoofing it all the way from Twin Brothers\nCreek, near the Big Smokey. Left there this morning. Stranger in these\nparts. My name's Bill Watson. Guess you don't know me.\"\n\nDick was conscious of a feeling of relief to learn something of the\nintruder's identity. At least, he was not one of Govereau's men. Then\nDick felt Toma's face brushing close to his own.\n\n\"No like him,\" breathed the guide in a scarcely audible whisper.\n\"Ever'body watch out. See him one time before with Govereau. He come to\nfind out if you and Sandy here.\"\n\nToma drew back quickly as the stranger's gaze turned again in their\ndirection.\n\n\n\n\n                               CHAPTER XV\n                          OUTWITTING THE ENEMY\n\n\nDick Kent had no reason to doubt that Toma's stealthily imparted\ninformation concerning the true identity of Bill Watson was correct. The\nman had been sent by Govereau. His story of the long trek from Twin\nBrothers Creek was a deliberate falsehood intended to deceive Dick and\nhis friends. He was here as a spy to carry out certain instructions from\nGovereau, the accomplishment of which would probably result disastrously\nto their expedition.\n\nIn a few minutes following Toma's whispered warning, Dick thought\nswiftly. Their safety and the success of their plans depended upon\nimmediate action. Something had to be done before Watson became aware\nthat anyone suspected him.\n\nThe first step, of course, was to discover some way to acquaint Sandy\nand Raoul with the stranger's duplicity. This, of course, must be\naccomplished secretly, and in a manner that would not arouse Watson's\nslightest suspicion.\n\n\"If only on some pretext I could get the two of them outside,\" thought\nDick, \"the rest would be easy. Four of us would have no difficulty in\ntaking him prisoner. We would bind him hand and foot and then Raoul\ncould keep him here several days while Sandy, Toma and I continued our\njourney with the dog team.\"\n\nAnnette entered from the adjoining room at Raoul's summons and began\nremoving the dishes from the table, in preparation for the meal for\nWatson, Toma and Dick. Watson now occupied a chair at one side of the\nroom, and sat directly facing Sandy. Raoul had moved forward and was\nassisting his sister with her task, while Toma, like a restless spirit,\nremained unseated, occasionally changing his position from sheer\nnervousness.\n\n\"I ain't had very much to eat today,\" Watson informed them, producing an\nevil-smelling pipe and lighting it with the stub of a match. \"Been too\nbusy mushing to think about it. Trail heavy all the way, too.\"\n\nA strained silence followed. It was evident that Watson intended to make\nhimself perfectly at home, for, a moment later, he stretched out his\nburly legs, and, to Dick's disgust, spat on the floor.\n\n\"Where you fellows bound for?\" he demanded suddenly of Sandy.\n\n\"Nowhere in particular,\" replied the young Scotchman non-committally.\n\"Where are you going?\"\n\nWatson's face darkened with a scowl.\n\n\"I ain't a goin' to tell neither if that's the way you feel about it.\nGuess you never was taught no manners, young man.\"\n\nSandy turned his head slightly and winked covertly at Dick.\n\n\"No offense intended, I'm sure.\"\n\nThe man from Govereau's camp grunted something under his breath.\n\n\"Little boys ain't got no business on the trail anyway,\" he began again,\nthis time in a scoffing tone that caused an angry red to mount suddenly\nin Sandy's cheeks.\n\nIn his restless moving about, changing positions often, Toma had\npresently come to a pause close to Sandy and now stood absently tossing\na small object in his hand, his gaze directed toward Annette and Raoul,\nwho were completing preparations for supper. Looking at him, no one\nwould have suspected that any thought, out of the ordinary, lay at the\nback of the young half-breed's mind. His face was expressionless, yet as\nDick watched him, there flashed from them unexpectedly a look that could\nnot be mistaken.\n\nIt was as if Toma had sent him some sort of a signal. What was its\nmeaning Dick could not possibly imagine until, apparently by accident,\nthe small object, which looked like a brass buckle, fell from the\nguide's hand and rolled under Sandy's chair. As he stepped forward and\nstooped to get it, Dick knew from the expression on Sandy's face that\nhe, too, had been warned.\n\n\"Supper all ready,\" Raoul announced.\n\nWatson bounded to his feet and was the first to reach the table. Without\nwaiting for further permission he pulled out a chair and slumped into\nit. Dick followed more leisurely, with Toma bringing up the rear. As\nthey approached directly behind Watson's chair, Toma's hand shot out,\npoking Dick in the ribs. Half-turning, the recipient of the blow emitted\na startled gasp as he perceived Toma's long arms steal out and encircle\nthe unsuspecting guest.\n\nWatson and the chair swayed backward, then toppled over, striking the\nfloor with a resounding crash. The heavy, powerful form rolled to one\nside, endeavoring to break the iron grip of the young half-breed. For a\ntense second Dick stood inactive, then leaped to his friend's\nassistance. Attempting to pinion Watson's arms, to his horror Dick saw\ntheir opponent had actually succeeded in pulling a dangerous looking\nautomatic from his pocket and was grimly endeavoring to use it.\n\nDick seized Watson's wrist in his two hands, putting forth his last\nounce of strength in an effort to force the gun from the man's grasp. In\nquick succession three ear-splitting reports rang out. Annette screamed.\nAfter that Dick was not quite sure what was taking place during that\nconfused wild scramble on the floor until he felt the heavy body under\nhim relax and a voice triumphantly proclaim:\n\n\"Well, I guess that ought to settle him for a while.\"\n\nWith perspiration trickling down into his eyes, Dick looked up. Raoul\nstood with a small stick of wood in his hands and close beside him\nSandy, a look of triumph on his face, each surveying their now helpless\nfoe.\n\n\"You didn't hit him half hard enough, Raoul,\" Sandy protested. \"It was a\ngood thing for him that I didn't have that club, myself. I might have\nkilled him.\"\n\n\"Hit 'em plenty hard,\" Raoul confessed, tossing the stick back toward\nthe fireplace. \"Tie him up easy now. I go get rope.\"\n\nDick and Toma rose to their feet and a moment later Raoul returned with\na rope. Bound hand and foot, Watson was lifted bodily and carried across\nthe room, where he was deposited not unkindly in the selfsame bunk\noccupied by Sandy on the previous night. Dick breathed a sigh of relief.\n\n\"I'm glad that's over with,\" he declared thankfully. \"All things\nconsidered, we've been pretty lucky so far. We've beaten Govereau at\nevery turn.\"\n\n\"Beaten but not licked,\" Sandy reminded him. \"I'll have to admit right\nhere that he's a mighty tough customer. It's a good thing Toma saw this\nman, Watson, before. Otherwise things might have turned out\ndifferently.\"\n\n\"We must get an early start in the morning,\" said Dick, as he moved back\ntoward the supper table. \"I'd hate to meet any more visitors from\nGovereau's camp. If Raoul is willing, I'll pay him tonight for the team\nof huskies. What do you think would be a fair price for them, Toma?\"\n\n\"Raoul say he willing to sell for two hundred dollars,\" answered the\nguide. \"That very cheap for good team like that.\"\n\n\"I'll make it two hundred and fifty. The additional amount wouldn't\nbegin to pay him for all the kindness he has shown us.\"\n\nAs he spoke, Dick reached in his pocket and pulled out the roll of bills\nFactor MacLean had given him on the day of their departure from Fort du\nLac, and, counting out the sum mentioned, passed it over to Raoul.\n\n\"I hope I'm not cheating you.\"\n\n\"You buy best dog team in the country,\" Toma stated enthusiastically.\n\"Mounted police use 'em last winter to carry mail. Govereau go fast to\ncatch us now.\"\n\n\"How long will it take us to reach mounted police headquarters?\"\ninquired Sandy.\n\n\"Three, four day if nothing happen,\" their guide answered. \"First day\nsnow too heavy to make trail good. After that mebbe get better.\"\n\nA short time later, a low groan from Watson attested to the fact that\nthat gentleman was slowly regaining consciousness. After considerable\ntossing and rolling about, their captive finally opened his eyes and\npresently called for a drink of water.\n\n\"Feeling better now?\" Dick inquired solicitously, when he complied with\nthe request.\n\n\"Yeah, I'm feeling better,\" came Watson's smothered retort as he glared\nup angrily at his questioner. \"I'm feelin' a blamed sight better than\nyou'll be feelin' in another day or two, I can tell you that.\"\n\n\"You brought it all on yourself,\" Dick reminded him. \"You had no\nbusiness coming here to play the part of a spy, in the first place. If\nyou got hurt, it's your own fault. All I'm sorry about is that the\nunpleasant little blow you received on top of your head wasn't given to\nthe man who sent you.\"\n\n\"What do you mean?\" bluffed Watson.\n\n\"I guess you know what I mean,\" Dick spoke coldly, \"and please get the\nidea out of your mind that we don't know who you are, and where you came\nfrom.\"\n\n\"Where did I come from?\" their prisoner blustered.\n\n\"From Govereau.\"\n\n\"Well, what are you gonna do about it?\"\n\nThere was defiance in Watson's voice.\n\n\"If you mean, what are we going to do with you,\" Dick answered, \"I might\nas well tell you that we haven't decided yet. A good deal depends upon\nthe way you behave yourself.\"\n\n\"We're thinking seriously of taking you outside and putting a bullet in\nyou,\" chimed in Sandy.\n\n\"Yuh better not, if you know what's best for you,\" stormed Watson. \"If\nyuh try that, Govereau'll come down here and make mince-meat out of\nyuh.\"\n\n\"He might walk into the same kind of trap you did,\" grinned Sandy.\n\n\"Where is Govereau now?\" asked Dick, shaking his head at Sandy in an\neffort to check the useless controversy. \"If you answer my questions\ntruthfully, we'll let you off a whole lot easier than we would\notherwise. We might even be induced to give you something to eat.\"\n\n\"He ain't very far from here.\"\n\n\"How far?\"\n\n\"About two miles away. We're camped in the heavy timber jus' back from\nthe river.\"\n\n\"How did he find out that we are stopping here for the present with\nRaoul?\"\n\n\"One of our men seen a dog team come up here early yesterday morning.\nGovereau thought it might be you, so he sent me over to find out.\"\n\n\"Is that all he told you to do?\"\n\nFor a few minutes Watson lay, staring about him, apparently quite\noblivious of his surroundings. He paid no attention to the last question\nput to him. Finally he turned his head, his gaze meeting Dick's\nsquarely.\n\n\"You fellows are in a mighty bad position, if you want to know it,\" he\nsuddenly blurted out. \"There ain't one chance in ten thousand that\nyou'll ever get through alive. Your only hope is to go back to the place\nyou come from.\"\n\n\"I'm not asking you for advice,\" said Dick angrily.\n\n\"Jes' the same, I'm tellin' yuh. I wouldn't take the whole of upper\nCanada to be a standin' in your shoes just now. You're only a kid an'\ndon't realize how bad a mess you're in.\"\n\nSandy strode forward and put a hand on Dick's shoulder.\n\n\"No use to bother with him, Dick,\" he exclaimed in disgust. \"We're just\nwasting time. He'd keep us talking here all night. Our best plan is to\nget out of here as quickly as possible. Govereau may be along any time\nto find out what has happened to him.\"\n\n\"I think same, too,\" Toma cut in. \"What you say I hitch up huskies, and\nwe start right away?\"\n\nDick glanced from one to the other.\n\n\"I guess you're right. We can't any more than lose our way in the dark,\nand we've been lost before.\"\n\n\"But what are we going to do with him?\" Sandy wondered, pointing at\ntheir prisoner.\n\n\"We'll have to leave him here with Raoul,\" Dick replied. Then he turned\nto Toma's friend.\n\n\"Do you object?\" he asked. \"You can release him sometime tomorrow. That\nwill give us a chance to be well on our way before Govereau learns what\nhas become of us.\"\n\nRaoul nodded his head, grinning.\n\n\"All right, me keep 'em big fellow in bed. Bye an' bye feed him with\nspoon like little baby. How you like that?\" he asked, turning to Watson.\n\nThe only reply from the man in the bunk was a snort of rage as he\ntwisted to one side and glared helplessly about him.\n\n\n\n\n                              CHAPTER XVI\n                      A JOURNEY THROUGH THE NIGHT\n\n\nThe lonely journey through the dark proved to be not nearly as difficult\nas Dick had expected. An hour after their departure from Toma's cabin,\nthe little party emerged from the shelter of spruce and pine, skirting\nthe river, and drove forth upon a comparatively open prairie, piled high\nwith drifts.\n\nHere the snow had been packed down by the wind and the huskies were able\nto trot across its surface without breaking through. They went forward\nat such a brisk pace that Dick, running behind, was forced to admit,\nbreathlessly, to Toma:\n\n\"I can't keep this up all night. Can't you slow down once in a while,\nand give me a chance to catch my breath?\"\n\n\"We all ride now,\" the guide answered, motioning Dick to a place on the\nsled in front of Sandy, who, because of his weakened condition, had been\nriding most of the time since they had left the cabin.\n\nA moment later, sitting at his friend's feet, Dick was conscious of a\nnew experience. He had never ridden behind a team of huskies before.\n\n\"This is wonderful,\" he remarked as the dogs sprang forward at Toma's\nsharp word of command. \"How easy they pull us, Sandy. If we keep on at\nthis rate, it won't take us long to reach mounted police headquarters.\"\n\nToma, who was standing behind, with one hand on the gee-pole, laughed\ngood-naturedly over Dick's enthusiasm.\n\n\"They go fast tonight,\" he admitted, \"but mebbe tomorrow we come to soft\nsnow in woods. No go fast then.\"\n\nSomewhere, close at hand, there broke forth a weird, unearthly noise, a\nsound that echoed across the stillness, causing both Dick and Sandy to\nsit up very straight, hearts thumping excitedly.\n\n\"What was that?\" they demanded in chorus.\n\n\"Wolves,\" came the ready response. \"We see plenty of wolves from now on.\nRabbits very few this year and wolves always hungry.\"\n\n\"Well, I don't want 'em to feed on me,\" shivered Sandy. \"What would we\ndo if they should happen along and suddenly decide to make a meal on\nus?\"\n\n\"Shoot,\" answered Dick, one hand stealing back in the sled to make sure\nthat in the hurry of their departure they had not forgotten their\nrifles.\n\n\"They not come yet,\" Toma reassured them. \"Bye 'n' bye weather get more\ncold, snow more deep, wolves more hungry. Then we watch out. No travel\nlike this at night then. Me 'fraid wolves too.\"\n\nDick laughed. \"I'm glad to hear that there's something you're really\nafraid of, Toma. I'd begun to think that nothing could frighten you.\"\n\nAnother howl from the wolf pack, and Sandy's mittened hand was pawing at\nDick's shoulder.\n\n\"Honestly, Dick, I don't like this. Just listen to that! Isn't it awful?\nToma, are you sure they won't come over here and try to gobble us up?\"\n\n\"Plenty sure,\" answered the guide.\n\nSandy slouched back in his seat again, not entirely convinced in his own\nmind that Toma was right.\n\n\"I hope so,\" he grumbled, \"but why in the dickens did the rabbits have\nto get scarce this year. I suppose they heard we were coming along and\njust to make our bad luck complete, hopped off to another part of the\ncountry. I wonder why the wolves didn't follow them, Toma?\"\n\n\"Wolves no follow rabbits 'cause rabbits all dead,\" patiently explained\nthe half-breed.\n\n\"Who killed 'em?\" Sandy wanted to know.\n\nToma's whip cracked forth over the boys' heads, and the huskies sprang\nforward with redoubled effort.\n\n\"Rabbits no get killed--they sick an' die,\" he answered. \"When you live\nin this country long time you find out queer thing. Ever' six, seven\nyears see many rabbits--like mosquitos in spring. Wolves an' coyotes all\nvery fat then. Almost step on rabbits when you walk through woods. When\nrabbits many like that, one fellow him get sick, bye 'n' bye another\nrabbit him sick, too. Pretty soon no rabbits left--all dead. No tell you\nwhy.\"\n\nFollowing this explanation, Sandy lapsed into silence for many moments.\nThere was no sound at all except that made by the pattering feet of the\nhuskies, and the crunching of the sled under them. A belated moon had\nrisen slowly from the distant horizon, and in its pure, white light, the\nboys could now discern objects, which a few hours before had remained\nhidden. Looking about him, Dick saw that the comparatively open space\naround them extended southward for many miles, a vast, snow-covered\nfield, dotted here and there with small patches of poplar.\n\nThey were passing one of these tree clumps a short time later when,\nplainly discernible, not more than fifty or a hundred yards to their\nright, Dick perceived the huge body of a wolf gliding quickly along,\nalmost abreast of them. The boy's startled exclamation drew the\nattention of Sandy and Toma.\n\n\"Follow us like that all night, mebbe,\" Toma stated indifferently, \"he\nno come any closer. He 'fraid us like we 'fraid him.\"\n\n\"He doesn't appear to be very frightened,\" came Sandy's dry comment,\n\"and if he comes one step nearer, I'm going to teach him a few manners.\"\n\n\"No,\" said Dick, \"we've got to save our ammunition. We may need it badly\na little later on. Besides, I doubt very much whether one wolf would\ndare to attack us. It's a full pack that I'd be afraid of.\"\n\n\"If there were more than one,\" rejoined Sandy, peering fearfully across\nat the subject of their conversation, \"I think I'd be inclined to pull\nthis blanket over my head. I simply wouldn't want to see 'em.\"\n\nDick's amused laugh was broken short by a sudden snarling from the\nhuskies. This continued until Toma cracked his whip and shouted out a\nsharp word of command.\n\n\"No like 'em wolves either,\" he explained. \"You promise no be afraid if\nI tell you something.\"\n\n\"Certainly,\" answered Dick. \"What is it?\"\n\n\"You look on other side.\"\n\nSandy and Dick, following directions, drew in a quick breath of alarm.\nTwo more wolves, equally as large as the one on their right, trotted\nalong unconcernedly across the drifts, their furry forms plainly\ndistinguishable in the moonlight.\n\n\"Lord help us!\" exclaimed Sandy, with no thought of irreverence.\n\n\"Can you beat that?\" Dick wanted to know.\n\n\"No see wolves any more when morning comes,\" Toma attempted to cheer\nthem. \"You wait.\"\n\nAfter that the hours seemed interminable. Both Dick and Sandy had\nforgotten about the novelty of their ride. Intermittently Toma's whip\ncracked; the huskies moved on; there was no sound except the slight\nnoise of their progress across the field of white. On either side\ntrotted the wolves, three dark shapes, moving like ghosts, never once\nquickening or slackening pace. It was with a sigh of relief that Dick\nfinally perceived the first faint glow of morning across the eastern\nsky.\n\n\"We stop pretty soon and have something to eat,\" announced Toma,\nbreaking the long silence.\n\nAnd a few minutes later, when they drew up before a small log cabin,\nstanding at the edge of a narrow sheltering woodland, their companions\nof the night--the three wolves--were nowhere in sight.\n\n\"What I tell you,\" their guide reminded them.\n\n\"Right, as usual,\" grumblingly admitted Sandy. \"But tell me, Toma, whose\nplace is this?\"\n\n\"Another friend--him live here,\" answered Toma. \"We have breakfast,\nsleep two, three hours, then go on some more. No like to travel night.\"\n\nIt took but a few moments to unhitch and feed the huskies. Dick looked\non with interest as Toma threw each one of the dogs its ration of frozen\nfish. Then the three boys strode forward toward the cabin, upon the door\nof which the young half-breed knocked loudly. But no answer ensued.\n\n\"Guess him gone away,\" Toma stated, and pushed open the door. \"He no\ncare if we stay here for little while. Mebbe out on trap line.\"\n\nAfter a fire was started in the fireplace, Dick and Toma proceeded to\nget breakfast, while Sandy carried in armloads of wood from the big pile\noutside. They ate in front of a crackling flame, joking and laughing\namongst themselves.\n\n\"With the help of the huskies,\" exulted Sandy, \"we'll soon leave Pierre\nGovereau so far behind he'll never catch up. Won't he be wild when he\nhears how we've outwitted him?\"\n\n\"I wouldn't be too sure about that if I were you,\" Dick cautioned.\n\"Govereau isn't the only man we'll have to fear either. You know\nHenderson has accomplices all along the line.\"\n\nSo it proved.\n\nIn spite of their good intentions, their determination to sleep only a\nfew hours, it was morning of the following day when Dick and Sandy awoke\nto find their new team gone and Toma hunting around in the underbrush\nsome distance from camp.\n\n\n\n\n                              CHAPTER XVII\n                           THE STOLEN HUSKIES\n\n\nThe dogs were gone, and that was all there was to it, Dick decided a\nmoment later, after a shouted conference with Toma. They would have to\ngo on on foot. It was discouraging, but it made Dick more determined\nthan ever.\n\n\"We'll never get to the fort now,\" Sandy grumbled.\n\n\"Well, we're a darn sight closer than we were,\" Dick tried to be\ncheerful.\n\nThey watched Toma circling the camp, looking for tracks. Presently he\ncame in.\n\n\"Some fella steal dogs all right. Mebbe Henderson's men; mebbe just\nplain thief. Who know?\"\n\n\"Well, they're gone anyway, and it's up to us to make the best of it,\"\nDick resigned himself. \"It'll be slow work hauling this sled.\"\n\nToma had nothing more to say. His only answer was to slip the breast\nband of a dog harness over one shoulder and start the sled. Dick and\nSandy followed his lead and presently they were mushing slowly out on\nthe trail.\n\nIt was exceedingly tiresome business, and within an hour all were leg\nweary. The snow had begun to thaw a little, and was soggy underfoot. The\nsled runners cut down deeply, making it exceedingly hard pulling, even\nwith so light a load as they had.\n\nLong before noon they were resting frequently. And it was with great\nthankfulness that they at last made camp.\n\n\"Phew! That was a stiff jaunt,\" Dick panted, lying flat on his back,\neven his iron endurance tested to the utmost. Sandy was too winded to\nreply. Toma alone seemed to make no note of it. Long since the boys had\nceased being surprised at any of Toma's feats of muscular endurance.\n\nThey were about ready to dine on cold baked beans and coffee, when Toma\ncalled their attention to a movement ahead of them from the direction of\nFort Dunwoody. It proved to be a man and a dog team.\n\n\"Honestly, we're going to meet somebody!\" Sandy exclaimed incredulously.\nFor days they had seen few save enemies.\n\n\"Well, maybe this isn't a friend,\" said Dick, dubiously.\n\nToma studied the man intently as he drew nearer. Finally they could hear\nthe cries of the driver to his dogs and the occasional cracking of his\nlong whip. It was a white man; they could tell even at that distance by\nthe tail to tail hitch of the dogs. Most of the Indians drove in fan\nformation, each dog attached to separate tugs of varying lengths.\n\nThe stranger stopped some distance from them, and came on more slowly.\nEvidently, he himself was not too certain whether or not he was meeting\na hostile party.\n\nThey hailed each other.\n\n\"I'm Corporal Richardson of the Mounted,\" called the lone driver of the\ndog team. \"Who are you?\"\n\n\"Hurrah!\" cheered Sandy.\n\n\"Dick Kent and Sandy McClaren with a guide from Fort du Lac,\" Dick\ncalled back through cupped palms.\n\nThe policeman seemed satisfied. Cracking his whip over the dogs, he\nspeedily joined the young travelers.\n\nCorporal Richardson was dressed in a heavy fur coat and parka. When near\nthe campfire he pulled open his great coat, disclosing the scarlet of\nhis uniform coat. He listened attentively to Dick's story of their\nadventures, and he seemed favorably impressed with both Dick and Sandy,\nthough at first he was somewhat suspicious of Toma.\n\n\"I left Fort Dunwoody a week ago,\" the policeman told them, his steely\neyes unwavering. \"We've been hearing rumors of Bear Henderson's\noutbreak, and I was sent up here to clear some of these trails. Of\ncourse Henderson is rather foolish to think he can whip the Mounted and\nthe Hudson's Bay Company, but he's made rather a good try at it already.\nLast report we had he'd burned two trading posts, and had captured three\nmore. Mackenzie's Landing has fallen to him, I understand. They say his\nnext move is Fort du Lac.\"\n\nDick and Sandy gasped at the revelations of the policeman.\n\n\"Didn't you know about the capture of Fort Good Faith, and the\nimprisonment of Walter MacClaren, my friend's uncle?\" Dick asked.\n\n\"We did not,\" replied Corporal Richardson. \"That is news. But of course\nHenderson has made a lot of moves we know nothing of. I suppose you're\nafter help. It was nervy of you young fellows to break through\nHenderson's lines. You know he isn't letting any one in or out of the\nfar north. A man's life isn't worth a cent who isn't hand in glove with\nthe outlaw. I'm detailed to scout the trail to Mackenzie's\nLanding--clear things up there if possible. I wish I could go with you\nfellows, but you'll have to go on alone and talk to the Inspector. I\ndoubt if you get help right away. Every officer is out on the trail now,\nexcept the bare few that guard the post. It looks like reserves might be\ncalled out in spite of the fact that we don't like to do it.\"\n\n\"Then you think we may even have to go on to Fort Good Faith alone?\"\nDick spoke concernedly.\n\n\"Oh, no, but you may have to wait for a constable.\"\n\n\"But we can't wait!\" Dick cried desperately. \"We've been delayed a week\nas it is. Sandy's uncle must have help.\"\n\nCorporal Richardson sympathized with them, but he said he would not\nbuild up false hopes. \"I suggest you ask the Inspector for a special\ndeputization. In times like these every man will be forced into the\nservice who isn't an enemy of the crown.\"\n\nDick and Sandy thrilled at this possibility. To think of being for even\na brief period a member of the Royal Northwest Mounted Police was almost\nbeyond their dreams.\n\n\"I'll have to be mushing,\" announced the policeman. \"Too bad you lost\nyour dogs. I passed a team about ten miles back. I thought the driver\nlooked rather sneaky. It's pretty hard to describe ordinary huskies. All\nI remember unusual about the team was that the leader, an exceptionally\nbig fellow, limped with his left forefoot. Not much, just a little.\"\n\n\"That's our team, sure enough!\" Dick cried. \"Remember, Sandy, how that\nleader limped?\"\n\n\"I wish we could catch up with the fellow,\" Sandy gritted.\n\n\"It's too late now,\" Corporal Richardson shook his head. \"I wish I could\nsplit my team with you, but you see I've only four and with two I'd be\nslowed up considerably. What you'd better do is leave your sled, and\ntake what you need by shoulder pack. If----\"\n\nCorporal Richardson did not finish the sentence. He seemed to start, and\nhis eyes widened. His hand flew to his chest. Across the snow came the\nringing crack of a distant rifle. The mounted policeman dropped upon one\nelbow, as his startled companions hastened to him.\n\nDick shook his fist at the hills in the direction the shot seemed to\nhave come from.\n\n\"I guess I'm hit pretty bad,\" the corporal revived and whispered. Toma\nhad thrown up the sled as a sort of barricade, if any more shots were\nfired, and Dick and Sandy commenced administering first aid to the\nwounded policeman. The bullet had struck under the shoulder blade at the\nback, and had come out the right side.\n\n\"It's a nasty wound,\" Dick said grimly--\"maybe a lung is touched.\"\n\n\"Rather lucky for you fellows at that,\" the corporal smiled gamely. \"Now\nyou can use my dog team to tote me back to the fort.\"\n\n\"Do you have any idea who shot you?\" Dick asked.\n\n\"One of Henderson's men without a doubt,\" was the faint reply, \"the\ncountry's alive with them. But we'll beat 'em yet.\"\n\nDick grimly agreed with him.\n\nStrangely enough, no more shots were fired. Dick judged the reason for\nthis was that a single man had attacked them and had lost courage after\nseeing he had drawn blood in a party too strong for him. Yet he could\nnot be sure. At any moment they might expect the sharpshooter lurking in\nthe wooded hills to drop one of them. If they were to move on to the\nfort they could not remain sheltered from attack.\n\nThe limp body of the corporal was speedily transferred to his sled,\nafter some of the packs had been thrown aside. Dick picked up the\ngee-pole, Toma took the lead, and Sandy cracked the long whip.\n\n\"Mush!\"\n\nThey were off, the dogs yelping eagerly down the back trail, overjoyed\nat hitting the home trail so soon.\n\nFor nearly an hour they advanced at a fast rate of speed, Sandy and Dick\nchanging off advance guard with Toma. Then they entered a long ravine,\ncrested with spruce and jackpine. As yet no sign of the man who had shot\nthe corporal appeared. Then, without warning, from the brow of the\nravine, puffed the smoke of a rifle. A bullet fanned Dick's cheek, and\nhe paused and fired at the distant smoke at the top of the ravine.\n\n\"Mush! Mush!\" shouted Sandy to the dogs, cracking the long whip.\n\nThe dogs responded nobly, drawing the sled, carrying the wounded\nofficer, so fast that the boys could hardly keep up.\n\nAgain the hidden rifle cracked from the top of the ravine. This time one\ndog gave a sharp yelp, leaped into the air and fell kicking his last in\na tangle of harness.\n\n\"He's killed a dog!\" cried Dick angrily. \"Quick, get him out of the\nharness so we can go on.\"\n\nThe three remaining huskies were growling and snarling in a mess, and it\nwas some minutes before Sandy and Toma could straighten them out, cut\nthe dead dog from his harness and start on again. Meanwhile Dick emptied\nhis rifle at the brow of the ravine, taking a chance on hitting whoever\nwas skulking there with such deadly intent.\n\nOn their way again, the fast moving sled proved an elusive target for\nthe sharpshooter. He shot three times without effect. Swiftly they\nneared a point where the ravine widened out into a low walled valley,\nwhich was almost barren of vegetation. Once on this clear space they\nwould be safe, for there was no cover within rifle range for the man who\nwas dogging them.\n\nDick and Sandy were almost on the point of giving a shout of triumph\nwhen the hidden rifle cracked again and another dog dropped in the\nharness. The sled stopped, and once more the excited dogs got themselves\nin a bad mix-up. At the mercy of the mysterious and deadly rifle, the\nboys attacked the tangled harness and dogs.\n\n\n\n\n                             CHAPTER XVIII\n                             A HUNGRY PACK\n\n\nScarcely had they cut loose the fallen dog when the rifle sounded again\nand the lead dog dropped to his haunches, failing to rise again. Dick\nput the dog out of misery with a shot from his rifle, then turned to\nToma and Sandy.\n\n\"We've got to get that fellow out of his nest. He's playing with us. As\nsoon as he finishes with the dogs he'll start in on us. We might as well\ndie fighting. Follow me.\" Dick wheeled and started up the hill, firing\nhis rifle as he went, Sandy and Toma not far behind.\n\nThe man on the rim of the ravine seemed taken by surprise. His shots\nwent wild. Only one came close, and that tore through Sandy's mackinaw.\n\nShouting at the top of their voices, the boys reached the top of the\nravine. A running figure was just disappearing over a knoll ahead of\nthem. Dick paused a moment, levelled his rifle and fired quickly. The\nfigure, some hundred yards distant, leaped high, as if hit, and ran on\nlimping. Toma and Sandy also fired, but did not hit. They ran on after\nthe man a little way, then fearing to leave the wounded officer too long\nalone, they hurried back, certain they had routed the sharpshooter.\n\n\"We're lucky,\" Dick said, as they trotted down the slope of the ravine,\n\"--not a scratch and he was sure shooting close.\"\n\n\"I kind of wish I was in Corporal Richardson's place when I think of\ngoing on with one dog,\" Sandy changed the subject, making light of his\nnarrow escape. \"Means we've got to buckle into the harness again.\"\n\nToma paused as they reached the sled. They could see him looking up at\nthe sky.\n\n\"Heap snow come soon,\" the imperturbable weather prophet announced.\n\"Make um wolves hungry.\"\n\nDick and Sandy did not think seriously of Toma's prophecy, for they were\nintent on the hard work ahead, and already were stepping into the places\nvacated by the dead dogs.\n\nAgain they toiled out on the trail to Fort Dunwoody, hauling the wounded\nman, who was muttering to himself now in a delirious state brought on by\nrising fever.\n\nIn an hour it had begun to snow, but the boys kept on. Thicker and\nthicker fell the soft, white flakes, until they could see no more than\ntwenty feet ahead. It was a wet snow, and made pulling the sled harder\nthan ever. The runners seemed to drag like lead upon the aching\nshoulders of the three. They were glad when darkness fell and they were\nforced to camp.\n\n\"We're in for an all-night snow storm, I guess,\" Dick observed, as the\nfire he was trying to start went out for a third time, and he had to\nenlist the aid of Toma.\n\n\"I'd like to sleep for a week,\" said Sandy, from where he was trying to\nmake the wounded officer more comfortable. \"That falling snow is just\nlike a bedtime story that really does put a fellow to sleep.\"\n\nThey rolled into their sleeping bags as soon as they had appeased their\nappetites, not troubling to keep watch. All night the snow fell, and in\nthe morning they awakened almost smothered with the wet drifts. The\nworld was all fresh and white like a new blanket, but they had not taken\nten steps before they knew they would make little progress that day.\n\n\"If a crust would only freeze over the snow we could get along faster,\"\nDick bewailed.\n\nCorporal Richardson seemed a little better after the night's rest. His\nfever had gone down and an examination of the wound showed it to be\ncoming along as well as could be expected. He was very weak, however,\nfrom loss of blood.\n\n\"Where are we?\" the officer asked Dick.\n\n\"About fifty miles north of Fort Dunwoody with only one dog,\" Dick\nreplied. \"You were unconscious yesterday during the scrap we had with\nthe same fellow who hit you.\"\n\n\"Yes, I seemed to have had delirium,\" replied the corporal. \"I imagined\nI heard shooting.\"\n\n\"Well, you didn't need your imagination to hear that yesterday,\" Dick\nassured him.\n\n\"It'll be a wonder if you get through,\" the officer said, \"better leave\nme along the trail somewhere. There's an abandoned cabin a few miles\nthis side of Badge Lake. You'll strike it if you follow the long ridge.\nPut me off there with some grub and then have Inspector Dawson send a\nman out after me.\"\n\n\"No, we couldn't do anything like that,\" Dick returned firmly. \"In your\ncondition you need medical care as soon as you can get it. As long as we\ncan stand you're going to stay on this sled.\"\n\nAs if to bear out Dick's words, the officer fainted dead away.\n\nAlarmed, Dick put a cup of melted snow to the pale lips. The corporal\nhad just aroused enough to drink when a sound from across the snow\nstartled Dick so that he spilled the water.\n\n\"Listen to that!\" ejaculated Sandy.\n\n\"I heard it,\" Dick replied.\n\nLong, weird, mournful, the howl of a wolf rose and fell in the distance.\nIt was the hunger cry of the most savage denizen of the northland wilds.\nDeep snow had made hunting hard for the wolves, and they were beginning\nto take notice of the man prey of the land.\n\n\"Him hungry,\" grunted Toma.\n\nThey set off on the trail once more. A half mile they struggled along\nwith the sled, when another wolf howled from a different quarter. This\ntime the cry was answered.\n\n\"Wolves come together for big hunt,\" Toma explained, with his usual\nabsence of emotion.\n\n\"Here's hoping they don't pick on us,\" Sandy remarked.\n\nDick was silent. His face was haggard. The troubles of the trail were\nweighing heavily on his sturdy shoulders, and this new danger of the\nnorthland taxed his courage to the utmost. Yet he did not falter.\nInstead, his words were cheerful, though they came from drawn lips.\n\n\"I guess we have a few shots left in our rifles,\" said Dick meaningly.\n\"Those wolves better not come too close.\"\n\n\"Few shots is right,\" Sandy came back dishearteningly. \"Dick, do you\nknow we have only about ten shots left for each of the rifles? And we\nhad the hard luck to unload Corporal Richardson's ammunition when we put\nhim on the sled. All he has is a belt full of revolver cartridges.\"\n\nDick's hands clenched on the strap with which he was helping pull the\nsled. \"Makes no difference, Sandy. After we've escaped all these human\nwolves that have been after us, I guess we can handle the animals all\nright.\" But he was not quite so sure as he tried to make Sandy believe.\n\n\"Wolves eat um dead dogs back trail,\" Toma called from the rear of the\nsled, where he was following up after a stiff job of breaking trail.\n\nAll afternoon the cries of the gathering pack could be heard, now near,\nnow far. Once it seemed they were all around them. Then the boys\nredoubled their efforts on the heavy sled.\n\n\"We ought to pull into that cabin the corporal mentioned before long,\"\nDick said worriedly, as he changed places with Sandy.\n\n\"I don't know about that,\" Sandy replied. \"The corporal was probably\nestimating the distance if we made time with a good dog team--but we\nhaven't gone more than five miles today.\"\n\nThey made no stop for a mid-day meal, chewing raw bacon while toiling on\nthe trail. The fear of the wolves had entered their hearts yet they\nwould not let one another feel that fear by any spoken word.\n\nNear nightfall they were certain the wolves were trailing them, and they\ncould not hide it from one another. Far in the rear they could hear the\nhunting cry of the pack, and it was blood-curdling.\n\nWhile the sun still shone over the western skyline, the first of the\nwolf pack appeared behind, and the boys knew that they were in for\ntrouble.\n\nThe leader of the wolves was old and wise. For a time he held the pack\nof nearly thirty gaunt, gray wolves out of rifle range, waiting for\ndark. But hunger could not be denied. The less wise of the pack forged\nahead, and the rifles of the three boys spoke with deadly effect.\n\nDick's toll was three wolves before he emptied his magazine. Sandy shot\none and thought he had killed another, but the animal seemed only\nstunned, and after a minute leaped up and came on again at a swinging\nlope, to be dropped by a shot from Dick, who had reloaded.\n\nToma did not fire, however. Instead, without any orders from Dick or\nSandy, he made camp in a patch of scrub pine and spruce, where there was\nplenty of dead wood. Speedily he made a fire. When Dick and Sandy had\nexhausted their ammunition, and had gone for Corporal Richardson's\nrevolver, a huge fire was roaring and crackling before the upturned\nsled, in whose shelter rested the corporal.\n\nThe wolves had drawn off out of gunshot now. Some of them were devouring\ntheir comrades that had fallen. When darkness crept over the little camp\nthe wolves had completely surrounded it.\n\n\"We've got to save our cartridges,\" Dick said at last. \"Toma, how many\nhave you left?\"\n\n\"Just gun full up,\" replied Toma, which meant he had the magazine of his\nrepeater full--eight shots.\n\nDick was fingering Corporal Richardson's revolver. He was unaccustomed\nto handling a revolver and comprehended he could do little real damage\nwith the small arm, having always used a rifle. Sandy was no better than\nhe, and when Dick asked Toma if he could shoot with a revolver with\naccuracy, the guide shook his head.\n\n\"They're slinking around us in a circle now,\" Sandy reported fearfully,\nas the shadows deepened.\n\nAs he had said, now and again a dark, sinister form glided across the\nsnow from shrub to shrub, skirting the firelight. Here and there, one of\nthe pack sat on his haunches, his beady eyes fixed on the camp, while\nhis mouth slavered. Frequently one of the number raised his nose to the\nsky and sounded the hunger howl.\n\nThe wolves feared the campfire, and Toma explained that as long as they\ncould keep the fire going they need not fear any very dangerous attack.\nAnd even if the wolves did rush them they could be repelled by fire\nbrands.\n\n\"I'm going to see what they do when I throw fire,\" Dick said presently.\nHe picked out the nearest shadowy form, and drawing a flaming stick from\nthe fire, threw it at the wolf. His aim was good and the animal snarled\nhorribly as the fire fell within a few feet of its feet.\n\nIt was close to midnight when Toma confided to Dick and Sandy what they\nboth feared. The wolves were gaining in number as wanderers joined the\npack surrounding them. The places of those they had killed earlier in\nthe day, and the few they had managed to pick off after dark were being\nfilled by other ravenous beasts.\n\nThere would be no sleep in the camp that night.\n\n\n\n\n                              CHAPTER XIX\n                          THE CIRCLE OF DEATH\n\n\nToma had cut a huge stack of wood, and it was well he did, for the\nmoment the fire died down the wolves drew closer. In fact they seemed to\ntaunt the boys into using the last of their ammunition in firing at the\ndifficult targets they made.\n\nThe one dog was whimpering with fear and cowering under the legs of his\nmasters in abject fear. Sometimes, however, a low whine sounded among\nthe wolves, at which the husky pricked up his ears and did not seem so\nfrightened. Toma tied the dog to the sled with a thong of moose-hide.\n\nAs the night wore away, Dick and Sandy risked shot after shot at the\nwolves, and now and again they dropped a skulking shadow. But usually\nthey missed, since Toma objected to giving up his rifle, and they were\nforced to use the corporal's revolver.\n\n\"How long do you suppose we can hold out?\" Sandy asked in a strained\nvoice.\n\n\"I see no reason why we can't hold out until they leave,\" Dick replied\nwith more confidence than he felt. \"We've plenty of firewood. As long as\nwe have fire to fight with we're safe.\"\n\n\"How do we know they'll leave?\" Sandy wanted to know.\n\nDick shuddered a little, and did not answer. He saw a gray shape loom up\nat the edge of the firelight, and raising the revolver, fired quickly.\nHe gave a cry of satisfaction as he saw the gaunt beast leap into the\nair and fall, kicking its last.\n\nThere followed a rush of hungry wolves for their fallen companion.\nHorrified, the boys watched the dead wolf torn to pieces by the pack.\nDick emptied his revolver into the writhing mass. He could not help but\nhit, and he killed another wolf, wounding two others, which the pack\nfinished.\n\nSandy began throwing burning brands at the wolves, and they drew off\nonce more into the darkness, where they paced nervously back and forth,\ngrowling and snarling.\n\nThe boys decided that one of them should try to sleep while the other\ntwo watched. Dick arranged three twigs in one hand for Sandy and Toma to\ndraw from. The one with the shortest twig, after the draw, was to be the\nlucky one. Sandy drew the shortest. But after a half hour of futile\ntossing about, he gave it up.\n\n\"No use,\" Sandy joined the haggard watchers at the fire. \"One of you\nfellows try it. I couldn't sleep in a million years with those devils\nout there waiting to gobble me up.\"\n\n\"I don't think I can either,\" said Dick. \"Toma, you'd better try it. One\nof us had better get some rest.\"\n\nThe guide grunted assent, and rolled into his sleeping bag, which once\nhad been his brother's. In a few minutes Toma was breathing steadily in\nsound slumber. His calmness gave the boys courage.\n\n\"If he can sleep I guess we hadn't ought to feel so nervous,\" Sandy\nobserved.\n\n\"I've heard old sourdoughs say an Indian never lets the nearness of\ndeath trouble him when he can't get away from it,\" Dick related, trying\nto get his own mind and Sandy's off their perilous predicament.\n\n\"Well, I wish I was an Indian then,\" Sandy sighed, \"--for the present\nanyway.\"\n\nThe renewed and increased restlessness of their dog attracted their\nattention then, and they watched him straining at the moosehide leash.\n\nDick caught the dog trying to chew through the thong and spoke sharply.\n\n\"Funny why he wants to get away,\" Dick mused aloud. \"One would think the\ndog would realize his danger and want to stay near the fire.\"\n\nCorporal Richardson's voice sounded from his blankets. The officer had\nawakened and had overheard Dick's remark.\n\n\"There's a female wolf out there--several of them,\" the veteran\nnortherner answered Dick. \"She's calling to the dog. It's the mate call\nof the wolf and the dog understands it. But only the wisest of\nshe-wolves understand how to use the call to lure meat for their\nstomachs. That dog wouldn't last three minutes once he left the fire.\"\n\n\"How do you feel now?\" Dick asked, going to the wounded man's side.\n\n\"Much better,\" answered the officer, \"but my side is stiff and mighty\nsore. I'll be flat on my back for a couple of weeks yet. Couldn't be\nworse luck now that the Inspector needs every man of us.\"\n\n\"Then you really think we have a good chance escaping from the wolf\npack?\" Dick eagerly seized at a grain of encouragement.\n\nThe corporal did not answer immediately. \"You'd have a lot bigger chance\nif you left me here in the morning,\" said the corporal steadily.\n\n\"Leave you here!\" Dick exclaimed. \"What do you think we are--cowards?\"\n\n\"I should say not, Dick Kent,\" replied the policeman. \"But that doesn't\nmake me any less a burden. With this wolf pack surrounding you you'll do\nwell to get away from camp at all, say nothing of hauling me along.\"\n\n\"But we're with you anyway,\" Dick concluded decisively.\n\n\"Oh, well,\" the officer turned a little, stifling a groan at the\nmovement, \"the wolves may scare up moose or caribou before morning. If\nthey do they'll soon leave us alone.\"\n\nThe conversation had weakened the corporal, and Dick soon left him to\nrest, joining Sandy. The boys discussed the situation, listening to the\nfearful howls of the wolves, hoping against hope that as Corporal\nRichardson had said, they might find other game before morning.\n\nAfter two hours of sound slumber, Toma quietly arose and joined the two\nat the fireside. He said little, but set to work cutting down more wood,\nand breaking it up into firewood lengths.\n\nMorning dawned, cold and gray. Dick and Sandy were worn from loss of\nsleep. Silently they waited for the wolves to depart. But with the sun\nan hour high the pack still circled the camp, tongues lolling, jaws\nslavering.\n\n\"Will they never leave!\" Sandy's voice faltered.\n\n\"Wolf much hungry!\" Toma grunted. \"Maybe um leave, we start. Sometime\nthey do.\" He looked at Dick to see what he thought.\n\nDick surveyed the menacing circle of wolves. They had grown bolder as\ntheir hunger increased. Could they hitch up the dog and break out of\nthat circle of death?\n\n\"If you think we have a chance to get out of here, Toma, we'll try it,\"\nDick grimly returned a moment later. \"Anything but this suspense suits\nme.\"\n\nAs the boys packed up the wolves grew more uneasy and shifted closer.\nToma scarcely could manage the husky as he hitched it to the sled. The\nyoung guide held his rifle in one hand, working at a disadvantage so\nthat he might be prepared to shoot at a moment's notice. Toma's was the\nonly rifle left in which there was ammunition, and Dick had shot away\nall the revolver cartridges during the night.\n\nIt was with many misgivings that a few minutes later they took their\nplaces for the dash through the wolves.\n\nToma took the lead, with the rifle, Sandy held the dog, while Dick took\nup the rear, swinging the camp axe.\n\nSlowly, in grim silence, they pulled away from the fire.\n\nA hundred feet away they discovered they never would get through the\ncircle. For, instead of retreating, the wolves dashed this way and that,\nthen rushed them in a body. Sandy's cry of terror was drowned by the\ncrack of Toma's rifle and Dick's hoarse shout:\n\n\"Back to the fire! We can't make it!\"\n\nThen Toma's rifle was empty, and with clubbed rifle and axe they were\nleft to fight their way back to the campfire. Slashing with razor fangs,\nthe wolves leaped in and out. Dick wrought havoc with the axe, and Toma\nploughed his way through the snarling, writhing mass like a Hercules.\nWhen the guide broke through he ran to the fire and commenced throwing\ncoals and burning sticks with his mittens, until the air was filled with\nflying embers. Howls of pain followed as the hot coals burned the\nwolves. The scent of singed hair and burning flesh arose.\n\nAt last the wolves drew off reluctantly, leaving behind them a trail of\nwounded and dying. In the repulsion of the attack the boys had slain\nnine wolves and wounded seven. They could see the hairy bodies of the\ndead lying scattered all the way from where the fight had begun.\n\n\"Wood not last much longer,\" Toma's voice startled Dick.\n\nDick hastily inspected the patch of wood in which they had camped. As\nToma had said, they soon would be out of firewood. And the nearest wood\nwas three hundred yards away--outside the circle of death.\n\nDick and Sandy shuddered; Corporal Richardson stirred and moaned; Toma\nbegan quietly gathering the chips and twigs; half buried in the snow.\n\n\n\n\n                               CHAPTER XX\n                            SANDY DISAPPEARS\n\n\nSitting by the fire, conscious presently of a light step at his side and\na friendly hand on his shoulder, Dick turned and looked up into Sandy's\nface, as his chum spoke in a voice husky with emotion.\n\n\"I guess we've about played our last card,\" said Sandy. \"Right now it\ndoesn't look as if Fort Dunwoody was very close, does it?\"\n\n\"No, not very close,\" Dick was obliged to answer, as his tired eyes\nswept the narrowing circle of timber wolves.\n\n\"We've done the best we could anyway,\" Sandy went on dejectedly. \"I\nguess my Uncle Walter won't receive a whole lot of help from us.\"\n\n\"Sandy, I used to think you were an optimist,\" declared Dick, \"but now I\nknow you're a born pessimist. Why don't you try to cheer up?\"\n\nSandy glanced about at the wolves. A scowl puckered his usually placid\nbrow. \"Can't be very cheerful with those fellows waiting for us,\" he\nsaid shortly. \"Do you know I sometimes think that big one with the\nshaggy head actually grins at me? If he thinks he's going to pick a\nwhole lot of meat off my bones he's badly mistaken.\"\n\nDick grinned in spite of himself. \"Exactly what do you mean, Sandy?\"\n\n\"Well, I'm a whole lot thinner than I was. Toma would make better\neating.\"\n\nAt this juncture, Toma, who had been cutting what little wood remained,\nstrode forward with an almost excited look on his face. \"I know what do\nnow,\" he announced. \"We no got firewood; plenty over by trees.\"\n\n\"We know that,\" Sandy responded impatiently, \"but we're a long ways from\nbeing over there.\"\n\n\"Me ketch um good idea. No can go to wood with wolves there. We move\nfire to wood; move um little at time, one feet, two feet--bye and bye we\nget there--mebbe by night we travel fast.\"\n\nToma was right. At nightfall they had accomplished the unusual feat of\nmoving the fire to another patch of wood. And with the first snarling\napproach of the ravenous wolves a replenished fire sprang up to beat\nthem back. The boys, in exuberance, piled more and more wood on the fire\nuntil it leaped five feet into the still, frosty air, and grew so hot it\nmelted a circle of snow about it.\n\nDick breathed a sigh of satisfaction as he crawled into his blankets\nhours later. It had been decided that Sandy was to stand first watch\nwith Toma. Tonight, Dick decided grimly, he would make the most of the\nhours allotted him for sleep. He intended to follow Toma's example and\nforget everything in the complete relaxation of weary mind and muscles.\n\n\"Got to fight this thing through,\" he reminded himself, stretching his\nlong legs out before the campfire and composing himself for sleep. A few\nminutes later, while watching Sandy nervously pacing to and fro, he\nforgot all his troubles in a happy loss of consciousness that carried\nhim away to a land where wolves, blizzards and scar faced Indians did\nnot once trouble him.\n\nHe was awakened by Toma shaking him by the shoulder. \"Big wolf eat you\nup if sleep like that,\" declared the young guide goodnaturedly.\n\nDick jumped up, once more mentally alert, and shortly piled more wood on\nthe fire, commencing his lonely vigil. He scanned the fringe of the\nfirelight for the skulking shapes, which had become so dreadfully\nfamiliar, but he could see none--not a single prowling form anywhere. He\ndecided that the wolves had moved further back from the fire. Several\ntimes he believed he heard a deep-throated snarl, but he was not sure.\n\n\"I hope they're gone,\" he breathed fervently, \"so that we can continue\non our way to Fort Dunwoody. We've lost too much time already.\"\n\nOff to his right a faint glow suffused the east. In another hour, if the\nwolves really were gone, they might continue their slow progress, and,\nbarring emergencies, might reasonably expect to arrive at the mounted\npolice barracks in about three days.\n\nWith the first grin in hours brightening his face, Dick set about\npreparing breakfast. He had a frying pan over the fire and was melting\nsnow for coffee. It was so quiet around him that he imagined he could\nhear the low, irregular breathing of Corporal Richardson. Then,\npresently Toma stirred, stretched out one arm and yawned:\n\n\"Guess I get up,\" the guide announced.\n\n\"When you do,\" Dick replied, \"I wish you'd go over and wake Sandy. I've\nkept his watch for him, and if I wasn't so busy getting breakfast I'd go\nover myself.\"\n\nDick was adding coffee to the boiling water when Toma returned.\n\n\"Well, did you wake him?\"\n\nThe half breed endeavored to speak, but no sound came from his trembling\nlips.\n\n\"What's wrong?\" Dick inquired, trying to be calm.\n\n\"Sandy, him gone!\"\n\n\"Gone!\" Dick's heart took a sickening plunge.\n\nThe light was strong enough now so that they could see that the wolves\nwere gone, but this happy discovery was not so encouraging with the\ndisappearance of Sandy.\n\nHorrified at first, at the thought that Sandy must have been eaten by\nthe wolves, Dick and Toma began a minute search of the vicinity. They\nfound tracks, but no sign of Sandy. If the departed wolves had slain\nDick's chum there would have been traces left, at least bits of\nclothing.\n\n\n\n\n                              CHAPTER XXI\n                    THE MAN FROM CROOKED STICK RIVER\n\n\nIf, as Dick suspected possible, Pierre Govereau had overtaken them again\nand somehow made off with Sandy, what then could they do? Corporal\nRichardson must go on to the post at all hazards. The infection in the\nofficer's wound would kill him unless medical aid were procured soon.\nYet Dick could not leave without knowing what had happened to Sandy, and\nmaking a sincere effort to find his chum. And in that strange country he\ncould not find his way without the aid of Toma.\n\n\"I've a good idea what might have happened to Sandy,\" Dick mused aloud a\nlittle later.\n\n\"What you say?\" Toma eagerly asked.\n\n\"He's walked in his sleep two or three times in his life that I know\nabout, and last night he must have done it again. Now I'm sure he left\nthe fire after the wolves were gone. If he did then he might have fallen\ninto Govereau's hands.\" Dick strode back and forth in the snow, almost\nbeside himself.\n\n\"Oh! if some friend would only come along on the way to Fort Dunwoody,\"\nDick exclaimed aloud.\n\n\"We take um sick fella to cabin,\" Toma suggested. \"We leave um there\nwhen go look for Sandy.\"\n\nAt his wit's end Toma's suggestion seemed the only way out. Dick felt\nhis duty to Sandy even greater than that to the minion of the northland\nlaw, and he would not exactly be deserting the policeman if he left him\nwith food and firewood.\n\n\"That's the thing to do,\" Corporal Richardson spoke up from his\nblankets. \"The Indian has it right. The cabin is between six and eight\nmiles from here. You can take me there and come back and take up young\nMcClaren's trail.\"\n\nDick was glad to hear the officer's voice, and to learn that he was once\nmore rational, with abated fever.\n\n\"If it's all right with you, corporal, that's what we'll do. Toma, let's\nhurry.\"\n\nIn a few minutes the camp where they had been held up a day and two\nnights had been deserted and out across the vast, endless expanse of\nsnow, Toma and Dick toiled in the dog traces, dragging the wounded\npoliceman.\n\nThey had gone some two miles and were resting when suddenly they were\nstartled by the sound of a dog driver's voice from over the knoll they\nhad just coasted down. Was it friend or enemy? Dick prayed it was a\nfriend as he hurried to the top of the little hill and looked.\n\nA team of eight dogs, followed by a lone man, swinging a long whip, was\ncoming along the trail they had made in the snow. Dick waited till the\nman had come a little nearer. Then he revealed himself. The man saw him\nalmost immediately, and drew his dog team to a slower pace. The stranger\nseemed suspicious as to Dick's identity, but the evident distress of the\nyoung man on the hill reassured him. He came on to within hailing\ndistance, and stopped his team, raising his rifle.\n\n\"If you're one of that Henderson gang,\" called the man threateningly,\n\"I'll plug you where you stand.\"\n\nDick breathed a sigh of relief. \"We're bound for Fort Dunwoody,\" he\nreplied. \"We've got a wounded policeman on our sled and have only one\ndog.\"\n\nSatisfied that Dick was telling the truth, the shouted to his dogs and\ncame on. A moment later he joined Dick and Toma alongside the sled.\n\n\"By gar, I tink I never get out of dat country.\" the newcomer, appearing\nto be a French-Indian, mopped his brow. \"That Pierre Govereau one tough\ncustomer. Yah!\"\n\n\"You came in a nick of time,\" Dick returned.\n\n\"One of our party has disappeared, we think he's been captured. Now\nwe're trying to get a wounded policeman to a place of safety while I and\nmy guide take a look for my chum. My name's Dick Kent,\" he held out his\nhand.\n\n\"Me, I'm Gaston Leroi,\" announced the stranger, shaking with French\nwarmth, \"that Henderson's man Govereau kill my partner up on Crooked\nStick River. I get away pretty lucky.\"\n\n\"And it's lucky for us you got away,\" Dick replied with spirit. He\nstepped to the sled and stopped over the wounded officer. \"Corporal\nRichardson, here's a man who can help us out,\" Dick told the officer.\n\n\"Thank God,\" murmured the policeman. \"What's his name?\"\n\n\"Gaston Leroi.\"\n\n\"Gaston Leroi!\" exclaimed the corporal with more strength in his voice\nthan had been there for hours. \"Not the trapper Leroi. Hey! Bring him\naround where I can see him.\"\n\nAt the sound of the wounded man's voice the French trapper had leaped\nforward where he could see the officer's face.\n\n\"By gar!\" exclaimed Leroi. \"George Richardson! What them fellers do to\nyou, George?\"\n\nDick was overjoyed to discover the men were old friends.\n\n\"Gaston, you won't mind doing something for me?\" he heard the corporal\nsaying.\n\n\"Sacre diable! Do I mind!\" Gaston exclaimed.\n\n\"It's like this,\" the corporal went on, \"these young fellows want to go\nback and look for their partner, but they won't leave me. Could you haul\nme to the fort?\"\n\nThe trapper vociferously expressed his willingness to do this for his\nfriend, Constable Richardson.\n\n\"They're out of ammunition too,\" revealed the corporal. \"Just had a long\nfight with a pack of hungry wolves. Can you spare some ammunition,\nGaston?\"\n\n\"What kind of gun you got?\" the trapper turned to Dick.\n\n\"Ross 30.30,\" Dick replied anxiously.\n\nLeroi's face fell. He turned to Toma.\n\n\"I got um 45.70 Winchester,\" Toma anticipated the trapper's question.\n\n\"Me, I use 45.70!\" Gaston Leroi exclaimed with pleasure and turned back\nto Dick, saying: \"I use revolver. Like heem better dan rifle. I take\nyour gun. You take mine. Huh?\"\n\n\"Suits me,\" replied Dick gratefully.\n\nLeroi dived into his packs and soon brought out several boxes of\nammunition, with which Dick and Toma filled their pockets.\n\nA half hour later Dick and Toma bid goodbye to Gaston Leroi, and watched\nhis dog team, hauling the wounded corporal, disappear over a long hill.\nThen the two boys set out over the back trail at a jog trot. They were\ndetermined not to rest their heads until they had discovered what had\nbecome of Sandy.\n\n\"Do you think it was Govereau?\" Dick asked Toma as they hurried along.\n\n\"I not know,\" replied Toma, who was slightly in the lead. \"Tracks show\nonly two fella keetch Sandy. Hope snow no more; if not we trail um\neasy.\"\n\nThey did not speak again until they had reached the scene of their\nbattle with the wolves, where they picked up the trail.\n\n\"They're going north,\" Dick spoke, after studying the tracks. \"It must\nbe some of Henderson's men, though it seems queer Govereau would come\nthis far south.\"\n\n\"That Govereau, he bad fella; he go everywhere. No 'fraid anybody. Mebbe\nI see that Many Scar.\"\n\nDick fell silent at the mention of the scar faced Indian. He knew Toma\nwas thinking of his dead brother, and was planning revenge if he met the\nmurderer, who he believed to be the scar faced Indian. Dick knew nothing\nto say which would change Toma's mind in this respect, so he said\nnothing as they forged onward at a mile-eating pace.\n\nThey had traveled nearly ten miles into a deeply wooded vicinity, when\nthe tracks began to grow fresher, and they slowed their pace. Presently\nthey rounded a bend, and in a tiny valley, drained by a winding, frozen\ncreek, they came upon an Indian village of a dozen tepees.\n\nToma seemed as surprised as Dick at the discovery.\n\n\"Um war party,\" Toma replied immediately. \"No good Injun if um fight\nWhite Father.\"\n\n\"How can you tell they're a war party?\" inquired Dick.\n\n\"No squaws, no papooses,\" replied Toma abruptly.\n\nAs Toma had said there were no women or children to be seen in the camp.\nAnd at different points along the fringe of trees around the clearing,\nDick made out dusky sentinels, armed with long rifles, with feathers in\ntheir beaver bonnets.\n\n\"The tracks lead down into the village, so Sandy must be there\nsomewhere,\" Dick mused aloud.\n\nThe larger portion of the party of Indians who had thrown up their\ncaribou hide tepees in the valley, seemed to be absent. Here and there a\nwarrior squatted before a cooking fire, his rifle leaning close beside\nhim.\n\n\"Look!\" Dick suddenly pointed.\n\nA white man had come out of one of the tepees and was walking slowly\ntoward the creek.\n\n\"I see um,\" said Toma. \"Guess him one Govereau's men. Huh? Him Henderson\ngot plenty bad Indian work for him.\"\n\n\"Then Govereau has joined forces with these Indians,\" Dick's spirits\nfell. \"It will be one big job getting Sandy away from him now. I wonder\nwhich tepee he is in--er--\" he was about to wonder if Sandy was alive,\nbut dared not trust the words on his tongue. It was too horrible to\nspeak of--that Pierre Govereau had murdered his chum.\n\n\"We wait till dark,\" Toma voiced the resolve of both.\n\nAt twilight the boys saw a large party come in from the north, in which\nthere were a number of whites. They were loaded down with furs, which\nthey probably had stolen. Dick thought he recognized the figure of the\nhalf-breed Pierre Govereau, but could not be certain at that distance.\n\nSlowly darkness fell and the campfires flung out flickering shadows on\nthe sloping walls of tepees and over the figures of the warriors\nsquatted around them.\n\n\"I make believe I one of them,\" Toma whispered presently. \"I go\ndown--find out where Sandy is.\"\n\n\"It's an awful risk,\" Dick tried to object, \"and you aren't dressed like\nthey are.\"\n\n\"I fix that. You wait here--no, you come down closer. Be ready to shoot,\nyou hear trouble. Jump 'round when you shoot. Make um think you whole\narmy. I ketch um Sandy.\"\n\nThough Dick feared Toma would come to grief, he could do nothing but let\nthe courageous young guide take the chance, hoping, if worst came to\nworst, and Toma was discovered, that he might draw the attention of the\nIndians long enough for his red friend to escape.\n\nToma crawled off down the slope toward the camp, Dick followed him for a\nlittle way, until he reached a heavy copse of brush where he felt he was\nwithin good rifle range of the camp. Toma went on and disappeared,\nDick's whispered wish of \"good luck\" following him.\n\nAs Dick lay there waiting he could see on the side of the camp nearest\nhim, the shadowy figure of a warrior sentinel, standing motionless by a\ntree, silhouetted by the light of one of the fires. Dick raised his\nrifle and drew bead on the guard. It was this warrior who would discover\nToma, if any did, and Dick watched intently for a motion that would\nindicate the guard had seen something unusual.\n\nHe watched for possibly five minutes, when of a sudden another figure\narose between him and the shadowy guard. There was a swift movement of\nthe two shadows; they swayed violently, then the guard fell and the\nother stooped over him. Then both disappeared in the dark underbrush.\n\nDick held his breath. Toma had attacked the guard and knocked him down.\nIn a flash Dick saw Toma's plan--the young Indian would change clothes\nwith the warrior and creep into the camp, casually joining the others.\n\nGripping his rifle, Dick awaited developments. What would happen in the\nnext hour he did not know, but he hoped for the best.\n\n\n\n\n                              CHAPTER XXII\n                        A SKIRMISH IN THE NIGHT\n\n\nDick waited what seemed to him several hours, though it could not have\nbeen more than thirty minutes, before he saw a sign of Toma. Then, in\nalmost the exact position the guard had held, he saw a figure rise up\nwhich he was almost certain was Toma, though the firelight revealed that\nthe young guide now wore the clothes and head-dress of the sentinel.\n\n\"Good for you, Toma,\" Dick whispered. \"Now if you can only get in among\nthem without them recognizing that you're not really a member of their\nband.\"\n\nToma did not enter the camp from that side, however. Once more he\ndisappeared.\n\nA patch of brush to the left caught Dick's roving eyes, and this he\nwatched, believing Toma would take this means of getting into the camp\nwithout attracting attention, since the bushes led up to a point very\nnear one of the tepees.\n\nDick was right. A few minutes later the bush tops waved a little at the\npassage of a creeping body. Presently in the shadow of the tepee nearest\nthe bushes, Toma rose and walked slowly toward one of the campfires,\nwhere he joined a group. Dick feared Toma might see the scar faced\nIndian, and that the guide's desire for revenge might cause him to\ndestroy all his chances for the rescue of Sandy. But as time passed and\nall went well, Dick felt that Toma must be making good progress in the\ndangerous mission he had set out on.\n\nA little later Dick saw a figure, which he took to be Toma, break away\nfrom a group of natives and saunter toward one of the tepees. Evidently\nthe guide now was either looking for Sandy, or had learned the captive's\nexact position from the conversation of the warriors.\n\nToma stooped into the opening of the tepee and disappeared. Holding his\nbreath, Dick watched. Toma was gone some time, then in the flickering\nlight he appeared again. Would Sandy follow? Dick's heart beat\npainfully.\n\nThen he could not suppress a low cry of exultation as Sandy's bare head\ncame out next and the two slipped into the deep shadows of another\ntepee. For minutes they did not move, then they suddenly dashed for the\npatch of brush that had covered Toma's entrance into the camp. Dick's\nfinger tightened on the trigger.\n\nThere was a commotion among one of the groups about the campfires. A\nshout sounded, then a rifle shot. The Indians began to run; they had\nseen Toma and Sandy!\n\nDick took quick aim and fired. The crack of his rifle in the silent\nforest startled the camp. Dick shot again, hurrying to another position\nas Toma had advised. He could see that Toma and Sandy had reached cover,\nand that the guide was firing on his pursuers.\n\nThe whole camp was in a turmoil now; Indians and whites hurrying hither\nand thither, shooting at the flashes of Dick's rifle. He could not hear\nwhat they were shouting to each other, but he divined they thought he\nwas quite a number of men, so fast was he firing and from so many\npositions.\n\n\"I'll hurry along toward Toma and Sandy,\" Dick muttered to himself,\n\"they'll know where I am by the sound of my rifle.\"\n\nTwenty yards further on Toma and Sandy reached him.\n\n\"Thank God you're safe at last!\" Dick embraced Sandy, while Toma kept up\nrifle fire on the Indians and whites, who were now charging after them.\n\nWith a parting salvo at their pursuers, the three made off into the\nnight toward Fort Dunwoody. All night they hurried on, hungry and tired,\nyet determined to elude Govereau if they dropped in their tracks.\n\n\"Him Govereau with Indians,\" Toma revealed to Dick. \"No see um Many-Scar\nJackson. I hear um talk much. Bear Henderson, him make north country big\nnation all his own. Give Indians back their land. Humph! Bear Henderson\ncrazy--him thief, outlaw. That Govereau bad fella too; keep um police\nfrom come up from south.\"\n\nIt did not take Sandy long to tell Dick and Toma how he had been\ncaptured by two scouts of Govereau's band, who had lain in hiding,\nlooking for a chance to attack. It had been their approach and the\nappearance of a herd of caribou going south that had frightened away the\nwolves. Dick had been right in suspecting that Sandy had walked in his\nsleep. It was almost funny to hear him tell how he had awakened,\nstruggling in the hands of his captors, dreaming they were wolves\ndevouring him.\n\nAt dawn the travelers reached the shores of a large lake, whose snow\ncovered ice stretched for leagues and leagues ahead.\n\n\"Him Badge Lake,\" Toma told them. \"We cross um ice, make journey\nshorter.\"\n\nThey stopped long enough to steep coffee and make some flapjacks. Dick\nand Toma had taken very few provisions with them when they left Gaston\nLeroi, and they now could see that they would have barely enough for\nanother meal.\n\nStill hungry, they set off across the frozen lake with many a backward\nglance to see if they were followed. But if they were, they saw no sign\nof Govereau's band. The silent forest, fading from view as they forged\nout farther and farther over the ice, disclosed no running figures on\ntheir trail.\n\n\"We cross um lake when sun set,\" Toma said. \"Maybe see moose when other\nside. We eat then.\"\n\nIt was a long jaunt across the lake. At noon they could see the other\nshore, dim and hazy to the south. With hunger gnawing at their vitals\nthey trudged the last miles across the ice, hearing now and again, a low\nrumbling roar as the lake ice cracked open for hundreds and hundreds of\nyards. Once they were held up by one of these cracks, wider than the\nrest, which they could not leap over. They had to follow this until it\ngrew narrower. Sandy slipped when they finally jumped the crack, and\nfell into the niche. At the bottom the fissure came together, and was\npartly filled with slivers of ice. Dick and Toma pulled Sandy out on the\nend of a rifle.\n\nDarkness was just falling when they reached the other shore of the lake.\nIt was with groans of thankfulness that they built a fire and dropped\ndown to rest for the night.\n\n\"I'm all in,\" Sandy sank upon his back by the fire.\n\n\"I couldn't have gone much further,\" Dick admitted.\n\nEven Toma seemed tired. They did not bother to get supper, but rolled\ninto their sleeping bags, and fell into heavy slumber, not even keeping\nwatch.\n\nDawn found them awake. They finished their provisions for breakfast, and\nagain took to the trail on the last lap to Fort Dunwoody. They had no\ntime to hunt, but kept watch among the trees for a ptarmigan or\npartridge, or bigger game if they ran across it. But they had bad luck\nand the entire day passed with no more than two ptarmigan to show for\ntheir pains.\n\nThe birds made a slender meal for the three hungry young men. Toma\nchopped out some roots that proved succulent when stewed, and they\nmanaged to fill their stomachs with this, though within an hour\nafterwards they were as hungry as ever.\n\nTwenty miles from Fort Dunwoody, at noon of the third day since the\nrescue of Sandy, they came abruptly upon a friendly Indian village at\nthe edge of a tiny lake.\n\n\"Now we'll eat!\" cried the haggard Sandy.\n\nAnd eat they did, in preparation for the last lap of their eventful\njourney, for they felt it would be a hard day on the trail.\n\n\n\n\n                             CHAPTER XXIII\n                            GRAY GOOSE LAKE\n\n\n\"The fort! The fort!\" cheered Dick, as the following evening they came\nto the edge of a vast plain.\n\nSandy was overjoyed, so much so that he could not speak.\n\nSure enough, a half mile ahead frowned the stockade of Fort Dunwoody,\nunder the rippling flag of the king. Toma did not express himself in\nwords, but hastened his tireless pace.\n\nDick and Sandy hurried after the guide, curiously gazing at the fort.\nAlong the top of the stockade they could see a red-coated policeman\npacing slowly back and forth.\n\n\"Who goes there?\" the sentry above the gate called when the worn\ntravelers appeared.\n\n\"Friends,\" cried Dick. \"We're from Fort du Lac--looking for help at Fort\nGood Faith.\"\n\n\"You the lads that helped bring in Corporal Richardson?\" the sentry\ngruffly asked.\n\n\"Yes.\"\n\nThe huge gate swung back immediately, and the young adventurers passed\nthrough. The police guard met them as the gate was closed.\n\n\"You'll want to see Inspector Dawson?\" asked the guard.\n\n\"I think he's the man we should see,\" Dick replied.\n\nPresently they were ushered into the presence of Inspector Dawson, whose\ngrim face, under a thatch of iron gray hair, broke into a smile, meant\nto be kind.\n\nDick and Sandy gave the scout salute.\n\n\"Ah, ha!\" said the Inspector, \"I see you've been members of the Boy\nScouts.\"\n\n\"Yes sir, first class, both of us,\" replied Dick, a little abashed in\nthe presence of so distinguished a man as Inspector Dawson.\n\n\"Corporal Richardson told me about you,\" went on the Inspector.\n\n\"Then the corporal got in all right,\" Dick exulted.\n\n\"Yes, thanks to you boys and Gaston Leroi,\" Inspector Dawson said.\n\"He'll be up and around in a few days now. I've already sent relief to\nFort Good Faith,\" he concluded.\n\n\"Oh!\" Dick was both glad and disappointed at once. He had hoped to join\nthe expedition.\n\n\"However, an Indian runner came in today saying that Sergeant Brewster\nand Constable Marden, the two I detailed for Fort Good Faith, were held\nup at Gray Goose Lake by one of Henderson's lieutenants and about thirty\nrenegade Indians. I believe the man's name is Pierre Govereau. He has a\ncriminal record here.\"\n\n\"Govereau!\" ejaculated Dick and Sandy in one voice.\n\n\"You seem to have met him before,\" the Inspector continued briskly. \"But\nthe point I'm getting at is this; I have no men to send on as relief to\nGray Goose Lake. I expect one of my scouts, Malemute Slade, in tomorrow\nmorning from Fort du Lac where he has cleared things up.\"\n\nAt mention of Malemute Slade, Dick and Sandy exchanged significant\nglances.\n\n\"Yes,\" the inspector continued. \"And I suppose you follows want to go on\nto Fort Good Faith. You seem to be able to take care of yourselves.\nWould you like to be special deputies?\"\n\n\"Would we!\" Dick exclaimed.\n\n\"Hurrah!\" shouted Sandy.\n\nInspector Dawson could not forbear a smile at the boys' exuberance. \"All\nright, step forward,\" he commanded, arising from his desk.\n\nDick and Sandy lined up like soldiers while they repeated the oath of\nallegiance to the law on specials duty for the duration of the Henderson\noutbreak.\n\nThe Inspector made Toma an official scout.\n\n\"Now good day, boys,\" the Inspector said dismissing them. \"Report to me\ntomorrow morning early. I expect Slade in then.\"\n\nDick and Sandy followed Toma out of headquarters seething with\nexcitement. They felt themselves full-fledged mounted policemen now,\nand, too, they were to take the trail with Malemute Slade, the famous\nscout they had met on the Big Smokey. Their only regret was that they\ncould not don the beautiful uniforms they saw everywhere about the post.\n\nThey inquired as to the quarters of Corporal Richardson, and had a long\nchat with the convalescent officer. They secured arrangements to pass\nthe night in the barracks, and once more toasted their shins before a\ngenuine stove.\n\nBright and early next morning, Dick and Sandy rolled out of their bunks\nand pulled on their clothes.\n\n\"It hardly seems possible we're at Fort Dunwoody,\" Dick declared when\nthey attacked the ample breakfast set before them by the post cook.\n\nSandy shivered in recalling the narrow escapes they had had and agreed\nwith Dick.\n\nToma, who had slept before the fire on a bearskin rug, was as silent as\nhe always was when off the trail, but his moon face was split by a\ncontinuous smile.\n\nMalemute Slade was waiting at headquarters when the boys reported as\ninstructed. His dog team of six huge huskies stood in front of the\nInspector's office, harnessed to the sled, ready for the trail.\n\nDick and Sandy were pleased to find that Malemute Slade remembered them.\nHis dark, wind-hardened face lighted up pleasantly, as he shook hands\nwith his future trail mates.\n\n\"Wal, I swan,\" he exclaimed, \"I guess we'll do some tall fightin' now.\"\n\nDick and Sandy assured him they were with him with all they had to\noffer, and after Inspector Dawson had wished them good luck, they mushed\nacross the parade square to the stockade gate, which swung slowly open\nfor them.\n\nHour after hour the relief detachment from the post traveled northward.\nMalemute Slade would not permit the boys to sleep longer than five\nhours. Long before dawn they were up, had eaten a hasty breakfast, while\nthe dogs wolfed their daily frozen fish, and had hit the trail again.\nDick and Sandy had grown almost as trail hardened as Toma on their long\ntrip from Fort du Lac to Fort Dunwoody, and they did not complain at the\nterrific pace set by Malemute Slade.\n\nOn the afternoon of the third day, more than a hundred miles north of\nFort Dunwoody, they saw from the top of a ridge the white, level expanse\nof Gray Goose Lake. They had not been molested along the way and they\ndecided that Govereau was doing all his fighting at Gray Goose Lake.\n\nAround the lake they broke into rough and serrated country, through\nwhich they proceeded cautiously. Soon they heard the faint report of\nrifles, by which they located the scene of combat.\n\nMalemute Slade led the way up a long ravine where they left the dog team\nin charge of Toma and went on under cover of whatever they found.\n\n\"Follow me, lads, an' don't fire till I give the word,\" Malemute Slade\nordered.\n\n\"Look! There they are!\" whispered Dick a moment later as they reached\nthe top of the ravine.\n\nOn a rocky knoll, overlooking Gray Goose Lake, they could see the\noccasional puff of two rifles. All around the bottom of the little hill\nwere hidden Govereau's men, flanked by a deep gorge on their left.\n\n\"Now, lads, we'll take 'em on the run. Shoot an' holler all you can,\"\nMalemute Slade's drawling voice calmed them.\n\nDick and Sandy tensed for the coming skirmish, tightening their grips of\ntheir rifles.\n\n\"Ready,\" called Malemute Slade. \"Here we go.\"\n\nThey broke from cover and ran yelling like an army across the space that\nseparated them from Govereau's party. The Indians turned and shouted,\nseeming paralyzed with surprise. The besieged policemen, on the hill,\nseeing reinforcements, also charged, leaping from their hiding place and\nfiring as they came.\n\nAttacked from two sides, Govereau's band broke and fled.\n\n\"There's Govereau!\" cried Dick.\n\n\"An' here's where one dirty skunk cashes in,\" shouted Malemute Slade,\nraising his high-powered rifle. At the report of the rifle, Govereau\nfell, Dick and Sandy rushing past his body in pursuit of the others.\n\nDick barely had witnessed the fall of Govereau before he caught sight of\nToma stalking an Indian, who was trying to crawl away among the bushes.\n\n\"Halt, in the king's name!\" commanded Dick, as he recognized the skulker\nto be no other than Many-Scar Jackson.\n\nBut the scar faced Indian did not halt. He broke into a run toward the\ndeep gorge on the left, Toma in hot pursuit, and Dick and Sandy close\nbehind.\n\nSuddenly Dick stopped dead in his tracks, Sandy almost falling over him.\n\"Toma!\" he called, but the guide did not seem to hear.\n\n\"He's going to avenge his brother's death,\" Sandy exclaimed, pushing\nahead.\n\n\"Stop!\" Dick hauled his chum back. \"Toma doesn't want us to interfere.\nIt's his fight. If we see he's getting the worst of it, then we'll\nhelp.\"\n\nSandy drew back and with pale faces they watched the two Indians come\ntogether and draw their knives in a duel to the death.\n\nAround and around they circled before Toma darted in like a flash and\ndrew blood. But Many-Scar made a stab in return, and they saw Toma reel\na little. Then the two clinched, staggered this way, then that, their\nknife blades locked.\n\n\"Many-Scar has him!\" Sandy suddenly exclaimed, raising his rifle.\n\n\"Wait!\" Dick cried.\n\nFor a moment it had seemed as if the scar faced Indian would plunge his\nknife into Toma's breast, but the agile young guide twisted suddenly,\nlike a snake, and Many-Scar was tripped to his knees.\n\nThen as Toma leaped in to follow up his advantage, Many-Scar whirled\naway, leaped to his feet and once more they circled.\n\n\"Many-Scar is getting the worst of it,\" Dick breathed a few moments\nlater.\n\n\"He sure is,\" agreed Sandy exultingly.\n\nToma's enemy plainly was weakening. Dick and Sandy prepared to see the\nfinal thrust, when of a sudden the scar faced Indian broke away and ran\nlike the wind straight toward the gorge.\n\n\"They'll fall into the gorge!\" Dick cried, starting to run toward them.\n\nBut Many-Scar Jackson and Toma, too, seemed uncognizant of any immediate\ndanger from a fall. Many-Scar ran like a deer, and as he reached the\nedge, he leaped into the air. Like a bird he soared across the space\nbetween the two cliffs, landing safely on the other side, where he\nvanished into the bushes.\n\n\"What a jump!\" exclaimed Dick.\n\n\"I can't believe it,\" Sandy said amazedly. \"Why, it was a broad jump\nrecord. It's nearly thirty feet between the cliffs.\"\n\nToma had halted on the brink of the cliff and the boys saw him raise\nclinched fists to the sky. Toma had failed this time, but, somehow, the\nboys felt sure there was another time coming.\n\nBehind them Malemute Slade was calling. They rejoined the victorious\nmounted police, Toma tardily returning.\n\nPresently they were behind the dogs on the trail to Fort Good Faith,\ntheir party now increased to five with Sergeant Brewster and Constable\nMarden.\n\n\"I hope Uncle Walter has been able to hold out this long,\" Sandy\nwhispered to himself as he ran after the waving tails of the huskies.\n\n\n\n\n                              CHAPTER XXIV\n                        CHIEF BLACK DOG'S SCHEME\n\n\n\"We're coming into an Indian village,\" Dick called to Sandy, when the\nparty reached the top of a long ridge.\n\nSandy, who was some distance in the rear, hurried up and joined Dick. A\nvillage of nearly a score of tepees lay ahead, the smoke of a number of\ncampfires rising here and there.\n\nSergeant Brewster, who had taken command, explained that he was about to\nenlist the tribe's aid in an effort at retaking Fort Good Faith.\n\n\"Chief Black Dog is a good friend of the mounted,\" said Sergeant\nBrewster, \"and he'll let us have a few warriors. I suppose Henderson has\ntried to get the old fellow on his side, but chief is loyal.\"\n\nThey entered the village, and had some trouble with the numberless\nIndian dogs that rushed out savagely from behind the tepees and attacked\nthe huskies. Presently several Indians came and called off the dogs,\nthrowing stones and sticks at them.\n\nSergeant Brewster addressed one of the braves: \"Tell Chief Black Dog a\nman from the Great White Father has come to see him.\"\n\nThe buck hurried away, and soon returned, saying the chief would be glad\nto see him, in fact had invited them all to his council tepee.\n\nLeaving Toma to look after the dogs, Dick and Sandy followed Malemute\nSlade and the policemen to a tepee much larger than the rest. The\nentrance was so high that even Malemute Slade entered erect.\n\n\"Gosh, it's dark,\" whispered Sandy, when the tepee flap closed behind\nthem.\n\nThe only light in the tepee was a tiny fire glowing in the center.\nBefore this Dick and Sandy could make out three shadowy figures. The one\nin the center was an aged Indian with snow white hair. He was Chief\nBlack Dog.\n\n\"The white brother comes from the Great White Father. It is good. Peace\nwith white brother,\" the old chief spoke.\n\n\"We bring presents from the great chief to the big chief,\" Sergeant\nBrewster announced, drawing from his mackinaw pockets a fine pocket\nknife and a shining tobacco box.\n\nDick and Sandy could see the old chief's eyes glitter as they fell upon\nthe gifts.\n\n\"It is good,\" said Chief Black Dog, accepting the presents.\n\nThe sergeant also gave something to each of the two chiefs seated on\neither side of Chief Black Dog, for which they muttered thanks.\n\n\"What will the white brother have?\" the chief spoke again.\n\n\"We wish help to fight the bad outlaw, Bear Henderson,\" answered the\nsergeant. \"He has taken Fort Good Faith from the good factor Walter\nMacClaren.\"\n\n\"It is good. My warriors are brave. They go with you.\"\n\nSergeant Brewster thanked the old chief, then waited for dismissal.\nChief Black Dog sat looking into the fire for a time, his deep eyes\nmeditative. The boys watched curiously. The chief seemed to be thinking.\nAt length he spoke:\n\n\"The red man would know how many braves the bad chief Henderson fights\nwith. Some my warriors, young and foolish, with Henderson. I send\nwarrior in night. He go make believe join Henderson. He find his\nbrothers there. He find out how many braves hold fort. Come tell me. He\nfind where big chief MacClaren in prison. We know how to fight better\nthen.\"\n\n\"The red man's words are wise,\" replied the sergeant.\n\n\"It is good,\" the chief said, turning to the chief on his left and\nspeaking swiftly in his native tongue.\n\nThe other chief rose and quietly left the tepee.\n\n\"White brother's men stay, wait for spy, when he come back. One night\nmaybe. Then we know all.\" He waved a withered hand in dismissal.\n\nDick and Sandy welcomed the open air, when once again they stepped into\nthe sunlight. At the sergeant's orders they helped Toma unharness the\ndogs.\n\nChief Black Dog assigned two tepees to the party from Fort Dunwoody.\nDick, Sandy and Toma took one, the mounted policemen the other. An hour\nlater the boys watched the spy leave for Fort Good Faith, while the war\ndrums of the tribe summoned the braves to battle.\n\nIt was an exciting evening the boys passed, watching the warriors in\ntheir fantastic dances. When at last they went to their tepee to rest,\nthey were tired, but could not sleep. The wait for news from Fort Good\nFaith was proving to be a trying one. So near Sandy's uncle, yet under\norders to remain idle, the boys chafed and worried.\n\n\"I can't stand it,\" Sandy cried. \"I want to get there and have it over\nwith.\"\n\n\"I know just how you feel,\" sympathized Dick. \"I want to smell powder\ntoo. But I believe the chief made a wise move, at that. What do you\nthink, Toma?\"\n\nToma's dark face, lighted by the fire, brightened. \"Him wise chief,\"\nsaid Toma. \"My father know him long ago when they hunt on Saskatchewan\nRiver.\"\n\n\"Tell us a story about the old days, Toma,\" Dick pleaded, as he squatted\nby the fire, \"--an Indian story.\"\n\n\"Yes, do,\" Sandy chimed in.\n\nThe young guide seemed to be looking far away as he stared into the\nglowing coals. Outside, the war drums and the cries of the dancing\nwarriors echoed in the forest aisles.\n\n\"I tell story my father tell me long ago, when I little boy,\" Toma\nbegan. \"Big medicine man tell my father. It is story of Saskatchewan\nRiver and Great Bear, mighty hunter of the Crees.\n\n\"Long ago, by Saskatchewan live big tribe. One hunter, one Great Bear,\nhe mightier than all big hunters. Him not like Saskatchewan country. Him\nwant travel far, far--where sun goes down.\n\n\"Big medicine man, one Two-Horns-in-the-Bone not want lose Great Bear,\ngreat hunter. Him try keep Great Bear home. But Great Bear don't care.\nHe go anyway, he say.\n\n\"Then Great Bear get ready go far away. When start,\nTwo-Horns-in-the-Bone go 'long little way with Great Bear, so Great\nSpirit be with him in far lands. They stop on bank of Saskatchewan,\nmighty river. Great Bear, lie thirsty. He kneel down, fill up with\nwater. Two-Horns-in-the-Bone make sign over him, big medicine sign. When\nGreat Bear get up, medicine man say:\n\n\"'They who drink waters of Saskatchewan shall return before they die.'\n\n\"Great Bear, him laugh. Him think Two-Horns-in-the-Bone make fun. Great\nBear young, strong; he laugh at Great Spirit, like him laugh at grizzly.\nHim leap in Saskatchewan an' swim across. Him wave spear goodbye to\nmedicine man, an' turn back on Saskatchewan.\n\n\"Two-Horns-in-the-Bone go back to tepee. Say nothing. Him very wise.\n\n\"Many moons pass. Great Bear go far, far away--to Big Sea, to desert, to\nother side of sunset. He fight many battles, always win.\n\n\"Medicine man by Saskatchewan, him wait an' smoke long pipe. Twenty\nwinters gone by, then spring come. Two-Horns-in-the-Bone walk down to\nSaskatchewan. He wait all day. When sunset come he see old man walking.\nOld man all bent over, white hair, hobble on stick.\nTwo-Horns-in-the-Bone watch. Old man come down to edge of water. Him\nkneel down and drink. Then he go back and lay down.\n\n\"Two-Horns-in-the-Bone go to old man. Him speak, him look in face. Old\nIndian, him Great Bear. Old medicine man raise face to sky. 'The Great\nSpirit has spoken,' say Two-Horns-in-the-Bone. 'They who drink waters of\nSaskatchewan shall return before they die.'\"\n\nToma's voice died out. The young Indian seemed to be in another land, as\nhe thought of his father's people. Dick and Sandy sat spell-bound.\n\n\"It is the Legend of the Saskatchewan,\" Dick said in a hushed voice.\n\n\"It sure was a good story,\" said Sandy. \"Tell us another one, Toma.\"\n\nBut Toma shook his head. Dick and Sandy saw a certain sadness in his\nface, that the legend had aroused, and they did not urge him. Presently\nthey rolled into their blankets. Once asleep, they did not awaken until\nsummoned by Sergeant Brewster.\n\nAs they hurried from the tepee on the morning of that day which was to\nmean so much, an inspiring sight greeted their eyes.\n\n\n\n\n                              CHAPTER XXV\n                         THE ATTACK ON THE FORT\n\n\nThe tepees of the Indian village were arranged in a hollow square, and\nin the midst of this were gathered more than fifty warriors, arrayed for\nbattle.\n\n\"Isn't it a fearful sight!\" exclaimed Sandy.\n\n\"I'd hate to have them catch me alone in the forest,\" Dick responded.\n\n\"They'll help us do for Henderson,\" Sergeant Brewster remarked at their\nelbow. \"The spy came in an hour ago. He reports that Henderson has about\nten half-breeds and thirty Indians holding the fort. They don't dream of\nan attack. Henderson thinks Govereau is taking care of the police.\"\n\n\"Did the spy find out anything about Uncle Walter?\" Sandy queried\nanxiously.\n\n\"I was coming to that,\" continued the sergeant. \"It seems that Henderson\nhas imprisoned him in a cave about a mile from the fort. The spy\nbelieves he can find the cave from what he overheard while inside the\nstockade. I'll detail you fellows to go after the factor. But don't\nleave until we're sure we've taken the fort--that comes first. Toma and\nMalemute Slade will accompany, with the spy as a guide.\"\n\nThey were interrupted by Malemute Slade and Constable Marden driving up\nwith the dog team.\n\n\"Wal, boys,\" grinned Malemute Slade, \"we're off for another tussle. As\nf'r me I can't get to it too soon.\"\n\nDick and Sandy laughed and fell into line. The band of Indians already\nhad started out. They left the village amid the lamentations of Indian\nwomen and the loud barking of the dogs.\n\nThey traveled slowly, Sergeant Brewster explaining that they must not\nreach Fort Good Faith until nightfall, if they were to surprise\nHenderson. Scouts were sent on ahead to report any appearance of\nHenderson's men.\n\nJust before dark the war party came to a halt on the slope of a hill,\nfrom the top of which they could see Fort Good Faith not far away. Dick\nand Sandy gazed upon the stockade in awe. They had traveled more than\nsix hundred miles since leaving Fort du Lac, and at last within sight of\nthe post, they felt rewarded for all the hardships they had gone through\nin an effort to rescue Sandy's uncle.\n\n\"We'll have to keep out of sight till after dark--that's all that\nbothers me,\" chafed Sandy. \"I wish we were climbing the stockade right\nnow.\"\n\nSergeant Brewster called to them just then. \"Here's the spy,\" he\npresented a somber Indian. \"He'll stay close by you until it's time for\nyou to go after your uncle. Take your orders from Malemute Slade.\"\n\nWorked up to a frenzy by their war dances, the warriors were eager to\nattack, and it was all the policemen and the chiefs could do to hold\nthem back until nightfall.\n\nThe minutes seemed like hours. But darkness slowly fell, and the hour of\nthe attack approached. The Indians grew quieter then. At a word from the\nsergeant the war party started on toward the fort.\n\nAll was silent until they were under the very walls of the stockade,\nthen the Indians gave vent to a horrible war cry, and like so many\nchipmunks clambered over the stockade. The first inside rushed the guard\nat the gate and swung it open for the rest of the party. Rifles and\nrevolvers flashed in the darkness everywhere, and combined with the\ncries of the Indians, made a deafening racket.\n\nDick dropped down from the top of the palisades on the heels of Malemute\nSlade, Sandy and Toma following him. Suddenly he heard Sandy cry out:\n\n\"Help, Dick!\"\n\nDick turned and ran toward the sound, his rifle clubbed in his hands. In\nthe gloom he could see Sandy struggling in the grip of a brawny\nhalf-breed, Dick's gun stock swept down, and Sandy's adversary rolled\nover and lay still.\n\n\"Come on, Sandy. Let's not lose Malemute,\" Dick called.\n\nThey could see the policemen concentrating their attack on the door of\nthe post residence, which had been hastily barricaded.\n\n\"Up an' at 'em,\" Malemute bellowed as he rushed to join the mounted\npolice. Three half-breeds leaped out of the shadows and barred the big\nscout's way. Malemute fired once, swung his fists twice, and the\nhalf-breeds were trampled underfoot.\n\nThe surprise attack was over as quickly as it had begun. Dick and Sandy\nsaw a huge, long-haired man come to the door in answer to the sergeant's\ndemand for surrender, and watched the handcuffs snapped upon the\noutlaw's wrists. It was the first look at the man behind all the\ntrouble. Henderson's name fitted him, they decided. He looked much like\na grizzly in man's clothing.\n\n\"That wasn't half a fight,\" Malemute Slade complained. \"Now if that\npesky spy would show up we'd skip out for the prisoner.\"\n\n\"There he is!\" Dick exclaimed.\n\nThe Indian spy and Toma both were approaching at a run.\n\n\"Lead on there,\" Malemute sang out to the spy. \"We'll be a'ter the\nfactor now--double quick.\"\n\nLed by the spy, the five left the stockade in the hands of the mounted\npolice, and hurried off into the night.\n\nIt was hard going through the deep snow, but the spy seemed to be sure\nof the way. Only once did the Indian seem confused. Then he paused while\nthe rest waited impatiently. Then they were off again.\n\nPresently they came to a narrow canyon. Dick, Sandy and Toma were\nrunning close together. Malemute Slade and the Indian spy were slightly\nin the lead.\n\nSuddenly the spy stopped dead, emitting a guttural exclamation.\n\n\"Down!\" cried Malemute.\n\nScarcely had all five dropped flat when a hoarse voice sounded,\nseemingly out of the wall of the canyon:\n\n\"Who's there?\"\n\n\"You'll shore find out in a minute,\" retorted Malemute boldly. \"Jest\ncome out where we can see the color o' y'r whiskers.\"\n\n\"If you think much of y'r hide you better skidaddle,\" replied the voice,\nthreateningly.\n\n\"Haw, haw,\" called Malemute. \"You'll be the one to do the skidaddlin'\nwhen we finish with yuh.\"\n\nSilence followed, while Dick strained his eyes to see from whence the\nvoice came.\n\n\"It's from the cave,\" Sandy whispered.\n\nNerves at snapping pitch, the young adventurers awaited the orders of\nthe scout, who was mumbling to himself. Malemute was about to order a\nblind advance, when four dark forms leaped out of the rocks behind them.\nDick Kent had a momentary vision of Malemute Slade pinned under two men,\nthen something crashed down upon his head and all went black.\n\n\n\n\n                              CHAPTER XXVI\n                            LOST UNDERGROUND\n\n\nDick Kent regained consciousness slowly. His head pained severely, and\nas he passed his hand through his hair his fingers encountered something\nwarm and sticky. All was silent in the canyon. He sat up with a start,\nall coming back to him--the mysterious voice from the canyon wall, the\nsurprise attack, the blow that had felled him.\n\n\"Sandy! Sandy!\" he shouted hoarsely. But the dark canyon gave back his\nvoice in a hollow echo. There was no answer.\n\n\"Where have they gone?\" Dick wondered. \"Have they been killed or\ncaptured?\"\n\nHe got dizzily to his feet and stumbled along the canyon, feeling his\nway. Almost immediately, he felt a depression in the rock. In the\nstarlight a dark hole yawned in the wall.\n\n\"The cave!\" he exulted.\n\nJust then he stumbled over something solid, yet yielding. Groping about\nhis feet, he recoiled in horror. It was the face of a man! In the\nstarlight he finally made out the body, and saw that it was not one of\nhis party.\n\nAgain Dick called out Sandy's name, but only the echo of his voice from\nthe yawning cavern answered him.\n\nDick's head was clearing now. He thought swiftly and concluded his\ncompanions must have gone into the cavern in search of Walter MacClaren.\nHe turned in and groped his way along, calling every now and then. Once\nhe thought he heard a shout and stopped, but all was silent.\n\nHe had a few matches in his pocket and he drew one out and lighted it.\nHe found himself in a large cave, evidently formed by the erosion of\nwater. The roof of the cavern was some six feet higher than his head.\nWhere he was standing there seemed but one passage.\n\n\"Well, I can't get lost if there's only the main passage,\" Dick decided,\nand started on boldly, feeling his way in the blackness.\n\nThe cavern slanted downward slightly, and leading forward fairly\nstraight, Dick made good time, though he tested every bit of footing to\nmake certain he did not step off into a hole, or run into an\nobstruction.\n\nPresently he could hear running water, and as the sound grew louder, he\nlighted another match. There was no disturbance of air and the flame\nburned steadily. Dick could see that the cavern branched at this point.\nDown one passage a swift stream of dark water flowed; the other was dry.\n\nAbout to take to the cavern that was dry underfoot, Dick heard a shout\nsomewhere in the cave before him. He thrilled as he recognized Sandy's\nvoice.\n\n\"Sandy, Sandy, here I am!\" he answered at the top of his lungs, hurrying\ndown the cavern from which he believed the voice had come. Once more he\nheard Sandy's shout, but this time it was fainter. Then he heard it no\nlonger.\n\n\"There must be tracks if anyone has passed here,\" Dick thought, and\nstriking a match, stooped down. Plainly, in the moist floor of the\ncavern, were the tracks of moccasins. But they were directed both\nforward and back, and meant very little.\n\nThinking to catch Sandy before he was too far away, Dick hastened\nforward with less caution. He had advanced some fifty yards, when of a\nsudden the earth gave way under him. His cry of terror was drowned by\nthe sound of falling stones and gravel, as he pitched downward. His\nclutching hands encountered a rim of solid rock. With a painful jerk he\nstopped his fall, dangling there by his fingers over a chasm he knew not\nhow deep.\n\nOnce he regained his breath and sense, he endeavored to pull himself up.\nBut he could not quite make it. The hole bulged outward under his feet\nand, kick and thresh as he would, he could not get a foothold anywhere.\nThe rim he was clinging to was so narrow that it was impossible for him\nto hold his body up on it even if he pulled himself up by the hands. He\nrealized that he was part way down the hole, hanging to the conical\nwall.\n\nDick's struggles slowly weakened. His head was paining him severely. He\nrealized that he could not hang on much longer, yet gritting his teeth,\nhe clung on while his muscles burned and his fingers grew numb.\n\nWith his last remaining strength, he shouted. But it seemed that his\nvoice was deadened by the formation of the hole, as if he had shouted\ninto a barrel. But again and again he raised his voice, though it grew\nweaker and weaker.\n\nHe did not know whether he imagined it or not, but he thought his last\noutcry received an answer. Slowly he was losing consciousness. It seemed\nthat he could hear the pad, pad of moccasins and more voices. A hand\ngrasped his wrists, then he gave out.\n\nWhen once more Dick awakened he found himself in a dimly lighted\nunderground room. Some one was pouring something hot between his teeth.\n\n\"Sandy!\" he started up, looking into his chum's happy face.\n\n\"Greetin's, lad,\" called Malemute Slade, smiling down from the other\nside of him, \"you've had a tough time of it.\"\n\n\"I thought it was all over with as far as I was concerned,\" replied\nDick.\n\n\"Uncle Walter is here, but he's pretty sick,\" Sandy was telling him. \"We\nfound him in this room, almost dead from starvation. He seems to be a\nlittle better since we fed him some hot broth.\"\n\nDick raised up, his aching head swimming. Across the room, watched over\nby Toma, on a heap of balsam boughs, he saw a bearded man, haggard of\nface. It was Walter MacClaren.\n\n\"I guess I can stand on my pins now,\" declared Dick. \"But where did you\nall go right after I was knocked out?\"\n\n\"The devils drove us right into the cave,\" volunteered Malemute Slade.\n\"It was a running fight till I climbed on a shelf of rock an' dropped\ndown on the beans of a couple of 'em. I cracked their pates, then we\nchoked the other one till he told us where the lad's uncle was. Me--I\nguess I've got about all I want of fightin' for today.\"\n\n\"I heard you shouting,\" Sandy explained, \"but you were in the wrong\nbranch of the cavern. I had to go clear down to the fork before I found\nwhere you were. You had just about let go of the rock. I was scared to\ndeath when I had pulled you out. I struck a match--and say!--that hole\ndidn't seem to have any bottom.\"\n\nDick shuddered, but smiled grimly. He had had a close shave--they had\nall had a close shave--but things had come out right in the end.\n\nMalemute Slade had located the store of food kept by MacClaren's guards,\nand they sat down and had a bite to eat. Then, they all gathered\nanxiously around Walter MacClaren. With eyes shining, Sandy stooped\nforward and patted his uncle's hand.\n\n\"Everything is all right now,\" the youth muttered happily. \"I'm sure\nthat Uncle Walt will get better.\"\n\nFor several minutes they stood there in the half-light, looking down at\nthe recumbent figure of the man, whose life they had saved barely in the\nnick of time. Except for their quiet breathing and the low trickle of\nwater in an alcove close at hand, the deep hush remained unbroken. Then,\nunexpectedly, MacClaren stirred, muttering in his sleep. His eyes\nblinked open.\n\nHis gaze wavered from one to the other of the little company gathered\naround him, and slowly a smile played across his lips.\n\n\"Up in a few days,\" he managed to articulate weakly. \"Thanks--everyone\nof you! I'll be feeling fine in the morning.\"\n\nThen, with another smile, he rolled over on his side and went back to\nsleep. In a surge of new-found happiness, Dick nodded significantly at\nSandy, and, arm-in-arm, they turned quietly and tip-toed out of the\nroom.\n\n\n                                THE END\n\n\n\n\n                          Transcriber's Notes\n\n\n--Copyright notice provided as in the original--this e-text is public\n  domain in the country of publication.\n\n--Silently corrected palpable typos; left non-standard spellings and\n  dialect unchanged.\n\n--Added a Table of Contents based on chapter headings.\n\n--In the text versions, delimited italics text in _underscores_ (the\n  HTML version reproduces the font form of the printed book.)", "title": "Dick Kent with the Mounted Police"}