{"summary": "The novel is set during May and June 1914; war was evident in Europe, Richard Hannay the protagonist and narrator, an expatriate Scot, returns to his new home, a flat in London, after a long stay in Rhodesia, in order to begin a new life. One night he is buttonholed by a stranger, a well-travelled American, who claims to be in fear for his life. The man appears to know of an anarchist plot to destabilise Europe, beginning with a plan to assassinate the Greek Premier, Constantine Karolides, during his forthcoming visit to London. The man reveals his name to be Franklin P. Scudder, a freelance spy, and remarks that he is dead, which holds Hannay's attention. Scudder explains that he has faked his own death in order to avert suspicion. Scudder claims to be following a ring of German spies called the Black Stone who are trying to steal British plans for the outbreak of war. Hannay lets Scudder hide in his flat, and sure enough the next day another man is discovered having apparently committed suicide in the same building. Four days later Hannay returns home to find Scudder dead with a knife through his heart.\nHannay fears that the murderers will come for him next, but cannot ask the police for help because he is the most likely suspect for the murders because he lived in the same building. Not only does he want to avoid imprisonment, but he also feels a duty to take up Scudder's cause and save Karolides from the assassination, planned in three weeks' time. He decides to go into hiding in Scotland and then to contact the authorities at the last minute. In order to escape from his flat unseen, he bribes the milkman into lending him his uniform and exits wearing it, escaping from the German spies watching the house. Carrying Scudder's pocket-book, he catches an express train leaving from London St. Pancras station. Hannay fixes upon Galloway, in south-west Scotland, as a suitably remote place in which to make his escape and remembers somehow the town of Newton-Stewart, which he names as his destination when he buys his ticket from the guard.\nArriving at a remote station somewhere in Galloway (apparently not Newton Stewart itself), Hannay lodges in a shepherd's cottage. The next morning he reads in a newspaper that the police are looking for him in Scotland. Reasoning that the police would expect him to head for a port on the West Coast, he doubles back and boards a local train heading east, but jumps off between stations. He is seen but escapes, finding an inn where he stays the night. He tells the innkeeper a modified version of his story, and the man is persuaded to shelter him. While staying at the inn, Hannay cracks the substitution cipher used in Scudder's pocket-sized book. The next day two men arrive at the inn looking for Hannay, but the innkeeper sends them away. When they return later, Hannay steals their car and escapes.\nOn his way, Hannay reflects on what he has learnt from Scudder's notes. They contradict the story that Scudder first told to him, and mention an enemy group called the Black Stone and the mysterious Thirty-nine Steps. The United Kingdom appears to be in danger of an invasion by Germany and its allies. By this time, Hannay is being pursued by an aeroplane, and a policeman in a remote village has tried to stop him. Trying to avoid an oncoming car, Hannay crashes his own, but the other driver offers to take him home. The man is Sir Harry, a local landowner and prospective politician, although politically very naïve. When he learns of Hannay's experiences in South Africa, he invites him to address an election meeting that afternoon. Hannay's speech impresses Sir Harry, and Hannay feels able to trust him with his story. Sir Harry writes an introductory letter about Hannay to a relation in the Foreign Office.\nHannay leaves Sir Harry and tries to hide in the countryside, but is spotted by the aeroplane. Soon he spots a group of men on the ground searching for him. Miraculously, he meets a road mender out on the moor, and swaps places with him, sending the workman home. His disguise fools his pursuers, who pass him by. On the same road he meets, in a passing touring car, a Society sycophant whom he recognizes from London and whom he forces to exchange clothes with him and drive him off the moor.\nThe next day, Hannay manages to stay ahead of the pursuers, and hides in a cottage occupied by an elderly man. Unfortunately, the man turns out to be one of the enemy, and with his accomplices he locks Hannay into his storage room. Fortunately, the room in which Hannay is locked is full of bomb-making materials, which he uses to break out of the cottage, injuring himself in the process.\nA day later, Hannay retrieves his possessions from the helpful road mender and stays for a few days to recover from the explosion. He dines at a Public House in Moffat before walking to the junction at Beattock to catch a southbound train to England, changing at Crewe, Birmingham New Street and Reading, to meet Sir Harry's relative at the Foreign Office, Sir Walter Bullivant, at his country home in Berkshire. As they discuss Scudder's notes, Sir Walter receives a phone call to tell him that Karolides has been assassinated.\nSir Walter, now at his house in London, lets Hannay in on some military secrets before releasing him to go home. Hannay is unable to shake off his sense of involvement in important events, and returns to Sir Walter's house where a high-level meeting is in progress. As one of the men, ostensibly the First Sea Lord, leaves the meeting, Hannay recognizes him as one of his former pursuers in Scotland. Hannay warns Sir Walter and the other officials that the man was an impostor, and they realise the spy is about to return to Europe with the information he has obtained from their meeting. At that point, Hannay realises that the phrase \"the thirty-nine steps\" could refer to the landing-point in England from which the spy is about to set sail. Throughout the night, Hannay and the British military leaders try to work out the meaning of the mysterious phrase.\nAfter some reasoning worthy of Sherlock Holmes, and with the help of a knowledgeable coastguard, the group decide on a coastal town in Kent. They find a path down from the cliff that has thirty-nine steps. Just offshore they see a yacht. Posing as fishermen, some of the party visit the yacht, the Ariadne, and find that at least one of the crew appears to be German. The only people onshore are playing tennis by a villa and appear to be English, but they match Scudder's description of the conspirators, The Black Stone. Hannay, alone, confronts the men at the villa. After a struggle, two of the men are captured while the third flees to the yacht, which meanwhile has been seized by the British authorities. The plot is thwarted, and the United Kingdom enters the First World War, having kept its military secrets from the enemy.\nOn the outbreak of war, Hannay joins the New Army and is immediately commissioned captain.\n\n", "full_text": "THE THIRTY-NINE STEPS\n\n\nby\n\nJOHN BUCHAN\n\n\n\n\nTO\n\nTHOMAS ARTHUR NELSON\n\n(LOTHIAN AND BORDER HORSE)\n\nMy Dear Tommy,\n\nYou and I have long cherished an affection for that elemental type of\ntale which Americans call the 'dime novel' and which we know as the\n'shocker'--the romance where the incidents defy the probabilities, and\nmarch just inside the borders of the possible.  During an illness last\nwinter I exhausted my store of those aids to cheerfulness, and was\ndriven to write one for myself.  This little volume is the result, and\nI should like to put your name on it in memory of our long friendship,\nin the days when the wildest fictions are so much less improbable than\nthe facts.\n\nJ.B.\n\n\n\nCONTENTS\n\n  1.  The Man Who Died\n  2.  The Milkman Sets Out on his Travels\n  3.  The Adventure of the Literary Innkeeper\n  4.  The Adventure of the Radical Candidate\n  5.  The Adventure of the Spectacled Roadman\n  6.  The Adventure of the Bald Archaeologist\n  7.  The Dry-Fly Fisherman\n  8.  The Coming of the Black Stone\n  9.  The Thirty-Nine Steps\n 10.  Various Parties Converging on the Sea\n\n\n\nCHAPTER ONE\n\nThe Man Who Died\n\nI returned from the City about three o'clock on that May afternoon\npretty well disgusted with life.  I had been three months in the Old\nCountry, and was fed up with it.  If anyone had told me a year ago that\nI would have been feeling like that I should have laughed at him; but\nthere was the fact.  The weather made me liverish, the talk of the\nordinary Englishman made me sick. I couldn't get enough exercise, and\nthe amusements of London seemed as flat as soda-water that has been\nstanding in the sun.  'Richard Hannay,' I kept telling myself, 'you\nhave got into the wrong ditch, my friend, and you had better climb out.'\n\nIt made me bite my lips to think of the plans I had been building up\nthose last years in Bulawayo.  I had got my pile--not one of the big\nones, but good enough for me; and I had figured out all kinds of ways\nof enjoying myself.  My father had brought me out from Scotland at the\nage of six, and I had never been home since; so England was a sort of\nArabian Nights to me, and I counted on stopping there for the rest of\nmy days.\n\nBut from the first I was disappointed with it.  In about a week I was\ntired of seeing sights, and in less than a month I had had enough of\nrestaurants and theatres and race-meetings.  I had no real pal to go\nabout with, which probably explains things.  Plenty of people invited\nme to their houses, but they didn't seem much interested in me.  They\nwould fling me a question or two about South Africa, and then get on\ntheir own affairs.  A lot of Imperialist ladies asked me to tea to meet\nschoolmasters from New Zealand and editors from Vancouver, and that was\nthe dismalest business of all.  Here was I, thirty-seven years old,\nsound in wind and limb, with enough money to have a good time, yawning\nmy head off all day.  I had just about settled to clear out and get\nback to the veld, for I was the best bored man in the United Kingdom.\n\nThat afternoon I had been worrying my brokers about investments to give\nmy mind something to work on, and on my way home I turned into my\nclub--rather a pot-house, which took in Colonial members.  I had a long\ndrink, and read the evening papers.  They were full of the row in the\nNear East, and there was an article about Karolides, the Greek Premier.\nI rather fancied the chap.  From all accounts he seemed the one big man\nin the show; and he played a straight game too, which was more than\ncould be said for most of them.  I gathered that they hated him pretty\nblackly in Berlin and Vienna, but that we were going to stick by him,\nand one paper said that he was the only barrier between Europe and\nArmageddon.  I remember wondering if I could get a job in those parts.\nIt struck me that Albania was the sort of place that might keep a man\nfrom yawning.\n\nAbout six o'clock I went home, dressed, dined at the Cafe Royal, and\nturned into a music-hall.  It was a silly show, all capering women and\nmonkey-faced men, and I did not stay long.  The night was fine and\nclear as I walked back to the flat I had hired near Portland Place.\nThe crowd surged past me on the pavements, busy and chattering, and I\nenvied the people for having something to do.  These shop-girls and\nclerks and dandies and policemen had some interest in life that kept\nthem going.  I gave half-a-crown to a beggar because I saw him yawn; he\nwas a fellow-sufferer.  At Oxford Circus I looked up into the spring\nsky and I made a vow.  I would give the Old Country another day to fit\nme into something; if nothing happened, I would take the next boat for\nthe Cape.\n\nMy flat was the first floor in a new block behind Langham Place.  There\nwas a common staircase, with a porter and a liftman at the entrance,\nbut there was no restaurant or anything of that sort, and each flat was\nquite shut off from the others.  I hate servants on the premises, so I\nhad a fellow to look after me who came in by the day.  He arrived\nbefore eight o'clock every morning and used to depart at seven, for I\nnever dined at home.\n\nI was just fitting my key into the door when I noticed a man at my\nelbow.  I had not seen him approach, and the sudden appearance made me\nstart.  He was a slim man, with a short brown beard and small, gimlety\nblue eyes.  I recognized him as the occupant of a flat on the top\nfloor, with whom I had passed the time of day on the stairs.\n\n'Can I speak to you?' he said.  'May I come in for a minute?'  He was\nsteadying his voice with an effort, and his hand was pawing my arm.\n\nI got my door open and motioned him in.  No sooner was he over the\nthreshold than he made a dash for my back room, where I used to smoke\nand write my letters.  Then he bolted back.\n\n'Is the door locked?' he asked feverishly, and he fastened the chain\nwith his own hand.\n\n'I'm very sorry,' he said humbly.  'It's a mighty liberty, but you\nlooked the kind of man who would understand.  I've had you in my mind\nall this week when things got troublesome.  Say, will you do me a good\nturn?'\n\n'I'll listen to you,' I said.  'That's all I'll promise.'  I was\ngetting worried by the antics of this nervous little chap.\n\nThere was a tray of drinks on a table beside him, from which he filled\nhimself a stiff whisky-and-soda.  He drank it off in three gulps, and\ncracked the glass as he set it down.\n\n'Pardon,' he said, 'I'm a bit rattled tonight.  You see, I happen at\nthis moment to be dead.'\n\nI sat down in an armchair and lit my pipe.\n\n'What does it feel like?' I asked.  I was pretty certain that I had to\ndeal with a madman.\n\nA smile flickered over his drawn face.  'I'm not mad--yet.  Say, Sir,\nI've been watching you, and I reckon you're a cool customer.  I reckon,\ntoo, you're an honest man, and not afraid of playing a bold hand.  I'm\ngoing to confide in you.  I need help worse than any man ever needed\nit, and I want to know if I can count you in.'\n\n'Get on with your yarn,' I said, 'and I'll tell you.'\n\nHe seemed to brace himself for a great effort, and then started on the\nqueerest rigmarole.  I didn't get hold of it at first, and I had to\nstop and ask him questions.  But here is the gist of it:\n\nHe was an American, from Kentucky, and after college, being pretty well\noff, he had started out to see the world.  He wrote a bit, and acted as\nwar correspondent for a Chicago paper, and spent a year or two in\nSouth-Eastern Europe.  I gathered that he was a fine linguist, and had\ngot to know pretty well the society in those parts.  He spoke\nfamiliarly of many names that I remembered to have seen in the\nnewspapers.\n\nHe had played about with politics, he told me, at first for the\ninterest of them, and then because he couldn't help himself.  I read\nhim as a sharp, restless fellow, who always wanted to get down to the\nroots of things.  He got a little further down than he wanted.\n\nI am giving you what he told me as well as I could make it out.  Away\nbehind all the Governments and the armies there was a big subterranean\nmovement going on, engineered by very dangerous people.  He had come on\nit by accident; it fascinated him; he went further, and then he got\ncaught.  I gathered that most of the people in it were the sort of\neducated anarchists that make revolutions, but that beside them there\nwere financiers who were playing for money.  A clever man can make big\nprofits on a falling market, and it suited the book of both classes to\nset Europe by the ears.\n\nHe told me some queer things that explained a lot that had puzzled\nme--things that happened in the Balkan War, how one state suddenly came\nout on top, why alliances were made and broken, why certain men\ndisappeared, and where the sinews of war came from.  The aim of the\nwhole conspiracy was to get Russia and Germany at loggerheads.\n\nWhen I asked why, he said that the anarchist lot thought it would give\nthem their chance.  Everything would be in the melting-pot, and they\nlooked to see a new world emerge.  The capitalists would rake in the\nshekels, and make fortunes by buying up wreckage.  Capital, he said,\nhad no conscience and no fatherland.  Besides, the Jew was behind it,\nand the Jew hated Russia worse than hell.\n\n'Do you wonder?' he cried.  'For three hundred years they have been\npersecuted, and this is the return match for the pogroms.  The Jew is\neverywhere, but you have to go far down the backstairs to find him.\nTake any big Teutonic business concern.  If you have dealings with it\nthe first man you meet is Prince von und Zu Something, an elegant young\nman who talks Eton-and-Harrow English.  But he cuts no ice.  If your\nbusiness is big, you get behind him and find a prognathous Westphalian\nwith a retreating brow and the manners of a hog.  He is the German\nbusiness man that gives your English papers the shakes.  But if you're\non the biggest kind of job and are bound to get to the real boss, ten\nto one you are brought up against a little white-faced Jew in a\nbath-chair with an eye like a rattlesnake.  Yes, Sir, he is the man who\nis ruling the world just now, and he has his knife in the Empire of the\nTzar, because his aunt was outraged and his father flogged in some\none-horse location on the Volga.'\n\nI could not help saying that his Jew-anarchists seemed to have got left\nbehind a little.\n\n'Yes and no,' he said.  'They won up to a point, but they struck a\nbigger thing than money, a thing that couldn't be bought, the old\nelemental fighting instincts of man.  If you're going to be killed you\ninvent some kind of flag and country to fight for, and if you survive\nyou get to love the thing.  Those foolish devils of soldiers have found\nsomething they care for, and that has upset the pretty plan laid in\nBerlin and Vienna.  But my friends haven't played their last card by a\nlong sight.  They've gotten the ace up their sleeves, and unless I can\nkeep alive for a month they are going to play it and win.'\n\n'But I thought you were dead,' I put in.\n\n'MORS JANUA VITAE,' he smiled.  (I recognized the quotation: it was\nabout all the Latin I knew.) 'I'm coming to that, but I've got to put\nyou wise about a lot of things first.  If you read your newspaper, I\nguess you know the name of Constantine Karolides?'\n\nI sat up at that, for I had been reading about him that very afternoon.\n\n'He is the man that has wrecked all their games.  He is the one big\nbrain in the whole show, and he happens also to be an honest man.\nTherefore he has been marked down these twelve months past.  I found\nthat out--not that it was difficult, for any fool could guess as much.\nBut I found out the way they were going to get him, and that knowledge\nwas deadly.  That's why I have had to decease.'\n\nHe had another drink, and I mixed it for him myself, for I was getting\ninterested in the beggar.\n\n'They can't get him in his own land, for he has a bodyguard of Epirotes\nthat would skin their grandmothers.  But on the 15th day of June he is\ncoming to this city.  The British Foreign Office has taken to having\nInternational tea-parties, and the biggest of them is due on that date.\nNow Karolides is reckoned the principal guest, and if my friends have\ntheir way he will never return to his admiring countrymen.'\n\n'That's simple enough, anyhow,' I said.  'You can warn him and keep him\nat home.'\n\n'And play their game?' he asked sharply.  'If he does not come they\nwin, for he's the only man that can straighten out the tangle.  And if\nhis Government are warned he won't come, for he does not know how big\nthe stakes will be on June the 15th.'\n\n'What about the British Government?' I said.  'They're not going to let\ntheir guests be murdered.  Tip them the wink, and they'll take extra\nprecautions.'\n\n'No good.  They might stuff your city with plain-clothes detectives and\ndouble the police and Constantine would still be a doomed man.  My\nfriends are not playing this game for candy.  They want a big occasion\nfor the taking off, with the eyes of all Europe on it.  He'll be\nmurdered by an Austrian, and there'll be plenty of evidence to show the\nconnivance of the big folk in Vienna and Berlin.  It will all be an\ninfernal lie, of course, but the case will look black enough to the\nworld.  I'm not talking hot air, my friend.  I happen to know every\ndetail of the hellish contrivance, and I can tell you it will be the\nmost finished piece of blackguardism since the Borgias.  But it's not\ngoing to come off if there's a certain man who knows the wheels of the\nbusiness alive right here in London on the 15th day of June.  And that\nman is going to be your servant, Franklin P.  Scudder.'\n\nI was getting to like the little chap.  His jaw had shut like a\nrat-trap, and there was the fire of battle in his gimlety eyes.  If he\nwas spinning me a yarn he could act up to it.\n\n'Where did you find out this story?' I asked.\n\n'I got the first hint in an inn on the Achensee in Tyrol.  That set me\ninquiring, and I collected my other clues in a fur-shop in the Galician\nquarter of Buda, in a Strangers' Club in Vienna, and in a little\nbookshop off the Racknitzstrasse in Leipsic.  I completed my evidence\nten days ago in Paris.  I can't tell you the details now, for it's\nsomething of a history.  When I was quite sure in my own mind I judged\nit my business to disappear, and I reached this city by a mighty queer\ncircuit.  I left Paris a dandified young French-American, and I sailed\nfrom Hamburg a Jew diamond merchant.  In Norway I was an English\nstudent of Ibsen collecting materials for lectures, but when I left\nBergen I was a cinema-man with special ski films.  And I came here from\nLeith with a lot of pulp-wood propositions in my pocket to put before\nthe London newspapers.  Till yesterday I thought I had muddied my trail\nsome, and was feeling pretty happy.  Then ...'\n\nThe recollection seemed to upset him, and he gulped down some more\nwhisky.\n\n'Then I saw a man standing in the street outside this block.  I used to\nstay close in my room all day, and only slip out after dark for an hour\nor two.  I watched him for a bit from my window, and I thought I\nrecognized him ...  He came in and spoke to the porter ...  When I came\nback from my walk last night I found a card in my letter-box.  It bore\nthe name of the man I want least to meet on God's earth.'\n\nI think that the look in my companion's eyes, the sheer naked scare on\nhis face, completed my conviction of his honesty.  My own voice\nsharpened a bit as I asked him what he did next.\n\n'I realized that I was bottled as sure as a pickled herring, and that\nthere was only one way out.  I had to die.  If my pursuers knew I was\ndead they would go to sleep again.'\n\n'How did you manage it?'\n\n'I told the man that valets me that I was feeling pretty bad, and I got\nmyself up to look like death.  That wasn't difficult, for I'm no slouch\nat disguises.  Then I got a corpse--you can always get a body in London\nif you know where to go for it.  I fetched it back in a trunk on the\ntop of a four-wheeler, and I had to be assisted upstairs to my room.\nYou see I had to pile up some evidence for the inquest.  I went to bed\nand got my man to mix me a sleeping-draught, and then told him to clear\nout.  He wanted to fetch a doctor, but I swore some and said I couldn't\nabide leeches.  When I was left alone I started in to fake up that\ncorpse.  He was my size, and I judged had perished from too much\nalcohol, so I put some spirits handy about the place.  The jaw was the\nweak point in the likeness, so I blew it away with a revolver.  I\ndaresay there will be somebody tomorrow to swear to having heard a\nshot, but there are no neighbours on my floor, and I guessed I could\nrisk it.  So I left the body in bed dressed up in my pyjamas, with a\nrevolver lying on the bed-clothes and a considerable mess around.  Then\nI got into a suit of clothes I had kept waiting for emergencies.  I\ndidn't dare to shave for fear of leaving tracks, and besides, it wasn't\nany kind of use my trying to get into the streets.  I had had you in my\nmind all day, and there seemed nothing to do but to make an appeal to\nyou.  I watched from my window till I saw you come home, and then\nslipped down the stair to meet you ...  There, Sir, I guess you know\nabout as much as me of this business.'\n\nHe sat blinking like an owl, fluttering with nerves and yet desperately\ndetermined.  By this time I was pretty well convinced that he was going\nstraight with me.  It was the wildest sort of narrative, but I had\nheard in my time many steep tales which had turned out to be true, and\nI had made a practice of judging the man rather than the story.  If he\nhad wanted to get a location in my flat, and then cut my throat, he\nwould have pitched a milder yarn.\n\n'Hand me your key,' I said, 'and I'll take a look at the corpse.\nExcuse my caution, but I'm bound to verify a bit if I can.'\n\nHe shook his head mournfully.  'I reckoned you'd ask for that, but I\nhaven't got it.  It's on my chain on the dressing-table.  I had to\nleave it behind, for I couldn't leave any clues to breed suspicions.\nThe gentry who are after me are pretty bright-eyed citizens.  You'll\nhave to take me on trust for the night, and tomorrow you'll get proof\nof the corpse business right enough.'\n\nI thought for an instant or two.  'Right.  I'll trust you for the\nnight.  I'll lock you into this room and keep the key.  Just one word,\nMr Scudder.  I believe you're straight, but if so be you are not I\nshould warn you that I'm a handy man with a gun.'\n\n'Sure,' he said, jumping up with some briskness.  'I haven't the\nprivilege of your name, Sir, but let me tell you that you're a white\nman.  I'll thank you to lend me a razor.'\n\nI took him into my bedroom and turned him loose.  In half an hour's\ntime a figure came out that I scarcely recognized.  Only his gimlety,\nhungry eyes were the same.  He was shaved clean, his hair was parted in\nthe middle, and he had cut his eyebrows.  Further, he carried himself\nas if he had been drilled, and was the very model, even to the brown\ncomplexion, of some British officer who had had a long spell in India.\nHe had a monocle, too, which he stuck in his eye, and every trace of\nthe American had gone out of his speech.\n\n'My hat!  Mr Scudder--' I stammered.\n\n'Not Mr Scudder,' he corrected; 'Captain Theophilus Digby, of the 40th\nGurkhas, presently home on leave.  I'll thank you to remember that,\nSir.'\n\nI made him up a bed in my smoking-room and sought my own couch, more\ncheerful than I had been for the past month.  Things did happen\noccasionally, even in this God-forgotten metropolis.\n\nI woke next morning to hear my man, Paddock, making the deuce of a row\nat the smoking-room door.  Paddock was a fellow I had done a good turn\nto out on the Selakwe, and I had inspanned him as my servant as soon as\nI got to England.  He had about as much gift of the gab as a\nhippopotamus, and was not a great hand at valeting, but I knew I could\ncount on his loyalty.\n\n'Stop that row, Paddock,' I said.  'There's a friend of mine,\nCaptain--Captain' (I couldn't remember the name) 'dossing down in\nthere.  Get breakfast for two and then come and speak to me.'\n\nI told Paddock a fine story about how my friend was a great swell, with\nhis nerves pretty bad from overwork, who wanted absolute rest and\nstillness.  Nobody had got to know he was here, or he would be besieged\nby communications from the India Office and the Prime Minister and his\ncure would be ruined.  I am bound to say Scudder played up splendidly\nwhen he came to breakfast.  He fixed Paddock with his eyeglass, just\nlike a British officer, asked him about the Boer War, and slung out at\nme a lot of stuff about imaginary pals.  Paddock couldn't learn to call\nme 'Sir', but he 'sirred' Scudder as if his life depended on it.\n\nI left him with the newspaper and a box of cigars, and went down to the\nCity till luncheon.  When I got back the lift-man had an important face.\n\n'Nawsty business 'ere this morning, Sir.  Gent in No.  15 been and shot\n'isself.  They've just took 'im to the mortiary.  The police are up\nthere now.'\n\nI ascended to No.  15, and found a couple of bobbies and an inspector\nbusy making an examination.  I asked a few idiotic questions, and they\nsoon kicked me out.  Then I found the man that had valeted Scudder, and\npumped him, but I could see he suspected nothing.  He was a whining\nfellow with a churchyard face, and half-a-crown went far to console him.\n\nI attended the inquest next day.  A partner of some publishing firm\ngave evidence that the deceased had brought him wood-pulp propositions,\nand had been, he believed, an agent of an American business.  The jury\nfound it a case of suicide while of unsound mind, and the few effects\nwere handed over to the American Consul to deal with.  I gave Scudder a\nfull account of the affair, and it interested him greatly.  He said he\nwished he could have attended the inquest, for he reckoned it would be\nabout as spicy as to read one's own obituary notice.\n\nThe first two days he stayed with me in that back room he was very\npeaceful.  He read and smoked a bit, and made a heap of jottings in a\nnote-book, and every night we had a game of chess, at which he beat me\nhollow.  I think he was nursing his nerves back to health, for he had\nhad a pretty trying time.  But on the third day I could see he was\nbeginning to get restless.  He fixed up a list of the days till June\n15th, and ticked each off with a red pencil, making remarks in\nshorthand against them.  I would find him sunk in a brown study, with\nhis sharp eyes abstracted, and after those spells of meditation he was\napt to be very despondent.\n\nThen I could see that he began to get edgy again.  He listened for\nlittle noises, and was always asking me if Paddock could be trusted.\nOnce or twice he got very peevish, and apologized for it.  I didn't\nblame him.  I made every allowance, for he had taken on a fairly stiff\njob.\n\nIt was not the safety of his own skin that troubled him, but the\nsuccess of the scheme he had planned.  That little man was clean grit\nall through, without a soft spot in him.  One night he was very solemn.\n\n'Say, Hannay,' he said, 'I judge I should let you a bit deeper into\nthis business.  I should hate to go out without leaving somebody else\nto put up a fight.'  And he began to tell me in detail what I had only\nheard from him vaguely.\n\nI did not give him very close attention.  The fact is, I was more\ninterested in his own adventures than in his high politics.  I reckoned\nthat Karolides and his affairs were not my business, leaving all that\nto him.  So a lot that he said slipped clean out of my memory.  I\nremember that he was very clear that the danger to Karolides would not\nbegin till he had got to London, and would come from the very highest\nquarters, where there would be no thought of suspicion.  He mentioned\nthe name of a woman--Julia Czechenyi--as having something to do with\nthe danger.  She would be the decoy, I gathered, to get Karolides out\nof the care of his guards.  He talked, too, about a Black Stone and a\nman that lisped in his speech, and he described very particularly\nsomebody that he never referred to without a shudder--an old man with a\nyoung voice who could hood his eyes like a hawk.\n\nHe spoke a good deal about death, too.  He was mortally anxious about\nwinning through with his job, but he didn't care a rush for his life.\n\n'I reckon it's like going to sleep when you are pretty well tired out,\nand waking to find a summer day with the scent of hay coming in at the\nwindow.  I used to thank God for such mornings way back in the\nBlue-Grass country, and I guess I'll thank Him when I wake up on the\nother side of Jordan.'\n\nNext day he was much more cheerful, and read the life of Stonewall\nJackson much of the time.  I went out to dinner with a mining engineer\nI had got to see on business, and came back about half-past ten in time\nfor our game of chess before turning in.\n\nI had a cigar in my mouth, I remember, as I pushed open the\nsmoking-room door.  The lights were not lit, which struck me as odd.  I\nwondered if Scudder had turned in already.\n\nI snapped the switch, but there was nobody there.  Then I saw something\nin the far corner which made me drop my cigar and fall into a cold\nsweat.\n\nMy guest was lying sprawled on his back.  There was a long knife\nthrough his heart which skewered him to the floor.\n\n\n\nCHAPTER TWO\n\nThe Milkman Sets Out on his Travels\n\nI sat down in an armchair and felt very sick.  That lasted for maybe\nfive minutes, and was succeeded by a fit of the horrors.  The poor\nstaring white face on the floor was more than I could bear, and I\nmanaged to get a table-cloth and cover it.  Then I staggered to a\ncupboard, found the brandy and swallowed several mouthfuls.  I had seen\nmen die violently before; indeed I had killed a few myself in the\nMatabele War; but this cold-blooded indoor business was different.\nStill I managed to pull myself together.  I looked at my watch, and saw\nthat it was half-past ten.\n\nAn idea seized me, and I went over the flat with a small-tooth comb.\nThere was nobody there, nor any trace of anybody, but I shuttered and\nbolted all the windows and put the chain on the door.  By this time my\nwits were coming back to me, and I could think again.  It took me about\nan hour to figure the thing out, and I did not hurry, for, unless the\nmurderer came back, I had till about six o'clock in the morning for my\ncogitations.\n\nI was in the soup--that was pretty clear.  Any shadow of a doubt I\nmight have had about the truth of Scudder's tale was now gone.  The\nproof of it was lying under the table-cloth.  The men who knew that he\nknew what he knew had found him, and had taken the best way to make\ncertain of his silence.  Yes; but he had been in my rooms four days,\nand his enemies must have reckoned that he had confided in me.  So I\nwould be the next to go.  It might be that very night, or next day, or\nthe day after, but my number was up all right.\n\nThen suddenly I thought of another probability.  Supposing I went out\nnow and called in the police, or went to bed and let Paddock find the\nbody and call them in the morning.  What kind of a story was I to tell\nabout Scudder?  I had lied to Paddock about him, and the whole thing\nlooked desperately fishy.  If I made a clean breast of it and told the\npolice everything he had told me, they would simply laugh at me.  The\nodds were a thousand to one that I would be charged with the murder,\nand the circumstantial evidence was strong enough to hang me.  Few\npeople knew me in England; I had no real pal who could come forward and\nswear to my character.  Perhaps that was what those secret enemies were\nplaying for.  They were clever enough for anything, and an English\nprison was as good a way of getting rid of me till after June 15th as a\nknife in my chest.\n\nBesides, if I told the whole story, and by any miracle was believed, I\nwould be playing their game.  Karolides would stay at home, which was\nwhat they wanted.  Somehow or other the sight of Scudder's dead face\nhad made me a passionate believer in his scheme.  He was gone, but he\nhad taken me into his confidence, and I was pretty well bound to carry\non his work.\n\nYou may think this ridiculous for a man in danger of his life, but that\nwas the way I looked at it.  I am an ordinary sort of fellow, not\nbraver than other people, but I hate to see a good man downed, and that\nlong knife would not be the end of Scudder if I could play the game in\nhis place.\n\nIt took me an hour or two to think this out, and by that time I had\ncome to a decision.  I must vanish somehow, and keep vanished till the\nend of the second week in June.  Then I must somehow find a way to get\nin touch with the Government people and tell them what Scudder had told\nme.  I wished to Heaven he had told me more, and that I had listened\nmore carefully to the little he had told me.  I knew nothing but the\nbarest facts.  There was a big risk that, even if I weathered the other\ndangers, I would not be believed in the end.  I must take my chance of\nthat, and hope that something might happen which would confirm my tale\nin the eyes of the Government.\n\nMy first job was to keep going for the next three weeks.  It was now\nthe 24th day of May, and that meant twenty days of hiding before I\ncould venture to approach the powers that be.  I reckoned that two sets\nof people would be looking for me--Scudder's enemies to put me out of\nexistence, and the police, who would want me for Scudder's murder.  It\nwas going to be a giddy hunt, and it was queer how the prospect\ncomforted me.  I had been slack so long that almost any chance of\nactivity was welcome.  When I had to sit alone with that corpse and\nwait on Fortune I was no better than a crushed worm, but if my neck's\nsafety was to hang on my own wits I was prepared to be cheerful about\nit.\n\nMy next thought was whether Scudder had any papers about him to give me\na better clue to the business.  I drew back the table-cloth and\nsearched his pockets, for I had no longer any shrinking from the body.\nThe face was wonderfully calm for a man who had been struck down in a\nmoment.  There was nothing in the breast-pocket, and only a few loose\ncoins and a cigar-holder in the waistcoat.  The trousers held a little\npenknife and some silver, and the side pocket of his jacket contained\nan old crocodile-skin cigar-case.  There was no sign of the little\nblack book in which I had seen him making notes.  That had no doubt\nbeen taken by his murderer.\n\nBut as I looked up from my task I saw that some drawers had been pulled\nout in the writing-table.  Scudder would never have left them in that\nstate, for he was the tidiest of mortals.  Someone must have been\nsearching for something--perhaps for the pocket-book.\n\nI went round the flat and found that everything had been ransacked--the\ninside of books, drawers, cupboards, boxes, even the pockets of the\nclothes in my wardrobe, and the sideboard in the dining-room.  There\nwas no trace of the book.  Most likely the enemy had found it, but they\nhad not found it on Scudder's body.\n\nThen I got out an atlas and looked at a big map of the British Isles.\nMy notion was to get off to some wild district, where my veldcraft\nwould be of some use to me, for I would be like a trapped rat in a\ncity.  I considered that Scotland would be best, for my people were\nScotch and I could pass anywhere as an ordinary Scotsman.  I had half\nan idea at first to be a German tourist, for my father had had German\npartners, and I had been brought up to speak the tongue pretty\nfluently, not to mention having put in three years prospecting for\ncopper in German Damaraland.  But I calculated that it would be less\nconspicuous to be a Scot, and less in a line with what the police might\nknow of my past.  I fixed on Galloway as the best place to go.  It was\nthe nearest wild part of Scotland, so far as I could figure it out, and\nfrom the look of the map was not over thick with population.\n\nA search in Bradshaw informed me that a train left St Pancras at 7.10,\nwhich would land me at any Galloway station in the late afternoon.\nThat was well enough, but a more important matter was how I was to make\nmy way to St Pancras, for I was pretty certain that Scudder's friends\nwould be watching outside.  This puzzled me for a bit; then I had an\ninspiration, on which I went to bed and slept for two troubled hours.\n\nI got up at four and opened my bedroom shutters.  The faint light of a\nfine summer morning was flooding the skies, and the sparrows had begun\nto chatter.  I had a great revulsion of feeling, and felt a\nGod-forgotten fool.  My inclination was to let things slide, and trust\nto the British police taking a reasonable view of my case.  But as I\nreviewed the situation I could find no arguments to bring against my\ndecision of the previous night, so with a wry mouth I resolved to go on\nwith my plan.  I was not feeling in any particular funk; only\ndisinclined to go looking for trouble, if you understand me.\n\nI hunted out a well-used tweed suit, a pair of strong nailed boots, and\na flannel shirt with a collar.  Into my pockets I stuffed a spare\nshirt, a cloth cap, some handkerchiefs, and a tooth-brush.  I had drawn\na good sum in gold from the bank two days before, in case Scudder\nshould want money, and I took fifty pounds of it in sovereigns in a\nbelt which I had brought back from Rhodesia.  That was about all I\nwanted.  Then I had a bath, and cut my moustache, which was long and\ndrooping, into a short stubbly fringe.\n\nNow came the next step.  Paddock used to arrive punctually at 7.30 and\nlet himself in with a latch-key.  But about twenty minutes to seven, as\nI knew from bitter experience, the milkman turned up with a great\nclatter of cans, and deposited my share outside my door.  I had seen\nthat milkman sometimes when I had gone out for an early ride.  He was a\nyoung man about my own height, with an ill-nourished moustache, and he\nwore a white overall.  On him I staked all my chances.\n\nI went into the darkened smoking-room where the rays of morning light\nwere beginning to creep through the shutters.  There I breakfasted off\na whisky-and-soda and some biscuits from the cupboard.  By this time it\nwas getting on for six o'clock.  I put a pipe in my pocket and filled\nmy pouch from the tobacco jar on the table by the fireplace.\n\nAs I poked into the tobacco my fingers touched something hard, and I\ndrew out Scudder's little black pocket-book ...\n\nThat seemed to me a good omen.  I lifted the cloth from the body and\nwas amazed at the peace and dignity of the dead face.  'Goodbye, old\nchap,' I said; 'I am going to do my best for you.  Wish me well,\nwherever you are.'\n\nThen I hung about in the hall waiting for the milkman.  That was the\nworst part of the business, for I was fairly choking to get out of\ndoors.  Six-thirty passed, then six-forty, but still he did not come.\nThe fool had chosen this day of all days to be late.\n\nAt one minute after the quarter to seven I heard the rattle of the cans\noutside.  I opened the front door, and there was my man, singling out\nmy cans from a bunch he carried and whistling through his teeth.  He\njumped a bit at the sight of me.\n\n'Come in here a moment,' I said.  'I want a word with you.'  And I led\nhim into the dining-room.\n\n'I reckon you're a bit of a sportsman,' I said, 'and I want you to do\nme a service.  Lend me your cap and overall for ten minutes, and here's\na sovereign for you.'\n\nHis eyes opened at the sight of the gold, and he grinned broadly.\n'Wot's the gyme?'he asked.\n\n'A bet,' I said.  'I haven't time to explain, but to win it I've got to\nbe a milkman for the next ten minutes.  All you've got to do is to stay\nhere till I come back.  You'll be a bit late, but nobody will complain,\nand you'll have that quid for yourself.'\n\n'Right-o!' he said cheerily.  'I ain't the man to spoil a bit of sport.\n'Ere's the rig, guv'nor.'\n\nI stuck on his flat blue hat and his white overall, picked up the cans,\nbanged my door, and went whistling downstairs.  The porter at the foot\ntold me to shut my jaw, which sounded as if my make-up was adequate.\n\nAt first I thought there was nobody in the street.  Then I caught sight\nof a policeman a hundred yards down, and a loafer shuffling past on the\nother side.  Some impulse made me raise my eyes to the house opposite,\nand there at a first-floor window was a face.  As the loafer passed he\nlooked up, and I fancied a signal was exchanged.\n\nI crossed the street, whistling gaily and imitating the jaunty swing of\nthe milkman.  Then I took the first side street, and went up a\nleft-hand turning which led past a bit of vacant ground.  There was no\none in the little street, so I dropped the milk-cans inside the\nhoarding and sent the cap and overall after them.  I had only just put\non my cloth cap when a postman came round the corner.  I gave him good\nmorning and he answered me unsuspiciously.  At the moment the clock of\na neighbouring church struck the hour of seven.\n\nThere was not a second to spare.  As soon as I got to Euston Road I\ntook to my heels and ran.  The clock at Euston Station showed five\nminutes past the hour.  At St Pancras I had no time to take a ticket,\nlet alone that I had not settled upon my destination.  A porter told me\nthe platform, and as I entered it I saw the train already in motion.\nTwo station officials blocked the way, but I dodged them and clambered\ninto the last carriage.\n\nThree minutes later, as we were roaring through the northern tunnels,\nan irate guard interviewed me.  He wrote out for me a ticket to\nNewton-Stewart, a name which had suddenly come back to my memory, and\nhe conducted me from the first-class compartment where I had ensconced\nmyself to a third-class smoker, occupied by a sailor and a stout woman\nwith a child.  He went off grumbling, and as I mopped my brow I\nobserved to my companions in my broadest Scots that it was a sore job\ncatching trains.  I had already entered upon my part.\n\n'The impidence o' that gyaird!' said the lady bitterly.  'He needit a\nScotch tongue to pit him in his place.  He was complainin' o' this wean\nno haein' a ticket and her no fower till August twalmonth, and he was\nobjectin' to this gentleman spittin'.'\n\nThe sailor morosely agreed, and I started my new life in an atmosphere\nof protest against authority.  I reminded myself that a week ago I had\nbeen finding the world dull.\n\n\n\nCHAPTER THREE\n\nThe Adventure of the Literary Innkeeper\n\nI had a solemn time travelling north that day.  It was fine May\nweather, with the hawthorn flowering on every hedge, and I asked myself\nwhy, when I was still a free man, I had stayed on in London and not got\nthe good of this heavenly country.  I didn't dare face the restaurant\ncar, but I got a luncheon-basket at Leeds and shared it with the fat\nwoman.  Also I got the morning's papers, with news about starters for\nthe Derby and the beginning of the cricket season, and some paragraphs\nabout how Balkan affairs were settling down and a British squadron was\ngoing to Kiel.\n\nWhen I had done with them I got out Scudder's little black pocket-book\nand studied it.  It was pretty well filled with jottings, chiefly\nfigures, though now and then a name was printed in.  For example, I\nfound the words 'Hofgaard', 'Luneville', and 'Avocado' pretty often,\nand especially the word 'Pavia'.\n\nNow I was certain that Scudder never did anything without a reason, and\nI was pretty sure that there was a cypher in all this.  That is a\nsubject which has always interested me, and I did a bit at it myself\nonce as intelligence officer at Delagoa Bay during the Boer War.  I\nhave a head for things like chess and puzzles, and I used to reckon\nmyself pretty good at finding out cyphers.  This one looked like the\nnumerical kind where sets of figures correspond to the letters of the\nalphabet, but any fairly shrewd man can find the clue to that sort\nafter an hour or two's work, and I didn't think Scudder would have been\ncontent with anything so easy.  So I fastened on the printed words, for\nyou can make a pretty good numerical cypher if you have a key word\nwhich gives you the sequence of the letters.\n\nI tried for hours, but none of the words answered.  Then I fell asleep\nand woke at Dumfries just in time to bundle out and get into the slow\nGalloway train.  There was a man on the platform whose looks I didn't\nlike, but he never glanced at me, and when I caught sight of myself in\nthe mirror of an automatic machine I didn't wonder.  With my brown\nface, my old tweeds, and my slouch, I was the very model of one of the\nhill farmers who were crowding into the third-class carriages.\n\nI travelled with half a dozen in an atmosphere of shag and clay pipes.\nThey had come from the weekly market, and their mouths were full of\nprices.  I heard accounts of how the lambing had gone up the Cairn and\nthe Deuch and a dozen other mysterious waters.  Above half the men had\nlunched heavily and were highly flavoured with whisky, but they took no\nnotice of me.  We rumbled slowly into a land of little wooded glens and\nthen to a great wide moorland place, gleaming with lochs, with high\nblue hills showing northwards.\n\nAbout five o'clock the carriage had emptied, and I was left alone as I\nhad hoped.  I got out at the next station, a little place whose name I\nscarcely noted, set right in the heart of a bog.  It reminded me of one\nof those forgotten little stations in the Karroo.  An old\nstation-master was digging in his garden, and with his spade over his\nshoulder sauntered to the train, took charge of a parcel, and went back\nto his potatoes.  A child of ten received my ticket, and I emerged on a\nwhite road that straggled over the brown moor.\n\nIt was a gorgeous spring evening, with every hill showing as clear as a\ncut amethyst.  The air had the queer, rooty smell of bogs, but it was\nas fresh as mid-ocean, and it had the strangest effect on my spirits.\nI actually felt light-hearted.  I might have been a boy out for a\nspring holiday tramp, instead of a man of thirty-seven very much wanted\nby the police.  I felt just as I used to feel when I was starting for a\nbig trek on a frosty morning on the high veld.  If you believe me, I\nswung along that road whistling.  There was no plan of campaign in my\nhead, only just to go on and on in this blessed, honest-smelling hill\ncountry, for every mile put me in better humour with myself.\n\nIn a roadside planting I cut a walking-stick of hazel, and presently\nstruck off the highway up a bypath which followed the glen of a\nbrawling stream.  I reckoned that I was still far ahead of any pursuit,\nand for that night might please myself.  It was some hours since I had\ntasted food, and I was getting very hungry when I came to a herd's\ncottage set in a nook beside a waterfall.  A brown-faced woman was\nstanding by the door, and greeted me with the kindly shyness of\nmoorland places.  When I asked for a night's lodging she said I was\nwelcome to the 'bed in the loft', and very soon she set before me a\nhearty meal of ham and eggs, scones, and thick sweet milk.\n\nAt the darkening her man came in from the hills, a lean giant, who in\none step covered as much ground as three paces of ordinary mortals.\nThey asked me no questions, for they had the perfect breeding of all\ndwellers in the wilds, but I could see they set me down as a kind of\ndealer, and I took some trouble to confirm their view.  I spoke a lot\nabout cattle, of which my host knew little, and I picked up from him a\ngood deal about the local Galloway markets, which I tucked away in my\nmemory for future use.  At ten I was nodding in my chair, and the 'bed\nin the loft' received a weary man who never opened his eyes till five\no'clock set the little homestead a-going once more.\n\nThey refused any payment, and by six I had breakfasted and was striding\nsouthwards again.  My notion was to return to the railway line a\nstation or two farther on than the place where I had alighted yesterday\nand to double back.  I reckoned that that was the safest way, for the\npolice would naturally assume that I was always making farther from\nLondon in the direction of some western port.  I thought I had still a\ngood bit of a start, for, as I reasoned, it would take some hours to\nfix the blame on me, and several more to identify the fellow who got on\nboard the train at St Pancras.\n\nIt was the same jolly, clear spring weather, and I simply could not\ncontrive to feel careworn.  Indeed I was in better spirits than I had\nbeen for months.  Over a long ridge of moorland I took my road,\nskirting the side of a high hill which the herd had called Cairnsmore\nof Fleet.  Nesting curlews and plovers were crying everywhere, and the\nlinks of green pasture by the streams were dotted with young lambs.\nAll the slackness of the past months was slipping from my bones, and I\nstepped out like a four-year-old.  By-and-by I came to a swell of\nmoorland which dipped to the vale of a little river, and a mile away in\nthe heather I saw the smoke of a train.\n\nThe station, when I reached it, proved to be ideal for my purpose.  The\nmoor surged up around it and left room only for the single line, the\nslender siding, a waiting-room, an office, the station-master's\ncottage, and a tiny yard of gooseberries and sweet-william.  There\nseemed no road to it from anywhere, and to increase the desolation the\nwaves of a tarn lapped on their grey granite beach half a mile away.  I\nwaited in the deep heather till I saw the smoke of an east-going train\non the horizon.  Then I approached the tiny booking-office and took a\nticket for Dumfries.\n\nThe only occupants of the carriage were an old shepherd and his dog--a\nwall-eyed brute that I mistrusted.  The man was asleep, and on the\ncushions beside him was that morning's SCOTSMAN.  Eagerly I seized on\nit, for I fancied it would tell me something.\n\nThere were two columns about the Portland Place Murder, as it was\ncalled.  My man Paddock had given the alarm and had the milkman\narrested.  Poor devil, it looked as if the latter had earned his\nsovereign hardly; but for me he had been cheap at the price, for he\nseemed to have occupied the police for the better part of the day.  In\nthe latest news I found a further instalment of the story.  The milkman\nhad been released, I read, and the true criminal, about whose identity\nthe police were reticent, was believed to have got away from London by\none of the northern lines.  There was a short note about me as the\nowner of the flat.  I guessed the police had stuck that in, as a clumsy\ncontrivance to persuade me that I was unsuspected.\n\nThere was nothing else in the paper, nothing about foreign politics or\nKarolides, or the things that had interested Scudder.  I laid it down,\nand found that we were approaching the station at which I had got out\nyesterday.  The potato-digging station-master had been gingered up into\nsome activity, for the west-going train was waiting to let us pass, and\nfrom it had descended three men who were asking him questions.  I\nsupposed that they were the local police, who had been stirred up by\nScotland Yard, and had traced me as far as this one-horse siding.\nSitting well back in the shadow I watched them carefully.  One of them\nhad a book, and took down notes.  The old potato-digger seemed to have\nturned peevish, but the child who had collected my ticket was talking\nvolubly.  All the party looked out across the moor where the white road\ndeparted.  I hoped they were going to take up my tracks there.\n\nAs we moved away from that station my companion woke up.  He fixed me\nwith a wandering glance, kicked his dog viciously, and inquired where\nhe was.  Clearly he was very drunk.\n\n'That's what comes o' bein' a teetotaller,' he observed in bitter\nregret.\n\nI expressed my surprise that in him I should have met a blue-ribbon\nstalwart.\n\n'Ay, but I'm a strong teetotaller,' he said pugnaciously.  'I took the\npledge last Martinmas, and I havena touched a drop o' whisky sinsyne.\nNot even at Hogmanay, though I was sair temptit.'\n\nHe swung his heels up on the seat, and burrowed a frowsy head into the\ncushions.\n\n'And that's a' I get,' he moaned.  'A heid better than hell fire, and\ntwae een lookin' different ways for the Sabbath.'\n\n'What did it?' I asked.\n\n'A drink they ca' brandy.  Bein' a teetotaller I keepit off the whisky,\nbut I was nip-nippin' a' day at this brandy, and I doubt I'll no be\nweel for a fortnicht.'  His voice died away into a splutter, and sleep\nonce more laid its heavy hand on him.\n\nMy plan had been to get out at some station down the line, but the\ntrain suddenly gave me a better chance, for it came to a standstill at\nthe end of a culvert which spanned a brawling porter-coloured river.  I\nlooked out and saw that every carriage window was closed and no human\nfigure appeared in the landscape.  So I opened the door, and dropped\nquickly into the tangle of hazels which edged the line.\n\nIt would have been all right but for that infernal dog.  Under the\nimpression that I was decamping with its master's belongings, it\nstarted to bark, and all but got me by the trousers.  This woke up the\nherd, who stood bawling at the carriage door in the belief that I had\ncommitted suicide.  I crawled through the thicket, reached the edge of\nthe stream, and in cover of the bushes put a hundred yards or so behind\nme.  Then from my shelter I peered back, and saw the guard and several\npassengers gathered round the open carriage door and staring in my\ndirection.  I could not have made a more public departure if I had left\nwith a bugler and a brass band.\n\nHappily the drunken herd provided a diversion.  He and his dog, which\nwas attached by a rope to his waist, suddenly cascaded out of the\ncarriage, landed on their heads on the track, and rolled some way down\nthe bank towards the water.  In the rescue which followed the dog bit\nsomebody, for I could hear the sound of hard swearing.  Presently they\nhad forgotten me, and when after a quarter of a mile's crawl I ventured\nto look back, the train had started again and was vanishing in the\ncutting.\n\nI was in a wide semicircle of moorland, with the brown river as radius,\nand the high hills forming the northern circumference.  There was not a\nsign or sound of a human being, only the plashing water and the\ninterminable crying of curlews.  Yet, oddly enough, for the first time\nI felt the terror of the hunted on me.  It was not the police that I\nthought of, but the other folk, who knew that I knew Scudder's secret\nand dared not let me live.  I was certain that they would pursue me\nwith a keenness and vigilance unknown to the British law, and that once\ntheir grip closed on me I should find no mercy.\n\nI looked back, but there was nothing in the landscape.  The sun glinted\non the metals of the line and the wet stones in the stream, and you\ncould not have found a more peaceful sight in the world.  Nevertheless\nI started to run.  Crouching low in the runnels of the bog, I ran till\nthe sweat blinded my eyes.  The mood did not leave me till I had\nreached the rim of mountain and flung myself panting on a ridge high\nabove the young waters of the brown river.\n\nFrom my vantage-ground I could scan the whole moor right away to the\nrailway line and to the south of it where green fields took the place\nof heather.  I have eyes like a hawk, but I could see nothing moving in\nthe whole countryside.  Then I looked east beyond the ridge and saw a\nnew kind of landscape--shallow green valleys with plentiful fir\nplantations and the faint lines of dust which spoke of highroads.  Last\nof all I looked into the blue May sky, and there I saw that which set\nmy pulses racing ...\n\nLow down in the south a monoplane was climbing into the heavens.  I was\nas certain as if I had been told that that aeroplane was looking for\nme, and that it did not belong to the police.  For an hour or two I\nwatched it from a pit of heather.  It flew low along the hill-tops, and\nthen in narrow circles over the valley up which I had come. Then it\nseemed to change its mind, rose to a great height, and flew away back\nto the south.\n\nI did not like this espionage from the air, and I began to think less\nwell of the countryside I had chosen for a refuge.  These heather hills\nwere no sort of cover if my enemies were in the sky, and I must find a\ndifferent kind of sanctuary.  I looked with more satisfaction to the\ngreen country beyond the ridge, for there I should find woods and stone\nhouses.\n\nAbout six in the evening I came out of the moorland to a white ribbon\nof road which wound up the narrow vale of a lowland stream.  As I\nfollowed it, fields gave place to bent, the glen became a plateau, and\npresently I had reached a kind of pass where a solitary house smoked in\nthe twilight.  The road swung over a bridge, and leaning on the parapet\nwas a young man.\n\nHe was smoking a long clay pipe and studying the water with spectacled\neyes.  In his left hand was a small book with a finger marking the\nplace.  Slowly he repeated--\n\n  As when a Gryphon through the wilderness\n  With winged step, o'er hill and moory dale\n  Pursues the Arimaspian.\n\nHe jumped round as my step rung on the keystone, and I saw a pleasant\nsunburnt boyish face.\n\n'Good evening to you,' he said gravely.  'It's a fine night for the\nroad.'\n\nThe smell of peat smoke and of some savoury roast floated to me from\nthe house.\n\n'Is that place an inn?' I asked.\n\n'At your service,' he said politely.  'I am the landlord, Sir, and I\nhope you will stay the night, for to tell you the truth I have had no\ncompany for a week.'\n\nI pulled myself up on the parapet of the bridge and filled my pipe.  I\nbegan to detect an ally.\n\n'You're young to be an innkeeper,' I said.\n\n'My father died a year ago and left me the business.  I live there with\nmy grandmother.  It's a slow job for a young man, and it wasn't my\nchoice of profession.'\n\n'Which was?'\n\nHe actually blushed.  'I want to write books,' he said.\n\n'And what better chance could you ask?' I cried.  'Man, I've often\nthought that an innkeeper would make the best story-teller in the\nworld.'\n\n'Not now,' he said eagerly.  'Maybe in the old days when you had\npilgrims and ballad-makers and highwaymen and mail-coaches on the road.\nBut not now.  Nothing comes here but motor-cars full of fat women, who\nstop for lunch, and a fisherman or two in the spring, and the shooting\ntenants in August.  There is not much material to be got out of that.\nI want to see life, to travel the world, and write things like Kipling\nand Conrad.  But the most I've done yet is to get some verses printed\nin CHAMBERS'S JOURNAL.' I looked at the inn standing golden in the\nsunset against the brown hills.\n\n'I've knocked a bit about the world, and I wouldn't despise such a\nhermitage.  D'you think that adventure is found only in the tropics or\namong gentry in red shirts?  Maybe you're rubbing shoulders with it at\nthis moment.'\n\n'That's what Kipling says,' he said, his eyes brightening, and he\nquoted some verse about 'Romance bringing up the 9.15'.\n\n'Here's a true tale for you then,' I cried, 'and a month from now you\ncan make a novel out of it.'\n\nSitting on the bridge in the soft May gloaming I pitched him a lovely\nyarn.  It was true in essentials, too, though I altered the minor\ndetails.  I made out that I was a mining magnate from Kimberley, who\nhad had a lot of trouble with I.D.B.  and had shown up a gang.  They\nhad pursued me across the ocean, and had killed my best friend, and\nwere now on my tracks.\n\nI told the story well, though I say it who shouldn't.  I pictured a\nflight across the Kalahari to German Africa, the crackling, parching\ndays, the wonderful blue-velvet nights.  I described an attack on my\nlife on the voyage home, and I made a really horrid affair of the\nPortland Place murder.  'You're looking for adventure,' I cried; 'well,\nyou've found it here.  The devils are after me, and the police are\nafter them.  It's a race that I mean to win.'\n\n'By God!' he whispered, drawing his breath in sharply, 'it is all pure\nRider Haggard and Conan Doyle.'\n\n'You believe me,' I said gratefully.\n\n'Of course I do,' and he held out his hand.  'I believe everything out\nof the common.  The only thing to distrust is the normal.'\n\nHe was very young, but he was the man for my money.\n\n'I think they're off my track for the moment, but I must lie close for\na couple of days.  Can you take me in?'\n\nHe caught my elbow in his eagerness and drew me towards the house.\n'You can lie as snug here as if you were in a moss-hole.  I'll see that\nnobody blabs, either.  And you'll give me some more material about your\nadventures?'\n\nAs I entered the inn porch I heard from far off the beat of an engine.\nThere silhouetted against the dusky West was my friend, the monoplane.\n\nHe gave me a room at the back of the house, with a fine outlook over\nthe plateau, and he made me free of his own study, which was stacked\nwith cheap editions of his favourite authors.  I never saw the\ngrandmother, so I guessed she was bedridden.  An old woman called\nMargit brought me my meals, and the innkeeper was around me at all\nhours.  I wanted some time to myself, so I invented a job for him.  He\nhad a motor-bicycle, and I sent him off next morning for the daily\npaper, which usually arrived with the post in the late afternoon.  I\ntold him to keep his eyes skinned, and make note of any strange figures\nhe saw, keeping a special sharp look-out for motors and aeroplanes.\nThen I sat down in real earnest to Scudder's note-book.\n\nHe came back at midday with the SCOTSMAN.  There was nothing in it,\nexcept some further evidence of Paddock and the milkman, and a\nrepetition of yesterday's statement that the murderer had gone North.\nBut there was a long article, reprinted from THE TIMES, about Karolides\nand the state of affairs in the Balkans, though there was no mention of\nany visit to England.  I got rid of the innkeeper for the afternoon,\nfor I was getting very warm in my search for the cypher.\n\nAs I told you, it was a numerical cypher, and by an elaborate system of\nexperiments I had pretty well discovered what were the nulls and stops.\nThe trouble was the key word, and when I thought of the odd million\nwords he might have used I felt pretty hopeless.  But about three\no'clock I had a sudden inspiration.\n\nThe name Julia Czechenyi flashed across my memory.  Scudder had said it\nwas the key to the Karolides business, and it occurred to me to try it\non his cypher.\n\nIt worked.  The five letters of 'Julia' gave me the position of the\nvowels.  A was J, the tenth letter of the alphabet, and so represented\nby X in the cypher.  E was XXI, and so on.  'Czechenyi' gave me the\nnumerals for the principal consonants.  I scribbled that scheme on a\nbit of paper and sat down to read Scudder's pages.\n\nIn half an hour I was reading with a whitish face and fingers that\ndrummed on the table.\n\nI glanced out of the window and saw a big touring-car coming up the\nglen towards the inn.  It drew up at the door, and there was the sound\nof people alighting.  There seemed to be two of them, men in\naquascutums and tweed caps.\n\nTen minutes later the innkeeper slipped into the room, his eyes bright\nwith excitement.\n\n'There's two chaps below looking for you,' he whispered.  'They're in\nthe dining-room having whiskies-and-sodas.  They asked about you and\nsaid they had hoped to meet you here.  Oh! and they described you jolly\nwell, down to your boots and shirt.  I told them you had been here last\nnight and had gone off on a motor bicycle this morning, and one of the\nchaps swore like a navvy.'\n\nI made him tell me what they looked like.  One was a dark-eyed thin\nfellow with bushy eyebrows, the other was always smiling and lisped in\nhis talk.  Neither was any kind of foreigner; on this my young friend\nwas positive.\n\nI took a bit of paper and wrote these words in German as if they were\npart of a letter--\n\n     ...  'Black Stone.  Scudder had got on to this, but he could not\n     act for a fortnight.  I doubt if I can do any good now, especially\n     as Karolides is uncertain about his plans.  But if Mr T.  advises\n     I will do the best I ...'\n\nI manufactured it rather neatly, so that it looked like a loose page of\na private letter.\n\n'Take this down and say it was found in my bedroom, and ask them to\nreturn it to me if they overtake me.'\n\nThree minutes later I heard the car begin to move, and peeping from\nbehind the curtain caught sight of the two figures.  One was slim, the\nother was sleek; that was the most I could make of my reconnaissance.\n\nThe innkeeper appeared in great excitement.  'Your paper woke them up,'\nhe said gleefully.  'The dark fellow went as white as death and cursed\nlike blazes, and the fat one whistled and looked ugly.  They paid for\ntheir drinks with half-a-sovereign and wouldn't wait for change.'\n\n'Now I'll tell you what I want you to do,' I said.  'Get on your\nbicycle and go off to Newton-Stewart to the Chief Constable.  Describe\nthe two men, and say you suspect them of having had something to do\nwith the London murder.  You can invent reasons.  The two will come\nback, never fear.  Not tonight, for they'll follow me forty miles along\nthe road, but first thing tomorrow morning.  Tell the police to be here\nbright and early.'\n\nHe set off like a docile child, while I worked at Scudder's notes.\nWhen he came back we dined together, and in common decency I had to let\nhim pump me.  I gave him a lot of stuff about lion hunts and the\nMatabele War, thinking all the while what tame businesses these were\ncompared to this I was now engaged in!  When he went to bed I sat up\nand finished Scudder.  I smoked in a chair till daylight, for I could\nnot sleep.\n\nAbout eight next morning I witnessed the arrival of two constables and\na sergeant.  They put their car in a coach-house under the innkeeper's\ninstructions, and entered the house.  Twenty minutes later I saw from\nmy window a second car come across the plateau from the opposite\ndirection.  It did not come up to the inn, but stopped two hundred\nyards off in the shelter of a patch of wood.  I noticed that its\noccupants carefully reversed it before leaving it.  A minute or two\nlater I heard their steps on the gravel outside the window.\n\nMy plan had been to lie hid in my bedroom, and see what happened.  I\nhad a notion that, if I could bring the police and my other more\ndangerous pursuers together, something might work out of it to my\nadvantage.  But now I had a better idea.  I scribbled a line of thanks\nto my host, opened the window, and dropped quietly into a gooseberry\nbush.  Unobserved I crossed the dyke, crawled down the side of a\ntributary burn, and won the highroad on the far side of the patch of\ntrees.  There stood the car, very spick and span in the morning\nsunlight, but with the dust on her which told of a long journey.  I\nstarted her, jumped into the chauffeur's seat, and stole gently out on\nto the plateau.\n\nAlmost at once the road dipped so that I lost sight of the inn, but the\nwind seemed to bring me the sound of angry voices.\n\n\n\nCHAPTER FOUR\n\nThe Adventure of the Radical Candidate\n\nYou may picture me driving that 40 h.p.  car for all she was worth over\nthe crisp moor roads on that shining May morning; glancing back at\nfirst over my shoulder, and looking anxiously to the next turning; then\ndriving with a vague eye, just wide enough awake to keep on the\nhighway.  For I was thinking desperately of what I had found in\nScudder's pocket-book.\n\nThe little man had told me a pack of lies.  All his yarns about the\nBalkans and the Jew-Anarchists and the Foreign Office Conference were\neyewash, and so was Karolides.  And yet not quite, as you shall hear.\nI had staked everything on my belief in his story, and had been let\ndown; here was his book telling me a different tale, and instead of\nbeing once-bitten-twice-shy, I believed it absolutely.\n\nWhy, I don't know.  It rang desperately true, and the first yarn, if\nyou understand me, had been in a queer way true also in spirit.  The\nfifteenth day of June was going to be a day of destiny, a bigger\ndestiny than the killing of a Dago.  It was so big that I didn't blame\nScudder for keeping me out of the game and wanting to play a lone hand.\nThat, I was pretty clear, was his intention.  He had told me something\nwhich sounded big enough, but the real thing was so immortally big that\nhe, the man who had found it out, wanted it all for himself.  I didn't\nblame him.  It was risks after all that he was chiefly greedy about.\n\nThe whole story was in the notes--with gaps, you understand, which he\nwould have filled up from his memory.  He stuck down his authorities,\ntoo, and had an odd trick of giving them all a numerical value and then\nstriking a balance, which stood for the reliability of each stage in\nthe yarn.  The four names he had printed were authorities, and there\nwas a man, Ducrosne, who got five out of a possible five; and another\nfellow, Ammersfoort, who got three.  The bare bones of the tale were\nall that was in the book--these, and one queer phrase which occurred\nhalf a dozen times inside brackets.  '(Thirty-nine steps)' was the\nphrase; and at its last time of use it ran--'(Thirty-nine steps, I\ncounted them--high tide 10.17 p.m.)'.  I could make nothing of that.\n\nThe first thing I learned was that it was no question of preventing a\nwar.  That was coming, as sure as Christmas: had been arranged, said\nScudder, ever since February 1912.  Karolides was going to be the\noccasion.  He was booked all right, and was to hand in his checks on\nJune 14th, two weeks and four days from that May morning.  I gathered\nfrom Scudder's notes that nothing on earth could prevent that.  His\ntalk of Epirote guards that would skin their own grandmothers was all\nbilly-o.\n\nThe second thing was that this war was going to come as a mighty\nsurprise to Britain.  Karolides' death would set the Balkans by the\nears, and then Vienna would chip in with an ultimatum.  Russia wouldn't\nlike that, and there would be high words.  But Berlin would play the\npeacemaker, and pour oil on the waters, till suddenly she would find a\ngood cause for a quarrel, pick it up, and in five hours let fly at us.\nThat was the idea, and a pretty good one too.  Honey and fair speeches,\nand then a stroke in the dark.  While we were talking about the\ngoodwill and good intentions of Germany our coast would be silently\nringed with mines, and submarines would be waiting for every battleship.\n\nBut all this depended upon the third thing, which was due to happen on\nJune 15th.  I would never have grasped this if I hadn't once happened\nto meet a French staff officer, coming back from West Africa, who had\ntold me a lot of things.  One was that, in spite of all the nonsense\ntalked in Parliament, there was a real working alliance between France\nand Britain, and that the two General Staffs met every now and then,\nand made plans for joint action in case of war.  Well, in June a very\ngreat swell was coming over from Paris, and he was going to get nothing\nless than a statement of the disposition of the British Home Fleet on\nmobilization.  At least I gathered it was something like that; anyhow,\nit was something uncommonly important.\n\nBut on the 15th day of June there were to be others in London--others,\nat whom I could only guess.  Scudder was content to call them\ncollectively the 'Black Stone'.  They represented not our Allies, but\nour deadly foes; and the information, destined for France, was to be\ndiverted to their pockets.  And it was to be used, remember--used a\nweek or two later, with great guns and swift torpedoes, suddenly in the\ndarkness of a summer night.\n\nThis was the story I had been deciphering in a back room of a country\ninn, overlooking a cabbage garden.  This was the story that hummed in\nmy brain as I swung in the big touring-car from glen to glen.\n\nMy first impulse had been to write a letter to the Prime Minister, but\na little reflection convinced me that that would be useless.  Who would\nbelieve my tale?  I must show a sign, some token in proof, and Heaven\nknew what that could be.  Above all, I must keep going myself, ready to\nact when things got riper, and that was going to be no light job with\nthe police of the British Isles in full cry after me and the watchers\nof the Black Stone running silently and swiftly on my trail.\n\nI had no very clear purpose in my journey, but I steered east by the\nsun, for I remembered from the map that if I went north I would come\ninto a region of coalpits and industrial towns.  Presently I was down\nfrom the moorlands and traversing the broad haugh of a river.  For\nmiles I ran alongside a park wall, and in a break of the trees I saw a\ngreat castle.  I swung through little old thatched villages, and over\npeaceful lowland streams, and past gardens blazing with hawthorn and\nyellow laburnum.  The land was so deep in peace that I could scarcely\nbelieve that somewhere behind me were those who sought my life; ay, and\nthat in a month's time, unless I had the almightiest of luck, these\nround country faces would be pinched and staring, and men would be\nlying dead in English fields.\n\nAbout mid-day I entered a long straggling village, and had a mind to\nstop and eat.  Half-way down was the Post Office, and on the steps of\nit stood the postmistress and a policeman hard at work conning a\ntelegram.  When they saw me they wakened up, and the policeman advanced\nwith raised hand, and cried on me to stop.\n\nI nearly was fool enough to obey.  Then it flashed upon me that the\nwire had to do with me; that my friends at the inn had come to an\nunderstanding, and were united in desiring to see more of me, and that\nit had been easy enough for them to wire the description of me and the\ncar to thirty villages through which I might pass.  I released the\nbrakes just in time.  As it was, the policeman made a claw at the hood,\nand only dropped off when he got my left in his eye.\n\nI saw that main roads were no place for me, and turned into the byways.\nIt wasn't an easy job without a map, for there was the risk of getting\non to a farm road and ending in a duck-pond or a stable-yard, and I\ncouldn't afford that kind of delay.  I began to see what an ass I had\nbeen to steal the car.  The big green brute would be the safest kind of\nclue to me over the breadth of Scotland.  If I left it and took to my\nfeet, it would be discovered in an hour or two and I would get no start\nin the race.\n\nThe immediate thing to do was to get to the loneliest roads.  These I\nsoon found when I struck up a tributary of the big river, and got into\na glen with steep hills all about me, and a corkscrew road at the end\nwhich climbed over a pass.  Here I met nobody, but it was taking me too\nfar north, so I slewed east along a bad track and finally struck a big\ndouble-line railway.  Away below me I saw another broadish valley, and\nit occurred to me that if I crossed it I might find some remote inn to\npass the night.  The evening was now drawing in, and I was furiously\nhungry, for I had eaten nothing since breakfast except a couple of buns\nI had bought from a baker's cart.  Just then I heard a noise in the\nsky, and lo and behold there was that infernal aeroplane, flying low,\nabout a dozen miles to the south and rapidly coming towards me.\n\nI had the sense to remember that on a bare moor I was at the\naeroplane's mercy, and that my only chance was to get to the leafy\ncover of the valley.  Down the hill I went like blue lightning,\nscrewing my head round, whenever I dared, to watch that damned flying\nmachine.  Soon I was on a road between hedges, and dipping to the\ndeep-cut glen of a stream.  Then came a bit of thick wood where I\nslackened speed.\n\nSuddenly on my left I heard the hoot of another car, and realized to my\nhorror that I was almost up on a couple of gate-posts through which a\nprivate road debouched on the highway.  My horn gave an agonized roar,\nbut it was too late.  I clapped on my brakes, but my impetus was too\ngreat, and there before me a car was sliding athwart my course.  In a\nsecond there would have been the deuce of a wreck.  I did the only\nthing possible, and ran slap into the hedge on the right, trusting to\nfind something soft beyond.\n\nBut there I was mistaken.  My car slithered through the hedge like\nbutter, and then gave a sickening plunge forward.  I saw what was\ncoming, leapt on the seat and would have jumped out.  But a branch of\nhawthorn got me in the chest, lifted me up and held me, while a ton or\ntwo of expensive metal slipped below me, bucked and pitched, and then\ndropped with an almighty smash fifty feet to the bed of the stream.\n\nSlowly that thorn let me go.  I subsided first on the hedge, and then\nvery gently on a bower of nettles.  As I scrambled to my feet a hand\ntook me by the arm, and a sympathetic and badly scared voice asked me\nif I were hurt.\n\nI found myself looking at a tall young man in goggles and a leather\nulster, who kept on blessing his soul and whinnying apologies.  For\nmyself, once I got my wind back, I was rather glad than otherwise.\nThis was one way of getting rid of the car.\n\n'My blame, Sir,' I answered him.  'It's lucky that I did not add\nhomicide to my follies.  That's the end of my Scotch motor tour, but it\nmight have been the end of my life.'\n\nHe plucked out a watch and studied it.  'You're the right sort of\nfellow,' he said.  'I can spare a quarter of an hour, and my house is\ntwo minutes off.  I'll see you clothed and fed and snug in bed.\nWhere's your kit, by the way?  Is it in the burn along with the car?'\n\n'It's in my pocket,' I said, brandishing a toothbrush.  'I'm a Colonial\nand travel light.'\n\n'A Colonial,' he cried.  'By Gad, you're the very man I've been praying\nfor.  Are you by any blessed chance a Free Trader?'\n\n'I am,' said I, without the foggiest notion of what he meant.\n\nHe patted my shoulder and hurried me into his car.  Three minutes later\nwe drew up before a comfortable-looking shooting box set among\npine-trees, and he ushered me indoors.  He took me first to a bedroom\nand flung half a dozen of his suits before me, for my own had been\npretty well reduced to rags.  I selected a loose blue serge, which\ndiffered most conspicuously from my former garments, and borrowed a\nlinen collar.  Then he haled me to the dining-room, where the remnants\nof a meal stood on the table, and announced that I had just five\nminutes to feed.  'You can take a snack in your pocket, and we'll have\nsupper when we get back.  I've got to be at the Masonic Hall at eight\no'clock, or my agent will comb my hair.'\n\nI had a cup of coffee and some cold ham, while he yarned away on the\nhearth-rug.\n\n'You find me in the deuce of a mess, Mr--by-the-by, you haven't told me\nyour name.  Twisdon?  Any relation of old Tommy Twisdon of the\nSixtieth?  No?  Well, you see I'm Liberal Candidate for this part of\nthe world, and I had a meeting on tonight at Brattleburn--that's my\nchief town, and an infernal Tory stronghold.  I had got the Colonial\nex-Premier fellow, Crumpleton, coming to speak for me tonight, and had\nthe thing tremendously billed and the whole place ground-baited.  This\nafternoon I had a wire from the ruffian saying he had got influenza at\nBlackpool, and here am I left to do the whole thing myself.  I had\nmeant to speak for ten minutes and must now go on for forty, and,\nthough I've been racking my brains for three hours to think of\nsomething, I simply cannot last the course.  Now you've got to be a\ngood chap and help me.  You're a Free Trader and can tell our people\nwhat a wash-out Protection is in the Colonies.  All you fellows have\nthe gift of the gab--I wish to Heaven I had it.  I'll be for evermore\nin your debt.'\n\nI had very few notions about Free Trade one way or the other, but I saw\nno other chance to get what I wanted.  My young gentleman was far too\nabsorbed in his own difficulties to think how odd it was to ask a\nstranger who had just missed death by an ace and had lost a\n1,000-guinea car to address a meeting for him on the spur of the\nmoment.  But my necessities did not allow me to contemplate oddnesses\nor to pick and choose my supports.\n\n'All right,' I said.  'I'm not much good as a speaker, but I'll tell\nthem a bit about Australia.'\n\nAt my words the cares of the ages slipped from his shoulders, and he\nwas rapturous in his thanks.  He lent me a big driving coat--and never\ntroubled to ask why I had started on a motor tour without possessing an\nulster--and, as we slipped down the dusty roads, poured into my ears\nthe simple facts of his history.  He was an orphan, and his uncle had\nbrought him up--I've forgotten the uncle's name, but he was in the\nCabinet, and you can read his speeches in the papers.  He had gone\nround the world after leaving Cambridge, and then, being short of a\njob, his uncle had advised politics.  I gathered that he had no\npreference in parties.  'Good chaps in both,' he said cheerfully, 'and\nplenty of blighters, too.  I'm Liberal, because my family have always\nbeen Whigs.'  But if he was lukewarm politically he had strong views on\nother things.  He found out I knew a bit about horses, and jawed away\nabout the Derby entries; and he was full of plans for improving his\nshooting.  Altogether, a very clean, decent, callow young man.\n\nAs we passed through a little town two policemen signalled us to stop,\nand flashed their lanterns on us.\n\n'Beg pardon, Sir Harry,' said one.  'We've got instructions to look out\nfor a car, and the description's no unlike yours.'\n\n'Right-o,' said my host, while I thanked Providence for the devious\nways I had been brought to safety.  After that he spoke no more, for\nhis mind began to labour heavily with his coming speech.  His lips kept\nmuttering, his eye wandered, and I began to prepare myself for a second\ncatastrophe.  I tried to think of something to say myself, but my mind\nwas dry as a stone.  The next thing I knew we had drawn up outside a\ndoor in a street, and were being welcomed by some noisy gentlemen with\nrosettes.  The hall had about five hundred in it, women mostly, a lot\nof bald heads, and a dozen or two young men.  The chairman, a weaselly\nminister with a reddish nose, lamented Crumpleton's absence,\nsoliloquized on his influenza, and gave me a certificate as a 'trusted\nleader of Australian thought'.  There were two policemen at the door,\nand I hoped they took note of that testimonial.  Then Sir Harry started.\n\nI never heard anything like it.  He didn't begin to know how to talk.\nHe had about a bushel of notes from which he read, and when he let go\nof them he fell into one prolonged stutter.  Every now and then he\nremembered a phrase he had learned by heart, straightened his back, and\ngave it off like Henry Irving, and the next moment he was bent double\nand crooning over his papers.  It was the most appalling rot, too.  He\ntalked about the 'German menace', and said it was all a Tory invention\nto cheat the poor of their rights and keep back the great flood of\nsocial reform, but that 'organized labour' realized this and laughed\nthe Tories to scorn.  He was all for reducing our Navy as a proof of\nour good faith, and then sending Germany an ultimatum telling her to do\nthe same or we would knock her into a cocked hat.  He said that, but\nfor the Tories, Germany and Britain would be fellow-workers in peace\nand reform.  I thought of the little black book in my pocket!  A giddy\nlot Scudder's friends cared for peace and reform.\n\nYet in a queer way I liked the speech.  You could see the niceness of\nthe chap shining out behind the muck with which he had been spoon-fed.\nAlso it took a load off my mind.  I mightn't be much of an orator, but\nI was a thousand per cent better than Sir Harry.\n\nI didn't get on so badly when it came to my turn.  I simply told them\nall I could remember about Australia, praying there should be no\nAustralian there--all about its labour party and emigration and\nuniversal service.  I doubt if I remembered to mention Free Trade, but\nI said there were no Tories in Australia, only Labour and Liberals.\nThat fetched a cheer, and I woke them up a bit when I started in to\ntell them the kind of glorious business I thought could be made out of\nthe Empire if we really put our backs into it.\n\nAltogether I fancy I was rather a success.  The minister didn't like\nme, though, and when he proposed a vote of thanks, spoke of Sir Harry's\nspeech as 'statesmanlike' and mine as having 'the eloquence of an\nemigration agent'.\n\nWhen we were in the car again my host was in wild spirits at having got\nhis job over.  'A ripping speech, Twisdon,' he said.  'Now, you're\ncoming home with me.  I'm all alone, and if you'll stop a day or two\nI'll show you some very decent fishing.'\n\nWe had a hot supper--and I wanted it pretty badly--and then drank grog\nin a big cheery smoking-room with a crackling wood fire.  I thought the\ntime had come for me to put my cards on the table.  I saw by this man's\neye that he was the kind you can trust.\n\n'Listen, Sir Harry,' I said.  'I've something pretty important to say\nto you.  You're a good fellow, and I'm going to be frank.  Where on\nearth did you get that poisonous rubbish you talked tonight?'\n\nHis face fell.  'Was it as bad as that?' he asked ruefully.  'It did\nsound rather thin.  I got most of it out of the PROGRESSIVE MAGAZINE\nand pamphlets that agent chap of mine keeps sending me.  But you surely\ndon't think Germany would ever go to war with us?'\n\n'Ask that question in six weeks and it won't need an answer,' I said.\n'If you'll give me your attention for half an hour I am going to tell\nyou a story.'\n\nI can see yet that bright room with the deers' heads and the old prints\non the walls, Sir Harry standing restlessly on the stone curb of the\nhearth, and myself lying back in an armchair, speaking.  I seemed to be\nanother person, standing aside and listening to my own voice, and\njudging carefully the reliability of my tale.  It was the first time I\nhad ever told anyone the exact truth, so far as I understood it, and it\ndid me no end of good, for it straightened out the thing in my own\nmind.  I blinked no detail.  He heard all about Scudder, and the\nmilkman, and the note-book, and my doings in Galloway.  Presently he\ngot very excited and walked up and down the hearth-rug.\n\n'So you see,' I concluded, 'you have got here in your house the man\nthat is wanted for the Portland Place murder.  Your duty is to send\nyour car for the police and give me up.  I don't think I'll get very\nfar.  There'll be an accident, and I'll have a knife in my ribs an hour\nor so after arrest.  Nevertheless, it's your duty, as a law-abiding\ncitizen.  Perhaps in a month's time you'll be sorry, but you have no\ncause to think of that.'\n\nHe was looking at me with bright steady eyes.  'What was your job in\nRhodesia, Mr Hannay?' he asked.\n\n'Mining engineer,' I said.  'I've made my pile cleanly and I've had a\ngood time in the making of it.'\n\n'Not a profession that weakens the nerves, is it?'\n\nI laughed.  'Oh, as to that, my nerves are good enough.'  I took down a\nhunting-knife from a stand on the wall, and did the old Mashona trick\nof tossing it and catching it in my lips.  That wants a pretty steady\nheart.\n\nHe watched me with a smile.  'I don't want proof.  I may be an ass on\nthe platform, but I can size up a man.  You're no murderer and you're\nno fool, and I believe you are speaking the truth.  I'm going to back\nyou up.  Now, what can I do?'\n\n'First, I want you to write a letter to your uncle.  I've got to get in\ntouch with the Government people sometime before the 15th of June.'\n\nHe pulled his moustache.  'That won't help you.  This is Foreign Office\nbusiness, and my uncle would have nothing to do with it.  Besides,\nyou'd never convince him.  No, I'll go one better.  I'll write to the\nPermanent Secretary at the Foreign Office.  He's my godfather, and one\nof the best going.  What do you want?'\n\nHe sat down at a table and wrote to my dictation.  The gist of it was\nthat if a man called Twisdon (I thought I had better stick to that\nname) turned up before June 15th he was to entreat him kindly.  He said\nTwisdon would prove his bona fides by passing the word 'Black Stone'\nand whistling 'Annie Laurie'.\n\n'Good,' said Sir Harry.  'That's the proper style.  By the way, you'll\nfind my godfather--his name's Sir Walter Bullivant--down at his country\ncottage for Whitsuntide.  It's close to Artinswell on the Kenner.\nThat's done.  Now, what's the next thing?'\n\n'You're about my height.  Lend me the oldest tweed suit you've got.\nAnything will do, so long as the colour is the opposite of the clothes\nI destroyed this afternoon.  Then show me a map of the neighbourhood\nand explain to me the lie of the land.  Lastly, if the police come\nseeking me, just show them the car in the glen.  If the other lot turn\nup, tell them I caught the south express after your meeting.'\n\nHe did, or promised to do, all these things.  I shaved off the remnants\nof my moustache, and got inside an ancient suit of what I believe is\ncalled heather mixture.  The map gave me some notion of my whereabouts,\nand told me the two things I wanted to know--where the main railway to\nthe south could be joined and what were the wildest districts near at\nhand.  At two o'clock he wakened me from my slumbers in the\nsmoking-room armchair, and led me blinking into the dark starry night.\nAn old bicycle was found in a tool-shed and handed over to me.\n\n'First turn to the right up by the long fir-wood,' he enjoined.  'By\ndaybreak you'll be well into the hills.  Then I should pitch the\nmachine into a bog and take to the moors on foot.  You can put in a\nweek among the shepherds, and be as safe as if you were in New Guinea.'\n\nI pedalled diligently up steep roads of hill gravel till the skies grew\npale with morning.  As the mists cleared before the sun, I found myself\nin a wide green world with glens falling on every side and a far-away\nblue horizon.  Here, at any rate, I could get early news of my enemies.\n\n\n\nCHAPTER FIVE\n\nThe Adventure of the Spectacled Roadman\n\nI sat down on the very crest of the pass and took stock of my position.\n\nBehind me was the road climbing through a long cleft in the hills,\nwhich was the upper glen of some notable river.  In front was a flat\nspace of maybe a mile, all pitted with bog-holes and rough with\ntussocks, and then beyond it the road fell steeply down another glen to\na plain whose blue dimness melted into the distance.  To left and right\nwere round-shouldered green hills as smooth as pancakes, but to the\nsouth--that is, the left hand--there was a glimpse of high heathery\nmountains, which I remembered from the map as the big knot of hill\nwhich I had chosen for my sanctuary.  I was on the central boss of a\nhuge upland country, and could see everything moving for miles.  In the\nmeadows below the road half a mile back a cottage smoked, but it was\nthe only sign of human life.  Otherwise there was only the calling of\nplovers and the tinkling of little streams.\n\nIt was now about seven o'clock, and as I waited I heard once again that\nominous beat in the air.  Then I realized that my vantage-ground might\nbe in reality a trap.  There was no cover for a tomtit in those bald\ngreen places.\n\nI sat quite still and hopeless while the beat grew louder.  Then I saw\nan aeroplane coming up from the east.  It was flying high, but as I\nlooked it dropped several hundred feet and began to circle round the\nknot of hill in narrowing circles, just as a hawk wheels before it\npounces.  Now it was flying very low, and now the observer on board\ncaught sight of me.  I could see one of the two occupants examining me\nthrough glasses.\n\nSuddenly it began to rise in swift whorls, and the next I knew it was\nspeeding eastward again till it became a speck in the blue morning.\n\nThat made me do some savage thinking.  My enemies had located me, and\nthe next thing would be a cordon round me.  I didn't know what force\nthey could command, but I was certain it would be sufficient.  The\naeroplane had seen my bicycle, and would conclude that I would try to\nescape by the road.  In that case there might be a chance on the moors\nto the right or left.  I wheeled the machine a hundred yards from the\nhighway, and plunged it into a moss-hole, where it sank among pond-weed\nand water-buttercups.  Then I climbed to a knoll which gave me a view\nof the two valleys.  Nothing was stirring on the long white ribbon that\nthreaded them.\n\nI have said there was not cover in the whole place to hide a rat.  As\nthe day advanced it was flooded with soft fresh light till it had the\nfragrant sunniness of the South African veld.  At other times I would\nhave liked the place, but now it seemed to suffocate me.  The free\nmoorlands were prison walls, and the keen hill air was the breath of a\ndungeon.\n\nI tossed a coin--heads right, tails left--and it fell heads, so I\nturned to the north.  In a little I came to the brow of the ridge which\nwas the containing wall of the pass.  I saw the highroad for maybe ten\nmiles, and far down it something that was moving, and that I took to be\na motor-car.  Beyond the ridge I looked on a rolling green moor, which\nfell away into wooded glens.\n\nNow my life on the veld has given me the eyes of a kite, and I can see\nthings for which most men need a telescope ...  Away down the slope, a\ncouple of miles away, several men were advancing, like a row of\nbeaters at a shoot ...\n\nI dropped out of sight behind the sky-line.  That way was shut to me,\nand I must try the bigger hills to the south beyond the highway.  The\ncar I had noticed was getting nearer, but it was still a long way off\nwith some very steep gradients before it.  I ran hard, crouching low\nexcept in the hollows, and as I ran I kept scanning the brow of the\nhill before me.  Was it imagination, or did I see figures--one, two,\nperhaps more--moving in a glen beyond the stream?\n\nIf you are hemmed in on all sides in a patch of land there is only one\nchance of escape.  You must stay in the patch, and let your enemies\nsearch it and not find you.  That was good sense, but how on earth was\nI to escape notice in that table-cloth of a place?  I would have buried\nmyself to the neck in mud or lain below water or climbed the tallest\ntree.  But there was not a stick of wood, the bog-holes were little\npuddles, the stream was a slender trickle.  There was nothing but short\nheather, and bare hill bent, and the white highway.\n\nThen in a tiny bight of road, beside a heap of stones, I found the\nroadman.\n\nHe had just arrived, and was wearily flinging down his hammer.  He\nlooked at me with a fishy eye and yawned.\n\n'Confoond the day I ever left the herdin'!' he said, as if to the world\nat large.  'There I was my ain maister.  Now I'm a slave to the\nGoavernment, tethered to the roadside, wi' sair een, and a back like a\nsuckle.'\n\nHe took up the hammer, struck a stone, dropped the implement with an\noath, and put both hands to his ears.  'Mercy on me!  My heid's\nburstin'!' he cried.\n\nHe was a wild figure, about my own size but much bent, with a week's\nbeard on his chin, and a pair of big horn spectacles.\n\n'I canna dae't,' he cried again.  'The Surveyor maun just report me.\nI'm for my bed.'\n\nI asked him what was the trouble, though indeed that was clear enough.\n\n'The trouble is that I'm no sober.  Last nicht my dochter Merran was\nwaddit, and they danced till fower in the byre.  Me and some ither\nchiels sat down to the drinkin', and here I am.  Peety that I ever\nlookit on the wine when it was red!'\n\nI agreed with him about bed.  'It's easy speakin',' he moaned.  'But I\ngot a postcard yestreen sayin' that the new Road Surveyor would be\nround the day.  He'll come and he'll no find me, or else he'll find me\nfou, and either way I'm a done man.  I'll awa' back to my bed and say\nI'm no weel, but I doot that'll no help me, for they ken my kind o'\nno-weel-ness.'\n\nThen I had an inspiration.  'Does the new Surveyor know you?' I asked.\n\n'No him.  He's just been a week at the job.  He rins about in a wee\nmotor-cawr, and wad speir the inside oot o' a whelk.'\n\n'Where's your house?' I asked, and was directed by a wavering finger to\nthe cottage by the stream.\n\n'Well, back to your bed,' I said, 'and sleep in peace.  I'll take on\nyour job for a bit and see the Surveyor.'\n\nHe stared at me blankly; then, as the notion dawned on his fuddled\nbrain, his face broke into the vacant drunkard's smile.\n\n'You're the billy,' he cried.  'It'll be easy eneuch managed.  I've\nfinished that bing o' stanes, so you needna chap ony mair this\nforenoon.  Just take the barry, and wheel eneuch metal frae yon quarry\ndoon the road to mak anither bing the morn.  My name's Alexander\nTurnbull, and I've been seeven year at the trade, and twenty afore that\nherdin' on Leithen Water.  My freens ca' me Ecky, and whiles Specky,\nfor I wear glesses, being waik i' the sicht.  Just you speak the\nSurveyor fair, and ca' him Sir, and he'll be fell pleased.  I'll be\nback or mid-day.'\n\nI borrowed his spectacles and filthy old hat; stripped off coat,\nwaistcoat, and collar, and gave him them to carry home; borrowed, too,\nthe foul stump of a clay pipe as an extra property.  He indicated my\nsimple tasks, and without more ado set off at an amble bedwards.  Bed\nmay have been his chief object, but I think there was also something\nleft in the foot of a bottle.  I prayed that he might be safe under\ncover before my friends arrived on the scene.\n\nThen I set to work to dress for the part.  I opened the collar of my\nshirt--it was a vulgar blue-and-white check such as ploughmen wear--and\nrevealed a neck as brown as any tinker's.  I rolled up my sleeves, and\nthere was a forearm which might have been a blacksmith's, sunburnt and\nrough with old scars.  I got my boots and trouser-legs all white from\nthe dust of the road, and hitched up my trousers, tying them with\nstring below the knee.  Then I set to work on my face.  With a handful\nof dust I made a water-mark round my neck, the place where Mr\nTurnbull's Sunday ablutions might be expected to stop.  I rubbed a good\ndeal of dirt also into the sunburn of my cheeks.  A roadman's eyes\nwould no doubt be a little inflamed, so I contrived to get some dust in\nboth of mine, and by dint of vigorous rubbing produced a bleary effect.\n\nThe sandwiches Sir Harry had given me had gone off with my coat, but\nthe roadman's lunch, tied up in a red handkerchief, was at my disposal.\nI ate with great relish several of the thick slabs of scone and cheese\nand drank a little of the cold tea.  In the handkerchief was a local\npaper tied with string and addressed to Mr Turnbull--obviously meant to\nsolace his mid-day leisure.  I did up the bundle again, and put the\npaper conspicuously beside it.\n\nMy boots did not satisfy me, but by dint of kicking among the stones I\nreduced them to the granite-like surface which marks a roadman's\nfoot-gear.  Then I bit and scraped my finger-nails till the edges were\nall cracked and uneven.  The men I was matched against would miss no\ndetail.  I broke one of the bootlaces and retied it in a clumsy knot,\nand loosed the other so that my thick grey socks bulged over the\nuppers.  Still no sign of anything on the road.  The motor I had\nobserved half an hour ago must have gone home.\n\nMy toilet complete, I took up the barrow and began my journeys to and\nfrom the quarry a hundred yards off.\n\nI remember an old scout in Rhodesia, who had done many queer things in\nhis day, once telling me that the secret of playing a part was to think\nyourself into it.  You could never keep it up, he said, unless you\ncould manage to convince yourself that you were it.  So I shut off all\nother thoughts and switched them on to the road-mending.  I thought of\nthe little white cottage as my home, I recalled the years I had spent\nherding on Leithen Water, I made my mind dwell lovingly on sleep in a\nbox-bed and a bottle of cheap whisky.  Still nothing appeared on that\nlong white road.\n\nNow and then a sheep wandered off the heather to stare at me.  A heron\nflopped down to a pool in the stream and started to fish, taking no\nmore notice of me than if I had been a milestone.  On I went, trundling\nmy loads of stone, with the heavy step of the professional.  Soon I\ngrew warm, and the dust on my face changed into solid and abiding grit.\nI was already counting the hours till evening should put a limit to Mr\nTurnbull's monotonous toil.  Suddenly a crisp voice spoke from the\nroad, and looking up I saw a little Ford two-seater, and a round-faced\nyoung man in a bowler hat.\n\n'Are you Alexander Turnbull?' he asked.  'I am the new County Road\nSurveyor.  You live at Blackhopefoot, and have charge of the section\nfrom Laidlawbyres to the Riggs?  Good!  A fair bit of road, Turnbull,\nand not badly engineered.  A little soft about a mile off, and the\nedges want cleaning.  See you look after that.  Good morning.  You'll\nknow me the next time you see me.'\n\nClearly my get-up was good enough for the dreaded Surveyor.  I went on\nwith my work, and as the morning grew towards noon I was cheered by a\nlittle traffic.  A baker's van breasted the hill, and sold me a bag of\nginger biscuits which I stowed in my trouser-pockets against\nemergencies.  Then a herd passed with sheep, and disturbed me somewhat\nby asking loudly, 'What had become o' Specky?'\n\n'In bed wi' the colic,' I replied, and the herd passed on ...  just\nabout mid-day a big car stole down the hill, glided past and drew up a\nhundred yards beyond.  Its three occupants descended as if to stretch\ntheir legs, and sauntered towards me.\n\nTwo of the men I had seen before from the window of the Galloway\ninn--one lean, sharp, and dark, the other comfortable and smiling.  The\nthird had the look of a countryman--a vet, perhaps, or a small farmer.\nHe was dressed in ill-cut knickerbockers, and the eye in his head was\nas bright and wary as a hen's.\n\n'Morning,' said the last.  'That's a fine easy job o' yours.'\n\nI had not looked up on their approach, and now, when accosted, I slowly\nand painfully straightened my back, after the manner of roadmen; spat\nvigorously, after the manner of the low Scot; and regarded them\nsteadily before replying.  I confronted three pairs of eyes that missed\nnothing.\n\n'There's waur jobs and there's better,' I said sententiously.  'I wad\nrather hae yours, sittin' a' day on your hinderlands on thae cushions.\nIt's you and your muckle cawrs that wreck my roads!  If we a' had oor\nrichts, ye sud be made to mend what ye break.'\n\nThe bright-eyed man was looking at the newspaper lying beside\nTurnbull's bundle.\n\n'I see you get your papers in good time,' he said.\n\nI glanced at it casually.  'Aye, in gude time.  Seein' that that paper\ncam' out last Setterday I'm just Sax days late.'\n\nHe picked it up, glanced at the superscription, and laid it down again.\nOne of the others had been looking at my boots, and a word in German\ncalled the speaker's attention to them.\n\n'You've a fine taste in boots,' he said.  'These were never made by a\ncountry shoemaker.'\n\n'They were not,' I said readily.  'They were made in London.  I got\nthem frae the gentleman that was here last year for the shootin'.  What\nwas his name now?'  And I scratched a forgetful head.  Again the sleek\none spoke in German.  'Let us get on,' he said.  'This fellow is all\nright.'\n\nThey asked one last question.\n\n'Did you see anyone pass early this morning?  He might be on a bicycle\nor he might be on foot.'\n\nI very nearly fell into the trap and told a story of a bicyclist\nhurrying past in the grey dawn.  But I had the sense to see my danger.\nI pretended to consider very deeply.\n\n'I wasna up very early,' I said.  'Ye see, my dochter was merrit last\nnicht, and we keepit it up late.  I opened the house door about seeven\nand there was naebody on the road then.  Since I cam' up here there has\njust been the baker and the Ruchill herd, besides you gentlemen.'\n\nOne of them gave me a cigar, which I smelt gingerly and stuck in\nTurnbull's bundle.  They got into their car and were out of sight in\nthree minutes.\n\nMy heart leaped with an enormous relief, but I went on wheeling my\nstones.  It was as well, for ten minutes later the car returned, one of\nthe occupants waving a hand to me.  Those gentry left nothing to chance.\n\nI finished Turnbull's bread and cheese, and pretty soon I had finished\nthe stones.  The next step was what puzzled me.  I could not keep up\nthis roadmaking business for long.  A merciful Providence had kept Mr\nTurnbull indoors, but if he appeared on the scene there would be\ntrouble.  I had a notion that the cordon was still tight round the\nglen, and that if I walked in any direction I should meet with\nquestioners.  But get out I must.  No man's nerve could stand more than\na day of being spied on.\n\nI stayed at my post till five o'clock.  By that time I had resolved to\ngo down to Turnbull's cottage at nightfall and take my chance of\ngetting over the hills in the darkness.  But suddenly a new car came up\nthe road, and slowed down a yard or two from me.  A fresh wind had\nrisen, and the occupant wanted to light a cigarette.  It was a touring\ncar, with the tonneau full of an assortment of baggage.  One man sat in\nit, and by an amazing chance I knew him.  His name was Marmaduke\nJopley, and he was an offence to creation.  He was a sort of blood\nstockbroker, who did his business by toadying eldest sons and rich\nyoung peers and foolish old ladies.  'Marmie' was a familiar figure, I\nunderstood, at balls and polo-weeks and country houses.  He was an\nadroit scandal-monger, and would crawl a mile on his belly to anything\nthat had a title or a million.  I had a business introduction to his\nfirm when I came to London, and he was good enough to ask me to dinner\nat his club.  There he showed off at a great rate, and pattered about\nhis duchesses till the snobbery of the creature turned me sick.  I\nasked a man afterwards why nobody kicked him, and was told that\nEnglishmen reverenced the weaker sex.\n\nAnyhow there he was now, nattily dressed, in a fine new car, obviously\non his way to visit some of his smart friends.  A sudden daftness took\nme, and in a second I had jumped into the tonneau and had him by the\nshoulder.\n\n'Hullo, Jopley,' I sang out.  'Well met, my lad!'  He got a horrid\nfright.  His chin dropped as he stared at me.  'Who the devil are YOU?'\nhe gasped.\n\n'My name's Hannay,' I said.  'From Rhodesia, you remember.'\n\n'Good God, the murderer!' he choked.\n\n'Just so.  And there'll be a second murder, my dear, if you don't do as\nI tell you.  Give me that coat of yours.  That cap, too.'\n\nHe did as bid, for he was blind with terror.  Over my dirty trousers\nand vulgar shirt I put on his smart driving-coat, which buttoned high\nat the top and thereby hid the deficiencies of my collar.  I stuck the\ncap on my head, and added his gloves to my get-up.  The dusty roadman\nin a minute was transformed into one of the neatest motorists in\nScotland.  On Mr Jopley's head I clapped Turnbull's unspeakable hat,\nand told him to keep it there.\n\nThen with some difficulty I turned the car.  My plan was to go back the\nroad he had come, for the watchers, having seen it before, would\nprobably let it pass unremarked, and Marmie's figure was in no way like\nmine.\n\n'Now, my child,' I said, 'sit quite still and be a good boy.  I mean\nyou no harm.  I'm only borrowing your car for an hour or two.  But if\nyou play me any tricks, and above all if you open your mouth, as sure\nas there's a God above me I'll wring your neck.  SAVEZ?'\n\nI enjoyed that evening's ride.  We ran eight miles down the valley,\nthrough a village or two, and I could not help noticing several\nstrange-looking folk lounging by the roadside.  These were the watchers\nwho would have had much to say to me if I had come in other garb or\ncompany.  As it was, they looked incuriously on.  One touched his cap\nin salute, and I responded graciously.\n\nAs the dark fell I turned up a side glen which, as I remember from the\nmap, led into an unfrequented corner of the hills.  Soon the villages\nwere left behind, then the farms, and then even the wayside cottage.\nPresently we came to a lonely moor where the night was blackening the\nsunset gleam in the bog pools.  Here we stopped, and I obligingly\nreversed the car and restored to Mr Jopley his belongings.\n\n'A thousand thanks,' I said.  'There's more use in you than I thought.\nNow be off and find the police.'\n\nAs I sat on the hillside, watching the tail-light dwindle, I reflected\non the various kinds of crime I had now sampled.  Contrary to general\nbelief, I was not a murderer, but I had become an unholy liar, a\nshameless impostor, and a highwayman with a marked taste for expensive\nmotor-cars.\n\n\n\nCHAPTER SIX\n\nThe Adventure of the Bald Archaeologist\n\nI spent the night on a shelf of the hillside, in the lee of a boulder\nwhere the heather grew long and soft.  It was a cold business, for I\nhad neither coat nor waistcoat.  These were in Mr Turnbull's keeping,\nas was Scudder's little book, my watch and--worst of all--my pipe and\ntobacco pouch.  Only my money accompanied me in my belt, and about half\na pound of ginger biscuits in my trousers pocket.\n\nI supped off half those biscuits, and by worming myself deep into the\nheather got some kind of warmth.  My spirits had risen, and I was\nbeginning to enjoy this crazy game of hide-and-seek.  So far I had been\nmiraculously lucky.  The milkman, the literary innkeeper, Sir Harry,\nthe roadman, and the idiotic Marmie, were all pieces of undeserved good\nfortune.  Somehow the first success gave me a feeling that I was going\nto pull the thing through.\n\nMy chief trouble was that I was desperately hungry.  When a Jew shoots\nhimself in the City and there is an inquest, the newspapers usually\nreport that the deceased was 'well-nourished'.  I remember thinking\nthat they would not call me well-nourished if I broke my neck in a\nbog-hole.  I lay and tortured myself--for the ginger biscuits merely\nemphasized the aching void--with the memory of all the good food I had\nthought so little of in London.  There were Paddock's crisp sausages\nand fragrant shavings of bacon, and shapely poached eggs--how often I\nhad turned up my nose at them!  There were the cutlets they did at the\nclub, and a particular ham that stood on the cold table, for which my\nsoul lusted.  My thoughts hovered over all varieties of mortal edible,\nand finally settled on a porterhouse steak and a quart of bitter with a\nwelsh rabbit to follow.  In longing hopelessly for these dainties I\nfell asleep.\n\nI woke very cold and stiff about an hour after dawn.  It took me a\nlittle while to remember where I was, for I had been very weary and had\nslept heavily.  I saw first the pale blue sky through a net of heather,\nthen a big shoulder of hill, and then my own boots placed neatly in a\nblaeberry bush.  I raised myself on my arms and looked down into the\nvalley, and that one look set me lacing up my boots in mad haste.\n\nFor there were men below, not more than a quarter of a mile off, spaced\nout on the hillside like a fan, and beating the heather.  Marmie had\nnot been slow in looking for his revenge.\n\nI crawled out of my shelf into the cover of a boulder, and from it\ngained a shallow trench which slanted up the mountain face.  This led\nme presently into the narrow gully of a burn, by way of which I\nscrambled to the top of the ridge.  From there I looked back, and saw\nthat I was still undiscovered.  My pursuers were patiently quartering\nthe hillside and moving upwards.\n\nKeeping behind the skyline I ran for maybe half a mile, till I judged I\nwas above the uppermost end of the glen.  Then I showed myself, and was\ninstantly noted by one of the flankers, who passed the word to the\nothers.  I heard cries coming up from below, and saw that the line of\nsearch had changed its direction.  I pretended to retreat over the\nskyline, but instead went back the way I had come, and in twenty\nminutes was behind the ridge overlooking my sleeping place.  From that\nviewpoint I had the satisfaction of seeing the pursuit streaming up the\nhill at the top of the glen on a hopelessly false scent.\n\nI had before me a choice of routes, and I chose a ridge which made an\nangle with the one I was on, and so would soon put a deep glen between\nme and my enemies.  The exercise had warmed my blood, and I was\nbeginning to enjoy myself amazingly.  As I went I breakfasted on the\ndusty remnants of the ginger biscuits.\n\nI knew very little about the country, and I hadn't a notion what I was\ngoing to do.  I trusted to the strength of my legs, but I was well\naware that those behind me would be familiar with the lie of the land,\nand that my ignorance would be a heavy handicap.  I saw in front of me\na sea of hills, rising very high towards the south, but northwards\nbreaking down into broad ridges which separated wide and shallow dales.\nThe ridge I had chosen seemed to sink after a mile or two to a moor\nwhich lay like a pocket in the uplands.  That seemed as good a\ndirection to take as any other.\n\nMy stratagem had given me a fair start--call it twenty minutes--and I\nhad the width of a glen behind me before I saw the first heads of the\npursuers.  The police had evidently called in local talent to their\naid, and the men I could see had the appearance of herds or\ngamekeepers.  They hallooed at the sight of me, and I waved my hand.\nTwo dived into the glen and began to climb my ridge, while the others\nkept their own side of the hill.  I felt as if I were taking part in a\nschoolboy game of hare and hounds.\n\nBut very soon it began to seem less of a game.  Those fellows behind\nwere hefty men on their native heath.  Looking back I saw that only\nthree were following direct, and I guessed that the others had fetched\na circuit to cut me off.  My lack of local knowledge might very well be\nmy undoing, and I resolved to get out of this tangle of glens to the\npocket of moor I had seen from the tops.  I must so increase my\ndistance as to get clear away from them, and I believed I could do this\nif I could find the right ground for it.  If there had been cover I\nwould have tried a bit of stalking, but on these bare slopes you could\nsee a fly a mile off.  My hope must be in the length of my legs and the\nsoundness of my wind, but I needed easier ground for that, for I was\nnot bred a mountaineer.  How I longed for a good Afrikander pony!\n\nI put on a great spurt and got off my ridge and down into the moor\nbefore any figures appeared on the skyline behind me.  I crossed a\nburn, and came out on a highroad which made a pass between two glens.\nAll in front of me was a big field of heather sloping up to a crest\nwhich was crowned with an odd feather of trees.  In the dyke by the\nroadside was a gate, from which a grass-grown track led over the first\nwave of the moor.\n\nI jumped the dyke and followed it, and after a few hundred yards--as\nsoon as it was out of sight of the highway--the grass stopped and it\nbecame a very respectable road, which was evidently kept with some\ncare.  Clearly it ran to a house, and I began to think of doing the\nsame.  Hitherto my luck had held, and it might be that my best chance\nwould be found in this remote dwelling.  Anyhow there were trees there,\nand that meant cover.\n\nI did not follow the road, but the burnside which flanked it on the\nright, where the bracken grew deep and the high banks made a tolerable\nscreen.  It was well I did so, for no sooner had I gained the hollow\nthan, looking back, I saw the pursuit topping the ridge from which I\nhad descended.\n\nAfter that I did not look back; I had no time.  I ran up the burnside,\ncrawling over the open places, and for a large part wading in the\nshallow stream.  I found a deserted cottage with a row of phantom\npeat-stacks and an overgrown garden.  Then I was among young hay, and\nvery soon had come to the edge of a plantation of wind-blown firs.\nFrom there I saw the chimneys of the house smoking a few hundred yards\nto my left.  I forsook the burnside, crossed another dyke, and almost\nbefore I knew was on a rough lawn.  A glance back told me that I was\nwell out of sight of the pursuit, which had not yet passed the first\nlift of the moor.\n\nThe lawn was a very rough place, cut with a scythe instead of a mower,\nand planted with beds of scrubby rhododendrons.  A brace of black-game,\nwhich are not usually garden birds, rose at my approach.  The house\nbefore me was the ordinary moorland farm, with a more pretentious\nwhitewashed wing added.  Attached to this wing was a glass veranda, and\nthrough the glass I saw the face of an elderly gentleman meekly\nwatching me.\n\nI stalked over the border of coarse hill gravel and entered the open\nveranda door.  Within was a pleasant room, glass on one side, and on\nthe other a mass of books.  More books showed in an inner room.  On the\nfloor, instead of tables, stood cases such as you see in a museum,\nfilled with coins and queer stone implements.\n\nThere was a knee-hole desk in the middle, and seated at it, with some\npapers and open volumes before him, was the benevolent old gentleman.\nHis face was round and shiny, like Mr Pickwick's, big glasses were\nstuck on the end of his nose, and the top of his head was as bright and\nbare as a glass bottle.  He never moved when I entered, but raised his\nplacid eyebrows and waited on me to speak.\n\nIt was not an easy job, with about five minutes to spare, to tell a\nstranger who I was and what I wanted, and to win his aid.  I did not\nattempt it.  There was something about the eye of the man before me,\nsomething so keen and knowledgeable, that I could not find a word.  I\nsimply stared at him and stuttered.\n\n'You seem in a hurry, my friend,' he said slowly.\n\nI nodded towards the window.  It gave a prospect across the moor\nthrough a gap in the plantation, and revealed certain figures half a\nmile off straggling through the heather.\n\n'Ah, I see,' he said, and took up a pair of field-glasses through which\nhe patiently scrutinized the figures.\n\n'A fugitive from justice, eh?  Well, we'll go into the matter at our\nleisure.  Meantime I object to my privacy being broken in upon by the\nclumsy rural policeman.  Go into my study, and you will see two doors\nfacing you.  Take the one on the left and close it behind you.  You\nwill be perfectly safe.'\n\nAnd this extraordinary man took up his pen again.\n\nI did as I was bid, and found myself in a little dark chamber which\nsmelt of chemicals, and was lit only by a tiny window high up in the\nwall.  The door had swung behind me with a click like the door of a\nsafe.  Once again I had found an unexpected sanctuary.\n\nAll the same I was not comfortable.  There was something about the old\ngentleman which puzzled and rather terrified me.  He had been too easy\nand ready, almost as if he had expected me.  And his eyes had been\nhorribly intelligent.\n\nNo sound came to me in that dark place.  For all I knew the police\nmight be searching the house, and if they did they would want to know\nwhat was behind this door.  I tried to possess my soul in patience, and\nto forget how hungry I was.\n\nThen I took a more cheerful view.  The old gentleman could scarcely\nrefuse me a meal, and I fell to reconstructing my breakfast.  Bacon and\neggs would content me, but I wanted the better part of a flitch of\nbacon and half a hundred eggs.  And then, while my mouth was watering\nin anticipation, there was a click and the door stood open.\n\nI emerged into the sunlight to find the master of the house sitting in\na deep armchair in the room he called his study, and regarding me with\ncurious eyes.\n\n'Have they gone?' I asked.\n\n'They have gone.  I convinced them that you had crossed the hill.  I do\nnot choose that the police should come between me and one whom I am\ndelighted to honour.  This is a lucky morning for you, Mr Richard\nHannay.'\n\nAs he spoke his eyelids seemed to tremble and to fall a little over his\nkeen grey eyes.  In a flash the phrase of Scudder's came back to me,\nwhen he had described the man he most dreaded in the world.  He had\nsaid that he 'could hood his eyes like a hawk'.  Then I saw that I had\nwalked straight into the enemy's headquarters.\n\nMy first impulse was to throttle the old ruffian and make for the open\nair.  He seemed to anticipate my intention, for he smiled gently, and\nnodded to the door behind me.\n\nI turned, and saw two men-servants who had me covered with pistols.\n\nHe knew my name, but he had never seen me before.  And as the\nreflection darted across my mind I saw a slender chance.\n\n'I don't know what you mean,' I said roughly.  'And who are you calling\nRichard Hannay?  My name's Ainslie.'\n\n'So?' he said, still smiling.  'But of course you have others.  We\nwon't quarrel about a name.'\n\nI was pulling myself together now, and I reflected that my garb,\nlacking coat and waistcoat and collar, would at any rate not betray me.\nI put on my surliest face and shrugged my shoulders.\n\n'I suppose you're going to give me up after all, and I call it a damned\ndirty trick.  My God, I wish I had never seen that cursed motor-car!\nHere's the money and be damned to you,' and I flung four sovereigns on\nthe table.\n\nHe opened his eyes a little.  'Oh no, I shall not give you up.  My\nfriends and I will have a little private settlement with you, that is\nall.  You know a little too much, Mr Hannay.  You are a clever actor,\nbut not quite clever enough.'\n\nHe spoke with assurance, but I could see the dawning of a doubt in his\nmind.\n\n'Oh, for God's sake stop jawing,' I cried.  'Everything's against me.\nI haven't had a bit of luck since I came on shore at Leith.  What's the\nharm in a poor devil with an empty stomach picking up some money he\nfinds in a bust-up motor-car?  That's all I done, and for that I've\nbeen chivvied for two days by those blasted bobbies over those blasted\nhills.  I tell you I'm fair sick of it.  You can do what you like, old\nboy!  Ned Ainslie's got no fight left in him.'\n\nI could see that the doubt was gaining.\n\n'Will you oblige me with the story of your recent doings?' he asked.\n\n'I can't, guv'nor,' I said in a real beggar's whine.  'I've not had\na bite to eat for two days.  Give me a mouthful of food, and then\nyou'll hear God's truth.'\n\nI must have showed my hunger in my face, for he signalled to one of the\nmen in the doorway.  A bit of cold pie was brought and a glass of beer,\nand I wolfed them down like a pig--or rather, like Ned Ainslie, for I\nwas keeping up my character.  In the middle of my meal he spoke\nsuddenly to me in German, but I turned on him a face as blank as a\nstone wall.\n\nThen I told him my story--how I had come off an Archangel ship at Leith\na week ago, and was making my way overland to my brother at Wigtown.  I\nhad run short of cash--I hinted vaguely at a spree--and I was pretty\nwell on my uppers when I had come on a hole in a hedge, and, looking\nthrough, had seen a big motor-car lying in the burn.  I had poked about\nto see what had happened, and had found three sovereigns lying on the\nseat and one on the floor.  There was nobody there or any sign of an\nowner, so I had pocketed the cash.  But somehow the law had got after\nme.  When I had tried to change a sovereign in a baker's shop, the\nwoman had cried on the police, and a little later, when I was washing\nmy face in a burn, I had been nearly gripped, and had only got away by\nleaving my coat and waistcoat behind me.\n\n'They can have the money back,' I cried, 'for a fat lot of good it's\ndone me.  Those perishers are all down on a poor man.  Now, if it had\nbeen you, guv'nor, that had found the quids, nobody would have troubled\nyou.'\n\n'You're a good liar, Hannay,' he said.\n\nI flew into a rage.  'Stop fooling, damn you!  I tell you my name's\nAinslie, and I never heard of anyone called Hannay in my born days.\nI'd sooner have the police than you with your Hannays and your\nmonkey-faced pistol tricks ...  No, guv'nor, I beg pardon, I don't mean\nthat.  I'm much obliged to you for the grub, and I'll thank you to let\nme go now the coast's clear.'\n\nIt was obvious that he was badly puzzled.  You see he had never seen\nme, and my appearance must have altered considerably from my\nphotographs, if he had got one of them.  I was pretty smart and well\ndressed in London, and now I was a regular tramp.\n\n'I do not propose to let you go.  If you are what you say you are, you\nwill soon have a chance of clearing yourself.  If you are what I\nbelieve you are, I do not think you will see the light much longer.'\n\nHe rang a bell, and a third servant appeared from the veranda.\n\n'I want the Lanchester in five minutes,' he said.  'There will be three\nto luncheon.'\n\nThen he looked steadily at me, and that was the hardest ordeal of all.\n\nThere was something weird and devilish in those eyes, cold, malignant,\nunearthly, and most hellishly clever.  They fascinated me like the\nbright eyes of a snake.  I had a strong impulse to throw myself on his\nmercy and offer to join his side, and if you consider the way I felt\nabout the whole thing you will see that that impulse must have been\npurely physical, the weakness of a brain mesmerized and mastered by a\nstronger spirit.  But I managed to stick it out and even to grin.\n\n'You'll know me next time, guv'nor,' I said.\n\n'Karl,' he spoke in German to one of the men in the doorway, 'you will\nput this fellow in the storeroom till I return, and you will be\nanswerable to me for his keeping.'\n\nI was marched out of the room with a pistol at each ear.\n\nThe storeroom was a damp chamber in what had been the old farmhouse.\nThere was no carpet on the uneven floor, and nothing to sit down on but\na school form.  It was black as pitch, for the windows were heavily\nshuttered.  I made out by groping that the walls were lined with boxes\nand barrels and sacks of some heavy stuff.  The whole place smelt of\nmould and disuse.  My gaolers turned the key in the door, and I could\nhear them shifting their feet as they stood on guard outside.\n\nI sat down in that chilly darkness in a very miserable frame of mind.\nThe old boy had gone off in a motor to collect the two ruffians who had\ninterviewed me yesterday.  Now, they had seen me as the roadman, and\nthey would remember me, for I was in the same rig.  What was a roadman\ndoing twenty miles from his beat, pursued by the police?  A question or\ntwo would put them on the track.  Probably they had seen Mr Turnbull,\nprobably Marmie too; most likely they could link me up with Sir Harry,\nand then the whole thing would be crystal clear.  What chance had I in\nthis moorland house with three desperadoes and their armed servants?\n\nI began to think wistfully of the police, now plodding over the hills\nafter my wraith.  They at any rate were fellow-countrymen and honest\nmen, and their tender mercies would be kinder than these ghoulish\naliens.  But they wouldn't have listened to me.  That old devil with\nthe eyelids had not taken long to get rid of them.  I thought he\nprobably had some kind of graft with the constabulary.  Most likely he\nhad letters from Cabinet Ministers saying he was to be given every\nfacility for plotting against Britain.  That's the sort of owlish way\nwe run our politics in the Old Country.\n\nThe three would be back for lunch, so I hadn't more than a couple of\nhours to wait.  It was simply waiting on destruction, for I could see\nno way out of this mess.  I wished that I had Scudder's courage, for I\nam free to confess I didn't feel any great fortitude.  The only thing\nthat kept me going was that I was pretty furious.  It made me boil with\nrage to think of those three spies getting the pull on me like this.  I\nhoped that at any rate I might be able to twist one of their necks\nbefore they downed me.\n\nThe more I thought of it the angrier I grew, and I had to get up and\nmove about the room.  I tried the shutters, but they were the kind that\nlock with a key, and I couldn't move them.  From the outside came the\nfaint clucking of hens in the warm sun.  Then I groped among the sacks\nand boxes.  I couldn't open the latter, and the sacks seemed to be full\nof things like dog-biscuits that smelt of cinnamon.  But, as I\ncircumnavigated the room, I found a handle in the wall which seemed\nworth investigating.\n\nIt was the door of a wall cupboard--what they call a 'press' in\nScotland--and it was locked.  I shook it, and it seemed rather flimsy.\nFor want of something better to do I put out my strength on that door,\ngetting some purchase on the handle by looping my braces round it.\nPresently the thing gave with a crash which I thought would bring in my\nwarders to inquire.  I waited for a bit, and then started to explore\nthe cupboard shelves.\n\nThere was a multitude of queer things there.  I found an odd vesta or\ntwo in my trouser pockets and struck a light.  It was out in a second,\nbut it showed me one thing.  There was a little stock of electric\ntorches on one shelf.  I picked up one, and found it was in working\norder.\n\nWith the torch to help me I investigated further.  There were bottles\nand cases of queer-smelling stuffs, chemicals no doubt for experiments,\nand there were coils of fine copper wire and yanks and yanks of thin\noiled silk.  There was a box of detonators, and a lot of cord for\nfuses.  Then away at the back of the shelf I found a stout brown\ncardboard box, and inside it a wooden case.  I managed to wrench it\nopen, and within lay half a dozen little grey bricks, each a couple of\ninches square.\n\nI took up one, and found that it crumbled easily in my hand.  Then I\nsmelt it and put my tongue to it.  After that I sat down to think.  I\nhadn't been a mining engineer for nothing, and I knew lentonite when I\nsaw it.\n\nWith one of these bricks I could blow the house to smithereens.  I had\nused the stuff in Rhodesia and knew its power.  But the trouble was\nthat my knowledge wasn't exact.  I had forgotten the proper charge and\nthe right way of preparing it, and I wasn't sure about the timing.  I\nhad only a vague notion, too, as to its power, for though I had used it\nI had not handled it with my own fingers.\n\nBut it was a chance, the only possible chance.  It was a mighty risk,\nbut against it was an absolute black certainty.  If I used it the odds\nwere, as I reckoned, about five to one in favour of my blowing myself\ninto the tree-tops; but if I didn't I should very likely be occupying a\nsix-foot hole in the garden by the evening.  That was the way I had to\nlook at it.  The prospect was pretty dark either way, but anyhow there\nwas a chance, both for myself and for my country.\n\nThe remembrance of little Scudder decided me.  It was about the\nbeastliest moment of my life, for I'm no good at these cold-blooded\nresolutions.  Still I managed to rake up the pluck to set my teeth and\nchoke back the horrid doubts that flooded in on me.  I simply shut off\nmy mind and pretended I was doing an experiment as simple as Guy Fawkes\nfireworks.\n\nI got a detonator, and fixed it to a couple of feet of fuse.  Then I\ntook a quarter of a lentonite brick, and buried it near the door below\none of the sacks in a crack of the floor, fixing the detonator in it.\nFor all I knew half those boxes might be dynamite.  If the cupboard\nheld such deadly explosives, why not the boxes?  In that case there\nwould be a glorious skyward journey for me and the German servants and\nabout an acre of surrounding country.  There was also the risk that the\ndetonation might set off the other bricks in the cupboard, for I had\nforgotten most that I knew about lentonite.  But it didn't do to begin\nthinking about the possibilities.  The odds were horrible, but I had to\ntake them.\n\nI ensconced myself just below the sill of the window, and lit the fuse.\nThen I waited for a moment or two.  There was dead silence--only a\nshuffle of heavy boots in the passage, and the peaceful cluck of hens\nfrom the warm out-of-doors.  I commended my soul to my Maker, and\nwondered where I would be in five seconds ...\n\nA great wave of heat seemed to surge upwards from the floor, and hang\nfor a blistering instant in the air.  Then the wall opposite me flashed\ninto a golden yellow and dissolved with a rending thunder that hammered\nmy brain into a pulp.  Something dropped on me, catching the point of\nmy left shoulder.\n\nAnd then I think I became unconscious.\n\nMy stupor can scarcely have lasted beyond a few seconds.  I felt myself\nbeing choked by thick yellow fumes, and struggled out of the debris to\nmy feet.  Somewhere behind me I felt fresh air.  The jambs of the\nwindow had fallen, and through the ragged rent the smoke was pouring\nout to the summer noon.  I stepped over the broken lintel, and found\nmyself standing in a yard in a dense and acrid fog.  I felt very sick\nand ill, but I could move my limbs, and I staggered blindly forward\naway from the house.\n\nA small mill-lade ran in a wooden aqueduct at the other side of the\nyard, and into this I fell.  The cool water revived me, and I had just\nenough wits left to think of escape.  I squirmed up the lade among the\nslippery green slime till I reached the mill-wheel.  Then I wriggled\nthrough the axle hole into the old mill and tumbled on to a bed of\nchaff.  A nail caught the seat of my trousers, and I left a wisp of\nheather-mixture behind me.\n\nThe mill had been long out of use.  The ladders were rotten with age,\nand in the loft the rats had gnawed great holes in the floor.  Nausea\nshook me, and a wheel in my head kept turning, while my left shoulder\nand arm seemed to be stricken with the palsy.  I looked out of the\nwindow and saw a fog still hanging over the house and smoke escaping\nfrom an upper window.  Please God I had set the place on fire, for I\ncould hear confused cries coming from the other side.\n\nBut I had no time to linger, since this mill was obviously a bad\nhiding-place.  Anyone looking for me would naturally follow the lade,\nand I made certain the search would begin as soon as they found that my\nbody was not in the storeroom.  From another window I saw that on the\nfar side of the mill stood an old stone dovecot.  If I could get there\nwithout leaving tracks I might find a hiding-place, for I argued that\nmy enemies, if they thought I could move, would conclude I had made for\nopen country, and would go seeking me on the moor.\n\nI crawled down the broken ladder, scattering chaff behind me to cover\nmy footsteps.  I did the same on the mill floor, and on the threshold\nwhere the door hung on broken hinges.  Peeping out, I saw that between\nme and the dovecot was a piece of bare cobbled ground, where no\nfootmarks would show.  Also it was mercifully hid by the mill buildings\nfrom any view from the house.  I slipped across the space, got to the\nback of the dovecot and prospected a way of ascent.\n\nThat was one of the hardest jobs I ever took on.  My shoulder and arm\nached like hell, and I was so sick and giddy that I was always on the\nverge of falling.  But I managed it somehow.  By the use of out-jutting\nstones and gaps in the masonry and a tough ivy root I got to the top in\nthe end.  There was a little parapet behind which I found space to lie\ndown.  Then I proceeded to go off into an old-fashioned swoon.\n\nI woke with a burning head and the sun glaring in my face.  For a long\ntime I lay motionless, for those horrible fumes seemed to have loosened\nmy joints and dulled my brain.  Sounds came to me from the house--men\nspeaking throatily and the throbbing of a stationary car.  There was a\nlittle gap in the parapet to which I wriggled, and from which I had\nsome sort of prospect of the yard.  I saw figures come out--a servant\nwith his head bound up, and then a younger man in knickerbockers.  They\nwere looking for something, and moved towards the mill.  Then one of\nthem caught sight of the wisp of cloth on the nail, and cried out to\nthe other.  They both went back to the house, and brought two more to\nlook at it.  I saw the rotund figure of my late captor, and I thought I\nmade out the man with the lisp.  I noticed that all had pistols.\n\nFor half an hour they ransacked the mill.  I could hear them kicking\nover the barrels and pulling up the rotten planking.  Then they came\noutside, and stood just below the dovecot arguing fiercely.  The\nservant with the bandage was being soundly rated.  I heard them\nfiddling with the door of the dovecote and for one horrid moment I\nfancied they were coming up.  Then they thought better of it, and went\nback to the house.\n\nAll that long blistering afternoon I lay baking on the rooftop.  Thirst\nwas my chief torment.  My tongue was like a stick, and to make it worse\nI could hear the cool drip of water from the mill-lade.  I watched the\ncourse of the little stream as it came in from the moor, and my fancy\nfollowed it to the top of the glen, where it must issue from an icy\nfountain fringed with cool ferns and mosses.  I would have given a\nthousand pounds to plunge my face into that.\n\nI had a fine prospect of the whole ring of moorland.  I saw the car\nspeed away with two occupants, and a man on a hill pony riding east.  I\njudged they were looking for me, and I wished them joy of their quest.\n\nBut I saw something else more interesting.  The house stood almost on\nthe summit of a swell of moorland which crowned a sort of plateau, and\nthere was no higher point nearer than the big hills six miles off.  The\nactual summit, as I have mentioned, was a biggish clump of trees--firs\nmostly, with a few ashes and beeches.  On the dovecot I was almost on a\nlevel with the tree-tops, and could see what lay beyond.  The wood was\nnot solid, but only a ring, and inside was an oval of green turf, for\nall the world like a big cricket-field.\n\nI didn't take long to guess what it was.  It was an aerodrome, and a\nsecret one.  The place had been most cunningly chosen.  For suppose\nanyone were watching an aeroplane descending here, he would think it\nhad gone over the hill beyond the trees.  As the place was on the top\nof a rise in the midst of a big amphitheatre, any observer from any\ndirection would conclude it had passed out of view behind the hill.\nOnly a man very close at hand would realize that the aeroplane had not\ngone over but had descended in the midst of the wood.  An observer with\na telescope on one of the higher hills might have discovered the truth,\nbut only herds went there, and herds do not carry spy-glasses.  When I\nlooked from the dovecot I could see far away a blue line which I knew\nwas the sea, and I grew furious to think that our enemies had this\nsecret conning-tower to rake our waterways.\n\nThen I reflected that if that aeroplane came back the chances were ten\nto one that I would be discovered.  So through the afternoon I lay and\nprayed for the coming of darkness, and glad I was when the sun went\ndown over the big western hills and the twilight haze crept over the\nmoor.  The aeroplane was late.  The gloaming was far advanced when I\nheard the beat of wings and saw it volplaning downward to its home in\nthe wood.  Lights twinkled for a bit and there was much coming and\ngoing from the house.  Then the dark fell, and silence.\n\nThank God it was a black night.  The moon was well on its last quarter\nand would not rise till late.  My thirst was too great to allow me to\ntarry, so about nine o'clock, so far as I could judge, I started to\ndescend.  It wasn't easy, and half-way down I heard the back door of\nthe house open, and saw the gleam of a lantern against the mill wall.\nFor some agonizing minutes I hung by the ivy and prayed that whoever it\nwas would not come round by the dovecot.  Then the light disappeared,\nand I dropped as softly as I could on to the hard soil of the yard.\n\nI crawled on my belly in the lee of a stone dyke till I reached the\nfringe of trees which surrounded the house.  If I had known how to do\nit I would have tried to put that aeroplane out of action, but I\nrealized that any attempt would probably be futile.  I was pretty\ncertain that there would be some kind of defence round the house, so I\nwent through the wood on hands and knees, feeling carefully every inch\nbefore me.  It was as well, for presently I came on a wire about two\nfeet from the ground.  If I had tripped over that, it would doubtless\nhave rung some bell in the house and I would have been captured.\n\nA hundred yards farther on I found another wire cunningly placed on the\nedge of a small stream.  Beyond that lay the moor, and in five minutes\nI was deep in bracken and heather.  Soon I was round the shoulder of\nthe rise, in the little glen from which the mill-lade flowed.  Ten\nminutes later my face was in the spring, and I was soaking down pints\nof the blessed water.\n\nBut I did not stop till I had put half a dozen miles between me and\nthat accursed dwelling.\n\n\n\nCHAPTER SEVEN\n\nThe Dry-Fly Fisherman\n\nI sat down on a hill-top and took stock of my position.  I wasn't\nfeeling very happy, for my natural thankfulness at my escape was\nclouded by my severe bodily discomfort.  Those lentonite fumes had\nfairly poisoned me, and the baking hours on the dovecot hadn't helped\nmatters.  I had a crushing headache, and felt as sick as a cat.  Also\nmy shoulder was in a bad way.  At first I thought it was only a bruise,\nbut it seemed to be swelling, and I had no use of my left arm.\n\nMy plan was to seek Mr Turnbull's cottage, recover my garments, and\nespecially Scudder's note-book, and then make for the main line and get\nback to the south.  It seemed to me that the sooner I got in touch with\nthe Foreign Office man, Sir Walter Bullivant, the better.  I didn't see\nhow I could get more proof than I had got already.  He must just take\nor leave my story, and anyway, with him I would be in better hands than\nthose devilish Germans.  I had begun to feel quite kindly towards the\nBritish police.\n\nIt was a wonderful starry night, and I had not much difficulty about\nthe road.  Sir Harry's map had given me the lie of the land, and all I\nhad to do was to steer a point or two west of south-west to come to the\nstream where I had met the roadman.  In all these travels I never knew\nthe names of the places, but I believe this stream was no less than the\nupper waters of the river Tweed.  I calculated I must be about eighteen\nmiles distant, and that meant I could not get there before morning.  So\nI must lie up a day somewhere, for I was too outrageous a figure to be\nseen in the sunlight.  I had neither coat, waistcoat, collar, nor hat,\nmy trousers were badly torn, and my face and hands were black with the\nexplosion.  I daresay I had other beauties, for my eyes felt as if they\nwere furiously bloodshot.  Altogether I was no spectacle for\nGod-fearing citizens to see on a highroad.\n\nVery soon after daybreak I made an attempt to clean myself in a hill\nburn, and then approached a herd's cottage, for I was feeling the need\nof food.  The herd was away from home, and his wife was alone, with no\nneighbour for five miles.  She was a decent old body, and a plucky one,\nfor though she got a fright when she saw me, she had an axe handy, and\nwould have used it on any evil-doer.  I told her that I had had a\nfall--I didn't say how--and she saw by my looks that I was pretty sick.\nLike a true Samaritan she asked no questions, but gave me a bowl of\nmilk with a dash of whisky in it, and let me sit for a little by her\nkitchen fire.  She would have bathed my shoulder, but it ached so badly\nthat I would not let her touch it.\n\nI don't know what she took me for--a repentant burglar, perhaps; for\nwhen I wanted to pay her for the milk and tendered a sovereign which\nwas the smallest coin I had, she shook her head and said something\nabout 'giving it to them that had a right to it'.  At this I protested\nso strongly that I think she believed me honest, for she took the money\nand gave me a warm new plaid for it, and an old hat of her man's.  She\nshowed me how to wrap the plaid around my shoulders, and when I left\nthat cottage I was the living image of the kind of Scotsman you see in\nthe illustrations to Burns's poems.  But at any rate I was more or less\nclad.\n\nIt was as well, for the weather changed before midday to a thick\ndrizzle of rain.  I found shelter below an overhanging rock in the\ncrook of a burn, where a drift of dead brackens made a tolerable bed.\nThere I managed to sleep till nightfall, waking very cramped and\nwretched, with my shoulder gnawing like a toothache.  I ate the oatcake\nand cheese the old wife had given me and set out again just before the\ndarkening.\n\nI pass over the miseries of that night among the wet hills.  There were\nno stars to steer by, and I had to do the best I could from my memory\nof the map.  Twice I lost my way, and I had some nasty falls into\npeat-bogs.  I had only about ten miles to go as the crow flies, but my\nmistakes made it nearer twenty.  The last bit was completed with set\nteeth and a very light and dizzy head.  But I managed it, and in the\nearly dawn I was knocking at Mr Turnbull's door.  The mist lay close\nand thick, and from the cottage I could not see the highroad.\n\nMr Turnbull himself opened to me--sober and something more than sober.\nHe was primly dressed in an ancient but well-tended suit of black; he\nhad been shaved not later than the night before; he wore a linen\ncollar; and in his left hand he carried a pocket Bible.  At first he\ndid not recognize me.\n\n'Whae are ye that comes stravaigin' here on the Sabbath mornin'?' he\nasked.\n\nI had lost all count of the days.  So the Sabbath was the reason for\nthis strange decorum.\n\nMy head was swimming so wildly that I could not frame a coherent\nanswer.  But he recognized me, and he saw that I was ill.\n\n'Hae ye got my specs?' he asked.\n\nI fetched them out of my trouser pocket and gave him them.\n\n'Ye'll hae come for your jaicket and westcoat,' he said.  'Come in-bye.\nLosh, man, ye're terrible dune i' the legs.  Haud up till I get ye to a\nchair.'\n\nI perceived I was in for a bout of malaria.  I had a good deal of fever\nin my bones, and the wet night had brought it out, while my shoulder\nand the effects of the fumes combined to make me feel pretty bad.\nBefore I knew, Mr Turnbull was helping me off with my clothes, and\nputting me to bed in one of the two cupboards that lined the kitchen\nwalls.\n\nHe was a true friend in need, that old roadman.  His wife was dead\nyears ago, and since his daughter's marriage he lived alone.\n\nFor the better part of ten days he did all the rough nursing I needed.\nI simply wanted to be left in peace while the fever took its course,\nand when my skin was cool again I found that the bout had more or less\ncured my shoulder.  But it was a baddish go, and though I was out of\nbed in five days, it took me some time to get my legs again.\n\nHe went out each morning, leaving me milk for the day, and locking the\ndoor behind him; and came in in the evening to sit silent in the\nchimney corner.  Not a soul came near the place.  When I was getting\nbetter, he never bothered me with a question.  Several times he fetched\nme a two days' old SCOTSMAN, and I noticed that the interest in the\nPortland Place murder seemed to have died down.  There was no mention\nof it, and I could find very little about anything except a thing\ncalled the General Assembly--some ecclesiastical spree, I gathered.\n\nOne day he produced my belt from a lockfast drawer.  'There's a\nterrible heap o' siller in't,' he said.  'Ye'd better coont it to see\nit's a' there.'\n\nHe never even sought my name.  I asked him if anybody had been around\nmaking inquiries subsequent to my spell at the road-making.\n\n'Ay, there was a man in a motor-cawr.  He speired whae had ta'en my\nplace that day, and I let on I thocht him daft.  But he keepit on at\nme, and syne I said he maun be thinkin' o' my gude-brither frae the\nCleuch that whiles lent me a haun'.  He was a wersh-lookin' sowl, and I\ncouldna understand the half o' his English tongue.'\n\nI was getting restless those last days, and as soon as I felt myself\nfit I decided to be off.  That was not till the twelfth day of June,\nand as luck would have it a drover went past that morning taking some\ncattle to Moffat.  He was a man named Hislop, a friend of Turnbull's,\nand he came in to his breakfast with us and offered to take me with him.\n\nI made Turnbull accept five pounds for my lodging, and a hard job I had\nof it.  There never was a more independent being.  He grew positively\nrude when I pressed him, and shy and red, and took the money at last\nwithout a thank you.  When I told him how much I owed him, he grunted\nsomething about 'ae guid turn deservin' anither'.  You would have\nthought from our leave-taking that we had parted in disgust.\n\nHislop was a cheery soul, who chattered all the way over the pass and\ndown the sunny vale of Annan.  I talked of Galloway markets and sheep\nprices, and he made up his mind I was a 'pack-shepherd' from those\nparts--whatever that may be.  My plaid and my old hat, as I have said,\ngave me a fine theatrical Scots look.  But driving cattle is a mortally\nslow job, and we took the better part of the day to cover a dozen miles.\n\nIf I had not had such an anxious heart I would have enjoyed that time.\nIt was shining blue weather, with a constantly changing prospect of\nbrown hills and far green meadows, and a continual sound of larks and\ncurlews and falling streams.  But I had no mind for the summer, and\nlittle for Hislop's conversation, for as the fateful fifteenth of June\ndrew near I was overweighed with the hopeless difficulties of my\nenterprise.\n\nI got some dinner in a humble Moffat public-house, and walked the two\nmiles to the junction on the main line.  The night express for the\nsouth was not due till near midnight, and to fill up the time I went up\non the hillside and fell asleep, for the walk had tired me.  I all but\nslept too long, and had to run to the station and catch the train with\ntwo minutes to spare.  The feel of the hard third-class cushions and\nthe smell of stale tobacco cheered me up wonderfully.  At any rate, I\nfelt now that I was getting to grips with my job.\n\nI was decanted at Crewe in the small hours and had to wait till six to\nget a train for Birmingham.  In the afternoon I got to Reading, and\nchanged into a local train which journeyed into the deeps of Berkshire.\nPresently I was in a land of lush water-meadows and slow reedy streams.\nAbout eight o'clock in the evening, a weary and travel-stained being--a\ncross between a farm-labourer and a vet--with a checked black-and-white\nplaid over his arm (for I did not dare to wear it south of the Border),\ndescended at the little station of Artinswell.  There were several\npeople on the platform, and I thought I had better wait to ask my way\ntill I was clear of the place.\n\nThe road led through a wood of great beeches and then into a shallow\nvalley, with the green backs of downs peeping over the distant trees.\nAfter Scotland the air smelt heavy and flat, but infinitely sweet, for\nthe limes and chestnuts and lilac bushes were domes of blossom.\nPresently I came to a bridge, below which a clear slow stream flowed\nbetween snowy beds of water-buttercups.  A little above it was a mill;\nand the lasher made a pleasant cool sound in the scented dusk.  Somehow\nthe place soothed me and put me at my ease.  I fell to whistling as I\nlooked into the green depths, and the tune which came to my lips was\n'Annie Laurie'.\n\nA fisherman came up from the waterside, and as he neared me he too\nbegan to whistle.  The tune was infectious, for he followed my suit.\nHe was a huge man in untidy old flannels and a wide-brimmed hat, with a\ncanvas bag slung on his shoulder.  He nodded to me, and I thought I had\nnever seen a shrewder or better-tempered face.  He leaned his delicate\nten-foot split-cane rod against the bridge, and looked with me at the\nwater.\n\n'Clear, isn't it?' he said pleasantly.  'I back our Kenner any day\nagainst the Test.  Look at that big fellow.  Four pounds if he's an\nounce.  But the evening rise is over and you can't tempt 'em.'\n\n'I don't see him,' said I.\n\n'Look!  There!  A yard from the reeds just above that stickle.'\n\n'I've got him now.  You might swear he was a black stone.'\n\n'So,' he said, and whistled another bar of 'Annie Laurie'.\n\n'Twisdon's the name, isn't it?' he said over his shoulder, his eyes\nstill fixed on the stream.\n\n'No,' I said.  'I mean to say, Yes.'  I had forgotten all about my\nalias.\n\n'It's a wise conspirator that knows his own name,' he observed,\ngrinning broadly at a moor-hen that emerged from the bridge's shadow.\n\nI stood up and looked at him, at the square, cleft jaw and broad, lined\nbrow and the firm folds of cheek, and began to think that here at last\nwas an ally worth having.  His whimsical blue eyes seemed to go very\ndeep.\n\nSuddenly he frowned.  'I call it disgraceful,' he said, raising his\nvoice.  'Disgraceful that an able-bodied man like you should dare to\nbeg.  You can get a meal from my kitchen, but you'll get no money from\nme.'\n\nA dog-cart was passing, driven by a young man who raised his whip to\nsalute the fisherman.  When he had gone, he picked up his rod.\n\n'That's my house,' he said, pointing to a white gate a hundred yards\non.  'Wait five minutes and then go round to the back door.' And with\nthat he left me.\n\nI did as I was bidden.  I found a pretty cottage with a lawn running\ndown to the stream, and a perfect jungle of guelder-rose and lilac\nflanking the path.  The back door stood open, and a grave butler was\nawaiting me.\n\n'Come this way, Sir,' he said, and he led me along a passage and up a\nback staircase to a pleasant bedroom looking towards the river.  There\nI found a complete outfit laid out for me--dress clothes with all the\nfixings, a brown flannel suit, shirts, collars, ties, shaving things\nand hair-brushes, even a pair of patent shoes.  'Sir Walter thought as\nhow Mr Reggie's things would fit you, Sir,' said the butler.  'He keeps\nsome clothes 'ere, for he comes regular on the week-ends.  There's a\nbathroom next door, and I've prepared a 'ot bath.  Dinner in 'alf an\nhour, Sir.  You'll 'ear the gong.'\n\nThe grave being withdrew, and I sat down in a chintz-covered easy-chair\nand gaped.  It was like a pantomime, to come suddenly out of beggardom\ninto this orderly comfort.  Obviously Sir Walter believed in me, though\nwhy he did I could not guess.  I looked at myself in the mirror and saw\na wild, haggard brown fellow, with a fortnight's ragged beard, and dust\nin ears and eyes, collarless, vulgarly shirted, with shapeless old\ntweed clothes and boots that had not been cleaned for the better part\nof a month.  I made a fine tramp and a fair drover; and here I was\nushered by a prim butler into this temple of gracious ease.  And the\nbest of it was that they did not even know my name.\n\nI resolved not to puzzle my head but to take the gifts the gods had\nprovided.  I shaved and bathed luxuriously, and got into the dress\nclothes and clean crackling shirt, which fitted me not so badly.  By\nthe time I had finished the looking-glass showed a not unpersonable\nyoung man.\n\nSir Walter awaited me in a dusky dining-room where a little round table\nwas lit with silver candles.  The sight of him--so respectable and\nestablished and secure, the embodiment of law and government and all\nthe conventions--took me aback and made me feel an interloper.  He\ncouldn't know the truth about me, or he wouldn't treat me like this.  I\nsimply could not accept his hospitality on false pretences.\n\n'I'm more obliged to you than I can say, but I'm bound to make things\nclear,' I said.  'I'm an innocent man, but I'm wanted by the police.\nI've got to tell you this, and I won't be surprised if you kick me out.'\n\nHe smiled.  'That's all right.  Don't let that interfere with your\nappetite.  We can talk about these things after dinner.' I never ate a\nmeal with greater relish, for I had had nothing all day but railway\nsandwiches.  Sir Walter did me proud, for we drank a good champagne and\nhad some uncommon fine port afterwards.  It made me almost hysterical\nto be sitting there, waited on by a footman and a sleek butler, and\nremember that I had been living for three weeks like a brigand, with\nevery man's hand against me.  I told Sir Walter about tiger-fish in the\nZambesi that bite off your fingers if you give them a chance, and we\ndiscussed sport up and down the globe, for he had hunted a bit in his\nday.\n\nWe went to his study for coffee, a jolly room full of books and\ntrophies and untidiness and comfort.  I made up my mind that if ever I\ngot rid of this business and had a house of my own, I would create just\nsuch a room.  Then when the coffee-cups were cleared away, and we had\ngot our cigars alight, my host swung his long legs over the side of his\nchair and bade me get started with my yarn.\n\n'I've obeyed Harry's instructions,' he said, 'and the bribe he offered\nme was that you would tell me something to wake me up.  I'm ready, Mr\nHannay.'\n\nI noticed with a start that he called me by my proper name.\n\nI began at the very beginning.  I told of my boredom in London, and the\nnight I had come back to find Scudder gibbering on my doorstep.  I told\nhim all Scudder had told me about Karolides and the Foreign Office\nconference, and that made him purse his lips and grin.\n\nThen I got to the murder, and he grew solemn again.  He heard all about\nthe milkman and my time in Galloway, and my deciphering Scudder's notes\nat the inn.\n\n'You've got them here?' he asked sharply, and drew a long breath when I\nwhipped the little book from my pocket.\n\nI said nothing of the contents.  Then I described my meeting with Sir\nHarry, and the speeches at the hall.  At that he laughed uproariously.\n\n'Harry talked dashed nonsense, did he?  I quite believe it.  He's as\ngood a chap as ever breathed, but his idiot of an uncle has stuffed his\nhead with maggots.  Go on, Mr Hannay.'\n\nMy day as roadman excited him a bit.  He made me describe the two\nfellows in the car very closely, and seemed to be raking back in his\nmemory.  He grew merry again when he heard of the fate of that ass\nJopley.\n\nBut the old man in the moorland house solemnized him.  Again I had to\ndescribe every detail of his appearance.\n\n'Bland and bald-headed and hooded his eyes like a bird ...  He sounds a\nsinister wild-fowl!  And you dynamited his hermitage, after he had\nsaved you from the police.  Spirited piece of work, that!' Presently I\nreached the end of my wanderings.  He got up slowly, and looked down at\nme from the hearth-rug.\n\n'You may dismiss the police from your mind,' he said.  'You're in no\ndanger from the law of this land.'\n\n'Great Scot!' I cried.  'Have they got the murderer?'\n\n'No.  But for the last fortnight they have dropped you from the list of\npossibles.'\n\n'Why?' I asked in amazement.\n\n'Principally because I received a letter from Scudder.  I knew\nsomething of the man, and he did several jobs for me.  He was half\ncrank, half genius, but he was wholly honest.  The trouble about him\nwas his partiality for playing a lone hand.  That made him pretty well\nuseless in any Secret Service--a pity, for he had uncommon gifts.  I\nthink he was the bravest man in the world, for he was always shivering\nwith fright, and yet nothing would choke him off.  I had a letter from\nhim on the 31st of May.'\n\n'But he had been dead a week by then.'\n\n'The letter was written and posted on the 23rd.  He evidently did not\nanticipate an immediate decease.  His communications usually took a\nweek to reach me, for they were sent under cover to Spain and then to\nNewcastle.  He had a mania, you know, for concealing his tracks.'\n\n'What did he say?' I stammered.\n\n'Nothing.  Merely that he was in danger, but had found shelter with a\ngood friend, and that I would hear from him before the 15th of June.\nHe gave me no address, but said he was living near Portland Place.  I\nthink his object was to clear you if anything happened.  When I got it\nI went to Scotland Yard, went over the details of the inquest, and\nconcluded that you were the friend.  We made inquiries about you, Mr\nHannay, and found you were respectable.  I thought I knew the motives\nfor your disappearance--not only the police, the other one too--and\nwhen I got Harry's scrawl I guessed at the rest.  I have been expecting\nyou any time this past week.' You can imagine what a load this took off\nmy mind.  I felt a free man once more, for I was now up against my\ncountry's enemies only, and not my country's law.\n\n'Now let us have the little note-book,' said Sir Walter.\n\nIt took us a good hour to work through it.  I explained the cypher, and\nhe was jolly quick at picking it up.  He emended my reading of it on\nseveral points, but I had been fairly correct, on the whole.  His face\nwas very grave before he had finished, and he sat silent for a while.\n\n'I don't know what to make of it,' he said at last.  'He is right about\none thing--what is going to happen the day after tomorrow.  How the\ndevil can it have got known?  That is ugly enough in itself.  But all\nthis about war and the Black Stone--it reads like some wild melodrama.\nIf only I had more confidence in Scudder's judgement.  The trouble\nabout him was that he was too romantic.  He had the artistic\ntemperament, and wanted a story to be better than God meant it to be.\nHe had a lot of odd biases, too.  Jews, for example, made him see red.\nJews and the high finance.\n\n'The Black Stone,' he repeated.  'DER SCHWARZE STEIN.  It's like a\npenny novelette.  And all this stuff about Karolides.  That is the weak\npart of the tale, for I happen to know that the virtuous Karolides is\nlikely to outlast us both.  There is no State in Europe that wants him\ngone.  Besides, he has just been playing up to Berlin and Vienna and\ngiving my Chief some uneasy moments.  No!  Scudder has gone off the\ntrack there.  Frankly, Hannay, I don't believe that part of his story.\nThere's some nasty business afoot, and he found out too much and lost\nhis life over it.  But I am ready to take my oath that it is ordinary\nspy work.  A certain great European Power makes a hobby of her spy\nsystem, and her methods are not too particular.  Since she pays by\npiecework her blackguards are not likely to stick at a murder or two.\nThey want our naval dispositions for their collection at the Marineamt;\nbut they will be pigeon-holed--nothing more.'\n\nJust then the butler entered the room.\n\n'There's a trunk-call from London, Sir Walter.  It's Mr 'Eath, and he\nwants to speak to you personally.'\n\nMy host went off to the telephone.\n\nHe returned in five minutes with a whitish face.  'I apologize to the\nshade of Scudder,' he said.  'Karolides was shot dead this evening at a\nfew minutes after seven.'\n\n\n\nCHAPTER EIGHT\n\nThe Coming of the Black Stone\n\nI came down to breakfast next morning, after eight hours of blessed\ndreamless sleep, to find Sir Walter decoding a telegram in the midst of\nmuffins and marmalade.  His fresh rosiness of yesterday seemed a\nthought tarnished.\n\n'I had a busy hour on the telephone after you went to bed,' he said.\n'I got my Chief to speak to the First Lord and the Secretary for War,\nand they are bringing Royer over a day sooner.  This wire clinches it.\nHe will be in London at five.  Odd that the code word for a SOUS-CHEF\nD/ETAT MAJOR-GENERAL should be \"Porker\".'\n\nHe directed me to the hot dishes and went on.\n\n'Not that I think it will do much good.  If your friends were clever\nenough to find out the first arrangement they are clever enough to\ndiscover the change.  I would give my head to know where the leak is.\nWe believed there were only five men in England who knew about Royer's\nvisit, and you may be certain there were fewer in France, for they\nmanage these things better there.'\n\nWhile I ate he continued to talk, making me to my surprise a present of\nhis full confidence.\n\n'Can the dispositions not be changed?' I asked.\n\n'They could,' he said.  'But we want to avoid that if possible.  They\nare the result of immense thought, and no alteration would be as good.\nBesides, on one or two points change is simply impossible.  Still,\nsomething could be done, I suppose, if it were absolutely necessary.\nBut you see the difficulty, Hannay.  Our enemies are not going to be\nsuch fools as to pick Royer's pocket or any childish game like that.\nThey know that would mean a row and put us on our guard.  Their aim is\nto get the details without any one of us knowing, so that Royer will go\nback to Paris in the belief that the whole business is still deadly\nsecret.  If they can't do that they fail, for, once we suspect, they\nknow that the whole thing must be altered.'\n\n'Then we must stick by the Frenchman's side till he is home again,' I\nsaid.  'If they thought they could get the information in Paris they\nwould try there.  It means that they have some deep scheme on foot in\nLondon which they reckon is going to win out.'\n\n'Royer dines with my Chief, and then comes to my house where four\npeople will see him--Whittaker from the Admiralty, myself, Sir Arthur\nDrew, and General Winstanley.  The First Lord is ill, and has gone to\nSheringham.  At my house he will get a certain document from Whittaker,\nand after that he will be motored to Portsmouth where a destroyer will\ntake him to Havre.  His journey is too important for the ordinary\nboat-train.  He will never be left unattended for a moment till he is\nsafe on French soil.  The same with Whittaker till he meets Royer.\nThat is the best we can do, and it's hard to see how there can be any\nmiscarriage.  But I don't mind admitting that I'm horribly nervous.\nThis murder of Karolides will play the deuce in the chancelleries of\nEurope.'\n\nAfter breakfast he asked me if I could drive a car.  'Well, you'll be\nmy chauffeur today and wear Hudson's rig.  You're about his size.  You\nhave a hand in this business and we are taking no risks.  There are\ndesperate men against us, who will not respect the country retreat of\nan overworked official.'\n\nWhen I first came to London I had bought a car and amused myself with\nrunning about the south of England, so I knew something of the\ngeography.  I took Sir Walter to town by the Bath Road and made good\ngoing.  It was a soft breathless June morning, with a promise of\nsultriness later, but it was delicious enough swinging through the\nlittle towns with their freshly watered streets, and past the summer\ngardens of the Thames valley.  I landed Sir Walter at his house in\nQueen Anne's Gate punctually by half-past eleven.  The butler was\ncoming up by train with the luggage.\n\nThe first thing he did was to take me round to Scotland Yard.  There we\nsaw a prim gentleman, with a clean-shaven, lawyer's face.\n\n'I've brought you the Portland Place murderer,' was Sir Walter's\nintroduction.\n\nThe reply was a wry smile.  'It would have been a welcome present,\nBullivant.  This, I presume, is Mr Richard Hannay, who for some days\ngreatly interested my department.'\n\n'Mr Hannay will interest it again.  He has much to tell you, but not\ntoday.  For certain grave reasons his tale must wait for four hours.\nThen, I can promise you, you will be entertained and possibly edified.\nI want you to assure Mr Hannay that he will suffer no further\ninconvenience.'\n\nThis assurance was promptly given.  'You can take up your life where\nyou left off,' I was told.  'Your flat, which probably you no longer\nwish to occupy, is waiting for you, and your man is still there.  As\nyou were never publicly accused, we considered that there was no need\nof a public exculpation.  But on that, of course, you must please\nyourself.'\n\n'We may want your assistance later on, MacGillivray,' Sir Walter said\nas we left.\n\nThen he turned me loose.\n\n'Come and see me tomorrow, Hannay.  I needn't tell you to keep deadly\nquiet.  If I were you I would go to bed, for you must have considerable\narrears of sleep to overtake.  You had better lie low, for if one of\nyour Black Stone friends saw you there might be trouble.'\n\nI felt curiously at a loose end.  At first it was very pleasant to be a\nfree man, able to go where I wanted without fearing anything.  I had\nonly been a month under the ban of the law, and it was quite enough for\nme.  I went to the Savoy and ordered very carefully a very good\nluncheon, and then smoked the best cigar the house could provide.  But\nI was still feeling nervous.  When I saw anybody look at me in the\nlounge, I grew shy, and wondered if they were thinking about the murder.\n\nAfter that I took a taxi and drove miles away up into North London.  I\nwalked back through fields and lines of villas and terraces and then\nslums and mean streets, and it took me pretty nearly two hours.  All\nthe while my restlessness was growing worse.  I felt that great things,\ntremendous things, were happening or about to happen, and I, who was\nthe cog-wheel of the whole business, was out of it.  Royer would be\nlanding at Dover, Sir Walter would be making plans with the few people\nin England who were in the secret, and somewhere in the darkness the\nBlack Stone would be working.  I felt the sense of danger and impending\ncalamity, and I had the curious feeling, too, that I alone could avert\nit, alone could grapple with it.  But I was out of the game now.  How\ncould it be otherwise?  It was not likely that Cabinet Ministers and\nAdmiralty Lords and Generals would admit me to their councils.\n\nI actually began to wish that I could run up against one of my three\nenemies.  That would lead to developments.  I felt that I wanted\nenormously to have a vulgar scrap with those gentry, where I could hit\nout and flatten something.  I was rapidly getting into a very bad\ntemper.\n\nI didn't feel like going back to my flat.  That had to be faced some\ntime, but as I still had sufficient money I thought I would put it off\ntill next morning, and go to a hotel for the night.\n\nMy irritation lasted through dinner, which I had at a restaurant in\nJermyn Street.  I was no longer hungry, and let several courses pass\nuntasted.  I drank the best part of a bottle of Burgundy, but it did\nnothing to cheer me.  An abominable restlessness had taken possession\nof me.  Here was I, a very ordinary fellow, with no particular brains,\nand yet I was convinced that somehow I was needed to help this business\nthrough--that without me it would all go to blazes.  I told myself it\nwas sheer silly conceit, that four or five of the cleverest people\nliving, with all the might of the British Empire at their back, had the\njob in hand.  Yet I couldn't be convinced.  It seemed as if a voice\nkept speaking in my ear, telling me to be up and doing, or I would\nnever sleep again.\n\nThe upshot was that about half-past nine I made up my mind to go to\nQueen Anne's Gate.  Very likely I would not be admitted, but it would\nease my conscience to try.\n\nI walked down Jermyn Street, and at the corner of Duke Street passed a\ngroup of young men.  They were in evening dress, had been dining\nsomewhere, and were going on to a music-hall.  One of them was Mr\nMarmaduke Jopley.\n\nHe saw me and stopped short.\n\n'By God, the murderer!' he cried.  'Here, you fellows, hold him!\nThat's Hannay, the man who did the Portland Place murder!'  He gripped\nme by the arm, and the others crowded round.  I wasn't looking for any\ntrouble, but my ill-temper made me play the fool.  A policeman came up,\nand I should have told him the truth, and, if he didn't believe it,\ndemanded to be taken to Scotland Yard, or for that matter to the\nnearest police station.  But a delay at that moment seemed to me\nunendurable, and the sight of Marmie's imbecile face was more than I\ncould bear.  I let out with my left, and had the satisfaction of seeing\nhim measure his length in the gutter.\n\nThen began an unholy row.  They were all on me at once, and the\npoliceman took me in the rear.  I got in one or two good blows, for I\nthink, with fair play, I could have licked the lot of them, but the\npoliceman pinned me behind, and one of them got his fingers on my\nthroat.\n\nThrough a black cloud of rage I heard the officer of the law asking\nwhat was the matter, and Marmie, between his broken teeth, declaring\nthat I was Hannay the murderer.\n\n'Oh, damn it all,' I cried, 'make the fellow shut up.  I advise you to\nleave me alone, constable.  Scotland Yard knows all about me, and\nyou'll get a proper wigging if you interfere with me.'\n\n'You've got to come along of me, young man,' said the policeman.  'I\nsaw you strike that gentleman crool 'ard.  You began it too, for he\nwasn't doing nothing.  I seen you.  Best go quietly or I'll have to fix\nyou up.'\n\nExasperation and an overwhelming sense that at no cost must I delay\ngave me the strength of a bull elephant.  I fairly wrenched the\nconstable off his feet, floored the man who was gripping my collar, and\nset off at my best pace down Duke Street.  I heard a whistle being\nblown, and the rush of men behind me.\n\nI have a very fair turn of speed, and that night I had wings.  In a\njiffy I was in Pall Mall and had turned down towards St James's Park.\nI dodged the policeman at the Palace gates, dived through a press of\ncarriages at the entrance to the Mall, and was making for the bridge\nbefore my pursuers had crossed the roadway.  In the open ways of the\nPark I put on a spurt.  Happily there were few people about and no one\ntried to stop me.  I was staking all on getting to Queen Anne's Gate.\n\nWhen I entered that quiet thoroughfare it seemed deserted.  Sir\nWalter's house was in the narrow part, and outside it three or four\nmotor-cars were drawn up.  I slackened speed some yards off and walked\nbriskly up to the door.  If the butler refused me admission, or if he\neven delayed to open the door, I was done.\n\nHe didn't delay.  I had scarcely rung before the door opened.\n\n'I must see Sir Walter,' I panted.  'My business is desperately\nimportant.'\n\nThat butler was a great man.  Without moving a muscle he held the door\nopen, and then shut it behind me.  'Sir Walter is engaged, Sir, and I\nhave orders to admit no one.  Perhaps you will wait.'\n\nThe house was of the old-fashioned kind, with a wide hall and rooms on\nboth sides of it.  At the far end was an alcove with a telephone and a\ncouple of chairs, and there the butler offered me a seat.\n\n'See here,' I whispered.  'There's trouble about and I'm in it.  But\nSir Walter knows, and I'm working for him.  If anyone comes and asks if\nI am here, tell him a lie.'\n\nHe nodded, and presently there was a noise of voices in the street, and\na furious ringing at the bell.  I never admired a man more than that\nbutler.  He opened the door, and with a face like a graven image waited\nto be questioned.  Then he gave them it.  He told them whose house it\nwas, and what his orders were, and simply froze them off the doorstep.\nI could see it all from my alcove, and it was better than any play.\n\nI hadn't waited long till there came another ring at the bell.  The\nbutler made no bones about admitting this new visitor.\n\nWhile he was taking off his coat I saw who it was.  You couldn't open a\nnewspaper or a magazine without seeing that face--the grey beard cut\nlike a spade, the firm fighting mouth, the blunt square nose, and the\nkeen blue eyes.  I recognized the First Sea Lord, the man, they say,\nthat made the new British Navy.\n\nHe passed my alcove and was ushered into a room at the back of the\nhall.  As the door opened I could hear the sound of low voices.  It\nshut, and I was left alone again.\n\nFor twenty minutes I sat there, wondering what I was to do next.  I was\nstill perfectly convinced that I was wanted, but when or how I had no\nnotion.  I kept looking at my watch, and as the time crept on to\nhalf-past ten I began to think that the conference must soon end.  In a\nquarter of an hour Royer should be speeding along the road to\nPortsmouth ...\n\nThen I heard a bell ring, and the butler appeared.  The door of the\nback room opened, and the First Sea Lord came out.  He walked past me,\nand in passing he glanced in my direction, and for a second we looked\neach other in the face.\n\nOnly for a second, but it was enough to make my heart jump.  I had\nnever seen the great man before, and he had never seen me.  But in that\nfraction of time something sprang into his eyes, and that something was\nrecognition.  You can't mistake it.  It is a flicker, a spark of light,\na minute shade of difference which means one thing and one thing only.\nIt came involuntarily, for in a moment it died, and he passed on.  In a\nmaze of wild fancies I heard the street door close behind him.\n\nI picked up the telephone book and looked up the number of his house.\nWe were connected at once, and I heard a servant's voice.\n\n'Is his Lordship at home?' I asked.\n\n'His Lordship returned half an hour ago,' said the voice, 'and has gone\nto bed.  He is not very well tonight.  Will you leave a message, Sir?'\n\nI rang off and almost tumbled into a chair.  My part in this business\nwas not yet ended.  It had been a close shave, but I had been in time.\n\nNot a moment could be lost, so I marched boldly to the door of that\nback room and entered without knocking.\n\nFive surprised faces looked up from a round table.  There was Sir\nWalter, and Drew the War Minister, whom I knew from his photographs.\nThere was a slim elderly man, who was probably Whittaker, the Admiralty\nofficial, and there was General Winstanley, conspicuous from the long\nscar on his forehead.  Lastly, there was a short stout man with an\niron-grey moustache and bushy eyebrows, who had been arrested in the\nmiddle of a sentence.\n\nSir Walter's face showed surprise and annoyance.\n\n'This is Mr Hannay, of whom I have spoken to you,' he said\napologetically to the company.  'I'm afraid, Hannay, this visit is\nill-timed.'\n\nI was getting back my coolness.  'That remains to be seen, Sir,' I\nsaid; 'but I think it may be in the nick of time.  For God's sake,\ngentlemen, tell me who went out a minute ago?'\n\n'Lord Alloa,' Sir Walter said, reddening with anger.\n\n'It was not,' I cried; 'it was his living image, but it was not Lord\nAlloa.  It was someone who recognized me, someone I have seen in the\nlast month.  He had scarcely left the doorstep when I rang up Lord\nAlloa's house and was told he had come in half an hour before and\nhad gone to bed.'\n\n'Who--who--' someone stammered.\n\n'The Black Stone,' I cried, and I sat down in the chair so recently\nvacated and looked round at five badly scared gentlemen.\n\n\n\nCHAPTER NINE\n\nThe Thirty-Nine Steps\n\n'Nonsense!' said the official from the Admiralty.\n\nSir Walter got up and left the room while we looked blankly at the\ntable.  He came back in ten minutes with a long face.  'I have spoken\nto Alloa,' he said.  'Had him out of bed--very grumpy.  He went\nstraight home after Mulross's dinner.'\n\n'But it's madness,' broke in General Winstanley.  'Do you mean to tell\nme that that man came here and sat beside me for the best part of half\nan hour and that I didn't detect the imposture?  Alloa must be out of\nhis mind.'\n\n'Don't you see the cleverness of it?' I said.  'You were too interested\nin other things to have any eyes.  You took Lord Alloa for granted.  If\nit had been anybody else you might have looked more closely, but it was\nnatural for him to be here, and that put you all to sleep.'\n\nThen the Frenchman spoke, very slowly and in good English.\n\n'The young man is right.  His psychology is good.  Our enemies have not\nbeen foolish!'\n\nHe bent his wise brows on the assembly.\n\n'I will tell you a tale,' he said.  'It happened many years ago in\nSenegal.  I was quartered in a remote station, and to pass the time\nused to go fishing for big barbel in the river.  A little Arab mare\nused to carry my luncheon basket--one of the salted dun breed you got\nat Timbuctoo in the old days.  Well, one morning I had good sport, and\nthe mare was unaccountably restless.  I could hear her whinnying and\nsquealing and stamping her feet, and I kept soothing her with my voice\nwhile my mind was intent on fish.  I could see her all the time, as I\nthought, out of a corner of my eye, tethered to a tree twenty yards\naway.  After a couple of hours I began to think of food.  I collected\nmy fish in a tarpaulin bag, and moved down the stream towards the mare,\ntrolling my line.  When I got up to her I flung the tarpaulin on her\nback--'\n\nHe paused and looked round.\n\n'It was the smell that gave me warning.  I turned my head and found\nmyself looking at a lion three feet off ...  An old man-eater, that was\nthe terror of the village ...  What was left of the mare, a mass of\nblood and bones and hide, was behind him.'\n\n'What happened?' I asked.  I was enough of a hunter to know a true yarn\nwhen I heard it.\n\n'I stuffed my fishing-rod into his jaws, and I had a pistol.  Also my\nservants came presently with rifles.  But he left his mark on me.' He\nheld up a hand which lacked three fingers.\n\n'Consider,' he said.  'The mare had been dead more than an hour, and\nthe brute had been patiently watching me ever since.  I never saw the\nkill, for I was accustomed to the mare's fretting, and I never marked\nher absence, for my consciousness of her was only of something tawny,\nand the lion filled that part.  If I could blunder thus, gentlemen, in\na land where men's senses are keen, why should we busy preoccupied\nurban folk not err also?'\n\nSir Walter nodded.  No one was ready to gainsay him.\n\n'But I don't see,' went on Winstanley.  'Their object was to get these\ndispositions without our knowing it.  Now it only required one of us to\nmention to Alloa our meeting tonight for the whole fraud to be exposed.'\n\nSir Walter laughed dryly.  'The selection of Alloa shows their acumen.\nWhich of us was likely to speak to him about tonight?  Or was he likely\nto open the subject?'\n\nI remembered the First Sea Lord's reputation for taciturnity and\nshortness of temper.\n\n'The one thing that puzzles me,' said the General, 'is what good his\nvisit here would do that spy fellow?  He could not carry away several\npages of figures and strange names in his head.'\n\n'That is not difficult,' the Frenchman replied.  'A good spy is trained\nto have a photographic memory.  Like your own Macaulay.  You noticed he\nsaid nothing, but went through these papers again and again.  I think\nwe may assume that he has every detail stamped on his mind.  When I was\nyounger I could do the same trick.'\n\n'Well, I suppose there is nothing for it but to change the plans,' said\nSir Walter ruefully.\n\nWhittaker was looking very glum.  'Did you tell Lord Alloa what has\nhappened?' he asked.  'No?  Well, I can't speak with absolute\nassurance, but I'm nearly certain we can't make any serious change\nunless we alter the geography of England.'\n\n'Another thing must be said,' it was Royer who spoke.  'I talked freely\nwhen that man was here.  I told something of the military plans of my\nGovernment.  I was permitted to say so much.  But that information\nwould be worth many millions to our enemies.  No, my friends, I see no\nother way.  The man who came here and his confederates must be taken,\nand taken at once.'\n\n'Good God,' I cried, 'and we have not a rag of a clue.'\n\n'Besides,' said Whittaker, 'there is the post.  By this time the news\nwill be on its way.'\n\n'No,' said the Frenchman.  'You do not understand the habits of the\nspy.  He receives personally his reward, and he delivers personally his\nintelligence.  We in France know something of the breed.  There is\nstill a chance, MES AMIS.  These men must cross the sea, and there are\nships to be searched and ports to be watched.  Believe me, the need is\ndesperate for both France and Britain.'\n\nRoyer's grave good sense seemed to pull us together.  He was the man of\naction among fumblers.  But I saw no hope in any face, and I felt none.\nWhere among the fifty millions of these islands and within a dozen\nhours were we to lay hands on the three cleverest rogues in Europe?\n\nThen suddenly I had an inspiration.\n\n'Where is Scudder's book?' I cried to Sir Walter.  'Quick, man, I\nremember something in it.'\n\nHe unlocked the door of a bureau and gave it to me.\n\nI found the place.  THIRTY-NINE STEPS, I read, and again, THIRTY-NINE\nSTEPS--I COUNTED THEM--HIGH TIDE 10.17 P.M.\n\nThe Admiralty man was looking at me as if he thought I had gone mad.\n\n'Don't you see it's a clue,' I shouted.  'Scudder knew where these\nfellows laired--he knew where they were going to leave the country,\nthough he kept the name to himself.  Tomorrow was the day, and it was\nsome place where high tide was at 10.17.'\n\n'They may have gone tonight,' someone said.\n\n'Not they.  They have their own snug secret way, and they won't be\nhurried.  I know Germans, and they are mad about working to a plan.\nWhere the devil can I get a book of Tide Tables?'\n\nWhittaker brightened up.  'It's a chance,' he said.  'Let's go over to\nthe Admiralty.'\n\nWe got into two of the waiting motor-cars--all but Sir Walter, who went\noff to Scotland Yard--to 'mobilize MacGillivray', so he said.  We\nmarched through empty corridors and big bare chambers where the\ncharwomen were busy, till we reached a little room lined with books and\nmaps.  A resident clerk was unearthed, who presently fetched from the\nlibrary the Admiralty Tide Tables.  I sat at the desk and the others\nstood round, for somehow or other I had got charge of this expedition.\n\nIt was no good.  There were hundreds of entries, and so far as I could\nsee 10.17 might cover fifty places.  We had to find some way of\nnarrowing the possibilities.\n\nI took my head in my hands and thought.  There must be some way of\nreading this riddle.  What did Scudder mean by steps?  I thought of\ndock steps, but if he had meant that I didn't think he would have\nmentioned the number.  It must be some place where there were several\nstaircases, and one marked out from the others by having thirty-nine\nsteps.\n\nThen I had a sudden thought, and hunted up all the steamer sailings.\nThere was no boat which left for the Continent at 10.17 p.m.\n\nWhy was high tide so important?  If it was a harbour it must be some\nlittle place where the tide mattered, or else it was a heavy-draught\nboat.  But there was no regular steamer sailing at that hour, and\nsomehow I didn't think they would travel by a big boat from a regular\nharbour.  So it must be some little harbour where the tide was\nimportant, or perhaps no harbour at all.\n\nBut if it was a little port I couldn't see what the steps signified.\nThere were no sets of staircases on any harbour that I had ever seen.\nIt must be some place which a particular staircase identified, and\nwhere the tide was full at 10.17.  On the whole it seemed to me that\nthe place must be a bit of open coast.  But the staircases kept\npuzzling me.\n\nThen I went back to wider considerations.  Whereabouts would a man be\nlikely to leave for Germany, a man in a hurry, who wanted a speedy and\na secret passage?  Not from any of the big harbours.  And not from the\nChannel or the West Coast or Scotland, for, remember, he was starting\nfrom London.  I measured the distance on the map, and tried to put\nmyself in the enemy's shoes.  I should try for Ostend or Antwerp or\nRotterdam, and I should sail from somewhere on the East Coast between\nCromer and Dover.\n\nAll this was very loose guessing, and I don't pretend it was ingenious\nor scientific.  I wasn't any kind of Sherlock Holmes.  But I have\nalways fancied I had a kind of instinct about questions like this.  I\ndon't know if I can explain myself, but I used to use my brains as far\nas they went, and after they came to a blank wall I guessed, and I\nusually found my guesses pretty right.\n\nSo I set out all my conclusions on a bit of Admiralty paper.  They ran\nlike this:\n\n               FAIRLY CERTAIN\n\n     (1)  Place where there are several sets of stairs; one that\n          matters distinguished by having thirty-nine steps.\n\n     (2)  Full tide at 10.17 p.m.  Leaving shore only possible at full\n          tide.\n\n     (3)  Steps not dock steps, and so place probably not harbour.\n\n     (4)  No regular night steamer at 10.17.  Means of transport must\n          be tramp (unlikely), yacht, or fishing-boat.\n\nThere my reasoning stopped.  I made another list, which I headed\n'Guessed', but I was just as sure of the one as the other.\n\n               GUESSED\n\n     (1)  Place not harbour but open coast.\n\n     (2)  Boat small--trawler, yacht, or launch.\n\n     (3)  Place somewhere on East Coast between Cromer and Dover.\n\nIt struck me as odd that I should be sitting at that desk with a\nCabinet Minister, a Field-Marshal, two high Government officials, and a\nFrench General watching me, while from the scribble of a dead man I was\ntrying to drag a secret which meant life or death for us.\n\nSir Walter had joined us, and presently MacGillivray arrived.  He had\nsent out instructions to watch the ports and railway stations for the\nthree men whom I had described to Sir Walter.  Not that he or anybody\nelse thought that that would do much good.\n\n'Here's the most I can make of it,' I said.  'We have got to find a\nplace where there are several staircases down to the beach, one of\nwhich has thirty-nine steps.  I think it's a piece of open coast with\nbiggish cliffs, somewhere between the Wash and the Channel.  Also it's\na place where full tide is at 10.17 tomorrow night.'\n\nThen an idea struck me.  'Is there no Inspector of Coastguards or some\nfellow like that who knows the East Coast?'\n\nWhittaker said there was, and that he lived in Clapham.  He went off in\na car to fetch him, and the rest of us sat about the little room and\ntalked of anything that came into our heads.  I lit a pipe and went\nover the whole thing again till my brain grew weary.\n\nAbout one in the morning the coastguard man arrived.  He was a fine old\nfellow, with the look of a naval officer, and was desperately\nrespectful to the company.  I left the War Minister to cross-examine\nhim, for I felt he would think it cheek in me to talk.\n\n'We want you to tell us the places you know on the East Coast where\nthere are cliffs, and where several sets of steps run down to the\nbeach.'\n\nHe thought for a bit.  'What kind of steps do you mean, Sir?  There are\nplenty of places with roads cut down through the cliffs, and most roads\nhave a step or two in them.  Or do you mean regular staircases--all\nsteps, so to speak?'\n\nSir Arthur looked towards me.  'We mean regular staircases,' I said.\n\nHe reflected a minute or two.  'I don't know that I can think of any.\nWait a second.  There's a place in Norfolk--Brattlesham--beside a\ngolf-course, where there are a couple of staircases, to let the\ngentlemen get a lost ball.'\n\n'That's not it,' I said.\n\n'Then there are plenty of Marine Parades, if that's what you mean.\nEvery seaside resort has them.'\n\nI shook my head.  'It's got to be more retired than that,' I said.\n\n'Well, gentlemen, I can't think of anywhere else.  Of course, there's\nthe Ruff--'\n\n'What's that?' I asked.\n\n'The big chalk headland in Kent, close to Bradgate.  It's got a lot of\nvillas on the top, and some of the houses have staircases down to a\nprivate beach.  It's a very high-toned sort of place, and the residents\nthere like to keep by themselves.'\n\nI tore open the Tide Tables and found Bradgate.  High tide there was at\n10.27 P.m.  on the 15th of June.\n\n'We're on the scent at last,' I cried excitedly.  'How can I find out\nwhat is the tide at the Ruff?'\n\n'I can tell you that, Sir,' said the coastguard man.  'I once was lent\na house there in this very month, and I used to go out at night to the\ndeep-sea fishing.  The tide's ten minutes before Bradgate.'\n\nI closed the book and looked round at the company.\n\n'If one of those staircases has thirty-nine steps we have solved the\nmystery, gentlemen,' I said.  'I want the loan of your car, Sir Walter,\nand a map of the roads.  If Mr MacGillivray will spare me ten minutes,\nI think we can prepare something for tomorrow.'\n\nIt was ridiculous in me to take charge of the business like this, but\nthey didn't seem to mind, and after all I had been in the show from the\nstart.  Besides, I was used to rough jobs, and these eminent gentlemen\nwere too clever not to see it.  It was General Royer who gave me my\ncommission.  'I for one,' he said, 'am content to leave the matter in\nMr Hannay's hands.'\n\nBy half-past three I was tearing past the moonlit hedgerows of Kent,\nwith MacGillivray's best man on the seat beside me.\n\n\n\nCHAPTER TEN\n\nVarious Parties Converging on the Sea\n\nA pink and blue June morning found me at Bradgate looking from the\nGriffin Hotel over a smooth sea to the lightship on the Cock sands\nwhich seemed the size of a bell-buoy.  A couple of miles farther south\nand much nearer the shore a small destroyer was anchored.  Scaife,\nMacGillivray's man, who had been in the Navy, knew the boat, and told\nme her name and her commander's, so I sent off a wire to Sir Walter.\n\nAfter breakfast Scaife got from a house-agent a key for the gates of\nthe staircases on the Ruff.  I walked with him along the sands, and sat\ndown in a nook of the cliffs while he investigated the half-dozen of\nthem.  I didn't want to be seen, but the place at this hour was quite\ndeserted, and all the time I was on that beach I saw nothing but the\nsea-gulls.\n\nIt took him more than an hour to do the job, and when I saw him coming\ntowards me, conning a bit of paper, I can tell you my heart was in my\nmouth.  Everything depended, you see, on my guess proving right.\n\nHe read aloud the number of steps in the different stairs.\n'Thirty-four, thirty-five, thirty-nine, forty-two, forty-seven,' and\n'twenty-one' where the cliffs grew lower.  I almost got up and shouted.\n\nWe hurried back to the town and sent a wire to MacGillivray.  I wanted\nhalf a dozen men, and I directed them to divide themselves among\ndifferent specified hotels.  Then Scaife set out to prospect the house\nat the head of the thirty-nine steps.\n\nHe came back with news that both puzzled and reassured me.  The house\nwas called Trafalgar Lodge, and belonged to an old gentleman called\nAppleton--a retired stockbroker, the house-agent said.  Mr Appleton was\nthere a good deal in the summer time, and was in residence now--had\nbeen for the better part of a week.  Scaife could pick up very little\ninformation about him, except that he was a decent old fellow, who paid\nhis bills regularly, and was always good for a fiver for a local\ncharity.  Then Scaife seemed to have penetrated to the back door of the\nhouse, pretending he was an agent for sewing-machines.  Only three\nservants were kept, a cook, a parlour-maid, and a housemaid, and they\nwere just the sort that you would find in a respectable middle-class\nhousehold.  The cook was not the gossiping kind, and had pretty soon\nshut the door in his face, but Scaife said he was positive she knew\nnothing.  Next door there was a new house building which would give\ngood cover for observation, and the villa on the other side was to let,\nand its garden was rough and shrubby.\n\nI borrowed Scaife's telescope, and before lunch went for a walk along\nthe Ruff.  I kept well behind the rows of villas, and found a good\nobservation point on the edge of the golf-course.  There I had a view\nof the line of turf along the cliff top, with seats placed at\nintervals, and the little square plots, railed in and planted with\nbushes, whence the staircases descended to the beach.  I saw Trafalgar\nLodge very plainly, a red-brick villa with a veranda, a tennis lawn\nbehind, and in front the ordinary seaside flower-garden full of\nmarguerites and scraggy geraniums.  There was a flagstaff from which an\nenormous Union Jack hung limply in the still air.\n\nPresently I observed someone leave the house and saunter along the\ncliff.  When I got my glasses on him I saw it was an old man, wearing\nwhite flannel trousers, a blue serge jacket, and a straw hat.  He\ncarried field-glasses and a newspaper, and sat down on one of the iron\nseats and began to read.  Sometimes he would lay down the paper and\nturn his glasses on the sea.  He looked for a long time at the\ndestroyer.  I watched him for half an hour, till he got up and went\nback to the house for his luncheon, when I returned to the hotel for\nmine.\n\nI wasn't feeling very confident.  This decent common-place dwelling was\nnot what I had expected.  The man might be the bald archaeologist of\nthat horrible moorland farm, or he might not.  He was exactly the kind\nof satisfied old bird you will find in every suburb and every holiday\nplace.  If you wanted a type of the perfectly harmless person you would\nprobably pitch on that.\n\nBut after lunch, as I sat in the hotel porch, I perked up, for I saw\nthe thing I had hoped for and had dreaded to miss.  A yacht came up\nfrom the south and dropped anchor pretty well opposite the Ruff.  She\nseemed about a hundred and fifty tons, and I saw she belonged to the\nSquadron from the white ensign.  So Scaife and I went down to the\nharbour and hired a boatman for an afternoon's fishing.\n\nI spent a warm and peaceful afternoon.  We caught between us about\ntwenty pounds of cod and lythe, and out in that dancing blue sea I took\na cheerier view of things.  Above the white cliffs of the Ruff I saw\nthe green and red of the villas, and especially the great flagstaff of\nTrafalgar Lodge.  About four o'clock, when we had fished enough, I made\nthe boatman row us round the yacht, which lay like a delicate white\nbird, ready at a moment to flee.  Scaife said she must be a fast boat\nfor her build, and that she was pretty heavily engined.\n\nHer name was the ARIADNE, as I discovered from the cap of one of the\nmen who was polishing brasswork.  I spoke to him, and got an answer in\nthe soft dialect of Essex.  Another hand that came along passed me the\ntime of day in an unmistakable English tongue.  Our boatman had an\nargument with one of them about the weather, and for a few minutes we\nlay on our oars close to the starboard bow.\n\nThen the men suddenly disregarded us and bent their heads to their work\nas an officer came along the deck.  He was a pleasant, clean-looking\nyoung fellow, and he put a question to us about our fishing in very\ngood English.  But there could be no doubt about him.  His\nclose-cropped head and the cut of his collar and tie never came out of\nEngland.\n\nThat did something to reassure me, but as we rowed back to Bradgate my\nobstinate doubts would not be dismissed.  The thing that worried me was\nthe reflection that my enemies knew that I had got my knowledge from\nScudder, and it was Scudder who had given me the clue to this place.\nIf they knew that Scudder had this clue, would they not be certain to\nchange their plans?  Too much depended on their success for them to\ntake any risks.  The whole question was how much they understood about\nScudder's knowledge.  I had talked confidently last night about Germans\nalways sticking to a scheme, but if they had any suspicions that I was\non their track they would be fools not to cover it.  I wondered if the\nman last night had seen that I recognized him.  Somehow I did not think\nhe had, and to that I had clung.  But the whole business had never\nseemed so difficult as that afternoon when by all calculations I should\nhave been rejoicing in assured success.\n\nIn the hotel I met the commander of the destroyer, to whom Scaife\nintroduced me, and with whom I had a few words.  Then I thought I would\nput in an hour or two watching Trafalgar Lodge.\n\nI found a place farther up the hill, in the garden of an empty house.\nFrom there I had a full view of the court, on which two figures were\nhaving a game of tennis.  One was the old man, whom I had already seen;\nthe other was a younger fellow, wearing some club colours in the scarf\nround his middle.  They played with tremendous zest, like two city\ngents who wanted hard exercise to open their pores.  You couldn't\nconceive a more innocent spectacle.  They shouted and laughed and\nstopped for drinks, when a maid brought out two tankards on a salver.\nI rubbed my eyes and asked myself if I was not the most immortal fool\non earth.  Mystery and darkness had hung about the men who hunted me\nover the Scotch moor in aeroplane and motor-car, and notably about that\ninfernal antiquarian.  It was easy enough to connect those folk with\nthe knife that pinned Scudder to the floor, and with fell designs on\nthe world's peace.  But here were two guileless citizens taking their\ninnocuous exercise, and soon about to go indoors to a humdrum dinner,\nwhere they would talk of market prices and the last cricket scores and\nthe gossip of their native Surbiton.  I had been making a net to catch\nvultures and falcons, and lo and behold! two plump thrushes had\nblundered into it.\n\nPresently a third figure arrived, a young man on a bicycle, with a bag\nof golf-clubs slung on his back.  He strolled round to the tennis lawn\nand was welcomed riotously by the players.  Evidently they were\nchaffing him, and their chaff sounded horribly English.  Then the plump\nman, mopping his brow with a silk handkerchief, announced that he must\nhave a tub.  I heard his very words--'I've got into a proper lather,'\nhe said.  'This will bring down my weight and my handicap, Bob.  I'll\ntake you on tomorrow and give you a stroke a hole.'  You couldn't find\nanything much more English than that.\n\nThey all went into the house, and left me feeling a precious idiot.  I\nhad been barking up the wrong tree this time.  These men might be\nacting; but if they were, where was their audience?  They didn't know I\nwas sitting thirty yards off in a rhododendron.  It was simply\nimpossible to believe that these three hearty fellows were anything but\nwhat they seemed--three ordinary, game-playing, suburban Englishmen,\nwearisome, if you like, but sordidly innocent.\n\nAnd yet there were three of them; and one was old, and one was plump,\nand one was lean and dark; and their house chimed in with Scudder's\nnotes; and half a mile off was lying a steam yacht with at least one\nGerman officer.  I thought of Karolides lying dead and all Europe\ntrembling on the edge of earthquake, and the men I had left behind me\nin London who were waiting anxiously for the events of the next hours.\nThere was no doubt that hell was afoot somewhere.  The Black Stone had\nwon, and if it survived this June night would bank its winnings.\n\nThere seemed only one thing to do--go forward as if I had no doubts,\nand if I was going to make a fool of myself to do it handsomely.  Never\nin my life have I faced a job with greater disinclination.  I would\nrather in my then mind have walked into a den of anarchists, each with\nhis Browning handy, or faced a charging lion with a popgun, than enter\nthat happy home of three cheerful Englishmen and tell them that their\ngame was up.  How they would laugh at me!\n\nBut suddenly I remembered a thing I once heard in Rhodesia from old\nPeter Pienaar.  I have quoted Peter already in this narrative.  He was\nthe best scout I ever knew, and before he had turned respectable he had\nbeen pretty often on the windy side of the law, when he had been wanted\nbadly by the authorities.  Peter once discussed with me the question of\ndisguises, and he had a theory which struck me at the time.  He said,\nbarring absolute certainties like fingerprints, mere physical traits\nwere very little use for identification if the fugitive really knew his\nbusiness.  He laughed at things like dyed hair and false beards and\nsuch childish follies.  The only thing that mattered was what Peter\ncalled 'atmosphere'.\n\nIf a man could get into perfectly different surroundings from those in\nwhich he had been first observed, and--this is the important\npart--really play up to these surroundings and behave as if he had\nnever been out of them, he would puzzle the cleverest detectives on\nearth.  And he used to tell a story of how he once borrowed a black\ncoat and went to church and shared the same hymn-book with the man that\nwas looking for him.  If that man had seen him in decent company before\nhe would have recognized him; but he had only seen him snuffing the\nlights in a public-house with a revolver.\n\nThe recollection of Peter's talk gave me the first real comfort that I\nhad had that day.  Peter had been a wise old bird, and these fellows I\nwas after were about the pick of the aviary.  What if they were playing\nPeter's game?  A fool tries to look different: a clever man looks the\nsame and is different.\n\nAgain, there was that other maxim of Peter's which had helped me when I\nhad been a roadman.  'If you are playing a part, you will never keep it\nup unless you convince yourself that you are it.'  That would explain\nthe game of tennis.  Those chaps didn't need to act, they just turned a\nhandle and passed into another life, which came as naturally to them as\nthe first.  It sounds a platitude, but Peter used to say that it was\nthe big secret of all the famous criminals.\n\nIt was now getting on for eight o'clock, and I went back and saw Scaife\nto give him his instructions.  I arranged with him how to place his\nmen, and then I went for a walk, for I didn't feel up to any dinner.  I\nwent round the deserted golf-course, and then to a point on the cliffs\nfarther north beyond the line of the villas.\n\nOn the little trim newly-made roads I met people in flannels coming\nback from tennis and the beach, and a coastguard from the wireless\nstation, and donkeys and pierrots padding homewards.  Out at sea in the\nblue dusk I saw lights appear on the ARIADNE and on the destroyer away\nto the south, and beyond the Cock sands the bigger lights of steamers\nmaking for the Thames.  The whole scene was so peaceful and ordinary\nthat I got more dashed in spirits every second.  It took all my\nresolution to stroll towards Trafalgar Lodge about half-past nine.\n\nOn the way I got a piece of solid comfort from the sight of a greyhound\nthat was swinging along at a nursemaid's heels.  He reminded me of a\ndog I used to have in Rhodesia, and of the time when I took him hunting\nwith me in the Pali hills.  We were after rhebok, the dun kind, and I\nrecollected how we had followed one beast, and both he and I had clean\nlost it.  A greyhound works by sight, and my eyes are good enough, but\nthat buck simply leaked out of the landscape.  Afterwards I found out\nhow it managed it.  Against the grey rock of the kopjes it showed no\nmore than a crow against a thundercloud.  It didn't need to run away;\nall it had to do was to stand still and melt into the background.\n\nSuddenly as these memories chased across my brain I thought of my\npresent case and applied the moral.  The Black Stone didn't need to\nbolt.  They were quietly absorbed into the landscape.  I was on the\nright track, and I jammed that down in my mind and vowed never to\nforget it.  The last word was with Peter Pienaar.\n\nScaife's men would be posted now, but there was no sign of a soul.  The\nhouse stood as open as a market-place for anybody to observe.  A\nthree-foot railing separated it from the cliff road; the windows on the\nground-floor were all open, and shaded lights and the low sound of\nvoices revealed where the occupants were finishing dinner.  Everything\nwas as public and above-board as a charity bazaar.  Feeling the\ngreatest fool on earth, I opened the gate and rang the bell.\n\nA man of my sort, who has travelled about the world in rough places,\ngets on perfectly well with two classes, what you may call the upper\nand the lower.  He understands them and they understand him.  I was at\nhome with herds and tramps and roadmen, and I was sufficiently at my\nease with people like Sir Walter and the men I had met the night\nbefore.  I can't explain why, but it is a fact.  But what fellows like\nme don't understand is the great comfortable, satisfied middle-class\nworld, the folk that live in villas and suburbs.  He doesn't know how\nthey look at things, he doesn't understand their conventions, and he is\nas shy of them as of a black mamba.  When a trim parlour-maid opened\nthe door, I could hardly find my voice.\n\nI asked for Mr Appleton, and was ushered in.  My plan had been to walk\nstraight into the dining-room, and by a sudden appearance wake in the\nmen that start of recognition which would confirm my theory.  But when\nI found myself in that neat hall the place mastered me.  There were the\ngolf-clubs and tennis-rackets, the straw hats and caps, the rows of\ngloves, the sheaf of walking-sticks, which you will find in ten\nthousand British homes.  A stack of neatly folded coats and waterproofs\ncovered the top of an old oak chest; there was a grandfather clock\nticking; and some polished brass warming-pans on the walls, and a\nbarometer, and a print of Chiltern winning the St Leger.  The place was\nas orthodox as an Anglican church.  When the maid asked me for my name\nI gave it automatically, and was shown into the smoking-room, on the\nright side of the hall.\n\nThat room was even worse.  I hadn't time to examine it, but I could see\nsome framed group photographs above the mantelpiece, and I could have\nsworn they were English public school or college.  I had only one\nglance, for I managed to pull myself together and go after the maid.\nBut I was too late.  She had already entered the dining-room and given\nmy name to her master, and I had missed the chance of seeing how the\nthree took it.\n\nWhen I walked into the room the old man at the head of the table had\nrisen and turned round to meet me.  He was in evening dress--a short\ncoat and black tie, as was the other, whom I called in my own mind the\nplump one.  The third, the dark fellow, wore a blue serge suit and a\nsoft white collar, and the colours of some club or school.\n\nThe old man's manner was perfect.  'Mr Hannay?' he said hesitatingly.\n'Did you wish to see me?  One moment, you fellows, and I'll rejoin you.\nWe had better go to the smoking-room.'\n\nThough I hadn't an ounce of confidence in me, I forced myself to play\nthe game.  I pulled up a chair and sat down on it.\n\n'I think we have met before,' I said, 'and I guess you know my\nbusiness.'\n\nThe light in the room was dim, but so far as I could see their faces,\nthey played the part of mystification very well.\n\n'Maybe, maybe,' said the old man.  'I haven't a very good memory, but\nI'm afraid you must tell me your errand, Sir, for I really don't know\nit.'\n\n'Well, then,' I said, and all the time I seemed to myself to be talking\npure foolishness--'I have come to tell you that the game's up.  I have\na warrant for the arrest of you three gentlemen.'\n\n'Arrest,' said the old man, and he looked really shocked.  'Arrest!\nGood God, what for?'\n\n'For the murder of Franklin Scudder in London on the 23rd day of last\nmonth.'\n\n'I never heard the name before,' said the old man in a dazed voice.\n\nOne of the others spoke up.  'That was the Portland Place murder.  I\nread about it.  Good heavens, you must be mad, Sir!  Where do you come\nfrom?'\n\n'Scotland Yard,' I said.\n\nAfter that for a minute there was utter silence.  The old man was\nstaring at his plate and fumbling with a nut, the very model of\ninnocent bewilderment.\n\nThen the plump one spoke up.  He stammered a little, like a man picking\nhis words.\n\n'Don't get flustered, uncle,' he said.  'It is all a ridiculous\nmistake; but these things happen sometimes, and we can easily set it\nright.  It won't be hard to prove our innocence.  I can show that I was\nout of the country on the 23rd of May, and Bob was in a nursing home.\nYou were in London, but you can explain what you were doing.'\n\n'Right, Percy!  Of course that's easy enough.  The 23rd!  That was the\nday after Agatha's wedding.  Let me see.  What was I doing?  I came up\nin the morning from Woking, and lunched at the club with Charlie\nSymons.  Then--oh yes, I dined with the Fishmongers.  I remember, for\nthe punch didn't agree with me, and I was seedy next morning.  Hang it\nall, there's the cigar-box I brought back from the dinner.'  He pointed\nto an object on the table, and laughed nervously.\n\n'I think, Sir,' said the young man, addressing me respectfully, 'you\nwill see you are mistaken.  We want to assist the law like all\nEnglishmen, and we don't want Scotland Yard to be making fools of\nthemselves.  That's so, uncle?'\n\n'Certainly, Bob.'  The old fellow seemed to be recovering his voice.\n'Certainly, we'll do anything in our power to assist the authorities.\nBut--but this is a bit too much.  I can't get over it.'\n\n'How Nellie will chuckle,' said the plump man.  'She always said that\nyou would die of boredom because nothing ever happened to you.  And now\nyou've got it thick and strong,' and he began to laugh very pleasantly.\n\n'By Jove, yes.  Just think of it!  What a story to tell at the club.\nReally, Mr Hannay, I suppose I should be angry, to show my innocence,\nbut it's too funny!  I almost forgive you the fright you gave me!  You\nlooked so glum, I thought I might have been walking in my sleep and\nkilling people.'\n\nIt couldn't be acting, it was too confoundedly genuine.  My heart went\ninto my boots, and my first impulse was to apologize and clear out.\nBut I told myself I must see it through, even though I was to be the\nlaughing-stock of Britain.  The light from the dinner-table\ncandlesticks was not very good, and to cover my confusion I got up,\nwalked to the door and switched on the electric light.  The sudden\nglare made them blink, and I stood scanning the three faces.\n\nWell, I made nothing of it.  One was old and bald, one was stout, one\nwas dark and thin.  There was nothing in their appearance to prevent\nthem being the three who had hunted me in Scotland, but there was\nnothing to identify them.  I simply can't explain why I who, as a\nroadman, had looked into two pairs of eyes, and as Ned Ainslie into\nanother pair, why I, who have a good memory and reasonable powers of\nobservation, could find no satisfaction.  They seemed exactly what they\nprofessed to be, and I could not have sworn to one of them.\n\nThere in that pleasant dining-room, with etchings on the walls, and a\npicture of an old lady in a bib above the mantelpiece, I could see\nnothing to connect them with the moorland desperadoes.  There was a\nsilver cigarette-box beside me, and I saw that it had been won by\nPercival Appleton, Esq., of the St Bede's Club, in a golf tournament.\nI had to keep a firm hold of Peter Pienaar to prevent myself bolting\nout of that house.\n\n'Well,' said the old man politely, 'are you reassured by your scrutiny,\nSir?'\n\nI couldn't find a word.\n\n'I hope you'll find it consistent with your duty to drop this\nridiculous business.  I make no complaint, but you'll see how annoying\nit must be to respectable people.'\n\nI shook my head.\n\n'O Lord,' said the young man.  'This is a bit too thick!'\n\n'Do you propose to march us off to the police station?' asked the plump\none.  'That might be the best way out of it, but I suppose you won't be\ncontent with the local branch.  I have the right to ask to see your\nwarrant, but I don't wish to cast any aspersions upon you.  You are\nonly doing your duty.  But you'll admit it's horribly awkward.  What do\nyou propose to do?'\n\nThere was nothing to do except to call in my men and have them\narrested, or to confess my blunder and clear out.  I felt mesmerized by\nthe whole place, by the air of obvious innocence--not innocence merely,\nbut frank honest bewilderment and concern in the three faces.\n\n'Oh, Peter Pienaar,' I groaned inwardly, and for a moment I was very\nnear damning myself for a fool and asking their pardon.\n\n'Meantime I vote we have a game of bridge,' said the plump one.  'It\nwill give Mr Hannay time to think over things, and you know we have\nbeen wanting a fourth player.  Do you play, Sir?'\n\nI accepted as if it had been an ordinary invitation at the club.  The\nwhole business had mesmerized me.  We went into the smoking-room where\na card-table was set out, and I was offered things to smoke and drink.\nI took my place at the table in a kind of dream.  The window was open\nand the moon was flooding the cliffs and sea with a great tide of\nyellow light.  There was moonshine, too, in my head.  The three had\nrecovered their composure, and were talking easily--just the kind of\nslangy talk you will hear in any golf club-house.  I must have cut a\nrum figure, sitting there knitting my brows with my eyes wandering.\n\nMy partner was the young dark one.  I play a fair hand at bridge, but I\nmust have been rank bad that night.  They saw that they had got me\npuzzled, and that put them more than ever at their ease.  I kept\nlooking at their faces, but they conveyed nothing to me.  It was not\nthat they looked different; they were different.  I clung desperately\nto the words of Peter Pienaar.\n\nThen something awoke me.\n\nThe old man laid down his hand to light a cigar.  He didn't pick it up\nat once, but sat back for a moment in his chair, with his fingers\ntapping on his knees.\n\nIt was the movement I remembered when I had stood before him in the\nmoorland farm, with the pistols of his servants behind me.\n\nA little thing, lasting only a second, and the odds were a thousand to\none that I might have had my eyes on my cards at the time and missed\nit.  But I didn't, and, in a flash, the air seemed to clear.  Some\nshadow lifted from my brain, and I was looking at the three men with\nfull and absolute recognition.\n\nThe clock on the mantelpiece struck ten o'clock.\n\nThe three faces seemed to change before my eyes and reveal their\nsecrets.  The young one was the murderer.  Now I saw cruelty and\nruthlessness, where before I had only seen good-humour.  His knife, I\nmade certain, had skewered Scudder to the floor.  His kind had put the\nbullet in Karolides.\n\nThe plump man's features seemed to dislimn, and form again, as I looked\nat them.  He hadn't a face, only a hundred masks that he could assume\nwhen he pleased.  That chap must have been a superb actor.  Perhaps he\nhad been Lord Alloa of the night before; perhaps not; it didn't matter.\nI wondered if he was the fellow who had first tracked Scudder, and left\nhis card on him.  Scudder had said he lisped, and I could imagine how\nthe adoption of a lisp might add terror.\n\nBut the old man was the pick of the lot.  He was sheer brain, icy,\ncool, calculating, as ruthless as a steam hammer.  Now that my eyes\nwere opened I wondered where I had seen the benevolence.  His jaw was\nlike chilled steel, and his eyes had the inhuman luminosity of a\nbird's.  I went on playing, and every second a greater hate welled up\nin my heart.  It almost choked me, and I couldn't answer when my\npartner spoke.  Only a little longer could I endure their company.\n\n'Whew!  Bob!  Look at the time,' said the old man.  'You'd better think\nabout catching your train.  Bob's got to go to town tonight,' he added,\nturning to me.  The voice rang now as false as hell.  I looked at the\nclock, and it was nearly half-past ten.\n\n'I am afraid he must put off his journey,' I said.\n\n'Oh, damn,' said the young man.  'I thought you had dropped that rot.\nI've simply got to go.  You can have my address, and I'll give any\nsecurity you like.'\n\n'No,' I said, 'you must stay.'\n\nAt that I think they must have realized that the game was desperate.\nTheir only chance had been to convince me that I was playing the fool,\nand that had failed.  But the old man spoke again.\n\n'I'll go bail for my nephew.  That ought to content you, Mr Hannay.'\nWas it fancy, or did I detect some halt in the smoothness of that voice?\n\nThere must have been, for as I glanced at him, his eyelids fell in that\nhawk-like hood which fear had stamped on my memory.\n\nI blew my whistle.\n\nIn an instant the lights were out.  A pair of strong arms gripped me\nround the waist, covering the pockets in which a man might be expected\nto carry a pistol.\n\n'SCHNELL, FRANZ,' cried a voice, 'DAS BOOT, DAS BOOT!'  As it spoke I\nsaw two of my fellows emerge on the moonlit lawn.\n\nThe young dark man leapt for the window, was through it, and over the\nlow fence before a hand could touch him.  I grappled the old chap, and\nthe room seemed to fill with figures.  I saw the plump one collared,\nbut my eyes were all for the out-of-doors, where Franz sped on over the\nroad towards the railed entrance to the beach stairs.  One man followed\nhim, but he had no chance.  The gate of the stairs locked behind the\nfugitive, and I stood staring, with my hands on the old boy's throat,\nfor such a time as a man might take to descend those steps to the sea.\n\nSuddenly my prisoner broke from me and flung himself on the wall.\nThere was a click as if a lever had been pulled.  Then came a low\nrumbling far, far below the ground, and through the window I saw a\ncloud of chalky dust pouring out of the shaft of the stairway.\n\nSomeone switched on the light.\n\nThe old man was looking at me with blazing eyes.\n\n'He is safe,' he cried.  'You cannot follow in time ...  He is gone ...\nHe has triumphed ...  DER SCHWARZE STEIN IST IN DER SIEGESKRONE.'\n\nThere was more in those eyes than any common triumph.  They had been\nhooded like a bird of prey, and now they flamed with a hawk's pride.  A\nwhite fanatic heat burned in them, and I realized for the first time\nthe terrible thing I had been up against.  This man was more than a\nspy; in his foul way he had been a patriot.\n\nAs the handcuffs clinked on his wrists I said my last word to him.\n\n'I hope Franz will bear his triumph well.  I ought to tell you that the\nARIADNE for the last hour has been in our hands.'\n\n\nThree weeks later, as all the world knows, we went to war.  I joined\nthe New Army the first week, and owing to my Matabele experience got a\ncaptain's commission straight off.  But I had done my best service, I\nthink, before I put on khaki.", "title": "The Thirty-Nine Steps"}