{"summary": "\nA spectre is haunting Europe—the spectre of communism.\n\nThe Communist Manifesto is divided into a preamble and four sections, the last of these a short conclusion. The introduction begins by proclaiming \"A spectre is haunting Europe—the spectre of communism. All the powers of old Europe have entered into a holy alliance to exorcise this spectre\". Pointing out that parties everywhere—including those in government and those in the opposition—have flung the \"branding reproach of communism\" at each other, the authors infer from this that the powers-that-be acknowledge communism to be a power in itself. Subsequently, the introduction exhorts Communists to openly publish their views and aims, to \"meet this nursery tale of the spectre of communism with a manifesto of the party itself\".\nThe first section of the Manifesto, \"Bourgeois and Proletarians\", elucidates the materialist conception of history, that \"the history of all hitherto existing society is the history of class struggles\". Societies have always taken the form of an oppressed majority living under the thumb of an oppressive minority. In capitalism, the industrial working class, or proletariat, engage in class struggle against the owners of the means of production, the bourgeoisie. As before, this struggle will end in a revolution that restructures society, or the \"common ruin of the contending classes\". The bourgeoisie, through the \"constant revolutionising of production [and] uninterrupted disturbance of all social conditions\" have emerged as the supreme class in society, displacing all the old powers of feudalism. The bourgeoisie constantly exploits the proletariat for its labour power, creating profit for themselves accumulating capital. However by doing so the bourgeoisie \"are its own grave-diggers\"; the proletariat inevitably will become conscious of their own potential and rise to power through revolution, overthrowing the bourgeoisie.\n\"Proletarians and Communists\", the second section, starts by stating the relationship of conscious communists to the rest of the working class. The communists' party will not oppose other working-class parties, but unlike them, it will express the general will and defend the common interests of the world's proletariat as a whole, independent of all nationalities. The section goes on to defend communism from various objections, including claims that it advocates \"free love\" or discentivises people from working. The section ends by outlining a set of short-term demands—among them a progressive income tax; abolition of inheritances; free public education etc.—the implementation of which would be a precursor to a stateless and classless society.\nThe third section, \"Socialist and Communist Literature\", distinguishes communism from other socialist doctrines prevalent at the time—these being broadly categorised as Reactionary Socialism; Conservative or Bourgeois Socialism; and Critical-Utopian Socialism and Communism. While the degree of reproach toward rival perspectives varies, all are dismissed for advocating reformism and failing to recognise the pre-eminent revolutionary role of the working class. \"Position of the Communists in Relation to the Various Opposition Parties\", the concluding section of the Manifesto, briefly discusses the communist position on struggles in specific countries in the mid-nineteenth century such as France, Switzerland, Poland, and Germany, this last being \"on the eve of a bourgeois revolution\", and predicts that a world revolution will soon follow. It ends by declaring an alliance with the social democrats, boldly supporting other communist revolutions, and calling for united international proletarian action.\n\nWorking Men of All Countries, Unite!\n\n", "full_text": "Transcribed by Allen Lutins with assistance from Jim Tarzia.\n\n\n\n\n\n\n\n\nMANIFESTO OF THE COMMUNIST PARTY\n\n[From the English edition of 1888, edited by Friedrich Engels]\n\n\nA spectre is haunting Europe--the spectre of Communism.\nAll the Powers of old Europe have entered into a holy alliance to\nexorcise this spectre: Pope and Czar, Metternich and Guizot,\nFrench Radicals and German police-spies.\n\nWhere is the party in opposition that has not been decried as\nCommunistic by its opponents in power?  Where is the Opposition\nthat has not hurled back the branding reproach of Communism,\nagainst the more advanced opposition parties, as well as against\nits reactionary adversaries?\n\nTwo things result from this fact.\n\nI.  Communism is already acknowledged by all European Powers\nto be itself a Power.\n\nII.  It is high time that Communists should openly, in the\nface of the whole world, publish their views, their aims, their\ntendencies, and meet this nursery tale of the Spectre of\nCommunism with a Manifesto of the party itself.\n\nTo this end, Communists of various nationalities have\nassembled in London, and sketched the following Manifesto, to be\npublished in the English, French, German, Italian, Flemish and\nDanish languages.\n\n\n\nI.  BOURGEOIS AND PROLETARIANS\n\nThe history of all hitherto existing societies is the history\nof class struggles.\n\nFreeman and slave, patrician and plebeian, lord and serf,\nguild-master and journeyman, in a word, oppressor and oppressed,\nstood in constant opposition to one another, carried on an\nuninterrupted, now hidden, now open fight, a fight that each time\nended, either in a revolutionary re-constitution of society at\nlarge, or in the common ruin of the contending classes.\n\nIn the earlier epochs of history, we find almost everywhere a\ncomplicated arrangement of society into various orders, a\nmanifold gradation of social rank.  In ancient Rome we have\npatricians, knights, plebeians, slaves; in the Middle Ages,\nfeudal lords, vassals, guild-masters, journeymen, apprentices,\nserfs; in almost all of these classes, again, subordinate\ngradations.\n\nThe modern bourgeois society that has sprouted from the ruins\nof feudal society has not done away with class antagonisms.  It\nhas but established new classes, new conditions of oppression,\nnew forms of struggle in place of the old ones.  Our epoch, the\nepoch of the bourgeoisie, possesses, however, this distinctive\nfeature: it has simplified the class antagonisms. Society as a\nwhole is more and more splitting up into two great hostile camps,\ninto two great classes, directly facing each other: Bourgeoisie\nand Proletariat.\n\nFrom the serfs of the Middle Ages sprang the chartered burghers\nof the earliest towns.  From these burgesses the first elements\nof the bourgeoisie were developed.\n\nThe discovery of America, the rounding of the Cape, opened up\nfresh ground for the rising bourgeoisie. The East-Indian and\nChinese markets, the colonisation of America, trade with\nthe colonies, the increase in the means of exchange and in\ncommodities generally, gave to commerce, to navigation, to\nindustry, an impulse never before known, and thereby, to the\nrevolutionary element in the tottering feudal society, a rapid\ndevelopment.\n\nThe feudal system of industry, under which industrial production\nwas monopolised by closed guilds, now no longer sufficed for the\ngrowing wants of the new markets.  The manufacturing system took\nits place.  The guild-masters were pushed on one side by the\nmanufacturing middle class; division of labour between the\ndifferent corporate guilds vanished in the face of division of\nlabour in each single workshop.\n\nMeantime the markets kept ever growing, the demand ever rising.\nEven manufacture no longer sufficed.  Thereupon, steam and\nmachinery revolutionised industrial production.  The place of\nmanufacture was taken by the giant, Modern Industry, the place of\nthe industrial middle class, by industrial millionaires, the\nleaders of whole industrial armies, the modern bourgeois.\n\nModern industry has established the world-market, for which the\ndiscovery of America paved the way.  This market has given an\nimmense development to commerce, to navigation, to communication\nby land.  This development has, in its time, reacted on the\nextension of industry; and in proportion as industry, commerce,\nnavigation, railways extended, in the same proportion the\nbourgeoisie developed, increased its capital, and pushed into the\nbackground  every class handed down from the Middle Ages.\n\nWe see, therefore, how the modern bourgeoisie is itself the\nproduct of a long course of development, of a series of\nrevolutions in the modes of production and of exchange.\n\nEach step in the development of the bourgeoisie was accompanied\nby a corresponding political advance of that class.  An\noppressed class under the sway of the feudal nobility, an\narmed and self-governing association in the mediaeval commune;\nhere independent urban republic (as in Italy and Germany),\nthere taxable \"third estate\" of the monarchy (as in France),\nafterwards, in the  period of manufacture proper, serving either\nthe semi-feudal or the absolute monarchy as a counterpoise\nagainst the nobility, and, in fact, corner-stone of the great\nmonarchies in general, the bourgeoisie has at last, since the\nestablishment of Modern Industry and of the world-market,\nconquered for itself, in the modern representative State,\nexclusive political sway.  The executive of the modern State is\nbut a committee for managing the common affairs of the whole\nbourgeoisie.\n\nThe bourgeoisie, historically, has played a most revolutionary\npart.\n\nThe bourgeoisie, wherever it has got the upper hand, has put an\nend to all feudal, patriarchal, idyllic relations.  It has\npitilessly torn asunder the motley feudal ties that bound man to\nhis \"natural superiors,\" and has left remaining no other nexus\nbetween man and man than naked self-interest, than callous \"cash\npayment.\"  It has drowned the most heavenly ecstasies of\nreligious fervour, of chivalrous enthusiasm, of philistine\nsentimentalism, in the icy water of egotistical calculation.  It\nhas resolved personal worth into exchange value, and in place of\nthe numberless and indefeasible chartered freedoms, has set up that\nsingle, unconscionable freedom--Free Trade.  In one word, for\nexploitation, veiled by religious and political illusions, naked,\nshameless, direct, brutal exploitation.\n\nThe bourgeoisie has stripped of its halo every occupation\nhitherto honoured and looked up to with reverent awe.  It has\nconverted the physician, the lawyer, the priest, the poet, the\nman of science, into its paid wage labourers.\n\nThe bourgeoisie has torn away from the family its sentimental\nveil, and has reduced the family relation to a mere money\nrelation.\n\nThe bourgeoisie has disclosed how it came to pass that the\nbrutal display of vigour in the Middle Ages, which Reactionists\nso much admire, found its fitting complement in the most slothful\nindolence.  It has been the first to show what man's activity can\nbring about.  It has accomplished wonders far surpassing Egyptian\npyramids, Roman aqueducts, and Gothic cathedrals; it has\nconducted expeditions that put in the shade all former Exoduses\nof nations and crusades.\n\nThe bourgeoisie cannot exist without constantly revolutionising\nthe instruments of production, and thereby the relations of\nproduction, and with them the whole relations of society.\nConservation of the old modes of production in unaltered form,\nwas, on the contrary, the first condition of existence for all\nearlier industrial classes. Constant revolutionising of\nproduction, uninterrupted disturbance of all social conditions,\neverlasting uncertainty and agitation distinguish the bourgeois\nepoch from all earlier ones. All fixed, fast-frozen relations,\nwith their train of ancient and venerable prejudices and\nopinions, are swept away, all new-formed ones become antiquated\nbefore they can ossify. All that is solid melts into air, all\nthat is holy is profaned, and man is at last compelled to face\nwith sober senses, his real conditions of life, and his\nrelations with his kind.\n\nThe need of a constantly expanding market for its products\nchases the bourgeoisie over the whole surface of the globe. It\nmust nestle everywhere, settle everywhere, establish connexions\neverywhere.\n\nThe bourgeoisie has through its exploitation of the world-market\ngiven a cosmopolitan character to production and consumption in\nevery country.  To the great chagrin of Reactionists, it has\ndrawn from under the feet of industry the national ground on\nwhich it stood.  All old-established national industries have\nbeen destroyed or are daily being destroyed.  They are dislodged\nby new industries, whose introduction becomes a life and death\nquestion for all civilised nations, by industries that no longer\nwork up indigenous raw material, but raw material drawn from the\nremotest zones; industries whose products are consumed, not only\nat home, but in every quarter of the globe.  In place of the old\nwants, satisfied by the productions of the country, we find new\nwants, requiring for their satisfaction the products of distant\nlands and climes.  In place of the old local and national\nseclusion and self-sufficiency, we have intercourse in every\ndirection, universal inter-dependence of nations.  And as in\nmaterial, so also in intellectual production.  The intellectual\ncreations of individual nations become common property.  National\none-sidedness and narrow-mindedness become more and more\nimpossible, and from the numerous national and local literatures,\nthere arises a world literature.\n\nThe bourgeoisie, by the rapid improvement of all instruments of\nproduction, by the immensely facilitated means of communication,\ndraws all, even the most barbarian, nations into civilisation.\nThe cheap prices of its commodities are the heavy artillery with\nwhich it batters down all Chinese walls, with which it forces the\nbarbarians' intensely obstinate hatred of foreigners to\ncapitulate.  It compels all nations, on pain of extinction, to\nadopt the bourgeois mode of production; it compels them to\nintroduce what it calls civilisation into their midst, i.e., to\nbecome bourgeois themselves.  In one word, it creates a world\nafter its own image.\n\nThe bourgeoisie has subjected the country to the rule of the\ntowns.  It has created enormous cities, has greatly increased the\nurban population as compared with the rural, and has thus rescued\na considerable part of the population from the idiocy of rural\nlife.  Just as it has made the country dependent on the towns, so\nit has made barbarian and semi-barbarian countries dependent on\nthe civilised ones, nations of peasants on nations of bourgeois,\nthe East on the West.\n\nThe bourgeoisie keeps more and more doing away with the\nscattered state of the population, of the means of production,\nand of property.  It has agglomerated production, and has\nconcentrated property in a few hands.  The necessary consequence\nof this was political centralisation.  Independent, or but\nloosely connected provinces, with separate interests, laws,\ngovernments and systems of taxation, became lumped together into\none nation, with one government, one code of laws, one national\nclass-interest, one frontier and one customs-tariff.  The\nbourgeoisie, during its rule of scarce one hundred years, has\ncreated more massive and more colossal productive forces than\nhave all preceding generations together.  Subjection of Nature's\nforces to man, machinery, application of chemistry to industry\nand agriculture, steam-navigation, railways, electric telegraphs,\nclearing of whole continents for cultivation, canalisation of\nrivers, whole populations conjured out of the ground--what\nearlier century had even a presentiment that such productive\nforces slumbered in the lap of social labour?\n\nWe see then: the means of production and of exchange, on whose\nfoundation the bourgeoisie built itself up, were generated in\nfeudal society.  At a certain stage in the development of these\nmeans of production and of exchange, the conditions under which\nfeudal society produced and exchanged, the feudal organisation of\nagriculture and manufacturing industry, in one word, the feudal\nrelations of property became no longer compatible with the\nalready developed productive forces; they became so many fetters.\nThey had to be burst asunder; they were burst asunder.\n\nInto their place stepped free competition, accompanied by a\nsocial and political constitution adapted to it, and by the\neconomical and political sway of the bourgeois class.\n\nA similar movement is going on before our own eyes.  Modern\nbourgeois society with its relations of production, of exchange\nand of property, a society that has conjured up such gigantic\nmeans of production and of exchange, is like the sorcerer, who is\nno longer able to control the powers of the nether world whom he\nhas called up by his spells.  For many a decade past the history\nof industry and commerce is but the history of the revolt of\nmodern productive forces against modern conditions of production,\nagainst the property relations that are the conditions for the\nexistence of the bourgeoisie and of its rule.  It is enough to\nmention the commercial crises that by their periodical return put\non its trial, each time more threateningly, the existence of the\nentire bourgeois society.  In these crises a great part not only\nof the existing products, but also of the previously created\nproductive forces, are periodically destroyed.  In these crises\nthere breaks out an epidemic that, in all earlier epochs, would\nhave seemed an absurdity--the epidemic of over-production.\nSociety suddenly finds itself put back into a state of momentary\nbarbarism; it appears as if a famine, a universal war of\ndevastation had cut off the supply of every means of subsistence;\nindustry and commerce seem to be destroyed; and why?  Because\nthere is too much civilisation, too much means of subsistence,\ntoo much industry, too much commerce.  The productive forces at\nthe disposal of society no longer tend to further the development\nof the conditions of bourgeois property; on the contrary, they\nhave become too powerful for these conditions, by which they are\nfettered, and so soon as they overcome these fetters, they bring\ndisorder into the whole of bourgeois society, endanger the\nexistence of bourgeois property.  The conditions of bourgeois\nsociety are too narrow to comprise the wealth created by them.\nAnd how does the bourgeoisie get over these crises?  On the one\nhand inforced destruction of a mass of productive forces; on the\nother, by the conquest of new markets, and by the more thorough\nexploitation of the old ones.  That is to say, by paving the\nway for more extensive and more destructive crises, and by\ndiminishing the means whereby crises are prevented.\n\nThe weapons with which the bourgeoisie felled feudalism to the\nground are now turned against the bourgeoisie itself.\n\nBut not only has the bourgeoisie forged the weapons that bring\ndeath to itself; it has also called into existence the men who\nare to wield those weapons--the modern working class--the\nproletarians.\n\nIn proportion as the bourgeoisie, i.e., capital, is developed,\nin the same proportion is the proletariat, the modern working\nclass, developed--a class of labourers, who live only so long\nas they find work, and who find work only so long as their labour\nincreases capital.  These labourers, who must sell themselves\npiece-meal, are a commodity, like every other article of\ncommerce, and are consequently exposed to all the vicissitudes of\ncompetition, to all the fluctuations of the market.\n\nOwing to the extensive use of machinery and to division of\nlabour, the work of the proletarians has lost all individual\ncharacter, and consequently, all charm for the workman.  He\nbecomes an appendage of the machine, and it is only the most\nsimple, most monotonous, and most easily acquired knack, that is\nrequired of him.  Hence, the cost of production of a workman is\nrestricted, almost entirely, to the means of subsistence that he\nrequires for his maintenance, and for the propagation of his\nrace.  But the price of a commodity, and therefore also of\nlabour, is equal to its cost of production.  In proportion\ntherefore, as the repulsiveness of the work increases, the wage\ndecreases.  Nay more, in proportion as the use of machinery and\ndivision of labour increases, in the same proportion the burden\nof toil also increases, whether by prolongation of the working\nhours, by increase of the work exacted in a given time or by\nincreased speed of the machinery, etc.\n\nModern industry has converted the little workshop of the\npatriarchal master into the great factory of the industrial\ncapitalist.  Masses of labourers, crowded into the factory, are\norganised like soldiers.  As privates of the industrial army they\nare placed under the command of a perfect hierarchy of officers\nand sergeants.  Not only are they slaves of the bourgeois class,\nand of the bourgeois State; they are daily and hourly enslaved by\nthe machine, by the over-looker, and, above all, by the\nindividual bourgeois manufacturer himself.  The more openly this\ndespotism proclaims gain to be its end and aim, the more petty,\nthe more hateful and the more embittering it is.\n\nThe less the skill and exertion of strength implied in manual\nlabour, in other words, the more modern industry becomes\ndeveloped, the more is the labour of men superseded by that of\nwomen. Differences of age and sex have no longer any distinctive\nsocial validity for the working class. All are instruments of\nlabour, more or less expensive to use, according to their age\nand sex.\n\nNo sooner is the exploitation of the labourer by the manufacturer,\nso far at an end, that he receives his wages in cash, than he is\nset upon by the other portions of the bourgeoisie, the landlord,\nthe shopkeeper, the pawnbroker, etc.\n\nThe lower strata of the middle class--the small tradespeople,\nshopkeepers, retired tradesmen generally, the handicraftsmen and\npeasants--all these sink gradually into the proletariat, partly\nbecause their diminutive capital does not suffice for the scale\non which Modern Industry is carried on, and is swamped in the\ncompetition with the large capitalists, partly because their\nspecialized skill is rendered worthless by the new methods of\nproduction.  Thus the proletariat is recruited from all classes\nof the population.\n\nThe proletariat goes through various stages of development.\nWith its birth begins its struggle with the bourgeoisie.  At\nfirst the contest is carried on by individual labourers, then by\nthe workpeople of a factory, then by the operatives of one trade,\nin one locality, against the individual bourgeois who directly\nexploits them.  They direct their attacks not against the\nbourgeois conditions of production, but against the instruments\nof production themselves; they destroy imported wares that\ncompete with their labour, they smash to pieces machinery, they\nset factories ablaze, they seek to restore by force the vanished\nstatus of the workman of the Middle Ages.\n\nAt this stage the labourers still form an incoherent mass\nscattered over the whole country, and broken up by their mutual\ncompetition.  If anywhere they unite to form more compact bodies,\nthis is not yet the consequence of their own active union, but of\nthe union of the bourgeoisie, which class, in order to attain its\nown political ends, is compelled to set the whole proletariat in\nmotion, and is moreover yet, for a time, able to do so.  At this\nstage, therefore, the proletarians do not fight their enemies,\nbut the enemies of their enemies, the remnants of absolute\nmonarchy, the landowners, the non-industrial bourgeois, the petty\nbourgeoisie.  Thus the whole historical movement is concentrated\nin the hands of the bourgeoisie; every victory so obtained is a\nvictory for the bourgeoisie.\n\nBut with the development of industry the proletariat not only\nincreases in number; it becomes concentrated in greater masses,\nits strength grows, and it feels that strength more.  The various\ninterests and conditions of life within the ranks of the\nproletariat are more and more equalised, in proportion as\nmachinery obliterates all distinctions of labour, and nearly\neverywhere reduces wages to the same low level.  The growing\ncompetition among the bourgeois, and the resulting commercial\ncrises, make the wages of the workers ever more fluctuating.  The\nunceasing improvement of machinery, ever more rapidly developing,\nmakes their livelihood more and more precarious; the collisions\nbetween individual workmen and individual bourgeois take more and\nmore the character of collisions between two classes.  Thereupon\nthe workers begin to form combinations (Trades Unions) against\nthe bourgeois; they club together in order to keep up the rate of\nwages; they found permanent associations in order to make\nprovision beforehand for these occasional revolts.  Here and\nthere the contest breaks out into riots.\n\nNow and then the workers are victorious, but only for a time.\nThe real fruit of their battles lies, not in the immediate\nresult, but in the ever-expanding union of the workers.  This\nunion is helped on by the improved means of communication that\nare created by modern industry and that place the workers of\ndifferent localities in contact with one another.  It was just\nthis contact that was needed to centralise the numerous local\nstruggles, all of the same character, into one national struggle\nbetween classes.  But every class struggle is a political\nstruggle.  And that union, to attain which the burghers of the\nMiddle Ages, with their miserable highways, required centuries,\nthe modern proletarians, thanks to railways, achieve in a few\nyears.\n\nThis organisation of the proletarians into a class, and\nconsequently into a political party, is continually being upset\nagain by the competition between the workers themselves.  But it\never rises up again, stronger, firmer, mightier.  It compels\nlegislative recognition of particular interests of the workers,\nby taking advantage of the divisions among the bourgeoisie\nitself.  Thus the ten-hours' bill in England was carried.\n\nAltogether collisions between the classes of the old society\nfurther, in many ways, the course of development of the\nproletariat. The bourgeoisie finds itself involved in a constant\nbattle. At first with the aristocracy; later on, with those\nportions of the bourgeoisie itself, whose interests have become\nantagonistic to the progress of industry; at all times, with the\nbourgeoisie of foreign countries. In all these battles it sees\nitself compelled to appeal to the proletariat, to ask for its\nhelp, and thus, to drag it into the political arena. The\nbourgeoisie itself, therefore, supplies the proletariat with its\nown instruments of political and general education, in other\nwords, it furnishes the proletariat with weapons for fighting\nthe bourgeoisie.\n\nFurther, as we have already seen, entire sections of the ruling\nclasses are, by the advance of industry, precipitated into the\nproletariat, or are at least threatened in their conditions of\nexistence.  These also supply the proletariat with fresh elements\nof enlightenment and progress.\n\nFinally, in times when the class struggle nears the decisive\nhour, the process of dissolution going on within the ruling\nclass, in fact within the whole range of society, assumes such a\nviolent, glaring character, that a small section of the ruling\nclass cuts itself adrift, and joins the revolutionary class, the\nclass that holds the future in its hands.  Just as, therefore, at\nan earlier period, a section of the nobility went over to the\nbourgeoisie, so now a portion of the bourgeoisie goes over to the\nproletariat, and in particular, a portion of the bourgeois\nideologists, who have raised themselves to the level of\ncomprehending theoretically the historical movement as a whole.\n\nOf all the classes that stand face to face with the bourgeoisie\ntoday, the proletariat alone is a really revolutionary class.\nThe other classes decay and finally disappear in the face of\nModern Industry; the proletariat is its special and essential\nproduct.  The lower middle class, the small manufacturer, the\nshopkeeper, the artisan, the peasant, all these fight against the\nbourgeoisie, to save from extinction their existence as fractions\nof the middle class.  They are therefore not revolutionary, but\nconservative.  Nay more, they are reactionary, for they try\nto roll back the wheel of history.  If by chance they are\nrevolutionary, they are so only in view of their impending\ntransfer into the proletariat, they thus defend not their\npresent, but their future interests, they desert their own\nstandpoint to place themselves at that of the proletariat.\n\nThe \"dangerous class,\" the social scum, that passively rotting\nmass thrown off by the lowest layers of old society, may,\nhere and there, be swept into the movement by a proletarian\nrevolution; its conditions of life, however, prepare it far more\nfor the part of a bribed tool of reactionary intrigue.\n\nIn the conditions of the proletariat, those of old society at\nlarge are already virtually swamped.  The proletarian is without\nproperty; his relation to his wife and children has no longer\nanything in common with the bourgeois family-relations; modern\nindustrial labour, modern subjection to capital, the same in\nEngland as in France, in America as in Germany, has stripped him\nof every trace of national character.  Law, morality, religion,\nare to him so many bourgeois prejudices, behind which lurk in\nambush just as many bourgeois interests.\n\nAll the preceding classes that got the upper hand, sought to\nfortify their already acquired status by subjecting society at\nlarge to their conditions of appropriation.  The proletarians\ncannot become masters of the productive forces of society, except\nby abolishing their own previous mode of appropriation, and\nthereby also every other previous mode of appropriation.  They\nhave nothing of their own to secure and to fortify; their mission\nis to destroy all previous securities for, and insurances of,\nindividual property.\n\nAll previous historical movements were movements of minorities,\nor in the interests of minorities.  The proletarian movement is\nthe self-conscious, independent movement of the immense majority,\nin the interests of the immense majority.  The proletariat, the\nlowest stratum of our present society, cannot stir, cannot raise\nitself up, without the whole superincumbent strata of official\nsociety being sprung into the air.\n\nThough not in substance, yet in form, the struggle of the\nproletariat with the bourgeoisie is at first a national struggle.\nThe proletariat of each country must, of course, first of all\nsettle matters with its own bourgeoisie.\n\nIn depicting the most general phases of the development of the\nproletariat, we traced the more or less veiled civil war, raging\nwithin existing society, up to the point where that war breaks\nout into open revolution, and where the violent overthrow of the\nbourgeoisie lays the foundation for the sway of the proletariat.\n\nHitherto, every form of society has been based, as we have\nalready seen, on the antagonism of oppressing and oppressed\nclasses.  But in order to oppress a class, certain conditions\nmust be assured to it under which it can, at least, continue its\nslavish existence.  The serf, in the period of serfdom, raised\nhimself to membership in the commune, just as the petty\nbourgeois, under the yoke of feudal absolutism, managed to\ndevelop into a bourgeois.  The modern laborer, on the contrary,\ninstead of rising with the progress of industry, sinks deeper and\ndeeper below the conditions of existence of his own class.  He\nbecomes a pauper, and pauperism develops more rapidly than\npopulation and wealth.  And here it becomes evident, that the\nbourgeoisie is unfit any longer to be the ruling class in\nsociety, and to impose its conditions of existence upon society\nas an over-riding law.  It is unfit to rule because it is\nincompetent to assure an existence to its slave within his\nslavery, because it cannot help letting him sink into such a\nstate, that it has to feed him, instead of being fed by him.\nSociety can no longer live under this bourgeoisie, in other\nwords, its existence is no longer compatible with society.\n\nThe essential condition for the existence, and for the sway of\nthe bourgeois class, is the formation and augmentation of\ncapital; the condition for capital is wage-labour.  Wage-labour\nrests exclusively on competition between the laborers.  The\nadvance of industry, whose involuntary promoter is the bourgeoisie,\nreplaces the isolation of the labourers, due to competition,\nby their revolutionary combination, due to association.  The\ndevelopment of Modern Industry, therefore, cuts from under its\nfeet the very foundation on which the bourgeoisie produces and\nappropriates products.  What the bourgeoisie, therefore, produces,\nabove all, is its own grave-diggers.  Its fall and the victory of\nthe proletariat are equally inevitable.\n\n\n\nII.  PROLETARIANS AND COMMUNISTS\n\nIn what relation do the Communists stand to the proletarians as a\nwhole?\n\nThe Communists do not form a separate party opposed to other\nworking-class parties.\n\nThey have no interests separate and apart from those of the\nproletariat as a whole.\n\nThey do not set up any sectarian principles of their own,\nby which to shape and mould the proletarian movement.\n\nThe Communists are distinguished from the other working-class parties\nby this only: (1) In the national struggles of the proletarians\nof the different countries, they point out and bring to the front\nthe common interests of the entire proletariat, independently of\nall nationality.  (2) In the various stages of development which the\nstruggle of the working class against the bourgeoisie has to pass\nthrough, they always and everywhere represent the interests of the\nmovement as a whole.\n\nThe Communists, therefore, are on the one hand, practically,\nthe most advanced and resolute section of the working-class\nparties of every country, that section which pushes forward\nall others; on the other hand, theoretically, they have over\nthe great mass of the proletariat the advantage of clearly\nunderstanding the line of march, the conditions, and the ultimate\ngeneral results of the proletarian movement.\n\nThe immediate aim of the Communist is the same as that of all\nthe other proletarian parties: formation of the proletariat into\na class, overthrow of the bourgeois supremacy, conquest of\npolitical power by the proletariat.\n\nThe theoretical conclusions of the Communists are in no way\nbased on ideas or principles that have been invented, or\ndiscovered, by this or that would-be universal reformer.  They\nmerely express, in general terms, actual relations springing from\nan existing class struggle, from a historical movement going on\nunder our very eyes.  The abolition of existing property\nrelations is not at all a distinctive feature of Communism.\n\nAll property relations in the past have continually been subject\nto historical change consequent upon the change in historical\nconditions.\n\nThe French Revolution, for example, abolished feudal property in\nfavour of bourgeois property.\n\nThe distinguishing feature of Communism is not the abolition of\nproperty generally, but the abolition of bourgeois property. But\nmodern bourgeois private property is the final and most complete\nexpression of the system of producing and appropriating products,\nthat is based on class antagonisms, on the exploitation of the\nmany by the few.\n\nIn this sense, the theory of the Communists may be summed up in\nthe single sentence: Abolition of private property.\n\nWe Communists have been reproached with the desire of abolishing\nthe right of personally acquiring property as the fruit of a\nman's own labour, which property is alleged to be the groundwork\nof all personal freedom, activity and independence.\n\nHard-won, self-acquired, self-earned property!  Do you mean the\nproperty of the petty artisan and of the small peasant, a form of\nproperty that preceded the bourgeois form?  There is no need to\nabolish that; the development of industry has to a great extent\nalready destroyed it, and is still destroying it daily.\n\nOr do you mean modern bourgeois private property?\n\nBut does wage-labour create any property for the labourer?  Not\na bit.  It creates capital, i.e., that kind of property which\nexploits wage-labour, and which cannot increase except upon\ncondition of begetting a new supply of wage-labour for fresh\nexploitation.  Property, in its present form, is based on the\nantagonism of capital and wage-labour.  Let us examine both sides\nof this antagonism.\n\nTo be a capitalist, is to have not only a purely personal, but a\nsocial status in production.  Capital is a collective product,\nand only by the united action of many members, nay, in the last\nresort, only by the united action of all members of society,\ncan it be set in motion.\n\nCapital is, therefore, not a personal, it is a social power.\n\nWhen, therefore, capital is converted into common property, into\nthe property of all members of society, personal property is not\nthereby transformed into social property. It is only the social\ncharacter of the property that is changed. It loses its\nclass-character.\n\nLet us now take wage-labour.\n\nThe average price of wage-labour is the minimum wage, i.e.,\nthat quantum of the means of subsistence, which is absolutely\nrequisite in bare existence as a labourer.  What, therefore, the\nwage-labourer appropriates by means of his labour, merely\nsuffices to prolong and reproduce a bare existence.  We by no\nmeans intend to abolish this personal appropriation of the\nproducts of labour, an appropriation that is made for the\nmaintenance and reproduction of human life, and that leaves no\nsurplus wherewith to command the labour of others.  All that we\nwant to do away with, is the miserable character of this\nappropriation, under which the labourer lives merely to increase\ncapital, and is allowed to live only in so far as the interest of\nthe ruling class requires it.\n\nIn bourgeois society, living labour is but a means to increase\naccumulated labour.  In Communist society, accumulated labour\nis but a means to widen, to enrich, to promote the existence\nof the labourer.\n\nIn bourgeois society, therefore, the past dominates the present;\nin Communist society, the present dominates the past.  In\nbourgeois society capital is independent and has individuality,\nwhile the living person is dependent and has no individuality.\n\nAnd the abolition of this state of things is called by the\nbourgeois, abolition of individuality and freedom! And rightly\nso. The abolition of bourgeois individuality, bourgeois\nindependence, and bourgeois freedom is undoubtedly aimed at.\n\nBy freedom is meant, under the present bourgeois conditions of\nproduction, free trade, free selling and buying.\n\nBut if selling and buying disappears, free selling and buying\ndisappears also.  This talk about free selling and buying, and\nall the other \"brave words\" of our bourgeoisie about freedom in\ngeneral, have a meaning, if any, only in contrast with restricted\nselling and buying, with the fettered traders of the Middle Ages,\nbut have no meaning when opposed to the Communistic abolition of\nbuying and selling, of the bourgeois conditions of production,\nand of the bourgeoisie itself.\n\nYou are horrified at our intending to do away with private\nproperty.  But in your existing society, private property is\nalready done away with for nine-tenths of the population; its\nexistence for the few is solely due to its non-existence in the\nhands of those nine-tenths.  You reproach us, therefore, with\nintending to do away with a form of property, the necessary\ncondition for whose existence is the non-existence of any\nproperty for the immense majority of society.\n\nIn one word, you reproach us with intending to do away with your\nproperty.  Precisely so; that is just what we intend.\n\nFrom the moment when labour can no longer be converted into\ncapital, money, or rent, into a social power capable of being\nmonopolised, i.e., from the moment when individual property can\nno longer be transformed into bourgeois property, into capital,\nfrom that moment, you say individuality vanishes.\n\nYou must, therefore, confess that by \"individual\" you mean no\nother person than the bourgeois, than the middle-class owner of\nproperty.  This person must, indeed, be swept out of the way, and\nmade impossible.\n\nCommunism deprives no man of the power to appropriate the\nproducts of society; all that it does is to deprive him of the\npower to subjugate the labour of others by means of such\nappropriation.\n\nIt has been objected that upon the abolition of private property\nall work will cease, and universal laziness will overtake us.\n\nAccording to this, bourgeois society ought long ago to have gone\nto the dogs through sheer idleness; for those of its members who\nwork, acquire nothing, and those who acquire anything, do not\nwork. The whole of this objection is but another expression of\nthe tautology: that there can no longer be any wage-labour when\nthere is no longer any capital.\n\nAll objections urged against the Communistic mode of producing\nand appropriating material products, have, in the same way,\nbeen urged against the Communistic modes of producing and\nappropriating intellectual products.  Just as, to the bourgeois,\nthe disappearance of class property is the disappearance of\nproduction itself, so the disappearance of class culture is to\nhim identical with the disappearance of all culture.\n\nThat culture, the loss of which he laments, is, for the enormous\nmajority, a mere training to act as a machine.\n\nBut don't wrangle with us so long as you apply, to our intended\nabolition of bourgeois property, the standard of your bourgeois\nnotions of freedom, culture, law, etc.  Your very ideas are but\nthe outgrowth of the conditions of your bourgeois production and\nbourgeois property, just as your jurisprudence is but the will of\nyour class made into a law for all, a will, whose essential\ncharacter and direction are determined by the economical\nconditions of existence of your class.\n\nThe selfish misconception that induces you to transform into\neternal laws of nature and of reason, the social forms\nspringing from your present mode of production and form of\nproperty--historical relations that rise and disappear in the\nprogress of production--this misconception you share with every\nruling class that has preceded you.  What you see clearly in the\ncase of ancient property, what you admit in the case of feudal\nproperty, you are of course forbidden to admit in the case of\nyour own bourgeois form of property.\n\nAbolition of the family!  Even the most radical flare up at this\ninfamous proposal of the Communists.\n\nOn what foundation is the present family, the bourgeois family,\nbased?  On capital, on private gain.  In its completely developed\nform this family exists only among the bourgeoisie.  But this\nstate of things finds its complement in the practical absence of\nthe family among the proletarians, and in public prostitution.\n\nThe bourgeois family will vanish as a matter of course when its\ncomplement vanishes, and both will vanish with the vanishing of\ncapital.\n\nDo you charge us with wanting to stop the exploitation of\nchildren by their parents?  To this crime we plead guilty.\n\nBut, you will say, we destroy the most hallowed of relations,\nwhen we replace home education by social.\n\nAnd your education!  Is not that also social, and determined by the\nsocial conditions under which you educate, by the intervention,\ndirect or indirect, of society, by means of schools, etc.?  The\nCommunists have not invented the intervention of society in\neducation; they do but seek to alter the character of that\nintervention, and to rescue education from the influence of the\nruling class.\n\nThe bourgeois clap-trap about the family and education, about\nthe hallowed co-relation of parent and child, becomes all the\nmore disgusting, the more, by the action of Modern Industry, all\nfamily ties among the proletarians are torn asunder, and their\nchildren transformed into simple articles of commerce and\ninstruments of labour.\n\nBut you Communists would introduce community of women, screams\nthe whole bourgeoisie in chorus.\n\nThe bourgeois sees in his wife a mere instrument of production.\nHe hears that the instruments of production are to be exploited\nin common, and, naturally, can come to no other conclusion than\nthat the lot of being common to all will likewise fall to the\nwomen.\n\nHe has not even a suspicion that the real point is to do away\nwith the status of women as mere instruments of production.\n\nFor the rest, nothing is more ridiculous than the\nvirtuous indignation of our bourgeois at the community of women\nwhich, they pretend, is to be openly and officially established\nby the Communists.  The Communists have no need to introduce\ncommunity of women; it has existed almost from time immemorial.\n\nOur bourgeois, not content with having the wives and daughters\nof their proletarians at their disposal, not to speak of common\nprostitutes, take the greatest pleasure in seducing each other's\nwives.\n\nBourgeois marriage is in reality a system of wives in common\nand thus, at the most, what the Communists might possibly\nbe reproached with, is that they desire to introduce, in\nsubstitution for a hypocritically concealed, an openly legalised\ncommunity of women. For the rest, it is self-evident that the\nabolition of the present system of production must bring with it\nthe abolition of the community of women springing from that\nsystem, i.e., of prostitution both public and private.\n\nThe Communists are further reproached with desiring to abolish\ncountries and nationality.\n\nThe working men have no country.  We cannot take from them what\nthey have not got.  Since the proletariat must first of all\nacquire political supremacy, must rise to be the leading class of\nthe nation, must constitute itself the nation, it is, so far,\nitself national, though not in the bourgeois sense of the word.\n\nNational differences and antagonisms between peoples are daily\nmore and more vanishing, owing to the development of the\nbourgeoisie, to freedom of commerce, to the world-market, to\nuniformity in the mode of production and in the conditions of\nlife corresponding thereto.\n\nThe supremacy of the proletariat will cause them to vanish still\nfaster. United action, of the leading civilised countries at\nleast, is one of the first conditions for the emancipation of\nthe proletariat.\n\nIn proportion as the exploitation of one individual by another\nis put an end to, the exploitation of one nation by another will\nalso be put an end to.  In proportion as the antagonism between\nclasses within the nation vanishes, the hostility of one nation\nto another will come to an end.\n\nThe charges against Communism made from a religious, a\nphilosophical, and, generally, from an ideological standpoint,\nare not deserving of serious examination.\n\nDoes it require deep intuition to comprehend that man's ideas,\nviews and conceptions, in one word, man's consciousness, changes\nwith every change in the conditions of his material existence, in\nhis social relations and in his social life?\n\nWhat else does the history of ideas prove, than that\nintellectual production changes its character in proportion as\nmaterial production is changed? The ruling ideas of each age\nhave ever been the ideas of its ruling class.\n\nWhen people speak of ideas that revolutionise society, they do\nbut express the fact, that within the old society, the elements\nof a new one have been created, and that the dissolution of the\nold ideas keeps even pace with the dissolution of the old\nconditions of existence.\n\nWhen the ancient world was in its last throes, the ancient\nreligions were overcome by Christianity.  When Christian ideas\nsuccumbed in the 18th century to rationalist ideas, feudal\nsociety fought its death battle with the then revolutionary\nbourgeoisie.  The ideas of religious liberty and freedom of\nconscience merely gave expression to the sway of free competition\nwithin the domain of knowledge.\n\n\"Undoubtedly,\" it will be said, \"religious, moral, philosophical\nand juridical ideas have been modified in the course of\nhistorical development.  But religion, morality philosophy,\npolitical science, and law, constantly survived this change.\"\n\n\"There are, besides, eternal truths, such as Freedom, Justice,\netc. that are common to all states of society. But Communism\nabolishes eternal truths, it abolishes all religion, and all\nmorality, instead of constituting them on a new basis; it\ntherefore acts in contradiction to all past historical experience.\"\n\nWhat does this accusation reduce itself to?  The history of\nall past society has consisted in the development of class\nantagonisms, antagonisms that assumed different forms at\ndifferent epochs.\n\nBut whatever form they may have taken, one fact is common to all\npast ages, viz., the exploitation of one part of society by the\nother. No wonder, then, that the social consciousness of past\nages, despite all the multiplicity and variety it displays,\nmoves within certain common forms, or general ideas, which\ncannot completely vanish except with the total disappearance of\nclass antagonisms.\n\nThe Communist revolution is the most radical rupture with\ntraditional property relations; no wonder that its development\ninvolves the most radical rupture with traditional ideas.\n\nBut let us have done with the bourgeois objections to Communism.\n\nWe have seen above, that the first step in the revolution by the\nworking class, is to raise the proletariat to the position of\nruling as to win the battle of democracy.\n\nThe proletariat will use its political supremacy to wrest, by\ndegrees, all capital from the bourgeoisie, to centralise all\ninstruments of production in the hands of the State, i.e., of the\nproletariat organised as the ruling class; and to increase the\ntotal of productive forces as rapidly as possible.\n\nOf course, in the beginning, this cannot be effected except by\nmeans of despotic inroads on the rights of property, and on\nthe conditions of bourgeois production; by means of measures,\ntherefore, which appear economically insufficient and untenable,\nbut which, in the course of the movement, outstrip themselves,\nnecessitate further inroads upon the old social order, and are\nunavoidable as a means of entirely revolutionising the mode of\nproduction.\n\nThese measures will of course be different in different\ncountries.\n\nNevertheless in the most advanced countries, the following will\nbe pretty generally applicable.\n\n1.  Abolition of property in land and application of all rents\n    of land to public purposes.\n\n2.  A heavy progressive or graduated income tax.\n\n3.  Abolition of all right of inheritance.\n\n4.  Confiscation of the property of all emigrants and rebels.\n\n5.  Centralisation of credit in the hands of the State, by means\n    of a national bank with State capital and an exclusive\n    monopoly.\n\n6.  Centralisation of the means of communication and transport\n    in the hands of the State.\n\n7.  Extension of factories and instruments of production owned by\n    the State; the bringing into cultivation of waste-lands, and\n    the improvement of the soil generally in accordance with a\n    common plan.\n\n8.  Equal liability of all to labour.  Establishment of\n    industrial armies, especially for agriculture.\n\n9.  Combination of agriculture with manufacturing industries;\n    gradual abolition of the distinction between town and\n    country, by a more equable distribution of the population\n    over the country.\n\n10. Free education for all children in public schools.\n    Abolition of children's factory labour in its present form.\n    Combination of education with industrial production, &c., &c.\n\nWhen, in the course of development, class distinctions have\ndisappeared, and all production has been concentrated in the\nhands of a vast association of the whole nation, the public power\nwill lose its political character.  Political power, properly so\ncalled, is merely the organised power of one class for oppressing\nanother.  If the proletariat during its contest with the\nbourgeoisie is compelled, by the force of circumstances, to\norganise itself as a class, if, by means of a revolution, it\nmakes itself the ruling class, and, as such, sweeps away by force\nthe old conditions of production, then it will, along with these\nconditions, have swept away the conditions for the existence of\nclass antagonisms and of classes generally, and will thereby have\nabolished its own supremacy as a class.\n\nIn place of the old bourgeois society, with its classes and\nclass antagonisms, we shall have an association, in which\nthe free development of each is the condition for the free\ndevelopment of all.\n\n\n\nIII.  SOCIALIST AND COMMUNIST LITERATURE\n\n\n1. REACTIONARY SOCIALISM\n\n\nA. Feudal Socialism\n\nOwing to their historical position, it became the vocation of the\naristocracies of France and England to write pamphlets against\nmodern bourgeois society.  In the French revolution of July 1830,\nand in the English reform agitation, these aristocracies again\nsuccumbed to the hateful upstart.  Thenceforth, a serious political\ncontest was altogether out of the question.  A literary battle\nalone remained possible.  But even in the domain of literature\nthe old cries of the restoration period had become impossible.\n\nIn order to arouse sympathy, the aristocracy were obliged to\nlose sight, apparently, of their own interests, and to formulate\ntheir indictment against the bourgeoisie in the interest of the\nexploited working class alone.  Thus the aristocracy took their\nrevenge by singing lampoons on their new master, and whispering\nin his ears sinister prophecies of coming catastrophe.\n\nIn this way arose Feudal Socialism: half lamentation, half\nlampoon; half echo of the past, half menace of the future; at\ntimes, by its bitter, witty and incisive criticism, striking the\nbourgeoisie to the very heart's core; but always ludicrous in\nits effect, through total incapacity to comprehend the march of\nmodern history.\n\nThe aristocracy, in order to rally the people to them, waved the\nproletarian alms-bag in front for a banner.  But the people, so\noften as it joined them, saw on their hindquarters the old feudal\ncoats of arms, and deserted with loud and irreverent laughter.\n\nOne section of the French Legitimists and \"Young England\"\nexhibited this spectacle.\n\nIn pointing out that their mode of exploitation was different to\nthat of the bourgeoisie, the feudalists forget that they\nexploited under circumstances and conditions that were quite\ndifferent, and that are now antiquated.  In showing that, under\ntheir rule, the modern proletariat never existed, they forget\nthat the modern bourgeoisie is the necessary offspring of their\nown form of society.\n\nFor the rest, so little do they conceal the reactionary\ncharacter of their criticism that their chief accusation against\nthe bourgeoisie amounts to this, that under the bourgeois regime\na class is being developed, which is destined to cut up root and\nbranch the old order of society.\n\nWhat they upbraid the bourgeoisie with is not so much that it\ncreates a proletariat, as that it creates a revolutionary\nproletariat.\n\nIn political practice, therefore, they join in all coercive\nmeasures against the working class; and in ordinary life,\ndespite their high falutin phrases, they stoop to pick up the\ngolden apples dropped from the tree of industry, and to barter\ntruth, love, and honour for traffic in wool, beetroot-sugar, and\npotato spirits.\n\nAs the parson has ever gone hand in hand with the landlord,\nso has Clerical Socialism with Feudal Socialism.\n\nNothing is easier than to give Christian asceticism a Socialist\ntinge. Has not Christianity declaimed against private property,\nagainst marriage, against the State? Has it not preached in the\nplace of these, charity and poverty, celibacy and mortification\nof the flesh, monastic life and Mother Church? Christian\nSocialism is but the holy, water with which the priest consecrates\nthe heart-burnings of the aristocrat.\n\n\nB. Petty-Bourgeois Socialism\n\nThe feudal aristocracy was not the only class that was ruined by\nthe bourgeoisie, not the only class whose conditions of existence\npined and perished in the atmosphere of modern bourgeois society.\nThe mediaeval burgesses and the small peasant proprietors were\nthe precursors of the modern bourgeoisie.  In those countries\nwhich are but little developed, industrially and commercially,\nthese two classes still vegetate side by side with the rising\nbourgeoisie.\n\nIn countries where modern civilisation has become fully\ndeveloped, a new class of petty bourgeois has been formed,\nfluctuating between proletariat and bourgeoisie and ever renewing\nitself as a supplementary part of bourgeois society.  The\nindividual members of this class, however, are being constantly\nhurled down into the proletariat by the action of competition,\nand, as modern industry develops, they even see the moment\napproaching when they will completely disappear as an independent\nsection of modern society, to be replaced, in manufactures,\nagriculture and commerce, by overlookers, bailiffs and shopmen.\n\nIn countries like France, where the peasants constitute far more\nthan half of the population, it was natural that writers who\nsided with the proletariat against the bourgeoisie, should use,\nin their criticism of the bourgeois regime, the standard of the\npeasant and petty bourgeois, and from the standpoint of these\nintermediate classes should take up the cudgels for the working\nclass.  Thus arose petty-bourgeois Socialism.  Sismondi was the\nhead of this school, not only in France but also in England.\n\nThis school of Socialism dissected with great acuteness the\ncontradictions in the conditions of modern production.  It laid\nbare the hypocritical apologies of economists.  It proved,\nincontrovertibly, the disastrous effects of machinery and\ndivision of labour; the concentration of capital and land in a\nfew hands; overproduction and crises; it pointed out the\ninevitable ruin of the petty bourgeois and peasant, the misery\nof the proletariat, the anarchy in production, the crying\ninequalities in the distribution of wealth, the industrial war of\nextermination between nations, the dissolution of old moral\nbonds, of the old family relations, of the old nationalities.\n\nIn its positive aims, however, this form of Socialism aspires\neither to restoring the old means of production and of exchange,\nand with them the old property relations, and the old society, or\nto cramping the modern means of production and of exchange,\nwithin the framework of the old property relations that have\nbeen, and were bound to be, exploded by those means.  In either\ncase, it is both reactionary and Utopian.\n\nIts last words are: corporate guilds for manufacture,\npatriarchal relations in agriculture.\n\nUltimately, when stubborn historical facts had dispersed all\nintoxicating effects of self-deception, this form of Socialism\nended in a miserable fit of the blues.\n\n\nC. German, or \"True,\" Socialism\n\nThe Socialist and Communist literature of France, a literature\nthat originated under the pressure of a bourgeoisie in power, and\nthat was the expression of the struggle against this power, was\nintroduced into Germany at a time when the bourgeoisie, in that\ncountry, had just begun its contest with feudal absolutism.\n\nGerman philosophers, would-be philosophers, and beaux esprits,\neagerly seized on this literature, only forgetting, that when\nthese writings immigrated from France into Germany, French social\nconditions had not immigrated along with them.  In contact with\nGerman social conditions, this French literature lost all its\nimmediate practical significance, and assumed a purely literary\naspect.  Thus, to the German philosophers of the eighteenth\ncentury, the demands of the first French Revolution were nothing\nmore than the demands of \"Practical Reason\" in general, and the\nutterance of the will of the revolutionary French bourgeoisie\nsignified in their eyes the law of pure Will, of Will as it was\nbound to be, of true human Will generally.\n\nThe world of the German literate consisted solely in bringing\nthe new French ideas into harmony with their ancient philosophical\nconscience, or rather, in annexing the French ideas without\ndeserting their own philosophic point of view.\n\nThis annexation took place in the same way in which a foreign\nlanguage is appropriated, namely, by translation.\n\nIt is well known how the monks wrote silly lives of Catholic\nSaints over the manuscripts on which the classical works of\nancient heathendom had been written.  The German literate\nreversed this process with the profane French literature.  They\nwrote their philosophical nonsense beneath the French original.\nFor instance, beneath the French criticism of the economic\nfunctions of money, they wrote \"Alienation of Humanity,\" and\nbeneath the French criticism of the bourgeois State they wrote\n\"dethronement of the Category of the General,\" and so forth.\n\nThe introduction of these philosophical phrases at the back of\nthe French historical criticisms they dubbed \"Philosophy of\nAction,\" \"True Socialism,\" \"German Science of Socialism,\"\n\"Philosophical Foundation of Socialism,\" and so on.\n\nThe French Socialist and Communist literature was thus completely\nemasculated. And, since it ceased in the hands of the German to express\nthe struggle of one class with the other, he felt conscious of having\novercome \"French one-sidedness\" and of representing, not true\nrequirements, but the requirements of truth; not the interests of the\nproletariat, but the interests of Human Nature, of Man in general, who\nbelongs to no class, has no reality, who exists only in the misty realm\nof philosophical fantasy.\n\nThis German Socialism, which took its schoolboy task so seriously\nand solemnly, and extolled its poor stock-in-trade in such\nmountebank fashion, meanwhile gradually lost its pedantic\ninnocence.\n\nThe fight of the German, and especially, of the Prussian bourgeoisie,\nagainst feudal aristocracy and absolute monarchy, in other words, the\nliberal movement, became more earnest.\n\nBy this, the long wished-for opportunity was offered to \"True\"\nSocialism of confronting the political movement with the\nSocialist demands, of hurling the traditional anathemas\nagainst liberalism, against representative government, against\nbourgeois competition, bourgeois freedom of the press, bourgeois\nlegislation, bourgeois liberty and equality, and of preaching to\nthe masses that they had nothing to gain, and everything to lose,\nby this bourgeois movement.  German Socialism forgot, in the nick\nof time, that the French criticism, whose silly echo it was,\npresupposed the existence of modern bourgeois society, with its\ncorresponding economic conditions of existence, and the political\nconstitution adapted thereto, the very things whose attainment\nwas the object of the pending struggle in Germany.\n\nTo the absolute governments, with their following of parsons,\nprofessors, country squires and officials, it served as a welcome\nscarecrow against the threatening bourgeoisie.\n\nIt was a sweet finish after the bitter pills of floggings and\nbullets with which these same governments, just at that time,\ndosed the German working-class risings.\n\nWhile this \"True\" Socialism thus served the governments as a\nweapon for fighting the German bourgeoisie, it, at the same time,\ndirectly represented a reactionary interest, the interest of the\nGerman Philistines.  In Germany the petty-bourgeois class, a\nrelic of the sixteenth century, and since then constantly\ncropping up again under various forms, is the real social basis\nof the existing state of things.\n\nTo preserve this class is to preserve the existing state of\nthings in Germany.  The industrial and political supremacy of the\nbourgeoisie threatens it with certain destruction; on the one\nhand, from the concentration of capital; on the other, from the\nrise of a revolutionary proletariat.  \"True\" Socialism appeared to\nkill these two birds with one stone.  It spread like an epidemic.\n\nThe robe of speculative cobwebs, embroidered with flowers\nof rhetoric, steeped in the dew of sickly sentiment, this\ntranscendental robe in which the German Socialists wrapped their\nsorry \"eternal truths,\" all skin and bone, served to wonderfully\nincrease the sale of their goods amongst such a public.  And on\nits part, German Socialism recognised, more and more, its own\ncalling as the bombastic representative of the petty-bourgeois\nPhilistine.\n\nIt proclaimed the German nation to be the model nation, and the\nGerman petty Philistine to be the typical man.  To every\nvillainous meanness of this model man it gave a hidden, higher,\nSocialistic interpretation, the exact contrary of its real\ncharacter.  It went to the extreme length of directly opposing\nthe \"brutally destructive\" tendency of Communism, and of\nproclaiming its supreme and impartial contempt of all class\nstruggles.  With very few exceptions, all the so-called Socialist\nand Communist publications that now (1847) circulate in Germany\nbelong to the domain of this foul and enervating literature.\n\n\n2. CONSERVATIVE, OR BOURGEOIS, SOCIALISM\n\nA part of the bourgeoisie is desirous of redressing social\ngrievances, in order to secure the continued existence of\nbourgeois society.\n\nTo this section belong economists, philanthropists,\nhumanitarians, improvers of the condition of the working class,\norganisers of charity, members of societies for the prevention of\ncruelty to animals, temperance fanatics, hole-and-corner\nreformers of every imaginable kind.  This form of Socialism has,\nmoreover, been worked out into complete systems.\n\nWe may cite Proudhon's Philosophie de la Misere as an example of\nthis form.\n\nThe Socialistic bourgeois want all the advantages of modern\nsocial conditions without the struggles and dangers necessarily\nresulting therefrom.  They desire the existing state of society\nminus its revolutionary and disintegrating elements.  They wish\nfor a bourgeoisie without a proletariat.  The bourgeoisie\nnaturally conceives the world in which it is supreme to be the\nbest; and bourgeois Socialism develops this comfortable\nconception into various more or less complete systems.  In\nrequiring the proletariat to carry out such a system, and thereby\nto march straightway into the social New Jerusalem, it but\nrequires in reality, that the proletariat should remain within\nthe bounds of existing society, but should cast away all its\nhateful ideas concerning the bourgeoisie.\n\nA second and more practical, but less systematic, form of this\nSocialism sought to depreciate every revolutionary movement in\nthe eyes of the working class, by showing that no mere political\nreform, but only a change in the material conditions of\nexistence, in economic relations, could be of any advantage to\nthem.  By changes in the material conditions of existence, this\nform of Socialism, however, by no means understands abolition of\nthe bourgeois relations of production, an abolition that can be\neffected only by a revolution, but administrative reforms, based\non the continued existence of these relations; reforms,\ntherefore, that in no respect affect the relations between\ncapital and labour, but, at the best, lessen the cost, and\nsimplify the administrative work, of bourgeois government.\n\nBourgeois Socialism attains adequate expression, when, and only\nwhen, it becomes a mere figure of speech.\n\nFree trade: for the benefit of the working class.  Protective\nduties: for the benefit of the working class.  Prison Reform: for\nthe benefit of the working class.  This is the last word and the\nonly seriously meant word of bourgeois Socialism.\n\nIt is summed up in the phrase: the bourgeois is a bourgeois--for\nthe benefit of the working class.\n\n\n3.  CRITICAL-UTOPIAN SOCIALISM AND COMMUNISM\n\nWe do not here refer to that literature which, in every great\nmodern revolution, has always given voice to the demands of the\nproletariat, such as the writings of Babeuf and others.\n\nThe first direct attempts of the proletariat to attain its own\nends, made in times of universal excitement, when feudal society\nwas being overthrown, these attempts necessarily failed, owing\nto the then undeveloped state of the proletariat, as well as to\nthe absence of the economic conditions for its emancipation,\nconditions that had yet to be produced, and could be produced\nby the impending bourgeois epoch alone. The revolutionary\nliterature that accompanied these first movements of the\nproletariat had necessarily a reactionary character. It\ninculcated universal asceticism and social levelling in its\ncrudest form.\n\nThe Socialist and Communist systems properly so called, those of\nSaint-Simon, Fourier, Owen and others, spring into existence in\nthe early undeveloped period, described above, of the struggle\nbetween proletariat and bourgeoisie (see Section 1. Bourgeois\nand Proletarians).\n\nThe founders of these systems see, indeed, the class antagonisms, as\nwell as the action of the decomposing elements, in the prevailing form\nof society. But the proletariat, as yet in its infancy, offers to them\nthe spectacle of a class without any historical initiative or any\nindependent political movement.\n\nSince the development of class antagonism keeps even pace with\nthe development of industry, the economic situation, as they find\nit, does not as yet offer to them the material conditions for the\nemancipation of the proletariat.  They therefore search after a\nnew social science, after new social laws, that are to create\nthese conditions.\n\nHistorical action is to yield to their personal inventive\naction, historically created conditions of emancipation to\nfantastic ones, and the gradual, spontaneous class-organisation\nof the proletariat to the organisation of society specially\ncontrived by these inventors.  Future history resolves itself, in\ntheir eyes, into the propaganda and the practical carrying out of\ntheir social plans.\n\nIn the formation of their plans they are conscious of caring\nchiefly for the interests of the working class, as being the most\nsuffering class.  Only from the point of view of being the most\nsuffering class does the proletariat exist for them.\n\nThe undeveloped state of the class struggle, as well as their\nown surroundings, causes Socialists of this kind to consider\nthemselves far superior to all class antagonisms.  They want to\nimprove the condition of every member of society, even that of\nthe most favoured.  Hence, they habitually appeal to society at\nlarge, without  distinction of class; nay, by preference, to the\nruling class.  For how can people, when once they understand\ntheir system, fail to see in it the best possible plan of the\nbest possible state of society?\n\nHence, they reject all political, and especially all\nrevolutionary, action; they wish to attain their ends by\npeaceful means, and endeavour, by small experiments, necessarily\ndoomed to failure, and by the force of example, to pave the way\nfor the new social Gospel.\n\nSuch fantastic pictures of future society, painted at a time\nwhen the proletariat is still in a very undeveloped state and has\nbut a fantastic conception of its own position correspond with\nthe first instinctive yearnings of that class for a general\nreconstruction of society.\n\nBut these Socialist and Communist publications contain also a\ncritical element. They attack every principle of existing society.\nHence they are full of the most valuable materials for the\nenlightenment of the working class. The practical measures\nproposed in them--such as the abolition of the distinction\nbetween town and country, of the family, of the carrying on of\nindustries for the account of private individuals, and of the wage\nsystem, the proclamation of social harmony, the conversion of the\nfunctions of the State into a mere superintendence of production,\nall these proposals, point solely to the disappearance of class\nantagonisms which were, at that time, only just cropping up, and\nwhich, in these publications, are recognised in their earliest,\nindistinct and undefined forms only. These proposals, therefore,\nare of a purely Utopian character.\n\nThe significance of Critical-Utopian Socialism and Communism\nbears an inverse relation to historical development.  In\nproportion as the modern class struggle develops and takes\ndefinite shape, this fantastic standing apart from the contest,\nthese fantastic attacks on it, lose all practical value and all\ntheoretical justification.  Therefore, although the originators\nof these systems were, in many respects, revolutionary, their\ndisciples have, in every case, formed mere reactionary sects.\nThey hold fast by the original views of their masters, in\nopposition to the progressive historical development of the\nproletariat.  They, therefore, endeavour, and that consistently,\nto deaden the class struggle and to reconcile the class antagonisms.\nThey still dream of experimental realisation of their social\nUtopias, of founding isolated \"phalansteres,\" of establishing\n\"Home Colonies,\"  of setting up a \"Little Icaria\"--duodecimo\neditions of the New Jerusalem--and to realise all these castles\nin the air, they are compelled to appeal to the feelings and\npurses of the bourgeois.  By degrees they sink into the category\nof the reactionary conservative Socialists depicted above,\ndiffering from these only by more systematic pedantry, and\nby their fanatical and superstitious belief in the miraculous\neffects of their social science.\n\nThey, therefore, violently oppose all political action on the\npart of the working class; such action, according to them, can\nonly result from blind unbelief in the new Gospel.\n\nThe Owenites in England, and the Fourierists in France,\nrespectively, oppose the Chartists and the Reformistes.\n\n\n\nIV.  POSITION OF THE COMMUNISTS IN RELATION TO THE\nVARIOUS EXISTING OPPOSITION PARTIES\n\nSection II has made clear the relations of the Communists to the\nexisting working-class parties, such as the Chartists in England\nand the Agrarian Reformers in America.\n\nThe Communists fight for the attainment of the immediate aims,\nfor the enforcement of the momentary interests of the working\nclass; but in the movement of the present, they also represent\nand take care of the future of that movement.  In France the\nCommunists ally themselves with the Social-Democrats, against the\nconservative and radical bourgeoisie, reserving, however, the\nright to take up a critical position in regard to phrases and\nillusions traditionally handed down from the great Revolution.\n\nIn Switzerland they support the Radicals, without losing sight\nof the fact that this party consists of antagonistic elements,\npartly of Democratic Socialists, in the French sense, partly of\nradical bourgeois.\n\nIn Poland they support the party that insists on an agrarian\nrevolution as the prime condition for national emancipation, that\nparty which fomented the insurrection of Cracow in 1846.\n\nIn Germany they fight with the bourgeoisie whenever it acts in a\nrevolutionary way, against the absolute monarchy, the feudal\nsquirearchy, and the petty bourgeoisie.\n\nBut they never cease, for a single instant, to instil into the\nworking class the clearest possible recognition of the hostile\nantagonism between bourgeoisie and proletariat, in order that the\nGerman workers may straightaway use, as so many weapons against\nthe bourgeoisie, the social and political conditions that the\nbourgeoisie must necessarily introduce along with its supremacy,\nand in order that, after the fall of the reactionary classes in\nGermany, the fight against the bourgeoisie itself may immediately\nbegin.\n\nThe Communists turn their attention chiefly to Germany, because\nthat country is on the eve of a bourgeois revolution that\nis bound to be carried out under more advanced conditions\nof European civilisation, and with a much more developed\nproletariat, than that of England was in the seventeenth, and of\nFrance in the eighteenth century, and because the bourgeois\nrevolution in Germany will be but the prelude to an immediately\nfollowing proletarian revolution.\n\nIn short, the Communists everywhere support every revolutionary\nmovement against the existing social and political order of\nthings.\n\nIn all these movements they bring to the front, as the leading\nquestion in each, the property question, no matter what its\ndegree of development at the time.\n\nFinally, they labour everywhere for the union and agreement of\nthe democratic parties of all countries.\n\nThe Communists disdain to conceal their views and aims.\nThey openly declare that their ends can be attained only by\nthe forcible overthrow of all existing social conditions.\nLet the ruling classes tremble at a Communistic revolution.\nThe proletarians have nothing to lose but their chains.\nThey have a world to win.\n\n\n           WORKING MEN OF ALL COUNTRIES, UNITE!", "title": "Manifest der Kommunistischen Partei. English"}