{"summary": "The monograph consisted of three sections: Introduction, Chapter 1: Fundamentals of Scientific Management, and Chapter 2: The Principles of Scientific Management.\n\nTaylor started this paper by quoting then President of the United States, Theodore Roosevelt: \"The conservation of our national resources is only preliminary to the larger question of national efficiency\". Taylor pointed out that while a large movement had started to conserve material resources, the less visible and less tangible effects of the wasted human effort was only vaguely appreciated. He argues the necessity of focusing on training rather than finding the \"right man\", stating \"In the past the man has been first; in the future the system must be first\", and the first goal of all good systems should be developing first-class men. He listed three goals for the work:\n\nFirst. To point out, through a series of simple illustrations, the great loss which the whole country is suffering through inefficiency in almost all of our daily acts.Second. To try to convince the reader that the remedy for this inefficiency lies in systematic management, rather than in searching for some unusual or extraordinary man.Third. To prove that the best management is a true science, resting upon clearly defined laws, rules, and principles, as a foundation. And further to show that the fundamental principles of scientific management are applicable to all kinds of human activities, from our simplest individual acts to the work of our great corporations, which call for the most elaborate cooperation. And, briefly, through a series of illustrations, to convince the reader that whenever these principles are correctly applied, results must follow which are truly astounding.\n\nLastly, Taylor noted that while the examples were chosen to appeal to engineers and managers, his principles could be applied to the management of any social enterprise, such as homes, farms, small businesses, churches, philanthropic institutions, universities, and government.\n\nTaylor argued that the principal object of management should be to secure the maximum prosperity for the employer, coupled with the maximum prosperity for each employee. He argued that the most important object of both the employee and the management should be the training and development of each individual in the establishment, so that he can do the highest class of work for which his natural abilities fit him. Taylor demonstrated that maximum prosperity can exist only as the result of maximum productivity, both for the shop and individual, and rebuked the idea that the fundamental interests of employees and employers are necessarily antagonistic.\nTaylor described how workers deliberately work slowly, or “soldier”, to protect their interests. According to Taylor, there were three reasons for the inefficiency:\n\nFirst. The fallacy, which has from time immemorial been almost universal among workmen, that a material increase in the output of each man or each machine in the trade would result in the end in throwing a large number of men out of work.Second. The defective systems of management which are in common use, and which make it necessary for each workman to soldier, or work slowly, in order that he may protect his own best interests.Third. The inefficient rule-of-thumb methods, which are still almost universal in all trades, and in practicing which our workmen waste a large part of their effort.\n\nTaylor argued that the cheapening of any article in common use almost immediately results in a largely increased demand for that article, creating additional work and contradicting the first belief.\nAs to the second cause, Taylor pointed to quotes from 'Shop Management' to help explain how current management styles caused workers to soldier. He explained the natural tendency of men to take it easy as distinct from \"systematic soldiering\" due to thought and reasoning, and how bringing men together at a standard rate of pay exacerbated this problem. He described how under standard day, piece, or contract work it was in the workers' interest to work slowly and hide how fast work can actually be done, and the antagonism between workers and management must change.\nFor the third cause, Taylor noted the enormous saving of time and increase in output that could be obtained by eliminating unnecessary movements and substituting faster movements, which can only be realized after a motion and time study by a competent man. While there are perhaps \"forty, fifty, or a hundred ways of doing each act in each trade\", \"there is always one method and one implement which is quicker and better than any of the rest\".\n\nIn this section, Taylor explained his principles of scientific management.\nHe starts by describing what he considered the best system of management then in use, the system of \"initiative and incentive\". In this system, management gives incentives for better work, and workers give their best effort. The form of payment is practically the whole system, in contrast to scientific management.\nTaylor's scientific management consisted of four principles:\n\nFirst. They develop a science for each element of a man's work, which replaces the old rule-of-thumb method.Second. They scientifically select and then train, teach, and develop the workman, whereas in the past he chose his own work and trained himself as best he could.Third. They heartily cooperate with the men so as to ensure all of the work being done in accordance with the principles of the science which has been developed.Fourth. There is an almost equal division of the work and the responsibility between the management and the workmen. The management take over all work for which they are better fitted than the workmen, while in the past almost all of the work and the greater part of the responsibility were thrown upon the men.\n\nUnder the management of \"initiative and incentive\", the first three elements often exist in some form, but their importance is minor. However, under scientific management, they \"form the very essence of the whole system\".\nTaylor's summary of the fourth point is Under the management of \"initiative and incentive\" practically the whole problem is \"up to the workman\", while under scientific management fully one-half of the problem is \"up to the management\". It is up to the management to determine the best method to complete each task through a time and motion study, to train the worker in this method, and keep individual records for incentive based pay.\nTaylor devotes most of the remainder of the work to providing case studies to support his case, including:\nMoving pig iron at the Bethlehem Steel Company, with the famous story of the \"ox\"-like worker Schmidt\nTaylor's work at the Midvale Steel Company\nShoveling at Bethlehem Steel\nBricklaying, as studied by Frank B. Gilbreth\nThe inspection of small polished steel balls for bicycle bearing machine shop.\nTaylor warned about attempting to implement parts of scientific management without accepting the whole philosophy, stating that too fast of a change was often met with trouble, strikes, and failure.\n\n", "full_text": "The Principles of Scientific Management\n\nby\n\nFREDERICK WINSLOW TAYLOR, M.E., Sc.D.\n\n1911\n\n\n\nINTRODUCTION\n\nPresident Roosevelt in his address to the Governors at the White House,\nprophetically remarked that \"The conservation of our national resources\nis only preliminary to the larger question of national efficiency.\"\n\nThe whole country at once recognized the importance of conserving our\nmaterial resources and a large movement has been started which will be\neffective in accomplishing this object. As yet, however, we have but\nvaguely appreciated the importance of \"the larger question of increasing\nour national efficiency.\"\n\nWe can see our forests vanishing, our water-powers going to waste, our\nsoil being carried by floods into the sea; and the end of our coal and\nour iron is in sight. But our larger wastes of human effort, which go on\nevery day through such of our acts as are blundering, ill-directed, or\ninefficient, and which Mr. Roosevelt refers to as a, lack of \"national\nefficiency,\" are less visible, less tangible, and are but vaguely\nappreciated.\n\nWe can see and feel the waste of material things. Awkward, inefficient,\nor ill-directed movements of men, however, leave nothing visible or\ntangible behind them. Their appreciation calls for an act of memory, an\neffort of the imagination. And for this reason, even though our daily\nloss from this source is greater than from our waste of material things,\nthe one has stirred us deeply, while the other has moved us but little.\n\nAs yet there has been no public agitation for \"greater national\nefficiency,\" no meetings have been called to consider how this is to be\nbrought about. And still there are signs that the need for greater\nefficiency is widely felt.\n\nThe search for better, for more competent men, from the presidents of\nour great companies down to our household servants, was never more\nvigorous than it is now. And more than ever before is the demand for\ncompetent men in excess of the supply.\n\nWhat we are all looking for, however, is the readymade, competent man;\nthe man whom some one else has trained. It is only when we fully realize\nthat our duty, as well as our opportunity, lies in systematically\ncooperating to train and to make this competent man, instead of in\nhunting for a man whom some one else has trained, that we shall be on\nthe road to national efficiency.\n\nIn the past the prevailing idea has been well expressed in the saying\nthat \"Captains of industry are born, not made\"; and the theory has been\nthat if one could get the right man, methods could be safely left to\nhim. In the future it will be appreciated that our leaders must be\ntrained right as well as born right, and that no great man can (with the\nold system of personal management) hope to compete with a number of\nordinary men who have been properly organized so as efficiently to\ncooperate.\n\nIn the past the man has been first; in the future the system must be\nfirst. This in no sense, however, implies that great men are not needed.\nOn the contrary, the first object of any good system must be that of\ndeveloping first-class men; and under systematic management the best man\nrises to the top more certainly and more rapidly than ever before.\n\nThis paper has been written:\n\nFirst. To point out, through a series of simple illustrations, the great\nloss which the whole country is suffering through inefficiency in almost\nall of our daily acts.\n\nSecond. To try to convince the reader that the remedy for this\ninefficiency lies in systematic management, rather than in searching for\nsome unusual or extraordinary man.\n\nThird. To prove that the best management is a true science, resting upon\nclearly defined laws, rules, and principles, as a foundation. And\nfurther to show that the fundamental principles of scientific management\nare applicable to all kinds of human activities, from our simplest\nindividual acts to the work of our great corporations, which call for\nthe most elaborate cooperation. And, briefly, through a series of\nillustrations, to convince the reader that whenever these principles are\ncorrectly applied, results must follow which are truly astounding.\n\nThis paper was originally prepared for presentation to the American\nSociety of Mechanical Engineers. The illustrations chosen are such as,\nit is believed, will especially appeal to engineers and to managers of\nindustrial and manufacturing establishments, and also quite as much to\nall of the men who are working in these establishments. It is hoped,\nhowever, that it will be clear to other readers that the same principles\ncan be applied with equal force to all social activities: to the\nmanagement of our homes; the management of our farms; the management of\nthe business of our tradesmen, large and small; of our churches, our\nphilanthropic institutions our universities, and our governmental\ndepartments.\n\n\n\nCHAPTER I\n\nFUNDAMENTALS OF SCIENTIFIC MANAGEMENT\n\nThe principal object of management should be to secure the maximum\nprosperity for the employer, coupled with the maximum prosperity for\neach employee.\n\nThe words \"maximum prosperity\" are used, in their broad sense, to mean\nnot only large dividends for the company or owner, but the development\nof every branch of the business to its highest state of excellence, so\nthat the prosperity may be permanent. In the same way maximum prosperity\nfor each employee means not only higher wages than are usually received\nby men of his class, but, of more importance still, it also means the\ndevelopment of each man to his state of maximum efficiency, so that he\nmay be able to do, generally speaking, the highest grade of work for\nwhich his natural abilities fit him, and it further means giving him,\nwhen possible, this class of work to do.\n\nIt would seem to be so self-evident that maximum prosperity for the\nemployer, coupled with maximum prosperity for the employee, ought to be\nthe two leading objects of management, that even to state this fact\nshould be unnecessary. And yet there is no question that, throughout the\nindustrial world, a large part of the organization of employers, as well\nas employees, is for war rather than for peace, and that perhaps the\nmajority on either side do not believe that it is possible so to arrange\ntheir mutual relations that their interests become identical.\n\nThe majority of these men believe that the fundamental interests of\nemployees and employers are necessarily antagonistic. Scientific\nmanagement, on the contrary, has for its very foundation the firm\nconviction that the true interests of the two are one and the same; that\nprosperity for the employer cannot exist through a long term of years\nunless it is accompanied by prosperity for the employee, and vice versa;\nand that it is possible to give the workman what he most wants--high\nwages--and the employer what he wants--a low labor cost--for his\nmanufactures.\n\nIt is hoped that some at least of those who do not sympathize with each\nof these objects may be led to modify their views; that some employers,\nwhose attitude toward their workmen has been that of trying to get the\nlargest amount of work out of them for the smallest possible wages, may\nbe led to see that a more liberal policy toward their men will pay them\nbetter; and that some of those workmen who begrudge a fair and even a\nlarge profit to their employers, and who feel that all of the fruits of\ntheir labor should belong to them, and that those for whom they work and\nthe capital invested in the business are entitled to little or nothing,\nmay be led to modify these views.\n\nNo one can be found who will deny that in the case of any single\nindividual the greatest prosperity can exist only when that individual\nhas reached his highest state of efficiency; that is, when he is turning\nout his largest daily output.\n\nThe truth of this fact is also perfectly clear in the case of two men\nworking together. To illustrate: if you and your workman have become so\nskilful that you and he together are making two pairs of, shoes in a\nday, while your competitor and his workman are making only one pair, it\nis clear that after selling your two pairs of shoes you can pay your\nworkman much higher wages than your competitor who produces only one\npair of shoes is able to pay his man, and that there will still be\nenough money left over for you to have a larger profit than your\ncompetitor.\n\nIn the case of a more complicated manufacturing establishment, it should\nalso be perfectly clear that the greatest permanent prosperity for the\nworkman, coupled with the greatest prosperity for the employer, can be\nbrought about only when the work of the establishment is done with the\nsmallest combined expenditure of human effort, plus nature's resources,\nplus the cost for the use of capital in the shape of machines,\nbuildings, etc. Or, to state the same thing in a different way: that the\ngreatest prosperity can exist only as the result of the greatest\npossible productivity of the men and machines of the establishment--that\nis, when each man and each machine are turning out the largest possible\noutput; because unless your men and your machines are daily turning out\nmore work than others around you, it is clear that competition will\nprevent your paying higher wages to your workmen than are paid to those\nof your competitor. And what is true as to the possibility of paying\nhigh wages in the case of two companies competing close beside one\nanother is also true as to whole districts of the country and even as to\nnations which are in competition. In a word, that maximum prosperity can\nexist only as the result of maximum productivity. Later in this paper\nillustrations will be given of several companies which are earning large\ndividends and at the same time paying from 30 per cent to 100 per cent\nhigher wages to their men than are paid to similar men immediately\naround them, and with whose employers they are in competition. These\nillustrations will cover different types of work, from the most\nelementary to the most complicated.\n\nIf the above reasoning is correct, it follows that the most important\nobject of both the workmen and the management should be the training and\ndevelopment of each individual in the establishment, so that he can do\n(at his fastest pace and with the maximum of efficiency) the highest\nclass of work for which his natural abilities fit him.\n\nThese principles appear to be so self-evident that many men may think it\nalmost childish to state them. Let us, however, turn to the facts, as\nthey actually exist in this country and in England. The English and\nAmerican peoples are the greatest sportsmen in the world. Whenever an\nAmerican workman plays baseball, or an English workman plays cricket, it\nis safe to say that he strains every nerve to secure victory for his\nside. He does his very best to make the largest possible number of runs.\nThe universal sentiment is so strong that any man who fails to give out\nall there is in him in sport is branded as a \"quitter,\" and treated with\ncontempt by those who are around him.\n\nWhen the same workman returns to work on the following day, instead of\nusing every effort to turn out the largest possible amount of work, in a\nmajority of the cases this man deliberately plans to do as little as he\nsafely can to turn out far less work than he is well able to do in many\ninstances to do not more than one-third to one-half of a proper day's\nwork. And in fact if he were to do his best to turn out his largest\npossible day's work, he would be abused by his fellow-workers for so\ndoing, even more than if he had proved himself a \"quitter\" in sport.\nUnder working, that is, deliberately working slowly so as to avoid doing\na full day's work, \"soldiering,\" as it is called in this country,\n\"hanging it out,\" as it is called in England, \"ca canae,\" as it is\ncalled in Scotland, is almost universal in industrial establishments,\nand prevails also to a large extent in the building trades; and the\nwriter asserts without fear of contradiction that this constitutes the\ngreatest evil with which the working-people of both England and America\nare now afflicted.\n\nIt will be shown later in this paper that doing away with slow working\nand \"soldiering\" in all its forms and so arranging the relations between\nemployer and employs that each workman will work to his very best\nadvantage and at his best speed, accompanied by the intimate cooperation\nwith the management and the help (which the workman should receive) from\nthe management, would result on the average in nearly doubling the\noutput of each man and each machine. What other reforms, among those\nwhich are being discussed by these two nations, could do as much toward\npromoting prosperity, toward the diminution of poverty, and the\nalleviation of suffering? America and England have been recently\nagitated over such subjects as the tariff, the control of the large\ncorporations on the one hand, and of hereditary power on the other hand,\nand over various more or less socialistic proposals for taxation, etc.\nOn these subjects both peoples have been profoundly stirred, and yet\nhardly a voice has been raised to call attention to this vastly greater\nand more important subject of \"soldiering,\" which directly and\npowerfully affects the wages, the prosperity, and the life of almost\nevery working-man, and also quite as much the prosperity of every\nindustrial, establishment in the nation.\n\nThe elimination of \"soldiering\" and of the several causes of slow\nworking would so lower the cost of production that both our home and\nforeign markets would be greatly enlarged, and we could compete on more\nthan even terms with our rivals. It would remove one of the fundamental\ncauses for dull times, for lack of employment, and for poverty, and\ntherefore would have a more permanent and far-reaching effect upon these\nmisfortunes than any of the curative remedies that are now being used to\nsoften their consequences. It would insure higher wages and make shorter\nworking hours and better working and home conditions possible.\n\nWhy is it, then, in the face of the self-evident fact that maximum\nprosperity can exist only as the result of the determined effort of each\nworkman to turn out each day his largest possible day's work, that the\ngreat majority of our men are deliberately doing just the opposite, and\nthat even when the men have the best of intentions their work is in most\ncases far from efficient?\n\nThere are three causes for this condition, which may be briefly\nsummarized as:\n\nFirst. The fallacy, which has from time immemorial been almost universal\namong workmen, that a material increase in the output of each man or\neach machine in the trade would result in the end in throwing a large\nnumber of men out of work.\n\nSecond. The defective systems of management which are in common use, and\nwhich make it necessary for each workman to soldier, or work slowly, in\norder that he may protect his own best interests.\n\nThird. The inefficient rule-of-thumb methods, which are still almost\nuniversal in all trades, and in practicing which our workmen waste a\nlarge part of their effort.\n\nThis paper will attempt to show the enormous gains which would result\nfrom the substitution by our workmen of scientific for rule-of-thumb\nmethods.\n\nTo explain a little more fully these three causes:\n\nFirst. The great majority of workmen still believe that if they were to\nwork at their best speed they would be doing a great injustice to the\nwhole trade by throwing a lot of men out of work, and yet the history of\nthe development of each trade shows that each improvement, whether it be\nthe invention of a new machine or the introduction of a better method,\nwhich results in increasing the productive capacity of the men in the\ntrade and cheapening the costs, instead of throwing men out of work make\nin the end work for more men.\n\nThe cheapening of any article in common use almost immediately results\nin a largely increased demand for that article. Take the case of shoes,\nfor instance. The introduction of machinery for doing every element of\nthe work which was formerly done by hand has resulted in making shoes at\na fraction of their former labor cost, and in selling them so cheap that\nnow almost every man, woman, and child in the working-classes buys one\nor two pairs of shoes per year, and wears shoes all the time, whereas\nformerly each workman bought perhaps one pair of shoes every five years,\nand went barefoot most of the time, wearing shoes only as a luxury or as\na matter of the sternest necessity. In spite of the enormously increased\noutput of shoes per workman, which has come with shoe machinery, the\ndemand for shoes has so increased that there are relatively more men\nworking in the shoe industry now than ever before.\n\nThe workmen in almost every trade have before them an object lesson of\nthis kind, and yet, because they are ignorant of the history of their\nown trade even, they still firmly believe, as their fathers did before\nthem, that it is against their best interests for each man to turn out\neach day as much work as possible.\n\nUnder this fallacious idea a large proportion of the workmen of both\ncountries each day deliberately work slowly so as to curtail the output.\nAlmost every labor union has made, or is contemplating making, rules\nwhich have for their object curtailing the output of their members,\nand those men who have the greatest influence with the working-people,\nthe labor leaders as well as many people with philanthropic feelings who\nare helping them, are daily spreading this fallacy and at the same time\ntelling them that they are overworked.\n\nA great deal has been and is being constantly said about \"sweat-shop\"\nwork and conditions. The writer has great sympathy with those who are\noverworked, but on the whole a greater sympathy for those who are under\npaid. For every individual, however, who is overworked, there are a\nhundred who intentionally under work--greatly under work--every day of\ntheir lives, and who for this reason deliberately aid in establishing\nthose conditions which in the end inevitably result in low wages. And\nyet hardly a single voice is being raised in an endeavor to correct this\nevil.\n\nAs engineers and managers, we are more intimately acquainted with these\nfacts than any other class in the community, and are therefore best\nfitted to lead in a movement to combat this fallacious idea by educating\nnot only the workmen but the whole of the country as to the true facts.\nAnd yet we are practically doing nothing in this direction, and are\nleaving this field entirely in the hands of the labor agitators (many of\nwhom are misinformed and misguided), and of sentimentalists who are\nignorant as to actual working conditions.\n\nSecond. As to the second cause for soldiering--the relations which exist\nbetween employers and employees under almost all of the systems of\nmanagement which are in common use--it is impossible in a few words to\nmake it clear to one not familiar with this problem why it is that the\nignorance of employers as to the proper time in which work of various\nkinds should be done makes it for the interest of the workman to\n\"soldier.\"\n\nThe writer therefore quotes herewith from a paper read before The\nAmerican Society of Mechanical Engineers, in June, 1903, entitled \"Shop\nManagement,\" which it is hoped will explain fully this cause for\nsoldiering:\n\n\"This loafing or soldiering proceeds from two causes. First, from the\nnatural instinct and tendency of men to take it easy, which may be\ncalled natural soldiering. Second, from more intricate second thought\nand reasoning caused by their relations with other men, which may be\ncalled systematic soldiering.\"\n\n\"There is no question that the tendency of the average man (in all walks\nof life) is toward working at a slow, easy gait, and that it is only\nafter a good deal of thought and observation on his part or as a result\nof example, conscience, or external pressure that he takes a more rapid\npace.\"\n\n\"There are, of course, men of unusual energy, vitality, and ambition who\nnaturally choose the fastest gait, who set up their own standards, and\nwho work hard, even though it may be against their best interests. But\nthese few uncommon men only serve by forming a contrast to emphasize the\ntendency of the average.\"\n\n\"This common tendency to 'take it easy' is greatly increased by bringing\na number of men together on similar work and at a uniform standard rate\nof pay by the day.\"\n\n\"Under this plan the better men gradually but surely slow down their\ngait to that of the poorest and least efficient. When a naturally\nenergetic man works for a few days beside a lazy one, the logic of the\nsituation is unanswerable.\"\n\n\"Why should I work hard when that lazy fellow gets the same pay that I\ndo and does only half as much work?\"\n\n\"A careful time study of men working under these conditions will\ndisclose facts which are ludicrous as well as pitiable.\"\n\n\"To illustrate: The writer has timed a naturally energetic workman who,\nwhile going and coming from work, would walk at a speed of from three to\nfour miles per hour, and not infrequently trot home after a day's work.\nOn arriving at his work he would immediately slow down to a speed of\nabout one mile an hour. When, for example, wheeling a loaded\nwheelbarrow, he would go at a good fast pace even up hill in order to be\nas short a time as possible under load, and immediately on the return\nwalk slow down to a mile an hour, improving every opportunity for delay\nshort of actually sitting down. In order to be sure not to do more than\nhis lazy neighbor, he would actually tire himself in his effort to go\nslow.\"\n\n\"These men were working under a foreman of good reputation and highly\nthought of by his employer, who, when his attention was called to this\nstate of things, answered: 'Well, I can keep them from sitting down, but\nthe devil can't make them get a move on while they are at work.'\"\n\n\"The natural laziness of men is serious, but by far the greatest evil\nfrom which both workmen and employers are suffering is the systematic\nsoldiering which is almost universal under all of the ordinary schemes\nof management and which results from a careful study on the part of the\nworkmen of what will promote their best interests.\"\n\n\"The writer was much interested recently in hearing one small but\nexperienced golf caddy boy of twelve explaining to a green caddy, who\nhad shown special energy and interest, the necessity of going slow and\nlagging behind his man when he came up to the ball, showing him that\nsince they were paid by the hour, the faster they went the less money\nthey got, and finally telling him that if he went too fast the other\nboys would give him a licking.\"\n\n\"This represents a type of systematic soldiering which is not, however,\nvery serious, since it is done with the knowledge of the employer, who\ncan quite easily break it up if he wishes.\"\n\n\"The greater part of the systematic soldiering, however, is done by the\nmen with the deliberate object of keeping their employers ignorant of\nhow fast work can be done.\"\n\n\"So universal is soldiering for this purpose that hardly a competent\nworkman can be found in a large establishment, whether he works by the\nday or on piece work, contract work, or under any of the ordinary\nsystems, who does not devote a considerable part of his time to studying\njust how slow he can work and still convince his employer that he is\ngoing at a good pace.\"\n\n\"The causes for this are, briefly, that practically all employers\ndetermine upon a maximum sum which they feel it is right for each of\ntheir classes of employees to earn per day, whether their men work by\nthe day or piece.\"\n\n\"Each workman soon finds out about what this figure is for his\nparticular case, and he also realizes that when his employer is\nconvinced that a man is capable of doing more work than he has done, he\nwill find sooner or later some way of compelling him to do it with\nlittle or no increase of pay.\"\n\n\"Employers derive their knowledge of how much of a given class of work\ncan be done in a day from either their own experience, which has\nfrequently grown hazy with age, from casual and unsystematic observation\nof their men, or at best from records which are kept, showing the\nquickest time in which each job has been done. In many cases the\nemployer will feel almost certain that a given job can be done faster\nthan it has been, but he rarely cares to take the drastic measures\nnecessary to force men to do it in the quickest time, unless he has an\nactual record proving conclusively how fast the work can be done.\"\n\n\"It evidently becomes for each man's interest, then, to see that no job\nis done faster than it has been in the past. The younger and less\nexperienced men are taught this by their elders, and all possible\npersuasion and social pressure is brought to bear upon the greedy and\nselfish men to keep them from making new records which result in\ntemporarily increasing their wages, while all those who come after them\nare made to work harder for the same old pay.\"\n\n\"Under the best day work of the ordinary type, when accurate records are\nkept of the amount of work done by each man and of his efficiency, and\nwhen each man's wages are raised as he improves, and those who fail to\nrise to a certain standard are discharged and a fresh supply of\ncarefully selected men are given work in their places, both the natural\nloafing and systematic soldiering can be largely broken up. This can\nonly be done, however, when the men are thoroughly convinced that there\nis no intention of establishing piece work even in the remote future,\nand it is next to impossible to make men believe this when the work is\nof such a nature that they believe piece work to be practicable. In most\ncases their fear of making a record which will be used as a basis for\npiece work will cause them to soldier as much as they dare.\"\n\n\"It is, however, under piece work that the art of systematic soldiering\nis thoroughly developed; after a workman has had the price per piece of\nthe work he is doing lowered two or three times as a result of his\nhaving worked harder and increased his output, he is likely entirely to\nlose sight of his employer's side of the case and become imbued with a\ngrim determination to have no more cuts if soldiering can prevent it.\nUnfortunately for the character of the workman, soldiering involves a\ndeliberate attempt to mislead and deceive his employer, and thus upright\nand straightforward workmen are compelled to become more or less\nhypocritical. The employer is soon looked upon as an antagonist, if not\nan enemy, and the mutual confidence which should exist between a leader\nand his men, the enthusiasm, the feeling that they are all working for\nthe same end and will share in the results is entirely lacking.\n\n\"The feeling of antagonism under the ordinary piece-work system becomes\nin many cases so marked on the part of the men that any proposition made\nby their employers, however reasonable, is looked upon with suspicion,\nand soldiering becomes such a fixed habit that men will frequently take\npains to restrict the product of machines which they are running when\neven a large increase in output would involve no more work on their\npart.\"\n\nThird. As to the third cause for slow work, considerable space will\nlater in this paper be devoted to illustrating the great gain, both to\nemployers and employees, which results from the substitution of\nscientific for rule-of-thumb methods in even the smallest details of the\nwork of every trade. The enormous saving of time and therefore increase\nin the output which it is possible to effect through eliminating\nunnecessary motions and substituting fast for slow and inefficient\nmotions for the men working in any of our trades can be fully realized\nonly after one has personally seen the improvement which results from a\nthorough motion and time study, made by a competent man.\n\nTo explain briefly: owing to the fact that the workmen in all of our\ntrades have been taught the details of their work by observation of\nthose immediately around them, there are many different ways in common\nuse for doing the same thing, perhaps forty, fifty, or a hundred ways of\ndoing each act in each trade, and for the same reason there is a great\nvariety in the implements used for each class of work. Now, among the\nvarious methods and implements used in each element of each trade there\nis always one method and one implement which is quicker and better than\nany of the rest.\n\nAnd this one best method and best implement can only be discovered or\ndeveloped through a scientific study and analysis of all of the methods\nand implements in use, together with accurate, minute, motion and time\nstudy. This involves the gradual substitution of science for rule of\nthumb throughout the mechanic arts.\n\nThis paper will show that the underlying philosophy of all of the old\nsystems of management in common use makes it imperative that each\nworkman shall be left with the final responsibility for doing his job\npractically as he thinks best, with comparatively little help and advice\nfrom the management. And it will also show that because of this\nisolation of workmen, it is in most cases impossible for the men working\nunder these systems to do their work in accordance with the rules and\nlaws of a science or art, even where one exists.\n\nThe writer asserts as a general principle (and he proposes to give\nillustrations tending to prove the fact later in this paper) that in\nalmost all of the mechanic arts the science which underlies each act of\neach workman is so great and amounts to so much that the workman who is\nbest suited to actually doing the work is incapable of fully\nunderstanding this science, without the guidance and help of those who\nare working with him or over him, either through lack of education or\nthrough insufficient mental capacity. In order that the work may be done\nin accordance with scientific laws, it is necessary that there shall be\na far more equal division of the responsibility between the management\nand the workmen than exists under any of the ordinary types of\nmanagement. Those in the management whose duty it is to develop this\nscience should also guide and help the workman in working under it, and\nshould assume a much larger share of the responsibility for results than\nunder usual conditions is assumed by the management.\n\nThe body of this paper will make it clear that, to work according to\nscientific laws, the management must take over and perform much of the\nwork which is now left to the men; almost every act of the workman\nshould be preceded by one or more preparatory acts of the management\nwhich enable him to do his work better and quicker than he otherwise\ncould. And each man should daily be taught by and receive the most\nfriendly help from those who are over him, instead of being, at the one\nextreme, driven or coerced by his bosses, and at the other left to his\nown unaided devices.\n\nThis close, intimate, personal cooperation between the management and\nthe men is of the essence of modern scientific or task management.\n\nIt will be shown by a series of practical illustrations that, through\nthis friendly cooperation, namely, through sharing equally in every\nday's burden, all of the great obstacles (above described) to obtaining\nthe maximum output for each man and each machine in the establishment\nare swept away. The 30 per cent to 100 per cent increase in wages which\nthe workmen are able to earn beyond what they receive under the old type\nof management, coupled with the daily intimate shoulder to shoulder\ncontact with the management, entirely removes all cause for soldiering.\nAnd in a few years, under this system, the workmen have before them the\nobject lesson of seeing that a great increase in the output per man\nresults in giving employment to more men, instead of throwing men out of\nwork, thus completely eradicating the fallacy that a larger output for\neach man will throw other men out of work.\n\nIt is the writer's judgment, then, that while much can be done and\nshould be done by writing and talking toward educating not only workmen,\nbut all classes in the community, as to the importance of obtaining the\nmaximum output of each man and each machine, it is only through the\nadoption of modern scientific management that this great problem can be\nfinally solved. Probably most of the readers of this paper will say that\nall of this is mere theory. On the contrary, the theory, or philosophy,\nof scientific management is just beginning to be understood, whereas the\nmanagement itself has been a gradual evolution, extending over a period\nof nearly thirty years. And during this time the employees of one\ncompany after another, including a large range and diversity of\nindustries, have gradually changed from the ordinary to the scientific\ntype of management. At least 50,000 workmen in the United States are now\nemployed under this system; and they are receiving from 30 per cent to\n100 per cent higher wages daily than are paid to men of similar caliber\nwith whom they are surrounded, while the companies employing them are\nmore prosperous than ever before. In these companies the output, per man\nand per machine, has on an average been doubled. During all these years\nthere has never been a single strike among the men working under this\nsystem. In place of the suspicious watchfulness and the more or less\nopen warfare which characterizes the ordinary types of management, there\nis universally friendly cooperation between the management and the men.\n\nSeveral papers have been written, describing the expedients which have\nbeen adopted and the details which have been developed under scientific\nmanagement and the steps to be taken in changing from the ordinary to\nthe scientific type. But unfortunately most of the readers of these\npapers have mistaken the mechanism for the true essence. Scientific\nmanagement fundamentally consists of certain broad general principles, a\ncertain philosophy, which can be applied in many ways, and a description\nof what any one man or men may believe to be the best mechanism for\napplying these general principles should in no way be confused with the\nprinciples themselves.\n\nIt is not here claimed that any single panacea exists for all of the\ntroubles of the working-people or of employers. As long as some people\nare born lazy or inefficient, and others are born greedy and brutal, as\nlong as vice and crime are with us, just so long will a certain amount\nof poverty, misery, and unhappiness be with us Also. No system of\nmanagement, no single expedient--within the control of any man or any\nset of men can insure continuous prosperity to either workmen or\nemployers. Prosperity depends upon so many factors entirely beyond the\ncontrol of any one set of men, any state, or even any one country, that\ncertain periods will inevitably come when both sides must suffer, more\nor less. It is claimed, however, that under scientific management the\nintermediate periods will be far more prosperous, far happier, and more\nfree from discord and dissension. And also, that the periods will be\nfewer, shorter and the suffering less. And this will be particularly\ntrue in any one town, any one section of the country, or any one state\nwhich first substitutes the principles of scientific management for the\nrule of thumb.\n\nThat these principles are certain to come into general use practically\nthroughout the civilized world, sooner or later, the writer is\nprofoundly convinced, and the sooner they come the better for all the\npeople.\n\n\n\nCHAPTER II\n\nTHE PRINCIPLES OF SCIENTIFIC MANAGEMENT\n\nThe writer has found that there are three questions uppermost in the\nminds of men when they become interested in scientific management.\n\nFirst. Wherein do the principles of scientific management differ\nessentially from those of ordinary management?\n\nSecond. Why are better results attained under scientific management than\nunder the other types?\n\nThird. Is not the most important problem that of getting the right man\nat the head of the company? And if you have the right man cannot the\nchoice of the type of management be safely left to him?\n\nOne of the principal objects of the following pages will be to give a\nsatisfactory answer to these questions.\n\n\nTHE FINEST TYPE OF ORDINARY MANAGEMENT\n\nBefore starting to illustrate the principles of scientific management,\nor \"task management\" as it is briefly called, it seems desirable to\noutline what the writer believes will be recognized as the best type of\nmanagement which is in common use. This is done so that the great\ndifference between the best of the ordinary management and scientific\nmanagement may be fully appreciated.\n\nIn an industrial establishment which employs say from 500 to 1000\nworkmen, there will be found in many cases at least twenty to thirty\ndifferent trades. The workmen in each of these trades have had their\nknowledge handed down to them by word of mouth, through the many years\nin which their trade has been developed from the primitive condition, in\nwhich our far-distant ancestors each one practiced the rudiments of many\ndifferent trades, to the present state of great and growing subdivision\nof labor, in which each man specializes upon some comparatively small\nclass of work.\n\nThe ingenuity of each generation has developed quicker and better\nmethods for doing every element of the work in every trade. Thus the\nmethods which are now in use may in a broad sense be said to be an\nevolution representing the survival of the fittest and best of the ideas\nwhich have been developed since the starting of each trade. However,\nwhile this is true in a broad sense, only those who are intimately\nacquainted with each of these trades are fully aware of the fact that in\nhardly any element of any trade is there uniformity in the methods which\nare used. Instead of having only one way which is generally accepted as\na standard, there are in daily use, say, fifty or a hundred different\nways of doing each element of the work. And a little thought will make\nit clear that this must inevitably be the case, since our methods have\nbeen handed down from man to man by word of mouth, or have, in most\ncases, been almost unconsciously learned through personal observation.\nPractically in no instances have they been codified or systematically\nanalyzed or described. The ingenuity and experience of each\ngeneration--of each decade, even, have without doubt handed over better\nmethods to the next. This mass of rule-of-thumb or traditional knowledge\nmay be said to be the principal asset or possession of every tradesman.\nNow, in the best of the ordinary types of management, the managers\nrecognize frankly the fact that the 500 or 1000 workmen, included in the\ntwenty to thirty trades, who are under them, possess this mass of\ntraditional knowledge, a large part of which is not in the possession of\nthe management. The management, of course, includes foremen and\nsuperintendents, who themselves have been in most cases first-class\nworkers at their trades. And yet these foremen and superintendents know,\nbetter than any one else, that their own knowledge and personal skill\nfalls far short of the combined knowledge and dexterity of all the\nworkmen under them. The most experienced managers therefore frankly\nplace before their workmen the problem of doing the work in the best and\nmost economical way. They recognize the task before them as that of\ninducing each workman to use his best endeavors, his hardest work, all\nhis traditional knowledge, his skill, his ingenuity, and his\ngood-will--in a word, his \"initiative,\" so as to yield the largest\npossible return to his employer. The problem before the management,\nthen, may be briefly said to be that of obtaining the best initiative of\nevery workman. And the writer uses the word \"initiative\" in its broadest\nsense, to cover all of the good qualities sought for from the men.\n\nOn the other hand, no intelligent manager would hope to obtain in any\nfull measure the initiative of his workmen unless he felt that he was\ngiving them something more than they usually receive from their\nemployers. Only those among the readers of this paper who have been\nmanagers or who have worked themselves at a trade realize how far the\naverage workman falls short of giving his employer his full initiative.\nIt is well within the mark to state that in nineteen out of twenty\nindustrial establishments the workmen believe it to be directly against\ntheir interests to give their employers their best initiative, and that\ninstead of working hard to do the largest possible amount of work and\nthe best quality of work for their employers, they deliberately work as\nslowly as they dare while they at the same time try to make those over\nthem believe that they are working fast.*\n\n[*Footnote: The writer has tried to make the reason for this unfortunate\nstate of things clear in a paper entitled \"Shop Management,\" read before\nthe American Society of Mechanical Engineers.]\n\nThe writer repeats, therefore, that in order to have any hope of\nobtaining the initiative of his workmen the manager must give some\nspecial incentive to his men beyond that which is given to the average\nof the trade. This incentive can be given in several different ways, as,\nfor example, the hope of rapid promotion or advancement; higher wages,\neither in the form of generous piece-work prices or of a premium or\nbonus of some kind for good and rapid work; shorter hours of labor;\nbetter surroundings and working conditions than are ordinarily given,\netc., and, above all, this special incentive should be accompanied by\nthat personal consideration for, and friendly contact with, his workmen\nwhich comes only from a genuine and kindly interest in the welfare of\nthose under him. It is only by giving a special inducement or\n\"incentive\" of this kind that the employer can hope even approximately\nto get the \"initiative\" of his workmen. Under the ordinary type of\nmanagement the necessity for offering the workman a special inducement\nhas come to be so generally recognized that a large proportion of those\nmost interested in the subject look upon the adoption of some one of the\nmodern schemes for paying men (such as piece work, the premium plan, or\nthe bonus plan, for instance) as practically the whole system of\nmanagement. Under scientific management, however, the particular pay\nsystem which is adopted is merely one of the subordinate elements.\n\nBroadly speaking, then, the best type of management in ordinary use may\nbe defined as management in which the workmen give their best initiative\nand in return receive some special incentive from their employers. This\ntype of management will be referred to as the management of \"initiative\nand incentive\" in contradistinction to scientific management, or task\nmanagement, with which it is to be compared.\n\nThe writer hopes that the management of \"initiative and incentive\" will\nbe recognized as representing the best type in ordinary use, and in fact\nhe believes that it will be hard to persuade the average manager that\nanything better exists in the whole field than this type. The task which\nthe writer has before him, then, is the difficult one of trying to prove\nin a thoroughly convincing way that there is another type of management\nwhich is not only better but overwhelmingly better than the management\nof \"initiative and incentive.\"\n\nThe universal prejudice in favor of the management of \"initiative and\nincentive\" is so strong that no mere theoretical advantages which can be\npointed out will be likely to convince the average manager that any\nother system is better. It will be upon a series of practical\nillustrations of the actual working of the two systems that the writer\nwill depend in his efforts to prove that scientific management is so\ngreatly superior to other types. Certain elementary principles, a\ncertain philosophy, will however be recognized as the essence of that\nwhich is being illustrated in all of the practical examples which will\nbe given. And the broad principles in which the scientific system\ndiffers from the ordinary or \"rule-of-thumb\" system are so simple in\ntheir nature that it seems desirable to describe them before starting\nwith the illustrations.\n\nUnder the old type of management success depends almost entirely upon\ngetting the \"initiative\" of the workmen, and it is indeed a rare case in\nwhich this initiative is really attained. Under scientific management\nthe \"initiative\" of the workmen (that is, their hard work, their\ngood-will, and their ingenuity) is obtained with absolute uniformity and\nto a greater extent than is possible under the old system; and in\naddition to this improvement on the part of the men, the managers assume\nnew burdens, new duties, and responsibilities never dreamed of in the\npast. The managers assume, for instance, the burden of gathering\ntogether all of the traditional knowledge which in the past has been\npossessed by the workmen and then of classifying, tabulating, and\nreducing this knowledge to rules, laws, and formulae which are immensely\nhelpful to the workmen in doing their daily work. In addition to\ndeveloping a science in this way, the management take on three other\ntypes of duties which involve new and heavy burdens for themselves.\n\nThese new duties are grouped under four heads:\n\nFirst. They develop a science for each element of a man's work, which\nreplaces the old rule-of.-thumb method.\n\nSecond. They scientifically select and then train, teach, and develop\nthe workman, whereas in the past he chose his own work and trained\nhimself as best he could.\n\nThird. They heartily cooperate with the men so as to insure all of the\nwork being done in accordance with the principles of the science which\nhas been developed.\n\nFourth. There is an almost equal division of the work and the\nresponsibility between the management and the workmen. The management\ntake over all work for which they are better fitted than the workmen,\nwhile in the past almost all of the work and the greater part of the\nresponsibility were thrown upon the men.\n\nIt is this combination of the initiative of the workmen, coupled with\nthe new types of work done by the management, that makes scientific\nmanagement so much more efficient than the old plan.\n\nThree of these elements exist in many cases, under the management of\n\"initiative and incentive,\" in a small and rudimentary way, but they\nare, under this management, of minor importance, whereas under\nscientific management they form the very essence of the whole system.\n\nThe fourth of these elements, \"an almost equal division of the\nresponsibility between the management and the workmen,\" requires further\nexplanation. The philosophy of the management of initiative and\nincentive makes it necessary for each workman to bear almost the entire\nresponsibility for the general plan as well as for each detail of his\nwork, and in many cases for his implements as well. In addition to this\nhe must do all of the actual physical labor. The development of a\nscience, on the other hand, involves the establishment of many rules,\nlaws, and formulae which replace the judgment of the individual workman\nand which can be effectively used only after having been systematically\nrecorded, indexed, etc. The practical use of scientific data also calls\nfor a room in which to keep the books, records*, etc., and a desk for\nthe planner to work at.\n\n[*Footnote: For example, the records containing the data used under\nscientific management in an ordinary machine-shop fill thousands of\npages.]\n\nThus all of the planning which under the old system was done by the\nworkman, as a result of his personal experience, must of necessity under\nthe new system be done by the management in accordance with the laws of\nthe science; because even if the workman was well suited to the\ndevelopment and use of scientific data, it would be physically\nimpossible for him to work at his machine and at a desk at the same\ntime. It is also clear that in most cases one type of man is needed to\nplan ahead and an entirely different type to execute the work.\n\nThe man in the planning room, whose specialty under scientific\nmanagement is planning ahead, invariably finds that the work can be done\nbetter and more economically by a subdivision of the labor; each act of\neach mechanic, for example, should be preceded by various preparatory\nacts done by other men. And all of this involves, as we have said, \"an\nalmost equal division of the responsibility and the work between the\nmanagement and the workman.\"\n\nTo summarize: Under the management of \"initiative and incentive\"\npractically the whole problem is \"up to the workman,\" while under\nscientific management fully one-half of the problem is \"up to the\nmanagement.\"\n\nPerhaps the most prominent single element in modern scientific\nmanagement is the task idea. The work of every workman is fully planned\nout by the management at least one day in advance, and each man receives\nin most cases complete written instructions, describing in detail the\ntask which he is to accomplish, as well as the means to be used in doing\nthe work. And the work planned in advance in this way constitutes a task\nwhich is to be solved, as explained above, not by the workman alone, but\nin almost all cases by the joint effort of the workman and the\nmanagement. This task specifies not only what is to be done but how it\nis to be done and the exact time allowed for doing it. And whenever the\nworkman succeeds in doing his task right, and within the time limit\nspecified, he receives an addition of from 30 per cent to 100 per cent\nto his ordinary wages. These tasks are carefully planned, so that both\ngood and careful work are called for in their performance, but it should\nbe distinctly understood that in no case is the workman called upon to\nwork at a pace which would be injurious to his health. The task is\nalways so regulated that the man who is well suited to his job will\nthrive while working at this rate during a long term of years and grow\nhappier and more prosperous, instead of being overworked. Scientific\nmanagement consists very largely in preparing for and carrying out these\ntasks.\n\nThe writer is fully aware that to perhaps most of the readers of this\npaper the four elements which differentiate the new management from the\nold will at first appear to be merely high-sounding phrases; and he\nwould again repeat that he has no idea of convincing the reader of their\nvalue merely through announcing their existence. His hope of carrying\nconviction rests upon demonstrating the tremendous force and effect of\nthese four elements through a series of practical illustrations. It will\nbe shown, first, that they can be applied absolutely to all classes of\nwork, from the most elementary to the most intricate; and second, that\nwhen they are applied, the results must of necessity be overwhelmingly\ngreater than those which it is possible to attain under the management\nof initiative and incentive.\n\nThe first illustration is that of handling pig iron, and this work is\nchosen because it is typical of perhaps the crudest and most elementary\nform of labor which is performed by man. This work is done by men with\nno other implements than their hands. The pig-iron handler stoops down,\npicks up a pig weighing about 92 pounds, walks for a few feet or yards\nand then drops it on to the ground or upon a pile. This work is so crude\nand elementary in its nature that the writer firmly believes that it\nwould be possible to train an intelligent, gorilla so as to become a\nmore efficient pig-iron handler than any man can be. Yet it will be\nshown that the science of handling pig iron is so great and amounts to\nso much that it is impossible for the man who is best suited to this\ntype of work to understand the principles of this science, or even to\nwork in accordance with these principles without the aid of a man better\neducated than he is. And the further illustrations to be given will make\nit clear that in almost all of the mechanic arts the science which\nunderlies each workman's act is so great and amounts to so much that the\nworkman who is best suited actually to do the work is incapable (either\nthrough lack of education or through insufficient mental capacity) of\nunderstanding this science. This is announced as a general principle,\nthe truth of which will become apparent as one illustration after\nanother is given. After showing these four elements in the handling of\npig iron, several illustrations will be given of their application to\ndifferent kinds of work in the field of the mechanic arts, at intervals\nin a rising scale, beginning with the simplest and ending with the more\nintricate forms of labor.\n\nOne of the first pieces of work undertaken by us, when the writer\nstarted to introduce scientific management into the Bethlehem Steel\nCompany, was to handle pig iron on task work. The opening of the Spanish\nWar found some 80,000 tons of pig iron placed in small piles in an open\nfield adjoining the works. Prices for pig iron had been so low that it\ncould not be sold at a profit, and it therefore had been stored. With\nthe opening of the Spanish War the price of pig iron rose, and this\nlarge accumulation of iron was sold. This gave us a good opportunity to\nshow the workmen, as well as the owners and managers of the works, on a\nfairly large scale the advantages of task work over the old-fashioned\nday work and piece work, in doing a very elementary class of work.\n\nThe Bethlehem Steel Company had five blast furnaces, the product of\nwhich had been handled by a pig-iron gang for many years. This gang, at\nthis time, consisted of about 75 men. They were good, average pig-iron\nhandlers, were under an excellent foreman who himself had been a\npig-iron handler, and the work was done, on the whole, about as fast and\nas cheaply as it was anywhere else at that time.\n\nA railroad switch was run out into the field, right along the edge of\nthe piles of pig iron. An inclined plank was placed against the side of\na car, and each man picked up from his pile a pig of iron weighing about\n92 pounds, walked up the inclined plank and dropped it on the end of the\ncar.\n\nWe found that this gang were loading on the average about 12 and a half\nlong tons per man per day. We were surprised to find, after studying the\nmatter, that a first-class pig-iron handler ought to handle between 47,\nand 48 long tons per day, instead of 12 and a half tons. This task\nseemed to us so very large that we were obliged to go over our work\nseveral times before we were absolutely sure that we were right. Once we\nwere sure, however, that 47 tons was a proper day's work for a\nfirst-class pig-iron handler, the task which faced us as managers under\nthe modern scientific plan was clearly before us. It was our duty to see\nthat the 80,000 tons of pig iron was loaded on to the cars at the rate\nof 47 tons per man per day, in place of 12 and a half tons, at which\nrate the work was then being done. And it was further our duty to see\nthat this work was done without bringing on a strike among the men,\nwithout any quarrel with the men, and to see that the men were happier\nand better contented when loading at the new rate of 47 tons than they\nwere when loading at the old rate of 12 and a half tons.\n\nOur first step was the scientific selection of the workman. In dealing\nwith workmen under this type of management, it is an inflexible rule to\ntalk to and deal with only one man at a time, since each workman has his\nown special abilities and limitations, and since we are not dealing with\nmen in masses, but are trying to develop each individual man to his\nhighest state of efficiency and prosperity. Our first step was to find\nthe proper workman to begin with. We therefore carefully watched and\nstudied these 75 men for three or four days, at the end of which time we\nhad picked out four men who appeared to be physically able to handle pig\niron at the rate of 47 tons per day. A careful study was then made of\neach of these men. We looked up their history as far back as practicable\nand thorough inquiries were made as to the character, habits, and the\nambition of each of them. Finally we selected one from among the four as\nthe most likely man to start with. He was a little Pennsylvania Dutchman\nwho had been observed to trot back home for a mile or so after his work\nin the evening about as fresh as he was when he came trotting down to\nwork in the morning. We found that upon wages of $1.15 a day he had\nsucceeded in buying a small plot of ground, and that he was engaged in\nputting up the walls of a little house for himself in the morning before\nstarting to work and at night after leaving. He also had the reputation\nof being exceedingly \"close,\" that is, of placing a very high value on a\ndollar. As one man whom we talked to about him said, \"A penny looks\nabout the size of a cart-wheel to him.\" This man we will call Schmidt.\n\nThe task before us, then, narrowed itself down to getting Schmidt to\nhandle 47 tons of pig iron per day and making him glad to do it. This\nwas done as follows. Schmidt was called out from among the gang of\npig-iron handlers and talked to somewhat in this way:\n\n\"Schmidt, are you a high-priced man?\"\n\n\"Vell, I don't know vat you mean.\"\n\n\"Oh yes, you do. What I want to know is whether you are a high-priced\nman or not.\"\n\n\"Vell, I don't know vat you mean.\"\n\n\"Oh, come now, you answer my questions. What I want to find out is\nwhether you are a high-priced man or one of these cheap fellows here.\nWhat I want to find out is whether you want to earn $1.85 a day or\nwhether you are satisfied with $1.15, just the same as all those cheap\nfellows are getting.\"\n\n\"Did I vant $1.85 a day? Vas dot a high-priced man? Vell, yes, I vas a\nhigh-priced man.\"\n\n\"Oh, you're aggravating me. Of course you want $1.85 a day--every one\nwants it! You know perfectly well that that has very little to do with\nyour being a high-priced man. For goodness' sake answer my questions,\nand don't waste any more of my time. Now come over here. You see that\npile of pig iron?\"\n\n\"Yes.\"\n\n\"You see that car?\"\n\n\"Yes.\"\n\n\"Well, if you are a high-priced man, you will load that pig iron on that\ncar tomorrow for $1.85. Now do wake up and answer my question. Tell me\nwhether you are a high-priced man or not.\"\n\n\"Vell, did I got $1.85 for loading dot pig iron on dot car to-morrow?\"\n\n\"Yes, of course you do, and you get $1.85 for loading a pile like that\nevery day right through the year. That is what a high-priced man does,\nand you know it just as well as I do.\"\n\n\"Vell, dot's all right. I could load dot pig iron on the car to-morrow\nfor $1.85, and I get it every day, don't I?\"\n\n\"Certainly you do--certainly you do.\"\n\n\"Vell, den, I vas a high-priced man.\"\n\n\"Now, hold on, hold on. You know just as well as I do that a high-priced\nman has to do exactly as he's told from morning till night. You have\nseen this man here before, haven't you?\"\n\n\"No, I never saw him.\"\n\n\"Well, if you are a high-priced man, you will do exactly as this man\ntells you tomorrow, from morning till night. When he tells you to pick\nup a pig and walk, you pick it up and you walk, and when he tells you to\nsit down and rest, you sit down. You do that right straight through the\nday. And what's more, no back talk. Now a high-priced man does just what\nhe's told to do, and no back talk. Do you understand that? When this man\ntells you to walk, you walk; when he tells you to sit down, you sit\ndown, and you don't talk back at him. Now you come on to work here\nto-morrow morning and I'll know before night whether you are really a\nhigh-priced man or not.\"\n\nThis seems to be rather rough talk. And indeed it would be if applied to\nan educated mechanic, or even an intelligent laborer. With a man of the\nmentally sluggish type of Schmidt it is appropriate and not unkind,\nsince it is effective in fixing his attention on the high wages which he\nwants and away from what, if it were called to his attention, he\nprobably would consider impossibly hard work.\n\nWhat would Schmidt's answer be if he were talked to in a manner which is\nusual under the management of \"initiative and incentive\"? say, as\nfollows:\n\n\"Now, Schmidt, you are a first-class pig-iron handler and know your\nbusiness well. You have been handling at the rate of 12 and a half tons\nper day. I have given considerable study to handling pig iron, and feel\nsure that you could do a much larger day's work than you have been\ndoing. Now don't you think that if you really tried you could handle 47\ntons of pig iron per day, instead of 12 and a half tons?\"\n\nWhat do you think Schmidt's answer would be to this?\n\nSchmidt started to work, and all day long, and at regular intervals, was\ntold by the man who stood over him with a watch, \"Now pick up a pig and\nwalk. Now sit down and rest. Now walk--now rest,\" etc. He worked when\nhe was told to work, and rested when he was told to rest, and at\nhalf-past five in the afternoon had his 47 and a half tons loaded on the\ncar. And he practically never failed to work at this pace and do the\ntask that was set him during the three years that the writer was at\nBethlehem. And throughout this time he averaged a little more than $1.85\nper day, whereas before he had never received over $1.15 per day, which\nwas the ruling rate of wages at that time in Bethlehem. That is, he\nreceived 60 per cent. higher wages than were paid to other men who were\nnot working on task work. One man after another was picked out and\ntrained to handle pig iron at the rate of 47 and a half tons per day\nuntil all of the pig iron was handled at this rate, and the men were\nreceiving 60 per cent. more wages than other workmen around them.\n\nThe writer has given above a brief description of three of the four\nelements which constitute the essence of scientific management: first,\nthe careful selection of the workman, and, second and third, the method\nof first inducing and then training and helping the workman to work\naccording to the scientific method. Nothing has as yet been said about\nthe science of handling pig iron. The writer trusts, however, that\nbefore leaving this illustration the reader will be thoroughly convinced\nthat there is a science of handling pig iron, and further that this\nscience amounts to so much that the man who is suited to handle pig iron\ncannot possibly understand it, nor even work in accordance with the laws\nof this science, without the help of those who are over him.\n\nThe writer came into the machine-shop of the Midvale Steel Company in\n1878, after having served an apprenticeship as a pattern-maker and as a\nmachinist. This was close to the end of the long period of depression\nfollowing the panic of 1873, and business was so poor that it was\nimpossible for many mechanics to get work at their trades. For this\nreason he was obliged to start as a day laborer instead of working as a\nmechanic. Fortunately for him, soon after he came into the shop the\nclerk of the shop was found stealing. There was no one else available,\nand so, having more education than the other laborers (since he had been\nprepared for college) he was given the position of clerk. Shortly after\nthis he was given work as a machinist in running one of the lathes, and,\nas he turned out rather more work than other machinists were doing on\nsimilar lathes, after several months was made gang boss over the lathes.\n\nAlmost all of the work of this shop had been done on piece work for\nseveral years. As was usual then, and in fact as is still usual in most\nof the shops in this country, the shop was really run by the workmen,\nand not by the bosses. The workmen together had carefully planned just\nhow fast each job should be done, and they had set a pace for each\nmachine throughout the shop, which was limited to about one-third of a\ngood day's work. Every new workman who came into the shop was told at\nonce by the other men exactly how much of each kind of work he was to\ndo, and unless he obeyed these instructions he was sure before long to\nbe driven out of the place by the men.\n\nAs soon as the writer was made gang-boss, one after another of the men\ncame to him and talked somewhat as follows:\n\n\"Now, Fred we're very glad to see that you've been made gang-boss. You\nknow the game all right, and we're sure that you're not likely to be a\npiece-work hog. You come along with us, and every-thing will be all\nright, but if you try breaking any of these rates you can be mighty sure\nthat we'll throw you over the fence.\"\n\nThe writer told them plainly that he was now working on the side of the\nmanagement, and that he proposed to do whatever he could to get a fair\nday's work out of the lathes. This immediately started a war; in most\ncases a friendly war, because the men who were under him were his\npersonal friends, but none the less a war, which as time went on grew\nmore and more bitter. The writer used every expedient to make them do a\nfair day's work, such as discharging or lowering the wages of the more\nstubborn men who refused to make any improvement, and such as lowering\nthe piece-work price, hiring green men, and personally teaching them how\nto do the work, with the promise from them that when they had learned\nhow, they would then do a fair day's work. While the men constantly\nbrought such pressure to bear (both inside and outside the works) upon\nall those who started to increase their output that they were finally\ncompelled to do about as the rest did, or else quit. No one who has not\nhad this experience can have an idea of the bitterness which is\ngradually developed in such a struggle. In a war of this kind the\nworkmen have one expedient which is usually effective. They use their\ningenuity to contrive various ways in which the machines which they are\nrunning are broken or damaged--apparently by accident, or in the regular\ncourse of work--and this they always lay at the door of the foreman, who\nhas forced them to drive the machine so hard that it is overstrained and\nis being ruined. And there are few foremen indeed who are able to stand\nup against the combined pressure of all of the men in the shop. In this\ncase the problem was complicated by the fact that the shop ran both day\nand night.\n\nThe writer had two advantages, however, which are not possessed by the\nordinary foreman, and these came, curiously enough, from the fact that\nhe was not the son of a working man.\n\nFirst, owing to the fact that he happened not to be of working parents,\nthe owners of the company believed that he had the interest of the works\nmore at heart than the other workmen, and they therefore had more\nconfidence in his word than they did in that of the machinists who were\nunder him. So that, when the machinists reported to the Superintendent\nthat the machines were being smashed up because an incompetent foreman\nwas overstraining them, the Superintendent accepted the word of the\nwriter when he said that these men were deliberately breaking their\nmachines as a part of the piece-work war which was going on, and he also\nallowed the writer to make the only effective answer to this Vandalism\non the part of the men, namely: \"There will be no more accidents to the\nmachines in this shop. If any part of a machine is broken the man in\ncharge of it must pay at least a part of the cost of its repair, and the\nfines collected in this way will all be handed over to the mutual\nbeneficial association to help care for sick workmen.\" This soon stopped\nthe willful breaking of machines.\n\nSecond. If the writer had been one of the workmen, and had lived where\nthey lived, they would have brought such social pressure to bear upon\nhim that it would have been impossible to have stood out against them.\nHe would have been called \"scab\" and other foul names every time he\nappeared on the street, his wife would have been abused, and his\nchildren would have been stoned. Once or twice he was begged by some of\nhis friends among the workmen not to walk home, about two and a half\nmiles along the lonely path by the side of the railway. He was told that\nif he continued to do this it would be at the risk of his life. In all\nsuch cases, however, a display of timidity is apt to increase rather\nthan diminish the risk, so the writer told these men to say to the other\nmen in the shop that he proposed to walk home every night right up that\nrailway track; that he never had carried and never would carry any\nweapon of any kind, and that they could shoot and be d------.\n\nAfter about three years of this kind of struggling, the output of the\nmachines had been materially increased, in many cases doubled, and as a\nresult the writer had been promoted from one gang-boss-ship to another\nuntil he became foreman of the shop. For any right-minded man, however,\nthis success is in no sense a recompense for the bitter relations which\nhe is forced to maintain with all of those around him. Life which is one\ncontinuous struggle with other men is hardly worth living. His workman\nfriends came to him continually and asked him, in a personal, friendly\nway, whether he would advise them, for their own best interest, to turn\nout more work. And, as a truthful man, he had to tell them that if he\nwere in their place he would fight against turning out any more work,\njust as they were doing, because under the piece-work system they would\nbe allowed to earn no more wages than they had been earning, and yet\nthey would be made to work harder.\n\nSoon after being made foreman, therefore, he decided to make a\ndetermined effort to in some way change the system of management, so\nthat the interests of the workmen and the management should become the\nsame, instead of antagonistic. This resulted, some three years later, in\nthe starting of the type of management which is described in papers\npresented to the American Society of Mechanical Engineers entitled \"A\nPiece-Rate System\" and \"Shop Management.\"\n\nIn preparation for this system the writer realized that the greatest\nobstacle to harmonious cooperation between the workmen and the\nmanagement lay in the ignorance of the management as to what really\nconstitutes a proper day's work for a workman. He fully realized that\nalthough he was foreman of the shop, the combined knowledge and skill of\nthe workmen who were under him was certainly ten times as great as his\nown. He therefore obtained the permission of Mr. William Sellers, who\nwas at that time the President of the Midvale Steel Company, to spend\nsome money in a careful, scientific study of the time required to do\nvarious kinds of work.\n\nMr. Sellers allowed this more as a reward for having, to a certain\nextent, \"made good\" as foreman of the shop in getting more work out of\nthe men, than for any other reason. He stated, however, that he did not\nbelieve that any scientific study of this sort would give results of\nmuch value.\n\nAmong several investigations which were undertaken at this time, one was\nan attempt to find some rule, or law, which would enable a foreman to\nknow in advance how much of any kind of heavy laboring work a man who\nwas well suited to his job ought to do in a day; that is, to study the\ntiring effect of heavy labor upon a first-class man. Our first step was\nto employ a young college graduate to look up all that had been written\non the subject in English, German, and French. Two classes of\nexperiments had been made: one by physiologists who were studying the\nendurance of the human animal, and the other by engineers who wished to\ndetermine what fraction of a horse-power a man-power was. These\nexperiments had been made largely upon men who were lifting loads by\nmeans of turning the crank of a winch from which weights were suspended,\nand others who were engaged in walking, running, and lifting weights in\nvarious ways. However, the records of these investigations were so\nmeager that no law of any value could be deduced from them. We therefore\nstarted a series of experiments of our own.\n\nTwo first-class laborers were selected, men who had proved themselves to\nbe physically powerful and who were also good steady workers. These men\nwere paid double wages during the experiments, and were told that they\nmust work to the best of their ability at all times, and that we should\nmake certain tests with them from time to time to find whether they were\n\"soldiering\" or not, and that the moment either one of them started to\ntry to deceive us he would be discharged. They worked to the best of\ntheir ability throughout the time that they were being observed.\n\nNow it must be clearly understood that in these experiments we were not\ntrying to find the maximum work that a man could do on a short spurt or\nfor a few days, but that our endeavor was to learn what really\nconstituted a full day's work for a first-class man; the best day's work\nthat a man could properly do, year in and year out, and still thrive\nunder. These men were given all kinds of tasks, which were carried out\neach day under the close observation of the young college man who was\nconducting the experiments, and who at the same time noted with a\nstop-watch the proper time for all of the motions that were made by the\nmen. Every element in any way connected with the work which we believed\ncould have a bearing on the result was carefully studied and recorded.\nWhat we hoped ultimately to determine was what fraction of a horse-power\na man was able to exert, that is, how many foot-pounds of work a man\ncould do in a day.\n\nAfter completing this series of experiments, therefore, each man's work\nfor each day was translated into foot-pounds of energy, and to our\nsurprise we found that there was no constant or uniform relation between\nthe foot-pounds of energy which the man exerted during a day and the\ntiring effect of his work. On some kinds of work the man would be tired\nout when doing perhaps not more than one-eighth of a horse-power, while\nin others he would be tired to no greater extent by doing half a\nhorse-power of work.\n\nWe failed, therefore, to find any law which was an accurate guide to the\nmaximum day's work for a first-class workman.\n\nA large amount of very valuable data had been obtained, which enabled us\nto know, for many kinds of labor, what was a proper day's work. It did\nnot seem wise, however, at this time to spend any more money in trying\nto find the exact law which we were after. Some years later, when more\nmoney was available for this purpose, a second series of experiments was\nmade, similar to the first, but some what more thorough.\n\nThis, however, resulted as the first experiments, in obtaining valuable\ninformation but not in the development of a law. Again, some years\nlater, a third series of experiments was made, and this time no trouble\nwas spared in our endeavor to make the work thorough. Every minute\nelement which could in anyway affect the problem was carefully noted and\nstudied, and two college men devoted about three months to the\nexperiments. After this data was again translated into foot-pounds of\nenergy exerted for each man each day, it became perfectly clear that\nthere is no direct relation between the horse-power which a man\nexerts (that is, his foot-pounds of energy per day) and the tiring effect\nof the work on the man. The writer, however, was quite as firmly\nconvinced as ever that some definite, clear-cut law existed as to what\nconstitutes a full day's work for a first-class laborer, and our data\nhad been so carefully collected and recorded that he felt sure that the\nnecessary information was included somewhere in the records. The problem\nof developing this law from the accumulated facts was therefore handed\nover to Mr. Carl G. Barth, who is a better mathematician than any of the\nrest of us, and we decided to investigate the problem in a new way, by\ngraphically representing each element of the work through plotting\ncurves, which should give us, as it were, a bird's-eye view of every\nelement. In a comparatively short time Mr. Barth had discovered the law\ngoverning the tiring effect of heavy labor on a first-class man. And it\nis so simple in its nature that it is truly remarkable that it should\nnot have been discovered and clearly understood years before. The law\nwhich was developed is as follows:\n\nThe law is confined to that class of work in which the limit of a man's\ncapacity is reached because he is tired out. It is the law of heavy\nlaboring, corresponding to the work of the cart horse, rather than that\nof the trotter. Practically all such work consists of a heavy pull or a\npush on the man's arms, that is, the man's strength is exerted by either\nlifting or pushing something which he grasps in his hands. And the law\nis that for each given pull or push on the man's arms it is possible for\nthe workman to be under load for only a definite percentage of the day.\nFor example, when pig iron is being handled (each pig weighing 92\npounds), a first-class workman can only be under load 43 per cent of the\nday. He must be entirely free from load during 57 per cent of the day.\nAnd as the load becomes lighter, the percentage of the day under which\nthe man can remain under load increases. So that, if the workman is\nhandling a half-pig, weighing 46 pounds, he can then be under load 58\nper cent of the day, and only has to rest during 42 per cent. As the\nweight grows lighter the man can remain under load during a larger and\nlarger percentage of the day, until finally a load is reached which he\ncan carry in his hands all day long without being tired out. When that\npoint has been arrived at this law ceases to be useful as a guide to a\nlaborer's endurance, and some other law must be found which indicates\nthe man's capacity for work.\n\nWhen a laborer is carrying a piece of pig iron weighing 92 pounds in his\nhands, it tires him about as much to stand still under the load as it\ndoes to walk with it, since his arm muscles are under the same severe\ntension whether he is moving or not. A man, however, who stands still\nunder a load is exerting no horse-power whatever, and this accounts for\nthe fact that no constant relation could be traced in various kinds of\nheavy laboring work between the foot-pounds of energy exerted and the\ntiring effect of the work on the man. It will also be clear that in all\nwork of this kind it is necessary for the arms of the workman to be\ncompletely free from load (that is, for the workman to rest) at frequent\nintervals. Throughout the time that the man is under a heavy load the\ntissues of his arm muscles are in process of degeneration, and frequent\nperiods of rest are required in order that the blood may have a chance\nto restore these tissues to their normal condition.\n\nTo return now to our pig-iron handlers at the Bethlehem Steel Company.\nIf Schmidt had been allowed to attack the pile of 47 tons of pig iron\nwithout the guidance or direction of a man who understood the art, or\nscience, of handling pig iron, in his desire to earn his high wages he\nwould probably have tired himself out by 11 or 12 o'clock in the day. He\nwould have kept so steadily at work that his muscles would not have had\nthe proper periods of rest absolutely needed for recuperation, and he\nwould have been completely exhausted early in the day. By having a man,\nhowever, who understood this law, stand over him and direct his work,\nday after day, until he acquired the habit of resting at proper\nintervals, he was able to work at an even gait all day long without\nunduly tiring himself.\n\nNow one of the very first requirements for a man who is fit to handle\npig iron as a regular occupation that he shall be so stupid and so\nphlegmatic that he more nearly resembles in his mental make-up the ox\nthan any other type. The man who is mentally alert and intelligent is\nfor this very reason entirely unsuited to what would, for him, be the\ngrinding monotony of work of this character. Therefore the workman who\nis best suited to handling pig iron is unable to understand the real\nscience of doing this class of work. He is so stupid that the word\n\"percentage\" has no meaning to him, and he must consequently be trained\nby a man more intelligent than himself into the habit of working in\naccordance with the laws of this science before he can be successful.\n\nThe writer trusts that it is now clear that even in the case of the most\nelementary form of labor that is known, there is a science, and that\nwhen the man best suited to this class of work has been carefully\nselected, when the science of doing the work has been developed, and\nwhen the carefully selected man has been trained to work in accordance\nwith this science, the results obtained must of necessity be\noverwhelmingly greater than those which are possible under the plan of\n\"initiative and incentive.\"\n\nLet us, however, again turn to the case of these pig-iron handlers, and\nsee whether, under the ordinary type of management, it would not have\nbeen possible to obtain practically the same results.\n\nThe writer has put the problem before many good managers, and asked them\nwhether, under premium work, piece work, or any of the ordinary plans of\nmanagement, they would be likely even to approximate 47 tons* per man per\nday, and not a man has suggested that an output of over 18 to 25 tons\ncould be attained by any of the ordinary expedients. It will be remembered\nthat the Bethlehem men were loading only 12 1/2 tons per man.\n\n[*Footnote: Many people have questioned the accuracy of the statement\nthat first-class workmen can load 47 1/2 tons of pig iron from the ground\non to a car in a day. For those who are skeptical, therefore, the following\ndata relating to this work are given:\n\nFirst. That our experiments indicated the existence of the following\nlaw: that a first-class laborer, suited to such work as handling pig\niron, could be under load only 42 per cent of the day and must be free\nfrom load 58 per cent of the day.\n\nSecond. That a man in loading pig iron from piles placed on the ground\nin an open field on to a car which stood on a track adjoining these\npiles, ought to handle (and that they did handle regularly) 47 1/2 long\ntons (2240 pounds per ton) per day.\n\nThat the price paid for loading this pig iron was 3.9 cents per ton, and\nthat the men working at it averaged $1.85 per day, whereas, in the past,\nthey had been paid only $1.15 per day.\n\nIn addition to these facts, the following are given:\n\n  47 1/2 long tons equal 106,400 pounds of pig iron per day.\n  At 92 pounds per pig, equals 1156 pigs per day.\n  42 per cent. of a day under load equals 600 minutes; multiplied by\n  0.42 equals 252 minutes under load.\n  252 minutes divided by 1156 pigs equals 0.22 minutes per pig under\n  load.\n\nA pig-iron handler walks on the level at the rate of one foot in 0.006\nminutes. The average distance of the piles of pig iron from the car was\n36 feet. It is a fact, however, that many of the pig-iron handlers ran\nwith their pig as soon as they reached the inclined plank. Many of them\nalso would run down the plank after loading the car. So that when the\nactual loading went on, many of them moved at a faster rate than is\nindicated by the above figures. Practically the men were made to take a\nrest, generally by sitting down, after loading ten to twenty pigs. This\nrest was in addition to the time which it took them to walk back from\nthe car to the pile. It is likely that many of those who are skeptical\nabout the possibility of loading this amount of pig iron do not realize\nthat while these men were walking back they were entirely free from\nload, and that therefore their muscles had, during that time, the\nopportunity for recuperation. It will be noted that with an average\ndistance of 36 feet of the pig iron from the car, these men walked about\neight miles under load each day and eight miles free from load.\n\nIf any one who is interested in these figures will multiply them and\ndivide them, one into the other, in various ways, he will find that all\nof the facts stated check up exactly.]\n\nTo go into the matter in more detail, however: As to the scientific\nselection of the men, it is a fact that in this gang of 75 pig-iron\nhandlers only about one man in eight was physically capable of handling\n47 1/2 tons per day. With the very best of intentions, the other seven\nout of eight men were physically unable to work at this pace. Now the\none man in eight who was able to do this work was in no sense superior\nto the other men who were working on the gang. He merely happened to be\na man of the type of the ox,--no rare specimen of humanity, difficult to\nfind and therefore very highly prized. On the contrary, he was a man so\nstupid that he was unfitted to do most kinds of laboring work, even. The\nselection of the man, then, does not involve finding some extraordinary\nindividual, but merely picking out from among very ordinary men the few\nwho are especially suited to this type of work. Although in this\nparticular gang only one man in eight was suited to doing the work, we\nhad not the slightest difficulty in getting all the men who were\nneeded--some of them from inside of the works and others from the\nneighboring country--who were exactly suited to the job.\n\nUnder the management of \"initiative and incentive\" the attitude of the\nmanagement is that of \"putting the work up to the workmen.\" What\nlikelihood would there be, then, under the old type of management, of\nthese men properly selecting themselves for pig-iron handling? Would\nthey be likely to get rid of seven men out of eight from their own gang\nand retain only the eighth man? No! And no expedient could be devised\nwhich would make these men properly select themselves. Even if they\nfully realized the necessity of doing so in order to obtain high wages\n(and they are not sufficiently intelligent properly to grasp this\nnecessity), the fact that their friends or their brothers who were\nworking right alongside of them would temporarily be thrown out of a job\nbecause they were not suited to this kind of work would entirely prevent\nthem from properly selecting themselves, that is, from removing the\nseven out of eight men on the gang who were unsuited to pig-iron\nhandling.\n\nAs to the possibility, under the old type of management, of inducing\nthese pig-iron handlers (after they had been properly selected) to work\nin accordance with the science of doing heavy laboring, namely, having\nproper scientifically determined periods of rest in close sequence to\nperiods of work. As has been indicated before, the essential idea of the\nordinary types of management is that each workman has become more\nskilled in his own trade than it is possible for any one in the\nmanagement to be, and that, therefore, the details of how the work shall\nbest be done must be left to him. The idea, then, of taking one man\nafter another and training him under a competent teacher into new\nworking habits until he continually and habitually works in accordance\nwith scientific laws, which have been developed by some one else, is\ndirectly antagonistic to the old idea that each workman can best\nregulate his own way of doing the work. And besides this, the man suited\nto handling pig iron is too stupid properly to train himself. Thus it\nwill be seen that with the ordinary types of management the development\nof scientific knowledge to replace rule of thumb, the scientific\nselection of the men, and inducing the men to work in accordance with\nthese scientific principles are entirely out of the question. And this\nbecause the philosophy of the old management puts the entire\nresponsibility upon the workmen, while the philosophy of the new places\na great part of it upon the management.\n\nWith most readers great sympathy will be aroused because seven out of\neight of these pig-iron handlers were thrown out of a job. This sympathy\nis entirely wasted, because almost all of them were immediately given\nother jobs with the Bethlehem Steel Company. And indeed it should be\nunderstood that the removal of these men from pig-iron handling, for\nwhich they were unfit, was really a kindness to themselves, because it\nwas the first step toward finding them work for which they were\npeculiarly fitted, and at which, after receiving proper training, they\ncould permanently and legitimately earn higher wages.\n\nAlthough the reader may be convinced that there is a certain science\nback of the handling of pig iron, still it is more than likely that he\nis still skeptical as to the existence of a science for doing other\nkinds of laboring. One of the important objects of this paper is to\nconvince its readers that every single act of every workman can be\nreduced to a science. With the hope of fully convincing the reader of\nthis fact, therefore, the writer proposes to give several more simple\nillustrations from among the thousands which are at hand.\n\nFor example, the average man would question whether there is much of any\nscience in the work of shoveling. Yet there is but little doubt, if any\nintelligent reader of this paper were deliberately to set out to find\nwhat may be called the foundation of the science of shoveling, that with\nperhaps 15 to 20 hours of thought and analysis he would be almost sure\nto have arrived at the essence of this science. On the other hand, so\ncompletely are the rule-of-thumb ideas still dominant that the writer\nhas never met a single shovel contractor to whom it had ever even\noccurred that there was such a thing as the science of shoveling. This\nscience is so elementary as to be almost self-evident.\n\nFor a first-class shoveler there is a given shovel load at which he will\ndo his biggest day's work. What is this shovel load? Will a first-class\nman do more work per day with a shovel load of 5 pounds, 10 pounds, 15\npounds, 20, 25, 30, or 40 pounds? Now this is a question which can be\nanswered only through carefully made experiments. By first selecting two\nor three first-class shovelers, and paying them extra wages for doing\ntrustworthy work, and then gradually varying the shovel load and having\nall the conditions accompanying the work carefully observed for several\nweeks by men who were used to experimenting, it was found that a\nfirst-class man would do his biggest day's work with a shovel load of\nabout 21 pounds. For instance, that this man would shovel a larger\ntonnage per day with a 21-pound load than with a 24-pound load or than\nwith an 18-pound load on his shovel. It is, of course, evident that no\nshoveler can always take a load of exactly 21 pounds on his shovel, but\nnevertheless, although his load may vary 3 or 4 pounds one way or the\nother, either below or above the 21 pounds, he will do his biggest day's\nwork when his average for the day is about 21 pounds.\n\nThe writer does not wish it to be understood that this is the whole of\nthe art or science of shoveling. There are many other elements, which\ntogether go to make up this science. But he wishes to indicate the\nimportant effect which this one piece of scientific knowledge has upon\nthe work of shoveling.\n\nAt the works of the Bethlehem Steel Company, for example, as a result of\nthis law, instead of allowing each shoveler to select and own his own\nshovel, it became necessary to provide some 8 to 10 different kinds of\nshovels, etc., each one appropriate to handling a given type of material\nnot only so as to enable the men to handle an average load of 21 pounds,\nbut also to adapt the shovel to several other requirements which become\nperfectly evident when this work is studied as a science. A large shovel\ntool room was built, in which were stored not only shovels but carefully\ndesigned and standardized labor implements of all kinds, such as picks,\ncrowbars, etc. This made it possible to issue to each workman a shovel\nwhich would hold a load of 21 pounds of whatever class of material they\nwere to handle: a small shovel for ore, say, or a large one for ashes.\nIron ore is one of the heavy materials which are handled in a works of\nthis kind, and rice coal, owing to the fact that it is so slippery on\nthe shovel, is one of the lightest materials. And it was found on\nstudying the rule-of-thumb plan at the Bethlehem Steel Company, where\neach shoveler owned his own shovel, that he would frequently go from\nshoveling ore, with a load of about 30 pounds per shovel, to handling\nrice coal, with a load on the same shovel of less than 4 pounds. In the\none case, he was so overloaded that it was impossible for him to do a\nfull day's work, and in the other case he was so ridiculously\nunderloaded that it was manifestly impossible to even approximate a\nday's work.\n\nBriefly to illustrate some of the other elements which go to make up\nthe science of shoveling, thousands of stop-watch observations were made\nto study just how quickly a laborer, provided in each case with the\nproper type of shovel, can push his shovel into the pile of materials\nand then draw it out properly loaded. These observations were made first\nwhen pushing the shovel into the body of the pile. Next when shoveling\non a dirt bottom, that is, at the outside edge of the pile, and next\nwith a wooden bottom, and finally with an iron bottom. Again a similar\naccurate time study was made of the time required to swing the shovel\nbackward and then throw the load for a given horizontal distance,\naccompanied by a given height. This time study was made for various\ncombinations of distance and height. With data of this sort before him,\ncoupled with the law of endurance described in the case of the pig-iron\nhandlers, it is evident that the man who is directing shovelers can\nfirst teach them the exact methods which should be employed to use their\nstrength to the very best advantage, and can then assign them daily\ntasks which are so just that the workman can each day be sure of earning\nthe large bonus which is paid whenever he successfully performs this\ntask.\n\nThere were about 600 shovelers and laborers of this general class in the\nyard of the Bethlehem Steel Company at this time. These men were\nscattered in their work over a yard which was, roughly, about two miles\nlong and half a mile wide. In order that each workman should be given\nhis proper implement and his proper instructions for doing each new job,\nit was necessary to establish a detailed system for directing men in\ntheir work, in place of the old plan of handling them in large groups,\nor gangs, under a few yard foremen. As each workman came into the works\nin the morning, he took out of his own special pigeonhole, with his\nnumber on the outside, two pieces of paper, one of which stated just\nwhat implements he was to get from the tool room and where he was to\nstart to work, and the second of which gave the history of his previous\nday's work; that is, a statement of the work which he had done, how much\nhe had earned the day before, etc. Many of these men were foreigners and\nunable to read and write, but they all knew at a glance the essence of\nthis report, because yellow paper showed the man that he had failed to\ndo his full task the day before, and informed him that he had not earned\nas much as $1.85 a day, and that none but high-priced men would be\nallowed to stay permanently with this gang. The hope was further\nexpressed that he would earn his full wages on the following day. So\nthat whenever the men received white slips they knew that everything was\nall right, and whenever they received yellow slips they realized that\nthey must do better or they would be shifted to some other class of\nwork.\n\nDealing with every workman as a separate individual in this way involved\nthe building of a labor office for the superintendent and clerks who\nwere in charge of this section of the work. In this office every\nlaborer's work was planned out well in advance, and the workmen were all\nmoved from place to place by the clerks with elaborate diagrams or maps\nof the yard before them, very much as chessmen are moved on a\nchess-board, a telephone and messenger system having been installed for\nthis purpose. In this way a large amount of the time lost through having\ntoo many men in one place and too few in another, and through waiting\nbetween jobs, was entirely eliminated. Under the old system the workmen\nwere kept day after day in comparatively large gangs, each under a\nsingle foreman, and the gang was apt to remain of pretty nearly the same\nsize whether there was much or little of the particular kind of work on\nhand which this foreman had under his charge, since each gang had to be\nkept large enough to handle whatever work in its special line was likely\nto come along.\n\nWhen one ceases to deal with men in large gangs or groups, and proceeds\nto study each workman as an individual, if the workman fails to do his\ntask, some competent teacher should be sent to show him exactly how his\nwork can best be done, to guide, help, and encourage him, and, at the\nsame time, to study his possibilities as a workman. So that, under the\nplan which individualizes each workman, instead of brutally discharging\nthe man or lowering his wages for failing to make good at once, he is\ngiven the time and the help required to make him proficient at his\npresent job, or he is shifted to another class of work for which he is\neither mentally or physically better suited.\n\nAll of this requires the kindly cooperation of the management, and\ninvolves a much more elaborate organization and system than the\nold-fashioned herding of men in large gangs. This organization\nconsisted, in this case, of one set of men, who were engaged in the\ndevelopment of the science of laboring through time study, such as has\nbeen described above; another set of men, mostly skilled laborers\nthemselves, who were teachers, and who helped and guided the men in\ntheir work; another set of tool-room men who provided them with the\nproper implements and kept them in perfect order, and another set of\nclerks who planned the work well in advance, moved the men with the\nleast loss of time from one place to another, and properly recorded each\nman's earnings, etc. And this furnishes an elementary illustration of\nwhat has been referred to as cooperation between the management and the\nworkmen.\n\nThe question which naturally presents itself is whether an elaborate\norganization of this sort can be made to pay for itself; whether such an\norganization is not top-heavy. This question will best be answered by a\nstatement of the results of the third year of working under this plan.\n\n\n                                   Old Plan           New Plan Task Work\n  The number of yard laborers\n  was reduced from between         400 & 600 down to about 140\n  Average number of tons per\n  man per day                      16                       59\n  Average earnings per man\n  per day                          $1.15                 $1.88\n  Average cost of handling a\n  ton of 2240 lbs                  $0.072               $0.033\n\nAnd in computing the low cost of $0.033 per ton, the office and\ntool-room expenses, and the wages of all labor superintendents, foremen,\nclerks, time-study men, etc., are included.\n\nDuring this year the total saving of the new plan over the old amounted\nto $36,417.69, and during the six months following, when all of the work\nof the yard was on task work, the saving was at the rate of between\n$75,000 and $80,000 per year.\n\nPerhaps the most important of all the results attained was the effect on\nthe workmen themselves. A careful inquiry into the condition of these\nmen developed the fact that out of the 140 workmen only two were said to\nbe drinking men. This does not, of course, imply that many of them did\nnot take an occasional drink. The fact is that a steady drinker would\nfind it almost impossible to keep up with the pace which was set, so\nthat they were practically all sober. Many, if not most of them, were\nsaving money, and they all lived better than they had before. These men\nconstituted the finest body of picked laborers that the writer has ever\nseen together, and they looked upon the men who were over them, their\nbosses and their teachers, as their very best friends; not as nigger\ndrivers, forcing them to work extra hard for ordinary wages, but as\nfriends who were teaching them and helping them to earn much higher\nwages than they had ever earned before.\n\nIt would have been absolutely impossible for any one to have stirred up\nstrife between these men and their employers. And this presents a very\nsimple though effective illustration of what is meant by the words\n\"prosperity for the employee, coupled with prosperity for the employer,\"\nthe two principal objects of management. It is evident also that this\nresult has been brought about by the application of the four fundamental\nprinciples of scientific management.\n\nAs another illustration of the value of a scientific study of the\nmotives which influence workmen in their daily work, the loss of\nambition and initiative will be cited, which takes place in workmen when\nthey are herded into gangs instead of being treated as separate\nindividuals. A careful analysis had demonstrated the fact that when\nworkmen are herded together in gangs, each man in the gang becomes far\nless efficient than when his personal ambition is stimulated; that when\nmen work in gangs, their individual efficiency falls almost invariably\ndown to or below the level of the worst man in the gang; and that they\nare all pulled down instead of being elevated by being herded together.\nFor this reason a general order had been issued in the Bethlehem Steel\nWorks that not more than four men were to be allowed to work in a labor\ngang without a special permit, signed by the General Superintendent of\nthe works, this special permit to extend for one week only. It was\narranged that as far as possible each laborer should be given a separate\nindividual task. As there were about 5000 men at work in the\nestablishment, the General Superintendent had so much to do that there\nwas but little time left for signing these special permits.\n\nAfter gang work had been by this means broken up, an unusually fine set\nof ore shovelers had been developed, through careful selection and\nindividual, scientific training. Each of these men was given a separate\ncar to unload each day, and his wages depended upon his own personal\nwork. The man who unloaded the largest amount of ore was paid the\nhighest wages, and an unusual opportunity came for demonstrating the\nimportance of individualizing each workman. Much of this ore came from\nthe Lake Superior region, and the same ore was delivered both in\nPittsburgh and in Bethlehem in exactly similar cars. There was a\nshortage of ore handlers in Pittsburgh, and hearing of the fine gang of\nlaborers that had been developed at Bethlehem, one of the Pittsburgh\nsteel works sent an agent to hire the Bethlehem men. The Pittsburgh men\noffered 4 9/10 cents a ton for unloading exactly the same ore, with the\nsame shovels, from the same cars, that were unloaded in Bethlehem for 3\n2/10 cents a ton. After carefully considering this situation, it was\ndecided that it would be unwise to pay more than 3 2/10 cents per ton\nfor unloading the Bethlehem cars, because, at this rate, the Bethlehem\nlaborers were earning a little over $1.85 per man per day, and this\nprice was 60 per cent more than the ruling rate of wages around\nBethlehem.\n\nA long series of experiments, coupled with close observation, had\ndemonstrated the fact that when workmen of this caliber are given a\ncarefully measured task, which calls for a big day's work on their part,\nand that when in return for this extra effort they are paid wages up to\n60 per cent beyond the wages usually paid, that this increase in wages\ntends to make them not only more thrifty but better men in every way;\nthat they live rather better, begin to save money, become more sober,\nand work more steadily. When, on the other hand, they receive much more\nthan a 60 per cent increase in wages, many of them will work irregularly\nand tend to become more or less shiftless, extravagant, and dissipated.\nOur experiments showed, in other words, that it does not do for most men\nto get rich too fast.\n\nAfter deciding, for this reason, not to raise the wages of our ore\nhandlers, these men were brought into the office one at a time, and\ntalked to somewhat as follows:\n\n\"Now, Patrick, you have proved to us that you are a high-priced man. You\nhave been earning every day a little more than $1.85, and you are just\nthe sort of man that we want to have in our ore-shoveling gang. A man\nhas come here from Pittsburgh, ho is offering 4 9/10 cents per ton for\nhandling ore while we can pay only 3 9/10 cents per ton. I think,\ntherefore, that you had better apply to this man for a job. Of course,\nyou know we are very sorry to have you leave us, but you have proved\nyourself a high-priced man, and we are very glad to see you get this\nchance of earning more money. Just remember, however, that at any time\nin the future, when you get out of a job, you can always come right back\nto us. There will always be a job for a high-priced man like you in our\ngang here.\"\n\nAlmost all of the ore handlers took this advice, and went to Pittsburgh,\nbut in about six weeks most of them were again back in Bethlehem\nunloading ore at the old rate of 3 2/10 cents a ton. The writer had the\nfollowing talk with one of these men after he had returned:\n\n\"Patrick, what are you doing back here? I thought we had gotten rid of\nyou.\"\n\n\"'Well, Sir, I'll tell you how it was. When we got out there Jimmy and I\nwere put on to a car with eight other men. We started to shovel the ore\nout just the same as we do here. After about half an hour I saw a little\ndevil alongside of me doing pretty near nothing, so I said to him, 'Why\ndon't you go to work? Unless we get the ore out of this car we won't get\nany money on pay-day.' He turned to me and said, 'Who in ------ are\nyou?'\n\n\"'Well,' I said, 'that's none of your business'; and the little devil\nstood up to me and said, 'You'll be minding your own business, or I'll\nthrow you off this car!' 'Well, I could have spit on him and drowned\nhim, but the rest of the men put down their shovels and looked as if\nthey were going to back him up; so I went round to Jimmy and said (so\nthat the whole gang could hear it), 'Now, Jimmy, you and I will throw a\nshovel full whenever this little devil throws one, and not another\nshovel full.' So we watched him, and only shoveled when he shoveled.\n\n\"When pay-day came around, though, we had less money than we got here at\nBethlehem. After that Jimmy and I went in to the boss, and asked him for\na car to ourselves, the same as we got at Bethlehem, but he told us to\nmind our own business. And when another pay-day came around we had less\nmoney than we got here at Bethlehem, so Jimmy and I got the gang\ntogether and brought them all back here to work again.\"\n\nWhen working each man for himself, these men were able to earn higher\nwages at 3 2/10 cents a ton than they could earn when they were paid 4\n9/10 cents a ton on gang work; and this again shows the great gain which\nresults from working according to even the most elementary of scientific\nprinciples. But it also shows that in the application of the most\nelementary principles it is necessary for the management to do their\nshare of the work in cooperating with the workmen. The Pittsburgh\nmanagers knew just how the results had been attained at Bethlehem, but\nthey were unwilling to go to the small trouble and expense required to\nplan ahead and assign a separate car to each shoveler, and then keep an\nindividual record of each man's work, and pay him just what he had\nearned.\n\nBricklaying is one of the oldest of our trades.\n\nFor hundreds of years there has been little or no improvement made in\nthe implements and materials used in this trade, nor in fact in the\nmethod of laying bricks. In spite of the millions of men who have\npracticed this trade, no great improvement has been evolved for many\ngenerations. Here, then, at least one would expect to find but little\ngain possible through scientific analysis and study. Mr. Frank B.\nGilbreth, a member of our Society, who had himself studied bricklaying\nin his youth, became interested in the principles of scientific\nmanagement, and decided to apply them to the art of bricklaying. He made\nan intensely interesting analysis and study of each movement of the\nbricklayer, and one after another eliminated all unnecessary movements\nand substituted fast for slow motions. He experimented with every minute\nelement which in any way affects the speed and the tiring of the\nbricklayer.\n\nHe developed the exact position which each of the feet of the bricklayer\nshould occupy with relation to the wall, the mortar box, and the pile of\nbricks, and so made it unnecessary for him to take a step or two toward\nthe pile of bricks and back again each time a brick is laid.\n\nHe studied the best height for the mortar box and brick pile, and then\ndesigned a scaffold, with a table on it, upon which all of the materials\nare placed, so as to keep the bricks, the mortar, the man, and the wall\nin their proper relative positions. These scaffolds are adjusted, as the\nwall grows in height, for all of the bricklayers by a laborer especially\ndetailed for this purpose, and by this means the bricklayer is saved the\nexertion of stooping down to the level of his feet for each brick and\neach trowel full of mortar and then straightening up again. Think of the\nwaste of effort that has gone on through all these years, with each\nbricklayer lowering his body, weighing, say, 150 pounds, down two feet\nand raising it up again every time a brick (weighing about 5 pounds) is\nlaid in the wall! And this each bricklayer did about one thousand times\na day.\n\nAs a result of further study, after the bricks are unloaded from the\ncars, and before bringing them to the bricklayer, they are carefully\nsorted by a laborer, and placed with their best edge up on a simple\nwooden frame, constructed so as to enable him to take hold of each brick\nin the quickest time and in the most advantageous position. In this way\nthe bricklayer avoids either having to turn the brick over or end for\nend to examine it before laying it, and he saves, also, the time taken\nin deciding which is the best edge and end to place on the outside of\nthe wall. In most cases, also, he saves the time taken in disentangling\nthe brick from a disorderly pile on the scaffold. This \"pack\" of bricks\n(as Mr. Gilbreth calls his loaded wooden frames) is placed by the helper\nin its proper position on the adjustable scaffold close to the mortar\nbox.\n\nWe have all been used to seeing bricklayers tap each brick after it is\nplaced on its bed of mortar several times with the end of the handle of\nthe trowel so as to secure the right thickness for the joint. Mr.\nGilbreth found that by tempering the mortar just right, the bricks could\nbe readily bedded to the proper depth by a downward pressure of the hand\nwith which they are laid. He insisted that his mortar mixers should give\nspecial attention to tempering the mortar, and so save the time consumed\nin tapping the brick.\n\nThrough all of this minute study of the motions to be made by the\nbricklayer in laying bricks under standard conditions, Mr. Gilbreth has\nreduced his movements from eighteen motions per brick to five, and even\nin one case to as low as two motions per brick. He has given all of the\ndetails of this analysis to the profession in the chapter headed \"Motion\nStudy,\" of his book entitled \"Bricklaying System,\" published by Myron C.\nClerk Publishing Company, New York and Chicago; E. F. N. Spon, of\nLondon.\n\nAn analysis of the expedients used by Mr. Gilbreth in reducing the\nmotions of his bricklayers from eighteen to five shows that this\nimprovement has been made in three different ways:\n\nFirst. He has entirely dispensed with certain movements which the\nbricklayers in the past believed were necessary, but which a careful\nstudy and trial on his part have shown to be useless.\n\nSecond. He has introduced simple apparatus, such as his adjustable\nscaffold and his packets for holding the bricks, by means of which, with\na very small amount of cooperation from a cheap laborer, he entirely\neliminates a lot of tiresome and time-consuming motions which are\nnecessary for the brick-layer who lacks the scaffold and the packet.\n\nThird. He teaches his bricklayers to make simple motions with both\nhands at the same time, where before they completed a motion with the\nright hand and followed it later with one from the left hand.\n\nFor example, Mr. Gilbreth teaches his brick-layer to pick up a brick in\nthe left hand at the same instant that he takes a trowel full of mortar\nwith the right hand. This work with two hands at the same time is, of\ncourse, made possible by substituting a deep mortar box for the old\nmortar board (on which the mortar spread out so thin that a step or two\nhad to be taken to reach it) and then placing the mortar box and the\nbrick pile close together, and at the proper height on his new scaffold.\n\nThese three kinds of improvements are typical of the ways in which\nneedless motions can be entirely eliminated and quicker types of\nmovements substituted for slow movements when scientific motion study,\nas Mr. Gilbreth calls his analysis, time study, as the writer has called\nsimilar work, are, applied in any trade.\n\nMost practical men would (knowing the opposition of almost all tradesmen\nto making any change in their methods and habits), however, be skeptical\nas to the possibility of actually achieving any large results from a\nstudy of this sort. Mr. Gilbreth reports that a few months ago, in a\nlarge brick building which he erected, he demonstrated on a commercial\nscale the great gain which is possible from practically applying his\nscientific study. With union bricklayers, in laying a factory wall,\ntwelve inches thick, with two kinds of brick, faced and ruled joints on\nboth sides of the wall, he averaged, after his selected workmen had\nbecome skilful in his new methods, 350 bricks per man per hour; whereas\nthe average speed of doing this work with the old methods was, in that\nsection of the country, 120 bricks per man per hour. His bricklayers\nwere taught his new method of bricklaying by their foreman. Those who\nfailed to profit by their teaching were dropped, and each man, as he\nbecame proficient under the new method, received a substantial (not a\nsmall) increase in his wages. With a view to individualizing his workmen\nand stimulating each man to do his best, Mr. Gilbreth also developed an\ningenious method for measuring and recording the number of bricks laid\nby each man, and for telling each workman at frequent intervals how many\nbricks he had succeeded in laying.\n\nIt is only when this work is compared with the conditions which prevail\nunder the tyranny of some of our misguided bricklayers' unions that the\ngreat waste of human effort which is going on will be realized. In one\nforeign city the bricklayers' union have restricted their men to 275\nbricks per day on work of this character when working for the city, and\n375 per day when working for private owners. The members of this union\nare probably sincere in their belief that this restriction of output is\na benefit to their trade. It should be plain to all men, however, that\nthis deliberate loafing is almost criminal, in that it inevitably\nresults in making every workman's family pay higher rent for their\nhousing, and also in the end drives work and trade away from their city,\ninstead of bringing it to it.\n\nWhy is it, in a trade which has been continually practiced since before\nthe Christian era, and with implements practically the same as they now\nare, that this simplification of the bricklayer's movements, this great\ngain, has not been made before?\n\nIt is highly likely that many times during all of these years individual\nbricklayers have recognized the possibility of eliminating each of these\nunnecessary motions. But even if, in the past, he did invent each one of\nMr. Gilbreth's improvements, no bricklayer could alone increase his\nspeed through their adoption because it will be remembered that in all\ncases several bricklayers work together in a row and that the walls all\naround a building must grow at the same rate of speed. No one\nbricklayer, then, can work much faster than the one next to him. Nor has\nany one workman the authority to make other men cooperate with him to do\nfaster work. It is only through enforced standardization of methods,\nenforced adoption of the best implements and working conditions, and\nenforced cooperation that this faster work can be assured. And the duty\nof enforcing the adoption of standards and of enforcing-this cooperation\nrests with the management alone. The management must supply continually\none or more teachers to show each new man the new and simpler motions,\nand the slower men must be constantly watched and helped until they have\nrisen to their proper speed. All of those who, after proper teaching,\neither will not or cannot work in accordance with the new methods and at\nthe higher speed must be discharged by the management. The management\nmust also recognize the broad fact that workmen will not submit to this\nmore rigid standardization and will not work extra hard, unless they\nreceive extra pay for doing it.\n\nAll of this involves an individual study of and treatment for each man,\nwhile in the past they have been handled in large groups.\n\nThe management must also see that those who prepare the bricks and the\nmortar and adjust the scaffold, etc., for the bricklayers, cooperate\nwith them by doing their work just right and always on time; and they\nmust also inform each bricklayer at frequent intervals as to the\nprogress he is making, so that he may not unintentionally fall off in\nhis pace. Thus it will be seen that it is the assumption by the\nmanagement of new duties and new kinds of work never done by employers\nin the past that makes this great improvement possible, and that,\nwithout this new help from the management, the workman even with full\nknowledge of the new methods and with the best of intentions could not\nattain these startling results.\n\nMr. Gilbreth's method of bricklaying furnishes a simple illustration of\ntrue and effective cooperation. Not the type of cooperation in which a\nmass of workmen on one side together cooperate with the management; but\nthat in which several men in the management (each one in his own\nparticular way) help each workman individually, on the one hand, by\nstudying his needs and his shortcomings and teaching him better and\nquicker methods, and, on the other hand, by seeing that all other\nworkmen with whom he comes in contact help and cooperate with him by\ndoing their part of the work right and fast.\n\nThe writer has gone thus fully into Mr. Gilbreth's method in order that\nit may be perfectly clear that this increase in output and that this\nharmony could not have been attained under the management of \"initiative\nand incentive\" (that is, by putting the problem up to the workman and\nleaving him to solve it alone) which has been the philosophy of the\npast. And that his success has been due to the use of the four elements\nwhich constitute the essence of scientific management.\n\nFirst. The development (by the management, not the workman) of the\nscience of bricklaying, with rigid rules for each motion of every man,\nand the perfection and standardization of all implements and working\nconditions.\n\nSecond. The careful selection and subsequent training of the bricklayers\ninto first-class men, and the elimination of all men who refuse to or\nare unable to adopt the best methods.\n\nThird. Bringing the first-class bricklayer and the science of\nbricklaying together, through the constant help and watchfulness of the\nmanagement, and through paying each man a large daily bonus for working\nfast and doing what he is told to do.\n\nFourth. An almost equal division of the work and responsibility between\nthe workman and the management. All day long the management work almost\nside by side with the men, helping, encouraging, and smoothing the way\nfor them, while in the past they stood one side, gave the men but little\nhelp, and threw on to them almost the entire responsibility as to\nmethods, implements, speed, and harmonious cooperation.\n\nOf these four elements, the first (the development of the science of\nbricklaying) is the most interesting and spectacular. Each of the three\nothers is, however, quite as necessary for success.\n\nIt must not be forgotten that back of all this, and directing it, there\nmust be the optimistic, determined, and hard-working leader who can wait\npatiently as well as work.\n\nIn most cases (particularly when the work to be done is intricate in its\nnature) the \"development of the science\" is the most important of the\nfour great elements of the new management. There are instances, however,\nin which the \"scientific selection of the workman\" counts for more than\nanything else.\n\nA case of this type is well illustrated in the very simple though\nunusual work of inspecting bicycle balls.\n\nWhen the bicycle craze was at its height some years ago several million\nsmall balls made of hardened steel were used annually in bicycle\nbearings. And among the twenty or more operations used in making steel\nballs, perhaps the most important was that of inspecting them after\nfinal polishing so as to remove all fire-cracked or otherwise imperfect\nballs before boxing.\n\nThe writer was given the task of systematizing the largest bicycle ball\nfactory in this country. This company had been running for from eight to\nten years on ordinary day work before he undertook its reorganization,\nso that the one hundred and twenty or more girls who were inspecting the\nballs were \"old bands\" and skilled at their jobs.\n\nIt is impossible even in the most elementary work to change rapidly from\nthe old independence of individual day work to scientific cooperation.\n\nIn most cases, however, there exist certain imperfections in working\nconditions which can at once be improved with benefit to all concerned.\n\nIn this instance it was found that the inspectors (girls) were working\nten and one-half hours per day (with a Saturday half holiday.)\n\nTheir work consisted briefly in placing a row of small polished steel\nballs on the back of the left hand, in the crease between two of the\nfingers pressed together, and while they were rolled over and over, they\nwere minutely examined in a strong light, and with the aid of a magnet\nheld in the right hand, the defective balls were picked out and thrown\ninto especial boxes. Four kinds of defects were looked for-dented, soft,\nscratched, and fire-cracked--and they were mostly so minute as to be\ninvisible to an eye not especially trained to this work. It required the\nclosest attention and concentration, so that the nervous tension of the\ninspectors was considerable, in spite of the fact that they were\ncomfortably seated and were not physically tired.\n\nA most casual study made it evident that a very considerable part of the\nten and one-half hours during which the girls were supposed to work was\nreally spent in idleness because the working period was too long. It is\na matter of ordinary common sense to plan working hours so that the\nworkers can really \"work while they work\" and \"play while they play,\"\nand not mix the two.\n\nBefore the arrival of Mr. Sanford E. Thompson, who undertook a\nscientific study of the whole process, we decided, therefore, to shorten\nthe working hours.\n\nThe old foreman who had been over the inspecting room for years was\ninstructed to interview one after another of the better inspectors and\nthe more influential girls and persuade them that they could do just as\nmuch work in ten hours each day as they had been doing in ten and\none-half hours. Each girl was told that the proposition was to shorten\nthe day's work to ten hours and pay them the same day's pay they were\nreceiving for the ten and one-half hours.\n\nIn about two weeks the foreman reported that all of the girls he had\ntalked to agreed that they could do their present work just as well in\nten hours as in ten and one-half and that they approved of the change.\n\nThe writer had not been especially noted for his tact so he decided that\nit would be wise for him to display a little more of this quality by\nhaving the girls vote on the new proposition. This decision was hardly\njustified, however, for when the vote was taken the girls were unanimous\nthat 10 1/2 hours was good enough for them and they wanted no innovation\nof any kind.\n\nThis settled the matter for the time being. A few months later tact was\nthrown to the winds and the working hours were arbitrarily shortened in\nsuccessive steps to 10 hours, 9 1/2, 9, and 8 1/2 (the pay per day\nremaining the same); and with each shortening of the working day the\noutput increased instead of diminishing.\n\nThe change from the old to the scientific method in this department was\nmade under the direction of Mr. Sanford E. Thompson, perhaps the most\nexperienced man in motion and time study in this country, under the\ngeneral superintendence of Mr. H. L. Gantt.\n\nIn the Physiological departments of our universities experiments are\nregularly conducted to determine what is known as the \"personal\ncoefficient\" of the man tested. This is done by suddenly bringing some\nobject, the letter A or B for instance, within the range of vision of\nthe subject, who, the instant he recognizes the letter has to do some\ndefinite thing, such as to press a particular electric button. The time\nwhich elapses from the instant the letter comes in view until the\nsubject presses the button is accurately recorded by a delicate\nscientific instrument.\n\nThis test shows conclusively that there is a great difference in the\n\"personal coefficient\" of different men. Some individuals are born with\nunusually quick powers of perception accompanied by quick responsive\naction. With some the message is almost instantly transmitted from the\neye to the brain, and the brain equally quickly responds by sending the\nproper message to the hand.\n\nMen of this type are said to have a low \"personal coefficient,\" while\nthose of slow perception and slow action have a high \"personal\ncoefficient.\"\n\nMr. Thompson soon recognized that the quality most needed for bicycle\nball inspectors was a low personal coefficient. Of course the ordinary\nqualities of endurance and industry were also called for.\n\nFor the ultimate good of the girls as well as the company, however, it\nbecame necessary to exclude, all girls who lacked a low \"personal\ncoefficient.\" And unfortunately this involved laying off many of the\nmost intelligent, hardest working, and most trustworthy girls merely\nbecause they did not possess the quality of quick perception followed by\nquick action.\n\nWhile the gradual selection of girls was going on other changes were\nalso being made.\n\nOne of the dangers to be guarded against, when the pay of the man or\nwoman is made in any way to depend on the quantity of the work done, is\nthat in the effort to increase the quantity the quality is apt to\ndeteriorate.\n\nIt is necessary in almost all cases, therefore, to take definite steps\nto insure against any falling off in quality before moving in any way\ntowards an increase in quantity.\n\nIn the work of these particular girls quality was the very essence. They\nwere engaged in picking out all defective balls.\n\nThe first step, therefore, was to make it impossible for them to slight\ntheir work without being, found out. This was accomplished through what\nis known as over-inspection. Each one of four of the most trust-worthy\ngirls was given each day a lot of balls to inspect which had been\nexamined the day before by one of the regular inspectors; the number\nidentifying the lot to be over-inspected having been changed by the\nforeman so that none of the over-inspectors knew whose work they were\nexamining. In addition to this one of the lots inspected by the four\nover-inspectors was examined on the following day by the chief\ninspector, selected on account of her especial accuracy and integrity.\n\nAn effective expedient was adopted for checking the honesty and accuracy\nof the over-inspection. Every two or three days a lot of balls was\nespecially prepared by the foreman, who counted out a definite number of\nperfect balls, and added a recorded number of defective balls of each\nkind. Neither the inspectors nor the over-inspectors had any means of\ndistinguishing this prepared lot from the regular commercial lots. And\nin this way all temptation to slight their work or make false returns\nwas removed.\n\nAfter insuring in this way against deterioration in quality, effective\nmeans were at once adopted to increase the output. Improved day work was\nsubstituted for the old slipshod method. An accurate daily record was\nkept both as to the quantity and quality of the work done in order to\nguard against any personal prejudice on the part of the foreman and to\ninsure absolute impartiality and justice for each inspector. In a\ncomparatively short time this record enabled the foreman to stir the\nambition of all the inspectors by increasing the wages of those who\nturned out a large quantity and good quality, while at the same time\nlowering the pay of those who did indifferent work and discharging\nothers who proved to be incorrigibly slow or careless. A careful\nexamination was then made of the way in which each girl spent her time\nand an accurate time study was undertaken, through the use of a\nstop-watch and record blanks, to determine how fast each kind of\ninspection should be done, and to establish the exact conditions under\nwhich each girl could do her quickest and best work, while at the same\ntime guarding against giving her a task so severe that there was danger\nfrom over fatigue or exhaustion. This investigation showed that the\ngirls spent a considerable part of their time either in partial\nidleness, talking and half working, or in actually doing nothing.\n\nEven when the hours of labor had been shortened from 10 1/2 to 8 1/2\nhours a close observation of the girls showed that after about an hour\nand one-half of consecutive work they began to get nervous. They\nevidently needed a rest. It is wise to stop short of the point at which\noverstrain begins, so we arranged for them to have a ten minutes period\nfor recreation at the end of each hour and one quarter. During these\nrecess periods (two of ten minutes each in the morning and two in the\nafternoon) they were obliged to stop work and were encouraged to leave\ntheir seats and get a complete change of occupation by walking around\nand talking, etc.\n\nIn one respect no doubt some people will say that these girls were\nbrutally treated. They were seated so far apart that they could not\nconveniently talk while at work.\n\nShortening their hours of labor, however, and providing so far as we\nknew the most favorable working conditions made it possible for them to\nreally work steadily instead of pretending to do so.\n\nAnd it is only after this stage in the reorganization is reached, when\nthe girls have been properly selected and on the one hand such\nprecautions have been taken as to guard against the possibility of\nover-driving them, while, on the other hand, the temptation to slight\ntheir work has been removed and the most favorable working conditions\nhave been established, that the final step should be taken which insures\nthem what they most want, namely, high wages, and the employers what\nthey most want, namely, the maximum output and best quality of work,\n-which means a low labor cost.\n\nThis step is to give each girl each day a carefully measured task which\ndemands a full day's work from a competent operative, and also to give\nher a large premium or bonus whenever she accomplishes this task.\n\nThis was done in this case through establishing what is known as\ndifferential rate piece work.*\n\n[*Footnote: See paper read before the American Society of Mechanical\nEngineers, by Fred. W. Taylor, Vol. XVI, p. 856, entitled \"Piece Rate\nSystem.\"]\n\nUnder this system the pay of each girl was increased in proportion to\nthe quantity of her output and also still more in proportion to the\naccuracy of her work.\n\nAs will be shown later, the differential rate (the lots inspected by the\nover-inspectors forming the basis for the differential) resulted in a\nlarge gain in the quantity of work done and at the same time in a marked\nimprovement in the quality.\n\nBefore they finally worked to the best advantage it was found to be\nnecessary to measure the output of each girl as often as once every\nhour, and to send a teacher to each individual who was found to be\nfalling behind to find what was wrong, to straighten her out, and to\nencourage and help her to catch up.\n\nThere is a general principle back of this which should be appreciated by\nall of those who are especially interested in the management of men.\n\nA reward, if it is to be effective in stimulating men to do their best\nwork, must come soon after the work has been done. But few men are able\nto look forward for more than a week or perhaps at most a month, and\nwork hard for a reward which they are to receive at the end of this\ntime.\n\nThe average workman must be able to measure what he has accomplished and\nclearly see his reward at the end of each day if he is to do his best.\nAnd more elementary characters, such as the young girls inspecting\nbicycle balls, or children, for instance, should have proper\nencouragement either in the shape of personal attention from those over\nthem or an actual reward in sight as often as once an hour.\n\nThis is one of the principal reasons why cooperation or \"profit-sharing\"\neither through selling stock to the employees or through dividends on\nwages received at the end of the year, etc., have been at the best only\nmildly effective in stimulating men to work hard. The nice time which\nthey are sure to have to-day if they take things easily and go slowly\nproves more attractive than steady hard work with a possible reward to\nbe shared with others six months later. A second reason for the\ninefficiency of profit-sharing schemes had been that no form of\ncooperation has yet been devised in which each individual is allowed\nfree scope for his personal ambition. Personal ambition always has been\nand will remain a more powerful incentive to exertion than a desire for\nthe general welfare. The few misplaced drones, who do the loafing and\nshare equally in the profits, with the rest, under cooperation are sure\nto drag the better men down toward their level.\n\nOther and formidable difficulties in the path of cooperative schemes\nare, the equitable division of the profits, and the fact that, while\nworkmen are always ready to share the profits, they are neither able nor\nwilling to share the losses. Further than this, in many cases, it is\nneither right nor just that they should share either the profits or the\nlosses, since these may be due in great part to causes entirely beyond\ntheir influence or control, and to which they do not contribute.\n\nTo come back to the girls inspecting bicycle balls, however, the final\noutcome of all the changes was that thirty-five girls did the work\nformerly done by one hundred and twenty. And that the accuracy of the\nwork at the higher speed was two-thirds greater than at the former slow\nspeed.\n\nThe good that came to the girls was,\n\nFirst. That they averaged from 80 to 100 per cent higher wages than they\nformerly received.\n\nSecond. Their hours of labor were shortened from 10 1/2 to 8 1/2 per day,\nwith a Saturday half holiday. And they were given four recreation\nperiods properly distributed through the day, which made overworking\nimpossible for a healthy girl.\n\nThird. Each girl was made to feel that she was the object of especial\ncare and interest on the part of the management, and that if anything\nwent wrong with her she could always have a helper and teacher in the\nmanagement to lean upon.\n\nFourth. All young women should be given two consecutive days of rest\n(with pay) each month, to be taken whenever they may choose. It is my\nimpression that these girls were given this privilege, although I am not\nquite certain on this point.\n\nThe benefits which came to the company from these changes were:\n\nFirst. A substantial improvement in the quality of the product.\n\nSecond. A material reduction in the cost of inspection, in spite of the\nextra expense involved in clerk work, teachers, time study,\nover-inspectors, and in paying higher wages.\n\nThird. That the most friendly relations existed between the management\nand the employees, which rendered labor troubles of any kind or a strike\nimpossible.\n\nThese good results were brought about by many changes which substituted\nfavorable for unfavorable working conditions. It should be appreciated,\nhowever, that the one element which did more than all of the others was,\nthe careful selection of girls with quick perception to replace those\nwhose perceptions were slow--(the substitution of girls with a low\npersonal coefficient for those whose personal coefficient was high)--the\nscientific selection of the workers.\n\nThe illustrations have thus far been purposely confined to the more\nelementary types of work, so that a very strong doubt must still remain\nas to whether this kind of cooperation is desirable in the case of more\nintelligent mechanics, that is, in the case of men who are more capable\nof generalization, and who would therefore be more likely, of their own\nvolition, to choose the more scientific and better methods. The\nfollowing illustrations will be given for the purpose of demonstrating\nthe fact that in the higher classes of work the scientific laws which\nare developed are so intricate that the high-priced mechanic needs (even\nmore than the cheap laborer) the cooperation of men better educated than\nhimself in finding the laws, and then in selecting, developing, and\ntraining him to work in accordance with these laws. These illustrations\nshould make perfectly clear our original proposition that in practically\nall of the mechanic arts the science which underlies each workman's act\nis so great and amounts to so much that the workman who is best suited\nto actually doing the work is incapable, either through lack of\neducation or through insufficient mental capacity, of understanding this\nscience.\n\nA doubt, for instance, will remain in the minds perhaps of most readers\n(in the case of an establishment which manufactures the same machine,\nyear in and year out, in large quantities, and in which, therefore, each\nmechanic repeats the same limited series of operations over and over\nagain), whether the ingenuity of each workman and the help which he from\ntime to time receives from his foreman will not develop such superior\nmethods and such a personal dexterity that no scientific study which\ncould be made would result in a material increase in efficiency.\n\nA number of years ago a company employing about three hundred men, which\nhad been manufacturing the same machine for ten to fifteen years, sent\nfor us to report as to whether any gain could be made through the\nintroduction of scientific management. Their shops had been run for many\nyears under a good superintendent and with excellent foremen and\nworkmen, on piece work. The whole establishment was, without doubt, in\nbetter physical condition than the average machine-shop in this country.\nThe superintendent was distinctly displeased when told that through the\nadoption of task management the output, with the same number of men and\nmachines, could be more than doubled. He said that he believed that any\nsuch statement was mere boasting, absolutely false, and instead of\ninspiring him with confidence, he was disgusted that any one should make\nsuch an impudent claim. He, however, readily assented to the proposition\nthat he should select any one of the machines whose output he considered\nas representing the average of the shop, and that we should then\ndemonstrate on this machine that through scientific methods its output\ncould be more than doubled.\n\nThe machine selected by him fairly represented the work of the shop. It\nhad been run for ten or twelve years past by a first-class mechanic who\nwas more than equal in his ability to the average workmen in the\nestablishment. In a shop of this sort in which similar machines are\nmade over and over again, the work is necessarily greatly subdivided, so\nthat no one man works upon more than a comparatively small number of\nparts during the year. A careful record was therefore made, in the\npresence of both parties, of the time actually taken in finishing each\nof the parts which this man worked upon. The total time required by him\nto finish each piece, as well as the exact speeds and feeds which he\ntook, were noted and a record was kept of the time which he took in\nsetting the work in the machine and removing it. After obtaining in this\nway a statement of what represented a fair average of the work done in\nthe shop, we applied to this one machine the principles of scientific\nmanagement.\n\nBy means of four quite elaborate slide-rules, which have been especially\nmade for the purpose of determining the all-round capacity of\nmetal-cutting machines, a careful analysis was made of every element of\nthis machine in its relation to the work in hand. Its Pulling power at\nits various speeds, its feeding capacity, and its proper speeds were\ndetermined by means of the slide-rules, and changes were then made in\nthe countershaft and driving pulleys so as to run it at its proper\nspeed. Tools, made of high-speed steel, and of the proper shapes, were\nproperly dressed, treated, and ground. (It should be understood,\nhowever, that in this case the high-speed steel which had heretofore\nbeen in general use in the shop was also used in our demonstration.) A\nlarge special slide-rule was then made, by means of which the exact\nspeeds and feeds were indicated at which each kind of work could be done\nin the shortest possible time in this particular lathe. After preparing\nin this way so that the workman should work according to the new method,\none after another, pieces of work were finished in the lathe,\ncorresponding to the work which had been done in our preliminary trials,\nand the gain in time made through running the machine according to\nscientific principles ranged from two and one-half times the speed in\nthe slowest instance to nine times the speed in the highest.\n\nThe change from rule-of-thumb management to scientific management\ninvolves, however, not only a study of what is the proper speed for\ndoing the work and a remodeling of the tools and the implements in the\nshop, but also a complete change in the mental attitude of all the men\nin the shop toward their work and toward their employers. The physical\nimprovements in the machines necessary to insure large gains, and the\nmotion, study followed by minute study with a stop-watch of the time in\nwhich each workman should do his work, can be made comparatively\nquickly. But the change in the mental attitude and in the habits of the\nthree hundred or more workmen can be brought about only slowly and\nthrough a long series of object-lessons, which finally demonstrates to\neach man the great advantage which he will gain by heartily cooperating\nin his every-day work with the men in the management. Within three\nyears, however, in this shop, the output had been more than doubled per\nman and per machine. The men had been carefully selected and in almost\nall cases promoted from a lower to a higher order of work, and so\ninstructed by their teachers (the functional foremen) that they were\nable to earn higher wages than ever before. The average increase in the\ndaily earnings of each man was about 35 per cent., while, at the same\ntime, the sum total of the wages paid for doing a given amount of work\nwas lower than before. This increase in the speed of doing the work, of\ncourse, involved a substitution of the quickest hand methods for the old\nindependent rule-of-thumb methods, and an elaborate analysis of the hand\nwork done by each man. (By hand work is meant such work as depends upon\nthe manual dexterity and speed of a workman, and which is independent of\nthe work done by the machine.) The time saved by scientific hand work\nwas in many cases greater even than that saved in machine-work.\n\nIt seems important to fully explain the reason why, with the aid of a\nslide-rule, and after having studied the art of cutting metals, it was\npossible for the scientifically equipped man, who had never before seen\nthese particular jobs, and who had never worked on this machine, to do\nwork from two and one-half to nine times as fast as it had been done\nbefore by a good mechanic who had spent his whole time for some ten to\ntwelve years in doing this very work upon this particular machine. In a\nword, this was possible because the art of cutting metals involves a\ntrue science of no small magnitude, a science, in fact, so intricate\nthat it is impossible for any machinist who is suited to running a lathe\nyear in and year out either to understand it or to work according to its\nlaws without the help of men who have made this their specialty. Men who\nare un-familiar with machine-shop work are prone to look upon the\nmanufacture of each piece as a special problem, independent of any other\nkind of machine-work. They are apt to think, for instance, that the\nproblems connected with making the parts of an engine require the\nespecial study, one may say almost the life study, of a set of\nengine-making mechanics, and that these problems are entirely different\nfrom those which would be met with in machining lathe or planer parts.\nIn fact, however, a study of those elements which are peculiar either to\nengine parts or to lathe parts is trifling, compared with the great\nstudy of the art, or science, of cutting metals, upon a knowledge of\nwhich rests the ability to do really fast machine-work of all kinds.\n\nThe real problem is how to remove chips fast from a casting or a\nforging, and how to make the piece smooth and true in the shortest time,\nand it matters but little whether the piece being worked upon is part,\nsay, of a marine engine, a printing-press, or an automobile. For this\nreason, the man with the slide rule, familiar with the science of\ncutting metals, who had never before seen this particular work, was able\ncompletely to distance the skilled mechanic who had made the parts of\nthis machine his specialty for years.\n\nIt is true that whenever intelligent and educated men find that the\nresponsibility for making progress in any of the mechanic arts rests\nwith them, instead of upon the workmen who are actually laboring at the\ntrade, that they almost invariably start on the road which leads to the\ndevelopment of a science where, in the past, has existed mere\ntraditional or rule-of-thumb knowledge. When men, whose education has\ngiven them the habit of generalizing and everywhere looking for laws,\nfind themselves confronted with a multitude of problems, such as exist\nin every trade and which have a general similarity one to another, it is\ninevitable that they should try to gather these problems into certain\nlogical groups, and then search for some general laws or rules to guide\nthem in their solution. As has been pointed out, however, the underlying\nprinciples of the management of \"initiative and incentive,\" that is, the\nunderlying philosophy of this management, necessarily leaves the\nsolution of all of these problems in the hands of each individual\nworkman, while the philosophy of scientific management places their\nsolution in the hands of the management. The workman's whole time is\neach day taken in actually doing the work with his hands, so that, even\nif he had the necessary education and habits of generalizing in his\nthought, he lacks the time and the opportunity for developing these\nlaws, because the study of even a simple law involving say time study\nrequires the cooperation of two men, the one doing the work while the\nother times him with a stop-watch. And even if the workman were to\ndevelop laws where before existed only rule-of-thumb knowledge, his\npersonal interest would lead him almost inevitably to keep his\ndiscoveries secret, so that he could, by means of this special\nknowledge, personally do more work than other men and so obtain higher\nwages.\n\nUnder scientific management, on the other hand, it becomes the duty and\nalso the pleasure of those who are engaged in the management not only to\ndevelop laws to replace rule of thumb, but also to teach impartially all\nof the workmen who are under them the quickest ways of working. The\nuseful results obtained from these laws are always so great that any\ncompany can well afford to pay for the time and the experiments needed\nto develop them. Thus under scientific management exact scientific\nknowledge and methods are everywhere, sooner or later, sure to replace\nrule of thumb, whereas under the old type of management working in\naccordance with scientific laws is an impossibility. The development of\nthe art or science of cutting metals is an apt illustration of this\nfact. In the fall of 1880, about the time that the writer started to\nmake the experiments above referred to, to determine what constitutes a\nproper day's work for a laborer, he also obtained the permission of Mr.\nWilliam Sellers, the President of the Midvale Steel Company, to make a\nseries of experiments to determine what angles and shapes of tools were\nthe best for cutting steel, and also to try to determine the proper\ncutting speed for steel. At the time that these experiments were started\nit was his belief that they would not last longer than six months, and,\nin fact, if it had been known that a longer period than this would be\nrequired, the permission to spend a considerable sum of money in making\nthem would not have been forthcoming.\n\nA 66-inch diameter vertical boring-mill was the first machine used in\nmaking these experiments, and large locomotive tires, made out of hard\nsteel of uniform quality, were day after day cut up into chips in\ngradually learning how to make, shape, and use the cutting tools so that\nthey would do faster work. At the end of six months sufficient\npractical information had been obtained to far more than repay the cost\nof materials and wages which had been expended in experimenting. And yet\nthe comparatively small number of experiments which had been made served\nprincipally to make it clear that the actual knowledge attained was but\na small fraction of that which still remained to be developed, and which\nwas badly needed by us, in our daily attempt to direct and help the\nmachinists in their tasks.\n\nExperiments in this field were carried on, with occasional interruption,\nthrough a period of about 26 years, in the course of which ten different\nexperimental machines were especially fitted up to do this work. Between\n30,000 and 50,000 experiments were carefully recorded, and many other\nexperiments were made, of which no record was kept. In studying these\nlaws more than 800,000 pounds of steel and iron was cut up into chips\nwith the experimental tools, and it is estimated that from $150,000 to\n$200,000 was spent in the investigation.\n\nWork of this character is intensely interesting to any one who has any\nlove for scientific research. For the purpose of this paper, however, it\nshould be fully appreciated that the motive power which kept these\nexperiments going through many years, and which supplied the money and\nthe opportunity for their accomplishment, was not an abstract search\nafter scientific knowledge, but was the very practical fact that we\nlacked the exact information which was needed every day, in order to\nhelp our machinists to do their work in the best way and in the quickest\ntime.\n\nAll of these experiments were made to enable us to answer correctly the\ntwo questions which face every machinist each time that he does a piece\nof work in a metal-cutting machine, such as a lathe, planer, drill\npress, or milling machine. These two questions are:\n\nIn order to do the work in the quickest time, At what cutting speed\nshall I run my machine? and\n\nWhat feed shall I use?\n\nThey sound so simple that they would appear to call for merely the\ntrained judgment of any good mechanic. In fact, however, after working\n26 years, it has been found that the answer in every case involves the\nsolution of an intricate mathematical problem, in which the effect of\ntwelve independent variables must be determined.\n\nEach of the twelve following variables has an important effect upon the\nanswer. The figures which are given with each of the variables represent\nthe effect of this element upon the cutting speed.\n\nFor example, after the first variable (A) we quote,\n\n\"The proportion is as I in the case of semi-hardened steel or chilled\niron to 100 in the case of a very soft, low-carbon steel.\" The meaning\nof this quotation is that soft steel can be cut 100 times as fast as the\nhard steel or chilled iron. The ratios which are given, then, after each\nof these elements, indicate the wide range of judgment which practically\nevery machinist has been called upon to exercise in the past in\ndetermining the best speed at which to run the machine and the best feed\nto use.\n\n(A) The quality of the metal which is to be cut; i.e., its hardness\nor other qualities which affect the cutting speed. The proportion is as\n1 in the case of semi-hardened steel or chilled iron to 100 in the case\nof very soft, low-carbon steel.\n\n(B) The chemical composition of the steel from which the tool is\nmade, and the heat treatment of the tool. The proportion is as 1 in\ntools made from tempered carbon steel to 7 in the best high-speed tools.\n\n(C) The thickness of the shaving, or, the thickness of the spiral\nstrip or band of metal which is to be removed by the tool. The\nproportion is as 1 with thickness of shaving 3/16 of an inch to 3 1/2\nwith thickness of shaving 1/64 of an inch.\n\n(D) The shape or contour of the cutting edge of the tool. The\nproportion is as 1 in a thread tool to 6 in a broad-nosed cutting tool.\n\n(E) Whether a copious stream of water or other cooling medium is\nused on the tool. The proportion is as 1 for tool running dry to 1.41\nfor tool cooled by a copious stream of water.\n\n(F) The depth of the cut. The proportion is as 1 with 1/2 inch depth\nof cut to 1.36 with 1/8 inch depth of cut.\n\n(G) The duration of the cut, i.e., the time which a tool must last under\npressure of the shaving without being reground. The proportion is as 1\nwhen tool is to be ground every 1 1/2 hours to 1.20 when tool is to be\nground every 20 minutes.\n\n(H) The lip and clearance angles of the tool. The proportion is as 1\nwith lip angle of 68 degrees to 1.023 with lip angle of 61 degrees.\n\n(J) The elasticity of the work and of the tool on account of\nproducing chatter. The proportion is as 1 with tool chattering to 1.15\nwith tool running smoothly.\n\n(K) The diameter of the casting or forging which is being cut.\n\n(L) The pressure of the chip or shaving upon the cutting surface of the\ntool.\n\n(M) The pulling power and the speed and feed changes of the machine.\n\nIt may seem preposterous to many people that it should have required a\nperiod of 26 years to investigate the effect of these twelve variables\nupon the cutting speed of metals. To those, however, who have had\npersonal experience as experimenters, it will be appreciated that the\ngreat difficulty of the problem lies in the fact that it contains so\nmany variable elements. And in fact the great length of time consumed in\nmaking each single experiment was caused by the difficulty of holding\neleven variables constant and uniform throughout the experiment, while\nthe effect of the twelfth variable was being investigated. Holding the\neleven variables constant was far more difficult than the investigation\nof the twelfth element.\n\nAs, one after another, the effect upon the cutting speed of each of\nthese variables was investigated, in order that practical use could be\nmade of this knowledge, it was necessary to find a mathematical formula\nwhich expressed in concise form the laws which had been obtained. As\nexamples of the twelve formulae which were developed, the three\nfollowing are given:\n\n        P = 45,000  D 14/15 F 3/4\n\n        V = 90/T 1/8\n\n        V = 11.9/ (F 0.665(48/3 D) 0.2373 + (2.4 / (18 + 24D))\n\nAfter these laws had been investigated and the various formulae which\nmathematically expressed them had been determined, there still remained\nthe difficult task of how to solve one of these complicated mathematical\nproblems quickly enough to make this knowledge available for every-day\nuse. If a good mathematician who had these formula before him were to\nattempt to get the proper answer (i.e., to get the correct cutting speed\nand feed by working in the ordinary way) it would take him from two to\nsix hours, say, to solve a single problem; far longer to solve the\nmathematical problem than would be taken in most cases by the workmen in\ndoing the whole job in his machine. Thus a task of considerable\nmagnitude which faced us was that of finding a quick solution of this\nproblem, and as we made progress in its solution, the whole problem was\nfrom time to time presented by the writer to one after another of the\nnoted mathematicians in this country. They were offered any reasonable\nfee for a rapid, practical method to be used in its solution. Some of\nthese men merely glanced at it; others, for the sake of being courteous,\nkept it before them for some two or three weeks. They all gave us\npractically the same answer: that in many cases it was possible to,\nsolve mathematical problems which contained four variables, and in some\ncases problems with five or six variables, but that it was manifestly\nimpossible to solve a problem containing twelve variables in any other\nway than by the slow process of \"trial and error.\"\n\nA quick solution was, however, so much of a necessity in our every-day\nwork of running machine-shops, that in spite of the small encouragement\nreceived from the mathematicians, we continued at irregular periods,\nthrough a term of fifteen years, to give a large amount of time\nsearching for a simple solution. Four or five men at various periods\ngave practically their whole time to this work, and finally, while we\nwere at the Bethlehem Steel Company, the slide-rule was developed which\nis illustrated on Folder No. 11 of the paper \"On the Art of Cutting\nMetals,\" and is described in detail in the paper presented by Mr. Carl\nG. Barth to the American Society of Mechanical Engineers, entitled\n\"Slide-rules for the Machine-shop, as a part of the Taylor System of\nManagement\" (Vol. XXV of The Transactions of the American Society of\nMechanical Engineers). By means of this slide-rule, one of these\nintricate problems can be solved in less than a half minute by any good\nmechanics whether he understands anything about mathematics or not, thus\nmaking available for every-day, practical use the years of experimenting\non the art of cutting metals. This is a good illustration of the fact\nthat some way can always be found of making practical, everyday use of\ncomplicated scientific data, which appears to be beyond the experience\nand the range of the technical training of ordinary practical men. These\nslide-rules have been for years in constant daily use by machinists\nhaving no knowledge of mathematics.\n\nA glance at the intricate mathematical formula (see page 109) which\nrepresent the laws of cutting metals should clearly show the reason why\nit is impossible for any machinist, without the aid of these laws, and\nwho depends upon his personal experience, correctly to guess at the\nanswer to the two questions,\n\n    What speed shall I use?\n\n    What feed shall I use?\n\neven though he may repeat the same piece of work many times.\n\nTo return to the case of the machinist who had been working for ten to\ntwelve years in machining the same pieces over and over again, there was\nbut a remote chance in any of the various kinds of work which this man\ndid that he should hit upon the one best method of doing each piece of\nwork out of the hundreds of possible methods which lay before him. In\nconsidering this typical case, it must also be remembered that the\nmetal-cutting machines throughout our machine-shops have practically all\nbeen speeded by their makers by guesswork, and without the knowledge\nobtained through a study of the art of cutting metals. In the\nmachine-shops systematized by us we have found that there is not one\nmachine in a hundred which is speeded by its makers at anywhere near the\ncorrect cutting speed. So that, in order to compete with the science of\ncutting metals, the machinist, before he could use proper speeds, would\nfirst have to put new pulleys on the countershaft of his machine, and\nalso make in most cases changes in the shapes and treatment of his\ntools, etc. Many of these changes are matters entirely beyond his\ncontrol, even if he knows what ought to be done.\n\nIf the reason is clear to the reader why the rule-of-thumb knowledge\nobtained by the machinist who is engaged on repeat work cannot possibly\ncompete with the true science of cutting metals, it should be even more\napparent why the high-class mechanic, who is called upon to do a great\nvariety of work from day to day, is even less able to compete with this\nscience. The high-class mechanic who does a different kind of work each\nday, in order to do each job in the quickest time, would need, in\naddition to a thorough knowledge of the art of cutting metals, a vast\nknowledge and experience in the quickest way of doing each kind of hand\nwork. And the reader, by calling to mind the gain which was made by Mr.\nGilbreth through his motion and time study in laying bricks, will\nappreciate the great possibilities for quicker methods of doing all\nkinds of hand work which lie before every tradesman after he has the\nhelp which comes from a scientific motion and time study of his work.\n\nFor nearly thirty years past, time-study men connected with the\nmanagement of machine-shops have been devoting their whole time to a\nscientific motion study, followed by accurate time study, with a\nstop-watch, of all of the elements connected with the machinist's work.\nWhen, therefore, the teachers, who form one section of the management,\nand who are cooperating with the working men, are in possession both of\nthe science of cutting metals and of the equally elaborate motion-study\nand time-study science connected with this work, it is not difficult to\nappreciate why even the highest class mechanic is unable to do his best\nwork without constant daily assistance from his teachers. And if this\nfact has been made clear to the reader, one of the important objects in\nwriting this paper will have been realized.\n\nIt is hoped that the illustrations which have been given make it\napparent why scientific management must inevitably in all cases produce\noverwhelmingly greater results, both for the company and its employees,\nthan can be obtained with the management of \"initiative and incentive.\"\nAnd it should also be clear that these results have been attained, not\nthrough a marked superiority in the mechanism of one type of management\nover the mechanism of another, but rather through the substitution of\none set of underlying principles for a totally different set of\nprinciples, by the substitution of one philosophy for another philosophy\nin industrial management.\n\nTo repeat them throughout all of these illustrations, it will be seen\nthat the useful results have hinged mainly upon (1) the substitution of\na science for the individual judgment of the workman; (2) the scientific\nselection and development of the workman, after each man has been\nstudied, taught, and trained, and one may say experimented with, instead\nof allowing the workmen to select themselves and develop in a haphazard\nway; and (3) the intimate cooperation of the management with the\nworkmen, so that they together do the work in accordance with the\nscientific laws which have been developed, instead of leaving the\nsolution of each problem in the hands of the individual workman. In\napplying these new principles, in place of the old individual effort of\neach workman, both sides share almost equally in the daily performance\nof each task, the management doing that part of the work for which they\nare best fitted, and the workmen the balance.\n\nIt is for the illustration of this philosophy that this paper has been\nwritten, but some of the elements involved in its general principles\nshould be further discussed.\n\nThe development of a science sounds like a formidable undertaking, and\nin fact anything like a thorough study of a science such as that of\ncutting metals necessarily involves many years of work. The science of\ncutting metals, however, represents in its complication, and in the time\nrequired to develop it, almost an extreme case in the mechanic arts. Yet\neven in this very intricate science, within a few months after starting,\nenough knowledge had been obtained to much more than pay for the work of\nexperimenting. This holds true in the case of practically all scientific\ndevelopment in the mechanic arts. The first laws developed for cutting\nmetals were crude, and contained only a partial knowledge of the truth,\nyet this imperfect knowledge was vastly better than the utter lack of\nexact information or the very imperfect rule of thumb which existed\nbefore, and it enabled the workmen, with the help of the management, to\ndo far quicker and better work.\n\nFor example, a very short time was needed to discover one or two types\nof tools which, though imperfect as compared with the shapes developed\nyears afterward, were superior to all other shapes and kinds in common\nuse. These tools were adopted as standard and made possible an immediate\nincrease in the speed of every machinist who used them. These types were\nsuperseded in a comparatively short time by still other tools which\nremained standard until they in their turn made way for later\nimprovements.*\n\n[*Footnote: Time and again the experimenter in the mechanic arts will\nfind himself face to face with the problem as to whether he had better\nmake immediate practical use of the knowledge which he has attained, or\nwait until some positive finality in his conclusions has been reached.\nHe recognizes clearly the fact that he has already made some definite\nprogress, but sees the possibility (even the probability) of still\nfurther improvement. Each particular case must of course be\nindependently considered, but the general conclusion we have reached is\nthat in most instances it is wise to put one's conclusions as soon as\npossible to the rigid test of practical use. The one indispensable\ncondition for such a test, however, is that the experimenter shall have\nfull opportunity, coupled with sufficient authority, to insure a\nthorough and impartial trial. And this, owing to the almost universal\nprejudice in favor of the old, and to the suspicion of the new, is\ndifficult to get.]\n\nThe science which exists in most of the mechanic arts is, however, far\nsimpler than the science of cutting metals. In almost all cases, in\nfact, the laws or rules which are developed are so simple that the\naverage man would hardly dignify them with the name of a science. In\nmost trades, the science is developed through a comparatively simple\nanalysis and time study of the movements required by the workmen to do\nsome small part of his work, and this study is usually made by a man\nequipped merely with a stop-watch and a properly ruled notebook.\nHundreds of these \"time-study men\" are now engaged in developing\nelementary scientific knowledge where before existed only rule of thumb.\nEven the motion study of Mr. Gilbreth in bricklaying (described on pages\n77 to 84) involves a much more elaborate investigation than that which\noccurs in most cases. The general steps to be taken in developing a\nsimple law of this class are as follows:\n\nFirst. Find, say, 10 or 15 different men (preferably in as many separate\nestablishments and different parts of the country) who are especially\nskilful in doing the particular work to be analyzed.\n\nSecond. Study the exact series of elementary operations or motions which\neach of these men uses in doing the work which is being investigated, as\nwell as the implements each man uses.\n\nThird. Study with a stop-watch the time required to make each of these\nelementary movements and then select the quickest way of doing each\nelement of the work.\n\nFourth. Eliminate all false movements, slow movements, and useless\nmovements.\n\nFifth. After doing away with all unnecessary movements, collect into one\nseries the quickest and best movements as well as the best implements.\n\nThis one new method, involving that series of motions which can be made\nquickest and best, is then substituted in place of the ten or fifteen\ninferior series which were formerly in use. This best method becomes\nstandard, and remains standard, to be taught first to the teachers (or\nfunctional foremen) and by them to every workman in the establishment\nuntil it is superseded by a quicker and better series of movements. In\nthis simple way one element after another of the science is developed.\n\nIn the same way each type of implement used in a trade is studied. Under\nthe philosophy of the management of \"initiative and incentive\" each\nwork-man is called upon to use his own best judgment, so as to do the\nwork in the quickest time, and from this results in all cases a large\nvariety in the shapes and types of implements which are used for any\nspecific purpose. Scientific management requires, first, a careful\ninvestigation of each of the many modifications of the same implement,\ndeveloped under rule of thumb; and second, after a time study has been\nmade of the speed attainable with each of these implements, that the\ngood points of several of them shall be united in a single standard\nimplement, which will enable the workman to work faster and with greater\nease than he could before. This one implement, then, is adopted as\nstandard in place of the many different kinds before in use, and it\nremains standard for all workmen to use until superseded by an implement\nwhich has been shown, through motion and time study, to be still better.\n\nWith this explanation it will be seen that the development of a science\nto replace rule of thumb is in most cases by no means a formidable\nunder-taking, and that it can be accomplished by ordinary, every-day men\nwithout any elaborate scientific training; but that, on the other hand,\nthe successful use of even the simplest improvement of this kind calls\nfor records, system, and cooperation where in the past existed only\nindividual effort.\n\nThere is another type of scientific investigation which has been\nreferred to several times in this paper, and which should receive\nspecial attention, namely, the accurate study of the motives which\ninfluence men. At first it may appear that this is a matter for\nindividual observation and judgment, and is not a proper subject for\nexact scientific experiments. It is true that the laws which result from\nexperiments of this class, owing to the fact that the very complex\norganism--the human being--is being experimented with, are subject to a\nlarger number of exceptions than is the case with laws relating to\nmaterial things. And yet laws of this kind, which apply to a large\nmajority of men, unquestionably exist, and when clearly defined are of\ngreat value as a guide in dealing with men. In developing these laws,\naccurate, carefully planned and executed experiments, extending through\na term of years, have been made, similar in a general way to the\nexperiments upon various other elements which have been referred to in\nthis paper. Perhaps the most important law belonging to this class, in\nits relation to scientific management, is the effect which the task idea\nhas upon the efficiency of the workman. This, in fact, has become such\nan important element of the mechanism of scientific management, that by\na great number of people scientific management has come to be known as\n\"task management.\"\n\nThere is absolutely nothing new in the task idea. Each one of us will\nremember that in his own case this idea was applied with good results in\nhis school-boy days. No efficient teacher would think of giving a class\nof students an indefinite lesson to learn. Each day a definite,\nclear-cut task is set by the teacher before each scholar, stating that\nhe must learn just so much of the subject; and it is only by this means\nthat proper, systematic progress can be made by the students. The\naverage boy would go very slowly if, instead of being given a task, he\nwere told to do as much as he could. All of us are grown-up children,\nand it is equally true that the average workman will work with the\ngreatest satisfaction, both to himself and to his employer, when he is\ngiven each day a definite task which he is to perform in a given time,\nand which constitutes a proper day's work for a good workman. This\nfurnishes the workman with a clear-cut standard, by which he can\nthroughout the day measure his own progress, and the accomplishment of\nwhich affords him the greatest satisfaction.\n\nThe writer has described in other papers a series of experiments made\nupon workmen, which have resulted in demonstrating the fact that it is\nimpossible, through any long period of time, to get work-men to work\nmuch harder than the average men around them, unless they are assured a\nlarge and a permanent increase in their pay. This series of experiments,\nhowever, also proved that plenty of workmen can be found who are willing\nto work at their best speed, provided they are given this liberal\nincrease in wages. The workman must, however, be fully assured that this\nincrease beyond the average is to be permanent. Our experiments have\nshown that the exact percentage of increase required to make a workman\nwork at his highest speed depends upon the kind of work which the man is\ndoing.\n\nIt is absolutely necessary, then, when workmen are daily given a task\nwhich calls for a high rate of speed on their part, that they should\nalso be insured the necessary high rate of pay whenever they are\nsuccessful. This involves not only fixing for each man his daily task,\nbut also paying him a large bonus, or premium, each time that he\nsucceeds in doing his task in the given time. It is difficult to\nappreciate in full measure the help which the proper use of these two\nelements is to the workman in elevating him to the highest standard of\nefficiency and speed in his trade, and then keeping him there, unless\none has seen first the old plan and afterward the new tried upon the\nsame man. And in fact until one has seen similar accurate experiments\nmade upon various grades of workmen engaged in doing widely different\ntypes of work. The remarkable and almost uniformly good results from the\ncorrect application of the task and the bonus must be seen to be\nappreciated.\n\nThese two elements, the task and the bonus (which, as has been pointed\nout in previous papers, can be applied in several ways), constitute two\nof the most important elements of the mechanism of scientific\nmanagement. They are especially important from the fact that they are,\nas it were, a climax, demanding before they can be used almost all of\nthe other elements of the mechanism; such as a planning department,\naccurate time study, standardization of methods and implements, a\nrouting system, the training of functional foremen or teachers, and in\nmany cases instruction cards slide-rules, etc. (Referred to later in\nrather more detail on page 129.)\n\nThe necessity for systematically teaching workmen how to work to the\nbest advantage has been several times referred to. It seems desirable,\ntherefore, to explain in rather more detail how this teaching is done.\nIn the case of a machine-shop which is managed under the modern system,\ndetailed written instructions as to the best way of doing each piece of\nwork are prepared in advance, by men in the planning department. These\ninstructions represent the combined work of several men in the planning\nroom, each of whom has his own specialty, or function. One of them, for\ninstance, is a specialist on the proper speeds and cutting tools to be\nused. He uses the slide-rules which have been above described as an aid,\nto guide him in obtaining proper speeds, etc. Another man analyzes the\nbest and quickest motions to be made by the workman in setting the work\nup in the machine and removing it, etc. Still a third, through the\ntime-study records which have been accumulated, makes out a timetable\ngiving the proper speed for doing each element of the work. The\ndirections of all of these men, however, are written on a single\ninstruction card, or sheet.\n\nThese men of necessity spend most of their time in the planning\ndepartment, because they must be close to the records and data which\nthey continually use in their work, and because this work requires the\nuse of a desk and freedom from interruption. Human nature is such,\nhowever, that many of the workmen, if left to themselves, would pay but\nlittle attention to their written instructions. It is necessary,\ntherefore, to provide teachers (called functional foremen) to see that\nthe workmen both understand and carry out these written instructions.\n\nUnder functional management, the old-fashioned single foreman is\nsuperseded by eight different men, each one of whom has his own special\nduties, and these men, acting as the agents for the planning department\n(see paragraph 234 to 245 of the paper entitled \"Shop Management\"), are\nthe expert teachers, who are at all times in the shop, helping, and\ndirecting the workmen. Being each one chosen for his knowledge and\npersonal skill in his specialty, they are able not only to tell the\nworkman what he should do, but in case of necessity they do the work\nthemselves in the presence of the workman, so as to show him not only\nthe best but also the quickest methods.\n\nOne of these teachers (called the inspector) sees to it that he\nunderstands the drawings and instructions for doing the work. He teaches\nhim how to do work of the right quality; how to make it fine and exact\nwhere it should be fine, and rough and quick where accuracy is not\nrequired,--the one being just as important for success as the other. The\nsecond teacher (the gang boss) shows him how to set up the job in his\nmachine, and teaches him to make all of his personal motions in the\nquickest and best way. The third (the speed boss) sees that the machine\nis run at the best speed and that the proper tool is used in the\nparticular way which will enable the machine to finish its product in\nthe shortest possible time. In addition to the assistance given by these\nteachers, the workman receives orders and help from four other men; from\nthe \"repair boss\" as to the adjustment, cleanliness, and general care of\nhis machine, belting, etc.; from the \"time clerk,\" as to everything\nrelating to his pay and to proper written reports and returns; from the\n\"route clerk,\" as to the order in which he does his work and as to the\nmovement of the work from one part of the shop to another; and, in case\na workman gets into any trouble with any of his various bosses, the\n\"disciplinarian\" interviews him.\n\nIt must be understood, of course, that all workmen engaged on the same\nkind of work do not require the same amount of individual teaching and\nattention from the functional foremen. The men who are new at a given\noperation naturally require far more teaching and watching than those\nwho have been a long time at the same kind of jobs.\n\nNow, when through all of this teaching and this minute instruction the\nwork is apparently made so smooth and easy for the workman, the first\nimpression is that this all tends to make him a mere automaton, a wooden\nman. As the workmen frequently say when they first come under this\nsystem, \"Why, I am not allowed to think or move without some one\ninterfering or doing it for me!\" The same criticism and objection,\nhowever, can be raised against all other modern subdivision of labor. It\ndoes not follow, for example, that the modern surgeon is any more narrow\nor wooden a man than the early settler of this country. The\nfrontiersman, however, had to be not only a surgeon, but also an\narchitect, house-builder, lumberman, farmer, soldier, and doctor, and he\nhad to settle his law cases with a gun. You would hardly say that the\nlife of the modern surgeon is any more narrowing, or that he is more of\na wooden man than the frontiersman. The many problems to be met and\nsolved by the surgeon are just as intricate and difficult and as\ndeveloping and broadening in their way as were those of the\nfrontiersman.\n\nAnd it should be remembered that the training of the surgeon has been\nalmost identical in type with the teaching and training which is given\nto the workman under scientific management. The surgeon, all through his\nearly years, is under the closest supervision of more experienced men,\nwho show him in the minutest way how each element of his work is best\ndone. They provide him with the finest implements, each one of which has\nbeen the subject of special study and development, and then insist upon\nhis using each of these implements in the very best way. All of this\nteaching, however, in no way narrows him. On the contrary he is quickly\ngiven the very best knowledge of his predecessors; and, provided (as he\nis, right from the start) with standard implements and methods which\nrepresent the best knowledge of the world up to date, he is able to use\nhis own originality and ingenuity to make real additions to the world's\nknowledge, instead of reinventing things which are old. In a similar way\nthe workman who is cooperating with his many teachers under scientific\nmanagement has an opportunity to develop which is at least as good as\nand generally better than that which he had when the whole problem was\n\"up to him\" and he did his work entirely unaided.\n\nIf it were true that the workman would develop into a larger and finer\nman without all of this teaching, and without the help of the laws which\nhave been formulated for doing his particular job, then it would follow\nthat the young man who now comes to college to have the help of a\nteacher in mathematics, physics, chemistry, Latin, Greek, etc., would do\nbetter to study these things unaided and by himself. The only difference\nin the two cases is that students come to their teachers, while from the\nnature of the work done by the mechanic under scientific management, the\nteachers must go to him. What really happens is that, with the aid of\nthe science which is invariably developed, and through the instructions\nfrom his teachers, each workman of a given intellectual capacity is\nenabled to do a much higher, more interesting, and finally more\ndeveloping and more profitable kind of work than he was before able to\ndo. The laborer who before was unable to do anything beyond, perhaps,\nshoveling and wheeling dirt from place to place, or carrying the work\nfrom one part of the shop to another, is in many cases taught to do the\nmore elementary machinist's work, accompanied by the agreeable\nsurroundings and the interesting variety and higher wages which go with\nthe machinist's trade. The cheap machinist or helper, who before was\nable to run perhaps merely a drill press, is taught to do the more\nintricate and higher priced lathe and planer work, while the highly\nskilled and more intelligent machinists become functional foremen and\nteachers. And so on, right up the line.\n\nIt may seem that with scientific management there is not the same\nincentive for the workman to use his ingenuity in devising new and\nbetter methods of doing the work, as well as in improving his\nimplements, that there is with the old type of management. It is true\nthat with scientific management the workman is not allowed to use\nwhatever implements and methods he sees fit in the daily practice of his\nwork. Every encouragement, however, should be given him to suggest\nimprovements, both in methods and in implements. And whenever a workman\nproposes an improvement, it should be the policy of the management to\nmake a careful analysis of the new method, and if necessary conduct a\nseries of experiments to determine accurately the relative merit of the\nnew suggestion and of the old standard. And whenever the new method is\nfound to be markedly superior to the old, it should be adopted as the\nstandard for the whole establishment. The workman should be given the\nfull credit for the improvement, and should be paid a cash premium as a\nreward for his ingenuity. In this way the true initiative of the workmen\nis better attained under scientific management than under the old\nindividual plan.\n\nThe history of the development of scientific, management up to date,\nhowever, calls for a word of warning. The mechanism of management must\nnot be mistaken for its essence, or underlying philosophy. Precisely the\nsame mechanism will in one case produce disastrous results and in\nanother the most beneficent. The same mechanism which will produce the\nfinest results when made to serve the underlying principles of\nscientific management, will lead to failure and disaster if accompanied\nby the wrong spirit in those who are using it. Hundreds of people have\nalready mistaken the mechanism of this system for its essence. Messrs.\nGantt, Barth and the writer have presented papers to, the American\nSociety of Mechanical Engineers on the subject of scientific management.\nIn these papers the mechanism which is used has been described at some\nlength. As elements of this mechanism may be cited:\n\nTime study, with the implements and methods for properly making it.\n\nFunctional or divided foremanship and its superiority to the\nold-fashioned single foreman.\n\nThe standardization of all tools and implements used in the trades, and\nalso of the acts or movements of workmen for each class of work.\n\nThe desirability of a planning room or department.\n\nThe \"exception principle\" in management.\n\nThe use of slide-rules and similar timesaving implements.\n\nInstruction cards for the workman.\n\nThe task idea in management, accompanied by a large bonus for the\nsuccessful performance of the task.\n\nThe \"differential rate.\"\n\nMnemonic systems for classifying manufactured products as well as\nimplements used in manufacturing.\n\nA routing system.\n\nModern cost system, etc., etc.\n\nThese are, however, merely the elements or details of the mechanism of\nmanagement. Scientific management, in its essence, consists of a certain\nphilosophy, which results, as before stated, in a combination of the\nfour great underlying principles of management:*\n\n[*Footnote: First. The development of a true science.\nSecond. The scientific selection of the workman.\nThird. His scientific education and development.\nFourth. Intimate friendly cooperation between the management and the men.]\n\nWhen, however the elements of this mechanism, such as time study,\nfunctional foremanship etc., are used without being accompanied by the\ntrue philosophy of management, the results are in many cases disastrous.\nAnd, unfortunately, even when men who are thoroughly in sympathy with\nthe principles of scientific management undertake to change too rapidly\nfrom the old type to the new, without heeding the warnings of those who\nhave had years of experience in making this change, they frequently meet\nwith serious troubles, and sometimes with strikes, followed by failure.\n\nThe writer, in his paper on \"Shop Management,\" has called especial\nattention to the risks which managers run in attempting to change\nrapidly from the old to the new management in many cases, however, this\nwarning has not been heeded. The physical changes which are needed, the\nactual time study which has to be made, the standardization of all\nimplements connected with the work, the necessity for individually\nstudying each machine and placing it in perfect order, all take time,\nbut the faster these elements of the work are studied and improved, the\nbetter for the undertaking. On the other hand, the really great problem\ninvolved in a change from the management of \"initiative and incentive\"\nto scientific management consists in a complete revolution in the mental\nattitude and the habits of all of those engaged in the management, as\nwell of the workmen. And this change can be brought about only gradually\nand through the presentation of many object-lessons to the workman,\nwhich, together with the teaching which he receives, thoroughly convince\nhim of the superiority of the new over the old way of doing the work.\nThis change in the mental attitude of the workman imperatively demands\ntime. It is impossible to hurry it beyond a certain speed. The writer\nhas over and over again warned those who contemplated making this change\nthat it was a matter, even in a simple establishment, of from two to\nthree years, and that in some cases it requires from four to five years.\n\nThe first few changes which affect the workmen should be made\nexceedingly slowly, and only one workman at a time should be dealt with\nat the start. Until this single man has been thoroughly convinced that a\ngreat gain has come to him from the new method, no further change should\nbe made. Then one man after another should be tactfully changed over.\nAfter passing the point at which from one.-fourth to one-third of the\nmen in the employ of the company have been changed from the old to the\nnew, very rapid progress can be made, because at about this time there\nis, generally, a complete revolution in the public opinion of the whole\nestablishment and practically all of the workmen who are working under\nthe old system become desirous to share in the benefits which they see\nhave been received by those working under the new plan.\n\nInasmuch as the writer has personally retired from the business of\nintroducing this system of management (that is, from all work done in\nreturn for any money compensation), he does not hesitate again to\nemphasize the fact that those companies are indeed fortunate who can\nsecure the services of experts who have had the necessary practical\nexperience in introducing scientific management, and who have made a\nspecial study of its principles. It is not enough that a man should have\nbeen a manager in an establishment which is run under the new\nprinciples. The man who undertakes to direct the steps to be taken in\nchanging from the old to the new (particularly in any establishment\ndoing elaborate work) must have had personal experience in overcoming\nthe especial difficulties which are always met with, and which are\npeculiar to this period of transition. It is for this reason that the\nwriter expects to devote the rest of his life chiefly to trying to help\nthose who wish to take up this work as their profession, and to advising\nthe managers and owners of companies in general as to the steps which\nthey should take in making this change.\n\nAs a warning to those who contemplate adopting scientific management,\nthe following instance is given. Several men who lacked the extended\nexperience which is required to change without danger of strikes, or\nwithout interference with the success of the business, from the\nmanagement of \"initiative and incentive\" to scientific management,\nattempted rapidly to increase the output in quite an elaborate\nestablishment, employing between three thousand and four thousand men.\nThose who undertook to make this change were men of unusual ability, and\nwere at the same time enthusiasts and I think had the interests of the\nworkmen truly at heart. They were, however, warned by the writer, before\nstarting, that they must go exceedingly slowly, and that the work of\nmaking the change in this establishment could not be done in less than\nfrom three to five years. This warning they entirely disregarded. They\nevidently believed that by using much of the mechanism of scientific\nmanagement, in combination with the principles of the management of\n\"initiative and incentive,\" instead of with these principles of\nscientific management, that they could do, in a year or two, what had\nbeen proved in the past to require at least double this time. The\nknowledge obtained from accurate time study, for example, is a powerful\nimplement, and can be used, in one case to promote harmony between the\nworkmen and the management, by gradually educating, training, and\nleading the workmen into new and better methods of doing the work, or,\nin the other case, it may be used more or less as a club to drive the\nworkmen into doing a larger day's work for approximately the same pay\nthat they received in the past. Unfortunately the men who had charge of\nthis work did not take the time and the trouble required to train\nfunctional foremen, or teachers, who were fitted gradually to lead and\neducate the workmen. They attempted, through the old-style foreman,\narmed with his new weapon (accurate time study), to drive the workmen,\nagainst their wishes, and without much increase in pay, to work much\nharder, instead of gradually teaching and leading them toward new\nmethods, and convincing them through object-lessons that task management\nmeans for them somewhat harder work, but also far greater prosperity.\nThe result of all this disregard of fundamental principles was a series\nof strikes, followed by the down-fall of the men who attempted to make\nthe change, and by a return to conditions throughout the establishment\nfar worse than those which existed before the effort was made.\n\nThis instance is cited as an object-lesson of the futility of using the\nmechanism of the new management while leaving out its essence, and also\nof trying to shorten a necessarily long operation in entire disregard of\npast experience. It should be emphasized that the men who undertook this\nwork were both able and earnest, and that failure was not due to lack of\nability on their part, but to their undertaking to do the impossible.\nThese particular men will not again make a similar mistake, and it is\nhoped that their experience may act as a warning to others.\n\nIn this connection, however, it is proper to again state that during the\nthirty years that we have been engaged in introducing scientific\nmanagement there has not been a single strike from those who were\nworking in accordance with its principles, even during the critical\nperiod when the change was being made from the old to the new. If proper\nmethods are used by men who have had experience in this work, there is\nabsolutely no danger from strikes or other troubles.\n\nThe writer would again insist that in no case should the managers of an\nestablishment ', the work of which is elaborate, undertake to change\nfrom the old to the new type unless the directors of the company fully\nunderstand and believe in the fundamental principles of scientific\nmanagement and unless they appreciate all that is involved in making\nthis change, particularly the time required, and unless they want\nscientific management greatly.\n\nDoubtless some of those who are especially interested in working men\nwill complain because under scientific management the workman, when he\nis shown how to do twice as much work as he formerly did, is not paid\ntwice his former wages, while others who are more interested in the\ndividends than the workmen will complain that under this system the men\nreceive much higher wages than they did before.\n\nIt does seem grossly unjust when the bare statement is made that the\ncompetent pig-iron handler, for instance, who has been so trained that\nhe piles 3 6/10 times as much iron as the incompetent man formerly did,\nshould receive an increase of only 60 per cent in wages.\n\nIt is not fair, however, to form any final judgment until all of the\nelements in the case have been considered. At the first glance we see\nonly two parties to the transaction, the workmen and their employers. We\noverlook the third great party, the whole people,--the consumers, who\nbuy the product of the first two and who ultimately pay both the wages\nof the workmen and the profits of the employers.\n\nThe rights of the people are therefore greater than those of either\nemployer or employee. And this third great party should be given its\nproper share of any gain. In fact, a glance at industrial history shows\nthat in the end the whole people receive the greater part of the benefit\ncoming from industrial improvements. In the past hundred years, for\nexample, the greatest factor tending toward increasing the output, and\nthereby the prosperity of the civilized world, has been the introduction\nof machinery to replace hand labor. And without doubt the greatest gain\nthrough this change has come to the whole people--the consumer.\n\nThrough short periods, especially in the case of patented apparatus, the\ndividends of those who have introduced new machinery have been greatly\nincreased, and in many cases, though unfortunately not universally, the\nemployees have obtained materially higher wages, shorter hours, and\nbetter working conditions. But in the end the major part of the gain has\ngone to the whole people.\n\nAnd this result will follow the introduction of scientific management\njust as surely as it has the introduction of machinery.\n\nTo return to the case of the pig-iron handler. We must assume, then,\nthat the larger part of the gain which has come from his great increase\nin output will in the end go to the people in the form of cheaper\npig-iron. And before deciding upon how the balance is to be divided\nbetween the workmen and the employer, as to what is just and fair\ncompensation for the man who does the piling and what should be left for\nthe company as profit, we must look at the matter from all sides.\n\nFirst. As we have before stated, the pig-iron handler is not an\nextraordinary man difficult to find, he is merely a man more or less of\nthe type of the ox, heavy both mentally and physically.\n\nSecond. The work which this man does tires him no more than any healthy\nnormal laborer is tired by a proper day's work. (If this man is\novertired by his work, then the task has been wrongly set and this is as\nfar as possible from the object of scientific management.)\n\nThird. It was not due to this man's initiative or originality that he\ndid his big day's work, but to the knowledge of the science of pig-iron\nhandling developed and taught him by some one else.\n\nFourth. It is just and fair that men of the same general grade (when\ntheir all-round capacities are considered) should be paid about the same\nwages when they are all working to the best of their abilities. (It\nwould be grossly unjust to other laborers, for instance, to pay this man\n3 6/10 as high wages as other men of his general grade receive for an\nhonest full day's work.)\n\nFifth. As is explained (page 74), the 60 per cent increase in pay which\nhe received was not the result of an arbitrary judgment of a foreman or\nsuperintendent, it was the result of a long series of careful\nexperiments impartially made to determine what compensation is really\nfor the man's true and best interest when all things are considered.\n\nThus we see that the pig-iron handler with his 60 per cent increase in\nwages is not an object for pity but rather a subject for congratulation.\n\nAfter all, however, facts are in many cases more convincing than\nopinions or theories, and it is a significant fact that those workmen\nwho have come under this system during the past thirty years have\ninvariably been satisfied with the increase in pay, which they have\nreceived, while their employers have been equally pleased with their\nincrease in dividends.\n\nThe writer is one of those who believes that more and more will the\nthird party (the whole people), as it becomes acquainted with the true\nfacts, insist that justice shall be done to all three parties. It will\ndemand the largest efficiency from both employers and employees. It will\nno longer tolerate the type of employer who has his eye on dividends\nalone, who refuses to do his full share of the work and who merely\ncracks his whip over the heads of his workmen and attempts to drive them\ninto harder work for low pay. No more will it tolerate tyranny on the\npart of labor which demands one increase after another in pay and\nshorter hours while at the same time it becomes less instead of more\nefficient.\n\nAnd the means which the writer firmly believes will be adopted to bring\nabout, first, efficiency both in employer and employs and then an\nequitable division of the profits of their joint efforts will be\nscientific management, which has for its sole aim the attainment of\njustice for all three parties through impartial scientific investigation\nof all the elements of the problem. For a time both sides will rebel\nagainst this advance. The workers will resent any interference with\ntheir old rule-of-thumb methods, and the management will resent being\nasked to take on new duties and burdens; but in the end the people\nthrough enlightened public opinion will force the new order of things\nupon both employer and employee.\n\nIt will doubtless be claimed that in all that has been said no new fact\nhas been brought to light that was not known to some one in the past.\nVery likely this is true. Scientific management does not necessarily\ninvolve any great invention, nor the discovery of new or startling\nfacts. It does, however, involve a certain combination of elements which\nhave not existed in the past, namely, old knowledge so collected,\nanalyzed, grouped, and classified into laws and rules that it\nconstitutes a science; accompanied by a complete change in the mental\nattitude of the working men as well as of those on the side of the\nmanagement, toward each other, and toward their respective duties and\nresponsibilities. Also, a new division of the duties between the two\nsides and intimate, friendly cooperation to an extent that is impossible\nunder the philosophy of the old management. And even all of this in many\ncases could not exist without the help of mechanisms which have been\ngradually developed.\n\nIt is no single element, but rather this whole combination, that\nconstitutes scientific management, which may be summarized as:\n\n  Science, not rule of thumb.\n  Harmony, not discord.\n  Cooperation, not individualism.\n  Maximum output, in place of restricted output.\n  The development of each man to his greatest efficiency and prosperity.\n\nThe writer wishes to again state that: \"The time is fast going by for\nthe great personal or individual achievement of any one man standing\nalone and without the help of those around him. And the time is coming\nwhen all great things will be done by that type of cooperation in which\neach man performs the function for which he is best suited, each man\npreserves his own individuality and is supreme in his particular\nfunction, and each man at the same time loses none of his originality\nand proper personal initiative, and yet is controlled by and must work\nharmoniously with many other men.\"\n\nThe examples given above of the increase in output realized under the\nnew management fairly represent the gain which is possible. They do not\nrepresent extraordinary or exceptional cases, and have been selected\nfrom among thousands of similar illustrations which might have been\ngiven.\n\nLet us now examine the good which would follow the general adoption of\nthese principles.\n\nThe larger profit would come to the whole world in general.\n\nThe greatest material gain which those of the present generation have\nover past generations has come from the fact that the average man in\nthis generation, with a given expenditure of effort, is producing two\ntimes, three times, even four times as much of those things that are of\nuse to man as it was possible for the average man in the past to\nproduce. This increase in the productivity of human effort is, of\ncourse, due to many causes, besides the increase in the personal\ndexterity of the man. It is due to the discovery of steam and\nelectricity, to the introduction of machinery, to inventions, great and\nsmall, and to the progress in science and education. But from whatever\ncause this increase in productivity has come, it is to the greater\nproductivity of each individual that the whole country owes its greater\nprosperity.\n\nThose who are afraid that a large increase in the productivity of each\nworkman will throw other men out of work, should realize that the one\nelement more than any other which differentiates civilized from\nuncivilized countries--prosperous from poverty--stricken peoples--is\nthat the average man in the one is five or six times as productive as\nthe other. It is also a fact that the chief cause for the large\npercentage of the unemployed in England (perhaps the most virile nation\nin the world), is that the workmen of England, more than in any other\ncivilized country, are deliberately restricting their output because\nthey are possessed by the fallacy that it is against their best interest\nfor each man to work as hard as he can.\n\nThe general adoption of scientific management would readily in the\nfuture double the productivity of the average man engaged in industrial\nwork. Think of what this means to the whole country. Think of the\nincrease, both in the necessities and luxuries of life, which becomes\navailable for the whole country, of the possibility of shortening the\nhours of labor when this is desirable, and of the increased\nopportunities for education, culture, and recreation which this implies.\nBut while the whole world would profit by this increase in production,\nthe manufacturer and the workman will be far more interested in the\nespecial local gain that comes to them and to the people immediately\naround them. Scientific management will mean, for the employers and the\nworkmen who adopt it--and particularly for those who adopt it first--the\nelimination of almost all causes for dispute and disagreement between\nthem. What constitutes a fair day's work will be a question for\nscientific investigation, instead of a subject to be bargained and\nhaggled over. Soldiering will cease because the object for soldiering\nwill no longer exist. The great increase in wages which accompanies this\ntype of management will largely eliminate the wage question as a source\nof dispute. But more than all other causes, the close, intimate\ncooperation, the constant personal contact between the two sides, will\ntend to diminish friction and discontent. It is difficult for two people\nwhose interests are the same, and who work side by side in accomplishing\nthe same object, all day long, to keep up a quarrel.\n\nThe low cost of production which accompanies a doubling of the output\nwill enable the companies who adopt this management, particularly those\nwho adopt it first, to compete far better than they were able to before,\nand this will so enlarge their markets that their men will have almost\nconstant work even in dull times, and that they will earn larger profits\nat all times.\n\nThis means increase in prosperity and diminution in poverty, not only\nfor their men but for the whole community immediately around them.\n\nAs one of the elements incident to this great gain in output, each\nworkman has been systematically trained to his highest state of\nefficiency, and has been taught to do a higher class of work than he was\nable to do under the old types of management; and at the same time he\nhas acquired a friendly mental attitude toward his employers and his\nwhole working conditions, whereas before a considerable part of his time\nwas spent in criticism, suspicious watchfulness, and sometimes in open\nwarfare. This direct gain to all of those working under the system is\nwithout doubt the most important single element in the whole problem.\n\nIs not the realization of results such as these of far more importance\nthan the solution of most of the problems which are now agitating both\nthe English and American peoples? And is it not the duty of those who\nare acquainted with these facts, to exert themselves to make the whole\ncommunity realize this importance?", "title": "The Principles of Scientific Management"}