{"summary": "The framing story concerns a man who dreams of speaking to Venus about love while she wears furs. The unnamed narrator tells his dreams to a friend, Severin, who tells him how to break him of his fascination with cruel women by reading a manuscript, Memoirs of a Suprasensual Man.\nThis manuscript tells of a man, Severin von Kusiemski, who is so infatuated with a woman, Wanda von Dunajew, that he asks to be her slave, and encourages her to treat him in progressively more degrading ways. At first Wanda does not understand or accede to the request, but after humouring Severin a bit she finds the advantages of the method to be interesting and enthusiastically embraces the idea, although at the same time she disdains Severin for allowing her to do so.\nSeverin describes his feelings during these experiences as suprasensuality. Severin and Wanda travel to Florence. Along the way, Severin takes the generic Russian servant's name of \"Gregor\" and the role of Wanda's servant. In Florence, Wanda treats him brutally as a servant, and recruits a trio of African women to dominate him.\nThe relationship arrives at a crisis when Wanda herself meets a man to whom she would like to submit, a Byronic hero known as Alexis Papadopolis. At the end of the book, Severin, humiliated by Wanda's new lover, loses the desire to submit. He says of Wanda:\n\nThat woman, as nature has created her, and man at present is educating her, is man's enemy. She can only be his slave or his despot, but never his companion. This she can become only when she has the same rights as he and is his equal in education and work.\n\n", "full_text": "Charles Aldarondo, Charles Franks and the Online Distributed\nProofreading Team.\n\n\n\n\n\n\n\n\nVENUS IN FURS\n\n\nOf this book, intended for\nprivate circulation, only\n1225 copies have been\nprinted, and type afterward\ndistributed.\n\n\n\n\nVENUS IN FURS\n\nBy\n\nLEOPOLD VON SACHER-MASOCH\n\n\nTranslated from the German\n\nBy\n\nFERNANDA SAVAGE\n\n\n\n\nINTRODUCTION\n\n\nLeopold von Sacher-Masoch was born in Lemberg, Austrian Galicia, on\nJanuary 27, 1836. He studied jurisprudence at Prague and Graz, and in\n1857 became a teacher at the latter university. He published several\nhistorical works, but soon gave up his academic career to devote\nhimself wholly to literature. For a number of years he edited the\ninternational review, _Auf der Hohe_, at Leipzig, but later removed to\nParis, for he was always strongly Francophile. His last years he spent\nat Lindheim in Hesse, Germany, where he died on March 9, 1895. In 1873\nhe married Aurora von Rumelin, who wrote a number of novels under the\npseudonym of Wanda von Dunajew, which it is interesting to note is the\nname of the heroine of _Venus in Furs_. Her sensational memoirs which\nhave been the cause of considerable controversy were published in 1906.\n\nDuring his career as writer an endless number of works poured from\nSacher-Masoch's pen. Many of these were works of ephemeral journalism,\nand some of them unfortunately pure sensationalism, for economic\nnecessity forced him to turn his pen to unworthy ends.\n\nThere is, however, a residue among his works which has a distinct\nliterary and even greater psychological value. His principal literary\nambition was never completely fulfilled. It was a somewhat\nprogrammatic plan to give a picture of contemporary life in all its\nvarious aspects and interrelations under the general title of the\n_Heritage of Cain_. This idea was probably derived from Balzac's\n_Comedie Humaine_. The whole was to be divided into six subdivisions\nwith the general titles _Love, Property, Money, The State, War,_ and\n_Death_. Each of these divisions in its turn consisted of six novels,\nof which the last was intended to summarize the author's conclusions\nand to present his solution for the problems set in the others.\n\nThis extensive plan remained unachieved, and only the first two parts,\n_Love_ and _Property_, were completed. Of the other sections only\nfragments remain. The present novel, _Venus in Furs_, forms the fifth\nin the series, _Love_.\n\nThe best of Sacher-Masoch's work is characterized by a swift\nnarration and a graphic representation of character and scene and a\nrich humor. The latter has made many of his shorter stories dealing\nwith his native Galicia little masterpieces of local color.\n\nThere is, however, another element in his work which has caused his\nname to become as eponym for an entire series of phenomena at one end\nof the psycho-sexual scale. This gives his productions a peculiar\npsychological value, though it cannot be denied also a morbid tinge\nthat makes them often repellent. However, it is well to remember that\nnature is neither good nor bad, neither altruistic nor egoistic, and\nthat it operates through the human psyche as well as through crystals\nand plants and animals with the same inexorable laws.\n\nSacher-Masoch was the poet of the anomaly now generally known as\n_masochism_. By this is meant the desire on the part of the individual\naffected of desiring himself completely and unconditionally subject to\nthe will of a person of the opposite sex, and being treated by this\nperson as by a master, to be humiliated, abused, and tormented, even\nto the verge of death. This motive is treated in all its innumerable\nvariations. As a creative artist Sacher-Masoch was, of course, on the\nquest for the absolute, and sometimes, when impulses in the human\nbeing assume an abnormal or exaggerated form, there is just for a\nmoment a flash that gives a glimpse of the thing in itself.\n\nIf any defense were needed for the publication of work like\nSacher-Masoch's it is well to remember that artists are the historians\nof the human soul and one might recall the wise and tolerant Montaigne's\nessay _On the Duty of Historians_ where he says, \"One may cover over\nsecret actions, but to be silent on what all the world knows, and things\nwhich have had effects which are public and of so much consequence is an\ninexcusable defect.\"\n\nAnd the curious interrelation between cruelty and sex, again and\nagain, creeps into literature. Sacher-Masoch has not created anything\nnew in this. He has simply taken an ancient motive and developed it\nfrankly and consciously, until, it seems, there is nothing further to\nsay on the subject. To the violent attacks which his books met he\nreplied in a polemical work, _Ueber den Wert der Kritik_.\n\nIt would be interesting to trace the masochistic tendency as it occurs\nthroughout literature, but no more can be done than just to allude to\na few instances. The theme recurs continually in the _Confessions_ of\nJean Jacques Rousseau; it explains the character of the chevalier in\nPrevost's _Manon l'Escault_. Scenes of this nature are found in Zola's\n_Nana_, in Thomas Otway's _Venice Preserved_, in Albert Juhelle's _Les\nPecheurs d'Hommes_, in Dostojevski. In disguised and unrecognized form\nit constitutes the undercurrent of much of the sentimental literature\nof the present day, though in most cases the authors as well as the\nreaders are unaware of the pathological elements out of which their\ncharacters are built.\n\nIn all these strange and troubled waters of the human spirit one might\nwish for something of the serene and simple attitude of the ancient\nworld. Laurent Tailhade has an admirable passage in his _Platres et\nMarbres_, which is well worth reproducing in this connection:\n\n\"Toutefois, les Hellenes, dans, leurs cites de lumiere, de douceur\net d'harmonie, avaient une indulgence qu'on peut nommer scientifique\npour les troubles amoureux de l'esprit. S'ils ne regardaient pas\nl'aliene comme en proie a la visitation d'un dieu (idee orientale et\nfataliste), du moins ils savaient que l'amour est une sorte\nd'envoutement, une folie ou se manifeste l'animosite des puissances\ncosmiques. Plus tard, le christianisme enveloppa les ames de\ntenebres. Ce fut la grande nuit. L'Eglise condamna tout ce qui lui\nparut neuf ou menacant pour les dogmes implacable qui reduisaient le\nmonde en esclavage.\"\n\nAmong Sacher-Masoch's works, _Venus in Furs_ is one of the most\ntypical and outstanding. In spite of melodramatic elements and other\nliterary faults, it is unquestionably a sincere work, written without\nany idea of titillating morbid fancies. One feels that in the hero\nmany subjective elements have been incorporated, which are a\ndisadvantage to the work from the point of view of literature, but on\nthe other hand raise the book beyond the sphere of art, pure and\nsimple, and make it one of those appalling human documents which\nbelong, part to science and part to psychology. It is the confession\nof a deeply unhappy man who could not master his personal tragedy of\nexistence, and so sought to unburden his soul in writing down the\nthings he felt and experienced. The reader who will approach the book\nfrom this angle and who will honestly put aside moral prejudices and\nprepossessions will come away from the perusal of this book with a\ndeeper understanding of this poor miserable soul of ours and a light\nwill be cast into dark places that lie latent in all of us.\n\nSacher-Masoch's works have held an established position in European\nletters for something like half a century, and the author himself was\nmade a chevalier of the Legion of Honor by the French Government in\n1883, on the occasion of his literary jubilee. When several years ago\ncheap reprints were brought out on the Continent and attempts were\nmade by various guardians of morality--they exist in all countries\n--to have them suppressed, the judicial decisions were invariably\nagainst the plaintiff and in favor of the publisher. Are Americans\nchildren that they must be protected from books which any European\nschool-boy can purchase whenever he wishes? However, such seems to be\nthe case, and this translation, which has long been in preparation,\nconsequently appears in a limited edition printed for subscribers\nonly. In another connection Herbert Spencer once used these words:\n\"The ultimate result of shielding men from the effects of folly, is to\nfill the world with fools.\" They have a very pointed application in\nthe case of a work like _Venus in Furs_.\n\nF. S.\n\nAtlantic City\nApril, 1921\n\n\n\n\nVENUS IN FURS\n\n\n\n\n  _\"But the Almighty Lord hath struck him,\n  and hath delivered him into the hands of\n  a woman.\"_\n\n--The Vulgate, Judith, xvi. 7.\n\n\nMy company was charming.\n\nOpposite me by the massive Renaissance fireplace sat Venus; she was\nnot a casual woman of the half-world, who under this pseudonym wages\nwar against the enemy sex, like Mademoiselle Cleopatra, but the real,\ntrue goddess of love.\n\nShe sat in an armchair and had kindled a crackling fire, whose\nreflection ran in red flames over her pale face with its white eyes,\nand from time to time over her feet when she sought to warm them.\n\nHer head was wonderful in spite of the dead stony eyes; it was all\nI could see of her. She had wrapped her marble-like body in a huge\nfur, and rolled herself up trembling like a cat.\n\n\"I don't understand it,\" I exclaimed, \"It isn't really cold any\nlonger. For two weeks past we have had perfect spring weather. You\nmust be nervous.\"\n\n\"Much obliged for your spring,\" she replied with a low stony voice,\nand immediately afterwards sneezed divinely, twice in succession. \"I\nreally can't stand it here much longer, and I am beginning to\nunderstand--\"\n\n\"What, dear lady?\"\n\n\"I am beginning to believe the unbelievable and to understand the\nun-understandable. All of a sudden I understand the Germanic virtue of\nwoman, and German philosophy, and I am no longer surprised that you of\nthe North do not know how to love, haven't even an idea of what love\nis.\"\n\n\"But, madame,\" I replied flaring up, \"I surely haven't given you any\nreason.\"\n\n\"Oh, you--\" The divinity sneezed for the third time, and shrugged\nher shoulders with inimitable grace. \"That's why I have always been\nnice to you, and even come to see you now and then, although I catch\na cold every time, in spite of all my furs. Do you remember the first\ntime we met?\"\n\n\"How could I forget it,\" I said. \"You wore your abundant hair in\nbrown curls, and you had brown eyes and a red mouth, but I recognized\nyou immediately by the outline of your face and its marble-like\npallor--you always wore a violet-blue velvet jacket edged with\nsquirrel-skin.\"\n\n\"You were really in love with the costume, and awfully docile.\"\n\n\"You have taught me what love is. Your serene form of worship let me\nforget two thousand years.\"\n\n\"And my faithfulness to you was without equal!\"\n\n\"Well, as far as faithfulness goes--\"\n\n\"Ungrateful!\"\n\n\"I will not reproach you with anything. You are a divine woman, but\nnevertheless a woman, and like every woman cruel in love.\"\n\n\"What you call cruel,\" the goddess of love replied eagerly, \"is\nsimply the element of passion and of natural love, which is woman's\nnature and makes her give herself where she loves, and makes her love\neverything, that pleases her.\"\n\n\"Can there be any greater cruelty for a lover than the\nunfaithfulness of the woman he loves?\"\n\n\"Indeed!\" she replied. \"We are faithful as long as we love, but you\ndemand faithfulness of a woman without love, and the giving of\nherself without enjoyment. Who is cruel there--woman or man? You of\nthe North in general take love too soberly and seriously. You talk\nof duties where there should be only a question of pleasure.\"\n\n\"That is why our emotions are honorable and virtuous, and our\nrelations permanent.\"\n\n\"And yet a restless, always unsatisfied craving for the nudity of\npaganism,\" she interrupted, \"but that love, which is the highest joy,\nwhich is divine simplicity itself, is not for you moderns, you\nchildren of reflection. It works only evil in you. _As soon as you\nwish to be natural, you become common._ To you nature seems something\nhostile; you have made devils out of the smiling gods of Greece, and\nout of me a demon. You can only exorcise and curse me, or slay\nyourselves in bacchantic madness before my altar. And if ever one of\nyou has had the courage to kiss my red mouth, he makes a barefoot\npilgrimage to Rome in penitential robes and expects flowers to grow\nfrom his withered staff, while under my feet roses, violets, and\nmyrtles spring up every hour, but their fragrance does not agree with\nyou. Stay among your northern fogs and Christian incense; let us\npagans remain under the debris, beneath the lava; do not disinter us.\nPompeii was not built for you, nor our villas, our baths, our temples.\nYou do not require gods. We are chilled in your world.\"\n\nThe beautiful marble woman coughed, and drew the dark sables still\ncloser about her shoulders.\n\n\"Much obliged for the classical lesson,\" I replied, \"but you cannot\ndeny, that man and woman are mortal enemies, in your serene sunlit\nworld as well as in our foggy one. In love there is union into a\nsingle being for a short time only, capable of only one thought, one\nsensation, one will, in order to be then further disunited. And you\nknow this better than I; whichever of the two fails to subjugate will\nsoon feel the feet of the other on his neck--\"\n\n\"And as a rule the man that of the woman,\" cried Madame Venus with\nproud mockery, \"which you know better than I.\"\n\n\"Of course, and that is why I don't have any illusions.\"\n\n\"You mean you are now my slave without illusions, and for that\nreason you shall feel the weight of my foot without mercy.\"\n\n\"Madame!\"\n\n\"Don't you know me yet? Yes, I am _cruel_--since you take so much\ndelight in that word-and am I not entitled to be so? Man is the one\nwho desires, woman the one who is desired. This is woman's entire but\ndecisive advantage. Through his passion nature has given man into\nwoman's hands, and the woman who does not know how to make him her\nsubject, her slave, her toy, and how to betray him with a smile in the\nend is not wise.\"\n\n\"Exactly your principles,\" I interrupted angrily.\n\n\"They are based on the experience of thousands of years,\" she\nreplied ironically, while her white fingers played over the dark fur.\n\"The more devoted a woman shows herself, the sooner the man sobers\ndown and becomes domineering. The more cruelly she treats him and the\nmore faithless she is, the worse she uses him, the more wantonly she\nplays with him, the less pity she shows him, by so much the more will\nshe increase his desire, be loved, worshipped by him. So it has\nalways been, since the time of Helen and Delilah, down to Catherine\nthe Second and Lola Montez.\"\n\n\"I cannot deny,\" I said, \"that nothing will attract a man more than\nthe picture of a beautiful, passionate, cruel, and despotic woman who\nwantonly changes her favorites without scruple in accordance with her\nwhim--\"\n\n\"And in addition wears furs,\" exclaimed the divinity.\n\n\"What do you mean by that?\"\n\n\"I know your predilection.\"\n\n\"Do you know,\" I interrupted, \"that, since we last saw each other,\nyou have grown very coquettish.\"\n\n\"In what way, may I ask?\"\n\n\"In that there is no way of accentuating your white body to greater\nadvantage than by these dark furs, and that--\"\n\nThe divinity laughed.\n\n\"You are dreaming,\" she cried, \"wake up!\" and she clasped my arm\nwith her marble-white hand. \"Do wake up,\" she repeated raucously with\nthe low register of her voice. I opened my eyes with difficulty.\n\nI saw the hand which shook me, and suddenly it was brown as bronze;\nthe voice was the thick alcoholic voice of my cossack servant who\nstood before me at his full height of nearly six feet.\n\n\"Do get up,\" continued the good fellow, \"it is really disgraceful.\"\n\n\"What is disgraceful?\"\n\n\"To fall asleep in your clothes and with a book besides.\" He snuffed\nthe candles which had burned down, and picked up the volume which had\nfallen from my hand, \"with a book by\"--he looked at the title page--\n\"by Hegel. Besides it is high time you were starting for Mr.\nSeverin's who is expecting us for tea.\"\n\n\"A curious dream,\" said Severin when I had finished. He supported\nhis arms on his knees, resting his face in his delicate, finely\nveined hands, and fell to pondering.\n\nI knew that he wouldn't move for a long time, hardly even breathe. This\nactually happened, but I didn't consider his behavior as in any way\nremarkable. I had been on terms of close friendship with him for nearly\nthree years, and gotten used to his peculiarities. For it cannot be\ndenied that he was peculiar, although he wasn't quite the dangerous\nmadman that the neighborhood, or indeed the entire district of Kolomea,\nconsidered him to be. I found his personality not only interesting--and\nthat is why many also regarded me a bit mad--but to a degree\nsympathetic. For a Galician nobleman and land-owner, and considering his\nage--he was hardly over thirty--he displayed surprising sobriety, a\ncertain seriousness, even pedantry. He lived according to a minutely\nelaborated, half-philosophical, half-practical system, like clock-work;\nnot this alone, but also by the thermometer, barometer, aerometer,\nhydrometer, Hippocrates, Hufeland, Plato, Kant, Knigge, and Lord\nChesterfield. But at times he had violent attacks of sudden passion, and\ngave the impression of being about to run with his head right through a\nwall. At such times every one preferred to get out of his way.\n\nWhile he remained silent, the fire sang in the chimney and the large\nvenerable samovar sang; and the ancient chair in which I sat rocking\nto and fro smoking my cigar, and the cricket in the old walls sang\ntoo. I let my eyes glide over the curious apparatus, skeletons of\nanimals, stuffed birds, globes, plaster-casts, with which his room\nwas heaped full, until by chance my glance remained fixed on a\npicture which I had seen often enough before. But to-day, under the\nreflected red glow of the fire, it made an indescribable impression\non me.\n\nIt was a large oil painting, done in the robust full-bodied manner\nof the Belgian school. Its subject was strange enough.\n\nA beautiful woman with a radiant smile upon her face, with abundant\nhair tied into a classical knot, on which white powder lay like a\nsoft hoarfrost, was resting on an ottoman, supported on her left arm.\nShe was nude in her dark furs. Her right hand played with a lash,\nwhile her bare foot rested carelessly on a man, lying before her like\na slave, like a dog. In the sharply outlined, but well-formed\nlinaments of this man lay brooding melancholy and passionate\ndevotion; he looked up to her with the ecstatic burning eye of a\nmartyr. This man, the footstool for her feet, was Severin, but\nbeardless, and, it seemed, some ten years younger.\n\n\"_Venus in Furs_,\" I cried, pointing to the picture. \"That is the way\nI saw her in my dream.\"\n\n\"I, too,\" said Severin, \"only I dreamed my dream with open eyes.\"\n\n\"Indeed?\"\n\n\"It is a tiresome story.\"\n\n\"Your picture apparently suggested my dream,\" I continued. \"But do\ntell me what it means. I can imagine that it played a role in your\nlife, and perhaps a very decisive one. But the details I can only get\nfrom you.\"\n\n\"Look at its counterpart,\" replied my strange friend, without\nheeding my question.\n\nThe counterpart was an excellent copy of Titian's well-known \"Venus\nwith the Mirror\" in the Dresden Gallery.\n\n\"And what is the significance?\"\n\nSeverin rose and pointed with his finger at the fur with which\nTitian garbed his goddess of love.\n\n\"It, too, is a 'Venus in Furs,'\" he said with a slight smile. \"I\ndon't believe that the old Venetian had any secondary intention. He\nsimply painted the portrait of some aristocratic Mesalina, and was\ntactful enough to let Cupid hold the mirror in which she tests her\nmajestic allure with cold satisfaction. He looks as though his task\nwere becoming burdensome enough. The picture is painted flattery.\nLater an 'expert' in the Rococo period baptized the lady with the\nname of Venus. The furs of the despot in which Titian's fair model\nwrapped herself, probably more for fear of a cold than out of\nmodesty, have become a symbol of the tyranny and cruelty that\nconstitute woman's essence and her beauty.\n\n\"But enough of that. The picture, as it now exists, is a bitter\nsatire on our love. Venus in this abstract North, in this icy\nChristian world, has to creep into huge black furs so as not to catch\ncold--\"\n\nSeverin laughed, and lighted a fresh cigarette.\n\nJust then the door opened and an attractive, stoutish, blonde girl\nentered. She had wise, kindly eyes, was dressed in black silk, and\nbrought us cold meat and eggs with our tea. Severin took one of the\nlatter, and decapitated it with his knife.\n\n\"Didn't I tell you that I want them soft-boiled?\" he cried with a\nviolence that made the young woman tremble.\n\n\"But my dear Sevtchu--\" she said timidly.\n\n\"Sevtchu, nothing,\" he yelled, \"you are to obey, obey, do you\nunderstand?\" and he tore the _kantchuk_ [Footnote: A long whip with a\nshort handle.] which was hanging beside the weapons from its hook.\n\nThe woman fled from the chamber quickly and timidly like a doe.\n\n\"Just wait, I'll get you yet,\" he called after her.\n\n\"But Severin,\" I said placing my hand on his arm, \"how can you treat\na pretty young woman thus?\"\n\n\"Look at the woman,\" he replied, blinking humorously with his eyes.\n\"Had I flattered her, she would have cast the noose around my neck,\nbut now, when I bring her up with the _kantchuk_, she adores me.\"\n\n\"Nonsense!\"\n\n\"Nonsense, nothing, that is the way you have to break in women.\"\n\n\"Well, if you like it, live like a pasha in your harem, but don't\nlay down theories for me--\"\n\n\"Why not,\" he said animatedly. \"Goethe's 'you must be hammer or anvil'\nis absolutely appropriate to the relation between man and woman.\nDidn't Lady Venus in your dream prove that to you? Woman's power lies\nin man's passion, and she knows how to use it, if man doesn't\nunderstand himself. He has only one choice: to be the _tyrant_ over or\nthe _slave_ of woman. As soon as he gives in, his neck is under the\nyoke, and the lash will soon fall upon him.\"\n\n\"Strange maxims!\"\n\n\"Not maxims, but experiences,\" he replied, nodding his head, \"_I have\nactually felt the lash_. I am cured. Do you care to know how?\"\n\nHe rose, and got a small manuscript from his massive desk, and put\nit in front of me.\n\n\"You have already asked about the picture. I have long owed you an\nexplanation. Here--read!\"\n\nSeverin sat down by the chimney with his back toward me, and seemed\nto dream with open eyes. Silence had fallen again, and again the fire\nsang in the chimney, and the samovar and the cricket in the old\nwalls. I opened the manuscript and read:\n\nCONFESSIONS OF A SUPERSENSUAL MAN.\n\nThe margin of the manuscript bore as motto a variation of the well-known\nlines from _Faust_:\n\n   \"Thou supersensual sensual wooer\n   A woman leads you by the nose.\"\n   --MEPHISTOPHELES.\n\nI turned the title-page and read: \"What follows has been compiled\nfrom my diary of that period, because it is impossible ever frankly\nto write of one's past, but in this way everything retains its fresh\ncolors, the colors of the present.\"\n\nGogol, the Russian Moliere, says--where? well, somewhere--\"the real\ncomic muse is the one under whose laughing mask tears roll down.\"\n\nA wonderful saying.\n\nSo I have a very curious feeling as I am writing all this down. The\natmosphere seems filled with a stimulating fragrance of flowers,\nwhich overcomes me and gives me a headache. The smoke of the\nfireplace curls and condenses into figures, small gray-bearded\nkokolds that mockingly point their finger at me. Chubby-cheeked\ncupids ride on the arms of my chair and on my knees. I have to smile\ninvoluntarily, even laugh aloud, as I am writing down my adventures.\nYet I am not writing with ordinary ink, but with red blood that drips\nfrom my heart. All its wounds long scarred over have opened and it\nthrobs and hurts, and now and then a tear falls on the paper.\n\nThe days creep along sluggishly in the little Carpathian health-resort.\nYou see no one, and no one sees you. It is boring enough to write idyls.\nI would have leisure here to supply a whole gallery of paintings,\nfurnish a theater with new pieces for an entire season, a dozen\nvirtuosos with concertos, trios, and duos, but--what am I saying--the\nupshot of it all is that I don't do much more than to stretch the\ncanvas, smooth the bow, line the scores. For I am--no false modesty,\nFriend Severin; you can lie to others, but you don't quite succeed any\nlonger in lying to yourself--I am nothing but a dilettante, a dilettante\nin painting, in poetry, in music, and several other of the so-called\nunprofitable arts, which, however, at present secure for their masters\nthe income of a cabinet minister, or even that of a minor potentate.\nAbove all else I am a dilettante in life.\n\nUp to the present I have lived as I have painted and written poetry.\nI never got far beyond the preparation, the plan, the first act, the\nfirst stanza. There are people like that who begin everything, and\nnever finish anything. I am such a one.\n\nBut what am I saying?\n\nTo the business in hand.\n\nI lie in my window, and the miserable little town, which fills me\nwith despondency, really seems infinitely full of poetry. How\nwonderful the outlook upon the blue wall of high mountains interwoven\nwith golden sunlight; mountain-torrents weave through them like\nribbons of silver! How clear and blue the heavens into which\nsnowcapped crags project; how green and fresh the forested slopes;\nthe meadows on which small herds graze, down to the yellow billows\nof grain where reapers stand and bend over and rise up again.\n\nThe house in which I live stands in a sort of park, or forest, or\nwilderness, whatever one wants to call it, and is very solitary.\n\nIts sole inhabitants are myself, a widow from Lemberg, and Madame\nTartakovska, who runs the house, a little old woman, who grows older\nand smaller each day. There are also an old dog that limps on one\nleg, and a young cat that continually plays with a ball of yarn. This\nball of yarn, I believe, belongs to the widow.\n\nShe is said to be really beautiful, this widow, still very young,\ntwenty-four at the most, and very rich. She dwells in the first story,\nand I on the ground floor. She always keeps the green blinds drawn, and\nhas a balcony entirely overgrown with green climbing-plants. I for my\npart down below have a comfortable, intimate arbor of honeysuckle, in\nwhich I read and write and paint and sing like a bird among the twigs. I\ncan look up on the balcony. Sometimes I actually do so, and then from\ntime to time a white gown gleams between the dense green network.\n\nReally the beautiful woman up there doesn't interest me very much, for I\nam in love with someone else, and terribly unhappy at that; far more\nunhappy than the Knight of Toggenburg or the Chevalier in Manon\nl'Escault, because the object of my adoration is of stone.\n\nIn the garden, in the tiny wilderness, there is a graceful little\nmeadow on which a couple of deer graze peacefully. On this meadow is\na stone statue of Venus, the original of which, I believe, is in\nFlorence. This Venus is the most beautiful woman I have ever seen in\nall my life.\n\nThat, however, does not signify much, for I have seen few beautiful\nwomen, or rather few women at all. In love too, I am a dilettante who\nnever got beyond the preparation, the first act.\n\nBut why talk in superlatives, as if something that is beautiful\ncould be surpassed?\n\nIt is sufficient to say that this Venus is beautiful. I love her\npassionately with a morbid intensity; madly as one can only love a\nwoman who never responds to our love with anything but an eternally\nuniform, eternally calm, stony smile. I literally adore her.\n\nI often lie reading under the leafy covering of a young birch when\nthe sun broods over the forest. Often I visit that cold, cruel\nmistress of mine by night and lie on my knees before her, with the\nface pressed against the cold pedestal on which her feet rest, and\nmy prayers go up to her.\n\nThe rising moon, which just now is waning, produces an indescribable\neffect. It seems to hover among the trees and submerges the meadow\nin its gleam of silver. The goddess stands as if transfigured, and\nseems to bathe in the soft moonlight.\n\nOnce when I was returning from my devotions by one of the walks\nleading to the house, I suddenly saw a woman's figure, white as\nstone, under the illumination of the moon and separated from me\nmerely by a screen of trees. It seemed as if the beautiful woman of\nmarble had taken pity on me, become alive, and followed me. I was\nseized by a nameless fear, my heart threatened to burst, and instead--\n\nWell, I am a dilettante. As always, I broke down at the second\nstanza; rather, on the contrary, I did not break down, but ran away\nas fast as my legs would carry me.\n\n       *       *       *       *       *\n\nWhat an accident! Through a Jew, dealing in photographs I secured a\npicture of my ideal. It is a small reproduction of Titian's \"Venus\nwith the Mirror.\" What a woman! I want to write a poem, but instead,\nI take the reproduction, and write on it: _Venus in Furs_.\n\nYou are cold, while you yourself fan flames. By all means wrap\nyourself in your despotic furs, there is no one to whom they are more\nappropriate, cruel goddess of love and of beauty!--After a while I add\na few verses from Goethe, which I recently found in his paralipomena\nto _Faust_.\n\n  TO AMOR\n\n  \"The pair of wings a fiction are,\n   The arrows, they are naught but claws,\n   The wreath conceals the little horns,\n   For without any doubt he is\n   Like all the gods of ancient Greece\n   Only a devil in disguise.\"\n\nThen I put the picture before me on my table, supporting it with a\nbook, and looked at it.\n\nI was enraptured and at the same time filled with a strange fear by\nthe cold coquetry with which this magnificent woman draped her charms\nin her furs of dark sable; by the severity and hardness which lay in\nthis cold marble-like face. Again I took my pen in hand, and wrote\nthe following words:\n\n\"To love, to be loved, what happiness! And yet how the glamour of\nthis pales in comparison with the tormenting bliss of worshipping a\nwoman who makes a plaything out of us, of being the slave of a\nbeautiful tyrant who treads us pitilessly underfoot. Even Samson, the\nhero, the giant, again put himself into the hands of Delilah, even\nafter she had betrayed him, and again she betrayed him, and the\nPhilistines bound him and put out his eyes which until the very end\nhe kept fixed, drunken with rage and love, upon the beautiful\nbetrayer.\"\n\nI was breakfasting in my honey-suckle arbor, and reading in the Book\nof Judith. I envied the hero Holofernes because of the regal woman\nwho cut off his head with a sword, and because of his beautiful\nsanguinary end.\n\n\"The almighty Lord hath struck him, and hath delivered him into the\nhands of a woman.\"\n\nThis sentence strangely impressed me.\n\nHow ungallant these Jews are, I thought. And their God might choose\nmore becoming expressions when he speaks of the fair sex.\n\n\"The almighty Lord hath struck him, and hath delivered him into the\nhands of a woman,\" I repeated to myself. What shall I do, so that He\nmay punish me?\n\nHeaven preserve us! Here comes the housekeeper, who has again\ndiminished somewhat in size overnight. And up there among the green\ntwinings and garlandings the white gown gleams again. Is it Venus,\nor the widow?\n\nThis time it happens to be the widow, for Madame Tartakovska makes\na courtesy, and asks me in her name for something to read. I run to\nmy room, and gather together a couple of volumes.\n\nLater I remember that my picture of Venus is in one of them, and now\nit and my effusions are in the hands of the white woman up there\ntogether. What will she say?\n\nI hear her laugh.\n\nIs she laughing at me?\n\nIt is full moon. It is already peering over the tops of the low\nhemlocks that fringe the park. A silvery exhalation fills the\nterrace, the groups of trees, all the landscape, as far as the eye\ncan reach; in the distance it gradually fades away, like trembling\nwaters.\n\nI cannot resist. I feel a strange urge and call within me. I put on\nmy clothes again and go out into the garden.\n\nSome power draws me toward the meadow, toward her, who is my\ndivinity and my beloved.\n\nThe night is cool. I feel a slight chill. The atmosphere is heavy\nwith the odor of flowers and of the forest. It intoxicates.\n\nWhat solemnity! What music round about! A nightingale sobs. The\nstars quiver very faintly in the pale-blue glamour. The meadow seems\nsmooth, like a mirror, like a covering of ice on a pond.\n\nThe statue of Venus stands out august and luminous.\n\nBut--what has happened? From the marble shoulders of the goddess a\nlarge dark fur flows down to her heels. I stand dumbfounded and stare\nat her in amazement; again an indescribable fear seizes hold of me\nand I take flight.\n\nI hasten my steps, and notice that I have missed the main path. As\nI am about to turn aside into one of the green walks I see Venus\nsitting before me on a stone bench, not the beautiful woman of\nmarble, but the goddess of love herself with warm blood and throbbing\npulses. She has actually come to life for me, like the statue that\nbegan to breathe for her creator. Indeed, the miracle is only half\ncompleted. Her white hair seems still to be of stone, and her white\ngown shimmers like moonlight, or is it satin? From her shoulders the\ndark fur flows. But her lips are already reddening and her cheeks\nbegin to take color. Two diabolical green rays out of her eyes fall\nupon me, and now she laughs.\n\nHer laughter is very mysterious, very--I don't know. It cannot be\ndescribed, it takes my breath away. I flee further, and after every\nfew steps I have to pause to take breath. The mocking laughter\npursues me through the dark leafy paths, across light open spaces,\nthrough the thicket where only single moonbeams can pierce. I can no\nlonger find my way, I wander about utterly confused, with cold drops\nof perspiration on the forehead.\n\nFinally I stand still, and engage in a short monologue.\n\nIt runs--well--one is either very polite to one's self or very rude.\n\nI say to myself:\n\n\"Donkey!\"\n\nThis word exercises a remarkable effect, like a magic formula, which\nsets me free and makes me master of myself.\n\nI am perfectly quiet in a moment.\n\nWith considerable pleasure I repeat: \"Donkey!\"\n\nNow everything is perfectly clear and distinct before my eyes again.\nThere is the fountain, there the alley of box-wood, there the house\nwhich I am slowly approaching.\n\nYet--suddenly the appearance is here again. Behind the green screen\nthrough which the moonlight gleams so that it seems embroidered with\nsilver, I again see the white figure, the woman of stone whom I\nadore, whom I fear and flee.\n\nWith a couple of leaps I am within the house and catch my breath and\nreflect.\n\nWhat am I really, a little dilettante or a great big donkey?\n\nA sultry morning, the atmosphere is dead, heavily laden with odors,\nyet stimulating. Again I am sitting in my honey-suckle arbor, reading\nin the Odyssey about the beautiful witch who transformed her admirers\ninto beasts. A wonderful picture of antique love.\n\nThere is a soft rustling in the twigs and blades and the pages of my\nbook rustle and on the terrace likewise there is a rustling.\n\nA woman's dress--\n\nShe is there--Venus--but without furs--No, this time it is merely\nthe widow--and yet--Venus-oh, what a woman!\n\nAs she stands there in her light white morning gown, looking at me, her\nslight figure seems full of poetry and grace. She is neither large, nor\nsmall; her head is alluring, piquant--in the sense of the period of the\nFrench marquises--rather than formally beautiful. What enchantment and\nsoftness, what roguish charm play about her none too small mouth! Her\nskin is so infinitely delicate, that the blue veins show through\neverywhere; even through the muslin covering her arms and bosom. How\nabundant her red hair-it is red, not blonde or golden-yellow--how\ndiabolically and yet tenderly it plays around her neck! Now her eyes\nmeet mine like green lightnings--they are green, these eyes of hers,\nwhose power is so indescribable--green, but as are precious stones, or\ndeep unfathomable mountain lakes.\n\nShe observes my confusion, which has even made me discourteous, for I\nhave remained seated and still have my cap on my head.\n\nShe smiles roguishly.\n\nFinally I rise and bow to her. She comes closer, and bursts out into\na loud, almost childlike laughter. I stammer, as only a little\ndilettante or great big donkey can do on such an occasion.\n\nThus our acquaintance began.\n\nThe divinity asks for my name, and mentions her own.\n\nHer name is Wanda von Dunajew.\n\nAnd she is actually my Venus.\n\n\"But madame, what put the idea into your head?\"\n\n\"The little picture in one of your books--\"\n\n\"I had forgotten about it.\"\n\n\"The curious notes on its back--\"\n\n\"Why curious?\"\n\nShe looked at me.\n\n\"I have always wanted to know a real dreamer some time--for the sake\nof the change--and you seem one of the maddest of the tribe.\"\n\n\"Dear lady--in fact--\" Again I fell victim to an odious, asinine\nstammering, and in addition blushed in a way that might have been\nappropriate for a youngster of sixteen, but not for me, who was\nalmost a full ten years older--\n\n\"You were afraid of me last night.\"\n\n\"Really--of course--but won't you sit down?\"\n\nShe sat down, and enjoyed my embarrassment--for actually I was even\nmore afraid of her now in the full light of day. A delightful\nexpression of contempt hovered about her upper lip.\n\n\"You look at love, and especially woman,\" she began, \"as something\nhostile, something against which you put up a defense, even if\nunsuccessfully. You feel that their power over you gives you a\nsensation of pleasurable torture, of pungent cruelty. This is a\ngenuinely modern point of view.\"\n\n\"You don't share it?\"\n\n\"I do not share it,\" she said quickly and decisively, shaking her\nhead, so that her curls flew up like red flames.\n\n\"The ideal which I strive to realize in my life is the serene\nsensuousness of the Greeks--pleasure without pain. I do not believe\nin the kind of love which is preached by Christianity, by the\nmoderns, by the knights of the spirit. Yes, look at me, I am worse\nthan a heretic, I am a pagan.\n\n  'Doest thou imagine long the goddess of love took counsel\n   When in Ida's grove she was pleased with the hero Achilles?'\n\n\"These lines from Goethe's _Roman Elegy_ have always delighted me.\n\n\"In nature there is only the love of the heroic age, 'when gods and\ngoddesses loved.' At that time 'desire followed the glance, enjoyment\ndesire.' All else is factitious, affected, a lie. Christianity, whose\ncruel emblem, the cross, has always had for me an element of the\nmonstrous, brought something alien and hostile into nature and its\ninnocent instincts.\n\n\"The battle of the spirit with the senses is the gospel of modern\nman. I do not care to have a share in it.\"\n\n\"Yes, Mount Olympus would be the place for you, madame,\" I replied,\n\"but we moderns can no longer support the antique serenity, least of\nall in love. The idea of sharing a woman, even if it were an Aspasia,\nwith another revolts us. We are jealous as is our God. For example,\nwe have made a term abuse out of the name of the glorious Phryne.\n\n\"We prefer one of Holbein's meagre, pallid virgins, which is wholly\nours to an antique Venus, no matter how divinely beautiful she is,\nbut who loves Anchises to-day, Paris to-morrow, Adonis the day after.\nAnd if nature triumphs in us so that we give our whole glowing,\npassionate devotion to such a woman, her serene joy of life appears\nto us as something demonic and cruel, and we read into our happiness\na sin which we must expiate.\"\n\n\"So you too are one of those who rave about modern women, those\nmiserable hysterical feminine creatures who don't appreciate a real\nman in their somnambulistic search for some dream-man and masculine\nideal. Amid tears and convulsions they daily outrage their Christian\nduties; they cheat and are cheated; they always seek again and choose\nand reject; they are never happy, and never give happiness. They\naccuse fate instead of calmly confessing that they want to love and\nlive as Helen and Aspasia lived. Nature admits of no permanence in\nthe relation between man and woman.\"\n\n\"But, my dear lady--\"\n\n\"Let me finish. It is only man's egoism which wants to keep woman\nlike some buried treasure. All endeavors to introduce permanence in\nlove, the most changeable thing in this changeable human existence,\nhave gone shipwreck in spite of religious ceremonies, vows, and\nlegalities. Can you deny that our Christian world has given itself\nover to corruption?\"\n\n\"But--\"\n\n\"But you are about to say, the individual who rebels against the\narrangements of society is ostracized, branded, stoned. So be it. I\nam willing to take the risk; my principles are very pagan. I will\nlive my own life as it pleases me. I am willing to do without your\nhypocritical respect; I prefer to be happy. The inventors of the\nChristian marriage have done well, simultaneously to invent\nimmortality. I, however, have no wish to live eternally. When with\nmy last breath everything as far as Wanda von Dunajew is concerned\ncomes to an end here below, what does it profit me whether my pure\nspirit joins the choirs of angels, or whether my dust goes into the\nformation of new beings? Shall I belong to one man whom I don't love,\nmerely because I have once loved him? No, I do not renounce; I love\neveryone who pleases me, and give happiness to everyone who loves me.\nIs that ugly? No, it is more beautiful by far, than if cruelly I\nenjoy the tortures, which my beauty excites, and virtuously reject\nthe poor fellow who is pining away for me. I am young, rich, and\nbeautiful, and I live serenely for the sake of pleasure and\nenjoyment.\"\n\nWhile she was speaking her eyes sparkled roguishly, and I had taken\nhold of her hands without exactly knowing what to do with them, but\nbeing a genuine dilettante I hastily let go of them again.\n\n\"Your frankness,\" I said, \"delights me, and not it alone--\"\n\nMy confounded dilettantism again throttled me as though there were\na rope around my neck.\n\n\"You were about to say--\"\n\n\"I was about to say--I was--I am sorry--I interrupted you.\"\n\n\"How, so?\"\n\nA long pause. She is doubtless engaging in a monologue, which\ntranslated into my language would be comprised in the single word,\n\"donkey.\"\n\n\"If I may ask,\" I finally began, \"how did you arrive at these--these\nconclusions?\"\n\n\"Quite simply, my father was an intelligent man. From my cradle onward\nI was surrounded by replicas of ancient art; at ten years of age I\nread _Gil Blas_, at twelve _La Pucelle_. Where others had\nHop-o'-my-thumb, Bluebeard, Cinderella, as childhood friends, mine\nwere Venus and Apollo, Hercules and Lackoon. My husband's personality\nwas filled with serenity and sunlight. Not even the incurable illness\nwhich fell upon him soon after our marriage could long cloud his brow.\nOn the very night of his death he took me in his arms, and during the\nmany months when he lay dying in his wheel chair, he often said\njokingly to me: 'Well, have you already picked out a lover?' I blushed\nwith shame. 'Don't deceive me,' he added on one occasion, 'that would\nseem ugly to me, but pick out an attractive lover, or preferably\nseveral. You are a splendid woman, but still half a child, and you\nneed toys.'\n\n\"I suppose, I hardly need tell you that during his life time I had\nno lover; but it was through him that I have become what I am, a\nwoman of Greece.\"\n\n\"A goddess,\" I interrupted.\n\n\"Which one,\" she smiled.\n\n\"Venus.\"\n\nShe threatened me with her finger and knitted her brows. \"Perhaps,\neven a 'Venus in Furs.' Watch out, I have a large, very large fur,\nwith which I could cover you up entirely, and I have a mind to catch\nyou in it as in a net.\"\n\n\"Do you believe,\" I said quickly, for an idea which seemed good, in\nspite of its conventionality and triteness, flashed into my head, \"do\nyou believe that your theories could be carried into execution at the\npresent time, that Venus would be permitted to stray with impunity\namong our railroads and telegraphs in all her undraped beauty and\nserenity?\"\n\n\"_Undraped_, of course not, but in furs,\" she replied smiling, \"would\nyou care to see mine?\"\n\n\"And then--\"\n\n\"What then?\"\n\n\"Beautiful, free, serene, and happy human beings, such as the Greeks\nwere, are only possible when it is permitted to have _slaves_ who will\nperform the prosaic tasks of every day for them and above all else\nlabor for them.\"\n\n\"Of course,\" she replied playfully, \"an Olympian divinity, such as\nI am, requires a whole army of slaves. Beware of me!\"\n\n\"Why?\"\n\nI myself was frightened at the hardiness with which I uttered this\n\"why\"; it did not startle her in the least.\n\nShe drew back her lips a little so that her small white teeth became\nvisible, and then said lightly, as if she were discussing some\ntrifling matter, \"Do you want to be my slave?\"\n\n\"There is no equality in love,\" I replied solemnly. \"Whenever it is\na matter of choice for me of ruling or being ruled, it seems much\nmore satisfactory to me to be the slave of a beautiful woman. But\nwhere shall I find the woman who knows how to rule, calmly, full of\nself-confidence, even harshly, and not seek to gain her power by\nmeans of petty nagging?\"\n\n\"Oh, that might not be so difficult.\"\n\n\"You think--\"\n\n\"I--for instance--\" she laughed and leaned far back--\"I have a real\ntalent for despotism--I also have the necessary furs--but last night\nyou were really seriously afraid of me!\"\n\n\"Quite seriously.\"\n\n\"And now?\"\n\n\"Now, I am more afraid of you than ever!\"\n\nWe are together every day, I and--Venus; we are together a great\ndeal. We breakfast in my honey-suckle arbor, and have tea in her\nlittle sitting-room. I have an opportunity to unfold all my small,\nvery small talents. Of what use would have been my study of all the\nvarious sciences, my playing at all the arts, if I were unable in the\ncase of a pretty, little woman--\n\nBut this woman is by no means little; in fact she impresses me\ntremendously. I made a drawing of her to-day, and felt particularly\nclearly, how inappropriate the modern way of dressing is for a\ncameo-head like hers. The configuration of her face has little of the\nRoman, but much of the Greek.\n\nSometimes I should like to paint her as Psyche, and then again as\nAstarte. It depends upon the expression in her eyes, whether it is\nvaguely dreamy, or half-consuming, filled with tired desire.\nShe, however, insists that it be a portrait-likeness.\n\nI shall make her a present of furs.\n\nHow could I have any doubts? If not for her, for whom would princely\nfurs be suitable?\n\n       *       *       *       *       *\n\nI was with her yesterday evening, reading the _Roman Elegies_ to her.\nThen I laid the book aside, and improvised something for her. She\nseemed pleased; rather more than that, she actually hung upon my\nwords, and her bosom heaved.\n\nOr was I mistaken?\n\nThe rain beat in melancholy fashion on the window-panes, the fire\ncrackled in the fireplace in wintery comfort. I felt quite at home\nwith her, and for a moment lost all my fear of this beautiful woman;\nI kissed her hand, and she permitted it.\n\nThen I sat down at her feet and read a short poem I had written for\nher.\n\n  VENUS IN FURS.\n\n  \"Place thy foot upon thy slave,\n  Oh thou, half of hell, half of dreams;\n  Among the shadows, dark and grave,\n  Thy extended body softly gleams.\"\n\nAnd--so on. This time I really got beyond the first stanza. At her\nrequest I gave her the poem in the evening, keeping no copy. And now\nas I am writing this down in my diary I can only remember the first\nstanza.\n\nI am filled with a very curious sensation. I don't believe that I am\nin love with Wanda; I am sure that at our first meeting, I felt\nnothing of the lightning-like flashes of passion. But I feel how her\nextraordinary, really divine beauty is gradually winding magic snares\nabout me. It isn't any spiritual sympathy which is growing in me; it\nis a physical subjection, coming on slowly, but for that reason more\nabsolutely.\n\nI suffer under it more and more each day, and she--she merely smiles.\n\n       *       *       *       *       *\n\nWithout any provocation she suddenly said to me to-day: \"You\ninterest me. Most men are very commonplace, without verve or poetry.\nIn you there is a certain depth and capacity for enthusiasm and a\ndeep seriousness, which delight me. I might learn to love you.\"\n\nAfter a short but severe shower we went out together to the meadow\nand the statue of Venus. All about us the earth steamed; mists rose\nup toward heaven like clouds of incense; a shattered rainbow still\nhovered in the air. The trees were still shedding drops, but sparrows\nand finches were already hopping from twig to twig. They are\ntwittering gaily, as if very much pleased at something. Everything\nis filled with a fresh fragrance. We cannot cross the meadow for it\nis still wet. In the sunlight it looks like a small pool, and the\ngoddess of love seems to rise from the undulations of its mirror-like\nsurface. About her head a swarm of gnats is dancing, which,\nilluminated by the sun, seem to hover above her like an aureole.\n\nWanda is enjoying the lovely scene. As all the benches along the\nwalk are still wet, she supports herself on my arm to rest a while.\nA soft weariness permeates her whole being, her eyes are half closed;\nI feel the touch of her breath on my cheek.\n\nHow I managed to get up courage enough I really don't know, but I\ntook hold of her hand, asking,\n\n\"Could you love me?\"\n\n\"Why not,\" she replied, letting her calm, clear look rest upon me,\nbut not for long.\n\nA moment later I am kneeling before her, pressing my burning face\nagainst the fragrant muslin of her gown.\n\n\"But Severin--this isn't right,\" she cried.\n\nBut I take hold of her little foot, and press my lips upon it.\n\n\"You are getting worse and worse!\" she cried. She tore herself free,\nand fled rapidly toward the house, the while her adorable slipper\nremained in my hand.\n\nIs it an omen?\n\n       *       *       *       *       *\n\nAll day long I didn't dare to go near her. Toward evening as I was\nsitting in my arbor her gay red head peered suddenly through the\ngreenery of her balcony. \"Why don't you come up?\" he called down\nimpatiently.\n\nI ran upstairs, and at the top lost courage again. I knocked very\nlightly. She didn't say come-in, but opened the door herself, and\nstood on the threshold.\n\n\"Where is my slipper?\"\n\n\"It is--I have--I want,\" I stammered.\n\n\"Get it, and then we will have tea together, and chat.\"\n\nWhen I returned, she was engaged in making tea. I ceremoniously\nplaced the slipper on the table, and stood in the corner like a child\nawaiting punishment.\n\nI noticed that her brows were slightly contracted, and there was an\nexpression of hardness and dominance about her lips which delighted\nme.\n\nAll of a sudden she broke out laughing.\n\n\"So--you are really in love--with me?\"\n\n\"Yes, and I suffer more from it than you can imagine?\"\n\n\"You suffer?\" she laughed again.\n\nI was revolted, mortified, annihilated, but all this was quite\nuseless.\n\n\"Why?\" she continued, \"I like you, with all my heart.\"\n\nShe gave me her hand, and looked at me in the friendliest fashion.\n\n\"And will you be my wife?\"\n\nWanda looked at me--how did she look at me? I think first of all\nwith surprise, and then with a tinge of irony.\n\n\"What has given you so much courage, all at once?\"\n\n\"Courage?\"\n\n\"Yes courage, to ask anyone to be your wife, and me in particular?\"\nShe lifted up the slipper. \"Was it through a sudden friendship with\nthis? But joking aside. Do you really wish to marry me?\"\n\n\"Yes.\"\n\n\"Well, Severin, that is a serious matter. I believe, you love me,\nand I care for you too, and what is more important each of us finds\nthe other interesting. There is no danger that we would soon get\nbored, but, you know, I am a fickle person, and just for that reason\nI take marriage seriously. If I assume obligations, I want to be able\nto meet them. But I am afraid--no--it would hurt you.\"\n\n\"Please be perfectly frank with me,\" I replied.\n\n\"Well then honestly, I don't believe I could love a man longer than--\"\nShe inclined her head gracefully to one side and mused.\n\n\"A year.\"\n\n\"What do you imagine--a month perhaps.\"\n\n\"Not even me?\"\n\n\"Oh you--perhaps two.\"\n\n\"Two months!\" I exclaimed.\n\n\"Two months is very long.\"\n\n\"You go beyond antiquity, madame.\"\n\n\"You see, you cannot stand the truth.\"\n\nWanda walked across the room and leaned back against the fireplace,\nwatching me and resting one of her arms on the mantelpiece.\n\n\"What shall I do with you?\" she began anew.\n\n\"Whatever you wish,\" I replied with resignation, \"whatever will give\nyou pleasure.\"\n\n\"How illogical!\" she cried, \"first you want to make me your wife,\nand then you offer yourself to me as something to toy with.\"\n\n\"Wanda--I love you.\"\n\n\"Now we are back to the place where we started. You love me, and\nwant to make me your wife, but I don't want to enter into a new\nmarriage, because I doubt the permanence of both my and your\nfeelings.\"\n\n\"But if I am willing to take the risk with you?\" I replied.\n\n\"But it also depends on whether I am willing to risk it with you,\"\nshe said quietly. \"I can easily imagine belonging to one man for my\nentire life, but he would have to be a whole man, a man who would\ndominate me, who would subjugate me by his inate strength, do you\nunderstand? And every man--I know this very well--as soon as he falls\nin love becomes weak, pliable, ridiculous. He puts himself into the\nwoman's hands, kneels down before her. The only man whom I could love\npermanently would be he before whom I should have to kneel. I've gotten\nto like you so much, however, that I'll try it with you.\"\n\nI fell down at her feet.\n\n\"For heaven's sake, here you are kneeling already,\" she said\nmockingly. \"You are making a good beginning.\" When I had risen again\nshe continued, \"I will give you a year's time to win me, to convince\nme that we are suited to each other, that we might live together. If\nyou succeed, I will become your wife, and a wife, Severin, who will\nconscientiously and strictly perform all her duties. During this year\nwe will live as though we were married--\"\n\nMy blood rose to my head.\n\nIn her eyes too there was a sudden flame--\n\n\"We will live together,\" she continued, \"share our daily life, so that\nwe may find out whether we are really fitted for each other. _I grant\nyou all the rights of a husband, of a lover, of a friend._ Are you\nsatisfied?\"\n\n\"I suppose, I'll have to be?\"\n\n\"You don't have to.\"\n\n\"Well then, I want to--\"\n\n\"Splendid. That is how a man speaks. Here is my hand.\"\n\n       *       *       *       *       *\n\nFor ten days I have been with her every hour, except at night. All\nthe time I was allowed to look into her eyes, hold her hands, listen\nto what she said, accompany her wherever she went.\n\nMy love seems to me like a deep, bottomless abyss, into which I\nsubside deeper and deeper. There is nothing now which could save me\nfrom it.\n\nThis afternoon we were resting on the meadow at the foot of the\nVenus-statue. I plucked flowers and tossed them into her lap; she\nwound them into wreaths with which we adorned our goddess.\n\nSuddenly Wanda looked at me so strangely that my senses became\nconfused and passion swept over my head like a conflagration. Losing\ncommand over myself, I threw my arms about her and clung to her lips,\nand she--she drew me close to her heaving breast.\n\n\"Are you angry?\" I then asked her.\n\n\"I am never angry at anything that is natural--\" she replied, \"but\n_I_ am afraid you suffer.\"\n\n\"Oh, I am suffering frightfully.\"\n\n\"Poor friend!\" she brushed my disordered hair back from my fore-head. \"I\nhope it isn't through any fault of mine.\"\n\n\"No--\" I replied,--\"and yet my love for you has become a sort of\nmadness. The thought that I might lose you, perhaps actually lose\nyou, torments me day and night.\"\n\n\"But you don't yet possess me,\" said Wanda, and again she looked at\nme with that vibrant, consuming expression, which had already once\nbefore carried me away. Then she rose, and with her small transparent\nhands placed a wreath of blue anemones upon the ringletted white head\nof Venus. Half against my will I threw my arm around her body.\n\n\"I can no longer live without you, oh wonderful woman,\" I said.\n\"Believe me, believe only this once, that this time it is not a\nphrase, not a thing of dreams. I feel deep down in my innermost soul,\nthat my life belongs inseparably with yours. If you leave me, I shall\nperish, go to pieces.\"\n\n\"That will hardly be necessary, for I love you,\" she took hold of my\nchin, \"you foolish man!\"\n\n\"But you will be mine only under conditions, while I belong to you\nunconditionally--\"\n\n\"That isn't wise, Severin,\" she replied almost with a start. \"Don't\nyou know me yet, do you absolutely refuse to know me? I am good when\nI am treated seriously and reasonably, but when you abandon yourself\ntoo absolutely to me, I grow arrogant--\"\n\n\"So be it, be arrogant, be despotic,\" I cried in the fulness of\nexaltation, \"only be mine, mine forever.\" I lay at her feet,\nembracing her knees.\n\n\"Things will end badly, my friend,\" she said soberly, without moving.\n\n\"It shall never end,\" I cried excitedly, almost violently. \"Only death\nshall part us. If you cannot be mine, all mine and for always, then _I\nwant to be your slave_, serve you, suffer everything from you, if only\nyou won't drive me away.\"\n\n\"Calm yourself,\" she said, bending down and kissing my forehead, \"I\nam really very fond of you, but your way is not the way to win and\nhold me.\"\n\n\"I want to do everything, absolutely everything, that you want, only\nnot to lose you,\" I cried, \"only not that, I cannot bear the thought.\"\n\n\"Do get up.\"\n\nI obeyed.\n\n\"You are a strange person,\" continued Wanda. \"You wish to possess me\nat any price?\"\n\n\"Yes, at any price.\"\n\n\"But of what value, for instance, would that be?\"--She pondered; a\nlurking uncanny expression entered her eyes--\"If I no longer loved\nyou, if I belonged to another.\"\n\nA shudder ran through me. I looked at her She stood firmly and\nconfident before me, and her eyes disclosed a cold gleam.\n\n\"You see,\" she continued, \"the very thought frightens you.\" A\nbeautiful smile suddenly illuminated her face.\n\n\"I feel a perfect horror, when I imagine, that the woman I love and\nwho has responded to my love could give herself to another regardless\nof me. But have I still a choice? If I love such a woman, even unto\nmadness, shall I turn my back to her and lose everything for the sake\nof a bit of boastful strength; shall I send a bullet through my\nbrains? I have two ideals of woman. If I cannot obtain the one that\nis noble and simple, the woman who will faithfully and truly share\nmy life, well then I don't want anything half-way or lukewarm. Then\nI would rather be subject to a woman without virtue, fidelity, or pity.\nSuch a woman in her magnificent selfishness is likewise an ideal. If\nI am not permitted to enjoy the happiness of love, fully and wholly,\nI want to taste its pains and torments to the very dregs; I want to\nbe maltreated and betrayed by the woman I love, and the more cruelly\nthe better. This too is a luxury.\"\n\n\"Have you lost your senses,\" cried Wanda.\n\n\"I love you with all my soul,\" I continued, \"with all my senses, and\nyour presence and personality are absolutely essential to me, if I\nam to go on living. Choose between my ideals. Do with me what you will,\nmake of me your husband or your slave.\"\n\n\"Very well,\" said Wanda, contracting her small but strongly arched\nbrows, \"it seems to me it would be rather entertaining to have a man,\nwho interests me and loves me, completely in my power; at least I\nshall not lack pastime. You were imprudent enough to leave the choice\nto me. Therefore I choose; I want you to be my slave, I shall make\na plaything for myself out of you!\"\n\n\"Oh, please do,\" I cried half-shuddering, half-enraptured. \"If the\nfoundation of marriage depends on equality and agreement, it is\nlikewise true that the greatest passions rise out of opposites. We\nare such opposites, almost enemies. That is why my love is part hate,\npart fear. In such a relation only one can be hammer and the other\nanvil. I wish to be the anvil. I cannot be happy when I look down\nupon the woman I love. I want to adore a woman, and this I can only\ndo when she is cruel towards me.\"\n\n\"But, Severin,\" replied Wanda, almost angrily, \"do you believe me\ncapable of maltreating a man who loves me as you do, and whom I love?\"\n\n\"Why not, if I adore you the more on this account? _It is possible to\nlove really only that which stands above us,_ a woman, who through her\nbeauty, temperament, intelligence, and strength of will subjugates us\nand becomes a despot over us.\"\n\n\"Then that which repels others, attracts you.\"\n\n\"Yes. That is the strange part of me.\"\n\n\"Perhaps, after all, there isn't anything so very unique or strange\nin all your passions, for who doesn't love beautiful furs? And\neveryone knows and feels how closely sexual love and cruelty are\nrelated.\"\n\n\"But in my case all these elements are raised to their highest\ndegree,\" I replied.\n\n\"In other words, reason has little power over you, and you are by\nnature, soft, sensual, yielding.\"\n\n\"Were the martyrs also soft and sensual by nature?\"\n\n\"The martyrs?\"\n\n\"On the contrary, they were _supersensual men,_ who found enjoyment in\nsuffering. They sought out the most frightful tortures, even death\nitself, as others seek joy, and as they were, so am I--_supersensual.\"_\n\n\"Have a care that in being such, you do not become a martyr to love,\nthe _martyr of a woman_.\"\n\nWe are sitting on Wanda's little balcony in the mellow fragrant\nsummer night. A twofold roof is above us, first the green ceiling of\nclimbing-plants, and then the vault of heaven sown with innumerable\nstars. The low wailing love-call of a cat rises from the park. I am\nsitting on footstool at the feet of my divinity, and am telling her\nof my childhood.\n\n\"And even then all these strange tendencies were distinctly marked\nin you?\" asked Wanda.\n\n\"Of course, I can't remember a time when I didn't have them. Even in\nmy cradle, so mother has told me, I was _supersensual._ I scorned the\nhealthy breast of my nurse, and had to be brought up on goats' milk.\nAs a little boy I was mysteriously shy before women, which really was\nonly an expression of an inordinate interest in them. I was oppressed\nby the gray arches and half-darknesses of the church, and actually\nafraid of the glittering altars and images of the saints. Secretly,\nhowever, I sneaked as to a secret joy to a plaster-Venus which stood\nin my father's little library. I kneeled down before her, and to her I\nsaid the prayers I had been taught--the Paternoster, the Ave Maria,\nand the Credo.\n\n\"Once at night I left my bed to visit her. The sickle of the moon\nwas my light and showed me the goddess in a pale-blue cold light. I\nprostrated myself before her and kissed her cold feet, as I had seen\nour peasants do when they kissed the feet of the dead Savior.\n\n\"An irresistible yearning seized me.\n\n\"I got up and embraced the beautiful cold body and kissed the cold\nlips. A deep shudder fell upon me and I fled, and later in a dream,\nit seemed to me, as if the goddess stood beside my bed, threatening\nme with up-raised arm.\n\n\"I was sent to school early and soon reached the gymnasium. I\npassionately grasped at everything which promised to make the world\nof antiquity accessible to me. Soon I was more familiar with the gods\nof Greece than with the religion of Jesus. I was with Paris when he\ngave the fateful apple to Venus, I saw Troy burn, and followed\nUlysses on his wanderings. The prototypes of all that is beautiful\nsank deep into my soul, and consequently at the time when other boys\nare coarse and obscene, I displayed an insurmountable aversion to\neverything base, vulgar, unbeautiful.\n\n\"To me, the maturing youth, love for women seemed something\nespecially base and unbeautiful, for it showed itself to me first in\nall its commonness. I avoided all contact with the fair sex; in\nshort, I was supersensual to madness.\n\n\"When I was about fourteen my mother had a charming chamber-maid,\nyoung, attractive, with a figure just budding into womanhood. I was\nsitting one day studying my Tacitus and growing enthusiastic over the\nvirtues of the ancient Teutons, while she was sweeping my room.\nSuddenly she stopped, bent down over me, in the meantime holding fast\nto the broom, and a pair of fresh, full, adorable lips touched mine.\nThe kiss of the enamoured little cat ran through me like a shudder,\nbut I raised up my _Germania_, like a shield against the temptress,\nand indignantly left the room.\"\n\nWanda broke out in loud laughter. \"It would, indeed, be hard to find\nanother man like you, but continue.\"\n\n\"There is another unforgetable incident belonging to that period,\"\nI continued my story. \"Countess Sobol, a distant aunt of mine, was\nvisiting my parents. She was a beautiful majestic woman with an\nattractive smile. I, however, hated her, for she was regarded by the\nfamily as a sort of Messalina. My behavior toward her was as rude,\nmalicious, and awkward as possible.\n\n\"One day my parents drove to the capital of the district. My aunt\ndetermined to take advantage of their absence, and to exercise\njudgment over me. She entered unexpectedly in her fur-lined\n_kazabaika,_ [Footnote: A woman's jacket.] followed by the cook,\nkitchen-maid, and the cat of a chamber-maid whom I had scorned.\nWithout asking any questions, they seized me and bound me hand and\nfoot, in spite of my violent resistance. Then my aunt, with an evil\nsmile, rolled up her sleeve and began to whip me with a stout switch.\nShe whipped so hard that the blood flowed, and that, at last,\nnotwithstanding my heroic spirit, I cried and wept and begged for\nmercy. She then had me untied, but I had to get down on my knees and\nthank her for the punishment and kiss her hand.\n\n\"Now you understand the supersensual fool! Under the lash of a\nbeautiful woman my senses first realized the meaning of woman. In her\nfur-jacket she seemed to me like a wrathful queen, and from then on\nmy aunt became the most desirable woman on God's earth.\n\n\"My Cato-like austerity, my shyness before woman, was nothing but an\nexcessive feeling for beauty. In my imagination sensuality became a\nsort of cult. I took an oath to myself that I would not squander its\nholy wealth upon any ordinary person, but I would reserve it for an\nideal woman, if possible for the goddess of love herself.\n\n\"I went to the university at a very early age. It was in the capital\nwhere my aunt lived. My room looked at that time like Doctor\nFaustus's. Everything in it was in a wild confusion. There were huge\nclosets stuffed full of books, which I bought for a song from a\nJewish dealer on the Servanica; [Footnote: The street of the Jews in\nLemberg.] there were globes, atlases, flasks, charts of the heavens,\nskeletons of animals, skulls, the busts of eminent men. It looked as\nthough Mephistopheles might have stepped out from behind the huge\ngreen store as a wandering scholiast at any moment.\n\n\"I studied everything in a jumble without system, without selection:\nchemistry, alchemy, history, astronomy, philosophy, law, anatomy, and\nliterature; I read Homer, Virgil, Ossian, Schiller, Goethe,\nShakespeare, Cervantes, Voltaire, Moliere, the Koran, the Kosmos,\nCasanova's Memoirs. I grew more confused each day, more fantastical,\nmore supersensual. All the time a beautiful ideal woman hovered in my\nimagination. Every so and so often she appeared before me like a\nvision among my leather-bound books and dead bones, lying on a bed of\nroses, surrounded by cupids. Sometimes she appeared gowned like the\nOlympians with the stern white face of the plaster Venus; sometimes in\nbraids of a rich brown, blue-eyes, in my aunt's red velvet\n_kazabaika,_ trimmed with ermine.\n\n\"One morning when she had again risen out of the golden mist of my\nimagination in all her smiling beauty, I went to see Countess Sobol,\nwho received me in a friendly, even cordial manner. She gave me a\nkiss of welcome, which put all my senses in a turmoil. She was\nprobably about forty years old, but like most well-preserved women\nof the world, still very attractive. She wore as always her fur-edged\njacket. This time it was one of green velvet with brown marten. But\nnothing of the sternness which had so delighted me the other time was\nnow discernable.\n\n\"On the contrary, there was so little of cruelty in her that without\nany more ado she let me adore her.\n\n\"Only too soon did she discover my supersensual folly and innocence,\nand it pleased her to make me happy. As for myself--I was as happy\nas a young god. What rapture for me to be allowed to lie before her\non my knees, and to kiss her hands, those with which she had scourged\nme! What marvellous hands they were, of beautiful form, delicate,\nrounded, and white, with adorable dimples! I really was in love with\nher hands only. I played with them, let them submerge and emerge in\nthe dark fur, held them against the light, and was unable to satiate\nmy eyes with them.\"\n\nWanda involuntarily looked at her hand; I noticed it, and had to\nsmile.\n\n\"From the way in which the supersensual predominated in me in those\ndays you can see that I was in love only with the cruel lashes I\nreceived from my aunt; and about two years later when I paid court\nto a young actress only in the roles she played. Still later I became\nthe admirer of a respectable woman. She acted the part of\nirreproachable virtue, only in the end to betray me with a rich Jew.\nYou see, it is because I was betrayed, sold, by a woman who feigned\nthe strictest principles and the highest ideals, that I hate that\nsort of poetical, sentimental virtue so intensely. Give me rather a\nwoman who is honest enough to say to me: I am a Pompadour, a Lucretia\nBorgia, and I am ready to adore her.\"\n\nWanda rose and opened the window.\n\n\"You have a curious way of arousing one's imagination, stimulating\nall one's nerves, and making one's pulses beat faster. You put an\naureole on vice, provided only if it is honest. Your ideal is a\ndaring courtesan of genius. Oh, you are the kind of man who will\ncorrupt a woman to her very last fiber.\"\n\n       *       *       *       *       *\n\nIn the middle of the night there was a knock at my window; I got up,\nopened it, and was startled. Without stood \"Venus in Furs,\" just as\nshe had appeared to me the first time.\n\n\"You have disturbed me with your stories; I have been tossing about\nin bed, and can't go to sleep,\" she said. \"Now come and stay with me.\"\n\n\"In a moment.\"\n\nAs I entered Wanda was crouching by the fireplace where she had\nkindled a small fire.\n\n\"Autumn is coming,\" she began, \"the nights are really quite cold\nalready. I am afraid you may not like it, but I can't put off my furs\nuntil the room is sufficiently warm.\"\n\n\"Not like it--you are joking--you know--\" I threw my arm around her,\nand kissed her.\n\n\"Of course, I know, but why this great fondness for furs?\"\n\n\"I was born with it,\" I replied. \"I already had it as a child.\nFurthermore furs have a stimulating effect on all highly organized\nnatures. This is due both to general and natural laws. It is a\nphysical stimulus which sets you tingling, and no one can wholly\nescape it. Science has recently shown a certain relationship between\nelectricity and warmth; at any rate, their effects upon the human\norganism are related. The torrid zone produces more passionate\ncharacters, a heated atmosphere stimulation. Likewise with\nelectricity. This is the reason why the presence of cats exercises\nsuch a magic influence upon highly-organized men of intellect. This\nis why these long-tailed Graces of the animal kingdom, these\nadorable, scintillating electric batteries have been the favorite\nanimal of a Mahommed, Cardinal Richelieu, Crebillon, Rousseau,\nWieland.\"\n\n\"A woman wearing furs, then,\" cried Wanda, \"is nothing else than a\nlarge cat, an augmented electric battery?\"\n\n\"Certainly,\" I replied. \"That is my explanation of the symbolic\nmeaning which fur has acquired as the attribute of power and beauty.\nMonarchs and the dominant higher nobility in former times used it in\nthis sense for their costume, exclusively; great painters used it\nonly for queenly beauty. The most beautiful frame, which Raphael\ncould find for the divine forms of Fornarina and Titian for the\nroseate body of his beloved, was dark furs.\"\n\n\"Thanks for the learned discourse on love,\" said Wanda, \"but you\nhaven't told me everything. You associate something entirely\nindividual with furs.\"\n\n\"Certainly,\" I cried. \"I have repeatedly told you that suffering has\na peculiar attraction for me. Nothing can intensify my passion more\nthan tyranny, cruelty, and especially the faithlessness of a\nbeautiful woman. And I cannot imagine this woman, this strange ideal\nderived from an aesthetics of ugliness, this soul of Nero in the body\nof a Phryne, except in furs.\"\n\n\"I understand,\" Wanda interrupted. \"It gives a dominant and imposing\nquality to a woman.\"\n\n\"Not only that,\" I continued. \"You know I am _supersensual._ With me\neverything has its roots in the imagination, and thence it receives\nits nourishment. I was already pre-maturely developed and highly\nsensitive, when at about the age of ten the legends of the martyrs\nfell into my hands. I remember reading with a kind of horror, which\nreally was rapture, of how they pined in prisons, were laid on the\ngridiron, pierced with arrows, boiled in pitch, thrown to wild\nanimals, nailed to the cross, and suffered the most horrible torment\nwith a kind of joy. To suffer and endure cruel torture from then on\nseemed to me exquisite delight, especially when it was inflicted by a\nbeautiful woman, for ever since I can remember all poetry and\neverything demonic was for me concentrated in woman. I literally\ncarried the idea into a sort of cult.\n\n\"I felt there was something sacred in sex; in fact, it was the only\nsacred thing. In woman and her beauty I saw something divine, because\nthe most important function of existence--the continuation of the\nspecies--is her vocation. To me woman represented a personification of\nnature, _Isis_, and man was her priest, her slave. In contrast to him\nshe was cruel like nature herself who tosses aside whatever has served\nher purposes as soon as she no longer has need for it. To him her\ncruelties, even death itself, still were sensual raptures.\n\n\"I envied King Gunther whom the mighty Brunhilde fettered on the\nbridal night, and the poor troubadour whom his capricious mistress\nhad sewed in the skins of wolves to have him hunted like game. I\nenvied the Knight Ctirad whom the daring Amazon Scharka craftily\nensnared in a forest near Prague, and carried to her castle Divin,\nwhere, after having amused herself a while with him, she had him\nbroken on the wheel--\"\n\n\"Disgusting,\" cried Wanda. \"I almost wish you might fall into the\nhands of a woman of their savage race. In the wolf's skin, under the\nteeth of the dogs, or upon the wheel, you would lose the taste for\nyour kind of poetry.\"\n\n\"Do you think so? I hardly do.\"\n\n\"Have you actually lost your senses.\"\n\n\"Possibly. But let me go on. I developed a perfect passion for\nreading stories in which the extremest cruelties were described. I\nloved especially to look at pictures and prints which represented\nthem. All the sanguinary tyrants that ever occupied a throne; the\ninquisitors who had the heretics tortured, roasted, and butchered;\nall the woman whom the pages of history have recorded as lustful,\nbeautiful, and violent women like Libussa, Lucretia Borgia, Agnes of\nHungary, Queen Margot, Isabeau, the Sultana Roxolane, the Russian\nCzarinas of last century--all these I saw in furs or in robes\nbordered with ermine.\"\n\n\"And so furs now rouse strange imaginings in you,\" said Wanda, and\nsimultaneously she began to drape her magnificent fur-cloak\ncoquettishly about her, so that the dark shining sable played\nbeautifully around her bust and arms. \"Well, how do you feel now,\nhalf broken on the wheel?\"\n\nHer piercing green eyes rested on me with a peculiar mocking\nsatisfaction. Overcome by desire, I flung myself down before her, and\nthrew my arms about her.\n\n\"Yes--you have awakened my dearest dream,\" I cried. \"It has slept\nlong enough.\"\n\n\"And this is?\" She put her hand on my neck.\n\nI was seized with a sweet intoxication under the influence of this\nwarm little hand and of her regard, which, tenderly searching, fell\nupon me through her half-closed lids.\n\n_\"To be the slave of a woman, a beautiful woman, whom I love, whom\nI worship.\"_\n\n\"And who on that account maltreats you,\" interrupted Wanda, laughing.\n\n\"Yes, who fetters me and whips me, treads me underfoot, the while\nshe gives herself to another.\"\n\n\"And who in her wantonness will go so far as to make a present of\nyou to your successful rival when driven insane by jealousy you must\nmeet him face to face, who will turn you over to his absolute mercy.\nWhy not? This final tableau doesn't please you so well?\"\n\nI looked at Wanda frightened.\n\n\"You surpass my dreams.\"\n\n\"Yes, we women are inventive,\" she said, \"take heed, when you find\nyour ideal, it might easily happen, that she will treat you more\ncruelly than you anticipate.\"\n\n\"I am afraid that I have already found my ideal!\" I exclaimed,\nburying my burning face in her lap.\n\n\"Not I?\" exclaimed Wanda, throwing off her furs and moving about the\nroom laughing. She was still laughing as I went downstairs, and when\nI stood musing in the yard, I still heard her peals of laughter above.\n\n       *       *       *       *       *\n\n\"Do you really then expect me to embody your ideal?\" Wanda asked\narchly, when we met in the park to-day.\n\nAt first I could find no answer. The most antagonistic emotions were\nbattling within me. In the meantime she sat down on one of the\nstone-benches, and played with a flower.\n\n\"Well--am I?\"\n\nI kneeled down and seized her hands.\n\n\"Once more I beg you to become my wife, my true and loyal wife; if\nyou can't do that then become the embodiment of my ideal, absolutely,\nwithout reservation, without softness.\"\n\n\"You know I am ready at the end of a year to give you my hand, if\nyou prove to be the man I am seeking,\" Wanda replied very seriously,\n\"but I think you would be more grateful to me if through me you\nrealized your imaginings. Well, which do you prefer?\"\n\n\"I believe that everything my imagination has dreamed lies latent in\nyour personality.\"\n\n\"You are mistaken.\"\n\n\"I believe,\" I continued, \"that you enjoy having a man wholly in\nyour power, torturing him--\"\n\n\"No, no,\" she exclaimed quickly, \"or perhaps--.\" She pondered.\n\n\"I don't understand myself any longer,\" she continued, \"but I have\na confession to make to you. You have corrupted my imagination and\ninflamed my blood. I am beginning to like the things you speak of.\nThe enthusiasm with which you speak of a Pompadour, a Catherine the\nSecond, and all the other selfish, frivolous, cruel women, carries\nme away and takes hold of my soul. It urges me on to become like those\nwomen, who in spite of their vileness were slavishly adored during\ntheir lifetime and still exert a miraculous power from their graves.\n\n\"You will end by making of me a despot in miniature, a domestic\nPompadour.\"\n\n\"Well then,\" I said in agitation, \"if all this is inherent in you,\ngive way to this trend of your nature. Nothing half-way. If you can't\nbe a true and loyal wife to me, be a demon.\"\n\nI was nervous from loss of sleep, and the proximity of the beautiful\nwoman affected me like a fever. I no longer recall what I said, but\nI remember that I kissed her feet, and finally raised her foot and\nput my neck under it. She withdrew it quickly, and rose almost angrily.\n\n\"If you love me, Severin,\" she said quickly, and her voice sounded\nsharp and commanding, \"never speak to me of those things again.\nUnderstand, never! Otherwise I might really--\" She smiled and sat\ndown again.\n\n\"I am entirely serious,\" I exclaimed, half-raving. \"I adore you so\ninfinitely that I am willing to suffer anything from you, for the\nsake of spending my whole life near you.\"\n\n\"Severin, once more I warn you.\"\n\n\"Your warning is vain. Do with me what you will, as long as you\ndon't drive me away.\"\n\n\"Severin,\" replied Wanda, \"I am a frivolous young woman; it is\ndangerous for you to put yourself so completely in my power. You will\nend by actually becoming a plaything to me. Who will give warrant\nthat I shall not abuse your insane desire?\"\n\n\"Your own nobility of character.\"\n\n\"Power makes people over-bearing.\"\n\n\"Be it,\" I cried, \"tread me underfoot.\"\n\nWanda threw her arms around my neck, looked into my eyes, and shook\nher head.\n\n\"I am afraid I can't, but I will try, for your sake, for I love you\nSeverin, as I have loved no other man.\"\n\n       *       *       *       *       *\n\nTo-day she suddenly took her hat and shawl, and I had to go shopping\nwith her. She looked at whips, long whips with a short handle, the\nkind that are used on dogs.\n\n\"Are these satisfactory?\" said the shopkeeper.\n\n\"No, they are much too small,\" replied Wanda, with a side-glance at\nme. \"I need a large--\"\n\n\"For a bull-dog, I suppose?\" opined the merchant.\n\n\"Yes,\" she exclaimed, \"of the kind that are used in Russia for\nintractable slaves.\"\n\nShe looked further and finally selected a whip, at whose sight I\nfelt a strange creeping sensation.\n\n\"Now good-by, Severin,\" she said. \"I have some other purchases to\nmake, but you can't go along.\"\n\nI left her and took a walk. On the way back I saw Wanda coming out\nat a furrier's. She beckoned me.\n\n\"Consider it well,\" she began in good spirits, \"I have never made a\nsecret of how deeply your serious, dreamy character has fascinated\nme. The idea of seeing this serious man wholly in my power, actually\nlying enraptured at my feet, of course, stimulates me--but will this\nattraction last? Woman loves a man; she maltreats a slave, and ends\nby kicking him aside.\"\n\n\"Very well then, kick me aside,\" I replied, \"when you are tired of\nme. I want to be your slave.\"\n\n\"Dangerous forces lie within me,\" said Wanda, after we had gone a\nfew steps further. \"You awaken them, and not to your advantage. You\nknow how to paint pleasure, cruelty, arrogance in glowing colors.\nWhat would you say should I try my hand at them, and make you the\nfirst object of my experiments. I would be like Dionysius who had the\ninventor of the iron ox roasted within it in order to see whether his\nwails and groans really resembled the bellowing of an ox.\n\n\"Perhaps I am a female Dionysius?\"\n\n\"Be it,\" I exclaimed, \"and my dreams will be fulfilled. I am yours\nfor good or evil, choose. The destiny that lies concealed within my\nbreast drives me on--demoniacally--relentlessly.\"\n\n\"My Beloved,\n\nI do not care to see you to-day or to-morrow, and not until evening\nthe day after tomorrow, and then _as my slave_.\n\nYour mistress\n\nWanda.\"\n\n\"As my slave\" was underlined. I read the note which I received early\nin the morning a second time. Then I had a donkey saddled, an animal\nsymbolic of learned professors, and rode into the mountains. I wanted\nto numb my desire, my yearning, with the magnificent scenery of the\nCarpathians. I am back, tired, hungry, thirsty, and more in love than\never. I quickly change my clothes, and a few moments later knock at\nher door.\n\n\"Come in!\"\n\nI enter. She is standing in the center of the room, dressed in a gown\nof white satin which floods down her body like light. Over it she\nwears a scarlet _kazabaika_, richly edged with ermine. Upon her\npowdered, snowy hair is a little diadem of diamonds. She stands with\nher arms folded across her breast, and with her brows contracted.\n\n\"Wanda!\" I run toward her, and am about to throw my arm about her to\nkiss her. She retreats a step, measuring me from top to bottom.\n\n\"Slave!\"\n\n\"Mistress!\" I kneel down, and kiss the hem of her garment.\n\n\"That is as it should be.\"\n\n\"Oh, how beautiful you are.\"\n\n\"Do I please you?\" She stepped before the mirror, and looked at\nherself with proud satisfaction.\n\n\"I shall become mad!\"\n\nHer lower lip twitched derisively, and she looked at me mockingly\nfrom behind half-closed lids.\n\n\"Give me the whip.\"\n\nI looked about the room.\n\n\"No,\" she exclaimed, \"stay as you are, kneeling.\" She went over to\nthe fire-place, took the whip from the mantle-piece, and, watching\nme with a smile, let it hiss through the air; then she slowly rolled\nup the sleeve of her fur-jacket.\n\n\"Marvellous woman!\" I exclaimed.\n\n\"Silence, slave!\" She suddenly scowled, looked savage, and struck me\nwith the whip. A moment later she threw her arm tenderly about me, and\npityingly bent down to me. \"Did I hurt you?\" she asked, half-shyly,\nhalf-timidly.\n\n\"No,\" I replied, \"and even if you had, pains that come through you\nare a joy. Strike again, if it gives you pleasure.\"\n\n\"But it doesn't give me pleasure.\"\n\nAgain I was seized with that strange intoxication.\n\n\"Whip me,\" I begged, \"whip me without mercy.\"\n\nWanda swung the whip, and hit me twice. \"Are you satisfied now?\"\n\n\"No.\"\n\n\"Seriously, no?\"\n\n\"Whip me, I beg you, it is a joy to me.\"\n\n\"Yes, because you know very well that it isn't serious,\" she\nreplied, \"because I haven't the heart to hurt you. This brutal game\ngoes against my grain. Were I really the woman who beats her slaves\nyou would be horrified.\"\n\n\"No, Wanda,\" I replied, \"I love you more than myself; I am devoted\nto you for death and life. In all seriousness, you can do with me\nwhatever you will, whatever your caprice suggests.\"\n\n\"Severin!\"\n\n\"Tread me underfoot!\" I exclaimed, and flung myself face to the\nfloor before her.\n\n\"I hate all this play-acting,\" said Wanda impatiently.\n\n\"Well, then maltreat me seriously.\"\n\nAn uncanny pause.\n\n\"Severin, I warn you for the last time,\" began Wanda.\n\n\"If you love me, be cruel towards me,\" I pleaded with upraised eyes.\n\n\"If I love you,\" repeated Wanda. \"Very well!\" She stepped back and\nlooked at me with a sombre smile. _\"Be then my slave, and know what\nit means to be delivered into the hands of a woman.\"_ And at the\nsame moment she gave me a kick.\n\n\"How do you like that, slave?\"\n\nThen she flourished the whip.\n\n\"Get up!\"\n\nI was about to rise.\n\n\"Not that way,\" she commanded, \"on your knees.\"\n\nI obeyed, and she began to apply the lash.\n\nThe blows fell rapidly and powerfully on my back and arms. Each one\ncut into my flesh and burned there, but the pains enraptured me. They\ncame from her whom I adored, and for whom I was ready at any hour to\nlay down my life.\n\nShe stopped. \"I am beginning to enjoy it,\" she said, \"but enough for\nto-day. I am beginning to feel a demonic curiosity to see how far\nyour strength goes. I take a cruel joy in seeing you tremble and\nwrithe beneath my whip, and in hearing your groans and wails; I want\nto go on whipping without pity until you beg for mercy, until you\nlose your senses. You have awakened dangerous elements in my being.\nBut now get up.\"\n\nI seized her hand to press it to my lips.\n\n\"What impudence.\"\n\nShe shoved me away with her foot.\n\n\"Out of my sight, slave!\"\n\n       *       *       *       *       *\n\nAfter having spent a feverish night filled with confused dreams, I\nawoke. Dawn was just beginning to break.\n\nHow much of what was hovering in my memory was true; what had I\nactually experienced and what had I dreamed? That I had been whipped\nwas certain. I can still feel each blow, and count the burning red\nstripes on my body. And _she_ whipped me. Now I know everything.\n\nMy dream has become truth. How does it make me feel? Am I\ndisappointed in the realization of my dream?\n\nNo, I am merely somewhat tired, but her cruelty has enraptured me.\nOh, how I love her, adore her! All this cannot express in the\nremotest way my feeling for her, my complete devotion to her. What\nhappiness to be her slave!\n\n       *       *       *       *       *\n\nShe calls to me from her balcony. I hurry upstairs. She is standing\non the threshold, holding out her hand in friendly fashion. \"I am\nashamed of myself,\" she says, while I embrace her, and she hides her\nhead against my breast.\n\n\"Why?\"\n\n\"Please try to forget the ugly scene of yesterday,\" she said with\nquivering voice, \"I have fulfilled your mad wish, now let us be\nreasonable and happy and love each other, and in a year I will be\nyour wife.\"\n\n\"My mistress,\" I exclaimed, \"and I your slave!\"\n\n\"Not another word of slavery, cruelty, or the whip,\" interrupted\nWanda. \"I shall not grant you any of those favors, none except\nwearing my fur-jacket; come and help me into it.\"\n\n       *       *       *       *       *\n\nThe little bronze clock on which stood a cupid who had just shot his\nbolt struck midnight.\n\nI rose, and wanted to leave.\n\nWanda said nothing, but embraced me and drew me back on the ottoman.\nShe began to kiss me anew, and this silent language was so\ncomprehensible, so convincing--\n\nAnd it told me more than I dared to understand.\n\nA languid abandonment pervaded Wanda's entire being. What a\nvoluptuous softness there was in the gloaming of her half-closed\neyes, in the red flood of her hair which shimmered faintly under the\nwhite powder, in the red and white satin which crackled about her\nwith every movement, in the swelling ermine of the _kazabaika_\nin which she carelessly nestled.\n\n\"Please,\" I stammered, \"but you will be angry with me.\"\n\n\"Do with me what you will,\" she whispered.\n\n\"Well, then whip me, or I shall go mad.\"\n\n\"Haven't I forbidden you,\" said Wanda sternly, \"but you are\nincorrigible.\"\n\n\"Oh, I am so terribly in love.\" I had sunken on my knees, and was\nburying my glowing face in her lap.\n\n\"I really believe,\" said Wanda thoughtfully, \"that your madness is\nnothing but a demonic, unsatisfied sensuality. _Our unnatural way\nof life must generate such illnesses._ Were you less virtuous, you\nwould be completely sane.\"\n\n\"Well then, make me sane,\" I murmured. My hands were running through\nher hair and playing tremblingly with the gleaming fur, which rose\nand fell like a moonlit wave upon her heaving bosom, and drove all\nmy senses into confusion.\n\nAnd I kissed her. No, she kissed me savagely, pitilessly, as if she\nwanted to slay me with her kisses. I was as in a delirium, and had\nlong since lost my reason, but now I, too, was breathless. I sought\nto free myself.\n\n\"What is the matter?\" asked Wanda.\n\n\"I am suffering agonies.\"\n\n\"You are suffering--\" she broke out into a loud amused laughter.\n\n\"You laugh!\" I moaned, \"have you no idea--\"\n\nShe was serious all of a sudden. She raised my head in her hands,\nand with a violent gesture drew me to her breast.\n\n\"Wanda,\" I stammered.\n\n\"Of course, you enjoy suffering,\" she said, and laughed again, \"but\nwait, I'll bring you to your senses.\"\n\n\"No, I will no longer ask,\" I exclaimed, \"whether you want to belong\nto me for always or for only a brief moment of intoxication. I want\nto drain my happiness to the full. You are mine now, and I would\nrather lose you than never to have had you.\"\n\n\"Now you are sensible,\" she said. She kissed me again with her\nmurderous lips. I tore the ermine apart and the covering of lace and\nher naked breast surged against mine.\n\nThen my senses left me--\n\nThe first thing I remember is the moment when I saw blood dripping\nfrom my hand, and she asked apathetically: \"Did you scratch me?\"\n\n\"No, I believe, I have bitten you.\"\n\n       *       *       *       *       *\n\nIt is strange how every relation in life assumes a different face as\nsoon as a new person enters.\n\nWe spent marvellous days together; we visited the mountains and\nlakes, we read together, and I completed Wanda's portrait. And how\nwe loved one another, how beautiful her smiling face was!\n\nThen a friend of hers arrived, a divorced woman somewhat older, more\nexperienced, and less scrupulous than Wanda. Her influence is already\nmaking itself felt in every direction.\n\nWanda wrinkles her brows, and displays a certain impatience with me.\n\nHas she ceased loving me?\n\n       *       *       *       *       *\n\nFor almost a fortnight this unbearable restraint has lain upon us.\nHer friend lives with her, and we are never alone. A circle of men\nsurrounds the young women. With my seriousness and melancholy I am\nplaying an absurd role as lover. Wanda treats me like a stranger.\n\nTo-day, while out walking, she staid behind with me. I saw that this\nwas done intentionally, and I rejoiced. But what did she tell me?\n\n\"My friend doesn't understand how I can love you. She doesn't think\nyou either handsome or particularly attractive otherwise. She is\ntelling me from morning till night about the glamour of the frivolous\nlife in the capital, hinting at the advantages to which I could lay\nclaim, the large parties which I would find there, and the\ndistinguished and handsome admirers which I would attract. But of\nwhat use is all this, since it happens that I love you.\"\n\nFor a moment I lost my breath, then I said: \"I have no wish to stand\nin the way of your happiness, Wanda. Do not consider me.\" Then I\nraised my hat, and let her go ahead. She looked at me surprised, but\ndid not answer a syllable.\n\nWhen by chance I happened to be close to her on the way back, she\nsecretly pressed my hand. Her glance was so radiant, so full of\npromised happiness, that in a moment all the torments of these days\nwere forgotten and all their wounds healed.\n\nI now am aware again of how much I love her.\n\n       *       *       *       *       *\n\n\"My friend has complained about you,\" said Wanda to-day.\n\n\"Perhaps she feels that I despise her.\"\n\n\"But why do you despise her, you foolish young man?\" exclaimed\nWanda, pulling my ears with both hands.\n\n\"Because she is a hypocrite,\" I said. \"I respect only a woman who is\nactually virtuous, or who openly lives for pleasure's sake.\"\n\n\"Like me, for instance,\" replied Wanda jestingly, \"but you see,\nchild, a woman can only do that in the rarest cases. She can neither\nbe as gaily sensual, nor as spiritually free as man; her state is\nalways a mixture of the sensual and spiritual. Her heart desires to\nenchain man permanently, while she herself is ever subject to the\ndesire for change. The result is a conflict, and thus usually against\nher wishes lies and deception enter into her actions and personality\nand corrupt her character.\"\n\n\"Certainly that is true,\" I said. \"The transcendental character with\nwhich woman wants to stamp love leads her to deception.\"\n\n\"But the world likewise demands it,\" Wanda interrupted. \"Look at\nthis woman. She has a husband and a lover in Lemberg and has found\na new admirer here. She deceives all three and yet is honored by all\nand respected by the world.\"\n\n\"I don't care,\" I exclaimed, \"but she is to leave you alone; she\ntreats you like an article of commerce.\"\n\n\"Why not?\" the beautiful woman interrupted vivaciously. \"Every woman\nhas the instinct or desire to draw advantage out of her attractions,\nand much is to be said for giving one's self without love or pleasure\nbecause if you do it in cold blood, you can reap profit to best\nadvantage.\"\n\n\"Wanda, what are you saying?\"\n\n\"Why not?\" she said, \"and take note of what I am about to say to you.\n_Never feel secure with the woman you love,_ for there are more\ndangers in woman's nature than you imagine. Women are neither as\n_good_ as their admirers and defenders maintain, nor as _bad_ as their\nenemies make them out to be. _Woman's character is characterlessness._\nThe best woman will momentarily go down into the mire, and the worst\nunexpectedly rises to deeds of greatness and goodness and puts to\nshame those that despise her. No woman is so good or so bad, but that\nat any moment she is capable of the most diabolical as well as of the\nmost divine, of the filthiest as well as of the purest, thoughts,\nemotions, and actions. In spite of all the advances of civilization,\nwoman has remained as she came out of the hand of nature. She has the\nnature of a savage, who is faithful or faithless, magnanimous or\ncruel, according to the impulse that dominates at the moment.\nThroughout history it has always been a serious deep culture which has\nproduced moral character. Man even when he is selfish or evil always\nfollows _principles,_ woman never follows anything but _impulses._\nDon't ever forget that, and never feel secure with the woman you\nlove.\"\n\n       *       *       *       *       *\n\nHer friend has left. At last an evening alone with her again. It\nseems as if Wanda had saved up all the love, which had been kept from\nher, for this superlative evening; never had she been so kind, so\nnear, so full of tenderness.\n\nWhat happiness to cling to her lips, and to die away in her arms! In\na state of relaxation and wholly mine, her head rests against my\nbreast, and with drunken rapture our eyes seek each other.\n\nI cannot yet believe, comprehend, that this woman is mine, wholly\nmine.\n\n\"She is right on one point,\" Wanda began, without moving, without\nopening her eyes, as if she were asleep.\n\n\"Who?\"\n\nShe remained silent.\n\n\"Your friend?\"\n\nShe nodded. \"Yes, she is right, you are not a man, you are a\ndreamer, a charming cavalier, and you certainly would be a priceless\nslave, but I cannot imagine you as husband.\"\n\nI was frightened.\n\n\"What is the matter? You are trembling?\"\n\n\"I tremble at the thought of how easily I might lose you,\" I replied.\n\n\"Are you made less happy now, because of this?\" she replied. \"Does\nit rob you of any of your joys, that I have belonged to another\nbefore I did to you, that others after you will possess me, and would\nyou enjoy less if another were made happy simultaneously with you?\"\n\n\"Wanda!\"\n\n\"You see,\" she continued, \"that would be a way out. You won't ever\nlose me then. I care deeply for you and intellectually we are\nharmonious, and I should like to live with you always, if in addition\nto you I might have--\"\n\n\"What an idea,\" I cried. \"You fill me with a sort of horror.\"\n\n\"Do you love me any the less?\"\n\n\"On the contrary.\"\n\nWanda had raised herself on her left arm. \"I believe,\" she said,\n\"that to hold a man permanently, it is vitally important not to be\nfaithful to him. What honest woman has ever been as devotedly loved\nas a hetaira?\"\n\n\"There is a painful stimulus in the unfaithfulness of a beloved\nwoman. It is the highest kind of ecstacy.\"\n\n\"For you, too?\" Wanda asked quickly.\n\n\"For me, too.\"\n\n\"And if I should give you that pleasure,\" Wanda exclaimed mockingly.\n\n\"I shall suffer terrible agonies, but I shall adore you the more,\"\nI replied. \"But you would never deceive me, you would have the daemonic\ngreatness of saying to me: I shall love no one but you, but I shall\nmake happy whoever pleases me.\"\n\nWanda shook her head. \"I don't like deception, I am honest, but what\nman exists who can support the burden of truth. Were I say to you:\nthis serene, sensual life, this paganism is my ideal, would you be\nstrong enough to bear it?\"\n\n\"Certainly. I could endure anything so as not to lose you. I feel\nhow little I really mean to you.\"\n\n\"But Severin--\"\n\n\"But it is so,\" said I, \"and just for that reason--\"\n\n\"For that reason you would--\" she smiled roguishly--\"have I guessed\nit?\"\n\n\"Be your slave!\" I exclaimed. \"Be your unrestricted property,\nwithout a will of my own, of which you could dispose as you wished,\nand which would therefore never be a burden to you. While you drink\nlife at its fullness, while surrounded by luxury, you enjoy the\nserene happiness and Olympian love, I want to be your servant, put\non and take off your shoes.\"\n\n\"You really aren't so far from wrong,\" replied Wanda, \"for only as\nmy slave could you endure my loving others. Furthermore the freedom\nof enjoyment of the ancient world is unthinkable without slavery. It\nmust give one a feeling of like unto a god to see a man kneel before\none and tremble. I want a slave, do you hear, Severin?\"\n\n\"Am I not your slave?\"\n\n\"Then listen to me,\" said Wanda excitedly, seizing my hand. \"I want\nto be yours, as long as I love you.\"\n\n\"A month?\"\n\n\"Perhaps, even two.\"\n\n\"And then?\"\n\n\"Then you become my slave.\"\n\n\"And you?\"\n\n\"I? Why do you ask? I am a goddess and sometimes I descend from my\nOlympian heights to you, softly, very softly, and secretly.\n\n\"But what does all this mean,\" said Wanda, resting her head in both\nhands with her gaze lost in the distance, \"a golden fancy which never\ncan become true.\" An uncanny brooding melancholy seemed shed over her\nentire being; I have never seen her like that.\n\n\"Why unachievable?\" I began.\n\n\"Because slavery doesn't exist any longer.\"\n\n\"Then we will go to a country where it still exists, to the Orient,\nto Turkey,\" I said eagerly.\n\n\"You would--Severin--in all seriousness,\" Wanda replied. Her eyes\nburned.\n\n\"Yes, in all seriousness, I want to be your slave,\" I continued. \"I\nwant your power over me to be sanctified by law; I want my life to\nbe in your hands, I want nothing that could protect or save me from\nyou. Oh, what a voluptuous joy when once I feel myself entirely dependent\nupon your absolute will, your whim, at your beck and call. And then\nwhat happiness, when at some time you deign to be gracious, and the\nslave may kiss the lips which mean life and death to him.\" I knelt\ndown, and leaned my burning forehead against her knee.\n\n\"You are talking as in a fever,\" said Wanda agitatedly, \"and you\nreally love me so endlessly.\" She held me to her breast, and covered\nme with kisses.\n\n\"You really want it?\"\n\n\"I swear to you now by God and my honor, that I shall be your slave,\nwherever and whenever you wish it, as soon as you command,\" I\nexclaimed, hardly master of myself.\n\n\"And if I take you at your word?\" said Wanda.\n\n\"Please do!\"\n\n\"All this appeals to me,\" she said then. \"It is different from\nanything else--to know that a man who worships me, and whom I love\nwith all my heart, is so wholly mine, dependent on my will and\ncaprice, my possession and slave, while I--\"\n\nShe looked strangely at me.\n\n\"If I should become frightfully frivolous you are to blame,\" she\ncontinued. \"It almost seems as if you were afraid of me already, but\nyou have sworn.\"\n\n\"And I shall keep my oath.\"\n\n\"I shall see to that,\" she replied. \"I am beginning to enjoy it,\nand, heaven help me, we won't stick to fancies now. You shall become\nmy slave, and I--I shall try to be _Venus in Furs_.\"\n\n       *       *       *       *       *\n\nI thought that at last I knew this woman, understood her, and now I\nsee I have to begin at the very beginning again. Only a little while\nago her reaction to my dreams was violently hostile, and now she\ntries to carry them into execution with the soberest seriousness.\n\nShe has drawn up a contract according to which I give my word of\nhonor and agree under oath to be her slave, as long as she wishes.\n\nWith her arm around my neck she reads this, unprecedented,\nincredible document to me. The end of each sentence she punctuates\nwith a kiss.\n\n\"But all the obligations in the contract are on my side,\" I said,\nteasing her.\n\n\"Of course,\" she replied with great seriousness, \"you cease to be my\nlover, and consequently I am released from all duties and obligations\ntowards you. You will have to look upon my favors as pure\nbenevolence. You no longer have any rights, and no longer can lay\nclaim to any. There can be no limit to my power over you. Remember,\nthat you won't be much better than a dog, or some inanimate object.\nYou will be mine, my plaything, which I can break to pieces, whenever\nI want an hour's amusement. You are nothing, I am everything. Do you\nunderstand?\" She laughed and kissed me again, and yet a sort of cold\nshiver ran through me.\n\n\"Won't you allow me a few conditions--\" I began.\n\n\"Conditions?\" She contracted her forehead. \"Ah! You are afraid\nalready, or perhaps you regret, but it is too late now. You have\nsworn, I have your word of honor. But let me hear them.\"\n\n\"First of all I should like to have it included in our contract,\nthat you will never completely leave me, and then that you will never\ngive me over to the mercies of any of your admirers--\"\n\n\"But Severin,\" exclaimed Wanda with her voice full of emotion and\nwith tears in her eyes, \"how can you imagine that I--and you, a man\nwho loves me so absolutely, who puts himself so entirely in my power--\"\nShe halted.\n\n\"No, no!\" I said, covering her hands with kisses. \"I don't fear\nanything from you that might dishonor me. Forgive me the ugly\nthought.\"\n\nWanda smiled happily, leaned her cheek against mine, and seemed to\nreflect.\n\n\"You have forgotten something,\" she whispered coquettishly, \"the\nmost important thing!\"\n\n\"A condition?\"\n\n\"Yes, that I must always wear my furs,\" exclaimed Wanda. \"But I\npromise you I'll do that anyhow because they give me a despotic\nfeeling. And I shall be very cruel to you, do you understand?\"\n\n\"Shall I sign the contract?\" I asked.\n\n\"Not yet,\" said Wanda. \"I shall first add your conditions, and the\nactual signing won't occur until the proper time and place.\"\n\n\"In Constantinople?\"\n\n\"No. I have thought things over. What special value would there be\nin owning a slave where everyone owns slaves. What I want is to\n_have a slave, I alone,_ here in our civilized sober, Philistine\nworld, and a slave who submits helplessly to my power solely on\naccount of my beauty and personality, not because of law, of property\nrights, or compulsions. This attracts me. But at any rate we will go\nto a country where we are not known and where you can appear before\nthe world as my servant without embarrassment. Perhaps to Italy, to\nRome or Naples.\"\n\n       *       *       *       *       *\n\nWe were sitting on Wanda's ottoman. She wore her ermine jacket, her\nhair was loose and fell like a lion's mane down her back. She clung\nto my lips, drawing my soul from my body. My head whirled, my blood\nbegan to seethe, my heart beat violently against hers.\n\n\"I want to be absolutely in your power, Wanda,\" I exclaimed\nsuddenly, seized by that frenzy of passion when I can scarcely think\nclearly or decide freely. \"I want to put myself absolutely at your\nmercy for good or evil without any condition, without any limit to\nyour power.\"\n\nWhile saying this I had slipped from the ottoman, and lay at her\nfeet looking up at her with drunken eyes.\n\n\"How beautiful you now are,\" she exclaimed, \"your eyes half-broken\nin ecstacy fill me with joy, carry me away. How wonderful your look\nwould be if you were being beaten to death, in the extreme agony. You\nhave the eye of a martyr.\"\n\n       *       *       *       *       *\n\nSometimes, nevertheless, I have an uneasy feeling about placing\nmyself so absolutely, so unconditionally into a woman's hands.\nSuppose she did abuse my passion, her power?\n\nWell, then I would experience what has occupied my imagination since\nmy childhood, what has always given me the feeling of seductive\nterror. A foolish apprehension! It will be a wanton game she will play\nwith me, nothing more. She loves me, and she is good, a noble\npersonality, incapable of a breach of faith. But it lies in her hands\n--_if she wants to she can._ What a temptation in this doubt, this\nfear!\n\nNow I understand Manon l'Escault and the poor chevalier, who, even\nin the pillory, while she was another man's mistress, still adored\nher.\n\nLove knows no virtue, no profit; it loves and forgives and suffers\neverything, because it must. It is not our judgment that leads us;\nit is neither the advantages nor the faults which we discover, that\nmake us abandon ourselves, or that repel us.\n\nIt is a sweet, soft, enigmatic power that drives us on. We cease to\nthink, to feel, to will; we let ourselves be carried away by it, and\nask not whither?\n\n       *       *       *       *       *\n\nA Russian prince made his first appearance today on the promenade.\nHe aroused general interest on account of his athletic figure,\nmagnificent face, and splendid bearing. The women particularly gaped\nat him as though he were a wild animal, but he went his way gloomily\nwithout paying attention to any one. He was accompanied by two\nservants, one a negro, completely dressed in red satin, and the other\na Circassian in his full gleaming uniform. Suddenly he saw Wanda, and\nfixed his cold piercing look upon her; he even turned his head after\nher, and when she had passed, he stood still and followed her with\nhis eyes.\n\nAnd she--she veritably devoured him with her radiant green eyes--and\ndid everything possible to meet him again.\n\nThe cunning coquetry with which she walked, moved, and looked at\nhim, almost stifled me. On the way home I remarked about it. She knit\nher brows.\n\n\"What do you want,\" she said, \"the prince is a man whom I might\nlike, who even dazzles me, and I am free. I can do what I please--\"\n\n\"Don't you love me any longer--\" I stammered, frightened.\n\n\"I love only you,\" she replied, \"but I shall have the prince pay\ncourt to me.\"\n\n\"Wanda!\"\n\n\"Aren't you my slave?\" she said calmly. \"Am I not Venus, the cruel\nnorthern Venus in Furs?\"\n\nI was silent. I felt literally crushed by her words; her cold look\nentered my heart like a dagger.\n\n\"You will find out immediately the prince's name, residence, and\ncircumstances,\" she continued. \"Do you understand?\"\n\n\"But--\"\n\n\"No argument, obey!\" exclaimed Wanda, more sternly than I would have\nthought possible for her, \"and don't dare to enter my sight until you\ncan answer my questions.\"\n\nIt was not till afternoon that I could obtain the desired\ninformation for Wanda. She let me stand before her like a servant,\nwhile she leaned back in her arm-chair and listened to me, smiling.\nThen she nodded; she seemed to be satisfied.\n\n\"Bring me my footstool,\" she commanded shortly.\n\nI obeyed, and after having put it before her and having put her feet\non it, I remained kneeling.\n\n\"How will this end?\" I asked sadly after a short pause.\n\nShe broke into playful laughter. \"Why things haven't even begun yet.\"\n\n\"You are more heartless than I imagined,\" I replied, hurt.\n\n\"Severin,\" Wanda began earnestly. \"I haven't done anything yet, not\nthe slightest thing, and you are already calling me heartless. What\nwill happen when I begin to carry your dreams to their realization,\nwhen I shall lead a gay, free life and have a circle of admirers\nabout me, when I shall actually fulfil your ideal, tread you\nunderfoot and apply the lash?\"\n\n\"You take my dreams too seriously.\"\n\n\"Too seriously? I can't stop at make-believe, when once I begin,\"\nshe replied. \"You know I hate all play-acting and comedy. You have\nwished it. Was it my idea or yours? Did I persuade you or did you\ninflame my imagination? I am taking things seriously now.\"\n\n\"Wanda,\" I replied, caressingly, \"listen quietly to me. We love each\nother infinitely, we are very happy, will you sacrifice our entire\nfuture to a whim?\"\n\n\"It is no longer a whim,\" she exclaimed.\n\n\"What is it?\" I asked frightened.\n\n\"Something that was probably latent in me,\" she said quietly and\nthoughtfully. \"Perhaps it would never have come to light, if you had\nnot called it to life, and made it grow. Now that it has become a\npowerful impulse, fills my whole being, now that I enjoy it, now that\nI cannot and do not want to do otherwise, now you want to back out--\nyou--are you a man?\"\n\n\"Dear, sweet Wanda!\" I began to caress her, kiss her.\n\n\"Don't--you are not a man--\"\n\n\"And you,\" I flared up.\n\n\"I am stubborn,\" she said, \"you know that. I haven't a strong\nimagination, and like you I am weak in execution. But when I make up\nmy mind to do something, I carry it through, and the more certainly,\nthe more opposition I meet. Leave me alone!\"\n\nShe pushed me away, and got up.\n\n\"Wanda!\" I likewise rose, and stood facing her.\n\n\"Now you know what I am,\" she continued. \"Once more I warn you. You\nstill have the choice. I am not compelling you to be my slave.\"\n\n\"Wanda,\" I replied with emotion and tears filling my eyes, \"don't\nyou know how I love you?\"\n\nHer lips quivered contemptuously.\n\n\"You are mistaken, you make yourself out worse than you are; you are\ngood and noble by nature--\"\n\n\"What do you know about my nature,\" she interrupted vehemently, \"you\nwill get to know me as I am.\"\n\n\"Wanda!\"\n\n\"Decide, will you submit, unconditionally?\"\n\n\"And if I say no.\"\n\n\"Then--\"\n\nShe stepped close up to me, cold and contemptuous. As she stood\nbefore me now, the arms folded across her breast, with an evil smile\nabout her lips, she was in fact the despotic woman of my dreams. Her\nexpression seemed hard, and nothing lay in her eyes that promised\nkindness or mercy.\n\n\"Well--\" she said at last.\n\n\"You are angry,\" I cried, \"you will punish me.\"\n\n\"Oh no!\" she replied, \"I shall let you go. You are free. I am not\nholding you.\"\n\n\"Wanda--I, who love you so--\"\n\n\"Yes, you, my dear sir, you who adore me,\" she exclaimed\ncontemptuously, \"but who are a coward, a liar, and a breaker of\npromises. Leave me instantly--\"\n\n\"Wanda I--\"\n\n\"Wretch!\"\n\nMy blood rose in my heart. I threw myself down at her feet and began\nto cry.\n\n\"Tears, too!\" She began to laugh. Oh, this laughter was frightful.\n\"Leave me--I don't want to see you again.\"\n\n\"Oh my God!\" I cried, beside myself. \"I will do whatever you\ncommand, be your slave, a mere object with which you can do what you\nwill--only don't send me away--I can't bear it--I cannot live without\nyou.\" I embraced her knees, and covered her hand with kisses.\n\n\"Yes, you must be a slave, and feel the lash, for you are not a\nman,\" she said calmly. She said this to me with perfect composure,\nnot angrily, not even excitedly, and it was what hurt most. \"Now I\nknow you, your dog-like nature, that adores where it is kicked, and\nthe more, the more it is maltreated. Now I know you, and now you\nshall come to know me.\"\n\nShe walked up and down with long strides, while I remained crushed\non my knees; my head was hanging supine, tears flowed from my eyes.\n\n\"Come here,\" Wanda commanded harshly, sitting down on the ottoman.\nI obeyed her command, and sat down beside her. She looked at me\nsombrely, and then a light suddenly seemed to illuminate the interior\nof her eye. Smiling, she drew me toward her breast, and began to kiss\nthe tears out of my eyes.\n\n       *       *       *       *       *\n\nThe odd part of my situation is that I am like the bear in Lily's\npark. I can escape and don't want to; I am ready to endure everything\nas soon as she threatens to set me free.\n\n       *       *       *       *       *\n\nIf only she would use the whip again. There is something uncanny in\nthe kindness with which she treats me. I seem like a little captive\nmouse with which a beautiful cat prettily plays. She is ready at any\nmoment to tear it to pieces, and my heart of a mouse threatens to\nburst.\n\nWhat are her intentions? What does she purpose to do with me?\n\n       *       *       *       *       *\n\nIt seems she has completely forgotten the contract, my slavehood. Or\nwas it actually only stubbornness? And she gave up her whole plan as\nsoon as I no longer opposed her and submitted to her imperial whim?\n\nHow kind she is to me, how tender, how loving! We are spending\nmarvellously happy days.\n\nTo-day she had me read to her the scene between Faust and\nMephistopheles, in which the latter appears as a wandering scholar.\nHer glance hung on me with strange pleasure.\n\n\"I don't understand,\" she said when I had finished, \"how a man who\ncan read such great and beautiful thoughts with such expression, and\ninterpret them so clearly, concisely, and intelligently, can at the\nsame time be such a visionary and supersensual ninny as you are.\"\n\n\"Were you pleased,\" said I, and kissed her forehead.\n\nShe gently stroked my brow. \"I love you, Severin,\" she whispered. \"I\ndon't believe I could ever love any one more than you. Let us be\nsensible, what do you say?\"\n\nInstead of replying I folded her in my arms; a deep inward, yet\nvaguely sad happiness filled my breast, my eyes grew moist, and a\ntear fell upon her hand.\n\n\"How can you cry!\" she exclaimed, \"you are a child!\"\n\n       *       *       *       *       *\n\nOn a pleasure drive we met the Russian prince in his carriage. He\nseemed to be unpleasantly surprised to see me by Wanda's side, and\nlooked as if he wanted to pierce her through and through with his\nelectric gray eyes. She, however, did not seem to notice him. I felt\nat that moment like kneeling down before her and kissing her feet.\nShe let her glance glide over him indifferently as though he were an\ninanimate object, a tree, for instance, and turned to me with her\ngracious smile.\n\n       *       *       *       *       *\n\nWhen I said good-night to her to-day she seemed suddenly\nunaccountably distracted and moody. What was occupying her?\n\n\"I am sorry you are going,\" she said when I was already standing on\nthe threshold.\n\n\"It is entirely in your hands to shorten the hard period of my\ntrial, to cease tormenting me--\" I pleaded.\n\n\"Do you imagine that this compulsion isn't a torment for me, too,\"\nWanda interjected.\n\n\"Then end it,\" I exclaimed, embracing her, \"be my wife.\"\n\n\"_Never, Severin_,\" she said gently, but with great firmness.\n\n\"What do you mean?\"\n\nI was frightened in my innermost soul.\n\n\"_You are not the man for me._\"\n\nI looked at her, and slowly withdrew my arm which was still about\nher waist; then I left the room, and she--she did not call me back.\n\n       *       *       *       *       *\n\nA sleepless night; I made countless decisions, only to toss them\naside again. In the morning I wrote her a letter in which I declared\nour relationship dissolved. My hand trembled when I put on the seal,\nand I burned my fingers.\n\nAs I went upstairs to hand it to the maid, my knees threatened to\ngive way.\n\nThe door opened, and Wanda thrust forth her head full of curling-papers.\n\n\"I haven't had my hair dressed yet,\" she said, smiling. \"What have\nyou there?\"\n\n\"A letter--\"\n\n\"For me?\"\n\nI nodded.\n\n\"Ah, you want to break with me,\" she exclaimed, mockingly.\n\n\"Didn't you tell me yesterday that I wasn't the man for you?\"\n\n_\"I repeat it now!\"_\n\n\"Very well, then.\" My whole body was trembling, my voice failed me,\nand I handed her the letter.\n\n\"Keep it,\" she said, measuring me coldly. \"You forget that is no\nlonger a question as to whether you satisfy me as a man; as a _slave_\nyou will doubtless do well enough.\"\n\n\"Madame!\" I exclaimed, aghast.\n\n\"That is what you will call me in the future,\" replied Wanda,\nthrowing back her head with a movement of unutterable contempt. \"Put\nyour affairs in order within the next twenty-four hours. The day\nafter to-morrow I shall start for Italy, and you will accompany me\nas my servant.\"\n\n\"Wanda--\"\n\n\"I forbid any sort of familiarity,\" she said, cutting my words short,\n\"likewise you are not to come in unless I call or ring for you, and\nyou are not to speak to me until you are spoken to. From now on your\nname is no longer Severin, but _Gregor_.\"\n\nI trembled with rage, and yet, unfortunately, I cannot deny it, I\nalso felt a strange pleasure and stimulation.\n\n\"But, madame, you know my circumstances,\" I began in my confusion.\n\"I am dependent on my father, and I doubt whether he will give me the\nlarge sum of money needed for this journey--\"\n\n\"That means you have no money, Gregor,\" said Wanda, delightedly, \"so\nmuch the better, you are then entirely dependent on me, and in fact\nmy slave.\"\n\n\"You don't consider,\" I tried to object, \"that as man of honor it is\nimpossible for me--\"\n\n\"I have indeed considered it,\" she replied almost with a tone of\ncommand. \"As a man of honor you must keep your oath and redeem your\npromise to follow me as slave whithersoever I demand and to obey\nwhatever I command. Now leave me, Gregor!\"\n\nI turned toward the door.\n\n\"Not yet--you may first kiss my hand.\" She held it out to me with a\ncertain proud indifference, and I the dilettante, the donkey, the\nmiserable slave pressed it with intense tenderness against my lips\nwhich were dry and hot with excitement.\n\nThere was another gracious nod of the head.\n\nThen I was dismissed.\n\n       *       *       *       *       *\n\nThough it was late in the evening my light was still lit, and a fire\nwas burning in the large green stove. There were still many things\namong my letters and documents to be put in order. Autumn, as is\nusually the case with us, had fallen with all its power.\n\nSuddenly she knocked at my window with the handle of her whip.\n\nI opened and saw her standing outside in her ermine-lined jacket and\nin a high round Cossack cap of ermine of the kind which the great\nCatherine favored.\n\n\"Are you ready, Gregor?\" she asked darkly.\n\n\"Not yet, mistress,\" I replied.\n\n\"I like that word,\" she said then, \"you are always to call me\nmistress, do you understand? We leave here to-morrow morning at nine\no'clock. As far as the district capital you will be my companion and\nfriend, but from the moment that we enter the railway-coach you are\nmy slave, my servant. Now close the window, and open the door.\"\n\nAfter I had done as she had demanded, and after she had entered, she\nasked, contracting her brows ironically, \"well, how do you like me.\"\n\n\"Wanda, you--\"\n\n\"Who gave you permission?\" She gave me a blow with the whip.\n\n\"You are very beautiful, mistress.\"\n\nWanda smiled and sat down in the arm-chair. \"Kneel down--here beside\nmy chair.\"\n\nI obeyed.\n\n\"Kiss my hand.\"\n\nI seized her small cold hand and kissed it.\n\n\"And the mouth--\"\n\nIn a surge of passion I threw my arms around the beautiful cruel\nwoman, and covered her face, arms, and breast with glowing kisses.\nShe returned them with equal fervor--the eyelids closed as in a\ndream. It was after midnight when she left.\n\n       *       *       *       *       *\n\nAt nine o'clock sharp in the morning everything was ready for departure,\nas she had ordered. We left the little Carpathian health-resort in a\ncomfortable light carriage. The most interesting drama of my life had\nreached a point of development whose denouement it was then impossible\nto foretell.\n\nSo far everything went well. I sat beside Wanda, and she chatted\nvery graciously and intelligently with me, as with a good friend,\nconcerning Italy, Pisemski's new novel, and Wagner's music. She wore\na sort of Amazonesque travelling-dress of black cloth with a short\njacket of the same material, set with dark fur. It fitted closely and\nshowed her figure to best advantage. Over it she wore dark furs. Her\nhair wound into an antique knot, lay beneath a small dark fur-hat\nfrom which a black veil hung. Wanda was in very good humor; she fed\nme candies, played with my hair, loosened my neck cloth and made a\npretty cockade of it; she covered my knees with her furs and\nstealthily pressed the fingers of my hand. When our Jewish driver\npersistently went on nodding to himself, she even gave me a kiss, and\nher cold lips had the fresh frosty fragrance of a young autumnal\nrose, which blossoms alone amid bare stalks and yellow leaves and\nupon whose calyx the first frost has hung tiny diamonds of ice.\n\n       *       *       *       *       *\n\nWe are at the district capital. We get out at the railway station.\nWanda throws off her furs and places them over my arm, and goes\nto secure the tickets.\n\nWhen she returns she has completely changed.\n\n\"Here is your ticket, Gregor,\" she says in a tone which supercilious\nladies use to their servants.\n\n\"A third-class ticket,\" I reply with comic horror.\n\n\"Of course,\" she continues, \"but now be careful. You won't get on\nuntil I am settled in my compartment and don't need you any longer.\nAt each station you will hurry to my car and ask for my orders. Don't\nforget. And now give me my furs.\"\n\nAfter I had helped her into them, humbly like a slave, she went to\nfind an empty first-class coupe. I followed. Supporting herself on\nmy shoulder, she got on and I wrapped her feet in bear-skins and placed\nthem on the warming bottle.\n\nThen she nodded to me, and dismissed me. I slowly ascended a third-class\ncarriage, which was filled with abominable tobacco-smoke that seemed\nlike the fogs of Acheron at the entrance to Hades. I now had the leisure\nto muse about the riddle of human existence, and about its greatest\nriddle of all--_woman_.\n\n       *       *       *       *       *\n\nWhenever the train stops, I jump off, run to her carriage, and with\ndrawn cap await her orders. She wants coffee and then a glass of\nwater, at another time a bowl of warm water to wash her hands, and\nthus it goes on. She lets several men who have entered her\ncompartment pay court to her. I am dying of jealousy and have to leap\nabout like an antelope so as to secure what she wants quickly and\nnot miss the train.\n\nIn this way the night passes. I haven't had time to eat a mouthful\nand I can't sleep, I have to breathe the same oniony air with Polish\npeasants, Jewish peddlers, and common soldiers.\n\nWhen I mount the steps of her coupe, she is lying stretched out\non cushions in her comfortable furs, covered up with the skins of\nanimals. She is like an oriental despot, and the men sit like Indian\ndeities, straight upright against the walls and scarcely dare to\nbreathe.\n\n       *       *       *       *       *\n\nShe stops over in Vienna for a day to go shopping, and particularly\nto buy series of luxurious gowns. She continues to treat me as her\nservant. I follow her at the respectful distance of ten paces. She\nhands me her packages without so much as even deigning a kind look,\nand laden down like a donkey I pant along behind.\n\nBefore leaving she takes all my clothes and gives them to the hotel\nwaiters. I am ordered to put on her livery. It is a Cracovian costume\nin her colors, light-blue with red facings, and red quadrangular cap,\nornamented with peacock-feathers. The costume is rather becoming to\nme.\n\nThe silver buttons bear her coat of arms. I have the feeling of having\nbeen sold or of having bonded myself to the devil. My fair demon leads\nme from Vienna to Florence. Instead of linen-garbed Mazovians and\ngreasy-haired Jews, my companions now are curly-haired Contadini, a\nmagnificent sergeant of the first Italian Grenadiers, and a poor German\npainter. The tobacco smoke no longer smells of onions, but of salami and\ncheese.\n\nNight has fallen again. I lie on my wooden bed as on a rack; my arms and\nlegs seem broken. But there nevertheless is an element of poetry in the\naffair. The stars sparkle round about, the Italian sergeant has a face\nlike Apollo Belvedere, and the German painter sings a lovely German\nsong.\n\n  \"Now that all the shadows gather\n  And endless stars grow light,\n  Deep yearning on me falls\n  And softly fills the night.\"\n\n  \"Through the sea of dreams\n  Sailing without cease,\n  Sailing goes my soul\n  In thine to find release.\"\n\nAnd I am thinking of the beautiful woman who is sleeping in regal\ncomfort among her soft furs.\n\n       *       *       *       *       *\n\nFlorence! Crowds, cries, importunate porters and cab-drivers. Wanda\nchooses a carriage, and dismisses the porters.\n\n\"What have I a servant for,\" she says, \"Gregor--here is the ticket--\nget the luggage.\"\n\nShe wraps herself in her furs and sits quietly in the carriage while I\ndrag the heavy trunks hither, one after another. I break down for a\nmoment under the last one; a good-natured _carabiniere_ with an\nintelligent face comes to my assistance. She laughs.\n\n\"It must be heavy,\" said she, \"all my furs are in it.\"\n\nI get up on the driver's seat, wiping drops of perspiration from my\nbrow. She gives the name of the hotel, and the driver urges on his\nhorse. In a few minutes we halt at the brilliantly illuminated\nentrance.\n\n\"Have you any rooms?\" she asks the portier.\n\n\"Yes, madame.\"\n\n\"Two for me, one for my servant, all with stoves.\"\n\n\"Two first-class rooms for you, madame, both with stoves,\" replied\nthe waiter who had hastily come up, \"and one without heat for your\nservant.\"\n\nShe looked at them, and then abruptly said: \"they are satisfactory,\nhave fires built at once; my servant can sleep in the unheated room.\"\n\nI merely looked at her.\n\n\"Bring up the trunks, Gregor,\" she commands, paying no attention to\nmy looks. \"In the meantime I'll be dressing, and then will go down\nto the dining-room, and you can eat something for supper.\"\n\nAs she goes into the adjoining room, I drag the trunks upstairs and\nhelp the waiter build a fire in her bed-room. He tries to question\nme in bad French about my employer. With a brief glance I see the\nblazing fire, the fragrant white poster-bed, and the rugs which cover\nthe floor. Tired and hungry I then descend the stairs, and ask for\nsomething to eat. A good-natured waiter, who used to be in the\nAustrian army and takes all sorts of pains to entertain me in German,\nshows me the dining-room and waits on me. I have just had the first\nfresh drink in thirty-six hours and the first bite of warm food on\nmy fork, when she enters.\n\nI rise.\n\n\"What do you mean by taking me into a dining-room in which my\nservant is eating,\" she snaps at the waiter, flaring with anger. She\nturns around and leaves.\n\nMeanwhile I thank heaven that I am permitted to go on eating. Later\nI climb the four flights upstairs to my room. My small trunk is\nalready there, and a miserable little oil-lamp is burning. It is a\nnarrow room without fire-place, without a window, but with a small\nair-hole. If it weren't so beastly cold, it would remind me of one\nof the Venetian _piombi_. [Footnote: These were notorious prisons\nunder the leaden roof of the Palace of the Doges.] Involuntarily I\nhave to laugh out aloud, so that it re-echoes, and I am startled by\nmy own laughter.\n\nSuddenly the door is pulled open and the waiter with a theatrical\nItalian gesture calls \"You are to come down to madame, at once.\" I\npick up my cap, stumble down the first few steps, but finally arrive\nin front of her door on the first floor and knock.\n\n\"Come in!\"\n\nI enter, shut the door, and stand attention.\n\nWanda has made herself comfortable. She is sitting in a neglige of\nwhite muslin and laces on a small red divan with her feet on a\nfootstool that matches. She has thrown her fur-cloak about her. It\nis the identical cloak in which she appeared to me for the first time,\nas goddess of love.\n\nThe yellow lights of the candelabra which stand on projections,\ntheir reflections in the large mirrors, and the red flames from the\nopen fireplace play beautifully on the green velvet, the dark-brown\nsable of the cloak, the smooth white skin, and the red, flaming hair\nof the beautiful woman. Her clear, but cold face is turned toward me,\nand her cold green eyes rest upon me.\n\n\"I am satisfied with you, Gregor,\" she began.\n\nI bowed.\n\n\"Come closer.\"\n\nI obeyed.\n\n\"Still closer,\" she looked down, and stroked the sable with her\nhand. \"Venus in Furs receives her slave. I can see that you are more\nthan an ordinary dreamer, you don't remain far in arrears of your\ndreams; you are the sort of man who is ready to carry his dreams into\neffect, no matter how mad they are. I confess, I like this; it\nimpresses me. There is strength in this, and strength is the only\nthing one respects. I actually believe that under unusual\ncircumstances, in a period of great deeds, what seems to be your\nweakness would reveal itself as extraordinary power. Under the early\nemperors you would have been a martyr, at the time of the Reformation\nan anabaptist, during the French Revolution one of those inspired\nGirondists who mounted the guillotine with the marseillaise on their\nlips. But you are my slave, my--\"\n\nShe suddenly leaped up; the furs slipped down, and she threw her\narms with soft pressure about my neck.\n\n\"My beloved slave, Severin, oh, how I love you, how I adore you, how\nhandsome you are in your Cracovian costume! You will be cold to-night\nup in your wretched room without a fire. Shall I give you one of my\nfurs, dear heart, the large one there--\"\n\nShe quickly picked it up, throwing it over my shoulders, and before\nI knew what had happened I was completely wrapped up in it.\n\n\"How wonderfully becoming furs are to your face, they bring out your\nnoble lines. As soon as you cease being my slave, you must wear a\nvelvet coat with sable, do you understand? Otherwise I shall never\nput on my fur-jacket again.\"\n\nAnd again she began to caress me and kiss me; finally she drew me\ndown on the little divan.\n\n\"You seem to be pleased with yourself in furs,\" she said. \"Quick,\nquick, give them to me, or I will lose all sense of dignity.\"\n\nI placed the furs about her, and Wanda slipped her right arm into\nthe sleeve.\n\n\"This is the pose in Titian's picture. But now enough of joking.\nDon't always look so solemn, it makes me feel sad. As far as the\nworld is concerned you are still merely my servant; you are not yet\nmy slave, for you have not yet signed the contract. You are still\nfree, and can leave me any moment. You have played your part\nmagnificently. I have been delighted, but aren't you tired of it\nalready, and don't you think I am abominable? Well, say something--I\ncommand it.\"\n\n\"Must I confess to you, Wanda?\" I began.\n\n\"Yes, you must.\"\n\n\"Even it you take advantage of it,\" I continued, \"I shall love you\nthe more deeply, adore you the more fanatically, the worse you treat\nme. What you have just done inflames my blood and intoxicates all my\nsenses.\" I held her close to me and clung for several moments to her\nmoist lips.\n\n\"Oh, you beautiful woman,\" I then exclaimed, looking at her. In my\nenthusiasm I tore the sable from her shoulders and pressed my mouth\nagainst her neck.\n\n\"You love me even when I am cruel,\" said Wanda, \"now go!--you bore\nme--don't you hear?\"\n\nShe boxed my ears so that I saw stars and bells rang in my ears.\n\n\"Help me into my furs, slave.\"\n\nI helped her, as well as I could.\n\n\"How awkward,\" she exclaimed, and was scarcely in it before she\nstruck me in the face again. I felt myself growing pale.\n\n\"Did I hurt you?\" she asked, softly touching me with her hand.\n\n\"No, no,\" I exclaimed.\n\n\"At any rate you have no reason to complain, you want it thus; now\nkiss me again.\"\n\nI threw my arms about her, and her lips clung closely to mine. As\nshe lay against my breast in her large heavy furs, I had a curiously\noppressive sensation. It was as if a wild beast, a she-bear, were\nembracing me. It seemed as if I were about to feel her claws in my\nflesh. But this time the she-bear let me off easily.\n\nWith my heart filled with smiling hopes, I went up to my miserable\nservant's room, and threw myself down on my hard couch.\n\n\"Life is really amazingly droll,\" I thought. \"A short time ago the\nmost beautiful woman, Venus herself, rested against your breast, and\nnow you have an opportunity for studying the Chinese hell. Unlike us,\nthey don't hurl the damned into flames, but they have devils chasing\nthem out into fields of ice.\n\n\"Very likely the founders of their religion also slept in unheated\nrooms.\"\n\n       *       *       *       *       *\n\nDuring the night I startled out of my sleep with a scream. I had\nbeen dreaming of an icefield in which I had lost my way; I had been\nlooking in vain for a way out. Suddenly an eskimo drove up in a\nsleigh harnessed with reindeer; he had the face of the waiter who had\nshown me to the unheated room.\n\n\"What are you looking for here, my dear sir?\" he exclaimed. \"This is\nthe North Pole.\"\n\nA moment later he had disappeared, and Wanda flew over the smooth\nice on tiny skates. Her white satin skirt fluttered and crackled; the\nermine of her jacket and cap, but especially her face, gleamed whiter\nthan the snow. She shot toward me, inclosed me in her arms, and began\nto kiss me. Suddenly I felt my blood running warm down my side.\n\n\"What are you doing?\" I asked horror-stricken.\n\nShe laughed, and as I looked at her now, it was no longer Wanda, but\na huge, white she-bear, who was digging her paws into my body.\n\nI cried out in despair, and still heard her diabolical laughter when\nI awoke, and looked about the room in surprise.\n\nEarly in the morning I stood at Wanda's door, and the waiter brought\nthe coffee. I took it from him, and served it to my beautiful\nmistress. She had already dressed, and looked magnificent, all fresh\nand roseate. She smiled graciously at me and called me back, when I\nwas about to withdraw respectfully.\n\n\"Come, Gregor, have your breakfast quickly too,\" she said, \"then we\nwill go house-hunting. I don't want to stay in the hotel any longer\nthan I have to. It is very embarassing here. If I chat with you for\nmore than a minute, people will immediately say: 'The fair Russian\nis having an affair with her servant, you see, the race of Catherines\nisn't extinct yet.'\"\n\nHalf an hour later we went out; Wanda was in her cloth-gown with the\nRussian cap, and I in my Cracovian costume. We created quite a stir. I\nwalked about ten paces behind, looking very solemn, but expected\nmomentarily to have to break out into loud laughter. There was scarcely\na street in which one or the other of the attractive houses did not bear\nthe sign _camere ammobiliate_. Wanda always sent me upstairs, and only\nwhen the apartment seemed to answer her requirements did she herself\nascend. By noon I was as tired as a stag-hound after the hunt.\n\nWe entered a new house and left it again without having found a suitable\nhabitation. Wanda was already somewhat out of humor. Suddenly she said\nto me: \"Severin, the seriousness with which you play your part is\ncharming, and the restrictions, which we have placed upon each other are\nreally annoying me. I can't stand it any longer, I do love you, I must\nkiss you. Let's go into one of the houses.\"\n\n\"But, my lady--\" I interposed.\n\n\"Gregor?\" She entered the next open corridor and ascended a few\nsteps of the dark stair-way; then she threw her arms about me with\npassionate tenderness and kissed me.\n\n\"Oh, Severin, you were very wise. You are much more dangerous as\nslave than I would have imagined; you are positively irrestible, and\nI am afraid I shall have to fall in love with you again.\"\n\n\"Don't you love me any longer then,\" I asked seized by a sudden\nfright.\n\nShe solemnly shook her head, but kissed me again with her swelling,\nadorable lips.\n\nWe returned to the hotel. Wanda had luncheon, and ordered me also\nquickly to get something to eat.\n\nOf course, I wasn't served as quickly as she, and so it happened\nthat just as I was carrying the second bite of my steak to my mouth,\nthe waiter entered and called out with his theatrical gesture:\n\"Madame wants you, at once.\"\n\nI took a rapid and painful leave of my food, and, tired and hungry,\nhurried toward Wanda, who was already on the street.\n\n\"I wouldn't have imagined you could be so cruel,\" I said\nreproachfully. \"With all these, fatiguing duties you don't even leave\nme time to eat in peace.\"\n\nWanda laughed gaily. \"I thought you had finished,\" she said, \"but\nnever mind. Man was born to suffer, and you in particular. The\nmartyrs didn't have any beefsteaks either.\"\n\nI followed her resentfully, gnawing at my hunger.\n\n\"I have given up the idea of finding a place in the city,\" Wanda\ncontinued. \"It will be difficult to find an entire floor which is\nshut off and where you can do as you please. In such a strange, mad\nrelationship as ours there must be no jarring note. I shall rent an\nentire villa--and you will be surprised. You have my permission now\nto satisfy your hunger, and look about a bit in Florence. I won't be\nhome till evening. If I need you then, I will have you called.\"\n\nI looked at the Duomo, the Palazzo Vecchio, the Logia di Lanzi, and\nthen I stood for a long time on the banks of the Arno. Again and\nagain I let my eyes rest on the magnificent ancient Florence, whose\nround cupolas and towers were drawn in soft lines against the blue,\ncloudless sky. I watched its splendid bridges beneath whose wide\narches the lively waves of the beautiful, yellow river ran, and the\ngreen hills which surrounded the city, bearing slender cypresses and\nextensive buildings, palaces and monasteries.\n\nIt is a different world, this one in which we are--a gay, sensuous,\nsmiling world. The landscape too has nothing of the seriousness and\nsomberness of ours. It is a long ways off to the last white villas\nscattered among the pale green of the mountains, and yet there isn't\na spot that isn't bright with sunlight. The people are less serious\nthan we; perhaps, they think less, but they all look as though they\nwere happy.\n\nIt is also maintained that death is easier in the South.\n\nI have a vague feeling now that such a thing as beauty without thorn\nand love of the senses without torment does exist.\n\nWanda has discovered a delightful little villa and rented it for the\nwinter. It is situated on a charming hill on the left bank of the\nArno, opposite the Cascine. It is surrounded by an attractive garden\nwith lovely paths, grass plots, and magnificent meadow of camelias.\nIt is only two stories high, quadrangular in the Italian fashion. An\nopen gallery runs along one side, a sort of loggia with plaster-casts\nof antique statues; stone steps lead from it down into the garden.\nFrom the gallery you enter a bath with a magnificent marble basin,\nfrom which winding stairs lead to my mistress' bed-chamber.\n\nWanda occupies the second story by herself.\n\nA room on the ground floor has been assigned to me; it is very\nattractive, and even has a fireplace.\n\nI have roamed through the garden. On a round hillock I discovered a\nlittle temple, but I found its door locked. However, there is a chink\nin the door and when I glue my eye to it, I see the goddess of love\non a white pedestal.\n\nA slight shudder passes over me. It seems to me as if she were\nsmiling at me saying: \"Are you there? I have been expecting you.\"\n\n       *       *       *       *       *\n\nIt is evening. An attractive maid brings me orders to appear before\nmy mistress. I ascend the wide marble stairs, pass through the\nanteroom, a large salon furnished with extravagant magnificence, and\nknock at the door of the bedroom. I knock very softly for the luxury\ndisplayed everywhere intimidates me. Consequently no one hears me,\nand I stand for some time in front of the door. I have a feeling as\nif I were standing before the bed-room of the great Catherine, and\nit seems as if at any moment she might come out in her green sleeping\nfurs, with the red ribbon and decoration on her bare breast, and with\nher little white powdered curls.\n\nI knocked again. Wanda impatiently pulls the door open.\n\n\"Why so late?\" she asks.\n\n\"I was standing in front of the door, but you didn't hear me knock,\"\nI reply timidly. She closes the door, and clinging to me, she leads\nme to the red damask ottoman on which she had been resting. The\nentire arrangement of the room is in red damask--wall-paper,\ncurtains, portieres, hangings of the bed. A magnificent painting of\nSamson and Delilah forms the ceiling.\n\nWanda receives me in an intoxicating dishabille. Her white satin\ndress flows gracefully and picturesquely down her slender body,\nleaving her arms and breast bare, and carelessly they nestle amid the\ndark hair of the great fur of sable, lined with green velvet. Her red\nhair falls down her back as far as the hips, only half held by\nstrings of black pearls.\n\n\"Venus in Furs,\" I whisper, while she draws me to her breast and\nthreatens to stifle me with her kisses. Then I no longer speak and\nneither do I think; everything is drowned out in an ocean of\nunimagined bliss.\n\n\"Do you still love me?\" she asks, her eye softening in passionate\ntenderness.\n\n\"You ask!\" I exclaimed.\n\n\"You still remember your oath,\" she continued with an alluring\nsmile, \"now that everything is prepared, everything in readiness, I\nask you once more, is it still your serious wish to become my slave?\"\n\n\"Am I not ready?\" I asked in surprise.\n\n\"You have not yet signed the papers.\"\n\n\"Papers--what papers?\"\n\n\"Oh, I see, you want to give it up,\" she said, \"well then, we will\nlet it go.\"\n\n\"But Wanda,\" I said, \"you know that nothing gives me greater\nhappiness than to serve you, to be your slave. I would give\neverything for the sake of feeling myself wholly in your power, even\nunto death--\"\n\n\"How beautiful you are,\" she whispered, \"when you speak so\nenthusiastically, so passionately. I am more in love with you than\never and you want me to be dominant, stern, and cruel. I am afraid,\nit will be impossible for me to be so.\"\n\n\"I am not afraid,\" I replied smiling, \"where are the papers?'\"\n\n\"So that you may know what it means to be absolutely in my power, I\nhave drafted a second agreement in which you declare that you have\ndecided to kill yourself. In that way I can even kill you, if I so\ndesire.\"\n\n\"Give them to me.\"\n\nWhile I was unfolding the documents and reading them, Wanda got pen\nand ink. She then sat down beside me with her arm about my neck, and\nlooked over my shoulder at the paper.\n\nThe first one read:\n\nAGREEMENT BETWEEN MME. VON DUNAJEW AND SEVERIN VON KUSIEMSKI\n\n\"Severin von Kusiemski ceases with the present day being the affianced\nof Mme. Wanda von Dunajew, and renounces all the rights appertaining\nthereunto; he on the contrary binds himself on his word of honor as a\nman and nobleman, that hereafter he will be her _slave_ until such\ntime that she herself sets him at liberty again.\n\n\"As the slave of Mme. von Dunajew he is to bear the name Gregor, and\nhe is unconditionally to comply with every one of her wishes, and to\nobey every one of her commands; he is always to be submissive to his\nmistress, and is to consider her every sign of favor as an\nextraordinary mercy.\n\n\"Mme. von Dunajew is entitled not only to punish her slave as she\ndeems best, even for the slightest inadvertence or fault, but also\nis herewith given the right to torture him as the mood may seize her\nor merely for the sake of whiling away the time. Should she so desire,\nshe may kill him whenever she wishes; in short, he is her\nunrestricted property.\n\n\"Should Mme. von Dunajew ever set her slave at liberty, Severin von\nKusiemski agrees to forget everything that he has experienced or\nsuffered as her slave, and promises _never under any circumstances and\nin no wise to think of vengeance or retaliation_.\n\n\"Mme. von Dunajew on her behalf agrees as his mistress to appear as\noften as possible in her furs, especially when she purposes some\ncruelty toward her slave.\"\n\nAppended at the bottom of the agreement was the date of the present\nday.\n\nThe second document contained only a few words.\n\n\"Having since many years become weary of existence and its\nillusions, I have of my own free will put an end to my worthless\nlife.\"\n\nI was seized with a deep horror when I had finished. There was still\ntime, I could still withdraw, but the madness of passion and the\nsight of the beautiful woman that lay all relaxed against my shoulder\ncarried me away.\n\n\"This one you will have to copy, Severin,\" said Wanda, indicating\nthe second document. \"It has to be entirely in your own handwriting;\nthis, of course, isn't necessary in the case of the agreement.\"\n\nI quickly copied the few lines in which I designated myself a\nsuicide, and handed them to Wanda. She read them, and put them on the\ntable with a smile.\n\n\"Now have you the courage to sign it?\" she asked with a crafty\nsmile, inclining her head.\n\nI took the pen.\n\n\"Let me sign first,\" said Wanda, \"your hand is trembling, are you\nafraid of the happiness that is to be yours?\"\n\nShe took the agreement and pen. While engaging in my internal struggle,\nI looked upward for a moment. It occurred to me that the painting on the\nceiling, like many of those of the Italian and Dutch schools, was\nutterly unhistorical, but this very fact gave it a strange mood which\nhad an almost uncanny effect on me. Delilah, an opulent woman with\nflaming red hair, lay extended, half-disrobed, in a dark fur-cloak, upon\na red ottoman, and bent smiling over Samson who had been overthrown and\nbound by the Philistines. Her smile in its mocking coquetry was full of\na diabolical cruelty; her eyes, half-closed, met Samson's, and his with\na last look of insane passion cling to hers, for already one of his\nenemies is kneeling on his breast with the red-hot iron to blind him.\n\n\"Now--\" said Wanda. \"Why you are all lost in thought. What is the\nmatter with you, everything will remain just as it was, even after\nyou have signed, don't you know me yet, dear heart?\"\n\nI looked at the agreement. Her name was written there in bold\nletters. I peered once more into her eyes with their potent magic,\nthen I took the pen and quickly signed the agreement.\n\n\"You are trembling,\" said Wanda calmly, \"shall I help you?\"\n\nShe gently took hold of my hand, and my name appeared at the bottom\nof the second paper. Wanda looked once more at the two documents, and\nthen locked them in the desk which stood at the head of the ottoman.\n\n\"Now then, give me your passport and money.\"\n\nI took out my wallet and handed it to her. She inspected it, nodded,\nand put it with other things while in a sweet drunkenness I kneeled\nbefore her leaning my head against her breast.\n\nSuddenly she thrusts me away with her foot, leaps up, and pulls the\nbell-rope. In answer to its sound three young, slender negresses\nenter; they are as if carved of ebony, and are dressed from head to\nfoot in red satin; each one has a rope in her hand.\n\nSuddenly I realize my position, and am about to rise. Wanda stands\nproudly erect, her cold beautiful face with its sombre brows and\ncontemptous eyes is turned toward me. She stands before me as\nmistress, commanding, gives a sign with her hand, and before I really\nknow what has happened to me the negresses have dragged me to the\nground, and have tied me hand and foot. As in the case of one about\nto be executed my arms are bound behind my back, so that I can\nscarcely move.\n\n\"Give me the whip, Haydee,\" commands Wanda, with unearthly calm.\n\nThe negress hands it to her mistress, kneeling.\n\n\"And now take off my heavy furs,\" she continues, \"they impede me.\"\n\nThe negress obeyed.\n\n\"The jacket there!\" Wanda commanded.\n\nHaydee quickly brought her the _kazabaika_, set with ermine, which lay\non the bed, and Wanda slipped into it with two inimitably graceful\nmovements.\n\n\"Now tie him to the pillar here!\"\n\nThe negresses lifted me up, and twisting a heavy rope around my\nbody, tied me standing against one of the massive pillars which\nsupported the top of the wide Italian bed.\n\nThen they suddenly disappeared, as if the earth had swallowed them.\n\nWanda swiftly approached me. Her white satin dress flowed behind her\nin a long train, like silver, like moonlight; her hair flared like\nflames against the white fur of her jacket. Now she stood in front\nof me with her left hand firmly planted on her hips, in her right hand\nshe held the whip. She uttered an abrupt laugh.\n\n\"Now play has come to an end between us,\" she said with heartless\ncoldness. \"Now we will begin in dead earnest. You fool, I laugh at you\nand despise you; you who in your insane infatuation have given\nyourself as a plaything to _me_, the frivolous and capricious woman.\nYou are no longer the man I love, but _my slave_, at my mercy even\nunto life and death.\n\n\"You shall know me!\n\n\"First of all you shall have a taste of the whip in all seriousness,\nwithout having done anything to deserve it, so that you may\nunderstand what to expect, if you are awkward, disobedient, or\nrefractory.\"\n\nWith a wild grace she rolled back her fur-lined sleeve, and struck\nme across the back.\n\nI winced, for the whip cut like a knife into my flesh.\n\n\"Well, how do you like that?\" she exclaimed.\n\nI was silent.\n\n\"Just wait, you will yet whine like a dog beneath my whip,\" she\nthreatened, and simultaneously began to strike me again.\n\nThe blows fell quickly, in rapid succession, with terrific force\nupon my back, arms, and neck; I had to grit my teeth not to scream\naloud. Now she struck me in the face, warm blood ran down, but she\nlaughed, and continued her blows.\n\n\"It is only now I understand you,\" she exclaimed. \"It really is a\njoy to have some one so completely in one's power, and a man at that,\nwho loves you--you do love me?--No--Oh! I'll tear you to shreds yet,\nand with each blow my pleasure will grow. Now, twist like a worm,\nscream, whine! You will find no mercy in me!\"\n\nFinally she seemed tired.\n\nShe tossed the whip aside, stretched out on the ottoman, and rang.\n\nThe negresses entered.\n\n\"Untie him!\"\n\nAs they loosened the rope, I fell to the floor like a lump of wood.\nThe black women grinned, showing their white teeth.\n\n\"Untie the rope around his feet.\"\n\nThey did it, but I was unable to rise.\n\n\"Come over here, Gregor.\"\n\nI approached the beautiful woman. Never did she seem more seductive\nto me than to-day in spite of all her cruelty and contempt.\n\n\"One step further,\" Wanda commanded. \"Now kneel down, and kiss my\nfoot.\"\n\nShe extended her foot beyond the hem of white satin, and I, the\nsupersensual fool, pressed my lips upon it.\n\n\"Now, you won't lay eyes on me for an entire month, Gregor,\" she\nsaid seriously. \"I want to become a stranger to you, so you will more\neasily adjust yourself to our new relationship. In the meantime you\nwill work in the garden, and await my orders. Now, off with you,\nslave!\"\n\n       *       *       *       *       *\n\nA month has passed with monotonous regularity, heavy work, and a\nmelancholy hunger, hunger for her, who is inflicting all these\ntorments on me.\n\nI am under the gardener's orders; I help him lop the trees and prune\nthe hedges, transplant flowers, turn over the flower beds, sweep the\ngravel paths; I share his coarse food and his hard cot; I rise and\ngo to bed with the chickens. Now and then I hear that our mistress\nis amusing herself, surrounded by admirers. Once I heard her gay\nlaughter even down here in the garden.\n\nI seem awfully stupid to myself. Was it the result of my present\nlife, or was I so before? The month is drawing to a close--the day\nafter to-morrow. What will she do with me now, or has she forgotten\nme, and left me to trim hedges and bind bouquets till my dying day?\n\nA written order.\n\n\"The slave Gregor is herewith ordered to my personal service.\n\nWanda Dunajew.\"\n\nWith a beating heart I draw aside the damask curtain on the\nfollowing morning, and enter the bed-room of my divinity. It is still\nfilled with a pleasant half darkness.\n\n\"Is it you, Gregor?\" she asks, while I kneel before the fire-place,\nbuilding a fire. I tremble at the sound of the beloved voice. I\ncannot see her herself; she is invisible behind the curtains of the\nfour-poster bed.\n\n\"Yes, my mistress,\" I reply.\n\n\"How late is it?\"\n\n\"Past nine o'clock.\"\n\n\"Breakfast.\"\n\nI hasten to get it, and then kneel down with the tray beside her bed.\n\n\"Here is breakfast, my mistress.\"\n\nWanda draws back the curtains, and curiously enough at the first\nglance when I see her among the pillows with loosened flowing hair,\nshe seems an absolute stranger, a beautiful woman, but the beloved\nsoft lines are gone. This face is hard and has an expression of\nweariness and satiety.\n\nOr is it simply that formerly my eye did not see this?\n\nShe fixes her green eyes upon me, more with curiosity than with\nmenace, perhaps even somewhat pityingly, and lazily pulls the dark\nsleeping fur on which she lies over the bared shoulder.\n\nAt this moment she is very charming, very maddening, and I feel my\nblood rising to my head and heart. The tray in my hands begins to\nsway. She notices it and reached out for the whip which is lying on\nthe toilet-table.\n\n\"You are awkward, slave,\" she says furrowing her brow.\n\nI lower my looks to the ground, and hold the tray as steadily as\npossible. She eats her breakfast, yawns, and stretches her opulent\nlimbs in the magnificent furs.\n\nShe has rung. I enter.\n\n\"Take this letter to Prince Corsini.\"\n\nI hurry into the city, and hand the letter to the Prince. He is a\nhandsome young man with glowing black eyes. Consumed with jealousy,\nI take his answer to her.\n\n\"What is the matter with you?\" she asks with lurking spitefulness.\n\"You are very pale.\"\n\n\"Nothing, mistress, I merely walked rather fast.\"\n\nAt luncheon the prince is at her side, and I am condemned to serve\nboth her and him. They joke, and I am, as if non-existent, for both.\nFor a brief moment I see black; I was just pouring some Bordeaux into\nhis glass, and spilled it over the table-cloth and her gown.\n\n\"How awkward,\" Wanda exclaimed and slapped my face. The prince\nlaughed, and she also, but I felt the blood rising to my face.\n\nAfter luncheon she drove in the Cascine. She has a little carriage\nwith a handsome, brown English horse, and holds the reins herself.\nI sit behind and notice how coquettishly she acts, and nods with a\nsmile when one of the distinguished gentlemen bows to her.\n\nAs I help her out of the carriage, she leans lightly on my arm; the\ncontact runs through me like an electric shock. She _is_ a wonderful\nwoman, and I love her more than ever.\n\n       *       *       *       *       *\n\nFor dinner at six she has invited a small group of men and women. I\nserve, but this time I do not spill any wine over the table-cloth.\n\nA slap in the face is more effective than ten lectures. It makes you\nunderstand very quickly, especially when the instruction is by the\nway of a small woman's hand.\n\n       *       *       *       *       *\n\nAfter dinner she drives to the Pergola Theater. As she descends the\nstairs in her black velvet dress with its large collar of ermine and\nwith a diadem of white roses on her hair, she is literally stunning.\nI open the carriage-door, and help her in. In front of the theater\nI leap from the driver's seat, and in alighting she leaned on my arm,\nwhich trembled under the sweet burden. I open the door of her box,\nand then wait in the vestibule. The performance lasts four hours; she\nreceives visits from her cavaliers, the while I grit my teeth with\nrage.\n\nIt is way beyond midnight when my mistress's bell sounds for the\nlast time.\n\n\"Fire!\" she orders abruptly, and when the fire-place crackles, \"Tea!\"\n\nWhen I return with the samovar, she has already undressed, and with\nthe aid of the negress slipped into a white negligee.\n\nHaydee thereupon leaves.\n\n\"Hand me the sleeping-furs,\" says Wanda, sleepily stretching her\nlovely limbs. I take them from the arm-chair, and hold them while she\nslowly and lazily slides into the sleeves. She then throws herself\ndown on the cushions of the ottoman.\n\n\"Take off my shoes, and put on my velvet slippers.\"\n\nI kneel down and tug at the little shoe which resists my efforts.\n\"Hurry, hurry!\" Wanda exclaims, \"you are hurting me! just you wait--I\nwill teach you.\" She strikes me with the whip, but now the shoe is\noff.\n\n\"Now get out!\" Still a kick--and then I can go to bed.\n\n       *       *       *       *       *\n\nTo-night I accompanied her to a soiree. In the entrance-hall she\nordered me to help her out of her furs; then with a proud smile,\nconfident of victory, she entered the brilliantly illuminated room.\nI again waited with gloomy and monotonous thoughts, watching hour after\nhour run by. From time to time the sounds of music reached me, when\nthe door remained open for a moment. Several servants tried to start\na conversation with me, but soon desisted, since I knew only a few\nwords of Italian.\n\nFinally I fell asleep, and dreamed that I murdered Wanda in a\nviolent attack of jealousy. I was condemned to death, and saw myself\nstrapped on the board; the knife fell, I felt it on my neck, but I\nwas still alive--\n\nThen the executioner slapped my face.\n\nNo, it wasn't the executioner; it was Wanda who stood wrathfully\nbefore me demanding her furs. I am at her side in a moment, and help\nher on with it.\n\nThere is a deep joy in wrapping a beautiful woman into her furs, and\nin seeing and feeling how her neck and magnificent limbs nestle in\nthe precious soft furs, and to lift the flowing hair over the collar.\nWhen she throws it off a soft warmth and a faint fragrance of her\nbody still clings to the ends of the hairs of sable. It is enough to\ndrive one mad.\n\n       *       *       *       *       *\n\nFinally a day came when there were neither guests, nor theater, nor\nother company. I breathed a sigh of relief. Wanda sat in the gallery,\nreading, and apparently had no orders for me. At dusk when the\nsilvery evening mists fell she withdrew. I served her at dinner, she\nate by herself, but had not a look, not a syllable for me, not even\na slap in the face.\n\nI actually desire a slap from her hand. Tears fill my eyes, and I\nfeel that she has humiliated me so deeply, that she doesn't even find\nit worth while to torture or maltreat me any further.\n\nBefore she goes to bed, her bell calls me.\n\n\"You will sleep here to-night, I had horrible dreams last night, and\nam afraid of being alone. Take one of the cushions from the ottoman,\nand lie down on the bearskin at my feet.\"\n\nThen Wanda put out the lights. The only illumination in the room was\nfrom a small lamp suspended from the ceiling. She herself got into\nbed. \"Don't stir, so as not to wake me.\"\n\nI did as she had commanded, but could not fall asleep for a long\ntime. I saw the beautiful woman, beautiful as a goddess, lying on her\nback on the dark sleeping-furs; her arms beneath her neck, with a\nflood of red hair over them. I heard her magnificent breast rise in\ndeep regular breathing, and whenever she moved ever so slightly. I\nwoke up and listened to see whether she needed me.\n\nBut she did not require me.\n\nNo task was required of me; I meant no more to her than a night-lamp, or\na revolver which one places under one's pillow.\n\n       *       *       *       *       *\n\nAm I mad or is she? Does all this arise out of an inventive, wanton\nwoman's brain with the intention of surpassing my supersensual\nfantasies, or is this woman really one of those Neronian characters\nwho take a diabolical pleasure in treading underfoot, like a worm,\nhuman beings, who have thoughts and feelings and a will like theirs?\n\nWhat have I experienced?\n\nWhen I knelt with the coffee-tray beside her bed, Wanda suddenly\nplaced her hand on my shoulder and her eyes plunged deep into mine.\n\n\"What beautiful eyes you have,\" she said softly, \"and especially now\nsince you suffer. Are you very unhappy?\"\n\nI bowed my head, and kept silent.\n\n\"Severin, do you still love me,\" she suddenly exclaimed\npassionately, \"can you still love me?\"\n\nShe drew me close with such vehemence that the coffee-tray upset,\nthe can and cups fell to the floor, and the coffee ran over the\ncarpet.\n\n\"Wanda--my Wanda,\" I cried out and held her passionately against me;\nI covered her mouth, face, and breast with kisses.\n\n\"It is my unhappiness that I love you more and more madly the worse\nyou treat me, the more frequently you betray me. Oh, I shall die of\npain and love and jealousy.\"\n\n\"But I haven't betrayed you, as yet, Severin,\" replied Wanda smiling.\n\n\"Not? Wanda! Don't jest so mercilessly with me,\" I cried. \"Haven't\nI myself taken the letter to the Prince--\"\n\n\"Of course, it was an invitation for luncheon.\"\n\n\"You have, since we have been in Florence--\"\n\n\"I have been absolutely faithful to you,\" replied Wanda, \"I swear it\nby all that is holy to me. All that I have done was merely to fulfill\nyour dream and it was done for your sake.\n\n\"However, I shall take a lover, otherwise things will be only half\naccomplished, and in the end you will yet reproach me with not having\ntreated you cruelly enough, my dear beautiful slave! But to-day you\nshall be Severin again, the only one I love. I haven't given away\nyour clothes. They are here in the chest. Go and dress as you used\nto in the little Carpathian health-resort when our love was so intimate.\nForget everything that has happened since; oh, you will forget it\neasily in my arms; I shall kiss away all your sorrows.\"\n\nShe began to treat me tenderly like a child, to kiss me and caress\nme. Finally she said with a gracious smile, \"Go now and dress, I too\nwill dress. Shall I put on my fur-jacket? Oh yes, I know, now run\nalong!\"\n\nWhen I returned she was standing in the center of the room in her\nwhite satin dress, and the red _kazabaika_ edged with ermine; her hair\nwas white with powder and over her forehead she wore a small diamond\ndiadem. For a moment she reminded me in an uncanny way of Catherine\nthe Second, but she did not give me much time for reminiscences. She\ndrew me down on the ottoman beside her and we enjoyed two blissful\nhours. She was no longer the stern capricious mistress, she was\nentirely a fine lady, a tender sweetheart. She showed me photographs\nand books which had just appeared, and talked about them with so much\nintelligence, clarity, and good taste, that I more than once carried\nher hand to my lips, enraptured. She then had me recite several of\nLermontov's poems, and when I was all afire with enthusiasm, she\nplaced her small hand gently on mine. Her expression was soft, and her\neyes were filled with tender pleasure.\n\n\"Are you happy?\"\n\n\"Not yet.\"\n\nShe then leaned back on the cushions, and slowly opened her\n_kazabaika_.\n\nBut I quickly covered the half-bared breast again with the ermine.\n\"You are driving me mad.\" I stammered.\n\n\"Come!\"\n\nI was already lying in her arms, and like a serpent she was kissing\nme with her tongue, when again she whispered, \"Are you happy?\"\n\n\"Infinitely!\" I exclaimed.\n\nShe laughed aloud. It was an evil, shrill laugh which made cold\nshivers run down by back.\n\n\"You used to dream of being the slave, the plaything of a beautiful\nwoman, and now you imagine you are a free human being, a man, my\nlover-you fool! A sign from me, and you are a slave again. Down on\nyour knees!\"\n\nI sank down from the ottoman to her feet, but my eye still clung\ndoubtingly on hers.\n\n\"You can't believe it,\" she said, looking at me with her arms folded\nacross her breast. \"I am bored, and you will just do to while away\na couple of hours of time. Don't look at me that way--\"\n\nShe kicked me with her foot.\n\n\"You are just what I want, a human being, a thing, an animal--\"\n\nShe rang. The three negresses entered.\n\n\"Tie his hands behind his back.\"\n\nI remained kneeling and unresistingly let them do this. They led me\ninto the garden, down to the little vineyard, which forms the\nsouthern boundary. Corn had been planted between the espaliers, and\nhere and there a few dead stalks still stood. To one side was a\nplough.\n\nThe negresses tied me to a post, and amused themselves sticking me\nwith their golden hair-needles. But this did not last long, before\nWanda appeared with her ermine cap on her head, and with her hands\nin the pockets of her jacket. She had me untied, and then my hands\nwere fastened together on my back. She finally had a yoke put around\nmy neck, and harnessed me to the plough.\n\nThen her black demons drove me out into the field. One of them held\nthe plough, the other one led me by a line, the third applied the\nwhip, and Venus in Furs stood to one side and looked on.\n\n       *       *       *       *       *\n\nWhen I was serving dinner on the following day Wanda said: \"Bring\nanother cover, I want you to dine with me to-day,\" and when I was\nabout to sit down opposite her, she added, \"No, over here, close by\nmy side.\"\n\nShe is in the best of humors, gives me soup with her spoon, feeds me\nwith her fork, and places her head on the table like a playful kitten\nand flirts with me. I have the misfortune of looking at Haydee, who\nserves in my place, perhaps a little longer than is necessary. It is\nonly now that I noticed her noble, almost European cast of\ncountenance and her magnificent statuesque bust, which is as if hewn\nout of black marble. The black devil observes that she pleases me,\nand, grinning, shows her teeth. She has hardly left the room, before\nWanda leaps up in a rage.\n\n\"What, you dare to look at another woman besides me! Perhaps you\nlike her even better than you do me, she is even more demonic!\"\n\nI am frightened; I have never seen her like this before; she is\nsuddenly pale even to the lips and her whole body trembles. Venus in\nFurs is jealous of her slave. She snatches the whip from its hook and\nstrikes me in the face; then she calls her black servants, who bind\nme, and carry me down into the cellar, where they throw me into a\ndark, dank, subterranean compartment, a veritable prison-cell.\n\nThen the lock of the door clicks, the bolts are drawn, a key sings\nin the lock. I am a prisoner, buried.\n\nI have been lying here for I don't know how long, bound like a calf\nabout to be hauled to the slaughter, on a bundle of damp straw,\nwithout any light, without food, without drink, without sleep. It\nwould be like her to let me starve to death, if I don't freeze to\ndeath before then. I am shaking with cold. Or is it fever? I believe\nI am beginning to hate this woman.\n\n       *       *       *       *       *\n\nA red streak, like blood, floods across the floor; it is a light\nfalling through the door which is now thrust open.\n\nWanda appears on the threshold, wrapped in her sables, holding a\nlighted torch.\n\n\"Are you still alive?\" she asks.\n\n\"Are you coming to kill me?\" I reply with a low, hoarse voice.\n\nWith two rapid strides Wanda reaches my side, she kneels down beside\nme, and places my head in her lap. \"Are you ill? Your eyes glow so,\ndo you love me? I want you to love me.\"\n\nShe draws forth a short dagger. I start with fright when its blade\ngleams in front of my eyes. I actually believe that she is about to\nkill me. She laughs, and cuts the ropes that bind me.\n\n       *       *       *       *       *\n\nEvery evening after dinner she now has me called. I have to read to\nher, and she discusses with me all sorts of interesting problems and\nsubjects. She seems entirely transformed; it is as if she were\nashamed of the savagery which she betrayed to me and of the cruelty\nwith which she treated me. A touching gentleness transfigures her\nentire being, and when at the good-night she gives me her hand, a\nsuperhuman power of goodness and love lies in her eyes, of the kind\nwhich calls forth tears in us and causes us to forget all the\nmiseries of existence and all the terrors of death.\n\n       *       *       *       *       *\n\nI am reading _Manon l'Escault_ to her. She feels the association, she\ndoesn't say a word, but she smiles from time to time, and finally she\nshuts up the little book.\n\n\"Don't you want to go on reading?\"\n\n\"Not to-day. We will ourselves act _Manon l'Escault_ to-day. I have a\nrendezvous in the Cascine, and you, my dear Chevalier, will accompany\nme; I know, you will do it, won't you?\"\n\n\"You command it.\"\n\n\"I do not command it, I beg it of you,\" she says with irresistible\ncharm. She then rises, puts her hands on my shoulders, and looks at\nme.\n\n\"Your eyes!\" she exclaims. \"I love you, Severin, you have no idea\nhow I love you!\"\n\n\"Yes, I have!\" I replied bitterly, \"so much so that you have\narranged for a rendezvous with some one else.\"\n\n\"I do this only to allure you the more,\" she replied vivaciously. \"I\nmust have admirers, so as not to lose you. I don't ever want to lose\nyou, never, do you hear, for I love only you, you alone.\"\n\nShe clung passionately to my lips.\n\n\"Oh, if I only could, as I would, give you all of my soul in a kiss--\nthus--but now come.\"\n\nShe slipped into a simple black velvet coat, and put a dark _bashlyk_\n[Footnote: A kind of Russian cap.] on her head. Then she rapidly went\nthrough the gallery, and entered the carriage.\n\n\"Gregor will drive,\" she called out to the coachman who withdrew in\nsurprise.\n\nI ascended the driver's seat, and angrily whipped up the horses.\n\nIn the Cascine where the main roadway turns into a leafy path, Wanda\ngot out. It was night, only occasional stars shone through the gray\nclouds that fled across the sky. By the bank of the Arno stood a man\nin a dark cloak, with a brigand's hat, and looked at the yellow\nwaves. Wanda rapidly walked through the shrubbery, and tapped him on\nthe shoulder. I saw him turn and seize her hand, and then they\ndisappeared behind the green wall.\n\nAn hour full of torments. Finally there was a rustling in the bushes\nto one side, and they returned.\n\nThe man accompanied her to the carriage. The light of the lamp fell\nfull and glaringly upon an infinitely young, soft and dreamy face\nwhich I had never before seen, and played in his long, blond curls.\n\nShe held out her hand which he kissed with deep respect, then she\nsignaled to me, and immediately the carriage flew along the leafy\nwall which follows the river like a long green screen.\n\n       *       *       *       *       *\n\nThe bell at the garden-gate rings. It is a familiar face. The man\nfrom the Cascine.\n\n\"Whom shall I announce?\" I ask him in French. He timidly shakes his\nhead.\n\n\"Do you, perhaps, understand some German?\" he asks shyly.\n\n\"Yes. Your name, please.\"\n\n\"Oh! I haven't any yet,\" he replies, embarrassed--\"Tell your\nmistress the German painter from the Cascine is here and would like--\nbut there she is herself.\"\n\nWanda had stepped out on the balcony, and nodded toward the stranger.\n\n\"Gregor, show the gentleman in!\" she called to me.\n\nI showed the painter the stairs.\n\n\"Thanks, I'll find her now, thanks, thanks very much.\" He ran up the\nsteps. I remained standing below, and looked with deep pity on the\npoor German.\n\nVenus in Furs has caught his soul in the red snares of hair. He will\npaint her, and go mad.\n\n       *       *       *       *       *\n\nIt is a sunny winter's day. Something that looks like gold trembles\non the leaves of the clusters of trees down below in the green level\nof the meadow. The camelias at the foot of the gallery are glorious\nin their abundant buds. Wanda is sitting in the loggia; she is\ndrawing. The German painter stands opposite her with his hands folded\nas in adoration, and looks at her. No, he rather looks at her face,\nand is entirely absorbed in it, enraptured.\n\nBut she does not see him, neither does she see me, who with the\nspade in my hand am turning over the flower-bed, solely that I may\nsee her and feel her nearness, which produces an effect on me like\npoetry, like music.\n\n       *       *       *       *       *\n\nThe painter has gone. It is a hazardous thing to do, but I risk it.\nI go up to the gallery, quite close, and ask Wanda \"Do you love the\npainter, mistress?\"\n\nShe looks at me without getting angry, shakes her head, and finally\neven smiles.\n\n\"I feel sorry for him,\" she replies, \"but I do not love him. I love no\none. _I used to love you, as ardently, as passionately, as deeply as\nit was possible for me to love,_ but now I don't love even you any\nmore; my heart is a void, dead, and this makes me sad.\"\n\n\"Wanda!\" I exclaimed, deeply moved.\n\n\"Soon, you too will no longer love me,\" she continued, \"tell me when\nyou have reached that point, and I will give back to you your\nfreedom.\"\n\n\"Then I shall remain your slave, all my life long, for I adore you\nand shall always adore you,\" I cried, seized by that fanaticism of\nlove which has repeatedly been so fatal to me.\n\nWanda looked at me with a curious pleasure. \"Consider well what you\ndo,\" she said. \"I have loved you infinitely and have been despotic\ntowards you so that I might fulfil your dream. Something of my old\nfeeling, a sort of real sympathy for you, still trembles in my\nbreast. When that too has gone who knows whether then I shall give\nyou your liberty; whether I shall not then become really cruel,\nmerciless, even brutal toward; whether I shall not take a diabolical\npleasure in tormenting and putting on the rack the man who worships\nme idolatrously, the while I remain indifferent or love someone else;\nperhaps, I shall enjoy seeing him die of his love for me. Consider\nthis well.\"\n\n\"I have long since considered all that,\" I replied as in a glow of\nfever. \"I cannot exist, cannot live without you; I shall die if you\nset me at liberty; let me remain your slave, kill me, but do not\ndrive me away.\"\n\n\"Very well then, be my slave,\" she replied, \"but don't forget that\nI no longer love you, and your love doesn't mean any more to me than\na dog's, and dogs are kicked.\"\n\n       *       *       *       *       *\n\nTo-day I visited the Venus of Medici.\n\nIt was still early, and the little octagonal room in the Tribuna was\nfilled with half-lights like a sanctuary; I stood with folded hands\nin deep adoration before the silent image of the divinity.\n\nBut I did not stand for long.\n\nNot a human soul was in the gallery, not even an Englishman, and I\nfell down on my knees. I looked up at the lovely slender body, the\nbudding breasts, the virginal and yet voluptuous face, the fragrant\ncurls which seemed to conceal tiny horns on each side of the forehead.\n\n       *       *       *       *       *\n\nMy mistress's bell.\n\nIt is noonday. She, however, is still abed with her arms intertwined\nbehind her neck.\n\n\"I want to bathe,\" she says, \"and you will attend me. Lock the door!\"\n\nI obey.\n\n\"Now go downstairs and make sure the door below is also locked.\"\n\nI descended the winding stairs that lead from her bedroom to the\nbath; my feet gave way beneath me, and I had to support myself\nagainst the iron banister. After having ascertained that the door\nleading to the Loggia and the garden was locked, I returned. Wanda\nwas now sitting on the bed with loosened hair, wrapped in her green\nvelvet furs. When she made a rapid movement, I noticed that the furs\nwere her only covering. It made me start terribly, I don't know why?\nI was like one condemned to death, who knows he is on the way to the\nscaffold, and yet begins to tremble when he sees it.\n\n\"Come, Gregor, take me on your arms.\"\n\n\"You mean, mistress?\"\n\n\"You are to carry me, don't you understand?\"\n\nI lifted her up, so that she rested in my arms, while she twined\nhers around my neck. Slowly, step by step, I went down the stairs\nwith her and her hair beat from time to time against my cheek and her\nfoot sought support against my knee. I trembled under the beautiful\nburden I was carrying, and every moment it seemed as if I had to\nbreak down beneath it.\n\nThe bath consisted of a wide, high rotunda, which received a soft\nquiet light from a red glass cupola above. Two palms extended their\nbroad leaves like a roof over a couch of velvet cushions. From here\nsteps covered with Turkish rugs led to the white marble basin which\noccupied the center.\n\n\"There is a green ribbon on my toilet-table upstairs,\" said Wanda,\nas I let her down on the couch, \"go get it, and also bring the whip.\"\n\nI flew upstairs and back again, and kneeling put both in my mistress's\nhands. She then had me twist her heavy electric hair into a large knot\nwhich I fastened with the green ribbon. Then I prepared the bath. I did\nthis very awkwardly because my hands and feet refused to obey me. Again\nand again I had to look at the beautiful woman lying on the red velvet\ncushions, and from time to time her wonderful body gleamed here and\nthere beneath the furs. Some magnetic power stronger than my will\ncompelled me to look. I felt that all sensuality and lustfulness lies in\nthat which is half-concealed or intentionally disclosed; and the truth\nof this I recognized even more acutely, when the basin at last was full,\nand Wanda threw off the fur-cloak with a single gesture, and stood\nbefore me like the goddess in the Tribuna.\n\nAt that moment she seemed as sacred and chaste to me in her unveiled\nbeauty, as did the divinity of long ago. I sank down on my knees\nbefore her, and devoutly pressed my lips on her foot.\n\nMy soul which had been storm-tossed only a little while earlier,\nsuddenly was perfectly calm, and I now felt no element of cruelty in\nWanda.\n\nShe slowly descended the stairs, and I could watch her with a\ncalmness in which not a single atom of torment or desire was\nintermingled. I could see her plunge into and rise out of the\ncrystalline water, and the wavelets which she herself raised played\nabout her like tender lovers.\n\nOur nihilistic aesthetician is right when he says: a real apple is\nmore beautiful than a painted one, and a living woman is more\nbeautiful than a Venus of stone.\n\nAnd when she left the bath, and the silvery drops and the roseate\nlight rippled down her body, I was seized with silent rapture. I\nwrapped the linen sheets about her, drying her glorious body. The\ncalm bliss remained with me, even now when one foot upon me as upon\na footstool, she rested on the cushions in her large velvet cloak.\nThe lithe sables nestled desirously against her cold marble-like body.\nHer left arm on which she supported herself lay like a sleeping swan\nin the dark fur of the sleeve, while her left hand played carelessly\nwith the whip.\n\nBy chance my look fell on the massive mirror on the wall opposite,\nand I cried out, for I saw the two of us in its golden frame as in\na picture. The picture was so marvellously beautiful, so strange, so\nimaginative, that I was filled with deep sorrow at the thought that\nits lines and colors would have to dissolve like mist.\n\n\"What is the matter?\" asked Wanda.\n\nI pointed to the mirror.\n\n\"Ah, that is really beautiful,\" she exclaimed, \"too bad one can't\ncapture the moment and make it permanent.\"\n\n\"And why not?\" I asked. \"Would not any artist, even the most famous,\nbe proud if you gave him leave to paint you and make you immortal by\nmeans of his brush.\n\n\"The very thought that this extra-ordinary beauty is to be lost to\nthe world,\" I continued still watching her enthusiastically, \"is\nhorrible--all this glorious facial expression, this mysterious eye\nwith its green fires, this demonic hair, this magnificence of body.\nThe idea fills me with a horror of death, of annihilation. But the\nhand of an artist shall snatch you from this. You shall not like the\nrest of us disappear absolutely and forever, without leaving a trace\nof your having been. Your picture must live, even when you yourself\nhave long fallen to dust; your beauty must triumph beyond death!\"\n\nWanda smiled.\n\n\"Too bad, that present-day Italy hasn't a Titian or Raphael,\" she\nsaid, \"but, perhaps, love will make amends for genius, who knows; our\nlittle German might do?\" She pondered.\n\n\"Yes, he shall paint you, and I will see to it that the god of love\nmixes his colors.\"\n\n       *       *       *       *       *\n\nThe young painter has established his studio in her villa; he is\ncompletely in her net. He has just begun a Madonna, a Madonna with\nred hair and green eyes! Only the idealism of a German would attempt\nto use this thorough-bred woman as a model for a picture of\nvirginity. The poor fellow really is an almost bigger donkey than I\nam. Our misfortune is that our Titania has discovered our ass's ears\ntoo soon.\n\n       *       *       *       *       *\n\nNow she laughs derisively at us, and how she laughs! I hear her\ninsolent melodious laughter in his studio, under the open window of\nwhich I stand, jealously listening.\n\n       *       *       *       *       *\n\n\"Are you mad, me--ah, it is unbelievable, me as the Mother of God!\"\nshe exclaimed and laughed again. \"Wait a moment, I will show you\nanother picture of myself, one that I myself have painted, and you\nshall copy it.\"\n\nHer head appeared in the window, luminous like a flame under the\nsunlight.\n\n\"Gregor!\"\n\nI hurried up the stairs, through the gallery, into the studio.\n\n\"Lead him to the bath,\" Wanda commanded, while she herself hurried\naway.\n\nA few moments passed and Wanda arrived; dressed in nothing but the\nsable fur, with the whip in her hand; she descended the stairs and\nstretched out on the velvet cushions as on the former occasion. I lay\nat her feet and she placed one of her feet upon me; her right hand\nplayed with the whip. \"Look at me,\" she said, \"with your deep,\nfanatical look, that's it.\"\n\nThe painter had turned terribly pale. He devoured the scene with his\nbeautiful dreamy blue eyes; his lips opened, but he remained dumb.\n\n\"Well, how do you like the picture?\"\n\n\"Yes, that is how I want to paint you,\" said the German, but it was\nreally not a spoken language; it was the eloquent moaning, the\nweeping of a sick soul, a soul sick unto death.\n\n       *       *       *       *       *\n\nThe charcoal outline of the painting is done; the heads and flesh\nparts are painted in. Her diabolical face is already becoming visible\nunder a few bold strokes, life flashes in her green eyes.\n\nWanda stands in front of the canvas with her arms crossed over her\nbreast.\n\n\"This picture, like many of those of the Venetian school, is\nsimultaneously to represent a portrait and to tell a story,\"\nexplained the painter, who again had become pale as death.\n\n\"And what will you call it?\" she asked, \"but what is the matter with\nyou, are you ill?\"\n\n\"I am afraid--\" he answered with a consuming look fixed on the\nbeautiful woman in furs, \"but let us talk of the picture.\"\n\n\"Yes, let us talk about the picture.\"\n\n\"I imagine the goddess of love as having descended from Mount Olympus\nfor the sake of some mortal man. And always cold in this modern world\nof ours, she seeks to keep her sublime body warm in a large heavy fur\nand her feet in the lap of her lover. I imagine the favorite of a\nbeautiful despot, who whips her slave, when she is tired of kissing\nhim, and the more she treads him underfoot, the more insanely he loves\nher. And so I shall call the picture: _Venus in Furs_.\"\n\n       *       *       *       *       *\n\nThe painter paints slowly, but his passion grows more and more\nrapidly. I am afraid he will end up by committing suicide. She plays\nwith him and propounds riddles to him which he cannot solve, and he\nfeels his blood congealing in the process, but it amuses her.\n\nDuring the sitting she nibbles at candies, and rolls the paper-wrappers\ninto little pellets with which she bombards him.\n\n\"I am glad you are in such good humor,\" said the painter, \"but your face\nhas lost the expression which I need for my picture.\"\n\n\"The expression which you need for your picture,\" she replied,\nsmiling. \"Wait a moment.\"\n\nShe rose, and dealt me a blow with the whip. The painter looked at\nher with stupefaction, and a child-like surprise showed on his face,\nmingled with disgust and admiration.\n\nWhile whipping me, Wanda's face acquired more and more of the cruel,\ncontemptuous character, which so haunts and intoxicates me.\n\n\"Is this the expression you need for your picture?\" she exclaimed.\nThe painter lowered his look in confusion before the cold ray of her\neye.\n\n\"It is the expression--\" he stammered, \"but I can't paint now--\"\n\n\"What?\" said Wanda, scornfully, \"perhaps I can help you?\"\n\n\"Yes--\" cried the German, as if taken with madness, \"whip me too.\"\n\n\"Oh! With pleasure,\" she replied, shrugging her shoulders, \"but if\nI am to whip you I want to do it in sober earnest.\"\n\n\"Whip me to death,\" cried the painter.\n\n\"Will you let me tie you?\" she asked, smiling.\n\n\"Yes--\" he moaned--\n\nWanda left the room for a moment, and returned with ropes.\n\n\"Well--are you still brave enough to put yourself into the power of\nVenus in Furs, the beautiful despot, for better or worse?\" she began\nironically.\n\n\"Yes, tie me,\" the painter replied dully. Wanda tied his hands on\nhis back and drew a rope through his arms and a second one around his\nbody, and fettered him to the cross-bars of the window. Then she\nrolled back the fur, seized the whip, and stepped in front of him.\n\nThe scene had a grim attraction for me, which I cannot describe. I\nfelt my heart beat, when, with a smile, she drew back her arm for the\nfirst blow, and the whip hissed through the air. He winced slightly\nunder the blow. Then she let blow after blow rain upon him, with her\nmouth half-opened and her teeth flashing between her red lips, until\nhe finally seemed to ask for mercy with his piteous, blue eyes. It\nwas indescribable.\n\n       *       *       *       *       *\n\nShe is sitting for him now, alone. He is working on her head.\n\nShe has posted me in the adjoining room behind a heavy curtain,\nwhere I can't be seen, but can see everything.\n\nWhat does she intend now?\n\nIs she afraid of him? She has driven him insane enough to be sure,\nor is she hatching a new torment for me? My knees tremble.\n\nThey are talking. He has lowered his voice so that I cannot\nunderstand a word, and she replies in the same way. What is the\nmeaning of this? Is there an understanding between them?\n\nI suffer frightful torments; my heart seems about to burst.\n\nHe kneels down before her, embraces her, and presses his head\nagainst her breast, and she--in her heartlessness--laughs--and now\nI hear her saying aloud:\n\n\"Ah! You need another application of the whip.\"\n\n\"Woman! Goddess! Are you without a heart--can't you love,\" exclaimed\nthe German, \"don't you even know, what it means to love, to be\nconsumed with desire and passion, can't you even imagine what I\nsuffer? Have you no pity for me?\"\n\n\"No!\" she replied proudly and mockingly, \"but I have the whip.\"\n\nShe drew it quickly from the pocket of her fur-coat, and struck him\nin the face with the handle. He rose, and drew back a couple of paces.\n\n\"Now, are you ready to paint again?\" she asked indifferently. He did\nnot reply, but again went to the easel and took up his brush and\npalette.\n\nThe painting is marvellously successful. It is a portrait which as\nfar as the likeness goes couldn't be better, and at the same time it\nseems to have an ideal quality. The colors glow, are supernatural;\nalmost diabolical, I would call them.\n\nThe painter has put all his sufferings, his adoration, and all his\nexecration into the picture.\n\n       *       *       *       *       *\n\nNow he is painting me; we are alone together for several hours every\nday. To-day he suddenly turned to me with his vibrant voice and said:\n\n\"You love this woman?\"\n\n\"Yes.\"\n\n\"I also love her.\" His eyes were bathed in tears. He remained silent\nfor a while, and continued painting.\n\n\"We have a mountain at home in Germany within which she dwells,\" he\nmurmured to himself. \"She is a demon.\"\n\n       *       *       *       *       *\n\nThe picture is finished. She insisted on paying him for it,\nmunificently, in the manner of queens.\n\n\"Oh, you have already paid me,\" he said, with a tormented smile,\nrefusing her offer.\n\nBefore he left, he secretly opened his portfolio, and let me look\ninside. I was startled. Her head looked at me as if out of a mirror\nand seemed actually to be alive.\n\n\"I shall take it along,\" he said, \"it is mine; she can't take it\naway from me. I have earned it with my heart's blood.\"\n\n       *       *       *       *       *\n\n\"I am really rather sorry for the poor painter,\" she said to me to-day,\n\"it is absurd to be as virtuous as I am. Don't you think so too?\"\n\nI did not dare to reply to her.\n\n\"Oh, I forgot that I am talking with a slave; I need some fresh air,\nI want to be diverted, I want to forget.\n\n\"The carriage, quick!\"\n\nHer new dress is extravagant: Russian half-boots of violet-blue\nvelvet trimmed with ermine, and a skirt of the same material,\ndecorated with narrow stripes and rosettes of furs. Above it is an\nappropriate, close-fitting jacket, also richly trimmed and lined with\nermine. The headdress is a tall cap of ermine of the style of\nCatherine the Second, with a small aigrette, held in place by a\ndiamond-agraffe; her red hair falls loose down her back. She ascends\non the driver's seat, and holds the reins herself; I take my seat\nbehind. How she lashes on the horses! The carriage flies along like\nmad.\n\nApparently it is her intention to attract attention to-day, to make\nconquests, and she succeeds completely. She is the lioness of the\nCascine. People nod to her from carriages; on the footpath people\ngather in groups to discuss her. She pays no attention to anyone,\nexcept now and then acknowledging the greetings of elderly gentlemen\nwith a slight nod.\n\nSuddenly a young man on a lithe black horse dashes up at full speed.\nAs soon as he sees Wanda, he stops his horse and makes it walk. When\nhe is quite close, he stops entirely and lets her pass. And she too\nsees him--the lioness, the lion. Their eyes meet. She madly drives\npast him, but she cannot tear herself free from the magic power of\nhis look, and she turns her head after him.\n\nMy heart stops when I see the half-surprised, half-enraptured look\nwith which she devours him, but he is worthy of it.\n\nFor he is, indeed, a magnificent specimen of man, No, rather, he is\na man whose like I have never yet seen among the living. He is in the\nBelvedere, graven in marble, with the same slender, yet steely\nmusculature, with the same face and the same waving curls. What makes\nhim particularly beautiful is that he is beardless. If his hips were\nless narrow, one might take him for a woman in disguise. The curious\nexpression about the mouth, the lion's lip which slightly discloses\nthe teeth beneath, lends a flashing tinge of cruelty to the beautiful\nface--\n\nApollo flaying Marsyas.\n\nHe wears high black boots, closely fitting breeches of white\nleather, short fur coat of black cloth, of the kind worn by Italian\ncavalry officers, trimmed with astrakhan and many rich loops; on his\nblack locks is a red fez.\n\nI now understand the masculine Eros, and I marvel at Socrates for\nhaving remained virtuous in view of an Alcibiades like this.\n\n       *       *       *       *       *\n\nI have never seen my lioness so excited. Her cheeks flamed when she\nleft from the carriage at her villa. She hurried upstairs, and with\nan imperious gesture ordered me to follow.\n\nWalking up and down her room with long strides, she began to talk so\nrapidly, that I was frightened.\n\n\"You are to find out who the man in the Cascine was, immediately--\n\n\"Oh, what a man! Did you see him? What do you think of him? Tell me.\"\n\n\"The man is beautiful,\" I replied dully.\n\n\"He is so beautiful,\" she paused, supporting herself on the arm of\na chair, \"that he has taken my breath away.\"\n\n\"I can understand the impression he has made on you,\" I replied, my\nimagination carrying me away in a mad whirl. \"I am quite lost in\nadmiration myself, and I can imagine--\"\n\n\"You may imagine,\" she laughed aloud, \"that this man is my lover,\nand that he will apply the lash to you, and that you will enjoy being\npunished by him.\n\n\"But now go, go.\"\n\n       *       *       *       *       *\n\nBefore evening fell, I had the desired information.\n\nWanda was still fully dressed when I returned. She reclined on the\nottoman, her face buried in her hands, her hair in a wild tangle,\nlike the red mane of a lioness.\n\n\"What is his name?\" she asked, uncanny calm.\n\n\"Alexis Papadopolis.\"\n\n\"A Greek, then,\"\n\nI nodded.\n\n\"He is very young?\"\n\n\"Scarcely older than you. They say he was educated in Paris, and\nthat he is an atheist. He fought against the Turks in Candia, and is\nsaid to have distinguished himself there no less by his race-hatred\nand cruelty, than by his bravery.\"\n\n\"All in all, then, a man,\" she cried with sparkling eyes.\n\n\"At present he is living in Florence,\" I continued, \"he is said to\nbe tremendously rich--\"\n\n\"I didn't ask you about that,\" she interrupted quickly and sharply.\n\"The man is dangerous. Aren't you afraid of him? I am afraid of him.\nHas he a wife?\"\n\n\"No.\"\n\n\"A mistress?\"\n\n\"No.\"\n\n\"What theaters does he attend?\"\n\n\"To-night he will be at the Nicolini Theater, where Virginia Marini\nand Salvini are acting; they are the greatest living artists in\nItaly, perhaps in Europe.\n\n\"See that you get a box--and be quick about it!\" she commanded.\n\n\"But, mistress--\"\n\n\"Do you want a taste of the whip?\"\n\n       *       *       *       *       *\n\n\"You can wait down in the lobby,\" she said when I had placed the\nopera-glasses and the programme on the edge of her box and adjusted\nthe footstool.\n\nI am standing there and had to lean against the wall for support so\nas not to fall down with envy and rage--no, rage isn't the right\nword; it was a mortal fear.\n\nI saw her in her box dressed in blue moire, with a huge ermine cloak\nabout her bare shoulders; he sat opposite. I saw them devour each\nother with their eyes. For both of them the stage, Goldoni's _Pamela,_\nSalvini, Marini, the public, even the entire world, were non-existant\nto-night. And I--what was I at that moment?--\n\n       *       *       *       *       *\n\nTo-day she is attending the ball at the Greek ambassador's. Does she\nknow, that she will meet him there?\n\nAt any rate she dressed, as if she did. A heavy sea-green silk dress\nplastically encloses her divine form, leaving the bust and arms bare. In\nher hair, which is done into a single flaming knot, a white water-lily\nblossoms; from it the leaves of reeds interwoven with a few loose\nstrands fall down toward her neck. There no longer is any trace of\nagitation or trembling feverishness in her being. She is calm, so calm,\nthat I feel my blood congealing and my heart growing cold under her\nglance. Slowly, with a weary, indolent majesty, she ascends the marble\nstaircase, lets her precious wrap slide off, and listlessly enters the\nhall, where the smoke of a hundred candles has formed a silvery mist.\n\nFor a few moments my eyes follow her in a daze, then I pick up her\nfurs, which without my being aware, had slipped from my hands. They\nare still warm from her shoulders.\n\nI kiss the spot, and my eyes fill with tears.\n\n       *       *       *       *       *\n\nHe has arrived.\n\nIn his black velvet coat extravagantly trimmed with sable, he is a\nbeautiful, haughty despot who plays with the lives and souls of men.\nHe stands in the ante-room, looking around proudly, and his eyes rest\non me for an uncomfortably long time.\n\nUnder his icy glance I am again seized by a mortal fear. I have a\npresentiment that this man can enchain her, captivate her, subjugate\nher, and I feel inferior in contrast with his savage masculinity; I\nam filled with envy, with jealousy.\n\nI feel that I am a queer weakly creature of brains, merely! And what\nis most humiliating, I want to hate him, but I can't. Why is that\namong all the host of servants he has chosen me.\n\nWith an inimitably aristocratic nod of the head he calls me over to\nhim, and I--I obey his call--against my own will.\n\n\"Take my furs,\" he quickly commands.\n\nMy entire body trembles with resentment, but I obey, abjectly like\na slave.\n\n       *       *       *       *       *\n\nAll night long I waited in the ante-room, raving as in a fever.\nStrange images hovered past my inner eye. I saw their meeting--their\nlong exchange of looks. I saw her float through the hall in his arms,\ndrunken, lying with half-closed lids against his breast. I saw him\nin the holy of holies of love, lying on the ottoman, not as slave,\nbut as master, and she at his feet. On my knees I served them, the\ntea-tray faltering in my hands, and I saw him reach for the whip.\nBut now the servants are talking about him.\n\nHe is a man who is like a woman; he knows that he is beautiful, and\nhe acts accordingly. He changes his clothes four or five times a day,\nlike a vain courtesan.\n\nIn Paris he appeared first in woman's dress, and the men assailed\nhim with love-letters. An Italian singer, famous equally for his art\nand his passionate intensity, even invaded his home, and lying on his\nknees before him threatened to commit suicide if he wouldn't be his.\n\n\"I am sorry,\" he replied, smiling, \"I should like to do you the\nfavor, but you will have to carry out your threat, for I am a man.\"\n\n       *       *       *       *       *\n\nThe drawing-room has already thinned out to a marked degree, but she\napparently has no thought of leaving.\n\nMorning is already peering through the blinds.\n\nAt last I hear the rustling of her heavy gown which flows along\nbehind her like green waves. She advances step by step, engaged in\nconversation with him.\n\nI hardly exist for her any longer; she doesn't even trouble to give\nme an order.\n\n\"The cloak for madame,\" he commands. He, of course, doesn't think of\nlooking after her himself.\n\nWhile I put her furs about her, he stands to one side with his arms\ncrossed. While I am on my knees putting on her fur over-shoes, she\nlightly supports herself with her hand on his shoulder. She asks:\n\n\"And what about the lioness?\"\n\n\"When the lion whom she has chosen and with whom she lives is\nattacked by another,\" the Greek went on with his narrative, \"the\nlioness quietly lies down and watches the battle. Even if her mate\nis worsted she does not go to his aid. She looks on indifferently as\nhe bleeds to death under his opponent's claws, and follows the victor,\nthe stronger--that is the female's nature.\"\n\nAt this moment my lioness looked quickly and curiously at me.\n\nIt made me shudder, though I didn't know why--and the red dawn\nimmerses me and her and him in blood.\n\n       *       *       *       *       *\n\nShe did not go to bed, but merely threw off her ball-dress and undid\nher hair; then she ordered me to build a fire, and she sat by the\nfire-place, and stared into the flames.\n\n\"Do you need me any longer, mistress?\" I asked, my voice failed me\nat the last word.\n\nWanda shook her head.\n\nI left the room, passed through the gallery, and sat down on one of\nthe steps, leading from there down into the garden. A gentle north\nwind brought a fresh, damp coolness from the Arno, the green hills\nextended into the distance in a rosy mist, a golden haze hovered over\nthe city, over the round cupola of the Duomo.\n\nA few stars still tremble in the pale-blue sky.\n\nI tore open my coat, and pressed my burning forehead against the\nmarble. Everything that had happened so far seemed to me a mere\nchild's play; but now things were beginning to be serious, terribly\nserious.\n\nI anticipated a catastrophe, I visualized it, I could lay hold of it\nwith my hands, but I lacked the courage to meet it. My strength was\nbroken. And if I am honest with myself, neither the pains and\nsufferings that threatened me, not the humiliations that impended,\nwere the thing that frightened me.\n\nI merely felt a fear, the fear of losing her whom I loved with a\nsort of fanatical devotion; but it was so overwhelming, so crushing\nthat I suddenly began to sob like a child.\n\n       *       *       *       *       *\n\nDuring the day she remained locked in her room, and had the negress\nattend her. When the evening star rose glowing in the blue sky, I saw\nher pass through the garden, and, carefully following her at a\ndistance, watched her enter the shrine of Venus. I stealthily\nfollowed and peered through the chink in the door.\n\nShe stood before the divine image of the goddess, her hands folded\nas in prayer, and the sacred light of the star of love casts its blue\nrays over her.\n\n       *       *       *       *       *\n\nOn my couch at night the fear of losing her and despair took such\npowerful hold of me that they made a hero and a libertine of me. I\nlighted the little red oil-lamp which hung in the corridor beneath\na saint's image, and entered her bedroom, covering the light with one\nhand.\n\nThe lioness had been hunted and driven until she was exhausted. She\nhad fallen asleep among her pillows, lying on her back, her hands\nclenched, breathing heavily. A dream seemed to oppress her. I slowly\nwithdrew my hand, and let the red light fall full on her wonderful\nface.\n\nBut she did not awaken.\n\nI gently set the lamp on the floor, sank down beside Wanda's bed,\nand rested my head on her soft, glowing arm.\n\nShe moved slightly, but even now did not awaken. I do not know how\nlong I lay thus in the middle of the night, turned as into a stone\nby horrible torments.\n\nFinally a severe trembling seized me, and I was able to cry. My\ntears flowed over her arm. She quivered several times and finally sat\nup; she brushed her hand across her eyes, and looked at me.\n\n\"Severin,\" she exclaimed, more frightened than angry.\n\nI was unable to reply.\n\n\"Severin,\" she continued softly, \"what is the matter? Are you ill?\"\n\nHer voice sounded so sympathetic, so kind, so full of love, that it\nclutched my breast like red-hot tongs and I began to sob aloud.\n\n\"Severin,\" she began anew. \"My poor unhappy friend.\" Her hand gently\nstroked my hair. \"I am sorry, very sorry for you; but I can't help\nyou; with the best intention in the world I know of nothing that\nwould cure you.\"\n\n\"Oh, Wanda, must it be?\" I moaned in my agony.\n\n\"What, Severin? What are you talking about?\"\n\n\"Don't you love me any more?\" I continued. \"Haven't you even a\nlittle bit of pity for me? Has the beautiful stranger taken complete\npossession of you?\"\n\n\"I cannot lie,\" she replied softly after a short pause. \"He has made\nan impression on me which I haven't yet been able to analyse, further\nthan that I suffer and tremble beneath it. It is an impression of the\nsort I have met with in the works of poets or on the stage, but I\nalways thought it was a figment of the imagination. Oh, he is a man\nlike a lion, strong and beautiful and yet gentle, not brutal like the\nmen of our northern world. I am sorry for you, Severin, I am; but I\nmust possess him. What am I saying? I must give myself to him, if he\nwill have me.\"\n\n\"Consider your reputation, Wanda, which so far has remained\nspotless,\" I exclaimed, \"even if I no longer mean anything to you.\"\n\n\"I am considering it,\" she replied, \"I intend to be strong, as long\nas it is possible, I want--\" she buried her head shyly in the pillows\n--\"I want to become his wife--if he will have me.\"\n\n\"Wanda,\" I cried, seized again by that mortal fear, which always\nrobs me of my breath, makes me lose possession of myself, \"you want\nto be his wife, belong to him for always. Oh! Do not drive me away!\nHe does not love you--\"\n\n\"Who says that?\" she exclaimed, flaring up.\n\n\"He does not love you,\" I went on passionately, \"but I love you, I\nadore you, I am your slave, I let you tread me underfoot, I want to\ncarry you on my arms through life.\"\n\n\"Who says that he doesn't love me?\" she interrupted vehemently.\n\n\"Oh! be mine,\" I replied, \"be mine! I cannot exist, cannot live\nwithout you. Have mercy on me, Wanda, have mercy!\"\n\nShe looked at me again, and her face had her cold heartless\nexpression, her evil smile.\n\n\"You say he doesn't love me,\" she said, scornfully. \"Very well then,\nget what consolation you can out of it.\"\n\nWith this she turned over on the other side, and contemptuously\nshowed me her back.\n\n\"Good God, are you a woman without flesh or blood, haven't you a\nheart as well as I!\" I cried, while my breast heaved convulsively.\n\n\"You know what I am,\" she replied, coldly. \"I am a woman of stone,\n_Venus in Furs_, your ideal, kneel down, and pray to me.\"\n\n\"Wanda!\" I implored, \"mercy!\"\n\nShe began to laugh. I buried my face in her pillows. Pain had\nloosened the floodgates of my tears and I let them flow.\n\nFor a long time silence reigned, then Wanda slowly raised herself.\n\n\"You bore me,\" she began.\n\n\"Wanda!\"\n\n\"I am tired, let me go to sleep.\"\n\n\"Mercy,\" I implored. \"Do not drive me away. No man, no one, will\nlove you as I do.\"\n\n\"Let me go to sleep,\"--she turned her back to me again.\n\nI leaped up, and snatched the poinard, which hung beside her bed,\nfrom its sheath, and placed its point against my breast.\n\n\"I shall kill myself here before your eyes,\" I murmured dully.\n\n\"Do what you please,\" Wanda replied with complete indifference. \"But\nlet me go to sleep.\" She yawned aloud. \"I am very sleepy.\"\n\nFor a moment I stood as if petrified. Then I began to laugh and cry\nat the same time. Finally I placed the poinard in my belt, and again\nfell on my knees before her.\n\n\"Wanda, listen to me, only for a few moments,\" I begged.\n\n\"I want to go to sleep! Don't you hear!\" she cried, leaping angrily\nout of bed and pushing me away with her foot. \"You forget that I am\nyour mistress?\" When I didn't budge, she seized the whip and struck\nme. I rose; she struck me again--this time right in the face.\n\n\"Wretch, slave!\"\n\nWith clenched fist held heavenward, I left her bedroom with a sudden\nresolve. She tossed the whip aside, and broke out into clear\nlaughter. I can imagine that my theatrical attitude must have been\nvery droll.\n\n       *       *       *       *       *\n\nI have determined to set myself free from this heartless woman, who\nhas treated me so cruelly, and is now about to break faith and betray\nme, as a reward for all my slavish devotion, for everything I have\nsuffered from her. I packed my few belongings into a bundle, and then\nwrote her as follows:\n\n\"Dear Madam,--\n\nI have loved you even to madness, I have given myself to you as no man\never has given himself to a woman. You have abused my most sacred\nemotions, and played an impudent, frivolous game with me. However, as\nlong as you were merely cruel and merciless, it was still possible for\nme to love you. Now you are about to become _cheap_. I am no longer\nthe slave whom you can kick about and whip. You yourself have set me\nfree, and I am leaving a woman I can only hate and despise.\n\nSeverin Kusiemski.\"\n\nI handed these lines to the negress, and hastened away as fast as I\ncould go. I arrived at the railway-station all out of breath.\nSuddenly I felt a sharp pain in my heart and stopped. I began to\nweep. It is humiliating that I want to flee and I can't. I turn back--\nwhither?--to her, whom I abhor, and yet, at the same time, adore.\n\nAgain I pause. I cannot go back. I dare not.\n\nBut how am I to leave Florence. I remember that I haven't any money,\nnot a penny. Very well then, on foot; it is better to be an honest\nbeggar than to eat the bread of a courtesan.\n\nBut still I can't leave.\n\nShe has my pledge, my word of honor. I have to return. Perhaps she\nwill release me.\n\nAfter a few rapid strides, I stop again.\n\nShe has my word of honor and my bond, that I shall remain her slave\nas long as she desires, until she herself gives me my freedom. But\nI might kill myself.\n\nI go through the Cascine down to the Arno, where its yellow waters\nplash monotonously about a couple of stray willows. There I sit, and\ncast up my final accounts with existence. I let my entire life pass\nbefore me in review. On the whole, it is rather a wretched affair--a\nfew joys, an endless number of indifferent and worthless things, and\nbetween these an abundant harvest of pains, miseries, fears,\ndisappointments, shipwrecked hopes, afflictions, sorrow and grief.\n\nI thought of my mother, whom I loved so deeply and whom I had to\nwatch waste away beneath a horrible disease; of my brother, who full\nof the promise of joy and happiness died in the flower of youth,\nwithout even having put his lips to the cup of life. I thought of my\ndead nurse, my childhood playmates, the friends that had striven and\nstudied with me; of all those, covered by the cold, dead, indifferent\nearth. I thought of my turtle-dove, who not infrequently made his\ncooing bows to me, instead of to his mate.--All have returned, dust\nunto dust.\n\nI laughed aloud, and slid down into the water, but at the same\nmoment I caught hold of one of the willow-branches, hanging above the\nyellow waves. As in a vision, I see the woman who has caused all my\nmisery. She hovers above the level of the water, luminous in the\nsunlight as though she were transparent, with red flames about her\nhead and neck. She turns her face toward me and smiles.\n\n       *       *       *       *       *\n\nI am back again, dripping, wet through, glowing with shame and\nfever. The negress has delivered my letter; I am judged, lost, in the\npower of a heartless, affronted woman.\n\nWell, let her kill me. I am unable to do it myself, and yet I have\nno wish to go on living.\n\nAs I walk around the house, she is standing in the gallery, leaning\nover the railing. Her face is full in the light of the sun, and her\ngreen eyes sparkle.\n\n\"Still alive?\" she asked, without moving. I stood silent, with bowed\nhead.\n\n\"Give me back my poinard,\" she continued. \"It is of no use to you.\nYou haven't even the courage to take your own life.\"\n\n\"I have lost it,\" I replied, trembling, shaken by chills.\n\nShe looked me over with a proud, scornful glance.\n\n\"I suppose you lost it in the Arno?\" She shrugged her shoulders. \"No\nmatter. Well, and why didn't you leave?\"\n\nI mumbled something which neither she nor I myself could understand.\n\n\"Oh! you haven't any money,\" she cried. \"Here!\" With an\nindescribably disdainful gesture she tossed me her purse.\n\nI did not pick it up.\n\nBoth of us were silent for some time.\n\n\"You don't want to leave then?\"\n\n\"I can't.\"\n\n       *       *       *       *       *\n\nWanda drives in the Cascine without me, and goes to the theater\nwithout me; she receives company, and the negress serves her. No one\nasks after me. I stray about the garden, irresolutely, like an animal\nthat has lost its master.\n\nLying among the bushes, I watch a couple of sparrows, fighting over\na seed.\n\nSuddenly I hear the swish of a woman's dress.\n\nWanda approaches in a gown of dark silk, modestly closed up to the\nneck; the Greek is with her. They are in an eager discussion, but I\ncannot as yet understand a word of what they are saying. He stamps\nhis foot so that the gravel scatters about in all directions, and he\nlashes the air with his riding whip. Wanda startles.\n\nIs she afraid that he will strike her?\n\nHave they gone that far?\n\nHe has left her, she calls him; he does not hear her, does not want\nto hear her.\n\nWanda sadly lowers her head, and then sits down on the nearest\nstone-bench. She sits for a long time, lost in thought. I watch her with\na sort of malevolent pleasure, finally I pull myself together by sheer\nforce of will, and ironically step before her. She startles, and\ntrembles all over.\n\n\"I come to wish you happiness,\" I said, bowing, \"I see, my dear\nlady, too, has found a master.\"\n\n\"Yes, thank God!\" she exclaimed, \"not a new slave, I have had enough\nof them. A master! Woman needs a master, and she adores him.\"\n\n\"You adore him, Wanda?\" I cried, \"this brutal person--\"\n\n\"Yes, I love him, as I have never loved any one else.\"\n\n\"Wanda!\" I clenched my fists, but tears already filled my eyes, and\nI was seized by the delirium of passion, as by a sweet madness. \"Very\nwell, take him as your husband, let him be your master, but I want\nto remain your slave, as long as I live.\"\n\n\"You want to remain my slave, even then?\" she said, \"that would be\ninteresting, but I am afraid he wouldn't permit it.\"\n\n\"He?\"\n\n\"Yes, he is already jealous of you,\" she exclaimed, \"he, of you! He\ndemanded that I dismiss you immediately, and when I told him who you\nwere--\"\n\n\"You told him--\" I repeated, thunderstruck.\n\n\"I told him everything,\" she replied, \"our whole story, all your\nqueerness, everything--and he, instead of being amused, grew angry,\nand stamped his foot.\"\n\n\"And threatened to strike you?\"\n\nWanda looked to the ground, and remained silent.\n\n\"Yes, indeed,\" I said with mocking bitterness, \"you are afraid of\nhim, Wanda!\" I threw myself down at her feet, and in my agitation\nembraced her knees. \"I don't want anything of you, except to be your\nslave, to be always near you! I will be your dog-\"\n\n\"Do you know, you bore me?\" said Wanda, indifferently.\n\nI leaped up. Everything within me was seething.\n\n\"You are now no longer cruel, but cheap,\" I said, clearly and\ndistinctly, accentuating every word.\n\n\"You have already written that in your letter,\" Wanda replied, with\na proud shrug of the shoulders. \"A man of brains should never repeat\nhimself.\"\n\n\"The way you are treating me,\" I broke out, \"what would you call it?\"\n\n\"I might punish you,\" she replied ironically, \"but I prefer this\ntime to reply with reasons instead of lashes. You have no right to\naccuse me. Haven't I always been honest with you? Haven't I warned\nyou more than once? Didn't I love you with all my heart, even\npassionately, and did I conceal the fact from you, that it was\ndangerous to give yourself into my power, to abase yourself before\nme, and that I want to be dominated? But you wished to be my\nplaything, my slave! You found the highest pleasure in feeling the\nfoot, the whip of an arrogant, cruel woman. What do you want now?\n\n\"Dangerous potentialities were slumbering in me, but you were the\nfirst to awaken them. If I now take pleasure in torturing you,\nabusing you, it is your fault; you have made of me what I now am, and\nnow you are even unmanly, weak, and miserable enough to accuse me.\"\n\n\"Yes, I am guilty,\" I said, \"but haven't I suffered because of it?\nLet us put an end now to the cruel game.\"\n\n\"That is my wish, too,\" she replied with a curious deceitful look.\n\n\"Wanda!\" I exclaimed violently, \"don't drive me to extremes; you see\nthat I am a man again.\"\n\n\"A fire of straw,\" she replied, \"which makes a lot of stir for a\nmoment, and goes out as quickly as it flared up. You imagine you can\nintimidate me, and you only make yourself ridiculous. Had you been\nthe man I first thought you were, serious, reserved, stern, I would\nhave loved you faithfully, and become your wife. Woman demands that\nshe can look up to a man, but one like you who voluntarily places his\nneck under her foot, she uses as a welcome plaything, only to toss\nit aside when she is tired of it.\"\n\n\"Try to toss me aside,\" I said, jeeringly. \"Some toys are dangerous.\"\n\n\"Don't challenge me,\" exclaimed Wanda. Her eyes began to flash, and\na flush entered her cheeks.\n\n\"If you won't be mine now,\" I continued, with a voice stifled with\nrage, \"no one else shall possess you either.\"\n\n\"What play is this from?\" she mocked, seizing me by the breast. She\nwas pale with anger at this moment. \"Don't challenge me,\" she\ncontinued, \"I am not cruel, but I don't know whether I may not become\nso and whether then there will be any bounds.\"\n\n\"What worse can you do, than to make your lover, your husband?\" I\nexclaimed, more and more enraged.\n\n\"I might make you _his_ slave,\" she replied quickly, \"are you not in\nmy power? Haven't I the agreement? But, of course, you will merely\ntake pleasure in it, if I have you bound, and say to him.\n\n\"Do with him what you please.\"\n\n\"Woman, are you mad!\" I cried.\n\n\"I am entirely rational,\" she said, calmly. \"I warn you for the last\ntime. Don't offer any resistance, one who has gone as far as I have\ngone might easily go still further. I feel a sort of hatred for you,\nand would find a real joy in seeing him beat you to death; I am still\nrestraining myself, but--\"\n\nScarcely master of myself any longer, I seized her by the wrist and\nforced her to the ground, so that she lay on her knees before me.\n\n\"Severin!\" she cried. Rage and terror were painted on her face.\n\n\"I shall kill you if you marry him,\" I threatened; the words came\nhoarsely and dully from my breast. \"You are mine, I won't let you go,\nI love you too much.\" Then I clutched her and pressed her close to\nme; my right hand involuntarily seized the dagger which I still had\nin my belt.\n\nWanda fixed a large, calm, incomprehensible look on me.\n\n\"I like you that way,\" she said, carelessly. \"Now you are a man, and\nat this moment I know I still love you.\"\n\n\"Wanda,\" I wept with rapture, and bent down over her, covering her\ndear face with kisses, and she, suddenly breaking into a loud gay\nlaugh, said, \"Have you finished with your ideal now, are you\nsatisfied with me?\"\n\n\"You mean?\" I stammered, \"that you weren't serious?\"\n\n\"I am very serious,\" she gaily continued. \"I love you, only you, and\nyou--you foolish, little man, didn't know that everything was only\nmake-believe and play-acting. How hard it often was for me to strike\nyou with the whip, when I would have rather taken your head and\ncovered it with kisses. But now we are through with that, aren't we?\nI have played my cruel role better than you expected, and now you\nwill be satisfied with my being a good, little wife who isn't\naltogether unattractive. Isn't that so? We will live like rational\npeople--\"\n\n\"You will marry me!\" I cried, overflowing with happiness.\n\n\"Yes--marry you--you dear, darling man,\" whispered Wanda, kissing my\nhands.\n\nI drew her up to my breast.\n\n\"Now, you are no longer Gregor, my slave,\" said she, \"but Severin,\nthe dear man I love--\"\n\n\"And he--you don't love him?\" I asked in agitation.\n\n\"How could you imagine my loving a man of his brutal type? You were\nblind to everything, I was really afraid for you.\"\n\n\"I almost killed myself for your sake.\"\n\n\"Really?\" she cried, \"ah, I still tremble at the thought, that you\nwere already in the Arno.\"\n\n\"But you saved me,\" I replied, tenderly. \"You hovered over the\nwaters and smiled, and your smile called me back to life.\"\n\n       *       *       *       *       *\n\nI have a curious feeling when I now hold her in my arms and she lies\nsilently against my breast and lets me kiss her and smiles. I feel\nlike one who has suddenly awakened out of a feverish delirium, or\nlike a shipwrecked man who has for many days battled with waves that\nmomentarily threatened to devour him and finally has found a safe\nshore.\n\n       *       *       *       *       *\n\n\"I hate this Florence, where you have been so unhappy,\" she\ndeclared, as I was saying good-night to her. \"I want to leave\nimmediately, tomorrow, you will be good enough to write a couple of\nletters for me, and, while you are doing that, I will drive to the\ncity to pay my farewell visits. Is that satisfactory to you?\"\n\n\"Of course, you dear, sweet, beautiful woman.\"\n\n       *       *       *       *       *\n\nEarly in the morning she knocked at my door to ask how I had slept.\nHer tenderness is positively wonderful. I should never have believed\nthat she could be so tender.\n\n       *       *       *       *       *\n\nShe has now been gone for over four hours. I have long since\nfinished the letters, and am now sitting in the gallery, looking down\nthe street to see whether I cannot discover her carriage in the\ndistance. I am a little worried about her, and yet I know there is\nno reason under heaven why I should doubt or fear. However, a feeling\nof oppression weighs me down, and I cannot rid myself of it. It is\nprobably the sufferings of the past days, which still cast their\nshadows into my soul.\n\n       *       *       *       *       *\n\nShe is back, radiant with happiness and contentment.\n\n\"Well, has everything gone as you wished?\" I asked tenderly, kissing\nher hand.\n\n\"Yes, dear heart,\" she replied, \"and we shall leave to-night. Help\nme pack my trunks.\"\n\n       *       *       *       *       *\n\nToward evening she asked me to go to the post-office and mail her\nletters myself. I took her carriage, and was back within an hour.\n\n\"Mistress has asked for you,\" said the negress, with a grin, as I\nascended the wide marble stairs.\n\n\"Has anyone been here?\"\n\n\"No one,\" she replied, crouching down on the steps like a black cat.\n\nI slowly passed through the drawing-room, and then stood before her\nbedroom door.\n\nWhy does my heart beat so? Am I not perfectly happy?\n\nOpening the door softly, I draw back the portiere. Wanda is lying on\nthe ottoman, and does not seem to notice me. How beautiful she looks,\nin her silver-gray dress, which fits closely, and while displaying\nin tell-tale fashion her splendid figure, leaves her wonderful bust\nand arms bare.\n\nHer hair is interwoven with, and held up by a black velvet ribbon.\nA mighty fire is burning in the fire-place, the hanging lamp casts\na reddish glow, and the whole room is as if drowned in blood.\n\n\"Wanda,\" I said at last.\n\n\"Oh Severin,\" she cried out joyously. \"I have been impatiently\nwaiting for you.\" She leaped up, and folded me in her arms. She sat\ndown again on the rich cushions and tried to draw me down to her\nside, but I softly slid down to her feet and placed my head in her\nlap.\n\n\"Do you know I am very much in love with you to-day?\" she whispered,\nbrushing a few stray hairs from my forehead and kissing my eyes.\n\n\"How beautiful your eyes are, I have always loved them as the best\nof you, but to-day they fairly intoxicate me. I am all--\" She\nextended her magnificent limbs and tenderly looked at me from beneath\nher red lashes.\n\n\"And you--you are cold--you hold me like a block of wood; wait, I'll\nstir you with the fire of love,\" she said, and again clung fawningly\nand caressingly to my lips.\n\n\"I no longer please you; I suppose I'll have to be cruel to you\nagain, evidently I have been too kind to you to-day. Do you know, you\nlittle fool, what I shall do, I shall whip you for a while--\"\n\n\"But child--\"\n\n\"I want to.\"\n\n\"Wanda!\"\n\n\"Come, let me bind you,\" she continued, and ran gaily through the\nroom. \"I want to see you very much in love, do you understand? Here\nare the ropes. I wonder if I can still do it?\"\n\nShe began with fettering my feet and then she tied my hands behind\nmy back, pinioning my arms like those of a prisoner.\n\n\"So,\" she said, with gay eagerness. \"Can you still move?\"\n\n\"No.\"\n\n\"Fine--\"\n\nShe then tied a noose in a stout rope, threw it over my head, and\nlet it slip down as far as the hips. She drew it tight, and bound me\nto a pillar.\n\nA curious tremor seized me at that moment.\n\n\"I have a feeling as if I were about to be executed,\" I said with a\nlow voice.\n\n\"Well, you shall have a thorough punishment to-day,\" exclaimed Wanda.\n\n\"But put on your fur-jacket, please,\" I said.\n\n\"I shall gladly give you that pleasure,\" she replied. She got her\n_kazabaika_, and put it on. Then she stood in front of me with\nher arms folded across her chest, and looked at me out of half-closed\neyes.\n\n\"Do you remember the story of the ox of Dionysius?\" she asked.\n\n\"I remember it only vaguely, what about it?\"\n\n\"A courtier invented a new implement of torture for the Tyrant of\nSyracuse. It was an iron ox in which those condemned to death were\nto be shut, and then pushed into a mighty furnace.\n\n\"As soon as the iron ox began to get hot, and the condemned person\nbegan to cry out in his torment, his wails sounded like the bellowing\nof an ox.\n\n\"Dionysius nodded graciously to the inventor, and to put his\ninvention to an immediate test had him shut up in the iron ox.\n\n\"It is a very instructive story.\n\n\"It was you who innoculated me with selfishness, pride, and cruelty,\nand _you shall be their first victim._ I now literally enjoy having a\nhuman being that thinks and feels and desires like myself in my power;\nI love to abuse a man who is stronger in intelligence and body than I,\nespecially a man who loves me.\n\n\"Do you still love me?\"\n\n\"Even to madness,\" I exclaimed.\n\n\"So much the better,\" she replied, \"and so much the more will you\nenjoy what I am about to do with you now.\"\n\n\"What is the matter with you?\" I asked. \"I don't understand you,\nthere is a gleam of real cruelty in your eyes to-day, and you are\nstrangely beautiful--completely _Venus in Furs.\"_\n\nWithout replying Wanda placed her arms around my neck and kissed me.\nI was again seized by my fanatical passion.\n\n\"Where is the whip?\" I asked.\n\nWanda laughed, and withdrew a couple of steps.\n\n\"You really insist upon being punished?\" she exclaimed, proudly\ntossing back her head.\n\n\"Yes.\"\n\nSuddenly Wanda's face was completely transformed. It was as if\ndisfigured by rage; for a moment she seemed even ugly to me.\n\n\"Very well, then _you_ whip him!\" she called loudly.\n\nAt the same instant the beautiful Greek stuck his head of black\ncurls through the curtains of her four-poster bed. At first I was\nspeechless, petrified. There was a horribly comic element in the\nsituation. I would have laughed aloud, had not my position been at\nthe same time so terribly cruel and humiliating.\n\nIt went beyond anything I had imagined. A cold shudder ran down my\nback, when my rival stepped from the bed in his riding boots, his\ntight-fitting white breeches, and his short velvet jacket, and I saw\nhis athletic limbs.\n\n\"You are indeed cruel,\" he said, turning to Wanda.\n\n\"Only inordinately fond of pleasure,\" she replied with a wild sort\nof humor. \"Pleasure alone lends value to existence; whoever enjoys\ndoes not easily part from life, whoever suffers or is needy meets\ndeath like a friend.\n\n\"But whoever wants to enjoy must take life gaily in the sense of the\nancient world; he dare not hesitate to enjoy at the expense of others;\nhe must never feel pity; he must be ready to harness others to his\ncarriage or his plough as though they were animals. He must know how to\nmake slaves of men who feel and would enjoy as he does, and use them for\nhis service and pleasure without remorse. It is not his affair whether\nthey like it, or whether they go to rack and ruin. He must always\nremember this, that if they had him in their power, as he has them they\nwould act in exactly the same way, and he would have to pay for their\npleasure with his sweat and blood and soul. That was the world of the\nancients: pleasure and cruelty, liberty and slavery went hand in hand.\nPeople who want to live like the gods of Olympus must of necessity have\nslaves whom they can toss into their fish-ponds, and gladiators who will\ndo battle, the while they banquet, and they must not mind if by chance a\nbit of blood bespatters them.\"\n\nHer words brought back my complete self-possession.\n\n\"Unloosen me!\" I exclaimed angrily.\n\n\"Aren't you my slave, my property?\" replied Wanda. \"Do you want me\nto show you the agreement?\"\n\n\"Untie me!\" I threatened, \"otherwise--\" I tugged at the ropes.\n\n\"Can he tear himself free?\" she asked. \"He has threatened to kill me.\"\n\n\"Be entirely at ease,\" said the Greek, testing my fetters.\n\n\"I shall call for help,\" I began again.\n\n\"No one will hear you,\" replied Wanda, \"and no one will hinder me\nfrom abusing your most sacred emotions or playing a frivolous game\nwith you.\" she continued, repeating with satanic mockery phrases from\nmy letter to her.\n\n\"Do you think I am at this moment merely cruel and merciless, or am\nI also about to become cheap? What? Do you still love me, or do you\nalready hate and despise me? Here is the whip--\" She handed it to the\nGreek who quickly stepped closer.\n\n\"Don't you dare!\" I exclaimed, trembling with indignation, \"I won't\npermit it--\"\n\n\"Oh, because I don't wear furs,\" the Greek replied with an ironical\nsmile, and he took his short sable from the bed.\n\n\"You are adorable,\" exclaimed Wanda, kissing him, and helping him\ninto his furs.\n\n\"May I really whip him?\" he asked.\n\n\"Do with him what you please,\" replied Wanda.\n\n\"Beast!\" I exclaimed, utterly revolted.\n\nThe Greek fixed his cold tigerish look upon me and tried out the\nwhip. His muscles swelled when he drew back his arms, and made the\nwhip hiss through the air. I was bound like Marsyas while Apollo was\ngetting ready to flay me.\n\nMy look wandered about the room and remained fixed on the ceiling,\nwhere Samson, lying at Delilah's feet, was about to have his eyes put\nout by the Philistines. The picture at that moment seemed to me like\na symbol, an eternal parable of passion and lust, of the love of man\nfor woman. \"Each one of us in the end is a Samson,\" I thought, \"and\nultimately for better or worse is betrayed by the woman he loves,\nwhether he wears an ordinary coat or sables.\"\n\n\"Now watch me break him in,\" said the Greek. He showed his teeth,\nand his face acquired the blood-thirsty expression, which startled\nme the first time I saw him.\n\nAnd he began to apply the lash--so mercilessly, with such frightful\nforce that I quivered under each blow, and began to tremble all over\nwith pain. Tears rolled down over my cheeks. In the meantime Wanda\nlay on the ottoman in her fur-jacket, supporting herself on her arm;\nshe looked on with cruel curiosity, and was convulsed with laughter.\n\nThe sensation of being whipped by a successful rival before the eyes\nof an adored woman cannot be described. I almost went mad with shame\nand despair.\n\nWhat was most humiliating was that at first I felt a certain wild,\nsupersensual stimulation under Apollo's whip and the cruel laughter\nof my Venus, no matter how horrible my position was. But Apollo\nwhipped on and on, blow after blow, until I forgot all about poetry,\nand finally gritted my teeth in impotent rage, and cursed my wild\ndreams, woman, and love.\n\nAll of a sudden I saw with horrible clarity whither blind passion\nand lust have led man, ever since Holofernes and Agamemnon--into a\nblind alley, into the net of woman's treachery, into misery, slavery,\nand death.\n\nIt was as though I were awakening from a dream.\n\nBlood was already flowing under the whip. I wound like a worm that\nis trodden on, but he whipped on without mercy, and she continued to\nlaugh without mercy. In the meantime she locked her packed trunk and\nslipped into her travelling furs, and was still laughing, when she\nwent downstairs on his arm and entered the carriage.\n\nThen everything was silent for a moment.\n\nI listened breathlessly.\n\nThe carriage door slammed, the horse began to pull--the rolling of\nthe carriage for a short time--then all was over.\n\n       *       *       *       *       *\n\nFor a moment I thought of taking vengeance, of killing him, but I\nwas bound by the abominable agreement. So nothing was left for me to\ndo except to keep my pledged word and grit my teeth.\n\n       *       *       *       *       *\n\nMy first impulse after this, the most cruel catastrophe of my life,\nwas to seek laborious tasks, dangers, and privations. I wanted to\nbecome a soldier and go to Asia or Algiers, but my father was old and\nill and wanted me.\n\nSo I quietly returned home and for two years helped him bear his\nburdens, and learned how to look after the estate which I had never\ndone before. To _labor_ and to _do my duty_ was comforting like a\ndrink of fresh water. Then my father died, and I inherited the estate,\nbut it meant no change.\n\nI had put on my own Spanish boots and went on living just as\nrationally as if the old man were standing behind me, looking over\nmy shoulder with his large wise eyes.\n\nOne day a box arrived, accompanied by a letter. I recognized Wanda's\nwriting.\n\nCuriously moved, I opened it, and read.\n\n\"Sir.--\n\nNow that over three years have passed since that night in Florence,\nI suppose, I may confess to you that I loved you deeply. You\nyourself, however, stifled my love by your fantastic devotion and\nyour insane passion. From the moment that you became my slave, I knew\nit would be impossible for you ever to become my husband. However,\nI found it interesting to have you realize your ideal in my own person,\nand, while I gloriously amused myself, perhaps, to cure you.\n\nI found the strong man for whom I felt a need, and I was as happy\nwith him as, I suppose, it is possible for any one to be on this\nfunny ball of clay.\n\nBut my happiness, like all things mortal, was of short duration.\nAbout a year ago he fell in a duel, and since then I have been living\nin Paris, like an Aspasia--\n\nAnd you?--Your life surely is not without its sunshine, if you have\ngained control of your imagination, and those qualities in you have\nmaterialized, which at first so attracted me to you--your clarity of\nintellect, kindness of heart, and, above all else, your--_moral\nseriousness_.\n\nI hope you have been cured under my whip; the cure was cruel, but\nradical. In memory of that time and of a woman who loved you\npassionately, I am sending you the portrait by the poor German.\n\n_Venus in Furs_.\"\n\nI had to smile, and as I fell to musing the beautiful woman suddenly\nstood before me in her velvet jacket trimmed with ermine, with the\nwhip in her hand. And I continued to smile at the woman I had once\nloved so insanely, at the fur-jacket that had once so entranced me,\nat the whip, and ended by smiling at myself and saying: The cure was\ncruel, but radical; but the main point is, I have been cured.\n\n       *       *       *       *       *\n\n\"And the moral of the story?\" I said to Severin when I put the\nmanuscript down on the table.\n\n\"That I was a donkey,\" he exclaimed without turning around, for he\nseemed to be embarrassed. \"If only I had beaten her!\"\n\n\"A curious remedy,\" I exclaimed, \"which might answer with your\npeasant-women--\"\n\n\"Oh, they are used to it,\" he replied eagerly, \"but imagine the\neffect upon one of our delicate, nervous, hysterical ladies--\"\n\n\"But the moral?\"\n\n\"That woman, as nature has created her and as man is at present\neducating her, is his enemy. She can only be his slave or his despot,\nbut _never his companion._ This she can become only when she has\nthe same rights as he, and is his equal in education and work.\n\n\"At present we have only the choice of being hammer or anvil, and I\nwas the kind of donkey who let a woman make a slave of him, do you\nunderstand?\n\n\"The moral of the tale is this: whoever allows himself to be\nwhipped, deserves to be whipped.\n\n\"The blows, as you see, have agreed with me; the roseate supersensual\nmist has dissolved, and no one can ever make me believe again that\nthese 'sacred apes of Benares' [Footnote: One of Schopenhauer's\ndesignations for women.] or Plato's rooster [Footnote: Diogenes\nthrew a plucked rooster into Plato's school and exclaimed: \"Here\nyou have Plato's human being.\"] are the image of God.\"", "title": "Venus in Furs"}