{"summary": "The Castle of Otranto tells the story of Manfred, lord of the castle, and his family. The book begins on the wedding-day of his sickly son Conrad and princess Isabella. Shortly before the wedding, however, Conrad is crushed to death by a gigantic helmet that falls on him from above. This inexplicable event is particularly ominous in light of an ancient prophecy \"[T]hat the castle and lordship of Otranto should pass from the present family, whenever the real owner should be grown too large to inhabit it\". Manfred, terrified that Conrad's death signals the beginning of the end for his line, resolves to avert destruction by marrying Isabella himself while divorcing his current wife Hippolita, who he feels has failed to bear him a proper heir.\nHowever, as Manfred attempts to marry Isabella, she escapes to a church with the aid of a peasant named Theodore. Manfred orders Theodore's death while talking to the friar Jerome, who ensured Isabella's safety in the church. When Theodore removes his shirt to be killed, Jerome recognises a marking below his shoulder and identifies Theodore as his own son. Jerome begs for his son's life, but Manfred says Jerome must either give up the princess or his son's life. They are interrupted by a trumpet and the entrance of knights from another kingdom who want to deliver Isabella. This leads the knights and Manfred to race to find Isabella.\nTheodore, having been locked in a tower by Manfred, is freed by Manfred's daughter Matilda. He races to the underground church and finds Isabella. He hides her in a cave and blocks it to protect her from Manfred and ends up fighting one of the mysterious knights. Theodore badly wounds the knight, who turns out to be Isabella's father, Frederic. With that, they all go up to the castle to work things out. Frederic falls in love with Matilda and he and Manfred begin to make a deal about marrying each other's daughters. Manfred, suspecting that Isabella is meeting Theodore in a tryst in the church, takes a knife into the church, where Matilda is meeting Theodore. Thinking his own daughter is Isabella, he stabs her. Theodore is then revealed to be the true prince of Otranto and Matilda dies, leaving Manfred to repent. Theodore becomes king and eventually marries Isabella because she is the only one who can understand his true sorrow.\n\n", "full_text": "Transcribed from the 1901 Cassell and Company edition by David Price,\nemail ccx074@pglaf.org\n\n                        CASSELL’S NATIONAL LIBRARY\n                               (New Series)\n\n                                * * * * *\n\n\n\n\n\n                                   THE\n                            CASTLE OF OTRANTO.\n\n\n                                * * * * *\n\n                                    BY\n                             HORACE WALPOLE.\n\n                      [Picture: Decorative graphic]\n\n                       CASSELL AND COMPANY, LIMITED\n                _LONDON_, _PARIS_, _NEW YORK & MELBOURNE_\n                                   1901\n\n\n\n\nINTRODUCTION\n\n\nHORACE WALPOLE was the youngest son of Sir Robert Walpole, the great\nstatesman, who died Earl of Orford.  He was born in 1717, the year in\nwhich his father resigned office, remaining in opposition for almost\nthree years before his return to a long tenure of power.  Horace Walpole\nwas educated at Eton, where he formed a school friendship with Thomas\nGray, who was but a few months older.  In 1739 Gray was\ntravelling-companion with Walpole in France and Italy until they differed\nand parted; but the friendship was afterwards renewed, and remained firm\nto the end.  Horace Walpole went from Eton to King’s College, Cambridge,\nand entered Parliament in 1741, the year before his father’s final\nresignation and acceptance of an earldom.  His way of life was made easy\nto him.  As Usher of the Exchequer, Comptroller of the Pipe, and Clerk of\nthe Estreats in the Exchequer, he received nearly two thousand a year for\ndoing nothing, lived with his father, and amused himself.\n\nHorace Walpole idled, and amused himself with the small life of the\nfashionable world to which he was proud of belonging, though he had a\nquick eye for its vanities.  He had social wit, and liked to put it to\nsmall uses.  But he was not an empty idler, and there were seasons when\nhe could become a sharp judge of himself.  “I am sensible,” he wrote to\nhis most intimate friend, “I am sensible of having more follies and\nweaknesses and fewer real good qualities than most men.  I sometimes\nreflect on this, though, I own, too seldom.  I always want to begin\nacting like a man, and a sensible one, which I think I might be if I\nwould.”  He had deep home affections, and, under many polite\naffectations, plenty of good sense.\n\nHorace Walpole’s father died in 1745.  The eldest son, who succeeded to\nthe earldom, died in 1751, and left a son, George, who was for a time\ninsane, and lived until 1791.  As George left no child, the title and\nestates passed to Horace Walpole, then seventy-four years old, and the\nonly uncle who survived.  Horace Walpole thus became Earl of Orford,\nduring the last six years of his life.  As to the title, he said that he\nfelt himself being called names in his old age.  He died unmarried, in\nthe year 1797, at the age of eighty.\n\nHe had turned his house at Strawberry Hill, by the Thames, near\nTwickenham, into a Gothic villa—eighteenth-century Gothic—and amused\nhimself by spending freely upon its adornment with such things as were\nthen fashionable as objects of taste.  But he delighted also in his\nflowers and his trellises of roses, and the quiet Thames.  When confined\nby gout to his London house in Arlington Street, flowers from Strawberry\nHill and a bird were necessary consolations.  He set up also at\nStrawberry Hill a private printing press, at which he printed his friend\nGray’s poems, also in 1758 his own “Catalogue of the Royal and Noble\nAuthors of England,” and five volumes of “Anecdotes of Painting in\nEngland,” between 1762 and 1771.\n\nHorace Walpole produced _The Castle of Otranto_ in 1765, at the mature\nage of forty-eight.  It was suggested by a dream from which he said he\nwaked one morning, and of which “all I could recover was, that I had\nthought myself in an ancient castle (a very natural dream for a head like\nmine, filled with Gothic story), and that on the uppermost banister of a\ngreat staircase I saw a gigantic hand in armour.  In the evening I sat\ndown and began to write, without knowing in the least what I intended to\nsay or relate.”  So began the tale which professed to be translated by\n“William Marshal, gentleman, from the Italian of Onuphro Muralto, canon\nof the Church of St. Nicholas, at Otranto.”  It was written in two\nmonths.  Walpole’s friend Gray reported to him that at Cambridge the book\nmade “some of them cry a little, and all in general afraid to go to bed\no’ nights.”  _The Castle of Otranto_ was, in its own way, an early sign\nof the reaction towards romance in the latter part of the last century.\nThis gives it interest.  But it has had many followers, and the hardy\nmodern reader, when he read’s Gray’s note from Cambridge, needs to be\nreminded of its date.\n\n                                                                     H. M.\n\n\n\n\nPREFACE TO THE FIRST EDITION.\n\n\nThe following work was found in the library of an ancient Catholic family\nin the north of England.  It was printed at Naples, in the black letter,\nin the year 1529.  How much sooner it was written does not appear.  The\nprincipal incidents are such as were believed in the darkest ages of\nChristianity; but the language and conduct have nothing that savours of\nbarbarism.  The style is the purest Italian.\n\nIf the story was written near the time when it is supposed to have\nhappened, it must have been between 1095, the era of the first Crusade,\nand 1243, the date of the last, or not long afterwards.  There is no\nother circumstance in the work that can lead us to guess at the period in\nwhich the scene is laid: the names of the actors are evidently\nfictitious, and probably disguised on purpose: yet the Spanish names of\nthe domestics seem to indicate that this work was not composed until the\nestablishment of the Arragonian Kings in Naples had made Spanish\nappellations familiar in that country.  The beauty of the diction, and\nthe zeal of the author (moderated, however, by singular judgment) concur\nto make me think that the date of the composition was little antecedent\nto that of the impression.  Letters were then in their most flourishing\nstate in Italy, and contributed to dispel the empire of superstition, at\nthat time so forcibly attacked by the reformers.  It is not unlikely that\nan artful priest might endeavour to turn their own arms on the\ninnovators, and might avail himself of his abilities as an author to\nconfirm the populace in their ancient errors and superstitions.  If this\nwas his view, he has certainly acted with signal address.  Such a work as\nthe following would enslave a hundred vulgar minds beyond half the books\nof controversy that have been written from the days of Luther to the\npresent hour.\n\nThis solution of the author’s motives is, however, offered as a mere\nconjecture.  Whatever his views were, or whatever effects the execution\nof them might have, his work can only be laid before the public at\npresent as a matter of entertainment.  Even as such, some apology for it\nis necessary.  Miracles, visions, necromancy, dreams, and other\npreternatural events, are exploded now even from romances.  That was not\nthe case when our author wrote; much less when the story itself is\nsupposed to have happened.  Belief in every kind of prodigy was so\nestablished in those dark ages, that an author would not be faithful to\nthe manners of the times, who should omit all mention of them.  He is not\nbound to believe them himself, but he must represent his actors as\nbelieving them.\n\nIf this air of the miraculous is excused, the reader will find nothing\nelse unworthy of his perusal.  Allow the possibility of the facts, and\nall the actors comport themselves as persons would do in their situation.\nThere is no bombast, no similes, flowers, digressions, or unnecessary\ndescriptions.  Everything tends directly to the catastrophe.  Never is\nthe reader’s attention relaxed.  The rules of the drama are almost\nobserved throughout the conduct of the piece.  The characters are well\ndrawn, and still better maintained.  Terror, the author’s principal\nengine, prevents the story from ever languishing; and it is so often\ncontrasted by pity, that the mind is kept up in a constant vicissitude of\ninteresting passions.\n\nSome persons may perhaps think the characters of the domestics too little\nserious for the general cast of the story; but besides their opposition\nto the principal personages, the art of the author is very observable in\nhis conduct of the subalterns.  They discover many passages essential to\nthe story, which could not be well brought to light but by their\n_naïveté_ and simplicity.  In particular, the womanish terror and foibles\nof Bianca, in the last chapter, conduce essentially towards advancing the\ncatastrophe.\n\nIt is natural for a translator to be prejudiced in favour of his adopted\nwork.  More impartial readers may not be so much struck with the beauties\nof this piece as I was.  Yet I am not blind to my author’s defects.  I\ncould wish he had grounded his plan on a more useful moral than this:\nthat “the sins of fathers are visited on their children to the third and\nfourth generation.”  I doubt whether, in his time, any more than at\npresent, ambition curbed its appetite of dominion from the dread of so\nremote a punishment.  And yet this moral is weakened by that less direct\ninsinuation, that even such anathema may be diverted by devotion to St.\nNicholas.  Here the interest of the Monk plainly gets the better of the\njudgment of the author.  However, with all its faults, I have no doubt\nbut the English reader will be pleased with a sight of this performance.\nThe piety that reigns throughout, the lessons of virtue that are\ninculcated, and the rigid purity of the sentiments, exempt this work from\nthe censure to which romances are but too liable.  Should it meet with\nthe success I hope for, I may be encouraged to reprint the original\nItalian, though it will tend to depreciate my own labour.  Our language\nfalls far short of the charms of the Italian, both for variety and\nharmony.  The latter is peculiarly excellent for simple narrative.  It is\ndifficult in English to relate without falling too low or rising too\nhigh; a fault obviously occasioned by the little care taken to speak pure\nlanguage in common conversation.  Every Italian or Frenchman of any rank\npiques himself on speaking his own tongue correctly and with choice.  I\ncannot flatter myself with having done justice to my author in this\nrespect: his style is as elegant as his conduct of the passions is\nmasterly.  It is a pity that he did not apply his talents to what they\nwere evidently proper for—the theatre.\n\nI will detain the reader no longer, but to make one short remark.  Though\nthe machinery is invention, and the names of the actors imaginary, I\ncannot but believe that the groundwork of the story is founded on truth.\nThe scene is undoubtedly laid in some real castle.  The author seems\nfrequently, without design, to describe particular parts.  “The chamber,”\nsays he, “on the right hand;” “the door on the left hand;” “the distance\nfrom the chapel to Conrad’s apartment:” these and other passages are\nstrong presumptions that the author had some certain building in his eye.\nCurious persons, who have leisure to employ in such researches, may\npossibly discover in the Italian writers the foundation on which our\nauthor has built.  If a catastrophe, at all resembling that which he\ndescribes, is believed to have given rise to this work, it will\ncontribute to interest the reader, and will make the “Castle of Otranto”\na still more moving story.\n\n\n\n\nSONNET TO THE RIGHT HONOURABLE LADY MARY COKE.\n\n\n   The gentle maid, whose hapless tale\n      These melancholy pages speak;\n   Say, gracious lady, shall she fail\n      To draw the tear adown thy cheek?\n\n   No; never was thy pitying breast\n      Insensible to human woes;\n   Tender, tho’ firm, it melts distrest\n      For weaknesses it never knows.\n\n   Oh! guard the marvels I relate\n   Of fell ambition scourg’d by fate,\n      From reason’s peevish blame.\n   Blest with thy smile, my dauntless sail\n   I dare expand to Fancy’s gale,\n      For sure thy smiles are Fame.\n\n                                                                     H. W.\n\n\n\n\nCHAPTER I.\n\n\nManfred, Prince of Otranto, had one son and one daughter: the latter, a\nmost beautiful virgin, aged eighteen, was called Matilda.  Conrad, the\nson, was three years younger, a homely youth, sickly, and of no promising\ndisposition; yet he was the darling of his father, who never showed any\nsymptoms of affection to Matilda.  Manfred had contracted a marriage for\nhis son with the Marquis of Vicenza’s daughter, Isabella; and she had\nalready been delivered by her guardians into the hands of Manfred, that\nhe might celebrate the wedding as soon as Conrad’s infirm state of health\nwould permit.\n\nManfred’s impatience for this ceremonial was remarked by his family and\nneighbours.  The former, indeed, apprehending the severity of their\nPrince’s disposition, did not dare to utter their surmises on this\nprecipitation.  Hippolita, his wife, an amiable lady, did sometimes\nventure to represent the danger of marrying their only son so early,\nconsidering his great youth, and greater infirmities; but she never\nreceived any other answer than reflections on her own sterility, who had\ngiven him but one heir.  His tenants and subjects were less cautious in\ntheir discourses.  They attributed this hasty wedding to the Prince’s\ndread of seeing accomplished an ancient prophecy, which was said to have\npronounced that the castle and lordship of Otranto “should pass from the\npresent family, whenever the real owner should be grown too large to\ninhabit it.”  It was difficult to make any sense of this prophecy; and\nstill less easy to conceive what it had to do with the marriage in\nquestion.  Yet these mysteries, or contradictions, did not make the\npopulace adhere the less to their opinion.\n\nYoung Conrad’s birthday was fixed for his espousals.  The company was\nassembled in the chapel of the Castle, and everything ready for beginning\nthe divine office, when Conrad himself was missing.  Manfred, impatient\nof the least delay, and who had not observed his son retire, despatched\none of his attendants to summon the young Prince.  The servant, who had\nnot stayed long enough to have crossed the court to Conrad’s apartment,\ncame running back breathless, in a frantic manner, his eyes staring, and\nfoaming at the month.  He said nothing, but pointed to the court.\n\nThe company were struck with terror and amazement.  The Princess\nHippolita, without knowing what was the matter, but anxious for her son,\nswooned away.  Manfred, less apprehensive than enraged at the\nprocrastination of the nuptials, and at the folly of his domestic, asked\nimperiously what was the matter?  The fellow made no answer, but\ncontinued pointing towards the courtyard; and at last, after repeated\nquestions put to him, cried out, “Oh! the helmet! the helmet!”\n\nIn the meantime, some of the company had run into the court, from whence\nwas heard a confused noise of shrieks, horror, and surprise.  Manfred,\nwho began to be alarmed at not seeing his son, went himself to get\ninformation of what occasioned this strange confusion.  Matilda remained\nendeavouring to assist her mother, and Isabella stayed for the same\npurpose, and to avoid showing any impatience for the bridegroom, for\nwhom, in truth, she had conceived little affection.\n\nThe first thing that struck Manfred’s eyes was a group of his servants\nendeavouring to raise something that appeared to him a mountain of sable\nplumes.  He gazed without believing his sight.\n\n“What are ye doing?” cried Manfred, wrathfully; “where is my son?”\n\nA volley of voices replied, “Oh! my Lord! the Prince! the Prince! the\nhelmet! the helmet!”\n\nShocked with these lamentable sounds, and dreading he knew not what, he\nadvanced hastily,—but what a sight for a father’s eyes!—he beheld his\nchild dashed to pieces, and almost buried under an enormous helmet, an\nhundred times more large than any casque ever made for human being, and\nshaded with a proportionable quantity of black feathers.\n\nThe horror of the spectacle, the ignorance of all around how this\nmisfortune had happened, and above all, the tremendous phenomenon before\nhim, took away the Prince’s speech.  Yet his silence lasted longer than\neven grief could occasion.  He fixed his eyes on what he wished in vain\nto believe a vision; and seemed less attentive to his loss, than buried\nin meditation on the stupendous object that had occasioned it.  He\ntouched, he examined the fatal casque; nor could even the bleeding\nmangled remains of the young Prince divert the eyes of Manfred from the\nportent before him.\n\nAll who had known his partial fondness for young Conrad, were as much\nsurprised at their Prince’s insensibility, as thunderstruck themselves at\nthe miracle of the helmet.  They conveyed the disfigured corpse into the\nhall, without receiving the least direction from Manfred.  As little was\nhe attentive to the ladies who remained in the chapel.  On the contrary,\nwithout mentioning the unhappy princesses, his wife and daughter, the\nfirst sounds that dropped from Manfred’s lips were, “Take care of the\nLady Isabella.”\n\nThe domestics, without observing the singularity of this direction, were\nguided by their affection to their mistress, to consider it as peculiarly\naddressed to her situation, and flew to her assistance.  They conveyed\nher to her chamber more dead than alive, and indifferent to all the\nstrange circumstances she heard, except the death of her son.\n\nMatilda, who doted on her mother, smothered her own grief and amazement,\nand thought of nothing but assisting and comforting her afflicted parent.\nIsabella, who had been treated by Hippolita like a daughter, and who\nreturned that tenderness with equal duty and affection, was scarce less\nassiduous about the Princess; at the same time endeavouring to partake\nand lessen the weight of sorrow which she saw Matilda strove to suppress,\nfor whom she had conceived the warmest sympathy of friendship.  Yet her\nown situation could not help finding its place in her thoughts.  She felt\nno concern for the death of young Conrad, except commiseration; and she\nwas not sorry to be delivered from a marriage which had promised her\nlittle felicity, either from her destined bridegroom, or from the severe\ntemper of Manfred, who, though he had distinguished her by great\nindulgence, had imprinted her mind with terror, from his causeless rigour\nto such amiable princesses as Hippolita and Matilda.\n\nWhile the ladies were conveying the wretched mother to her bed, Manfred\nremained in the court, gazing on the ominous casque, and regardless of\nthe crowd which the strangeness of the event had now assembled around\nhim.  The few words he articulated, tended solely to inquiries, whether\nany man knew from whence it could have come?  Nobody could give him the\nleast information.  However, as it seemed to be the sole object of his\ncuriosity, it soon became so to the rest of the spectators, whose\nconjectures were as absurd and improbable, as the catastrophe itself was\nunprecedented.  In the midst of their senseless guesses, a young peasant,\nwhom rumour had drawn thither from a neighbouring village, observed that\nthe miraculous helmet was exactly like that on the figure in black marble\nof Alfonso the Good, one of their former princes, in the church of St.\nNicholas.\n\n“Villain!  What sayest thou?” cried Manfred, starting from his trance in\na tempest of rage, and seizing the young man by the collar; “how darest\nthou utter such treason?  Thy life shall pay for it.”\n\nThe spectators, who as little comprehended the cause of the Prince’s fury\nas all the rest they had seen, were at a loss to unravel this new\ncircumstance.  The young peasant himself was still more astonished, not\nconceiving how he had offended the Prince.  Yet recollecting himself,\nwith a mixture of grace and humility, he disengaged himself from\nManfred’s grip, and then with an obeisance, which discovered more\njealousy of innocence than dismay, he asked, with respect, of what he was\nguilty?  Manfred, more enraged at the vigour, however decently exerted,\nwith which the young man had shaken off his hold, than appeased by his\nsubmission, ordered his attendants to seize him, and, if he had not been\nwithheld by his friends whom he had invited to the nuptials, would have\npoignarded the peasant in their arms.\n\nDuring this altercation, some of the vulgar spectators had run to the\ngreat church, which stood near the castle, and came back open-mouthed,\ndeclaring that the helmet was missing from Alfonso’s statue.  Manfred, at\nthis news, grew perfectly frantic; and, as if he sought a subject on\nwhich to vent the tempest within him, he rushed again on the young\npeasant, crying—\n\n“Villain! Monster! Sorcerer! ’tis thou hast done this! ’tis thou hast\nslain my son!”\n\nThe mob, who wanted some object within the scope of their capacities, on\nwhom they might discharge their bewildered reasoning, caught the words\nfrom the mouth of their lord, and re-echoed—\n\n“Ay, ay; ’tis he, ’tis he: he has stolen the helmet from good Alfonso’s\ntomb, and dashed out the brains of our young Prince with it,” never\nreflecting how enormous the disproportion was between the marble helmet\nthat had been in the church, and that of steel before their eyes; nor how\nimpossible it was for a youth seemingly not twenty, to wield a piece of\narmour of so prodigious a weight.\n\nThe folly of these ejaculations brought Manfred to himself: yet whether\nprovoked at the peasant having observed the resemblance between the two\nhelmets, and thereby led to the farther discovery of the absence of that\nin the church, or wishing to bury any such rumour under so impertinent a\nsupposition, he gravely pronounced that the young man was certainly a\nnecromancer, and that till the Church could take cognisance of the\naffair, he would have the Magician, whom they had thus detected, kept\nprisoner under the helmet itself, which he ordered his attendants to\nraise, and place the young man under it; declaring he should be kept\nthere without food, with which his own infernal art might furnish him.\n\nIt was in vain for the youth to represent against this preposterous\nsentence: in vain did Manfred’s friends endeavour to divert him from this\nsavage and ill-grounded resolution.  The generality were charmed with\ntheir lord’s decision, which, to their apprehensions, carried great\nappearance of justice, as the Magician was to be punished by the very\ninstrument with which he had offended: nor were they struck with the\nleast compunction at the probability of the youth being starved, for they\nfirmly believed that, by his diabolic skill, he could easily supply\nhimself with nutriment.\n\nManfred thus saw his commands even cheerfully obeyed; and appointing a\nguard with strict orders to prevent any food being conveyed to the\nprisoner, he dismissed his friends and attendants, and retired to his own\nchamber, after locking the gates of the castle, in which he suffered none\nbut his domestics to remain.\n\nIn the meantime, the care and zeal of the young Ladies had brought the\nPrincess Hippolita to herself, who amidst the transports of her own\nsorrow frequently demanded news of her lord, would have dismissed her\nattendants to watch over him, and at last enjoined Matilda to leave her,\nand visit and comfort her father.  Matilda, who wanted no affectionate\nduty to Manfred, though she trembled at his austerity, obeyed the orders\nof Hippolita, whom she tenderly recommended to Isabella; and inquiring of\nthe domestics for her father, was informed that he was retired to his\nchamber, and had commanded that nobody should have admittance to him.\nConcluding that he was immersed in sorrow for the death of her brother,\nand fearing to renew his tears by the sight of his sole remaining child,\nshe hesitated whether she should break in upon his affliction; yet\nsolicitude for him, backed by the commands of her mother, encouraged her\nto venture disobeying the orders he had given; a fault she had never been\nguilty of before.\n\nThe gentle timidity of her nature made her pause for some minutes at his\ndoor.  She heard him traverse his chamber backwards, and forwards with\ndisordered steps; a mood which increased her apprehensions.  She was,\nhowever, just going to beg admittance, when Manfred suddenly opened the\ndoor; and as it was now twilight, concurring with the disorder of his\nmind, he did not distinguish the person, but asked angrily, who it was?\nMatilda replied, trembling—\n\n“My dearest father, it is I, your daughter.”\n\nManfred, stepping back hastily, cried, “Begone!  I do not want a\ndaughter;” and flinging back abruptly, clapped the door against the\nterrified Matilda.\n\nShe was too well acquainted with her father’s impetuosity to venture a\nsecond intrusion.  When she had a little recovered the shock of so bitter\na reception, she wiped away her tears to prevent the additional stab that\nthe knowledge of it would give to Hippolita, who questioned her in the\nmost anxious terms on the health of Manfred, and how he bore his loss.\nMatilda assured her he was well, and supported his misfortune with manly\nfortitude.\n\n“But will he not let me see him?” said Hippolita mournfully; “will he not\npermit me to blend my tears with his, and shed a mother’s sorrows in the\nbosom of her Lord?  Or do you deceive me, Matilda?  I know how Manfred\ndoted on his son: is not the stroke too heavy for him? has he not sunk\nunder it?  You do not answer me—alas! I dread the worst!—Raise me, my\nmaidens; I will, I will see my Lord.  Bear me to him instantly: he is\ndearer to me even than my children.”\n\nMatilda made signs to Isabella to prevent Hippolita’s rising; and both\nthose lovely young women were using their gentle violence to stop and\ncalm the Princess, when a servant, on the part of Manfred, arrived and\ntold Isabella that his Lord demanded to speak with her.\n\n“With me!” cried Isabella.\n\n“Go,” said Hippolita, relieved by a message from her Lord: “Manfred\ncannot support the sight of his own family.  He thinks you less\ndisordered than we are, and dreads the shock of my grief.  Console him,\ndear Isabella, and tell him I will smother my own anguish rather than add\nto his.”\n\nAs it was now evening the servant who conducted Isabella bore a torch\nbefore her.  When they came to Manfred, who was walking impatiently about\nthe gallery, he started, and said hastily—\n\n“Take away that light, and begone.”\n\nThen shutting the door impetuously, he flung himself upon a bench against\nthe wall, and bade Isabella sit by him.  She obeyed trembling.\n\n“I sent for you, Lady,” said he—and then stopped under great appearance\nof confusion.\n\n“My Lord!”\n\n“Yes, I sent for you on a matter of great moment,” resumed he.  “Dry your\ntears, young Lady—you have lost your bridegroom.  Yes, cruel fate! and I\nhave lost the hopes of my race!  But Conrad was not worthy of your\nbeauty.”\n\n“How, my Lord!” said Isabella; “sure you do not suspect me of not feeling\nthe concern I ought: my duty and affection would have always—”\n\n“Think no more of him,” interrupted Manfred; “he was a sickly, puny\nchild, and Heaven has perhaps taken him away, that I might not trust the\nhonours of my house on so frail a foundation.  The line of Manfred calls\nfor numerous supports.  My foolish fondness for that boy blinded the eyes\nof my prudence—but it is better as it is.  I hope, in a few years, to\nhave reason to rejoice at the death of Conrad.”\n\nWords cannot paint the astonishment of Isabella.  At first she\napprehended that grief had disordered Manfred’s understanding.  Her next\nthought suggested that this strange discourse was designed to ensnare\nher: she feared that Manfred had perceived her indifference for his son:\nand in consequence of that idea she replied—\n\n“Good my Lord, do not doubt my tenderness: my heart would have\naccompanied my hand.  Conrad would have engrossed all my care; and\nwherever fate shall dispose of me, I shall always cherish his memory, and\nregard your Highness and the virtuous Hippolita as my parents.”\n\n“Curse on Hippolita!” cried Manfred.  “Forget her from this moment, as I\ndo.  In short, Lady, you have missed a husband undeserving of your\ncharms: they shall now be better disposed of.  Instead of a sickly boy,\nyou shall have a husband in the prime of his age, who will know how to\nvalue your beauties, and who may expect a numerous offspring.”\n\n“Alas, my Lord!” said Isabella, “my mind is too sadly engrossed by the\nrecent catastrophe in your family to think of another marriage.  If ever\nmy father returns, and it shall be his pleasure, I shall obey, as I did\nwhen I consented to give my hand to your son: but until his return,\npermit me to remain under your hospitable roof, and employ the melancholy\nhours in assuaging yours, Hippolita’s, and the fair Matilda’s\naffliction.”\n\n“I desired you once before,” said Manfred angrily, “not to name that\nwoman: from this hour she must be a stranger to you, as she must be to\nme.  In short, Isabella, since I cannot give you my son, I offer you\nmyself.”\n\n“Heavens!” cried Isabella, waking from her delusion, “what do I hear?\nYou! my Lord!  You!  My father-in-law! the father of Conrad! the husband\nof the virtuous and tender Hippolita!”\n\n“I tell you,” said Manfred imperiously, “Hippolita is no longer my wife;\nI divorce her from this hour.  Too long has she cursed me by her\nunfruitfulness.  My fate depends on having sons, and this night I trust\nwill give a new date to my hopes.”\n\nAt those words he seized the cold hand of Isabella, who was half dead\nwith fright and horror.  She shrieked, and started from him, Manfred rose\nto pursue her, when the moon, which was now up, and gleamed in at the\nopposite casement, presented to his sight the plumes of the fatal helmet,\nwhich rose to the height of the windows, waving backwards and forwards in\na tempestuous manner, and accompanied with a hollow and rustling sound.\nIsabella, who gathered courage from her situation, and who dreaded\nnothing so much as Manfred’s pursuit of his declaration, cried—\n\n“Look, my Lord! see, Heaven itself declares against your impious\nintentions!”\n\n“Heaven nor Hell shall impede my designs,” said Manfred, advancing again\nto seize the Princess.\n\nAt that instant the portrait of his grandfather, which hung over the\nbench where they had been sitting, uttered a deep sigh, and heaved its\nbreast.\n\nIsabella, whose back was turned to the picture, saw not the motion, nor\nknew whence the sound came, but started, and said—\n\n“Hark, my Lord!  What sound was that?” and at the same time made towards\nthe door.\n\nManfred, distracted between the flight of Isabella, who had now reached\nthe stairs, and yet unable to keep his eyes from the picture, which began\nto move, had, however, advanced some steps after her, still looking\nbackwards on the portrait, when he saw it quit its panel, and descend on\nthe floor with a grave and melancholy air.\n\n“Do I dream?” cried Manfred, returning; “or are the devils themselves in\nleague against me?  Speak, internal spectre!  Or, if thou art my\ngrandsire, why dost thou too conspire against thy wretched descendant,\nwho too dearly pays for—”  Ere he could finish the sentence, the vision\nsighed again, and made a sign to Manfred to follow him.\n\n“Lead on!” cried Manfred; “I will follow thee to the gulf of perdition.”\n\nThe spectre marched sedately, but dejected, to the end of the gallery,\nand turned into a chamber on the right hand.  Manfred accompanied him at\na little distance, full of anxiety and horror, but resolved.  As he would\nhave entered the chamber, the door was clapped to with violence by an\ninvisible hand.  The Prince, collecting courage from this delay, would\nhave forcibly burst open the door with his foot, but found that it\nresisted his utmost efforts.\n\n“Since Hell will not satisfy my curiosity,” said Manfred, “I will use the\nhuman means in my power for preserving my race; Isabella shall not escape\nme.”\n\nThe lady, whose resolution had given way to terror the moment she had\nquitted Manfred, continued her flight to the bottom of the principal\nstaircase.  There she stopped, not knowing whither to direct her steps,\nnor how to escape from the impetuosity of the Prince.  The gates of the\ncastle, she knew, were locked, and guards placed in the court.  Should\nshe, as her heart prompted her, go and prepare Hippolita for the cruel\ndestiny that awaited her, she did not doubt but Manfred would seek her\nthere, and that his violence would incite him to double the injury he\nmeditated, without leaving room for them to avoid the impetuosity of his\npassions.  Delay might give him time to reflect on the horrid measures he\nhad conceived, or produce some circumstance in her favour, if she\ncould—for that night, at least—avoid his odious purpose.  Yet where\nconceal herself?  How avoid the pursuit he would infallibly make\nthroughout the castle?\n\nAs these thoughts passed rapidly through her mind, she recollected a\nsubterraneous passage which led from the vaults of the castle to the\nchurch of St. Nicholas.  Could she reach the altar before she was\novertaken, she knew even Manfred’s violence would not dare to profane the\nsacredness of the place; and she determined, if no other means of\ndeliverance offered, to shut herself up for ever among the holy virgins\nwhose convent was contiguous to the cathedral.  In this resolution, she\nseized a lamp that burned at the foot of the staircase, and hurried\ntowards the secret passage.\n\nThe lower part of the castle was hollowed into several intricate\ncloisters; and it was not easy for one under so much anxiety to find the\ndoor that opened into the cavern.  An awful silence reigned throughout\nthose subterraneous regions, except now and then some blasts of wind that\nshook the doors she had passed, and which, grating on the rusty hinges,\nwere re-echoed through that long labyrinth of darkness.  Every murmur\nstruck her with new terror; yet more she dreaded to hear the wrathful\nvoice of Manfred urging his domestics to pursue her.\n\nShe trod as softly as impatience would give her leave, yet frequently\nstopped and listened to hear if she was followed.  In one of those\nmoments she thought she heard a sigh.  She shuddered, and recoiled a few\npaces.  In a moment she thought she heard the step of some person.  Her\nblood curdled; she concluded it was Manfred.  Every suggestion that\nhorror could inspire rushed into her mind.  She condemned her rash\nflight, which had thus exposed her to his rage in a place where her cries\nwere not likely to draw anybody to her assistance.  Yet the sound seemed\nnot to come from behind.  If Manfred knew where she was, he must have\nfollowed her.  She was still in one of the cloisters, and the steps she\nhad heard were too distinct to proceed from the way she had come.\nCheered with this reflection, and hoping to find a friend in whoever was\nnot the Prince, she was going to advance, when a door that stood ajar, at\nsome distance to the left, was opened gently: but ere her lamp, which she\nheld up, could discover who opened it, the person retreated precipitately\non seeing the light.\n\nIsabella, whom every incident was sufficient to dismay, hesitated whether\nshe should proceed.  Her dread of Manfred soon outweighed every other\nterror.  The very circumstance of the person avoiding her gave her a sort\nof courage.  It could only be, she thought, some domestic belonging to\nthe castle.  Her gentleness had never raised her an enemy, and conscious\ninnocence made her hope that, unless sent by the Prince’s order to seek\nher, his servants would rather assist than prevent her flight.\nFortifying herself with these reflections, and believing by what she\ncould observe that she was near the mouth of the subterraneous cavern,\nshe approached the door that had been opened; but a sudden gust of wind\nthat met her at the door extinguished her lamp, and left her in total\ndarkness.\n\nWords cannot paint the horror of the Princess’s situation.  Alone in so\ndismal a place, her mind imprinted with all the terrible events of the\nday, hopeless of escaping, expecting every moment the arrival of Manfred,\nand far from tranquil on knowing she was within reach of somebody, she\nknew not whom, who for some cause seemed concealed thereabouts; all these\nthoughts crowded on her distracted mind, and she was ready to sink under\nher apprehensions.  She addressed herself to every saint in heaven, and\ninwardly implored their assistance.  For a considerable time she remained\nin an agony of despair.\n\nAt last, as softly as was possible, she felt for the door, and having\nfound it, entered trembling into the vault from whence she had heard the\nsigh and steps.  It gave her a kind of momentary joy to perceive an\nimperfect ray of clouded moonshine gleam from the roof of the vault,\nwhich seemed to be fallen in, and from whence hung a fragment of earth or\nbuilding, she could not distinguish which, that appeared to have been\ncrushed inwards.  She advanced eagerly towards this chasm, when she\ndiscerned a human form standing close against the wall.\n\nShe shrieked, believing it the ghost of her betrothed Conrad.  The\nfigure, advancing, said, in a submissive voice—\n\n“Be not alarmed, Lady; I will not injure you.”\n\nIsabella, a little encouraged by the words and tone of voice of the\nstranger, and recollecting that this must be the person who had opened\nthe door, recovered her spirits enough to reply—\n\n“Sir, whoever you are, take pity on a wretched Princess, standing on the\nbrink of destruction.  Assist me to escape from this fatal castle, or in\na few moments I may be made miserable for ever.”\n\n“Alas!” said the stranger, “what can I do to assist you?  I will die in\nyour defence; but I am unacquainted with the castle, and want—”\n\n“Oh!” said Isabella, hastily interrupting him; “help me but to find a\ntrap-door that must be hereabout, and it is the greatest service you can\ndo me, for I have not a minute to lose.”\n\nSaying a these words, she felt about on the pavement, and directed the\nstranger to search likewise, for a smooth piece of brass enclosed in one\nof the stones.\n\n“That,” said she, “is the lock, which opens with a spring, of which I\nknow the secret.  If we can find that, I may escape—if not, alas!\ncourteous stranger, I fear I shall have involved you in my misfortunes:\nManfred will suspect you for the accomplice of my flight, and you will\nfall a victim to his resentment.”\n\n“I value not my life,” said the stranger, “and it will be some comfort to\nlose it in trying to deliver you from his tyranny.”\n\n“Generous youth,” said Isabella, “how shall I ever requite—”\n\nAs she uttered those words, a ray of moonshine, streaming through a\ncranny of the ruin above, shone directly on the lock they sought.\n\n“Oh! transport!” said Isabella; “here is the trap-door!” and, taking out\nthe key, she touched the spring, which, starting aside, discovered an\niron ring.  “Lift up the door,” said the Princess.\n\nThe stranger obeyed, and beneath appeared some stone steps descending\ninto a vault totally dark.\n\n“We must go down here,” said Isabella.  “Follow me; dark and dismal as it\nis, we cannot miss our way; it leads directly to the church of St.\nNicholas.  But, perhaps,” added the Princess modestly, “you have no\nreason to leave the castle, nor have I farther occasion for your service;\nin a few minutes I shall be safe from Manfred’s rage—only let me know to\nwhom I am so much obliged.”\n\n“I will never quit you,” said the stranger eagerly, “until I have placed\nyou in safety—nor think me, Princess, more generous than I am; though you\nare my principal care—”\n\nThe stranger was interrupted by a sudden noise of voices that seemed\napproaching, and they soon distinguished these words—\n\n“Talk not to me of necromancers; I tell you she must be in the castle; I\nwill find her in spite of enchantment.”\n\n“Oh, heavens!” cried Isabella; “it is the voice of Manfred!  Make haste,\nor we are ruined! and shut the trap-door after you.”\n\nSaying this, she descended the steps precipitately; and as the stranger\nhastened to follow her, he let the door slip out of his hands: it fell,\nand the spring closed over it.  He tried in vain to open it, not having\nobserved Isabella’s method of touching the spring; nor had he many\nmoments to make an essay.  The noise of the falling door had been heard\nby Manfred, who, directed by the sound, hastened thither, attended by his\nservants with torches.\n\n“It must be Isabella,” cried Manfred, before he entered the vault.  “She\nis escaping by the subterraneous passage, but she cannot have got far.”\n\nWhat was the astonishment of the Prince when, instead of Isabella, the\nlight of the torches discovered to him the young peasant whom he thought\nconfined under the fatal helmet!\n\n“Traitor!” said Manfred; “how camest thou here?  I thought thee in\ndurance above in the court.”\n\n“I am no traitor,” replied the young man boldly, “nor am I answerable for\nyour thoughts.”\n\n“Presumptuous villain!” cried Manfred; “dost thou provoke my wrath?  Tell\nme, how hast thou escaped from above?  Thou hast corrupted thy guards,\nand their lives shall answer it.”\n\n“My poverty,” said the peasant calmly, “will disculpate them: though the\nministers of a tyrant’s wrath, to thee they are faithful, and but too\nwilling to execute the orders which you unjustly imposed upon them.”\n\n“Art thou so hardy as to dare my vengeance?” said the Prince; “but\ntortures shall force the truth from thee.  Tell me; I will know thy\naccomplices.”\n\n“There was my accomplice!” said the youth, smiling, and pointing to the\nroof.\n\nManfred ordered the torches to be held up, and perceived that one of the\ncheeks of the enchanted casque had forced its way through the pavement of\nthe court, as his servants had let it fall over the peasant, and had\nbroken through into the vault, leaving a gap, through which the peasant\nhad pressed himself some minutes before he was found by Isabella.\n\n“Was that the way by which thou didst descend?” said Manfred.\n\n“It was,” said the youth.\n\n“But what noise was that,” said Manfred, “which I heard as I entered the\ncloister?”\n\n“A door clapped,” said the peasant; “I heard it as well as you.”\n\n“What door?” said Manfred hastily.\n\n“I am not acquainted with your castle,” said the peasant; “this is the\nfirst time I ever entered it, and this vault the only part of it within\nwhich I ever was.”\n\n“But I tell thee,” said Manfred (wishing to find out if the youth had\ndiscovered the trap-door), “it was this way I heard the noise.  My\nservants heard it too.”\n\n“My Lord,” interrupted one of them officiously, “to be sure it was the\ntrap-door, and he was going to make his escape.”\n\n“Peace, blockhead!” said the Prince angrily; “if he was going to escape,\nhow should he come on this side?  I will know from his own mouth what\nnoise it was I heard.  Tell me truly; thy life depends on thy veracity.”\n\n“My veracity is dearer to me than my life,” said the peasant; “nor would\nI purchase the one by forfeiting the other.”\n\n“Indeed, young philosopher!” said Manfred contemptuously; “tell me, then,\nwhat was the noise I heard?”\n\n“Ask me what I can answer,” said he, “and put me to death instantly if I\ntell you a lie.”\n\nManfred, growing impatient at the steady valour and indifference of the\nyouth, cried—\n\n“Well, then, thou man of truth, answer!  Was it the fall of the trap-door\nthat I heard?”\n\n“It was,” said the youth.\n\n“It was!” said the Prince; “and how didst thou come to know there was a\ntrap-door here?”\n\n“I saw the plate of brass by a gleam of moonshine,” replied he.\n\n“But what told thee it was a lock?” said Manfred.  “How didst thou\ndiscover the secret of opening it?”\n\n“Providence, that delivered me from the helmet, was able to direct me to\nthe spring of a lock,” said he.\n\n“Providence should have gone a little farther, and have placed thee out\nof the reach of my resentment,” said Manfred.  “When Providence had\ntaught thee to open the lock, it abandoned thee for a fool, who did not\nknow how to make use of its favours.  Why didst thou not pursue the path\npointed out for thy escape?  Why didst thou shut the trap-door before\nthou hadst descended the steps?”\n\n“I might ask you, my Lord,” said the peasant, “how I, totally\nunacquainted with your castle, was to know that those steps led to any\noutlet? but I scorn to evade your questions.  Wherever those steps lead\nto, perhaps I should have explored the way—I could not be in a worse\nsituation than I was.  But the truth is, I let the trap-door fall: your\nimmediate arrival followed.  I had given the alarm—what imported it to me\nwhether I was seized a minute sooner or a minute later?”\n\n“Thou art a resolute villain for thy years,” said Manfred; “yet on\nreflection I suspect thou dost but trifle with me.  Thou hast not yet\ntold me how thou didst open the lock.”\n\n“That I will show you, my Lord,” said the peasant; and, taking up a\nfragment of stone that had fallen from above, he laid himself on the\ntrap-door, and began to beat on the piece of brass that covered it,\nmeaning to gain time for the escape of the Princess.  This presence of\nmind, joined to the frankness of the youth, staggered Manfred.  He even\nfelt a disposition towards pardoning one who had been guilty of no crime.\nManfred was not one of those savage tyrants who wanton in cruelty\nunprovoked.  The circumstances of his fortune had given an asperity to\nhis temper, which was naturally humane; and his virtues were always ready\nto operate, when his passions did not obscure his reason.\n\nWhile the Prince was in this suspense, a confused noise of voices echoed\nthrough the distant vaults.  As the sound approached, he distinguished\nthe clamours of some of his domestics, whom he had dispersed through the\ncastle in search of Isabella, calling out—\n\n“Where is my Lord? where is the Prince?”\n\n“Here I am,” said Manfred, as they came nearer; “have you found the\nPrincess?”\n\nThe first that arrived, replied, “Oh, my Lord!  I am glad we have found\nyou.”\n\n“Found me!” said Manfred; “have you found the Princess?”\n\n“We thought we had, my Lord,” said the fellow, looking terrified, “but—”\n\n“But, what?” cried the Prince; “has she escaped?”\n\n“Jaquez and I, my Lord—”\n\n“Yes, I and Diego,” interrupted the second, who came up in still greater\nconsternation.\n\n“Speak one of you at a time,” said Manfred; “I ask you, where is the\nPrincess?”\n\n“We do not know,” said they both together; “but we are frightened out of\nour wits.”\n\n“So I think, blockheads,” said Manfred; “what is it has scared you thus?”\n\n“Oh! my Lord,” said Jaquez, “Diego has seen such a sight! your Highness\nwould not believe our eyes.”\n\n“What new absurdity is this?” cried Manfred; “give me a direct answer,\nor, by Heaven—”\n\n“Why, my Lord, if it please your Highness to hear me,” said the poor\nfellow, “Diego and I—”\n\n“Yes, I and Jaquez—” cried his comrade.\n\n“Did not I forbid you to speak both at a time?” said the Prince: “you,\nJaquez, answer; for the other fool seems more distracted than thou art;\nwhat is the matter?”\n\n“My gracious Lord,” said Jaquez, “if it please your Highness to hear me;\nDiego and I, according to your Highness’s orders, went to search for the\nyoung Lady; but being comprehensive that we might meet the ghost of my\nyoung Lord, your Highness’s son, God rest his soul, as he has not\nreceived Christian burial—”\n\n“Sot!” cried Manfred in a rage; “is it only a ghost, then, that thou hast\nseen?”\n\n“Oh! worse! worse! my Lord,” cried Diego: “I had rather have seen ten\nwhole ghosts.”\n\n“Grant me patience!” said Manfred; “these blockheads distract me.  Out of\nmy sight, Diego! and thou, Jaquez, tell me in one word, art thou sober?\nart thou raving? thou wast wont to have some sense: has the other sot\nfrightened himself and thee too?  Speak; what is it he fancies he has\nseen?”\n\n“Why, my Lord,” replied Jaquez, trembling, “I was going to tell your\nHighness, that since the calamitous misfortune of my young Lord, God rest\nhis precious soul! not one of us your Highness’s faithful servants—indeed\nwe are, my Lord, though poor men—I say, not one of us has dared to set a\nfoot about the castle, but two together: so Diego and I, thinking that my\nyoung Lady might be in the great gallery, went up there to look for her,\nand tell her your Highness wanted something to impart to her.”\n\n“O blundering fools!” cried Manfred; “and in the meantime, she has made\nher escape, because you were afraid of goblins!—Why, thou knave! she left\nme in the gallery; I came from thence myself.”\n\n“For all that, she may be there still for aught I know,” said Jaquez;\n“but the devil shall have me before I seek her there again—poor Diego!  I\ndo not believe he will ever recover it.”\n\n“Recover what?” said Manfred; “am I never to learn what it is has\nterrified these rascals?—but I lose my time; follow me, slave; I will see\nif she is in the gallery.”\n\n“For Heaven’s sake, my dear, good Lord,” cried Jaquez, “do not go to the\ngallery.  Satan himself I believe is in the chamber next to the gallery.”\n\nManfred, who hitherto had treated the terror of his servants as an idle\npanic, was struck at this new circumstance.  He recollected the\napparition of the portrait, and the sudden closing of the door at the end\nof the gallery.  His voice faltered, and he asked with disorder—\n\n“What is in the great chamber?”\n\n“My Lord,” said Jaquez, “when Diego and I came into the gallery, he went\nfirst, for he said he had more courage than I.  So when we came into the\ngallery we found nobody.  We looked under every bench and stool; and\nstill we found nobody.”\n\n“Were all the pictures in their places?” said Manfred.\n\n“Yes, my Lord,” answered Jaquez; “but we did not think of looking behind\nthem.”\n\n“Well, well!” said Manfred; “proceed.”\n\n“When we came to the door of the great chamber,” continued Jaquez, “we\nfound it shut.”\n\n“And could not you open it?” said Manfred.\n\n“Oh! yes, my Lord; would to Heaven we had not!” replied he—“nay, it was\nnot I neither; it was Diego: he was grown foolhardy, and would go on,\nthough I advised him not—if ever I open a door that is shut again—”\n\n“Trifle not,” said Manfred, shuddering, “but tell me what you saw in the\ngreat chamber on opening the door.”\n\n“I! my Lord!” said Jaquez; “I was behind Diego; but I heard the noise.”\n\n“Jaquez,” said Manfred, in a solemn tone of voice; “tell me, I adjure\nthee by the souls of my ancestors, what was it thou sawest? what was it\nthou heardest?”\n\n“It was Diego saw it, my Lord, it was not I,” replied Jaquez; “I only\nheard the noise.  Diego had no sooner opened the door, than he cried out,\nand ran back.  I ran back too, and said, ‘Is it the ghost?’  ‘The ghost!\nno, no,’ said Diego, and his hair stood on end—‘it is a giant, I believe;\nhe is all clad in armour, for I saw his foot and part of his leg, and\nthey are as large as the helmet below in the court.’  As he said these\nwords, my Lord, we heard a violent motion and the rattling of armour, as\nif the giant was rising, for Diego has told me since that he believes the\ngiant was lying down, for the foot and leg were stretched at length on\nthe floor.  Before we could get to the end of the gallery, we heard the\ndoor of the great chamber clap behind us, but we did not dare turn back\nto see if the giant was following us—yet, now I think on it, we must have\nheard him if he had pursued us—but for Heaven’s sake, good my Lord, send\nfor the chaplain, and have the castle exorcised, for, for certain, it is\nenchanted.”\n\n“Ay, pray do, my Lord,” cried all the servants at once, “or we must leave\nyour Highness’s service.”\n\n“Peace, dotards!” said Manfred, “and follow me; I will know what all this\nmeans.”\n\n“We! my Lord!” cried they with one voice; “we would not go up to the\ngallery for your Highness’s revenue.”  The young peasant, who had stood\nsilent, now spoke.\n\n“Will your Highness,” said he, “permit me to try this adventure?  My life\nis of consequence to nobody; I fear no bad angel, and have offended no\ngood one.”\n\n“Your behaviour is above your seeming,” said Manfred, viewing him with\nsurprise and admiration—“hereafter I will reward your bravery—but now,”\ncontinued he with a sigh, “I am so circumstanced, that I dare trust no\neyes but my own.  However, I give you leave to accompany me.”\n\nManfred, when he first followed Isabella from the gallery, had gone\ndirectly to the apartment of his wife, concluding the Princess had\nretired thither.  Hippolita, who knew his step, rose with anxious\nfondness to meet her Lord, whom she had not seen since the death of their\nson.  She would have flown in a transport mixed of joy and grief to his\nbosom, but he pushed her rudely off, and said—\n\n“Where is Isabella?”\n\n“Isabella! my Lord!” said the astonished Hippolita.\n\n“Yes, Isabella,” cried Manfred imperiously; “I want Isabella.”\n\n“My Lord,” replied Matilda, who perceived how much his behaviour had\nshocked her mother, “she has not been with us since your Highness\nsummoned her to your apartment.”\n\n“Tell me where she is,” said the Prince; “I do not want to know where she\nhas been.”\n\n“My good Lord,” says Hippolita, “your daughter tells you the truth:\nIsabella left us by your command, and has not returned since;—but, my\ngood Lord, compose yourself: retire to your rest: this dismal day has\ndisordered you.  Isabella shall wait your orders in the morning.”\n\n“What, then, you know where she is!” cried Manfred.  “Tell me directly,\nfor I will not lose an instant—and you, woman,” speaking to his wife,\n“order your chaplain to attend me forthwith.”\n\n“Isabella,” said Hippolita calmly, “is retired, I suppose, to her\nchamber: she is not accustomed to watch at this late hour.  Gracious my\nLord,” continued she, “let me know what has disturbed you.  Has Isabella\noffended you?”\n\n“Trouble me not with questions,” said Manfred, “but tell me where she\nis.”\n\n“Matilda shall call her,” said the Princess.  “Sit down, my Lord, and\nresume your wonted fortitude.”\n\n“What, art thou jealous of Isabella?” replied he, “that you wish to be\npresent at our interview!”\n\n“Good heavens! my Lord,” said Hippolita, “what is it your Highness\nmeans?”\n\n“Thou wilt know ere many minutes are passed,” said the cruel Prince.\n“Send your chaplain to me, and wait my pleasure here.”\n\nAt these words he flung out of the room in search of Isabella, leaving\nthe amazed ladies thunderstruck with his words and frantic deportment,\nand lost in vain conjectures on what he was meditating.\n\nManfred was now returning from the vault, attended by the peasant and a\nfew of his servants whom he had obliged to accompany him.  He ascended\nthe staircase without stopping till he arrived at the gallery, at the\ndoor of which he met Hippolita and her chaplain.  When Diego had been\ndismissed by Manfred, he had gone directly to the Princess’s apartment\nwith the alarm of what he had seen.  That excellent Lady, who no more\nthan Manfred doubted of the reality of the vision, yet affected to treat\nit as a delirium of the servant.  Willing, however, to save her Lord from\nany additional shock, and prepared by a series of griefs not to tremble\nat any accession to it, she determined to make herself the first\nsacrifice, if fate had marked the present hour for their destruction.\nDismissing the reluctant Matilda to her rest, who in vain sued for leave\nto accompany her mother, and attended only by her chaplain, Hippolita had\nvisited the gallery and great chamber; and now with more serenity of soul\nthan she had felt for many hours, she met her Lord, and assured him that\nthe vision of the gigantic leg and foot was all a fable; and no doubt an\nimpression made by fear, and the dark and dismal hour of the night, on\nthe minds of his servants.  She and the chaplain had examined the\nchamber, and found everything in the usual order.\n\nManfred, though persuaded, like his wife, that the vision had been no\nwork of fancy, recovered a little from the tempest of mind into which so\nmany strange events had thrown him.  Ashamed, too, of his inhuman\ntreatment of a Princess who returned every injury with new marks of\ntenderness and duty, he felt returning love forcing itself into his eyes;\nbut not less ashamed of feeling remorse towards one against whom he was\ninwardly meditating a yet more bitter outrage, he curbed the yearnings of\nhis heart, and did not dare to lean even towards pity.  The next\ntransition of his soul was to exquisite villainy.\n\nPresuming on the unshaken submission of Hippolita, he flattered himself\nthat she would not only acquiesce with patience to a divorce, but would\nobey, if it was his pleasure, in endeavouring to persuade Isabella to\ngive him her hand—but ere he could indulge his horrid hope, he reflected\nthat Isabella was not to be found.  Coming to himself, he gave orders\nthat every avenue to the castle should be strictly guarded, and charged\nhis domestics on pain of their lives to suffer nobody to pass out.  The\nyoung peasant, to whom he spoke favourably, he ordered to remain in a\nsmall chamber on the stairs, in which there was a pallet-bed, and the key\nof which he took away himself, telling the youth he would talk with him\nin the morning.  Then dismissing his attendants, and bestowing a sullen\nkind of half-nod on Hippolita, he retired to his own chamber.\n\n\n\n\nCHAPTER II.\n\n\nMatilda, who by Hippolita’s order had retired to her apartment, was\nill-disposed to take any rest.  The shocking fate of her brother had\ndeeply affected her.  She was surprised at not seeing Isabella; but the\nstrange words which had fallen from her father, and his obscure menace to\nthe Princess his wife, accompanied by the most furious behaviour, had\nfilled her gentle mind with terror and alarm.  She waited anxiously for\nthe return of Bianca, a young damsel that attended her, whom she had sent\nto learn what was become of Isabella.  Bianca soon appeared, and informed\nher mistress of what she had gathered from the servants, that Isabella\nwas nowhere to be found.  She related the adventure of the young peasant\nwho had been discovered in the vault, though with many simple additions\nfrom the incoherent accounts of the domestics; and she dwelt principally\non the gigantic leg and foot which had been seen in the gallery-chamber.\nThis last circumstance had terrified Bianca so much, that she was\nrejoiced when Matilda told her that she would not go to rest, but would\nwatch till the Princess should rise.\n\nThe young Princess wearied herself in conjectures on the flight of\nIsabella, and on the threats of Manfred to her mother.  “But what\nbusiness could he have so urgent with the chaplain?” said Matilda, “Does\nhe intend to have my brother’s body interred privately in the chapel?”\n\n“Oh, Madam!” said Bianca, “now I guess.  As you are become his heiress,\nhe is impatient to have you married: he has always been raving for more\nsons; I warrant he is now impatient for grandsons.  As sure as I live,\nMadam, I shall see you a bride at last.—Good madam, you won’t cast off\nyour faithful Bianca: you won’t put Donna Rosara over me now you are a\ngreat Princess.”\n\n“My poor Bianca,” said Matilda, “how fast your thoughts amble!  I a great\nprincess!  What hast thou seen in Manfred’s behaviour since my brother’s\ndeath that bespeaks any increase of tenderness to me?  No, Bianca; his\nheart was ever a stranger to me—but he is my father, and I must not\ncomplain.  Nay, if Heaven shuts my father’s heart against me, it overpays\nmy little merit in the tenderness of my mother—O that dear mother! yes,\nBianca, ’tis there I feel the rugged temper of Manfred.  I can support\nhis harshness to me with patience; but it wounds my soul when I am\nwitness to his causeless severity towards her.”\n\n“Oh! Madam,” said Bianca, “all men use their wives so, when they are\nweary of them.”\n\n“And yet you congratulated me but now,” said Matilda, “when you fancied\nmy father intended to dispose of me!”\n\n“I would have you a great Lady,” replied Bianca, “come what will.  I do\nnot wish to see you moped in a convent, as you would be if you had your\nwill, and if my Lady, your mother, who knows that a bad husband is better\nthan no husband at all, did not hinder you.—Bless me! what noise is that!\nSt. Nicholas forgive me!  I was but in jest.”\n\n“It is the wind,” said Matilda, “whistling through the battlements in the\ntower above: you have heard it a thousand times.”\n\n“Nay,” said Bianca, “there was no harm neither in what I said: it is no\nsin to talk of matrimony—and so, Madam, as I was saying, if my Lord\nManfred should offer you a handsome young Prince for a bridegroom, you\nwould drop him a curtsey, and tell him you would rather take the veil?”\n\n“Thank Heaven!  I am in no such danger,” said Matilda: “you know how many\nproposals for me he has rejected—”\n\n“And you thank him, like a dutiful daughter, do you, Madam?  But come,\nMadam; suppose, to-morrow morning, he was to send for you to the great\ncouncil chamber, and there you should find at his elbow a lovely young\nPrince, with large black eyes, a smooth white forehead, and manly curling\nlocks like jet; in short, Madam, a young hero resembling the picture of\nthe good Alfonso in the gallery, which you sit and gaze at for hours\ntogether—”\n\n“Do not speak lightly of that picture,” interrupted Matilda sighing; “I\nknow the adoration with which I look at that picture is uncommon—but I am\nnot in love with a coloured panel.  The character of that virtuous\nPrince, the veneration with which my mother has inspired me for his\nmemory, the orisons which, I know not why, she has enjoined me to pour\nforth at his tomb, all have concurred to persuade me that somehow or\nother my destiny is linked with something relating to him.”\n\n“Lord, Madam! how should that be?” said Bianca; “I have always heard that\nyour family was in no way related to his: and I am sure I cannot conceive\nwhy my Lady, the Princess, sends you in a cold morning or a damp evening\nto pray at his tomb: he is no saint by the almanack.  If you must pray,\nwhy does she not bid you address yourself to our great St. Nicholas?  I\nam sure he is the saint I pray to for a husband.”\n\n“Perhaps my mind would be less affected,” said Matilda, “if my mother\nwould explain her reasons to me: but it is the mystery she observes, that\ninspires me with this—I know not what to call it.  As she never acts from\ncaprice, I am sure there is some fatal secret at bottom—nay, I know there\nis: in her agony of grief for my brother’s death she dropped some words\nthat intimated as much.”\n\n“Oh! dear Madam,” cried Bianca, “what were they?”\n\n“No,” said Matilda, “if a parent lets fall a word, and wishes it\nrecalled, it is not for a child to utter it.”\n\n“What! was she sorry for what she had said?” asked Bianca; “I am sure,\nMadam, you may trust me—”\n\n“With my own little secrets when I have any, I may,” said Matilda; “but\nnever with my mother’s: a child ought to have no ears or eyes but as a\nparent directs.”\n\n“Well! to be sure, Madam, you were born to be a saint,” said Bianca, “and\nthere is no resisting one’s vocation: you will end in a convent at last.\nBut there is my Lady Isabella would not be so reserved to me: she will\nlet me talk to her of young men: and when a handsome cavalier has come to\nthe castle, she has owned to me that she wished your brother Conrad\nresembled him.”\n\n“Bianca,” said the Princess, “I do not allow you to mention my friend\ndisrespectfully.  Isabella is of a cheerful disposition, but her soul is\npure as virtue itself.  She knows your idle babbling humour, and perhaps\nhas now and then encouraged it, to divert melancholy, and enliven the\nsolitude in which my father keeps us—”\n\n“Blessed Mary!” said Bianca, starting, “there it is again!  Dear Madam,\ndo you hear nothing? this castle is certainly haunted!”\n\n“Peace!” said Matilda, “and listen!  I did think I heard a voice—but it\nmust be fancy: your terrors, I suppose, have infected me.”\n\n“Indeed! indeed!  Madam,” said Bianca, half-weeping with agony, “I am\nsure I heard a voice.”\n\n“Does anybody lie in the chamber beneath?” said the Princess.\n\n“Nobody has dared to lie there,” answered Bianca, “since the great\nastrologer, that was your brother’s tutor, drowned himself.  For certain,\nMadam, his ghost and the young Prince’s are now met in the chamber\nbelow—for Heaven’s sake let us fly to your mother’s apartment!”\n\n“I charge you not to stir,” said Matilda.  “If they are spirits in pain,\nwe may ease their sufferings by questioning them.  They can mean no hurt\nto us, for we have not injured them—and if they should, shall we be more\nsafe in one chamber than in another?  Reach me my beads; we will say a\nprayer, and then speak to them.”\n\n“Oh! dear Lady, I would not speak to a ghost for the world!” cried\nBianca.  As she said those words they heard the casement of the little\nchamber below Matilda’s open.  They listened attentively, and in a few\nminutes thought they heard a person sing, but could not distinguish the\nwords.\n\n“This can be no evil spirit,” said the Princess, in a low voice; “it is\nundoubtedly one of the family—open the window, and we shall know the\nvoice.”\n\n“I dare not, indeed, Madam,” said Bianca.\n\n“Thou art a very fool,” said Matilda, opening the window gently herself.\nThe noise the Princess made was, however, heard by the person beneath,\nwho stopped; and they concluded had heard the casement open.\n\n“Is anybody below?” said the Princess; “if there is, speak.”\n\n“Yes,” said an unknown voice.\n\n“Who is it?” said Matilda.\n\n“A stranger,” replied the voice.\n\n“What stranger?” said she; “and how didst thou come there at this unusual\nhour, when all the gates of the castle are locked?”\n\n“I am not here willingly,” answered the voice.  “But pardon me, Lady, if\nI have disturbed your rest; I knew not that I was overheard.  Sleep had\nforsaken me; I left a restless couch, and came to waste the irksome hours\nwith gazing on the fair approach of morning, impatient to be dismissed\nfrom this castle.”\n\n“Thy words and accents,” said Matilda, “are of melancholy cast; if thou\nart unhappy, I pity thee.  If poverty afflicts thee, let me know it; I\nwill mention thee to the Princess, whose beneficent soul ever melts for\nthe distressed, and she will relieve thee.”\n\n“I am indeed unhappy,” said the stranger; “and I know not what wealth is.\nBut I do not complain of the lot which Heaven has cast for me; I am young\nand healthy, and am not ashamed of owing my support to myself—yet think\nme not proud, or that I disdain your generous offers.  I will remember\nyou in my orisons, and will pray for blessings on your gracious self and\nyour noble mistress—if I sigh, Lady, it is for others, not for myself.”\n\n“Now I have it, Madam,” said Bianca, whispering the Princess; “this is\ncertainly the young peasant; and, by my conscience, he is in love—Well!\nthis is a charming adventure!—do, Madam, let us sift him.  He does not\nknow you, but takes you for one of my Lady Hippolita’s women.”\n\n“Art thou not ashamed, Bianca!” said the Princess.  “What right have we\nto pry into the secrets of this young man’s heart?  He seems virtuous and\nfrank, and tells us he is unhappy.  Are those circumstances that\nauthorise us to make a property of him?  How are we entitled to his\nconfidence?”\n\n“Lord, Madam! how little you know of love!” replied Bianca; “why, lovers\nhave no pleasure equal to talking of their mistress.”\n\n“And would you have _me_ become a peasant’s confidante?” said the\nPrincess.\n\n“Well, then, let me talk to him,” said Bianca; “though I have the honour\nof being your Highness’s maid of honour, I was not always so great.\nBesides, if love levels ranks, it raises them too; I have a respect for\nany young man in love.”\n\n“Peace, simpleton!” said the Princess.  “Though he said he was unhappy,\nit does not follow that he must be in love.  Think of all that has\nhappened to-day, and tell me if there are no misfortunes but what love\ncauses.—Stranger,” resumed the Princess, “if thy misfortunes have not\nbeen occasioned by thy own fault, and are within the compass of the\nPrincess Hippolita’s power to redress, I will take upon me to answer that\nshe will be thy protectress.  When thou art dismissed from this castle,\nrepair to holy father Jerome, at the convent adjoining to the church of\nSt. Nicholas, and make thy story known to him, as far as thou thinkest\nmeet.  He will not fail to inform the Princess, who is the mother of all\nthat want her assistance.  Farewell; it is not seemly for me to hold\nfarther converse with a man at this unwonted hour.”\n\n“May the saints guard thee, gracious Lady!” replied the peasant; “but oh!\nif a poor and worthless stranger might presume to beg a minute’s audience\nfarther; am I so happy? the casement is not shut; might I venture to\nask—”\n\n“Speak quickly,” said Matilda; “the morning dawns apace: should the\nlabourers come into the fields and perceive us—What wouldst thou ask?”\n\n“I know not how, I know not if I dare,” said the Young stranger,\nfaltering; “yet the humanity with which you have spoken to me\nemboldens—Lady! dare I trust you?”\n\n“Heavens!” said Matilda, “what dost thou mean?  With what wouldst thou\ntrust me?  Speak boldly, if thy secret is fit to be entrusted to a\nvirtuous breast.”\n\n“I would ask,” said the peasant, recollecting himself, “whether what I\nhave heard from the domestics is true, that the Princess is missing from\nthe castle?”\n\n“What imports it to thee to know?” replied Matilda.  “Thy first words\nbespoke a prudent and becoming gravity.  Dost thou come hither to pry\ninto the secrets of Manfred?  Adieu.  I have been mistaken in thee.”\nSaying these words she shut the casement hastily, without giving the\nyoung man time to reply.\n\n“I had acted more wisely,” said the Princess to Bianca, with some\nsharpness, “if I had let thee converse with this peasant; his\ninquisitiveness seems of a piece with thy own.”\n\n“It is not fit for me to argue with your Highness,” replied Bianca; “but\nperhaps the questions I should have put to him would have been more to\nthe purpose than those you have been pleased to ask him.”\n\n“Oh! no doubt,” said Matilda; “you are a very discreet personage!  May I\nknow what _you_ would have asked him?”\n\n“A bystander often sees more of the game than those that play,” answered\nBianca.  “Does your Highness think, Madam, that this question about my\nLady Isabella was the result of mere curiosity?  No, no, Madam, there is\nmore in it than you great folks are aware of.  Lopez told me that all the\nservants believe this young fellow contrived my Lady Isabella’s escape;\nnow, pray, Madam, observe you and I both know that my Lady Isabella never\nmuch fancied the Prince your brother.  Well! he is killed just in a\ncritical minute—I accuse nobody.  A helmet falls from the moon—so, my\nLord, your father says; but Lopez and all the servants say that this\nyoung spark is a magician, and stole it from Alfonso’s tomb—”\n\n“Have done with this rhapsody of impertinence,” said Matilda.\n\n“Nay, Madam, as you please,” cried Bianca; “yet it is very particular\nthough, that my Lady Isabella should be missing the very same day, and\nthat this young sorcerer should be found at the mouth of the trap-door.\nI accuse nobody; but if my young Lord came honestly by his death—”\n\n“Dare not on thy duty,” said Matilda, “to breathe a suspicion on the\npurity of my dear Isabella’s fame.”\n\n“Purity, or not purity,” said Bianca, “gone she is—a stranger is found\nthat nobody knows; you question him yourself; he tells you he is in love,\nor unhappy, it is the same thing—nay, he owned he was unhappy about\nothers; and is anybody unhappy about another, unless they are in love\nwith them? and at the very next word, he asks innocently, pour soul! if\nmy Lady Isabella is missing.”\n\n“To be sure,” said Matilda, “thy observations are not totally without\nfoundation—Isabella’s flight amazes me.  The curiosity of the stranger is\nvery particular; yet Isabella never concealed a thought from me.”\n\n“So she told you,” said Bianca, “to fish out your secrets; but who knows,\nMadam, but this stranger may be some Prince in disguise?  Do, Madam, let\nme open the window, and ask him a few questions.”\n\n“No,” replied Matilda, “I will ask him myself, if he knows aught of\nIsabella; he is not worthy I should converse farther with him.”  She was\ngoing to open the casement, when they heard the bell ring at the\npostern-gate of the castle, which is on the right hand of the tower,\nwhere Matilda lay.  This prevented the Princess from renewing the\nconversation with the stranger.\n\nAfter continuing silent for some time, “I am persuaded,” said she to\nBianca, “that whatever be the cause of Isabella’s flight it had no\nunworthy motive.  If this stranger was accessory to it, she must be\nsatisfied with his fidelity and worth.  I observed, did not you, Bianca?\nthat his words were tinctured with an uncommon infusion of piety.  It was\nno ruffian’s speech; his phrases were becoming a man of gentle birth.”\n\n“I told you, Madam,” said Bianca, “that I was sure he was some Prince in\ndisguise.”\n\n“Yet,” said Matilda, “if he was privy to her escape, how will you account\nfor his not accompanying her in her flight? why expose himself\nunnecessarily and rashly to my father’s resentment?”\n\n“As for that, Madam,” replied she, “if he could get from under the\nhelmet, he will find ways of eluding your father’s anger.  I do not doubt\nbut he has some talisman or other about him.”\n\n“You resolve everything into magic,” said Matilda; “but a man who has any\nintercourse with infernal spirits, does not dare to make use of those\ntremendous and holy words which he uttered.  Didst thou not observe with\nwhat fervour he vowed to remember _me_ to heaven in his prayers?  Yes;\nIsabella was undoubtedly convinced of his piety.”\n\n“Commend me to the piety of a young fellow and a damsel that consult to\nelope!” said Bianca.  “No, no, Madam, my Lady Isabella is of another\nguess mould than you take her for.  She used indeed to sigh and lift up\nher eyes in your company, because she knows you are a saint; but when\nyour back was turned—”\n\n“You wrong her,” said Matilda; “Isabella is no hypocrite; she has a due\nsense of devotion, but never affected a call she has not.  On the\ncontrary, she always combated my inclination for the cloister; and though\nI own the mystery she has made to me of her flight confounds me; though\nit seems inconsistent with the friendship between us; I cannot forget the\ndisinterested warmth with which she always opposed my taking the veil.\nShe wished to see me married, though my dower would have been a loss to\nher and my brother’s children.  For her sake I will believe well of this\nyoung peasant.”\n\n“Then you do think there is some liking between them,” said Bianca.\nWhile she was speaking, a servant came hastily into the chamber and told\nthe Princess that the Lady Isabella was found.\n\n“Where?” said Matilda.\n\n“She has taken sanctuary in St. Nicholas’s church,” replied the servant;\n“Father Jerome has brought the news himself; he is below with his\nHighness.”\n\n“Where is my mother?” said Matilda.\n\n“She is in her own chamber, Madam, and has asked for you.”\n\nManfred had risen at the first dawn of light, and gone to Hippolita’s\napartment, to inquire if she knew aught of Isabella.  While he was\nquestioning her, word was brought that Jerome demanded to speak with him.\nManfred, little suspecting the cause of the Friar’s arrival, and knowing\nhe was employed by Hippolita in her charities, ordered him to be\nadmitted, intending to leave them together, while he pursued his search\nafter Isabella.\n\n“Is your business with me or the Princess?” said Manfred.\n\n“With both,” replied the holy man.  “The Lady Isabella—”\n\n“What of her?” interrupted Manfred, eagerly.\n\n“Is at St. Nicholas’s altar,” replied Jerome.\n\n“That is no business of Hippolita,” said Manfred with confusion; “let us\nretire to my chamber, Father, and inform me how she came thither.”\n\n“No, my Lord,” replied the good man, with an air of firmness and\nauthority, that daunted even the resolute Manfred, who could not help\nrevering the saint-like virtues of Jerome; “my commission is to both, and\nwith your Highness’s good-liking, in the presence of both I shall deliver\nit; but first, my Lord, I must interrogate the Princess, whether she is\nacquainted with the cause of the Lady Isabella’s retirement from your\ncastle.”\n\n“No, on my soul,” said Hippolita; “does Isabella charge me with being\nprivy to it?”\n\n“Father,” interrupted Manfred, “I pay due reverence to your holy\nprofession; but I am sovereign here, and will allow no meddling priest to\ninterfere in the affairs of my domestic.  If you have aught to say attend\nme to my chamber; I do not use to let my wife be acquainted with the\nsecret affairs of my state; they are not within a woman’s province.”\n\n“My Lord,” said the holy man, “I am no intruder into the secrets of\nfamilies.  My office is to promote peace, to heal divisions, to preach\nrepentance, and teach mankind to curb their headstrong passions.  I\nforgive your Highness’s uncharitable apostrophe; I know my duty, and am\nthe minister of a mightier prince than Manfred.  Hearken to him who\nspeaks through my organs.”\n\nManfred trembled with rage and shame.  Hippolita’s countenance declared\nher astonishment and impatience to know where this would end.  Her\nsilence more strongly spoke her observance of Manfred.\n\n“The Lady Isabella,” resumed Jerome, “commends herself to both your\nHighnesses; she thanks both for the kindness with which she has been\ntreated in your castle: she deplores the loss of your son, and her own\nmisfortune in not becoming the daughter of such wise and noble Princes,\nwhom she shall always respect as Parents; she prays for uninterrupted\nunion and felicity between you” [Manfred’s colour changed]: “but as it is\nno longer possible for her to be allied to you, she entreats your consent\nto remain in sanctuary, till she can learn news of her father, or, by the\ncertainty of his death, be at liberty, with the approbation of her\nguardians, to dispose of herself in suitable marriage.”\n\n“I shall give no such consent,” said the Prince, “but insist on her\nreturn to the castle without delay: I am answerable for her person to her\nguardians, and will not brook her being in any hands but my own.”\n\n“Your Highness will recollect whether that can any longer be proper,”\nreplied the Friar.\n\n“I want no monitor,” said Manfred, colouring; “Isabella’s conduct leaves\nroom for strange suspicions—and that young villain, who was at least the\naccomplice of her flight, if not the cause of it—”\n\n“The cause!” interrupted Jerome; “was a _young_ man the cause?”\n\n“This is not to be borne!” cried Manfred.  “Am I to be bearded in my own\npalace by an insolent Monk?  Thou art privy, I guess, to their amours.”\n\n“I would pray to heaven to clear up your uncharitable surmises,” said\nJerome, “if your Highness were not satisfied in your conscience how\nunjustly you accuse me.  I do pray to heaven to pardon that\nuncharitableness: and I implore your Highness to leave the Princess at\npeace in that holy place, where she is not liable to be disturbed by such\nvain and worldly fantasies as discourses of love from any man.”\n\n“Cant not to me,” said Manfred, “but return and bring the Princess to her\nduty.”\n\n“It is my duty to prevent her return hither,” said Jerome.  “She is where\norphans and virgins are safest from the snares and wiles of this world;\nand nothing but a parent’s authority shall take her thence.”\n\n“I am her parent,” cried Manfred, “and demand her.”\n\n“She wished to have you for her parent,” said the Friar; “but Heaven that\nforbad that connection has for ever dissolved all ties betwixt you: and I\nannounce to your Highness—”\n\n“Stop! audacious man,” said Manfred, “and dread my displeasure.”\n\n“Holy Father,” said Hippolita, “it is your office to be no respecter of\npersons: you must speak as your duty prescribes: but it is my duty to\nhear nothing that it pleases not my Lord I should hear.  Attend the\nPrince to his chamber.  I will retire to my oratory, and pray to the\nblessed Virgin to inspire you with her holy counsels, and to restore the\nheart of my gracious Lord to its wonted peace and gentleness.”\n\n“Excellent woman!” said the Friar.  “My Lord, I attend your pleasure.”\n\nManfred, accompanied by the Friar, passed to his own apartment, where\nshutting the door, “I perceive, Father,” said he, “that Isabella has\nacquainted you with my purpose.  Now hear my resolve, and obey.  Reasons\nof state, most urgent reasons, my own and the safety of my people, demand\nthat I should have a son.  It is in vain to expect an heir from\nHippolita.  I have made choice of Isabella.  You must bring her back; and\nyou must do more.  I know the influence you have with Hippolita: her\nconscience is in your hands.  She is, I allow, a faultless woman: her\nsoul is set on heaven, and scorns the little grandeur of this world: you\ncan withdraw her from it entirely.  Persuade her to consent to the\ndissolution of our marriage, and to retire into a monastery—she shall\nendow one if she will; and she shall have the means of being as liberal\nto your order as she or you can wish.  Thus you will divert the\ncalamities that are hanging over our heads, and have the merit of saying\nthe principality of Otranto from destruction.  You are a prudent man, and\nthough the warmth of my temper betrayed me into some unbecoming\nexpressions, I honour your virtue, and wish to be indebted to you for the\nrepose of my life and the preservation of my family.”\n\n“The will of heaven be done!” said the Friar.  “I am but its worthless\ninstrument.  It makes use of my tongue to tell thee, Prince, of thy\nunwarrantable designs.  The injuries of the virtuous Hippolita have\nmounted to the throne of pity.  By me thou art reprimanded for thy\nadulterous intention of repudiating her: by me thou art warned not to\npursue the incestuous design on thy contracted daughter.  Heaven that\ndelivered her from thy fury, when the judgments so recently fallen on thy\nhouse ought to have inspired thee with other thoughts, will continue to\nwatch over her.  Even I, a poor and despised Friar, am able to protect\nher from thy violence—I, sinner as I am, and uncharitably reviled by your\nHighness as an accomplice of I know not what amours, scorn the\nallurements with which it has pleased thee to tempt mine honesty.  I love\nmy order; I honour devout souls; I respect the piety of thy Princess—but\nI will not betray the confidence she reposes in me, nor serve even the\ncause of religion by foul and sinful compliances—but forsooth! the\nwelfare of the state depends on your Highness having a son!  Heaven mocks\nthe short-sighted views of man.  But yester-morn, whose house was so\ngreat, so flourishing as Manfred’s?—where is young Conrad now?—My Lord, I\nrespect your tears—but I mean not to check them—let them flow, Prince!\nThey will weigh more with heaven toward the welfare of thy subjects, than\na marriage, which, founded on lust or policy, could never prosper.  The\nsceptre, which passed from the race of Alfonso to thine, cannot be\npreserved by a match which the church will never allow.  If it is the\nwill of the Most High that Manfred’s name must perish, resign yourself,\nmy Lord, to its decrees; and thus deserve a crown that can never pass\naway.  Come, my Lord; I like this sorrow—let us return to the Princess:\nshe is not apprised of your cruel intentions; nor did I mean more than to\nalarm you.  You saw with what gentle patience, with what efforts of love,\nshe heard, she rejected hearing, the extent of your guilt.  I know she\nlongs to fold you in her arms, and assure you of her unalterable\naffection.”\n\n“Father,” said the Prince, “you mistake my compunction: true, I honour\nHippolita’s virtues; I think her a Saint; and wish it were for my soul’s\nhealth to tie faster the knot that has united us—but alas! Father, you\nknow not the bitterest of my pangs! it is some time that I have had\nscruples on the legality of our union: Hippolita is related to me in the\nfourth degree—it is true, we had a dispensation: but I have been informed\nthat she had also been contracted to another.  This it is that sits heavy\nat my heart: to this state of unlawful wedlock I impute the visitation\nthat has fallen on me in the death of Conrad!—ease my conscience of this\nburden: dissolve our marriage, and accomplish the work of godliness—which\nyour divine exhortations have commenced in my soul.”\n\nHow cutting was the anguish which the good man felt, when he perceived\nthis turn in the wily Prince!  He trembled for Hippolita, whose ruin he\nsaw was determined; and he feared if Manfred had no hope of recovering\nIsabella, that his impatience for a son would direct him to some other\nobject, who might not be equally proof against the temptation of\nManfred’s rank.  For some time the holy man remained absorbed in thought.\nAt length, conceiving some hopes from delay, he thought the wisest\nconduct would be to prevent the Prince from despairing of recovering\nIsabella.  Her the Friar knew he could dispose, from her affection to\nHippolita, and from the aversion she had expressed to him for Manfred’s\naddresses, to second his views, till the censures of the church could be\nfulminated against a divorce.  With this intention, as if struck with the\nPrince’s scruples, he at length said:\n\n“My Lord, I have been pondering on what your Highness has said; and if in\ntruth it is delicacy of conscience that is the real motive of your\nrepugnance to your virtuous Lady, far be it from me to endeavour to\nharden your heart.  The church is an indulgent mother: unfold your griefs\nto her: she alone can administer comfort to your soul, either by\nsatisfying your conscience, or upon examination of your scruples, by\nsetting you at liberty, and indulging you in the lawful means of\ncontinuing your lineage.  In the latter case, if the Lady Isabella can be\nbrought to consent—”\n\nManfred, who concluded that he had either over-reached the good man, or\nthat his first warmth had been but a tribute paid to appearance, was\noverjoyed at this sudden turn, and repeated the most magnificent\npromises, if he should succeed by the Friar’s mediation.  The\nwell-meaning priest suffered him to deceive himself, fully determined to\ntraverse his views, instead of seconding them.\n\n“Since we now understand one another,” resumed the Prince, “I expect,\nFather, that you satisfy me in one point.  Who is the youth that I found\nin the vault?  He must have been privy to Isabella’s flight: tell me\ntruly, is he her lover? or is he an agent for another’s passion?  I have\noften suspected Isabella’s indifference to my son: a thousand\ncircumstances crowd on my mind that confirm that suspicion.  She herself\nwas so conscious of it, that while I discoursed her in the gallery, she\noutran my suspicious, and endeavoured to justify herself from coolness to\nConrad.”\n\nThe Friar, who knew nothing of the youth, but what he had learnt\noccasionally from the Princess, ignorant what was become of him, and not\nsufficiently reflecting on the impetuosity of Manfred’s temper, conceived\nthat it might not be amiss to sow the seeds of jealousy in his mind: they\nmight be turned to some use hereafter, either by prejudicing the Prince\nagainst Isabella, if he persisted in that union or by diverting his\nattention to a wrong scent, and employing his thoughts on a visionary\nintrigue, prevent his engaging in any new pursuit.  With this unhappy\npolicy, he answered in a manner to confirm Manfred in the belief of some\nconnection between Isabella and the youth.  The Prince, whose passions\nwanted little fuel to throw them into a blaze, fell into a rage at the\nidea of what the Friar suggested.\n\n“I will fathom to the bottom of this intrigue,” cried he; and quitting\nJerome abruptly, with a command to remain there till his return, he\nhastened to the great hall of the castle, and ordered the peasant to be\nbrought before him.\n\n“Thou hardened young impostor!” said the Prince, as soon as he saw the\nyouth; “what becomes of thy boasted veracity now? it was Providence, was\nit, and the light of the moon, that discovered the lock of the trap-door\nto thee?  Tell me, audacious boy, who thou art, and how long thou hast\nbeen acquainted with the Princess—and take care to answer with less\nequivocation than thou didst last night, or tortures shall wring the\ntruth from thee.”\n\nThe young man, perceiving that his share in the flight of the Princess\nwas discovered, and concluding that anything he should say could no\nlonger be of any service or detriment to her, replied—\n\n“I am no impostor, my Lord, nor have I deserved opprobrious language.  I\nanswered to every question your Highness put to me last night with the\nsame veracity that I shall speak now: and that will not be from fear of\nyour tortures, but because my soul abhors a falsehood.  Please to repeat\nyour questions, my Lord; I am ready to give you all the satisfaction in\nmy power.”\n\n“You know my questions,” replied the Prince, “and only want time to\nprepare an evasion.  Speak directly; who art thou? and how long hast thou\nbeen known to the Princess?”\n\n“I am a labourer at the next village,” said the peasant; “my name is\nTheodore.  The Princess found me in the vault last night: before that\nhour I never was in her presence.”\n\n“I may believe as much or as little as I please of this,” said Manfred;\n“but I will hear thy own story before I examine into the truth of it.\nTell me, what reason did the Princess give thee for making her escape?\nthy life depends on thy answer.”\n\n“She told me,” replied Theodore, “that she was on the brink of\ndestruction, and that if she could not escape from the castle, she was in\ndanger in a few moments of being made miserable for ever.”\n\n“And on this slight foundation, on a silly girl’s report,” said Manfred,\n“thou didst hazard my displeasure?”\n\n“I fear no man’s displeasure,” said Theodore, “when a woman in distress\nputs herself under my protection.”\n\nDuring this examination, Matilda was going to the apartment of Hippolita.\nAt the upper end of the hall, where Manfred sat, was a boarded gallery\nwith latticed windows, through which Matilda and Bianca were to pass.\nHearing her father’s voice, and seeing the servants assembled round him,\nshe stopped to learn the occasion.  The prisoner soon drew her attention:\nthe steady and composed manner in which he answered, and the gallantry of\nhis last reply, which were the first words she heard distinctly,\ninterested her in his flavour.  His person was noble, handsome, and\ncommanding, even in that situation: but his countenance soon engrossed\nher whole care.\n\n“Heavens!  Bianca,” said the Princess softly, “do I dream? or is not that\nyouth the exact resemblance of Alfonso’s picture in the gallery?”\n\nShe could say no more, for her father’s voice grew louder at every word.\n\n“This bravado,” said he, “surpasses all thy former insolence.  Thou shalt\nexperience the wrath with which thou darest to trifle.  Seize him,”\ncontinued Manfred, “and bind him—the first news the Princess hears of her\nchampion shall be, that he has lost his head for her sake.”\n\n“The injustice of which thou art guilty towards me,” said Theodore,\n“convinces me that I have done a good deed in delivering the Princess\nfrom thy tyranny.  May she be happy, whatever becomes of me!”\n\n“This is a lover!” cried Manfred in a rage: “a peasant within sight of\ndeath is not animated by such sentiments.  Tell me, tell me, rash boy,\nwho thou art, or the rack shall force thy secret from thee.”\n\n“Thou hast threatened me with death already,” said the youth, “for the\ntruth I have told thee: if that is all the encouragement I am to expect\nfor sincerity, I am not tempted to indulge thy vain curiosity farther.”\n\n“Then thou wilt not speak?” said Manfred.\n\n“I will not,” replied he.\n\n“Bear him away into the courtyard,” said Manfred; “I will see his head\nthis instant severed from his body.”\n\nMatilda fainted at hearing those words.  Bianca shrieked, and cried—\n\n“Help! help! the Princess is dead!”  Manfred started at this ejaculation,\nand demanded what was the matter!  The young peasant, who heard it too,\nwas struck with horror, and asked eagerly the same question; but Manfred\nordered him to be hurried into the court, and kept there for execution,\ntill he had informed himself of the cause of Bianca’s shrieks.  When he\nlearned the meaning, he treated it as a womanish panic, and ordering\nMatilda to be carried to her apartment, he rushed into the court, and\ncalling for one of his guards, bade Theodore kneel down, and prepare to\nreceive the fatal blow.\n\nThe undaunted youth received the bitter sentence with a resignation that\ntouched every heart but Manfred’s.  He wished earnestly to know the\nmeaning of the words he had heard relating to the Princess; but fearing\nto exasperate the tyrant more against her, he desisted.  The only boon he\ndeigned to ask was, that he might be permitted to have a confessor, and\nmake his peace with heaven.  Manfred, who hoped by the confessor’s means\nto come at the youth’s history, readily granted his request; and being\nconvinced that Father Jerome was now in his interest, he ordered him to\nbe called and shrive the prisoner.  The holy man, who had little foreseen\nthe catastrophe that his imprudence occasioned, fell on his knees to the\nPrince, and adjured him in the most solemn manner not to shed innocent\nblood.  He accused himself in the bitterest terms for his indiscretion,\nendeavoured to disculpate the youth, and left no method untried to soften\nthe tyrant’s rage.  Manfred, more incensed than appeased by Jerome’s\nintercession, whose retraction now made him suspect he had been imposed\nupon by both, commanded the Friar to do his duty, telling him he would\nnot allow the prisoner many minutes for confession.\n\n“Nor do I ask many, my Lord,” said the unhappy young man.  “My sins,\nthank heaven, have not been numerous; nor exceed what might be expected\nat my years.  Dry your tears, good Father, and let us despatch.  This is\na bad world; nor have I had cause to leave it with regret.”\n\n“Oh wretched youth!” said Jerome; “how canst thou bear the sight of me\nwith patience?  I am thy murderer! it is I have brought this dismal hour\nupon thee!”\n\n“I forgive thee from my soul,” said the youth, “as I hope heaven will\npardon me.  Hear my confession, Father; and give me thy blessing.”\n\n“How can I prepare thee for thy passage as I ought?” said Jerome.  “Thou\ncanst not be saved without pardoning thy foes—and canst thou forgive that\nimpious man there?”\n\n“I can,” said Theodore; “I do.”\n\n“And does not this touch thee, cruel Prince?” said the Friar.\n\n“I sent for thee to confess him,” said Manfred, sternly; “not to plead\nfor him.  Thou didst first incense me against him—his blood be upon thy\nhead!”\n\n“It will! it will!” said the good main, in an agony of sorrow.  “Thou and\nI must never hope to go where this blessed youth is going!”\n\n“Despatch!” said Manfred; “I am no more to be moved by the whining of\npriests than by the shrieks of women.”\n\n“What!” said the youth; “is it possible that my fate could have\noccasioned what I heard!  Is the Princess then again in thy power?”\n\n“Thou dost but remember me of my wrath,” said Manfred.  “Prepare thee,\nfor this moment is thy last.”\n\nThe youth, who felt his indignation rise, and who was touched with the\nsorrow which he saw he had infused into all the spectators, as well as\ninto the Friar, suppressed his emotions, and putting off his doublet, and\nunbuttoning, his collar, knelt down to his prayers.  As he stooped, his\nshirt slipped down below his shoulder, and discovered the mark of a\nbloody arrow.\n\n“Gracious heaven!” cried the holy man, starting; “what do I see?  It is\nmy child! my Theodore!”\n\nThe passions that ensued must be conceived; they cannot be painted.  The\ntears of the assistants were suspended by wonder, rather than stopped by\njoy.  They seemed to inquire in the eyes of their Lord what they ought to\nfeel.  Surprise, doubt, tenderness, respect, succeeded each other in the\ncountenance of the youth.  He received with modest submission the\neffusion of the old man’s tears and embraces.  Yet afraid of giving a\nloose to hope, and suspecting from what had passed the inflexibility of\nManfred’s temper, he cast a glance towards the Prince, as if to say,\ncanst thou be unmoved at such a scene as this?\n\nManfred’s heart was capable of being touched.  He forgot his anger in his\nastonishment; yet his pride forbad his owning himself affected.  He even\ndoubted whether this discovery was not a contrivance of the Friar to save\nthe youth.\n\n“What may this mean?” said he.  “How can he be thy son?  Is it consistent\nwith thy profession or reputed sanctity to avow a peasant’s offspring for\nthe fruit of thy irregular amours!”\n\n“Oh, God!” said the holy man, “dost thou question his being mine?  Could\nI feel the anguish I do if I were not his father?  Spare him! good\nPrince! spare him! and revile me as thou pleasest.”\n\n“Spare him! spare him!” cried the attendants; “for this good man’s sake!”\n\n“Peace!” said Manfred, sternly.  “I must know more ere I am disposed to\npardon.  A Saint’s bastard may be no saint himself.”\n\n“Injurious Lord!” said Theodore, “add not insult to cruelty.  If I am\nthis venerable man’s son, though no Prince, as thou art, know the blood\nthat flows in my veins—”\n\n“Yes,” said the Friar, interrupting him, “his blood is noble; nor is he\nthat abject thing, my Lord, you speak him.  He is my lawful son, and\nSicily can boast of few houses more ancient than that of Falconara.  But\nalas! my Lord, what is blood! what is nobility!  We are all reptiles,\nmiserable, sinful creatures.  It is piety alone that can distinguish us\nfrom the dust whence we sprung, and whither we must return.”\n\n“Truce to your sermon,” said Manfred; “you forget you are no longer Friar\nJerome, but the Count of Falconara.  Let me know your history; you will\nhave time to moralise hereafter, if you should not happen to obtain the\ngrace of that sturdy criminal there.”\n\n“Mother of God!” said the Friar, “is it possible my Lord can refuse a\nfather the life of his only, his long-lost, child!  Trample me, my Lord,\nscorn, afflict me, accept my life for his, but spare my son!”\n\n“Thou canst feel, then,” said Manfred, “what it is to lose an only son!\nA little hour ago thou didst preach up resignation to me: _my_ house, if\nfate so pleased, must perish—but the Count of Falconara—”\n\n“Alas! my Lord,” said Jerome, “I confess I have offended; but aggravate\nnot an old man’s sufferings!  I boast not of my family, nor think of such\nvanities—it is nature, that pleads for this boy; it is the memory of the\ndear woman that bore him.  Is she, Theodore, is she dead?”\n\n“Her soul has long been with the blessed,” said Theodore.\n\n“Oh! how?” cried Jerome, “tell me—no—she is happy!  Thou art all my care\nnow!—Most dread Lord! will you—will you grant me my poor boy’s life?”\n\n“Return to thy convent,” answered Manfred; “conduct the Princess hither;\nobey me in what else thou knowest; and I promise thee the life of thy\nson.”\n\n“Oh! my Lord,” said Jerome, “is my honesty the price I must pay for this\ndear youth’s safety?”\n\n“For me!” cried Theodore.  “Let me die a thousand deaths, rather than\nstain thy conscience.  What is it the tyrant would exact of thee?  Is the\nPrincess still safe from his power?  Protect her, thou venerable old man;\nand let all the weight of his wrath fall on me.”\n\nJerome endeavoured to check the impetuosity of the youth; and ere Manfred\ncould reply, the trampling of horses was heard, and a brazen trumpet,\nwhich hung without the gate of the castle, was suddenly sounded.  At the\nsame instant the sable plumes on the enchanted helmet, which still\nremained at the other end of the court, were tempestuously agitated, and\nnodded thrice, as if bowed by some invisible wearer.\n\n\n\n\nCHAPTER III.\n\n\nManfred’s heart misgave him when he beheld the plumage on the miraculous\ncasque shaken in concert with the sounding of the brazen trumpet.\n\n“Father!” said he to Jerome, whom he now ceased to treat as Count of\nFalconara, “what mean these portents?  If I have offended—” the plumes\nwere shaken with greater violence than before.\n\n“Unhappy Prince that I am,” cried Manfred.  “Holy Father! will you not\nassist me with your prayers?”\n\n“My Lord,” replied Jerome, “heaven is no doubt displeased with your\nmockery of its servants.  Submit yourself to the church; and cease to\npersecute her ministers.  Dismiss this innocent youth; and learn to\nrespect the holy character I wear.  Heaven will not be trifled with: you\nsee—” the trumpet sounded again.\n\n“I acknowledge I have been too hasty,” said Manfred.  “Father, do you go\nto the wicket, and demand who is at the gate.”\n\n“Do you grant me the life of Theodore?” replied the Friar.\n\n“I do,” said Manfred; “but inquire who is without!”\n\nJerome, falling on the neck of his son, discharged a flood of tears, that\nspoke the fulness of his soul.\n\n“You promised to go to the gate,” said Manfred.\n\n“I thought,” replied the Friar, “your Highness would excuse my thanking\nyou first in this tribute of my heart.”\n\n“Go, dearest Sir,” said Theodore; “obey the Prince.  I do not deserve\nthat you should delay his satisfaction for me.”\n\nJerome, inquiring who was without, was answered, “A Herald.”\n\n“From whom?” said he.\n\n“From the Knight of the Gigantic Sabre,” said the Herald; “and I must\nspeak with the usurper of Otranto.”\n\nJerome returned to the Prince, and did not fail to repeat the message in\nthe very words it had been uttered.  The first sounds struck Manfred with\nterror; but when he heard himself styled usurper, his rage rekindled, and\nall his courage revived.\n\n“Usurper!—insolent villain!” cried he; “who dares to question my title?\nRetire, Father; this is no business for Monks: I will meet this\npresumptuous man myself.  Go to your convent and prepare the Princess’s\nreturn.  Your son shall be a hostage for your fidelity: his life depends\non your obedience.”\n\n“Good heaven! my Lord,” cried Jerome, “your Highness did but this instant\nfreely pardon my child—have you so soon forgot the interposition of\nheaven?”\n\n“Heaven,” replied Manfred, “does not send Heralds to question the title\nof a lawful Prince.  I doubt whether it even notifies its will through\nFriars—but that is your affair, not mine.  At present you know my\npleasure; and it is not a saucy Herald that shall save your son, if you\ndo not return with the Princess.”\n\nIt was in vain for the holy man to reply.  Manfred commanded him to be\nconducted to the postern-gate, and shut out from the castle.  And he\nordered some of his attendants to carry Theodore to the top of the black\ntower, and guard him strictly; scarce permitting the father and son to\nexchange a hasty embrace at parting.  He then withdrew to the hall, and\nseating himself in princely state, ordered the Herald to be admitted to\nhis presence.\n\n“Well! thou insolent!” said the Prince, “what wouldst thou with me?”\n\n“I come,” replied he, “to thee, Manfred, usurper of the principality of\nOtranto, from the renowned and invincible Knight, the Knight of the\nGigantic Sabre: in the name of his Lord, Frederic, Marquis of Vicenza, he\ndemands the Lady Isabella, daughter of that Prince, whom thou hast basely\nand traitorously got into thy power, by bribing her false guardians\nduring his absence; and he requires thee to resign the principality of\nOtranto, which thou hast usurped from the said Lord Frederic, the nearest\nof blood to the last rightful Lord, Alfonso the Good.  If thou dost not\ninstantly comply with these just demands, he defies thee to single combat\nto the last extremity.”  And so saying the Herald cast down his warder.\n\n“And where is this braggart who sends thee?” said Manfred.\n\n“At the distance of a league,” said the Herald: “he comes to make good\nhis Lord’s claim against thee, as he is a true knight, and thou an\nusurper and ravisher.”\n\nInjurious as this challenge was, Manfred reflected that it was not his\ninterest to provoke the Marquis.  He knew how well founded the claim of\nFrederic was; nor was this the first time he had heard of it.  Frederic’s\nancestors had assumed the style of Princes of Otranto, from the death of\nAlfonso the Good without issue; but Manfred, his father, and grandfather,\nhad been too powerful for the house of Vicenza to dispossess them.\nFrederic, a martial and amorous young Prince, had married a beautiful\nyoung lady, of whom he was enamoured, and who had died in childbed of\nIsabella.  Her death affected him so much that he had taken the cross and\ngone to the Holy Land, where he was wounded in an engagement against the\ninfidels, made prisoner, and reported to be dead.  When the news reached\nManfred’s ears, he bribed the guardians of the Lady Isabella to deliver\nher up to him as a bride for his son Conrad, by which alliance he had\nproposed to unite the claims of the two houses.  This motive, on Conrad’s\ndeath, had co-operated to make him so suddenly resolve on espousing her\nhimself; and the same reflection determined him now to endeavour at\nobtaining the consent of Frederic to this marriage.  A like policy\ninspired him with the thought of inviting Frederic’s champion into the\ncastle, lest he should be informed of Isabella’s flight, which he\nstrictly enjoined his domestics not to disclose to any of the Knight’s\nretinue.\n\n“Herald,” said Manfred, as soon as he had digested these reflections,\n“return to thy master, and tell him, ere we liquidate our differences by\nthe sword, Manfred would hold some converse with him.  Bid him welcome to\nmy castle, where by my faith, as I am a true Knight, he shall have\ncourteous reception, and full security for himself and followers.  If we\ncannot adjust our quarrel by amicable means, I swear he shall depart in\nsafety, and shall have full satisfaction according to the laws of arms:\nSo help me God and His holy Trinity!”\n\nThe Herald made three obeisances and retired.\n\nDuring this interview Jerome’s mind was agitated by a thousand contrary\npassions.  He trembled for the life of his son, and his first thought was\nto persuade Isabella to return to the castle.  Yet he was scarce less\nalarmed at the thought of her union with Manfred.  He dreaded Hippolita’s\nunbounded submission to the will of her Lord; and though he did not doubt\nbut he could alarm her piety not to consent to a divorce, if he could get\naccess to her; yet should Manfred discover that the obstruction came from\nhim, it might be equally fatal to Theodore.  He was impatient to know\nwhence came the Herald, who with so little management had questioned the\ntitle of Manfred: yet he did not dare absent himself from the convent,\nlest Isabella should leave it, and her flight be imputed to him.  He\nreturned disconsolately to the monastery, uncertain on what conduct to\nresolve.  A Monk, who met him in the porch and observed his melancholy\nair, said—\n\n“Alas! brother, is it then true that we have lost our excellent Princess\nHippolita?”\n\nThe holy man started, and cried, “What meanest thou, brother?  I come\nthis instant from the castle, and left her in perfect health.”\n\n“Martelli,” replied the other Friar, “passed by the convent but a quarter\nof an hour ago on his way from the castle, and reported that her Highness\nwas dead.  All our brethren are gone to the chapel to pray for her happy\ntransit to a better life, and willed me to wait thy arrival.  They know\nthy holy attachment to that good Lady, and are anxious for the affliction\nit will cause in thee—indeed we have all reason to weep; she was a mother\nto our house.  But this life is but a pilgrimage; we must not murmur—we\nshall all follow her!  May our end be like hers!”\n\n“Good brother, thou dreamest,” said Jerome.  “I tell thee I come from the\ncastle, and left the Princess well.  Where is the Lady Isabella?”\n\n“Poor Gentlewoman!” replied the Friar; “I told her the sad news, and\noffered her spiritual comfort.  I reminded her of the transitory\ncondition of mortality, and advised her to take the veil: I quoted the\nexample of the holy Princess Sanchia of Arragon.”\n\n“Thy zeal was laudable,” said Jerome, impatiently; “but at present it was\nunnecessary: Hippolita is well—at least I trust in the Lord she is; I\nheard nothing to the contrary—yet, methinks, the Prince’s\nearnestness—Well, brother, but where is the Lady Isabella?”\n\n“I know not,” said the Friar; “she wept much, and said she would retire\nto her chamber.”\n\nJerome left his comrade abruptly, and hastened to the Princess, but she\nwas not in her chamber.  He inquired of the domestics of the convent, but\ncould learn no news of her.  He searched in vain throughout the monastery\nand the church, and despatched messengers round the neighbourhood, to get\nintelligence if she had been seen; but to no purpose.  Nothing could\nequal the good man’s perplexity.  He judged that Isabella, suspecting\nManfred of having precipitated his wife’s death, had taken the alarm, and\nwithdrawn herself to some more secret place of concealment.  This new\nflight would probably carry the Prince’s fury to the height.  The report\nof Hippolita’s death, though it seemed almost incredible, increased his\nconsternation; and though Isabella’s escape bespoke her aversion of\nManfred for a husband, Jerome could feel no comfort from it, while it\nendangered the life of his son.  He determined to return to the castle,\nand made several of his brethren accompany him to attest his innocence to\nManfred, and, if necessary, join their intercession with his for\nTheodore.\n\nThe Prince, in the meantime, had passed into the court, and ordered the\ngates of the castle to be flung open for the reception of the stranger\nKnight and his train.  In a few minutes the cavalcade arrived.  First\ncame two harbingers with wands.  Next a herald, followed by two pages and\ntwo trumpets.  Then a hundred foot-guards.  These were attended by as\nmany horse.  After them fifty footmen, clothed in scarlet and black, the\ncolours of the Knight.  Then a led horse.  Two heralds on each side of a\ngentleman on horseback bearing a banner with the arms of Vicenza and\nOtranto quarterly—a circumstance that much offended Manfred—but he\nstifled his resentment.  Two more pages.  The Knight’s confessor telling\nhis beads.  Fifty more footmen clad as before.  Two Knights habited in\ncomplete armour, their beavers down, comrades to the principal Knight.\nThe squires of the two Knights, carrying their shields and devices.  The\nKnight’s own squire.  A hundred gentlemen bearing an enormous sword, and\nseeming to faint under the weight of it.  The Knight himself on a\nchestnut steed, in complete armour, his lance in the rest, his face\nentirely concealed by his vizor, which was surmounted by a large plume of\nscarlet and black feathers.  Fifty foot-guards with drums and trumpets\nclosed the procession, which wheeled off to the right and left to make\nroom for the principal Knight.\n\nAs soon as he approached the gate he stopped; and the herald advancing,\nread again the words of the challenge.  Manfred’s eyes were fixed on the\ngigantic sword, and he scarce seemed to attend to the cartel: but his\nattention was soon diverted by a tempest of wind that rose behind him.\nHe turned and beheld the Plumes of the enchanted helmet agitated in the\nsame extraordinary manner as before.  It required intrepidity like\nManfred’s not to sink under a concurrence of circumstances that seemed to\nannounce his fate.  Yet scorning in the presence of strangers to betray\nthe courage he had always manifested, he said boldly—\n\n“Sir Knight, whoever thou art, I bid thee welcome.  If thou art of mortal\nmould, thy valour shall meet its equal: and if thou art a true Knight,\nthou wilt scorn to employ sorcery to carry thy point.  Be these omens\nfrom heaven or hell, Manfred trusts to the righteousness of his cause and\nto the aid of St. Nicholas, who has ever protected his house.  Alight,\nSir Knight, and repose thyself.  To-morrow thou shalt have a fair field,\nand heaven befriend the juster side!”\n\nThe Knight made no reply, but dismounting, was conducted by Manfred to\nthe great hall of the castle.  As they traversed the court, the Knight\nstopped to gaze on the miraculous casque; and kneeling down, seemed to\npray inwardly for some minutes.  Rising, he made a sign to the Prince to\nlead on.  As soon as they entered the hall, Manfred proposed to the\nstranger to disarm, but the Knight shook his head in token of refusal.\n\n“Sir Knight,” said Manfred, “this is not courteous, but by my good faith\nI will not cross thee, nor shalt thou have cause to complain of the\nPrince of Otranto.  No treachery is designed on my part; I hope none is\nintended on thine; here take my gage” (giving him his ring): “your\nfriends and you shall enjoy the laws of hospitality.  Rest here until\nrefreshments are brought.  I will but give orders for the accommodation\nof your train, and return to you.”  The three Knights bowed as accepting\nhis courtesy.  Manfred directed the stranger’s retinue to be conducted to\nan adjacent hospital, founded by the Princess Hippolita for the reception\nof pilgrims.  As they made the circuit of the court to return towards the\ngate, the gigantic sword burst from the supporters, and falling to the\nground opposite to the helmet, remained immovable.  Manfred, almost\nhardened to preternatural appearances, surmounted the shock of this new\nprodigy; and returning to the hall, where by this time the feast was\nready, he invited his silent guests to take their places.  Manfred,\nhowever ill his heart was at ease, endeavoured to inspire the company\nwith mirth.  He put several questions to them, but was answered only by\nsigns.  They raised their vizors but sufficiently to feed themselves, and\nthat sparingly.\n\n“Sirs” said the Prince, “ye are the first guests I ever treated within\nthese walls who scorned to hold any intercourse with me: nor has it oft\nbeen customary, I ween, for princes to hazard their state and dignity\nagainst strangers and mutes.  You say you come in the name of Frederic of\nVicenza; I have ever heard that he was a gallant and courteous Knight;\nnor would he, I am bold to say, think it beneath him to mix in social\nconverse with a Prince that is his equal, and not unknown by deeds in\narms.  Still ye are silent—well! be it as it may—by the laws of\nhospitality and chivalry ye are masters under this roof: ye shall do your\npleasure.  But come, give me a goblet of wine; ye will not refuse to\npledge me to the healths of your fair mistresses.”\n\nThe principal Knight sighed and crossed himself, and was rising from the\nboard.\n\n“Sir Knight,” said Manfred, “what I said was but in sport.  I shall\nconstrain you in nothing: use your good liking.  Since mirth is not your\nmood, let us be sad.  Business may hit your fancies better.  Let us\nwithdraw, and hear if what I have to unfold may be better relished than\nthe vain efforts I have made for your pastime.”\n\nManfred then conducting the three Knights into an inner chamber, shut the\ndoor, and inviting them to be seated, began thus, addressing himself to\nthe chief personage:—\n\n“You come, Sir Knight, as I understand, in the name of the Marquis of\nVicenza, to re-demand the Lady Isabella, his daughter, who has been\ncontracted in the face of Holy Church to my son, by the consent of her\nlegal guardians; and to require me to resign my dominions to your Lord,\nwho gives himself for the nearest of blood to Prince Alfonso, whose soul\nGod rest!  I shall speak to the latter article of your demands first.\nYou must know, your Lord knows, that I enjoy the principality of Otranto\nfrom my father, Don Manuel, as he received it from his father, Don\nRicardo.  Alfonso, their predecessor, dying childless in the Holy Land,\nbequeathed his estates to my grandfather, Don Ricardo, in consideration\nof his faithful services.”  The stranger shook his head.\n\n“Sir Knight,” said Manfred, warmly, “Ricardo was a valiant and upright\nman; he was a pious man; witness his munificent foundation of the\nadjoining church and two convents.  He was peculiarly patronised by St.\nNicholas—my grandfather was incapable—I say, Sir, Don Ricardo was\nincapable—excuse me, your interruption has disordered me.  I venerate the\nmemory of my grandfather.  Well, Sirs, he held this estate; he held it by\nhis good sword and by the favour of St. Nicholas—so did my father; and\nso, Sirs, will I, come what come will.  But Frederic, your Lord, is\nnearest in blood.  I have consented to put my title to the issue of the\nsword.  Does that imply a vicious title?  I might have asked, where is\nFrederic your Lord?  Report speaks him dead in captivity.  You say, your\nactions say, he lives—I question it not—I might, Sirs, I might—but I do\nnot.  Other Princes would bid Frederic take his inheritance by force, if\nhe can: they would not stake their dignity on a single combat: they would\nnot submit it to the decision of unknown mutes!—pardon me, gentlemen, I\nam too warm: but suppose yourselves in my situation: as ye are stout\nKnights, would it not move your choler to have your own and the honour of\nyour ancestors called in question?”\n\n“But to the point.  Ye require me to deliver up the Lady Isabella.  Sirs,\nI must ask if ye are authorised to receive her?”\n\nThe Knight nodded.\n\n“Receive her,” continued Manfred; “well, you are authorised to receive\nher, but, gentle Knight, may I ask if you have full powers?”\n\nThe Knight nodded.\n\n“’Tis well,” said Manfred; “then hear what I have to offer.  Ye see,\ngentlemen, before you, the most unhappy of men!” (he began to weep);\n“afford me your compassion; I am entitled to it, indeed I am.  Know, I\nhave lost my only hope, my joy, the support of my house—Conrad died\nyester morning.”\n\nThe Knights discovered signs of surprise.\n\n“Yes, Sirs, fate has disposed of my son.  Isabella is at liberty.”\n\n“Do you then restore her?” cried the chief Knight, breaking silence.\n\n“Afford me your patience,” said Manfred.  “I rejoice to find, by this\ntestimony of your goodwill, that this matter may be adjusted without\nblood.  It is no interest of mine dictates what little I have farther to\nsay.  Ye behold in me a man disgusted with the world: the loss of my son\nhas weaned me from earthly cares.  Power and greatness have no longer any\ncharms in my eyes.  I wished to transmit the sceptre I had received from\nmy ancestors with honour to my son—but that is over!  Life itself is so\nindifferent to me, that I accepted your defiance with joy.  A good Knight\ncannot go to the grave with more satisfaction than when falling in his\nvocation: whatever is the will of heaven, I submit; for alas! Sirs, I am\na man of many sorrows.  Manfred is no object of envy, but no doubt you\nare acquainted with my story.”\n\nThe Knight made signs of ignorance, and seemed curious to have Manfred\nproceed.\n\n“Is it possible, Sirs,” continued the Prince, “that my story should be a\nsecret to you?  Have you heard nothing relating to me and the Princess\nHippolita?”\n\nThey shook their heads.\n\n“No!  Thus, then, Sirs, it is.  You think me ambitious: ambition, alas!\nis composed of more rugged materials.  If I were ambitious, I should not\nfor so many years have been a prey to all the hell of conscientious\nscruples.  But I weary your patience: I will be brief.  Know, then, that\nI have long been troubled in mind on my union with the Princess\nHippolita.  Oh! Sirs, if ye were acquainted with that excellent woman! if\nye knew that I adore her like a mistress, and cherish her as a friend—but\nman was not born for perfect happiness!  She shares my scruples, and with\nher consent I have brought this matter before the church, for we are\nrelated within the forbidden degrees.  I expect every hour the definitive\nsentence that must separate us for ever—I am sure you feel for me—I see\nyou do—pardon these tears!”\n\nThe Knights gazed on each other, wondering where this would end.\n\nManfred continued—\n\n“The death of my son betiding while my soul was under this anxiety, I\nthought of nothing but resigning my dominions, and retiring for ever from\nthe sight of mankind.  My only difficulty was to fix on a successor, who\nwould be tender of my people, and to dispose of the Lady Isabella, who is\ndear to me as my own blood.  I was willing to restore the line of\nAlfonso, even in his most distant kindred.  And though, pardon me, I am\nsatisfied it was his will that Ricardo’s lineage should take place of his\nown relations; yet where was I to search for those relations?  I knew of\nnone but Frederic, your Lord; he was a captive to the infidels, or dead;\nand were he living, and at home, would he quit the flourishing State of\nVicenza for the inconsiderable principality of Otranto?  If he would not,\ncould I bear the thought of seeing a hard, unfeeling, Viceroy set over my\npoor faithful people? for, Sirs, I love my people, and thank heaven am\nbeloved by them.  But ye will ask whither tends this long discourse?\nBriefly, then, thus, Sirs.  Heaven in your arrival seems to point out a\nremedy for these difficulties and my misfortunes.  The Lady Isabella is\nat liberty; I shall soon be so.  I would submit to anything for the good\nof my people.  Were it not the best, the only way to extinguish the feuds\nbetween our families, if I was to take the Lady Isabella to wife?  You\nstart.  But though Hippolita’s virtues will ever be dear to me, a Prince\nmust not consider himself; he is born for his people.”  A servant at that\ninstant entering the chamber apprised Manfred that Jerome and several of\nhis brethren demanded immediate access to him.\n\nThe Prince, provoked at this interruption, and fearing that the Friar\nwould discover to the strangers that Isabella had taken sanctuary, was\ngoing to forbid Jerome’s entrance.  But recollecting that he was\ncertainly arrived to notify the Princess’s return, Manfred began to\nexcuse himself to the Knights for leaving them for a few moments, but was\nprevented by the arrival of the Friars.  Manfred angrily reprimanded them\nfor their intrusion, and would have forced them back from the chamber;\nbut Jerome was too much agitated to be repulsed.  He declared aloud the\nflight of Isabella, with protestations of his own innocence.\n\nManfred, distracted at the news, and not less at its coming to the\nknowledge of the strangers, uttered nothing but incoherent sentences, now\nupbraiding the Friar, now apologising to the Knights, earnest to know\nwhat was become of Isabella, yet equally afraid of their knowing;\nimpatient to pursue her, yet dreading to have them join in the pursuit.\nHe offered to despatch messengers in quest of her, but the chief Knight,\nno longer keeping silence, reproached Manfred in bitter terms for his\ndark and ambiguous dealing, and demanded the cause of Isabella’s first\nabsence from the castle.  Manfred, casting a stern look at Jerome,\nimplying a command of silence, pretended that on Conrad’s death he had\nplaced her in sanctuary until he could determine how to dispose of her.\nJerome, who trembled for his son’s life, did not dare contradict this\nfalsehood, but one of his brethren, not under the same anxiety, declared\nfrankly that she had fled to their church in the preceding night.  The\nPrince in vain endeavoured to stop this discovery, which overwhelmed him\nwith shame and confusion.  The principal stranger, amazed at the\ncontradictions he heard, and more than half persuaded that Manfred had\nsecreted the Princess, notwithstanding the concern he expressed at her\nflight, rushing to the door, said—\n\n“Thou traitor Prince!  Isabella shall be found.”\n\nManfred endeavoured to hold him, but the other Knights assisting their\ncomrade, he broke from the Prince, and hastened into the court, demanding\nhis attendants.  Manfred, finding it vain to divert him from the pursuit,\noffered to accompany him and summoning his attendants, and taking Jerome\nand some of the Friars to guide them, they issued from the castle;\nManfred privately giving orders to have the Knight’s company secured,\nwhile to the knight he affected to despatch a messenger to require their\nassistance.\n\nThe company had no sooner quitted the castle than Matilda, who felt\nherself deeply interested for the young peasant, since she had seen him\ncondemned to death in the hall, and whose thoughts had been taken up with\nconcerting measures to save him, was informed by some of the female\nattendants that Manfred had despatched all his men various ways in\npursuit of Isabella.  He had in his hurry given this order in general\nterms, not meaning to extend it to the guard he had set upon Theodore,\nbut forgetting it.  The domestics, officious to obey so peremptory a\nPrince, and urged by their own curiosity and love of novelty to join in\nany precipitate chase, had to a man left the castle.  Matilda disengaged\nherself from her women, stole up to the black tower, and unbolting the\ndoor, presented herself to the astonished Theodore.\n\n“Young man,” said she, “though filial duty and womanly modesty condemn\nthe step I am taking, yet holy charity, surmounting all other ties,\njustifies this act.  Fly; the doors of thy prison are open: my father and\nhis domestics are absent; but they may soon return.  Be gone in safety;\nand may the angels of heaven direct thy course!”\n\n“Thou art surely one of those angels!” said the enraptured Theodore:\n“none but a blessed saint could speak, could act—could look—like thee.\nMay I not know the name of my divine protectress?  Methought thou namedst\nthy father.  Is it possible?  Can Manfred’s blood feel holy pity!  Lovely\nLady, thou answerest not.  But how art thou here thyself?  Why dost thou\nneglect thy own safety, and waste a thought on a wretch like Theodore?\nLet us fly together: the life thou bestowest shall be dedicated to thy\ndefence.”\n\n“Alas! thou mistakest,” said Matilda, signing: “I am Manfred’s daughter,\nbut no dangers await me.”\n\n“Amazement!” said Theodore; “but last night I blessed myself for yielding\nthee the service thy gracious compassion so charitably returns me now.”\n\n“Still thou art in an error,” said the Princess; “but this is no time for\nexplanation.  Fly, virtuous youth, while it is in my power to save thee:\nshould my father return, thou and I both should indeed have cause to\ntremble.”\n\n“How!” said Theodore; “thinkest thou, charming maid, that I will accept\nof life at the hazard of aught calamitous to thee?  Better I endured a\nthousand deaths.”\n\n“I run no risk,” said Matilda, “but by thy delay.  Depart; it cannot be\nknown that I have assisted thy flight.”\n\n“Swear by the saints above,” said Theodore, “that thou canst not be\nsuspected; else here I vow to await whatever can befall me.”\n\n“Oh! thou art too generous,” said Matilda; “but rest assured that no\nsuspicion can alight on me.”\n\n“Give me thy beauteous hand in token that thou dost not deceive me,” said\nTheodore; “and let me bathe it with the warm tears of gratitude.”\n\n“Forbear!” said the Princess; “this must not be.”\n\n“Alas!” said Theodore, “I have never known but calamity until this\nhour—perhaps shall never know other fortune again: suffer the chaste\nraptures of holy gratitude: ’tis my soul would print its effusions on thy\nhand.”\n\n“Forbear, and be gone,” said Matilda.  “How would Isabella approve of\nseeing thee at my feet?”\n\n“Who is Isabella?” said the young man with surprise.\n\n“Ah, me!  I fear,” said the Princess, “I am serving a deceitful one.\nHast thou forgot thy curiosity this morning?”\n\n“Thy looks, thy actions, all thy beauteous self seem an emanation of\ndivinity,” said Theodore; “but thy words are dark and mysterious.  Speak,\nLady; speak to thy servant’s comprehension.”\n\n“Thou understandest but too well!” said Matilda; “but once more I command\nthee to be gone: thy blood, which I may preserve, will be on my head, if\nI waste the time in vain discourse.”\n\n“I go, Lady,” said Theodore, “because it is thy will, and because I would\nnot bring the grey hairs of my father with sorrow to the grave.  Say but,\nadored Lady, that I have thy gentle pity.”\n\n“Stay,” said Matilda; “I will conduct thee to the subterraneous vault by\nwhich Isabella escaped; it will lead thee to the church of St. Nicholas,\nwhere thou mayst take sanctuary.”\n\n“What!” said Theodore, “was it another, and not thy lovely self that I\nassisted to find the subterraneous passage?”\n\n“It was,” said Matilda; “but ask no more; I tremble to see thee still\nabide here; fly to the sanctuary.”\n\n“To sanctuary,” said Theodore; “no, Princess; sanctuaries are for\nhelpless damsels, or for criminals.  Theodore’s soul is free from guilt,\nnor will wear the appearance of it.  Give me a sword, Lady, and thy\nfather shall learn that Theodore scorns an ignominious flight.”\n\n“Rash youth!” said Matilda; “thou wouldst not dare to lift thy\npresumptuous arm against the Prince of Otranto?”\n\n“Not against thy father; indeed, I dare not,” said Theodore.  “Excuse me,\nLady; I had forgotten.  But could I gaze on thee, and remember thou art\nsprung from the tyrant Manfred!  But he is thy father, and from this\nmoment my injuries are buried in oblivion.”\n\nA deep and hollow groan, which seemed to come from above, startled the\nPrincess and Theodore.\n\n“Good heaven! we are overheard!” said the Princess.  They listened; but\nperceiving no further noise, they both concluded it the effect of pent-up\nvapours.  And the Princess, preceding Theodore softly, carried him to her\nfather’s armoury, where, equipping him with a complete suit, he was\nconducted by Matilda to the postern-gate.\n\n“Avoid the town,” said the Princess, “and all the western side of the\ncastle.  ’Tis there the search must be making by Manfred and the\nstrangers; but hie thee to the opposite quarter.  Yonder behind that\nforest to the east is a chain of rocks, hollowed into a labyrinth of\ncaverns that reach to the sea coast.  There thou mayst lie concealed,\ntill thou canst make signs to some vessel to put on shore, and take thee\noff.  Go! heaven be thy guide!—and sometimes in thy prayers\nremember—Matilda!”\n\nTheodore flung himself at her feet, and seizing her lily hand, which with\nstruggles she suffered him to kiss, he vowed on the earliest opportunity\nto get himself knighted, and fervently entreated her permission to swear\nhimself eternally her knight.  Ere the Princess could reply, a clap of\nthunder was suddenly heard that shook the battlements.  Theodore,\nregardless of the tempest, would have urged his suit: but the Princess,\ndismayed, retreated hastily into the castle, and commanded the youth to\nbe gone with an air that would not be disobeyed.  He sighed, and retired,\nbut with eyes fixed on the gate, until Matilda, closing it, put an end to\nan interview, in which the hearts of both had drunk so deeply of a\npassion, which both now tasted for the first time.\n\nTheodore went pensively to the convent, to acquaint his father with his\ndeliverance.  There he learned the absence of Jerome, and the pursuit\nthat was making after the Lady Isabella, with some particulars of whose\nstory he now first became acquainted.  The generous gallantry of his\nnature prompted him to wish to assist her; but the Monks could lend him\nno lights to guess at the route she had taken.  He was not tempted to\nwander far in search of her, for the idea of Matilda had imprinted itself\nso strongly on his heart, that he could not bear to absent himself at\nmuch distance from her abode.  The tenderness Jerome had expressed for\nhim concurred to confirm this reluctance; and he even persuaded himself\nthat filial affection was the chief cause of his hovering between the\ncastle and monastery.\n\nUntil Jerome should return at night, Theodore at length determined to\nrepair to the forest that Matilda had pointed out to him.  Arriving\nthere, he sought the gloomiest shades, as best suited to the pleasing\nmelancholy that reigned in his mind.  In this mood he roved insensibly to\nthe caves which had formerly served as a retreat to hermits, and were now\nreported round the country to be haunted by evil spirits.  He recollected\nto have heard this tradition; and being of a brave and adventurous\ndisposition, he willingly indulged his curiosity in exploring the secret\nrecesses of this labyrinth.  He had not penetrated far before he thought\nhe heard the steps of some person who seemed to retreat before him.\n\nTheodore, though firmly grounded in all our holy faith enjoins to be\nbelieved, had no apprehension that good men were abandoned without cause\nto the malice of the powers of darkness.  He thought the place more\nlikely to be infested by robbers than by those infernal agents who are\nreported to molest and bewilder travellers.  He had long burned with\nimpatience to approve his valour.  Drawing his sabre, he marched sedately\nonwards, still directing his steps as the imperfect rustling sound before\nhim led the way.  The armour he wore was a like indication to the person\nwho avoided him.  Theodore, now convinced that he was not mistaken,\nredoubled his pace, and evidently gained on the person that fled, whose\nhaste increasing, Theodore came up just as a woman fell breathless before\nhim.  He hasted to raise her, but her terror was so great that he\napprehended she would faint in his arms.  He used every gentle word to\ndispel her alarms, and assured her that far from injuring, he would\ndefend her at the peril of his life.  The Lady recovering her spirits\nfrom his courteous demeanour, and gazing on her protector, said—\n\n“Sure, I have heard that voice before!”\n\n“Not to my knowledge,” replied Theodore; “unless, as I conjecture, thou\nart the Lady Isabella.”\n\n“Merciful heaven!” cried she.  “Thou art not sent in quest of me, art\nthou?”  And saying those words, she threw herself at his feet, and\nbesought him not to deliver her up to Manfred.\n\n“To Manfred!” cried Theodore—“no, Lady; I have once already delivered\nthee from his tyranny, and it shall fare hard with me now, but I will\nplace thee out of the reach of his daring.”\n\n“Is it possible,” said she, “that thou shouldst be the generous unknown\nwhom I met last night in the vault of the castle?  Sure thou art not a\nmortal, but my guardian angel.  On my knees, let me thank—”\n\n“Hold! gentle Princess,” said Theodore, “nor demean thyself before a poor\nand friendless young man.  If heaven has selected me for thy deliverer,\nit will accomplish its work, and strengthen my arm in thy cause.  But\ncome, Lady, we are too near the mouth of the cavern; let us seek its\ninmost recesses.  I can have no tranquillity till I have placed thee\nbeyond the reach of danger.”\n\n“Alas! what mean you, sir?” said she.  “Though all your actions are\nnoble, though your sentiments speak the purity of your soul, is it\nfitting that I should accompany you alone into these perplexed retreats?\nShould we be found together, what would a censorious world think of my\nconduct?”\n\n“I respect your virtuous delicacy,” said Theodore; “nor do you harbour a\nsuspicion that wounds my honour.  I meant to conduct you into the most\nprivate cavity of these rocks, and then at the hazard of my life to guard\ntheir entrance against every living thing.  Besides, Lady,” continued he,\ndrawing a deep sigh, “beauteous and all perfect as your form is, and\nthough my wishes are not guiltless of aspiring, know, my soul is\ndedicated to another; and although—”  A sudden noise prevented Theodore\nfrom proceeding.  They soon distinguished these sounds—\n\n“Isabella! what, ho! Isabella!”  The trembling Princess relapsed into her\nformer agony of fear.  Theodore endeavoured to encourage her, but in\nvain.  He assured her he would die rather than suffer her to return under\nManfred’s power; and begging her to remain concealed, he went forth to\nprevent the person in search of her from approaching.\n\nAt the mouth of the cavern he found an armed Knight, discoursing with a\npeasant, who assured him he had seen a lady enter the passes of the rock.\nThe Knight was preparing to seek her, when Theodore, placing himself in\nhis way, with his sword drawn, sternly forbad him at his peril to\nadvance.\n\n“And who art thou, who darest to cross my way?” said the Knight,\nhaughtily.\n\n“One who does not dare more than he will perform,” said Theodore.\n\n“I seek the Lady Isabella,” said the Knight, “and understand she has\ntaken refuge among these rocks.  Impede me not, or thou wilt repent\nhaving provoked my resentment.”\n\n“Thy purpose is as odious as thy resentment is contemptible,” said\nTheodore.  “Return whence thou camest, or we shall soon know whose\nresentment is most terrible.”\n\nThe stranger, who was the principal Knight that had arrived from the\nMarquis of Vicenza, had galloped from Manfred as he was busied in getting\ninformation of the Princess, and giving various orders to prevent her\nfalling into the power of the three Knights.  Their chief had suspected\nManfred of being privy to the Princess’s absconding, and this insult from\na man, who he concluded was stationed by that Prince to secrete her,\nconfirming his suspicions, he made no reply, but discharging a blow with\nhis sabre at Theodore, would soon have removed all obstruction, if\nTheodore, who took him for one of Manfred’s captains, and who had no\nsooner given the provocation than prepared to support it, had not\nreceived the stroke on his shield.  The valour that had so long been\nsmothered in his breast broke forth at once; he rushed impetuously on the\nKnight, whose pride and wrath were not less powerful incentives to hardy\ndeeds.  The combat was furious, but not long.  Theodore wounded the\nKnight in three several places, and at last disarmed him as he fainted by\nthe loss of blood.\n\nThe peasant, who had fled on the first onset, had given the alarm to some\nof Manfred’s domestics, who, by his orders, were dispersed through the\nforest in pursuit of Isabella.  They came up as the Knight fell, whom\nthey soon discovered to be the noble stranger.  Theodore, notwithstanding\nhis hatred to Manfred, could not behold the victory he had gained without\nemotions of pity and generosity.  But he was more touched when he learned\nthe quality of his adversary, and was informed that he was no retainer,\nbut an enemy, of Manfred.  He assisted the servants of the latter in\ndisarming the Knight, and in endeavouring to stanch the blood that flowed\nfrom his wounds.  The Knight recovering his speech, said, in a faint and\nfaltering voice—\n\n“Generous foe, we have both been in an error.  I took thee for an\ninstrument of the tyrant; I perceive thou hast made the like mistake.  It\nis too late for excuses.  I faint.  If Isabella is at hand—call her—I\nhave important secrets to—”\n\n“He is dying!” said one of the attendants; “has nobody a crucifix about\nthem?  Andrea, do thou pray over him.”\n\n“Fetch some water,” said Theodore, “and pour it down his throat, while I\nhasten to the Princess.”\n\nSaying this, he flew to Isabella, and in few words told her modestly that\nhe had been so unfortunate by mistake as to wound a gentleman from her\nfather’s court, who wished, ere he died, to impart something of\nconsequence to her.\n\nThe Princess, who had been transported at hearing the voice of Theodore,\nas he called to her to come forth, was astonished at what she heard.\nSuffering herself to be conducted by Theodore, the new proof of whose\nvalour recalled her dispersed spirits, she came where the bleeding Knight\nlay speechless on the ground.  But her fears returned when she beheld the\ndomestics of Manfred.  She would again have fled if Theodore had not made\nher observe that they were unarmed, and had not threatened them with\ninstant death if they should dare to seize the Princess.\n\nThe stranger, opening his eyes, and beholding a woman, said, “Art\nthou—pray tell me truly—art thou Isabella of Vicenza?”\n\n“I am,” said she: “good heaven restore thee!”\n\n“Then thou—then thou”—said the Knight, struggling for\nutterance—“seest—thy father.  Give me one—”\n\n“Oh! amazement! horror! what do I hear! what do I see!” cried Isabella.\n“My father!  You my father!  How came you here, Sir?  For heaven’s sake,\nspeak!  Oh! run for help, or he will expire!”\n\n“’Tis most true,” said the wounded Knight, exerting all his force; “I am\nFrederic thy father.  Yes, I came to deliver thee.  It will not be.  Give\nme a parting kiss, and take—”\n\n“Sir,” said Theodore, “do not exhaust yourself; suffer us to convey you\nto the castle.”\n\n“To the castle!” said Isabella.  “Is there no help nearer than the\ncastle?  Would you expose my father to the tyrant?  If he goes thither, I\ndare not accompany him; and yet, can I leave him!”\n\n“My child,” said Frederic, “it matters not for me whither I am carried.\nA few minutes will place me beyond danger; but while I have eyes to dote\non thee, forsake me not, dear Isabella!  This brave Knight—I know not who\nhe is—will protect thy innocence.  Sir, you will not abandon my child,\nwill you?”\n\nTheodore, shedding tears over his victim, and vowing to guard the\nPrincess at the expense of his life, persuaded Frederic to suffer himself\nto be conducted to the castle.  They placed him on a horse belonging to\none of the domestics, after binding up his wounds as well as they were\nable.  Theodore marched by his side; and the afflicted Isabella, who\ncould not bear to quit him, followed mournfully behind.\n\n\n\n\nCHAPTER IV.\n\n\nThe sorrowful troop no sooner arrived at the castle, than they were met\nby Hippolita and Matilda, whom Isabella had sent one of the domestics\nbefore to advertise of their approach.  The ladies causing Frederic to be\nconveyed into the nearest chamber, retired, while the surgeons examined\nhis wounds.  Matilda blushed at seeing Theodore and Isabella together;\nbut endeavoured to conceal it by embracing the latter, and condoling with\nher on her father’s mischance.  The surgeons soon came to acquaint\nHippolita that none of the Marquis’s wounds were dangerous; and that he\nwas desirous of seeing his daughter and the Princesses.\n\nTheodore, under pretence of expressing his joy at being freed from his\napprehensions of the combat being fatal to Frederic, could not resist the\nimpulse of following Matilda.  Her eyes were so often cast down on\nmeeting his, that Isabella, who regarded Theodore as attentively as he\ngazed on Matilda, soon divined who the object was that he had told her in\nthe cave engaged his affections.  While this mute scene passed, Hippolita\ndemanded of Frederic the cause of his having taken that mysterious course\nfor reclaiming his daughter; and threw in various apologies to excuse her\nLord for the match contracted between their children.\n\nFrederic, however incensed against Manfred, was not insensible to the\ncourtesy and benevolence of Hippolita: but he was still more struck with\nthe lovely form of Matilda.  Wishing to detain them by his bedside, he\ninformed Hippolita of his story.  He told her that, while prisoner to the\ninfidels, he had dreamed that his daughter, of whom he had learned no\nnews since his captivity, was detained in a castle, where she was in\ndanger of the most dreadful misfortunes: and that if he obtained his\nliberty, and repaired to a wood near Joppa, he would learn more.  Alarmed\nat this dream, and incapable of obeying the direction given by it, his\nchains became more grievous than ever.  But while his thoughts were\noccupied on the means of obtaining his liberty, he received the agreeable\nnews that the confederate Princes who were warring in Palestine had paid\nhis ransom.  He instantly set out for the wood that had been marked in\nhis dream.\n\nFor three days he and his attendants had wandered in the forest without\nseeing a human form: but on the evening of the third they came to a cell,\nin which they found a venerable hermit in the agonies of death.  Applying\nrich cordials, they brought the fainting man to his speech.\n\n“My sons,” said he, “I am bounden to your charity—but it is in vain—I am\ngoing to my eternal rest—yet I die with the satisfaction of performing\nthe will of heaven.  When first I repaired to this solitude, after seeing\nmy country become a prey to unbelievers—it is alas! above fifty years\nsince I was witness to that dreadful scene!  St. Nicholas appeared to me,\nand revealed a secret, which he bade me never disclose to mortal man, but\non my death-bed.  This is that tremendous hour, and ye are no doubt the\nchosen warriors to whom I was ordered to reveal my trust.  As soon as ye\nhave done the last offices to this wretched corse, dig under the seventh\ntree on the left hand of this poor cave, and your pains will—Oh! good\nheaven receive my soul!”  With those words the devout man breathed his\nlast.\n\n“By break of day,” continued Frederic, “when we had committed the holy\nrelics to earth, we dug according to direction.  But what was our\nastonishment when about the depth of six feet we discovered an enormous\nsabre—the very weapon yonder in the court.  On the blade, which was then\npartly out of the scabbard, though since closed by our efforts in\nremoving it, were written the following lines—no; excuse me, Madam,”\nadded the Marquis, turning to Hippolita; “if I forbear to repeat them: I\nrespect your sex and rank, and would not be guilty of offending your ear\nwith sounds injurious to aught that is dear to you.”\n\nHe paused.  Hippolita trembled.  She did not doubt but Frederic was\ndestined by heaven to accomplish the fate that seemed to threaten her\nhouse.  Looking with anxious fondness at Matilda, a silent tear stole\ndown her cheek: but recollecting herself, she said—\n\n“Proceed, my Lord; heaven does nothing in vain; mortals must receive its\ndivine behests with lowliness and submission.  It is our part to\ndeprecate its wrath, or bow to its decrees.  Repeat the sentence, my\nLord; we listen resigned.”\n\nFrederic was grieved that he had proceeded so far.  The dignity and\npatient firmness of Hippolita penetrated him with respect, and the tender\nsilent affection with which the Princess and her daughter regarded each\nother, melted him almost to tears.  Yet apprehensive that his forbearance\nto obey would be more alarming, he repeated in a faltering and low voice\nthe following lines:\n\n    “Where’er a casque that suits this sword is found,\n    With perils is thy daughter compass’d round;\n    _Alfonso’s_ blood alone can save the maid,\n    And quiet a long restless Prince’s shade.”\n\n“What is there in these lines,” said Theodore impatiently, “that affects\nthese Princesses?  Why were they to be shocked by a mysterious delicacy,\nthat has so little foundation?”\n\n“Your words are rude, young man,” said the Marquis; “and though fortune\nhas favoured you once—”\n\n“My honoured Lord,” said Isabella, who resented Theodore’s warmth, which\nshe perceived was dictated by his sentiments for Matilda, “discompose not\nyourself for the glosing of a peasant’s son: he forgets the reverence he\nowes you; but he is not accustomed—”\n\nHippolita, concerned at the heat that had arisen, checked Theodore for\nhis boldness, but with an air acknowledging his zeal; and changing the\nconversation, demanded of Frederic where he had left her Lord?  As the\nMarquis was going to reply, they heard a noise without, and rising to\ninquire the cause, Manfred, Jerome, and part of the troop, who had met an\nimperfect rumour of what had happened, entered the chamber.  Manfred\nadvanced hastily towards Frederic’s bed to condole with him on his\nmisfortune, and to learn the circumstances of the combat, when starting\nin an agony of terror and amazement, he cried—\n\n“Ha! what art thou? thou dreadful spectre! is my hour come?”\n\n“My dearest, gracious Lord,” cried Hippolita, clasping him in her arms,\n“what is it you see!  Why do you fix your eye-balls thus?”\n\n“What!” cried Manfred breathless; “dost thou see nothing, Hippolita?  Is\nthis ghastly phantom sent to me alone—to rue, who did not—”\n\n“For mercy’s sweetest self, my Lord,” said Hippolita, “resume your soul,\ncommand your reason.  There is none here, but us, your friends.”\n\n“What, is not that Alfonso?” cried Manfred.  “Dost thou not see him? can\nit be my brain’s delirium?”\n\n“This! my Lord,” said Hippolita; “this is Theodore, the youth who has\nbeen so unfortunate.”\n\n“Theodore!” said Manfred mournfully, and striking his forehead; “Theodore\nor a phantom, he has unhinged the soul of Manfred.  But how comes he\nhere? and how comes he in armour?”\n\n“I believe he went in search of Isabella,” said Hippolita.\n\n“Of Isabella!” said Manfred, relapsing into rage; “yes, yes, that is not\ndoubtful—.  But how did he escape from durance in which I left him?  Was\nit Isabella, or this hypocritical old Friar, that procured his\nenlargement?”\n\n“And would a parent be criminal, my Lord,” said Theodore, “if he\nmeditated the deliverance of his child?”\n\nJerome, amazed to hear himself in a manner accused by his son, and\nwithout foundation, knew not what to think.  He could not comprehend how\nTheodore had escaped, how he came to be armed, and to encounter Frederic.\nStill he would not venture to ask any questions that might tend to\ninflame Manfred’s wrath against his son.  Jerome’s silence convinced\nManfred that he had contrived Theodore’s release.\n\n“And is it thus, thou ungrateful old man,” said the Prince, addressing\nhimself to the Friar, “that thou repayest mine and Hippolita’s bounties?\nAnd not content with traversing my heart’s nearest wishes, thou armest\nthy bastard, and bringest him into my own castle to insult me!”\n\n“My Lord,” said Theodore, “you wrong my father: neither he nor I are\ncapable of harbouring a thought against your peace.  Is it insolence thus\nto surrender myself to your Highness’s pleasure?” added he, laying his\nsword respectfully at Manfred’s feet.  “Behold my bosom; strike, my Lord,\nif you suspect that a disloyal thought is lodged there.  There is not a\nsentiment engraven on my heart that does not venerate you and yours.”\n\nThe grace and fervour with which Theodore uttered these words interested\nevery person present in his favour.  Even Manfred was touched—yet still\npossessed with his resemblance to Alfonso, his admiration was dashed with\nsecret horror.\n\n“Rise,” said he; “thy life is not my present purpose.  But tell me thy\nhistory, and how thou camest connected with this old traitor here.”\n\n“My Lord,” said Jerome eagerly.\n\n“Peace! impostor!” said Manfred; “I will not have him prompted.”\n\n“My Lord,” said Theodore, “I want no assistance; my story is very brief.\nI was carried at five years of age to Algiers with my mother, who had\nbeen taken by corsairs from the coast of Sicily.  She died of grief in\nless than a twelvemonth;” the tears gushed from Jerome’s eyes, on whose\ncountenance a thousand anxious passions stood expressed.  “Before she\ndied,” continued Theodore, “she bound a writing about my arm under my\ngarments, which told me I was the son of the Count Falconara.”\n\n“It is most true,” said Jerome; “I am that wretched father.”\n\n“Again I enjoin thee silence,” said Manfred: “proceed.”\n\n“I remained in slavery,” said Theodore, “until within these two years,\nwhen attending on my master in his cruises, I was delivered by a\nChristian vessel, which overpowered the pirate; and discovering myself to\nthe captain, he generously put me on shore in Sicily; but alas! instead\nof finding a father, I learned that his estate, which was situated on the\ncoast, had, during his absence, been laid waste by the Rover who had\ncarried my mother and me into captivity: that his castle had been burnt\nto the ground, and that my father on his return had sold what remained,\nand was retired into religion in the kingdom of Naples, but where no man\ncould inform me.  Destitute and friendless, hopeless almost of attaining\nthe transport of a parent’s embrace, I took the first opportunity of\nsetting sail for Naples, from whence, within these six days, I wandered\ninto this province, still supporting myself by the labour of my hands;\nnor until yester-morn did I believe that heaven had reserved any lot for\nme but peace of mind and contented poverty.  This, my Lord, is Theodore’s\nstory.  I am blessed beyond my hope in finding a father; I am unfortunate\nbeyond my desert in having incurred your Highness’s displeasure.”\n\nHe ceased.  A murmur of approbation gently arose from the audience.\n\n“This is not all,” said Frederic; “I am bound in honour to add what he\nsuppresses.  Though he is modest, I must be generous; he is one of the\nbravest youths on Christian ground.  He is warm too; and from the short\nknowledge I have of him, I will pledge myself for his veracity: if what\nhe reports of himself were not true, he would not utter it—and for me,\nyouth, I honour a frankness which becomes thy birth; but now, and thou\ndidst offend me: yet the noble blood which flows in thy veins, may well\nbe allowed to boil out, when it has so recently traced itself to its\nsource.  Come, my Lord,” (turning to Manfred), “if I can pardon him,\nsurely you may; it is not the youth’s fault, if you took him for a\nspectre.”\n\nThis bitter taunt galled the soul of Manfred.\n\n“If beings from another world,” replied he haughtily, “have power to\nimpress my mind with awe, it is more than living man can do; nor could a\nstripling’s arm.”\n\n“My Lord,” interrupted Hippolita, “your guest has occasion for repose:\nshall we not leave him to his rest?”  Saying this, and taking Manfred by\nthe hand, she took leave of Frederic, and led the company forth.\n\nThe Prince, not sorry to quit a conversation which recalled to mind the\ndiscovery he had made of his most secret sensations, suffered himself to\nbe conducted to his own apartment, after permitting Theodore, though\nunder engagement to return to the castle on the morrow (a condition the\nyoung man gladly accepted), to retire with his father to the convent.\nMatilda and Isabella were too much occupied with their own reflections,\nand too little content with each other, to wish for farther converse that\nnight.  They separated each to her chamber, with more expressions of\nceremony and fewer of affection thou had passed between them since their\nchildhood.\n\nIf they parted with small cordiality, they did but meet with greater\nimpatience, as soon as the sun was risen.  Their minds were in a\nsituation that excluded sleep, and each recollected a thousand questions\nwhich she wished she had put to the other overnight.  Matilda reflected\nthat Isabella had been twice delivered by Theodore in very critical\nsituations, which she could not believe accidental.  His eyes, it was\ntrue, had been fixed on her in Frederic’s chamber; but that might have\nbeen to disguise his passion for Isabella from the fathers of both.  It\nwere better to clear this up.  She wished to know the truth, lest she\nshould wrong her friend by entertaining a passion for Isabella’s lover.\nThus jealousy prompted, and at the same time borrowed an excuse from\nfriendship to justify its curiosity.\n\nIsabella, not less restless, had better foundation for her suspicions.\nBoth Theodore’s tongue and eyes had told her his heart was engaged; it\nwas true—yet, perhaps, Matilda might not correspond to his passion; she\nhad ever appeared insensible to love: all her thoughts were set on\nheaven.\n\n“Why did I dissuade her?” said Isabella to herself; “I am punished for my\ngenerosity; but when did they meet? where?  It cannot be; I have deceived\nmyself; perhaps last night was the first time they ever beheld each\nother; it must be some other object that has prepossessed his\naffections—if it is, I am not so unhappy as I thought; if it is not my\nfriend Matilda—how!  Can I stoop to wish for the affection of a man, who\nrudely and unnecessarily acquainted me with his indifference? and that at\nthe very moment in which common courtesy demanded at least expressions of\ncivility.  I will go to my dear Matilda, who will confirm me in this\nbecoming pride.  Man is false—I will advise with her on taking the veil:\nshe will rejoice to find me in this disposition; and I will acquaint her\nthat I no longer oppose her inclination for the cloister.”\n\nIn this frame of mind, and determined to open her heart entirely to\nMatilda, she went to that Princess’s chamber, whom she found already\ndressed, and leaning pensively on her arm.  This attitude, so\ncorrespondent to what she felt herself, revived Isabella’s suspicions,\nand destroyed the confidence she had purposed to place in her friend.\nThey blushed at meeting, and were too much novices to disguise their\nsensations with address.  After some unmeaning questions and replies,\nMatilda demanded of Isabella the cause of her flight?  The latter, who\nhad almost forgotten Manfred’s passion, so entirely was she occupied by\nher own, concluding that Matilda referred to her last escape from the\nconvent, which had occasioned the events of the preceding evening,\nreplied—\n\n“Martelli brought word to the convent that your mother was dead.”\n\n“Oh!” said Matilda, interrupting her, “Bianca has explained that mistake\nto me: on seeing me faint, she cried out, ‘The Princess is dead!’ and\nMartelli, who had come for the usual dole to the castle—”\n\n“And what made you faint?” said Isabella, indifferent to the rest.\nMatilda blushed and stammered—\n\n“My father—he was sitting in judgment on a criminal—”\n\n“What criminal?” said Isabella eagerly.\n\n“A young man,” said Matilda; “I believe—”\n\n“I think it was that young man that—”\n\n“What, Theodore?” said Isabella.\n\n“Yes,” answered she; “I never saw him before; I do not know how he had\noffended my father, but as he has been of service to you, I am glad my\nLord has pardoned him.”\n\n“Served me!” replied Isabella; “do you term it serving me, to wound my\nfather, and almost occasion his death?  Though it is but since yesterday\nthat I am blessed with knowing a parent, I hope Matilda does not think I\nam such a stranger to filial tenderness as not to resent the boldness of\nthat audacious youth, and that it is impossible for me ever to feel any\naffection for one who dared to lift his arm against the author of my\nbeing.  No, Matilda, my heart abhors him; and if you still retain the\nfriendship for me that you have vowed from your infancy, you will detest\na man who has been on the point of making me miserable for ever.”\n\nMatilda held down her head and replied: “I hope my dearest Isabella does\nnot doubt her Matilda’s friendship: I never beheld that youth until\nyesterday; he is almost a stranger to me: but as the surgeons have\npronounced your father out of danger, you ought not to harbour\nuncharitable resentment against one, who I am persuaded did not know the\nMarquis was related to you.”\n\n“You plead his cause very pathetically,” said Isabella, “considering he\nis so much a stranger to you!  I am mistaken, or he returns your\ncharity.”\n\n“What mean you?” said Matilda.\n\n“Nothing,” said Isabella, repenting that she had given Matilda a hint of\nTheodore’s inclination for her.  Then changing the discourse, she asked\nMatilda what occasioned Manfred to take Theodore for a spectre?\n\n“Bless me,” said Matilda, “did not you observe his extreme resemblance to\nthe portrait of Alfonso in the gallery?  I took notice of it to Bianca\neven before I saw him in armour; but with the helmet on, he is the very\nimage of that picture.”\n\n“I do not much observe pictures,” said Isabella: “much less have I\nexamined this young man so attentively as you seem to have done.  Ah?\nMatilda, your heart is in danger, but let me warn you as a friend, he has\nowned to me that he is in love; it cannot be with you, for yesterday was\nthe first time you ever met—was it not?”\n\n“Certainly,” replied Matilda; “but why does my dearest Isabella conclude\nfrom anything I have said, that”—she paused—then continuing: “he saw you\nfirst, and I am far from having the vanity to think that my little\nportion of charms could engage a heart devoted to you; may you be happy,\nIsabella, whatever is the fate of Matilda!”\n\n“My lovely friend,” said Isabella, whose heart was too honest to resist a\nkind expression, “it is you that Theodore admires; I saw it; I am\npersuaded of it; nor shall a thought of my own happiness suffer me to\ninterfere with yours.”\n\nThis frankness drew tears from the gentle Matilda; and jealousy that for\na moment had raised a coolness between these amiable maidens soon gave\nway to the natural sincerity and candour of their souls.  Each confessed\nto the other the impression that Theodore had made on her; and this\nconfidence was followed by a struggle of generosity, each insisting on\nyielding her claim to her friend.  At length the dignity of Isabella’s\nvirtue reminding her of the preference which Theodore had almost declared\nfor her rival, made her determine to conquer her passion, and cede the\nbeloved object to her friend.\n\nDuring this contest of amity, Hippolita entered her daughter’s chamber.\n\n“Madam,” said she to Isabella, “you have so much tenderness for Matilda,\nand interest yourself so kindly in whatever affects our wretched house,\nthat I can have no secrets with my child which are not proper for you to\nhear.”\n\nThe princesses were all attention and anxiety.\n\n“Know then, Madam,” continued Hippolita, “and you my dearest Matilda,\nthat being convinced by all the events of these two last ominous days,\nthat heaven purposes the sceptre of Otranto should pass from Manfred’s\nhands into those of the Marquis Frederic, I have been perhaps inspired\nwith the thought of averting our total destruction by the union of our\nrival houses.  With this view I have been proposing to Manfred, my lord,\nto tender this dear, dear child to Frederic, your father.”\n\n“Me to Lord Frederic!” cried Matilda; “good heavens! my gracious\nmother—and have you named it to my father?”\n\n“I have,” said Hippolita; “he listened benignly to my proposal, and is\ngone to break it to the Marquis.”\n\n“Ah! wretched princess!” cried Isabella; “what hast thou done! what ruin\nhas thy inadvertent goodness been preparing for thyself, for me, and for\nMatilda!”\n\n“Ruin from me to you and to my child!” said Hippolita “what can this\nmean?”\n\n“Alas!” said Isabella, “the purity of your own heart prevents your seeing\nthe depravity of others.  Manfred, your lord, that impious man—”\n\n“Hold,” said Hippolita; “you must not in my presence, young lady, mention\nManfred with disrespect: he is my lord and husband, and—”\n\n“Will not long be so,” said Isabella, “if his wicked purposes can be\ncarried into execution.”\n\n“This language amazes me,” said Hippolita.  “Your feeling, Isabella, is\nwarm; but until this hour I never knew it betray you into intemperance.\nWhat deed of Manfred authorises you to treat him as a murderer, an\nassassin?”\n\n“Thou virtuous, and too credulous Princess!” replied Isabella; “it is not\nthy life he aims at—it is to separate himself from thee! to divorce thee!\nto—”\n\n“To divorce me!”  “To divorce my mother!” cried Hippolita and Matilda at\nonce.\n\n“Yes,” said Isabella; “and to complete his crime, he meditates—I cannot\nspeak it!”\n\n“What can surpass what thou hast already uttered?” said Matilda.\n\nHippolita was silent.  Grief choked her speech; and the recollection of\nManfred’s late ambiguous discourses confirmed what she heard.\n\n“Excellent, dear lady! madam! mother!” cried Isabella, flinging herself\nat Hippolita’s feet in a transport of passion; “trust me, believe me, I\nwill die a thousand deaths sooner than consent to injure you, than yield\nto so odious—oh!—”\n\n“This is too much!” cried Hippolita: “What crimes does one crime suggest!\nRise, dear Isabella; I do not doubt your virtue.  Oh! Matilda, this\nstroke is too heavy for thee! weep not, my child; and not a murmur, I\ncharge thee.  Remember, he is thy father still!”\n\n“But you are my mother too,” said Matilda fervently; “and you are\nvirtuous, you are guiltless!—Oh! must not I, must not I complain?”\n\n“You must not,” said Hippolita—“come, all will yet be well.  Manfred, in\nthe agony for the loss of thy brother, knew not what he said; perhaps\nIsabella misunderstood him; his heart is good—and, my child, thou knowest\nnot all!  There is a destiny hangs over us; the hand of Providence is\nstretched out; oh! could I but save thee from the wreck!  Yes,” continued\nshe in a firmer tone, “perhaps the sacrifice of myself may atone for all;\nI will go and offer myself to this divorce—it boots not what becomes of\nme.  I will withdraw into the neighbouring monastery, and waste the\nremainder of life in prayers and tears for my child and—the Prince!”\n\n“Thou art as much too good for this world,” said Isabella, “as Manfred is\nexecrable; but think not, lady, that thy weakness shall determine for me.\nI swear, hear me all ye angels—”\n\n“Stop, I adjure thee,” cried Hippolita: “remember thou dost not depend on\nthyself; thou hast a father.”\n\n“My father is too pious, too noble,” interrupted Isabella, “to command an\nimpious deed.  But should he command it; can a father enjoin a cursed\nact?  I was contracted to the son, can I wed the father?  No, madam, no;\nforce should not drag me to Manfred’s hated bed.  I loathe him, I abhor\nhim: divine and human laws forbid—and my friend, my dearest Matilda!\nwould I wound her tender soul by injuring her adored mother? my own\nmother—I never have known another”—\n\n“Oh! she is the mother of both!” cried Matilda: “can we, can we,\nIsabella, adore her too much?”\n\n“My lovely children,” said the touched Hippolita, “your tenderness\noverpowers me—but I must not give way to it.  It is not ours to make\nelection for ourselves: heaven, our fathers, and our husbands must decide\nfor us.  Have patience until you hear what Manfred and Frederic have\ndetermined.  If the Marquis accepts Matilda’s hand, I know she will\nreadily obey.  Heaven may interpose and prevent the rest.  What means my\nchild?” continued she, seeing Matilda fall at her feet with a flood of\nspeechless tears—“But no; answer me not, my daughter: I must not hear a\nword against the pleasure of thy father.”\n\n“Oh! doubt not my obedience, my dreadful obedience to him and to you!”\nsaid Matilda.  “But can I, most respected of women, can I experience all\nthis tenderness, this world of goodness, and conceal a thought from the\nbest of mothers?”\n\n“What art thou going to utter?” said Isabella trembling.  “Recollect\nthyself, Matilda.”\n\n“No, Isabella,” said the Princess, “I should not deserve this\nincomparable parent, if the inmost recesses of my soul harboured a\nthought without her permission—nay, I have offended her; I have suffered\na passion to enter my heart without her avowal—but here I disclaim it;\nhere I vow to heaven and her—”\n\n“My child! my child;” said Hippolita, “what words are these! what new\ncalamities has fate in store for us!  Thou, a passion?  Thou, in this\nhour of destruction—”\n\n“Oh! I see all my guilt!” said Matilda.  “I abhor myself, if I cost my\nmother a pang.  She is the dearest thing I have on earth—Oh! I will\nnever, never behold him more!”\n\n“Isabella,” said Hippolita, “thou art conscious to this unhappy secret,\nwhatever it is.  Speak!”\n\n“What!” cried Matilda, “have I so forfeited my mother’s love, that she\nwill not permit me even to speak my own guilt? oh! wretched, wretched\nMatilda!”\n\n“Thou art too cruel,” said Isabella to Hippolita: “canst thou behold this\nanguish of a virtuous mind, and not commiserate it?”\n\n“Not pity my child!” said Hippolita, catching Matilda in her arms—“Oh! I\nknow she is good, she is all virtue, all tenderness, and duty.  I do\nforgive thee, my excellent, my only hope!”\n\nThe princesses then revealed to Hippolita their mutual inclination for\nTheodore, and the purpose of Isabella to resign him to Matilda.\nHippolita blamed their imprudence, and showed them the improbability that\neither father would consent to bestow his heiress on so poor a man,\nthough nobly born.  Some comfort it gave her to find their passion of so\nrecent a date, and that Theodore had had but little cause to suspect it\nin either.  She strictly enjoined them to avoid all correspondence with\nhim.  This Matilda fervently promised: but Isabella, who flattered\nherself that she meant no more than to promote his union with her friend,\ncould not determine to avoid him; and made no reply.\n\n“I will go to the convent,” said Hippolita, “and order new masses to be\nsaid for a deliverance from these calamities.”\n\n“Oh! my mother,” said Matilda, “you mean to quit us: you mean to take\nsanctuary, and to give my father an opportunity of pursuing his fatal\nintention.  Alas! on my knees I supplicate you to forbear; will you leave\nme a prey to Frederic?  I will follow you to the convent.”\n\n“Be at peace, my child,” said Hippolita: “I will return instantly.  I\nwill never abandon thee, until I know it is the will of heaven, and for\nthy benefit.”\n\n“Do not deceive me,” said Matilda.  “I will not marry Frederic until thou\ncommandest it.  Alas! what will become of me?”\n\n“Why that exclamation?” said Hippolita.  “I have promised thee to\nreturn—”\n\n“Ah! my mother,” replied Matilda, “stay and save me from myself.  A frown\nfrom thee can do more than all my father’s severity.  I have given away\nmy heart, and you alone can make me recall it.”\n\n“No more,” said Hippolita; “thou must not relapse, Matilda.”\n\n“I can quit Theodore,” said she, “but must I wed another? let me attend\nthee to the altar, and shut myself from the world for ever.”\n\n“Thy fate depends on thy father,” said Hippolita; “I have ill-bestowed my\ntenderness, if it has taught thee to revere aught beyond him.  Adieu! my\nchild: I go to pray for thee.”\n\nHippolita’s real purpose was to demand of Jerome, whether in conscience\nshe might not consent to the divorce.  She had oft urged Manfred to\nresign the principality, which the delicacy of her conscience rendered an\nhourly burthen to her.  These scruples concurred to make the separation\nfrom her husband appear less dreadful to her than it would have seemed in\nany other situation.\n\nJerome, at quitting the castle overnight, had questioned Theodore\nseverely why he had accused him to Manfred of being privy to his escape.\nTheodore owned it had been with design to prevent Manfred’s suspicion\nfrom alighting on Matilda; and added, the holiness of Jerome’s life and\ncharacter secured him from the tyrant’s wrath.  Jerome was heartily\ngrieved to discover his son’s inclination for that princess; and leaving\nhim to his rest, promised in the morning to acquaint him with important\nreasons for conquering his passion.\n\nTheodore, like Isabella, was too recently acquainted with parental\nauthority to submit to its decisions against the impulse of his heart.\nHe had little curiosity to learn the Friar’s reasons, and less\ndisposition to obey them.  The lovely Matilda had made stronger\nimpressions on him than filial affection.  All night he pleased himself\nwith visions of love; and it was not till late after the morning-office,\nthat he recollected the Friar’s commands to attend him at Alfonso’s tomb.\n\n“Young man,” said Jerome, when he saw him, “this tardiness does not\nplease me.  Have a father’s commands already so little weight?”\n\nTheodore made awkward excuses, and attributed his delay to having\noverslept himself.\n\n“And on whom were thy dreams employed?” said the Friar sternly.  His son\nblushed.  “Come, come,” resumed the Friar, “inconsiderate youth, this\nmust not be; eradicate this guilty passion from thy breast—”\n\n“Guilty passion!” cried Theodore: “Can guilt dwell with innocent beauty\nand virtuous modesty?”\n\n“It is sinful,” replied the Friar, “to cherish those whom heaven has\ndoomed to destruction.  A tyrant’s race must be swept from the earth to\nthe third and fourth generation.”\n\n“Will heaven visit the innocent for the crimes of the guilty?” said\nTheodore.  “The fair Matilda has virtues enough—”\n\n“To undo thee:” interrupted Jerome.  “Hast thou so soon forgotten that\ntwice the savage Manfred has pronounced thy sentence?”\n\n“Nor have I forgotten, sir,” said Theodore, “that the charity of his\ndaughter delivered me from his power.  I can forget injuries, but never\nbenefits.”\n\n“The injuries thou hast received from Manfred’s race,” said the Friar,\n“are beyond what thou canst conceive.  Reply not, but view this holy\nimage!  Beneath this marble monument rest the ashes of the good Alfonso;\na prince adorned with every virtue: the father of his people! the delight\nof mankind!  Kneel, headstrong boy, and list, while a father unfolds a\ntale of horror that will expel every sentiment from thy soul, but\nsensations of sacred vengeance—Alfonso! much injured prince! let thy\nunsatisfied shade sit awful on the troubled air, while these trembling\nlips—Ha! who comes there?—”\n\n“The most wretched of women!” said Hippolita, entering the choir.  “Good\nFather, art thou at leisure?—but why this kneeling youth? what means the\nhorror imprinted on each countenance? why at this venerable tomb—alas!\nhast thou seen aught?”\n\n“We were pouring forth our orisons to heaven,” replied the Friar, with\nsome confusion, “to put an end to the woes of this deplorable province.\nJoin with us, Lady! thy spotless soul may obtain an exemption from the\njudgments which the portents of these days but too speakingly denounce\nagainst thy house.”\n\n“I pray fervently to heaven to divert them,” said the pious Princess.\n“Thou knowest it has been the occupation of my life to wrest a blessing\nfor my Lord and my harmless children.—One alas! is taken from me! would\nheaven but hear me for my poor Matilda!  Father! intercede for her!”\n\n“Every heart will bless her,” cried Theodore with rapture.\n\n“Be dumb, rash youth!” said Jerome.  “And thou, fond Princess, contend\nnot with the Powers above! the Lord giveth, and the Lord taketh away:\nbless His holy name, and submit to his decrees.”\n\n“I do most devoutly,” said Hippolita; “but will He not spare my only\ncomfort? must Matilda perish too?—ah!  Father, I came—but dismiss thy\nson.  No ear but thine must hear what I have to utter.”\n\n“May heaven grant thy every wish, most excellent Princess!” said Theodore\nretiring.  Jerome frowned.\n\nHippolita then acquainted the Friar with the proposal she had suggested\nto Manfred, his approbation of it, and the tender of Matilda that he was\ngone to make to Frederic.  Jerome could not conceal his dislike of the\nnotion, which he covered under pretence of the improbability that\nFrederic, the nearest of blood to Alfonso, and who was come to claim his\nsuccession, would yield to an alliance with the usurper of his right.\nBut nothing could equal the perplexity of the Friar, when Hippolita\nconfessed her readiness not to oppose the separation, and demanded his\nopinion on the legality of her acquiescence.  The Friar caught eagerly at\nher request of his advice, and without explaining his aversion to the\nproposed marriage of Manfred and Isabella, he painted to Hippolita in the\nmost alarming colours the sinfulness of her consent, denounced judgments\nagainst her if she complied, and enjoined her in the severest terms to\ntreat any such proposition with every mark of indignation and refusal.\n\nManfred, in the meantime, had broken his purpose to Frederic, and\nproposed the double marriage.  That weak Prince, who had been struck with\nthe charms of Matilda, listened but too eagerly to the offer.  He forgot\nhis enmity to Manfred, whom he saw but little hope of dispossessing by\nforce; and flattering himself that no issue might succeed from the union\nof his daughter with the tyrant, he looked upon his own succession to the\nprincipality as facilitated by wedding Matilda.  He made faint opposition\nto the proposal; affecting, for form only, not to acquiesce unless\nHippolita should consent to the divorce.  Manfred took that upon himself.\n\nTransported with his success, and impatient to see himself in a situation\nto expect sons, he hastened to his wife’s apartment, determined to extort\nher compliance.  He learned with indignation that she was absent at the\nconvent.  His guilt suggested to him that she had probably been informed\nby Isabella of his purpose.  He doubted whether her retirement to the\nconvent did not import an intention of remaining there, until she could\nraise obstacles to their divorce; and the suspicions he had already\nentertained of Jerome, made him apprehend that the Friar would not only\ntraverse his views, but might have inspired Hippolita with the resolution\nof talking sanctuary.  Impatient to unravel this clue, and to defeat its\nsuccess, Manfred hastened to the convent, and arrived there as the Friar\nwas earnestly exhorting the Princess never to yield to the divorce.\n\n“Madam,” said Manfred, “what business drew you hither? why did you not\nawait my return from the Marquis?”\n\n“I came to implore a blessing on your councils,” replied Hippolita.\n\n“My councils do not need a Friar’s intervention,” said Manfred; “and of\nall men living is that hoary traitor the only one whom you delight to\nconfer with?”\n\n“Profane Prince!” said Jerome; “is it at the altar that thou choosest to\ninsult the servants of the altar?—but, Manfred, thy impious schemes are\nknown.  Heaven and this virtuous lady know them—nay, frown not, Prince.\nThe Church despises thy menaces.  Her thunders will be heard above thy\nwrath.  Dare to proceed in thy cursed purpose of a divorce, until her\nsentence be known, and here I lance her anathema at thy head.”\n\n“Audacious rebel!” said Manfred, endeavouring to conceal the awe with\nwhich the Friar’s words inspired him.  “Dost thou presume to threaten thy\nlawful Prince?”\n\n“Thou art no lawful Prince,” said Jerome; “thou art no Prince—go, discuss\nthy claim with Frederic; and when that is done—”\n\n“It is done,” replied Manfred; “Frederic accepts Matilda’s hand, and is\ncontent to waive his claim, unless I have no male issue”—as he spoke\nthose words three drops of blood fell from the nose of Alfonso’s statue.\nManfred turned pale, and the Princess sank on her knees.\n\n“Behold!” said the Friar; “mark this miraculous indication that the blood\nof Alfonso will never mix with that of Manfred!”\n\n“My gracious Lord,” said Hippolita, “let us submit ourselves to heaven.\nThink not thy ever obedient wife rebels against thy authority.  I have no\nwill but that of my Lord and the Church.  To that revered tribunal let us\nappeal.  It does not depend on us to burst the bonds that unite us.  If\nthe Church shall approve the dissolution of our marriage, be it so—I have\nbut few years, and those of sorrow, to pass.  Where can they be worn away\nso well as at the foot of this altar, in prayers for thine and Matilda’s\nsafety?”\n\n“But thou shalt not remain here until then,” said Manfred.  “Repair with\nme to the castle, and there I will advise on the proper measures for a\ndivorce;—but this meddling Friar comes not thither; my hospitable roof\nshall never more harbour a traitor—and for thy Reverence’s offspring,”\ncontinued he, “I banish him from my dominions.  He, I ween, is no sacred\npersonage, nor under the protection of the Church.  Whoever weds\nIsabella, it shall not be Father Falconara’s started-up son.”\n\n“They start up,” said the Friar, “who are suddenly beheld in the seat of\nlawful Princes; but they wither away like the grass, and their place\nknows them no more.”\n\nManfred, casting a look of scorn at the Friar, led Hippolita forth; but\nat the door of the church whispered one of his attendants to remain\nconcealed about the convent, and bring him instant notice, if any one\nfrom the castle should repair thither.\n\n\n\n\nCHAPTER V.\n\n\nEvery reflection which Manfred made on the Friar’s behaviour, conspired\nto persuade him that Jerome was privy to an amour between Isabella and\nTheodore.  But Jerome’s new presumption, so dissonant from his former\nmeekness, suggested still deeper apprehensions.  The Prince even\nsuspected that the Friar depended on some secret support from Frederic,\nwhose arrival, coinciding with the novel appearance of Theodore, seemed\nto bespeak a correspondence.  Still more was he troubled with the\nresemblance of Theodore to Alfonso’s portrait.  The latter he knew had\nunquestionably died without issue.  Frederic had consented to bestow\nIsabella on him.  These contradictions agitated his mind with numberless\npangs.\n\nHe saw but two methods of extricating himself from his difficulties.  The\none was to resign his dominions to the Marquis—pride, ambition, and his\nreliance on ancient prophecies, which had pointed out a possibility of\nhis preserving them to his posterity, combated that thought.  The other\nwas to press his marriage with Isabella.  After long ruminating on these\nanxious thoughts, as he marched silently with Hippolita to the castle, he\nat last discoursed with that Princess on the subject of his disquiet, and\nused every insinuating and plausible argument to extract her consent to,\neven her promise of promoting the divorce.  Hippolita needed little\npersuasions to bend her to his pleasure.  She endeavoured to win him over\nto the measure of resigning his dominions; but finding her exhortations\nfruitless, she assured him, that as far as her conscience would allow,\nshe would raise no opposition to a separation, though without better\nfounded scruples than what he yet alleged, she would not engage to be\nactive in demanding it.\n\nThis compliance, though inadequate, was sufficient to raise Manfred’s\nhopes.  He trusted that his power and wealth would easily advance his\nsuit at the court of Rome, whither he resolved to engage Frederic to take\na journey on purpose.  That Prince had discovered so much passion for\nMatilda, that Manfred hoped to obtain all he wished by holding out or\nwithdrawing his daughter’s charms, according as the Marquis should appear\nmore or less disposed to co-operate in his views.  Even the absence of\nFrederic would be a material point gained, until he could take further\nmeasures for his security.\n\nDismissing Hippolita to her apartment, he repaired to that of the\nMarquis; but crossing the great hall through which he was to pass he met\nBianca.  The damsel he knew was in the confidence of both the young\nladies.  It immediately occurred to him to sift her on the subject of\nIsabella and Theodore.  Calling her aside into the recess of the oriel\nwindow of the hall, and soothing her with many fair words and promises,\nhe demanded of her whether she knew aught of the state of Isabella’s\naffections.\n\n“I! my Lord! no my Lord—yes my Lord—poor Lady! she is wonderfully alarmed\nabout her father’s wounds; but I tell her he will do well; don’t your\nHighness think so?”\n\n“I do not ask you,” replied Manfred, “what she thinks about her father;\nbut you are in her secrets.  Come, be a good girl and tell me; is there\nany young man—ha!—you understand me.”\n\n“Lord bless me! understand your Highness? no, not I.  I told her a few\nvulnerary herbs and repose—”\n\n“I am not talking,” replied the Prince, impatiently, “about her father; I\nknow he will do well.”\n\n“Bless me, I rejoice to hear your Highness say so; for though I thought\nit not right to let my young Lady despond, methought his greatness had a\nwan look, and a something—I remember when young Ferdinand was wounded by\nthe Venetian—”\n\n“Thou answerest from the point,” interrupted Manfred; “but here, take\nthis jewel, perhaps that may fix thy attention—nay, no reverences; my\nfavour shall not stop here—come, tell me truly; how stands Isabella’s\nheart?”\n\n“Well! your Highness has such a way!” said Bianca, “to be sure—but can\nyour Highness keep a secret? if it should ever come out of your lips—”\n\n“It shall not, it shall not,” cried Manfred.\n\n“Nay, but swear, your Highness.”\n\n“By my halidame, if it should ever be known that I said it—”\n\n“Why, truth is truth, I do not think my Lady Isabella ever much\naffectioned my young Lord your son; yet he was a sweet youth as one\nshould see; I am sure, if I had been a Princess—but bless me!  I must\nattend my Lady Matilda; she will marvel what is become of me.”\n\n“Stay,” cried Manfred; “thou hast not satisfied my question.  Hast thou\never carried any message, any letter?”\n\n“I! good gracious!” cried Bianca; “I carry a letter?  I would not to be a\nQueen.  I hope your Highness thinks, though I am poor, I am honest.  Did\nyour Highness never hear what Count Marsigli offered me, when he came a\nwooing to my Lady Matilda?”\n\n“I have not leisure,” said Manfred, “to listen to thy tale.  I do not\nquestion thy honesty.  But it is thy duty to conceal nothing from me.\nHow long has Isabella been acquainted with Theodore?”\n\n“Nay, there is nothing can escape your Highness!” said Bianca; “not that\nI know any thing of the matter.  Theodore, to be sure, is a proper young\nman, and, as my Lady Matilda says, the very image of good Alfonso.  Has\nnot your Highness remarked it?”\n\n“Yes, yes,—No—thou torturest me,” said Manfred.  “Where did they meet?\nwhen?”\n\n“Who! my Lady Matilda?” said Bianca.\n\n“No, no, not Matilda: Isabella; when did Isabella first become acquainted\nwith this Theodore!”\n\n“Virgin Mary!” said Bianca, “how should I know?”\n\n“Thou dost know,” said Manfred; “and I must know; I will—”\n\n“Lord! your Highness is not jealous of young Theodore!” said Bianca.\n\n“Jealous! no, no.  Why should I be jealous? perhaps I mean to unite\nthem—If I were sure Isabella would have no repugnance.”\n\n“Repugnance! no, I’ll warrant her,” said Bianca; “he is as comely a youth\nas ever trod on Christian ground.  We are all in love with him; there is\nnot a soul in the castle but would be rejoiced to have him for our\nPrince—I mean, when it shall please heaven to call your Highness to\nitself.”\n\n“Indeed!” said Manfred, “has it gone so far! oh! this cursed Friar!—but I\nmust not lose time—go, Bianca, attend Isabella; but I charge thee, not a\nword of what has passed.  Find out how she is affected towards Theodore;\nbring me good news, and that ring has a companion.  Wait at the foot of\nthe winding staircase: I am going to visit the Marquis, and will talk\nfurther with thee at my return.”\n\nManfred, after some general conversation, desired Frederic to dismiss the\ntwo Knights, his companions, having to talk with him on urgent affairs.\n\nAs soon as they were alone, he began in artful guise to sound the Marquis\non the subject of Matilda; and finding him disposed to his wish, he let\ndrop hints on the difficulties that would attend the celebration of their\nmarriage, unless—At that instant Bianca burst into the room with a\nwildness in her look and gestures that spoke the utmost terror.\n\n“Oh! my Lord, my Lord!” cried she; “we are all undone! it is come again!\nit is come again!”\n\n“What is come again?” cried Manfred amazed.\n\n“Oh! the hand! the Giant! the hand!—support me! I am terrified out of my\nsenses,” cried Bianca.  “I will not sleep in the castle to-night.  Where\nshall I go? my things may come after me to-morrow—would I had been\ncontent to wed Francesco! this comes of ambition!”\n\n“What has terrified thee thus, young woman?” said the Marquis.  “Thou art\nsafe here; be not alarmed.”\n\n“Oh! your Greatness is wonderfully good,” said Bianca, “but I dare\nnot—no, pray let me go—I had rather leave everything behind me, than stay\nanother hour under this roof.”\n\n“Go to, thou hast lost thy senses,” said Manfred.  “Interrupt us not; we\nwere communing on important matters—My Lord, this wench is subject to\nfits—Come with me, Bianca.”\n\n“Oh! the Saints!  No,” said Bianca, “for certain it comes to warn your\nHighness; why should it appear to me else?  I say my prayers morning and\nevening—oh! if your Highness had believed Diego!  ’Tis the same hand that\nhe saw the foot to in the gallery-chamber—Father Jerome has often told us\nthe prophecy would be out one of these days—‘Bianca,’ said he, ‘mark my\nwords—’”\n\n“Thou ravest,” said Manfred, in a rage; “be gone, and keep these\nfooleries to frighten thy companions.”\n\n“What! my Lord,” cried Bianca, “do you think I have seen nothing? go to\nthe foot of the great stairs yourself—as I live I saw it.”\n\n“Saw what? tell us, fair maid, what thou hast seen,” said Frederic.\n\n“Can your Highness listen,” said Manfred, “to the delirium of a silly\nwench, who has heard stories of apparitions until she believes them?”\n\n“This is more than fancy,” said the Marquis; “her terror is too natural\nand too strongly impressed to be the work of imagination.  Tell us, fair\nmaiden, what it is has moved thee thus?”\n\n“Yes, my Lord, thank your Greatness,” said Bianca; “I believe I look very\npale; I shall be better when I have recovered myself—I was going to my\nLady Isabella’s chamber, by his Highness’s order—”\n\n“We do not want the circumstances,” interrupted Manfred.  “Since his\nHighness will have it so, proceed; but be brief.”\n\n“Lord! your Highness thwarts one so!” replied Bianca; “I fear my hair—I\nam sure I never in my life—well! as I was telling your Greatness, I was\ngoing by his Highness’s order to my Lady Isabella’s chamber; she lies in\nthe watchet-coloured chamber, on the right hand, one pair of stairs: so\nwhen I came to the great stairs—I was looking on his Highness’s present\nhere—”\n\n“Grant me patience!” said Manfred, “will this wench never come to the\npoint? what imports it to the Marquis, that I gave thee a bauble for thy\nfaithful attendance on my daughter? we want to know what thou sawest.”\n\n“I was going to tell your Highness,” said Bianca, “if you would permit\nme.  So as I was rubbing the ring—I am sure I had not gone up three\nsteps, but I heard the rattling of armour; for all the world such a\nclatter as Diego says he heard when the Giant turned him about in the\ngallery-chamber.”\n\n“What Giant is this, my Lord?” said the Marquis; “is your castle haunted\nby giants and goblins?”\n\n“Lord! what, has not your Greatness heard the story of the Giant in the\ngallery-chamber?” cried Bianca.  “I marvel his Highness has not told you;\nmayhap you do not know there is a prophecy—”\n\n“This trifling is intolerable,” interrupted Manfred.  “Let us dismiss\nthis silly wench, my Lord! we have more important affairs to discuss.”\n\n“By your favour,” said Frederic, “these are no trifles.  The enormous\nsabre I was directed to in the wood, yon casque, its fellow—are these\nvisions of this poor maiden’s brain?”\n\n“So Jaquez thinks, may it please your Greatness,” said Bianca.  “He says\nthis moon will not be out without our seeing some strange revolution.\nFor my part, I should not be surprised if it was to happen to-morrow;\nfor, as I was saying, when I heard the clattering of armour, I was all in\na cold sweat.  I looked up, and, if your Greatness will believe me, I saw\nupon the uppermost banister of the great stairs a hand in armour as big\nas big.  I thought I should have swooned.  I never stopped until I came\nhither—would I were well out of this castle.  My Lady Matilda told me but\nyester-morning that her Highness Hippolita knows something.”\n\n“Thou art an insolent!” cried Manfred.  “Lord Marquis, it much misgives\nme that this scene is concerted to affront me.  Are my own domestics\nsuborned to spread tales injurious to my honour?  Pursue your claim by\nmanly daring; or let us bury our feuds, as was proposed, by the\nintermarriage of our children.  But trust me, it ill becomes a Prince of\nyour bearing to practise on mercenary wenches.”\n\n“I scorn your imputation,” said Frederic.  “Until this hour I never set\neyes on this damsel: I have given her no jewel.  My Lord, my Lord, your\nconscience, your guilt accuses you, and would throw the suspicion on me;\nbut keep your daughter, and think no more of Isabella.  The judgments\nalready fallen on your house forbid me matching into it.”\n\nManfred, alarmed at the resolute tone in which Frederic delivered these\nwords, endeavoured to pacify him.  Dismissing Bianca, he made such\nsubmissions to the Marquis, and threw in such artful encomiums on\nMatilda, that Frederic was once more staggered.  However, as his passion\nwas of so recent a date, it could not at once surmount the scruples he\nhad conceived.  He had gathered enough from Bianca’s discourse to\npersuade him that heaven declared itself against Manfred.  The proposed\nmarriages too removed his claim to a distance; and the principality of\nOtranto was a stronger temptation than the contingent reversion of it\nwith Matilda.  Still he would not absolutely recede from his engagements;\nbut purposing to gain time, he demanded of Manfred if it was true in fact\nthat Hippolita consented to the divorce.  The Prince, transported to find\nno other obstacle, and depending on his influence over his wife, assured\nthe Marquis it was so, and that he might satisfy himself of the truth\nfrom her own mouth.\n\nAs they were thus discoursing, word was brought that the banquet was\nprepared.  Manfred conducted Frederic to the great hall, where they were\nreceived by Hippolita and the young Princesses.  Manfred placed the\nMarquis next to Matilda, and seated himself between his wife and\nIsabella.  Hippolita comported herself with an easy gravity; but the\nyoung ladies were silent and melancholy.  Manfred, who was determined to\npursue his point with the Marquis in the remainder of the evening, pushed\non the feast until it waxed late; affecting unrestrained gaiety, and\nplying Frederic with repeated goblets of wine.  The latter, more upon his\nguard than Manfred wished, declined his frequent challenges, on pretence\nof his late loss of blood; while the Prince, to raise his own disordered\nspirits, and to counterfeit unconcern, indulged himself in plentiful\ndraughts, though not to the intoxication of his senses.\n\nThe evening being far advanced, the banquet concluded.  Manfred would\nhave withdrawn with Frederic; but the latter pleading weakness and want\nof repose, retired to his chamber, gallantly telling the Prince that his\ndaughter should amuse his Highness until himself could attend him.\nManfred accepted the party, and to the no small grief of Isabella,\naccompanied her to her apartment.  Matilda waited on her mother to enjoy\nthe freshness of the evening on the ramparts of the castle.\n\nSoon as the company were dispersed their several ways, Frederic, quitting\nhis chamber, inquired if Hippolita was alone, and was told by one of her\nattendants, who had not noticed her going forth, that at that hour she\ngenerally withdrew to her oratory, where he probably would find her.  The\nMarquis, during the repast, had beheld Matilda with increase of passion.\nHe now wished to find Hippolita in the disposition her Lord had promised.\nThe portents that had alarmed him were forgotten in his desires.\nStealing softly and unobserved to the apartment of Hippolita, he entered\nit with a resolution to encourage her acquiescence to the divorce, having\nperceived that Manfred was resolved to make the possession of Isabella an\nunalterable condition, before he would grant Matilda to his wishes.\n\nThe Marquis was not surprised at the silence that reigned in the\nPrincess’s apartment.  Concluding her, as he had been advertised, in her\noratory, he passed on.  The door was ajar; the evening gloomy and\novercast.  Pushing open the door gently, he saw a person kneeling before\nthe altar.  As he approached nearer, it seemed not a woman, but one in a\nlong woollen weed, whose back was towards him.  The person seemed\nabsorbed in prayer.  The Marquis was about to return, when the figure,\nrising, stood some moments fixed in meditation, without regarding him.\nThe Marquis, expecting the holy person to come forth, and meaning to\nexcuse his uncivil interruption, said,\n\n“Reverend Father, I sought the Lady Hippolita.”\n\n“Hippolita!” replied a hollow voice; “camest thou to this castle to seek\nHippolita?” and then the figure, turning slowly round, discovered to\nFrederic the fleshless jaws and empty sockets of a skeleton, wrapt in a\nhermit’s cowl.\n\n“Angels of grace protect me!” cried Frederic, recoiling.\n\n“Deserve their protection!” said the Spectre.  Frederic, falling on his\nknees, adjured the phantom to take pity on him.\n\n“Dost thou not remember me?” said the apparition.  “Remember the wood of\nJoppa!”\n\n“Art thou that holy hermit?” cried Frederic, trembling.  “Can I do aught\nfor thy eternal peace?”\n\n“Wast thou delivered from bondage,” said the spectre, “to pursue carnal\ndelights?  Hast thou forgotten the buried sabre, and the behest of Heaven\nengraven on it?”\n\n“I have not, I have not,” said Frederic; “but say, blest spirit, what is\nthy errand to me?  What remains to be done?”\n\n“To forget Matilda!” said the apparition; and vanished.\n\nFrederic’s blood froze in his veins.  For some minutes he remained\nmotionless.  Then falling prostrate on his face before the altar, he\nbesought the intercession of every saint for pardon.  A flood of tears\nsucceeded to this transport; and the image of the beauteous Matilda\nrushing in spite of him on his thoughts, he lay on the ground in a\nconflict of penitence and passion.  Ere he could recover from this agony\nof his spirits, the Princess Hippolita with a taper in her hand entered\nthe oratory alone.  Seeing a man without motion on the floor, she gave a\nshriek, concluding him dead.  Her fright brought Frederic to himself.\nRising suddenly, his face bedewed with tears, he would have rushed from\nher presence; but Hippolita stopping him, conjured him in the most\nplaintive accents to explain the cause of his disorder, and by what\nstrange chance she had found him there in that posture.\n\n“Ah, virtuous Princess!” said the Marquis, penetrated with grief, and\nstopped.\n\n“For the love of Heaven, my Lord,” said Hippolita, “disclose the cause of\nthis transport!  What mean these doleful sounds, this alarming\nexclamation on my name?  What woes has heaven still in store for the\nwretched Hippolita?  Yet silent!  By every pitying angel, I adjure thee,\nnoble Prince,” continued she, falling at his feet, “to disclose the\npurport of what lies at thy heart.  I see thou feelest for me; thou\nfeelest the sharp pangs that thou inflictest—speak, for pity!  Does aught\nthou knowest concern my child?”\n\n“I cannot speak,” cried Frederic, bursting from her.  “Oh, Matilda!”\n\nQuitting the Princess thus abruptly, he hastened to his own apartment.\nAt the door of it he was accosted by Manfred, who flushed by wine and\nlove had come to seek him, and to propose to waste some hours of the\nnight in music and revelling.  Frederic, offended at an invitation so\ndissonant from the mood of his soul, pushed him rudely aside, and\nentering his chamber, flung the door intemperately against Manfred, and\nbolted it inwards.  The haughty Prince, enraged at this unaccountable\nbehaviour, withdrew in a frame of mind capable of the most fatal\nexcesses.  As he crossed the court, he was met by the domestic whom he\nhad planted at the convent as a spy on Jerome and Theodore.  This man,\nalmost breathless with the haste he had made, informed his Lord that\nTheodore, and some lady from the castle were, at that instant, in private\nconference at the tomb of Alfonso in St. Nicholas’s church.  He had\ndogged Theodore thither, but the gloominess of the night had prevented\nhis discovering who the woman was.\n\nManfred, whose spirits were inflamed, and whom Isabella had driven from\nher on his urging his passion with too little reserve, did not doubt but\nthe inquietude she had expressed had been occasioned by her impatience to\nmeet Theodore.  Provoked by this conjecture, and enraged at her father,\nhe hastened secretly to the great church.  Gliding softly between the\naisles, and guided by an imperfect gleam of moonshine that shone faintly\nthrough the illuminated windows, he stole towards the tomb of Alfonso, to\nwhich he was directed by indistinct whispers of the persons he sought.\nThe first sounds he could distinguish were—\n\n“Does it, alas! depend on me?  Manfred will never permit our union.”\n\n“No, this shall prevent it!” cried the tyrant, drawing his dagger, and\nplunging it over her shoulder into the bosom of the person that spoke.\n\n“Ah, me, I am slain!” cried Matilda, sinking.  “Good heaven, receive my\nsoul!”\n\n“Savage, inhuman monster, what hast thou done!” cried Theodore, rushing\non him, and wrenching his dagger from him.\n\n“Stop, stop thy impious hand!” cried Matilda; “it is my father!”\n\nManfred, waking as from a trance, beat his breast, twisted his hands in\nhis locks, and endeavoured to recover his dagger from Theodore to\ndespatch himself.  Theodore, scarce less distracted, and only mastering\nthe transports of his grief to assist Matilda, had now by his cries drawn\nsome of the monks to his aid.  While part of them endeavoured, in concert\nwith the afflicted Theodore, to stop the blood of the dying Princess, the\nrest prevented Manfred from laying violent hands on himself.\n\nMatilda, resigning herself patiently to her fate, acknowledged with looks\nof grateful love the zeal of Theodore.  Yet oft as her faintness would\npermit her speech its way, she begged the assistants to comfort her\nfather.  Jerome, by this time, had learnt the fatal news, and reached the\nchurch.  His looks seemed to reproach Theodore, but turning to Manfred,\nhe said,\n\n“Now, tyrant! behold the completion of woe fulfilled on thy impious and\ndevoted head!  The blood of Alfonso cried to heaven for vengeance; and\nheaven has permitted its altar to be polluted by assassination, that thou\nmightest shed thy own blood at the foot of that Prince’s sepulchre!”\n\n“Cruel man!” cried Matilda, “to aggravate the woes of a parent; may\nheaven bless my father, and forgive him as I do!  My Lord, my gracious\nSire, dost thou forgive thy child?  Indeed, I came not hither to meet\nTheodore.  I found him praying at this tomb, whither my mother sent me to\nintercede for thee, for her—dearest father, bless your child, and say you\nforgive her.”\n\n“Forgive thee!  Murderous monster!” cried Manfred, “can assassins\nforgive?  I took thee for Isabella; but heaven directed my bloody hand to\nthe heart of my child.  Oh, Matilda!—I cannot utter it—canst thou forgive\nthe blindness of my rage?”\n\n“I can, I do; and may heaven confirm it!” said Matilda; “but while I have\nlife to ask it—oh! my mother! what will she feel?  Will you comfort her,\nmy Lord?  Will you not put her away?  Indeed she loves you!  Oh, I am\nfaint! bear me to the castle.  Can I live to have her close my eyes?”\n\nTheodore and the monks besought her earnestly to suffer herself to be\nborne into the convent; but her instances were so pressing to be carried\nto the castle, that placing her on a litter, they conveyed her thither as\nshe requested.  Theodore, supporting her head with his arm, and hanging\nover her in an agony of despairing love, still endeavoured to inspire her\nwith hopes of life.  Jerome, on the other side, comforted her with\ndiscourses of heaven, and holding a crucifix before her, which she bathed\nwith innocent tears, prepared her for her passage to immortality.\nManfred, plunged in the deepest affliction, followed the litter in\ndespair.\n\nEre they reached the castle, Hippolita, informed of the dreadful\ncatastrophe, had flown to meet her murdered child; but when she saw the\nafflicted procession, the mightiness of her grief deprived her of her\nsenses, and she fell lifeless to the earth in a swoon.  Isabella and\nFrederic, who attended her, were overwhelmed in almost equal sorrow.\nMatilda alone seemed insensible to her own situation: every thought was\nlost in tenderness for her mother.\n\nOrdering the litter to stop, as soon as Hippolita was brought to herself,\nshe asked for her father.  He approached, unable to speak.  Matilda,\nseizing his hand and her mother’s, locked them in her own, and then\nclasped them to her heart.  Manfred could not support this act of\npathetic piety.  He dashed himself on the ground, and cursed the day he\nwas born.  Isabella, apprehensive that these struggles of passion were\nmore than Matilda could support, took upon herself to order Manfred to be\nborne to his apartment, while she caused Matilda to be conveyed to the\nnearest chamber.  Hippolita, scarce more alive than her daughter, was\nregardless of everything but her; but when the tender Isabella’s care\nwould have likewise removed her, while the surgeons examined Matilda’s\nwound, she cried,\n\n“Remove me! never, never!  I lived but in her, and will expire with her.”\n\nMatilda raised her eyes at her mother’s voice, but closed them again\nwithout speaking.  Her sinking pulse and the damp coldness of her hand\nsoon dispelled all hopes of recovery.  Theodore followed the surgeons\ninto the outer chamber, and heard them pronounce the fatal sentence with\na transport equal to frenzy.\n\n“Since she cannot live mine,” cried he, “at least she shall be mine in\ndeath!  Father!  Jerome! will you not join our hands?” cried he to the\nFriar, who, with the Marquis, had accompanied the surgeons.\n\n“What means thy distracted rashness?” said Jerome.  “Is this an hour for\nmarriage?”\n\n“It is, it is,” cried Theodore.  “Alas! there is no other!”\n\n“Young man, thou art too unadvised,” said Frederic.  “Dost thou think we\nare to listen to thy fond transports in this hour of fate?  What\npretensions hast thou to the Princess?”\n\n“Those of a Prince,” said Theodore; “of the sovereign of Otranto.  This\nreverend man, my father, has informed me who I am.”\n\n“Thou ravest,” said the Marquis.  “There is no Prince of Otranto but\nmyself, now Manfred, by murder, by sacrilegious murder, has forfeited all\npretensions.”\n\n“My Lord,” said Jerome, assuming an air of command, “he tells you true.\nIt was not my purpose the secret should have been divulged so soon, but\nfate presses onward to its work.  What his hot-headed passion has\nrevealed, my tongue confirms.  Know, Prince, that when Alfonso set sail\nfor the Holy Land—”\n\n“Is this a season for explanations?” cried Theodore.  “Father, come and\nunite me to the Princess; she shall be mine!  In every other thing I will\ndutifully obey you.  My life! my adored Matilda!” continued Theodore,\nrushing back into the inner chamber, “will you not be mine?  Will you not\nbless your—”\n\nIsabella made signs to him to be silent, apprehending the Princess was\nnear her end.\n\n“What, is she dead?” cried Theodore; “is it possible!”\n\nThe violence of his exclamations brought Matilda to herself.  Lifting up\nher eyes, she looked round for her mother.\n\n“Life of my soul, I am here!” cried Hippolita; “think not I will quit\nthee!”\n\n“Oh! you are too good,” said Matilda.  “But weep not for me, my mother!\nI am going where sorrow never dwells—Isabella, thou hast loved me;\nwouldst thou not supply my fondness to this dear, dear woman?  Indeed I\nam faint!”\n\n“Oh! my child! my child!” said Hippolita in a flood of tears, “can I not\nwithhold thee a moment?”\n\n“It will not be,” said Matilda; “commend me to heaven—Where is my father?\nforgive him, dearest mother—forgive him my death; it was an error.  Oh!\nI had forgotten—dearest mother, I vowed never to see Theodore\nmore—perhaps that has drawn down this calamity—but it was not\nintentional—can you pardon me?”\n\n“Oh! wound not my agonising soul!” said Hippolita; “thou never couldst\noffend me—Alas! she faints! help! help!”\n\n“I would say something more,” said Matilda, struggling, “but it cannot\nbe—Isabella—Theodore—for my sake—Oh!—” she expired.\n\nIsabella and her women tore Hippolita from the corse; but Theodore\nthreatened destruction to all who attempted to remove him from it.  He\nprinted a thousand kisses on her clay-cold hands, and uttered every\nexpression that despairing love could dictate.\n\nIsabella, in the meantime, was accompanying the afflicted Hippolita to\nher apartment; but, in the middle of the court, they were met by Manfred,\nwho, distracted with his own thoughts, and anxious once more to behold\nhis daughter, was advancing to the chamber where she lay.  As the moon\nwas now at its height, he read in the countenances of this unhappy\ncompany the event he dreaded.\n\n“What! is she dead?” cried he in wild confusion.  A clap of thunder at\nthat instant shook the castle to its foundations; the earth rocked, and\nthe clank of more than mortal armour was heard behind.  Frederic and\nJerome thought the last day was at hand.  The latter, forcing Theodore\nalong with them, rushed into the court.  The moment Theodore appeared,\nthe walls of the castle behind Manfred were thrown down with a mighty\nforce, and the form of Alfonso, dilated to an immense magnitude, appeared\nin the centre of the ruins.\n\n“Behold in Theodore the true heir of Alfonso!” said the vision: And\nhaving pronounced those words, accompanied by a clap of thunder, it\nascended solemnly towards heaven, where the clouds parting asunder, the\nform of St. Nicholas was seen, and receiving Alfonso’s shade, they were\nsoon wrapt from mortal eyes in a blaze of glory.\n\nThe beholders fell prostrate on their faces, acknowledging the divine\nwill.  The first that broke silence was Hippolita.\n\n“My Lord,” said she to the desponding Manfred, “behold the vanity of\nhuman greatness!  Conrad is gone!  Matilda is no more!  In Theodore we\nview the true Prince of Otranto.  By what miracle he is so I know\nnot—suffice it to us, our doom is pronounced! shall we not, can we but\ndedicate the few deplorable hours we have to live, in deprecating the\nfurther wrath of heaven? heaven ejects us—whither can we fly, but to yon\nholy cells that yet offer us a retreat.”\n\n“Thou guiltless but unhappy woman! unhappy by my crimes!” replied\nManfred, “my heart at last is open to thy devout admonitions.  Oh!\ncould—but it cannot be—ye are lost in wonder—let me at last do justice on\nmyself!  To heap shame on my own head is all the satisfaction I have left\nto offer to offended heaven.  My story has drawn down these judgments:\nLet my confession atone—but, ah! what can atone for usurpation and a\nmurdered child? a child murdered in a consecrated place?  List, sirs, and\nmay this bloody record be a warning to future tyrants!”\n\n“Alfonso, ye all know, died in the Holy Land—ye would interrupt me; ye\nwould say he came not fairly to his end—it is most true—why else this\nbitter cup which Manfred must drink to the dregs.  Ricardo, my\ngrandfather, was his chamberlain—I would draw a veil over my ancestor’s\ncrimes—but it is in vain!  Alfonso died by poison.  A fictitious will\ndeclared Ricardo his heir.  His crimes pursued him—yet he lost no Conrad,\nno Matilda!  I pay the price of usurpation for all!  A storm overtook\nhim.  Haunted by his guilt he vowed to St. Nicholas to found a church and\ntwo convents, if he lived to reach Otranto.  The sacrifice was accepted:\nthe saint appeared to him in a dream, and promised that Ricardo’s\nposterity should reign in Otranto until the rightful owner should be\ngrown too large to inhabit the castle, and as long as issue male from\nRicardo’s loins should remain to enjoy it—alas! alas! nor male nor\nfemale, except myself, remains of all his wretched race!  I have done—the\nwoes of these three days speak the rest.  How this young man can be\nAlfonso’s heir I know not—yet I do not doubt it.  His are these\ndominions; I resign them—yet I knew not Alfonso had an heir—I question\nnot the will of heaven—poverty and prayer must fill up the woeful space,\nuntil Manfred shall be summoned to Ricardo.”\n\n“What remains is my part to declare,” said Jerome.  “When Alfonso set\nsail for the Holy Land he was driven by a storm to the coast of Sicily.\nThe other vessel, which bore Ricardo and his train, as your Lordship must\nhave heard, was separated from him.”\n\n“It is most true,” said Manfred; “and the title you give me is more than\nan outcast can claim—well! be it so—proceed.”\n\nJerome blushed, and continued.  “For three months Lord Alfonso was\nwind-bound in Sicily.  There he became enamoured of a fair virgin named\nVictoria.  He was too pious to tempt her to forbidden pleasures.  They\nwere married.  Yet deeming this amour incongruous with the holy vow of\narms by which he was bound, he determined to conceal their nuptials until\nhis return from the Crusade, when he purposed to seek and acknowledge her\nfor his lawful wife.  He left her pregnant.  During his absence she was\ndelivered of a daughter.  But scarce had she felt a mother’s pangs ere\nshe heard the fatal rumour of her Lord’s death, and the succession of\nRicardo.  What could a friendless, helpless woman do?  Would her\ntestimony avail?—yet, my lord, I have an authentic writing—”\n\n“It needs not,” said Manfred; “the horrors of these days, the vision we\nhave but now seen, all corroborate thy evidence beyond a thousand\nparchments.  Matilda’s death and my expulsion—”\n\n“Be composed, my Lord,” said Hippolita; “this holy man did not mean to\nrecall your griefs.”  Jerome proceeded.\n\n“I shall not dwell on what is needless.  The daughter of which Victoria\nwas delivered, was at her maturity bestowed in marriage on me.  Victoria\ndied; and the secret remained locked in my breast.  Theodore’s narrative\nhas told the rest.”\n\nThe Friar ceased.  The disconsolate company retired to the remaining part\nof the castle.  In the morning Manfred signed his abdication of the\nprincipality, with the approbation of Hippolita, and each took on them\nthe habit of religion in the neighbouring convents.  Frederic offered his\ndaughter to the new Prince, which Hippolita’s tenderness for Isabella\nconcurred to promote.  But Theodore’s grief was too fresh to admit the\nthought of another love; and it was not until after frequent discourses\nwith Isabella of his dear Matilda, that he was persuaded he could know no\nhappiness but in the society of one with whom he could for ever indulge\nthe melancholy that had taken possession of his soul.", "title": "The Castle of Otranto"}