{"summary": "Thoreau asserts that because governments are typically more harmful than helpful, they therefore cannot be justified. Democracy is no cure for this, as majorities simply by virtue of being majorities do not also gain the virtues of wisdom and justice. The judgment of an individual's conscience is not necessarily inferior to the decisions of a political body or majority, and so \"[i]t is not desirable to cultivate a respect for the law, so much as for the right. The only obligation which I have a right to assume is to do at any time what I think right.... Law never made men a whit more just; and, by means of their respect for it, even the well-disposed are daily made the agents of injustice.\" He adds, \"I cannot for an instant recognize as my government [that] which is the slave's government also.\"\nThe government, according to Thoreau, is not just a little corrupt or unjust in the course of doing its otherwise-important work, but in fact the government is primarily an agent of corruption and injustice. Because of this, it is \"not too soon for honest men to rebel and revolutionize.\"\nPolitical philosophers have counseled caution about revolution because the upheaval of revolution typically causes a lot of expense and suffering. Thoreau contends that such a cost/benefit analysis is inappropriate when the government is actively facilitating an injustice as extreme as slavery. Such a fundamental immorality justifies any difficulty or expense to bring to an end. \"This people must cease to hold slaves, and to make war on Mexico, though it cost them their existence as a people.\"\nThoreau tells his audience that they cannot blame this problem solely on pro-slavery Southern politicians, but must put the blame on those in, for instance, Massachusetts, \"who are more interested in commerce and agriculture than they are in humanity, and are not prepared to do justice to the slave and to Mexico, cost what it may... There are thousands who are in opinion opposed to slavery and to the war, who yet in effect do nothing to put an end to them.\" (See also: Thoreau's Slavery in Massachusetts which also advances this argument.)\nHe exhorts people not to just wait passively for an opportunity to vote for justice, because voting for justice is as ineffective as wishing for justice; what you need to do is to actually be just. This is not to say that you have an obligation to devote your life to fighting for justice, but you do have an obligation not to commit injustice and not to give injustice your practical support.\nPaying taxes is one way in which otherwise well-meaning people collaborate in injustice. People who proclaim that the war in Mexico is wrong and that it is wrong to enforce slavery contradict themselves if they fund both things by paying taxes. Thoreau points out that the same people who applaud soldiers for refusing to fight an unjust war are not themselves willing to refuse to fund the government that started the war.\nIn a constitutional republic like the United States, people often think that the proper response to an unjust law is to try to use the political process to change the law, but to obey and respect the law until it is changed. But if the law is itself clearly unjust, and the lawmaking process is not designed to quickly obliterate such unjust laws, then Thoreau says the law deserves no respect and it should be broken. In the case of the United States, the Constitution itself enshrines the institution of slavery, and therefore falls under this condemnation. Abolitionists, in Thoreau's opinion, should completely withdraw their support of the government and stop paying taxes, even if this means courting imprisonment.\n\nUnder a government which imprisons any unjustly, the true place for a just man is also a prison.… where the State places those who are not with her, but against her,– the only house in a slave State in which a free man can abide with honor.… Cast your whole vote, not a strip of paper merely, but your whole influence. A minority is powerless while it conforms to the majority; it is not even a minority then; but it is irresistible when it clogs by its whole weight. If the alternative is to keep all just men in prison, or give up war and slavery, the State will not hesitate which to choose. If a thousand men were not to pay their tax bills this year, that would not be a violent and bloody measure, as it would be to pay them, and enable the State to commit violence and shed innocent blood. This is, in fact, the definition of a peaceable revolution, if any such is possible.\n\nBecause the government will retaliate, Thoreau says he prefers living simply because he therefore has less to lose. \"I can afford to refuse allegiance to Massachusetts…. It costs me less in every sense to incur the penalty of disobedience to the State than it would to obey. I should feel as if I were worth less in that case.\"\nHe was briefly imprisoned for refusing to pay the poll tax, but even in jail felt freer than the people outside. He considered it an interesting experience and came out of it with a new perspective on his relationship to the government and its citizens. (He was released the next day when \"someone interfered, and paid that tax.\")\nThoreau said he was willing to pay the highway tax, which went to pay for something of benefit to his neighbors, but that he was opposed to taxes that went to support the government itself—even if he could not tell if his particular contribution would eventually be spent on an unjust project or a beneficial one. \"I simply wish to refuse allegiance to the State, to withdraw and stand aloof from it effectually.\"\nBecause government is man-made, not an element of nature or an act of God, Thoreau hoped that its makers could be reasoned with. As governments go, he felt, the U.S. government, with all its faults, was not the worst and even had some admirable qualities. But he felt we could and should insist on better. \"The progress from an absolute to a limited monarchy, from a limited monarchy to a democracy, is a progress toward a true respect for the individual.… Is a democracy, such as we know it, the last improvement possible in government? Is it not possible to take a step further towards recognizing and organizing the rights of man? There will never be a really free and enlightened State until the State comes to recognize the individual as a higher and independent power, from which all its own power and authority are derived, and treats him accordingly.\"\nAn aphorism sometimes attributed to either Thomas Jefferson or Thomas Paine, \"That government is best which governs least...\", was actually found in Thoreau's Civil Disobedience. Thoreau was paraphrasing the motto of The United States Magazine and Democratic Review: \"The best government is that which governs least.\" Thoreau expanded it significantly:\n\nI heartily accept the motto,—“That government is best which governs least;” and I should like to see it acted up to more rapidly and systematically. Carried out, it finally amounts to this, which I also believe,—“That government is best which governs not at all;” and when men are prepared for it, that will be the kind of government which they will have. Government is at best but an expedient; but most governments are usually, and all governments are sometimes, inexpedient.\n\n", "full_text": "Typed by Sameer Parekh (zane@ddsw1.MCS.COM)\n\n\n\n\n\nOn the Duty of Civil Disobedience\n\n\nby Henry David Thoreau\n\n\n[1849, original title:  Resistance to Civil Government]\n\n\nI heartily accept the motto, \"That government is best\nwhich governs least\"; and I should like to see it acted up\nto more rapidly and systematically.  Carried out, it finally\namounts to this, which also I believe--\"That government is\nbest which governs not at all\"; and when men are prepared\nfor it, that will be the kind of government which they will have.\nGovernment is at best but an expedient; but most governments\nare usually, and all governments are sometimes, inexpedient.\nThe objections which have been brought against a standing army,\nand they are many and weighty, and deserve to prevail,\nmay also at last be brought against a standing government.\nThe standing army is only an arm of the standing government.\nThe government itself, which is only the mode which the people\nhave chosen to execute their will, is equally liable to be abused\nand perverted before the people can act through it.  Witness the\npresent Mexican war, the work of comparatively a few individuals\nusing the standing government as their tool; for in the outset,\nthe people would not have consented to this measure.\n\nThis American government--what is it but a tradition,\nthough a recent one, endeavoring to transmit itself\nunimpaired to posterity, but each instant losing some of its\nintegrity?  It has not the vitality and force of a single\nliving man; for a single man can bend it to his will.  It is\na sort of wooden gun to the people themselves.  But it is\nnot the less necessary for this; for the people must have\nsome complicated machinery or other, and hear its din, to\nsatisfy that idea of government which they have.\nGovernments show thus how successfully men can be imposed\nupon, even impose on themselves, for their own advantage.\nIt is excellent, we must all allow.  Yet this government\nnever of itself furthered any enterprise, but by the alacrity\nwith which it got out of its way.  _It_ does not keep the\ncountry free.  _It_ does not settle the West.  _It_ does not\neducate.  The character inherent in the American people has\ndone all that has been accomplished; and it would have done\nsomewhat more, if the government had not sometimes got in\nits way.  For government is an expedient, by which men would\nfain succeed in letting one another alone; and, as has been\nsaid, when it is most expedient, the governed are most let\nalone by it.  Trade and commerce, if they were not made of\nindia-rubber, would never manage to bounce over obstacles\nwhich legislators are continually putting in their way;\nand if one were to judge these men wholly by the effects of\ntheir actions and not partly by their intentions, they would\ndeserve to be classed and punished with those mischievious\npersons who put obstructions on the railroads.\n\nBut, to speak practically and as a citizen, unlike those\nwho call themselves no-government men, I ask for, not\n_at once_ no government, but at once a better government.\nLet every man make known what kind of government would command\nhis respect, and that will be one step toward obtaining it.\n\nAfter all, the practical reason why, when the power is\nonce in the hands of the people, a majority are permitted,\nand for a long period continue, to rule is not because they\nare most likely to be in the right, nor because this seems\nfairest to the minority, but because they are physically the\nstrongest.  But a government in which the majority rule in\nall cases can not be based on justice, even as far as men\nunderstand it.  Can there not be a government in which the\nmajorities do not virtually decide right and wrong, but\nconscience?--in which majorities decide only those questions\nto which the rule of expediency is applicable?  Must the\ncitizen ever for a moment, or in the least degree, resign\nhis conscience to the legislator?  Why has every man a\nconscience then?  I think that we should be men first, and\nsubjects afterward.  It is not desirable to cultivate a\nrespect for the law, so much as for the right.  The only\nobligation which I have a right to assume is to do at any\ntime what I think right.  It is truly enough said that a\ncorporation has no conscience; but a corporation of\nconscientious men is a corporation _with_ a conscience.\nLaw never made men a whit more just; and, by means of their\nrespect for it, even the well-disposed are daily made the\nagents on injustice.  A common and natural result of an\nundue respect for the law is, that you may see a file of\nsoldiers, colonel, captain, corporal, privates,\npowder-monkeys, and all, marching in admirable order over\nhill and dale to the wars, against their wills, ay, against\ntheir common sense and consciences, which makes it very\nsteep marching indeed, and produces a palpitation of the heart.\nThey have no doubt that it is a damnable business in\nwhich they are concerned; they are all peaceably inclined.\nNow, what are they?  Men at all?  or small movable forts and\nmagazines, at the service of some unscrupulous man in power?\nVisit the Navy Yard, and behold a marine, such a man as an\nAmerican government can make, or such as it can make a man\nwith its black arts--a mere shadow and reminiscence of\nhumanity, a man laid out alive and standing, and already,\nas one may say, buried under arms with funeral accompaniment,\nthough it may be,\n\n    \"Not a drum was heard, not a funeral note,\n     As his corpse to the rampart we hurried;\n     Not a soldier discharged his farewell shot\n     O'er the grave where our hero we buried.\"\n\nThe mass of men serve the state thus, not as men mainly,\nbut as machines, with their bodies.  They are the standing army,\nand the militia, jailers, constables, posse comitatus, etc.\nIn most cases there is no free exercise whatever of the\njudgement or of the moral sense; but they put themselves\non a level with wood and earth and stones; and wooden men\ncan perhaps be manufactured that will serve the purpose as well.\nSuch command no more respect than men of straw or a lump of dirt.\nThey have the same sort of worth only as horses and dogs.\nYet such as these even are commonly esteemed good citizens.\nOthers--as most legislators, politicians, lawyers, ministers,\nand office-holders--serve the state chiefly with their heads;\nand, as they rarely make any moral distinctions, they are as\nlikely to serve the devil, without _intending_ it, as God.\nA very few--as heroes, patriots, martyrs, reformers in the\ngreat sense, and _men_--serve the state with their consciences\nalso, and so necessarily resist it for the most part; and\nthey are commonly treated as enemies by it.  A wise man will\nonly be useful as a man, and will not submit to be \"clay,\"\nand \"stop a hole to keep the wind away,\" but leave that\noffice to his dust at least:\n\n    \"I am too high born to be propertied,\n     To be a second at control,\n     Or useful serving-man and instrument\n     To any sovereign state throughout the world.\"\n\nHe who gives himself entirely to his fellow men appears\nto them useless and selfish; but he who gives himself\npartially to them is pronounced a benefactor and philanthropist.\n\nHow does it become a man to behave toward the American\ngovernment today?  I answer, that he cannot without disgrace\nbe associated with it.  I cannot for an instant recognize\nthat political organization as _my_ government which is the\n_slave's_ government also.\n\nAll men recognize the right of revolution; that is,\nthe right to refuse allegiance to, and to resist,\nthe government, when its tyranny or its inefficiency are\ngreat and unendurable.  But almost all say that such is not\nthe case now.  But such was the case, they think, in the\nRevolution of '75.  If one were to tell me that this was a\nbad government because it taxed certain foreign commodities\nbrought to its ports, it is most probable that I should\nnot make an ado about it, for I can do without them.\nAll machines have their friction; and possibly this does\nenough good to counter-balance the evil.  At any rate, it is\na great evil to make a stir about it.  But when the friction\ncomes to have its machine, and oppression and robbery are\norganized, I say, let us not have such a machine any longer.\nIn other words, when a sixth of the population of a nation\nwhich has undertaken to be the refuge of liberty are slaves,\nand a whole country is unjustly overrun and conquered by a\nforeign army, and subjected to military law, I think that it\nis not too soon for honest men to rebel and revolutionize.\nWhat makes this duty the more urgent is that fact that the\ncountry so overrun is not our own, but ours is the invading army.\n\nPaley, a common authority with many on moral questions,\nin his chapter on the \"Duty of Submission to Civil\nGovernment,\" resolves all civil obligation into expediency;\nand he proceeds to say that \"so long as the interest of the\nwhole society requires it, that is, so long as the established\ngovernment cannot be resisted or changed without public\ninconvenience, it is the will of God . . . that the\nestablished government be obeyed--and no longer.  This\nprinciple being admitted, the justice of every particular\ncase of resistance is reduced to a computation of the\nquantity of the danger and grievance on the one side, and of\nthe probability and expense of redressing it on the other.\"\nOf this, he says, every man shall judge for himself.\nBut Paley appears never to have contemplated those cases\nto which the rule of expediency does not apply, in which\na people, as well as an individual, must do justice, cost\nwhat it may.  If I have unjustly wrested a plank from a\ndrowning man, I must restore it to him though I drown myself.\nThis, according to Paley, would be inconvenient.\nBut he that would save his life, in such a case, shall lose it.\nThis people must cease to hold slaves, and to make war\non Mexico, though it cost them their existence as a people.\n\nIn their practice, nations agree with Paley; but does\nanyone think that Massachusetts does exactly what is right\nat the present crisis?\n\n    \"A drab of stat,\n     a cloth-o'-silver slut,\n     To have her train borne up,\n     and her soul trail in the dirt.\"\n\nPractically speaking, the opponents to a reform in\nMassachusetts are not a hundred thousand politicians at the\nSouth, but a hundred thousand merchants and farmers here,\nwho are more interested in commerce and agriculture than\nthey are in humanity, and are not prepared to do justice to\nthe slave and to Mexico, _cost what it may_.  I quarrel not\nwith far-off foes, but with those who, near at home,\nco-operate with, and do the bidding of, those far away, and\nwithout whom the latter would be harmless.  We are\naccustomed to say, that the mass of men are unprepared; but\nimprovement is slow, because the few are not as materially\nwiser or better than the many.  It is not so important that\nmany should be good as you, as that there be some absolute\ngoodness somewhere; for that will leaven the whole lump.\nThere are thousands who are _in opinion_ opposed to slavery\nand to the war, who yet in effect do nothing to put an end\nto them; who, esteeming themselves children of Washington\nand Franklin, sit down with their hands in their pockets,\nand say that they know not what to do, and do nothing; who\neven postpone the question of freedom to the question of\nfree trade, and quietly read the prices-current along with\nthe latest advices from Mexico, after dinner, and, it may\nbe, fall asleep over them both.  What is the price-current\nof an honest man and patriot today?  They hesitate, and they\nregret, and sometimes they petition; but they do nothing in\nearnest and with effect.  They will wait, well disposed, for\nothers to remedy the evil, that they may no longer have it to\nregret.  At most, they give up only a cheap vote, and a\nfeeble countenance and Godspeed, to the right, as it goes by\nthem.  There are nine hundred and ninety-nine patrons of\nvirtue to one virtuous man.  But it is easier to deal with\nthe real possessor of a thing than with the temporary\nguardian of it.\n\nAll voting is a sort of gaming, like checkers or\nbackgammon, with a slight moral tinge to it, a playing with\nright and wrong, with moral questions; and betting naturally\naccompanies it.  The character of the voters is not staked.\nI cast my vote, perchance, as I think right; but I am not\nvitally concerned that that right should prevail.  I am\nwilling to leave it to the majority.  Its obligation,\ntherefore, never exceeds that of expediency.  Even _voting\nfor the right_ is _doing_ nothing for it.  It is only\nexpressing to men feebly your desire that it should prevail.\nA wise man will not leave the right to the mercy of chance,\nnor wish it to prevail through the power of the majority.\nThere is but little virtue in the action of masses of men.\nWhen the majority shall at length vote for the abolition of\nslavery, it will be because they are indifferent to slavery,\nor because there is but little slavery left to be abolished\nby their vote.  _They_ will then be the only slaves.  Only _his_\nvote can hasten the abolition of slavery who asserts his own\nfreedom by his vote.\n\nI hear of a convention to be held at Baltimore, or\nelsewhere, for the selection of a candidate for the\nPresidency, made up chiefly of editors, and men who are\npoliticians by profession; but I think, what is it to any\nindependent, intelligent, and respectable man what decision\nthey may come to?  Shall we not have the advantage of this\nwisdom and honesty, nevertheless?  Can we not count upon\nsome independent votes?  Are there not many individuals in\nthe country who do not attend conventions?  But no:  I find\nthat the respectable man, so called, has immediately drifted\nfrom his position, and despairs of his country, when his\ncountry has more reasons to despair of him.  He forthwith\nadopts one of the candidates thus selected as the only\n_available_ one, thus proving that he is himself _available_\nfor any purposes of the demagogue.  His vote is of no more\nworth than that of any unprincipled foreigner or hireling\nnative, who may have been bought.  O for a man who is a man,\nand, as my neighbor says, has a bone in his back which you\ncannot pass your hand through! Our statistics are at fault:\nthe population has been returned too large.  How many _men_\nare there to a square thousand miles in the country?\nHardly one.  Does not America offer any inducement for men\nto settle here?  The American has dwindled into an Odd\nFellow--one who may be known by the development of his organ\nof gregariousness, and a manifest lack of intellect and\ncheerful self-reliance; whose first and chief concern, on\ncoming into the world, is to see that the almshouses are in\ngood repair; and, before yet he has lawfully donned the\nvirile garb, to collect a fund to the support of the widows\nand orphans that may be; who, in short, ventures to live\nonly by the aid of the Mutual Insurance company, which has\npromised to bury him decently.\n\nIt is not a man's duty, as a matter of course, to\ndevote himself to the eradication of any, even to most\nenormous wrong; he may still properly have other concerns\nto engage him; but it is his duty, at least, to wash his\nhands of it, and, if he gives it no thought longer, not to\ngive it practically his support.  If I devote myself to\nother pursuits and contemplations, I must first see, at\nleast, that I do not pursue them sitting upon another man's\nshoulders.  I must get off him first, that he may pursue his\ncontemplations too.  See what gross inconsistency is tolerated.\nI have heard some of my townsmen say, \"I should like to\nhave them order me out to help put down an insurrection\nof the slaves, or to march to Mexico--see if I would go\";\nand yet these very men have each, directly by their\nallegiance, and so indirectly, at least, by their money,\nfurnished a substitute.  The soldier is applauded who\nrefuses to serve in an unjust war by those who do not refuse\nto sustain the unjust government which makes the war;\nis applauded by those whose own act and authority he disregards\nand sets at naught; as if the state were penitent to that\ndegree that it hired one to scourge it while it sinned, but\nnot to that degree that it left off sinning for a moment.\nThus, under the name of Order and Civil Government, we are\nall made at last to pay homage to and support our own meanness.\nAfter the first blush of sin comes its indifference; and from\nimmoral it becomes, as it were, unmoral, and not quite unnecessary\nto that life which we have made.\n\nThe broadest and most prevalent error requires the most\ndisinterested virtue to sustain it.  The slight reproach to\nwhich the virtue of patriotism is commonly liable, the noble\nare most likely to incur.  Those who, while they disapprove\nof the character and measures of a government, yield to it\ntheir allegiance and support are undoubtedly its most\nconscientious supporters, and so frequently the most serious\nobstacles to reform.  Some are petitioning the State to\ndissolve the Union, to disregard the requisitions of the\nPresident.  Why do they not dissolve it themselves--the\nunion between themselves and the State--and refuse to pay\ntheir quota into its treasury?  Do not they stand in the same\nrelation to the State that the State does to the Union?  And\nhave not the same reasons prevented the State from resisting\nthe Union which have prevented them from resisting the State?\n\nHow can a man be satisfied to entertain an opinion merely,\nand enjoy _it_?  Is there any enjoyment in it, if his\nopinion is that he is aggrieved?  If you are cheated out of\na single dollar by your neighbor, you do not rest satisfied\nwith knowing you are cheated, or with saying that you are\ncheated, or even with petitioning him to pay you your due;\nbut you take effectual steps at once to obtain the full\namount, and see to it that you are never cheated again.\nAction from principle, the perception and the performance of\nright, changes things and relations; it is essentially\nrevolutionary, and does not consist wholly with anything\nwhich was.  It not only divided States and churches, it\ndivides families; ay, it divides the _individual_, separating\nthe diabolical in him from the divine.\n\nUnjust laws exist:  shall we be content to obey them, or\nshall we endeavor to amend them, and obey them until we have\nsucceeded, or shall we transgress them at once?  Men,\ngenerally, under such a government as this, think that they\nought to wait until they have persuaded the majority to\nalter them.  They think that, if they should resist, the\nremedy would be worse than the evil.  But it is the fault of\nthe government itself that the remedy is worse than the evil.\n_It_ makes it worse.  Why is it not more apt to anticipate and\nprovide for reform?  Why does it not cherish its wise minority?\nWhy does it cry and resist before it is hurt?  Why does it not\nencourage its citizens to put out its faults, and _do_ better\nthan it would have them?  Why does it always crucify Christ and\nexcommunicate Copernicus and Luther, and pronounce Washington\nand Franklin rebels?\n\nOne would think, that a deliberate and practical denial\nof its authority was the only offense never contemplated by\nits government; else, why has it not assigned its definite,\nits suitable and proportionate, penalty?  If a man who has\nno property refuses but once to earn nine shillings for the\nState, he is put in prison for a period unlimited by any law\nthat I know, and determined only by the discretion of those\nwho put him there; but if he should steal ninety times nine\nshillings from the State, he is soon permitted to go at\nlarge again.\n\nIf the injustice is part of the necessary friction of\nthe machine of government, let it go, let it go:  perchance\nit will wear smooth--certainly the machine will wear out.\nIf the injustice has a spring, or a pulley, or a rope, or a\ncrank, exclusively for itself, then perhaps you may consider\nwhether the remedy will not be worse than the evil; but if\nit is of such a nature that it requires you to be the agent\nof injustice to another, then I say, break the law.  Let\nyour life be a counter-friction to stop the machine.  What I\nhave to do is to see, at any rate, that I do not lend myself\nto the wrong which I condemn.\n\nAs for adopting the ways which the State has provided for\nremedying the evil, I know not of such ways.  They take too\nmuch time, and a man's life will be gone.  I have other\naffairs to attend to.  I came into this world, not chiefly\nto make this a good place to live in, but to live in it,\nbe it good or bad.  A man has not everything to do, but\nsomething; and because he cannot do _everything_, it is\nnot necessary that he should be doing _something_ wrong. It is\nnot my business to be petitioning the Governor\nor the Legislature any more than it is theirs to petition me;\nand if they should not hear my petition, what should I do then?\nBut in this case the State has provided no way:  its very\nConstitution is the evil.  This may seem to be harsh and\nstubborn and unconcilliatory; but it is to treat with the\nutmost kindness and consideration the only spirit that can\nappreciate or deserves it.  So is all change for the better,\nlike birth and death, which convulse the body.\n\nI do not hesitate to say, that those who call themselves\nAbolitionists should at once effectually withdraw\ntheir support, both in person and property, from the\ngovernment of Massachusetts, and not wait till they\nconstitute a majority of one, before they suffer the right\nto prevail through them.  I think that it is enough if they\nhave God on their side, without waiting for that other one.\nMoreover, any man more right than his neighbors constitutes\na majority of one already.\n\nI meet this American government, or its representative,\nthe State government, directly, and face to face, once a\nyear--no more--in the person of its tax-gatherer; this is\nthe only mode in which a man situated as I am necessarily\nmeets it; and it then says distinctly, Recognize me; and\nthe simplest, the most effectual, and, in the present\nposture of affairs, the indispensablest mode of treating\nwith it on this head, of expressing your little satisfaction\nwith and love for it, is to deny it then.  My civil\nneighbor, the tax-gatherer, is the very man I have to deal\nwith--for it is, after all, with men and not with parchment\nthat I quarrel--and he has voluntarily chosen to be an agent\nof the government.  How shall he ever know well that he is\nand does as an officer of the government, or as a man,\nuntil he is obliged to consider whether he will treat me,\nhis neighbor, for whom he has respect, as a neighbor and\nwell-disposed man, or as a maniac and disturber of the peace,\nand see if he can get over this obstruction to his\nneighborliness without a ruder and more impetuous thought or\nspeech corresponding with his action.  I know this well,\nthat if one thousand, if one hundred, if ten men whom I\ncould name--if ten _honest_ men only--ay, if _one_ HONEST man,\nin this State of Massachusetts, _ceasing to hold slaves_, were\nactually to withdraw from this co-partnership, and be locked\nup in the county jail therefor, it would be the abolition of\nslavery in America.  For it matters not how small the\nbeginning may seem to be:  what is once well done is done\nforever.  But we love better to talk about it:  that we say\nis our mission.  Reform keeps many scores of newspapers in\nits service, but not one man.  If my esteemed neighbor, the\nState's ambassador, who will devote his days to the\nsettlement of the question of human rights in the Council\nChamber, instead of being threatened with the prisons of\nCarolina, were to sit down the prisoner of Massachusetts,\nthat State which is so anxious to foist the sin of slavery\nupon her sister--though at present she can discover only an\nact of inhospitality to be the ground of a quarrel with\nher--the Legislature would not wholly waive the subject of\nthe following winter.\n\nUnder a government which imprisons unjustly, the true\nplace for a just man is also a prison.  The proper place\ntoday, the only place which Massachusetts has provided for\nher freer and less despondent spirits, is in her prisons, to\nbe put out and locked out of the State by her own act, as\nthey have already put themselves out by their principles.\nIt is there that the fugitive slave, and the Mexican\nprisoner on parole, and the Indian come to plead the wrongs\nof his race should find them; on that separate but more free\nand honorable ground, where the State places those who are\nnot _with_ her, but _against_ her--the only house in a slave\nState in which a free man can abide with honor.  If any\nthink that their influence would be lost there, and their\nvoices no longer afflict the ear of the State, that they\nwould not be as an enemy within its walls, they do not know\nby how much truth is stronger than error, nor how much more\neloquently and effectively he can combat injustice who has\nexperienced a little in his own person.  Cast your whole\nvote, not a strip of paper merely, but your whole influence.\nA minority is powerless while it conforms to the majority;\nit is not even a minority then; but it is irresistible when\nit clogs by its whole weight.  If the alternative is to keep\nall just men in prison, or give up war and slavery, the\nState will not hesitate which to choose.  If a thousand men\nwere not to pay their tax bills this year, that would not be\na violent and bloody measure, as it would be to pay them,\nand enable the State to commit violence and shed innocent\nblood.  This is, in fact, the definition of a peaceable\nrevolution, if any such is possible.  If the tax-gatherer,\nor any other public officer, asks me, as one has done, \"But\nwhat shall I do?\" my answer is, \"If you really wish to do\nanything, resign your office.\"  When the subject has refused\nallegiance, and the officer has resigned from office, then\nthe revolution is accomplished.  But even suppose blood\nshould flow. Is there not a sort of blood shed when the\nconscience is wounded?  Through this wound a man's real\nmanhood and immortality flow out, and he bleeds to an\neverlasting death.  I see this blood flowing now.\n\nI have contemplated the imprisonment of the offender,\nrather than the seizure of his goods--though both will serve\nthe same purpose--because they who assert the purest right,\nand consequently are most dangerous to a corrupt State,\ncommonly have not spent much time in accumulating property.\nTo such the State renders comparatively small service, and a\nslight tax is wont to appear exorbitant, particularly if\nthey are obliged to earn it by special labor with their hands.\nIf there were one who lived wholly without the use of money,\nthe State itself would hesitate to demand it of him.\nBut the rich man--not to make any invidious\ncomparison--is always sold to the institution which makes\nhim rich.  Absolutely speaking, the more money, the less\nvirtue; for money comes between a man and his objects, and\nobtains them for him; it was certainly no great virtue to\nobtain it.  It puts to rest many questions which he would\notherwise be taxed to answer; while the only new question\nwhich it puts is the hard but superfluous one, how to spend\nit.  Thus his moral ground is taken from under his feet.\nThe opportunities of living are diminished in proportion as\nthat are called the \"means\" are increased.  The best thing a\nman can do for his culture when he is rich is to endeavor to\ncarry out those schemes which he entertained when he was\npoor.  Christ answered the Herodians according to their\ncondition.  \"Show me the tribute-money,\" said he--and one\ntook a penny out of his pocket--if you use money which has\nthe image of Caesar on it, and which he has made current and\nvaluable, that is, _if you are men of the State_, and gladly\nenjoy the advantages of Caesar's government, then pay him\nback some of his own when he demands it.  \"Render therefore\nto Caesar that which is Caesar's and to God those things\nwhich are God's\"--leaving them no wiser than before as to\nwhich was which; for they did not wish to know.\n\nWhen I converse with the freest of my neighbors, I perceive that,\nwhatever they may say about the magnitude and seriousness\nof the question, and their regard for the public tranquillity,\nthe long and the short of the matter is, that they cannot\nspare the protection of the existing government,\nand they dread the consequences to their property and\nfamilies of disobedience to it.  For my own part, I should\nnot like to think that I ever rely on the protection of the\nState.  But, if I deny the authority of the State when it\npresents its tax bill, it will soon take and waste all my\nproperty, and so harass me and my children without end.\nThis is hard.  This makes it impossible for a man to live\nhonestly, and at the same time comfortably, in outward\nrespects.  It will not be worth the while to accumulate\nproperty; that would be sure to go again.  You must hire or\nsquat somewhere, and raise but a small crop, and eat that\nsoon.  You must live within yourself, and depend upon\nyourself always tucked up and ready for a start, and not\nhave many affairs.  A man may grow rich in Turkey even, if\nhe will be in all respects a good subject of the Turkish\ngovernment.  Confucius said:  \"If a state is governed by the\nprinciples of reason, poverty and misery are subjects of\nshame; if a state is not governed by the principles of\nreason, riches and honors are subjects of shame.\"  No:  until\nI want the protection of Massachusetts to be extended to me\nin some distant Southern port, where my liberty is\nendangered, or until I am bent solely on building up an\nestate at home by peaceful enterprise, I can afford to\nrefuse allegiance to Massachusetts, and her right to my\nproperty and life.  It costs me less in every sense to incur\nthe penalty of disobedience to the State than it would to obey.\nI should feel as if I were worth less in that case.\n\nSome years ago, the State met me in behalf of the\nChurch, and commanded me to pay a certain sum toward the\nsupport of a clergyman whose preaching my father attended,\nbut never I myself.  \"Pay,\" it said, \"or be locked up in the\njail.\"  I declined to pay.  But, unfortunately, another man\nsaw fit to pay it.  I did not see why the schoolmaster\nshould be taxed to support the priest, and not the priest\nthe schoolmaster; for I was not the State's schoolmaster,\nbut I supported myself by voluntary subscription.  I did not\nsee why the lyceum should not present its tax bill, and have\nthe State to back its demand, as well as the Church.\nHowever, at the request of the selectmen, I condescended to\nmake some such statement as this in writing:  \"Know all men\nby these presents, that I, Henry Thoreau, do not wish to be\nregarded as a member of any incorporated society which I\nhave not joined.\" This I gave to the town clerk; and he has\nit.  The State, having thus learned that I did not wish to be\nregarded as a member of that church, has never made a like\ndemand on me since; though it said that it must adhere to\nits original presumption that time.  If I had known how to\nname them, I should then have signed off in detail from all\nthe societies which I never signed on to; but I did not know\nwhere to find such a complete list.\n\nI have paid no poll tax for six years.  I was put into\na jail once on this account, for one night; and, as I stood\nconsidering the walls of solid stone, two or three feet\nthick, the door of wood and iron, a foot thick, and the iron\ngrating which strained the light, I could not help being\nstruck with the foolishness of that institution which\ntreated me as if I were mere flesh and blood and bones, to\nbe locked up.  I wondered that it should have concluded at\nlength that this was the best use it could put me to, and\nhad never thought to avail itself of my services in some\nway.  I saw that, if there was a wall of stone between me\nand my townsmen, there was a still more difficult one to\nclimb or break through before they could get to be as free\nas I was.  I did not for a moment feel confined, and the\nwalls seemed a great waste of stone and mortar.  I felt as\nif I alone of all my townsmen had paid my tax.  They plainly\ndid not know how to treat me, but behaved like persons who\nare underbred.  In every threat and in every compliment\nthere was a blunder; for they thought that my chief desire\nwas to stand the other side of that stone wall.  I could not\nbut smile to see how industriously they locked the door on\nmy meditations, which followed them out again without let or\nhindrance, and _they_ were really all that was dangerous.\nAs they could not reach me, they had resolved to punish\nmy body; just as boys, if they cannot come at some person\nagainst whom they have a spite, will abuse his dog.  I saw\nthat the State was half-witted, that it was timid as a lone\nwoman with her silver spoons, and that it did not know its\nfriends from its foes, and I lost all my remaining respect\nfor it, and pitied it.\n\nThus the state never intentionally confronts a man's\nsense, intellectual or moral, but only his body, his senses.\nIt is not armed with superior wit or honesty, but with\nsuperior physical strength.  I was not born to be forced.\nI will breathe after my own fashion.  Let us see who is the\nstrongest.  What force has a multitude?  They only can force\nme who obey a higher law than I.  They force me to become\nlike themselves.  I do not hear of _men_ being _forced_ to\nlive this way or that by masses of men.  What sort of life\nwere that to live?  When I meet a government which says to me,\n\"Your money or your life,\" why should I be in haste to give\nit my money?  It may be in a great strait, and not know what\nto do:  I cannot help that.  It must help itself; do as I do.\nIt is not worth the while to snivel about it.  I am not\nresponsible for the successful working of the machinery of\nsociety.  I am not the son of the engineer.  I perceive\nthat, when an acorn and a chestnut fall side by side, the\none does not remain inert to make way for the other, but\nboth obey their own laws, and spring and grow and flourish\nas best they can, till one, perchance, overshadows and\ndestroys the other.  If a plant cannot live according to\nnature, it dies; and so a man.\n\nThe night in prison was novel and interesting enough.\nThe prisoners in their shirtsleeves were enjoying a chat and\nthe evening air in the doorway, when I entered.  But the\njailer said, \"Come, boys, it is time to lock up\"; and so\nthey dispersed, and I heard the sound of their steps\nreturning into the hollow apartments.  My room-mate was\nintroduced to me by the jailer as \"a first-rate fellow and\nclever man.\"  When the door was locked, he showed me where\nto hang my hat, and how he managed matters there.  The rooms\nwere whitewashed once a month; and this one, at least, was\nthe whitest, most simply furnished, and probably neatest\napartment in town.  He naturally wanted to know where I came\nfrom, and what brought me there; and, when I had told him, I\nasked him in my turn how he came there, presuming him to be\nan honest man, of course; and as the world goes, I believe he\nwas.  \"Why,\" said he, \"they accuse me of burning a barn; but\nI never did it.\"  As near as I could discover, he had\nprobably gone to bed in a barn when drunk, and smoked his\npipe there; and so a barn was burnt.  He had the reputation\nof being a clever man, had been there some three months\nwaiting for his trial to come on, and would have to wait as\nmuch longer; but he was quite domesticated and contented,\nsince he got his board for nothing, and thought that he was\nwell treated.\n\nHe occupied one window, and I the other; and I saw that\nif one stayed there long, his principal business would be to\nlook out the window.  I had soon read all the tracts that\nwere left there, and examined where former prisoners had\nbroken out, and where a grate had been sawed off, and heard\nthe history of the various occupants of that room; for I\nfound that even there there was a history and a gossip which\nnever circulated beyond the walls of the jail.  Probably\nthis is the only house in the town where verses are\ncomposed, which are afterward printed in a circular form,\nbut not published.  I was shown quite a long list of young\nmen who had been detected in an attempt to escape, who\navenged themselves by singing them.\n\nI pumped my fellow-prisoner as dry as I could, for fear\nI should never see him again; but at length he showed me\nwhich was my bed, and left me to blow out the lamp.\n\nIt was like travelling into a far country, such as I\nhad never expected to behold, to lie there for one night.\nIt seemed to me that I never had heard the town clock strike\nbefore, nor the evening sounds of the village; for we slept\nwith the windows open, which were inside the grating.  It\nwas to see my native village in the light of the Middle\nAges, and our Concord was turned into a Rhine stream, and\nvisions of knights and castles passed before me.  They were\nthe voices of old burghers that I heard in the streets.  I\nwas an involuntary spectator and auditor of whatever was\ndone and said in the kitchen of the adjacent village inn--a\nwholly new and rare experience to me.  It was a closer view\nof my native town.  I was fairly inside of it.  I never had\nseen its institutions before.  This is one of its peculiar\ninstitutions; for it is a shire town.  I began to comprehend\nwhat its inhabitants were about.\n\nIn the morning, our breakfasts were put through the hole\nin the door, in small oblong-square tin pans, made to fit,\nand holding a pint of chocolate, with brown bread, and\nan iron spoon.  When they called for the vessels again,\nI was green enough to return what bread I had left, but my\ncomrade seized it, and said that I should lay that up for\nlunch or dinner.  Soon after he was let out to work at\nhaying in a neighboring field, whither he went every day,\nand would not be back till noon; so he bade me good day,\nsaying that he doubted if he should see me again.\n\nWhen I came out of prison--for some one interfered, and\npaid that tax--I did not perceive that great changes had\ntaken place on the common, such as he observed who went in a\nyouth and emerged a gray-headed man; and yet a change had\ncome to my eyes come over the scene--the town, and State,\nand country, greater than any that mere time could effect.\nI saw yet more distinctly the State in which I lived.  I saw\nto what extent the people among whom I lived could be\ntrusted as good neighbors and friends; that their friendship\nwas for summer weather only; that they did not greatly\npropose to do right; that they were a distinct race from me\nby their prejudices and superstitions, as the Chinamen and\nMalays are; that in their sacrifices to humanity they ran no\nrisks, not even to their property; that after all they were\nnot so noble but they treated the thief as he had treated\nthem, and hoped, by a certain outward observance and a few\nprayers, and by walking in a particular straight though\nuseless path from time to time, to save their souls.\nThis may be to judge my neighbors harshly; for I believe\nthat many of them are not aware that they have such an\ninstitution as the jail in their village.\n\nIt was formerly the custom in our village, when a poor\ndebtor came out of jail, for his acquaintances to salute\nhim, looking through their fingers, which were crossed to\nrepresent the jail window, \"How do ye do?\" My neighbors did\nnot thus salute me, but first looked at me, and then at one\nanother, as if I had returned from a long journey.  I was\nput into jail as I was going to the shoemaker's to get a\nshoe which was mended.  When I was let out the next morning,\nI proceeded to finish my errand, and, having put on my\nmended shoe, joined a huckleberry party, who were impatient\nto put themselves under my conduct; and in half an hour--for\nthe horse was soon tackled--was in the midst of a\nhuckleberry field, on one of our highest hills, two miles\noff, and then the State was nowhere to be seen.\n\nThis is the whole history of \"My Prisons.\"\n\nI have never declined paying the highway tax, because I\nam as desirous of being a good neighbor as I am of being a\nbad subject; and as for supporting schools, I am doing my\npart to educate my fellow countrymen now.  It is for no\nparticular item in the tax bill that I refuse to pay it.  I\nsimply wish to refuse allegiance to the State, to withdraw\nand stand aloof from it effectually.  I do not care to trace\nthe course of my dollar, if I could, till it buys a man or a\nmusket to shoot one with--the dollar is innocent--but I am\nconcerned to trace the effects of my allegiance.  In fact, I\nquietly declare war with the State, after my fashion, though\nI will still make use and get what advantages of her I can,\nas is usual in such cases.\n\nIf others pay the tax which is demanded of me, from a\nsympathy with the State, they do but what they have already\ndone in their own case, or rather they abet injustice to a\ngreater extent than the State requires.  If they pay the tax\nfrom a mistaken interest in the individual taxed, to save\nhis property, or prevent his going to jail, it is because\nthey have not considered wisely how far they let their\nprivate feelings interfere with the public good.\n\nThis, then, is my position at present.  But one cannot be too\nmuch on his guard in such a case, lest his actions be biased\nby obstinacy or an undue regard for the opinions of men.\nLet him see that he does only what belongs to himself and\nto the hour.\n\nI think sometimes, Why, this people mean well, they are\nonly ignorant; they would do better if they knew how:  why\ngive your neighbors this pain to treat you as they are not\ninclined to?  But I think again, This is no reason why I\nshould do as they do, or permit others to suffer much\ngreater pain of a different kind.  Again, I sometimes say to\nmyself, When many millions of men, without heat, without ill\nwill, without personal feelings of any kind, demand of you a\nfew shillings only, without the possibility, such is their\nconstitution, of retracting or altering their present\ndemand, and without the possibility, on your side, of appeal\nto any other millions, why expose yourself to this\noverwhelming brute force?  You do not resist cold and\nhunger, the winds and the waves, thus obstinately; you\nquietly submit to a thousand similar necessities.  You do\nnot put your head into the fire.  But just in proportion as\nI regard this as not wholly a brute force, but partly a\nhuman force, and consider that I have relations to those\nmillions as to so many millions of men, and not of mere\nbrute or inanimate things, I see that appeal is possible,\nfirst and instantaneously, from them to the Maker of them,\nand, secondly, from them to themselves.  But if I put my\nhead deliberately into the fire, there is no appeal to fire\nor to the Maker of fire, and I have only myself to blame.\nIf I could convince myself that I have any right to be\nsatisfied with men as they are, and to treat them\naccordingly, and not according, in some respects, to my\nrequisitions and expectations of what they and I ought to\nbe, then, like a good Mussulman and fatalist, I should\nendeavor to be satisfied with things as they are, and say it\nis the will of God.  And, above all, there is this\ndifference between resisting this and a purely brute or\nnatural force, that I can resist this with some effect; but\nI cannot expect, like Orpheus, to change the nature of the\nrocks and trees and beasts.\n\nI do not wish to quarrel with any man or nation.  I do\nnot wish to split hairs, to make fine distinctions, or set\nmyself up as better than my neighbors.  I seek rather, I may\nsay, even an excuse for conforming to the laws of the land.\nI am but too ready to conform to them.  Indeed, I have\nreason to suspect myself on this head; and each year, as the\ntax-gatherer comes round, I find myself disposed to review\nthe acts and position of the general and State governments,\nand the spirit of the people to discover a pretext for conformity.\n\n    \"We must affect our country as our parents,\n     And if at any time we alienate\n     Our love of industry from doing it honor,\n     We must respect effects and teach the soul\n     Matter of conscience and religion,\n     And not desire of rule or benefit.\"\n\nI believe that the State will soon be able to take all my\nwork of this sort out of my hands, and then I shall be no\nbetter patriot than my fellow-countrymen.  Seen from a lower\npoint of view, the Constitution, with all its faults, is\nvery good; the law and the courts are very respectable; even\nthis State and this American government are, in many\nrespects, very admirable, and rare things, to be thankful\nfor, such as a great many have described them; seen from a\nhigher still, and the highest, who shall say what they are,\nor that they are worth looking at or thinking of at all?\n\nHowever, the government does not concern me much, and I shall\nbestow the fewest possible thoughts on it.  It is not many\nmoments that I live under a government, even in this world.\nIf a man is thought-free, fancy-free, imagination-free,\nthat which _is not_ never for a long time appearing _to be_\nto him, unwise rulers or reformers cannot fatally interrupt him.\n\nI know that most men think differently from myself; but\nthose whose lives are by profession devoted to the study of\nthese or kindred subjects content me as little as any.\nStatesmen and legislators, standing so completely within the\ninstitution, never distinctly and nakedly behold it.\nThey speak of moving society, but have no resting-place\nwithout it.  They may be men of a certain experience and\ndiscrimination, and have no doubt invented ingenious and\neven useful systems, for which we sincerely thank them;\nbut all their wit and usefulness lie within certain not very\nwide limits.  They are wont to forget that the world is not\ngoverned by policy and expediency.  Webster never goes behind\ngovernment, and so cannot speak with authority about it.\nHis words are wisdom to those legislators who contemplate no\nessential reform in the existing government; but for thinkers,\nand those who legislate for all time, he never once glances\nat the subject.  I know of those whose serene and wise\nspeculations on this theme would soon reveal the limits\nof his mind's range and hospitality.  Yet, compared with\nthe cheap professions of most reformers, and the still\ncheaper wisdom and eloquence of politicians in general,\nhis are almost the only sensible and valuable words,\nand we thank Heaven for him.  Comparatively, he is always\nstrong, original, and, above all, practical.  Still, his\nquality is not wisdom, but prudence.  The lawyer's truth\nis not Truth, but consistency or a consistent expediency.\nTruth is always in harmony with herself, and is not\nconcerned chiefly to reveal the justice that may consist\nwith wrong-doing.  He well deserves to be called, as he has\nbeen called, the Defender of the Constitution.  There are\nreally no blows to be given him but defensive ones.  He is\nnot a leader, but a follower.  His leaders are the men of\n'87.  \"I have never made an effort,\" he says, \"and never\npropose to make an effort; I have never countenanced an\neffort, and never mean to countenance an effort, to disturb\nthe arrangement as originally made, by which various States\ncame into the Union.\"  Still thinking of the sanction which\nthe Constitution gives to slavery, he says, \"Because it was\npart of the original compact--let it stand.\"\nNotwithstanding his special acuteness and ability, he is\nunable to take a fact out of its merely political relations,\nand behold it as it lies absolutely to be disposed of by the\nintellect--what, for instance, it behooves a man to do here\nin American today with regard to slavery--but ventures, or\nis driven, to make some such desperate answer to the\nfollowing, while professing to speak absolutely, and as a\nprivate man--from which what new and singular of social\nduties might be inferred?  \"The manner,\" says he, \"in which\nthe governments of the States where slavery exists are to\nregulate it is for their own consideration, under the\nresponsibility to their constituents, to the general laws of\npropriety, humanity, and justice, and to God.  Associations\nformed elsewhere, springing from a feeling of humanity, or\nany other cause, have nothing whatever to do with it.  They\nhave never received any encouragement from me and they never\nwill.\"  [These extracts have been inserted since the lecture\nwas read -HDT]\n\nThey who know of no purer sources of truth, who have\ntraced up its stream no higher, stand, and wisely stand, by\nthe Bible and the Constitution, and drink at it there with\nreverence and humanity; but they who behold where it comes\ntrickling into this lake or that pool, gird up their loins\nonce more, and continue their pilgrimage toward its\nfountainhead.\n\nNo man with a genius for legislation has appeared in America.\nThey are rare in the history of the world.  There are orators,\npoliticians, and eloquent men, by the thousand; but the\nspeaker has not yet opened his mouth to speak who is\ncapable of settling the much-vexed questions of the day.\nWe love eloquence for its own sake, and not for any truth\nwhich it may utter, or any heroism it may inspire.  Our\nlegislators have not yet learned the comparative value of\nfree trade and of freedom, of union, and of rectitude, to a\nnation.  They have no genius or talent for comparatively\nhumble questions of taxation and finance, commerce and\nmanufactures and agriculture.  If we were left solely to the\nwordy wit of legislators in Congress for our guidance,\nuncorrected by the seasonable experience and the effectual\ncomplaints of the people, America would not long retain her\nrank among the nations.  For eighteen hundred years, though\nperchance I have no right to say it, the New Testament has\nbeen written; yet where is the legislator who has wisdom and\npractical talent enough to avail himself of the light which\nit sheds on the science of legislation.\n\nThe authority of government, even such as I am willing\nto submit to--for I will cheerfully obey those who know and\ncan do better than I, and in many things even those who\nneither know nor can do so well--is still an impure one:  to\nbe strictly just, it must have the sanction and consent of\nthe governed.  It can have no pure right over my person and\nproperty but what I concede to it.  The progress from an\nabsolute to a limited monarchy, from a limited monarchy to a\ndemocracy, is a progress toward a true respect for the\nindividual.  Even the Chinese philosopher was wise enough to\nregard the individual as the basis of the empire.  Is a\ndemocracy, such as we know it, the last improvement possible\nin government?  Is it not possible to take a step further\ntowards recognizing and organizing the rights of man?  There\nwill never be a really free and enlightened State until the\nState comes to recognize the individual as a higher and\nindependent power, from which all its own power and\nauthority are derived, and treats him accordingly.  I please\nmyself with imagining a State at last which can afford to be\njust to all men, and to treat the individual with respect as\na neighbor; which even would not think it inconsistent with\nits own repose if a few were to live aloof from it, not\nmeddling with it, nor embraced by it, who fulfilled all the\nduties of neighbors and fellow men.  A State which bore this\nkind of fruit, and suffered it to drop off as fast as it\nripened, would prepare the way for a still more perfect and\nglorious State, which I have also imagined, but not yet\nanywhere seen.", "title": "On the Duty of Civil Disobedience"}