{"summary": "\n               LYSISTRATA\n    There are a lot of things about us women\n    That sadden me, considering how men\n    See us as rascals.\n               CALONICE\n                        As indeed we are!\n\nThese lines, spoken by Lysistrata and her friend Calonice at the beginning of the play, set the scene for the action that follows. Women, as represented by Calonice, are sly hedonists in need of firm guidance and direction. Lysistrata however is an extraordinary woman with a large sense of individual responsibility. She has convened a meeting of women from various city states in Greece (there is no mention of how she managed this feat) and, very soon after confiding in her friend about her concerns for the female sex, the women begin arriving.\nWith support from Lampito, the Spartan, Lysistrata persuades the other women to withhold sexual privileges from their menfolk as a means of forcing them to end the interminable Peloponnesian War. The women are very reluctant but the deal is sealed with a solemn oath around a wine bowl, Lysistrata choosing the words and Calonice repeating them on behalf of the other women. It is a long and detailed oath, in which the women abjure all their sexual pleasures, including the Lioness on the Cheese Grater (a sexual position).\nSoon after the oath is finished, a cry of triumph is heard from the nearby Acropolis—the old women of Athens have seized control of it at Lysistrata's instigation, since it holds the state treasury, without which the men cannot long continue to fund their war. Lampito goes off to spread the word of revolt and the other women retreat behind the barred gates of the Acropolis to await the men's response.\nA Chorus of Old Men arrives, intent on burning down the gate of the Acropolis if the women don't open up. Encumbered with heavy timbers, inconvenienced with smoke and burdened with old age, they are still making preparations to assault the gate when a Chorus of Old Women arrives, bearing pitchers of water. The Old Women complain about the difficulty they had getting the water but they are ready for a fight in defense of their younger comrades. Threats are exchanged, water beats fire and the Old Men are discomfited with a soaking.\nThe magistrate then arrives with some Scythian archers (the Athenian version of police constables). He reflects on the hysterical nature of women, their devotion to wine, promiscuous sex and exotic cults (such as to Sabazius and Adonis) but above all he blames men for poor supervision of their womenfolk. He has come for silver from the state treasury to buy oars for the fleet and he instructs his Scythians to begin levering open the gate. However, they are quickly overwhelmed by groups of unruly women with such unruly names as σπερμαγοραιολεκιθολαχανοπώλιδες (seed-market-porridge-vegetable-sellers) and σκοροδοπανδοκευτριαρτοπώλιδες (garlic-innkeeping-bread-sellers).\nLysistrata restores order and she allows the magistrate to question her. She explains to him the frustrations women feel at a time of war when the men make stupid decisions that affect everyone, and their wives' opinions are not listened to. She drapes her headdress over him, gives him a basket of wool and tells him that war will be a woman's business from now on. She then explains the pity she feels for young, childless women, ageing at home while the men are away on endless campaigns. When the magistrate points out that men also age, she reminds him that men can marry at any age whereas a woman has only a short time before she is considered too old. She then dresses the magistrate like a corpse for laying out, with a wreath and a fillet, and advises him that he's dead. Outraged at these indignities, he storms off to report the incident to his colleagues, while Lysistrata returns to the Acropolis.\nThe debate or agon is continued between the Chorus of Old Men and the Chorus of Old Women until Lysistrata returns to the stage with some news—her comrades are desperate for sex and they are beginning to desert on the silliest pretexts (for example, one woman says she has to go home to air her fabrics by spreading them on the bed). After rallying her comrades and restoring their discipline, Lysistrata again returns to the Acropolis to continue waiting for the men's surrender.\nA man soon appears, desperate for sex. It is Kinesias, the husband of Myrrhine. Lysistrata instructs her to torture him and Myrrhine then informs Kinesias that she can't have sex with him until he stops the war. He promptly agrees to these terms and the young couple prepares for sex on the spot. Myrrhine fetches a bed, then a mattress, then a pillow, then a blanket, then a flask of oil, exasperating her husband with delays until finally disappointing him completely by locking herself in the Acropolis again. The Chorus of Old Men commiserates with the young man in a plaintive song.\nA Spartan herald then appears with a large burden (an erection) scarcely hidden inside his tunic and he requests to see the ruling council to arrange peace talks. The magistrate, now also sporting a prodigious burden, laughs at the herald's embarrassing situation but agrees that peace talks should begin.\nThey go off to fetch the delegates; and, while they are gone, the Old Women make overtures to the Old Men. The Old Men are content to be comforted and fussed over by the Old Women; and thereupon the two Choruses merge, singing and dancing in unison. Peace talks commence and Lysistrata introduces the Spartan and Athenian delegates to a gorgeous young woman called Reconciliation. The delegates cannot take their eyes off the young woman; and meanwhile, Lysistrata scolds both sides for past errors of judgment. The delegates briefly squabble over the peace terms; but, with Reconciliation before them and the burden of sexual deprivation still heavy upon them, they quickly overcome their differences and retire to the Acropolis for celebrations.\nAnother choral song follows; and, after a bit of humorous dialogue between drunken dinner guests, the celebrants all return to the stage for a final round of songs, the men and women dancing together.\n\n", "full_text": "LYSISTRATA\n\n\nTranslated from the Greek of\n\nARISTOPHANES\n\nIllustrations by Norman Lindsay\n\n\n\n\nFOREWORD\n\n_Lysistrata_ is the greatest work by Aristophanes. This blank and rash\nstatement is made that it may be rejected. But first let it be\nunderstood that I do not mean it is a better written work than the\n_Birds_ or the _Frogs_, or that (to descend to the scale of values that\nwill be naturally imputed to me) it has any more appeal to the\ncollectors of \"curious literature\" than the _Ecclesiazusae_ or the\n_Thesmophoriazusae_. On the mere grounds of taste I can see an at least\nequally good case made out for the _Birds_. That brightly plumaged\nfantasy has an aerial wit and colour all its own. But there are certain\nworks in which a man finds himself at an angle of vision where there is\nan especially felicitous union of the aesthetic and emotional elements\nwhich constitute the basic qualities of his uniqueness. We recognize\nthese works as being welded into a strange unity, as having a\nhomogeneous texture of ecstasy over them that surpasses any aesthetic\nsurface of harmonic colour, though that harmony also is understood by\nthe deeper welling of imagery from the core of creative exaltation. And\nI think that this occurs in _Lysistrata_. The intellectual and spiritual\ntendrils of the poem are more truly interwoven, the operation of their\ncentres more nearly unified; and so the work goes deeper into life. It\nis his greatest play because of this, because it holds an intimate\nperfume of femininity and gives the finest sense of the charm of a\ncluster of girls, the sweet sense of their chatter, and the contact of\ntheir bodies, that is to be found before Shakespeare, because that\nmocking gaiety we call Aristophanies reaches here its most positive\nacclamation of life, vitalizing sex with a deep delight, a rare\nhappiness of the spirit.\n\nIndeed it is precisely for these reasons that it is _not_ considered\nAristophanes' greatest play.\n\nTo take a case which is sufficiently near to the point in question, to\nmake clear what I mean: the supremacy of _Antony and Cleopatra_ in the\nShakespearean aesthetic is yet jealously disputed, and it seems silly to\nthe academic to put it up against a work like _Hamlet_. But it is the\ncomparatively more obvious achievement of _Hamlet_, its surface\nintellectuality, which made it the favourite of actors and critics. It\nis much more difficult to realize the complex and delicately passionate\nedge of the former play's rhythm, its tides of hugely wandering emotion,\nthe restless, proud, gay, and agonized reaction from life, of the blood,\nof the mind, of the heart, which is its unity, than to follow the\nrelatively straightforward definition of Hamlet's nerves. Not that\nanything derogatory to _Hamlet_ or the _Birds_ is intended; but the\nvalue of such works is not enhanced by forcing them into contrast with\nother works which cover deeper and wider nexus of aesthetic and\nspiritual material. It is the very subtlety of the vitality of such\nworks as _Antony and Cleopatra_ and _Lysistrata_ that makes it so easy\nto undervalue them, to see only a phallic play and political pamphlet in\none, only a chronicle play in a grandiose method in the other. For we\nhave to be in a highly sensitized condition before we can get to that\nsubtle point where life and the image mix, and so really perceive the\nwork at all; whereas we can command the response to a lesser work which\ndoes not call so finely on the full breadth and depth of our spiritual\nresources.\n\nI amuse myself at times with the fancy that Homer, Sappho, and\nAristophanes are the inviolable Trinity of poetry, even to the extent of\nbeing reducible to One. For the fiery and lucid directness of Sappho, if\nher note of personal lyricism is abstracted, is seen to be an element of\nHomer, as is the profoundly balanced humour of Aristophanes, at once\ntenderly human and cruelly hard, as of a god to whom all sympathies and\ntolerances are known, but who is invulnerable somewhere, who sees from a\npoint in space where the pressure of earth's fear and pain, and so its\npity, is lifted. It is here that the Shakespearean and Homeric worlds\nimpinge and merge, not to be separated by any academic classifications.\nThey meet in this sensitivity equally involved and aloof, sympathetic\nand arrogant, suffering and joyous; and in this relation we see\nAristophanes as the forerunner of Shakespeare, his only one. We see also\nthat the whole present aesthetic of earth is based in Homer. We live and\ngrow in the world of consciousness bequeathed to us by him; and if we\ngrow beyond it through deeper Shakespearean ardours, it is because those\nbeyond are rooted in the broad basis of the Homeric imagination. To\nshift that basis is to find the marshes of primitive night and fear\nalone beneath the feet: Christianity.\n\nAnd here we return to the question of the immorality of _Lysistrata_.\nFirst we may inquire: is it possible for a man whose work has so\ntremendous a significance in the spiritual development of mankind--and I\ndo not think anyone nowadays doubts that a work of art is the sole\nstabilizing force that exists for life--is it possible for a man who\nstands so grandly at head of an immense stream of liberating effort to\nwrite an immoral work? Surely the only enduring moral virtue which can\nbe claimed is for that which moves to more power, beauty and delight in\nthe future? The plea that the question of changing customs arises is not\nvalid, for customs ratified by Aristophanes, by Rabelais, by\nShakespeare, have no right to change. If they have changed, let us try\nimmediately to return from our disgraceful refinements to the nobler and\nmore rarefied heights of lyric laughter, tragic intensity, and wit, for\nwe cannot have the first two without the last. And anyhow, how can a\nsocial custom claim precedence over the undying material of the senses\nand the emotions of man, over the very generating forces of life?\n\nHow could the humanistic emotions, such as pity, justice, sympathy,\nexist save as pacifistic quietings of the desire to slay, to hurt, to\ntorment. Where the desire to hurt is gone pity ceases to be a\nsignificant, a central emotion. It must of course continue to exist, but\nit is displaced in the spiritual hierarchy; and all that moves\ncourageously, desirously, and vitally into the action of life takes on a\ndeeper and subtler intention. Lust, then, which on the lower plane was\nsomething to be very frightened of, becomes a symbol of the highest\nspirituality. It is right for Paul to be terrified of sex and so to hate\nit, because he has so freshly escaped a bestial condition of life that\nit threatens to plunge him back if he listens to one whisper But it is\nalso right for a Shakespeare to suck every drop of desire from life,\nfor he is building into a higher condition, one self-willed,\nself-responsible, the discipline of which comes from joy, not fear.\n\nSex, therefore, is an animal function, one admits, one insists; it may\nbe only that. But also in the bewildering and humorous and tragic\nduality of all life's energies, it is the bridge to every eternity which\nis not merely a spectral condition of earth disembowelled of its lusts.\nFor sex holds the substance of the image. But we must remember with\nHeine that Aristophanes is the God of this ironic earth, and that all\nargument is apparently vitiated from the start by the simple fact that\nWagner and a rooster are given an analogous method of making love. And\ntherefore it seems impeccable logic to say that all that is most unlike\nthe rooster is the most spiritual part of love. All will agree on that,\nschisms only arise when one tries to decide what does go farthest from\nthe bird's automatic mechanism. Certainly not a Dante-Beatrice affair\nwhich is only the negation of the rooster in terms of the swooning\nbombast of adolescence, the first onslaught of a force which the\nsufferer cannot control or inhabit with all the potentialities of his\nbody and soul. But the rooster is troubled by no dreams of a divine\norgy, no carnival-loves like Beethoven's _Fourth Symphony_, no heroic\nand shining lust gathering and swinging into a merry embrace like the\nthird act of _Siegfried_. It is desire in this sense that goes farthest\nfrom the animal.\n\nConsciously, no one can achieve the act of love on earth as a completed\nthing of grace, with whatever delirium of delight, with whatever\ningenious preciosity, we go through its process. Only as an image of\nbeauty mated in some strange hermaphroditic ecstasy is that possible. I\nmean only as a dream projected into a hypothetical, a real heaven. But\non earth we cannot complete the cycle in consciousness that would give\nus the freedom of an image in which two identities mysteriously realize\ntheir separate unities by the absorption of a third thing, the\nconstructive rhythm of a work of art. It is thus that Tristan and Isolde\nbecome wholly distinct individuals, yet wholly submerged in the unity\nthat is Wagner; and so reconcile life's duality by balancing its\nopposing laughters in a definite form--thereby sending out into life a\nprofounder duality than existed before. A Platonic equipoise,\nNietzsche's Eternal Recurrence--the only real philosophic problem,\ntherefore one of which these two philosophers alone are aware.\n\nBut though Wagner with Mathilde Wesendonck in his arms was Tristan in\nthe arms of Isolde, he did not find a melody instead of a kiss on his\nlips; he did not find a progression of harmonies melting through the\ncontours of a warm beauty with a blur of desperate ecstasies, semitones\nof desire, he found only the anxious happiness of any other lover.\nNevertheless, he was gathering the substance of the second act of\n_Tristan und Isolde_. And it is this that Plato means when he says that\nfornication is something immortal in mortality. He does not mean that\nthe act itself is a godlike thing, a claim which any bedroom mirror\nwould quickly deride. He means that it is a symbol, an essential\ncondition, and a part of something that goes deeper into life than any\ngeometry of earth's absurd, passionate, futile, and very necessary\nantics would suggest.\n\nIt is a universal fallacy that because works like the comedies of\nAristophanes discuss certain social or ethical problems, they are\ninspired by them. Aristophanes wrote to express his vision on life, his\ndelight in life itself seen behind the warping screen of contemporary\nevent; and for his purposes anything from Euripides to Cleon served as\nground work. Not that he would think in those terms, naturally: but the\nrationalizing process that goes on in consciousness during the creation\nof a work of art, for all its appearance of directing matters, is the\nmerest weathercock in the wind of the subconscious intention. As an\nexample of how utterly it is possible to misunderstand the springs of\ninspiration in a poem, we may take the following remark of B. B. Rogers:\n_It is much to be regretted that the phallus element should be so\nconspicuous in this play.... (This) coarseness, so repulsive to\nourselves, was introduced, it is impossible to doubt, for the express\npurpose of counter-balancing the extreme earnestness and gravity of the\nplay_. It seems so logical, so irrefutable; and so completely\nmisinterprets every creative force of Aristophanes' Psyche that it\ncertainly deserves a little admiration. It is in the best academic\ntradition, and everyone respects a man for writing so mendaciously. The\neffort of these castrators is always to show that the parts considered\noffensive are not the natural expression of the poet, that they are\ndictated externally. They argue that Shakespeare's coarseness is the\nresult of the age and not personal predilection, completely ignoring the\nwork of men like Sir Philip Sidney and Spenser, indeed practically all\nthe pre-Shakespearean writers, in whom none of this so-called grossness\nexists. Shakespeare wrote sculduddery because he liked it, and for no\nother reason; his sensuality is the measure of his vitality. These liars\npretend similarly that because Rabelais had a humanistic reason for much\nof his work--the destructior Mediaevalism, and the Church, which purpose\nthey construe of course as an effort to purify, etc.--therefore he only\nput the lewdery to make the rest palatable, when it should be obvious\neven to an academic how he glories in his wild humour.\n\nWhat the academic cannot understand is that in such works, while\nattacking certain conditions, the creative power of the vigorous spirits\nis so great that it overflows and saturates the intellectual conception\nwith their own passionate sense of life. It is for this reason that\nthese works have an eternal significance. If Rabelais were merely a\nsocial reformer, then the value of his work would not have outlived his\ngeneration. If _Lysistrata_ were but a wise political tract, it would\nhave merely an historical interest, and it would have ceased spiritually\nat 404 B.C.\n\nBut Panurge is as fantastic and fascinating a character now as he was\n300 years ago, Lysistrata and her girls as freshly bodied as any girl\nkissed to-day. Therefore the serious part of the play is that which\ndeals with them, the frivolous part that in which Rogers detects gravity\nand earnestness.\n\nAristophanes is the lord of all who take life as a gay adventure, who\ndefy all efforts to turn life into a social, economic, or moral\nabstraction. Is it therefore just that the critics who, by some dark\ninstinct, unerringly pick out the exact opposite of any creator's real\nvirtues as his chief characteristics, should praise him as an idealistic\nreformer? An \"ideal\" state of society was the last thing Aristophanes\ndesired. He wished, certainly, to eliminate inhumanities and baseness;\nbut only that there might be free play for laughter, for individual\nhappiness.\n\nConsequently the critics lay the emphasis on the effort to cleanse\nsociety, not the method of laughter. Aristophanes wished to destroy\nCleon because that demagogue failed to realize the poet's conception of\ndignified government and tended to upset the stability of Hellas. But it\nwas the stability of life, the vindication of all individual freedoms,\nin which he was ultimately interested.\n\nJACK LINDSAY.\n\n\n       *       *       *       *       *\n\n\nLYSISTRATA\n\nThe Persons of the drama.\n\nLYSISTRATA\nCALONICE\nMYRRHINE\nLAMPITO\nStratyllis, etc.\nChorus of Women.\nMAGISTRATE\nCINESIAS\nSPARTAN HERALD\nENVOYS\nATHENIANS\nPorter, Market Idlers, etc.\nChorus of old Men.\n\n\nLYSISTRATA _stands alone with the Propylaea at her back._\n\n\nLYSISTRATA\n\nIf they were trysting for a Bacchanal,\nA feast of Pan or Colias or Genetyllis,\nThe tambourines would block the rowdy streets,\nBut now there's not a woman to be seen\nExcept--ah, yes--this neighbour of mine yonder.\n\n_Enter_ CALONICE.\n\nGood day Calonice.\n\nCALONICE\n\nGood day Lysistrata.\nBut what has vexed you so? Tell me, child.\nWhat are these black looks for? It doesn't suit you\nTo knit your eyebrows up glumly like that.\n\nLYSISTRATA\n\nCalonice, it's more than I can bear,\nI am hot all over with blushes for our sex.\nMen say we're slippery rogues--\n\nCALONICE\n\nAnd aren't they right?\n\nLYSISTRATA\n\nYet summoned on the most tremendous business\nFor deliberation, still they snuggle in bed.\n\nCALONICE\n\nMy dear, they'll come. It's hard for women, you know,\nTo get away. There's so much to do;\nHusbands to be patted and put in good tempers:\nServants to be poked out: children washed\nOr soothed with lullays or fed with mouthfuls of pap.\n\nLYSISTRATA\n\nBut I tell you, here's a far more weighty object.\n\nCALONICE\n\nWhat is it all about, dear Lysistrata,\nThat you've called the women hither in a troop?\nWhat kind of an object is it?\n\nLYSISTRATA\n\nA tremendous thing!\n\nCALONICE\n\nAnd long?\n\nLYSISTRATA\n\nIndeed, it may be very lengthy.\n\nCALONICE\n\nThen why aren't they here?\n\nLYSISTRATA\n\nNo man's connected with it;\nIf that was the case, they'd soon come fluttering along.\nNo, no. It concerns an object I've felt over\nAnd turned this way and that for sleepless nights.\n\nCALONICE\n\nIt must be fine to stand such long attention.\n\nLYSISTRATA\n\nSo fine it comes to this--Greece saved by Woman!\n\nCALONICE\n\nBy Woman? Wretched thing, I'm sorry for it.\n\nLYSISTRATA\n\nOur country's fate is henceforth in our hands:\nTo destroy the Peloponnesians root and branch--\n\nCALONICE\n\nWhat could be nobler!\n\nLYSISTRATA\n\nWipe out the Boeotians--\n\nCALONICE\n\nNot utterly. Have mercy on the eels!\n[Footnote: The Boeotian eels were highly esteemed delicacies in Athens.]\n\nLYSISTRATA\n\nBut with regard to Athens, note I'm careful\nNot to say any of these nasty things;\nStill, thought is free.... But if the women join us\nFrom Peloponnesus and Boeotia, then\nHand in hand we'll rescue Greece.\n\nCALONICE\n\nHow could we do\nSuch a big wise deed? We women who dwell\nQuietly adorning ourselves in a back-room\nWith gowns of lucid gold and gawdy toilets\nOf stately silk and dainty little slippers....\n\nLYSISTRATA\n\nThese are the very armaments of the rescue.\nThese crocus-gowns, this outlay of the best myrrh,\nSlippers, cosmetics dusting beauty, and robes\nWith rippling creases of light.\n\nCALONICE\n\nYes, but how?\n\nLYSISTRATA\n\nNo man will lift a lance against another--\n\nCALONICE\n\nI'll run to have my tunic dyed crocus.\n\nLYSISTRATA\n\nOr take a shield--\n\nCALONICE\n\nI'll get a stately gown.\n\nLYSISTRATA\n\nOr unscabbard a sword--\n\nCALONICE\n\nLet me buy a pair of slipper.\n\nLYSISTRATA\n\nNow, tell me, are the women right to lag?\n\nCALONICE\n\nThey should have turned birds, they should have grown\nwings and flown.\n\nLYSISTRATA\n\nMy friend, you'll see that they are true Athenians:\nAlways too late. Why, there's not a woman\nFrom the shoreward demes arrived, not one from Salamis.\n\nCALONICE\n\nI know for certain they awoke at dawn,\nAnd got their husbands up if not their boat sails.\n\nLYSISTRATA\n\nAnd I'd have staked my life the Acharnian dames\nWould be here first, yet they haven't come either!\n\nCALONICE\n\nWell anyhow there is Theagenes' wife\nWe can expect--she consulted Hecate.\nBut look, here are some at last, and more behind them.\nSee ... where are they from?\n\nCALONICE\n\nFrom Anagyra they come.\n\nLYSISTRATA\n\nYes, they generally manage to come first.\n\n_Enter_ MYRRHINE.\n\nMYRRHINE\n\nAre we late, Lysistrata? ... What is that?\nNothing to say?\n\nLYSISTRATA\n\nI've not much to say for you,\nMyrrhine, dawdling on so vast an affair.\n\nMYRRHINE\n\nI couldn't find my girdle in the dark.\nBut if the affair's so wonderful, tell us, what is it?\n\nLYSISTRATA\n\nNo, let us stay a little longer till\nThe Peloponnesian girls and the girls of Bocotia\nAre here to listen.\n\nMYRRHINE\n\nThat's the best advice.\nAh, there comes Lampito.\n\n_Enter_ LAMPITO.\n\nLYSISTRATA\n\nWelcome Lampito!\nDear Spartan girl with a delightful face,\nWashed with the rosy spring, how fresh you look\nIn the easy stride of your sleek slenderness,\nWhy you could strangle a bull!\n\nLAMPITO\n\nI think I could.\nIt's frae exercise and kicking high behint.\n\n[Footnote: The translator has put the speech of the Spartan characters\nin Scotch dialect which is related to English about as was the Spartan\ndialect to the speech of Athens. The Spartans, in their character,\nanticipated the shrewd, canny, uncouth Scotch highlander of modern\ntimes.]\n\nLYSISTRATA\n\nWhat lovely breasts to own!\n\nLAMPITO\n\nOo ... your fingers\nAssess them, ye tickler, wi' such tender chucks\nI feel as if I were an altar-victim.\n\nLYSISTRATA\n\nWho is this youngster?\n\nLAMPITO\n\nA Boeotian lady.\n\nLYSISTRATA\n\nThere never was much undergrowth in Boeotia,\nSuch a smooth place, and this girl takes after it.\n\nCALONICE\n\nYes, I never saw a skin so primly kept.\n\nLYSISTRATA\n\nThis girl?\n\nLAMPITO\n\nA sonsie open-looking jinker!\nShe's a Corinthian.\n\nLYSISTRATA\n\nYes, isn't she\nVery open, in some ways particularly.\n\nLAMPITO\n\nBut who's garred this Council o' Women to meet here?\n\nLYSISTRATA\n\nI have.\n\nLAMPITO\n\nPropound then what you want o' us.\n\nMYRRHINE\n\nWhat is the amazing news you have to tell?\n\nLYSISTRATA\n\nI'll tell you, but first answer one small question.\n\nMYRRHINE\n\nAs you like.\n\nLYSISTRATA\n\nAre you not sad your children's fathers\nGo endlessly off soldiering afar\nIn this plodding war? I am willing to wager\nThere's not one here whose husband is at home.\n\nCALONICE\n\nMine's been in Thrace, keeping an eye on Eucrates\nFor five months past.\n\nMYRRHINE\n\nAnd mine left me for Pylos\nSeven months ago at least.\n\nLAMPITO\n\nAnd as for mine\nNo sooner has he slipped out frae the line\nHe straps his shield and he's snickt off again.\n\nLYSISTRATA\n\nAnd not the slightest glitter of a lover!\nAnd since the Milesians betrayed us, I've not seen\nThe image of a single upright man\nTo be a marble consolation to us.\nNow will you help me, if I find a means\nTo stamp the war out.\n\nMYRRHINE\n\nBy the two Goddesses, Yes!\nI will though I've to pawn this very dress\nAnd drink the barter-money the same day.\n\nCALONICE\n\nAnd I too though I'm split up like a turbot\nAnd half is hackt off as the price of peace.\n\nLAMPITO\n\nAnd I too! Why, to get a peep at the shy thing\nI'd clamber up to the tip-top o' Taygetus.\n\nLYSISTRATA\n\nThen I'll expose my mighty mystery.\nO women, if we would compel the men\nTo bow to Peace, we must refrain--\n\nMYRRHINE\n\nFrom what?\nO tell us!\n\nLYSISTRATA\n\nWill you truly do it then?\n\nMYRRHINE\n\nWe will, we will, if we must die for it.\n\nLYSISTRATA\n\nWe must refrain from every depth of love....\nWhy do you turn your backs? Where are you going?\nWhy do you bite your lips and shake your heads?\nWhy are your faces blanched? Why do you weep?\nWill you or won't you, or what do you mean?\n\nMYRRHINE\n\nNo, I won't do it. Let the war proceed.\n\nCALONICE\n\nNo, I won't do it. Let the war proceed.\n\nLYSISTRATA\n\nYou too, dear turbot, you that said just now\nYou didn't mind being split right up in the least?\n\nCALONICE\n\nAnything else? O bid me walk in fire\nBut do not rob us of that darling joy.\nWhat else is like it, dearest Lysistrata?\n\nLYSISTRATA\n\nAnd you?\n\nMYRRHINE\n\nO please give me the fire instead.\n\nLYSISTRATA\n\nLewd to the least drop in the tiniest vein,\nOur sex is fitly food for Tragic Poets,\nOur whole life's but a pile of kisses and babies.\nBut, hardy Spartan, if you join with me\nAll may be righted yet. O help me, help me.\n\nLAMPITO\n\nIt's a sair, sair thing to ask of us, by the Twa,\nA lass to sleep her lane and never fill\nLove's lack except wi' makeshifts.... But let it be.\nPeace maun be thought of first.\n\nLYSISTRATA\n\nMy friend, my friend!\nThe only one amid this herd of weaklings.\n\nCALONICE\n\nBut if--which heaven forbid--we should refrain\nAs you would have us, how is Peace induced?\n\nLYSISTRATA\n\nBy the two Goddesses, now can't you see\nAll we have to do is idly sit indoors\nWith smooth roses powdered on our cheeks,\nOur bodies burning naked through the folds\nOf shining Amorgos' silk, and meet the men\nWith our dear Venus-plats plucked trim and neat.\nTheir stirring love will rise up furiously,\nThey'll beg our arms to open. That's our time!\nWe'll disregard their knocking, beat them off--\nAnd they will soon be rabid for a Peace.\nI'm sure of it.\n\nLAMPITO\n\n          Just as Menelaus, they say,\nSeeing the bosom of his naked Helen\nFlang down the sword.\n\nCALONICE\n\n               But we'll be tearful fools\nIf our husbands take us at our word and leave us.\n\nLYSISTRATA\n\nThere's only left then, in Pherecrates' phrase,\n_To flay a skinned dog_--flay more our flayed desires.\n\nCALONICE\n\nBah, proverbs will never warm a celibate.\nBut what avail will your scheme be if the men\nDrag us for all our kicking on to the couch?\n\nLYSISTRATA\n\nCling to the doorposts.\n\nCALONICE\n\n               But if they should force us?\n\nLYSISTRATA\n\nYield then, but with a sluggish, cold indifference.\nThere is no joy to them in sullen mating.\nBesides we have other ways to madden them;\nThey cannot stand up long, and they've no delight\nUnless we fit their aim with merry succour.\n\nCALONICE\n\nWell if you must have it so, we'll all agree.\n\nLAMPITO\n\nFor us I ha' no doubt. We can persuade\nOur men to strike a fair an' decent Peace,\nBut how will ye pitch out the battle-frenzy\nO' the Athenian populace?\n\nLYSISTRATA\n\nI promise you\nWe'll wither up that curse.\n\nLAMPITO\n\nI don't believe it.\nNot while they own ane trireme oared an' rigged,\nOr a' those stacks an' stacks an' stacks O' siller.\n\nLYSISTRATA\n\nI've thought the whole thing out till there's no flaw.\nWe shall surprise the Acropolis today:\nThat is the duty set the older dames.\nWhile we sit here talking, they are to go\nAnd under pretence of sacrificing, seize it.\n\nLAMPITO\n\nCertie, that's fine; all's working for the best.\n\nLYSISTRATA\n\nNow quickly, Lampito, let us tie ourselves\nTo this high purpose as tightly as the hemp of words\nCan knot together.\n\nLAMPITO\n\nSet out the terms in detail\nAnd we'll a' swear to them.\n\nLYSISTRATA\n\nOf course.... Well then\nWhere is our Scythianess? Why are you staring?\nFirst lay the shield, boss downward, on the floor\nAnd bring the victim's inwards.\n\nCAILONICE\n\nBut, Lysistrata,\nWhat is this oath that we're to swear?\n\nLYSISTRATA\n\nWhat oath!\nIn Aeschylus they take a slaughtered sheep\nAnd swear upon a buckler. Why not we?\n\nCALONICE\n\nO Lysistrata, Peace sworn on a buckler!\n\nLYSISTRATA\n\nWhat oath would suit us then?\n\nCALONICE\n\nSomething burden bearing\nWould be our best insignia.... A white horse!\nLet's swear upon its entrails.\n\nLYSISTRATA\n\nA horse indeed!\n\nCALONICE\n\nThen what will symbolise us?\n\nLYSISTRATA\n\nThis, as I tell you--\nFirst set a great dark bowl upon the ground\nAnd disembowel a skin of Thasian wine,\nThen swear that we'll not add a drop of water.\n\nLAMPITO\n  Ah, what aith could clink pleasanter than that!\n\nLYSISTRATA\n  Bring me a bowl then and a skin of wine.\n\nCALONICE\n  My dears, see what a splendid bowl it is;\n  I'd not say No if asked to sip it off.\n\nLYSISTRATA\n  Put down the bowl. Lay hands, all, on the victim.\n  Skiey Queen who givest the last word in arguments,\n  And thee, O Bowl, dear comrade, we beseech:\n  Accept our oblation and be propitious to us.\n\nCALONICE\n  What healthy blood, la, how it gushes out!\n\nLAMPITO\n  An' what a leesome fragrance through the air.\n\nLYSISTRATA\n  Now, dears, if you will let me, I'll speak first.\n\nCALONICE\n  Only if you draw the lot, by Aphrodite!\n\nLYSISTRATA\n  SO, grasp the brim, you, Lampito, and all.\n  You, Calonice, repeat for the rest\n  Each word I say. Then you must all take oath\n  And pledge your arms to the same stern conditions--\n\nLYSISTRATA\n  To husband or lover I'll not open arms\n\nCALONICE\n\n_To husband or lover I'll not open arms_\n\nLYSISTRATA\n\nThough love and denial may enlarge his charms.\n\nCALONICE\n\n_Though love and denial may enlarge his charms._\nO, O, my knees are failing me, Lysistrata!\n\nLYSISTRATA\n\nBut still at home, ignoring him, I'll stay,\n\nCALONICE\n\n_But still at home, ignoring him, I'll stay,_\n\nLYSISTRATA\n\nBeautiful, clad in saffron silks all day.\n\nCALONICE\n\n_Beautiful, clad in saffron silks all day._\n\nLYSISTRATA\n\nIf then he seizes me by dint of force,\n\nCALONICE\n\n_If then he seizes me by dint of force,_\n\nLYSISTRATA\n\nI'll give him reason for a long remorse.\n\nCALONICE\n\n_I'll give him reason for a long remorse._\n\nLYSISTRATA\n\nI'll never lie and stare up at the ceiling,\n\nCALONICE\n\n_I'll never lie and stare up at the ceiling,_\n\nLYSISTRATA\n\nNor like a lion on all fours go kneeling.\n\nCALONICE\n\n_Nor like a lion on all fours go kneeling._\n\nLYSISTRATA\n\nIf I keep faith, then bounteous cups be mine.\n\nCALONICE\n\n_If I keep faith, then bounteous cups be mine._\n\nLYSISTRATA\n\nIf not, to nauseous water change this wine.\n\nCALONICE\n  _If not, to nauseous water change this wine._\n\nLYSISTRATA\n\nDo you all swear to this?\n\nMYRRHINE\n\nWe do, we do.\n\nLYSISTRATA\n\nThen I shall immolate the victim thus.\n_She drinks._\n\nCALONICE\n\nHere now, share fair, haven't we made a pact?\nLet's all quaff down that friendship in our turn.\n\nLAMPITO\n\nHark, what caterwauling hubbub's that?\n\nLYSISTRATA\n\nAs I told you,\nThe women have appropriated the citadel.\nSo, Lampito, dash off to your own land\nAnd raise the rebels there. These will serve as hostages,\nWhile we ourselves take our places in the ranks\nAnd drive the bolts right home.\n\nCALONICE\n\nBut won't the men\nMarch straight against us?\n\nLYSISTRATA\n\nAnd what if they do?\nNo threat shall creak our hinges wide, no torch\nShall light a fear in us; we will come out\nTo Peace alone.\n\nCALONICE\n\nThat's it, by Aphrodite!\nAs of old let us seem hard and obdurate.\n\nLAMPITO _and some go off; the others go up into the Acropolis._\n\n_Chorus of_ OLD MEN _enter to attack the captured Acropolis_.\n\nMake room, Draces, move ahead; why your shoulder's chafed, I see,\nWith lugging uphill these lopped branches of the olive-tree.\nHow upside-down and wrong-way-round a long life sees things grow.\nAh, Strymodorus, who'd have thought affairs could tangle so?\n\nThe women whom at home we fed,\nLike witless fools, with fostering bread,\nHave impiously come to this--\nThey've stolen the Acropolis,\nWith bolts and bars our orders flout\nAnd shut us out.\n\nCome, Philurgus, bustle thither; lay our faggots on the ground,\nIn neat stacks beleaguering the insurgents all around;\nAnd the vile conspiratresses, plotters of such mischief dire,\nPile and burn them all together in one vast and righteous pyre:\nFling with our own hands Lycon's wife to fry in the thickest fire.\nBy Demeter, they'll get no brag while I've a vein to beat!\nCleomenes himself was hurtled out in sore defeat.\nHis stiff-backed Spartan pride was bent.\nOut, stripped of all his arms, he went:\nA pigmy cloak that would not stretch\nTo hide his rump (the draggled wretch),\nSix sprouting years of beard, the spilth\nOf six years' filth.\n\nThat was a siege! Our men were ranged in lines of seventeen deep\nBefore the gates, and never left their posts there, even to sleep.\nShall I not smite the rash presumption then of foes like these,\nDetested both of all the gods and of Euripides--\nElse, may the Marathon-plain not boast my trophied victories!\n\nAh, now, there's but a little space\nTo reach the place!\nA deadly climb it is, a tricky road\nWith all this bumping load:\nA pack-ass soon would tire....\nHow these logs bruise my shoulders! further still\nJog up the hill,\nAnd puff the fire inside,\nOr just as we reach the top we'll find it's died.\nOugh, phew!\nI choke with the smoke.\n\nLord Heracles, how acrid-hot\nOut of the pot\nThis mad-dog smoke leaps, worrying me\nAnd biting angrily....\n'Tis Lemnian fire that smokes,\nOr else it would not sting my eyelids thus....\nHaste, all of us;\nAthene invokes our aid.\nLaches, now or never the assault must be made!\nOugh, phew!\nI choke with the smoke. ..\n\nThanked be the gods! The fire peeps up and crackles as it should.\nNow why not first slide off our backs these weary loads of wood\nAnd dip a vine-branch in the brazier till it glows, then straight\nHurl it at the battering-ram against the stubborn gate?\nIf they refuse to draw the bolts in immediate compliance,\nWe'll set fire to the wood, and smoke will strangle their defiance.\n\nPhew, what a spluttering drench of smoke! Come, now from off my back....\nIs there no Samos-general to help me to unpack?\nAh there, that's over! For the last time now it's galled my shoulder.\nFlare up thine embers, brazier, and dutifully smoulder,\nTo kindle a brand, that I the first may strike the citadel.\nAid me, Lady Victory, that a triumph-trophy may tell\nHow we did anciently this insane audacity quell!\n\n_Chorus of_ WOMEN.\n\nWhat's that rising yonder? That ruddy glare, that smoky skurry?\nO is it something in a blaze? Quick, quick, my comrades, hurry!\nNicodice, helter-skelter!\nOr poor Calyce's in flames\nAnd Cratylla's stifled in the welter.\nO these dreadful old men\nAnd their dark laws of hate!\nThere, I'm all of a tremble lest I turn out to be too late.\nI could scarcely get near to the spring though I rose before dawn,\nWhat with tattling of tongues and rattling of pitchers in one jostling din\nWith slaves pushing in!....\n\nStill here at last the water's drawn\nAnd with it eagerly I run\nTo help those of my friends who stand\nIn danger of being burned alive.\nFor I am told a dribbling band\nOf greybeards hobble to the field,\nGreat faggots in each palsied hand,\nAs if a hot bath to prepare,\nAnd threatening that out they'll drive\nThese wicked women or soon leave them charring into ashes\nthere.\nO Goddess, suffer not, I pray, this harsh deed to be done,\nBut show us Greece and Athens with their warlike acts repealed!\nFor this alone, in this thy hold,\nThou Goddess with the helm of gold,\nWe laid hands on thy sanctuary,\nAthene.... Then our ally be\nAnd where they cast their fires of slaughter\nDirect our water!\n\nSTRATYLLIS (_caught_)\n\nLet me go!\n\nWOMEN\n\nYou villainous old men, what's this you do?\nNo honest man, no pious man, could do such things as you.\n\nMEN\n\nAh ha, here's something most original, I have no doubt:\nA swarm of women sentinels to man the walls without.\n\nWOMEN\n\nSo then we scare you, do we? Do we seem a fearful host?\nYou only see the smallest fraction mustered at this post.\n\nMEN\n\nHo, Phaedrias, shall we put a stop to all these chattering tricks?\nSuppose that now upon their backs we splintered these our sticks?\n\nWOMEN\n\nLet us lay down the pitchers, so our bodies will be free,\n  In case these lumping fellows try to cause some injury.\n\nMEN\n\nO hit them hard and hit again and hit until they run away,\nAnd perhaps they'll learn, like Bupalus, not to have too much to say.\n\nWOMEN\n\nCome on, then--do it! I won't budge, but like a dog I'll bite\nAt every little scrap of meat that dangles in my sight.\n\nMEN\n\nBe quiet, or I'll bash you out of any years to come.\n\nWOMEN\n\nNow you just touch Stratyllis with the top-joint of your thumb.\n\nMEN\n\nWhat vengeance can you take if with my fists your face I beat?\n\nWOMEN\n\nI'll rip you with my teeth and strew your entrails at your feet.\n\nMEN\n\nNow I appreciate Euripides' strange subtlety:\nWoman is the most shameless beast of all the beasts that be.\n\nWOMEN\n\nRhodippe, come, and let's pick up our water-jars once more.\n\nMEN\n\nAh cursed drab, what have you brought this water for?\n\nWOMEN\n\nWhat is your fire for then, you smelly corpse? Yourself to burn?\n\nMEN\n\nTo build a pyre and make your comrades ready for the urn.\n\nWOMEN\n\nAnd I've the water to put out your fire immediately.\n\nMEN\n\nWhat, you put out my fire?\n\nWOMEN\n\nYes, sirrah, as you soon will see.\n\nMEN\n\nI don't know why I hesitate to roast you with this flame.\n\nWOMEN\n\nIf you have any soap you'll go off cleaner than you came.\n\nMEN\n\nCleaner, you dirty slut?\n\nWOMEN\n\nA nuptial-bath in which to lie!\n\nMEN\n\nDid you hear that insolence?\n\nWOMEN\n\nI'm a free woman, I.\n\nMEN\n\nI'll make you hold your tongue.\n\nWOMEN\n\nHenceforth you'll serve in no more juries.\n\nMEN\n\nBurn off her hair for her.\n\nWOMEN\n\nNow forward, water, quench their furies!\n\nMEN\n\nO dear, O dear!\n\nWOMEN\n\nSo ... was it hot?\n\nMEN\n\nHot! ... Enough, O hold.\n\nWOMEN\n\nWatered, perhaps you'll bloom again--why not?\n\nMEN\n\nBrrr, I'm wrinkled up from shivering with cold.\n\nWOMEN\n\nNext time you've fire you'll warm yourself and leave us to our lot.\n\nMAGISTRATE _enters with attendant_ SCYTHIANS.\n\nMAGISTRATE\n\nHave the luxurious rites of the women glittered\nTheir libertine show, their drumming tapped out crowds,\nThe Sabazian Mysteries summoned their mob,\nAdonis been wept to death on the terraces,\nAs I could hear the last day in the Assembly?\nFor Demostratus--let bad luck befoul him--\nWas roaring, \"We must sail for Sicily,\"\nWhile a woman, throwing herself about in a dance\nLopsided with drink, was shrilling out \"Adonis,\nWoe for Adonis.\" Then Demostratus shouted,\n\"We must levy hoplites at Zacynthus,\"\nAnd there the woman, up to the ears in wine,\nWas screaming \"Weep for Adonis\" on the house-top,\nThe scoundrelly politician, that lunatic ox,\nBellowing bad advice through tipsy shrieks:\nSuch are the follies wantoning in them.\n\nMEN\n\nO if you knew their full effrontery!\nAll of the insults they've done, besides sousing us\nWith water from their pots to our public disgrace\nFor we stand here wringing our clothes like grown-up infants.\n\nMAGISTRATE\n\nBy Poseidon, justly done! For in part with us\nThe blame must lie for dissolute behaviour\nAnd for the pampered appetites they learn.\nThus grows the seedling lust to blossoming:\nWe go into a shop and say, \"Here, goldsmith,\nYou remember the necklace that you wrought my wife;\nWell, the other night in fervour of a dance\nHer clasp broke open. Now I'm off for Salamis;\nIf you've the leisure, would you go tonight\nAnd stick a bolt-pin into her opened clasp.\"\nAnother goes to a cobbler; a soldierly fellow,\nAlways standing up erect, and says to him,\n\"Cobbler, a sandal-strap of my wife's pinches her,\nHurts her little toe in a place where she's sensitive.\nCome at noon and see if you can stretch out wider\nThis thing that troubles her, loosen its tightness.\"\nAnd so you view the result. Observe my case--\nI, a magistrate, come here to draw\nMoney to buy oar-blades, and what happens?\nThe women slam the door full in my face.\nBut standing still's no use. Bring me a crowbar,\nAnd I'll chastise this their impertinence.\nWhat do you gape at, wretch, with dazzled eyes?\nPeering for a tavern, I suppose.\nCome, force the gates with crowbars, prise them apart!\nI'll prise away myself too.... (LYSISTRATA _appears._)\n\nLYSISTRATA\n\nStop this banging.\nI'm coming of my own accord.... Why bars?\nIt is not bars we need but common sense.\n\nMAGISTRATE\n\nIndeed, you slut! Where is the archer now?\nArrest this woman, tie her hands behind.\n\nLYSISTRATA\n\nIf he brushes me with a finger, by Artemis,\nThe public menial, he'll be sorry for it.\n\nMAGISTRATE\n\nAre you afraid? Grab her about the middle.\nTwo of you then, lay hands on her and end it.\n\nCALONICE\n\nBy Pandrosos I if your hand touches her\nI'll spread you out and trample on your guts.\n\nMAGISTRATE\n\nMy guts! Where is the other archer gone?\nBind that minx there who talks so prettily.\n\nMYRRHINE\n\nBy Phosphor, if your hand moves out her way\nYou'd better have a surgeon somewhere handy.\n\nMAGISTRATE\n\nYou too! Where is that archer? Take that woman.\nI'll put a stop to these surprise-parties.\n\nSTRATYLLIS\n\nBy the Tauric Artemis, one inch nearer\nMy fingers, and it's a bald man that'll be yelling.\n\nMAGISTRATE\n\nTut tut, what's here? Deserted by my archers....\nBut surely women never can defeat us;\nClose up your ranks, my Scythians. Forward at them.\n\nLYSISTRATA\n\nBy the Goddesses, you'll find that here await you\nFour companies of most pugnacious women\nArmed cap-a-pie from the topmost louring curl\nTo the lowest angry dimple.\n\nMAGISTRATE\n\nOn, Scythians, bind them.\n\nLYSISTRATA\n\nOn, gallant allies of our high design,\nVendors of grain-eggs-pulse-and-vegetables,\nYe garlic-tavern-keepers of bakeries,\nStrike, batter, knock, hit, slap, and scratch our foes,\nBe finely imprudent, say what you think of them....\nEnough! retire and do not rob the dead.\n\nMAGISTRATE\n\nHow basely did my archer-force come off.\n\nLYSISTRATA\n\nAh, ha, you thought it was a herd of slaves\nYou had to tackle, and you didn't guess\nThe thirst for glory ardent in our blood.\n\nMAGISTRATE\n\nBy Apollo, I know well the thirst that heats you--\nEspecially when a wine-skin's close.\n\nMEN\n\nYou waste your breath, dear magistrate, I fear, in answering back.\nWhat's the good of argument with such a rampageous pack?\nRemember how they washed us down (these very clothes I wore)\nWith water that looked nasty and that smelt so even more.\n\nWOMEN\n\nWhat else to do, since you advanced too dangerously nigh.\nIf you should do the same again, I'll punch you in the eye.\nThough I'm a stay-at-home and most a quiet life enjoy,\nPolite to all and every (for I'm naturally coy),\nStill if you wake a wasps' nest then of wasps you must beware.\n\nMEN\n\nHow may this ferocity be tamed? It grows too great to bear.\nLet us question them and find if they'll perchance declare\nThe reason why they strangely dare\nTo seize on Cranaos' citadel,\nThis eyrie inaccessible,\nThis shrine above the precipice,\nThe Acropolis.\nProbe them and find what they mean with this idle talk; listen,\nbut watch they don't try to deceive.\nYou'd be neglecting your duty most certainly if now this mystery\nunplumbed you leave.\n\nMAGISTRATE\n\nWomen there! Tell what I ask you, directly....\nCome, without rambling, I wish you to state\nWhat's your rebellious intention in barring up thus on our noses\nour own temple-gate.\n\nLYSISTRATA\n\nTo take first the treasury out of your management, and so stop the war\nthrough the absence of gold.\n\nMAGISTRATE\n\nIs gold then the cause of the war?\n\nLYSISTRATA\n\nYes, gold caused it and miseries more, too many to be told.\n'Twas for money, and money alone, that Pisander with all of the army of\nmob-agitators.\nRaised up revolutions. But, as for the future, it won't be worth while\nto set up to be traitors.\nNot an obol they'll get as their loot, not an obol! while we have the\ntreasure-chest in our command.\n\nMAGISTRATE\n\nWhat then is that you propose?\n\nLYSISTRATA\n\nJust this--merely to take the exchequer henceforth in hand.\n\nMAGISTRATE\n\nThe exchequer!\n\nLYSISTRATA\n\nYes, why not? Of our capabilities you have had various clear evidences.\nFirstly remember we have always administered soundly the budget of all\nhome-expenses.\n\nMAGISTRATE\n\nBut this matter's different.\n\nLYSISTRATA\n\nHow is it different?\n\nMAGISTRATE\n\nWhy, it deals chiefly with war-time supplies.\n\nLYSISTRATA\n\nBut we abolish war straight by our policy.\n\nMAGISTRATE\n\nWhat will you do if emergencies arise?\n\nLYSISTRATA\n\nFace them our own way.\n\nMAGISTRATE\n\nWhat _you_ will?\n\nLYSISTRATA\n\nYes _we_ will!\n\nMAGISTRATE\n\nThen there's no help for it; we're all destroyed.\n\nLYSISTRATA\n\nNo, willy-nilly you must be safeguarded.\n\nMAGISTRATE\n\nWhat madness is this?\n\nLYSISTRATA\n\nWhy, it seems you're annoyed.\nIt must be done, that's all.\n\nMAGISTRATE\n\nSuch awful oppression never,\nO never in the past yet I bore.\n\nLYSISTRATA\n\nYou must be saved, sirrah--that's all there is to it.\n\nMAGISTRATE\n\nIf we don't want to be saved?\n\nLYSISTRATA\n\nAll the more.\n\nMAGISTRATE\n\nWhy do you women come prying and meddling in matters of state touching\nwar-time and peace?\n\nLYSISTRATA\n\nThat I will tell you.\n\nMAGISTRATE\n\nO tell me or quickly I'll--\n\nLYSISTRATA\n\nHearken awhile and from threatening cease.\n\nMAGISTRATE\n\nI cannot, I cannot; it's growing too insolent.\n\nWOMEN\n\nCome on; you've far more than we have to dread.\n\nMAGISTRATE\n\nStop from your croaking, old carrion-crow there....\nContinue.\n\nLYSISTRATA\n\nBe calm then and I'll go ahead.\nAll the long years when the hopeless war dragged along we, unassuming,\nforgotten in quiet,\nEndured without question, endured in our loneliness all your incessant\nchild's antics and riot.\nOur lips we kept tied, though aching with silence, though well all the\nwhile in our silence we knew\nHow wretchedly everything still was progressing by listening dumbly the\nday long to you.\nFor always at home you continued discussing the war and its politics\nloudly, and we\nSometimes would ask you, our hearts deep with sorrowing though we spoke\nlightly, though happy to see,\n\"What's to be inscribed on the side of the Treaty-stone\nWhat, dear, was said in the Assembly today?\"\n\"Mind your own business,\" he'd answer me growlingly\n\"hold your tongue, woman, or else go away.\"\nAnd so I would hold it.\n\nWOMEN\n\nI'd not be silent for any man living on earth, no, not I!\n\nMAGISTRATE\n\nNot for a staff?\n\nLYSISTRATA\n\nWell, so I did nothing but sit in the house, feeling dreary, and sigh,\nWhile ever arrived some fresh tale of decisions more foolish by far and\npresaging disaster.\nThen I would say to him, \"O my dear husband, why still do they rush on\ndestruction the faster?\"\nAt which he would look at me sideways, exclaiming, \"Keep for your web\nand your shuttle your care,\nOr for some hours hence your cheeks will be sore and hot; leave this\nalone, war is Man's sole affair!\"\n\nMAGISTRATE\n\nBy Zeus, but a man of fine sense, he.\n\nLYSISTRATA\n\nHow sensible?\nYou dotard, because he at no time had lent\nHis intractable ears to absorb from our counsel one temperate word of\nadvice, kindly meant?\nBut when at the last in the streets we heard shouted (everywhere ringing\nthe ominous cry)\n\"Is there no one to help us, no saviour in Athens?\" and, \"No, there is\nno one,\" come back in reply.\nAt once a convention of all wives through Hellas here for a serious\npurpose was held,\nTo determine how husbands might yet back to wisdom despite their\nreluctance in time be compelled.\nWhy then delay any longer? It's settled. For the future you'll take\nup our old occupation.\nNow in turn you're to hold tongue, as we did, and listen while we show\nthe way to recover the nation.\n\nMAGISTRATE\n\n_You_ talk to _us!_ Why, you're mad. I'll not stand it.\n\nLYSISTRATA\n\nCease babbling, you fool; till I end, hold your tongue.\n\nMAGISTRATE\n\nIf I should take orders from one who wears veils, may my\nneck straightaway be deservedly wrung.\n\nLYSISTRATA\n\nO if that keeps pestering you,\nI've a veil here for your hair,\nI'll fit you out in everything\nAs is only fair.\n\nCALONICE\n\nHere's a spindle that will do.\n\nMYRRHINE\n\nI'll add a wool-basket too.\n\nLYSISTRATA\n\nGirdled now sit humbly at home,\nMunching beans, while you card wool and comb. For war from now on\nis the Women's affair.\n\nWOMEN.\n\nCome then, down pitchers, all,\nAnd on, courageous of heart,\nIn our comradely venture\nEach taking her due part.\n\nI could dance, dance, dance, and be fresher after,\nI could dance away numberless suns,\nTo no weariness let my knees bend.\nEarth I could brave with laughter,\nHaving such wonderful girls here to friend.\nO the daring, the gracious, the beautiful ones!\nTheir courage unswerving and witty\nWill rescue our city.\n\nO sprung from the seed of most valiant-wombed grand-mothers,\nscions of savage and dangerous nettles!\nPrepare for the battle, all. Gird up your angers. Our way\nthe wind of sweet victory settles.\n\nLYSISTRATA\n\nO tender Eros and Lady of Cyprus, some flush of beauty I\npray you devise\nTo flash on our bosoms and, O Aphrodite, rosily gleam on\nour valorous thighs!\nJoy will raise up its head through the legions warring and\nall of the far-serried ranks of mad-love\nBristle the earth to the pillared horizon, pointing in vain to\nthe heavens above.\nI think that perhaps then they'll give us our title--\nPeace-makers.\n\nMAGISTRATE\n\n          What do you mean? Please explain.\n\nLYSISTRATA\n\n  First, we'll not see you now flourishing arms about into the\n    Marketing-place clang again.\n\nWOMEN\n  No, by the Paphian.\n\nLYSISTRATA\n\nStill I can conjure them as past were the herbs stand or crockery's sold\nLike Corybants jingling (poor sots) fully armoured, they noisily round\non their promenade strolled.\n\nMAGISTRATE\n\nAnd rightly; that's discipline, they--\n\nLYSISTRATA\n\nBut what's sillier than to go on an errand of buying a fish\nCarrying along an immense. Gorgon-buckler instead the usual platter\nor dish?\nA phylarch I lately saw, mounted on horse-back, dressed for the part\nwith long ringlets and all,\nStow in his helmet the omelet bought steaming from an old woman who\nkept a food-stall.\nNearby a soldier, a Thracian, was shaking wildly his spear like Tereus\nin the play,\nTo frighten a fig-girl while unseen the ruffian filched from her\nfruit-trays the ripest away.\n\nMAGISTRATE\n\nHow, may I ask, will your rule re-establish order and justice in lands\nso tormented?\n\nLYSISTRATA\n\nNothing is easier.\n\nMAGISTRATE\n\nOut with it speedily--what is this plan that you boast you've invented?\n\nLYSISTRATA\n\nIf, when yarn we are winding, It chances to tangle, then, as perchance you\nmay know, through the skein\nThis way and that still the spool we keep passing till it is finally clear\nall again:\nSo to untangle the War and its errors, ambassadors out on all sides we will\nsend\nThis way and that, here, there and round about--soon you will find that the\nWar has an end.\n\nMAGISTRATE\n\nSo with these trivial tricks of the household, domestic analogies of\nthreads, skeins and spools,\nYou think that you'll solve such a bitter complexity, unwind such political\nproblems, you fools!\n\nLYSISTRATA\n\nWell, first as we wash dirty wool so's to cleanse it, so with a pitiless\nzeal we will scrub\nThrough the whole city for all greasy fellows; burrs too, the parasites,\noff we will rub.\nThat verminous plague of insensate place-seekers soon between thumb and\nforefinger we'll crack.\nAll who inside Athens' walls have their dwelling into one great common\nbasket we'll pack.\nDisenfranchised or citizens, allies or aliens, pell-mell the lot of them\nin we will squeeze.\nTill they discover humanity's meaning.... As for disjointed and far\ncolonies,\nThem you must never from this time imagine as scattered about just like\nlost hanks of wool.\nEach portion we'll take and wind in to this centre, inward to Athens\neach loyalty pull,\nTill from the vast heap where all's piled together at last can be woven\na strong Cloak of State.\n\nMAGISTRATE\n\nHow terrible is it to stand here and watch them carding and winding at\nwill with our fate,\nWitless in war as they are.\n\nLYSISTRATA\n\nWhat of us then, who ever in vain for our children must weep\nBorne but to perish afar and in vain?\n\nMAGISTRATE\n\nNot that, O let that one memory sleep!\n\nLYSISTRATA\n\nThen while we should be companioned still merrily, happy as brides may,\nthe livelong night,\nKissing youth by, we are forced to lie single.... But leave for a moment\nour pitiful plight,\nIt hurts even more to behold the poor maidens helpless wrinkling in\nstaler virginity.\n\nMAGISTRATE\n\nDoes not a man age?\n\nLYSISTRATA\n\nNot in the same way. Not as a woman grows withered, grows he.\nHe, when returned from the war, though grey-headed, yet\nif he wishes can choose out a wife.\nBut she has no solace save peering for omens, wretched and\nlonely the rest of her life.\n\nMAGISTRATE\n\nBut the old man will often select--\n\nLYSISTRATA\n\nO why not finish and die?\nA bier is easy to buy,\nA honey-cake I'll knead you with joy,\nThis garland will see you are decked.\n\nCALONICE\n\nI've a wreath for you too.\n\nMYRRHINE\n\nI also will fillet you.\n\nLYSISTRATA\n\nWhat more is lacking? Step aboard the boat.\nSee, Charon shouts ahoy.\nYou're keeping him, he wants to shove afloat.\n\nMAGISTRATE\n\nOutrageous insults! Thus my place to flout!\nNow to my fellow-magistrates I'll go\nAnd what you've perpetrated on me show.\n\nLYSISTRATA\n\nWhy are you blaming us for laying you out?\nAssure yourself we'll not forget to make\nThe third day offering early for your sake.\n\nMAGISTRATE _retires_, LYSISTRATA _returns within_.\n\nOLD MEN.\n\nAll men who call your loins your own, awake at last, arise\nAnd strip to stand in readiness. For as it seems to me\nSome more perilous offensive in their heads they now devise.\nI'm sure a Tyranny\nLike that of Hippias\nIn this I detect....\nThey mean to put us under\nThemselves I suspect,\nAnd that Laconians assembling\nAt Cleisthenes' house have played\nA trick-of-war and provoked them\nMadly to raid\nThe Treasury, in which term I include\nThe Pay for my food.\n\nFor is it not preposterous\nThey should talk this way to us\nOn a subject such as battle!\n\nAnd, women as they are, about bronze bucklers dare prattle--\nMake alliance with the Spartans--people I for one\nLike very hungry wolves would always most sincere shun....\nSome dirty game is up their sleeve,\nI believe.\nA Tyranny, no doubt... but they won't catch me, that know.\nHenceforth on my guard I'll go,\nA sword with myrtle-branches wreathed for ever in my hand,\nAnd under arms in the Public Place I'll take my watchful stand,\nShoulder to shoulder with Aristogeiton. Now my staff I'll draw\nAnd start at once by knocking\nthat shocking\nHag upon the jaw.\n\nWOMEN.\n\nYour own mother will not know you when you get back to the town.\nBut first, my friends and allies, let us lay these garments down,\nAnd all ye fellow-citizens, hark to me while I tell\nWhat will aid Athens well.\nJust as is right, for I\nHave been a sharer\nIn all the lavish splendour\nOf the proud city.\nI bore the holy vessels\nAt seven, then\nI pounded barley\nAt the age of ten,\nAnd clad in yellow robes,\nSoon after this,\nI was Little Bear to\nBrauronian Artemis;\nThen neckletted with figs,\nGrown tall and pretty,\nI was a Basket-bearer,\nAnd so it's obvious I should\nGive you advice that I think good,\nThe very best I can.\nIt should not prejudice my voice that I'm not born a man,\nIf I say something advantageous to the present situation.\nFor I'm taxed too, and as a toll provide men for the nation\nWhile, miserable greybeards, you,\nIt is true,\nContribute nothing of any importance whatever to our needs;\nBut the treasure raised against the Medes\nYou've squandered, and do nothing in return, save that you make\nOur lives and persons hazardous by some imbecile mistakes\nWhat can you answer? Now be careful, don't arouse my spite,\nOr with my slipper I'll take you napping,\nfaces slapping\nLeft and right.\n\nMEN.\n\nWhat villainies they contrive!\nCome, let vengeance fall,\nYou that below the waist are still alive,\nOff with your tunics at my call--\nNaked, all.\nFor a man must strip to battle like a man.\nNo quaking, brave steps taking, careless what's ahead, white shoed,\nin the nude, onward bold,\nAll ye who garrisoned Leipsidrion of old....\nLet each one wag\nAs youthfully as he can,\nAnd if he has the cause at heart\nRise at least a span.\n\nWe must take a stand and keep to it,\nFor if we yield the smallest bit\nTo their importunity.\nThen nowhere from their inroads will be left to us immunity.\nBut they'll be building ships and soon their navies will attack us,\nAs Artemisia did, and seek to fight us and to sack us.\nAnd if they mount, the Knights they'll rob\nOf a job,\nFor everyone knows how talented they all are in the saddle,\nHaving long practised how to straddle;\nNo matter how they're jogged there up and down, they're never thrown.\nThen think of Myron's painting, and each horse-backed Amazon\nIn combat hand-to-hand with men.... Come, on these women fall,\nAnd in pierced wood-collars let's stick\nquick\nThe necks of one and all.\n\nWOMEN.\n\nDon't cross me or I'll loose\nThe Beast that's kennelled here....\nAnd soon you will be howling for a truce,\nHowling out with fear.\nBut my dear,\nStrip also, that women may battle unhindered....\nBut you, you'll be too sore to eat garlic more, or one black bean,\nI really mean, so great's my spleen, to kick you black and blue\nWith these my dangerous legs.\nI'll hatch the lot of you,\nIf my rage you dash on,\nThe way the relentless Beetle\nHatched the Eagle's eggs.\n\nScornfully aside I set\nEvery silly old-man threat\nWhile Lampito's with me.\nOr dear Ismenia, the noble Theban girl. Then let decree\nBe hotly piled upon decree; in vain will be your labours,\nYou futile rogue abominated by your suffering neighbour\nTo Hecate's feast I yesterday went--\nOff I sent\nTo our neighbours in Boeotia, asking as a gift to me\nFor them to pack immediately\nThat darling dainty thing ... a good fat eel [1] I meant of course;\n\n[Footnote 1:_Vide supra_, p. 23.]\n\nBut they refused because some idiotic old decree's in force.\nO this strange passion for decrees nothing on earth can check,\nTill someone puts a foot out tripping you,\nand slipping you\nBreak your neck.\n\nLYSISTRATA _enters in dismay_.\n\nWOMEN\n\nDear Mistress of our martial enterprise,\nWhy do you come with sorrow in your eyes?\n\nLYSISTRATA\n\nO 'tis our naughty femininity,\nSo weak in one spot, that hath saddened me.\n\nWOMEN\n\nWhat's this? Please speak.\n\nLYSISTRATA\n\nPoor women, O so weak!\n\nWOMEN\n\nWhat can it be? Surely your friends may know.\n\nLYSISTRATA\n\nYea, I must speak it though it hurt me so.\n\nWOMEN\n\nSpeak; can we help? Don't stand there mute in need.\n\nLYSISTRATA\n\nI'll blurt it out then--our women's army's mutinied.\n\nWOMEN\n\nO Zeus!\n\nLYSISTRATA\n\nWhat use is Zeus to our anatomy?\nHere is the gaping calamity I meant:\nI cannot shut their ravenous appetites\nA moment more now. They are all deserting.\nThe first I caught was sidling through the postern\nClose by the Cave of Pan: the next hoisting herself\nWith rope and pulley down: a third on the point\nOf slipping past: while a fourth malcontent, seated\nFor instant flight to visit Orsilochus\nOn bird-back, I dragged off by the hair in time....\nThey are all snatching excuses to sneak home.\nLook, there goes one.... Hey, what's the hurry?\n\n1ST WOMAN\n\nI must get home. I've some Milesian wool\nPacked wasting away, and moths are pushing through it.\n\nLYSISTRATA\n\nFine moths indeed, I know. Get back within.\n\n1ST WOMAN\n\nBy the Goddesses, I'll return instantly.\nI only want to stretch it on my bed.\n\nLYSISTRATA\n\nYou shall stretch nothing and go nowhere either.\n\n1ST WOMAN\n\nMust I never use my wool then?\n\nLYSISTRATA\n\nIf needs be.\n\n2ND WOMAN\n\nHow unfortunate I am! O my poor flax!\nIt's left at home unstript.\n\nLYSISTRATA\n\nSo here's another\nThat wishes to go home and strip her flax.\nInside again!\n\n2ND WOMAN\n\nNo, by the Goddess of Light,\nI'll be back as soon as I have flayed it properly.\n\nLYSISTRATA\n\nYou'll not flay anything. For if you begin\nThere'll not be one here but has a patch to be flayed.\n\n3RD WOMAN\n\nO holy Eilithyia, stay this birth\nTill I have left the precincts of the place!\n\nLYSISTRATA\n\nWhat nonsense is this?\n\n3RD WOMAN\n\nI'll drop it any minute.\n\nLYSISTRATA\n\nYesterday you weren't with child.\n\n3RD WOMAN\n\nBut I am today.\nO let me find a midwife, Lysistrata.\nO quickly!\n\nLYSISTRATA\n\nNow what story is this you tell?\nWhat is this hard lump here?\n\n3RD WOMAN\n\nIt's a male child.\n\nLYSISTRATA\n\nBy Aphrodite, it isn't. Your belly's hollow,\nAnd it has the feel of metal.... Well, I soon can see.\nYou hussy, it's Athene's sacred helm,\nAnd you said you were with child.\n\n3RD WOMAN\n\nAnd so I am.\n\nLYSISTRATA\n\nThen why the helm?\n\n3RD WOMAN\n\nSo if the throes should take me\nStill in these grounds I could use it like a dove\nAs a laying-nest in which to drop the child.\n\nLYSISTRATA\n\nMore pretexts! You can't hide your clear intent,\nAnd anyway why not wait till the tenth day\nMeditating a brazen name for your brass brat?\n\nWOMAN\n\nAnd I can't sleep a wink. My nerve is gone\nSince I saw that snake-sentinel of the shrine.\n\nWOMAN\n\nAnd all those dreadful owls with their weird hooting!\nThough I'm wearied out, I can't close an eye.\n\nLYSISTRATA\n\nYou wicked women, cease from juggling lies.\nYou want your men. But what of them as well?\nThey toss as sleepless in the lonely night,\nI'm sure of it. Hold out awhile, hold out,\nBut persevere a teeny-weeny longer.\nAn oracle has promised Victory\nIf we don't wrangle. Would you hear the words?\n\nWOMEN\n\nYes, yes, what is it?\n\nLYSISTRATA\n\nSilence then, you chatterboxes.\nHere--\n_Whenas the swallows flocking in one place from the hoopoes\nDeny themselves love's gambols any more,\nAll woes shall then have ending and great Zeus the Thunderer\nShall put above what was below before._\n\nWOMEN\n\nWill the men then always be kept under us?\n\nLYSISTRATA\n_But if the swallows squabble among themselves and fly away\nOut of the temple, refusing to agree,\nThen The Most Wanton Birds in all the World\nThey shall be named for ever. That's his decree._\n\nWOMAN\n\nIt's obvious what it means.\n\nLYSISTRATA\n\n                     Now by all the gods\nWe must let no agony deter from duty,\nBack to your quarters. For we are base indeed,\nMy friends, if we betray the oracle.\n\n_She goes out._\n\n\nOLD MEN.\n\nI'd like to remind you of a fable they used to employ,\nWhen I was a little boy:\nHow once through fear of the marriage-bed a young man,\nMelanion by name, to the wilderness ran,\nAnd there on the hills he dwelt.\nFor hares he wove a net\nWhich with his dog he set--\nMost likely he's there yet.\nFor he never came back home, so great was the fear he felt.\nI loathe the sex as much as he,\nAnd therefore I no less shall be\nAs chaste as was Melanion.\n\nMAN\n\nGrann'am, do you much mind men?\n\nWOMAN\n\nOnions you won't need, to cry.\n\nMAN\n\nFrom my foot you shan't escape.\n\nWOMAN\n\nWhat thick forests I espy.\n\nMEN\n\nSo much Myronides' fierce beard\nAnd thundering black back were feared,\nThat the foe fled when they were shown--\nBrave he as Phormion.\n\nWOMEN.\n\nWell, I'll relate a rival fable just to show to you\nA different point of view:\nThere was a rough-hewn fellow, Timon, with a face\nThat glowered as through a thorn-bush in a wild, bleak place.\nHe too decided on flight,\nThis very Furies' son,\nAll the world's ways to shun\nAnd hide from everyone,\nSpitting out curses on all knavish men to left and right.\nBut though he reared this hate for men,\nHe loved the women even then,\nAnd never thought them enemies.\n\nWOMAN\n\nO your jaw I'd like to break.\n\nMAN\n\nThat I fear do you suppose?\n\nWOMAN\n\nLearn what kicks my legs can make.\n\nMAN\n\nRaise them up, and you'll expose--\n\nWOMAN\n\nNay, you'll see there, I engage,\nAll is well kept despite my age,\nAnd tended smooth enough to slip\nFrom any adversary's grip.\n\nLYSISTRATA _appears_.\n\nLYSISTRATA\n\nHollo there, hasten hither to me\nSkip fast along.\n\nWOMAN\n\nWhat is this? Why the noise?\n\nLYSISTRATA\n\nA man, a man! I spy a frenzied man!\nHe carries Love upon him like a staff.\nO Lady of Cyprus, and Cythera, and Paphos,\nI beseech you, keep our minds and hands to the oath.\n\nWOMAN\n\nWhere is he, whoever he is?\n\nLYSISTRATA\n\nBy the Temple of Chloe.\n\nWOMAN\n\nYes, now I see him, but who can he be?\n\nLYSISTRATA\n\nLook at him. Does anyone recognise his face?\n\nMYRRHINE\n\nI do. He is my husband, Cinesias.\n\nLYSISTRATA\n\nYou know how to work. Play with him, lead him on,\nSeduce him to the cozening-point--kiss him, kiss him,\nThen slip your mouth aside just as he's sure of it,\nUngirdle every caress his mouth feels at\nSave that the oath upon the bowl has locked.\n\nMYRRHINE\n\nYou can rely on me.\n\nLYSISTRATA\n\nI'll stay here to help\nIn working up his ardor to its height\nOf vain magnificence.... The rest to their quarters.\n\n_Enter_ CINESIAS.\n\nWho is this that stands within our lines?\n\nCINESIAS\n\nI.\n\nLYSISTRATA\n\nA man?\n\nCINESIAS\n\nToo much a man!\n\nLYSISTRATA\n\nThen be off at once.\n\nCINESIAS\n\nWho are you that thus eject me?\n\nLYSISTRATA\n\nGuard for the day.\n\nCINESIAS\n\nBy all the gods, then call Myrrhine hither.\n\nLYSISTRATA\n\nSo, call Myrrhine hither! Who are you?\n\nCINESIAS\n\nI am her husband Cinesias, son of Anthros.\n\nLYSISTRATA\n\nWelcome, dear friend! That glorious name of yours\nIs quite familiar in our ranks. Your wife\nContinually has it in her mouth.\nShe cannot touch an apple or an egg\nBut she must say, \"This to Cinesias!\"\n\nCINESIAS\n\nO is that true?\n\nLYSISTRATA\n\nBy Aphrodite, it is.\nIf the conversation strikes on men, your wife\nCuts in with, \"All are boobies by Cinesias.\"\n\nCINESIAS\n\nThen call her here.\n\nLYSISTRATA\n\nAnd what am I to get?\n\nCINESIAS\n\nThis, if you want it.... See, what I have here.\nBut not to take away.\n\nLYSISTRATA\n\nThen I'll call her.\n\nCINESIAS\n\nBe quick, be quick. All grace is wiped from life\nSince she went away. O sad, sad am I\nWhen there I enter on that loneliness,\nAnd wine is unvintaged of the sun's flavour.\nAnd food is tasteless. But I've put on weight.\n\nMYRRHINE (_above_)\n\nI love him O so much! but he won't have it.\nDon't call me down to him.\n\nCINESIAS\n\nSweet little Myrrhine!\nWhat do you mean? Come here.\n\nMYRRHINE\n\nO no I won't.\nWhy are you calling me? You don't want me.\n\nCINESIAS\n\nNot want you! with this week-old strength of love.\n\nMYRRHINE\n\nFarewell.\n\nCINESIAS\n\nDon't go, please don't go, Myrrhine.\nAt least you'll hear our child. Call your mother, lad.\n\nCHILD\n\nMummy ... mummy ... mummy!\n\nCINESIAS\n\nThere now, don't you feel pity for the child?\nHe's not been fed or washed now for six days.\n\nMYRRHINE\n\nI certainly pity him with so heartless a father.\n\nCINESIAS\n\nCome down, my sweetest, come for the child's sake.\n\nMYRRHINE\n\nA trying life it is to be a mother!\nI suppose I'd better go.             _She comes down._\n\nCINESIAS\n\nHow much younger she looks,\nHow fresher and how prettier! Myrrhine,\nLift up your lovely face, your disdainful face;\nAnd your ankle ... let your scorn step out its worst;\nIt only rubs me to more ardor here.\n\nMYRRHINE (_playing with the child_)\n\nYou're as innocent as he's iniquitous.\nLet me kiss you, honey-petting, mother's darling.\n\nCINESIAS\n\nHow wrong to follow other women's counsel\nAnd let loose all these throbbing voids in yourself\nAs well as in me. Don't you go throb-throb?\n\nMYRRHINE\n\nTake away your hands.\n\nCINESIAS\n\nEverything in the house\nIs being ruined.\n\nMYRRHINE\n\nI don't care at all.\n\nCINESIAS\n\nThe roosters are picking all your web to rags.\nDo you mind that?\n\nMYRRHINE\n\nNot I.\n\nCINESIAS\n\nWhat time we've wasted\nWe might have drenched with Paphian laughter, flung\nOn Aphrodite's Mysteries. O come here.\n\nMYRRHINE\n\nNot till a treaty finishes the war.\n\nCINESIAS\n\nIf you must have it, then we'll get it done.\n\nMYRRHINE\n\nDo it and I'll come home. Till then I am bound.\n\nCINESIAS\n\nWell, can't your oath perhaps be got around?\n\nMYRRHINE\n\nNo ... no ... still I'll not say that I don't love you.\n\nCINESIAS\n\nYou love me! Then dear girl, let me also love you.\n\nMYRRHINE\n\nYou must be joking. The boy's looking on.\n\nCINESIAS\n\nHere, Manes, take the child home!... There, he's gone.\nThere's nothing in the way now. Come to the point.\n\nMYRRHINE\n\nHere in the open! In plain sight?\n\nCINESIAS\n\nIn Pan's cave.\nA splendid place.\n\nMYRRHINE\n\nWhere shall I dress my hair again\nBefore returning to the citadel?\n\nCINESIAS\n\nYou can easily primp yourself in the Clepsydra.\n\nMYRRHINE\n\nBut how can I break my oath?\n\nCINESIAS\n\nLeave that to me,\nI'll take all risk.\n\nMYRRHINE\n\nWell, I'll make you comfortable.\n\nCINESIAS\n\nDon't worry. I'd as soon lie on the grass.\n\nMYRRHINE\n\nNo, by Apollo, in spite of all your faults\nI won't have you lying on the nasty earth.\n(_From here MYRRHINE keeps on going off to fetch things._)\n\nCINESIAS\n\nAh, how she loves me.\n\nMYRRHINE\n\nRest there on the bench,\nWhile I arrange my clothes. O what a nuisance,\nI must find some cushions first.\n\nCINESIAS\n\nWhy some cushions?\nPlease don't get them!\n\nMYRRHINE\n\nWhat? The plain, hard wood?\nNever, by Artemis! That would be too vulgar.\n\nCINESIAS\n\nOpen your arms!\n\nMYRRHINE\n\nNo. Wait a second.\n\nCINESIAS\n\nO....\nThen hurry back again.\n\nMYRRHINE\n\nHere the cushions are.\nLie down while I--O dear! But what a shame,\nYou need more pillows.\n\nCINESIAS\n\nI don't want them, dear.\n\nMYRRHINE\n\nBut I do.\n\nCINESIAS\n\nThwarted affection mine,\nThey treat you just like Heracles at a feast\nWith cheats of dainties, O disappointing arms!\n\nMYRRHINE\n\nRaise up your head.\n\nCINESIAS\n\nThere, that's everything at last.\n\nMYRRHINE\n\nYes, all.\n\nCINESIAS\n\nThen run to my arms, you golden girl.\n\nMYRRHINE\n\nI'm loosening my girdle now. But you've not forgotten?\nYou're not deceiving me about the Treaty?\n\nCINESIAS\n\nNo, by my life, I'm not.\n\nMYRRHINE\n\nWhy, you've no blanket.\n\nCINESIAS\n\nIt's not the silly blanket's warmth but yours I want.\n\nMYRRHINE\n\nNever mind. You'll soon have both. I'll come straight back.\n\nCINESIAS\n\nThe woman will choke me with her coverlets.\n\nMYRRHINE\n\nGet up a moment.\n\nCINESIAS\n\nI'm up high enough.\n\nMYRRHINE\n\nWould you like me to perfume you?\n\nCINESIAS\n\nBy Apollo, no!\n\nMYRRHINE\n\nBy Aphrodite, I'll do it anyway.\n\nCINESIAS\n\nLord Zeus, may she soon use up all the myrrh.\n\nMYRRHINE\n\nStretch out your hand. Take it and rub it in.\n\nCINESIAS\n\nHmm, it's not as fragrant as might be; that is,\nNot before it's smeared. It doesn't smell of kisses.\n\nMYRRHINE\n\nHow silly I am: I've brought you Rhodian scents.\n\nCINESIAS\n\nIt's good enough, leave it, love.\n\nMYRRHINE\n\nYou must be jesting.\n\nCINESIAS\n\nPlague rack the man who first compounded scent!\n\nMYRRHINE\n\nHere, take this flask.\n\nCINESIAS\n\nI've a far better one.\nDon't tease me, come here, and get nothing more.\n\nMYRRHINE\n\nI'm coming.... I'm just drawing off my shoes....\nYou're sure you will vote for Peace?\n\nCINESIAS\n\nI'll think about it.\n_She runs off._\nI'm dead: the woman's worn me all away.\nShe's gone and left me with an anguished pulse.\n\nMEN\n\nBaulked in your amorous delight\nHow melancholy is your plight.\nWith sympathy your case I view;\nFor I am sure it's hard on you.\nWhat human being could sustain\nThis unforeseen domestic strain,\nAnd not a single trace\nOf willing women in the place!\n\nCINESIAS\n\nO Zeus, what throbbing suffering!\n\nMEN\n\nShe did it all, the harlot, she\nWith her atrocious harlotry.\n\nWOMEN\n\nNay, rather call her darling-sweet.\n\nMEN\n\nWhat, sweet? She's a rude, wicked thing.\n\nCINESIAS\n\nA wicked thing, as I repeat.\nO Zeus, O Zeus,\nCanst Thou not suddenly let loose\nSome twirling hurricane to tear\nHer flapping up along the air\nAnd drop her, when she's whirled around,\nHere to the ground\nNeatly impaled upon the stake\nThat's ready upright for her sake.\n_He goes out._\n\n_Enter_ SPARTAN HERALD.\n\n_The_ MAGISTRATE _comes forward_.\n\nHERALD\n\nWhat here gabs the Senate an' the Prytanes?\nI've fetcht despatches for them.\n\nMAGISTRATE\n\nAre you a man\nOr a monstrosity?\n\nHERALD\n\nMy scrimp-brained lad,\nI'm a herald, as ye see, who hae come frae Sparta\nAnent a Peace.\n\nMAGISTRATE\n\nThen why do you hide that lance\nThat sticks out under your arms?\n\nHERALD.\n\nI've brought no lance.\n\nMAGISTRATE\n\nThen why do you turn aside and hold your cloak\nSo far out from your body? Is your groin swollen\nWith stress of travelling?\n\nHERALD\n\nBy Castor, I'll swear\nThe man is wud.\n\nMAGISTRATE\n\nIndeed, your cloak is wide,\nMy rascal fellow.\n\nHERALD\n\nBut I tell ye No!\nEnow o' fleering!\n\nMAGISTRATE\n\nWell, what is it then?\n\nHERALD\n\nIt's my despatch cane.\n\nMAGISTRATE\n\nOf course--a Spartan cane!\nBut speak right out. I know all this too well.\nAre new privations springing up in Sparta?\n\nHERALD\n\nOch, hard as could be: in lofty lusty columns\nOur allies stand united. We maun get Pellene.\n\nMAGISTRATE\n\nWhence has this evil come? Is it from Pan?\n\nHERALD\n\nNo. Lampito first ran asklent, then the others\nSprinted after her example, and blocked, the hizzies,\nTheir wames unskaithed against our every fleech.\n\nMAGISTRATE\n\nWhat did you do?\n\nHERALD\n\nWe are broken, and bent double,\nLimp like men carrying lanthorns in great winds\nAbout the city. They winna let us even\nWi' lightest neif skim their primsie pretties\nTill we've concluded Peace-terms wi' a' Hellas.\n\nMAGISTRATE\n\nSo the conspiracy is universal;\nThis proves it. Then return to Sparta. Bid them\nSend envoys with full powers to treat of Peace;\nAnd I will urge the Senate here to choose\nPlenipotentiary ambassadors,\nAs argument adducing this connection.\n\nHERALD\n\nI'm off. Your wisdom none could contravert.\n_They retire._\n\nMEN\n\nThere is no beast, no rush of fire, like woman so untamed.\nShe calmly goes her way where even panthers would be shamed.\n\nWOMEN\n\nAnd yet you are fool enough, it seems, to dare to war with me,\nWhen for your faithful ally you might win me easily.\n\nMEN\n\nNever could the hate I feel for womankind grow less.\n\nWOMEN\n\nThen have your will. But I'll take pity on your nakedness.\nFor I can see just how ridiculous you look, and so\nWill help you with your tunic if close up I now may go.\n\nMEN\n\nWell, that, by Zeus, is no scoundrel-deed, I frankly will admit.\nI only took them off myself in a scoundrel raging-fit.\n\nWOMEN\n\nNow you look sensible, and that you're men no one could doubt.\nIf you were but good friends again, I'd take the insect out\nThat hurts your eye.\n\nMEN\n\nIs that what's wrong? That nasty bitie thing.\nPlease squeeze it out, and show me what it is that makes this sting.\nIt's been paining me a long while now.\n\nWOMEN\n\nWell I'll agree to that,\nAlthough you're most unmannerly. O what a giant gnat.\nHere, look! It comes from marshy Tricorysus, I can tell.\n\nMEN\n\nO thank you. It was digging out a veritable well.\nNow that it's gone, I can't hold back my tears. See how they fall.\n\nWOMEN\n\nI'll wipe them off, bad as you are, and kiss you after all.\n\nMEN\n\nI won't be kissed.\n\nWOMEN\n\nO yes, you will. Your wishes do not matter.\n\nMEN\n\nO botheration take you all! How you cajole and flatter.\nA hell it is to live with you; to live without, a hell:\nHow truly was that said. But come, these enmities let's quell.\nYou stop from giving orders and I'll stop from doing wrong.\nSo let's join ranks and seal our bargain with a choric song.\n\nCHORUS.\n\nAthenians, it's not our intention\nTo sow political dissension\nBy giving any scandal mention;\nBut on the contrary to promote good feeling in the state\nBy word and deed. We've had enough calamities of late.\nSo let a man or woman but divulge\nThey need a trifle, say,\nTwo minas, three or four,\nI've purses here that bulge.\nThere's only one condition made\n(Indulge my whim in this I pray)--\nWhen Peace is signed once more,\nOn no account am I to be repaid.\n\nAnd I'm making preparation\nFor a gay select collation\nWith some youths of reputation.\nI've managed to produce some soup and they're slaughtering for me\nA sucking-pig: its flesh should taste as tender as could be.\nI shall expect you at my house today.\nTo the baths make an early visit,\nAnd bring your children along;\nDon't dawdle on the way.\nAsk no one; enter as if the place\nWas all your own--yours henceforth is it.\nIf nothing chances wrong,\nThe door will then be shut bang in your face.\n\n_The_ SPARTAN AMBASSADORS _approach_.\n\nCHORUS\n\nHere come the Spartan envoys with long, worried beards.\nHail, Spartans how do you fare?\nDid anything new arise?\n\nSPARTANS\n\nNo need for a clutter o' words. Do ye see our condition?\n\nCHORUS\n\nThe situation swells to greater tension.\nSomething will explode soon.\n\nSPARTANS\n\nIt's awfu' truly.\nBut come, let us wi' the best speed we may\nScribble a Peace.\n\nCHORUS\n\nI notice that our men\nLike wrestlers poised for contest, hold their clothes\nOut from their bellies. An athlete's malady!\nSince exercise alone can bring relief.\n\nATHENIANS\n\nCan anyone tell us where Lysistrata is?\nThere is no need to describe our men's condition,\nIt shows up plainly enough.\n\nCHORUS\n\nIt's the same disease.\nDo you feel a jerking throbbing in the morning?\n\nATHENIANS\n\nBy Zeus, yes! In these straits, I'm racked all through.\nUnless Peace is soon declared, we shall be driven\nIn the void of women to try Cleisthenes.\n\nCHORUS\n\nBe wise and cover those things with your tunics.\nWho knows what kind of person may perceive you?\n\nATHENIANS\n\nBy Zeus, you're right.\n\nSPARTANS\n\nBy the Twa Goddesses,\nIndeed ye are. Let's put our tunics on.\n\nATHENIANS\n\nHail O my fellow-sufferers, hail Spartans.\n\nSPARTANS\n\nO hinnie darling, what a waefu' thing!\nIf they had seen us wi' our lunging waddies!\n\nATHENIANS\n\nTell us then, Spartans, what has brought you here?\n\nSPARTANS\n\nWe come to treat o' Peace.\n\nATHENIANS\n\nWell spoken there!\nAnd we the same. Let us callout Lysistrata\nSince she alone can settle the Peace-terms.\n\nSPARTANS\n\nCallout Lysistratus too if ye don't mind.\n\nCHORUS\n\nNo indeed. She hears your voices and she comes.\n\n_Enter LYSISTRATA_\n\nHail, Wonder of all women! Now you must be in turn\nHard, shifting, clear, deceitful, noble, crafty, sweet, and stern.\nThe foremost men of Hellas, smitten by your fascination,\nHave brought their tangled quarrels here for your sole arbitration.\n\nLYSISTRATA\n\nAn easy task if the love's raging home-sickness\nDoesn't start trying out how well each other\nWill serve instead of us. But I'll know at once\nIf they do. O where's that girl, Reconciliation?\nBring first before me the Spartan delegates,\nAnd see you lift no rude or violent hands--\nNone of the churlish ways our husbands used.\nBut lead them courteously, as women should.\nAnd if they grudge fingers, guide them by other methods,\nAnd introduce them with ready tact. The Athenians\nDraw by whatever offers you a grip.\nNow, Spartans, stay here facing me. Here you,\nAthenians. Both hearken to my words.\nI am a woman, but I'm not a fool.\nAnd what of natural intelligence I own\nHas been filled out with the remembered precepts\nMy father and the city-elders taught me.\nFirst I reproach you both sides equally\nThat when at Pylae and Olympia,\nAt Pytho and the many other shrines\nThat I could name, you sprinkle from one cup\nThe altars common to all Hellenes, yet\nYou wrack Hellenic cities, bloody Hellas\nWith deaths of her own sons, while yonder clangs\nThe gathering menace of barbarians.\n\nATHENIANS\n\nWe cannot hold it in much longer now.\n\nLYSISTRATA\n\nNow unto you, O Spartans, do I speak.\nDo you forget how your own countryman,\nPericleidas, once came hither suppliant\nBefore our altars, pale in his purple robes,\nPraying for an army when in Messenia\nDanger growled, and the Sea-god made earth quaver.\nThen with four thousand hoplites Cimon marched\nAnd saved all Sparta. Yet base ingrates now,\nYou are ravaging the soil of your preservers.\n\nATHENIANS\n\nBy Zeus, they do great wrong, Lysistrata.\n\nSPARTANS\n\nGreat wrong, indeed. O! What a luscious wench!\n\nLYSISTRATA\n\nAnd now I turn to the Athenians.\nHave you forgotten too how once the Spartans\nIn days when you wore slavish tunics, came\nAnd with their spears broke a Thessalian host\nAnd all the partisans of Hippias?\nThey alone stood by your shoulder on that day.\nThey freed you, so that for the slave's short skirt\nYou should wear the trailing cloak of liberty.\n\nSPARTANS\n\nI've never seen a nobler woman anywhere.\n\nATHENIANS\n\nNor I one with such prettily jointing hips.\n\nLYSISTRATA\n\nNow, brethren twined with mutual benefactions,\nCan you still war, can you suffer such disgrace?\nWhy not be friends? What is there to prevent you?\n\nSPARTANS\n\nWe're agreed, gin that we get this tempting Mole.\n\nLYSISTRATA\n\nWhich one?\n\nSPARTANS\n\nThat ane we've wanted to get into,\nO for sae lang.... Pylos, of course.\n\nATHENIANS\n\nBy Poseidon,\nNever!\n\nLYSISTRATA\n\nGive it up.\n\nATHENIANS\n\nThen what will we do?\nWe need that ticklish place united to us--\n\nLYSISTRATA\n\nAsk for some other lurking-hole in return.\n\nATHENIANS\n\nThen, ah, we'll choose this snug thing here, Echinus,\nShall we call the nestling spot? And this backside haven,\nThese desirable twin promontories, the Maliac,\nAnd then of course these Megarean Legs.\n\nSPARTANS\n\nNot that, O surely not that, never that.\n\nLYSISTRATA\n\nAgree! Now what are two legs more or less?\n\nATHENIANS\n\nI want to strip at once and plough my land.\n\nSPARTANS\n\nAnd mine I want to fertilize at once.\n\nLYSISTRATA\n\nAnd so you can, when Peace is once declared.\nIf you mean it, get your allies' heads together\nAnd come to some decision.\n\nATHENIANS\n\nWhat allies?\nThere's no distinction in our politics:\nWe've risen as one man to this conclusion;\nEvery ally is jumping-mad to drive it home.\n\nSPARTANS\n\nAnd ours the same, for sure.\n\nATHENIANS\n\nThe Carystians first!\nI'll bet on that.\n\nLYSISTRATA\n\nI agree with all of you.\nNow off, and cleanse yourselves for the Acropolis,\nFor we invite you all in to a supper\nFrom our commissariat baskets. There at table\nYou will pledge good behaviour and uprightness;\nThen each man's wife is his to hustle home.\n\nATHENIANS\n\nCome, as quickly as possible.\n\nSPARTANS\n\nAs quick as ye like.\nLead on.\n\nATHENIANS\n\nO Zeus, quick, quick, lead quickly on.\n_They hurry off._\n\nCHORUS.\n\nBroidered stuffs on high I'm heaping,\nFashionable cloaks and sweeping\nTrains, not even gold gawds keeping.\nTake them all, I pray you, take them all (I do not care)\nAnd deck your children--your daughter, if the Basket she's to bear.\nCome, everyone of you, come in and take\nOf this rich hoard a share.\nNought's tied so skilfully\nBut you its seal can break\nAnd plunder all you spy inside.\nI've laid out all that I can spare,\nAnd therefore you will see\nNothing unless than I you're sharper-eyed.\nIf lacking corn a man should be\nWhile his slaves clamour hungrily\nAnd his excessive progeny,\nThen I've a handfull of grain at home which is always to be had,\nAnd to which in fact a more-than-life-size loaf I'd gladly add.\nThen let the poor bring with them bag or sack\nAnd take this store of food.\nManes, my man, I'll tell\nTo help them all to pack\nTheir wallets full. But O take care.\nI had forgotten; don't intrude,\nOr terrified you'll yell.\nMy dog is hungry too, and bites--beware!\n\nSome _LOUNGERS_ from the Market with torches approach\nthe Banqueting hall. The _PORTER_ bars their entrance.\n\n1ST MARKET-LOUNGER\n\nOpen the door.\n\nPORTER\n\nHere move along.\n\n1ST MARKET-LOUNGER\n\nWhat's this?\nYou're sitting down. Shall I singe you with my torch?\nThat's vulgar! O I couldn't do it ... yet\nIf it would gratify the audience,\nI'll mortify myself.\n\n2ND MARKET-LOUNGER\n\nAnd I will too.\nWe'll both be crude and vulgar, yes we will.\n\nPORTER\n\nBe off at once now or you'll be wailing\nDirges for your hair. Get off at once,\nAnd see you don't disturb the Spartan envoys\nJust coming out from the splendid feast they've had.\n\n_The banqueters begin to come out._\n\n1ST ATHENIAN\n\nI've never known such a pleasant banquet before,\nAnd what delightful fellows the Spartans are.\nWhen we are warm with wine, how wise we grow.\n\n2ND ATHENIAN\n\nThat's only fair, since sober we're such fools:\nThis is the advice I'd give the Athenians--\nSee our ambassadors are always drunk.\nFor when we visit Sparta sober, then\nWe're on the alert for trickery all the while\nSo that we miss half of the things they say,\nAnd misinterpret things that were never said,\nAnd then report the muddle back to Athens.\nBut now we're charmed with each other. They might cap\nWith the Telamon-catch instead of the Cleitagora,\nAnd we'd applaud and praise them just the same;\nWe're not too scrupulous in weighing words.\n\nPORTER\n\nWhy, here the rascals come again to plague me.\nWon't you move on, you sorry loafers there!\n\nMARKET-LOUNGER\n\nYes, by Zeus, they're already coming out.\n\nSPARTANS\n\nNow hinnie dearest, please tak' up your pipe\nThat I may try a spring an' sing my best\nIn honour o' the Athenians an' oursels.\n\nATHENIANS\n\nAye, take your pipe. By all the gods, there's nothing\nCould glad my heart more than to watch you dance.\n\nSPARTANS.\n\nMnemosyne,\nLet thy fire storm these younkers,\nO tongue wi' stormy ecstasy\nMy Muse that knows\nOur deeds and theirs, how when at sea\nTheir navies swooped upon\nThe Medes at Artemision--\nGods for their courage, did they strike\nWrenching a triumph frae their foes;\nWhile at Thermopylae\nLeonidas' army stood: wild-boars they were like\nWild-boars that wi' fierce threat\nTheir terrible tusks whet;\nThe sweat ran streaming down each twisted face,\nFaen blossoming i' strange petals o' death\nPanted frae mortal breath,\nThe sweat drenched a' their bodies i' that place,\nFor the hurly-burly o' Persians glittered more\nThan the sands on the shore.\n\nCome, Hunting Girl, an' hear my prayer--\nYou whose arrows whizz in woodlands, come an' bless\nThis Peace we swear.\nLet us be fenced wi' age long amity,\nO let this bond stick ever firm through thee\nIn friendly happiness.\nHenceforth no guilefu' perjury be seen!\nO hither, hither O\nThou wildwood queen.\n\nLYSISTRATA\n\nEarth is delighted now, peace is the voice of earth.\nSpartans, sort out your wives: Athenians, yours.\nLet each catch hands with his wife and dance his joy,\nDance out his thanks, be grateful in music,\nAnd promise reformation with his heels.\n\nATHENIANS.\n\nO Dancers, forward. Lead out the Graces,\nCall Artemis out;\nThen her brother, the Dancer of Skies,\nThat gracious Apollo.\nInvoke with a shout\nDionysus out of whose eyes\nBreaks fire on the maenads that follow;\nAnd Zeus with his flares of quick lightning, and call,\nHappy Hera, Queen of all,\nAnd all the Daimons summon hither to be\nWitnesses of our revelry\nAnd of the noble Peace we have made,\nAphrodite our aid.\nIo Paieon, Io, cry--\nFor victory, leap!\nAttained by me, leap!\nEuoi Euoi Euai Euai.\n\nSPARTANS\n\nPiper, gie us the music for a new sang.\n\nSPARTANS.\n\nLeaving again lovely lofty Taygetus\nHither O Spartan Muse, hither to greet us,\nAnd wi' our choric voice to raise\nTo Amyclean Apollo praise,\nAnd Tyndareus' gallant sons whose days\nAlang Eurotas' banks merrily pass,\nAn' Athene o' the House o' Brass.\n\nNow the dance begin;\nDance, making swirl your fringe o' woolly skin,\nWhile we join voices\nTo hymn dear Sparta that rejoices\nI' a beautifu' sang,\nAn' loves to see\nDancers tangled beautifully;\nFor the girls i' tumbled ranks\nAlang Eurotas' banks\nLike wanton fillies thrang,\nFrolicking there\nAn' like Bacchantes shaking the wild air\nTo comb a giddy laughter through the hair,\nBacchantes that clench thyrsi as they sweep\nTo the ecstatic leap.\n\nAn' Helen, Child o' Leda, come\nThou holy, nimble, gracefu' Queen,\nLead thou the dance, gather thy joyous tresses up i' bands\nAn' play like a fawn. To madden them, clap thy hands,\nAnd sing praise to the warrior goddess templed i' our lands,\nHer o' the House o' Brass.", "title": "Lysistrata"}