{"summary": "\nAs a prologue, the Chorus introduces us to Faustus and his story. He is described as being \"baste of stock\", however he is able to become a Doctor. During this opening, we also get our first clue to the source of Faustus's downfall. Faustus's tale is likened to that of Icarus, who flew too close to the sun and fell to his death when the sun melted his waxen wings. This is a hint to Faustus's end as well as bringing our attention to the idea of hubris (excessive pride) which is represented in the Icarus story, and ultimately Faustus'.\nFaustus comments that he has reached the end of every subject he has studied. He appreciates Logic as being a tool for arguing; Medicine as being unvalued unless it allowed raising the dead and immortality; Law as being upstanding and above him; Divinity as useless because he feels that all humans commit sin, and thus to have sins punishable by death complicates the logic of Divinity. He dismisses it as \"What doctrine call you this? Que sera, sera\" (What will be, shall be).\nHe calls upon his servant Wagner to bring forth Valdes and Cornelius, two famous magicians. After Valdes and Cornelius teach Faustus how to summon a devil, two angels, the Good Angel and the Bad Angel, appear to Faustus and dispense their own perspective of his interest in Satan. Though Faustus is momentarily dissuaded, proclaiming \"How am I glutted with conceit of this?\", he is apparently won over by the possibilities Magic offers to him. Valdes declares that if Faustus devotes himself to Magic, he must vow not to study anything else and points out that great things are indeed possible with someone of Faustus's standing.\nFaustus's absence is noted by two scholars who are less accomplished than Faustus himself. They request that Wagner reveal Faustus's present location, a request which Wagner haughtily denies. The two scholars worry about Faustus falling deep into the art of Magic and leave to inform the King.\nFaustus summons a devil, in the presence of Lucifer and other devils although Faustus is unaware of it. After creating a magic circle and speaking an incantation in which he revokes his baptism, Faustus sees a devil named Mephistophilis appear before him. Faustus is unable to tolerate the hideous looks of the devil and commands it to change its appearance. Faustus, in seeing the obedience of the devil (for changing form), takes pride in his skill. He tries to bind the devil to his service but is unable to because Mephistophilis already serves Lucifer, the prince of devils. Mephistophilis also reveals that it was not Faustus's power that summoned him but rather that if anyone abjures the scriptures it results in the Devil coming to claim their soul.\nMephistophilis introduces the history of Lucifer and the other devils while indirectly telling Faustus that hell has no circumference and is more of a state of mind than a physical location. Faustus' inquiries into the nature of hell lead to Mephistophilis saying: \"Oh, Faustus, leave these frivolous demands, which strikes a terror to my fainting soul\".\n\nUsing Mephistophilis as a messenger, Faustus strikes a deal with Lucifer: he is to be allotted twenty-four years of life on Earth, during which time he will have Mephistophilis as his personal servant. At the end he will give his soul over to Lucifer as payment and spend the rest of time as one damned to Hell. This deal is to be sealed in Faustus's own blood. After cutting his arm, the wound is divinely healed and the Latin words \"Homo, fuge!\" (Flee, man!) then appear upon it. Despite the dramatic nature of this divine intervention, Faustus disregards the inscription with the assertion that he is already damned by his actions thus far and therefore left with no place to which he could flee. Mephistophilis brings coals to break the wound open again, and thus Faustus is able to take his oath that was written in his own blood.\n\nFaustus begins by asking Mephistophilis a series of science-related questions. However, the devil seems to be quite evasive and finishes with a Latin phrase, \"Per inoequalem motum respectu totius\" (\"through unequal motion with respect to the whole thing\"). This sentence has not the slightest scientific value, thus giving the impression that Mephistophilis is untrustworthy.\nThe good and evil angels return to Faustus: the good angel urges him to repent and revoke his oath to Lucifer. This is the largest fault of Faustus throughout the play: he is blind to his own salvation. Though he is told initially by Mephistophilis to \"leave these frivolous demands\", Faustus remains set on his soul's damnation.\nLucifer brings to Faustus the personification of the seven deadly sins. Faustus fails to see them as warnings and ignores them.\nFrom this point until the end of the play, Faustus does nothing worthwhile, having begun his pact with the attitude that he would be able to do anything. Instead, he merely uses his temporary powers for practical jokes. Realising that he gave up his soul for no good reason, Faustus appears to scholars and warns them that he is damned and will not be long on the earth. He gives a speech about how he is damned and eventually seems to repent for his deeds. Mephistophilis comes to collect his soul, and we are told that he exits back to hell with him.\n\nAt the end of the play, devils carry Faustus off the stage. In the later 'B text' of the play, there is a subsequent scene [V.iii] where the three scholars discover his remains strewn about the stage: they state that Faustus was damned, one scholar declaring that the devils have torn him asunder.\n\nThe theological implications of Doctor Faustus have been the subject of considerable debate throughout the last century. Among the most complicated points of contention is whether the play supports or challenges the Calvinist doctrine of absolute predestination, which dominated the lectures and writings of many English scholars in the latter half of the sixteenth century. According to Calvin, predestination meant that God, acting of his own free will, elects some people to be saved and others to be damned – thus, the individual has no control over his own ultimate fate. This doctrine was the source of great controversy because it was seen by the so-called anti-Calvinists to limit man's free will in regard to faith and salvation, and to present a dilemma in terms of theodicy.\nAt the time Doctor Faustus was performed, this doctrine was on the rise in England, and under the direction of Puritan theologians at Cambridge and Oxford had come to be considered the orthodox position of the Church of England. Nevertheless, it remained the source of vigorous and, at times, heated debate between Calvinist scholars, such as William Whitaker and William Perkins, and anti-Calvinists, such as William Barrett and Peter Baro. The dispute between these Cambridge intellectuals had quite nearly reached its zenith by the time Marlowe was a student there in the 1580s, and likely would have influenced him deeply, as it did many of his fellow students.\nConcerning the fate of Faustus, the Calvinist concludes that his damnation was inevitable. His rejection of God and subsequent inability to repent are taken as evidence that he never really belonged to the elect, but rather had been predestined from the very beginning for reprobation. In his Chiefe Points of Christian Religion, Theodore Beza, the successor to John Calvin, describes the category of sinner into which Faustus would most likely have been cast:\n\nTo conclude, they which are most miserable of all, those climb a degree higher, that their fall might be more grievous: for they are raised so high by some gift of grace, that they are little moved with some taste of the heavenly gift: so that for the time they seem to have received the seed...But this is plain, that the spirit of adoption, which we have said to be only proper unto them which are never cast forth, but are written in the secret of God's people, is never communicated to them, for were they of the elect they should remain still with the elect. All these therefore (because of necessity, and yet willingly, as they which are under the slavery of sin, return to their vomit, and fall away from faith) are plucked up by the roots, to be cast into the fire.\n\nFor the Calvinist, Faustus represents the worst kind of sinner, having tasted the heavenly gift and rejected it. His damnation is justified and deserved because he was never truly adopted among the elect. According to this view, the play demonstrates Calvin's \"three-tiered concept of causation,\" in which the damnation of Faustus is first willed by God, then by Satan, and finally, by himself. As Calvin himself explains it in his Institutes of Christian Religion:\n\nWe see therefore that it is no absurdity, that one self act be ascribed to God, to Satan, and to man: but the diversity in the end and manner of doing, causeth that therein appeareth the justice of God to be without fault, and also the wickedness of Satan and man, bewrayeth itself to their reproach.\n\nThe anti-Calvinist view, however, finds such thinking repugnant, and prefers to interpret Doctor Faustus as a criticism of such doctrines. One of the greatest critics of Calvinism in Marlowe's day was Peter Baro, who argued that such teachings fostered despair among believers, rather than repentance among sinners. He claimed, in fact, that Calvinism created a theodical dilemma:\n\nWhat shall we say then? That this question so long debated of the Philosophers, most wise men, and yet undetermined, cannot even of Divines, and men endued with heavenly wisdom, be discussed and decided? And that God hath in this case laid a crosse upon learned men, wherein they might perpetually torment themselves? I cannot so think.\n\nBaro recognised the threat of despair which faced the Protestant church if it did not come to an agreement of how to understand the fundamentals. For him, the Calvinists were overcomplicating the issues of faith and repentance, and thereby causing great and unnecessary confusion among struggling believers. Faustus himself confesses a similar sentiment regarding predestination:\n\n\"The reward of sin is death.\" That's hard.\n...\"If we say that we have no sin,\nWe deceive ourselves, and there's no truth in us.\"\nWhy then belike we must sin,\nAnd so consequently die.\nAy, we must die an everlasting death.\nWhat doctrine call you this? Che sera, sera,\n\"What will be, shall be\"? Divinity, adieu!\n\n", "full_text": "THE TRAGICAL HISTORY OF DOCTOR FAUSTUS\n\nBy Christopher Marlowe\n\nFrom The Quarto of 1604\n\nEdited by The Rev. Alexander Dyce\n\n\n\n\n\nTHE TRAGICALL HISTORY OF D. FAUSTUS.  AS IT HATH BENE ACTED\nBY THE RIGHT HONORABLE THE EARLE OF NOTTINGHAM HIS SERUANTS.\nWRITTEN BY CH. MARL.\n\nIn reprinting this edition, I have here and there amended the text\nby means of the later 4tos,--1616, 1624, 1631.--Of 4to 1663, which\ncontains various comparatively modern alterations and additions,\nI have made no use.\n\n\n\n\nDRAMATIS PERSONAE.\n\n     THE POPE.\n     CARDINAL OF LORRAIN.\n     THE EMPEROR OF GERMANY.\n     DUKE OF VANHOLT.\n     FAUSTUS.\n     VALDES,    ] friends to FAUSTUS.\n     CORNELIUS, ]\n     WAGNER, servant to FAUSTUS.\n     Clown.\n     ROBIN.\n     RALPH.\n     Vintner.\n     Horse-courser.\n     A Knight.\n     An Old Man.\n     Scholars, Friars, and Attendants.\n\n     DUCHESS OF VANHOLT\n\n     LUCIFER.\n     BELZEBUB.\n     MEPHISTOPHILIS.\n     Good Angel.\n     Evil Angel.\n     The Seven Deadly Sins.\n     Devils.\n     Spirits in the shapes of ALEXANDER THE GREAT, of his Paramour\n          and of HELEN.\n\n     Chorus.\n\n\n\n\n\nTHE TRAGICAL HISTORY OF DOCTOR FAUSTUS\n\nFROM THE QUARTO OF 1604.\n\n\n          Enter CHORUS.\n\n     CHORUS. Not marching now in fields of Thrasymene,\n     Where Mars did mate[1] the Carthaginians;\n     Nor sporting in the dalliance of love,\n     In courts of kings where state is overturn'd;\n     Nor in the pomp of proud audacious deeds,\n     Intends our Muse to vaunt[2] her[3] heavenly verse:\n     Only this, gentlemen,--we must perform\n     The form of Faustus' fortunes, good or bad:\n     To patient judgments we appeal our plaud,\n     And speak for Faustus in his infancy.\n     Now is he born, his parents base of stock,\n     In Germany, within a town call'd Rhodes:\n     Of riper years, to Wertenberg he went,\n     Whereas[4] his kinsmen chiefly brought him up.\n     So soon he profits in divinity,\n     The fruitful plot of scholarism grac'd,\n     That shortly he was grac'd with doctor's name,\n     Excelling all whose sweet delight disputes\n     In heavenly matters of theology;\n     Till swoln with cunning,[5] of a self-conceit,\n     His waxen wings did mount above his reach,\n     And, melting, heavens conspir'd his overthrow;\n     For, falling to a devilish exercise,\n     And glutted now[6] with learning's golden gifts,\n     He surfeits upon cursed necromancy;\n     Nothing so sweet as magic is to him,\n     Which he prefers before his chiefest bliss:\n     And this the man that in his study sits.\n          [Exit.]\n\n          FAUSTUS discovered in his study.[7]\n\n     FAUSTUS. Settle thy studies, Faustus, and begin\n     To sound the depth of that thou wilt profess:\n     Having commenc'd, be a divine in shew,\n     Yet level at the end of every art,\n     And live and die in Aristotle's works.\n     Sweet Analytics, 'tis thou[8] hast ravish'd me!\n     Bene disserere est finis logices.\n     Is, to dispute well, logic's chiefest end?\n     Affords this art no greater miracle?\n     Then read no more; thou hast attain'd that[9] end:\n     A greater subject fitteth Faustus' wit:\n     Bid Economy[10] farewell, and[11] Galen come,\n     Seeing, Ubi desinit philosophus, ibi incipit medicus:\n     Be a physician, Faustus; heap up gold,\n     And be eterniz'd for some wondrous cure:\n     Summum bonum medicinae sanitas,\n     The end of physic is our body's health.\n     Why, Faustus, hast thou not attain'd that end?\n     Is not thy common talk found aphorisms?\n     Are not thy bills hung up as monuments,\n     Whereby whole cities have escap'd the plague,\n     And thousand desperate maladies been eas'd?\n     Yet art thou still but Faustus, and a man.\n     Couldst[12] thou make men[13] to live eternally,\n     Or, being dead, raise them to life again,\n     Then this profession were to be esteem'd.\n     Physic, farewell!  Where is Justinian?\n\n          [Reads.]\n     Si una eademque res legatur[14] duobus, alter rem,\n     alter valorem rei, &c.\n\n     A pretty case of paltry legacies!\n\n          [Reads.]\n     Exhoereditare filium non potest pater, nisi, &c.[15]\n\n     Such is the subject of the institute,\n     And universal body of the law:[16]\n     This[17] study fits a mercenary drudge,\n     Who aims at nothing but external trash;\n     Too servile[18] and illiberal for me.\n     When all is done, divinity is best:\n     Jerome's Bible, Faustus; view it well.\n\n          [Reads.]\n     Stipendium peccati mors est.\n                                   Ha!\n                                        Stipendium, &c.\n\n     The reward of sin is death:  that's hard.\n\n          [Reads.]\n     Si peccasse negamus, fallimur, et nulla est in nobis veritas;\n\n     If we say that we have no sin, we deceive ourselves, and\n     there's no truth in us.  Why, then, belike we must sin, and so\n     consequently die:\n     Ay, we must die an everlasting death.\n     What doctrine call you this, Che sera, sera,[19]\n     What will be, shall be?  Divinity, adieu!\n     These metaphysics of magicians,\n     And necromantic books are heavenly;\n     Lines, circles, scenes,[20] letters, and characters;\n     Ay, these are those that Faustus most desires.\n     O, what a world of profit and delight,\n     Of power, of honour, of omnipotence,\n     Is promis'd to the studious artizan!\n     All things that move between the quiet poles\n     Shall be at my command:  emperors and kings\n     Are but obeyed in their several provinces,\n     Nor can they raise the wind, or rend the clouds;\n     But his dominion that exceeds in this,\n     Stretcheth as far as doth the mind of man;\n     A sound magician is a mighty god:\n     Here, Faustus, tire[21] thy brains to gain a deity.\n\n          Enter WAGNER.[22]\n\n     Wagner, commend me to my dearest friends,\n     The German Valdes and Cornelius;\n     Request them earnestly to visit me.\n\n     WAGNER. I will, sir.\n          [Exit.]\n\n     FAUSTUS. Their conference will be a greater help to me\n     Than all my labours, plod I ne'er so fast.\n\n          Enter GOOD ANGEL and EVIL ANGEL.\n\n     GOOD ANGEL. O, Faustus, lay that damned book aside,\n     And gaze not on it, lest it tempt thy soul,\n     And heap God's heavy wrath upon thy head!\n     Read, read the Scriptures:--that is blasphemy.\n\n     EVIL ANGEL. Go forward, Faustus, in that famous art\n     Wherein all Nature's treasure[23] is contain'd:\n     Be thou on earth as Jove[24] is in the sky,\n     Lord and commander of these elements.[25]\n          [Exeunt Angels.]\n\n     FAUSTUS. How am I glutted with conceit of this!\n     Shall I make spirits fetch me what I please,\n     Resolve[26] me of all ambiguities,\n     Perform what desperate enterprise I will?\n     I'll have them fly to India for gold,\n     Ransack the ocean for orient pearl,\n     And search all corners of the new-found world\n     For pleasant fruits and princely delicates;\n     I'll have them read me strange philosophy,\n     And tell the secrets of all foreign kings;\n     I'll have them wall all Germany with brass,\n     And make swift Rhine circle fair Wertenberg;\n     I'll have them fill the public schools with silk,[27]\n     Wherewith the students shall be bravely clad;\n     I'll levy soldiers with the coin they bring,\n     And chase the Prince of Parma from our land,\n     And reign sole king of all the[28] provinces;\n     Yea, stranger engines for the brunt of war,\n     Than was the fiery keel at Antwerp's bridge,[29]\n     I'll make my servile spirits to invent.\n\n          Enter VALDES and CORNELIUS.\n\n     Come, German Valdes, and Cornelius,\n     And make me blest with your sage conference.\n     Valdes, sweet Valdes, and Cornelius,\n     Know that your words have won me at the last\n     To practice magic and concealed arts:\n     Yet not your words only,[30] but mine own fantasy,\n     That will receive no object; for my head\n     But ruminates on necromantic skill.\n     Philosophy is odious and obscure;\n     Both law and physic are for petty wits;\n     Divinity is basest of the three,\n     Unpleasant, harsh, contemptible, and vile:[31]\n     'Tis magic, magic, that hath ravish'd me.\n     Then, gentle friends, aid me in this attempt;\n     And I, that have with concise syllogisms[32]\n     Gravell'd the pastors of the German church,\n     And made the flowering pride of Wertenberg\n     Swarm to my problems, as the infernal spirits\n     On sweet Musaeus when he came to hell,\n     Will be as cunning[33] as Agrippa[34] was,\n     Whose shadow[35] made all Europe honour him.\n\n     VALDES. Faustus, these books, thy wit, and our experience,\n     Shall make all nations to canonize us.\n     As Indian Moors obey their Spanish lords,\n     So shall the spirits[36] of every element\n     Be always serviceable to us three;\n     Like lions shall they guard us when we please;\n     Like Almain rutters[37] with their horsemen's staves,\n     Or Lapland giants, trotting by our sides;\n     Sometimes like women, or unwedded maids,\n     Shadowing more beauty in their airy brows\n     Than have the[38] white breasts of the queen of love:\n     From[39] Venice shall they drag huge argosies,\n     And from America the golden fleece\n     That yearly stuffs old Philip's treasury;\n     If learned Faustus will be resolute.\n\n     FAUSTUS. Valdes, as resolute am I in this\n     As thou to live:  therefore object it not.\n\n     CORNELIUS. The miracles that magic will perform\n     Will make thee vow to study nothing else.\n     He that is grounded in astrology,\n     Enrich'd with tongues, well seen in[40] minerals,\n     Hath all the principles magic doth require:\n     Then doubt not, Faustus, but to be renowm'd,[41]\n     And more frequented for this mystery\n     Than heretofore the Delphian oracle.\n     The spirits tell me they can dry the sea,\n     And fetch the treasure of all foreign wrecks,\n     Ay, all the wealth that our forefathers hid\n     Within the massy entrails of the earth:\n     Then tell me, Faustus, what shall we three want?\n\n     FAUSTUS. Nothing, Cornelius.  O, this cheers my soul!\n     Come, shew me some demonstrations magical,\n     That I may conjure in some lusty grove,\n     And have these joys in full possession.\n\n     VALDES. Then haste thee to some solitary grove,\n     And bear wise Bacon's and Albertus'[42] works,\n     The Hebrew Psalter, and New Testament;\n     And whatsoever else is requisite\n     We will inform thee ere our conference cease.\n\n     CORNELIUS. Valdes, first let him know the words of art;\n     And then, all other ceremonies learn'd,\n     Faustus may try his cunning[43] by himself.\n\n     VALDES. First I'll instruct thee in the rudiments,\n     And then wilt thou be perfecter than I.\n\n     FAUSTUS. Then come and dine with me, and, after meat,\n     We'll canvass every quiddity thereof;\n     For, ere I sleep, I'll try what I can do:\n     This night I'll conjure, though I die therefore.\n          [Exeunt.]\n\n          Enter two SCHOLARS.[44]\n\n     FIRST SCHOLAR. I wonder what's become of Faustus, that was wont\n     to make our schools ring with sic probo.\n\n     SECOND SCHOLAR. That shall we know, for see, here comes his boy.\n\n          Enter WAGNER.\n\n     FIRST SCHOLAR. How now, sirrah! where's thy master?\n\n     WAGNER. God in heaven knows.\n\n     SECOND SCHOLAR. Why, dost not thou know?\n\n     WAGNER. Yes, I know; but that follows not.\n\n     FIRST SCHOLAR. Go to, sirrah! leave your jesting, and tell us\n     where he is.\n\n     WAGNER. That follows not necessary by force of argument, that you,\n     being licentiates, should stand upon:[45]  therefore acknowledge\n     your error, and be attentive.\n\n     SECOND SCHOLAR. Why, didst thou not say thou knewest?\n\n     WAGNER. Have you any witness on't?\n\n     FIRST SCHOLAR. Yes, sirrah, I heard you.\n\n     WAGNER. Ask my fellow if I be a thief.\n\n     SECOND SCHOLAR. Well, you will not tell us?\n\n     WAGNER. Yes, sir, I will tell you:  yet, if you were not dunces,\n     you would never ask me such a question; for is not he corpus\n     naturale? and is not that mobile? then wherefore should you\n     ask me such a question?  But that I am by nature phlegmatic,\n     slow to wrath, and prone to lechery (to love, I would say),\n     it were not for you to come within forty foot of the place\n     of execution, although I do not doubt to see you both hanged\n     the next sessions.  Thus having triumphed over you, I will set\n     my countenance like a precisian, and begin to speak thus:--\n     Truly, my dear brethren, my master is within at dinner,\n     with Valdes and Cornelius, as this wine, if it could speak,\n     would[46] inform your worships:  and so, the Lord bless you,\n     preserve you, and keep you, my dear brethren, my dear brethren![47]\n          [Exit.]\n\n     FIRST SCHOLAR. Nay, then, I fear he is fallen into that damned art\n     for which they two are infamous through the world.\n\n     SECOND SCHOLAR. Were he a stranger, and not allied to me, yet should\n     I grieve for him. But, come, let us go and inform the Rector,\n     and see if he by his grave counsel can reclaim him.\n\n     FIRST SCHOLAR. O, but I fear me nothing can reclaim him!\n\n     SECOND SCHOLAR. Yet let us try what we can do.\n          [Exeunt.]\n\n          Enter FAUSTUS to conjure.[48]\n\n     FAUSTUS. Now that the gloomy shadow of the earth,\n     Longing to view Orion's drizzling look,\n     Leaps from th' antartic world unto the sky,\n     And dims the welkin with her pitchy breath,\n     Faustus, begin thine incantations,\n     And try if devils will obey thy hest,\n     Seeing thou hast pray'd and sacrific'd to them.\n     Within this circle is Jehovah's name,\n     Forward and backward anagrammatiz'd,[49]\n     Th' abbreviated[50] names of holy saints,\n     Figures of every adjunct to the heavens,\n     And characters of signs and erring[51] stars,\n     By which the spirits are enforc'd to rise:\n     Then fear not, Faustus, but be resolute,\n     And try the uttermost magic can perform.--\n     Sint mihi dei Acherontis propitii!  Valeat numen triplex Jehovoe!\n     Ignei, aerii, aquatani spiritus, salvete!  Orientis princeps\n     Belzebub, inferni ardentis monarcha, et Demogorgon, propitiamus\n     vos, ut appareat et surgat Mephistophilis, quod tumeraris:[52]\n     per Jehovam, Gehennam, et consecratam aquam quam nunc spargo,\n     signumque crucis quod nunc facio, et per vota nostra, ipse nunc\n     surgat nobis dicatus[53] Mephistophilis!\n\n          Enter MEPHISTOPHILIS.\n\n     I charge thee to return, and change thy shape;\n     Thou art too ugly to attend on me:\n     Go, and return an old Franciscan friar;\n     That holy shape becomes a devil best.\n          [Exit MEPHISTOPHILIS.]\n\n     I see there's virtue in my heavenly words:\n     Who would not be proficient in this art?\n     How pliant is this Mephistophilis,\n     Full of obedience and humility!\n     Such is the force of magic and my spells:\n     No, Faustus, thou art conjuror laureat,\n     That canst command great Mephistophilis:\n     Quin regis Mephistophilis fratris imagine.\n\n          Re-enter MEPHISTOPHILIS like a Franciscan friar.[54]\n\n     MEPHIST. Now, Faustus, what wouldst thou have me do?\n\n     FAUSTUS. I charge thee wait upon me whilst I live,\n     To do whatever Faustus shall command,\n     Be it to make the moon drop from her sphere,\n     Or the ocean to overwhelm the world.\n\n     MEPHIST. I am a servant to great Lucifer,\n     And may not follow thee without his leave:\n     No more than he commands must we perform.\n\n     FAUSTUS. Did not he charge thee to appear to me?\n\n     MEPHIST. No, I came hither[55] of mine own accord.\n\n     FAUSTUS. Did not my conjuring speeches raise thee? speak.\n\n     MEPHIST. That was the cause, but yet per accidens;[56]\n     For, when we hear one rack the name of God,\n     Abjure the Scriptures and his Saviour Christ,\n     We fly, in hope to get his glorious soul;\n     Nor will we come, unless he use such means\n     Whereby he is in danger to be damn'd.\n     Therefore the shortest cut for conjuring\n     Is stoutly to abjure the Trinity,\n     And pray devoutly to the prince of hell.\n\n     FAUSTUS. So Faustus hath\n     Already done; and holds this principle,\n     There is no chief but only Belzebub;\n     To whom Faustus doth dedicate himself.\n     This word \"damnation\" terrifies not him,\n     For he confounds hell in Elysium:\n     His ghost be with the old philosophers!\n     But, leaving these vain trifles of men's souls,\n     Tell me what is that Lucifer thy lord?\n\n     MEPHIST. Arch-regent and commander of all spirits.\n\n     FAUSTUS. Was not that Lucifer an angel once?\n\n     MEPHIST. Yes, Faustus, and most dearly lov'd of God.\n\n     FAUSTUS. How comes it, then, that he is prince of devils?\n\n     MEPHIST. O, by aspiring pride and insolence;\n     For which God threw him from the face of heaven.\n\n     FAUSTUS. And what are you that live with Lucifer?\n\n     MEPHIST. Unhappy spirits that fell with Lucifer,\n     Conspir'd against our God with Lucifer,\n     And are for ever damn'd with Lucifer.\n\n     FAUSTUS. Where are you damn'd?\n\n     MEPHIST. In hell.\n\n     FAUSTUS. How comes it, then, that thou art out of hell?\n\n     MEPHIST. Why, this is hell, nor am I out of it:[57]\n     Think'st thou that I, who saw the face of God,\n     And tasted the eternal joys of heaven,\n     Am not tormented with ten thousand hells,\n     In being depriv'd of everlasting bliss?\n     O, Faustus, leave these frivolous demands,\n     Which strike a terror to my fainting soul!\n\n     FAUSTUS. What, is great Mephistophilis so passionate\n     For being deprived of the joys of heaven?\n     Learn thou of Faustus manly fortitude,\n     And scorn those joys thou never shalt possess.\n     Go bear these[58] tidings to great Lucifer:\n     Seeing Faustus hath incurr'd eternal death\n     By desperate thoughts against Jove's[59] deity,\n     Say, he surrenders up to him his soul,\n     So he will spare him four and twenty[60] years,\n     Letting him live in all voluptuousness;\n     Having thee ever to attend on me,\n     To give me whatsoever I shall ask,\n     To tell me whatsoever I demand,\n     To slay mine enemies, and aid my friends,\n     And always be obedient to my will.\n     Go and return to mighty Lucifer,\n     And meet me in my study at midnight,\n     And then resolve[61] me of thy master's mind.\n\n     MEPHIST. I will, Faustus.\n          [Exit.]\n\n     FAUSTUS. Had I as many souls as there be stars,\n     I'd give them all for Mephistophilis.\n     By him I'll be great emperor of the world,\n     And make a bridge thorough[62] the moving air,\n     To pass the ocean with a band of men;\n     I'll join the hills that bind the Afric shore,\n     And make that country[63] continent to Spain,\n     And both contributory to my crown:\n     The Emperor shall not live but by my leave,\n     Nor any potentate of Germany.\n     Now that I have obtain'd what I desir'd,[64]\n     I'll live in speculation of this art,\n     Till Mephistophilis return again.\n          [Exit.]\n\n          Enter WAGNER[65] and CLOWN.\n\n     WAGNER. Sirrah boy, come hither.\n\n     CLOWN. How, boy! swowns, boy!  I hope you have seen many boys\n     with such pickadevaunts[66] as I have:  boy, quotha!\n\n     WAGNER. Tell me, sirrah, hast thou any comings in?\n\n     CLOWN. Ay, and goings out too; you may see else.\n\n     WAGNER. Alas, poor slave! see how poverty jesteth in his nakedness!\n     the villain is bare and out of service, and so hungry, that I know\n     he would give his soul to the devil for a shoulder of mutton,\n     though it were blood-raw.\n\n     CLOWN. How! my soul to the devil for a shoulder of mutton, though\n     'twere blood-raw! not so, good friend:  by'r lady,[67] I had need\n     have it well roasted, and good sauce to it, if I pay so dear.\n\n     WAGNER. Well, wilt thou serve me, and I'll make thee go like\n     Qui mihi discipulus?[68]\n\n     CLOWN. How, in verse?\n\n     WAGNER. No, sirrah; in beaten silk and staves-acre.[69]\n\n     CLOWN. How, how, knaves-acre! ay, I thought that was all the land\n     his father left him.  Do you hear?  I would be sorry to rob you of\n     your living.\n\n     WAGNER. Sirrah, I say in staves-acre.\n\n     CLOWN. Oho, oho, staves-acre! why, then, belike, if I were your\n     man, I should be full of vermin.[70]\n\n     WAGNER. So thou shalt, whether thou beest with me or no.  But,\n     sirrah, leave your jesting, and bind yourself presently unto me\n     for seven years, or I'll turn all the lice about thee into\n     familiars,[71] and they shall tear thee in pieces.\n\n     CLOWN. Do you hear, sir? you may save that labour; they are too\n     familiar with me already:  swowns, they are as bold with my flesh\n     as if they had paid for their[72] meat and drink.\n\n     WAGNER. Well, do you hear, sirrah? hold, take these guilders.\n          [Gives money.]\n\n     CLOWN. Gridirons! what be they?\n\n     WAGNER. Why, French crowns.\n\n     CLOWN. Mass, but for the name of French crowns, a man were as good\n     have as many English counters.  And what should I do with these?\n\n     WAGNER. Why, now, sirrah, thou art at an hour's warning, whensoever\n     or wheresoever the devil shall fetch thee.\n\n     CLOWN. No, no; here, take your gridirons again.\n\n     WAGNER. Truly, I'll none of them.\n\n     CLOWN. Truly, but you shall.\n\n     WAGNER. Bear witness I gave them him.\n\n     CLOWN. Bear witness I give them you again.\n\n     WAGNER. Well, I will cause two devils presently to fetch thee\n     away.--Baliol and Belcher!\n\n     CLOWN. Let your Baliol and your Belcher come here, and I'll\n     knock them, they were never so knocked since they were devils:\n     say I should kill one of them, what would folks say?  \"Do ye see\n     yonder tall fellow in the round slop?[73] he has killed the devil.\"\n     So I should be called Kill-devil all the parish over.\n\n          Enter two DEVILS; and the CLOWN runs up and down crying.\n\n     WAGNER. Baliol and Belcher,--spirits, away!\n          [Exeunt DEVILS.]\n\n     CLOWN. What, are they gone? a vengeance on them! they have vile[74]\n     long nails.  There was a he-devil and a she-devil:  I'll tell you\n     how you shall know them; all he-devils has horns, and all\n     she-devils has clifts and cloven feet.\n\n     WAGNER. Well, sirrah, follow me.\n\n     CLOWN. But, do you hear? if I should serve you, would you teach\n     me to raise up Banios and Belcheos?\n\n     WAGNER. I will teach thee to turn thyself to any thing, to a dog,\n     or a cat, or a mouse, or a rat, or any thing.\n\n     CLOWN. How! a Christian fellow to a dog, or a cat, a mouse,\n     or a rat! no, no, sir; if you turn me into any thing, let it be\n     in the likeness of a little pretty frisking flea, that I may be\n     here and there and every where:  O, I'll tickle the pretty wenches'\n     plackets!  I'll be amongst them, i'faith.\n\n     WAGNER. Well, sirrah, come.\n\n     CLOWN. But, do you hear, Wagner?\n\n     WAGNER. How!--Baliol and Belcher!\n\n     CLOWN. O Lord!  I pray, sir, let Banio and Belcher go sleep.\n\n     WAGNER. Villain, call me Master Wagner, and let thy left eye be\n     diametarily fixed upon my right heel, with quasi vestigiis\n     nostris[75] insistere.\n          [Exit.]\n\n     CLOWN. God forgive me, he speaks Dutch fustian.  Well, I'll follow\n     him; I'll serve him, that's flat.\n          [Exit.]\n\n          FAUSTUS discovered in his study.\n\n     FAUSTUS. Now, Faustus, must\n     Thou needs be damn'd, and canst thou not be sav'd:\n     What boots it, then, to think of God or heaven?\n     Away with such vain fancies, and despair;\n     Despair in God, and trust in Belzebub:\n     Now go not backward; no, Faustus, be resolute:\n     Why waver'st thou?  O, something soundeth in mine ears,\n     \"Abjure this magic, turn to God again!\"\n     Ay, and Faustus will turn to God again.\n     To God? he loves thee not;\n     The god thou serv'st is thine own appetite,\n     Wherein is fix'd the love of Belzebub:\n     To him I'll build an altar and a church,\n     And offer lukewarm blood of new-born babes.\n\n          Enter GOOD ANGEL and EVIL ANGEL.\n\n     GOOD ANGEL. Sweet Faustus, leave that execrable art.\n\n     FAUSTUS. Contrition, prayer, repentance--what of them?\n\n     GOOD ANGEL. O, they are means to bring thee unto heaven!\n\n     EVIL ANGEL. Rather illusions, fruits of lunacy,\n     That make men foolish that do trust them most.\n\n     GOOD ANGEL. Sweet Faustus, think of heaven and heavenly things.\n\n     EVIL ANGEL. No, Faustus; think of honour and of[76] wealth.\n          [Exeunt ANGELS.]\n\n     FAUSTUS. Of wealth!\n     Why, the signiory of Embden shall be mine.\n     When Mephistophilis shall stand by me,\n     What god can hurt thee, Faustus? thou art safe\n     Cast no more doubts.--Come, Mephistophilis,\n     And bring glad tidings from great Lucifer;--\n     Is't not midnight?--come, Mephistophilis,\n     Veni, veni, Mephistophile!\n\n          Enter MEPHISTOPHILIS.\n\n     Now tell me[77] what says Lucifer, thy lord?\n\n     MEPHIST. That I shall wait on Faustus whilst he lives,[78]\n     So he will buy my service with his soul.\n\n     FAUSTUS. Already Faustus hath hazarded that for thee.\n\n     MEPHIST. But, Faustus, thou must bequeath it solemnly,\n     And write a deed of gift with thine own blood;\n     For that security craves great Lucifer.\n     If thou deny it, I will back to hell.\n\n     FAUSTUS. Stay, Mephistophilis, and tell me, what good will my soul\n     do thy lord?\n\n     MEPHIST. Enlarge his kingdom.\n\n     FAUSTUS. Is that the reason why[79] he tempts us thus?\n\n     MEPHIST. Solamen miseris socios habuisse doloris.[80]\n\n     FAUSTUS. Why,[81] have you any pain that torture[82] others!\n\n     MEPHIST. As great as have the human souls of men.\n     But, tell me, Faustus, shall I have thy soul?\n     And I will be thy slave, and wait on thee,\n     And give thee more than thou hast wit to ask.\n\n     FAUSTUS. Ay, Mephistophilis, I give it thee.\n\n     MEPHIST. Then, Faustus,[83] stab thine arm courageously,\n     And bind thy soul, that at some certain day\n     Great Lucifer may claim it as his own;\n     And then be thou as great as Lucifer.\n\n     FAUSTUS. [Stabbing his arm] Lo, Mephistophilis, for love of thee,\n     I cut mine arm, and with my proper blood\n     Assure my soul to be great Lucifer's,\n     Chief lord and regent of perpetual night!\n     View here the blood that trickles from mine arm,\n     And let it be propitious for my wish.\n\n     MEPHIST. But, Faustus, thou must\n     Write it in manner of a deed of gift.\n\n     FAUSTUS. Ay, so I will [Writes].  But, Mephistophilis,\n     My blood congeals, and I can write no more.\n\n     MEPHIST. I'll fetch thee fire to dissolve it straight.\n          [Exit.]\n\n     FAUSTUS. What might the staying of my blood portend?\n     Is it unwilling I should write this bill?[84]\n     Why streams it not, that I may write afresh?\n     FAUSTUS GIVES TO THEE HIS SOUL:  ah, there it stay'd!\n     Why shouldst thou not? is not thy soul shine own?\n     Then write again, FAUSTUS GIVES TO THEE HIS SOUL.\n\n          Re-enter MEPHISTOPHILIS with a chafer of coals.\n\n     MEPHIST. Here's fire; come, Faustus, set it on.[85]\n\n     FAUSTUS. So, now the blood begins to clear again;\n     Now will I make an end immediately.\n          [Writes.]\n\n     MEPHIST. O, what will not I do to obtain his soul?\n          [Aside.]\n\n     FAUSTUS. Consummatum est; this bill is ended,\n     And Faustus hath bequeath'd his soul to Lucifer.\n     But what is this inscription[86] on mine arm?\n     Homo, fuge:  whither should I fly?\n     If unto God, he'll throw me[87] down to hell.\n     My senses are deceiv'd; here's nothing writ:--\n     I see it plain; here in this place is writ,\n     Homo, fuge:  yet shall not Faustus fly.\n\n     MEPHIST. I'll fetch him somewhat to delight his mind.\n          [Aside, and then exit.]\n\n          Re-enter MEPHISTOPHILIS with DEVILS, who give crowns\n          and rich apparel to FAUSTUS, dance, and then depart.\n\n     FAUSTUS. Speak, Mephistophilis, what means this show?\n\n     MEPHIST. Nothing, Faustus, but to delight thy mind withal,\n     And to shew thee what magic can perform.\n\n     FAUSTUS. But may I raise up spirits when I please?\n\n     MEPHIST. Ay, Faustus, and do greater things than these.\n\n     FAUSTUS. Then there's enough for a thousand souls.\n     Here, Mephistophilis, receive this scroll,\n     A deed of gift of body and of soul:\n     But yet conditionally that thou perform\n     All articles prescrib'd between us both.\n\n     MEPHIST. Faustus, I swear by hell and Lucifer\n     To effect all promises between us made!\n\n     FAUSTUS. Then hear me read them.  [Reads] ON THESE CONDITIONS\n     FOLLOWING.  FIRST, THAT FAUSTUS MAY BE A SPIRIT IN FORM AND\n     SUBSTANCE.  SECONDLY, THAT MEPHISTOPHILIS SHALL BE HIS SERVANT,\n     AND AT HIS COMMAND.  THIRDLY, THAT MEPHISTOPHILIS SHALL DO FOR HIM,\n     AND BRING HIM WHATSOEVER HE DESIRES.[88]  FOURTHLY, THAT HE SHALL\n     BE IN HIS CHAMBER OR HOUSE INVISIBLE.  LASTLY, THAT HE SHALL APPEAR\n     TO THE SAID JOHN FAUSTUS, AT ALL TIMES, IN WHAT FORM OR SHAPE\n     SOEVER HE PLEASE.  I, JOHN FAUSTUS, OF WERTENBERG, DOCTOR, BY\n     THESE PRESENTS, DO GIVE BOTH BODY AND SOUL TO LUCIFER PRINCE OF\n     THE EAST, AND HIS MINISTER MEPHISTOPHILIS; AND FURTHERMORE GRANT\n     UNTO THEM, THAT,[89] TWENTY-FOUR YEARS BEING EXPIRED, THE ARTICLES\n     ABOVE-WRITTEN INVIOLATE, FULL POWER TO FETCH OR CARRY THE SAID\n     JOHN FAUSTUS, BODY AND SOUL, FLESH, BLOOD, OR GOODS, INTO THEIR\n     HABITATION WHERESOEVER.  BY ME, JOHN FAUSTUS.\n\n     MEPHIST. Speak, Faustus, do you deliver this as your deed?\n\n     FAUSTUS. Ay, take it, and the devil give thee good on't!\n\n     MEPHIST. Now, Faustus, ask what thou wilt.\n\n     FAUSTUS. First will I question with thee about hell.\n     Tell me, where is the place that men call hell?\n\n     MEPHIST. Under the heavens.\n\n     FAUSTUS. Ay, but whereabout?\n\n     MEPHIST. Within the bowels of these[90] elements,\n     Where we are tortur'd and remain for ever:\n     Hell hath no limits, nor is circumscrib'd\n     In one self place; for where we are is hell,\n     And where hell is, there[91] must we ever be:\n     And, to conclude, when all the world dissolves,\n     And every creature shall be purified,\n     All places shall be hell that are[92] not heaven.\n\n     FAUSTUS. Come, I think hell's a fable.\n\n     MEPHIST. Ay, think so still, till experience change thy mind.\n\n     FAUSTUS. Why, think'st thou, then, that Faustus shall be damn'd?\n\n     MEPHIST. Ay, of necessity, for here's the scroll\n     Wherein thou hast given thy soul to Lucifer.\n\n     FAUSTUS. Ay, and body too:  but what of that?\n     Think'st thou that Faustus is so fond[93] to imagine\n     That, after this life, there is any pain?\n     Tush, these are trifles and mere old wives' tales.\n\n     MEPHIST. But, Faustus, I am an instance to prove the contrary,\n     For I am damn'd, and am now in hell.\n\n     FAUSTUS. How! now in hell!\n     Nay, an this be hell, I'll willingly be damn'd here:\n     What! walking, disputing, &c.[94]\n     But, leaving off this, let me have a wife,[95]\n     The fairest maid in Germany;\n     For I am wanton and lascivious,\n     And cannot live without a wife.\n\n     MEPHIST. How! a wife!\n     I prithee, Faustus, talk not of a wife.\n\n     FAUSTUS. Nay, sweet Mephistophilis, fetch me one, for I will have\n     one.\n\n     MEPHIST. Well, thou wilt have one?  Sit there till I come:  I'll\n     fetch thee a wife in the devil's name.\n          [Exit.]\n\n          Re-enter MEPHISTOPHILIS with a DEVIL drest like a WOMAN,\n          with fire-works.\n\n     MEPHIST. Tell me,[96] Faustus, how dost thou like thy wife?\n\n     FAUSTUS. A plague on her for a hot whore!\n\n     MEPHIST. Tut, Faustus,\n     Marriage is but a ceremonial toy;\n     If thou lovest me, think no[97] more of it.\n     I'll cull thee out the fairest courtezans,\n     And bring them every morning to thy bed:\n     She whom thine eye shall like, thy heart shall have,\n     Be she as chaste as was Penelope,\n     As wise as Saba,[98] or as beautiful\n     As was bright Lucifer before his fall.\n     Hold, take this book, peruse it thoroughly:\n          [Gives book.]\n\n     The iterating[99] of these lines brings gold;\n     The framing of this circle on the ground\n     Brings whirlwinds, tempests, thunder, and lightning;\n     Pronounce this thrice devoutly to thyself,\n     And men in armour shall appear to thee,\n     Ready to execute what thou desir'st.\n\n     FAUSTUS. Thanks, Mephistophilis:  yet fain would I have a book\n     wherein I might behold all spells and incantations, that I\n     might raise up spirits when I please.\n\n     MEPHIST. Here they are in this book.\n          [Turns to them.]\n\n     FAUSTUS. Now would I have a book where I might see all characters\n     and planets of the heavens, that I might know their motions and\n     dispositions.\n\n     MEPHIST. Here they are too.\n          [Turns to them.]\n\n     FAUSTUS. Nay, let me have one book more,--and then I have done,--\n     wherein I might see all plants, herbs, and trees, that grow upon\n     the earth.\n\n     MEPHIST. Here they be.\n\n     FAUSTUS. O, thou art deceived.\n\n     MEPHIST. Tut, I warrant thee.\n          [Turns to them.]\n\n     FAUSTUS. When I behold the heavens, then I repent,\n     And curse thee, wicked Mephistophilis,\n     Because thou hast depriv'd me of those joys.\n\n     MEPHIST. Why, Faustus,\n     Thinkest thou heaven is such a glorious thing?\n     I tell thee, 'tis not half so fair as thou,\n     Or any man that breathes on earth.\n\n     FAUSTUS. How prov'st thou that?\n\n     MEPHIST. 'Twas made for man, therefore is man more excellent.\n\n     FAUSTUS. If it were made for man, 'twas made for me:\n     I will renounce this magic and repent.\n\n          Enter GOOD ANGEL and EVIL ANGEL.\n\n     GOOD ANGEL. Faustus, repent; yet God will pity thee.\n\n     EVIL ANGEL. Thou art a spirit; God cannot pity thee.\n\n     FAUSTUS. Who buzzeth in mine ears I am a spirit?\n     Be I a devil, yet God may pity me;\n     Ay, God will pity me, if I repent.\n\n     EVIL ANGEL. Ay, but Faustus never shall repent.\n          [Exeunt ANGELS.]\n\n     FAUSTUS. My heart's so harden'd, I cannot repent:\n     Scarce can I name salvation, faith, or heaven,\n     But fearful echoes thunder in mine ears,\n     \"Faustus, thou art damn'd!\" then swords, and knives,\n     Poison, guns, halters, and envenom'd steel\n     Are laid before me to despatch myself;\n     And long ere this I should have slain myself,\n     Had not sweet pleasure conquer'd deep despair.\n     Have not I made blind Homer sing to me\n     Of Alexander's love and Oenon's death?\n     And hath not he, that built the walls of Thebes\n     With ravishing sound of his melodious harp,\n     Made music with my Mephistophilis?\n     Why should I die, then, or basely despair?\n     I am resolv'd; Faustus shall ne'er repent.--\n     Come, Mephistophilis, let us dispute again,\n     And argue of divine astrology.[100]\n     Tell me, are there many heavens above the moon\n     Are all celestial bodies but one globe,\n     As is the substance of this centric earth?\n\n     MEPHIST. As are the elements, such are the spheres,\n     Mutually folded in each other's orb,\n     And, Faustus,\n     All jointly move upon one axletree,\n     Whose terminine is term'd the world's wide pole;\n     Nor are the names of Saturn, Mars, or Jupiter\n     Feign'd, but are erring[101] stars.\n\n     FAUSTUS. But, tell me, have they all one motion, both situ et\n     tempore?\n\n     MEPHIST. All jointly move from east to west in twenty-four hours\n     upon the poles of the world; but differ in their motion upon\n     the poles of the zodiac.\n\n     FAUSTUS. Tush,\n     These slender trifles Wagner can decide:\n     Hath Mephistophilis no greater skill?\n     Who knows not the double motion of the planets?\n     The first is finish'd in a natural day;\n     The second thus; as Saturn in thirty years; Jupiter in twelve;\n     Mars in four; the Sun, Venus, and Mercury in a year; the Moon in\n     twenty-eight days.  Tush, these are freshmen's[102] suppositions.\n     But, tell me, hath every sphere a dominion or intelligentia?\n\n     MEPHIST. Ay.\n\n     FAUSTUS. How many heavens or spheres are there?\n\n     MEPHIST. Nine; the seven planets, the firmament, and the empyreal\n     heaven.\n\n     FAUSTUS. Well, resolve[103] me in this question; why have we not\n     conjunctions, oppositions, aspects, eclipses, all at one time,\n     but in some years we have more, in some less?\n\n     MEPHIST. Per inoequalem motum respectu totius.\n\n     FAUSTUS. Well, I am answered.  Tell me who made the world?\n\n     MEPHIST. I will not.\n\n     FAUSTUS. Sweet Mephistophilis, tell me.\n\n     MEPHIST. Move me not, for I will not tell thee.\n\n     FAUSTUS. Villain, have I not bound thee to tell me any thing?\n\n     MEPHIST. Ay, that is not against our kingdom; but this is.  Think\n     thou on hell, Faustus, for thou art damned.\n\n     FAUSTUS. Think, Faustus, upon God that made the world.\n\n     MEPHIST. Remember this.\n          [Exit.]\n\n     FAUSTUS. Ay, go, accursed spirit, to ugly hell!\n     'Tis thou hast damn'd distressed Faustus' soul.\n     Is't not too late?\n\n          Re-enter GOOD ANGEL and EVIL ANGEL.\n\n     EVIL ANGEL. Too late.\n\n     GOOD ANGEL. Never too late, if Faustus can repent.\n\n     EVIL ANGEL. If thou repent, devils shall tear thee in pieces.\n\n     GOOD ANGEL. Repent, and they shall never raze thy skin.\n          [Exeunt ANGELS.]\n\n     FAUSTUS. Ah, Christ, my Saviour,\n     Seek to save[104] distressed Faustus' soul!\n\n          Enter LUCIFER, BELZEBUB, and MEPHISTOPHILIS.\n\n     LUCIFER. Christ cannot save thy soul, for he is just:\n     There's none but I have interest in the same.\n\n     FAUSTUS. O, who art thou that look'st so terrible?\n\n     LUCIFER. I am Lucifer,\n     And this is my companion-prince in hell.\n\n     FAUSTUS. O, Faustus, they are come to fetch away thy soul!\n\n     LUCIFER. We come to tell thee thou dost injure us;\n     Thou talk'st of Christ, contrary to thy promise:\n     Thou shouldst not think of God:  think of the devil,\n     And of his dam too.\n\n     FAUSTUS. Nor will I henceforth:  pardon me in this,\n     And Faustus vows never to look to heaven,\n     Never to name God, or to pray to him,\n     To burn his Scriptures, slay his ministers,\n     And make my spirits pull his churches down.\n\n     LUCIFER. Do so, and we will highly gratify thee.  Faustus, we are\n     come from hell to shew thee some pastime:  sit down, and thou\n     shalt see all the Seven Deadly Sins appear in their proper shapes.\n\n     FAUSTUS. That sight will be as pleasing unto me,\n     As Paradise was to Adam, the first day\n     Of his creation.\n\n     LUCIFER. Talk not of Paradise nor creation; but mark this show:\n     talk of the devil, and nothing else.--Come away!\n\n          Enter the SEVEN DEADLY SINS.[105]\n\n     Now, Faustus, examine them of their several names and dispositions.\n\n     FAUSTUS. What art thou, the first?\n\n     PRIDE. I am Pride.  I disdain to have any parents.  I am like to\n     Ovid's flea; I can creep into every corner of a wench; sometimes,\n     like a perriwig, I sit upon her brow; or, like a fan of feathers,\n     I kiss her lips; indeed, I do--what do I not?  But, fie, what a\n     scent is here!  I'll not speak another word, except the ground\n     were perfumed, and covered with cloth of arras.\n\n     FAUSTUS. What art thou, the second?\n\n     COVETOUSNESS. I am Covetousness, begotten of an old churl, in an\n     old leathern bag:  and, might I have my wish, I would desire that\n     this house and all the people in it were turned to gold, that I\n     might lock you up in my good chest:  O, my sweet gold!\n\n     FAUSTUS. What art thou, the third?\n\n     WRATH. I am Wrath.  I had neither father nor mother:  I leapt out\n     of a lion's mouth when I was scarce half-an-hour old; and ever\n     since I have run up and down the world with this case[106]\n     of rapiers, wounding myself when I had nobody to fight withal.\n     I was born in hell; and look to it, for some of you shall be\n     my father.\n\n     FAUSTUS. What art thou, the fourth?\n\n     ENVY. I am Envy, begotten of a chimney-sweeper and an oyster-wife.\n     I cannot read, and therefore wish all books were burnt.  I am lean\n     with seeing others eat.  O, that there would come a famine through\n     all the world, that all might die, and I live alone! then thou\n     shouldst see how fat I would be.  But must thou sit, and I stand?\n     come down, with a vengeance!\n\n     FAUSTUS. Away, envious rascal!--What art thou, the fifth?\n\n     GLUTTONY. Who I, sir?  I am Gluttony.  My parents are all dead,\n     and the devil a penny they have left me, but a bare pension, and\n     that is thirty meals a-day and ten bevers,[107]--a small trifle\n     to suffice nature.  O, I come of a royal parentage! my grandfather\n     was a Gammon of Bacon, my grandmother a Hogshead of Claret-wine;\n     my godfathers were these, Peter Pickle-herring and Martin\n     Martlemas-beef; O, but my godmother, she was a jolly gentlewoman,\n     and well-beloved in every good town and city; her name was Mistress\n     Margery March-beer.  Now, Faustus, thou hast heard all my progeny;\n     wilt thou bid me to supper?\n\n     FAUSTUS. No, I'll see thee hanged:  thou wilt eat up all my victuals.\n\n     GLUTTONY. Then the devil choke thee!\n\n     FAUSTUS. Choke thyself, glutton!--What art thou, the sixth?\n\n     SLOTH. I am Sloth.  I was begotten on a sunny bank, where I have\n     lain ever since; and you have done me great injury to bring me\n     from thence:  let me be carried thither again by Gluttony and\n     Lechery.  I'll not speak another word for a king's ransom.\n\n     FAUSTUS. What are you, Mistress Minx, the seventh and last?\n\n     LECHERY. Who I, sir?  I am one that loves an inch of raw mutton\n     better than an ell of fried stock-fish; and the first letter\n     of my name begins with L.[108]\n\n     FAUSTUS. Away, to hell, to hell![109]\n          [Exeunt the SINS.]\n\n     LUCIFER. Now, Faustus, how dost thou like this?\n\n     FAUSTUS. O, this feeds my soul!\n\n     LUCIFER. Tut, Faustus, in hell is all manner of delight.\n\n     FAUSTUS. O, might I see hell, and return again,\n     How happy were I then!\n\n     LUCIFER. Thou shalt; I will send for thee at midnight.[110]\n     In meantime take this book; peruse it throughly,\n     And thou shalt turn thyself into what shape thou wilt.\n\n     FAUSTUS. Great thanks, mighty Lucifer!\n     This will I keep as chary as my life.\n\n     LUCIFER. Farewell, Faustus, and think on the devil.\n\n     FAUSTUS. Farewell, great Lucifer.\n          [Exeunt LUCIFER and BELZEBUB.]\n\n     Come, Mephistophilis.\n          [Exeunt.]\n\n          Enter CHORUS.[111]\n\n     CHORUS. Learned Faustus,\n     To know the secrets of astronomy[112]\n     Graven in the book of Jove's high firmament,\n     Did mount himself to scale Olympus' top,\n     Being seated in a chariot burning bright,\n     Drawn by the strength of yoky dragons' necks.\n     He now is gone to prove cosmography,\n     And, as I guess, will first arrive at Rome,\n     To see the Pope and manner of his court,\n     And take some part of holy Peter's feast,\n     That to this day is highly solemniz'd.\n          [Exit.]\n\n          Enter FAUSTUS and MEPHISTOPHILIS.[113]\n\n     FAUSTUS. Having now, my good Mephistophilis,\n     Pass'd with delight the stately town of Trier,[114]\n     Environ'd round with airy mountain-tops,\n     With walls of flint, and deep-entrenched lakes,\n     Not to be won by any conquering prince;\n     From Paris next,[115] coasting the realm of France,\n     We saw the river Maine fall into Rhine,\n     Whose banks are set with groves of fruitful vines;\n     Then up to Naples, rich Campania,\n     Whose buildings fair and gorgeous to the eye,\n     The streets straight forth, and pav'd with finest brick,\n     Quarter the town in four equivalents:\n     There saw we learned Maro's golden tomb,\n     The way he cut,[116] an English mile in length,\n     Thorough a rock of stone, in one night's space;\n     From thence to Venice, Padua, and the rest,\n     In one of which a sumptuous temple stands,[117]\n     That threats the stars with her aspiring top.\n     Thus hitherto hath Faustus spent his time:\n     But tell me now what resting-place is this?\n     Hast thou, as erst I did command,\n     Conducted me within the walls of Rome?\n\n     MEPHIST. Faustus, I have; and, because we will not be unprovided,\n     I have taken up his Holiness' privy-chamber for our use.\n\n     FAUSTUS. I hope his Holiness will bid us welcome.\n\n     MEPHIST.\n     Tut, 'tis no matter; man; we'll be bold with his good cheer.\n     And now, my Faustus, that thou mayst perceive\n     What Rome containeth to delight thee with,\n     Know that this city stands upon seven hills\n     That underprop the groundwork of the same:\n     Just through the midst[118] runs flowing Tiber's stream\n     With winding banks that cut it in two parts;\n     Over the which four stately bridges lean,\n     That make safe passage to each part of Rome:\n     Upon the bridge call'd Ponte[119] Angelo\n     Erected is a castle passing strong,\n     Within whose walls such store of ordnance are,\n     And double cannons fram'd of carved brass,\n     As match the days within one complete year;\n     Besides the gates, and high pyramides,\n     Which Julius Caesar brought from Africa.\n\n     FAUSTUS. Now, by the kingdoms of infernal rule,\n     Of Styx, of[120] Acheron, and the fiery lake\n     Of ever-burning Phlegethon, I swear\n     That I do long to see the monuments\n     And situation of bright-splendent Rome:\n     Come, therefore, let's away.\n\n     MEPHIST. Nay, Faustus, stay:  I know you'd fain see the Pope,\n     And take some part of holy Peter's feast,\n     Where thou shalt see a troop of bald-pate friars,\n     Whose summum bonum is in belly-cheer.\n\n     FAUSTUS. Well, I'm content to compass then some sport,\n     And by their folly make us merriment.\n     Then charm me, that I[121]\n     May be invisible, to do what I please,\n     Unseen of any whilst I stay in Rome.\n          [Mephistophilis charms him.]\n\n     MEPHIST. So, Faustus; now\n     Do what thou wilt, thou shalt not be discern'd.\n\n          Sound a Sonnet.[122] Enter the POPE and the CARDINAL OF\n          LORRAIN to the banquet, with FRIARS attending.\n\n     POPE. My Lord of Lorrain, will't please you draw near?\n\n     FAUSTUS. Fall to, and the devil choke you, an you spare!\n\n     POPE. How now! who's that which spake?--Friars, look about.\n\n     FIRST FRIAR. Here's nobody, if it like your Holiness.\n\n     POPE. My lord, here is a dainty dish was sent me from the Bishop\n     of Milan.\n\n     FAUSTUS. I thank you, sir.\n          [Snatches the dish.]\n\n     POPE. How now! who's that which snatched the meat from me? will\n     no man look?--My lord, this dish was sent me from the Cardinal\n     of Florence.\n\n     FAUSTUS. You say true; I'll ha't.\n          [Snatches the dish.]\n\n     POPE. What, again!--My lord, I'll drink to your grace.\n\n     FAUSTUS. I'll pledge your grace.\n          [Snatches the cup.]\n\n     C. OF LOR. My lord, it may be some ghost, newly crept out of\n     Purgatory, come to beg a pardon of your Holiness.\n\n     POPE. It may be so.--Friars, prepare a dirge to lay the fury\n     of this ghost.--Once again, my lord, fall to.\n          [The POPE crosses himself.]\n\n     FAUSTUS. What, are you crossing of yourself?\n     Well, use that trick no more, I would advise you.\n          [The POPE crosses himself again.]\n\n     Well, there's the second time.  Aware the third;\n     I give you fair warning.\n          [The POPE crosses himself again, and FAUSTUS hits him a box\n           of the ear; and they all run away.]\n\n     Come on, Mephistophilis; what shall we do?\n\n     MEPHIST. Nay, I know not:  we shall be cursed with bell, book,\n     and candle.\n\n     FAUSTUS. How! bell, book, and candle,--candle, book, and bell,--\n     Forward and backward, to curse Faustus to hell!\n     Anon you shall hear a hog grunt, a calf bleat, and an ass bray,\n     Because it is Saint Peter's holiday.\n\n          Re-enter all the FRIARS to sing the Dirge.\n\n     FIRST FRIAR.\n     Come, brethren, let's about our business with good devotion.\n\n          They sing.\n\n     CURSED BE HE THAT STOLE AWAY HIS HOLINESS' MEAT FROM THE\n     TABLE!  maledicat Dominus!\n     CURSED BE HE THAT STRUCK HIS HOLINESS A BLOW ON THE FACE!\n     maledicat Dominus!\n     CURSED BE HE THAT TOOK FRIAR SANDELO A BLOW ON THE PATE!\n     maledicat Dominus!\n     CURSED BE HE THAT DISTURBETH OUR HOLY DIRGE!  maledicat\n     Dominus!\n     CURSED BE HE THAT TOOK AWAY HIS HOLINESS' WINE!  maledicat\n     Dominus?  ['?' sic]\n          Et omnes Sancti!  Amen!\n\n          [MEPHISTOPHILIS and FAUSTUS beat the FRIARS, and fling\n           fire-works among them; and so exeunt.]\n\n          Enter CHORUS.\n\n     CHORUS. When Faustus had with pleasure ta'en the view\n     Of rarest things, and royal courts of kings,\n     He stay'd his course, and so returned home;\n     Where such as bear his absence but with grief,\n     I mean his friends and near'st companions,\n     Did gratulate his safety with kind words,\n     And in their conference of what befell,\n     Touching his journey through the world and air,\n     They put forth questions of astrology,\n     Which Faustus answer'd with such learned skill\n     As they admir'd and wonder'd at his wit.\n     Now is his fame spread forth in every land:\n     Amongst the rest the Emperor is one,\n     Carolus the Fifth, at whose palace now\n     Faustus is feasted 'mongst his noblemen.\n     What there he did, in trial of his art,\n     I leave untold; your eyes shall see['t] perform'd.\n          [Exit.]\n\n          Enter ROBIN[123] the Ostler, with a book in his hand.\n\n     ROBIN. O, this is admirable! here I ha' stolen one of Doctor\n     Faustus' conjuring-books, and, i'faith, I mean to search some\n     circles for my own use.  Now will I make all the maidens in our\n     parish dance at my pleasure, stark naked, before me; and so\n     by that means I shall see more than e'er I felt or saw yet.\n\n          Enter RALPH, calling ROBIN.\n\n     RALPH. Robin, prithee, come away; there's a gentleman tarries\n     to have his horse, and he would have his things rubbed and made\n     clean:  he keeps such a chafing with my mistress about it; and\n     she has sent me to look thee out; prithee, come away.\n\n     ROBIN. Keep out, keep out, or else you are blown up, you are\n     dismembered, Ralph:  keep out, for I am about a roaring piece\n     of work.\n\n     RALPH. Come, what doest thou with that same book? thou canst\n     not read?\n\n     ROBIN. Yes, my master and mistress shall find that I can read,\n     he for his forehead, she for her private study; she's born to\n     bear with me, or else my art fails.\n\n     RALPH. Why, Robin, what book is that?\n\n     ROBIN. What book! why, the most intolerable book for conjuring\n     that e'er was invented by any brimstone devil.\n\n     RALPH. Canst thou conjure with it?\n\n     ROBIN. I can do all these things easily with it; first, I can\n     make thee drunk with ippocras[124] at any tabern[125] in Europe\n     for nothing; that's one of my conjuring works.\n\n     RALPH. Our Master Parson says that's nothing.\n\n     ROBIN. True, Ralph:  and more, Ralph, if thou hast any mind to\n     Nan Spit, our kitchen-maid, then turn her and wind her to thy own\n     use, as often as thou wilt, and at midnight.\n\n     RALPH. O, brave, Robin! shall I have Nan Spit, and to mine own\n     use?  On that condition I'll feed thy devil with horse-bread as\n     long as he lives, of free cost.\n\n     ROBIN. No more, sweet Ralph:  let's go and make clean our boots,\n     which lie foul upon our hands, and then to our conjuring in the\n     devil's name.\n          [Exeunt.]\n\n          Enter ROBIN and RALPH[126] with a silver goblet.\n\n     ROBIN. Come, Ralph:  did not I tell thee, we were for ever made\n     by this Doctor Faustus' book? ecce, signum! here's a simple\n     purchase[127] for horse-keepers:  our horses shall eat no hay as\n     long as this lasts.\n\n     RALPH. But, Robin, here comes the Vintner.\n\n     ROBIN. Hush!  I'll gull him supernaturally.\n\n          Enter VINTNER.\n\n     Drawer,[128] I hope all is paid; God be with you!--Come, Ralph.\n\n     VINTNER. Soft, sir; a word with you.  I must yet have a goblet paid\n     from you, ere you go.\n\n     ROBIN. I a goblet, Ralph, I a goblet!--I scorn you; and you are\n     but a, &c.  I a goblet! search me.\n\n     VINTNER. I mean so, sir, with your favour.\n          [Searches ROBIN.]\n\n     ROBIN. How say you now?\n\n     VINTNER. I must say somewhat to your fellow.--You, sir!\n\n     RALPH. Me, sir! me, sir! search your fill.  [VINTNER searches him.]\n     Now, sir, you may be ashamed to burden honest men with a matter\n     of truth.\n\n     VINTNER. Well, tone[129] of you hath this goblet about you.\n\n     ROBIN. You lie, drawer, 'tis afore me [Aside].--Sirrah you, I'll\n     teach you to impeach honest men;--stand by;--I'll scour you for\n     a goblet;--stand aside you had best, I charge you in the name of\n     Belzebub.--Look to the goblet, Ralph [Aside to RALPH].\n\n     VINTNER. What mean you, sirrah?\n\n     ROBIN. I'll tell you what I mean.  [Reads from a book] Sanctobulorum\n     Periphrasticon--nay, I'll tickle you, Vintner.--Look to the goblet,\n     Ralph [Aside to RALPH].--[Reads] Polypragmos Belseborams framanto\n     pacostiphos tostu, Mephistophilis, &c.\n\n          Enter MEPHISTOPHILIS, sets squibs at their backs, and then\n          exit.  They run about.\n\n     VINTNER. O, nomine Domini! what meanest thou, Robin? thou hast no\n     goblet.\n\n     RALPH. Peccatum peccatorum!--Here's thy goblet, good Vintner.\n          [Gives the goblet to VINTNER, who exit.]\n\n     ROBIN. Misericordia pro nobis! what shall I do?  Good devil, forgive\n     me now, and I'll never rob thy library more.\n\n          Re-enter MEPHISTOPHILIS.\n\n     MEPHIST. Monarch of Hell,[130] under whose black survey\n     Great potentates do kneel with awful fear,\n     Upon whose altars thousand souls do lie,\n     How am I vexed with these villains' charms?\n     From Constantinople am I hither come,\n     Only for pleasure of these damned slaves.\n\n     ROBIN. How, from Constantinople! you have had a great journey:\n     will you take sixpence in your purse to pay for your supper, and\n     be gone?\n\n     MEPHIST. Well, villains, for your presumption, I transform thee\n     into an ape, and thee into a dog; and so be gone!\n          [Exit.]\n\n     ROBIN. How, into an ape! that's brave:  I'll have fine sport with\n     the boys; I'll get nuts and apples enow.\n\n     RALPH. And I must be a dog.\n\n     ROBIN. I'faith, thy head will never be out of the pottage-pot.\n          [Exeunt.]\n\n          Enter EMPEROR,[131] FAUSTUS, and a KNIGHT, with ATTENDANTS.\n\n     EMPEROR. Master Doctor Faustus,[132] I have heard strange report\n     of thy knowledge in the black art, how that none in my empire\n     nor in the whole world can compare with thee for the rare effects\n     of magic:  they say thou hast a familiar spirit, by whom thou canst\n     accomplish what thou list.  This, therefore, is my request, that\n     thou let me see some proof of thy skill, that mine eyes may be\n     witnesses to confirm what mine ears have heard reported:  and here\n     I swear to thee, by the honour of mine imperial crown, that,\n     whatever thou doest, thou shalt be no ways prejudiced or endamaged.\n\n     KNIGHT. I'faith, he looks much like a conjurer.\n          [Aside.]\n\n     FAUSTUS. My gracious sovereign, though I must confess myself far\n     inferior to the report men have published, and nothing answerable\n     to the honour of your imperial majesty, yet, for that love and duty\n     binds me thereunto, I am content to do whatsoever your majesty\n     shall command me.\n\n     EMPEROR. Then, Doctor Faustus, mark what I shall say.\n     As I was sometime solitary set\n     Within my closet, sundry thoughts arose\n     About the honour of mine ancestors,\n     How they had won[133] by prowess such exploits,\n     Got such riches, subdu'd so many kingdoms,\n     As we that do succeed,[134] or they that shall\n     Hereafter possess our throne, shall\n     (I fear me) ne'er attain to that degree\n     Of high renown and great authority:\n     Amongst which kings is Alexander the Great,\n     Chief spectacle of the world's pre-eminence,\n     The bright[135] shining of whose glorious acts\n     Lightens the world with his reflecting beams,\n     As when I hear but motion made of him,\n     It grieves my soul I never saw the man:\n     If, therefore, thou, by cunning of thine art,\n     Canst raise this man from hollow vaults below,\n     Where lies entomb'd this famous conqueror,\n     And bring with him his beauteous paramour,\n     Both in their right shapes, gesture, and attire\n     They us'd to wear during their time of life,\n     Thou shalt both satisfy my just desire,\n     And give me cause to praise thee whilst I live.\n\n     FAUSTUS. My gracious lord, I am ready to accomplish your request,\n     so far forth as by art and power of my spirit I am able to perform.\n\n     KNIGHT. I'faith, that's just nothing at all.\n          [Aside.]\n\n     FAUSTUS. But, if it like your grace, it is not in my ability[136]\n     to present before your eyes the true substantial bodies of those\n     two deceased princes, which long since are consumed to dust.\n\n     KNIGHT. Ay, marry, Master Doctor, now there's a sign of grace in\n     you, when you will confess the truth.\n          [Aside.]\n\n     FAUSTUS. But such spirits as can lively resemble Alexander and\n     his paramour shall appear before your grace, in that manner that\n     they both[137] lived in, in their most flourishing estate; which\n     I doubt not shall sufficiently content your imperial majesty.\n\n     EMPEROR. Go to, Master Doctor; let me see them presently.\n\n     KNIGHT. Do you hear, Master Doctor? you bring Alexander and his\n     paramour before the Emperor!\n\n     FAUSTUS. How then, sir?\n\n     KNIGHT. I'faith, that's as true as Diana turned me to a stag.\n\n     FAUSTUS. No, sir; but, when Actaeon died, he left the horns for\n     you.--Mephistophilis, be gone.\n          [Exit MEPHISTOPHILIS.]\n\n     KNIGHT. Nay, an you go to conjuring, I'll be gone.\n          [Exit.]\n\n     FAUSTUS. I'll meet with you anon for interrupting me so.\n     --Here they are, my gracious lord.\n\n          Re-enter MEPHISTOPHILIS with SPIRITS in the shapes of ALEXANDER\n          and his PARAMOUR.\n\n     EMPEROR. Master Doctor, I heard this lady, while she lived, had a\n     wart or mole in her neck:  how shall I know whether it be so or no?\n\n     FAUSTUS. Your highness may boldly go and see.\n\n     EMPEROR. Sure, these are no spirits, but the true substantial\n     bodies of those two deceased princes.\n          [Exeunt Spirits.]\n\n     FAUSTUS. Wilt please your highness now to send for the knight\n     that was so pleasant with me here of late?\n\n     EMPEROR. One of you call him forth.\n          [Exit ATTENDANT.]\n\n          Re-enter the KNIGHT with a pair of horns on his head.\n\n     How now, sir knight! why, I had thought thou hadst been a bachelor,\n     but now I see thou hast a wife, that not only gives thee horns,\n     but makes thee wear them.  Feel on thy head.\n\n     KNIGHT. Thou damned wretch and execrable dog,\n     Bred in the concave of some monstrous rock,\n     How dar'st thou thus abuse a gentleman?\n     Villain, I say, undo what thou hast done!\n\n     FAUSTUS. O, not so fast, sir! there's no haste:  but, good, are\n     you remembered how you crossed me in my conference with the\n     Emperor?  I think I have met with you for it.\n\n     EMPEROR. Good Master Doctor, at my entreaty release him:  he hath\n     done penance sufficient.\n\n     FAUSTUS. My gracious lord, not so much for the injury he offered\n     me here in your presence, as to delight you with some mirth, hath\n     Faustus worthily requited this injurious knight; which being all\n     I desire, I am content to release him of his horns:--and,\n     sir knight, hereafter speak well of scholars.--Mephistophilis,\n     transform him straight.[138]  [MEPHISTOPHILIS removes the horns.]\n     --Now, my good lord, having done my duty, I humbly take my leave.\n\n     EMPEROR. Farewell, Master Doctor:  yet, ere you go,\n     Expect from me a bounteous reward.\n          [Exeunt EMPEROR, KNIGHT, and ATTENDANTS.]\n\n     FAUSTUS. Now, Mephistophilis,[139] the restless course\n     That time doth run with calm and silent foot,\n     Shortening my days and thread of vital life,\n     Calls for the payment of my latest years:\n     Therefore, sweet Mephistophilis, let us\n     Make haste to Wertenberg.\n\n     MEPHIST. What, will you go on horse-back or on foot[?]\n\n     FAUSTUS. Nay, till I'm past this fair and pleasant green,\n     I'll walk on foot.\n\n          Enter a HORSE-COURSER.[140]\n\n     HORSE-COURSER. I have been all this day seeking one Master Fustian:\n     mass, see where he is!--God save you, Master Doctor!\n\n     FAUSTUS. What, horse-courser! you are well met.\n\n     HORSE-COURSER. Do you hear, sir?  I have brought you forty dollars\n     for your horse.\n\n     FAUSTUS. I cannot sell him so:  if thou likest him for fifty, take\n     him.\n\n     HORSE-COURSER. Alas, sir, I have no more!--I pray you, speak for\n     me.\n\n     MEPHIST. I pray you, let him have him:  he is an honest fellow,\n     and he has a great charge, neither wife nor child.\n\n     FAUSTUS. Well, come, give me your money [HORSE-COURSER gives\n     FAUSTUS the money]:  my boy will deliver him to you.  But I must\n     tell you one thing before you have him; ride him not into the\n     water, at any hand.\n\n     HORSE-COURSER. Why, sir, will he not drink of all waters?\n\n     FAUSTUS. O, yes, he will drink of all waters; but ride him not\n     into the water:  ride him over hedge or ditch, or where thou wilt,\n     but not into the water.\n\n     HORSE-COURSER. Well, sir.--Now am I made man for ever:  I'll not\n     leave my horse for forty:[141]  if he had but the quality of\n     hey-ding-ding, hey-ding-ding, I'd make a brave living on him:\n     he has a buttock as slick as an eel [Aside].--Well, God b'wi'ye,\n     sir:  your boy will deliver him me:  but, hark you, sir; if my horse\n     be sick or ill at ease, if I bring his water to you, you'll tell\n     me what it is?\n\n     FAUSTUS. Away, you villain! what, dost think I am a horse-doctor?\n          [Exit HORSE-COURSER.]\n\n     What art thou, Faustus, but a man condemn'd to die?\n     Thy fatal time doth draw to final end;\n     Despair doth drive distrust into[142] my thoughts:\n     Confound these passions with a quiet sleep:\n     Tush, Christ did call the thief upon the Cross;\n     Then rest thee, Faustus, quiet in conceit.\n          [Sleeps in his chair.]\n\n          Re-enter HORSE-COURSER, all wet, crying.\n\n     HORSE-COURSER. Alas, alas!  Doctor Fustian, quoth a? mass, Doctor\n     Lopus[143] was never such a doctor:  has given me a purgation, has\n     purged me of forty dollars; I shall never see them more.  But yet,\n     like an ass as I was, I would not be ruled by him, for he bade me\n     I should ride him into no water:  now I, thinking my horse had had\n     some rare quality that he would not have had me know of,[144] I,\n     like a venturous youth, rid him into the deep pond at the town's\n     end.  I was no sooner in the middle of the pond, but my horse\n     vanished away, and I sat upon a bottle of hay, never so near\n     drowning in my life.  But I'll seek out my doctor, and have my\n     forty dollars again, or I'll make it the dearest horse!--O,\n     yonder is his snipper-snapper.--Do you hear? you, hey-pass,[145]\n     where's your master?\n\n     MEPHIST. Why, sir, what would you? you cannot speak with him.\n\n     HORSE-COURSER. But I will speak with him.\n\n     MEPHIST. Why, he's fast asleep:  come some other time.\n\n     HORSE-COURSER. I'll speak with him now, or I'll break his\n     glass-windows about his ears.\n\n     MEPHIST. I tell thee, he has not slept this eight nights.\n\n     HORSE-COURSER. An he have not slept this eight weeks, I'll\n     speak with him.\n\n     MEPHIST. See, where he is, fast asleep.\n\n     HORSE-COURSER. Ay, this is he.--God save you, Master Doctor,\n     Master Doctor, Master Doctor Fustian! forty dollars, forty dollars\n     for a bottle of hay!\n\n     MEPHIST. Why, thou seest he hears thee not.\n\n     HORSE-COURSER. So-ho, ho! so-ho, ho!  [Hollows in his ear.]  No,\n     will you not wake?  I'll make you wake ere I go.  [Pulls FAUSTUS\n     by the leg, and pulls it away.]  Alas, I am undone! what shall\n     I do?\n\n     FAUSTUS. O, my leg, my leg!--Help, Mephistophilis! call the\n     officers.--My leg, my leg!\n\n     MEPHIST. Come, villain, to the constable.\n\n     HORSE-COURSER. O Lord, sir, let me go, and I'll give you forty\n     dollars more!\n\n     MEPHIST. Where be they?\n\n     HORSE-COURSER. I have none about me:  come to my ostry,[146]\n     and I'll give them you.\n\n     MEPHIST. Be gone quickly.\n          [HORSE-COURSER runs away.]\n\n     FAUSTUS. What, is he gone? farewell he!  Faustus has his leg again,\n     and the Horse-courser, I take it, a bottle of hay for his labour:\n     well, this trick shall cost him forty dollars more.\n\n          Enter WAGNER.\n\n     How now, Wagner! what's the news with thee?\n\n     WAGNER. Sir, the Duke of Vanholt doth earnestly entreat your\n     company.\n\n     FAUSTUS. The Duke of Vanholt! an honourable gentleman, to whom\n     I must be no niggard of my cunning.[147]--Come, Mephistophilis,\n     let's away to him.\n          [Exeunt.]\n\n          Enter the DUKE OF VANHOLT, the DUCHESS, and FAUSTUS.[148]\n\n     DUKE. Believe me, Master Doctor, this merriment hath much pleased\n     me.\n\n     FAUSTUS. My gracious lord, I am glad it contents you so well.\n     --But it may be, madam, you take no delight in this.  I have heard\n     that great-bellied women do long for some dainties or other:  what\n     is it, madam? tell me, and you shall have it.\n\n     DUCHESS. Thanks, good Master Doctor:  and, for I see your courteous\n     intent to pleasure me, I will not hide from you the thing my heart\n     desires; and, were it now summer, as it is January and the dead\n     time of the winter, I would desire no better meat than a dish\n     of ripe grapes.\n\n     FAUSTUS. Alas, madam, that's nothing!--Mephistophilis, be gone.\n     [Exit MEPHISTOPHILIS.] Were it a greater thing than this, so it\n     would content you, you should have it.\n\n          Re-enter MEPHISTOPHILIS with grapes.\n\n     Here they be, madam:  wilt please you taste on them?\n\n     DUKE. Believe me, Master Doctor, this makes me wonder above the\n     rest, that being in the dead time of winter and in the month of\n     January, how you should come by these grapes.\n\n     FAUSTUS. If it like your grace, the year is divided into two\n     circles over the whole world, that, when it is here winter with\n     us, in the contrary circle it is summer with them, as in India,\n     Saba,[149] and farther countries in the east; and by means of a\n     swift spirit that I have, I had them brought hither, as you see.\n     --How do you like them, madam? be they good?\n\n     DUCHESS. Believe me, Master Doctor, they be the best grapes that\n     e'er I tasted in my life before.\n\n     FAUSTUS. I am glad they content you so, madam.\n\n     DUKE. Come, madam, let us in, where you must well reward this\n     learned man for the great kindness he hath shewed to you.\n\n     DUCHESS. And so I will, my lord; and, whilst I live, rest\n     beholding[150] for this courtesy.\n\n     FAUSTUS. I humbly thank your grace.\n\n     DUKE. Come, Master Doctor, follow us, and receive your reward.\n          [Exeunt.]\n\n          Enter WAGNER.[151]\n\n     WAGNER. I think my master means to die shortly,\n     For he hath given to me all his goods:[152]\n     And yet, methinks, if that death were near,\n     He would not banquet, and carouse, and swill\n     Amongst the students, as even now he doth,\n     Who are at supper with such belly-cheer\n     As Wagner ne'er beheld in all his life.\n     See, where they come! belike the feast is ended.\n          [Exit.]\n\n          Enter FAUSTUS with two or three SCHOLARS, and MEPHISTOPHILIS.\n\n     FIRST SCHOLAR. Master Doctor Faustus, since our conference about\n     fair ladies, which was the beautifulest in all the world, we have\n     determined with ourselves that Helen of Greece was the admirablest\n     lady that ever lived:  therefore, Master Doctor, if you will do us\n     that favour, as to let us see that peerless dame of Greece, whom\n     all the world admires for majesty, we should think ourselves much\n     beholding unto you.\n\n     FAUSTUS. Gentlemen,\n     For that I know your friendship is unfeign'd,\n     And Faustus' custom is not to deny\n     The just requests of those that wish him well,\n     You shall behold that peerless dame of Greece,\n     No otherways for pomp and majesty\n     Than when Sir Paris cross'd the seas with her,\n     And brought the spoils to rich Dardania.\n     Be silent, then, for danger is in words.\n          [Music sounds, and HELEN passeth over the stage.[153]]\n\n     SECOND SCHOLAR. Too simple is my wit to tell her praise,\n     Whom all the world admires for majesty.\n\n     THIRD SCHOLAR. No marvel though the angry Greeks pursu'd\n     With ten years' war the rape of such a queen,\n     Whose heavenly beauty passeth all compare.\n\n     FIRST SCHOLAR. Since we have seen the pride of Nature's works,\n     And only paragon of excellence,\n     Let us depart; and for this glorious deed\n     Happy and blest be Faustus evermore!\n\n     FAUSTUS. Gentlemen, farewell:  the same I wish to you.\n          [Exeunt SCHOLARS.]\n\n          Enter an OLD MAN.[154]\n\n     OLD MAN. Ah, Doctor Faustus, that I might prevail\n     To guide thy steps unto the way of life,\n     By which sweet path thou mayst attain the goal\n     That shall conduct thee to celestial rest!\n     Break heart, drop blood, and mingle it with tears,\n     Tears falling from repentant heaviness\n     Of thy most vile[155] and loathsome filthiness,\n     The stench whereof corrupts the inward soul\n     With such flagitious crimes of heinous sin[156]\n     As no commiseration may expel,\n     But mercy, Faustus, of thy Saviour sweet,\n     Whose blood alone must wash away thy guilt.\n\n     FAUSTUS. Where art thou, Faustus? wretch, what hast thou done?\n     Damn'd art thou, Faustus, damn'd; despair and die!\n     Hell calls for right, and with a roaring voice\n     Says, \"Faustus, come; thine hour is almost[157] come;\"\n     And Faustus now[158] will come to do thee right.\n          [MEPHISTOPHILIS gives him a dagger.]\n\n     OLD MAN. Ah, stay, good Faustus, stay thy desperate steps!\n     I see an angel hovers o'er thy head,\n     And, with a vial full of precious grace,\n     Offers to pour the same into thy soul:\n     Then call for mercy, and avoid despair.\n\n     FAUSTUS. Ah, my sweet friend, I feel\n     Thy words to comfort my distressed soul!\n     Leave me a while to ponder on my sins.\n\n     OLD MAN. I go, sweet Faustus; but with heavy cheer,\n     Fearing the ruin of thy hopeless soul.\n          [Exit.]\n\n     FAUSTUS. Accursed Faustus, where is mercy now?\n     I do repent; and yet I do despair:\n     Hell strives with grace for conquest in my breast:\n     What shall I do to shun the snares of death?\n\n     MEPHIST. Thou traitor, Faustus, I arrest thy soul\n     For disobedience to my sovereign lord:\n     Revolt, or I'll in piece-meal tear thy flesh.\n\n     FAUSTUS. Sweet Mephistophilis, entreat thy lord\n     To pardon my unjust presumption,\n     And with my blood again I will confirm\n     My former vow I made to Lucifer.\n\n     MEPHIST. Do it, then, quickly,[159] with unfeigned heart,\n     Lest greater danger do attend thy drift.\n\n     FAUSTUS. Torment, sweet friend, that base and crooked age,\n     That durst dissuade me from thy Lucifer,\n     With greatest torments that our hell affords.\n\n     MEPHIST. His faith is great; I cannot touch his soul;\n     But what I may afflict his body with\n     I will attempt, which is but little worth.\n\n     FAUSTUS. One thing, good servant,[160] let me crave of thee,\n     To glut the longing of my heart's desire,--\n     That I might have unto my paramour\n     That heavenly Helen which I saw of late,\n     Whose sweet embracings may extinguish clean\n     Those[161] thoughts that do dissuade me from my vow,\n     And keep mine oath I made to Lucifer.\n\n     MEPHIST. Faustus, this,[162] or what else thou shalt desire,\n     Shall be perform'd in twinkling of an eye.\n\n          Re-enter HELEN.\n\n     FAUSTUS. Was this the face that launch'd a thousand ships,\n     And burnt the topless[163] towers of Ilium--\n     Sweet Helen, make me immortal with a kiss.--\n          [Kisses her.]\n     Her lips suck forth my soul:  see, where it flies!--\n     Come, Helen, come, give me my soul again.\n     Here will I dwell, for heaven is[164] in these lips,\n     And all is dross that is not Helena.\n     I will be Paris, and for love of thee,\n     Instead of Troy, shall Wertenberg be sack'd;\n     And I will combat with weak Menelaus,\n     And wear thy colours on my plumed crest;\n     Yea, I will wound Achilles in the heel,\n     And then return to Helen for a kiss.\n     O, thou art fairer than the evening air\n     Clad in the beauty of a thousand stars;\n     Brighter art thou than flaming Jupiter\n     When he appear'd to hapless Semele;\n     More lovely than the monarch of the sky\n     In wanton Arethusa's azur'd arms;\n     And none but thou shalt[165] be my paramour!\n          [Exeunt.]\n\n          Enter the OLD MAN.[166]\n\n     OLD MAN. Accursed Faustus, miserable man,\n     That from thy soul exclud'st the grace of heaven,\n     And fly'st the throne of his tribunal-seat!\n\n          Enter DEVILS.\n\n     Satan begins to sift me with his pride:\n     As in this furnace God shall try my faith,\n     My faith, vile hell, shall triumph over thee.\n     Ambitious fiends, see how the heavens smile\n     At your repulse, and laugh your state to scorn!\n     Hence, hell! for hence I fly unto my God.\n          [Exeunt,--on one side, DEVILS, on the other, OLD MAN.]\n\n          Enter FAUSTUS,[167] with SCHOLARS.\n\n     FAUSTUS. Ah, gentlemen!\n\n     FIRST SCHOLAR. What ails Faustus?\n\n     FAUSTUS. Ah, my sweet chamber-fellow, had I lived with thee,\n     then had I lived still! but now I die eternally.  Look, comes\n     he not? comes he not?\n\n     SECOND SCHOLAR. What means Faustus?\n\n     THIRD SCHOLAR. Belike he is grown into some sickness by being\n     over-solitary.\n\n     FIRST SCHOLAR. If it be so, we'll have physicians to cure him.\n     --'Tis but a surfeit; never fear, man.\n\n     FAUSTUS. A surfeit of deadly sin, that hath damned both body\n     and soul.\n\n     SECOND SCHOLAR. Yet, Faustus, look up to heaven; remember God's\n     mercies are infinite.\n\n     FAUSTUS. But Faustus' offence can ne'er be pardoned:  the serpent\n     that tempted Eve may be saved, but not Faustus.  Ah, gentlemen,\n     hear me with patience, and tremble not at my speeches!  Though\n     my heart pants and quivers to remember that I have been a student\n     here these thirty years, O, would I had never seen Wertenberg,\n     never read book! and what wonders I have done, all Germany can\n     witness, yea, all the world; for which Faustus hath lost both\n     Germany and the world, yea, heaven itself, heaven, the seat of\n     God, the throne of the blessed, the kingdom of joy; and must\n     remain in hell for ever, hell, ah, hell, for ever!  Sweet friends,\n     what shall become of Faustus, being in hell for ever?\n\n     THIRD SCHOLAR. Yet, Faustus, call on God.\n\n     FAUSTUS. On God, whom Faustus hath abjured! on God, whom Faustus\n     hath blasphemed!  Ah, my God, I would weep! but the devil draws in\n     my tears.  Gush forth blood, instead of tears! yea, life and soul!\n     O, he stays my tongue!  I would lift up my hands; but see, they\n     hold them, they hold them!\n\n     ALL. Who, Faustus?\n\n     FAUSTUS. Lucifer and Mephistophilis.  Ah, gentlemen, I gave them\n     my soul for my cunning![168]\n\n     ALL. God forbid!\n\n     FAUSTUS. God forbade it, indeed; but Faustus hath done it:  for\n     vain pleasure of twenty-four years hath Faustus lost eternal joy\n     and felicity.  I writ them a bill with mine own blood:  the date\n     is expired; the time will come, and he will fetch me.\n\n     FIRST SCHOLAR. Why did not Faustus tell us of this before,[169]\n     that divines might have prayed for thee?\n\n     FAUSTUS. Oft have I thought to have done so; but the devil\n     threatened to tear me in pieces, if I named God, to fetch both\n     body and soul, if I once gave ear to divinity:  and now 'tis too\n     late.  Gentlemen, away, lest you perish with me.\n\n     SECOND SCHOLAR. O, what shall we do to save[170] Faustus?\n\n     FAUSTUS. Talk not of me, but save yourselves, and depart.\n\n     THIRD SCHOLAR. God will strengthen me; I will stay with Faustus.\n\n     FIRST SCHOLAR. Tempt not God, sweet friend; but let us into the\n     next room, and there pray for him.\n\n     FAUSTUS. Ay, pray for me, pray for me; and what noise soever\n     ye hear,[171] come not unto me, for nothing can rescue me.\n\n     SECOND SCHOLAR. Pray thou, and we will pray that God may have\n     mercy upon thee.\n\n     FAUSTUS. Gentlemen, farewell:  if I live till morning, I'll visit\n     you; if not, Faustus is gone to hell.\n\n     ALL. Faustus, farewell.\n          [Exeunt SCHOLARS.--The clock strikes eleven.]\n\n     FAUSTUS. Ah, Faustus,\n     Now hast thou but one bare hour to live,\n     And then thou must be damn'd perpetually!\n     Stand still, you ever-moving spheres of heaven,\n     That time may cease, and midnight never come;\n     Fair Nature's eye, rise, rise again, and make\n     Perpetual day; or let this hour be but\n     A year, a month, a week, a natural day,\n     That Faustus may repent and save his soul!\n     O lente,[172] lente currite, noctis equi!\n     The stars move still, time runs, the clock will strike,\n     The devil will come, and Faustus must be damn'd.\n     O, I'll leap up to my God!--Who pulls me down?--\n     See, see, where Christ's blood streams in the firmament!\n     One drop would save my soul, half a drop:  ah, my Christ!--\n     Ah, rend not my heart for naming of my Christ!\n     Yet will I call on him:  O, spare me, Lucifer!--\n     Where is it now? 'tis gone:  and see, where God\n     Stretcheth out his arm, and bends his ireful brows!\n     Mountains and hills, come, come, and fall on me,\n     And hide me from the heavy wrath of God!\n     No, no!\n     Then will I headlong run into the earth:\n     Earth, gape!  O, no, it will not harbour me!\n     You stars that reign'd at my nativity,\n     Whose influence hath allotted death and hell,\n     Now draw up Faustus, like a foggy mist.\n     Into the entrails of yon labouring cloud[s],\n     That, when you[173] vomit forth into the air,\n     My limbs may issue from your smoky mouths,\n     So that my soul may but ascend to heaven!\n          [The clock strikes the half-hour.]\n     Ah, half the hour is past! 'twill all be past anon\n     O God,\n     If thou wilt not have mercy on my soul,\n     Yet for Christ's sake, whose blood hath ransom'd me,\n     Impose some end to my incessant pain;\n     Let Faustus live in hell a thousand years,\n     A hundred thousand, and at last be sav'd!\n     O, no end is limited to damned souls!\n     Why wert thou not a creature wanting soul?\n     Or why is this immortal that thou hast?\n     Ah, Pythagoras' metempsychosis, were that true,\n     This soul should fly from me, and I be chang'd\n     Unto some brutish beast![174] all beasts are happy,\n     For, when they die,\n     Their souls are soon dissolv'd in elements;\n     But mine must live still to be plagu'd in hell.\n     Curs'd be the parents that engender'd me!\n     No, Faustus, curse thyself, curse Lucifer\n     That hath depriv'd thee of the joys of heaven.\n          [The clock strikes twelve.]\n     O, it strikes, it strikes!  Now, body, turn to air,\n     Or Lucifer will bear thee quick to hell!\n          [Thunder and lightning.]\n     O soul, be chang'd into little water-drops,\n     And fall into the ocean, ne'er be found!\n\n          Enter DEVILS.\n\n     My God, my god, look not so fierce on me!\n     Adders and serpents, let me breathe a while!\n     Ugly hell, gape not! come not, Lucifer!\n     I'll burn my books!--Ah, Mephistophilis!\n          [Exeunt DEVILS with FAUSTUS.]  [175]\n\n          Enter CHORUS.\n\n     CHORUS. Cut is the branch that might have grown full straight,\n     And burned is Apollo's laurel-bough,\n     That sometime grew within this learned man.\n     Faustus is gone:  regard his hellish fall,\n     Whose fiendful fortune may exhort the wise,\n     Only to wonder at unlawful things,\n     Whose deepness doth entice such forward wits\n     To practice more than heavenly power permits.\n          [Exit.]\n\n     Terminat hora diem; terminat auctor opus.\n\n\n\n\n\nFOOTNOTES:\n\n\n[Footnote 1: mate-- i.e. confound, defeat.]\n\n[Footnote 2: vaunt-- So the later 4tos.--2to 1604 \"daunt.\"]\n\n[Footnote 3: her-- All the 4tos \"his.\"]\n\n[Footnote 4: Whereas-- i.e. where.]\n\n[Footnote 5: cunning-- i.e. knowledge.]\n\n[Footnote 6: So the later 4tos.--2to 1604 \"more.\"]\n\n[Footnote 7: FAUSTUS discovered in his study-- Most probably, the Chorus,\nbefore going out, drew a curtain, and discovered Faustus sitting.\nIn B. Barnes's DIVILS CHARTER, 1607, we find; \"SCEN. VLTIMA.\nALEXANDER VNBRACED BETWIXT TWO CARDINALLS in his study LOOKING\nVPON A BOOKE, whilst a groome draweth the Curtaine.\"  Sig. L 3.]\n\n[Footnote 8: Analytics, 'tis thou, &c.-- Qy. \"Analytic\"? (but such\nphraseology was not uncommon).]\n\n[Footnote 9: So the later 4tos.--2to 1604 \"the\" (the printer\nhaving mistaken \"yt\" for \"ye\").]\n\n[Footnote 10: So the later 4tos (with various spelling).--2to 1604\n\"Oncaymaeon.\"]\n\n[Footnote 11: and-- So the later 4tos.--Not in 4to 1604.]\n\n[Footnote 12: Couldst-- So the later 4tos.--2to 1604 \"Wouldst.\"]\n\n[Footnote 13: men-- So the later 4tos.--2to 1604 \"man.\"]\n\n[Footnote 14: legatur-- All the 4tos \"legatus.\"]\n\n[Footnote 15: &c.-- So two of the later 4tos.--Not in 4to 1604.]\n\n[Footnote 16: law-- So the later 4tos.--2to 1604 \"Church.\"]\n\n[Footnote 17: This-- So the later 4tos.--2to 1604 \"His.\"]\n\n[Footnote 18: Too servile-- So the later 4tos.--2to 1604 \"The deuill.\"]\n\n[Footnote 19: Che sera, sera-- Lest it should be thought that I am wrong\nin not altering the old spelling here, I may quote from Panizzi's\nvery critical edition of the ORLANDO FURIOSO,\n     \"La satisfazion ci SERA pronta.\"  C. xviii. st. 67.]\n\n[Footnote 20: scenes-- \"And sooner may a gulling weather-spie\n              By drawing forth heavens SCEANES tell certainly,\" &c.\n                   Donne's FIRST SATYRE,--p. 327, ed. 1633.]\n\n[Footnote 21: tire-- So the later 4tos.--2to 1604 \"trie.\"]\n\n[Footnote 22: Enter WAGNER, &c.-- Perhaps the proper arrangement is,]\n     \"Wagner!\n      Enter WAGNER.\n      Commend me to my dearest friends,\" &c.]\n\n[Footnote 23: treasure-- So the later 4tos.--2to 1604 \"treasury.\"]\n\n[Footnote 24: Jove-- So again, p. 84, first col.,[See Note 59]\n:\n     \"Seeing Faustus hath incurr'd eternal death\n      By desperate thoughts against JOVE'S deity,\" &c.:\nand I may notice that Marlowe is not singular in applying the name\nJOVE to the God of Christians:]\n     \"Beneath our standard of JOUES powerfull sonne [i.e. Christ--\".\n          MIR. FOR MAGISTRATES, p. 642, ed. 1610.\n     \"But see the judgement of almightie JOUE,\" &c.\n          Id. p. 696.\n     \"O sommo GIOVE per noi crocifisso,\" &c.\n          Pulci,--MORGANTE MAG. C. ii. st. 1.]\n\n[Footnote 25: these elements-- So again, \"Within the bowels of THESE\nelements,\" &c., p. 87, first col,[See Note 90----\"THESE\" being\nequivalent to THE.  (Not unfrequently in our old writers THESE\nis little more than redundant.)]\n\n[Footnote 26: resolve-- i.e. satisfy, inform.]\n\n[Footnote 27: silk-- All the 4tos \"skill\" (and so the modern editors!).]\n\n[Footnote 28: the-- So the later 4tos.--2to 1604 \"our.\"]\n\n[Footnote 29: the fiery keel at Antwerp's bridge-- During the blockade\nof Antwerp by the Prince of Parma in 1585, \"They of Antuerpe\nknowing that the bridge and the Stocadoes were finished,\nmade a great shippe, to be a meanes to breake all this worke\nof the prince of Parmaes:  this great shippe was made of masons\nworke within, in the manner of a vaulted caue:  vpon the hatches\nthere were layed myll-stones, graue-stones, and others of great\nweight; and within the vault were many barrels of powder, ouer\nthe which there were holes, and in them they had put matches,\nhanging at a thred, the which burning vntill they came vnto\nthe thred, would fall into the powder, and so blow vp all.\nAnd for that they could not haue any one in this shippe to\nconduct it, Lanckhaer, a sea captaine of the Hollanders, being\nthen in Antuerpe, gaue them counsell to tye a great beame at the\nend of it, to make it to keepe a straight course in the middest\nof the streame.  In this sort floated this shippe the fourth of\nAprill, vntill that it came vnto the bridge; where (within a\nwhile after) the powder wrought his effect, with such violence,\nas the vessell, and all that was within it, and vpon it, flew in\npieces, carrying away a part of the Stocado and of the bridge.\nThe marquesse of Roubay Vicont of Gant, Gaspar of Robles lord of\nBilly, and the Seignior of Torchies, brother vnto the Seignior\nof Bours, with many others, were presently slaine; which were\ntorne in pieces, and dispersed abroad, both vpon the land and vpon\nthe water.\"  Grimeston's GENERALL HISTORIE OF THE NETHERLANDS,\np. 875, ed. 1609.]\n\n[Footnote 30: only-- Qy. \"alone\"?  (This line is not in the later 4tos.)]\n\n[Footnote 31: vile-- Old ed. \"vild\":  but see note ||, p. 68.--(This line\nis not in the later 4tos.)\n\n    [Note || from page 68 (The Second Part of Tamburlaine the\n     Great):]\n\n     Vile-- The 8vo \"Vild\"; the 4to \"Wild\" (Both eds. a little\n     before, have \"VILE monster, born of some infernal hag\", and,\n     a few lines after, \"To VILE and ignominious servitude\":--the\n     fact is, our early writers (or rather transcribers), with\n     their usual inconsistency of spelling, give now the one form,\n     and now the other:  compare the folio SHAKESPEARE, 1623,\n     where we sometimes find \"vild\" and sometimes \"VILE.\")--]\n\n[Footnote 32: concise syllogisms-- Old ed. \"Consissylogismes.\"]\n\n[Footnote 33: cunning-- i.e. knowing, skilful.]\n\n[Footnote 34: Agrippa-- i.e. Cornelius Agrippa.]\n\n[Footnote 35: shadow-- So the later 4tos.--2to 1604 \"shadowes.\"]\n\n[Footnote 36: spirits-- So the later 4tos.--2to 1604 \"subiects.\"]\n\n[Footnote 37: Almain rutters-- See note �, p. 43.]\n\n    [Note � from p. 43. (The Second Part of Tamburlaine the\n     Great):\n\n     Almains, Rutters-- Rutters are properly--German troopers\n     (reiter, reuter).  In the third speech after the present one\n     this line is repeated VERBATIM:  but in the first scene of\n     our author's FAUSTUS we have,\n         \"Like ALMAIN RUTTERS with their horsemen's staves.\"--]\n\n[Footnote 38: have the-- So two of the later 4tos.--2to 1604 \"in their.\"]\n\n[Footnote 39: From-- So the later 4tos.--2to 1604 \"For.\"]\n\n[Footnote 40: in-- So the later 4tos.--Not in 4to 1604.]\n\n[Footnote 41: renowm'd-- See note ||, p. 11.]\n\n    [Note || from p. 11. (The First Part of Tamburlaine the\n     Great):\n\n     renowmed-- i.e. renowned.--So the 8vo.--The 4to \"renowned.\"\n     --The form \"RENOWMED\" (Fr. RENOMME) occurs repeatedly\n     afterwards in this play, according to the 8vo.  It is\n     occasionally found in writers posterior to Marlowe's\n     time.  e.g.\n       \"Of Constantines great towne RENOUM'D in vaine.\"\n            Verses to King James, prefixed to Lord Stirling's\n            MONARCHICKE TRAGEDIES, ed. 1607.--]\n\n[Footnote 42: Albertus'-- i.e. Albertus Magnus.--The correction of I. M.\nin Gent. Mag. for Jan. 1841.--All the 4tos \"Albanus.\"]\n\n[Footnote 43: cunning-- i.e. skill.]\n\n[Footnote 44: Enter two SCHOLARS-- Scene, perhaps, supposed to be before\nFaustus's house, as Wagner presently says, \"My master is within\nat dinner.\"]\n\n[Footnote 45: upon-- So the later 4tos.--2to 1604 \"vpon't.\"]\n\n[Footnote 46: speak, would-- So the later 4tos.--2to 1604 \"speake, IT would.\"]\n\n[Footnote 47: my dear brethren-- This repetition (not found in the later 4tos)\nis perhaps an error of the original compositor.]\n\n[Footnote 48: Enter FAUSTUS to conjure-- The scene is supposed to be a grove;\nsee p. 81, last line of sec. col.\n   [Page 81, second column, last line:\n    \"VALDES. Then haste thee to some solitary grove,\"--]\n\n[Footnote 49: anagrammatiz'd-- So the later 4tos.--2to 1604 \"and\nAgramithist.\"]\n\n[Footnote 50: Th' abbreviated-- So the later 4tos.--2to 1604 \"The breuiated.\"]\n\n[Footnote 51: erring-- i.e. wandering.]\n\n[Footnote 52: surgat Mephistophilis, quod tumeraris-- The later 4tos have\n\"surgat Mephistophilis DRAGON, quod tumeraris.\"--There is a\ncorruption here, which seems to defy emendation.  For \"quod\nTUMERARIS,\" Mr. J. Crossley, of Manchester, would read (rejecting\nthe word \"Dragon\") \"quod TU MANDARES\" (the construction being\n\"quod tu mandares ut Mephistophilis appareat et surgat\"):  but the\n\"tu\" does not agree with the preceding \"vos.\"--The Revd. J. Mitford\nproposes \"surgat Mephistophilis, per Dragon (or Dagon) quod NUMEN\nEST AERIS.\"]\n\n[Footnote 53: dicatus-- So two of the later 4tos.--2to 1604 \"dicatis.\"]\n\n[Footnote 54: Re-enter Mephistophilis, &c.-- According to THE HISTORY OF\nDR. FAUSTUS, on which this play is founded, Faustus raises\nMephistophilis in \"a thicke wood neere to Wittenberg, called\nin the German tongue Spisser Wolt.....  Presently, not three\nfathom above his head, fell a flame in manner of a lightning,\nand changed itselfe into a globe.....  Suddenly the globe opened,\nand sprung up in the height of a man; so burning a time, in the\nend it converted to the shape of a fiery man[?-- This pleasant\nbeast ran about the circle a great while, and, lastly, appeared\nin the manner of a Gray Fryer, asking Faustus what was his\nrequest?\" Sigs. A 2, A 3, ed. 1648.  Again; \"After Doctor Faustus\nhad made his promise to the devill, in the morning betimes he\ncalled the spirit before him, and commanded him that he should\nalwayes come to him like a fryer after the order of Saint Francis,\nwith a bell in his hand like Saint Anthony, and to ring it once\nor twice before he appeared, that he might know of his certaine\ncoming.\"  Id. Sig. A 4.]\n\n[Footnote 55: came hither-- So two of the later 4tos.--2to 1604 \"came\nNOW hither.\"]\n\n[Footnote 56: accidens-- So two of the later 4tos.--2to 1604 \"accident.\"]\n\n[Footnote 57: Why, this is hell, nor am I out of it-- Compare Milton,\nPar. Lost, iv. 75;\n    \"Which way I fly is hell; myself am hell.\"]\n\n[Footnote 58: these-- So the later 4tos.--2to 1604 \"those.\"]\n\n[Footnote 59: Jove's-- See note �, p. 80. [i.e. Note 24]\n: ]\n\n[Footnote 60: four and twenty-- So the later 4tos.--2to 1604 \"24.\"]\n\n[Footnote 61: resolve-- i.e. satisfy, inform.]\n\n[Footnote 62: thorough-- So one of the later 4tos.--2to 1604 \"through.\"]\n\n[Footnote 63: country-- So the later 4tos.--2to 1604 \"land.\"]\n\n[Footnote 64: desir'd-- So the later 4tos.--2to 1604 \"desire.\"]\n\n[Footnote 65: Enter WAGNER, &c.-- Scene, a street most probably.]\n\n[Footnote 66: pickadevaunts-- i.e. beards cut to a point.]\n\n[Footnote 67: by'r lady-- i.e. by our Lady.]\n\n[Footnote 68: Qui mihi discipulus-- The first words of W. Lily's\nAD DISCIPULOS CARMEN DE MORIBUS,\n\n    \"Qui mihi discipulus, puer, es, cupis atque doceri,\n          Huc ades,\" &c.]\n\n[Footnote 69: staves-acre-- A species of larkspur.]\n\n[Footnote 70: vermin-- Which the seeds of staves-acre were used to destroy.]\n\n[Footnote 71: familiars-- i.e. attendant-demons.]\n\n[Footnote 72: their-- So the later 4tos.--2to 1604 \"my.\"]\n\n[Footnote 73: slop-- i.e. wide breeches.]\n\n[Footnote 74: vile-- Old ed. \"vild.\"  See note || p. 68.\n\n    [Note || from page 68 (The Second Part of Tamburlaine the\n     Great):\n\n     Vile-- The 8vo \"Vild\"; the 4to \"Wild\" (Both eds. a little\n     before, have \"VILE monster, born of some infernal hag\", and,\n     a few lines after, \"To VILE and ignominious servitude\":--the\n     fact is, our early writers (or rather transcribers), with\n     their usual inconsistency of spelling, give now the one form,\n     and now the other:  compare the folio SHAKESPEARE, 1623,\n     where we sometimes find \"vild\" and sometimes \"VILE.\")]\n\n[Footnote 75: vestigiis nostris-- All the 4tos \"vestigias nostras.\"]\n\n[Footnote 76: of-- So the later 4tos.--Not in 4to 1604.]\n\n[Footnote 77: me-- So the later 4tos.--Not in 4to 1604.]\n\n[Footnote 78: he lives-- So the later 4tos.--2to 1604 \"I liue.\"]\n\n[Footnote 79: why-- So the later 4tos.--Not in 4to 1604.]\n\n[Footnote 80: Solamen miseris, &c.-- An often-cited line of modern Latin\npoetry:  by whom it was written I know not.]\n\n[Footnote 81: Why-- So the later 4tos.--Not in 4to 1604.]\n\n[Footnote 82: torture-- So the later 4tos.--2to 1604 \"tortures.\"]\n\n[Footnote 83: Faustus-- So the later 4tos.--Not in 4to 1604.]\n\n[Footnote 84: Bill-- i.e. writing, deed.]\n\n[Footnote 85: Here's fire; come, Faustus, set it on-- This would not\nbe intelligible without the assistance of THE HISTORY OF\nDR. FAUSTUS, the sixth chapter of which is headed,--\"How Doctor\nFaustus set his blood in a saucer on warme ashes, and writ as\nfolloweth.\"  Sig. B, ed. 1648.]\n\n[Footnote 86: But what is this inscription, &c.-- \"He [Faustus-- tooke\na small penknife and prickt a veine in his left hand; and for\ncertainty thereupon were seen on his hand these words written,\nas if they had been written with blood, O HOMO, FUGE.\"\nTHE HISTORY OF DR. FAUSTUS, Sig. B, ed. 1648.]\n\n[Footnote 87: me-- So the later 4tos.--2to 1604 \"thee.\"]\n\n[Footnote 88: he desires-- Not in any of the four 4tos.  In the tract\njust cited, the \"3d Article\" stands thus,--\"That Mephostophiles\nshould bring him any thing, and doe for him whatsoever.\"  Sig. A 4,\ned. 1648.  A later ed. adds \"he desired.\"  Marlowe, no doubt,\nfollowed some edition of the HISTORY in which these words,\nor something equivalent to them, had been omitted by mistake.\n(2to 1661, which I consider as of no authority, has \"he\nrequireth.\")]\n\n[Footnote 89: that, &c.-- So all the 4tos, ungrammatically.]\n\n[Footnote 90: these-- See note Sec., p. 80.[i.e. Note 25]\n: ]\n\n[Footnote 91: there-- So the later 4tos.--Not in 4to 1604.]\n\n[Footnote 92: are-- So two of the later 4tos.--2to 1604 \"is.\"]\n\n[Footnote 93: fond-- i.e. foolish.]\n\n[Footnote 94: What! walking, disputing, &c.-- The later 4tos have \"What,\nSLEEPING, EATING, walking, AND disputing!\" But it is evident\nthat this speech is not given correctly in any of the old eds.]\n\n[Footnote 95: let me have a wife, &c.-- The ninth chapter of THE HISTORY\nOF DR. FAUSTUS narrates \"How Doctor Faustus would have married,\nand how the Devill had almost killed him for it,\" and concludes\nas follows.  \"It is no jesting [said Mephistophilis-- with us:\nhold thou that which thou hast vowed, and we will peforme as we\nhave promised; and more shall that, thou shalt have thy hearts\ndesire of what woman soever thou wilt, be she alive or dead,\nand so long as thou wilt thou shalt keep her by thee.--These\nwords pleased Faustus wonderfull well, and repented himself that\nhe was so foolish to wish himselfe married, that might have any\nwoman in the whole city brought him at his command; the which\nhe practised and persevered in a long time.\"  Sig. B 3, ed. 1648.]\n\n[Footnote 96: me-- Not in 4to 1604.  (This line is wanting in the later 4tos.)]\n\n[Footnote 97: no-- So the later 4tos.--Not in 4to 1604.]\n\n[Footnote 98: Saba-- i.e. Sabaea--the Queen of Sheba.]\n\n[Footnote 99: iterating-- i.e. reciting, repeating.]\n\n[Footnote 100: And argue of divine astrology, &c.-- In THE HISTORY OF\nDR. FAUSTUS, there are several tedious pages on the subject;\nbut our dramatist, in the dialogue which follows, has no\nparticular obligations to them.]\n\n[Footnote 101: erring-- i.e. wandering.]\n\n[Footnote 102: freshmen's-- \"A Freshman, tiro, novitius.\" Coles's DICT.\nProperly, a student during his first term at the university.]\n\n[Footnote 103: resolve-- i.e. satisfy, inform.]\n\n[Footnote 104: Seek to save-- Qy. \"Seek THOU to save\"?  But see note ||,\np. 18.]\n\n    [Note ||, from page 18 (The First Part of Tamburlaine The\n     Great):\n\n     Barbarous-- Qy. \"O Barbarous\"? in the next line but one,\n     \"O treacherous\"? and in the last line of the speech,\n     \"O bloody\"?  But we occasionally find in our early dramatists\n     lines which are defective in the first syllable; and in some\n     of these instances at least it would almost seem that nothing\n     has been omitted by the transcriber or printer.--]\n\n[Footnote 105: Enter the SEVEN DEADLY SINS-- In THE HISTORY OF DR. FAUSTUS,\nLucifer amuses Faustus, not by calling up the Seven Deadly Sins,\nbut by making various devils appear before him, \"one after another,\nin forme as they were in hell.\"  \"First entered Beliall in forme\nof a beare,\" &c.--\"after him came Beelzebub, in curled haire of\na horseflesh colour,\" &c.--\"then came Astaroth, in the forme of\na worme,\" &c. &c.  During this exhibition, \"Lucifer himselfe sate\nin manner of a man all hairy, but of browne colour, like a\nsquirrell, curled, and his tayle turning upward on his backe as\nthe squirrels use:  I think he could crack nuts too like a\nsquirrell.\"  Sig. D, ed. 1648.]\n\n[Footnote 106: case-- i.e. couple.]\n\n[Footnote 107: bevers-- i.e. refreshments between meals.]\n\n[Footnote 108: L.-- All the 4tos \"Lechery.\"--Here I have made the alteration\nrecommended by Mr. Collier in his Preface to COLERIDGE'S SEVEN\nLECTURES ON SHAKESPEARE AND MILTON, p. cviii.]\n\n[Footnote 109: Away, to hell, to hell-- In 4to 1604, these words stand\non a line by themselves, without a prefix.  (In the later 4tos,\nthe corresponding passage is as follows;\n    \"------ begins with Lechery.\n\n     LUCIFER. Away to hell, away!  On, piper!  [Exeunt the SINS.\n     FAUSTUS. O, how this sight doth delight my soul!\" &c.)]\n\n[Footnote 110: I will send for thee at midnight-- In THE HISTORY OF DR.\nFAUSTUS, we have a particular account of Faustus's visit\nto the infernal regions, Sig. D 2, ed. 1648.]\n\n[Footnote 111: Enter CHORUS-- Old ed. \"Enter WAGNER solus.\"  That these\nlines belong to the Chorus would be evident enough, even if we\nhad no assistance here from the later 4tos.--The parts of Wagner\nand of the Chorus were most probably played by the same actor:\nand hence the error.]\n\n[Footnote 112: Learned Faustus,\n      To know the secrets of astronomy, &c.-- See the 21st chapter\nof THE HISTORY OF DR. FAUSTUS,--\"How Doctor Faustus was carried\nthrough the ayre up to the heavens, to see the whole world,\nand how the sky and planets ruled,\" &c.]\n\n[Footnote 113: Enter FAUSTUS and MEPHISTOPHILIS-- Scene, the Pope's\nprivy-chamber.]\n\n[Footnote 114: Trier-- i.e. Treves or Triers.]\n\n[Footnote 115: From Paris next, &c.-- This description is from THE HISTORY\nOF DR. FAUSTUS; \"He came from Paris to Mentz, where the river\nof Maine falls into the Rhine:  notwithstanding he tarried not\nlong there, but went into Campania, in the kingdome of Neapol,\nin which he saw an innumerable sort of cloysters, nunries, and\nchurches, and great houses of stone, the streets faire and large,\nand straight forth from one end of the towne to the other as a\nline; and all the pavement of the city was of bricke, and the\nmore it rained into the towne, the fairer the streets were:\nthere saw he the tombe of Virgill, and the highway that he cu[t]\nthrough the mighty hill of stone in one night, the whole length\nof an English mile,\" &c. Sig. E 2, ed. 1648.]\n\n[Footnote 116: The way he cut, &c.-- During the middle ages Virgil was\nregarded as a great magician, and much was written concerning\nhis exploits in that capacity.  The LYFE OF VIRGILIUS, however,\n(see Thoms's EARLY PROSE ROMANCES, vol. ii.,) makes no mention\nof the feat in question.  But Petrarch speaks of it as follows.\n\"Non longe a Puteolis Falernus collis attollitur, famoso palmite\nnobilis.  Inter Falernum et mare mons est saxeus, hominum manibus\nconfossus, quod vulgus insulsum a Virgilio magicis cantaminibus\nfactum putant:  ita clarorum fama hominum, non veris contenta\nlaudibus, saepe etiam fabulis viam facit.  De quo cum me olim\nRobertus regno clarus, sed praeclarus ingenio ac literis, quid\nsentirem, multis astantibus, percunctatus esset, humanitate fretus\nregia, qua non reges modo sed homines vicit, jocans nusquam me\nlegisse magicarium fuisse Virgilium respondi:  quod ille severissimae\nnutu frontis approbans, non illic magici sed ferri vestigia\nconfessus est.  Sunt autem fauces excavati montis angustae sed\nlongissimae atque atrae:  tenebrosa inter horrifica semper nox:\npublicum iter in medio, mirum et religioni proximum, belli quoque\nimmolatum temporibus, sic vero populi vox est, et nullis unquam\nlatrociniis attentatum, patet:  Criptam Neapolitanam dicunt, cujus\net in epistolis ad Lucilium Seneca mentionem fecit.  Sub finem fusci\ntramitis, ubi primo videri coelum incipit, in aggere edito, ipsius\nVirgilii busta visuntur, pervetusti operis, unde haec forsan ab\nillo perforati montis fluxit opinio.\"  ITINERARIUM SYRIACUM,--OPP.\np. 560, ed. Bas.]\n\n[Footnote 117: From thence to Venice, Padua, and the rest,\n      In one of which a sumptuous temple stands, &c.-- So the\nlater 4tos.--2to 1604 \"In MIDST of which,\" &c.--THE HISTORY\nOF DR. FAUSTUS shews WHAT \"sumptuous temple\" is meant:  \"From\nthence he came to Venice....He wondred not a little at the\nfairenesse of S. Marks Place, and the sumptuous church standing\nthereon, called S. Marke, how all the pavement was set with\ncoloured stones, and all the rood or loft of the church double\ngilded over.\"  Sig. E 2, ed. 1648.]\n\n[Footnote 118: Just through the midst, &c.-- This and the next line are\nnot in 4to 1604.  I have inserted them from the later 4tos, as\nbeing absolutely necessary for the sense.]\n\n[Footnote 119: Ponte-- All the 4tos \"Ponto.\"]\n\n[Footnote 120: of-- So the later 4tos.--Not in 4to 1604.]\n\n[Footnote 121: Then charm me, that I, &c.-- A corrupted passage.--Compare\nTHE HISTORY OF DR. FAUSTUS, Sig. E 3, ed. 1648; where, however,\nthe Cardinal, whom the Pope entertains, is called the Cardinal\nof PAVIA.]\n\n[Footnote 122: Sonnet-- Variously written, SENNET, SIGNET, SIGNATE, &c.--A\nparticular set of notes on the trumpet, or cornet, different from\na flourish.  See Nares's GLOSS. in V. SENNET.]\n\n[Footnote 123: Enter ROBIN, &c.-- Scene, near an inn.]\n\n[Footnote 124: ippocras-- Or HIPPOCRAS,--a medicated drink composed of wine\n(usually red) with spices and sugar.  It is generally supposed to\nhave been so called from HIPPOCRATES (contracted by our earliest\nwriters to HIPPOCRAS); perhaps because it was strained,--the woollen\nbag used by apothecaries to strain syrups and decoctions for\nclarification being termed HIPPOCRATES' SLEEVE.]\n\n[Footnote 125: tabern-- i.e. tavern.]\n\n[Footnote 126:      [Exeunt.\n      Enter ROBIN and RALPH, &c.-- A scene is evidently wanting\nafter the Exeunt of Robin and Ralph.]\n\n[Footnote 127: purchase-- i.e. booty--gain, acquisition.]\n\n[Footnote 128: Drawer-- There is an inconsistency here:  the Vintner\ncannot properly be addressed as \"Drawer.\"  The later 4tos are\nalso inconsistent in the corresponding passage:  Dick says, \"THE\nVINTNER'S BOY follows us at the hard heels,\" and immediately\nthe \"VINTNER\" enters.]\n\n[Footnote 129: tone-- i.e. the one.]\n\n[Footnote 130: MEPHIST-- Monarch of hell, &c.-- Old ed. thus:--]\n\n    \"MEPHIST. Vanish vilaines, th' one like an Ape, an other like\n     a Beare, the third an Asse, for doing this enterprise.\n\n     Monarch of hell, vnder whose blacke suruey,\" &c.\n\nWhat follows, shews that the words which I have omitted ought\nto have no place in the text; nor is there any thing equivalent\nto them in the corresponding passage of the play as given in\nthe later 4tos.]\n\n[Footnote 131: Enter EMPEROR, &c.-- Scene--An apartment in the Emperor's\nPalace.  According to THE HISTORY OF DR. FAUSTUS, the Emperor\n\"was personally, with the rest of the nobles and gentlemen, at\nthe towne of Inzbrack, where he kept his court.\"  Sig. G, ed. 1648.]\n\n[Footnote 132: Master Doctor Faustus, &c-- The greater part of this scene\nis closely borrowed from the history just cited:  e.g. \"Faustus,\nI have heard much of thee, that thou art excellent in the black art,\nand none like thee in mine empire; for men say that thou hast a\nfamiliar spirit with thee, and that thou canst doe what thou list;\nit is therefore (said the Emperor) my request of thee, that thou\nlet me see a proofe of thy experience:  and I vow unto thee, by\nthe honour of my emperiall crowne, none evill shall happen unto\nthee for so doing,\" &c.  Ibid.]\n\n[Footnote 133: won-- May be right:  but qy. \"done\"?]\n\n[Footnote 134: As we that do succeed, &c.-- A corrupted passage (not found\nin the later 4tos).]\n\n[Footnote 135: The bright, &c.-- See note ||, p. 18.]\n\n    [Note ||, from page 18 (The First Part of Tamburlaine The\n     Great):\n\n     Barbarous-- Qy. \"O Barbarous\"? in the next line but one,\n     \"O treacherous\"? and in the last line of the speech,\n     \"O bloody\"?  But we occasionally find in our early dramatists\n     lines which are defective in the first syllable; and in\n     some of these instances at least it would almost seem that\n     nothing has been omitted by the transcriber or printer.--]\n\n[Footnote 136: But, if it like your grace, it is not in my ability, &c.]\n\"D. Faustus answered, My most excellent lord, I am ready to\naccomplish your request in all things, so farre forth as I and\nmy spirit are able to performe:  yet your majesty shall know that\ntheir dead bodies are not able substantially to be brought before\nyou; but such spirits as have seene Alexander and his Paramour\nalive shall appeare unto you, in manner and form as they both\nlived in their most flourishing time; and herewith I hope to\nplease your Imperiall Majesty.  Then Faustus went a little aside\nto speake to his spirit; but he returned againe presently, saying,\nNow, if it please your Majesty, you shall see them; yet, upon this\ncondition, that you demand no question of them, nor speake unto\nthem; which the Emperor agreed unto.  Wherewith Doctor Faustus opened\nthe privy-chamber doore, where presently entered the great and mighty\nemperor Alexander Magnus, in all things to looke upon as if he\nhad beene alive; in proportion, a strong set thicke man, of a\nmiddle stature, blacke haire, and that both thicke and curled,\nhead and beard, red cheekes, and a broad face, with eyes like\na basiliske; he had a compleat harnesse (i.e. suit of armour)\nburnished and graven, exceeding rich to look upon:  and so,\npassing towards the Emperor Carolus, he made low and reverend\ncourtesie:  whereat the Emperour Carolus would have stood up to\nreceive and greet him with the like reverence; but Faustus tooke\nhold on him, and would not permit him to doe it.  Shortly after,\nAlexander made humble reverence, and went out againe; and comming\nto the doore, his paramour met him.  She comming in made the Emperour\nlikewise reverence:  she was cloathed in blew velvet, wrought and\nimbroidered with pearls and gold; she was also excellent faire,\nlike milke and blood mixed, tall and slender, with a face round\nas an apple.  And thus passed [she-- certaine times up and downe\nthe house; which the Emperor marking, said to himselfe, Now have\nI seene two persons which my heart hath long wished to behold;\nand sure it cannot otherwise be (said he to himselfe) but that\nthe spirits have changed themselves into these formes, and have\nbut deceived me, calling to minde the woman that raised the prophet\nSamuel:  and for that the Emperor would be the more satisfied in\nthe matter, he said, I have often heard that behind, in her neck,\nshe had a great wart or wen; wherefore he tooke Faustus by the\nhand without any words, and went to see if it were also to be\nseene on her or not; but she, perceiving that he came to her,\nbowed downe her neck, when he saw a great wart; and hereupon she\nvanished, leaving the Emperor and the rest well contented.\"\nTHE HISTORY OF DR. FAUSTUS, Sig. G, ed. 1648.]\n\n[Footnote 137: both-- Old ed. \"best.\"]\n\n[Footnote 138: Mephistophilis, transform him straight-- According to THE\nHISTORY OF DR. FAUSTUS, the knight was not present during Faustus's\n\"conference\" with the Emperor; nor did he offer the doctor any\ninsult by doubting his skill in magic.  We are there told that\nFaustus happening to see the knight asleep, \"leaning out of a\nwindow of the great hall,\" fixed a huge pair of hart's horns on\nhis head; \"and, as the knight awaked, thinking to pull in his head,\nhe hit his hornes against the glasse, that the panes thereof flew\nabout his eares:  thinke here how this good gentleman was vexed,\nfor he could neither get backward nor forward.\"  After the emperor\nand the courtiers, to their great amusement, had beheld the poor\nknight in this condition, Faustus removed the horns.  When Faustus,\nhaving taken leave of the emperor, was a league and a half from\nthe city, he was attacked in a wood by the knight and some of his\ncompanions:  they were in armour, and mounted on fair palfreys;\nbut the doctor quickly overcame them by turning all the bushes\ninto horsemen, and \"so charmed them, that every one, knight and\nother, for the space of a whole moneth, did weare a paire of\ngoates hornes on their browes, and every palfry a paire of oxe\nhornes on his head; and this was their penance appointed by\nFaustus.\"  A second attempt of the knight to revenge himself on\nFaustus proved equally unsuccessful.  Sigs. G 2, I 3, ed. 1648.]\n\n[Footnote 139: FAUSTUS. Now Mephistophilis, &c.-- Here the scene is supposed\nto be changed to the \"fair and pleasant green\" which Faustus\npresently mentions.]\n\n[Footnote 140: Horse-courser-- i.e. Horse-dealer.--We are now to suppose the\nscene to be near the home of Faustus, and presently that it is the\ninterior of his house, for he falls asleep in his chair.--\"How\nDoctor Faustus deceived a Horse-courser\" is related in a short\nchapter (the 34th) of THE HISTORY OF DOCTOR FAUSTUS:  \"After this\nmanner he served a horse-courser at a faire called Pheiffering,\" &c.]\n\n[Footnote 141: for forty-- Qy. \"for TWICE forty DOLLARS\"?]\n\n[Footnote 142: into-- So the later 4tos.--2to 1604 \"vnto.\"]\n\n[Footnote 143: Doctor Lopus-- i.e. Doctor Lopez, domestic physician\nto Queen Elizabeth, who was put to death for having received\na bribe from the court of Spain to destroy her.  He is frequently\nmentioned in our early dramas:  see my note on Middleton's WORKS,\niv. 384.]\n\n[Footnote 144: know of-- The old ed. has \"KNOWNE of\"; which perhaps is right,\nmeaning--acquainted with.]\n\n[Footnote 145: hey-pass-- Equivalent to--juggler.]\n\n[Footnote 146: ostry-- i.e. inn,--lodging.]\n\n[Footnote 147: cunning-- i.e. skill.]\n\n[Footnote 148:      [Exeunt.\n      Enter the DUKE OF VANHOLT, the DUCHESS, and FAUSTUS-- Old ed.;\n\n           \"Exeunt.\n      Enter to them the DUKE, the DUTCHESS, the DUKE speakes.\"\n\nIn the later 4tos a scene intervenes between the \"Exeunt\" of\nFaustus, Mephistophilis, and Wagner, and the entrance of the Duke\nof Vanholt, &c.--We are to suppose that Faustus is now at the court\nof the Duke of Vanholt:  this is plain, not only from the later 4tos,\n--in which Wagner tells Faustus that the Duke \"hath sent some of\nhis men to attend him, with provision fit for his journey,\"--but\nfrom THE HISTORY OF DOCTOR FAUSTUS, the subjoined portion of which\nis closely followed in the present scene.  \"Chap. xxxix. HOW DOCTOR\nFAUSTUS PLAYED A MERRY JEST WITH THE DUKE OF ANHOLT IN HIS COURT.\nDoctor Faustus on a time went to the Duke of Anholt, who welcommed\nhim very courteously; this was the moneth of January; where sitting\nat the table, he perceived the dutchess to be with child; and\nforbearing himselfe untill the meat was taken from the table,\nand that they brought in the banqueting dishes [i.e. the dessert--,\nDoctor Faustus said to the dutchesse, Gratious lady, I have alwayes\nheard that great-bellied women doe alwayes long for some dainties;\nI beseech therefore your grace, hide not your minde from me, but\ntell me what you desire to eat.  She answered him, Doctor Faustus,\nnow truly I will not hide from you what my heart doth most desire;\nnamely, that, if it were now harvest, I would eat my bellyfull of\ngrapes and other dainty fruit.  Doctor Faustus answered hereupon,\nGracious lady, this is a small thing for me to doe, for I can doe\nmore than this.  Wherefore he tooke a plate, and set open one of\nthe casements of the window, holding it forth; where incontinent\nhe had his dish full of all manner of fruit, as red and white\ngrapes, peares, and apples, the which came from out of strange\ncountries:  all these he presented the dutchesse, saying, Madam,\nI pray you vouchsafe to taste of this dainty fruit, the which\ncame from a farre countrey, for there the summer is not yet ended.\nThe dutchesse thanked Faustus highly, and she fell to her fruit\nwith full appetite.  The Duke of Anholt notwithstanding could not\nwithhold to ask Faustus with what reason there were such young\nfruit to be had at that time of the yeare.  Doctor Faustus told\nhim, May it please your grace to understand that the year is\ndivided into two circles of the whole world, that when with us it\nis winter, in the contrary circle it is notwithstanding summer;\nfor in India and Saba there falleth or setteth the sunne, so that\nit is so warm that they have twice a yeare fruit; and, gracious\nlord, I have a swift spirit, the which can in the twinkling of\nan eye fulfill my desire in any thing; wherefore I sent him into\nthose countries, who hath brought this fruit as you see:  whereat\nthe duke was in great admiration.\"]\n\n[Footnote 149: Saba-- i.e. Sabaea.]\n\n[Footnote 150: beholding-- i.e. beholden.]\n\n[Footnote 151: Enter WAGNER-- Scene, a room in the house of Faustus.]\n\n[Footnote 152: he hath given to me all his goods-- Compare chap. lvi. of\nTHE HISTORY OF DOCTOR FAUSTUS,--\"How Doctor Faustus made his will,\nin which he named his servant Wagner to be his heire.\"]\n\n[Footnote 153: HELEN passeth over the stage-- In THE HISTORY OF DOCTOR\nFAUSTUS we have the following description of Helen.  \"This lady\nappeared before them in a most rich gowne of purple velvet, costly\nimbrodered; her haire hanged downe loose, as faire as the beaten\ngold, and of such length that it reached downe to her hammes;\nhaving most amorous cole-black eyes, a sweet and pleasant round\nface, with lips as red as a cherry; her cheekes of a rose colour,\nher mouth small, her neck white like a swan; tall and slender of\npersonage; in summe, there was no imperfect place in her:  she\nlooked round about with a rolling hawkes eye, a smiling and\nwanton countenance, which neere-hand inflamed the hearts of all\nthe students; but that they perswaded themselves she was a spirit,\nwhich made them lightly passe away such fancies.\"  Sig. H 4, ed. 1648.]\n\n[Footnote 154: Enter an OLD MAN-- See chap. xlviii of THE HISTORY OF DOCTOR\nFAUSTUS,--\"How an old man, the neighbour of Faustus, sought to\nperswade him to amend his evil life and to fall into repentance,\"\n--according to which history, the Old Man's exhortation is delivered\nat his own house, whither he had invited Faustus to supper.]\n\n[Footnote 155: vild-- Old ed. \"vild.\"  See note ||, p. 68.\n\n    [Note || from page 68 (The Second Part of Tamburlaine the\n     Great):\n\n     Vile-- The 8vo \"Vild\"; the 4to \"Wild\" (Both eds. a little\n     before, have \"VILE monster, born of some infernal hag\", and,\n     a few lines after, \"To VILE and ignominious servitude\":--the\n     fact is, our early writers (or rather transcribers), with\n     their usual inconsistency of spelling, give now the one form,\n     and now the other:  compare the folio SHAKESPEARE, 1623,\n     where we sometimes find \"vild\" and sometimes \"VILE.\")--]\n\n[Footnote 156: sin-- Old ed. \"sinnes\" (This is not in the later 4tos).]\n\n[Footnote 157: almost-- So the later 4tos.--Not in 4to 1604.]\n\n[Footnote 158: now-- So the later 4tos.--Not in 4to 1604.]\n\n[Footnote 159: MEPHIST. Do it, then, quickly, &c.-- After this speech,\nmost probably, there ought to be a stage-direction, \"FAUSTUS\nSTABS HIS ARM, AND WRITES ON A PAPER WITH HIS BLOOD.  Compare\nTHE HISTORY OF DOCTOR FAUSTUS, chap. xlix,--\"How Doctor Faustus\nwrote the second time with his owne blood, and gave it to the\nDevill.\"]\n\n[Footnote 160: One thing, good servant, &c.-- \"To the end that this miserable\nFaustus might fill the lust of his flesh and live in all manner\nof voluptuous pleasure, it came in his mind, after he had slept\nhis first sleepe, and in the 23 year past of his time, that he\nhad a great desire to lye with faire Helena of Greece, especially\nher whom he had seen and shewed unto the students at Wittenberg:\nwherefore he called unto his spirit Mephostophiles, commanding him\nto bring to him the faire Helena; which he also did.  Whereupon he\nfell in love with her, and made her his common concubine and\nbed-fellow; for she was so beautifull and delightfull a peece,\nthat he could not be one houre from her, if he should therefore\nhave suffered death, she had so stoln away his heart:  and, to\nhis seeming, in time she was with childe, whom Faustus named\nJustus Faustus.  The childe told Doctor Faustus many things which\nwere don in forraign countrys; but in the end, when Faustus lost\nhis life, the mother and the childe vanished away both together.\"\nTHE HISTORY OF DOCTOR FAUSTUS, Sig. I 4, ed. 1648.]\n\n[Footnote 161: Those-- So the later 4tos.--2to 1604 \"These.\"]\n\n[Footnote 162: Faustus, this-- Qy. \"This, Faustus\"?]\n\n[Footnote 163: topless-- i.e. not exceeded in height by any.]\n\n[Footnote 164: is-- So the later 4tos.--2to 1604 \"be.\"]\n\n[Footnote 165: shalt-- So all the 4tos; and so I believe Marlowe wrote,\nthough the grammar requires \"shall.\"]\n\n[Footnote 166: Enter the OLD MAN-- Scene, a room in the Old Man's house.\n--In THE HISTORY OF DOCTOR FAUSTUS the Old Man makes himself very\nmerry with the attempts of the evil powers to hurt him.  \"About\ntwo dayes after that he had exhorted Faustus, as the poore man\nlay in his bed, suddenly there was a mighty rumbling in the\nchamber, the which he was never wont to heare, and he heard as\nit had beene the groaning of a sow, which lasted long:  whereupon\nthe good old man began to jest and mocke, and said, Oh, what a\nbarbarian cry is this?  Oh faire bird, what foul musicke is this?\nA[h--, faire angell, that could not tarry two dayes in his place!\nbeginnest thou now to runne into a poore mans house, where thou\nhast no power, and wert not able to keepe thy owne two dayes?\nWith these and such like words the spirit departed,\" &c.\nSig. I 2, ed. 1648.]\n\n[Footnote 167: Enter Faustus, &c.-- Scene, a room in the house of Faustus.]\n\n[Footnote 168: cunning-- i.e. knowledge, skill.]\n\n[Footnote 169: Why did not Faustus tell us of this before, &c.-- \"Wherefore\none of them said unto him, Ah, friend Faustus, what have you done\nto conceale this matter so long from us?  We would, by the helpe\nof good divines and the grace of God, have brought you out of this\nnet, and have torne you out of the bondage and chaines of Satan;\nwhereas now we feare it is too late, to the utter ruine both of\nyour body and soule.  Doctor Faustus answered, I durst never doe\nit, although I often minded to settle my life [myself?-- to godly\npeople to desire counsell and helpe; and once mine old neighbour\ncounselled me that I should follow his learning and leave all my\nconjurations:  yet, when I was minded to amend and to follow that\ngood mans counsell, then came the Devill and would have had me\naway, as this night he is like to doe, and said, so soone as I\nturned againe to God, he would dispatch me altogether.\"  THE\nHISTORY OF DOCTOR FAUSTUS, Sig. K 3, ed. 1648.]\n\n[Footnote 170: save-- So the later 4tos.--Not in 4to 1604.]\n\n[Footnote 171: and what noise soever ye hear, &c.-- \"Lastly, to knit up\nmy troubled oration, this is my friendly request, that you would\ngo to rest, and let nothing trouble you; also, if you chance heare\nany noyse or rumbling about the house, be not therewith afraid,\nfor there shall no evill happen unto you,\" &c.  THE HISTORY OF\nDOCTOR FAUSTUS, ubi supra.]\n\n[Footnote 172: O lente, &c.\n     \"At si, quem malles, Cephalum complexa teneres,\n     Clamares, LENTE CURRITE, NOCTIS EQUI.\"\n          Ovid,--AMOR. i. xiii. 39.]\n\n[Footnote 173: That, when you, &c.-- So all the old eds.; and it is certain\nthat awkward changes of person are sometimes found in passages\nof our early poets:  but qy.,\n\n    \"That, when THEY vomit forth into the air,\n     My limbs may issue from THEIR smoky mouths,\" &c.?]\n\n[Footnote 174:          and I be chang'd\n      Unto some brutish beast-- \"Now, thou Faustus, damned wretch,\nhow happy wert thou, if, as an unreasonable beast, thou mightest\ndye without [a-- soule! so shouldst thou not feele any more doubts,\"\n&c.  THE HISTORY OF DOCTOR FAUSTUS, Sig. K. ed. 1648.]\n\n[Footnote 175: Exeunt DEVILS with FAUSTUS-- In THE HISTORY OF DOCTOR FAUSTUS,\nhis \"miserable and lamentable end\" is described as follows:  it\ntook place, we are informed, at \"the village called Rimlich,\nhalfe a mile from Wittenberg.\"--\"The students and the other that\nwere there, when they had prayed for him, they wept, and so went\nforth; but Faustus tarried in the hall; and when the gentlemen\nwere laid in bed, none of them could sleepe, for that they att[e--nded\nto heare if they might be privy of his end.  It happened that\nbetweene twelve and one a clocke at midnight, there blew a mighty\nstorme of winde against the house, as though it would have blowne\nthe foundation thereof out of his place.  Hereupon the students\nbegan to feare and goe out of their beds, comforting one another;\nbut they would not stirre out of the chamber; and the host of\nthe house ran out of doores, thinking the house would fall.  The\nstudents lay neere unto the hall wherein Doctor Faustus lay, and\nthey heard a mighty noyse and hissing, as if the hall had beene\nfull of snakes and adders.  With that, the hall-doore flew open,\nwherein Doctor Faustus was, that he began to cry for helpe,\nsaying, Murther, murther! but it came forth with halfe a voyce,\nhollowly:  shortly after, they heard him no more.  But when it was\nday, the students, that had taken no rest that night, arose and\nwent into the hall, in the which they left Doctor Faustus; where\nnotwithstanding they found not Faustus, but all the hall lay\nsprinkled with blood, his braines cleaving to the wall, for the\ndevill had beaten him from one wall against another; in one corner\nlay his eyes, in another his teeth; a pittifull and fearefull\nsight to behold.  Then began the students to waile and weepe for\nhim, and sought for his body in many places.  Lastly, they came\ninto the yard, where they found his body lying on the horse-dung,\nmost monstrously torne and fearefull to behold, for his head and\nall his joynts were dashed in peeces.  The fore-named students and\nmasters that were at his death, have obtained so much, that they\nburied him in the village where he was so grievously tormented.\nAfter the which they returned to Wittenberg; and comming into the\nhouse of Faustus, they found the servant of Faustus very sad,\nunto whom they opened all the matter, who tooke it exceeding\nheavily.  There found they also this history of Doctor Faustus\nnoted and of him written, as is before declared, all save only\nhis end, the which was after by the students thereto annexed;\nfurther, what his servant had noted thereof, was made in another\nbooke.  And you have heard that he held by him in his life the\nspirit of faire Helena, the which had by him one sonne, the which\nhe named Justus Faustus:  even the same day of his death they\nvanished away, both mother and sonne.  The house before was so\ndarke that scarce any body could abide therein.  The same night\nDoctor Faustus appeared unto his servant lively, and shewed unto\nhim many secret things, the which he had done and hidden in his\nlifetime.  Likewise there were certaine which saw Doctor Faustus\nlooke out of the window by night, as they passed by the house.\"\nSig. K 3, ed. 1648.]\n\n\n\nOriginal Comments on the preparation of the E-Text:\n\nSQUARE BRACKETS:\n\nThe square brackets, i.e. [ ] are copied from the printed book,\nwithout change.  The open [Exit brackets use in the book have\nbeen closed [by mh].\n\nFor this E-Text version of the book, the footnotes have been\nconsolidated at the end of the play.\n\nNumbering of the footnotes has been changed, and each footnote\nis given a unique identity in the form [XXX].\n\nCHANGES TO THE TEXT:\n\nCharacter names were expanded.  For Example, SECOND SCHOLAR was\nSEC. SCHOL.", "title": "The Tragical History of Doctor Faustus"}