{"summary": "\nThe play opens in the morning room of the Windermeres' residence in London. It is tea time and Lady Windermere—who is preparing for her coming of age birthday ball that evening—has a visit from a friend, Lord Darlington. She shows off her new fan: a present from her husband. She explains to Lord Darlington that she is upset over the compliments he continues to pay to her, revealing that she is a Puritan and has very particular views about what is acceptable in society.\nThe Duchess of Berwick calls and Lord Darlington leaves shortly thereafter. The Duchess informs Lady Windermere that her husband may be betraying her marriage by making repeated visits to another woman, a Mrs Erlynne, and possibly giving her large sums of money. These rumours have been gossip among London society for quite a while, though seemingly this is the first Lady Windermere has heard about it.\nFollowing the departure of the Duchess, Lady Windermere decides to check her husband's bank book. She finds the book in a desk and sees that nothing appears amiss, though on returning she discovers a second bank book: one with a lock. After prying the lock open, she finds it lists large sums of money given to Mrs Erlynne.\nAt this point, Lord Windermere enters and she confronts him. Though he cannot deny that he has had dealings with Mrs Erlynne, he states that he is not betraying Lady Windermere. He requests that she send Mrs Erlynne an invitation to her birthday ball that evening to help her back into society. When Lady Windermere refuses, he writes out an invitation himself. Lady Windermere makes clear her intention to cause a scene if Mrs Erlynne appears, to which Lord Windermere responds that it would be in her best interest not to do so.\nLady Windermere leaves in disgust to prepare for the party, and Lord Windermere reveals in soliloquy that he is protecting Mrs Erlynne's true identity to save his wife extreme humiliation.\n\nWhat shall I do? I dare not tell her who this woman really is. The shame would kill her.\n\nAct II opens in the Windermeres' drawing room during the birthday ball that evening. Various guests enter, and make small-talk. Lord Windermere enters and asks Lady Windermere to speak with him, but she brushes him off.\nA friend of Lord Windermere's, Lord Augustus Lorton (\"Tuppy\"), pulls him aside to inquire about Mrs Erlynne, with whom he is enamoured. Lord Windermere reveals that there is nothing untoward in his relationship with Mrs Erlynne, and that she will be attending the ball, which comes as a great relief to Lord Augustus as he was worried about her social standing.\nAfter an unsuccessful attempt to make peace with his wife, Lord Windermere summons the courage to tell the truth to her, but at that moment Mrs Erlynne arrives at the party, where she is greeted coldly by Lady Windermere, spoiling his plan.\nAlone, Lady Windermere and Lord Darlington discuss Mrs Erlynne's attendance. Lady Windermere is enraged and confused and asks Lord Darlington to be her friend. Instead of friendship, Lord Darlington takes advantage of Lady Windermere's tragic state and professes his love to her, offering her his life, and inviting her to risk short-term social humiliation for a new life with him. Lord Darlington sets her an ultimatum to try to convince her to take action immediately, while still in a state of shock. Lady Windermere is shocked by the revelation, and finds she does not have the courage to take the offer. Heartbroken, Lord Darlington announces that he will be leaving the country the next day and that they will never meet again, and leaves.\nThe guests begin to leave, and say their goodnights to Lady Windermere—some remarking positively about Mrs Erlynne. On the other side of the room Mrs Erlynne is discussing her plans with Lord Windermere; she intends to marry Lord Augustus and will require some money from Lord Windermere.\nLater, Lady Windermere, in spite of her earlier reluctance, decides to leave the house at once for Lord Darlington, and leaves a note to that effect for Lord Windermere. Mrs Erlynne discovers the note and that Lady Windermere has gone, and is curiously worried by this. While reading the note, a brief monologue reveals that she is in fact Lady Windermere's mother and made a similar mistake herself twenty years previously. She takes the letter and exits to locate Lady Windermere.\n\nHow can I save her? How can I save my child? A moment may ruin a life. Who knows that better than I?\n\nLady Windermere is alone in Lord Darlington's rooms unsure if she has made the right decision. Eventually, she resolves to return to her husband, but then Mrs Erlynne appears. Despite Mrs Erlynne's honest attempts to persuade her to return home to her husband, Lady Windermere is convinced her appearance is part of some plot conceived by her and Lord Windermere. Mrs Erlynne finally breaks Lady Windermere's resistance by imploring her to return for the sake of her young child, but as they begin to exit they hear Lord Darlington entering with friends. The two women hide.\nThe men – who include Lord Windermere and Lord Augustus – have been evicted from their gentlemen's club at closing time and talk about women: mainly Mrs Erlynne. One of them takes notice of a fan lying on a table (Lady Windermere's) and presumes that Lord Darlington presently has a woman visiting. As Lord Windermere rises to leave, the fan is pointed out to him, which he instantly recognises as his wife's. He demands to know if Lord Darlington has her hidden somewhere. Lord Darlington refuses to co-operate, believing that Lady Windermere has come to him. Just as Lord Windermere is about to discover Lady Windermere's hiding place, Mrs Erlynne reveals herself instead, shocking all the men and allowing Lady Windermere to slip away unnoticed.\n\nI am afraid I took your wife's fan in mistake for my own, when I was leaving your house to-night. I am so sorry.\n\nThe next day, Lady Windermere is lying on the couch of the morning room anxious about whether to tell her husband what actually happened, or whether Mrs Erlynne will have already betrayed her secret. Her husband enters. He is sympathetic towards her and they discuss the possibility of taking a holiday to forget the recent incident. Lady Windermere apologises for her previous suspicion of her husband and behaviour at the party, and Lord Windermere makes clear his new contempt for Mrs Erlynne – warning his wife to stay away from her.\nMrs Erlynne's arrival is announced along with the return of the fan, and despite her husband's protestations, Lady Windermere insists on seeing her. Mrs Erlynne enters and states that she shall be going abroad, but asks that Lady Windermere give her a photograph of herself and her son.\nWhilst Lady Windermere leaves the room to find one, the story is revealed: Mrs Erlynne left her husband for a lover shortly after Lady Windermere's birth. When her new lover abandoned her, Mrs Erlynne was left alone and in disrepute. More recently, using the assumed name of Mrs Erlynne, she has begun blackmailing Lord Windermere to regain her lifestyle and status, by threatening to reveal her true identity as Lady Windermere's shameful mother — not dead, as Lady Windermere believes. Her son-in-law, Lord Windermere laments not having told his wife the whole story at once and resolves to tell her the truth now. Mrs Erlynne forbids him to do so, threatening to spread shame far and wide if he does.\nLady Windermere returns with the photograph which she presents to Mrs Erlynne, and requests that Lord Windermere check for the return of Mrs Erlynne's coach. Now that they are alone, and being owed a favour, Mrs Erlynne demands that Lady Windermere not reveal the truth about the events of the previous night to Lord Windermere, and Lady Windermere promises to keep the secret.\nAfter Lord Windermere's return, Lord Augustus enters. He is shocked to see Mrs Erlynne after the events of the night before, but she requests his company as she heads to her carriage, and he soon returns to the Windermeres with news that she has satisfactorily explained the events of the evening, and that they are to marry and live out of England.\n\n[Taking Lord Augustus' hand.] Ah, you're marrying a very good woman!\n\nTheir marriage is restored, but both Lord and Lady Windermere keep their secrets.\n\n", "full_text": "Transcribed from the 1917 Methuen & Co. Ltd edition by David Price, email\nccx074@pglaf.org\n\n\n\n\n\n                          LADY WINDERMERE’S FAN\n\n\n                                  A PLAY\n                            ABOUT A GOOD WOMAN\n\n                                    BY\n\n                               OSCAR WILDE\n\n                                * * * * *\n\n                            METHUEN & CO. LTD.\n                           36 ESSEX STREET W.C.\n                                  LONDON\n\n                           _Sixteenth Edition_\n\n_First Published_                                               _1893_\n_First Issued by Methuen & Co. Ltd._ (_Limited Editions on      _1908_\nHand-made Paper and Japanese Vellum_) _February_\n_Third Edition_ (_F’cap_ 8_vo_, 5_s._ _net_) _September_        _1909_\n_Fourth Edition_ (5_s._ _net_) _June_                           _1910_\n_Fifth Edition_ (_F’cap_ 8_vo_, 1_s._ _net_) _November 3rd_     _1911_\n_Sixth Edition_ (1_s._ _net_) _November_                        _1911_\n_Eighth Edition_ (1_s._ _net_) _1912_, _Ninth and Tenth\nEditions_ (1_s._ _net_) _1913_, _Eleventh Edition_ (1_s._\n_net_) _1914_, _Twelfth Edition_ (1_s._ _net_) _1915_,\n_Thirteenth Edition_ (1_s._ _net_) _1916_, _Fourteenth and\nFifteenth Edition_ (1_s._ _net_) _1917_\n_Sixteenth Edition_ (5_s._ _net_)                               _1917_\n\n_The literary and dramatic rights of_ “_Lady Windermere’s Fan_” _belong\nto Sir George Alexander_, _by arrangement with whom this play is included\nin this edition_.  _The acting version_ (_Samuel French_) _does not\ncontain the complete text_.\n\n                                * * * * *\n\n                                    TO\n                             THE DEAR MEMORY\n                                    OF\n                          ROBERT EARL OF LYTTON\n                               IN AFFECTION\n                                   AND\n                                ADMIRATION\n\n                                * * * * *\n\n\n\n\nTHE PERSONS OF THE PLAY\n\n\nLord Windermere\n\nLord Darlington\n\nLord Augustus Lorton\n\nMr. Dumby\n\nMr. Cecil Graham\n\nMr. Hopper\n\nParker, Butler\n\n                                * * * * *\n\nLady Windermere\n\nThe Duchess of Berwick\n\nLady Agatha Carlisle\n\nLady Plymdale\n\nLady Stutfield\n\nLady Jedburgh\n\nMrs. Cowper-Cowper\n\nMrs. Erlynne\n\nRosalie, Maid\n\n\n\n\nTHE SCENES OF THE PLAY\n\nACT I.        _Morning-room in Lord Windermere’s\n              house_.\nACT II.       _Drawing-room in Lord Windermere’s\n              house_.\nACT III.      _Lord Darlington’s rooms_.\nACT IV.       _Same as Act I._\nTIME:         _The Present_.\nPLACE:        _London_.\n\n_The action of the play takes place within twenty-four hours_, _beginning\non a Tuesday afternoon at five o’clock_, _and ending the next day at_\n1.30 _p.m._\n\n\n\n\nLONDON: ST. JAMES’S THEATRE\n\n\n               _Lessee and Manager_: _Mr. George Alexander_\n                         _February_ 22_nd_, 1892.\n\nLORD WINDERMERE             _Mr. George Alexander_.\nLORD DARLINGTON             _Mr. Nutcombe Gould_.\nLORD AUGUSTUS LORTON        _Mr. H. H. Vincent_.\nMR. CECIL GRAHAM            _Mr. Ben Webster_.\nMR. DUMBY                   _Mr. Vane-Tempest_.\nMR. HOPPER                  _Mr. Alfred Holles_.\nPARKER (_Butler_)           _Mr. V. Sansbury_.\nLADY WINDERMERE             _Miss Lily Hanbury_.\nTHE DUCHESS OF BERWICK      _Miss Fanny Coleman_.\nLADY AGATHA CARLISLE        _Miss Laura Graves_.\nLADY PLYMDALE               _Miss Granville_.\nLADY JEDBURGH               _Miss B. Page_.\nLADY STUTFIELD              _Miss Madge Girdlestone_.\nMRS. COWPER-COWPER          _Miss A. de Winton_.\nMRS. ERLYNNE                _Miss Marion Terry_.\nROSALIE (_Maid_)            _Miss Winifred Dolan_.\n\n\n\n\nFIRST ACT\n\n\n                                  SCENE\n\n_Morning-room of Lord Windermere’s house in Carlton House Terrace_.\n_Doors C. and R.  Bureau with books and papers R._  _Sofa with small\ntea-table L._  _Window opening on to terrace L._  _Table R._\n\n[LADY WINDERMERE _is at table R._, _arranging roses in a blue bowl_.]\n\n[_Enter_ PARKER.]\n\nPARKER.  Is your ladyship at home this afternoon?\n\nLADY WINDERMERE.  Yes—who has called?\n\nPARKER.  Lord Darlington, my lady.\n\nLADY WINDERMERE.  [_Hesitates for a moment_.]  Show him up—and I’m at\nhome to any one who calls.\n\nPARKER.  Yes, my lady.\n\n                                                               [_Exit C._]\n\nLADY WINDERMERE.  It’s best for me to see him before to-night.  I’m glad\nhe’s come.\n\n[_Enter_ PARKER _C._]\n\nPARKER.  Lord Darlington,\n\n[_Enter_ LORD DARLINGTON _C._]\n\n                                                          [_Exit_ PARKER.]\n\nLORD DARLINGTON.  How do you do, Lady Windermere?\n\nLADY WINDERMERE.  How do you do, Lord Darlington?  No, I can’t shake\nhands with you.  My hands are all wet with these roses.  Aren’t they\nlovely?  They came up from Selby this morning.\n\nLORD DARLINGTON.  They are quite perfect.  [_Sees a fan lying on the\ntable_.]  And what a wonderful fan!  May I look at it?\n\nLADY WINDERMERE.  Do.  Pretty, isn’t it!  It’s got my name on it, and\neverything.  I have only just seen it myself.  It’s my husband’s birthday\npresent to me.  You know to-day is my birthday?\n\nLORD DARLINGTON.  No?  Is it really?\n\nLADY WINDERMERE.  Yes, I’m of age to-day.  Quite an important day in my\nlife, isn’t it?  That is why I am giving this party to-night.  Do sit\ndown.  [_Still arranging flowers_.]\n\nLORD DARLINGTON.  [_Sitting down_.]  I wish I had known it was your\nbirthday, Lady Windermere.  I would have covered the whole street in\nfront of your house with flowers for you to walk on.  They are made for\nyou.\n\n                                                        [_A short pause_.]\n\nLADY WINDERMERE.  Lord Darlington, you annoyed me last night at the\nForeign Office.  I am afraid you are going to annoy me again.\n\nLORD DARLINGTON.  I, Lady Windermere?\n\n[_Enter_ PARKER _and_ FOOTMAN _C._, _with tray and tea things_.]\n\nLADY WINDERMERE.  Put it there, Parker.  That will do.  [_Wipes her hands\nwith her pocket-handkerchief_, _goes to tea-table_, _and sits down_.]\nWon’t you come over, Lord Darlington?\n\n                                                      [_Exit_ PARKER _C._]\n\nLORD DARLINGTON.  [_Takes chair and goes across L.C._]  I am quite\nmiserable, Lady Windermere.  You must tell me what I did.  [_Sits down at\ntable L._]\n\nLADY WINDERMERE.  Well, you kept paying me elaborate compliments the\nwhole evening.\n\nLORD DARLINGTON.  [_Smiling_.]  Ah, nowadays we are all of us so hard up,\nthat the only pleasant things to pay _are_ compliments.  They’re the only\nthings we _can_ pay.\n\nLADY WINDERMERE.  [_Shaking her head_.]  No, I am talking very seriously.\nYou mustn’t laugh, I am quite serious.  I don’t like compliments, and I\ndon’t see why a man should think he is pleasing a woman enormously when\nhe says to her a whole heap of things that he doesn’t mean.\n\nLORD DARLINGTON.  Ah, but I did mean them.  [_Takes tea which she offers\nhim_.]\n\nLADY WINDERMERE.  [_Gravely_.]  I hope not.  I should be sorry to have to\nquarrel with you, Lord Darlington.  I like you very much, you know that.\nBut I shouldn’t like you at all if I thought you were what most other men\nare.  Believe me, you are better than most other men, and I sometimes\nthink you pretend to be worse.\n\nLORD DARLINGTON.  We all have our little vanities, Lady Windermere.\n\nLADY WINDERMERE.  Why do you make that your special one?  [_Still seated\nat table L._]\n\nLORD DARLINGTON.  [_Still seated L.C._]  Oh, nowadays so many conceited\npeople go about Society pretending to be good, that I think it shows\nrather a sweet and modest disposition to pretend to be bad.  Besides,\nthere is this to be said.  If you pretend to be good, the world takes you\nvery seriously.  If you pretend to be bad, it doesn’t.  Such is the\nastounding stupidity of optimism.\n\nLADY WINDERMERE.  Don’t you _want_ the world to take you seriously then,\nLord Darlington?\n\nLORD DARLINGTON.  No, not the world.  Who are the people the world takes\nseriously?  All the dull people one can think of, from the Bishops down\nto the bores.  I should like _you_ to take me very seriously, Lady\nWindermere, _you_ more than any one else in life.\n\nLADY WINDERMERE.  Why—why me?\n\nLORD DARLINGTON.  [_After a slight hesitation_.]  Because I think we\nmight be great friends.  Let us be great friends.  You may want a friend\nsome day.\n\nLADY WINDERMERE.  Why do you say that?\n\nLORD DARLINGTON.  Oh!—we all want friends at times.\n\nLADY WINDERMERE.  I think we’re very good friends already, Lord\nDarlington.  We can always remain so as long as you don’t—\n\nLORD DARLINGTON.  Don’t what?\n\nLADY WINDERMERE.  Don’t spoil it by saying extravagant silly things to\nme.  You think I am a Puritan, I suppose?  Well, I have something of the\nPuritan in me.  I was brought up like that.  I am glad of it.  My mother\ndied when I was a mere child.  I lived always with Lady Julia, my\nfather’s elder sister, you know.  She was stern to me, but she taught me\nwhat the world is forgetting, the difference that there is between what\nis right and what is wrong.  _She_ allowed of no compromise.  _I_ allow\nof none.\n\nLORD DARLINGTON.  My dear Lady Windermere!\n\nLADY WINDERMERE.  [_Leaning back on the sofa_.]  You look on me as being\nbehind the age.—Well, I am!  I should be sorry to be on the same level as\nan age like this.\n\nLORD DARLINGTON.  You think the age very bad?\n\nLADY WINDERMERE.  Yes.  Nowadays people seem to look on life as a\nspeculation.  It is not a speculation.  It is a sacrament.  Its ideal is\nLove.  Its purification is sacrifice.\n\nLORD DARLINGTON.  [_Smiling_.]  Oh, anything is better than being\nsacrificed!\n\nLADY WINDERMERE.  [_Leaning forward_.]  Don’t say that.\n\nLORD DARLINGTON.  I do say it.  I feel it—I know it.\n\n[_Enter_ PARKER _C._]\n\nPARKER.  The men want to know if they are to put the carpets on the\nterrace for to-night, my lady?\n\nLADY WINDERMERE.  You don’t think it will rain, Lord Darlington, do you?\n\nLORD DARLINGTON.  I won’t hear of its raining on your birthday!\n\nLADY WINDERMERE.  Tell them to do it at once, Parker.\n\n                                                      [_Exit_ PARKER _C._]\n\nLORD DARLINGTON.  [_Still seated_.]  Do you think then—of course I am\nonly putting an imaginary instance—do you think that in the case of a\nyoung married couple, say about two years married, if the husband\nsuddenly becomes the intimate friend of a woman of—well, more than\ndoubtful character—is always calling upon her, lunching with her, and\nprobably paying her bills—do you think that the wife should not console\nherself?\n\nLADY WINDERMERE.  [_Frowning_.]  Console herself?\n\nLORD DARLINGTON.  Yes, I think she should—I think she has the right.\n\nLADY WINDERMERE.  Because the husband is vile—should the wife be vile\nalso?\n\nLORD DARLINGTON.  Vileness is a terrible word, Lady Windermere.\n\nLADY WINDERMERE.  It is a terrible thing, Lord Darlington.\n\nLORD DARLINGTON.  Do you know I am afraid that good people do a great\ndeal of harm in this world.  Certainly the greatest harm they do is that\nthey make badness of such extraordinary importance.  It is absurd to\ndivide people into good and bad.  People are either charming or tedious.\nI take the side of the charming, and you, Lady Windermere, can’t help\nbelonging to them.\n\nLADY WINDERMERE.  Now, Lord Darlington.  [_Rising and crossing R._,\n_front of him_.]  Don’t stir, I am merely going to finish my flowers.\n[_Goes to table R.C._]\n\nLORD DARLINGTON.  [_Rising and moving chair_.]  And I must say I think\nyou are very hard on modern life, Lady Windermere.  Of course there is\nmuch against it, I admit.  Most women, for instance, nowadays, are rather\nmercenary.\n\nLADY WINDERMERE.  Don’t talk about such people.\n\nLORD DARLINGTON.  Well then, setting aside mercenary people, who, of\ncourse, are dreadful, do you think seriously that women who have\ncommitted what the world calls a fault should never be forgiven?\n\nLADY WINDERMERE.  [_Standing at table_.]  I think they should never be\nforgiven.\n\nLORD DARLINGTON.  And men?  Do you think that there should be the same\nlaws for men as there are for women?\n\nLADY WINDERMERE.  Certainly!\n\nLORD DARLINGTON.  I think life too complex a thing to be settled by these\nhard and fast rules.\n\nLADY WINDERMERE.  If we had ‘these hard and fast rules,’ we should find\nlife much more simple.\n\nLORD DARLINGTON.  You allow of no exceptions?\n\nLADY WINDERMERE.  None!\n\nLORD DARLINGTON.  Ah, what a fascinating Puritan you are, Lady\nWindermere!\n\nLADY WINDERMERE.  The adjective was unnecessary, Lord Darlington.\n\nLORD DARLINGTON.  I couldn’t help it.  I can resist everything except\ntemptation.\n\nLADY WINDERMERE.  You have the modern affectation of weakness.\n\nLORD DARLINGTON.  [_Looking at her_.]  It’s only an affectation, Lady\nWindermere.\n\n[_Enter_ PARKER _C._]\n\nPARKER.  The Duchess of Berwick and Lady Agatha Carlisle.\n\n[_Enter the_ DUCHESS OF BERWICK and LADY AGATHA CARLISLE _C._]\n\n                                                      [_Exit_ PARKER _C._]\n\nDUCHESS OF BERWICK.  [_Coming down C._, _and shaking hands_.]  Dear\nMargaret, I am so pleased to see you.  You remember Agatha, don’t you?\n[_Crossing L.C._]  How do you do, Lord Darlington?  I won’t let you know\nmy daughter, you are far too wicked.\n\nLORD DARLINGTON.  Don’t say that, Duchess.  As a wicked man I am a\ncomplete failure.  Why, there are lots of people who say I have never\nreally done anything wrong in the whole course of my life.  Of course\nthey only say it behind my back.\n\nDUCHESS OF BERWICK.  Isn’t he dreadful?  Agatha, this is Lord Darlington.\nMind you don’t believe a word he says.  [LORD DARLINGTON _crosses R.C._]\nNo, no tea, thank you, dear.  [_Crosses and sits on sofa_.]  We have just\nhad tea at Lady Markby’s.  Such bad tea, too.  It was quite undrinkable.\nI wasn’t at all surprised.  Her own son-in-law supplies it.  Agatha is\nlooking forward so much to your ball to-night, dear Margaret.\n\nLADY WINDERMERE.  [_Seated L.C._]  Oh, you mustn’t think it is going to\nbe a ball, Duchess.  It is only a dance in honour of my birthday.  A\nsmall and early.\n\nLORD DARLINGTON.  [_Standing L.C._]  Very small, very early, and very\nselect, Duchess.\n\nDUCHESS OF BERWICK.  [_On sofa L._]  Of course it’s going to be select.\nBut we know _that_, dear Margaret, about _your_ house.  It is really one\nof the few houses in London where I can take Agatha, and where I feel\nperfectly secure about dear Berwick.  I don’t know what society is coming\nto.  The most dreadful people seem to go everywhere.  They certainly come\nto my parties—the men get quite furious if one doesn’t ask them.  Really,\nsome one should make a stand against it.\n\nLADY WINDERMERE.  _I_ will, Duchess.  I will have no one in my house\nabout whom there is any scandal.\n\nLORD DARLINGTON.  [_R.C._]  Oh, don’t say that, Lady Windermere.  I\nshould never be admitted!  [_Sitting_.]\n\nDUCHESS OF BERWICK.  Oh, men don’t matter.  With women it is different.\nWe’re good.  Some of us are, at least.  But we are positively getting\nelbowed into the corner.  Our husbands would really forget our existence\nif we didn’t nag at them from time to time, just to remind them that we\nhave a perfect legal right to do so.\n\nLORD DARLINGTON.  It’s a curious thing, Duchess, about the game of\nmarriage—a game, by the way, that is going out of fashion—the wives hold\nall the honours, and invariably lose the odd trick.\n\nDUCHESS OF BERWICK.   The odd trick?  Is that the husband, Lord\nDarlington?\n\nLORD DARLINGTON.  It would be rather a good name for the modern husband.\n\nDUCHESS OF BERWICK.  Dear Lord Darlington, how thoroughly depraved you\nare!\n\nLADY WINDERMERE.  Lord Darlington is trivial.\n\nLORD DARLINGTON.  Ah, don’t say that, Lady Windermere.\n\nLADY WINDERMERE.  Why do you _talk_ so trivially about life, then?\n\nLORD DARLINGTON.  Because I think that life is far too important a thing\never to talk seriously about it.  [_Moves up C._]\n\nDUCHESS OF BERWICK.  What does he mean?  Do, as a concession to my poor\nwits, Lord Darlington, just explain to me what you really mean.\n\nLORD DARLINGTON.  [_Coming down back of table_.]  I think I had better\nnot, Duchess.  Nowadays to be intelligible is to be found out.  Good-bye!\n[_Shakes hands with_ DUCHESS.]  And now—[_goes up stage_] Lady\nWindermere, good-bye.  I may come to-night, mayn’t I?  Do let me come.\n\nLADY WINDERMERE.  [_Standing up stage with_ LORD DARLINGTON.]  Yes,\ncertainly.  But you are not to say foolish, insincere things to people.\n\nLORD DARLINGTON.  [_Smiling_.]  Ah! you are beginning to reform me.  It\nis a dangerous thing to reform any one, Lady Windermere.  [_Bows_, _and\nexit C._]\n\nDUCHESS OF BERWICK.  [_Who has risen_, _goes C._]  What a charming,\nwicked creature!  I like him so much.  I’m quite delighted he’s gone!\nHow sweet you’re looking!  Where _do_ you get your gowns?  And now I must\ntell you how sorry I am for you, dear Margaret.  [_Crosses to sofa and\nsits with_ LADY WINDERMERE.]  Agatha, darling!\n\nLADY AGATHA.  Yes, mamma.  [_Rises_.]\n\nDUCHESS OF BERWICK.  Will you go and look over the photograph album that\nI see there?\n\nLADY AGATHA.  Yes, mamma.  [_Goes to table up L._]\n\nDUCHESS OF BERWICK.  Dear girl!  She is so fond of photographs of\nSwitzerland.  Such a pure taste, I think.  But I really am so sorry for\nyou, Margaret.\n\nLADY WINDERMERE.  [_Smiling_.]  Why, Duchess?\n\nDUCHESS OF BERWICK.  Oh, on account of that horrid woman.  She dresses so\nwell, too, which makes it much worse, sets such a dreadful example.\nAugustus—you know my disreputable brother—such a trial to us all—well,\nAugustus is completely infatuated about her.  It is quite scandalous, for\nshe is absolutely inadmissible into society.  Many a woman has a past,\nbut I am told that she has at least a dozen, and that they all fit.\n\nLADY WINDERMERE.  Whom are you talking about, Duchess?\n\nDUCHESS OF BERWICK.  About Mrs. Erlynne.\n\nLADY WINDERMERE.  Mrs. Erlynne?  I never heard of her, Duchess.  And what\n_has_ she to do with me?\n\nDUCHESS OF BERWICK.  My poor child!  Agatha, darling!\n\nLADY AGATHA.  Yes, mamma.\n\nDUCHESS OF BERWICK.  Will you go out on the terrace and look at the\nsunset?\n\nLADY AGATHA.  Yes, mamma.\n\n                                             [_Exit through window_, _L._]\n\nDUCHESS OF BERWICK.  Sweet girl!  So devoted to sunsets!  Shows such\nrefinement of feeling, does it not?  After all, there is nothing like\nNature, is there?\n\nLADY WINDERMERE.  But what is it, Duchess?  Why do you talk to me about\nthis person?\n\nDUCHESS OF BERWICK.  Don’t you really know?  I assure you we’re all so\ndistressed about it.  Only last night at dear Lady Jansen’s every one was\nsaying how extraordinary it was that, of all men in London, Windermere\nshould behave in such a way.\n\nLADY WINDERMERE.  My husband—what has _he_ got to do with any woman of\nthat kind?\n\nDUCHESS OF BERWICK.  Ah, what indeed, dear?  That is the point.  He goes\nto see her continually, and stops for hours at a time, and while he is\nthere she is not at home to any one.  Not that many ladies call on her,\ndear, but she has a great many disreputable men friends—my own brother\nparticularly, as I told you—and that is what makes it so dreadful about\nWindermere.  We looked upon _him_ as being such a model husband, but I am\nafraid there is no doubt about it.  My dear nieces—you know the Saville\ngirls, don’t you?—such nice domestic creatures—plain, dreadfully plain,\nbut so good—well, they’re always at the window doing fancy work, and\nmaking ugly things for the poor, which I think so useful of them in these\ndreadful socialistic days, and this terrible woman has taken a house in\nCurzon Street, right opposite them—such a respectable street, too!  I\ndon’t know what we’re coming to!  And they tell me that Windermere goes\nthere four and five times a week—they _see_ him.  They can’t help it—and\nalthough they never talk scandal, they—well, of course—they remark on it\nto every one.  And the worst of it all is that I have been told that this\nwoman has got a great deal of money out of somebody, for it seems that\nshe came to London six months ago without anything at all to speak of,\nand now she has this charming house in Mayfair, drives her ponies in the\nPark every afternoon and all—well, all—since she has known poor dear\nWindermere.\n\nLADY WINDERMERE.  Oh, I can’t believe it!\n\nDUCHESS OF BERWICK.  But it’s quite true, my dear.  The whole of London\nknows it.  That is why I felt it was better to come and talk to you, and\nadvise you to take Windermere away at once to Homburg or to Aix, where\nhe’ll have something to amuse him, and where you can watch him all day\nlong.  I assure you, my dear, that on several occasions after I was first\nmarried, I had to pretend to be very ill, and was obliged to drink the\nmost unpleasant mineral waters, merely to get Berwick out of town.  He\nwas so extremely susceptible.  Though I am bound to say he never gave\naway any large sums of money to anybody.  He is far too high-principled\nfor that!\n\nLADY WINDERMERE.  [_Interrupting_.]  Duchess, Duchess, it’s impossible!\n[_Rising and crossing stage to C._]  We are only married two years.  Our\nchild is but six months old.  [_Sits in chair R. of L. table_.]\n\nDUCHESS OF BERWICK.  Ah, the dear pretty baby!  How is the little\ndarling?  Is it a boy or a girl?  I hope a girl—Ah, no, I remember it’s a\nboy!  I’m so sorry.  Boys are so wicked.  My boy is excessively immoral.\nYou wouldn’t believe at what hours he comes home.  And he’s only left\nOxford a few months—I really don’t know what they teach them there.\n\nLADY WINDERMERE.  Are _all_ men bad?\n\nDUCHESS OF BERWICK.  Oh, all of them, my dear, all of them, without any\nexception.  And they never grow any better.  Men become old, but they\nnever become good.\n\nLADY WINDERMERE.  Windermere and I married for love.\n\nDUCHESS OF BERWICK.  Yes, we begin like that.  It was only Berwick’s\nbrutal and incessant threats of suicide that made me accept him at all,\nand before the year was out, he was running after all kinds of\npetticoats, every colour, every shape, every material.  In fact, before\nthe honeymoon was over, I caught him winking at my maid, a most pretty,\nrespectable girl.  I dismissed her at once without a character.—No, I\nremember I passed her on to my sister; poor dear Sir George is so\nshort-sighted, I thought it wouldn’t matter.  But it did, though—it was\nmost unfortunate.  [_Rises_.]  And now, my dear child, I must go, as we\nare dining out.  And mind you don’t take this little aberration of\nWindermere’s too much to heart.  Just take him abroad, and he’ll come\nback to you all right.\n\nLADY WINDERMERE.  Come back to me?  [_C._]\n\nDUCHESS OF BERWICK.   [_L.C._]  Yes, dear, these wicked women get our\nhusbands away from us, but they always come back, slightly damaged, of\ncourse.  And don’t make scenes, men hate them!\n\nLADY WINDERMERE.  It is very kind of you, Duchess, to come and tell me\nall this.  But I can’t believe that my husband is untrue to me.\n\nDUCHESS OF BERWICK.  Pretty child!  I was like that once.  Now I know\nthat all men are monsters.  [LADY WINDERMERE _rings bell_.]  The only\nthing to do is to feed the wretches well.  A good cook does wonders, and\nthat I know you have.  My dear Margaret, you are not going to cry?\n\nLADY WINDERMERE.  You needn’t be afraid, Duchess, I never cry.\n\nDUCHESS OF BERWICK.  That’s quite right, dear.  Crying is the refuge of\nplain women but the ruin of pretty ones.  Agatha, darling!\n\nLADY AGATHA.  [_Entering L._]  Yes, mamma.  [_Stands back of table L.C._]\n\nDUCHESS OF BERWICK.  Come and bid good-bye to Lady Windermere, and thank\nher for your charming visit.  [_Coming down again_.]  And by the way, I\nmust thank you for sending a card to Mr. Hopper—he’s that rich young\nAustralian people are taking such notice of just at present.  His father\nmade a great fortune by selling some kind of food in circular tins—most\npalatable, I believe—I fancy it is the thing the servants always refuse\nto eat.  But the son is quite interesting.  I think he’s attracted by\ndear Agatha’s clever talk.  Of course, we should be very sorry to lose\nher, but I think that a mother who doesn’t part with a daughter every\nseason has no real affection.  We’re coming to-night, dear.  [PARKER\n_opens C. doors_.]  And remember my advice, take the poor fellow out of\ntown at once, it is the only thing to do.  Good-bye, once more; come,\nAgatha.\n\n                                 [_Exeunt_ DUCHESS _and_ LADY AGATHA _C._]\n\nLADY WINDERMERE.  How horrible!  I understand now what Lord Darlington\nmeant by the imaginary instance of the couple not two years married.  Oh!\nit can’t be true—she spoke of enormous sums of money paid to this woman.\nI know where Arthur keeps his bank book—in one of the drawers of that\ndesk.  I might find out by that.  I _will_ find out.  [_Opens drawer_.]\nNo, it is some hideous mistake.  [_Rises and goes C._]  Some silly\nscandal!  He loves _me_!  He loves _me_!  But why should I not look?  I\nam his wife, I have a right to look!  [_Returns to bureau_, _takes out\nbook and examines it page by page_, _smiles and gives a sigh of relief_.]\nI knew it! there is not a word of truth in this stupid story.  [_Puts\nbook back in dranver_.  _As the does so_, _starts and takes out another\nbook_.]  A second book—private—locked!  [_Tries to open it_, _but fails_.\n_Sees paper knife on bureau_, _and with it cuts cover from book_.\n_Begins to start at the first page_.]  ‘Mrs. Erlynne—£600—Mrs.\nErlynne—£700—Mrs. Erlynne—£400.’  Oh! it is true!  It is true!  How\nhorrible!  [_Throws book on floor_.]\n\n                                            [_Enter_ LORD WINDERMERE _C._]\n\nLORD WINDERMERE.  Well, dear, has the fan been sent home yet?  [_Going\nR.C._  _Sees book_.]  Margaret, you have cut open my bank book.  You have\nno right to do such a thing!\n\nLADY WINDERMERE.  You think it wrong that you are found out, don’t you?\n\nLORD WINDERMERE.  I think it wrong that a wife should spy on her husband.\n\nLADY WINDERMERE.  I did not spy on you.  I never knew of this woman’s\nexistence till half an hour ago.  Some one who pitied me was kind enough\nto tell me what every one in London knows already—your daily visits to\nCurzon Street, your mad infatuation, the monstrous sums of money you\nsquander on this infamous woman!  [_Crossing L._]\n\nLORD WINDERMERE.  Margaret! don’t talk like that of Mrs. Erlynne, you\ndon’t know how unjust it is!\n\nLADY WINDERMERE.  [_Turning to him_.]  You are very jealous of Mrs.\nErlynne’s honour.  I wish you had been as jealous of mine.\n\nLORD WINDERMERE.  Your honour is untouched, Margaret.  You don’t think\nfor a moment that—[_Puts book back into desk_.]\n\nLADY WINDERMERE.  I think that you spend your money strangely.  That is\nall.  Oh, don’t imagine I mind about the money.  As far as I am\nconcerned, you may squander everything we have.  But what I _do_ mind is\nthat you who have loved me, you who have taught me to love you, should\npass from the love that is given to the love that is bought.  Oh, it’s\nhorrible!  [_Sits on sofa_.]  And it is I who feel degraded! _you_ don’t\nfeel anything.  I feel stained, utterly stained.  You can’t realise how\nhideous the last six months seems to me now—every kiss you have given me\nis tainted in my memory.\n\nLORD WINDERMERE.  [_Crossing to her_.]  Don’t say that, Margaret.  I\nnever loved any one in the whole world but you.\n\nLADY WINDERMERE.  [_Rises_.]  Who is this woman, then?  Why do you take a\nhouse for her?\n\nLORD WINDERMERE.  I did not take a house for her.\n\nLADY WINDERMERE.  You gave her the money to do it, which is the same\nthing.\n\nLORD WINDERMERE.  Margaret, as far as I have known Mrs. Erlynne—\n\nLADY WINDERMERE.  Is there a Mr. Erlynne—or is he a myth?\n\nLORD WINDERMERE.  Her husband died many years ago.  She is alone in the\nworld.\n\nLADY WINDERMERE.  No relations?  [_A pause_.]\n\nLORD WINDERMERE.  None.\n\nLADY WINDERMERE.  Rather curious, isn’t it?  [_L._]\n\nLORD WINDERMERE.  [_L.C._]  Margaret, I was saying to you—and I beg you\nto listen to me—that as far as I have known Mrs. Erlynne, she has\nconducted herself well.  If years ago—\n\nLADY WINDERMERE.  Oh!  [_Crossing R.C._]  I don’t want details about her\nlife!\n\nLORD WINDERMERE.  [_C._]  I am not going to give you any details about\nher life.  I tell you simply this—Mrs. Erlynne was once honoured, loved,\nrespected.  She was well born, she had position—she lost everything—threw\nit away, if you like.  That makes it all the more bitter.  Misfortunes\none can endure—they come from outside, they are accidents.  But to suffer\nfor one’s own faults—ah!—there is the sting of life.  It was twenty years\nago, too.  She was little more than a girl then.  She had been a wife for\neven less time than you have.\n\nLADY WINDERMERE.  I am not interested in her—and—you should not mention\nthis woman and me in the same breath.  It is an error of taste.\n[_Sitting R. at desk_.]\n\nLORD WINDERMERE.  Margaret, you could save this woman.  She wants to get\nback into society, and she wants you to help her.  [_Crossing to her_.]\n\nLADY WINDERMERE.  Me!\n\nLORD WINDERMERE.  Yes, you.\n\nLADY WINDERMERE.  How impertinent of her!  [_A pause_.]\n\nLORD WINDERMERE.  Margaret, I came to ask you a great favour, and I still\nask it of you, though you have discovered what I had intended you should\nnever have known that I have given Mrs. Erlynne a large sum of money.  I\nwant you to send her an invitation for our party to-night.  [_Standing L.\nof her_.]\n\nLADY WINDERMERE.  You are mad!  [_Rises_.]\n\nLORD WINDERMERE.  I entreat you.  People may chatter about her, do\nchatter about her, of course, but they don’t know anything definite\nagainst her.  She has been to several houses—not to houses where you\nwould go, I admit, but still to houses where women who are in what is\ncalled Society nowadays do go.  That does not content her.  She wants you\nto receive her once.\n\nLADY WINDERMERE.  As a triumph for her, I suppose?\n\nLORD WINDERMERE.  No; but because she knows that you are a good woman—and\nthat if she comes here once she will have a chance of a happier, a surer\nlife than she has had.  She will make no further effort to know you.\nWon’t you help a woman who is trying to get back?\n\nLADY WINDERMERE.  No!  If a woman really repents, she never wishes to\nreturn to the society that has made or seen her ruin.\n\nLORD WINDERMERE.  I beg of you.\n\nLADY WINDERMERE.  [_Crossing to door R._]  I am going to dress for\ndinner, and don’t mention the subject again this evening.  Arthur [_going\nto him C._], you fancy because I have no father or mother that I am alone\nin the world, and that you can treat me as you choose.  You are wrong, I\nhave friends, many friends.\n\nLORD WINDERMERE.  [_L.C._]  Margaret, you are talking foolishly,\nrecklessly.  I won’t argue with you, but I insist upon your asking Mrs.\nErlynne to-night.\n\nLADY WINDERMERE.  [_R.C._]  I shall do nothing of the kind.  [_Crossing\nL.C._]\n\nLORD WINDERMERE.  You refuse?  [_C._]\n\nLADY WINDERMERE.  Absolutely!\n\nLORD WINDERMERE.  Ah, Margaret, do this for my sake; it is her last\nchance.\n\nLADY WINDERMERE.  What has that to do with me?\n\nLORD WINDERMERE.  How hard good women are!\n\nLADY WINDERMERE.  How weak bad men are!\n\nLORD WINDERMERE.  Margaret, none of us men may be good enough for the\nwomen we marry—that is quite true—but you don’t imagine I would ever—oh,\nthe suggestion is monstrous!\n\nLADY WINDERMERE.  Why should _you_ be different from other men?  I am\ntold that there is hardly a husband in London who does not waste his life\nover _some_ shameful passion.\n\nLORD WINDERMERE.  I am not one of them.\n\nLADY WINDERMERE.  I am not sure of that!\n\nLORD WINDERMERE.  You are sure in your heart.  But don’t make chasm after\nchasm between us.  God knows the last few minutes have thrust us wide\nenough apart.  Sit down and write the card.\n\nLADY WINDERMERE.  Nothing in the whole world would induce me.\n\nLORD WINDERMERE.  [_Crossing to bureau_.]  Then I will!  [_Rings electric\nbell_, _sits and writes card_.]\n\nLADY WINDERMERE.  You are going to invite this woman?  [_Crossing to\nhim_.]\n\nLORD WINDERMERE.  Yes.  [_Pause_.  _Enter_ PARKER.]  Parker!\n\nPARKER.  Yes, my lord.  [_Comes down L.C._]\n\nLORD WINDERMERE.  Have this note sent to Mrs. Erlynne at No. 84A Curzon\nStreet.  [_Crossing to L.C. and giving note to_ PARKER.]  There is no\nanswer!\n\n                                                      [_Exit_ PARKER _C._]\n\nLADY WINDERMERE.  Arthur, if that woman comes here, I shall insult her.\n\nLORD WINDERMERE.  Margaret, don’t say that.\n\nLADY WINDERMERE.  I mean it.\n\nLORD WINDERMERE.  Child, if you did such a thing, there’s not a woman in\nLondon who wouldn’t pity you.\n\nLADY WINDERMERE.  There is not a _good_ woman in London who would not\napplaud me.  We have been too lax.  We must make an example.  I propose\nto begin to-night.  [_Picking up fan_.]  Yes, you gave me this fan\nto-day; it was your birthday present.  If that woman crosses my\nthreshold, I shall strike her across the face with it.\n\nLORD WINDERMERE.  Margaret, you couldn’t do such a thing.\n\nLADY WINDERMERE.  You don’t know me!  [_Moves R._]\n\n[_Enter_ PARKER.]\n\nParker!\n\nPARKER.  Yes, my lady.\n\nLADY WINDERMERE.  I shall dine in my own room.  I don’t want dinner, in\nfact.  See that everything is ready by half-past ten.  And, Parker, be\nsure you pronounce the names of the guests very distinctly to-night.\nSometimes you speak so fast that I miss them.  I am particularly anxious\nto hear the names quite clearly, so as to make no mistake.  You\nunderstand, Parker?\n\nPARKER.  Yes, my lady.\n\nLADY WINDERMERE.  That will do!\n\n                                                      [_Exit_ PARKER _C._]\n\n[_Speaking to_ LORD WINDERMERE.]  Arthur, if that woman comes here—I warn\nyou—\n\nLORD WINDERMERE.  Margaret, you’ll ruin us!\n\nLADY WINDERMERE.  Us!  From this moment my life is separate from yours.\nBut if you wish to avoid a public scandal, write at once to this woman,\nand tell her that I forbid her to come here!\n\nLORD WINDERMERE.  I will not—I cannot—she must come!\n\nLADY WINDERMERE.  Then I shall do exactly as I have said.  [_Goes R._]\nYou leave me no choice.\n\n                                                               [_Exit R._]\n\nLORD WINDERMERE.  [_Calling after her_.]  Margaret!  Margaret!  [_A\npause_.]  My God!  What shall I do?  I dare not tell her who this woman\nreally is.  The shame would kill her.  [_Sinks down into a chair and\nburies his face in his hands_.]\n\n                                * * * * *\n\n                                 ACT DROP\n\n\n\n\nSECOND ACT\n\n\n                                  SCENE\n\n_Drawing-room in Lord Windermere’s house_.  _Door R.U. opening into\nball-room_, _where band is playing_.  _Door L. through which guests are\nentering_.  _Door L.U. opens on to illuminated terrace_.  _Palms_,\n_flowers_, _and brilliant lights_.  _Room crowded with guests_.  _Lady\nWindermere is receiving them_.\n\nDUCHESS OF BERWICK.  [_Up C._]  So strange Lord Windermere isn’t here.\nMr. Hopper is very late, too.  You have kept those five dances for him,\nAgatha?  [_Comes down_.]\n\nLADY AGATHA.  Yes, mamma.\n\nDUCHESS OF BERWICK.  [_Sitting on sofa_.]  Just let me see your card.\nI’m so glad Lady Windermere has revived cards.—They’re a mother’s only\nsafeguard.  You dear simple little thing!  [_Scratches out two names_.]\nNo nice girl should ever waltz with such particularly younger sons!  It\nlooks so fast!  The last two dances you might pass on the terrace with\nMr. Hopper.\n\n[_Enter_ MR. DUMBY _and_ LADY PLYMDALE _from the ball-room_.]\n\nLADY AGATHA.  Yes, mamma.\n\nDUCHESS OF BERWICK.  [_Fanning herself_.]  The air is so pleasant there.\n\nPARKER.  Mrs. Cowper-Cowper.  Lady Stutfield.  Sir James Royston.  Mr.\nGuy Berkeley.\n\n[_These people enter as announced_.]\n\nDUMBY.  Good evening, Lady Stutfield.  I suppose this will be the last\nball of the season?\n\nLADY STUTFIELD.  I suppose so, Mr. Dumby.  It’s been a delightful season,\nhasn’t it?\n\nDUMBY.  Quite delightful!  Good evening, Duchess.  I suppose this will be\nthe last ball of the season?\n\nDUCHESS OF BERWICK.  I suppose so, Mr. Dumby.  It has been a very dull\nseason, hasn’t it?\n\nDUMBY.  Dreadfully dull!  Dreadfully dull!\n\nMR. COWPER-COWPER.  Good evening, Mr. Dumby.  I suppose this will be the\nlast ball of the season?\n\nDUMBY.  Oh, I think not.  There’ll probably be two more.  [_Wanders back\nto_ LADY PLYMDALE.]\n\nPARKER.  Mr. Rufford.  Lady Jedburgh and Miss Graham.  Mr. Hopper.\n\n[_These people enter as announced_.]\n\nHOPPER.  How do you do, Lady Windermere?  How do you do, Duchess?  [_Bows\nto_ LADY AGATHA.]\n\nDUCHESS OF BERWICK.  Dear Mr. Hopper, how nice of you to come so early.\nWe all know how you are run after in London.\n\nHOPPER.  Capital place, London!  They are not nearly so exclusive in\nLondon as they are in Sydney.\n\nDUCHESS OF BERWICK.  Ah! we know your value, Mr. Hopper.  We wish there\nwere more like you.  It would make life so much easier.  Do you know, Mr.\nHopper, dear Agatha and I are so much interested in Australia.  It must\nbe so pretty with all the dear little kangaroos flying about.  Agatha has\nfound it on the map.  What a curious shape it is!  Just like a large\npacking case.  However, it is a very young country, isn’t it?\n\nHOPPER.  Wasn’t it made at the same time as the others, Duchess?\n\nDUCHESS OF BERWICK.  How clever you are, Mr. Hopper.  You have a\ncleverness quite of your own.  Now I mustn’t keep you.\n\nHOPPER.  But I should like to dance with Lady Agatha, Duchess.\n\nDUCHESS OF BERWICK.  Well, I hope she has a dance left.  Have you a dance\nleft, Agatha?\n\nLADY AGATHA.  Yes, mamma.\n\nDUCHESS OF BERWICK.  The next one?\n\nLADY AGATHA.  Yes, mamma.\n\nHOPPER.  May I have the pleasure?  [LADY AGATHA _bows_.]\n\nDUCHESS OF BERWICK.  Mind you take great care of my little chatterbox,\nMr. Hopper.\n\n[LADY AGATHA _and_ MR. HOPPER _pass into ball-room_.]\n\n[_Enter_ LORD WINDERMERE.]\n\nLORD WINDERMERE.  Margaret, I want to speak to you.\n\nLADY WINDERMERE.  In a moment.  [_The music drops_.]\n\nPARKER.  Lord Augustus Lorton.\n\n[_Enter_ LORD AUGUSTUS.]\n\nLORD AUGUSTUS.  Good evening, Lady Windermere.\n\nDUCHESS OF BERWICK.  Sir James, will you take me into the ball-room?\nAugustus has been dining with us to-night.  I really have had quite\nenough of dear Augustus for the moment.\n\n[SIR JAMES ROYSTON _gives the_ DUCHESS _his aim and escorts her into the\nball-room_.]\n\nPARKER.  Mr. and Mrs. Arthur Bowden.  Lord and Lady Paisley.  Lord\nDarlington.\n\n[_These people enter as announced_.]\n\nLORD AUGUSTUS.  [_Coming up to_ LORD WINDERMERE.]  Want to speak to you\nparticularly, dear boy.  I’m worn to a shadow.  Know I don’t look it.\nNone of us men do look what we really are.  Demmed good thing, too.  What\nI want to know is this.  Who is she?  Where does she come from?  Why\nhasn’t she got any demmed relations?  Demmed nuisance, relations!  But\nthey make one so demmed respectable.\n\nLORD WINDERMERE.  You are talking of Mrs. Erlynne, I suppose?  I only met\nher six months ago.  Till then, I never knew of her existence.\n\nLORD AUGUSTUS.  You have seen a good deal of her since then.\n\nLORD WINDERMERE.  [_Coldly_.]  Yes, I have seen a good deal of her since\nthen.  I have just seen her.\n\nLORD AUGUSTUS.  Egad! the women are very down on her.  I have been dining\nwith Arabella this evening!  By Jove! you should have heard what she said\nabout Mrs. Erlynne.  She didn’t leave a rag on her. . . . [_Aside_.]\nBerwick and I told her that didn’t matter much, as the lady in question\nmust have an extremely fine figure.  You should have seen Arabella’s\nexpression! . . . But, look here, dear boy.  I don’t know what to do\nabout Mrs. Erlynne.  Egad!  I might be married to her; she treats me with\nsuch demmed indifference.  She’s deuced clever, too!  She explains\neverything.  Egad! she explains you.  She has got any amount of\nexplanations for you—and all of them different.\n\nLORD WINDERMERE.  No explanations are necessary about my friendship with\nMrs. Erlynne.\n\nLORD AUGUSTUS.  Hem!  Well, look here, dear old fellow.  Do you think she\nwill ever get into this demmed thing called Society?  Would you introduce\nher to your wife?  No use beating about the confounded bush.  Would you\ndo that?\n\nLORD WINDERMERE.  Mrs. Erlynne is coming here to-night.\n\nLORD AUGUSTUS.  Your wife has sent her a card?\n\nLORD WINDERMERE.  Mrs. Erlynne has received a card.\n\nLORD AUGUSTUS.  Then she’s all right, dear boy.  But why didn’t you tell\nme that before?  It would have saved me a heap of worry and demmed\nmisunderstandings!\n\n[LADY AGATHA _and_ MR. HOPPER _cross and exit on terrace L.U.E._]\n\nPARKER.  Mr. Cecil Graham!\n\n[_Enter_ MR. CECIL GRAHAM.]\n\nCECIL GRAHAM.  [_Bows to_ LADY WINDERMERE, _passes over and shakes hands\nwith_ LORD WINDERMERE.]  Good evening, Arthur.  Why don’t you ask me how\nI am?  I like people to ask me how I am.  It shows a wide-spread interest\nin my health.  Now, to-night I am not at all well.  Been dining with my\npeople.  Wonder why it is one’s people are always so tedious?  My father\nwould talk morality after dinner.  I told him he was old enough to know\nbetter.  But my experience is that as soon as people are old enough to\nknow better, they don’t know anything at all.  Hallo, Tuppy!  Hear you’re\ngoing to be married again; thought you were tired of that game.\n\nLORD AUGUSTUS.  You’re excessively trivial, my dear boy, excessively\ntrivial!\n\nCECIL GRAHAM.  By the way, Tuppy, which is it?  Have you been twice\nmarried and once divorced, or twice divorced and once married?  I say\nyou’ve been twice divorced and once married.  It seems so much more\nprobable.\n\nLORD AUGUSTUS.  I have a very bad memory.  I really don’t remember which.\n[_Moves away R._]\n\nLADY PLYMDALE.  Lord Windermere, I’ve something most particular to ask\nyou.\n\nLORD WINDERMERE.  I am afraid—if you will excuse me—I must join my wife.\n\nLADY PLYMDALE.  Oh, you mustn’t dream of such a thing.  It’s most\ndangerous nowadays for a husband to pay any attention to his wife in\npublic.  It always makes people think that he beats her when they’re\nalone.  The world has grown so suspicious of anything that looks like a\nhappy married life.  But I’ll tell you what it is at supper.  [_Moves\ntowards door of ball-room_.]\n\nLORD WINDERMERE.  [_C._]  Margaret!  I _must_ speak to you.\n\nLADY WINDERMERE.  Will you hold my fan for me, Lord Darlington?  Thanks.\n[_Comes down to him_.]\n\nLORD WINDERMERE.  [_Crossing to her_.]  Margaret, what you said before\ndinner was, of course, impossible?\n\nLADY WINDERMERE.  That woman is not coming here to-night!\n\nLORD WINDERMERE.  [_R.C._]  Mrs. Erlynne is coming here, and if you in\nany way annoy or wound her, you will bring shame and sorrow on us both.\nRemember that!  Ah, Margaret! only trust me!  A wife should trust her\nhusband!\n\nLADY WINDERMERE.  [_C._]  London is full of women who trust their\nhusbands.  One can always recognise them.  They look so thoroughly\nunhappy.  I am not going to be one of them.  [_Moves up_.]  Lord\nDarlington, will you give me back my fan, please?  Thanks. . . . A useful\nthing a fan, isn’t it? . . . I want a friend to-night, Lord Darlington: I\ndidn’t know I would want one so soon.\n\nLORD DARLINGTON.  Lady Windermere!  I knew the time would come some day;\nbut why to-night?\n\nLORD WINDERMERE.  I _will_ tell her.  I must.  It would be terrible if\nthere were any scene.  Margaret . . .\n\nPARKER.  Mrs. Erlynne!\n\n[LORD WINDERMERE _starts_.  MRS. ERLYNNE _enters_, _very beautifully\ndressed and very dignified_.  LADY WINDERMERE _clutches at her fan_,\n_then lets it drop on the door_.  _She bows coldly to_ MRS. ERLYNNE, _who\nbows to her sweetly in turn_, _and sails into the room_.]\n\nLORD DARLINGTON.  You have dropped your fan, Lady Windermere.  [_Picks it\nup and hands it to her_.]\n\nMRS. ERLYNNE.  [_C._]  How do you do, again, Lord Windermere?  How\ncharming your sweet wife looks!  Quite a picture!\n\nLORD WINDERMERE.  [_In a low voice_.]  It was terribly rash of you to\ncome!\n\nMRS. ERLYNNE.  [_Smiling_.]  The wisest thing I ever did in my life.\nAnd, by the way, you must pay me a good deal of attention this evening.\nI am afraid of the women.  You must introduce me to some of them.  The\nmen I can always manage.  How do you do, Lord Augustus?  You have quite\nneglected me lately.  I have not seen you since yesterday.  I am afraid\nyou’re faithless.  Every one told me so.\n\nLORD AUGUSTUS.  [_R._]  Now really, Mrs. Erlynne, allow me to explain.\n\nMRS. ERLYNNE.  [_R.C._]  No, dear Lord Augustus, you can’t explain\nanything.  It is your chief charm.\n\nLORD AUGUSTUS.  Ah! if you find charms in me, Mrs. Erlynne—\n\n[_They converse together_.  LORD WINDERMERE _moves uneasily about the\nroom watching_ MRS. ERLYNNE.]\n\nLORD DARLINGTON.  [_To_ LADY WINDERMERE.]  How pale you are!\n\nLADY WINDERMERE.  Cowards are always pale!\n\nLORD DARLINGTON.  You look faint.  Come out on the terrace.\n\nLADY WINDERMERE.  Yes.  [_To_ PARKER.]  Parker, send my cloak out.\n\nMRS. ERLYNNE.  [_Crossing to her_.]  Lady Windermere, how beautifully\nyour terrace is illuminated.  Reminds me of Prince Doria’s at Rome.\n\n[LADY WINDERMERE _bows coldly_, _and goes off with_ LORD DARLINGTON.]\n\nOh, how do you do, Mr. Graham?  Isn’t that your aunt, Lady Jedburgh?  I\nshould so much like to know her.\n\nCECIL GRAHAM.  [_After a moment’s hesitation and embarrassment_.]  Oh,\ncertainly, if you wish it.  Aunt Caroline, allow me to introduce Mrs.\nErlynne.\n\nMRS. ERLYNNE.  So pleased to meet you, Lady Jedburgh.  [_Sits beside her\non the sofa_.]  Your nephew and I are great friends.  I am so much\ninterested in his political career.  I think he’s sure to be a wonderful\nsuccess.  He thinks like a Tory, and talks like a Radical, and that’s so\nimportant nowadays.  He’s such a brilliant talker, too.  But we all know\nfrom whom he inherits that.  Lord Allandale was saying to me only\nyesterday, in the Park, that Mr. Graham talks almost as well as his aunt.\n\nLADY JEDBURGH.  [_R._]  Most kind of you to say these charming things to\nme!  [MRS. ERLYNNE _smiles_, _and continues conversation_.]\n\nDUMBY.  [_To_ CECIL GRAHAM.]  Did you introduce Mrs. Erlynne to Lady\nJedburgh?\n\nCECIL GRAHAM.  Had to, my dear fellow.  Couldn’t help it!  That woman can\nmake one do anything she wants.  How, I don’t know.\n\nDUMBY.  Hope to goodness she won’t speak to me!  [_Saunters towards_ LADY\nPLYMDALE.]\n\nMRS. ERLYNNE.  [_C._  _To_ LADY JEDBURGH.]  On Thursday?  With great\npleasure.  [_Rises_, _and speaks to_ LORD WINDERMERE, _laughing_.]  What\na bore it is to have to be civil to these old dowagers!  But they always\ninsist on it!\n\nLADY PLYMDALE.  [_To_ MR. DUMBY.]  Who is that well-dressed woman talking\nto Windermere?\n\nDUMBY.  Haven’t got the slightest idea!  Looks like an _édition de luxe_\nof a wicked French novel, meant specially for the English market.\n\nMRS. ERLYNNE.  So that is poor Dumby with Lady Plymdale?  I hear she is\nfrightfully jealous of him.  He doesn’t seem anxious to speak to me\nto-night.  I suppose he is afraid of her.  Those straw-coloured women\nhave dreadful tempers.  Do you know, I think I’ll dance with you first,\nWindermere.  [LORD WINDERMERE _bits his lip and frowns_.]  It will make\nLord Augustus so jealous!  Lord Augustus!  [LORD AUGUSTUS _comes down_.]\nLord Windermere insists on my dancing with him first, and, as it’s his\nown house, I can’t well refuse.  You know I would much sooner dance with\nyou.\n\nLORD AUGUSTUS.  [_With a low bow_.]  I wish I could think so, Mrs.\nErlynne.\n\nMRS. ERLYNNE.  You know it far too well.  I can fancy a person dancing\nthrough life with you and finding it charming.\n\nLORD AUGUSTUS.  [_Placing his hand on his white waistcoat_.]  Oh, thank\nyou, thank you.  You are the most adorable of all ladies!\n\nMRS. ERLYNNE.  What a nice speech!  So simple and so sincere!  Just the\nsort of speech I like.  Well, you shall hold my bouquet.  [_Goes towards\nball-room on_ LORD WINDERMERE’S _arm_.]  Ah, Mr. Dumby, how are you?  I\nam so sorry I have been out the last three times you have called.  Come\nand lunch on Friday.\n\nDUMBY.  [_With perfect nonchalance_.]  Delighted!\n\n[LADY PLYMDALE _glares with indignation at_ MR. DUMBY.  LORD AUGUSTUS\n_follows_ MRS. ERLYNNE _and_ LORD WINDERMERE _into the ball-room holding\nbouquet_.]\n\nLADY PLYMDALE.  [_To_ MR. DUMBY.]  What an absolute brute you are!  I\nnever can believe a word you say!  Why did you tell me you didn’t know\nher?  What do you mean by calling on her three times running?  You are\nnot to go to lunch there; of course you understand that?\n\nDUMBY.  My dear Laura, I wouldn’t dream of going!\n\nLADY PLYMDALE.  You haven’t told me her name yet!  Who is she?\n\nDUMBY.  [_Coughs slightly and smooths his hair_.]  She’s a Mrs. Erlynne.\n\nLADY PLYMDALE.  That woman!\n\nDUMBY.  Yes; that is what every one calls her.\n\nLADY PLYMDALE.  How very interesting!  How intensely interesting!  I\nreally must have a good stare at her.  [_Goes to door of ball-room and\nlooks in_.]  I have heard the most shocking things about her.  They say\nshe is ruining poor Windermere.  And Lady Windermere, who goes in for\nbeing so proper, invites her!  How extremely amusing!  It takes a\nthoroughly good woman to do a thoroughly stupid thing.  You are to lunch\nthere on Friday!\n\nDUMBY.  Why?\n\nLADY PLYMDALE.  Because I want you to take my husband with you.  He has\nbeen so attentive lately, that he has become a perfect nuisance.  Now,\nthis woman is just the thing for him.  He’ll dance attendance upon her as\nlong as she lets him, and won’t bother me.  I assure you, women of that\nkind are most useful.  They form the basis of other people’s marriages.\n\nDUMBY.  What a mystery you are!\n\nLADY PLYMDALE.  [_Looking at him_.]  I wish _you_ were!\n\nDUMBY.  I am—to myself.  I am the only person in the world I should like\nto know thoroughly; but I don’t see any chance of it just at present.\n\n[_They pass into the ball-room_, _and_ LADY WINDERMERE _and_ LORD\nDARLINGTON _enter from the terrace_.]\n\nLADY WINDERMERE.  Yes.  Her coming here is monstrous, unbearable.  I know\nnow what you meant to-day at tea-time.  Why didn’t you tell me right out?\nYou should have!\n\nLORD DARLINGTON.  I couldn’t!  A man can’t tell these things about\nanother man!  But if I had known he was going to make you ask her here\nto-night, I think I would have told you.  That insult, at any rate, you\nwould have been spared.\n\nLADY WINDERMERE.  I did not ask her.  He insisted on her coming—against\nmy entreaties—against my commands.  Oh! the house is tainted for me!  I\nfeel that every woman here sneers at me as she dances by with my husband.\nWhat have I done to deserve this?  I gave him all my life.  He took\nit—used it—spoiled it!  I am degraded in my own eyes; and I lack\ncourage—I am a coward!  [_Sits down on sofa_.]\n\nLORD DARLINGTON.  If I know you at all, I know that you can’t live with a\nman who treats you like this!  What sort of life would you have with him?\nYou would feel that he was lying to you every moment of the day.  You\nwould feel that the look in his eyes was false, his voice false, his\ntouch false, his passion false.  He would come to you when he was weary\nof others; you would have to comfort him.  He would come to you when he\nwas devoted to others; you would have to charm him.  You would have to be\nto him the mask of his real life, the cloak to hide his secret.\n\nLADY WINDERMERE.  You are right—you are terribly right.  But where am I\nto turn?  You said you would be my friend, Lord Darlington.—Tell me, what\nam I to do?  Be my friend now.\n\nLORD DARLINGTON.  Between men and women there is no friendship possible.\nThere is passion, enmity, worship, love, but no friendship.  I love you—\n\nLADY WINDERMERE.  No, no!  [_Rises_.]\n\nLORD DARLINGTON.  Yes, I love you!  You are more to me than anything in\nthe whole world.  What does your husband give you?  Nothing.  Whatever is\nin him he gives to this wretched woman, whom he has thrust into your\nsociety, into your home, to shame you before every one.  I offer you my\nlife—\n\nLADY WINDERMERE.  Lord Darlington!\n\nLORD DARLINGTON.  My life—my whole life.  Take it, and do with it what\nyou will. . . . I love you—love you as I have never loved any living\nthing.  From the moment I met you I loved you, loved you blindly,\nadoringly, madly!  You did not know it then—you know it now!  Leave this\nhouse to-night.  I won’t tell you that the world matters nothing, or the\nworld’s voice, or the voice of society.  They matter a great deal.  They\nmatter far too much.  But there are moments when one has to choose\nbetween living one’s own life, fully, entirely, completely—or dragging\nout some false, shallow, degrading existence that the world in its\nhypocrisy demands.  You have that moment now.  Choose!  Oh, my love,\nchoose.\n\nLADY WINDERMERE.  [_Moving slowly away from him_, _and looking at him\nwith startled eyes_.]  I have not the courage.\n\nLORD DARLINGTON.  [_Following her_.]  Yes; you have the courage.  There\nmay be six months of pain, of disgrace even, but when you no longer bear\nhis name, when you bear mine, all will be well.  Margaret, my love, my\nwife that shall be some day—yes, my wife!  You know it!  What are you\nnow?  This woman has the place that belongs by right to you.  Oh! go—go\nout of this house, with head erect, with a smile upon your lips, with\ncourage in your eyes.  All London will know why you did it; and who will\nblame you?  No one.  If they do, what matter?  Wrong?  What is wrong?\nIt’s wrong for a man to abandon his wife for a shameless woman.  It is\nwrong for a wife to remain with a man who so dishonours her.  You said\nonce you would make no compromise with things.  Make none now.  Be brave!\nBe yourself!\n\nLADY WINDERMERE.  I am afraid of being myself.  Let me think!  Let me\nwait!  My husband may return to me.  [_Sits down on sofa_.]\n\nLORD DARLINGTON.  And you would take him back!  You are not what I\nthought you were.  You are just the same as every other woman.  You would\nstand anything rather than face the censure of a world, whose praise you\nwould despise.  In a week you will be driving with this woman in the\nPark.  She will be your constant guest—your dearest friend.  You would\nendure anything rather than break with one blow this monstrous tie.  You\nare right.  You have no courage; none!\n\nLADY WINDERMERE.  Ah, give me time to think.  I cannot answer you now.\n[_Passes her hand nervously over her brow_.]\n\nLORD DARLINGTON.  It must be now or not at all.\n\nLADY WINDERMERE.  [_Rising from the sofa_.]  Then, not at all!  [_A\npause_.]\n\nLORD DARLINGTON.  You break my heart!\n\nLADY WINDERMERE.  Mine is already broken.  [_A pause_.]\n\nLORD DARLINGTON.  To-morrow I leave England.  This is the last time I\nshall ever look on you.  You will never see me again.  For one moment our\nlives met—our souls touched.  They must never meet or touch again.\nGood-bye, Margaret.  [_Exit_.]\n\nLADY WINDERMERE.  How alone I am in life!  How terribly alone!\n\n[_The music stops_.  _Enter the_ DUCHESS OF BERWICK _and_ LORD PAISLEY\n_laughing and talking_.  _Other guests come on from ball-room_.]\n\nDUCHESS OF BERWICK.  Dear Margaret, I’ve just been having such a\ndelightful chat with Mrs. Erlynne.  I am so sorry for what I said to you\nthis afternoon about her.  Of course, she must be all right if _you_\ninvite her.  A most attractive woman, and has such sensible views on\nlife.  Told me she entirely disapproved of people marrying more than\nonce, so I feel quite safe about poor Augustus.  Can’t imagine why people\nspeak against her.  It’s those horrid nieces of mine—the Saville\ngirls—they’re always talking scandal.  Still, I should go to Homburg,\ndear, I really should.  She is just a little too attractive.  But where\nis Agatha?  Oh, there she is:  [LADY AGATHA _and_ MR. HOPPER _enter from\nterrace L.U.E._]  Mr. Hopper, I am very, very angry with you.  You have\ntaken Agatha out on the terrace, and she is so delicate.\n\nHOPPER.  Awfully sorry, Duchess.  We went out for a moment and then got\nchatting together.\n\nDUCHESS OF BERWICK.  [_C._]  Ah, about dear Australia, I suppose?\n\nHOPPER.  Yes!\n\nDUCHESS OF BERWICK.  Agatha, darling!  [_Beckons her over_.]\n\nLADY AGATHA.  Yes, mamma!\n\nDUCHESS OF BERWICK.  [_Aside_.]  Did Mr. Hopper definitely—\n\nLADY AGATHA.  Yes, mamma.\n\nDUCHESS OF BERWICK.  And what answer did you give him, dear child?\n\nLADY AGATHA.  Yes, mamma.\n\nDUCHESS OF BERWICK.  [_Affectionately_.]  My dear one!  You always say\nthe right thing.  Mr. Hopper!  James!  Agatha has told me everything.\nHow cleverly you have both kept your secret.\n\nHOPPER.  You don’t mind my taking Agatha off to Australia, then, Duchess?\n\nDUCHESS OF BERWICK.  [_Indignantly_.]  To Australia?  Oh, don’t mention\nthat dreadful vulgar place.\n\nHOPPER.  But she said she’d like to come with me.\n\nDUCHESS OF BERWICK.  [_Severely_.]  Did you say that, Agatha?\n\nLADY AGATHA.  Yes, mamma.\n\nDUCHESS OF BERWICK.  Agatha, you say the most silly things possible.  I\nthink on the whole that Grosvenor Square would be a more healthy place to\nreside in.  There are lots of vulgar people live in Grosvenor Square, but\nat any rate there are no horrid kangaroos crawling about.  But we’ll talk\nabout that to-morrow.  James, you can take Agatha down.  You’ll come to\nlunch, of course, James.  At half-past one, instead of two.  The Duke\nwill wish to say a few words to you, I am sure.\n\nHOPPER.  I should like to have a chat with the Duke, Duchess.  He has not\nsaid a single word to me yet.\n\nDUCHESS OF BERWICK.  I think you’ll find he will have a great deal to say\nto you to-morrow.  [_Exit_ LADY AGATHA _with_ MR. HOPPER.]  And now\ngood-night, Margaret.  I’m afraid it’s the old, old story, dear.\nLove—well, not love at first sight, but love at the end of the season,\nwhich is so much more satisfactory.\n\nLADY WINDERMERE.  Good-night, Duchess.\n\n[_Exit the_ DUCHESS OF BERWICK _on_ LORD PAISLEY’S _arm_.]\n\nLADY PLYMDALE.  My dear Margaret, what a handsome woman your husband has\nbeen dancing with!  I should be quite jealous if I were you!  Is she a\ngreat friend of yours?\n\nLADY WINDERMERE.  No!\n\nLADY PLYMDALE.  Really?  Good-night, dear.  [_Looks at_ MR. DUMBY _and\nexit_.]\n\nDUMBY.  Awful manners young Hopper has!\n\nCECIL GRAHAM.  Ah!  Hopper is one of Nature’s gentlemen, the worst type\nof gentleman I know.\n\nDUMBY.  Sensible woman, Lady Windermere.  Lots of wives would have\nobjected to Mrs. Erlynne coming.  But Lady Windermere has that uncommon\nthing called common sense.\n\nCECIL GRAHAM.  And Windermere knows that nothing looks so like innocence\nas an indiscretion.\n\nDUMBY.  Yes; dear Windermere is becoming almost modern.  Never thought he\nwould.  [_Bows to_ LADY WINDERMERE _and exit_.]\n\nLADY JEDBURGH.  Good night, Lady Windermere.  What a fascinating woman\nMrs. Erlynne is!  She is coming to lunch on Thursday, won’t you come too?\nI expect the Bishop and dear Lady Merton.\n\nLADY WINDERMERE.  I am afraid I am engaged, Lady Jedburgh.\n\nLADY JEDBURGH.  So sorry.  Come, dear.  [_Exeunt_ LADY JEDBURGH _and_\nMISS GRAHAM.]\n\n[_Enter_ MRS. ERLYNNE _and_ LORD WINDERMERE.]\n\nMRS. ERLYNNE.  Charming ball it has been!  Quite reminds me of old days.\n[_Sits on sofa_.]  And I see that there are just as many fools in society\nas there used to be.  So pleased to find that nothing has altered!\nExcept Margaret.  She’s grown quite pretty.  The last time I saw\nher—twenty years ago, she was a fright in flannel.  Positive fright, I\nassure you.  The dear Duchess! and that sweet Lady Agatha!  Just the type\nof girl I like!  Well, really, Windermere, if I am to be the Duchess’s\nsister-in-law—\n\nLORD WINDERMERE.  [_Sitting L. of her_.]  But are you—?\n\n[_Exit_ MR. CECIL GRAHAM _with rest of guests_.  LADY WINDERMERE\n_watches_, _with a look of scorn and pain_, MRS. ERLYNNE _and her\nhusband_.  _They are unconscious of her presence_.]\n\nMRS. ERLYNNE.  Oh, yes!  He’s to call to-morrow at twelve o’clock!  He\nwanted to propose to-night.  In fact he did.  He kept on proposing.  Poor\nAugustus, you know how he repeats himself.  Such a bad habit!  But I told\nhim I wouldn’t give him an answer till to-morrow.  Of course I am going\nto take him.  And I dare say I’ll make him an admirable wife, as wives\ngo.  And there is a great deal of good in Lord Augustus.  Fortunately it\nis all on the surface.  Just where good qualities should be.  Of course\nyou must help me in this matter.\n\nLORD WINDERMERE.  I am not called on to encourage Lord Augustus, I\nsuppose?\n\nMRS. ERLYNNE.  Oh, no!  I do the encouraging.  But you will make me a\nhandsome settlement, Windermere, won’t you?\n\nLORD WINDERMERE.  [_Frowning_.]  Is that what you want to talk to me\nabout to-night?\n\nMRS. ERLYNNE.  Yes.\n\nLORD WINDERMERE.  [_With a gesture of impatience_.]  I will not talk of\nit here.\n\nMRS. ERLYNNE.  [_Laughing_.]  Then we will talk of it on the terrace.\nEven business should have a picturesque background.  Should it not,\nWindermere?  With a proper background women can do anything.\n\nLORD WINDERMERE.  Won’t to-morrow do as well?\n\nMRS. ERLYNNE.  No; you see, to-morrow I am going to accept him.  And I\nthink it would be a good thing if I was able to tell him that I had—well,\nwhat shall I say?—£2000 a year left to me by a third cousin—or a second\nhusband—or some distant relative of that kind.  It would be an additional\nattraction, wouldn’t it?  You have a delightful opportunity now of paying\nme a compliment, Windermere.  But you are not very clever at paying\ncompliments.  I am afraid Margaret doesn’t encourage you in that\nexcellent habit.  It’s a great mistake on her part.  When men give up\nsaying what is charming, they give up thinking what is charming.  But\nseriously, what do you say to £2000?  £2500, I think.  In modern life\nmargin is everything.  Windermere, don’t you think the world an intensely\namusing place?  I do!\n\n[_Exit on terrace with_ LORD WINDERMERE.  Music strikes up in ball-room.]\n\nLADY WINDERMERE.  To stay in this house any longer is impossible.\nTo-night a man who loves me offered me his whole life.  I refused it.  It\nwas foolish of me.  I will offer him mine now.  I will give him mine.  I\nwill go to him!  [_Puts on cloak and goes to the door_, _then turns\nback_.  _Sits down at table and writes a letter_, _puts it into an\nenvelope_, _and leaves it on table_.]  Arthur has never understood me.\nWhen he reads this, he will.  He may do as he chooses now with his life.\nI have done with mine as I think best, as I think right.  It is he who\nhas broken the bond of marriage—not I.  I only break its bondage.\n\n                                                                 [_Exit_.]\n\n[_PARKER enters L. and crosses towards the ball-room R._  _Enter_ MRS.\nERLYNNE.]\n\nMRS. ERLYNNE.  Is Lady Windermere in the ball-room?\n\nPARKER.  Her ladyship has just gone out.\n\nMRS. ERLYNNE.  Gone out?  She’s not on the terrace?\n\nPARKER.  No, madam.  Her ladyship has just gone out of the house.\n\nMRS. ERLYNNE.  [_Starts_, _and looks at the servant with a puzzled\nexpression in her face_.]  Out of the house?\n\nPARKER.  Yes, madam—her ladyship told me she had left a letter for his\nlordship on the table.\n\nMRS. ERLYNNE.  A letter for Lord Windermere?\n\nPARKER.  Yes, madam.\n\nMRS. ERLYNNE.  Thank you.\n\n[_Exit_ PARKER.  _The music in the ball-room stops_.]  Gone out of her\nhouse!  A letter addressed to her husband!  [_Goes over to bureau and\nlooks at letter_.  _Takes it up and lays it down again with a shudder of\nfear_.]  No, no!  It would be impossible!  Life doesn’t repeat its\ntragedies like that!  Oh, why does this horrible fancy come across me?\nWhy do I remember now the one moment of my life I most wish to forget?\nDoes life repeat its tragedies?  [_Tears letter open and reads it_, _then\nsinks down into a chair with a gesture of anguish_.]  Oh, how terrible!\nThe same words that twenty years ago I wrote to her father! and how\nbitterly I have been punished for it!  No; my punishment, my real\npunishment is to-night, is now!  [_Still seated R._]\n\n[_Enter_ LORD WINDERMERE _L.U.E._]\n\nLORD WINDERMERE.  Have you said good-night to my wife?  [_Comes C._]\n\nMRS. ERLYNNE.  [_Crushing letter in her hand_.]  Yes.\n\nLORD WINDERMERE.  Where is she?\n\nMRS. ERLYNNE.  She is very tired.  She has gone to bed.  She said she had\na headache.\n\nLORD WINDERMERE.  I must go to her.  You’ll excuse me?\n\nMRS. ERLYNNE.  [_Rising hurriedly_.]  Oh, no!  It’s nothing serious.\nShe’s only very tired, that is all.  Besides, there are people still in\nthe supper-room.  She wants you to make her apologies to them.  She said\nshe didn’t wish to be disturbed.  [_Drops letter_.]  She asked me to tell\nyou!\n\nLORD WINDERMERE.  [_Picks up letter_.]  You have dropped something.\n\nMRS. ERLYNNE.  Oh yes, thank you, that is mine.  [_Puts out her hand to\ntake it_.]\n\nLORD WINDERMERE.  [_Still looking at letter_.]  But it’s my wife’s\nhandwriting, isn’t it?\n\nMRS. ERLYNNE.  [_Takes the letter quickly_.]  Yes, it’s—an address.  Will\nyou ask them to call my carriage, please?\n\nLORD WINDERMERE.  Certainly.\n\n                                                     [_Goes L. and Exit_.]\n\nMRS. ERLYNNE.  Thanks!  What can I do?  What can I do?  I feel a passion\nawakening within me that I never felt before.  What can it mean?  The\ndaughter must not be like the mother—that would be terrible.  How can I\nsave her?  How can I save my child?  A moment may ruin a life.  Who knows\nthat better than I?  Windermere must be got out of the house; that is\nabsolutely necessary.  [_Goes L._]  But how shall I do it?  It must be\ndone somehow.  Ah!\n\n[_Enter_ LORD AUGUSTUS _R.U.E. carrying bouquet_.]\n\nLORD AUGUSTUS.  Dear lady, I am in such suspense!  May I not have an\nanswer to my request?\n\nMRS. ERLYNNE.  Lord Augustus, listen to me.  You are to take Lord\nWindermere down to your club at once, and keep him there as long as\npossible.  You understand?\n\nLORD AUGUSTUS.  But you said you wished me to keep early hours!\n\nMRS. ERLYNNE.  [_Nervously_.]  Do what I tell you.  Do what I tell you.\n\nLORD AUGUSTUS.  And my reward?\n\nMRS. ERLYNNE.  Your reward?  Your reward?  Oh! ask me that to-morrow.\nBut don’t let Windermere out of your sight to-night.  If you do I will\nnever forgive you.  I will never speak to you again.  I’ll have nothing\nto do with you.  Remember you are to keep Windermere at your club, and\ndon’t let him come back to-night.\n\n                                                               [_Exit L._]\n\nLORD AUGUSTUS.  Well, really, I might be her husband already.  Positively\nI might.  [_Follows her in a bewildered manner_.]\n\n                                * * * * *\n\n                                ACT DROP.\n\n\n\n\nTHIRD ACT\n\n\n                                  SCENE\n\n_Lord Darlington’s Rooms_.  _A large sofa is in front of fireplace R._\n_At the back of the stage a curtain is drawn across the window_.  _Doors\nL. and R._  _Table R. with writing materials.  Table C. with syphons,\nglasses, and Tantalus frame_.  _Table L. with cigar and cigarette box.\nLamps lit_.\n\nLADY WINDERMERE.  [_Standing by the fireplace_.]  Why doesn’t he come?\nThis waiting is horrible.  He should be here.  Why is he not here, to\nwake by passionate words some fire within me?  I am cold—cold as a\nloveless thing.  Arthur must have read my letter by this time.  If he\ncared for me, he would have come after me, would have taken me back by\nforce.  But he doesn’t care.  He’s entrammelled by this woman—fascinated\nby her—dominated by her.  If a woman wants to hold a man, she has merely\nto appeal to what is worst in him.  We make gods of men and they leave\nus.  Others make brutes of them and they fawn and are faithful.  How\nhideous life is! . . . Oh! it was mad of me to come here, horribly mad.\nAnd yet, which is the worst, I wonder, to be at the mercy of a man who\nloves one, or the wife of a man who in one’s own house dishonours one?\nWhat woman knows?  What woman in the whole world?  But will he love me\nalways, this man to whom I am giving my life?  What do I bring him?  Lips\nthat have lost the note of joy, eyes that are blinded by tears, chill\nhands and icy heart.  I bring him nothing.  I must go back—no; I can’t go\nback, my letter has put me in their power—Arthur would not take me back!\nThat fatal letter!  No!  Lord Darlington leaves England to-morrow.  I\nwill go with him—I have no choice.  [_Sits down for a few moments_.\n_Then starts up and puts on her cloak_.]  No, no!  I will go back, let\nArthur do with me what he pleases.  I can’t wait here.  It has been\nmadness my coming.  I must go at once.  As for Lord Darlington—Oh! here\nhe is!  What shall I do?  What can I say to him?  Will he let me go away\nat all?  I have heard that men are brutal, horrible . . . Oh!  [_Hides\nher face in her hands_.]\n\n[_Enter_ MRS. ERLYNNE _L._]\n\nMRS. ERLYNNE.  Lady Windermere!  [LADY WINDERMERE _starts and looks up_.\n_Then recoils in contempt_.]  Thank Heaven I am in time.  You must go\nback to your husband’s house immediately.\n\nLADY WINDERMERE.  Must?\n\nMRS. ERLYNNE.  [_Authoritatively_.]  Yes, you must!  There is not a\nsecond to be lost.  Lord Darlington may return at any moment.\n\nLADY WINDERMERE.  Don’t come near me!\n\nMRS. ERLYNNE.  Oh!  You are on the brink of ruin, you are on the brink of\na hideous precipice.  You must leave this place at once, my carriage is\nwaiting at the corner of the street.  You must come with me and drive\nstraight home.\n\n[LADY WINDERMERE _throws off her cloak and flings it on the sofa_.]\n\nWhat are you doing?\n\nLADY WINDERMERE.  Mrs. Erlynne—if you had not come here, I would have\ngone back.  But now that I see you, I feel that nothing in the whole\nworld would induce me to live under the same roof as Lord Windermere.\nYou fill me with horror.  There is something about you that stirs the\nwildest—rage within me.  And I know why you are here.  My husband sent\nyou to lure me back that I might serve as a blind to whatever relations\nexist between you and him.\n\nMRS. ERLYNNE.  Oh!  You don’t think that—you can’t.\n\nLADY WINDERMERE.  Go back to my husband, Mrs. Erlynne.  He belongs to you\nand not to me.  I suppose he is afraid of a scandal.  Men are such\ncowards.  They outrage every law of the world, and are afraid of the\nworld’s tongue.  But he had better prepare himself.  He shall have a\nscandal.  He shall have the worst scandal there has been in London for\nyears.  He shall see his name in every vile paper, mine on every hideous\nplacard.\n\nMRS. ERLYNNE.  No—no—\n\nLADY WINDERMERE.  Yes! he shall.  Had he come himself, I admit I would\nhave gone back to the life of degradation you and he had prepared for\nme—I was going back—but to stay himself at home, and to send you as his\nmessenger—oh! it was infamous—infamous.\n\nMRS. ERLYNNE.  [_C._]  Lady Windermere, you wrong me horribly—you wrong\nyour husband horribly.  He doesn’t know you are here—he thinks you are\nsafe in your own house.  He thinks you are asleep in your own room.  He\nnever read the mad letter you wrote to him!\n\nLADY WINDERMERE.  [_R._]  Never read it!\n\nMRS. ERLYNNE.  No—he knows nothing about it.\n\nLADY WINDERMERE.  How simple you think me!  [_Going to her_.]  You are\nlying to me!\n\nMRS. ERLYNNE.  [_Restraining herself_.]  I am not.  I am telling you the\ntruth.\n\nLADY WINDERMERE.  If my husband didn’t read my letter, how is it that you\nare here?  Who told you I had left the house you were shameless enough to\nenter?  Who told you where I had gone to?  My husband told you, and sent\nyou to decoy me back.  [_Crosses L._]\n\nMRS. ERLYNNE.  [_R.C._]  Your husband has never seen the letter.  I—saw\nit, I opened it.  I—read it.\n\nLADY WINDERMERE.  [_Turning to her_.]  You opened a letter of mine to my\nhusband?  You wouldn’t dare!\n\nMRS. ERLYNNE.  Dare!  Oh! to save you from the abyss into which you are\nfalling, there is nothing in the world I would not dare, nothing in the\nwhole world.  Here is the letter.  Your husband has never read it.  He\nnever shall read it.  [_Going to fireplace_.]  It should never have been\nwritten.  [_Tears it and throws it into the fire_.]\n\nLADY WINDERMERE.  [_With infinite contempt in her voice and look_.]  How\ndo I know that that was my letter after all?  You seem to think the\ncommonest device can take me in!\n\nMRS. ERLYNNE.  Oh! why do you disbelieve everything I tell you?  What\nobject do you think I have in coming here, except to save you from utter\nruin, to save you from the consequence of a hideous mistake?  That letter\nthat is burnt now _was_ your letter.  I swear it to you!\n\nLADY WINDERMERE.  [_Slowly_.]  You took good care to burn it before I had\nexamined it.  I cannot trust you.  You, whose whole life is a lie, could\nyou speak the truth about anything?  [_Sits down_.]\n\nMRS. ERLYNNE.  [_Hurriedly_.]  Think as you like about me—say what you\nchoose against me, but go back, go back to the husband you love.\n\nLADY WINDERMERE.  [_Sullenly_.]  I do _not_ love him!\n\nMRS. ERLYNNE.  You do, and you know that he loves you.\n\nLADY WINDERMERE.  He does not understand what love is.  He understands it\nas little as you do—but I see what you want.  It would be a great\nadvantage for you to get me back.  Dear Heaven! what a life I would have\nthen!  Living at the mercy of a woman who has neither mercy nor pity in\nher, a woman whom it is an infamy to meet, a degradation to know, a vile\nwoman, a woman who comes between husband and wife!\n\nMRS. ERLYNNE.  [_With a gesture of despair_.]  Lady Windermere, Lady\nWindermere, don’t say such terrible things.  You don’t know how terrible\nthey are, how terrible and how unjust.  Listen, you must listen!  Only go\nback to your husband, and I promise you never to communicate with him\nagain on any pretext—never to see him—never to have anything to do with\nhis life or yours.  The money that he gave me, he gave me not through\nlove, but through hatred, not in worship, but in contempt.  The hold I\nhave over him—\n\nLADY WINDERMERE.  [_Rising_.]  Ah! you admit you have a hold!\n\nMRS. ERLYNNE.  Yes, and I will tell you what it is.  It is his love for\nyou, Lady Windermere.\n\nLADY WINDERMERE.  You expect me to believe that?\n\nMRS. ERLYNNE.  You must believe it!  It is true.  It is his love for you\nthat has made him submit to—oh! call it what you like, tyranny, threats,\nanything you choose.  But it is his love for you.  His desire to spare\nyou—shame, yes, shame and disgrace.\n\nLADY WINDERMERE.  What do you mean?  You are insolent!  What have I to do\nwith you?\n\nMRS. ERLYNNE.  [_Humbly_.]  Nothing.  I know it—but I tell you that your\nhusband loves you—that you may never meet with such love again in your\nwhole life—that such love you will never meet—and that if you throw it\naway, the day may come when you will starve for love and it will not be\ngiven to you, beg for love and it will be denied you—Oh! Arthur loves\nyou!\n\nLADY WINDERMERE.  Arthur?  And you tell me there is nothing between you?\n\nMRS. ERLYNNE.  Lady Windermere, before Heaven your husband is guiltless\nof all offence towards you!  And I—I tell you that had it ever occurred\nto me that such a monstrous suspicion would have entered your mind, I\nwould have died rather than have crossed your life or his—oh! died,\ngladly died!  [_Moves away to sofa R._]\n\nLADY WINDERMERE.  You talk as if you had a heart.  Women like you have no\nhearts.  Heart is not in you.  You are bought and sold.  [_Sits L.C._]\n\nMRS. ERLYNNE.  [_Starts_, _with a gesture of pain_.  _Then restrains\nherself_, _and comes over to where_ LADY WINDERMERE _is sitting_.  _As\nshe speaks_, _she stretches out her hands towards her_, _but does not\ndare to touch her_.]  Believe what you choose about me.  I am not worth a\nmoment’s sorrow.  But don’t spoil your beautiful young life on my\naccount!  You don’t know what may be in store for you, unless you leave\nthis house at once.  You don’t know what it is to fall into the pit, to\nbe despised, mocked, abandoned, sneered at—to be an outcast! to find the\ndoor shut against one, to have to creep in by hideous byways, afraid\nevery moment lest the mask should be stripped from one’s face, and all\nthe while to hear the laughter, the horrible laughter of the world, a\nthing more tragic than all the tears the world has ever shed.  You don’t\nknow what it is.  One pays for one’s sin, and then one pays again, and\nall one’s life one pays.  You must never know that.—As for me, if\nsuffering be an expiation, then at this moment I have expiated all my\nfaults, whatever they have been; for to-night you have made a heart in\none who had it not, made it and broken it.—But let that pass.  I may have\nwrecked my own life, but I will not let you wreck yours.  You—why, you\nare a mere girl, you would be lost.  You haven’t got the kind of brains\nthat enables a woman to get back.  You have neither the wit nor the\ncourage.  You couldn’t stand dishonour!  No!  Go back, Lady Windermere,\nto the husband who loves you, whom you love.  You have a child, Lady\nWindermere.  Go back to that child who even now, in pain or in joy, may\nbe calling to you.  [LADY WINDERMERE _rises_.]  God gave you that child.\nHe will require from you that you make his life fine, that you watch over\nhim.  What answer will you make to God if his life is ruined through you?\nBack to your house, Lady Windermere—your husband loves you!  He has never\nswerved for a moment from the love he bears you.  But even if he had a\nthousand loves, you must stay with your child.  If he was harsh to you,\nyou must stay with your child.  If he ill-treated you, you must stay with\nyour child.  If he abandoned you, your place is with your child.\n\n[LADY WINDERMERE _bursts into tears and buries her face in her hands_.]\n\n[_Rushing to her_.]  Lady Windermere!\n\nLADY WINDERMERE.  [_Holding out her hands to her_, _helplessly_, _as a\nchild might do_.]  Take me home.  Take me home.\n\nMRS. ERLYNNE.  [_Is about to embrace her_.  _Then restrains herself_.\n_There is a look of wonderful joy in her face_.]  Come!  Where is your\ncloak?  [_Getting it from sofa_.]  Here.  Put it on.  Come at once!\n\n[_They go to the door_.]\n\nLADY WINDERMERE.  Stop!  Don’t you hear voices?\n\nMRS. ERLYNNE.  No, no!  There was no one!\n\nLADY WINDERMERE.  Yes, there is!  Listen!  Oh! that is my husband’s\nvoice!  He is coming in!  Save me!  Oh, it’s some plot!  You have sent\nfor him.\n\n[_Voices outside_.]\n\nMRS. ERLYNNE.  Silence!  I’m here to save you, if I can.  But I fear it\nis too late!  There! [_Points to the curtain across the window_.]  The\nfirst chance you have, slip out, if you ever get a chance!\n\nLADY WINDERMERE.  But you?\n\nMRS. ERLYNNE.  Oh! never mind me.  I’ll face them.\n\n[LADY WINDERMERE _hides herself behind the curtain_.]\n\nLORD AUGUSTUS.  [_Outside_.]  Nonsense, dear Windermere, you must not\nleave me!\n\nMRS. ERLYNNE.  Lord Augustus!  Then it is I who am lost!  [_Hesitates for\na moment_, then _looks round and sees door R._, _and exits through it_.]\n\n[_Enter_ LORD DARLINGTON, MR. DUMBY, LORD WINDERMERE, LORD AUGUSTUS\nLORTON, _and_ MR. CECIL GRAHAM.\n\nDUMBY.  What a nuisance their turning us out of the club at this hour!\nIt’s only two o’clock.  [_Sinks into a chair_.]  The lively part of the\nevening is only just beginning.  [_Yawns and closes his eyes_.]\n\nLORD WINDERMERE.  It is very good of you, Lord Darlington, allowing\nAugustus to force our company on you, but I’m afraid I can’t stay long.\n\nLORD DARLINGTON.  Really!  I am so sorry!  You’ll take a cigar, won’t\nyou?\n\nLORD WINDERMERE.  Thanks!  [_Sits down_.]\n\nLORD AUGUSTUS.  [_To_ LORD WINDERMERE.]  My dear boy, you must not dream\nof going.  I have a great deal to talk to you about, of demmed\nimportance, too.  [_Sits down with him at L. table_.]\n\nCECIL GRAHAM.  Oh!  We all know what that is!  Tuppy can’t talk about\nanything but Mrs. Erlynne.\n\nLORD WINDERMERE.  Well, that is no business of yours, is it, Cecil?\n\nCECIL GRAHAM.  None!  That is why it interests me.  My own business\nalways bores me to death.  I prefer other people’s.\n\nLORD DARLINGTON.  Have something to drink, you fellows.  Cecil, you’ll\nhave a whisky and soda?\n\nCECIL GRAHAM.  Thanks.  [_Goes to table with_ LORD DARLINGTON.]  Mrs.\nErlynne looked very handsome to-night, didn’t she?\n\nLORD DARLINGTON.  I am not one of her admirers.\n\nCECIL GRAHAM.  I usen’t to be, but I am now.  Why! she actually made me\nintroduce her to poor dear Aunt Caroline.  I believe she is going to\nlunch there.\n\nLORD DARLINGTON.  [_In Purple_.]  No?\n\nCECIL GRAHAM.  She is, really.\n\nLORD DARLINGTON.  Excuse me, you fellows.  I’m going away to-morrow.  And\nI have to write a few letters.  [_Goes to writing table and sits down_.]\n\nDUMBY.  Clever woman, Mrs. Erlynne.\n\nCECIL GRAHAM.  Hallo, Dumby!  I thought you were asleep.\n\nDUMBY.  I am, I usually am!\n\nLORD AUGUSTUS.  A very clever woman.  Knows perfectly well what a demmed\nfool I am—knows it as well as I do myself.\n\n[CECIL GRAHAM _comes towards him laughing_.]\n\nAh, you may laugh, my boy, but it is a great thing to come across a woman\nwho thoroughly understands one.\n\nDUMBY.  It is an awfully dangerous thing.  They always end by marrying\none.\n\nCECIL GRAHAM.  But I thought, Tuppy, you were never going to see her\nagain!  Yes! you told me so yesterday evening at the club.  You said\nyou’d heard—\n\n[_Whispering to him_.]\n\nLORD AUGUSTUS.  Oh, she’s explained that.\n\nCECIL GRAHAM.  And the Wiesbaden affair?\n\nLORD AUGUSTUS.  She’s explained that too.\n\nDUMBY.  And her income, Tuppy?  Has she explained that?\n\nLORD AUGUSTUS.  [_In a very serious voice_.]  She’s going to explain that\nto-morrow.\n\n[CECIL GRAHAM _goes back to C. table_.]\n\nDUMBY.  Awfully commercial, women nowadays.  Our grandmothers threw their\ncaps over the mills, of course, but, by Jove, their granddaughters only\nthrow their caps over mills that can raise the wind for them.\n\nLORD AUGUSTUS.  You want to make her out a wicked woman.  She is not!\n\nCECIL GRAHAM.  Oh!  Wicked women bother one.  Good women bore one.  That\nis the only difference between them.\n\nLORD AUGUSTUS.  [_Puffing a cigar_.]  Mrs. Erlynne has a future before\nher.\n\nDUMBY.  Mrs. Erlynne has a past before her.\n\nLORD AUGUSTUS.  I prefer women with a past.  They’re always so demmed\namusing to talk to.\n\nCECIL GRAHAM.  Well, you’ll have lots of topics of conversation with\n_her_, Tuppy.  [_Rising and going to him_.]\n\nLORD AUGUSTUS.  You’re getting annoying, dear-boy; you’re getting demmed\nannoying.\n\nCECIL GRAHAM.  [_Puts his hands on his shoulders_.]  Now, Tuppy, you’ve\nlost your figure and you’ve lost your character.  Don’t lose your temper;\nyou have only got one.\n\nLORD AUGUSTUS.  My dear boy, if I wasn’t the most good-natured man in\nLondon—\n\nCECIL GRAHAM.  We’d treat you with more respect, wouldn’t we, Tuppy?\n[_Strolls away_.]\n\nDUMBY.  The youth of the present day are quite monstrous.  They have\nabsolutely no respect for dyed hair.  [LORD AUGUSTUS _looks round\nangrily_.]\n\nCECIL GRAHAM.  Mrs. Erlynne has a very great respect for dear Tuppy.\n\nDUMBY.  Then Mrs. Erlynne sets an admirable example to the rest of her\nsex.  It is perfectly brutal the way most women nowadays behave to men\nwho are not their husbands.\n\nLORD WINDERMERE.  Dumby, you are ridiculous, and Cecil, you let your\ntongue run away with you.  You must leave Mrs. Erlynne alone.  You don’t\nreally know anything about her, and you’re always talking scandal against\nher.\n\nCECIL GRAHAM.  [_Coming towards him L.C._]  My dear Arthur, I never talk\nscandal.  _I_ only talk gossip.\n\nLORD WINDERMERE.  What is the difference between scandal and gossip?\n\nCECIL GRAHAM.  Oh! gossip is charming!  History is merely gossip.  But\nscandal is gossip made tedious by morality.  Now, I never moralise.  A\nman who moralises is usually a hypocrite, and a woman who moralises is\ninvariably plain.  There is nothing in the whole world so unbecoming to a\nwoman as a Nonconformist conscience.  And most women know it, I’m glad to\nsay.\n\nLORD AUGUSTUS.  Just my sentiments, dear boy, just my sentiments.\n\nCECIL GRAHAM.  Sorry to hear it, Tuppy; whenever people agree with me, I\nalways feel I must be wrong.\n\nLORD AUGUSTUS.  My dear boy, when I was your age—\n\nCECIL GRAHAM.  But you never were, Tuppy, and you never will be.  [_Goes\nup C._]  I say, Darlington, let us have some cards.  You’ll play, Arthur,\nwon’t you?\n\nLORD WINDERMERE.  No, thanks, Cecil.\n\nDUMBY.  [_With a sigh_.]  Good heavens! how marriage ruins a man!  It’s\nas demoralising as cigarettes, and far more expensive.\n\nCECIL GRAHAM.  You’ll play, of course, Tuppy?\n\nLORD AUGUSTUS.  [_Pouring himself out a brandy and soda at table_.]\nCan’t, dear boy.  Promised Mrs. Erlynne never to play or drink again.\n\nCECIL GRAHAM.  Now, my dear Tuppy, don’t be led astray into the paths of\nvirtue.  Reformed, you would be perfectly tedious.  That is the worst of\nwomen.  They always want one to be good.  And if we are good, when they\nmeet us, they don’t love us at all.  They like to find us quite\nirretrievably bad, and to leave us quite unattractively good.\n\nLORD DARLINGTON.  [_Rising from R. table_, _where he has been writing\nletters_.]  They always do find us bad!\n\nDUMBY.  I don’t think we are bad.  I think we are all good, except Tuppy.\n\nLORD DARLINGTON.  No, we are all in the gutter, but some of us are\nlooking at the stars.  [_Sits down at C. table_.]\n\nDUMBY.  We are all in the gutter, but some of us are looking at the\nstars?  Upon my word, you are very romantic to-night, Darlington.\n\nCECIL GRAHAM.  Too romantic!  You must be in love.  Who is the girl?\n\nLORD DARLINGTON.  The woman I love is not free, or thinks she isn’t.\n[_Glances instinctively at_ LORD WINDERMERE _while he speaks_.]\n\nCECIL GRAHAM.  A married woman, then!  Well, there’s nothing in the world\nlike the devotion of a married woman.  It’s a thing no married man knows\nanything about.\n\nLORD DARLINGTON.  Oh! she doesn’t love me.  She is a good woman.  She is\nthe only good woman I have ever met in my life.\n\nCECIL GRAHAM.  The only good woman you have ever met in your life?\n\nLORD DARLINGTON.  Yes!\n\nCECIL GRAHAM.  [_Lighting a cigarette_.]  Well, you are a lucky fellow!\nWhy, I have met hundreds of good women.  I never seem to meet any but\ngood women.  The world is perfectly packed with good women.  To know them\nis a middle-class education.\n\nLORD DARLINGTON.  This woman has purity and innocence.  She has\neverything we men have lost.\n\nCECIL GRAHAM.  My dear fellow, what on earth should we men do going about\nwith purity and innocence?  A carefully thought-out buttonhole is much\nmore effective.\n\nDUMBY.  She doesn’t really love you then?\n\nLORD DARLINGTON.  No, she does not!\n\nDUMBY.  I congratulate you, my dear fellow.  In this world there are only\ntwo tragedies.  One is not getting what one wants, and the other is\ngetting it.  The last is much the worst; the last is a real tragedy!  But\nI am interested to hear she does not love you.  How long could you love a\nwoman who didn’t love you, Cecil?\n\nCECIL GRAHAM.  A woman who didn’t love me?  Oh, all my life!\n\nDUMBY.  So could I.  But it’s so difficult to meet one.\n\nLORD DARLINGTON.  How can you be so conceited, DUMBY?\n\nDUMBY.  I didn’t say it as a matter of conceit.  I said it as a matter of\nregret.  I have been wildly, madly adored.  I am sorry I have.  It has\nbeen an immense nuisance.  I should like to be allowed a little time to\nmyself now and then.\n\nLORD AUGUSTUS.  [_Looking round_.]  Time to educate yourself, I suppose.\n\nDUMBY.  No, time to forget all I have learned.  That is much more\nimportant, dear Tuppy.  [LORD AUGUSTUS _moves uneasily in his chair_.]\n\nLORD DARLINGTON.  What cynics you fellows are!\n\nCECIL GRAHAM.  What is a cynic?  [_Sitting on the back of the sofa_.]\n\nLORD DARLINGTON.  A man who knows the price of everything and the value\nof nothing.\n\nCECIL GRAHAM.  And a sentimentalist, my dear Darlington, is a man who\nsees an absurd value in everything, and doesn’t know the market price of\nany single thing.\n\nLORD DARLINGTON.  You always amuse me, Cecil.  You talk as if you were a\nman of experience.\n\nCECIL GRAHAM.  I am.  [_Moves up to front off fireplace_.]\n\nLORD DARLINGTON.  You are far too young!\n\nCECIL GRAHAM.  That is a great error.  Experience is a question of\ninstinct about life.  I have got it.  Tuppy hasn’t.  Experience is the\nname Tuppy gives to his mistakes.  That is all.  [LORD AUGUSTUS _looks\nround indignantly_.]\n\nDUMBY.  Experience is the name every one gives to their mistakes.\n\nCECIL GRAHAM.  [_Standing with his back to the fireplace_.]  One\nshouldn’t commit any.  [_Sees_ LADY WINDERMERE’S _fan on sofa_.]\n\nDUMBY.  Life would be very dull without them.\n\nCECIL GRAHAM.  Of course you are quite faithful to this woman you are in\nlove with, Darlington, to this good woman?\n\nLORD DARLINGTON.  Cecil, if one really loves a woman, all other women in\nthe world become absolutely meaningless to one.  Love changes one—_I_ am\nchanged.\n\nCECIL GRAHAM.  Dear me!  How very interesting!  Tuppy, I want to talk to\nyou.  [LORD AUGUSTUS _takes no notice_.]\n\nDUMBY.  It’s no use talking to Tuppy.  You might just as well talk to a\nbrick wall.\n\nCECIL GRAHAM.  But I like talking to a brick wall—it’s the only thing in\nthe world that never contradicts me!  Tuppy!\n\nLORD AUGUSTUS.  Well, what is it?  What is it?  [_Rising and going over\nto_ CECIL GRAHAM.]\n\nCECIL GRAHAM.  Come over here.  I want you particularly.  [_Aside_.]\nDarlington has been moralising and talking about the purity of love, and\nthat sort of thing, and he has got some woman in his rooms all the time.\n\nLORD AUGUSTUS.  No, really! really!\n\nCECIL GRAHAM.  [_In a low voice_.]  Yes, here is her fan.  [_Points to\nthe fan_.]\n\nLORD AUGUSTUS.  [_Chuckling_.]  By Jove!  By Jove!\n\nLORD WINDERMERE.  [_Up by door_.]  I am really off now, Lord Darlington.\nI am sorry you are leaving England so soon.  Pray call on us when you\ncome back!  My wife and I will be charmed to see you!\n\nLORD DARLINGTON.  [_Upstage with_ LORD WINDERMERE.]  I am afraid I shall\nbe away for many years.  Good-night!\n\nCECIL GRAHAM.  Arthur!\n\nLORD WINDERMERE.  What?\n\nCECIL GRAHAM.  I want to speak to you for a moment.  No, do come!\n\nLORD WINDERMERE.  [_Putting on his coat_.]  I can’t—I’m off!\n\nCECIL GRAHAM.  It is something very particular.  It will interest you\nenormously.\n\nLORD WINDERMERE.  [_Smiling_.]  It is some of your nonsense, Cecil.\n\nCECIL GRAHAM.  It isn’t!  It isn’t really.\n\nLORD AUGUSTUS.  [_Going to him_.]  My dear fellow, you mustn’t go yet.  I\nhave a lot to talk to you about.  And Cecil has something to show you.\n\nLORD WINDERMERE.  [_Walking over_.]  Well, what is it?\n\nCECIL GRAHAM.  Darlington has got a woman here in his rooms.  Here is her\nfan.  Amusing, isn’t it?  [_A pause_.]\n\nLORD WINDERMERE.  Good God!  [_Seizes the fan_—DUMBY _rises_.]\n\nCECIL GRAHAM.  What is the matter?\n\nLORD WINDERMERE.  Lord Darlington!\n\nLORD DARLINGTON.  [_Turning round_.]  Yes!\n\nLORD WINDERMERE.  What is my wife’s fan doing here in your rooms?  Hands\noff, Cecil.  Don’t touch me.\n\nLORD DARLINGTON.  Your wife’s fan?\n\nLORD WINDERMERE.  Yes, here it is!\n\nLORD DARLINGTON.  [_Walking towards him_.]  I don’t know!\n\nLORD WINDERMERE.  You must know.  I demand an explanation.  Don’t hold\nme, you fool.  [_To_ CECIL GRAHAM.]\n\nLORD DARLINGTON.  [_Aside_.]  She is here after all!\n\nLORD WINDERMERE.  Speak, sir!  Why is my wife’s fan here?  Answer me!  By\nGod!  I’ll search your rooms, and if my wife’s here, I’ll—  [_Moves_.]\n\nLORD DARLINGTON.  You shall not search my rooms.  You have no right to do\nso.  I forbid you!\n\nLORD WINDERMERE.  You scoundrel!  I’ll not leave your room till I have\nsearched every corner of it!  What moves behind that curtain?  [_Rushes\ntowards the curtain C._]\n\nMRS. ERLYNNE.  [_Enters behind R._]  Lord Windermere!\n\nLORD WINDERMERE.  Mrs. Erlynne!\n\n[_Every one starts and turns round_.  LADY WINDERMERE _slips out from\nbehind the curtain and glides from the room L._]\n\nMRS. ERLYNNE.  I am afraid I took your wife’s fan in mistake for my own,\nwhen I was leaving your house to-night.  I am so sorry.  [_Takes fan from\nhim_.  LORD WINDERMERE _looks at her in contempt_.  LORD DARLINGTON _in\nmingled astonishment and anger_.  LORD AUGUSTUS _turns away_.  _The other\nmen smile at each other_.]\n\n                                ACT DROP.\n\n\n\n\nFOURTH ACT\n\n\n                         SCENE—Same as in Act I.\n\nLADY WINDERMERE.  [_Lying on sofa_.]  How can I tell him?  I can’t tell\nhim.  It would kill me.  I wonder what happened after I escaped from that\nhorrible room.  Perhaps she told them the true reason of her being there,\nand the real meaning of that—fatal fan of mine.  Oh, if he knows—how can\nI look him in the face again?  He would never forgive me.  [_Touches\nbell_.]  How securely one thinks one lives—out of reach of temptation,\nsin, folly.  And then suddenly—Oh!  Life is terrible.  It rules us, we do\nnot rule it.\n\n[_Enter_ ROSALIE _R._]\n\nROSALIE.  Did your ladyship ring for me?\n\nLADY WINDERMERE.  Yes.  Have you found out at what time Lord Windermere\ncame in last night?\n\nROSALIE.  His lordship did not come in till five o’clock.\n\nLADY WINDERMERE.  Five o’clock?  He knocked at my door this morning,\ndidn’t he?\n\nROSALIE.  Yes, my lady—at half-past nine.  I told him your ladyship was\nnot awake yet.\n\nLADY WINDERMERE.  Did he say anything?\n\nROSALIE.  Something about your ladyship’s fan.  I didn’t quite catch what\nhis lordship said.  Has the fan been lost, my lady?  I can’t find it, and\nParker says it was not left in any of the rooms.  He has looked in all of\nthem and on the terrace as well.\n\nLADY WINDERMERE.  It doesn’t matter.  Tell Parker not to trouble.  That\nwill do.\n\n                                                         [_Exit_ ROSALIE.]\n\nLADY WINDERMERE.  [_Rising_.]  She is sure to tell him.  I can fancy a\nperson doing a wonderful act of self-sacrifice, doing it spontaneously,\nrecklessly, nobly—and afterwards finding out that it costs too much.  Why\nshould she hesitate between her ruin and mine? . . . How strange!  I\nwould have publicly disgraced her in my own house.  She accepts public\ndisgrace in the house of another to save me. . . . There is a bitter\nirony in things, a bitter irony in the way we talk of good and bad women.\n. . . Oh, what a lesson! and what a pity that in life we only get our\nlessons when they are of no use to us!  For even if she doesn’t tell, I\nmust.  Oh! the shame of it, the shame of it.  To tell it is to live\nthrough it all again.  Actions are the first tragedy in life, words are\nthe second.  Words are perhaps the worst.  Words are merciless. . . . Oh!\n[_Starts as_ LORD WINDERMERE _enters_.]\n\nLORD WINDERMERE.  [_Kisses her_.]  Margaret—how pale you look!\n\nLADY WINDERMERE.  I slept very badly.\n\nLORD WINDERMERE.  [_Sitting on sofa with her_.]  I am so sorry.  I came\nin dreadfully late, and didn’t like to wake you.  You are crying, dear.\n\nLADY WINDERMERE.  Yes, I am crying, for I have something to tell you,\nArthur.\n\nLORD WINDERMERE.  My dear child, you are not well.  You’ve been doing too\nmuch.  Let us go away to the country.  You’ll be all right at Selby.  The\nseason is almost over.  There is no use staying on.  Poor darling!  We’ll\ngo away to-day, if you like.  [_Rises_.]  We can easily catch the 3.40.\nI’ll send a wire to Fannen.  [_Crosses and sits down at table to write a\ntelegram_.]\n\nLADY WINDERMERE.  Yes; let us go away to-day.  No; I can’t go to-day,\nArthur.  There is some one I must see before I leave town—some one who\nhas been kind to me.\n\nLORD WINDERMERE.  [_Rising and leaning over sofa_.]  Kind to you?\n\nLADY WINDERMERE.  Far more than that.  [_Rises and goes to him_.]  I will\ntell you, Arthur, but only love me, love me as you used to love me.\n\nLORD WINDERMERE.  Used to?  You are not thinking of that wretched woman\nwho came here last night?  [_Coming round and sitting R. of her_.]  You\ndon’t still imagine—no, you couldn’t.\n\nLADY WINDERMERE.  I don’t.  I know now I was wrong and foolish.\n\nLORD WINDERMERE.  It was very good of you to receive her last night—but\nyou are never to see her again.\n\nLADY WINDERMERE.  Why do you say that?  [_A pause_.]\n\nLORD WINDERMERE.  [_Holding her hand_.]  Margaret, I thought Mrs. Erlynne\nwas a woman more sinned against than sinning, as the phrase goes.  I\nthought she wanted to be good, to get back into a place that she had lost\nby a moment’s folly, to lead again a decent life.  I believed what she\ntold me—I was mistaken in her.  She is bad—as bad as a woman can be.\n\nLADY WINDERMERE.  Arthur, Arthur, don’t talk so bitterly about any woman.\nI don’t think now that people can be divided into the good and the bad as\nthough they were two separate races or creations.  What are called good\nwomen may have terrible things in them, mad moods of recklessness,\nassertion, jealousy, sin.  Bad women, as they are termed, may have in\nthem sorrow, repentance, pity, sacrifice.  And I don’t think Mrs. Erlynne\na bad woman—I know she’s not.\n\nLORD WINDERMERE.  My dear child, the woman’s impossible.  No matter what\nharm she tries to do us, you must never see her again.  She is\ninadmissible anywhere.\n\nLADY WINDERMERE.  But I want to see her.  I want her to come here.\n\nLORD WINDERMERE.  Never!\n\nLADY WINDERMERE.  She came here once as _your_ guest.  She must come now\nas _mine_.  That is but fair.\n\nLORD WINDERMERE.  She should never have come here.\n\nLADY WINDERMERE.  [_Rising_.]  It is too late, Arthur, to say that now.\n[_Moves away_.]\n\nLORD WINDERMERE.  [_Rising_.]  Margaret, if you knew where Mrs. Erlynne\nwent last night, after she left this house, you would not sit in the same\nroom with her.  It was absolutely shameless, the whole thing.\n\nLADY WINDERMERE.  Arthur, I can’t bear it any longer.  I must tell you.\nLast night—\n\n[_Enter_ PARKER _with a tray on which lie_ LADY WINDERMERE’S _fan and a\ncard_.]\n\nPARKER.  Mrs. Erlynne has called to return your ladyship’s fan which she\ntook away by mistake last night.  Mrs. Erlynne has written a message on\nthe card.\n\nLADY WINDERMERE.  Oh, ask Mrs. Erlynne to be kind enough to come up.\n[_Reads card_.]  Say I shall be very glad to see her.\n\n                                                          [_Exit_ PARKER.]\n\nShe wants to see me, Arthur.\n\nLORD WINDERMERE.  [_Takes card and looks at it_.]  Margaret, I _beg_ you\nnot to.  Let me see her first, at any rate.  She’s a very dangerous\nwoman.  She is the most dangerous woman I know.  You don’t realise what\nyou’re doing.\n\nLADY WINDERMERE.  It is right that I should see her.\n\nLORD WINDERMERE.  My child, you may be on the brink of a great sorrow.\nDon’t go to meet it.  It is absolutely necessary that I should see her\nbefore you do.\n\nLADY WINDERMERE.  Why should it be necessary?\n\n[_Enter_ PARKER.]\n\nPARKER.  Mrs. Erlynne.\n\n[_Enter_ MRS. ERLYNNE.]\n\n                                                          [_Exit_ PARKER.]\n\nMRS. ERLYNNE.  How do you do, Lady Windermere?  [_To_ LORD WINDERMERE.]\nHow do you do?  Do you know, Lady Windermere, I am so sorry about your\nfan.  I can’t imagine how I made such a silly mistake.  Most stupid of\nme.  And as I was driving in your direction, I thought I would take the\nopportunity of returning your property in person with many apologies for\nmy carelessness, and of bidding you good-bye.\n\nLADY WINDERMERE.  Good-bye?  [_Moves towards sofa with_ MRS. ERLYNNE _and\nsits down beside her_.]  Are you going away, then, Mrs. Erlynne?\n\nMRS. ERLYNNE.  Yes; I am going to live abroad again.  The English climate\ndoesn’t suit me.  My—heart is affected here, and that I don’t like.  I\nprefer living in the south.  London is too full of fogs and—and serious\npeople, Lord Windermere.  Whether the fogs produce the serious people or\nwhether the serious people produce the fogs, I don’t know, but the whole\nthing rather gets on my nerves, and so I’m leaving this afternoon by the\nClub Train.\n\nLADY WINDERMERE.  This afternoon?  But I wanted so much to come and see\nyou.\n\nMRS. ERLYNNE.  How kind of you!  But I am afraid I have to go.\n\nLADY WINDERMERE.  Shall I never see you again, Mrs. Erlynne?\n\nMRS. ERLYNNE.  I am afraid not.  Our lives lie too far apart.  But there\nis a little thing I would like you to do for me.  I want a photograph of\nyou, Lady Windermere—would you give me one?  You don’t know how gratified\nI should be.\n\nLADY WINDERMERE.  Oh, with pleasure.  There is one on that table.  I’ll\nshow it to you. [_Goes across to the table_.]\n\nLORD WINDERMERE.  [_Coming up to_ MRS. ERLYNNE _and speaking in a low\nvoice_.]  It is monstrous your intruding yourself here after your conduct\nlast night.\n\nMRS. ERLYNNE.  [_With an amused smile_.]  My dear Windermere, manners\nbefore morals!\n\nLADY WINDERMERE.  [_Returning_.]  I’m afraid it is very flattering—I am\nnot so pretty as that.  [_Showing photograph_.]\n\nMRS. ERLYNNE.  You are much prettier.  But haven’t you got one of\nyourself with your little boy?\n\nLADY WINDERMERE.  I have.  Would you prefer one of those?\n\nMRS. ERLYNNE.  Yes.\n\nLADY WINDERMERE.  I’ll go and get it for you, if you’ll excuse me for a\nmoment.  I have one upstairs.\n\nMRS. ERLYNNE.  So sorry, Lady Windermere, to give you so much trouble.\n\nLADY WINDERMERE.  [_Moves to door R._]  No trouble at all, Mrs. Erlynne.\n\nMRS. ERLYNNE.  Thanks so much.\n\n[_Exit_ LADY WINDERMERE _R._]  You seem rather out of temper this\nmorning, Windermere.  Why should you be?  Margaret and I get on\ncharmingly together.\n\nLORD WINDERMERE.  I can’t bear to see you with her.  Besides, you have\nnot told me the truth, Mrs. Erlynne.\n\nMRS. ERLYNNE.  I have not told _her_ the truth, you mean.\n\nLORD WINDERMERE.  [_Standing C._]  I sometimes wish you had.  I should\nhave been spared then the misery, the anxiety, the annoyance of the last\nsix months.  But rather than my wife should know—that the mother whom she\nwas taught to consider as dead, the mother whom she has mourned as dead,\nis living—a divorced woman, going about under an assumed name, a bad\nwoman preying upon life, as I know you now to be—rather than that, I was\nready to supply you with money to pay bill after bill, extravagance after\nextravagance, to risk what occurred yesterday, the first quarrel I have\never had with my wife.  You don’t understand what that means to me.  How\ncould you?  But I tell you that the only bitter words that ever came from\nthose sweet lips of hers were on your account, and I hate to see you next\nher.  You sully the innocence that is in her. [_Moves L.C._]  And then I\nused to think that with all your faults you were frank and honest.  You\nare not.\n\nMRS. ERLYNNE.  Why do you say that?\n\nLORD WINDERMERE.  You made me get you an invitation to my wife’s ball.\n\nMRS. ERLYNNE.  For my daughter’s ball—yes.\n\nLORD WINDERMERE.  You came, and within an hour of your leaving the house\nyou are found in a man’s rooms—you are disgraced before every one.\n[_Goes up stage C._]\n\nMRS. ERLYNNE.  Yes.\n\nLORD WINDERMERE.  [_Turning round on her_.]  Therefore I have a right to\nlook upon you as what you are—a worthless, vicious woman.  I have the\nright to tell you never to enter this house, never to attempt to come\nnear my wife—\n\nMRS. ERLYNNE.  [_Coldly_.]  My daughter, you mean.\n\nLORD WINDERMERE.  You have no right to claim her as your daughter.  You\nleft her, abandoned her when she was but a child in the cradle, abandoned\nher for your lover, who abandoned you in turn.\n\nMRS. ERLYNNE.  [_Rising_.]  Do you count that to his credit, Lord\nWindermere—or to mine?\n\nLORD WINDERMERE.  To his, now that I know you.\n\nMRS. ERLYNNE.  Take care—you had better be careful.\n\nLORD WINDERMERE.  Oh, I am not going to mince words for you.  I know you\nthoroughly.\n\nMRS. ERLYNNE.  [_Looks steadily at him_.]  I question that.\n\nLORD WINDERMERE.  I _do_ know you.  For twenty years of your life you\nlived without your child, without a thought of your child.  One day you\nread in the papers that she had married a rich man.  You saw your hideous\nchance.  You knew that to spare her the ignominy of learning that a woman\nlike you was her mother, I would endure anything.  You began your\nblackmailing.\n\nMRS. ERLYNNE.  [_Shrugging her shoulders_.]  Don’t use ugly words,\nWindermere.  They are vulgar.  I saw my chance, it is true, and took it.\n\nLORD WINDERMERE.  Yes, you took it—and spoiled it all last night by being\nfound out.\n\nMRS. ERLYNNE.  [_With a strange smile_.]  You are quite right, I spoiled\nit all last night.\n\nLORD WINDERMERE.  And as for your blunder in taking my wife’s fan from\nhere and then leaving it about in Darlington’s rooms, it is unpardonable.\nI can’t bear the sight of it now.  I shall never let my wife use it\nagain.  The thing is soiled for me.  You should have kept it and not\nbrought it back.\n\nMRS. ERLYNNE.  I think I shall keep it.  [_Goes up_.]  It’s extremely\npretty.  [_Takes up fan_.]  I shall ask Margaret to give it to me.\n\nLORD WINDERMERE.  I hope my wife will give it you.\n\nMRS. ERLYNNE.  Oh, I’m sure she will have no objection.\n\nLORD WINDERMERE.  I wish that at the same time she would give you a\nminiature she kisses every night before she prays—It’s the miniature of a\nyoung innocent-looking girl with beautiful _dark_ hair.\n\nMRS. ERLYNNE.  Ah, yes, I remember.  How long ago that seems!  [_Goes to\nsofa and sits down_.]  It was done before I was married.  Dark hair and\nan innocent expression were the fashion then, Windermere!  [_A pause_.]\n\nLORD WINDERMERE.  What do you mean by coming here this morning?  What is\nyour object?  [_Crossing L.C. and sitting_.]\n\nMRS. ERLYNNE.  [_With a note of irony in her voice_.]  To bid good-bye to\nmy dear daughter, of course.  [LORD WINDERMERE _bites his under lip in\nanger_.  MRS. ERLYNNE _looks at him_, _and her voice and manner become\nserious_.  _In her accents at she talks there is a note of deep tragedy_.\n_For a moment she reveals herself_.]  Oh, don’t imagine I am going to\nhave a pathetic scene with her, weep on her neck and tell her who I am,\nand all that kind of thing.  I have no ambition to play the part of a\nmother.  Only once in my life have I known a mother’s feelings.  That was\nlast night.  They were terrible—they made me suffer—they made me suffer\ntoo much.  For twenty years, as you say, I have lived childless,—I want\nto live childless still.  [_Hiding her feelings with a trivial laugh_.]\nBesides, my dear Windermere, how on earth could I pose as a mother with a\ngrown-up daughter?  Margaret is twenty-one, and I have never admitted\nthat I am more than twenty-nine, or thirty at the most.  Twenty-nine when\nthere are pink shades, thirty when there are not.  So you see what\ndifficulties it would involve.  No, as far as I am concerned, let your\nwife cherish the memory of this dead, stainless mother.  Why should I\ninterfere with her illusions?  I find it hard enough to keep my own.  I\nlost one illusion last night.  I thought I had no heart.  I find I have,\nand a heart doesn’t suit me, Windermere.  Somehow it doesn’t go with\nmodern dress.  It makes one look old.  [_Takes up hand-mirror from table\nand looks into it_.]  And it spoils one’s career at critical moments.\n\nLORD WINDERMERE.  You fill me with horror—with absolute horror.\n\nMRS. ERLYNNE.  [_Rising_.]  I suppose, Windermere, you would like me to\nretire into a convent, or become a hospital nurse, or something of that\nkind, as people do in silly modern novels.  That is stupid of you,\nArthur; in real life we don’t do such things—not as long as we have any\ngood looks left, at any rate.  No—what consoles one nowadays is not\nrepentance, but pleasure.  Repentance is quite out of date.  And besides,\nif a woman really repents, she has to go to a bad dressmaker, otherwise\nno one believes in her.  And nothing in the world would induce me to do\nthat.  No; I am going to pass entirely out of your two lives.  My coming\ninto them has been a mistake—I discovered that last night.\n\nLORD WINDERMERE.  A fatal mistake.\n\nMRS. ERLYNNE.  [_Smiling_.]  Almost fatal.\n\nLORD WINDERMERE.  I am sorry now I did not tell my wife the whole thing\nat once.\n\nMRS. ERLYNNE.  I regret my bad actions.  You regret your good ones—that\nis the difference between us.\n\nLORD WINDERMERE.  I don’t trust you.  I _will_ tell my wife.  It’s better\nfor her to know, and from me.  It will cause her infinite pain—it will\nhumiliate her terribly, but it’s right that she should know.\n\nMRS. ERLYNNE.  You propose to tell her?\n\nLORD WINDERMERE.  I am going to tell her.\n\nMRS. ERLYNNE.  [_Going up to him_.]  If you do, I will make my name so\ninfamous that it will mar every moment of her life.  It will ruin her,\nand make her wretched.  If you dare to tell her, there is no depth of\ndegradation I will not sink to, no pit of shame I will not enter.  You\nshall not tell her—I forbid you.\n\nLORD WINDERMERE.  Why?\n\nMRS. ERLYNNE.  [_After a pause_.]  If I said to you that I cared for her,\nperhaps loved her even—you would sneer at me, wouldn’t you?\n\nLORD WINDERMERE.  I should feel it was not true.  A mother’s love means\ndevotion, unselfishness, sacrifice.  What could you know of such things?\n\nMRS. ERLYNNE.  You are right.  What could I know of such things?  Don’t\nlet us talk any more about it—as for telling my daughter who I am, that I\ndo not allow.  It is my secret, it is not yours.  If I make up my mind to\ntell her, and I think I will, I shall tell her before I leave the\nhouse—if not, I shall never tell her.\n\nLORD WINDERMERE.  [_Angrily_.]  Then let me beg of you to leave our house\nat once.  I will make your excuses to Margaret.\n\n[_Enter_ LADY WINDERMERE _R._  _She goes over to_ MRS. ERLYNNE _with the\nphotograph in her hand_.  LORD WINDERMERE _moves to back of sofa_, _and\nanxiously watches_ MRS. ERLYNNE _as the scene progresses_.]\n\nLADY WINDERMERE.  I am so sorry, Mrs. Erlynne, to have kept you waiting.\nI couldn’t find the photograph anywhere.  At last I discovered it in my\nhusband’s dressing-room—he had stolen it.\n\nMRS. ERLYNNE.  [_Takes the photograph from her and looks at it_.]  I am\nnot surprised—it is charming.  [_Goes over to sofa with_ LADY WINDERMERE,\n_and sits down beside her_.  _Looks again at the photograph_.]  And so\nthat is your little boy!  What is he called?\n\nLADY WINDERMERE.  Gerard, after my dear father.\n\nMRS. ERLYNNE.  [_Laying the photograph down_.]  Really?\n\nLADY WINDERMERE.  Yes.  If it had been a girl, I would have called it\nafter my mother.  My mother had the same name as myself, Margaret.\n\nMRS. ERLYNNE.  My name is Margaret too.\n\nLADY WINDERMERE.  Indeed!\n\nMRS. ERLYNNE.  Yes.  [_Pause_.]  You are devoted to your mother’s memory,\nLady Windermere, your husband tells me.\n\nLADY WINDERMERE.  We all have ideals in life.  At least we all should\nhave.  Mine is my mother.\n\nMRS. ERLYNNE.  Ideals are dangerous things.  Realities are better.  They\nwound, but they’re better.\n\nLADY WINDERMERE.  [_Shaking her head_.]  If I lost my ideals, I should\nlose everything.\n\nMRS. ERLYNNE.  Everything?\n\nLADY WINDERMERE.  Yes.  [_Pause_.]\n\nMRS. ERLYNNE.  Did your father often speak to you of your mother?\n\nLADY WINDERMERE.  No, it gave him too much pain.  He told me how my\nmother had died a few months after I was born.  His eyes filled with\ntears as he spoke.  Then he begged me never to mention her name to him\nagain.  It made him suffer even to hear it.  My father—my father really\ndied of a broken heart.  His was the most ruined life know.\n\nMRS. ERLYNNE.  [_Rising_.]  I am afraid I must go now, Lady Windermere.\n\nLADY WINDERMERE.  [_Rising_.]  Oh no, don’t.\n\nMRS. ERLYNNE.  I think I had better.  My carriage must have come back by\nthis time.  I sent it to Lady Jedburgh’s with a note.\n\nLADY WINDERMERE.  Arthur, would you mind seeing if Mrs. Erlynne’s\ncarriage has come back?\n\nMRS. ERLYNNE.  Pray don’t trouble, Lord Windermere.\n\nLADY WINDERMERE.  Yes, Arthur, do go, please.\n\n[LORD WINDERMERE _hesitated for a moment and looks at_ MRS. ERLYNNE.\n_She remains quite impassive_.  _He leaves the room_.]\n\n[_To_ MRS. ERLYNNE.]  Oh!  What am I to say to you?  You saved me last\nnight?  [_Goes towards her_.]\n\nMRS. ERLYNNE.  Hush—don’t speak of it.\n\nLADY WINDERMERE.  I must speak of it.  I can’t let you think that I am\ngoing to accept this sacrifice.  I am not.  It is too great.  I am going\nto tell my husband everything.  It is my duty.\n\nMRS. ERLYNNE.  It is not your duty—at least you have duties to others\nbesides him.  You say you owe me something?\n\nLADY WINDERMERE.  I owe you everything.\n\nMRS. ERLYNNE.  Then pay your debt by silence.  That is the only way in\nwhich it can be paid.  Don’t spoil the one good thing I have done in my\nlife by telling it to any one.  Promise me that what passed last night\nwill remain a secret between us.  You must not bring misery into your\nhusband’s life.  Why spoil his love?  You must not spoil it.  Love is\neasily killed.  Oh! how easily love is killed.  Pledge me your word, Lady\nWindermere, that you will never tell him.  I insist upon it.\n\nLADY WINDERMERE.  [_With bowed head_.]  It is your will, not mine.\n\nMRS. ERLYNNE.  Yes, it is my will.  And never forget your child—I like to\nthink of you as a mother.  I like you to think of yourself as one.\n\nLADY WINDERMERE.  [_Looking up_.]  I always will now.  Only once in my\nlife I have forgotten my own mother—that was last night.  Oh, if I had\nremembered her I should not have been so foolish, so wicked.\n\nMRS. ERLYNNE.  [_With a slight shudder_.]  Hush, last night is quite\nover.\n\n[_Enter_ LORD WINDERMERE.]\n\nLORD WINDERMERE.  Your carriage has not come back yet, Mrs. Erlynne.\n\nMRS. ERLYNNE.  It makes no matter.  I’ll take a hansom.  There is nothing\nin the world so respectable as a good Shrewsbury and Talbot.  And now,\ndear Lady Windermere, I am afraid it is really good-bye.  [_Moves up C._]\nOh, I remember.  You’ll think me absurd, but do you know I’ve taken a\ngreat fancy to this fan that I was silly enough to run away with last\nnight from your ball.  Now, I wonder would you give it to me?  Lord\nWindermere says you may.  I know it is his present.\n\nLADY WINDERMERE.  Oh, certainly, if it will give you any pleasure.  But\nit has my name on it.  It has ‘Margaret’ on it.\n\nMRS. ERLYNNE.  But we have the same Christian name.\n\nLADY WINDERMERE.  Oh, I forgot.  Of course, do have it.  What a wonderful\nchance our names being the same!\n\nMRS. ERLYNNE.  Quite wonderful.  Thanks—it will always remind me of you.\n[_Shakes hands with her_.]\n\n[_Enter_ PARKER.]\n\nPARKER.  Lord Augustus Lorton.  Mrs. Erlynne’s carriage has come.\n\n[_Enter_ LORD AUGUSTUS.]\n\nLORD AUGUSTUS.  Good morning, dear boy.  Good morning, Lady Windermere.\n[_Sees_ MRS. ERLYNNE.]  Mrs. Erlynne!\n\nMRS. ERLYNNE.  How do you do, Lord Augustus?  Are you quite well this\nmorning?\n\nLORD AUGUSTUS.  [_Coldly_.]  Quite well, thank you, Mrs. Erlynne.\n\nMRS. ERLYNNE.  You don’t look at all well, Lord Augustus.  You stop up\ntoo late—it is so bad for you.  You really should take more care of\nyourself.  Good-bye, Lord Windermere. [_Goes towards door with a bow to_\nLORD AUGUSTUS.  _Suddenly smiles and looks back at him_.]  Lord Augustus!\nWon’t you see me to my carriage?  You might carry the fan.\n\nLORD WINDERMERE.  Allow me!\n\nMRS. ERLYNNE.  No; I want Lord Augustus.  I have a special message for\nthe dear Duchess.  Won’t you carry the fan, Lord Augustus?\n\nLORD AUGUSTUS.  If you really desire it, Mrs. Erlynne.\n\nMRS. ERLYNNE.  [_Laughing_.]  Of course I do.  You’ll carry it so\ngracefully.  You would carry off anything gracefully, dear Lord Augustus.\n\n[_When she reaches the door she looks back for a moment at_ LADY\nWINDERMERE.  _Their eyes meet_.  _Then she turns_, _and exit C. followed\nby_ LORD AUGUSTUS.]\n\nLADY WINDERMERE.  You will never speak against Mrs. Erlynne again,\nArthur, will you?\n\nLORD WINDERMERE.  [_Gravely_.]  She is better than one thought her.\n\nLADY WINDERMERE.  She is better than I am.\n\nLORD WINDERMERE.  [_Smiling as he strokes her hair_.]  Child, you and she\nbelong to different worlds.  Into your world evil has never entered.\n\nLADY WINDERMERE.  Don’t say that, Arthur.  There is the same world for\nall of us, and good and evil, sin and innocence, go through it hand in\nhand.  To shut one’s eyes to half of life that one may live securely is\nas though one blinded oneself that one might walk with more safety in a\nland of pit and precipice.\n\nLORD WINDERMERE.  [_Moves down with her_.]  Darling, why do you say that?\n\nLADY WINDERMERE.  [_Sits on sofa_.]  Because I, who had shut my eyes to\nlife, came to the brink.  And one who had separated us—\n\nLORD WINDERMERE.  We were never separated.\n\nLADY WINDERMERE.  We never must be again.  O Arthur, don’t love me less,\nand I will trust you more.  I will trust you absolutely.  Let us go to\nSelby.  In the Rose Garden at Selby the roses are white and red.\n\n[_Enter_ LORD AUGUSTUS _C._]\n\nLORD AUGUSTUS.  Arthur, she has explained everything!\n\n[LADY WINDERMERE _looks horribly frightened at this_.  LORD WINDERMERE\n_starts_.  LORD AUGUSTUS _takes_ WINDERMERE _by the arm and brings him to\nfront of stage_.  _He talks rapidly and in a low voice_.  LADY WINDERMERE\n_stands watching them in terror_.]  My dear fellow, she has explained\nevery demmed thing.  We all wronged her immensely.  It was entirely for\nmy sake she went to Darlington’s rooms.  Called first at the Club—fact\nis, wanted to put me out of suspense—and being told I had gone\non—followed—naturally frightened when she heard a lot of us coming\nin—retired to another room—I assure you, most gratifying to me, the whole\nthing.  We all behaved brutally to her.  She is just the woman for me.\nSuits me down to the ground.  All the conditions she makes are that we\nlive entirely out of England.  A very good thing too.  Demmed clubs,\ndemmed climate, demmed cooks, demmed everything.  Sick of it all!\n\nLADY WINDERMERE.  [_Frightened_.]  Has Mrs. Erlynne—?\n\nLORD AUGUSTUS.  [_Advancing towards her with a low bow_.]  Yes, Lady\nWindermere—  Mrs. Erlynne has done me the honour of accepting my hand.\n\nLORD WINDERMERE.  Well, you are certainly marrying a very clever woman!\n\nLADY WINDERMERE.  [_Taking her husband’s hand_.]  Ah, you’re marrying a\nvery good woman!\n\n                                * * * * *\n\n                                 CURTAIN", "title": "Lady Windermere's Fan"}