{"summary": "The narrator of the story is a British journalist in India—Kipling himself, in all but name. While on a tour of some Indian native states he meets two scruffy adventurers, Daniel Dravot and Peachey Carnehan. He rather likes them, but then stops them from blackmailing a minor rajah. A few months later they appear at his office in Lahore. They tell him their plan. They have been \"Soldier, sailor, compositor [typesetter], photographer... [railroad] engine-drivers, petty contractors,\" and more, and have decided India is not big enough for them. The next day they will go off to Kafiristan to set themselves up as kings. Dravot can pass as a native, and they have twenty Martini-Henry rifles (then perhaps the best in the world). They plan to find a king or chief, help him defeat his enemies, then take over for themselves. They ask the narrator for the use of any books or maps of the area–as a favour, because they are fellow Freemasons, and because he spoiled their blackmail scheme.\nTwo years later, on a scorching hot summer night, Carnehan creeps into the narrator's office. He is a broken man, a crippled beggar clad in rags and he tells an amazing story. Dravot and Carnehan succeeded in becoming kings: finding the Kafirs, who turn out to be white (\"so hairy and white and fair it was just shaking hands with old friends\"), mustering an army, taking over villages, and dreaming of building a unified nation. The Kafirs (pagans, not Muslims) were impressed by the rifles and Dravot's lack of fear of their idols, and acclaimed him as a god, the reincarnation or descendant of Alexander the Great. The Kafirs practised a form of Masonic ritual, and Dravot's reputation was further cemented when he showed knowledge of Masonic secrets that only the oldest priest remembered.\nTheir schemes were dashed when Dravot decided to marry a Kafir girl. Terrified at marrying a god, the girl bit Dravot when he tried to kiss her. Seeing him bleed, the priests cried that he was \"Neither God nor Devil but a man!\" Most of the Kafirs turned against Dravot and Carnehan. A few of his men remained loyal, but the army defected and the two kings were captured.\nDravot, wearing his crown, stood on a rope bridge over a gorge while the Kafirs cut the ropes, and he fell to his death. Carnehan was crucified between two pine trees. When he survived for a day, the Kafirs considered it a miracle and let him go. He begged his way back to India.\nAs proof of his tale, Carnehan shows the narrator Dravot's head, still wearing the golden crown. Carnehan leaves carrying the head. The next day the narrator sees him crawling along the road in the noon sun, with his hat off and gone mad. The narrator sends him to the local asylum. When he inquires two days later, he learns that Carnehan has died of sunstroke (\"half an hour bare-headed in the sun at mid-day...\"). No belongings were found with him.\n\n", "full_text": "The Man Who Would be King\n\n          By\n\n      Rudyard Kipling\n\n\n\n\nPublished by Brentano's at 31 Union Square New York\n\n  THE MAN WHO WOULD\n               BE KING\n\n\"Brother to a Prince and fellow to a beggar if he be found worthy.\"\n\nThe Law, as quoted, lays down a fair conduct of life, and one not easy\nto follow. I have been fellow to a beggar again and again under\ncircumstances which prevented either of us finding out whether the\nother was worthy. I have still to be brother to a Prince, though I once\ncame near to kinship with what might have been a veritable King and was\npromised the reversion of a Kingdom--army, law-courts, revenue and\npolicy all complete. But, to-day, I greatly fear that my King is dead,\nand if I want a crown I must go and hunt it for myself.\n\nThe beginning of everything was in a railway train upon the road to\nMhow from Ajmir. There had been a deficit in the Budget, which\nnecessitated travelling, not Second-class, which is only half as dear\nas First-class, but by Intermediate, which is very awful indeed. There\nare no cushions in the Intermediate class, and the population are\neither Intermediate, which is Eurasian, or native, which for a long\nnight journey is nasty; or Loafer, which is amusing though intoxicated.\nIntermediates do not patronize refreshment-rooms. They carry their food\nin bundles and pots, and buy sweets from the native sweetmeat-sellers,\nand drink the roadside water. That is why in the hot weather\nIntermediates are taken out of the carriages dead, and in all weathers\nare most properly looked down upon.\n\nMy particular Intermediate happened to be empty till I reached\nNasirabad, when a huge gentleman in shirt-sleeves entered, and,\nfollowing the custom of Intermediates, passed the time of day. He was a\nwanderer and a vagabond like myself, but with an educated taste for\nwhiskey. He told tales of things he had seen and done, of\nout-of-the-way corners of the Empire into which he had penetrated, and\nof adventures in which he risked his life for a few days' food. \"If\nIndia was filled with men like you and me, not knowing more than the\ncrows where they'd get their next day's rations, it isn't seventy\nmillions of revenue the land would be paying--it's seven hundred\nmillion,\" said he; and as I looked at his mouth and chin I was disposed\nto agree with him. We talked politics--the politics of Loaferdom that\nsees things from the underside where the lath and plaster is not\nsmoothed off--and we talked postal arrangements because my friend\nwanted to send a telegram back from the next station to Ajmir, which is\nthe turning-off place from the Bombay to the Mhow line as you travel\nwestward. My friend had no money beyond eight annas which he wanted for\ndinner, and I had no money at all, owing to the hitch in the Budget\nbefore mentioned. Further, I was going into a wilderness where, though\nI should resume touch with the Treasury, there were no telegraph\noffices. I was, therefore, unable to help him in any way.\n\n\"We might threaten a Station-master, and make him send a wire on tick,\"\nsaid my friend, \"but that'd mean inquiries for you and for me, and I've\ngot my hands full these days. Did you say you are travelling back along\nthis line within any days?\"\n\n\"Within ten,\" I said.\n\n\"Can't you make it eight?\" said he. \"Mine is rather urgent business.\"\n\n\"I can send your telegram within ten days if that will serve you,\" I\nsaid.\n\n\"I couldn't trust the wire to fetch him now I think of it. It's this\nway. He leaves Delhi on the 23d for Bombay. That means he'll be running\nthrough Ajmir about the night of the 23d.\"\n\n\"But I'm going into the Indian Desert,\" I explained.\n\n\"Well and good,\" said he. \"You'll be changing at Marwar Junction to get\ninto Jodhpore territory--you must do that--and he'll be coming through\nMarwar Junction in the early morning of the 24th by the Bombay Mail.\nCan you be at Marwar Junction on that time? 'Twon't be inconveniencing\nyou because I know that there's precious few pickings to be got out of\nthese Central India States--even though you pretend to be correspondent\nof the Backwoodsman.\"\n\n\"Have you ever tried that trick?\" I asked.\n\n\"Again and again, but the Residents find you out, and then you get\nescorted to the Border before you've time to get your knife into them.\nBut about my friend here. I must give him a word o' mouth to tell him\nwhat's come to me or else he won't know where to go. I would take it\nmore than kind of you if you was to come out of Central India in time\nto catch him at Marwar Junction, and say to him:--'He has gone South\nfor the week.' He'll know what that means. He's a big man with a red\nbeard, and a great swell he is. You'll find him sleeping like a\ngentleman with all his luggage round him in a second-class compartment.\nBut don't you be afraid. Slip down the window, and say:--'He has gone\nSouth for the week,' and he'll tumble. It's only cutting your time of\nstay in those parts by two days. I ask you as a stranger--going to the\nWest,\" he said with emphasis.\n\n\"Where have you come from?\" said I.\n\n\"From the East,\" said he, \"and I am hoping that you will give him the\nmessage on the Square--for the sake of my Mother as well as your own.\"\n\nEnglishmen are not usually softened by appeals to the memory of their\nmothers, but for certain reasons, which will be fully apparent, I saw\nfit to agree.\n\n\"It's more than a little matter,\" said he, \"and that's why I ask you to\ndo it--and now I know that I can depend on you doing it. A second-class\ncarriage at Marwar Junction, and a red-haired man asleep in it. You'll\nbe sure to remember. I get out at the next station, and I must hold on\nthere till he comes or sends me what I want.\"\n\n\"I'll give the message if I catch him,\" I said, \"and for the sake of\nyour Mother as well as mine I'll give you a word of advice. Don't try\nto run the Central India States just now as the correspondent of the\nBackwoodsman. There's a real one knocking about here, and it might lead\nto trouble.\"\n\n\"Thank you,\" said he simply, \"and when will the swine be gone? I can't\nstarve because he's ruining my work. I wanted to get hold of the\nDegumber Rajah down here about his father's widow, and give him a jump.\"\n\n\"What did he do to his father's widow, then?\"\n\n\"Filled her up with red pepper and slippered her to death as she hung\nfrom a beam. I found that out myself and I'm the only man that would\ndare going into the State to get hush-money for it. They'll try to\npoison me, same as they did in Chortumna when I went on the loot there.\nBut you'll give the man at Marwar Junction my message?\"\n\nHe got out at a little roadside station, and I reflected. I had heard,\nmore than once, of men personating correspondents of newspapers and\nbleeding small Native States with threats of exposure, but I had never\nmet any of the caste before. They lead a hard life, and generally die\nwith great suddenness. The Native States have a wholesome horror of\nEnglish newspapers, which may throw light on their peculiar methods of\ngovernment, and do their best to choke correspondents with champagne,\nor drive them out of their mind with four-in-hand barouches. They do\nnot understand that nobody cares a straw for the internal\nadministration of Native States so long as oppression and crime are\nkept within decent limits, and the ruler is not drugged, drunk, or\ndiseased from one end of the year to the other. Native States were\ncreated by Providence in order to supply picturesque scenery, tigers\nand tall-writing. They are the dark places of the earth, full of\nunimaginable cruelty, touching the Railway and the Telegraph on one\nside, and, on the other, the days of Harun-al-Raschid. When I left the\ntrain I did business with divers Kings, and in eight days passed\nthrough many changes of life. Sometimes I wore dress-clothes and\nconsorted with Princes and Politicals, drinking from crystal and eating\nfrom silver. Sometimes I lay out upon the ground and devoured what I\ncould get, from a plate made of a flapjack, and drank the running\nwater, and slept under the same rug as my servant. It was all in a\nday's work.\n\nThen I headed for the Great Indian Desert upon the proper date, as I\nhad promised, and the night Mail set me down at Marwar Junction, where\na funny little, happy-go-lucky, native managed railway runs to\nJodhpore. The Bombay Mail from Delhi makes a short halt at Marwar. She\narrived as I got in, and I had just time to hurry to her platform and\ngo down the carriages. There was only one second-class on the train. I\nslipped the window and looked down upon a flaming red beard, half\ncovered by a railway rug. That was my man, fast asleep, and I dug him\ngently in the ribs. He woke with a grunt and I saw his face in the\nlight of the lamps. It was a great and shining face.\n\n\"Tickets again?\" said he.\n\n\"No,\" said I. \"I am to tell you that he is gone South for the week. He\nis gone South for the week!\"\n\nThe train had begun to move out. The red man rubbed his eyes. \"He has\ngone South for the week,\" he repeated. \"Now that's just like his\nimpudence. Did he say that I was to give you anything?--'Cause I won't.\"\n\n\"He didn't,\" I said and dropped away, and watched the red lights die\nout in the dark. It was horribly cold because the wind was blowing off\nthe sands. I climbed into my own train--not an Intermediate Carriage\nthis time--and went to sleep.\n\nIf the man with the beard had given me a rupee I should have kept it as\na memento of a rather curious affair. But the consciousness of having\ndone my duty was my only reward.\n\nLater on I reflected that two gentlemen like my friends could not do\nany good if they foregathered and personated correspondents of\nnewspapers, and might, if they \"stuck up\" one of the little rat-trap\nstates of Central India or Southern Rajputana, get themselves into\nserious difficulties. I therefore took some trouble to describe them as\naccurately as I could remember to people who would be interested in\ndeporting them; and succeeded, so I was later informed, in having them\nheaded back from the Degumber borders.\n\nThen I became respectable, and returned to an Office where there were\nno Kings and no incidents except the daily manufacture of a newspaper.\nA newspaper office seems to attract every conceivable sort of person,\nto the prejudice of discipline. Zenana-mission ladies arrive, and beg\nthat the Editor will instantly abandon all his duties to describe a\nChristian prize-giving in a back-slum of a perfectly inaccessible\nvillage; Colonels who have been overpassed for commands sit down and\nsketch the outline of a series of ten, twelve, or twenty-four leading\narticles on Seniority versus Selection; missionaries wish to know why\nthey have not been permitted to escape from their regular vehicles of\nabuse and swear at a brother-missionary under special patronage of the\neditorial We; stranded theatrical companies troop up to explain that\nthey cannot pay for their advertisements, but on their return from New\nZealand or Tahiti will do so with interest; inventors of patent\npunkah-pulling machines, carriage couplings and unbreakable swords and\naxle-trees call with specifications in their pockets and hours at their\ndisposal; tea-companies enter and elaborate their prospectuses with the\noffice pens; secretaries of ball-committees clamor to have the glories\nof their last dance more fully expounded; strange ladies rustle in and\nsay:--\"I want a hundred lady's cards printed at once, please,\" which is\nmanifestly part of an Editor's duty; and every dissolute ruffian that\never tramped the Grand Trunk Road makes it his business to ask for\nemployment as a proof-reader. And, all the time, the telephone-bell is\nringing madly, and Kings are being killed on the Continent, and Empires\nare saying, \"You're another,\" and Mister Gladstone is calling down\nbrimstone upon the British Dominions, and the little black copy-boys\nare whining, \"kaa-pi chayha-yeh\" (copy wanted) like tired bees, and\nmost of the paper is as blank as Modred's shield.\n\nBut that is the amusing part of the year. There are other six months\nwherein none ever come to call, and the thermometer walks inch by inch\nup to the top of the glass, and the office is darkened to just above\nreading light, and the press machines are red-hot of touch, and nobody\nwrites anything but accounts of amusements in the Hill-stations or\nobituary notices. Then the telephone becomes a tinkling terror, because\nit tells you of the sudden deaths of men and women that you knew\nintimately, and the prickly-heat covers you as with a garment, and you\nsit down and write:--\"A slight increase of sickness is reported from\nthe Khuda Janta Khan District. The outbreak is purely sporadic in its\nnature, and, thanks to the energetic efforts of the District\nauthorities, is now almost at an end. It is, however, with deep regret\nwe record the death, etc.\"\n\nThen the sickness really breaks out, and the less recording and\nreporting the better for the peace of the subscribers. But the Empires\nand the Kings continue to divert themselves as selfishly as before, and\nthe foreman thinks that a daily paper really ought to come out once in\ntwenty-four hours, and all the people at the Hill-stations in the\nmiddle of their amusements say:--\"Good gracious! Why can't the paper be\nsparkling? I'm sure there's plenty going on up here.\"\n\nThat is the dark half of the moon, and, as the advertisements say,\n\"must be experienced to be appreciated.\"\n\nIt was in that season, and a remarkably evil season, that the paper\nbegan running the last issue of the week on Saturday night, which is to\nsay Sunday morning, after the custom of a London paper. This was a\ngreat convenience, for immediately after the paper was put to bed, the\ndawn would lower the thermometer from 96 deg. to almost 84 deg. for almost half\nan hour, and in that chill--you have no idea how cold is 84 deg. on the\ngrass until you begin to pray for it--a very tired man could set off to\nsleep ere the heat roused him.\n\nOne Saturday night it was my pleasant duty to put the paper to bed\nalone. A King or courtier or a courtesan or a community was going to\ndie or get a new Constitution, or do something that was important on\nthe other side of the world, and the paper was to be held open till the\nlatest possible minute in order to catch the telegram. It was a pitchy\nblack night, as stifling as a June night can be, and the loo, the\nred-hot wind from the westward, was booming among the tinder-dry trees\nand pretending that the rain was on its heels. Now and again a spot of\nalmost boiling water would fall on the dust with the flop of a frog,\nbut all our weary world knew that was only pretence. It was a shade\ncooler in the press-room than the office, so I sat there, while the\ntype ticked and clicked, and the night-jars hooted at the windows, and\nthe all but naked compositors wiped the sweat from their foreheads and\ncalled for water. The thing that was keeping us back, whatever it was,\nwould not come off, though the loo dropped and the last type was set,\nand the whole round earth stood still in the choking heat, with its\nfinger on its lip, to wait the event. I drowsed, and wondered whether\nthe telegraph was a blessing, and whether this dying man, or struggling\npeople, was aware of the inconvenience the delay was causing. There was\nno special reason beyond the heat and worry to make tension, but, as\nthe clock-hands crept up to three o'clock and the machines spun their\nfly-wheels two and three times to see that all was in order, before I\nsaid the word that would set them off, I could have shrieked aloud.\n\nThen the roar and rattle of the wheels shivered the quiet into little\nbits. I rose to go away, but two men in white clothes stood in front of\nme. The first one said:--\"It's him!\" The second said--\"So it is!\" And\nthey both laughed almost as loudly as the machinery roared, and mopped\ntheir foreheads. \"We see there was a light burning across the road and\nwe were sleeping in that ditch there for coolness, and I said to my\nfriend here, the office is open. Let's come along and speak to him as\nturned us back from the Degumber State,\" said the smaller of the two.\nHe was the man I had met in the Mhow train, and his fellow was the\nred-bearded man of Marwar Junction. There was no mistaking the eyebrows\nof the one or the beard of the other.\n\nI was not pleased, because I wished to go to sleep, not to squabble\nwith loafers. \"What do you want?\" I asked.\n\n\"Half an hour's talk with you cool and comfortable, in the office,\"\nsaid the red-bearded man. \"We'd like some drink--the Contrack doesn't\nbegin yet, Peachey, so you needn't look--but what we really want is\nadvice. We don't want money. We ask you as a favor, because you did us\na bad turn about Degumber.\"\n\nI led from the press-room to the stifling office with the maps on the\nwalls, and the red-haired man rubbed his hands. \"That's something\nlike,\" said he. \"This was the proper shop to come to. Now, Sir, let me\nintroduce to you Brother Peachey Carnehan, that's him, and Brother\nDaniel Dravot, that is me, and the less said about our professions the\nbetter, for we have been most things in our time. Soldier, sailor,\ncompositor, photographer, proof-reader, street-preacher, and\ncorrespondents of the Backwoodsman when we thought the paper wanted\none. Carnehan is sober, and so am I. Look at us first and see that's\nsure. It will save you cutting into my talk. We'll take one of your\ncigars apiece, and you shall see us light.\" I watched the test. The men\nwere absolutely sober, so I gave them each a tepid peg.\n\n\"Well and good,\" said Carnehan of the eyebrows, wiping the froth from\nhis mustache. \"Let me talk now, Dan. We have been all over India,\nmostly on foot. We have been boiler-fitters, engine-drivers, petty\ncontractors, and all that, and we have decided that India isn't big\nenough for such as us.\"\n\nThey certainly were too big for the office. Dravot's beard seemed to\nfill half the room and Carnehan's shoulders the other half, as they sat\non the big table. Carnehan continued:--\"The country isn't half worked\nout because they that governs it won't let you touch it. They spend all\ntheir blessed time in governing it, and you can't lift a spade, nor\nchip a rock, nor look for oil, nor anything like that without all the\nGovernment saying--'Leave it alone and let us govern.' Therefore, such\nas it is, we will let it alone, and go away to some other place where a\nman isn't crowded and can come to his own. We are not little men, and\nthere is nothing that we are afraid of except Drink, and we have signed\na Contrack on that. Therefore, we are going away to be Kings.\"\n\n\"Kings in our own right,\" muttered Dravot.\n\n\"Yes, of course,\" I said. \"You've been tramping in the sun, and it's a\nvery warm night, and hadn't you better sleep over the notion? Come\nto-morrow.\"\n\n\"Neither drunk nor sunstruck,\" said Dravot. \"We have slept over the\nnotion half a year, and require to see Books and Atlases, and we have\ndecided that there is only one place now in the world that two strong\nmen can Sar-a-whack. They call it Kafiristan. By my reckoning its the\ntop right-hand corner of Afghanistan, not more than three hundred miles\nfrom Peshawar. They have two and thirty heathen idols there, and we'll\nbe the thirty-third. It's a mountainous country, and the women of those\nparts are very beautiful.\"\n\n\"But that is provided against in the Contrack,\" said Carnehan. \"Neither\nWomen nor Liquor, Daniel.\"\n\n\"And that's all we know, except that no one has gone there, and they\nfight, and in any place where they fight a man who knows how to drill\nmen can always be a King. We shall go to those parts and say to any\nKing we find--'D' you want to vanquish your foes?' and we will show him\nhow to drill men; for that we know better than anything else. Then we\nwill subvert that King and seize his Throne and establish a Dy-nasty.\"\n\n\"You'll be cut to pieces before you're fifty miles across the Border,\"\nI said. \"You have to travel through Afghanistan to get to that country.\nIt's one mass of mountains and peaks and glaciers, and no Englishman\nhas been through it. The people are utter brutes, and even if you\nreached them you couldn't do anything.\"\n\n\"That's more like,\" said Carnehan. \"If you could think us a little more\nmad we would be more pleased. We have come to you to know about this\ncountry, to read a book about it, and to be shown maps. We want you to\ntell us that we are fools and to show us your books.\" He turned to the\nbook-cases.\n\n\"Are you at all in earnest?\" I said.\n\n\"A little,\" said Dravot, sweetly. \"As big a map as you have got, even\nif it's all blank where Kafiristan is, and any books you've got. We can\nread, though we aren't very educated.\"\n\nI uncased the big thirty-two-miles-to-the-inch map of India, and two\nsmaller Frontier maps, hauled down volume INF-KAN of the Encyclopaedia\nBritannica, and the men consulted them.\n\n\"See here!\" said Dravot, his thumb on the map. \"Up to Jagdallak,\nPeachey and me know the road. We was there with Roberts's Army. We'll\nhave to turn off to the right at Jagdallak through Laghmann territory.\nThen we get among the hills--fourteen thousand feet--fifteen\nthousand--it will be cold work there, but it don't look very far on the\nmap.\"\n\nI handed him Wood on the Sources of the Oxus. Carnehan was deep in the\nEncyclopaedia.\n\n\"They're a mixed lot,\" said Dravot, reflectively; \"and it won't help us\nto know the names of their tribes. The more tribes the more they'll\nfight, and the better for us. From Jagdallak to Ashang. H'mm!\"\n\n\"But all the information about the country is as sketchy and inaccurate\nas can be,\" I protested. \"No one knows anything about it really. Here's\nthe file of the United Services' Institute. Read what Bellew says.\"\n\n\"Blow Bellew!\" said Carnehan. \"Dan, they're an all-fired lot of\nheathens, but this book here says they think they're related to us\nEnglish.\"\n\nI smoked while the men pored over Raverty, Wood, the maps and the\nEncyclopaedia.\n\n\"There is no use your waiting,\" said Dravot, politely. \"It's about four\no'clock now. We'll go before six o'clock if you want to sleep, and we\nwon't steal any of the papers. Don't you sit up. We're two harmless\nlunatics, and if you come, to-morrow evening, down to the Serai we'll\nsay good-by to you.\"\n\n\"You are two fools,\" I answered. \"You'll be turned back at the Frontier\nor cut up the minute you set foot in Afghanistan. Do you want any money\nor a recommendation down-country? I can help you to the chance of work\nnext week.\"\n\n\"Next week we shall be hard at work ourselves, thank you,\" said Dravot.\n\"It isn't so easy being a King as it looks. When we've got our Kingdom\nin going order we'll let you know, and you can come up and help us to\ngovern it.\"\n\n\"Would two lunatics make a Contrack like that!\" said Carnehan, with\nsubdued pride, showing me a greasy half-sheet of note-paper on which\nwas written the following. I copied it, then and there, as a\ncuriosity:--\n\nThis Contract between me and you persuing witnesseth in the name of\nGod--Amen and so forth.\n\n  (One) That me and you will settle this matter together:\n          i.e., to be Kings of Kafiristan.\n  (Two) That you and me will not while this matter is\n          being settled, look at any Liquor, nor any\n          Woman black, white or brown, so as to get\n          mixed up with one or the other harmful.\n  (Three) That we conduct ourselves with Dignity and\n          Discretion, and if one of us gets into trouble\n          the other will stay by him.\n\n  Signed by you and me this day.\n          Peachey Taliaferro Carnehan.\n          Daniel Dravot.\n          Both Gentlemen at Large.\n\n\"There was no need for the last article,\" said Carnehan, blushing\nmodestly; \"but it looks regular. Now you know the sort of men that\nloafers are--we are loafers, Dan, until we get out of India--and do you\nthink that we could sign a Contrack like that unless we was in earnest?\nWe have kept away from the two things that make life worth having.\"\n\n\"You won't enjoy your lives much longer if you are going to try this\nidiotic adventure. Don't set the office on fire,\" I said, \"and go away\nbefore nine o'clock.\"\n\nI left them still poring over the maps and making notes on the back of\nthe \"Contrack.\" \"Be sure to come down to the Serai to-morrow,\" were\ntheir parting words.\n\nThe Kumharsen Serai is the great four-square sink of humanity where the\nstrings of camels and horses from the North load and unload. All the\nnationalities of Central Asia may be found there, and most of the folk\nof India proper. Balkh and Bokhara there meet Bengal and Bombay, and\ntry to draw eye-teeth. You can buy ponies, turquoises, Persian\npussy-cats, saddle-bags, fat-tailed sheep and musk in the Kumharsen\nSerai, and get many strange things for nothing. In the afternoon I went\ndown there to see whether my friends intended to keep their word or\nwere lying about drunk.\n\nA priest attired in fragments of ribbons and rags stalked up to me,\ngravely twisting a child's paper whirligig. Behind him was his servant,\nbending under the load of a crate of mud toys. The two were loading up\ntwo camels, and the inhabitants of the Serai watched them with shrieks\nof laughter.\n\n\"The priest is mad,\" said a horse-dealer to me. \"He is going up to\nKabul to sell toys to the Amir. He will either be raised to honor or\nhave his head cut off. He came in here this morning and has been\nbehaving madly ever since.\"\n\n\"The witless are under the protection of God,\" stammered a flat-cheeked\nUsbeg in broken Hindi. \"They foretell future events.\"\n\n\"Would they could have foretold that my caravan would have been cut up\nby the Shinwaris almost within shadow of the Pass!\" grunted the\nEusufzai agent of a Rajputana trading-house whose goods had been\nfeloniously diverted into the hands of other robbers just across the\nBorder, and whose misfortunes were the laughing-stock of the bazar.\n\"Ohe, priest, whence come you and whither do you go?\"\n\n\"From Roum have I come,\" shouted the priest, waving his whirligig;\n\"from Roum, blown by the breath of a hundred devils across the sea! O\nthieves, robbers, liars, the blessing of Pir Khan on pigs, dogs, and\nperjurers! Who will take the Protected of God to the North to sell\ncharms that are never still to the Amir? The camels shall not gall, the\nsons shall not fall sick, and the wives shall remain faithful while\nthey are away, of the men who give me place in their caravan. Who will\nassist me to slipper the King of the Roos with a golden slipper with a\nsilver heel? The protection of Pir Kahn be upon his labors!\" He spread\nout the skirts of his gaberdine and pirouetted between the lines of\ntethered horses.\n\n\"There starts a caravan from Peshawar to Kabul in twenty days, Huzrut,\"\nsaid the Eusufzai trader. \"My camels go therewith. Do thou also go and\nbring us good luck.\"\n\n\"I will go even now!\" shouted the priest. \"I will depart upon my winged\ncamels, and be at Peshawar in a day! Ho! Hazar Mir Khan,\" he yelled to\nhis servant \"drive out the camels, but let me first mount my own.\"\n\nHe leaped on the back of his beast as it knelt, and turning round to\nme, cried:--\n\n\"Come thou also, Sahib, a little along the road, and I will sell thee a\ncharm--an amulet that shall make thee King of Kafiristan.\"\n\nThen the light broke upon me, and I followed the two camels out of the\nSerai till we reached open road and the priest halted.\n\n\"What d' you think o' that?\" said he in English. \"Carnehan can't talk\ntheir patter, so I've made him my servant. He makes a handsome servant.\n'Tisn't for nothing that I've been knocking about the country for\nfourteen years. Didn't I do that talk neat? We'll hitch on to a caravan\nat Peshawar till we get to Jagdallak, and then we'll see if we can get\ndonkeys for our camels, and strike into Kafiristan. Whirligigs for the\nAmir, O Lor! Put your hand under the camel-bags and tell me what you\nfeel.\"\n\nI felt the butt of a Martini, and another and another.\n\n\"Twenty of 'em,\" said Dravot, placidly.\n\n\"Twenty of 'em, and ammunition to correspond, under the whirligigs and\nthe mud dolls.\"\n\n\"Heaven help you if you are caught with those things!\" I said. \"A\nMartini is worth her weight in silver among the Pathans.\"\n\n\"Fifteen hundred rupees of capital--every rupee we could beg, borrow,\nor steal--are invested on these two camels,\" said Dravot. \"We won't get\ncaught. We're going through the Khaiber with a regular caravan. Who'd\ntouch a poor mad priest?\"\n\n\"Have you got everything you want?\" I asked, overcome with astonishment.\n\n\"Not yet, but we shall soon. Give us a momento of your kindness,\nBrother. You did me a service yesterday, and that time in Marwar. Half\nmy Kingdom shall you have, as the saying is.\" I slipped a small charm\ncompass from my watch-chain and handed it up to the priest.\n\n\"Good-by,\" said Dravot, giving me his hand cautiously. \"It's the last\ntime we'll shake hands with an Englishman these many days. Shake hands\nwith him, Carnehan,\" he cried, as the second camel passed me.\n\nCarnehan leaned down and shook hands. Then the camels passed away along\nthe dusty road, and I was left alone to wonder. My eye could detect no\nfailure in the disguises. The scene in the Serai attested that they\nwere complete to the native mind. There was just the chance, therefore,\nthat Carnehan and Dravot would be able to wander through Afghanistan\nwithout detection. But, beyond, they would find death, certain and\nawful death.\n\nTen days later a native friend of mine, giving me the news of the day\nfrom Peshawar, wound up his letter with:--\"There has been much laughter\nhere on account of a certain mad priest who is going in his estimation\nto sell petty gauds and insignificant trinkets which he ascribes as\ngreat charms to H. H. the Amir of Bokhara. He passed through Peshawar\nand associated himself to the Second Summer caravan that goes to Kabul.\nThe merchants are pleased because through superstition they imagine\nthat such mad fellows bring good-fortune.\"\n\nThe two then, were beyond the Border. I would have prayed for them,\nbut, that night, a real King died in Europe, and demanded an obituary\nnotice.\n\n     *     *     *     *     *     *     *     *\n\nThe wheel of the world swings through the same phases again and again.\nSummer passed and winter thereafter, and came and passed again. The\ndaily paper continued and I with it, and upon the third summer there\nfell a hot night, a night-issue, and a strained waiting for something\nto be telegraphed from the other side of the world, exactly as had\nhappened before. A few great men had died in the past two years, the\nmachines worked with more clatter, and some of the trees in the Office\ngarden were a few feet taller. But that was all the difference.\n\nI passed over to the press-room, and went through just such a scene as\nI have already described. The nervous tension was stronger than it had\nbeen two years before, and I felt the heat more acutely. At three\no'clock I cried, \"Print off,\" and turned to go, when there crept to my\nchair what was left of a man. He was bent into a circle, his head was\nsunk between his shoulders, and he moved his feet one over the other\nlike a bear. I could hardly see whether he walked or crawled--this\nrag-wrapped, whining cripple who addressed me by name, crying that he\nwas come back. \"Can you give me a drink?\" he whimpered. \"For the Lord's\nsake, give me a drink!\"\n\nI went back to the office, the man following with groans of pain, and I\nturned up the lamp.\n\n\"Don't you know me?\" he gasped, dropping into a chair, and he turned\nhis drawn face, surmounted by a shock of gray hair, to the light.\n\nI looked at him intently. Once before had I seen eyebrows that met over\nthe nose in an inch-broad black band, but for the life of me I could\nnot tell where.\n\n\"I don't know you,\" I said, handing him the whiskey. \"What can I do for\nyou?\"\n\nHe took a gulp of the spirit raw, and shivered in spite of the\nsuffocating heat.\n\n\"I've come back,\" he repeated; \"and I was the King of Kafiristan--me\nand Dravot--crowned Kings we was! In this office we settled it--you\nsetting there and giving us the books. I am Peachey--Peachey Taliaferro\nCarnehan, and you've been setting here ever since--O Lord!\"\n\nI was more than a little astonished, and expressed my feelings\naccordingly.\n\n\"It's true,\" said Carnehan, with a dry cackle, nursing his feet which\nwere wrapped in rags. \"True as gospel. Kings we were, with crowns upon\nour heads--me and Dravot--poor Dan--oh, poor, poor Dan, that would\nnever take advice, not though I begged of him!\"\n\n\"Take the whiskey,\" I said, \"and take your own time. Tell me all you\ncan recollect of everything from beginning to end. You got across the\nborder on your camels, Dravot dressed as a mad priest and you his\nservant. Do you remember that?\"\n\n\"I ain't mad--yet, but I will be that way soon. Of course I remember.\nKeep looking at me, or maybe my words will go all to pieces. Keep\nlooking at me in my eyes and don't say anything.\"\n\nI leaned forward and looked into his face as steadily as I could. He\ndropped one hand upon the table and I grasped it by the wrist. It was\ntwisted like a bird's claw, and upon the back was a ragged, red,\ndiamond-shaped scar.\n\n\"No, don't look there. Look at me,\" said Carnehan.\n\n\"That comes afterwards, but for the Lord's sake don't distrack me. We\nleft with that caravan, me and Dravot, playing all sorts of antics to\namuse the people we were with. Dravot used to make us laugh in the\nevenings when all the people was cooking their dinners--cooking their\ndinners, and ... what did they do then? They lit little fires with\nsparks that went into Dravot's beard, and we all laughed--fit to die.\nLittle red fires they was, going into Dravot's big red beard--so\nfunny.\" His eyes left mine and he smiled foolishly.\n\n\"You went as far as Jagdallak with that caravan,\" I said at a venture,\n\"after you had lit those fires. To Jagdallak, where you turned off to\ntry to get into Kafiristan.\"\n\n\"No, we didn't neither. What are you talking about? We turned off\nbefore Jagdallak, because we heard the roads was good. But they wasn't\ngood enough for our two camels--mine and Dravot's. When we left the\ncaravan, Dravot took off all his clothes and mine too, and said we\nwould be heathen, because the Kafirs didn't allow Mohammedans to talk\nto them. So we dressed betwixt and between, and such a sight as Daniel\nDravot I never saw yet nor expect to see again. He burned half his\nbeard, and slung a sheep-skin over his shoulder, and shaved his head\ninto patterns. He shaved mine, too, and made me wear outrageous things\nto look like a heathen. That was in a most mountaineous country, and\nour camels couldn't go along any more because of the mountains. They\nwere tall and black, and coming home I saw them fight like wild\ngoats--there are lots of goats in Kafiristan. And these mountains, they\nnever keep still, no more than the goats. Always fighting they are, and\ndon't let you sleep at night.\"\n\n\"Take some more whiskey,\" I said, very slowly. \"What did you and Daniel\nDravot do when the camels could go no further because of the rough\nroads that led into Kafiristan?\"\n\n\"What did which do? There was a party called Peachey Taliaferro\nCarnehan that was with Dravot. Shall I tell you about him? He died out\nthere in the cold. Slap from the bridge fell old Peachey, turning and\ntwisting in the air like a penny whirligig that you can sell to the\nAmir--No; they was two for three ha'pence, those whirligigs, or I am\nmuch mistaken and woful sore. And then these camels were no use, and\nPeachey said to Dravot--'For the Lord's sake, let's get out of this\nbefore our heads are chopped off,' and with that they killed the camels\nall among the mountains, not having anything in particular to eat, but\nfirst they took off the boxes with the guns and the ammunition, till\ntwo men came along driving four mules. Dravot up and dances in front of\nthem, singing,--'Sell me four mules.' Says the first man,--'If you are\nrich enough to buy, you are rich enough to rob;' but before ever he\ncould put his hand to his knife, Dravot breaks his neck over his knee,\nand the other party runs away. So Carnehan loaded the mules with the\nrifles that was taken off the camels, and together we starts forward\ninto those bitter cold mountainous parts, and never a road broader than\nthe back of your hand.\"\n\nHe paused for a moment, while I asked him if he could remember the\nnature of the country through which he had journeyed.\n\n\"I am telling you as straight as I can, but my head isn't as good as it\nmight be. They drove nails through it to make me hear better how Dravot\ndied. The country was mountainous and the mules were most contrary, and\nthe inhabitants was dispersed and solitary. They went up and up, and\ndown and down, and that other party Carnehan, was imploring of Dravot\nnot to sing and whistle so loud, for fear of bringing down the\ntremenjus avalanches. But Dravot says that if a King couldn't sing it\nwasn't worth being King, and whacked the mules over the rump, and never\ntook no heed for ten cold days. We came to a big level valley all among\nthe mountains, and the mules were near dead, so we killed them, not\nhaving anything in special for them or us to eat. We sat upon the\nboxes, and played odd and even with the cartridges that was jolted out.\n\n\"Then ten men with bows and arrows ran down that valley, chasing twenty\nmen with bows and arrows, and the row was tremenjus. They was fair\nmen--fairer than you or me--with yellow hair and remarkable well built.\nSays Dravot, unpacking the guns--'This is the beginning of the\nbusiness. We'll fight for the ten men,' and with that he fires two\nrifles at the twenty men and drops one of them at two hundred yards\nfrom the rock where we was sitting. The other men began to run, but\nCarnehan and Dravot sits on the boxes picking them off at all ranges,\nup and down the valley. Then we goes up to the ten men that had run\nacross the snow too, and they fires a footy little arrow at us. Dravot\nhe shoots above their heads and they all falls down flat. Then he walks\nover them and kicks them, and then he lifts them up and shakes hands\nall around to make them friendly like. He calls them and gives them the\nboxes to carry, and waves his hand for all the world as though he was\nKing already. They takes the boxes and him across the valley and up the\nhill into a pine wood on the top, where there was half a dozen big\nstone idols. Dravot he goes to the biggest--a fellow they call\nImbra--and lays a rifle and a cartridge at his feet, rubbing his nose\nrespectful with his own nose, patting him on the head, and saluting in\nfront of it. He turns round to the men and nods his head, and\nsays,--'That's all right. I'm in the know too, and these old jim-jams\nare my friends.' Then he opens his mouth and points down it, and when\nthe first man brings him food, he says--'No;' and when the second man\nbrings him food, he says--'No;' but when one of the old priests and the\nboss of the village brings him food, he says--'Yes;' very haughty, and\neats it slow. That was how we came to our first village, without any\ntrouble, just as though we had tumbled from the skies. But we tumbled\nfrom one of those damned rope-bridges, you see, and you couldn't expect\na man to laugh much after that.\"\n\n\"Take some more whiskey and go on,\" I said. \"That was the first village\nyou came into. How did you get to be King?\"\n\n\"I wasn't King,\" said Carnehan. \"Dravot he was the King, and a handsome\nman he looked with the gold crown on his head and all. Him and the\nother party stayed in that village, and every morning Dravot sat by the\nside of old Imbra, and the people came and worshipped. That was\nDravot's order. Then a lot of men came into the valley, and Carnehan\nand Dravot picks them off with the rifles before they knew where they\nwas, and runs down into the valley and up again the other side, and\nfinds another village, same as the first one, and the people all falls\ndown flat on their faces, and Dravot says,--'Now what is the trouble\nbetween you two villages?' and the people points to a woman, as fair as\nyou or me, that was carried off, and Dravot takes her back to the first\nvillage and counts up the dead--eight there was. For each dead man\nDravot pours a little milk on the ground and waves his arms like a\nwhirligig and, 'That's all right,' says he. Then he and Carnehan takes\nthe big boss of each village by the arm and walks them down into the\nvalley, and shows them how to scratch a line with a spear right down\nthe valley, and gives each a sod of turf from both sides o' the line.\nThen all the people comes down and shouts like the devil and all, and\nDravot says,--'Go and dig the land, and be fruitful and multiply,'\nwhich they did, though they didn't understand. Then we asks the names\nof things in their lingo--bread and water and fire and idols and such,\nand Dravot leads the priest of each village up to the idol, and says he\nmust sit there and judge the people, and if anything goes wrong he is\nto be shot.\n\n\"Next week they was all turning up the land in the valley as quiet as\nbees and much prettier, and the priests heard all the complaints and\ntold Dravot in dumb show what it was about. 'That's just the\nbeginning,' says Dravot. 'They think we're gods.' He and Carnehan picks\nout twenty good men and shows them how to click off a rifle, and form\nfours, and advance in line, and they was very pleased to do so, and\nclever to see the hang of it. Then he takes out his pipe and his\nbaccy-pouch and leaves one at one village, and one at the other, and\noff we two goes to see what was to be done in the next valley. That was\nall rock, and there was a little village there, and Carnehan\nsays,--'Send 'em to the old valley to plant,' and takes 'em there and\ngives 'em some land that wasn't took before. They were a poor lot, and\nwe blooded 'em with a kid before letting 'em into the new Kingdom. That\nwas to impress the people, and then they settled down quiet, and\nCarnehan went back to Dravot who had got into another valley, all snow\nand ice and most mountainous. There was no people there and the Army\ngot afraid, so Dravot shoots one of them, and goes on till he finds\nsome people in a village, and the Army explains that unless the people\nwants to be killed they had better not shoot their little matchlocks;\nfor they had matchlocks. We makes friends with the priest and I stays\nthere alone with two of the Army, teaching the men how to drill, and a\nthundering big Chief comes across the snow with kettledrums and horns\ntwanging, because he heard there was a new god kicking about. Carnehan\nsights for the brown of the men half a mile across the snow and wings\none of them. Then he sends a message to the Chief that, unless he\nwished to be killed, he must come and shake hands with me and leave his\narms behind. The Chief comes alone first, and Carnehan shakes hands\nwith him and whirls his arms about, same as Dravot used, and very much\nsurprised that Chief was, and strokes my eyebrows. Then Carnehan goes\nalone to the Chief, and asks him in dumb show if he had an enemy he\nhated. 'I have,' says the Chief. So Carnehan weeds out the pick of his\nmen, and sets the two of the Army to show them drill and at the end of\ntwo weeks the men can manoeuvre about as well as Volunteers. So he\nmarches with the Chief to a great big plain on the top of a mountain,\nand the Chiefs men rushes into a village and takes it; we three\nMartinis firing into the brown of the enemy. So we took that village\ntoo, and I gives the Chief a rag from my coat and says, 'Occupy till I\ncome': which was scriptural. By way of a reminder, when me and the Army\nwas eighteen hundred yards away, I drops a bullet near him standing on\nthe snow, and all the people falls flat on their faces. Then I sends a\nletter to Dravot, wherever he be by land or by sea.\"\n\nAt the risk of throwing the creature out of train I interrupted,--\"How\ncould you write a letter up yonder?\"\n\n\"The letter?--Oh! -- The letter! Keep looking at me between the eyes,\nplease. It was a string-talk letter, that we'd learned the way of it\nfrom a blind beggar in the Punjab.\"\n\nI remember that there had once come to the office a blind man with a\nknotted twig and a piece of string which he wound round the twig\naccording to some cypher of his own. He could, after the lapse of days\nor hours, repeat the sentence which he had reeled up. He had reduced\nthe alphabet to eleven primitive sounds; and tried to teach me his\nmethod, but failed.\n\n\"I sent that letter to Dravot,\" said Carnehan; \"and told him to come\nback because this Kingdom was growing too big for me to handle, and\nthen I struck for the first valley, to see how the priests were\nworking. They called the village we took along with the Chief, Bashkai,\nand the first village we took, Er-Heb. The priest at Er-Heb was doing\nall right, but they had a lot of pending cases about land to show me,\nand some men from another village had been firing arrows at night. I\nwent out and looked for that village and fired four rounds at it from a\nthousand yards. That used all the cartridges I cared to spend, and I\nwaited for Dravot, who had been away two or three months, and I kept my\npeople quiet.\n\n\"One morning I heard the devil's own noise of drums and horns, and Dan\nDravot marches down the hill with his Army and a tail of hundreds of\nmen, and, which was the most amazing--a great gold crown on his head.\n'My Gord, Carnehan,' says Daniel, 'this is a tremenjus business, and\nwe've got the whole country as far as it's worth having. I am the son\nof Alexander by Queen Semiramis, and you're my younger brother and a\ngod too! It's the biggest thing we've ever seen. I've been marching and\nfighting for six weeks with the Army, and every footy little village\nfor fifty miles has come in rejoiceful; and more than that, I've got\nthe key of the whole show, as you'll see, and I've got a crown for you!\nI told 'em to make two of 'em at a place called Shu, where the gold\nlies in the rock like suet in mutton. Gold I've seen, and turquoise\nI've kicked out of the cliffs, and there's garnets in the sands of the\nriver, and here's a chunk of amber that a man brought me. Call up all\nthe priests and, here, take your crown.'\n\n\"One of the men opens a black hair bag and I slips the crown on. It was\ntoo small and too heavy, but I wore it for the glory. Hammered gold it\nwas--five pound weight, like a hoop of a barrel.\n\n\"'Peachey,' says Dravot, 'we don't want to fight no more. The Craft's\nthe trick so help me!' and he brings forward that same Chief that I\nleft at Bashkai--Billy Fish we called him afterwards, because he was so\nlike Billy Fish that drove the big tank-engine at Mach on the Bolan in\nthe old days. 'Shake hands with him,' says Dravot, and I shook hands\nand nearly dropped, for Billy Fish gave me the Grip. I said nothing,\nbut tried him with the Fellow Craft Grip. He answers, all right, and I\ntried the Master's Grip, but that was a slip. 'A Fellow Craft he is!' I\nsays to Dan. 'Does he know the word?' 'He does,' says Dan, 'and all the\npriests know. It's a miracle! The Chiefs and the priest can work a\nFellow Craft Lodge in a way that's very like ours, and they've cut the\nmarks on the rocks, but they don't know the Third Degree, and they've\ncome to find out. It's Gord's Truth. I've known these long years that\nthe Afghans knew up to the Fellow Craft Degree, but this is a miracle.\nA god and a Grand-Master of the Craft am I, and a Lodge in the Third\nDegree I will open, and we'll raise the head priests and the Chiefs of\nthe villages.'\n\n\"'It's against all the law,' I says, 'holding a Lodge without warrant\nfrom any one; and we never held office in any Lodge.'\n\n\"'It's a master-stroke of policy,' says Dravot. 'It means running the\ncountry as easy as a four-wheeled bogy on a down grade. We can't stop\nto inquire now, or they'll turn against us. I've forty Chiefs at my\nheel, and passed and raised according to their merit they shall be.\nBillet these men on the villages and see that we run up a Lodge of some\nkind. The temple of Imbra will do for the Lodge-room. The women must\nmake aprons as you show them. I'll hold a levee of Chiefs tonight and\nLodge to-morrow.'\n\n\"I was fair rim off my legs, but I wasn't such a fool as not to see\nwhat a pull this Craft business gave us. I showed the priests' families\nhow to make aprons of the degrees, but for Dravot's apron the blue\nborder and marks was made of turquoise lumps on white hide, not cloth.\nWe took a great square stone in the temple for the Master's chair, and\nlittle stones for the officers' chairs, and painted the black pavement\nwith white squares, and did what we could to make things regular.\n\n\"At the levee which was held that night on the hillside with big\nbonfires, Dravot gives out that him and me were gods and sons of\nAlexander, and Past Grand-Masters in the Craft, and was come to make\nKafiristan a country where every man should eat in peace and drink in\nquiet, and specially obey us. Then the Chiefs come round to shake\nhands, and they was so hairy and white and fair it was just shaking\nhands with old friends. We gave them names according as they was like\nmen we had known in India--Billy Fish, Holly Dilworth, Pikky Kergan\nthat was Bazar-master when I was at Mhow, and so on, and so on.\n\n\"The most amazing miracle was at Lodge next night. One of the old\npriests was watching us continuous, and I felt uneasy, for I knew we'd\nhave to fudge the Ritual, and I didn't know what the men knew. The old\npriest was a stranger come in from beyond the village of Bashkai. The\nminute Dravot puts on the Master's apron that the girls had made for\nhim, the priest fetches a whoop and a howl, and tries to overturn the\nstone that Dravot was sitting on. 'It's all up now,' I says. 'That\ncomes of meddling with the Craft without warrant!' Dravot never winked\nan eye, not when ten priests took and tilted over the Grand-Master's\nchair--which was to say the stone of Imbra. The priest begins rubbing\nthe bottom end of it to clear away the black dirt, and presently he\nshows all the other priests the Master's Mark, same as was on Dravot's\napron, cut into the stone. Not even the priests of the temple of Imbra\nknew it was there. The old chap falls flat on his face at Dravot's feet\nand kisses 'em. 'Luck again,' says Dravot, across the Lodge to me,\n'they say it's the missing Mark that no one could understand the why\nof. We're more than safe now.' Then he bangs the butt of his gun for a\ngavel and says:--'By virtue of the authority vested in me by my own\nright hand and the help of Peachey, I declare myself Grand-Master of\nall Freemasonry in Kafiristan in this the Mother Lodge o' the country,\nand King of Kafiristan equally with Peachey!' At that he puts on his\ncrown and I puts on mine--I was doing Senior Warden--and we opens the\nLodge in most ample form. It was a amazing miracle! The priests moved\nin Lodge through the first two degrees almost without telling, as if\nthe memory was coming back to them. After that, Peachey and Dravot\nraised such as was worthy--high priests and Chiefs of far-off villages.\nBilly Fish was the first, and I can tell you we scared the soul out of\nhim. It was not in any way according to Ritual, but it served our turn.\nWe didn't raise more than ten of the biggest men because we didn't want\nto make the Degree common. And they was clamoring to be raised.\n\n\"'In another six months,' says Dravot, 'we'll hold another\nCommunication and see how you are working.' Then he asks them about\ntheir villages, and learns that they was fighting one against the other\nand were fair sick and tired of it. And when they wasn't doing that\nthey was fighting with the Mohammedans. 'You can fight those when they\ncome into our country,' says Dravot. 'Tell off every tenth man of your\ntribes for a Frontier guard, and send two hundred at a time to this\nvalley to be drilled. Nobody is going to be shot or speared any more so\nlong as he does well, and I know that you won't cheat me because you're\nwhite people--sons of Alexander--and not like common, black\nMohammedans. You are my people and by God,' says he, running off into\nEnglish at the end--'I'll make a damned fine Nation of you, or I'll die\nin the making!'\n\n\"I can't tell all we did for the next six months because Dravot did a\nlot I couldn't see the hang of, and he learned their lingo in a way I\nnever could. My work was to help the people plough, and now and again\nto go out with some of the Army and see what the other villages were\ndoing, and make 'em throw rope-bridges across the ravines which cut up\nthe country horrid. Dravot was very kind to me, but when he walked up\nand down in the pine wood pulling that bloody red beard of his with\nboth fists I knew he was thinking plans I could not advise him about,\nand I just waited for orders.\n\n\"But Dravot never showed me disrespect before the people. They were\nafraid of me and the Army, but they loved Dan. He was the best of\nfriends with the priests and the Chiefs; but any one could come across\nthe hills with a complaint and Dravot would hear him out fair, and call\nfour priests together and say what was to be done. He used to call in\nBilly Fish from Bashkai, and Pikky Kergan from Shu, and an old Chief we\ncalled Kafuzelum--it was like enough to his real name--and hold\ncouncils with 'em when there was any fighting to be done in small\nvillages. That was his Council of War, and the four priests of Bashkai,\nShu, Khawak, and Madora was his Privy Council. Between the lot of 'em\nthey sent me, with forty men and twenty rifles, and sixty men carrying\nturquoises, into the Ghorband country to buy those hand-made Martini\nrifles, that come out of the Amir's workshops at Kabul, from one of the\nAmir's Herati regiments that would have sold the very teeth out of\ntheir mouths for turquoises.\n\n\"I stayed in Ghorband a month, and gave the Governor the pick of my\nbaskets for hush-money, and bribed the colonel of the regiment some\nmore, and, between the two and the tribes-people, we got more than a\nhundred hand-made Martinis, a hundred good Kohat Jezails that'll throw\nto six hundred yards, and forty manloads of very bad ammunition for the\nrifles. I came back with what I had, and distributed 'em among the men\nthat the Chiefs sent in to me to drill. Dravot was too busy to attend\nto those things, but the old Army that we first made helped me, and we\nturned out five hundred men that could drill, and two hundred that knew\nhow to hold arms pretty straight. Even those cork-screwed, hand-made\nguns was a miracle to them. Dravot talked big about powder-shops and\nfactories, walking up and down in the pine wood when the winter was\ncoming on.\n\n\"'I won't make a Nation,' says he. 'I'll make an Empire! These men\naren't niggers; they're English! Look at their eyes--look at their\nmouths. Look at the way they stand up. They sit on chairs in their own\nhouses. They're the Lost Tribes, or something like it, and they've\ngrown to be English. I'll take a census in the spring if the priests\ndon't get frightened. There must be a fair two million of 'em in these\nhills. The villages are full o' little children. Two million\npeople--two hundred and fifty thousand fighting men--and all English!\nThey only want the rifles and a little drilling. Two hundred and fifty\nthousand men, ready to cut in on Russia's right flank when she tries\nfor India! Peachey, man,' he says, chewing his beard in great hunks,\n'we shall be Emperors--Emperors of the Earth!  Rajah Brooke will be a\nsuckling to us. I'll treat with the Viceroy on equal terms. I'll ask\nhim to send me twelve picked English--twelve that I know of--to help us\ngovern a bit. There's Mackray, Sergeant-pensioner at Segowli--many's\nthe good dinner he's given me, and his wife a pair of trousers. There's\nDonkin, the Warder of Tounghoo Jail; there's hundreds that I could lay\nmy hand on if I was in India. The Viceroy shall do it for me. I'll send\na man through in the spring for those men, and I'll write for a\ndispensation from the Grand Lodge for what I've done as Grand-Master.\nThat--and all the Sniders that'll be thrown out when the native troops\nin India take up the Martini. They'll be worn smooth, but they'll do\nfor fighting in these hills. Twelve English, a hundred thousand Sniders\nrun through the Amir's country in driblets--I'd be content with twenty\nthousand in one year--and we'd be an Empire. When everything was\nship-shape, I'd hand over the crown--this crown I'm wearing now--to\nQueen Victoria on my knees, and she'd say:--\"Rise up, Sir Daniel\nDravot.\" Oh, its big! It's big, I tell you! But there's so much to be\ndone in every place--Bashkai, Khawak, Shu, and everywhere else.'\n\n\"'What is it?' I says. 'There are no more men coming in to be drilled\nthis autumn. Look at those fat, black clouds. They're bringing the\nsnow.'\n\n\"'It isn't that,' says Daniel, putting his hand very hard on my\nshoulder; 'and I don't wish to say anything that's against you, for no\nother living man would have followed me and made me what I am as you\nhave done. You're a first-class Commander-in-Chief, and the people know\nyou; but--it's a big country, and somehow you can't help me, Peachey,\nin the way I want to be helped.'\n\n\"'Go to your blasted priests, then!' I said, and I was sorry when I\nmade that remark, but it did hurt me sore to find Daniel talking so\nsuperior when I'd drilled all the men, and done all he told me.\n\n\"'Don't let's quarrel, Peachey,' says Daniel without cursing. 'You're a\nKing too, and the half of this Kingdom is yours; but can't you see,\nPeachey, we want cleverer men than us now--three or four of 'em that we\ncan scatter about for our Deputies? It's a hugeous great State, and I\ncan't always tell the right thing to do, and I haven't time for all I\nwant to do, and here's the winter coming on and all.' He put half his\nbeard into his mouth, and it was as red as the gold of his crown.\n\n\"'I'm sorry, Daniel,' says I. 'I've done all I could. I've drilled the\nmen and shown the people how to stack their oats better, and I've\nbrought in those tinware rifles from Ghorband--but I know what you're\ndriving at. I take it Kings always feel oppressed that way.'\n\n\"'There's another thing too,' says Dravot, walking up and down. 'The\nwinter's coming and these people won't be giving much trouble, and if\nthey do we can't move about. I want a wife.'\n\n\"'For Gord's sake leave the women alone!' I says. 'We've both got all\nthe work we can, though I am a fool. Remember the Contrack, and keep\nclear o' women.'\n\n\"'The Contrack only lasted till such time as we was Kings; and Kings we\nhave been these months past,' says Dravot, weighing his crown in his\nhand. 'You go get a wife too, Peachey--a nice, strappin', plump girl\nthat'll keep you warm in the winter. They're prettier than English\ngirls, and we can take the pick of 'em. Boil 'em once or twice in hot\nwater, and they'll come as fair as chicken and ham.'\n\n\"'Don't tempt me!' I says. 'I will not have any dealings with a woman\nnot till we are a dam' side more settled than we are now. I've been\ndoing the work o' two men, and you've been doing the work o' three.\nLet's lie off a bit, and see if we can get some better tobacco from\nAfghan country and run in some good liquor; but no women.'\n\n\"'Who's talking o' women?' says Dravot. 'I said wife--a Queen to breed\na King's son for the King. A Queen out of the strongest tribe, that'll\nmake them your blood-brothers, and that'll lie by your side and tell\nyou all the people thinks about you and their own affairs. That's what\nI want.'\n\n\"'Do you remember that Bengali woman I kept at Mogul Serai when I was\nplate-layer?' says I. 'A fat lot o' good she was to me. She taught me\nthe lingo and one or two other things; but what happened? She ran away\nwith the Station Master's servant and half my month's pay. Then she\nturned up at Dadur Junction in tow of a half-caste, and had the\nimpidence to say I was her husband--all among the drivers of the\nrunning-shed!'\n\n\"'We've done with that,' says Dravot. 'These women are whiter than you\nor me, and a Queen I will have for the winter months.'\n\n\"'For the last time o' asking, Dan, do not,' I says. 'It'll only bring\nus harm. The Bible says that Kings ain't to waste their strength on\nwomen, 'specially when they've got a new raw Kingdom to work over.'\n\n\"'For the last time of answering, I will,' said Dravot, and he went\naway through the pine-trees looking like a big red devil. The low sun\nhit his crown and beard on one side, and the two blazed like hot coals.\n\n\"But getting a wife was not as easy as Dan thought. He put it before\nthe Council, and there was no answer till Billy Fish said that he'd\nbetter ask the girls. Dravot damned them all round. 'What's wrong with\nme?' he shouts, standing by the idol Imbra. 'Am I a dog or am I not\nenough of a man for your wenches? Haven't I put the shadow of my hand\nover this country? Who stopped the last Afghan raid?' It was me really,\nbut Dravot was too angry to remember. 'Who bought your guns? Who\nrepaired the bridges? Who's the Grand-Master of the sign cut in the\nstone?' and he thumped his hand on the block that he used to sit on in\nLodge, and at Council, which opened like Lodge always. Billy Fish said\nnothing and no more did the others. 'Keep your hair on, Dan,' said I;\n'and ask the girls. That's how it's done at home, and these people are\nquite English.'\n\n\"'The marriage of a King is a matter of State,' says Dan, in a\nwhite-hot rage, for he could feel, I hope, that he was going against\nhis better mind. He walked out of the Council-room, and the others sat\nstill, looking at the ground.\n\n\"'Billy Fish,' says I to the Chief of Bashkai, 'what's the difficulty\nhere? A straight answer to a true friend.' 'You know,' says Billy Fish.\n'How should a man tell you who know everything? How can daughters of\nmen marry gods or devils? It's not proper.'\n\n\"I remembered something like that in the Bible; but if, after seeing us\nas long as they had, they still believed we were gods it wasn't for me\nto undeceive them.\n\n\"'A god can do anything,' says I. 'If the King is fond of a girl he'll\nnot let her die.' 'She'll have to,' said Billy Fish. 'There are all\nsorts of gods and devils in these mountains, and now and again a girl\nmarries one of them and isn't seen any more. Besides, you two know the\nMark cut in the stone. Only the gods know that. We thought you were men\ntill you showed the sign of the Master.'\n\n\"'I wished then that we had explained about the loss of the genuine\nsecrets of a Master-Mason at the first go-off; but I said nothing. All\nthat night there was a blowing of horns in a little dark temple\nhalf-way down the hill, and I heard a girl crying fit to die. One of\nthe priests told us that she was being prepared to marry the King.\n\n\"'I'll have no nonsense of that kind,' says Dan. 'I don't want to\ninterfere with your customs, but I'll take my own wife. 'The girl's a\nlittle bit afraid,' says the priest. 'She thinks she's going to die,\nand they are a-heartening of her up down in the temple.'\n\n\"'Hearten her very tender, then,' says Dravot, 'or I'll hearten you\nwith the butt of a gun so that you'll never want to be heartened\nagain.' He licked his lips, did Dan, and stayed up walking about more\nthan half the night, thinking of the wife that he was going to get in\nthe morning. I wasn't any means comfortable, for I knew that dealings\nwith a woman in foreign parts, though you was a crowned King twenty\ntimes over, could not but be risky. I got up very early in the morning\nwhile Dravot was asleep, and I saw the priests talking together in\nwhispers, and the Chiefs talking together too, and they looked at me\nout of the corners of their eyes.\n\n\"'What is up, Fish?' I says to the Bashkai man, who was wrapped up in\nhis furs and looking splendid to behold.\n\n\"'I can't rightly say,' says he; 'but if you can induce the King to\ndrop all this nonsense about marriage, you'll be doing him and me and\nyourself a great service.'\n\n\"'That I do believe,' says I. 'But sure, you know, Billy, as well as\nme, having fought against and for us, that the King and me are nothing\nmore than two of the finest men that God Almighty ever made. Nothing\nmore, I do assure you.'\n\n\"'That may be,' says Billy Fish, 'and yet I should be sorry if it was.'\nHe sinks his head upon his great fur cloak for a minute and thinks.\n'King,' says he, 'be you man or god or devil, I'll stick by you to-day.\nI have twenty of my men with me, and they will follow me. We'll go to\nBashkai until the storm blows over.'\n\n\"A little snow had fallen in the night, and everything was white except\nthe greasy fat clouds that blew down and down from the north. Dravot\ncame out with his crown on his head, swinging his arms and stamping his\nfeet, and looking more pleased than Punch.\n\n\"'For the last time, drop it, Dan,' says I in a whisper. 'Billy Fish\nhere says that there will be a row.'\n\n\"'A row among my people!' says Dravot. 'Not much. Peachy, you're a fool\nnot to get a wife too. Where's the girl?' says he with a voice as loud\nas the braying of a jackass. 'Call up all the Chiefs and priests, and\nlet the Emperor see if his wife suits him.'\n\n\"There was no need to call any one. They were all there leaning on\ntheir guns and spears round the clearing in the centre of the pine\nwood. A deputation of priests went down to the little temple to bring\nup the girl, and the horns blew up fit to wake the dead. Billy Fish\nsaunters round and gets as close to Daniel as he could, and behind him\nstood his twenty men with matchlocks. Not a man of them under six feet.\nI was next to Dravot, and behind me was twenty men of the regular Army.\nUp comes the girl, and a strapping wench she was, covered with silver\nand turquoises but white as death, and looking back every minute at the\npriests.\n\n\"'She'll do,' said Dan, looking her over. 'What's to be afraid of,\nlass? Come and kiss me.' He puts his arm round her. She shuts her eyes,\ngives a bit of a squeak, and down goes her face in the side of Dan's\nflaming red beard.\n\n\"'The slut's bitten me!' says he, clapping his hand to his neck, and,\nsure enough, his hand was red with blood. Billy Fish and two of his\nmatchlock-men catches hold of Dan by the shoulders and drags him into\nthe Bashkai lot, while the priests howls in their lingo,--'Neither god\nnor devil but a man!' I was all taken aback, for a priest cut at me in\nfront, and the Army behind began firing into the Bashkai men.\n\n\"'God A-mighty!' says Dan. 'What is the meaning o' this?'\n\n\"'Come back! Come away!' says Billy Fish. 'Ruin and Mutiny is the\nmatter. We'll break for Bashkai if we can.'\n\n\"I tried to give some sort of orders to my men--the men o' the regular\nArmy--but it was no use, so I fired into the brown of 'em with an\nEnglish Martini and drilled three beggars in a line. The valley was\nfull of shouting, howling creatures, and every soul was shrieking, 'Not\na god nor a devil but only a man!' The Bashkai troops stuck to Billy\nFish all they were worth, but their matchlocks wasn't half as good as\nthe Kabul breech-loaders, and four of them dropped. Dan was bellowing\nlike a bull, for he was very wrathy; and Billy Fish had a hard job to\nprevent him running out at the crowd.\n\n\"'We can't stand,' says Billy Fish. 'Make a run for it down the valley!\nThe whole place is against us.' The matchlock-men ran, and we went down\nthe valley in spite of Dravot's protestations. He was swearing horribly\nand crying out that he was a King. The priests rolled great stones on\nus, and the regular Army fired hard, and there wasn't more than six\nmen, not counting Dan, Billy Fish, and Me, that came down to the bottom\nof the valley alive.\n\n\"'Then they stopped firing and the horns in the temple blew again.\n'Come away--for Gord's sake come away!' says Billy Fish. 'They'll send\nrunners out to all the villages before ever we get to Bashkai. I can\nprotect you there, but I can't do anything now.'\n\n\"My own notion is that Dan began to go mad in his head from that hour.\nHe stared up and down like a stuck pig. Then he was all for walking\nback alone and killing the priests with his bare hands; which he could\nhave done. 'An Emperor am I,' says Daniel, 'and next year I shall be a\nKnight of the Queen.\n\n\"'All right, Dan,' says I; 'but come along now while there's time.'\n\n\"'It's your fault,' says he, 'for not looking after your Army better.\nThere was mutiny in the midst, and you didn't know--you damned\nengine-driving, plate-laying, missionary's-pass-hunting hound!' He sat\nupon a rock and called me every foul name he could lay tongue to. I was\ntoo heart-sick to care, though it was all his foolishness that brought\nthe smash.\n\n\"'I'm sorry, Dan,' says I, 'but there's no accounting for natives. This\nbusiness is our Fifty-Seven. Maybe we'll make something out of it yet,\nwhen we've got to Bashkai.'\n\n\"'Let's get to Bashkai, then,' says Dan, 'and, by God, when I come back\nhere again I'll sweep the valley so there isn't a bug in a blanket\nleft!'\n\n\"'We walked all that day, and all that night Dan was stumping up and\ndown on the snow, chewing his beard and muttering to himself.\n\n\"'There's no hope o' getting clear,' said Billy Fish. 'The priests will\nhave sent runners to the villages to say that you are only men. Why\ndidn't you stick on as gods till things was more settled? I'm a dead\nman,' says Billy Fish, and he throws himself down on the snow and\nbegins to pray to his gods.\n\n\"Next morning we was in a cruel bad country--all up and down, no level\nground at all, and no food either. The six Bashkai men looked at Billy\nFish hungry-wise as if they wanted to ask something, but they said\nnever a word. At noon we came to the top of a flat mountain all covered\nwith snow, and when we climbed up into it, behold, there was an army in\nposition waiting in the middle!\n\n\"'The runners have been very quick,' says Billy Fish, with a little bit\nof a laugh. 'They are waiting for us.'\n\n\"Three or four men began to fire from the enemy's side, and a chance\nshot took Daniel in the calf of the leg. That brought him to his\nsenses. He looks across the snow at the Army, and sees the rifles that\nwe had brought into the country.\n\n\"'We're done for,' says he. 'They are Englishmen, these people,--and\nit's my blasted nonsense that has brought you to this. Get back, Billy\nFish, and take your men away; you've done what you could, and now cut\nfor it. Carnehan,' says he, 'shake hands with me and go along with\nBilly. Maybe they won't kill you. I'll go and meet 'em alone. It's me\nthat did it. Me, the King!'\n\n\"'Go!' says I. 'Go to Hell, Dan. I'm with you here. Billy Fish, you\nclear out, and we two will meet those folk.'\n\n\"'I'm a Chief,' says Billy Fish, quite quiet. 'I stay with you. My men\ncan go.'\n\n\"The Bashkai fellows didn't wait for a second word but ran off, and Dan\nand Me and Billy Fish walked across to where the drums were drumming\nand the horns were horning. It was cold-awful cold. I've got that cold\nin the back of my head now. There's a lump of it there.\"\n\nThe punkah-coolies had gone to sleep. Two kerosene lamps were blazing\nin the office, and the perspiration poured down my face and splashed on\nthe blotter as I leaned forward. Carnehan was shivering, and I feared\nthat his mind might go. I wiped my face, took a fresh grip of the\npiteously mangled hands, and said:--\"What happened after that?\"\n\nThe momentary shift of my eyes had broken the clear current.\n\n\"What was you pleased to say?\" whined Carnehan. \"They took them without\nany sound. Not a little whisper all along the snow, not though the King\nknocked down the first man that set hand on him--not though old Peachey\nfired his last cartridge into the brown of 'em. Not a single solitary\nsound did those swines make. They just closed up, tight, and I tell you\ntheir furs stunk. There was a man called Billy Fish, a good friend of\nus all, and they cut his throat, Sir, then and there, like a pig; and\nthe King kicks up the bloody snow and says:--'We've had a dashed fine\nrun for our money. What's coming next?' But Peachey, Peachey\nTaliaferro, I tell you, Sir, in confidence as betwixt two friends, he\nlost his head, Sir. No, he didn't neither. The King lost his head, so\nhe did, all along o' one of those cunning rope-bridges. Kindly let me\nhave the paper-cutter, Sir. It tilted this way. They marched him a mile\nacross that snow to a rope-bridge over a ravine with a river at the\nbottom. You may have seen such.  They prodded him behind like an ox.\n'Damn your eyes!' says the King. 'D'you suppose I can't die like a\ngentleman?' He turns to Peachey--Peachey that was crying like a child.\n'I've brought you to this, Peachey,' says he. 'Brought you out of your\nhappy life to be killed in Kafiristan, where you was late\nCommander-in-Chief of the Emperor's forces. Say you forgive me,\nPeachey.' 'I do,' says Peachey. 'Fully and freely do I forgive you,\nDan.' 'Shake hands, Peachey,' says he. 'I'm going now.' Out he goes,\nlooking neither right nor left, and when he was plumb in the middle of\nthose dizzy dancing ropes, 'Cut, you beggars,' he shouts; and they cut,\nand old Dan fell, turning round and round and round, twenty thousand\nmiles, for he took half an hour to fall till he struck the water, and I\ncould see his body caught on a rock with the gold crown close beside.\n\n\"But do you know what they did to Peachey between two pine-trees? They\ncrucified him, sir, as Peachey's hands will show. They used wooden pegs\nfor his hands and his feet; and he didn't die. He hung there and\nscreamed, and they took him down next day, and said it was a miracle\nthat he wasn't dead. They took him down--poor old Peachey that hadn't\ndone them any harm--that hadn't done them any...\"\n\nHe rocked to and fro and wept bitterly, wiping his eyes with the back\nof his scarred hands and moaning like a child for some ten minutes.\n\n\"They was cruel enough to feed him up in the temple, because they said\nhe was more of a god than old Daniel that was a man. Then they turned\nhim out on the snow, and told him to go home, and Peachey came home in\nabout a year, begging along the roads quite safe; for Daniel Dravot he\nwalked before and said:--'Come along, Peachey. It's a big thing we're\ndoing.' The mountains they danced at night, and the mountains they\ntried to fall on Peachey's head, but Dan he held up his hand, and\nPeachey came along bent double. He never let go of Dan's hand, and he\nnever let go of Dan's head. They gave it to him as a present in the\ntemple, to remind him not to come again, and though the crown was pure\ngold, and Peachey was starving, never would Peachey sell the same. You\nknew Dravot, sir! You knew Right Worshipful Brother Dravot! Look at him\nnow!\"\n\nHe fumbled in the mass of rags round his bent waist; brought out a\nblack horsehair bag embroidered with silver thread; and shook therefrom\non to my table--the dried, withered head of Daniel Dravot! The morning\nsun that had long been paling the lamps struck the red beard and blind\nsunken eyes; struck, too, a heavy circlet of gold studded with raw\nturquoises, that Carnehan placed tenderly on the battered temples.\n\n\"You behold now,\" said Carnehan, \"the Emperor in his habit as he\nlived--the King of Kafiristan with his crown upon his head. Poor old\nDaniel that was a monarch once!\"\n\nI shuddered, for, in spite of defacements manifold, I recognized the\nhead of the man of Marwar Junction. Carnehan rose to go. I attempted to\nstop him. He was not fit to walk abroad. \"Let me take away the whiskey,\nand give me a little money,\" he gasped. \"I was a King once. I'll go to\nthe Deputy Commissioner and ask to set in the Poor-house till I get my\nhealth. No, thank you, I can't wait till you get a carriage for me.\nI've urgent private affairs--in the south--at Marwar.\"\n\nHe shambled out of the office and departed in the direction of the\nDeputy Commissioner's house. That day at noon I had occasion to go down\nthe blinding hot Mall, and I saw a crooked man crawling along the white\ndust of the roadside, his hat in his hand, quavering dolorously after\nthe fashion of street-singers at Home. There was not a soul in sight,\nand he was out of all possible earshot of the houses. And he sang\nthrough his nose, turning his head from right to left:--\n\n   \"The Son of Man goes forth to war,\n      A golden crown to gain;\n    His blood-red banner streams afar--\n      Who follows in his train?\"\n\nI waited to hear no more, but put the poor wretch into my carriage and\ndrove him off to the nearest missionary for eventual transfer to the\nAsylum. He repeated the hymn twice while he was with me whom he did not\nin the least recognize, and I left him singing to the missionary.\n\nTwo days later I inquired after his welfare of the Superintendent of\nthe Asylum.\n\n\"He was admitted suffering from sun-stroke. He died early yesterday\nmorning,\" said the Superintendent. \"Is it true that he was half an hour\nbareheaded in the sun at midday?\"\n\n\"Yes,\" said I, \"but do you happen to know if he had anything upon him\nby any chance when he died?\"\n\n\"Not to my knowledge,\" said the Superintendent.\n\nAnd there the matter rests.", "title": "The Man Who Would Be King"}