{"summary": "The play is set in \"The Present\" (i.e. 1895).\n\nAlgernon Moncrieff's flat in Half Moon Street, W\nThe play opens with Algernon Moncrieff, an idle young gentleman, receiving his best friend, John Worthing, whom he knows as Ernest. Ernest has come from the country to propose to Algernon's cousin, Gwendolen Fairfax. Algernon, however, refuses his consent until Ernest explains why his cigarette case bears the inscription, \"From little Cecily, with her fondest love to her dear Uncle Jack.\" 'Ernest' is forced to admit to living a double life. In the country, he assumes a serious attitude for the benefit of his young ward, the heiress Cecily Cardew, and goes by the name of John (or, as a nickname, Jack), while pretending that he must worry about a wastrel younger brother named Ernest in London. In the city, meanwhile, he assumes the identity of the libertine Ernest. Algernon confesses a similar deception: he pretends to have an invalid friend named Bunbury in the country, whom he can \"visit\" whenever he wishes to avoid an unwelcome social obligation. Jack refuses to tell Algernon the location of his country estate.\nGwendolen and her formidable mother Lady Bracknell now call on Algernon who distracts Lady Bracknell in another room while Jack proposes to Gwendolen. She accepts, but seems to love him very largely for his professed name of Ernest. Jack accordingly resolves to himself to be rechristened \"Ernest\". Discovering them in this intimate exchange, Lady Bracknell interviews Jack as a prospective suitor. Horrified to learn that he was adopted after being discovered as a baby in a handbag at Victoria Station, she refuses him and forbids further contact with her daughter. Gwendolen, though, manages covertly to promise to him her undying love. As Jack gives her his address in the country, Algernon surreptitiously notes it on the cuff of his sleeve: Jack's revelation of his pretty and wealthy young ward has motivated his friend to meet her.\n\nThe Garden of the Manor House, Woolton\n\nCecily is studying with her governess, Miss Prism. Algernon arrives, pretending to be Ernest Worthing, and soon charms Cecily. Long fascinated by Uncle Jack's hitherto absent black sheep brother, she is predisposed to fall for Algernon in his role of Ernest (a name she, like Gwendolen, is apparently particularly fond of). Therefore, Algernon, too, plans for the rector, Dr. Chasuble, to rechristen him \"Ernest\".\nJack, meanwhile, has decided to abandon his double life. He arrives in full mourning and announces his brother's death in Paris of a severe chill, a story undermined by Algernon's presence in the guise of Ernest.\nGwendolen now enters, having run away from home. During the temporary absence of the two men, she meets Cecily, each woman indignantly declaring that she is the one engaged to \"Ernest\". When Jack and Algernon reappear, their deceptions are exposed.\n\nMorning-Room at the Manor House, Woolton\nArriving in pursuit of her daughter, Lady Bracknell is astonished to be told that Algernon and Cecily are engaged. The revelation of Cecily's trust fund soon dispels Lady Bracknell's initial doubts over the young lady's suitability, but any engagement is forbidden by her guardian Jack: he will consent only if Lady Bracknell agrees to his own union with Gwendolen—something she declines to do.\nThe impasse is broken by the return of Miss Prism, whom Lady Bracknell recognises as the person who, twenty-eight years earlier, as a family nursemaid, had taken a baby boy for a walk in a perambulator (baby carriage) and never returned. Challenged, Miss Prism explains that she had absentmindedly put the manuscript of a novel she was writing in the perambulator, and the baby in a handbag, which she had left at Victoria Station. Jack produces the very same handbag, showing that he is the lost baby, the elder son of Lady Bracknell's late sister, and thus indeed Algernon's elder brother. Having acquired such respectable relations, he is acceptable as a suitor for Gwendolen after all.\nGwendolen, though, still insists that she can only love a man named Ernest. What is her fiancé's real first name? Lady Bracknell informs Jack that, as the first-born, he would have been named after his father, General Moncrieff. Jack examines the army lists and discovers that his father's name—and hence his own real name—was in fact Ernest. Pretence was reality all along. As the happy couples embrace—Jack and Gwendolen, Algernon and Cecily, and even Dr. Chasuble and Miss Prism—Lady Bracknell complains to her newfound relative: \"My nephew, you seem to be displaying signs of triviality.\" \"On the contrary, Aunt Augusta\", he replies, \"I've now realised for the first time in my life the vital importance of being Earnest.\"\n\n", "full_text": "Transcribed from the 1915 Methuen & Co. Ltd. edition by David Price,\nemail ccx074@pglaf.org\n\n\n\n\n\nThe Importance of Being Earnest\nA Trivial Comedy for Serious People\n\n\nTHE PERSONS IN THE PLAY\n\n\nJohn Worthing, J.P.\nAlgernon Moncrieff\nRev. Canon Chasuble, D.D.\nMerriman, Butler\nLane, Manservant\nLady Bracknell\nHon. Gwendolen Fairfax\nCecily Cardew\nMiss Prism, Governess\n\n\n\n\nTHE SCENES OF THE PLAY\n\n\nACT I.  Algernon Moncrieff's Flat in Half-Moon Street, W.\n\nACT II.  The Garden at the Manor House, Woolton.\n\nACT III.  Drawing-Room at the Manor House, Woolton.\n\nTIME: The Present.\n\n\n\n\nLONDON: ST. JAMES'S THEATRE\n\n\nLessee and Manager: Mr. George Alexander\n\nFebruary 14th, 1895\n\n* * * * *\n\nJohn Worthing, J.P.: Mr. George Alexander.\nAlgernon Moncrieff: Mr. Allen Aynesworth.\nRev. Canon Chasuble, D.D.: Mr. H. H. Vincent.\nMerriman: Mr. Frank Dyall.\nLane: Mr. F. Kinsey Peile.\nLady Bracknell: Miss Rose Leclercq.\nHon. Gwendolen Fairfax: Miss Irene Vanbrugh.\nCecily Cardew: Miss Evelyn Millard.\nMiss Prism: Mrs. George Canninge.\n\n\n\n\nFIRST ACT\n\n\nSCENE\n\n\nMorning-room in Algernon's flat in Half-Moon Street.  The room is\nluxuriously and artistically furnished.  The sound of a piano is heard in\nthe adjoining room.\n\n[Lane is arranging afternoon tea on the table, and after the music has\nceased, Algernon enters.]\n\nAlgernon.  Did you hear what I was playing, Lane?\n\nLane.  I didn't think it polite to listen, sir.\n\nAlgernon.  I'm sorry for that, for your sake.  I don't play\naccurately--any one can play accurately--but I play with wonderful\nexpression.  As far as the piano is concerned, sentiment is my forte.  I\nkeep science for Life.\n\nLane.  Yes, sir.\n\nAlgernon.  And, speaking of the science of Life, have you got the\ncucumber sandwiches cut for Lady Bracknell?\n\nLane.  Yes, sir.  [Hands them on a salver.]\n\nAlgernon.  [Inspects them, takes two, and sits down on the sofa.]  Oh! . . .\nby the way, Lane, I see from your book that on Thursday night, when\nLord Shoreman and Mr. Worthing were dining with me, eight bottles of\nchampagne are entered as having been consumed.\n\nLane.  Yes, sir; eight bottles and a pint.\n\nAlgernon.  Why is it that at a bachelor's establishment the servants\ninvariably drink the champagne?  I ask merely for information.\n\nLane.  I attribute it to the superior quality of the wine, sir.  I have\noften observed that in married households the champagne is rarely of a\nfirst-rate brand.\n\nAlgernon.  Good heavens!  Is marriage so demoralising as that?\n\nLane.  I believe it _is_ a very pleasant state, sir.  I have had very\nlittle experience of it myself up to the present.  I have only been\nmarried once.  That was in consequence of a misunderstanding between\nmyself and a young person.\n\nAlgernon.  [Languidly_._]  I don't know that I am much interested in your\nfamily life, Lane.\n\nLane.  No, sir; it is not a very interesting subject.  I never think of\nit myself.\n\nAlgernon.  Very natural, I am sure.  That will do, Lane, thank you.\n\nLane.  Thank you, sir.  [Lane goes out.]\n\nAlgernon.  Lane's views on marriage seem somewhat lax.  Really, if the\nlower orders don't set us a good example, what on earth is the use of\nthem?  They seem, as a class, to have absolutely no sense of moral\nresponsibility.\n\n[Enter Lane.]\n\nLane.  Mr. Ernest Worthing.\n\n[Enter Jack.]\n\n[Lane goes out_._]\n\nAlgernon.  How are you, my dear Ernest?  What brings you up to town?\n\nJack.  Oh, pleasure, pleasure!  What else should bring one anywhere?\nEating as usual, I see, Algy!\n\nAlgernon.  [Stiffly_._]  I believe it is customary in good society to\ntake some slight refreshment at five o'clock.  Where have you been since\nlast Thursday?\n\nJack.  [Sitting down on the sofa.]  In the country.\n\nAlgernon.  What on earth do you do there?\n\nJack.  [Pulling off his gloves_._]  When one is in town one amuses\noneself.  When one is in the country one amuses other people.  It is\nexcessively boring.\n\nAlgernon.  And who are the people you amuse?\n\nJack.  [Airily_._]  Oh, neighbours, neighbours.\n\nAlgernon.  Got nice neighbours in your part of Shropshire?\n\nJack.  Perfectly horrid!  Never speak to one of them.\n\nAlgernon.  How immensely you must amuse them!  [Goes over and takes\nsandwich.]  By the way, Shropshire is your county, is it not?\n\nJack.  Eh?  Shropshire?  Yes, of course.  Hallo!  Why all these cups?  Why\ncucumber sandwiches?  Why such reckless extravagance in one so young?  Who\nis coming to tea?\n\nAlgernon.  Oh! merely Aunt Augusta and Gwendolen.\n\nJack.  How perfectly delightful!\n\nAlgernon.  Yes, that is all very well; but I am afraid Aunt Augusta won't\nquite approve of your being here.\n\nJack.  May I ask why?\n\nAlgernon.  My dear fellow, the way you flirt with Gwendolen is perfectly\ndisgraceful.  It is almost as bad as the way Gwendolen flirts with you.\n\nJack.  I am in love with Gwendolen.  I have come up to town expressly to\npropose to her.\n\nAlgernon.  I thought you had come up for pleasure? . . . I call that\nbusiness.\n\nJack.  How utterly unromantic you are!\n\nAlgernon.  I really don't see anything romantic in proposing.  It is very\nromantic to be in love.  But there is nothing romantic about a definite\nproposal.  Why, one may be accepted.  One usually is, I believe.  Then\nthe excitement is all over.  The very essence of romance is uncertainty.\nIf ever I get married, I'll certainly try to forget the fact.\n\nJack.  I have no doubt about that, dear Algy.  The Divorce Court was\nspecially invented for people whose memories are so curiously\nconstituted.\n\nAlgernon.  Oh! there is no use speculating on that subject.  Divorces are\nmade in Heaven--[Jack puts out his hand to take a sandwich.  Algernon at\nonce interferes.]  Please don't touch the cucumber sandwiches.  They are\nordered specially for Aunt Augusta.  [Takes one and eats it.]\n\nJack.  Well, you have been eating them all the time.\n\nAlgernon.  That is quite a different matter.  She is my aunt.  [Takes\nplate from below.]  Have some bread and butter.  The bread and butter is\nfor Gwendolen.  Gwendolen is devoted to bread and butter.\n\nJack.  [Advancing to table and helping himself.]  And very good bread and\nbutter it is too.\n\nAlgernon.  Well, my dear fellow, you need not eat as if you were going to\neat it all.  You behave as if you were married to her already.  You are\nnot married to her already, and I don't think you ever will be.\n\nJack.  Why on earth do you say that?\n\nAlgernon.  Well, in the first place girls never marry the men they flirt\nwith.  Girls don't think it right.\n\nJack.  Oh, that is nonsense!\n\nAlgernon.  It isn't.  It is a great truth.  It accounts for the\nextraordinary number of bachelors that one sees all over the place.  In\nthe second place, I don't give my consent.\n\nJack.  Your consent!\n\nAlgernon.  My dear fellow, Gwendolen is my first cousin.  And before I\nallow you to marry her, you will have to clear up the whole question of\nCecily.  [Rings bell.]\n\nJack.  Cecily!  What on earth do you mean?  What do you mean, Algy, by\nCecily!  I don't know any one of the name of Cecily.\n\n[Enter Lane.]\n\nAlgernon.  Bring me that cigarette case Mr. Worthing left in the smoking-\nroom the last time he dined here.\n\nLane.  Yes, sir.  [Lane goes out.]\n\nJack.  Do you mean to say you have had my cigarette case all this time?  I\nwish to goodness you had let me know.  I have been writing frantic\nletters to Scotland Yard about it.  I was very nearly offering a large\nreward.\n\nAlgernon.  Well, I wish you would offer one.  I happen to be more than\nusually hard up.\n\nJack.  There is no good offering a large reward now that the thing is\nfound.\n\n[Enter Lane with the cigarette case on a salver.  Algernon takes it at\nonce.  Lane goes out.]\n\nAlgernon.  I think that is rather mean of you, Ernest, I must say.  [Opens\ncase and examines it.]  However, it makes no matter, for, now that I look\nat the inscription inside, I find that the thing isn't yours after all.\n\nJack.  Of course it's mine.  [Moving to him.]  You have seen me with it a\nhundred times, and you have no right whatsoever to read what is written\ninside.  It is a very ungentlemanly thing to read a private cigarette\ncase.\n\nAlgernon.  Oh! it is absurd to have a hard and fast rule about what one\nshould read and what one shouldn't.  More than half of modern culture\ndepends on what one shouldn't read.\n\nJack.  I am quite aware of the fact, and I don't propose to discuss\nmodern culture.  It isn't the sort of thing one should talk of in\nprivate.  I simply want my cigarette case back.\n\nAlgernon.  Yes; but this isn't your cigarette case.  This cigarette case\nis a present from some one of the name of Cecily, and you said you didn't\nknow any one of that name.\n\nJack.  Well, if you want to know, Cecily happens to be my aunt.\n\nAlgernon.  Your aunt!\n\nJack.  Yes.  Charming old lady she is, too.  Lives at Tunbridge Wells.\nJust give it back to me, Algy.\n\nAlgernon.  [Retreating to back of sofa.]  But why does she call herself\nlittle Cecily if she is your aunt and lives at Tunbridge Wells?\n[Reading.]  'From little Cecily with her fondest love.'\n\nJack.  [Moving to sofa and kneeling upon it.]  My dear fellow, what on\nearth is there in that?  Some aunts are tall, some aunts are not tall.\nThat is a matter that surely an aunt may be allowed to decide for\nherself.  You seem to think that every aunt should be exactly like your\naunt!  That is absurd!  For Heaven's sake give me back my cigarette case.\n[Follows Algernon round the room.]\n\nAlgernon.  Yes.  But why does your aunt call you her uncle?  'From little\nCecily, with her fondest love to her dear Uncle Jack.'  There is no\nobjection, I admit, to an aunt being a small aunt, but why an aunt, no\nmatter what her size may be, should call her own nephew her uncle, I\ncan't quite make out.  Besides, your name isn't Jack at all; it is\nErnest.\n\nJack.  It isn't Ernest; it's Jack.\n\nAlgernon.  You have always told me it was Ernest.  I have introduced you\nto every one as Ernest.  You answer to the name of Ernest.  You look as\nif your name was Ernest.  You are the most earnest-looking person I ever\nsaw in my life.  It is perfectly absurd your saying that your name isn't\nErnest.  It's on your cards.  Here is one of them.  [Taking it from\ncase.]  'Mr. Ernest Worthing, B. 4, The Albany.'  I'll keep this as a\nproof that your name is Ernest if ever you attempt to deny it to me, or\nto Gwendolen, or to any one else.  [Puts the card in his pocket.]\n\nJack.  Well, my name is Ernest in town and Jack in the country, and the\ncigarette case was given to me in the country.\n\nAlgernon.  Yes, but that does not account for the fact that your small\nAunt Cecily, who lives at Tunbridge Wells, calls you her dear uncle.\nCome, old boy, you had much better have the thing out at once.\n\nJack.  My dear Algy, you talk exactly as if you were a dentist.  It is\nvery vulgar to talk like a dentist when one isn't a dentist.  It produces\na false impression.\n\nAlgernon.  Well, that is exactly what dentists always do.  Now, go on!\nTell me the whole thing.  I may mention that I have always suspected you\nof being a confirmed and secret Bunburyist; and I am quite sure of it\nnow.\n\nJack.  Bunburyist? What on earth do you mean by a Bunburyist?\n\nAlgernon.  I'll reveal to you the meaning of that incomparable expression\nas soon as you are kind enough to inform me why you are Ernest in town\nand Jack in the country.\n\nJack.  Well, produce my cigarette case first.\n\nAlgernon.  Here it is.  [Hands cigarette case.]  Now produce your\nexplanation, and pray make it improbable.  [Sits on sofa.]\n\nJack.  My dear fellow, there is nothing improbable about my explanation\nat all.  In fact it's perfectly ordinary.  Old Mr. Thomas Cardew, who\nadopted me when I was a little boy, made me in his will guardian to his\ngrand-daughter, Miss Cecily Cardew.  Cecily, who addresses me as her\nuncle from motives of respect that you could not possibly appreciate,\nlives at my place in the country under the charge of her admirable\ngoverness, Miss Prism.\n\nAlgernon.  Where is that place in the country, by the way?\n\nJack.  That is nothing to you, dear boy.  You are not going to be invited\n. . . I may tell you candidly that the place is not in Shropshire.\n\nAlgernon.  I suspected that, my dear fellow!  I have Bunburyed all over\nShropshire on two separate occasions.  Now, go on.  Why are you Ernest in\ntown and Jack in the country?\n\nJack.  My dear Algy, I don't know whether you will be able to understand\nmy real motives.  You are hardly serious enough.  When one is placed in\nthe position of guardian, one has to adopt a very high moral tone on all\nsubjects.  It's one's duty to do so.  And as a high moral tone can hardly\nbe said to conduce very much to either one's health or one's happiness,\nin order to get up to town I have always pretended to have a younger\nbrother of the name of Ernest, who lives in the Albany, and gets into the\nmost dreadful scrapes.  That, my dear Algy, is the whole truth pure and\nsimple.\n\nAlgernon.  The truth is rarely pure and never simple.  Modern life would\nbe very tedious if it were either, and modern literature a complete\nimpossibility!\n\nJack.  That wouldn't be at all a bad thing.\n\nAlgernon.  Literary criticism is not your forte, my dear fellow.  Don't\ntry it.  You should leave that to people who haven't been at a\nUniversity.  They do it so well in the daily papers.  What you really are\nis a Bunburyist.  I was quite right in saying you were a Bunburyist.  You\nare one of the most advanced Bunburyists I know.\n\nJack.  What on earth do you mean?\n\nAlgernon.  You have invented a very useful younger brother called Ernest,\nin order that you may be able to come up to town as often as you like.  I\nhave invented an invaluable permanent invalid called Bunbury, in order\nthat I may be able to go down into the country whenever I choose.  Bunbury\nis perfectly invaluable.  If it wasn't for Bunbury's extraordinary bad\nhealth, for instance, I wouldn't be able to dine with you at Willis's to-\nnight, for I have been really engaged to Aunt Augusta for more than a\nweek.\n\nJack.  I haven't asked you to dine with me anywhere to-night.\n\nAlgernon.  I know.  You are absurdly careless about sending out\ninvitations.  It is very foolish of you.  Nothing annoys people so much\nas not receiving invitations.\n\nJack.  You had much better dine with your Aunt Augusta.\n\nAlgernon.  I haven't the smallest intention of doing anything of the\nkind.  To begin with, I dined there on Monday, and once a week is quite\nenough to dine with one's own relations.  In the second place, whenever I\ndo dine there I am always treated as a member of the family, and sent\ndown with either no woman at all, or two.  In the third place, I know\nperfectly well whom she will place me next to, to-night.  She will place\nme next Mary Farquhar, who always flirts with her own husband across the\ndinner-table.  That is not very pleasant.  Indeed, it is not even decent\n. . . and that sort of thing is enormously on the increase.  The amount\nof women in London who flirt with their own husbands is perfectly\nscandalous.  It looks so bad.  It is simply washing one's clean linen in\npublic.  Besides, now that I know you to be a confirmed Bunburyist I\nnaturally want to talk to you about Bunburying.  I want to tell you the\nrules.\n\nJack.  I'm not a Bunburyist at all.  If Gwendolen accepts me, I am going\nto kill my brother, indeed I think I'll kill him in any case.  Cecily is\na little too much interested in him.  It is rather a bore.  So I am going\nto get rid of Ernest.  And I strongly advise you to do the same with Mr.\n. . . with your invalid friend who has the absurd name.\n\nAlgernon.  Nothing will induce me to part with Bunbury, and if you ever\nget married, which seems to me extremely problematic, you will be very\nglad to know Bunbury.  A man who marries without knowing Bunbury has a\nvery tedious time of it.\n\nJack.  That is nonsense.  If I marry a charming girl like Gwendolen, and\nshe is the only girl I ever saw in my life that I would marry, I\ncertainly won't want to know Bunbury.\n\nAlgernon.  Then your wife will.  You don't seem to realise, that in\nmarried life three is company and two is none.\n\nJack.  [Sententiously.]  That, my dear young friend, is the theory that\nthe corrupt French Drama has been propounding for the last fifty years.\n\nAlgernon.  Yes; and that the happy English home has proved in half the\ntime.\n\nJack.  For heaven's sake, don't try to be cynical.  It's perfectly easy\nto be cynical.\n\nAlgernon.  My dear fellow, it isn't easy to be anything nowadays.  There's\nsuch a lot of beastly competition about.  [The sound of an electric bell\nis heard.]  Ah! that must be Aunt Augusta.  Only relatives, or creditors,\never ring in that Wagnerian manner.  Now, if I get her out of the way for\nten minutes, so that you can have an opportunity for proposing to\nGwendolen, may I dine with you to-night at Willis's?\n\nJack.  I suppose so, if you want to.\n\nAlgernon.  Yes, but you must be serious about it.  I hate people who are\nnot serious about meals.  It is so shallow of them.\n\n[Enter Lane.]\n\nLane.  Lady Bracknell and Miss Fairfax.\n\n[Algernon goes forward to meet them.  Enter Lady Bracknell and\nGwendolen.]\n\nLady Bracknell.  Good afternoon, dear Algernon, I hope you are behaving\nvery well.\n\nAlgernon.  I'm feeling very well, Aunt Augusta.\n\nLady Bracknell.  That's not quite the same thing.  In fact the two things\nrarely go together.  [Sees Jack and bows to him with icy coldness.]\n\nAlgernon.  [To Gwendolen.]  Dear me, you are smart!\n\nGwendolen.  I am always smart!  Am I not, Mr. Worthing?\n\nJack.  You're quite perfect, Miss Fairfax.\n\nGwendolen.  Oh! I hope I am not that.  It would leave no room for\ndevelopments, and I intend to develop in many directions.  [Gwendolen and\nJack sit down together in the corner.]\n\nLady Bracknell.  I'm sorry if we are a little late, Algernon, but I was\nobliged to call on dear Lady Harbury.  I hadn't been there since her poor\nhusband's death.  I never saw a woman so altered; she looks quite twenty\nyears younger.  And now I'll have a cup of tea, and one of those nice\ncucumber sandwiches you promised me.\n\nAlgernon.  Certainly, Aunt Augusta.  [Goes over to tea-table.]\n\nLady Bracknell.  Won't you come and sit here, Gwendolen?\n\nGwendolen.  Thanks, mamma, I'm quite comfortable where I am.\n\nAlgernon.  [Picking up empty plate in horror.]  Good heavens!  Lane!  Why\nare there no cucumber sandwiches?  I ordered them specially.\n\nLane.  [Gravely.]  There were no cucumbers in the market this morning,\nsir.  I went down twice.\n\nAlgernon.  No cucumbers!\n\nLane.  No, sir.  Not even for ready money.\n\nAlgernon.  That will do, Lane, thank you.\n\nLane.  Thank you, sir.  [Goes out.]\n\nAlgernon.  I am greatly distressed, Aunt Augusta, about there being no\ncucumbers, not even for ready money.\n\nLady Bracknell.  It really makes no matter, Algernon.  I had some\ncrumpets with Lady Harbury, who seems to me to be living entirely for\npleasure now.\n\nAlgernon.  I hear her hair has turned quite gold from grief.\n\nLady Bracknell.  It certainly has changed its colour.  From what cause I,\nof course, cannot say.  [Algernon crosses and hands tea.]  Thank you.\nI've quite a treat for you to-night, Algernon.  I am going to send you\ndown with Mary Farquhar.  She is such a nice woman, and so attentive to\nher husband.  It's delightful to watch them.\n\nAlgernon.  I am afraid, Aunt Augusta, I shall have to give up the\npleasure of dining with you to-night after all.\n\nLady Bracknell.  [Frowning.]  I hope not, Algernon.  It would put my\ntable completely out.  Your uncle would have to dine upstairs.\nFortunately he is accustomed to that.\n\nAlgernon.  It is a great bore, and, I need hardly say, a terrible\ndisappointment to me, but the fact is I have just had a telegram to say\nthat my poor friend Bunbury is very ill again.  [Exchanges glances with\nJack.]  They seem to think I should be with him.\n\nLady Bracknell.  It is very strange.  This Mr. Bunbury seems to suffer\nfrom curiously bad health.\n\nAlgernon.  Yes; poor Bunbury is a dreadful invalid.\n\nLady Bracknell.  Well, I must say, Algernon, that I think it is high time\nthat Mr. Bunbury made up his mind whether he was going to live or to die.\nThis shilly-shallying with the question is absurd.  Nor do I in any way\napprove of the modern sympathy with invalids.  I consider it morbid.\nIllness of any kind is hardly a thing to be encouraged in others.  Health\nis the primary duty of life.  I am always telling that to your poor\nuncle, but he never seems to take much notice . . . as far as any\nimprovement in his ailment goes.  I should be much obliged if you would\nask Mr. Bunbury, from me, to be kind enough not to have a relapse on\nSaturday, for I rely on you to arrange my music for me.  It is my last\nreception, and one wants something that will encourage conversation,\nparticularly at the end of the season when every one has practically said\nwhatever they had to say, which, in most cases, was probably not much.\n\nAlgernon.  I'll speak to Bunbury, Aunt Augusta, if he is still conscious,\nand I think I can promise you he'll be all right by Saturday.  Of course\nthe music is a great difficulty.  You see, if one plays good music,\npeople don't listen, and if one plays bad music people don't talk.  But\nI'll run over the programme I've drawn out, if you will kindly come into\nthe next room for a moment.\n\nLady Bracknell.  Thank you, Algernon.  It is very thoughtful of you.\n[Rising, and following Algernon.]  I'm sure the programme will be\ndelightful, after a few expurgations.  French songs I cannot possibly\nallow.  People always seem to think that they are improper, and either\nlook shocked, which is vulgar, or laugh, which is worse.  But German\nsounds a thoroughly respectable language, and indeed, I believe is so.\nGwendolen, you will accompany me.\n\nGwendolen.  Certainly, mamma.\n\n[Lady Bracknell and Algernon go into the music-room, Gwendolen remains\nbehind.]\n\nJack.  Charming day it has been, Miss Fairfax.\n\nGwendolen.  Pray don't talk to me about the weather, Mr. Worthing.\nWhenever people talk to me about the weather, I always feel quite certain\nthat they mean something else.  And that makes me so nervous.\n\nJack.  I do mean something else.\n\nGwendolen.  I thought so.  In fact, I am never wrong.\n\nJack.  And I would like to be allowed to take advantage of Lady\nBracknell's temporary absence . . .\n\nGwendolen.  I would certainly advise you to do so.  Mamma has a way of\ncoming back suddenly into a room that I have often had to speak to her\nabout.\n\nJack.  [Nervously.]  Miss Fairfax, ever since I met you I have admired\nyou more than any girl . . . I have ever met since . . . I met you.\n\nGwendolen.  Yes, I am quite well aware of the fact.  And I often wish\nthat in public, at any rate, you had been more demonstrative.  For me you\nhave always had an irresistible fascination.  Even before I met you I was\nfar from indifferent to you.  [Jack looks at her in amazement.]  We live,\nas I hope you know, Mr. Worthing, in an age of ideals.  The fact is\nconstantly mentioned in the more expensive monthly magazines, and has\nreached the provincial pulpits, I am told; and my ideal has always been\nto love some one of the name of Ernest.  There is something in that name\nthat inspires absolute confidence.  The moment Algernon first mentioned\nto me that he had a friend called Ernest, I knew I was destined to love\nyou.\n\nJack.  You really love me, Gwendolen?\n\nGwendolen.  Passionately!\n\nJack.  Darling!  You don't know how happy you've made me.\n\nGwendolen.  My own Ernest!\n\nJack.  But you don't really mean to say that you couldn't love me if my\nname wasn't Ernest?\n\nGwendolen.  But your name is Ernest.\n\nJack.  Yes, I know it is.  But supposing it was something else?  Do you\nmean to say you couldn't love me then?\n\nGwendolen.  [Glibly.]  Ah! that is clearly a metaphysical speculation,\nand like most metaphysical speculations has very little reference at all\nto the actual facts of real life, as we know them.\n\nJack.  Personally, darling, to speak quite candidly, I don't much care\nabout the name of Ernest . . . I don't think the name suits me at all.\n\nGwendolen.  It suits you perfectly.  It is a divine name.  It has a music\nof its own.  It produces vibrations.\n\nJack.  Well, really, Gwendolen, I must say that I think there are lots of\nother much nicer names.  I think Jack, for instance, a charming name.\n\nGwendolen.  Jack? . . . No, there is very little music in the name Jack,\nif any at all, indeed.  It does not thrill.  It produces absolutely no\nvibrations . . . I have known several Jacks, and they all, without\nexception, were more than usually plain.  Besides, Jack is a notorious\ndomesticity for John!  And I pity any woman who is married to a man\ncalled John.  She would probably never be allowed to know the entrancing\npleasure of a single moment's solitude.  The only really safe name is\nErnest.\n\nJack.  Gwendolen, I must get christened at once--I mean we must get\nmarried at once.  There is no time to be lost.\n\nGwendolen.  Married, Mr. Worthing?\n\nJack.  [Astounded.]  Well . . . surely.  You know that I love you, and\nyou led me to believe, Miss Fairfax, that you were not absolutely\nindifferent to me.\n\nGwendolen.  I adore you.  But you haven't proposed to me yet.  Nothing\nhas been said at all about marriage.  The subject has not even been\ntouched on.\n\nJack.  Well . . . may I propose to you now?\n\nGwendolen.  I think it would be an admirable opportunity.  And to spare\nyou any possible disappointment, Mr. Worthing, I think it only fair to\ntell you quite frankly before-hand that I am fully determined to accept\nyou.\n\nJack.  Gwendolen!\n\nGwendolen.  Yes, Mr. Worthing, what have you got to say to me?\n\nJack.  You know what I have got to say to you.\n\nGwendolen.  Yes, but you don't say it.\n\nJack.  Gwendolen, will you marry me?  [Goes on his knees.]\n\nGwendolen.  Of course I will, darling.  How long you have been about it!\nI am afraid you have had very little experience in how to propose.\n\nJack.  My own one, I have never loved any one in the world but you.\n\nGwendolen.  Yes, but men often propose for practice.  I know my brother\nGerald does.  All my girl-friends tell me so.  What wonderfully blue eyes\nyou have, Ernest!  They are quite, quite, blue.  I hope you will always\nlook at me just like that, especially when there are other people\npresent.  [Enter Lady Bracknell.]\n\nLady Bracknell.  Mr. Worthing!  Rise, sir, from this semi-recumbent\nposture.  It is most indecorous.\n\nGwendolen.  Mamma!  [He tries to rise; she restrains him.]  I must beg\nyou to retire.  This is no place for you.  Besides, Mr. Worthing has not\nquite finished yet.\n\nLady Bracknell.  Finished what, may I ask?\n\nGwendolen.  I am engaged to Mr. Worthing, mamma.  [They rise together.]\n\nLady Bracknell.  Pardon me, you are not engaged to any one.  When you do\nbecome engaged to some one, I, or your father, should his health permit\nhim, will inform you of the fact.  An engagement should come on a young\ngirl as a surprise, pleasant or unpleasant, as the case may be.  It is\nhardly a matter that she could be allowed to arrange for herself . . .\nAnd now I have a few questions to put to you, Mr. Worthing.  While I am\nmaking these inquiries, you, Gwendolen, will wait for me below in the\ncarriage.\n\nGwendolen.  [Reproachfully.]  Mamma!\n\nLady Bracknell.  In the carriage, Gwendolen!  [Gwendolen goes to the\ndoor.  She and Jack blow kisses to each other behind Lady Bracknell's\nback.  Lady Bracknell looks vaguely about as if she could not understand\nwhat the noise was.  Finally turns round.]  Gwendolen, the carriage!\n\nGwendolen.  Yes, mamma.  [Goes out, looking back at Jack.]\n\nLady Bracknell.  [Sitting down.]  You can take a seat, Mr. Worthing.\n\n[Looks in her pocket for note-book and pencil.]\n\nJack.  Thank you, Lady Bracknell, I prefer standing.\n\nLady Bracknell.  [Pencil and note-book in hand.]  I feel bound to tell\nyou that you are not down on my list of eligible young men, although I\nhave the same list as the dear Duchess of Bolton has.  We work together,\nin fact.  However, I am quite ready to enter your name, should your\nanswers be what a really affectionate mother requires.  Do you smoke?\n\nJack.  Well, yes, I must admit I smoke.\n\nLady Bracknell.  I am glad to hear it.  A man should always have an\noccupation of some kind.  There are far too many idle men in London as it\nis.  How old are you?\n\nJack.  Twenty-nine.\n\nLady Bracknell.  A very good age to be married at.  I have always been of\nopinion that a man who desires to get married should know either\neverything or nothing.  Which do you know?\n\nJack.  [After some hesitation.]  I know nothing, Lady Bracknell.\n\nLady Bracknell.  I am pleased to hear it.  I do not approve of anything\nthat tampers with natural ignorance.  Ignorance is like a delicate exotic\nfruit; touch it and the bloom is gone.  The whole theory of modern\neducation is radically unsound.  Fortunately in England, at any rate,\neducation produces no effect whatsoever.  If it did, it would prove a\nserious danger to the upper classes, and probably lead to acts of\nviolence in Grosvenor Square.  What is your income?\n\nJack.  Between seven and eight thousand a year.\n\nLady Bracknell.  [Makes a note in her book.]  In land, or in investments?\n\nJack.  In investments, chiefly.\n\nLady Bracknell.  That is satisfactory.  What between the duties expected\nof one during one's lifetime, and the duties exacted from one after one's\ndeath, land has ceased to be either a profit or a pleasure.  It gives one\nposition, and prevents one from keeping it up.  That's all that can be\nsaid about land.\n\nJack.  I have a country house with some land, of course, attached to it,\nabout fifteen hundred acres, I believe; but I don't depend on that for my\nreal income.  In fact, as far as I can make out, the poachers are the\nonly people who make anything out of it.\n\nLady Bracknell.  A country house!  How many bedrooms?  Well, that point\ncan be cleared up afterwards.  You have a town house, I hope?  A girl\nwith a simple, unspoiled nature, like Gwendolen, could hardly be expected\nto reside in the country.\n\nJack.  Well, I own a house in Belgrave Square, but it is let by the year\nto Lady Bloxham.  Of course, I can get it back whenever I like, at six\nmonths' notice.\n\nLady Bracknell.  Lady Bloxham?  I don't know her.\n\nJack.  Oh, she goes about very little.  She is a lady considerably\nadvanced in years.\n\nLady Bracknell.  Ah, nowadays that is no guarantee of respectability of\ncharacter.  What number in Belgrave Square?\n\nJack.  149.\n\nLady Bracknell.  [Shaking her head.]  The unfashionable side.  I thought\nthere was something.  However, that could easily be altered.\n\nJack.  Do you mean the fashion, or the side?\n\nLady Bracknell.  [Sternly.]  Both, if necessary, I presume.  What are\nyour politics?\n\nJack.  Well, I am afraid I really have none.  I am a Liberal Unionist.\n\nLady Bracknell.  Oh, they count as Tories.  They dine with us.  Or come\nin the evening, at any rate.  Now to minor matters.  Are your parents\nliving?\n\nJack.  I have lost both my parents.\n\nLady Bracknell.  To lose one parent, Mr. Worthing, may be regarded as a\nmisfortune; to lose both looks like carelessness.  Who was your father?\nHe was evidently a man of some wealth.  Was he born in what the Radical\npapers call the purple of commerce, or did he rise from the ranks of the\naristocracy?\n\nJack.  I am afraid I really don't know.  The fact is, Lady Bracknell, I\nsaid I had lost my parents.  It would be nearer the truth to say that my\nparents seem to have lost me . . . I don't actually know who I am by\nbirth.  I was . . . well, I was found.\n\nLady Bracknell.  Found!\n\nJack.  The late Mr. Thomas Cardew, an old gentleman of a very charitable\nand kindly disposition, found me, and gave me the name of Worthing,\nbecause he happened to have a first-class ticket for Worthing in his\npocket at the time.  Worthing is a place in Sussex.  It is a seaside\nresort.\n\nLady Bracknell.  Where did the charitable gentleman who had a first-class\nticket for this seaside resort find you?\n\nJack.  [Gravely.]  In a hand-bag.\n\nLady Bracknell.  A hand-bag?\n\nJack.  [Very seriously.]  Yes, Lady Bracknell.  I was in a hand-bag--a\nsomewhat large, black leather hand-bag, with handles to it--an ordinary\nhand-bag in fact.\n\nLady Bracknell.  In what locality did this Mr. James, or Thomas, Cardew\ncome across this ordinary hand-bag?\n\nJack.  In the cloak-room at Victoria Station.  It was given to him in\nmistake for his own.\n\nLady Bracknell.  The cloak-room at Victoria Station?\n\nJack.  Yes.  The Brighton line.\n\nLady Bracknell.  The line is immaterial.  Mr. Worthing, I confess I feel\nsomewhat bewildered by what you have just told me.  To be born, or at any\nrate bred, in a hand-bag, whether it had handles or not, seems to me to\ndisplay a contempt for the ordinary decencies of family life that reminds\none of the worst excesses of the French Revolution.  And I presume you\nknow what that unfortunate movement led to?  As for the particular\nlocality in which the hand-bag was found, a cloak-room at a railway\nstation might serve to conceal a social indiscretion--has probably,\nindeed, been used for that purpose before now--but it could hardly be\nregarded as an assured basis for a recognised position in good society.\n\nJack.  May I ask you then what you would advise me to do?  I need hardly\nsay I would do anything in the world to ensure Gwendolen's happiness.\n\nLady Bracknell.  I would strongly advise you, Mr. Worthing, to try and\nacquire some relations as soon as possible, and to make a definite effort\nto produce at any rate one parent, of either sex, before the season is\nquite over.\n\nJack.  Well, I don't see how I could possibly manage to do that.  I can\nproduce the hand-bag at any moment.  It is in my dressing-room at home.  I\nreally think that should satisfy you, Lady Bracknell.\n\nLady Bracknell.  Me, sir!  What has it to do with me?  You can hardly\nimagine that I and Lord Bracknell would dream of allowing our only\ndaughter--a girl brought up with the utmost care--to marry into a cloak-\nroom, and form an alliance with a parcel?  Good morning, Mr. Worthing!\n\n[Lady Bracknell sweeps out in majestic indignation.]\n\nJack.  Good morning!  [Algernon, from the other room, strikes up the\nWedding March.  Jack looks perfectly furious, and goes to the door.]  For\ngoodness' sake don't play that ghastly tune, Algy.  How idiotic you are!\n\n[The music stops and Algernon enters cheerily.]\n\nAlgernon.  Didn't it go off all right, old boy?  You don't mean to say\nGwendolen refused you?  I know it is a way she has.  She is always\nrefusing people.  I think it is most ill-natured of her.\n\nJack.  Oh, Gwendolen is as right as a trivet.  As far as she is\nconcerned, we are engaged.  Her mother is perfectly unbearable.  Never\nmet such a Gorgon . . . I don't really know what a Gorgon is like, but I\nam quite sure that Lady Bracknell is one.  In any case, she is a monster,\nwithout being a myth, which is rather unfair . . . I beg your pardon,\nAlgy, I suppose I shouldn't talk about your own aunt in that way before\nyou.\n\nAlgernon.  My dear boy, I love hearing my relations abused.  It is the\nonly thing that makes me put up with them at all.  Relations are simply a\ntedious pack of people, who haven't got the remotest knowledge of how to\nlive, nor the smallest instinct about when to die.\n\nJack.  Oh, that is nonsense!\n\nAlgernon.  It isn't!\n\nJack.  Well, I won't argue about the matter.  You always want to argue\nabout things.\n\nAlgernon.  That is exactly what things were originally made for.\n\nJack.  Upon my word, if I thought that, I'd shoot myself . . . [A pause.]\nYou don't think there is any chance of Gwendolen becoming like her mother\nin about a hundred and fifty years, do you, Algy?\n\nAlgernon.  All women become like their mothers.  That is their tragedy.\nNo man does.  That's his.\n\nJack.  Is that clever?\n\nAlgernon.  It is perfectly phrased! and quite as true as any observation\nin civilised life should be.\n\nJack.  I am sick to death of cleverness.  Everybody is clever nowadays.\nYou can't go anywhere without meeting clever people.  The thing has\nbecome an absolute public nuisance.  I wish to goodness we had a few\nfools left.\n\nAlgernon.  We have.\n\nJack.  I should extremely like to meet them.  What do they talk about?\n\nAlgernon.  The fools?  Oh! about the clever people, of course.\n\nJack.  What fools!\n\nAlgernon.  By the way, did you tell Gwendolen the truth about your being\nErnest in town, and Jack in the country?\n\nJack.  [In a very patronising manner.]  My dear fellow, the truth isn't\nquite the sort of thing one tells to a nice, sweet, refined girl.  What\nextraordinary ideas you have about the way to behave to a woman!\n\nAlgernon.  The only way to behave to a woman is to make love to her, if\nshe is pretty, and to some one else, if she is plain.\n\nJack.  Oh, that is nonsense.\n\nAlgernon.  What about your brother?  What about the profligate Ernest?\n\nJack.  Oh, before the end of the week I shall have got rid of him.  I'll\nsay he died in Paris of apoplexy.  Lots of people die of apoplexy, quite\nsuddenly, don't they?\n\nAlgernon.  Yes, but it's hereditary, my dear fellow.  It's a sort of\nthing that runs in families.  You had much better say a severe chill.\n\nJack.  You are sure a severe chill isn't hereditary, or anything of that\nkind?\n\nAlgernon.  Of course it isn't!\n\nJack.  Very well, then.  My poor brother Ernest to carried off suddenly,\nin Paris, by a severe chill.  That gets rid of him.\n\nAlgernon.  But I thought you said that . . . Miss Cardew was a little too\nmuch interested in your poor brother Ernest?  Won't she feel his loss a\ngood deal?\n\nJack.  Oh, that is all right.  Cecily is not a silly romantic girl, I am\nglad to say.  She has got a capital appetite, goes long walks, and pays\nno attention at all to her lessons.\n\nAlgernon.  I would rather like to see Cecily.\n\nJack.  I will take very good care you never do.  She is excessively\npretty, and she is only just eighteen.\n\nAlgernon.  Have you told Gwendolen yet that you have an excessively\npretty ward who is only just eighteen?\n\nJack.  Oh! one doesn't blurt these things out to people.  Cecily and\nGwendolen are perfectly certain to be extremely great friends.  I'll bet\nyou anything you like that half an hour after they have met, they will be\ncalling each other sister.\n\nAlgernon.  Women only do that when they have called each other a lot of\nother things first.  Now, my dear boy, if we want to get a good table at\nWillis's, we really must go and dress.  Do you know it is nearly seven?\n\nJack.  [Irritably.]  Oh!  It always is nearly seven.\n\nAlgernon.  Well, I'm hungry.\n\nJack.  I never knew you when you weren't . . .\n\nAlgernon.  What shall we do after dinner?  Go to a theatre?\n\nJack.  Oh no!  I loathe listening.\n\nAlgernon.  Well, let us go to the Club?\n\nJack.  Oh, no!  I hate talking.\n\nAlgernon.  Well, we might trot round to the Empire at ten?\n\nJack.  Oh, no!  I can't bear looking at things.  It is so silly.\n\nAlgernon.  Well, what shall we do?\n\nJack.  Nothing!\n\nAlgernon.  It is awfully hard work doing nothing.  However, I don't mind\nhard work where there is no definite object of any kind.\n\n[Enter Lane.]\n\nLane.  Miss Fairfax.\n\n[Enter Gwendolen.  Lane goes out.]\n\nAlgernon.  Gwendolen, upon my word!\n\nGwendolen.  Algy, kindly turn your back.  I have something very\nparticular to say to Mr. Worthing.\n\nAlgernon.  Really, Gwendolen, I don't think I can allow this at all.\n\nGwendolen.  Algy, you always adopt a strictly immoral attitude towards\nlife.  You are not quite old enough to do that.  [Algernon retires to the\nfireplace.]\n\nJack.  My own darling!\n\nGwendolen.  Ernest, we may never be married.  From the expression on\nmamma's face I fear we never shall.  Few parents nowadays pay any regard\nto what their children say to them.  The old-fashioned respect for the\nyoung is fast dying out.  Whatever influence I ever had over mamma, I\nlost at the age of three.  But although she may prevent us from becoming\nman and wife, and I may marry some one else, and marry often, nothing\nthat she can possibly do can alter my eternal devotion to you.\n\nJack.  Dear Gwendolen!\n\nGwendolen.  The story of your romantic origin, as related to me by mamma,\nwith unpleasing comments, has naturally stirred the deeper fibres of my\nnature.  Your Christian name has an irresistible fascination.  The\nsimplicity of your character makes you exquisitely incomprehensible to\nme.  Your town address at the Albany I have.  What is your address in the\ncountry?\n\nJack.  The Manor House, Woolton, Hertfordshire.\n\n[Algernon, who has been carefully listening, smiles to himself, and\nwrites the address on his shirt-cuff.  Then picks up the Railway Guide.]\n\nGwendolen.  There is a good postal service, I suppose?  It may be\nnecessary to do something desperate.  That of course will require serious\nconsideration.  I will communicate with you daily.\n\nJack.  My own one!\n\nGwendolen.  How long do you remain in town?\n\nJack.  Till Monday.\n\nGwendolen.  Good!  Algy, you may turn round now.\n\nAlgernon.  Thanks, I've turned round already.\n\nGwendolen.  You may also ring the bell.\n\nJack.  You will let me see you to your carriage, my own darling?\n\nGwendolen.  Certainly.\n\nJack.  [To Lane, who now enters.]  I will see Miss Fairfax out.\n\nLane.  Yes, sir.  [Jack and Gwendolen go off.]\n\n[Lane presents several letters on a salver to Algernon.  It is to be\nsurmised that they are bills, as Algernon, after looking at the\nenvelopes, tears them up.]\n\nAlgernon.  A glass of sherry, Lane.\n\nLane.  Yes, sir.\n\nAlgernon.  To-morrow, Lane, I'm going Bunburying.\n\nLane.  Yes, sir.\n\nAlgernon.  I shall probably not be back till Monday.  You can put up my\ndress clothes, my smoking jacket, and all the Bunbury suits . . .\n\nLane.  Yes, sir.  [Handing sherry.]\n\nAlgernon.  I hope to-morrow will be a fine day, Lane.\n\nLane.  It never is, sir.\n\nAlgernon.  Lane, you're a perfect pessimist.\n\nLane.  I do my best to give satisfaction, sir.\n\n[Enter Jack.  Lane goes off.]\n\nJack.  There's a sensible, intellectual girl! the only girl I ever cared\nfor in my life.  [Algernon is laughing immoderately.]  What on earth are\nyou so amused at?\n\nAlgernon.  Oh, I'm a little anxious about poor Bunbury, that is all.\n\nJack.  If you don't take care, your friend Bunbury will get you into a\nserious scrape some day.\n\nAlgernon.  I love scrapes.  They are the only things that are never\nserious.\n\nJack.  Oh, that's nonsense, Algy.  You never talk anything but nonsense.\n\nAlgernon.  Nobody ever does.\n\n[Jack looks indignantly at him, and leaves the room.  Algernon lights a\ncigarette, reads his shirt-cuff, and smiles.]\n\nACT DROP\n\n\n\n\nSECOND ACT\n\n\nSCENE\n\n\nGarden at the Manor House.  A flight of grey stone steps leads up to the\nhouse.  The garden, an old-fashioned one, full of roses.  Time of year,\nJuly.  Basket chairs, and a table covered with books, are set under a\nlarge yew-tree.\n\n[Miss Prism discovered seated at the table.  Cecily is at the back\nwatering flowers.]\n\nMiss Prism.  [Calling.]  Cecily, Cecily!  Surely such a utilitarian\noccupation as the watering of flowers is rather Moulton's duty than\nyours?  Especially at a moment when intellectual pleasures await you.\nYour German grammar is on the table.  Pray open it at page fifteen.  We\nwill repeat yesterday's lesson.\n\nCecily.  [Coming over very slowly.]  But I don't like German.  It isn't\nat all a becoming language.  I know perfectly well that I look quite\nplain after my German lesson.\n\nMiss Prism.  Child, you know how anxious your guardian is that you should\nimprove yourself in every way.  He laid particular stress on your German,\nas he was leaving for town yesterday.  Indeed, he always lays stress on\nyour German when he is leaving for town.\n\nCecily.  Dear Uncle Jack is so very serious!  Sometimes he is so serious\nthat I think he cannot be quite well.\n\nMiss Prism.  [Drawing herself up.]  Your guardian enjoys the best of\nhealth, and his gravity of demeanour is especially to be commended in one\nso comparatively young as he is.  I know no one who has a higher sense of\nduty and responsibility.\n\nCecily.  I suppose that is why he often looks a little bored when we\nthree are together.\n\nMiss Prism.  Cecily!  I am surprised at you.  Mr. Worthing has many\ntroubles in his life.  Idle merriment and triviality would be out of\nplace in his conversation.  You must remember his constant anxiety about\nthat unfortunate young man his brother.\n\nCecily.  I wish Uncle Jack would allow that unfortunate young man, his\nbrother, to come down here sometimes.  We might have a good influence\nover him, Miss Prism.  I am sure you certainly would.  You know German,\nand geology, and things of that kind influence a man very much.  [Cecily\nbegins to write in her diary.]\n\nMiss Prism.  [Shaking her head.]  I do not think that even I could\nproduce any effect on a character that according to his own brother's\nadmission is irretrievably weak and vacillating.  Indeed I am not sure\nthat I would desire to reclaim him.  I am not in favour of this modern\nmania for turning bad people into good people at a moment's notice.  As a\nman sows so let him reap.  You must put away your diary, Cecily.  I\nreally don't see why you should keep a diary at all.\n\nCecily.  I keep a diary in order to enter the wonderful secrets of my\nlife.  If I didn't write them down, I should probably forget all about\nthem.\n\nMiss Prism.  Memory, my dear Cecily, is the diary that we all carry about\nwith us.\n\nCecily.  Yes, but it usually chronicles the things that have never\nhappened, and couldn't possibly have happened.  I believe that Memory is\nresponsible for nearly all the three-volume novels that Mudie sends us.\n\nMiss Prism.  Do not speak slightingly of the three-volume novel, Cecily.\nI wrote one myself in earlier days.\n\nCecily.  Did you really, Miss Prism?  How wonderfully clever you are!  I\nhope it did not end happily?  I don't like novels that end happily.  They\ndepress me so much.\n\nMiss Prism.  The good ended happily, and the bad unhappily.  That is what\nFiction means.\n\nCecily.  I suppose so.  But it seems very unfair.  And was your novel\never published?\n\nMiss Prism.  Alas! no.  The manuscript unfortunately was abandoned.\n[Cecily starts.]  I use the word in the sense of lost or mislaid.  To\nyour work, child, these speculations are profitless.\n\nCecily.  [Smiling.]  But I see dear Dr. Chasuble coming up through the\ngarden.\n\nMiss Prism.  [Rising and advancing.]  Dr. Chasuble!  This is indeed a\npleasure.\n\n[Enter Canon Chasuble.]\n\nChasuble.  And how are we this morning?  Miss Prism, you are, I trust,\nwell?\n\nCecily.  Miss Prism has just been complaining of a slight headache.  I\nthink it would do her so much good to have a short stroll with you in the\nPark, Dr. Chasuble.\n\nMiss Prism.  Cecily, I have not mentioned anything about a headache.\n\nCecily.  No, dear Miss Prism, I know that, but I felt instinctively that\nyou had a headache.  Indeed I was thinking about that, and not about my\nGerman lesson, when the Rector came in.\n\nChasuble.  I hope, Cecily, you are not inattentive.\n\nCecily.  Oh, I am afraid I am.\n\nChasuble.  That is strange.  Were I fortunate enough to be Miss Prism's\npupil, I would hang upon her lips.  [Miss Prism glares.]  I spoke\nmetaphorically.--My metaphor was drawn from bees.  Ahem!  Mr. Worthing, I\nsuppose, has not returned from town yet?\n\nMiss Prism.  We do not expect him till Monday afternoon.\n\nChasuble.  Ah yes, he usually likes to spend his Sunday in London.  He is\nnot one of those whose sole aim is enjoyment, as, by all accounts, that\nunfortunate young man his brother seems to be.  But I must not disturb\nEgeria and her pupil any longer.\n\nMiss Prism.  Egeria?  My name is Laetitia, Doctor.\n\nChasuble.  [Bowing.]  A classical allusion merely, drawn from the Pagan\nauthors.  I shall see you both no doubt at Evensong?\n\nMiss Prism.  I think, dear Doctor, I will have a stroll with you.  I find\nI have a headache after all, and a walk might do it good.\n\nChasuble.  With pleasure, Miss Prism, with pleasure.  We might go as far\nas the schools and back.\n\nMiss Prism.  That would be delightful.  Cecily, you will read your\nPolitical Economy in my absence.  The chapter on the Fall of the Rupee\nyou may omit.  It is somewhat too sensational.  Even these metallic\nproblems have their melodramatic side.\n\n[Goes down the garden with Dr. Chasuble.]\n\nCecily.  [Picks up books and throws them back on table.]  Horrid\nPolitical Economy!  Horrid Geography!  Horrid, horrid German!\n\n[Enter Merriman with a card on a salver.]\n\nMerriman.  Mr. Ernest Worthing has just driven over from the station.  He\nhas brought his luggage with him.\n\nCecily.  [Takes the card and reads it.]  'Mr. Ernest Worthing, B. 4, The\nAlbany, W.'  Uncle Jack's brother!  Did you tell him Mr. Worthing was in\ntown?\n\nMerriman.  Yes, Miss.  He seemed very much disappointed.  I mentioned\nthat you and Miss Prism were in the garden.  He said he was anxious to\nspeak to you privately for a moment.\n\nCecily.  Ask Mr. Ernest Worthing to come here.  I suppose you had better\ntalk to the housekeeper about a room for him.\n\nMerriman.  Yes, Miss.\n\n[Merriman goes off.]\n\nCecily.  I have never met any really wicked person before.  I feel rather\nfrightened.  I am so afraid he will look just like every one else.\n\n[Enter Algernon, very gay and debonnair.]  He does!\n\nAlgernon.  [Raising his hat.]  You are my little cousin Cecily, I'm sure.\n\nCecily.  You are under some strange mistake.  I am not little.  In fact,\nI believe I am more than usually tall for my age.  [Algernon is rather\ntaken aback.]  But I am your cousin Cecily.  You, I see from your card,\nare Uncle Jack's brother, my cousin Ernest, my wicked cousin Ernest.\n\nAlgernon.  Oh! I am not really wicked at all, cousin Cecily.  You mustn't\nthink that I am wicked.\n\nCecily.  If you are not, then you have certainly been deceiving us all in\na very inexcusable manner.  I hope you have not been leading a double\nlife, pretending to be wicked and being really good all the time.  That\nwould be hypocrisy.\n\nAlgernon.  [Looks at her in amazement.]  Oh!  Of course I have been\nrather reckless.\n\nCecily.  I am glad to hear it.\n\nAlgernon.  In fact, now you mention the subject, I have been very bad in\nmy own small way.\n\nCecily.  I don't think you should be so proud of that, though I am sure\nit must have been very pleasant.\n\nAlgernon.  It is much pleasanter being here with you.\n\nCecily.  I can't understand how you are here at all.  Uncle Jack won't be\nback till Monday afternoon.\n\nAlgernon.  That is a great disappointment.  I am obliged to go up by the\nfirst train on Monday morning.  I have a business appointment that I am\nanxious . . . to miss?\n\nCecily.  Couldn't you miss it anywhere but in London?\n\nAlgernon.  No: the appointment is in London.\n\nCecily.  Well, I know, of course, how important it is not to keep a\nbusiness engagement, if one wants to retain any sense of the beauty of\nlife, but still I think you had better wait till Uncle Jack arrives.  I\nknow he wants to speak to you about your emigrating.\n\nAlgernon.  About my what?\n\nCecily.  Your emigrating.  He has gone up to buy your outfit.\n\nAlgernon.  I certainly wouldn't let Jack buy my outfit.  He has no taste\nin neckties at all.\n\nCecily.  I don't think you will require neckties.  Uncle Jack is sending\nyou to Australia.\n\nAlgernon.  Australia!  I'd sooner die.\n\nCecily.  Well, he said at dinner on Wednesday night, that you would have\nto choose between this world, the next world, and Australia.\n\nAlgernon.  Oh, well!  The accounts I have received of Australia and the\nnext world, are not particularly encouraging.  This world is good enough\nfor me, cousin Cecily.\n\nCecily.  Yes, but are you good enough for it?\n\nAlgernon.  I'm afraid I'm not that.  That is why I want you to reform me.\nYou might make that your mission, if you don't mind, cousin Cecily.\n\nCecily.  I'm afraid I've no time, this afternoon.\n\nAlgernon.  Well, would you mind my reforming myself this afternoon?\n\nCecily.  It is rather Quixotic of you.  But I think you should try.\n\nAlgernon.  I will.  I feel better already.\n\nCecily.  You are looking a little worse.\n\nAlgernon.  That is because I am hungry.\n\nCecily.  How thoughtless of me.  I should have remembered that when one\nis going to lead an entirely new life, one requires regular and wholesome\nmeals.  Won't you come in?\n\nAlgernon.  Thank you.  Might I have a buttonhole first?  I never have any\nappetite unless I have a buttonhole first.\n\nCecily.  A Marechal Niel?  [Picks up scissors.]\n\nAlgernon.  No, I'd sooner have a pink rose.\n\nCecily.  Why?  [Cuts a flower.]\n\nAlgernon.  Because you are like a pink rose, Cousin Cecily.\n\nCecily.  I don't think it can be right for you to talk to me like that.\nMiss Prism never says such things to me.\n\nAlgernon.  Then Miss Prism is a short-sighted old lady.  [Cecily puts the\nrose in his buttonhole.]  You are the prettiest girl I ever saw.\n\nCecily.  Miss Prism says that all good looks are a snare.\n\nAlgernon.  They are a snare that every sensible man would like to be\ncaught in.\n\nCecily.  Oh, I don't think I would care to catch a sensible man.  I\nshouldn't know what to talk to him about.\n\n[They pass into the house.  Miss Prism and Dr. Chasuble return.]\n\nMiss Prism.  You are too much alone, dear Dr. Chasuble.  You should get\nmarried.  A misanthrope I can understand--a womanthrope, never!\n\nChasuble.  [With a scholar's shudder.]  Believe me, I do not deserve so\nneologistic a phrase.  The precept as well as the practice of the\nPrimitive Church was distinctly against matrimony.\n\nMiss Prism.  [Sententiously.]  That is obviously the reason why the\nPrimitive Church has not lasted up to the present day.  And you do not\nseem to realise, dear Doctor, that by persistently remaining single, a\nman converts himself into a permanent public temptation.  Men should be\nmore careful; this very celibacy leads weaker vessels astray.\n\nChasuble.  But is a man not equally attractive when married?\n\nMiss Prism.  No married man is ever attractive except to his wife.\n\nChasuble.  And often, I've been told, not even to her.\n\nMiss Prism.  That depends on the intellectual sympathies of the woman.\nMaturity can always be depended on.  Ripeness can be trusted.  Young\nwomen are green.  [Dr. Chasuble starts.]  I spoke horticulturally.  My\nmetaphor was drawn from fruits.  But where is Cecily?\n\nChasuble.  Perhaps she followed us to the schools.\n\n[Enter Jack slowly from the back of the garden.  He is dressed in the\ndeepest mourning, with crape hatband and black gloves.]\n\nMiss Prism.  Mr. Worthing!\n\nChasuble.  Mr. Worthing?\n\nMiss Prism.  This is indeed a surprise.  We did not look for you till\nMonday afternoon.\n\nJack.  [Shakes Miss Prism's hand in a tragic manner.]  I have returned\nsooner than I expected.  Dr. Chasuble, I hope you are well?\n\nChasuble.  Dear Mr. Worthing, I trust this garb of woe does not betoken\nsome terrible calamity?\n\nJack.  My brother.\n\nMiss Prism.  More shameful debts and extravagance?\n\nChasuble.  Still leading his life of pleasure?\n\nJack.  [Shaking his head.]  Dead!\n\nChasuble.  Your brother Ernest dead?\n\nJack.  Quite dead.\n\nMiss Prism.  What a lesson for him!  I trust he will profit by it.\n\nChasuble.  Mr. Worthing, I offer you my sincere condolence.  You have at\nleast the consolation of knowing that you were always the most generous\nand forgiving of brothers.\n\nJack.  Poor Ernest!  He had many faults, but it is a sad, sad blow.\n\nChasuble.  Very sad indeed.  Were you with him at the end?\n\nJack.  No.  He died abroad; in Paris, in fact.  I had a telegram last\nnight from the manager of the Grand Hotel.\n\nChasuble.  Was the cause of death mentioned?\n\nJack.  A severe chill, it seems.\n\nMiss Prism.  As a man sows, so shall he reap.\n\nChasuble.  [Raising his hand.]  Charity, dear Miss Prism, charity!  None\nof us are perfect.  I myself am peculiarly susceptible to draughts.  Will\nthe interment take place here?\n\nJack.  No.  He seems to have expressed a desire to be buried in Paris.\n\nChasuble.  In Paris!  [Shakes his head.]  I fear that hardly points to\nany very serious state of mind at the last.  You would no doubt wish me\nto make some slight allusion to this tragic domestic affliction next\nSunday.  [Jack presses his hand convulsively.]  My sermon on the meaning\nof the manna in the wilderness can be adapted to almost any occasion,\njoyful, or, as in the present case, distressing.  [All sigh.]  I have\npreached it at harvest celebrations, christenings, confirmations, on days\nof humiliation and festal days.  The last time I delivered it was in the\nCathedral, as a charity sermon on behalf of the Society for the\nPrevention of Discontent among the Upper Orders.  The Bishop, who was\npresent, was much struck by some of the analogies I drew.\n\nJack.  Ah! that reminds me, you mentioned christenings I think, Dr.\nChasuble?  I suppose you know how to christen all right?  [Dr. Chasuble\nlooks astounded.]  I mean, of course, you are continually christening,\naren't you?\n\nMiss Prism.  It is, I regret to say, one of the Rector's most constant\nduties in this parish.  I have often spoken to the poorer classes on the\nsubject.  But they don't seem to know what thrift is.\n\nChasuble.  But is there any particular infant in whom you are interested,\nMr. Worthing?  Your brother was, I believe, unmarried, was he not?\n\nJack.  Oh yes.\n\nMiss Prism.  [Bitterly.]  People who live entirely for pleasure usually\nare.\n\nJack.  But it is not for any child, dear Doctor.  I am very fond of\nchildren.  No! the fact is, I would like to be christened myself, this\nafternoon, if you have nothing better to do.\n\nChasuble.  But surely, Mr. Worthing, you have been christened already?\n\nJack.  I don't remember anything about it.\n\nChasuble.  But have you any grave doubts on the subject?\n\nJack.  I certainly intend to have.  Of course I don't know if the thing\nwould bother you in any way, or if you think I am a little too old now.\n\nChasuble.  Not at all.  The sprinkling, and, indeed, the immersion of\nadults is a perfectly canonical practice.\n\nJack.  Immersion!\n\nChasuble.  You need have no apprehensions.  Sprinkling is all that is\nnecessary, or indeed I think advisable.  Our weather is so changeable.  At\nwhat hour would you wish the ceremony performed?\n\nJack.  Oh, I might trot round about five if that would suit you.\n\nChasuble.  Perfectly, perfectly!  In fact I have two similar ceremonies\nto perform at that time.  A case of twins that occurred recently in one\nof the outlying cottages on your own estate.  Poor Jenkins the carter, a\nmost hard-working man.\n\nJack.  Oh!  I don't see much fun in being christened along with other\nbabies.  It would be childish.  Would half-past five do?\n\nChasuble.  Admirably!  Admirably!  [Takes out watch.]  And now, dear Mr.\nWorthing, I will not intrude any longer into a house of sorrow.  I would\nmerely beg you not to be too much bowed down by grief.  What seem to us\nbitter trials are often blessings in disguise.\n\nMiss Prism.  This seems to me a blessing of an extremely obvious kind.\n\n[Enter Cecily from the house.]\n\nCecily.  Uncle Jack!  Oh, I am pleased to see you back.  But what horrid\nclothes you have got on!  Do go and change them.\n\nMiss Prism.  Cecily!\n\nChasuble.  My child! my child!  [Cecily goes towards Jack; he kisses her\nbrow in a melancholy manner.]\n\nCecily.  What is the matter, Uncle Jack?  Do look happy!  You look as if\nyou had toothache, and I have got such a surprise for you.  Who do you\nthink is in the dining-room?  Your brother!\n\nJack.  Who?\n\nCecily.  Your brother Ernest.  He arrived about half an hour ago.\n\nJack.  What nonsense!  I haven't got a brother.\n\nCecily.  Oh, don't say that.  However badly he may have behaved to you in\nthe past he is still your brother.  You couldn't be so heartless as to\ndisown him.  I'll tell him to come out.  And you will shake hands with\nhim, won't you, Uncle Jack?  [Runs back into the house.]\n\nChasuble.  These are very joyful tidings.\n\nMiss Prism.  After we had all been resigned to his loss, his sudden\nreturn seems to me peculiarly distressing.\n\nJack.  My brother is in the dining-room?  I don't know what it all means.\nI think it is perfectly absurd.\n\n[Enter Algernon and Cecily hand in hand.  They come slowly up to Jack.]\n\nJack.  Good heavens!  [Motions Algernon away.]\n\nAlgernon.  Brother John, I have come down from town to tell you that I am\nvery sorry for all the trouble I have given you, and that I intend to\nlead a better life in the future.  [Jack glares at him and does not take\nhis hand.]\n\nCecily.  Uncle Jack, you are not going to refuse your own brother's hand?\n\nJack.  Nothing will induce me to take his hand.  I think his coming down\nhere disgraceful.  He knows perfectly well why.\n\nCecily.  Uncle Jack, do be nice.  There is some good in every one.  Ernest\nhas just been telling me about his poor invalid friend Mr. Bunbury whom\nhe goes to visit so often.  And surely there must be much good in one who\nis kind to an invalid, and leaves the pleasures of London to sit by a bed\nof pain.\n\nJack.  Oh! he has been talking about Bunbury, has he?\n\nCecily.  Yes, he has told me all about poor Mr. Bunbury, and his terrible\nstate of health.\n\nJack.  Bunbury!  Well, I won't have him talk to you about Bunbury or\nabout anything else.  It is enough to drive one perfectly frantic.\n\nAlgernon.  Of course I admit that the faults were all on my side.  But I\nmust say that I think that Brother John's coldness to me is peculiarly\npainful.  I expected a more enthusiastic welcome, especially considering\nit is the first time I have come here.\n\nCecily.  Uncle Jack, if you don't shake hands with Ernest I will never\nforgive you.\n\nJack.  Never forgive me?\n\nCecily.  Never, never, never!\n\nJack.  Well, this is the last time I shall ever do it.  [Shakes with\nAlgernon and glares.]\n\nChasuble.  It's pleasant, is it not, to see so perfect a reconciliation?\nI think we might leave the two brothers together.\n\nMiss Prism.  Cecily, you will come with us.\n\nCecily.  Certainly, Miss Prism.  My little task of reconciliation is\nover.\n\nChasuble.  You have done a beautiful action to-day, dear child.\n\nMiss Prism.  We must not be premature in our judgments.\n\nCecily.  I feel very happy.  [They all go off except Jack and Algernon.]\n\nJack.  You young scoundrel, Algy, you must get out of this place as soon\nas possible.  I don't allow any Bunburying here.\n\n[Enter Merriman.]\n\nMerriman.  I have put Mr. Ernest's things in the room next to yours, sir.\nI suppose that is all right?\n\nJack.  What?\n\nMerriman.  Mr. Ernest's luggage, sir.  I have unpacked it and put it in\nthe room next to your own.\n\nJack.  His luggage?\n\nMerriman.  Yes, sir.  Three portmanteaus, a dressing-case, two hat-boxes,\nand a large luncheon-basket.\n\nAlgernon.  I am afraid I can't stay more than a week this time.\n\nJack.  Merriman, order the dog-cart at once.  Mr. Ernest has been\nsuddenly called back to town.\n\nMerriman.  Yes, sir.  [Goes back into the house.]\n\nAlgernon.  What a fearful liar you are, Jack.  I have not been called\nback to town at all.\n\nJack.  Yes, you have.\n\nAlgernon.  I haven't heard any one call me.\n\nJack.  Your duty as a gentleman calls you back.\n\nAlgernon.  My duty as a gentleman has never interfered with my pleasures\nin the smallest degree.\n\nJack.  I can quite understand that.\n\nAlgernon.  Well, Cecily is a darling.\n\nJack.  You are not to talk of Miss Cardew like that.  I don't like it.\n\nAlgernon.  Well, I don't like your clothes.  You look perfectly\nridiculous in them.  Why on earth don't you go up and change?  It is\nperfectly childish to be in deep mourning for a man who is actually\nstaying for a whole week with you in your house as a guest.  I call it\ngrotesque.\n\nJack.  You are certainly not staying with me for a whole week as a guest\nor anything else.  You have got to leave . . . by the four-five train.\n\nAlgernon.  I certainly won't leave you so long as you are in mourning.  It\nwould be most unfriendly.  If I were in mourning you would stay with me,\nI suppose.  I should think it very unkind if you didn't.\n\nJack.  Well, will you go if I change my clothes?\n\nAlgernon.  Yes, if you are not too long.  I never saw anybody take so\nlong to dress, and with such little result.\n\nJack.  Well, at any rate, that is better than being always over-dressed\nas you are.\n\nAlgernon.  If I am occasionally a little over-dressed, I make up for it\nby being always immensely over-educated.\n\nJack.  Your vanity is ridiculous, your conduct an outrage, and your\npresence in my garden utterly absurd.  However, you have got to catch the\nfour-five, and I hope you will have a pleasant journey back to town.  This\nBunburying, as you call it, has not been a great success for you.\n\n[Goes into the house.]\n\nAlgernon.  I think it has been a great success.  I'm in love with Cecily,\nand that is everything.\n\n[Enter Cecily at the back of the garden.  She picks up the can and begins\nto water the flowers.]  But I must see her before I go, and make\narrangements for another Bunbury.  Ah, there she is.\n\nCecily.  Oh, I merely came back to water the roses.  I thought you were\nwith Uncle Jack.\n\nAlgernon.  He's gone to order the dog-cart for me.\n\nCecily.  Oh, is he going to take you for a nice drive?\n\nAlgernon.  He's going to send me away.\n\nCecily.  Then have we got to part?\n\nAlgernon.  I am afraid so.  It's a very painful parting.\n\nCecily.  It is always painful to part from people whom one has known for\na very brief space of time.  The absence of old friends one can endure\nwith equanimity.  But even a momentary separation from anyone to whom one\nhas just been introduced is almost unbearable.\n\nAlgernon.  Thank you.\n\n[Enter Merriman.]\n\nMerriman.  The dog-cart is at the door, sir.  [Algernon looks appealingly\nat Cecily.]\n\nCecily.  It can wait, Merriman for . . . five minutes.\n\nMerriman.  Yes, Miss.  [Exit Merriman.]\n\nAlgernon.  I hope, Cecily, I shall not offend you if I state quite\nfrankly and openly that you seem to me to be in every way the visible\npersonification of absolute perfection.\n\nCecily.  I think your frankness does you great credit, Ernest.  If you\nwill allow me, I will copy your remarks into my diary.  [Goes over to\ntable and begins writing in diary.]\n\nAlgernon.  Do you really keep a diary?  I'd give anything to look at it.\nMay I?\n\nCecily.  Oh no.  [Puts her hand over it.]  You see, it is simply a very\nyoung girl's record of her own thoughts and impressions, and consequently\nmeant for publication.  When it appears in volume form I hope you will\norder a copy.  But pray, Ernest, don't stop.  I delight in taking down\nfrom dictation.  I have reached 'absolute perfection'.  You can go on.  I\nam quite ready for more.\n\nAlgernon.  [Somewhat taken aback.]  Ahem!  Ahem!\n\nCecily.  Oh, don't cough, Ernest.  When one is dictating one should speak\nfluently and not cough.  Besides, I don't know how to spell a cough.\n[Writes as Algernon speaks.]\n\nAlgernon.  [Speaking very rapidly.]  Cecily, ever since I first looked\nupon your wonderful and incomparable beauty, I have dared to love you\nwildly, passionately, devotedly, hopelessly.\n\nCecily.  I don't think that you should tell me that you love me wildly,\npassionately, devotedly, hopelessly.  Hopelessly doesn't seem to make\nmuch sense, does it?\n\nAlgernon.  Cecily!\n\n[Enter Merriman.]\n\nMerriman.  The dog-cart is waiting, sir.\n\nAlgernon.  Tell it to come round next week, at the same hour.\n\nMerriman.  [Looks at Cecily, who makes no sign.]  Yes, sir.\n\n[Merriman retires.]\n\nCecily.  Uncle Jack would be very much annoyed if he knew you were\nstaying on till next week, at the same hour.\n\nAlgernon.  Oh, I don't care about Jack.  I don't care for anybody in the\nwhole world but you.  I love you, Cecily.  You will marry me, won't you?\n\nCecily.  You silly boy!  Of course.  Why, we have been engaged for the\nlast three months.\n\nAlgernon.  For the last three months?\n\nCecily.  Yes, it will be exactly three months on Thursday.\n\nAlgernon.  But how did we become engaged?\n\nCecily.  Well, ever since dear Uncle Jack first confessed to us that he\nhad a younger brother who was very wicked and bad, you of course have\nformed the chief topic of conversation between myself and Miss Prism.  And\nof course a man who is much talked about is always very attractive.  One\nfeels there must be something in him, after all.  I daresay it was\nfoolish of me, but I fell in love with you, Ernest.\n\nAlgernon.  Darling!  And when was the engagement actually settled?\n\nCecily.  On the 14th of February last.  Worn out by your entire ignorance\nof my existence, I determined to end the matter one way or the other, and\nafter a long struggle with myself I accepted you under this dear old tree\nhere.  The next day I bought this little ring in your name, and this is\nthe little bangle with the true lover's knot I promised you always to\nwear.\n\nAlgernon.  Did I give you this?  It's very pretty, isn't it?\n\nCecily.  Yes, you've wonderfully good taste, Ernest.  It's the excuse\nI've always given for your leading such a bad life.  And this is the box\nin which I keep all your dear letters.  [Kneels at table, opens box, and\nproduces letters tied up with blue ribbon.]\n\nAlgernon.  My letters!  But, my own sweet Cecily, I have never written\nyou any letters.\n\nCecily.  You need hardly remind me of that, Ernest.  I remember only too\nwell that I was forced to write your letters for you.  I wrote always\nthree times a week, and sometimes oftener.\n\nAlgernon.  Oh, do let me read them, Cecily?\n\nCecily.  Oh, I couldn't possibly.  They would make you far too conceited.\n[Replaces box.]  The three you wrote me after I had broken off the\nengagement are so beautiful, and so badly spelled, that even now I can\nhardly read them without crying a little.\n\nAlgernon.  But was our engagement ever broken off?\n\nCecily.  Of course it was.  On the 22nd of last March.  You can see the\nentry if you like. [Shows diary.]  'To-day I broke off my engagement with\nErnest.  I feel it is better to do so.  The weather still continues\ncharming.'\n\nAlgernon.  But why on earth did you break it off?  What had I done?  I\nhad done nothing at all.  Cecily, I am very much hurt indeed to hear you\nbroke it off.  Particularly when the weather was so charming.\n\nCecily.  It would hardly have been a really serious engagement if it\nhadn't been broken off at least once.  But I forgave you before the week\nwas out.\n\nAlgernon.  [Crossing to her, and kneeling.]  What a perfect angel you\nare, Cecily.\n\nCecily.  You dear romantic boy.  [He kisses her, she puts her fingers\nthrough his hair.]  I hope your hair curls naturally, does it?\n\nAlgernon.  Yes, darling, with a little help from others.\n\nCecily.  I am so glad.\n\nAlgernon.  You'll never break off our engagement again, Cecily?\n\nCecily.  I don't think I could break it off now that I have actually met\nyou.  Besides, of course, there is the question of your name.\n\nAlgernon.  Yes, of course.  [Nervously.]\n\nCecily.  You must not laugh at me, darling, but it had always been a\ngirlish dream of mine to love some one whose name was Ernest.  [Algernon\nrises, Cecily also.]  There is something in that name that seems to\ninspire absolute confidence.  I pity any poor married woman whose husband\nis not called Ernest.\n\nAlgernon.  But, my dear child, do you mean to say you could not love me\nif I had some other name?\n\nCecily.  But what name?\n\nAlgernon.  Oh, any name you like--Algernon--for instance . . .\n\nCecily.  But I don't like the name of Algernon.\n\nAlgernon.  Well, my own dear, sweet, loving little darling, I really\ncan't see why you should object to the name of Algernon.  It is not at\nall a bad name.  In fact, it is rather an aristocratic name.  Half of the\nchaps who get into the Bankruptcy Court are called Algernon.  But\nseriously, Cecily . . . [Moving to her] . . . if my name was Algy,\ncouldn't you love me?\n\nCecily.  [Rising.]  I might respect you, Ernest, I might admire your\ncharacter, but I fear that I should not be able to give you my undivided\nattention.\n\nAlgernon.  Ahem!  Cecily!  [Picking up hat.]  Your Rector here is, I\nsuppose, thoroughly experienced in the practice of all the rites and\nceremonials of the Church?\n\nCecily.  Oh, yes.  Dr. Chasuble is a most learned man.  He has never\nwritten a single book, so you can imagine how much he knows.\n\nAlgernon.  I must see him at once on a most important christening--I mean\non most important business.\n\nCecily.  Oh!\n\nAlgernon.  I shan't be away more than half an hour.\n\nCecily.  Considering that we have been engaged since February the 14th,\nand that I only met you to-day for the first time, I think it is rather\nhard that you should leave me for so long a period as half an hour.\nCouldn't you make it twenty minutes?\n\nAlgernon.  I'll be back in no time.\n\n[Kisses her and rushes down the garden.]\n\nCecily.  What an impetuous boy he is!  I like his hair so much.  I must\nenter his proposal in my diary.\n\n[Enter Merriman.]\n\nMerriman.  A Miss Fairfax has just called to see Mr. Worthing.  On very\nimportant business, Miss Fairfax states.\n\nCecily.  Isn't Mr. Worthing in his library?\n\nMerriman.  Mr. Worthing went over in the direction of the Rectory some\ntime ago.\n\nCecily.  Pray ask the lady to come out here; Mr. Worthing is sure to be\nback soon.  And you can bring tea.\n\nMerriman.  Yes, Miss.  [Goes out.]\n\nCecily.  Miss Fairfax!  I suppose one of the many good elderly women who\nare associated with Uncle Jack in some of his philanthropic work in\nLondon.  I don't quite like women who are interested in philanthropic\nwork.  I think it is so forward of them.\n\n[Enter Merriman.]\n\nMerriman.  Miss Fairfax.\n\n[Enter Gwendolen.]\n\n[Exit Merriman.]\n\nCecily.  [Advancing to meet her.]  Pray let me introduce myself to you.\nMy name is Cecily Cardew.\n\nGwendolen.  Cecily Cardew?  [Moving to her and shaking hands.]  What a\nvery sweet name!  Something tells me that we are going to be great\nfriends.  I like you already more than I can say.  My first impressions\nof people are never wrong.\n\nCecily.  How nice of you to like me so much after we have known each\nother such a comparatively short time.  Pray sit down.\n\nGwendolen.  [Still standing up.]  I may call you Cecily, may I not?\n\nCecily.  With pleasure!\n\nGwendolen.  And you will always call me Gwendolen, won't you?\n\nCecily.  If you wish.\n\nGwendolen.  Then that is all quite settled, is it not?\n\nCecily.  I hope so.  [A pause.  They both sit down together.]\n\nGwendolen.  Perhaps this might be a favourable opportunity for my\nmentioning who I am.  My father is Lord Bracknell.  You have never heard\nof papa, I suppose?\n\nCecily.  I don't think so.\n\nGwendolen.  Outside the family circle, papa, I am glad to say, is\nentirely unknown.  I think that is quite as it should be.  The home seems\nto me to be the proper sphere for the man.  And certainly once a man\nbegins to neglect his domestic duties he becomes painfully effeminate,\ndoes he not?  And I don't like that.  It makes men so very attractive.\nCecily, mamma, whose views on education are remarkably strict, has\nbrought me up to be extremely short-sighted; it is part of her system; so\ndo you mind my looking at you through my glasses?\n\nCecily.  Oh! not at all, Gwendolen.  I am very fond of being looked at.\n\nGwendolen.  [After examining Cecily carefully through a lorgnette.]  You\nare here on a short visit, I suppose.\n\nCecily.  Oh no!  I live here.\n\nGwendolen.  [Severely.]  Really?  Your mother, no doubt, or some female\nrelative of advanced years, resides here also?\n\nCecily.  Oh no!  I have no mother, nor, in fact, any relations.\n\nGwendolen.  Indeed?\n\nCecily.  My dear guardian, with the assistance of Miss Prism, has the\narduous task of looking after me.\n\nGwendolen.  Your guardian?\n\nCecily.  Yes, I am Mr. Worthing's ward.\n\nGwendolen.  Oh!  It is strange he never mentioned to me that he had a\nward.  How secretive of him!  He grows more interesting hourly.  I am not\nsure, however, that the news inspires me with feelings of unmixed\ndelight.  [Rising and going to her.]  I am very fond of you, Cecily; I\nhave liked you ever since I met you!  But I am bound to state that now\nthat I know that you are Mr. Worthing's ward, I cannot help expressing a\nwish you were--well, just a little older than you seem to be--and not\nquite so very alluring in appearance.  In fact, if I may speak candidly--\n\nCecily.  Pray do!  I think that whenever one has anything unpleasant to\nsay, one should always be quite candid.\n\nGwendolen.  Well, to speak with perfect candour, Cecily, I wish that you\nwere fully forty-two, and more than usually plain for your age.  Ernest\nhas a strong upright nature.  He is the very soul of truth and honour.\nDisloyalty would be as impossible to him as deception.  But even men of\nthe noblest possible moral character are extremely susceptible to the\ninfluence of the physical charms of others.  Modern, no less than Ancient\nHistory, supplies us with many most painful examples of what I refer to.\nIf it were not so, indeed, History would be quite unreadable.\n\nCecily.  I beg your pardon, Gwendolen, did you say Ernest?\n\nGwendolen.  Yes.\n\nCecily.  Oh, but it is not Mr. Ernest Worthing who is my guardian.  It is\nhis brother--his elder brother.\n\nGwendolen.  [Sitting down again.]  Ernest never mentioned to me that he\nhad a brother.\n\nCecily.  I am sorry to say they have not been on good terms for a long\ntime.\n\nGwendolen.  Ah! that accounts for it.  And now that I think of it I have\nnever heard any man mention his brother.  The subject seems distasteful\nto most men.  Cecily, you have lifted a load from my mind.  I was growing\nalmost anxious.  It would have been terrible if any cloud had come across\na friendship like ours, would it not?  Of course you are quite, quite\nsure that it is not Mr. Ernest Worthing who is your guardian?\n\nCecily.  Quite sure.  [A pause.]  In fact, I am going to be his.\n\nGwendolen.  [Inquiringly.]  I beg your pardon?\n\nCecily.  [Rather shy and confidingly.]  Dearest Gwendolen, there is no\nreason why I should make a secret of it to you.  Our little county\nnewspaper is sure to chronicle the fact next week.  Mr. Ernest Worthing\nand I are engaged to be married.\n\nGwendolen.  [Quite politely, rising.]  My darling Cecily, I think there\nmust be some slight error.  Mr. Ernest Worthing is engaged to me.  The\nannouncement will appear in the _Morning Post_ on Saturday at the latest.\n\nCecily.  [Very politely, rising.]  I am afraid you must be under some\nmisconception.  Ernest proposed to me exactly ten minutes ago.  [Shows\ndiary.]\n\nGwendolen.  [Examines diary through her lorgnettte carefully.]  It is\ncertainly very curious, for he asked me to be his wife yesterday\nafternoon at 5.30.  If you would care to verify the incident, pray do so.\n[Produces diary of her own.]  I never travel without my diary.  One\nshould always have something sensational to read in the train.  I am so\nsorry, dear Cecily, if it is any disappointment to you, but I am afraid I\nhave the prior claim.\n\nCecily.  It would distress me more than I can tell you, dear Gwendolen,\nif it caused you any mental or physical anguish, but I feel bound to\npoint out that since Ernest proposed to you he clearly has changed his\nmind.\n\nGwendolen.  [Meditatively.]  If the poor fellow has been entrapped into\nany foolish promise I shall consider it my duty to rescue him at once,\nand with a firm hand.\n\nCecily.  [Thoughtfully and sadly.]  Whatever unfortunate entanglement my\ndear boy may have got into, I will never reproach him with it after we\nare married.\n\nGwendolen.  Do you allude to me, Miss Cardew, as an entanglement?  You\nare presumptuous.  On an occasion of this kind it becomes more than a\nmoral duty to speak one's mind.  It becomes a pleasure.\n\nCecily.  Do you suggest, Miss Fairfax, that I entrapped Ernest into an\nengagement?  How dare you?  This is no time for wearing the shallow mask\nof manners.  When I see a spade I call it a spade.\n\nGwendolen.  [Satirically.]  I am glad to say that I have never seen a\nspade.  It is obvious that our social spheres have been widely different.\n\n[Enter Merriman, followed by the footman.  He carries a salver, table\ncloth, and plate stand.  Cecily is about to retort.  The presence of the\nservants exercises a restraining influence, under which both girls\nchafe.]\n\nMerriman.  Shall I lay tea here as usual, Miss?\n\nCecily.  [Sternly, in a calm voice.]  Yes, as usual.  [Merriman begins to\nclear table and lay cloth.  A long pause.  Cecily and Gwendolen glare at\neach other.]\n\nGwendolen.  Are there many interesting walks in the vicinity, Miss\nCardew?\n\nCecily.  Oh! yes! a great many.  From the top of one of the hills quite\nclose one can see five counties.\n\nGwendolen.  Five counties!  I don't think I should like that; I hate\ncrowds.\n\nCecily.  [Sweetly.]  I suppose that is why you live in town?  [Gwendolen\nbites her lip, and beats her foot nervously with her parasol.]\n\nGwendolen.  [Looking round.]  Quite a well-kept garden this is, Miss\nCardew.\n\nCecily.  So glad you like it, Miss Fairfax.\n\nGwendolen.  I had no idea there were any flowers in the country.\n\nCecily.  Oh, flowers are as common here, Miss Fairfax, as people are in\nLondon.\n\nGwendolen.  Personally I cannot understand how anybody manages to exist\nin the country, if anybody who is anybody does.  The country always bores\nme to death.\n\nCecily.  Ah!  This is what the newspapers call agricultural depression,\nis it not?  I believe the aristocracy are suffering very much from it\njust at present.  It is almost an epidemic amongst them, I have been\ntold.  May I offer you some tea, Miss Fairfax?\n\nGwendolen.  [With elaborate politeness.]  Thank you.  [Aside.]  Detestable\ngirl!  But I require tea!\n\nCecily.  [Sweetly.]  Sugar?\n\nGwendolen.  [Superciliously.]  No, thank you.  Sugar is not fashionable\nany more. [Cecily looks angrily at her, takes up the tongs and puts four\nlumps of sugar into the cup.]\n\nCecily.  [Severely.]  Cake or bread and butter?\n\nGwendolen.  [In a bored manner.]  Bread and butter, please.  Cake is\nrarely seen at the best houses nowadays.\n\nCecily.  [Cuts a very large slice of cake, and puts it on the tray.]  Hand\nthat to Miss Fairfax.\n\n[Merriman does so, and goes out with footman.  Gwendolen drinks the tea\nand makes a grimace.  Puts down cup at once, reaches out her hand to the\nbread and butter, looks at it, and finds it is cake.  Rises in\nindignation.]\n\nGwendolen.  You have filled my tea with lumps of sugar, and though I\nasked most distinctly for bread and butter, you have given me cake.  I am\nknown for the gentleness of my disposition, and the extraordinary\nsweetness of my nature, but I warn you, Miss Cardew, you may go too far.\n\nCecily.  [Rising.]  To save my poor, innocent, trusting boy from the\nmachinations of any other girl there are no lengths to which I would not\ngo.\n\nGwendolen.  From the moment I saw you I distrusted you.  I felt that you\nwere false and deceitful.  I am never deceived in such matters.  My first\nimpressions of people are invariably right.\n\nCecily.  It seems to me, Miss Fairfax, that I am trespassing on your\nvaluable time.  No doubt you have many other calls of a similar character\nto make in the neighbourhood.\n\n[Enter Jack.]\n\nGwendolen.  [Catching sight of him.]  Ernest!  My own Ernest!\n\nJack.  Gwendolen!  Darling!  [Offers to kiss her.]\n\nGwendolen.  [Draws back.]  A moment!  May I ask if you are engaged to be\nmarried to this young lady?  [Points to Cecily.]\n\nJack.  [Laughing.]  To dear little Cecily!  Of course not!  What could\nhave put such an idea into your pretty little head?\n\nGwendolen.  Thank you.  You may!  [Offers her cheek.]\n\nCecily.  [Very sweetly.]  I knew there must be some misunderstanding,\nMiss Fairfax.  The gentleman whose arm is at present round your waist is\nmy guardian, Mr. John Worthing.\n\nGwendolen.  I beg your pardon?\n\nCecily.  This is Uncle Jack.\n\nGwendolen.  [Receding.]  Jack!  Oh!\n\n[Enter Algernon.]\n\nCecily.  Here is Ernest.\n\nAlgernon.  [Goes straight over to Cecily without noticing any one else.]\nMy own love!  [Offers to kiss her.]\n\nCecily.  [Drawing back.]  A moment, Ernest!  May I ask you--are you\nengaged to be married to this young lady?\n\nAlgernon.  [Looking round.]  To what young lady?  Good heavens!\nGwendolen!\n\nCecily.  Yes! to good heavens, Gwendolen, I mean to Gwendolen.\n\nAlgernon.  [Laughing.]  Of course not!  What could have put such an idea\ninto your pretty little head?\n\nCecily.  Thank you.  [Presenting her cheek to be kissed.]  You may.\n[Algernon kisses her.]\n\nGwendolen.  I felt there was some slight error, Miss Cardew.  The\ngentleman who is now embracing you is my cousin, Mr. Algernon Moncrieff.\n\nCecily.  [Breaking away from Algernon.]  Algernon Moncrieff!  Oh!  [The\ntwo girls move towards each other and put their arms round each other's\nwaists as if for protection.]\n\nCecily.  Are you called Algernon?\n\nAlgernon.  I cannot deny it.\n\nCecily.  Oh!\n\nGwendolen.  Is your name really John?\n\nJack.  [Standing rather proudly.]  I could deny it if I liked.  I could\ndeny anything if I liked.  But my name certainly is John.  It has been\nJohn for years.\n\nCecily.  [To Gwendolen.]  A gross deception has been practised on both of\nus.\n\nGwendolen.  My poor wounded Cecily!\n\nCecily.  My sweet wronged Gwendolen!\n\nGwendolen.  [Slowly and seriously.]  You will call me sister, will you\nnot?  [They embrace.  Jack and Algernon groan and walk up and down.]\n\nCecily.  [Rather brightly.]  There is just one question I would like to\nbe allowed to ask my guardian.\n\nGwendolen.  An admirable idea!  Mr. Worthing, there is just one question\nI would like to be permitted to put to you.  Where is your brother\nErnest?  We are both engaged to be married to your brother Ernest, so it\nis a matter of some importance to us to know where your brother Ernest is\nat present.\n\nJack.  [Slowly and hesitatingly.]  Gwendolen--Cecily--it is very painful\nfor me to be forced to speak the truth.  It is the first time in my life\nthat I have ever been reduced to such a painful position, and I am really\nquite inexperienced in doing anything of the kind.  However, I will tell\nyou quite frankly that I have no brother Ernest.  I have no brother at\nall.  I never had a brother in my life, and I certainly have not the\nsmallest intention of ever having one in the future.\n\nCecily.  [Surprised.]  No brother at all?\n\nJack.  [Cheerily.]  None!\n\nGwendolen.  [Severely.]  Had you never a brother of any kind?\n\nJack.  [Pleasantly.]  Never.  Not even of any kind.\n\nGwendolen.  I am afraid it is quite clear, Cecily, that neither of us is\nengaged to be married to any one.\n\nCecily.  It is not a very pleasant position for a young girl suddenly to\nfind herself in.  Is it?\n\nGwendolen.  Let us go into the house.  They will hardly venture to come\nafter us there.\n\nCecily.  No, men are so cowardly, aren't they?\n\n[They retire into the house with scornful looks.]\n\nJack.  This ghastly state of things is what you call Bunburying, I\nsuppose?\n\nAlgernon.  Yes, and a perfectly wonderful Bunbury it is.  The most\nwonderful Bunbury I have ever had in my life.\n\nJack.  Well, you've no right whatsoever to Bunbury here.\n\nAlgernon.  That is absurd.  One has a right to Bunbury anywhere one\nchooses.  Every serious Bunburyist knows that.\n\nJack.  Serious Bunburyist!  Good heavens!\n\nAlgernon.  Well, one must be serious about something, if one wants to\nhave any amusement in life.  I happen to be serious about Bunburying.\nWhat on earth you are serious about I haven't got the remotest idea.\nAbout everything, I should fancy.  You have such an absolutely trivial\nnature.\n\nJack.  Well, the only small satisfaction I have in the whole of this\nwretched business is that your friend Bunbury is quite exploded.  You\nwon't be able to run down to the country quite so often as you used to\ndo, dear Algy.  And a very good thing too.\n\nAlgernon.  Your brother is a little off colour, isn't he, dear Jack?  You\nwon't be able to disappear to London quite so frequently as your wicked\ncustom was.  And not a bad thing either.\n\nJack.  As for your conduct towards Miss Cardew, I must say that your\ntaking in a sweet, simple, innocent girl like that is quite inexcusable.\nTo say nothing of the fact that she is my ward.\n\nAlgernon.  I can see no possible defence at all for your deceiving a\nbrilliant, clever, thoroughly experienced young lady like Miss Fairfax.\nTo say nothing of the fact that she is my cousin.\n\nJack.  I wanted to be engaged to Gwendolen, that is all.  I love her.\n\nAlgernon.  Well, I simply wanted to be engaged to Cecily.  I adore her.\n\nJack.  There is certainly no chance of your marrying Miss Cardew.\n\nAlgernon.  I don't think there is much likelihood, Jack, of you and Miss\nFairfax being united.\n\nJack.  Well, that is no business of yours.\n\nAlgernon.  If it was my business, I wouldn't talk about it.  [Begins to\neat muffins.]  It is very vulgar to talk about one's business.  Only\npeople like stock-brokers do that, and then merely at dinner parties.\n\nJack.  How can you sit there, calmly eating muffins when we are in this\nhorrible trouble, I can't make out.  You seem to me to be perfectly\nheartless.\n\nAlgernon.  Well, I can't eat muffins in an agitated manner.  The butter\nwould probably get on my cuffs.  One should always eat muffins quite\ncalmly.  It is the only way to eat them.\n\nJack.  I say it's perfectly heartless your eating muffins at all, under\nthe circumstances.\n\nAlgernon.  When I am in trouble, eating is the only thing that consoles\nme.  Indeed, when I am in really great trouble, as any one who knows me\nintimately will tell you, I refuse everything except food and drink.  At\nthe present moment I am eating muffins because I am unhappy.  Besides, I\nam particularly fond of muffins.  [Rising.]\n\nJack.  [Rising.]  Well, that is no reason why you should eat them all in\nthat greedy way. [Takes muffins from Algernon.]\n\nAlgernon.  [Offering tea-cake.]  I wish you would have tea-cake instead.\nI don't like tea-cake.\n\nJack.  Good heavens!  I suppose a man may eat his own muffins in his own\ngarden.\n\nAlgernon.  But you have just said it was perfectly heartless to eat\nmuffins.\n\nJack.  I said it was perfectly heartless of you, under the circumstances.\nThat is a very different thing.\n\nAlgernon.  That may be.  But the muffins are the same.  [He seizes the\nmuffin-dish from Jack.]\n\nJack.  Algy, I wish to goodness you would go.\n\nAlgernon.  You can't possibly ask me to go without having some dinner.\nIt's absurd.  I never go without my dinner.  No one ever does, except\nvegetarians and people like that.  Besides I have just made arrangements\nwith Dr. Chasuble to be christened at a quarter to six under the name of\nErnest.\n\nJack.  My dear fellow, the sooner you give up that nonsense the better.  I\nmade arrangements this morning with Dr. Chasuble to be christened myself\nat 5.30, and I naturally will take the name of Ernest.  Gwendolen would\nwish it.  We can't both be christened Ernest.  It's absurd.  Besides, I\nhave a perfect right to be christened if I like.  There is no evidence at\nall that I have ever been christened by anybody.  I should think it\nextremely probable I never was, and so does Dr. Chasuble.  It is entirely\ndifferent in your case.  You have been christened already.\n\nAlgernon.  Yes, but I have not been christened for years.\n\nJack.  Yes, but you have been christened.  That is the important thing.\n\nAlgernon.  Quite so.  So I know my constitution can stand it.  If you are\nnot quite sure about your ever having been christened, I must say I think\nit rather dangerous your venturing on it now.  It might make you very\nunwell.  You can hardly have forgotten that some one very closely\nconnected with you was very nearly carried off this week in Paris by a\nsevere chill.\n\nJack.  Yes, but you said yourself that a severe chill was not hereditary.\n\nAlgernon.  It usen't to be, I know--but I daresay it is now.  Science is\nalways making wonderful improvements in things.\n\nJack.  [Picking up the muffin-dish.]  Oh, that is nonsense; you are\nalways talking nonsense.\n\nAlgernon.  Jack, you are at the muffins again!  I wish you wouldn't.\nThere are only two left.  [Takes them.]  I told you I was particularly\nfond of muffins.\n\nJack.  But I hate tea-cake.\n\nAlgernon.  Why on earth then do you allow tea-cake to be served up for\nyour guests?  What ideas you have of hospitality!\n\nJack.  Algernon!  I have already told you to go.  I don't want you here.\nWhy don't you go!\n\nAlgernon.  I haven't quite finished my tea yet! and there is still one\nmuffin left.  [Jack groans, and sinks into a chair.  Algernon still\ncontinues eating.]\n\nACT DROP\n\n\n\n\nTHIRD ACT\n\n\nSCENE\n\n\nMorning-room at the Manor House.\n\n[Gwendolen and Cecily are at the window, looking out into the garden.]\n\nGwendolen.  The fact that they did not follow us at once into the house,\nas any one else would have done, seems to me to show that they have some\nsense of shame left.\n\nCecily.  They have been eating muffins.  That looks like repentance.\n\nGwendolen.  [After a pause.]  They don't seem to notice us at all.\nCouldn't you cough?\n\nCecily.  But I haven't got a cough.\n\nGwendolen.  They're looking at us.  What effrontery!\n\nCecily.  They're approaching.  That's very forward of them.\n\nGwendolen.  Let us preserve a dignified silence.\n\nCecily.  Certainly.  It's the only thing to do now.  [Enter Jack followed\nby Algernon.  They whistle some dreadful popular air from a British\nOpera.]\n\nGwendolen.  This dignified silence seems to produce an unpleasant effect.\n\nCecily.  A most distasteful one.\n\nGwendolen.  But we will not be the first to speak.\n\nCecily.  Certainly not.\n\nGwendolen.  Mr. Worthing, I have something very particular to ask you.\nMuch depends on your reply.\n\nCecily.  Gwendolen, your common sense is invaluable.  Mr. Moncrieff,\nkindly answer me the following question.  Why did you pretend to be my\nguardian's brother?\n\nAlgernon.  In order that I might have an opportunity of meeting you.\n\nCecily.  [To Gwendolen.]  That certainly seems a satisfactory\nexplanation, does it not?\n\nGwendolen.  Yes, dear, if you can believe him.\n\nCecily.  I don't.  But that does not affect the wonderful beauty of his\nanswer.\n\nGwendolen.  True.  In matters of grave importance, style, not sincerity\nis the vital thing.  Mr. Worthing, what explanation can you offer to me\nfor pretending to have a brother?  Was it in order that you might have an\nopportunity of coming up to town to see me as often as possible?\n\nJack.  Can you doubt it, Miss Fairfax?\n\nGwendolen.  I have the gravest doubts upon the subject.  But I intend to\ncrush them.  This is not the moment for German scepticism.  [Moving to\nCecily.]  Their explanations appear to be quite satisfactory, especially\nMr. Worthing's.  That seems to me to have the stamp of truth upon it.\n\nCecily.  I am more than content with what Mr. Moncrieff said.  His voice\nalone inspires one with absolute credulity.\n\nGwendolen.  Then you think we should forgive them?\n\nCecily.  Yes.  I mean no.\n\nGwendolen.  True!  I had forgotten.  There are principles at stake that\none cannot surrender.  Which of us should tell them?  The task is not a\npleasant one.\n\nCecily.  Could we not both speak at the same time?\n\nGwendolen.  An excellent idea!  I nearly always speak at the same time as\nother people.  Will you take the time from me?\n\nCecily.  Certainly.  [Gwendolen beats time with uplifted finger.]\n\nGwendolen and Cecily [Speaking together.]  Your Christian names are still\nan insuperable barrier.  That is all!\n\nJack and Algernon [Speaking together.]  Our Christian names!  Is that\nall?  But we are going to be christened this afternoon.\n\nGwendolen.  [To Jack.]  For my sake you are prepared to do this terrible\nthing?\n\nJack.  I am.\n\nCecily.  [To Algernon.]  To please me you are ready to face this fearful\nordeal?\n\nAlgernon.  I am!\n\nGwendolen.  How absurd to talk of the equality of the sexes!  Where\nquestions of self-sacrifice are concerned, men are infinitely beyond us.\n\nJack.  We are.  [Clasps hands with Algernon.]\n\nCecily.  They have moments of physical courage of which we women know\nabsolutely nothing.\n\nGwendolen.  [To Jack.]  Darling!\n\nAlgernon.  [To Cecily.]  Darling!  [They fall into each other's arms.]\n\n[Enter Merriman.  When he enters he coughs loudly, seeing the situation.]\n\nMerriman.  Ahem!  Ahem!  Lady Bracknell!\n\nJack.  Good heavens!\n\n[Enter Lady Bracknell.  The couples separate in alarm.  Exit Merriman.]\n\nLady Bracknell.  Gwendolen!  What does this mean?\n\nGwendolen.  Merely that I am engaged to be married to Mr. Worthing,\nmamma.\n\nLady Bracknell.  Come here.  Sit down.  Sit down immediately.  Hesitation\nof any kind is a sign of mental decay in the young, of physical weakness\nin the old.  [Turns to Jack.]  Apprised, sir, of my daughter's sudden\nflight by her trusty maid, whose confidence I purchased by means of a\nsmall coin, I followed her at once by a luggage train.  Her unhappy\nfather is, I am glad to say, under the impression that she is attending a\nmore than usually lengthy lecture by the University Extension Scheme on\nthe Influence of a permanent income on Thought.  I do not propose to\nundeceive him.  Indeed I have never undeceived him on any question.  I\nwould consider it wrong.  But of course, you will clearly understand that\nall communication between yourself and my daughter must cease immediately\nfrom this moment.  On this point, as indeed on all points, I am firm.\n\nJack.  I am engaged to be married to Gwendolen Lady Bracknell!\n\nLady Bracknell.  You are nothing of the kind, sir.  And now, as regards\nAlgernon! . . . Algernon!\n\nAlgernon.  Yes, Aunt Augusta.\n\nLady Bracknell.  May I ask if it is in this house that your invalid\nfriend Mr. Bunbury resides?\n\nAlgernon.  [Stammering.]  Oh!  No!  Bunbury doesn't live here.  Bunbury\nis somewhere else at present.  In fact, Bunbury is dead.\n\nLady Bracknell.  Dead!  When did Mr. Bunbury die?  His death must have\nbeen extremely sudden.\n\nAlgernon.  [Airily.]  Oh!  I killed Bunbury this afternoon.  I mean poor\nBunbury died this afternoon.\n\nLady Bracknell.  What did he die of?\n\nAlgernon.  Bunbury?  Oh, he was quite exploded.\n\nLady Bracknell.  Exploded!  Was he the victim of a revolutionary outrage?\nI was not aware that Mr. Bunbury was interested in social legislation.  If\nso, he is well punished for his morbidity.\n\nAlgernon.  My dear Aunt Augusta, I mean he was found out!  The doctors\nfound out that Bunbury could not live, that is what I mean--so Bunbury\ndied.\n\nLady Bracknell.  He seems to have had great confidence in the opinion of\nhis physicians.  I am glad, however, that he made up his mind at the last\nto some definite course of action, and acted under proper medical advice.\nAnd now that we have finally got rid of this Mr. Bunbury, may I ask, Mr.\nWorthing, who is that young person whose hand my nephew Algernon is now\nholding in what seems to me a peculiarly unnecessary manner?\n\nJack.  That lady is Miss Cecily Cardew, my ward.  [Lady Bracknell bows\ncoldly to Cecily.]\n\nAlgernon.  I am engaged to be married to Cecily, Aunt Augusta.\n\nLady Bracknell.  I beg your pardon?\n\nCecily.  Mr. Moncrieff and I are engaged to be married, Lady Bracknell.\n\nLady Bracknell.  [With a shiver, crossing to the sofa and sitting down.]\nI do not know whether there is anything peculiarly exciting in the air of\nthis particular part of Hertfordshire, but the number of engagements that\ngo on seems to me considerably above the proper average that statistics\nhave laid down for our guidance.  I think some preliminary inquiry on my\npart would not be out of place.  Mr. Worthing, is Miss Cardew at all\nconnected with any of the larger railway stations in London?  I merely\ndesire information.  Until yesterday I had no idea that there were any\nfamilies or persons whose origin was a Terminus.  [Jack looks perfectly\nfurious, but restrains himself.]\n\nJack.  [In a clear, cold voice.]  Miss Cardew is the grand-daughter of\nthe late Mr. Thomas Cardew of 149 Belgrave Square, S.W.; Gervase Park,\nDorking, Surrey; and the Sporran, Fifeshire, N.B.\n\nLady Bracknell.  That sounds not unsatisfactory.  Three addresses always\ninspire confidence, even in tradesmen.  But what proof have I of their\nauthenticity?\n\nJack.  I have carefully preserved the Court Guides of the period.  They\nare open to your inspection, Lady Bracknell.\n\nLady Bracknell.  [Grimly.]  I have known strange errors in that\npublication.\n\nJack.  Miss Cardew's family solicitors are Messrs. Markby, Markby, and\nMarkby.\n\nLady Bracknell.  Markby, Markby, and Markby?  A firm of the very highest\nposition in their profession.  Indeed I am told that one of the Mr.\nMarkby's is occasionally to be seen at dinner parties.  So far I am\nsatisfied.\n\nJack.  [Very irritably.]  How extremely kind of you, Lady Bracknell!  I\nhave also in my possession, you will be pleased to hear, certificates of\nMiss Cardew's birth, baptism, whooping cough, registration, vaccination,\nconfirmation, and the measles; both the German and the English variety.\n\nLady Bracknell.  Ah! A life crowded with incident, I see; though perhaps\nsomewhat too exciting for a young girl.  I am not myself in favour of\npremature experiences.  [Rises, looks at her watch.]  Gwendolen! the time\napproaches for our departure.  We have not a moment to lose.  As a matter\nof form, Mr. Worthing, I had better ask you if Miss Cardew has any little\nfortune?\n\nJack.  Oh! about a hundred and thirty thousand pounds in the Funds.  That\nis all.  Goodbye, Lady Bracknell.  So pleased to have seen you.\n\nLady Bracknell.  [Sitting down again.]  A moment, Mr. Worthing.  A\nhundred and thirty thousand pounds!  And in the Funds!  Miss Cardew seems\nto me a most attractive young lady, now that I look at her.  Few girls of\nthe present day have any really solid qualities, any of the qualities\nthat last, and improve with time.  We live, I regret to say, in an age of\nsurfaces.  [To Cecily.]  Come over here, dear.  [Cecily goes across.]\nPretty child! your dress is sadly simple, and your hair seems almost as\nNature might have left it.  But we can soon alter all that.  A thoroughly\nexperienced French maid produces a really marvellous result in a very\nbrief space of time.  I remember recommending one to young Lady Lancing,\nand after three months her own husband did not know her.\n\nJack.  And after six months nobody knew her.\n\nLady Bracknell.  [Glares at Jack for a few moments.  Then bends, with a\npractised smile, to Cecily.]  Kindly turn round, sweet child.  [Cecily\nturns completely round.]  No, the side view is what I want.  [Cecily\npresents her profile.]  Yes, quite as I expected.  There are distinct\nsocial possibilities in your profile.  The two weak points in our age are\nits want of principle and its want of profile.  The chin a little higher,\ndear.  Style largely depends on the way the chin is worn.  They are worn\nvery high, just at present.  Algernon!\n\nAlgernon.  Yes, Aunt Augusta!\n\nLady Bracknell.  There are distinct social possibilities in Miss Cardew's\nprofile.\n\nAlgernon.  Cecily is the sweetest, dearest, prettiest girl in the whole\nworld.  And I don't care twopence about social possibilities.\n\nLady Bracknell.  Never speak disrespectfully of Society, Algernon.  Only\npeople who can't get into it do that.  [To Cecily.]  Dear child, of\ncourse you know that Algernon has nothing but his debts to depend upon.\nBut I do not approve of mercenary marriages.  When I married Lord\nBracknell I had no fortune of any kind.  But I never dreamed for a moment\nof allowing that to stand in my way.  Well, I suppose I must give my\nconsent.\n\nAlgernon.  Thank you, Aunt Augusta.\n\nLady Bracknell.  Cecily, you may kiss me!\n\nCecily.  [Kisses her.]  Thank you, Lady Bracknell.\n\nLady Bracknell.  You may also address me as Aunt Augusta for the future.\n\nCecily.  Thank you, Aunt Augusta.\n\nLady Bracknell.  The marriage, I think, had better take place quite soon.\n\nAlgernon.  Thank you, Aunt Augusta.\n\nCecily.  Thank you, Aunt Augusta.\n\nLady Bracknell.  To speak frankly, I am not in favour of long\nengagements.  They give people the opportunity of finding out each\nother's character before marriage, which I think is never advisable.\n\nJack.  I beg your pardon for interrupting you, Lady Bracknell, but this\nengagement is quite out of the question.  I am Miss Cardew's guardian,\nand she cannot marry without my consent until she comes of age.  That\nconsent I absolutely decline to give.\n\nLady Bracknell.  Upon what grounds may I ask?  Algernon is an extremely,\nI may almost say an ostentatiously, eligible young man.  He has nothing,\nbut he looks everything.  What more can one desire?\n\nJack.  It pains me very much to have to speak frankly to you, Lady\nBracknell, about your nephew, but the fact is that I do not approve at\nall of his moral character.  I suspect him of being untruthful.  [Algernon\nand Cecily look at him in indignant amazement.]\n\nLady Bracknell.  Untruthful!  My nephew Algernon?  Impossible!  He is an\nOxonian.\n\nJack.  I fear there can be no possible doubt about the matter.  This\nafternoon during my temporary absence in London on an important question\nof romance, he obtained admission to my house by means of the false\npretence of being my brother.  Under an assumed name he drank, I've just\nbeen informed by my butler, an entire pint bottle of my Perrier-Jouet,\nBrut, '89; wine I was specially reserving for myself.  Continuing his\ndisgraceful deception, he succeeded in the course of the afternoon in\nalienating the affections of my only ward.  He subsequently stayed to\ntea, and devoured every single muffin.  And what makes his conduct all\nthe more heartless is, that he was perfectly well aware from the first\nthat I have no brother, that I never had a brother, and that I don't\nintend to have a brother, not even of any kind.  I distinctly told him so\nmyself yesterday afternoon.\n\nLady Bracknell.  Ahem!  Mr. Worthing, after careful consideration I have\ndecided entirely to overlook my nephew's conduct to you.\n\nJack.  That is very generous of you, Lady Bracknell.  My own decision,\nhowever, is unalterable.  I decline to give my consent.\n\nLady Bracknell.  [To Cecily.]  Come here, sweet child.  [Cecily goes\nover.]  How old are you, dear?\n\nCecily.  Well, I am really only eighteen, but I always admit to twenty\nwhen I go to evening parties.\n\nLady Bracknell.  You are perfectly right in making some slight\nalteration.  Indeed, no woman should ever be quite accurate about her\nage.  It looks so calculating . . . [In a meditative manner.]  Eighteen,\nbut admitting to twenty at evening parties.  Well, it will not be very\nlong before you are of age and free from the restraints of tutelage.  So\nI don't think your guardian's consent is, after all, a matter of any\nimportance.\n\nJack.  Pray excuse me, Lady Bracknell, for interrupting you again, but it\nis only fair to tell you that according to the terms of her grandfather's\nwill Miss Cardew does not come legally of age till she is thirty-five.\n\nLady Bracknell.  That does not seem to me to be a grave objection.  Thirty-\nfive is a very attractive age.  London society is full of women of the\nvery highest birth who have, of their own free choice, remained thirty-\nfive for years.  Lady Dumbleton is an instance in point.  To my own\nknowledge she has been thirty-five ever since she arrived at the age of\nforty, which was many years ago now.  I see no reason why our dear Cecily\nshould not be even still more attractive at the age you mention than she\nis at present.  There will be a large accumulation of property.\n\nCecily.  Algy, could you wait for me till I was thirty-five?\n\nAlgernon.  Of course I could, Cecily.  You know I could.\n\nCecily.  Yes, I felt it instinctively, but I couldn't wait all that time.\nI hate waiting even five minutes for anybody.  It always makes me rather\ncross.  I am not punctual myself, I know, but I do like punctuality in\nothers, and waiting, even to be married, is quite out of the question.\n\nAlgernon.  Then what is to be done, Cecily?\n\nCecily.  I don't know, Mr. Moncrieff.\n\nLady Bracknell.  My dear Mr. Worthing, as Miss Cardew states positively\nthat she cannot wait till she is thirty-five--a remark which I am bound\nto say seems to me to show a somewhat impatient nature--I would beg of\nyou to reconsider your decision.\n\nJack.  But my dear Lady Bracknell, the matter is entirely in your own\nhands.  The moment you consent to my marriage with Gwendolen, I will most\ngladly allow your nephew to form an alliance with my ward.\n\nLady Bracknell.  [Rising and drawing herself up.]  You must be quite\naware that what you propose is out of the question.\n\nJack.  Then a passionate celibacy is all that any of us can look forward\nto.\n\nLady Bracknell.  That is not the destiny I propose for Gwendolen.\nAlgernon, of course, can choose for himself.  [Pulls out her watch.]\nCome, dear, [Gwendolen rises] we have already missed five, if not six,\ntrains.  To miss any more might expose us to comment on the platform.\n\n[Enter Dr. Chasuble.]\n\nChasuble.  Everything is quite ready for the christenings.\n\nLady Bracknell.  The christenings, sir!  Is not that somewhat premature?\n\nChasuble.  [Looking rather puzzled, and pointing to Jack and Algernon.]\nBoth these gentlemen have expressed a desire for immediate baptism.\n\nLady Bracknell.  At their age?  The idea is grotesque and irreligious!\nAlgernon, I forbid you to be baptized.  I will not hear of such excesses.\nLord Bracknell would be highly displeased if he learned that that was the\nway in which you wasted your time and money.\n\nChasuble.  Am I to understand then that there are to be no christenings\nat all this afternoon?\n\nJack.  I don't think that, as things are now, it would be of much\npractical value to either of us, Dr. Chasuble.\n\nChasuble.  I am grieved to hear such sentiments from you, Mr. Worthing.\nThey savour of the heretical views of the Anabaptists, views that I have\ncompletely refuted in four of my unpublished sermons.  However, as your\npresent mood seems to be one peculiarly secular, I will return to the\nchurch at once.  Indeed, I have just been informed by the pew-opener that\nfor the last hour and a half Miss Prism has been waiting for me in the\nvestry.\n\nLady Bracknell.  [Starting.]  Miss Prism!  Did I hear you mention a Miss\nPrism?\n\nChasuble.  Yes, Lady Bracknell.  I am on my way to join her.\n\nLady Bracknell.  Pray allow me to detain you for a moment.  This matter\nmay prove to be one of vital importance to Lord Bracknell and myself.  Is\nthis Miss Prism a female of repellent aspect, remotely connected with\neducation?\n\nChasuble.  [Somewhat indignantly.]  She is the most cultivated of ladies,\nand the very picture of respectability.\n\nLady Bracknell.  It is obviously the same person.  May I ask what\nposition she holds in your household?\n\nChasuble.  [Severely.]  I am a celibate, madam.\n\nJack.  [Interposing.]  Miss Prism, Lady Bracknell, has been for the last\nthree years Miss Cardew's esteemed governess and valued companion.\n\nLady Bracknell.  In spite of what I hear of her, I must see her at once.\nLet her be sent for.\n\nChasuble.  [Looking off.]  She approaches; she is nigh.\n\n[Enter Miss Prism hurriedly.]\n\nMiss Prism.  I was told you expected me in the vestry, dear Canon.  I\nhave been waiting for you there for an hour and three-quarters.  [Catches\nsight of Lady Bracknell, who has fixed her with a stony glare.  Miss\nPrism grows pale and quails.  She looks anxiously round as if desirous to\nescape.]\n\nLady Bracknell.  [In a severe, judicial voice.]  Prism!  [Miss Prism bows\nher head in shame.]  Come here, Prism!  [Miss Prism approaches in a\nhumble manner.]  Prism!  Where is that baby?  [General consternation.  The\nCanon starts back in horror.  Algernon and Jack pretend to be anxious to\nshield Cecily and Gwendolen from hearing the details of a terrible public\nscandal.]  Twenty-eight years ago, Prism, you left Lord Bracknell's\nhouse, Number 104, Upper Grosvenor Street, in charge of a perambulator\nthat contained a baby of the male sex.  You never returned.  A few weeks\nlater, through the elaborate investigations of the Metropolitan police,\nthe perambulator was discovered at midnight, standing by itself in a\nremote corner of Bayswater.  It contained the manuscript of a\nthree-volume novel of more than usually revolting sentimentality.  [Miss\nPrism starts in involuntary indignation.]  But the baby was not there!\n[Every one looks at Miss Prism.]  Prism!  Where is that baby?  [A pause.]\n\nMiss Prism.  Lady Bracknell, I admit with shame that I do not know.  I\nonly wish I did.  The plain facts of the case are these.  On the morning\nof the day you mention, a day that is for ever branded on my memory, I\nprepared as usual to take the baby out in its perambulator.  I had also\nwith me a somewhat old, but capacious hand-bag in which I had intended to\nplace the manuscript of a work of fiction that I had written during my\nfew unoccupied hours.  In a moment of mental abstraction, for which I\nnever can forgive myself, I deposited the manuscript in the basinette,\nand placed the baby in the hand-bag.\n\nJack.  [Who has been listening attentively.]  But where did you deposit\nthe hand-bag?\n\nMiss Prism.  Do not ask me, Mr. Worthing.\n\nJack.  Miss Prism, this is a matter of no small importance to me.  I\ninsist on knowing where you deposited the hand-bag that contained that\ninfant.\n\nMiss Prism.  I left it in the cloak-room of one of the larger railway\nstations in London.\n\nJack.  What railway station?\n\nMiss Prism.  [Quite crushed.]  Victoria.  The Brighton line.  [Sinks into\na chair.]\n\nJack.  I must retire to my room for a moment.  Gwendolen, wait here for\nme.\n\nGwendolen.  If you are not too long, I will wait here for you all my\nlife.  [Exit Jack in great excitement.]\n\nChasuble.  What do you think this means, Lady Bracknell?\n\nLady Bracknell.  I dare not even suspect, Dr. Chasuble.  I need hardly\ntell you that in families of high position strange coincidences are not\nsupposed to occur.  They are hardly considered the thing.\n\n[Noises heard overhead as if some one was throwing trunks about.  Every\none looks up.]\n\nCecily.  Uncle Jack seems strangely agitated.\n\nChasuble.  Your guardian has a very emotional nature.\n\nLady Bracknell.  This noise is extremely unpleasant.  It sounds as if he\nwas having an argument.  I dislike arguments of any kind.  They are\nalways vulgar, and often convincing.\n\nChasuble.  [Looking up.]  It has stopped now.  [The noise is redoubled.]\n\nLady Bracknell.  I wish he would arrive at some conclusion.\n\nGwendolen.  This suspense is terrible.  I hope it will last.  [Enter Jack\nwith a hand-bag of black leather in his hand.]\n\nJack.  [Rushing over to Miss Prism.]  Is this the hand-bag, Miss Prism?\nExamine it carefully before you speak.  The happiness of more than one\nlife depends on your answer.\n\nMiss Prism.  [Calmly.]  It seems to be mine.  Yes, here is the injury it\nreceived through the upsetting of a Gower Street omnibus in younger and\nhappier days.  Here is the stain on the lining caused by the explosion of\na temperance beverage, an incident that occurred at Leamington.  And\nhere, on the lock, are my initials.  I had forgotten that in an\nextravagant mood I had had them placed there.  The bag is undoubtedly\nmine.  I am delighted to have it so unexpectedly restored to me.  It has\nbeen a great inconvenience being without it all these years.\n\nJack.  [In a pathetic voice.]  Miss Prism, more is restored to you than\nthis hand-bag.  I was the baby you placed in it.\n\nMiss Prism.  [Amazed.]  You?\n\nJack.  [Embracing her.]  Yes . . . mother!\n\nMiss Prism.  [Recoiling in indignant astonishment.]  Mr. Worthing!  I am\nunmarried!\n\nJack.  Unmarried!  I do not deny that is a serious blow.  But after all,\nwho has the right to cast a stone against one who has suffered?  Cannot\nrepentance wipe out an act of folly?  Why should there be one law for\nmen, and another for women?  Mother, I forgive you.  [Tries to embrace\nher again.]\n\nMiss Prism.  [Still more indignant.]  Mr. Worthing, there is some error.\n[Pointing to Lady Bracknell.]  There is the lady who can tell you who you\nreally are.\n\nJack.  [After a pause.]  Lady Bracknell, I hate to seem inquisitive, but\nwould you kindly inform me who I am?\n\nLady Bracknell.  I am afraid that the news I have to give you will not\naltogether please you.  You are the son of my poor sister, Mrs.\nMoncrieff, and consequently Algernon's elder brother.\n\nJack.  Algy's elder brother!  Then I have a brother after all.  I knew I\nhad a brother!  I always said I had a brother!  Cecily,--how could you\nhave ever doubted that I had a brother?  [Seizes hold of Algernon.]  Dr.\nChasuble, my unfortunate brother.  Miss Prism, my unfortunate brother.\nGwendolen, my unfortunate brother.  Algy, you young scoundrel, you will\nhave to treat me with more respect in the future.  You have never behaved\nto me like a brother in all your life.\n\nAlgernon.  Well, not till to-day, old boy, I admit.  I did my best,\nhowever, though I was out of practice.\n\n[Shakes hands.]\n\nGwendolen.  [To Jack.]  My own!  But what own are you?  What is your\nChristian name, now that you have become some one else?\n\nJack.  Good heavens! . . . I had quite forgotten that point.  Your\ndecision on the subject of my name is irrevocable, I suppose?\n\nGwendolen.  I never change, except in my affections.\n\nCecily.  What a noble nature you have, Gwendolen!\n\nJack.  Then the question had better be cleared up at once.  Aunt Augusta,\na moment.  At the time when Miss Prism left me in the hand-bag, had I\nbeen christened already?\n\nLady Bracknell.  Every luxury that money could buy, including\nchristening, had been lavished on you by your fond and doting parents.\n\nJack.  Then I was christened!  That is settled.  Now, what name was I\ngiven?  Let me know the worst.\n\nLady Bracknell.  Being the eldest son you were naturally christened after\nyour father.\n\nJack.  [Irritably.]  Yes, but what was my father's Christian name?\n\nLady Bracknell.  [Meditatively.]  I cannot at the present moment recall\nwhat the General's Christian name was.  But I have no doubt he had one.\nHe was eccentric, I admit.  But only in later years.  And that was the\nresult of the Indian climate, and marriage, and indigestion, and other\nthings of that kind.\n\nJack.  Algy!  Can't you recollect what our father's Christian name was?\n\nAlgernon.  My dear boy, we were never even on speaking terms.  He died\nbefore I was a year old.\n\nJack.  His name would appear in the Army Lists of the period, I suppose,\nAunt Augusta?\n\nLady Bracknell.  The General was essentially a man of peace, except in\nhis domestic life.  But I have no doubt his name would appear in any\nmilitary directory.\n\nJack.  The Army Lists of the last forty years are here.  These delightful\nrecords should have been my constant study.  [Rushes to bookcase and\ntears the books out.]  M. Generals . . . Mallam, Maxbohm, Magley, what\nghastly names they have--Markby, Migsby, Mobbs, Moncrieff!  Lieutenant\n1840, Captain, Lieutenant-Colonel, Colonel, General 1869, Christian\nnames, Ernest John.  [Puts book very quietly down and speaks quite\ncalmly.]  I always told you, Gwendolen, my name was Ernest, didn't I?\nWell, it is Ernest after all.  I mean it naturally is Ernest.\n\nLady Bracknell.  Yes, I remember now that the General was called Ernest,\nI knew I had some particular reason for disliking the name.\n\nGwendolen.  Ernest!  My own Ernest!  I felt from the first that you could\nhave no other name!\n\nJack.  Gwendolen, it is a terrible thing for a man to find out suddenly\nthat all his life he has been speaking nothing but the truth.  Can you\nforgive me?\n\nGwendolen.  I can.  For I feel that you are sure to change.\n\nJack.  My own one!\n\nChasuble.  [To Miss Prism.]  Laetitia!  [Embraces her]\n\nMiss Prism.  [Enthusiastically.]  Frederick!  At last!\n\nAlgernon.  Cecily!  [Embraces her.]  At last!\n\nJack.  Gwendolen!  [Embraces her.]  At last!\n\nLady Bracknell.  My nephew, you seem to be displaying signs of\ntriviality.\n\nJack.  On the contrary, Aunt Augusta, I've now realised for the first\ntime in my life the vital Importance of Being Earnest.\n\nTABLEAU", "title": "The Importance of Being Earnest: A Trivial Comedy for Serious People"}