{"summary": "The play opens during a dinner party at the home of Sir Robert Chiltern in London's fashionable Grosvenor Square. Sir Robert, a prestigious member of the House of Commons, and his wife, Lady Chiltern, are hosting a gathering that includes his friend Lord Goring, a dandified bachelor and close friend to the Chilterns, his sister Mabel Chiltern, and other genteel guests. During the party, Mrs. Cheveley, an enemy of Lady Chiltern's from their school days, attempts to blackmail Sir Robert into supporting a fraudulent scheme to build a canal in Argentina. Apparently, Mrs. Cheveley's dead mentor and lover, Baron Arnheim, convinced the young Sir Robert to sell him a Cabinet secret, a secret that suggested he buy stocks in the Suez Canal three days before the British government announced its purchase. Sir Robert made his fortune with that illicit money, and Mrs. Cheveley has the letter to prove his crime. Fearing the ruin of both career and marriage, Sir Robert submits to her demands.\nWhen Mrs. Cheveley pointedly informs Lady Chiltern of Sir Robert's change of heart regarding the canal scheme, the morally inflexible Lady Chiltern, unaware of both her husband's past and the blackmail plot, insists that Sir Robert renege on his promise. For Lady Chiltern, their marriage is predicated on her having an \"ideal husband\"—that is, a model spouse in both private and public life that she can worship: thus Sir Robert must remain unimpeachable in all his decisions. Sir Robert complies with the lady's wishes and apparently seals his doom. Also toward the end of Act I, Mabel and Lord Goring come upon a diamond brooch that Lord Goring gave someone many years ago. Goring takes the brooch and asks that Mabel inform him if anyone comes to retrieve it.\nIn the second act, which also takes place at Sir Robert's house, Lord Goring urges Sir Robert to fight Mrs. Cheveley and admit his guilt to his wife. He also reveals that he and Mrs. Cheveley were formerly engaged. After finishing his conversation with Sir Robert, Goring engages in flirtatious banter with Mabel. He also takes Lady Chiltern aside and obliquely urges her to be less morally inflexible and more forgiving. Once Goring leaves, Mrs. Cheveley appears, unexpected, in search of a brooch she lost the previous evening. Incensed at Sir Robert's reneging on his promise, she ultimately exposes Sir Robert to his wife once they are both in the room. Unable to accept a Sir Robert now unmasked, Lady Chiltern then denounces her husband and refuses to forgive him.\nIn the third act, set in Lord Goring's home, Goring receives a pink letter from Lady Chiltern asking for his help, a letter that might be read as a compromising love note. Just as Goring receives this note, however, his father, Lord Caversham, drops in and demands to know when his son will marry. A visit from Sir Robert, who seeks further counsel from Goring, follows. Meanwhile, Mrs. Cheveley arrives unexpectedly and, misrecognized by the butler as the woman Goring awaits, is ushered into Lord Goring's drawing room. While she waits, she finds Lady Chiltern's letter. Ultimately, Sir Robert discovers Mrs. Cheveley in the drawing room and, convinced of an affair between these two former lovers, angrily storms out of the house.\nWhen she and Lord Goring confront each other, Mrs. Cheveley makes a proposal. Claiming to still love Goring from their early days of courtship, she offers to exchange Sir Robert's letter for her old beau's hand in marriage. Lord Goring declines, accusing her of defiling love by reducing courtship to a vulgar transaction and ruining the Chilterns' marriage. He then springs his trap. Removing the diamond brooch from his desk drawer, he binds it to Cheveley's wrist with a hidden device. Goring then reveals how the item came into her possession. Apparently Mrs. Cheveley stole it from his cousin, Mary Berkshire, years ago. To avoid arrest, Cheveley must trade the incriminating letter for her release from the bejewelled handcuff. After Goring obtains and burns the letter, however, Mrs. Cheveley steals Lady Chiltern's note from his desk. Vengefully she plans to send it to Sir Robert misconstrued as a love letter addressed to the dandified lord. Mrs. Cheveley exits the house in triumph.\nThe final act, which returns to Grosvenor Square, resolves the many plot complications sketched above with a decidedly happy ending. Lord Goring proposes to and is accepted by Mabel. Lord Caversham informs his son that Sir Robert has denounced the Argentine canal scheme before the House. Lady Chiltern then appears, and Lord Goring informs her that Sir Robert's letter has been destroyed but that Mrs. Cheveley has stolen her letter and plans to use it to destroy her marriage. At that moment, Sir Robert enters while reading Lady Chiltern's letter, but as the letter does not have the name of the addressee, he assumes it is meant for him, and reads it as a letter of forgiveness. The two reconcile. Lady Chiltern initially agrees to support Sir Robert's decision to renounce his career in politics, but Lord Goring dissuades her from allowing her husband to resign. When Sir Robert refuses Lord Goring his sister's hand in marriage, still believing he has taken up with Mrs. Cheveley, Lady Chiltern is forced to explain last night's events and the true nature of the letter. Sir Robert relents, and Lord Goring and Mabel are permitted to wed.\n\n", "full_text": "Transcribed from the 1912 Methuen and Co. edition by David Price, email\nccx074@pglaf.org\n\n\n\n\n\n                             AN IDEAL HUSBAND\n\n\n                                  A PLAY\n\n                                    BY\n                               OSCAR WILDE\n\n                                * * * * *\n\n                            METHUEN & CO. LTD.\n                           36 ESSEX STREET W.C.\n                                  LONDON\n\n                                * * * * *\n\n                _First Published_, _at 1s. net_, _in 1912_\n\n                                * * * * *\n\n_This book was First Published in 1893_\n\n_First Published_ (_Second Edition_) _by    _February_           _1908_\nMethuen & Co._\n_Third Edition_                             _October_            _1909_\n_Fourth edition_                            _October_            _1910_\n_Fifth Edition_                             _May_                _1912_\n\nTHE PERSONS OF THE PLAY\n\n\nTHE EARL OF CAVERSHAM, K.G.\n\nVISCOUNT GORING, his Son\n\nSIR ROBERT CHILTERN, Bart., Under-Secretary for Foreign Affairs\n\nVICOMTE DE NANJAC, Attache at the French Embassy in London\n\nMR. MONTFORD\n\nMASON, Butler to Sir Robert Chiltern\n\nPHIPPS, Lord Goring's Servant\n\nJAMES   }\n\nHAROLD  } Footmen\n\nLADY CHILTERN\n\nLADY MARKBY\n\nTHE COUNTESS OF BASILDON\n\nMRS. MARCHMONT\n\nMISS MABEL CHILTERN, Sir Robert Chiltern's Sister\n\nMRS. CHEVELEY\n\n\n\n\nTHE SCENES OF THE PLAY\n\n\nACT I.  _The Octagon Room in Sir Robert Chiltern's House in Grosvenor\nSquare_.\n\nACT II.  _Morning-room in Sir Robert Chiltern's House_.\n\nACT III.  _The Library of Lord Goring's House in Curzon Street_.\n\nACT IV.  _Same as Act II_.\n\nTIME: _The Present_\n\nPLACE: _London_.\n\n     _The action of the play is completed within twenty-four hours_.\n\n\n\n\nTHEATRE ROYAL, HAYMARKET\n\n\n                _Sole Lessee_: _Mr. Herbert Beerbohm Tree_\n\n           _Managers_: _Mr. Lewis Waller and Mr. H. H. Morell_\n\n                          _January_ 3_rd_, 1895\n\nTHE EARL OF CAVERSHAM       _Mr. Alfred Bishop_.\nVISCOUNT GORING             _Mr. Charles H. Hawtrey_.\nSIR ROBERT CHILTERN         _Mr. Lewis Waller_.\nVICOMTE DE NANJAC           _Mr. Cosmo Stuart_.\nMR. MONTFORD                _Mr. Harry Stanford_.\nPHIPPS                      _Mr. C. H. Brookfield_.\nMASON                       _Mr. H. Deane_.\nJAMES                       _Mr. Charles Meyrick_.\nHAROLD                      _Mr. Goodhart_.\nLADY CHILTERN               _Miss Julia Neilson_.\nLADY MARKBY                 _Miss Fanny Brough_.\nCOUNTESS OF BASILDON        _Miss Vane Featherston_.\nMRS. MARCHMONT              _Miss Helen Forsyth_.\nMISS MABEL CHILTERN         _Miss Maud Millet_.\nMRS. CHEVELEY               _Miss Florence West_.\n\n\n\n\nFIRST ACT\n\n\nSCENE\n\n\n_The octagon room at Sir Robert Chiltern's house in Grosvenor Square_.\n\n[_The room is brilliantly lighted and full of guests_.  _At the top of\nthe staircase stands_ LADY CHILTERN, _a woman of grave Greek beauty_,\n_about twenty-seven years of age_.  _She receives the guests as they come\nup_.  _Over the well of the staircase hangs a great chandelier with wax\nlights_, _which illumine a large eighteenth-century French\ntapestry--representing the Triumph of Love_, _from a design by\nBoucher--that is stretched on the staircase wall_.  _On the right is the\nentrance to the music-room_.  _The sound of a string quartette is faintly\nheard_.  _The entrance on the left leads to other reception-rooms_.  MRS.\nMARCHMONT _and_ LADY BASILDON, _two very pretty women_, _are seated\ntogether on a Louis Seize sofa_.  _They are types of exquisite\nfragility_.  _Their affectation of manner has a delicate charm_.\n_Watteau would have loved to paint them_.]\n\nMRS. MARCHMONT.  Going on to the Hartlocks' to-night, Margaret?\n\nLADY BASILDON.  I suppose so.  Are you?\n\nMRS. MARCHMONT.  Yes.  Horribly tedious parties they give, don't they?\n\nLADY BASILDON.  Horribly tedious!  Never know why I go.  Never know why I\ngo anywhere.\n\nMRS. MARCHMONT.  I come here to be educated.\n\nLADY BASILDON.  Ah! I hate being educated!\n\nMRS. MARCHMONT.  So do I.  It puts one almost on a level with the\ncommercial classes, doesn't it?  But dear Gertrude Chiltern is always\ntelling me that I should have some serious purpose in life.  So I come\nhere to try to find one.\n\nLADY BASILDON.  [_Looking round through her lorgnette_.]  I don't see\nanybody here to-night whom one could possibly call a serious purpose.\nThe man who took me in to dinner talked to me about his wife the whole\ntime.\n\nMRS. MARCHMONT.  How very trivial of him!\n\nLADY BASILDON.  Terribly trivial!  What did your man talk about?\n\nMRS. MARCHMONT.  About myself.\n\nLADY BASILDON.  [_Languidly_.]  And were you interested?\n\nMRS. MARCHMONT.  [_Shaking her head_.]  Not in the smallest degree.\n\nLADY BASILDON.  What martyrs we are, dear Margaret!\n\nMRS. MARCHMONT.  [_Rising_.]  And how well it becomes us, Olivia!\n\n[_They rise and go towards the music-room_.  _The_ VICOMTE DE NANJAC, _a\nyoung attache known for his neckties and his Anglomania_, _approaches\nwith a low bow_, _and enters into conversation_.]\n\nMASON.  [_Announcing guests from the top of the staircase_.]  Mr. and\nLady Jane Barford.  Lord Caversham.\n\n[_Enter_ LORD CAVERSHAM, _an old gentleman of seventy_, _wearing the\nriband and star of the Garter_.  _A fine Whig type_.  _Rather like a\nportrait by Lawrence_.]\n\nLORD CAVERSHAM.  Good evening, Lady Chiltern!  Has my good-for-nothing\nyoung son been here?\n\nLADY CHILTERN.  [_Smiling_.]  I don't think Lord Goring has arrived yet.\n\nMABEL CHILTERN.  [_Coming up to_ LORD CAVERSHAM.]  Why do you call Lord\nGoring good-for-nothing?\n\n[MABEL CHILTERN _is a perfect example of the English type of prettiness_,\n_the apple-blossom type_.  _She has all the fragrance and freedom of a\nflower_.  _There is ripple after ripple of sunlight in her hair_, _and\nthe little mouth_, _with its parted lips_, _is expectant_, _like the\nmouth of a child_.  _She has the fascinating tyranny of youth_, _and the\nastonishing courage of innocence_.  _To sane people she is not\nreminiscent of any work of art_.  _But she is really like a Tanagra\nstatuette_, _and would be rather annoyed if she were told so_.]\n\nLORD CAVERSHAM.  Because he leads such an idle life.\n\nMABEL CHILTERN.  How can you say such a thing?  Why, he rides in the Row\nat ten o'clock in the morning, goes to the Opera three times a week,\nchanges his clothes at least five times a day, and dines out every night\nof the season.  You don't call that leading an idle life, do you?\n\nLORD CAVERSHAM.  [_Looking at her with a kindly twinkle in his eyes_.]\nYou are a very charming young lady!\n\nMABEL CHILTERN.  How sweet of you to say that, Lord Caversham!  Do come\nto us more often.  You know we are always at home on Wednesdays, and you\nlook so well with your star!\n\nLORD CAVERSHAM.  Never go anywhere now.  Sick of London Society.\nShouldn't mind being introduced to my own tailor; he always votes on the\nright side.  But object strongly to being sent down to dinner with my\nwife's milliner.  Never could stand Lady Caversham's bonnets.\n\nMABEL CHILTERN.  Oh, I love London Society!  I think it has immensely\nimproved.  It is entirely composed now of beautiful idiots and brilliant\nlunatics.  Just what Society should be.\n\nLORD CAVERSHAM.  Hum!  Which is Goring?  Beautiful idiot, or the other\nthing?\n\nMABEL CHILTERN.  [_Gravely_.]  I have been obliged for the present to put\nLord Goring into a class quite by himself.  But he is developing\ncharmingly!\n\nLORD CAVERSHAM.  Into what?\n\nMABEL CHILTERN.  [_With a little curtsey_.]  I hope to let you know very\nsoon, Lord Caversham!\n\nMASON.  [_Announcing guests_.]  Lady Markby.  Mrs. Cheveley.\n\n[_Enter_ LADY MARKBY _and_ MRS. CHEVELEY.  LADY MARKBY _is a pleasant_,\n_kindly_, _popular woman_, _with gray hair a la marquise and good lace_.\nMRS. CHEVELEY, _who accompanies her_, _is tall and rather slight_.  _Lips\nvery thin and highly-coloured_, _a line of scarlet on a pallid face_.\n_Venetian red hair_, _aquiline nose_, _and long throat_.  _Rouge\naccentuates the natural paleness of her complexion_.  _Gray-green eyes\nthat move restlessly_.  _She is in heliotrope_, _with diamonds_.  _She\nlooks rather like an orchid_, _and makes great demands on one's\ncuriosity_.  _In all her movements she is extremely graceful_.  _A work\nof art_, _on the whole_, _but showing the influence of too many\nschools_.]\n\nLADY MARKBY.  Good evening, dear Gertrude!  So kind of you to let me\nbring my friend, Mrs. Cheveley.  Two such charming women should know each\nother!\n\nLADY CHILTERN.  [_Advances towards_ MRS. CHEVELEY _with a sweet smile_.\n_Then suddenly stops_, _and bows rather distantly_.]  I think Mrs.\nCheveley and I have met before.  I did not know she had married a second\ntime.\n\nLADY MARKBY.  [_Genially_.]  Ah, nowadays people marry as often as they\ncan, don't they?  It is most fashionable.  [_To_ DUCHESS OF MARYBOROUGH.]\nDear Duchess, and how is the Duke?  Brain still weak, I suppose?  Well,\nthat is only to be expected, is it not?  His good father was just the\nsame.  There is nothing like race, is there?\n\nMRS. CHEVELEY.  [_Playing with her fan_.]  But have we really met before,\nLady Chiltern?  I can't remember where.  I have been out of England for\nso long.\n\nLADY CHILTERN.  We were at school together, Mrs. Cheveley.\n\nMRS. CHEVELEY [_Superciliously_.]  Indeed?  I have forgotten all about my\nschooldays.  I have a vague impression that they were detestable.\n\nLADY CHILTERN.  [_Coldly_.]  I am not surprised!\n\nMRS. CHEVELEY.  [_In her sweetest manner_.]  Do you know, I am quite\nlooking forward to meeting your clever husband, Lady Chiltern.  Since he\nhas been at the Foreign Office, he has been so much talked of in Vienna.\nThey actually succeed in spelling his name right in the newspapers.  That\nin itself is fame, on the continent.\n\nLADY CHILTERN.  I hardly think there will be much in common between you\nand my husband, Mrs. Cheveley!  [_Moves away_.]\n\nVICOMTE DE NANJAC.  Ah! chere Madame, queue surprise!  I have not seen\nyou since Berlin!\n\nMRS. CHEVELEY.  Not since Berlin, Vicomte.  Five years ago!\n\nVICOMTE DE NANJAC.  And you are younger and more beautiful than ever.\nHow do you manage it?\n\nMRS. CHEVELEY.  By making it a rule only to talk to perfectly charming\npeople like yourself.\n\nVICOMTE DE NANJAC.  Ah! you flatter me.  You butter me, as they say here.\n\nMRS. CHEVELEY.  Do they say that here?  How dreadful of them!\n\nVICOMTE DE NANJAC.  Yes, they have a wonderful language.  It should be\nmore widely known.\n\n[SIR ROBERT CHILTERN _enters_.  _A man of forty_, _but looking somewhat\nyounger_.  _Clean-shaven_, _with finely-cut features_, _dark-haired and\ndark-eyed_.  _A personality of mark_.  _Not popular--few personalities\nare_.  _But intensely admired by the few_, _and deeply respected by the\nmany_.  _The note of his manner is that of perfect distinction_, _with a\nslight touch of pride_.  _One feels that he is conscious of the success\nhe has made in life_.  _A nervous temperament_, _with a tired look_.\n_The firmly-chiselled mouth and chin contrast strikingly with the\nromantic expression in the deep-set eyes_.  _The variance is suggestive\nof an almost complete separation of passion and intellect_, _as though\nthought and emotion were each isolated in its own sphere through some\nviolence of will-power_.  _There is nervousness in the nostrils_, _and in\nthe pale_, _thin_, _pointed hands_.  _It would be inaccurate to call him\npicturesque_.  _Picturesqueness cannot survive the House of Commons_.\n_But Vandyck would have liked to have painted his head_.]\n\nSIR ROBERT CHILTERN.  Good evening, Lady Markby!  I hope you have brought\nSir John with you?\n\nLADY MARKBY.  Oh! I have brought a much more charming person than Sir\nJohn.  Sir John's temper since he has taken seriously to politics has\nbecome quite unbearable.  Really, now that the House of Commons is trying\nto become useful, it does a great deal of harm.\n\nSIR ROBERT CHILTERN.  I hope not, Lady Markby.  At any rate we do our\nbest to waste the public time, don't we?  But who is this charming person\nyou have been kind enough to bring to us?\n\nLADY MARKBY.  Her name is Mrs. Cheveley!  One of the Dorsetshire\nCheveleys, I suppose.  But I really don't know.  Families are so mixed\nnowadays.  Indeed, as a rule, everybody turns out to be somebody else.\n\nSIR ROBERT CHILTERN.  Mrs. Cheveley?  I seem to know the name.\n\nLADY MARKBY.  She has just arrived from Vienna.\n\nSIR ROBERT CHILTERN.  Ah! yes.  I think I know whom you mean.\n\nLADY MARKBY.  Oh! she goes everywhere there, and has such pleasant\nscandals about all her friends.  I really must go to Vienna next winter.\nI hope there is a good chef at the Embassy.\n\nSIR ROBERT CHILTERN.  If there is not, the Ambassador will certainly have\nto be recalled.  Pray point out Mrs. Cheveley to me.  I should like to\nsee her.\n\nLADY MARKBY.  Let me introduce you.  [_To_ MRS. CHEVELEY.]  My dear, Sir\nRobert Chiltern is dying to know you!\n\nSIR ROBERT CHILTERN.  [_Bowing_.]  Every one is dying to know the\nbrilliant Mrs. Cheveley.  Our attaches at Vienna write to us about\nnothing else.\n\nMRS. CHEVELEY.  Thank you, Sir Robert.  An acquaintance that begins with\na compliment is sure to develop into a real friendship.  It starts in the\nright manner.  And I find that I know Lady Chiltern already.\n\nSIR ROBERT CHILTERN.  Really?\n\nMRS. CHEVELEY.  Yes.  She has just reminded me that we were at school\ntogether.  I remember it perfectly now.  She always got the good conduct\nprize.  I have a distinct recollection of Lady Chiltern always getting\nthe good conduct prize!\n\nSIR ROBERT CHILTERN.  [_Smiling_.]  And what prizes did you get, Mrs.\nCheveley?\n\nMRS. CHEVELEY.  My prizes came a little later on in life.  I don't think\nany of them were for good conduct.  I forget!\n\nSIR ROBERT CHILTERN.  I am sure they were for something charming!\n\nMRS. CHEVELEY.  I don't know that women are always rewarded for being\ncharming.  I think they are usually punished for it!  Certainly, more\nwomen grow old nowadays through the faithfulness of their admirers than\nthrough anything else!  At least that is the only way I can account for\nthe terribly haggard look of most of your pretty women in London!\n\nSIR ROBERT CHILTERN.  What an appalling philosophy that sounds!  To\nattempt to classify you, Mrs. Cheveley, would be an impertinence.  But\nmay I ask, at heart, are you an optimist or a pessimist?  Those seem to\nbe the only two fashionable religions left to us nowadays.\n\nMRS. CHEVELEY.  Oh, I'm neither.  Optimism begins in a broad grin, and\nPessimism ends with blue spectacles.  Besides, they are both of them\nmerely poses.\n\nSIR ROBERT CHILTERN.  You prefer to be natural?\n\nMRS. CHEVELEY.  Sometimes.  But it is such a very difficult pose to keep\nup.\n\nSIR ROBERT CHILTERN.  What would those modern psychological novelists, of\nwhom we hear so much, say to such a theory as that?\n\nMRS. CHEVELEY.  Ah! the strength of women comes from the fact that\npsychology cannot explain us.  Men can be analysed, women . . . merely\nadored.\n\nSIR ROBERT CHILTERN.  You think science cannot grapple with the problem\nof women?\n\nMRS. CHEVELEY.  Science can never grapple with the irrational.  That is\nwhy it has no future before it, in this world.\n\nSIR ROBERT CHILTERN.  And women represent the irrational.\n\nMRS. CHEVELEY.  Well-dressed women do.\n\nSIR ROBERT CHILTERN.  [_With a polite bow_.]  I fear I could hardly agree\nwith you there.  But do sit down.  And now tell me, what makes you leave\nyour brilliant Vienna for our gloomy London--or perhaps the question is\nindiscreet?\n\nMRS. CHEVELEY.  Questions are never indiscreet.  Answers sometimes are.\n\nSIR ROBERT CHILTERN.  Well, at any rate, may I know if it is politics or\npleasure?\n\nMRS. CHEVELEY.  Politics are my only pleasure.  You see nowadays it is\nnot fashionable to flirt till one is forty, or to be romantic till one is\nforty-five, so we poor women who are under thirty, or say we are, have\nnothing open to us but politics or philanthropy.  And philanthropy seems\nto me to have become simply the refuge of people who wish to annoy their\nfellow-creatures.  I prefer politics.  I think they are more . . .\nbecoming!\n\nSIR ROBERT CHILTERN.  A political life is a noble career!\n\nMRS. CHEVELEY.  Sometimes.  And sometimes it is a clever game, Sir\nRobert.  And sometimes it is a great nuisance.\n\nSIR ROBERT CHILTERN.  Which do you find it?\n\nMRS. CHEVELEY.  I?  A combination of all three.  [_Drops her fan_.]\n\nSIR ROBERT CHILTERN.  [_Picks up fan_.]  Allow me!\n\nMRS. CHEVELEY.  Thanks.\n\nSIR ROBERT CHILTERN.  But you have not told me yet what makes you honour\nLondon so suddenly.  Our season is almost over.\n\nMRS. CHEVELEY.  Oh! I don't care about the London season!  It is too\nmatrimonial.  People are either hunting for husbands, or hiding from\nthem.  I wanted to meet you.  It is quite true.  You know what a woman's\ncuriosity is.  Almost as great as a man's!  I wanted immensely to meet\nyou, and . . . to ask you to do something for me.\n\nSIR ROBERT CHILTERN.  I hope it is not a little thing, Mrs. Cheveley.  I\nfind that little things are so very difficult to do.\n\nMRS. CHEVELEY.  [_After a moment's reflection_.]  No, I don't think it is\nquite a little thing.\n\nSIR ROBERT CHILTERN.  I am so glad.  Do tell me what it is.\n\nMRS. CHEVELEY.  Later on.  [_Rises_.]  And now may I walk through your\nbeautiful house?  I hear your pictures are charming.  Poor Baron\nArnheim--you remember the Baron?--used to tell me you had some wonderful\nCorots.\n\nSIR ROBERT CHILTERN.  [_With an almost imperceptible start_.]  Did you\nknow Baron Arnheim well?\n\nMRS. CHEVELEY.  [_Smiling_.]  Intimately.  Did you?\n\nSIR ROBERT CHILTERN.  At one time.\n\nMRS. CHEVELEY.  Wonderful man, wasn't he?\n\nSIR ROBERT CHILTERN.  [_After a pause_.]  He was very remarkable, in many\nways.\n\nMRS. CHEVELEY.  I often think it such a pity he never wrote his memoirs.\nThey would have been most interesting.\n\nSIR ROBERT CHILTERN.  Yes: he knew men and cities well, like the old\nGreek.\n\nMRS. CHEVELEY.  Without the dreadful disadvantage of having a Penelope\nwaiting at home for him.\n\nMASON.  Lord Goring.\n\n[_Enter_ LORD GORING.  _Thirty-four_, _but always says he is younger_.\n_A well-bred_, _expressionless face_.  _He is clever_, _but would not\nlike to be thought so_.  _A flawless dandy_, _he would be annoyed if he\nwere considered romantic_.  _He plays with life_, _and is on perfectly\ngood terms with the world_.  _He is fond of being misunderstood_.  _It\ngives him a post of vantage_.]\n\nSIR ROBERT CHILTERN.  Good evening, my dear Arthur!  Mrs. Cheveley, allow\nme to introduce to you Lord Goring, the idlest man in London.\n\nMRS. CHEVELEY.  I have met Lord Goring before.\n\nLORD GORING.  [_Bowing_.]  I did not think you would remember me, Mrs.\nCheveley.\n\nMRS. CHEVELEY.  My memory is under admirable control.  And are you still\na bachelor?\n\nLORD GORING.  I . . . believe so.\n\nMRS. CHEVELEY.  How very romantic!\n\nLORD GORING.  Oh! I am not at all romantic.  I am not old enough.  I\nleave romance to my seniors.\n\nSIR ROBERT CHILTERN.  Lord Goring is the result of Boodle's Club, Mrs.\nCheveley.\n\nMRS. CHEVELEY.  He reflects every credit on the institution.\n\nLORD GORING.  May I ask are you staying in London long?\n\nMRS. CHEVELEY.  That depends partly on the weather, partly on the\ncooking, and partly on Sir Robert.\n\nSIR ROBERT CHILTERN.  You are not going to plunge us into a European war,\nI hope?\n\nMRS. CHEVELEY.  There is no danger, at present!\n\n[_She nods to_ LORD GORING, _with a look of amusement in her eyes_, _and\ngoes out with_ SIR ROBERT CHILTERN.  LORD GORING _saunters over to_ MABEL\nCHILTERN.]\n\nMABEL CHILTERN.  You are very late!\n\nLORD GORING.  Have you missed me?\n\nMABEL CHILTERN.  Awfully!\n\nLORD GORING.  Then I am sorry I did not stay away longer.  I like being\nmissed.\n\nMABEL CHILTERN.  How very selfish of you!\n\nLORD GORING.  I am very selfish.\n\nMABEL CHILTERN.  You are always telling me of your bad qualities, Lord\nGoring.\n\nLORD GORING.  I have only told you half of them as yet, Miss Mabel!\n\nMABEL CHILTERN.  Are the others very bad?\n\nLORD GORING.  Quite dreadful!  When I think of them at night I go to\nsleep at once.\n\nMABEL CHILTERN.  Well, I delight in your bad qualities.  I wouldn't have\nyou part with one of them.\n\nLORD GORING.  How very nice of you!  But then you are always nice.  By\nthe way, I want to ask you a question, Miss Mabel.  Who brought Mrs.\nCheveley here?  That woman in heliotrope, who has just gone out of the\nroom with your brother?\n\nMABEL CHILTERN.  Oh, I think Lady Markby brought her.  Why do you ask?\n\nLORD GORING.  I haven't seen her for years, that is all.\n\nMABEL CHILTERN.  What an absurd reason!\n\nLORD GORING.  All reasons are absurd.\n\nMABEL CHILTERN.  What sort of a woman is she?\n\nLORD GORING.  Oh! a genius in the daytime and a beauty at night!\n\nMABEL CHILTERN.  I dislike her already.\n\nLORD GORING.  That shows your admirable good taste.\n\nVICOMTE DE NANJAC.  [_Approaching_.]  Ah, the English young lady is the\ndragon of good taste, is she not?  Quite the dragon of good taste.\n\nLORD GORING.  So the newspapers are always telling us.\n\nVICOMTE DE NANJAC.  I read all your English newspapers.  I find them so\namusing.\n\nLORD GORING.  Then, my dear Nanjac, you must certainly read between the\nlines.\n\nVICOMTE DE NANJAC.  I should like to, but my professor objects.  [_To_\nMABEL CHILTERN.]  May I have the pleasure of escorting you to the\nmusic-room, Mademoiselle?\n\nMABEL CHILTERN.  [_Looking very disappointed_.]  Delighted, Vicomte,\nquite delighted!  [_Turning to_ LORD GORING.]  Aren't you coming to the\nmusic-room?\n\nLORD GORING.  Not if there is any music going on, Miss Mabel.\n\nMABEL CHILTERN.  [_Severely_.]  The music is in German.  You would not\nunderstand it.\n\n[_Goes out with the_ VICOMTE DE NANJAC.  LORD CAVERSHAM _comes up to his\nson_.]\n\nLORD CAVERSHAM.  Well, sir! what are you doing here?  Wasting your life\nas usual!  You should be in bed, sir.  You keep too late hours!  I heard\nof you the other night at Lady Rufford's dancing till four o'clock in the\nmorning!\n\nLORD GORING.  Only a quarter to four, father.\n\nLORD CAVERSHAM.  Can't make out how you stand London Society.  The thing\nhas gone to the dogs, a lot of damned nobodies talking about nothing.\n\nLORD GORING.  I love talking about nothing, father.  It is the only thing\nI know anything about.\n\nLORD CAVERSHAM.  You seem to me to be living entirely for pleasure.\n\nLORD GORING.  What else is there to live for, father?  Nothing ages like\nhappiness.\n\nLORD CAVERSHAM.  You are heartless, sir, very heartless!\n\nLORD GORING.  I hope not, father.  Good evening, Lady Basildon!\n\nLADY BASILDON.  [_Arching two pretty eyebrows_.]  Are you here?  I had no\nidea you ever came to political parties!\n\nLORD GORING.  I adore political parties.  They are the only place left to\nus where people don't talk politics.\n\nLADY BASILDON.  I delight in talking politics.  I talk them all day long.\nBut I can't bear listening to them.  I don't know how the unfortunate men\nin the House stand these long debates.\n\nLORD GORING.  By never listening.\n\nLADY BASILDON.  Really?\n\nLORD GORING.  [_In his most serious manner_.]  Of course.  You see, it is\na very dangerous thing to listen.  If one listens one may be convinced;\nand a man who allows himself to be convinced by an argument is a\nthoroughly unreasonable person.\n\nLADY BASILDON.  Ah! that accounts for so much in men that I have never\nunderstood, and so much in women that their husbands never appreciate in\nthem!\n\nMRS. MARCHMONT.  [_With a sigh_.]  Our husbands never appreciate anything\nin us.  We have to go to others for that!\n\nLADY BASILDON.  [_Emphatically_.]  Yes, always to others, have we not?\n\nLORD GORING.  [_Smiling_.]  And those are the views of the two ladies who\nare known to have the most admirable husbands in London.\n\nMRS. MARCHMONT.  That is exactly what we can't stand.  My Reginald is\nquite hopelessly faultless.  He is really unendurably so, at times!\nThere is not the smallest element of excitement in knowing him.\n\nLORD GORING.  How terrible!  Really, the thing should be more widely\nknown!\n\nLADY BASILDON.  Basildon is quite as bad; he is as domestic as if he was\na bachelor.\n\nMRS. MARCHMONT.  [_Pressing_ LADY BASILDON'S _hand_.]  My poor Olivia!\nWe have married perfect husbands, and we are well punished for it.\n\nLORD GORING.  I should have thought it was the husbands who were\npunished.\n\nMRS. MARCHMONT.  [_Drawing herself up_.]  Oh, dear no!  They are as happy\nas possible!  And as for trusting us, it is tragic how much they trust\nus.\n\nLADY BASILDON.  Perfectly tragic!\n\nLORD GORING.  Or comic, Lady Basildon?\n\nLADY BASILDON.  Certainly not comic, Lord Goring.  How unkind of you to\nsuggest such a thing!\n\nMRS. MARCHMONT.  I am afraid Lord Goring is in the camp of the enemy, as\nusual.  I saw him talking to that Mrs. Cheveley when he came in.\n\nLORD GORING.  Handsome woman, Mrs. Cheveley!\n\nLADY BASILDON.  [_Stiffly_.]  Please don't praise other women in our\npresence.  You might wait for us to do that!\n\nLORD GORING.  I did wait.\n\nMRS. MARCHMONT.  Well, we are not going to praise her.  I hear she went\nto the Opera on Monday night, and told Tommy Rufford at supper that, as\nfar as she could see, London Society was entirely made up of dowdies and\ndandies.\n\nLORD GORING.  She is quite right, too.  The men are all dowdies and the\nwomen are all dandies, aren't they?\n\nMRS. MARCHMONT.  [_After a pause_.]  Oh! do you really think that is what\nMrs. Cheveley meant?\n\nLORD GORING.  Of course.  And a very sensible remark for Mrs. Cheveley to\nmake, too.\n\n[_Enter_ MABEL CHILTERN.  _She joins the group_.]\n\nMABEL CHILTERN.  Why are you talking about Mrs. Cheveley?  Everybody is\ntalking about Mrs. Cheveley!  Lord Goring says--what did you say, Lord\nGoring, about Mrs. Cheveley?  Oh! I remember, that she was a genius in\nthe daytime and a beauty at night.\n\nLADY BASILDON.  What a horrid combination!  So very unnatural!\n\nMRS. MARCHMONT.  [_In her most dreamy manner_.]  I like looking at\ngeniuses, and listening to beautiful people.\n\nLORD GORING.  Ah! that is morbid of you, Mrs. Marchmont!\n\nMRS. MARCHMONT.  [_Brightening to a look of real pleasure_.]  I am so\nglad to hear you say that.  Marchmont and I have been married for seven\nyears, and he has never once told me that I was morbid.  Men are so\npainfully unobservant!\n\nLADY BASILDON.  [_Turning to her_.]  I have always said, dear Margaret,\nthat you were the most morbid person in London.\n\nMRS. MARCHMONT.  Ah! but you are always sympathetic, Olivia!\n\nMABEL CHILTERN.  Is it morbid to have a desire for food?  I have a great\ndesire for food.  Lord Goring, will you give me some supper?\n\nLORD GORING.  With pleasure, Miss Mabel.  [_Moves away with her_.]\n\nMABEL CHILTERN.  How horrid you have been!  You have never talked to me\nthe whole evening!\n\nLORD GORING.  How could I?  You went away with the child-diplomatist.\n\nMABEL CHILTERN.  You might have followed us.  Pursuit would have been\nonly polite.  I don't think I like you at all this evening!\n\nLORD GORING.  I like you immensely.\n\nMABEL CHILTERN.  Well, I wish you'd show it in a more marked way!  [_They\ngo downstairs_.]\n\nMRS. MARCHMONT.  Olivia, I have a curious feeling of absolute faintness.\nI think I should like some supper very much.  I know I should like some\nsupper.\n\nLADY BASILDON.  I am positively dying for supper, Margaret!\n\nMRS. MARCHMONT.  Men are so horribly selfish, they never think of these\nthings.\n\nLADY BASILDON.  Men are grossly material, grossly material!\n\n[_The_ VICOMTE DE NANJAC _enters from the music-room with some other\nguests_.  _After having carefully examined all the people present_, _he\napproaches_ LADY BASILDON.]\n\nVICOMTE DE NANJAC.  May I have the honour of taking you down to supper,\nComtesse?\n\nLADY BASILDON.  [_Coldly_.]  I never take supper, thank you, Vicomte.\n[_The_ VICOMTE _is about to retire_.  LADY BASILDON, _seeing this_,\n_rises at once and takes his arm_.]  But I will come down with you with\npleasure.\n\nVICOMTE DE NANJAC.  I am so fond of eating!  I am very English in all my\ntastes.\n\nLADY BASILDON.  You look quite English, Vicomte, quite English.\n\n[_They pass out_.  MR. MONTFORD, _a perfectly groomed young dandy_,\n_approaches_ MRS. MARCHMONT.]\n\nMR. MONTFORD.  Like some supper, Mrs. Marchmont?\n\nMRS. MARCHMONT.  [_Languidly_.]  Thank you, Mr. Montford, I never touch\nsupper.  [_Rises hastily and takes his arm_.]  But I will sit beside you,\nand watch you.\n\nMR. MONTFORD.  I don't know that I like being watched when I am eating!\n\nMRS. MARCHMONT.  Then I will watch some one else.\n\nMR. MONTFORD.  I don't know that I should like that either.\n\nMRS. MARCHMONT.  [_Severely_.]  Pray, Mr. Montford, do not make these\npainful scenes of jealousy in public!\n\n[_They go downstairs with the other guests_, _passing_ SIR ROBERT\nCHILTERN _and_ MRS. CHEVELEY, _who now enter_.]\n\nSIR ROBERT CHILTERN.  And are you going to any of our country houses\nbefore you leave England, Mrs. Cheveley?\n\nMRS. CHEVELEY.  Oh, no!  I can't stand your English house-parties.  In\nEngland people actually try to be brilliant at breakfast.  That is so\ndreadful of them!  Only dull people are brilliant at breakfast.  And then\nthe family skeleton is always reading family prayers.  My stay in England\nreally depends on you, Sir Robert.  [_Sits down on the sofa_.]\n\nSIR ROBERT CHILTERN.  [_Taking a seat beside her_.]  Seriously?\n\nMRS. CHEVELEY.  Quite seriously.  I want to talk to you about a great\npolitical and financial scheme, about this Argentine Canal Company, in\nfact.\n\nSIR ROBERT CHILTERN.  What a tedious, practical subject for you to talk\nabout, Mrs. Cheveley!\n\nMRS. CHEVELEY.  Oh, I like tedious, practical subjects.  What I don't\nlike are tedious, practical people.  There is a wide difference.\nBesides, you are interested, I know, in International Canal schemes.  You\nwere Lord Radley's secretary, weren't you, when the Government bought the\nSuez Canal shares?\n\nSIR ROBERT CHILTERN.  Yes.  But the Suez Canal was a very great and\nsplendid undertaking.  It gave us our direct route to India.  It had\nimperial value.  It was necessary that we should have control.  This\nArgentine scheme is a commonplace Stock Exchange swindle.\n\nMRS. CHEVELEY.  A speculation, Sir Robert!  A brilliant, daring\nspeculation.\n\nSIR ROBERT CHILTERN.  Believe me, Mrs. Cheveley, it is a swindle.  Let us\ncall things by their proper names.  It makes matters simpler.  We have\nall the information about it at the Foreign Office.  In fact, I sent out\na special Commission to inquire into the matter privately, and they\nreport that the works are hardly begun, and as for the money already\nsubscribed, no one seems to know what has become of it.  The whole thing\nis a second Panama, and with not a quarter of the chance of success that\nmiserable affair ever had.  I hope you have not invested in it.  I am\nsure you are far too clever to have done that.\n\nMRS. CHEVELEY.  I have invested very largely in it.\n\nSIR ROBERT CHILTERN.  Who could have advised you to do such a foolish\nthing?\n\nMRS. CHEVELEY.  Your old friend--and mine.\n\nSIR ROBERT CHILTERN.  Who?\n\nMRS. CHEVELEY.  Baron Arnheim.\n\nSIR ROBERT CHILTERN.  [_Frowning_.]  Ah! yes.  I remember hearing, at the\ntime of his death, that he had been mixed up in the whole affair.\n\nMRS. CHEVELEY.  It was his last romance.  His last but one, to do him\njustice.\n\nSIR ROBERT CHILTERN.  [_Rising_.]  But you have not seen my Corots yet.\nThey are in the music-room.  Corots seem to go with music, don't they?\nMay I show them to you?\n\nMRS. CHEVELEY.  [_Shaking her head_.]  I am not in a mood to-night for\nsilver twilights, or rose-pink dawns.  I want to talk business.\n[_Motions to him with her fan to sit down again beside her_.]\n\nSIR ROBERT CHILTERN.  I fear I have no advice to give you, Mrs. Cheveley,\nexcept to interest yourself in something less dangerous.  The success of\nthe Canal depends, of course, on the attitude of England, and I am going\nto lay the report of the Commissioners before the House to-morrow night.\n\nMRS. CHEVELEY.  That you must not do.  In your own interests, Sir Robert,\nto say nothing of mine, you must not do that.\n\nSIR ROBERT CHILTERN.  [_Looking at her in wonder_.]  In my own interests?\nMy dear Mrs. Cheveley, what do you mean?  [_Sits down beside her_.]\n\nMRS. CHEVELEY.  Sir Robert, I will be quite frank with you.  I want you\nto withdraw the report that you had intended to lay before the House, on\nthe ground that you have reasons to believe that the Commissioners have\nbeen prejudiced or misinformed, or something.  Then I want you to say a\nfew words to the effect that the Government is going to reconsider the\nquestion, and that you have reason to believe that the Canal, if\ncompleted, will be of great international value.  You know the sort of\nthings ministers say in cases of this kind.  A few ordinary platitudes\nwill do.  In modern life nothing produces such an effect as a good\nplatitude.  It makes the whole world kin.  Will you do that for me?\n\nSIR ROBERT CHILTERN.  Mrs. Cheveley, you cannot be serious in making me\nsuch a proposition!\n\nMRS. CHEVELEY.  I am quite serious.\n\nSIR ROBERT CHILTERN.  [_Coldly_.]  Pray allow me to believe that you are\nnot.\n\nMRS. CHEVELEY.  [_Speaking with great deliberation and emphasis_.]  Ah!\nbut I am.  And if you do what I ask you, I . . . will pay you very\nhandsomely!\n\nSIR ROBERT CHILTERN.  Pay me!\n\nMRS. CHEVELEY.  Yes.\n\nSIR ROBERT CHILTERN.  I am afraid I don't quite understand what you mean.\n\nMRS. CHEVELEY.  [_Leaning back on the sofa and looking at him_.]  How\nvery disappointing!  And I have come all the way from Vienna in order\nthat you should thoroughly understand me.\n\nSIR ROBERT CHILTERN.  I fear I don't.\n\nMRS. CHEVELEY.  [_In her most nonchalant manner_.]  My dear Sir Robert,\nyou are a man of the world, and you have your price, I suppose.\nEverybody has nowadays.  The drawback is that most people are so\ndreadfully expensive.  I know I am.  I hope you will be more reasonable\nin your terms.\n\nSIR ROBERT CHILTERN.  [_Rises indignantly_.]  If you will allow me, I\nwill call your carriage for you.  You have lived so long abroad, Mrs.\nCheveley, that you seem to be unable to realise that you are talking to\nan English gentleman.\n\nMRS. CHEVELEY.  [_Detains him by touching his arm with her fan_, _and\nkeeping it there while she is talking_.]  I realise that I am talking to\na man who laid the foundation of his fortune by selling to a Stock\nExchange speculator a Cabinet secret.\n\nSIR ROBERT CHILTERN.  [_Biting his lip_.]  What do you mean?\n\nMRS. CHEVELEY.  [_Rising and facing him_.]  I mean that I know the real\norigin of your wealth and your career, and I have got your letter, too.\n\nSIR ROBERT CHILTERN.  What letter?\n\nMRS. CHEVELEY.  [_Contemptuously_.]  The letter you wrote to Baron\nArnheim, when you were Lord Radley's secretary, telling the Baron to buy\nSuez Canal shares--a letter written three days before the Government\nannounced its own purchase.\n\nSIR ROBERT CHILTERN.  [_Hoarsely_.]  It is not true.\n\nMRS. CHEVELEY.  You thought that letter had been destroyed.  How foolish\nof you!  It is in my possession.\n\nSIR ROBERT CHILTERN.  The affair to which you allude was no more than a\nspeculation.  The House of Commons had not yet passed the bill; it might\nhave been rejected.\n\nMRS. CHEVELEY.  It was a swindle, Sir Robert.  Let us call things by\ntheir proper names.  It makes everything simpler.  And now I am going to\nsell you that letter, and the price I ask for it is your public support\nof the Argentine scheme.  You made your own fortune out of one canal.\nYou must help me and my friends to make our fortunes out of another!\n\nSIR ROBERT CHILTERN.  It is infamous, what you propose--infamous!\n\nMRS. CHEVELEY.  Oh, no!  This is the game of life as we all have to play\nit, Sir Robert, sooner or later!\n\nSIR ROBERT CHILTERN.  I cannot do what you ask me.\n\nMRS. CHEVELEY.  You mean you cannot help doing it.  You know you are\nstanding on the edge of a precipice.  And it is not for you to make\nterms.  It is for you to accept them.  Supposing you refuse--\n\nSIR ROBERT CHILTERN.  What then?\n\nMRS. CHEVELEY.  My dear Sir Robert, what then?  You are ruined, that is\nall!  Remember to what a point your Puritanism in England has brought\nyou.  In old days nobody pretended to be a bit better than his\nneighbours.  In fact, to be a bit better than one's neighbour was\nconsidered excessively vulgar and middle-class.  Nowadays, with our\nmodern mania for morality, every one has to pose as a paragon of purity,\nincorruptibility, and all the other seven deadly virtues--and what is the\nresult?  You all go over like ninepins--one after the other.  Not a year\npasses in England without somebody disappearing.  Scandals used to lend\ncharm, or at least interest, to a man--now they crush him.  And yours is\na very nasty scandal. You couldn't survive it.  If it were known that as\na young man, secretary to a great and important minister, you sold a\nCabinet secret for a large sum of money, and that that was the origin of\nyour wealth and career, you would be hounded out of public life, you\nwould disappear completely.  And after all, Sir Robert, why should you\nsacrifice your entire future rather than deal diplomatically with your\nenemy?  For the moment I am your enemy.  I admit it!  And I am much\nstronger than you are.  The big battalions are on my side.  You have a\nsplendid position, but it is your splendid position that makes you so\nvulnerable.  You can't defend it!  And I am in attack.  Of course I have\nnot talked morality to you.  You must admit in fairness that I have\nspared you that.  Years ago you did a clever, unscrupulous thing; it\nturned out a great success.  You owe to it your fortune and position.\nAnd now you have got to pay for it.  Sooner or later we have all to pay\nfor what we do.  You have to pay now.  Before I leave you to-night, you\nhave got to promise me to suppress your report, and to speak in the House\nin favour of this scheme.\n\nSIR ROBERT CHILTERN.  What you ask is impossible.\n\nMRS. CHEVELEY.  You must make it possible.  You are going to make it\npossible.  Sir Robert, you know what your English newspapers are like.\nSuppose that when I leave this house I drive down to some newspaper\noffice, and give them this scandal and the proofs of it!  Think of their\nloathsome joy, of the delight they would have in dragging you down, of\nthe mud and mire they would plunge you in.  Think of the hypocrite with\nhis greasy smile penning his leading article, and arranging the foulness\nof the public placard.\n\nSIR ROBERT CHILTERN.  Stop!  You want me to withdraw the report and to\nmake a short speech stating that I believe there are possibilities in the\nscheme?\n\nMRS. CHEVELEY.  [_Sitting down on the sofa_.]  Those are my terms.\n\nSIR ROBERT CHILTERN.  [_In a low voice_.]  I will give you any sum of\nmoney you want.\n\nMRS. CHEVELEY.  Even you are not rich enough, Sir Robert, to buy back\nyour past.  No man is.\n\nSIR ROBERT CHILTERN.  I will not do what you ask me.  I will not.\n\nMRS. CHEVELEY.  You have to.  If you don't . . . [_Rises from the sofa_.]\n\nSIR ROBERT CHILTERN.  [_Bewildered and unnerved_.]  Wait a moment!  What\ndid you propose?  You said that you would give me back my letter, didn't\nyou?\n\nMRS. CHEVELEY.  Yes.  That is agreed.  I will be in the Ladies' Gallery\nto-morrow night at half-past eleven.  If by that time--and you will have\nhad heaps of opportunity--you have made an announcement to the House in\nthe terms I wish, I shall hand you back your letter with the prettiest\nthanks, and the best, or at any rate the most suitable, compliment I can\nthink of.  I intend to play quite fairly with you.  One should always\nplay fairly . . . when one has the winning cards.  The Baron taught me\nthat . . . amongst other things.\n\nSIR ROBERT CHILTERN.  You must let me have time to consider your\nproposal.\n\nMRS. CHEVELEY.  No; you must settle now!\n\nSIR ROBERT CHILTERN.  Give me a week--three days!\n\nMRS. CHEVELEY.  Impossible!  I have got to telegraph to Vienna to-night.\n\nSIR ROBERT CHILTERN.  My God! what brought you into my life?\n\nMRS. CHEVELEY.  Circumstances.  [_Moves towards the door_.]\n\nSIR ROBERT CHILTERN.  Don't go.  I consent.  The report shall be\nwithdrawn.  I will arrange for a question to be put to me on the subject.\n\nMRS. CHEVELEY.  Thank you.  I knew we should come to an amicable\nagreement.  I understood your nature from the first.  I analysed you,\nthough you did not adore me.  And now you can get my carriage for me, Sir\nRobert.  I see the people coming up from supper, and Englishmen always\nget romantic after a meal, and that bores me dreadfully.  [_Exit_ SIR\nROBERT CHILTERN.]\n\n[_Enter Guests_, LADY CHILTERN, LADY MARKBY, LORD CAVERSHAM, LADY\nBASILDON, MRS. MARCHMONT, VICOMTE DE NANJAC, MR. MONTFORD.]\n\nLADY MARKBY.  Well, dear Mrs. Cheveley, I hope you have enjoyed yourself.\nSir Robert is very entertaining, is he not?\n\nMRS. CHEVELEY.  Most entertaining!  I have enjoyed my talk with him\nimmensely.\n\nLADY MARKBY.  He has had a very interesting and brilliant career.  And he\nhas married a most admirable wife.  Lady Chiltern is a woman of the very\nhighest principles, I am glad to say.  I am a little too old now, myself,\nto trouble about setting a good example, but I always admire people who\ndo.  And Lady Chiltern has a very ennobling effect on life, though her\ndinner-parties are rather dull sometimes.  But one can't have everything,\ncan one?  And now I must go, dear.  Shall I call for you to-morrow?\n\nMRS. CHEVELEY.  Thanks.\n\nLADY MARKBY.  We might drive in the Park at five.  Everything looks so\nfresh in the Park now!\n\nMRS. CHEVELEY.  Except the people!\n\nLADY MARKBY.  Perhaps the people are a little jaded.  I have often\nobserved that the Season as it goes on produces a kind of softening of\nthe brain.  However, I think anything is better than high intellectual\npressure.  That is the most unbecoming thing there is.  It makes the\nnoses of the young girls so particularly large.  And there is nothing so\ndifficult to marry as a large nose; men don't like them.  Good-night,\ndear!  [_To_ LADY CHILTERN.]  Good-night, Gertrude!  [_Goes out on_ LORD\nCAVERSHAM'S _arm_.]\n\nMRS. CHEVELEY.  What a charming house you have, Lady Chiltern!  I have\nspent a delightful evening.  It has been so interesting getting to know\nyour husband.\n\nLADY CHILTERN.  Why did you wish to meet my husband, Mrs. Cheveley?\n\nMRS. CHEVELEY.  Oh, I will tell you.  I wanted to interest him in this\nArgentine Canal scheme, of which I dare say you have heard.  And I found\nhim most susceptible,--susceptible to reason, I mean.  A rare thing in a\nman.  I converted him in ten minutes.  He is going to make a speech in\nthe House to-morrow night in favour of the idea.  We must go to the\nLadies' Gallery and hear him!  It will be a great occasion!\n\nLADY CHILTERN.  There must be some mistake.  That scheme could never have\nmy husband's support.\n\nMRS. CHEVELEY.  Oh, I assure you it's all settled.  I don't regret my\ntedious journey from Vienna now.  It has been a great success.  But, of\ncourse, for the next twenty-four hours the whole thing is a dead secret.\n\nLADY CHILTERN.  [_Gently_.]  A secret?  Between whom?\n\nMRS. CHEVELEY.  [_With a flash of amusement in her eyes_.]  Between your\nhusband and myself.\n\nSIR ROBERT CHILTERN.  [_Entering_.]  Your carriage is here, Mrs.\nCheveley!\n\nMRS. CHEVELEY.  Thanks!  Good evening, Lady Chiltern!  Good-night, Lord\nGoring!  I am at Claridge's.  Don't you think you might leave a card?\n\nLORD GORING.  If you wish it, Mrs. Cheveley!\n\nMRS. CHEVELEY.  Oh, don't be so solemn about it, or I shall be obliged to\nleave a card on you.  In England I suppose that would hardly be\nconsidered en regle.  Abroad, we are more civilised.  Will you see me\ndown, Sir Robert?  Now that we have both the same interests at heart we\nshall be great friends, I hope!\n\n[_Sails out on_ SIR ROBERT CHILTERN'S _arm_.  LADY CHILTERN _goes to the\ntop of the staircase and looks down at them as they descend_.  _Her\nexpression is troubled_.  _After a little time she is joined by some of\nthe guests_, _and passes with them into another reception-room_.]\n\nMABEL CHILTERN.  What a horrid woman!\n\nLORD GORING.  You should go to bed, Miss Mabel.\n\nMABEL CHILTERN.  Lord Goring!\n\nLORD GORING.  My father told me to go to bed an hour ago.  I don't see\nwhy I shouldn't give you the same advice.  I always pass on good advice.\nIt is the only thing to do with it.  It is never of any use to oneself.\n\nMABEL CHILTERN.  Lord Goring, you are always ordering me out of the room.\nI think it most courageous of you.  Especially as I am not going to bed\nfor hours.  [_Goes over to the sofa_.]  You can come and sit down if you\nlike, and talk about anything in the world, except the Royal Academy,\nMrs. Cheveley, or novels in Scotch dialect.  They are not improving\nsubjects.  [_Catches sight of something that is lying on the sofa half\nhidden by the cushion_.]  What is this?  Some one has dropped a diamond\nbrooch!  Quite beautiful, isn't it?  [_Shows it to him_.]  I wish it was\nmine, but Gertrude won't let me wear anything but pearls, and I am\nthoroughly sick of pearls.  They make one look so plain, so good and so\nintellectual.  I wonder whom the brooch belongs to.\n\nLORD GORING.  I wonder who dropped it.\n\nMABEL CHILTERN.  It is a beautiful brooch.\n\nLORD GORING.  It is a handsome bracelet.\n\nMABEL CHILTERN.  It isn't a bracelet.  It's a brooch.\n\nLORD GORING.  It can be used as a bracelet.  [_Takes it from her_, _and_,\n_pulling out a green letter-case_, _puts the ornament carefully in it_,\n_and replaces the whole thing in his breast-pocket with the most perfect\nsang froid_.]\n\nMABEL CHILTERN.  What are you doing?\n\nLORD GORING.  Miss Mabel, I am going to make a rather strange request to\nyou.\n\nMABEL CHILTERN.  [_Eagerly_.]  Oh, pray do!  I have been waiting for it\nall the evening.\n\nLORD GORING.  [_Is a little taken aback_, _but recovers himself_.]  Don't\nmention to anybody that I have taken charge of this brooch.  Should any\none write and claim it, let me know at once.\n\nMABEL CHILTERN.  That is a strange request.\n\nLORD GORING.  Well, you see I gave this brooch to somebody once, years\nago.\n\nMABEL CHILTERN.  You did?\n\nLORD GORING.  Yes.\n\n[LADY CHILTERN _enters alone_.  _The other guests have gone_.]\n\nMABEL CHILTERN.  Then I shall certainly bid you good-night.  Good-night,\nGertrude!  [_Exit_.]\n\nLADY CHILTERN.  Good-night, dear!  [_To_ LORD GORING.]  You saw whom Lady\nMarkby brought here to-night?\n\nLORD GORING.  Yes.  It was an unpleasant surprise.  What did she come\nhere for?\n\nLADY CHILTERN.  Apparently to try and lure Robert to uphold some\nfraudulent scheme in which she is interested.  The Argentine Canal, in\nfact.\n\nLORD GORING.  She has mistaken her man, hasn't she?\n\nLADY CHILTERN.  She is incapable of understanding an upright nature like\nmy husband's!\n\nLORD GORING.  Yes.  I should fancy she came to grief if she tried to get\nRobert into her toils.  It is extraordinary what astounding mistakes\nclever women make.\n\nLADY CHILTERN.  I don't call women of that kind clever.  I call them\nstupid!\n\nLORD GORING.  Same thing often.  Good-night, Lady Chiltern!\n\nLADY CHILTERN.  Good-night!\n\n[_Enter_ SIR ROBERT CHILTERN.]\n\nSIR ROBERT CHILTERN.  My dear Arthur, you are not going?  Do stop a\nlittle!\n\nLORD GORING.  Afraid I can't, thanks.  I have promised to look in at the\nHartlocks'.  I believe they have got a mauve Hungarian band that plays\nmauve Hungarian music.  See you soon.  Good-bye!\n\n[_Exit_]\n\nSIR ROBERT CHILTERN.  How beautiful you look to-night, Gertrude!\n\nLADY CHILTERN.  Robert, it is not true, is it?  You are not going to lend\nyour support to this Argentine speculation?  You couldn't!\n\nSIR ROBERT CHILTERN.  [_Starting_.]  Who told you I intended to do so?\n\nLADY CHILTERN.  That woman who has just gone out, Mrs. Cheveley, as she\ncalls herself now.  She seemed to taunt me with it.  Robert, I know this\nwoman.  You don't.  We were at school together.  She was untruthful,\ndishonest, an evil influence on every one whose trust or friendship she\ncould win.  I hated, I despised her.  She stole things, she was a thief.\nShe was sent away for being a thief.  Why do you let her influence you?\n\nSIR ROBERT CHILTERN.  Gertrude, what you tell me may be true, but it\nhappened many years ago.  It is best forgotten!  Mrs. Cheveley may have\nchanged since then.  No one should be entirely judged by their past.\n\nLADY CHILTERN.  [_Sadly_.]  One's past is what one is.  It is the only\nway by which people should be judged.\n\nSIR ROBERT CHILTERN.  That is a hard saying, Gertrude!\n\nLADY CHILTERN.  It is a true saying, Robert.  And what did she mean by\nboasting that she had got you to lend your support, your name, to a thing\nI have heard you describe as the most dishonest and fraudulent scheme\nthere has ever been in political life?\n\nSIR ROBERT CHILTERN.  [_Biting his lip_.]  I was mistaken in the view I\ntook.  We all may make mistakes.\n\nLADY CHILTERN.  But you told me yesterday that you had received the\nreport from the Commission, and that it entirely condemned the whole\nthing.\n\nSIR ROBERT CHILTERN.  [_Walking up and down_.]  I have reasons now to\nbelieve that the Commission was prejudiced, or, at any rate, misinformed.\nBesides, Gertrude, public and private life are different things.  They\nhave different laws, and move on different lines.\n\nLADY CHILTERN.  They should both represent man at his highest.  I see no\ndifference between them.\n\nSIR ROBERT CHILTERN.  [_Stopping_.]  In the present case, on a matter of\npractical politics, I have changed my mind.  That is all.\n\nLADY CHILTERN.  All!\n\nSIR ROBERT CHILTERN.  [_Sternly_.]  Yes!\n\nLADY CHILTERN.  Robert!  Oh! it is horrible that I should have to ask you\nsuch a question--Robert, are you telling me the whole truth?\n\nSIR ROBERT CHILTERN.  Why do you ask me such a question?\n\nLADY CHILTERN.  [_After a pause_.]  Why do you not answer it?\n\nSIR ROBERT CHILTERN.  [_Sitting down_.]  Gertrude, truth is a very\ncomplex thing, and politics is a very complex business.  There are wheels\nwithin wheels.  One may be under certain obligations to people that one\nmust pay.  Sooner or later in political life one has to compromise.\nEvery one does.\n\nLADY CHILTERN.  Compromise?  Robert, why do you talk so differently\nto-night from the way I have always heard you talk?  Why are you changed?\n\nSIR ROBERT CHILTERN.  I am not changed.  But circumstances alter things.\n\nLADY CHILTERN.  Circumstances should never alter principles!\n\nSIR ROBERT CHILTERN.  But if I told you--\n\nLADY CHILTERN.  What?\n\nSIR ROBERT CHILTERN.  That it was necessary, vitally necessary?\n\nLADY CHILTERN.  It can never be necessary to do what is not honourable.\nOr if it be necessary, then what is it that I have loved!  But it is not,\nRobert; tell me it is not.  Why should it be?  What gain would you get?\nMoney?  We have no need of that!  And money that comes from a tainted\nsource is a degradation.  Power?  But power is nothing in itself.  It is\npower to do good that is fine--that, and that only.  What is it, then?\nRobert, tell me why you are going to do this dishonourable thing!\n\nSIR ROBERT CHILTERN.  Gertrude, you have no right to use that word.  I\ntold you it was a question of rational compromise.  It is no more than\nthat.\n\nLADY CHILTERN.  Robert, that is all very well for other men, for men who\ntreat life simply as a sordid speculation; but not for you, Robert, not\nfor you.  You are different.  All your life you have stood apart from\nothers.  You have never let the world soil you.  To the world, as to\nmyself, you have been an ideal always.  Oh! be that ideal still.  That\ngreat inheritance throw not away--that tower of ivory do not destroy.\nRobert, men can love what is beneath them--things unworthy, stained,\ndishonoured.  We women worship when we love; and when we lose our\nworship, we lose everything.  Oh! don't kill my love for you, don't kill\nthat!\n\nSIR ROBERT CHILTERN.  Gertrude!\n\nLADY CHILTERN.  I know that there are men with horrible secrets in their\nlives--men who have done some shameful thing, and who in some critical\nmoment have to pay for it, by doing some other act of shame--oh! don't\ntell me you are such as they are!  Robert, is there in your life any\nsecret dishonour or disgrace?  Tell me, tell me at once, that--\n\nSIR ROBERT CHILTERN.  That what?\n\nLADY CHILTERN.  [_Speaking very slowly_.]  That our lives may drift\napart.\n\nSIR ROBERT CHILTERN.  Drift apart?\n\nLADY CHILTERN.  That they may be entirely separate.  It would be better\nfor us both.\n\nSIR ROBERT CHILTERN.  Gertrude, there is nothing in my past life that you\nmight not know.\n\nLADY CHILTERN.  I was sure of it, Robert, I was sure of it.  But why did\nyou say those dreadful things, things so unlike your real self?  Don't\nlet us ever talk about the subject again.  You will write, won't you, to\nMrs. Cheveley, and tell her that you cannot support this scandalous\nscheme of hers?  If you have given her any promise you must take it back,\nthat is all!\n\nSIR ROBERT CHILTERN.  Must I write and tell her that?\n\nLADY CHILTERN.  Surely, Robert!  What else is there to do?\n\nSIR ROBERT CHILTERN.  I might see her personally.  It would be better.\n\nLADY CHILTERN.  You must never see her again, Robert.  She is not a woman\nyou should ever speak to.  She is not worthy to talk to a man like you.\nNo; you must write to her at once, now, this moment, and let your letter\nshow her that your decision is quite irrevocable!\n\nSIR ROBERT CHILTERN.  Write this moment!\n\nLADY CHILTERN.  Yes.\n\nSIR ROBERT CHILTERN.  But it is so late.  It is close on twelve.\n\nLADY CHILTERN.  That makes no matter.  She must know at once that she has\nbeen mistaken in you--and that you are not a man to do anything base or\nunderhand or dishonourable.  Write here, Robert.  Write that you decline\nto support this scheme of hers, as you hold it to be a dishonest scheme.\nYes--write the word dishonest.  She knows what that word means.  [SIR\nROBERT CHILTERN _sits down and writes a letter_.  _His wife takes it up\nand reads it_.]  Yes; that will do.  [_Rings bell_.]  And now the\nenvelope.  [_He writes the envelope slowly_.  _Enter_ MASON.]  Have this\nletter sent at once to Claridge's Hotel.  There is no answer.  [_Exit_\nMASON.  LADY CHILTERN _kneels down beside her husband_, _and puts her\narms around him_.]  Robert, love gives one an instinct to things.  I feel\nto-night that I have saved you from something that might have been a\ndanger to you, from something that might have made men honour you less\nthan they do.  I don't think you realise sufficiently, Robert, that you\nhave brought into the political life of our time a nobler atmosphere, a\nfiner attitude towards life, a freer air of purer aims and higher\nideals--I know it, and for that I love you, Robert.\n\nSIR ROBERT CHILTERN.  Oh, love me always, Gertrude, love me always!\n\nLADY CHILTERN.  I will love you always, because you will always be worthy\nof love.  We needs must love the highest when we see it!  [_Kisses him\nand rises and goes out_.]\n\n[SIR ROBERT CHILTERN _walks up and down for a moment_; _then sits down\nand buries his face in his hands_.  _The Servant enters and begins\npulling out the lights_.  SIR ROBERT CHILTERN _looks up_.]\n\nSIR ROBERT CHILTERN.  Put out the lights, Mason, put out the lights!\n\n[_The Servant puts out the lights_.  _The room becomes almost dark_.\n_The only light there is comes from the great chandelier that hangs over\nthe staircase and illumines the tapestry of the Triumph of Love_.]\n\n                                 ACT DROP\n\n\n\n\nSECOND ACT\n\n\nSCENE\n\n\n_Morning-room at Sir Robert Chiltern's house_.\n\n[LORD GORING, _dressed in the height of fashion_, _is lounging in an\narmchair_.  SIR ROBERT CHILTERN _is standing in front of the fireplace_.\n_He is evidently in a state of great mental excitement and distress_.\n_As the scene progresses he paces nervously up and down the room_.]\n\nLORD GORING.  My dear Robert, it's a very awkward business, very awkward\nindeed.  You should have told your wife the whole thing.  Secrets from\nother people's wives are a necessary luxury in modern life.  So, at\nleast, I am always told at the club by people who are bald enough to know\nbetter.  But no man should have a secret from his own wife.  She\ninvariably finds it out.  Women have a wonderful instinct about things.\nThey can discover everything except the obvious.\n\nSIR ROBERT CHILTERN.  Arthur, I couldn't tell my wife.  When could I have\ntold her?  Not last night.  It would have made a life-long separation\nbetween us, and I would have lost the love of the one woman in the world\nI worship, of the only woman who has ever stirred love within me.  Last\nnight it would have been quite impossible.  She would have turned from me\nin horror . . . in horror and in contempt.\n\nLORD GORING.  Is Lady Chiltern as perfect as all that?\n\nSIR ROBERT CHILTERN.  Yes; my wife is as perfect as all that.\n\nLORD GORING.  [_Taking off his left-hand glove_.]  What a pity!  I beg\nyour pardon, my dear fellow, I didn't quite mean that.  But if what you\ntell me is true, I should like to have a serious talk about life with\nLady Chiltern.\n\nSIR ROBERT CHILTERN.  It would be quite useless.\n\nLORD GORING.  May I try?\n\nSIR ROBERT CHILTERN.  Yes; but nothing could make her alter her views.\n\nLORD GORING.  Well, at the worst it would simply be a psychological\nexperiment.\n\nSIR ROBERT CHILTERN.  All such experiments are terribly dangerous.\n\nLORD GORING.  Everything is dangerous, my dear fellow.  If it wasn't so,\nlife wouldn't be worth living. . . . Well, I am bound to say that I think\nyou should have told her years ago.\n\nSIR ROBERT CHILTERN.  When?  When we were engaged?  Do you think she\nwould have married me if she had known that the origin of my fortune is\nsuch as it is, the basis of my career such as it is, and that I had done\na thing that I suppose most men would call shameful and dishonourable?\n\nLORD GORING.  [_Slowly_.]  Yes; most men would call it ugly names.  There\nis no doubt of that.\n\nSIR ROBERT CHILTERN.  [_Bitterly_.]  Men who every day do something of\nthe same kind themselves.  Men who, each one of them, have worse secrets\nin their own lives.\n\nLORD GORING.  That is the reason they are so pleased to find out other\npeople's secrets.  It distracts public attention from their own.\n\nSIR ROBERT CHILTERN.  And, after all, whom did I wrong by what I did?  No\none.\n\nLORD GORING.  [_Looking at him steadily_.]  Except yourself, Robert.\n\nSIR ROBERT CHILTERN.  [_After a pause_.]  Of course I had private\ninformation about a certain transaction contemplated by the Government of\nthe day, and I acted on it.  Private information is practically the\nsource of every large modern fortune.\n\nLORD GORING.  [_Tapping his boot with his cane_.]  And public scandal\ninvariably the result.\n\nSIR ROBERT CHILTERN.  [_Pacing up and down the room_.]  Arthur, do you\nthink that what I did nearly eighteen years ago should be brought up\nagainst me now?  Do you think it fair that a man's whole career should be\nruined for a fault done in one's boyhood almost?  I was twenty-two at the\ntime, and I had the double misfortune of being well-born and poor, two\nunforgiveable things nowadays.  Is it fair that the folly, the sin of\none's youth, if men choose to call it a sin, should wreck a life like\nmine, should place me in the pillory, should shatter all that I have\nworked for, all that I have built up.  Is it fair, Arthur?\n\nLORD GORING.  Life is never fair, Robert.  And perhaps it is a good thing\nfor most of us that it is not.\n\nSIR ROBERT CHILTERN.  Every man of ambition has to fight his century with\nits own weapons.  What this century worships is wealth.  The God of this\ncentury is wealth.  To succeed one must have wealth.  At all costs one\nmust have wealth.\n\nLORD GORING.  You underrate yourself, Robert.  Believe me, without wealth\nyou could have succeeded just as well.\n\nSIR ROBERT CHILTERN.  When I was old, perhaps.  When I had lost my\npassion for power, or could not use it.  When I was tired, worn out,\ndisappointed.  I wanted my success when I was young.  Youth is the time\nfor success.  I couldn't wait.\n\nLORD GORING.  Well, you certainly have had your success while you are\nstill young.  No one in our day has had such a brilliant success.\nUnder-Secretary for Foreign Affairs at the age of forty--that's good\nenough for any one, I should think.\n\nSIR ROBERT CHILTERN.  And if it is all taken away from me now?  If I lose\neverything over a horrible scandal?  If I am hounded from public life?\n\nLORD GORING.  Robert, how could you have sold yourself for money?\n\nSIR ROBERT CHILTERN.  [_Excitedly_.]  I did not sell myself for money.  I\nbought success at a great price.  That is all.\n\nLORD GORING.  [_Gravely_.]  Yes; you certainly paid a great price for it.\nBut what first made you think of doing such a thing?\n\nSIR ROBERT CHILTERN.  Baron Arnheim.\n\nLORD GORING.  Damned scoundrel!\n\nSIR ROBERT CHILTERN.  No; he was a man of a most subtle and refined\nintellect.  A man of culture, charm, and distinction.  One of the most\nintellectual men I ever met.\n\nLORD GORING.  Ah! I prefer a gentlemanly fool any day.  There is more to\nbe said for stupidity than people imagine.  Personally I have a great\nadmiration for stupidity.  It is a sort of fellow-feeling, I suppose.\nBut how did he do it?  Tell me the whole thing.\n\nSIR ROBERT CHILTERN.  [_Throws himself into an armchair by the\nwriting-table_.]  One night after dinner at Lord Radley's the Baron began\ntalking about success in modern life as something that one could reduce\nto an absolutely definite science.  With that wonderfully fascinating\nquiet voice of his he expounded to us the most terrible of all\nphilosophies, the philosophy of power, preached to us the most marvellous\nof all gospels, the gospel of gold.  I think he saw the effect he had\nproduced on me, for some days afterwards he wrote and asked me to come\nand see him.  He was living then in Park Lane, in the house Lord Woolcomb\nhas now.  I remember so well how, with a strange smile on his pale,\ncurved lips, he led me through his wonderful picture gallery, showed me\nhis tapestries, his enamels, his jewels, his carved ivories, made me\nwonder at the strange loveliness of the luxury in which he lived; and\nthen told me that luxury was nothing but a background, a painted scene in\na play, and that power, power over other men, power over the world, was\nthe one thing worth having, the one supreme pleasure worth knowing, the\none joy one never tired of, and that in our century only the rich\npossessed it.\n\nLORD GORING.  [_With great deliberation_.]  A thoroughly shallow creed.\n\nSIR ROBERT CHILTERN.  [_Rising_.]  I didn't think so then.  I don't think\nso now.  Wealth has given me enormous power.  It gave me at the very\noutset of my life freedom, and freedom is everything.  You have never\nbeen poor, and never known what ambition is.  You cannot understand what\na wonderful chance the Baron gave me.  Such a chance as few men get.\n\nLORD GORING.  Fortunately for them, if one is to judge by results.  But\ntell me definitely, how did the Baron finally persuade you to--well, to\ndo what you did?\n\nSIR ROBERT CHILTERN.  When I was going away he said to me that if I ever\ncould give him any private information of real value he would make me a\nvery rich man.  I was dazed at the prospect he held out to me, and my\nambition and my desire for power were at that time boundless.  Six weeks\nlater certain private documents passed through my hands.\n\nLORD GORING.  [_Keeping his eyes steadily fixed on the carpet_.]  State\ndocuments?\n\nSIR ROBERT CHILTERN.  Yes.  [LORD GORING _sighs_, _then passes his hand\nacross his forehead and looks up_.]\n\nLORD GORING.  I had no idea that you, of all men in the world, could have\nbeen so weak, Robert, as to yield to such a temptation as Baron Arnheim\nheld out to you.\n\nSIR ROBERT CHILTERN.  Weak?  Oh, I am sick of hearing that phrase.  Sick\nof using it about others.  Weak?  Do you really think, Arthur, that it is\nweakness that yields to temptation?  I tell you that there are terrible\ntemptations that it requires strength, strength and courage, to yield to.\nTo stake all one's life on a single moment, to risk everything on one\nthrow, whether the stake be power or pleasure, I care not--there is no\nweakness in that.  There is a horrible, a terrible courage.  I had that\ncourage.  I sat down the same afternoon and wrote Baron Arnheim the\nletter this woman now holds.  He made three-quarters of a million over\nthe transaction.\n\nLORD GORING.  And you?\n\nSIR ROBERT CHILTERN.  I received from the Baron 110,000 pounds.\n\nLORD GORING.  You were worth more, Robert.\n\nSIR ROBERT CHILTERN.  No; that money gave me exactly what I wanted, power\nover others.  I went into the House immediately.  The Baron advised me in\nfinance from time to time.  Before five years I had almost trebled my\nfortune.  Since then everything that I have touched has turned out a\nsuccess.  In all things connected with money I have had a luck so\nextraordinary that sometimes it has made me almost afraid.  I remember\nhaving read somewhere, in some strange book, that when the gods wish to\npunish us they answer our prayers.\n\nLORD GORING.  But tell me, Robert, did you never suffer any regret for\nwhat you had done?\n\nSIR ROBERT CHILTERN.  No.  I felt that I had fought the century with its\nown weapons, and won.\n\nLORD GORING.  [_Sadly_.]  You thought you had won.\n\nSIR ROBERT CHILTERN.  I thought so.  [_After a long pause_.]  Arthur, do\nyou despise me for what I have told you?\n\nLORD GORING.  [_With deep feeling in his voice_.]  I am very sorry for\nyou, Robert, very sorry indeed.\n\nSIR ROBERT CHILTERN.  I don't say that I suffered any remorse.  I didn't.\nNot remorse in the ordinary, rather silly sense of the word.  But I have\npaid conscience money many times.  I had a wild hope that I might disarm\ndestiny.  The sum Baron Arnheim gave me I have distributed twice over in\npublic charities since then.\n\nLORD GORING.  [_Looking up_.]  In public charities?  Dear me! what a lot\nof harm you must have done, Robert!\n\nSIR ROBERT CHILTERN.  Oh, don't say that, Arthur; don't talk like that!\n\nLORD GORING.  Never mind what I say, Robert!  I am always saying what I\nshouldn't say.  In fact, I usually say what I really think.  A great\nmistake nowadays.  It makes one so liable to be misunderstood.  As\nregards this dreadful business, I will help you in whatever way I can.\nOf course you know that.\n\nSIR ROBERT CHILTERN.  Thank you, Arthur, thank you.  But what is to be\ndone?  What can be done?\n\nLORD GORING.  [_Leaning back with his hands in his pockets_.]  Well, the\nEnglish can't stand a man who is always saying he is in the right, but\nthey are very fond of a man who admits that he has been in the wrong.  It\nis one of the best things in them.  However, in your case, Robert, a\nconfession would not do.  The money, if you will allow me to say so, is\n. . . awkward.  Besides, if you did make a clean breast of the whole\naffair, you would never be able to talk morality again.  And in England a\nman who can't talk morality twice a week to a large, popular, immoral\naudience is quite over as a serious politician.  There would be nothing\nleft for him as a profession except Botany or the Church.  A confession\nwould be of no use.  It would ruin you.\n\nSIR ROBERT CHILTERN.  It would ruin me.  Arthur, the only thing for me to\ndo now is to fight the thing out.\n\nLORD GORING.  [_Rising from his chair_.]  I was waiting for you to say\nthat, Robert.  It is the only thing to do now.  And you must begin by\ntelling your wife the whole story.\n\nSIR ROBERT CHILTERN.  That I will not do.\n\nLORD GORING.  Robert, believe me, you are wrong.\n\nSIR ROBERT CHILTERN.  I couldn't do it.  It would kill her love for me.\nAnd now about this woman, this Mrs. Cheveley.  How can I defend myself\nagainst her?  You knew her before, Arthur, apparently.\n\nLORD GORING.  Yes.\n\nSIR ROBERT CHILTERN.  Did you know her well?\n\nLORD GORING.  [_Arranging his necktie_.]  So little that I got engaged to\nbe married to her once, when I was staying at the Tenbys'.  The affair\nlasted for three days . . . nearly.\n\nSIR ROBERT CHILTERN.  Why was it broken off?\n\nLORD GORING.  [_Airily_.]  Oh, I forget.  At least, it makes no matter.\nBy the way, have you tried her with money?  She used to be confoundedly\nfond of money.\n\nSIR ROBERT CHILTERN.  I offered her any sum she wanted.  She refused.\n\nLORD GORING.  Then the marvellous gospel of gold breaks down sometimes.\nThe rich can't do everything, after all.\n\nSIR ROBERT CHILTERN.  Not everything.  I suppose you are right.  Arthur,\nI feel that public disgrace is in store for me.  I feel certain of it.  I\nnever knew what terror was before.  I know it now.  It is as if a hand of\nice were laid upon one's heart.  It is as if one's heart were beating\nitself to death in some empty hollow.\n\nLORD GORING.  [_Striking the table_.]  Robert, you must fight her.  You\nmust fight her.\n\nSIR ROBERT CHILTERN.  But how?\n\nLORD GORING.  I can't tell you how at present.  I have not the smallest\nidea.  But every one has some weak point.  There is some flaw in each one\nof us.  [_Strolls to the fireplace and looks at himself in the glass_.]\nMy father tells me that even I have faults.  Perhaps I have.  I don't\nknow.\n\nSIR ROBERT CHILTERN.  In defending myself against Mrs. Cheveley, I have a\nright to use any weapon I can find, have I not?\n\nLORD GORING.  [_Still looking in the glass_.]  In your place I don't\nthink I should have the smallest scruple in doing so.  She is thoroughly\nwell able to take care of herself.\n\nSIR ROBERT CHILTERN.  [_Sits down at the table and takes a pen in his\nhand_.]  Well, I shall send a cipher telegram to the Embassy at Vienna,\nto inquire if there is anything known against her.  There may be some\nsecret scandal she might be afraid of.\n\nLORD GORING.  [_Settling his buttonhole_.]  Oh, I should fancy Mrs.\nCheveley is one of those very modern women of our time who find a new\nscandal as becoming as a new bonnet, and air them both in the Park every\nafternoon at five-thirty.  I am sure she adores scandals, and that the\nsorrow of her life at present is that she can't manage to have enough of\nthem.\n\nSIR ROBERT CHILTERN.  [_Writing_.]  Why do you say that?\n\nLORD GORING.  [_Turning round_.]  Well, she wore far too much rouge last\nnight, and not quite enough clothes.  That is always a sign of despair in\na woman.\n\nSIR ROBERT CHILTERN.  [_Striking a bell_.]  But it is worth while my\nwiring to Vienna, is it not?\n\nLORD GORING.  It is always worth while asking a question, though it is\nnot always worth while answering one.\n\n[_Enter_ MASON.]\n\nSIR ROBERT CHILTERN.  Is Mr. Trafford in his room?\n\nMASON.  Yes, Sir Robert.\n\nSIR ROBERT CHILTERN.  [_Puts what he has written into an envelope_,\n_which he then carefully closes_.]  Tell him to have this sent off in\ncipher at once.  There must not be a moment's delay.\n\nMASON.  Yes, Sir Robert.\n\nSIR ROBERT CHILTERN.  Oh! just give that back to me again.\n\n[_Writes something on the envelope_.  MASON _then goes out with the\nletter_.]\n\nSIR ROBERT CHILTERN.  She must have had some curious hold over Baron\nArnheim.  I wonder what it was.\n\nLORD GORING.  [_Smiling_.]  I wonder.\n\nSIR ROBERT CHILTERN.  I will fight her to the death, as long as my wife\nknows nothing.\n\nLORD GORING.  [_Strongly_.]  Oh, fight in any case--in any case.\n\nSIR ROBERT CHILTERN.  [_With a gesture of despair_.]  If my wife found\nout, there would be little left to fight for.  Well, as soon as I hear\nfrom Vienna, I shall let you know the result.  It is a chance, just a\nchance, but I believe in it.  And as I fought the age with its own\nweapons, I will fight her with her weapons.  It is only fair, and she\nlooks like a woman with a past, doesn't she?\n\nLORD GORING.  Most pretty women do.  But there is a fashion in pasts just\nas there is a fashion in frocks.  Perhaps Mrs. Cheveley's past is merely\na slightly decollete one, and they are excessively popular nowadays.\nBesides, my dear Robert, I should not build too high hopes on frightening\nMrs. Cheveley.  I should not fancy Mrs. Cheveley is a woman who would be\neasily frightened.  She has survived all her creditors, and she shows\nwonderful presence of mind.\n\nSIR ROBERT CHILTERN.  Oh! I live on hopes now.  I clutch at every chance.\nI feel like a man on a ship that is sinking.  The water is round my feet,\nand the very air is bitter with storm.  Hush! I hear my wife's voice.\n\n[_Enter_ LADY CHILTERN _in walking dress_.]\n\nLADY CHILTERN.  Good afternoon, Lord Goring!\n\nLORD GORING.  Good afternoon, Lady Chiltern!  Have you been in the Park?\n\nLADY CHILTERN.  No; I have just come from the Woman's Liberal\nAssociation, where, by the way, Robert, your name was received with loud\napplause, and now I have come in to have my tea.  [_To_ LORD GORING.]\nYou will wait and have some tea, won't you?\n\nLORD GORING.  I'll wait for a short time, thanks.\n\nLADY CHILTERN.  I will be back in a moment.  I am only going to take my\nhat off.\n\nLORD GORING.  [_In his most earnest manner_.]  Oh! please don't.  It is\nso pretty.  One of the prettiest hats I ever saw.  I hope the Woman's\nLiberal Association received it with loud applause.\n\nLADY CHILTERN.  [_With a smile_.]  We have much more important work to do\nthan look at each other's bonnets, Lord Goring.\n\nLORD GORING.  Really?  What sort of work?\n\nLADY CHILTERN.  Oh! dull, useful, delightful things, Factory Acts, Female\nInspectors, the Eight Hours' Bill, the Parliamentary Franchise. . . .\nEverything, in fact, that you would find thoroughly uninteresting.\n\nLORD GORING.  And never bonnets?\n\nLADY CHILTERN.  [_With mock indignation_.]  Never bonnets, never!\n\n[LADY CHILTERN _goes out through the door leading to her boudoir_.]\n\nSIR ROBERT CHILTERN.  [_Takes_ LORD GORING'S _hand_.]  You have been a\ngood friend to me, Arthur, a thoroughly good friend.\n\nLORD GORING.  I don't know that I have been able to do much for you,\nRobert, as yet.  In fact, I have not been able to do anything for you, as\nfar as I can see.  I am thoroughly disappointed with myself.\n\nSIR ROBERT CHILTERN.  You have enabled me to tell you the truth.  That is\nsomething.  The truth has always stifled me.\n\nLORD GORING.  Ah! the truth is a thing I get rid of as soon as possible!\nBad habit, by the way.  Makes one very unpopular at the club . . . with\nthe older members.  They call it being conceited.  Perhaps it is.\n\nSIR ROBERT CHILTERN.  I would to God that I had been able to tell the\ntruth . . . to live the truth.  Ah! that is the great thing in life, to\nlive the truth.  [_Sighs_, _and goes towards the door_.]  I'll see you\nsoon again, Arthur, shan't I?\n\nLORD GORING.  Certainly.  Whenever you like.  I'm going to look in at the\nBachelors' Ball to-night, unless I find something better to do.  But I'll\ncome round to-morrow morning.  If you should want me to-night by any\nchance, send round a note to Curzon Street.\n\nSIR ROBERT CHILTERN.  Thank you.\n\n[_As he reaches the door_, LADY CHILTERN _enters from her boudoir_.]\n\nLADY CHILTERN.  You are not going, Robert?\n\nSIR ROBERT CHILTERN.  I have some letters to write, dear.\n\nLADY CHILTERN.  [_Going to him_.]  You work too hard, Robert.  You seem\nnever to think of yourself, and you are looking so tired.\n\nSIR ROBERT CHILTERN.  It is nothing, dear, nothing.\n\n[_He kisses her and goes out_.]\n\nLADY CHILTERN.  [_To_ LORD GORING.]  Do sit down.  I am so glad you have\ncalled.  I want to talk to you about . . . well, not about bonnets, or\nthe Woman's Liberal Association.  You take far too much interest in the\nfirst subject, and not nearly enough in the second.\n\nLORD GORING.  You want to talk to me about Mrs. Cheveley?\n\nLADY CHILTERN.  Yes.  You have guessed it.  After you left last night I\nfound out that what she had said was really true.  Of course I made\nRobert write her a letter at once, withdrawing his promise.\n\nLORD GORING.  So he gave me to understand.\n\nLADY CHILTERN.  To have kept it would have been the first stain on a\ncareer that has been stainless always.  Robert must be above reproach.\nHe is not like other men.  He cannot afford to do what other men do.\n[_She looks at_ LORD GORING, _who remains silent_.]  Don't you agree with\nme?  You are Robert's greatest friend.  You are our greatest friend, Lord\nGoring.  No one, except myself, knows Robert better than you do.  He has\nno secrets from me, and I don't think he has any from you.\n\nLORD GORING.  He certainly has no secrets from me.  At least I don't\nthink so.\n\nLADY CHILTERN.  Then am I not right in my estimate of him?  I know I am\nright.  But speak to me frankly.\n\nLORD GORING.  [_Looking straight at her_.]  Quite frankly?\n\nLADY CHILTERN.  Surely.  You have nothing to conceal, have you?\n\nLORD GORING.  Nothing.  But, my dear Lady Chiltern, I think, if you will\nallow me to say so, that in practical life--\n\nLADY CHILTERN.  [_Smiling_.]  Of which you know so little, Lord Goring--\n\nLORD GORING.  Of which I know nothing by experience, though I know\nsomething by observation.  I think that in practical life there is\nsomething about success, actual success, that is a little unscrupulous,\nsomething about ambition that is unscrupulous always.  Once a man has set\nhis heart and soul on getting to a certain point, if he has to climb the\ncrag, he climbs the crag; if he has to walk in the mire--\n\nLADY CHILTERN.  Well?\n\nLORD GORING.  He walks in the mire.  Of course I am only talking\ngenerally about life.\n\nLADY CHILTERN.  [_Gravely_.]  I hope so.  Why do you look at me so\nstrangely, Lord Goring?\n\nLORD GORING.  Lady Chiltern, I have sometimes thought that . . . perhaps\nyou are a little hard in some of your views on life.  I think that . . .\noften you don't make sufficient allowances.  In every nature there are\nelements of weakness, or worse than weakness.  Supposing, for instance,\nthat--that any public man, my father, or Lord Merton, or Robert, say,\nhad, years ago, written some foolish letter to some one . . .\n\nLADY CHILTERN.  What do you mean by a foolish letter?\n\nLORD GORING.  A letter gravely compromising one's position.  I am only\nputting an imaginary case.\n\nLADY CHILTERN.  Robert is as incapable of doing a foolish thing as he is\nof doing a wrong thing.\n\nLORD GORING.  [_After a long pause_.]  Nobody is incapable of doing a\nfoolish thing.  Nobody is incapable of doing a wrong thing.\n\nLADY CHILTERN.  Are you a Pessimist?  What will the other dandies say?\nThey will all have to go into mourning.\n\nLORD GORING.  [_Rising_.]  No, Lady Chiltern, I am not a Pessimist.\nIndeed I am not sure that I quite know what Pessimism really means.  All\nI do know is that life cannot be understood without much charity, cannot\nbe lived without much charity.  It is love, and not German philosophy,\nthat is the true explanation of this world, whatever may be the\nexplanation of the next.  And if you are ever in trouble, Lady Chiltern,\ntrust me absolutely, and I will help you in every way I can.  If you ever\nwant me, come to me for my assistance, and you shall have it.  Come at\nonce to me.\n\nLADY CHILTERN.  [_Looking at him in surprise_.]  Lord Goring, you are\ntalking quite seriously.  I don't think I ever heard you talk seriously\nbefore.\n\nLORD GORING.  [_Laughing_.]  You must excuse me, Lady Chiltern.  It won't\noccur again, if I can help it.\n\nLADY CHILTERN.  But I like you to be serious.\n\n[_Enter_ MABEL CHILTERN, _in the most ravishing frock_.]\n\nMABEL CHILTERN.  Dear Gertrude, don't say such a dreadful thing to Lord\nGoring.  Seriousness would be very unbecoming to him.  Good afternoon\nLord Goring!  Pray be as trivial as you can.\n\nLORD GORING.  I should like to, Miss Mabel, but I am afraid I am . . . a\nlittle out of practice this morning; and besides, I have to be going now.\n\nMABEL CHILTERN.  Just when I have come in!  What dreadful manners you\nhave!  I am sure you were very badly brought up.\n\nLORD GORING.  I was.\n\nMABEL CHILTERN.  I wish I had brought you up!\n\nLORD GORING.  I am so sorry you didn't.\n\nMABEL CHILTERN.  It is too late now, I suppose?\n\nLORD GORING.  [_Smiling_.]  I am not so sure.\n\nMABEL CHILTERN.  Will you ride to-morrow morning?\n\nLORD GORING.  Yes, at ten.\n\nMABEL CHILTERN.  Don't forget.\n\nLORD GORING.  Of course I shan't.  By the way, Lady Chiltern, there is no\nlist of your guests in _The Morning Post_ of to-day.  It has apparently\nbeen crowded out by the County Council, or the Lambeth Conference, or\nsomething equally boring.  Could you let me have a list?  I have a\nparticular reason for asking you.\n\nLADY CHILTERN.  I am sure Mr. Trafford will be able to give you one.\n\nLORD GORING.  Thanks, so much.\n\nMABEL CHILTERN.  Tommy is the most useful person in London.\n\nLORD GORING [_Turning to her_.]  And who is the most ornamental?\n\nMABEL CHILTERN [_Triumphantly_.]  I am.\n\nLORD GORING.  How clever of you to guess it!  [_Takes up his hat and\ncane_.]  Good-bye, Lady Chiltern!  You will remember what I said to you,\nwon't you?\n\nLADY CHILTERN.  Yes; but I don't know why you said it to me.\n\nLORD GORING.  I hardly know myself.  Good-bye, Miss Mabel!\n\nMABEL CHILTERN [_With a little moue of disappointment_.]  I wish you were\nnot going.  I have had four wonderful adventures this morning; four and a\nhalf, in fact.  You might stop and listen to some of them.\n\nLORD GORING.  How very selfish of you to have four and a half!  There\nwon't be any left for me.\n\nMABEL CHILTERN.  I don't want you to have any.  They would not be good\nfor you.\n\nLORD GORING.  That is the first unkind thing you have ever said to me.\nHow charmingly you said it!  Ten to-morrow.\n\nMABEL CHILTERN.  Sharp.\n\nLORD GORING.  Quite sharp.  But don't bring Mr. Trafford.\n\nMABEL CHILTERN.  [_With a little toss of the head_.]  Of course I shan't\nbring Tommy Trafford.  Tommy Trafford is in great disgrace.\n\nLORD GORING.  I am delighted to hear it.  [_Bows and goes out_.]\n\nMABEL CHILTERN.  Gertrude, I wish you would speak to Tommy Trafford.\n\nLADY CHILTERN.  What has poor Mr. Trafford done this time?  Robert says\nhe is the best secretary he has ever had.\n\nMABEL CHILTERN.  Well, Tommy has proposed to me again.  Tommy really does\nnothing but propose to me.  He proposed to me last night in the\nmusic-room, when I was quite unprotected, as there was an elaborate trio\ngoing on.  I didn't dare to make the smallest repartee, I need hardly\ntell you.  If I had, it would have stopped the music at once.  Musical\npeople are so absurdly unreasonable.  They always want one to be\nperfectly dumb at the very moment when one is longing to be absolutely\ndeaf.  Then he proposed to me in broad daylight this morning, in front of\nthat dreadful statue of Achilles.  Really, the things that go on in front\nof that work of art are quite appalling.  The police should interfere.\nAt luncheon I saw by the glare in his eye that he was going to propose\nagain, and I just managed to check him in time by assuring him that I was\na bimetallist.  Fortunately I don't know what bimetallism means.  And I\ndon't believe anybody else does either.  But the observation crushed\nTommy for ten minutes.  He looked quite shocked.  And then Tommy is so\nannoying in the way he proposes.  If he proposed at the top of his voice,\nI should not mind so much.  That might produce some effect on the public.\nBut he does it in a horrid confidential way.  When Tommy wants to be\nromantic he talks to one just like a doctor.  I am very fond of Tommy,\nbut his methods of proposing are quite out of date.  I wish, Gertrude,\nyou would speak to him, and tell him that once a week is quite often\nenough to propose to any one, and that it should always be done in a\nmanner that attracts some attention.\n\nLADY CHILTERN.  Dear Mabel, don't talk like that.  Besides, Robert thinks\nvery highly of Mr. Trafford.  He believes he has a brilliant future\nbefore him.\n\nMABEL CHILTERN.  Oh! I wouldn't marry a man with a future before him for\nanything under the sun.\n\nLADY CHILTERN.  Mabel!\n\nMABEL CHILTERN.  I know, dear.  You married a man with a future, didn't\nyou?  But then Robert was a genius, and you have a noble,\nself-sacrificing character.  You can stand geniuses.  I have no character\nat all, and Robert is the only genius I could ever bear.  As a rule, I\nthink they are quite impossible.  Geniuses talk so much, don't they?\nSuch a bad habit!  And they are always thinking about themselves, when I\nwant them to be thinking about me.  I must go round now and rehearse at\nLady Basildon's.  You remember, we are having tableaux, don't you?  The\nTriumph of something, I don't know what!  I hope it will be triumph of\nme.  Only triumph I am really interested in at present.  [_Kisses_ LADY\nCHILTERN _and goes out_; _then comes running back_.]  Oh, Gertrude, do\nyou know who is coming to see you?  That dreadful Mrs. Cheveley, in a\nmost lovely gown.  Did you ask her?\n\nLADY CHILTERN.  [_Rising_.]  Mrs. Cheveley!  Coming to see me?\nImpossible!\n\nMABEL CHILTERN.  I assure you she is coming upstairs, as large as life\nand not nearly so natural.\n\nLADY CHILTERN.  You need not wait, Mabel.  Remember, Lady Basildon is\nexpecting you.\n\nMABEL CHILTERN.  Oh! I must shake hands with Lady Markby.  She is\ndelightful.  I love being scolded by her.\n\n[_Enter_ MASON.]\n\nMASON.  Lady Markby.  Mrs. Cheveley.\n\n[_Enter_ LADY MARKBY _and_ MRS. CHEVELEY.]\n\nLADY CHILTERN.  [_Advancing to meet them_.]  Dear Lady Markby, how nice\nof you to come and see me!  [_Shakes hands with her_, _and bows somewhat\ndistantly to_ MRS. CHEVELEY.]  Won't you sit down, Mrs. Cheveley?\n\nMRS. CHEVELEY.  Thanks.  Isn't that Miss Chiltern?  I should like so much\nto know her.\n\nLADY CHILTERN.  Mabel, Mrs. Cheveley wishes to know you.\n\n[MABEL CHILTERN _gives a little nod_.]\n\nMRS. CHEVELEY [_Sitting down_.]  I thought your frock so charming last\nnight, Miss Chiltern.  So simple and . . . suitable.\n\nMABEL CHILTERN.  Really?  I must tell my dressmaker.  It will be such a\nsurprise to her.  Good-bye, Lady Markby!\n\nLADY MARKBY.  Going already?\n\nMABEL CHILTERN.  I am so sorry but I am obliged to.  I am just off to\nrehearsal.  I have got to stand on my head in some tableaux.\n\nLADY MARKBY.  On your head, child?  Oh! I hope not.  I believe it is most\nunhealthy.  [_Takes a seat on the sofa next_ LADY CHILTERN.]\n\nMABEL CHILTERN.  But it is for an excellent charity: in aid of the\nUndeserving, the only people I am really interested in.  I am the\nsecretary, and Tommy Trafford is treasurer.\n\nMRS. CHEVELEY.  And what is Lord Goring?\n\nMABEL CHILTERN.  Oh! Lord Goring is president.\n\nMRS. CHEVELEY.  The post should suit him admirably, unless he has\ndeteriorated since I knew him first.\n\nLADY MARKBY.  [_Reflecting_.]  You are remarkably modern, Mabel.  A\nlittle too modern, perhaps.  Nothing is so dangerous as being too modern.\nOne is apt to grow old-fashioned quite suddenly.  I have known many\ninstances of it.\n\nMABEL CHILTERN.  What a dreadful prospect!\n\nLADY MARKBY.  Ah! my dear, you need not be nervous.  You will always be\nas pretty as possible.  That is the best fashion there is, and the only\nfashion that England succeeds in setting.\n\nMABEL CHILTERN.  [_With a curtsey_.]  Thank you so much, Lady Markby, for\nEngland . . . and myself.  [_Goes out_.]\n\nLADY MARKBY.  [_Turning to_ LADY CHILTERN.]  Dear Gertrude, we just\ncalled to know if Mrs. Cheveley's diamond brooch has been found.\n\nLADY CHILTERN.  Here?\n\nMRS. CHEVELEY.  Yes.  I missed it when I got back to Claridge's, and I\nthought I might possibly have dropped it here.\n\nLADY CHILTERN.  I have heard nothing about it.  But I will send for the\nbutler and ask.  [_Touches the bell_.]\n\nMRS. CHEVELEY.  Oh, pray don't trouble, Lady Chiltern.  I dare say I lost\nit at the Opera, before we came on here.\n\nLADY MARKBY.  Ah yes, I suppose it must have been at the Opera.  The fact\nis, we all scramble and jostle so much nowadays that I wonder we have\nanything at all left on us at the end of an evening.  I know myself that,\nwhen I am coming back from the Drawing Room, I always feel as if I hadn't\na shred on me, except a small shred of decent reputation, just enough to\nprevent the lower classes making painful observations through the windows\nof the carriage.  The fact is that our Society is terribly\nover-populated.  Really, some one should arrange a proper scheme of\nassisted emigration.  It would do a great deal of good.\n\nMRS. CHEVELEY.  I quite agree with you, Lady Markby.  It is nearly six\nyears since I have been in London for the Season, and I must say Society\nhas become dreadfully mixed.  One sees the oddest people everywhere.\n\nLADY MARKBY.  That is quite true, dear.  But one needn't know them.  I'm\nsure I don't know half the people who come to my house.  Indeed, from all\nI hear, I shouldn't like to.\n\n[_Enter_ MASON.]\n\nLADY CHILTERN.  What sort of a brooch was it that you lost, Mrs.\nCheveley?\n\nMRS. CHEVELEY.  A diamond snake-brooch with a ruby, a rather large ruby.\n\nLADY MARKBY.  I thought you said there was a sapphire on the head, dear?\n\nMRS. CHEVELEY [_Smiling_.]  No, lady Markby--a ruby.\n\nLADY MARKBY.  [_Nodding her head_.]  And very becoming, I am quite sure.\n\nLADY CHILTERN.  Has a ruby and diamond brooch been found in any of the\nrooms this morning, Mason?\n\nMASON.  No, my lady.\n\nMRS. CHEVELEY.  It really is of no consequence, Lady Chiltern.  I am so\nsorry to have put you to any inconvenience.\n\nLADY CHILTERN.  [_Coldly_.]  Oh, it has been no inconvenience.  That will\ndo, Mason.  You can bring tea.\n\n[_Exit_ MASON.]\n\nLADY MARKBY.  Well, I must say it is most annoying to lose anything.  I\nremember once at Bath, years ago, losing in the Pump Room an exceedingly\nhandsome cameo bracelet that Sir John had given me.  I don't think he has\never given me anything since, I am sorry to say.  He has sadly\ndegenerated.  Really, this horrid House of Commons quite ruins our\nhusbands for us.  I think the Lower House by far the greatest blow to a\nhappy married life that there has been since that terrible thing called\nthe Higher Education of Women was invented.\n\nLADY CHILTERN.  Ah! it is heresy to say that in this house, Lady Markby.\nRobert is a great champion of the Higher Education of Women, and so, I am\nafraid, am I.\n\nMRS. CHEVELEY.  The higher education of men is what I should like to see.\nMen need it so sadly.\n\nLADY MARKBY.  They do, dear.  But I am afraid such a scheme would be\nquite unpractical.  I don't think man has much capacity for development.\nHe has got as far as he can, and that is not far, is it?  With regard to\nwomen, well, dear Gertrude, you belong to the younger generation, and I\nam sure it is all right if you approve of it.  In my time, of course, we\nwere taught not to understand anything.  That was the old system, and\nwonderfully interesting it was.  I assure you that the amount of things I\nand my poor dear sister were taught not to understand was quite\nextraordinary.  But modern women understand everything, I am told.\n\nMRS. CHEVELEY.  Except their husbands.  That is the one thing the modern\nwoman never understands.\n\nLADY MARKBY.  And a very good thing too, dear, I dare say.  It might\nbreak up many a happy home if they did.  Not yours, I need hardly say,\nGertrude.  You have married a pattern husband.  I wish I could say as\nmuch for myself.  But since Sir John has taken to attending the debates\nregularly, which he never used to do in the good old days, his language\nhas become quite impossible.  He always seems to think that he is\naddressing the House, and consequently whenever he discusses the state of\nthe agricultural labourer, or the Welsh Church, or something quite\nimproper of that kind, I am obliged to send all the servants out of the\nroom.  It is not pleasant to see one's own butler, who has been with one\nfor twenty-three years, actually blushing at the side-board, and the\nfootmen making contortions in corners like persons in circuses.  I assure\nyou my life will be quite ruined unless they send John at once to the\nUpper House.  He won't take any interest in politics then, will he?  The\nHouse of Lords is so sensible.  An assembly of gentlemen.  But in his\npresent state, Sir John is really a great trial.  Why, this morning\nbefore breakfast was half over, he stood up on the hearthrug, put his\nhands in his pockets, and appealed to the country at the top of his\nvoice.  I left the table as soon as I had my second cup of tea, I need\nhardly say.  But his violent language could be heard all over the house!\nI trust, Gertrude, that Sir Robert is not like that?\n\nLADY CHILTERN.  But I am very much interested in politics, Lady Markby.\nI love to hear Robert talk about them.\n\nLADY MARKBY.  Well, I hope he is not as devoted to Blue Books as Sir John\nis.  I don't think they can be quite improving reading for any one.\n\nMRS. CHEVELEY [_Languidly_.]  I have never read a Blue Book.  I prefer\nbooks . . . in yellow covers.\n\nLADY MARKBY.  [_Genially unconscious_.]  Yellow is a gayer colour, is it\nnot?  I used to wear yellow a good deal in my early days, and would do so\nnow if Sir John was not so painfully personal in his observations, and a\nman on the question of dress is always ridiculous, is he not?\n\nMRS. CHEVELEY.  Oh, no!  I think men are the only authorities on dress.\n\nLADY MARKBY.  Really?  One wouldn't say so from the sort of hats they\nwear? would one?\n\n[_The butler enters_, _followed by the footman_.  _Tea is set on a small\ntable close to_ LADY CHILTERN.]\n\nLADY CHILTERN.  May I give you some tea, Mrs. Cheveley?\n\nMRS. CHEVELEY.  Thanks.  [_The butler hands_ MRS. CHEVELEY _a cup of tea\non a salver_.]\n\nLADY CHILTERN.  Some tea, Lady Markby?\n\nLADY MARKBY.  No thanks, dear.  [_The servants go out_.]  The fact is, I\nhave promised to go round for ten minutes to see poor Lady Brancaster,\nwho is in very great trouble.  Her daughter, quite a well-brought-up\ngirl, too, has actually become engaged to be married to a curate in\nShropshire.  It is very sad, very sad indeed.  I can't understand this\nmodern mania for curates.  In my time we girls saw them, of course,\nrunning about the place like rabbits.  But we never took any notice of\nthem, I need hardly say.  But I am told that nowadays country society is\nquite honeycombed with them.  I think it most irreligious.  And then the\neldest son has quarrelled with his father, and it is said that when they\nmeet at the club Lord Brancaster always hides himself behind the money\narticle in _The Times_.  However, I believe that is quite a common\noccurrence nowadays and that they have to take in extra copies of _The\nTimes_ at all the clubs in St. James's Street; there are so many sons who\nwon't have anything to do with their fathers, and so many fathers who\nwon't speak to their sons.  I think myself, it is very much to be\nregretted.\n\nMRS. CHEVELEY.  So do I.  Fathers have so much to learn from their sons\nnowadays.\n\nLADY MARKBY.  Really, dear?  What?\n\nMRS. CHEVELEY.  The art of living.  The only really Fine Art we have\nproduced in modern times.\n\nLADY MARKBY.  [_Shaking her head_.]  Ah!  I am afraid Lord Brancaster\nknew a good deal about that.  More than his poor wife ever did.\n[_Turning to_ LADY CHILTERN.]  You know Lady Brancaster, don't you, dear?\n\nLADY CHILTERN.  Just slightly.  She was staying at Langton last autumn,\nwhen we were there.\n\nLADY MARKBY.  Well, like all stout women, she looks the very picture of\nhappiness, as no doubt you noticed.  But there are many tragedies in her\nfamily, besides this affair of the curate.  Her own sister, Mrs. Jekyll,\nhad a most unhappy life; through no fault of her own, I am sorry to say.\nShe ultimately was so broken-hearted that she went into a convent, or on\nto the operatic stage, I forget which.  No; I think it was decorative\nart-needlework she took up.  I know she had lost all sense of pleasure in\nlife.  [_Rising_.]  And now, Gertrude, if you will allow me, I shall\nleave Mrs. Cheveley in your charge and call back for her in a quarter of\nan hour.  Or perhaps, dear Mrs. Cheveley, you wouldn't mind waiting in\nthe carriage while I am with Lady Brancaster.  As I intend it to be a\nvisit of condolence, I shan't stay long.\n\nMRS. CHEVELEY [_Rising_.]  I don't mind waiting in the carriage at all,\nprovided there is somebody to look at one.\n\nLADY MARKBY.  Well, I hear the curate is always prowling about the house.\n\nMRS. CHEVELEY.  I am afraid I am not fond of girl friends.\n\nLADY CHILTERN [_Rising_.]  Oh, I hope Mrs. Cheveley will stay here a\nlittle.  I should like to have a few minutes' conversation with her.\n\nMRS. CHEVELEY.  How very kind of you, Lady Chiltern!  Believe me, nothing\nwould give me greater pleasure.\n\nLADY MARKBY.  Ah! no doubt you both have many pleasant reminiscences of\nyour schooldays to talk over together.  Good-bye, dear Gertrude!  Shall I\nsee you at Lady Bonar's to-night?  She has discovered a wonderful new\ngenius.  He does . . . nothing at all, I believe.  That is a great\ncomfort, is it not?\n\nLADY CHILTERN.  Robert and I are dining at home by ourselves to-night,\nand I don't think I shall go anywhere afterwards.  Robert, of course,\nwill have to be in the House.  But there is nothing interesting on.\n\nLADY MARKBY.  Dining at home by yourselves?  Is that quite prudent?  Ah,\nI forgot, your husband is an exception.  Mine is the general rule, and\nnothing ages a woman so rapidly as having married the general rule.\n[_Exit_ LADY MARKBY.]\n\nMRS. CHEVELEY.  Wonderful woman, Lady Markby, isn't she?  Talks more and\nsays less than anybody I ever met.  She is made to be a public speaker.\nMuch more so than her husband, though he is a typical Englishman, always\ndull and usually violent.\n\nLADY CHILTERN.  [_Makes no answer_, _but remains standing_.  _There is a\npause_.  _Then the eyes of the two women meet_.  LADY CHILTERN _looks\nstern and pale_.  MRS. CHEVELEY _seem rather amused_.]  Mrs. Cheveley, I\nthink it is right to tell you quite frankly that, had I known who you\nreally were, I should not have invited you to my house last night.\n\nMRS. CHEVELEY [_With an impertinent smile_.]  Really?\n\nLADY CHILTERN.  I could not have done so.\n\nMRS. CHEVELEY.  I see that after all these years you have not changed a\nbit, Gertrude.\n\nLADY CHILTERN.  I never change.\n\nMRS. CHEVELEY [_Elevating her eyebrows_.]  Then life has taught you\nnothing?\n\nLADY CHILTERN.  It has taught me that a person who has once been guilty\nof a dishonest and dishonourable action may be guilty of it a second\ntime, and should be shunned.\n\nMRS. CHEVELEY.  Would you apply that rule to every one?\n\nLADY CHILTERN.  Yes, to every one, without exception.\n\nMRS. CHEVELEY.  Then I am sorry for you, Gertrude, very sorry for you.\n\nLADY CHILTERN.  You see now, I was sure, that for many reasons any\nfurther acquaintance between us during your stay in London is quite\nimpossible?\n\nMRS. CHEVELEY [_Leaning back in her chair_.]  Do you know, Gertrude, I\ndon't mind your talking morality a bit.  Morality is simply the attitude\nwe adopt towards people whom we personally dislike.  You dislike me.  I\nam quite aware of that.  And I have always detested you.  And yet I have\ncome here to do you a service.\n\nLADY CHILTERN.  [_Contemptuously_.]  Like the service you wished to\nrender my husband last night, I suppose.  Thank heaven, I saved him from\nthat.\n\nMRS. CHEVELEY.  [_Starting to her feet_.]  It was you who made him write\nthat insolent letter to me?  It was you who made him break his promise?\n\nLADY CHILTERN.  Yes.\n\nMRS. CHEVELEY.  Then you must make him keep it.  I give you till\nto-morrow morning--no more.  If by that time your husband does not\nsolemnly bind himself to help me in this great scheme in which I am\ninterested--\n\nLADY CHILTERN.  This fraudulent speculation--\n\nMRS. CHEVELEY.  Call it what you choose.  I hold your husband in the\nhollow of my hand, and if you are wise you will make him do what I tell\nhim.\n\nLADY CHILTERN.  [_Rising and going towards her_.]  You are impertinent.\nWhat has my husband to do with you?  With a woman like you?\n\nMRS. CHEVELEY [_With a bitter laugh_.]  In this world like meets with\nlike.  It is because your husband is himself fraudulent and dishonest\nthat we pair so well together.  Between you and him there are chasms.  He\nand I are closer than friends.  We are enemies linked together.  The same\nsin binds us.\n\nLADY CHILTERN.  How dare you class my husband with yourself?  How dare\nyou threaten him or me?  Leave my house.  You are unfit to enter it.\n\n[SIR ROBERT CHILTERN _enters from behind_.  _He hears his wife's last\nwords_, _and sees to whom they are addressed_.  _He grows deadly pale_.]\n\nMRS. CHEVELEY.  Your house!  A house bought with the price of dishonour.\nA house, everything in which has been paid for by fraud.  [_Turns round\nand sees_ SIR ROBERT CHILTERN.]  Ask him what the origin of his fortune\nis!  Get him to tell you how he sold to a stockbroker a Cabinet secret.\nLearn from him to what you owe your position.\n\nLADY CHILTERN.  It is not true!  Robert!  It is not true!\n\nMRS. CHEVELEY.  [_Pointing at him with outstretched finger_.]  Look at\nhim!  Can he deny it?  Does he dare to?\n\nSIR ROBERT CHILTERN.  Go!  Go at once.  You have done your worst now.\n\nMRS. CHEVELEY.  My worst?  I have not yet finished with you, with either\nof you.  I give you both till to-morrow at noon.  If by then you don't do\nwhat I bid you to do, the whole world shall know the origin of Robert\nChiltern.\n\n[SIR ROBERT CHILTERN _strikes the bell_.  _Enter_ MASON.]\n\nSIR ROBERT CHILTERN.  Show Mrs. Cheveley out.\n\n[MRS. CHEVELEY _starts_; _then bows with somewhat exaggerated politeness\nto_ LADY CHILTERN, _who makes no sign of response_.  _As she passes by_\nSIR ROBERT CHILTERN, _who is standing close to the door_, _she pauses for\na moment and looks him straight in the face_.  _She then goes out_,\n_followed by the servant_, _who closes the door after him_.  _The husband\nand wife are left alone_.  LADY CHILTERN _stands like some one in a\ndreadful dream_.  _Then she turns round and looks at her husband_.  _She\nlooks at him with strange eyes_, _as though she were seeing him for the\nfirst time_.]\n\nLADY CHILTERN.  You sold a Cabinet secret for money!  You began your life\nwith fraud!  You built up your career on dishonour!  Oh, tell me it is\nnot true!  Lie to me!  Lie to me!  Tell me it is not true!\n\nSIR ROBERT CHILTERN.  What this woman said is quite true.  But, Gertrude,\nlisten to me.  You don't realise how I was tempted.  Let me tell you the\nwhole thing. [_Goes towards her_.]\n\nLADY CHILTERN.  Don't come near me.  Don't touch me.  I feel as if you\nhad soiled me for ever.  Oh! what a mask you have been wearing all these\nyears!  A horrible painted mask!  You sold yourself for money.  Oh! a\ncommon thief were better.  You put yourself up to sale to the highest\nbidder!  You were bought in the market.  You lied to the whole world.\nAnd yet you will not lie to me.\n\nSIR ROBERT CHILTERN.  [_Rushing towards her_.]  Gertrude!  Gertrude!\n\nLADY CHILTERN.  [_Thrusting him back with outstretched hands_.]  No,\ndon't speak!  Say nothing!  Your voice wakes terrible memories--memories\nof things that made me love you--memories of words that made me love\nyou--memories that now are horrible to me.  And how I worshipped you!\nYou were to me something apart from common life, a thing pure, noble,\nhonest, without stain.  The world seemed to me finer because you were in\nit, and goodness more real because you lived.  And now--oh, when I think\nthat I made of a man like you my ideal! the ideal of my life!\n\nSIR ROBERT CHILTERN.  There was your mistake.  There was your error.  The\nerror all women commit.  Why can't you women love us, faults and all?\nWhy do you place us on monstrous pedestals?  We have all feet of clay,\nwomen as well as men; but when we men love women, we love them knowing\ntheir weaknesses, their follies, their imperfections, love them all the\nmore, it may be, for that reason.  It is not the perfect, but the\nimperfect, who have need of love.  It is when we are wounded by our own\nhands, or by the hands of others, that love should come to cure us--else\nwhat use is love at all?  All sins, except a sin against itself, Love\nshould forgive.  All lives, save loveless lives, true Love should pardon.\nA man's love is like that.  It is wider, larger, more human than a\nwoman's.  Women think that they are making ideals of men.  What they are\nmaking of us are false idols merely.  You made your false idol of me, and\nI had not the courage to come down, show you my wounds, tell you my\nweaknesses.  I was afraid that I might lose your love, as I have lost it\nnow.  And so, last night you ruined my life for me--yes, ruined it!  What\nthis woman asked of me was nothing compared to what she offered to me.\nShe offered security, peace, stability.  The sin of my youth, that I had\nthought was buried, rose up in front of me, hideous, horrible, with its\nhands at my throat.  I could have killed it for ever, sent it back into\nits tomb, destroyed its record, burned the one witness against me.  You\nprevented me.  No one but you, you know it.  And now what is there before\nme but public disgrace, ruin, terrible shame, the mockery of the world, a\nlonely dishonoured life, a lonely dishonoured death, it may be, some day?\nLet women make no more ideals of men! let them not put them on alters and\nbow before them, or they may ruin other lives as completely as you--you\nwhom I have so wildly loved--have ruined mine!\n\n[_He passes from the room_.  LADY CHILTERN _rushes towards him_, _but the\ndoor is closed when she reaches it_.  _Pale with anguish_, _bewildered_,\n_helpless_, _she sways like a plant in the water_.  _Her hands_,\n_outstretched_, _seem to tremble in the air like blossoms in the mind_.\n_Then she flings herself down beside a sofa and buries her face_.  _Her\nsobs are like the sobs of a child_.]\n\n                                 ACT DROP\n\n\n\n\nTHIRD ACT\n\n\nSCENE\n\n\n_The Library in Lord Goring's house_.  _An Adam room_.  _On the right is\nthe door leading into the hall_.  _On the left_, _the door of the\nsmoking-room_.  _A pair of folding doors at the back open into the\ndrawing-room_.  _The fire is lit_.  _Phipps_, _the butler_, _is arranging\nsome newspapers on the writing-table_.  _The distinction of Phipps is his\nimpassivity_. _He has been termed by enthusiasts the Ideal Butler_.  _The\nSphinx is not so incommunicable_.  _He is a mask with a manner_.  _Of his\nintellectual or emotional life_, _history knows nothing_.  _He represents\nthe dominance of form_.\n\n[_Enter_ LORD GORING _in evening dress with a buttonhole_.  _He is\nwearing a silk hat and Inverness cape_.  _White-gloved_, _he carries a\nLouis Seize cane_.  _His are all the delicate fopperies of Fashion_.\n_One sees that he stands in immediate relation to modern life_, _makes it\nindeed_, _and so masters it_.  _He is the first well-dressed philosopher\nin the history of thought_.]\n\nLORD GORING.  Got my second buttonhole for me, Phipps?\n\nPHIPPS.  Yes, my lord.  [_Takes his hat_, _cane_, _and cape_, _and\npresents new buttonhole on salver_.]\n\nLORD GORING.  Rather distinguished thing, Phipps.  I am the only person\nof the smallest importance in London at present who wears a buttonhole.\n\nPHIPPS.  Yes, my lord.  I have observed that,\n\nLORD GORING.  [_Taking out old buttonhole_.]  You see, Phipps, Fashion is\nwhat one wears oneself.  What is unfashionable is what other people wear.\n\nPHIPPS.  Yes, my lord.\n\nLORD GORING.  Just as vulgarity is simply the conduct of other people.\n\nPHIPPS.  Yes, my lord.\n\nLORD GORING.  [_Putting in a new buttonhole_.]  And falsehoods the truths\nof other people.\n\nPHIPPS.  Yes, my lord.\n\nLORD GORING.  Other people are quite dreadful.  The only possible society\nis oneself.\n\nPHIPPS.  Yes, my lord.\n\nLORD GORING.  To love oneself is the beginning of a lifelong romance,\nPhipps.\n\nPHIPPS.  Yes, my lord.\n\nLORD GORING.  [_Looking at himself in the glass_.]  Don't think I quite\nlike this buttonhole, Phipps.  Makes me look a little too old.  Makes me\nalmost in the prime of life, eh, Phipps?\n\nPHIPPS.  I don't observe any alteration in your lordship's appearance.\n\nLORD GORING.  You don't, Phipps?\n\nPHIPPS.  No, my lord.\n\nLORD GORING.  I am not quite sure.  For the future a more trivial\nbuttonhole, Phipps, on Thursday evenings.\n\nPHIPPS.  I will speak to the florist, my lord.  She has had a loss in her\nfamily lately, which perhaps accounts for the lack of triviality your\nlordship complains of in the buttonhole.\n\nLORD GORING.  Extraordinary thing about the lower classes in\nEngland--they are always losing their relations.\n\nPHIPPS.  Yes, my lord!  They are extremely fortunate in that respect.\n\nLORD GORING.  [_Turns round and looks at him_.  PHIPPS _remains\nimpassive_.]  Hum!  Any letters, Phipps?\n\nPHIPPS.  Three, my lord.  [_Hands letters on a salver_.]\n\nLORD GORING.  [_Takes letters_.]  Want my cab round in twenty minutes.\n\nPHIPPS.  Yes, my lord.  [_Goes towards door_.]\n\nLORD GORING.  [_Holds up letter in pink envelope_.]  Ahem!  Phipps, when\ndid this letter arrive?\n\nPHIPPS.  It was brought by hand just after your lordship went to the\nclub.\n\nLORD GORING.  That will do.  [_Exit_ PHIPPS.]  Lady Chiltern's\nhandwriting on Lady Chiltern's pink notepaper.  That is rather curious.\nI thought Robert was to write.  Wonder what Lady Chiltern has got to say\nto me?  [_Sits at bureau and opens letter_, _and reads it_.]  'I want\nyou.  I trust you.  I am coming to you.  Gertrude.'  [_Puts down the\nletter with a puzzled look_.  _Then takes it up_, _and reads it again\nslowly_.]  'I want you.  I trust you.  I am coming to you.'  So she has\nfound out everything!  Poor woman!  Poor woman!  [ _Pulls out watch and\nlooks at it_.]  But what an hour to call!  Ten o'clock!  I shall have to\ngive up going to the Berkshires.  However, it is always nice to be\nexpected, and not to arrive.  I am not expected at the Bachelors', so I\nshall certainly go there.  Well, I will make her stand by her husband.\nThat is the only thing for her to do.  That is the only thing for any\nwoman to do.  It is the growth of the moral sense in women that makes\nmarriage such a hopeless, one-sided institution.  Ten o'clock.  She\nshould be here soon.  I must tell Phipps I am not in to any one else.\n[_Goes towards bell_]\n\n[_Enter_ PHIPPS.]\n\nPHIPPS.  Lord Caversham.\n\nLORD GORING.  Oh, why will parents always appear at the wrong time?  Some\nextraordinary mistake in nature, I suppose.  [_Enter_ LORD CAVERSHAM.]\nDelighted to see you, my dear father.  [_Goes to meet him_.]\n\nLORD CAVERSHAM.  Take my cloak off.\n\nLORD GORING.  Is it worth while, father?\n\nLORD CAVERSHAM.  Of course it is worth while, sir.  Which is the most\ncomfortable chair?\n\nLORD GORING.  This one, father.  It is the chair I use myself, when I\nhave visitors.\n\nLORD CAVERSHAM.  Thank ye.  No draught, I hope, in this room?\n\nLORD GORING.  No, father.\n\nLORD CAVERSHAM.  [_Sitting down_.]  Glad to hear it.  Can't stand\ndraughts.  No draughts at home.\n\nLORD GORING.  Good many breezes, father.\n\nLORD CAVERSHAM.  Eh?  Eh?  Don't understand what you mean.  Want to have\na serious conversation with you, sir.\n\nLORD GORING.  My dear father!  At this hour?\n\nLORD CAVERSHAM.  Well, sir, it is only ten o'clock.  What is your\nobjection to the hour?  I think the hour is an admirable hour!\n\nLORD GORING.  Well, the fact is, father, this is not my day for talking\nseriously.  I am very sorry, but it is not my day.\n\nLORD CAVERSHAM.  What do you mean, sir?\n\nLORD GORING.  During the Season, father, I only talk seriously on the\nfirst Tuesday in every month, from four to seven.\n\nLORD CAVERSHAM.  Well, make it Tuesday, sir, make it Tuesday.\n\nLORD GORING.  But it is after seven, father, and my doctor says I must\nnot have any serious conversation after seven.  It makes me talk in my\nsleep.\n\nLORD CAVERSHAM.  Talk in your sleep, sir?  What does that matter?  You\nare not married.\n\nLORD GORING.  No, father, I am not married.\n\nLORD CAVERSHAM.  Hum!  That is what I have come to talk to you about,\nsir.  You have got to get married, and at once.  Why, when I was your\nage, sir, I had been an inconsolable widower for three months, and was\nalready paying my addresses to your admirable mother.  Damme, sir, it is\nyour duty to get married.  You can't be always living for pleasure.\nEvery man of position is married nowadays.  Bachelors are not fashionable\nany more.  They are a damaged lot.  Too much is known about them.  You\nmust get a wife, sir.  Look where your friend Robert Chiltern has got to\nby probity, hard work, and a sensible marriage with a good woman.  Why\ndon't you imitate him, sir?  Why don't you take him for your model?\n\nLORD GORING.  I think I shall, father.\n\nLORD CAVERSHAM.  I wish you would, sir.  Then I should be happy.  At\npresent I make your mother's life miserable on your account.  You are\nheartless, sir, quite heartless.\n\nLORD GORING.  I hope not, father.\n\nLORD CAVERSHAM.  And it is high time for you to get married.  You are\nthirty-four years of age, sir.\n\nLORD GORING.  Yes, father, but I only admit to thirty-two--thirty-one and\na half when I have a really good buttonhole.  This buttonhole is not . . .\ntrivial enough.\n\nLORD CAVERSHAM.  I tell you you are thirty-four, sir.  And there is a\ndraught in your room, besides, which makes your conduct worse.  Why did\nyou tell me there was no draught, sir?  I feel a draught, sir, I feel it\ndistinctly.\n\nLORD GORING.  So do I, father.  It is a dreadful draught.  I will come\nand see you to-morrow, father.  We can talk over anything you like.  Let\nme help you on with your cloak, father.\n\nLORD CAVERSHAM.  No, sir; I have called this evening for a definite\npurpose, and I am going to see it through at all costs to my health or\nyours.  Put down my cloak, sir.\n\nLORD GORING.  Certainly, father.  But let us go into another room.\n[_Rings bell_.]  There is a dreadful draught here.  [_Enter_ PHIPPS.]\nPhipps, is there a good fire in the smoking-room?\n\nPHIPPS.  Yes, my lord.\n\nLORD GORING.  Come in there, father.  Your sneezes are quite\nheartrending.\n\nLORD CAVERSHAM.  Well, sir, I suppose I have a right to sneeze when I\nchoose?\n\nLORD GORING.  [_Apologetically_.]  Quite so, father.  I was merely\nexpressing sympathy.\n\nLORD CAVERSHAM.  Oh, damn sympathy.  There is a great deal too much of\nthat sort of thing going on nowadays.\n\nLORD GORING.  I quite agree with you, father.  If there was less sympathy\nin the world there would be less trouble in the world.\n\nLORD CAVERSHAM.  [_Going towards the smoking-room_.]  That is a paradox,\nsir.  I hate paradoxes.\n\nLORD GORING.  So do I, father.  Everybody one meets is a paradox\nnowadays.  It is a great bore.  It makes society so obvious.\n\nLORD CAVERSHAM.  [_Turning round_, _and looking at his son beneath his\nbushy eyebrows_.]  Do you always really understand what you say, sir?\n\nLORD GORING.  [_After some hesitation_.]  Yes, father, if I listen\nattentively.\n\nLORD CAVERSHAM.  [_Indignantly_.]  If you listen attentively! . . .\nConceited young puppy!\n\n[_Goes off grumbling into the smoking-room_.  PHIPPS _enters_.]\n\nLORD GORING.  Phipps, there is a lady coming to see me this evening on\nparticular business.  Show her into the drawing-room when she arrives.\nYou understand?\n\nPHIPPS.  Yes, my lord.\n\nLORD GORING.  It is a matter of the gravest importance, Phipps.\n\nPHIPPS.  I understand, my lord.\n\nLORD GORING.  No one else is to be admitted, under any circumstances.\n\nPHIPPS.  I understand, my lord.  [_Bell rings_.]\n\nLORD GORING.  Ah! that is probably the lady.  I shall see her myself.\n\n[_Just as he is going towards the door_ LORD CAVERSHAM _enters from the\nsmoking-room_.]\n\nLORD CAVERSHAM.  Well, sir? am I to wait attendance on you?\n\nLORD GORING.  [_Considerably perplexed_.]  In a moment, father.  Do\nexcuse me.  [LORD CAVERSHAM _goes back_.]  Well, remember my\ninstructions, Phipps--into that room.\n\nPHIPPS.  Yes, my lord.\n\n[LORD GORING _goes into the smoking-room_.  HAROLD, _the footman shows_\nMRS. CHEVELEY _in_.  _Lamia-like_, _she is in green and silver_.  _She\nhas a cloak of black satin_, _lined with dead rose-leaf silk_.]\n\nHAROLD.  What name, madam?\n\nMRS. CHEVELEY.  [_To_ PHIPPS, _who advances towards her_.]  Is Lord\nGoring not here?  I was told he was at home?\n\nPHIPPS.  His lordship is engaged at present with Lord Caversham, madam.\n\n[_Turns a cold_, _glassy eye on_ HAROLD, _who at once retires_.]\n\nMRS. CHEVELEY.  [_To herself_.]  How very filial!\n\nPHIPPS.  His lordship told me to ask you, madam, to be kind enough to\nwait in the drawing-room for him.  His lordship will come to you there.\n\nMRS. CHEVELEY.  [_With a look of surprise_.]  Lord Goring expects me?\n\nPHIPPS.  Yes, madam.\n\nMRS. CHEVELEY.  Are you quite sure?\n\nPHIPPS.  His lordship told me that if a lady called I was to ask her to\nwait in the drawing-room.  [_Goes to the door of the drawing-room and\nopens it_.]  His lordship's directions on the subject were very precise.\n\nMRS. CHEVELEY.  [_To herself_]  How thoughtful of him!  To expect the\nunexpected shows a thoroughly modern intellect.  [_Goes towards the\ndrawing-room and looks in_.]  Ugh!  How dreary a bachelor's drawing-room\nalways looks.  I shall have to alter all this.  [PHIPPS _brings the lamp\nfrom the writing-table_.]  No, I don't care for that lamp.  It is far too\nglaring.  Light some candles.\n\nPHIPPS.  [_Replaces lamp_.]  Certainly, madam.\n\nMRS. CHEVELEY.  I hope the candles have very becoming shades.\n\nPHIPPS.  We have had no complaints about them, madam, as yet.\n\n[_Passes into the drawing-room and begins to light the candles_.]\n\nMRS. CHEVELEY.  [_To herself_.]  I wonder what woman he is waiting for\nto-night.  It will be delightful to catch him.  Men always look so silly\nwhen they are caught.  And they are always being caught.  [_Looks about\nroom and approaches the writing-table_.]  What a very interesting room!\nWhat a very interesting picture!  Wonder what his correspondence is like.\n[_Takes up letters_.]  Oh, what a very uninteresting correspondence!\nBills and cards, debts and dowagers!  Who on earth writes to him on pink\npaper?  How silly to write on pink paper!  It looks like the beginning of\na middle-class romance.  Romance should never begin with sentiment.  It\nshould begin with science and end with a settlement.  [_Puts letter\ndown_, _then takes it up again_.]  I know that handwriting.  That is\nGertrude Chiltern's.  I remember it perfectly.  The ten commandments in\nevery stroke of the pen, and the moral law all over the page.  Wonder\nwhat Gertrude is writing to him about?  Something horrid about me, I\nsuppose.  How I detest that woman!  [_Reads it_.]  'I trust you.  I want\nyou.  I am coming to you.  Gertrude.'  'I trust you.  I want you.  I am\ncoming to you.'\n\n[_A look of triumph comes over her face_.  _She is just about to steal\nthe letter_, _when_ PHIPPS _comes in_.]\n\nPHIPPS.  The candles in the drawing-room are lit, madam, as you directed.\n\nMRS. CHEVELEY.  Thank you.  [_Rises hastily and slips the letter under a\nlarge silver-cased blotting-book that is lying on the table_.]\n\nPHIPPS.  I trust the shades will be to your liking, madam.  They are the\nmost becoming we have.  They are the same as his lordship uses himself\nwhen he is dressing for dinner.\n\nMRS. CHEVELEY.  [_With a smile_.]  Then I am sure they will be perfectly\nright.\n\nPHIPPS.  [_Gravely_.]  Thank you, madam.\n\n[MRS. CHEVELEY _goes into the drawing-room_.  PHIPPS _closes the door and\nretires_.  _The door is then slowly opened_, _and_ MRS. CHEVELEY _comes\nout and creeps stealthily towards the writing-table_.  _Suddenly voices\nare heard from the smoking-room_.  MRS. CHEVELEY _grows pale_, _and\nstops_.  _The voices grow louder_, _and she goes back into the\ndrawing-room_, _biting her lip_.]\n\n[_Enter_ LORD GORING _and_ LORD CAVERSHAM.]\n\nLORD GORING.  [_Expostulating_.]  My dear father, if I am to get married,\nsurely you will allow me to choose the time, place, and person?\nParticularly the person.\n\nLORD CAVERSHAM.  [_Testily_.]  That is a matter for me, sir.  You would\nprobably make a very poor choice.  It is I who should be consulted, not\nyou.  There is property at stake.  It is not a matter for affection.\nAffection comes later on in married life.\n\nLORD GORING.  Yes.  In married life affection comes when people\nthoroughly dislike each other, father, doesn't it?  [_Puts on_ LORD\nCAVERSHAM'S _cloak for him_.]\n\nLORD CAVERSHAM.  Certainly, sir.  I mean certainly not, air.  You are\ntalking very foolishly to-night.  What I say is that marriage is a matter\nfor common sense.\n\nLORD GORING.  But women who have common sense are so curiously plain,\nfather, aren't they?  Of course I only speak from hearsay.\n\nLORD CAVERSHAM.  No woman, plain or pretty, has any common sense at all,\nsir.  Common sense is the privilege of our sex.\n\nLORD GORING.  Quite so.  And we men are so self-sacrificing that we never\nuse it, do we, father?\n\nLORD CAVERSHAM.  I use it, sir.  I use nothing else.\n\nLORD GORING.  So my mother tells me.\n\nLORD CAVERSHAM.  It is the secret of your mother's happiness.  You are\nvery heartless, sir, very heartless.\n\nLORD GORING.  I hope not, father.\n\n[_Goes out for a moment_.  _Then returns_, _looking rather put out_,\n_with_ SIR ROBERT CHILTERN.]\n\nSIR ROBERT CHILTERN.  My dear Arthur, what a piece of good luck meeting\nyou on the doorstep!  Your servant had just told me you were not at home.\nHow extraordinary!\n\nLORD GORING.  The fact is, I am horribly busy to-night, Robert, and I\ngave orders I was not at home to any one.  Even my father had a\ncomparatively cold reception.  He complained of a draught the whole time.\n\nSIR ROBERT CHILTERN.  Ah! you must be at home to me, Arthur.  You are my\nbest friend.  Perhaps by to-morrow you will be my only friend.  My wife\nhas discovered everything.\n\nLORD GORING.  Ah! I guessed as much!\n\nSIR ROBERT CHILTERN.  [_Looking at him_.]  Really!  How?\n\nLORD GORING.  [_After some hesitation_.]  Oh, merely by something in the\nexpression of your face as you came in.  Who told her?\n\nSIR ROBERT CHILTERN.  Mrs. Cheveley herself.  And the woman I love knows\nthat I began my career with an act of low dishonesty, that I built up my\nlife upon sands of shame--that I sold, like a common huckster, the secret\nthat had been intrusted to me as a man of honour.  I thank heaven poor\nLord Radley died without knowing that I betrayed him.  I would to God I\nhad died before I had been so horribly tempted, or had fallen so low.\n[_Burying his face in his hands_.]\n\nLORD GORING.  [_After a pause_.]  You have heard nothing from Vienna yet,\nin answer to your wire?\n\nSIR ROBERT CHILTERN.  [_Looking up_.]  Yes; I got a telegram from the\nfirst secretary at eight o'clock to-night.\n\nLORD GORING.  Well?\n\nSIR ROBERT CHILTERN.  Nothing is absolutely known against her.  On the\ncontrary, she occupies a rather high position in society.  It is a sort\nof open secret that Baron Arnheim left her the greater portion of his\nimmense fortune.  Beyond that I can learn nothing.\n\nLORD GORING.  She doesn't turn out to be a spy, then?\n\nSIR ROBERT CHILTERN.  Oh! spies are of no use nowadays.  Their profession\nis over.  The newspapers do their work instead.\n\nLORD GORING.  And thunderingly well they do it.\n\nSIR ROBERT CHILTERN.  Arthur, I am parched with thirst.  May I ring for\nsomething?  Some hock and seltzer?\n\nLORD GORING.  Certainly.  Let me.  [_Rings the bell_.]\n\nSIR ROBERT CHILTERN.  Thanks!  I don't know what to do, Arthur, I don't\nknow what to do, and you are my only friend.  But what a friend you\nare--the one friend I can trust.  I can trust you absolutely, can't I?\n\n[_Enter_ PHIPPS.]\n\nLORD GORING.  My dear Robert, of course.  Oh!  [_To_ PHIPPS.]  Bring some\nhock and seltzer.\n\nPHIPPS.  Yes, my lord.\n\nLORD GORING.  And Phipps!\n\nPHIPPS.  Yes, my lord.\n\nLORD GORING.  Will you excuse me for a moment, Robert?  I want to give\nsome directions to my servant.\n\nSIR ROBERT CHILTERN.  Certainly.\n\nLORD GORING.  When that lady calls, tell her that I am not expected home\nthis evening.  Tell her that I have been suddenly called out of town.\nYou understand?\n\nPHIPPS.  The lady is in that room, my lord.  You told me to show her into\nthat room, my lord.\n\nLORD GORING.  You did perfectly right.  [_Exit_ PHIPPS.]  What a mess I\nam in.  No; I think I shall get through it.  I'll give her a lecture\nthrough the door.  Awkward thing to manage, though.\n\nSIR ROBERT CHILTERN.  Arthur, tell me what I should do.  My life seems to\nhave crumbled about me.  I am a ship without a rudder in a night without\na star.\n\nLORD GORING.  Robert, you love your wife, don't you?\n\nSIR ROBERT CHILTERN.  I love her more than anything in the world.  I used\nto think ambition the great thing.  It is not.  Love is the great thing\nin the world.  There is nothing but love, and I love her.  But I am\ndefamed in her eyes.  I am ignoble in her eyes.  There is a wide gulf\nbetween us now.  She has found me out, Arthur, she has found me out.\n\nLORD GORING.  Has she never in her life done some folly--some\nindiscretion--that she should not forgive your sin?\n\nSIR ROBERT CHILTERN.  My wife!  Never!  She does not know what weakness\nor temptation is.  I am of clay like other men.  She stands apart as good\nwomen do--pitiless in her perfection--cold and stern and without mercy.\nBut I love her, Arthur.  We are childless, and I have no one else to\nlove, no one else to love me.  Perhaps if God had sent us children she\nmight have been kinder to me.  But God has given us a lonely house.  And\nshe has cut my heart in two.  Don't let us talk of it.  I was brutal to\nher this evening.  But I suppose when sinners talk to saints they are\nbrutal always.  I said to her things that were hideously true, on my\nside, from my stand-point, from the standpoint of men.  But don't let us\ntalk of that.\n\nLORD GORING.  Your wife will forgive you.  Perhaps at this moment she is\nforgiving you.  She loves you, Robert.  Why should she not forgive?\n\nSIR ROBERT CHILTERN.  God grant it!  God grant it!  [_Buries his face in\nhis hands_.]  But there is something more I have to tell you, Arthur.\n\n[_Enter_ PHIPPS _with drinks_.]\n\nPHIPPS.  [_Hands hock and seltzer to_ SIR ROBERT CHILTERN.]  Hock and\nseltzer, sir.\n\nSIR ROBERT CHILTERN.  Thank you.\n\nLORD GORING.  Is your carriage here, Robert?\n\nSIR ROBERT CHILTERN.  No; I walked from the club.\n\nLORD GORING.  Sir Robert will take my cab, Phipps.\n\nPHIPPS.  Yes, my lord.  [_Exit_.]\n\nLORD GORING.  Robert, you don't mind my sending you away?\n\nSIR ROBERT CHILTERN.  Arthur, you must let me stay for five minutes.  I\nhave made up my mind what I am going to do to-night in the House.  The\ndebate on the Argentine Canal is to begin at eleven.  [_A chair falls in\nthe drawing-room_.]  What is that?\n\nLORD GORING.  Nothing.\n\nSIR ROBERT CHILTERN.  I heard a chair fall in the next room.  Some one\nhas been listening.\n\nLORD GORING.  No, no; there is no one there.\n\nSIR ROBERT CHILTERN.  There is some one.  There are lights in the room,\nand the door is ajar.  Some one has been listening to every secret of my\nlife.  Arthur, what does this mean?\n\nLORD GORING.  Robert, you are excited, unnerved.  I tell you there is no\none in that room. Sit down, Robert.\n\nSIR ROBERT CHILTERN.  Do you give me your word that there is no one\nthere?\n\nLORD GORING.  Yes.\n\nSIR ROBERT CHILTERN.  Your word of honour?  [_Sits down_.]\n\nLORD GORING.  Yes.\n\nSIR ROBERT CHILTERN.  [_Rises_.]  Arthur, let me see for myself.\n\nLORD GORING.  No, no.\n\nSIR ROBERT CHILTERN.  If there is no one there why should I not look in\nthat room?  Arthur, you must let me go into that room and satisfy myself.\nLet me know that no eavesdropper has heard my life's secret.  Arthur, you\ndon't realise what I am going through.\n\nLORD GORING.  Robert, this must stop.  I have told you that there is no\none in that room--that is enough.\n\nSIR ROBERT CHILTERN.  [_Rushes to the door of the room_.]  It is not\nenough.  I insist on going into this room.  You have told me there is no\none there, so what reason can you have for refusing me?\n\nLORD GORING.  For God's sake, don't!  There is some one there.  Some one\nwhom you must not see.\n\nSIR ROBERT CHILTERN.  Ah, I thought so!\n\nLORD GORING.  I forbid you to enter that room.\n\nSIR ROBERT CHILTERN.  Stand back.  My life is at stake.  And I don't care\nwho is there.  I will know who it is to whom I have told my secret and my\nshame.  [_Enters room_.]\n\nLORD GORING.  Great heavens! his own wife!\n\n[SIR ROBERT CHILTERN _comes back_, _with a look of scorn and anger on his\nface_.]\n\nSIR ROBERT CHILTERN.  What explanation have you to give me for the\npresence of that woman here?\n\nLORD GORING.  Robert, I swear to you on my honour that that lady is\nstainless and guiltless of all offence towards you.\n\nSIR ROBERT CHILTERN.  She is a vile, an infamous thing!\n\nLORD GORING.  Don't say that, Robert!  It was for your sake she came\nhere.  It was to try and save you she came here.  She loves you and no\none else.\n\nSIR ROBERT CHILTERN.  You are mad.  What have I to do with her intrigues\nwith you?  Let her remain your mistress!  You are well suited to each\nother.  She, corrupt and shameful--you, false as a friend, treacherous as\nan enemy even--\n\nLORD GORING.  It is not true, Robert.  Before heaven, it is not true.  In\nher presence and in yours I will explain all.\n\nSIR ROBERT CHILTERN.  Let me pass, sir.  You have lied enough upon your\nword of honour.\n\n[SIR ROBERT CHILTERN _goes out_.  LORD GORING _rushes to the door of the\ndrawing-room_, _when_ MRS. CHEVELEY _comes out_, _looking radiant and\nmuch amused_.]\n\nMRS. CHEVELEY.  [_With a mock curtsey_]  Good evening, Lord Goring!\n\nLORD GORING.  Mrs. Cheveley!  Great heavens! . . . May I ask what you\nwere doing in my drawing-room?\n\nMRS. CHEVELEY.  Merely listening.  I have a perfect passion for listening\nthrough keyholes.  One always hears such wonderful things through them.\n\nLORD GORING.  Doesn't that sound rather like tempting Providence?\n\nMRS. CHEVELEY.  Oh! surely Providence can resist temptation by this time.\n[_Makes a sign to him to take her cloak off_, _which he does_.]\n\nLORD GORING.  I am glad you have called.  I am going to give you some\ngood advice.\n\nMRS. CHEVELEY.  Oh! pray don't.  One should never give a woman anything\nthat she can't wear in the evening.\n\nLORD GORING.  I see you are quite as wilful as you used to be.\n\nMRS. CHEVELEY.  Far more!  I have greatly improved.  I have had more\nexperience.\n\nLORD GORING.  Too much experience is a dangerous thing.  Pray have a\ncigarette.  Half the pretty women in London smoke cigarettes.  Personally\nI prefer the other half.\n\nMRS. CHEVELEY.  Thanks.  I never smoke.  My dressmaker wouldn't like it,\nand a woman's first duty in life is to her dressmaker, isn't it?  What\nthe second duty is, no one has as yet discovered.\n\nLORD GORING.  You have come here to sell me Robert Chiltern's letter,\nhaven't you?\n\nMRS. CHEVELEY.  To offer it to you on conditions.  How did you guess\nthat?\n\nLORD GORING.  Because you haven't mentioned the subject.  Have you got it\nwith you?\n\nMRS. CHEVELEY.  [_Sitting down_.]  Oh, no!  A well-made dress has no\npockets.\n\nLORD GORING.  What is your price for it?\n\nMRS. CHEVELEY.  How absurdly English you are!  The English think that a\ncheque-book can solve every problem in life.  Why, my dear Arthur, I have\nvery much more money than you have, and quite as much as Robert Chiltern\nhas got hold of.  Money is not what I want.\n\nLORD GORING.  What do you want then, Mrs. Cheveley?\n\nMRS. CHEVELEY.  Why don't you call me Laura?\n\nLORD GORING.  I don't like the name.\n\nMRS. CHEVELEY.  You used to adore it.\n\nLORD GORING.  Yes: that's why.  [MRS. CHEVELEY _motions to him to sit\ndown beside her_.  _He smiles_, _and does so_.]\n\nMRS. CHEVELEY.  Arthur, you loved me once.\n\nLORD GORING.  Yes.\n\nMRS. CHEVELEY.  And you asked me to be your wife.\n\nLORD GORING.  That was the natural result of my loving you.\n\nMRS. CHEVELEY.  And you threw me over because you saw, or said you saw,\npoor old Lord Mortlake trying to have a violent flirtation with me in the\nconservatory at Tenby.\n\nLORD GORING.  I am under the impression that my lawyer settled that\nmatter with you on certain terms . . . dictated by yourself.\n\nMRS. CHEVELEY.  At that time I was poor; you were rich.\n\nLORD GORING.  Quite so.  That is why you pretended to love me.\n\nMRS. CHEVELEY.  [_Shrugging her shoulders_.]  Poor old Lord Mortlake, who\nhad only two topics of conversation, his gout and his wife!  I never\ncould quite make out which of the two he was talking about.  He used the\nmost horrible language about them both.  Well, you were silly, Arthur.\nWhy, Lord Mortlake was never anything more to me than an amusement.  One\nof those utterly tedious amusements one only finds at an English country\nhouse on an English country Sunday.  I don't think any one at all morally\nresponsible for what he or she does at an English country house.\n\nLORD GORING.  Yes.  I know lots of people think that.\n\nMRS. CHEVELEY.  I loved you, Arthur.\n\nLORD GORING.  My dear Mrs. Cheveley, you have always been far too clever\nto know anything about love.\n\nMRS. CHEVELEY.  I did love you.  And you loved me.  You know you loved\nme; and love is a very wonderful thing.  I suppose that when a man has\nonce loved a woman, he will do anything for her, except continue to love\nher?  [_Puts her hand on his_.]\n\nLORD GORING.  [_Taking his hand away quietly_.]  Yes: except that.\n\nMRS. CHEVELEY.  [_After a pause_.]  I am tired of living abroad.  I want\nto come back to London.  I want to have a charming house here.  I want to\nhave a salon.  If one could only teach the English how to talk, and the\nIrish how to listen, society here would be quite civilised.  Besides, I\nhave arrived at the romantic stage.  When I saw you last night at the\nChilterns', I knew you were the only person I had ever cared for, if I\never have cared for anybody, Arthur.  And so, on the morning of the day\nyou marry me, I will give you Robert Chiltern's letter.  That is my\noffer.  I will give it to you now, if you promise to marry me.\n\nLORD GORING.  Now?\n\nMRS. CHEVELEY.  [_Smiling_.]  To-morrow.\n\nLORD GORING.  Are you really serious?\n\nMRS. CHEVELEY.  Yes, quite serious.\n\nLORD GORING.  I should make you a very bad husband.\n\nMRS. CHEVELEY.  I don't mind bad husbands.  I have had two.  They amused\nme immensely.\n\nLORD GORING.  You mean that you amused yourself immensely, don't you?\n\nMRS. CHEVELEY.  What do you know about my married life?\n\nLORD GORING.  Nothing: but I can read it like a book.\n\nMRS. CHEVELEY.  What book?\n\nLORD GORING.  [_Rising_.]  The Book of Numbers.\n\nMRS. CHEVELEY.  Do you think it is quite charming of you to be so rude to\na woman in your own house?\n\nLORD GORING.  In the case of very fascinating women, sex is a challenge,\nnot a defence.\n\nMRS. CHEVELEY.  I suppose that is meant for a compliment.  My dear\nArthur, women are never disarmed by compliments.  Men always are.  That\nis the difference between the two sexes.\n\nLORD GORING.  Women are never disarmed by anything, as far as I know\nthem.\n\nMRS. CHEVELEY.  [_After a pause_.]  Then you are going to allow your\ngreatest friend, Robert Chiltern, to be ruined, rather than marry some\none who really has considerable attractions left.  I thought you would\nhave risen to some great height of self-sacrifice, Arthur.  I think you\nshould.  And the rest of your life you could spend in contemplating your\nown perfections.\n\nLORD GORING.  Oh! I do that as it is.  And self-sacrifice is a thing that\nshould be put down by law.  It is so demoralising to the people for whom\none sacrifices oneself.  They always go to the bad.\n\nMRS. CHEVELEY.  As if anything could demoralise Robert Chiltern!  You\nseem to forget that I know his real character.\n\nLORD GORING.  What you know about him is not his real character.  It was\nan act of folly done in his youth, dishonourable, I admit, shameful, I\nadmit, unworthy of him, I admit, and therefore . . . not his true\ncharacter.\n\nMRS. CHEVELEY.  How you men stand up for each other!\n\nLORD GORING.  How you women war against each other!\n\nMRS. CHEVELEY.  [_Bitterly_.]  I only war against one woman, against\nGertrude Chiltern.  I hate her.  I hate her now more than ever.\n\nLORD GORING.  Because you have brought a real tragedy into her life, I\nsuppose.\n\nMRS. CHEVELEY.  [_With a sneer_.]  Oh, there is only one real tragedy in\na woman's life.  The fact that her past is always her lover, and her\nfuture invariably her husband.\n\nLORD GORING.  Lady Chiltern knows nothing of the kind of life to which\nyou are alluding.\n\nMRS. CHEVELEY.  A woman whose size in gloves is seven and three-quarters\nnever knows much about anything.  You know Gertrude has always worn seven\nand three-quarters?  That is one of the reasons why there was never any\nmoral sympathy between us. . . . Well, Arthur, I suppose this romantic\ninterview may be regarded as at an end.  You admit it was romantic, don't\nyou?  For the privilege of being your wife I was ready to surrender a\ngreat prize, the climax of my diplomatic career.  You decline.  Very\nwell.  If Sir Robert doesn't uphold my Argentine scheme, I expose him.\nVoila tout.\n\nLORD GORING.  You mustn't do that.  It would be vile, horrible, infamous.\n\nMRS. CHEVELEY.  [_Shrugging her shoulders_.]  Oh! don't use big words.\nThey mean so little.  It is a commercial transaction.  That is all.\nThere is no good mixing up sentimentality in it.  I offered to sell\nRobert Chiltern a certain thing.  If he won't pay me my price, he will\nhave to pay the world a greater price.  There is no more to be said.  I\nmust go.  Good-bye.  Won't you shake hands?\n\nLORD GORING.  With you?  No.  Your transaction with Robert Chiltern may\npass as a loathsome commercial transaction of a loathsome commercial age;\nbut you seem to have forgotten that you came here to-night to talk of\nlove, you whose lips desecrated the word love, you to whom the thing is a\nbook closely sealed, went this afternoon to the house of one of the most\nnoble and gentle women in the world to degrade her husband in her eyes,\nto try and kill her love for him, to put poison in her heart, and\nbitterness in her life, to break her idol, and, it may be, spoil her\nsoul.  That I cannot forgive you.  That was horrible.  For that there can\nbe no forgiveness.\n\nMRS. CHEVELEY.  Arthur, you are unjust to me.  Believe me, you are quite\nunjust to me.  I didn't go to taunt Gertrude at all.  I had no idea of\ndoing anything of the kind when I entered.  I called with Lady Markby\nsimply to ask whether an ornament, a jewel, that I lost somewhere last\nnight, had been found at the Chilterns'.  If you don't believe me, you\ncan ask Lady Markby.  She will tell you it is true.  The scene that\noccurred happened after Lady Markby had left, and was really forced on me\nby Gertrude's rudeness and sneers.  I called, oh!--a little out of malice\nif you like--but really to ask if a diamond brooch of mine had been\nfound.  That was the origin of the whole thing.\n\nLORD GORING.  A diamond snake-brooch with a ruby?\n\nMRS. CHEVELEY.  Yes.  How do you know?\n\nLORD GORING.  Because it is found.  In point of fact, I found it myself,\nand stupidly forgot to tell the butler anything about it as I was\nleaving.  [_Goes over to the writing-table and pulls out the drawers_.]\nIt is in this drawer.  No, that one.  This is the brooch, isn't it?\n[_Holds up the brooch_.]\n\nMRS. CHEVELEY.  Yes.  I am so glad to get it back.  It was . . a present.\n\nLORD GORING.  Won't you wear it?\n\nMRS. CHEVELEY.  Certainly, if you pin it in.  [LORD GORING _suddenly\nclasps it on her arm_.]  Why do you put it on as a bracelet?  I never\nknew it could he worn as a bracelet.\n\nLORD GORING.  Really?\n\nMRS. CHEVELEY.  [_Holding out her handsome arm_.]  No; but it looks very\nwell on me as a bracelet, doesn't it?\n\nLORD GORING.  Yes; much better than when I saw it last.\n\nMRS. CHEVELEY.  When did you see it last?\n\nLORD GORING.  [_Calmly_.]  Oh, ten years ago, on Lady Berkshire, from\nwhom you stole it.\n\nMRS. CHEVELEY.  [_Starting_.]  What do you mean?\n\nLORD GORING.  I mean that you stole that ornament from my cousin, Mary\nBerkshire, to whom I gave it when she was married.  Suspicion fell on a\nwretched servant, who was sent away in disgrace.  I recognised it last\nnight.  I determined to say nothing about it till I had found the thief.\nI have found the thief now, and I have heard her own confession.\n\nMRS. CHEVELEY.  [_Tossing her head_.]  It is not true.\n\nLORD GORING.  You know it is true.  Why, thief is written across your\nface at this moment.\n\nMRS. CHEVELEY.  I will deny the whole affair from beginning to end.  I\nwill say that I have never seen this wretched thing, that it was never in\nmy possession.\n\n[MRS. CHEVELEY _tries to get the bracelet off her arm_, _but fails_.\nLORD GORING _looks on amused_.  _Her thin fingers tear at the jewel to no\npurpose_.  _A curse breaks from her_.]\n\nLORD GORING.  The drawback of stealing a thing, Mrs. Cheveley, is that\none never knows how wonderful the thing that one steals is.  You can't\nget that bracelet off, unless you know where the spring is.  And I see\nyou don't know where the spring is.  It is rather difficult to find.\n\nMRS. CHEVELEY.  You brute!  You coward!  [_She tries again to unclasp the\nbracelet_, _but fails_.]\n\nLORD GORING.  Oh! don't use big words.  They mean so little.\n\nMRS. CHEVELEY.  [_Again tears at the bracelet in a paroxysm of rage_,\n_with inarticulate sounds_.  _Then stops_, _and looks at_ LORD GORING.]\nWhat are you going to do?\n\nLORD GORING.  I am going to ring for my servant.  He is an admirable\nservant.  Always comes in the moment one rings for him.  When he comes I\nwill tell him to fetch the police.\n\nMRS. CHEVELEY.  [_Trembling_.]  The police?  What for?\n\nLORD GORING.  To-morrow the Berkshires will prosecute you.  That is what\nthe police are for.\n\nMRS. CHEVELEY.  [_Is now in an agony of physical terror_.  _Her face is\ndistorted_.  _Her mouth awry_.  _A mask has fallen from her_.  _She it_,\n_for the moment_, _dreadful to look at_.]  Don't do that.  I will do\nanything you want.  Anything in the world you want.\n\nLORD GORING.  Give me Robert Chiltern's letter.\n\nMRS. CHEVELEY.  Stop! Stop!  Let me have time to think.\n\nLORD GORING.  Give me Robert Chiltern's letter.\n\nMRS. CHEVELEY.  I have not got it with me.  I will give it to you\nto-morrow.\n\nLORD GORING.  You know you are lying.  Give it to me at once.  [MRS.\nCHEVELEY _pulls the letter out_, _and hands it to him_.  _She is horribly\npale_.]  This is it?\n\nMRS. CHEVELEY.  [_In a hoarse voice_.]  Yes.\n\nLORD GORING.  [_Takes the letter_, _examines it_, _sighs_, _and burns it\nwith the lamp_.]  For so well-dressed a woman, Mrs. Cheveley, you have\nmoments of admirable common sense.  I congratulate you.\n\nMRS. CHEVELEY.  [_Catches sight of_ LADY CHILTERN'S _letter_, _the cover\nof which is just showing from under the blotting-book_.]  Please get me a\nglass of water.\n\nLORD GORING.  Certainly.  [_Goes to the corner of the room and pours out\na glass of water_.  _While his back is turned_ MRS. CHEVELEY _steals_\nLADY CHILTERN'S _letter_.  _When_ LORD GORING _returns the glass she\nrefuses it with a gesture_.]\n\nMRS. CHEVELEY.  Thank you.  Will you help me on with my cloak?\n\nLORD GORING.  With pleasure.  [_Puts her cloak on_.]\n\nMRS. CHEVELEY.  Thanks.  I am never going to try to harm Robert Chiltern\nagain.\n\nLORD GORING.  Fortunately you have not the chance, Mrs. Cheveley.\n\nMRS. CHEVELEY.  Well, if even I had the chance, I wouldn't.  On the\ncontrary, I am going to render him a great service.\n\nLORD GORING.  I am charmed to hear it.  It is a reformation.\n\nMRS. CHEVELEY.  Yes.  I can't bear so upright a gentleman, so honourable\nan English gentleman, being so shamefully deceived, and so--\n\nLORD GORING.  Well?\n\nMRS. CHEVELEY.  I find that somehow Gertrude Chiltern's dying speech and\nconfession has strayed into my pocket.\n\nLORD GORING.  What do you mean?\n\nMRS. CHEVELEY.  [_With a bitter note of triumph in her voice_.]  I mean\nthat I am going to send Robert Chiltern the love-letter his wife wrote to\nyou to-night.\n\nLORD GORING.  Love-letter?\n\nMRS. CHEVELEY.  [_Laughing_.]  'I want you.  I trust you.  I am coming to\nyou.  Gertrude.'\n\n[LORD GORING _rushes to the bureau and takes up the envelope_, _finds is\nempty_, _and turns round_.]\n\nLORD GORING.  You wretched woman, must you always be thieving?  Give me\nback that letter.  I'll take it from you by force.  You shall not leave\nmy room till I have got it.\n\n[_He rushes towards her_, _but_ MRS. CHEVELEY _at once puts her hand on\nthe electric bell that is on the table_. _The bell sounds with shrill\nreverberations_, _and_ PHIPPS _enters_.]\n\nMRS. CHEVELEY.  [_After a pause_.]  Lord Goring merely rang that you\nshould show me out.  Good-night, Lord Goring!\n\n[_Goes out followed by_ PHIPPS.  _Her face it illumined with evil\ntriumph_.  _There is joy in her eyes_.  _Youth seems to have come back to\nher_.  _Her last glance is like a swift arrow_.  LORD GORING _bites his\nlip_, _and lights his a cigarette_.]\n\n                                ACT DROPS\n\n\n\n\nFOURTH ACT\n\n\nSCENE\n\n\n_Same as Act II_.\n\n[LORD GORING _is standing by the fireplace with his hands in his\npockets_.  _He is looking rather bored_.]\n\nLORD GORING.  [_Pulls out his watch_, _inspects it_, _and rings the\nbell_.]  It is a great nuisance.  I can't find any one in this house to\ntalk to.  And I am full of interesting information.  I feel like the\nlatest edition of something or other.\n\n[_Enter servant_.]\n\nJAMES.  Sir Robert is still at the Foreign Office, my lord.\n\nLORD GORING.  Lady Chiltern not down yet?\n\nJAMES.  Her ladyship has not yet left her room.  Miss Chiltern has just\ncome in from riding.\n\nLORD GORING.  [_To himself_.]  Ah! that is something.\n\nJAMES.  Lord Caversham has been waiting some time in the library for Sir\nRobert.  I told him your lordship was here.\n\nLORD GORING.  Thank you!  Would you kindly tell him I've gone?\n\nJAMES.  [_Bowing_.]  I shall do so, my lord.\n\n[_Exit servant_.]\n\nLORD GORING.  Really, I don't want to meet my father three days running.\nIt is a great deal too much excitement for any son.  I hope to goodness\nhe won't come up.  Fathers should be neither seen nor heard.  That is the\nonly proper basis for family life.  Mothers are different.  Mothers are\ndarlings.  [_Throws himself down into a chair_, _picks up a paper and\nbegins to read it_.]\n\n[_Enter_ LORD CAVERSHAM.]\n\nLORD CAVERSHAM.  Well, sir, what are you doing here?  Wasting your time\nas usual, I suppose?\n\nLORD GORING.  [_Throws down paper and rises_.]  My dear father, when one\npays a visit it is for the purpose of wasting other people's time, not\none's own.\n\nLORD CAVERSHAM.  Have you been thinking over what I spoke to you about\nlast night?\n\nLORD GORING.  I have been thinking about nothing else.\n\nLORD CAVERSHAM.  Engaged to be married yet?\n\nLORD GORING.  [_Genially_.]  Not yet: but I hope to be before lunch-time.\n\nLORD CAVERSHAM.  [_Caustically_.]  You can have till dinner-time if it\nwould be of any convenience to you.\n\nLORD GORING.  Thanks awfully, but I think I'd sooner be engaged before\nlunch.\n\nLORD CAVERSHAM.  Humph!  Never know when you are serious or not.\n\nLORD GORING.  Neither do I, father.\n\n[_A pause_.]\n\nLORD CAVERSHAM.  I suppose you have read _The Times_ this morning?\n\nLORD GORING.  [_Airily_.]  The Times?  Certainly not.  I only read _The\nMorning Post_.  All that one should know about modern life is where the\nDuchesses are; anything else is quite demoralising.\n\nLORD CAVERSHAM.  Do you mean to say you have not read _The Times_ leading\narticle on Robert Chiltern's career?\n\nLORD GORING.  Good heavens!  No.  What does it say?\n\nLORD CAVERSHAM.  What should it say, sir?  Everything complimentary, of\ncourse.  Chiltern's speech last night on this Argentine Canal scheme was\none of the finest pieces of oratory ever delivered in the House since\nCanning.\n\nLORD GORING.  Ah!  Never heard of Canning.  Never wanted to.  And did\n. . . did Chiltern uphold the scheme?\n\nLORD CAVERSHAM.  Uphold it, sir?  How little you know him!  Why, he\ndenounced it roundly, and the whole system of modern political finance.\nThis speech is the turning-point in his career, as _The Times_ points\nout.  You should read this article, sir.  [_Opens_ The Times.]  'Sir\nRobert Chiltern . . . most rising of our young statesmen . . . Brilliant\norator . . . Unblemished career . . . Well-known integrity of character\n. . . Represents what is best in English public life . . . Noble contrast\nto the lax morality so common among foreign politicians.'  They will\nnever say that of you, sir.\n\nLORD GORING.  I sincerely hope not, father.  However, I am delighted at\nwhat you tell me about Robert, thoroughly delighted.  It shows he has got\npluck.\n\nLORD CAVERSHAM.  He has got more than pluck, sir, he has got genius.\n\nLORD GORING.  Ah! I prefer pluck.  It is not so common, nowadays, as\ngenius is.\n\nLORD CAVERSHAM.  I wish you would go into Parliament.\n\nLORD GORING.  My dear father, only people who look dull ever get into the\nHouse of Commons, and only people who are dull ever succeed there.\n\nLORD CAVERSHAM.  Why don't you try to do something useful in life?\n\nLORD GORING.  I am far too young.\n\nLORD CAVERSHAM.  [_Testily_.]  I hate this affectation of youth, sir.  It\nis a great deal too prevalent nowadays.\n\nLORD GORING.  Youth isn't an affectation.  Youth is an art.\n\nLORD CAVERSHAM.  Why don't you propose to that pretty Miss Chiltern?\n\nLORD GORING.  I am of a very nervous disposition, especially in the\nmorning.\n\nLORD CAVERSHAM.  I don't suppose there is the smallest chance of her\naccepting you.\n\nLORD GORING.  I don't know how the betting stands to-day.\n\nLORD CAVERSHAM.  If she did accept you she would be the prettiest fool in\nEngland.\n\nLORD GORING.  That is just what I should like to marry.  A thoroughly\nsensible wife would reduce me to a condition of absolute idiocy in less\nthan six months.\n\nLORD CAVERSHAM.  You don't deserve her, sir.\n\nLORD GORING.  My dear father, if we men married the women we deserved, we\nshould have a very bad time of it.\n\n[_Enter_ MABEL CHILTERN.]\n\nMABEL CHILTERN.  Oh! . . . How do you do, Lord Caversham?  I hope Lady\nCaversham is quite well?\n\nLORD CAVERSHAM.  Lady Caversham is as usual, as usual.\n\nLORD GORING.  Good morning, Miss Mabel!\n\nMABEL CHILTERN.  [_Taking no notice at all of_ LORD GORING, _and\naddressing herself exclusively to_ LORD CAVERSHAM.]  And Lady Caversham's\nbonnets . . . are they at all better?\n\nLORD CAVERSHAM.  They have had a serious relapse, I am sorry to say.\n\nLORD GORING.  Good morning, Miss Mabel!\n\nMABEL CHILTERN.  [_To_ LORD CAVERSHAM.]  I hope an operation will not be\nnecessary.\n\nLORD CAVERSHAM.  [_Smiling at her pertness_.]  If it is, we shall have to\ngive Lady Caversham a narcotic.  Otherwise she would never consent to\nhave a feather touched.\n\nLORD GORING.  [_With increased emphasis_.]  Good morning, Miss Mabel!\n\nMABEL CHILTERN.  [_Turning round with feigned surprise_.]  Oh, are you\nhere?  Of course you understand that after your breaking your appointment\nI am never going to speak to you again.\n\nLORD GORING.  Oh, please don't say such a thing.  You are the one person\nin London I really like to have to listen to me.\n\nMABEL CHILTERN.  Lord Goring, I never believe a single word that either\nyou or I say to each other.\n\nLORD CAVERSHAM.  You are quite right, my dear, quite right . . . as far\nas he is concerned, I mean.\n\nMABEL CHILTERN.  Do you think you could possibly make your son behave a\nlittle better occasionally?  Just as a change.\n\nLORD CAVERSHAM.  I regret to say, Miss Chiltern, that I have no influence\nat all over my son.  I wish I had.  If I had, I know what I would make\nhim do.\n\nMABEL CHILTERN.  I am afraid that he has one of those terribly weak\nnatures that are not susceptible to influence.\n\nLORD CAVERSHAM.  He is very heartless, very heartless.\n\nLORD GORING.  It seems to me that I am a little in the way here.\n\nMABEL CHILTERN.  It is very good for you to be in the way, and to know\nwhat people say of you behind your back.\n\nLORD GORING.  I don't at all like knowing what people say of me behind my\nback.  It makes me far too conceited.\n\nLORD CAVERSHAM.  After that, my dear, I really must bid you good morning.\n\nMABEL CHILTERN.  Oh! I hope you are not going to leave me all alone with\nLord Goring?  Especially at such an early hour in the day.\n\nLORD CAVERSHAM.  I am afraid I can't take him with me to Downing Street.\nIt is not the Prime Minster's day for seeing the unemployed.\n\n[_Shakes hands with_ MABEL CHILTERN, _takes up his hat and stick_, _and\ngoes out_, _with a parting glare of indignation at_ LORD GORING.]\n\nMABEL CHILTERN.  [_Takes up roses and begins to arrange them in a bowl on\nthe table_.]  People who don't keep their appointments in the Park are\nhorrid.\n\nLORD GORING.  Detestable.\n\nMABEL CHILTERN.  I am glad you admit it.  But I wish you wouldn't look so\npleased about it.\n\nLORD GORING.  I can't help it.  I always look pleased when I am with you.\n\nMABEL CHILTERN.  [_Sadly_.]  Then I suppose it is my duty to remain with\nyou?\n\nLORD GORING.  Of course it is.\n\nMABEL CHILTERN.  Well, my duty is a thing I never do, on principle.  It\nalways depresses me.  So I am afraid I must leave you.\n\nLORD GORING.  Please don't, Miss Mabel.  I have something very particular\nto say to you.\n\nMABEL CHILTERN.  [_Rapturously_.]  Oh! is it a proposal?\n\nLORD GORING.  [_Somewhat taken aback_.]  Well, yes, it is--I am bound to\nsay it is.\n\nMABEL CHILTERN.  [_With a sigh of pleasure_.]  I am so glad.  That makes\nthe second to-day.\n\nLORD GORING.  [_Indignantly_.]  The second to-day?  What conceited ass\nhas been impertinent enough to dare to propose to you before I had\nproposed to you?\n\nMABEL CHILTERN.  Tommy Trafford, of course.  It is one of Tommy's days\nfor proposing.  He always proposes on Tuesdays and Thursdays, during the\nSeason.\n\nLORD GORING.  You didn't accept him, I hope?\n\nMABEL CHILTERN.  I make it a rule never to accept Tommy.  That is why he\ngoes on proposing.  Of course, as you didn't turn up this morning, I very\nnearly said yes.  It would have been an excellent lesson both for him and\nfor you if I had.  It would have taught you both better manners.\n\nLORD GORING.  Oh! bother Tommy Trafford.  Tommy is a silly little ass.  I\nlove you.\n\nMABEL CHILTERN.  I know.  And I think you might have mentioned it before.\nI am sure I have given you heaps of opportunities.\n\nLORD GORING.  Mabel, do be serious.  Please be serious.\n\nMABEL CHILTERN.  Ah! that is the sort of thing a man always says to a\ngirl before he has been married to her.  He never says it afterwards.\n\nLORD GORING.  [_Taking hold of her hand_.]  Mabel, I have told you that I\nlove you.  Can't you love me a little in return?\n\nMABEL CHILTERN.  You silly Arthur!  If you knew anything about . . .\nanything, which you don't, you would know that I adore you.  Every one in\nLondon knows it except you.  It is a public scandal the way I adore you.\nI have been going about for the last six months telling the whole of\nsociety that I adore you.  I wonder you consent to have anything to say\nto me.  I have no character left at all.  At least, I feel so happy that\nI am quite sure I have no character left at all.\n\nLORD GORING.  [_Catches her in his arms and kisses her_.  _Then there is\na pause of bliss_.]  Dear!  Do you know I was awfully afraid of being\nrefused!\n\nMABEL CHILTERN.  [_Looking up at him_.]  But you never have been refused\nyet by anybody, have you, Arthur?  I can't imagine any one refusing you.\n\nLORD GORING.  [_After kissing her again_.]  Of course I'm not nearly good\nenough for you, Mabel.\n\nMABEL CHILTERN.  [_Nestling close to him_.]  I am so glad, darling.  I\nwas afraid you were.\n\nLORD GORING.  [_After some hesitation_.]  And I'm . . . I'm a little over\nthirty.\n\nMABEL CHILTERN.  Dear, you look weeks younger than that.\n\nLORD GORING.  [_Enthusiastically_.]  How sweet of you to say so! . . .\nAnd it is only fair to tell you frankly that I am fearfully extravagant.\n\nMABEL CHILTERN.  But so am I, Arthur.  So we're sure to agree.  And now I\nmust go and see Gertrude.\n\nLORD GORING.  Must you really?  [_Kisses her_.]\n\nMABEL CHILTERN.  Yes.\n\nLORD GORING.  Then do tell her I want to talk to her particularly.  I\nhave been waiting here all the morning to see either her or Robert.\n\nMABEL CHILTERN.  Do you mean to say you didn't come here expressly to\npropose to me?\n\nLORD GORING.  [_Triumphantly_.]  No; that was a flash of genius.\n\nMABEL CHILTERN.  Your first.\n\nLORD GORING.  [_With determination_.]  My last.\n\nMABEL CHILTERN.  I am delighted to hear it.  Now don't stir.  I'll be\nback in five minutes.  And don't fall into any temptations while I am\naway.\n\nLORD GORING.  Dear Mabel, while you are away, there are none.  It makes\nme horribly dependent on you.\n\n[_Enter_ LADY CHILTERN.]\n\nLADY CHILTERN.  Good morning, dear!  How pretty you are looking!\n\nMABEL CHILTERN.  How pale you are looking, Gertrude!  It is most\nbecoming!\n\nLADY CHILTERN.  Good morning, Lord Goring!\n\nLORD GORING.  [_Bowing_.]  Good morning, Lady Chiltern!\n\nMABEL CHILTERN.  [_Aside to_ LORD GORING.]  I shall be in the\nconservatory under the second palm tree on the left.\n\nLORD GORING.  Second on the left?\n\nMABEL CHILTERN.  [_With a look of mock surprise_.]  Yes; the usual palm\ntree.\n\n[_Blows a kiss to him_, _unobserved by_ LADY CHILTERN, _and goes out_.]\n\nLORD GORING.  Lady Chiltern, I have a certain amount of very good news to\ntell you.  Mrs. Cheveley gave me up Robert's letter last night, and I\nburned it.  Robert is safe.\n\nLADY CHILTERN.  [_Sinking on the sofa_.]  Safe!  Oh! I am so glad of\nthat.  What a good friend you are to him--to us!\n\nLORD GORING.  There is only one person now that could be said to be in\nany danger.\n\nLADY CHILTERN.  Who is that?\n\nLORD GORING.  [_Sitting down beside her_.]  Yourself.\n\nLADY CHILTERN.  I?  In danger?  What do you mean?\n\nLORD GORING.  Danger is too great a word.  It is a word I should not have\nused.  But I admit I have something to tell you that may distress you,\nthat terribly distresses me.  Yesterday evening you wrote me a very\nbeautiful, womanly letter, asking me for my help.  You wrote to me as one\nof your oldest friends, one of your husband's oldest friends.  Mrs.\nCheveley stole that letter from my rooms.\n\nLADY CHILTERN.  Well, what use is it to her?  Why should she not have it?\n\nLORD GORING.  [_Rising_.]  Lady Chiltern, I will be quite frank with you.\nMrs. Cheveley puts a certain construction on that letter and proposes to\nsend it to your husband.\n\nLADY CHILTERN.  But what construction could she put on it? . . . Oh! not\nthat! not that!  If I in--in trouble, and wanting your help, trusting\nyou, propose to come to you . . . that you may advise me . . . assist me\n. . . Oh! are there women so horrible as that . . .?  And she proposes to\nsend it to my husband?  Tell me what happened.  Tell me all that\nhappened.\n\nLORD GORING.  Mrs. Cheveley was concealed in a room adjoining my library,\nwithout my knowledge.  I thought that the person who was waiting in that\nroom to see me was yourself.  Robert came in unexpectedly.  A chair or\nsomething fell in the room.  He forced his way in, and he discovered her.\nWe had a terrible scene.  I still thought it was you.  He left me in\nanger.  At the end of everything Mrs. Cheveley got possession of your\nletter--she stole it, when or how, I don't know.\n\nLADY CHILTERN.  At what hour did this happen?\n\nLORD GORING.  At half-past ten.  And now I propose that we tell Robert\nthe whole thing at once.\n\nLADY CHILTERN.  [_Looking at him with amazement that is almost terror_.]\nYou want me to tell Robert that the woman you expected was not Mrs.\nCheveley, but myself?  That it was I whom you thought was concealed in a\nroom in your house, at half-past ten o'clock at night?  You want me to\ntell him that?\n\nLORD GORING.  I think it is better that he should know the exact truth.\n\nLADY CHILTERN.  [_Rising_.]  Oh, I couldn't, I couldn't!\n\nLORD GORING.  May I do it?\n\nLADY CHILTERN.  No.\n\nLORD GORING.  [_Gravely_.]  You are wrong, Lady Chiltern.\n\nLADY CHILTERN.  No.  The letter must be intercepted.  That is all.  But\nhow can I do it?  Letters arrive for him every moment of the day.  His\nsecretaries open them and hand them to him.  I dare not ask the servants\nto bring me his letters.  It would be impossible.  Oh! why don't you tell\nme what to do?\n\nLORD GORING.  Pray be calm, Lady Chiltern, and answer the questions I am\ngoing to put to you.  You said his secretaries open his letters.\n\nLADY CHILTERN.  Yes.\n\nLORD GORING.  Who is with him to-day?  Mr. Trafford, isn't it?\n\nLADY CHILTERN.  No.  Mr. Montford, I think.\n\nLORD GORING.  You can trust him?\n\nLADY CHILTERN.  [_With a gesture of despair_.]  Oh! how do I know?\n\nLORD GORING.  He would do what you asked him, wouldn't he?\n\nLADY CHILTERN.  I think so.\n\nLORD GORING.  Your letter was on pink paper.  He could recognise it\nwithout reading it, couldn't he?  By the colour?\n\nLADY CHILTERN.  I suppose so.\n\nLORD GORING.  Is he in the house now?\n\nLADY CHILTERN.  Yes.\n\nLORD GORING.  Then I will go and see him myself, and tell him that a\ncertain letter, written on pink paper, is to be forwarded to Robert\nto-day, and that at all costs it must not reach him.  [_Goes to the\ndoor_, _and opens it_.]  Oh! Robert is coming upstairs with the letter in\nhis hand.  It has reached him already.\n\nLADY CHILTERN.  [_With a cry of pain_.]  Oh! you have saved his life;\nwhat have you done with mine?\n\n[_Enter_ SIR ROBERT CHILTERN.  _He has the letter in his hand_, _and is\nreading it_.  _He comes towards his wife_, _not noticing_ LORD GORING'S\n_presence_.]\n\nSIR ROBERT CHILTERN.  'I want you.  I trust you.  I am coming to you.\nGertrude.'  Oh, my love!  Is this true?  Do you indeed trust me, and want\nme?  If so, it was for me to come to you, not for you to write of coming\nto me.  This letter of yours, Gertrude, makes me feel that nothing that\nthe world may do can hurt me now.  You want me, Gertrude?\n\n[LORD GORING, _unseen by_ SIR ROBERT CHILTERN, _makes an imploring sign\nto_ LADY CHILTERN _to accept the situation and_ SIR ROBERT'S _error_.]\n\nLADY CHILTERN.  Yes.\n\nSIR ROBERT CHILTERN.  You trust me, Gertrude?\n\nLADY CHILTERN.  Yes.\n\nSIR ROBERT CHILTERN.  Ah! why did you not add you loved me?\n\nLADY CHILTERN.  [_Taking his hand_.]  Because I loved you.\n\n[LORD GORING _passes into the conservatory_.]\n\nSIR ROBERT CHILTERN.  [_Kisses her_.]  Gertrude, you don't know what I\nfeel.  When Montford passed me your letter across the table--he had\nopened it by mistake, I suppose, without looking at the handwriting on\nthe envelope--and I read it--oh! I did not care what disgrace or\npunishment was in store for me, I only thought you loved me still.\n\nLADY CHILTERN.  There is no disgrace in store for you, nor any public\nshame.  Mrs. Cheveley has handed over to Lord Goring the document that\nwas in her possession, and he has destroyed it.\n\nSIR ROBERT CHILTERN.  Are you sure of this, Gertrude?\n\nLADY CHILTERN.  Yes; Lord Goring has just told me.\n\nSIR ROBERT CHILTERN.  Then I am safe!  Oh! what a wonderful thing to be\nsafe!  For two days I have been in terror.  I am safe now.  How did\nArthur destroy my letter?  Tell me.\n\nLADY CHILTERN.  He burned it.\n\nSIR ROBERT CHILTERN.  I wish I had seen that one sin of my youth burning\nto ashes.  How many men there are in modern life who would like to see\ntheir past burning to white ashes before them!  Is Arthur still here?\n\nLADY CHILTERN.  Yes; he is in the conservatory.\n\nSIR ROBERT CHILTERN.  I am so glad now I made that speech last night in\nthe House, so glad.  I made it thinking that public disgrace might be the\nresult.  But it has not been so.\n\nLADY CHILTERN.  Public honour has been the result.\n\nSIR ROBERT CHILTERN.  I think so.  I fear so, almost.  For although I am\nsafe from detection, although every proof against me is destroyed, I\nsuppose, Gertrude . . . I suppose I should retire from public life?  [_He\nlooks anxiously at his wife_.]\n\nLADY CHILTERN.  [_Eagerly_.]  Oh yes, Robert, you should do that.  It is\nyour duty to do that.\n\nSIR ROBERT CHILTERN.  It is much to surrender.\n\nLADY CHILTERN.  No; it will be much to gain.\n\n[SIR ROBERT CHILTERN _walks up and down the room with a troubled\nexpression_.  _Then comes over to his wife_, _and puts his hand on her\nshoulder_.]\n\nSIR ROBERT CHILTERN.  And you would be happy living somewhere alone with\nme, abroad perhaps, or in the country away from London, away from public\nlife?  You would have no regrets?\n\nLADY CHILTERN.  Oh! none, Robert.\n\nSIR ROBERT CHILTERN.  [_Sadly_.]  And your ambition for me?  You used to\nbe ambitious for me.\n\nLADY CHILTERN.  Oh, my ambition!  I have none now, but that we two may\nlove each other.  It was your ambition that led you astray.  Let us not\ntalk about ambition.\n\n[LORD GORING _returns from the conservatory_, _looking very pleased with\nhimself_, _and with an entirely new buttonhole that some one has made for\nhim_.]\n\nSIR ROBERT CHILTERN.  [_Going towards him_.]  Arthur, I have to thank you\nfor what you have done for me.  I don't know how I can repay you.\n[_Shakes hands with him_.]\n\nLORD GORING.  My dear fellow, I'll tell you at once.  At the present\nmoment, under the usual palm tree . . . I mean in the conservatory . . .\n\n[_Enter_ MASON.]\n\nMASON.  Lord Caversham.\n\nLORD GORING.  That admirable father of mine really makes a habit of\nturning up at the wrong moment.  It is very heartless of him, very\nheartless indeed.\n\n[_Enter_ LORD CAVERSHAM.  MASON _goes out_.]\n\nLORD CAVERSHAM.  Good morning, Lady Chiltern!  Warmest congratulations to\nyou, Chiltern, on your brilliant speech last night.  I have just left the\nPrime Minister, and you are to have the vacant seat in the Cabinet.\n\nSIR ROBERT CHILTERN.  [_With a look of joy and triumph_.]  A seat in the\nCabinet?\n\nLORD CAVERSHAM.  Yes; here is the Prime Minister's letter.  [_Hands\nletter_.]\n\nSIR ROBERT CHILTERN.  [_Takes letter and reads it_.]  A seat in the\nCabinet!\n\nLORD CAVERSHAM.  Certainly, and you well deserve it too.  You have got\nwhat we want so much in political life nowadays--high character, high\nmoral tone, high principles.  [_To_ LORD GORING.]  Everything that you\nhave not got, sir, and never will have.\n\nLORD GORING.  I don't like principles, father.  I prefer prejudices.\n\n[SIR ROBERT CHILTERN _is on the brink of accepting the Prime Minister's\noffer_, _when he sees wife looking at him with her clear_, _candid eyes_.\n_He then realises that it is impossible_.]\n\nSIR ROBERT CHILTERN.  I cannot accept this offer, Lord Caversham.  I have\nmade up my mind to decline it.\n\nLORD CAVERSHAM.  Decline it, sir!\n\nSIR ROBERT CHILTERN.  My intention is to retire at once from public life.\n\nLORD CAVERSHAM.  [_Angrily_.]  Decline a seat in the Cabinet, and retire\nfrom public life?  Never heard such damned nonsense in the whole course\nof my existence.  I beg your pardon, Lady Chiltern.  Chiltern, I beg your\npardon.  [_To_ LORD GORING.]  Don't grin like that, sir.\n\nLORD GORING.  No, father.\n\nLORD CAVERSHAM.  Lady Chiltern, you are a sensible woman, the most\nsensible woman in London, the most sensible woman I know.  Will you\nkindly prevent your husband from making such a . . . from taking such\n. . . Will you kindly do that, Lady Chiltern?\n\nLADY CHILTERN.  I think my husband in right in his determination, Lord\nCaversham.  I approve of it.\n\nLORD CAVERSHAM.  You approve of it?  Good heavens!\n\nLADY CHILTERN.  [_Taking her husband's hand_.]  I admire him for it.  I\nadmire him immensely for it.  I have never admired him so much before.\nHe is finer than even I thought him.  [_To_ SIR ROBERT CHILTERN.]  You\nwill go and write your letter to the Prime Minister now, won't you?\nDon't hesitate about it, Robert.\n\nSIR ROBERT CHILTERN.  [_With a touch of bitterness_.]  I suppose I had\nbetter write it at once.  Such offers are not repeated.  I will ask you\nto excuse me for a moment, Lord Caversham.\n\nLADY CHILTERN.  I may come with you, Robert, may I not?\n\nSIR ROBERT CHILTERN.  Yes, Gertrude.\n\n[LADY CHILTERN _goes out with him_.]\n\nLORD CAVERSHAM.  What is the matter with this family?  Something wrong\nhere, eh?  [_Tapping his forehead_.]  Idiocy?  Hereditary, I suppose.\nBoth of them, too.  Wife as well as husband.  Very sad.  Very sad indeed!\nAnd they are not an old family.  Can't understand it.\n\nLORD GORING.  It is not idiocy, father, I assure you.\n\nLORD CAVERSHAM.  What is it then, sir?\n\nLORD GORING.  [_After some hesitation_.]  Well, it is what is called\nnowadays a high moral tone, father.  That is all.\n\nLORD CAVERSHAM.  Hate these new-fangled names.  Same thing as we used to\ncall idiocy fifty years ago.  Shan't stay in this house any longer.\n\nLORD GORING.  [_Taking his arm_.]  Oh! just go in here for a moment,\nfather.  Third palm tree to the left, the usual palm tree.\n\nLORD CAVERSHAM.  What, sir?\n\nLORD GORING.  I beg your pardon, father, I forgot.  The conservatory,\nfather, the conservatory--there is some one there I want you to talk to.\n\nLORD CAVERSHAM.  What about, sir?\n\nLORD GORING.  About me, father,\n\nLORD CAVERSHAM.  [_Grimly_.]  Not a subject on which much eloquence is\npossible.\n\nLORD GORING.  No, father; but the lady is like me.  She doesn't care much\nfor eloquence in others.  She thinks it a little loud.\n\n[LORD CAVERSHAM _goes out into the conservatory_.  LADY CHILTERN\n_enters_.]\n\nLORD GORING.  Lady Chiltern, why are you playing Mrs. Cheveley's cards?\n\nLADY CHILTERN.  [_Startled_.]  I don't understand you.\n\nLORD GORING.  Mrs. Cheveley made an attempt to ruin your husband.  Either\nto drive him from public life, or to make him adopt a dishonourable\nposition.  From the latter tragedy you saved him.  The former you are now\nthrusting on him.  Why should you do him the wrong Mrs. Cheveley tried to\ndo and failed?\n\nLADY CHILTERN.  Lord Goring?\n\nLORD GORING.  [_Pulling himself together for a great effort_, _and\nshowing the philosopher that underlies the dandy_.]  Lady Chiltern, allow\nme.  You wrote me a letter last night in which you said you trusted me\nand wanted my help.  Now is the moment when you really want my help, now\nis the time when you have got to trust me, to trust in my counsel and\njudgment.  You love Robert.  Do you want to kill his love for you?  What\nsort of existence will he have if you rob him of the fruits of his\nambition, if you take him from the splendour of a great political career,\nif you close the doors of public life against him, if you condemn him to\nsterile failure, he who was made for triumph and success?  Women are not\nmeant to judge us, but to forgive us when we need forgiveness.  Pardon,\nnot punishment, is their mission.  Why should you scourge him with rods\nfor a sin done in his youth, before he knew you, before he knew himself?\nA man's life is of more value than a woman's.  It has larger issues,\nwider scope, greater ambitions.  A woman's life revolves in curves of\nemotions.  It is upon lines of intellect that a man's life progresses.\nDon't make any terrible mistake, Lady Chiltern.  A woman who can keep a\nman's love, and love him in return, has done all the world wants of\nwomen, or should want of them.\n\nLADY CHILTERN.  [_Troubled and hesitating_.]  But it is my husband\nhimself who wishes to retire from public life.  He feels it is his duty.\nIt was he who first said so.\n\nLORD GORING.  Rather than lose your love, Robert would do anything, wreck\nhis whole career, as he is on the brink of doing now.  He is making for\nyou a terrible sacrifice.  Take my advice, Lady Chiltern, and do not\naccept a sacrifice so great.  If you do, you will live to repent it\nbitterly.  We men and women are not made to accept such sacrifices from\neach other.  We are not worthy of them.  Besides, Robert has been\npunished enough.\n\nLADY CHILTERN.  We have both been punished.  I set him up too high.\n\nLORD GORING.  [_With deep feeling in his voice_.]  Do not for that reason\nset him down now too low.  If he has fallen from his altar, do not thrust\nhim into the mire.  Failure to Robert would be the very mire of shame.\nPower is his passion.  He would lose everything, even his power to feel\nlove.  Your husband's life is at this moment in your hands, your\nhusband's love is in your hands.  Don't mar both for him.\n\n[_Enter_ SIR ROBERT CHILTERN.]\n\nSIR ROBERT CHILTERN.  Gertrude, here is the draft of my letter.  Shall I\nread it to you?\n\nLADY CHILTERN.  Let me see it.\n\n[SIR ROBERT _hands her the letter_.  _She reads it_, _and then_, _with a\ngesture of passion_, _tears it up_.]\n\nSIR ROBERT CHILTERN.  What are you doing?\n\nLADY CHILTERN.  A man's life is of more value than a woman's.  It has\nlarger issues, wider scope, greater ambitions.  Our lives revolve in\ncurves of emotions.  It is upon lines of intellect that a man's life\nprogresses.  I have just learnt this, and much else with it, from Lord\nGoring.  And I will not spoil your life for you, nor see you spoil it as\na sacrifice to me, a useless sacrifice!\n\nSIR ROBERT CHILTERN.  Gertrude!  Gertrude!\n\nLADY CHILTERN.  You can forget.  Men easily forget.  And I forgive.  That\nis how women help the world.  I see that now.\n\nSIR ROBERT CHILTERN.  [_Deeply overcome by emotion_, _embraces her_.]  My\nwife! my wife!  [_To_ LORD GORING.]  Arthur, it seems that I am always to\nbe in your debt.\n\nLORD GORING.  Oh dear no, Robert.  Your debt is to Lady Chiltern, not to\nme!\n\nSIR ROBERT CHILTERN.  I owe you much.  And now tell me what you were\ngoing to ask me just now as Lord Caversham came in.\n\nLORD GORING.  Robert, you are your sister's guardian, and I want your\nconsent to my marriage with her.  That is all.\n\nLADY CHILTERN.  Oh, I am so glad!  I am so glad!  [_Shakes hands with_\nLORD GORING.]\n\nLORD GORING.  Thank you, Lady Chiltern.\n\nSIR ROBERT CHILTERN.  [_With a troubled look_.]  My sister to be your\nwife?\n\nLORD GORING.  Yes.\n\nSIR ROBERT CHILTERN.  [_Speaking with great firmness_.]  Arthur, I am\nvery sorry, but the thing is quite out of the question.  I have to think\nof Mabel's future happiness.  And I don't think her happiness would be\nsafe in your hands.  And I cannot have her sacrificed!\n\nLORD GORING.  Sacrificed!\n\nSIR ROBERT CHILTERN.  Yes, utterly sacrificed.  Loveless marriages are\nhorrible.  But there is one thing worse than an absolutely loveless\nmarriage.  A marriage in which there is love, but on one side only;\nfaith, but on one side only; devotion, but on one side only, and in which\nof the two hearts one is sure to be broken.\n\nLORD GORING.  But I love Mabel.  No other woman has any place in my life.\n\nLADY CHILTERN.  Robert, if they love each other, why should they not be\nmarried?\n\nSIR ROBERT CHILTERN.  Arthur cannot bring Mabel the love that she\ndeserves.\n\nLORD GORING.  What reason have you for saying that?\n\nSIR ROBERT CHILTERN.  [_After a pause_.]  Do you really require me to\ntell you?\n\nLORD GORING.  Certainly I do.\n\nSIR ROBERT CHILTERN.  As you choose.  When I called on you yesterday\nevening I found Mrs. Cheveley concealed in your rooms.  It was between\nten and eleven o'clock at night.  I do not wish to say anything more.\nYour relations with Mrs. Cheveley have, as I said to you last night,\nnothing whatsoever to do with me.  I know you were engaged to be married\nto her once.  The fascination she exercised over you then seems to have\nreturned.  You spoke to me last night of her as of a woman pure and\nstainless, a woman whom you respected and honoured.  That may be so.  But\nI cannot give my sister's life into your hands.  It would be wrong of me.\nIt would be unjust, infamously unjust to her.\n\nLORD GORING.  I have nothing more to say.\n\nLADY CHILTERN.  Robert, it was not Mrs. Cheveley whom Lord Goring\nexpected last night.\n\nSIR ROBERT CHILTERN.  Not Mrs. Cheveley!  Who was it then?\n\nLORD GORING.  Lady Chiltern!\n\nLADY CHILTERN.  It was your own wife.  Robert, yesterday afternoon Lord\nGoring told me that if ever I was in trouble I could come to him for\nhelp, as he was our oldest and best friend.  Later on, after that\nterrible scene in this room, I wrote to him telling him that I trusted\nhim, that I had need of him, that I was coming to him for help and\nadvice.  [SIR ROBERT CHILTERN _takes the letter out of his pocket_.]\nYes, that letter.  I didn't go to Lord Goring's, after all.  I felt that\nit is from ourselves alone that help can come.  Pride made me think that.\nMrs. Cheveley went.  She stole my letter and sent it anonymously to you\nthis morning, that you should think . . . Oh! Robert, I cannot tell you\nwhat she wished you to think. . . .\n\nSIR ROBERT CHILTERN.  What!  Had I fallen so low in your eyes that you\nthought that even for a moment I could have doubted your goodness?\nGertrude, Gertrude, you are to me the white image of all good things, and\nsin can never touch you.  Arthur, you can go to Mabel, and you have my\nbest wishes!  Oh! stop a moment.  There is no name at the beginning of\nthis letter.  The brilliant Mrs. Cheveley does not seem to have noticed\nthat.  There should be a name.\n\nLADY CHILTERN.  Let me write yours.  It is you I trust and need.  You and\nnone else.\n\nLORD GORING.  Well, really, Lady Chiltern, I think I should have back my\nown letter.\n\nLADY CHILTERN.  [_Smiling_.]  No; you shall have Mabel.  [_Takes the\nletter and writes her husband's name on it_.]\n\nLORD GORING.  Well, I hope she hasn't changed her mind.  It's nearly\ntwenty minutes since I saw her last.\n\n[_Enter_ MABEL CHILTERN _and_ LORD CAVERSHAM.]\n\nMABEL CHILTERN.  Lord Goring, I think your father's conversation much\nmore improving than yours.  I am only going to talk to Lord Caversham in\nthe future, and always under the usual palm tree.\n\nLORD GORING.  Darling!  [_Kisses her_.]\n\nLORD CAVERSHAM.  [_Considerably taken aback_.]  What does this mean, sir?\nYou don't mean to say that this charming, clever young lady has been so\nfoolish as to accept you?\n\nLORD GORING.  Certainly, father!  And Chiltern's been wise enough to\naccept the seat in the Cabinet.\n\nLORD CAVERSHAM.  I am very glad to hear that, Chiltern . . . I\ncongratulate you, sir.  If the country doesn't go to the dogs or the\nRadicals, we shall have you Prime Minister, some day.\n\n[_Enter_ MASON.]\n\nMASON.  Luncheon is on the table, my Lady!\n\n[MASON _goes out_.]\n\nMABEL CHILTERN.  You'll stop to luncheon, Lord Caversham, won't you?\n\nLORD CAVERSHAM.  With pleasure, and I'll drive you down to Downing Street\nafterwards, Chiltern.  You have a great future before you, a great\nfuture.  Wish I could say the same for you, sir.  [_To_ LORD GORING.]\nBut your career will have to be entirely domestic.\n\nLORD GORING.  Yes, father, I prefer it domestic.\n\nLORD CAVERSHAM.  And if you don't make this young lady an ideal husband,\nI'll cut you off with a shilling.\n\nMABEL CHILTERN.  An ideal husband!  Oh, I don't think I should like that.\nIt sounds like something in the next world.\n\nLORD CAVERSHAM.  What do you want him to be then, dear?\n\nMABEL CHILTERN.  He can be what he chooses.  All I want is to be . . . to\nbe . . . oh! a real wife to him.\n\nLORD CAVERSHAM.  Upon my word, there is a good deal of common sense in\nthat, Lady Chiltern.\n\n[_They all go out except_ SIR ROBERT CHILTERN.  _He sinks in a chair_,\n_wrapt in thought_.  _After a little time_ LADY CHILTERN _returns to look\nfor him_.]\n\nLADY CHILTERN.  [_Leaning over the back of the chair_.]  Aren't you\ncoming in, Robert?\n\nSIR ROBERT CHILTERN.  [_Taking her hand_.]  Gertrude, is it love you feel\nfor me, or is it pity merely?\n\nLADY CHILTERN.  [_Kisses him_.]  It is love, Robert.  Love, and only\nlove.  For both of us a new life is beginning.\n\n                                 CURTAIN\n\n                                * * * * *\n\n              THE NORTHUMBERLAND PRESS, NEWCASTLE-UPON-TYNE", "title": "An Ideal Husband"}