{"summary": "The story begins with the unnamed narrator arriving at the house of his friend, Roderick Usher, having received a letter from him in a distant part of the country complaining of an illness and asking for his help. As he arrives, the narrator notes a thin crack extending from the roof, down the front of the building and into the lake.\nAlthough Poe wrote this short story before the invention of modern psychological science, Roderick's condition can be described according to its terminology. It includes a form of sensory overload known as hyperesthesia (hypersensitivity to textures, light, sounds, smells and tastes), hypochondria (an excessive preoccupation or worry about having a serious illness) and acute anxiety. It is revealed that Roderick's twin sister, Madeline, is also ill and falls into cataleptic, deathlike trances. The narrator is impressed with Roderick's paintings, and attempts to cheer him by reading with him and listening to his improvised musical compositions on the guitar. Roderick sings \"The Haunted Palace\", then tells the narrator that he believes the house he lives in to be alive, and that this sentience arises from the arrangement of the masonry and vegetation surrounding it.\nRoderick later informs the narrator that his sister has died and insists that she be entombed for two weeks in the family tomb located in the house before being permanently buried. The narrator helps Roderick put the body in the tomb, and he notes that Madeline has rosy cheeks, as some do after death. They inter her, but over the next week both Roderick and the narrator find themselves becoming increasingly agitated for no apparent reason. A storm begins. Roderick comes to the narrator's bedroom, which is situated directly above the vault, and throws open his window to the storm. He notices that the tarn surrounding the house seems to glow in the dark, as it glowed in Roderick Usher's paintings, although there is no lightning.\nThe narrator attempts to calm Roderick by reading aloud The Mad Tryst, a novel involving a knight named Ethelred who breaks into a hermit's dwelling in an attempt to escape an approaching storm, only to find a palace of gold guarded by a dragon. He also finds, hanging on the wall, a shield of shining brass on which is written a legend:\nWho entereth herein, a conqueror hath bin;\nWho slayeth the dragon, the shield he shall win;\nWith a stroke of his mace, Ethelred kills the dragon, who dies with a piercing shriek, and proceeds to take the shield, which falls to the floor with an unnerving clatter.\nAs the narrator reads of the knight's forcible entry into the dwelling, cracking and ripping sounds are heard somewhere in the house. When the dragon is described as shrieking as it dies, a shriek is heard, again within the house. As he relates the shield falling from off the wall, a reverberation, metallic and hollow, can be heard. Roderick becomes increasingly hysterical, and eventually exclaims that these sounds are being made by his sister, who was in fact alive when she was entombed. Additionally, Roderick somehow knew that she was alive. The bedroom door is then blown open to reveal Madeline standing there. She falls on her brother, and both land on the floor as corpses. The narrator then flees the house, and, as he does so, notices a flash of moonlight behind him which causes him to turn back, in time to see the moon shining through the suddenly widened crack. As he watches, the House of Usher splits in two and the fragments sink into the tarn.\n\n", "full_text": "The Fall of the House of Usher\n\n\n  Son coeur est un luth suspendu;\n  Sitot qu'on le touche il resonne.\n    DE BERANGER.\n\n\n\nDuring the whole of a dull, dark, and soundless day in the\nautumn of the year, when the clouds hung oppressively low in the\nheavens, I had been passing alone, on horseback, through a\nsingularly dreary tract of country; and at length found myself,\nas the shades of the evening drew on, within view of the\nmelancholy House of Usher.  I know not how it was--but, with the\nfirst glimpse of the building, a sense of insufferable gloom\npervaded my spirit.  I say insufferable; for the feeling was\nunrelieved by any of that half-pleasureable, because poetic,\nsentiment, with which the mind usually receives even the sternest\nnatural images of the desolate or terrible.  I looked upon the\nscene before me--upon the mere house, and the simple landscape\nfeatures of the domain--upon the bleak walls--upon the vacant\neye-like windows--upon a few rank sedges--and upon a few white\ntrunks of decayed trees--with an utter depression of soul which I\ncan compare to no earthly sensation more properly than to the\nafter-dream of the reveller upon opium--the bitter lapse into\neveryday life--the hideous dropping off of the veil.  There was\nan iciness, a sinking, a sickening of the heart--an unredeemed\ndreariness of thought which no goading of the imagination could\ntorture into aught of the sublime.  What was it--I paused to\nthink--what was it that so unnerved me in the contemplation of\nthe House of Usher?  It was a mystery all insoluble; nor could I\ngrapple with the shadowy fancies that crowded upon me as I\npondered.  I was forced to fall back upon the unsatisfactory\nconclusion, that while, beyond doubt, there are combinations\nof very simple natural objects which have the power of thus\naffecting us, still the analysis of this power lies among\nconsiderations beyond our depth.  It was possible, I reflected,\nthat a mere different arrangement of the particulars of the\nscene, of the details of the picture, would be sufficient to\nmodify, or perhaps to annihilate its capacity for sorrowful\nimpression; and, acting upon this idea, I reined my horse\nto the precipitous brink of a black and lurid tarn that lay in\nunruffled lustre by the dwelling, and gazed down--but with a\nshudder even more thrilling than before--upon the remodelled and\ninverted images of the grey sedge, and the ghastly tree-stems,\nand the vacant and eye-like windows.\n\nNevertheless, in this mansion of gloom I now proposed to\nmyself a sojourn of some weeks.  Its proprietor, Roderick Usher,\nhad been one of my boon companions in boyhood; but many years had\nelapsed since our last meeting.  A letter, however, had lately\nreached me in a distant part of the country--a letter from\nhim--which, in its wildly importunate nature, had admitted of no\nother than a personal reply.  The MS gave evidence of nervous\nagitation.  The writer spoke of acute bodily illness--of a mental\ndisorder which oppressed him--and of an earnest desire to see me,\nas his best, and indeed his only personal friend, with a view of\nattempting, by the cheerfulness of my society, some alleviation\nof his malady.  It was the manner in which all this, and much\nmore, was said--it was the apparent heart that went with his\nrequest--which allowed me no room for hesitation; and I\naccordingly obeyed forthwith what I still considered a very\nsingular summons.\n\nAlthough, as boys, we had been even intimate associates, yet\nI really knew little of my friend.  His reserve had been always\nexcessive and habitual.  I was aware, however, that his very\nancient family had been noted, time out of mind, for a peculiar\nsensibility of temperament, displaying itself, through long ages,\nin many works of exalted art, and manifested, of late, in\nrepeated deeds of munificent yet unobtrusive charity, as well as\nin a passionate devotion to the intricacies, perhaps even more\nthan to the orthodox and easily recognisable beauties of musical\nscience.  I had learned, too, the very remarkable fact, that the\nstem of the Usher race, all time-honoured as it was, had put\nforth, at no period, any enduring branch; in other words, that\nthe entire family lay in the direct line of descent, and had\nalways, with very trifling and very temporary variation, so lain.\nIt was this deficiency, I considered, while running over in\nthought the perfect keeping of the character of the premises with\nthe accredited character of the people, and while speculating\nupon the possible influence which the one, in the long\nlapse of centuries, might have exercised upon the other--it was\nthis deficiency, perhaps, of collateral issue, and the consequent\nundeviating transmission, from sire to son, of the patrimony with\nthe name, which had, at length, so identified the two as to merge\nthe original title of the estate in the quaint and equivocal\nappellation of the \"House of Usher\"--an appellation which seemed\nto include, in the minds of the peasantry who used it, both the\nfamily and the family mansion.\n\nI have said that the sole effect of my somewhat childish\nexperiment--that of looking down within the tarn--had been to\ndeepen the first singular impression.  There can be no doubt that\nthe consciousness of the rapid increase of my superstition--for\nwhy should I not so term it?--served mainly to accelerate the\nincrease itself.  Such, I have long known, is the paradoxical law\nof all sentiments having terror as a basis.  And it might have\nbeen for this reason only, that, when I again uplifted my eyes to\nthe house itself, from its image in the pool, there grew in my\nmind a strange fancy--a fancy so ridiculous, indeed, that I but\nmention it to show the vivid force of the sensations which\noppressed me.  I had so worked upon my imagination as really to\nbelieve that about the whole mansion and domain there hung an\natmosphere peculiar to themselves and their immediate vicinity--an\natmosphere which had no affinity with the air of heaven, but\nwhich had reeked up from the decayed trees, and the grey wall,\nand the silent tarn--a pestilent and mystic vapour, dull,\nsluggish, faintly discernible, and leaden-hued.\n\nShaking off from my spirit what must have been a dream,\nI scanned more narrowly the real aspect of the building.  Its\nprincipal feature seemed to be that of an excessive antiquity.\nThe discoloration of ages had been great.  Minute fungi\noverspread the whole exterior, hanging in a fine tangled web-work\nfrom the eaves.  Yet all this was apart from any extraordinary\ndilapidation.  No portion of the masonry had fallen; and there\nappeared to be a wild inconsistency between its still perfect\nadaptation of parts, and the crumbling condition of the\nindividual stones.  In this there was much that reminded me of\nthe specious totality of old wood-work which has rotted for long\nyears in some neglected vault, with no disturbance from the\nbreath of the external air.  Beyond  this indication of\nextensive decay, however, the fabric gave little token of\ninstability.  Perhaps the eye of a scrutinizing observer might\nhave discovered a barely perceptible fissure, which, extending\nfrom the roof of the building in front, made its way down the\nwall in a zigzag direction, until it became lost in the sullen\nwaters of the tarn.\n\nNoticing these things, I rode over a short causeway to the\nhouse.  A servant in waiting took my horse, and I entered the\nGothic archway of the hall.  A valet, of stealthy step, thence\nconducted me, in silence, through many dark and intricate\npassages in my progress to the studio of his master.  Much\nthat I encountered on the way contributed, I know not how, to\nheighten the vague sentiments of which I have already spoken.\nWhile the objects around me--while the carvings of the ceilings,\nthe sombre tapestries of the walls, the ebon blackness of the\nfloors, and the phantasmagoric armorial trophies which rattled as\nI strode, were but matters to which, or to such as which, I had\nbeen accustomed from my infancy--while I hesitated not to\nacknowledge how familiar was all this--I still wondered to find\nhow unfamiliar were the fancies which ordinary images were\nstirring up.  On one of the staircases, I met the physician of\nthe family.  His countenance, I thought, wore a mingled\nexpression of low cunning and perplexity.  He accosted me with\ntrepidation and passed on.  The valet now threw open a door and\nushered me into the presence of his master.\n\nThe room in which I found myself was very large and lofty.\nThe windows were long, narrow, and pointed, and at so vast a\ndistance from the black oaken floor as to be altogether inaccessible\nfrom within.  Feeble gleams of encrimsoned light made their way\nthrough the trellised panes, and served to render sufficiently\ndistinct the more prominent objects around; the eye, however,\nstruggled in vain to reach the remoter angles of the chamber, or\nthe recesses of the vaulted and fretted ceiling.  Dark draperies\nhung upon the walls.  The general furniture was profuse,\ncomfortless, antique, and tattered.  Many books and musical\ninstruments lay scattered about, but failed to give any vitality\nto the scene.  I felt that I breathed an atmosphere of sorrow.\nAn air of stern, deep, and irredeemable gloom hung over and\npervaded all.\n\nUpon my entrance, Usher rose from a sofa on which he had\nbeen lying at full length, and greeted me with a vivacious warmth\nwhich had much in it, I at first thought, of an overdone\ncordiality--of the constrained effort of the ennuye man of\nthe world.  A glance, however, at his countenance, convinced me\nof his perfect sincerity.  We sat down; and for some moments,\nwhile he spoke not, I gazed upon him with a feeling half of pity,\nhalf of awe.  Surely, man had never before so terribly altered,\nin so brief a period, as had Roderick Usher!  It was with\ndifficulty that I could bring myself to admit the identity of the\nwan being before me with the companion of my early boyhood.  Yet\nthe character of his face had been at all times remarkable.  A\ncadaverousness of complexion; an eye large, liquid, and luminous\nbeyond comparison; lips somewhat thin and very pallid, but of a\nsurpassingly beautiful curve; a nose of a delicate Hebrew model,\nbut with a breadth of nostril unusual in similar formations; a\nfinely-moulded chin, speaking, in its want of prominence, of a\nwant of moral energy; hair of a more than web-like softness and\ntenuity; these features, with an inordinate expansion above the\nregions of the temple, made up altogether a countenance not\neasily to be forgotten.  And now in the mere exaggeration of the\nprevailing character of these features, and of the expression\nthey were wont to convey, lay so much of change that I doubted to\nwhom I spoke.  The now ghastly pallor of the skin, and the now\nmiraculous lustre of the eye, above all things startled and even\nawed me.  The silken hair, too, had been suffered to grow all\nunheeded, and as, in its wild gossamer texture, it floated rather\nthan fell about the face, I could not, even with effort, connect\nits Arabesque expression with any idea of simple humanity.\n\nIn the manner of my friend I was at once struck with an\nincoherence--an inconsistency; and I soon found this to arise\nfrom a series of feeble and futile struggles to overcome an\nhabitual trepidancy--an excessive nervous agitation.  For\nsomething of this nature I had indeed been prepared, no less by\nhis letter, than by reminiscences of certain boyish traits, and\nby conclusions deduced from his peculiar physical conformation\nand temperament.  His action was alternately vivacious and\nsullen.  His voice varied rapidly from a tremulous indecision\n(when the animal spirits seemed utterly in abeyance) to\nthat species of energetic concision--that abrupt, weighty,\nunhurried, and hollow-sounding enunciation--that leaden,\nself-balanced and perfectly modulated guttural utterance, which may\nbe observed in the lost drunkard, or the irreclaimable eater of\nopium, during the periods of his most intense excitement.\n\nIt was thus that he spoke of the object of my visit, of his\nearnest desire to see me, and of the solace he expected me to\nafford him.  He entered, at some length, into what he conceived\nto be the nature of his malady.  It was, he said, a\nconstitutional and a family evil, and one for which he despaired\nto find a remedy--a mere nervous affection, he immediately added,\nwhich would undoubtedly soon pass off.  It displayed itself in a\nhost of unnatural sensations.  Some of these, as he detailed\nthem, interested and bewildered me; although, perhaps, the terms,\nand the general manner of the narration had their weight.  He\nsuffered much from a morbid acuteness of the senses; the most\ninsipid food was alone endurable; he could wear only garments of\ncertain texture; the odours of all flowers were oppressive; his\neyes were tortured by even a faint light; and there were but\npeculiar sounds, and these from stringed instruments, which did\nnot inspire him with horror.\n\nTo an anomalous species of terror I found him a bounden\nslave.  \"I shall perish,\" said he, \"I must perish in this\ndeplorable folly.  Thus, thus, and not otherwise, shall I be\nlost.  I dread the events of the future, not in themselves, but\nin their results.  I shudder at the thought of any, even the most\ntrivial, incident, which may operate upon this intolerable\nagitation of soul.  I have, indeed, no abhorrence of danger,\nexcept in its absolute effect--in terror.  In this unnerved--in\nthis pitiable condition--I feel that the period will sooner or\nlater arrive when I must abandon life and reason together, in\nsome struggle with the grim phantasm, FEAR.\"\n\nI learned, moreover, at intervals, and through broken and\nequivocal hints, another singular feature of his mental\ncondition.  He was enchained by certain superstitious impressions\nin regard to the dwelling which he tenanted, and whence, for many\nyears, he had never ventured forth--in regard to an influence\nwhose supposititious force was conveyed in terms too shadowy here\nto be re-stated--an influence which some peculiarities in the\nmere form and substance of his family mansion, had, by\ndint of long sufferance, he said, obtained over his spirit--an\neffect which the physique of the grey walls and turrets, and\nof the dim tarn into which they all looked down, had, at length,\nbrought about upon the morale of his existence.\n\nHe admitted, however, although with hesitation, that much of\nthe peculiar gloom which thus afflicted him could be traced to a\nmore natural and far more palpable origin--to the severe and\nlong-continued illness--indeed to the evidently approaching\ndissolution--of a tenderly beloved sister--his sole companion for\nlong years--his last and only relative on earth.  \"Her decease,\"\nhe said, with a bitterness which I can never forget, \"would leave\nhim (him the hopeless and the frail) the last of the ancient race\nof the Ushers.\"  While he spoke, the lady Madeline (for so was\nshe called) passed slowly through a remote portion of the\napartment, and, without having noticed my presence, disappeared.\nI regarded her with an utter astonishment not unmingled with\ndread--and yet I found it impossible to account for such\nfeelings.  A sensation of stupor oppressed me, as my eyes\nfollowed her retreating steps.  When a door, at length, closed\nupon her, my glance sought instinctively and eagerly the\ncountenance of the brother--but he had buried his face in his\nhands, and I could only perceive that a far more than ordinary\nwanness had overspread the emaciated fingers through which\ntrickled many passionate tears.\n\nThe disease of the lady Madeline had long baffled the skill\nof her physicians.  A settled apathy, a gradual wasting away of\nthe person, and frequent although transient affections of a\npartially cataleptical character, were the unusual diagnosis.\nHitherto she had steadily borne up against the pressure of her\nmalady, and had not betaken herself finally to bed; but, on the\nclosing in of the evening of my arrival at the house, she\nsuccumbed (as her brother told me at night with inexpressible\nagitation) to the prostrating power of the destroyer; and I\nlearned that the glimpse I had obtained of her person would thus\nprobably be the last I should obtain--that the lady, at least\nwhile living, would be seen by me no more.\n\nFor several days ensuing, her name was unmentioned by either\nUsher or myself: and during this period I was busied in earnest\nendeavours to alleviate the melancholy of my friend.  We\npainted and read together; or I listened, as if in a dream, to\nthe wild improvisations of his speaking guitar.  And thus, as a\ncloser and still closer intimacy admitted me more unreservedly\ninto the recesses of his spirit, the more bitterly did I perceive\nthe futility of all attempt at cheering a mind from which\ndarkness, as if an inherent positive quality, poured forth upon\nall objects of the moral and physical universe, in one unceasing\nradiation of gloom.\n\nI shall ever bear about me a memory of the many solemn hours\nI thus spent alone with the master of the House of Usher.  Yet I\nshould fail in any attempt to convey an idea of the exact\ncharacter of the studies, or of the occupations, in which he\ninvolved me, or led me the way.  An excited and highly\ndistempered ideality threw a sulphureous lustre over all.  His\nlong improvised dirges will ring for ever in my ears.  Among\nother things, I hold painfully in mind a certain singular\nperversion and amplification of the wild air of the last waltz of\nVon Weber.  From the paintings over which his elaborate fancy\nbrooded, and which grew, touch by touch, into vagueness at which\nI shuddered the more thrillingly, because I shuddered knowing not\nwhy;--from these paintings (vivid as their images now are before\nme) I would in vain endeavour to educe more than a small portion\nwhich should lie within the compass of merely written words.  By\nthe utter simplicity, by the nakedness of his designs, he\narrested and overawed attention.  If ever mortal painted an idea,\nthat mortal was Roderick Usher.  For me at least--in the\ncircumstances then surrounding me--there arose out of the pure\nabstractions which the hypochondriac contrived to throw upon his\ncanvas, an intensity of intolerable awe, no shadow of which felt\nI ever yet in the contemplation of the certainly glowing yet too\nconcrete reveries of Fuseli.\n\nOne of the phantasmagoric conceptions of my friend,\npartaking not so rigidly of the spirit of abstraction, may be\nshadowed forth, although feebly, in words.  A small picture\npresented the interior of an immensely long and rectangular vault\nor tunnel, with low walls, smooth, white, and without\ninterruption or device.  Certain accessory points of the design\nserved well to convey the idea that this excavation lay at an\nexceeding depth below the surface of the earth.  No outlet was\nobserved in any portion of its vast extent, and no torch,\nor other artificial source of light was discernible; yet a flood\nof intense rays rolled throughout, and bathed the whole in a\nghastly and inappropriate splendour.\n\nI have just spoken of that morbid condition of the auditory\nnerve which rendered all music intolerable to the sufferer, with\nthe exception of certain effects of stringed instruments.  It\nwas, perhaps, the narrow limits to which he thus confined himself\nupon the guitar, which gave birth, in great measure, to the\nfantastic character of the performances.  But the fervid\nfacility of his impromptus could not be so accounted for.\nThey must have been, and were, in the notes, as well as in the\nwords of his wild fantasias (for he not unfrequently accompanied\nhimself with rhymed verbal improvisations), the result of that\nintense mental collectedness and concentration to which I have\npreviously alluded as observable only in particular moments of\nthe highest artificial excitement.  The words of one of these\nrhapsodies I have easily remembered.  I was, perhaps, the more\nforcibly impressed with it, as he gave it, because, in the under\nor mystic current of its meaning, I fancied that I perceived, and\nfor the first time, a full consciousness on the part of Usher, of\nthe tottering of his lofty reason upon her throne.  The verses,\nwhich were entitled \"The Haunted Palace,\" ran very nearly, if not\naccurately, thus:\n\n\n                            I.\n\n               In the greenest of our valleys,\n                 By good angels tenanted,\n               Once a fair and stately palace--\n                 Radiant palace--reared its head.\n               In the monarch Thought's dominion--\n                 It stood there!\n               Never seraph spread a pinion\n                 Over fabric half so fair.\n\n\n                           II.\n\n               Banners yellow, glorious, golden,\n                 On its roof did float and flow;\n               (This--all this--was in the olden\n                 Time long ago)\n               And every gentle air that dallied,\n                 In that sweet day,\n               Along the ramparts plumed and pallid,\n                 A winged odour went away.\n\n\n                           III.\n\n               Wanderers in that happy valley\n                 Through two luminous windows saw\n               Spirits moving musically\n                 To a lute's well tuned law,\n               Round about a throne, where sitting\n                 (Porphyrogene!)\n               In state his glory well befitting,\n                 The ruler of the realm was seen.\n\n\n                           IV.\n\n               And all with pearl and ruby glowing\n                 Was the fair palace door,\n               Through which came flowing, flowing, flowing\n                 And sparkling evermore,\n               A troop of Echoes whose sweet duty\n                 Was but to sing,\n               In voices of surpassing beauty,\n                 The wit and wisdom of their king.\n\n\n                            V.\n\n               But evil things, in robes of sorrow,\n                 Assailed the monarch's high estate;\n               (Ah, let us mourn, for never morrow\n                 Shall dawn upon him, desolate!)\n               And, round about his home, the glory\n                 That blushed and bloomed\n               Is but a dim-remembered story,\n                 Of the old time entombed.\n\n\n                           VI.\n\n               And travellers now within that valley,\n                 Through the red-litten windows, see\n               Vast forms that move fantastically\n                 To a discordant melody;\n               While, like a rapid ghastly river,\n                 Through the pale door,\n               A hideous throng rush out forever,\n                 And laugh--but smile no more.\n\n\nI well remember that suggestions arising from this ballad,\nled us into a train of thought wherein there became manifest an\nopinion of Usher's which I mention not so much on account of its\nnovelty (for other men* have thought thus,) as on account of the\npertinacity with which he maintained it.  This opinion, in its\ngeneral form, was that of the sentience of all vegetable things.\nBut, in his disordered fancy, the idea had assumed a more daring\ncharacter, and trespassed, under certain conditions, upon the\nkingdom of inorganization.  I lack words to express the full\nextent, or the earnest abandon of his persuasion.  The\nbelief, however, was connected (as I have previously hinted) with\nthe gray stones of the home of his forefathers.  The conditions\nof the sentience had been here, he imagined, fulfilled in the\nmethod of collocation of these stones--in the order of their\narrangement, as well as in that of the many fungi which\noverspread them, and of the decayed trees which stood around--above\nall, in the long undisturbed endurance of this arrangement,\nand in its reduplication in the still waters of the tarn.  Its\nevidence--the evidence of the sentience--was to be seen, he said,\n(and I here started as he spoke,) in the gradual yet certain\ncondensation of an atmosphere of their own about the waters and\nthe walls.  The result was discoverable, he added, in that\nsilent, yet importunate and terrible influence which for\ncenturies had moulded the destinies of his family, and which made\nhim what I now saw him--what he was.  Such opinions need no\ncomment, and I will make none.\n\nOur books--the books which, for years, had formed no small\nportion of the mental existence of the invalid--were, as might be\nsupposed, in strict keeping with this character of phantasm.  We\npored together over such works as the Ververt et Chartreuse\nof Gresset; the Belphegor of Machiavelli; the Heaven and\nHell of Swedenborg; the Subterranean Voyage of Nicholas Klimm by\nHolberg; the Chiromancy of Robert Flud, of Jean D'Indagine,\nand of De la Chambre; the Journey into the Blue Distance of\nTieck; and the City of the Sun by Campanella.  One favourite\nvolume was a small octavo edition of the Directorium\nInquisitorum, by the Dominican Eymeric de Gironne; and there\nwere passages in Pomponius Mela, about the old African Satyrs\nand OEgipans, over which Usher would sit dreaming for hours.  His\nchief delight, however, was found in the perusal of an\nexceedingly rare and curious book in quarto Gothic--the manual of\na forgotten church--the Vigiliae Mortuorum Secundum Chorum Ecclesiae\nMaguntinae.\n\nI could not help thinking of the wild ritual of this work,\nand of its probable influence upon the hypochondriac, when, one\nevening, having informed me abruptly that the lady Madeline was\nno more, he stated his intention of preserving her corpse for a\nfortnight, (previously to its final interment), in one of the\nnumerous vaults within the main walls of the building.  The\nworldly reason, however, assigned for this singular proceeding,\nwas one which I did not feel at liberty to dispute.  The brother\nhad been led to his resolution (so he told me) by consideration\nof the unusual character of the malady of the deceased, of\ncertain obtrusive and eager inquiries on the part of her medical\nmen, and of the remote and exposed situation of the burial-ground\nof the family.  I will not deny that when I called to mind the\nsinister countenance of the person whom I met upon the staircase,\non the day of my arrival at the house, I had no desire to oppose\nwhat I regarded as at best but a harmless, and by no means an\nunnatural, precaution.\n\nAt the request of Usher, I personally aided him in the\narrangements for the temporary entombment.  The body having been\nencoffined, we two alone bore it to its rest.  The vault in which\nwe placed it (and which had been so long unopened that our\ntorches, half smothered in its oppressive atmosphere, gave us\nlittle opportunity for investigation) was small, damp, and\nentirely without means of admission for light; lying, at great\ndepth, immediately beneath that portion of the building in which\nwas my own sleeping apartment.  It had been used, apparently, in\nremote feudal times, for the worst purposes of a donjon-keep, and,\nin later days, as a place of deposit for powder, or some other\nhighly combustible substance, as a portion of its floor,\nand the whole interior of a long archway through which we reached\nit, were carefully sheathed with copper.  The door, of massive\niron, had been, also, similarly protected.  Its immense weight\ncaused an unusually sharp grating sound, as it moved upon its hinges.\n\nHaving deposited our mournful burden upon tressels within\nthis region of horror, we partially turned aside the yet\nunscrewed lid of the coffin, and looked upon the face of the\ntenant.  A striking similitude between the brother and sister now\nfirst arrested my attention; and Usher, divining, perhaps, my\nthoughts, murmured out some few words from which I learned that\nthe deceased and himself had been twins, and that sympathies of a\nscarcely intelligible nature had always existed between them.\nOur glances, however, rested not long upon the dead--for we could\nnot regard her unawed.  The disease which had thus entombed the\nlady in the maturity of youth, had left, as usual in all maladies\nof a strictly cataleptical character, the mockery of a faint\nblush upon the bosom and the face, and that suspiciously\nlingering smile upon the lip which is so terrible in death.  We\nreplaced and screwed down the lid, and, having secured the door\nof iron, made our way, with toil, into the scarcely less gloomy\napartments of the upper portion of the house.\n\nAnd now, some days of bitter grief having elapsed, an\nobservable change came over the features of the mental disorder\nof my friend.  His ordinary manner had vanished.  His ordinary\noccupations were neglected or forgotten.  He roamed from chamber\nto chamber with hurried, unequal, and objectless step.  The\npallor of his countenance had assumed, if possible, a more\nghastly hue--but the luminousness of his eye had utterly gone\nout.  The once occasional huskiness of his tone was heard no\nmore; and a tremulous quaver, as if of extreme terror, habitually\ncharacterized his utterance.  There were times, indeed, when I\nthought his unceasingly agitated mind was labouring with some\noppressive secret, to divulge which he struggled for the\nnecessary courage.  At times, again, I was obliged to resolve all\ninto the mere inexplicable vagaries of madness, for I beheld him\ngazing upon vacancy for long hours, in an attitude of the\nprofoundest attention, as if listening to some imaginary\nsound.  It was no wonder that his condition terrified--that it\ninfected me.  I felt creeping upon me, by slow yet certain\ndegrees, the wild influences of his own fantastic yet impressive\nsuperstitions.\n\nIt was, especially, upon retiring to bed late in the night\nof the seventh or eighth day after the placing of the lady\nMadeline within the donjon, that I experienced the full power of\nsuch feelings.  Sleep came not near my couch--while the hours\nwaned and waned away.  I struggled to reason off the nervousness\nwhich had dominion over me.  I endeavoured to believe that much,\nif not all of what I felt, was due to the bewildering influence\nof the gloomy furniture of the room--of the dark and tattered\ndraperies, which, tortured into motion by the breath of a rising\ntempest, swayed fitfully to and fro upon the walls, and rustled\nuneasily about the decorations of the bed.  But my efforts were\nfruitless.  An irrepressible tremor gradually pervaded my frame;\nand, at length, there sat upon my very heart an incubus of\nutterly causeless alarm.  Shaking this off with a gasp and a\nstruggle, I uplifted myself upon the pillows, and, peering\nearnestly within the intense darkness of the chamber, hearkened--I\nknow not why, except that an instinctive spirit prompted me--to\ncertain low and indefinite sounds which came, through the pauses\nof the storm, at long intervals, I knew not whence.  Overpowered\nby an intense sentiment of horror, unaccountable yet unendurable,\nI threw on my clothes with haste (for I felt that I should sleep\nno more during the night,) and endeavoured to arouse myself from\nthe pitiable condition into which I had fallen, by pacing rapidly\nto and fro through the apartment.\n\nI had taken but few turns in this manner, when a light step\non an adjoining staircase arrested my attention.  I presently\nrecognized it as that of Usher.  In an instant afterwards he\nrapped, with a gentle touch, at my door, and entered, bearing a\nlamp.  His countenance was, as usual, cadaverously wan--but,\nmoreover, there was a species of mad hilarity in his eyes--an\nevidently restrained hysteria in his whole demeanour.  His\nair appalled me--but anything was preferable to the solitude\nwhich I had so long endured, and I even welcomed his presence as\na relief.\n\n\"And you have not seen it?\" he said abruptly, after having\nstared about him for some moments in silence--\"you have\nnot then seen it?--but, stay! you shall.\"  Thus speaking, and\nhaving carefully shaded his lamp, he hurried to one of the\ncasements, and threw it freely open to the storm.\n\nThe impetuous fury of the entering gust nearly lifted us\nfrom our feet.  It was, indeed, a tempestuous yet sternly\nbeautiful night, and one wildly singular in its terror and its\nbeauty.  A whirlwind had apparently collected its force in our\nvicinity; for there were frequent and violent alterations in the\ndirection of the wind; and the exceeding density of the clouds\n(which hung so low as to press upon the turrets of the house) did\nnot prevent our perceiving the lifelike velocity with which they\nflew careering from all points against each other, without\npassing away into the distance.  I say that even their exceeding\ndensity did not prevent our perceiving this--yet we had no\nglimpse of the moon or stars--nor was there any flashing forth of\nthe lightning.  But the under surfaces of the huge masses of\nagitated vapor, as well as all terrestrial objects immediately\naround us, were glowing in the unnatural light of a faintly\nluminous and distinctly visible gaseous exhalation which hung\nabout and enshrouded the mansion.\n\n\"You must not--you shall not behold this!\" said I,\nshudderingly, to Usher, as I led him, with a gentle violence,\nfrom the window to a seat.  \"These appearances, which bewilder\nyou, are merely electrical phenomena not uncommon--or it may be\nthat they have their ghastly origin in the rank miasma of the\ntarn.  Let us close this casement;--the air is chilling and\ndangerous to your frame.  Here is one of your favourite romances.\nI will read, and you shall listen;--and so we will pass away this\nterrible night together.\"\n\nThe antique volume which I had taken up was the \"Mad\nTrist\" of Sir Launcelot Canning; but I had called it a favourite\nof Usher's more in sad jest than in earnest; for, in truth, there\nis little in its uncouth and unimaginative prolixity which could\nhave had interest for the lofty and spiritual ideality of my\nfriend.  It was, however, the only book immediately at hand; and\nI indulged a vague hope that the excitement which now agitated\nthe hypochondriac, might find relief (for the history of mental\ndisorder is full of similar anomalies) even in the extremeness of\nthe folly which I should read.  Could I have judged, indeed, by\nthe wild overstrained air of vivacity with which he\nhearkened, or apparently hearkened, to the words of the tale, I\nmight well have congratulated myself upon the success of my\ndesign.\n\nI had arrived at that well-known portion of the story where\nEthelred, the hero of the Trist, having sought in vain for\npeaceable admission into the dwelling of the hermit, proceeds to\nmake good an entrance by force.  Here, it will be remembered, the\nwords of the narrative run thus:\n\n\"And Ethelred, who was by nature of a doughty heart, and who\nwas now mighty withal, on account of the powerfulness of the wine\nwhich he had drunken, waited no longer to hold parley with the\nhermit, who, in sooth, was of an obstinate and maliceful turn,\nbut, feeling the rain upon his shoulders, and fearing the rising\nof the tempest, uplifted his mace outright, and, with blows, made\nquickly room in the plankings of the door for his gauntleted\nhand; and now pulling therewith sturdily, he so cracked, and\nripped, and tore all asunder, that the noise of the dry and\nhollow-sounding wood alarmed and reverberated throughout the\nforest.\"\n\nAt the termination of this sentence I started, and for a\nmoment, paused; for it appeared to me (although I at once\nconcluded that my excited fancy had deceived me)--it appeared to\nme that, from some very remote portion of the mansion, there\ncame, indistinctly, to my ears, what might have been, in its\nexact similarity of character, the echo (but a stifled and dull\none certainly) of the very cracking and ripping sound which Sir\nLauncelot had so particularly described.  It was, beyond doubt,\nthe coincidence alone which had arrested my attention; for, amid\nthe rattling of the sashes of the casements, and the ordinary\ncommingled noises of the still increasing storm, the sound, in\nitself, had nothing, surely, which should have interested or\ndisturbed me.  I continued the story:\n\n\"But the good champion Ethelred, now entering within the\ndoor, was sore enraged and amazed to perceive no signal of the\nmaliceful hermit; but, in the stead thereof, a dragon of a scaly\nand prodigious demeanour, and of a fiery tongue, which sate in\nguard before a palace of gold, with a floor of silver; and upon\nthe wall there hung a shield of shining brass with this legend\nenwritten--\n\n     Who entereth herein, a conquerer hath bin;\n     Who slayeth the dragon, the shield he shall win;\n\nand Ethelred uplifted his mace, and struck upon the head of the\ndragon, which fell before him, and gave up his pesty breath, with\na shriek so horrid and harsh, and withal so piercing, that\nEthelred had fain to close his ears with his hands against the\ndreadful noise of it, the like whereof was never before heard.\"\n\nHere again I paused abruptly, and now with a feeling of wild\namazement--for there could be no doubt whatever that, in this\ninstance, I did actually hear (although from what direction it\nproceeded I found it impossible to say) a low and apparently\ndistant, but harsh, protracted, and most unusual screaming or\ngrating sound--the exact counterpart of what my fancy had already\nconjured up for the dragon's unnatural shriek as described by the\nromancer.\n\nOppressed, as I certainly was, upon the occurrence of the\nsecond and most extraordinary coincidence, by a thousand\nconflicting sensations, in which wonder and extreme terror were\npredominant, I still retained sufficient presence of mind to\navoid exciting, by any observation, the sensitive nervousness of\nmy companion.  I was by no means certain that he had noticed the\nsounds in question; although, assuredly, a strange alteration\nhad, during the last few minutes, taken place in his demeanour.\nFrom a position fronting my own, he had gradually brought round\nhis chair, so as to sit with his face to the door of the chamber;\nand thus I could but partially perceive his features, although I\nsaw that his lips trembled as if he were murmuring inaudibly.\nHis head had dropped upon his breast--yet I knew that he was not\nasleep, from the wide and rigid opening of the eye as I caught a\nglance of it in profile.  The motion of his body, too, was at\nvariance with this idea--for he rocked from side to side with a\ngentle yet constant and uniform sway.  Having rapidly taken\nnotice of all this, I resumed the narrative of Sir Launcelot,\nwhich thus proceeded:\n\n\"And now, the champion, having escaped from the terrible\nfury of the dragon, bethinking himself of the brazen shield, and\nof the breaking up of the enchantment which was upon it, removed\nthe carcass from out of the way before him, and approached\nvalorously over the silver pavement of the castle to where\nthe shield was upon the wall; which in sooth tarried not for his\nfull coming, but fell down at his feet upon the silver floor,\nwith a mighty great and terrible ringing sound.\"\n\nNo sooner had these syllables passed my lips, than--as if a\nshield of brass had indeed, at the moment, fallen heavily upon a\nfloor of silver--I became aware of a distinct, hollow, metallic,\nand clangorous, yet apparently muffled reverberation.  Completely\nunnerved, I leaped to my feet; but the measured rocking movement\nof Usher was undisturbed.  I rushed to the chair in which he sat.\nHis eyes were bent fixedly before him, and throughout his whole\ncountenance there reigned a stony rigidity.  But, as I placed my\nhand upon his shoulder, there came a strong shudder over his\nwhole person; a sickly smile quivered about his lips; and I saw\nthat he spoke in a low, hurried, and gibbering murmur, as if\nunconscious of my presence.  Bending closely over him, I at\nlength drank in the hideous import of his words.\n\n\"Not hear it?--yes, I hear it, and have heard it.\nLong--long--long--many minutes, many hours, many days, have I heard\nit--yet I dared not--oh, pity me, miserable wretch that I am!--I\ndared not--I dared not speak!  We have put her living in\nthe tomb!  Said I not that my senses were acute?  I now tell\nyou that I heard her first feeble movements in the hollow coffin.\nI heard them--many, many days ago--yet I dared not--I dared\nnot speak!  And now--to-night--Ethelred--ha! ha!--the breaking\nof the hermit's door, and the death-cry of the dragon, and the\nclangour of the shield!--say, rather, the rending of her coffin,\nand the grating of the iron hinges of her prison, and her\nstruggles within the coppered archway of the vault!  Oh whither\nshall I fly?  Will she not be here anon?  Is she not hurrying to\nupbraid me for my haste?  Have I not heard her footsteps on the\nstair?  Do I not distinguish that heavy and horrible beating of\nher heart?  Madman!\" here he sprang furiously to his feet, and\nshrieked out his syllables, as if in the effort he were giving up\nhis soul--\"Madman!  I tell you that she now stands without the\ndoor!\"\n\nAs if in the superhuman energy of his utterance there had\nbeen found the potency of a spell--the huge antique panels to\nwhich the speaker pointed, threw slowly back, upon the instant,\ntheir ponderous and ebony jaws.  It was the work of the\nrushing gust--but then without those doors there DID stand the\nlofty and enshrouded figure of the lady Madeline of Usher.  There\nwas blood upon her white robes, and the evidence of some bitter\nstruggle upon every portion of her emaciated frame.  For a moment\nshe remained trembling and reeling to and fro upon the threshold,--then,\nwith a low moaning cry, fell heavily inward upon the person\nof her brother, and in her violent and now final death-agonies,\nbore him to the floor a corpse, and a victim to the terrors he\nhad anticipated.\n\nFrom that chamber, and from that mansion, I fled aghast.\nThe storm was still abroad in all its wrath as I found myself\ncrossing the old causeway.  Suddenly there shot along the path a\nwild light, and I turned to see whence a gleam so unusual could\nhave issued; for the vast house and its shadows were alone behind\nme.  The radiance was that of the full, setting, and blood-red\nmoon which now shone vividly through that once barely-discernible\nfissure of which I have before spoken as extending from the roof\nof the building, in a zigzag direction, to the base.  While I\ngazed, this fissure rapidly widened--there came a fierce breath\nof the whirlwind--the entire orb of the satellite burst at once\nupon my sight--my brain reeled as I saw the mighty walls rushing\nasunder--there was a long tumultuous shouting sound like the\nvoice of a thousand waters--and the deep and dank tarn at my feet\nclosed sullenly and silently over the fragments of the \"House of\nUsher\".\n\n\n* Watson, Dr Percival, Spallanzani, and especially the Bishop of Landaff.", "title": "The Fall of the House of Usher"}