{"title": "12 Years A Slave", "full_text": "12 Years a Slave\nWriters :   John Ridley\nGenres :   Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "In 1841, Solomon Northup is a free African-American man working as a violinist, who lives with his wife, Anne Hampton, and two children, Margaret and Alonzo, in Saratoga Springs, New York. Two men, Brown and Hamilton, offer him a two-week job as a musician if he will travel to Washington, D.C., with them. Once there, they drug Northup and deliver him to a slave pen owned by James Burch.\nNorthup is shipped to New Orleans along with others who have been captured. A slave trader named Freeman gives Northup the identity of \"Platt\", a runaway slave from Georgia, and sells him to plantation owner William Ford. Northup impresses Ford when he engineers a waterway for transporting logs swiftly and cost-effectively across a swamp, and Ford presents him with a violin in gratitude. Northup carves the names of his wife and children into the violin.\nFord's carpenter John Tibeats resents Northup, and the tensions between them escalate. Tibeats attacks Northup, but Northup overpowers him and beats him. In retaliation, Tibeats and his friends attempt to lynch Northup, but they are prevented by Ford's overseer, Chapin, though Northup is left in the noose standing on tiptoe for many hours. Ford finally cuts Northup down, but chooses to sell him to planter Edwin Epps to protect him from Tibeats. Northup attempts to explain that he is actually a free man, but Ford states that he \"cannot hear this\" and responds \"he has a debt to pay\" on Northup's purchase price.\nIn contrast to the relatively benevolent Ford, Epps is a sadist who believes he has a biblically sanctioned right to abuse his slaves. Epps beats his slaves if they fail to pick at least 200 pounds (91 kg) of cotton every day. Epps is sexually attracted to Patsey, a young female slave who picks more than 500 pounds (230 kg) daily, and repeatedly rapes her. Epps' wife becomes jealous and frequently humiliates and degrades Patsey. Patsey's only comfort is visiting Mistress Shaw, a former slave whose owner fell in love with her and elevated her to Mistress. Patsey begs Northup to kill her, but he refuses.\nSome time later, an outbreak of cotton worm befalls Epps' plantation. Unable to work his fields, he leases his slaves to a neighboring plantation for the season. While there, Northup gains the favor of the plantation's owner, Judge Turner, who allows him to play the fiddle at a neighbor's wedding anniversary celebration, and to keep his earnings. When Northup returns to Epps, he attempts to use the money to pay a white field hand and former overseer, Armsby, to mail a letter to Northup's friends in New York state. Armsby agrees to deliver the letter, and accepts all Northup's saved money, but betrays him to Epps. Northup is narrowly able to convince Epps that Armsby is lying and avoids punishment. Northup tearfully burns the letter, his only hope of freedom.\nNorthup begins working on the construction of a gazebo with a Canadian laborer named Samuel Bass. Bass is unsettled by the brutal way that Epps treats his slaves and expresses his opposition to slavery, earning Epps's enmity. One day, Epps becomes enraged after discovering Patsey missing from the plantation. When she returns, she reveals she was gone to get a bar of soap from Mistress Shaw. Epps does not believe her and orders her flogged. Encouraged by his wife, Epps forces Northup to flog Patsey to avoid doing it himself. Northup reluctantly obeys, but Epps eventually takes the whip away from Northup, savagely lashing Patsey.\nNorthup purposely destroys his violin, and while continuing to work on the gazebo, Northup confides his kidnapping to Bass. Once again, Northup asks for help in getting a letter to Saratoga Springs. Bass, risking his life, agrees to send it.\nOne day, Northup is called over by the local sheriff, who arrives in a carriage with another man. The sheriff asks Northup a series of questions to confirm his answers match the facts of his life in New York. Northup recognizes the sheriff's companion as Mr. Parker, a shopkeeper he knew in Saratoga. Parker has come to free him, and the two embrace, though an enraged Epps furiously protests the circumstances and tries to prevent him from leaving. Before Northup can board the coach to leave, Patsey cries out to him, and they embrace in a bittersweet farewell. Knowing that he is in potential danger, Northup leaves the plantation.\nAfter being enslaved for 12 years, Northup is restored to freedom and returned to his family. As he walks into his home, he sees Anne, Alonzo, Margaret and her husband, who present him with his grandson and namesake, Solomon Northup Staunton. Concluding credits recount Northup's unsuccessful suits against Brown, Hamilton and Burch, the 1853 publication of Northup's slave narrative memoir, Twelve Years a Slave, his role in the abolitionist movement, and the mystery surrounding details of his death and burial."}