{"title": "Bad Santa", "full_text": "\"BAD SANTA\"\n\n                                            by\n\n                                Glenn Ficarra & John Requa\n\n                                       Revisions by\n\n                                  Ethan Coen & Joel Coen\n\n                                        Polish by\n\n                                      Terry Zwigoff\n\n                                     Dimension Films\n\n                        Production Draft - WHITE February 1, 2002\n\n                \n\n               FADE IN:\n\n               Snow flakes falling against a black sky.\n\n               CAMERA FOLLOWS THEM DOWNWARD TO REVEAL\n\n               EXT. MILWAUKEE BAR - NIGHT\n\n               It looks like a warm cozy place out of \"It's A Wonderful \n               Life\". The window is flocked with fake snow, and hung with \n               colorful Christmas lights, wreaths and ornaments.\n\n               CAMERA PUSHES SLOWLY IN\n\n                                                               DISSOLVE TO:\n\n               INT. MILWAUKEE BAR - NIGHT\n\n               CAMERA CONTINUES MOVEMENT IN SAME DIRECTION\n\n                                       TITLES BEGIN\n\n               The barman, wiping down the counter, gives an occasional \n               semi-furtive glance toward the far end of the bar.\n\n               Other patrons chat near the bartender and also give occasional \n               glances toward the far end of the bar. It is early evening -- \n               happy hour -- and the clientele is well-heeled and sociable.\n\n               A customer says something interrogative to the bartender, \n               who looks down the bar and shrugs.\n\n               REVERSE - CAMERA CONTINUES MOVEMENT (Notes the combination \n               of the HIGH ANGLE and the tilt of Santa's head keep his face \n               from being clearly revealed in this scene).\n\n               Sitting alone at the far end of the bar, given a wide berth \n               by the other customers, a man (WILLIE) stares morosely into \n               his drink. The drink is clearly not his first.\n\n               He wears a red velvet suit and red velvet hat with a white \n               pom-pom. He has shiny black boots with red velvet trim. His \n               long white beard is not real and is in fact pulled down below \n               his chin to facilitate drinking. It exposes heavy black \n               stubble.\n\n               Swaying slightly, he raises the drink to the vicinity of his \n               lips. Once it gets close he must navigate it in with some \n               effortful coordination. He takes a sip and sets the drink \n               carefully back down.\n\n               After another long, staring, morose beat, he starts weeping.\n\n               It is loud, dolorous, and unself-conscious.\n\n               EXT. ALLEYWAY BEHIND THE MILWAUKEE BAR - NIGHT\n\n               Santa staggers out the back door...\n\n               CAMERA FOLLOWS BEHIND HIM still hiding his face.\n\n               Santa gets about ten feet, then pauses and leans with one \n               hand against the alley wall, uses the other to hold his pom-\n               pom out of the way, and vomits.\n\n               Having vomited, and spit, he staggers off toward the street.\n\n               SUPERED TITLE OF THE MOVIE:\n\n                                        BAD SANTA\n\n               INT. SANTA ORIENTATION ROOM - DAY\n\n               An upbeat woman TRAINER presides over a half-dozen SANTAS \n               sitting at school desks. On the blackboard the Trainer is \n               writing out the sixth \"Santa Commandment\".\n\n                                 SANTA'S TEN COMMANDMENTS\n\n               1) No alcoholic beverages before or during your shift.\n               2) Know the names of your reindeer.\n               3) Do not smoke in your costume.\n               4) No swearing.\n               5) Absolutely no flirting.\n               6) Coax a smile from the child.\n               7)\n               8)\n               9)\n\n                                     TRAINER\n                              (as she writes)\n                         Coax... a... smile... from... the \n                         child.\n                              (turning to face them)\n                         Remember, parents don't want photos \n                         where their child isn't smiling. \n                         Some children may not want to smile. \n                         It is your job to coax a smile out \n                         of them. A good line to remember is:\n                         \"Santa thinks everybody should be \n                         happy. Can you smile for Santa?\" A \n                         camera can only copy a child's smile -- \n                         it will take you to put it there.\n\n               As she talks we\n\n                                                                    CUT TO:\n\n               ANGLE FROM BEHIND\n\n               one of the Santas (WILLIE). His HAND reaches into a boot and \n               pulls out a pint of Smirnoff. We FOLLOW UP IN C.U. to see \n               this hand pour a few ounces into a can of Coke he holds behind \n               his desk.\n\n                                     TRAINER\n                         If the child will not smile, the \n                         Photo Elf will go ahead and take the \n                         picture anyway. Now, it is a good \n                         Santa's job to smile as well -- I \n                         know with the big white beard your \n                         smile will be partially hidden, so \n                         you must learn to smile with your \n                         eyes. They show warmth and can be \n                         very expressive.\n\n                                                                    CUT TO:\n\n               WILLIE'S FACE\n\n               as he finishes off the can of Coke to REVEAL: his eyes colder \n               than those of a dead fish.\n\n                                     TRAINER\n                         Remember you have been chosen for \n                         the starring role of Santa Claus. \n                         Your portrayal of this beloved \n                         character will have a major impact \n                         on every child you meet. Keep in \n                         mind at all times that to them, you \n                         aren't a man dressed up like Santa, \n                         you are Santa.\n\n                                                               CUT BACK TO:\n\n               WILLIE'S FACE. His expression reads: \"Please kill me\".\n\n               EXT. DOWNTOWN MILWAUKEE SHOPPING DISTRICT - NIGHT\n\n               Wintry night. Ray Coniff's \"Jolly Ole Saint Nicholas\" scores \n               views of the downtown blanketed in snow and decorated for \n               the holiday. It is Christmas Eve, and the sidewalks throng \n               with people rushing to do their last-minute shopping.\n\n               A MOTHER and her two absurdly bundled CHILDREN emerge from \n               the crowd.\n\n                                     MOTHER\n                         Hurry boys, we're gonna miss Santa! \n                         She drags them across the street \n                         toward the looming art-deco monolith \n                         that is the big-city department store.\n\n               INT. MILWAUKEE DEPARTMENT STORE - TOP FLOOR - NIGHT\n\n               Mother and children crest the escalator to emerge on the top \n               floor.\n\n                                     OLDER CHILD\n                         There! \n\n               The older child is pointing at a prop gate with a candy-cane \n               letter sign: TO SANTA'S WORKSHOP.\n\n               He runs and Mom shoos her younger child to join him.\n\n               The boys cross the threshold of the gate and their eyes filled \n               with wonder.\n\n               A winding path cuts through a flocked and candy-striped \n               forest, past a workshop filled with mannequin-elves busily \n               cobbling Christmas toys, and finally arriving at...\n\n               Santa, seated on his throne like a scarlet Messiah. The \n               younger child staggers forward to join the line of a hundred \n               other leaky-nosed worshippers awaiting an audience.\n\n               At the head of the line the next waiting child is escorted \n               to Santa's chair by a smiling tiny man (MARCUS) dressed as \n               an elf.\n\n               INT. MILWAUKEE DEPARTMENT STORE - MAIN FLOOR - NIGHT\n\n               An imitation BACK STREET BOYS quintet sings Christmas Carols.\n\n               Grown-ups busy themselves draining their wallets as a VOICE \n               comes over the intercom:\n\n                                     INTERCOM (V.O.)\n                         Attention shoppers: the store will \n                         be closing in five minutes. We hope \n                         tomorrow is a pleasant Christmas and \n                         thank you for shopping with us, your \n                         friends.\n\n               Purposeful haste eddies the crowd.\n\n               INT. MILWAUKEE DEPARTMENT STORE - SANTA'S WORKSHOP - NIGHT\n\n               C.U. PHOTO PRINTING OUT\n\n               The Photo Elf takes the digital photo and presents it to a \n               MOM.\n\n                                     PHOTO ELF\n                              (dutifully reciting \n                              his spiel)\n                         My, what a darling picture! Are you \n                         certain you only want the single? \n                         Additional photos come in handy as \n                         gifts for grandma and grandpa or a \n                         wonderful remembrance for friends.\n\n                                     MOM\n                         That's all right, I'll just take the \n                         single.\n\n               He takes her credit card as CAMERA MOVES OVER TO SANTA. On \n               his knee is a YOUNG BOY who whispers excitedly in his ear.\n\n                                     SANTA\n                              (disinterested)\n                         Uh-huh... yeah... done.\n\n               Young Boy climbs off and runs away, A BRATTY KID jumps up on \n               Santa's lap.\n\n                                     BRATTY KID\n                         I saw you in another mall.\n\n                                     SANTA\n                              (not even looking at \n                              him)\n                         Right... Good for you.\n\n                                     BRATTY KID\n                         You're not really Santa. If you were \n                         Santa you could do magic.\n\n                                     SANTA\n                              (looks at him)\n                         You want magic?\n\n               Santa pushes him off his lap and shoves him on his way.\n\n                                     SANTA\n                         There, I just made you disappear.\n\n               Santa turns to his Elf,\n\n                                     SANTA\n                         ...That it?\n\n               The Elf nods as he peels off a pointed prosthetic ear. Santa \n               pulls a fifth of Old Grandad from the cushions of his throne.\n\n                                     SANTA\n                         ...Thank fuckin' Christ.\n\n               He takes a swig.\n\n               INT. MILWAUKEE DEPARTMENT STORE - NIGHT - LATER\n\n               With the sound of closing circuits, banks of lights \n               systematically shut down in the various departments of the \n               now empty store.\n\n               INT. MILWAUKEE DEPARTMENT STORE - EXIT AREA - NIGHT\n\n               Downstairs the last of the store employees file out the door \n               past an old SECURITY GUARD. Eventually Santa emerges.\n\n                                     SECURITY GUARD\n                         Merry Christmas, Willie.\n\n                                     SANTA\n                         Up your ass.\n\n               The guard chuckles.\n\n                                     SECURITY GUARD\n                         Have it your way, Willie.\n\n                                     SANTA\n                         Don't tell me which way to have it.\n\n               The Security Guard heads for a panel near the doorway and \n               punches a key labeled ARM. An L.E.D. readout labeled \"ARMING\" \n               counts down from 30 seconds.\n\n               The guard exits the store, locks the door and heads home.\n\n               INT. MILWAUKEE DEPARTMENT STORE - SANTA'S WORKSHOP - NIGHT\n\n               A large Teddy bear sits under a Christmas tree.\n\n               Suddenly -\u0097 it moves, bolting upright and sprinting from the \n               room.\n\n               INT. MILWAUKEE DEPARTMENT STORE - DOWNSTAIRS - NIGHT\n\n               The alarm continues to count down -- 15... 14...\n\n               The Teddy bear slides down the space between the railing of \n               the escalators. Landing on its feet, it barrels toward the \n               door.\n\n               10... 9... \n\n               The Teddy bear scrambles for the door, crashing into \n               everything in its path.\n\n               7... 6... \n\n               Running past a clothing display, it rips the arm off a \n               mannequin without breaking stride.\n\n               5... 4... \n\n               It skids to a stop at the base of the alarm box, too short \n               to reach the controls.\n\n               2... \n\n               It raises the mannequin arm, using the pointed finger on its \n               hand to press the \"CANCEL\" key on the keypad.\n\n               Mission accomplished, the teddy bear rips off its head to \n               reveal his true identity: Santa's Elf -- in civilian life \n               known as MARCUS SKIDMORE. He is covered in sweat and panting \n               like an asthmatic.\n\n               INT. MILWAUKEE DEPARTMENT STORE - SHIPPING AREA - NIGHT\n\n               A hasp flips open and Marcus swings the door wide to reveal \n               a beer-guzzling Santa-in-the-off-season known as WILLIE T. \n               SOKE. He finishes the beer, crushes the can and drops it to \n               his feet next to eight more empties.\n\n                                     WILLIE\n                         Ready.\n\n               Marcus sneers at him as he lumbers past:\n\n                                     MARCUS\n                         Jesus.\n\n               INT. MILWAUKEE DEPARTMENT STORE - SANTA'S WORKSHOP - NIGHT\n\n               Marcus and Willie tear open the prop presents on the workshop \n               set and remove several tools.\n\n               INT. MILWAUKEE DEPARTMENT STORE - NIGHT\n\n               Marcus reaches into jewelry cases and removes a few particular \n               items. He drops them into a stock cart then checks a typed \n               list before moving on.\n\n               Marcus pushes the cart through the store, gathering an odd \n               array of items that range from furs to gowns to shoes to \n               makeup.\n\n               INT. MILWAUKEE DEPARTMENT STORE - BACK OFFICES - NIGHT\n\n               Marcus arrives outside a doorway and looks in to see Willie \n               manning a large water drill and putting it to work on the \n               store's vault.\n\n                                     MARCUS\n                         How's it goin'?\n\n                                     WILLIE\n                         I'm finished when I'm finished.\n\n                                     MARCUS\n                         I'm goin' downstairs...\n                              (referring to list)\n                         I need a melon-bailer and a loofah.\n\n               The drill suddenly revs higher, getting Willie's attention.\n\n                                     WILLIE\n                         Got it.\n\n               Marcus moves closer as Willie pulls back the drill on the \n               track. He places a screwdriver into the exposed lock assembly \n               and hits it with a sledgehammer.\n\n               Suddenly, the door swings open and bundled cash spills to \n               the floor. Both men are impressed.\n\n                                     MARCUS\n                         Fuck the loofah, let's go.\n\n               EXT. MILWAUKEE DEPARTMENT STORE - SHIPPING DOCK - NIGHT \n\n               Marcus and Willie wheel out two carts and roll them through \n               the open doors of a waiting van. As they slam the doors --\n\n               INT. VAN - NIGHT\n\n               Willie settles on the rear bench as Marcus gets into the \n               passenger seat next to his Pillipina Mail-order wife of \n               several years, LOIS, who is dressed in expensively ugly \n               clothes, and whose mouth is ever down-turned in pruney \n               distaste.\n\n                                     LOIS\n                         Marcus, did you get the loofah?\n\n                                     MARCUS\n                         Drive.\n\n               EXT. DOWNTOWN MILWAUKEE STREET - NIGHT\n\n               The van speeds away through the Christmas Eve night and \n               disappears into the distance, like the down of a thistle.\n\n                                                                  FADE OUT:\n\n               CAMERA ROCKETS INTO C.U. of An alarm clock ringing with a \n               jolt.\n\n               INT. RATBAG APARTMENT - DAY\n\n               Willie, in bed, blearily wakes to the insistent alarm. He \n               tries to turn it off, but his fingers are still clotted with \n               sleep.\n\n               In a series of frustrated grunts and groans he becomes more \n               and more aggravated until, finally --\n\n                                     WILLIE\n                         FUCK YOU, YOU FUCKING PIECE OF SHIT!\n\n               He bolts out of bed and throws the clock into the wall.\n\n               He stoops for some beer bottle empties and hurls them at the \n               clock debris.\n\n                                     WILLIE\n                         Fuck you! Fuck you! Fuck you!\n\n               One final scream and it's out of his system. He finds one \n               last bottle in his hand, half-full with a cigarette butt \n               floating in it.\n\n               He downs the beer and steps into the adjoining bathroom to \n               brush his teeth.\n\n               EXT. KEY BISCAYNE STREET - DAY\n\n               Willie, sipping a cup of coffee, meanders down the street \n               scratching his ass.\n\n               EXT. RESTAURANT - DAY\n\n               Willie's walk brings him to a fancy eatery at lunchtime. As \n               he passes, he casually snatches a handful of car keys from \n               the parking valet key-box and moves on.\n\n               As he rounds the corner into the lot he pushes on the various \n               key fobs, identifying various cars when their alarms chirp.\n\n               He seems dissatisfied until a brand new Cadillac chirps.\n\n               Willie gets in and drives off.\n\n               INT. CADILLAC - MOVING - DAY\n\n               Willie drives. He reaches over into the glove compartment \n               and pulls out the registration. He focuses on the car owner's \n               address.\n\n               INT. UPPER-CLASS HOME - HALLWAY - DAY\n\n               Willie, eating a corn dog, saunters down an opulent hallway, \n               a beer swinging in one hand.\n\n               INT. UPPER-CLASS HOME - BATHROOM - DAY \n\n               In long shot, through the open door of an extravagant marble \n               bathroom, we see Willie sitting on the toilet, leafing through \n               a magazine, beer bottle on the counter next to him. Pants \n               around his ankles.\n\n               INT. UPPER-CLASS HOME - BATHROOM - MINUTES LATER \n\n               Willie, standing by the toilet, finishes buckling his belt \n               and flips the flush lever.\n\n               Nothing happens; no whoosh of rushing water.\n\n               Willie, looking down into the toilet, gives the lever a couple \n               more clanking tries, and then grabs his beer and ambles off.\n\n               INT. UPPER-CLASS HOME - STUDY - DAY\n\n               Sucking on his beer, Willie paces the periphery of the room, \n               methodically knocking painting after painting off the walls.\n\n               INT. UPPER-CLASS HOME - MASTER BEDROOM - DAY\n\n               Willie arrives in the bedroom still knocking down paintings \n               until, finally, he exposes a wall safe.\n\n               A smile, and he pulls out a stethoscope.\n\n                                                                    CUT TO:\n\n               The safe door swings open to reveal stacks of cash.\n\n               INT. STRIP BAR - NIGHT\n\n               Willie scratches a lottery ticket. He's now wearing a Rolex \n               and some gaudy ring.\n\n                                     WILLIE\n                         Goddamn it!\n\n               He reaches for another one and we see that on the bartop in \n               front of him are neat stacks of lottery tickets as yet \n               unscratched, and an untidy jumble of scratched ones.\n\n               On the other side of the bar a MIDDLE-AGED STRIPPER vies for \n               his attention. Willie's ticket hits for $5.00.\n\n                                     WILLIE\n                         Yeah baby!\n\n               He tucks it into the Stripper's G-string, swigs a drink, and \n               resumes scratching.\n\n               INT. RATBAG APARTMENT - NIGHT\n\n               Willie and the Stripper stagger into his apartment, drunk.\n\n               As he passes his blinking answering machine:\n\n                                     WILLIE\n                         I got messages. Go wash yourself.\n\n                                     STRIPPER\n                         I'm a dancer, I sweat.\n\n                                     WILLIE\n                         Well you smell like a bum's nutsack.\n\n                                     STRIPPER\n                         Fuck you.\n\n                                     WILLIE\n                         Yeah, yeah.\n\n               As she exits, he activates the machine.\n\n                                     VOICE (V.O.)\n                         Mr. Soke, this is Andrew Kaplan again\n                         from the collection agency -- BOOP!\n\n               Willie skips to the next message.\n\n                                     ANOTHER VOICE (V.O.)\n                         Willie, I don't care man, I'm not \n                         looking to blame anyone, but that \n                         diamond isn't a real stone, man. I \n                         took it to -- BOOP!\n\n               Willie skips to the next message.\n\n                                     WOMAN'S VOICE (V.O.)\n                         Uh, hello, this is Helen Axelrod -- \n                         you ran into my car last week? Well \n                         I called State Farm but they have no \n                         record of any insurance policy for \n                         you and -- BOOP!\n\n               Willie skips to the next message.\n\n                                     MARCUS' VOICE (V.O.)\n                         Willie, it's Marcus. It's that time \n                         of year again. Pack your shit. \n                         Phoenix.\n\n                                                                    CUT TO:\n\n               EXT. PHOENIX, ARIZONA - DAY\n\n               To the chimey chords of \"Sleigh Ride,\" we see Phoenix, Arizona \n               in MONTAGE / dressed for Christmas but sweltering under its \n               oppressive winter heat.\n\n               EXT. SAGUARO SQUARE MALL - PARKING LOT - DAY\n\n               Through the heat ripples rising off the pavement two mirage-\n               like figures cross the infinite asphalt of the Saguaro Square \n               Mall parking lot -- Willie and Marcus in Santa and Elf \n               regalia, sweating and panting in the heat. Willie polishes \n               off a pint of Smirnoff's and flips it towards a nearby trash \n               can. It misses and breaks loudly on the pavement.\n\n                                     MARCUS\n                         Jesus Christ! Can you maybe keep it \n                         together for just ten minutes?!\n\n               He pulls some Tic Tacs out of his pocket.\n\n                                     MARCUS\n                         For crying out loud, chew a few of \n                         these... you drunken, fuckin' \n                         imbecile!\n\n               Anchoring the huge mall complex is the large and upscale \n               Chamberlain's Department Store.\n\n               INT. CHAMBERLAIN'S - MAIN FLOOR - DAY\n\n               Amid the bustle of holiday shopping, an angry heavy-set man \n               with a Grizzly Adams beard stomps away from the pursuing \n               store manager, Bob Chipeska.\n\n                                     CHIPESKA\n                         Harrison, please I Just let me \n                         explain. Financially, the --\n\n                                     HARRISON\n                         You get what you pay for, Chipeska! \n                         Five Christmases I've given my heart -- \n                         my soul -- my love to these kids, \n                         and now what? Now you flip me for \n                         some stranger who'll do it for peanuts \n                         and happens to work with a real \n                         midget! Lemme tell you something: \n                         nobody cares! Nobody comes here for \n                         the elf, Santa's the attraction! I \n                         do Burl Ives songs; does this schmoe \n                         even play guitar?\n\n                                     CHIPESKA\n                         Harrison, it's not the money or the \n                         midget. Believe me, if it was, I -- \n                         I don't think they like \"midget\". I \n                         think you're supposed to call them --\n\n                                     HARRISON\n                         Aw, forget it!\n\n               Harrison stomps away and right toward Marcus and Willie as \n               they enter the store.\n\n                                     HARRISON\n                         ...Hacks!\n\n               Willie and Marcus stop in their tracks and watch the burly \n               man storm out. Bob Chipeska watches with them.\n\n                                     CHIPESKA\n                         Hi. Bob Chipeska. I, please, I, uh -- \n                         please don't listen to him. Great \n                         resume and photo by the way.\n\n                                     MARCUS\n                         Thanks... you know, we been at this \n                         a long time an' all, so we like to \n                         think we do a good job...\n\n               A Beautiful Girl wearing skin-tight pants walks by, catching \n               Willie's eye. He stares wantonly at her ass, off in his own \n               little world.\n\n                                     CHIPESKA\n                         You two are the best men for the \n                         job. Truly. So do not let his... \n                         unpleasantness affect your performance \n                         in any way.\n\n                                     MARCUS\n                         Oh no, we're fine, w --\n\n                                     WILLIE\n                              (irked, snapping out \n                              of his daydream)\n                         Performance?\n\n               Willie's reaction worries Marcus.\n\n                                     CHIPESKA\n                         Yea. Your performance... you know, \n                         the...\n\n                                     WILLIE\n                         Performance. Like sexual?\n\n                                     CHIPESKA\n                         Excuse me?\n\n                                     MARCUS\n                         Willie no, he --\n\n                                     WILLIE\n                         You saying there's something wrong \n                         with my gear?\n\n                                     MARCUS\n                         Willie...\n\n                                     CHIPESKA\n                         I'm sorry. Your gear?\n\n                                     WILLIE\n                         You know... fuck stick.\n\n                                     MARCUS\n                         OKAY! We're gonna head upstairs now.\n\n               Marcus shoves Willie, who stalks off. Marcus lingers to smooth \n               things over. He forces a grin and shakes his head.\n\n                                     MARCUS\n                         Such a card.\n\n                                     CHIPESKA\n                         He's not gonna say \"fuck stick\" in \n                         front of the children, is he?\n\n                                     MARCUS\n                         No, no, no. Joke. Adult joke. For \n                         us. Adults.\n\n               A long, long, long silence.\n\n                                     MARCUS\n                         ...Joke.\n\n               Another beat. Marcus pantomimes helpless laughter, noiselessly \n               throwing his head back and holding his gut as it heaves with \n               mirth.\n\n               He is instantly composed.\n\n               INT. CHAMBERLAIN'S - WINTER WONDERLAND - DAY\n\n               On an upper floor of Chamberlain's the theme is \"The Desert \n               as Winter Wonderland.\" Cacti and tumbleweeds are wrapped \n               with lights and flocked with snow, and a team of nine stuffed \n               burros are hitched to a sleigh. Rudolfo the Red Nosed Burro \n               is tended by several Santa's elf mannequins. One in cowboy \n               wear and another in a poncho and sombrero.\n\n               Again there is a line of waiting children. Marcus makes his \n               way through the line as kids gasp and cheer. He plays to the \n               crowd.\n\n                                     MARCUS\n                         Merry Christmas! Santa's coming!\n\n               Yayyyyyy! Marcus gets to the head of the line, ducks under \n               the velvet rope and goes behind the flimsy cardboard set.\n\n               Willie sits there morosely, head slumped, forearms on knees, \n               red velvet hanging limply from one hand.\n\n                                     MARCUS\n                         What the fuck you doing, \"fuck stick\" \n                         in front of the boss?\n\n                                     WILLIE\n                         I don't like that guy.\n\n               He takes a bottle from the floor by his feet and swigs off \n               it. Marcus stares at him.\n\n                                     MARCUS\n                         You don't like any guy. You think I \n                         can't find another portly motherfuck \n                         can run a water drill?\n\n               Willie just slumps there apologetically.\n\n                                     MARCUS\n                         Don't tempt my hand. You blow this \n                         and we're broke for the year. So \n                         stop acting like you know something \n                         because, pal of mine, you don't know \n                         squat. You're gum on my shoe.\n\n                                     WILLIE\n                         Yeah, yeah.\n\n                                     MARCUS\n                         Now put on your fuckin' hat and get \n                         out there.\n\n               He grabs the hat, slams it into Willie's chest and, as Willie \n               rises, kicks him in the ass. Willie just takes it, shambling \n               off.\n\n                                     MARCUS (CONT'D\n                         ...And try to act professional. For \n                         Chrissake!\n\n               EXT. SAGUARO SQUARE MALL - PARKING LOT - DAY\n\n               On the outskirts of the Saguaro Square Mall's parking lot a \n               city bus stops with a hiss. The doors swing open to reveal a \n               pathetic EIGHT-YEAR-OLD KID, overweight, snot-nosed, badly \n               dressed and probably smelling of pee.\n\n               As the kid nears the mall entrance he passes a group of older \n               children doing skateboard stunts. They notice him.\n\n                                     KID\n                         Loser!\n\n               One of them throws an empty can that hits him in the head.\n\n               The kid walks on, it seems without noticing.\n\n               The bullies, disheartened by the lack of reaction, go back \n               to their skateboarding.\n\n               INT. CHAMBERLAIN'S - WINTER WONDERLAND - DAY\n\n               Marcus leads a LARGE HEAVYSET BOY over to the throne. The \n               boy eats a chocolate ice cream cone which is smeared all \n               over his mouth and T-shirt. Marcus lifts him with effort and \n               a groan onto Willie's lap.\n\n                                     WILLIE\n                         All right, wuddya want?\n\n                                     HEAVYSET BOY\n                         Nintendo Deer Hunter 3.\n\n                                     WILLIE\n                         Fine. Next.\n\n               The HEAVYSET BOY hops off onto Willie's foot by mistake.\n\n                                     WILLIE\n                         YOWWWCH! Watch the toenails willya?\n\n               Marcus puts a young girl on his lap. She looks up at him in \n               awe.\n\n                                     WILLIE\n                         ...Wuddya want?\n\n                                     LITTLE GIRL\n                         ...Santa?\n\n                                     WILLIE\n                         Yeah, c'mon, c'mon, wuddya want?\n\n                                     LITTLE GIRL\n                         Um... Barbie?\n\n                                     WILLIE\n                         Fine. Next.\n\n               Marcus puts another young boy on his lap.\n\n                                     WILLIE\n                         ...What do you want?\n\n                                     BOY\n                         Fraggle-stick car.\n\n                                     WILLIE\n                              (to himself)\n                         Fuck is that?\n                              (back to the kid)\n                         Fine, whatever, next.\n\n               No one is next.\n\n                                     WILLIE\n                         ...Next. Next!\n\n               Still nothing.\n\n                                     WILLIE\n                         ...Next, goddamnit! Let's move it \n                         along -- this is not the DMV!\n\n               Marcus walks over to the rope. The snot-nosed Kid is next in \n               line, frozen by fear. Marcus pulls on his hand.\n\n                                     MARCUS\n                         It's okay. C'mon.\n\n               The Kid stays put.\n\n                                     MARCUS\n                         What's your name?\n\n               The Kid shakes his head meekly.\n\n                                     MARCUS\n                         ...You can tell me...\n\n               No response.\n\n                                     MARCUS\n                         ...How about Santa? If you don't \n                         tell him, you won't get a present.\n\n               This penetrates the Kid's fear. He moves.\n\n                                     MARCUS\n                         ...That's right. Let's tell Santa.\n\n               Marcus leads the Kid up to the throne and places him on \n               Willie's lap.\n\n                                     WILLIE\n                         What do you want? C'mon, wuddya want? \n                         A snot rag?\n\n               The Kid just stares, motionless except for the flowing rivulet \n               of snot. Willie can't help but stare at it.\n\n                                     WILLIE\n                              (to himself)\n                         ...Another fuckin' mongoloid.\n                              (shouts)\n                         Marcus I get him outta here before \n                         he pisses on me.\n\n               Suddenly the Kid is moved to yank Willie's beard. He holds \n               it stretched below Willie's chin.\n\n                                     WILLIE\n                              (whispered to the kid)\n                         ...Let it go, you little bastard.\n\n                                     KID\n                         It's not real.\n\n                                     WILLIE\n                         It was real. The hair fell out when \n                         I got sick.\n\n                                     KID\n                         How'd you get sick?\n\n                                     WILLIE\n                         I loved a woman who wasn't clean.\n\n                                     KID\n                         Mrs. Santa?\n\n                                     WILLIE\n                         No, her sister.\n                              (whispers through \n                              clenched teeth)\n                         Let the fucking thing go.\n\n                                     KID\n                         What's it like at the North Pole?\n\n                                     WILLIE\n                         Like the suburbs.\n\n                                     KID\n                         Which one?\n\n                                     WILLIE\n                         Apache Junction. What the fuck do \n                         you care?\n\n               Willie shoves the Kid:\n\n                                     WILLIE\n                         Get the hell off my lap.\n\n               The Kid backs away, looking at him.\n\n                                     KID\n                         You are really Santa, right?\n\n                                     WILLIE\n                         No. No, I'm an accountant. I wear \n                         this as a fucking fashion thing.\n\n                                     KID\n                         Okay.\n\n               The Kid backs away in awe, never breaking his reverent stare.\n\n               As Marcus helps the next child onto Santa's lap Willie hisses \n               at him:\n\n                                     WILLIE\n                         Get that kid out of here, he's \n                         freaking me out.\n\n               EXT. CHAMBERLAIN'S - NIGHT\n\n               The Kid sits on a bench watching the entrance to \n               Chamberlain's. After a beat Willie and Marcus walk out in \n               costume and cross toward the parking lot.\n\n               The Kid follows from a safe distance.\n\n               EXT. SAGUARO MALL - PARKING LOT - NIGHT\n\n               Willie and Marcus walk across the huge empty parking lot, \n               followed at a great distance by the Kid.\n\n               They arrive at their cars -- Marcus' van and a beat-up old \n               Chrysler that is Willie's -- parked next to each other.\n\n               As the Kid creeps closer, he is able to hear their \n               conversation.\n\n               Willie motions to the Black Angus in the parking lot.\n\n                                     WILLIE\n                         I gotta get a drink on. See ya \n                         tomorrow.\n\n                                     MARCUS\n                         Just don't come in to work stinkin' \n                         of booze again.\n\n                                     WILLIE\n                         Don't worry about me. Get going, \n                         you'll be late for your Wizard of Oz \n                         Candy Bar Guild thing.\n\n                                     MARCUS\n                         Lollipop Guild, asshole. Jesus, two \n                         year olds flip me shit better'n you.\n\n                                     WILLIE\n                         You tryin' to say something to me?\n\n                                     MARCUS\n                              (pauses, then \n                              deliberately)\n                         Yeah. I'm gonna stick my whole fist \n                         up your ass.\n\n               INT. BLACK ANGUS BAR - NIGHT\n\n               A large faux rustic bar filled to capacity with loosened-tie \n               middle-management.\n\n               Crammed at the far end of the bar, Willie stands out like a \n               sore thumb in this thirty-ish crowd.\n\n               We follow his gaze all around the perimeter of the room until \n               it connects with the drunken, glowering face of a HINDUSTANI \n               TROUBLEMAKER, sitting right across from him, startling Willie \n               for a moment.\n\n               Willie regains his composure, then gives the guy a puzzled \n               look back, and amused by the guy's unflinching anger, raises \n               his glass in a toast to him as if to say, \"whatever... cheers, \n               you nutcase\", and turns back to his drink.\n\n               The man stands up and, never releasing his stare, moves right \n               up to Willie, two inches from his face. Willie looks up.\n\n                                     TROUBLEMAKER\n                              (Hindi accent)\n                         Listen here buddy, let me make \n                         yourself perfectly clear. We don't \n                         like your kind coming around here in \n                         your red silk and satin clothes with \n                         your hunger for same-sex \n                         relationships. Consider yourself \n                         warned.\n\n                                     WILLIE\n                         Well fu-uck you!\n\n                                     TROUBLEMAKER\n                         I know that's what you'd like to do!\n\n               Willie gears up for a swing.\n\n                                     WILLIE\n                         Up yours, yufff --\n\n               A hand grabs his arm.\n\n                                     VOICE (O.S.)\n                         Don't.\n\n               Willie follows the hand to find a mature but attractive \n               BARMAID (SUE), an outdoorsy western beauty. Her eyes and \n               Willie's lock -- a source of sardonic amusement for the \n               troublemaker.\n\n                                     TROUBLEMAKER\n                         Oh saved by a woman, mister No-Pussy-\n                         Please man!\n\n               He stalks off.\n\n                                     SUE\n                         He ain't worth it, sugar. He got hit \n                         on last week. Didn't sit too well.\n\n                                     TROUBLEMAKER\n                         WHAT ARE YOU STARING AT!?\n\n               By the bathroom, the troublemaker is in another man's face:\n\n                                     TROUBLEMAKER\n                         ...This is not Flagstaff!\n\n                                     SUE\n                         Another Grandad, Santa?\n\n                                     WILLIE\n                         Yep.\n\n               She pours him another and slams it on the bar.\n\n                                     SUE\n                         Got a name?\n\n                                     WILLIE\n                         Oh yeah.\n\n               He pounds the drink.\n\n               She waits. Nothing else is forthcoming.\n\n                                     SUE\n                         What do you do? I mean, after the \n                         holidays?\n\n                                     WILLIE\n                         Nothing 'til March. Then I'm the \n                         Easter Bunny.\n\n                                     SUE\n                         ...Another?\n\n                                     WILLIE\n                         Why not. Buy you one?\n\n                                     SUE\n                         Why not.\n\n               She pours two. They both pound them back.\n\n               Her statement is a question:\n\n                                     SUE\n                         ...Not a big talker.\n\n                                     WILLIE\n                         Nah.\n\n                                     SUE\n                         Buy you one?\n\n                                     WILLIE\n                         Why not.\n\n               As she pours:\n\n                                     SUE\n                         You're pretty regular, for a Santa.\n\n               He shrugs:\n\n                                     WILLIE\n                         It's my job, no big deal. I'm an \n                         eating, drinking, shitting, fucking \n                         Santa Claus.\n\n                                     SUE\n                         Prove it.\n\n               Willie stares at her.\n\n                                     WILLIE\n                         Which?\n\n               INT. WILLIE'S CAR - PARKING LOT - NIGHT\n\n               Willie is on top of the barmaid, humping her, still in his \n               Santa suit. His pom-pom bobs in rhythm with his thrusts.\n\n                                     WILLIE\n                         Yes! Yes! Yes!\n\n                                     SUE\n                         Fuck me, Santa! Fuck me, Santa!\n\n               The hat is slipping askew. He reaches for it.\n\n                                     WILLIE\n                         At least lemme take off the hat!\n\n                                     SUE\n                         NO!\n\n               EXT. SAGUARO SQUARE MALL - PARKING LOT - NIGHT \n\n               In the parking lot the barmaid finishes straightening her \n               clothes and touching up her lipstick in the rearview mirror.\n\n               Willie, leaning against his car, still in his Santa suit, \n               fires up a post-coital cigarette.\n\n                                     SUE\n                         I got a thing for Santa Claus, I \n                         don't know, I guess it's from early \n                         childhood.\n\n                                     WILLIE\n                              (taking a swig)\n                         Yeah, so's my thing for tits.\n\n                                     SUE\n                         Maybe because my parents were Jewish \n                         and never celebrated Christmas. Santa \n                         was sort of forbidden, you know?\n\n               She gets out of the car.\n\n                                     SUE\n                         I like you. Most of the people around \n                         here are pretty uptight. My name is \n                         Sue. Here's my number.\n\n               She hands him the slip of paper and ambles off, calling back \n               over her shoulder:\n\n                                     SUE\n                         ...Don't mothball that suit!\n\n               Willie, nodding understanding, turns to reach for his car \n               door and --\n\n                                     TROUBLEMAKER\n                         I AM NOT GAY!!\n\n               -- the accompanying PAN OVER brings in the screaming \n               homophobe.\n\n                                     WILLIE\n                         Whoa-Jesus! All right buddy, that's \n                         it...\n\n                                     TROUBLEMAKER\n                         Buddy? I said, I am not gay!\n\n                                     WILLIE\n                         Look, what's the problem pal, you go \n                         off your meds?\n\n               The man stares at him for a beat.\n\n                                     TROUBLEMAKER\n                         ...Yes, but this isn't about that! \n                         You are queer as a ten dollar bill.\n\n                                     WILLIE\n                         Now you listen. My brother lost an \n                         arm fighting you people in Vietnam, \n                         so I want you to take a good hard \n                         look at this face...\n\n               Willie pulls back a fist.\n\n                                     WILLIE\n                         ...'cause it's the last fuckin' thing \n                         you're gonna see before I knock your \n                         head off and sh --\n\n               WHACK-WHACK-WHACK-WHACK-WHACK! The man surprises Willie with \n               a flurry of effective punches. In moments, Willie is on the \n               losing end of homosexual panic.\n\n                                     TROUBLEMAKER\n                         Who is the bitch now, fat man?!\n\n                                     PIPING VOICE (O.S.)\n                         Leave Santa alone!\n\n               The Troublemaker stops and looks down to find the Kid beating \n               on his legs.\n\n                                     TROUBLEMAKER\n                         Please little boy, I am doing this \n                         for all of us!\n\n               Willie gets a chance to regain composure. He wipes the blood \n               from his mouth, raises his fists and... promptly collapses.\n\n                                     TROUBLEMAKER\n                         I think he has finished his cruising \n                         for tonight, hm?\n\n               The Hindustani hothead wanders off. The Kid shuffles over to \n               the prone Willie.\n\n                                     WILLIE\n                         You.\n\n               INT. WILLIE'S CAR - MOVING - NIGHT \n\n               The Kid sits in the front seat next to Willie who drives, \n               stewing.\n\n                                     WILLIE\n                         This one time I take you home.\n\n                                     KID\n                         Uh-huh.\n\n                                     WILLIE\n                         I'm not your fuckin' dada.\n\n                                     KID\n                         Uh-huh.\n\n                                     WILLIE\n                         It's not as if you helped out with \n                         that nut-job.\n\n                                     KID\n                         Uh-huh.\n\n                                     WILLIE\n                         And you're right there to grab his \n                         fuckin' balls.\n\n                                     KID\n                         Uh-huh.\n\n                                     WILLIE\n                         Right height.\n\n                                     KID\n                         Yeah.\n\n               Willie demonstrates with a sharp turn of his hand:\n\n                                     WILLIE\n                         Twist 'em.\n\n                                     KID\n                         Why do you need a car?\n\n                                     WILLIE\n                         ...Fuck you talkin' about?\n\n                                     KID\n                         This car.\n\n                                     WILLIE\n                         Whuh. Which turn is it?\n\n                                     KID\n                         Sage Terrace. Where's your sleigh?\n\n               Willie answers absently, his head slightly ducked and his \n               eyes darting side to side, checking for road signs:\n\n                                     WILLIE\n                         Repairs. In the shop.\n\n                                     KID\n                         Where're the reindeer?\n\n                                     WILLIE\n                         I stable 'em. Is it gonna be left or \n                         right?\n\n                                     KID\n                              (pointing left)\n                         That way. Where's the stable?\n\n                                     WILLIE\n                         Next to the shop.\n\n                                     KID\n                         How do they sleep?\n\n                                     WILLIE\n                         Who -- the reindeer? Standing up.\n\n                                     KID\n                         But the noise, how do they sleep?\n\n                                     WILLIE\n                         What noise?\n\n                                     KID\n                         From the shop.\n\n                                     WILLIE\n                         They, uh, they only work during the \n                         day.\n\n                                     KID\n                         I thought it was always night at the \n                         North Pole.\n\n                                     WILLIE\n                         Not now. Now it's always day.\n\n                                     KID\n                         Then how do they sleep?\n\n                                     WILLIE\n                         Well, they -- WILL YOU PUH-LEEEZ \n                         SHUT THE FUCK UP! HOW THE FUCK DO \n                         KNOW?! I'M GONNA -- Whoa! Sage \n                         Terrace!\n\n               He makes a hard left.\n\n                                     WILLIE\n                         ...What is it with you? Somebody \n                         drop you on your fucking head?\n\n                                     KID\n                         On my head?\n\n                                     WILLIE\n                         What, are they gonna drop you on \n                         somebody else's head?\n\n                                     KID\n                         How can they drop me onto my own \n                         head?\n\n                                     WILLIE\n                         Not onto your own h -- ARE YOU FUCKING \n                         WITH ME?\n\n               EXT. THE KID'S HOUSE - NIGHT\n\n               Willie escorts the Kid along a long walkway that leads to \n               the front door of a large, opulent, new-money Southwestern \n               home.\n\n               Willie admires the surroundings.\n\n                                     WILLIE\n                         Nice digs. Daddy home?\n\n                                     KID\n                         He's on a adventure 'sploring \n                         mountains. He been gone a long time.\n\n                                     WILLIE\n                         Exploring mountains? When's he coming \n                         back?\n\n                                     KID\n                         Next year.\n\n                                     WILLIE\n                         What about Mommy?\n\n                                     KID\n                         She lives in God's house with Jesus \n                         and Mary and the Ghost and the long-\n                         eared donkey and Joseph and the \n                         talking walnut.\n\n                                     WILLIE\n                         Who the fuck takes care of you then?\n\n                                     KID\n                         Granma.\n\n                                     WILLIE\n                              (hatching an idea)\n                         Really... What's her name?\n\n                                     KID\n                         Granma.\n\n               As the Kid lets himself in Willie pulls out a black ski mask \n               and puts it on his head like a stocking cap.\n\n                                     WILLIE\n                         Uh-huh. Is Granny spry?\n\n               He unrolls the mask to cover his face and takes out a \n               blackjack.\n\n               INT. THE KID'S HOUSE - NIGHT\n\n               Willie enters the foyer as the Kid walks into the adjoining \n               room. He approaches a figure in a La-Z-Boy watching TV.\n\n                                     KID\n                         Granma, Santa's here. Are you spry?\n\n               Grandma rises from her chair with the assistance of her walker \n               and begins to move toward Willie. She wears a bathrobe and \n               thick glasses and has another pair of glasses on a chain \n               around her neck.\n\n                                     GRANDMA\n                         Roger! You're home. Let me fix you \n                         some sandwiches.\n\n               He watches as the senile old woman innocently putters away.\n\n               He yanks off his mask and turns to the Kid.\n\n                                     WILLIE\n                         So you're tellin' me no one else is \n                         here?\n\n               The Kid shakes his head.\n\n                                     WILLIE\n                         ...No aunts, no uncles, no cousins?\n\n               The Kid shakes his head.\n\n                                     WILLIE\n                         ...Butler, security guard? Nothin'?\n\n                                     KID\n                         Nuh-uh.\n\n               This sinks in. Willie looks to the Kid.\n\n                                     WILLIE\n                         Daddy got a safe?\n\n               INT. THE KID'S HOUSE - STUDY - NIGHT\n\n               The sound of a tumbler tripping and, suddenly, light sweeps \n               in as the safe door opens to reveal a smiling Willie with \n               his stethoscope in his ears.\n\n               In the foreground a few stacks of cash and a folio. Willie \n               reaches in.\n\n               Willie grabs the folio and flips through it. Insurance forms, \n               deeds, Social Security cards, birth certificates, etc., all \n               bear the name of the Kid's father, Roger Merman.\n\n               Nothing of value.\n\n               He puts the folio back, grabs the cash.\n\n                                     KID\n                         You need money to fix your sleigh?\n\n                                     WILLIE\n                         Huh? Yeah, whateverthefuck...\n\n                                     KID\n                         You want milk and cookies?\n\n               Willie bends down and faces the Kid with a smile.\n\n                                     WILLIE\n                         Daddy got a car?\n\n               EXT. THE KID'S HOUSE - NIGHT\n\n               At the cut a new Mercedes screeches through the frame and, \n               as we hear it recede, we are left looking at the kid, who \n               stands at the curb, waving happily.\n\n                                     KID\n                         Bye Santa!\n\n               INT. CHAMBERLAIN'S - SECURITY OFFICE - NIGHT\n\n               CLOSE-UP: the glowing ash of a cigarette burning down. The \n               inhale lasts as long as comic timing will allow -- about six \n               or seven seconds.\n\n               ANGLE ON:\n\n               A wiry, hard-bitten, sun-baked saddlebag of a man, GIN SLAGEL \n               sits behind his cluttered desk sucking on a filterless Pall \n               Mall. We can hear his in-taken breath rattling over and around \n               the phlegm, growths, and polyps that line his embattled \n               trachea. His words come out on an exhaled cloud chamber's \n               worth of smoke:\n\n                                     GIN\n                         \"Fuck stick\"?\n\n               Bob Chipeska sits opposite.\n\n                                     CHIPESKA\n                         Yes, I thought it was strange too, \n                         but you know, I, I, I, I, uh, I, his \n                         little friend promised he wouldn't \n                         say it in front of the children. \n                         Which is fine because, you know, \n                         urn, there's an adult world and a \n                         child's world and that's okay. I'm \n                         not a censor.\n\n                                     GIN\n                         Little friend?\n\n                                     CHIPESKA\n                         Yes, a, a, a dwarf. Or midget... a, \n                         a, I don't know what he's called \n                         exactly but... a little guy. Little. \n                         Billy Barty. God rest. But thin \n                         fingers. Not the fat sausage fingers.\n\n                                     GIN\n                         \"Little people,\" that's what they \n                         like.\n\n                                     CHIPESKA\n                         Ah, yes, right.\n\n                                     GIN\n                         So \"fuck stick,\" that's all?\n\n                                     CHIPESKA\n                         Well, no, there was something else...\n\n               INT. CHAMBERLAIN'S - WOMEN'S BIG AND TALL - (EARLIER) \n\n               Chipeska walks by a cashier station carrying some paperwork \n               he's absorbed in, but hears some FAINT GROANS that make him \n               pause. Curious, he heads in the direction of the sounds.\n\n               They're coming from the dressing room area.\n\n               Chipeska curiously makes his way towards a corridor of \n               dressing rooms.\n\n                                     CHIPESKA (V.O.)\n                         ...A couple of days ago I was in \n                         Women's Big & Tall? --\n\n               A sign reads: \"Three Times A Lady\".\n\n               INT. CHAMBERLAIN'S - DRESSING ROOM AREA - (EARLIER)\n\n               He goes down a corridor of dressing rooms.\n\n                                     CHIPESKA (V.O.)\n                         and I heard these, urn, you know, \n                         these... noises.\n\n               The sound of throttling lust builds in volume. He follows \n               his ears until he arrives at a dressing room door. A Big or \n               Tall woman within screams with pleasure:\n\n                                     FEMALE VOICE (O.S.)\n                         Oh yeah! Oh yeah!\n\n                                     WILLIE'S VOICE (O.S.)\n                         Yeah! Yeah! You ain't gonna shit \n                         right for a week!\n\n               He looks underneath and spots black Santa boots with red \n               velvet pants around the ankles.\n\n               INT. CHAMBERLAIN'S - SECURITY OFFICE - NIGHT\n\n               Bob Chipeska holds up one hand.\n\n                                     CHIPESKA\n                         Now don't get me wrong. I was against \n                         the Clinton impeachment. What a man \n                         does with his penis -- Oval Office, \n                         Women's Big & Tall -- it's not for \n                         the American people to say.\n\n                                     GIN\n                         Right.\n\n                                     CHIPESKA\n                         But when you're dealing with children, \n                         a tender sensibility, a position of \n                         trust -- then perhaps, someone who \n                         has screaming orgasms with large \n                         women --\n\n                                     GIN\n                         Mm.\n\n                                     CHIPESKA\n                         Though I can't fire him for that.\n\n                                     GIN\n                         No.\n\n                                     CHIPESKA\n                         Sizisra. They'd say.\n\n                                     GIN\n                         Sure.\n\n                                     CHIPESKA\n                         Not true. I am no siziat. But I can \n                         see the picket line now.\n\n                                     GIN\n                         Yeah, a big fuckin' fat one.\n\n                                     CHIPESKA\n                         They'd all say, If it had been a \n                         supermodel or, uh...\n\n                                     GIN\n                         Heeyeah. Unfair practices. A lot of \n                         special pleading. Bitch, bitch, bitch. \n                         Fuckin' broads.\n\n                                     CHIPESKA\n                         But -- I can't help it -- the guy \n                         makes me uneasy.\n\n                                     GIN\n                         Well sure. Santa fuckin' someone in \n                         the ass.\n\n                                     CHIPESKA\n                         So maybe there's something I could \n                         fire him for.\n\n                                     GIN\n                         Yeah. Yeah. I getcha.\n\n                                     CHIPESKA\n                         Do you? Do you think you could find \n                         something?\n\n                                     GIN\n                         Oh shit yeah. There's always \n                         something.\n\n               INT. SAGAURO SQUARE MALL - VIDEO ARCADE - NIGHT\n\n               POV through the arcade's window shows Willie talking in \n               pantomime to a young girl -- a very young girl -- at one of \n               the pinball machines. Willie has his hands out to either \n               side and is either demonstrating the kind of body English to \n               apply to the machine, or else is describing an elaborate \n               sexual encounter -- either recalled or prospective. The girl, \n               giggles.\n\n               A REVERSE shows Marcus halted at the arcade window staring \n               in with disbelief that gives way to jaw-grinding anger:\n\n                                     MARCUS\n                         ...Motherfucker... Oh, you lousy \n                         fucking motherfuck...\n\n               EXT. SAGOARO SQUARE MALL - PARKING LOT - NIGHT\n\n               Willie and Marcus walk to their cars.\n\n                                     MARCUS\n                         That's just the kinda shit that's \n                         gonna get us pinched!\n\n                                     WILLIE\n                              (apologetic)\n                         She said she was eighteen.\n\n                                     MARCUS\n                         You promised no arcades! You said \n                         you'd only hustle Big & Tall!\n\n                                     WILLIE\n                         Ah, it's like shooting fish in a \n                         barrel -- there's no sport,\n\n                                     MARCUS\n                         How many times, you fuck? \"The bigger \n                         the store, the bigger the take.\" \n                         Well, we can't work the big stores \n                         with your big fucking train wrecks!\n\n                                     WILLIE\n                              (pulling out his keys)\n                         You got some nerve you little shit \n                         ya! You my mom now?! You shat me out \n                         your womb, is that it? You gotta \n                         take care of me!? Well I can take \n                         care of myself and I don't need no \n                         lectures! I know how to keep a low \n                         profile!\n\n               BOOP-BOOP! Willie uses his key fob to deactivate the car \n               alarm to the Mercedes.\n\n                                     MARCUS\n                         What the fuck is this?!\n\n                                     WILLIE\n                         Mind your own fucking business.\n\n               Willie opens the door and an avalanche of beer bottle empties \n               tumbles out, rolling everywhere.\n\n                                     MARCUS\n                         You cocksucker!\n\n               Willie starts the engine and pulls out, and Marcus yells to \n               the receding car:\n\n                                     MARCUS\n                         ...EVER HEAR OF THE OPEN-BOTTLE LAW?!\n                              (then, to himself)\n                         -- You dumb Dipshit Motherfucker!\n\n               EXT. RESIDENCE MOTEL - NIGHT\n\n               Willie parks the Mercedes in the front of a rundown motel \n               complex. He walks past hookers and junkies until he gets to \n               his unit.\n\n               He pulls out his key and just as he's about to insert it in \n               the lock he sees a flashlight beam shining inside the window.\n\n               Surprised, he backs off cautiously and presses up against \n               the wall.\n\n               Someone inside is rifling the room.\n\n               Willie hisses at a nearby hooker:\n\n                                     WILLIE\n                         Opal, come here.\n\n               Opal looks at him with disdain.\n\n                                     OPAL\n                         Screw you, Willie -- last time I \n                         didn't shit right for a week.\n\n                                     WILLIE\n                         No, not that -- come here!\n\n               Reluctantly, she sidles over.\n\n                                     WILLIE\n                         Who the fuck's in my room, did you \n                         see someone go into my fuckin' room?\n\n                                     OPAL\n                         Yeah some guy askin' 'boutcha -- \n                         looked like a cop.\n\n                                     WILLIE\n                         Ah fuck.\n\n               INT. MARCUS' APARTMENT - NIGHT\n\n               Marcus is on the phone with Willie.\n\n                                     MARCUS\n                         What guy?! You get a look at him?\n\n                                                                  INTERCUT:\n\n               EXT. RESIDENCE MOTEL - NIGHT\n\n               Willie is at a pay phone.\n\n                                     WILLIE\n                         No, I think it's a cop though. You \n                         think someone's onto us?\n\n                                     MARCUS\n                         Is there anything in the room? \n                         Anything professional?\n\n                                     WILLIE\n                         No. Clothes.\n\n                                     MARCUS\n                         Just ditch. You got anywhere to sack \n                         out for a while?\n\n               INT. THE KID'S HOUSE - FOYER - NIGHT\n\n               The Kid swings the door open to Willie, who stands on the \n               stoop holding a small grip.\n\n                                     KID\n                         Santa!\n\n                                     WILLIE\n                         Yeah.\n\n                                     KID\n                         You're bringing my present early?\n\n                                     WILLIE\n                         NO.\n\n                                     KID\n                         But I never told you what I wanted.\n\n                                     WILLIE\n                         I said I didn't bring it, dipshit.\n\n                                     KID\n                         Okay. Good. I want a stuffed elephant. \n                         A pink one.\n\n                                     WILLIE\n                         Yeah, well...\n\n               He brushes past the kid into the house, eyes darting this \n               way and that.\n\n                                     WILLIE\n                         ...wish in one hand and shit in the \n                         other, see which fills up faster.\n\n                                     KID\n                         Okay.\n\n               The Kid follows Willie like a puppy dog as Willie checks out \n               the house, bumping open doors, looking around.\n\n                                     WILLIE\n                         I'm gonna be staying here a while. \n                         Things are all fucked up at the North \n                         Pole. Mrs. Santa, she... she walked \n                         in on me fuckin' her sister. So I'm \n                         out on my fuckin' ass. She's taking \n                         half of everything... This'll do.\n\n               INT. THE KID'S HOUSE - MASTER BEDROOM - NIGHT\n\n               Willie has discovered the master bedroom, by appearances \n               long unused. He tosses his grip onto the double bed.\n\n                                     WILLIE\n                         ...I'm gonna crash here. You and me, \n                         like, you know, bachelors.\n\n                                     KID\n                         Do you and Mrs. Santa have kids?\n\n                                     WILLIE\n                         No. Thank the fuck Christ.\n\n                                     KID\n                         What about the elves?\n\n                                     WILLIE\n                         Yeah, well, them. They stay with \n                         Mrs. Santa. I get 'em on weekends. \n                         Run me a bath, will ya?\n\n                                     KID\n                         What about the reindeer?\n\n                                     WILLIE\n                              (pleading)\n                         Don't start with the fucking reindeer.\n\n               INT. THE KID'S HOUSE - MASTER BATHROOM - NIGHT\n\n               The Kid sits on a stool, hands on his knees, staring, \n               motionless.\n\n               Finally:\n\n                                     KID\n                         ...What're their names?\n\n               Willie lies in the tub, also motionless, a wet washcloth \n               over his face, fingers of one hand resting against a tumbler \n               filled with ice and amber liquid that sits on the edge of \n               the tub.\n\n               From under his washcloth:\n\n                                     WILLIE\n                         ...Who?\n\n                                     KID\n                         The elves.\n\n                                     WILLIE\n                              (to himself)\n                         Oh, fuck...\n                              (then, to the Kid)\n                         I -- I can't remember... Sneezy, and \n                         Dopey --\n\n                                     KID\n                         That's the Seven Dwarves.\n\n                                     WILLIE\n                         Shit, is that not...? I just -- fuck, \n                         I don't know, I'll just say, Hey, \n                         Bub -- Look, I...\n\n               He drags the washcloth off his face and looks at the kid.\n\n                                     WILLIE\n                         ...FUCK ME! I DON'T KNOW THIS FUCKING \n                         SHIT! WHY IS EVERYTHING A FUCKING \n                         TEST WITH YOU?!\n\n               The Kid looks at him, unperturbed.\n\n                                     KID\n                         -- How old are they?\n\n               INT. THE KID'S HOUSE - MASTER BEDROOM - NIGHT \n\n               Willie staggers in, a towel around his waist, the empty rock \n               glass in one hand, a bottle tucked under the other arm, the \n               Kid trotting after.\n\n                                     KID\n                         You want cookies?\n\n                                     WILLIE\n                         No.\n\n                                     KID\n                         Warm milk?\n\n                                     WILLIE\n                         No.\n\n               Willie carefully, carefully puts glass and bottle down on \n               the nightstand and slowly raises both hands in a \"Don't... \n               Move\" gesture to keep them from flying off.\n\n                                     KID\n                         Should I fix you some sandwiches?\n\n                                     WILLIE\n                         What is with the fixing sandwiches? \n                         No.\n\n               Satisfied that the bottle and glass are not going anywhere, \n               Willie climbs unsteadily onto the bed and stares at the \n               ceiling.\n\n                                     KID\n                         Okay. You want anything else?\n\n                                     WILLIE\n                         No. As soon as the bed stops moving \n                         I'm going to sleep...\n\n                                     KID\n                         Okay.\n\n                                     WILLIE\n                         ...Wake me up... when the little \n                         hand is on the...\n\n               A long beat.\n\n               The ragged breath of drunken sleep.\n\n                                     KID\n                         Okay.\n\n               INT. CHAMBERLAIN'S - MAIN FLOOR - SCARF AREA - DAY\n\n               Marcus's wife Lois stands in front of a mirror, trying on a \n               cashmere scarf. Her look of pruney disapproval is in place, \n               as ever. She takes off the scarf and writes something in a \n               small spiral notebook...\n\n                                     SALESWOMAN\n                         Can I help you, ma'am?\n\n                                     LOIS\n                         Just looking.\n\n               Across the store, she spies the jewelry counter.\n\n               INT. CHAMBERLAIN'S - MAIN FLOOR - JEWELRY AREA - DAY\n\n               Lois stands looking intently down through the glass case in \n               pruney disapproval.\n\n                                     SALESMAN\n                         Help you with anything, ma'am?\n\n               Without bothering to look up:\n\n                                     LOIS\n                         Just looking.\n\n               As he drifts away she takes out her spiral notebook and makes \n               more notes.\n\n               INT. SAGUARO SQUARE MALL - FOOD COURT - NIGHT\n\n               Willie and Marcus nosh on food-court Gyros.\n\n                                     WILLIE\n                         Fuck me? Fuck you!\n\n                                     MARCUS\n                         You can't just take up with some \n                         kid! You don't know who's around, \n                         what they do!\n\n                                     WILLIE\n                         You got some nerve you little shit \n                         ya. You my mom now?! You shat me out \n                         your --\n\n                                     MARCUS\n                         You said that last night you stupid \n                         fuck!\n\n                                     WILLIE\n                         Ah, shit! Fuck you!\n\n               Lois appears with a salad on a tray and a look of pruney \n               disapproval. She sits next to Marcus and, in the way of old \n               couples comfortable with each other, he rests a hand on her \n               knee and continues to talk, ignoring her, while she picks \n               through her salad, ignoring him.\n\n                                     MARCUS\n                         You are by far the dumbest most \n                         pathetic piece of maggot-eaten shit \n                         that has ever slid from God's gilded \n                         ass! What if the kid has one of those \n                         fucking play-dates they have now?\n\n                                     WILLIE\n                         You shittin' me?! He doesn't have \n                         fucking friends! Not even an imaginary \n                         one! Unless he got ditched by him! \n                         He's just a fuckin' misfit! Lives \n                         with his grandma who sits drooling \n                         in front of the TV! Every once in a \n                         while she gets up to play soccer \n                         with her tits! What, she's gon' rat \n                         me out? She don't know her ass from \n                         last Tuesday!\n\n               Marcus thinks a moment.\n\n                                     MARCUS\n                         You fuck her?\n\n                                     WILLIE\n                         Jesus! Why is everything sex with \n                         you?\n\n                                     MARCUS\n                         With me? I fuck one person, I ain't \n                         out there serial fornicating, trying \n                         to float my liver! Drinkin' myself \n                         silly 'cause I can't stand what a \n                         piece of shit I am!\n\n               Lois, chewing on her salad, notices someone walking by with \n               a Chamberlain's bag. She glances in as the person passes \n               and, still chewing, gets out her notebook and jots something \n               down.\n\n                                     WILLIE\n                         What're you, fuckin' Sigmund Sawed-\n                         Off Freud? The shrunken fuckin' \n                         shrink?\n\n                                     MARCUS\n                         Yeah, that's right, shit-for-brains, \n                         talk about my height. Make it about \n                         something safe. 'Cause you're an \n                         emotional fucking cripple. Your soul \n                         is dog shit. Every single fuckin' \n                         thing about you is ugly.\n\n                                     WILLIE\n                         Yeah? Well... fuck you.\n\n               Marcus and Lois get up to leave.\n\n                                     MARCUS\n                         I've seen anal warts more attractive \n                         than you.\n\n               They walk off. Willie sits there for a moment. Goes back to \n               eating his hamburger. A WOMAN comes up with her TODDLER in \n               tow.\n\n                                     WOMAN\n                         Oh, look who's here Jimmy! It's Santa! \n                         Let's tell him what you want for \n                         Christmas.\n\n                                     WILLIE\n                              (shouting, food flying \n                              out of his mouth)\n                         I'M ON MY FUCKING LUNCH BREAK HERE!\n\n                                     WOMAN\n                              (putting her hands \n                              over the Toddler's \n                              ears)\n                         Are you insane?!! How dare you talk \n                         like that in front of a child! The \n                         management is going to hear about \n                         this... I'm going to have you fired!\n\n                                     WILLIE\n                         That's a threat? You think you can \n                         make my life any worse, you go ahead, \n                         be my fucking guest!\n\n               He throws his hamburger back down on his tray and storms \n               off, leaving the woman shocked.\n\n               INT. THE KID'S HOUSE - LIVING ROOM - NIGHT \n\n               Willie and the Kid sit opposite each other over a game of \n               checkers. Willie scowls as the Kid thinks for an eternity \n               about his next move.\n\n               The silence is deafening. Endless.\n\n               Then... CLICK! CLICK! CLICK! CLICK! CLICK!\n\n                                     KID\n                         King me.\n\n               Willie stares at the board for a long beat.\n\n               He leaps up screaming and flings the board across the room.\n\n                                     WILLIE\n                         FUCK YOU! YOU FUCKING CHEATER!\n\n               Willie throws checkers one by one against the wall, \n               punctuating each throw with an insult.\n\n                                     WILLIE\n                         Son of a BITCH! ...you LOUSY... \n                         STINKEN... ROTTEN... CHEATING... NO \n                         GOOD...\n\n               ANGLE ON Kid's face, unfazed, still smiling.\n\n               INT. THE KID'S HOUSE - KID'S BEDROOM - NIGHT\n\n               Later. The kid lies in bed, sleeping peacefully.\n\n               Distant sounds of the slosh of water.\n\n               EXT. THE KID'S HOUSE - BACK YARD - NIGHT\n\n               Churning water.\n\n               The sloshing of water is now accompanied by a rhythmic \n               slapping sound.\n\n               Willie bangs Sue in the Jacuzzi. He is wearing his Santa \n               hat.\n\n                                     SUE\n                         YES! YES! YES SANTA YES!\n\n               INT. THE KID'S HOUSE - LIVING ROOM - NIGHT\n\n               Two tall water glasses are set down on a sideboard.\n\n                                     WILLIE (O.S.)\n                         Refill?\n\n                                     SUE (O.S.)\n                         Mm.\n\n               A splash of orange juice is dolloped into each of the glasses, \n               and then both are filled to the top with vodka.\n\n               WIDER on the living room reveals Sue looking around. Her \n               speech -- and Willie's -- is somewhat impaired:\n\n                                     SUE\n                         Nice place you got. Needs a bit of a \n                         woman's touch, but it's really nice.\n\n                                     WILLIE\n                         It's okay. Just renting.\n\n               Sue accepts her refilled glass and sits on the sofa.\n\n                                     SUE\n                         Thanks... So how long will you -- \n                         urn...\n\n               She reaches down to fish under her ass in the sofa cushion, \n               and pulls out a red checker. She dully inspects it.\n\n                                     SUE\n                         ...How long you gonna be here?\n\n                                     WILLIE\n                         Through the holidays.\n\n               Sue flips the checker away.\n\n                                     SUE\n                         So what's the thing, you like kids?\n\n                                     WILLIE\n                         Fuck no! Whaddya think I'm some kind \n                         of pervert?\n\n                                     SUE\n                         Wha? I'm talking about you being \n                         Santa.\n\n               He sways, looking at her.\n\n                                     WILLIE\n                         Oh. No, see, the thing is... I'm not \n                         really Santa.\n\n               Blearily she gazes back. After a moment:\n\n                                     SUE\n                         Oh.\n                              (pause)\n                         ...Well -- still -- I gotta thing \n                         for you anyway -- c'mere...\n\n               He leans down to kiss her.\n\n               INT. THE KID'S HOUSE - FOYER - NIGHT\n\n               The door opens to reveal Sue on her way out. Willie sways in \n               the foyer, a three-quarters-empty bottle of Old Grandad in \n               hand.\n\n                                     SUE\n                         So I'll see you soon I guess, right?\n\n                                     WILLIE\n                         Yeah, I'm gonna send you some flowers. \n                         Real good expensive ones.\n\n               He closes the door. He then tips back the bottle and polishes \n               it off with a series of quick gulps.\n\n               Ever so daintily, he puts the bottle down. A beat later --\n\n               WHAM! He faints dead away, hitting the floor like a felled \n               tree.\n\n                                                                  FADE OUT:\n\n               Faintly, distantly, a blood-curdling scream.\n\n               FADE IN:\n\n               INT. THE KID'S HOUSE - FOYER/HALLWAY - MORNING\n\n               Willie wakes on the floor to the sound of the scream.\n\n                                     WILLIE\n                         Whuh...\n\n               He looks blearily up and immediately grabs his head, feeling \n               his hangover.\n\n               Following his ears he heads toward the hall. He passes \n               Grandma.\n\n                                     GRANDMA\n                         Roger! You're home! Let me fix you \n                         some sandwiches.\n\n               A bedroom door crashes open and the Kid emerges screaming \n               and runs right into Willie. He immediately caroms off and \n               goes screaming down the hall.\n\n                                     WILLIE\n                         What the...\n\n               He looks down at his T-shirt. There is a bloody palm-print \n               on his stomach.\n\n               He turns the corner to the hall, There is a row of fresh, \n               bloody palm-prints down one side of the hall. The Kid, \n               screaming, is just disappearing at the far end.\n\n               Willie follows.\n\n               INT. THE KID'S HOUSE - KITCHEN - MORNING\n\n               Willie enters.\n\n               The Kid is screaming, jumping up and down and clutching one \n               hand -- the bloody one -- with the other.\n\n                                     WILLIE\n                         What the fuck did you do?\n\n               He goes up and tries to yank the hand, which the hysterical \n               Kid yanks away.\n\n                                     WILLIE\n                         ...Lemme look at it. What the fuck \n                         happened?\n\n               As Willie drags him to the sink and runs water over the cut, \n               the Kid takes great gulping breaths and finally manages to \n               say:\n\n                                     KID\n                         ...I cut myself by mistake.\n\n               Willie grabs a vodka bottle standing open on the counter and \n               liberally pours some on the hand. The Kid shrieks.\n\n                                     WILLIE\n                         I forgot to tell ya, that'll sting. \n                         Okay now!\n\n               The Kid yanks his hand away and runs off screaming. Willie \n               is left alone in the middle of the kitchen.\n\n                                     WILLIE\n                         ...Well fuck.\n\n               He calls after the boy, sincerely trying to help:\n\n                                     WILLIE\n                         ...Don' t you want me to wrap it in \n                         a T-shirt or something?\n\n               EXT. SAGUARO SQUARE MALL - PARKING LOT - MORNING\n\n               It is early morning and the parking lot is empty except for \n               Marcus' van. The Mercedes eventually pulls in, parking beside \n               him. Windows roll down. In the driver's seat, Marcus looks \n               up from his watch with a scowl.\n\n                                     MARCUS\n                         You're late.\n\n               VAN DOORS\n\n               Marcus throws open the back of the van, revealing the \n               components of the water drill in various prop gift boxes.\n\n               Willie wears a forbearing smile:\n\n                                     WILLIE\n                         Kids, lemmme tell ya...\n\n               He shakes his head and chuckles as Marcus tosses him an empty \n               red Santa sack.\n\n                                     WILLIE\n                         ...They'll run ya ragged.\n\n               Marcus stares.\n\n               EXT. CHAMBERLAIN'S - ENTRANCE - MORNING\n\n               Jesse, the security guard unlocks the door and opens up for \n               Willie and Marcus. They enter in costume. Willie lugs the \n               filled sack and seems to be straining.\n\n                                     JESSE\n                         Morning boys.\n\n                                     MARCUS\n                         Morning Jesse.\n\n                                     JESSE\n                              (to Willie)\n                         Ho! Ho! Ho!\n\n               Willie pants under the weight of his bag:\n\n                                     WILLIE\n                         Up your ass.\n\n               EXT. SAGUARO SQUARE MALL - PARKING LOT - MORNING\n\n               As Willie and Marcus enter the store Gin Slagel drives by \n               their cars, carefully noting their tags.\n\n               INT. CHAMBERLAIN'S - WINTER WONDERLAND - DAY\n\n               Willie drops the bag with a loud thud.\n\n                                     WILLIE\n                         GOD dammit!\n\n                                     MARCUS\n                         You tear your ball again?\n\n                                     WILLIE\n                         No, it's okay.\n\n               Together they unload the extremely heavy gifts.\n\n                                     MARCUS\n                         Let's do the other thing.\n\n               Willie follows Marcus behind the Wonderland backdrop. Marcus \n               points to an air duct in the ceiling.\n\n                                     MARCUS\n                         There.\n\n               Willie crouches and Marcus climbs on his shoulders.\n\n               INT. CHAMBERLAIN'S - AIR DUCT - DAY\n\n               The duct pops open and Marcus climbs in, shimmying down to a \n               junction and continuing on.\n\n               INT. CHAMBERLAIN'S - CUSTOMER SERVICE OFFICES - DAY\n\n               A long row of cubicles, each one occupied with Customer \n               Service Operators. As they work, the loud squeaks and popping \n               metal sounds of a dwarf crawling through a duct are heard \n               above them.\n\n               Each operator in succession notes the racket, looking up \n               curiously as the sounds pass overhead.\n\n               Suddenly, the sounds stop. Everyone returns to work.\n\n               Then...\n\n               SQUEAK! POP! SQUEAK! The sounds resume. The operators look \n               up again as the noises fade away.\n\n               INT. CHAMBERLAIN'S - SURVEILLANCE ROOM - DAY\n\n               The sounds continue until Marcus' face appears at the ceiling \n               duct of an unmanned surveillance room.\n\n               He focuses on the wall of a hundred identical VCRs and squints \n               to see the brand name: SONY HVR-3200.\n\n               EXT. ELECTRONICS STORE - DAY\n\n               Lois exits an electronics store with a box slung under her \n               arm, her mouth turned down in pruney disapproval. She places \n               the box on the hood of her car and we see its printings SONY \n               HVR-3200.\n\n               She opens the box, fishes out the remote, then tosses the \n               box and VCR into a nearby trash can.\n\n               EXT. ARIZONA STATE PRISON - DAY\n\n               Gin Slagel walks through the main gate of the heavily \n               fortified penitentiary, leaving a huge trail of cigarette \n               smoke.\n\n               INT. PRISON - WAITING ROOM - DAY\n\n               Gin Slagel sits, smoking and waiting with family members and \n               lawyers. A guard enters and motions.\n\n                                     GUARD\n                         Alright Gin, come on.\n\n               INT. PRISON - VISITORS' ROOM - DAY\n\n               Gin sits down in one of the booths across from a middle-aged \n               prisoner.\n\n                                     PRISONER\n                         Who are you?\n\n                                     GIN\n                         Your name Roger Merman?\n\n                                     PRISONER\n                         Yes, but --\n\n                                     GIN\n                         Doing three-to-six for embezzlement?\n\n                                     PRISONER\n                         ...Many accounting questions are not \n                         cut-and-dried --\n\n                                     GIN\n                         You live at 41 Sage Terrace?\n\n                                     PRISONER\n                              (suddenly tense)\n                         Is it Granma? Is my son alright?\n\n                                     GIN\n                         They're fine. Do you have any house \n                         guests?\n\n               The man is bewildered:\n\n                                     PRISONER\n                         ...House guests?\n\n                                     GIN\n                         Thanks much for your time. God bless.\n\n               He gets up and walks away.\n\n                                     PRISONER\n                         ...Who are you? WHO ARE YOU?\n\n               INT. CHAMBERLAIN'S - SECURITY OFFICE - DAY\n\n               Gin sits at his desk sucking in a Pall Mall filterless. Bob \n               Chipeska sits opposite. Finally Gin exhales like a \n               crematorium.\n\n                                     GIN\n                         Well, it's fucked.\n\n                                     CHIPESKA\n                              (hopeful)\n                         ...Yeah?\n\n                                     GIN\n                         Yeah. Fucked. Frankly.\n\n                                     CHIPESKA\n                         He's...\n\n                                     GIN\n                         Clean.\n\n                                     CHIPESKA\n                              (disappointed)\n                         Oh.\n\n                                     GIN\n                         As a fuckin' whistle.\n\n                                     CHIPESKA\n                         Nothing?\n\n                                     GIN\n                         No. Nothing. I mean, shit, he curses, \n                         yeah. But never around children.\n\n                                     CHIPESKA\n                         Oh.\n\n                                     GIN\n                         No criminal record, no parking tickets \n                         f'Christ's sake, no bad habits, even. \n                         Sex, yeah. But man is a sexual being.\n\n                                     CHIPESKA\n                         Yeah.\n\n                                     GIN\n                         Fuckin' Darwinian. Can't do shit \n                         about that, Jack.\n\n                                     CHIPESKA\n                         NO.\n\n                                     GIN\n                         Wouldn't want to.\n\n                                     CHIPESKA\n                         Yeah. No. Of course not. I'm not \n                         advocating celibacy.\n\n                                     GIN\n                         Hope not. End of the human fuckin' \n                         race.\n\n                                     CHIPESKA\n                         Yes.\n\n               Gin turns one palm up.\n\n                                     GIN\n                         Fucks large women. What can I say.\n\n               EXT. SAGUARO SQUARE MALL - PARKING LOT - DAY\n\n               A bus clears frame, revealing the kid as he walks toward the \n               mall.\n\n                                     VOICES\n                         Loser! Dipshit!\n\n               CLANG! The kid is hit in the head with a can again. Again, \n               no reaction.\n\n               Someone in the group of frustrated bullies has a fresh idea:\n\n                                     VOICE\n                         Wedgie!\n\n               Cheering, the six bullies engulf the kid.\n\n               INT. CHAMBERLAIN'S - WINTER WONDERLAND - DAY \n\n               Marcus and Willie go about the business of being a Santa-Elf \n               team. Willie sees off another child,\n\n                                     CHILD\n                         Pokemon.\n\n                                     WILLIE\n                         Done.\n\n                                     MARCUS\n                         Next!\n\n               Marcus heads to the velvet rope to find the Kid, mussed up \n               and dirty, the band of his underwear around his chest.\n\n                                     KID\n                         Santa here?\n\n                                     MARCUS\n                         Oh jeez.\n\n               Marcus unclips the rope and the Kid approaches Willie.\n\n                                     WILLIE\n                         Is that your underwear?\n\n                                     KID\n                         Part of it.\n\n                                     WILLIE\n                         Where's the rest? Never mind. What \n                         do you want?\n\n                                     KID\n                         I was thinking I wanted a purple \n                         stuffed elephant, not pink, but now \n                         I changed my mind.\n\n                                     WILLIE\n                         What.\n\n                                     KID\n                         Now I don't want an elephant at all. \n                         I want a gorilla named Davy for \n                         beating up the skateboard kids who \n                         pull on my underwear and he could \n                         take his orders from the talking \n                         walnut so it wouldn't be my bad thing.\n\n               Willie stares at him.\n\n                                     WILLIE\n                         ...You know when I was your age, I \n                         didn't need no fuckin' gorilla, and \n                         I wasn't any bigger than you. One \n                         day I came crying home to Dad because \n                         four kids had beat me up, and you \n                         know what he did?'\n\n                                     KID\n                         He make it all better?\n\n                                     WILLIE\n                         No. He kicked my ass. You know why?\n\n                                     KID\n                         You went bathroom on Mommy's dishes?\n\n                                     WILLIE\n                         What the fuck? No.\n\n                                     KID\n                         He try to teach you not to cry and \n                         be a man.\n\n                                     WILLIE\n                         Nope, it was because he was a mean, \n                         drunk son of a bitch. When he wasn't \n                         busy busting my ass, he was puttin' \n                         out cigarettes on my neck.\n\n                                     KID\n                         Uh-huh...\n\n                                     WILLIE\n                         The world's fuckin' unfair -- it \n                         don't give ya nothing. You can wish \n                         all you want but you gotta take what \n                         you need. Stand up for yourself... \n                         stop being such a pussy and kick \n                         those kids in the balls or something.\n                              (pause)\n                         Or don't, I don't give a shit. Just \n                         leave me the hell out of it.\n\n                                     KID\n                         'Kay. Thanks, Santa.\n\n                                     WILLIE\n                         Okay, go ahead...\n\n               He slaps the Kid paternally on the ass.\n\n                                     WILLIE\n                         ...Get the fuck outta here...\n\n                                     KID\n                         'Kay...\n\n               As the Kid putters away:\n\n                                     MARCUS\n                              (happy again)\n                         Time for the next lucky boy or girl \n                         to --\n\n               Marcus returns to the velvet rope to find Gin Slagel waiting \n               stone-faced.\n\n                                     MARCUS\n                         What gives? Where's the grandson?\n\n                                     GIN\n                         Open the rope there, Marcus.\n\n               Marcus, wary, hesitates but then lets him through. As they \n               walk toward Willie:\n\n                                     MARCUS\n                         I know you?\n\n                                     GIN\n                         Not yet.\n\n               Willie is irked by the arrival of an adult:\n\n                                     WILLIE\n                         Santa don't do grab-ass, cowboy.\n\n                                     GIN\n                         Act natural.\n\n                                     WILLIE\n                         Huh? What?\n\n               Gin sits on Willie's knee.\n\n                                     WILLIE\n                         ...What the fuck?!\n\n                                     GIN\n                         You are Willie Tugboat Soke and you \n                         are Marcus \"The Prince\" Skidmore. On \n                         Christmas Eve, you're gonna rob this \n                         store blind. What say we go somewhere \n                         private?\n\n               INT. BLACK ANGUS BAR - NIGHT\n\n               Willie, Marcus and Gin sit in a booth.\n\n                                     GIN\n                         Research, that's how. I'm a department \n                         store detective Sherlock, that's \n                         what I do. Seven cities in seven \n                         years. Pretty impressive. The stores \n                         change, your names change. You always \n                         get away clean. Yeah, pretty darn \n                         impressive. But let's face facts -- \n                         you all are a couple of half-bucket \n                         small-timers. Because of your physical \n                         attributes you've found a niche. I \n                         respect that. But you've also been \n                         caught. By me. So this is the way \n                         how we gonna do things. I don't want \n                         to take over, I don't even want to \n                         change your scam. Whatever you guys \n                         do, it works. All I want is a taste. \n                         When the deed is done, we part ways. \n                         I buy a ranch in Havasu, you take \n                         your little medicine show back on \n                         the road.\n\n                                     MARCUS\n                              (sighs)\n                         How much?\n\n                                     GIN\n                         Half.\n\n               Willie bolts out of his chair and grabs Gin by the neck.\n\n                                     WILLIE\n                         Now you listen here, you --\n\n               Marcus pulls him off.\n\n                                     MARCUS\n                         Easy! Easy! Just back off, Willie. I \n                         can handle this.\n\n               After a hard stare Willie settles back into his seat. Marcus \n               turns his attention to Gin:\n\n                                     MARCUS\n                         Okay. Thirty percent. There's three \n                         of us. Thirty percent. That's fair.\n\n                                     GIN\n                         Half.\n\n                                     MARCUS\n                         I meant thirty-three.\n\n                                     GIN\n                         Half.\n\n                                     MARCUS\n                         And a third.\n\n                                     GIN\n                         Half.\n\n                                     MARCUS\n                         Thirty-five.\n\n                                     GIN\n                         Half.\n\n                                     MARCUS\n                         Forty.\n\n                                     GIN\n                         Half.\n\n                                     MARCUS\n                         Forty-two?\n\n                                     GIN\n                         Half.\n\n                                     MARCUS\n                         Forty-two five.\n\n                                     GIN\n                         Half.\n\n                                     MARCUS\n                         Fooooooorty... eight.\n\n                                     GIN\n                         Half.\n\n                                     MARCUS\n                         Forty-nine?\n\n                                     GIN\n                         Half.\n\n                                     MARCUS\n                         Well...\n\n               Marcus sighs.\n\n                                     MARCUS\n                         ...what's one point.\n\n                                     GIN\n                         Down the middle on the dough, and \n                         any merchandise you take I look over \n                         and cherry-pick.\n\n                                     MARCUS\n                         No! Money's one thing, but \u0097--\n\n                                     GIN\n                         It ain't Chinese menu, jagoff. I \n                         tell yea how the way it's gonna be. \n                         This is pricks ficks.\n\n               Gin leaves. Marcus and Willie stare at his retreating back \n               as they talk:\n\n                                     WILLIE\n                         ...Pricks ficks?\n\n                                     MARCUS\n                         Ah, he's a fuckin' moron.\n\n                                     WILLIE\n                         Yeah, well I guess that's how you \n                         got the upper hand.\n\n                                     MARCUS\n                         Fuck you.\n\n                                     WILLIE\n                         Negotiating.\n\n                                     MARCUS\n                         Fuck you -- you don't like it, next \n                         year, fuck off. I can always get \n                         another box jockey.\n\n                                     WILLIE\n                         Yeah, and I can get another midget.\n\n               Marcus turns to Willie:\n\n                                     MARCUS\n                         Yeah? Where? You see us hangin' off \n                         of fuckin' trees? Like fuckin' crab \n                         apples? And even if we did, you'd \n                         never front your own racket. 'Cause \n                         you got no discipline and zero fuckin' \n                         initiative. You'd fall apart without \n                         me. You're just too fuckin' pathetic --\n\n                                     WILLIE\n                         Yeah, yeah.\n\n                                     MARCUS\n                         -- too fuckin' pathetic for words, \n                         you fuckin' loser. And you fuckin' \n                         know it.\n\n               INT. THE KID'S HOUSE - NIGHT\n\n               Willie drags his ass through the front door, dejected.\n\n                                     GRANDMA\n                         Roger! You're home. Let me fix you \n                         some sandwiches.\n\n               He stares at her. His gaze is far away. Finally, he seems to \n               rouse himself:\n\n                                     WILLIE\n                         Ah, fuck it.\n\n               INT. THE KID'S HOUSE - GARAGE - NIGHT\n\n               IN C.U. CAMERA MOVES ALONG\n\n               a hose snaking from an exhaust pipe to the driver's window \n               which is open just far enough to admit it.\n\n               In his Santa suit, Willie sits in the driver's seat of the \n               idling car, staring through the windshield.\n\n               After a long beat, we hear a door opening.\n\n               The kid stands in the doorway from the house. He looks at \n               Willie, motionless in the car.\n\n                                     KID\n                         ...Santa?\n\n               Willie's eyes do not leave the spot in space:\n\n                                     WILLIE\n                         Yeah.\n\n                                     KID\n                         What're you doing?\n\n                                     WILLIE\n                         Ah, nothin'.\n\n                                     KID\n                         You goin' to work today?\n\n                                     WILLIE\n                         Not really.\n\n                                     KID\n                         You just gonna sit there?\n\n                                     WILLIE\n                         Yeah. Lemme alone.\n\n               The Kid turns to go. Willie bestirs himself:\n\n                                     WILLIE\n                         -- Kid.\n\n                                     KID\n                         Yeah.\n\n               Willie beckons him.\n\n                                     WILLIE\n                         Later today, when the paramedics \n                         come and bag up Santa...\n\n               He displays an envelope.\n\n                                     WILLIE\n                         ...make sure the cops get this letter. \n                         It tells about all the bad things \n                         that -- that -- what the fuck happened \n                         to your eye?\n\n               The Kid's eye is indeed black and blue. He reaches self-\n               consciously up to it.\n\n                                     KID\n                         Umm...\n\n                                     WILLIE\n                         Well goddamnit...\n\n               EXT. HILL NEAR SAGUARO SQUARE MALL - DAY\n\n               We are pulling an eight-year-old child who rides his bicycle \n               along the sidewalk, looking off, struck by what he sees.\n\n               He slows and then comes to a stop having pulled even with a \n               group of other children gathered on the sidewalk also looking \n               off at the same spot. They stare for a good long beat, \n               expressions rather neutral. But the sight, whatever it is, \n               holds their attention.\n\n               Finally one in the foreground remarks:\n\n                                     KID\n                         I didn't know he did that.\n\n               Their POV: rather distant, on a grassy hill a man in a Santa \n               suit is pounding the shit out of the bullies. One of the \n               bullies throws a punch, but Santa grabs his fist and pushes \n               him down. Santa puts his foot on another bully's butt and \n               sends him flying. After more wrestling and flinging about, \n               the bullies wind up in a heap on the ground.\n\n               INT. CHAMBERLAIN'S - LOCKER ROOM -DAY\n\n               Willie, a faraway look in his eye, sits on a bench near \n               Marcus, who is finishing putting on his elf outfit.\n\n                                     WILLIE\n                         I think I've turned a corner.\n\n                                     MARCUS\n                              (absent)\n                         Yeah? You fucking Petites now?\n\n               Willie, dreamy, refuses to take the bait:\n\n                                     WILLIE\n                         No no. No; I beat the crap out of \n                         some kids today -- but, you know, \n                         for a purpose. It really made me \n                         feel pretty good about myself -- \n                         like I did something constructive \n                         for a change. Accomplished somethin'.\n\n               Marcus stares at him.\n\n                                     MARCUS\n                         ...You need many years of therapy. \n                         Many, many, many, many, many... many \n                         fucking years of therapy.\n\n               INT. CHAMBERLAIN'S - MAIN FLOOR - FURS - DAY\n\n               Lois, her face set in pruney disapproval, flips slowly through \n               a rack of furs.\n\n               A salesman approaches from behind her. She somehow senses \n               his presence; without bothering to look around she murmurs:\n\n                                     LOIS\n                         Just looking...\n\n               INT. THE KID'S HOUSE - NIGHT\n\n               Willie and Sue come in, carrying a few bottles of liquor.\n\n               Willie closes the door, and freezes, realizing that something \n               is wrong.\n\n                                     WILLIE\n                         ...Hello?\n\n               Nothing.\n\n                                     WILLIE\n                         ...Granma?\n\n               He hears the TV and heads for the living room. Sue follows a \n               few steps behind.\n\n               Willie finds Grandma in her chair, not moving.\n\n                                     WILLIE\n                         Granma...\n\n               He strains through the dim light for any evidence of life.\n\n                                     WILLIE\n                         ...Oh jeez.\n\n               He lets out a sigh and leans in close to listen to her heart.\n\n                                     SUE\n                         Oh my God...\n\n                                     GRANDMA\n                         Roger!\n\n               Willie jumps and screams like a girl.\n\n                                     GRANDMA\n                         ...You're home. Let me fix you some \n                         sandwiches.\n\n               She gets up and heads for the kitchen as Willie tries to \n               compose himself.\n\n                                     WILLIE\n                              (holding his chest)\n                         No thanks.\n\n               INT. THE KID'S HOUSE - KID'S BEDROOM - NIGHT\n\n               The Kid sleeps. He is awakened by the sounds of stumbling \n               and CLANKING BOTTLES. He hears GIGGLING, more STUMBLING. He \n               gets up.\n\n               INT. THE'KID'S HOUSE - HALLWAY - NIGHT\n\n               The Kid discovers some clothes. Then some more. He follows \n               the trail of clothes towards the sounds coming from the Master \n               Bedroom.\n\n               INT. THE KID'S HOUSE - MASTER BEDROOM - NIGHT\n\n               Facing the CAMERA, Willie's in his underpants and Santa hat \n               lying on the floor on top of Sue. He's gripping her panties \n               with his teeth -- stretching the elastic while he starts \n               pulling them down. Sue's giggling.\n\n               The bedroom door opens behind them and the Kid walks in. He \n               comes up and stands over them, a few steps behind Willie.\n\n               Willie freezes, panty elastic waistband still stretched out \n               in his teeth. He senses something, and his eyes look up from \n               under his Santa hat, his wolfish smile fades.\n\n               The Kid stands there, hands behind his back.\n\n                                     SUE\n                              (lifting her head up)\n                         Hello little boy.\n\n                                     KID\n                         Hello. Santa?\n\n                                     WILLIE\n                              (frozen; teeth still \n                              gripping panties)\n                         ...yes?\n\n                                     KID\n                         I know that Christmas Eve is in a \n                         couple days and you have to fly around \n                         and give presents to the world and \n                         after that you won't be around no \n                         more.\n\n                                     WILLIE\n                         ...Yes?\n\n                                     KID\n                         So I thought I'd give you your present \n                         now.\n\n               The Kid takes his hands from behind his back and extends a \n               small present in crudely taped-up wrapping paper.\n\n               This forces Willie to let go of the panties. They SNAP back.\n\n               He sits up. He takes the gift and opens it. Inside is a \n               roughly whittled crescent of brown wood.\n\n                                     WILLIE\n                              (mumble)\n                         What the fuck is it?\n\n                                     KID\n                         A wooden pickle.\n\n               Willie stares at it.\n\n                                     WILLIE\n                         Why'd you paint it brown?\n\n                                     KID\n                         Not paint. It's blood from when I \n                         cut my hand when I was making it for \n                         you.\n\n               Willie stares at it.\n\n                                     WILLIE\n                         ...Thanks.\n\n                                     KID\n                         You're welcome. Good night Santa. \n                         Good night Mrs. Santa's sister.\n\n               He leaves.\n\n               Willie still stares at the gift. Sue is looking where the \n               Kid exited.\n\n                                     SUE\n                         That was very nice. He's really a \n                         nice kid, isn't he?\n\n               She goes back to grabbing him passionately.\n\n               Willie has trouble speaking.\n\n                                     WILLIE\n                         Hold on a minute.\n\n                                     SUE\n                         What?\n\n                                     WILLIE\n                         Nothin'... it's just... I'm... well... \n                         I'm sorta... fucking... touched.\n\n               He looks from the wooden pickle up to Sue, his eyes brim, \n               and he starts weeping.\n\n                                     WILLIE\n                         ...I don't know if I can fuck...\n\n               Sue hugs him and strokes his hair.\n\n                                     SUE\n                         That's okay. That's okay.\n\n               Willie abjectly bawls:\n\n                                     WILLIE\n                         BABY, I DON'T KNOW IF I CAN FUCK!\n\n                                     SUE\n                         There, there... There, there...\n\n               INT. THE KID'S HOUSE - KITCHEN - MORNING\n\n               Willie, hungover, half-dressed in his Santa outfit for work.\n\n               He fumbles in the refrigerator for some orange juice.\n\n               The Kid comes up behind him clutching a document.\n\n                                     KID\n                         SANTA!\n\n               Willie jumps with a start.\n\n                                     KID\n                         You wanna see my report card?\n\n               Willie takes the report card as he tries to compose himself.\n\n               He looks at it. All C's and one B.\n\n                                     KID\n                         Think I did good?\n\n               Willie's eyes drift back to the card and settle on COMMENTS.\n\n               They read, \"Thurman has an active, inquiring mind. And no \n               friends.\"\n\n                                     WILLIE\n                         Who the fuck is Thurman? This is \n                         you? Your name's Thurman?\n\n                                     KID\n                         Yeah.\n\n                                     WILLIE\n                              (incredulous)\n                         Thurman Merman?!\n\n                                     KID\n                         Yeah.\n\n                                     WILLIE\n                         Jesus.\n\n                                     KID\n                              (back to the report \n                              card)\n                         You think I did good?\n\n               Willie does not want to engage.\n\n                                     WILLIE\n                         Whaddya you care what I think, anyway?\n                              (pause, relenting a \n                              bit)\n                         What do I fuckin' know? Better than \n                         I ever did. I never got any B's,\n\n                                     KID\n                         I thought maybe since at least I did \n                         good in school, you'll bring me a \n                         present this year. 'Cause last \n                         Christmas and the one before that \n                         you didn't bring no presents...\n\n               This is a lot for Willie to hear.\n\n                                     WILLIE\n                         Oh...\n\n                                     KID\n                         ...Even though I'm a dipshit loser.\n\n                                     WILLIE\n                              (a beat, then explodes)\n                         Jesus Fucking Christ, Kid! Why do \n                         talk about yourself like that? What \n                         the fuck is that about?! What's with \n                         you anyway? I ain't Fucking Santa \n                         Claus! Look at me, I am living fucking \n                         proof that there ain't no Santa Claus!\n\n               Pause.\n\n                                     KID\n                         I know there's no Santa. I just \n                         thought maybe you'd wanna give me a \n                         present 'cause we're friends.\n\n                                     WILLIE\n                         Oh...\n\n               An uncomfortable silence. Willie is most uncomfortable.\n\n                                     WILLIE\n                              (pause, then sincerely \n                              to the kid)\n                         Look, kicking the shit out of those \n                         kids, that's as generous as I can \n                         get.\n\n               The Kid just nods and doesn't say anything. Willie can't \n               take it.\n\n                                     WILLIE\n                         JESUS FUCKING CHRIST, I GOTTA GO TO \n                         WORK!\n\n               Willie runs out of the room very upset,\n\n               INT. THE KID'S HOUSE - FOYER - MORNING\n\n               Willie grabs a bottle of whiskey off the counter and hurries \n               out, slamming the door.\n\n               INT. CHAMBERLAIN'S - WINTER WONDERLAND - DAY\n\n               Marcus checks his watch impatiently as the endless line of \n               excited children and their parents impatiently murmurs.\n\n               The tension is suffocating Marcus. Finally, a gasp goes up \n               from the crowd.\n\n               Marcus looks up to see Willie, totally shit-faced. His costume \n               is half on, his undergarments are showing, and his hand \n               clutches the neck of a broken bottle.\n\n                                     MARCUS\n                         No.\n\n               Willie stumbles over a burro and falls into a pile of fake \n               snow. He rises to his feet and begins to pummel the statue.\n\n                                     WILLIE\n                         You fuckin' spic!\n\n               Children scream in horror as mothers cover their eyes.\n\n               Gin enters the Wonderland and takes in the spectacle.\n\n                                     GIN\n                         Sweet Jews for Jesus...\n\n               Willie finishes dispatching the burro and stumbles to his \n               Santa chair. Marcus stomps up to him.\n\n                                     MARCUS\n                         Holy motherfuck. What do you think \n                         you're doing?\n\n                                     WILLIE\n                              (sobbing)\n                         I pissed my pants!\n\n               Marcus pounces on him.\n\n                                     MARCUS\n                         You son of a bitch!\n\n               Gin pulls Marcus off.\n\n                                     GIN\n                         Alright, let's get him out of here. \n                         I'll go smooth this over with \n                         Chipeska. Food poisoning, something.\n\n               The two men face each other, their voices rising. Beyond \n               them we see the line of children staring at them.\n\n                                     MARCUS\n                         What do you mean, get him out of \n                         here?\n\n                                     GIN\n                         Take him to his car.\n\n                                     MARCUS\n                         In case you hadn't noticed, I'm a \n                         motherfuckin' dwarf. So unless you \n                         got a forklift handy, maybe you should \n                         lend a hand.\n\n                                     GIN\n                         That figures, you wantin' all kinds \n                         of set-asides and special treatment \n                         'cause of your handicap. You're all \n                         the same.\n\n                                     MARCUS\n                         Special treatment? I'm three fucking \n                         feet tall, asshole -- it's a matter \n                         of physics! Draw me a sketch how I \n                         get him to the car!\n\n               Gin notices the line of kids staring. He puts up a sign that \n               reads: \"Santa Has Gone To Feed His Reindeer. He'll be back \n               soon\".\n\n                                     GIN\n                         Bitch, bitch.\n\n                                     MARCUS\n                         Sketch it up, fuckin' moron. Fuckin' \n                         Leonardo da Vinci.\n\n                                     GIN\n                         What did you call me, thigh-high?\n\n                                     MARCUS\n                         I called you a fuckin' guinea Homo. \n                         From the fifteenth fuckin' century.\n\n                                     GIN\n                         I could stick you up my ass, smallfry.\n\n                                     MARCUS\n                         Yeah? You sure it ain't too sore \n                         from last night?\n\n                                     GIN\n                         You got some lip on you, midget.\n\n                                     MARCUS\n                         Well it was on your wife's pussy \n                         last night. Why don't you dust that \n                         thing once in a while. Asshole.\n\n               INT. MARCUS' VAN - PARKING LOT - DUSK\n\n               Marcus sits with Lois in the van staking out the door to \n               Chamberlain's, waiting for Gin to leave.\n\n               INT. CHAMBERLAIN'S - WINTER WONDERLAND - DUSK\n\n               WILLIE sleeps it off behind a flimsy cardboard set.\n\n               INT. MARCUS' VAN - PARKING LOT - DUSK\n\n               Marcus and Lois continue their stake-out.\n\n               We see Gin exit the store and head for his car.\n\n                                     MARCUS\n                         There he is... that lousy, \n                         leatherfaced, dago motherfucker...\n\n               EXT. QUIET ROAD - NIGHT\n\n               Marcus stands by the side of his van. It's parked on the \n               shoulder with the hood up, jumper cables attached and hanging. \n               Lois is in the driver's seat.\n\n               Gin's Ford 4 X 4 speeds around the corner and Marcus flags \n               him down.\n\n               SCREEEEECH! Gin slams on the brakes, then backs up and pulls \n               over. He emerges from the 4 X 4 with road rage on full brew, \n               and strides over to the van.\n\n                                     GIN\n                         Jesus, Mother Mary and Joseph! What \n                         in the name of the holy lord Fuck is \n                         the problem now?\n\n                                     MARCUS\n                         Sorry, the van stalled. Give us a \n                         jump will ya?\n\n                                     GIN\n                         Well, I'll be dipped in dogshit!... \n                         What am I, your auto mechanic now?\n\n               He shakes his head in disgust. Grumbling, he goes back to \n               the 4 X 4 and drives it into position. He gets out and raises \n               the hood.\n\n               The two vehicles face each other nose-to-nose, several feet \n               apart as Gin opens the hood.\n\n                                     GIN\n                              (motions to his battery)\n                         Help yourself, small fry.\n\n               Marcus seems to have a little difficulty reaching the battery \n               terminals.\n\n                                     MARCUS\n                         It's hard for me to reach...\n\n               Gin grabs the cables from him. Marcus takes a few steps back.\n\n                                     GIN\n                         Jesus Christ, give me those!\n\n                                     MARCUS\n                         Thanks.\n\n               Gin attaches the cables.\n\n                                     GIN\n                              (then, to Lois)\n                         Alright, TRY IT!\n\n               Lois turns the key and the van starts right up. Gin takes \n               the cables off the van and closes the hood. He lights up a \n               Pall Mall.\n\n               Marcus signals to Lois. She puts the car into gear and stomps \n               her foot on the accelerator, squashing Gin between the two \n               vehicles.\n\n               ANGLE PROM INSIDE VAN (SLOW MOTION):\n\n               Gin's face as it's squooshed up against the van's windshield.\n\n               A cloud of cigarette smoke escapes his lips.\n\n               Lois continues to step on the gas, trying to crush him.\n\n               ANGLE ON: the tires spinning in the gravel.\n\n               Finally, she takes her foot off the gas. The van eases back.\n\n               Gin falls to the ground with a groan. Marcus steps up and \n               leans over him.\n\n                                     MARCUS\n                         Oh my, what a terrible accident!\n\n                                     LOIS\n                         Is he dead?\n\n                                     MARCUS\n                         No, but it looks like you broke most \n                         of his ribs.\n\n               Then, leaning down to Gin.\n\n                                     MARCUS\n                              (for Gin's benefit)\n                         I'd say maybe... fifty percent of \n                         them? Or do you think thirty percent?\n\n                                     LOIS\n                         I needed more of a running start -- \n                         I couldn't build up any speed.\n\n               Marcus paces around trying to figure out what to do next.\n\n                                     MARCUS\n                              (shaking his head in \n                              dismay)\n                         Motherfuck!\n\n               He grabs the jumper cables still connected to Gin's 4 X 4 \n               and clamps the other ends on Gin's ears. A small jolt and a \n               spark or two. Only a minor shock.\n\n                                     MARCUS\n                         Shit!\n\n               He grabs Gin's arm and with great effort drags him over a \n               few feet so that his head is positioned behind the front \n               tire of the van. Gin tries to crawl out of the way.\n\n               ANGLE ON: Gin's feet slipping on the gravel.\n\n                                     MARCUS\n                         Put it in reverse.\n\n               ANGLE ON: shift level moving into REVERSE.\n\n               ANGLE ON: Lois' foot stepping on the gas pedal.\n\n               WIDER: Lois drives backwards. There's a bump and the sound \n               of a dull POP.\n\n                                                                    CUT TO:\n\n               INT. CHAMBERLAIN'S - WINTER WONDERLAND - NEXT DAY\n\n               CLOSE-UP: A large bubble gum bubble pops.\n\n               Willie, in a self-medicated stupor, barely managing to hold \n               a wailing toddler on his lap. Bubble gum is all over the \n               Kid's face.\n\n                                     WILLIE\n                         'Tendo it is.\n\n               He passes the child off to Marcus, who holds it as Willie \n               gazes off and murmurs;\n\n                                     WILLIE\n                         ...Everything I touch turns to shit \n                         and dies.\n\n               Marcus, still holding the child, quickly glances around, and \n               then hisses into Willie's ear:\n\n                                     MARCUS\n                         What are you, drinking Sterno now? \n                         'Cause you're sounding like my Aunt \n                         Tilly right before she smeared her \n                         own shit on the bedroom walls and we \n                         had to lock her up and she spent the \n                         rest of her life with a shaved head \n                         and eating lunch through a tube up \n                         her nose...\n\n               Willie continues to stare, head swaying.\n\n                                     MARCUS\n                         ...You better be in shape by this \n                         evening, fat man. After tonight, I \n                         don't give a shit. But this is the \n                         time to reach deep down and suck it \n                         up.\n\n               Marcus hands the kid to his Mother. He smiles warmly.\n\n                                     MARCUS\n                         ...Lovely boy.\n\n               INT. SAGUARO SQUARE MALL - NIGHT\n\n               \"Jolly Old Saint Nicholas\" plays as a buzzing throng of people \n               crams the mall.\n\n               One current in this sea of humanity flows into the bedecked \n               entrance of Chamberlain's Department Store.\n\n               INT. CHAMBERLAIN'S - ENTRANCE - NIGHT\n\n               Jesse the security guard is at his post near the doors to \n               the parking lot. He smiles and waves farewell to departing \n               shoppers.\n\n                                     INTERCOM (V.O.)\n                         Attention shoppers, the store will \n                         be closing in five minutes. We wish \n                         you all a Merry Christmas, Happy \n                         Chanukah and a joyous Kwanza.\n\n               Behind Jesse, in Men's Wear, is Lois, wearing a frown of \n               pruney disapproval. Seeing that he's not looking, she \n               inexplicably nudges a table of sweaters a few feet over.\n\n               SQUEEEEEEEAK! The table makes a loud noise, but it's too \n               chaotic on the floor for anyone to notice. Satisfied with \n               her placement of the table, Lois heads out the door.\n\n               INT. CHAMBERAIN'S - WINTER WONDERLAND - NIGHT\n\n               Bleary-eyed Willie puts down a little girl and she happily \n               scampers off.\n\n                                     WILLIE\n                         Barbie it is...\n\n               Willie turns to Marcus.\n\n                                     WILLIE\n                         ...That it?\n\n               Marcus moves the backdrop to reveal the air vent.\n\n                                     MARCUS\n                         Let's go.\n\n               Willie cracks open an ampule of Amyl Nitrate and inhales \n               deeply. Marcus grimaces:\n\n                                     MARCUS\n                         ...Oh Christ.\n\n                                     WILLIE\n                              (red-faced, holding \n                              breath)\n                         Let's do it.\n\n               INT. CHAMBERLAIN'S - MAIN FLOOR - NIGHT\n\n               With the sound of closing circuits, banks of light \n               systematically shut down in the various departments of the \n               now empty.store.\n\n               INT. CHAMBERLAIN'S - ENTRANCE - NIGHT\n\n               Exhausted employees file out of the store past Jesse.\n\n               Eventually Willie emerges.\n\n                                     JESSE\n                         Merry Christmas, Willie.\n\n                                     WILLIE\n                         Up your ass.\n\n               Jesse heads for the alarm panel near the doorway and punches \n               the key labeled ARM. An LED readout labeled ARMING counts \n               down from 30 seconds.\n\n               Jesse exits the store, locking the door and heading home.\n\n               INT. CHAMBERLAIN'S - CUSTOMER SERVICE OFFICES - NIGHT\n\n               The cubicles are now empty and the office is still, but we \n               hear dwarf-shimmy in the ducts overhead.\n\n               INT. CHAMBERLAIN'S ENTRANCE - NIGHT\n\n               By the front door, the alarm continues to count down -- 25... \n               24...\n\n               INT. CHAMBERLAIN'S - AIR DUCT - NIGHT\n\n               Marcus arrives at the vent above the surveillance room. He \n               reaches in his pocket, pulls out the remote control Lois \n               bought, and aims it down into the room.\n\n               INT. CHAMBERLAN'S - SURVEILLANCE ROOM - NIGHT\n\n               The huge bank of VCRs powers down.\n\n               INT. CHAMBERLAIN'S ENTRANCE - NIGHT\n\n               ALARM BOX\n\n               19... 18... \n\n               INT. CHAMBERLAIN'S - AIR DUCT - NIGHT\n\n               Marcus arrives at the precipice of a descending duct. He \n               snaps on a biking helmet and takes a deep breath.\n\n                                     MARCUS\n                         All right...\n\n               He dives down the duct.\n\n               INT. CHAMBERLAIN'S - AIR DUCTS - NIGHT\n\n               We PAN and WHIP-PIVOT along the outside of several lengths \n               of ductwork, following the muffled SCREAM of a thousand \n               girlies echoing inside.\n\n               The ductwork dimples out along the bottom with the WUBBA \n               sound of flopping aluminum as Marcus's weight travels its \n               length; at turns, Marcus's inertial force makes one side of \n               the duct momentarily dent out.\n\n               We thus follow Marcus's progress as he slides, bumps, \n               ricochets and barrels through the department store.\n\n               INT. CHAMBERLAIN'S - MAIN FLOOR - ENTRANCE - NIGHT\n\n               As the alarm continues to count down, 12... 11... a distant\n\n               scream grows louder until --\n\n               -- in nearby Men's Wear, the vent in the 30-foot ceiling \n               bursts open and --\n\n               -- Marcus drops from the duct.\n\n               THUD! He lands on the table of sweaters placed by Lois.\n\n               In a split-second, he sits up and looks at the alarm box.\n\n               7... 6...\n\n               He hops off the table and pushes it toward the alarm box.\n\n               5... 4... \n\n               The far side of the table smashes into the wall beneath the \n               alarm box.\n\n               Marcus kicks out the collapsible legs on the near side, making \n               that edge of the table crash to the ground, creating a ramp.\n\n               He sprints away from the table spins, and runs back towards \n               it...\n\n               3... 2... \n\n               He runs up the ramp and --\n\n               1... \n\n               -- leaps and slaps the CANCEL button -- just in time.\n\n               INT. CHAMBERLAIN'S - OFFICES - NIGHT\n\n               DING! Elevator doors open to reveal Willie and Marcus holding \n               sections of the disassembled water drill.\n\n               INT. CHAMBERLAIN'S - ACCOUNTING OFFICE - NIGHT\n\n               The lights flicker on in the accounting office as Willie and \n               Marcus wheel the water drill over to the safe. Once they get \n               it there:\n\n                                     WILLIE\n                         Oh shit...\n\n                                     MARCUS\n                         What? What-What-WHAT-WHAT?\n\n                                     WILLIE\n                         It's a Kitnerboy Redoubt.\n\n                                     MARCUS\n                         So?\n\n               Willie stares at the safe.\n\n                                     WILLIE\n                         ...You know Andy Pitts?\n\n                                     MARCUS\n                         Yeah, Andy Pizzarelli?\n\n                                     WILLIE\n                         No, Andy Lapitski. Andy Pizzarelli \n                         is Andy Blue Balls.\n\n                                     MARCUS\n                         Huh-uh, since he got married they \n                         call him An -- WHAT'S YOUR FUCKING \n                         POINT?\n\n                                     WILLIE\n                         Andy Lapitski can get into anything. \n                         Anything. They say he's been in \n                         Margaret Thatcher's pussy.\n\n                                     MARCUS\n                         Yeah? YEAH?\n\n                                     WILLIE\n                         In the joint he told me that the \n                         Kitnerboy...\n\n               He nods at the safe.\n\n                                     WILLIE\n                         ...cannot be cracked.\n\n                                     MARCUS\n                         ARE YOU FUCKIN' SHITTIN' ME?! Are \n                         you tellin' me after I've propped \n                         you up and held you together and \n                         smiled for all those kids and danced \n                         for all those fucking housewives in \n                         a fucking lime-green fucking velvet \n                         elf costume YOU CANNOT GET IN THAT \n                         FUCKING SAFE? ARE YOU FUCKING TELLING \n                         ME THAT?\n\n               Willie continues to stare at the safe. He licks his lips.\n\n                                     WILLIE\n                         No... I'm saying it's gonna take me \n                         a minute.\n\n               INT. CHAMBERLAIN'S - MONTAGE - NIGHT\n\n               Willie stares at the safe while rubbing sandpaper to his \n               fingertips.\n\n               Meanwhile, Marcus emerges from a stockroom with a cart to \n               begin his shopping spree.\n\n               Willie applies a stethoscope to the safe, tapping with one \n               hand and listening intently.\n\n               Marcus starts in Ladies' Accessories, finding the cashmere \n               scarf.\n\n               Willie applies the drill to the safe.\n\n               Marcus makes his way through Lingerie.\n\n               Willie pulls back the drill. The bit is trashed, the safe is \n               completely unscathed.\n\n               Marcus is in Shoes picking out pumps for Lois.\n\n               Willie is in Home Improvement, flipping tools off the shelves \n               into a cart of his own.\n\n               Marcus is in Evening Wear, jumping to try to pull a stole \n               off a mannequin.\n\n               Willie batters a chisel into the seam of the safe door.\n\n               Marcus continues to leap at the mannequin.\n\n               Willie is atop the safe, swinging a sledgehammer at the lock.\n\n               Marcus swings at the mannequin's knees with a golf club.\n\n               Willie uses a plasma welder on the safe.\n\n               Marcus, having chopped down the mannequin, drags off its \n               stole.\n\n               Willie is back over the safe, battering it with the \n               sledgehammer, roaring with each swing.\n\n               Marcus is in Housewares pilfering crock pots.\n\n               Willie, sweating, drops the sledgehammer clanking to the \n               floor. Wiping his forehead, he circles the safe. When he \n               gets to the back of the safe he stops, thinks.\n\n               Marcus is in Home Entertainment grabbing a stereo.\n\n               Willie is hunched at the back of the safe, stethoscope to \n               its surface, giving exploratory taps with two knuckles.\n\n               Sound perspective through the stethoscope: hollow THUNKS \n               followed by an unnaturally loud and present CREEEEEEEEAK.\n\n               Willie reacts quizzically. After a considering moment he \n               rises. we can see, on the far side of the safe, its door as \n               it finishes creaking open.\n\n               Marcus enters the room. Willie looks at him.\n\n                                     WILLIE\n                         Piece of cake.\n\n               Marcus starts removing stacks of cash and loading them into \n               the Santa sack. Willie wipes sweat off his forehead.\n\n                                     WILLIE\n                         ...I'll be right back. I gotta grab \n                         one thing.\n\n               INT. CHAMBERLAN'S - TOY DEPT. - NIGHT\n\n               We are looking at a big, fuzzy, smiling, pink stuffed \n               elephant.\n\n               Willie's hand hesitates between this elephant and the one \n               behind, which is purple. We hear him muttering:\n\n                                     WILLIE\n                         Shit... which did he say?\n\n               The hand finally leaves with the purple elephant.\n\n               We hold for a long beat.\n\n               The hand reenters to put back the purple and take the pink.\n\n               Willie turns around holding the stuffed elephant.\n\n               Marcus and Lois are standing there presenting a grotesque \n               picture: Lois has a shopping cart filled with shoes, scarves, \n               jewels, a salad spinner, purses, a block of Ginsu knives, an \n               abdomen exerciser. She wears a pair of sunglasses from which \n               a price tag dangles, and a long ermine stole.\n\n               Next to her Marcus holds the Santa bag bulging with -- indeed, \n               sprouting -- cash.\n\n                                     WILLIE\n                         Well, I don't think that store dick \n                         is gonna want this.\n\n                                     MARCUS\n                         Store dick don't want shit.\n\n               Something in this picture makes Willie uneasy. He licks his \n               lips.\n\n                                     WILLIE\n                         Wuddya mean, fucking guy's greedier \n                         than...\n\n               He pauses, searching.\n\n                                     WILLIE\n                         ...greedier than fuck.\n\n               Marcus and Lois are statues, staring at him.\n\n                                     MARCUS\n                         Store dick dead. Store dick don't \n                         want shit.\n\n               A long silence.\n\n                                     MARCUS\n                         ...Fuck the fuckin' store dick.\n\n               Willie's tone is wooden:\n\n                                     WILLIE\n                         Dead, huh...\n\n               Again, he licks his lips.\n\n                                     WILLIE\n                         ...I didn't even know he was sick.\n\n               Marcus flicks his coat front away and pulls a .45 out of his \n               waistband.\n\n                                     MARCUS\n                         Willie. This has been a long time \n                         comin'.\n\n                                     WILLIE\n                         Uh-huh.\n\n                                     MARCUS\n                         Every year you're worse. Every year, \n                         less reliable. More booze. More \n                         bullshit. More butt-fucking.\n\n                                     WILLIE\n                         Sure. The three B'a.\n\n                                     MARCUS\n                         You gotta be able to rely, Willie.\n\n               He primes the gun. Willie murmurs, more in sadness than in \n               fear:\n\n                                     WILLIE\n                         You're monsters.\n\n               Marcus points the gun.\n\n                                     MARCUS\n                         Believe me, Willie: there's no joy \n                         in this for me.\n\n                                     WILLIE\n                         Oh, I don't mean layin' me out. I \n                         understand that. But just look at \n                         ya. All the shit... grabbin' all \n                         this shit -- do you really need all \n                         this junk? ...This is Christmas?\n\n               Marcus sneers:\n\n                                     MARCUS\n                         Oh please. Don't gimme that trite \n                         \"commercialism\" crap. This is what \n                         we do, Willie. We get the shit. \n                         Christmas time, we get the shit. \n                         Because we are men. And Lois. It is \n                         Christmas, Willie, and we are men, \n                         and Lois.\n\n               A silence.\n\n                                     LOIS\n                         ...Wuddya waitin' for, honey? Plug \n                         him.\n\n               Marcus sighs.\n\n                                     MARCUS\n                         Good-bye, Willie.\n\n               He aims. Willie squeezes his eyes shut.\n\n               From nowhere:\n\n                                     MEGAPHONE VOICE (O.S.)\n                         Drop the gun, munchkin!\n\n                                     MARCUS\n                         Huh? !\n\n               CLACK CLACK CLACK CLACK CLACK -- the sound of many guns \n               priming.\n\n               Police everywhere.\n\n                                     MEGAPHONE VOICE\n                         And you, Santa! -- drop the elephant!\n\n               Willie stares. Marcus looks wildly around.\n\n                                     MARCUS\n                         ...Where did you come from?\n\n                                     CHIEF\n                         Tipped off.\n\n                                     WILLIE\n                         Shit!\n\n               CAMERA TRACKS IN ON HIS FACE\n\n               Willie slaps his forehead.\n\n                                     WILLIE\n                         ...Fuckin' kid!\n\n                                     CHIEF\n                         All three of you are in so much shit \n                         it's almost unbelievable.\n\n                                     LOIS\n                         Gevalt.\n\n                                     MARCUS\n                         Oh yeah? Well come'n get us, coppers! \n                         Ha-ha-ha-ha!\n\n               BANG! BANG! BANG!\n\n               His .45 roars.\n\n               The cops return fire.\n\n                                     WILLIE\n                         Fuck me...\n\n               He ducks, clutching the elephant to his chest, and scurries \n               behind a counter.\n\n                                     WILLIE\n                         ...fuck me fuck me fuck me...\n\n               Gunfire fills the air.\n\n               Exploding merchandise chases along the counter behind Willie \n               as the cops seek to put him down.\n\n               Under the gunfire we hear Marcus's maniacal laughter.\n\n               Willie reaches the end of the counter. A brief open space \n               separates him from a stairwell; he dashes across as gunfire \n               redoubles and plunges down the stairs.\n\n               EXT. CHAMBERLAIN'S - LOADING DOCK - NIGHT\n\n               Willie bursts out onto the loading dock still holding the \n               elephant. He dives into his Mercedes and peels out.\n\n               EXT. SAGUARO SQUARE MALL - PARKING LOT - NIGHT\n\n               Rounding the corner of the loading dock, Willie comes upon a \n               fleet of squad cars idling in the street. Cops yell, draw \n               their guns and fire as Willie clips a couple cars, skids and \n               slues, and finally is clear of the pack.\n\n               He roars up the road as policemen leap for their vehicles, \n               crank up their sirens and pursue.\n\n               INT. MERCEDES - MOVING - NIGHT\n\n               Willie drives, his jaw set, a desperate man in a Santa suit.\n\n               He glances up at the rearview which shows many flashing light \n               bars.\n\n                                     WILLIE\n                         ...It's Christmas... and the fucking \n                         kid is getting his present.\n\n               EXT. THE KID'S HOUSE - NEIGHBORHOOD - NIGHT\n\n               Willie's car corners onto Sage Terrace on two wheels, slams \n               back down onto four, fishtails up to the kid's house and \n               squeals braking into its driveway.\n\n               The police vehicles, in hot pursuit, squeal, skid, and slew \n               around in a jumble at the foot of the lawn. Cops leap out of \n               their cars just as Willie jumps from his.\n\n                                     MEGAPHONE VOICE\n                         Halt, put your hands up!\n\n               Willie is sprinting up the walk toward the front door. His \n               voice echoes lone and weak after the boom of the megaphone:\n\n                                     WILLIE\n                         Up your ass!\n\n               He bounds up the stoop.\n\n                                     POLICE VOICE\n                         All right, boys -- nail him!\n\n               A ripple of gunfire.\n\n               At the top of the stoop, facing the door, Willie staggers, \n               rolls his eyes, and -- drops.\n\n               NEARBY WINDOW\n\n               Drawn by the noise, an adorable six-year-old in a nearby \n               house slides open his second-story bedroom window to look.\n\n               HIS HIGH POV:\n\n               Frozen in a semi-circle at the foot of the neighboring lawn, \n               an army of cops has guns trained on the felled Santa Claus, \n               who is sprawled on the neighbor's stoop, motionless. His \n               hand stretches toward the front door holding a fluffy pink \n               elephant un-delivered...\n\n               The six year old draws in his breath and SCREAMS.\n\n               He is joined by his equally adorable little brother and sister \n               who look, and SCREAM, with him.\n\n               Somewhere, a neighborhood dog barks.\n\n               A Cop looks up at the window and the three shrieking children.\n\n                                     COP\n                         Somebody put a zipper on those fuckin' \n                         kids!\n\n                                                                  FADE OUT:\n\n               INT. THE KID'S HOUSE - DAY\n\n               After a long beat, Willie's voice:\n\n                                     WILLIE (V.O.)\n                         Dear kid. I hope that you got my \n                         present and that there wasn't too \n                         much blood on it, although there was \n                         blood on the present you gave me \n                         which didn't keep me from enjoying \n                         it, so maybe the blood doesn't matter \n                         so much I guess.\n\n               We are FADING IN on a shelf in the Kid's bedroom where the \n               stuffed elephant sits, in a place of honor, its fur indeed \n               stiff and stained with dried blood. The Kid's bedroom is no \n               longer in disarray, things are neat and comfy. We PAN OFF of \n               it to find this letter, crudely handwritten, tacked up on a \n               little bulletin board.\n\n                                     WILLIE (V.O.)\n                         ...Anyway, just in case they took it \n                         as evidence I am also sending you a \n                         T-shirt. I hope it's the right size. \n                         I am healing up good and they tell \n                         me that I will soon be one hundred \n                         percent even with eight bullets dug \n                         out of me because they didn't hit \n                         any vital organs, just my liver which \n                         is fucked anyway, ha-ha-ha. Anyways...\n\n               Our CONTINUING PAN brings us to the open door of the bedroom \n               and we hear the sound of the TV in the living room. We TRACK \n               toward it.\n\n                                     WILLIE (V.O.)\n                         ...Thank you for giving that letter \n                         to the cops. I forgot I asked you to \n                         do it but it's a good thing you did \n                         or Santa's little helper would've \n                         plugged his ass. And now the cops \n                         know I wrote it, which is gonna keep \n                         my ass out of jail. That, plus \n                         everyone agreeing that the Phoenix \n                         police department shooting an unarmed \n                         Santa was even more fucked-up than \n                         Rodney King. The cops are treating \n                         me like fucking royalty now which is \n                         new in my experience. They are gonna \n                         make me a sensitivity counselor so \n                         that tragedies like this will never \n                         again embarrass the whole fucking \n                         department. Whatever.\n\n               Grandma is in the living room watching TV. We TRACK past her \n               towards the Jacuzzi area.\n\n                                     WILLIE\n                         ...As for my little helper, I am \n                         sorry to have to tell you that him \n                         and his prune-faced mail-order-wife \n                         are gonna be exploring mountains \n                         with your dad. I hope your dad doesn't \n                         go sucking shit from them like I \n                         did. Meanwhile, I told the cops you \n                         had no one to take the fuck care of \n                         you, so they set it up with Mrs. \n                         Santa's sister watching you till \n                         your Dad gets back in one year and \n                         three months. They made her a Guardian \n                         Pro-Temp or some such shit... anyway, \n                         she makes better money than bartending \n                         and seems to like you and your house \n                         and Jacuzzi.\n\n               Sue is in a towel, holding a highball as she climbs out of \n               the Jacuzzi. The Kid walks by her carrying a bucket. She \n               tousles his hair affectionately as he goes by. He's never \n               looked better.\n\n               WE TRACK TOWARDS THE FOYER. It's empty but the front door is \n               open. We TRACK towards it.\n\n               We go out the front door...\n\n                                     WILLIE (V.O.)\n                         ...So I'll be staying in Phoenix \n                         now, telling the police how screwed-\n                         up they are which is not a bad job \n                         as jobs go. They're supposed to let \n                         me out of this hospital room soon so \n                         I'll see you when I come over to \n                         fuck Mrs. Santa's sister in the \n                         Jacuzzi. Until then, don't take no \n                         shit from nobody. Least of all \n                         yourself. Anyways... see ya soon...\n\n               The Kid is dipping a toilet-bowl brush into a bucket of soapy \n               water on the front stoop.\n\n                                     WILLIE (V.O.)\n                         ...Santa.\n\n               As the Kid turns and hunkers down to scrub the dried blood \n               off the stoop, we see the back of his T-shirt. SHIT HAPPENS \n               WHEN YOU PARTY NAKED.\n\n                                                                  FADE OUT:\n\n                                         THE END\n\n\n\n\nBad Santa\nWriters :   Glenn Ficarra  John Requa\nGenres :   Comedy  Crime\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Willie T. Stokes (Billy Bob Thornton) and his dwarfed assistant Marcus (Tony Cox) are professional thieves. Every year, Willie disguises himself as a department store Santa Claus and Marcus disguises himself as an elf in order for both of them to rob shopping malls blind at night. Willie is an alcoholic, a sex addict, and is gradually unable to perform his Santa duties appropriately with children, much to Marcus' dismay. When they are hired at the fictional Saguaro Square Mall in Phoenix, the vulgar remarks made by Willie shock the prudish mall manager Bob Chipeska (John Ritter), who brings it to the attention of security chief Gin Slagel (Bernie Mac).\nAt the mall, Willie is visited by Thurman Merman (Brett Kelly), a friendly but exceedingly naive and gullible, overweight boy who thinks Willie is really Santa. The boy is a target of taunt and torment from a skateboarding gang. At a bar, Willie meets Sue (Lauren Graham), a woman with a Santa Claus fetish, and they begin a sexual relationship. Willie is harassed by a man in the bar, but Thurman intervenes. Willie gives Thurman a ride home, then enters the boy's house where he lives with his senile grandmother (Cloris Leachman). Thurman reveals that his mother died, and his father, Roger, is away \"exploring mountains\" (meaning he is actually in jail for embezzlement) until next year. Willie tricks Thurman into letting him steal from the house safe and steals a BMW owned by Thurman's father.\nBob informs Gin that he overheard Willie having sex with a woman in a mall dressing room; Gin starts to investigate. Willie goes to his motel room and sees it being raided, causing him to take advantage of Thurman's naivete and live in his house. The next day, Marcus gets angry at Willie for taking advantage of Thurman, stating his disapproval of Willie's sex addiction.\nGin's investigation of Willie includes visiting Thurman's imprisoned father, who reveals that Willie is staying with Thurman illegally. He confronts Willie at the mall, and takes him and Marcus to a bar. There, he reveals that he has figured out their plan, blackmailing them for half of the cut to keep silent.\nWillie attempts to commit suicide by inhaling vehicle exhaust fumes. He gives Thurman a letter to give to the police, confessing all his misdeeds. Willie notices Thurman's black eye, which persuades him to make an example of the skateboarding bully. A renewed sense of purpose for Willie has him attempt to train Thurman in boxing.\nEnraged at Gin for blackmailing him, Marcus and his wife Lois (Lauren Tom) set up a trap for Gin, feigning needing a jump start for their vehicle from Gin's. Lois hits Gin with the car, then Marcus kills him.\nOn Christmas Eve, when the heist is almost complete, Willie goes to get Thurman a pink stuffed elephant that he had wanted for Christmas. Just as he gets the elephant, Marcus reveals to Willie that he intends to kill him, fed up with his increasing carelessness. Lois tells him to hurry up and kill Willie so they can get away with the money and merchandise. But just as Marcus is about to shoot Willie, the police swarm the trio, tipped off by the letter Willie gave to Thurman. When Marcus opens fire, the police shoot at him and Willie flees. Determined to give Thurman his present, he leads the police on a chase to Thurman's house, ignoring orders to freeze. He is repeatedly shot on Thurman's porch, but survives.\nThe epilogue is told through a letter from Willie, who is in a hospital recovering. He expresses his gratitude for Thurman in giving the letter to the police and his name was cleared of unarmed robbery. Shooting an unarmed Santa embarrassed the police, and Sue is granted guardianship over Thurman and his house until Thurman's father, Roger, is released. Willie also explains that Marcus (identified as Santa's Little Helper) and Lois are serving time behind bars for their actions, while expressing hope Roger is wise to avoid the two. The movie ends with Thurman finally standing up to his bully by kicking him in the crotch causing him to fall to the ground. Thurman is seen riding his bike away flipping off the bully."}