{"title": "Badlands", "full_text": "BADLANDS\n\nby Terence Malick\n\nFinal Version\nDialogue and Continuity\n\n\n\nFADE IN\n\n\nINT. BEDROOM \n\nThe time is 1959. HOLLY SARGIS, the 15-year-old heroine, sits on \nher bed, petting her dog. The CAMERA DOLLIES BACK as she talks on \nVOICE OVER. \n\nHOLLY (v.o.)\nMy mother died of pneumonia when I was just a kid. My father had \nkept their wedding cake in the freezer for ten whole years. After \nthe funeral he gave it to the yardman... He tried to act \ncheerful, but he could never be consoled by the little stranger \nhe found in his house. Then, one day, hoping to begin a new life \naway from the scene of all his memories, he moved us from Texas \nto Ft. Dupree, South Dakota.\n\nHOLD on FULL SHOT of bedroom. \n\nDISSOLVE TO\n\n\nEXT. ALLEYS AND STREETS - SERIES OF ANGLES - DAWN \n\nThe streets and alleys of Ft. Dupree at dawn. On sound we hear \nthe clucking of DOVES. A garbage truck appears. Details of the \nmechanisms at the back of the truck. \n\nNEW ANGLE \n\nKIT CARRUTHERS, the hero, a 25-year-old garbageman, kneels beside \na dead dog. He inspects it briefly. then looks back at his friend \nand co-worker, CATO, a stocky man in his forties. \n\nKIT\nI'll give you a dollar to eat this collie.\n\nCato inspects the dog. \n\nCATO\nI'm not going to eat him for a dollar... I don't think he's a \ncollie, either. Some kind of dog.\n\nThey drive off. \n\nKIT\nWatch your heads.\n\nNEW ANGLE \n\nThe truck comes to a stop. Kit bangs on the driver's door. \n\nKIT\nHey. Woody. Gimme a cigarette.\n\nWOODY waves him off. Kit shrugs to Cato. \n\nKIT\nWoody wouldn't give me a cigarette. (pause) Ever notice he don't \ntalk much?\n\nCato agrees with this. They make a terrible racket, with no \nregard for the sleep of the neighbors. \n\nEXT. STREET \n\nHolly, whispering some rhyme to herself, twirls a baton in the \nmiddle of an empty street. \n\nHOLLY (v.o.)\nLittle did I realize that what began in the alleys and back ways \nof this quiet town would end in the Badlands of Montana.\n\nEXT. ALLEY \n\nKit tries to sell a passing BUM a pair of shoes. \n\nBUM\nNah. they wouldn't fit.\n\nKIT\nHow do you know? You hadn't tried them on yet.\n\nBUM\nNah.\n\nKIT\nGimme a dollar for them... Cost twenty new.\n\nThe Bum walks off. Kit pitches the shoes to Cato. \n\nKIT\nWhy don't you see if they fit you?\n\nCato picks them up and looks at them. \n\nCLOSE ON TRASH CAN \n\nKit is culling through a trash can, looking for valuables. \nreading other people's mail, etc. \n\nKIT (o.c.)\nThis lady don't ever pay her bills. She's gonna get in trouble if \nshe doesn't watch out.\n\nCato, ignoring him, picks up a magazine that is lying in the \ngrass. When the CAMERA returns to Kit, he has stripped off his \napron. \n\nKIT\nI throwed enough trash for today, Cato.... I'll see you In the \nmorning.\n\nHe slaps Cato on the back and walks off. Cato throws a mouldy \nloaf of bread at his back. \n\nCATO\nCatch!\n\nKIT\nWhat do you mean?\n\nHe throws the loaf back at Cato. \n\nEXT. ALLEYS \n\nKit walks through the deserted alleys of the sleeping town... as \nthe MAIN TITLES APPEAR. He balances a stolen mop on his finger; \nhe stomps a can and looks around to see if anyone has spotted him \nat this. As the CREDITS end he sees Holly in front of her house \ntwirling her baton. He crosses the street and introduces himself. \n\nEXT. FRONT LAWN \n\nKIT\nHi, I'm Kit. I'm not keeping you from anything important, am I?\n\nHOLLY\nNo.\n\nKIT\nWell, I was just messing around over there, thought I'd come over \nand say hello to you. (smiling) I'll try anything once. (pause) \nWhat's your name? I said mine.\n\nHOLLY\nHolly.\n\nKIT\nListen, Holly. you want to take a walk with me?\n\nHOLLY\nWhat for?\n\nKIT\nWell. I got some stuff to say. Guess I'm kind of lucky that way. \nMost people don't have anything on their minds, do they?\n\nHolly eyes him suspiciously. \n\nEXT. STREET \n\nThey walk down the middle of the street. Holly has accepted his \noffer. \n\nKIT\nOh, incidentally, my last name is Carruthers. Sounds a little too \nmuch like \u0093druthers,\u0094 doesn't it?\n\nHOLLY\nIt's okay.\n\nKIT\nWell, nobody asked me what I thought. They just hung it on me.\n\nHolly breaks the silence that follows. \n\nHOLLY\nYou still in school?\n\nKIT\nNah, I got me a job.\n\nHOLLY (o.c.)\nDoing what? \n\nKIT\nWell, I don't mind getting up early, so I got a job throwing \ngarbage... I'm not in love with the stuff, okay.\n\nIn the distance we hear Holly's FATHER calling her. She eases \noff. \n\nHOLLY\nThat's my father. I got to run.\n\nKIT\nHey. wait a minute. When am I going to see you again?\n\nHolly isn't sure how to reply. \n\nHOLLY\nWell, I know what my daddy's going to say.\n\nKIT (o.c.)\nWhat?\n\nHOLLY\nCan I be honest?\n\nKIT\nSure.\n\nHOLLY\nWell, that I shouldn't be seen with anybody that collects \ngarbage.\n\nKIT (o.c.)\nHe'll say that?\n\nHOLLY\nYeah.\n\nKIT (o.c.)\nNow what's he know about garbage, huh?\n\nHOLLY\nNothing.\n\nKIT (o.c.)\nThere you go.\n\nHOLLY\nWell, I mean there's nothing he wants to know about it... I've \ngot to run.\n\nShe waves goodbye and runs off. Kit waves back. \n\nEXT. HOLLY'S BACK YARD \n\nHolly walks into the back yard, where her father is working. \nHalf-painted signs lean against the garage. \n\nFATHER\nWho was that?\n\nHOLLY\nJust some boy.\n\nHe throws some paint off his brush onto the ground. \n\nHOLLY\nIs that going to kill the grass?\n\nHe flicks his brush teasingly at her feet. She retreats to a \nchair, giggling. \n\nHOLLY\nYou got some on my feet.\n\nFATHER\nWhat'd he want?\n\nHOLLY\nJust wanted to know if we needed any yardwork done... I said no, \nand for him not to bother us.\n\nINT. EMPLOYMENT AGENCY \n\nKit is talking with a CLERK inside an employment agency. \n\nCLERK (o.c.)\nYou ever held another job before?\n\nKIT\nI used to throw trash for the City.\n\nCLERK\nYou lost that one?\n\nKIT\nWouldn't be here if I hadn't.\n\nCLERK\nWhat kind of work do you think you would be qualified for? \n\nKIT\nI can't think of anything at the moment... I'd like you to write \nme out a slip, though, proving I came down here.\n\nThe Clerk leafs through his papers. \n\nCLERK\nWell, I think we could find you something... working cattle over \nat the pens.\n\nKit sighs. \n\nKIT\nWell. what the hell. Just hope there's a breeze.\n\nThe Clerk gives him a slip of paper. \n\nEXT. FRONT PORCH OF HOLLY'S HOUSE \n\nHolly sees Kit approaching the house. \n\nHOLLY (v.o.)\nHe was handsomer than anybody I'd ever met. He looked just like \nJames Dean.\n\nShe walks out the front door. \n\nKIT\nHi.\n\nHOLLY\nWell, stop the world.\n\nKIT\nQuit my job.\n\nHOLLY\nGreat.\n\nKIT\nJust seemed like the right move... Whatcha doing?\n\nHOLLY\nSpanish.\n\nKIT (o.c.)\nHow do you say \"Quit my Job\" in Spanish?\n\nHOLLY\nSomething mi trabajo.\n\nKit offers her a cigarette, which she declines. \n\nKIT\nYeah, well, I'm going to work as a cowboy now... Or thinking \nabout it. It's a routine, like anything. What do you think?\n\nHOLLY\nI don't know.\n\nHe pulls himself up onto the bannister beside her. \n\nKIT\nWell, at least nobody could get on me about wearing these boots \nany more.\n\nShe watches him intently. This makes him uncomfortable. \n\nKIT\nYou want to go for a ride?\n\nHOLLY\nWell, I got homework.\n\nKIT (o.c.)\nBring it along.\n\nHis forwardness surprises her. \n\nEXT. DOWNTOWN STREET IN FT. DUPREE \n\nThey are walking through the downtown area. Kit kicks a paper bag \nthat someone has discarded on the sidewalk. \n\nKIT\nSomebody dropped a bag on the sidewalk.\n\nShe appears nervous about being seen alone with him. \n\nKIT\nEverybody did that, the whole town'd be a mess ... Hi.\n\nHe greets a passing stranger. \n\nKIT\nYou're a redhead.\n\nHOLLY\nI know.\n\nKIT\nAnybody ever call you \"Red\"?\n\nHOLLY\nYeah, but I don't like it.\n\nKIT\nWhy not?\n\nHOLLY\nJust don't... I've got a headache.\n\nKIT\nYeah?\n\nHe steers her toward his car, a customized Mercury. As she gets \nin, he asks her\n\n\nKIT (o.c.)\nCan I come around and see you tomorrow?\n\nHOLLY (startled)\nOkay.\n\nEXT. FEEDLOT - SERIES OF ANGLES \n\nWe see Kit at work at the feedlot. throwing hay to the cattle, \nfeeding them pills, etc. \n\nHOLLY (v.o.)\nKit went to work in the feedlot while I carried on with my \nstudies. Little by little we fell in love... As I'd never been \npopular in school and didn't have a lot of personality, I was \nsurprised that he took such a liking to me, especially when he \ncould've had any other girl in town if he'd given it half a try.\n\nThe MONTAGE includes a shot of Holly running toward Kit's car for \nsome rendezvous. \n\nHOLLY (v.o.)\nHe said that I was grand, though, that he wasn't interested in me \nfor sex and that coming from him this was a compliment. Held \nnever met a fifteen-year-old girl who behaved more like a grownup \nand wasn't giggly. He didn't care what anybody else thought. I \nlooked good to him, and whatever I did was okay, and if I didn't \nhave a lot to say, well, that was okay, too.\n\nEXT. TREE BESIDE RIVER \n\nKit and Holly are sitting under a tree. playing cards on a \nblanket. Holly surveys the area. \n\nHOLLY\nWhat a nice place.\n\nKIT (absorbed in game)\nYeah, the tree makes it nice.\n\nHOLLY\nAnd the flowers... Let's not pick them. They're so nice.\n\nKIT\nIt's your play.\n\nSERIES OF ANGLES \n\nHolly's father paints a picture. using a stereopticon to help \nwith his backgrounds. TRACK with Kit driving down a street in his \nMercury. Holly sits watching football practice. \n\nHOLLY (v.o.)\nOf course I had to keep all this a secret from my dad. He \nwould've had a fit, since Kit was ten years older than me and \ncame from the wrong side of the tracks, so called. Our time with \neach other was limited and each lived for the precious hours when \nhe or she could be with the other away from all the cares of the \nworld.\n\nEXT. UNDERNEATH BLEACHERS \n\nKit and Holly are necking underneath some bleachers. In the \ndistance we hear the NOISE of the football practice. \n\nHOLLY\nMy stomach's growling.\n\nKIT\nThere's an old Fudgesicle over there. You want it?\n\nHOLLY\nNo.\n\nKit laughs, and starts her laughing, too. \n\nKIT\nSomebody else is going to get it.\n\nHOLLY\nI don't care.\n\nKIT\nKids eat that kind of stuff in Korea.\n\nAt this her expression turns serious. \n\nSERIES OF ANGLES \n\nKit in CLOSEUP at a fence in the feedlot, an intense look on his \nface. \n\nVARIOUS ANGLES of the cattle in their pens. They look numb and \nmorose. \n\nTIGHT SHOT of Holly necking with Kit. \n\nHOLLY (v.o.)\nIn the stench and slime of the feedlot, he'd remember how I \nlooked the night before, how I ran my hand through his hair and \ntraced the outline of his lips with my fingertip. He wanted to \ndie with me, and I dreamed of being lost forever in his arms.\n\nEXT. HOLLY'S BACK YARD \n\nTIGHT SHOT of Holly's pet catfish in a bowl. \n\nCUT TO WIDE SHOT of Holly with gloves on carrying the fish \nthrough the garden in back of her house. She looks around warily, \nthen throws it out among the melons. \n\nHOLLY (v.o.)\nThe whole time, the only thing I did wrong was throwing out my \nfish when he got sick. Later I got a new one, but this incident \nkept on bothering me and I turned to Kit.\n\nEXT. STREET \n\nKit and Holly walk down a sidewalk in the residential part of \ntown. Kit is consoling her about the fish. \n\nHOLLY (v.o.)\nI didn't mind telling Kit about stuff like this, cause strange \nthings happened in his life, too, and some of the stuff he did \nwas strange.\n\nEXT. FEEDLOT \n\nKit steps on top of a dead cow, as though to convince himself \nthat it is dead. \n\nHOLLY (v.o.)\nFor instance,. he faked his signature whenever he used it, to \nkeep other people from forging important papers with his name...\n\nINT. HOLLY'S BEDROOM - NIGHT \n\nThe CAMERA DOLLIES BACK to reveal Kit lying in bed. His attitude \nsuggests that this is a scene of her fantasy. \n\nHOLLY (v.o.)\nAnd as he lay in bed, in the middle of the night, he always heard \na noise like somebody was holding a seashell against his ear. And \nsometimes he'd see me coming toward him in beautiful white robes, \nand I'd put my cold hand on his forehead.\n\nEXT. RIVERBANK \n\nKit puts on his jacket and heads down a riverbank to the edge of \nthe water. Holly comes into view, buttoning her blouse. \n\nHOLLY\nDid it go the way it 'uz supposed to?\n\nKIT\nYeah.\n\nHOLLY\nIs that all there is to it?\n\nKIT\nYeah.\n\nHer questions make him uncomfortable. \n\nHOLLY\nGosh, what was everybody talking about?\n\nKIT\nDon't ask me.\n\nSilence. \n\nHOLLY\nWell. I'm glad it's over... For a while I was afraid I might die \nbefore it happened... Had a wreck, some deal like that.\n\nKit points to an uprooted tree lying in the water a hundred feet \naway. \n\nKIT\nYou see where that tree fell in the water?\n\nHe climbs back up the bank. \n\nHOLLY\nYeah... The river must've washed the roots away... You don't care \nabout anything I say, though.\n\nDISSOLVE TO\n\n\nEXT. NEIGHBORING AREA \n\nHolly walks down the bank of the river. Kit falls in behind her, \ncarrying a large stone. The CAMERA DOLLIES with them. \n\nKIT\nYou know what I think?\n\nHOLLY\nWhat?\n\nKIT\nThat we should crunch our hands with this stone. That way we'd \nnever forget what happened today.\n\nHOLLY\nBut it would hurt.\n\nKIT\nWell, that's the point, stupid.\n\nShe gives him a cold look. \n\nHOLLY\nDon't call me stupid.\n\nKIT\nOkay, but I'm going to keep it for a souvenir...\n\nHe throws it awav and picks up a smaller one. \n\nKIT\nOr maybe one that's lighter.\n\nHe walks over to the car. A bridge is visible in the distance. \n\nEXT. FIELD \n\nKit releases a large red balloon into the evening sky. A small \nbasket is fixed to the bottom of the balloon. \n\nHOLLY (v.o.)\nKit made a solemn vow that he would always stand beside me and \nlet nothing come between us. He wrote this out in writing, put \nthe paper in a box with some of our little tokens and things, \nthen sent it off in a balloon he'd found while on the garbage \nroute. (pause) His heart was filled with longing as he watched it \ndrift off. Something must've told him that we'd never live these \ndays of happiness again, that they were gone forever.\n\nDISSOLVE TO\n\n\nEXT. CATTAILS \n\nHolly's dog bounds through a stand of cattails. Holly speaks \nangrily to her father, who walks toward the dog with a gun. We do \nnot hear their voices, only music. He shoots the dog and Holly \nruns off in horror. \n\nHOLLY (v.o.)\nThen, sure enough, Dad found out I'd been running around behind \nhis back. He was madder than I'd ever seen him. As punishment for \ndeceiving him, he went and shot my dog.\n\nEXT. BRIDGE \n\nHolly's father drags a duffel bag out of his truck and dumps it \nover the side of a bridge, into a river. It goes under briefly, \nthen bobs to the surface. The current takes it off. \n\nDISSOLVE TO\n\n\nEXT. MUSIC SCHOOL \n\nHolly sits in the second-story window of a music school. \n\nHOLLY (v.o.)\nHe made me take extra music lessons every day after school and \nwait there till he came to pick me up. He said that if the piano \ndidn't keep me off the streets. maybe the clarinet would.\n\nDISSOLVE TO\n\n\nEXT. BILLBOARD \n\nKit approaches Holly's father, who is hard at work, painting a \nbillboard along a deserted stretch of road. Kit is eating a \npeach. \n\nKIT\nSure is pretty.\n\nFATHER\nWhat'd you come out here for?\n\nKIT\nI wasn't aware there was any law against it.\n\nKit sees that this kind of talk will not do. He is silent for a \nmoment, then throws the peach away. \n\nKIT\nYou know Holly... well. she means a lot to me, sir.\n\nHolly's father goes solemnly about his business. \n\nKIT\nYou know, before I met her, nobody could ask me how I was doing \nwith my girl. Matter of fact, I didn't really have one.\n\nFATHER\nIs that right?\n\nKIT\nYeah.\n\nKit walks off a few paces and leans against the father's truck. \n\nKIT\nIt okay me leaning on your Willys here?\n\nHolly's father does not answer. \n\nKIT\nListen. I got a lot of respect for her, sir. (pause) That's about \nas good a one as I know to tell you.\n\nFATHER\nWell, it's not good enough. (pause) Just what do you think would \nhappen to her if she stuck around with you, Kit? Guy like you.\n\nKIT\nShe'd get along okay. And if she didn't, well, she could take \noff, just take off, (and) I wouldn't mind... I'd always tell \npeople I deserved it.\n\nHolly's father comes to his feet and fixes Kit in the eye. \n\nFATHER\nYou get out of here. I don't want you hanging around any more. \nYou understand?\n\nHe lets these words sink in, then returns to his seat. \n\nFATHER\n(shaking his head) You're something.\n\nKit waves goodbye. \n\nKIT\nTakes all kinds, sir.\n\nHe walks to his car, looking back once. \n\nSERIES OF ANGLES \n\nLONG SHOT of father at work at billboard. Kit approaches Holly's \nhouse, collects the evening newspaper from the sidewalk, and \nknocks on the front door. Holly's father picks her up from a park \noutside the music school. Kit, when he gets no answer, enters the \nhouse. The jeep, with Holly and her father, rumbles down a \nresidential street. \n\nINT. HOLLY'S HOUSE \n\nKit is going through Holly's dresser, throwing her things into a \nsuitcase. A pistol is visible in his back pocket. Suddenly, \nHolly's father appears in the dresser mirror, standing at the end \nof the hall outside the bedroom. \n\nKit walks forward to greet him. The CAMERA DOLLIES with him. \n\nKIT\nHi.\n\nFATHER\nWhat're you doing?\n\nKIT\nI've got a gun here, sir. It's always a good idea to have one \naround.\n\nKit draws the pistol. He is shaken, though he must have seen this \ncoming. \n\nFATHER\nWhat do you think you're doing? Go on, get out of here.\n\nKIT\nWell, I got it all planned... and I'm taking Holly off with me.\n\nHe looks at Holly, who has appeared on the landing, uncertain \nwhat her reaction to all this will be. \n\nFATHER\nOkay, boy, I'm turning you over to the authorities.\n\nKit steps forward as Holly's father starts down the stairs. \n\nKIT\nWhat for?\n\nFATHER\nFor coming onto my property... With a gun.\n\nKIT\nNo, you're not either.\n\nFATHER (o.c.)\nYeah? Why not?\n\nKIT\nCause I can't allow it.\n\nHolly's father stares at him for a moment, then continues down \nthe stairs. Kit starts forward. \n\nKIT\nHey... Hey, wait a minute.\n\nHis shout arrests Holly's father at the bottom of the stairs. \n\nKIT\nSuppose I shot you. How'd that be? Huh?\n\nHolly's father does not move. \n\nKIT\nYou want to hear what it sounds like?\n\nHe fires a shot into the stairs. The report is deafening in the \nenclosure of the stairwell. They exchange looks. Kit's breathing \nis heavy. \n\nINT. LIVING ROOM \n\nHolly's father turns and walks into the living room. Kit rushes \ndown the stairs. Holly shouts his name. \n\nKIT\nHey, where you going?\n\nHe fires two shots into Holly's father, who slowly sinks to the \nfloor. Kit unlimbers his shoulder. Holly rushes down the stairs \nto her father's side. \n\nHOLLY\nDaddy... This is Holly... Are you going to be okay?\n\nHer father does not respond. She looks back at Kit, who avoids \nher gaze. She gets to her feet and walks nto the kitchen. Kit \nfollows her. \n\nINT. KITCHEN \n\nKit closes the back door to the house. \n\nKIT\nI came in the front.\n\nHOLLY\nHow bad off is he?\n\nKIT (o.c.)\nI can look and see.\n\nHOLLY\nWe better call the doctor... Listen. I'll say how it happened, \npart I saw.\n\nKIT (sighs)\nWell... I don't think that'd work.\n\nThis startles Holly. \n\nINT. LIVING ROOM \n\nKit touches the father's heart. \n\nKIT\nHe don't need a doctor.\n\nHe walks back into the kitchen. \n\nHOLLY\nAre you sure?\n\nKIT\nYou don't believe me, see for yourself.\n\nHolly stares at her father. \n\nDISSOLVE TO\n\n\nEXT. HOLLY'S HOUSE - DUSK \n\nLOW ANGLE of Holly's house silhouetted against the evening sky. \nOn sound the NOISE of CICADAS. \n\nINT. CELLAR \n\nKit drags Holly's father into the cellar. sets him down gently, \nthen eases out of the room, taking a discarded toaster with him. \n\nINT. KITCHEN - NIGHT \n\nKit comes up the steps from the cellar. Holly stands at the \ndrainboard. \n\nKIT\nI found a toaster.\n\nHe sets down the toaster and walks over to Holly's side. \n\nKIT\nListen, honey. I don't want to...\n\nShe slaps him across the forehead. He walks into the now darkened \nliving room, and sits down at the piano. After a moment Holly \nfollows him. \n\nINT. LIVING ROOM ~ NIGHT \n\nHolly sits down on the sofa across from Kit. \n\nHOLLY\nListen, maybe we ought to tell somebody about this.\n\nKIT\nYou said that once already... Too late now.\n\nHOLLY\nWhy?\n\nKIT\nThey're not going to listen to me. You either. Are you kidding?\n\nA silence follows. \n\nHOLLY\nSuppose the neighbors heard the noise?\n\nKIT\nWouldn't be funny... Listen, I'll be back in a while.\n\nHe gets up and heads for the front door. \n\nKIT\nOh... You want to call the police, that's fine. Just won't be so \nhot for me.\n\nThere are tears in Holly's eyes now. They exchange looks as Kit \nopens the front door. Then he leaves. Holly settles back on the \ncouch. \n\nEXT. HOLLY'S HOUSE - NIGHT \n\nThe house by night. \n\nINT. HALLWAY AND BEDROOM - NIGHT \n\nHolly comes up the stairs, smoking a cigarette. She walks to her \nbedroom window. The CAMERA DOLLIES with her. Outside, under the \nstreet lamp, she can see two boys trading secrets. \n\nINT. TRAIN STATION - NIGHT \n\nKit puts fifty cents into a gramophone booth. He clears his voice \nas the machine whirs Into operation. \n\nKIT\nMy girl Holly and I have decided to kill ourselves, same way I \ndid her dad. Big decision huh? Well, the reasons are obvious, and \nI don't have time to go into them right now... One thing, \nthough... He was provoking me when I popped him. That's what it \nwas like, a POP.\n\nInserts of the booth's mechanism\na light panel measuring off the seconds and the needle on the \nrecord. \n\nKIT\nCourse nobody's coming out of this thing happy, especially not \nus. You can't deny we've had fun, though. Which is more than I \ncan say for some.... Mmmm. that's the end of the message. I run \nout of things to say... Thank you.\n\nHe gets these last words in just as his time is up. He gets the \nrecord and steps outside the booth, into the lobby of a train \nstation. \n\nDISSOLVE TO\n\n\nINT. HOLLY'S LIVING ROOM - SERIES OF ANGLES - NIGHT \n\nKit slams a ten-gallon can of gasoline down on the piano bench, \nopens it and begins pouring it out over the interior of the \nhouse, kicking aside everything that comes in his way. \n\nEXT. REAR OF HOUSE - NIGHT \n\nHolly comes out the screen door at the back of the house, \ncarrying a suitcase and a painting. Kit appears with a lamp on an \nextension cord. He sets it down beside a victrola he has set up \non a table outdoors. He puts the needle on the record he recorded \nearlier. Holly watches him as she retreats to the car. \n\nHOLLY (v.o.)\nKit left a record playing over and over for the District Attorney \nto find. He was gambling for time.\n\nKit unplugs the lamp, lights a book of matches and pitches them \ninto a puddle of gas. The back porch of the house explodes into \nflame. Kit runs to the car with the lamp, caught off guard by the \nforce of the flames. They drive off. \n\nINT./EXT HOUSE ON FIRE - SERIES OF ANGLES - NIGHT \n\nVarious objects around the house burst into flames\na picture we saw on the stairs. some peacock feathers, a \ncantaloupe and a pomegranate left on the kitchen table, the \nliving room, Holly's bedroom, the bed itself, a doll on the bed, \nan A&W Root Beer sign outside the house, a water can, flames \nswirling out the front of the house. Holly's father in CLOSEUP in \nthe cellar, sheet music lifting off the piano. etc. At length the \nCAMERA PANS over the charred frame of Holly's bed. Outside a \nfireman moves with a flashlight through the embers of the house. \n\nINT. SCHOOL CORRIDOR \n\nHolly collects her books from a locker at her school and walks \nanxiously down a corridor towards the exit. \n\nHOLLY (v.o.)\nKit made me get my books from school, so I wouldn't fall behind. \nWe'd be starting a new life, he said. and we'd have to change our \nnames. His would be James. Mine would be Priscilla. We'd hide out \nlike spies, somewhere in the North, where people didn't ask a lot \nof questions.\n\nEXT. SCHOOL - DAWN \n\nHolly breaks into a run as she comes through the front door of \nthe high school. Kit waits for her at the car. There is nobody \nelse in sight. \n\nHOLLY (v.o.)\nI could of snuck out the back or hid in the boiler room, I \nsuppose, but I sensed that my destiny now lay with Kit, for \nbetter or for worse, and that it was better to spend a week with \none who loved me for what I was than years of loneliness.\n\nShe gets into the car and they drive off. \n\nINT. MERCURY - DAWN \n\nKit studies Holly for signs of her mood. \n\nKIT\nHow you doing?\n\nHOLLY (neutrally)\nI'm fine. Kind of tired. \n\nKIT\nYeah, me too.\n\nThe car sails down a quiet street. \n\nDISSOLVE TO\n\n\nEXT. RIVER \n\nThe CAMERA DOLLIES with a tree floating down a swollen river. \nCottonwood trees cover the far bank. \n\nHOLLY (v.o.)\nWe hid out In the wilderness,down by a river in a grove of \ncottonwoods. It being the flood season we built our house in the \ntrees, with tamarisk walls and willows laid side by side to make \na floor. There wasn't a plant in the forest that didn't come in \nhandy.\n\nCLOSEUPS OF PLAIQTS - SERIES OF ANGLES \n\nDetails of the cottonwoods, willow and tamarisk. Music continues \nunder. \n\nEXT. TREEHOUSE - SERIES OF ANGLES \n\nDetails of Kit and Holly building the treehouse. Kit pounds a log \ninto place wi h a tomahawk; Holly scrapes the bark off a log with \na piece of flint; Kit weaves tamarisk branches through the frame \nof the house. This MONTAGE ends with a PAN DOWN the four stories \nof the completed treehouse. \n\nHOLLY (v.o.)\nWe planned a huge network of tunnels under the forest floor, and \nour first order of business every morning was to decide on a new \npassword for the day. ow and then weld sneak out at night and \nsteal a chicken or a bunch of corn or some melons from a melon \npatch... Mostly. though, we just lay on our backs and stared at \nthe clouds and sometimes it was like being in a big marble hall. \nthe way we talked in low voices and heard the tiniest sound.\n\nINT. TREEHOUSE \n\nThe CAMERA PANS off Holly's painting, a Maxwell Parrish, onto Kit \nasleep with his pistol beside him. then onto Holly under a quilt \nwith a box of shells beside her. Her hand quivers once. \n\nEXT. TREE TOPS \n\nKit lifts an egg out of a bird's nest at the top of a tree. He \ndrops it down to Holly, fifty feet below. \n\nHOLLY (v.o.)\nThey hadn't found but one set of bones in the ashes of the house. \nso we knew they'd be looking for us. Kit made sure we'd be \nprepared.\n\nEXT. TRAIL - SERIES OF ANGLES \n\nKit cuts a piece of twine that lies across a trail, whereupon a \nball full of spikes comes swinging down out of the trees. with \nlethal force. Kit ducks out of the way. We next see Kit with a \ndew ag around his forehead, running laps through the woods as \npart of his training. He exhorts himself to greater effort. \n\nHOLLY (v.o.)\nHe gave me lectures on how a gun works, how to take it apart and \nput it back together again. in case 1 had to carry on without \nhim. He said that if the Devil came at me, I could shoot him with \na gun.\n\nEXT. TAMARISK \n\nHolly struggles through the undergrowth witha yoke over her \nshoulders, carrying wood back to the teahouse. \n\nHOLLY (v.o.)\nOne day, I carried thirty pounds of wood a distance of five \nmiles. Another day, while hiding in the forest, I covered my eyes \nwith makeup, to see how they'd come out.\n\nTIGHT ON HOLLY'S EYES \n\nHolly has made her eyes up with mascara. \n\nEXT. FRONT OF TREEHOUSE \n\nKit and Holly dance the stroll to the sound of Mickey and Sylvia \non their Zenith portable. Holly shows a better sense of rhythm \nthan Kit. \n\nEXT. MUD FLAT BESIDE RIVER - DUSK \n\nKit lifts a fish out of the river with a crude device like a \nlacrosse net. Holly sits on the bank In the b.g. The fish \nwriggles out of the net and falls back In the water. Kit \nstruggles in vain to retrieve it. \n\nHOLLY (v.o.)\nWe had our bad moments, like any couple. Kit accused me of only \nbeing along for the ride,while at times I wished he'd fall in the \nriver and drown, so I could watch.\n\nKit throws his net down in disgust, partly at Holly. \n\nKIT\nTake a break. Red... Life of Riley, huh?\n\nHolly ignores him as he walks off down the flat. \n\nHOLLY (v.o.)\nMostly. though. we got along fine and stayed in love.\n\nEXT. FRONT OF TREEHOUSE \n\nHolly, in curlers, walks over to where Kit is shaving. \n\nHOLLY\nOne of the chickens died last night.\n\nShe pats a little water on her face, dries it with a burlap \ntowel, picks up a hatchet and walks off into the forest to cut \nthe morning's firewood. \n\nHOLLY\nI almost stepped on him.\n\nEXT. UPPER DECK \n\nHolly sits on the upper deck of the treehouse, reading Kon-Tiki \naloud to Kit. \n\nHOLLY\n\"The Kon-Tiki in motion was a little different from what it \nusually was in such conditions. We had become sensitive to \nchanges in the rhythm of the logs. I thought at once of suction \nfrom the coast, which was drawing near, and was continually out \non the deck and up the mast...\"\n\nKIT\nHe was nervous.\n\nHolly looks at him for a moment, trying to understand the meaning \nof this interruption, then resumes\n\n\nHOLLY\n\"Time passed. At dawn, just before six, Torstein came hurrying \ndown from the masthead. He could see a whole line of small palm-\nclad islands far ahead...\"\n\nEXT. RIVER \n\nHolly walks down the edge of the river, fresh from her bath. \nwrapped in a white sheet. The river is raging, with white caps \nvisible in places. \n\nEXT. FOREST \n\nA strange animal, not a deer or a horse, but like them, moves \nlanguidly through the thick of the forest. Holly puts down her \nbinoculars, amazed. \n\nHOLLY (v.o.)\nI grew to love the forest. The cooing of the doves and the hum of \ndragonflies in the air made it always seem lonesome and like \neverybody's dead and gone...\n\nEXT. CROW'S NEST \n\nKit sits in the crow's nest at the top of the treehouse, browsing \nthrough a copy of National Geographic. amused by what he sees, \nlooking around to find somebody he can share it with. \n\nHOLLY (v.o.)\nWhen the leaves rustled overhead, it was like the spirits were \nwhispering about all the little things that bothered 'em.\n\nTIGHT ON SLIDES \n\nAn array of stereo slides is spread out on the leaves of the \nforest floor. Holly puts one in her stereopticon and studies it. \nKit greets her as he walks by with a log over his shoulder. \n\nHOLLY (v.o.)\nOne day, while taking a look at some vistas in Dad's \nstereopticon, it hit me that I was just this little girl, born in \nTexas, whose father was a sign painter and who had only just so \nmany years to live ...\n\nTIGHT ON SLIDES \n\nWith each of her thoughts a slide appears\na canal in Brazil, a camel boy in front of the Great Pyramid. \nsome cows standing in a fjord with a steamship in the distance, a \nmother with her child, a woman playing the piano as another woman \nlooks on, a family on a lawn, a soldier in a wheatfield \nwhispering something into his girlfriend's ear. \n\nHOLLY (v.o.)... It sent a chill down my spine, and I thought\nWhere would I be this very moment if Kit had never met me? ... Or \nkilled anybody? This very moment... If my Mom had never met my \nDad? If she'd of never died?... And what's the man I'll marry \ngoing to look like? What's he doing right this minute? ... Is he \nthinking about me now, by some coincidence, even though he \ndoesn't know me? Does it show on his face?\n\nEXT. RIVER \n\nKit is fishing with his crude net. He stops briefly to watch a \ntruck passing down the highway In the distance, then goes back to \nwork. This stretch of river seems dangerously close to \ncivilization. \n\nHOLLY (v.o.)\nFor days afterward I lived in dread. At times I wished I could \nfall asleep and be taken off to some magical land, but this never \nhappened.\n\nKit, frustrated draws his pistol from his back pocket and looks \naround for the fish that has been eluding him. He does not see, \nas we do, a MAN watching him from across the river. He fires at \nthe fish. misses it and fires again. The Man across the river \nhesitates. then moves back into the undergrowth. \n\nDISSOLVE TO\n\n\nSERIES OF ANGLES - TREEHOUSE \n\nHolly is off somewhere in the forest. putting on lipstick. Kit \nsits on watch in the crowls nest, a pair of binoculars close at \nhand. On sound, over the music, we hear voices whispering to \nthem. Kit sees a movement in the brush. A moment later a figure \nappears, a hunter, carrying a gun. Kit shouts a code word to \nHolly. She takes off running, as Kit clambers down the planks of \nthe treehouse and collects his shotgun. He tells her to hide, \nruns through the woods and dives in a hole, under a cover of \nleaves. She jumps behind a log. Several shots of the still forest \nfollow, then the hunters appear, a shoulder here. pant leg there. \nThe music ends as one of them cocks his gun. They pass right over \nthe hole where Kit is hiding. Kit rises up slowly, gives them a \ngentlemanly word of warning, then shoots all three in the back. \nHe checks to see if anybody else is with them, then calls weakly \nout to Holly. \n\nKIT\nHolly!\n\nHolly picks her way through the brush, back to the treehouse. \n\nEXT. TREEHOUSE \n\nThey are packed up and ready to leave. Kit slams the trunk of the \nMercury. \n\nKIT\nGet in the car, Red.\n\nHe takes a bird cage off the roof of the car and throws it away. \n\nKIT\nWe don't need this.\n\nHe climbs a ladder, looks In the cabin of the treehouse to see if \nthey've left anything behind, then jumps down. He flips over the \nwicker hemisphere that covers their rooster. The rooster walks \noff, free. He surveys the woods, then looks back at Holly, who \nreturns his look and gets in the car. \n\nHOLLY (v.o.)Kit felt bad about shooting those men in the backs. \nbut he said they'd come in like that. and they would've played it \nas down and dirty as they could, and besides, held overheard them \nwhispering about how they were only interested in the reward \nmoney. With lawmen it wouldtve been different. They were out \nthere to get a job done and they deserved a fair chance. But not \na bounty hunter.\n\nEXT. BADLANDS - SERIES OF ANGLES \n\nWe see a flat expanse of the Badlands. The Mercury appears over \nthe horizon and heads toward a solitary house. A man appears at \nthe door of the house, Kit's friend, Cato. \n\nHOLLY (v.o.)\nWe went to hide out with a friend of Kit's from the days of the \ngarbage route.\n\nEXT. CATO'S HOUSE. \n\nKit gets out of the car, takes a chicken from the back seat and \nwalks over to face Cato. He keeps a safe distance. \n\nKIT\nHow you doing, Cato?\n\nCATO\nNot bad.\n\nKit steps forward, rifle in hand, and offers Cato the chicken. \n\nKIT\nTake that sombitch.\n\nCato takes it, a wan smile on his face. \n\nKIT\nWhat you been doing?\n\nCATO\nRunning this place for a fella in town. Nothing much to speak of.\n\nKIT\nWell, I don't notice us hustling trash, either.\n\nKit walks over to inspect the interior of Cato's house. \n\nKIT\nWhere'd you get them antlers?\n\nCATO (o.c.)\nThey come with the house.\n\nHe refers to a set of deer antlers, mounted over the door. Kit \nlooks inside, then back at Cato. \n\nKIT\nOh, Cato, I want you to meet my girl, Holly Sargis.\n\nHolly smiles and says hello. \n\nEXT. PICNIC TABLE \n\nThey sit at a picnic table under a tree, having lunch. Holly is \ntelling a joke at Kit's urging. \n\nHOLLY\nDid you hear the one about the guy in the nuthouse that went \naround naked, with only a hat and gloves on, and this nurse came \nup to him and said, \"Hey, what... You can't walk around that \nway,\" and the guy says, \"What's the matter? Nobody comes around \nhere.\" Anyway, the nurse says, \"What do you have the hat and \ngloves on for, then?\" And the guy says, \"Well, you never know.\"\n\nCato bursts into laughter. \n\nKIT\nIsn't that funny?\n\nCato stops laughing. He wants to give Kit the right answer. \n\nCATO\nYeah, I guess.\n\nKIT (o.c.)\nShe plays the clarinet, too.\n\nHolly smiles politely. \n\nHOLLY\nDon't you ever get bored around here?\n\nCATO\nSometimes. The other day, though, an old boy was plowing in the \nfield over there, found some old Spanish coins.\n\nKIT\n(suspicious)\nThat's what he told you, huh?\n\nCATO (o.c.)\nNo, he showed me one.\n\nHOLLY\nWhat'd they look like?\n\nCATO (o.c.)\nKind of round, like so... Gold. I'll show you if you want.\n\nKit and Holly eye one another. Kit sees the chance to make a \nfortune here. He is careful to conceal his feelings, though. \n\nKIT\nLet me finish my supper.\n\nHolly, big-eyed, bites into an apple. \n\nEXT. FIELD \n\nKit, Holly and Cato walk out to the field where Cato heard the \ncoins were found. Holly picks up a pot lid. \n\nKIT\nWe're thinking of going down to Texas. Holly wants to visit some \nof her people down there, but after that I don't know... They say \nMexico's nice.\n\nCato stops. \n\nCATO\nKit... Maybe I'd better get a shovel.\n\nKIT\nOkay.\n\nCATO\nI'll catch up with you.\n\nKIT\nOkay.\n\nKit walks out into the field to join Holly. Cato turns back. \n\nHOLLY\nI found a lid. It was laying on the ground over there.\n\nKIT\nPut that down. It's dirty.\n\nHolly tosses the lid at him. He picks up some dirt clods and \nstarts throwing them at her. She squeals and dodges. CATO watches \nthem for a while, indecisive, then turns and runs. \n\nHOLLY (o.c.)\nHey, you're throwing big ones!\n\nSuddenly, Kit spots Cato. \n\nKIT\nCato!\n\nCato jumps over a trough and comes to a stop in front of his \ntruck, a water tanker. \n\nCATO\nThe shovel's in the truck.\n\nKit raises his gun and shoots Cato through the belly. CATO falls, \nthen gets to his feet and stumbles toward the front door of the \nhouse. Kit follows him for a while, then skips forward and opens \nthe door for him. \n\nINT. BEDROOM \n\nCato falls on his bed and rolls over to face Kit. Kit walks in \ncalmly and picks up a photo on the bureau. \n\nHOLLY (v.o.)\nKit never let on why he'd shot Cato. He said that just talking \nabout it could bring us bad luck and that right now we needed all \nthe luck we could get.\n\nKit sets the photo down. \n\nKIT (o.c.)\nYou never told me about her.\n\nHe looks under the bed, then walks out the door. \n\nINT. LIVING ROOM \n\nHolly stands near a window. smoking a cigarette. Kit sets his \nrifle down and surveys the room, which is cluttered with odds and \nends. \n\nKIT\nLook at all this junk.\n\nHOLLY\nHow's he doing?\n\nKIT\n(shrugging)\nI got him in the stomach.\n\nHolly sits down. \n\nHOLLY\nIs he upset?\n\nKIT\nHe didn't say anything to me about it.\n\nHe takes a drag off her cigarette and gives it back to her. He \nleafs idly through a catalogue on the table, then walks over to \nlook in the bedroom. \n\nKIT\nBunch of junk.\n\nInside the bedroom Cato is still conscious, but his breathing is \nheavy. Kit walks back to Holly's side. HOLLY is looking through \nthe catalogue. \n\nKIT\nHe stole that cage. I saw him doing it.\n\nKit wants this to have been an execution, not a murder. \n\nKIT\nWhatcha looking in there for? We can't afford any of that.\n\nHOLLY (defensive)\nJust looking.\n\nINT. BEDROOM \n\nAs they bicker in the other room, Cato inspects his face in a \nmirror. \n\nKIT (o.c.)\nWhy don't you go in there and keep him company for a while?\n\nHolly walks in the door. \n\nHOLLY\nHi.\n\nShe sits down. \n\nHOLLY\nThat your spider in there? in that bottle?\n\nCATO\nYeah.\n\nHOLLY\nWhat do you feed him?\n\nCATO\nOh, flies... grasshoppers when I can catch 'em.\n\nHOLLY\nDoes he bite?\n\nCATO\nHe never bit me.\n\nWe hear the sound of a car HORN in the distance. HOLLY\nturns and looks. \n\nEXT. CATO'S HOUSE \n\nA 1951 Studebaker approaches the house. There are two people \ninside, a BOY and a GIRL. Kit comes out the front door. The Boy \nand Girl get out, but seeing Kit, they wait by the car. \n\nBOY\nHi. where's Cato?\n\nKIT\nWell, he's gone.\n\nBOY\nGone? ... Where?\n\nKIT\nHe said not to tell.\n\nBOY (o.c.)\nOh yeah?\n\nKIT\nYeah, he said for you to give us a lift into town. You're the \nones with the Studebaker, aren't you?\n\nThe Boy hesitates a second, then starts for the house. \n\nBOY\nWell, I just need to pick up something in the house.\n\nKit draws his gun. \n\nKIT\nNo... You go in there, I'll have to kill you.\n\nBOY\nWhat's going on?\n\nKIT\nCan't afford to take chances.\n\nThe Girl is baffled. \n\nKIT (o.c.)\nCome on out of there, young lady.\n\nKit waves them out into the neighboring field with him. \n\nKIT\nLet's us step out in this field here.\n\nThe Boy raises his hands. \n\nKIT\nNah, skip that... I'm going to have to keep an eye on you, \nthough.\n\nBOY\nOkay.\n\nKIT\nYou don't mind?\n\nHolly steps out the front door and smiles at the girl. \n\nHOLLY\nHi.\n\nEXT. FIELD \n\nHolly and the girl walk through the field toward a storm cellar \nwhere the boys are waiting for them. The wind is blowing hard. \n\nGIRL\nWhat's going to happen to Jack and me?\n\nHOLLY\nYou have to ask Kit. He says frog, I jump.\n\nGIRL\nOkay.\n\nHOLLY\nWhat's your friend's name?\n\nGIRL\nJack.\n\nHOLLY\nYou love him?\n\nGIRL\nI don't know.\n\nHolly thinks about this for a moment. \n\nHOLLY\nI've got to stick by Kit... He feels trapped.\n\nGIRL\nYeah. I can imagine.\n\nHOLLY\nWell, I've felt that way, hadn't you?\n\nEXT. STORM CELLAR \n\nKit guides the couple into the storm cellar. \n\nKIT\nOkay, you two, down in the cellar.\n\nThey head down the steps into the cellar, the Girl first. Kit \nstops the Boy for a moment. \n\nKIT\nYou promise to stay down there for an hour?\n\nBOY\nYeah.\n\nKIT\nYou expect me to believe that?\n\nHe looks back at Holly, as though to ask whether he should. \n\nBOY\nYeah.\n\nKit nods and waves the Boy down into the cellar. The Boy \ndisappears. Kit shuts the door. \n\nKIT\nI'm going to shut the door.\n\nKit sticks a pin through the latch, hesitates, then fires two \nshots down through a seam into the cellar. He retreats to Holly's \nside. a little surprised at what he did. \n\nKIT\nThink I got 'em?\n\nHOLLY\nI don't know.\n\nKIT\nWell, I'm not going down there and look.\n\nHe starts running away from the cellar. Holly follows him. A \nstorm is gathering on the horizon. Kit offers Holly his hand as \nthey run. but Holly does not see this. \n\nINT. CATO'S BEDROOM \n\nCato lies motionless, on his bed. Holly steps forward and touches \nhim with a yardstick, like a child touching a snake. \n\nHOLLY (v.o.)\nSuddenly, I was thrown into a state of shock...\n\nEXT. HOUSE AND BOX CAR \n\nKit, rifle in hand, lumbers out a side door of the house with \nCato over his shoulder. He steers for a nearby box car that \nevidently served Cato as a shed. \n\nHOLLY (v.o.)\nKit was the most trigger happy person I'd ever met. He claimed \nthat as long as you're playing for keeps and the law is coming at \nyou, it's considered okay to shoot all witnesses. You had to take \nthe consequences, though, and not whine about it later.\n\nKit opens the doors of the box car. and dumps Cato inside. Before \nclosing the doors he checks Cato's shoes. to see if they are the \nones he gave him. Holly looks on from the side of the house, \ntwenty yards away. \n\nHOLLY\nWe're in for it now... If they catch us.\n\nKit looks cornered and defensive. Holly thinks for a moment. \n\nHOLLY\nWhat'd you put him in there for?\n\nKIT (shrugging)\nJust to keep him out of the sun.\n\nKit heads out of sight around the rear of the box car. Holly goes \nback inside. Kit walks up and down the length of the box car, \ntalking under his breath and throwing his rifle from hand to \nhand, in a state. \n\nDISSOLVE TO\n\n\nEXT. COUNTRY ROAD \n\nKit and Holly travel down a country road in the Studebaker. \n\nHOLLY (v.o.)\nAt this moment I didn't feel shame or fear, but just kind of \nblah, like when you're sitting there and all the water's run out \nof the bathtub.\n\nINT. CAR \n\nKit, driving, turns to Holly. \n\nKIT\nYou tired?\n\nHOLLY\nYeah.\n\nKIT\nYeah, you look tired... Listen, honey. when all this is over, I'm \ngoing to sit down and buy you a big, thick steak.\n\nHOLLY\nI don't want a steak.\n\nKIT\nWell, we'll see about that... Hey, lookie.\n\nHe nods at a wrecked car lying in a ditch beside the road. \n\nKIT\nThey're probably going to blame that on me, too, bastards.\n\nVIGILANTE MONTAGE - SERIES OF ANGLES - BLACK AND WHITE \n\nVarious shots characterizing the Midwest's reaction to Kit and \nHolly\na deserted street, law officers posing with their guns and \nammunition, children walking from class under armed guard, a \ndetective in a trench coat pointing at a pump, a woman calling in \nher children at dusk, a county official posing with the county \nrecords, the court reporter with a book of signatures, vigilantes \nsigning up and being deputized, then riding through the streets \nof their town in the backs of pickups, a priest among them, etc. \n\nHOLLY (v.o.)\nThe whole country was out looking for us, for who knew where Kit \nwould strike next? Sidewalks were deserted. Stores closed their \ndoors and drew their blinds. Posses and vigilante committees were \nset up from Texas to North Dakota. Children rode back and forth \nto school under heavy guard. A famous detective was brought in \nfrom Boston. He could find no clues ... My clarinet teacher said \nI probably wasn't responsible, but others said I was. Then, on \nThursday, the Governor of Oklahoma sent out the National Guard to \nstand watch at the Federal Reserve Bank in Tulsa when word got \nout that Kit meant to rob it... It was like the Russians had \ninvaded.\n\nEXT. RICH MAN'S HOUSE \n\nKit and Holly approach a large Victorian mansion. Kit rings the \nbell. \n\nHOLLY (v.o.)\nWe needed supplies, so we went to a rich man's house. Kit figured \nit'd be safer and quicker than shopping in the downtown... A maid \ncame to the door.\n\nA MAID opens the door. \n\nKIT\nHi, I come to check the meter. My tools are in here.\n\nHe nods at the suitcase he is carrying. The Maid looks at Holly. \n\nKIT\nOh, this Is Holly. She's from Texas.\n\nKit winks at Holly. The Maid brushes her ears to indicate that \nshe is deaf, then stands back to let them pass. \n\nHOLLY (v.o.)\nLater we found out she was deaf and we hadn't even known it.\n\nKIT\nExcuse me.\n\nThey enter the house. \n\nINT. LIVING ROOM \n\nKit leads the others into the living room. The owner of the \nhouse, a RICH MAN, sits in a chair in the corner, reviewing some \nprints. At the sight of Kit he comes to his feet. \n\nKIT\nHi.\n\nRICH MAN\nYes?\n\nKIT\nThis your place?\n\nRICH MAN\nYes.\n\nKit looks around, overwhelmed by the luxury of the mansion. \n\nKIT\nSorry to barge in on you. Anybody else here besides you two?\n\nRICH MAN\nNo.\n\nThe Rich Man is wary. Kit nearly forgets to explain himself. \n\nKIT\nGood deal... Oh, uh, we're on the run and we'd like to hang out \nhere for a while. Couple of hours, maybe. How'd that be?\n\nRICH MAN\nStay as long as you like.\n\nTIGHT ON MURAL \n\nThe CAMERA PANS across a mural of some pastoral scene. \n\nINT. HOUSE - SERIES OF ANGLES \n\nHolly runs her finger around the lip of a crystal glass. It makes \na soft chiming noise. Kit, sitting at the end of a table opposite \nher, picks up a dinner bell, rings it, then puts It down and \nregards her solemnly. \n\nKIT\nNext time I ring that, it means time to clear out.\n\nHolly, in the next angle, has moved a bust off its pedestal onto \nthe corner of a piano. She thinks better of this and restores the \nbust to its original position. \n\nKit sniffs at a glass of sherry, then takes a picture off the \nmantel and studies it. \n\nHolly, at the other end of the room. tests the comforts of a \nchair. This done. she moves to another chair and tests it, too. \nShe makes her hand limp. She watches it swing back and forth. \n\nKit sits in the chair which the Rich Man occupied earlier. He has \na thoughtful look on his face. There is a dictaphone on the table \nbeside him. \n\nINT. HALLWAY \n\nHolly takes a cane out of the umbrella rack, looks around \nfurtively, then steps out a side door of the house. \n\nEXT. LAWN \n\nHolly walks down the slope of the lawn. \n\nHOLLY (v.o.)\nI left Kit in the parlor and went for a stroll outside the house. \nThe day was quiet and serene, but I didn't notice, for I was deep \nin thought, and not even thinking about how to slip off.\n\nAcross the way she can see a long driveway, with a border of lush \ngreenery and a sleepy cat standing in the sun. \n\nHOLLY (v.o.)\nThe world was like a faraway planet to which I could never \nreturn... I thought what a fine place it was, full of things for \npeople to look into and enjoy.\n\nINT. LIVING ROOM - TIGHT ON KIT \n\nKit talks into the dictaphone, recording some advice for young \npeople. \n\nKIT\nListen to your parents and teachers. They got a line on most \nthings, so don't treat them like enemies. There's always a chance \nyou could learn something. (he pauses for a moment) Try to keep \nan open mind. Try to understand the viewpoint of others. Consider \nthe minority opinion, but try to get along with the majority \nopinion once it's accepted. (again he pauses) Course Holly and \nI've had fun, even if it has been rushed, and... so far we're \ndoing fine. hadn't got caught. (annoyed) Excuse the grammar.\n\nHe sets down the dictaphone. puts out his cigarette and leans \nback in his chair, lost in reflection. \n\nINT. COVERED ROOM \n\nHolly enters the room where the Rich Man and his Maid have been \nput. The furniture and paintings are covered with sheets, \nsuggesting that for some purpose, known only to the family, the \nroom has been set aside. \n\nHOLLY\nHi... Kit's downstairs playing with the dictaphone... Sometimes \nhe acts like there's something wrong with his bean.\n\nShe leans against the window. behind the couch where the Rich Man \nis sitting. \n\nHOLLY\nHope nothing ever goes wrong with mine.\n\nRICH MAN\nThink he's crazy, huh?\n\nHOLLY\nI don't know... He's kind of odd.\n\nShe sits down beside the Rich Man. \n\nHOLLY (shyly)\nThey claim I've got him wrapped around my little finger, but I \nnever told him to shoot anybody.\n\nShe looks the room over. \n\nHOLLY\nGosh, I like your house.\n\nRICH MAN\nThank you.\n\nWe hear the NOISE of a doorbell. \n\nINT. LIVING ROOM \n\nKit puts down a copy of the Wall Street Journal and locates his \npistol. He starts for the door, then remembers that he moved a \npicture from the mantel. He puts the picture back in place, \nchecks the chamber of his pistol and leaves the room. \n\nEXT. FRONT OF HOUSE \n\nKit opens the front door to find a VISITOR on the stoop. The \nVisitor carries a roll of blueprints under his arm. \n\nKIT\nHi.\n\nVISITOR\nHi... ah, Mister Scarborough here?\n\nKIT\nYeah, but the thing about him, he's down with the flu. He's sick.\n\nVISITOR\nReally?\n\nKIT\nYeah. I'd invite you inside, except it's contagious. Don't want \nto start an epidemic.\n\nVISITOR\nNo, of course not. It's only that he called last night and asked \nif I could come by.\n\nKIT\nWell, he didn't have it last night.\n\nThe Visitor is puzzled by Kit's presence in the house, and even \nmore by his behavior. He takes out a note pad. \n\nKIT\nWhat's that?\n\nVISITOR\nWell, I'd like to leave a message, if that's okay.\n\nKIT\nSure.\n\nThe Visitor jots something down and hands the note to Kit. \n\nKIT\nYou have to excuse me now. I have to go back inside. Bye.\n\nKit closes the door. \n\nINT. STAIRWELL \n\nKit hides the Visitor's note in a vase and bounds up the stairs \nto the first landing. \n\nKIT\nWe're out of here, Tex.\n\nHe turns back down the stairs. On a rack at the bottom he finds a \nhat and coat. He takes them with him. \n\nINT. COVERED ROOM \n\nKit walks into the room where he left the Rich Man and his maid. \nHe now carries a bag of groceries under his arm, \n\nKIT\nHi, whatcha doing?\n\nRICH MAN\nJust thinking.\n\nKIT\nGood a way to kill time as any... She okay?\n\nHe points to the Maid with his pistol. \n\nRICH MAN\nYes.\n\nKIT\nListen, ah ... We're going to take the Cadillac for a while. \nHow'd that be?\n\nRICH MAN\nFine.\n\nKIT\nDon't worry, I won't let her drive.\n\nHe means Holly. \n\nKIT (continuing)\nOh, and here's a list of everything we borrowed. Car's on there, \ntoo.\n\nHe gives the list to the Rich Man and signals the Maid to \naccompany them out. \n\nKIT\nOkay, ma'am, let's go . . . come on.\n\nINT. HALLWAY \n\nKit points the Rich Man and his Maid into a closet. \n\nKIT\nYou're my friend, aren't you?\n\nRICH MAN\nYes.\n\nKIT\nOkay, no monkey business then.\n\nHe locks the door of the closet once they are inside, starts off, \nthen remembers something, takes a handkerchief out of his pocket \nand wipes his fingerprints off the door handle. \n\nKIT\nGroceries.\n\nWith this reminder he collects his bag of groceries and heads \ndown the hall. \n\nEXT. FRONT PORCH \n\nKit and Holly come out the front door. Holly wears a shawl over \nher head as a disguise, Kit wears the outfit he took off the Rich \nMan's coat rack. He carries his groceries, rifle and a silver \ntrophy he stole from somewhere in the house. \n\nKIT\nThat guy could sell that list I gave him as a sample of my \nhandwriting.\n\nHolly starts off, \n\nKIT (continuing)\nHey, why're you always walking ahead of me?\n\nHOLLY\nWell, why you always walking behind me?\n\nKit grabs the seat of her pants. \n\nHOLLY\nDon't.\n\nKIT\nAnybody ever done that to you before?\n\nHOLLY\nNo.\n\nKIT\nPositive?\n\nHOLLY\nYes.\n\nKIT\nGuess there's no way I'll ever know. For sure.\n\nThey round a corner into the garden. \n\nEXT. BACKYARD \n\nThey walk down the lawn toward the garage. We the TICKING OF \nSPRINKLERS off camera. \n\nKIT\nThat guy must pay through the nose to keep this place up... Lawn, \nthe gas and electric... Bagworms. Plus the upkeep on the cars... \nYeah, you get a little money in your pocket, you think all your \nproblems are solved. Well, let me tell you, they're not.\n\nThey arrive at the Cadillac. Holly sets down her suitcase and \nwaits for Kit to open the door for her. \n\nKit, who has forgotten this propriety, hurries back and opens the \ndoor. He throws the suitcase in the back, goes around the front \nof the car and gets in. \n\nHOLLY\nI'd like to get out of here.\n\nKIT\nSoon as I start the car... and fix my hat.\n\nHe adjusts his hat, starts the car and they drive off, past a \nRolls Royce Kit has declined in favor of the Cadillac. \n\nEXT. BADLANDS - EXTREME LONG SHOT \n\nThe car races across the open prairie. \n\nHOLLY (v.o.)\nFearing there'd be roadblocks on the highways, we took off across \nthat area known as the Great Plains. Kit told me to enjoy the \nscenery, and I did.\n\nINT. CADILLAC \n\nHolly reads to Kit from a movie fan magazine. \n\nHOLLY\n\"Rumor\nPat Boone is seriously considering giving up his career so he can \nreturn to school full-time and complete his education. Fact\nPat has told intimates that so long as things are going well for \nhis career, it's the education that will have to take the back \nseat.\"\n\nKIT\nI don't blame him.\n\nHOLLY\n\"Rumor\nFrank Sinatra and Rita Hayworth are in love... Fact\nTrue, but not with each other.\"\n\nKit chuckles at this, which pleases Holly. \n\nEXT. TELEPHONE POLES \n\nThe Cadillac heads overland, along a line of telephone poles that \nstretches out clear to the horizon. \n\nHOLLY (v.o.)\nThrough desert and mesa, across the endless miles of open range, \nwe made our headlong way, steering by the telephone lines toward \nthe mountains of Montana.\n\nDISSOLVE TO\n\n\nEXT. MOUNTAIN \n\nHeat waves rise off the land. A mountain is barely discernible in \nthe distance. \n\nDISSOLVE TO\n\n\nEXT. BADLANDS \n\nThe Cadillac races through a herd of cows, \n\nHOLLY (v.o.) Kit'd sometimes ram a cow, to save on ammo, and we'd \ncook it.\n\nCLOSE ON SALT GRASS \n\nTight shot of a clump of salt grass. \n\nHOLLY (v.o.)\nOnce we had to eat a bunch of salt grass. It tasted like cabbage.\n\nEXT. BADLANDS - DAWN \n\nTHE CAMERA RISES over the Cadillac as it races down a deserted \ncountry road at dawn, \n\nEXT. PIPELINE WAYSTATION \n\nThe Cadillac is stopped beside a pipeline waystation. Kit has \ntapped some gas off the head. \n\nHOLLY (v.o.)\nFor gas we used the leakage from the valves of the pipelines we \nfound along the way. Drip gas is what they call it in that part \nof the country.\n\nDISSOLVE TO\n\n\nEXT. BADLANDS \n\nThe Cadillac roars through a stand of mesquite and disappears \ninto the distance. \n\nHOLLY (v.o.)\nLittle by little we approached the border. Kit was glad to leave \nSouth Dakota behind and cursed its name. He said that if the \nCommunists ever dropped the atomic bomb, he wished they'd put it \nright in the middle of Rapid City.\n\nEXT. CAMPSITE \n\nThey are camped out in the middle of the badlands. Kit cooks some \nmeat over a fire, Holly, with a map under her arm, points into \nthe distance. \n\nHOLLY\nThat's Montana over there.\n\nKIT\nI never been to Montana... Acquaintance of mine has, but I \nhadn't... Never had any reason to.\n\nHolly sits down and looks at the map. \n\nHOLLY\nState bird's a meadowlark.\n\nEXT. PAN ACROSS BADLANDS \n\nThe CAMERA PANS across the badlands. There Is not a tree or a \nbush in sight. It comes to rest on Kit, who carries his rifle \nover his shoulders the way James Dean did in \"Giant\". \n\nKIT'S P.O.V. - SERIES OF ANGLES \n\nVarious sights of the prairie\na distant mountain, a wild turkey, a lizard, a burst of \nlightening in a cloud on the horizon, a falcon. Kit takes all \nthis in, then he turns back to the campsite. The sun is down, \njust barely, and the moon has risen behind him. Holly is heard \nover this last shot. \n\nHOLLY (v.o.)\nWe lived in utter loneliness, neither here nor there. Kit said \nthat solitude was a better word, cause it meant more exactly what \nI wanted to say. Whatever the expression, I told him we couldn't \ngo on living this way.\n\nINT. CADILLAC \n\nKit and Holly sit in the back seat of the Cadillac. They have \nbeen necking. Her hair is in curlers. \n\nKIT (responding to v.o.)\nWhy not? I mean, I'm having fun... At least I'm not bitching.\n\nHOLLY\nWell, I feel kind of like an animal living out here. I mean, \nthere's no place to bathe and... no place to get anything good to \neat.\n\nKIT\nWell, I'll catch you a big trout. Soon as we get to the \nmountains.\n\nHe kisses her. She gives in reluctantly. After a while they \nbreak. \n\nKIT\nEverybody loves trout.\n\nHOLLY\nI'm serious.\n\nThey neck some more. then break again. Kit looks out one window, \nHolly out the other. \n\nEXT. DISTANT TRAIN \n\nA train moves slowly across the horizon. \n\nHOLLY (v.o.)\nIn the distance I saw a train making its way silently across the \nplain, like the caravan in \"The Adventures of Marco Polo.\" It was \nour first taste of civilization in days, and I asked Kit if we \ncould have a closer look.\n\nEXT. KIT - WITH FOOTBALL \n\nKit sets a football down on the ground, backs off a few steps, \nsquats and shoots a hole through it with his pistol. To his \nsurprise. it does not deflate. He moves closer and pounds it flat \nwith the barrel of the pistol. \n\nHOLLY (v.o.)\nBefore we left he shot a football that he considered excess \nbaggage.\n\nTIGHT ON SUITCASE \n\nKit is burying some things from Holly's suitcase in a bucket\nthe trophy he took from the mansion, her stereopticon slides, a \ndoll, a spark plug, a pack of Camels, etc. \n\nHOLLY (v.o.)\nAfterwards he took and buried some of our things in a bucket. He \nsaid that nobody else would know where we'd put them, and that \nwe'd come back someday, maybe, and they'd still be sitting here, \njust the same, but we'd be different. And if we never got back, \nwell, somebody might dig them up a thousand years from now and \nwouldn't they wonder!\n\nEXT. BADLANDS \n\nThe Cadillac speeds across the plains. A plume of dust stretches \nout behind it. \n\nEXT. RAIL TRESTLE \n\nKit and Holly have parked the Cadillac under a rail trestle. A \ntrain is approaching. They hide beside the car. The train, a \nstreamliner, roars overhead. When it has passed, Holly rushes up \nthe grade to watch it disappear into the distance. Kit watches \nfrom the opposite end of the trestle. \n\nKIT\nMaybe we should've tried to hop it.\n\nHOLLY\nIt was going too fast.\n\nKIT\nI could've pulled the car up on the tracks, slowed it down some.\n\nHOLLY (o.c.)\nYeah, then we'd be stuck here.\n\nKIT\nWell, maybe we oughta be stuck here. I'm not saying that I know.\n\nHe stoops down and picks up a Pepsi bottle. \n\nHOLLY\nYou're crazy.\n\nHe climbs over the edge of the trestle, looks back at her oddly, \nthen leaps down to the ground. Holly walks down to meet him. \n\nHOLLY (v.o.)\nKit took the bottle and spun it around, leaving to fate which \ndirection we should take.\n\nTIGHT ON BOTTLE \n\nKit spins the bottle. \n\nEXT. BOTTOM OF TRESTLE \n\nThe bottle comes to a stop. Kit inspects its position. He does \nnot appear satisfied, though. \n\nKIT\nWell, maybe the slope here is throwing it off some. We ought to \nfind a more flat place.\n\nHOLLY\nHow about over here?\n\nKit starts toward her, then changes his mind and heads back up \nthe grade, to the tracks. The CAMERA DOLLIES and CRANES with him. \n\nKIT\nNever mind. It doesn't matter... If I'm worth a damn, I'll pick \nthe right direction. And if I'm not, well, I don't care. See what \nI mean?\n\nHOLLY (o.c.)\nNo.\n\nKIT\nWell, I shouldn't expect miracles, should I?\n\nHe stops at the top of the grade and looks out across the \nBadlands. \n\nKIT\nWe'll keep on heading for that mountain... Just remember I said \nit wasn't such a hot idea.\n\nDISSOLVE TO\n\n\nEXT. TRESTLE - DUSK \n\nThe Cadillac pulls out from under the trestle and heads down a \ndusty road alongside the tracks. \n\nHOLLY (v.o.)\nWe took off at sunset, on a line toward the mountains of \nSaskatchewan, for Kit a magical land beyond the reach of the law. \nHe needed me now more than ever, but something had come between \nus. I'd stopped even paying attention to him. Instead, I sat in \nthe car and read a map and spelled out entire sentences with my \ntongue on the roof of my mouth, where nobody could read them.\n\nDISSOLVE TO\n\n\nEXT. MOUNTAIN - DUSK \n\nThe Cadillac beads off across the plains toward a distant \nmountain. \n\nHOLLY (v.o.)\nThat night we moved closer to the border, and clear across the \nprairie, at the very edge of the horizon... \n\nEXT. REFINERY FIRES - NIGHT \n\nA refinery fire. \n\nHOLLY (v.o.)\nW could make out the gas fires of the refinery at Missoula, while \nto the south...\n\nEXT. CITY LIGHTS - NIGHT \n\nHOLLY (v.o.)\n... we could see the lights of Cheyenne, a city bigger and \ngrander than I'd ever seen.\n\nEXT. CADILLAC'S POV ON PRAIRIE \n\nThe prairie rushes under the Cadillac's headlights. \n\nHOLLY (v.o.) I felt all kind of things looking at the lights of \nCheyenne, but most important, I made up my mind to never again \ntag around with a hell-bent type, no matter how in love with him \nI was. Finally, I found the strength to tell Kit this. I pointed \nout that even If we got to the Far North, he still couldn't make \na living.\n\nINT. CADILLAC - NIGHT \n\nKit and Holly's faces are strangely lit by the dash lights. Holly \nis absorbed in her map. The radio is on. \n\nKIT\n(responding to v.o.) I could get a job with the Mounties. The \nNorthwest Mounties ... Hell, I got all the qualifications. I can \nride, shoot and... I don't mind the cold. Fact. I kind of like \nthe cold.\n\nHolly looks up from the map. \n\nHOLLY\nWhat?\n\nKIT\nNothing... I was just running off at the mouth... as usual.\n\nHOLLY\nI'm sorry. I wasn't listening.\n\nHolly lights a cigarette. \n\nKIT\nI was just talking about going after a job... Hey. don't lip it.\n\nHe reaches over and takes the cigarette out of her mouth. The \nCAMERA PANS to her with this gesture. \n\nHOLLY\nYou know... they'd probably ask to see your driver's license \nbefore they hired you.\n\nKIT (o.c.)\nWell. I'm not going to let that stop me.\n\nWhen the CAMERA PANS BACK to him, he is looking at her cigarette. \n\nKIT\nYou smoke Pall Mall?\n\nHOLLY\nYeah.\n\nHe is surprised to discover this. \n\nKIT\nNah, you hadn't seen me when I'm going after something, honey. \nTough?\n\nHe cocks his head just thinking about it. She reaches for the \nradio to change the station. He pats her hand away. \n\nKIT\nHey. don't touch that... Nat King Cole.\n\nEXT. BADLANDS - NIGHT \n\nThey dance in the headlights to the tune of \"A Blossom Fell\" \ncoming over the car radio. She is wearing the rich man's jacket. \nAfter a moment Kit whispers in her ear. \n\nKIT\nBoy, if I could sing a song like that... I mean, if I could sing \na song about the way I feel right now, it'd be a hit.\n\nThey continue dancing. \n\nEXT. CADILLAC ON PLAINS - DAY \n\nTwo shots of the Cadillac heading across the Badlands at dawn. \n\nHOLLY (v.o.)\nKit knew the end was coming. He wondered if he'd hear the doctor \npronounce him dead, or if he'd be able to read what the papers \nwould say about him,the next day, from the other side. He dreaded \nthe iea of being shot down alone, he said, without a girl to \nscream out his name.\n\nINT. CADILLAC - DAWN \n\nHolly yawns with fatigue. \n\nHOLLY (v.o.)\nThen, for an instant, the sight of the mountains in the dawn \nlight got his hopes back up.\n\nKit shakes his head with admiration and wonder. \n\nKIT\nGod, what a sight... Tell me this, honey. What does a little \nTexas girl like yourself think of a sight like that?\n\nShe turns to look at the mountains. \n\nEXT. MOUNTAINS - THEIR POV \n\nMountains in the distance closer now than ever before. \n\nDISSOLVE TO\n\n\nEXT. OIL RIG \n\nThe Cadillac drives up to an oil rig. Kit gets out of the car. \n\nKIT\nLove this air.\n\nThe ROUGHNECK in charge of the rig steps out of his trailer. It \nseems there is nobody else around. \n\nKIT\nMorning... Say, you got any gas?\n\nROUGHNECK\nMaybe.\n\nKIT\nWell. I'm sorry. sir. but we've got to ask you for it.\n\nHolly walks over to inspect the rig. \n\nKIT (o.c.)\nSee, we're about out... been driving all night. Actually, I don't \neven have time to explain it to you.\n\nROUGHNECK (o.c.)\nWell, matter of fact, I don't have any.\n\nKIT\nJust a second now. That's your truck. isn't it?\n\nHe points to a truck linked to the front of the trailer. Holly \nlooks idly around. Suddenly her expression changes, for what \nreason it is not clear. \n\nKIT (o.c.)\nYou didn't walk out here.\n\nROUGHNECK (o.c.)\nIt's mine all right.\n\nKIT\nWell, listen. I'm going to swap you my Cadillac.\n\nThe Roughneck does not understand what Kit is up to. \n\nKIT\nNow don't worry. You're getting a fair deal. Hell. what's the \nblue book value on this thing, Mildred?\n\nHe slaps the hood of the Cadillac and looks to Holly. She is \nstill preoccupied with whatever it is she has seen, though. \n\nROUGHNECK (o.c.)\nWho are you?\n\nKIT\nName is Carruthers. Believe I shoot people every now and then. \nNot that I deserve a medal.\n\nHolly signals Kit with a nod at the horizon. \n\nHOLLY\nKit!\n\nKit looks up and sees a helicopter in the distance. He hesitates \na moment, then draws his gun. \n\nKIT\nOkay, friend. start running.\n\nROUGHNECK (o.c.)\nJust gimme a chance.\n\nKIT\nGit.\n\nHolly moves around the side of the rig and sits against a tire. \nKit joins her. \n\nKIT\nBoy. I had a feeling today was going to be the day... Helicopter.\n\nHOLLY\nYeah.\n\nKIT\nHe's not coming to take us for a ride. either. Come on, let's \nmake a run for the car.\n\nHe starts off in the direction of the car, but Holly calls him \nback. \n\nHOLLY\nI don't want to.\n\nKit looks at her. surprised. \n\nKIT\nHave you got a better idea?\n\nHOLLY\nI just don't want to go.\n\nKIT\nWhat?\n\nShe shrugs. He stares at her for a moment, then bows his head and \nwalks off a distance. \n\nKIT\nWhat is wrong with you, huh?\n\nHe kicks wildly at dust. \n\nKIT\nWhat is the matter with you, huh!?\n\nMeanwhile, the helicopter continues its approach. Kit walks in \ncloser to Holly. \n\nKIT\nBoy, I don't know what to make of you. People like you.\n\nHe kicks at the rigs then turns back to face her. \n\nKIT\nYou want a second chance, then listen. Twelve noon the Grand \nCoulee Dam, New Year'ss Day. 1964. You meet me there... Now you \ngot that?\n\nShe nods, bewildered. The helicopter is landing. He grabs a \ndiscarded fender off the truck, hangs it over his arm like a \nshield and runs to the Cadillac, exchanging shots with a State \nTrooper who has arrived in the helicopter. The Trooper is hit and \nfalls. Kit jumps in the car and roars off. Holly surrenders \nherself to the pilot of the helicopter and is taken off. \n\nEXT. GAS STATION \n\nKit pulls into a gas station. He gets out of his car and drums on \nthe roof. \n\nKIT\nHey, anybody here?\n\nAn ATTENDANT walks out the door. \n\nKIT\nHi... Say,, you got any shells for a Savage, a .300 Savage?\n\nATTENDANT\nNope.\n\nKIT\nDamn. I pissed all mine away shooting up bottles... You want to \nfill her up for me? Please?\n\nThe Attendant nods. Kit pulls Holly's suitcase out of the back \nseat and walks over to a trash can at the edge of the apron. Kit \nthrows Holly's things methodically into the trash can. After a \nwhile he comes upon a book. He opens the book and looks through \nit, then turns to find the Attendant staring at him. As he gets \nto his feet. he nods at the trash can. \n\nKIT\nIf you want any of that junk, it's yours.\n\nMeanwhile, a police car approaches the station. Kit sees it at \nabout the same time the police see him. He throws his book in the \ncar and roars out of the station. The police car goes into a \nbootlegger's turn and takes off after him. \n\nCHASE - SERIES OF ANGLES \n\nKit heads down the highway. After a while he turns off onto a \ndirt road. The police keep up with him.. He flips on the radio \nand fires back at them. The dust is so heavy that they have a \nhard time just keeping track of him. He checks his own appearance \nand general demeanor in the rear view mirror, then swerves off \nthe road onto the prairie. The police manage to keep up. Together \nthey roar through a herd of cows and barb wire fence. The police \ncar slams into Kit, trying to slow him down. Kit slams back into \nthe police car. They return to the road. Kit makes a ninety-\ndegree turn but the police car loses traction and rolls onto its \nside, then back onto four wheels again, stalled. Kit sees that he \nhas lost them. He checks himself out in the mirror again, puts on \nthe rich man's hat and skids to a stop. The police car gets back \nunderway. During these last few moments Holly is heard on VOICE \nOVER. \n\nHOLLY (v.o.)\nOften I've wondered what was going through Kit's head before they \ngot him and why he didn't make a run for it while he still had \nthe chance. Did he figure theyld just catch up with him the next \nday? Was it despair? He claimed to having a flat tire, but the \nway he carried on about it, I suspect this is false.\n\nEXT. ROAD \n\nKit shoots a hole in the tire of the Cadillac, then climbs up on \nthe hood. We see how far behind the police are. He checks his \npulse and jumps back down. He scurries around collecting rocks \nfrom the shoulder as the police approach from the distance. He \nmakes a stack of the rocks to mark the site of his capture for \nposterity, finishing just as the police car skids to a stop. Kit \nthrows up his hands and walks forward to meet them. Their guns \nare drawn. \n\nKIT\nHi.\n\nSHERIFF\nHold it right there.\n\nKIT\nI could've held off an army if I could've gotten behind a rock in \nthe mountains.\n\nDEPUTY (o.c.)\nOh yeah?\n\nKIT (nodding)\nLong as my ammo held out... Right there's where you caught me.\n\nHe nods at the stack of rocks. The Sheriff frisks him as the \nDeputy covers. \n\nDEPUTY\nWe did it, Ray.\n\nKIT\nYou better not leave that Cadillac sitting out here.\n\nThe Sheriff takes out a pair of handcuffs. \n\nSHERIFF\nPut your hands in back of your head.\n\nThe Sheriff claps the handcuffs on one of Kit's wrists. \n\nSHERIFF\nNow put the other one on yourself.\n\nKit does as the Sheriff asks. The Deputy holsters his pistol and \nwalks forward to inspect their prize. He and KIT exchange \nglances. \n\nDEPUTY (to Sheriff)\nHell, he ain't no bigger than I am.\n\nThe Sheriff sticks his pistol in Kit's ear and leads him off \ntoward the police car. \n\nKIT\nYou're going to give me a cauliflower ear, Sheriff.\n\nThe Sheriff gives Kit a shove. \n\nDEPUTY\nHe should've thought about that before he got caught... Shouldn't \nhe?\n\nThe Deputy draws his pistol and fires a shot into the neighboring \nfield. Kit is startled. The Deputy makes the same motion, this \ntime without firing. \n\nDEPUTY\nHup!\n\nEXT. HIGHWAY \n\nThe police car sails down an open stretch of highway. \n\nINT. POLICE CAR \n\nKit thinks for a while, then turns to the Sheriff, who is \ndriving. \n\nKIT\nThink I'll take the juice?\n\nSHERIFF\nBeats me.\n\nThe Deputy, fascinated, watches all this from the back seat. Kit \nturns to him. \n\nKIT\nSay, what kind of rifle was that you were shooting at me?\n\nDEPUTY\nThirty aught six.\n\nKIT (o.c.)\nYou ever had to open it up like that before?\n\nDEPUTY\nNope.\n\nKit turns back around. \n\nKIT (reassuringly)\nWell, you boys have performed like a couple of heroes... And \ndon't think I'm not going to pass it around when we get to town.\n\nThe Sheriff lifts the hat off Kit's head and tosses it out the \nwindow. It rolls to a stop on the highway behind them. \n\nKIT\nYou tossed my hat out the window.\n\nSHERIFF (o.c.)\nWanta sue me?\n\nKIT\nNo.\n\nDEPUTY\nKit... Kit, I've got a question for you.\n\nKIT\nMmmmm.\n\nDEPUTY\nYou like people?\n\nKIT\nThey're okay.\n\nDEPUTY\nThen why'd you do it?\n\nKIT\nI don't know. Always wanted to be a criminal, I guess. Just not \nthis big a one... Takes all kinds though.\n\nKit gets a smile from the Deputy. The Deputy turns to the \nSheriff. \n\nDEPUTY\nYou know who that sombitch looks like? (no reply) You know, don't \nyou?\n\nKit is anxious to hear the answer. \n\nSHERIFF (o.c.)\nNo.\n\nDEPUTY\nI'll kiss your ass if he don't look like James Dean.\n\nKit drops his eyes and turns away, deeply gratified by this \nremark. The Sheriff smiles at the Deputy in the rear mirror. The \ncar roars past a freight train. \n\nINT. AIRPORT HANGAR \n\nKit stands on the wing of a light plane, inside a large hangar at \nthe local airport. He is shackled in a leather transfer vest. He \ntakes souvenirs out of his pockets and tosses them out to a crowd \nof Montana State Troopers and National Guardsmen milling around \non the tarmac ground below him. \n\nMECHANIC\nHow you doing there, Kit?\n\nKIT (o.c.)\nFine as can be expected. Just locked up, can't move.\n\nMECHANIC (o.c.)\nThat's a nice little coat you got on there.\n\nKIT\nYou think?... it's leather.\n\nHe takes out his cigarette lighter. \n\nKIT\nHey, now here's a real prize. I must've had this about ten years. \nWho's going to get it?\n\nVOICE (o.c.)\nGimme that sombitch.\n\nKIT\nThere you go.\n\nSECOND VOICE (o.c.)\nWhere you from?\n\nKIT\nSouth Dakota. Where you from?\n\nSECOND VOICE (o.c.)\nHere.\n\nKIT\nWant a comb?\n\nHe takes a comb out of his pocket and pitches it down to \nsomebody. He ignores most of the questions coming at him. \n\nTHIRD VOICE (o.c.)\nJoni James is from South Dakota.\n\nKIT\nYeah, she got out of there, too.\n\nFOURTH VOICE (o.c.)\nYou ever been to Kansas?\n\nFIFTH VOICE (o.c.)\nHey, Kit. whot's your favorite singer?\n\nKIT\nEddie Fisher. Who's yours?\n\nFIFTH VOICE (o.c.)\nEddie Fisher.\n\nKIT\nDamn! Want a pen?\n\nHe pitches the man a ballpoint. The CAMERA MOVES BACK to a WIDE \nSHOT of the whole scene. \n\nSIXTH VOICE (o.c.)\nHow old are you?\n\nKIT\nDon't you read the papers?\n\nSIXTH VOICE (.o.c.)\nYou ever been married?\n\nKIT\nNo sir, I hadn't.\n\nEXT. HANGAR - SERIES OF ANGLES \n\nVarious SHOTS of the National Guardsmen dozing on the pavement. \nplaying cards beside the hangar, a little bored. Also a shot of \nHolly with the Sheriff and Deputy. \n\nSEVENTH VOICE (o.c.)\nHey, Kit, you afraid of death?\n\nKIT (o.c.)\nI hadn't thought about it much.\n\nINT. HANGAR \n\nThe Deputy walks up to Kit with some legal papers. \n\nKIT\nHey, listen, Tom, I don't mean to tell you how to run your show \nhere but these cuffs are pinching. What do you say now? \n\nDEPUTY\nI need to get your signature on some papers here, Kit.\n\nKIT\nWell, I've got to read them first. Suppose I could get a Coke \nwhile I do?\n\nDEPUTY\nSure thing. Come on.\n\nHe gives Kit the papers and leads him out of the hangar. Kit \nturns back to the crowd inside. \n\nKIT\nYou boys keep out of trouble.\n\nGUARDSMAN\nDon't worry about us.\n\nDEPUTY\nHolly's over here, Kit. if you want to see her.\n\nKIT\nSure.\n\nEXT. POLICE CAR \n\nHolly leans against the fender of the police car. She wears \nhandcuffs. Kit turns to a State Trooper who holds him by a \ntether. \n\nKIT\nYou want to give me a little slack here?\n\nThe Trooper pays out the slack. Kit leans against the car. He and \nHolly exchange looks. \n\nKIT\nDon't worry now.. I'm going to get you off these charges... \nThere's a whole lot of other boys out there. You're going to have \na lot of fun.\n\nHolly looks down. \n\nKIT\nBoy, we rang the bells, didn't we?\n\nHolly does not reply. \n\nKIT\nI'll say one thing, though... That guy with the deaf maid? He's \njust lucky he's not dead, too.\n\nHolly does not appreciate the humor of this. Kit, chastened, \nturns serious. \n\nKIT\nCourse it's too bad about your dad.\n\nHOLLY\nYeah.\n\nKIT\nWe're going to have to sit down, and talk about that sometime.\n\nHe looks up at the SOUND of an incoming plane. \n\nEXT. AIRPORT - SERIES OF ANGLES \n\nThe plane that will take them back to South Dakota, a B-25, comes \nin for a landing. The mass of Troopers and National Guardsmen, \nwith Kit and Holly, walks out to meet it. A jeep leads it down \nthe taxiway. A civilian bystander points Kit and Holly out to a \nyoung boy he holds in his arms. \n\nEXT. PLANE \n\nKit signs his extradition papers on the back of the Chief \nTrooper, gives them to the Deputy and shakes hands with the \nChief. \n\nKIT\nThank you very much, Chief Sims. Sorry if I caused you any \ninconvenience.\n\nCHIEF\nYou didn't cause me any trouble.\n\nKIT\nThanks anyway.\n\nHe turns to shake hands with the Deputy. The planets engines whir \nto life. \n\nDEPUTY\nWell, Kit...\n\nKIT\nTom...\n\nDEPUTY\nGood luck to you.\n\nKIT\nThanks.\n\nDEPUTY\nI mean it.\n\nKIT\nI know you do. Good luck to you, too.\n\nTROOPER\nNow we go.\n\nThe Trooper pulls him toward the plane. Kit calls Holly. \n\nKIT\nCome on, Red.\n\nEXT. RUNWAY - SERIES OF ANGLES \n\nThe props start turning. The crowd waves goodbye as the boarding \ndoor is closed. The wheels turn toward the sun. The Guardsmen \nrace back to their trucks. A mailman carries off the mail bags he \ncollected from the plane. The plane taxies down the runway and \nlifts into the air. \n\nHOLLY (v.o.)\nKit and I were taken back to South Dakota. They kept him in \nsolitary, so he didn't have a chance to get acquainted with the \nother inmates, though he was sure they'd like him, especially the \nmurderers. Myself, I got off with probation and a lot of nasty \nlooks. Later I married the son of the lawyer who defended me. \n(pause) Kit went to sleep in the courtroom while his confession \nwas being read, and he was sentenced to die in the electric \nchair. On a warm spring night, six months later, after donating \nhis body to science, he did. \n\nWith Holly's last words we CUT INSIDE the cabin of the plane. \n\nINT. CABIN \n\nKit sits next to the Trooper at the back of the plane. Holly sits \nopposite them, with a Detective behind her. Kit's attention is \nfixed on the military hat in the Trooper's lap. \n\nKIT\nSir... Where'd you get that hat?\n\nTROOPER\nState.\n\nKIT\nBoy, I'd like to buy me one of those.\n\nThe Trooper smiles. Holly looks up. \n\nTROOPER\nYou're quite an individual, Kit.\n\nKIT\nThink they'll take that into consideration?\n\nThe Trooper smiles and looks out the window. Kit looks to Holly, \nto see if she has taken this remark in the proper spirit. She \nsmiles and looks out the window. \n\nEXT. CLOUDS - HOLLY'S POV - DUSK \n\nAn unbroken sea of clouds stretches out before her. \n\nFADE OUT. \n\nEND CREDITS OVER BLACK. \n\nTHE END\n\n\n\n\n\n\n\n\n\n\nBadlands\nWriters :   Terence Malick\nGenres :   Crime  Thriller  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Badlands is set in 1959 and is narrated by the impressionable 15 year-old Holly Sargis (Spacek), a teenage girl living in a dead-end South Dakota town called Fort Dupree. Holly lives with her sign painter father, although their relationship has been strained since her mother died of pneumonia ten years earlier. One day she meets the 25-year-old garbage collector Kit Carruthers (Sheen). Kit is a young, troubled greaser, who resembles James Dean, an actor Holly admires. Kit charms Holly, and she slowly falls in love with him. Holly's narration, describing her adventures with Kit in romantic clichés, is juxtaposed as Kit's increasingly antisocial and violent behavior is slowly revealed. Holly's father disagrees with their relationship, so he kills Holly's dog. Kit kills him in retaliation. They then fake suicide by burning down the house and take off on the run together, making their way towards the Badlands of Montana, they leave a trail of dispassionate and seemingly random murders throughout the midwest behind them. Their faked suicide didn't work, however, but despite bounty hunters and police on their tail, it does not hinder their killing spree. The two are eventually arrested; Kit is executed for his crimes, while Holly receives probation."}