{"title": "Birthday Girl", "full_text": "\"BIRTHDAY GIRL\"\n\n                                      Screenplay by\n\n                           Tom Butterworth and Jez Butterworth\n\n                \n\n               FADE IN:\n\n               In a Russian summer meadow, a young girl spins around and \n               around. A simple guitar theme plays as the low sun catches \n               her hair. Around her neck is a pair of field binoculars, and \n               she runs through the meadow with them pressed to her face, \n               spying butterflies, birds, rabbits. She reaches the top of a \n               hillock, and jumps into the air, and flies up into the sky. \n               We float up and up with her as she aims the binoculars up, \n               up, into the sun.\n\n                                                       FADE THROUGH SUN TO:\n\n               An aerial shot of the rolling English countryside. Nothing \n               but fields and trees for miles. The shot describes a panorama \n               before looking directly down, at the earth, and we begin to \n               move.\n\n               We fly low over a field, a ditch and straight out over six \n               lanes of motorway. Cars and lorries tear below at a hundred \n               miles an hour. We fly over the hard shoulder to another field \n               beyond.\n\n               We descend on two young boys in the field. A pornographic \n               magazine is spread out of the flattened grass. One of the \n               boys puts a match to the centre page and as the flames lick \n               up, we begin to move again, across the field, over a path \n               and into a suburban garden.\n\n               We fly over five or six gardens, over a barbecue, over \n               children splashing in a pool, over a woman sunbathing, a man \n               mowing his lawn, a young boy bouncing up and down on a garden \n               trampoline, to arrive on the patio of John Buckingham. He \n               walks out onto the patio, where he sits in a chair, facing \n               his house, setting down a mug of tea.\n\n                                                                    CUT TO:\n\n               A blurred face sharpening into focus, John Buckingham, about \n               thirty-two, sitting on his patio, his garden behind, fields \n               beyond.\n\n                                     JOHN\n                         Hello.\n\n               His hand adjusts a microphone on his lapel.\n\n                                     JOHN\n                         Hello, hello. Hello...\n\n               He shifts in his chair. Coughs. He looks straight at us.\n\n                                     JOHN\n                         I don't believe in perfect love. You \n                         know, love that comes out of the sky \n                         like a thunderbolt and uh... This is \n                         ridiculous.\n\n               He removes the microphone. He sits there, thinking very hard.\n\n                                     JOHN\n                         No. No no no. Nope.\n\n               He stands, turns and stretches.\n\n                                                                  BLACKOUT:\n\n               FADE UP:\n\n               He is sitting as before, looking at us.\n\n                                     JOHN\n                         Running. Reading. Going out. Staying \n                         in. The countryside. Films, if they're \n                         good.\n\n                                                                  BLACKOUT:\n\n               FADE UP:\n\n                                     JOHN\n                         Thoughtful. Outgoing. Ambitious. \n                         Well-read. Reasonably popular. \n                         Balanced. Trusting. Quite attractive. \n                         Outgoing.\n\n                                                                  BLACKOUT:\n\n               FADE UP:\n\n                                     JOHN\n                         Someone intelligent, of course. Kind. \n                         Pretty I suppose. But its not \n                         critical.\n\n               EXT. JOHN'S STREET - DAY\n\n               John watches while two removal men lift a new double bed \n               from the back of a van.\n\n                                     JOHN (V.O.)\n                         Someone with a sense of humour. \n                         Someone you can communicate with on \n                         the same level. Someone you can really \n                         talk to. I think communication is \n                         key.\n\n               INT. BEDROOM - DAY\n\n               John's hands smooth a crisp white sheet over the double \n               mattress. An ant runs across the sheet. John squashes it and \n               picks it carefully off.\n\n                                     JOHN (V.O.)\n                         I think that by the time most people \n                         turn thirty they know where they're \n                         going.\n\n                                                                    CUT TO:\n\n               EXT. GARDEN - DAY\n\n               John encircles his house, leaving a thick trail of yellow \n               powder behind him.\n\n                                     JOHN (V.O.)\n                         And where they've been. I suppose \n                         they have some baggage stroke history.\n\n               EXT. THE GARDEN RECORDING - DAY\n\n               We see that John is talking to his PC. It has a small digital \n               camera on the side.\n\n                                     JOHN\n                         We all have someone in our past who \n                         uh... one skeleton, if you like. \n                         We've all got at least one person, \n                         as it were, under the patio. Not \n                         literally of course. I suppose I \n                         only say this because I always thought \n                         people who did this sort of thing \n                         were... I had an image that they \n                         were losers. Not losers. A bit sad. \n                         But I think this is the modern world. \n                         And I think really it's quite a brave \n                         move. Quite a brave, reasonable thing \n                         to do.\n\n               He smiles.\n\n                                     JOHN\n                         Sorry can we start again?\n\n               SINGLE CARD ON BLACK:\n\n                                      BIRTHDAY GIRL\n\n               John's fingers in close-up, type JOHN BUCKINGHAM, and his \n               AMEX number into his PC. Finished, he stops, and rests his \n               face on his hands.\n\n               He hits SEND. That instant, a worry of black crows bursts up \n               in the field behind him and takes to the swirling air.\n\n               Blackout. Music. Titles.\n\n               The titles pop and slide over footage of Russian women, on \n               computer video, advertising themselves. They mostly speak in \n               Russian, some of which is subtitled, some speak in English. \n               The women slide on and off the screen, overlap and collide, \n               as the titles appear. Close-ups on mouths and eyes, tight \n               and pixellated. It becomes a wall of image and sound.\n\n                                                                    CUT TO:\n\n               EXT. SKY - DAY\n\n               The GIGANTIC UNDERSIDE of a Boeing 747 TEARS down the screen.\n\n               INT. AIRPORT TRAVELATOR - DAY\n\n               John slides across the screen, motionless, towards Arrivals.\n\n               INT. AIRPORT - DAY.\n\n               Last calls for flights leaving for the other side of the \n               world.\n\n               Travellers criss-cross and swirl.\n\n               INT. AIRPORT MAIN ARRIVALS BOARD - DAY\n\n               BA 1880 MOSCOW On time.\n\n               INT. AIRPORT RESTROOM - DAY\n\n               He dries his face with a paper towel, then checks himself in \n               the mirror. He looks okay, a little white.\n\n               INT. ARRIVALS GATE - DAY\n\n               The Arrivals gate slides open and passengers flood through. \n               John stands among the chauffeurs and cab drivers, as the \n               passengers trundle by.\n\n               We follow one young woman long enough to think this must be \n               her, but it's a false alarm, she's lifted up and spun around \n               by someone else.\n\n               They've all passed. That's that. She wasn't on the flight.\n\n               John wanders away from the gate. He stands about in the swirl \n               in the middle of the airport. People bustle by. Everyone \n               going somewhere.\n\n               Gradually, we get the sense we are being watched. A woman \n               stands nearby. She is about twenty, very beautiful, tired \n               and laden with luggage.\n\n                                     JOHN\n                         Nadia?\n\n               She nods.\n\n                                     JOHN\n                         I'm John.\n\n               They shake hands.\n\n                                     JOHN\n                         Welcome.\n                              (pause)\n                         Well. Look I didn't have a speech \n                         but...\n\n               A distorted passenger announcement breaks above us. It's too \n               loud to talk. It ends and they stand there in silence. He \n               points to her luggage.\n\n                                     JOHN\n                         Is that everything?\n\n                                     NADIA\n                         Yes.\n\n                                     JOHN\n                         Right. Okay. Good.\n\n               They stand there.\n\n               INT. AIRPORT LIFT - DAY\n\n               Nadia and John stand side by side in a huge lift.\n\n                                     JOHN\n                         We can talk in the car.\n\n               A deafening roll of thunder.\n\n               EXT. AIRPORT CAR PARK - DAY\n\n               It's pouring with rain as they cross the car park towards a \n               patched up yellow Rover. John stows the suitcase in the boot \n               and opens the passenger door for her.\n\n               INT. / EXT. JOHN'S CAR (MOVING) - DAY\n\n               John turns the key in the ignition. The MG wheezes and coughs. \n               He tries again. Nothing. The third time it just catches and \n               he coaxes it to life. The colour's drained from his cheeks.\n\n               They head for the motorway. The silence in the car lasts \n               just long enough for John to feel he is breaking it.\n\n                                     JOHN\n                         It's about forty miles from here. I \n                         don't know if you've looked at a \n                         map, it's close to London but it's a \n                         city in itself. A Roman city. It's a \n                         nice house. I'm having a problem \n                         with ants. I uh... It's the warmer \n                         weather. I can't seem to find the \n                         nest. Sorry, do you understand \"ants\"?\n\n                                     NADIA\n                         Yes.\n\n                                     JOHN\n                         I just can't find a nest. The root \n                         of the problem. I've looked \n                         everywhere. What's the Russian for \n                         ant? Sorry that's a stupid... Sorry. \n                         This is strange isn't it.\n\n                                     NADIA\n                         Yes.\n\n                                     JOHN\n                         I'm pretty nervous. Are you?\n\n                                     NADIA\n                         Yes.\n\n                                     JOHN\n                         I mean... \"Ants.\" \"I've got a problem \n                         with ants.\"\n\n               He shakes his head.\n\n                                     JOHN\n                         I had this...\n\n               He pulls a sign from his jacket which says \"Nadia!\"\n\n                                     JOHN\n                         As a joke but uh...\n\n               He tosses it onto the back seat.\n\n               They drive. He sees Nadia looking at England.\n\n                                     JOHN\n                         So. Is it different to how you \n                         imagined it?\n\n                                     NADIA\n                         Yes.\n\n                                     JOHN\n                         I bet.\n                              (pause)\n                         What about me? Am I how you imagined?\n\n                                     NADIA\n                         Yes.\n\n               He double-takes, changes lanes.\n\n                                     JOHN\n                         And how was the flight. Sorry, am I \n                         speaking too fast for you?\n\n                                     NADIA\n                         Yes.\n\n               John looks across.\n\n                                     JOHN\n                         Do uh... Sorry. Can you follow me? \n                         Do you understand what I'm saying?\n\n                                     NADIA\n                         Yes.\n\n                                     JOHN\n                         Good. Or should I speak slower?\n\n                                     NADIA\n                         Yes.\n\n                                     JOHN\n                         Do you follow or should I speak \n                         slower?\n\n                                     NADIA\n                         Yes.\n\n               He looks across. Back at the road. He changes gear.\n\n                                     JOHN\n                         Uh... Are you a giraffe?\n\n                                     NADIA\n                         Yes.\n\n               John turns to face the road ahead.\n\n                                     JOHN\n                              (to himself)\n                         Oh Jesus.\n\n               He drives in silence.\n\n                                     JOHN\n                         Oh Jesus.\n\n               Suddenly she winds the window down and vomits out of the \n               speeding car. John panics and swerves onto the hard shoulder \n               amidst loud horn blasts.\n\n               EXT. HARD SHOULDER - DAY\n\n               John navigates his way round the Rover in the rain to find \n               her kneeling on the verge, throwing up. He puts a hand on \n               her shoulder, but she stands up quickly, maintaining an icy \n               dignity considering what has just happened.\n\n               EXT. JOHN'S CLOSE - DAY\n\n               It has stopped raining and a group of young boys are playing \n               cricket in the road. They clear as a Yellow Rover pulls into \n               the Close, and into the drive of the little house at the \n               end.\n\n               As John climbs out of his car he eyes the boys. The boys eye \n               him, and his new friend.\n\n               INT. JOHN'S HOUSE - DAY\n\n               The front door closes behind them. John and Nadia stand in \n               the silence of his hallway. There is a small banner hanging \n               there: \"Welcome Nadia\". They study the banner together, \n               gravely.\n\n               Eventually he opens a door.\n\n                                     JOHN\n                              (quietly)\n                         Lounge.\n\n               She peers round him and looks inside. He leads her down \n               towards the kitchen.\n\n                                     JOHN\n                         Kitchen.\n\n               She glances around it. Then back at John. He nods to himself, \n               looking tense and pale.\n\n               INT. JOHN'S UPSTAIRS LANDING - DAY\n\n               He puts her suitcase down on the landing, and opens a door. \n               Without looking inside:\n\n                                     JOHN\n                         Bathroom.\n\n               He closes it.\n\n               INT. MAIN BEDROOM - DAY\n\n               Standing in the doorway of John's bedroom.\n\n                                     JOHN\n                         Bedroom.\n\n               There it is. The Double Bed. John frowns gravely.\n\n               Without warning, he marches out. She comes out onto the \n               landing to catch John plus suitcase kicking open another \n               door and vanishing inside.\n\n               INT. SPARE BEDROOM - DAY\n\n               Nadia peers around the door to find John standing next to a \n               narrow monk-like single bed.\n\n                                     JOHN\n                         The uh... the other bedroom...\n\n               She looks at it, then up at John. She turns and walks out.\n\n               Now she's back, with her camouflaged hold-all, dumps it onto \n               the floor, heaves the suitcase onto the bed and smoking no-\n               hands, starts unpacking. John plugs in the lamp by the bed. \n               To show Nadia how it works he switches it on, off, on, off, \n               and then feels stupid.\n\n                                     JOHN\n                         I'll get an ashtray.\n\n               With John gone, Nadia stops unpacking. She walks to the window \n               and stares out over the rooftops of the estate.\n\n                                                                    CUT TO:\n\n               INT. LOUNGE - DAY\n\n               John on the phone.\n\n                                     ANSWER MACHINE\n                         You have reached From Russia with \n                         Love. Our office reopens on Monday. \n                         If you are interested in our \n                         services...\n                              (etc. etc.)\n                         Thank You.\n\n                                     JOHN\n                         This is John Buckingham from St \n                         Albans. I need to speak to you \n                         urgently. There's a critical problem. \n                         It's... Call me back as soon as \n                         possible. It's critical.\n\n               INT. STAIRS / LANDING - DAY\n\n               John climbs the stairs holding a saucer for an ashtray. He \n               knocks lightly on the spare room door.\n\n               INT. SPARE ROOM / LANDING - DAY\n\n               Nadia is lying asleep on the bed in only her black underwear. \n               We duck straight back out.\n\n               John composes himself. He puts his head back round the door \n               as if there's a real chance it will be shot off. She's facing \n               away, arms folded, still holding the cigarette. It has burnt \n               out, leaving a long curl of ash on her bare hip.\n\n               He approaches the bed with immense trepidation, eases the \n               cigarette from between her fingers and drops it in the bin. \n               He stares at her bare hip, with the ash on it. Holding the \n               saucer under the ash, he blows on it gently. It takes three \n               careful breaths before it drops in the saucer. Unseen by \n               John, her eyes are wide open as he steals out onto the \n               landing. We stay with her a moment.\n\n                                                                    CUT TO:\n\n               A pot of stew, bubbling on the hob.\n\n               INT. KITCHEN - DAY\n\n               John is stirring a pot on the hob. By his expression he might \n               be defusing a bomb.\n\n               His head cocks, he stiffens. Nadia walks right into the \n               kitchen. She's changed, jeans and a tee shirt. Nadia takes \n               the spoon from him, says something in Russian, gestures for \n               him to sit.\n\n               She tastes the stew. Now she stirs the pot. He watches her.\n\n                                                                    CUT TO:\n\n               INT. KITCHEN - DAY\n\n               John and Nadia sit opposite each other. She takes a mouthful. \n               They catch one another's eye. And again.\n\n               On the wall across, six ants careen in crazy circles. John \n               can see them, but doesn't move.\n\n               He puts his fork down.\n\n                                     JOHN\n                         I don't know what to say. Your letters \n                         were in English. Good English. You \n                         said you'd studied English.\n\n               Nadia reaches down into her bag and pulls out a small box \n               wrapped in brown paper. She places it in front of him.\n\n               He warily unwraps a little wooden box. He opens the lid and \n               fishes out a simple gold ring. He holds it in his palm.\n\n                                     JOHN\n                         I can't take this.\n\n               He puts it back in the box, hoping it will disappear.\n\n               She fishes it out again and holds it on her palm for him to \n               take.\n\n                                     JOHN\n                         I can't take it. I'm not really a \n                         ring guy.\n\n               She takes his hand. He automatically yanks it away like he's \n               been burned. She takes his hand again and to stop it becoming \n               unbearable, he allows Nadia to push the ring onto his ring \n               finger. It goes on easily.\n\n                                     JOHN\n                         Okay. No big deal. Thank you. Yes \n                         thanks. Thank you.\n\n               INT. LOUNGE - NIGHT\n\n               John and Nadia sit next to each other on the couch watching \n               T.V. John's gaze seems to go through the T.V. and a thousand \n               yards beyond. Nadia is knitting a half-finished jumper, blood \n               red.\n\n               John stands and disappears out of shot.\n\n                                     JOHN (O.S.)\n                         If anyone gets this message please \n                         call as soon as possible. It's an \n                         emergency.\n\n               John sits back down. He steals side-glances at her. Her mouth. \n               Her red-painted fingers knitting fast.\n\n               John flips through the channels --\n\n               The Money Programme. \n               Antique's Roadshow. \n               Cup Rugby.\n\n               Eventually he offers Nadia the remote control. She takes, \n               aims it at the T.V. but doesn't press it. Just as it seems \n               she won't, she does: University Challenge.\n\n               They watch University Challenge with Nadia still aiming the \n               control and smoking. After another long pause she flips the \n               button --\n\n               The Money Programme. \n               Antiques Roadshow. \n               Rugby.\n\n               She flips again then hands the controls back to John and \n               they watch University Challenge.\n\n               Nadia puts down her knitting, stretches and yawns.\n\n               INT. LOUNGE / STAIRS - NIGHT\n\n               Nadia climbs the stairs. John watches her, hovering in the \n               doorway of the darkened lounge.\n\n               He hears the bathroom door close before venturing up.\n\n               INT. BEDROOM - DAY\n\n               John sits on the edge of his bed. He cocks his head:\n\n               Door opening and shutting; feet padding along landing; door \n               closing. Silence. He squeezes his door open and peers down \n               the dark landing. The coast is clear.\n\n               INT. BATHROOM - DAY\n\n               Brushing his teeth, staring accusingly at his reflection. \n               Spits. Finished, he takes a deep breath and opens the door, \n               and gives a small shout.\n\n               Nadia is standing right outside the door; Nightshirt, damp \n               hair, toothbrush in her mouth.\n\n                                     JOHN\n                         Good night.\n\n               He squeezes past and quick-steps down the landing.\n\n               INT. BEDROOM - NIGHT\n\n               He climbs into the big bed, fully clothed, turns off the \n               light and lies there in the moonlight.\n\n               After twenty seconds, the bedroom door clicks open. John \n               climbs out of bed as casually as possible and stands around.\n\n                                     JOHN\n                         You should go now. We'll talk in the \n                         morning.\n\n               His eyes widen but he can't speak. He wants to but she's \n               placed her hand across his mouth. She reaches down and takes \n               his hand, and draws it towards her, slowly tracing his fingers \n               across her breasts. She unbuttons her shirt and pulls his \n               hand inside.\n\n               He's breathing hard, her right hand still clasped over his \n               mouth. Her free hand lowers to press against him, and unzip \n               his fly. He lets out a moan.\n\n               We concentrate on their faces. Above the silence all we can \n               hear is John's breathing -- Before long Nadia looks down -- \n               He's come.\n\n               Nadia turns and walks out, leaving John marooned, gasping in \n               and blowing out, angry almost, buttoning his trousers.\n\n               EXT. JOHN'S CLOSE - NIGHT\n\n               Exterior view of John's darkened house. A fox trots across \n               the Cul-De-Sac and sits under John's car, where it curls up.\n\n               INT. JOHN'S BEDROOM - NIGHT\n\n               John lying in bed staring out at a streetlight.\n\n               INT. NADIA'S ROOM - DAY\n\n               The morning. Nadia opens her eyes in the sun-filled room.\n\n               INT. LANDING - DAY\n\n               She pads down the hall in her nightshirt and opens the door \n               to the bathroom. There on the toilet, naked, is John. He \n               gives another short shout. Nadia holds his eye for a couple \n               of seconds too long, before shutting us inside with him.\n\n               EXT. JOHN'S GARDEN - DAY\n\n               John sprints down his lawn, scattering the big black crows \n               eating his garden. He jumps the fence, and across the fields.\n\n               EXT. COUNTRYSIDE - DAY\n\n               John jogs along by a river in the countryside behind his \n               house, wearing shorts and a tee shirt. His breath billows \n               around him in the sharp morning air.\n\n               He stops running by a gate overlooking a small hill. He \n               doubles up to recover, panting hard.\n\n               INT. JOHN'S GARDEN - DAY\n\n               Two wild rabbits are nibbling the remains of a big breakfast \n               left on the lawn. John climbs heavily back over his fence.\n\n               There's a deck chair out there, surrounded by the remains of \n               breakfast. Some glossy Russian magazines, a full ashtray, \n               Nadia's knitting.\n\n               The patio door is ajar, the net curtain billowing. He scans \n               the garden jumpily. The boy next door is on his trampoline, \n               bouncing up and down, watching John at the top of each bounce.\n\n               INT. JOHN'S HOUSE - DAY\n\n               Sweating from the run, John peers up the stairs. The house \n               is silent. In the lounge he picks up the phone and dials a \n               number.\n\n                                     ANSWER MACHINE\n                         You have reached From Russia With \n                         Love. If you are interested...\n\n               He hangs up.\n\n               INT. LANDING - DAY\n\n               John stands with his ear to the bathroom door. The shower's \n               on.\n\n               INT. NADIA'S BEDROOM - DAY\n\n               It's empty. He slips inside.\n\n               Stuff everywhere. Cigarette cartons, several lighters, spare \n               wool, suitcase, rucksack. Huge poster of Bruce Springsteen \n               on wall.\n\n               Warily, he opens the bedside drawer: Different coloured bras \n               and knickers.\n\n               In her open suitcase lies a small wooden chest. He lifts it \n               out and puts it on the bed, hesitates, then opens it.\n\n               A pair of Russian Army field binoculars. He puts them on the \n               bed beside him. A small silver pistol, the size of a \n               Derringer. He studies it, and pulls the trigger. It's a \n               cigarette lighter.\n\n               A brochure of prospective husbands provided by the marriage \n               agency. After a dozen or so photos he comes across his page \n               but the photo has been cut out. He sees his name in the \n               strange lettering, under the hole.\n\n               INT. BATHROOM - DAY\n\n               Nadia in the shower, eyes shut, water pouring over her face.\n\n               INT. NADIA'S ROOM - DAY\n\n               John flicks through a stack of photographs. One of Nadia as \n               a young girl in a meadow, with binoculars around her neck -- \n               John looks at the same binoculars on the bed next to him. He \n               turns them over in his hands.\n\n               He looks through them. He slowly lowers them. He's seen \n               something. He stands and crosses the room.\n\n               On the mantelpiece, in a silver frame, is his picture, cut \n               from the brochure. He holds it in his hands.\n\n               The shower has stopped. In a panic he replaces the picture, \n               the photographs, the gun lighter, the brochure, and the \n               binoculars.\n\n               INT. LANDING - DAY\n\n               Nadia leaves the bathroom, hair wrapped in a towel, and heads \n               straight towards us.\n\n               INT. NADIA'S BEDROOM - DAY\n\n               John shuts the chest, drops it back into the suitcase.\n\n               The photo of the binoculars girl is on the pillow. He whips \n               it under the bed just as Nadia enters.\n\n               She doesn't seem surprised to see him standing there, in her \n               room, in his tee shirt and running shorts.\n\n                                     JOHN\n                         Nadia. This isn't going to work. I'm \n                         sorry. It's been a terrible mistake. \n                         You must go.\n\n               He takes the ring off and holds it out to her. She doesn't \n               take it. He puts it on the bed.\n\n                                     JOHN\n                         I'm booking a flight for tomorrow. \n                         I'm sorry.\n\n               John and Nadia on her bed, Nadia tearing off his tee shirt. \n               She gets on top.\n\n               EXT. JOHN'S CLOSE - DAY\n\n               The milkman hops a low fence between two houses. He waves to \n               a man watering his rose trees.\n\n               INT. NADIA'S ROOM - DAY\n\n               John and Nadia having sex. They don't take their eyes off \n               each other.\n\n               EXT. JOHN'S CLOSE - DAY\n\n               A mother corrals her school children into a Volvo. They don't \n               want to go.\n\n               INT. NADIA'S ROOM - DAY\n\n               John sits on the edge of the bed, holding his head in his \n               hands. The door has just shut behind him. He looks at his \n               left hand. He has the ring on.\n\n                                     VOICE OVER\n                         Problem solving. John identifies \n                         most problems within appropriate \n                         time frames...\n\n               INT. NATWEST BANK, ST ALBANS - DAY\n\n               The large oak doors of the bank swing open.\n\n                                     VOICE OVER\n                         Most of the time he develops several \n                         alternative solutions to problems...\n\n               We move fast through the banking hall to the furthest counter. \n               The blind snaps up to reveal John, wearing a smart suit.\n\n                                     VOICE OVER\n                         He usually resolves or minimises \n                         most problems before they grow into \n                         larger problems...\n\n               INT. BEHIND THE GLASS - DAY\n\n               John's skilled hands loading a stack of banknotes into a \n               drawer. The cashier next along, Clare, smiles at him.\n\n                                     CLARE\n                         Good weekend?\n\n                                     JOHN\n                         Uh. Yeah. Pretty good.\n\n                                     CLARE\n                         Do anything special?\n\n                                     JOHN\n                         Uh. No.\n\n                                     VOICE OVER\n                         Communications. John listens and \n                         comprehends well.\n\n               INT. BRANCH MANAGER'S OFFICE - DAY\n\n               John sits in front of a large desk, hands on knees.\n\n                                     BRANCH MANAGER (O.S.)\n                         When communicating he is good at \n                         selecting the most efficient methods \n                         and displays effective verbal \n                         communication skills...\n\n               Across the desk the Branch Manager reads a report out loud \n               in an impersonal, flat manner.\n\n                                     BRANCH MANAGER\n                         On one occasion John showed first \n                         class communication skills in a \n                         delicate customer situation.\n\n               INT. JOHN'S KITCHEN - DAY\n\n               Nadia opens a kitchen cupboard and stares inside at John's \n               groceries.\n\n                                     BRANCH MANAGER (V.O.)\n                         Initiative. John is reasonably quick \n                         to volunteer whenever others need \n                         help. Although he is sometimes \n                         reluctant and or unwilling to ask \n                         for it himself...\n\n               She opens some pickled onions and pops one in her mouth.\n\n               INT. LIVING ROOM - DAY\n\n               Cradling the jar of onions, she scans his bookshelf.\n\n                                     BRANCH MANAGER (V.O.)\n                         He is adequate at resolving difficult \n                         or emotional customer situations...\n\n               Bluffers guide to the Internet. She opens an old copy of The \n               Lion, The Witch and The Wardrobe. Inside is written 'John \n               Buckingham Class 3F'.\n\n                                     BRANCH MANAGER (V.O.)\n                         He usually fulfills commitments made \n                         to customers within expected time \n                         frames.\n\n               INT. JOHN'S BEDROOM - DAY\n\n               She opens the wardrobe. In a shoebox she finds some photos.\n\n                                     BRANCH MANAGER (V.O.)\n                         Customer Service. John shows a high \n                         degree of respect for customers...\n\n               One of John as a little boy, holding a football, flanked by \n               his parents. On the back someone has written \"Summer 1973\".\n\n                                     BRANCH MANAGER (V.O.)\n                         John still has some reluctance to / \n                         or has problems in, carving out new \n                         relationships face to face.\n\n               There is a photo of John, about three years ago, arm in arm \n               with a plain, thin-looking girl, with small eyes. Another of \n               him kissing her on the cheek.\n\n               INT. BRANCH MANAGER'S OFFICE - DAY\n\n               John listening.\n\n                                     BRANCH MANAGER\n                         Judgment -- John makes able decisions \n                         in most areas of his job.\n\n               INT. JOHN'S BEDROOM - DAY\n\n               Nadia sees something at the bottom of the cupboard. She bends \n               down to retrieve a black dustbin liner. She reaches in and \n               pulls out a small stack of hardcore pornographic magazines.\n\n                                     BRANCH MANAGER (V.O.)\n                         John follows instructions \n                         conscientiously and responds well to \n                         personal directions.\n\n               She upends the bag and a half dozen videos fall out. She \n               picks up a magazine and begins flicking through it \n               impassively.\n\n               INT. LOUNGE - DAY\n\n               Nadia downstairs kneels in front of the T.V. and slips a \n               video into the machine. Nadia's face is lit up by the screen. \n               The sound of sex.\n\n                                     BRANCH MANAGER (V.O.)\n                         John is normally very punctual and \n                         in most situations assumes \n                         responsibility for his own actions \n                         and outcomes.\n\n               She pops a pickled onion in her mouth, and watches. We see \n               the images close and pixellated, as we did the marriage videos \n               in the titles. It's a bondage scene, the woman wears a gag.\n\n               INT. BRANCH MANAGER'S OFFICE - DAY\n\n               John back in the room. The report has finished and the manager \n               is scrutinising him in silence.\n\n                                     JOHN\n                         Thank you -- I think that's very \n                         fair.\n\n               INT. / EXT. JOHN'S CAR (MOVING) - DAY\n\n               John drives his Rover through the centre of town, the low \n               orange sun on his face.\n\n               EXT. JOHN'S CLOSE - DAY\n\n               The Rover pulls into the driveway. John opens the glove \n               compartment and removes the ring Nadia gave him, and puts it \n               back on. He collects a brown paper package from the passenger \n               seat.\n\n               INT. JOHN'S KITCHEN - NIGHT\n\n               John and Nadia at the supper table. She is knitting the \n               jumper. Despite the silence, John seems more relaxed, in \n               shirtsleeves and loosened tie. He puts his fork down, and \n               places the brown bag on the table, pushing it across to Nadia. \n               She opens it and removes a big hardback Russian - English \n               dictionary. John smiles and nods \"open it\". She flicks through \n               it.\n\n               She turns it over in her hands, nods, puts the book down, \n               reaches under the table and surfaces with the stack of porn \n               magazines. She puts them on the table next to the dictionary.\n\n               John beholds the pile. \"Wet N' Wild\" is on top.\n\n               He rises slowly from the table and sleepwalks from the \n               kitchen.\n\n               INT. JOHN'S HALL / STAIRS / LANDING / BATHROOM - DAY\n\n               John, frozen-headed, floats down the hall, up the stairs \n               into the bathroom, locks the door, sits on the toilet.\n\n               INT. JOHN'S KITCHEN - DAY\n\n               Downstairs Nadia clears, the dishes. The porn stack still \n               sits on the table, beside the dictionary.\n\n               INT. BATHROOM - DAY\n\n               Still on the toilet. He hasn't moved. He closes his eyes.\n\n               INT. LANDING - NIGHT\n\n               It's dark. The bathroom door opens a crack. The coast clear, \n               he dashes for the cover of his bedroom.\n\n               INT. BEDROOM - NIGHT\n\n               John rests his head against the doorframe and heaves a sigh \n               of relief. He turns and freezes. Nadia is there next to him.\n\n               She slowly loosens his tie. Holding it in her hands she \n               examines the strange little bank logo on it, before \n               deliberately tying the tie over her mouth like a gag.\n\n               A second tie is pulled from a hanger in the cupboard. Quickly \n               and skillfully she ties her hands together, pulling it tight \n               with her teeth. Finished, she flicks her hair back, and gives \n               him a long, level look.\n\n                                     VOICE OVER\n                         It will feel very strange at first \n                         but then you get used to it.\n\n                                                                    CUT TO:\n\n               INT. ROOM IN THE BANK - DAY\n\n               A close up of John's face. He closes his eyes, falls \n               backwards, and is caught in the arms of a colleague.\n\n                                     TRAINER\n                         Good. Again.\n\n               John stands again and closes his eyes. After a short wait he \n               falls back and again his colleague catches him just before \n               he hits the ground.\n\n                                     TRAINER\n                         Very good. How does that feel John?\n\n                                     JOHN\n                         It feels good. Weird.\n\n                                     TRAINER\n                         It's called Trust and Letting Go.\n\n               John nods.\n\n                                     TRAINER\n                         Trust and Letting Go.\n\n               A simple guitar theme begins, and plays over the following \n               sequence:\n\n               Kids playing cricket in John's Close. A boy hits the ball \n               and others chase it as it bounces off cars.\n\n               John at dusk tied to the bed with his two bank ties. Nadia \n               is on top. They are having sex.\n\n               Hands stacking bank notes into the back of a cash machine. \n               Fast, mechanical.\n\n               At the bank, John walks to his desk. His phone rings. He \n               answers it.\n\n               Silence. Then soft breathing. John listens intently and looks \n               around.\n\n               \"Nadia...?\" -- John sits there, surrounded by his colleagues, \n               listening to Nadia breathe.\n\n               Close up on a man's hands tying a tie tight a-round a woman's \n               wrist. Pull back to a close up of Nadia's face, her eyes \n               fixed on John.\n\n               John running by the river.\n\n               John watches Nadia rise from his bed after sex and leave the \n               room. He stares out the window.\n\n               Nadia's fingers, knitting skillfully.\n\n               Nadia sits on her bed alone, pulling on black stockings and \n               attaching them to suspenders.\n\n               The street cricketers run for cover as a thunder storm breaks \n               over the close.\n\n               Rain coming down in John's garden. The pair sit under the \n               shelter of the back porch. John has his hands out as Nadia \n               is winding red wool it into a ball. The jumper is half \n               finished.\n\n               The rabbits shelter from the rain under broad leaves.\n\n               John in a pub with a four colleagues from the bank. He sips \n               his half, half listening to the conversation. It all seems \n               so dull. He finishes his drink and looks at his watch. They \n               ask him if he's staying for another.\n\n               A knitting needle is drawn from a row of red stitches on the \n               nearly-finished jumper.\n\n               Nadia kneels over John holding the knitting needles. She \n               presses one to his skin and we watch it drawn across his \n               chest in close up, up to his neck.\n\n               His eyes are fixed on hers.\n\n               Close up on Nadia's face. Her mouth is gagged and she's lying \n               on her front, head half-buried in a pillow. We can just make \n               out John behind, on top of her. Both are lying still and \n               breathing hard, covered in sweat. Catching her breath Nadia \n               yanks the gag off and wriggles out from underneath him. She \n               snatches up a towel and covering herself hurries to the \n               bathroom.\n\n               The guitar theme ends.\n\n               INT. LANDING - NIGHT\n\n               John presses his ear to the bathroom door. The sound of \n               retching.\n\n               The toilet flushes. John pads back to his bedroom. Through \n               the gap in the door he sees Nadia coming out, go to her room, \n               and shut the door. He rests his head against the door frame.\n\n                                                                    CUT TO:\n\n               INT. LOUNGE - DAY\n\n               A beautiful morning. Through the patio window, John watches \n               Nadia in the garden, sitting on the lawn reading her \n               dictionary in the sunlight. In dungarees with her hair up, \n               she looks very young.\n\n               EXT. GARDEN - DAY\n\n               He walks warily out into the sunlight. She looks up, then \n               back to the big book in her lap. He places the tea next to \n               her on the grass.\n\n                                     JOHN\n                         Are you O.K.?\n\n               She looks at him, then down at her tome. She speaks slowly, \n               in a heavy accent:\n\n                                     NADIA\n                         Today is bath day.\n\n                                     JOHN\n                         Sorry?\n\n               She studies her book. Looks up.\n\n                                     NADIA\n                         Today is bath day.\n\n               He shakes his head.\n\n                                     JOHN\n                         Bath day?\n\n               She nods.\n\n                                     JOHN\n                         I don't understand.\n\n                                     NADIA\n                         Happy bath day.\n\n               The penny drops.\n\n                                     JOHN\n                         Today?\n\n               She frowns. John leafs through the dictionary.\n\n                                     JOHN\n                         Syevodnya?\n\n                                     NADIA\n                         Syevodnya\n\n                                     JOHN\n                         Happy Birthday. Happy Birthday.\n\n               He puts his hand on her shoulder.\n\n                                     NADIA\n                         Party.\n                              (pause)\n                         Party. Syevodnya.\n\n               John nods, smiling.\n\n                                     JOHN\n                         Yes. Party. Party syevodnya.\n\n               She lights a cigarette from the butt of her last. Blows smoke. \n               She holds the jumper up to John, as if to try it for size, \n               and the theme returns.\n\n               INT. KITCHEN - DAY\n\n               John is on the telephone.\n\n                                     JOHN\n                         ...It might just be a twenty-four \n                         hour bug...\n\n               INT. BANK - DAY\n\n               Clare listens, concerned.\n\n                                     CLARE\n                         Well you just get better. I'll tell \n                         Beaky. You just get some rest, ok?\n\n               INT. KITCHEN - DAY\n\n               John puts the phone down. He looks down the hall, where Nadia \n               is killing ants on the table, with her dictionary. He smiles.\n\n               EXT. JOHN'S CAR - DAY\n\n               A shot from above, of the Rover's windscreen, reflecting the \n               passing trees.\n\n               The roof is down. We glide up the windscreen, up Nadia's \n               body, in the passenger seat. Her face is upturned slightly, \n               she's wearing sunglasses, which reflect the passing trees.\n\n               INT. JOHN'S LOUNGE - NIGHT\n\n               Nadia sits alone at the dining room table. Suddenly the lights \n               go out. John enters, carrying a small birthday cake glowing \n               with candles.\n\n               The light throws huge shadows on the walls and flickers across \n               their faces.\n\n               He sets the cake down on the table and sits down opposite \n               Nadia\n\n                                     JOHN\n                         Happy Birthday to you. Happy Birthday \n                         to you. Happy Birthday dear Nadia...\n\n               The front doorbell rings. A loud long burst. Nadia's face \n               transforms into a big grin. She hurries out into the hall, \n               leaving John alone with the cake. Nadia whooping and shouting \n               excitedly. Other voices. Shouting. Shouting in Russian.\n\n               A man bursts in carrying Nadia in his arms. He spins her \n               round in the candlelight, kisses her, puts her down and goes \n               to the table where he blows out the candles. They are plunged \n               into darkness.\n\n               Lots of whooping and laughing. A Zippo flares up and \n               illuminates some faces, all laughing.\n\n                                                                    CUT TO:\n\n               John's hand groping along the wall. It finds the light switch.\n\n               There are two men here. One small and wiry, one big and dark, \n               like Rasputin. They each carry rucksacks and a guitar case.\n\n                                     YURI\n                         You must be John. You seem very nice. \n                         Excuse me.\n\n               In Russian, the first man introduces Nadia to the other man, \n               who is relighting the candles with a Zippo. It seems they \n               haven't met before.\n\n               The first man, Yuri, pulls out a bottle of vodka and hands \n               it to John.\n\n                                     YURI\n                         How's that? We can't drink our piss \n                         can we?\n\n                                     JOHN\n                         Hang on hang on, sorry, but like, \n                         who are you?\n\n                                     YURI\n                         You must find some glasses, small, \n                         for the toast, and some plates.\n\n                                     JOHN\n                         What are you doing here?\n\n               Yuri stops.\n\n                                     YURI\n                         Sorry. You've lost me...\n\n                                     JOHN\n                         I'm asking what you're here for.\n\n                                     YURI\n                         What?\n\n               Yuri speaks to Nadia in fast Russian.\n\n                                     YURI\n                              (to John)\n                         You don't speak Russian? Pratsteetye! \n                         This explains your cold eyes.\n\n               Nadia begins gabbling to Yuri in Russian. Yuri says the \n               English word -- \"Friends\".\n\n                                     NADIA\n                              (to John)\n                         \"Frenzy\".\n\n                                     JOHN\n                         Yes I know.\n\n                                     YURI\n                              (himself)\n                         Yuri.\n                              (Rasputin)\n                         Alexei. Alexei and Yuri.\n\n               Alexei speaks.\n\n                                     JOHN\n                         What did he say?\n\n                                     YURI\n                         He says he feels safe here.\n\n               Nadia talks fast to Yuri.\n\n                                     YURI\n                         She says she wanted to tell you but \n                         her English is shit. And no one speaks \n                         Russian, it's very hard for her. The \n                         light please.\n\n               Alexei turns off the light again. Nadia blows out her candles. \n               They are plunged back into darkness. John turns the light on \n               again. Yuri is already sitting down.\n\n                                     JOHN\n                         I need to know who you are first \n                         please.\n\n                                     YURI\n                         Oh.\n                              (Yuri stands)\n                         We are Russian.\n\n                                     JOHN\n                         Yes. I know.\n\n                                     YURI\n                         Good.\n                              (he sits down)\n\n                                     JOHN\n                         And...\n\n                                     YURI\n                         And what? You mean from the beginning? \n                         Jesus. Can I uh okay, as we say in \n                         Russia can I cut a long story short. \n                         Okay. Nadia is my little cousin. \n                         Except she's not. But we say cousin. \n                         This is for you.\n\n               He hands John another bottle of vodka.\n\n                                     JOHN\n                         Hold on.\n\n                                     YURI\n                         Toast first then we talk seriously, \n                         I can see you are serious about us.\n\n               Vodka is splashed into their glasses. Yuri raises his glass \n               and shouts a toast in Russian: \"Vashe Zdarovye!\". They down \n               their vodka, John sips at his, then realises he must finish \n               it. Yuri makes as if to throw his in the fireplace.\n\n                                     YURI\n                         Just kidding.\n\n               Sausages, cheese, bread and pickle bottles rain onto the \n               table from Yuri's rucksack.\n\n                                     JOHN\n                              (to Yuri)\n                         So hang on. You're both Nadia's \n                         cousins?\n\n                                     YURI\n                              (shaking his head)\n                         Of course not. Alexei, he's is my \n                         problem.\n\n                                     JOHN\n                         Right.\n\n                                     YURI\n                         We better watch him. He's crazy.\n\n                                     JOHN\n                         Right.\n\n                                     YURI\n                         I am actor, he is actor, although he \n                         is an actor stroke musician. I just \n                         noodle along, I'm not so good. He \n                         makes me look like a retard -- He \n                         smokes me. I don't mean he smokes \n                         me.\n\n               Yuri mimes giving a blow-job.\n\n                                     YURI\n                         I mean he smokes me. Do you say \n                         \"smoke\" in U.K.?\n\n               He mimes the blowjob again.\n\n                                     JOHN\n                         No.\n\n                                     YURI\n                         Right. So I can say he smokes me. \n                         So.\n\n               Pause.\n\n                                     JOHN\n                         So?\n\n                                     YURI\n                         So I come to England with other actors \n                         to make shows, I meet this freak \n                         from Novgorod I tell him of you and \n                         Chicken and the birthday here we \n                         are.\n\n               Yuri speaks to Nadia in Russian, she replies looking at John.\n\n                                     JOHN\n                         What was that?\n\n                                     YURI\n                         I asked her if you were happy to see \n                         us. I find it hard to tell with you.\n\n                                     JOHN\n                         Yes it's okay. Thank you for the \n                         food.\n\n               Nadia lights a cigarette. John notices that on both wrists \n               she has bold red marks from the ties. He freezes.\n\n                                     YURI\n                         She says you are a little shy. I \n                         think I know this.\n\n               John is thrown, panicking that one of them will notice the \n               marks.\n\n                                     JOHN\n                         So how long will you be in England?\n\n                                     YURI\n                         Plans are for the architects, \n                         politicians and so forth.\n\n                                     JOHN\n                         You must have a visa or something...\n\n                                     YURI\n                         You're asking for my documents?\n\n                                     JOHN\n                         No, no...\n\n               Yuri laughs, translates for Alexei and they both get a big \n               laugh out of this. Yuri gets his passport out and makes a \n               big show of presenting it to John. But John keeps glancing \n               at the marks on Nadia's wrists. We see a close up of her \n               neck. There is the tiniest blood mark. John sees it and starts \n               to sweat.\n\n                                     YURI\n                         We are all Europeans here. Europe, \n                         Tony Blair and Maggie Thatcher!\n\n               Yuri raises his glass and they all drink to Tony Blair and \n               Margaret Thatcher. John drinks his vodka in two hot gulps.\n\n                                     YURI\n                         So. You have nothing to say to your \n                         Fiancee? Maybe to wife of forty years \n                         it's understandable. Come on. You \n                         speak and I will translate.\n\n               John looks glazed. The room falls silent.\n\n                                     JOHN\n                         Hello.\n\n               Yuri translates -- She replies.\n\n                                     YURI\n                         She says 'Hello' to you. Go for it \n                         John!\n\n                                     JOHN\n                         Uh. Do you like England?\n\n                                     YURI\n                         Classic!\n                              (he translates)\n                         Thank God. She says 'Yes!'\n\n               John nods. He watches Nadia tap ash. The wrist again.\n\n                                     JOHN\n                         Uh...\n\n               They all wait. Yuri nods encouragingly.\n\n                                     JOHN\n                         I can't think of anything. Hang on.\n\n               Nadia speaks in Russian to Yuri.\n\n                                     YURI\n                         She says she has a secret to tell.\n\n                                     JOHN\n                         What?\n\n               Nadia speaks. John waits uncomfortably. Silence.\n\n                                     YURI\n                         She says she watched you at the \n                         airport.\n\n               John stops.\n\n                                     JOHN\n                         When?\n\n                                     YURI\n                              (translating)\n                         \"I saw you waiting there, by the \n                         gate.\"\n\n                                     JOHN\n                         I...\n\n                                     YURI\n                         \"I have these uh...\" She explains to \n                         you... \"When I was a little girl my \n                         father had these beautiful old \n                         glasses.\" Like... I don't know the \n                         word. Like for watching uh... for \n                         watching the birds.\n\n               We see John's face.\n\n                                     JOHN\n                         Binoculars.\n\n                                     YURI\n                         Binoculars. He had these Binoculars \n                         he has kept from the war.\n\n                                                                    CUT TO:\n\n               Scene 1 reprise.\n\n               EXT. SUMMER MEADOW - DAY\n\n               A young girl runs through a summer meadow with a pair of \n               Russian Army field binoculars, around her neck.\n\n                                     YURI (V.O.)\n                         I would run around with them taking \n                         pictures of things I liked with my \n                         mind. If I saw something beautiful I \n                         would take a picture.\n\n               With the binoculars pressed to her face, she spies \n               butterflies, birds, a rabbit. She stops running and aims the \n               binoculars up, up, into the sun\n\n               INT. JOHN'S LIVING ROOM - NIGHT\n\n               Yuri translates.\n\n                                     YURI\n                         The day before I left Russia my father \n                         gave me the old binoculars. He said \n                         that when I saw you I was to stand \n                         far away and look at you with these, \n                         and to examine your face closely. \n                         And if you were a bad person I could \n                         run away.\n\n               Nadia looks at the table.\n\n                                     YURI\n                         She says she took a picture.\n\n               John watches Nadia looking at the table. She glances up once \n               and catches his eye.\n\n               Alexei suddenly slams his hand down on the table. He raises \n               his palm. There is an ant squashed there. He shows Yuri.\n\n                                     ALEXEI\n                         Nasyekski.\n\n               EXT. JOHN'S GARDEN - NIGHT\n\n               The small party has moved outside to the patio, where they \n               sit around a low wooden table in the mellow candlelight. A \n               huge late Summer moon hangs over the fields. Alexei tinkles \n               beautifully on his guitar.\n\n               He stops asks a question in Russian.\n\n                                     JOHN\n                         What was that?\n\n                                     YURI\n                         Oh nothing.\n\n                                     JOHN\n                         Tell me.\n\n                                     YURI\n                         No. It is too judgmental.\n\n                                     JOHN\n                         Tell me what he said.\n\n                                     YURI\n                         He says why did you send to Russia \n                         for a wife.\n\n               Silence. John suddenly looks sick.\n\n                                     YURI\n                         You are not ashamed of it? It's no \n                         surprise to want to love.\n\n                                     JOHN\n                         No. It's not that.\n\n                                     YURI\n                         Do you believe in love?\n\n                                     JOHN\n                         I suppose it's... I mean define your \n                         terms.\n\n                                     YURI\n                         It's very strange. How many people \n                         are truly themselves with their love? \n                         It is the greatest human disaster \n                         and it is never in the newspapers. \n                         There are no Marches Against \n                         Heartache, no Ministries Against \n                         Loneliness, no Concerts Against \n                         Disappointment. We look away. And \n                         still we know in secret that nothing \n                         is more important to us. The one \n                         thing we all share but don't say. \n                         Look John I will show you something.\n\n               He takes a plate and starts reaching for the food.\n\n                                     YURI\n                         Here look, something beautiful from \n                         Russia. Here is Life, there, take \n                         it.\n\n               John accepts the plate.\n\n                                     YURI\n                         Here is bread. Khylep. This is work. \n                         We all need this, here eat.\n\n               John eats.\n\n                                     YURI\n                         Good. But we cannot survive with \n                         just work, so here is meat and blood. \n                         Myasa. This is family and country, \n                         flesh, strength, eat.\n\n               John bites the sausage.\n\n                                     YURI\n                         But again this is not life. Here is \n                         joy and pain. Chyesnok. Without these \n                         life has no flavour, is too serious. \n                         Eat.\n\n               John nibbles some pickled garlic.\n\n                                     YURI\n                         But this vodka.\n                              (pause)\n                         Is love. Only this magic changes you \n                         inside. The moon and the stars and \n                         the sun.\n\n               Yuri offers John the glass. He looks at Nadia, takes it and \n               swigs it down in one. He looks across at Nadia, wiping his \n               mouth, his eyes watering. She looks back at him.\n\n               Alexei begins softly singing a song. As he sings:\n\n                                     YURI\n                         This is a love song, a soldier's \n                         song to his beloved -- Alexei, he's \n                         Afghanstya, a veteran of Afghanistan. \n                         He saw terrible things.\n\n               They listen to the beautiful, sad voice. For the second verse \n               Yuri joins in, a slow stirring lament. For the end Nadia \n               joins in too and the three of them begin harmonising \n               beautifully. John watches in the candlelight.\n\n               John, Nadia and Alexei pose with the cake. Nadia puts her \n               arm round John and Alexei. With a FLASH! Yuri takes a \n               Polaroid.\n\n               The guitar theme returns as we see the Polaroid on the table \n               in close up, developing speeded up. John comes into focus, \n               beaming.\n\n               INT. LOUNGE - NIGHT\n\n               We track across the sleeping faces of Yuri and Alexei tucked \n               into their sleeping bags with guitar cases for pillows. John \n               switches the light off and closes the door.\n\n               INT. JOHN'S BEDROOM - NIGHT\n\n               John and Nadia seen from above lying asleep, with their heads \n               together, in the moonlight. Nadia whispers something in her \n               sleep, in Russian. Fast asleep John mutters something in \n               English. Their sleeping, unintelligible conversation, drifts \n               on in the night.\n\n               INT. BANK - DAY\n\n               John sits at his desk in the open plan office. He looks \n               nervous.\n\n               This is because he is wearing Nadia's ring. People pass his \n               desk, a couple say hello, but they don't notice. He rubs his \n               chin. Nobody notices.\n\n               Eventually his manager approaches.\n\n                                     BRANCH MANAGER\n                         Quick word John?\n\n               He leans over the desk.\n\n                                     BRANCH MANAGER\n                         This is sensitive. Your car. Lovely \n                         car. Doesn't necessarily give the \n                         right impression.\n\n                                     JOHN\n                         Ch...\n\n                                     BRANCH MANAGER\n                         To customers approaching the bank \n                         from the rear\n\n                                     JOHN\n                              (thrown)\n                         Right.\n\n                                     BRANCH MANAGER\n                         You can see why it's sensitive?\n\n                                     JOHN\n                         Uh... Yes.\n\n               The manager smiles and taps the desk twice.\n\n                                     BRANCH MANAGER\n                         I'll leave it on your desk.\n\n               John is left alone.\n\n               INT. HALL / LIVING ROOM - DAY\n\n               The front door opens and John walks into his hall. The two \n               rucksacks are still side by side where they were the night \n               before...\n\n               INT. KITCHEN - DAY\n\n               He opens the fridge and pours himself a glass of orange. He \n               stops -- There on the draining board lies the bloody skin of \n               a rabbit. John jumps out of his skin.\n\n               Next to the rabbit skin is a hand-drawn map. A dotted line \n               winds around the map and ends with an X in a small wood.\n\n               He looks at the rabbit skin, with its eyeless sockets.\n\n               EXT. FOREST - DAY\n\n               John follows a path through a big silent wood, the low sun \n               flaring and catching his white work shirt.\n\n               P.O.V. OF JOHN\n\n               through binoculars, a long way off and squinting into the \n               sun.\n\n               Nadia lowers the binoculars and looks past us.\n\n                                                                    CUT TO:\n\n               John spots some figures lying on the grass in the distance. \n               He heads towards them, and watches them for a moment from \n               thirty yards away.\n\n               Alexei, Yuri and Nadia sit in a small clearing. A blanket, \n               cushions, bread and vodka are scattered around. Yuri is \n               strumming a guitar. Alexei and Nadia are laughing and \n               chatting. He removes a small twig from her hair and flattens \n               it under his big hand. John watches the gesture. It's so \n               intimate they could be lovers.\n\n                                     YURI\n                              (calls)\n                         John. We can see you hiding.\n\n               John steps out of his hiding place and approaches the group. \n               Alexei has Nadia falling about laughing about something. He \n               smiles at her then nods to John.\n\n               Pieces of cooked rabbit lie in tin foil. Alexei feeds a piece \n               to Nadia with a big hunting knife. Nadia smiles at John, and \n               starts knitting.\n\n                                     YURI\n                         How is bank?\n\n                                     JOHN\n                         Fine. I thought you were leaving \n                         today.\n\n                                     YURI\n                         To be indoors on such a day. It's \n                         crime.\n\n               Nadia stops knitting and takes her shirt off and stretches \n               back to sunbathe in her black bra. Alexei takes the knife he \n               has just finished cleaning and holds the cold wide blade \n               flat above Nadia's bare stomach. Just before pressing it \n               down he looks across at John. Nadia yelps and sits up. They \n               laugh, and Yuri joins in. John laughs uneasily.\n\n               Alexei notices marks on Nadia's midriff. He asks her about \n               them in Russian.\n\n               John goes white, unable to understand Nadia's explanation. \n               He has no idea what she told him.\n\n               EXT. LAKE IN FOREST - DAY\n\n               At sunset, the four run towards a lake in their underwear. \n               They jump and dive in, and begin splashing each other.\n\n               John duck-dives under the water and swims through the sunlit \n               streaked green water. We see him under the water, swimming \n               towards us, caught by the sun's rays.\n\n               John surfaces, and wipes the water from his eyes. He spots \n               Alexei and Nadia playing in the water. Alexei grabs her and \n               throws her in the air and she comes down with a splash.\n\n               John treads water nearby. He watches them both hold their \n               noses and disappear under the surface.\n\n               They've both vanished. John ducks under the water.\n\n               John's underwater P.O.V.: It's too murky to see anything.\n\n               The two surface, breathing hard, laughing. John watches them.\n\n               Alexei holds Nadia tight and looks like he might even kiss \n               her. But instead he ducks her and holds her under the water.\n\n               John treads water nearby. She's been under a long time.\n\n                                     JOHN\n                         Hey.\n\n               John begins to swim toward Alexei. Just as he gets near, \n               Alexei lets Nadia surface, coughing and spluttering -- she \n               shouts at Alexei in Russian, angry.\n\n               Alexei makes for her again but she pushes him away, twice, \n               almost slapping him. She is very uncomfortable. She swims \n               away.\n\n               Yuri admonishes his friend in Russian. Alexei stares at John, \n               then swims off powerfully back towards the shore.\n\n                                     YURI\n                         He's just having fun. He's maybe too \n                         strong you know...\n\n               John watches Nadia walk out of the lake towards her clothes.\n\n               INT. BEDROOM - NIGHT\n\n               John walks into his bedroom. Nadia is on the bed with a \n               dictionary. She puts it down. She speaks very slowly.\n\n                                     NADIA\n                         They go. John. They go.\n\n                                     JOHN\n                         What's wrong?\n\n                                     NADIA\n                         They go.\n\n                                     JOHN\n                         Of course. They go. Yes. Yes.\n\n                                     NADIA\n                         They go.\n\n               INT. JOHN'S SITTING ROOM - NIGHT\n\n               John stands at the end of the two sleeping bags.\n\n                                     YURI\n                         I understand. I'm so sorry\n\n                                     JOHN\n                         You can stay tonight.\n\n                                     YURI\n                         I have brought you trouble. Maybe I \n                         should have come alone.\n\n                                     JOHN\n                         Good night.\n\n               Alexei stares at John as he backs out of the room.\n\n               INT. JOHN'S BEDROOM - NIGHT\n\n               John closes his bedroom door and slips back into bed. Nadia \n               is already asleep. John lies back in the moonlight, and stares \n               at the ceiling.\n\n               EXT. GARDEN - DAY\n\n               A light summer rain. Drips fall from rose petals.\n\n               INT. JOHN'S BEDROOM - DAY\n\n               John opens his eyes. He rolls over towards Nadia, but she's \n               already up and about.\n\n               Alone in his bedroom, John holds the now-finished jumper up \n               to himself. He tries it on. It's a good four sizes too big, \n               the arms are too long and it hangs down to mid-thigh. He \n               looks at himself in the mirror and smiles.\n\n                                                                    CUT TO:\n\n               INT. STAIRS / HALL / KITCHEN - DAY\n\n               He pads downstairs in his pants, picks up his mail from the \n               doormat and peers into the living room. The sleeping bags \n               and guitar cases have gone. About to peruse his mail, his \n               eye is caught by something else.\n\n               There is a small wild deer standing in the living room. \n               Looking at him. John stares back at it transfixed, when he \n               hears a scream. The deer starts and bolts out of the patio \n               doors. John is thrown. It was a woman's scream. He goes back \n               out and looks down the hall.\n\n               Twenty feet away, down the hall, is Yuri, sitting on the \n               kitchen floor, his back to the cooker. He's crying.\n\n                                     YURI\n                         John. You must call the Police.\n\n               Suddenly Alexei steps between them in the doorway. As he \n               moves out of view, we see he is holding his hunting knife. \n               John hears Nadia cry out, from inside the kitchen. He drops \n               his mail and rushes forward.\n\n               INT. KITCHEN - DAY\n\n               Nadia is tied to a chair. Alexei pulls a gag tight around \n               her mouth and holds the knife to her throat.\n\n                                     JOHN\n                         What are you doing?\n\n               Alexei shouts at Yuri in Russian.\n\n                                     YURI\n                         John, I'm sorry. It's my fault.\n\n               Alexei shouts again. Nadia is frozen with terror.\n\n                                     JOHN\n                         What's he doing? What the fuck are \n                         you doing? Leave her alone.\n\n               Alexei addresses John.\n\n                                     YURI\n                         He says sit down. Or he'll cut her.\n\n               Alexei and Yuri shout at each other. Nadia begins crying.\n\n                                     YURI\n                         Sit down please.\n\n               John sits across the table from Nadia.\n\n                                     JOHN\n                         Tell him to stop and let her go, and \n                         we'll talk.\n\n               The kettle boils. Alexei takes the kettle and holds it over \n               Nadia's head.\n\n               John springs up.\n\n                                     JOHN\n                         Put the fucking kettle down.\n\n                                     YURI\n                         John.\n\n                                     JOHN\n                         Put the fucking kettle down. Tell, \n                         Yuri, tell him put it down or I'm \n                         going to make him.\n\n               Yuri translates -- Alexei replies.\n\n                                     YURI\n                         He says you scare him so much he \n                         must go to the toilet in his trousers. \n                         John, he is a soldier. A trained \n                         killer. We must do what he says.\n\n                                     JOHN\n                         What? What does he want?\n\n               Alexei speaks.\n\n                                     JOHN\n                         What did he say? Tell me!\n\n                                     YURI\n                         He says you are very sad ridiculous \n                         man. I don't agree of course. And \n                         that you must pay someone to have \n                         sex like a prostitute. Nadia is a \n                         prostitute. I'm sorry.\n\n                                     JOHN\n                         What does he want. The Russian \n                         shithead. What do you want ?\n\n                                     YURI\n                         He wants money.\n\n                                     JOHN\n                         Tell him to put the kettle down and \n                         I'll give him money.\n\n               Yuri translates this for Alexei. Alexei has a reply.\n\n                                     YURI\n                         He wants a lot of money.\n\n                                     JOHN\n                         I'll give him money. Tell him to put \n                         the...\n\n                                     YURI\n                         He wants the money from your bank.\n\n                                     JOHN\n                         I'll fuckin' give it to him! We'll \n                         go down there.\n\n                                     YURI\n                         You don't understand. He wants all \n                         the money that is in your bank.\n\n                                     JOHN\n                         I've got eight hundred pounds. Oh \n                         Jesus.\n\n               The penny drops.\n\n                                     JOHN\n                         Oh Jesus.\n\n                                     YURI\n                         He is sure you can do this. Of course \n                         you can not.\n\n                                     JOHN\n                         Oh Jesus. Of course I can't.\n\n               Alexei doesn't need the translation he tilts the kettle, and \n               a small amount of boiling water trickles onto Nadia's hair. \n               She screams through the gag.\n\n               John tries to reach across to her but Alexei draws the knife \n               and holds it to his face.\n\n                                     JOHN\n                         Just leave her alone.\n\n                                     YURI\n                         I'm so sorry.\n\n                                     JOHN\n                         Leave her alone.\n\n               CLOSE UP On Nadia's terrified eyes, imploring John to help \n               her.\n\n               INT. / EXT. JOHN'S CAR - DAY\n\n               John drives grim-faced through the morning rain. Yuri is \n               next to him staring ahead at the road. Alexei is in the back \n               with Nadia who is still bound and gagged. He's holding his \n               knife to her ribs.\n\n               INT. MULTI-STOREY CAR PARK - DAY\n\n               The car parks on the top floor. John turns off the engine. \n               He looks at Nadia in his rear view mirror but she seems in \n               shock.\n\n               INT. HIGH STREET - DAY\n\n               John strides towards us down St. Albans High Street, carrying \n               the two guitar cases, his raincoat flapping. His eyes look \n               glazed, the busy street sounds around him muffled.\n\n               INT. NATIONAL WESTMINSTER BANK - DAY\n\n               The doors slide apart and John enters his branch. The place \n               is full of customers. He cheeks himself through the security \n               door and into the back.\n\n               INT. OPEN-PLAN OFFICE - DAY\n\n               John walks through the open plan office. His Branch Manager \n               is there with another bank official, and Clare.\n\n                                     BRANCH MANAGER\n                         Ah John. This is Robert Moseley, \n                         Head of South East New Business. \n                         Robert, this is John Buckingham.\n\n                                     MOSELEY\n                         Hello John.\n\n                                     JOHN\n                         Hello.\n\n                                     BRANCH MANAGER\n                         I thought you could give us the tour \n                         this morning. Sort of be our Indian \n                         Guide.\n\n                                     JOHN\n                         Right.\n\n                                     MOSELEY\n                              (i.e. the guitars)\n                         Do you play?\n\n                                     JOHN\n                         Yes. I do.\n\n                                     CLARE\n                         That's John. He's always surprising \n                         you with hidden talents.\n\n                                     MOSELEY\n                         I used to be in a band. Keyboards. \n                         Sort of like very loud, uh -- very \n                         loud Marillion.\n\n               They laugh. Pause.\n\n                                     CLARE\n                              (to John)\n                         Well, Maestro, give us a tune.\n\n               They laugh. Pause.\n\n                                     JOHN\n                         I'll give you a tune later.\n\n               The Branch Manager takes John to one side and stage-whispers.\n\n                                     BRANCH MANAGER\n                         Take the ball and run with it John.\n\n               INT. BANK CORRIDOR - DAY\n\n               John leads the team down the corridor past the training room \n               where his colleagues are busy with Trust and Letting Go.\n\n                                     JOHN\n                         This is uh... This is the uh...\n\n               A colleague passes carrying a file.\n\n                                     PASSING COLLEAGUE\n                         Morning John. Give us a tune.\n\n                                     JOHN\n                         I'll give you a tune later.\n\n               INT. TRAINING ROOM - DAY\n\n               They enter the training room.\n\n                                     JOHN\n                         This is where we're doing Trust and \n                         uh... Trust and Letting Go.\n\n                                     MOSELEY\n                         We're not doing this till the fourth \n                         quarter -- Has it, uh -- any results, \n                         has it been been beneficial?\n\n                                     JOHN\n                         Yes.\n\n                                     CLARE\n                         It's weird at first. Sort of exciting \n                         and frightening at the same time. \n                         Wouldn't you say John?\n\n                                     JOHN\n                         Yes.\n\n                                     BRANCH MANAGER\n                         We're starting to see results. This \n                         is Karen, who's uh... taking uh... \n                         it.\n\n               They say hello to each other and MOSELEY asks her a couple \n               of questions.\n\n                                     JOHN\n                         Excuse me.\n\n               INT. CORRIDOR - DAY\n\n               John nips out and fetches his guitar cases. He rounds the \n               corner, down a couple of steps. He checks himself into the \n               Safe Area. A Colleague passes him.\n\n                                     COLLEAGUE\n                         Morning John. Hey, Moseley's here.\n\n                                     JOHN\n                         I'll give you a tune later.\n\n               INT. SAFE ROOM DOOR - DAY\n\n               John punches in the security code. He opens the safe door \n               and goes inside, closing it behind him. We see his stricken \n               face peering through the toughened glass.\n\n               INT. TRAINING ROOM - DAY\n\n               Robert Moseley falls backwards into the arms of an employee.\n\n                                     MOSELEY\n                         It's weird isn't it.\n\n               A little bored perhaps, Moseley gazes out through the open \n               door. He sees...\n\n               INT. CORRIDOR - DAY\n\n               John bowling out of the safe-room backwards heaving two guitar \n               cases. One bursts open spilling bundles of fifties onto the \n               floor.\n\n               INT. TRAINING ROOM - DAY\n\n               Moseley, the Branch Manager, Clare, and five Trust and Letting \n               Go catchers all watch...\n\n               INT. CORRIDOR - DAY\n\n               John scoops up the money, refasten the case and stand to see \n               them all watching him, as the five Trust and Letting Go \n               fallers crash to the ground in unison.\n\n               EXT. SIDE STREET - DAY\n\n               John hauls ass towards us straight down the middle of the \n               road, a guitar case in either hand, footsteps clapping loudly \n               on the wet cobbles. Alarms sound, dogs bark.\n\n               EXT. STREET CORNER - DAY\n\n               He skis around a corner, and sprints up this other street. \n               We are close by his head, as he sprints one hundred metres.\n\n               EXT. CAR PARK ROOF - DAY\n\n               Running flat out across the car park. Yuri throws open the \n               car door and John hurls the guitar cases inside. He dives \n               in, turns the key in the ignition. The Rover coughs and \n               wheezes. He tries again. It spits and misfires. The third \n               time it catches and lives. John grinds the gears and lurches \n               off.\n\n               INT. MULTI STOREY CAR PARK - DAY\n\n               The Rover hurtles down the ramps.\n\n               EXT. STREET - DAY\n\n               It careens down a side-street.\n\n               INT. / EXT. MOVING ROVER - DAY\n\n               Alexei opens one of the cases and looks inside. He takes a \n               deep breath and swears in Russian.\n\n               He shows what is in the case to Nadia. Her eyes widen.\n\n               Alexei gently lowers the gag and kisses her on the mouth. \n               She returns the kiss hungrily.\n\n               John spots them in the mirror and nearly crashes the car.\n\n               He looks desperately across at Yuri. Yuri is now pointing \n               the big knife at John's ribs. The Russian shrugs almost \n               apologetically.\n\n               In the back seat Nadia has freed herself and is beginning to \n               pull at Alexei's clothes. They begin making out passionately.\n\n               John's eyes slowly lose focus. He turns grey, then white. He \n               drives and we watch the life seep out of him.\n\n               EXT. DUAL CARRIAGEWAY - NIGHT\n\n               Cars tear through the night along the carriage way, past a \n               Happy Eater. We pan round, across the motorway to a single \n               storey run-down Motel.\n\n               INT. MOTEL CHALET 17 - NIGHT\n\n               A crusty motel chalet. Yuri and Alexei are sitting on a double \n               bed counting the money. The T.V. is on in the corner with \n               the sound turned down and there are empty miniatures from \n               the mini-bar scattered around.\n\n               Nadia appears from the kitchenette area. They all seem more \n               relaxed, more themselves, as if what we've seen before was \n               an act. For the first time in the film their conversation \n               appears as English subtitles.\n\n                                     NADIA\n                         So?\n\n               Alexei says \"SSShhh\" He is counting in his head. He stops.\n\n                                     ALEXEI\n                              (to Yuri)\n                         You first.\n\n                                     YURI\n                         Fifty thousand. Almost exactly.\n\n                                     NADIA\n                         Sixty four thousand, eight hundred.\n\n                                     ALEXEI\n                         There's over eighty thousand here.\n\n               They look at each other, absorbing the moment.\n\n                                     YURI\n                         Sweet Jesus...\n\n               He lies back on the bed and chuckles.\n\n                                     ALEXEI\n                         Put it in the cases. Split it up. \n                         And don't forget you owe me £150.\n\n                                     YURI\n                         What for?\n\n                                     ALEXEI\n                         You know what for.\n\n                                     YURI\n                         No I don't.\n\n                                     ALEXEI\n                         I got you those trousers from Paul \n                         Smith.\n\n                                     YURI\n                         I've been buying you stuff all week. \n                         I've been buying him stuff all week.\n\n                                     ALEXEI\n                         Such as?\n\n               Nadia is smiling at them as they squabble.\n\n                                     YURI\n                         When we went to the Hard Rock Cafe. \n                         Who paid? When we went to see 'Cats'. \n                         Who paid?\n\n                                     ALEXEI\n                         Those aren't presents. That's normal \n                         friendship stuff\n\n                                     YURI\n                         I paid for those guitar cases.\n\n                                     NADIA\n                         What was 'Cats' like?\n\n                                     YURI\n                         It was alright.\n\n                                     ALEXEI\n                         Yeah it was okay.\n\n                                     YURI\n                         Yeah. It was quite good actually. \n                         Some bits I really liked.\n\n                                     ALEXEI\n                         The sets were good.\n\n                                     YURI\n                         The sets were excellent. Everything \n                         was big, you know, all the rubbish, \n                         coke cans, sweet wrappers, dustbins, \n                         so when you were watching it you \n                         felt cat size. It was really clever.\n\n               Yuri goes into the bathroom, leaving Nadia and Alexei alone \n               on the bed.\n\n               Alexei runs his hand across Nadia's cheek.\n\n                                     ALEXEI\n                              (softly)\n                         So. How many times did you have to \n                         fuck him?\n\n               INT. BATHROOM - NIGHT\n\n               Yuri in the bathroom, he undoes his flies pees. At the other \n               end of the bathroom, tied to the bidet, gagged, is John.\n\n                                     YURI\n                         How you doing?\n\n               John refuses to meet his eye. Yuri flushes and wipes his \n               hands.\n\n                                     YURI\n                         I'll show you something. It should \n                         make all this easier I think.\n\n               From his back pocket, Yuri takes out an old envelope. He \n               opens it and removes a dozen or so Polaroids.\n\n               John looks down at the first Polaroid. Nadia, Alexei and a \n               man John doesn't recognise at a birthday party. There is a \n               cake with candles and everyone is smiling. The next picture \n               is the same. And the next.\n\n               Sometimes Germany, sometimes France, but otherwise the \n               pictures are the same, each 'fiancee' beaming with his arm \n               round Nadia, Alexei looking on.\n\n               John studies the faces of his fellow dupes and at last comes \n               to his own picture. Despite himself tears come to his eyes.\n\n                                     YURI\n                         Not all these bastards were like \n                         you, believe me. You should not too \n                         feel bad.\n\n               Yuri takes John's left hand and pulls off Nadia's ring. He \n               puts it in his pocket.\n\n               INT. MOTEL BEDROOM - NIGHT\n\n               Alexei smokes on the bed. Nadia is lying the other way. She \n               holds her hand out for his cigarette and he passes it. They \n               have the relaxed air of longtime lovers.\n\n               Subtitles again.\n\n                                     NADIA\n                         It's enough isn't it?\n\n                                     ALEXEI\n                         What do you mean?\n\n                                     NADIA\n                         You know what I mean babe, It's \n                         enough. We can stop.\n\n                                     ALEXEI\n                         Do you want to stop?\n\n                                     NADIA\n                         Yes.\n\n                                     ALEXEI\n                         We'll stop then.\n\n               They kiss. He takes her hand, and notices the tie marks on \n               her wrists.\n\n                                     ALEXEI\n                         What's this?\n\n                                     NADIA\n                         It's nothing. I burnt myself.\n\n                                     ALEXEI\n                         That's not a burn.\n\n                                     NADIA\n                         It is. I did it cooking.\n\n               They sit there looking at each other.\n\n                                     ALEXEI\n                         On both wrists?\n\n               Nadia looks back at him. The seconds pass.\n\n                                     NADIA\n                         What? I did it cooking.\n\n               Alexei studies her face. She pulls a face. He keeps staring.\n\n                                     NADIA\n                         What?\n\n               They sit there in silence. Alexei is so big, and she is so \n               small.\n\n                                     NADIA\n                         Listen, I made you something.\n\n               Nadia leans over the bed, and searches in her bag. Alexei \n               watches her closely. She comes back up with the jumper she \n               has knitted.\n\n                                     NADIA\n                         Put it on.\n\n               He looks at the jumper, then back at her.\n\n                                     NADIA\n                         It's taken me weeks. I want to see \n                         you in it.\n\n               She starts pulling at his shirt. Eventually he pulls the \n               jumper on. It fits perfectly.\n\n                                     NADIA\n                         Do you like it?\n\n                                     ALEXEI\n                         Yeah.\n\n               He is still staring at her.\n\n                                     NADIA\n                         Say thank you.\n\n                                     ALEXEI\n                         Thank you.\n\n               She takes his hands. He is still looking at her. He strokes \n               his hair. He places his big hand around her throat and holds \n               it there, holding her at arms length. She doesn't react, but \n               just looks levelly back at him. They sit like this for about \n               ten seconds, looking at each other.\n\n                                     NADIA\n                         We're going to have a baby.\n\n               Alexei seems not to relax. He keeps his hand there.\n\n                                     ALEXEI\n                         What?\n\n                                     NADIA\n                         You heard what I said. I'm pregnant. \n                         I've been throwing up for weeks.\n\n               Alexei removes his hand. Now he seems shocked. He lights a \n               cigarette.\n\n                                     NADIA\n                         We're having a baby.\n\n               Pause.\n\n                                     ALEXEI\n                         A baby? What are we supposed to do \n                         with a baby?\n\n                                     NADIA\n                         Name it.\n\n               She comes to him and holds him. He is still absorbing the \n               news.\n\n               We see Alexei's face over her shoulder, behind her back, \n               unreadable. Behind his back she rubs her wrists.\n\n               INT. BATHROOM - NIGHT\n\n               Some hours later, it's dark outside. John still tied to the \n               bidet. The door opens a crack and somebody slips inside. We \n               hear the toilet seat go down. As his eyes adjust he can dimly \n               see Nadia sitting on the toilet. She doesn't look at him. As \n               she finishes she finally turns and holds his eye. She stands \n               and slips out the door, leaving him alone.\n\n               EXT. DUAL CARRIAGEWAY - NIGHT\n\n               Cars crawl by on the road outside, their tail-lights \n               stretching over the hill.\n\n               The shot processes and fades into dawn and light.\n\n               The early morning commuters now use the carriageway.\n\n               INT. BATHROOM - DAY\n\n               Bright sunlight pours through a high window. John is still \n               on the toilet. He begins to try to struggle free.\n\n               After a great deal of fierce deadpan shimmying and pulling, \n               he succeeds in loosening his bindings. Freeing an arm, he \n               yanks the duct tape from his mouth and sits there panting.\n\n               The first thing he does is take a pee, then he drinks handfuls \n               of water. He catches his reflection but can't look at himself.\n\n               INT. MAIN ROOM - DAY\n\n               John collapses in an armchair, rubbing his eyes. He looks \n               shattered.\n\n               The Russians have gone.\n\n               INT. MOTEL BATHROOM - DAY\n\n               John in the shower, just standing there, letting the water \n               hit him.\n\n               INT. MOTEL MAIN SUITE - DAY\n\n               John dries himself in silence. He pulls on his trousers, \n               sits down to do his socks. One sock on, he walks to the \n               smaller bedroom. He opens the door and peers inside.\n\n               INT. SMALLER MOTEL BEDROOM - DAY\n\n               Tied to the radiator, gagged with duct tape, is Nadia.\n\n               John looks down at her. She looks away as her eyes fill with \n               tears.\n\n               He sits on the bed facing her. They stay like that for a \n               long moment before he reaches over and starts untying her \n               knots. He peels the tape off her mouth. Suddenly he slaps \n               her across the face.\n\n               Her head hits the radiator. Nadia gasps hard from the shock \n               of the blow. Without warning she slaps his face, equally \n               hard.\n\n               This starts a long silent fight; kicking, hitting, biting, a \n               real struggle.\n\n               Its intensity is almost sexual, but has the edge of real \n               violence. They end up on opposite sides of the room, both \n               panting, hurt and beaten.\n\n                                     NADIA\n                              (in English)\n                         Great. You've split my fuckin, lip.\n\n               John lies there on the floor, panting, and he hears the \n               English words.\n\n               Exhausted, John stands, wipes his mouth, and rushes her anew. \n               Nadia dodges out the way and cuffs him painfully on the ear. \n               The whole fight starts again and ends only when neither has \n               the strength to go on. Nadia staggers into the bathroom where \n               she shuts the door and begins to sob uncontrollably. John \n               lies on the bed listening to her cry.\n\n               EXT. DUAL CARRIAGEWAY - DAY\n\n               The mid morning traffic flows by on the dual carriageway.\n\n               INT. HAPPY EATER - DAY\n\n               Nadia and John sit in silence in the half empty diner. Nadia \n               has a cut lip and a graze on her chin. John has a Thousand \n               Yard Stare and a lesion over his left cheekbone.\n\n               The Waitress comes over.\n\n                                     WAITRESS\n                         Good morning. What can I get you?\n\n                                     NADIA\n                         I'll have an espresso, with a small \n                         pastry, a croissant or something.\n\n                                     WAITRESS\n                         We only do a croissant with the \n                         Continental breakfast.\n\n                                     NADIA\n                         Just get me a coffee.\n\n                                     WAITRESS\n                         One coffee. And for you Sir ?\n\n               John doesn't answer.\n\n                                     NADIA\n                         He'll have a coffee.\n\n               The waitress leaves them. Nadia lights a cigarette and they \n               sit in tense silence, the pain of betrayal, and recent \n               violence, thick in the air.\n\n                                     JOHN\n                         You can't smoke in here.\n\n               Nadia ignores him. John bellows\n\n                                     JOHN\n                         YOU CAN'T SMOKE IN HERE!\n\n               The diner falls silent, people stare. She takes a last drag \n               and crushes the butt on the floor. A waitress comes over and \n               puts down two coffees.\n\n                                     NADIA\n                         I don't expect you to understand.\n\n               It seems as if John has no intention of replying. He sips \n               his coffee, and puts it down. He begins speaking very calmly.\n\n                                     JOHN\n                         Oh, I don't know. In my job as Deputy \n                         Assistant of New Business at the \n                         bank would have to listen to the \n                         problems of a great many individuals. \n                         This took a lot of understanding and \n                         sympathy, to try to work out solutions \n                         to their problems. But, you see, I'm \n                         not in that line of work anymore. \n                         Nowadays I'm a bank robber.\n\n                                     NADIA\n                         You don't understand anything.\n\n                                     JOHN\n                         I think that about covers it. I think \n                         I have grasped the part about you \n                         being dumped though. That's got to \n                         hurt, I imagine. That's got to smart \n                         a bit. I mean strictly in my \n                         observer's capacity it seemed you \n                         two were getting on Pretty Fucking \n                         Famously.\n\n               He sips his coffee.\n\n                                     JOHN\n                         Unless. Unless this is part of the \n                         routine. You get tied up, stick \n                         around, distract me, they both bust \n                         in and Steal My Cup Of Coffee.\n\n                                     NADIA\n                         It's makes it easier. Okay.\n\n                                     JOHN\n                         I don't want to know.\n\n                                     NADIA\n                         It makes it faster. If I don't speak \n                         to the men, they fall faster. It's \n                         pretty obvious why.\n\n                                     JOHN\n                         That's a relief. It's nice to know \n                         I'm a regular guy.\n\n               Pause.\n\n                                     NADIA\n                         So what are you going to do?\n\n                                     JOHN\n                         I'm going to drink my coffee. Then, \n                         we're going to the police station. \n                         Where there will be lawyers, loss of \n                         job, house, humiliation, gutter press, \n                         and probably prison.\n\n                                     NADIA\n                         They don't blame you. When a bank \n                         employee does this they understand. \n                         You get your life back. Anyway I bet \n                         you hated that bank.\n\n                                     JOHN\n                         Even so I always felt the decision \n                         to burst in and rob it very much \n                         remained with me.\n\n                                     NADIA\n                         Why else would you send off for me? \n                         If you just wanted sex just go to a \n                         prostitute.\n\n                                     JOHN\n                         Well as it turns out I did.\n\n               She slaps his face. He slaps hers back. The waitress comes \n               over.\n\n                                     WAITRESS\n                         More coffee?\n\n                                     JOHN\n                         Yes please.\n\n                                     NADIA\n                         No.\n\n               She pours for John.\n\n                                     JOHN\n                         Splendid. Thank you.\n\n                                     WAITRESS\n                         Pleasure.\n\n               She smiles and leaves them. John watches her walk away.\n\n                                     NADIA\n                         John, I need your help.\n\n               This really tickles John. He has to put his coffee down.\n\n                                     JOHN\n                         You must think... I'm the biggest \n                         pillock... In the world.\n\n                                     NADIA\n                         No I don't.\n\n                                     JOHN\n                         In the world.\n\n                                     NADIA\n                         I know you just want to punish me --\n\n                                     JOHN\n                         I do. I want to very badly.\n\n                                     NADIA\n                         So you're just going to be vindictive\n\n                                     JOHN\n                         In every sense. If at all possible.\n\n                                     NADIA\n                         You can't hurt me more than I'm hurt \n                         already.\n\n                                     JOHN\n                         Well, Nadia, It it's all the same to \n                         you, I'd like to give it a bash.\n\n               Pause.\n\n                                     NADIA\n                         My name isn't Nadia.\n\n               John stares back at her.\n\n               EXT. HAPPY EATER CAR PARK - DAY\n\n               John drags her by the arm across the car-park towards the \n               Rover.\n\n               EXT. OUTSIDE POLICE STATION\n\n               John drags her out of the Rover. She wrestles her arm free \n               and walks up the steps on her own, with some dignity. John \n               follows her.\n\n               INT. POLICE STATION DUTY DESK - DAY\n\n               They sit side by side in the waiting room, not talking. Nadia \n               looks resigned to her fate. John is tight-jawed, unyielding.\n\n               They wait as the the Duty Sergeant deals with a woman who's \n               lost her hat.\n\n                                     NADIA\n                              (quietly, to John)\n                         Where's the restroom?\n\n                                     JOHN\n                         What?\n\n                                     NADIA\n                         I'm going to be sick. Where's the...\n\n                                     JOHN\n                         What? No you're not..\n\n                                     NADIA\n                         I'm going... I am... I'm going to be \n                         sick.\n\n                                     JOHN\n                              (overlapping)\n                         No you're not. How... Nice one. How \n                         dumb do you think I am ?\n\n               Nadia stands and addresses the Duty Sergeant.\n\n                                     NADIA\n                         Where's the restroom?\n\n                                     SERGEANT\n                         The what, love?\n\n                                     NADIA\n                         The toilet. Where's...\n\n                                     SERGEANT\n                         Down there on the left.\n\n               She heads off. John springs up. He seizes her arm as casually \n               as possible.\n\n               INT. POLICE STATION CORRIDOR - DAY\n\n               John frog marches Nadia down the corridor to the Ladies. She \n               wrestles her arm free again and disappears inside.\n\n               John lurks outside. He seems certain she's got one leg out \n               the window RIGHT NOW.\n\n               He can't bear it any longer. He looks both ways and nips \n               inside.\n\n               INT. LADIES - DAY\n\n               Standing in the Ladies, John hears Nadia in a cubicle, \n               throwing up. He hears the toilet flush.\n\n               Nadia comes out. He looks at her.\n\n                                     JOHN\n                         You're pregnant.\n\n               Nadia looks at the floor.\n\n               INT. POLICE CORRIDOR - DAY\n\n               John walks out of the toilet and stands against the wall of \n               the corridor. He looks both ways. After a few seconds Nadia \n               appears in the corridor. They stand there. John isn't looking \n               at her.\n\n               A policeman appears from round the corner, and walks towards \n               them. He stops, and addresses John.\n\n                                     POLICEMAN\n                         Can I help you?\n\n               John looks at the Policeman, then at Nadia. The seconds pass.\n\n                                     POLICEMAN\n                         Sir? Can I help you?\n\n               John is still looking at Nadia -- He closes his eyes.\n\n                                     JOHN\n                         No.\n\n               EXT. OUTSIDE POLICE STATION - DAY\n\n               John walks back to the Rover, Nadia behind. They reach the \n               car. Nadia looks at John over the roof of the car.\n\n                                     NADIA\n                         What are you doing?\n\n               John looks sick. He speaks very quietly.\n\n                                     JOHN\n                         Get in the car.\n\n               He gets inside. Nadia is left standing there. She gets in \n               too.\n\n               INT. / EXT. JOHN'S CAR - DAY\n\n               John driving with Nadia in the passenger seat. She is looking \n               across at him.\n\n               He is taking no notice.\n\n                                     NADIA\n                         Plenty of women have babies in prison.\n\n               John ignores her.\n\n                                     NADIA\n                              (tersely)\n                         You don't have to do this. I can \n                         look after myself.\n\n                                     JOHN\n                              (flatly)\n                         Have you got your passport?\n\n                                     NADIA\n                         What?\n\n                                     JOHN\n                         Shut up. Have you got your passport?\n\n                                     NADIA\n                         Yes.\n\n               They drive along.\n\n                                     JOHN\n                         We've got to get off this motor-way.\n\n               EXT. MOTORWAY JUNCTION - DAY\n\n               From above we watch the car turn off the motorway, around a \n               roundabout and into a country B road.\n\n               INT. CAR - DAY\n\n               John is turning the pages in his Road Atlas. He is trying to \n               drive and map read at the same time. Nadia is looking out of \n               the window. Soon a big tear rolls down her cheek. She starts \n               to cry.\n\n               John glances up from his map but ignores it. But she keeps \n               crying. He tosses the map in the back, pulls the car to the \n               side of the road and switches off the engine. As Nadia cries, \n               John gazes impassively out of the window. This goes on for \n               almost a minute, until Nadia pulls herself together, when \n               without looking across John restarts the engine and pulls \n               away.\n\n               EXT. COUNTRY ROAD - DAY\n\n               John's car pulling off a B road, into a slip road into a \n               garage.\n\n               EXT. PETROL STATION - DAY\n\n               Stern-faced, John fills the car up with petrol. He eyes the \n               Closed-Circuit.\n\n                                     JOHN\n                         Give me some money.\n\n                                     NADIA\n                         I don't have any money.\n\n               John stops squeezing petrol.\n\n                                     JOHN\n                         What?\n\n                                     NADIA\n                         I said I don't have any.\n\n               John stares at Nadia. He eyes the CCTV.\n\n                                     JOHN\n                         Give me your sunglasses.\n\n               Nadia passes them and John puts them on,trying to look casual. \n               He gives the pump a couple more squirts, hangs it up, \n               nonchalantly sidles up to his door.\n\n               In one move he opens it, dives in, turns the key in the \n               ignition. The Rover coughs. He tries it again. It howls, \n               barks and sneezes. The attendant comes out onto the forecourt \n               and starts approaching the yellow Rover.\n\n               Miraculously it roars throatily to life, he floors it and \n               the Rover tears away from the station and off down the road\n\n               INT. MOVING CAR - DAY\n\n               We see John at the wheel of his Rover, sunglasses on, wind \n               in his hair, fleeing from the scene of the crime. Nadia \n               watches him in the late sunshine, but John is too busy making \n               a getaway to notice.\n\n               EXT. COUNTRY LANE - DAY\n\n               John's car shimmering as it comes over the brow of a remote \n               country lane, surrounded by fields and rolling hills.\n\n               INT. / EXT. CAR (MOVING) - DAY\n\n               Nadia puts a cigarette in her mouth and pops the dashboard \n               lighter. John takes the cigarette and throws it out the \n               window, followed by the lighter. Nadia just gazes out of the \n               window.\n\n                                     JOHN\n                         So, uh, Alexei, which I know isn't \n                         his name...\n\n                                     NADIA\n                         I don't want to talk about him.\n\n                                     JOHN\n                         Fine.\n\n                                     NADIA\n                         It's none of your business.\n\n                                     JOHN\n                         Fine. Absolutely. Must be \n                         disappointing though. Must come as a \n                         hell of a shock.\n\n               Nadia ignores him.\n\n                                     JOHN\n                         So uh...\n\n                                     NADIA\n                         Look, if you want to know is he better \n                         in bed than you then yes he is.\n\n                                     JOHN\n                         Oh Jesus.\n\n                                     NADIA\n                         If what you want to know is does he \n                         have a bigger cock than you, then \n                         yes he does.\n\n                                     JOHN\n                              (overlapping -- bigger)\n                         Of course. Of course. Of course he \n                         does. Of course. Thank you. Thanks.\n\n                                     NADIA\n                         But, you know, so what?\n\n               They drive.\n\n                                     JOHN\n                         It's his baby I take it.\n\n               She doesn't answer.\n\n                                     JOHN\n                         Not the kids type then is he? Not \n                         that broody. You must be pretty \n                         miffed.\n\n                                     NADIA\n                         He will come back.\n\n                                     JOHN\n                         Excuse me?\n\n                                     NADIA\n                         He left me my passport and ticket. \n                         It's pretty clear he wants to see me \n                         again.\n\n                                     JOHN\n                         Yeah. I tend to tie up and abandon \n                         women I really want to see again \n                         too.\n\n                                     NADIA\n                         No. But you tend to tie them up.\n\n               John freezes. He looks across. Nadia gives nothing back.\n\n                                     JOHN\n                         Fuck off.\n\n               Nadia is just looking at him.\n\n                                     JOHN\n                         Fuck off. You started it.\n\n               She is just looking at him.\n\n                                     JOHN\n                         I don't want to talk about it.\n\n                                     NADIA\n                         Why not?\n\n                                     JOHN\n                         Shut up. I'm not listening.\n\n                                     NADIA\n                         You don't want to talk about it.\n\n                                     JOHN\n                         No.\n\n                                     NADIA\n                         Okay we won't talk about it.\n\n               Nadia looks out the window.\n\n                                     NADIA\n                         We'll pretend it never happened.\n\n                                     JOHN\n                         So. What's it like having to fuck \n                         men you hate?\n\n                                     NADIA\n                         I don't hate you.\n\n                                     JOHN\n                         Okay. Let's... Okay. Okay. You have \n                         had sex with people you don't like \n                         haven't you? For money. To make money.\n\n                                     NADIA\n                         And? What are you saying?\n\n                                     JOHN\n                         And. It's wrong.\n\n                                     NADIA\n                         And who says what is wrong.\n\n                                     JOHN\n                         And that would be Morals. That would \n                         be one's own moral sense of decency.\n\n                                     NADIA\n                         What's a moral orgasm John? Tell me \n                         how it feels exactly.\n\n                                     JOHN\n                         So. What then? You just detach sex \n                         from everything..\n\n                                     NADIA\n                         Whereas \"Wet 'n' Wild\" is an emotional \n                         journey. \"Tied and Tethered\". It's \n                         pretty moving huh? Like Anna Karenina.\n\n                                     JOHN\n                         Listen. I didn't go rooting around \n                         in your private stuff.\n\n               John remembers he did. Nadia looks across knowingly.\n\n                                     NADIA\n                         Funny. Usually it's the first thing \n                         they do.\n\n               Pause.\n\n                                     JOHN\n                         So what? Do you just switch off in \n                         your head or do you imagine you're \n                         with him, or what?\n\n                                     NADIA\n                         Sometimes.\n\n                                     JOHN\n                         Sometimes which?\n\n                                     NADIA\n                         Sometimes neither.\n\n                                     JOHN\n                         Some... What does that mean?\n\n                                     NADIA\n                         There's nothing wrong in liking sex, \n                         John.\n\n                                     JOHN\n                         I don't like sex. I don't think I'll \n                         be having sex ever again.\n\n                                     NADIA\n                         Why?\n\n                                     JOHN\n                         Well, it's just that the thought \n                         trying to charm up an erection in \n                         front of a woman, or alone for that \n                         matter, makes me want to die.\n\n                                     NADIA\n                         So now you hate all women?\n\n                                     JOHN\n                         I think it's my safest bet, don't \n                         you?\n\n                                     NADIA\n                         Oh. I think you will recover okay. I \n                         think you got what you paid for.\n\n               John looks across.\n\n                                     JOHN\n                         What?\n\n                                     NADIA\n                         You...\n\n                                     JOHN\n                         I got what I paid for.\n\n                                     NADIA\n                         You didn't mind too much.\n\n               Pause.\n\n                                     JOHN\n                              (quietly)\n                         It wasn't what I wanted.\n\n                                     NADIA\n                         So what did you want? I think we \n                         understand each other, no?\n\n                                     JOHN\n                              (quietly)\n                         You don't understand me.\n\n                                     NADIA\n                         You don't understand you either.\n\n               John turns to her.\n\n                                     NADIA\n                         It's no big thing. You are the same \n                         as most men. You are a man so you \n                         are a savage. Not a monster, but \n                         half animal. You put on a tie and \n                         you go to the bank, but really you \n                         are a beast. But also you are from \n                         woman so you have a soul. Half beast, \n                         half soul. But you hide your beast \n                         in the bottom of the wardrobe. It's \n                         not so healthy. It's fucked you up, \n                         no?\n\n               John stops the car.\n\n                                     JOHN\n                         Get out.\n\n               She sits there.\n\n                                     NADIA\n                         Excuse me?\n\n                                     JOHN\n                         Get out\n\n                                     NADIA\n                         You are throwing me out.\n\n                                     JOHN\n                         Get out.\n\n               She collects her bag from the back seat, her cigarettes, \n               gathers up her belongings, clicks open the door and gets \n               out, leaving the shot. John sits there staring ahead. We \n               hear her voice offscreen.\n\n                                     NADIA (O.S.)\n                         You prefer your women mute.\n\n               John turns the key in the ignition. The engine bellows and \n               screams. Silence.\n\n               He tries again. The engine shrieks and wails like a soul in \n               torment. A terrible, mournful grinding noise. Silence.\n\n                                     NADIA (O.S.)\n                         Car trouble?\n\n               John tries to start it. It lets out a whimper, a crying, a \n               few juddering moving sobs, and dies.\n\n               John sits in his dead car. He shakes his head. He rubs his \n               face. He sits there.\n\n               EXT. ROADSIDE VERGE - DUSK\n\n               The two of them on a verge ten feet apart. John stares into \n               the distance.\n\n               Nadia studies the map.\n\n                                     NADIA\n                         It's another twenty miles. It's going \n                         dark.\n\n               She gets her holdall from inside the car and stuffs the map \n               inside.\n\n                                     NADIA\n                         What now?\n\n               Nadia scans the horizon with her binoculars. John watches \n               her.\n\n                                     JOHN\n                         Jesus. You weren't even on the plane.\n\n               Nadia lowers her binoculars and looks at John.\n\n               FLASHBACK - INT. AIRPORT - DAY\n\n               John watches the passengers stream out of the arrivals gate. \n               A woman is greeted and spun around.\n\n               Across the airport, Nadia lowers her binoculars. We pull \n               back to see she is standing next to Alexei.\n\n               They say goodbye in Russian. Even though we don't see \n               subtitles, it's a telling exchange. She kisses him, and he \n               watches her leave him and walk across the floor.\n\n               Alexei watches Nadia approach John, and see him shake her \n               hand.\n\n               They walk away together.\n\n               FLASHBACK - EXT. JOHN'S STREET - NIGHT\n\n               Alexei, dressed in a suit, stands outside John's house, \n               looking up. Nadia is in the window, her lipstick smeared. \n               They gaze at each other.\n\n               EXT. DIFFERENT FOREST - NIGHT\n\n               In a clearing, John watches Nadia carry a pile of sticks to \n               a fire she is building. She lights it with her gun cigarette \n               lighter, and teases the flames to life.\n\n               EXT. FOREST - NIGHT\n\n               John and Nadia sit by the fire. She sits wrapped up to her \n               neck in a blanket.\n\n                                     NADIA\n                         You know, in Russia, there's no work \n                         for women. It's a different world.\n\n                                     JOHN\n                              (interrupting on \n                              \"different\")\n                         You don't have to say anything\n\n                                     NADIA\n                              (overlapping on \"say\")\n                         What? I... I wasn't saying...\n\n                                     JOHN\n                              (overlapping on \n                              \"saying\")\n                         Please, there's no... Oh.\n\n                                     NADIA\n                         I wasn't saying anything.\n\n                                     JOHN\n                         Then okay.\n                              (pause)\n                         So how old were you when you met \n                         him?\n\n               Pause.\n\n                                     NADIA\n                         Fifteen. You don't know him. He was \n                         very kind and strong.\n\n                                     JOHN\n                         Yeah. He's a smashing bloke.\n\n                                     NADIA\n                         The rest of the world, John, it's \n                         not all like St. Albans.\n\n                                     JOHN\n                         Thank Christ for that.\n\n                                     NADIA\n                         You are pretty naive if you think it \n                         is.\n\n                                     JOHN\n                         I'm pretty naive? Look at you. You \n                         have to do all this, and what have \n                         you got to show for it? Nothing.\n\n                                     NADIA\n                         I don't have nothing.\n\n                                     JOHN\n                         Well what have you got?\n\n               Pause.\n\n                                     NADIA\n                         I have my baby.\n\n               They sit there in the lapping firelight.\n\n                                     JOHN\n                         Do you know if it's a boy or a girl?\n\n                                     NADIA\n                         No.\n\n                                     JOHN\n                         Have you had any before?\n\n                                     NADIA\n                         No.\n\n                                     JOHN\n                         Are you scared?\n\n                                     NADIA\n                         Not really. Maybe a little.\n\n               A fox cries out in the night.\n\n                                     NADIA\n                         Listen. I think it's a fox.\n\n               She listens. It cries out again. She gets out her binoculars.\n\n                                     NADIA\n                         It sounds close.\n\n               She looks through them and searches the brush. John watches \n               Nadia with her binoculars. He looks suddenly very sad.\n\n                                     NADIA\n                         I can't see anything. It's too dark.\n\n               She puts them back in her bag. John watches her. He sees her \n               wrist again. She lights a cigarette, and blows the smoke \n               into the air.\n\n                                     NADIA\n                         What happened between you and the \n                         blonde?\n\n                                     JOHN\n                         What?\n\n                                     NADIA\n                         The thin... the girl with small eyes. \n                         The one in your cupboard.\n\n                                     JOHN\n                         It's none of your business. She didn't \n                         have small eyes.\n\n                                     NADIA\n                         Did she leave you? Come on. It's \n                         nothing to be ashamed of. Who did \n                         she leave you for? Your best friend? \n                         Her boss? A woman? Did she leave you \n                         for a woman, John?\n\n                                     JOHN\n                         She's dead.\n\n               Pause.\n\n                                     NADIA\n                         I'm sorry. I didn't mean to hurt \n                         you. I'm sorry. That's awful. Forgive \n                         me.\n\n               Pause.\n\n                                     NADIA\n                         I'm sorry.\n\n                                     JOHN\n                         I don't know why I said that. She's \n                         not dead at all.\n\n               Nadia looks at John.\n\n                                     NADIA\n                         What?\n\n                                     JOHN\n                         I don't know why I said it. I'm sorry.\n\n                                     NADIA\n                         She's alive?\n\n               Nadia starts to laugh. Long and loud. We have never seen her \n               laugh before.\n\n                                     NADIA\n                         She's alive!! She is not dead?\n\n                                     JOHN\n                         Laugh it up.\n\n               She starts to cough. She gets on her hands and knees and \n               coughs like fury.\n\n                                     JOHN\n                         You should stop smoking. You're \n                         pregnant. You smoke like a fucking \n                         lab dog.\n\n                                     NADIA\n                         I'm trying to quit.\n\n                                     JOHN\n                         I've got news for you. It's not \n                         working.\n\n                                     NADIA\n                         I smoke more these days. I smoke \n                         more when I'm unhappy.\n\n                                     JOHN\n                         Nobody's that unhappy.\n\n                                     NADIA\n                         Maybe I want to die. Don't you want \n                         me to die?\n\n                                     JOHN\n                         I don't want anyone to die.\n\n                                     NADIA\n                         Except for Small Eyes.\n\n                                     JOHN\n                         Except for Small Eyes.\n\n               She laughs again.\n\n                                     NADIA\n                         So why did it end?\n\n               John thinks. It looks as if he's going to tell the whole \n               story. In the end he shrugs.\n\n                                     JOHN\n                         I don't know.\n\n                                     NADIA\n                         What was her name?\n\n                                     JOHN\n                         What's your name?\n\n               The fox cries out again.\n\n                                     NADIA\n                         Listen. It's definitely a fox. Now \n                         I'm scared.\n\n               They listen to the fox crying in the night.\n\n                                     NADIA\n                         You know you can come under the \n                         blanket.\n\n                                     JOHN\n                         It's alright.\n\n               The scene from bird's eye view. John lies back and stares at \n               the stars. Nadia curls up on the other side of the fire, and \n               hugs herself.\n\n               We push down closer and closer until we are on John's face. \n               The theme returns.\n\n               The cricket boys from John's Close stand in a line in the \n               middle of the street, bathed in flashing blue light. We pan \n               round and end on John's house.\n\n               It is surrounded with Police.\n\n               Police cars, Police Vans, plastic police tape \"POLICE LINE. \n               DO NOT CROSS.\"\n\n               John's neighbours press against the tape as officers come \n               and go.\n\n               Inside the house is full of police, ransacking his possessions \n               and dusting fingerprints. A policeman is standing reading \n               The English-Russian Dictionary.\n\n               We push on upstairs and along the landing to the spare room.\n\n               An officer dumps a pile of porno magazines and videos on the \n               bed. He then spots the belts tied to the bedstead and points \n               them out to a detective. They exchange a knowing grin. A \n               photographer steps up and snaps the paraphernalia in a \n               blinding flash.\n\n               The birthday cake is there, half eaten. A Policewoman puts \n               it in a baggy.\n\n               We pan across the bed, across the magazines and underwear in \n               plastic bags, down below the bed, where we find the photograph \n               of Nadia with the binoculars.\n\n               The young girl smiles hopefully out at us from the past.\n\n               Early dawn. A woodpigeon coos. John wakes up next to the \n               dead fire. Nadia is gone.\n\n               EXT. FOREST SLOPE / STREAM - DAY\n\n               John slides down a rocky slope. He scans the forest, but \n               there's no-one around. He hurries through high bracken then \n               stops suddenly by a large oak.\n\n               EXT. STREAM - DAY\n\n               In a pool in a stream below, Nadia is washing herself. She \n               has her back to us.\n\n               John watches her for a moment, before his eyes avert, and \n               his head bows.\n\n               EXT. FIELD - DAY\n\n               A shimmering sun. A giant combine harvester cuts a wide swathe \n               through a field of high corn. As it passes we find John and \n               Nadia coming towards us through the heat haze.\n\n               They aren't speaking and both look tired. As they pass we \n               crane up out of the corn to catch an enormous 757 Jumbo Jet \n               just above us, coming into land. We pan round to see, half a \n               mile away, the massive airport beyond.\n\n               They walk towards it, two tiny figures.\n\n                                                                    CUT TO:\n\n               Aeroflot 1311. Boarding Gate 12.\n\n               INT. AIRPORT - NIGHT\n\n               An attendant pushes a train of trolleys past. Businessmen \n               talk into mobile phones.\n\n                                     NADIA\n                         I've got an hour. Can I buy you a \n                         coffee?\n\n                                     JOHN\n                         No. I think I better just go.\n\n                                     NADIA\n                         Okay. Thank you.\n\n                                     JOHN\n                         Whatever.\n\n               Nadia hesitates. There's just a touch of regret in this \n               goodbye.\n\n                                     NADIA\n                         John. These are for you.\n\n               She hands him the binoculars case.\n\n                                     JOHN\n                         Yeah. No thanks.\n\n                                     NADIA\n                         Please. Why not?\n\n                                     JOHN\n                         Because it was a lie.\n\n               She smiles.\n\n                                     NADIA\n                         No it wasn't.\n\n               John shrugs. He takes them.\n\n                                     NADIA\n                         Goodbye.\n\n               John nods and turns. Nadia watches him walk away.\n\n               INT. / EXT. AIRPORT EXIT - NIGHT\n\n               On the other side of the airport, John stands in front of \n               the exit to the taxi ranks. He's got nowhere to go. Passengers \n               swirl around him.\n\n               He looks at the binocular in his hands. He removes the \n               binoculars and looks at them. Suddenly he stops. In the case \n               is a folded note marked John. John holds it in his hands -- \n               Slowly, deliberately, he screws it up, and drops it in the \n               case like a bin.\n\n               P.O.V. OF JOHN\n\n               Through the binoculars. Passengers criss-cross, but we find \n               Nadia sitting alone, waiting for her call.\n\n               John lowers the binoculars and gazes across the airport. He \n               raises them for one last look.\n\n               Nadia, glimpsed through the crowd. We spy someone standing \n               about twenty feet behind her. It is Alexei.\n\n               We watch Alexei approach her. She looks up and is completely \n               thrown.\n\n               Yuri stands about ten feet away, in shades.\n\n               John lowers the binoculars, horrified. He looks again.\n\n               Nadia pulls her arm away. Alexei crouches down in front of \n               her and puts a hand on her knee, coaxing her.\n\n               Alexei takes her by the arm and leads her away.\n\n               EXT. AIRPORT - NIGHT\n\n               John hurries out of the exit to catch the trio leaving a \n               different exit fifty yards away, where they get into a taxi.\n\n               EXT. AIRPORT - NIGHT\n\n               John runs across a car park and over a low fence.\n\n               EXT. SLIP ROAD TO AIRPORT - NIGHT\n\n               He chases down a slip road, as the taxi rounds the corner \n               behind us. He takes cover behind a van as they drive past, \n               and away.\n\n               EXT. GRASS VERGE - NIGHT\n\n               John runs across a grass verge and another car park. He sees \n               the taxi rounding the corner and head down the road in front \n               of him.\n\n               John runs as fast as he can up this road, but the taxi is \n               getting away. Eventually he gives up, and he drives away.\n\n               EXT. ROUNDABOUT - NIGHT\n\n               At the roundabout it turns round and starts coming back up \n               the road. John hides behind a car, and watches the taxi pull \n               up outside a small hotel about fifty yards away. He watches \n               the trio head into the hotel.\n\n               EXT. HOTEL PERIMETER - NIGHT\n\n               John skirts around the edge of the hotel. He peers in through \n               one of the windows. It's the foyer. He heads around the back.\n\n               EXT. BACK OF HOTEL - NIGHT\n\n               At the back of the hotel he looks through another couple of \n               windows. Suddenly he drops like he's been shot, and sits on \n               the grass.\n\n               Warily he looks again.\n\n               EXT. / INT. THE VIEW THROUGH THE WINDOW\n\n               Alexei stands smoking in the middle of the room. Nadia is \n               sitting in a chair crying.\n\n               Alexei kneels again and appeals to her. Nadia is resisting \n               and yells back, but something Alexei says seems to melt her \n               resolve.\n\n               He holds her face, and kisses it. She turns her face. He \n               tries again, and this time she accepts the kiss. Slowly she \n               kisses him back.\n\n               EXT. OUTSIDE ALEXEI'S SUITE - NIGHT\n\n               John stares through the window at the scene.\n\n               INT. INSIDE ALEXEI'S SUITE - NIGHT\n\n               In the room, Yuri pops his head round the door and says \n               something to Alexei.\n\n               Alexei says he's coming. He kisses Nadia again and leaves.\n\n               Nadia is alone. She looks very sad and confused. She moves \n               towards the window and stares out into the blackness.\n\n               EXT. OUTSIDE ALEXEI'S SUITE - NIGHT\n\n               John's face at the window. Almost cheek to cheek with Nadia.\n\n               INT. INSIDE ALEXEI'S SUITE - NIGHT\n\n               Inside the room, looking out. It is pitch black.\n\n               EXT. OUTSIDE ALEXEI'S SUITE - NIGHT\n\n               John watches Nadia walk over to the dresser and search the \n               drawers. She goes over to the bed and looks under the pillow. \n               There she finds what she is looking for. Alexei's hunting \n               knife.\n\n               She hears Alexei coming and stands hard against the window. \n               the huge knife behind her back.\n\n               EXT. OUTSIDE ALEXEI'S SUITE - NIGHT\n\n               John outside. He is four inches from the knife.\n\n                                     JOHN\n                         Oh Jesus.\n\n               John ducks down, panting, swallowing hard. At once he springs \n               up and skirts the building again. He finds a window to the \n               next suite.\n\n               He tries to force it open. Suddenly Yuri's face appears in \n               the window, cupped by his hands peering out into the \n               blackness. John drops down holds his breath.\n\n               John scrambles back to the previous window. With real effort \n               he presses it open. He pulls himself up and drops inside.\n\n               INT. ALEXEI'S BEDROOM - NIGHT\n\n               Nadia still stands by the window, one hand behind her back. \n               Alexei sits on the bed. The scene is subtitled.\n\n                                     ALEXEI\n                         I love you. I don't need to tell you \n                         that.\n\n               Nadia looks at the floor.\n\n                                     ALEXEI\n                         I wouldn't leave my child would I? \n                         You know that. I was confused. That's \n                         all.\n\n               INT. ALEXEI'S BATHROOM / HALLWAY - NIGHT\n\n               John opens the bathroom door a crack. He is at the opposite \n               end of a corridor from the bedroom. He can hear Alexei's \n               voice.\n\n               Breathing hard, he tiptoes out and stands in the corridor, \n               his back pressed hard against the wall. He takes one step \n               down the hall. The floor creaks loudly.\n\n               INT. ALEXEI'S SUITE - NIGHT\n\n                                     ALEXEI\n                         It wasn't easy for me. You know what \n                         I'm like. I needed to know what I \n                         wanted. Now I know. It's simple. I'm \n                         happy.\n\n               INT. ALEXEI'S SUITE HALLWAY - NIGHT\n\n               John takes another step down the hallway. There, by the door \n               are the two guitar cases full of money. Next to them is \n               Nadia's bag. Crouching, John opens the bag and searches \n               inside. He finds what he is looking for; the Silver Cigarette \n               Lighter-Pistol.\n\n               We hear the Russian lovers' voices next door. John is \n               absolutely terrified, breathing hard and shaking, holding \n               the little gun.\n\n               INT. ALEXEI'S SUITE - NIGHT\n\n                                     ALEXEI\n                         You still love me? Eh? Of course you \n                         do. Come here. Yuri won't be here \n                         for a while. Come on babe.\n\n               He takes his shirt off -- Nadia glances up -- With horror, \n               she sees John in the doorway.\n\n               Alexei turns to see John stand by the door, holding a little \n               silver gun.\n\n                                     NADIA\n                         What are you doing here?\n\n               John and Nadia look at each other.\n\n                                     ALEXEI\n                         What the fuck is he doing here?\n\n               He looks at the little gun.\n\n                                     ALEXEI\n                         That's that cigarette lighter I gave \n                         you isn't it?\n\n               Alexei stands. John takes a step back. Alexei walks calmly \n               towards John and throws a punch. It catches John right on \n               the chin and he hits the wall and goes down very fast.\n\n                                     NADIA\n                         Stop.\n\n               Alexei turns round to see Nadia holding the knife. He is \n               dumbstruck.\n\n                                     ALEXEI\n                         What? What are you doing?\n\n                                     NADIA\n                              (to John)\n                         What are you doing here?\n\n               Alexei kicks John in the ribs.\n\n                                     NADIA\n                              (in Russian)\n                         Stop it!\n\n               He looks at Nadia, the girl he came back for, angrily pointing \n               the knife at him. He suddenly looks completely punctured. \n               John has struggled up again and stands behind him. They are \n               both looking at Nadia.\n\n                                     ALEXEI\n                         What. You're what? You're with this \n                         creep now.\n\n                                     NADIA\n                         Leave him!\n\n                                     ALEXEI\n                         You have. You've actually fallen for \n                         this prick.\n\n                                     NADIA\n                         No I haven't.\n\n               Alexei looks dumbstruck. He laughs emptily\n\n                                     ALEXEI\n                         Babe it's me. I won't let you get \n                         away.\n\n               Nadia stares back at him. The seconds pass. She speaks in a \n               whisper.\n\n                                     NADIA\n                         I'll kill you if you try.\n\n               In the impasse, John picks up a lamp and hurls it at Alexei's \n               head. It is going to hit him, but reaches the length of its \n               cord and stops six inches short. In the confusion. Alexei \n               grabs Nadia's wrist and forces her to the ground. He grabs \n               the knife, just as John brains him with one of the guitars. \n               It emits a fruity final chord.\n\n               INT. HOTEL CORRIDOR / ALEXEI'S SUITE - NIGHT\n\n               Whistling, Yuri comes out of his suite, knocks briskly on \n               the door of Alexei's and enters. We walk with him down the \n               hallway into the bedroom to find Alexei, heartbroken, tied \n               and bound to a desk chair.\n\n               Yuri murmurs something in Russian.\n\n                                     SUBTITLE\n                         Fuck a duck.\n\n                                                                    CUT TO:\n\n               INT. ALEXEI'S SUITE - NIGHT\n\n               Nadia stands at the window and stares at her reflection, or \n               past it into the blackness.\n\n                                     NADIA\n                         Get their passports.\n\n               John finishes tying up Yuri, and removes his passport from \n               his jacket. Behind Nadia another plane arcs up into the night \n               sky.\n\n               He takes Alexei's passport from his pocket, but Alexei is \n               only watching Nadia.\n\n                                     ALEXEI\n                         Don't do this.\n\n               She carefully places tape across his mouth.\n\n               Almost as if having second thoughts she bends down to kiss \n               his cheek. The 'kiss' suddenly makes Alexei's eyes widen in \n               pain. As she stands her lips are bloody. She's bitten him on \n               the cheek. A single streak of blood runs from the gash.\n\n                                     NADIA\n                              (to John)\n                         Get your money.\n\n               John collects the cases and they head for the door. Nadia \n               stops to look back at Alexei. A final look.\n\n               EXT. AIRPORT - NIGHT\n\n               The front of the terminal. Taxis pull up and idle at a rank, \n               bringing travelers to their flights. The automatic doors \n               slide back and forth.\n\n               INT. AIRPORT CHECKING IN DESK - NIGHT\n\n                                     ANNOUNCEMENT (V.O.)\n                         Last Call for Aeroflot flight 1311 \n                         to Moscow. Proceed immediately to \n                         Gate 12.\n\n               John carries the guitar cases full of money. Nadia just has \n               her small camouflaged hold all. They walk quickly together \n               in silence and come to a stop at the departure lounge gate \n               12.\n\n                                     JOHN\n                         Are you okay?\n\n               She nods.\n\n                                     JOHN\n                         Okay. Goodbye.\n\n                                     NADIA\n                         Goodbye.\n\n               They shake.\n\n                                     JOHN\n                         What will you do now?\n\n               Nadia shrugs.\n\n                                     NADIA\n                         Something else.\n\n                                     JOHN\n                         Okay. Promise?\n\n               She looks at him.\n\n                                     NADIA\n                         Promise.\n\n               They stand around. She takes the last cigarette from a pack.\n\n                                     JOHN\n                         You can probably buy them on the \n                         flight.\n\n                                     NADIA\n                         I'm quitting. This will be my last \n                         one. So. Goodbye.\n\n                                     JOHN\n                         Goodbye.\n\n                                     NADIA\n                         You didn't deserve me John Buckingham.\n\n                                     JOHN\n                         Whatever.\n\n                                     NADIA\n                         I'm sorry.\n\n                                     JOHN\n                         Please.\n\n               Pause.\n\n                                     NADIA\n                         You prefer your women...\n\n               She seems about to say something more when the tannoy \n               interrupts.\n\n                                     ANNOUNCEMENT (V.O.)\n                         Gate closing for Flight 1311 to \n                         Moscow. Please have your tickets \n                         ready.\n\n               She leans forward and kisses him. As they kiss, John puts a \n               guitar case in her hand. Nadia looks down at the case.\n\n                                     NADIA\n                         It's not mine.\n\n                                     JOHN\n                         It's not mine either.\n\n                                     NADIA\n                         It's what you came back for.\n\n               John frowns and looks a little embarrassed.\n\n               She speaks to him in Russian and we see the subtitles.\n\n                                     NADIA\n                              (in Russian)\n                         You're a big surprise, you know.\n\n               Pause.\n\n                                     JOHN\n                         Yeah, you see when I said I didn't \n                         speak Russian I wasn't actually just \n                         making it up.\n\n               She leans forwards and whispers in his ear. John looks at \n               her. He looks to the four corners of the airport. And back \n               at her.\n\n                                     JOHN\n                         Why?\n\n                                     NADIA\n                         I'm not asking you to marry me.\n\n                                     JOHN\n                         No. What? No. I know.\n\n                                     NADIA\n                         It's more like a date.\n\n                                     JOHN\n                         It's a long way to go for a date.\n\n                                     NADIA\n                         Tell me about it.\n\n               Pause. She speaks softly in Russian. We see the subtitle:\n\n                                     NADIA\n                         All that matters is to try...\n\n               John frowns.\n\n                                     NADIA\n                              (in Russian)\n                         We can only try. Say it.\n\n               John repeats the phrase in Russian.\n\n                                     JOHN\n                         What does it mean?\n\n                                     NADIA\n                         Maybe you will find out.\n\n               Pause. Nadia kneels and opens the guitar case. She stealthily \n               removes about five hundred.\n\n                                     NADIA\n                         Hurry. I'll wait for you here.\n\n                                     JOHN\n                         Right.\n\n               INT. TICKET SALES - NIGHT\n\n               John runs across the airport to the ticket desk. He joins a \n               queue of about three people. He works his way to the front.\n\n                                     JOHN\n                         Is the flight full?\n\n                                     OFFICIAL\n                         I'm sorry Sir. I believe the flight \n                         is closed.\n\n                                     JOHN\n                         Please check. Is it full? Please \n                         could you check.\n\n                                                                   BACK TO:\n\n               INT. AIRPORT - NIGHT\n\n               Nadia stands alone holding her unlit cigarette, thinking. \n               She looks at the two guitar cases at her feet. She looks \n               across at John, anxiously drumming on the ticket sales \n               counter. What is she thinking?\n\n               INT. TICKET SALES - NIGHT\n\n               CLOSE SHOT on the photo of Yuri in his passport.\n\n               The Aeroflot desk official holds the passport and studies at \n               John. With his four day beard there is a resemblance, but \n               it's far from perfect.\n\n                                     OFFICIAL\n                         You have excellent English.\n\n                                     JOHN\n                         Thanks.\n\n                                     OFFICIAL\n                         How do you want to pay?\n\n                                     JOHN\n                         Cash.\n\n               John collects his ticket, turns and heads back to where he \n               left Nadia with the guitar cases. He suddenly stops.\n\n               She's gone.\n\n               He looks all around. People swirl about. She's nowhere to be \n               seen.\n\n               John hangs his head. He turns, and walks away.\n\n               INT. AIRPORT CAFE - NIGHT\n\n               John sits at a cafe table, and watches the people come and \n               go. He looks strangely calm, resigned.\n\n               CLOSE UP: John's fingers uncrumple the note from the \n               binoculars case. He smooths it on the table, then opens it.\n\n               Inside is written a short phrase in Russian:\n\n               Kam Kapsi Schta.\n\n               John looks at the note. He folds it closed and surveys the \n               airport for an exit.\n\n               Through the crowd, fifty feet away, getting a light off two \n               policeman; it's her.\n\n               Nadia blows out smoke, and speaks to the policeman. John \n               watches her. He smiles.\n\n               Suddenly she turns and points straight at John. The Policeman \n               look straight at him. As they head towards him, Nadia picks \n               up the cases and walks away.\n\n               John sits frozen as the Police approach.\n\n                                     POLICE 1\n                         Excuse me Sir...\n\n               He takes John by the arm. John stands.\n\n                                     POLICE 2\n                         Okay. Come with us now.\n\n                                     POLICE 1\n                         He doesn't speak English. He's \n                         epileptic or something.\n\n                                     POLICE 2\n                         Can he walk? Can you walk?\n\n               The Policeman help John to the front of the gate, where he \n               is shown to the front of the queue. The Policeman explains \n               to the airline staff.\n\n               We see that Nadia is one behind in the queue. The Police \n               turn and walk away.\n\n               INT. AIRPORT BOARDING GATE - FLIGHT 1311 TO MOSCOW - DAY\n\n               John pushes his passport and ticket under the perspex window. \n               He glances at Nadia, then looks at the young airport official, \n               the blood beating in his ears.\n\n               For a few interminable seconds the official's eyes burn into \n               John. John turns to Nadia and holds her gaze.\n\n                                     JOHN\n                         Kam. Kapsi. Schta.\n\n               The subtitle appears: You've saved me.\n\n               Nadia looks down at the floor. She smiles.\n\n               CLOSE SHOT: The passport is snapped shut and pushed back \n               through.\n\n               INT. AIRPORT BOARDING CORRIDOR - DAY\n\n               John walks without looking back. He turns to see Nadia is \n               behind him. As they round the corner, she hands him a case.\n\n               They walk side by side without speaking.\n\n               Both look forward, straight-faced, as it both are thinking \n               about what it is that they are actually doing. John looks \n               back once, but he keeps walking. He looks across at Nadia, \n               but she doesn't look back.\n\n               They stop opposite the automatic boarding doors. Nadia turns \n               to John.\n\n                                     NADIA\n                         My name's Sophia.\n\n                                     JOHN\n                         Sophia. Hello Sophia. Mine's still \n                         John.\n\n                                     SOPHIA\n                         Hello John.\n\n               The doors slide open. John and Sophia walk through, and \n               disappear.\n\n               SFX. The roar of Jet engines.\n\n               EXT. AIRPORT RUNWAY - NIGHT\n\n               With a deafening roar, an Aeroflot Boeing 757 lifts slowly \n               from the runway and climbs up into the night sky, where it \n               becomes a distant star.\n\n               EXT. FIELD - DAY\n\n               A distant aeroplane in a cobalt blue sky, through binoculars.\n\n               The young girl from the very first scene lowers the binoculars \n               and lets them hang around her neck. She squints up at the \n               sun.\n\n               A voice calls her.\n\n                                     WOMAN'S VOICE\n                         Nadia!\n\n               The girl looks round.\n\n                                     WOMAN'S VOICE\n                         Nadia!\n\n               She runs past us and we follow to see a couple sitting on \n               the grass having a picnic.\n\n               The girl hurries towards them and we realise the couple are \n               John and Sophia, the girl her child. She sits down with them.\n\n                                         THE END\n\n\n\n\nBirthday Girl\nWriters :   Tom Butterworth  Jez Butterworth\nGenres :   Comedy  Drama  Romance  Crime\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "John Buckingham (Ben Chaplin), a lonely St Albans bank clerk, orders a mail-order bride Nadia (Nicole Kidman) from Russia on the Internet. John is uncomfortable and shy, but Nadia is sexually bold. Though Nadia cannot speak English and John cannot speak Russian, they soon bond. Later on, a man she introduces as her cousin Yuri (Mathieu Kassovitz) and his friend Alexei (Vincent Cassel) turn up to celebrate her birthday. Alexei soon shows that he has a temper. After a violent altercation, Alexei holds Nadia hostage and demands a ransom from John. John has grown to care for Nadia and is forced to steal from the bank where he has worked for ten years. After the ransom is paid, he realises that he has been the victim of an elaborate con. Nadia, Yuri, and Alexei are criminals, and Alexei is actually Nadia's boyfriend.\nJohn learns that the trio have carried out the same scam on men from Switzerland and Germany, among others. They take him prisoner, strip him down to his underpants, and tie him to a toilet in a motel. He eventually manages to free himself and quickly learns that Nadia has been left behind after Alexei discovered she was pregnant. John gets dressed and subsequently gets into a scrap with Nadia, who later reveals that she can indeed speak English and that her name is not Nadia.\nJohn takes Nadia to turn her into the police - hoping to clear his name as a wanted bank robber. Ultimately, however, he sympathises with her and decides against it. He leaves her at the airport, where she is kidnapped by Alexei – who now wants Nadia to have the baby. John rescues her, tying Alexei to a chair. They make common cause against the two Russian men. Nadia informs John that her real name is Sophia. John, disguised as Alexei, leaves for Russia with Sophia."}