{"title": "Blue Velvet", "full_text": "B L U E   V E L V E T\n\n\t\t\t\t   screenplay by\n\t\t\t\t    David Lynch\n\n\n\nFADE IN:\n\nFOLDS OF BLUE VELVET UNDULATE EVER SO SLOWLY.\n\nWITH TITLES\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n1. EXT. BEAUMONTS' FRONT LAWN - DAY\n\nBlue skies. PAN SLOWLY DOWN to clean white picket fence, with beautiful \nred roses in front of it. Birds CHIRP in the distance. A faint sprinkler \nSOUND is heard. Very sweet MUSIC is playing.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n2. EXT. TREE - DAY\n\nA songbird SINGS in the tree.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n3. EXT. CROSSWALK - SHADY STREET - DAY\n\nA very clean uniformed, smiling POLICEMAN with arms outstretched allows \nclean happy SCHOOL CHILDREN to cross the street safely.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n4. EXT. SHADY STREET - DAY\n\nA bright red gorgeous fire engine is moving very slowly down the street.\n\nWe MOVE IN to see the happy face of a FIREMAN.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n5. EXT. FLOWER GARDEN - DAY\n\nYellow tulips sway in a warm afternoon breeze.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n6. EXT. BEAUMONTS' FRONT LAWN - DAY\n\nThe same white picket fence with roses in front of it. \n\nPANNING SLOWLY now away from the roses down to the rich green lawn \nand over to the sprinkler which goes around and around shooting water \ndroplets sparkling in the light. \n\nThis is slightly SLOW MOTION and DREAMY.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n7. EXT. BEAUMONTS' FRONT LAWN - DAY\n\nCLOSER ON WATER DROPLETS. The water droplets are somewhat abstracted \nas they dance in the light.\n\nPAN DOWN now to the green grass, traveling along the grass. \n\nThe MUSIC becomes fainter as we MOVE SUDDENLY under the grass, now as \nif in a dark forest. \n\nSLOWLY MOVING THROUGH. \n\nThe grass is like great timbers.\n\nIt is GETTING DARKER and ominous SOUNDS come up as we discover black \ninsects crawling and scratching in the darkness.\n\nFADE TO:\n\n8. EXT. BEAUMONT'S FRONT LAWN - DAY\n\nMR. BEAUMONT is watering flowers and grass with the hose.\n\nHe is dressed in khaki trousers, canvas shoes, old white shirt, straw \nhat and dark glasses.\n\nCLOSE - MR. BEAUMONT\n\nwatches his watering, then looks up.\n\nThe sky and the neighborhood are reflected in his dark glasses.  He \nmoves his false teeth around a little in his mouth, jutting out his chin \nin the process.  He's thinking about who knows what.\n\nHe looks back down at his lawn.\n\nCLOSEUP - WATER ON GRASS\n\nThe water hits the grass and mats it down.\n\nWIDER - MR. BEAUMONT\n\nmoves the hose over a bush and gets a kink in it.\n\nWater stops coming out of the nozzle and there is a LOUD HISSING NOISE \nof water under pressure.\n\nCLOSEUP - KINK IN HOSE\n\nLoud HISSING NOISE.\n\nMr. Beaumont goes around the bush and is undoing the kink when he is \nsuddenly hit with a tremendous seizure.\n\nCLOSEUP - MR. BEAUMONT\nHe's doubling over and falls to the ground.  He continues to grasp onto \nthe hose.\n\nWater shoots crazily onto the driveway and his car.\n\nMr. Beaumont seems to be in tremendous pain. \n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n9. INT. BEAUMONTS' LIVING ROOM - DAY\n\nMrs. Beaumont is curled up on the couch, smoking a cigarette and watching \nT.V.  It's a daytime soap.\n\nCLOSEUP - MRS. BEAUMONT\n\nTakes a big drag of her cigarette and luxuriously french inhales a huge \nquantity of blue smoke.  She's enjoying her show.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n10. EXT. BEAUMONTS' FRONT LAWN - DAY\n\nCLOSEUP - MR. BEAUMONT\n\nHis teeth are crooked in his mouth now as he tries to scream.\n\nNo sound is coming out.\n\nWATER SOUND is loud.\n\nWIDER - MR. BEAUMONT\n\nWater is still spraying out over the driveway and onto the car and into \nthe yard beyond.\n\nA small boy, GREGG, appears wearing only white underpants and a white \nt-shirt.  He holds a large red popsicle.\n\nGregg waddles around looking at the crazy water show.  He holds his hand \nout to get it wet in the spray.  This makes him screw up his face in a \nlaugh.\n\nHe waddles over and looks at Mr. Beaumont on the ground.\n\nMr. Beaumont seems to be worse now, unconscious, but still gripping the \nhose tightly. His clothes are sopping wet.\n\n11. EXT. GREGG'S HOUSE - DAY\n\nScreen window of Gregg's house. Gregg's mother calls out but remains \nlooking at a bowl she is holding in her hands.\n\n\t\t\t\t\tGREGG'S MOTHER\n\t\t\t\t\t(calling out)\nGregg. Billy's waiting for his teddy.\n\nShe then turns to look out.\n\n\t\t\t\t\tGREGG'S MOTHER\n\t\t\t\t\t (continuing)\nGREGG! Billy's waiting for his teddy, honey.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n12. EXT. BEAUMONTS' FRONT LAWN - DAY\n\nGREGG'S MOTHER P.O.V. THROUGH SCREEN WINDOW\n\nIN THE DISTANCE, she sees Gregg's back, a bush, some legs with wet khaki \ntrousers and water squirting up in the air.\n\n\t\t\t\t     GREGG'S MOTHER (V.O.)\n\t\t\tTOM!!!\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n13. EXT. COLLEGE CAMPUS BUILDING - NIGHT\n\nTRAVELING along sidewalk, bushes, to lighted windows of an auditorium. \nMUSIC is heard.\n\n14. INT. COLLEGE AUDITORIUM - NIGHT\n\nA dance is going on.  Sixties MUSIC plays, performed by a live band on \nstage.  College kids dance.\n\nA COLLEGE BOY enters the auditorium, urgently looking for someone.  He \nquickly approaches a GIRL.\n\n\t\t\t\t\tCOLLEGE BOY\n\t\t\tLouise? Where's Jeffrey? His mother's on\n\t\t\tthe phone - it's an emergency.\n\n\t\t\t\t\t  LOUISE\n\t\t\tHe disappeared to the men's room a little\n\t\t\twhile ago. I'm getting very tired of \n\t\t\twaiting - let's go find him.\n\n15. INT. JANITOR'S QUARTERS - COLLEGE - NIGHT\n\nWe MOVE INTO the face of JEFFREY. He is hiding behind a furnace.  He is \nfascinated by a sight beyond in the darkness of this basement room.\n\nHe sees a male student trying to rape his girlfriend.  She is crying and \ntelling him to stop but the boy keeps forcing her down toward the ground. \nforcing her clothes off her.  Jeffrey at this point hears his name being \ncalled.  Each time he hears his name the caller is closer.  The boy is now\nhurting the girl.  Before Jeffrey leaves the furnace room he yells out:\n\n\t\t\t\t\t JEFFREY\n\t\t\tHey, shit head. Leave her alone. Don't \n\t\t\tforce girls!\n\nThe couple looks up but cannot see Jeffrey.  The boy is scared and releases\nthe girl who promptly pulls farther away, crying.\n\nJeffrey leaves the furnace room.\n\n16. INT. HALLWAY - COLLEGE - NIGHT\n\nLouise and the college student see him and move quickly toward him.\n\n\n\t\t\t\t     COLLEGE BOY\n\t\t\tJeffrey, your mother's on the phone. It's\n\t\t\tan emergency.\n\n\t\t\t\t\t  LOUISE\n\t\t\tThanks for keeping me waiting so long.\n\nAs Jeffrey moves quickly toward the telephone.\n\n\t\t\t\t \t JEFFREY\nI'm sorry, Louise.\n\n17. INT. PHONE/HALLWAY - COLLEGE - NIGHT\n\nThe phone dangles on its cord in the foreground as Jeffrey moves toward \nit in the background.  Louise slowly follows Jeffrey, but stays in back \nof him.  Jeffrey picks up the phone.\n\n\t\t\t\t\t JEFFREY\n\t\t\tHello. Mom? What's wrong with Dad?. \n\t\t\tWhat's happening?. Come home? Sure I will.\n\n18. INT. BEAUMONT'S BEDROOM - NIGHT\n\nMrs. Beaumont sits talking on the phone in a dark quiet bedroom.\n\n\t\t\t\t    MRS. BEAUMONT\n\t\t\tI mean, for good, Jeffrey.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n19. INT. PHONE/HALLWAY - COLLEGE - NIGHT\n\nCLOSEUP - JEFFREY\n\n\t\t\t\t\t JEFFREY\n\t\t\tFor good?. I can't. Mom. Not right in\n\t\t\tthe middle of the term.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n20. INT. BEAUMONT'S BEDROOM - NIGHT\n\n\t\t\t\t    MRS. BEAUMONT\n\t\t\t     (now looks very tired and \n\t\t\t      poor health)\n\t\t\tJeffrey. honey. Your father's condition\n\t\t\tis serious. It's going to cost so much.\n\t\t\tWe just won't have the money to keep you\n\t\t\tin school. I'm telling you this now, so \n\t\t\tthat you can get your things together and \n\t\t\tcheck out of school, honey, or whatever you \n\t\t\thave to do. it'll save you another trip back.\n\t\t\tYou're going to have to work at the store.\n\n\t\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n21. INT. PHONE/HALLWAY - COLLEGE - NIGHT\n\nCLOSEUP - JEFFREY\n\n\t\t\t\t\t JEFFREY\n \t\t\t    \t\t (crying)\nMom.\n\nLouise looks at Jeffrey crying, then turns away.  Jeffrey hangs up the \nphone.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n22. INT. BEAUMONT'S BEDROOM - NIGHT\n\nMrs. Beaumont hangs up her phone. just next to the phone traveling into \na shadow is a winged termite.\n\nFADE TO:\n\n23. INT. GIRLS DORM LOBBY - COLLEGE - NIGHT\n\nJeffrey is waiting in a girls dorm lobby for Louise. \n\nGirls are milling around.  Louise gets off an elevator with some other \ngirls.  She forces a smile at Jeffrey as she comes toward him.\n\n\t\t\t\t\t JEFFREY\n\t\t\tCan't you come to the damn airport?\n\n\t\t\t\t\t  LOUISE\n\t\t\tJeffrey. I can't. I really can't. I\n\t\t\thave to go to that class tonight. I can't\n\t\t\tget out of it. I really can't. I love\n\t\t\tyou, Jeffrey. I'll miss you.\n\n\t\t\t\t\t JEFFREY\n\t\t\tAlright. I'll call you in a couple of days,\n\t\t\tyou know. I'll let you know how things are.\n\n\t\t\t\t\t  LOUISE\n\t\t\tOkay. I'll be here. You better git-going. I\n\t\t\tgotta go too sweetie. I hope your father's \n\t\t\tokay. I love you. I'm sorry, Jeffrey.\n\n\t\t\t\t\t JEFFREY\n\t\t\tI love you too, Louise. Damn it. I'll see you.\n\nThey kiss.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n24. EXT. LANDING STRIP\n\nA PLANE TAKES OFF\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n25. EXT. ANOTHER LANDING STRIP\n\nA PLANE LANDS\n\n\n\n26. EXT. AIRPORT - NIGHT\n\nJeffrey comes walking out of the airport, where his Mother and AUNT \nBARBARA, who is a very absent-minded little woman with very thick glasses, \nare waiting for him.  \n\nThey are parked illegally and another car is honking at them.  Their \ntrunk is open in anticipation of Jeffrey's things.  They are waving and \nyelling at Jeffrey to get his attention.  He finally joins them and kisses \nhis Mother, then his Aunt.\n\n\t\t\t\t\t JEFFREY\n\t\t\tHi Mom. Hi Aunt Barbara.\n\nThey AD LIB hellos.\n\n\t\t\t\t    MRS. BEAUMONT\n\t\t\t\t  (a bit concerned)\n\t\t\tWhere's all your things, Jeffrey?\n\n\t\t\t\t\t JEFFREY\n\t\t\tThis is it.\n\nMrs. Beaumont looks at Jeffrey.\n\n\t\t\t\t\t JEFFREY\n\t\t\tI sent a trunk home yesterday. This is \n\t\t\tall I have.\n\n\t\t\t\t     AUNT BARBARA\n\t\t\tYou look good, Jeffrey. Did you have a nice \n\t\t\tflight?\n\n\t\t\t\t\t JEFFREY\n\t\t\tYeah. How's Dad?\n\n\t\t\t\t    MRS. BEAUMONT\n\t\t\tHe's alright. We'll tell you on the way home.\n\n27. INT. BEAUMONT'S CAR - NIGHT\n\nThey get in the car.  Aunt Barbara is driving.  She is not a good driver \nand makes Jeffrey nervous.  He watches her every move from the back seat.\n\nThey drive on surface streets.  Many gas stations, traffic lights, bars.\n\n\t\t\t\t    MRS. BEAUMONT\n\t\t\tHe had a cerebral hemorrhage and they think\n\t\t\tthere's some sort of clot, or tumor, or \n\t\t\tsomething in there. They're doing all sorts\n\t\t\tof tests. On the surface, he looks pretty\n\t\t\tgood, but there are problems. They think he\n\t\t\tmay have to stay in two weeks now, at least.\n\t\t\tYou can go see him though tomorrow, Jeffrey.\n\n\t\t\t\t     AUNT BARBARA\n\t\t\tThey tore down the A & P, Jeffrey. Did you\n\t\t\tsee that?\n\n\n\t\t\t\t\t JEFFREY\n\t\t\tAunt Barbara that was 5 years ago.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n28. EXT. BEAUMONTS' HOME - NIGHT\n\nThe car pulls into the Beaumonts' driveway. The neighborhood is quiet and\ndark.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n29. INT. BEAUMONTS' LIVING ROOM - NIGHT\n\nJeffrey, Aunt Barbara, and Mrs. Beaumont enter the living room.  Mrs. \nBeaumont turns on a table lamp.  A cold circle of light hits the light \nblue rug.\n\n\t\t\t\t     AUNT BARBARA\n\t\t\tHome again, home again, jiggidy jog.\n\nThey look at Jeffrey.  He looks at them.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n30. INT. JEFFREY'S BEDROOM - NIGHT\n\nJeffrey enters his small attic-type bedroom, turns on the overhead light, \nand sets his suitcase down.  He goes to his desk and leans across it to \nlook outside.\n\nJEFFREY'S P.O.V. - EXT. STREET\n\nThe street is dark, except for a pool of light from a street light.\n\nCLOSEUP - JEFFREY\n\nA breeze of cold powerful string MUSIC blows as we watch Jeffrey stare into\nspace.\n\n31. INT. BEAUMONTS' KITCHEN/HALLWAY - DAY\n\nMrs. Beaumont is calling upstairs to Jeffrey.\n\n\t\t\t\t    MRS. BEAUMONT\n\t\t\tJeffrey, breakfast is ready.\n\n\t\t\t\t    JEFFREY (V.O.)\n\t\t\t\t\t(calling)\n\t\t\tBe right down.\n\nMrs. Beaumont joins Aunt Barbara at the breakfast table in the kitchen.\n\n\t\t\t\t     AUNT BARBARA\n\t\t\tThis is marvelous jam. Are you going this \n\t\t\tmorning?\n\n\t\t\t\t    MRS. BEAUMONT\n\t\t\tI think Jeffrey would like to see his father\n\t\t\talone.\n\n\nJeffrey comes down the stairs.  Everyone says their \"good mornings,\" and \nJeffrey sits down to breakfast.\n\n\t\t\t\t\t JEFFREY\n\t\t\tWhat time are visiting hours?\n\n\t\t\t\t    MRS. BEAUMONT\n\t\t\tI've made arrangements with Dr. Gynde for\n\t\t\t10:30. But Jeffrey, you'll have to walk \n\t\t\tover; I need the car this morning.\n\n\t\t\t\t\t JEFFREY\n\t\t\tWell. Okay.\n\n\t\t\t\t    MRS. BEAUMONT\n\t\t\tJeffrey, when you see your father.\n\n\t\t\t\t\t JEFFREY\n\t\t\tYeah?\n\n\t\t\t\t    MRS. BEAUMONT\n\t\t\tHe doesn't know you're out of school. He\n\t\t\tthinks it's a vacation for you.\n\n\t\t\t\t\t JEFFREY\n\t\t\tWhat?\n\n\t\t\t\t    MRS. BEAUMONT\n\t\t\tIt would be too much for him. So please\n\t\t\tlet him think as he does, that you're \n\t\t\thome just to see him.\n\n\t\t\t\t\t JEFFREY\n\t\t\tThanks a lot, Mom.\n\n\t\t\t\t    MRS. BEAUMONT\n\t\t\t.Jeffrey!. Nobody wanted you to leave \nschool and go to work in the store. maybe\ngoing back to school will be an option one\nday. I hope so.\n\n\t\t\t\t     AUNT BARBARA\n\t\t\tI think it's important not to get depressed.\n\t\t\tDepression is a terrible thing. They say it\n\t\t\tcan bring on illness.\n\n\t\t\t\t\t JEFFREY\n\t\t\t\t\t (angry)\n\t\t\tAunt Barbara. I'll try not to get depressed.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n33. INT. HALLWAY - HOSPITAL - DAY\n\nJeffrey follows a nurse to a hospital room.\n\n\t\t\t\t     NURSE CINDY\n\t\t\tPlease wait outside while Dr. Gynde prepares\n\t\t\thim to see you.\n\n\n\t\t\t\t\t JEFFREY\n\t\t\tPrepares him?\n\nShe peers into the room.  Jeffrey does too.\n\n34. INT. HOSPITAL ROOM - DAY\n\nAll he can see are curtains surrounding a bed and stacks of medical \nmachinery.  Doctor Gynde comes out from behind the curtains and walks to \nJeffrey.\n\n\t\t\t\t\tDR. GYNDE\n\t\t\tHello Jeffrey.\n\n\t\t\t\t\t JEFFREY\n\t\t\tHello, Doctor Gynde. How is he?\n\n\t\t\t\t\tDR. GYNDE\n\t\t\tHe's fighting hard. Jeffrey. it's very\n\t\t\timportant that your father doesn't try\n\t\t\tto move. he's been immobilized. It would\n\t\t\tbe very painful for him. sit close. you do\n\t\t\tthe talking and moving. He knows you're \n\t\t\there. He became very emotional. I don't \n\t\t\tthink he likes the idea of you seeing him\n\t\t\tlike this.\n\nNurse Cindy goes to the bed.  She begins to pull the curtains back \nrevealing Mr. Beaumont.\n\n\t\t\t\t    NURSE CINDY\n\t\t\t\t(smiling a big smile)\n\t\t\tMr. Beaumont! Your son is here to visit you.\n\nThen we see Mr. Beaumont.  He has numerous tubes and needles going into \ndifferent parts of him.  A stainless steel device holds his head perfectly\nstill.  Nurse Cindy picks up a tray and leaves.\n\n\t\t\t\t\t JEFFREY\n\t\t\t    (shocked but concealing it)\n\t\t\tHi Dad.\n\n\t\t\t\t     MR. BEAUMONT\n\t\t\t (speaking as plainly as possible,\n  but sounds like mumbling)\n\t\t\tHey Jeff.\n\nJeffrey goes to him and puts out his hand to shake his father's hand but \nremembers his father cannot move.  Jeffrey pats him on the shoulder.\n\n\t\t\t\t\t JEFFREY\n\t\t\tLooks like they've got you strapped in\n\t\t\tpretty good.\n\n\t\t\t\t     MR. BEAUMONT\n\t\t\t (lips moving but hardly any sound)\n\t\t\tuh uh.\n\n\t\t\t\t\t JEFFREY\n\t\t\tAre you feeling okay?\n\n\t\t\t\t     MR. BEAUMONT\n\t\t\t\t    (more mumbling)\n\t\t\tuh uh.\n\nTears well up in Mr. Beaumont's eyes.  Before Jeffrey can stop him he \nreaches for Jeffrey's hand, then struggling against tremendous pain he \nmanages to form words.\n\n\t\t\t\t     MR. BEAUMONT\n\t\t\t (more plainly but under strain)\n\t\t\tGood to see you, son.\n\n\t\t\t\t\t JEFFREY\n\t\t\t\t (holding back tears)\n\t\t\tIt's good to see you, Dad.\n\nJeffrey squeezes his father's hand.\n\n35. EXT. VACANT FIELD - DAY\n\nJeffrey is walking down a dirt road on his way home.  He kicks up little \nclouds of dust as he walks.  He has some time to think about things. He \nsees a green bottle in the distance. He gathers up a few more rocks and \npitches them one by one at the bottle.  He misses.\n\nHe looks for a few more good rocks to throw and while looking through some\ntall grass and weeds, he sees something strange.\n\nHe looks closer.  It is a HUMAN EAR, covered with crawling ants.\n\nJeffrey immediately stands up and looks around.  All he sees are houses \n- some laundry drying - a very peaceful scene.  No one seems to be around -\nNo one seems to be watching him.\n\nHe looks again at the ear.\n\nWe are so close we can hear ants racing frantically around the ear into it.\nThere is dried blood on part of it.\n\nJeffrey finds a brown paper bad and using a twig, he pushes the ear onto \nit.  Again, he stands up and looks around.\n\nIN THE DISTANCE, a MAN goes into the back door of a house.  Nothing more.\n\nJeffery hurries off, carrying the bag with the ear in it.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n36. EXT. POLICE DEPARTMENT - DAY\n\nJeffrey goes up the front steps...\n\n37. INT. POLICE DEPARTMENT - DAY\n\n... and to the Reception Desk.  A POLICE OFFICER is standing behind the \ncounter.\n\n\t\t\t\t\t JEFFREY\n\t\t\tHello. could you tell me if Detective\n\t\t\tWilliams is still working here?\n\n\t\t\t\t    POLICE OFFICER\n\t\t\tHe's up in Room 221. Right up the stairs.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n38. \tINT. ROOM 221 - POLICE STATION - DAY\n\nJeffrey enters Room 221 and sees the desk marked, \"DETECTIVE J.D. \nWILLIAMS,\" however, the desk is empty.  TWO MEN are talking at the end \nof the room; one of them comes toward Jeffrey.\n\n\t\t\t\t\tJEFFREY\n\t\t\tAre you Detective Williams?\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tYes.\n\n\t\t\t\t\tJEFFREY\n\t\t\tMy name is Jeffrey Beaumont - I live near\n\t\t\tyou. I believe you know my father, Tom\n\t\t\tBeaumont - Beaumont's Hardware Store?\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tSure I do. I understand he's in the\n\t\t\thospital. How is he?\n\n\t\t\t\t\tJEFFREY\n\t\t\tHe's alright, I guess. I hope. They're\n\t\t\tdoing tests, that's why I'm home from \n\t\t\tschool. I was over at the hospital this\n\t\t\tmorning and I was going home and in the\n\t\t\tfield behind our neighborhood. there\n\t\t\tbehind Vista, I found an ear.\n\n\t\t\t\tDETECTIVE WILLIAMS\n\t\t\t\t(matter of factly)\n\t\t\tYou did? A human ear?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah. I've got it here in this bag. I\n\t\t\tthought I should bring it to you.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tYep, that's right. Let's take a look at it.\n\nJeffrey opens the bag and lets Detective Williams look inside.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\t\t\t  (continuing)\n\t\t\tThat sure looks like a human ear, doesn't\n\t\t\tit?. Let's run it down to the Coroner's\n\t\t\tOffice and see what they make of it. Then,\n\t\t\tI want you to show me exactly where you\n\t\t\tfound it.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n39. INT. CORONER'S OFFICE - DAY\n\nJeffrey, Detective Williams, and an OLD CORONER'S OFFICER are looking at \nthe ear, which is sitting in a medical dish on a table.\n\n\t\t\t\t\tCORONER'S OFFICER\n\t\t\tThe tests will take awhile. Meanwhile,\n\t\t\twe'll check the morgue records. I don't\n\t\t\trecall anything coming in minus an ear.\n\nThe Coroner's Officer turns to Jeffrey.\n\n\t\t\t\t\tCORONER'S OFFICER\n\t\t\t\t\t   (continuing)\n\t\t\tNow if you'd found a jaw or let's say, a\n\t\t\theart, or even an arm, we would assume\n\t\t\tthat there was a corpse, however, a finger\n\t\t\tor an ear. the person may very well be \n\t\t\talive somewhere.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWhat can you tell about the person from the\n\t\t\tear?\n\n\t\t\t\t\tCORONER'S OFFICER\n\t\t\tWell. when the tests are done, quite a lot\n\t\t\t. Sex, blood type, whether or not the ear\n\t\t\tcame off a dead person. Right now, I know\n\t\t\twhat you know. It's a real human ear. The\n\t\t\thuman was, or is, Caucasian.\n\t\t\t. also. It looks like the ear was cut off\n\t\t\twith scissors.\n\n40. EXT. VACANT FIELD - DAY\n\nJeffrey is out with Detective Williams and a CREW OF OFFICERS who have \nroped off the area and are doing a grid search.\n\nA POLICE PHOTOGRAPHER is also there taking flash pictures all around the \nfield, especially where Jeffrey has told them he found the ear.\n\nDetective Williams takes Jeffrey aside.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tBy the way, Jeffrey, this story isn't going\n\t\t\tto the press and I'm going to ask you to \n\t\t\tconsider all you've heard strictly \n\t\t\tconfidential. Do not discuss this business\n\t\t\twith anyone, but me, or other police\n\t\t\tpersonnel. Got it?\n\n\t\t\t\t\tJEFFREY\n\t\t\tGot it. Thanks for letting me in on as much\n\t\t\tas you did.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tCome on. I'll drive you home. It's on my way.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n41. INT. BEAUMONTS' KITCHEN - NIGHT\n\nMrs. Beaumont and Aunt Barbara are doing the dishes. The news is on a \nsmall portable television.  There is a broadcast on the mounting crime \nwave.\n\nINSERT T.V. SCREEN\n\nA series of murders are being discussed and a police drawing mug shot is \nshown on the screen of the suspect who is at large.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n42. INT. JEFFREY'S BEDROOM - NIGHT\n\nJeffrey is sitting at his desk daydreaming.  He suddenly picks up the \nphone, hesitates, then dials.\n\n\t\t\t\t\tJEFFREY\n\t\t\tHello?. LOUISE WERTHAM please. Louise?\n\t\t\t. is she there?. Louise?\n\t\t\t\t    (very happy)\n\t\t\tYeah! How are you? He's okay. in the\n\t\t\thospital for tests.\n\t\t\t\t   (very serious)\n\t\t\tI miss you so much.\n\t\t\t\t    (smiling now)\n\t\t\tWhat have you been up to?. Louise, I don't\n\t\t\tknow. I've got to see how my father is\n\t\t\t. It costs a fortune in that hospital.\n\t\t\tWhen did he ask you to that?. Look. I\n\t\t\tcan't stop you. Go ahead. Just go ahead\n\t\t\t. I may never be back, go. ahead. Look\n\t\t\tLouise, stop trying to explain everything.\n\t\t\tJust do it. let's talk again in a couple\n\t\t\tof days or somethin', okay?. Yeah, I still\n\t\t\tlove you. Goodbye Louise. Goodbye.\n\nJeffrey sits alone in his room, thinking things over.\n\n\t\t\t\t\t\t\t\t\tSLOW DISSOLVE TO:\n\n43. INT. CORONER'S OFFICE - NIGHT\n\nCLOSE UP - EAR IN MORTICIAN'S DISH\n\nVERY SLOWLY, we MOVE very close to the ear, gliding slowly around the \ncrevices approaching the dark hole.  A huge, low rushing of air SOUND, \nTHEN DARKNESS.\n\n\t\t\t\t\t\t\t\t\tSLOW DISSOLVE TO:\n\n44. INT. BEAUMONTS' LIVING ROOM - NIGHT\n\nLow light.  Jeffrey enters the room.  Aunt Barbara and Mrs. Beaumont are \nwatching television.  Aunt Barbara is knitting.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI'm going out for awhile.\n\n\t\t\t\t\tMRS. BEAUMONT\n\t\t\t\t   (looks at her watch)\n\t\t\tDo you want the car?\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo, I'm just gonna walk around.\n\n\t\t\t\t\tMRS. BEAUMONT\n\t\t\tAlright.\n\n\t\t\t\t\tAUNT BARBARA\n\t\t\tJeffrey. you're not going down by Lincoln,\n\t\t\tare you?\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t   (yelling back)\n\t\t\tNo. I'm just going to walk around the\n\t\t\tneighborhood. Don't worry.\n\nAunt Barbara and Mrs. Beaumont continue watching the television.\n\nINSERT T.V. SCREEN\n\nOn T.V. we see a man's shoes.  He is sneaking slowly up some stairs.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n45. EXT. NEIGHBORHOOD STREET - NIGHT\n\nJeffrey walks along the dark streets.  The same sombre MUSIC plays low \nand slow.\n\nSome of the houses have a few lights on, some are dark.  Some windows have \na slow uneven blue flashing light, indicating the television is on inside.\n\nJeffrey continues walking through the night.  In the trees, the shadows \ncontinuously re-arrange themselves in mysterious, sometimes frightening \npatterns.\n\n46. EXT. WILLIAMS HOME - NIGHT\n\nJeffrey finally comes to the house he's been looking for.\n\nHe goes up the front walk.  Now, at the last minute, he feels a little \nfoolish and has second thoughts about knocking on the door.\n\nHe looks in a window.  Inside, he sees a nicely-lit living room.  \nHe goes ahead and knocks.  A very pleasant-looking middle class WOMAN \nanswers the door.\n\n\t\t\t\t\tJEFFREY\n\t\t\tHello. uh. my name is Jeffrey\n\t\t\tBeaumont. Is Detective Williams in?\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\tOh, yes, Jeffrey. Come in. He'll be back \nany minute now. You're welcome to wait. \nIs it urgent?\n\n47. INT. WILLIAMS' LIVING ROOM - NIGHT\n\n\n\n\t\t\t\t\tJEFFREY\n\t\t\tI just wanted to ask him a few questions,\n\t\t\tthat's all. Maybe I better go.\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\tReally, he'll be home soon, would you like\n\t\t\ta cup of coffee?\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t   (thinks a bit)\n\t\t\tAlright.\n\n48. INT. WILLIAMS' KITCHEN - NIGHT\n\nShe leads him back to the kitchen where she has him sit at the kitchen \ntable.  She pours him a cup of coffee.\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\tI was sorry to hear about your father. I\n\t\t\tknow your mother from church. It's such a \n\t\t\tshame.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah, I know.\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\tWould you like a piece of cake?\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo. No thank you.\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\tIt's a real good chocolate cake. Duncan\n\t\t\tHines' devil's food. real good.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah. okay.\n\n49. INT. WILLIAMS' LIVING ROOM - NIGHT\n\nOut in the living room, SANDY WILLIAMS and her BOYFRIEND, MIKE SHAW, \ncome up from the basement.  They are both carrying books.\n\nSandy is a very good looking, high school senior and Mike is a big, \nhandsome football player type.\n\n50. INT. WILLIAMS' KITCHEN - NIGHT\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\tSandy?.\n\nSandy and Mike come into the kitchen.  Jeffrey has a big piece of chocolate cake in his mouth.\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\t\t\t (continuing)\n\t\t\tJeffery, this is my daughter, Sandy, and.\n\t\t\ther boyfriend, Mike.\n\nThey all say \"Hi\" to one another.\n\n\t\t\t\t\tSANDY\n\t\t\tMike's gotta go.\n\t\t\t\t  (to Jeffrey)\n\t\t\tNice to meet you.\n\n\t\t\t\t\tMIKE\n\t\t\tYeah, nice meetin' yuh.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah. It was nice meeting you too.\n\nThey leave and go out the front door.\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\t\t\t  (smiles)\n\t\t\tHe comes over to study.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t      (smiles big)\n\t\t\tYeah.\n\nThe front door opens.\n\n\t\t\t\t\tDETECTIVE WILLIAMS (V.O.)\n\t\t\tPam?\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\tIn the kitchen, John!\n\nDetective Williams comes into the kitchen surprised to see Jeffrey.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tOh. Hello, Jeffrey. what's up?\n\nHe kisses his wife.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tCome into the study a minute.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t      (getting up)\n\t\t\tExcuse me, Mrs. Williams.\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\tCertainly.\n\nJeffrey follows Detective Williams into his study.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n51. INT. DETECTIVE WILLIAMS' STUDY - NIGHT\n\nDetective Williams' study is filled with filing cabinets.  The desk has \ntwo phones and is covered with papers and folders and a picture of Mrs. \nWilliams and Sandy.  The police radio is asking for Detective Williams as \nthey enter.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\t\t\t   (to Jeffrey)\n\t\t\tShut the door.\n\nDetective Williams speaks through the radio while Jeffrey shuts the door.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\t\t      (continuing; in radio)\n\t\t\tDetective Williams here. yeah. Tell him\n\t\t\tto go to Sergeant Milton. yeah, copy.\n\t\t\t     (clicks off radio, turns to Jeffrey)\n\t\t\tWell, Jeffrey, you found something which is\n\t\t\tvery interesting to us. Very interesting.\n\t\t\tI know you must be curious to know more.\n\t\t\t     (scratches the middle of his back)\n\t\t\tBut. I'm afraid I'm going to have to ask\n\t\t\tyou not only not to tell anyone about your\n\t\t\tfind, but also not to ask more about the \n\t\t\tcase. One day. when it's all sewed up, I'll\n\t\t\tlet you know all the details. Right now, \n\t\t\tthough. I can't.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI understand. I'm just real curious like\n\t\t\tyou said.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tI was the same way when I was you age. I\n\t\t\tguess that's what got me into this business.\n\n\t\t\t\t\tJEFFREY\n\t\t\tIt must be great.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tAnd it's horrible too.\n\t\t\t\t   (a cold look comes over\n \t\t\t\t    Detective Williams)\n\t\t\tI'm sorry Jeffrey. That's the way it has to\n\t\t\tbe. Anyway. I'm sure you do understand.\n\nJeffrey studies Detective Williams' face as they walk back to the living \nroom.\n\n52. INT. WILLIAMS' LIVING ROOM - NIGHT\n\n\t\t\t\t\tJEFFREY\n \t\t\t       (calling into the kitchen)\n\t\t\tMrs. Williams? Thanks for the cake.\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\t    (coming out from the kitchen)\n\t\t\tOh, you're welcome. Nice to finally meet\n\t\t\tyou, Jeffrey.\n\n\t\t\t\t\tJEFFREY\n\t\t\tSay \"goodnight\" to Sandy.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tWe will. Good night.\n\nJeffrey leaves and they shut the door behind him.\n\n\n\n53. EXT. WILLIAMS HOME - NIGHT\n\nAs Jeffrey leaves the light of the front yard and enters onto the dark \nsidewalk, he hears Sandy call out behind him.\n\n\t\t\t\t\tSANDY\n\t\t\tAre you the one that found the ear.\n\nJeffrey stops and turns around.  Sandy comes up to him.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah, how did you know?\n\n\t\t\t\t\tSANDY\n\t\t\t\t     (coyly)\n\t\t\tI just know, that's all. I remember you\n\t\t\tfrom Central.\n\n54. EXT. NEIGHBORHOOD STREET - NIGHT\n\nThey slowly walk down the street together.\n\n\t\t\t\t\tJEFFREY\n\t\t\tOh yeah?\n\n\t\t\t\t\tSANDY\n\t\t\tYou were pretty popular. Didn't you run\n\t\t\tfor some office?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah I did. treasurer. Shouldn't you be\n\t\t\tstudying or something.\n\n\t\t\t\t\tSANDY\n\t\t\tAm I bothering you?\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo. You're not bothering me. You a senior?\n\n\t\t\t\t\tSANDY\n\t\t\tYes.\n\n\t\t\t\t\tJEFFREY\n\t\t\tHow is Central these days?\n\n\t\t\t\t\tSANDY\n\t\t\tTerrible. boring.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWhat else is new?. right?\n\n\t\t\t\t\tSANDY\n\t\t\tYeah. What are you doing now?\n\n\t\t\t\t\tJEFFREY\n\t\t\tI'm home from school. My father's in the\n\t\t\thospital.\n\n\t\t\t\t\tSANDY\n\t\t\tThat's too bad.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWhat do you know about the ear?. anything?\n\n\t\t\t\t\tSANDY\n\t\t\tDidn't my father tell you not to talk about\n\t\t\tit?\n\t\t\t\t  (she smiles)\n\n\t\t\t\t\tJEFFREY\n\t\t\tCome on. you brought it up. Do you know \n\t\t\tanything?\n\n\t\t\t\t\tSANDY\n\t\t\tI don't really know much but bits and pieces\n\t\t\t. I hear things. My room is right above my\n\t\t\tfather's office. The ear. there's no corpse\n\t\t\tin the morgue missing an ear, and it did come\n\t\t\toff a living person. That's direct from the\n\t\t\tCoroner's Office. The person is unknown. \n\t\t\tThere are a couple of cases I get mixed up on, \n\t\t\tbut I think there are some people who were \n\t\t\tbrought in for questioning on a murder case \n\t\t\tthat could have something to do with the ear. \n\t\t\tI heard some of the same names.\n\n\t\t\t\t\tJEFFREY\n\t\t\tDo you know who was brought in for \n\t\t\tquestioning?\n\n\t\t\t\t\tSANDY\n\t\t\tThere were at least three, maybe four. But\n\t\t\ta name that keeps coming up is this woman\n\t\t\twho lives in an apartment building very\n\t\t\tclose to your house and also close to the \t\n\t\t\tfield where you found the ear. There's \n\t\t\talso a business man over by the Franklin\n\t\t\tfactory district that was questioned. and\n\t\t\ta musician. and some others.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWere all these people questioned this\n\t\t\tafternoon?\n\n\t\t\t\t\tSANDY\n\t\t\tNo. this has been going on for some time\n\t\t\t. several months. About six months ago\n\t\t\tsome parts of bodies were found down by\n\t\t\tthe river. They were from people who were\n\t\t\treported missing. They never found one\n\t\t\tcomplete body. only parts.\n\n\t\t\t\t\tJEFFREY\n\t\t\tThe ear is from a missing person maybe?\n\n\t\t\t\t\tSANDY\n\t\t\tMaybe so.\n\n\t\t\t\t\tJEFFREY\n\t\t\tIt's a strange world isn't it? Do you know\n\t\t\twhat building the woman lives in?\n\n\t\t\t\t\tSANDY\n\t\t\tYeah. It's close by. that's what's creepy.\n\t\t\tThey've had her under surveillance for a \n\t\t\tcouple of months, except I don't know what\n\t\t\tthey've found out because my father isn't\n\t\t\tin charge of her.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI guess you have to get back home soon?\n\n\t\t\t\t\tSANDY\n\t\t\tNot really, why?\n\t\t\t\t(then she understands)\n\t\t\tYou want to see the building?. Come on,\n\t\t\tI'll show you.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n55. EXT. LINCOLN STREET - NIGHT\n\nJeffrey and Sandy walk through the light of a street light.  The street \nsign \"LINCOLN ST\" can be read.  They walk into darkness and continue down \nto an apartment building on the right side of the street.\n\n\t\t\t\t\tSANDY\n\t\t\t    (nodding toward building)\n\t\t\tThat's the building. She lives on the\n\t\t\tSeventh Floor. Don't stop to look long\n\t\t\t. the police are watching.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWhere are they?\n\n\t\t\t\t\tSANDY\n\t\t\tI don't know. you're not supposed to see\n\t\t\tthem. They're supposed to see you.\n\nThey begin walking slowly back to Sandy's house.\n\n\t\t\t\t\tJEFFREY\n\t\t\tDid they find out anything when they\n\t\t\tquestioned her?\n\n\t\t\t\t\tSANDY\n\t\t\tI don't know. like I said, she's not my\n\t\t\tfather's case.\n\n\t\t\t\t\tJEFFREY\n\t\t\tOh yeah. What about those other people?\n\t\t\t. Anything?\n\n\t\t\t\t\tSANDY\n\t\t\tMy father is watching the businessman.\n\t\t\tThe businessman had a partner who \n\t\t\tdisappeared. left his whole business and\n\t\t\tfamily, his wife and two kids. They think\n\t\t\the's been murdered.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYou really do hear a lot, don't you?\n\n\t\t\t\t\tSANDY\n\t\t\tYeah, I guess so.\n\t\t\t    (they continue walking)\n\t\t\tWhat are you going to do now that you're \n\t\t\thome?\n\n\t\t\t\t\tJEFFREY\n\t\t\tI have to help out in my father's hardware\n\t\t\tstore. they're giving me sort of my own \n\t\t\thours for a while. which is nice.\n\n\t\t\t\t\tSANDY\n\t\t\tStill, it must be kinda rough.\n\n\t\t\t\t\tJEFFREY\n\t\t\tIt's not bad. but it's bad enough.\n\t\t\tit's a lot worse for my father.\n\t\t\t\t(Jeffrey points to a house)\n\t\t\tI used to know a kid who lived there and who\n\t\t\thad the biggest tongue in the world.\n\nJeffrey and Sandy both laugh.\n\n\t\t\t\t\tSANDY\n\t\t\tWhat happened to him?\n\n\t\t\t\t\tJEFFREY\n\t\t\tI don't know. he moved away.\n \n\t\t\t\t\t\t\t\t\tCUT TO:\n\n56. EXT. NEIGHBORHOOD STREET - NIGHT\n\nA LONG SHOT\n\nJeffrey and Sandy walking and talking, sometimes laughing in the distance,\nwhile the MUSIC theme, haunting yet warm, plays over.\n\n57. EXT. WILLIAMS HOME - NIGHT\n\nThey arrive back at Sandy's home.\n\nCLOSER ON JEFFREY AND SANDY\n\nin front of Sandy's home.\n\n\t\t\t\t\tSANDY\n\t\t\tI've gotta go in.\n\n\t\t\t\t\tJEFFREY\n\t\t\tThanks for the tour. It was nice talking\n\t\t\tto you.\n\nSandy just looks at him shyly before she turns to go up the front walk.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t    (continuing)\n\t\t\tI guess I'll see you sometime.\n\n\n\n\t\t\t\t\tSANDY\n\t\t\tI guess so. Like you said. It's a \n\t\t\tstrange world.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t      (smiles)\n\t\t\tYeah. Good bye.\n\nJeffrey watches as Sandy goes inside her house.  He watches her house for \na moment and sees her cross the living room.  He turns and walks away.  \n\nAgain, the MYSTERIOUS CHORDS OF MUSIC swell up as Jeffrey walks through \nthe night.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n58. INT. BEAUMONT'S HARDWARE STORE - DAY\n\nJeffrey is poking around in the back room.  He picks up some bug spraying \ndevices.  He yells out to an old black man who works in the store.\n\n\t\t\t\t\tJEFFREY\n\t\t\tHey, Ed, okay if I borrow these bug spraying\n\t\t\trigs later on?\n\nEd peers into the back room.  Spots Jeffrey.\n\n\t\t\t\t\tED\n\t\t\tListen Bud. If you need to spray for bugs\n\t\t\tthey're yours.  It causes me no pain.\n\n\t\t\t\t\tJEFFREY\n\t\t\tOkidoke Ed. Thanks.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n59. EXT. BEAUMONT'S HARDWARE STORE - DAY\n\nJeffrey puts the stuff in the trunk of the car.  There are several \"Awake\" \nmagazines there too.  He gets in the front seat and drives off.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n60. INT. BEAUMONTS' CAR - DAY\n\nJeffrey driving.  He looks at his watch.  It is 3:30.\n\n61. EXT. CENTRAL HIGH SCHOOL - DAY\n\nJeffrey is parked across the street from the school.  High school kids \nare pouring out the front door.  In a moment he sees Sandy come out with \ntwo or three other girls.  They walk down the sidewalk away from Jeffrey.\n\nHe starts the car and slowly follows them to the corner, where he pulls \nup alongside of them. very close. Sandy suddenly recognizes him.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYou hungry or thirsty, or both?\n\n\t\t\t\t\tSANDY\n\t\t\t\t   (taken back)\n\t\t\tI don't know.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI'd like to talk to you about something.\n\n\t\t\t\t\tSANDY\n\t\t\tJust a minute. pull over and wait a \n\t\t\tminute.\n\nSandy pulls her girlfriends away from Jeffrey's car and says something to \nthem.  There is some whispering and giggling and then,\n\n\t\t\t\t\tSANDY\n\t\t\t\t  (to the girls)\n\t\t\tPlease, don't say anything to Mike.\n\t\t\tpromise?\n\nThe girls promise.  Sandy goes around and gets in the car.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI don't want to cause any trouble.\n\n\t\t\t\t\tSANDY\n\t\t\tI'm here, aren't I?\n\n\t\t\t\t\tJEFFREY\n\t\t\t    (smiling as though he knew)\n\t\t\tI guess Mike's got some sort of sports\n\t\t\tpractice in the afternoon.\n\n\t\t\t\t\tSANDY\n\t\t\tOoooo, you are smart. Just don't get too\n\t\t\tsmart.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n62. INT. DINER - DAY\n\nJeffrey and Sandy are sitting in a booth.  Jeffrey's grilled cheese on \nwhite bread and a coke have just arrived along with Sandy's coke.\n\n\t\t\t\t\tSANDY\n\t\t\tAlright, now tell me. What is it?\n\n\t\t\t\t\tJEFFREY\n\t\t\tThere are opportunities in life for gaining\n\t\t\tknowledge and experience. sometimes, in\n\t\t\tsome cases. it's necessary to take a risk.\n\t\t\tI got to thinking. I'll bet a person could\n\t\t\tlearn a lot by getting into that woman's \n\t\t\tapartment. you know. sneak in and hide\n\t\t\tand observe.\n\n\t\t\t\t\tSANDY\n\t\t\tYou said it was a strange world. \n\t\t\tand you're the strangest part of it. Are \n\t\t\tyou crazy.she is possibly involved in \n\t\t\tmurder. This gives me the creeps.\n\n\t\t\t\t\tJEFFREY\n\t\t\tSettle down. I have a plan which I think\n\t\t\twill work. There is very little for you\n\t\t\tto do, but I do need your help.\n\t\t\t.Aren't you curious about my plan?\n\n\t\t\t\t\tSANDY\n\t\t\t  (thinking and intrigued, plus she \n  \t\t\t   is beginning to like Jeffrey)\n\t\t\tIt wouldn't hurt to hear the plan, I guess.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t  (getting excited)\n\t\t\tAlright. the first thing is to get into her\n\t\t\tapartment and open a window that I could \n\t\t\tcrawl into later.\n\n\t\t\t\t\tSANDY\n\t\t\tNow, how are you going to do that?\n\n\t\t\t\t\tJEFFREY\n\t\t\tRight out in the car I happen to have some\n\t\t\told overalls and a bug spraying rig. I will\n\t\t\tgo to her apartment and be the pest control\n\t\t\tman. I will spray her apartment. After a \n\t\t\tfew minutes you will knock on her door, \n\t\t\tdrawing her attention away from me and I \n\t\t\twill then jimmy a window.\n\n\t\t\t\t\tSANDY\n\t\t\tWhat will I say when she comes to the door?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYou will be a Jehovah's Witness. I have a \n\t\t\tfew \"Awake\" magazines for you. You don't \n\t\t\thave to keep her very long. a few seconds \n\t\t\tis all I'll need. Whatiya think?\n\n\t\t\t\t\tSANDY\n\t\t\tI don't know. it sounds like a good \n\t\t\tdaydream, . but actually doing it is too\n\t\t\tweird. too dangerous.\n\n\t\t\t\t\tJEFFREY\n\t\t\tLet's just try the first part. If that\n\t\t\tgoes well, we'll see about the rest. No one\n\t\t\twill suspect us, because no one would \n\t\t\tbelieve two people like us would be crazy\n\t\t\tenough to do something like this.\n\n\t\t\t\t\tSANDY\n\t\t\tYou've got a point there.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n63. INT. BEAUMONTS' CAR/LINCOLN STREET-DAY\n\nJeffrey and Sandy are in the car.  Jeffrey is struggling to put on the old overalls.\n\n\t\t\t\t\tJEFFREY\n\t\t\tNow. we'll walk over so there's no license\n\t\t\tplates and you give me at least three \n\t\t\tminutes. I can stall if it's more, but I\n\t\t\tneed time to find a good window .alright?\n\n\t\t\t\t\tSANDY\n\t\t\tAlright.\n\n\t\t\t\t\tJEFFREY\n\t\t\tLet's go.\n\n64. EXT. LINCOLN STREET - DAY\n\nThey get out of the car. Sandy has the \"Awake\" magazines.\n\n\t\t\t\t\tJEFFREY\n\t\t\tOkay, I'm going ahead. Wait a minute,\n\t\t\twhat's her name?\n\n\t\t\t\t\tSANDY\n\t\t\tOh bother. Dorothy Vallens, Seventh\n\t\t\tFloor.  Look on the mailbox for her number,\n\t\t\tbright boy.\n\n\t\t\t\t\tJEFFREY\n\t\t\tThanks. Dorothy Vallens. Okay. good\n\t\t\tluck . three minutes, no sooner.\n\n\t\t\t\t\tSANDY\n\t\t\tAlright. Good luck, yourself.\n\nJeffrey takes off in the direction of the apartment building.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n65. EXT. APARTMENT BUILDING - DAY\n\nJeffrey walks up the front steps and goes in the double outer doors.\n\n66. INT. LOBBY - APARTMENT BUILDING - DAY\n\nHe looks up and down the mailboxes and finally finds \"D. Vallens, \nApartment Number 710.\"\n\nJeffrey goes into the lobby.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n67. INT. STAIRWAY - APARTMENT BUILDING - DAY\n\nJeffrey climbs the stairs.  An OLD LADY is making her way down the stairs.\nShe sees Jeffrey and his rig.\n\n\t\t\t\t\tOLD LADY\n\t\t\tWell, it's about time you came.\n\nJeffrey forces a smile at her and after she's gone.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t    (to himself)\n\t\t\tThat's a good sign.\n\nHe keeps climbing.  He arrives at the Seventh Floor. and finds Number 710. \nHe knocks and waits.  He looks around. the hallway is empty.\n\nDOROTHY VALLENS opens the door.  She is a very beautiful woman in her \nlate thirties.  She has a beautiful full figure, dark eyes, black thick \nwavy hair.  Full red lips.  Right now, however, she looks a bit tired and \na bit frumpy in an old terrycloth robe.\n\n\t\t\t\t\tDOROTHY\n\t\t\tYes? What is it?\n\n\t\t\t\t\tJEFFREY\n\t\t\tPest control. gotta do your apartment.\n\n\t\t\t\t\tDOROTHY\n\t\t\tOh God, that stuff stinks.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t (as he goes in)\n\t\t\tNope. it's new stuff. no smell.\n\n\t\t\t\t\tDOROTHY\n\t\t\tOh yeah, that's good.\n\n68. INT. DOROTHY'S APARTMENT - DAY\n\nJeffrey goes all around the baseboards, spraying.  All the while he's \ngetting a good look around the apartment.\n\nThere is a window above the kitchen sink out to the fire escape.  Jeffrey \nlooks around to see what Dorothy is doing and she is watching him spraying.\nThe apartment is smaller than he thought, so he sprays the kitchen very \nslowly and makes believe the sprayer is jammed.\n\nSuddenly, there is knocking at the door.\n\n\t\t\t\t\tDOROTHY\n\t\t\tWhat is this. Grand Central Station?\n\nShe opens the door.  Jeffrey looks. It's not Sandy. A MAN, with a yellow \nsports coat, is standing there.  Jeffrey begins to sweat, because the MAN \nlooked around Dorothy to see him.  Dorothy says something to the Man which \nJeffrey cannot hear.\n\nThe next time Jeffrey looks up, the Man is gone.  The whole thing looks \nto be turning out badly when Jeffrey spots a key on the counter.  On a \nlong shot, he steals it just as the front door shuts. He wraps things up \nand gets out.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t    (to Dorothy)\n\t\t\tThat oughta do it.\n\n\t\t\t\t\tDOROTHY\n\t\t\tYeah.\n\n\n69. \tINT. STAIRWAY - APARTMENT BUILDING - DAY\n\nJeffrey leaves.  Out on the stairs, he finds Sandy with her \"Awake\" \nmagazines.\n\n\t\t\t\t\tSANDY\n\t\t\tAre you alright?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah. let's get outta here. What\n\t\t\thappened?\n\nAs they go downstairs,\n\n\t\t\t\t\tSANDY\n\t\t\tI was just about to go to the door, when\n\t\t\tthat man did my job for me. Was it alright?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYes and no. Did you recognize him?\n\n\t\t\t\t\tSANDY\n\t\t\tNo. I only saw his back. He went down \n\t\t\tanother stairwell at the end of the hall.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI didn't get a good look at him either, but\n\t\t\the sure looked at me. I didn't have time to \n\t\t\tget a window, but I found this key.\n\t\t\t\t (he shows it to her)\n\t\t\tPretty nifty, huh?\n\n\t\t\t\t\tSANDY\n\t\t\tYeah, if it opens the door.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah.\n\n70. \tINT. LOBBY - APARTMENT BUILDING - DAY\n\nThey get to the door of the apartment building.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYou go first.\n\n71. EXT. LINCOLN STREET - DAY\n\nThey leave the building separately.  When Jeffrey gets to the car, \nSandy isn't there.  He looks around.  He starts the car and drives off.\n\nThere, up ahead, he spots her.  He pulls over and she gets in.\n\n\t\t\t\t\tSANDY\n\t\t\tSo. what's next?\n\n\t\t\t\t\tJEFFREY\n\t\t\tPretty clever. Are you game for more?\n\n\t\t\t\t\tSANDY\n\t\t\tI owe you. since I goofed up this one.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYou didn't goof it up, but. you still\n\t\t\towe me one. I want to sneak in tonight. \n\t\t\tIt's Friday. do you have a date tonight?\n\n\t\t\t\t\tSANDY\n\t\t\tYes. I do.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWell, it's Friday night and you're a \n\t\t\tbeautiful girl. I guess you would have\n\t\t\ta date. that does that.\n\n72. INT. BEAUMONTS' CAR/WILLIAMS HOME - DAY\n\nJeffrey is driving Sandy home.\n\n\t\t\t\t\tSANDY\n\t\t\tYou really want to do this, don't you?\n\n\t\t\t\t\tJEFFREY\n\t\t\tI don't want you to get involved, really,\n\t\t\tI mean, I do, but if something went wrong\n\t\t\tI mean, like you said, they may be involved\n\t\t\tin murder.\n\nThey pull up in front of Sandy's house.\n\n\t\t\t\t\tSANDY\n\t\t\t   (making up her mind - against\n    \t\t\t    her better judgment)\n\t\t\tI'll tell Mike I'm sick. There's a game\n\t\t\ttonight anyway and he'll never miss me.\n\t\t\tAfterwards he can go out with the guys.\n\t\t\tJust so the record is kept straight though,\n\t\t\tI love Mike. What do want me to do?\n\n\t\t\t\t\tJEFFREY\n\t\t\t    (studies her a moment, then)\n\t\t\tFirst of all, we'll have a nice dinner.\n\t\t\tTry to find out where Dorothy sings.\n\n\t\t\t\t\tSANDY\n\t\t\tI already know. The \"Slow Club.\" It's on\n\t\t\tRoute 7.\n\n\t\t\t\t\tJEFFREY\n\t\t\tGreat. I'll pick you up around eight\n\t\t\to'clock. Is that good?\n\n\t\t\t\t\tSANDY\n\t\t\tYeah, but don't pick me up. my father may\n\t\t\tthink it's strange. I'll walk over to your\n\t\t\thouse. I'll be there at eight o'clock.\n\n\t\t\t\t\tJEFFREY\n\t\t\tOkay. You better get out before someone\n\t\t\tsees us.\n\nSandy gets out of the car and without turning around walks into her \nhouse.  Jeffrey calls out after her.\n\n\t\t\t\t\tJEFFREY\n\t\t\tSee ya!\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n73. INT. BEAUMONTS' LIVING ROOM - NIGHT\n\nINSERT T.V. SCREEN\n\nThe television is on.  Some crime show is playing, but the SOUND is \nvery low.\n\nThe FAMILY DOCTOR is over and is giving Mrs. Beaumont an injection of \nmedicine.  Aunt Barbara is sitting nearby.\n\n\t\t\t\t\tDR. GYNDE\n\t\t\tThat will take care of you, Frances, for\n\t\t\tanother week. I don't want you to overdo\n\t\t\tthings either. Take it very easy.\n\n\t\t\t\t\tAUNT BARBARA\n\t\t\tI'll see to it, Bill.\n\n\t\t\t\t\tDR. GYNDE\n\t\t\tGood.\n\n\t\t\t\t\tMRS. BEAUMONT\n\t\t\tI feel fine.\n\n\t\t\t\t\tDR. GYNDE\n\t\t\tThat's not the point. You're under a great\n\t\t\tdeal of stress. don't overdo it. don't\n\t\t\tbe foolish.\n\nJeffrey enters the room - to say goodnight.\n\n\t\t\t\t\tJEFFREY\n\t\t\tDoctor Gynde. my whole family's sick.\n\t\t\tWhat's going on?\n\n\t\t\t\t\tAUNT BARBARA\n\t\t\tI'm not sick.\n\nJeffrey points to his head and makes a circular \"crazy\" gesture.  They \nall laugh, except Aunt Barbara.\n\n\t\t\t\t\tAUNT BARBARA\n\t\t\t\t\t(continuing)\n\t\t\tWe'll see who stays in my will.\n\nThey laugh again.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t  (to his mother)\n\t\t\tCan I use the car tonight?\n\n\t\t\t\t\tMRS. BEAUMONT\n\t\t\tOf course, Jeffrey.\n\nThey say their goodnights.\n\n74. INT. BEAUMONTS' CAR - NIGHT\n\nJeffrey and Sandy are looking at each other.  Jeffrey turns back to \ndriving.\n\nSandy watches Jeffrey drive then she turns and watches the stores and \nshops go by.\n\nWhen she is turned away, Jeffrey turns and look at her.  Sandy is \nthinking.\n\n\t\t\t\t\tSANDY\n\t\t\tWhat's the plan.\n\n\t\t\t\t\tJEFFREY\n\t\t\tFirst of all, we're going to the Slow Club\n\t\t\tto see Dorothy Vallens. We'll watch her for\n\t\t\tawhile. I'd like to hear her sing anyway,\n\t\t\tand then also we'll know she is there and\n\t\t\tnot in her apartment.\n\n\t\t\t\t\tSANDY\n\t\t\tBrilliant.\n\n\t\t\t\t\tJEFFREY\n\t\t\tThen we'll drive back to her apartment and \n\t\t\tI will plant myself there.\n\n\t\t\t\t\tSANDY\n\t\t\tThis is not my usual Friday night!\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n75. EXT. \"SLOW CLUB\" - NIGHT\n\nThe SLOW CLUB is a sleazy night club on the outskirts of town.  It \nhas a dirty trash-strewn parking lot in front of it, where Jeffrey and \nSandy park.  They get out of the car and enter the club.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n76. INT. \"SLOW CLUB\" - NIGHT\n\n\t\t\t\t\tSLEAZY MAITRE D'\n\t\t\t\t\t(French accent)\n\t\t\tGood evening. two?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah. Could we get a small table in the\n\t\t\tback?\n\n\t\t\t\t\tSLEZY MAITRE D'\n\t\t\tSurely, come this way.\n\nThey follow him and are seated.\n\n\t\t\t\t\tMAITRE D'\n\t\t\tMay I get you something to drink?\n\n\n\t\t\t\t\tJEFFREY\n\t\t\tI'd like an ice-cold Heineken.\n\n\t\t\t\t\tSANDY\n\t\t\t    (she might as well)\n\t\t\tThat sounds good.\n\n\t\t\t\t\tJEFFREY\n\t\t\tTwo.\n\n\t\t\t\t\tMAITRE D'\n\t\t\tTwo Heinekens, thank you.\n\nThe Maitre d' leaves.\n\nOn stage a FAT COMIC is telling jokes.  The jokes are tailored for this \nkind of working-class crowd.  The people are laughing.  The place is \nalmost full.  Jeffrey and Sandy are taking it all in.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t    (to Waiter)\n\t\t\tWhen does Dorothy Vallens come on?\n\n\t\t\t\t\tWAITER\n\t\t\t\t(flustered; overworked)\n\t\t\tI don't know. pretty soon. Who knows.\n\nAfter the Waiter leaves,\n\n\t\t\t\t\tSANDY\n\t\t\tThat guy was filled with information.\n\nThey pour their beers.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t (raising his glass)\n\t\t\tHere's to. an interesting experience.\n\n\t\t\t\t\tSANDY\n\t\t\tI'll drink to that.\n\nThey drink.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n77. INT. \"SLOW CLUB\" - NIGHT\n\nLater. Jeffrey and Sandy have just finished dinner.  The M.C. is arranging \na floral art deco microphone and a SAXOPHONE PLAYER, a BASS PLAYER, and a \nDRUMMER are on stage.\n\n\t\t\t\t\tM.C.\n\t\t\t\t (very low key)\n\t\t\tLadies and gentlemen. The Blue Lady.\n\t\t\tMiss Dorothy Vallens.\n\nThere is quite a round of applause, even though most people continue \nlaughing, talking, and drinking.  Dorothy Vallens comes out on stage.\n\n\n\nShe smiles. The house lights are still up. As she sings the first lines \nof \"BLUE MOON\" the house lights go down and a blue spot light comes up on \nher as she sings the word, \"Blue.\" This is a very sexy and slow version of \nthe song.\n\nDuring the song, Jeffrey and Sandy look at one another with the thought \nthat this is the woman whose apartment they are about to break into.\n\nJeffrey and Sandy leave as Dorothy starts her next song, \"BLUE VELVET.\"  \nThey hear the first few lines before they get out the door.\n\n78. EXT. \"SLOW CLUB\" - NIGHT\n\nThey hurry to the car, get in, and drive off.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n79. INT. BEAUMONTS' CAR - NIGHT\n\nJeffrey and Sandy drive through dark areas of the city.  They don't talk \nas they drive, but again they sneak glances at one another.\n\n80. INT. BEAUMONTS' CAR/LINCOLN STREET - NIGHT\n\nThey turn in to the street where Dorothy Vallens lives and glide to a stop \nclose to the building.  Jeffery cuts the engine.\n\nIt is very quiet.  Both are looking around to see if anyone is out or \nwatching.  Jeffrey tries to look up out the front windshield to the \nSeventh Floor.  It is dark.  Sandy moves.  Every tiny sound is heard.  \nSandy looks at Jeffrey for some time, then back at the building.\n\n\t\t\t\t\tSANDY\n\t\t\tJeffrey, I don't think you ought to do it.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWhy not?\n\n\t\t\t\t\tSANDY\n\t\t\tIt's crazy and dangerous. My God. I \n\t\t\tshouldn't have told you.\n\n\t\t\t\t\tJEFFREY\n\t\t\tIt'll be okay. I don't think you should\n\t\t\twait out here though. I think you should \n\t\t\tgo home. Can you drive this car?\n\n\t\t\t\t\tSANDY\n\t\t\tYeah. but.\n\n\t\t\t\t\tJEFFREY\n\t\t\tLeave it in the front of your house for me.\n\t\t\tokay?\n\n\t\t\t\t\tSANDY\n\t\t\tO.K.\n\n\t\t\t\t\tJEFFREY\n\t\t\tCould you wait a little while. this key may\n\t\t\tnot fit.\n\n\t\t\t\t\tSANDY\n\t\t\t. I wish you wouldn't do this.  It doesn't\n\t\t\tmake any sense. Let's go somewhere and \n\t\t\thave some coffee.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI'm going in, Sandy. I'll see you tomorrow\n\t\t\tand tell you how it went.\n\n\t\t\t\t\tSANDY\n\t\t\tI. I don't want to see you tomorrow.\n\t\t\tMike's coming over.\n\n\t\t\t\t\tJEFFREY\n\t\t\tOh, okay. can I call?\n\n\t\t\t\t\tSANDY\n\t\t\tOkay. yeah, call.\n\n\t\t\t\t\tJEFFREY\n\t\t\tLook. it can wait till Sunday.\n\n\t\t\t\t\tSANDY\n\t\t\tCall tomorrow. It's okay. Good luck. I hope\n\t\t\tyou can sneak out okay. You're going to \n\t\t\twait until she's asleep?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah.\n\n\t\t\t\t\tSANDY\n\t\t\tI'm going to wait here until she comes.\n\n\t\t\t\t\tJEFFREY\n\t\t\tAre you sure?\n\n\t\t\t\t\tSANDY\n\t\t\tI'll honk four times so you'll hear it and\n\t\t\tknow she's on her way up. Okay?\n\nJeffrey nods.\n\n\t\t\t\t\tJEFFREY\n\t\t\tOkay. thanks.\n\n\t\t\t\t\tSANDY\n\t\t\tI don't know if you're a detective or a \n\t\t\tpervert.\n\n\t\t\t\t\tJEFFREY\n\t\t\tThat's for me to know and for you to find\n\t\t\tout. I'll see you. I mean call you. okay?\n\n\t\t\t\t\tSANDY\n\t\t\tOkay, okay. Bye.\n\nJeffrey gets out of the car and shuts the door.  He looks in one more time \nat Sandy.  They stare at each other silently.\n\nJeffrey can see her lips in the black darkness of the car.  Sandy watches \nhim cross the lawn and go into the apartment building.  She slides over and\nsits in the driver's seat.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n81. INT. STAIRWAY - APARTMENT BUILDING - NIGHT\n\nJeffrey hurries up the stairs to the Seventh Floor.\n\nSOMEONE comes out of an apartment just as Jeffrey gets to the Seventh Floor.\n\nHe goes up another flight of stairs to the Eighth Floor and waits until \nthe man goes downstairs.\n\nJeffrey then goes back to the Seventh Floor and goes to Door 710.  \nHe takes out the key and looks around. No one.  He inserts the key.  \nIt fits.  He turns it.  The door opens.\n\n82. INT. DOROTHY'S APARTMENT - NIGHT\n\nHe quickly enters the very dark apartment and shuts the door.  It takes a \nmoment for his eyes to adjust to the darkness.  Soon he finds his way \naround.  He decides on the closet to hide in.  However before he goes in \nto the closet he slowly surveys the apartment as well as he can in the \ndarkness.  He goes down the hallway to the back bedroom.  \n\nAcross the hallway he opens another door and is surprised to find an empty \nchild's room.  In the child's room he sees a small pointed hat with a \npropeller on top.  The kind that plays music when the propeller turns.  \nThe hat is sitting silently on the bed post.  He quietly closes the door.  \nHe returns to the closet.  Once inside, he checks out how much he can see. \nThrough the slats he has a view of half the apartment.  This is where he \nwill stay.  He moves around some to relax.  He takes several deep breaths. \nHe looks at his watch.  It says \"10:17.\"\n\n83. INT. BEAUMONTS' CAR/LINCOLN STREET - NIGHT\n\nSandy sits in the car, carefully watching the apartment building and \nstreet.\n\n84. INT. DOROTHY'S APARTMENT - NIGHT\n\nIn the closet, Jeffrey shakes his shoulders and moves around some to \nstretch his muscles which are getting tired.  Again, he takes several \ndeep breaths.  He looks at his watch - it says 12:45.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t    (to himself)\n\t\t\tOh no, hurry up Dorothy. Come on!. and I\n\t\t\tgotta pee. Great. it's now or never.\n\nJeffrey sneaks out of the closet and makes his way across the bedroom to \nthe door of the bathroom.  His foot hits the door and it makes a loud \nnoise.  He freezes.\n\n85. INT. DOROTHY'S BATHROOM - NIGHT\n\nHe moves again into the bathroom.  He starts to pee.\n\n\t\t\t\t\tJEFFREY\n\t\t\tHeineken.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n86. INT. BEAUMONTS' CAR/LINCOLN STREET - NIGHT\n\nSuddenly Sandy sits up alert.\n\n87. EXT. APARTMENT BUILDING - NIGHT\n\nA car drives up and a MAN helps Dorothy Vallens get out.  They walk into \nthe building.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n88. INT. DOROTHY'S BATHROOM - NIGHT\n\nJeffrey instinctively has flushed the toilet and because everything else \nis so quiet the water SOUNDS seem very loud.\n\n89. INT. BEAUMONTS' CAR/LINCOLN STREET - NIGHT\n\nSandy begins to honk the horn.\n\n90. INT. DOROTHY'S APARTMENT - NIGHT\n\nUnable to hear the warning horn, Jeffrey nonchalantly leaves the bathroom \nas the tank is still filling.\n\nSUDDENLY, he hears something. a key going in the door.  He bolts toward \nthe closet.  He flies inside it and is swinging the door shut as the front \ndoor opens.\n\nJust as suddenly, the toilet tank gets full and the water shuts off - \nSILENCE, except for Dorothy Vallens at the front door.\n\n\t\t\t\t\tDOROTHY (V.O.)\n\t\t\t\t(we're watching Jeffrey trying to \n  \t\t\t\t control frightened breathing in\n\t\t\t  the dark closet)\n\t\t\tThanks Jimmy, see you tomorrow. You want a\n\t\t\tdrink, or something?\n\n\t\t\t\t\tJIMMY (V.O.)\n\t\t\tI better get back. thanks anyway.\n\n\t\t\t\t\tDOROTHY\n\t\t\tGoodnight.\n\n\t\t\t\t\tJIMMY\n\t\t\tGoodnight now.\n\nThe front door shuts and the living room lights go on.  Jeffrey can see \nDorothy come toward him.  She walks RIGHT UP, almost to his face, when \nthe phone RINGS.\n\nShe turns immediately and goes to answer it.  Jeffrey almost passes out. \nHe thought he'd had it.  He overhears.\n\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t    (on the phone)\n\t\t\tHello. yes. yes sir, Frank. Let me\n\t\t\ttalk to him. Please Frank, sir. I like\n\t\t\tto sing Blue Velvet. Don? It's okay.\n\t\t\tDon't worry. Don??. can you hear me?\n\t\t\tIs little Donny OK? Is he there? Don? You\n\t\t\tmean Meadow Lane? Frank?! What's the\n\t\t\tmatter with him? I know. When? Okay. In\n\t\t\tan hour. I'll be sweet. Momma loves you.\n\t\t\tOkay Frank, sir.\n\nShe hangs up the phone hard and puts her head in her hands.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t    (to herself)\n\t\t\tFrank, you son of a bitch!\n\nShe goes and sits down and starts chewing a fingernail.  She nervously \ngets up again and looks at a framed photograph for a moment then hides \nthe photograph under a pillow on the couch.  She puts on a record, \"FOR \nYOUR PRECIOUS LOVE.\"  She sits back down and chews her nail again, \nlistening to the MUSIC; she starts to cry.  She stops herself and takes \nthe record off.  She starts taking off her stocking.  She then takes off \nher dress.\n\nUnderneath, she has on a bra and panties.  She crosses the living room, \ngoes down the hallway into the bathroom.\n\nJeffrey can't see her too well now.  She takes off her panties in the \nbathroom.  She is now naked.  She looks at herself in the mirror.  We see \nJeffrey's face as he watches her.  She disappears from view completely and \nwe HEAR her start a SHOWER.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n91. INT. DOROTHY'S APARTMENT - NIGHT\n\nJeffrey's face.  He sees Dorothy - in a towel - come toward him again.  \nHe quickly moves back into the closet as far as he can.\n\nShe opens the door, reaches in and gets a blue velvet robe.  She doesn't \nsee Jeffrey even though he isn't well hidden.  She closes the door.  It \nCLICKS shut.\n\nJeffrey is in almost total darkness.  He listens.  He can HEAR WALKING \naround, then silence.  He hears the kitchen sink WATER RUNNING.\n\nHe HEARS her WALKING AGAIN.  Now he can see her.  She sits down on her \nbed.  She looks up.  Just as Jeffrey shifts his weight.  She looks at the\ncloset strangely, but then calmly picks up a book and thumbs through it.  \nShe slowly gets up.\n\nJeffrey doesn't know what is up.  He looks but she walks out of view.\n\nSUDDENLY, he hears a DRAWER OPEN, and just as suddenly, the CLOSET DOOR \nFLIES OPEN, and there she is with a pistol pointed right at him.  When \nshe realizes that SOMEONE IS REALLY THERE, she SCREAMS ONCE, very loud.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t (crazy scream, then)\n\t\t\tGET OUT OF THERE!! GET OUT!! Put your\n\t\t\thands up, on your head. GO ON!! Get down\n\t\t\ton your knees - DO IT!! What are you \n\t\t\tdoing? Who are you? What's your name?.\n\t\t\tWHAT'S YOUR NAME?\n\n\t\t\t\t\tJEFFREY\n\t\t\tJeffrey.\n\n\t\t\t\t\tDOROTHY\n\t\t\tJeffrey. Jeffrey what?\n\n\t\t\t\t\tJEFFREY\n\t\t\tJeffrey nothing.\n\n\t\t\t\t\tDOROTHY\n\t\t\tYou tell me!! Let me see that wallet.\n\t\t\t\t (reads his license)\n\t\t\tJeffrey Beaumont. What're you doing in\n\t\t\tmy apartment, Jeffrey Beaumont?\n\n\t\t\t\t\tJEFFREY\n\t\t\tI wanted to see you.\n\n\t\t\t\t\tDOROTHY\n\t\t\tWhat? Are you kidding me? Who sent you \n\t\t\there?\n\n\t\t\t\t\tJEFFREY\n\t\t\tNobody.\n\n\t\t\t\t\tDOROTHY\n\t\t\tShit. You better tell me something.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI was. an experiment. Just to see if\n\t\t\tI could do it.\n\n\t\t\t\t\tDOROTHY\n\t\t\tAn experiment? Hey, I've seen you before.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI sprayed your apartment. I took your key.\n\t\t\tI really didn't mean to do anything but \n\t\t\tsee you.\n\n\t\t\t\t\tDOROTHY\n\t\t\tTell me what you saw tonight. TELL ME.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t (scared, nervous)\n\t\t\t. I saw you come in, talk on the phone.\n\t\t\tget undressed.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t   (interrupting)\n\t\t\tThe phone. What did you hear on the phone\n\t\t\t. Tell me. Word for word.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t (trying to remember)\n\t\t\tYou said hello. to Frank. You wanted to \n\t\t\ttalk to someone?. Don?. and little Donny.\n\t\t\tYou said something about Momma loves you.\n\t\t\tand something about a Meadow Lane.\n\t\t\tsomething in an hour. I don't remember\n\t\t\tany more.\n\nDorothy stares at Jeffrey studying him for some time thinking.\n\n\t\t\t\t\tDOROTHY\n\t\t\tThat's right. That's what I said. You\n\t\t\thave a good memory. Then what?\n\n\t\t\t\t\tJEFFREY\n\t\t\tWell.\n\n\t\t\t\t\tDOROTHY\n\t\t\tTHEN WHAT?\n\n\t\t\t\t\tJEFFREY\n\t\t\tThen you got undressed.\n\n\t\t\t\t\tDOROTHY\n\t\t\tHow many times have you sneaked into girls'\n\t\t\tapartments and watched them undress?\n\n\t\t\t\t\tJEFFREY\n\t\t\t    (quietly; feeling guilty)\n\t\t\tNever before this.\n\n\t\t\t\t\tDOROTHY\n\t\t\tHow'd you like it if someone sneaked into\n\t\t\tyour house and watched you.\n\t\t\t\t   (gets an idea)\n\t\t\tGet undressed. I want to see you.\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo. Come on.\n\n\t\t\t\t\tDOROTHY\n\t\t\tNO, you come on. Take off your pants. I\n\t\t\twant to see you.\n\n\t\t\t\t\tJEFFREY\n\t\t\tLook. I'm sorry. Just let me leave.\n\n\t\t\t\t\tDOROTHY\n\t\t\tNo way.\n\nDorothy moves to the kitchen counter and gets a knife.  She goes to \nJeffrey.  Now she has a knife and a gun.  He's scared.\n\n\t\t\t\t\tDOROTHY\n\t\t\tGet undressed. I want to see you.\n\nJeffrey begins to undress. First he takes off his shoes and socks, \nThen his shirt.  He undoes his belt and unzips his pants and takes them \noff.  Now he is only in his underwear.\n\n\t\t\t\t\tDOROTHY\n\t\t\tSTAND UP.\n\nHe does.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t    (continuing)\n\t\t\tCome closer.\n\nDorothy has a strange look on her face.  She reaches out and pulls \nJeffrey's underpants down to his knees.  She looks at him.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t    (whispering)\n\t\t\tWhat do you want from me?\n\n\t\t\t\t\tJEFFREY\n\t\t\t   (quietly, getting very hot)\n\t\t\tI . I don't know.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t    (whispering)\n\t\t\tWhat do you want?\n\nDorothy is getting very DREAMY and begins to talk in a childlike voice.  \nShe opens her robe and pulls Jeffrey to her breasts.\n\n\t\t\t\t\tDOROTHY\n\t\t\tDon't move. don't look at me.\n\nJeffrey's eyes close with nervous ecstasy as Dorothy begins touching him.\n\n\t\t\t\t\tDOROTHY\n\t\t\tDo you like that?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYes.\n\nHe tries to touch her.\n\n\t\t\t\t\tDOROTHY\n\t\t\tDon't move or I'll kill you.\n\nShe looks at him.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t   (continuing)\n\t\t\tDo you like talk like that?\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo.\n\n\t\t\t\t\tDOROTHY\n\t\t\tLie down on the bed.\n\nHe lies down.  He looks frightened.\n\nThere's a KNOCK, KNOCK on the door.  Dorothy looks VERY frightened.  She \nquickly moves a finger to her lips in a \"quiet\" sign and whispers to \nJeffrey.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t (whispers, frantic)\n\t\t\tShut up. Hurry! Go in the closet. Don't\n\t\t\tsay anything or you'll get killed. I mean\n\t\t\tit.\n\nKNOCKING is heard louder at the door.  Jeffrey picks up all his clothes \nand gets in the closet.  He's naked and hiding in the closet.  Dorothy \ncloses her robe and glides to the front door.\n\nJeffrey sees FRANK come in.\n\nFrank is medium height and stocky with a burr hair cut.  He is wearing a \ntight blue t-shirt and an old black sports jacket.  He's got on a pair of \nblue jeans and boots.  He has a raw, mean sexuality - a \"bomb about to go \noff\" - presence. \n\nHe comes into the room slowly, always looking at Dorothy.  He sits on the \ncouch.\n\n\t\t\t\t\tDOROTHY\n\t\t\tHello, baby.\n\n\t\t\t\t\tFRANK\n                      (annoyed, condescending)\n\t\t\tShut up. It's daddy. shithead.\n\n\t\t\t\t\tDOROTHY\n\t\t\tHello, daddy.\n\n\t\t\t\t\tFRANK\n\t\t\t  (can't-you-remember-\n\t\t\t   anything-attitude)\n\t\t\t. my bourbon.\n\nDorothy goes into the kitchen to get Frank his drink.  As she passes the \ncloset, Jeffrey can see the fear in her face.\n\nShe returns with a small glass of bourbon and hands it to Frank.  Frank \nsips on it.\n\n\t\t\t\t\tFRANK\n\t\t\t. sit down. get your chair.\n\nDorothy brings a small chair over from the wall and sits down.  She \nadjusts her robe.\n\n\t\t\t\t\tFRANK\n\t\t\t\t (studying her)\n\t\t\t. spread your legs.\n\nDorothy slowly spreads her legs.  She can see Jeffrey staring out of the \ndarkness of the closet at her.\n\n\t\t\t\t\tFRANK\n\t\t\twider.\n\nShe opens her legs wider.  Frank looks at her crotch and drinks his \nbourbon.  He stares at the floor for a moment, then slowly looks back at \nDorothy, her body - her crotch.\n\nDorothy looks up at the ceiling, waiting.  Frank suddenly reaches to his \nbelt, where he has a small canister and a mask.  He opens a valve on the \ncanister and places the mask over his nose and mouth.  The canister is \nfilled with helium, which makes Frank's voice very high and strange \nsounding.  The result is frightening.\n\n\t\t\t\t\tFRANK\n\t\t\t\t   (high voice)\n\t\t\t. mommy.\n\nDorothy jumps.  She keeps looking at the ceiling.\n\n\t\t\t\t\tFRANK\n\t\t\t   (continuing, with high voice)\n\t\t\t. MOMMY!.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t    (frightened)\n\t\t\t. mommy's here.\n\n\t\t\t\t\tFRANK\n\t\t\t\t  (high voice)\n\t\t\tBaby wants to fuck.\n\nThen, Frank's voice goes to normal.\n\n\t\t\t\t\tFRANK\n\t\t\t(normal voice, but loud - like\n    \t\t\t an army order to himself)\n\t\t\tGET READY TO FUCK!\n\nFrank goes to Dorothy and kneels down in front of her.  He takes one more \ngasp of helium.\n\n\t\t\t\t\tFRANK\n\t\t\t\t   (high voice)\n\t\t\tBaby wants blue velvet.\n\nDorothy opens her robe and gives a part of the robe to Frank.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t   (whispering)\n\t\t\tOkay.\n\nFrank slowly moves\n\nFrank slowly moves his mouth to the robe and runs his lips along the \ntexture of the velvet.  His hands rub the velvet and feel Dorothy's body \nunderneath.  His hands start feeling her breasts as he sucks and bites the \nvelvet robe.\n\nDorothy is very frightened but she is getting hot in spite of her fear.  \nThen Frank, in a sort of sickening way, pulls Dorothy down to rug.  He \nwarns her.\n\n\t\t\t\t\tFRANK\n\t\t\tDon't look at me!\n\nHe begins stuffing part of the robe into her mouth.  Then, he pushes her \narms back and she keeps them back, letting Frank have his way.  Frank \nsucks and bites the velvet coming out of her mouth, while he pinches and \nfeels her breasts in a strange, compulsive, timidly sickening way.  \nDorothy is moaning.  Frank is breathing very heavily. He feels her crotch.\n\n\t\t\t\t\tFRANK\n\t\t\tDon't look at me!!!\n\t\t\t     (heavy breathing)\n\t\t\tDaddy's home.\n\nHe starts stuffing the robe in his mouth now and he gets on top of Dorothy.\nHe starts humping her and pulling her nude body up and down him.  Faster \nand faster, then he has a climax in his pants.  Dorothy's head is falling \nback.  She can see Jeffrey blurred in the distance - in the closet.  \nCautiously, she looks sideways at Frank.\n\n\t\t\t\t\tFRANK\n\t\t\t\t    (screaming)\n\t\t\tDon't look at me!!!\n\nHe slugs her in the face.  His nose is running and he's stifling sobs from \ndeep within him.  On his hands and knees, he moves away.  The robe pulls \nout of his mouth.  His breathing is even heavier now.  He stands and \nbegins to move around the apartment.  He goes to a wall, turns off the \nlights, then turns and walks into the bathroom, all the while breathing \nbig, heavy breaths, trying to stop the crying.  Dorothy moans softly.\n\nIt gets very quiet and still for a moment.  Then, Jeffrey hears Frank \nwith his high helium voice talking to himself in the bathroom.  The high, \nstrange sound reverberates in the distance.  Jeffrey can't make it out - \nsoon, he hears Frank's high laughing.  Frank comes back into the living \nroom.  The mask is around his face.  All his breathing - every sound is \nhigh . He laughs a little and crosses the darkened room to the door.\n\n\t\t\t\t\tFRANK\n\t\t\tStay alive baby. See you next Christmas!\n\nFrank leaves and shuts the door.  The apartment is silent except for \nDorothy's moans.  \n\nJeffrey is stunned.  He doesn't move.  He watches Dorothy in the \nhalf-light.  She rolls over and starts crying.  The crying is deep and \ngenuine.\n\nSlowly, Jeffrey emerges from the closet and goes to her.  He bends down \nand touches her.  She flinches and turns to see him.  She turns back \nsobbing.  He tries to get her up.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWhy don't you come lie down. Come on, I'll\n\t\t\thelp you.\n\nShe struggles up with Jeffrey's help and he takes her over to the bed.  \nShe falls down on her side, turned toward the wall.  He covers her with \nthe sheet.\n\n\t\t\t\t\tDOROTHY\n\t\t\tDon't.\n\t\t\t    (referring to the sheet)\n\t\t\tI don't like that. What do you want?\n\n\t\t\t\t\tJEFFREY\n\t\t\tNothing. Are you alright?\n\n\t\t\t\t\tDOROTHY\n\t\t\tSure I'm alright.\n\t\t\t   (she starts crying again)\n\n\t\t\t\t\tJEFFREY\n\t\t\tI'll go then.\n\nHe starts to put on his underwear.  They're inside out.  He tries to turn \nthem around.\n\n\t\t\t\t\tDOROTHY\n\t\t\tDon?\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo.\n\n\t\t\t\t\tDOROTHY\n\t\t\tDon. Hold me. I'm scared. Hold me.\n\t\t\tPlease.\n\nJeffrey turns to her.  He studies her.  He reaches out and takes her \nshoulders.  He moves down and holds her.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t    (whispering)\n\t\t\tThank you. honey.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t    (whispering)\n\t\t\tIt's okay. It's okay.\n\nThey lie together for a long silent moment.\n\n\t\t\t\t\tDOROTHY\n\t\t\tDo you like the way I feel?\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t    (hesitates)\n\t\t\tYes.\n\n\t\t\t\t\tDOROTHY\n\t\t\tSee my breasts?  . See?\n\nJeffrey looks.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYes.\n\n\t\t\t\t\tDOROTHY\n\t\t\tSee my nipples?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYes.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t    (whispering)\n\t\t\tYou can kiss them if you want. Fell them\n\t\t\t. They're getting hard.\n\nJeffrey starts to move closer.  Dorothy closes her eyes.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t    (continuing)\n\t\t\tGo ahead. I don't mind.\n\nJeffrey can't help himself.  He licks and sucks her nipples and feels her \nbreasts.  They both are getting very hot.\n\n\t\t\t\t\tDOROTHY\n\t\t\tFeel me.\n\nJeffrey is all over her now.  Dorothy suddenly seems to recognize him.\n\n\t\t\t\t\tDOROTHY\n\t\t\tYou can hit me, if you want to.\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo. please. I won't.\n\nDorothy arches back and whining she throws her head back hard against the \nwall.\n\n\t\t\t\t\tJEFFREY\n\t\t\tStop it!\n\nShe moves and won't let him feel her anymore.  She holds his hands away.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t    (whispering)\n\t\t\tDo you like me?\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t    (whispering)\n\t\t\tYes, I like you.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t    (whispering)\n\t\t\tYou can be my special friend and come and\n\t\t\tput that in me.\n\nThey start making love.  Suddenly, Dorothy starts crying.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWhat's the matter?\n\nSuddenly Dorothy slaps Jeffrey in the face. very hard.\n\n\t\t\t\t\tDOROTHY\n\t\t\tGet off me.\n\nJeffrey gets off her, pressing his hand to his face.  Dorothy goes into \nthe bathroom crying all the way.  Jeffrey sits, confused.\n\nSuddenly Jeffrey hears a horrible scream from Dorothy.  A true scream of \nhorror.  He rushes into the bathroom to see what is wrong.\n\n92. INT. DOROTHY'S BATHROOM - NIGHT\n\nShe is just flushing something down the toilet.  The water SOUND rushes.  \nHe turns to her.  She is trembling and in a state of shock.\n\n\t\t\t\t\tDOROTHY\n\t\t\tI made it go down the toilet.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWhat?\n\nHe looks in the swirling water. It looks like an ear revolving around and \naround then whatever it is disappears.\n\n\t\t\t\t\tDOROTHY\n\t\t\tI made it go down the toilet.\n\nJeffrey looks up. he sees written with a bar of soap the words \"look down\" \non the mirror.\n\nHe looks down into the sink.  At the bottom he sees a small clot of blood \nand a smear of fresher blood.\n\nJeffrey suddenly remembers mentally Frank's high helium voice reverberating\nin the bathroom.\n\n93. INT. DOROTHY'S BATHROOM - NIGHT\n\nFLASHBACK\n\nFrank in bathroom.\n\n94. INT. DOROTHY'S APARTMENT - NIGHT\n\nFLASHBACK\n\nFrank at door saying \"see you next Christmas.\"\n\n95. INT. DOROTHY'S BATHROOM - NIGHT\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t   (inner voice)\n\t\t\tNext Christmas. Is he Santa Claus who has\n\t\t\tleft a present for Dorothy? What was it?\n\t\t\tAn ear? Another ear?!!\n\t\t\t\t(out loud, to Dorothy)\n\t\t\tWhat was it?\n\n\t\t\t\t\tDOROTHY\n\t\t\t(strangely - extremely frightened\n  \t\t\t now that Jeffrey may have left it)\n\t\t\tDo you know?\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo.\n\n\n\n\t\t\t\t\tDOROTHY\n\t\t\t  (breathing heavily, strangely)\n\t\t\tYou don't?\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo. What is happening?\n\n\t\t\t\t\tDOROTHY\n\t\t\tMaybe you don't know. I know you though.\n\t\t\tYou're Jeffrey Beaumont and I know where\n\t\t\tyou live and I know ways to get you and I\n\t\t\tknow ways to kill you.\n\n\t\t\t\t\tJEFFREY\n\t\t\tPlease don't talk like that. You're upset.\n\t\t\tI'm not helping you. I'm sorry for what I\n\t\t\tdid. I better go.\n\n\t\t\t\t\tDOROTHY\n\t\t\tGo then. I can't let you put it in me now\n\t\t\tbut I want you. I like you.\n\t\n\t\t\t\t\tJEFFREY\n\t\t\tThen don't talk about killing.\n\n\t\t\t\t\tDOROTHY\n\t\t\tDid I say that?. I didn't mean it. or did I?\n\t\t\t\t     (laughs)\n\t\t\tSometimes I think it would be fun.\n\t\t\t\t  (strange smile)\n\t\t\tGo ahead, you better leave now. I can't\n\t\t\topen myself to you now. I'll tell you a little\n\t\t\tsecret.\n\t\t\t\t  (she leans close)\n\t\t\tI want to die.\n\n\t\t\t\t\tJEFFREY\n\t\t\tDon't say that.\n\n\t\t\t\t\tDOROTHY\n\t\t\tIt's a secret so don't tell anyone. Some day\n\t\t\tI'll show you where. I've gotta go to sleep \n\t\t\tnow.\n\n\t\t\t\t\tJEFFREY\n\t\t\t (frightened by her craziness)\n\t\t\tO.K.\n\nHe takes another look at the blood in the bottom of the sink.  He takes \nanother look at the beautiful dark troubled eyes of Dorothy Vallens, and \nturns, goes through the hall to the living room.  He crosses slowly to the \ndoor, suddenly he turns back and enters the hallway going down to the \nbathroom.  He stops and looks at Dorothy who is turned away from him.  \nShe stares into the sink.  Jeffrey notices that a square of fabric has \nbeen cut from the bottom of her blue velvet robe\n\n\t\t\t\t\tJEFFREY\n\t\t\tI'm leaving now.\n\nShe is whispering something to herself.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t (very faint whisper)\n\t\t\tHelp me. help me. please help me.\n\nJeffrey doesn't know what he can do.\n\n96. INT. DOROTHY'S APARTMENT - NIGHT\n\nJeffrey turns back, goes through the living room.  He looks around and \nsees the empty bourbon glass of Frank's.  Suddenly he remembers the \nphotograph that Dorothy hid.  He picks up the pillow and sees a picture \nof a smiling man and a small boy standing next to him wearing a pointed \nhat with a propeller. He turns the photo over and finds an old marriage \nlicense.  It reads: Dorothy Vallens to Don.\n\n\t\t\t\t\tJEFFREY (V.O.)\n\t\t\tDon. Oh my God.\n\nHe hides the photo again.  He sees Dorothy's telephone.  He memorizes the \nnumber - moving his lips with each digit.  He goes to the front door and \nopens it quietly.\n\n97. EXT. STAIRWAY - APARTMENT BUILDING - NIGHT\n\nHe looks out into the hall.  It's empty.\n\n97A. INT. HALLWAY - APARTMENT BUILDING - NIGHT\n\nHe quickly goes to the back stairway and down the stairs.  These steps are \ncement and his feet make echoing sounds which seem very loud.  He goes \nthrough a door marked \"EXIT\".\n\n98. EXT. LINCOLN STREET - NIGHT\n\n. and comes out, crosses a lawn and goes out onto the sidewalk.\n\nHe walks along taking in deep cleansing breaths.  He looks at his watch.  \n2:30.  He feels so confused, exhilarated, so uneasy.  He secretly worries \nabout what he's gotten into.\n\n99. INT. BEAUMONTS' LIVING ROOM - NIGHT\n\nJeffrey enters the house. THE CAMERA RUSHES along the rug in the dark to a \nfoot.  The lights come on.  PAN UP the leg to Mrs. Beaumont waiting in a \nchair, staring.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t     (startled)\n\t\t\tGod. you scared me.\n\n\t\t\t\t\tMRS. BEAUMONT\n\t\t\tIs something wrong? What's happened to \n\t\t\tyour face?\n\n\t\t\t\t\tJEFFREY\n\t\t\tNothing. I'm fine.\n\n\t\t\t\t\tMRS. BEAUMONT\n\t\t\tYou can't just stay out half the night and\n\t\t\tcarry on, Jeffrey. There's got to be some\n\t\t\torder, Jeffrey. I thought it would have\n\t\t\tbeen nice to call your father when you got \n\t\t\thome but now it is much too late.\n\nFADE TO:\n\n100. INT. JEFFREY'S BEDROOM - DAY\n\nJeffrey gets out of bed and goes to the phone.  He dials a number.\n\n\t\t\t\t\tJEFFREY\n\t\t\tLouise Wertham, please. okay.\n\t\t\t\t\t(waits)\n\t\t\tLouise?. Jeffrey. Hi. What's up?\n\t\t\t\t\t(pause)\n\t\t\tMARRIED?! Good night! Louise! Are \n\t\t\tyou kidding?\n\t\t\t\t    (long pause)\n\t\t\tWell, Louise, I wish you a lot of\n\t\t\tluck and if things don't work out, \nI think you should go into comedy.\n\nJeffrey hangs up the phone hard.  He shakes his head.\n\n101. INT. BEAUMONTS' HARDWARE STORE - DAY\n\nJeffrey's drinking a cup of coffee behind the counter in the store.  \nHe thinks.  He takes another drink of coffee and sets the cup down.  \nHe clasps his hands behind his back and begins pacing up and down.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t(to himself, out loud)\n\t\t\tHow can I help her? I can't tell her to go\n\t\t\tto Detective Williams. She'll think I'm a\n\t\t\tpoliceman. She has my address. She can go\t\n\t\t\tthere. if she has to. I'll tell her. and \n\t\t\ther. and she thinks I'm Don. her husband?\n\t\t\tWhere the hell is Don? - maybe he died.\n\nJeffrey dials the phone.\n\n\t\t\t\t\tJEFFREY\n\t\t\tHello?. Mrs. Williams?. This is Jeffrey\n\t\t\tBeaumont. Fine. Okay. Is Sandy there? \n\t\t\tOkay. Hi Sandy. Can you talk? He is?.\n\t\t\tWell, I guess I'll talk to you later on.\n\t\t\tIt went okay. I'll tell you about it.\n\t\t\tDinner?. Tomorrow night? Seven o'clock,\n\t\t\tyeah, sounds good. Okay. he's still in\n\t\t\tthe hospital. Okay, yeah. See you \n\t\t\ttomorrow. thanks.\n\n102. INT. HOSPITAL LABORATORY - DAY\n\nThe searching, mysterious MUSIC plays over while,\n\nA DOCTOR is looking at various blood samples under a powerful microscope.  \nVarious sophisticated gadgets are seen in CLOSEUPS.\n\n\t\t\t\t\tJEFFREY (V.O.)\n\t\t\tThis is what my father's disease looks like?\n\n\t\t\t\t\tDR. GYNDE\n\t\t\tYes.\n\nThe BLOOD is seen in CLOSEUP. Cells are moving.\n\nThe Doctor makes a change in magnification.  The cells are huge - then, \neven bigger.  They are so big we can hear them moving.\n\n103. EXT. \"SLOW CLUB\" - NIGHT\n\nThe parking lot is half-full.  A strong wind is blowing trash around.  \nJeffrey parks his car.\n\n104. INT. \"SLOW CLUB\" - NIGHT\n\n. and enters the club. He speaks to the Maitre d'.\n\n\t\t\t\t\tJEFFREY\n\t\t\tA table in back, please.\n\n\t\t\t\t\tMAITRE D'\n\t\t\tCertainly\n\nDorothy is singing her opening song as the Maitre d' seats Jeffrey.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI'll have an ice-cold Heineken.\n\n\t\t\t\t\tMAITRE D'\n\t\t\tOne Heineken, certainly, sir.\n\nJeffrey surveys the place after the Maitre d' leaves.  It is very dark and \nsmoky inside.  He has trouble seeing, but suddenly he spots Frank sitting \nwith some other GUYS watching Dorothy sing.  They are sitting two tables \naway.\n\nFrank is totally captivated by Dorothy's singing and is very serious-\nlooking.  He looks right up to her eyes.  In his hand he works a small \npiece of blue velvet cloth with his fingers.  Again her first number, \n\"BLUE MOON,\" segues into \"BLUE VELVET.\"  This song she sings mainly to \nFrank.  When it is over Frank continues watching Dorothy and everyone else \napplauds loudly.\n\nJeffrey drinks up his Heineken and goes back outside.\n\nEXT. \"SLOW CLUB\" - NIGHT\n\nHe looks around at all the cars but none stand out as Frank's.  He gets \ninto his car and pulls out across the street, re-parks the car and waits.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n106. EXT. \"SLOW CLUB\" - NIGHT\n\nTraffic roars past Jeffrey and in the distance several people exit the \nSLOW CLUB.  Among them are Frank and his friends.  They get into a black \nFord Fairlane and drive out of the parking lot - down the highway.  \nJeffrey starts his engine and moves out after them.  He has to gun the car \nup to sixty-five to catch up with them.\n\n107. EXT. CITY STREETS - NIGHT\n\nThe mysterious MUSIC plays.\n\nHe follows them to an intersection where they turn off to the right.  \nHe waits at a light right behind them.  Inside they are lighting \ncigarettes.  The light turns green and Frank takes off.  Jeffrey follows \nthem through a dark area down by the docks.  He follows them up a narrow \nstreet through dark factories.\n\n108. EXT. FRONT STREET - NIGHT\n\nDark, low MUSIC now.\n\nUp ahead, Frank parks his car.  Jeffrey quickly pulls over and kills his \nlights and engine.  He watches Frank and his friends enter an old apartment\nbuilding next to a bookbinding factory.  They disappear within.  The \nelectric lines above buzz loudly.\n\nJeffrey gets out of his car and walks up the deserted street.  He reaches \nFrank's car which is making popping and clicking NOISES as it cools down.  \nHe looks at the license plates - walks a few paces ahead and then writes it\ndown in his notebook.  He continues on to the apartment building.\n\n109. \tINT. LOBBY - FRANK'S BUILDING - NIGHT\n\nInside he looks at the names on the mailboxes.  He sees a name - Frank \nBooth.  The name gives him the chills.  The apartment number is 26.\n\nIn the distance, he hears footsteps.  He quickly leaves.\n\n110. EXT. FRONT STREET - NIGHT\n\n. and crosses the street down to his car.  He gets in and waits.  Frank \ncomes out of the building and crosses to his car.\n\n\t\t\t\t\tJEFFREY\n\t\t\t     (out loud to himself)\n\t\t\tI'll bet I know where you're going.\n\nHe follows Frank as he pulls out.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n111. \tEXT. DINER PARKING LOT - NIGHT\n\nJeffrey discreetly parks just after Frank kills the engine on his car.  \nHe watches Frank leave the parking lot.\n\n112. EXT. VACANT FIELD - NIGHT\n\nHe follows Frank through the same vacant lot where he found the ear.  He \nseems to use the lot as a secret short cut to Dorothy's apartment.\n\n\n113. EXT. DINER PARKING LOT - NIGHT\n\nJeffrey goes back to his car to wait.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n114. EXT. DINER PARKING LOT - NIGHT\n\nA storm is building.  There is a roar of thunder as Frank slams his car \ndoor as he gets in.  His mouth twists into a smile as he guns the engine \nand leaves.  Jeffrey waits till Frank is safely gone.\n\n\t\t\t\t\tJEFFREY\n\t\t\t       (thinking out loud)\n\t\t\tI shouldn't go in. I shouldn't. but I'm\n\t\t\ttoo curious. and I have to try to help her.\n\nHe then gets out of his car as the wind is building.\n\n115. EXT. VACANT FIELD - NIGHT\n\n. and runs through the vacant lot.\n\n116. EXT. APARTMENT BUILDING - NIGHT\n\n. to Dorothy's building.\n\n117. INT. STAIRWAY - APARTMENT BUILDING - NIGHT\n\nHe goes up to the seventh floor and knocks twice on 710.  A moment passes, \nthen the door flies open.\n\nDorothy looks as if she was expecting Frank to be coming back.  Dorothy \nLOOKS BAD.\n\n\t\t\t\t\tJEFFREY\n\t\t\tHi. can I come in?\n\n\t\t\t\t\tDOROTHY\n\t\t\t  (looking around the hallway)\n\t\t\tYeah. hurry up though.\n\nThey go inside.\n\n118. INT. DOROTHY'S APARTMENT - NIGHT\n\n\t\t\t\t\tJEFFREY\n\t\t\tAre you alright?\n\nDorothy breaks down crying.\n\n\t\t\t\t\tDOROTHY\n\t\t\tNo. I'm not.\n\nJeffrey goes to her.\n\n\t\t\t\t\tDOROTHY\n\t\t\tWhy are you here. whatiya want?\n\n\n\t\t\t\t\tJEFFREY\n\t\t\t. I. uh.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t   (still crying)\n\t\t\tI looked for you in my closet tonight.\n\t\t\t\t  (a little laugh)\n\t\t\tIt's crazy, I don't know where you came\n\t\t\tfrom but. I like you.\n\n\t\t\t\t\tJEFFREY\n\t\t\tThat's not crazy. I like you too.\n\nDorothy looks up.  They stare at each other for some time.\n\n\t\t\t\t\tDOROTHY\n\t\t\tI liked being with you last night.\n\n\t\t\t\t\tJEFFREY\n\t\t\t. same here.\n\nThere is a loud knocking on the door.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t(she starts to stagger)\n\t\t\tOh shit.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t    (frightened)\n\t\t\tFrank? .can you stand up?\n\n\t\t\t\t\tDOROTHY\n\t\t\tI'm alright. go hide. This won't \n\t\t\ttake long. Be quiet.\n\nJeffrey gets in the closet and Dorothy closes the door.  She holds her \nhead collecting her fragile self.  Dorothy goes to the door and opens it.\nIt's the Man with the Yellow Sports Coat - tonight he's wearing a purple \nsports coat and light blue double knit pants.  His eyes are glazed and his \nface is broken out in a sweat.\n\n\t\t\t\t\tYELLOW MAN\n\t\t\tFrank gone?\n\n\t\t\t\t\tDOROTHY\n\t\t\tYeah. but get outta here. He's comin'\n\t\t\tback.\n\n\t\t\t\t\tYELLOW MAN\n\t\t\tBull.\n\n\t\t\t\t\tDOROTHY\n\t\t\tAlright, suit yourself.\n\n\t\t\t\t\tYELLOW MAN\n\t\t\tHe's comin' back?. What for?\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t     (shaking)\n\t\t\t'Cause he's comin' back, that's what for.\n\t\t\tFrank's got you really loaded tonight.\n\n\t\t\t\t\tYELLOW MAN\n\t\t\t\t    (getting upset)\n\t\t\tYeah, maybe so. Frank's got me. and you.\n\t\t\tand really it's all thanks to Don. isn't\n\t\t\tit. remember that. Your husband was the\n\t\t\tone who started fucking my mind with drugs.\n\n\t\t\t\t\tDOROTHY\n\t\t\tOh he forced you, huh?\n\n\t\t\t\t\tYELLOW MAN\n\t\t\tHe's the reformed dealer though who wanted\n\t\t\tto turn himself in. he's the one that caused\n\t\t\tFrank to come and Frank's fucking us real\n\t\t\tgood. I just feel so horny. I'm supposed to\n\t\t\tbe here watching you why can't I be here \n\t\t\tfucking you. Listen. I know his cock's the \n\t\t\tsize of a pin - let me give you the real \n\t\t\tthing. let me wet my whistle, baby.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t (cool, but real mad)\n\t\t\tNo way. get out. I'm gonna tell Frank.\n\t\t\tI'm gonna tell him what you said.\n\n\t\t\t\t\tYELLOW MAN\n\t\t\tOkay, I'm goin'. You'll see. I'll get you.\n\nDorothy kicks the door after he closes it, then she chains it.  Jeffrey \ncomes out of the closet.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t (talking softly)\n\t\t\tNice guy.  Who's he?\n\n\t\t\t\t\tDOROTHY\n\t\t\tWho's it, you mean.\n\nSUDDENLY, Dorothy starts to shake and cry.\n\nJeffrey grabs her and shakes her and holds her tight to him.  She starts \nsobbing again.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t    (continuing)\n\t\t\tOh God. Don!!! Why can't I just die.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t(quietly, soothing her)\n\t\t\tThere you go again. stop saying that.\n\t\t\tYou can make it.\n\n\t\t\t\t\tDOROTHY\n\t\t\tI can't. I can't. You think you know \n\t\t\tso much.\n\n\t\t\t\t\tJEFFREY\n\t\t\tTake it easy. What's goin' on anyway?.\n\t\t\tWhy are you in so much trouble?\n\nDorothy is sobbing and Jeffrey is holding her.  There is a long silence \nand she calms down.  \n\n\t\t\t\t\tDOROTHY\n\t\t\t\t   (whispering)\n\t\t\tI. don't. okay. Just don't. just be\n\t\t\twith me.\n\t\t\t\t(now very strangely)\n\t\t\tOh God. Come with me. Who are you.\n\t\t\tCome up here.\n\nDorothy takes Jeffrey through the kitchen and out the back.\n\n119. INT. BACK STAIRWAY - APARTMENT BUILDING - NIGHT\n\n. to a back stairway leading to the roof.\n\n120. EXT. ROOFTOP - APARTMENT BUILDING - NIGHT\n\nThe storm is closer and the dark clouds move violently in front of a full \nmoon.  The wind continues to moan.  They move to the roof top and Dorothy \nleads Jeffrey through the chimneys to the edge of the building.  A very \nsad forlorn version of \"Somewhere over the Rainbow\" - creeps through the \nwind.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t (as she stares down)\n\t\t\tLook.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t(turning to her quickly)\n\t\t\tNo.\n\n\t\t\t\t\tDOROTHY\n\t\t\t(continuing to look down, her\n    \t\t\t eyes widening - she whispers)\nFalling.\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo. Please, Dorothy. Why are you in so\n\t\t\tmuch trouble?\n\nHe moves closer to her.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t    (continuing)\n\t\t\tWho is Don?\n\n\t\t\t\t\tDOROTHY\n\t\t\t      (very crazy and angry)\n\t\t\tDon?. Are you in with them?\n\n\t\t\t\t\tJEFFREY\n                            (whispering)\n\t\t\tNo. But you're in very big trouble.\n\n\t\t\t\t\tDOROTHY\n\t\t\tWhy are you so interested? Why do you\n\t\t\tkeep asking me?\n\n\n\t\t\t\t\tJEFFREY\n\t\t\tI came back to help you. You said do I\n\t\t\tlet girls sneak into my house. You know\n\t\t\twhere I live. if you need to. come to \n\t\t\twhere I live. O.K.?\n\n\t\t\t\t\tDOROTHY\n\t\t\tWho are you? Maybe I'll need to. you like\n\t\t\tme, huh?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYes.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t    (whispering)\n\t\t\t. or do you just want me? I'm going to let\n\t\t\tyou enter me now.\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo. I should go.\n\n\t\t\t\t\tDOROTHY\n\t\t\tPlease. please stay.\n\nShe makes him kiss her. he really likes it.  Once again, Jeffrey and \nDorothy get VERY HOT.  Dorothy and Jeffrey lie down on the roof.  Dorothy \ncries out suddenly and bangs her head hard again and again against the \nroof.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWhy Dorothy?\n\nWe move very close to Jeffrey's ear as Dorothy's lips come up and whisper \ninto it.\n\n\t\t\t\t\tDOROTHY\n\t\t\tDon? I have to make it hurt. I want\n\t\t\tthere to be nothing again. Don!!!\n\t\t\t\t(as she slams her head \n        \t\t\t again and again)\n\nShe reaches up and clutches Jeffrey then pulls him down with a feverish \nkiss.  Lightening cracks above them and the wind howls.\n\nFADE TO WHITE:\n\nFADE DOWN TO:\n\n121. EXT. LINCOLN STREET - NIGHT\n\nJeffrey leaves the pool of light from a street light and walks into \ndarkness.  He continues down the sidewalk.  He looks up at the starry sky.\nThe stars are so far away - the feeling is cold and lonely.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n121A. \n\nDarkness: There are bell tones sounding, and as each one sounds pin points\nof light appear on Mr. Beaumonts distorted dream face.  He is trying to \nspeak.  He's trying to say \"Jeffrey.\"\n\n121B. \n\nAnother dark image appears.  A robin sits in a tree at night.  Very close.\nThere is a slow low reverberating chirping sound.\n\n121C.\n\nNow Dorothy's apartment building at night.  A very low angle looking up \nto the roof.  Suddenly a pinpoint of red appears coming toward us from \nthe roof.  It flies toward us very fast growing larger until we see it is \na red high-heeled shoe.  As it fills the screen it becomes red lips of \nDorothy's which open into a scream.\n\n121D.\n\nJeffrey wakes in his room - terrified.\n\n122. INT. BEAUMONTS' LIVING ROOM - NIGHT\n\nJeffrey is talking with Aunt Barbara in the semi-dark living room.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWill you tell Mom when she gets home from \n\t\t\tthe hospital that I've gone to dinner at\n\t\t\tSandy Williams' house?\n\n\t\t\t\t\tAUNT BARBARA\n\t\t\tOkay honey. that sounds nice. Jeffrey.\n\t\t\tI think you've got termites in the house.\n\n\t\t\t\t\tJEFFREY\n\t\t\tOh yeah?. Have you seen any?\n\n\t\t\t\t\tAUNT BARBARA\n\t\t\tI've seen a few.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWell, I haven't seen any. I wouldn't worry\n\t\t\tabout it. Look. I better go.\n\n\t\t\t\t\tAUNT BARBARA\n\t\t\tOkay honey.\n\nJeffrey leaves and Aunt Barbara moves about tapping on the walls.  She \nmoves into a dark area and taps.  Something falls.  She reaches down.\n\nIn EXTREME CLOSEUP we see a termite walking by her shoe on the thick \ncarpet.  Then in EXTREME CLOSEUP we see Aunt Barbara's fingers pinch the \ntermite and bring it up in front of her thick glasses for a look.  She \nlooks at the termite, then looks back at the walls.\n\nWe GLIDE ALONG the dark walls of the house.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n123. INT. WILLIAMS' DINING ROOM - NIGHT\n\nThey all sit around the dining room table.  They have their heads bowed \nin a prayer before dinner.\n\n\t\t\t\t\tSANDY\n\t\t\tWe thank you in the name of the Father, the\n\t\t\tSon, and the Holy Ghost. Amen.\n\nThey start passing food around.\n\n\t\t\t\t\tMIKE\n\t\t\tLike I was saying. if you toss the ball like\n\t\t\tthis, with your fingers just down here, that\n\t\t\tthing'll spin like a beauty. real straight.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\t\t\t  (teasing him)\n\t\t\tYeah? Then how come nobody caught anything\n\t\t\tlast week?.\n\n\t\t\t\t\tMIKE\n\t\t\t\t (not laughing)\n\t\t\t'Cause we had a bad day.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tYou play any sports, Jeffrey?\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo.\n\n\t\t\t\t\tMIKE\n\t\t\tLooks like you'd make a good runner.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWell.\n\n\t\t\t\t\tMIKE\n\t\t\tI mean, you don't exactly have the build\n\t\t\tfor a football. I mean. no offense.\n\nJeffrey looks around and sees Sandy looking at him.  She then gives a \nstern look to Mike.  Then Mike and Sandy both look at Jeffrey.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t   (not offended)\n\t\t\tNo. you're right.\n\n\t\t\t\t\tMIKE\n\t\t\tI mean. some guys play anyway but they\n\t\t\tusually get slaughtered.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah, well I never wanted to get \n\t\t\tslaughtered much.\n\n\t\t\t\t\tMIKE\n\t\t\t\t(not getting any humor)\n\t\t\tWell, most guys don't. I mean that's the\n\t\t\tpoint. You all mind if I take my vitamins?\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\tNo, Mike. but there are vitamins in the\n\t\t\tfood, you know.\n\nEveryone laughs.\n\n\t\t\t\t\tMIKE\n\t\t\tYeah, but I gotta supplement that. I gotta\n\t\t\ttake a bunch of zinc too. The body is like\n\t\t\ta machine. EVERYTHING has got to stay in \n\t\t\tperfect tune for perfect health. That's \n\t\t\twhat I'm interested in.\n\nSandy looks at Mike.\n\n\t\t\t\t\tMIKE\n\t\t\tOh yeah. and a few other things.\n\nEveryone laughs again.\n\n\t\t\t\t\tSANDY\n\t\t\tWe've got some Heinekens.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tYeah. I like Bud myself.\n\n\t\t\t\t\tSANDY\n\t\t\tI'll get it. Mike, whatiya want?\n\n\t\t\t\t\tMIKE\n\t\t\tI guess another glass of water.\n\nSandy and Jeffrey share a look.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n124. INT. WILLIAMS' BASEMENT - NIGHT\n\nMike and Sandy are sitting on a couch in the basement.  Jeffrey is sitting\non a chair nearby.  The television set is on.\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\t\t    (calling downstairs)\n\t\t\tWho wants dessert? It's blueberry pie. and\n\t\t\tice cream.\n\nJeffrey and Sandy say \"yes.\"\n\n\t\t\t\t\tMIKE\n\t\t\tNone for me, thanks.\n\nJeffrey looks over at Sandy.  Mike sees this.  There is more tension \ngrowing.\n\n\t\t\t\t\tMIKE\n\t\t\t\t (referring to T.V.)\n\t\t\tWhat are watchin' this junk for?\n\n\t\t\t\t\tSANDY\n\t\t\tYou can change it if you want to.\n\n\t\t\t\t\tMIKE\n\t\t\tI don't know why we have to watch T.V.\n\n\t\t\t\t\tSANDY\n\t\t\tMike. We don't have to watch it. Come\n\t\t\ton.\n\nMrs. Williams comes downstairs carrying a tray with dessert.\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\tHere you are. Would anyone like coffee?\n\n\t\t\t\t\tJEFFREY\n\t\t\tThat sounds great!\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\tAnyone else?. Alright Jeffrey, just a \n\t\t\tminute.\n\nMrs. Williams goes back upstairs.  Jeffrey and Sandy start eating their \ndessert.  Sandy watches Jeffrey happily wolf down his pie.  Mike stands up.\n\n\t\t\t\t\tMIKE\n\t\t\tI'll be right back.\n\nHe leaves as if he's going to go upstairs.  Once around the corner he \nstops and listens to see what Jeffery and Sandy will say to one another.\n\n\t\t\t\t\tSANDY\n\t\t\tWell, how did it go?. What happened?\n\n\t\t\t\t\tJEFFREY\n\t\t\tWell. I've found out some things.\n\t\t\tnothing really for certain. There are some\n\t\t\tstrange people involved.\n\n\t\t\t\t\tSANDY\n\t\t\tWhat did you see?\n\n\t\t\t\t\tJEFFREY\n\t\t\tWell.\n\t\t\t  (looking around, feeling funny)\n\t\t\tMaybe we should discuss this somewhere\n\t\t\telse. you know what I mean?\n\nJust then, Mrs. Williams starts down with the coffee for Jeffrey.  \nShe sees Mike at the bottom of the stairs.  This seems strange to her.\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\tMike?. Are you alright?\n\nMike starts upstairs.\n\n\t\t\t\t\tMIKE\n\t\t\t\t   (mumbling)\n\t\t\tYes.\n\nDownstairs, Jeffrey and Sandy hear that Mike was close by.  Mrs. Williams \nand Mike pass on the stairs and Mrs. Williams enters the basement.  She \nthrows Sandy a concerned look.  Just then, Mike calls downstairs.\n\n\n\t\t\t\t\tMIKE\n\t\t\tSandy?. Could I talk to you a minute?\n\n\t\t\t\t\tSANDY\n\t\t\t\t   (calling up)\n\t\t\tSure. just a sec.\n\t\t\t\t   (to Jeffrey)\n\t\t\tExcuse me.\n\n125. INT. WILLIAMS' LIVING ROOM - NIGHT\n\nUpstairs, Mike is by the front door.\n\n\t\t\t\t\tMIKE\n\t\t\tCome on out a minute, okay?\n\n\t\t\t\t\tSANDY\n\t\t\tOkay.\n\nThey leave.\n\n125A. INT. WILLIAMS' BASEMENT - NIGHT\n\nDownstairs Mrs. Williams picks up some dishes.\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\tPlease excuse me a moment, Jeffrey, and I'll\n\t\t\tget to the dishes.\n\n\t\t\t\t\tJEFFREY\n\t\t\tSure thing. please don't worry about me.\n\t\t\tCan I help you with the dishes?\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\tNice of you to offer, Jeffrey, but certainly\n\t\t\tnot. just relax and enjoy your coffee.\n\t\t\tI'm sure Sandy will be back soon.\n\nDetective Williams comes to the top of the stairs and calls down.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tJeffrey?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYes?\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tIf you want to come up a minute, I'll show\n\t\t\tyou some pictures.\n\n126. INT. DETECTIVE WILLIAMS' STUDY - NIGHT\n\nJeffrey enters Detective Williams' study.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\t\t\t   (continuing)\n\t\t\tTake a look at these. These are the photos\n\t\t\tof the vacant lot where you found the ear.\n\t\t\tYou might find them interesting.\n\n\nJeffrey begins going through the pictures.  They are 8 X 10 black and \nwhite prints.  Mostly they are pictures of weeds, but they look quite \nbeautiful in an abstract way.  As he goes through them.\n\n\t\t\t\t\tJEFFREY\n\t\t\tThese are beautiful. How's the case \n\t\t\tcoming?\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tOkay.\n\n\t\t\t\t\tJEFFREY\n\t\t\tAnything you can tell me?\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tThe criminals are winning.\n\n\t\t\t\t\tJEFFREY\n\t\t\tIs that why you say it's horrible?\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tYes.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI guess you've seen some bad things.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tYes I have - so bad I wouldn't poison\n\t\t\tyour mind by telling you.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWhy do you do it?\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tI won't let the bastards get me up against \n\t\t\tthe wall. It's an act of defiance.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah. I get it.\n\nSuddenly Jeffrey sees something in the black and white photos.  A piece \nof cloth in the grass.  Carefully he asks.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWhat is this? What color is it?\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\t\t     (leaning over to see)\n\t\t\tBlue. It's Blue Velvet.\n\nSandy comes into her father's study looking upset.  Detective Williams \nputs the photos away.\n\n\t\t\t\t\tSANDY\n\t\t\tCan I use the car for a while?\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tSure. What's up?\n\n\t\t\t\t\tSANDY\n\t\t\tI want to buy Jeffrey a Dairy Queen.\n\n\t\t\t\t\tJEFFREY\n\t\t\tA Dairy Queen?\n\t\t\t\t(he holds his stomach)\n\t\t\tOh yeah? Sure, that sounds great.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n127. INT. WILLIAMS CAR/NEIGHBORHOOD STREET - NIGHT\n\nJeffrey gets in and Sandy starts the car.  She pulls out.  They drive away.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWhat's with Mike?\n\n\t\t\t\t\tSANDY\n\t\t\tHe got a little jealous.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI'm sorry, I didn't.\n\n\t\t\t\t\tSANDY\n\t\t\tIt's okay. Don't worry about it.\n\nThe car glides along.\n\nJeffrey and Sandy smile at one another.  They drive on.\n\n\t\t\t\t\tSANDY\n\t\t\tYou want a Dairy Queen?\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo way. I'm about to blow up.\n\n128. INT. WILLIAMS CAR/CHURCH - NIGHT\n\nSandy laughs as she pulls the car curbside in a quiet street by a church.\nThe church pipe-organ music drifts softly into the night.\n\n\t\t\t\t\tSANDY\n\t\t\tYou want to tell me about it?\n\n\t\t\t\t\tJEFFREY\n\t\t\t. OK. It's a strange world, Sandy.\n\t\t\tthis is what I have found out. What I \n\t\t\tthink I have found out. Dorothy Vallens\n\t\t\tis married to a man named Don. they have\n\t\t\ta son. I think the son and the husband\n\t\t\thave been kidnapped by a man named \n\t\t\tFrank who has now cut off both of Don's \n\t\t\tears. I think he is holding them to make \n\t\t\ther do things for him. I think she wants \n\t\t\tto die. the ears were for her a warning \n\t\t\tto stay alive. there is another man \n\t\t\tinvolved. I call him the \"yellow man\".\n\t\t\tyou saw his back the other day in the hall \n\t\t\tat her door. I don't know what he does but \n\t\t\tI think he's on drugs supplied by Frank. \n\t\t\tFrank is a very dangerous man.\n\n\t\t\t\t\tSANDY\n\t\t\t\t    (quietly)\n\t\t\tWow. Should you tell my father?\n\n\t\t\t\t\tJEFFREY\n\t\t\tI don't see how I can. and I can't prove\n\t\t\tany of this. I got all this information\n\t\t\tillegally. also it could get you in\n\t\t\ttrouble.\n\n\t\t\t\t\tSANDY\n\t\t\tYou saw a lot in one night.\n\n\t\t\t\t\tJEFFREY\n\t\t\t. Actually. I've been in twice.\n\n\t\t\t\t\tSANDY\n\t\t\t\t     (uneasy)\n\t\t\tTwice. without her sensing anything?\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t\t(lying)\n\t\t\tYes.\n\n\t\t\t\t\tSANDY\n\t\t\t\t    (pausing)\n\t\t\tDid you see her undressed?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah. I mean. a little, . you know.\n\n\t\t\t\t\tSANDY\n\t\t\tYeah?\n\n\t\t\t\t\tJEFFREY\n\t\t\t    (a searching, slight smile)\n\t\t\tThat doesn't bother you, does it?\n\n\t\t\t\t\tSANDY\n\t\t\tWho, me? Why should it?\n\n\t\t\t\t\tJEFFREY\n\t\t\t     (seeing some jealousy and \n            \t\tand happy for it)\n\t\t\tThat's what I thought.\n\n\t\t\t\t\tSANDY\n\t\t\tYou're sure right. It is a strange world.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWhy are there people like Frank. Why is\n\t\t\tthere so much trouble in this world.?\n\n\n\t\t\t\t\tSANDY\n\t\t\tI don't know. I had a dream. in fact. the\n\t\t\tnight I met you.\n\t\t\t\t(she reflects silently on \n                         this before proceeding)\n\t\t\t. in the dream the world was dark because\n\t\t\tthere weren't any robins. you know, birds.\n\t\t\trobins stood for love. and all of a sudden\n\t\t\tthousands of robins flew down and brought\n\t\t\tthis blinding light of love. and it felt\n\t\t\tlike that love would be the only thing that\n\t\t\twould make any difference. I guess. until\n\t\t\tthe robins come there is trouble.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah I guess so.\n\t\t\t       (he turns to her)\n\t\t\tYou're a neat girl.\n\n\t\t\t\t\tSANDY\n\t\t\tSo are you.\n\t\t\t\t     (laughs)\n\t\t\tI mean you're a neat guy. We better\n\t\t\tget back.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI guess so. you want to help me watch\n\t\t\tFrank?. I'm going to stake out Frank's\n\t\t\tplace tomorrow. with a camera.\n\nSandy starts the car and pulls out into the street.  They begin driving \nback.\n\n129. INT. WILLIAMS CAR/NEIGHBORHOOD STREET - NIGHT\n\n\t\t\t\t\tSANDY\n\t\t\tNo, silly - I'm still in school you know.\n\t\t\tbut I'll meet you after school and you \n\t\t\tcan tell me what you've learned. You better\n\t\t\tbe careful, Jeffrey.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI will.  I'll pick you up on the same \n\t\t\tcorner at three thirty-five, okay?\n\nThey pull up in front of Jeffrey's house.\n\n\t\t\t\t\tSANDY\n\t\t\tOkay. be careful.\n\n\t\t\t\t\tJEFFREY\n\t\t\tOkay, Sandy.\n\n130. EXT. BEAUMONTS' HOME - NIGHT\n\nJeffrey gets out of the car.  He goes around to her side and looks down \nat her in the car.  She looks very beautiful.  He stands there for a \nmoment.\n\n\t\t\t\t\tJEFFREY\n\t\t\tCan I give you a kiss good night?\n\n\t\t\t\t\tSANDY\n\t\t\t\t(pauses, trembling)\n\t\t\tYou better not, Jeffrey.\n\n\t\t\t\t\tJEFFREY\n\t\t\tOkay. okay.\n\n\t\t\t\t\tSANDY\n\t\t\tGoodnight.\n\n\t\t\t\t\tJEFFREY\n\t\t\tSee ya tomorrow.\n\nSandy slowly drives off.  Jeffrey watches her go then turns and goes \ninside his house.\n\n131. INT. BEAUMONTS' LIVING ROOM - NIGHT\n\nThe house is very dark and quiet.  Jeffrey finds a note by the one table \nlight is on.  The note is from his mother.  It reads, \"Jeffrey hope you \nenjoyed yourself. See you at breakfast. Love Mom.\"  A postscript is written\non the note by Aunt Barbara.  \"Jeffrey, honey, I found these. Love, Aunt \nBarbara.\"  Jeffrey sees that Aunt Barbara has left him two dead termites.  \nHe picks one up and studies it.  Again we see a huge CLOSEUP of a termite \nin the half-light.  Jeffrey shakes his head in amusement.\n\n132. INT. JEFFREY'S ROOM - NIGHT\n\nJeffrey paces nervously.  He picks up the phone and mouthing the numbers \nhe dials Dorothy's number.  There is a \"click\" but no one speaks.  \nJeffrey instinctively speaks.\n\n\t\t\t\t\tJEFFREY\n\t\t\tHello?\n\n\t\t\t\t\tFRANK (telephone V.O.)\n\t\t\tSpeak to me Fucker.\n\nJeffrey hangs up immediately.  He's scared.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t   (to himself)\n\t\t\tStupid!! So stupid. now she might be in\n\t\t\teven more trouble with Frank. I hope not.\n\t\t\tI hope not. tomorrow I have to find out\n\t\t\tmore about Frank.\n\n133. INT. BEAUMONTS' CAR/FRONT STREET - DAY\n\nJeffrey has a camera taped and rigged to the dashboard aimed at the front \ndoor of Frank Booth's apartment building.  The camera is covered with a \ncardboard shoe box.  Jeffrey is eating a sandwich which was \nwrapped in wax paper and is waiting and watching.\n\nA LADY steps out of the building and begins walking down the steps.  \nJeffrey reaches over and removes the shoe box and quickly takes two \npictures.\n\n\nWe see a MAN walk down the street and turn up the steps.  Jeffrey shoots, \nbut really only gets the back of the man.\n\nJEFFREY\n\t\t\tDamn!\n\nHe replaces the cardboard box and continues eating.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n134. INT. BEAUMONTS' CAR/FRONT STREET - DAY\n\nLater in the day.  Jeffrey sits waiting.  He looks at his watch.  It says \n2:00.\n\nAs he looks up he sees Frank getting out of a car with another man. the \nYellow Man.  They head for Frank's building.  Jeffrey hurriedly removes \nthe shoe box and begins snapping pictures.  They mount the steps and \ndisappear within the old dark structure.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWow.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n135. INT. BEAUMONTS' CAR/FRONT STREET - DAY\n\nJeffrey's watch - the hand - time lapses around to 3:00.\n\n\t\t\t\t\tJEFFREY\n\t\t\t     (out loud to himself)\n\t\t\tFifteen more minutes.\n\nJust then, he sees movement and takes the box off the camera.  He starts \nshooting as TWO MEN come out the door.  It is the Yellow Man and a man who\nis very well dressed with wavy hair and a mustache.  He carries an \nalligator-skin briefcase FRANK HAS DISAPPEARED.  Both are talking together \nand now laughing.  Jeffrey takes five or six pictures and then tries to \ncover the camera as they approach.  The box falls.  The Yellow Man looks, \nbut Jeffrey gets the box back in time and pretends to be looking in the \nglove compartment.\n\nThe two men walk right by Jeffrey and get into the car behind his.  \nJeffrey decides to follow them.  He waits a few seconds and starts off.\n\n136. EXT. CITY STREET - DAY\n\nThey drive through town.\n\n137. FACTORY BUILDING - DAY\n\n. to a large factory building, park and go up a flight of metal stairs on the side of the building.  Jeffrey steps into the shadows and watches them.  At a metal landing they stop.  He sees them standing on their tip toes in order to see something in the distance.  The man with the alligator briefcase is laughing with the Yellow Man at what he sees.  He grips the Yellow Man on the shoulder.  Jeffrey cannot see what they see from his vintage point.  He looks at his watch. \"3:25\".\n\n\t\t\t\t\tJEFFREY\n\t\t\tYou gotta wait for me Sandy. I'm on a real roll.\n\nHe quickly takes a picture of the two of them on the staircase.\n\n138. EXT. ALLEY - DAY\n\n. then he goes down an alley in the direction they were looking.  At the \nend of the alley he turns left and stops short.\n\n139. EXT. COLD STORAGE COMPANY - DAY\n\nHe sees a crowd of people, an ambulance, and two police cars.  He walks \ncloser.  Through the crowd he sees a broken window.  Hanging in the window\nis a dead man.  Blood is dripping out of a huge wound to the head.\n\nOn the sidewalk in front of the building a woman is lying in shock.  \nHer legs have been brutally broken and are angled back toward her head \nin horrible positions.  Jeffrey stands next to two black guys.  Suddenly \none of the police officers start pushing everyone away.  Jeffrey turns to \nthem.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWhat happened?\n\n\t\t\t\t\tGUY #1\n\t\t\tHe was blown away man. can't you see?\n\n\t\t\t\t\tGUY #2\n\t\t\tThat cracker was the biggest dealer in \n\t\t\tthis section of the city, brother. the\n\t\t\tpolice are going to find more drugs in\n\t\t\tthere than you can believe. It's a \n\t\t\tspeedball heaven in there.\n\n\t\t\t\t\tJEFFREY\n\t\t\tOh yeah? What about the woman?\n\n\t\t\t\t\tGUY #1\n\t\t\tProbably just a whore he happened to be\n\t\t\twith at the time.\n\n\t\t\t\t\tJEFFREY\n\t\t\tMan oh brother.\n\n\t\t\t\t\tGUY #1\n\t\t\tThis is the way the world is my man. take\n\t\t\ta good look.\n\nJeffrey takes a last look before checking his watch and hurrying off.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n140. EXT. CENTRAL HIGH SCHOOL - DAY\n\nJeffrey drives up to the corner where Sandy is standing.  She is \nfrantically looking around.  Jeffrey stops for her.\n\n\t\t\t\t\tSANDY\n\t\t\t    (looking beyond the car)\n\t\t\tGO ON!!!. GO!\n\nJeffrey looks around.  A big FOOTBALL PLAYER is running up to a chain \nlink fence across the street, but it's too late - Mike sees Jeffrey.  \nEverything stops for a moment.  Then, Mike runs off.\n\n\t\t\t\t\tSANDY\n\t\t\tOh great.\n\n141. INT. BEAUMONTS' CAR/CENTRAL HIGH SCHOOL - DAY\n\nSandy goes around and gets in the car.\n\n\t\t\t\t\tSANDY\n\t\t\t\t   (continuing)\n\t\t\tYou were late.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI'm really sorry.\n\n\t\t\t\t\tSANDY\n\t\t\tWhat am I going to do?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYou want to go talk to him?\n\n\t\t\t\t\tSANDY\n\t\t\tYeah, but. I don't think it's going to do\n\t\t\tmuch good. Let's go. I'll try to talk to \n\t\t\thim later.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n142. INT. DINER - DAY\n\nJeffrey and Sandy are sitting in the diner in a different booth, but \nhaving the same things as before.\n\n\t\t\t\t\tSANDY\n\t\t\tYou know, that cheese is practically\n\t\t\tall chemicals.\n\n\t\t\t\t\tJEFFREY\n\t\t\tThat's what makes it so good. You wanta\n\t\t\thear what I saw today?\n\n\t\t\t\t\tSANDY\n\t\t\tShoot.\n\n\t\t\t\t\tJEFFREY\n\t\t\tNumber one. I saw the Yellow Man go into \n\t\t\tFrank's building, laughing with Frank.\n\t\t\tNow. the only trouble is. what does this\n\t\t\tprove?\n\n\t\t\t\t\tSANDY\n\t\t\t\t    (thinking)\n\t\t\tNothing really, but it's interesting.\n\t\t\tthey know each other. they seem to like\n\t\t\teach other.\n\n\n\n\t\t\t\t\tJEFFREY\n\t\t\tMaybe. But I think the Yellow Man is on \n\t\t\tdrugs. I think Frank supplies him.\n\n\t\t\t\t\tSANDY\n\t\t\tOh yeah?\n\n\t\t\t\t\tJEFFREY\n\t\t\tNumber two. I saw the Yellow Man come out.\n\t\t\tThis time with a well-dressed man with an\n\t\t\talligator briefcase. They drove down this\n\t\t\tfactory building and stood on a staircase\n\t\t\tlooking at something in the distance. \n\t\t\tNumber three. now get this. In the distance\n\t\t\twas a murder. a drug dealer shot to death\n\t\t\tand a woman with her legs broken.\n\n\t\t\t\t\tSANDY\n\t\t\tJeffrey!!\n\n\t\t\t\t\tJEFFREY\n\t\t\tThen these guys told me the police will\n\t\t\tfind a huge amount of drugs inside the \n\t\t\tdead man's place.\n\n\t\t\t\t\tSANDY\n\t\t\tI can't believe what you are finding out.\n\t\t\tAre you going to continue with this. Are\n\t\t\tyou going back to her apartment?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah.\n\n\t\t\t\t\tSANDY\n\t\t\tJeffrey?. Why?\n\n\t\t\t\t\tJEFFREY\n\t\t\tI'm seeing something that was always hidden.\n\t\t\tI'm involved in a mystery. I'm learning.\n\t\t\tand it's all secret.\n\n\t\t\t\t\tSANDY\n\t\t\tYou like mysteries that much?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah. you're a mystery. I like you.\n\t\t\tvery much.\n\nJeffrey stands up and moves to her side of the booth.  They stare at each \nother.\n\n\t\t\t\t\tSANDY\n\t\t\tOh yeah?\n\nJeffrey leans over and kisses her gently.  She pulls away.\n\n\t\t\t\t\tSANDY\n\t\t\tDon't. please, Jeffrey.\n\nJeffrey looks at her for a moment.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYou worry about me really?\n\n\t\t\t\t\tSANDY\n\t\t\tYes. is that so surprising?. Yeah I\n\t\t\tworry. a lot. I got you into this.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n143. INT. STAIRWAY - APARTMENT BUILDING - NIGHT\n\nJeffrey winds his way up the staircase of Dorothy's apartment building.  \nHe hesitates before crossing to Dorothy's door.  He knocks on the door and \nDorothy opens it.\n\n\t\t\t\t\tDOROTHY\n\t\t\tCome in.\n\n\t\t\t\t\tJEFFREY\n\t\t\tHello.\n\n144. INT. DOROTHY'S APARTMENT - NIGHT\n\nDorothy closes the door.  She chains it.\n\nThey kiss.  The kiss gets hotter.  The feeling begins.\n\nThey move down the hall to the back bedroom.  They've never made love \nthere.  As they hurriedly undress Jeffrey sees the pointed child's hat \nwith the propeller.  He picks it up and spins the propeller.  It makes a \nbit of music.  Dorothy shrieks as she lurches toward Jeffrey grabbing his \nhand, stopping him from turning the tiny propeller.  She gains some \ncontrol of herself.  Jeffrey releases the hat into her hand.\n\n\t\t\t\t\tDOROTHY\n\t\t\tIt used to make me laugh .but.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI'm sorry .maybe I better go Dorothy.\n\n\t\t\t\t\tDOROTHY\n\t\t\tYes. Frank-\n\n\t\t\t\t\tJEFFREY\n\t\t\tFrank is coming?\n\n\t\t\t\t\tDOROTHY\n\t\t\tNo. how could he?. Don't go. You think\n\t\t\tI'm crazy, don't you? I want you to stay.\n\t\t\t\t\t(crying)\n\t\t\t. don't hate me.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t   (very nervous)\n\t\t\tI sure don't hate you.\n\n\t\t\t\t\tDOROTHY\n\t\t\tI'm not crazy.\n\t\t\t\t     (thinking)\n\t\t\tI know the difference between right \n\t\t\tand wrong.\n\n\t\t\t\t\tJEFFREY\n\t\t\tThat's good.\n\nJeffrey moves to get out of bed.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t    (she poses)\n\t\t\tDo you like my body?\n\n\t\t\t\t\tJEFFREY\n\t\t\tSure I do.\n\nShe moves closer to him, towards his back touching it with her tongue.  \nShe gets down in a pose and holds it.\n\n\t\t\t\t\tDOROTHY\n\t\t\tI'm a statue. you can feel me.you\n\t\t\tcan do anything you want.\n\nJeffrey's hands find her flesh and move about.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nJeffrey and Dorothy are making love in her bed in almost total darkness.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t     (dreamily)\n\t\t\tWhat do you want to do?\n\n\t\t\t\t\tJEFFREY\n\t\t\tI'm doing it.\n\n\t\t\t\t\tDOROTHY\n\t\t\tAre you a bad boy?\n\n\t\t\t\t\tJEFFREY\n\t\t\tWhatiya mean?\n\n\t\t\t\t\tDOROTHY\n\t\t\tDo you want to do bad things?\n\t\t\t\t   (very dreamy)\n\t\t\tAnything. anything.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t  (whispering hot)\n\t\t\tWhat do you want?\n\n\t\t\t\t\tDOROTHY\n\t\t\tI want you to hurt me.\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo. I told you. I don't want to hurt you.\n\t\t\tI want to help you. I think I know some of\n\t\t\twhat is happening to you. \n\t\t\t\t  (she doesn't react)\n\t\t\t. Dorothy? Frank has your husband and son.\n\t\t\tDorothy? Doesn't he? You have to do \n\t\t\tsomething Dorothy. go to the police.\n\n\n\t\t\t\t\tDOROTHY\n\t\t\tNo police!!!.\n\t\t\t (pushing herself back against\n\t\t\t  the headboard; then frantic)\n\t\t\tNo police!!\n\nSuddenly, Dorothy gets very odd.  She turns into a little girl.  She has\na frightening little girl smile.\n\n\t\t\t\t\tDOROTHY\n\t\t\tYou like to open me. don't you?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYes.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t(thinking with a grin)\n\t\t\tWhat if I told Frank that you opened me?\n\nFor just one quiet moment we see the stairway to Dorothy's apartment.  \nIt is empty.  Then back to Jeffrey and Dorothy.\n\n\t\t\t\t\tJEFFREY\n\t\t\tThat wouldn't be too good, would it?\n\n\t\t\t\t\tDOROTHY\n\t\t\tFrank would open you.\n\n\t\t\t\t\tJEFFREY\n\t\t\tOkay. I know you've been scared. now you\n\t\t\twant to scare someone.\n\n\t\t\t\t\tDOROTHY\n\t\t\t    (smiles very strangely)\n\t\t\tDoes that scare you?\n\n\t\t\t\t\tJEFFREY\n\t\t\tShut up.\n\n\t\t\t\t\tDOROTHY\n\t\t\tBeeeee careful.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t  (scared and mad)\n\t\t\tCome on Dorothy.\n\n\t\t\t\t\tDOROTHY\n\t\t\tWhat if Frank came over here and found us?\n\nThe curtains in the kitchen bellow out with an eerie gust of wind.\n\n\t\t\t\t\tJEFFREY\n\t\t\tLook, snap out of it, will ya?\n\n\t\t\t\t\tDOROTHY\n\t\t\tKiss me.\n\nThey kiss.\n\n\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t    (continuing)\n\t\t\tDo you love me?\n\n\t\t\t\t\tJEFFREY\n\t\t\tDo you love me?\n\n\t\t\t\t\tDOROTHY\n\t\t\tI asked first.\n\n\t\t\t\t\tJEFFREY\n\t\t\tSometimes I think I do.\n\n\t\t\t\t\tDOROTHY\n\t\t\tAnd sometimes you think you don't?! Well,\n\t\t\tget away then!\n\nShe bolts up.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWait a minute. Wait. Whatiya want? For\n\t\t\tcryin' out loud!\n\n\t\t\t\t\tDOROTHY\n\t\t\tJust get outta my bed.\n\nShe hits out at Jeffrey and strikes him in the face.  Jeffrey struggles \nwith her to keep her from hitting him again but she breaks loose and slams\nout at his face again.  He pushes back hard and her head actually hits the\nwall.  She smiles through the pain.\n\n\t\t\t\t\tJEFFREY\n\t\t\tOh God. are you alright.\n\nShe falls on him and smothers him with kisses.\n\n\t\t\t\t\tDOROTHY\n\t\t\tSee. see how you hurt me? Now. Open\n\t\t\tme. enter me.\n\nJeffrey moves on top of her in the darkness.\n\nWe move very close to Jeffrey's ear as Dorothy's lips come up and whisper\ninto it.\n\n\t\t\t\t\tDOROTHY\n\t\t\tI love you Don with all my heart.\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo. it's not Don.\n\nBut he can't stop himself or her from making love.\n\n\t\t\t\t\tDOROTHY\n\t\t\tCome inside me. Oh yes, oh yes, oh yes.\n\t\t\t\t   (very frantic)\n\t\t\tOh yes, oh yes, oh yes.\n\nThe movement subsides.  There is silence in the room, except for breathing.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI didn't mean to hurt you.\n\n\t\t\t\t\tDOROTHY\n\t\t\tShhhhhh. Now I have your disease.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYou. what?\n\n\t\t\t\t\tDOROTHY\n\t\t\tYou put your disease in me. your semen.\n\t\t\tit's hot and full of disease.\n\n\t\t\t\t\tJEFFREY\n\t\t\tThere's no disease, I can tell you.\n\n\t\t\t\t\tDOROTHY\n\t\t\tMen are crazy. then they put their\n\t\t\tcraziness into me. then it makes me\n\t\t\tcrazy. then they aren't so crazy for\n\t\t\tawhile. then they put their craziness\n\t\t\tin me again.\n\t\t\t\t  (starts crying)\n\t\t\t. it's burning me. but I love you. I\n\t\t\tdo, I do. Did you know that? Did you\n\t\t\tknow that I love you?\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t (very apprehensive)\n\t\t\tI'm glad you do.\n\n\t\t\t\t\tDOROTHY\n\t\t\tThere's so much I want to tell you. I'm in\n\t\t\tso much darkness though with things moving.\n\t\t\tthere is darkness sucking me. It's kissing\n\t\t\tme and darkness is entering me. in every\n\t\t\thole. It's opening me to a death.\n\n\t\t\t\t\tJEFFREY\n\t\t\tDorothy. no!\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t    (whispering)\n\t\t\tIf I die, then they'll be free. It's \n\t\t\tgetting late, isn't it? I can tell. it's\n\t\t\ta cold feeling when it's late. It's warm\n\t\t\tthen it gets cold. Jeffrey. I feel it \n\t\t\tgetting cold.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYou called me Jeffrey.\n\n\t\t\t\t\tDOROTHY\n\t\t\tI did. are you?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYes.\n\n\t\t\t\t\tDOROTHY\n\t\t\tWhy are you here?\n\t\t\t\t(Jeffrey gets on top \n   \t\t\t\t of her again)\n\t\t\tHmmmmmmmm!!!! Ok.\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo. not really.\n\t\t\t     (they kiss - very hot)\n\t\t\tbut also because I really want you \n\t\t\tto be alright.\n\nDorothy stops and looks at him - she holds his face.  She starts to cry.\n\n\t\t\t\t\tDOROTHY\n\t\t\tYou do .you really do.\n\nShe continues holding his face - looking in his eyes crying openly.  \nhe pulls him down to her.\n\n\t\t\t\t\tDOROTHY\n\t\t\tJeffrey. Jeffrey. Jeffrey.\n\nJeffrey smiles.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI guess I should go.\n\n\t\t\t\t\tDOROTHY\n\t\t\tI want you to stay with me.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI think I better go.\n\n146. INT. DOROTHY'S APARTMENT - NIGHT\n\nLater.  Jeffrey is dressed and Dorothy comes out of the bathroom in her \nrobe.  She is combing her hair.  One or two lights are on now.  She looks \nat Jeffrey and smiles, brushes some of his hair back from his face.\n\n\t\t\t\t\tDOROTHY\n\t\t\tYou're my special friend, aren't you?\n\t\t\t\t     (whispers)\n\t\t\tI have you inside of me still.\n\t\t\t\t     (big smile)\n\t\t\tIt helps me. I need you.\n\nJeffrey doesn't know what to say.  He starts walking toward the door with \nDorothy beside him.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t\t(lying)\n\t\t\tI'll call you.\n\n\t\t\t\t\tDOROTHY\n\t\t\tOkay. soon? Do you think I'm too fat?\n\n\t\t\t\t\tJEFFREY\n\t\t\tWhat?\n\n\t\t\t\t\tDOROTHY\n\t\t\tI'm getting a little bit fat. I hate that.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYou look beautiful to me.\n\nShe pats her hips.\n\n\t\t\t\t\tDOROTHY\n\t\t\tRight in here. fat, fat, fat.\n\nDorothy takes the chain off the door and opens it.  The hall is empty.  \nThere is some noise on the stairs.  Suddenly, Frank and TWO FRIENDS of \nhis come into view on the stairway.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t    (to Dorothy)\n\t\t\tOh no.\n\n\t\t\t\t\tDOROTHY\n\t\t\t    (her eyes glaze over -\n        \t\t     she's gone again)\n\t\t\tNo. \n\t\t\t\t(calling out to Frank)\n\t\t\tHi baby.\n\n\t\t\t\t\tFRANK\n\t\t\tWho's this fuck?\n\n\t\t\t\t\tDOROTHY\n\t\t\tHe's a friend. from the neighborhood.\n\t\t\twe were just talking.\n\n\t\t\t\t\tFRANK\n\t\t\t\t   (to Jeffrey)\n\t\t\tFrom the neighborhood?\n\t\t\t\t     (slowly)\n\t\t\tShut the fuck up.\n\t\t\t\t   (to Jeffrey)\n\t\t\tYou like telephones? Huh?. You wanta go\n\t\t\tfor a ride?\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo thanks.\n\n\t\t\t\t\tFRANK\n\t\t\tNo thanks. what does that mean?\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t (very carefully)\n\t\t\tI don't want to go.\n\n\t\t\t\t\tFRANK\n\t\t\tGo where?\n\n\t\t\t\t\tJEFFREY\n\t\t\tOn a ride.\n\n\t\t\t\t\tFRANK\n\t\t\tA ride?. Hell, that's a good idea. okay,\n\t\t\tlet's go. Hey, let's go.\n\nFrank grabs Jeffrey and pulls him along.\n\n\t\t\t\t\tFRANK\n\t\t\t     (continuing to Dorothy)\n\t\t\tCome on. We're goin' for a joy ride.\n\n147. INT. STAIRWAY - APARTMENT BUILDING - NIGHT\n\nFrank takes Jeffrey on a wide-eyed terror walk down the stairway.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n148. INT. FRANK'S CAR/CITY STREETS - NIGHT\n\nFrank and Dorothy are in the front seat.  Jeffrey is sandwiched between \ntwo very dirty strange guys in the back.  Frank is driving very fast and \nvery crazy.  Sitting next to him on the front seat is a police radio which \nperiodically blares out police reports.  At the lights, when they turn \ngreen, Frank lays rubber.\n\n\t\t\t\t\tFRANK\n\t\t\tWhere you wanna go? I know!. We gotta see\n\t\t\tBen. We gotta, right?\n\n\t\t\t\t\tPAUL\n\t\t\t\t   (laughing)\n\t\t\tYeah. we gotta see Ben. \n\nThe car roars through a seedy street lined with bars and clubs.  Liquor \nand sex shop signs glow in hot neon colors.  They are blurred visions \nbecause of the speed of Frank's car.\n\nDriving music plays.\nFrank careens dangerously down various narrow streets, just barely making\nturns.  The Ford bounces off several curbs.  Dorothy occasionally steals \na glance back at Jeffrey.  She squeals out loud - sometimes with glee, \nmostly in fear.\n\nRaymond and Paul laugh with Frank, yell out or light cigarettes.\n\n149. EXT. \"BARBARY COAST\" - NIGHT\n\nFrank finally gets to where he's going - a corner bar - and skids to a \nhault.  They all pile out.  Frank grabs Jeffrey.\n\n\t\t\t\t\tFRANK\n\t\t\tCome on. I wancha to meet a frienda mine.\n\t\t\tRaymond, get enough beer for Ben too.\n\n\t\t\t\t\tRAYMOND\n\t\t\tOkay Frank.\n\n\t\t\t\t\tFRANK\n\t\t\t\t   (to Jeffrey)\n\t\t\tWhat kinda beer do you like?\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t   (just says it)\n\t\t\tHeineken.\n\n\t\t\t\t\tFRANK\n\t\t\tFUCK THAT SHIT. PABST BLUE RIBBON!!!\n\nHe grabs Jeffrey and pushes him into the bar.\n\n150. INT. \"BARBARY COAST\" - NIGHT\n\nMoving fast now, they go through this dark frightening place.  Frank has \nJeffrey by the neck forcing him faster.  In the back there is a black man \nfondling a white girl near a doorway.\n\n151. INT. BACK ROOM - \"BARBARY COAST\" - NIGHT\n\nThey go through the door to a back room.  A few naked girls are there near\nbeds with curtains around them.  One girl lies on her bed with dried vomit\naround her head and pillow.  Suddenly Frank spots his friend Willard.  \nHe runs toward him violently and grabs him by the throat.\n\n\t\t\t\t\tFRANK\n\t\t\tHey shithead. that's the last time I get\n\t\t\tyou high and watch you freak out - \n\t\t\tmotherfucker you tore my coat and I lost\n\t\t\tmy lucky piece of blue velvet, man.\n\n152. \tINT. DETECTIVE WILLIAMS' STUDY - NIGHT\n\nFLASHBACK\n\nto the black and white photo of a piece of cloth in the weeds in the \nvacant lot.\n\n\t\t\t\t\tJEFFREY (V.O.)\n\t\t\tWhat color is it?\n\n\t\t\t\t\tDETECTIVE WILLIAMS (V.O.)\n\t\t\tIt's blue. blue velvet.\n\n153. \tINT. BACK ROOM - \"BARBARY COAST\" - NIGHT\n\nRESUME GROUP\n\n\t\t\t\t\tWILLARD\n\t\t\tHey Frank I'm sorry buddy.\n\n\t\t\t\t\tFRANK\n\t\t\tYeah?. get ready for a love letter. \n\t\t\tWhen you least expect it.\n\n\t\t\t\t\tWILLARD\n\t\t\tFrank. please man.\n\n\t\t\t\t\tFRANK\n\t\t\tA big love letter.\n\nFrank pushes him down on the bed with the dried vomit whore.  They leave \nWillard.\n\n154. INT. STAIRS AND LANDING - BEN'S APARTMENT - NIGHT\n\n... and go up a flight of dirty wooden steps.  Frank bangs on a door at the \nfirst landing.  Raymond joins him with a case of Pabst Blue Ribbon Beer.\n\n\t\t\t\t\tFRANK\n\t\t\tHey Ben. OPEN UP. It's Frank.\n\nA tall, slender man with a smoking jacket and a mustache opens the door.  \nIt's BEN.  His voice is very horse from years of smoking.\n\n\t\t\t\t\tBEN\n\t\t\t\t(very gracious)\n\t\t\tFrank. Come in.\n\n\t\t\t\t\tFRANK\n\t\t\tHey, I brought some friends. and some\n\t\t\tbeer.\n\n\t\t\t\t\tBEN\n\t\t\tFine. Welcome. Come sit down.\n\n155. INT. BEN'S APARTMENT - NIGHT\n\nThe apartment is very large.  All the furniture is over-stuffed.  In \nthe room there is a very much over-weight WOMAN dressed in black and a \ngreasy-looking COUPLE.  On the couch, a YOUNG WOMAN plays with a large \ndoll.\n\n\t\t\t\t\tFRANK\n\t\t\t   (getting higher all the time)\n\t\t\tSuave. goddam are you suave, you fucker.\n\t\t\tYou want some beer?\n\n\t\t\t\t\tBEN\n\t\t\t\t    (smiling)\n\t\t\tCertainly Frank.\n\t\t\t\t (to the fat woman)\n\t\t\tDarling, get some glasses. We'll have \n\t\t\tsome beer with Frank. Won't you sit down?\n\nEveryone kinds of mills around.  Paul sits down in a chair and starts \nlaughing at some private joke in his head.\n\n\t\t\t\t\tFRANK\n\t\t\tShit Ben! How the shit are ya?\n\n\t\t\t\t\tBEN\n\t\t\tFine Frank. Fine. How are you?\n\n\t\t\t\t\tFRANK\n\t\t\tFuckin' good, real fuckin' good. You know\n\t\t\tthis little tid bit, Dorothy, and this thing, \n\t\t\there, (referring to Jeffrey) is a neighbor. \n\t\t\tWhat the shit we're doin' with a neighbor, I \n\t\t\tdon't know. goddam!!!(referring to Ben) This \n\t\t\tis the suavest guy I know. look at you. You're \n\t\t\tone beautiful fucker, Ben. I love this jacket\n\t\t\tand that cigarette holder of yours. shit, that\n\t\t\tis too fuckin' much. Where's those glasses. \n\t\t\tthis beer's gonna get too warm. I can't stand\n\t\t\tfuckin' warm beer. it makes me puke.\n\n\t\t\t\t\tBEN\n\t\t\tDarling, where are the glasses?. Oh.\n\t\t\there they are.\n\nThe Big Lady brings the glasses in and sets them on the card table.  \nShe looks worried.  She gives a helpless pleading look to Ben.\n\n\t\t\t\t\tFRANK\n\t\t\tRaymond! Where's the fuckin' beer?\n\n\t\t\t\t\tRAYMOND\n\t\t\tRight here Frank. You want me to pour it?\n\n\t\t\t\t\tFRANK\n\t\t\tNo, I want ya to fuck it. Shit, yes.\n\t\t\tpour the fuckin' beer.\n\n\t\t\t\t\tRAYMOND\n\t\t\tThere ya go.\n\n\t\t\t\t\tFRANK\n\t\t\tGood, let's drink up.\n\n\t\t\t\t\tBEN\n\t\t\tTo your health, Frank.\n\n\t\t\t\t\tFRANK\n\t\t\tShit. let's drink to something else.\n\t\t\tlet's drink to fuckin'. Say here's \n\t\t\tto your fuck Frank.\n\n\t\t\t\t\tBEN\n\t\t\tIf you like Frank. Here's to your fuck.\n\t\t\tcheers.\n\nFrank's friends, Paul and Raymod, laugh.\n\n\t\t\t\t\tFRANK\n\t\t\t\t  (laughs loud)\n\t\t\tCheers. Suave man. you're so fuckin'\n\t\t\tsuave. WE LOVE BEN! Here's to Ben!.\n\nFrank slaps Jeffrey in the face.\n\n\t\t\t\t\tFRANK\n\t\t\tHey neighbor. Here's to Ben.\n\n\t\t\t\t\tJEFFREY\n\t\t\t    (stunned, grabbing his face)\n\t\t\tHere's to Ben.\n\n\t\t\t\t\tFRANK\n\t\t\tDo you see, Ben?. I can make him do\n\t\t\tanything I fuckin' please.\n\nBen goes to Jeffrey.\n\n\t\t\t\t\tBEN\n\t\t\tThank you neighbor. let me see your\n\t\t\tface. did he hurt you?\n\nJeffrey shows him.\n\n\t\t\t\t\tBEN\n\t\t\t\t  (continuing)\n\t\t\tOh. my.\n\nSuddenly Ben slugs Jeffrey in the stomach.  Jeffrey doubles over.\n\n\t\t\t\t\tBEN\n\t\t\t\t(continuing again)\n\t\t\tIs that any better?\n\nFrank almost dies laughing.  Everyone else joins in.  Ben turns to Frank.\n\n\t\t\t\t\tBEN\n\t\t\tFrank, I have something for you. Excuse\n\t\t\tus everyone.\n\n\t\t\t\t\tFRANK\n\t\t\tEXCUSE US por favor! Hey. let Tits see\n\t\t\ther kid.\n\nAs Jeffrey tries to catch his breath, he sees tremendous emotion fill \nDorothy's face.  She rushes forward.  Raymond grabs her by the arm and \ntakes her into another room.  Jeffrey hears her crying out.  He hears a \nsmall boy.\n\n\t\t\t\t\tDOROTHY (V.O.)\n\t\t\tDonny, oh my Donny.\n\n\t\t\t\t\tDONNY (V.O.)\n\t\t\tMommy!\n\n155A. INT. BACK ROOM - BEN'S APARTMENT - NIGHT\n\nDorothy is sobbing and clinging to Donny.  He is crying and gripping her \nlike a small monkey would grip its mother.  Suddenly Donny breaks away, \nscreaming.\n\nDONNY\n\t\t\tMommy. You left me. you stopped loving me.\n\n\t\t\t\t\tFRANK\n\t\t\t  (coming back into Ben's living room)\n\t\t\tOkay. let's hit the fuckin' road. we're\n\t\t\tgivin' our neighbor a joy ride. let's get\n\t\t\ton with it. Bye, Ben. Ya wanna go on a \n\t\t\tjoy ride with us, anyone? You?\n\t\t\t\t (looking around)\n\nDorothy rejoins the group.  She's in a state of shock.  Frank pinches her\ncheek.\n\n\t\t\t\t\tFRANK\n\t\t\t\t   (continuing)\n\t\t\tNo smile for Frank? No? Okay, fuck it.\n\t\t\tLet's go. Oh you wanna come with Raymond?\n\nRaymond has picked up the greasy girl.\n\n\t\t\t\t\tBEN\n\t\t\tSee you Tuesday, Frank.\n\n\t\t\t\t\tFRANK\n\t\t\tRight Ben. LET'S GO FUCK. I'll fuck\n\t\t\tanything that moves.\n\n156. EXT. \"BARBARY COAST\" - NIGHT\n\nThey leave and pile back into the car.\n\n157. INT. FRANK'S CAR/CITY STREETS - NIGHT\n\nNow there are four in the back.  Raymond starts necking with the Greasy \nGirl.  They speed on into the night.  Frank drives through various dark \nstreets.\n\n158. INT. FRANK'S CAR/HIGHWAY - NIGHT\n\n. then out onto a highway and goes over 100 mph down a two-lane highway.\n\n\t\t\t\t\tFRANK\n\t\t\t\t   (to Jeffrey)\n\t\t\tHey? . You like to walk.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWhat?\n\n\t\t\t\t\tFRANK\n\t\t\tLet's take our neighbor out. Let him\n\t\t\tfuckin' walk back.\n\t\t\t\t     (laughs)\n\nAs Frank is driving Jeffrey sees Dorothy nervously look at the road and \nsurrounding countryside, then questioningly at Frank.  She senses something\nabout where they are going.\n\n\t\t\t\t\tDOROTHY\n\t\t\tWhere are we going, Frank?\n\n\t\t\t\t\tFRANK\n\t\t\tHey. Tits. I'm taking your neighbor to \n\t\t\tthe country. maybe something for you too.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t   (very anxious)\n\t\t\tFrank?\n\n\t\t\t\t\tFRANK\n\t\t\tYou want to see him too, right?\n\n\t\t\t\t\tDOROTHY\n\t\t\tYes, but.\n\n\t\t\t\t\tFRANK\n\t\t\tThen, shut up!\n\nFrank sees Dorothy look back at Jeffrey.\n\n\n\t\t\t\t\tFRANK\n\t\t\t\t   (continuing)\n\t\t\tHey. What's this fuck got to do with\n\t\t\tanything.\n\n159. INT. FRANK'S CAR/DIRT ROAD - NIGHT\n\nFrank angrily swerves the car off onto a small dirt road bouncing down \nit, screeching to a halt near an orchard of trees.  He turns violently \naround to Jeffrey.\n\n\t\t\t\t\tFRANK\n\t\t\tWhat are you lookin' at?\n\n\t\t\t\t\tJEFFREY\n\t\t\tNothing.\n\n\t\t\t\t\tFRANK\n\t\t\t   (locks eyes with Jeffrey; \n      \t\t    long pause)\n\t\t\tDon't look at me, Fuck. I shoot when I see\n\t\t\tthe whites of the eyes.\n\t\t\t\t(takes helium)\n\t\t\tYou like me?.\n\nJeffrey is quiet.\n\n\t\t\t\t\tFRANK\n\t\t\t\t (still high voice)\n\t\t\tLook at these. What are these?\n\n\t\t\t\t\tDOROTHY\n\t\t\tCome on, Frank. Let's go. Please.\n\nFrank is doing something to Dorothy's chest but Jeffrey can't see.\n\n\t\t\t\t\tFRANK\n\t\t\tDon't say PLEASE, Fuckhead. WHAT ARE\n\t\t\tTHESE?\n\n\t\t\t\t\tDOROTHY\n\t\t\tThose are my breasts.\n\n\t\t\t\t\tFRANK\n\t\t\tCan I feel 'em?\n\n\t\t\t\t\tDOROTHY\n\t\t\tIf you want to.\n\nFrank takes helium.\n\n\t\t\t\t\tFRANK\n\t\t\tBaby wants to pinch 'em.\n\nShe winces and tries to pull away.\n\n\t\t\t\t\tFRANK\n\t\t\t\t   (continuing)\n\t\t\tWhat's the matter? Give 'em back. They're\n\t\t\tjust a little red, that's all. let me feel\n\t\t\t'em again. Come here.\n\nFrank pulls her over and starts to pinch her again.  It really hurts her \nand she is frightened and in pain.\n\n\t\t\t\t\tJEFFREY\n\t\t\tHey. leave her alone.\n\nFrank pretends not to hear Jeffrey and pinches Dorothy's breasts real hard.\nShe stifles a scream.  Jeffrey gets mad.  He hits Frank hard in the face. \nEveryone is deadly silent as Frank turns to Jeffrey.  Frank stares at \nJeffrey.\n\n\t\t\t\t\tFRANK\n\t\t\tNEXT! . out of the car fuck. HELP HIM\n\t\t\tOUT, RAYMOND!!\n\n160. EXT. FRANK'S CAR/DIRT ROAD - NIGHT\n\nFrank gets out and presses his face against the rear window.  His distorted\nface is hideous.  He opens the back door.  Raymond and Paul grab Jeffrey \nand pull him out of the car.  The Greasy Girl laughs nervously.\n\n\t\t\t\t\tDOROTHY\n\t\t\tFrank. he didn't mean it. Leave him\n\t\t\talone. come on. He didn't mean it.\n\n\t\t\t\t\tFRANK\n\t\t\tShut up. Gimme your lipstick.\n\t\t\t\t    (takes gas)\n\t\t\t. Hey, pretty, pretty.\n\nDorothy doesn't move fast enough so Frank dumps her whole purse out on the\nfront seat and grabs the lipstick and a flashlight.  He puts lipstick \nheavy onto his lips.\n\nWhile Raymond and Paul hold Jeffrey.  Frank kisses Jeffrey all over the \nmouth.  Jeffrey tries to hit Frank and pull away, but Raymond and Paul \nhave a hold of him.  Jeffrey looks very strange with these big blotches \nof red lipstick on his face and mouth.\n\n\t\t\t\t\tDOROTHY\n\t\t\tLEAVE HIM ALONE!! FRANK!!\n\nFrank slams the front door shut to muffle Dorothy.  He grabs Jeffrey and \npresses his frightened face against the front window.  Then, the back \nwindow.  Then, he flops Jeffrey up on the hood with Paul's help and presses\nJeffrey's face against the rear window.  Inside the car, this show is \ncrazy and scary.  Then, Frank takes Jeffrey over to the side of the car \nagain.\n\n\t\t\t\t\tFRANK\n\t\t\t\t   (to Jeffrey)\n\t\t\tYou're fuckin' lucky to be alive.\n\t\t\tLOOK AT ME!\n\nRaymond pulls Jeffrey's face back so he's looking at Frank.  Dorothy and \nthe Greasy Girl watch in terror.\n\n\n\n\t\t\t\t\tFRANK\n\t\t\tDon't be a good neighbor to her or I'm \n\t\t\tgonna send you a love letter. straight\n\t\t\tfrom my heart, fucker. You know what a \n\t\t\tlove letter is? It's a bullet. straight\n\t\t\tfrom my gun, fucker. Once you get a love\n\t\t\tletter from me, you're fucked forever.\n\t\t\tUnderstand, Fuck?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYes.\n\n\t\t\t\t\tFRANK\n\t\t\tI'll send you straight to hell, Fuck!\n\nFrank takes a small square of blue velvet out of his pocket and begins \nfeeling Jeffrey's face with it.\n\n\t\t\t\t\tFRANK\n\t\t\t (continuing; breathing heavily)\n\t\t\tYou feel good. feel my muscles.\n\nRaymond makes Jeffrey raise his arm and Jeffrey feels Frank's biceps.\n\n\t\t\t\t\tFRANK\n\t\t\t\t  (continuing)\n\t\t\tYou like that? \n                     (to Raymond and Paul)\n\t\t\tHold him tight for me.\n\nSuddenly Frank starts hitting Jeffrey in the face.  Dorothy screams at the\ncar window.\n\nCUT TO BLACK:\n\n161. \tEXT. DIRT ROAD - DAY\n\nNO SOUND. THEN A MOAN.\n\nJEFFREY'S P.O.V. of rocks on the ground.\n\nHe slowly picks up and looks around.  The car is gone.  He is swollen, \nbloody, and covered with lipstick.  His pants have been pulled down and \n\"FUCK YOU\" has been written with lipstick on his legs.\n\nHe struggles to his feet and pulls his pants up.  He fastens his belt \nand begins limping up the dirt road highway.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n162. EXT. PHONE BOOTH - HIGHWAY - DAY\n\nJeffrey dials.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYellow Cab? Is this Yellow Cab? I need a \n\t\t\tcab. on Route 7.\n\t\t\t\t  (he looks around)\n\t\t\t. Just by Meadow Lane.\n\n\n163. INT. DOROTHY'S APARTMENT - NIGHT\n\nFLASHBACK\n\nJeffrey remembers Dorothy mentioning \"Meadow Lane\" on the phone.\n\n164. INT. FRANK'S CAR - NIGHT\n\nFLASHBACK\n\nJeffrey remembers Frank saying \"You want to see him too, right?\" and \nDorothy saying, \"Yes. but.\"\n\n165. EXT. PHONE BOOTH - HIGHWAY - DAY\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t    (continuing)\n\t\t\tMeadow Lane. There's a big Nehi sign.\n\t\t\tOkay. I'll wait, don't worry, . I've\n\t\t\tgot to get home, don't I?\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n166. INT. JEFFREY'S ROOM - DAY \n\nJeffrey is sleeping.  His face is swollen and bruised.  The clock says \n4:30 p.m.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n167. INT. JEFFREY'S ROOM - NIGHT\n\nThe clock says 1:30 a.m.  Jeffrey goes into the bathroom.  Looks at his \npuffed face and takes two aspirin.  He stumbles back to bed.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n168. INT. JEFFREY'S ROOM - DAY\n\nThe clock says 7:30 a.m. and Jeffrey gets up and stretches.\n\n\t\t\t\t\tJEFFREY\n\t\t\tOwww.\n\nHis muscles are very sore.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n169. INT. BEAUMONTS' KITCHEN - DAY\n\nAt the breakfast table.  Aunt Barbara and Mrs. Beaumont are staring at \nJeffrey.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI don't want to talk about it. Everything's\n\t\t\tokay now. I don't want to talk about it.\n\n\t\t\t\t\tAUNT BARBARA\n\t\t\tSometimes it helps to talk things over. \n\t\t\tfor instance, many marriages are saved by.\n\n\t\t\t\t\tJEFFREY\n\t\t\t    (interrupting, smiling\n        \t  \t     at Aunt Barbara)\n\t\t\tAunt Barbara. I love you, but you're not \n\t\t\tgonna get it.\n\nHe holds his fist up.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n170. JEFFREY'S ROOM - DAY\n\nJeffrey dials the phone.\n\n\t\t\t\t\tJEFFREY\n\t\t\tMrs. Williams? Hi, this is Jeffrey \n\t\t\tBeaumont. fine and you? Good. Is Sandy\n\t\t\tthere? Good, thanks. Sandy?. Can you\n\t\t\ttalk? Good. I'm through with this \n\t\t\tbusiness. I'll explain, but it got a \n\t\t\tlittle out of hand. I'm lucky to be\n\t\t\table to call you. anyway. I promise \n\t\t\tI'll tell you everything .How are you?\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n171. INT. SANDY'S BEDROOM - DAY\n\nSandy on her phone.\n\n\t\t\t\t\tSANDY\n\t\t\tWe broke up. No. It's okay. It's okay.\n\t\t\tJeffrey?. Jeffrey?. Hey, Jeffrey?.\n\t\t\tDo you want to go to a party with me\n\t\t\tFriday night?. He won't be there, don't\n\t\t\tworry. It'll be real nice. This Friday.\n\t\t\tYou don't dance? Well, I'll teach you,\n\t\t\tsilly.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n172. INT. JEFFREY'S ROOM - DAY\n\nJeffrey on his phone.\n\n\t\t\t\t\tJEFFREY\n\t\t\tGreat. Hey. I've got a bit of a\n\t\t\tproblem. I know some things. that\n\t\t\tcould help your father but you \n\t\t\tmight get into trouble.\n\nINT. SANDY'S BEDROOM - DAY\n\n\t\t\t\t\tSANDY\n\t\t\tJeffrey. are they important things?\n\t\t\tWell forget me - you have to tell \n\t\t\thim. Jeffrey. I mean it.\n\nINT. JEFFREY'S ROOM - DAY\n\n\n\t\t\t\t\tJEFFREY\n\t\t\tOk but I promise I won't mention you.\n\t\t\tOkay? .I'll see him at the police \n\t\t\tstation. okay? See you Friday night,\n\t\t\tif not before.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n173. INT. POLICE STATION - DAY\n\nJeffrey climbs the stairs up to Detective Williams' office.\n\n174. INT. ROOM 221 - POLICE STATION - DAY\n\nHe rounds the corner and steps inside the office, when he stops short with\nfear.  Detective Williams is not there, but sitting at a desk next to \nDetective Williams' desk is the Yellow Man.  Their eyes lock.\n\nJeffrey freezes.\n\n\t\t\t\t\tJEFFREY\n\t\t\tExcuse me.\n\nJeffrey turns away as quickly as possible and goes over to a water cooler\nand gets a drink, keeping his back to the Yellow Man.  He shakes with \nfear.  He slowly turns around.  The Yellow Man is studying some papers on\nhis desk.\n\nAgain the Yellow Man looks up.  This time he is slightly suspicious and he\ncooks his head.  Jeffrey cannot move.\n\nFinally, Jeffrey is able to step away.  As he leaves the Yellow Man's line\nof sight, Jeffrey catches the names on the door.\n\n\t\t\t\t\tDETECTIVES\n\t\t\t\t     J.R. WILLIAMS\n\t\t\t\t\t    AND\n\t\t\t\t\tT.R. GORDON\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t    (inner voice)\n\t\t\tGordon. Gordon. a police inspector.\n\t\t\twait a minute. wait a minute.\n\n175. EXT. COLD STORAGE COMPANY - DAY\n\nFLASHBACK\n\nJeffrey remembers the black guy saying: \"The police are going to find more\ndrugs in there than you can believe.\"\n\n\t\t\t\t\tJEFFREY\n\t\t\t    (continuing, inner voice)\n\t\t\tThe police. the police. Gordon.\n\n177. INT. BEN'S APARTMENT - NIGHT\n\nFLASHBACK\n\nJeffrey remembers Frank's voice in the distance: \"Gordon went right up \nto them - in broad daylight of course - 'cause he's the man, right? And \nhe took all those drugs away.\"\n\n178. INT. ROOM 221 - POLICE STATION - DAY\n\n\t\t\t\t\tJEFFREY\n\t\t\t     (continuing, inner voice)\n\t\t\tTook all those drugs away. Gordon\n\t\t\ttook those drugs away.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n179. EXT. WILLIAMS HOME - NIGHT\n\nJeffrey walks through the darkness, carrying the photos.  He stops in \nfront of Detective Williams' house and hesitates.  Jeffrey's face has a \ntroubled look.  He approaches the front door.\n\nHe hesitates again before finally knocking.  Detective Williams answers \nthe door.  Sandy is in the background.  When she sees the look on Jeffrey's\nface, she knows why he's there.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tJeffrey! Come on in.\n\n\t\t\t\t\tJEFFREY\n\t\t\tHi. Hi Sandy. I'm sorry to bother you,\n\t\t\tbut I've got to talk to you.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tOkay. come on in. Looks like you had a \n\t\t\tbad face lift.\n\n\t\t\t\t\tJEFFREY\n\t\t\t  (with a goofy smile to Sandy)\n\t\t\tYeah.\n\n180. INT. WILLIAMS' LIVING ROOM - NIGHT\n\nSandy gives him a concerned look.  Jeffrey follows Detective Williams to \nhis study.\n\n181. INT. DETECTIVE WILLIAMS STUDY - NIGHT\n\nHe closes the door behind him.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tOkay?\n\n\t\t\t\t\tJEFFREY\n\t\t\tOkay. I gotta tell you. I've. discovered\n\t\t\tsome things. .Anyway I have to show you\n\t\t\tsome pictures and tell you some things \n\t\t\tabout them. The first picture is this.\n\nHe shows him the picture of Frank and studies Detective Williams' face as \nhe sees it.\n\n\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t    (continuing)\n\t\t\tThis is Frank Booth. His address is on\n\t\t\tthe back of the photo. He, in my opinion,\n\t\t\tis very sick and dangerous. This photo \n\t\t\there is of Frank with another man as they\n\t\t\twent into Frank's apartment.\n\nJeffrey casually hands the photo over and watches Detective Williams' face \nextra carefully.  Detective Williams doesn't flinch, yet his eyes slowly \nglide upwards to meet Jeffrey's.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t    (continuing)\n\t\t\tAnd that man came out with a third man - \n\t\t\tthis well-dressed guy. here's the photo.\n\t\t\tI think a girl named Dorothy Vallens is\n\t\t\tin trouble with these people. I think\n\t\t\tFrank has taken her husband and her son.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t    (continuing)\n\t\t\tI have no hard proof of any of this. Her\n\t\t\taddress is also on the photos. I think\n\t\t\tthese people are involved with drugs. and\n\t\t\tmurder. I think Frank is killing drug\n\t\t\tdealers and.\n\t\t\t     (he decides not to tell Detective \n  \t\t\t\tWilliams everything)\n\t\t\t. and somehow Frank is getting all their\n\t\t\tdrugs. I had to tell you I got slightly\n\t\t\tmore involved in this than you wanted me\n\t\t\tto, but it's over now for sure. .I had to\n\t\t\ttell you about these things in case it \n\t\t\tcould help.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tWell now Jeffrey, how did you come to get\n\t\t\tso involved?\n\n\t\t\t\t\tJEFFREY\n\t\t\tI can't tell you the whole story. I. I\n\t\t\ttook it upon myself. I can't say more.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tIs Sandy part of this?\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo. not at all.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\t\t    (referring to the photos)\n\t\t\tWho knows you have these?\n\n\t\t\t\t\tJEFFREY\n\t\t\tOnly you. and the photo lab.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tYou're all through with this now?\n\n\n\t\t\t\t\tJEFFREY\n\t\t\tYes sir. I sure am.\n\nDetective Williams studies Jeffrey, then the photos.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tFor now. Alright. you better be. And\n\t\t\tSandy better not be involved with this,\n\t\t\tI can tell you. Be prepared to come in \n\t\t\tfor further interrogation on this later.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYes sir.\n\nJeffrey leaves the study.\n\n182. INT. WILLIAMS' LIVING ROOM - NIGHT\n\nIn the living room, Jeffrey looks at Sandy.\n\n\t\t\t\t\tSANDY\n\t\t\tEverything okay?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah. I think so. I just had to tell him\n\t\t\tsome of what I knew. Is Friday still on?\n\n\t\t\t\t\tSANDY\n\t\t\tYou didn't tell him about me?\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo.\n\nDetective Williams comes out of his study and sees the two of them talking.\nHe sees some nervousness.  Sandy quickly changes the subject.\n\n\t\t\t\t\tSANDY\n\t\t\tI should never had gotten you going on this.\n\t\t\t\t(changing, smiling)\n\t\t\tYes Jeffrey. Friday's on!\n\n\t\t\t\t\tJEFFREY\n\t\t\tOkay. great!\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n183. EXT. BEAUMONTS' FRONT LAWN - DAY\n\nJeffrey waters the flowers and bushes as his father had done.  His face\nlooks much better.\n\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n184. INT. HOSPITAL ROOM - DAY\n\nJeffrey sits and visits with his father.  His Mother and his Aunt Barbara are there too.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n185. INT. HOSPITAL LAB - DAY\n\nCLOSEUPS of cells moving - dark cells move in - the picture gets dark.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n186. EXT. WILLIAMS HOME - NIGHT\n\nJeffrey is driving over to Sandy's.\n\nHe has to park across the street because a police car is sitting in front\nof the Williams' house.  Its lights are slowly revolving on top. The engine\nidles. a Man is inside. his head down, studying some papers.\n\nJeffrey barely notices all this, as he heads for the door.\n\nMrs. Williams answers the door and Sandy is behind her in the dining room.\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\tHello, Jeffrey. Come in.\n\n187. INT. WILLIAMS' LIVING ROOM - NIGHT\n\nJeffrey enters and crosses the room to Sandy.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYou all set?\n\nDetective Williams comes in arranging some papers which he begins placing\nin a briefcase on the dining room table.  Just then a man comes up to the\ndoor which is still open.  Jeffrey turns to see.  It is Detective \nT.R. Gordon, the Yellow Man.  All the color instantly drains from \nJeffrey's face.\n\n\t\t\t\t\tYELLOW MAN\n\t\t\t\t    (yelling inside)\n\t\t\tHey John - get a move on!!\n\nDetective Williams turns.  He sees Detective Gordon.  He turns again.  He \nsees Jeffrey's expression.  Sandy hasn't seen it yet.\n\nDetective Williams goes to Jeffrey.  He looks him straight in the eye.  He\nalso positions himself between Jeffrey and T.R. Gordon.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tEasy does it Jeffrey. Behave yourself.\n\t\t\tdon't blow it.\n\nSandy becomes curious and moves over to Jeffrey and her father.  Jeffrey \ndecides to trust Detective Williams.  The Yellow Man (T.R. Gordon) yells \nagain.\n\n\t\t\t\t\tYELLOW MAN\n\t\t\tCome on John, get it in gear pal!\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tSo long Jeffrey. You two have a nice\n\t\t\tnight, okay?\n\n\n\t\t\t\t\tJEFFREY\n\t\t\tOkay.\n\n\t\t\t\t\tSANDY\n\t\t\tWhat is it?\n\n\t\t\t\t\tJEFFREY\n\t\t\tJust some fatherly advice.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tThat's right.\n\nJeffrey and Sandy head for the door.  The Yellow Man's and Jeffrey's eyes\nmeet once more.  The Yellow Man cocks his head. thinking.  No recognition.\n\n\t\t\t\t\tSANDY\n\t\t\t\t (to her mother)\n\t\t\tGoodnight mom.\n\t\t\t     (to the Yellow Man)\n\t\t\tGoodnight Tom.\n\n\t\t\t\t\tT.R. GORDON-YELLOW MAN\n\t\t\tGoodnight, Sandy.\n\n188. EXT. WILLIAMS HOME - NIGHT\n\nThey cross the yard to the car.  Jeffrey helps Sandy in, then goes around\nand gets in himself.  They are both dressed very nicely.\n\n189. INT. BEAUMONTS' CAR/NEIGHBORHOOD STREET - NIGHT\n\nJeffrey starts the car and pulls out.\n\n\t\t\t\t\tSANDY\n\t\t\tWhat was that all about?\n\n\t\t\t\t\tJEFFREY\n\t\t\tNothing. really! It's good to see you.\n\n\t\t\t\t\tSANDY\n\t\t\tIt's good to see you.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWhere to?\n\n\t\t\t\t\tSANDY\n\t\t\tJust go over to Gelford and up to Vista.\n\t\t\tIt's not far. Can you tell me any more\n\t\t\tabout what you learned?\n\n\t\t\t\t\tJEFFREY\n\t\t\tI'd rather not talk about it. I'll tell\n\t\t\tyou about it sometime.\n\n\t\t\t\t\tSANDY\n\t\t\tIt's okay.\n\n\t\t\t\t\tJEFFREY\n\t\t\t... You look beautiful.\n\n\t\t\t\t\tSANDY\n\t\t\tThank you. Whatiya say we just enjoy the \n\t\t\tevening?\n\n\t\t\t\t\tJEFFREY\n\t\t\tI like that idea. that's a real good idea.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n190. INT. PARTY BASEMENT - NIGHT\n\nJeffrey and Sandy go downstairs to a basement which is dark and crowded \nwith kids dancing and talking.  Jeffrey and Sandy are holding hands.  \nJeffrey feels a little out of place.\n\nA COUPLE OF GIRLS raise their eyebrows and give approving looks to Sandy.\nThe music is loud, fast dancing music.\n\n\t\t\t\t\tSANDY\n\t\t\tYou want to dance?\n\n\t\t\t\t\tJEFFREY\n\t\t\tI can't dance fast.\n\n\t\t\t\t\tSANDY\n\t\t\tReally?\n\n\t\t\t\t\tJEFFREY\n\t\t\tReally. you want to dance with someone\n\t\t\telse?\n\n\t\t\t\t\tSANDY\n\t\t\tNO.\n\n\t\t\t\t\tJEFFREY\n\t\t\tLet's wait for some slow one.\n\n\t\t\t\t\tSANDY\n\t\t\tJust a minute.\n\nSandy leaves Jeffrey for a moment and Jeffrey watches her make her way \nthrough the crowd to a GIRL by the record player.  Sandy confers with the\ngirl.  Sandy comes back to Jeffrey.\n\n\t\t\t\t\tSANDY\n\t\t\tDon't worry. I took care of it. You\n\t\t\twant something to drink?\n\nJust then, the music goes slow.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYou want to dance?\n\n\t\t\t\t\tSANDY\n\t\t\tOkay.\n\nThey begin to dance.  At first, further apart, then, they make the mistake\nof looking in each other's eyes and they move very close together.  \nThey move around to another look.  Then they kiss.  They kiss for the \nentire rest of the song.  Between songs and during the entire next song.  \nThey finally, as they say, come up for air.\n\n\t\t\t\t\tSANDY\n\t\t\tI love you, Jeffrey.\n\nThey kiss again.  Then they dance and look at each other.  Then they hug\neach other.  As they hug, Jeffrey closes his eyes.\n\n\t\t\t\t\tJEFFREY\n\t\t               (inner voice)\n\t\t\tI really do love you.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n191. INT. PARTY BASEMENT - NIGHT\n\nLater.  Jeffrey gives Sandy a little kiss while they're over by the cokes.  They're having a drink.  Sandy introduces Jeffrey to some of her friends.  She is very proud of him.  They are both very happy.  They look at each other and kiss again.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n193. INT./EXT. PARTY HOUSE - NIGHT\n\nLater.  The party is breaking up.  Kids are beginning to go upstairs and go out the front doors to their cars.  Jeffrey and Sandy are coming up stairs arm in arm.  They say goodnight to the PARENTS in the living room and leave through the front door.  They can't take their eyes off one another.  They are totally oblivious to the THREE GUYS in a car across the street.\n\nAs soon as Jeffrey gets Sandy and himself in his car, he starts it and moves off.  \n\n194. INT. BEAUMONTS' CAR/NEIGHBORHOOD STREETS - NIGHT\n\nThe dark car comes to life with a loud low roar and peels out with a \nscream.  It follows Jeffrey and Sandy for a way, then it roars up behind \nthem swaying back and forth, honking its horn and trying to ram Jeffrey's \ncar in the rear.\n\nJeffrey looks frantically in the rear view mirror.  Sandy turns around in\nfear.  Jeffrey guns his car and races down the street.\n\n\t\t\t\t\tSANDY\n\t\t\tOh my God. What's wrong?\n\n\t\t\t\t\tJEFFREY\n\t\t\tFrank!!\n\nHe swerves around the corner.  Up ahead, a car is pulling out of a \ndriveway.\n\n\t\t\t\t\tJEFFREY\n                     (continuing; referring \n                      to the car ahead)\n\t\t\tCome on. MOVE IT!\n\nJeffrey swings hard around another corner and heads up a dark street, \npassing \"Lincoln St.\"\n\n\t\t\t\t\tJEFFREY\n\t\t\tI can't outrun this guy.\n\nHe floors the car and flies down another street very fast.\n\n\t\t\t\t\tJEFFREY\n\t\t\tMy father has a gun at home.\n\n\t\t\t\t\tSANDY\n\t\t\tNo.\n\n\t\t\t\t\tJEFFREY\n\t\t\tSandy. this guy is a killer!! I promise\n\t\t\tyou.\n\nSandy turns back to take a look.  Jeffrey swerves the car again; he bangs\nit off a curb as he rounds a corner.  A hub cap goes flying off rolling\nnoisily down the street.\n\n\t\t\t\t\tSANDY\n\t\t\tTry to get to my house. then my father\n\t\t\tcan.\n\nCLOSEUP ON JEFFREY\n\n195. INT. WILLIAMS' LIVING ROOM - NIGHT\n\nFLASHBACK\n\nHe remembers Detective Gordon, the Yellow Man, at Sandy's house.\n\n196. INT. BEAUMONTS' CAR/NEIGHBORHOOD STREETS - NIGHT\n\n\t\t\t\t\tJEFFREY\n\t\t\tNo!!\n\nJeffrey floors the car again. but the car behind him is fast and gains \non him.  It swerves back and forth in the rear view mirror.  Now it \nswerves and roars up alongside Jeffrey's car.  Sandy screams.\n\n\t\t\t\t\tSANDY\n\t\t\tIt's Mike! It's Mike!\n\nJeffrey looks over.  It is Mike.  Out of enormous sense of relief he \nstarts laughing.  He slows instantly and so does Mike.\n\n197. EXT. BEAUMONTS' HOME - NIGHT\n\nHe pulls slowly up in front of his house, his head back laughing.  Mike \nswerves his car in front of Jeffrey's and jumps out.\n\n\t\t\t\t\tMIKE\n\t\t\t\t(out of the car; very drunk)\n\t\t\tHey come here, you stole my girl, you\n\t\t\tbastard. I'm gonna kick your ass, right\n\t\t\tin front of your stupid house.\n\n\t\t\t\t\tSANDY\n\t\t\t... Stop it Mike.\n\n\n\t\t\t\t\tMIKE\n                           (to Sandy)\n\t\t\tYou shut up. nobody's talkin' to you.\n\t\t\tHey who's that Jeffrey? Your mother?\n\nEveryone turns and looks.  Slowly out of the darkness comes a nude woman.  It is Dorothy.  She is totally in shock, bloody saliva is dripping from her mouth.  She is bloody, swollen and bruised all over.  She is totally different, drained of her sexuality.  She has been ravaged.\n\n\t\t\t\t\tJEFFREY\n\t\t\tDorothy! ... Dorothy!\n\n\t\t\t\t\tSANDY\n\t\t\tDorothy Vallens?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYes.\n\nHe jumps out of the car, gets a hold of her and helps her back.  Mike \ncomes after him.\n\n\t\t\t\t\tMIKE\n                        (going for Jeffrey)\n\t\t\tHey, you ivy league shit. COME HERE!\n\n\t\t\t\t\tJEFFREY\n\t                  (pushing Mike off)\n\t\t\tLater Mike. I gotta take care of someone\n\t\t\twho's hurt here, in case you haven't \n\t\t\tnoticed.\n\n\t\t\t\t\tSANDY\n\t\t\tMike, go home.\n\nMike's friends are dazed, watching Dorothy staggering beside Jeffrey.  \nMike steps back as Jeffrey puts Dorothy in the car.  Jeffrey stands back\nup and glances at Mike.\n\n\t\t\t\t\tMIKE\n                       (dull, very drunk)\n\t\t\tHey, I'm sorry. Hey.\n\nJeffrey gets into the car.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah. okay, Mike.\n\nJeffrey shuts the door.  Dorothy is sandwiched between him and Sandy in \nthe front seat.\n\n\t\t\t\t\tSANDY\n\t\t\tTake her to my house. My dad can get an\n\t\t\tambulance faster than anyone. Do you have\n\t\t\tanything to put around her?\n\n\t\t\t\t\tJEFFREY\n     \t\t\t\t  (starts the car)\n\t\t\tNo. Is Detective Gordon going to be at\n\t\t\tyour house?\n\n\t\t\t\t\tSANDY\n\t\t\tProbably not. no. Why?\n\n\t\t\t\t\tJEFFREY\n\t\t\tOK. Let's get her over to your father's.\n\n\t\t\t\t\tSANDY\n                   (looking quickly from \n                    Dorothy to Jeffrey)\n\t\t\tRight. Watch out for Mike, there.\n\nMike and his friends are getting in Mike's car.  Mike is trying to start \nthe engine.  He does and clumsily throws the car in reverse.  He screeches\nout and screeches to a stop.  Then he guns away forward and shoots crazily\ndown the road.\n\n\t\t\t\t\tJEFFREY\n\t\t\tHere we go.\n\nThey drive off.\n\n198. INT. BEAUMONTS' CAR/NEIGHBORHOOD STREET - NIGHT\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t   (looking over)\n\t\t\tOh God. Jeffrey is that you?\n\nSandy looks at Jeffrey questioningly.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah, it's me.\n\n\t\t\t\t\tDOROTHY\n\t\t\tOh God, Jeffrey. is that you? Oh God.\n\nSandy is confused. how do they know each other?\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n199. EXT. WILLIAMS' HOUSE - NIGHT\n\nJeffrey and Sandy take Dorothy up the walk.  Sandy opens the door.\n\n200. INT. WILLIAMS' LIVING ROOM - NIGHT\n\nThey enter the living room.  Mrs. Williams comes in from the kitchen.\n\n\t\t\t\t\tSANDY\n\t\t\t   \t    (hurrying)\n\t\t\tIs Dad home?\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\t\t    (shocked at sight)\n\t\t\tNo.\n\n\t\t\t\t\tSANDY\n\t\t\tYou better call him and get an ambulance\n\t\t\ttoo.\n\nDorothy is clinging to Jeffrey.  Mrs. Williams goes to call.\n\nSandy moves closer.  Jeffrey looks at Sandy and she returns the look.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t      (crazy)\n\t\t\tWhere have you been?\n\t\t\t\t     (screams)\n\t\t\tOh God. they hurt him, Jeffrey. Jeffrey,\n\t\t\tJeffrey, Jeffrey, hold me. HOLD ME. \n\t\t\tOh God.\n\n\t\t\t\t\tJEFFREY\n\t\t\tIt's okay. it's okay.\n\n\t\t\t\t\tDOROTHY\n                        (like a little girl)\n\t\t\tMy secret lover.\n\nMrs. Williams comes in.\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\tThe ambulance will be here in a minute. \n\t\t\tI left word for John. The police are on \n\t\t\ttheir way.\n\n\t\t\t\t\tDOROTHY\n                             (screams)\n\t\t\tDon't get the police. Oh God, ...Jeffrey\n\t\t\tI CAN'T STAND IT!! STOP IT. STOP IT.\n\t\t\tLOVE ME,\n\nShe looks up at Mrs. Williams.\n\n\t\t\t\t\tDOROTHY\n                            (continuing)\n\t\t\tI opened myself to him. He put his \n\t\t\tdisease in me.\n\nShe presses herself tight to Jeffrey.\n\n\t\t\t\t\tDOROTHY\n                            (continuing)\n\t\t\tTell me its okay. I opened myself to\n\t\t\tyou. Okay, okay, okay, okay?\n\nMrs. Williams watches with confusion and worry for the hurt this is \ncausing Sandy.  Sandy is crying now and turns away.\n\n\t\t\t\t\tJEFFREY\n\t\t\tSandy? ...Sandy, please.\n\n\t\t\t\t\tMRS. WILLIAMS\n\t\t\tI'll get a coat for her. \n\nShe leaves the room hurriedly.\n\n\t\t\t\t\tSANDY\n\t\t\t\t     (crying)\n\t\t\tJeffrey? .What's going on?\n\n\n\t\t\t\t\tJEFFREY\n\t\t\tShh. I'll tell you.\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t     (quietly)\n\t\t\tThey hurt his head.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWho, Dorothy?\n\n\t\t\t\t\tDOROTHY\n\t\t\t\t     (whispers)\n\t\t\tDon. help him. HELP HIM!! DONNY!!!!\n\nA huge, roaring wind sound comes up.\n\nDorothy starts screaming.\n\n201. EXT. WILLIAMS HOUSE - NIGHT\n\nThe SCREAMS DISSOLVE INTO a SIREN as it roars to a stop in front of the \nWilliams' house.\n\n202. INT. WILLIAMS' LIVING ROOM - NIGHT\n\nDorothy clings to Jeffrey.  Her eyes are turning a dull, milky white.  The\neffect is horrifying.  She is in shock.\n\nSandy is still crying, while she moves back and watches Jeffrey.  Jeffrey\nturns to look at Sandy.\n\n\t\t\t\t\tSANDY\n\t\t\t\t     (crying)\n\t\t\tI still love you Jeffrey.\n\nMrs. Williams comes to put a coat around Dorothy.  Mrs. Williams is \nshaking.\n\nThe Paramedics enter the house.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n203. EXT. WILLIAMS' HOUSE - NIGHT\n\nThe PARAMEDICS are loading Dorothy into the ambulance on a stretcher.  \nDorothy is moaning.  A sickening, warm wind comes up and howls through the \nneighborhood.\n\n\t\t\t\t\tJEFFREY\n\t\t\tI should go with her, Sandy.\n\n\t\t\t\t\tSANDY\n\t\t\tGo ahead.\n\n\t\t\t\t\tJEFFREY\n\t\t\t... Sandy?.\n\n\t\t\t\t\tSANDY\n\t\t\tGo ahead!\n\nJeffrey turns slowly and gets into the ambulance.\n\nINT. AMBULACE - NIGHT\n\nJeffrey's head is very close to Dorothy's.  Dorothy is saying something, \nmumbling.\n\n\t\t\t\t\tDOROTHY\n\t\t\tHold me, Don.\n\n\t\t\t\t\tJEFFREY\n\t\t\tDon?. Where is he?\n\n\t\t\t\t\tDOROTHY\n\t\t\t   (straining her eyes to\n                      focus on Jeffrey)\n\t\t\tHELP HIM!! Promise me you'll help him!\n\n\t\t\t\t\tJEFFREY\n\t\t\tI promise, Dorothy. I promise.\n\n\t\t\t\t\tDOROTHY\n\t\t\tHold me. I'M FALLING!\n\nShe bolts up screaming directly into Jeffrey's face.  Her beaten face and milky eyes are a study in horror.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n205. INT. PAY PHONE - HOSPITAL CORRIDOR - NIGHT\n\nJeffrey finishes dialing.\n\n\t\t\t\t\tJEFFREY\n\t\t\tMrs. Williams?. Is Sandy there? Please.\n\t\t\t\t   (long wait)\n\t\t\tSandy? (pause) Sandy, please. \n\t\t\t      (he closes his eyes)\n\t\t\t. forgive me. I love you.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n206. \tINT. SANDY'S ROOM - NIGHT\n\nSandy with red eyes in a darkened room.\n\n\t\t\t\t\tSANDY\n\t\t\t  (in phone, struggling\n\t\t  \t   to keep from crying)\n\t\t\tI forgive you. I just couldn't watch. \n\t\t\tI love you Jeffrey. I love you. Is she \n\t\t\tokay?. How horrible. What?\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n207. \tINT. PAY PHONE - HOSPITAL CORRIDOR - NIGHT\n\nJeffrey on pay phone.\n\n\n\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t     (in phone)\n\t\t\tPlease get to your father and send him and\n\t\t\tthe police to Dorothy's apartment right\n\t\t\taway. Be sure your father comes. Something\n\t\t\tis happening over there. They're hurting\n\t\t\tsomeone. the guy she loves. Tell them to\n\t\t\thurry. I'm going over right now.\n\n\t\t\t\t\tSANDY (V.O.)\n\t\t\tNo Jeffrey!!\n\n\t\t\t\t\tJEFFREY\n\t\t\tYes I'm going. I have to. I love you. I\n\t\t\twill, believe me.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n208. INT. CAB - NIGHT\n\nDriving through the night.\n\n208A. EXT. APARTMENT BUILDING - NIGHT\n\nJeffrey arrives at Dorothy's apartment building and pays the driver.  \nHe gets out of the cab and looks around.  No police.  Quiet.  The \nbuilding looks just the same standing there in the dark.  The dim lights \nin the front entrance.  Jeffrey moves up to the front doors and enters.  \nNo one.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n209. DETECTIVE WILLIAMS' STUDY - NIGHT\n\nSandy is trying to get her father on the police radio.\n\n\t\t\t\t\tSANDY\n\t\t\t\t (over the radio)\n\t\t\tNo. he only wants my father to come over.\n\t\t\tIt's very important. he said someone was\n\t\t\thurt and he wants Detective Williams there.\n\t\t\twell, find him!!\n\n210. INT. STAIRWAY - APARTMENT BUILDING - NIGHT\n\nJeffrey slowly climbs the stairs.  His shoes squashing the carpet make \nmall crushing sounds as he climbs higher into the building.\n\nHe arrives at the Seventh Floor and stops.  A high-pitched whine can be \nheard faintly.  It gets louder as Jeffrey crosses to Dorothy's apartment \ndoor.  He gets his key out and inserts it.  Turns it.  With a loud click \nthe door swings open and the high whine becomes piercing.  He sees \nsomething and jumps back.\n\n211. INT. DOROTHY'S APARTMENT - NIGHT\n\nIt is Detective Gordon, the Yellow Man, standing in the center of the room.\n\nFLASHBACK\n\nHe plays the look into the apartment again in his mind and again.\n\nCLOSER ON DETECTIVE GORDON\n\nSomething is wrong with him.  He is bleeding from the head.  He stands \nalmost motionless. in shock.\n\nJeffrey peers into the room again.  He enters carefully and lets the door \nclose behind him.  He very cautiously moves forward into the room.  Slowly\nhe moves closer to a hideous sight.  Standing in the middle of Dorothy's \napartment is T.R. Gordon, the Yellow Man.  He is in an extreme state of \nshock.  He is bleeding badly from a huge wound at the top left of his head.  His eyes focused on something only his twisted inner mind see.  Sitting in one of Dorothy's chairs is a dead man with no ears. only half-healed bloody wounds at each side of his head.  A bullet hole in the center of his forehead.  The T.V. is crushed in but it is turned on and it is the television that produces the high electrical whine.  Jeffrey moves forward again and kicks the television cord out of the wall.  The high whine stops instantly.  Silence except for the Yellow Man's labored breathing.\n\nSuddenly there is a loud \"radio voice\" coming from the Yellow Man's police\nradio which is turned \"on\" in his jacket pocket.  Jeffrey's heart leaps \nand just as suddenly the Yellow Man throws his arms out wildly knocking a \nfloor lamp to the ground and crushing out its light.  Jeffrey's heart goes\nwild at this sight and he jumps back but the Yellow Man is silent and \nmotionless again.  The radio talks again.\n\n\t\t\t\t\tRADIO VOICE #1\n\t\t\tGet back and stay down.\n\n\t\t\t\t\tRADIO VOICE #2\n\t\t\t. It's apartment eight.\n\nMusic. LOVE LETTERS STRAIGHT FROM MY HEART. begins to play.  \nJeffrey watches the Yellow Man and listens to the radio.\n\n\t\t\t\t\tRADIO VOICE #2\n\t\t\t\t\t (continuing)\n\t\t\tI'm sending Jack and Pete to the roof.\n\t\t\tIt's.\n\n\t\t\t\t\tRADIO VOICE #1\n\t\t\tHey.\n\nSounds of shots.\n\n\t\t\t\t\tRADIO VOICE #1\n\t\t\t\t\t (continuing)\n\t\t\tHe's shooting. from the second window.\n\n\t\t\t\t\tRADIO VOICE #3\n\t\t\tStay in place.\n\n\t\t\t\t\tRADIO VOICE #2\n\t\t\tJack. get up there quick. can return\n\t\t\tfire?.\n\n\t\t\t\t\tRADIO VOICE #3\n\t\t\tI think he's alone. but return fire to\n\t\t\tsecond window only.\n\nMany shots.\n\nWe see Jeffrey's face in CLOSEUP.\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n212. EXT. FRONT STREET - NIGHT\n\nThe real scene is before us.  Police cars line the street along with a \nhuge fire truck and several ambulances.  Special police marksmen are \ncrouched behind cars and behind a stone wall opposite Frank's building.  \nScreams are heard from within and police radios blare.  Shots are being \nfired into a black window.  Once in a while a shot is returned.  Two \npoliceman are dead and one is being loaded onto an ambulance.\n\n\t\t\t\t\tPOLICEMAN #1\n\t\t\tHe hasn't fired a shot for six minutes.\n\t\t\tmaybe we got him. get on the radio. get\n\t\t\tDetective Williams. ask him if we can\n\t\t\trush the son of a bitch.\n\nA policeman runs off. more shots are fired into the building but none \nare returned.  The policeman comes running back.\n\n\t\t\t\t\tPOLICEMAN #2\n\t\t\tIt's in the works already. we're in \n\t\t\tthere. they're goin' down the back stairs \n\t\t\tnow. It won't be long. and they'll have\n\t\t\tus rush 'em from here. one whistle and\n\t\t\twe go.\n\nSuddenly there is a long barrage of gunfire into Frank's apartment.  \nThen a loud whistle.\n\n\t\t\t\t\tPOLICEMAN #1\n\t\t\tThat's it. let's go.\n\nPolice race across the street to Frank's building.\n\n213. INT. FRANK'S APARTMENT - NIGHT\n\nPolice kick the door in and rush into the apartment.  It's empty excpt for\na large dog which has been shot.  The dog growls and cowers back in a \ncorner.  Every now and then it limps on bloody legs back and forth.\n\n214. INT. DOROTHY'S APARTMENT - NIGHT\n\nJeffrey hears the radio.  He hears the policemen talking at Frank's place.  He hears that Frank is gone.  He decides to leave Dorothy's apartment.\n\n\t\t\t\t\tJEFFREY\n\t\t\t (speaking to T.R. Gordon who doesn't\n\t\t\t  hear him because he's almost dead)\n\t\t\tI'm leaving now. I'll let them find you\n\t\t\tall on their own. find all this horror\n\t\t\ton their own.\n\t\t\t\t     (whispers)\n\t\t\tGood bye.\n\nHe goes out and closes the door.\n\n215. INT. STAIRWAY - APARTMENT BUILDING - NIGHT\n\nThe door clicks shut.  He makes his way quietly down the hall to the \nstairway. thinking.  He starts down the stairs.\n\n\t\t\t\t\tJEFFREY\n\t\t\tSo. Frank escaped.\n\nHe rounds the corner on a landing on the stairway and goes down another \nfloor. and another.  At the next landing, something out the window catches\nhis eye.  He notices a man get out of the car.  He recognizes the man.  \nIt is the well-dressed man he saw with the alligator briefcase.  Jeffrey \nwatches the man come toward Dorothy's building.  Then his eye goes back \nto the man's car.  It is Frank's car.  He notices the man is carrying a \npolice radio.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t    (to himself)\n\t\t\tFrank's car. Is this man a cop? He has a \n\t\t\tradio!. So did Frank though and he's no\n\t\t\tcop. that's for sure. and he's driving \n\t\t\tFrank's car. who is he?\n\nThe man enters the building at the front entrance directly below Jeffrey.\n\nJeffrey starts climbing back up the stairs. thinking faster.\n\n\t\t\t\t\tJEFFREY\n\t\t\tWhat happened that day?.\n\n216. EXT. FRONT STREET - DAY\n\nFLASHBACK:\n\nJeffrey remembers Frank and the Yellow Man go into Frank's building.\n\n217. INT. STAIRWAY - APARTMENT BUILDING - NIGHT\n\n\t\t\t\t\tJEFFREY (V.O.)\n\t\t\tThey went in together.\n\n218. EXT. FRONT STREET - DAY\n\nFLASHBACK\n\nJeffrey remembers the well-dressed man come out with the Yellow Man.\n\n219. INT. STAIRWAY - APARTMENT BUILDING - NIGHT\n\n\t\t\t\t\tJEFFREY\n\t\t\tand out came. No it couldn't be. But I\n\t\t\tthink it is!! It's Frank!!\n\nJeffrey runs like mad up to Dorothy's apartment.  He looks back once and \nsees the well-dressed man hurrying up the stairs.\n\nCLOSEUP on well-dressed man's face. It is Frank, underneath a very good \ndisguise.\n\nJeffrey has trouble getting the key out of his pocket.  He fumbles with it\nand it drops to the floor.\n\nFrank climbs the stairs.\n\nFinally the key goes in and Jeffrey frantically opens the door.  He rushes\ninto the room.\n\n220. INT. DOROTHY'S APARTMENT - NIGHT\n\nThe horror and strangeness of the scene within strikes him again.  He \nrushes to the Yellow Man and takes the police radio out of his pocket.  \nHe runs into the back of the apartment - to the back bedroom where he \ncrouches down behind a double bed.\n\n\t\t\t\t\tJEFFREY\n\t\t\t\t  (into the radio)\n\t\t\tDetective Williams!! Detective Williams!!\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\t\t         (over radio)\n\t\t\tDetective Williams here. Is that you,\n\t\t\tJeffrey?\n\n\t\t\t\t\tJEFFREY\n\t\t\tYes it's me!!! Frank is on his way up \n\t\t\tto Dorothy's apartment.\n\t\t\t     (thinks; hits himself in the\n                              forehead; inner voice)\n                        Oh no. Frank has a radio and is hearing\n                        everything we say!!\n\t\t\t      (thinks some more - fast)\n\t\t\tDetective Williams. hurry. I'm in the \n\t\t\tapartment. hurry. I'm hiding in the back\n\t\t\tbedroom.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tWe're ten minutes away and moving as fast\n\t\t\tas we can.\n\n221. EXT. NEIGHBORHOOD STREET - NIGHT\n\nSandy runs frantically down a dark street.  We see a street sign which \nsays \"Lincoln.\"\n\n222. INT. DOROTHY'S APARTMENT - NIGHT\n\nJeffrey drops the radio under the bed and runs back to the living room.  \nHe leaps safely into the closet just as Frank opens the apartment door and\nenters.  Jeffrey freezes with fear in the darkness of the closet.  Frank \nis smiling.\n\n\t\t\t\t\tFRANK\n\t\t\t (calling pleasantly in the direction \n  of the back bedroom)\n\t\t\tHey neighbor. shit for brains. You forgot\n\t\t\tI have a police radio. I know where your\n\t\t\tcute little butt is hiding. Here I come!\n\t\t\tReady or not!\n\nHe starts down the hall to the back bedroom.  The police radio which \nJeffrey planted under the bed and Frank's radio both start broadcasting. \nFrank turns his radio off - now only the one under the bed plays.\n\n\t\t\t\t\tFRANK\n\t\t\tHey fuck. I can hear you radio! .Hey\n\t\t\tyou stupid fuck. you got about a \n\t\t\tsecond to live.\n\nJeffrey watches Frank reach inside his coat for his gun.  He watches Frank\nsneak to the back bedroom area.  Jeffrey turns and looks at the Yellow \nMan.  He gets an idea. He quickly rushes out of the closet - feels inside \nthe Yellow Man's coat for his police gun.  It's there.  He gets it but it \ncauses the Yellow Man to moan and leap some in another almost death-spasm.  Jeffrey takes the bloody pistol and races back inside the closet frantically catching his breath.  Just then he hears Frank in the back room.\n\n\t\t\t\t\tFRANK (V.O.)\n\t\t\t           (helium voice)\n\t\t\tHey pretty pretty.\n\nJeffrey then hears three or four shots - deadly sounding coming from a \npistol with a silencer attached.\n\n\t\t\t\t\tFRANK (V.O.)\n\t\t\tHey fuck, where are you?\n\nJeffrey sees a furious Frank come storming out of the back room and come \nslowly up the hall - directly toward him.\n\nJeffrey raises his pistol - very slowly.  Frank enters the living room.  \nHe looks around.  The Yellow Man moans.  Frank makes a face and blasts the \nremainder of the Yellow Man's head away and this time the Yellow Man falls\ndead to the floor.  Jeffrey tenses in the silence which hangs in the air.  Frank looks to the kitchen. all around the living room.  He looks at the closet.  He smiles - he slowly goes right toward Jeffrey - smiling.  Jeffrey points the pistol.  His finger moves to the trigger.  He squints his eyes.  He doesn't want to kill a man. any man.  Frank comes right to the closet door and throws it open, when Jeffrey hears Sandy scream.\n\n\t\t\t\t\tSANDY (V.O.)\n\t\t\tJeffrey!!\n\nFrank and Jeffrey lock eyes as Jeffrey pulls the trigger.  He yells Sandy's\nname and Frank's head is blown off.\n\nWe see Sandy's frightened face.  We see policemen racing up the stairs in \nDorothy's apartment.\n\n223. EXT. APARTMENT BUILDING - NIGHT\n\nWe see cop cars with lights revolving, radios blaring.\n\n224. INT. CONFERENCE ROOM - POLICE STATION - NIGHT\n\nThe large room is crowded with policemen and members of the F.B.I.  \nEveryone is talking excitedly.  Jeffrey and Sandy are sitting by Detective\nWilliams in wooden chairs near the center of the room.  We hear bits of \nconversation.\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\t\t         (to Jeffrey)\n\t\t\tBecause of your information I alerted\n\t\t\tinternal affairs to check out Detective\n\t\t\tGordon.  I had to keep on with him as \n\t\t\tif nothing was different.  He slipped \n\t\t\toff on his own when he found out we were\n\t\t\tgoing to raid Frank's place.\n\n\t\t\t\t\t JEFFREY\n\t\t\tDoes Dorothy know her husband is dead?\n\n\t\t\t\t\tDETECTIVE WILLIAMS\n\t\t\tNot yet.\n\n\t\t\t\t\tJEFFREY\n\t\t\tOh my God. Is her son OK?\n\n\t\t\t\t\tF.B.I. MAN\n\t\t\tWe're looking for him. In your opinion,\n\t\t\twhy did Frank kidnap Dorothy's son and\n\t\t\thusband?\n\n\t\t\t\t\tJEFFREY\n\t\t\tHe became obsessed with her. She hated\n\t\t\thim. He had to have her. He kidnapped\n\t\t\tthem to control her. to make her do \n\t\t\tthings. Then she wanted to commit \n\t\t\tsuicide so he started cutting off ears\n\t\t\tas a warning to her to stay alive. I'm\n\t\t\tnot kidding. Frank loved blue. blue\n\t\t\tvelvet. He had to have Dorothy cause\n\t\t\ther whole life was blue.\n\n\t\t\t\t\tF.B.I. MAN\n\t\t\tYou seemed to see some very interesting\n\t\t\tthings on your little escapade with \n\t\t\tDorothy Vallens.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah. I guess I did.\n\t\t\t\t (He turns to Sandy\n  with a worried look)\n\t\t\tWhat's going to happen to me?\n\n\t\t\t\t\tF.B.I. MAN\n\t\t\tWe're going to leave that up to Detective\n\t\t\tWilliams. I'll tell you though. you're \n\t\t\tokay. you shot a real son of a bitch.\n\n\t\t\t\t\tJEFFREY\n\t\t\tYeah. I sure know that. Yeah, but how\n\t\t\tmany more are out there?\n\nFADE TO BLACK - DARKNESS\n\n225. EXT. BEAUMONTS' BACK YARD - DAY\n\nA huge low roaring sound comes in.\n\nSLOWLY WE COME UP OUT OF A HUGE DARK HOLE. We see we are rising out of an \near but still among the crevices.  They look enormous.  We move up and \nfloat above the ear and traverse across a cheek to an eye.  Jeffrey's eye. \nHis face is bathed in light.\n\nAll sorts of springtime-in-the-garden sounds are heard.\n\nWe suddenly see that Jeffrey is sleeping in his back yard. Detective \nWilliams is with Mr. Beaumont working in the garden in the distance.  \nThe sprinkler is turning.  Sandy comes out on the back porch and calls.\n\n\t\t\t\t\tSANDY\n\t\t\tJeffrey. Lunch is ready.\n\nJeffrey opens his eyes.  He looks around confused for a moment.  He sees \nSandy.\n\n\t\t\t\t\tJEFFREY\n\t\t\tOkay. I'll be right in.\n\nSandy goes back inside.  Suddenly, a big red ROBIN chirps loudly above.  \nJeffrey looks up at it sitting in the cherry tree.  The Robin and Jeffrey \nseems to exchange a special look.\n\nJeffrey smiles up at the fat bird.\n\nHe gets off the lawn chair and walks away from us toward the back door of \nthe house.  As he passes his father and Detective Williams:\n\n\t\t\t\t\tJEFFREY\n\t\t\tHow ya doin' Dad?\n\n\t\t\t\t\tMR. BEAUMONT\n\t\t\t\t     (distant voice)\n\t\t\tHey Jeff. I'm feelin' so much better.\n\n\t\t\t\t\tJEFFREY\n\t\t\tGood deal Dad.\n\nHe and Detective Williams share a smile.\n\n226. INT. BEAUMONTS' KITCHEN - DAY\n\nJeffrey enters the kitchen and sees Sandy standing with Aunt Barbara by the\nkitchen window.  Beyond, in the living room Mrs. Williams and Jeffrey's \nmother turn toward the kitchen when they hear the screen door slam.\n\nA large Red Robin has just flown down to the window still carrying a big \nbug in its mouth.\n\n\t\t\t\t\tSANDY\n\t\t\t    (Referring to the bird)\n\t\t\tLook Jeffrey.\n\n\t\t\t\t\tJEFFREY\n\t\t\t  (As he joins Aunt Barbara and\n\t\t\t   Sandy to look at the robin)\n\t\t\tYeah. I just saw him outside. Maybe\n\t\t\tthe robins are here.\n\n\t\t\t\t\tAUNT BARBARA\n\t\t\tI don't see how they do it. I could\n\t\t\tnever eat a bug.\n\n\t\t\t\t\tJEFFREY AND SANDY\n\t\t\t\t          (smiling)\n\t\t\tIt's a strange world, isn't it?\n\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n227. \tEXT. FLOWER GARDEN - DAY\n\nYellow tulips sway in a warm afternoon breeze.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n228. EXT. SHADY STREET - DAY\n\nA bright red gorgeous fire engine is moving very slowly down the street.\n\nWe MOVE IN to see the happy face of a FIREMAN.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n229. EXT. CROSSWALK - SHADY STREET - DAY\n\nA very clean uniformed, smiling POLICEMAN with arms outstretched allows \nclean happy SCHOOL CHILDREN to cross the street safely.\n\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n230. EXT. TREE - DAY\n\nA songbird SINGS in a tree.\n\nWe are in a beautiful park.  Slowly we move down and a little hat with a \npropeller comes into view.  The hat is on the head of a small child who is\ndancing slowly toward Dorothy.  She is laughing.  When the boy gets within\narms reach they embrace.  We move close to Dorothy's smiling face.  Tears\nof happiness come into her eyes, but there is still a distant look as we \nhear Bobby Vinton sing the last lines of his song.\n\n\"and I still can see Blue Velvet through\n my tears.\"\n\nBlue Velvet dissolves in and takes over the image.\n\n\t\t\t\t\tTHE END\n\n\n\n\n\nBlue Velvet\nWriters :   David Lynch\nGenres :   Crime  Drama  Mystery  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Jeffrey Beaumont (Kyle MacLachlan) returns to his logging home town of Lumberton, North Carolina from Oak Lake College after his father suffers a near-fatal stroke. While walking home from the hospital, he cuts through a vacant lot and discovers a severed ear. Jeffrey takes the ear to police detective John Williams (George Dickerson), through whom he reacquaints with the detective's daughter, Sandy (Laura Dern). She tells him details about the ear case and a suspicious woman, Dorothy Vallens (Isabella Rossellini), who may be connected to the case. Increasingly curious, Jeffrey enters Dorothy's apartment by posing as an exterminator, and while Dorothy is distracted by a man dressed in a yellow suit at her door (whom Jeffrey later refers to as the Yellow Man), Jeffrey steals her spare key.\nJeffrey and Sandy attend Dorothy's nightclub act, in which she sings \"Blue Velvet\", and leave early so Jeffrey can sneak into her apartment to snoop. He hurriedly hides in a closet when she returns home. However, Dorothy, wielding a knife, discovers him and threatens to kill him. Believing his curiosity is merely sexual and aroused by his voyeurism, Dorothy makes Jeffrey undress at knifepoint and begins to fellate him before their encounter is interrupted by a knock at the door. Dorothy hides Jeffrey in the closet. From there he witnesses the visitor, Frank Booth (Dennis Hopper), inflict his bizarre sexual proclivities—which include inhaling an unidentified gas (possibly nitrous oxide), dry humping, and sadomasochism—upon Dorothy. Frank is an extremely foul-mouthed, violent sociopath whose orgasmic climax is a fit of both pleasure and rage. He continually refers to her as \"Mommy\" and to himself as both the \"Daddy\" and the \"Baby\", who \"want to fuck.\" Frank has kidnapped Dorothy's husband and son to force her to perform sexual favors; to \"Do it for van Gogh.\" When Frank leaves, a sad and desperate Dorothy tries to seduce Jeffrey again and demands that he hit her, but when he refuses, she tells him to leave. When Jeffrey moves to leave, she asks him to stay, though he leaves anyway.\nJeffrey relays his experience to Sandy, asking her why there are people like Frank. Sandy in turn tells him of a wonderful dream she had about robins that she interprets as a sign of hope for humanity. Jeffrey and Sandy are attracted to each other, though Sandy has a boyfriend.\nJeffrey again visits Dorothy's apartment and she tells him that although she knows nothing about him, she has been yearning for him. Jeffrey attends another of Dorothy's performances at the club, where she sings the same song. At the club, Jeffrey spots Frank in the audience fondling a piece of blue velvet fabric he cut from Dorothy's robe. Jeffrey follows Frank and spends the next few days spying on him. Shortly afterwards, two men that Jeffrey calls the Well-Dressed Man and the Yellow Man exit an industrial building that Frank frequently visits. Jeffrey concludes the men are criminal associates of Frank, and tells his new findings to Sandy. The two briefly kiss, though she feels uncomfortable about going any further. Jeffrey immediately visits Dorothy again, and the two have sex. However, when he refuses to hit her, she pressures him, becoming more emotional. In a blind rage he knocks her backwards and is instantly horrified, but Dorothy derives pleasure from it.\nAfterwards, Frank catches Dorothy and Jeffrey together and forces them both to accompany him to the apartment of Ben (Dean Stockwell), his suave, effeminate partner in crime who is holding Dorothy's son. Ben lip-syncs a performance of Roy Orbison's \"In Dreams\", sending Frank into maudlin sadness, then rage. Frank takes Jeffrey to a lumber yard and when he molests Dorothy, Jeffrey stands up to Frank by punching him. Frank's cronies drag Jeffrey out of the car and Frank kisses Jeffrey's face, intimidates him, and then savagely beats him to the overture of \"In Dreams\". Jeffrey wakes the next day at the same place and walks home, overcome with guilt and despair. He goes to the police station, where he notices that Sandy's father's partner is the Yellow Man—an officer named Lieutenant Detective Tom Gordon (Fred Pickler). Later, at Sandy's home, her father is amazed by Jeffrey's story, but warns Jeffrey to stop his amateur sleuthing lest he endanger himself and the investigation. Jeffrey and Sandy go to a dance together and profess their love, only to be confronted by Sandy's boyfriend. A confrontation is averted when the group finds Dorothy—naked, battered, and distressed—on Jeffrey's front lawn. Barely conscious, Dorothy reveals her intimacy with Jeffrey, causing Sandy to become upset and to slap Jeffrey, although she later forgives him.\nJeffrey insists on returning to Dorothy's apartment and tells Sandy to immediately send the police there, including her father. At Dorothy's apartment, Jeffrey finds Dorothy's husband (Don Green), who is dead from a gunshot to the head and identifiable by his missing ear, as well as the Yellow Man, who bears a gruesome head wound and appears to have suffered a crude lobotomy. When Jeffrey tries to leave, he sees the Well-Dressed Man coming up the stairs and recognizes him as Frank in disguise. Jeffrey talks to Detective Williams over the Yellow Man's police radio, but lies about his location inside the apartment. Frank enters the apartment and brags about hearing Jeffrey's location over his own police radio. While Frank searches for him in the wrong room, Jeffrey retrieves the Yellow Man's gun and hides in the same closet in which he hid during his first visit to the apartment. Frank fires sporadically, killing the Yellow Man, and when he opens the closet door, Jeffrey fatally shoots him through the head. Detective Williams, gun drawn, enters with Sandy a moment later. Jeffrey and Sandy now go ahead with their relationship and note the unusual appearance of robins in their town. A montage sequence ends the film, which shows Dorothy and her son reunited."}