{"title": "Bound", "full_text": "BOUND\n\n\n\n                                         Written by\n\n                                   Larry & Andy Wachowski\n\n\n\n               FADE IN:\n\n               Inside a closet.\n\n               It is a large closet with double doors, a crisp line of light \n               cutting down through the center of the darkness.\n\n               As we begin to descend, voices echo in our head.\n\n                                     VIOLET (V.O.)\n                         I had this image of you, inside of \n                         me, like a part of me.\n\n               We move past a shelf filled with hatboxes and handbags.  It \n               is a woman's closet.\n\n                                     CORKY (V.O.)\n                         You planned this whole thing, didn't \n                         you?\n\n                                     CAESAR (V.O.)\n                         Where's the fucking money?\n\n               We glide over the tightly packed hangers, close enough to \n               feel the different fabrics and descend past the dresses to \n               the racks of high heels.\n\n                                     VIOLET (V.O.)\n                         We make our own choices, we pay our \n                         own prices.\n\n                                     CAESAR (V.O.)\n                         All part of the business.\n\n                                     VIOLET (V.O.)\n                         All part of the business.\n\n                                     CORKY (V.O.)\n                         What choice?\n\n               We slide along the delicate taper of a stiletto heel and \n               reach the bottom of the closet, where we find a pair of black \n               Dr. Martens boots that are tied together with a white rope.\n\n                                     VIOLET (V.O.)\n                         I want out.\n\n               We move up the boots and we see it is a woman who is bound, \n               lying motionless on the floor of the closet, the rope coiling \n               tightly around her wrists.\n\n               The crack at the bottom of the door lights her face.  She is \n               gagged and unconscious, a trickle of blood running down her \n               forehead.  Her name is CORKY.\n\n                                     VIOLET (V.O.)\n                         Like a part of me.\n\n                                                                    CUT TO:\n\n               INT.  ELEVATOR - DAY\n\n               Leaning against the back of the elevator is Corky, a very \n               butch-looking woman with short hair and a black leather \n               jacket.  She is a lesbian and wants people to know it.\n\n               As the doors begin to slide shut, a woman yells.\n\n                                     WOMAN\n                         Wait!  Hold the elevator.\n\n               Corky pushes the \"open\" button.  A couple steps into the \n               elevator.  His name is CAESAR, a middle-aged Italian, wearing \n               an expensive suit and sunglasses.\n\n               She is VIOLET; a piece of sexual candy that would melt in \n               your mouth.\n\n               She hears it again, a guttural sound.\n\n                                     CORKY\n                         Thanks again for this opportunity, \n                         Mr. Bianchinni.  Goodbye.\n\n               She hangs up the phone and walks toward the wall.\n\n               As she gets closer, we hear a bed rocking, tapping against \n               the wall.\n\n               The man's breathing grows more and more labored until finally \n               it swells --\n\n                                                           DISSOLVING INTO:\n\n               INT.  BATHROOM - MORNING\n\n               The whining motor of a high-powered drain-rod.\n\n               The spiral cable whips wildly, spiraling deeper into the tub \n               drain, black goo splattering everywhere.\n\n               The machine is so loud Corky almost cannot hear someone \n               pounding on the apartment door.\n\n               Killing the motor, she stands and goes to the door.\n\n               Behind the door is Violet, wearing jeans, a white T-shirt \n               and cowboy boots.\n\n                                     VIOLET\n                         Hi.  My name is Violet.  We sort of \n                         met in the elevator --\n\n                                     CORKY\n                         Yeah, sure.  I'm Corky.\n\n                                     VIOLET\n                         I heard you working in here and I \n                         just wondered if you'd like a cup of \n                         coffee?\n\n               She is holding two cups of coffee: one black, one with cream.\n\n                                     CORKY\n                         Sure.  Come on in.  Give me a minute.\n\n               Violet steps inside as Corky goes back to the bathroom to \n               wash off the drain dreck.\n\n                                     VIOLET\n                         What happened to Rajeev?\n\n               Corky calls from the bathroom, scrubbing her hands vigorously.\n\n                                     CORKY\n                         Who?\n\n                                     VIOLET\n                         Rajeev, the man who usually works on \n                         the building.\n\n                                     CORKY\n                         Oh, he went home to India, but as \n                         far as I know he'll be back.\n\n               She wipes her hands on her overalls, returning to the main \n               room.\n\n                                     VIOLET\n                         So this is temporary for you?\n\n                                     CORKY\n                         Pretty much.  One day at a time.\n\n               Violet hands her the cup of black coffee.\n\n                                     VIOLET\n                         I guessed you were straight black.\n\n                                     CORKY\n                         Good guess.\n\n               They both sip from the piping hot mugs.\n\n                                     CORKY\n                         Mmmm ...  thanks, I needed this.\n\n                                     VIOLET\n                         My pleasure ...  but to be honest, I \n                         did have a slightly ulterior motive \n                         here.  I was wondering if I could \n                         ask a small favor?\n\n                                     CORKY\n                         A favor?\n\n                                     VIOLET\n                         Yeah, see, I'm kind of a night person, \n                         so I was wondering if it wasn't a \n                         terrible inconvenience if you could \n                         wait a bit before using power tools.\n\n                                     CORKY\n                         Oh, I'm sorry --\n\n                                     VIOLET\n                         No, it isn't your fault.  The walls \n                         here are just so thin.\n\n                                     CORKY\n                         Are they really?\n\n                                     VIOLET\n                         Yes, it really causes problems.  \n                         Sometimes it's like you're in the \n                         same room.  But if it's too much \n                         trouble, I understand ...\n\n                                     CORKY\n                         No, no trouble.  There's other work \n                         to do.\n\n                                     VIOLET\n                         You're doing everything yourself?\n\n                                     CORKY\n                         Yeah.\n\n                                     VIOLET\n                         That is so amazing.  I'm in awe of \n                         people who can fix things.  My dad \n                         was like that.  We never had anything \n                         new.  Whenever something broke he \n                         would open it up, tinker with it and \n                         it would work.  His hands were magic.\n\n               She looks at Corky's hands cupped around the mug.\n\n                                     VIOLET\n                         Yeah ...  I bet your car is twenty \n                         years old.\n\n               Corky smiles.\n\n                                     CORKY\n                         Truck.\n\n                                     VIOLET\n                         Truck.  Of course.\n\n                                     CORKY\n                         '63 Chevy.\n\n                                     VIOLET\n                         I knew it.\n\n               VIOLET SIPS\n\n                                     VIOLET\n                         So, how do you know the owner, Mr. \n                         Bianchinni?\n\n                                     CORKY\n                         I don't, really.  I was referred to \n                         him.\n\n                                     VIOLET\n                         Oh, really.\n\n               Corky suddenly feels she has revealed something.\n\n                                     CORKY\n                         Do you know him?\n\n                                     VIOLET\n                         No, but Caesar does.  He likes him.  \n                         Says he's a good Italian.\n\n                                     CORKY\n                         Caesar is your husband?\n\n                                     VIOLET\n                         Oh no, no.  I'm not the marrying \n                         kind.\n\n               Smiling, she says nothing else.\n\n                                     VIOLET\n                         I should be going.  You can drop the \n                         cup off anytime.\n\n                                     CORKY\n                         Thanks.\n\n                                     VIOLET\n                         My pleasure.\n\n               CORKY watches her leave.\n\n               EXT.  THE WATERING HOLE - NIGHT\n\n               A dirty bar hidden away on a dark street, its cracked, moon-\n               white sign the only evidence it exists.\n\n               Corky's truck swings into a space in front of a couple of \n               large motorcycles.  She flips her collar and heads for the \n               door.\n\n               INT.  THE WATERING HOLE - NIGHT\n\n               The smell of leather and cigarette smoke fills Corky's nose \n               as she crosses to the bar.\n\n                                     BARTENDER\n                         Well, well ...\n\n               Corky sits as the fat bartender waddles over.\n\n                                     BARTENDER\n                         Been awhile, Cork.\n\n                                     CORKY\n                         Five years, two months, sixteen days.  \n                         How you doing, Sue?\n\n               Corky puts a cigarette in her mouth and lights it.\n\n                                     SUE\n                         Like shit.  Now that we're all caught \n                         up, how about a drink?\n\n               Sue opens the refrigerator and pulls out two Old Styles.\n\n                                     CORKY\n                         Thanks.\n\n               They click the bottles together and drink.\n\n                                     SUE\n                         You got a job yet?\n\n                                     CORKY\n                         Yeah.  Some plumbing, painting and \n                         shit.\n\n               Sue laughs.\n\n                                     SUE\n                         I mean a J-O-B.  A real job.\n\n                                     CORKY\n                         Not for me, Sue.  I'm straight and \n                         narrow.  I'm just here to get laid \n                         or drunk and hopefully both.\n\n               Corky gets off the stool.\n\n                                     CORKY\n                         Thanks for the beer.\n\n               Looking around, she sees a woman alone at one of the back \n               tables.  Through the smoky din, she bears a slight resemblance \n               to Violet.\n\n               The woman is dressed all in black, including a leather jacket.\n\n               Smiling, Corky slides into the chair beside her.  There is \n               no one smoother.\n\n                                     CORKY\n                         Hi.\n\n                                     WOMAN\n                         Hello.\n\n                                     CORKY\n                         You know ...  that outfit would look \n                         great on my bedroom floor.\n\n               The woman smiles just as someone taps Corky on the shoulder.\n\n               She turns and is face-to-face with a large bull of a woman \n               in a heavy leather Chicago Police jacket.  She is more wide \n               than fat.\n\n                                     WOMAN COP\n                         Hey, Jesse.  What's happening here?\n\n                                     CORKY\n                         Nothing ...  yet.\n\n                                     WOMAN COP\n                         Who's this?\n\n               Her coat opens as she puts her hands on her hips.  A service \n               revolver is clipped to her belt.\n\n               She squints at Corky, her head nodding in recognition.\n\n                                     WOMAN COP\n                         Wait, I know you.\n\n                                     CORKY\n                         I don't think so.\n\n                                     WOMAN COP\n                         I didn't know you were out.\n\n               Corky smiles at the woman in black.\n\n                                     CORKY\n                         When you get tired of Cagney and \n                         Lacey, come find me.\n\n               She heads for the exit.\n\n               EXT.  CITY STREET - NIGHT \n\n               The neighborhood would be politely described as \"rough.\" \n               Corky's truck does not stand out parked alone on the littered \n               street.\n\n               INT.  CORKY'S APARTMENT - NIGHT\n\n               It is a hole but it is home.\n\n               Corky is lying on her futon staring up at the ceiling, a \n               beer resting on her stomach; a folk singer quietly croons \n               from the radio.\n\n               We see the ceiling, a circle of light hovering over the small \n               desk lamp.  We move in on the spot, which slowly fills up \n               the screen until there is nothing but the white light.\n\n               Suddenly a wet paint roller loaded with white paint cuts a \n               swath across the ceiling.\n\n               MATCH CUT TO:\n\n               INT.  EMPTY APARTMENT - DAY  \n\n               Corky is painting the ceiling.  The folk ballad has become \n               an angry Riot Grrrl anthem.\n\n               She is working hard, the roller sucking back and forth.  \n               Sweat covers her face.\n\n               Dropping the roller down, she reloads it in the tray when \n               the phone rings.  She stops and answers it.\n\n                                     CORKY\n                         Hello?  Oh, hi, Mr. Bianchinni ...  \n                         yes, everything is going fine.  I \n                         got the tub drain all cleaned out.\n\n               She listens for a moment.\n\n                                     CORKY\n                         What apartment?\n\n               She glances at the main wall.\n\n                                     CORKY\n                         All right, all right, I guess I could \n                         take a look.  Yeah, you're welcome, \n                         goodbye.\n\n               She hangs up and looks again at the wall, feeling...  curious.\n\n               INT.  HALL - NIGHT\n\n               Corky knocks and after a moment Violet opens the door.  She \n               seems surprised.\n\n                                     VIOLET\n                         Oh no.  Shit.  I didn't know he would \n                         call you.  God, you must think |I'm \n                         a total nuisance.\n\n                                     CORKY\n                         Not exactly.\n\n                                     VIOLET\n                         I'm sorry, I usually would call \n                         Rajeev, but I didn't know what to do \n                         so I called Mr. Bianchinni.\n\n                                     CORKY\n                         He said you lost something.\n\n                                     VIOLET\n                         Yeah, come on in.\n\n               She steps back and Corky walks inside.\n\n               INT.  CAESAR'S APARTMENT - NIGHT\n\n               Violet leads her through the apartment.  It is expensively \n               furnished with very masculine tastes; a lot of gray and black \n               leather.\n\n                                     VIOLET\n                         I was doing some dishes and just as \n                         I pulled the stopper my earring fell \n                         in.\n\n               Corky looks at her blankly.\n\n                                     VIOLET\n                         It's one of my favorites.  That's \n                         why I got upset.  I know it probably \n                         seems ridiculous to you.\n\n               An eyebrow goes up.\n\n                                     VIOLET\n                         I'm sorry, look, forget it.  I \n                         shouldn't have called...\n\n                                     CORKY\n                         I told Bianchinni I would take a \n                         look.  Is it that sink?\n\n               Violet nods.\n\n               She opens the sink cabinet and pulls out a pair of channel \n               locks from her back pocket.  The teeth of the channel locks \n               open and bite onto the pressure nut.\n\n                                     CORKY\n                         Do you have a pot or a bucket?\n\n                                     VIOLET\n                         Sure.\n\n               She hands one down to her.  Corky slides it under the curved \n               pipe.\n\n               As she works, Corky feels herself staring at Violet, at the \n               hem of her dress curving tightly around her thighs.\n\n               Water begins to trickle into the pan.\n\n               The nut slides loose and Corky tips the trap.  Water splashes \n               into the pan with a soft metal \"tink.\"\n\n                                     VIOLET\n                         Did you find it?\n\n               Corky fishes into gray water and pulls out the earring.\n\n               Violet screams, a huge smile on her face, half-falling as \n               she tries to hug Corky.\n\n                                     VIOLET\n                         I can't believe it!  You did it!\n\n               Corky leans back under and replaces the trap.\n\n                                     VIOLET\n                         Thank you so much.  You have to let \n                         me pay you something --\n\n                                     CORKY\n                         No.  Mr. Bianchinni asked me to do \n                         it.  I did it.\n\n               Corky checks the drain by running the water.\n\n                                     VIOLET\n                         If you won't take money, how about a \n                         drink?  It's getting late.  You can't \n                         work all night.\n\n               Corky eyes her for a moment.\n\n                                     CORKY\n                         Okay, one drink.\n\n                                     VIOLET\n                         What do you want?\n\n                                     CORKY\n                         A beer?\n\n                                     VIOLET\n                         A beer.  Of course.\n\n               She smiles and turns to the bar.\n\n                                     VIOLET\n                         Sit down.\n\n               Corky sits on the black leather couch and Violet returns \n               with two bottles of Heineken.  Corky sneers.\n\n                                     VIOLET\n                         Thanks again.\n\n               They clink the bottles and swig.\n\n                                     VIOLET\n                         You seem uncomfortable.  Do I make \n                         you nervous, Corky?\n\n                                     CORKY\n                         No.\n\n               She looks at Violet, then takes another long pull on the \n               bottle.\n\n                                     VIOLET\n                         Thirsty, maybe.\n\n               Violet smiles, her eyes again talking for her.\n\n                                     CORKY\n                         Curious, maybe.\n\n                                     VIOLET\n                         Curious?  That's funny, I'm feeling \n                         a bit curious myself right now.\n\n               Violet notices the tattoo on Corky's arm.\n\n                                     VIOLET\n                         That's a great tattoo.\n\n               She reaches over and touches it.\n\n                                     VIOLET\n                         Beautiful labrys.\n\n               Corky is a bit suprised that she knows what it is.  She nods, \n               rubbing it as if trying to hide it.\n\n                                     VIOLET\n                         Are you surprised that I know what \n                         it is?\n\n                                     CORKY\n                         Maybe.\n\n                                     VIOLET\n                         I have a tattoo, would you like to \n                         see it?\n\n               She moves closer, sliding over the leather cushions as she \n               opens the front of her dress.\n\n                                     VIOLET\n                         A woman in upstate New York did it \n                         for me.\n\n               She is not wearing a bra.\n\n                                     VIOLET\n                         Here.  Do you like it?\n\n               Set against the soft white skin of her breast is a bright \n               green-stemmed violet.\n\n                                     VIOLET\n                         It took her all day to do it.  She \n                         promised me it wouldn't hurt, but it \n                         was sore for a long time after.  I \n                         couldn't even touch it.\n\n               Corky looks up from Violet's breast to her dark eyes.\n\n                                     VIOLET\n                         But now I love the way it feels.\n\n               She runs her fingers softly over the slightly scarred skin.\n\n                                     VIOLET\n                         Here, touch it.\n\n               Corky feels the blood pounding in her ears as Violet takes \n               her hand and places it on her breast.\n\n                                     CORKY\n                         What are you doing?\n\n               Violet looks at her.\n\n                                     VIOLET\n                         Isn't it obvious?  I'm trying to \n                         seduce you.\n\n                                     CORKY\n                         Why?\n\n                                     VIOLET\n                         Because I want to.  I've wanted to \n                         since I first saw you in the elevator.\n\n               Corky watches her, trying to figure her out even as her thumb \n               presses into Violet's nipple.\n\n               Inhaling sharply, Violet closes her eyes; she can feel Corky \n               staring at her.\n\n                                     VIOLET\n                         You don't believe me.  But I can \n                         prove it to you.\n\n               She takes Corky's wrist and begins pulling her hand down her \n               body.\n\n                                     VIOLET\n                         You can't believe me because of what \n                         you see ...\n\n               She forces Corky's hand between her legs, up under her dress.\n\n                                     VIOLET\n                         But you can believe what you feel.\n\n               Violet opens her eyes, a wanton smile on her lips.\n\n                                     VIOLET\n                         You see ...  I've been thinking about \n                         you all day.\n\n               Corky's forearm flexes and Violet moans.\n\n               With both hands, Violet takes hold of Corky's forearm.\n\n                                     CORKY\n                         You planned this whole thing?\n\n               Violet's head swims; she is unable to breathe.\n\n                                     CORKY\n                         You dropped that earring down the \n                         drain on purpose, didn't you?\n\n                                     VIOLET\n                         If I say yes, will you take your \n                         hand away?\n\n                                     CORKY\n                         No.\n\n                                     VIOLET\n                         ...  yes.\n\n               Now it is Corky who smiles.\n\n               Violet shivers, her thighs rubbing, her hips thrusting against \n               Corky's hand.\n\n                                     VIOLET\n                         Please, Corky ...  please ...\n\n               Her eyes barely open.\n\n                                     VIOLET\n                         ...  kiss me.\n\n               In a single motion, Corky takes hold of the back of her neck \n               and covers Violet's open mouth with her own.\n\n               With her hand still stuffed between Violet's legs, Corky \n               lays her back onto the couch as the kiss becomes more --\n\n               More desperate, more hungry until --\n\n               We hear the front door unlock and open.\n\n                                     CAESAR\n                         Violet?\n\n               Violet's eyes pop open and she pushes Corky back.\n\n                                     CAESAR\n                         Violet, you home?\n\n               They scramble to compose themselves.\n\n                                     VIOLET\n                         Yeah.  In here, C.\n\n               He comes around the corner and in the dim light sees the two \n               figures sitting close on the couch.\n\n                                     CAESAR\n                         What's this?\n\n               He mistakes Corky for a man.\n\n                                     CAESAR\n                         What the fuck is this?\n\n               Violet stands as Caesar barrels toward the couch.\n\n                                     VIOLET\n                         I didn't expect --\n\n                                     CAESAR\n                         What the fuck is going on?\n\n               Corky stands and turns, Caesar suddenly realizing that she \n               is a woman.\n\n                                     CAESAR\n                         Oh, shit ...\n\n                                     VIOLET\n                         Caesar, this is Corky.  Corky, Caesar.\n\n                                     CAESAR\n                         I'm sorry, Christ, I thought ...  \n                         it's fucking dark in here.\n\n               He reaches to the wall for the lights.\n\n                                     VIOLET\n                         She is working for Bianchinni.\n\n               Caesar extends his hand.\n\n                                     CAESAR\n                         Oh, right, right.  Don mentioned \n                         that to me.  Hi, welcome to the \n                         family.\n\n               Corky shakes his hand.\n\n                                     CAESAR\n                         You're helping Rajeev?\n\n                                     CORKY\n                         No.  Rajeev's in India.\n\n                                     VIOLET\n                         She's doing the work herself.\n\n                                     CAESAR\n                         No shit.  Bianchinni hired you?  You \n                         know he's a good friend of mine.  \n                         |Family, really.\n\n                                     CORKY\n                         That's what Violet said.\n\n               He looks at her as if he knows something.\n\n                                     CAESAR\n                         So, you just got out?\n\n                                     VIOLET\n                         Jesus, Caesar!\n\n                                     CAESAR\n                         What?  It ain't no big fuckin' deal.  \n                         I know who Don hires.  Did you know \n                         he did time himself?\n\n               Corky shakes her head.\n\n                                     CAESAR\n                         Thirteen fucking years.  See, there \n                         ain't no secrets here.\n\n               Corky doesn't like this man.\n\n                                     CAESAR\n                         How many'd you do?\n\n                                     CORKY\n                         Five.\n\n               He whistles.\n\n                                     CAESAR\n                         Not bad.  What for?\n\n                                     VIOLET\n                         That's none of your goddamn business, \n                         Caesar.\n\n                                     CAESAR\n                         You're right.  You don't have to \n                         tell me, if you don't want to.  I \n                         just hope you understand you're among \n                         good people here.\n\n               He reaches into his pocket and pulls out a thick fold of \n               money and peels several hundreds.  Corky stares at it.\n\n                                     CAESAR\n                         Come on, come on.  if you understand \n                         what I'm talking about you're going \n                         to take the money.  if you don't, \n                         I'm going to have to worry about \n                         you.\n\n               Corky takes it.  Caesar smiles.\n\n                                     CAESAR\n                         Good.  I hate to worry.  I got ulcers.\n\n                                     CORKY\n                         I should be going.\n\n                                     CAESAR\n                         What?  How about a drink?\n\n                                     CORKY\n                         My brushes, I have to clean my \n                         brushes.  Thanks, though.\n\n                                     CAESAR\n                         Another time.\n\n                                     CORKY\n                         Sure.\n\n               INT.  EMPTY APARTMENT - NIGHT \n\n               Close on the paintbrush, Corky's fingers pushing through and \n               separating the black bristles under the running water.\n\n               When the brush is clean, she flicks it dry and resets the \n               edge.\n\n               She goes to the sink to wash her hands when she stops, \n               noticing her left hand.\n\n               It is the hand that was between Violet's legs.\n\n               She is about to smell her finger when she sees herself in \n               the mirror.\n\n                                     CORKY\n                         What are you doing?\n\n               She drops her hand.\n\n                                     CORKY\n                         What am I doing?  I'm fucking up, \n                         that's what I'm doing.\n\n               She scrubs her hands clean.\n\n               EXT. PARKING LOT - NIGHT \n\n               It is late, the area burnished with amber street light.  \n               Corky walks from the building to her truck.\n\n               She climbs inside and slides the key into the ignition, when \n               suddenly the passenger door opens and --\n\n               Violet gets in.  Stunned, Corky stares at her.\n\n                                     VIOLET\n                         I had to see you.\n\n                                     CORKY\n                         Look, I don't think this is a good \n                         idea.\n\n                                     VIOLET\n                         I wanted to apologize.\n\n                                     CORKY\n                         Don't apologize, please.  I can't \n                         stand women who apologize for wanting \n                         sex.\n\n               Violet smiles.\n\n                                     VIOLET\n                         I'm not apologizing for what I did --\n\n               She slides across the seat.\n\n                                     VIOLET\n                         I'm apologizing for what I didn't \n                         do.\n\n               She kisses Corky, and if Corky is trying to resist, we can't \n               tell.\n\n               The windshield is beginning to steam when Violet, panting, \n               breaks the kiss.\n\n                                     VIOLET\n                         Do you have a bed somewhere?\n\n               Unable to speak, Corky reaches over and starts the engine.\n\n               INT.  CORKY'S APARTMENT - NIGHT\n\n               The sex.\n\n               There is nothing flower-scented or out-of-focus about it.\n\n               It is sweaty, slippery, body-grinding, bed-squeaking lesbian \n               sex --\n\n               Pungent and potent --\n\n               And when it is over, neither woman can move.\n\n               Finally, Corky's eyes flutter open.\n\n                                     CORKY\n                         I can see again.\n\n               Violet smiles.\n\n               Slowly, Corky gets up and goes to the fridge.  She grabs a \n               beer and presses it to her sweating forebead.\n\n               After a moment, she lowers it, gently pressing the cold can \n               elsewhere.  Eyes closed, she lets out a long \"Ahh.\"\n\n               Violet hears the sizzle-pop of the beer as Corky returns to \n               the bed.\n\n               She holds the beer to Violet's lips and tilts the can, \n               watching Violet's throat as she drinks.\n\n               Violet's eyes open.\n\n                                     VIOLET\n                         ...  I needed that.\n\n                                     CORKY\n                         Tell me about it.\n\n               Corky hands her the beer as Violet sits up a bit.\n\n                                     CORKY\n                         Caesar's Mafia, isn't he?\n\n                                     VIOLET\n                         You have to ask?\n\n                                     CORKY\n                         No.\n\n                                     VIOLET\n                         Funny, nobody calls it that anymore.  \n                         Caesar calls it \"The |Business.\"\n\n                                     CORKY\n                         How did you meet him?\n\n                                     VIOLET\n                         They took over a club I was working \n                         at.  Caesar started managing it.\n\n                                     CORKY\n                         He's a launderer?\n\n                                     VIOLET\n                         Basically.\n\n                                     CORKY\n                         How long have you been with him?\n\n                                     VIOLET\n                         Almost five years.\n\n                                     CORKY\n                         Five years is a long time.\n\n                                     VIOLET\n                         Yes, it is.\n\n               Corky stares at her beer.  She knows what Violet is thinking.\n\n                                     CORKY\n                         The redistribution of wealth.\n\n                                     VIOLET\n                         What?\n\n                                     CORKY\n                         Isn't that what you wanted to know?  \n                         What I did time for?\n\n                                     VIOLET\n                         The redistribution of wealth?\n\n                                     CORKY\n                         That's what I tell someone when I'm \n                         trying to get them in my bed.\n\n                                     VIOLET\n                         I'm already in your bed.\n\n                                     CORKY\n                         My cellmate would say she did her \n                         time for getting caught.  She was \n                         always more honest than me.\n\n               Corky sips her beer.\n\n                                     CORKY\n                         I started stealing when I was little.  \n                         We were piss-poor, which is not an \n                         excuse, just a fact.\n\n               It isn't like her to talk about this, especially with someone \n               she just met.\n\n                                     CORKY\n                         The first time I remember so vividly.  \n                         A bunch of us kids were at Waxman's \n                         Drugstore, when Mr. Waxman, who was \n                         a mean old prick, always worrying \n                         about us robbing him, dropped a roll \n                         of quarters.\n\n               We can almost hear the coins tinkling on the tile floor.\n\n                                     CORKY\n                         I can still hear that sound, those \n                         quarters, because right then something \n                         clicked inside of me.  Some instinct \n                         took over and as everyone, including \n                         Waxman, dove down, I reached up and \n                         emptied the cash register.\n\n               Violet smiles.  She likes this woman.\n\n                                     CORKY\n                         I gave most of the money to my mom.  \n                         I told her I found it at the \n                         trainyard.  She was so happy she \n                         cried, calling me her lucky charm.  \n                         Fifteen years later, I guess my luck \n                         ran out.\n\n               Sbe swallows that with beer.\n\n                                     CORKY\n                         Sometimes I tell myself that I didn't \n                         have a choice, that stealing was \n                         surviving.  Usually I can admit that's \n                         bullshit.  I did it because it was a \n                         way out.  It was easy and I was good \n                         at it, real good.\n\n               She glances at Violet.\n\n                                     CORKY\n                         I don't usually talk this much.  I \n                         guess I have been rehabilitated.\n\n               Violet laughs.\n\n                                     VIOLET\n                         You didn't have to tell me if you \n                         didn't want to.\n\n                                     CORKY\n                         I guess I wanted to.\n\n                                     VIOLET\n                         I'm glad you did.\n\n                                     CORKY\n                         So am I.\n\n               EXT. PARKING LOT DAY \n\n               Corky gets out of her truck carrying her tools.  Grinning \n               like someone who has been well-laid, she whistles off to \n               work.\n\n               EXT. LOBBY - DAY \n\n               Between the main doors she sees a man.  His name is SHELLY \n               and he is an overdressed accountant.\n\n               He is very nervous, talking to someone through the intercom.\n\n                                     SHELLY\n                         I know he's gone.  Please.  I have \n                         to talk to you.\n\n               Fiddling with her keys, Corky recognizes the voice that \n               answers him.\n\n                                     VIOLET (V.O.)\n                         What do you want, Shelly?\n\n               Shelly glances over his shoulder at Corky, answering in a \n               hushed voice.\n\n               SHELLY\n\n               I have to leave.  Tonight.\n\n               For a moment the intercom is silent.  Then the door buzzes \n               and Shelly pushes inside.  Corky follows him to the elevator.\n\n               INT.  ELEVATOR - DAY\n\n               Corky glares at Shelly and begins pumping the trigger of her \n               circular saw.\n\n               Shelly hides behind his sunglasses, watching the elevator \n               numbers go up.  The doors open and he scurries out.\n\n               INT.  HALL - DAY\n\n               She watches him enter Caesar's apartment, her smile now \n               completely gone.\n\n               INT.  EMPTY APARTMENT - DAY\n\n               It is later.  Through the wall we listen to the same sound \n               as before of two people making love.  We drop down and find \n               Corky's brush, still wet with paint, abandoned in her tray.\n\n               INT.  BEDROOM - DAY\n\n               Her face glistening with sweat, Violet climaxes, letting the \n               orgasm spread through her like melting butter.\n\n                                     VIOLET\n                         I had this image of you, inside of \n                         me ...\n\n               She flattens her palms against the soft cradle of her pelvis.\n\n                                     VIOLET\n                         Like a part of me ...\n\n               As she opens her eyes, we see that her lover is Corky.  Violet \n               watches as she gets off the bed and begins to get dressed.\n\n                                     VIOLET\n                         You are so beautiful.\n\n               Corky does not answer as she yanks her pants on.  Violet \n               sits up.  She can feel that something is wrong.\n\n                                     VIOLET\n                         What's wrong?\n\n                                     CORKY\n                         Nothing.\n\n               Violet pulls the sheet around her.\n\n                                     VIOLET\n                         Yes there is.  I felt it this morning \n                         when I brought you the coffee.\n\n                                     CORKY\n                         Shit, here we go.\n\n                                     VIOLET\n                         You didn't want to see me, did you?\n\n                                     CORKY\n                         If there is one thing I can't stand \n                         about sleeping with women, it's all \n                         the fucking mind reading.\n\n                                     VIOLET\n                         What are you afraid of?\n\n                                     CORKY\n                         I'm not afraid of anything.\n\n                                     VIOLET\n                         I don't understand - ?\n\n                                     CORKY\n                         I know!  You can't understand, because \n                         we're different, Violet.  We're \n                         different.\n\n                                     VIOLET\n                         We're not that different, Corky.\n\n                                     CORKY\n                         How can you sit in that bed and say \n                         that?\n\n                                     VIOLET\n                         Because it's the truth.\n\n                                     CORKY\n                         Let me guess.  This is where you \n                         tell me that what matters is on the \n                         inside.  That inside you, there is a \n                         little dyke just like me?\n\n                                     VIOLET\n                         Oh no, she's nothing like you.  She's \n                         a lot smarter than you.\n\n                                     CORKY\n                         Is that what her daddy tells her?\n\n                                     VIOLET\n                         I know what I am.  I don't need to \n                         have it tattooed on my shoulder.\n\n                                     CORKY\n                         What are you saying?  That you don't \n                         have sex with men?\n\n                                     VIOLET\n                         I don't.\n\n                                     CORKY\n                         For Christ's sake, Violet!  I heard \n                         you!  Thin walls, remember?\n\n                                     VIOLET\n                         What you heard wasn't sex.\n\n                                     CORKY\n                         What the fuck was it?\n\n                                     VIOLET\n                         All my life, everyone has been telling \n                         me that when I have sex, I'm not \n                         really having sex.  Not real sex.  \n                         But they're wrong.  I know what is \n                         and isn't sex and what you heard was \n                         definitely not sex.\n\n                                     CORKY\n                         What was it then?\n\n                                     VIOLET\n                         Work.\n\n               That knocks Corky back.\n\n                                     VIOLET\n                         You made certain choices in your \n                         life that you paid for.  You said \n                         you made them because you were good \n                         at something and it was easy.  Do \n                         you think you're the only one that's \n                         good at something?\n\n               Violet stare pins Corky to the wall.\n\n                                     VIOLET\n                         We make our own choices and we pay \n                         our own prices.  I think we're more \n                         alike than you want to admit.\n\n                                     CORKY\n                         What about that guy this morning?\n\n                                     VIOLET\n                         You mean Shelly?\n\n                                     CORKY\n                         Don't tell me, you're a workaholic.\n\n                                     VIOLET\n                         No.  Shelly knows what I am.  He saw \n                         me in a bar with another woman.\n\n                                     CORKY\n                         I suppose he just wants to watch.\n\n               That's all Violet can take.\n\n                                     VIOLET\n                         Fuck it!  I think you better leave.\n\n                                     CORKY\n                         I think so, too.\n\n               Violet turns away.\n\n                                     VIOLET\n                         Try not to steal anything on the way \n                         out.\n\n               That stings but Corky walks out without looking back.\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               It is dark now.  Corky is standing above the paint tray that \n               has skinned over.  She picks up the brush.  It is dry with \n               paint.\n\n                                     CORKY\n                         Shit.\n\n               She throws the brush across the room.\n\n               EXT.  CAESAR'S APARTMENT BUILDING - DAY\n\n               A green-and-white street sign juts in the foreground of \n               Caesar's upscale apartment building.\n\n               The sign reads: \"FRANKLIN STREET.\"\n\n               EXT.  PARKING LOT - DAY\n\n               The rusty Chevy glides to a stop in a parking space near the \n               service entrance.  In its payload is a boxed bathroom vanity \n               and sink.\n\n               Corky climbs out of the cab and into the back, unhooking the \n               bungee cords that hold down the boxes.\n\n               She looks up as a black Lincoln Town Car screeches into a \n               spot not far from her truck.  THREE SERIOUS-LOOKING MEN get \n               out, leading a fourth, Shelly.\n\n               He is the only one who seems to notice Corky.\n\n               They enter the building, the door closing behind them.\n\n               INT.  BATHROOM - DAY\n\n               Corky's legs jut out from the old wicker vanity as she \n               finishes detaching its anchors and pipe work.\n\n               She stands, giving it a yank and pulling it away from the \n               wall, when voices begin to filter in from the next-door \n               apartment.\n\n               She listens - a rising string of warbling sobs drowned out \n               by an angry voice.\n\n                                     ANGRY VOICE\n                         Shut the fuck up!  You piece of shit!\n\n               We hear a scream.\n\n                                     ANGRY VOICE\n                         You're going to tell us!  You're \n                         going to fuckin' tell us!  just a \n                         matter of fuckin' time!\n\n               Each sentence is punctuated with grunts and thuds.\n\n                                     ANGRY VOICE\n                         Where is it?  Where the fuck is it?!\n\n               We begin to close in on Corky as she listens to each thud, \n               watching something that disturbs her.\n\n                                     ANGRY VOICE\n                         You shit!  You piece of shit!\n\n               With each thud the water in the toilet shimmers like a struck \n               cymbal.  As we move closer, the sound swells until --\n\n                                                              MATCH CUT TO:\n\n               INT.  CAESAR'S BATHROOM DAY\n\n               Where blood splatters the toilet, heavy drops hitting the \n               water and spreading like inverted mushroom clouds.\n\n                                     ANGRY VOICE\n                         Did that hurt?  News flash, fucko: \n                         I'm just getting started.\n\n               The angry voice belongs to JOHNNIE MARZZONE.  Shelly is \n               kneeling in front of the toilet, hands tied behind his back \n               with electrical wire.\n\n               Johnnie Marzzone is a flashy young man in Armani slacks, \n               silk shirt and silver-tipped cowboy boots.  His tie is tucked \n               in, as if torture were a fine-dining experience.\n\n               Caesar and two other men are crammed in the small bathroom.\n\n                                     JOHNNIE\n                         You got nerve trying to fuck us!  \n                         Nobody fucks me!  Nobody fucks my \n                         father!  Nobody!  Nobody!\n\n               Shelly screams as Jobnnie repeatedly rams his face into the \n               toilet.\n\n                                     CAESAR\n                         Whoa, whoa.  Come on, he's making \n                         too much noise.\n\n                                     JOHNNIE\n                         You hear that, bitch?  Be quiet!\n\n                                     CAESAR\n                         Here, put this in his mouth.\n\n               Caesar hands a towel to Johnnie, who stuffs it into Shelly's \n               mouth.\n\n               INT.  CAESAR'S APARTMENT - DAY\n\n               Like Corky, Violet can hear the beating.  She is trying to \n               block it out but cannot.\n\n               Standing at the bar, she runs the blender, grinding ice cubes, \n               trying to drown out the sounds of the bathroom.\n\n               The bathroom door opens.\n\n                                     JOHNNIE\n                         Prick!  I can go all night!  All \n                         night!\n\n               Caesar steps out, shutting the door, masking the sounds behind \n               him.  Violet moves toward him.\n\n                                     VIOLET\n                         Caesar, I'm leaving.\n\n                                     CAESAR\n                         What?  Oh, come on, I didn't use one \n                         of the good towels.\n\n               The door opens again as someone else steps out.\n\n                                     VIOLET\n                         Caesar, I'm serious.  This is too \n                         much.  I have to get out of here.\n\n                                     CAESAR\n                         Why?  'Cause you know him?\n\n               She nods.\n\n                                     CAESAR\n                         You women are so fucking sensitive.\n\n               He takes hold of her.\n\n                                     CAESAR\n                         But I don't want you to go.  I like \n                         you here.  You know this isn't easy \n                         for me, either.\n\n               He embraces her.  Over his shoulder she sees MICKEY MALNANO \n               in the hallway, staring at her.\n\n               He is an older man, hair graying, built like a fireplug.  \n               Sinewy mass strains at his Brooks Brothers suit.\n\n                                     CAESAR\n                         Now why don't you go watch some TV \n                         or something?\n\n                                     MICKEY\n                         Are you okay, Violet?\n\n                                     CAESAR\n                         Mickey, why is Johnnie here?  You \n                         know how I feel about that fucking \n                         psycho.\n\n               Mickey continues to stare at Violet, who looks up at him \n               with her big doe eyes.\n\n                                     MICKEY\n                         Caesar, didn't I tell you to get \n                         something?\n\n                                     CAESAR\n                         Sure, Mickey.  Sure.\n\n               He goes to the kitchen.\n\n               Mickey moves closer to Violet, lifting her chin the way a \n               father would do to his little girl.\n\n                                     MICKEY\n                         You shouldn't have to see this.  Why \n                         don't you get out of here?  Go for a \n                         walk.\n\n                                     VIOLET\n                         Caesar wants me to stay.\n\n                                     MICKEY\n                         Don't worry about Caesar.  I'll handle \n                         Caesar.  You just get out of here, \n                         okay?\n\n               She smiles.\n\n                                     VIOLET\n                         Thanks, Mickey.\n\n               Caesar returns from the kitchen.  He is holding a pair of \n               tin snips.  Mickey takes them.\n\n                                     MICKEY\n                         Thanks, C.  Now let's end this thing.\n\n               Violet watches them return to the bathroom.\n\n               INT.  BATHROOM - DAY\n\n               Mickey takes off his coat and hands it to a large man named \n               LOU.  He slaps Johnnie on the back.\n\n                                     MICKEY\n                         Hey, Johnnie, ease up, okay.\n\n               Johnnie hits Shelly once more.\n\n                                     JOHNNIE\n                         Prick.\n\n               Johnnie checks his hair in the mirror, carefully.  Then he \n               begins putting on the rings he had removed for the beating.\n\n               Mickey kneels down next to Shelly's ear and motions to Lou, \n               who lifts Shelly's bound arms.\n\n                                     MICKEY\n                         Shelly, I'm going to ask you ten \n                         times.  You understand?  Ten times.\n\n               Mickey grabs Shelly's pinky finger, putting it between the \n               metal blades.\n\n                                     MICKEY\n                         One.  Where is our money?\n\n               Shelly whimpers, red-faced and sobbing.  There is a sick \n               crunch and Shelly howls into his gag as his pinky finger \n               bounces to the floor amid the expensive leather footwear.\n\n                                     CAESAR\n                         Aw ...  Christ.\n\n               We hear Caesar retrieve a tissue and his hand enters the \n               frame, scooping up the pinky.\n\n               He plunks the severed finger into the toilet and it sinks to \n               the bottom.\n\n               Caesar drops the toilet seat down and flushes.\n\n               INT.  BATHROOM - EMPTY APARTMENT - DAY\n\n               Corky can't stand it anymore.  She throws her tools down, \n               leaves the bathroom and finds --\n\n               Violet waiting in the main room.  Both women stand apart in \n               silence.\n\n               Violet seems on the verge of saying something but doesn't \n               know how to start.  Her lip begins to quiver; her eyes search \n               the room, returning to Corky each time.\n\n               The violence in the next room can still be heard.\n\n                                     CORKY\n                         Violet?  Are you all right?\n\n               Almost unnoticeably, Violet shakes her bead.  Corky puts her \n               arm around her.\n\n                                     CORKY\n                         Come on.  Let's go.\n\n               INT.  BAR - DAY\n\n               It is the kind of bar businessmen drink at in the afternoon.  \n               Dark wood and padded leather.\n\n               The bartender, joking with a cluster of men, does not notice \n               Corky as she moves up to the bar.\n\n                                     CORKY\n                         Excuse me.\n\n               The bartender glances over.\n\n                                     CORKY\n                         Draft beer and a TNT.\n\n               Corky eyes the men, who stare into their drinks.\n\n               The bartender says nothing as he puts the drinks in front of \n               her.\n\n               Corky heads for her table, ignoring the whispers and snickers.\n\n               Corky and Violet, the only women in the room, sit close \n               together at a far corner table.\n\n               Violet's voice is hushed.\n\n                                     VIOLET\n                         Shelly was skimming from the business.  \n                         He came to see me yesterday because \n                         he was afraid Caesar figured it out.  \n                         He wanted to run but he wanted me to \n                         come with him.\n\n                                     CORKY\n                         Even though he knew about you?\n\n                                     VIOLET\n                         Yes.\n\n                                     CORKY\n                         He was in love with you, right?\n\n                                     VIOLET\n                         That's what he told himself.  But it \n                         wasn't even about me, it was about \n                         Caesar.  He wanted what Caesar had.  \n                         That's how they are.  I understand \n                         them.\n\n               She glances around the room; a man at the bar smiles at her.\n\n                                     VIOLET\n                         For Shelly, taking the money was a \n                         way to take from Caesar.  He could \n                         have run at any time, but he didn't \n                         because he didn't want out.\n\n                                     CORKY\n                         Sounds like he wanted to get caught.\n\n                                     VIOLET\n                         Maybe he did.  He would brag to me \n                         all the time.  He was never afraid \n                         of Caesar because he didn't know \n                         him.  Not like I do.\n\n               Two men sit down near them, laughing.\n\n                                     VIOLET\n                         Caesar lives for these moments.  He \n                         tells me it's just the business, but \n                         I know it's more than that.  He likes \n                         it.  The violence.  I'll catch him \n                         in the bathroom mirror touching his \n                         scars.  He says they remind him who \n                         he his.  They're all like that.  \n                         Except maybe Mickey.\n\n                                     CORKY\n                         Mickey?\n\n                                     VIOLET\n                         He's the part of the business that \n                         the rest of them pretend to be.  \n                         |But Mickey doesn't like it like \n                         they do.  I suppose that's why he's \n                         good at it.\n\n               Violet stares at her glass, at the melting ice.\n\n                                     VIOLET\n                         I used to be able to block it out.  \n                         I would tell myself that I wasn't \n                         really there so nothing really \n                         mattered.  But I can't do it anymore.\n\n               She downs the last of her drink.\n\n                                     VIOLET\n                         I've been making the same mistake \n                         Shelly made.  But now I know what |I \n                         want.\n\n               She turns to Corky.\n\n                                     VIOLET\n                         I want out.  I want a new life.  I \n                         see what I've been waiting for, but \n                         I need you, Corky.\n\n                                     CORKY\n                         For what?\n\n                                     VIOLET\n                         You made a choice once.  Do you think \n                         you would make that same choice again?\n\n                                     CORKY\n                         What choice?\n\n                                     VIOLET\n                         If those quarters fell to the floor, \n                         would you still reach up to that \n                         cash register?\n\n               Corky stares at her, knowing where this is going.  She glances \n               around the crowded bar.\n\n                                     CORKY\n                         Not here.\n\n               EXT.  ALLEY - NIGHT\n\n               Corky's truck sits in a gravel parking lot.\n\n               INT.  CORKY'S TRUCK - DAY\n\n               Through the back window of the truck, Violet and Corky are \n               silhouettes against the street light.\n\n                                     VIOLET\n                         Caesar is going to get the money and \n                         bring --\n\n                                     CORKY\n                         How much money?\n\n                                     VIOLET\n                         Shelly said it was over two million \n                         dollars.\n\n               Corky quietly swallows that pill.  It begins to rain.\n\n                                     VIOLET\n                         Caesar will bring it to the apartment \n                         to count and go through |Shelly's \n                         books to figure out how he did it.\n\n                                     CORKY\n                         Wait a minute.  Wait a minute.  Do \n                         you have any idea what you are saying?  \n                         You are asking me to help you fuck \n                         the mob.\n\n               Violet nods.\n\n                                     CORKY\n                         These people are serious, Violet.  \n                         If you want to know how serious, ask \n                         Shelly.  They're worse than any cop \n                         because they have lots of money and \n                         no rules.  You fuck them, you've got \n                         to do it right.\n\n                                     VIOLET\n                         That's why I need your help.  You \n                         said you were good.\n\n                                     CORKY\n                         I am, but ...\n\n               She knows Violet is challenging her.\n\n                                     CORKY\n                         All right, let's say for the moment \n                         that I believe everything you are \n                         saying.\n\n                                     VIOLET\n                         You think I'm lying?\n\n                                     CORKY\n                         I didn't say that, but since you \n                         did, let's say that you are.  It \n                         would have been easy to set Shelly \n                         up.  You could have got him killed \n                         knowing that Caesar would bring the \n                         money to the apartment.\n\n               Violet stares, her face poker-blank.\n\n                                     CORKY\n                         All you would need to keep yourself \n                         clean would be someone unconnected, \n                         someone like me.\n\n                                     VIOLET\n                         Is that what you think?\n\n                                     CORKY\n                         I'm just making a point.  You have \n                         no idea what you're asking.  How \n                         much trust two people need to do \n                         something like this.\n\n               She moves closer to Violet, the sound of the rain beating \n               against the metal cab.\n\n                                     CORKY\n                         For me, stealing is a lot like sex.  \n                         Two people that want the same thing \n                         sit in a room and they talk, they \n                         start to plan and it's like flirting, \n                         a kind of foreplay, because the more \n                         they talk about it, the wetter they \n                         get.\n\n               She stops.\n\n                                     CORKY\n                         The difference is, I can have sex \n                         with someone I just met, someone I \n                         hardly know, but to steal I need to \n                         know someone like I know myself.\n\n                                     VIOLET\n                         Do you think you know me like that?\n\n                                     CORKY\n                         I think ...\n\n               They are close enough to kiss.\n\n                                     CORKY\n                         We're going to find out.\n\n               Corky pulls back.\n\n                                     CORKY\n                         But first, I want to see this money.\n\n               INT.  CAESAR'S APARTMENT - NIGHT\n\n               Violet springs from the couch as the front door crashes open, \n               Caesar charging in.  He is doubled over, clutching something \n               to his stomach.\n\n               He rushes to the kitchen, dumping a bloody bundle into the \n               double sink.  There is blood everywhere, smeared up and down \n               Caesar's front.\n\n                                     VIOLET\n                         Oh my God ...\n\n               Violet takes a step toward him, unsure of what has happened.\n\n                                     CAESAR\n                         Don't worry.  It ain't mine.\n\n               He pulls a bottle of whiskey and a glass from the cupboard.\n\n                                     VIOLET\n                         Caesar, what happened?\n\n                                     CAESAR\n                         It was unbelievable!  Un-fucking-\n                         believable!\n\n               He pours himeslf a shot, belting it back.\n\n                                     CAESAR\n                         Goddammit, look at this shirt!  It's \n                         ruined!\n\n               He begins unbuttoning the bloody shirt.\n\n                                     CAESAR\n                         It started when Shelly took us to \n                         the money.  I tell you, Mickey Malnato \n                         knows his shit, he does.  Shelly \n                         takes us right there.\n\n               He throws down another shot.\n\n                                     CAESAR\n                         So Shelly's down on his knees and \n                         he's pulling out this bag of money \n                         from a safe in the floor and I'm \n                         staring at it like \"holy fuck!\" I \n                         mean, look at it --\n\n               He tears open the bloody bag, wet money bricks spilling out.\n\n                                     CAESAR\n                         And all I can think is how the fuck \n                         did he do this when - Bang!  Johnnie \n                         caps him.  Blood sprays everywhere, \n                         all over the money.  We've no idea \n                         if this is even all of it.\n\n               Caesar is exasperated.\n\n                                     CAESAR\n                         And right then I go through the roof \n                         and - Boom!  I belt the dumb fuck as \n                         hard as I can.  I didn't care whose \n                         son he was, I just wanted to hit him \n                         again.  Knock some sense into that \n                         dumb son of a bitch.\n\n               He looks at the pile of bloody money.\n\n                                     CAESAR\n                         Just look at this mess I got to deal \n                         with.\n\n                                     VIOLET\n                         What are you going to do with it?\n\n                                     CAESAR\n                         I told them to run it through the \n                         cycles.  But I guess Gino has plans \n                         for it because he's coming here \n                         tomorrow night to pick this shit up.\n\n               Searching through a sink cabinet, he can't find what he needs.\n\n                                     CAESAR\n                         Where the hell's the laundry \n                         detergent?\n\n                                     VIOLET\n                         Ummm ...  in the linen closet.\n\n               Caesar walks down the ball to the bathroom.  Violet's eyes \n               do not move from the pile of money.\n\n               Corky seems to come from nowhere.  She whispers.\n\n                                     CORKY\n                         Come to my place in the morning.  \n                         Early, okay?\n\n               Violet nods.\n\n               INT.  CLOSET - NIGHT\n\n               Corky's hands twitch, and then flex against the ropes that \n               bind them.\n\n               A reflex echoes through her body, muscles spasm and limbs \n               jerk against their bonds.\n\n               As if in a dream, she struggles, trying to get free, fighting \n               toward the edge of consciousness until --\n\n               She seems to succumb, slipping back into stillness.\n\n               We move toward her face, her closed eyes as we again hear \n               the voices in her head.\n\n                                     VIOLET (V.O.)\n                         You're having second thoughts.\n\n               INT.  CORKY'S APARTMENT - DAY\n\n               Violet is on the bed, Corky at the window.\n\n                                     CORKY\n                         ...  no.\n\n               She turns to Violet.\n\n                                     CORKY\n                         You said he washed the money?\n\n                                     VIOLET\n                         Yeah.\n\n                                     CORKY\n                         Then what?  Exactly.\n\n                                     VIOLET\n                         He hung it up.\n\n                                     CORKY\n                         What?\n\n                                     VIOLET\n                         To let it dry.\n\n               She begins to focus on the memory.\n\n                                     VIOLET\n                         It was unreal ...\n\n               Moving in on her face.\n\n                                                              MATCH CUT TO:\n\n               Benjamin Franklin's face on a hundred-dollar bill.\n\n               INT.  CAESAR'S APARTMENT - NIGHT\n\n               Franklin's face rotates as we pull back, seeing rows of bills \n               carefully paper-clipped to lines of string.\n\n                                     VIOLET (V.O.)\n                         Hundreds, paper-clipped everywhere \n                         like leaves.\n\n               Eyes filled with green, Violet turns inside the laundry lines \n               of money until she sees Caesar.\n\n               Wearing his undershirt, he is across the room standing at \n               the ironing board, ironing every single bill.\n\n               He seems to have one eye on her, one eye on his work.\n\n                                     VIOLET (V.O.)\n                         Then one by one, he ironed all of \n                         it.\n\n               He sprays starch across several bills and presses the steaming \n               iron to them.\n\n                                     CORKY (V.O.)\n                         Did he sleep?\n\n               INT.  BEDROOM - NIGHT\n\n               Violet is in bed, unable to sleep, listening to the machine-\n               shuffle of Caesar's bill counter.\n\n                                     VIOLET (V.O.)\n                         No.  But neither did I.\n\n               We move past her, floating toward the wall.\n\n                                     VIOLET (V.O.)\n                         All night long I listened to that \n                         sound.\n\n               INT.  OFFICE - NIGHT\n\n               We drift across Caesar's desk, past bricks of bound bills, \n               as Caesar folds the paper tape around another stack.\n\n                                     CORKY (V.O.)\n                         What sound?\n\n               He hits the counter again and we hear the sound, now very \n               loud as hundreds blur by, fluttering beneath us.\n\n                                     VIOLET (V.O.)\n                         The sound of money.\n\n               The sound rolls into thunder --\n\n               INT.  CORKY'S APARTMENT - DAY\n\n               That seems to shake the apartment.\n\n                                     CORKY\n                         And where is it now?\n\n                                     VIOLET\n                         In his office.  I saw it this morning.\n\n               INT.  OFFICE - DAY\n\n               Violet cautiously enters the office with a cup of coffee.\n\n               Working furiously at the computer, Caesar jumps when he sees \n               her, bloodshot eyes animal-wide.\n\n               He checks his watch as she sets the coffee in front of him.\n\n                                     VIOLET\n                         I need to go to the store.\n\n               He nods automatically, back in his work, as she sees the \n               briefcase filled with perfect rows of hundreds.\n\n                                     VIOLET (V.O.)\n                         It's in a case, on his desk.\n\n                                     CORKY (V.O.)\n                         Does the case lock?\n\n               We see the open top with its silver flip-over locks.\n\n               INT.  CORKY'S APARTMENT - DAY\n\n               Violet is trying to remember.\n\n                                     VIOLET\n                         Yes.\n\n                                     CORKY\n                         Good.\n\n               Corky begins to pace, ordering the information in her head.\n\n                                     CORKY\n                         All right, now, tell me about Johnnie.\n\n                                     VIOLET\n                         Johnnie?\n\n                                     CORKY\n                         It sounded like he and Caesar don't \n                         like each other.\n\n                                     VIOLET\n                         Like each other?  They hate each \n                         other.\n\n                                     CORKY\n                         Why?\n\n                                     VIOLET\n                         It started way before I was around.  \n                         I think basically it's because he \n                         thinks Johnnie is a complete idiot.  \n                         But Johnnie runs Chicago because \n                         Gino is his father.\n\n                                     CORKY\n                         Who is Gino?\n\n               Violet suddenly feels that she has made a mistake.\n\n                                     VIOLET\n                         Gino Marzzone.\n\n                                     CORKY\n                         Marzzone?  As in Angelo Marzzone, \n                         head of the Marzzone family?\n\n                                     VIOLET\n                         That's his brother.\n\n                                     CORKY\n                         ...  shit.\n\n               Corky covers her mouth.\n\n                                     CORKY\n                         Gino Marzzone is coming tonight to \n                         pick up the money?\n\n                                     VIOLET\n                         Yeah.\n\n                                     CORKY\n                         And Johnnie is his son, that's Johnnie \n                         Marzzone?\n\n                                     VIOLET\n                         Yeah.\n\n                                     CORKY\n                         Sweet Jesus.\n\n               Eyes wide, she paces, pulling at her lip, mumbling.\n\n               Suddenly she freezes as it clicks into place.  She looks at \n               Violet.\n\n                                     CORKY\n                         It's perfect.\n\n               She's pacing again.\n\n                                     CORKY\n                         Gino Marzzone is coming to your \n                         apartment.  It's a big deal, isn't \n                         it?  That means Caesar will be ready.  \n                         He doesn't want to look like an idiot.  \n                         Gino has been there before?\n\n                                     VIOLET\n                         Yeah, twice.\n\n                                     CORKY\n                         What happened?\n\n                                     VIOLET\n                         Not much, really.  Caesar was nervous, \n                         kept cleaning the apartment.  |The \n                         first time, he picked out the dress \n                         he wanted me to wear.\n\n               Something occurs to Corky.\n\n                                     CORKY\n                         Does Johnnie hit on you?\n\n                                     VIOLET\n                         Johnnie hits on anything in high \n                         heels.\n\n                                     CORKY\n                         Has Caesar ever seen him?\n\n                                     VIOLET\n                         He does it right in front of him.\n\n                                     CORKY\n                         It's getting better and better.  \n                         Keep going.\n\n                                     VIOLET\n                         Gino doesn't know English, or at \n                         least he pretends he doesn't, so he \n                         doesn't talk much.  He gets right to \n                         the point.  Both times they talked \n                         for about five minutes, had one drink \n                         and then they left.\n\n                                     CORKY\n                         What did Gino drink?\n\n                                     VIOLET\n                         Scotch, Glenlivet.  I remember that \n                         Caesar made a huge deal about it.\n\n               Corky smiles, the wheels rolling.\n\n                                     CORKY\n                         All right ...\n\n               She turns from the window and gets onto the bed.\n\n                                     CORKY\n                         I have an idea to make this work.\n\n               INT.  CAESAR'S APARTMENT - DAY\n\n               Violet is getting dressed, lining her lips with lip-pencil.\n\n                                     CORKY (V.O.)\n                         You'll go back and get ready, take \n                         your time, make it real.\n\n               As she works on her face, we see the room behind her and the \n               discarded dresses scattered about.\n\n                                     CORKY (V.O.)\n                         The more attractive you are, the \n                         more believable it will be.\n\n               INT.  CORKY'S APARTMENT - DAY\n\n               Corky breaks her thought-train.\n\n                                     CORKY\n                         What time did you say they would be \n                         there?\n\n                                     VIOLET\n                         The plane is in at seven, so I'd say \n                         about eight.\n\n                                     CORKY\n                         Any bodyguards?\n\n                                     VIOLET\n                         Gino travels with a big man named \n                         Roy.  Caesar calls him the driver.\n\n                                     CORKY\n                         Fine.\n\n               INT.  OFFICE - DAY\n\n               Caesar again checks his watch.\n\n                                     CORKY (V.O.)\n                         At some point Caesar is going to \n                         quit.  I'd guess sometime around \n                         six, making sure he's got time to \n                         get ready.\n\n               The watch reads 6:10.  Caesar rubs his eyes, his temples.\n\n               INT.  LIVING ROOM - DAY\n\n               Violet is at the bar in a sexy dress and high heels.\n\n                                     CAESAR\n                         Un-fucking-believable, what this guy \n                         did.  Shelly is one smart-ass \n                         mothefucker, I mean, he was one smart-\n                         ass motherfucker.\n\n               He laughs as Violet smiles, handing him an enormous drink.\n\n                                     CORKY (V.O.)\n                         As soon as he is done, you'll be \n                         right there to put a big drink in \n                         his hand.\n\n               He takes the drink.\n\n                                     CORKY (V.O.)\n                         We want him to come down, to relax, \n                         feel in control again.\n\n                                     VIOLET\n                         Poor boy, has to work so hard.\n\n               She gives him a woman's sympathy pout; he knows what it, \n               loves it anyway.\n\n               Smiling, he slides his hand down over her ass.\n\n                                     CAESAR\n                         You look good enough to eat.\n\n               She smiles and waits for the kiss she knows is coming.\n\n               INT.  CORKY'S APARTMENT - DAY\n\n               Both women are starting to feel it, to believe it.\n\n                                     VIOLET\n                         Where will you be?\n\n                                     CORKY\n                         Waiting in the apartment next door.\n\n               INT.  EMPTY APARTMENT\n\n               Corky sits on the floor of the dark apartment.  She has taken \n               off her boots, which are beside her.\n\n                                     VIOLET (V.O.)\n                         Waiting for what?\n\n               Through the wall we can hear the shower.\n\n                                     CORKY (V.O.)\n                         For the shower.  That will be our \n                         signal.\n\n               Corky opens a thin box filled with needle-thin lock picks.\n\n               She selects several and slips them into her multi-pierced \n               ears like earrings.\n\n                                     CORKY (V.O.)\n                         When he's done with his shower, you \n                         will go to the bar.\n\n               INT.  BATHROOM - NIGHT\n\n               In slow motion, Caesar drops the shower plunger and water \n               chokes from the faucet.\n\n               INT.  LIVING ROOM - NIGHT\n\n               Behind the bar, Violet pulls out the bottle of Glenlivet.\n\n                                     CORKY (V.O.)\n                         You'll get out the Scotch that Gino \n                         drinks.\n\n               Violet steps out from the bar, her eyes on the bedroom, when \n               the bottle slips from her hands.\n\n               We watch it slowly fall --\n\n                                     CORKY (V.O.)\n                         And as you do, the bottle will slip \n                         from your hands.  -- and shatter \n                         against the hardwood floor.\n\n                                     CORKY (V.O.)\n                         An accident.\n\n                                     VIOLET\n                         Shit!  Oh shit!\n\n               Caesar yells from the bathroom.\n\n                                     CAESAR (V.O.)\n                         What happened?!\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               Hearing Caesar, Corky gets up, moving quietly toward the \n               door.\n\n                                     CAESAR (V.O.)\n                         V!  What the fuck was it?!  Violet?\n\n               INT. LIVING ROOM - NIGHT\n\n               Caesar enters, a towel wrapped around him, hair still \n               dripping.\n\n                                     CAESAR\n                         V, what?  You can't hear me?\n\n               Violet looks terribly upset as she begins to clean up.\n\n                                     VIOLET\n                         Caesar, it slipped ...  I was trying \n                         to get ready ...\n\n               Caesar realizing what happened.\n\n                                     CAESAR\n                         Oh, fucking Christ ...  You gotta be \n                         kidding me!\n\n               He rushes at her.\n\n                                     CAESAR\n                         Fuck!  Fuck!  How did you ...  Awwww \n                         goddammit!\n\n                                     VIOLET\n                         I'm sorry.  It was an accident.\n\n               She stands up.\n\n                                     VIOLET\n                         Don't worry, I'll get some more.\n\n                                     CAESAR\n                         There's no time.\n\n                                     VIOLET\n                         Don't be silly, Caesar.  It'll take \n                         five minutes.\n\n               She turns him back toward the bedroom.\n\n                                     VIOLET\n                         I'll clean this up and be back before \n                         you're even dressed.\n\n               INT.  HALL - NIGHT\n\n               Violet opens her door, stepping into the hall where Corky is \n               waiting.\n\n                                     CORKY (V.O.)\n                         When you open the door, I'll be there.\n\n               They pass each other in silence, Violet stepping out as Corky \n               slips in.\n\n                                     VIOLET (V.O.)\n                         What if he sees you?\n\n                                     CORKY (V.O.)\n                         He won't.\n\n               INT.  BATHROOM - NIGHT\n\n               Caesar is working intensely on his fingernails.  We glide \n               over a set of gleaming metal manicure tools.  We see his \n               hand as he delicately applies a coat of clear polish to a \n               nail.\n\n               Through the open door, we see Corky moving almost casually \n               across the living room.\n\n               INT.  CORKY'S APARTMENT - DAY\n\n               Corky is looking for something.\n\n                                     VIOLET\n                         You can't know for certain that he \n                         won't see you.\n\n                                     CORKY\n                         Trust me, Violet.\n\n               She finds a black duffel bag from one of her tool buckets.\n\n                                     VIOLET\n                         I'm just asking, what if?\n\n                                     CORKY\n                         If he does ...\n\n               Corky slips her hand in between the mattress and box spring, \n               pulling out a gun.\n\n                                     CORKY\n                         Then I won't have a choice, will I?\n\n               She tosses the gun on the bed.\n\n               INT.  OFFICE - NIGHT\n\n               The black case is lying on the desk, locked shut.  Corky \n               moves around the desk, dropping down behind it.\n\n                                     CORKY (V.O.)\n                         When I'm inside, I will get the money.\n\n               From her earlobe, she chooses the right pick, sliding out \n               the silver tool.\n\n               It takes only a second and the first lock pops open.\n\n               She is working on the other lock when the door is pushed \n               open and Caesar walks in.\n\n               Corky drops down, grasping for her gun --\n\n               As Caesar, wearing only underwear, enters.  He blows on the \n               drying polish on his fingernails before delicately selecting \n               a suit from his closet.\n\n               The gun ready, Corky, pressed against the desk, waits until \n               he leaves.\n\n               She lets her breath out, then pops the second lock, unzips \n               the black duffel bag and quickly empties the case, filling \n               the bag with fat money bricks.\n\n                                     CORKY (V.O.)\n                         I'm going to need something ...\n\n               Finished, she zips up the bag and looks about.\n\n                                     CORKY (V.O.)\n                         ...  to fill the case.\n\n               Sbe sees a stack of newspapers hidden near the desk.\n\n                                     CORKY (V.O.)\n                         Yeah, you should hide it near the \n                         desk before you leave.\n\n               She fills the case, then closes it.\n\n                                     CORKY (V.O.)\n                         At that point --\n\n               She thumbs the locks shut and they snap, unnaturally loud, \n               into place.\n\n               INT.  CORKY'S APARTMENT - DAY\n\n               They are both on the bed.\n\n                                     CORKY\n                         There is no going back.\n\n                                     VIOLET\n                         When I get the Scotch, how do I know \n                         you won't take off?\n\n                                     CORKY\n                         The same way I'll know that you went \n                         to Scotch.  Trust.\n\n               Their faces are close, eyes still trying to read each other.\n\n                                     VIOLET\n                         I still don't see how I'm going to \n                         get clean with the money in the \n                         apartment.  Everyone will think I \n                         did it.\n\n                                     CORKY\n                         Not Caesar.\n\n                                     VIOLET\n                         Why?\n\n                                     CORKY\n                         Because of what you are going to \n                         tell him.  You have to make it as \n                         real as you can.  The moment you \n                         open the door with the Scotch in \n                         your hand, you will be covered, and \n                         that moment is the most important \n                         moment in the plan.\n\n               INT.  CAESAR'S APARTMENT - NIGHT\n\n               The door bursts open.  Violet enters quickly, carrying a \n               bottle in a thin brown bag.\n\n                                     CORKY (V.O.)\n                         If it's real enough, he'll believe \n                         it, because deep down he'll want to.\n\n                                     VIOLET\n                         C!  Shit, I'm sorry!\n\n               Caesar wanders out, tightening his tie.  She looks at her \n               watch.\n\n                                     VIOLET\n                         They were early.\n\n                                     CAESAR\n                         What are you talking about?\n\n                                     VIOLET\n                         They just left, didn't they?\n\n                                     CAESAR\n                         What are you, drunk?\n\n               He smiles, grabbing the bottle from her.\n\n                                     VIOLET\n                         You mean they weren't up here?\n\n                                     CAESAR\n                         No!  They're still on their way.\n\n                                     VIOLET\n                         That doesn't make any sense.\n\n                                     CAESAR\n                         Why?\n\n                                     VIOLET\n                         Because I just saw Johnnie downstairs.\n\n               Caesar turns.\n\n                                     CAESAR\n                         What?\n\n                                     VIOLET\n                         I was getting out of the car when I \n                         saw him in the Mercedes.\n\n                                     CAESAR\n                         It couldn't have been.\n\n                                     VIOLET\n                         It was him.  I'm positive.\n\n                                     CAESAR\n                         It's impossible!\n\n                                     VIOLET\n                         Caesar, I know Johnnie.  It was him.  \n                         I screamed when I saw him.  I couldn't \n                         believe I missed them.  I knew you \n                         were going to be upset so I thought \n                         I'd apologize and give Gino the \n                         Scotch.  I honked a couple of times \n                         but he didn't stop.\n\n               She watches him, her words caving in around him.\n\n                                     CAESAR\n                         But Gino's plane doesn't get in for \n                         another half-hour.\n\n               Violet thinks.\n\n                                     VIOLET\n                         Actually, I didn't see Gino in the \n                         car.\n\n               His eyes dart.  His forehead beads with sweat.  He turns \n               toward the office.\n\n               INT.  CORKY'S APARTMENT - DAY\n\n               Violet is staring at Corky's mouth.\n\n                                     CORKY\n                         If Caesar hates Johnnie like you \n                         say, then the second he opens the \n                         case he'll know, in his gut, that \n                         Johnnie just fucked him.  He'll \n                         realize that he has no choice.  He \n                         can't touch Gino or Johnnie.  There's \n                         only one way out.\n\n               She pauses.\n\n                                     CORKY\n                         He'll have to run.\n\n                                     VIOLET\n                         If he runs, everyone will assume he \n                         took the money.\n\n                                     CORKY\n                         You'll be clean and we'll be rich.\n\n               INT.  OFFICE - NIGHT\n\n               Caesar stands over the desk, afraid to open the case.\n\n               INT.  CORKY'S APARTMENT - DAY\n\n                                     VIOLET\n                         Jesus, that's beautiful.\n\n                                     CORKY\n                         Thank you.\n\n                                     VIOLET\n                         If you're this goddamn smart, how \n                         did you ever get caught?\n\n                                     CORKY\n                         Every job like this has moments where \n                         things don't go so well and everyone \n                         starts thinking about their own ass.  \n                         It's in those moments that everything \n                         comes together or falls apart.\n\n               She looks dead at Violet.\n\n                                     CORKY\n                         I had a partner and she fucked me.\n\n                                     VIOLET\n                         I won't.\n\n                                     CORKY\n                         I think we're going to find out.\n\n               INT.  OFFICE - NIGHT\n\n               The key turns and the locks pop.  When Caesar sees the \n               newspaper, the whole world begins to spin.\n\n                                     VIOLET\n                         Caesar?\n\n               His chest collapses onto itself while his hands ball into \n               fists.\n\n                                     CAESAR\n                         No no no no ...\n\n               She moves around the side of the desk and sees the newspaper.\n\n                                     VIOLET\n                         Oh God ...\n\n               He slams the case shut, his head hanging down.\n\n               After a moment he looks at her, like a little boy about to \n               cry.\n\n                                     CAESAR\n                         ...  I've been set up.\n\n               He seems ready to scream but can't say anything.\n\n                                     VIOLET\n                         Johnnie?\n\n               The name is like water hitting hot oil.\n\n                                     CAESAR\n                         That fuck!  That rat-fuck!  Little \n                         shit rat-fuck!\n\n               He starts punching the desk, each blow harder than the last.\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               Corky can hear him pounding.  She looks down and smiles.  \n               Between her legs is the open bag stuffed with money.\n\n               INT.  CAESAR'S APARTMENT - NIGHT\n\n               Caesar is choking on his own rage.\n\n                                     VIOLET\n                         Why?  Why would Johnnie do this?\n\n                                     CAESAR\n                         Jesus Christ, Violet!  Open your \n                         fucking eyes!  Johnnie hates me like \n                         I hate him!\n\n               He starts to pound his fists against his own head.\n\n                                     CAESAR\n                         I hate that little fuck!  I hate \n                         him!  I hate him!  I should've done \n                         him!\n\n                                     VIOLET\n                         But you know he did it.\n\n                                     CAESAR\n                         So what?!  So fucking what?  Use \n                         your head, Violet.  The money is \n                         gone.  Gino is coming here to get \n                         it.  You think he's going to believe \n                         me if I tell him his piss-hole son \n                         stole it!  Is that what you think?  \n                         I don't.  You know what I think?  I \n                         think I'm a dead man.  I'm one in \n                         the brain.  That's what I think!\n\n                                     VIOLET\n                         Caesar, what are we going to do?\n\n               He grabs hold of his chair, using it to support himself\n\n                                     CAESAR\n                         I know what he wants me to do.  He \n                         wants me out of here.  He wants me \n                         to run.\n\n               She watches him, his body rocking against the chair.\n\n                                     CAESAR\n                         If I run, then everyone will think I \n                         took the money and he walks away \n                         with two million clean.\n\n               The words squeeze out like tears.\n\n                                     CAESAR\n                         God, I can see him right now driving \n                         to get Gino.  I can hear him laughing, \n                         fucking laughing, laughing at me.\n\n               He swings the swivel chair over his head and smashes it down \n               on the desk.  Again and again.\n\n                                     CAESAR\n                         Laughing at me!  Laughing at me!\n\n               The chair falls and he stands alone, covering his face to \n               hide his tears.\n\n                                     VIOLET\n                         C ...\n\n               She goes to hold him.\n\n                                     CAESAR\n                         Don't touch me!\n\n               He backs into the corner of the room.\n\n                                     CAESAR\n                         Just leave me alone!  I got to think!\n\n               Violet watches him trying to wipe the tears and sweat from \n               his face.\n\n                                     CAESAR\n                         Got to think this through ...\n\n                                     VIOLET\n                         Caesar, maybe we should run --\n\n                                     CAESAR\n                         Violet, please!\n\n                                     VIOLET\n                         I mean it, Caesar, forget Johnnie, \n                         forget the money, let's just go now, \n                         before it's too late --\n\n                                     CAESAR\n                         Goddammit, Violet!  Would you just \n                         leave me the fuck alone!  Please!  \n                         Leave!  Now!\n\n                                     VIOLET\n                         All right, Caesar.\n\n               INT.  BEDROOM - NIGHT\n\n               Violet enters, closing the door quietly behind her.  She \n               looks at the wall, then goes to the bed and picks up the \n               phone.\n\n               As she dials, we move along the phone cord, following it \n               down to the jack in the wall.\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               We move out from another jack, following a different cord.\n\n               Corky is sitting with her back to the wall.  The black phone \n               beside her barely rings once before she answers.\n\n               She waits, saying nothing.\n\n                                     VIOLET (V.O.)\n                         It's me.\n\n                                     CORKY\n                         What happened?\n\n               INT.  BEDROOM NIGHT\n\n               Violet whispers, her hand cupped over the mouthpiece.\n\n                                     VIOLET\n                         He totally freaked.  I've never seen \n                         him like this.  He's out of his \n                         fucking mind.\n\n                                     CORKY (V.O.)\n                         That's okay, as long as he believes \n                         it was Johnnie.\n\n                                     VIOLET\n                         Believes it!  Jesus, it's driving \n                         him crazy.  He wants to kill him.  I \n                         don't know, Corky, I don't know what \n                         he is going to do.  I'm getting \n                         nervous, really nervous.\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n                                     CORKY\n                         It's all right, Violet.  It's working.  \n                         All we got to do is wait him out and \n                         see what he does.\n\n                                     VIOLET (V.O.)\n                         What if he doesn't run?\n\n                                     CORKY\n                         That means he probably will kill \n                         Johnnie.\n\n                                     VIOLET (V.O.)\n                         Oh, Christ, I got to get out of here!\n\n                                     CORKY\n                         Listen, if he doesn't run, all you \n                         have to do is break down, go to your \n                         bedroom and pack some things, start \n                         crying, saying you love him but you \n                         can't do it.  You're sorry but you \n                         have to leave and just walk out.\n\n               INT.  BEDROOM - NIGHT\n\n                                     VIOLET\n                         okay, all right.\n\n                                     CORKY (V.O.)\n                         We're almost there, Violet.  just \n                         hang on.\n\n               Violet hears him.\n\n                                     VIOLET\n                         He's coming ...\n\n               She hangs up quickly just as Caesar bursts in.\n\n                                     CAESAR\n                         I got it!  I know what I got to do!  \n                         I got to get the money.\n\n                                     VIOLET\n                         The money?  The money's gone.\n\n                                     CAESAR\n                         No.  Johnnie's got it.  All I got to \n                         do is get it back.\n\n                                     VIOLET\n                         But it could be anywhere.\n\n                                     CAESAR\n                         He didn't have that much time.  He \n                         had to pick up Gino.  I bet you he's \n                         got it with him.  I bet it's in the \n                         car.\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               Corky presses against the wall, trying to hear.\n\n               INT.  CAESAR'S APARTMENT - NIGHT\n\n               Caesar is pacing.\n\n                                     CAESAR\n                         He didn't see you, did he?\n\n                                     VIOLET\n                         No.\n\n                                     CAESAR\n                         See, right now he doesn't know that \n                         I know, that's why he put the paper \n                         in the case.  He wants me to hand \n                         the case to Gino.  Then there is no \n                         doubt it was me.  Gino will put a \n                         bullet in me himself.  But it ain't \n                         going to happen.  I won't let it!  \n                         Johnnie ain't going to fuck me!  Not \n                         like this!  No way!\n\n                                     VIOLET\n                         This is insane!\n\n               She throws open her closet.\n\n                                     CAESAR\n                         What are you doing?\n\n               She grabs a suitcase from under the bed.\n\n                                     VIOLET\n                         I'm leaving!  This is crazy!  I don't \n                         want to be involved.  I don't want \n                         anything to do with this shit!\n\n               She starts yanking the dresses from the closet.\n\n                                     CAESAR\n                         You can't leave.\n\n                                     VIOLET\n                         The hell I can't!\n\n                                     CAESAR\n                         I need you ...\n\n                                     VIOLET\n                         Bullshit!  You don't need me!  You've \n                         never needed me!  I can't help you!  \n                         Understand?!  I have to get out.\n\n                                     CAESAR\n                         Violet, I won't let you leave.\n\n               She turns and sees that he is holding a gun.\n\n                                     CAESAR\n                         If you're not with me, Violet, then \n                         I have to assume you're against me.\n\n                                     VIOLET\n                         Caesar, this is crazy.\n\n                                     CAESAR\n                         Maybe it is, maybe it isn't.  Maybe \n                         you dropped the Scotch by accident.  \n                         Maybe you didn't.\n\n               Now it is her turn to feel the world spin.\n\n                                     CAESAR\n                         It would have been so easy to let \n                         him in as you went out.\n\n                                     VIOLET\n                         You don't, you can't believe that \n                         ...\n\n                                     CAESAR\n                         I've seen the way he looks at you.  \n                         He's always wanted you.  Maybe two \n                         million dollars finally bought you.\n\n               She slaps him hard.  He stares at her.\n\n                                     CAESAR\n                         I'm sorry, Violet, but it has to be \n                         this way.\n\n               He moves past her, picks up the dresses and returns them to \n               the closet.\n\n                                     CAESAR\n                         I hope you understand.  I want to \n                         trust you, I want to believe you, \n                         but I don't have any other choice.\n\n               He shuts the closet.\n\n               INT.  LIVING ROOM - NIGHT \n\n               Caesar is at the bar, drinking the Scotch.  The gun in front \n               of him.  Across the room, Violet sits, staring holes through \n               him.\n\n               They wait in silence.\n\n                                     CAESAR\n                         You sure you don't want a drink?\n\n               Violet says nothing.\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               In the dark, Corky sits, her face, her posture very similar \n               to Violet's.\n\n               She is concentrating, her mind somewhere else, when the door \n               buzzer sounds.\n\n               She turns her head and hears Caesar faintly answering the \n               intercom.\n\n               Corky stands just as --\n\n               INT. CAESAR'S APARTMENT - NIGHT \n\n               Violet stands.\n\n               Caesar faces her for a moment, then shoves the gun into his \n               belt behind his back.\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               Corky watches through the door peep as three men pass by.\n\n               INT.  CAESAR'S APARTMENT - NIGHT\n\n               There is a knock and Caesar opens the door.\n\n               GINO MARZZONE is an old Italian whose face is a mask of \n               irritated indifference.\n\n               ROY, his enormous driver, is behind him.\n\n               Caesar smiles, greeting them in Italian with open arms.\n\n               Johnnie is the last inside.  He has tape over his broken \n               nose.  He smiles and hugs Caesar.\n\n                                     JOHNNIE\n                         You shouldn't have hit me.\n\n                                     CAESAR\n                         You want to get into this now?\n\n                                     JOHNNIE\n                         No, no, Caesar.  Not now.\n\n               He smiles again, patting him on the shoulder, then throwing \n               a fake punch.\n\n               Caesar sees Gino with his bright Italian smile, flattering \n               Violet, kissing her.\n\n                                     GINO\n                         Hey, Caesar!  You take care of this \n                         girl, or I find out!\n\n                                     JOHNNIE\n                         You are as radiant as ever, Violet.\n\n               As he bends to kiss her hand, she sees Caesar watching them.\n\n                                     CAESAR\n                         Glenlivet, right, Gino?\n\n                                     JOHNNIE\n                         I'll have whatever Violet's drinking.\n\n                                     VIOLET\n                         I'm not drinking.\n\n                                     JOHNNIE\n                         Then neither will I.\n\n               This makes Violet very uncomfortable.\n\n                                     VIOLET\n                         No, I'll have a Tanqueray and tonic.\n\n                                     JOHNNIE\n                         Caesar, make that two TNTs.\n\n               Caesar's hand shakes as he pours Gino's Scotch.\n\n               INT.  EMPTY APARTMENT - NIGHT \n\n               Pacing in her socks, Corky tries to think through several \n               possible situations.  She stops, staring at the bag of money.\n\n               The idea of its sitting out in the open suddenly bothers \n               her.\n\n               INT.  CAESAR'S APARTMENT - NIGHT\n\n               Caesar hands Violet and Johnnie a drink.  He stares at her.  \n               She stares back.\n\n                                     JOHNNIE\n                         Salud, eh.  Roy, Violet, Pop, Caesar.\n\n               Caesar watches Johnnie, suspecting everything he does.\n\n               Johnnie reaches into his pocket and takes out a cellular \n               phone.\n\n                                     GINO\n                         No, Johnnie.  No goddamned phones.  \n                         Not now.\n\n                                     JOHNNIE\n                         Pop?\n\n                                     GINO\n                         Caesar, come here.  Sit.  We talk \n                         now.  You too, Johnnie.\n\n               Each man sits on either side of Gino.\n\n                                     GINO\n                         Caesar, look at me.  Johnnie tell me \n                         what happened.  Caesar, you gotta do \n                         me a favor, a personal favor.  For \n                         me, eh?  You gotta start respecting \n                         Johnnie the way you respect me.  You \n                         understand?  Good.\n\n               Caesar sees Johnnie smiling at him, but when Gino turns, the \n               smile disappears.\n\n                                     GINO\n                         And you, Johnnie.  You gonna stop \n                         acting stupid.  You gotta earn this \n                         respect that Caesar's gonna give.  \n                         You understand?  Good.  Done.  Now, \n                         where's my money?\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               Corky drops a hefty bag, knotted tight, into an open five-\n               gallon bucket of paint.\n\n               As she picks up a paint stick, we see a second bag beside \n               another bucket.\n\n               She pushes the first bag down until it disappears, enveloped \n               by the milk-white liquid.\n\n               INT.  CAESAR'S APARTMENT - NIGHT\n\n               Caesar puts the briefcase onto the coffee table.\n\n               Gino looks up at Caesar, very serious, with his hand on the \n               case.\n\n                                     GINO\n                         We know how this was done, eh?\n\n                                     CAESAR\n                         Yeah, I know.\n\n               He looks dead at Johnnie.\n\n                                     GINO\n                         It won't happen again, eh?\n\n               Caesar shakes his head.\n\n                                     GINO\n                         Good.\n\n               Gino throws down the last of the Scotch.\n\n                                     GINO\n                         Done.  We go now.\n\n                                     JOHNNIE\n                         Jesus Christ, Pop.  You got two hours \n                         until your plane leaves.\n\n               Gino checks his watch, shouting in Italian.  Johnnie shouts \n               back until Gino throws up his hands, refusing to listen.\n\n                                     GINO\n                         Caesar!\n\n               He gestures to his empty glass, then folds his arms, leaning \n               back.  Caesar gets the bottle.\n\n                                     JOHNNIE\n                         So Caesar, what did it total out at?\n\n                                     CAESAR\n                         Two point one seventy-six.\n\n               Johnnie whistles as Caesar pours Gino another Scotch.\n\n                                     JOHNNIE\n                         Unbelievable.  Can you believe that, \n                         Violet?\n\n                                     GINO\n                         Hey, Johnnie ...\n\n               In Italian tells him to shut up.\n\n                                     JOHNNIE\n                         Come on, Pop, all I want to know is \n                         one thing.  Just one thing after he \n                         made such a big deal out of it.  I \n                         bet it wasn't a big deal.  Was it, \n                         Caesar?\n\n                                     CAESAR\n                         What's that, Johnnie?\n\n                                     JOHNNIE\n                         The money I bet it was nothing to \n                         get it clean, after you made such a \n                         fucking big deal ...\n\n                                     GINO\n                         Johnnie, what did I say?\n\n                                     JOHNNIE\n                         Pop, this is important to me.  It's \n                         a simple question.  if he would just \n                         answer the question, that's the end \n                         of it.\n\n                                     CAESAR\n                         Where is this going, Johnnie?\n\n                                     JOHNNIE\n                         Just admit it, Caesar.\n\n                                     CAESAR\n                         Admit what?\n\n                                     JOHNNIE\n                         That you overreacted.  That you lost \n                         it.  Not me.  It was your mistake.\n\n               Caesar sees it so clearly now.\n\n                                     CAESAR\n                         All right, Johnnie, you want to play \n                         it this way, I can play it this way.  \n                         You want to know who made a mistake, \n                         why don't you open the case.\n\n                                     VIOLET\n                         Caesar ...\n\n                                     CAESAR\n                         Shut up, Violet!  This is between me \n                         and Johnnie.\n\n               He pushes the case toward him.\n\n                                     CAESAR\n                         You want to do this now, let's do \n                         it.  Open the case.  Open the fucking \n                         case.\n\n               Johnnie stares at him, feeling that something is very wrong.\n\n                                     CAESAR\n                         That's right, I know.  I fucking \n                         know.\n\n                                     JOHNNIE\n                         Know what?\n\n                                     CAESAR\n                         Open the case!\n\n                                     JOHNNIE\n                         All right!  Where's the key?\n\n                                     CAESAR\n                         You don't need a key.\n\n               He tries but it's locked.\n\n                                     JOHNNIE\n                         How the fuck can I open it?\n\n                                     CAESAR\n                         The same way you did before.\n\n                                     JOHNNIE\n                         What are you talking about?\n\n               Caesar smiles and tosses the key onto the table.\n\n                                     CAESAR\n                         There you go, Johnnie.\n\n               He reaches for the key.  Caesar stands up and gives Violet \n               his drink.\n\n                                     CAESAR\n                         Get me another.\n\n               He can see the fear on her face as she goes to the bar.\n\n               Time drips.\n\n               The key turns.  One lock pops.\n\n               Then the other.\n\n               Tbe case opens like a scream and Johnnie sees the newspaper.\n\n                                     JOHNNIE\n                         What the ...\n\n               Before anybody can move, Caesar whips around with his gun.\n\n               Roy jumps off his stool, his drink crashing to the floor.\n\n                                     CAESAR\n                         Don't!  Don't fucking move!\n\n               Nobody can believe what is happening.\n\n                                     GINO\n                         Caesar?  What is this?\n\n                                     CAESAR\n                         Ask Johnnie!  Ask your rat-fuck son!\n\n                                     JOHNNIE\n                         What the fuck?\n\n               Caesar levels the gun.\n\n                                     CAESAR\n                         You don't think I'll do it, do you?\n\n                                     JOHNNIE\n                         I think you're fucking crazy!\n\n                                     CAESAR\n                         Where is it?\n\n                                     JOHNNIE\n                         Where's what?\n\n                                     CAESAR\n                         The money!\n\n                                     JOHNNIE\n                         Caesar, I don't know what you're \n                         thinking here, but if you don't put \n                         down that gun --\n\n               He stands up.\n\n                                     CAESAR\n                         Sit down!\n\n               He does.\n\n                                     GINO\n                         Caesar!\n\n                                     CAESAR\n                         Gino, your son stole this money to \n                         set me up and I can prove it.  Violet!\n\n               She doesn't know what to say.\n\n                                     CAESAR\n                         Tell them!  Tell them!\n\n                                     VIOLET\n                         For Christ's sake, Johnnie, do what \n                         he says.\n\n                                     JOHNNIE\n                         This isn't happening ...\n\n               Boom!  Caesar blows a hole in the couch right between \n               Johnnie's legs.  Johnnie screams.\n\n                                     CAESAR\n                         The next one blows off your dick.\n\n                                     JOHNNIE\n                         You're a dead man!  A fucking dead \n                         man!\n\n                                     CAESAR\n                         Where is it?\n\n                                     GINO\n                         Enough!\n\n               Gino jumps up.\n\n                                     CAESAR\n                         No, Gino!\n\n                                     GINO\n                         You aim a gun at me?!  Do you know \n                         who I am?!  I am Gino Marzzone.  You \n                         understand?\n\n               He starts walking toward Caesar.  Roy moves around for a \n               good angle.\n\n                                     CAESAR\n                         Sit down, Gino!\n\n                                     GINO\n                         No, Caesar, gimme the gun.\n\n                                     CAESAR\n                         Stay away!\n\n               He backs up as Gino walks straight to him.\n\n                                     GINO\n                         We're family, Caesar.\n\n                                     CAESAR\n                         No!\n\n                                     GINO\n                         Gimme the gun.\n\n                                     CAESAR\n                         I can't.  I can't.\n\n                                     GINO\n                         Give it to me.\n\n               He reaches up and takes bold of the barrel.  Caesar looks \n               resigned as he shuts his eyes.\n\n                                     GINO\n                         Good man.\n\n               Close on Gino's hand holding the gun barrel as --\n\n               Caesar fires.\n\n               From behind the gun we watch Gino's grip yanked free, time \n               melting away as he falls, blood bubbling from his chest, his \n               eyes wide in disbelief.\n\n               His body hits the floor and the room erupts.\n\n               Roy dives, drawing his gun as Caesar continues to fire, \n               pumping the trigger.\n\n               Violet drops behind the bar as Jobnnie screams, falling \n               towards his father.\n\n               Blood spurts from Roy as two bullets hit, his gun clattering \n               and sliding across the floor.\n\n               Johnnie lunges at Caesar as Caesar turns and fires, hitting \n               Johnnie everywhere; blood and meat spray and speckle \n               everything around him.\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               The gun continues to fire as Corky clutches the phone, \n               whispering.\n\n                                     CORKY\n                         This is an emergency!\n\n               INT.  CAESAR'S APARTMENT - NIGHT\n\n               Crunched down behind the bar, Violet listens to the only \n               sound, repeating in the unnatural quiet:\n\n               Click.  Click.\n\n               Click.\n\n               Rising, she peers over the edge of the bar.\n\n               Caesar is standing in the aftermath.  His gun is still aimed \n               at Johnnie as he pulls the trigger over and over.\n\n               The bodies are still, blood silently pooling around them.\n\n               Blinking the sweat from his eyes, Caesar sees Violet.\n\n                                     CAESAR\n                         I had to do it, Violet.  You saw it.  \n                         I had no choice.  It was Johnnie.  \n                         That lying fuck.  He made me do it.\n\n               He looks down at Jobnnie, hate rising like bile.\n\n                                     CAESAR\n                         You lying rat-fuck.  You think you \n                         can set me up?  Is that what you \n                         think?  You stupid fuck.\n\n               Kicking the body, be causes a series of sickening wet noises.\n\n                                     CAESAR\n                         I'm a dead man?  I'm a dead man?  \n                         Guess again, fuck-face.  Who's dead?  \n                         Who's the dead lying rat-fuck?  Take \n                         another guess, take another fucking \n                         guess!\n\n               He stops, panting, unable to catch his breath.  Violet is \n               afraid to even look at him.\n\n               Blood creeps along the edge of the floorboards.\n\n               Caesar tries to clear his head, mopping the sweat from his \n               face.  He bends down and starts searching Johnnie's pockets.\n\n               He finds his keys.\n\n                                     VIOLET\n                         What are you doing?\n\n               Lost in thought, he goes to Gino.  Throwing open the coat, \n               he sees the airplane ticket.  There is a bullet hole in it.\n\n               He checks the times and then his watch.\n\n                                     CAESAR\n                         ...  maybe three hours.\n\n                                     VIOLET\n                         Caesar, what are you going to do?\n\n                                     CAESAR\n                         What do you think we're going to do?  \n                         We have to find the money.\n\n                                     VIOLET\n                         What?\n\n                                     CAESAR\n                         Once we have the money, then none of \n                         this ever happened.\n\n                                     VIOLET\n                         Caesar, you just killed Gino Marzzone.\n\n                                     CAESAR\n                         No I didn't.  Not if his body \n                         disappears and not if the money is \n                         still here.  Then they never showed \n                         up.\n\n                                     VIOLET\n                         What happened to them?\n\n                                     CAESAR\n                         I don't know.  We may never know, \n                         but I'm going to guess it was a job, \n                         maybe the Karpoli family.\n\n               He smiles.\n\n                                     CAESAR\n                         All part of the business.\n\n               He picks up Roy's gun and stuffs it in his belt.\n\n                                     CAESAR\n                         We just got to find the money.  Once \n                         we do, everything is going to be all \n                         right.\n\n               In the distance, the wail of a police siren can be heard.\n\n               EXT.  PARKING LOT - NIGHT\n\n               Through the window they see a squad car, lights blaring, \n               roll up in front of the building.\n\n               INT.  CAESAR'S APARTMENT - NIGHT\n\n                                     VIOLET\n                         Oh, no.\n\n               He turns back to the carnage.\n\n                                     CAESAR\n                         Fuck.\n\n                                     VIOLET\n                         Caesar, what are we going to do?\n\n                                     CAESAR\n                         They're just cops.  Stall them as \n                         long as you can.\n\n               Caesar flies into action.\n\n               Grunting, he hauls Gino's body up, drags it to the bathroom \n               and throws it into the tub.  He returns for Johnnie's body.\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               Standing near the bathroom, Corky hears the metal echo of \n               the tub.  Looking at her tub, she imagines what he is doing.\n\n               Through the wall, she hears the door buzzer.\n\n               INT. CAESAR'S APARTMENT - NIGHT\n\n               The buzzer sounds again as Violet sees him lift Roy's body.\n\n                                     CAESAR\n                         Answer it!\n\n               He heads back to the bathroom, dropping Roy onto the other \n               two.\n\n               The three bloody bodies fill the tub.\n\n               We see Johnnie's arm hanging over the edge as Caesar snaps \n               the shower curtain around, hiding them.\n\n                                     VIOLET\n                         Hello?\n\n                                     COP #1 (V.O.)\n                         This is the police, ma'am.\n\n               She cuts them off using the intercom.\n\n                                     VIOLET\n                         The police?\n\n               Over her shoulder she sees Caesar moving the furniture, \n               clearing the area around the heavy bloodstains.\n\n                                     COP #1 (V.O.)\n                         We had a report of gunfire, so if \n                         you could --\n\n                                     VIOLET\n                         Gunfire?  Is this a joke?\n\n               Violet sees Caesar hurry to his office.\n\n                                     COP #1 (V.O.)\n                         No joke, ma'am.  Please open the \n                         door.\n\n                                     VIOLET\n                         How do I know you are cops?\n\n               INT.  OFFICE - NIGHT\n\n               Caesar seizes the beautiful oriental rug in his office and \n               yanks it up, overturning furniture.  Dragging it out, he \n               slams the door behind him.\n\n               INT.  LIVING ROOM - NIGHT\n\n               Violet looks at Caesar, who is working with the calm, single-\n               minded focus of a machine.\n\n                                     COP #1 (V.O.)\n                         Ma'am, you have to open the door.\n\n                                     VIOLET\n                         All right.\n\n               She buzzes them in as Caesar throws the rug like someone \n               making a bed, letting it fall to the floor and cover most of \n               the blood.\n\n               INT.  LOBBY - NIGHT\n\n               The cops are waiting for the elevator.  After a moment, the \n               door slides open.\n\n               INT.  CAESAR'S APARTMENT - NIGHT\n\n               Violet moves away from the intercom as Caesar begins arranging \n               the furniture on the rug.\n\n                                     CAESAR\n                         Get me a wet towel.\n\n               His words push her to the bathroom.\n\n               INT.  BATHROOM - NIGHT\n\n               Stuffing a towel into the sink, she turns on the water.  She \n               does not even look at the shower curtain.\n\n               INT.  HALL - NIGHT\n\n               The elevator opens and the cops step out.\n\n               INT.  CAESAR'S APARTMENT - NIGHT\n\n               Caesar grabs the television remote, hits \"on\" and jacks the \n               volume until it is obviously loud.\n\n               Violet returns and he snatches the towel from her.\n\n               INT.  HALL\n\n               As the two cops walk down the hall, they hear the television.  \n               They look at each other, already knowing what happened.\n\n               INT.  CAESAR'S APARTMENT - NIGHT\n\n               Like a maniac, Caesar wipes at any blood still visible until \n               there is a knock on the door.  He grabs Violet by the arm.\n\n                                     CAESAR\n                         If you're thinking about doing \n                         something stupid, remember I just \n                         killed Gino Marzzone.  You understand \n                         what that means?\n\n               She nods.\n\n                                     VIOLET\n                         They're just cops.\n\n               There is another knock, much louder.\n\n               Violet goes to the door as Caesar rips off his blood-soaked \n               jacket and shirt.\n\n               He drops down behind the bar Leaving the chain on, Violet \n               opens the door.  Tbe cops smile.\n\n                                     COP #1\n                         See?  We're for real.\n\n                                     VIOLET\n                         I'm sorry, it's just you hear stories.\n\n                                     COP #1\n                         You did the right thing.\n\n               Crouching, Caesar wipes vigorously at the blood on his hands \n               and face.\n\n               Violet opens the door.\n\n               Caesar crams the bloody wad under the bar sink.\n\n               Just as the cops enter the living room, Caesar stands, looking \n               comfortable in no shirt, with ice cubes in his hands.\n\n                                     CAESAR\n                         Hey, hey, Chicago's finest.\n\n               He plunks the ice into a glass and walks from behind the bar\n\n                                     CAESAR\n                         How's it going tonight, fellas?\n\n                                     COP #1\n                         Pretty good, sir.\n\n               Caesar turns his head.\n\n                                     CAESAR\n                         Huh?  I'm sorry, I can only hear in \n                         this ear.\n\n               Tbe cops look at each other again.\n\n               Wiping his wet hand on his pants, Caesar shakes hands with \n               each of them.\n\n                                     CAESAR\n                         I'm Caesar and this here is my Violet.\n\n               They smile at Violet as Caesar puts his arm around her.\n\n                                     CAESAR\n                         Violet said something about gunshots?\n\n               Violet sees the gun wedged in the back of his belt.\n\n                                     COP #2\n                         Yes, sir, a neighbor in the building \n                         called in.\n\n                                     COP #1\n                         I think we know what happened.\n\n                                     COP #2\n                         It was probably just the television.\n\n                                     CAESAR\n                         The television?\n\n               He looks at Violet.\n\n                                     CAESAR\n                         Honey, why didn't you say something?  \n                         Turn it off.\n\n               Violet walks across the rug and turns off the TV.\n\n                                     CAESAR\n                         Fuck, this happened before.  It's \n                         this shitty ear.  Born with it.  The \n                         batteries wore out in my aid.  I'm \n                         sorry.\n\n                                     COP #1\n                         It's all right, sir.\n\n                                     COP #2\n                         No big deal.\n\n                                     CAESAR\n                         Hey, can I get you guys a beer?\n\n                                     COP #1\n                         Not on duty, sorry.\n\n                                     CAESAR\n                         Oh, right.\n\n                                     COP #2\n                         But, uh, would you mind if I used \n                         your bathroom?\n\n               Caesar's face tightens.\n\n                                     CAESAR\n                         Yeah, why not?  It's right there.\n\n                                     COP #2\n                         Thanks.\n\n               He heads for the john.\n\n               Violet watches Caesar back up to the bar, moving behind it.\n\n                                     CAESAR\n                         I'm going to make myself a drink, if \n                         that's okay?\n\n                                     COP #1\n                         Go right ahead, sir.\n\n               INT.  BATHROOM NIGHT\n\n               Cop #2 enters, walking right past the shower curtain.  We \n               hear his sigh as he starts to piss.\n\n               INT.  LIVING ROOM - NIGHT\n\n               Cop #1 walks onto the rug, looking around, turning to Violet.\n\n                                     COP #1\n                         This is a beautiful place.\n\n                                     VIOLET\n                         ...  thank you.\n\n               She stares at his shoes on the rug.\n\n               Watching everything, Caesar takes a sip of his drink.  He \n               slips his gun out and holds it at his side.\n\n               INT.  BATHROOM - NIGHT\n\n               There is a bulge in the shower curtain where we imagine \n               Johnnie's arm is hanging.\n\n               Slowly we slide down to the bottom edge of the plastic \n               curtain, where a drip of blood forms and --\n\n               Plips into a small red spot on the white tile floor.\n\n               INT.  LIVING ROOM - NIGHT\n\n               Close on the heel of the cop's black shoe, where we can almost \n               see the blood seeping up through the oriental rug.\n\n                                     COP #1\n                         Is this a condo?\n\n               Violet nods.\n\n               Everyone turns when Cop #2 busts out of the bathroom.\n\n                                     COP #2\n                         Okay, let's roll.\n\n               Cop #1 walks across the rug to the hardwood floor.  He turns \n               to Caesar.\n\n                                     COP #1\n                         Try to keep the extra batteries for \n                         your aid around.\n\n                                     CAESAR\n                         Good idea.\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               Corky hears the cop say goodbye to Violet.  The door closes.  \n               She isn't sure what she should do.\n\n               Over her shoulder, she notes the bucket of paint.  She lets \n               the cops leave.\n\n               INT.  CAESAR'S APARTMENT - NIGHT\n\n               Caesar puts on a new shirt, the gun stuffed in his pants.\n\n                                     CAESAR\n                         Let's go.\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               Corky rises at the sound of Caesar's door closing.\n\n               We track her along the wall to the foyer as she follows the \n               faint sounds of Caesar and Violet's footsteps.\n\n               INT.  HALL - NIGHT\n\n               As they pass by, Violet looks up to the door of the empty \n               apartment, straight at the peephole.\n\n               INT.  EMPTY APARTMENT Corky is pressed against the door, eye \n               at the peephole.\n\n               She sees that Violet is afraid as the two women seem to speak \n               to each other with their eyes.\n\n                                     CORKY\n                         ...  shit.\n\n               EXT.  PARKING LOT - NIGHT\n\n               Caesar is on his knees, searching under the seats of Johnnie's \n               Mercedes.  Unable to find the money, he is ready to snap.\n\n               From the main doors, Corky slips out of the building.  Hiding \n               behind a column, she sees Violet and Caesar across the lot.\n\n               Corky moves behind the parked cars, the gun squeezed in her \n               hand.\n\n               Violet edges away, on the verge of running, looking toward \n               the busy street.\n\n               Standing, Caesar pounds on the car.\n\n                                     CAESAR\n                         Fuck!  Fuck!  Fuck!\n\n                                     VIOLET\n                         Caesar, someone could see us out \n                         here.\n\n               Ignoring her, be tries to think.\n\n                                     CAESAR\n                         Get in.\n\n               Still too far from them to do anytbing, Corky sees Caesar \n               slam the trunk.\n\n                                     CAESAR\n                         Get in!  It's got to be at his house.  \n                         That's the only other place it could \n                         be.\n\n               Violet looks around the lot, looking for some way out.\n\n                                     CAESAR\n                         Violet!  Now!\n\n               Corky can only watch as Violet gets in and the car rips away.\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               Alone, Corky stands over the bucket of paint.  She kicks it \n               with her boot-toe.\n\n                                     CORKY\n                         Two million dollars, Cork ...  Two \n                         million dollars ...\n\n               She sighs, wondering how long she can make herself wait.\n\n               EXT.  JOHNNIE'S BROWNSTONE - NIGHT\n\n               The BMW is parked in front.\n\n               INT.JOHNNIE'S BROWNSTONE - NIGHT\n\n               Close on Caesar, as he rakes his sweaty hair back, his face \n               knotted in torment.\n\n                                     CAESAR\n                         Okay, I come in ...\n\n               He turns as if he just came in through the front door.\n\n               We see Johnnie's home has been laid to waste.  The furniture \n               is broken, cushions split open, pictures shattered, holes \n               punched in the drywall -- even the carpeting has been torn \n               up.\n\n               Caesar doesn't look much better.\n\n                                     CAESAR\n                         I've got the money ...\n\n               Huddled in a corner, Violet watches him.\n\n                                     CAESAR\n                         I can't wait to see the look on \n                         Caesar's face when he finds out.\n\n               Caesar moves from the front door, trying to get into Johnnie's \n               head.\n\n                                     CAESAR\n                         Now I don't have much time ...\n\n               He takes a couple of steps into the room.\n\n                                     CAESAR\n                         Got to put it someplace safe ...\n\n               He looks at a closet.  It's gutted, searched 10 times already.\n\n                                     CAESAR\n                         ...  put it ...\n\n               A couple more uneasy steps and he looks at a large over-turned \n               rolltop desk.\n\n                                     CAESAR\n                         ...  got it ...\n\n               He starts looking around the room as if he is seeing for the \n               first time that it is destroyed.  He is near the breaking \n               point.\n\n                                     VIOLET\n                         C?\n\n               His voice cracks.  There is nowhere else to look.\n\n                                     CAESAR\n                         Where did I put it?\n\n               He explodes.  A terra cotta lamp sails across the room.\n\n                                     CAESAR\n                         Where's my fucking money?!  Fucking \n                         cocksuckers!  Where the fuck is it?!\n\n               He smashes his forehead into the wall, denting the drywall.\n\n                                     CAESAR\n                         Ow.\n\n               He holds his head, sinking to the ground.\n\n                                     VIOLET\n                         C?\n\n               She sits next to him, putting a hand lightly on his shoulder.\n\n                                     VIOLET\n                         It's not here, Caesar.\n\n                                     CAESAR\n                         Where, then?\n\n                                     VIOLET\n                         I don't know.  it could be anywhere.  \n                         We don't even know if he was alone.  \n                         Please, Caesar, we don't have much \n                         time.  Let's get out of here.\n\n               He knows what he has to do.  Digging through the debris, he \n               finds the phone.\n\n                                     VIOLET\n                         What are you doing?\n\n                                     CAESAR\n                         We're going to need some time.\n\n                                     VIOLET\n                         Who are you going to call?\n\n               Already dialing, he does not answer\n\n                                     VIOLET\n                         Caesar?\n\n               Ceaar takes a deep breath, mustering composure.\n\n                                     MICKEY (V.O.)\n                         Yeah?\n\n                                     CAESAR\n                         Hey, Mickey.\n\n                                     VIOLET\n                         Oh, God.\n\n                                     MICKEY (V.O.)\n                         Caesar?  What the fuck time is it?\n\n                                     CAESAR\n                         Mick, I know it's late, but there is \n                         a problem.  They haven't shown up \n                         yet.\n\n                                     MICKEY (V.O.)\n                         What?  They ain't there?\n\n                                     CAESAR\n                         No.  I don't know where they are.  I \n                         even called over at Johnnie's, but \n                         no answer.\n\n                                     MICKEY (V.O.)\n                         Okay.  Let me call around.  I'll see \n                         what I can do.  Don't go anywhere, \n                         okay?\n\n                                     CAESAR\n                         Okay, sure, Mick.\n\n                                     MICKEY (V.O.)\n                         Caesar, you still got the money?\n\n               Caesar looks at Violet.\n\n                                     CAESAR\n                         Yeah, Mick.  I've got the money.  \n                         I'm staring right at it.\n\n                                     MICKEY (V.O.)\n                         Good.  Sit tight.  I'll call you.\n\n               He hangs up.\n\n               INT. CAESAR'S APARTMENT - NIGHT \n\n               Caesar drags himself in.  Violet closes the door behind them.\n\n               Caesar moves into the room where it happened.  He is dizzy \n               and confused and does not want to be here.\n\n               Violet turns him around.\n\n                                     VIOLET\n                         I'll start packing.  You know what \n                         you have to do.\n\n               She turns him toward the bathroom.  He nods.\n\n                                     CAESAR\n                         I can use Johnnie's car, dump it in \n                         Lake Michigan ...  I need plastic \n                         bags ...  tape and rope ...\n\n                                     VIOLET\n                         Just hurry.\n\n               Nodding, he heads for the kitchen.\n\n               INT.  BEDROOM - NIGHT\n\n               Violet enters and goes straight for the phone.  She looks at \n               the blank wall as she dials.\n\n                                     VIOLET\n                         Please, Corky ...\n\n               The phone rings.\n\n               When Corky answers, Violet almost collapses with relief.\n\n                                     VIOLET\n                         Oh, thank God.\n\n                                     CORKY\n                         I'm still here.\n\n                                     VIOLET\n                         I was so afraid you ...\n\n                                     CORKY\n                         You don't quit on me, Violet, and I \n                         won't quit on you.\n\n               INT.  KITCHEN - NIGHT\n\n               A box of Hefty bags tucked under his arm, a coil of \n               clothesline in his hand, Caesar searches through several \n               cabinets.\n\n               INT.  BEDROOM - NIGHT\n\n               Violet glances at the door.\n\n                                     VIOLET\n                         Corky, it worked!  He's going to \n                         run.  He needs to take care of the \n                         bodies to buy himself time, but as \n                         soon as he leaves, it's over.\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               Corky falls against the wall.\n\n                                     VIOLET (V.O.)\n                         just a little longer and it's ours.\n\n               INT.  KITCHEN - NIGHT\n\n               Mumbling to himself, Caesar walks out of the kitchen, heading \n               for the bedroom.\n\n               INT.  BEDROOM - NIGHT\n\n               Violet reaches out and touches the wall, as if she were \n               touching Corky.\n\n                                     VIOLET\n                         Corky, I have to tell you something \n                         ...\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               Corky turns to the wall.\n\n                                     CORKY\n                         I know, Violet.  I know.\n\n               Her fingers gently touch the wall as we travel up and over, \n               where we see they are actually touching the wall in the exact \n               same place.\n\n                                     CORKY\n                         It's why I'm still here.\n\n               INT.  BEDROOM - NIGHT\n\n               Suddenly, Violet hears Caesar.\n\n                                     CAESAR (V.O.)\n                         Violet?\n\n               As he opens the door, she slams down the phone.\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               The line cuts off.\n\n               INT.  BEDROOM - NIGHT\n\n               Fear and panic paralyze Violet as Caesar drops everything, \n               grabbing for his gun.\n\n                                     CAESAR\n                         Who was that?\n\n               He levels the gun at her.\n\n                                     CAESAR\n                         Who the fuck was that?\n\n               She stands and be rushes at her, grabbing her by the throat.\n\n                                     CAESAR\n                         Was that Mickey?  Did you call Mickey?  \n                         Did you?!\n\n               She shakes her head and he throws her on the bed.  The gun \n               aimed at her, he picks up the phone and --\n\n               Hits the redial.\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               Unsure of what happened, Corky hears the phone ring and \n               answers it on reflex.\n\n               Listening, she waits.\n\n               INT.  BEDROOM - NIGHT\n\n               Caesar listens, waiting as long as he can.\n\n                                     CAESAR\n                         Mickey?  Is that you?\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               Corky hangs up, jumping away from the wall.\n\n               INT.  BEDROOM - NIGHT\n\n               Caesar hits the redial again.\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               Panicking, Corkydoesn't answer it, but as it rings very loud \n               in the empty apartment, she realizes her mistake.\n\n               INT.  BEDROOM - NIGHT\n\n               Turning slowly toward the wall, Caesar hears the phone ringing \n               in the empty apartment.\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               Corky rips the plug out of the wall.\n\n               INT.  BEDROOM - NIGHT\n\n               The line goes dead.\n\n                                     CAESAR\n                         Who is that?  Who is over there?!  \n                         Tell me!\n\n               She tries to get away, but he grabs her and slaps her to the \n               ground.\n\n               INT.  EMPTY APARTMENT\n\n               Corky hears Violet scream and that does it.  Gun in hand, \n               she flies at the door.\n\n               INT.  BEDROOM - NIGHT\n\n               The door to the empty apartment slams shut and Caesar, hearing \n               it, starts to run --\n\n               But Violet reaches out, catching his ankle, sending him \n               crashing to the dresser.\n\n                                     VIOLET\n                         Run!  Just run!\n\n               INT HALL - NIGHT\n\n               The door to Caesar's apartment is locked.  Corky falls to \n               one knee, whipping two lock picks from her earlobe.\n\n               INT.  BEDROOM - NIGHT\n\n               Caesar raises the gun to pistol-whip Violet and she screams.\n\n               INT.  HALL - NIGHT\n\n               Working the lock, Corky hears Violet's scream cut off.\n\n               She feels the tumblers click, and rotates the cylinder.\n\n               A shadow stirs under the crack of the door as she hears \n               something that sounds like footsteps.  Corky freezes.\n\n               Corky presses down low against the door beneath the peephole.\n\n               She can almost feel Caesar beyond the door, but grits her \n               teeth and turns the doorknob.\n\n               INT.  APARTMENT - NIGHT\n\n               The door cracks open and Corky slips in, gun-first.  As she \n               moves into the room, we see Caesar behind her.\n\n               He puts his gun to her head.\n\n                                     CAESAR\n                         Drop the fucking gun or die!\n\n               Corky hesitates.\n\n                                     CAESAR\n                         Drop it!\n\n               She does.\n\n                                     CAESAR\n                         Turn around.\n\n               Rising from her crouch, she turns and he recognizes her.\n\n                                     CAESAR\n                         You!?  Holy fucking Christ!  You \n                         gotta be kidding me!\n\n               He starts to laugh when she strikes --\n\n               Knocking the gun, she punches him, slamming him back against \n               the door as --\n\n               She twists, diving, grabbing her gun, just as --\n\n               He steps and kicks her full in the face.\n\n               INT.  CLOSET - NIGHT\n\n               Still unconscious, Corky's head jerks, reacting to the kick.  \n               We see the dried blood caked to her check where his kick \n               split the skin.  She is again swimming toward consciousness.\n\n               We hear water splash, her face flinching as we move closer, \n               the sounds and voices echoing.\n\n                                     CESAR (V.O.)\n                         Wake up!  Come on, you fucking dyke!\n\n               We hear Caesar slapping her.\n\n                                     CAESAR (V.O.)\n                         Wake up!\n\n               INT.  BEDROOM - NIGHT\n\n               Corky's face is dripping with water as her eyes slowly blink \n               open.\n\n               Coming into focus is Caesar, standing over her with an empty \n               glass in one hand.\n\n                                     CAESAR\n                         Good.\n\n               Except for the gag, she is bound as we have seen her bound \n               in the closet.\n\n               Caesar yanks out his gun and puts it to her head.\n\n                                     CAESAR\n                         I know everything now so I don't \n                         want to hear any \"I don't know\" \n                         bullshit, you understand?\n\n               She sees Violet on the bed, also bound hand and foot.\n\n                                     CAESAR\n                         God, I should have seen this coming!  \n                         The second I met you, I knew it.  \n                         Everyone knows your kind can't be \n                         trusted!  Fucking queers make me \n                         sick.\n\n               The gun digs into her cheek.\n\n                                     CAESAR\n                         But you tried to fuck the wrong guy.  \n                         And I swear to you that I'm going to \n                         kill you for it.\n\n               He thumbs back the hammer.\n\n                                     CAESAR\n                         Where is the money?\n\n                                     VIOLET\n                         Don't tell him --\n\n                                     CAESAR\n                         Shut up, Violet!\n\n                                     VIOLET\n                         He can't kill you --\n\n               He aims the gun at Violet.\n\n                                     CAESAR\n                         Violet!\n\n                                     VIOLET\n                         Not until he has the money!\n\n               He fires and she jumps as the bullet punches through the \n               wall behind her.\n\n               His point made, he puts the gun back to Corky's head.\n\n                                     CAESAR\n                         Now, where the fuck is my money?\n\n                                     CORKY\n                         Lick me.\n\n                                     CAESAR\n                         Where is it?\n\n                                     CORKY\n                         Either pull the trigger or get that \n                         thing out of my face.\n\n               Blood temperature rising again, Caesar pulls the gun back \n               and slaps her with it.\n\n                                     CAESAR\n                         Stupid cunt!\n\n                                     VIOLET\n                         Caesar, stop acting like an asshole \n                         and think --\n\n                                     CAESAR\n                         Don't try to tell me what to do.\n\n                                     VIOLET\n                         You need the money just like we do.\n\n                                     CAESAR\n                         Shut up, Violet.\n\n                                     VIOLET\n                         Let us go and we'll make a deal.\n\n               He rushes at her, grabbing a fistful of her hair.\n\n                                     CAESAR\n                         Shut the fuck up!\n\n               He looks at Corky.\n\n                                     CAESAR\n                         What did you do to her?!  This isn't \n                         my Violet!\n\n               He looks at her as if unable to recognize her\n\n                                     CAESAR\n                         What did she do to you?\n\n                                     VIOLET\n                         Everything you couldn't.\n\n               He shoves her down.\n\n                                     CAESAR\n                         You ungrateful bitch!  You had nothing \n                         before I met you.  You were nothing!\n\n               He stomps around the room.\n\n                                     CAESAR\n                         Who gave you this place?  This \n                         apartment?\n\n               He throws open the closet.\n\n                                     CAESAR\n                         Who gave us all of this?  I did!  I \n                         gave you everything!  I gave you \n                         this life!  I made you, Violet.  I \n                         saved you.\n\n               He seems to believe what he is saying.\n\n                                     CAESAR\n                         I saved you.\n\n                                     VIOLET\n                         Ha!  What a load of crap.  Look at \n                         yourself, Caesar.  You're a thug.  \n                         |You launder money for the mob.  You \n                         rent women like you rented this \n                         apartment.\n\n               He doesn't want to hear this.\n\n                                     VIOLET\n                         Saved me?  You don't even know me.  \n                         You used me, Caesar, just like I \n                         used you.  All part of the business.\n\n                                     CAESAR\n                         You betrayed me!\n\n                                     VIOLET\n                         You murdered Gino!\n\n                                     CAESAR\n                         I had to.  You made me.\n\n                                     VIOLET\n                         Bullshit, you killed him.  Not me.  \n                         You did it because you couldn't stand \n                         the thought of Johnnie fucking you.\n\n                                     CAESAR\n                         Shut up!\n\n               He slaps her.\n\n                                     CAESAR\n                         Okay, you want business, I'll give \n                         you the fucking business.\n\n               He leans closer.  \n\n                                     CAESAR\n                         I'm going to make you beg just like \n                         Shelly did.  Just like Shelly!\n\n               He storms out of the room.\n\n               Corky looks up at Violet.\n\n                                     VIOLET\n                         I'm sorry, Corky ...\n\n                                     CORKY\n                         Don't be sorry.  Help me.\n\n               She pulls at the ropes as Violet slides off the bed.\n\n               INT.  KITCHEN - NIGHT\n\n               Caesar throws open the broom closet and grabs the clippers \n               that Mickey used to cut off Shelly's finger.\n\n               INT.  BEDROOM - NIGHT\n\n               The two women are back-to-back, fingers working at each \n               other's knots when Caesar bursts into the room.\n\n                                     CAESAR\n                         Oh, no no no.\n\n               Grabbing Corky by the boots, he drags her and flips her so \n               that she can now see Violet.\n\n               He drops down onto Violet putting the clippers in front of \n               her face.\n\n                                     CAESAR\n                         Hey, Violet, you remember these?\n\n               Her eyes widen with terror.  She starts to scream when he \n               stuffs a towel in her mouth.\n\n               Laying against Violet, he turns to Corky.\n\n                                     CAESAR\n                         I'm going to start with her so you'll \n                         get a good idea what's coming.\n\n               He takes hold of Violet's pinky finger, stretching it out.\n\n                                     CAESAR\n                         I'm going to ask you where the money \n                         is.  Every time you don't give me an \n                         answer, I'm going to cut off one \n                         finger.\n\n                                     CORKY\n                         No.\n\n                                     CAESAR\n                         When I reach ten, then I'll start \n                         with you.\n\n               He puts the finger between the blades.\n\n                                     CAESAR\n                         Where is the money?\n\n               Corky sees Violet thrashing helplessly.  She has no choice.  \n               Her mouth opens as --\n\n               The door buzzer rings.\n\n               Caesar is distracted, trying to think who it could be.\n\n                                     CAESAR\n                         ...  Mickey.\n\n               He sees the phone, where he dropped it, lying off the hook.\n\n               The door buzzer rings again, more insistently.  Corky sees \n               him momentarily unnerved.\n\n               He looks back at her.\n\n                                     CAESAR\n                         I said where --\n\n               He starts to cut and Corky screams --\n\n                                     CORKY\n                         No!  I'll tell you!\n\n               He stops, the door buzzing continuously.\n\n                                     CORKY\n                         It's over there in the empty \n                         apartment.\n\n               As she speaks, the sound of the door buzzer changes.\n\n                                     CORKY\n                         I put it inside one of the paint \n                         drums.\n\n               He is not looking at her; listening, he realizes that Mickey \n               is buzzing the other apartments.\n\n               CAESAR stands as the buzzing stops.  He pulls out his gun \n               and aims it at Corky.\n\n                                     CAESAR\n                         I promised I would kill you.\n\n               He cocks it.\n\n                                     CORKY\n                         You can't kill me yet.\n\n                                     CAESAR\n                         Why?\n\n                                     CORKY\n                         I could be lying.\n\n               His hand start to shake with ftustration.  He is beginning \n               to hate this woman more than he ever hated Johnnie.\n\n               Taking a deep breath, he eases back the hammer.\n\n                                     CAESAR\n                         You're going to wish to God you hadn't \n                         done that.\n\n               He kicks her again, snapping her head back.\n\n               After he leaves, Violet looks over and sees Corky lying \n               unconscious.\n\n               INT.  HALL - NIGHT\n\n               Caesar tries to open the door to the empty apartment but it \n               is locked.\n\n                                     CAESAR\n                         Fuck.\n\n               At the end of the hall, the elevator \"dings.\" Just as the \n               door opens, Caesar jumps back into his apartment.\n\n               INT.  CAESAR'S APARTMENT - NIGHT\n\n                                     CAESAR\n                         Son of a bitch ...\n\n               His mind a racing blur, he locks the door and runs back to \n               the bedroom.\n\n               INT.  BEDROOM - NIGHT\n\n               With another towel, he gags Corky and drags her into the \n               closet.  In her pocket, he finds the key.\n\n               He closes the doors, then hangs up the phone.\n\n               Grunting, he hauls Violet up over his shoulder --\n\n               When there is a knock on the door.\n\n               INT.  LIVING ROOM - NIGHT\n\n               Carrying Violet, he hurries to the kitchen, where he throws \n               Corky's gun into the freezer.  Mickey is banging on the door \n               as Caesar heads for the bathroom.\n\n               INT.  BATHROOM\n\n               Dropping Violet onto the floor, he reaches behind the curtain \n               and turns on the shower.\n\n                                     CAESAR\n                         Mickey will get in.  I know he will.\n\n               We hear the water hitting the bodies while Caesar starts \n               tearing off his clothes.\n\n                                     CAESAR\n                         Violet.  I can kill you right now if \n                         that's what you want.  If you want \n                         to live, then you have to help me.  \n                         I need you to make Mickey believe \n                         that everything is normal.\n\n               He picks up his gun.\n\n                                     CAESAR\n                         Tell me, do you want to live?\n\n               She stares hard at him and his gun, then nods.\n\n                                     CAESAR\n                         Good girl.\n\n               INT.  LIVING ROOM - NIGHT\n\n               We move toward the door as the lock clicks open.\n\n               INT.  BATHROOM - NIGHT\n\n               Violet's hands are untied.  She pulls off the gag and the \n               ropes at her feet.\n\n               Naked, Caesar sticks his head under the shower spray, wetting \n               everything.\n\n               INT.  LIVING ROOM\n\n               Still dripping, Caesar walks into the room, a towel wrapped \n               around his waist, another towel in his hand.\n\n               Mickey and Lou are standing in the middle of the room.\n\n               Caesar jumps.\n\n                                     CAESAR\n                         Jesus Christ!\n\n               Caesar holds his chest, laying it on a bit thick.\n\n                                     CAESAR\n                         Holy fuck, Mickey!  You scared the \n                         shit outta me.\n\n               He sees they both are holding their guns.\n\n                                     CAESAR\n                         What is this?  what are you two doing, \n                         sneaking in here with your peckers \n                         in your hands?  You gonna do me, \n                         Mick?  Is that it?\n\n               Mickey smiles, putting his gun away.\n\n                                     MICKEY\n                         No, Cease.  There was no answer.\n\n                                     CAESAR\n                         I thought I heard someone knocking.\n\n                                     MICKEY\n                         I was buzzing, I was knocking, but I \n                         guess you couldn't hear me on account \n                         of being in the shower.\n\n                                     CAESAR\n                         Yeah, it was Violet's idea.  I was \n                         so wound up about Gino, she was trying \n                         to help me relax.\n\n                                     MICKEY\n                         That Violet is one nice lady.  Wish \n                         someone would help me relax.\n\n                                     CAESAR\n                         Shit, Mick, come on in, let me get \n                         you a drink.  Sit down, Lou.\n\n               Behind the bar, he sets down the towel be was holding and we \n               see the gun hidden inside it.\n\n               INT.  BATHROOM - NIGHT\n\n               Violet watches through a sliver of open door, her mind already \n               working.\n\n               INT.  LIVING ROOM - NIGHT\n\n               Caesar is making the drinks.\n\n                                     MICKEY\n                         We was worried about you, Cease.\n\n                                     CAESAR\n                         Me?  Why?\n\n                                     MICKEY\n                         We went over to Johnnie's place just \n                         to check it out and it was busted \n                         up, Bad.\n\n               Caesar hands him a drink.\n\n                                     MICKEY\n                         I started thinking maybe it's about \n                         the money so I call you, but all I \n                         get is the busy signal.  I figure \n                         the phone is off the hook, that's \n                         why I come rushing over here.\n\n                                     CAESAR\n                         Oh Christ, the phone ...  That was a \n                         fucking stupid thing to do, wasn't \n                         it?\n\n                                     MICKEY\n                         Hey, if Violet was helping me relax, \n                         I'd probably do the same thing.\n\n               Mickey smiles as he sips his drink.\n\n               INT.  BATHROOM - NIGHT\n\n               Violet stands and goes to the shower curtain.  She reaches \n               in and turns off the water.  Steadying herself, she pulls \n               back the curtain, exposing the wet, bloody bodies.\n\n               INT.  LIVING ROOM - NIGHT\n\n               Mickey is looking at the furniture.\n\n                                     MICKEY\n                         Cease, can I ask you something?\n\n                                     CAESAR\n                         Yeah.\n\n                                     MICKEY\n                         Why'd you move all the furniture \n                         around?\n\n               The knot in Caesar's stomach tightens.\n\n                                     MICKEY\n                         Let me guess.  That was Violet's \n                         idea, too.\n\n               He laughs, and Lou laughs with him.\n\n                                     CAESAR\n                         Actually, yeah, she was nervous about \n                         Gino coming, wanted everything to \n                         look right.  You know women, Mick.\n\n                                     MICKEY\n                         Sure, Cease.  They make us do stupid \n                         things, don't they.\n\n               Caesar smiles feebly.\n\n               INT.  BATHROOM - NIGHT\n\n               Violet has pulled up Johnnie's body and is digging through \n               his coat pockets, searching for something.\n\n               INT.  LIVING ROOM - NIGHT\n\n               Mickey sees the briefcase still on the coffee table.\n\n                                     MICKEY\n                         Is that the money?\n\n                                     CAESAR\n                         Yeah, that's it.\n\n               Caesar puts his hand inside the towel as Mickey walks across \n               the rug.\n\n                                     MICKEY\n                         That fucking Shelly.  I gotta hand \n                         it to the guy, but Jesus, if I were \n                         him I would have bailed a long time \n                         ago.  I mean, how much money does a \n                         man need?\n\n               Talking to Lou, be picks up the case and walks back, somehwo \n               moving right between the wet spots.\n\n                                     MICKEY\n                         I remember I was just staring at all \n                         this goddamn money, Shelly down on \n                         his knees, and the next thing I know, \n                         Johnnie just blows his head off.\n\n               He slaps the case up onto the bar.\n\n                                     MICKEY\n                         What a fucking mess.  Johnnie's \n                         laughing his ass off and that's when \n                         Caesar lost it and - Boom.  He \n                         coldcocked him.  Fucking coldcocks \n                         Johnnie Marzzone.\n\n               He thumbs the latches but the case is still locked.\n\n                                     MICKEY\n                         Hey, Caesar, where's the key?\n\n                                     CAESAR\n                         The key, yeah, the key's in my pants \n                         in the bathroom.\n\n                                     MICKEY\n                         Fuck it, I don't need the key.\n\n               Caesar takes the smallest breath.\n\n                                     MICKEY\n                         I didn't need a key to get in here, \n                         did I?\n\n               He pulls out a lock-pick and starts working the lock.  The \n               muscles in Caesar's forearm bulge as he tightly squeezes his \n               gun.\n\n               He is slipping toward that same desperate choice.  He is \n               going to attack when --\n\n               Across the room, the phone rings.\n\n               Everyone looks at it.\n\n                                     MICKEY\n                         Who the hell could that be?\n\n               The phone is near the couch.  Caesar doesn't want to let go \n               of the gun.\n\n               The phone continues to ring.\n\n                                     MICKEY\n                         You gonna answer it?\n\n               INT.  BATHROOM - NIGHT\n\n               Violet has Johnnie's cellular phone.\n\n               Watching through the cracked door, Violet sees Caesar cross \n               to answer the phone.\n\n                                     CESAR (V.O.)\n                         Hello?\n\n                                     VIOLET\n                         Hello, Caesar.  This is Gino.\n\n               Caesar looks toward the bathroom.\n\n                                     CAESAR (V.O.)\n                         What?\n\n                                     VIOLET\n                         You're blowing your only chance.  \n                         Act like I'm Gino.\n\n               INT.  LIVING ROOM - NIGHT\n\n               Caesar's eyes light up.\n\n                                     CAESAR\n                         Holy shit, I don't believe it!  We've \n                         been going crazy over here, Gino!\n\n                                     VIOLET (V.O.)\n                         Good boy.\n\n               Mickey jumps up.\n\n                                     CAESAR\n                         It's Gino!  It's Gino!\n\n                                     MICKEY\n                         Where in the hell is he?\n\n               INT.  BATHROOM - NIGHT\n\n                                     VIOLET\n                         We were in a car accident --\n\n                                     CAESAR (V.O.)\n                         They were in a car accident.\n\n                                     VIOLET\n                         But everybody is all right.\n\n               INT.  LIVING ROOM - NIGHT\n\n                                     CAESAR\n                         They're all fine.  Just bruises and \n                         shit.\n\n                                     VIOLET (V.O.)\n                         Now you listen to me, asshole, I \n                         know your gun is behind the bar ...\n\n                                     MICKEY\n                         Un-fucking-believable.  I called \n                         those highway patrol dumb fucks.\n\n                                     CAESAR\n                         Ssh!  I can't hear Gino!\n\n                                     VIOLET (V.O.)\n                         We make a deal or I come out and \n                         hand this phone to Mickey.\n\n                                     CAESAR\n                         I'm listening.\n\n               INT.  BATHROOM - NIGHT\n\n               Violet has her robe over her dress, wrapping her hair in a \n               towel, making sure the bruise on her forehead is hidden.\n\n                                     VIOLET\n                         I want what's mine, half the money.  \n                         We get rid of Mickey, no one else \n                         dies.  No one.  Say yes, I understand.\n\n                                     CAESAR (V.O.)\n                         Yes, I understand.\n\n                                     VIOLET\n                         Tell them I'm at St. Mary's off the \n                         Kennedy, in the waiting room, but \n                         stay on the phone until I come out.\n\n                                     CAESAR (V.O.)\n                         Sure, Gino, sure.\n\n               INT.  LIVING ROOM - NIGHT\n\n               Out of the corner of his eye, he watches Violet come out of \n               the bathroom.\n\n                                     CAESAR\n                         St.  Mary's off the Kennedy, sure.  \n                         Okay, Gino.\n\n               Mickey sees Violet.\n\n                                     VIOLET\n                         Mickey?  What are you doing here?\n\n                                     MICKEY\n                         Violet, it's Gino and Johnnie.  They \n                         were in a car accident.\n\n                                     VIOLET\n                         Oh my God.  Was anyone hurt?\n\n                                     MICKEY\n                         I think everything is okay.\n\n               Caesar hangs up.\n\n                                     CAESAR\n                         They're at St.  Mary's in the waiting \n                         room.\n\n               Mick is already on the way.\n\n                                     MICKEY\n                         I can't fit them all in my car so \n                         give me your keys.  You drive my \n                         car, Lou.\n\n               Caesar sees Violet walking toward the kitchen.\n\n                                     CAESAR\n                         Sure, Mickey, sure.  Violet!\n\n               She stops, looking straight at the freezer.\n\n                                     CAESAR\n                         Go grab my car keys from my pants in \n                         the bathroom.\n\n               She turns to him.\n\n                                     CAESAR\n                         Please, help us out, Mickey wants to \n                         get going.\n\n               She turns to the bathroom.\n\n                                     MICKEY\n                         They might want to go straight to \n                         the airport and back to Miami, so I \n                         better take this.\n\n               He grabs the briefcase.\n\n                                     MICKEY\n                         You got the key?\n\n                                     CAESAR\n                         Oh yeah.  Violet!\n\n               INT.  CLOSET - NIGHT\n\n               Where Corky remains bound, still unconscious.  We hear the \n               name echo in her head.\n\n                                     CAESAR (V.O.)\n                         Violet!\n\n               Suddenly, her eyes blink open.\n\n                                     CAESAR (V.O.)\n                         Violet!\n\n               Her eyes blink again as she tries to focus.\n\n               INT.  LIVING ROOM - NIGHT\n\n               Violet hands Mickey the keys for the car and the case.\n\n                                     MICKEY\n                         Thanks, V.\n\n               He kisses her on the cheek.\n\n                                     CAESAR\n                         Call me as soon as you get him.\n\n                                     MICKEY\n                         Leave your phone on the hook.\n\n               Mickey and Lou leave.  Violet is staring at Caesar, standing \n               near the door.\n\n               In his right hand he is holding the other towel.  He smiles.\n\n                                     CAESAR\n                         Now that's teamwork.\n\n                                     VIOLET\n                         I should have let him kill you.\n\n                                     CAESAR\n                         You know he would have done you, \n                         too.\n\n                                     VIOLET\n                         I knew I couldn't trust you.\n\n               He drops the towel, raising the gun.\n\n                                     CAESAR\n                         I said I'd let you live and I will.\n\n               He smiles again.\n\n                                     CAESAR\n                         Maybe.\n\n               INT.  CLOSET - NIGHT\n\n               Corky is wide awake, thrashing-mad, biting her gag, struggling \n               to get free.\n\n               INT.  LIVING ROOM - NIGHT\n\n               Caesar pulls his pants on.\n\n                                     CAESAR\n                         Time to find out if the dyke was \n                         stupid enough to lie.\n\n               Caesar drags Violet througb the front door.\n\n               INT.  BEDROOM - NIGHT\n\n               The closet doors burst open as Corky fights her way out.\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               Caesar sees the buckets of paint.\n\n               He rips the lid from the nearest and kicks it over.  Paint \n               spills out across the floor.\n\n               INT.  BEDROOM - NIGHT\n\n               Suddenly Corky stops; something has caught her eye.  We drop \n               down, focusing on what she is staring at --\n\n               The clippers.\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               He kicks over the second bucket and the bag tumbles out with \n               the rushing flow of paint.\n\n                                     CAESAR\n                         Yes!\n\n               He turns to Violet, who is already running out the door.\n\n                                     CAESAR\n                         No!\n\n               INT.  HALL - NIGHT\n\n               Violet turns down the hall, bare feet beating against the \n               floor.\n\n               Caesar slices out of the room behind her.\n\n                                     CAESAR\n                         Violet!\n\n               He aims the gun as she hurls her self into the emergency \n               door.\n\n                                     CAESAR\n                         Fuck!\n\n               INT.  STAIRWELL - NIGHT\n\n               She flies, hands on the rail, spiraling down each flight as \n               he charges after her.\n\n                                     CAESAR\n                         Goddammit, Violet!  Stop!  Now!\n\n               INT.  BEDROOM - NIGHT\n\n               Straining, Corky's fingers curl around the handle of the \n               clippers.\n\n               INT.  LOBBY - NIGHT\n\n               Violet smashes through the door, but instead of turning to \n               the main doors, she runs straight for the elevators.\n\n               She pounds the button and waits.\n\n                                     VIOLET\n                         Come on.  Come on, please.\n\n               She hears Caesar coming just as the elevator opens.\n\n               Caesar crashes out of the stair door, running toward the \n               exit.  When he doesn't see Violet, he turns to the sound of \n               the elevator --\n\n               And catches a glimpse of her as the doors close.\n\n                                     CAESAR\n                         Oh, you bitch.  You fucking bitch.\n\n               Taking a really deep breath, he throws open the door to the \n               stairs.\n\n               INT.  ELEVATOR - NIGHT\n\n               Violet takes Johnnie's cellular phone from the robe pocket \n               and dials a number.\n\n               Mickey answers on the car phone.\n\n                                     VIOLET\n                         Mickey!  Oh God, Mickey!\n\n                                     MICKEY (V.O.)\n                         Violet?\n\n               Whispering, she acts terrified.\n\n                                     VIOLET\n                         He made me help him, Mickey, God, I \n                         was so afraid.  It was Caesar, all \n                         Caesar.  You have to help me.  He's \n                         coming - Oh God!\n\n               She hangs up, eyes blazing.\n\n               INT.  STAIRWELL - NIGHT\n\n               Sweat pouring off him, Caesar climbs the stairs.\n\n               INT.  HALL - NIGHT\n\n               The elevator opens, Violet bolts out.  She runs down the \n               hall, past the empty apartment, back to her door.\n\n                                     VIOLET\n                         Corky?\n\n               INT.  EMPTY APARTMENT - NIGHT\n\n               She rushes to the bedroom, where she finds the coils of cut \n               rope.\n\n                                     VIOLET\n                         Corky!\n\n               She looks at the wall separating the apartment.\n\n               INT.  HALL - NIGHT\n\n               Caesar half-falls out of the stair door, drenched with sweat.\n\n               INT.  EMPTY APARTMENT\n\n               Gun ready, Caesar throws open the door.\n\n               Spread out like a pond of milk is the spilled paint, but --\n\n               The money is gone.\n\n               Leading away from the white pool are boot prints and the \n               drip trail of the plastic bag.\n\n               The tracks lead to the bathroom.\n\n               Caesar kicks open the bathroom door and finds the bag of \n               money next to Corky's empty boots.\n\n               Over his shoulder we see Corky already swinging a massive \n               pipe wrench.\n\n               At the last second he is able to duck, falling to the ground \n               as --\n\n               The doorjamb splinters with a terrible metal crunch.\n\n               Before he can recover and shoot, she brings the wrench down \n               on his arm.\n\n               He screams as the gun hits the floor.\n\n               She kicks it, sending it skidding, hydroplaning across the \n               paint pool to the other side, leaving a jet trail of white \n               swirls and spirals on the wood floor.\n\n               They fight, Corky raining blows onto his back and flailing \n               arm until --\n\n               He catches her foot, flipping her as he clambers up.\n\n               Scrambling across the paint, slipping, crawling for the gun \n               when --\n\n               Violet bursts in, pointing the gun from the freezer.\n\n                                     VIOLET\n                         Stop!\n\n               Caesar, on hands and knees, looks at her, then at his gun \n               still out of reach.\n\n                                     VIOLET\n                         It's over, Caesar.  I called Mickey.  \n                         He's on his way.\n\n               Violet stands for long time, the gun trained carefully on \n               him as he rises from the floor.\n\n               Panting, Caesar watches her like a mad dog.\n\n                                     VIOLET\n                         Get out of here, Caesar.  If you \n                         want to live you had better start \n                         running.\n\n               He smiles.\n\n                                     CAESAR\n                         All these years and you still don't \n                         know me, Violet.\n\n               She glances down and sees the paint-covered gun.\n\n                                     CAESAR\n                         But I know you.\n\n               He turns to the gun.\n\n                                     VIOLET\n                         Caesar, don't.\n\n                                     CAESAR\n                         What are you going to do, V?  Shoot \n                         me?  Kill me in cold blood?  I don't \n                         think so.  I'll tell you why.  If \n                         you had it in you to pull that \n                         trigger, you would have done it a \n                         long time ago.  If I was you, I would \n                         have killed me the minute I brought \n                         the money home.  But you didn't and \n                         I know why, because you don't want \n                         to kill me.  Do you, V?  Do you?  \n                         No, I know you don't.\n\n                                     VIOLET\n                         Caesar, you don't know shit.\n\n               Violet fires --\n\n               The bullet hits Caesar in the shoulder, knocking him off \n               balance.  Another doubles him over as blood speckles the \n               pool of paint.\n\n               She empties the gun into him.  His body arcs back, falling, \n               splashing into the paint.\n\n               Caesar's blood bubbles out bright red against the glistening \n               white.\n\n                                                               DISSOLVE TO:\n\n               INT.  CAESAR'S APARTMENT - DAY\n\n               It is empty and clean.  In the bedroom, only a few hangers \n               are left dangling in the open closet.\n\n               EXT.  PARKING LOT - DAY\n\n               Mickey is standing with Violet, next to his Lincoln Town \n               Car.\n\n                                     VIOLET\n                         I will never understand it, Mickey.  \n                         You didn't even call the police.\n\n                                     MICKEY\n                         I told you, the family doesn't want \n                         the police around.  We want to take \n                         care of it ourselves and we will.  \n                         I'll find him.  I swear I will.\n\n                                     VIOLET\n                         I know you will.\n\n                                     MICKEY\n                         Sure you're going to be okay?  I \n                         mean, if you're having second \n                         thoughts, my offer still stands.\n\n                                     VIOLET\n                         Thanks, Mickey, but I need to get \n                         out, you know?  Get away from all of \n                         this.\n\n               Mickey nods.\n\n                                     VIOLET\n                         But thanks.  Thanks for everything.\n\n               She hugs him and he kisses her.  Then he gets in his car.  \n               Violet watches him drive away and knows that she is free.\n\n               EXT.  CORKY'S APARTMENT\n\n               Corky sitting on stoop, patient, like a rock.\n\n               She looks up as she hears high heels, and smiles at --\n\n               Violet standing there, new outfit.\n\n               Corky stands in front of her.\n\n                                     CORKY\n                         Hey.\n\n                                     VIOLET\n                         Hey.\n\n                                     CORKY\n                         How'd it go?\n\n                                     VIOLET\n                         I'm here, aren't I?\n\n               Corky nods.\n\n                                     CORKY\n                         I guess we should get out of here.\n\n               Violet nods.\n\n               Corky digs out alarm keys, aims, fires.  Violet turns, looks.\n\n               New truck.\n\n               Violet turns to Corky, eyebrow cocked.\n\n                                     CORKY\n                         Thought we might need a getaway car.\n\n               Smiles, they get in.\n\n               INT.  TRUCK\n\n               Corky admires truck.\n\n                                     CORKY\n                         You know what the difference is \n                         between us, Violet?\n\n                                     VIOLET\n                         No.\n\n                                     CORKY\n                         ...  Me neither.\n\n               Lean for kiss, as dolly in.\n\n               Guns engine.\n\n               Zoom.\n\n              \n\n               THE END\n\n\n\n\n\n\nBound\nWriters :   Andy Wachowski  Larry Wachowski\nGenres :   Crime  Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "The play is about Eugene and his older brother, Stanley, dealing with their parents' relationship falling apart as the brothers work together toward being comedy writers for the radio, and, eventually, television."}