{"title": "Brick", "full_text": "BRICK\n\n\n                                      Written by\n          \n                                     Rian Johnson\n\n                                                                                                 1\n          \n          \n          \n              SUPER MAIN TITLES\n          \n              Over a grimy concrete wall creeping by. We emerge from...\n          \n              EXT. RUNOFF TUNNEL - EARLY MORNING\n          \n              A gaping hole in the concrete side of a freeway. On the\n              embankment beside the hole BRENDAN FRYE squats, shoulders\n              hunched. His dark eyes behind thin glasses watch the\n              shallow stream of water which flows into the tunnel.\n          \n              THE WATER\n          \n              not more than six inches deep. Just beneath the surface a\n              young woman's pale blue arm in gaudy bracelets bats against\n              the edge of her body like a docked boat. A pebble plinks\n              into the water beside it.1\n          \n              TITLE CARD OVER BLACK:         \"2 DAYS PREVIOUS\"\n              INT. LOCKER CAGE - DAY\n          \n              A single locker. That same arm, bracelets and all, slips a\n              note through the slats, then leaves quickly.\n          \n              As the cage empties a lone figure slumps to the locker.\n              Opens it. The note falls to his feet.\n          \n              The figure is Brendan. He unfolds the note (folded in a\n              triangle) -- \"12:30 PICO & ALEXANDER\".\n          \n              A STREET SIGN\n          \n              Pico and Alexander.2\n          \n              A WRIST WATCH\n              12:43.   Brendan looks up from the watch.\n          \n              EXT. STREET CORNER - DAY\n          \n              He sits on the curb of a wide suburban street, eats lunch\n              from a brown bag and watches a phone booth on the corner. He\n              shows no surprise when it begins to ring. Brendan goes to\n              the phone and puts the receiver to his ear. Silence for a\n              moment, then a thin female voice from the phone.\n          \n          \n          1\n           Originally Dode was later revealed to have been hiding above the tunnel.\n          2\n            The street names were changed in production to match existing streets (we couldn't\n          afford to create custom street signs.)\n          \n                                                                       2\n          \n          \n                              VOICE\n                        (over phone)\n                    Brendan?\n          \n                                BRENDAN\n                    Emily?\n          \n                              EMILY\n                        (weakly)\n                    Yeah. How's things?\n          \n                              BRENDAN\n                        (slow, deliberate)\n                    Status quo.\n          \n                                EMILY\n                    Yeah?\n          \n                                BRENDAN\n                    Uh huh.\n          \n                              EMILY\n                    That's good.\n          \n          Her voice thins to a high, strained breath. She is crying.\n          \n                              BRENDAN\n                    What's going on, Em?\n          \n                              EMILY\n                        (through strained crying)\n                    It's good to see you, Brendan.\n          \n          Brendan's eyes glance around the surrounding street. Emily\n          is crying again.\n          \n                              EMILY (CONT'D) (cont'd)\n                    It's been some time.\n          \n                              BRENDAN\n                    Two months.\n          \n                              EMILY\n                    Yeah. I didn't even know your locker. I\n                    had to ask Brain.\n          \n          More crying noises.\n          \n                              BRENDAN\n                    Em, why don't we meet somewhere?\n          \n                                EMILY\n                    I can't.\n          \n                                                                                                     3\n          \n          \n                                         BRENDAN\n                           Why not?\n          \n                                     EMILY\n                           I screwed up real bad. I really screwed\n                           up.\n          \n                                     BRENDAN\n                           Screwed up how?\n          \n                                     EMILY\n                               (blubbering, fast and\n                                incoherent)\n                           I did what she said with the brick, I\n                           didn't know it was bad, but the pin's on\n                           it now for poor Frisco and they're\n                           playing it all on me-\n          \n                                     BRENDAN\n                           Slow down now, what?\n          \n                                     EMILY\n                           You gotta help me Brendan I think tug-\n                           Oh!\n          \n              With a sharp breath the line clicks dead just as a black\n              mustang roars by. Brendan drops the receiver and spins out\n              of the booth.\n          \n              There, another pay phone up the hill -- empty.\n          \n              Brendan turns to the black mustang, far down the street. A\n              man's hand drops a cigarette butt from the driver side\n              window.1\n          \n              The mustang turns the corner, gone.\n          \n              Brendan walks after it, finds the cigarette butt on the\n              street. Still smoking.\n              A pale blue arrow is printed on the filter.\n          \n              In the distance the class bell rings.\n          \n              EXT. SCHOOL HALLWAY - DAY\n          \n              The high school is open air - the hallways are alleyways\n              between buildings. A short kid with eyeglasses the size of\n          \n          1\n           Because of the orientation of the street, this was all flipped when we shot it, and the\n          hand came from the passenger window. The dialogue in the ending field scene was\n          changed to match, causing mass confusion for about half an hour on set.\n          \n                                                                         4\n          \n          \n          Volkswagen headlights sits against the wall. Brendan enters,\n          leans on the wall beside him.\n          \n                              BRENDAN\n                    Brain.\n          \n                              THE BRAIN\n                    Hey Brendan. It's been awhile. Where you\n                    been eating?\n          \n                              BRENDAN\n                    Back of school.\n          \n                              THE BRAIN\n                    Huh. Yeah, no one's seen you. What's it\n                    been, a couple months?\n          \n                              BRENDAN\n                    Yeah, it's been awhile. You gave Emily\n                    my locker number?\n          \n                              THE BRAIN\n                    A few days ago. Was I wrong?\n          \n                              BRENDAN\n                    What?\n          \n                              THE BRAIN\n                    To give it?\n          \n                              BRENDAN\n                    No.\n          \n                              THE BRAIN\n                    It's been so long, I don't know you\n                    two's stats.\n          \n                              BRENDAN\n                    It has been awhile.   Who's she been\n                    eating with?\n                              THE BRAIN\n                        (uncomfortable)\n                    I dunno. It's hard to keep track.\n          \n                              BRENDAN\n                    Is it?\n          \n                              THE BRAIN\n                        (shrugs)\n                    Can be.\n          \n          The Brain avoids Brendan's gaze.\n          \n                                                                        5\n          \n          \n                                BRENDAN\n                    Uh huh.\n          \n          A beat.\n          \n                              THE BRAIN\n                    She hasn't been doing too good.\n          \n                              BRENDAN\n                    Yeah well. I'm not looking for a patch\n                    up. Em's life is her own. But she\n                    asked for my help.\n          \n                              THE BRAIN\n                    Help with what?\n          \n                              BRENDAN\n                    I don't know. I don't even care, it's\n                    not my business. I just want to know\n                    she's ok, so I've got to find her.\n                    That's all this is.\n          \n                              THE BRAIN\n                    Well. I know she was poking in with the\n                    Ivy-bound cheerleading elite. Laura\n                    Dannon's crowd.\n          \n          Across the parking lot a beautiful girl with dark long hair\n          kisses an football player.\n          \n                              BRENDAN\n                    Laura Dannon there with the Rabbit?\n          \n                              THE BRAIN\n                    Yeah. Brad Bramish with her. Cream on\n                    the upper crust.\n          \n          Brad laughs heartily.\n          \n                              BRENDAN\n                        (softly)\n                    He's a sap.\n          \n                                THE BRAIN\n                    Know him?\n          \n                                BRENDAN\n                    By sight.\n          \n                              THE BRAIN\n                    I won't argue then. Anyway Em tagged\n                    after them for a bit, but it didn't\n                    work. So she picked her way down the\n                    food chain. Last I seen she was with\n                    whasshername, that drama vamp. Small\n                    time dealer, augh, the evil one, the one\n                    you dated-\n          \n                              BRENDAN\n                    Kara.\n          \n                              THE BRAIN\n                    That's my bus.\n          \n                              BRENDAN\n                    You know her locker number?\n          \n                              THE BRAIN\n                    Kara's?\n          \n                              BRENDAN\n                    Em's.\n          \n                              THE BRAIN\n                    239.\n          \n                              BRENDAN\n                    Thanks Brain. Keep your specs on, find\n                    me if she shows.\n          \n                              THE BRAIN\n                    Sure.\n          \n          The Brain trots off. In the distance Brad and Laura laugh,\n          and he kisses her. Her hair blows in the wind.\n          \n          EXT. LOCKER CAGE - DAY\n          \n          Empty. Locker 239 is open, its door swinging gently in the\n          wind.\n          \n          EXT. BACK OF GYM - DAY\n          \n          Brendan sits against the massive building, flipping through\n          loose papers. He finds two photographs, one of Emily hugging\n          him, the other of Emily with a beautiful sharp-eyed girl at\n          a party, drinks in hand.\n          \n          Sorting more papers, he finds a red card with a sequined\n          mask on the front. The bottom edge has been torn off.\n          \n          EXT. PARKING LOT - DAY\n          Sixth period has broke. Masses of students pile into busses.\n          \n                                                                        7\n          \n          \n          EXT. SCHOOL THEATER - DAY\n          \n          A huge chunk of brown building. Brendan strides towards it.\n          \n          INT. SCHOOL THEATER - CONTINUOUS\n          \n          Drama people sit on the floor facing the stage. Brendan\n          steps behind one, the sharp-eyed girl from the picture. She\n          holds a freshman boy's head in her lap. Pets it like a dog.\n          \n          She looks back at Brendan, her face in shadow.\n          \n                              GIRL\n                        (through a mocking smile)\n                    Hello, Brendan.\n          \n                              BRENDAN\n                    Kara.\n          \n                              KARA\n                    Come to see the show?\n          Kisses the freshman's forehead, purring.\n          \n                              BRENDAN\n                    No, I didn't.\n                        (nudges the freshman with his\n                         toe)\n                    Lapdog, blow.\n          \n          The freshman sits up, looks to Kara like a spooked puppy.\n          \n                              KARA\n                        (to the lapdog)\n                    Stay.\n                        (to Brendan)\n                    Don't be mean.\n          \n                              BRENDAN\n                    I'm all friendly.\n                        (to the lapdog)\n                    Watch your head, kid - that thing bites.\n          \n          The dog pops up again. Kara pulls him down and nuzzles his\n          ear.\n          \n                              BRENDAN (CONT'D) (cont'd)\n                    I need words.\n                              KARA\n                    I'm listening.\n          \n                                                                                                  8\n          \n          \n                                     BRENDAN\n                           About Emily Kostich.\n          \n              She stops nuzzling a little too quickly.\n          \n                                     KARA\n                               (to the dog)\n                           Get me my purse.\n                               (he goes)\n                           Hurry!\n          \n              He breaks into a trot. Kara smiles at Brendan.\n          \n                                     BRENDAN\n                           Still picking your teeth with freshmen?\n          \n                                     KARA\n                           You were a freshman once.\n          \n              She slides her fingers up his arm. He growls and pushes them\n              away.\n          \n                                     BRENDAN\n                           Way once, sister. You and Em were tight\n                           for a bit. Who's she eating with now?\n          \n                                     KARA\n                           Eating with?\n          \n                                     BRENDAN\n                           Eating with. Lunch.           Who.\n          \n                                     KARA\n                           You're a cutie.\n          \n                                     BRENDAN\n                           You gonna tell me?\n          \n                                     KARA\n                           Guess you're up from the underneath\n                           then. The whole Jerr thing blown over.\n                           Lucky strikes, you and your partner get\n                           bulled, you come up clean. But I guess\n                           you were always the brains of the\n                           outfit.1\n          \n          1\n            One of many instances of an allusion to the Jerr backstory, most of which were\n          trimmed back in the editing process for clarity. The author has threatened to write it as\n          a stand alone short story, but probably never will, so in a nutshell: when Brendan and\n          Emily were still an item she started hanging out with Jerr, a small time dealer. Brendan\n          didn't approve, so he partnered up with Jerr then ratted him out to Trueman. Emily\n          found out, and that led to their breakup on the field, which we see in a flashback.\n          \n                                                                         9\n          \n          \n                              BRENDAN\n                    Where's Emily?\n          \n                              KARA\n                    Sometimes I wonder why I dumped you.\n          \n                                 BRENDAN\n                           (standing to go)\n                    God.\n          \n                              KARA\n                    I don't know where she's at, Brendan.\n          \n                              BRENDAN\n                    I know you do, so why don't you want me\n                    to find her?\n          \n                              KARA\n                    Maybe I'm looking out for you.\n          \n                              BRENDAN\n                        (going)\n                    Well I appreciate that.\n          \n                              KARA\n                    Brendan... you looking to get back into\n                    things? I could use you.\n          \n          He is gone.   Behind Kara, the play goes on.\n          \n          INT. BACKSTAGE OF THEATER - CONTINUOUS\n          \n          The play is seen in shadow-play through the backdrop.\n          \n          Brendan slips in through an exit door, crosses the backstage\n          area and enters the dressing rooms.\n          \n          INT. DRESSING ROOM - CONTINUOUS\n          \n          Cramped and empty. Pictures of Kara with friends are stuck\n          in the mirror. Brendan roughly searches drawers, bags,\n          pockets... nothing. He stops. A red edge behind one of the\n          photos - the same red card with a mask on it, but whole.\n          Across the bottom in small print: \"Halloween in January -\n          Call for DETAILS - 555-2394\"\n          \n          INT. BRENDAN'S ROOM - NIGHT\n          \n          Brendan pulls a phone across his desk and dials the number\n          on the flyer.\n          \n                                                               10\n          \n          \n                              WOMAN'S VOICE\n                        (over phone)\n                    Hello?\n          \n          Brendan hesitates.\n          \n                              BRENDAN\n                    Hello, ma'am, this is Tom, I'm a friend\n                    from school. Could I speak to...\n          \n          He trails off.\n          \n                              WOMAN'S VOICE\n                        (over phone)\n                    Oh, hi Tom. Laura's here, hold on.\n          \n                                 LAURA'S VOICE\n                           (over phone)\n                    Yes?\n          \n                              BRENDAN\n                    I'm calling for details.\n          \n                                LAURA'S VOICE\n                    For what?\n          \n                              BRENDAN\n                    Details about the party.\n          \n                              LAURA'S VOICE\n                    Who is this?\n          \n                              BRENDAN\n                    I don't think we've met.\n          \n                               LAURA'S VOICE\n                    Well then I don't think you're invited\n                    to my party. It's a rather exclusive\n                    gathering.\n                              BRENDAN\n                    I can imagine.\n                        (she starts to speak, he cuts\n                         her off)\n                    You should really work on your invite\n                    management. That might be a personal\n                    'room for improvement' area in your\n                    life. But discretion of your invite\n                    sending aside, I have procured a certain\n                    someone's invitation, and would like\n                    details.\n          A beat of silence.\n          \n                                                                            11\n          \n          \n                              LAURA'S VOICE\n                    You think you're cute, whoever you are.\n          \n                               BRENDAN\n                    Wait'll you get a load of my felt fedora\n                    and spats.\n          \n                              LAURA'S VOICE\n                    Who are you? Or I'll hang up.\n          \n                              BRENDAN\n                    You don't know me - I'll save you some\n                    time.\n          \n                              LAURA'S VOICE\n                    I know everyone and I've got all the\n                    time in the world.\n          \n                              BRENDAN\n                    Folly of youth. Ask whose invitation\n                    I've got.\n          \n                              LAURA'S VOICE\n                        (slightly)\n                    What you said.\n          \n                              BRENDAN\n                    Emily Kostich.\n          \n          A beat.\n          \n                              LAURA'S VOICE\n                    15 Bush street, up in Stockton Cove.\n                    Buzz 42 at the gate. Nine o'clock. But\n                    who-\n          \n          Brendan hangs up. He folds his hands under his chin and\n          stares at the phone, perfectly still. The clock on his desk\n          says 4:53.\n                                                             DISSOLVE TO:\n          \n          7:37\n          \n          Brendan at his desk, tapping away at Tetris.\n          \n                                                             DISSOLVE TO:\n          \n          8:30\n          The desk is empty, Tetris paused. A shower runs behind an\n          ajar door in the background.\n          \n                                                                                                12\n          \n          \n              EXT. STOCKTON COVE GATE - NIGHT\n          \n              An imposing private community gate. Brendan coasts up on his\n              bike and ditches it in the bushes. He checks the call box\n              directory: \"42 -- DANNON\"\n          \n              Using the call box as a hand hold he hops the gate and walks\n              briskly up the street.\n          \n              EXT. STOCKTON COVE STREET - NIGHT\n          \n              Shiny cars line the curb. Party noises come from an upscale\n              two story house. Brendan takes a short breath, then strides\n              up to the front door.\n          \n              INT. LIVING ROOM\n          \n              Large and clean, with a two story ceiling and a railed\n              staircase at one end. Fifteen or twenty clean people, some\n              in costumes, mill about in cliques. Brendan comes in as if\n              he doesn't mind who sees him coming in. He gets a couple odd\n              stares, but no one stops him.\n          \n              With non obtrusive confidence he cuts through the crowd to\n              the beer keg in back and draws half a cup.\n          \n              INT. PARLOUR - SAME\n          \n              Richly adorned, crowded, lit with bright pools of light.\n              Brendan drifts in and stands in the back, deep in shadow.\n          \n              The music comes from a baby grand piano set against one\n              wall. Laura Dannon leans against it. She wears a red\n              kimono, and is striking against the velvet black piano.\n              Laura's kid sister, 11 years old with glasses, sits at the\n              piano playing \"All I do is Dream of You\".\n          \n              Laura sings, lovely and soft but with strength.1\n          \n              Brendan watches from the back, his face obscured in shadow,\n              but his eyes gleam. Through the darkened window behind him\n              a match flares up, and someone standing outside lights a\n              cigarette.\n          \n              Laura finishes the song. The room applauds, and she ruffles\n              her kid sister's hair.\n          \n              Brendan ducks out, and into\n          \n          1\n           By the time we got around to production this had changed to \"Someone to Watch Over\n          Me,\" but the publishing rights proved too expensive (i.e. not free.) We chose the Gilbert\n          & Sullivan song, which besides being lovely was also in the public domain (i.e. free.)\n          \n                                                                         13\n          \n          \n          INT. LIVING ROOM - SAME\n          \n          Brad Bramish, the jock who was kissing Laura in the parking\n          lot, sits slouched on the couch in a dense crowd. He holds a\n          cup and speaks much too loudly to a guy named Biff at his\n          elbow.\n          \n                              BRAD\n                    If the coach wants to play me I'll play,\n                    but I can't put my best game in if I've\n                    got to worry about whether I'm going to\n                    be in there. Halftime last game, coach\n                    is pissed I ran it on a pass play, out\n                    on the field he says to me 'you gotta\n                    think about the team and you gotta' you\n                    know and 'if you run that ball again\n                    you're out', and I said to him you gotta\n                    let me play! I'm out there, let me play,\n                    and he's saying 'no you're out' and I\n                    kept saying 'Let me play! Let me play!\n                    Let me play!', just right in his face-\n          \n                              BIFF\n                    He was!\n          \n                              BRAD\n                    Just 'Let me play! Let me play! Let me\n                    play!' 'No you gotta' 'No, let me play!\n                    Let me play! Let me play!'\n          \n          Brad hunches forward, his face swollen purple, yelling that\n          over and over. Tom steps in front of Brendan, blocking his\n          line of sight.\n          \n          Brendan scans the rest of the room. His eyes catch on Laura,\n          leaning against a divan. Her bright, sharp eyes cut through\n          the room, straight into Brendan.\n          He wags his eyebrows at her.\n          \n          She looks away quickly. Brendan turns back to Brad, still\n          shouting 'let me play'. Tom stands between them.\n          \n                              BRENDAN\n                    Tom!\n          \n          Brad falls silent. Most of the room follows suit. Tom turns\n          around. Brendan smiles good naturedly.\n          \n                              BRENDAN (cont'd)\n                    Could you step aside, please? I'm\n                    trying to follow Brad's story, and it's\n                    difficult when I can't see his face.\n          \n                                                                         14\n          \n          \n          The room watches Brendan. Tom mumbles something and steps\n          aside. Brad stares at Brendan stupidly. Brendan flashes a\n          dopey grin and tips his glass.\n          \n                              BRAD\n                        (stumbles)\n                    He doesn't give me a play to make, what\n                    can I do, you know?\n          \n          He falls into awkward silence. Biff starts babbling.\n          \n          Brendan looks at Brad, who is staring back at him.\n          \n          Brendan then slowly drags his gaze over to Laura, staring at\n          him too, her eyes slightly amused. Brendan cocks an eyebrow.\n          The slightest hint of a smile takes the corner of her mouth,\n          and she wags her eyebrows once at him.\n          \n          Brendan glances back at Brad, looking at Laura now, not\n          amused at all.\n          \n          Brendan stands to go. Biff chatters on. Brad cuts him off.\n          \n                              BRAD (cont'd)\n                    Hey. Hey! What are you doing here?\n          \n                               BRENDAN\n                    Leaving.\n          \n                               BRAD\n                    Oh yeah?\n          \n                              BRENDAN\n                    Uh huh. Unless your anecdote's got a 2nd\n                    act.\n          \n                              BRAD\n                    Why don't you leave?\n          \n                              BRENDAN\n                        (leaving)\n                    That's what I was doing.\n          \n          INT. DARK ROOM\n          \n          With a lit wet bar at one end. Brendan goes to the bar, puts\n          ice in a glass and cracks it with liquor.\n          \n                              LAURA\n                        (O.S.)\n                    Whiskey?\n          \n          Brendan pauses, glass touching his lips.\n          \n                                                                         15\n          \n          \n                                 BRENDAN\n                    Jameson.\n          \n          He downs half of it.\n          \n                              LAURA\n                    I like a man who knows what he's\n                    drinking.\n          \n                              BRENDAN\n                    That's a pretty sick thing to be\n                    attracted to.\n          \n                              LAURA\n                    Brad's not a good guy to get on the\n                    wrong side of.\n          \n                                 BRENDAN\n                    Uh huh.\n          \n          They stare at each other in silence. She studies his face.\n          The broken light of the bar makes her features seem liquid.\n          \n                              LAURA\n                    Fearless flyer. Quit your yappin and fix\n                    me one.\n          \n          and slips out a sliding glass door.\n          \n          He fills another glass with whiskey and cuts his with water.\n          \n          EXT. BACK PATIO - NIGHT\n          \n          Brendan joins Laura, hands her a drink. Suburban lights fill\n          the valley below. Laura sips her drink.\n          \n                              LAURA\n                    I'll never get through all this.\n          \n                                 BRENDAN\n                    Uh huh.\n          \n          She sips more.\n          \n                               LAURA\n                    I knew your old partner Jerr since grade\n                    school. Tough break. How long were you\n                    two joined up before your operation got\n                    the sting?\n          \n                                                     16\n          \n          \n                    BRENDAN\n          A few months. Could have helped himself\n          out by turning me in, but he took the\n          heat. He was a good guy. Solid.\n          \n                    LAURA\n          Was he?\n          \n                    BRENDAN\n          You knew him.\n          \n                    LAURA\n          Yeah I did. So why are you here tonight?\n          \n                    BRENDAN\n          I'm looking for Emily.\n          \n                    LAURA\n          She wasn't invited.\n          \n                    BRENDAN\n          She had an invitation.\n          \n                    LAURA\n          Well like you said, I've got to work on\n          that. Em's been AWOL for a good month,\n          nobody's seen her.\n          \n                    BRENDAN\n          I saw her yesterday.\n          \n                    LAURA\n          Nearly nobody's seen her. So what did\n          she tell you?\n          \n                    BRENDAN\n              (winces)\n          Score 0 for finesse.\n          \n                    LAURA\n          Listen, you're scratching at the wrong\n          door. I wasn't with Emily enough to know\n          details of what she was in, I just got\n          wind of the downfall, and I didn't get\n          any details of that, except that it was\n          bad. So now that we're showing some\n          cards...\n          \n                    BRENDAN\n          If you haven't got a finger in Em's\n          troubles, why'd her name get me into\n          your rather exclusive party?\n          \n                                                                        17\n          \n          \n                              LAURA\n                    Keep up with me now. I don't know, but\n                    it sounded like you did, and a body's\n                    got a right to be curious. Now I'm not\n                    so sure.\n          \n                              BRENDAN\n                    Well I'll put that body to bed. I don't\n                    know a damn thing about whatever\n                    troubles, and that works for me. I just\n                    want to find her.\n          \n          A long beat. Laura studies Brendan's face, then seems to\n          come to a decision.\n          \n                              LAURA\n                    Coffee and pie.\n          \n          The words hang in the air a moment. A look of recognition\n          from Brendan.\n          \n                              BRENDAN\n                    Coffee and pie oh my?\n          \n                              LAURA\n                    And you didn't hear it from me.\n          \n          He sips his drink. A voice calls from the glass door.\n          Another girl. Laura flashes Brendan a look and goes to her.\n          They have quick, quiet words and the girl leaves. Laura\n          turns back to Brendan.\n          \n                              LAURA (CONT'D) (cont'd)\n                    Will you wait here for me?\n          \n                               BRENDAN\n                    Sure.\n          \n                              LAURA\n                    You'll stay right here and wait -- I'll\n                    be five minutes.\n          \n                               BRENDAN\n                    Yes.\n          \n          The moment she leaves Brendan runs across the lawn and hops\n          the fence, into the neighbor's yard.\n          \n          EXT. SIDE OF HOUSE\n          \n          Brendan runs to the edge of the neighboring house and peeks\n          around. Laura comes out the front door, cuts across the\n          lawn and sidewalk and trots out into the street. Brendan\n          \n                                                                         18\n          \n          \n          begins to follow, but a noise from behind the fence stops\n          him - a match being struck.\n          \n          Brendan creeps towards the fence and peers through a\n          splintered hole.\n          \n          BRENDAN'S POV - THROUGH THE FENCE\n          \n          A brightly lit window in the side of Brad's house, and\n          through the window the party.\n          \n          A dark figure wearing a long coat and broad rimmed hat, all\n          inky black. The figure smokes a cigarette and watches the\n          party, absently stroking his cheek.\n          \n          Brendan steps back - SNAP!   A twig.\n          \n          The figure freezes. Then, making no noise at all, it spins\n          to face Brendan, a towering black form against the window.\n          \n          The glowing cigarette falls to the grass.\n          A metallic glint, and a clicking sound not unlike a gun.\n          \n          Brendan throws himself backwards onto the grass. A beat.\n          \n          Through the hole the black of the figure's cloak whips away.\n          \n          Brendan hesitates, then hops the fence.\n          \n          EXT. SIDE OF BRAD'S HOUSE - SAME\n          \n          Brendan lands on his feet. No black figure to be found.\n          \n          The cigarette still smolders on the ground. Hand rolled,\n          plain paper.\n          \n          Brendan gazes through the window, catching his breath. Then\n          he breaks the trance and creeps towards the street.\n          \n          EXT. FRONT LAWN - NIGHT\n          \n          Peeking around the house, Brendan sees Laura cut across the\n          lawn and trot into the street. Using parked cars as cover,\n          Brendan follows.\n          \n          EXT. STREET\n          \n          Between cars, Brendan sees a lanky kid in baggy jeans and\n          engineer boots with a clean shaven head leaning against a\n          black Mustang. Laura goes to him and speaks quickly.\n          \n                                                                         19\n          \n          \n          The dark figure in the hat emerges from the shadows. Laura\n          says something to him. Grunting something angrily, he gets\n          in the car with the bald kid and peels off.\n          \n          Laura turns and slowly walks towards the house.\n          \n          When she is gone Brendan stands, throws a look back at the\n          house and walks off down the street, towards the guard gate.\n          \n          EXT. BACK PATIO\n          \n          The two drinks, where Brendan left them. Laura takes hers\n          and drains it. The suburban lights twinkle like stars.\n          \n          EXT. CARROWS PARKING LOT - DAY\n          \n          The sun rises over Carrows family restaurant, a squat\n          structure backed against the weedy edge of the runoff tunnel\n          ravine.\n          \n          A banner from 1973 in the window - \"Coffee and Pie oh my!\"\n          A pack of six pale stoners slump against the rear dumpster.\n          Their beady eyes follow Brendan in sync as he approaches.\n          \n          He goes to the nearest one.\n          \n                              BRENDAN\n                    Where's Dode?\n          \n                              STONER 1\n                    Dunno, bra.\n          \n          Silence and blank stares. Brendan calmly moves to the next\n          stoner.\n          \n                              BRENDAN\n                    Dode?\n          \n                              STONER 2\n                    Uh uh.\n          \n          Brendan moves to the next one.\n          \n          A thin head pokes from around the dumpster.\n          \n                              DODE\n                    Hey Brendan. Maybe you shouldn't be\n                    here.\n          \n          Brendan steps around the dumpster. Dode slumps against the\n          wall, thin and delicate in dusty black. Slivery eyes, pale\n          lips, muffled intelligence.\n          \n                                                                         20\n          \n          \n                              BRENDAN\n                    Kara told me you know where Em's at.\n          \n                               DODE\n                    Uh huh.   And why are you looking for Em?\n          \n                              BRENDAN\n                    She asked for my help.\n          \n                               DODE\n                    Uh huh. Listen man, I've got plenty on\n                    my plate without dealing with some\n                    jilted ex.\n          \n                              BRENDAN\n                    It's not about that.\n          \n                              DODE\n                    Whatever it's about, act smarter than\n                    you look and drop it.\n          \n                              BRENDAN\n                    Where is she?\n          \n                              DODE\n                    She's with me, and right now that's the\n                    best place for her. Leave the low life\n                    to the low lifers and dangle.\n          \n                              BRENDAN\n                    You're on the bright side of dim, Dode,\n                    but if I thought you had this half-\n                    handled I'd be eating lunch. Where's\n                    she at?\n          \n                              DODE\n                    Better get while it's good.\n          \n          Brendan doesn't.\n                              DODE (cont'd)\n                    Heel it now, dig?\n          \n          The 5 big stoners appear behind Brendan, threatening.   Dode\n          turns his head away to light a joint.\n          \n          Brendan's fist slams into his face, sending the joint\n          spinning. Brendan slams Dode's frail frame against the\n          dumpster.\n          \n          The 5 stoners stand in the exact same position, deer in the\n          headlights. One makes a half hearted motion to intervene.\n          \n                                                                     21\n          \n          \n                                 BIG STONER\n                    Back off.\n          \n                              BRENDAN\n                    Throw one at me if you want, hash head.\n                    I've got all five senses and I slept\n                    last night, that puts me six up on the\n                    lot of you.\n          \n                                 BIG STONER\n                    Just easy-\n          \n          Brendan slams Dode into the wall.\n          \n                              BRENDAN\n                        (to Dode)\n                    Where's Em?\n          \n                              DODE\n                        (deliberate)\n                    She's with me. She was tight when she\n                    called you, man. Came to and freaked.\n                    She told me to shake you if you came by.\n                    Said you'd only make things worse.\n          \n          Brendan covers how shaken he is by this statement fairly\n          well. He drops Dode.\n          \n                              STONER 1 (O.S.)\n                    Put him down, man!\n          \n                              DODE\n                    Deal with whatever this ain't about and\n                    drop it.\n          \n                              BIG STONER\n                        (to Brendan)\n                    Nothing more here, bra.\n          \n                              BRENDAN\n                    Tell Emily I want to see her. Tell her\n                    if she still wants my help or not that's\n                    her business, but I want to hear it\n                    straight from her.\n          \n                              DODE\n                    She don't -\n          \n          Brendan walks away.\n          \n                              BRENDAN\n                    Today. She knows where I eat lunch.\n          \n                                                                            22\n          \n          \n          When Brendan is a safe distance away the biggest stoner\n          shouts with conviction\n          \n                              BIG STONER\n                    And stay out, punk!\n          \n          EXT. SIDEWALK - CONTINUOUS\n          \n          Brendan hides behind a tall clump of bushes.\n          \n          A moment later Dode hustles away from Carrows. Brendan\n          follows.\n          \n          EXT. STREET - EARLY MORNING\n          \n          The sun is rising as Brendan tails Dode through the twisty\n          suburban streets.\n          \n          Brendan takes cover as Dode stops by a white hatchback.\n          \n          A girl gets out of the car and embraces Dode. Her wrist is\n          adorned with the same cheap plastic bracelets as the dead\n          girl's arm. Dode speaks quickly to her, she nods and speaks\n          back. He hands her a slip of paper, which she tucks into a\n          brightly colored address book and slips in her jacket\n          pocket. They embrace again, Dode walks off and the girl gets\n          in her car.\n          \n          Brendan stumbles after the car, but it is quickly gone. He\n          watches it go, then follows Dode back towards school.\n          \n          EXT. SCHOOL THEATER - MORNING\n          \n          Dode slumps into the front door of the brown building.\n          Brendan watches him from a distance, eyes thoughtful. After\n          a beat he turns and walks off into the thickening crowds of\n          students.\n          \n                                                             FADE OUT:\n          \n          FADE UP\n          \n          EXT. BACK OF SCHOOL - MIDDAY\n          \n          Brendan eats lunch alone on a concrete wall beside a long,\n          empty utility road behind the school.\n          \n                                                                    LATER\n          \n          Reclining on the wall, reading \"Lord of the Flies\". He\n          raises his eyes, and sits up suddenly.\n          \n                                                                           23\n          \n          \n          Off in the distance on the utility road a tiny figure\n          approaches, stumbling. Brendan jumps and hits the ground\n          running towards the figure.\n          \n          Meet the girl with cheap bracelets, the girl Dode spoke to,\n          the dead girl, Emily. He catches her just as she stumbles\n          and falls and carries her into the shade of a covered\n          hallway.\n          \n          EXT. SCHOOL HALLWAY - CONTINUOUS\n          \n          Emily and Brendan sit in silence. She is very pretty, but\n          she looks bad. Too much makeup, not enough sleep. She\n          sniffles, speaks to her shoes.\n          \n                              EMILY\n                    I must have sounded pretty crazy on the\n                    phone. Yesterday.\n          \n          She taps her shoes together lightly, eyes fixed on them.\n          \n                              EMILY (cont'd)\n                    It was dumb, I got paranoid over a\n                    really stupid thing. I was high, I went\n                    crazy for a little bit, but now you have\n                    to forget about it. Please. That's how\n                    you can help me now, forget about it.\n          \n          She turns her weak eyes to Brendan for the first time.     His\n          stare is unwavering, searching. She pushes on.\n          \n                              EMILY (cont'd)\n                    Brendan, I know you're mad at all these\n                    people, cause you think I went away from\n                    you and went to them. But you've got to\n                    start seeing it as my decision, stop\n                    being angry because where I want to be\n                    at's different from where you wanna be\n                    at.\n          \n                              BRENDAN\n                        (angry)\n                    Who fed you that line, Em?\n          \n          She looks back at her shoes.\n          \n                              EMILY\n                    And stop picking on Dode. He's a good\n                    guy.\n          \n                              BRENDAN\n                    The Carrows rat?\n          \n                                                                        24\n          \n          \n                              EMILY\n                    He's a good friend.\n          \n                              BRENDAN\n                    So what am I?\n          \n                              EMILY\n                        (strained anger)\n                    Yeah, what are you? Eating back here,\n                    not liking anybody, how are you judging\n                    anyone? I loved you alot but I couldn't\n                    stand it, I had to get with people. I\n                    couldn't heckle life with you, I had to\n                    see what was what.\n          \n          A beat. She taps her clogs. One has a hole worn through the\n          sole. Her face contorts, seizes up, and she is sobbing.\n          \n                              EMILY (cont'd)\n                    I'm sorry Brendan.\n          \n          She buries her face in his shoulder. He has a hard time\n          speaking.\n          \n                              BRENDAN\n                    You've got to come back to me, Em.\n          \n                              EMILY\n                    No. No. Never. I'm sorry. Never. I can't\n                    love on your terms, Brendan. I can't do\n                    that, I'm not like you.\n          \n                              BRENDAN\n                    You're in a spot, I can get you out of\n                    it. Come back to me, and whatever heat\n                    follows you I'll deal with.\n          \n                              EMILY\n                    No. You're not hearing me, no. I don't\n                    want to be put away and protected. No.\n          \n                              EMILY (cont'd)\n                    No.\n          \n                              BRENDAN\n                    Tell me about the trouble, the brick and\n                    the pin -\n          \n                              EMILY\n                    You gonna fix things like you did with\n                    Jerr? No. I came to say goodbye, for\n                    good. Whatever you have to do to let me\n                    go, do it. I'm gonna let you go, I've\n          \n                                                                                             25\n          \n          \n                          decided that. Make sure that, you've got\n                          to, promise you won't torture yourself,\n                          that you'll let me go.\n          \n              She embraces him, enveloping him in her jacket. His face is\n              a frozen mask.\n          \n                                       EMILY (cont'd)\n                          Let me go.\n          \n              As she pulls away he mechanically slips an address book from\n              her jacket pocket.\n          \n              He watches her as she walks away.\n          \n              INT. CLASSROOM\n          \n              Brendan sits in the back, flipping through the address book.\n              The teacher drones on about the significance of the pig's\n              head in \"Lord of the Flies\".1\n              THE ADDRESS BOOK\n          \n              Illegible scribbles, names, numbers, nothing that stops his\n              search - then the note Dode gave her, a corner of loose-leaf\n              paper which looks like this:\n          \n          \n          \n          \n              Brendan studies the paper intently.\n          \n              EXT. SCHOOL HALLWAY - DAY\n          \n              The Brain studies the paper. Busses pull into the parking\n              lot behind them. Brendan is distant, lost in thought.\n          \n                                    THE BRAIN\n                          Hm. Do you know anything else about\n                          this?\n          \n          \n          \n          \n          1\n           Our one and only scene in a classroom was moved to Brendan's lunch spot to save us\n          a location change. The degree to which the lack of classroom time in the film has been\n          commented on has always bemused the author, who cannot for the life of him\n          remember a single interesting thing that happened in a classroom in high school.\n          \n                                                               26\n          \n          \n                                BRENDAN\n                          (shakes his head)\n                    Mm.\n          \n                              THE BRAIN\n                    Slim pickings. Why'd you let Dode fly\n                    when he came back to whose-her-name, at\n                    the theater?\n          \n                              BRENDAN\n                        (shrugs dismissively)\n                    Kara. It's their turf, I couldn't hear\n                    them without being seen, and that would\n                    only biff their play. Best to know it's\n                    there, let it ride and see what comes of\n                    it.\n                        (touches the paper)\n                    But anyway.\n          \n                              THE BRAIN\n                    Hm. Well, if this is what I think it is,\n                    it didn't come straight from Dode, less\n                    he's playing out of his league.\n                        (beat)\n                    I can only give you my best guess.\n          \n                               BRENDAN\n                    Yeah.\n          \n                              THE BRAIN\n                    When the upper crust does shady deeds\n                    they do them in different spots around\n                    town. I know under the pier's one, down\n                    by the bike trails in the state park's\n                    another. There's alot of them. The pitch\n                    is they've got little symbols for each\n                    one, and that's how they tell each other\n                    the place, so word won't get around. So\n                    this might be that.\n          \n                              BRENDAN\n                    But Dode wouldn't know it?\n          \n                              THE BRAIN\n                    This is upper crust. Dode's pie pan\n                    grease.\n          \n          Brendan studies the symbol.\n          \n                              BRENDAN\n                    Call anything up?\n          \n                                                                          27\n          \n          \n                                 THE BRAIN\n                       How many places start with 'A'? Or if\n                       it's a shape, or just a random symbol.\n                       Anyway, even if you figured it out, what\n                       good could you do? She's smart, she\n                       knows the play, she's gunning to square\n                       things.\n          \n                                 BRENDAN\n                       Yeah.\n          \n                                 THE BRAIN\n                       You said her business was none of yours,\n                       so she's alright, forget it now. Go\n                       home, sleep.\n          \n          INT. BRENDAN'S BEDROOM - NIGHT\n          \n          Sparsely furnished. Brendan plays Tetris on his computer,\n          staring off into space. His mom's voice calls \"Good night\"\n          and the hallway light turns off.\n          \n                                                                  LATER\n          \n          10:30 by the clock radio on Brendan's nightstand. The slip\n          of paper rests beside it. Brendan lies in bed, staring at\n          the symbol on the paper. His eyes tense.\n          \n          THE SYMBOL\n          \n          Growing larger, burning with a searing intensity, then\n          folding into darkness. Water rushes overhead, over concrete,\n          concrete with a hole in it -- the runoff tunnel, just for an\n          instant, then back underwater, screaming. Brendan choking,\n          screaming, plunging upwards. A woman with no face falls from\n          the darkness and kisses him, her long hair sweeping around\n          him then pulling away. As the last strands slide off his\n          face he wakes up with a start.\n          \n          The clock says 3:46. Brendan drips with sweat, breathing\n          raggedly. He takes the paper and a pencil from the\n          nightstand and shades the symbol to look like this:\n          \n          \n          \n          \n          FLASH CUT - The runoff tunnel, lining up perfectly with the\n          now shaded symbol.\n          \n          BACK TO BRENDAN\n          \n                                                                        28\n          \n          \n          His eyes turn uneasy as he removes his glasses and clicks\n          off the light.\n          \n          EXT. BRENDAN'S HOUSE - DAWN\n          \n          Brendan walks off into the hazy pre-dawn light.\n          \n          EXT. EDGE OF RAVINE\n          \n          Brendan stops at a high wall of weeds, listening to the low\n          gurgle of moving water. Slowly, robotically he pushes\n          through.\n          \n          EMILY'S BODY\n          \n          Face down, bobbing gently in shallow water. Bluish white.\n          Red foam clings to her.\n          \n          EXT. RUNOFF TUNNEL\n          \n          Silently, as if lowered by a string Brendan sinks down,\n          squatting in the mud. His lungs empty in one choppy breath.\n          He pulls his glasses off sluggishly.\n          \n          EMILY'S ARM\n          \n          Lifeless, pale.\n          \n          BRENDAN'S FACE\n          \n          A contorted, frozen mask, eyes wet.\n          \n          EMILY'S HAIR\n          \n          Stringy, flowing gently in the water.\n          \n          BRENDAN'S EYES\n          \n          Dazed, drifting... then suddenly snapping to attention.\n          \n          A noise. From the tunnel.\n          \n          Brendan freezes. The inky blackness of the tunnel mouth\n          opens like a vacuum... silent, but then -\n          \n          The scrape of a shoe against concrete, then echoing\n          footsteps running away.\n          \n          Brendan springs like a cat, sprinting into the tunnel.\n          \n                                                                         29\n          \n          \n          INT. TUNNEL\n          \n          Nearly pitch black. 2 sets of running footfalls. Brendan is\n          chasing, running full speed into the blackness, heart\n          pounding - we almost don't notice that Brendan's are now the\n          only footfalls.\n          \n          Brendan notices. He stops. Silence in the darkness, except\n          for Brendan's breath... and someone near...\n          \n          SLAM! Brendan takes a fist in the cheek and goes down. An\n          inky black figure steps from the shadows and kicks him in\n          the stomach. Brendan curls on the ground, the figure over\n          him.\n          \n                              FIGURE\n                        (low whisper)\n                    Your little Em.\n          \n          The figure runs off. Brendan raises his head painfully - the\n          figure is silhouetted briefly against the distant bright end\n          of the tunnel, then is gone.\n          \n          EXT. RUNOFF TUNNEL - EARLY MORNING\n          \n          Emily's body is still there. Brendan crawls out of the\n          tunnel and collapses in the shallow water, beside the body.\n          He rests his head on his arm, eyes on Em's hair.\n          \n          EXT. CAMPUS - EARLY MORNING\n          \n          Cold and barren, nearly empty. Brendan limps across the\n          barren lawns.\n          \n          EXT. PHONE BOOTHS\n          \n          A line of phone booths on campus. Brendan nearly collapses\n          against one. He dials, still in a stupor.\n          \n                              VOICE ON PHONE\n                    Saint Clement police.\n          \n          Brendan stares into space, eyes burning\n          \n                              VOICE ON PHONE (cont'd)\n                    Saint Clement police, hello? Hello?\n          \n          Brendan hangs up.\n          EXT. LIBRARY - CONTINUOUS\n          \n          Early morning mist below a squat brick building.\n          \n                                                                      30\n          \n          \n          INT. LIBRARY\n          \n          Warmly lit, sheltering the few souls scattered here and\n          there at tables. The Brain sits at one of them reading an\n          impossibly large book. He watches curiously as Brendan\n          approaches him.\n          \n                              THE BRAIN\n                    Hey, Brendan.\n          \n          Brendan falls into a chair. The Brain looks him over.\n          \n                              THE BRAIN (cont'd)\n                    You're up early.\n          \n                              BRENDAN\n                        (thick, distant)\n                    I couldn't sleep.\n          \n                              THE BRAIN\n                        (nods, back to his book)\n                    Find Emily?\n          \n          Brendan breathes out softly.\n          \n                              THE BRAIN (cont'd)\n                    You alright?\n          \n                              BRENDAN\n                    Yeah. What, are you here for zero?\n          \n                              THE BRAIN\n                    Nah, I gotta take the early bus, cause\n                    the others don't run by my street.\n          \n                                 BRENDAN\n                    Bad break.\n          \n                              THE BRAIN\n                    Eh. Time to read's nice. So what's the\n                    word with Em?\n          \n                              BRENDAN\n                    She's gone.\n          \n                              THE BRAIN\n                    Can't raise her?\n          \n                              BRENDAN\n                    No, I can't.\n          \n                              THE BRAIN\n                    So what now?\n          \n                                                                        31\n          \n          \n                              BRENDAN\n                    Now. I don't know. I guess it's... I\n                    don't know.\n          \n          Brendan takes a long moment. He stares down at his glasses,\n          wet with condensation.\n          \n                              BRENDAN (cont'd)\n                    Brain, I can't let her go. I was set to\n                    but I can't. I don't think I can.\n          \n                              THE BRAIN\n                    You think you can help her?\n          \n                                BRENDAN\n                    No.\n          \n                              THE BRAIN\n                    You think you can get the straight,\n                    maybe break some deserving teeth?\n          \n                              BRENDAN\n                    Yeah. I think I could.\n          \n                                THE BRAIN\n                    Well.\n          \n          Brendan rubs his forehead.\n          \n                              BRENDAN\n                    Kara tried to rope me. She came right\n                    out and asked. She was scared. Tell me\n                    to walk from this, Brain. Tell me to\n                    drop it.\n          \n                              THE BRAIN\n                    Walk from it. Drop it.\n                        (grins)\n                    You're thick as what-all, Brendan.\n                                BRENDAN\n                    Yes I am.\n          \n          Brendan cleans his glasses. He looks Brain in the eye, and\n          his mannerisms come back into focus.\n          \n                              BRENDAN (cont'd)\n                    I'd need you to Op. Like on Jerr, but\n                    that was cake to this. And unlike Jerr,\n                    there's not much chance we'll come out\n                    clean. Twenty four seven on this one.\n                    You okay to op for me again?\n          \n                                                                                              32\n          \n          \n              The Brain barely smiles.\n          \n                                    THE BRAIN\n                          What first, tip the bulls?\n          \n              Brendan puts on his glasses, stands to go.\n          \n                                    BRENDAN\n                          No, bulls would gum it. They'd flash\n                          their dusty standards at the wide-eyes\n                          and probably find some yegg to pin,\n                          probably even the right one. But they'd\n                          trample the real tracks and scare the\n                          real players back into their holes, and\n                          if we're doing this I want the whole\n                          story. No cops, not for a bit.\n          \n                                    THE BRAIN\n                          So what first?\n          \n                                    BRENDAN\n                          I don't know. Your mom still have the\n                          cell?\n          \n                                    THE BRAIN\n                          In her car.\n          \n                                    BRENDAN\n                          Borrow it for a few days, get me the\n                          number.\n                              (stands to go)\n                          Wait for my word, and cover for me first\n                          period. I'm going to be a little late.\n          \n              EXT. BASKETBALL FIELD - DAY\n          \n              A vast field of asphalt segmented by a dozen basketball\n              courts outlined in cracked paint.1 Brendan trudges across\n              it, his steps heavy. He stops and stands very still, staring\n              at the ground for a beat then raising his eyes to\n          \n              THE HORIZON\n          \n              Flat, gray, pin straight. Brendan's voice starts speaking\n              rapidly, confident and clear.\n          \n          \n          \n          1\n           This describes the location at my school that the \"showdown\" scenes were originally\n          written for. Between when I wrote the script and when we shot it, however, the school\n          expanded and built portable classrooms on the basketball field, and so we reluctantly\n          moved these scenes to the football field.\n          \n                                                                              33\n          \n          \n                                      BRENDAN (O.S.)\n                            Yeah it was personal. Jerr spooked some\n                            decent gees and ran around some what was\n                            straight with him, but I'm nobody's bull\n                            runner. This wasn't a business sit. But\n                            yeah. I bulled him. Got in tight,\n                            partnered up and sent him over.\n          \n               PAN AROUND to reveal BRENDAN. He looks different, edgier,\n               more alive, wearing different clothes and a thin goatee1. He\n               keeps talking directly at us.\n          \n                                      BRENDAN (cont'd)\n                            I'd bull the lot of them, Em, I'd burn\n                            down the whole party if they tried to\n                            play you again. Jerr and whoever's next.\n                            I want to keep you safe.\n          \n               An ARM swings into frame, wearing cheap plastic bracelets\n               and pale blue fingernail polish. It slaps Brendan hard in\n               the face. He catches it. Emily wrenches her arm away and\n               stumbles backwards onto the pavement.\n          \n               Brendan grabs her sleeve. She twists away. He grabs her\n               shoulder, grabs her waist, she resists, and suddenly they\n               are struggling with violent pent up intensity until with a\n               shout she breaks away and falls to the ground.\n          \n               A beat.     Gulls cry in the distance.\n          \n                                      EMILY\n                            You can't keep me safe, Brendan. I'm in\n                            a bigger world now, and you can't hide\n                            me from it, and you can't beat it. Not\n                            if I don't want you to.\n          \n               Brendan's face looks lumpish, while Emily's is strong. She\n               stands and walks off into the distance across the barren\n               field.\n          \n               BRENDAN'S FACE\n          \n               Watching her go. It is back to present day, pale, clean\n               shaven, sullen. His eyes are cold with resolve.\n          \n               EXT. RUNOFF TUNNEL - EARLY MORNING\n          \n               Brendan sloshes down into the water. Without delicacy he\n               lifts Emily's body and pulls her back into the tunnel.\n          \n               INT. RUNOFF TUNNEL\n          \n          1\n              Which Joe would not even consider, thank god.\n          \n                                                                                             34\n          \n          \n              Pitch back. Brendan lays the body down. Two beady eyes peer\n              at him from the darkness - he freezes. The eyes hop forward\n              - a gull. The two watch each other for a moment, then the\n              gull squawks and flutters out the bright mouth of the\n              tunnel. Brendan follows it without looking back at the\n              body.1\n          \n              EXT. CROWDED HALLWAY - DAY\n          \n              Brendan and the Brain lean against a wall. The Brain slips\n              him a piece of paper.\n          \n                                    THE BRAIN\n                          There's the cell number.\n          \n                                    BRENDAN\n                          Keep it on vibrate.\n          \n                                    THE BRAIN\n                              (pats his jacket pocket)\n                          Yeah.\n          \n                                    BRENDAN\n                          Better stop meeting me in the open too.\n                          I'm going to start getting visible, and\n                          I need you on the underneath. I'll call.\n          \n                                    THE BRAIN\n                          Trueman asked for you. Wants words in\n                          his office.\n          \n                                    BRENDAN\n                          I bet. Keep him off me - stonewall him,\n                          he won't bite, just keep him away from\n                          me.\n          \n                                    THE BRAIN\n                          I'll try. So what's first?\n          \n                                    BRENDAN\n                          Make Em's troubles mine. I'm going to\n                          throw a few words at you, tell me if\n                          they catch. Brick.\n          \n                                       THE BRAIN\n                          No.\n          \n          \n          \n          1\n           A very early draft held on the tunnel after Brendan left, and revealed a dark figure\n          (Dode) creeping away from the top of the tunnel, causing the pebble described on page\n          1 to plink into the water.\n          \n                                                                                                   35\n          \n          \n                                     BRENDAN\n                           Or bad brick.\n          \n                                        THE BRAIN\n                           No.\n          \n                                        BRENDAN\n                           Tug.\n          \n                                     THE BRAIN\n                           Tug... that might be a drink.\n          \n                                        BRENDAN\n                           Drink?\n          \n                                     THE BRAIN\n                           Vodka and milk or something, or maybe\n                           not.\n          \n                                     BRENDAN\n                           Poor Frisco.\n          \n                                     THE BRAIN\n                           Frisco. Frisco Farr1 was a sophomore\n                           last year, I think. Real trash, maybe\n                           hit a class a week. Didn't know him\n                           then, and haven't seen him around.\n          \n                                        BRENDAN\n                           Pin.\n          \n                                     THE BRAIN\n                           Pin... the Pin?\n          \n                                     BRENDAN\n                           The Pin, yeah.\n          \n                                     THE BRAIN\n                           The Pin's kind of a local spook story.\n                           You know the Kingpin?\n                                     BRENDAN\n                           I've heard it.\n          \n                                     THE BRAIN\n                           Same thing. Supposed to be old, like 26,\n                           lives in town.\n          \n          \n          1\n           All apologies to Frisco Farr, who the author did actually go to school with, and who\n          was neither a druggie nor `real trash', but was a great guy who simply had a very cool\n          sounding name. He is now (the author was horrified to learn) practicing law.\n          \n                                                                                                 36\n          \n          \n                                     BRENDAN\n                           Jake1 runner, right?\n          \n                                     THE BRAIN\n                           Big time... maybe. Ask any dope rat\n                           where their junk sprang they'll say they\n                           scraped it from that who scored it from\n                           this who bought it off so, and after\n                           four or five connections the list'll\n                           always end with the Pin. But I'll becha\n                           you got every rat in town together and\n                           said 'show your hands' if any of them've\n                           actually seen the Pin, you'd get a crowd\n                           of full pockets.\n          \n                                     BRENDAN\n                           You think the Pin's just a tale to take\n                           whatever heat?\n          \n                                     THE BRAIN\n                               (shrugs. Beat)\n                           But what's first?\n          \n                                     BRENDAN\n                           A show of hands.\n          \n              INT. BACKSTAGE OF THEATER\n          \n              Brendan strides past forest scenery and drama geeks, through\n              another door and into sunlight.\n          \n              EXT. BACK OF THEATER - DAY\n          \n              Kara smokes a cigarette. Brendan leans beside her.\n          \n                                     KARA\n                               (annoyed)\n                           Hey Brendan. Here for the show?\n          \n                                         BRENDAN\n                           No.\n          \n                                     KARA\n                           Would you go then, honey, cause I've got\n                           this headache.\n          \n                                     BRENDAN\n                           Try smoking like a chimney, I've heard\n                           that helps.\n          \n          \n          1\n           In an admittedly paltry concession to clarity, this was changed to `Dope runner' in post\n          production.\n          \n                                                                   37\n          \n          \n          Brendan grabs the pack of cigarettes.\n          \n                              BRENDAN (cont'd)\n                    Isn't this Dode's brand?\n          \n          Kara snaps her head towards him, a flash of anger. She\n          catches herself and smiles cooly.\n          \n                              KARA\n                    You don't know Dode's brand.\n          \n                              BRENDAN\n                    Oh I do now.\n          \n          Angry again, Kara snatches the pack from him.\n          \n                              BRENDAN (cont'd)\n                    I'm going to start shaking things up.\n                    Give me the story and you might miss the\n                    bite.\n                              KARA\n                    The story about what?\n          \n                               BRENDAN\n                    Alright.\n          \n          He turns and walks away.\n          \n                              KARA\n                    The story about what?\n          \n                              BRENDAN\n                    I don't want to play games if you've got\n                    a headache. Get me if you want to spill\n                    it, but I can't guarantee safe passage\n                    after tonight.\n          \n                              KARA\n                    I don't know what-\n          At the stage door, not slowing.\n          \n                              BRENDAN\n                    Tell the Pin that Brad was my calling\n                    card, and I need words.\n          \n                              KARA\n                    Brad Bramish?\n          Through the door and into the theater.\n          \n                                                                         38\n          \n          \n          INT. BACKSTAGE OF THEATER - CONTINUOUS\n          \n          He spins to see Kara's face just before the door closes.\n          She's worried.\n          \n          EXT. CROWDED SCHOOL HALLWAY - DAY\n          \n          The Brain walks out of a classroom and Brendan swings behind\n          him.\n          \n                              BRENDAN\n                        (fast and low)\n                    Tail Kara through lunch. She's got\n                    rehearsal but she'll blow early. She\n                    goes home, drop her, else wait for my\n                    call.\n          \n          The Brain turns and Brendan's gone.\n          \n          EXT. PARKING LOT - LUNCH\n          Brendan wanders through the thick lunchtime crowd towards a\n          cluster of 3 or 4 flashy luxury cars set aside at the far\n          end of the lot.\n          \n          Brad Bramish sits slouched in the front seat of his\n          convertible, front door open. A small crowd hangs about\n          Brad, his crony Biff at his elbow.\n          \n                              BRAD\n                    That's all I'm saying, is put me in the\n                    game and I'll do what needs to be done,\n                    but they don't put me in, what needs\n                    doing don't get done and don't come\n                    crying to me, man. Get off my grill man,\n                    you didn't put me in, don't come to me\n                    if you didn't let me play.\n          \n                              BIFF\n                    They didn't!\n          \n          Brendan scans the rest of the cars. His eyes catch on Laura\n          Dannon sitting in another convertible, off to the side. Her\n          bright eyes cut through the crowd, straight into Brendan.\n          \n          He wags his eyebrows at her. She looks away. Brendan walks\n          into Brad's direct line of view and obviously leans against\n          one of the cars.\n          \n                              BRAD\n                    Hey! What are you doing here?\n          \n                                                                    39\n          \n          \n                                 BRENDAN\n                    Listening.\n          \n                                 BRAD\n                    Uh huh.\n          \n                              BRENDAN\n                    Alright, you got me. I'm a scout for the\n                    Gophers.\n          \n                              BRAD\n                        (not amused)\n                    Oh yeah?\n          \n                              BRENDAN\n                    Of all things, yeah. Been watching your\n                    game for a month, but that story just\n                    now clenched it. You've got heart, kid.\n                    How soon can you move to Minneapolis?\n          \n          A few snickers around the crowd, but nowhere near Brad.\n          \n                              BRAD\n                        (flat with anger)\n                    Yeah?\n          \n                              BRENDAN\n                    Cold winters, but they've got a great\n                    public transit system.\n          \n                                 BRAD\n                    Yeah?\n          \n                                 BRENDAN\n                    Yeah.\n          \n                                 BRAD\n                    Oh yeah?\n          \n                              BRENDAN\n                    There's a thesaurus in the library.\n                    'Yeah's under 'Y'. Go ahead, I'll wait.\n          \n                              BRAD\n                    Who invited you?\n          \n                              BRENDAN\n                    To the parking lot? Well gee I kind of\n                    invited myself.\n          \n                              BRAD\n                    I think you'd better leave then.\n          \n                                                                         40\n          \n          \n                              BRENDAN\n                    No, I'm having too good a time.\n          \n                              BRAD\n                    Just the same.\n          \n          Brendan smiles slightly, and very deliberately crosses his\n          legs. Brad's face tenses.\n          \n                              BRAD (cont'd)\n                    Maybe you want to go someplace more\n                    private.\n          \n                                BRENDAN\n                    With you?\n          \n          Brad says 'who else?' by lifting his arms.\n          \n                               BRENDAN (cont'd)\n                        (as if he's been asked to the\n                          movies)\n                    Sure.\n          \n          Brendan stands and walks off. Brad follows and the rest of\n          the crowd trails after him.\n          \n          He leads them behind a parked VW van and turns to face Brad.\n          People gather around in a wide circle.\n          \n          Brendan pulls his jacket off as Brad hangs back, mumbling.\n          \n                              BRAD\n                    You know what's good for you you'll just\n                    beat it. Beating a small frye won't win\n                    me anything and it's not going to do you\n                    any good-\n          \n          Laura pulls up in her convertible, behind Brad, watching.\n          \n          In the next moment Brendan cuts Brad off by putting his fist\n          in his face.\n          \n          Brad grunts but doesn't lose ground. Brendan throws his\n          short stocky frame into Brad's larger one and tenderizes his\n          midsection with jabs.\n          \n          Brad tags Brendan in the ribs, then smacks the palm of his\n          hand into Brendan's face, shoving him back onto the\n          pavement.\n          \n          He comes at Brendan with his big fists clenched.\n          \n          Brendan kicks Brad full force in the shins.\n          \n                                                                         41\n          \n          \n          Brad tumbles, and Brendan comes up fast, connecting hard\n          with the point of Brad's chin. Brad gets his balance fast,\n          and before Brendan can throw another he throws one himself,\n          then another, both into Brendan's stomach. Brendan pulls\n          back and kicks Brad's shin where he had kicked it before.\n          Brad roars and hits Brendan very hard in the face.\n          \n          Brendan bounces back like a rubber ball and throws his\n          weight into a square punch right into Brad's nose.\n          \n          The sound of eggs breaking, and Brad falls backwards like a\n          board.\n          \n          He stays down, holding his face.\n          \n          Brendan staggers back, breathing hard, and looks up at the\n          small crowd. Some stare at Brendan, some at Brad, but nobody\n          seems about to do anything. Brendan runs his sleeve over his\n          face and walks unsteadily off, pushing past the last few\n          people rushing over.\n          \n                              STRAGGLER\n                    Hey, is there a fight?\n          \n                              BRENDAN\n                    Yeah.\n          \n          He throws a last look at Laura, who meets his gaze and\n          drives off.\n          \n          EXT. SCHOOL PARKING LOT SIDEWALK - CONTINUOUS\n          \n          Brendan walks away from the lot, towards the school. Laura\n          pulls up beside him in her car.\n          \n                              LAURA\n                    Hey.\n          \n          Brendan ignores her and b-lines for the school. Laura brakes\n          hard, parking by the curb.\n          EXT. SCHOOL HALLWAY - CONTINUOUS\n          \n          Brendan limps down the hallway.    Laura appears behind him,\n          trotting to catch up.\n          \n                              LAURA\n                    You're quite a pill.\n                              BRENDAN\n                    Uh huh.\n          \n                                                                   42\n          \n          \n                              LAURA\n                    Where are you going?\n          \n                               BRENDAN\n                    Home.\n          \n                              LAURA\n                    Why did you take a powder the other\n                    night?\n          \n                              BRENDAN\n                    Same reason I'm taking one now.\n          \n                              LAURA\n                    Hold it.\n                        (he keeps walking)\n                    I don't get you. That's a chilly heel to\n                    be giving a girl who's where you want to\n                    know about.\n          \n                              BRENDAN\n                    I'll get where I'm going just fine.\n          \n                              LAURA\n                    I want to help you.\n          \n                               BRENDAN\n                    Go away.\n          \n          Silence behind him. He stops, turns wearily. She looks\n          genuinely hurt.\n          \n                              BRENDAN (CONT'D) (cont'd)\n                    Look, I can't trust you. You ought to be\n                    smart enough to know that. I didn't\n                    shake the party up to get your\n                    attention, and I'm not heeling you to\n                    hook you. Your connections could help\n                    me, but the bad baggage they bring could\n                    make it zero sum game or even hurt me,\n                    so I'm better off coming at it clean.\n          \n                              LAURA\n                    I wouldn't have to lead you in by the\n                    hand-\n          \n                              BRENDAN\n                    I can't trust you. Brad was a sap, you\n                    weren't, you were with him and so you\n                    were playing him, so you're a player.\n                    With you behind me I'd have to tie one\n                    eye up watching both your hands, and I\n                    can't spare it.\n          \n                                                                      43\n          \n          \n                              LAURA\n                    You're not Brad.\n          \n                              BRENDAN\n                    No, I'm not.\n          \n          He turns and walks away. She doesn't follow.\n          \n          EXT. SCHOOL PAYPHONE - AFTERNOON\n          \n          Brendan slumps against it, receiver to his ear, licking a\n          bruised lip. He wears dark glasses.\n          \n                              THE BRAIN\n                        (on the phone)\n                    You didn't call.\n          \n                              BRENDAN\n                    Sorry. Kara went home though, didn't\n                    she?\n                              THE BRAIN\n                    Yeah, but she stopped at a payphone and\n                    made two calls that she didn't want on\n                    her phone bill.\n          \n                              BRENDAN\n                    Get the numbers?\n          \n                                 THE BRAIN\n                    No. Sorry.\n          \n                              BRENDAN\n                    S'alright. Are me and Brad front page\n                    news?\n          \n                              THE BRAIN\n                    All the buzz. You really do that?\n          \n                                 BRENDAN\n                    Yeah.\n          \n                              THE BRAIN\n                    Why? Is Brad the Pin?\n          \n                              BRENDAN\n                    Brad's a sap. I downed him on his field\n                    and his crew didn't bite. So now I know\n                    he's a sap and anyone who acts like he\n                    isn't is profiting by it. That's not why\n                    I roughed him, though.\n          \n                                                                           44\n          \n          \n                                 BRAIN\n                    For kicks?\n          \n                              BRENDAN\n                    Economics. Brad's the school's biggest\n                    jake buyer, so if this Pin is behind all\n                    the selling, I just got his attention.\n                    Anyway, now's just shaking things out.\n                    Look, you know a kid around the burgh,\n                    lanky, short, shaved head, turns a black\n                    tang?\n          \n                              THE BRAIN\n                    I told you before I don't know the car.\n                    Those types are a nickel a pound, but\n                    nobody I know that you don't. And\n                    Trueman again-\n          \n                              BRENDAN\n                    Keep him off. And keep your specs on - I\n                    need to find that kid.\n          \n                                 THE BRAIN\n                    Okay.\n          \n          Brendan hangs up and turns sluggishly.\n          \n          A lanky kid with a short shaved head and engineer boots\n          punches him in the face.\n          \n          Brendan hits the pavement. The lanky kid is over him in a\n          split second, beating his face and body with short, heavy\n          blows.\n          \n          Flashes of the lanky kid - a shiny scar shaped like a thin\n          triangle runs down the side of his face.\n          \n          After a brief silent thrashing the kid walks off with\n          several other blurry figures. A car peels out and roars off\n          O.S.\n          \n          Brendan lies still. The class bell rings, very distant. Legs\n          criss cross before his eyes, each blurring the world a bit\n          more until it is completely smeared.\n          \n                                                               FADE OUT.\n          \n                                                                FADE IN:\n          \n          INT. OFFICE\n          Brendan sits with an ice pack against his head in a tiny\n          office. A man in his early thirties behind a wood colored\n          \n                                                                  45\n          \n          \n          desk and name plate, \"GARY TRUEMAN, ASSISTANT VICE\n          PRINCIPAL\" plays with a pencil.\n          \n                              TRUEMAN\n                    You didn't know this boy?\n          \n                              BRENDAN\n                    No sir, never seen him.\n          \n                              TRUEMAN\n                    And he just hit you?\n          \n                              BRENDAN\n                    Like I said, he asked for my lunch money\n                    first. Good thing I brown bagged it.\n          \n          Trueman trains a good natured dubious eye on Brendan.\n          \n                              TRUEMAN\n                    Alright Brendan. I've been looking to\n                    talk to you.\n          \n          Brendan doesn't react.\n          \n                              TRUEMAN (cont'd)\n                    You've helped this office out before.\n          \n                              BRENDAN\n                    No. I gave you Jerr to see him eaten,\n                    not to see you fed.\n          \n                              TRUEMAN\n                    Fine, and well put.\n          \n                              BRENDAN\n                    Accelerated English, Mrs. Kasprzyk.\n          \n                              TRUEMAN\n                    Tough teacher?\n          \n                              BRENDAN\n                    Tough but fair.\n          \n                              TRUEMAN\n                    Mm. Anyway then, we know you're clean,\n                    and you've, despite your motives, you've\n                    been an asset to us. I think you're a\n                    good kid.\n                              BRENDAN\n                    Uh huh.\n          \n                                                               46\n          \n          \n                              TRUEMAN\n                    I want to run a couple names by you.\n          \n          Brendan stands to go.\n          \n                              TRUEMAN (cont'd)\n                    We're not done here.\n          \n                              BRENDAN\n                        (angry)\n                    I was done here three months ago. I told\n                    you then I'd give you Jerr and that was\n                    that, I'm not your inside line and I'm\n                    not your boy.\n          \n                              TRUEMAN\n                    That's not a very helpful-\n          \n                              BRENDAN\n                        (anger builds)\n                    You know what I'm in if the wrong yeg\n                    saw me pulled in here?\n          \n                              TRUEMAN\n                    What are you in?\n          \n                              BRENDAN\n                    No. And no more of these informal chats\n                    - if you've got a discipline issue with\n                    me write me up or suspend me and I'll\n                    see you at the parent conference.\n          \n                              TRUEMAN\n                    Hold it, I could - hold it - could write\n                    you up for talking back to a VP. For\n                    looking at me in a threatening way. I'd\n                    exercise a little more tact, Mr. Frye.\n                    You can't pull a play like that unless I\n                    need you for something. So do I?\n          \n                              BRENDAN\n                    Maybe.\n          \n                              TRUEMAN\n                    So maybe you're gonna need me too.\n          \n                              BRENDAN\n                    Maybe. Alright, I need you off my back\n                    completely for a few weeks. There might\n                    be some heat soon.\n          \n                                                               47\n          \n          \n                              TRUEMAN\n                        (interested)\n                    If it's something I can't cover, I won't\n                    go to bat for you.\n          \n                              BRENDAN\n                    If I get caught like that it's curtains\n                    anyway - I couldn't have brass cutting\n                    me favors in public. I'm just saying now\n                    so you don't come kicking in my homeroom\n                    door once trouble starts.\n          \n          Trueman bites a thumbnail.\n          \n                              TRUEMAN\n                    Okay, here's what I can do. I won't pin\n                    you for anything you aren't caught at.\n                    I'll ride it a little while, as long as\n                    it doesn't get too rough. But if\n                    anything comes up with your fingerprints\n                    on it, I can't help you. Also, if I get\n                    to the end of whatever this is and it\n                    gets hot and you don't deliver, The Veep\n                    will need someone to hand over, police-\n                    wise. And I'll have you. There better be\n                    some meat at the end of this like you\n                    say, or at least a fall guy, or you're\n                    it.\n          \n                              BRENDAN\n                    Sure I am. Got one more favor to ask.\n          \n          EXT. ADMINISTRATION BUILDING - AFTERNOON\n          \n          Gary Trueman throws Brendan out.\n          \n                              TRUEMAN\n                    Get the hell off my campus, punk!\n          Brendan glances around, and limps off.\n          \n          EXT. CARROWS PARKING LOT - AFTERNOON\n          \n          No stoners, no Dode. Brendan breathes uneasily.\n          \n          EXT. PAYPHONE BY CARROWS - AFTERNOON\n          \n          Brendan leans against it.\n          \n                              THE BRAIN\n                    No, Dode's MIA all around.\n          \n                                                                         48\n          \n          \n                              BRENDAN\n                    I'm 9 of 10 that Kara's got him, but who\n                    knows where. I shook but she's not\n                    spilling.\n          \n                              THE BRAIN\n                    No more job offers? So she's got a play.\n          \n                              BRENDAN\n                    And I know enough about Kara to let that\n                    worry me. Alright, keep your specs on\n                    for him. Any other news?\n          \n                              THE BRAIN\n                    Some. Laura Dannon came to me looking\n                    for you.\n          \n                              BRENDAN\n                        (considers this)\n                    She did, huh?\n          \n                              THE BRAIN\n                    Fourth period, nearly shook me upside\n                    down. Can't say I didn't enjoy it, but\n                    why'd she come to me?\n          \n                              BRENDAN\n                    She's tapping Kara, and Kara knows you\n                    know me.\n          \n                              THE BRAIN\n                    Yeah, well. She's some piece of work. If\n                    I had known where you were I might have\n                    told her.\n          \n                              BRENDAN\n                    That's the spirit. Ask around for Dode,\n                    tail Kara again at lunch. I got knives\n                    in my eyes, I'm going home sick. I'll\n                    call you tonight.\n          \n          EXT. SIDEWALK - LATE AFTERNOON\n          \n          Bordering a supermarket. Brendan trudges along. Suddenly he\n          stops. Parked in the supermarket parking lot is a black\n          mustang.\n          \n          EXT. PARKING LOT - LATE AFTERNOON\n          \n          The sun hangs low. Brendan approaches the car and walks\n          around it slowly. He peers inside. A tuft of paper pokes out\n          from under the seat. He pulls the door handle, locked.\n          \n                                                                         49\n          \n          \n          Brendan picks up a broken chunk of concrete from the ground,\n          waddles over to the car and holds the chunk above his head,\n          ready to drop it through the window.\n          \n          He stops. His eyes catch something in the distance.\n          \n          The lanky shaved-head kid, whose name is Tugger.   Coming\n          towards him fast.\n          \n          Brendan stands there for a moment, then lets the chunk fall\n          to the ground. He casually leans against the car, removes\n          his glasses, puts them in a hard case and puts the hard case\n          in his pocket.\n          \n          Tugger hits him like a train and throws him across the\n          pavement. Tug turns back to the car and takes out his keys.\n          \n          Brendan gets up and comes towards Tug, his face stiff. Tug\n          turns and pops him once squarely in the mouth. Brendan falls\n          to his knees.\n          \n          While Tug unlocks the door Brendan stands up woozily.\n          Grunting, Tug spins and grabs Brendan's jacket, pushing him\n          back while he slaps him hard in the face, back and forth,\n          three times. When Tug lets go Brendan drops like a stone,\n          catching himself on his hands and knees. The car door slams.\n          \n          The mustang drives about a hundred yards out into the\n          parking lot, spins around and stops, facing Brendan. Its\n          motor purrs deeply. Brendan begins to limp towards it\n          doggedly, head up, eyes fixed.\n          \n          A crackling roar and short squeal of tires spit the mustang\n          forward. It comes straight at Brendan, rumbling like a tank.\n          \n          Brendan stops walking and stands very still, eyes steady.\n          The gap between him and the car closes in no time at all.\n          \n          It speeds past him not six inches to his left, brushing the\n          edge of his jacket. Brakes squeal behind him. Brendan turns\n          and lopes towards the mustang, idling about fifty feet away.\n          \n          He stops at the window.   Tugger eyes him curiously, with\n          some respect.\n          \n                              BRENDAN\n                    I want to see the Pin.\n          \n                              TUGGER\n                        (nods slightly)\n                    Yeah, I guess you do.\n          \n                                                                                                      50\n          \n          \n                EXT. STREETS\n          \n                Twisty and narrow. The black mustang flies through them at\n                impossible speeds, roaring past like a bullet.\n          \n                DARKNESS\n          \n                Loud engine noise, jostling, grunting. Then a metallic\n                jangle, some scraping, and a CLINK!\n          \n                EXT. REAR OF FAST MOVING MUSTANG - LATE AFTERNOON\n          \n                The trunk pops open, revealing Brendan holding a jack rod.\n          \n                INT. MOVING MUSTANG - CONTINUOUS\n          \n                Tug is putting a tape in the deck, eyes down. Behind him\n                the trunk pops open, then pulls down out of sight just as he\n                looks back up.\n          \n                INT. TRUNK OF MOVING MUSTANG\n                Brendan holds the trunk about three inches open, just enough\n                to see which street signs pass by. Loud music plays from the\n                car -- \"Sweet Baby James\" by James Taylor.1\n          \n                The car zooms on.\n          \n                BRENDAN'S POV\n          \n                Through the ajar trunk. The mustang slides to a stop beside\n                an elaborate wooden mailbox carved as an eagle's head.\n                Brendan closes the trunk.\n          \n                EXT. FRONT OF HOUSE - LATE AFTERNOON\n          \n                A small one story house, slightly run down. Tugger opens the\n                trunk and drags Brendan out, covering his eyes with a palm,\n                slams the trunk and goes inside.\n          \n                When they are gone the broken trunk drifts open.\n          \n                INT. BASEMENT HALLWAY\n          \n                A very dim narrow hall with a steep stairway at one end,\n                dark doors down the length of it and a lit door at the other\n                end. Tugger drags Brendan down the stairway, drops him and\n                goes into the lit room.\n          \n          \n          \n          \n          1\n              Unfortunately Mr. Taylor flatly refused, which, given the context, was probably wise.\n          \n                                                                        51\n          \n          \n          Brendan lifts his head painfully. Surrounding him in the\n          darkened doorways are dozens of boys, some dressed like\n          Tugger, others dressed in black.\n          \n          Tug pokes his head out.\n          \n                               TUGGER\n                    Alright.\n          \n          Arms pop out of the darkness and drag Brendan towards the\n          lit room.\n          \n          INT. KINGPIN'S DEN\n          \n          A small room, amazingly messy. Clothes strewn about, groves\n          of empty bottles, precarious piles of books. The overall\n          impression though is not of jumbled chaos, but of a nest,\n          comfortably woven and very worn in.\n          \n          A slim figure with wispy hair sits facing the wall at a\n          small desk, writing under a green bookkeeper's lamp.\n          \n          Brendan is shoved into the center of the room. Tug and his\n          clones slump against the surrounding walls. Brendan watches\n          the thin figure's back. For a beat the only noise is the\n          scratching of the thin man's pencil. Then he sighs and\n          swivels around.\n          \n          Mid to late twenties. Sallow features, tired eyes. His\n          clothes are so richly black it is difficult to make out\n          specific items -- he is just one inky black mass from the\n          neck down and eyebrows up.\n          \n                              BRENDAN\n                    You the Pin?\n          \n                              PIN\n                    Yeah.\n                        (beat of silence)\n                    So now I'm very very curious what you're\n                    going to say next.\n          \n                              BRENDAN\n                    Maybe I'll just sit and bleed at you.\n          \n          The Pin shifts in his seat, bored.\n          \n                              PIN\n                    Helled if you're gonna go breaking my\n                    best clients' noses and expect me to\n                    play sandbag. Anyway you've been\n                    sniffing me out before then, sniffing\n                    for me like a vampire bat for a horse\n          \n                                                                        52\n          \n          \n                    with a nick on its ear he can suck on.\n                    They do that.\n                        (Brendan blinks)\n                    So now you got Tugger to bring you here,\n                    which he never does, and you got me\n                    listening, so I'm curious what you've\n                    got to say that better be really, really\n                    good.\n          \n                              BRENDAN\n                    Call Ms. Dannon in from the hall first;\n                    she oughta hear this.\n          \n                              PIN\n                        (amused)\n                    No dice, soldier. Would have been a neat\n                    trick, though.\n          \n                              BRENDAN\n                        (shrugs, then slowly)\n                    I was going to make up some bit of\n                    information or set up some phony deal,\n                    anything so you'd let me walk. Then I\n                    was going to go to the vice principal\n                    and spill him the street address of the\n                    biggest dope port in the burgh.\n          \n          The Pin's eyes shoot to Tugger, who doesn't flinch.\n          \n                              TUGGER\n                    He knows zippo.\n          \n                              BRENDAN\n                    1250 Vista Blanca, the ink blotter at\n                    the desk in the den in the basement of\n                    the house with the tacky mailbox.\n          \n          The world turns on its side as Tugger pushes Brendan's head\n          down into the carpet.\n          \n                              TUGGER\n                    You gonna do what now?!\n          \n          The Pin walks towards them. One of his shoes is twice the\n          size of the other.\n          \n                              PIN\n                    No good, soldier.\n          \n          The cronies around the room begin cackling. Tug's face is a\n          mask of rage. Brendan can't breath. His face swells.\n          \n                                                                         53\n          \n          \n                              PIN (cont'd)\n                    Alright, let up.\n          \n          But Tug doesn't let up. Brendan's world grows hazy, the\n          cackling laughter reverberates, then a clean voice pierces\n          the din.\n          \n                                 LAURA\n                        (OS)\n                    Tug, stop.\n          \n          Tug's face breaks for a moment, and he lets go. Brendan's\n          head lolls to the side. Laura stands in the dark doorway.\n          \n          Brendan sees Tug's knuckles and a flash of white for a split\n          moment as Tug hits him in the face. The Pin's black body\n          spills out across the frame, leaving us in black.\n          \n          FADE UP\n          \n          SMALL DARK ROOM\n          \n          Brendan wakes up curled on a mattress on the floor. A bare\n          light bulb hangs from the ceiling. Tugger sits five feet\n          away, watching him like a hungry dog. Brendan stares back at\n          him through thick, glazed eyes.\n          \n                              BRENDAN\n                    Where are my glasses?\n                        (Tugger grins)\n                    Hell with ya then. Which wall's the door\n                    in?\n          \n          Tug points, amused. Brendan heaves himself up, and Tug\n          shoves him back down.\n          \n          Brendan winks at him, stands and lurches towards the door\n          again.\n          \n          Tugger grabs his shirt and slams him into the wall, but\n          freezes when he hears a door latch click. Sneering, he drops\n          Brendan back onto the mattress and sits against the opposite\n          wall.\n          \n          Sounds of a door opening and closing come from the darkness.\n          Light footsteps clack on the cement floor. Suddenly Tug\n          vanishes -- the room's darkness just seems to swallow him.\n          \n          The thin whispery voice of the Pin speaks softly.\n          \n                              PIN\n                    Sorry about this kid, but what the hell\n                    with what you said before.\n          \n                                                                         54\n          \n          \n          His disembodied face appears a few feet about where Tug had\n          sat.\n          \n                              PIN (cont'd)\n                    Where you were at, with all of us and\n                    the Tug a fist away, you've got to use\n                    your nut. Allay the situation, So yeah,\n                    you're not scared of me, I got it, but\n                    I'm also thinking you're a little nuts\n                    now, so you've got that trade off with\n                    your standing. But nuts isn't all bad,\n                    so maybe it was a good play. I don't\n                    know.\n          \n          He is standing in front of Tug. His black clothes and broad\n          rimmed black hat blend perfectly with the dark room, such\n          that his face seems to bob about in space. Brendan stifles a\n          cough.\n          \n                              PIN (cont'd)\n                    So, Laura talked me down. Let's get you\n                    upstairs, back with the living.\n          \n          INT. KITCHEN - DAY\n          \n          Brendan sits at a breakfast table eating cornflakes. The\n          kitchen is on the first floor of the Pin's house, or rather\n          the Pin's mother's house. She is a soft old lady in a pastel\n          cotton dress, currently bent over the fridge mumbling.\n          \n                              MOTHER\n                    I thought we had orange juice, Brendan,\n                    I'm sorry. How about Tang, or that's\n                    more like soda isn't it, or not soda but\n                    it hasn't got any juice in it, it can't\n                    be very fortifying.\n          \n                              BRENDAN\n                    Water's fine, ma'am, thanks.\n          \n                              MOTHER\n                    Now just a moment, we have apple juice\n                    here, if you'd like that, or milk,\n                    though you've got that in your\n                    cornflakes, I don't know if drinking it\n                    as well might be too much.\n          \n                              BRENDAN\n                    Apple juice sounds terrific.\n          \n                              MOTHER\n                    It's country style.\n          \n                                                                       55\n          \n          \n                              BRENDAN\n                    That's perfect.\n          \n          She shuts the fridge. Tugger and the Pin sit behind her,\n          looking comfortably bored. The Pin, a sharp black hole\n          against the soft yellow kitchen, eats oatmeal cookies with\n          small delicate bites.\n          \n                              MOTHER\n                    I'll even give it to you in a country\n                    glass, how'd that be? Boys?\n          \n                              TUGGER\n                    I'm fine, Mrs. M.\n          \n                              PIN\n                    Thanks, mom.\n          \n          The Pin kisses her on the cheek.\n          \n                              MOTHER\n                    Okay, well I'm going to go, um, do\n                    something in the other room now...\n          \n          She shuffles out.\n          \n                              PIN\n                        (to Brendan)\n                    So hows bout we take another snap at\n                    hearing your tale?\n          \n                              BRENDAN\n                    I don't know. It starts out same as\n                    before, and this floor ain't carpeted.\n          \n                              PIN\n                    We're cooled off.\n          \n                              BRENDAN\n                    Yeah well, your muscle seemed plenty\n                    cool putting his fist in my head. I want\n                    him out.\n          \n          The Pin grins thinly, uncomfortable.\n          \n                              PIN\n                    Looky, soldier-\n          \n                              BRENDAN\n                    The ape blows or I clam.\n          \n                                                                       56\n          \n          \n                              TUGGER\n                        (stands violently)\n                    So clam! What've you got I can't beat\n                    out of you back in the basement?\n          \n          The Pin and Brendan are perfectly still, watching each\n          other.\n          \n                              PIN\n                    Give us a few minutes, Tug.\n          \n          Tug turns to him, but Pin keeps his eyes on Brendan.\n          \n                              PIN (cont'd)\n                    I'll call you if whatever.\n          \n          Beat. Tug stomps off, slamming the narrow door hard behind\n          him. The Pin goes back to gnawing his cookie.\n          \n                                PIN (cont'd)\n                    So?\n          \n          Brendan sets down his spoon.\n          \n                              BRENDAN\n                    About a year ago I had a small time\n                    dealing partnership with Jerr Madison.\n                    Know him?\n          \n                              PIN\n                    Till he took the fall for you.\n          \n                              BRENDAN\n                    Yeah well. I didn't ask him to, but he\n                    was a straight player. I got out clean -\n                    almost. Nothing on my official record,\n                    but the VPs play it like I owe them one.\n                    When I made it clear I wasn't playing\n                    their hound dog, well they didn't like\n                    it. They keep calling me in, badgering\n                    me.\n          \n                              PIN\n                    Gee that's tough.\n          \n                              BRENDAN\n                    I don't like being told whose side I'm\n                    on. So now they think I'm on your trail,\n                    I'm in a nice spot to know their\n                    movements and feed them yours.\n          \n                                PIN\n                    I gotcha.\n          \n                                                                         57\n          \n          \n                              BRENDAN\n                    You haven't got me yet.\n          \n                              PIN\n                    What, price?\n          \n                              BRENDAN\n                    Considering the benefits my services\n                    could yield, I don't think that's\n                    unreasonable.\n          \n                              PIN\n                    And what are your services exactly, just\n                    so I can be specific on the invoice?\n          \n                              BRENDAN\n                        (shrugs)\n                    Whatever serves your interests.\n          \n          The Pin stands.\n          \n                              PIN\n                    Fair enough. I'll have my boys check\n                    your tale, and seeing how it stretches\n                    we'll either rub or hire you. You'll\n                    know which by end of the day tomorrow.\n          \n          Brendan stands but doesn't follow as the Pin opens the\n          narrow door Tugger went through and descends the dark stairs\n          behind.\n          \n                              PIN (cont'd)\n                    We're done.\n          \n          The moment the Pin vanishes into the basement's murk Laura\n          comes up out of it. She takes Brendan's hand.\n          \n                              LAURA\n                    I'll drive you back.\n          INT. LAURA'S CONVERTIBLE MOVING - SUNSET\n          \n          They zig zag though the twisty suburban streets. Brendan\n          stares sullenly into space.\n          \n                              BRENDAN\n                    Just drop me at school.\n                        (they take a hard turn)\n                    How long was I out?\n          \n                              LAURA\n                    Half an hour. It took all of it for me\n                    to cool the Pin down.\n          \n                                                                                                   58\n          \n          \n                                     BRENDAN\n                               (flatly, but sincerely)\n                           Thanks.\n          \n              They drive on in silence.\n          \n              EXT. SCHOOL PARKING LOT - DUSK\n          \n              Laura's convertible stops, and Brendan climbs out painfully.\n              He studies her face for a moment.\n          \n                                     LAURA\n                           You trust me now?\n          \n                                     BRENDAN\n                           Less than when I didn't trust you\n                           before. If you can tell me your angle in\n                           this, maybe I can.\n          \n                                     LAURA\n                           Come here.1\n          \n              Brendan leans on the car, his face close to hers.\n          \n                                     LAURA (CONT'D) (cont'd)\n                           I'm on the in, top level of the tower\n                           and I know everyone, but I don't know\n                           all what goes on. I knew Em when she\n                           tried to get with me and Brad, and I\n                           liked her. She was smart. But she wasn't\n                           us, and it didn't work. When she left\n                           she took some souvenirs, dirty habits\n                           she wasn't strong enough to control and\n                           a connection to the Pin to keep them\n                           going. With me?\n          \n                                          BRENDAN\n                           So far.\n          \n                                     LAURA\n                           A few months go by, and the next I hear\n                           the Pin's raging over a situation with\n                           some certain junk Em was partial to, and\n                           the downfall's coming on Em's head.\n          \n                                     BRENDAN\n                           You think Em scraped the junk off the\n                           Pin?\n          \n          \n          \n          1\n           Not to weasel in a plug, but the original version of this scene (shot as written) is on the\n          deleted scenes section of the DVD. Available at fine retailers everywhere.\n          \n                                                                         59\n          \n          \n                              LAURA\n                    I don't know, but whether she scraped or\n                    copped or just ran her tab around the\n                    world and into her own back, it must\n                    have been grand. I've never seen the Pin\n                    so hot.\n          \n                              BRENDAN\n                    This all helps but it's not what I\n                    asked. What's your angle in all this?\n          \n                              LAURA\n                    I don't know. I'm usually pretty sharp,\n                    but... maybe I see what you're doing for\n                    Emily, trying to help her. And I don't\n                    know anyone who would do that for me.\n          \n                              BRENDAN\n                    Now you are dangerous.\n          \n          Throwing the car in gear, she peels out and leaves him\n          standing alone in the fading evening light.\n          \n          INT. BACKSTAGE\n          \n          Brendan pushes through the gloom, past forest scenery,\n          deeper and deeper until he comes to a door.\n          \n          INT. WOMAN'S DRESSING ROOM\n          \n          Hazy and cramped. Everything blends into the color of flesh.\n          No walls are visible; it is all billowy piles of costumes.\n          Brendan pushes in. Kara sits at the mirror, putting on\n          eyeliner.\n          \n                              KARA\n                        (sing song)\n                    Brendan Brendan Brendan!\n          \n                              BRENDAN\n                    Where's Dode flopped?\n                        (she makes a face)\n                    I know you two are cozed up, so you'll\n                    tell me or you won't.\n          \n                              KARA\n                    Oooh, getting feisty.\n                        (giggles)\n                    Last time we talked you were giving\n                    ultimate-tims.\n          \n                                                               60\n          \n          \n                              BRENDAN\n                    It worked. You went to Laura, didn't\n                    you? Told her my tale.\n          \n                              KARA\n                    All part of your plan?\n          \n                              BRENDAN\n                    Turned out to be.\n          \n                              KARA\n                    I feel so cheap and used.\n          \n                              BRENDAN\n                    Gol, I must seem a real cad. Sometimes I\n                    just hate myself.\n          \n          Kara grins dreamily.\n          \n                              KARA\n                    Whatever happened to us, Brendan?\n          \n                              BRENDAN\n                    Where's Dode flopped?\n          \n          She turns to face him.\n          \n                              KARA\n                    We were a pair and a half for a few\n                    months, weren't we? Sometimes I miss\n                    having someone I can talk to. You ever\n                    miss having someone? I guess you must.\n          \n          Brendan's face is a mask.\n          \n                              BRENDAN\n                    I need to hear Dode's tale about Emily.\n                    It's important.\n          \n                              KARA\n                        (darkly)\n                    You better be sure you wanna know\n                    whatcha wanna know.\n          \n          Brendan stands, coughing.\n          \n                              BRENDAN\n                    Uh huh. Laura's working with me now, and\n                    I'll have the Pin and Tug in my corner\n                    soon. The sooner I get the truth from\n                    Dode or the truth about Dode from you,\n                    the safer you'll both be. No? Pass it on\n                    to Dode anyway. Maybe he'll have the\n          \n                                                                        61\n          \n          \n                    sense to get out from under you before\n                    he gets hurt.\n          \n                              KARA\n                    You didn't, did you?\n          \n          Brendan leaves without looking back.\n          \n          INT. BRENDAN'S ROOM - NIGHT\n          \n          Brendan's at his desk, on the phone.\n          \n                              THE BRAIN\n                        (on the phone)\n                    So what happens now?\n          \n                              BRENDAN\n                    Now we wait for the Pin's answer. Unless\n                    his crew spotted VP Truman's social call\n                    this morning, it'll be yes. I'd give us\n                    70/30. If we're in I get under his skin\n                    and see what's what. You stick to Kara,\n                    keep your specs peeled for Dode and stay\n                    away from Laura.\n          \n          The Brain is quiet for a beat.\n          \n                              THE BRAIN\n                    I think she's with us, Brendan.\n          \n                              BRENDAN\n                        (too sharp)\n                    I'll let you know when she is.\n          \n          A beat of silence.\n          \n                               THE BRAIN\n                    Okay.\n          \n          Brendan gently replaces the receiver and sits for a moment\n          in silence.\n          \n          EXT. LOCKER CAGE - MORNING\n          \n          The class bell rings, and the cage quickly empties. Brendan\n          limps in, opens his locker. A note falls to his feet. It is\n          folded into a star. He pulls it open. \"TWELVE THIRTY PICO &\n          ALEXANDER\".\n          He fishes the old note out and compares them - different\n          handwriting.\n          \n                                                                         62\n          \n          \n          The locker cage is now empty and silent, except for the\n          steady sound of heavy footfalls. Brendan looks up from the\n          notes.\n          \n          A lug with a lumpish face is coming towards him. He wears a\n          black trenchcoat over bulbous shoulders, and his black hair\n          comes down over his eyes like a sheepdog's.\n          \n                              BRENDAN\n                    You the Pin's?\n          \n          No answer. The lug keeps coming.\n          \n                              BRENDAN (cont'd)\n                    So what's his answer?\n          \n          Closer, not slowing. Brendan tightens his hand into a fist.\n          Then CLICK! and a long slender switchblade gleams in the\n          lug's right paw.\n          \n          Brendan jumps back as the lug swipes the blade at his torso.\n          Before the lug winds up for another slash Brendan is\n          running.\n          \n          EXT. CAMPUS SQUARE - DAY\n          \n          Brendan runs through the empty campus square, the lug\n          follows.\n          \n          EXT. SCHOOL HALLWAY - DAY\n          \n          Wind rushing, sweating, the lug very close. Their footsteps\n          clatter on the cement. Brendan swings around a corner,\n          doubles back and stops with his back to a wall - he's lost\n          sight of him.\n          \n          Brendan sweats, listening. The lug's footsteps echo through\n          the hallways, coming from all directions at once. Then it\n          seems clear - he's down the hall on Brendan's right.\n          Brendan dashes left. Wrong. The lug looms over him, his\n          knife hand flashing. Brendan's jacket shoulder tears open,\n          and the white filling inside turns red. He stumbles back\n          blindly, gets his footing and scrambles out of reach.\n          \n          Brendan sprints away, down the hall, gaining about thirty\n          feet on the lug before turning the corner.\n          \n          Brendan drops to a sitting position.\n          \n          THE LUG AROUND THE CORNER\n          \n          Running fast.\n          \n                                                                         63\n          \n          \n          BRENDAN\n          \n          Kicks his shoes off and clambers to his feet. The lug's\n          footsteps are impossibly loud.\n          \n          THE LUG\n          \n          Just about to round the corner.\n          \n          BRENDAN\n          \n          On his socked feet running silently back towards the corner.\n          The lug's footsteps crash like symbols as they both come\n          around the same corner in opposite directions at full speed.\n          \n          Brendan slides like a baseball player, tangling his legs\n          into the lug's. The lug pitches forward with frightening\n          momentum. He hits the hall's metal handrail with his arms\n          and head. A hollow gong reverberates through the hallway,\n          and the lug falls like a puppet with his strings cut.\n          A wallet with a couple of twenties and a student ID (CHUCK\n          BURNS), three hash pipes, fifteen joints, a baggie of weed\n          and a large brownie in another baggie.\n          \n          Brendan leaves it all on him and staggers off.\n          \n          EXT. CAMPUS PAYPHONE - DAY\n          \n          Brendan breathes heavily into the phone.\n          \n                              BRENDAN\n                    Chuck Burns, big lug with hair like a\n                    sheepdog.\n          \n                              THE BRAIN\n                        (on the phone)\n                    Yeah I know him, I just can't pin him to\n                    any crowd. He's definitely not muscle\n                    for anyone. He taps the Carrows crowd\n                    but doesn't hang with them. If you've\n                    got a guess I could check it out-\n          \n                               BRENDAN\n                    The Pin. If he's with the Pin\n                    everything's kablooie and I gotta blow\n                    the burgh.\n          \n                              THE BRAIN\n                    I'll check it. I'm in third now-\n          Brendan spots the Pin's Cady pulling into the parking lot.\n          \n                                                                         64\n          \n          \n                              BRENDAN\n                    Never mind. If I don't call by three\n                    call in the bulls.\n          \n          Brendan hangs up and begins walking at a normal pace along\n          the sidewalk.\n          \n          The cady pulls up beside him, and he stops walking. The door\n          swings open and a voice comes from inside.\n          \n                               VOICE\n                    Get in.\n          \n          With no perceivable hesitation, he does.\n          \n          INT. CADILAC - DAY\n          \n          Brendan sits beside the Pin. The windows are tinted and the\n          car is very dark. The seats are pink vinyl. The car lurches\n          forward.\n          Brendan and the Pin are silent for a beat, not looking at\n          each other.\n          \n                               BRENDAN\n                    So?\n          \n                              PIN\n                    So. Tangles.\n          \n          A stocky kid in the front seat turns, and reaches into his\n          jacket. For a moment he stays like that, hand in his jacket,\n          eyes on Brendan. Brendan's face is placid.\n          \n          Tangles pulls out an envelope and drops it in Brendan's lap.\n          \n                              PIN (cont'd)\n                    That's what you'll get every week for\n                    your services. Less of course there's a\n                    specific job involved, in where you get\n                    sliced in with my crew. Square?\n          \n                               BRENDAN\n                    Yeah.\n          \n          Silence. The Pin holds his hat in his hands, fingering the\n          rim.\n          \n                              PIN\n                    We're doing a thing down at the Hole\n                    tonight. Know it?\n          \n                                                                                                65\n          \n          \n                                    BRENDAN\n                          South of T Street, yeah.\n          \n                                    PIN\n                          It's sort of a welcome you in thing.\n                          Eight o'clock.\n          \n              The car stops.\n          \n              EXT. CAMPUS PAYPHONE - DAY\n          \n              Brendan climbs out of the car on the exact spot they picked\n              him up. The Cady drives off. Brendan checks his watch.\n          \n              BRENDAN'S WATCH\n          \n              12:32. A phone begins to ring.\n          \n              EXT. PICO & ALEXANDER - DAY\n          \n              Brendan looks up from his watch and answers the payphone,\n              holding the receiver to his ear in silence.\n          \n                                    VOICE\n                              (on the phone)\n                          I know what you did. I saw what you\n                          did.1\n          \n              The voice is low and garbled, filtered through something.\n          \n                                        BRENDAN\n                          So?\n          \n                                    VOICE\n                          Anyone I tell, it would ruin you some\n                          way. And I'm going to tell someone.\n          \n                                    BRENDAN\n                          Are you making an offer?\n          \n                                    VOICE\n                          Maybe. Or maybe I'll just do you in.\n          \n                                    BRENDAN\n                          Hire another hash head to blade me?\n          \n          \n          \n          \n          1\n           Originally the source of this call was supposed to be a mystery, but during post\n          production we decided it was one layer too many, and identified the caller as Dode.\n          Brendan's first line was overdubbed in post to say `Dode?\" instead of \"So?\"\n          \n                                                                        66\n          \n          \n                              VOICE\n                    Don't need no blades, shamus. I just\n                    gotta squawk.\n          \n                              BRENDAN\n                    What do you want?\n          \n                              VOICE\n                    Just to see you sweat.\n          \n          CLICK. Brendan replaces the receiver and stands still for a\n          moment. Then he inserts a coin and dials.\n          \n                              THE BRAIN\n                        (on the phone)\n                    Brendan?\n          \n                              BRENDAN\n                    Yeah.\n          \n                              THE BRAIN\n                    You alright?\n          \n                              BRENDAN\n                    Yeah, I'm fine. Keep digging on the\n                    Burns lug, but the main thing is to find\n                    Dode. He set up whatever Emily walked\n                    into, it's getting more and more urgent\n                    we talk.\n          \n                              THE BRAIN\n                    Alright. Trueman was looking for you.\n          \n                              BRENDAN\n                    Trueman and the VP?\n          \n                              THE BRAIN\n                    No, just Trueman.\n          \n                              BRENDAN\n                    Asked for me?\n          \n                              THE BRAIN\n                    No, but looked.\n          \n                              BRENDAN\n                    That's not good. Alright, keep me\n                    posted.\n          \n          Brendan hangs up.\n          \n                                                                                                 67\n          \n          \n              EXT. BEACH - NIGHT1\n          \n              A bonfire burns about a hundred feet off. Figures jump\n              through the blaze to thrash music. The Pin and Brendan\n              wander towards us on the dark beach.\n          \n                                     PIN\n                           So I'm going to start you on the dope\n                           circles, cleaning up the Turkish dues,\n                           pulling in the strags.\n          \n                                     BRENDAN\n                           Small fries.\n          \n                                     PIN\n                           Yeah, well. Just to see how you handle.\n                           Anyway there isn't much else doing. I'm\n                           tailing out this big deal, but that's\n                           almost done.\n          \n                                     BRENDAN\n                           Oh yeah? What was it?\n          \n                                     PIN\n                           Big time. Biggest I ever done, and there\n                           was a snag in it, but it's almost done\n                           now.\n          \n                                     BRENDAN\n                           What was it?\n          \n                                         PIN\n                           It's over.\n          \n                                     BRENDAN\n                           Almost, you said.\n          \n                                     PIN\n                           It's over enough. You're gonna make me\n                           curious, being so curious.\n          \n              They sit in the sand, facing the breakers.\n          \n                                     PIN (cont'd)\n                           I gotta lay something out. You're coming\n                           into a certain situation, and I'm\n                           bringing you in sort of because of it.\n          \n          1\n            If ever you want to witness a look of pure horror, shoot a micro budget feature film and\n          tell your cinematographer that there will be an extended scene on a beach at night.\n          Turns out it's difficult to light up a beach without very large and expensive equipment.\n          Who knew. Shooting at sunset proved a fortunate and less horror inducing solution.\n          \n                                                                 68\n          \n          \n                          (beat)\n                      I didn't tell Tugger to hit you for the\n                      Brad Bramish thing. Laura and I, I\n                      decided I oughta hear what you were\n                      gunning for before I made an enemy. Tug\n                      just did it, though. He was hot, and he\n                      just hit you. He's been doing that.\n          \n                                 BRENDAN\n                      Yeah?\n          \n                                PIN\n                      He's got my best interests, I know, he's\n                      loyal, he just gets hot.\n          \n                                BRENDAN\n                      Muscle you can't control's no good at\n                      that.\n          \n                                PIN\n                      You're working for me, not Tug, that's\n                      all.\n          \n                                 BRENDAN\n                      Alright.\n          \n          \n          A moment of silence. The breakers crash.\n          \n                                PIN\n                      Things can get, you know, it's tough\n                      sometimes. Twisted, complicated,\n                      watching all the, I don't know.\n                      Everyone's got their thing.\n                          (silence)\n                      You read Tolkien?\n          \n                                 BRENDAN\n                      What?\n          \n                                PIN\n                      Tolkien, the Hobbit books?\n          \n                                 BRENDAN\n                      Yeah.\n          \n                                PIN\n                      His descriptions of things are really\n                      good.\n          \n                                 BRENDAN\n                      Oh yeah?\n          \n                                                                        69\n          \n          \n          \n          \n                              PIN\n                    He makes you want to be there.\n          \n          The waves crash. Behind them, with no warning at all, a\n          train shoots by. Tug stands with his hands jammed in his\n          pockets, flashing lights and gleaming metal streaking and\n          squealing behind him.\n          \n          INT. BRENDAN'S ROOM - EARLY MORNING\n          \n          The clock radio blinks 5:34. The phone is ringing. Brendan\n          half wakes and puts it to his ear.\n          \n                              THE BRAIN\n                        (on the phone)\n                    Don't go to class.\n          \n                              BRENDAN\n                    What?\n          \n                              THE BRAIN\n                    Fifth period Trueman and the VP come in\n                    asking for you.\n          \n                              BRENDAN\n                    Agh.\n          \n                              THE BRAIN\n                    Did they call your mom?\n          \n                              BRENDAN\n                    Probably. I got home late.\n          \n                              THE BRAIN\n                    Get out of there too, then. Meet me\n                    behind the library. I've got some stuff.\n          \n          EXT. BACK OF LIBRARY - EARLY MORNING\n          A cold gray morning. The Brain hands Brendan a photocopy of\n          a newspaper clipping, \"LOCAL YOUTH HOSPITALIZED\"\n          \n                              THE BRAIN\n                    Frisco Farr was found on a sidewalk\n                    outside Pinkerton's Deli three weeks\n                    ago. He was in a coma, his stomach\n                    contained a sausage sandwich, a horse\n                    dose of Heroin and traces of Choleric\n                    Tricemate, a poisonous chemical found in\n                    laundry detergent. Frisco's still under\n          \n                                                                        70\n          \n          \n                    and nobody's talking, so nothing's come\n                    of it.\n          \n                              BRENDAN\n                    OD?\n          \n                              THE BRAIN\n                    No, the chem the junk must have been cut\n                    with put him down.\n          \n                              BRENDAN\n                    Huh. Bad junk. Bad brick... could that\n                    form of Heroin be called 'Brick'?\n          \n                              THE BRAIN\n                    No -- it was a concentrated powder, its\n                    street handle's 'whip' or 'rock' or\n                    'brock'.\n                        (fishes a note from his\n                         pocket)\n                    Here. From Laura.\n          \n                              BRENDAN\n                    I told you to stay clear of Laura.\n          \n                              THE BRAIN\n                    You tell her to stay clear of me?\n          \n          He gives the note to Brendan, who unfolds it roughly.\n          \n                              BRENDAN\n                        (mutters)\n                    I gotta get voicemail.\n          \n          The note reads \"Meet me at the southeast corner of the\n          school at 9:30.\" Brendan crumples it into a ball.\n          \n                              BRENDAN (cont'd)\n                    No. Tell her I'll be at the Pin's at\n                    one. Any luck with the lug?\n          \n                              THE BRAIN\n                    No.\n          \n          The Brain lays out a local newspaper with Emily's picture -\n          \"LOCAL GIRL MISSING\". Uncomfortable silence.\n          \n                              BRENDAN\n                    This isn't good.\n          \n          The Brain looks hard at him. Brendan stares off into space\n          for a beat, then takes the Brain's cell phone and dials.\n          \n                                                                        71\n          \n          \n                              BRENDAN (cont'd)\n                        (into phone)\n                    Mr. Trueman please.\n          \n          Brendan compares the two notes from his pocket with Laura's\n          - distinct handwriting on each.\n          \n                              TRUEMAN\n                        (on the phone)\n                    This is Trueman.\n          \n                              BRENDAN\n                    What the hell are you doing asking for\n                    me in class?\n          \n                              TRUEMAN\n                    What the hell are you doing out of\n                    class?\n          \n                              BRENDAN\n                    What?\n          \n                              TRUEMAN\n                        (very deliberate)\n                    The VP and I needed to ask you a few\n                    questions about Emily Kostich, who you\n                    might have heard is missing. It's a very\n                    serious thing. The police are involved.\n                    The VP and I knew you two were close, so\n                    the VP and I came to ask you questions,\n                    but you were truant. If you don't have a\n                    valid excuse-\n          \n          Brendan hangs up.\n          \n                              THE BRAIN\n                    What?\n          \n                              BRENDAN\n                    I've been cut loose. I'm not safe here.\n                    We shouldn't have met in the open.\n                    Alright, lay low, but ask on the\n                    underneath for Dode. That's all that\n                    matters now, find Dode, but do it on the\n                    underneath, got it?\n          \n                              THE BRAIN\n                    What are you going to do?\n          \n                              BRENDAN\n                    I'd like to have played it safe, but\n                    there's no time. The Pin's not letting\n          \n                                                                         72\n          \n          \n                    anything drop, so I gotta push things a\n                    bit.\n          \n                                THE BRAIN\n                    How?\n          \n                              BRENDAN\n                    I don't know. Just find Dode.\n          \n          EXT. THE PIN'S HOUSE - DAY\n          \n          The bird of prey mailbox looms ominously. Brendan knocks on\n          the front door. No answer. He presses lightly on the screen\n          door, and it gives.\n          \n          INT. KITCHEN - SAME\n          \n          Empty. Brendan crosses the warped linoleum and gently opens\n          the narrow basement door. He descends into inky gloom.\n          \n          INT. BASEMENT HALLWAY - SAME\n          Deathly still and silent. Barely breathing, Brendan goes to\n          the lit doorway at the end of the hall.\n          \n          INT. PIN'S DEN - SAME\n          \n          Empty. Brendan floats through the room like a ghost, to the\n          Pin's desk.\n          \n          Slowly, then with greater confidence he rifles through it -\n          papers and trinkets, meaningless.\n          \n          He reaches beneath the desk, knocking it gently with his\n          knuckles. Quickly he removes the top drawer and reaches down\n          into the desk frame.\n          \n          Brendan draws out a stack of hundred dollar bills two inches\n          thick. He pulls out another. Another. Another. Thumbing the\n          stacks -- pure hundreds.\n          \n          Something creaks in the hallway.\n          \n          Brendan freezes. Silently he replaces the money and drawer,\n          his eyes on the doorway. He creeps towards the door on the\n          balls of his feet.\n          \n          INT. BASEMENT HALLWAY - SAME\n          \n          Still empty. Brendan creeps towards the stairs, passing\n          other doorways, all open but for one. He stops for a moment,\n          listening - silence.\n          \n                                                                         73\n          \n          \n          INT. STORAGE ROOM - SAME\n          \n          Brendan enters the room - pitch black but for a small high\n          window. Brendan pulls the curtains aside. A beam of sunlight\n          spills just enough light to reveal a figure in the dark.\n          Brendan jumps back, and his reflection in the large mirror\n          jumps as well.\n          \n          A white bird nesting in the window flutters into the dark\n          room.\n          \n          Brendan walks the large mirror into the beam of light,\n          reflecting it around the room like a flashlight. More junk,\n          a mattress, then a strangely bare corner with a single white\n          lump in it. The white bird stands behind the lump, its dark\n          eyes caught in the bare light.\n          \n          The bird flies out the window.\n          \n          Brendan goes to the white lump, a small brick of white\n          powder. White chalky residue patterns the floor -- there\n          were other bricks there before.\n          \n          Behind Brendan, in the mirror, something moves. Someone\n          else, in the room.\n          \n          Tugger. He throws Brendan across the room, then heaves him\n          into a wall.\n          \n                              TUGGER\n                    What with the poking, genius?! Maybe\n                    you're poking for your bull friends!\n          \n                              BRENDAN\n                    Don't be a sap. I can't even face up at\n                    school, the VP's so hot for me.\n          \n                              TUGGER\n                    Yeah well. Maybe you're looking to make\n                    good.\n          \n                              BRENDAN\n                    I'm looking to find this big game the\n                    Pin's played, not to gum it, but just so\n                    when its tail jams in my back I'll know\n                    who to bill for the embalming.\n          \n                              TUGGER\n                    You oughta ask him what you wanna know.\n          \n                              BRENDAN\n                    I did. He didn't tell me.\n          \n                                                                 74\n          \n          \n          Tug loosens his grip. Brendan gasps for air.\n          \n                              BRENDAN (cont'd)\n                    When a gee I'm paid to side with won't\n                    give me the straight that makes me\n                    nervous. Makes me angry.\n          \n          Tug draws back a bit.\n          \n                              TUGGER\n                    Yeah, well. That's understandable.\n          \n          INT. KITCHEN - DAY\n          \n          Tug sets a country glass of orange juice in front of\n          Brendan. He paces.\n          \n                              TUGGER\n                    There was ten of them. I don't know\n                    where he picked them, he didn't tell me.\n                                 BRENDAN\n                           (sympathetic)\n                    Huh.\n          \n                              TUGGER\n                    So we get ten kils of brock, there aint\n                    enough marks in the whole burgh to eat\n                    that. So he unloads eight of em up way\n                    north, even up to the docks. I don't\n                    know who.\n          \n                              BRENDAN\n                    Didn't tell you.\n          \n                              TUGGER\n                    Yeah. That was eight. So that's the\n                    tenth in there. We gotta break it into\n                    doses, sell em off round the high, maybe\n                    some by Shorecliffs.\n          \n                              BRENDAN\n                    What about the ninth brick?\n          \n                              TUGGER\n                    Ah yeah. There were problems with that.\n          \n                                BRENDAN\n                    Yeah?\n          \n                                TUGGER\n                    It, uh...\n          \n                                                                  75\n          \n          \n          He stops, thinking harder than he's used to. His scar\n          reddens slightly, then he jerks out of his trance.\n          \n                              TUGGER (cont'd)\n                        (quickly)\n                    It disappeared. Someone skimmed it. We\n                    started raising hell with all the likely\n                    suspects, and whatayaknow, it came back.\n                    But it came back bad. One of ours took a\n                    dose off the top, and it laid him out.\n          \n                                 BRENDAN\n                    Frisco.\n          \n                              TUGGER\n                    Yeah, poor Frisco. You heard about that.\n                    We'll track down the rat. Just takes\n                    time.\n          \n                              BRENDAN\n                    I heard something fell with Emily\n                    Kostich.\n          \n                                 TUGGER\n                    Emily who?\n          \n                                 BRENDAN\n                    Kostich.\n          \n                              TUGGER\n                    Don't know her.\n          \n                                 BRENDAN\n                    Huh.\n          \n          A quiet pause. Tug's scar reddens a bit more.\n          \n                              TUGGER\n                    Has the Pin talked about her?\n                                 BRENDAN\n                    Not to me.\n          \n                              TUGGER\n                    Yeah, he might know something. Ask him.\n                    Tell me what he says, cause if you heard\n                    something, you know, I wanna check.\n          \n                                 BRENDAN\n                    Sure.\n          The screen door swings open -- enter the Pin. If he's\n          surprised he doesn't show it.\n          \n                                                                     76\n          \n          \n                              PIN\n                    Pow wowing?\n          \n                              BRENDAN\n                    Just shooting the shat.\n          \n                              TUGGER\n                    Yeah, just shooting it.\n          \n                              PIN\n                    Good.\n          \n          His big foot clunks on the linoleum. He eyes a very sick\n          looking Brendan.\n          \n                              PIN (cont'd)\n                    You alright, soldier?\n          \n          Brendan moves a hand dismissively, sniffling.\n          \n                              PIN (cont'd)\n                    So, Tug, I got a call. Someone who says\n                    they know something about Emily.\n          \n                              TUGGER\n                    Emily?\n          \n                              PIN\n                    Emily Kostich. Where she's at now. Says\n                    we'd want to know. Wants to meet.\n          \n                              TUGGER\n                        (uncomfortable)\n                    Yeah?\n          \n                              PIN\n                    So we'll meet him. Four o'clock.\n                        (to Brendan)\n                    Emily was Tug's girl for awhile. You\n                    know Emily, didn't you?\n                              BRENDAN\n                    A while back.\n          \n                              PIN\n                    You've heard she's missing?\n          \n                              BRENDAN\n                    Yeah, I heard that.\n          \n                              PIN\n                    So maybe you want to come along too.\n          \n                                                                       77\n          \n          \n                              BRENDAN\n                    What has Emily got to do with you?\n          \n                              PIN\n                        (looks at Tugger)\n                    Show, maybe we'll find out.\n          \n          He gives a slip of paper to Tugger.\n          \n                              PIN (cont'd)\n                    Four o'clock.\n          \n          Tugger glances at the slip, then slides it to Brendan. It\n          has the symbol drawn in pencil:\n          \n          \n          \n          \n          A horn honks outside.\n          \n                              BRENDAN\n                    That's my ride.\n          \n          The Pin calls after him as he leaves.\n          \n                              PIN\n                    Four o'clock.\n          \n          EXT. FRONT OF PIN'S HOUSE - SAME\n          \n          Brendan falls into Laura's idling car.\n          \n                              BRENDAN\n                        (roughly)\n                    A payphone, anywhere.\n          \n                              LAURA\n                    What-\n          \n          Brendan throws the car into drive, and they jerk forward.\n          \n          EXT. STREET CORNER - DAY\n          \n                              PAYPHONE\n                    The mobile customer you have called is\n                    away from the phone-\n          \n          Brendan slams the phone down violently and walks back\n          towards the car. His legs quiver, and a coughing fit hits.\n          \n                                                                        78\n          \n          \n          Hacking and spluttering he falls to his knees. Laura's arms\n          wrap around him, except it isn't Laura, it's Emily. Brendan\n          spins backwards into\n          \n          DARKNESS\n          \n          Emily kissing his mouth, her hair around him, but it isn't\n          her hair, it's Laura's. Brendan shoots upwards\n          \n          INT. LAURA'S CAR STATIONARY - DAY\n          \n          and sits up with a jolt. Laid out in the back seat, Laura\n          dabbing his head with a wet napkin.\n          \n                               BRENDAN\n                         (barks shakily)\n                     What time is it?\n          \n                               LAURA\n                     Lie down, Brendan-\n                                  BRENDAN\n                     What time-\n          \n                               LAURA\n                     You've got a fever, you've got to go to\n                     the hospital or-\n          \n                               BRENDAN\n                     What time is it?\n          \n                               LAURA\n                     Three forty. You've got to rest, you're\n                     feverish.\n          \n          He throws himself out of the car.\n          \n          EXT. SCHOOL PARKING LOT - SAME\n          \n          Brendan falls to his knees, coughing. Laura follows.\n          \n                               LAURA\n                     Get back in the car, I'm taking you\n                     home, you're sick, you need-\n          \n                               BRENDAN\n                     Shut up! Shut up! Shut up!\n          \n          He keeps yelling that until she does. His head spins.\n                               BRENDAN (cont'd)\n                     Okay, you've got to, what you've got to\n                     do is drive around to the Carrows lot.\n          \n                                                                         79\n          \n          \n                    I'll be up on the, the blacktop, the\n                    basketball field. So you've got to go by\n                    you or me to get down there. If you see\n                    anyone but the Pin or Tugger or their\n                    crew go down into the ravine, honk four\n                    times, long short long short. But don't\n                    be seen.\n          \n                              LAURA\n                    Get back in the car.\n          \n                              BRENDAN\n                    Do it! Will you do it? I need you to do\n                    this. I need you, here. Please.\n          \n          He holds her shoulders. A beat, then her face registers\n          resignation.\n          \n          EXT. BASKETBALL FIELD - DAY\n          \n          A flat plane of pebbly asphalt with a dozen basketball\n          courts faintly outlined across its surface. Brendan stands\n          crooked, watching the barren horizon. The wind blows\n          bitterly, and the sky is dark.\n          \n          Then, a speck. Coming towards Brendan, across the field.\n          Brendan slumps towards it. Closer. Still a dark dot. Closer.\n          \n          Brendan's face snaps into recognition.\n          \n                              BRENDAN\n                    What are you doing, Dode?\n          \n          Dode grins. He holds a newspaper.\n          \n                              DODE\n                    You gonna stop me?\n          \n                              BRENDAN\n                    What do you think you're doing, Dode?\n                              DODE\n                    I saw you. I saw what you did.\n          \n                              BRENDAN\n                    What'd you see?\n          \n                                 DODE\n                    I saw you.\n          \n                              BRENDAN\n                    What'd you see me?\n          \n                                                                     80\n          \n          \n                              DODE\n                    You were with her, dead, and you took\n                    the body.\n          \n                              BRENDAN\n                    Yeah, I did. That's all you saw? What\n                    about before?\n          \n                              DODE\n                    Before what?\n          \n                              BRENDAN\n                    Did you see who killed her before I got\n                    there?\n          \n                              DODE\n                        (face ashen)\n                    You killed her.\n          \n                              BRENDAN\n                    I found the body, Dode.\n          \n                              DODE\n                    You, I thought you didn't, but we\n                    figured out, I got the news on ya, cause\n                    you hid the body, why wouldn't-\n          \n                              BRENDAN\n                    Who's 'we'?\n          \n                              DODE\n                    Shut up! You're always talking, always\n                    this and that smartso, you're gonna shut\n                    up now!\n          \n                              BRENDAN\n                    I didn't kill her, Dode.\n          \n                              DODE\n                    You're not going to talk this!\n          \n                              BRENDAN\n                    Dode, I know you're thinking of Em, I\n                    know you tried to help her-\n          \n                              DODE\n                    Shut up! You're gonna shut your\n          \n          Brendan staggers, the world blurs out for a moment, then\n          snaps back.\n                              DODE (cont'd)\n                    put it over real nice-\n          \n                                                                        81\n          \n          \n          \n          \n                              BRENDAN\n                    -so I'm telling you now you're in over\n                    your head, you don't want to put your\n                    hand in this-\n          \n          Dode shakes the newspaper at him.\n          \n                              DODE\n                    Shut up! She's dead, you-\n          \n                              BRENDAN\n                    Why was she scared, Dode? She came to\n                    me, who was she scared of? I think I\n                    know why, I just gotta know who!\n          \n          Dode throws the paper, which scatters in the wind.\n                              DODE\n                    You're trying to confuse me.\n          \n                              BRENDAN\n                    Dode.\n          \n                              DODE\n                    You couldn't stand it. Your little Em.\n                    She was gonna keep it, it was mine, and\n                    you couldn't stand that.\n          \n                              BRENDAN\n                    What was yours?\n          \n                              DODE\n                    I had you pegged.\n          \n                              BRENDAN\n                    What was yours?\n                              DODE\n                    I loved her. And I woulda loved the kid.\n                    I'm gonna bury you.\n          \n          Brendan's face is empty. Dode walks stiffly away. Brendan\n          puts a hand on his shoulder, but shrinks back in a coughing\n          spasm. Dode grabs Brendan's wrist and hits him in the face.\n          Brendan hits the pavement.\n          \n                                                                         82\n          \n          \n          EXT. HEAVEN - DAY\n          \n          Bright clouds, sharp light. Emily flies towards us, glowing,\n          then dimmer, her wings splutter out, the clouds turn gray,\n          and we are looking at Emily's picture in the newspaper\n          article.\n          \n          EXT. BASKETBALL FIELD - DAY\n          \n          Brendan pulls the newspaper off his face, lying in a fetal\n          position. Dode is nowhere to be seen.\n          \n          Slowly, painfully, Brendan hoists himself up. He coughs and\n          splutters, barely able to keep his footing.\n          \n          He limps across the field. Every step is agony. The wind\n          blows against him. The black field seems impossibly long,\n          still he keeps limping forward, towards the ravine.\n          \n          EXT. RUNOFF TUNNEL - DAY\n          Brendan slides down the embankment, landing on his feet.\n          \n          Gathered around the drain tunnel entrance are Tugger, the\n          Pin, five of Tugger's flunkies and Dode in the middle.\n          Everyone looks at Brendan.\n          \n          A long silence. Brendan clears his throat.\n          \n                              BRENDAN\n                    What'd I miss?\n          \n          More silence.\n          \n                              PIN\n                    Dode here says Emily Kostich is dead.\n          \n          Nobody reacts to that. Brendan's face is placid.\n          \n                               BRENDAN\n                    Oh yeah?\n          \n                              PIN\n                    Yeah. He says he knows who did it. He\n                    says he knows where the body's at.\n                        (beat of silence)\n                    And he says he wants more money than I\n                    think the information's worth.\n                              BRENDAN\n                    That so, Dode?\n                        (to the Pin)\n          \n                                                                        83\n          \n          \n                    So walk. What's the info have to do with\n                    you anyways?\n          \n                              DODE\n                    Plenty.\n          \n                              PIN\n                    Plenty, he says.\n          \n                              BRENDAN\n                    Uh huh. And he wants cash on the nail.\n                    He's a pot skulled reef worm with more\n                    hop in his head than blood. Why pay for\n                    dirt you can't believe?\n          \n                              DODE\n                    You'll believe this.\n          \n                              BRENDAN\n                        (shrugs)\n                    Maybe you will.\n          \n                              DODE\n                    You'll believe it, cause it's someone\n                    close to you. Real close.\n          \n          The Pin looks up at Brendan, whose face is loose and\n          nonchalant.\n          \n                              BRENDAN\n                    Maybe it's hot, but it's Dode, you can't\n                    trust it.\n          \n                              DODE\n                    Real close.\n          \n          Tugger's eyes are locked on Dode, his scar the color of raw\n          liver. Brendan laughs and turns away.\n          \n                              BRENDAN\n                    I'm getting my shoes wet for this. Let\n                    him milk you if you want.\n          \n                              PIN\n                        (to Brendan)\n                    Stay.\n                        (to Dode)\n                    It's still too much.\n          \n                              DODE\n                    No it's not. You won't complain when you\n                    hear it.\n          \n                                                                          84\n          \n          \n          Tugger twists a stick in his hands. Brendan watches him,\n          curious.\n          \n                              BRENDAN\n                        (murmurs)\n                    So maybe you should.\n          \n                              DODE\n                    You had her against the wall with the\n                    brick -\n          \n                              PIN\n                    I know my business. It's still too much.\n          \n                              DODE\n                        (with growing confidence)\n                    It's not, cause that's not why she was\n                    killed, and it's real important to you,\n                    cause the person who killed her's real\n                    close, and cause he's got a lot to lose,\n                    and he knows if I don't bury him by\n                    spilling to you I spill to the bulls and\n                    bury him for real, and he's really\n                    really scared - she had a kid in her and\n                    he couldn't stand -\n          \n          Tugger springs like a cat.     He grabs Dode's hair and knees\n          his face.\n          \n          Brendan stumbles towards them.\n          \n                              BRENDAN\n                    Tug, it's alright!\n          \n          Tug has Dode on the ground, kicking his stomach and chest.\n          \n                                 PIN\n                    Tug, stop.\n          \n          Tug backs off. Dode raises his head.\n          \n          Tug pulls the gun from his jacket.\n          \n          Brendan yells, slips and falls into the shallow water.\n          \n          Tug levels the gun at Dode's head and fires one shot. The\n          back of Dode's skull comes off.\n          \n          The rapport reverberates through the black tunnel behind\n          them, and birds fly out. Dode remains upright for a moment,\n          then falls limp into the water.\n          \n                                                                          85\n          \n          \n          The Pin's face is stupid, lifeless. Tug turns to him, gun in\n          hand.\n          \n                              PIN (cont'd)\n                        (thickly)\n                    Tug...\n          \n          Tugger fires - dirt kicks up, and the Pin scrambles back.\n          Brendan crawls towards Tug, yelling for him to stop.\n          \n          Tug fires twice more, both misses, and the Pin is away.\n          \n          Distant sirens.\n          \n          Brendan's vision blurs.   He stumbles and falls into the\n          shallow water.\n          \n                                                               FADE OUT\n          \n                                                               FADE IN:\n          A CEILING FAN\n          \n          Spinning gently. Brendan's eyes open, watch it sleepily,\n          then sharpen.\n          \n          INT. TUGGER'S BEDROOM - NIGHT\n          \n          Brendan sits up in the bed. Tugger sits in a chair bedside,\n          smoking. Brendan watches him for a long moment in the room's\n          dim light.\n          \n                              TUGGER\n                    She sprung it on me, just. That's a hell\n                    of a thing to spring on a guy. I don't\n                    remember much. Laura talked me down\n                    after, said whatever, she knew her, said\n                    it wasn't true, but I still think\n                    sometimes. I think bout it being true.\n                    Bout it being mine. And maybe I did it\n                    cause I thought it was true. A hell of a\n                    thing.\n          \n          Brendan stares at him through cold, empty eyes.\n          \n                              TUGGER (cont'd)\n                    You up? You weren't doing too good there\n                    for awhile. Laura said take you, you\n                    know, hospital, but I couldn't.\n          \n                              BRENDAN\n                    What's the stats?\n          \n                                                                        86\n          \n          \n                              TUGGER\n                    Everyone's just laying low. You're here\n                    with us, at my folks place. They're\n                    gone. The bulls got Dode fore the tide\n                    took his body.\n          \n          \n          \n                              BRENDAN\n                    Tide?\n          \n                              TUGGER\n                    Yeah, strong tide, would've taken the\n                    body, like out to sea. It can do that.\n                    But the fuzz got there first.\n          \n          Brendan nods.\n          \n                              TUGGER (cont'd)\n                    So everyone's assuming it's war, but no\n                    one's said it yet. Everyone's lying low.\n          \n                              BRENDAN\n                    War?\n          \n                              TUGGER\n                    You're with us.\n          \n                              BRENDAN\n                    The hell I am.\n          \n          Brendan swings his legs over the bed. Tug steps in front of\n          him, staring him down.\n          \n                              BRENDAN (cont'd)\n                    Alright, I'm with you.\n          \n                              TUGGER\n                    So just lie low. Sleep some more. Laura,\n                    she said you should sleep.\n          Tugger exits. Brendan runs his fingers through his hair,\n          steps into his shoes and hobbles out of the room.\n          \n          INT. TUGGER'S LIVING ROOM - SAME\n          \n          About ten more kids dressed like Tug are cleaning guns.\n          Brendan nods to them.\n                              BRENDAN\n                    Hey.\n          \n                                                                         87\n          \n          \n          They nod back, not paying much attention as he goes out the\n          front door.\n          \n          EXT. STREET - NIGHT\n          \n          On a lamplit street corner Brendan leans against a payphone.\n          \n          \n          \n                              THE BRAIN\n                        (on phone)\n                    Brendan?\n          \n                                BRENDAN\n                    Yeah.\n          \n                              THE BRAIN\n                    Are you - what, man, have you heard\n                    about Dode-\n          \n                              BRENDAN\n                    I was there.\n          \n                                THE BRAIN\n                    You-\n          \n                              BRENDAN\n                    Where were you yesterday? I called.\n          \n                              THE BRAIN\n                    Kasprzyk took my phone, turned it off. I\n                    just now got it back.\n          \n                              BRENDAN\n                    Alright, listen-\n          \n                              THE BRAIN\n                    Are you okay?\n          \n                              BRENDAN\n                    Just listen. Is my name in the papers\n                    with the story?\n          \n                                THE BRAIN\n                    No.\n          \n                              BRENDAN\n                    Alright. Is it just Dode in the papers?\n                              THE BRAIN\n                    Yeah. What do you mean?\n          \n                                                                        88\n          \n          \n                               BRENDAN\n                    Listen, I'm going to be calling you\n                    tonight, probably late. Sleep with your\n                    phone on. Could you get a car if you\n                    needed to?\n          \n                              THE BRAIN\n                    If it's late enough I could take my\n                    mom's-\n          \n                              BRENDAN\n                    Be ready then. I'll call.\n          \n                               THE BRAIN\n                    Alright.\n          \n          INT. DRESSING ROOM - NIGHT\n          \n          Brendan kicks in the door. Kara sits in front of the mirror\n          in a soft pink robe, a boy on the floor beside her. She\n          gasps.\n          \n                              KARA\n                    Brendan. Did you hear about Dode?\n          \n                              BRENDAN\n                    You scheming tramp. You set that poor\n                    kid up, you hid him, fed him your tale.\n                    You got info from Laura and held Dode\n                    like a card till you could play him. For\n                    money!\n          \n          Brendan throws a chair. The boy stands.\n          \n                              KARA\n                    I don't know what you're talking about.\n          \n                               BRENDAN\n                    You'd bury me at the same time, but it\n                    was mostly for the money. You got Dode\n                    thinking Em had his kid, thinking I did\n                    it, and that was enough for him, but he\n                    stuck to the money cause you had your\n                    claws in him, cause he couldn't come\n                    away from the deal without it and make\n                    you happy.\n          \n                              KARA\n                    Sit down, you're a mess. Russ, go get my\n                    shoes from the wardrobe locker, would\n                    you sweetie?\n          \n                                                                              89\n          \n          \n               He goes, trying to look mean at Brendan. Brendan and Kara\n               watch each other like caged rats.\n          \n                                       KARA (cont'd)\n                             Still wish you knew what you wanted to\n                             know? If it's any consolation, it\n                             probably wasn't Dode's kid. It might\n                             have been Tug's, but frankly I wouldn't\n                             bet a horse - it was a crowded field\n                             there at the end.\n          \n               Brendan grabs a clock and throws it. Kara's mirror shatters,\n               revealing a grimy dark wall behind.\n          \n                                       KARA (cont'd)\n                             Meany. You want my tale, Brendan? I\n                             still know what Dode was selling, but\n                             I'd play it smart. A quick call from a\n                             payphone to copland, they drag the\n                             tunnel and you're through.\n          \n               She comes very close to him. Her robe falls open slightly.\n          \n                                       KARA (cont'd)\n                             Five thousand. Cash. I know you can get\n                             it from the Pin, but even if you can't I\n                             want it by first period tomorrow, or I\n                             play my hand and bury you.\n          \n               She turns away, lets her robe fall.1\n          \n                                       KARA (cont'd)\n                             Now get out.\n          \n               Brendan's eyes burn. He lunges at her.\n          \n               EXT. BACKSTAGE - SAME\n          \n               Drama geeks sit in groups. The dressing room door flies open\n               and Kara flies out, stark naked. Brendan flies out after\n               her.\n          \n                                       KARA\n                             What are you doing?\n          \n                                       BRENDAN\n                             Showing your ace.\n          \n               Brendan storms out.\n          \n          \n          \n          1\n              Also on the DVD. Fine retailers everywhere.\n          \n                                                                      90\n          \n          \n          EXT. PIN'S HOUSE - NIGHT\n          \n          Brendan walks past the bird of prey mailbox. A voice from\n          the screen door -\n          \n                               VOICE\n                     Far enough.\n          \n          The Pin.\n          \n                               PIN\n                     Everyone's paying social calls.\n          \n                               BRENDAN\n                     Laura here?\n          \n          Beat of silence.\n          \n                               PIN\n                     So?\n                               BRENDAN\n                     So what are the stats?\n          \n                               PIN\n                     The stats are war, soon as the press\n                     heat dies. And if you're with him,\n                     you're with him.\n          \n                               BRENDAN\n                     Tug got hot. He panicked.\n          \n                               PIN\n                     Tug's been after my digs from the get\n                     go.\n          \n                               BRENDAN\n                     No. He's been anxious cause he thought\n                     if you found out he killed Emily you'd\n                     turn him over.\n                               PIN\n                     He was right.\n          \n                               BRENDAN\n                     Yeah, well.\n          \n                               PIN\n                     I told him to get the straight, no\n                     roughing. I wasn't even there.\n          \n                                                                91\n          \n          \n                              BRENDAN\n                    Alright. So he's a hot head. So you\n                    don't want him on your side, at least\n                    let's have a pow wow fore we start\n                    digging trenches. Maybe we can all walk\n                    away amiable enemies. What would it\n                    take?\n          \n                              PIN\n                    I don't know. We'd have to square\n                    everything between us. He owes me some\n                    money.\n          \n                              BRENDAN\n                    Alright, but we can talk.\n          \n                              PIN\n                    Yeah, alright.\n          \n                              BRENDAN\n                    Four o'clock.\n          \n                                PIN\n                    Tomorrow?\n          \n                              BRENDAN\n                    Tonight. Let's clear it all before it\n                    boils up again.\n          \n                              PIN\n                    Four tonight. You'll be here?\n          \n                                BRENDAN\n                    Yeah.\n          \n          Brendan turns away.\n          \n                                LAURA (OS)\n                    Wait!\n          She comes out of the house with her purse.\n          \n                              LAURA (cont'd)\n                    I'll drive you back.\n          \n          INT. LAURA'S CAR - MOVING - NIGHT\n          \n          Laura drives, Brendan stares at the passing lights.\n                              LAURA\n                    What's going to happen?\n          \n          Brendan coughs.\n          \n                                                                       92\n          \n          \n                              LAURA (cont'd)\n                    Do you feel better?\n          \n                              BRENDAN\n                        (weak)\n                    I don't know.\n          \n          INT. TUGGER'S LIVING ROOM - NIGHT\n          \n          Brendan stumbles in. Tug's hands grab him roughly.\n          \n                              TUGGER\n                    For a smart guy you aint too smart. I\n                    said lay low.\n          \n          Laura enters.\n          \n                              LAURA\n                    Tug.\n          \n          He drops Brendan. Laura kneels beside Brendan, feeling his\n          forehead.\n          \n                              BRENDAN\n                    She was at the Pin's.\n          \n                              TUGGER\n                    Yeah, she's our go-between.\n          \n                              BRENDAN\n                    Uh huh. So here's the sit. You and the\n                    Pin are going to pow wow, four o'clock\n                    tonight, his place. Take all the muscle\n                    you want, you won't need it. He wants to\n                    talk straight, and you're going to work\n                    with him for whatever he needs, cause\n                    you don't want war.\n          \n                              TUGGER\n                    Hell I don't.\n                              BRENDAN\n                    The Pin's sitting on the brick profits -\n                    hitting him now would be post. Make\n                    peace and wait for your chance.\n          \n                              LAURA\n                    He's right, Tug. Smooth it out.\n          \n                                                                         93\n          \n          \n                              BRENDAN\n                        (between coughs)\n                    Besides, he's got you on the Dode thing.\n                    War'll mean you vs. him and every bull\n                    in the burgh.\n          \n          Tugger turns away, thinking.\n          \n                              TUGGER\n                    Yeah, we'll talk.\n          \n                               LAURA\n                        (to Brendan)\n                    You going?\n          \n                              BRENDAN\n                    Yeah.\n          \n          She nods. Brendan stumbles into the bedroom.\n          \n          INT. TUGGER'S BEDROOM - NIGHT\n          \n          Brendan lies on his back. Sweat stands on his forehead.\n          \n          THE FAN\n          \n          Spinning dizzily from Brendan's POV. Then the fan is still\n          and the room is spinning, then the fan, then the room.\n          Brendan clamps his eyes shut. A door creaks open.\n          \n                              BRENDAN\n                        (croaks)\n                    Go away.\n          \n          Laura floats across the room to him. Her hair falls around\n          him. Brendan shrinks back. She puts a pale hand on his\n          clammy forehead. Brendan tries to speak, but cannot.\n          \n          He fingers slide over his face. She pulls off his glasses.\n          \n          Her hands all over his face. Brendan's throat contorts in a\n          hard swallow. His eyes are wet.\n          \n          Her hair, her hands all warm and gentle, touching him.\n          \n                              LAURA\n                    I'm sorry Brendan.\n          \n          Brendan breaks. In silent sobs first, then shivering with an\n          almighty release he cries like a baby in her arms.\n          \n          THE FAN\n          \n                                                                        94\n          \n          \n          Spinning above them.\n          \n          Laura lights a cigarette. They lie beside each other.\n          \n                              LAURA\n                    Don't go tonight.\n          \n                              BRENDAN\n                    I've got to make sure it plays out\n                    smooth.\n          \n                              LAURA\n                    It'll play however it plays without you\n                    there.\n          \n                              BRENDAN\n                    I've got to make sure.\n          \n                                 LAURA\n                    Why?\n                              BRENDAN\n                    Cause if there's war, I'm in it too.\n          \n                              LAURA\n                    Well let's just, I mean why not just run\n                    away. Go somewhere. I've got a car.\n                        (Brendan gives a wry look)\n                    I've got an aunt in New Orleans, she\n                    wouldn't care.\n                        (Brendan grins)\n                    Yeah, it's a stupid thing, but think\n                    about it, why not? What, school? C'mon.\n                    Family?\n          \n                              BRENDAN\n                    Alright, stop.\n          \n          Her smoke drifts into the fan.\n                              LAURA\n                    I wasn't serious, but we could go for\n                    awhile. Just until everything clears.\n          \n          Brendan watches the smoke. She stubs the butt out in an ash\n          tray on the table and curls against his chest.\n          \n          Stretching his arm across the table, he nonchalantly spins\n          the ash tray around with his finger.\n          \n          His glasses lay on the table. Through the left lens the\n          cigarette is magnified. Pale blue arrow on the filter.\n          \n                                                                         95\n          \n          \n          Laura's arm stretches across his chest. He looks at it, then\n          up at the fan, spinning.\n          \n          LATER\n          \n          Brendan slips out of bed. A glowing clock radio reads\n          \"3:16\".\n          \n          INT. TUGGER'S LIVING ROOM - NIGHT\n          \n          A swarm of silent activity. Tug's flunkies prepare various\n          weapons. Brendan goes to Tug.\n          \n                              BRENDAN\n                    Tell your boys no knuckle business.\n          \n                              TUGGER\n                    They're just ready.\n          \n                              BRENDAN\n                    Your folks left a car here?\n                                TUGGER\n                    Yeah.\n          \n                              BRENDAN\n                    Take it and Laura's.\n                        (Brendan tosses Tug the keys)\n                    I'll go first in yours.\n          \n                                TUGGER\n                    The hell-\n          \n                              BRENDAN\n                    I'll take the scenic route to draw off\n                    any tailers. They'll think it's you,\n                    they might even radio back that you're\n                    alone. Get it?\n          \n                              TUGGER\n                    Mr. Smarts.\n          \n          He tosses Brendan his keys.\n          \n                              BRENDAN\n                    Alright. Got a cigarette?\n          \n                              TUGGER\n                    No. I don't smoke.\n                              BRENDAN\n                    I've seen you smoke.\n          \n                                                                         96\n          \n          \n                              TUGGER\n                    I don't smoke cigarettes.\n          \n                              BRENDAN\n                    Give me fifteen minutes, then go.\n          \n          EXT. TUGGER'S HOUSE - NIGHT\n          \n          Brendan slides into the black mustang and gutters off into\n          the night.\n          \n          EXT. STREET - NIGHT\n          \n          Overlooking a twinkling valley of suburban lights. Brendan\n          talks at a payphone beside the curbed mustang.\n          \n                              THE BRAIN\n                        (on phone)\n                    Yeah.\n          \n          \n                              BRENDAN\n                    Alright, I warned you. Can you get the\n                    car?\n          \n                                THE BRAIN\n                    Yeah.\n          \n                              BRENDAN\n                    Go to 2014 Clancy, off Pico west of La\n                    Grange. Park outside and wait. Laura's\n                    inside. She hasn't got a car, but if she\n                    blows on foot or gets a pick, tail her.\n                    Alright?\n                        (silence)\n                    Alright?\n          \n                                THE BRAIN\n                    Okay.\n                              BRENDAN\n                    I'll call you when it gets light.\n                        (silence)\n                    Thanks, Brain.\n          \n          CLICK, Brain hangs up.\n          \n          EXT. FRONT OF PIN'S HOUSE - NIGHT\n          \n          Brendan pulls the mustang into the driveway, limps up to the\n          front door and knocks. One of the Pin's boys lets him in.\n          \n                                                                         97\n          \n          \n          INT. KITCHEN - SAME\n          \n          Crowded with tense looking punks, half dressed like the Pin\n          and half like Tugger. The Pin's mom is shuffling about,\n          pouring them milk.\n          \n          INT. BASEMENT HALLWAY - SAME\n          \n          Several more punks from both camps crowd the hall, and more\n          lean in the darkened doorways. Brendan passes through\n          quickly.\n          \n          INT. PIN'S DEN - SAME\n          \n          The Pin at his desk, flanked by two of his boys. Tug sits in\n          the center of the room, two of his punks beside him. Brendan\n          saunters between them and leans against the dresser.\n          \n                                BRENDAN\n                    Talk.\n                              PIN\n                    I want full assurance that any heat from\n                    Emily and Dode is gonna be on just you.\n                    I don't even want my name pulled in the\n                    shindig. Second, you owe me six Cs, no\n                    rush, but I want your shake that it'll\n                    come home in not too much time.\n          \n          Tug's eyes burn, his scar reddens.\n          \n                              BRENDAN\n                        (to Tug)\n                    That's square. You did them after all.\n                    Lay low it'll blow over. Stick on this,\n                    one of you'll dish it to bury the other\n                    and you'll both get the rap. As to the\n                    six, did you borrow it?\n          \n                                TUGGER\n                    Yeah.\n          \n                              BRENDAN\n                    Then you owe it. Shouldn't need a shake\n                    on that.\n          \n          Tug looks at the Pin.\n          \n                              TUGGER\n                    Alright to both.\n          \n                                                               98\n          \n          \n                              BRENDAN\n                    Good. Let's seal it up and blow for\n                    keeps.\n          \n                              PIN\n                    Third thing. The last brick.\n          \n          Brendan looks up sharply, taken off guard.\n          \n                              BRENDAN\n                    It's yours.\n          \n                              PIN\n                    That aint the point. I'm gonna start\n                    selling it. How do I know it aint bad?\n          \n                              BRENDAN\n                    Why would it be?\n          \n                              PIN\n                    Why was the last one? Cause someone got\n                    greedy. Tug here's had the means to\n                    swipe half and cut it bad for a long\n                    time. Now we're splits my loss of\n                    trust's retroactive.\n          \n                              BRENDAN\n                    Did you, Tug?\n          \n                                TUGGER\n                          (eyes hot on the Pin)\n                    No.\n          \n                              BRENDAN\n                    Alright, so let's shake and blow.\n          \n                              PIN\n                    Not good enough.\n          \n          Tug shoots to his feet, kicking away his chair.\n                              BRENDAN\n                    What would be good enough?\n          \n                              PIN\n                    I wanna see him dose it. Just to prove\n                    it. Then we're square.\n          \n                               TUGGER\n                    Hell for that! I didn't touch your junk,\n                    that's it.\n          \n                                                                         99\n          \n          \n                               PIN\n                     I wanna see it.\n          \n                                TUGGER\n                     To hell!\n          \n                               PIN\n                     Your not wanting to dose it's telling me\n                     something right here.\n          \n                               TUGGER\n                     Yeah, it better be! It's telling that\n                     I'm out from your thumb, that I aint\n                     playing lapdog to no gothed up cripple\n                     no more!\n          \n          Everyone in the room is on their feet.   Brendan steps\n          forward.\n          \n                               BRENDAN\n                     I'll dose it.\n          \n          All eyes to him, unbelieving.\n          \n                                PIN\n                     What?\n          \n                               BRENDAN\n                     If it'll shut you two apes up I'll   take\n                     the dose, and if I don't die we're   all\n                     right as rain, and if I do die you   two\n                     have your war, so long as you keep   it\n                     off my grave. Deal?\n          \n                                PIN\n                     Fine.   Tangles.\n          \n                               BRENDAN\n                     Johnny, go with him.\n          They go.\n          \n          Tug just stares at Brendan, then tosses his hands up\n          slightly and turns away.\n          \n          They all wait.\n          \n          CRASH! from the next room. Everyone freezes. More breaking,\n          then scuffling and shouting.\n          \n          The two punks look at their bosses, then run out. Tug starts\n          to follow, but Brendan holds him back.\n          \n                                                                        100\n          \n          \n          The noise through the wall grows tremendous, a full brawl.\n          The ceiling pounds and shudders with footfalls and bodies\n          hitting the ground.\n          \n          Then, from not too far away, a gunshot.\n          \n          The Pin stands and goes towards the door, but Brendan shouts\n          \n                               BRENDAN (cont'd)\n                    No!\n          \n          and slams it shut. A few tense seconds.\n          \n          Another gunshot. Footfalls, then Tangles falls through the\n          door, his chest red. The Pin bends over him.\n          \n                              TANGLES\n                        (gasping)\n                    The brick, it's gone. The brick's gone.\n          \n          Tangles stops gasping.\n          The Pin stands, eyes blazing at Tug.\n          \n                              PIN\n                    Make peace, huh? Talk it out? Get your\n                    boys in my den soes you could snag it\n                    under my nose?\n          \n          Tug's scar is fiery red. He coils his body, snarling.\n          \n                               TUGGER\n                    Alright!\n          \n                              BRENDAN\n                    No, that's not-\n          \n                              PIN\n                    Was it bad, Tug? Snag it so I don't\n                    know, or sell it off to flat the war\n                    odds?\n          \n                              BRENDAN\n                        (shouts)\n                    Pin, think about it-\n          \n                              TUGGER\n                    Alright, I did all that!\n          Tug blows past Brendan like a train and slams the Pin into\n          the ground with his fist. He punctuates his words with hard\n          straight blows into the Pin's face.\n          \n                                                                          101\n          \n          \n                              TUGGER (cont'd)\n                    I cut the brick, I stole the money, I\n                    faked a peace, I snagged your junk, I\n                    did it all!\n          \n          He pulls the gun.\n          \n          Brendan shouts and throws himself on Tug's arm, wrenching it\n          sideways. The gun clunks onto the carpet.\n          \n          The Pin flips Tug   over and for a moment Brendan is caught\n          between them, hit   and torn, rolling over the gun. Tug grabs\n          it, Brendan grabs   his wrist and the gun goes off, firing\n          into the ceiling.   Plaster sprays.\n          \n          Brendan screams, thrashing wildly, and manages to slip out\n          of his bloodied jacket and out from between the two.\n          \n          The Pin is on top, pinning Tug's gun hand to the carpet,\n          straining to keep it there.\n          \n          Brendan leaps to his feet, staggers, then winds up and kicks\n          Tug in the wrist with all his strength.\n          \n          A terrible crunching popping sound. Tug roars. Brendan takes\n          the gun from his limp hand.\n          \n                                PIN\n                    Do him!\n          \n          Brendan backs off a few steps. The Pin strains to keep Tug\n          down.\n          \n                              PIN (cont'd)\n                    Do him now!\n          \n          Brendan stumbles back. Tug roars, flips the Pin over and\n          beats his face mercilessly.\n          \n          Brendan stumbles out into the hall.\n          INT. BASEMENT HALLWAY - SAME\n          \n          Empty. From the darkened doorways and the thin ceiling\n          relentless sounds of fighting.\n          \n          Brendan walks backwards as if in a trance, eyes glued to the\n          Pin's door. Inside wild shadows splay across the walls, and\n          the Pin shouts Brendan's name.\n          Light flashes from another darkened doorway and the wall\n          beside Brendan splinters. Brendan spins on his heel and\n          fires three shots into the darkness, which falls silent.\n          \n                                                                        102\n          \n          \n          He turns the gun back on the Pin's doorway.\n          \n          With a spray of sparks the doorway turns dark. They broke\n          the lamp.\n          \n          The dark doorway looms up before Brendan, inky black.\n          Horrible sounds come from it, blows, breaking bone, screams.\n          The Pin screams Brendan's name over and over, calling for\n          help. Pleading. Brendan steps back.\n          \n          Time slows down. Brendan drops the gun.\n          \n          It thunks on the carpet.\n          \n          In one motion Brendan kicks the gun down the hall into the\n          Pin's doorway, turns and runs into the room where he found\n          the brick.\n          \n          INT. STORAGE ROOM\n          \n          Dark. Brendan runs through, clawing past dark fighting\n          shapes, running like a man possessed. He breaks through the\n          darkness and heaves himself up through the small window.\n          \n          EXT. FRONT OF PIN'S HOUSE - NIGHT\n          \n          Brendan scrambles out, slips on the grass and hits the\n          ground hard.\n          \n          Two sharp gunshots come from the house.\n          \n          Everything is suddenly still. Brendan stands slowly.\n          \n          He notices a light from the Mustang - the trunk has drifted\n          open.\n          \n          Inside, a pale blue arm lies tangled in black plastic. Blue\n          fingernails. Cheap plastic bracelets.\n          \n          Brendan shuts the trunk solidly, then walks off down the\n          street and vanishes into the inky night.\n          \n          A moment later police cars pull up, sirens blaring, lights\n          turning the dark streets bright as day.\n          \n                                                                 FADE OUT\n          \n                                                                 FADE IN:\n          \n          EXT. SCHOOL PAYPHONE - EARLY MORNING\n          \n          The morning is cold and clammy. Brendan slumps against the\n          payphone.\n          \n                                                                        103\n          \n          \n                              BRENDAN\n                    Hey. Where are you?\n          \n                              THE BRAIN\n                        (on phone)\n                    Library. Where are you?\n          \n                              BRENDAN\n                    Did she blow last night?\n          \n                              THE BRAIN\n                    No. Stayed there till six thirty, then\n                    walked to school.\n          \n                              BRENDAN\n                    You didn't give her a ride, did you?\n          \n                               THE BRAIN\n                    No.\n          \n                              BRENDAN\n                    But she came straight to school from\n                    Tug's?\n          \n                               THE BRAIN\n                    Yeah.\n          \n                              BRENDAN\n                    She there now?\n          \n                              THE BRAIN\n                    Yeah. Not with me, but here.\n          \n                              BRENDAN\n                    Alright. Tell her I wanna meet up on the\n                    basketball field in half an hour, then\n                    go home and get some sleep.\n          \n                               THE BRAIN\n                    Alright.\n          Brendan hangs up, then pauses, lost in thought.\n          \n          EXT. SIDE OF GYM - LATER\n          \n          Brendan sits against the massive gym building, writing on a\n          piece of looseleaf paper.\n          \n          EXT. ADMINISTRATION BUILDING - LATER\n          Brendan slips the paper under a door stenciled \"VP Offices\".\n          \n                                                                     104\n          \n          \n          EXT. BASKETBALL FIELD - LATER\n          \n          Cold, barren. Wind whistles softly and jangles the metal\n          mesh basketball nets like windchimes.\n          \n          Brendan stands crookedly, hands in pockets, eyes trained on\n          the cold black horizon. A speck appears. Brendan waits for\n          it, bracing himself against the wind.\n          \n          Laura. She puts her arms around him, a warm embrace. Brendan\n          draws back.\n          \n                               LAURA\n                         (softly)\n                    Did you see it all? With Tug and the\n                    Pin?\n          \n          Brendan looks at her a moment.\n          \n                              BRENDAN\n                    No. I took your advice and didn't go.\n          \n                                 LAURA\n                           (confused)\n                    No?\n          \n                              BRENDAN\n                    What happened?\n          \n          Laura looks at him strangely, a little uneasy.\n          \n                              LAURA\n                    The papers say six dead, three around\n                    the house, one girl in the trunk of\n                    Tug's car, and the Pin and Tug.\n          \n          Brendan's face is frozen in an ambiguous frown.\n          \n                                BRENDAN\n                    Yeah?\n                              LAURA\n                    Tug tried to shoot his way out when the\n                    police got there. They tied him to Dode,\n                    too. Same gun. And the girl.\n          \n                                BRENDAN\n                    Huh.\n                              LAURA\n                    Well good thing you weren't there.\n          \n                                                               105\n          \n          \n                                BRENDAN\n                    Yeah.\n          \n          Laura's face softens a bit.\n          \n                              LAURA\n                    You think the girl was Emily?\n          \n                                BRENDAN\n                    Probably.\n          \n          Laura embraces him again, and doesn't let go.\n          \n                              LAURA\n                    You loved her.\n          \n                              BRENDAN\n                        (distant)\n                    Yeah I did.\n          \n                              LAURA\n                    You did all this cause you loved her.\n                    And now it's finished.\n                        (tightens her embrace)\n                    I love you.\n          \n                                BRENDAN\n                    No.\n          \n          Laura pulls back, looks at his face. It is a mask.\n          \n                                LAURA\n                    What?\n          \n                              BRENDAN\n                    No, it's not finished. Tug pulled the\n                    trigger on Em and he got the fall, but\n                    the bulls coulda found that out without\n                    me.\n          Laura pulls back more.\n          \n                              BRENDAN (cont'd)\n                    I set out to know who put her in the\n                    spot, who put her in front of the gun.\n                    That was you, angel.\n          \n                              LAURA\n                        (drifting back further)\n                    What are you talking about?\n          \n                                                               106\n          \n          \n                              BRENDAN\n                    It was you. What, you want the whole\n                    tale? You want me to tell it to you?\n          \n                              LAURA\n                        (bewildered)\n                    Tell it to me.\n          \n                              BRENDAN\n                    Alright, from the top. You had your\n                    fingers in Brad Bramish for appearances\n                    and to keep him buying from the Pin, who\n                    you were hooked with. Emily came to you\n                    and Brad, you saw her for what she was,\n                    an insecure little girl trying to get\n                    in. She goes on the backburner.\n                    Meanwhile maybe you're getting bored,\n                    maybe just greedy, so when the Pin\n                    scores big with the bricks you take your\n                    shot. You hook one, take half, and cut\n                    it back to size, but you cut it bad.\n                    Maybe accidentally, maybe to down the\n                    Pin's operation, doesn't matter. You put\n                    it back, but poor Frisco doses off it\n                    and lands in a coma.\n                        (voice strengthening)\n                    So now the Pin's fuming, maybe he's\n                    jealous of Brad, so he comes to Brad's\n                    crowd looking for blood, or at least a\n                    scape. You know trouble. There's going\n                    to be a war over this. And there's\n                    Emily. She trusts you. She wants in.\n                    It's duck soup.\n          \n                                LAURA\n                          (murmurs)\n                    No.\n          \n                              BRENDAN\n                    You frame her for the bad brick, then\n                    you cut her loose. You turn on your heel\n                    and bite her in the throat. Last week on\n                    the payphone, Pico and Alexander, she\n                    saw something she was scared of. Tug's\n                    car driving by, the Pin driving, but she\n                    wouldn't have seen the Pin. No, she was\n                    across the street, angel. She saw the\n                    passenger side. She saw you. She saw you\n                    and ran like she saw some devil.\n          \n          Laura's face is very still, quivering.\n          \n                                                                        107\n          \n          \n                              LAURA\n                    Brendan, why are you-\n          \n                              BRENDAN\n                    And she took the hit. Dode hid her away,\n                    but the Pin was on to her, tracked her\n                    down, told her to meet him, that they\n                    would make good. Gave her a time, and a\n                    place. And sent Tug. Just to get the\n                    straight. But maybe you had talked Tug\n                    up, or maybe he just blew a fuse, but Em\n                    sprung it on him that she had her kid,\n                    and he did what anyone could count on\n                    Tug doing - he hit her. She took the hit\n                    for you. You let her take it.\n          \n                                LAURA\n                    Stop it!\n          \n                              BRENDAN\n                    That's the tale.\n          \n                                LAURA\n                    Stop it!\n          \n                              BRENDAN\n                    You're going to tell me it's not?\n          \n          \n          \n                                LAURA\n                    It's not!\n          \n                              BRENDAN\n                    Look at me.\n          \n          She crumples against him, looking him straight in the eye.\n          \n                              LAURA\n                    You know me. I've only helped you. How\n                    can you - It isn't true!\n          \n          She sobs through a tensed, straight face. Brendan holds her\n          stare, but his eyes are distant.\n          \n                              BRENDAN\n                    I hope it isn't. I want you to have been\n                    on my side all along, not just trying to\n                    get me under your thumb like Brad and\n                    the Pin and Tug.\n          \n                                LAURA\n                    No-\n          \n                                                                       108\n          \n          \n                              BRENDAN\n                    But I think you knew that meeting was\n                    going to blow up. I think that was your\n                    final play. But I hope I'm wrong. I hope\n                    everything I wrote in the note I dropped\n                    at Gary Trueman's office this morning is\n                    wrong. About your and Brad's involvement\n                    in the Pin's runnings. I hope you didn't\n                    steal the brick last night. In your\n                    purse.\n          \n                              LAURA\n                        (breathes)\n                    I didn't.\n          \n                              BRENDAN\n                    That's good. That means you didn't let\n                    me walk into a slaughterhouse. You\n                    didn't lead Tug and the Pin and their\n                    crews to the slaughter. And when Trueman\n                    reads the note, takes my cue and\n                    searches your locker, he won't find a\n                    damn thing.\n          \n          Something changes in Laura's eyes.\n          \n          EXT. LOCKER CAGE - INSERT\n          \n          Trueman and several other men force Laura's locker open.\n          From its dark interior the chalky white brick falls out,\n          spins through the air, and shatters silently on the locker\n          cage floor.\n          \n          EXT. BASKETBALL FIELD - SAME\n          \n          A moment of silence between them. The basketball nets\n          jangle.\n          \n          Laura steps back. She looks as if she has been punched in\n          the face.\n          \n                              LAURA\n                        (murmurs)\n                    Brendan... don't...\n          \n                               BRENDAN\n                        (gently)\n                    It's done.\n          \n          Her face does strange things, subtle contortions.\n          She watches his eyes. He doesn't look at her. Her voice\n          shakes.\n          \n                                                                        109\n          \n          \n                              LAURA\n                    Done. Well. That's most of it. 9 out of\n                    10. I told Em to tell Tug it was his.\n                    Told her it would soften him up. She\n                    said she wished she could keep it, but\n                    she didn't love the father. I was going\n                    to drive her down the next day, we'd\n                    found a doctor. Most wouldn't. She was\n                    starting to show. 3 months. You know\n                    whose kid that makes it, or have you\n                    known all along?\n          \n          Slowly, steadily, she straightens up. Her figure takes back\n          some dignity. She steps towards him deliberately. Closer.\n          Right up against him.\n          \n          She brings her head to his, puts her lips to his ear,\n          breathes warm breath, and says two words. The first is\n          \n                                 LAURA (cont'd)\n                    Mother-\n          \n          the second is low, guttural and lost to the whistling wind.\n          \n          She turns and walks briskly away.\n          \n          Brendan watches her go across the dark, barren field of\n          asphalt.\n          \n          Metal jangles. Brendan turns to see the Brain hopping a\n          chain link fence. Brendan turns his eyes back on Laura.\n          \n                              BRENDAN\n                    You get your straight?\n          \n                              THE BRAIN\n                    Yeah. I wouldn't have-\n          \n                                 BRENDAN\n                    S'alright.\n          \n                              THE BRAIN\n                    Yeah, well. Chuck Burns came to. The\n                    knife guy. Spilled it all to the bulls,\n                    guess Brad Bramish hired him. On his\n                    own, just a grudge thing.\n          \n                              BRENDAN\n                        (nods slightly)\n                    Fits. You did good, Brain. Go sleep.\n          \n                              THE BRAIN\n                    Yeah, you too.\n          \n                                                                       110\n          \n          \n          The Brain starts to walk away, but turns back.\n          \n                              THE BRAIN (cont'd)\n                    What'd she whisper to you?\n          \n                              BRENDAN\n                    She called me a dirty word.\n          \n          \n                              THE BRAIN\n                    Alright, you don't have to tell me.\n                    Thick.\n          \n                              BRENDAN\n                    As what-all.\n          \n          \n           Brendan stands alone on the asphalt field, watching\n           Laura until she reaches the end of the field and walks\n           off behind a twisted chain linked fence.\n          \n          \n           The first period bell rings, and Brendan walks back\n           towards campus.\n          \n                                                           FADE OUT.\n          \n \n\n\n\nBrick\nWriters :   Rian Johnson\nGenres :   Drama  Mystery\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "High school student Brendan Frye lives a lonely existence following his break up with ex-girlfriend Emily Kostich and the betrayal of his friend Jerr to the authorities. Brendan discovers a note leading him to a pay phone, where he receives a phone call from a terrified Emily begging him for help. She mentions a \"brick\", \"poor Frisco\", \"Tug\", and the \"Pin\", before abruptly hanging up. Her fear appears to have been caused by a passing black Ford Mustang, from which a distinctive-looking cigarette was thrown. Upon asking for information from his acquaintance named Brain, Brendan's search for Emily leads him to Kara, another ex-girlfriend - which further leads him to a Halloween party attended by a flirtatious Laura and her boyfriend, Brad Bramish.\nLaura points Brendan in the direction of a local diner, where he arranges a meeting through Dode, leader of a stoner clique that Emily belongs to. Upon meeting, Emily recants what she had said on the phone and tells Brendan to let her go. Brendan steals her notepad during the encounter and finds a note that leads him directly to her dead body. Emotionally distraught by her death, Brendan takes it upon himself to solve her murder, enlisting the aid of Brain. Brendan hides the body to avoid police intrusion. Brendan discovers that \"The Pin\" is a local drug baron. After finding out that Brad is a regular customer of Pin's, Brendan sets about getting his attention by beating up Brad Bramish. Afterwards, Brendan is beaten up by an unknown young man while speaking on the phone with Brain.\nBrendan visits Vice Principal Trueman, asking him to allow Brendan to investigate the events, without mentioning Emily's death, as a favour for turning in Jerr. While Trueman allows Brendan to continue his investigation, he warns that if Brendan gets caught, Trueman will \"throw him under the bus\". Brendan visits Kara, to request more information about the Pin, although she fobs him off. Later while walking, Brendan sees the same black Ford Mustang in a parking lot. Before attempting to break into the car, he is noticed and beaten up by the car's owner, who is the man who beat him previously. Brendan asks the man several times to meet The Pin. Reluctant at first, going so far as to drive away and then come back again, the young man takes Brendan to The Pin.\nBrendan meets with The Pin and persuades him to consider Brendan for a spot in his operation. It is also revealed that the unknown man is Tug, The Pin's main grunt and muscle. The Pin tells Brendan he will either hire him or rub him out by the next day. On the walk back home Laura tells Brendan that The Pin had previously rejected Emily's attempt to join, so she stole The Pin's brick. Laura then offers to help Brendan, but he distrusts her. While Brendan awaits a response from The Pin, he is attacked by a knife wielding man while at school, but Brendan fights him off. Brendan begins to cough. The Pin accepts Brendan. Brendan gets a call from Dode, who says he saw Brendan hide Emily's body and, believing Brendan is the murderer, vows to ruin him. Brendan meets with The Pin, who suspects an uprising from Tug.\nBrain reports that \"poor Frisco\" is Frisco Farr, a student who fell into a coma after injecting poorly-cut heroin. At The Pin's house, Tug tells Brendan that The Pin received a shipment of ten bricks and sold eight; one was stolen and replaced with another that had been doctored with detergent, causing Frisco's coma, and the 10th brick remains to be sold. The Pin arrives and tells Tug about hearing from someone who knows what happened to Emily. Brendan, weakened from several recent fistfights, intercepts Dode before the meeting and discovers Emily was pregnant when she died. Dode hints to Tug and The Pin that he has information about who killed Emily, saying it is someone very close, but Tug goes berserk and beats Dode before shooting him in the head. Tug then threatens The Pin, who walks away as Brendan faints from a coughing fit. Brendan awakens in Tug's bedroom, where Tug says he's at war with The Pin.\nBrendan confronts Kara, accusing her of manipulating Dode by telling him Emily was carrying his baby and pushing him to sell his information to The Pin. Brendan arranges a meeting between Tug and The Pin, and waits in Tug's bed; Laura enters to comfort him as he sobs over Emily, and they couple. Brendan recognizes her post-sex cigarette as the same distinctive brand that was dropped from Tug's black Mustang after Emily was frightened during the first phone call. At the meeting, chaos erupts when it is discovered that the tenth brick is now missing. Tug beats The Pin to death while Brendan flees, escaping just as police arrive. As he goes he passes the trunk of Tug's car, where he has hidden Emily's body to ensure that police pin her murder on Tug.\nThe next day, Brendan meets with Laura in the school's football field. Brendan explains to Laura that he knows she set Emily up to take the fall for Laura's theft of the ninth brick. She further manipulated Emily into meeting Tug who ultimately killed her, after letting him believe he was responsible for Emily's pregnancy. It is revealed that Laura later stole the tenth brick as well. Brendan tells Laura he has put this truth in a note to Vice Principal Trueman of the school, who will find the brick in Laura's locker if, in fact, what he says is true. Laura vindictively tells Brendan that Emily expressed regret that she couldn't keep her pregnancy because she did not love the prospective father, and that Emily was three months pregnant when she died, implying that the baby was his. Brendan watches Laura walk away."}