{"title": "Buried", "full_text": "BURIED\r\n\r\n\r\n\r\n\r\n                                  Written by\r\n\r\n                                Chris Sparling\r\n\r\n\r\n                         \r\n\r\n                         FADE IN:\r\n\r\n          INT. UNKNOWN ROOM - NIGHT\r\n\r\n          Darkness. Silence. After a long beat, we hear movement,\r\n          confined and contained.\r\n          We then hear the sound of a man, PAUL CONROY, groaning,\r\n          making confused attempts at words. We hear his movement;\r\n          short, abrupt shifting, ending almost immediately with the\r\n          sound of his body banging against wood.\r\n          He screams, though it's clear from the sound that his mouth\r\n          is covered by something.\r\n          After attempting to sit up, he immediately bangs his head\r\n          against something. It's terribly warm and his breaths are\r\n          labored.\r\n          He attempts to move to his left and right, only to find that\r\n          he is confined on those sides, as well. He frantically\r\n          shifts about, only to discover, by touch, that he is encased\r\n          in something.\r\n          Something is very wrong, and he doesn't need to see to know\r\n          that.\r\n          Finally, we see him, lit by the flame of the Zippo he holds\r\n          in his hands, which are bound together in front of him with\r\n          rope. A rolled-up, dirty rag is tied tightly around his\r\n          head, stretched across his mouth. Dried blood stains his\r\n          hair and forehead.\r\n\r\n                         \r\n          We see that he is lying in an old fashioned, wooden coffin.\r\n          Nothing more than a few rotted-out planks of wood nailed\r\n          together. Realizing the same, Paul is struck by an\r\n          overwhelming, instant panic.\r\n          With great difficulty, and while still holding the lit Zippo,\r\n          Paul removes the muzzle from his mouth.\r\n\r\n                          PAUL\r\n           What...? What is this?\r\n          His words become almost unintelligible as he flails about,\r\n          though fear is understood in his every utterance.\r\n          He screams aloud, but his voice is captured by the coffin\r\n          walls.\r\n\r\n           2.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           Oh my God! Help me!! Help me!!\r\n          He kicks and slams his hands against the top and sides of the\r\n          coffin, all to no avail. His violent movements cause small\r\n          grains of sand to trickle in through the space between the\r\n          sides and top of the coffin, as well as a small gap that\r\n          exists between one of the coffin's broken wooden planks.\r\n          Sweat cascades down the side of his neck, dripping from his\r\n          dampened brow. The heat inside the extremely close confines\r\n          of the coffin is stifling.\r\n\r\n                          PAUL (CONT'D)\r\n           Somebody help me! Please!!\r\n          Paul continues with his futile efforts to pry off the top of\r\n          the coffin. The sides, the top, the bottom -- all are too\r\n          thoroughly reinforced by the force of what surrounds the\r\n          coffin. Sand. It becomes clear to him that he is buried.\r\n          He tries his best to calm himself, though he has trouble\r\n          catching his breath. It takes him some time, but he\r\n          eventually achieves some semblance of calm.\r\n          Getting a good look at him for the first time, we see that\r\n          Paul is somewhere around 37 years old. Unshaven and\r\n          physically unremarkable, he embodies the blue-collar American\r\n          everyman.\r\n          He coughs. The minimal amount of oxygen in the coffin makes\r\n          it hard for him to breathe.\r\n          His eyes widen a bit upon seeing an exposed, rusty nail. He\r\n          tries desperately to use the nail to cut through the old,\r\n          frayed ropes that bind his hands. Doing so is no easy task.\r\n          The incredibly tight quarters makes his every action nearly\r\n          impossible.\r\n          After a lengthy struggle, the rope snaps. Paul quickly frees\r\n          his hands. A small victory. Very small.\r\n          The heat is unbearable. Paul takes off his button-down\r\n          shirt, leaving him in a T-shirt. His body battles against\r\n          the walls and the ceiling of the coffin with every move he\r\n          makes.\r\n          He tosses his button-down shirt down by his feet. His\r\n          undershirt is drenched through with sweat.\r\n          Still trying to calm himself, but having little success in\r\n          doing so, Paul looks around the coffin. His feet, though\r\n          only his body-length away, seem miles from him.\r\n\r\n           3.\r\n\r\n                         \r\n\r\n                         \r\n          He looks at the top of the coffin, and then back at his feet.\r\n          With great difficulty, he shifts his body so that his feet\r\n          are pressed against the top of the coffin. He attempts to\r\n          use his leg strength to push the top off of him, but it\r\n          doesn't move even a millimeter.\r\n          After several failed attempts, and with his legs exhausted,\r\n          Paul drops his feet from the top of the coffin. He lay for a\r\n          moment in silence, followed by an outburst of crying.\r\n          Close to his head, on the corner of the floor, we see there's\r\n          another broken plank. A small hole.\r\n          He closes his cigarette lighter, extinguishing the flame. In\r\n          total darkness, he continues to cry.\r\n\r\n                         \r\n\r\n                          PAUL (CONT'D)\r\n           What is this?\r\n          With his sobbing slowly subsiding, the coffin soon grows\r\n          eerily silent.\r\n          The sound of Paul's labored breaths are all we hear, softened\r\n          under the blanket of absolute darkness.\r\n          After a beat, the silence is interrupted by a subtle buzzing\r\n          sound. The muted sight of strange, blueish light flickers in\r\n          the coffin, by Paul's feet. He is extremely startled.\r\n          The buzzing continues, as does the minimal splashing of\r\n          light. It's coming from underneath his discarded button-down\r\n          shirt, down near his feet.\r\n          He lights the Zippo to get a better look.\r\n\r\n                         \r\n          Pulling the shirt away, he realizes that what he is hearing\r\n          and seeing is the vibrating ring and display features of an\r\n          older model cell phone.\r\n          He frantically reaches for it, though the coffin is far too\r\n          small for him to reposition himself so easily.\r\n          To his dismay, the phone stops ringing. But, his efforts to\r\n          reach it continue. He uses his feet to search for the phone.\r\n          After some trouble finding it, he eventually locates it.\r\n          Clamping the phone together between his clasped feet, Paul\r\n          then painfully angles his body so that he can reach his feet\r\n          with his hands and grab it.\r\n          He is soon able to reach it. Immediately thereafter, he\r\n          flips open the phone and puts the receiver in front of him.\r\n\r\n           4.\r\n\r\n                         \r\n\r\n                         \r\n          We see that there is a Text Message waiting for Paul on the\r\n          phone. However, Paul barely notices.\r\n          The time on the phone reads 6:12pm. While the numbers and\r\n          display screen icons are familiar to Americans, all the words\r\n          are in Arabic.\r\n          What he does notices is that the phone barely has one bar of\r\n          signal strength. Worse yet, there is only half of the\r\n          battery life remaining.\r\n          He tries to remember the Safe Number he was given. With the\r\n          phone open and ready to be dialed, Paul struggles to recall\r\n          the information.\r\n\r\n                          PAUL (CONT'D)\r\n           Come on, come on. What was it?\r\n\r\n                         \r\n          Getting only two digits into dialing the number, he cannot\r\n          remember much more and closes the phone.\r\n          He wedges the lit Zippo into sand, which is compacted against\r\n          a small hole in the wall of the coffin.\r\n          Paul reaches into his pants pocket, frantically searching for\r\n          something. He hastily removes a prescription pill bottle and\r\n          a small, metal flask. Both are not what he was looking for.\r\n          He then reaches to his back pocket and removes his wallet.\r\n          It's empty. His license, his credit cards, his cash and,\r\n          most importantly at that very moment, a piece of paper with\r\n          the Safe Number written on it, are all missing.\r\n\r\n                          PAUL (CONT'D)\r\n           No. Where the hell is it? Son of\r\n           a...Come on!\r\n\r\n                         \r\n          He screams aloud again, hoping greatly that someone can hear\r\n          him. His frenzied maneuvering puts out the flame of the\r\n          Zippo.\r\n\r\n                          PAUL (CONT'D)\r\n           Help me! Please! Somebody help\r\n           me!\r\n          His words barely make it pass the coffin walls.\r\n          With the cell phone still in hand, and laboring to reclaim\r\n          the breath he just expended, Paul turns to desperation. He\r\n          dials the international code of 001, and then dials 911.\r\n          A FEMALE 911 OPERATOR answers almost immediately.\r\n\r\n           5.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          FEMALE 911 OPERATOR\r\n           911, please hold.\r\n          The Female 911 Operator places Paul on hold.\r\n\r\n                          PAUL\r\n           No! Wait!\r\n          Paul accidentally bangs the cap of the Zippo against the\r\n          coffin wall, putting out the flame.\r\n          She quickly returns.\r\n\r\n                          FEMALE 911 OPERATOR\r\n           911. What is your emergency?\r\n\r\n                          PAUL\r\n           Hello?\r\n\r\n                          FEMALE 911 OPERATOR\r\n           911. What's the problem, sir?\r\n          Paul is so incredibly panicked that he has trouble remaining\r\n          coherent. After a few sparks, the Zippo is re-lit.\r\n\r\n                          PAUL\r\n           I'm buried. You have to help me.\r\n           You have to help me, I can't\r\n           breathe...\r\n\r\n                          FEMALE 911 OPERATOR\r\n\r\n                          SIR --\r\n\r\n                          PAUL\r\n           I'm buried in a coffin. Please\r\n           help me! Send someone to find\r\n           me...\r\n\r\n                          FEMALE 911 OPERATOR\r\n           Sir...slow down. What is your\r\n           name?\r\n\r\n                          PAUL\r\n           Paul. Paul Conroy.\r\n\r\n                          FEMALE 911 OPERATOR\r\n           Okay, Mister Conroy. Can you tell\r\n           me your location?\r\n\r\n                          PAUL\r\n           I don't know. I'm in a coffin. I\r\n           don't know where. I'm scared.\r\n           Please help me.\r\n\r\n           6.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          FEMALE 911 OPERATOR\r\n          You're in a coffin?\r\n\r\n                          PAUL\r\n          Yeah, it's, like, one of those old,\r\n          wooden ones.\r\n\r\n                          FEMALE 911 OPERATOR\r\n          Are you at a funeral home?\r\n\r\n                          PAUL\r\n          No. I don't know. No.\r\n\r\n                          FEMALE 911 OPERATOR\r\n          How are calling me right now?\r\n\r\n                          PAUL\r\n          What?\r\n\r\n                          FEMALE 911 OPERATOR\r\n          If you're buried in a coffin, where\r\n          are you calling from?\r\n\r\n                          PAUL\r\n          A cell phone. There was an old\r\n          cell phone in the coffin.\r\n\r\n                          FEMALE 911 OPERATOR\r\n          You're calling from your cell\r\n          phone?\r\n\r\n                          PAUL\r\n          Yes. No. It's not mine, but yes,\r\n          I'm calling from a cell phone.\r\n\r\n                          FEMALE 911 OPERATOR\r\n          There was a cell phone in the\r\n          coffin when you climbed in?\r\n\r\n                          PAUL\r\n          I didn't climb in.\r\n\r\n                          FEMALE 911 OPERATOR\r\n          How did you end up in the coffin,\r\n          sir?\r\n\r\n                          PAUL\r\n          I was put here.\r\n\r\n                          FEMALE 911 OPERATOR\r\n          In the coffin?\r\n\r\n                          PAUL\r\n          Yes. Please send help.\r\n\r\n           7.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          FEMALE 911 OPERATOR\r\n          And you're saying the coffin is\r\n          buried?\r\n\r\n                          PAUL\r\n          I think so. It's...it's hot in\r\n          here. I can't breathe.\r\n\r\n                          FEMALE 911 OPERATOR\r\n          Do you know your location, sir?\r\n\r\n                          PAUL\r\n          I told you, I don't know.\r\n          Somewhere in Iraq.\r\n\r\n                          FEMALE 911 OPERATOR\r\n          Iraq?\r\n\r\n                         \r\n\r\n                          PAUL\r\n          Yes. I'm a truck driver, an\r\n          American. I work for CRT.\r\n\r\n                          FEMALE 911 OPERATOR\r\n          Are you a soldier, sir?\r\n\r\n                          PAUL\r\n          No. Please, please listen to me.\r\n          I'm a truck driver. I work for\r\n          CRT. I'm a civilian contractor\r\n          working in Iraq. We were attacked\r\n          in Baqubah, they...they...\r\n\r\n                          (STARTS CRYING)\r\n          ...shot them. All of them.\r\n\r\n                          FEMALE 911 OPERATOR\r\n          They shot who, sir?\r\n\r\n                         \r\n\r\n                          PAUL\r\n          All of the other drivers.\r\n\r\n                          FEMALE 911 OPERATOR\r\n          And you're saying this happened in\r\n          Iraq? The country?\r\n\r\n                          PAUL\r\n          Yes. Please, you have to help me.\r\n          They gave me a safety number to\r\n          call, but I had it stored in my\r\n          wallet and --\r\n\r\n                          FEMALE 911 OPERATOR\r\n          Mister Conroy, this is 911\r\n          emergency in Youngstown, Ohio.\r\n\r\n           8.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           Ohio?\r\n\r\n                          FEMALE 911 OPERATOR\r\n           Yes, sir. I'm not sure exactly how\r\n           you called here if you're in\r\n           another country, but if you'd like,\r\n           I can patch you through to the\r\n           Sheriff's Department.\r\n\r\n                          PAUL\r\n           Sheriff's Department? No...you\r\n           don't underst...\r\n\r\n                          (GIVING UP)\r\n           ...forget it.\r\n          Realizing that his conversation is both lengthy and useless,\r\n          Paul ends the call. He checks the battery life on the phone.\r\n          It still holds steady at two bars.\r\n          He immediately dials another number, one that he can recall\r\n          with ease.\r\n          He again enters the 001 international code before making the\r\n          call.\r\n          Paul then dials his home phone. It rings several times, so\r\n          far unanswered.\r\n\r\n                          PAUL\r\n           Come on, come on. Pick up.\r\n           Please.\r\n          After sitting through the agony of a few more rings, Paul is\r\n          met with the answering machine.\r\n\r\n                         \r\n          The voice of his young son, SHANE, is heard on the answering\r\n          machine greeting.\r\n\r\n                          SHANE\r\n           Thanks for calling the Conroy's.\r\n           We're not home right now. Please\r\n           leave a message at the beep.\r\n           Thanks.\r\n          At the sound of the Beep, Paul leaves a frenzied, rambling\r\n          message.\r\n\r\n                          PAUL\r\n           Linda, honey, it's me. Listen, I\r\n           need you to contact the National\r\n           Guard right away. Or the Pentagon.\r\n           Tell them we were attacked in the\r\n           Diyala Provence, in Baqubah.\r\n\r\n                          (MORE)\r\n\r\n           9.\r\n\r\n                          PAUL (CONT'D)\r\n           They have to find me. Please help\r\n           me, baby. Please help them find me.\r\n          Paul hangs up. He dials his wife's cell phone right away.\r\n          After several rings, her cell phone voice mail picks up. We\r\n          hear the sound of Linda, Paul's wife, on her outgoing\r\n          message.\r\n\r\n                          LINDA\r\n           Hi, this is Linda. Please leave a\r\n           message. Thanks and have a great\r\n           day.\r\n          The Beep sounds and Paul immediately tears into his voice\r\n          message.\r\n\r\n                         \r\n\r\n                          PAUL\r\n           Linda, it's Paul. I need you to\r\n           call me right away. This is an\r\n           absolute emergency. Call the\r\n           number that comes up on your phone.\r\n           Call me at that number. If I don't\r\n           answer, call the Pentagon or the\r\n           F.B.I. I don't know what the hell\r\n           is going on, but I'm buried in a\r\n           box...\r\n          Hearing himself say those last words gives him pause. The\r\n          gravity of the situation fully takes hold.\r\n\r\n                          PAUL (CONT'D)\r\n           ...I can't breathe in here. Make\r\n           sure you call me right away.\r\n           Please, baby, please call me.\r\n\r\n                         \r\n          Paul ends the call. He nervously looks at the amount of\r\n          battery life remaining on the phone. Still holding strong at\r\n          two bars.\r\n          He notices the flickering light of the Zippo. It, too,\r\n          appears to be using up small amounts of oxygen. He closes\r\n          the lid, extinguishing the flame.\r\n          Total darkness. Silence, save for Paul's increasingly heavy\r\n          breaths.\r\n          He begins to hyperventilate. He knows that preserving oxygen\r\n          is paramount, so he does his best to calm himself. The\r\n          healthy swig he takes from his flask helps.\r\n\r\n           10.\r\n\r\n                         \r\n\r\n                         \r\n          He flips open the cell phone. The light of the display\r\n          screen partially illuminates his face and some of the coffin\r\n          with a blueish hue. Paul again enters the overseas dialing\r\n          code, this time dialing 411 information.\r\n          The 411 OPERATOR answers.\r\n\r\n                          411 OPERATOR\r\n           What city and state, please?\r\n\r\n                          PAUL\r\n           Um...I don't know. The F.B.I.,\r\n           wherever they are.\r\n          Paul reaches for his button-down shirt. Fishes for pens\r\n          stashed in his lapel pocket, while keeping the phone pressed\r\n          to his ear with his shoulder.\r\n\r\n                         \r\n\r\n                          411 OPERATOR\r\n           Do you have a specific city you'd\r\n           like to be connected to, sir?\r\n\r\n                          PAUL\r\n           I don't care, any city. Just\r\n           connect me to the F.B.I.\r\n\r\n                          411 OPERATOR\r\n           Sir, I have F.B.I. field offices\r\n           listed in Boston, New York,\r\n           Philadelphia, New Haven, Los\r\n           Angeles, Chicago, Denver --\r\n          Paul cannot bear to listen any further to this list that\r\n          seemingly never ends.\r\n\r\n                          PAUL\r\n           Anywhere! Any city, just connect\r\n           me, please!\r\n\r\n                          411 OPERATOR\r\n           I'm sorry, sir, but I'm not allowed\r\n           to do that.\r\n\r\n                          PAUL\r\n           Fine, um...Chicago. Okay?\r\n\r\n                          411 OPERATOR\r\n           Please hold for your number.\r\n          Paul is transferred to an AUTOMATED MESSAGE.\r\n\r\n                          AUTOMATED MESSAGE\r\n           The number you requested, 312-421-\r\n\r\n           6700...\r\n\r\n           11.\r\n\r\n                         \r\n\r\n                         \r\n          Paul writes the digits of the phone number on the top of the\r\n          coffin with his pen. But, after the first three numbers, the\r\n          pen stops working. He hurriedly reaches back into his shirt\r\n          pocket to remove the other pen, which is actually a click-up\r\n          pencil. Click-click-click-click. He writes the last seven\r\n          digits, followed by the word \"FBI.\"\r\n\r\n           AUTOMATED MESSAGE (CONT'D)\r\n           ...can be connected for an\r\n           additional charge of twenty-five\r\n           cents by pressing the number one.\r\n          He presses the number one and is connected directly.\r\n          After a few rings, SPECIAL AGENT HARRIS answers.\r\n\r\n           SPECIAL AGENT HARRIS\r\n           Chicago field office. Special\r\n           Agent Harris.\r\n\r\n                          PAUL\r\n           Hello? Is this the F.B.I.?\r\n\r\n           SPECIAL AGENT HARRIS\r\n           Yes it is, sir.\r\n\r\n                          PAUL\r\n           I'm calling from Iraq. I'm buried\r\n           in the desert somewhere. I need\r\n           you to help me --\r\n\r\n           SPECIAL AGENT HARRIS\r\n           Whoa, whoa, sir. Slow down. When\r\n           were you in Iraq?\r\n\r\n                          PAUL\r\n           Now. I'm there now. I'm a truck\r\n           driver for CRT. I've been here for\r\n           nine months.\r\n\r\n           SPECIAL AGENT HARRIS\r\n           May I have your name please, sir?\r\n\r\n                          PAUL\r\n           Paul Conroy.\r\n\r\n           SPECIAL AGENT HARRIS\r\n           (saying it as he writes it\r\n\r\n                          DOWN)\r\n           Paul Conroy.\r\n           (back on the phone)\r\n           Okay, Paul, explain to me what's\r\n           going on.\r\n\r\n           12.\r\n\r\n                         \r\n\r\n                         \r\n          Paul attempts to center himself so that he can accurately\r\n          tell his story.\r\n\r\n                          PAUL\r\n           Alright. Me and a convoy of other\r\n           drivers were delivering kitchen\r\n           parts to a community center. As we\r\n           got closer, a bunch of kids started\r\n           throwing rocks at our trucks. Then\r\n           an IED went off up ahead and blew\r\n           up one of the other trucks. These\r\n           guys came out from behind the\r\n           houses with guns and started\r\n           shooting everybody right there on\r\n           the street.\r\n\r\n           SPECIAL AGENT HARRIS\r\n           Were you shot at?\r\n\r\n                          PAUL\r\n           I don't know!\r\n           (after a breath, calmer)\r\n           I don't know. I was way in the\r\n           back of the convoy. I must have got\r\n           hit in the head with one of the\r\n           rocks and got knocked out. That's\r\n           the last thing I remember. But now\r\n           I just woke up, and I was tied up\r\n           and buried in a coffin.\r\n\r\n           SPECIAL AGENT HARRIS\r\n           Who put you there?\r\n\r\n                          PAUL\r\n           I guess whoever ambushed us.\r\n\r\n                         \r\n          Special Agent Harris sounds slightly skeptical of Paul's\r\n          claims.\r\n\r\n           SPECIAL AGENT HARRIS\r\n           A bunch of kids?\r\n\r\n                          PAUL\r\n           No, you're not listening. The kids\r\n           threw the rocks at us, but then\r\n           some Iraqi guys -- maybe\r\n           insurgents, I don't fucking know --\r\n           popped out of nowhere and started\r\n           shooting at us.\r\n\r\n           SPECIAL AGENT HARRIS\r\n           I thought you said they didn't\r\n           shoot at you.\r\n\r\n           13.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           They didn't, I don't know! But\r\n           they shot them!\r\n\r\n           SPECIAL AGENT HARRIS\r\n           Sir, you're going to have to stop\r\n           shouting if --\r\n\r\n                          PAUL\r\n           I'm shouting because you're not\r\n           listening! I need you to help me!\r\n           Please!!\r\n\r\n           SPECIAL AGENT HARRIS\r\n           Hmmm...\r\n          Paul takes a moment to center himself.\r\n\r\n                         \r\n\r\n                          PAUL\r\n           Can you trace my call? GPS or\r\n           something?\r\n\r\n           SPECIAL AGENT HARRIS\r\n           Why is it that they didn't shoot\r\n           you?\r\n\r\n                          PAUL\r\n           I have no idea. They didn't,\r\n           that's all I know.\r\n\r\n           SPECIAL AGENT HARRIS\r\n           What's your social security number,\r\n           Paul?\r\n\r\n                          PAUL\r\n           Why? Who cares? I'm buried in the\r\n           middle of the fucking desert! Who\r\n           cares what my social security\r\n           number is?! I'm an American\r\n           citizen. Just send someone to find\r\n           me!\r\n\r\n           SPECIAL AGENT HARRIS\r\n           Do you know where you're\r\n           ...lo...if...dy..\r\n          The cell phone starts breaking up.\r\n\r\n                          PAUL\r\n           Hello? What? I can't hear you.\r\n\r\n           SPECIAL AGENT HARRIS\r\n           Bet...un...near...\r\n\r\n           14.\r\n\r\n                         \r\n\r\n                         \r\n          Suddenly, Special Agent Harris is not heard at all.\r\n\r\n                          PAUL\r\n           Hello?! Hello?!\r\n          Paul checks the phone's display, where he sees that the call\r\n          has been lost.\r\n\r\n                          PAUL (CONT'D)\r\n           Shit!!\r\n          Cell phone service temporarily goes down. Paul lights the\r\n          Zippo to help him see the cell phone screen. He tries to\r\n          make a call, but nothing happens.\r\n          He shakes the phone, moves it around the coffin, all in\r\n          desperate hope that he will get a signal. He soon does.\r\n\r\n                         \r\n          He looks at the number for the F.B.I. that he has written on\r\n          the wall, thinking about calling them back. He then checks\r\n          the battery life on his phone, which remains at two bars.\r\n          Paul then decides to make a different call, this time to a\r\n          phone number he has committed to memory: his employer back in\r\n          the U.S., Crestin, Roland and Thomas (CRT).\r\n          He closes the lid of the Zippo, extinguishing the flame.\r\n          After a few rings, a CRT OPERATOR answers.\r\n\r\n                          CRT OPERATOR\r\n           Thank you for calling Crestin,\r\n           Roland and Thomas. How may I\r\n           direct your call?\r\n\r\n                          PAUL\r\n           Somebody, I need to talk to someone\r\n           right away. It's an emergency.\r\n\r\n                          CRT OPERATOR\r\n           Who is this, please?\r\n\r\n                          PAUL\r\n           Paul Conroy. I'm a driver for you\r\n           guys. I'm calling from Iraq. My\r\n           convoy was attacked.\r\n\r\n                          CRT OPERATOR\r\n           Sir, if this is a crisis situation\r\n           you need to contact the Safety\r\n           Number your were provided.\r\n\r\n           15.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           I know, I know, but I don't have\r\n           it. They took it.\r\n\r\n                          CRT OPERATOR\r\n           Who took it, sir?\r\n\r\n                          PAUL\r\n           The Iraqis, I think. I don't\r\n           remember, I blacked out.\r\n\r\n                          CRT OPERATOR\r\n           I'm going to put you through to\r\n           Alan Davenport.\r\n\r\n                          PAUL\r\n           Davenport? Who's that?\r\n\r\n                         \r\n\r\n                          CRT OPERATOR\r\n           Director of Personnel. Please\r\n           hold.\r\n\r\n                          PAUL\r\n           Personnel? No, I need to talk --\r\n          Paul is placed on hold. Synthesized soft rock plays in the\r\n          background of the phone, maddening Paul further. Over the\r\n          music, a CRT SPOKESMAN is heard, speaking a recorded\r\n          testimonial during the on-hold message.\r\n\r\n                          CRT SPOKESMAN\r\n           At CRT, we work with our clients to\r\n           provide effective and sustainable\r\n           solutions to the challenges they\r\n           face in our fast-growing, global\r\n           economy. As the premiere...\r\n\r\n                         \r\n          The message is interrupted by ALAN DAVENPORT's outgoing voice\r\n          message.\r\n\r\n                          ALAN DAVENPORT\r\n           You've reached Alan Davenport,\r\n           personnel director at Crestin,\r\n           Roland and Thomas. Please leave\r\n           your name and number at the tone\r\n           and I will return your call as soon\r\n           as possible.\r\n          The BEEP sounds. Paul is confused as to why he was patched\r\n          through to someone in human resources, but leaves a message\r\n          nevertheless.\r\n\r\n           16.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           This is Paul Conroy, I'm from\r\n           Hastings, Michigan. I'm a driver\r\n           for CRT, and my convoy was\r\n           ambushed...by insurgents or\r\n           terrorists. I don't know. I don't\r\n           know who it was. I'm stuck in the\r\n           ground, buried in a coffin and I\r\n           need help. Please send help. I'm\r\n           begging you. I think I'm in\r\n           Baqubah in the Diyala Provence.\r\n           Please send help right away. I\r\n           can't breathe in here. I\r\n           can't...please. I'm begging you.\r\n           I don't know who else to call.\r\n\r\n           I...\r\n\r\n                         \r\n          Paul notices that his phone has again lost signal.\r\n\r\n                          PAUL (CONT'D)\r\n\r\n                          (EXASPERATED)\r\n           ...fuck.\r\n          Paul drops the phone to his side, the screen still emitting\r\n          its glow.\r\n          He explodes with a mixture of rage and fear. He screams and\r\n          flails his feet and hands wildly, banging them against the\r\n          walls of the coffin. His animalistic outburst causes the\r\n          phone to close.\r\n          The coffin returns to pitch black.\r\n          After a long beat, Paul lights the Zippo, which remains\r\n          wedged in the sand compacted against the small hole in the\r\n          wall of the coffin.\r\n\r\n                         \r\n          Paul takes a few moments to catch his breath. He looks again\r\n          at the cell phone. Remembers receiving a Text Message.\r\n          The icon on the phone's display indicates that he does, in\r\n          fact, have an unread Text Message waiting for him.\r\n          Paul quickly scrolls through the phone's menu, which is all\r\n          written in Arabic, until he reaches what appears to be the\r\n          Text Message option. Opening it, he sees a series of ten\r\n          numbers.\r\n          Using his click-up pencil, he scribbles the numbers onto the\r\n          top of the coffin. Next to the number, he writes the word\r\n          \"HELP?\" Noticing that his phone has again picked-up a\r\n          signal, he dials the number.\r\n\r\n           17.\r\n\r\n                         \r\n\r\n                         \r\n          It rings once, but then the reception begins to falter.\r\n          After only two rings, the call is ended. Paul's frustration\r\n          mounts. He is barely able to fight off another fit of\r\n          hysterics. He dials the number again.\r\n          It rings once. A second ring. In the middle of the third\r\n          ring, someone answers -- but they do not say anything.\r\n\r\n                          PAUL\r\n           Hello? Hello? Is anyone there?\r\n           Hello?\r\n          After a beat, Paul hears breathing on the other end of the\r\n          phone. He also hears a discordance of background sound; the\r\n          din of a room filled with Arabic-speaking men.\r\n\r\n                          PAUL (CONT'D)\r\n           Hello? Who are you? Please, you\r\n           have to help me.\r\n          Still, Paul's words are only met with slow, measured breaths.\r\n\r\n                          PAUL (CONT'D)\r\n           Who is this? Hello?\r\n          The person on the other end eventually speaks. An Iraqi man,\r\n          JABIR, talks forcefully and aggressively in broken English.\r\n\r\n                          JABIR\r\n           Breathe no breathe, American? Ah?\r\n           Breathe no breathe?\r\n\r\n                          PAUL\r\n           What? I don't know what you're\r\n           saying. Who is this?\r\n\r\n                         \r\n\r\n                          JABIR\r\n           American can breathe no breathe?\r\n\r\n                          PAUL\r\n           No, I can't breathe. Please get me\r\n           out of here.\r\n\r\n                          JABIR\r\n           Get out?\r\n\r\n                          PAUL\r\n           Yes, please get me out. Help me.\r\n\r\n                          JABIR\r\n           Soldier.\r\n\r\n           18.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           No, no I'm not a soldier. I'm a\r\n           truck driver. That's it. I'm not\r\n           a soldier. I'm a contractor.\r\n\r\n                          JABIR\r\n           Contractor?\r\n\r\n                          PAUL\r\n           Yes, that's right. A contractor.\r\n           Not a soldier.\r\n\r\n                          JABIR\r\n           Blackwater.\r\n\r\n                          PAUL\r\n           No, not for Blackwater. I'm not a\r\n           security contractor. Truck driver,\r\n           I'm a truck driver. That's all.\r\n\r\n                          JABIR\r\n           You are American.\r\n\r\n                          PAUL\r\n           Yes.\r\n\r\n                          JABIR\r\n           Then you are soldier.\r\n          Despair falls upon Paul. It becomes clear that Jabir is\r\n          responsible for all of this. As such, Paul crosses out the\r\n          word \"HELP?\" Closes the lid of the Zippo, leaving only the\r\n          cell phone display screen to illuminate his face.\r\n\r\n                          PAUL\r\n           No, I'm not. I'm here unarmed.\r\n           But, you still shot at us.\r\n\r\n                          JABIR\r\n           In head and in throat, so you tell\r\n           no more lies.\r\n\r\n                          PAUL\r\n           I'm not lying! We were all\r\n           drivers.\r\n\r\n                          JABIR\r\n           Drive what?\r\n\r\n                          PAUL\r\n           Trucks. The big trucks you see\r\n           driving around with the supplies?\r\n           That's us. That's me. We're not\r\n           soldiers.\r\n\r\n           19.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          JABIR\r\n           Five million money.\r\n\r\n                          PAUL\r\n           What?\r\n\r\n                          JABIR\r\n           Five million money tonight by nine\r\n           PM or you stay. Buried like dog.\r\n\r\n                          PAUL\r\n           Five million dollars? From who?\r\n\r\n                          JABIR\r\n           Your family.\r\n\r\n                          PAUL\r\n           My family doesn't have five million\r\n           dollars. If they did, I wouldn't\r\n           be here.\r\n\r\n                          JABIR\r\n           From Embassy.\r\n\r\n                          PAUL\r\n           I don't know, yes, the Embassy will\r\n           pay you. If you let me go, they'll\r\n           pay you the money.\r\n          Silence on the other end of the phone.\r\n\r\n                          JABIR\r\n           (after a long beat)\r\n           Nine PM, five million money.\r\n          Jabir hangs up the phone, forcing Paul to instantly come to\r\n          grips with the fact that he is being held hostage.\r\n          He lays back in the coffin, shell-shocked. Physically spent,\r\n          the cell phone falls from his hands and onto the floor. The\r\n          display screen casts a dim light throughout the coffin.\r\n\r\n                          FADE TO:\r\n\r\n          INT. COFFIN - MOMENTS LATER\r\n\r\n          The Zippo lights. Paul holds it in his hand, using it to\r\n          illuminate the inside of the coffin. He attempts to push it\r\n          into its now customary resting place, but the sand has\r\n          loosened, making it difficult for the Zippo to stay in place.\r\n          It almost falls to the floor.\r\n\r\n           20.\r\n\r\n                         \r\n\r\n                         \r\n          Looking around, Paul sees there is a crack between two\r\n          planks, located on the opposite wall of the coffin. He\r\n          wedges the lit Zippo into the crack.\r\n          With his hands now free, Paul haphazardly positions himself\r\n          so that his back is facing the top of the coffin.\r\n          His every move is arduous; the claustrophobic nature of the\r\n          coffin bearing down on him.\r\n          Paul positions his bent knees underneath his chest, with his\r\n          shins and feet pressed against the bottom of the coffin.\r\n          Using the strength of his legs, he attempts to lift the top\r\n          off the coffin with his back.\r\n          Trickles of sand fall in from the side of the coffin,\r\n          sprinkling against the wooden base.\r\n\r\n                         \r\n          He fails, only to immediately try again. And again. And\r\n          again. Exhaustion sets in.\r\n          Staring ahead, the phone sits in front of him. He notices\r\n          that the battery life bars are still at one solid and one\r\n          blinking.\r\n          He grabs the cell phone, staring at it, trying to think of\r\n          someone else to call.\r\n          The battery life is limited. Every call has to count.\r\n          He tries to remember some phone numbers, but has trouble\r\n          recalling the information.\r\n\r\n                          PAUL\r\n\r\n                          (TO HIMSELF)\r\n           Come on, what's her number?\r\n\r\n                         \r\n          He cannot remember the number he's thinking of. He notices\r\n          that the flame of the Zippo flickers, indicating its use of\r\n          his much-needed oxygen. Paul closes the lid, extinguishing\r\n          the flame.\r\n          A second later, we see him, lit by the cell phone display\r\n          screen. He dials the international code for the United\r\n          States, followed by 411 information.\r\n          A MALE 411 OPERATOR answers.\r\n\r\n                          MALE 411 OPERATOR\r\n           What city and listing, please?\r\n\r\n                          PAUL\r\n           Hastings, Michigan. I'm looking\r\n           for Donna Mitchell.\r\n\r\n           21.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          MALE 411 OPERATOR\r\n           I have two Donna Mitchells, sir.\r\n           One on Federal Road and one on\r\n           Ardmore Avenue.\r\n\r\n                          PAUL\r\n           Ardmore Avenue...I think. Yeah.\r\n           Shit, I don't know. Just give me\r\n           that one.\r\n\r\n                          MALE 411 OPERATOR\r\n           Ardmore Avenue?\r\n\r\n                          PAUL\r\n           Yes, Ardmore Avenue.\r\n\r\n                          MALE 411 OPERATOR\r\n           Please hold for your number.\r\n          Paul is switched to an AUTOMATED MESSAGE.\r\n\r\n                          AUTOMATED MESSAGE\r\n           The number you requested, 269-948-\r\n           1998 can automatically be dialed\r\n           for a charge of twenty-five cents\r\n           by pressing the number one.\r\n          Paul writes Donna's number and name on the top of the coffin\r\n          and then presses the number one. He is connected.\r\n          Her phone rings and rings. Paul's frustration is evident.\r\n\r\n                          PAUL\r\n           Come on! Where the hell is\r\n           everyone?\r\n\r\n                         \r\n          The phone rings some more. Paul checks the battery life --\r\n          still at one and a half bars.\r\n          DONNA eventually answers.\r\n\r\n                          DONNA\r\n           Hello?\r\n          Hearing her voice, Paul hurriedly places the phone to his\r\n          ear.\r\n\r\n                          PAUL\r\n           Donna, it's Paul.\r\n\r\n                          DONNA\r\n           Hey, how's it going?\r\n\r\n           22.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           Where's Linda? She's not answering\r\n           her phone. I need to talk to her,\r\n           I've been taken hostage by...\r\n          Donna interrupts. We realize, as does Paul, that her voice\r\n          was actually coming from her answering machine.\r\n\r\n                          DONNA\r\n\r\n                          (OVERLAPPING)\r\n           Fooled you. I'm not really home.\r\n           But if you leave a message, I'll\r\n           get back to you as soon as I get\r\n           in. Bye-bye.\r\n          His hand falls to his forehead, defeated.\r\n\r\n                         \r\n\r\n                          PAUL\r\n           Donna, I need to talk to Linda.\r\n           It's an absolute emergency. Have\r\n           her call me. Use star sixty-nine\r\n           and find out the number I'm calling\r\n           from and have her call me...\r\n          Donna picks up the phone.\r\n\r\n                          DONNA\r\n           Paul?\r\n\r\n                          PAUL\r\n           Donna.\r\n\r\n                          DONNA\r\n           What do you want?\r\n\r\n                          PAUL\r\n           I need to talk to Linda. Where is\r\n           she?\r\n\r\n                          DONNA\r\n           I don't know. I haven't talked to\r\n           her all day. Call her cell phone.\r\n\r\n                          PAUL\r\n           Are you near a computer or\r\n           something?\r\n\r\n                          DONNA\r\n           Uh...yeah. Why?\r\n\r\n                          PAUL\r\n           Turn it on.\r\n\r\n           23.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          DONNA\r\n           It is on.\r\n\r\n                          PAUL\r\n           Look up the number for the State\r\n           Department for me.\r\n\r\n                          DONNA\r\n           I was just heading out to the\r\n           supermarket. I really don't have\r\n\r\n                          TIME --\r\n\r\n                          PAUL\r\n           Donna, please, please, please --\r\n           just get me the number.\r\n\r\n                          DONNA\r\n           Is everything alright?\r\n\r\n                          PAUL\r\n           No! Everything is not alright!\r\n           So, please, just look up the\r\n           number.\r\n\r\n                          DONNA\r\n           Don't fucking yell at me, Paul.\r\n\r\n                          PAUL\r\n           I'm not yelling!\r\n\r\n                          DONNA\r\n           Yes you are. Just like you did\r\n           last year at the cookout. I'm not\r\n           going to tolerate --\r\n\r\n                          PAUL\r\n\r\n                          (EXPLODING)\r\n           Just get me the fucking number!!\r\n           Get me the number, get me the\r\n           number!!\r\n          Donna hangs up on him. Realizing this, Paul bangs his fists\r\n          and claws at the top of the coffin, bloodying some of his\r\n          fingers and knuckles in the process.\r\n          He violently tosses and turns and screams at the top of his\r\n          lungs, like an animal trapped in a cage. Tears spray from\r\n          his eyes as spit shakes free from his mouth by the force of\r\n          his shudder.\r\n          He eventually calms quite a bit. Sniffing away tears and\r\n          taking notice of the damage he's done to his hands, Paul\r\n          slows his breathing as best he can.\r\n\r\n           24.\r\n\r\n                         \r\n\r\n                         \r\n          He lies there, motionless.\r\n          The silence is almost comforting. Paul closes his eyes,\r\n          regretfully accepting what appears will be his inescapable\r\n          fate.\r\n          After a beat, he calls Donna back. Knowing it is Paul\r\n          calling, she answers right away, attitude at the ready.\r\n\r\n                          DONNA\r\n           What?\r\n          It takes every ounce of Paul's being to keep himself from\r\n          going off the deep end. He takes a beat to compose himself\r\n          and then finally offers a very delicate and deliberate\r\n          response.\r\n\r\n                         \r\n\r\n                          PAUL\r\n           Donna, I'm very sorry I yelled.\r\n           But, I'm only going to ask you once\r\n           more to get me this number. If you\r\n           don't get me this number, I'm going\r\n           to die.\r\n\r\n                          DONNA\r\n           What?\r\n\r\n                          PAUL\r\n           I don't have time to explain.\r\n           Please...the number.\r\n\r\n                          DONNA\r\n\r\n                          (BEAT)\r\n           Hold on.\r\n          We hear Donna put down the phone. In the b.g., we hear the\r\n          sound of keys being pressed on a computer keyboard.\r\n          After a beat, she picks the phone back up.\r\n\r\n                          DONNA (CONT'D)\r\n           Okay...State Department. It's 202-\r\n\r\n           134-4750.\r\n\r\n                          PAUL\r\n\r\n           202-134-4750?\r\n\r\n                          DONNA\r\n           Yeah.\r\n          Paul writes the number on the top of the coffin, beneath the\r\n          man others. He writes the initials \"S.D.\" next to it.\r\n\r\n           25.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          DONNA\r\n           What the hell's going --\r\n          Paul hangs up on Donna mid-sentence. He dials the number the\r\n          State Department right away.\r\n          A STATE DEPARTMENT REP answers after a few rings.\r\n\r\n           STATE DEPARTMENT REP\r\n           United States Department of State.\r\n\r\n                          PAUL\r\n           I'm an American citizen, working in\r\n           Iraq. I've been taken hostage. I\r\n           need to speak to someone right\r\n           away.\r\n\r\n                         \r\n\r\n           STATE DEPARTMENT REP\r\n           Where are you calling from, sir?\r\n\r\n                          PAUL\r\n           From Iraq. I'm a truck driver for\r\n           CRT -- Crestin, Roland and Thomas.\r\n           We were attacked and now I'm being\r\n           held for ransom.\r\n\r\n           STATE DEPARTMENT REP\r\n           Are the kidnappers with you?\r\n\r\n                          PAUL\r\n           No. I'm buried somewhere.\r\n\r\n           STATE DEPARTMENT REP\r\n           You're buried?\r\n\r\n                          PAUL\r\n           Yeah, in a coffin, a wooden box.\r\n           It's an old coffin, I think.\r\n\r\n           STATE DEPARTMENT REP\r\n           Did you try contacting the military\r\n           out there?\r\n\r\n                          PAUL\r\n           I don't have the number.\r\n\r\n           STATE DEPARTMENT REP\r\n           What number?\r\n\r\n                          PAUL\r\n           I was given a number to call, a\r\n           safety number. But the people took\r\n           it.\r\n\r\n           26.\r\n\r\n                         \r\n\r\n                         \r\n\r\n           STATE DEPARTMENT REP\r\n           The people holding you hostage?\r\n\r\n                          PAUL\r\n           Yes.\r\n\r\n           STATE DEPARTMENT REP\r\n\r\n                          (DISCONCERTED)\r\n           I don't know...hold on. Let me\r\n           connect you...hold on.\r\n\r\n                          PAUL\r\n           No. Wait...\r\n          Paul is placed on hold. As he waits, his eyes wander around\r\n          the coffin. He looks at the numbers he has written.\r\n\r\n                         \r\n          After a moment, REBECCA BROWNING, a State Department\r\n          official, picks up the phone.\r\n\r\n                          REBECCA\r\n           Rebecca Browning.\r\n\r\n                          PAUL\r\n           Hello?\r\n\r\n                          REBECCA\r\n           Yes, hello. I was just informed of\r\n           your situation.\r\n\r\n                          PAUL\r\n           Yeah, my situation. I'm running\r\n           out of time and you people keep\r\n           putting me on hold. What the hell\r\n           is wrong with you?\r\n\r\n                         \r\n\r\n                          REBECCA\r\n           I'm sorry.\r\n\r\n                          PAUL\r\n           Don't be sorry. Just help me.\r\n\r\n                          REBECCA\r\n           I just have a few questions for\r\n           you, Mister Conroy.\r\n\r\n                          PAUL\r\n           You've got to be kidding me.\r\n\r\n                          REBECCA\r\n           It's important that I get this\r\n           information. It will make a rescue\r\n\r\n                          ATTEMPT --\r\n\r\n           27.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           Wait, wait, wait...how did you know\r\n           my name?\r\n\r\n                          REBECCA\r\n           I'm sorry?\r\n\r\n                          PAUL\r\n           I never gave you my name. I don't\r\n           think I gave it to the other guy,\r\n           either.\r\n          Rebecca is silent on the other end of the phone.\r\n\r\n                          PAUL (CONT'D)\r\n           What the hell is going on right\r\n           now?\r\n\r\n                         \r\n\r\n                          REBECCA\r\n           (after a beat)\r\n           We received a call from a\r\n           representative at CRT. You left\r\n           him a message?\r\n\r\n                          PAUL\r\n           Yeah...?\r\n\r\n                          REBECCA\r\n           He contacted us right away.\r\n\r\n                          PAUL\r\n           Well, since you know what the hell\r\n           is going on, what have you done to\r\n           get me out of here?\r\n\r\n                          REBECCA\r\n           There's little we can do from\r\n           Washington.\r\n\r\n                          PAUL\r\n           So, that's it? I'm just supposed\r\n           to rot in here because there's\r\n           little you can do?\r\n\r\n                          REBECCA\r\n           No.\r\n\r\n                          PAUL\r\n           Then what?\r\n\r\n                          REBECCA\r\n           I need to know where you were when\r\n           your convoy was ambushed.\r\n\r\n           28.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           In the Diyala Provence. In\r\n           Baqubah.\r\n\r\n                          REBECCA\r\n           Okay. And has contact been made\r\n           with the kidnappers?\r\n\r\n                          PAUL\r\n           Yes. The guy told me that he wants\r\n           five million dollars by nine\r\n           o'clock tonight.\r\n\r\n                          REBECCA\r\n           Or else...?\r\n\r\n                          PAUL\r\n           Or else he'll bring me to Sea\r\n           World. What do you think, lady?\r\n          Even faced with Paul's sarcasm, Rebecca remains stolid.\r\n          Professional.\r\n\r\n                          REBECCA\r\n           We'll do everything we can.\r\n\r\n                          PAUL\r\n           So you'll pay them?\r\n\r\n                          REBECCA\r\n\r\n                          (BEAT)\r\n           No. That we can't do.\r\n\r\n                          PAUL\r\n           Wait...what?\r\n\r\n                         \r\n\r\n                          REBECCA\r\n           It's the policy of the United\r\n           States government to not negotiate\r\n           with terrorists.\r\n\r\n                          PAUL\r\n           To hell with that! It's easy for\r\n           you to worry about policy, you're\r\n           sitting in an air conditioned\r\n           office somewhere, probably\r\n           finishing up your sandwich from\r\n           lunch. You're not the one stuck in\r\n           a coffin, buried in the God damn\r\n           desert!\r\n\r\n                          REBECCA\r\n           I understand your frustration --\r\n\r\n           29.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           Frustration? Lady, I'm going to\r\n           fucking die in here. Understand\r\n           that!\r\n          Rebecca is silent on the other end of the phone. Paul\r\n          wonders if she is still there. The idea of being alone again\r\n          scares him terribly.\r\n\r\n                          PAUL (CONT'D)\r\n           Hello?\r\n          Worried, Paul lights the Zippo. The reflection of the flame\r\n          dances on his frightened eyes.\r\n\r\n                          REBECCA\r\n           I'm here.\r\n\r\n                         \r\n          Momentary relief. After a beat:\r\n\r\n                          PAUL\r\n           Well, then say something. Tell me\r\n           how you're going to get me out of\r\n           here.\r\n\r\n                          REBECCA\r\n           What's the number on the phone\r\n           you're calling from?\r\n\r\n                          PAUL\r\n           I don't know. Did it come up on\r\n           your end?\r\n\r\n                          REBECCA\r\n           No. It's listed as unavailable.\r\n           Do this -- take down this number.\r\n\r\n                         \r\n          Paul takes out his pen.\r\n\r\n                          PAUL\r\n           Go ahead.\r\n\r\n                          REBECCA\r\n\r\n           410-195-5453.\r\n          Paul writes the number onto the top of the coffin.\r\n\r\n                          PAUL\r\n           Who's that?\r\n\r\n                          REBECCA\r\n           Dan Brenner. He's the commander of\r\n           the Hostage Working Group over in\r\n           Iraq.\r\n\r\n           30.\r\n\r\n                         \r\n\r\n                         \r\n          Paul writes \"D. BRENNER\" next to Dan's phone number.\r\n\r\n                          PAUL\r\n           Hostage Working Group?\r\n\r\n                          REBECCA\r\n           We formed it in 2004 to deal with\r\n           situations such as yours.\r\n          Paul shakes his head in disgust.\r\n\r\n                          PAUL\r\n           Situations. I love how you keep\r\n           calling it that.\r\n\r\n                          REBECCA\r\n           Did you write down the number?\r\n\r\n                         \r\n\r\n                          PAUL\r\n           Yeah.\r\n\r\n                          REBECCA\r\n           Good. Hold on, I'll connect you\r\n           with him now. He should be\r\n           expecting you.\r\n\r\n                          PAUL\r\n           What about the news? I'm going to\r\n           call them.\r\n\r\n                          REBECCA\r\n           No. Do not, I repeat, do not\r\n           contact the news.\r\n\r\n                          PAUL\r\n           Why?\r\n\r\n                         \r\n\r\n                          REBECCA\r\n           It will only complicate things\r\n           further and threaten your chances\r\n           of rescue.\r\n          Paul doesn't buy it.\r\n\r\n                          PAUL\r\n           That's bullshit. You're just\r\n           covering your ass.\r\n\r\n                          REBECCA\r\n           No, I'm covering yours. Everyone\r\n           who needs to know about this does.\r\n\r\n           31.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           You don't go looking for something\r\n           if you don't know it's missing.\r\n\r\n                          REBECCA\r\n           That's why you need to contact Dan\r\n           Brenner right away.\r\n          Paul still contemplates contacting the news, but soon\r\n          acquiesces to Rebecca's pleas for him not to.\r\n\r\n                          PAUL\r\n           Fine.\r\n\r\n                          REBECCA\r\n           I'm transferring you now.\r\n\r\n                         \r\n          Rebecca's gone. Paul waits. Several beeps sound as he's\r\n          being transferred.\r\n          Paul hears a faint sound coming from behind him, outside the\r\n          coffin. While the beeps continue to sound, he lights the\r\n          Zippo, circumspectly looking behind him. He doesn't see\r\n          anything.\r\n          With the Zippo still lit, Paul takes a deep, centering\r\n          breath, followed by another.\r\n          A few more long beeps pass before a ring is heard. After two\r\n          rings, DAN BRENNER answers.\r\n\r\n                          DAN\r\n           Brenner.\r\n\r\n                          PAUL\r\n           Dan Brenner?\r\n\r\n                         \r\n          Dan is quick to figure out who it is that must be calling\r\n          him.\r\n\r\n                          DAN\r\n           Is this Paul Conroy?\r\n\r\n                          PAUL\r\n\r\n                          (EXCITED)\r\n           Yes, yes it's me. It's Paul.\r\n\r\n                          DAN\r\n           Paul, I was informed of what's\r\n           going on. I want you to know that\r\n           we're already working on trying to\r\n           get you out of there.\r\n\r\n           32.\r\n\r\n                         \r\n\r\n                         \r\n          Paul is relieved. His first glint of hope has appeared.\r\n          Tears of joy instantly escape his eyes.\r\n\r\n                          PAUL\r\n           Oh, thank you, God.\r\n\r\n                          DAN\r\n           I was told that we have until 9pm.\r\n           Is that right?\r\n\r\n                          PAUL\r\n           That's what he said.\r\n\r\n                          DAN\r\n           Alright. That doesn't give us a\r\n           whole lot of time. And just so I\r\n           have this right, the kidnappers\r\n           buried you in the ground?\r\n\r\n                          PAUL\r\n           Yeah, in an old, wooden coffin.\r\n\r\n                          DAN\r\n           Okay. My guess is that since\r\n           you're able to get a cell signal,\r\n           you're no more than a few feet\r\n           underground.\r\n\r\n                          PAUL\r\n           I don't know. Maybe.\r\n\r\n                          DAN\r\n           What about battery life? How much\r\n           does the phone have left?\r\n          Paul looks at the display to find out.\r\n\r\n                         \r\n\r\n                          PAUL\r\n           Less than half.\r\n\r\n                          DAN\r\n           Okay. You have to conserve that\r\n           battery. Our best bet of finding\r\n           you is by tracking your cell\r\n           signal. Is the ringer set on a\r\n           sound or vibrate?\r\n\r\n                          PAUL\r\n           Vibrate.\r\n\r\n                          DAN\r\n           Press and hold down the asterisk\r\n           key to change it to a ring tone.\r\n           It will use less power.\r\n\r\n           33.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n          What about my Zippo?\r\n\r\n                          DAN\r\n          You have a lighter?\r\n\r\n                          PAUL\r\n          Yeah.\r\n\r\n                          DAN\r\n          Use it to look around for markings,\r\n          a logo -- whatever you can find.\r\n\r\n                          PAUL\r\n          Won't it use up oxygen?\r\n\r\n                          DAN\r\n          Not much. Don't worry about that\r\n          now. Try to find --\r\n\r\n                          PAUL\r\n          It's really dark in here without\r\n          it.\r\n\r\n                          DAN\r\n          I understand, Paul. Try to find\r\n          anything in there that might\r\n          indicate where that coffin was\r\n          made.\r\n\r\n                          PAUL\r\n          You guys have to hurry.\r\n\r\n                          DAN\r\n          We're working as fast as we can,\r\n          Paul.\r\n\r\n                         \r\n\r\n                          PAUL\r\n          Do you know if there were any other\r\n          survivors?\r\n\r\n                          DAN\r\n          From your convoy?\r\n\r\n                          PAUL\r\n          Yeah.\r\n\r\n                          DAN\r\n          That's still unclear at this point.\r\n\r\n                          PAUL\r\n          I just wanted to do right by my\r\n          family. That's all.\r\n\r\n                          (MORE)\r\n\r\n           34.\r\n\r\n                          PAUL (CONT'D)\r\n           I didn't know it was going to be\r\n           like this over here.\r\n\r\n                          DAN\r\n           I don't think any of us did.\r\n          While on the phone with Brenner, Paul gets another call\r\n          coming in. He checks the display and reads the number.\r\n          Matching it against a number he wrote on the top of the\r\n          coffin, he sees that is Jabir calling.\r\n\r\n                          PAUL\r\n           It's him. He's calling.\r\n\r\n                          DAN\r\n           The kidnapper?\r\n\r\n                         \r\n\r\n                          PAUL\r\n           Yeah. What do I do?\r\n\r\n                          DAN\r\n           You know his number?\r\n\r\n                          PAUL\r\n           Yeah.\r\n\r\n                          DAN\r\n           Give it to me.\r\n\r\n                          PAUL\r\n           What about the call?\r\n\r\n                          DAN\r\n           Give me the number first.\r\n          The phone has rung several times. Paul fears that Jabir may\r\n          hang up.\r\n\r\n                          PAUL\r\n           He's going to hang up.\r\n\r\n                          DAN\r\n           Take the call.\r\n\r\n                          PAUL\r\n\r\n                          BUT --\r\n\r\n                          DAN\r\n           Take the call. Now.\r\n          Paul complies with Dan's demand and switches to the other\r\n          line.\r\n\r\n           35.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           Hello.\r\n\r\n                          JABIR\r\n           Two hour, six minute.\r\n          Paul looks at his watch. Indeed, he has but two hours and\r\n          six minutes until the time reaches 9pm.\r\n\r\n                          PAUL\r\n           You have to give me more time.\r\n\r\n                          JABIR\r\n           You talk to embassy? They give\r\n           money?\r\n\r\n                          PAUL\r\n           Yes. No. I talked to...someone.\r\n           Government. They said that they\r\n           won't pay the money.\r\n\r\n                          JABIR\r\n           No pay?\r\n\r\n                          PAUL\r\n           No. They said that they don't\r\n           negotiate with terrorists.\r\n\r\n                          JABIR\r\n           Terrorists? I am terrorist?\r\n\r\n                          PAUL\r\n           Yes. You are terrorist, you son of\r\n           a bitch.\r\n\r\n                          JABIR\r\n           You are terrified, so I am\r\n           terrorist?\r\n\r\n                          PAUL\r\n           What did I ever do to you?\r\n\r\n                          JABIR\r\n           Ever do?\r\n\r\n                          PAUL\r\n           Yeah. I'm here because it's a job,\r\n           to make money. That's it.\r\n\r\n                          JABIR\r\n           I have job until you come. Now, my\r\n           family have nothing.\r\n\r\n           36.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           That's not my fault!\r\n          Jabir retorts with a spirited conviction similar to Paul's.\r\n\r\n                          JABIR\r\n           Nine, one, one was not my fault,\r\n           but still you are here! Saddam was\r\n           not my fault, but still you are\r\n           here!\r\n\r\n                          PAUL\r\n           I told you, I'm only here to work.\r\n           To help rebuild.\r\n\r\n                          JABIR\r\n           Rebuild what you destroyed.\r\n\r\n                         \r\n          Paul cannot handle his stress any longer. He begins to\r\n          crumble under the pressure.\r\n\r\n                          PAUL\r\n           Stop! Just please, stop! I'm just\r\n           a guy. I'm just a truck driver.\r\n           Okay? I'm nobody that makes\r\n           decisions about anything. I just\r\n           want to go home.\r\n          Silence from the other end of the phone for an extended\r\n          period of time.\r\n\r\n                          JABIR\r\n           You make video, ransom video.\r\n          This surprisingly comes as good news to Paul.\r\n\r\n                         \r\n\r\n                          PAUL\r\n           Yes. Please. Get me out of here\r\n           and I'll make the video.\r\n\r\n                          JABIR\r\n           No. You make video now.\r\n\r\n                          PAUL\r\n           What...? How?\r\n\r\n                          JABIR\r\n           You use video on phone.\r\n          Paul's hopes are dashed. His sanguine head falls back onto\r\n          the coffin floor.\r\n\r\n           37.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          JABIR (CONT'D)\r\n           Near foot. You read note near foot\r\n           in box.\r\n          Paul shines the flame of his Zippo lighter toward his feet.\r\n          He doesn't see anything.\r\n\r\n                          PAUL\r\n           Where? I don't see --\r\n\r\n                          JABIR\r\n           Near foot. Read note inside box.\r\n          Paul repositions his legs as best he can. He can vaguely see\r\n          the corner of a small metal box, partially sticking out of a\r\n          broken plank on the bottom of the coffin.\r\n\r\n                         \r\n\r\n                          PAUL\r\n           The video...if I make it, will you\r\n           let me go?\r\n\r\n                          JABIR\r\n           Only if we get money.\r\n\r\n                          PAUL\r\n           Nobody's going to pay five million\r\n           dollars for me.\r\n\r\n                          JABIR\r\n           We take less. One million money.\r\n\r\n                          PAUL\r\n           If they pay it, will you let me go?\r\n\r\n                          JABIR\r\n           (after a beat)\r\n           One million money.\r\n          Jabir hangs up, ending the call.\r\n          Paul sits motionless for a moment, soaking in all that Jabir\r\n          has just told him.\r\n          He again looks down toward his feet. He can see the\r\n          protruding corner of the metal box, but it's positioned in\r\n          such a way that it will clearly not be easy for him to reach\r\n          it.\r\n          Paul then tries to clasp the box with his feet, but after\r\n          several unsuccessful attempts, he realizes that a new\r\n          strategy is necessary.\r\n\r\n           38.\r\n\r\n                         \r\n\r\n                         \r\n          He makes efforts to reposition himself in the coffin, so that\r\n          his head and feet will ultimately switch places. He\r\n          struggles, inch by troubled inch, to make this maneuver.\r\n          Sweat pours down the side of his face. The extremely tight\r\n          quarters of the coffin make the repositioning nearly\r\n          impossible.\r\n          After expending a great deal of energy doing so, Paul\r\n          eventually completes the turn of his body. He examines the\r\n          small, rusted metal box. On it is a cartoon picture of a\r\n          small Arab boy and girl playing with a red rubber ball.\r\n          Skeptical at first, Paul carefully examines the box and\r\n          shakes it gently. Items are heard rummaging inside.\r\n          He carefully opens it. A fluorescent green light shines from\r\n          inside.\r\n          Paul looks inside and finds a lit, green glow stick,\r\n          fluorescing brightly and now illuminating much of the coffin.\r\n          He closes the lid of the Zippo. Removes the stick.\r\n          Looking into the small box again, he finds several other\r\n          items: a small, disused flashlight; a second, unlit glow\r\n          stick; a jackknife; and lastly, a folded piece of paper.\r\n          He slowly unfolds the piece of paper. We see that his ransom\r\n          message is written in an unintelligible mix of English and\r\n          Arabic.\r\n          Paul shakes his head and lets out a sigh of disgust. He\r\n          crumbles up the paper into a ball and listlessly drops it to\r\n          his side. He covers his face with his hands, his labored\r\n          breaths echoing in his palms.\r\n\r\n                         \r\n          Under the low-light of the green glow stick, Paul picks up\r\n          the phone and dials his home.\r\n          Per usual, he gets the answering machine. His son, Shane, is\r\n          heard on outgoing message.\r\n\r\n                          SHANE\r\n           Thanks for calling the Conroy's.\r\n           We're not home right now. Please\r\n           leave a message at the beep.\r\n           Thanks.\r\n          Paul's eyes well up with tears. He smiles at the sound of\r\n          his son's voice. The Beep is heard. Paul hangs up without\r\n          leaving a message.\r\n          He looks at the time. It's 7:02pm. Battery life is holding\r\n          steady at one and a half bars. He remembers something.\r\n\r\n           39.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           Shit.\r\n          Paul presses and holds down the shortcut button on the phone\r\n          that changes the ringer from vibrate to an audible tone.\r\n          The glow stick begins to slowly fade.\r\n          Paul dials Dan Brenner.\r\n          After a few rings, Dan answers.\r\n\r\n                          DAN\r\n           Paul?\r\n\r\n                          PAUL\r\n           Here's his number...\r\n\r\n                         \r\n          Paul presses the green key, bringing up the last numbers\r\n          dialed and received.\r\n\r\n                          DAN\r\n           Hold on. Alright, go ahead.\r\n\r\n                          PAUL\r\n           It's 07902-24-921.\r\n          Dan says something to someone who is in the room with him,\r\n          and then returns his attention to Paul.\r\n\r\n                          DAN\r\n           This is huge. Unless they're using\r\n           a cloned line, we should be able to\r\n           find where this is coming from in\r\n           minutes.\r\n\r\n                         \r\n\r\n                          PAUL\r\n           What about me? Can you track my\r\n           cell signal?\r\n\r\n                          DAN\r\n           We're having a lot of trouble with\r\n           yours. Seems to be an EDS line,\r\n           probably through one of the\r\n           Egyptian carriers.\r\n\r\n                          PAUL\r\n           What does that mean?\r\n\r\n                          DAN\r\n           That...it's not going to be easy.\r\n\r\n                          PAUL\r\n           He wants me to make a ransom video.\r\n\r\n           40.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          DAN\r\n           No. Hold off for as long as you\r\n           can.\r\n\r\n                          PAUL\r\n           If it's going to get me out of\r\n           here, I'm making it.\r\n\r\n                          DAN\r\n           The last thing we want is for this\r\n           to end up all over Al Jazeera.\r\n\r\n                          PAUL\r\n           We?\r\n          Paul becomes angry, again sensing that more emphasis is being\r\n          placed on containing the situation than rescuing him.\r\n\r\n                         \r\n\r\n                          DAN\r\n           This can't turn into an\r\n           international incident.\r\n\r\n                          PAUL\r\n           That's all you people care about!\r\n           But what about me? Don't you care\r\n           about me?\r\n\r\n                          DAN\r\n           We do. That's why we're --\r\n\r\n                          PAUL\r\n           No you don't! You people don't\r\n           care about any of us. I've had\r\n           eight friends killed out here, six\r\n           of them today. We don't have any\r\n           guns, any armor. Nothing.\r\n\r\n                         \r\n\r\n                          DAN\r\n           You're not soldiers.\r\n\r\n                          PAUL\r\n           Tell that to the people who put me\r\n           in this box! Tell that to the\r\n           people who shot my friends!\r\n\r\n                          DAN\r\n           We're doing the best we can.\r\n\r\n                          PAUL\r\n           No, you're not. All you people\r\n           understand are your secret plans\r\n           and your back room politics.\r\n\r\n                          (MORE)\r\n\r\n           41.\r\n\r\n                          PAUL (CONT'D)\r\n           If I were some diplomat or\r\n           something, maybe even a hostage\r\n           working group leader -- or whatever\r\n           your fancy title is, I'd be out of\r\n           here by now. Wouldn't I? But I'm\r\n           not, so I'm just supposed to keep\r\n           my mouth shut and die.\r\n\r\n                          DAN\r\n           I need you to stay focused, Paul.\r\n\r\n                          PAUL\r\n           Fuck you.\r\n          Dan's heard enough.\r\n\r\n                          DAN\r\n           Paul, listen to me: finding you is\r\n           our primary concern. Bottom line.\r\n           And we're searching just as hard as\r\n           we would be for a four-star\r\n           general, so don't literally waste\r\n           your breath suggesting otherwise.\r\n          Paul does not respond at first. Dan's retort clearly has an\r\n          effect on him.\r\n\r\n                          PAUL\r\n           Who are they? The people who put\r\n           me here?\r\n\r\n                          DAN\r\n           They're just that -- people. No\r\n           different from you and me.\r\n\r\n                          PAUL\r\n           I'm no terrorist.\r\n\r\n                          DAN\r\n           Neither are they.\r\n\r\n                          PAUL\r\n           How do you know that?\r\n\r\n                          DAN\r\n           If you were homeless,\r\n           starving...actually, I take that\r\n           back. If your family was homeless\r\n           and starving, what would you do for\r\n           them?\r\n\r\n                          PAUL\r\n           I wouldn't kill someone.\r\n\r\n           42.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          DAN\r\n           How can you be sure?\r\n\r\n                          PAUL\r\n\r\n                          (GETTING FRUSTRATED)\r\n           What difference does it make?\r\n\r\n                          DAN\r\n           They're criminals, desperate ones\r\n           at that. They don't care about\r\n           anything other than getting the\r\n           money.\r\n\r\n                          PAUL\r\n           So pay them, then.\r\n\r\n                          DAN\r\n           Trust me, if it was an option, I\r\n           would do that in a heartbeat.\r\n\r\n                          PAUL\r\n           How many others have there been?\r\n\r\n                          DAN\r\n           Since I got here? Hundreds.\r\n           Journalists, contractors,\r\n           soldiers...hundreds have been\r\n           taken. It's one of the only\r\n           functioning businesses out here.\r\n\r\n                          PAUL\r\n           How many have you rescued?\r\n          Dan is reluctant to answer the question.\r\n\r\n                          PAUL (CONT'D)\r\n           How many?\r\n\r\n                          DAN\r\n\r\n                          (BEAT)\r\n           Not many.\r\n\r\n                          PAUL\r\n           Tell me their names.\r\n\r\n                          DAN\r\n           Who?\r\n\r\n                          PAUL\r\n           Any of them. Make me know they\r\n           really do matter to you.\r\n\r\n                          DAN\r\n           Mark White.\r\n\r\n           43.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           Who was Mark White?\r\n\r\n                          DAN\r\n           A kid from New Hampshire. Twenty-\r\n           six years old. Med student. Came\r\n           over here to help out local\r\n           doctors.\r\n\r\n                          PAUL\r\n           What happened to him?\r\n\r\n                          DAN\r\n           Insurgents grabbed him.\r\n\r\n                          PAUL\r\n           When?\r\n\r\n                         \r\n\r\n                          DAN\r\n           About three weeks ago.\r\n          Paul writes \"MARK WHITE\" on the top of the coffin, below the\r\n          list of phone numbers. He circles the name.\r\n\r\n                          PAUL\r\n           You remember his name.\r\n\r\n                          DAN\r\n           I remember all their names.\r\n\r\n                          PAUL\r\n           (afraid to ask)\r\n           Did he...? Is he...?\r\n          The glow stick begins to fade.\r\n\r\n                         \r\n\r\n                          DAN\r\n           Yeah. Yeah, Paul, he's alive.\r\n          Hearing this affords Paul some semblance of relief.\r\n          Paul shakes the glow stick, returning it to its full\r\n          strength.\r\n\r\n                          PAUL\r\n           Where is he?\r\n\r\n                          DAN\r\n           Home. Probably happy to be back at\r\n           school.\r\n\r\n                          PAUL\r\n           I want to get out of here.\r\n\r\n           44.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          DAN\r\n           We found him; we'll find you, too.\r\n\r\n                          PAUL\r\n           How?\r\n\r\n                          DAN\r\n           We already have a solid lead on the\r\n           number you gave us.\r\n\r\n                          PAUL\r\n           You do?\r\n\r\n                          DAN\r\n           A unit's on it's way over there\r\n           now.\r\n\r\n                         \r\n          This news calms Paul's nerves.\r\n\r\n                          PAUL\r\n           That's...that's good.\r\n\r\n                          DAN\r\n           Yeah.\r\n\r\n                          PAUL\r\n           What should I do in the meantime?\r\n\r\n                          DAN\r\n           I know it's hard, but try to relax.\r\n           The more worked up you are, the\r\n           more air you're going to use.\r\n\r\n                          PAUL\r\n           I can't help it. I'm always\r\n           anxious. I take pills for it.\r\n\r\n                         \r\n\r\n                          DAN\r\n           Do you have them with you?\r\n          Paul checks his pants pockets. He removes a small, orange\r\n          pill bottle.\r\n\r\n                          PAUL\r\n           Yeah.\r\n\r\n                          DAN\r\n           Take them. You need to preserve\r\n           your oxygen level any way you can.\r\n\r\n                          PAUL\r\n           Okay.\r\n\r\n           45.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          DAN\r\n           Is your Zippo still lit.\r\n\r\n                          PAUL\r\n           Not now.\r\n\r\n                          DAN\r\n           Good.\r\n\r\n                          PAUL\r\n           I feel nauseous.\r\n\r\n                          DAN\r\n           You have to calm down.\r\n\r\n                          PAUL\r\n           I'm trying.\r\n\r\n                         \r\n\r\n                          DAN\r\n           And you need to save that battery.\r\n           We're expecting some intel in about\r\n           ten minutes. Call me back then.\r\n\r\n                          PAUL\r\n           Okay.\r\n\r\n                          DAN\r\n           Just hang in there, Paul.\r\n          The glow stick begins to slowly fade. Paul shakes it,\r\n          causing it to brighten only momentarily before dimming again.\r\n\r\n                          PAUL\r\n           Yeah. I'm trying.\r\n          Dan ends the call. Paul lets out a deep breath, finding it\r\n          difficult to lay claim to its replacement.\r\n          He looks at his watch. It's now 7:18pm. The ticking sound\r\n          of the second hand turning is inordinately loud, due to the\r\n          extreme silence of the coffin.\r\n          Just then, the cell phone rings. Checking the number on the\r\n          display, Paul sees that it is Jabir.\r\n          Paul answers.\r\n\r\n                          PAUL\r\n           What?\r\n\r\n                          JABIR\r\n           Did you make video?\r\n\r\n           46.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           No.\r\n          Jabir yells something in Arabic to the other Iraqi men we\r\n          hear in the background.\r\n          Collectively, they do not sound pleased. Slightly panicked,\r\n          in fact, though it is difficult to tell for sure.\r\n\r\n                          JABIR\r\n\r\n                          (TO PAUL)\r\n           You make video!\r\n\r\n                          PAUL\r\n           Let me out and I'll make it.\r\n\r\n                          JABIR\r\n           No! You make video now. In box.\r\n\r\n                          PAUL\r\n           I can't. I can't read the paper.\r\n\r\n                          JABIR\r\n           Make video now!\r\n\r\n                          PAUL\r\n           I can't. I don't know what you\r\n           want me to say. I can't read the\r\n           paper.\r\n          Jabir is heard speaking with the men we hear arguing in the\r\n          background. Although they speak in Arabic, it is clear from\r\n          their tone that they are becoming worried and increasingly\r\n          hostile.\r\n          Jabir returns his attention back to Paul.\r\n\r\n                         \r\n\r\n                          JABIR\r\n           You make video now.\r\n          Jabir ends the call. Paul closes the phone to help conserve\r\n          battery life.\r\n          He then reopens the phone and scrolls through the menu\r\n          options. Everything is written in Arabic. He eventually\r\n          comes across an icon with a movie camera -- the video\r\n          function. He turns it on. Looks at himself though the\r\n          viewfinder.\r\n          After a beat, he closes the phone, clearly frustrated and\r\n          growing more panicked. His breaths grow heavy and rapid,\r\n          utilizing a great deal of oxygen.\r\n\r\n           47.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           I'm never getting out of here.\r\n          Paul begins to freak out, restlessly squirming inside the\r\n          coffin and pressing against the sides and top.\r\n          The glow stick fades out almost completely, offering very\r\n          little light. Paul shakes it, but with no change to its\r\n          brightness. Moments later, it dies. Paul tries the\r\n          flashlight. Click-click. Click-click. Nothing.\r\n          He bangs it a few times with his hand. The white light turns\r\n          on, but quickly turns back off. He twists the top, which\r\n          causes the flashlight to switch bulbs. A red beam emits\r\n          momentarily. Paul twists the top again and gives the\r\n          flashlight a few good whacks.\r\n\r\n                         \r\n          It turns on. White light shines dimly on his face.\r\n          He takes a breath.\r\n          In efforts to calm himself, he once again removes the orange\r\n          pill bottle from his pocket. He pours two into his hand. He\r\n          then removes his small, metal alcohol flask from his back\r\n          pocket and takes a large swig, swallowing the two pills in\r\n          the process.\r\n          Still, Paul's heavy, labored breathing continues. He drops\r\n          four additional pills into his and swallows them with yet\r\n          another generous pull from the flask.\r\n          He sits and waits. Nothing is happening, except that his\r\n          extremely limited time keeps passing.\r\n          After a moment, Paul picks up the cell phone. He holds it in\r\n          front of him, hesitant to make a call. After some\r\n          consideration, he dials.\r\n          After a few rings, a NURSING HOME NURSE answers.\r\n\r\n           NURSING HOME NURSE\r\n           Mountain View Nursing Home.\r\n\r\n                          PAUL\r\n           I was hoping I could speak with\r\n           Maryanne Conroy, please.\r\n\r\n           NURSING HOME NURSE\r\n           Um...okay. Ah...let me bring the\r\n           cordless phone to her room. Hold\r\n           on a moment, please.\r\n          We hear the Nurse walk down the tiled corridor floor. She\r\n          soon reaches Paul's mother's room.\r\n\r\n           48.\r\n\r\n                         \r\n\r\n                         \r\n\r\n           NURSING HOME NURSE (CONT'D)\r\n           Misses Conroy, you have a telephone\r\n           call, dear. Here, you can use this\r\n           phone.\r\n          Paul's mother, MARYANNE, answers. Her voice is pleasant but\r\n          confused. It's clear that she suffers from advanced stages\r\n          of Alzheimer's Disease.\r\n\r\n                          MARYANNE\r\n           Hello?\r\n\r\n                          PAUL\r\n           Mom...it's Paul.\r\n\r\n                          MARYANNE\r\n           Who?\r\n\r\n                         \r\n\r\n                          PAUL\r\n           It's Paul, Mom. Your son.\r\n\r\n                          MARYANNE\r\n           My son?\r\n\r\n                          PAUL\r\n           It's okay, Mom. How are you?\r\n\r\n                          MARYANNE\r\n           I'm fine.\r\n\r\n                          PAUL\r\n           That's good.\r\n\r\n                          MARYANNE\r\n           Who are you?\r\n\r\n                         \r\n\r\n                          PAUL\r\n           It's your son, Mom. It's Paulie.\r\n\r\n                          MARYANNE\r\n           Paulie?\r\n\r\n                          PAUL\r\n           Yeah. Remember? We lived over on\r\n           Colfax Street, in the duplex.\r\n           Remember?\r\n\r\n                          MARYANNE\r\n\r\n                          (REMEMBERING SLIGHTLY)\r\n           Paulie?\r\n\r\n                          PAUL\r\n           That's right, Mom.\r\n\r\n           49.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          MARYANNE\r\n           Is this Paulie?\r\n\r\n                          PAUL\r\n           It is, Mom. It's Paulie. How's\r\n           everything at the home?\r\n\r\n                          MARYANNE\r\n           Very nice. Your father and I have\r\n           been playing gin rummy every night.\r\n          It's almost too much for Paul to take. He cries silent tears\r\n          over a heartbroken smile.\r\n\r\n                          PAUL\r\n           Yeah...I don't think Pop's there\r\n           with you, Mom.\r\n\r\n                         \r\n\r\n                          MARYANNE\r\n           How are you doing, sweetie?\r\n\r\n                          PAUL\r\n           Not very good. This...uh, this may\r\n           be the last time I talk to you.\r\n\r\n                          MARYANNE\r\n           That's nice, honey.\r\n\r\n                          PAUL\r\n           Did you get the flowers I sent a\r\n           few months ago?\r\n\r\n                          MARYANNE\r\n           Flowers?\r\n\r\n                          PAUL\r\n           Yeah, I sent...never mind. Listen,\r\n           I...I'm going to go now. I just\r\n           wanted to talk to you, you know,\r\n           just to say bye. I love you, Mom.\r\n          Maryanne doesn't respond.\r\n\r\n                          PAUL(CONT'D)\r\n           Did you hear me? Mom? I told\r\n           you...do you want to tell me you\r\n\r\n                          LOVE --\r\n\r\n                          MARYANNE\r\n           Yes, dear. Your father and I have\r\n           been playing gin rummy every night.\r\n\r\n           50.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           (after a beat)\r\n           Okay, Mom. Tell Pop I said hi.\r\n          Paul ends the call and instantly begins crying his heart out.\r\n          He lays there, sobbing relentlessly.\r\n          After a long beat, the cell phone rings. Decidedly different\r\n          than his past reactions to an incoming call, Paul seems\r\n          hopelessly disinterested. The ring is maddening.\r\n          He mindlessly presses the shortcut button, resetting the ring\r\n          to vibrate mode.\r\n          He eventually picks up the phone, but there is not anyone on\r\n          the other end. It's then that he sees that it was not a call\r\n          that came in, but instead was a picture message.\r\n          Pressing what appears to be the Accept button, the incoming\r\n          picture begins to download.\r\n          Several seconds later, the picture downloads and an image\r\n          appears on the display of Paul's cell phone. It's of a woman\r\n          -- bound and gagged, a gun pressed against the side of her\r\n          head.\r\n\r\n                          PAUL\r\n           Oh no. No, no, no!\r\n          Paul frantically dials the number to reach Jabir. As soon as\r\n          the phone connects, Paul begins his desperate plea.\r\n\r\n                          JABIR\r\n           Video make?\r\n\r\n                         \r\n\r\n                          PAUL\r\n           Let her go. Please. Please don't\r\n           hurt her.\r\n          The Woman is heard in the background of Jabir's phone, crying\r\n          muffled words through her muzzled mouth.\r\n\r\n                          JABIR\r\n           We shoot her if you no make video.\r\n\r\n                          PAUL\r\n           No! No, please no shoot. No shoot\r\n           her.\r\n\r\n                          JABIR\r\n           You get money. American million.\r\n\r\n           51.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           I will, I promise. Just don't\r\n           shoot her. She's a mother, she's\r\n           got two kids.\r\n\r\n                          JABIR\r\n           Two kids?\r\n\r\n                          PAUL\r\n           Yes. She has two kids.\r\n\r\n                          JABIR\r\n           I have five. Now only one. You\r\n           make video. Now!!\r\n\r\n                          PAUL\r\n           Wait...\r\n\r\n                         \r\n\r\n                          JABIR\r\n           No wait!! I give three seconds.\r\n\r\n                          PAUL\r\n           I can't read the paper.\r\n\r\n                          JABIR\r\n           Three...\r\n\r\n                          PAUL\r\n           No. Wait!\r\n\r\n                          JABIR\r\n           Two...\r\n\r\n                          PAUL\r\n           I don't know what you want me to\r\n           say!\r\n\r\n                         \r\n\r\n                          JABIR\r\n           One.\r\n\r\n                          PAUL\r\n           Okay! Okay, I'll make the video.\r\n           Just, please, don't shoot.\r\n          Jabir does not fire his gun. Paul attempts to catch his\r\n          breath.\r\n\r\n                          PAUL (CONT'D)\r\n           I need to hang up to make the\r\n           video. Okay? Is that okay?\r\n\r\n                          JABIR\r\n           You have three minute to send\r\n           video.\r\n\r\n           52.\r\n\r\n                         \r\n\r\n                         \r\n          Jabir hangs up, ending the call.\r\n          Paul reaches for the balled-up piece of paper that has the\r\n          ransom script written on it. It takes some trouble for him\r\n          to grab it, but he is soon able to.\r\n          Placing the flashlight next to the paper, Paul is again\r\n          reminded of the incoherent nature of the script.\r\n\r\n                          PAUL\r\n           (re: the script)\r\n           Fuck...\r\n          He drops the paper to his side and opens the phone, setting\r\n          it to the video record function. He places the flashlight\r\n          close to his face so as to make his image more visible on the\r\n          small, phone display screen.\r\n\r\n                         \r\n          He presses the record button.\r\n\r\n                          PAUL\r\n           (speaking at the phone)\r\n           My name is Paul Conroy. I'm an\r\n           American citizen from Hastings,\r\n           Michigan. I'm a civilian truck\r\n           driver for Crestin, Roland and\r\n           Thomas. I've been taken hostage\r\n           somewhere in Iraq...and I need one\r\n           million dollars by nine o'clock\r\n           tonight, Baghdad time, or else I'll\r\n           be left to die in this coffin I'm\r\n           buried in. I've been told that\r\n           if...\r\n          The flashlight goes out. Paul continues speaking in the\r\n          darkness. After a few quick smacks, the flashlight turns\r\n          back on.\r\n\r\n                          PAUL (CONT'D)\r\n           ...the money is paid, I will be let\r\n           go. If it's not, I will die in\r\n           here. These threats are real and\r\n           will be followed through on.\r\n          Trying to think of more to say, Paul soon opts for not saying\r\n          anything further. He saves the message and then sends it to\r\n          Jabir.\r\n          We see that the screen displays an icon confirming the video\r\n          has been sent.\r\n          Paul places the phone on his chest. Still rubbing his\r\n          temples, his eyes begin to flutter a bit. He tries to\r\n          control his breathing and remain calm.\r\n\r\n           53.\r\n\r\n                         \r\n\r\n                         \r\n          He opens the phone and displays the photo of the Woman. He\r\n          stares admiringly at her, hoping dearly that she will not be\r\n          harmed.\r\n          The effects of the anxiety pills finally taking effect, his\r\n          eyes soon close and he drifts off to sleep.\r\n\r\n                          FADE TO:\r\n\r\n          INT. COFFIN - LATER\r\n\r\n          Darkness once again. We hear the sound of Paul slowly\r\n          awaking, followed the sight of Zippo sparks.\r\n          It doesn't catch. The second glow stick is snapped,\r\n          illuminating the coffin with a fluorescent green hue.\r\n\r\n                         \r\n          Paul starts to move, but suddenly freezes. His eyes widen.\r\n          His pupils dilate. Something is clearly very wrong, though\r\n          we cannot see what.\r\n          His eyes slowly shift downward, as if watching something move\r\n          down his body. Beads of sweat form across his brow. His\r\n          measured breaths are held for as long as they can be.\r\n          Moving excruciatingly slow, Paul lowers the glow stick toward\r\n          what he is looking at.\r\n          A shape moves across his stomach, underneath his T-shirt.\r\n          Paul's eyes are fixed on whatever it may be. He cautiously,\r\n          slowly, moves the glow stick even closer.\r\n          The shape disappears just as the light of the glow stick\r\n          shines on whatever it may be. Still, Paul does not dare make\r\n          any sudden move.\r\n\r\n                         \r\n          Paul's pant leg moves slightly, starting at the top, slowly\r\n          undulating toward his cuff.\r\n          Paul leans the glow stick in further. And further.\r\n          Carefully. Moving a millimeter at a time. He shifts the\r\n          position of his head slightly, charily, to see next to his\r\n          feet.\r\n          He leans in even closer with the glow stick. But then --\r\n          -- his wary movement comes to immediate stop.\r\n          It's a snake. A two-foot, saw-scaled viper. It has\r\n          positioned itself in the corner of the coffin, inches from\r\n          Paul's feet.\r\n\r\n           54.\r\n\r\n                         \r\n\r\n                         \r\n          His terror evident, Paul very slowly pulls his feet back\r\n          toward his upper body, away from the snake. The confined\r\n          space offers little room for safety.\r\n          The snake turns its muscled neck to face Paul. Their eyes\r\n          meet for the first time. The snake hisses, poised to strike\r\n          at any moment. Paul raises his foot. Steels himself.\r\n          Prepares to preempt the snake with a solid stomp.\r\n          A more sensible plan soon prevails. After lowering his foot,\r\n          Paul cautiously removes the flask from his pocket. Slowly\r\n          unscrews the top. Splashes a small amount of alcohol on the\r\n          floor, close to the snake.\r\n          The snake recoils slightly, but then menacingly twists itself\r\n          into a new posture, ready to attack. Paul lowers the Zippo\r\n          to the small puddle of alcohol. After a few sparks --\r\n\r\n                         \r\n          -- it lights. A flash-fire. The snake flails and hisses\r\n          wildly at the other side of a small fire wall.\r\n          The flame soon goes out. Paul moves fast. Throws more\r\n          alcohol, this time some of it lands on the snake itself. He\r\n          places the already lit Zippo against the puddle of alcohol\r\n          near the snake.\r\n          Another flash-fire, this time burning the snake. It hisses\r\n          loudly. Threateningly. It swings back and forth,\r\n          challenging the small wall of fire.\r\n          The fire soon extinguishes. The snake burrows into the hole\r\n          from where it likely entered the coffin, disappearing into it\r\n          with haste.\r\n          Paul hurriedly stuffs the hole with his discarded button-down\r\n          shirt. He then pours a small amount of alcohol over the\r\n          shirt and temporarily puts the flask on the ground, but does\r\n          not screw the cap on securely. He then wedges the lit Zippo\r\n          between a small space between two wooden planks.\r\n          With the snake situation handled, Paul finally lets out a\r\n          sigh of relief. Rubs his eyes. Tries to regain his\r\n          faculties. Looks over the list of phone numbers written\r\n          above him.\r\n          Suddenly, the cell phone vibrates. Paul frenziedly searches\r\n          for it, but he cannot find it. He then notices it has fallen\r\n          into the small hole near his feet, out of his reach.\r\n          He makes several attempts to grab the phone with his feet,\r\n          but he is unable to do so. It continues to ring.\r\n          His next efforts involve repositioning himself in the coffin\r\n          so that he completely turns to face the opposite end.\r\n\r\n           55.\r\n\r\n                         \r\n\r\n                         \r\n          Struggling through each move, Paul painstakingly begins to\r\n          turn himself. While turning, however, he inadvertently kicks\r\n          the Zippo from the side of the coffin -- landing it on the\r\n          floor, up against the glow stick -- and knocks over the\r\n          flask.\r\n          We see that the flame of the Zippo slowly melts the plastic\r\n          glow stick, causing it to dim slightly.\r\n          Worst still, and completely unbeknownst to Paul, a stream of\r\n          alcohol slowly makes its way from the flask and toward the\r\n          flame of the lighter, threatening to set the coffin ablaze.\r\n          Inch by inch, the flammable spirit gets closer.\r\n          Still in the midst of his repositioning, Paul looks back and\r\n          sees the alcohol nearing the flame. In a panic, he attempts\r\n          to reach and grab the Zippo. But, he finds himself stuck in\r\n          the middle of the coffin. He can't budge either way.\r\n\r\n                          PAUL\r\n           No, no, no!!\r\n          Desperately straining every muscle in his body, he extends\r\n          his arm backward toward the Zippo, hoping to move it away\r\n          from the spilled alcohol. He still can't reach it, yet he\r\n          tries with all his might.\r\n          The phone stops ringing. He has missed the call.\r\n          He tries blowing at the flame, but his head is too far away\r\n          and his breath is not strong enough to do much more than\r\n          cause it to flicker.\r\n          With the alcohol now mere inches away from the flame, Paul\r\n          reaches for his shoe. His odd positioning makes reaching his\r\n          foot almost impossible. He struggles to undo the laces and\r\n          remove it from his foot.\r\n          With his face beet red from the force of his strain, Paul\r\n          finally removes his shoe. The mere inch of leg room this\r\n          creates allows him to slide his leg out from under him.\r\n          The trail of alcohol is just about to come into contact with\r\n          the flame --\r\n          -- but Paul deftly maneuvers his body just in time to\r\n          awkwardly kick the Zippo out of the way and close the lid.\r\n          Paul breaths an enormous sigh of relief as he sits in the dim\r\n          light of the damaged glow stick. He notices another hole in\r\n          the coffin. As a precaution, he stuffs it with the cloth\r\n          that had previously been used to gag him.\r\n\r\n           56.\r\n\r\n                         \r\n\r\n                         \r\n          Just as he is about to grab the phone, he hears what appears\r\n          to be the faint sound of a Muslim call to prayer being\r\n          announced over the citywide PA system. The sound barely\r\n          makes its way through the hundreds of pounds of sand that\r\n          envelop the coffin.\r\n          A sign of hope, as well as a point of reference for his\r\n          location -- albeit a very vague one.\r\n          He listens further as the call to prayer continues. The\r\n          light of the glow stick dims further.\r\n          Paul then opens his phone. Sees that he missed Jabir's call.\r\n          He starts to call Jabir back, but stops. He instead\r\n          navigates through the various display menus. He soon reaches\r\n          what appears to be the Tools Menu, though it's difficult to\r\n          tell because everything is written in Arabic. He becomes\r\n          frustrated as he fails to find what he is looking for.\r\n          On the verge of mental surrender, he sees something that\r\n          gives him pause. A smile crosses his face.\r\n\r\n                          PAUL\r\n           (re: the phone screen)\r\n           There you are.\r\n          We see, on the display of the phone, that Paul has found a\r\n          listing of languages. He scrolls past many -- \"FRANCAIS,\r\n          DETSCHE, ESPANOL\" -- stopping at \"ENGLISH.\" Presses the\r\n          button, instantly making all the text on the screen readable.\r\n          He quickly navigates to the Tools menu. Scrolls down.\r\n          Locates the number of the cell phone he is using.\r\n          He scribbles the number onto the top of the coffin. Then a\r\n          second pass, making it bolder than the others.\r\n          Paul then dials his wife's cell phone. After only a few\r\n          rings, he is met by her voice mail.\r\n\r\n           LINDA (V.O.)\r\n           Hi, this is Linda. Please leave a\r\n           message. Thanks and have a great\r\n           day.\r\n          The beep sounds, and Paul frantically proceeds right into his\r\n          message.\r\n\r\n                          PAUL\r\n           Linda, here's the number for the\r\n           phone. I just found it out. It's\r\n           07902-42-884. You have to use the\r\n           international calling code first.\r\n\r\n                          (MORE)\r\n\r\n           57.\r\n\r\n                          PAUL (CONT'D)\r\n           Please call me as soon as you get\r\n           this. I love you...I love you.\r\n           Call me right away. Please.\r\n          Paul hangs up. He looks at the battery life left on the\r\n          phone. One bar. He then checks his watch. It's 8:19pm.\r\n          Both are not good signs, and he knows it.\r\n\r\n                          PAUL (CONT'D)\r\n           Oh shit.\r\n          He begins to panic. Grabbing the pocket knife that was left\r\n          inside the metal box, he slides the blade in the space\r\n          between the sides of the coffin and the top.\r\n          Paul grabs the glow stick. But, because it was partially\r\n          melted to the floor, the stick snaps in two. Liquid oozes\r\n          out of the small portion of the stick that remains stuck the\r\n          floor.\r\n\r\n                          PAUL\r\n           Son of a...\r\n          Paul grabs the flashlight. Turns it on. It works for a\r\n          second, but then goes out. Shaking it only produces\r\n          intermittent beams of light.\r\n          He turns the top, switching to the red bulb. It works. The\r\n          coffin fills with a reddish hue, but then it, too, goes out.\r\n          Growing incensed, Paul switches back to the white bulb. It\r\n          works.\r\n          He returns his attention to the coffin. His efforts to use\r\n          the knife as a fulcrum are futile. Still, he tries. Bending\r\n          the blade well past its design, it nearly breaks off its\r\n          handle.\r\n          The flashlight turns off. After a good shaking, it turns\r\n          back on, emitting white light.\r\n          With oxygen levels extremely diminished, efforts of this kind\r\n          are all too much for Paul to take. He has to stop and try to\r\n          catch his breath.\r\n          As he endeavors to get his wind back, the cell phone rings.\r\n          Not a call this time, but instead a video message. It has\r\n          been sent by Jabir.\r\n          Paul's trepidation is evident. He fears what the incoming\r\n          video may show.\r\n\r\n           58.\r\n\r\n                         \r\n\r\n                         \r\n          After a beat, he presses the Accept button and the video\r\n          downloads. Within seconds, the video plays on his phone\r\n          display screen. We see, in the video, the American Woman\r\n          that previously appeared in a picture message that was sent\r\n          to Paul. She is still bound at her wrists, but her gag has\r\n          been lowered.\r\n          She sits on her knees. Standing behind her are three men,\r\n          all with their faces shielded by Arab headdresses. They each\r\n          hold AK-47 assault weapons.\r\n          Paul watches in horror as the terrified woman speaks, through\r\n          her tears, into the camera.\r\n\r\n                          WOMAN\r\n           My name is Pamela Gorham. I'm a\r\n           food service worker at F.O.B.\r\n           Anaconda, employed by Crestin,\r\n           Roland and Thomas. My captors'\r\n           requests for ransom have gone\r\n           unanswered, and --\r\n          The Woman, Pamela, looks off-screen to her right. Someone is\r\n          fast approaching her. She cowers, protectively holding her\r\n          bound hands in front of her face as she screams.\r\n\r\n                          WOMAN (CONT'D)\r\n           (to the person)\r\n           No...wait!! Please -- no!!\r\n          Another Iraqi man steps into the camera's line of site, a\r\n          handgun already brandished.\r\n          Without as much as a moment's hesitation, he fires two rounds\r\n          directly into Pamela's head, killing her.\r\n\r\n                         \r\n          The video message ends immediately thereafter. Paul is in\r\n          complete shock.\r\n          He screams aloud, slamming his closed fist against the bottom\r\n          of the coffin.\r\n\r\n                          PAUL\r\n           No! No, no, no!!!\r\n          Still in the throes of emotional torment, Paul vomits on\r\n          himself. He doubles over, only to vomit once again.\r\n          His body, taxed almost to the point of complete physical\r\n          breakdown, gradually slows and levels itself. With his vomit-\r\n          smeared face pressed cheek-down onto the bottom of the\r\n          coffin, Paul stares into nothingness.\r\n\r\n           59.\r\n\r\n                         \r\n\r\n                         \r\n          After a beat, his eye catches a glimmer of light -- the blade\r\n          of the knife, reflecting off the beam of the flashlight.\r\n          Paul reaches for the knife. Lying on his back, still\r\n          suffering enormous mental strain, he places the cutting edge\r\n          of the blade against his neck. His jugular vein.\r\n          His hand shakes, his lips tremble.\r\n          The hand that holds the blade tightens its grip on the\r\n          handle. It, too, shakes.\r\n          Paul closes his eyes.\r\n          A small amount of blood begins to drip from the side of his\r\n          neck, where the blade of the knife rests, ready to open his\r\n          vein.\r\n\r\n                         \r\n          After a great deal of consideration, Paul throws the knife to\r\n          the foot of the coffin.\r\n          He can't do it.\r\n          The flashlight falls from Paul's chest. It turns off upon\r\n          landing on the floor of the coffin.\r\n          Paul sits in darkness. His breaths echo off the coffin\r\n          walls.\r\n          After a beat, he turns on the flashlight. It turns off after\r\n          less than two seconds. This time, however, he does not shake\r\n          it, nor does he hit it.\r\n          A moment later, we hear a click, followed by the sight of a\r\n          red light beam emitting from the flashlight. It holds\r\n          steady.\r\n\r\n                         \r\n          Paul shines it onto the names and phone numbers written on\r\n          the top of the coffin. He stops at \"MARK WHITE.\"\r\n          After a beat, he lowers the flashlight to his side.\r\n          He picks up the phone and dials Brenner. After one ring,\r\n          Brenner answers. He's clearly not pleased. Paul, however,\r\n          is surprisingly calm. Detached. Almost disturbingly so.\r\n\r\n                          DAN\r\n           Why the hell did you make that\r\n           video?\r\n\r\n                          PAUL\r\n           It's all a bunch of lies.\r\n\r\n           60.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          DAN\r\n          What is? What are you talking\r\n          about?\r\n\r\n                          PAUL\r\n          All of it.\r\n\r\n                          DAN\r\n          All of what?\r\n\r\n                          PAUL\r\n          Nobody gives a shit about any of\r\n          us. We're nothing to you people.\r\n\r\n                          DAN\r\n          We're going to find you.\r\n\r\n                         \r\n\r\n                          PAUL\r\n          By looking the other way?\r\n\r\n                          DAN\r\n          You can't start breaking on me now,\r\n          Paul. You have to stay strong.\r\n\r\n                          PAUL\r\n          You let her die.\r\n\r\n                          DAN\r\n           (after a beat)\r\n          No I didn't.\r\n\r\n                          PAUL\r\n          They shot her...and you didn't do\r\n          anything.\r\n\r\n                          DAN\r\n          We didn't even know she had been\r\n          taken hostage.\r\n\r\n                          PAUL\r\n          She sent three videos.\r\n\r\n                          DAN\r\n          That's what they told her to say.\r\n\r\n                          PAUL\r\n          Why?\r\n\r\n                          DAN\r\n          I don't know.\r\n\r\n                          PAUL\r\n          What do you know?\r\n\r\n           61.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          DAN\r\n          That your ransom video already has\r\n          47,000 hits on YouTube. And all\r\n          the major networks are playing it,\r\n          including Al Jazeera. So, now your\r\n          captors have no choice but to\r\n          follow through.\r\n\r\n                          PAUL\r\n          I found out the number to this\r\n          phone.\r\n\r\n                          DAN\r\n          How?\r\n\r\n                          PAUL\r\n          I found a way to change the display\r\n          language. I figured that out, and\r\n          you didn't. Why?\r\n\r\n                          DAN\r\n          Because I didn't. Just like you\r\n          and every other person on this\r\n          planet, there are some things I\r\n          know and some things I don't.\r\n\r\n                          PAUL\r\n          Then how are you ever going to find\r\n          me?\r\n\r\n                          DAN\r\n          Their signal was cloned, like we\r\n          figured. But, we're close. Real\r\n          close.\r\n\r\n                          PAUL\r\n          What about mine?\r\n\r\n                          DAN\r\n          We're working on that, too.\r\n\r\n                          PAUL\r\n          I'm near a Mosque. I could hear\r\n          the call to prayer over the P.A.\r\n\r\n                          DAN\r\n          Good. That means that we're in the\r\n          right area.\r\n\r\n                          PAUL\r\n          You're nearby?\r\n\r\n           62.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          DAN\r\n           I spoke with soldiers from the\r\n           third ID who were escorting your\r\n           convoy.\r\n\r\n                          PAUL\r\n           They're alive?\r\n          After a beat:\r\n\r\n                          DAN\r\n           Not all of them. Both Bradley\r\n           tanks were hit with IEDs. The rest\r\n           got caught in small arms fire.\r\n\r\n                          (BEAT)\r\n           What the hell happened out there,\r\n           Paul?\r\n\r\n                         \r\n          Paul doesn't answer at first.\r\n\r\n                          DAN (CONT'D)\r\n           Paul.\r\n          After a beat:\r\n\r\n                          PAUL\r\n           We had just left Anaconda,\r\n           everything seemed okay. We knew\r\n           that a bunch of our CB radios had\r\n           been stolen and that the Iraqis\r\n           were listening in, so we made sure\r\n           to switch from our usual channels.\r\n           Pam was riding with Jeff Breer, the\r\n           convoy commander. She wanted to\r\n           ride with me like she usually did\r\n           when she hitched a ride from base,\r\n           but it seemed safer for her to be\r\n           with the C.C. As we headed down\r\n           the road, all these kids came\r\n           running into the street. Dozens of\r\n           them. It almost seemed like they\r\n           were expecting us, except we got\r\n           there faster than they thought we\r\n           would. So they run on up in front\r\n           of me, and I slam on my brakes.\r\n           The rest of the drivers were\r\n           already further up ahead, so they\r\n           kept going. Next thing I know, one\r\n           of the lead trucks got hit by an\r\n           IED. I hear Tommy Wilkes on the\r\n           radio saying, Sandman's hit,\r\n           Sandman's hit. He's...he's\r\n           everywhere.\r\n\r\n                          (MORE)\r\n\r\n           63.\r\n\r\n                          PAUL (CONT'D)\r\n           That's when the Iraqis came out of\r\n           their mud huts from the side of the\r\n           road and started shooting\r\n           everybody. I couldn't believe what\r\n           was happening. It seemed like slow-\r\n           motion, like I was watching it on\r\n           TV. People -- my friends -- were\r\n           getting killed, and all I could do\r\n           is watch. I didn't even notice\r\n           that the kids were throwing bricks\r\n           and rocks at me until one split my\r\n           windshield. Sort of snapped me out\r\n           of my trance. But then, I guess I\r\n           got hit in the head with a rock,\r\n           `cause I blacked out.\r\n\r\n                          DAN\r\n           Do you happen to remem...mo...\r\n           nea...\r\n          The cell phone service begins to cut out. Suddenly, the\r\n          coffin begins to vibrate slightly, dropping sand granules\r\n          through the crack and onto the wood bottom, followed by the\r\n          faint sound of an explosion.\r\n          Within seconds, the explosions grow louder and more\r\n          proximate. The vibration becomes so intense that it\r\n          violently shakes Paul around the coffin.\r\n          The sound of jet plane engines are heard coming from above,\r\n          flying by as the massive explosions continue.\r\n          Sand seeps in through the crack between the top and sides of\r\n          the coffin as it shakes. Paul does his best to brace\r\n          himself, but the bombardment is far too powerful.\r\n\r\n                         \r\n          A large crack forms in the wooden cover to the coffin,\r\n          spanning almost its entire length. Sand immediately pours\r\n          through the concave shaped crack, seeping in onto Paul like\r\n          an hourglass.\r\n          Fearing that the top of the coffin may collapse under the\r\n          immense pressure from the sand above, Paul positions himself\r\n          underneath it and presses with all his might. He grunts and\r\n          screams loudly, using what little strength he has left to\r\n          keep the top from caving.\r\n          The shaking soon stops, though the steady flow of sand\r\n          continues.\r\n\r\n           64.\r\n\r\n                         \r\n\r\n                         \r\n          In efforts to prevent the sand from filling the coffin any\r\n          faster, Paul removes the button-down shirt from the hole and\r\n          stuffs into the area where it enters with the greatest\r\n          volume. He removes the balled-up cloth from the other hole\r\n          and does the same with it. Both offer very little help.\r\n          The flashlight falls to the floor. The red light beam turns\r\n          off. Darkness. The sound of sand steadily pouring down.\r\n\r\n                          PAUL\r\n\r\n                          (EXHAUSTED)\r\n           Oh no...no...\r\n          Paul clicks the flashlight to a different setting. White\r\n          light shines, but then goes out. He shakes the flashlight\r\n          and it stays on, shining its normal white beam.\r\n\r\n                         \r\n          He assesses his situation, noticing that the coffin is\r\n          already filled with a small layer of sand; a situation that\r\n          is only going to get worse with time.\r\n\r\n                          PAUL\r\n           This can't be happening.\r\n          We see that Dan Brenner is no longer on the phone, and that\r\n          the display menu shows an icon of a phone with a line through\r\n          it -- No Service Available.\r\n          Once he feels it is secure enough, Paul slowly moves his body\r\n          away from the crack. Although slightly caved, it does not\r\n          show any more signs of possible collapse.\r\n          Sweat drenches his face. His eyes affixed, in utter\r\n          disbelief, on the sand as it spills into the coffin, filling\r\n          in around him inch-by-inch.\r\n\r\n                         \r\n          He grabs the cell phone, only to see that he does not have a\r\n          signal.\r\n\r\n                          PAUL (CONT'D)\r\n           No. Come on. Please work.\r\n          He shakes the cell phone and moves it all around the coffin,\r\n          hoping that it may somehow help. His efforts are futile.\r\n          The flashlight goes dead. He hits it, shakes it. It turns\r\n          back on. The brightness is diminished.\r\n          Still the sand continues to fall, drowning him deeper and\r\n          deeper in a pool of granules.\r\n          Then, very surprisingly, the cell phone rings. Paul answers\r\n          right away.\r\n\r\n           65.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n\r\n                          (FRANTICALLY)\r\n           Hello? Hello? Who's there?\r\n          Alan Davenport answers calmly from the other end.\r\n\r\n                          ALAN DAVENPORT\r\n           Is this Paul Conroy?\r\n\r\n                          PAUL\r\n           Yes. Yes, this is Paul. Who are\r\n           you?\r\n\r\n                          ALAN DAVENPORT\r\n           Paul, my name's Alan Davenport, I'm\r\n           the personnel director here at\r\n           Crestin, Roland and Thomas.\r\n\r\n                         \r\n\r\n                          PAUL\r\n           I left you a message.\r\n\r\n                          ALAN DAVENPORT\r\n           You did. I also heard from Rebecca\r\n           Browning over at the State\r\n           Department. Are you able to speak\r\n           on the status of your situation?\r\n\r\n                          PAUL\r\n           It's worse. There was an explosion\r\n           or something. The coffin's\r\n           breaking, there's sand pouring in\r\n           from everywhere. I only have a\r\n           half an hour before --\r\n\r\n                          ALAN DAVENPORT\r\n           Okay, okay. Slow down. You should\r\n           try to stay calm. Tell me\r\n           something, Paul, who have you\r\n           spoken to?\r\n\r\n                          PAUL\r\n           The hostage takers, Dan Brenner\r\n           from the hostage working group --\r\n\r\n                          ALAN DAVENPORT\r\n           Okay, Paul. I'm with you. How\r\n           about the media. I know your\r\n           ransom video leaked, but have you\r\n           spoken directly to anyone about\r\n           what's going on?\r\n          The flashlight goes out. Paul hits it a few times and it\r\n          turns back on.\r\n\r\n           66.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           No.\r\n\r\n                          ALAN DAVENPORT\r\n           That's good. It needs to stay that\r\n           way. It's important that we keep\r\n           this situation as contained as\r\n           possible.\r\n          Paul finds Alan's obvious concern with doing damage control\r\n          to be infuriating.\r\n\r\n                          PAUL\r\n           About three inches to my right,\r\n           there's a wall. Three inches to my\r\n           left, there's another wall. And\r\n           about four inches above my head,\r\n           there's a roof that's about to\r\n           collapse and drown me in sand. I\r\n           think this situation is pretty\r\n           contained.\r\n\r\n                          ALAN DAVENPORT\r\n           I know you're upset --\r\n\r\n                          PAUL\r\n           Help me! Help me! What are you\r\n           going to do to help me?!\r\n\r\n                          ALAN DAVENPORT\r\n           I know you're upset. And, from\r\n           what I've been told, steps are\r\n           being taken to get you out of\r\n           there. So, hopefully it won't be\r\n           much longer.\r\n\r\n                         \r\n\r\n                          PAUL\r\n           Thank God.\r\n\r\n                          ALAN DAVENPORT\r\n           Yes, thank God.\r\n\r\n                          (BEAT)\r\n           I'm going to switch on a recorder\r\n           right now. Just a second...\r\n          Paul's visage expresses his confusion.\r\n          A click is heard in the b.g. of Alan's phone, followed by a\r\n          low, steady hum.\r\n          Alan's speech becomes very laconic. His questions are\r\n          clearly being read from a Human Resources handbook of some\r\n          kind.\r\n\r\n           67.\r\n\r\n                         \r\n\r\n                         \r\n\r\n           ALAN DAVENPORT (CONT'D)\r\n           This is Alan Davenport, Personnel\r\n           Director for Crestin, Roland and\r\n           Thomas, Incorporated. The date is\r\n           October 23, 2006. I am speaking\r\n           with Paul Conroy. Mister Conroy,\r\n           are you aware that I'm recording\r\n           this conversation?\r\n\r\n                          PAUL\r\n           What...?\r\n\r\n                          ALAN DAVENPORT\r\n           Please answer the question.\r\n          The flashlight goes out again.\r\n\r\n                         \r\n\r\n                          PAUL\r\n           Shit.\r\n          Paul hits it, but it does not catch. He sits in darkness.\r\n\r\n                          ALAN DAVENPORT\r\n           Mister Conroy?\r\n\r\n                          PAUL\r\n           Yes. Yes!\r\n\r\n                          ALAN DAVENPORT\r\n           And do I have your permission to do\r\n           so?\r\n\r\n                          PAUL\r\n           Why do you need my permission?\r\n           What is all this?\r\n\r\n                         \r\n\r\n                          ALAN DAVENPORT\r\n           I need you to answer yes or no,\r\n           please.\r\n\r\n                          PAUL\r\n           Yes. Alright? Yes!\r\n          Paul hits the flashlight. It turns back on.\r\n\r\n                          ALAN DAVENPORT\r\n           Thank you. Now, Mister Conroy,\r\n           when were you hired by CRT?\r\n\r\n                          PAUL\r\n           About nine months ago. Around\r\n           January of 2005. Why are you\r\n           wasting time with this?\r\n\r\n           68.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          ALAN DAVENPORT\r\n           I have your official date of hire\r\n           as January 4th, 2005. Is that\r\n           correct?\r\n\r\n                          PAUL\r\n           Who cares? This is fucking crazy --\r\n\r\n                          ALAN DAVENPORT\r\n           January 4th, 2005. Is that\r\n           correct?\r\n\r\n                          PAUL\r\n           Yes!\r\n\r\n                          ALAN DAVENPORT\r\n           And during your initial training,\r\n           before being sent to Iraq, were you\r\n           made aware of the dangers inherent\r\n           to the position for which you were\r\n           hired.\r\n\r\n                          PAUL\r\n           You mean when I came down there to\r\n           Dallas and you guys said that all\r\n           of the trucks would be armored and\r\n           have bulletproof glass?\r\n          The flashlight dims. Paul angrily shakes it, returning it to\r\n          full strength.\r\n\r\n                          PAUL (CONT'D)\r\n           You mean when you told us that\r\n           things were safer than ever over\r\n           here? Is that when I was made\r\n           aware?\r\n\r\n                         \r\n\r\n                          ALAN DAVENPORT\r\n           I need you to answer yes or no,\r\n           please.\r\n\r\n                          PAUL\r\n\r\n                          (BEAT)\r\n           Yes.\r\n          The flashlight begins to slowly dim.\r\n\r\n                          ALAN DAVENPORT\r\n           During that time, did you also\r\n           receive and sign an employment\r\n           contract with CRT, which thoroughly\r\n           explained company policy as it\r\n           pertained to your specific terms of\r\n           employment?\r\n\r\n           69.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           Yeah, I signed a bunch of things.\r\n\r\n                          ALAN DAVENPORT\r\n           Yes or no.\r\n\r\n                          PAUL\r\n           Yes. I signed the contract. Yes!\r\n\r\n                          ALAN DAVENPORT\r\n           It's our understanding that you\r\n           were taken hostage in Iraq two\r\n           hours ago, is that also correct?\r\n\r\n                          PAUL\r\n           Yes. That's completely correct.\r\n           What is the point of all this?\r\n\r\n                         \r\n          Alan breaks from the H.R. handbook script, though his tone\r\n          remains just as matter-of-fact. The flashlight continues its\r\n          steady, slow dim.\r\n\r\n                          ALAN DAVENPORT\r\n           Our legal department requires that\r\n           we obtain a sworn affidavit from\r\n           employees, confirming that they\r\n           understand the reasons for their\r\n           forced separation from the company.\r\n           As of this morning, your employment\r\n           with CRT was officially terminated.\r\n\r\n                          PAUL\r\n           Wait, wait, wait --\r\n          The flashlight dims even more.\r\n\r\n                         \r\n\r\n                          ALAN DAVENPORT\r\n           It was brought to our attention\r\n           that you were engaging in relations\r\n           with a fellow CRT employee --\r\n           Pamela Gorham.\r\n\r\n                          PAUL\r\n           No. Wait --\r\n\r\n                          ALAN DAVENPORT\r\n           Stipulated in your contract was a\r\n           fraternization clause, in which it\r\n           was stated quite clearly that any\r\n           relationship, be it romantic or\r\n           sexual in nature, deemed\r\n           inappropriate by CRT senior\r\n           officials is grounds for immediate\r\n           termination.\r\n\r\n           70.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           We...we were just friends.\r\n\r\n                          ALAN DAVENPORT\r\n           Our records indicate differently.\r\n\r\n                          PAUL\r\n           This is bullshit.\r\n\r\n                          ALAN DAVENPORT\r\n           We're also legally required to\r\n           inform you that because you were\r\n           technically no longer under the\r\n           employ of CRT at the time of your\r\n           abduction, we cannot be held\r\n           accountable for any injury that may\r\n           befall upon you after your official\r\n           date and time of termination.\r\n           Therefore, in your case, that\r\n           includes this incident or any\r\n           consequences that may result from\r\n           it.\r\n          Paul sees where Alan is going with this. He's thunderstruck.\r\n\r\n                          PAUL\r\n           What about my insurance money? My\r\n           family will need that money...\r\n\r\n                          ALAN DAVENPORT\r\n           Given that you were alive up until\r\n           the time of your termination --\r\n\r\n                          PAUL\r\n           You son of a bitch. You can't do\r\n           this.\r\n\r\n                         \r\n\r\n                          ALAN DAVENPORT\r\n           Do you understand everything --\r\n\r\n                          PAUL\r\n           You can't do this!\r\n          Alan takes a second before trying again.\r\n\r\n                          ALAN DAVENPORT\r\n           Do you understand everything\r\n           you've been told, Mister Conroy?\r\n          Paul does not answer.\r\n\r\n           ALAN DAVENPORT (CONT'D)\r\n           Mister Conroy?\r\n\r\n           71.\r\n\r\n                         \r\n\r\n                         \r\n          After a long beat:\r\n\r\n                          PAUL\r\n           Go to hell.\r\n\r\n                          ALAN DAVENPORT\r\n           That concludes our interview with\r\n           Paul Conroy. I am now turning off\r\n           the recorder.\r\n          A click is heard. The humming ceases.\r\n\r\n                          PAUL\r\n           You people can't just wash your\r\n           hands of this. You bastards put me\r\n           here.\r\n\r\n                         \r\n\r\n                          ALAN DAVENPORT\r\n           I'm sorry.\r\n          Alan ends the call.\r\n          Paul looks at the phone -- it is still holding a steady\r\n          signal. Battery life, however, is running quite low. All\r\n          that remains is one blinking bar, indicating that Paul has\r\n          very little battery life left.\r\n          He shakes his hand free of the pile of sand that now covers\r\n          it and looks at his watch. It's 8:31pm.\r\n          The flashlight bulb dims until it goes out completely. Only\r\n          the light of the cell phone display lights the coffin.\r\n\r\n                          PAUL\r\n           Come on...\r\n\r\n                         \r\n          Wasting little time, Paul dials Jabir. The phone rings and\r\n          rings, but Jabir does not answer. Checking to make sure the\r\n          he dialed the correct number, Paul matches it against the\r\n          phone number he wrote onto the wall of the coffin.\r\n          Seeing that he did, in fact, dial correctly, Paul again tries\r\n          to call Jabir. While he waits through the many rings, he\r\n          tries relighting the Zippo. Spark...spark...it catches.\r\n          No one answers. Paul's disquietude is evident in his\r\n          increasingly erratic behavior.\r\n\r\n                          PAUL\r\n           Answer the phone!!\r\n          Paul tries Jabir once again, but still he does not answer the\r\n          phone.\r\n\r\n           72.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           (desperate, exhausted)\r\n           Why won't you answer?!!\r\n          It's then that something occurs to Paul. He stares at the\r\n          crack in the top of the coffin and the sand that pours in at\r\n          an alarmingly fast rate.\r\n          The crack has split Jabir's written phone number in half.\r\n          The aerial bombing. He wonders how it may have affected\r\n          Jabir and, consequently, his own chances of survival. He\r\n          places his hand under the point from where the sand pours in\r\n          most, allowing it to collect on his palm and slip through his\r\n          fingers.\r\n          The flickering Zippo flame tells of the diminished amount of\r\n          oxygen.\r\n          Paul attempts to control his breathing, realizing full well\r\n          that there are not many more breaths he will be able to take.\r\n          He then calls Dan Brenner. After a few rings, Brenner\r\n          answers.\r\n          Paul is surprisingly serene.\r\n\r\n                          DAN\r\n           Paul, is that you?\r\n\r\n                          PAUL\r\n           They're dead.\r\n\r\n                          DAN\r\n           How do you know that?\r\n\r\n                         \r\n\r\n                          PAUL\r\n           I just do.\r\n\r\n                          DAN\r\n           Three F-16s levelled parts of the\r\n           city a few minutes ago.\r\n\r\n                          PAUL\r\n           I know. I felt it. Did they know\r\n           I was here?\r\n          The Zippo flame flutters. Weakens.\r\n\r\n                          DAN\r\n           (after a beat)\r\n           Yeah.\r\n\r\n           73.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           Did they care?\r\n          Dan does not answer.\r\n\r\n                          PAUL (CONT'D)\r\n           These people that took me -- if\r\n           they're dead, they can't tell you\r\n           where I am.\r\n\r\n                          DAN\r\n           We can still try to track down your\r\n           signal.\r\n\r\n                          PAUL\r\n           You tried that already.\r\n\r\n                         \r\n\r\n                          DAN\r\n           We can try again.\r\n          Paul appreciates Dan's effort, but he knows there is little\r\n          hope left for him.\r\n\r\n                          PAUL (CONT'D)\r\n           It's over, isn't it?\r\n          After a long beat:\r\n\r\n                          DAN\r\n           No.\r\n          Paul doesn't say a word. He knows that Dan is lying. After\r\n          a beat, Dan comes clean.\r\n\r\n                          DAN (CONT'D)\r\n           Yeah.\r\n\r\n                         \r\n          The flame of the Zippo becomes smaller. It clearly has\r\n          little life left.\r\n\r\n                          PAUL\r\n           What should I do?\r\n\r\n                          DAN\r\n           I don't know.\r\n\r\n                          PAUL\r\n           That's right -- just like everyone\r\n           else on the planet, there are some\r\n           things you know and some things you\r\n           don't.\r\n\r\n           74.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          DAN\r\n           I wish this could have gone\r\n           differently.\r\n\r\n                          PAUL\r\n           Yeah...me too.\r\n          After a long beat, Paul ends the call. He forces a smile to\r\n          his lachrymose face.\r\n          Utterly hopeless, he opens the phone and turns on the video\r\n          feature. He turns the phone to face himself, projecting his\r\n          image on the display.\r\n          He presses Record.\r\n\r\n                          PAUL (CONT'D)\r\n           This is Paul Steven Conroy. Social\r\n           Security number 048-32-1198, date\r\n           of birth 3/19/68. This video will\r\n           serve as my last will and\r\n           testament. To my wife, Linda\r\n           Conroy, I leave the seven hundred\r\n           dollars in my personal savings and\r\n           whatever I have left in my annuity.\r\n           To my son, Shane Conroy, I...I\r\n           don't know. I don't have anything\r\n           else. My stuff, like, my clothes.\r\n           I wish I had more...I wish I had\r\n           done more. Your dad wasn't really\r\n           much of anything, Shane, I'm sorry.\r\n           Maybe if I was a famous baseball\r\n           player, or a guy who wore a suit to\r\n           work, I would have more to leave\r\n           you. But, you can be one of those\r\n           people if you want. You can be\r\n           whatever you want. Just promise me\r\n           that when you get older, you'll\r\n           take good care of your mom. And\r\n           promise me that you'll always try\r\n           to do the right thing, no matter\r\n           what. I love you very much, Shane.\r\n           Maybe I never said that\r\n           enough...maybe I did, I don't even\r\n           know. That probably means I\r\n           didn't.\r\n\r\n                          (BEAT)\r\n           I'm sorry, Linda. I should have\r\n           listened to you.\r\n          Paul ends the video and closes the phone. He carefully\r\n          places the phone into his pocket, where it may hopefully be\r\n          found if he ever is.\r\n\r\n           75.\r\n\r\n                         \r\n\r\n                         \r\n          He lays back, staring at the almost completely extinguished\r\n          Zippo flame, as the sand continues to rain on him.\r\n          Down and down it pours, the sands of time passing might and\r\n          main through the cracks.\r\n          The Zippo flame goes out. Paul sits in the darkness,\r\n          resigned to what apparently will be his fate.\r\n          Hold on black for several seconds...until --\r\n          -- suddenly, from inside Paul's pocket, he hears a faint\r\n          vibration. It's the cell phone. He looks at the number of\r\n          who is calling him. Shines the light of the cell phone on\r\n          the list of numbers written on the top of the coffin. He\r\n          can't believe what he's seeing.\r\n\r\n                         \r\n          Paul answers immediately.\r\n\r\n                          PAUL\r\n           You're not dead.\r\n          Jabir is heard speaking frantically in Arabic to the several\r\n          other people in the room with him.\r\n\r\n                          PAUL (CONT'D)\r\n           Hello? Hello?!\r\n          Jabir turns his attention to Paul.\r\n\r\n                          JABIR\r\n           Where is money?\r\n\r\n                          PAUL\r\n           I don't know.\r\n\r\n                         \r\n\r\n                          JABIR\r\n           What don't know?\r\n\r\n                          PAUL\r\n           I don't know where the money is.\r\n\r\n                          JABIR\r\n           Liar!\r\n\r\n                          PAUL\r\n           I'm not lying! I swear.\r\n\r\n                          JABIR\r\n           Swear?\r\n\r\n                          PAUL\r\n           I'm telling the truth.\r\n\r\n           76.\r\n\r\n                         \r\n\r\n                         \r\n          Sounding panicked, Jabir again speaks in Arabic to the other\r\n          people in the room with him. They respond accordingly.\r\n          Paul tries to turn on the flashlight. It doesn't work.\r\n          Jabir returns his scornful attention to Paul.\r\n\r\n                          JABIR\r\n           From Embassy, you get money now!\r\n\r\n                          PAUL\r\n           I can't!\r\n\r\n                          JABIR\r\n           You will!!\r\n\r\n                          PAUL\r\n           I need more time. Please.\r\n          Paul shakes and hits the flashlight. It still does not work.\r\n\r\n                          JABIR\r\n           No more time!\r\n\r\n                          PAUL\r\n           There's sand pouring in here. I\r\n           can't...it's everywhere. Please,\r\n           let me out of here and I will get\r\n           you the money.\r\n          Jabir utters something in Arabic to someone standing next to\r\n          him, seemingly asking a question and getting an answer from\r\n          the same individual.\r\n          Paul unscrews the top of the flashlight. Switches the\r\n          positioning of the batteries. Screws the cap back on. Hits\r\n          the switch.\r\n          Nothing.\r\n          Jabir returns to the phone.\r\n\r\n                          JABIR (CONT'D)\r\n           You show blood.\r\n\r\n                          PAUL\r\n           What?\r\n          Paul unscrews the top of the flashlight again. Removes the\r\n          batteries. Bites down on them a few times. Blows hard\r\n          inside the flashlight tube.\r\n\r\n                          JABIR\r\n           You show blood, they give money.\r\n\r\n           77.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           No.\r\n\r\n                          JABIR\r\n           You cut off thumb finger, send\r\n           video.\r\n\r\n                          PAUL\r\n           I'm not doing that.\r\n\r\n                          JABIR\r\n           Yes!\r\n          Paul puts the batteries back inside the flashlight. Begins\r\n          screwing on the cap.\r\n\r\n                          PAUL\r\n           No.\r\n\r\n                          JABIR\r\n           No?\r\n\r\n                          PAUL\r\n           That's right, no. You let me out\r\n           of here, and I'll cut off my whole\r\n           God damn hand if you want.\r\n          Jabir again says something to someone in the room with him,\r\n          returning to Paul after a brief moment.\r\n          Paul finishes closing the top of the flashlight.\r\n\r\n                          JABIR\r\n           You have wife?\r\n          Click. The flashlight turns on!\r\n\r\n                         \r\n          Paul considers Jabir's question to be a potential sign of\r\n          compassion.\r\n\r\n                          PAUL\r\n           Yes, I do. And a son. A young\r\n           son. I want to go home...to see\r\n           them. Please, sir.\r\n\r\n                          JABIR\r\n           Sir?\r\n\r\n                          PAUL\r\n           Yes. Sir. I say that out of\r\n           respect...to you.\r\n\r\n           78.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          JABIR\r\n           243 East Walnut Street. Hastings,\r\n           Michigan. U.S.A.\r\n\r\n                          PAUL\r\n\r\n                          (CONCERNED)\r\n           That's my...why did you say that?\r\n\r\n                          JABIR\r\n           You show blood...or they show\r\n           blood.\r\n\r\n                          PAUL\r\n           That's...you're lying. You're\r\n           nobody...all of you. You can't get\r\n           to them.\r\n\r\n                         \r\n\r\n                          JABIR\r\n           No?\r\n\r\n                          PAUL\r\n           No. You're peasants, criminals,\r\n           that's all. You don't even know\r\n           where Michigan is.\r\n\r\n                          JABIR\r\n           Detroit. Ann Arbor.\r\n          Even this basic knowledge is enough to make Jabir's threats\r\n          that much more real.\r\n\r\n                          PAUL\r\n           You looked at a map. That's all\r\n           you did.\r\n\r\n                          JABIR\r\n           You show blood, or they show blood.\r\n           Send video by five minutes.\r\n          Jabir ends the call. Realizing that Jabir is gone, Paul\r\n          quickly dials his wife's cell phone.\r\n          After several rings, her voice mail picks up.\r\n\r\n           LINDA (V.O.)\r\n           Hi, this is Linda. Please leave a\r\n           message. Thanks and have a great\r\n           day.\r\n\r\n                          PAUL\r\n\r\n                          (FRANTICALLY)\r\n           Linda, listen to me: you and Shane\r\n           have to go somewhere... anywhere.\r\n\r\n                          (MORE)\r\n\r\n           79.\r\n\r\n                          PAUL (CONT'D)\r\n           Don't stay at the house, whatever\r\n           you do, do not stay at the house.\r\n           The guy...the kidnapper, he knows\r\n           our address. He stole my license\r\n           and now he knows where we live. Go\r\n           to the Sheriff's station if you\r\n           have to, just don't go home.\r\n          Paul hangs up. He takes a moment to look around, noticing\r\n          that the coffin is almost halfway filled with sand.\r\n\r\n                          PAUL (CONT'D)\r\n           (re: the sand)\r\n           Holy God.\r\n          Paul then dials Dan Brenner. After only one ring, the call\r\n          goes directly to voice mail.\r\n\r\n                         \r\n          The flashlight starts to dim. Paul shakes it, causing it to\r\n          regain its strength.\r\n\r\n                          DAN\r\n           This is Daniel Brenner. Please\r\n           leave a message at the tone.\r\n          The beep sounds. Paul delivers a frenzied message.\r\n\r\n                          PAUL\r\n           Brenner, where are you?! He's\r\n           alive! He just called me! Call me\r\n           right away! The fucking guy is\r\n           still alive!\r\n          Paul hangs up the phone.\r\n          Unsure what to do next, Paul's heartbeat races. He fidgets,\r\n          nervously shaking and tapping his thumb against the phone.\r\n          He questions the validity of Jabir's threats toward his\r\n          family.\r\n\r\n                          PAUL\r\n\r\n                          (TO HIMSELF)\r\n           They can't find them.\r\n           They...can't. There's no way.\r\n          Paul opens the phone and brings up the photo of Pamela, bound\r\n          and gagged. The image causes Paul to second guess himself.\r\n          The flashlight goes out. The cell phone's display\r\n          illuminates Paul's face.\r\n\r\n           80.\r\n\r\n                         \r\n\r\n                         \r\n          He then replays the video in which Pamela is seen being shot.\r\n          Reliving the experience is extremely painful, though his\r\n          concern is more on his own family at this point. However,\r\n          the video is enough to convince Paul of Jabir and his\r\n          cohort's convictions.\r\n          Paul tries the Zippo. Nothing. Only sparks. He tosses it\r\n          aside.\r\n          His breathing grows erratic and labored. His eyes dart from\r\n          side-to-side, his throat groans involuntary noises of fear.\r\n          Paul then looks at the knife, and then at his watch. He has\r\n          less than two minutes to send the video to Jabir.\r\n          Fearing for the safety of his family, he must meet Jabir's\r\n          demands.\r\n\r\n                         \r\n          He hits the flashlight a few times. Click. It turns on.\r\n          Paul opens the phone and sets it to take video. He places it\r\n          flat onto the surface of the sand, which by this point is\r\n          already filling the coffin halfway. He then reaches for the\r\n          knife.\r\n\r\n                          PAUL (CONT'D)\r\n           Oh my God. Oh my God.\r\n          He places his hands against the side of the coffin, spreading\r\n          his fingers. He stares intently at his thumb.\r\n          With the extremely sharp knife in hand, Paul slowly lowers it\r\n          just above his thumb. He inhales and exhales deep breaths,\r\n          almost hyperventilating.\r\n\r\n                          PAUL(CONT'D)\r\n           Holy shit.\r\n          Paul then reaches into the sand and finds one of the expired\r\n          glow sticks. He shakes the sand off of it and places it\r\n          across his mouth, biting into it hard.\r\n          His heart races, his breaths are the deepest he's ever taken.\r\n          After placing the flashlight on the ground, to ensure that\r\n          the camera picks up the image, he presses the record button\r\n          on the cell phone.\r\n          Grinding his teeth into the glow stick and letting out a\r\n          primordial scream, Paul closes his eyes and chops down with\r\n          the knife.\r\n          We see, through the display screen of the phone, Paul sever\r\n          his thumb with a swift chop of the blade.\r\n\r\n           81.\r\n\r\n                         \r\n\r\n                         \r\n          A small spray of blood spatters onto his face as he screams\r\n          out in unfathomable pain.\r\n          He falls to his side, still screaming and writhing. He\r\n          reaches for his discarded outer-shirt, which is still stuffed\r\n          in the crack to help slow the influx of sand. Removing the\r\n          shirt from the crack instantly causes the sand to fall into\r\n          the coffin more rapidly.\r\n          Paul wraps the shirt around his hand. The blood quickly soaks\r\n          right through it.\r\n          He is fading fast. His blood loss is great. Shock sets in.\r\n          He musters up the strength to send the video to Jabir.\r\n          To secure his shirt over the wound, Paul removes his belt\r\n          from his waist and pulls it tight over his wrap.\r\n\r\n                         \r\n          Growing increasingly more pale, Paul teeters on the verge of\r\n          consciousness. Everything becomes blurry to him.\r\n          The phone falls from his hand. He shivers. His lips turn a\r\n          light shade of purple and his face ash white. Everything\r\n          becomes more and more blurry. He fights with every last\r\n          ounce of strength to remain conscious.\r\n          While laying against the side of the coffin, the phone\r\n          vibrates once again. To Paul, the vibration against the wood\r\n          seems so distant, so foreign. The vibration grows louder and\r\n          louder in his mind, sounding more and more like the sound of\r\n          rotating helicopter blades.\r\n          He then hears what sounds like VOICES, yelling from on top of\r\n          the coffin.\r\n\r\n                          VOICE #1\r\n           He's down here!\r\n\r\n                          VOICE #2\r\n           Get him out! Keep digging!\r\n\r\n                          VOICE #3\r\n           Paul, we're here!\r\n          The cacophony of voices form a mosaic of sound in Paul's\r\n          head, each overlapping the other in distant echoes. Shovels,\r\n          digging deep into the ground, are heard banging against the\r\n          top of the coffin.\r\n          The top of the coffin is torn open, sending a brilliant ray\r\n          of white light onto Paul. He stares into the light, crying,\r\n          eking out a tortured smile.\r\n\r\n           82.\r\n\r\n                         \r\n\r\n                         \r\n          Suddenly, Paul is back in the same predicament. The voices,\r\n          the shovels, the light -- it was all a hallucination, brought\r\n          upon by his loss of blood.\r\n          He's still alone. He's still in the coffin, which continues\r\n          to fill up with sand. He is too exhausted to display his\r\n          disappointment.\r\n          The phone continues to vibrate. It soon stops. Paul is in\r\n          too poor condition to show any concern.\r\n          After a beat, the phone begins vibrating once again. After\r\n          several rings, Paul languidly picks it up. He barely\r\n          recognizes the number through his extremely blurred vision.\r\n          He's so weak, he's barely able to formulate words. He spits\r\n          out stray particles of sand from his mouth.\r\n\r\n                         \r\n\r\n                          PAUL\r\n           Yeah?\r\n\r\n                          DAN\r\n           Paul, it's Brenner.\r\n          Paul doesn't have the strength to answer.\r\n\r\n                          DAN (CONT'D)\r\n           Paul? Are you there? Paul?\r\n\r\n                          PAUL\r\n           I'm...here.\r\n\r\n                          DAN\r\n           We're coming for you now. You hear\r\n           me? We know where you are.\r\n\r\n                         \r\n          This news serves as somewhat of an adrenaline rush for Paul,\r\n          who musters up even the modicum of strength he seemingly did\r\n          not have left in him.\r\n\r\n                          PAUL\r\n           You're coming?\r\n\r\n                          DAN\r\n           We are, Paul. We're almost there\r\n           now.\r\n\r\n                          PAUL\r\n           How do you know?\r\n\r\n                          DAN\r\n           Coalition forces picked up a Shiite\r\n           insurgent just outside of Baghdad.\r\n\r\n                          (MORE)\r\n\r\n           83.\r\n\r\n                          DAN (CONT'D)\r\n           Said he knew where an American was\r\n           buried alive. He agreed to show us\r\n           where if we let him go.\r\n\r\n                          PAUL\r\n           You're coming for me?\r\n\r\n                          DAN\r\n           We're practically there already.\r\n          An impossible smile fights its way to Paul's lips. His\r\n          momentary joy is just that, however, for the sand has almost\r\n          completely filled the coffin by this point.\r\n\r\n                          PAUL\r\n           You have to hurry.\r\n\r\n                         \r\n\r\n                          DAN\r\n           We are.\r\n\r\n                          PAUL\r\n           No...you have to hurry. The\r\n           sand...it's filling up fast.\r\n\r\n                          DAN\r\n           Just hang in there for three more\r\n           minutes. This will all be over\r\n           soon, I promise.\r\n          Paul is very hopeful that Dan is correct in his assumption.\r\n\r\n                          PAUL\r\n           Okay. I believe you. Thank you.\r\n           Thank you.\r\n          A beep is heard. Paul has another call coming in. He's\r\n          visibly elated upon seeing who it is.\r\n\r\n                          DAN\r\n           Three minutes. Try to --\r\n\r\n                          PAUL\r\n           I have to go!\r\n\r\n                          DAN\r\n           Paul, no --\r\n\r\n                          PAUL\r\n           Call me right back.\r\n\r\n                          DAN\r\n           Paul!\r\n\r\n           84.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           Call me right back.\r\n          Paul switches to the other call, despite the fact that he has\r\n          a mere eight inches left before the entire coffin is filled\r\n          with sand from top-to-bottom.\r\n          He holds the flashlight just above the top of the sand pile,\r\n          allowing it to illuminate what little unoccupied area\r\n          remains.\r\n\r\n                          PAUL\r\n           Linda.\r\n          Linda is in hysterics, which is evident in her speech.\r\n\r\n                          LINDA\r\n           Paul? Paul is that you? Tell me\r\n           it's you.\r\n\r\n                          PAUL\r\n           It's me, sweetie.\r\n\r\n                          LINDA\r\n           Oh my God, Paul! What are they\r\n           doing to you? Please tell me\r\n           you're okay.\r\n\r\n                          PAUL\r\n           I'm...okay.\r\n\r\n                          LINDA\r\n           I just saw the news. What...oh my\r\n           God, baby.\r\n          The flashlight dims. Paul shakes it, regaining a bit of its\r\n          strength.\r\n\r\n                          PAUL\r\n           It's going to be okay now.\r\n\r\n                          LINDA\r\n           I missed all your calls. I left my\r\n           cell phone at home. I just found\r\n           out what was going on.\r\n\r\n                          PAUL\r\n           That's okay. It's all okay.\r\n           They're getting me out.\r\n\r\n                          LINDA\r\n           Who?\r\n\r\n           85.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           The people. Americans. They found\r\n           out where I am and they're on their\r\n           way to get me.\r\n\r\n                          LINDA\r\n\r\n                          (ELATED)\r\n           They are? Oh thank God. Oh dear\r\n           God, thank you.\r\n          The flashlight flickers. Paul hits it. It flickers some\r\n          more.\r\n\r\n                          PAUL\r\n           It's all going to be okay.\r\n\r\n                          LINDA\r\n           How do you know for sure? Oh God,\r\n           please tell me you're okay.\r\n          The flashlight continues to flicker almost like a\r\n          stroboscopic light from this point forward.\r\n\r\n                          PAUL\r\n           I'm okay.\r\n\r\n                          LINDA\r\n           I was so afraid I was going to lose\r\n           you.\r\n\r\n                          PAUL\r\n           You're not.\r\n          Linda breaks down in joyous tears.\r\n\r\n                          LINDA\r\n           I love you so much. I love you so,\r\n           so much.\r\n\r\n                          PAUL\r\n\r\n                          (WELLING UP)\r\n           I love you, too.\r\n\r\n                          (BEAT)\r\n           I'm sorry. I should have listened\r\n           to you.\r\n\r\n                          LINDA\r\n           It doesn't matter.\r\n\r\n                          PAUL\r\n           I should have never come here. You\r\n           were right. I'm sorry.\r\n\r\n           86.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          LINDA\r\n           Sweetie, I don't care. I just want\r\n           you home. Please come home to me.\r\n\r\n                          PAUL\r\n           I will.\r\n\r\n                          LINDA\r\n           Swear it.\r\n\r\n                          PAUL\r\n           I will. I swear I will.\r\n          Paul then receives a call on the other line. He checks to\r\n          see who's calling. It's Dan Brenner.\r\n\r\n                          PAUL (CONT'D)\r\n           They're here!\r\n\r\n                          LINDA\r\n           The people?\r\n\r\n                          PAUL\r\n           They're calling me right now. I\r\n           have to go.\r\n\r\n                          LINDA\r\n           Call me right away.\r\n\r\n                          PAUL\r\n           I will. I love you.\r\n\r\n                          LINDA\r\n           I love you. Swear it again.\r\n\r\n                          PAUL\r\n           I swear. I have to go.\r\n          Paul clicks over to the other line, where Dan Brenner waits\r\n          to speak with him.\r\n          We hear Dan yelling to people who are with him. A great deal\r\n          of commotion and action is heard through the phone.\r\n\r\n                          DAN\r\n           Move! Move! Let's go.\r\n\r\n                          PAUL\r\n           Brenner?\r\n\r\n                          DAN\r\n           Paul? Paul?\r\n\r\n           87.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           It's me.\r\n\r\n                          DAN\r\n           We're here!\r\n          Dan yells to one of the soldiers who are with him.\r\n\r\n                          DAN (CONT'D)\r\n           Corporal, get your men over here!\r\n          Dan gets back on the phone with Paul\r\n\r\n                          DAN (CONT'D)\r\n           He brought us right to you.\r\n\r\n                          DAN (CONT'D)\r\n           (to the soldiers)\r\n           Start digging! Let's go, let's go!\r\n          The flashlight fades. Paul hits it, momentarily returning it\r\n          to full strength.\r\n          Meanwhile, the sand inside the coffin has almost reached the\r\n          very top. It continues to pour in from the crack, seemingly\r\n          faster than ever.\r\n          Paul struggles to keep his head above the sand, giving him\r\n          only a few inches between his face and the top of the coffin.\r\n\r\n                          PAUL\r\n           You have to hurry. It's almost\r\n           full.\r\n\r\n                          DAN\r\n           Just hang in there!\r\n\r\n                         \r\n\r\n                          PAUL\r\n           Hurry! Please!\r\n\r\n                          DAN\r\n           (to the soldiers)\r\n           Dig! Dig! Dig!\r\n          Paul fights to keep his head above the sand. The flashlight\r\n          dims.\r\n\r\n                          PAUL\r\n           I can't...are you close?\r\n\r\n                          DAN\r\n           We're almost there, Paul. We're\r\n           almost there!\r\n           (to the soldiers)\r\n\r\n                          (MORE)\r\n\r\n           88.\r\n\r\n                          DAN (CONT'D)\r\n           Faster!\r\n\r\n                          (TO PAUL)\r\n           We're almost there. We're right\r\n           above you.\r\n          The level of sand grows even higher. Paul spits away falling\r\n          sand that threatens to suffocate him.\r\n\r\n                          PAUL\r\n           I can't hear you! Where are you?\r\n\r\n                          DAN\r\n           We're almost there.\r\n          A SOLDIER is heard OFF-SCREEN in the b.g. of Dan's phone.\r\n\r\n           SOLDIER (O.S.)\r\n           There it is!\r\n\r\n                          DAN\r\n           (to the soldiers)\r\n           Keep digging!!\r\n\r\n                          PAUL\r\n           Hurry! Please!!!\r\n\r\n                          DAN\r\n           We see the coffin! Just hang in\r\n           there!!\r\n          Paul coughs out sand. He has a mere inch left above his\r\n          head.\r\n\r\n                          PAUL\r\n           Hurry! Where are you? I don't\r\n           hear you? Please hurry!!!\r\n\r\n                         \r\n          The Soldier is again heard OFF-SCREEN in the b.g. Of Dan's\r\n          phone.\r\n\r\n                          SOLDIER\r\n           It's clear!\r\n\r\n                          DAN\r\n           (to the soldier)\r\n           Open it!\r\n          Nondescript noise is heard through the phone, until it comes\r\n          to an abrupt stop.\r\n\r\n                          DAN\r\n\r\n                          (SHOCKED)\r\n           Oh my God.\r\n\r\n           89.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          PAUL\r\n           What is it?!\r\n\r\n                          DAN\r\n           I'm so sorry, Paul.\r\n\r\n                          PAUL\r\n           What?!!\r\n\r\n                          DAN\r\n           It's Mark White. He brought us to\r\n           Mark White. I'm --\r\n          We see the circled name of \"MARK WHITE\" written in capital\r\n          letters on the top of the coffin.\r\n\r\n                          PAUL\r\n           You said...!\r\n\r\n                          DAN\r\n\r\n                          (OVERLAPPING)\r\n           ...I know. I'm sorry.\r\n\r\n                          PAUL\r\n           No.\r\n\r\n                          DAN\r\n           I'm so sorry.\r\n\r\n                          PAUL\r\n           No!! No!! NO!!!\r\n          The battery life on Paul's phone runs out, causing it to\r\n          power down. The filament of the flashlight bulb burns out.\r\n          As it does, the sand finally consumes the coffin, filling it\r\n          completely.\r\n\r\n                         \r\n          We hear Paul's muffled screams emanate through the sand,\r\n          until we no longer hear them at all.\r\n\r\n           FADE OUT.\r\n\r\n                         OVER BLACK\r\n\r\n                          DAN\r\n           I'm sorry, Paul. I'm so sorry.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          THE END\r\n \r\n\n\n\n\nBuried\nWriters :   Chris Sparling\nGenres :   Drama  Mystery  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "On October 23, 2006, Paul Conroy, an American civilian truck driver working in Iraq, wakes up and finds himself buried alive in a wooden coffin, bound and gagged, with only a Zippo lighter and a BlackBerry phone at hand. Although he initially has no idea how he got there, he starts to piece together what has happened to him. He remembers that his and several other trucks were ambushed by terrorists, who killed his colleagues; he was hit by a rock and passed out. He receives a call from his kidnapper, Jabir, demanding that he pay a ransom of $5 million by 9PM or he will be left in the coffin to die.\nConroy calls the State Department, which tells him that due to the government policy of not negotiating with terrorists, it will not pay the ransom but will try to rescue him. They connect him with Dan Brenner, head of the Hostage Working Group, who tells Conroy they are doing their best to find him.\nHis kidnapper calls Conroy and demands he make a ransom video, threatening to execute one of his colleagues who survived the attack. Conroy insists that no one will pay $5 million, so the kidnapper drops the amount to $1 million. Despite his compliance in making a video, the kidnappers execute his colleague and send him the recording of it, which he watches in horror. Shortly afterwards, distant explosions shake the area, damaging his coffin, which begins to slowly fill with sand. Conroy continues sporadic phone calls with Brenner, skeptical of the man's promises of help. To reaffirm his wholehearted intentions, Brenner tells Conroy about a 26-year-old named Mark White who was rescued from a similar situation three weeks previously, telling him that the kid is home with his family and likely happy.\nLater on, Conroy receives a phone call from his employers, who inform him that he was fired from his job due to an alleged prohibited relationship with a colleague (the one who was executed), and thus he and his family will not be entitled to any benefits or pension he earned during his time with the company. Brenner calls back and explains that the explosions that had damaged his coffin earlier were in fact several F-16 bombings, and that his kidnappers may have been killed. Conroy begins to lose all hope and does a last will and testament in video form, giving his son all of his clothes and his wife his personal savings. Jabir calls back demanding that Conroy video record himself cutting his finger off, threatening Conroy's family back home in Michigan if he refuses, saying that he lost all of his children. Conroy records himself cutting off one of his fingers and sends the video.\nShortly after making the video, the cell phone rings, Paul begins to hear shovels and distorted voices. The voices come clearer, saying to open the coffin, and the coffin opens. But abruptly, it becomes obvious he hallucinated the encounter.\nAfter some minutes, Brenner calls, notifying Conroy that they have found his location and are driving out to find him. Then Conroy's wife Linda calls him, so Conroy hangs up on Brenner. She cries with him and begs him to promise her that he will come home. He promises, but hangs up due to another call from Brenner. Brenner reports that they have found the site. The group starts to dig up a coffin, but Conroy cannot hear anyone near the coffin. When they open it, the coffin turns out to be Mark White's, not Conroy's, indicating that White was never saved. Paul starts to cry as he realizes he is not going to be saved. The sand fills his coffin and he suffocates. The last thing he hears is Brenner, repeating, \"I'm sorry, Paul. I'm so sorry.\" as the screen goes black."}