{"title": "Capote", "full_text": "CAPOTE\n\n\n\n                                        Written by\n\n                                      Dan Futterman\n\n\n\n                 Based on the book \"Capote: A Biography\" by Gerald Clarke\n\n                \n\n               TITLE UP:         \"Western Kansas, 1959\"\n\n               EXT. FARMHOUSE - MORNING\n\n               The CAMERA follows a SIXTEEN YEAR OLD GIRL, long hair, pretty \n               Sunday church dress, walking toward a peaceful farmhouse. At \n               the door she lifts the knocker. The door opens slightly. The \n               girl turns and looks past the camera at her MOTHER, sitting \n               in an old Plymouth idling in the driveway. Her mother shrugs, \n               motions for her to go inside.\n\n               INT. FARMHOUSE - CONTINUOUS\n\n               The girl walks through the downstairs rooms. In the kitchen, \n               the PHONE is OFF the hook. The girl looks back toward the \n               open front door. She turns toward the stairs, climbs them.\n\n               INT. FARMHOUSE, UPSTAIRS HALL - CONTINUOUS\n\n               She walks down the hall to a BEDROOM DOOR at the end. The \n               door is slightly ajar. She knocks, then enters the room.\n\n               INT. FARMHOUSE, BEDROOM - CONTINUOUS\n\n               The girl's POV: the CAMERA pans across the bedroom of a high \n               school coed. We see the desk, the bureau, the bed. On the \n               bed lies NANCY CLUTTER, her wrists and legs bound in rope, \n               SHOT in the head. There is blood on the wall. The sixteen \n               year-old girl stands immobile. Before she starts to scream,\n\n                                                                    CUT TO:\n\n               EXT. KANSAS LANDSCAPE - DAY\n\n               Trees ring the edge of a field.\n\n                                                                    CUT TO:\n\n               EXT. N.Y. CITYSCAPE, ESTABLISHING - NIGHT\n\n               Buildings lit against the night sky.\n\n               INT. NEW YORK APARTMENT BUILDING/STAIRS - NIGHT\n\n               Camera follows group of partygoers as they mount the stairs: \n               Truman Capote, Barbara (very tall), Rose, Christopher, \n               Williams.\n\n               INT. SMALL, PACKED NEW YORK APARTMENT/KITCHEN - LATER\n\n               The friends are standing in the crowded kitchen -- people \n               are coming in and out -- talking and drinking and laughing.\n\n                                     TRUMAN\n                         So Jimmy Baldwin tells me the plot \n                         of his book, and he says to me: the \n                         writing's going well, but I just \n                         want to make sure it's not one of \n                         those problem novels. I said: Jimmy, \n                         your novel's about a Negro homosexual \n                         who's in love with a Jew -- wouldn't \n                         you call that a problem?\n\n               Laughter.\n\n                                     CHRISTOPHER\n                         Susan's father had a minor heart \n                         attack, so she's writing more erotic \n                         poems about death and sex.\n\n                                     BARBARA\n                         It's so tiresome.\n\n                                     WILLIAMS\n                         Hmm. What rhymes with angina?\n\n               Laughter. We see Truman watching everyone laugh. GRAYSON \n               notices, leans in to him. As the rest of the group continues \n               talking, we come closer, hear their conversation.\n\n                                     GRAYSON\n                         How's your writing?\n\n                                     TRUMAN\n                         Oh, I've got a million ideas of what \n                         to write next -- I just have to choose \n                         one.\n\n                                     GRAYSON\n                         Really?\n\n                                     TRUMAN\n                         No.\n\n               Their attention is pulled back into the group as:\n\n                                     BARBARA\n                         Who would I want to play me? Natalie \n                         Wood.\n\n                                     ROSE\n                         Too fat.\n\n                                     BARBARA\n                         Audrey Hepburn?\n\n                                     ROSE\n                         Not bad. Sort of middle-class.\n\n                                     TRUMAN\n                         When a movie is made of my life I \n                         know exactly who I want as me...\n                              (beat)\n                         Marilyn Monroe.\n\n               Barbara cracks up, chokes on her drink.\n\n               EXT. TRUMAN AND JACK'S HOUSE/BACK PATIO - MORNING\n\n               Truman sits with his coffee, reading the New York Times. An \n               article catches his eye. He sits up straight, folds the paper \n               over, reads it.\n\n               INT. TRUMAN AND JACK'S HOUSE, STUDY - DAY\n\n               C/U of article being snipped out of PAGE 39 of the Times, \n               November 16, 1959. As the page gets turned around with each \n               snip, we see a small PHOTO of a middle-aged man wearing \n               glasses, with the caption: \"FOUND DEAD: Herbert W. Clutter, \n               a wealthy Kansas farmer...\" We read the headline: \"WEALTHY \n               FARMER, 3 OF FAMILY SLAIN. Parts of the story: \"HOLCOMB, \n               Kan., Nov. 15 (UPI) -- ...wheat farmer, his wife... two young \n               children found shot today...\"\n\n               INT. TRUMAN AND JACK'S HOUSE, STUDY - MOMENTS LATER\n\n               Truman on the phone.\n\n                                     FEMALE VOICE OVER THE PHONE\n                         New Yorker magazine.\n\n                                     TRUMAN (ON PHONE)\n                         William Shawn, please.\n                              (he listens)\n                         Adorable one? All of a sudden I know \n                         what article I'm going to write for \n                         you next.\n\n               INT. TRUMAN AND JACK'S HOUSE, STUDY/KITCHEN - MOMENTS LATER\n\n               Truman on the phone, on a long cord, travels between the \n               study and the kitchen as he talks to William Shawn. We hear \n               pieces of the conversation, and see Truman in different parts \n               of the room as he says each bit.\n\n                                     TRUMAN\n                         ...never had anything like this happen \n                         to them before. They're used to \n                         sleeping at night with the doors \n                         unlatched....\n                              (laughs)\n                         Yes, we should buy stock in Master \n                         Locks -- all of Kansas will be in \n                         the hardware store tomorrow.\n\n               Jump to -\n\n                                     TRUMAN\n                         They have no idea who the killer is. \n                         But it doesn't matter who the killer \n                         is -- what matters is who the \n                         townspeople imagine the killer is. \n                         That's what I want to write about.\n\n               Jump to -\n\n                                     TRUMAN\n                         I'm gonna need some help... I'm \n                         thinking about Nelle -- she can \n                         protect me...\n\n               JACK DUNPHY (strong, Irish-American, ten years older than \n               Truman) -- his longtime boyfriend -- enters the front door \n               with a bag of groceries, stops in the hall. He sees Truman \n               on the phone. Truman looks at Jack, though he's still speaking \n               to Shawn --\n\n                                     TRUMAN\n                         I want to leave tonight...\n\n                                                              SMASH CUT TO:\n\n               EXT. TRAIN TRACKS, OUTSKIRTS OF NEW YORK CITY - NIGHT\n\n               A train barrels toward us, its headlight bright. The train \n               roars past, away from the city.\n\n               INT. TRAIN, MOVING - NIGHT\n\n               Truman hurries through the train, checking his ticket with \n               the sleeper cabins. His long SCARF trails behind. His longer \n               cashmere COAT practically brushes the floor.\n\n               INT. TRUMAN AND HARPER LEE'S CABIN, TRAIN - CONTINUOUS\n\n               Truman opens the door. Inside the cabin his childhood friend \n               from Monroeville, Alabama, NELLE HARPER LEE (yes, that Harper \n               Lee), is reading. She looks up, deadpan --\n\n                                     NELLE\n                         I figured you'd missed it.\n\n               Nelle is a year younger than Truman, dowdy in dress, but \n               smart, tough, sensible. Truman smiles.\n\n                                     TRUMAN\n                         God I'm glad you agreed to come. \n                         You're the only one I know with the \n                         qualifications to be both a research \n                         assistant and personal bodyguard.\n                              (then, noticing)\n                         Oh, Nelle, you poor thing.\n\n               He tries to spruce up her limp silk scarf.\n\n                                     NELLE\n                         Off. Truman. Off.\n                              (holds his hands)\n                         I'm happy to see you too, but I can \n                         still whip your behind.\n\n               TWO BLACK PORTERS enter, one with an enormous TRUNK \n               (Truman's), the other with a sensible SUITCASE (Nelle's).\n\n                                     PORTER #1\n                              (reading tags)\n                         Mr. Truman Capote, Miss Nelle Harper \n                         Lee. Where would you like these, \n                         sir?\n\n                                     TRUMAN\n                         That one up there and that one on \n                         the floor.\n\n               He tips them.\n\n                                     NELLE\n                         What all did you bring?\n\n                                     PORTER #2\n                         Thank you greatly, sir. It's an honor \n                         to have you with us. If you don't \n                         mind my saying, your last book was \n                         even better than the first --\n\n                                     TRUMAN\n                         You're sweet.\n\n                                     PORTER #2\n                         Just when you think they've gotten \n                         as good as they can get.\n\n                                     TRUMAN\n                         Thank you. You're very kind.\n\n                                     PORTER #1\n                              (to Nelle)\n                         Ma'am.\n\n               The PORTERS leave. Nelle is stunned. Truman fiddles with the \n               trunk locks, his back to Nelle. Silence, then:\n\n                                     NELLE\n                         You're pathetic.\n\n               Truman doesn't answer.\n\n                                     NELLE\n                         You're pathetic.\n\n                                     TRUMAN\n                         What?\n\n                                     NELLE\n                         You paid them to say that.\n\n               Truman won't look at her. She whacks him.\n\n                                     NELLE\n                         You paid them to say that!\n\n                                     TRUMAN\n                              (squealing)\n                         How'd you know? How did you know?!\n\n                                     NELLE\n                         \"Just when you think they've gotten \n                         as good as they can get.\"\n\n                                     TRUMAN\n                         You think that was too much?\n                              (laughter)\n                         I thought that was a good line.\n\n               More laughter. More smacking of Truman. Then it is quiet.\n\n                                     NELLE\n                         Pathetic.\n\n               INT. TRUMAN AND HARPER LEE'S CABIN, TRAIN - MORNING\n\n               Nelle's awake, but still in her bunk, looking out the window \n               at the Kansas plains. Truman's dressing, watching her.\n\n                                                                    CUT TO:\n\n               EXT. COUNTRYSIDE - DAY\n\n               TRAVELING SHOTS of harvested FIELDS, grazing LIVESTOCK, \n               solitary FARMHOUSES.\n\n               The TRAIN chugs across the Kansas flatlands.\n\n               SHOTS of SIGNS outside Garden City: \"World's Largest Free \n               Swimpool\" and \"Howdy, Stranger! Welcome to Garden City. A \n               Friendly Place. \"\n\n               EXT. GARDEN CITY RENT-A-CAR - DAY\n\n               Truman and Nelle rent a car. People stare.\n\n               I/E. RENTAL CAR - DAY\n\n               Nelle drives past the main square, Truman in the passenger \n               seat. Truman looks at a photo in THE GARDEN CITY TELEGRAM.\n\n                                     TRUMAN\n                         Alvin Dewey, Kansas Bureau of \n                         Investigation. KBI.\n\n               INT. LOBBY, WALKER HOTEL, GARDEN CITY - DAY\n\n               Truman and Nelle check in. People stare. Nelle notices.\n\n               EXT. FINNEY COUNTY COURTHOUSE, GARDEN CITY - CONTINUOUS\n\n               Truman and Nelle trot up the COURTHOUSE STEPS.\n\n               INT. FINNEY COUNTY COURTHOUSE, LOBBY - MOMENTS LATER\n\n               Truman approaches the GUARD DESK.\n\n                                     TRUMAN\n                         Mr. Alvin Dewey, please.\n\n                                     GUARD\n                         Third floor. In what used to be the \n                         Sheriff's Office.\n\n               Truman CURTSIES.\n\n               INT. SHERIFF'S OFFICE - DAY\n\n               In the reception area, ALVIN DEWEY and the two other KBI \n               AGENTS assigned to the Clutter case are getting their jackets \n               on and straightening their ties. They've completely taken \n               over the office. They are: HAROLD \"Brother\" NYE (34); and \n               ROY \"Curly CHURCH (60 - bald). They all smoke.\n\n               Sheriff WALTER SANDERSON -- 60's, kind, overweight -- is \n               office-less (though he and his wife DOROTHY still live on \n               the fourth floor of the Courthouse.) WALTER lurks in the \n               background, nowhere to go, emptying one of many FILLED \n               ASHTRAYS, BOTHERED by the SMOKE. Truman and Nelle enter as:\n\n                                     CHURCH\n                         The wife said no more smoking in the \n                         house. I told her, \"Fine. Walter's \n                         got a couch upstairs in his apartment. \n                         I'll stay with him and Dorothy till \n                         we're done here.\"\n                              (to Walter)\n                         I've got my bag and a carton of \n                         cigarettes in the car.\n\n               WALTER looks uncomfortable. Dewey shakes his head at Church.\n\n                                     DEWEY\n                         Roy.\n\n                                     TRUMAN\n                         Mr. Dewey. Truman Capote from the \n                         New Yorker.\n\n               Silence. The Agents stare at him.\n\n                                     TRUMAN\n                         Hello.\n\n               Silence. Nye is looking at Truman, particularly puzzled.\n\n                                     TRUMAN\n                         Bergdorf's.\n\n                                     NYE\n                         Sorry?\n\n                                     TRUMAN\n                         The scarf.\n\n                                     NYE\n                         Oh.\n                              (then)\n                         Nice.\n\n                                     TRUMAN\n                         Thank you.\n                              (turns to Dewey)\n                         I wonder when we could arrange an \n                         interview? Some time to talk.\n\n               Dewey stubs out his cigarette.\n\n                                     DEWEY\n                         About what?\n\n                                     TRUMAN\n                         We're not looking for any inside \n                         information -- I don't care one way \n                         or another if you catch whoever did \n                         this -- I'm writing an article not \n                         about the Clutter killings, but how \n                         they're affecting the town, how you \n                         all are bearing up --\n\n                                     DEWEY\n                         I care.\n\n                                     TRUMAN\n                         Excuse me?\n\n                                     DEWEY\n                         I care.\n                              (puts on his hat, \n                              pulls out another \n                              cigarette)\n                         I care a great deal if we catch \n                         whoever did this.\n\n                                     TRUMAN\n                         Yes --\n\n                                     DEWEY\n                         As do a lot of folks around here.\n\n                                     TRUMAN\n                         Of course.\n\n               Dewey walks out. Nye and Church start out after him.\n\n                                     NYE\n                              (to Church)\n                         New Yorker?\n\n                                     CHURCH\n                         You have press credentials?\n\n                                     NYE\n                         What's the New Yorker?\n\n                                     CHURCH\n                         Magazine.\n\n                                     TRUMAN\n                         Magazines don't give out --\n\n                                     CHURCH\n                         You can come to the news conference \n                         with the rest of them.\n                              (tips his hat to Nelle)\n                         Sears and Roebuck.\n\n               Nelle and Truman are left alone.\n\n               INT. SPARE COURTROOM - DAY\n\n               Packed with PRESS from all over the Midwest, as well as local \n               Finney County CITIZENS.\n\n               Dewey's leading the press conference from a FOLDING TABLE \n               set up in front of the Judge's bench, flanked by the two \n               other KBI Agents. He's got a cigarette burning in an ashtray. \n               Truman and Nelle stand in the back.\n\n                                     DEWEY\n                         I'll talk facts but I won't speculate. \n                         The main fact here we need to be \n                         clear on is not one, but four people \n                         were killed. A lot of folks say Herb \n                         Clutter had to be the main target \n                         because he was dealt with the most \n                         brutally --\n\n                                     JOURNALIST #1\n                         Had his throat cut.\n\n                                     DEWEY\n                              (a moment)\n                         Yes. We'd all like to know why. But \n                         it could've been any one of the family \n                         they were after. We just don't know --\n\n                                     JOURNALIST #2\n                         You've identified the murder weapon?\n\n                                     DEWEY\n                         Wounds indicate a shotgun, close-\n                         range, but no casings were found.\n\n                                     JOURNALIST #1\n                         Twelve-gauge, hunting --\n\n                                     DEWEY\n                         Right.\n\n                                     JOURNALIST #1\n                         They were all shot in the face?\n\n               Dewey looks at the journalist. Then, evenly:\n\n                                     DEWEY\n                         No. Nancy in the back of the head.\n\n                                     JOURNALIST #2\n                         Is there any evidence of, I'm sorry, \n                         sexual molestation of the women?\n\n                                     DEWEY\n                         No.\n\n                                     JOURNALIST #2\n                         Anything else stolen?\n\n                                     DEWEY\n                         Kenyon's radio seems to be the only...\n\n                                     JOURNALIST #3\n                         The boy was sixteen?\n\n                                     DEWEY\n                         Fifteen. Nancy was sixteen.\n\n                                     JOURNALIST #2\n                         It's her friend that found them?\n\n                                     DEWEY\n                         Laura Kinney.\n\n                                     JOURNALIST #2\n                         Spell that?\n\n                                     DEWEY\n                         I assume you're okay with the Laura \n                         part. K-I-N-N-E-Y. But, please, leave \n                         her be.\n\n               Lots of folks try to talk at once, one OLD MAN makes himself \n               heard above the rest:\n\n                                     OLD MAN\n                         There's talk of a bunch of Mexicans, \n                         a whole bunch of Mexicans...\n\n                                     DEWEY\n                              (standing, stubs out \n                              cigarette)\n                         George, it's good to see you again. \n                         I do have an opinion whether this \n                         was the work of one man or a whole \n                         bunch, as you said, but it doesn't \n                         matter a whole lot whether it was \n                         Mexicans or Methodists or Eskimos. \n                         We're going to find whoever did this. \n                         Four good people from our community \n                         are dead. Let's remember that. Okay \n                         with you?\n                              (holds up a notice)\n                         The West Kansas Farm Committee's \n                         offering a thousand dollar reward \n                         for information leading to an arrest. \n                         Please print that.\n                              (moving to the exit)\n                         Thank you all for coming.\n\n               The room is immediately noisy as Dewey makes his way to the \n               door, pulling a pack of cigarettes from his pocket, followed \n               by Church and Nye. He's about to step out when Truman catches \n               his eye. Dewey exits.\n\n                                                                    CUT TO:\n\n               INT. RENTAL CAR - LATE AFTERNOON\n\n               Nelle drives while consulting a MAP. Truman is leaning back, \n               looking out at the passing farms through the window. He speaks \n               almost to himself.\n\n                                     TRUMAN\n                         Mr. Dewey's protective of the \n                         Clutters. I wonder how well he knew \n                         them...\n\n               Nelle glances over at him. He doesn't notice.\n\n                                     TRUMAN\n                         He was foxy with that old man.\n                              (turns to Nelle)\n                         Are you ever gonna let me drive?\n\n                                     NELLE\n                         Truman, you're a menace. You can \n                         barely see over the wheel.\n\n               Truman looks back out the window at the farms, leans back.\n\n                                     NELLE\n                         This make you miss Alabama?\n\n                                     TRUMAN\n                              (rolling window down, \n                              shakes his head)\n                         Not even a little bit.\n\n               He leans his head out, closes his eyes.\n\n               EXT. CLUTTER FARM - SUNSET\n\n               Nelle pulls their car to the side of the COUNTY ROAD which \n               fronts the CLUTTER FARM. We recognize the FARMHOUSE as the \n               one in which Nancy Clutter was found dead. A HIGHWAY PATROLMAN \n               (20 years old) sits in a CRUISER parked up the driveway.\n\n               CRIME SCENE TAPE marks the perimeter of the property. Truman \n               and Nelle get out of their car, stand at the foot of the \n               driveway, gazing at the lonely farmhouse.\n\n                                                                  FADE OUT.\n\n               EXT. HOLCOMB HIGH SCHOOL - MORNING\n\n               A gorgeous fall day. Crowds of kids arriving at school. Many \n               are SOMBER. As Truman and Nelle walk toward the kids, some \n               look warily at Truman and give him a wide berth.\n\n                                     TRUMAN\n                         Hello.\n\n               Kids back away. Nelle notices. She leaves Truman, walks up \n               to a group of THREE GIRLS.\n\n                                     NELLE\n                         Morning.\n\n                                     GIRL #1\n                         Hi.\n\n                                     NELLE\n                         Can any of you tell me where I'd \n                         find Laura Kinney?\n\n                                     GIRL #1\n                         Oh, um...\n\n               The girl glances toward the school entrance where LAURA KINNEY \n               (who found Nancy Clutter's body) walks with DANNY BURKE (tall, \n               17).\n\n                                     NELLE\n                              (gently)\n                         Is that her? With the tall boy?\n\n                                     GIRL #2\n                         Yeah. With Danny Burke.\n\n                                     NELLE\n                         Danny Burke?\n                              (Girl #2 nods)\n                         Thank you.\n\n               As Nelle leaves, Girl #1 turns to her friend:\n\n                                     GIRL #2\n                         Oh, quiet yourself, Janice.\n\n               Nelle sees Truman on his way toward Laura, calls out --\n\n                                     NELLE\n                         Truman. Truman --\n\n               Truman doesn't hear. She watches Truman approach them. Laura \n               backs away. Danny leads her off. Nelle walks over to Truman, \n               looks at him for several moments.\n\n                                     NELLE\n                         These folks live their lives in a \n                         particular way. You need to consider \n                         adapting yourself to that fact.\n\n                                     TRUMAN\n                         What --\n\n                                     NELLE\n                         -- I'm gonna find out where those \n                         two kids live. Maybe you'll let me \n                         do that alone?\n\n               Nelle leaves. On Truman, as the bell rings and the mass of \n               teenagers starts to enter the school.\n\n                                                                    CUT TO:\n\n               EXT. MAIN STREET, GARDEN CITY - DAY\n\n               Truman walks alone, sees the Gilbart Funeral Home. He removes \n               his hat, slips past the few people standing outside.\n\n               INT. GILBART FUNERAL HOME - CONTINUOUS\n\n               Warm but slightly tacky. Some people are engaged in hushed \n               conversation at the reception area. Truman slips past, into \n               the back room.\n\n               INT. BACK ROOM, GILBART FUNERAL HOME - CONTINUOUS\n\n               No people, low light. Four CLOSED CASKETS at the back of the \n               room. Truman walks over slowly. After a moment, he checks to \n               make sure he's alone. Then he LIFTS THE TOP of one of the \n               caskets. It's Bonnie Clutter's body, in a long-sleaved navy-\n               blue dress; but her head is wrapped in layers and layers of \n               white cotton gauze, and lacquered with a shiny substance -- \n               like an enormous cocoon. Truman stares.\n\n                                                                    CUT TO:\n\n               INT. WALKER HOTEL, TRUMAN'S ROOM - NIGHT\n\n               Truman on the PHONE to Jack in Brooklyn. One of Truman's \n               trunks is open, displaying bottles of liquor, packaged and \n               tinned gourmet food, and stacks of unused yellow legal pads. \n               He drinks, standing at the window.\n\n                                     JACK (OVER PHONE)\n                         I think I scared a friend of yours \n                         this morning. He came looking for \n                         you while I was writing.\n\n                                     TRUMAN\n                         You hate my friends.\n\n                                     JACK\n                         I wouldn't say hate. So long as they \n                         don't knock on my door.\n\n                                     TRUMAN\n                         I saw the bodies today.\n\n                                     JACK\n                         Which?\n\n                                     TRUMAN\n                         The Clutters. I looked inside the \n                         coffins.\n\n                                     JACK\n                         That's horrifying.\n\n                                     TRUMAN\n                         It comforts me -- something so \n                         horrifying it's freeing. It's a \n                         relief. Normal life falls away.\n                              (beat)\n                         But, then, I was never much for normal \n                         life --\n\n                                     JACK\n                         No, you weren't.\n\n                                     TRUMAN\n                         People here won't talk to me. They \n                         want someone like you, like Nelle. \n                         Me they hate.\n\n                                     JACK\n                         I can't think of a single quality I \n                         share with Nelle.\n\n                                     TRUMAN\n                         Well --\n\n                                     JACK\n                         Maybe manliness.\n\n                                     TRUMAN\n                         My point exactly.\n\n                                     JACK\n                         It's why I left the Midwest in the \n                         first place. I knew I could only \n                         find someone like you in New York \n                         City.\n\n               On Truman, gazing at the EMPTY TOWN SQUARE below.\n\n                                                                    CUT TO:\n\n               EXT. GARDEN CITY, VARIOUS - EARLY MORNING\n\n               A SHOPKEEPER sweeps the sidewalk. There are THANKSGIVING \n               DECORATIONS in his shop window.\n\n               A SCHOOL BUS picks up a SMALL BOY at the intersection of a \n               DIRT ROAD and the paved COUNTY ROAD.\n\n               A SMALL BRIDGE over the Arkansas river. Below them, men are \n               sifting the riverbed with nets, moving slowly downstream.\n\n                                                                    CUT TO:\n\n               INT. WALKER HOTEL, LOBBY - EARLY MORNING\n\n               Nelle waits by the FRONT DESK. The ELEVATOR DOORS open and \n               Truman emerges. He is DRESSED SOBERLY -- NO LONG SCARF, NO \n               LONG COAT. He walks toward Nelle, then TURNS as if he's a \n               runway model, walks away, turns again and walks back. He \n               stops a few feet in front of her. Nelle refuses to smile.\n\n                                     NELLE\n                         Let's go.\n\n                                                                    CUT TO:\n\n               EXT. HOLCOMB TOWN ROAD - EARLY MORNING\n\n               Danny Burke walks down the road with a bookbag over his \n               shoulder. Nelle approaches him, Truman keeps his distance.\n\n                                     NELLE\n                         Danny?\n                              (Danny stops)\n                         Would you mind terribly if I walked \n                         with you for a bit?\n\n               He shrugs. They walk together.\n\n                                                                    CUT TO:\n\n               EXT. LAURA KINNEY HOUSE - AFTERNOON\n\n               Laura opens door to Truman and Nelle.\n\n               INT. LAURA KINNEY HOUSE, KITCHEN - AFTERNOON\n\n               Nelle and Laura Kinney sit at the table. Truman stands at \n               the counter.\n\n                                     LAURA\n                         I thought you were from the FBI with \n                         your long coat.\n\n                                     TRUMAN\n                         Is that so?\n\n                                     LAURA\n                         That's why I ran off.\n\n                                     TRUMAN\n                         I've been getting a lot of that \n                         lately.\n\n               Truman smiles. Laura smiles back, amused, a bit comforted.\n\n                                     LAURA\n                         It's fine talking to you all. \n                         Practically nobody around here wants \n                         to talk since what happened.\n\n                                     NELLE\n                         Folks have been through a rough patch. \n                         Including you.\n                              (Laura nods)\n                         Nancy was your best friend.\n\n                                     LAURA\n                         She was my best friend.\n\n               They're quiet for a few moments.\n\n                                     NELLE\n                         How has Danny been?\n\n                                     LAURA\n                         Pretty shattered. Nothing terrible \n                         ever happened to him before. Nancy \n                         just started wearing his ring again \n                         after this huge fight -- Mr. Clutter \n                         was trying to get her to end it 'cause \n                         Danny's Catholic.\n\n                                     NELLE\n                         What were the Clutters?\n\n                                     LAURA\n                         Methodist. Danny was the last person \n                         at the house that night. That's why \n                         Mr. Dewey's keeps interviewing him -- \n                         they don't think he had anything to \n                         do with it -- just to see if he \n                         remembers anything unusual and all.\n\n                                     NELLE\n                         People in town seem to wonder if he \n                         was involved.\n\n                                     LAURA\n                         That's been real hard for Danny.\n\n                                     TRUMAN\n                         Oh, it's the hardest -- when people \n                         have a notion about you and it's \n                         impossible to convince them otherwise. \n                         Since I was a child folks have thought \n                         they had me pegged because of the \n                         way I look and the way I talk. They're \n                         always wrong.\n                              (looks at her)\n                         Do you know what I mean?\n\n               Laura stares at him and nods. He's clearly struck a chord.\n\n                                     LAURA\n                         I want to show you something.\n\n               She goes in the door to the GROUND FLOOR APARTMENT. They see \n               her through the LACE CURTAINS getting something from her \n               DESK, which is stacked with books. Truman whispers to Nelle:\n\n                                     TRUMAN\n                         Not one person here understands her.\n\n               Laura returns. She hugs a SMALL BOOK to her chest. After a \n               moment, she holds it out to them.\n\n                                     LAURA\n                         Maybe you'll get a better picture of \n                         Nancy. And the family.\n\n                                     NELLE\n                         What is this?\n\n                                     LAURA\n                         It's her diary.\n\n                                                                    CUT TO:\n\n               INT. RENTAL CAR/EXT. NEIGHBORHOOD - AFTERNOON\n\n               Nelle and Truman walk quickly back to the hotel. Nelle has \n               the diary open.\n\n                                     NELLE\n                         \"Danny here tonight and we watched \n                         TV. So nice just having him sit with \n                         us. Left at eleven. P.S. -- He's the \n                         only one I really love.\"\n\n               She turns the page. The rest of the book is blank.\n\n                                     NELLE\n                         And that was that.\n\n                                     TRUMAN\n                         The end of a life.\n\n                                                                    CUT TO:\n\n               INT. WALKER HOTEL, NELLE'S ROOM - LATE NIGHT\n\n               Nelle typing. Truman is propped up on pillows on the bed, \n               scrunching his eyes to remember what was said that afternoon, \n               then writing quickly on one of many YELLOW LEGAL PADS, handing \n               the pages of interview dialogue to Nelle. He's exhausted. \n               Nelle stops typing a moment, looks through the pages Truman \n               has handed her:\n\n                                     NELLE\n                         \"Shattered.\"\n\n                                     TRUMAN\n                         \"Pretty shattered. Nothing terrible \n                         ever happened to him before. \"\n\n               He pushes some pillows aside and lies down.\n\n                                     TRUMAN\n                         I have 94 percent recall of all \n                         conversations.\n\n                                     NELLE\n                         94 percent.\n\n                                     TRUMAN\n                         I've tested myself.\n\n                                     NELLE\n                              (scans some of what \n                              he's written)\n                         I hate that you're better than me at \n                         this.\n\n               She turns back to the typewriter. She types. Truman lies \n               there, looking at the ceiling for a few moments. He closes \n               his eyes. Nelle knows without looking --\n\n                                     NELLE\n                         Don't you dare close your eyes on my \n                         bed.\n\n               No answer. She keeps typing.\n\n                                     NELLE\n                         Stand up and walk out that door. Go \n                         to your room if you're gonna sleep. \n                         Truman. Truman.\n\n               Nelle turns to look at him. He's asleep. She goes back to \n               typing. Under her breath:\n\n                                     NELLE\n                         Crap.\n\n                                                                  FADE OUT.\n\n               INT. WALKER HOTEL, BREAKFAST ROOM - LATE MORNING\n\n               Truman drinks coffee alone, sleepy. He takes a SMALL BOTTLE \n               of HOT-PEPPER TABASCO from his jacket pocket and shakes it \n               over his EGGS. He replaces the bottle in his jacket. Nelle \n               walks into the lobby from upstairs, heads for Truman.\n\n                                     NELLE\n                         What right do you have being tired? \n                         You were snoring blissfully --\n\n                                     TRUMAN\n                         I don't snore --\n\n                                     NELLE\n                         -- while I lay there, hating you --\n\n                                     TRUMAN\n                         You don't hate me.\n\n                                     NELLE\n                         Not much.\n                              (She sits. Truman \n                              holds out a NOTE)\n                         What?\n                              (takes it, looks)\n                         Marie Dewey?... We've got somewhere \n                         to go for Thanksgiving supper.\n\n                                     TRUMAN\n                         Apparently Detective Foxy's wife has \n                         a better opinion of me than Detective \n                         Foxy.\n\n                                                                    CUT TO:\n\n               EXT. DEWEY HOME - AFTERNOON\n\n               Ding Dong. We see the FRONT DOOR open. Reveal MARIE DEWEY -- \n               pretty, 35, dressed primly -- and her two boys: ALVIN JR. \n               (9), and PAUL (6), lurking behind, curious. Marie smiles.\n\n                                     MARIE\n                         You came.\n\n               Reverse onto Nelle... and Truman, dressed in a DARK SUIT, \n               hair neatly combed, like an Exeter schoolboy attending a \n               funeral. Nelle smiles.\n\n                                     NELLE\n                         Hi.\n\n               Nelle nudges Truman, who hands over his gifts: a BOTTLE OF \n               J&B, and a PACKAGE of GOURMET SPICED NUTS.\n\n                                     TRUMAN\n                              (soberly)\n                         Thank you for having us.\n\n                                     MARIE\n                              (mock serious)\n                         Thank you.\n                              (then:)\n                         Get yourselves in here.\n                              (turns and walks into \n                              the house)\n                         Alvin! Get your pants on. They're \n                         here.\n\n               On Nelle and Truman, surprised.\n\n               INT. DEWEY HOME, LIVING ROOM - AFTERNOON\n\n               A FOOTBALL GAME plays on the television. No one's watching. \n               We can HEAR Alvin on the phone in his study at the back of \n               the house.\n\n               INT. DEWEY HOME, KITCHEN - CONTINUOUS\n\n               Truman and Marie at the stove. Nelle sits at the kitchen \n               table. Truman has his jacket off and an apron on, as does \n               Marie. They are peering into a POT OF BLACK-EYED PEAS. Marie \n               is shaking in drops of HOT PEPPER TABASCO.\n\n                                     TRUMAN\n                         More. More.\n\n                                     MARIE\n                         Alvin will hate this.\n\n                                     TRUMAN\n                         Yes, but we who know the truth will \n                         love it.\n\n                                     MARIE\n                              (laughs)\n                         I have to stop.\n                              (then)\n                         I cannot believe you're from New \n                         Orleans. I miss it so much.\n\n                                     TRUMAN\n                         I only lived there for a short while \n                         but my Mama was born and bred.\n\n                                     MARIE\n                         You know something -- Alvin pretends \n                         he doesn't know who you are, but the \n                         minute you came to town he read your \n                         books. He had one of his men pick up \n                         \"Breakfast at Tiffany's\" in Kansas \n                         City 'cause it's banned from the \n                         library here.\n\n                                     TRUMAN\n                         What did Mr. Dewey think?\n\n                                     MARIE\n                         He liked it more than he's willing \n                         to admit.\n\n                                     TRUMAN\n                         How very foxy.\n\n               Marie smiles at that word used to describe her husband.\n\n                                     TRUMAN\n                         Mama would've put in half the bottle \n                         by now.\n\n               Beat.\n\n                                     MARIE\n                         Alright, one more shake.\n\n               INT. DEWEY HOME, HALLWAY - CONTINUOUS\n\n               Alvin walks toward the kitchen. He smokes. He looks exhausted. \n               He hears SQUEALS of laughter.\n\n               INT. DEWEY HOME, KITCHEN - CONTINUOUS\n\n               Alvin enters. They all stop laughing and look at him. nods \n               to Truman and Nelle.\n\n                                     TRUMAN\n                         Hello.\n\n                                     NELLE\n                         Hi.\n\n               Silence. Marie sips her drink.\n\n                                     MARIE\n                         How you doing, foxy?\n\n               She cracks up.\n\n               INT. DEWEY HOME, DINING ROOM - LATER\n\n               The remains of dinner. The kids have left. The bottle of J&B \n               sits on the table, half-empty. Marie's a bit drunk. Everyone's \n               PLATE is clean except for Alvin's, on which sits a MOUND of \n               uneaten black-eyed peas. Truman is mid-story.\n\n                                     TRUMAN\n                         I was writing the script as they \n                         were filming, all that time in Italy. \n                         I'd work like mad all day long and \n                         then dash down to the bar around \n                         midnight to hand in the next day's \n                         scenes. Humphrey had just about moved \n                         into the hotel bar --\n\n                                     MARIE\n                              (whispers to Alvin)\n                         Humphrey Bogart.\n\n               Alvin knows.\n\n                                     TRUMAN\n                         -- where he and John drank every \n                         night --\n\n                                     MARIE\n                              (to Alvin)\n                         John Huston.\n\n               Alvin knows.\n\n                                     TRUMAN\n                         -- and I mean drank, like famished \n                         water buffaloes. Well -- I'd only \n                         just handed them the final scene \n                         when the bellhop told me I had a \n                         phone call. It was my stepfather, \n                         Joe Capote, calling to say that my \n                         mother had died. I flew home to New \n                         York -- terribly distraught -- but \n                         when I got to the apartment I could \n                         see that Joe was in even worse shape \n                         than I was. He grabbed my hands and \n                         sat me down at the kitchen table, \n                         and he said to me, \"Talk. Talk about \n                         anything, any subject in the world. \n                         Don't worry whether it will interest \n                         me or not. Just talk so I won't break \n                         down.\" And I did. He couldn't bear \n                         to be alone with his thoughts. It \n                         was too painful.\n\n               It's quiet for a moment, then Marie looks at Alvin.\n\n                                     MARIE\n                         It's been a hard couple weeks for \n                         Alvin. He and Herb Clutter were good \n                         friends. From church.\n\n                                     DEWEY\n                         Marie --\n\n                                     MARIE\n                         Oh come on, Alvin. These are good \n                         people.\n\n               Finally, Dewey looks at Truman and Nelle.\n\n               INT. DEWEY HOME, STUDY - NIGHT\n\n               Alvin shows Truman and Nelle the CRIME SCENE PHOTOS from the \n               Clutter murders. We see the four corpses, BOUND and SHOT, \n               the bloody footprints in the Clutter basement. Truman and \n               Nelle stare at the photos of Nancy and Kenyon. Then, quietly --\n\n                                     TRUMAN\n                         Who would put a pillow under the \n                         boy's head just to shoot him? Why \n                         would they tuck Nancy in?\n\n                                     DEWEY\n                              (surprised by the \n                              insight)\n                         I want to know the same thing.\n\n               Truman hands Nelle one of the photos. She looks at it --\n\n                                     NELLE\n                         Twisted notion of tenderness.\n\n                                                                    CUT TO:\n\n               EXT. DEWEY HOME - NIGHT\n\n               Truman and Nelle are leaving. Alvin and Marie stand in the \n               front door. Nelle kisses Marie.\n\n                                     NELLE\n                         Thank you.\n\n                                     MARIE\n                         So many of my friends would love to \n                         meet you.\n\n                                     NELLE\n                         That'd be fine --\n\n                                     TRUMAN\n                              (to Dewey)\n                         You don't have to worry. I'm not \n                         going to write about this until \n                         everything's over.\n\n                                     DEWEY\n                         I'm not worried. I know what room \n                         you're in at the hotel. And I know \n                         where you live in Brooklyn.\n\n               Truman smiles.\n\n                                                                    CUT TO:\n\n               EXT. GARDEN CITY - VARIOUS - DAY AND NIGHT\n\n               MUSIC: \"Have yourself a Merry Little Christmas...\" Main \n               Street, CHRISTMAS LIGHTS in the TREES.\n\n               The HARDWARE STORE, with Santa Claus DECORATIONS in the window \n               and a \"ONE WEEK LEFT TO BUY YOUR GIFTS...\" sign.\n\n                                                                    CUT TO:\n\n               EXT. CLUTTER FARM - LATE AFTERNOON\n\n               Truman and Nelle walk with PETE HOLT (70, very frail) on the \n               Clutter property. Apples rot on the ground, the trees are \n               bare, signs of disrepair are beginning to weather the house.\n\n                                     HOLT\n                              (re the apples)\n                         I'd of picked them up but I haven't \n                         been myself. Mind you, I make the \n                         walk out here every day, check the \n                         house, make sure the pipes don't \n                         freeze -- that sort of item. The \n                         least I can do for Mr. Clutter.\n\n                                     NELLE\n                         How long have you worked here?\n\n                                     HOLT\n                         1940 -- a lotta years. The wife too, \n                         cleaning the house. Cooking.\n\n                                     NELLE\n                         Well, she's marvelous. Lunch was \n                         wonderful.\n\n                                     HOLT\n                              (ignoring this)\n                         She had a hard job after what all \n                         happened. Cleaning. I burned most of \n                         the rest -- mattresses -- too far of \n                         a mess.\n                              (then, looks at them)\n                         I've asked around some -- if anyone's \n                         looking for a strong hand.\n\n               They don't know what to say. Finally, he looks away.\n\n                                     HOLT\n                         I don't think they'll be able to \n                         sell the place till they catch the \n                         ones that did it.\n                              (beat)\n                         That's what I hear anyhow.\n\n               Silence as the three of them look out over the barren fields.\n\n               INT. CLUTTER HOUSE, BONNIE'S BEDROOM - DUSK\n\n               Just the bed-frame -- the mattress is gone. Truman and Nelle \n               find her Bible on the bedside table, her bookmark, see the \n               painting of Jesus walking on water. Pete Holt stands off to \n               the side, waiting patiently.\n\n                                                                    CUT TO:\n\n               EXT. WALKER HOTEL LOBBY, GARDEN CITY - NIGHT\n\n               Through the front window we see a Christmas tree in the lobby.\n\n               INT. WALKER HOTEL, TRUMAN'S ROOM - NIGHT\n\n               Jazzy Christmas music on the RADIO. Nelle sits in the big \n               armchair with a drink. She laughs. We HEAR Jack on the phone:\n\n                                     JACK\n                         You're celebrating.\n\n               We see Truman wearing a YELLOW SILK SHORT ROBE with white \n               lace, bare legs. He's on the phone and walking, for Nelle's \n               enjoyment, back and forth, like a runway model.\n\n                                     TRUMAN\n                         Remember Nelle's manuscript she sent \n                         me in New York?\n\n                                     JACK\n                         Mockingbird. Killing a Mockingbird. \n                         You said it was good.\n\n                                     TRUMAN\n                         And I was right. She just heard \n                         Lipincott wants to publish it.\n\n                                     JACK\n                              (pause)\n                         Well. Jesus. That's terrific. Tell \n                         her congratulations.\n\n                                     TRUMAN\n                         Congratulations.\n                              (covers phone, mouths \n                              to Nelle:)\n                         Jealous.\n\n                                     JACK\n                         Just promise you'll be home by \n                         Christmas.\n\n                                     TRUMAN\n                         I can't leave now Jack -- I mean it \n                         was hard at first, but now I'm \n                         practically the mayor.\n\n               He vamps. Nelle laughs.\n\n                                     JACK\n                         Alright.\n\n                                     TRUMAN\n                         I want to come home -- I do. Though \n                         if they catch whoever did this, who \n                         knows what -- I'll probably be here \n                         til next Christmas.\n\n                                     JACK\n                         Right. I'll let you go.\n\n                                     TRUMAN\n                         Jack, we'll go away this spring to \n                         write. Maybe Spain...\n\n                                     JACK\n                         Alright, Truman.\n\n                                     TRUMAN\n                         Bye.\n                              (hangs up)\n                         The poor boy misses me.\n\n               Goes to the mini-bar to fix a drink.\n\n                                     NELLE\n                         Truman.\n\n                                     TRUMAN\n                         Nelle.\n\n                                     NELLE\n                         You remember when we were kids?\n\n                                     TRUMAN\n                         I was never a kid. I was born fully \n                         formed.\n\n                                     NELLE\n                         I had no idea what a homosexual was. \n                         But I knew whatever they were, you \n                         were one of 'em.\n\n               Truman puts down his drink and marches out of the room, shuts \n               the door. Nelle's unsure whether she really insulted him. \n               From the HALL, we hear a WOMAN SHRIEK, and a MAN saying:\n\n                                     MAN IN HALL (O.S.)\n                         Oh. Uh. Oh. Excuse us.\n\n               Truman runs back in, shuts door. They crack up.\n\n                                                                    CUT TO:\n\n               EXT. DEWEY HOME - NIGHT, CHRISTMAS EVE, ESTABLISHING\n\n               Tasteful Christmas lights strung on the BUSHES. A WREATH on \n               the FRONT DOOR.\n\n               INT. DEWEY HOME, LIVING ROOM - NIGHT\n\n               Truman, Nelle, Marie and Alvin. Drinks. A FULL ASHTRAY on \n               the coffee table in front of Alvin. He's distracted, smoking. \n               Marie holds a WOMEN'S MAGAZINE, checking what Truman says \n               with what's written there.\n\n                                     TRUMAN\n                              (quickly, as if \n                              reciting)\n                         -- girdle up -- no extra bulges -- \n                         if you're dressed right for him when \n                         he gets home, the evening should be \n                         smooth sailing. Bon voyage, gals.\n\n                                     MARIE\n                         I can't believe you got this whole \n                         page -- I only read it to you once!\n\n                         TRUMAN\n                 I've trained myself.\n\n                                                       NELLE\n                                               ...trained myself.\n\n               Truman looks at Nelle.\n\n                         TRUMAN\n                 I have 94 percent \n                 recall.\n\n                                                       NELLE\n                                               ...94 percent recall.\n\n                                     TRUMAN\n                              (laughing)\n                         You cut that out.\n\n               Alvin stubs out his cigarette -- though it still burns. He \n               stands.\n\n                                     MARIE\n                         You believe that Alvin?\n\n                                     ALVIN\n                         Impressive.\n\n               He walks out. Silence.\n\n                                     MARIE\n                         I'm sorry. He's upset.\n                              (stubs out cigarette)\n                         -- smoking three packs a day.\n                              (then)\n                         Two men did it. They know who. One \n                         of them used to have a cellmate who \n                         gave him up for the thousand dollar \n                         reward. They passed through Kansas \n                         City last week writing bad checks -- \n                         by the time Alvin's boys got up there \n                         they'd skipped out again.\n\n                                     NELLE\n                         Where to?\n\n                                     MARIE\n                         They have no idea.\n\n               INT. DEWEY HOME, DINING ROOM - LATER\n\n               Christmas dinner. Truman, Nelle, Marie and Alvin have just \n               sat down. They wait for the Dewey boys -- Alvin Jr. and Paul. \n               We hear them in the living room horsing around.\n\n                                     DEWEY\n                         Alvin. Paul. Now.\n\n               It's quiet for a second. Then something crashes and breaks.\n\n                                     DEWEY\n                         Damnit.\n                              (gets up, goes)\n                         Come here.\n\n                                     MARIE\n                         Alvin ...\n\n               Phone RINGS.\n\n                                     DEWEY (O.S.)\n                         Alvin Jr. Get over here.\n\n                                     ALVIN JR. (O.S.)\n                         Dad, the phone.\n\n                                     DEWEY (O.S.)\n                         Paul. Back to the table.\n\n               Dewey returns to the dining room, pushing Paul ahead of him.\n\n                                     DEWEY\n                         Sit.\n\n               Alvin Jr. enters.\n\n                                     ALVIN JR.\n                         Dad?\n\n                                     MARIE\n                         Tell them we're at dinner, Alvin.\n\n                                     ALVIN JR.\n                         Dad?\n\n                                     DEWEY\n                         Not now, Alvin.\n\n               Alvin Jr. leaves. We hear the PHONE being HUNG UP. Alvin Jr. \n               returns and sits. They all get ready to say grace, then:\n\n                                     ALVIN JR.\n                         You need to call the Chief of Police \n                         in Las Vegas when you have a minute.\n\n               Everyone looks at Dewey.\n\n                                                                  FADE OUT:\n\n               EXT. COURTHOUSE SQUARE, GARDEN CITY - LATE AFTERNOON\n\n               OVER BLACK SCREEN we hear the voice of a RADIO ANNOUNCER.\n\n                                     RADIO ANNOUNCER (V.O.)\n                         ...This is KERG radio, Garden City. \n                         A friendly broadcast from a friendly \n                         place. Our lead story:\n\n               Slowly, the sounds of a CROWD emerge in the background.\n\n               FADE UP ON: HIGH SCHOOL kids sitting on the hood and front \n               seat of a CHEW parked at the edge of a CROWD of 200 people. \n               Truman watches. It is COLD. A fat, shivering CO-ED reads the \n               headline in the Kansas City Star: \"Police Fear Lynch Mob.\" \n               The CAR RADIO is on.\n\n                                     RADIO ANNOUNCER (V.O.)\n                         ...newsmen from six states have joined \n                         scores of Kansans as they await the \n                         arrival of confessed killers Perry \n                         Smith and Richard Hickock. KBI \n                         officers have been driving the Clutter \n                         family's brutal killers nonstop \n                         from...\n\n               Truman moves from the car into the large crowd. Old ladies; \n               ranchers; local businessmen; moms with kids; journalists \n               INTERVIEWING citizens; photographers lined up at the bottom \n               of the COURTHOUSE STEPS. We hear snippets of conversation as \n               we pass. A CITIZEN is being interviewed by a JOURNALIST; a \n               MOM WITH BABY standing with a FRIEND; a MIDDLE-AGED man in \n               an overcoat CRYING silently.\n\n               Truman approaches Nelle and Marie Dewey, standing together \n               at the curb in front of the courthouse, near the \n               photographers. They are talking quietly, turn to Truman --\n\n                                     NELLE\n                         Hey.\n\n               We hear LOUD CROWD NOISE at the south end of the square. A \n               CONVOY of FOUR CARS enters the square. It pulls around to \n               the front of the courthouse. STATE TROOPERS spill out of the \n               lead and rear CARS. Nye gets out of the second car. He opens \n               the back door. The crowd falls SILENT. Two state troopers \n               get DICK HICKOCK -- handcuffed, pale -- out of the car and \n               lead him up the steps. FLASH. FLASH.\n\n               Dewey and Church open the third car's back door. Silence. \n               They retrieve PERRY SMITH. Perry is extremely SHORT, STRONG, \n               ODDLY BEAUTIFUL, with the dark skin and hair of his American \n               Indian mother, and the pug features of his Irish father. As \n               he stands, he has trouble straightening his stubby LEGS, as \n               if they are arthritic. Truman stares.\n\n                                     MARIE\n                              (whispers to Truman)\n                         Motorcycle accident. He broke them \n                         and they never healed right.\n                              (Truman looks at her)\n                         Alvin told me.\n\n               Truman watches Perry, transfixed. Perry seems terrified of \n               the crowd, all the faces, like a child. Perry scans the crowd. \n               His eyes fall on Truman. FLASH. FLASH. Truman and Perry look \n               at each other as Perry is led slowly past. At the top of the \n               steps the COURTHOUSE DOORS slam shut.\n\n                                                                  FADE OUT:\n\n               EXT. SHERIFF'S RESIDENCE (4TH FLOOR OF COURTHOUSE ) - \n               MORNING\n\n               FADE IN: Truman knocks on the door, a NEWSPAPER, a BOOK, and \n               a PAPER BAG in his hand. On the door it says \"SHERIFF'S \n               RESIDENCE - PRIVATE\". Dorothy Sanderson opens the door.\n\n                                     DOROTHY\n                         Truman Capote.\n\n                                     TRUMAN\n                         Dorothy Sanderson. I figured you'd \n                         be left alone this morning by that \n                         hard-working husband of yours.\n                              (holds up bag)\n                         So I have breakfast.\n                              (holds up paper)\n                         I have news.\n                              (book)\n                         And I have literature. My friend \n                         Jack mailed me the book you wanted.\n\n               He presents book. Dorothy, flattered, takes it, reads the \n               inscription inside.\n\n                                     DOROTHY\n                         \"For the maiden of the Midwest, the \n                         priestess of the plains, the queen \n                         of the kitchen: my first novel. \n                         Truman.\"\n\n               It is \"Other Voices, Other Rooms\" and we see on the back of \n               it the INFAMOUS JACKET PHOTO of Truman at 23 draped sexily \n               on a couch. Truman curtsies. The PHONE RINGS.\n\n                                     DOROTHY\n                         You're too much. Go on into the living \n                         room, lemme grab that -- it's been \n                         ringing all morning.\n\n               INT. SHERIFF'S RESIDENCE, FOYER - CONTINUOUS\n\n               Truman walks into the residence. To the left is the kitchen; \n               to the right is the living room. Truman looks back at Dorothy -- \n               she's still on the phone. He heads for the kitchen.\n\n               INT. SHERIFF'S RESIDENCE, KITCHEN - CONTINUOUS\n\n               Truman walks slowly through the doorway of the large kitchen. \n               On the far side of the kitchen is a JAIL CELL. Inside the \n               cell is PERRY SMITH. (Now we know why Truman came here.)\n\n               Truman STARES. Perry doesn't see him -- he's resting his \n               head on a small table, the tip of his THUMB in his mouth. \n               The chair seems too tall for Perry. He looks like a lonely \n               kindergartner, told to take his afternoon nap. After several \n               moments, Dorothy enters, flustered:\n\n                                     DOROTHY\n                         Oh. Truman. I meant in there.\n                              (points to living \n                              room)\n                         I... um...\n\n               Perry sits up quickly, rubs his legs.\n\n                                     DOROTHY\n                         It's the women's cell. It's hardly \n                         ever used. But they wanted to, um, \n                         separate... Please. Let's sit in the \n                         living room. I'll set up in the living \n                         room.\n\n               She gathers a tray of Truman's PASTRIES, and COFFEE CUPS.\n\n                                     DOROTHY\n                         Come.\n\n               She goes -- Truman starts to follow, then lingers.\n\n                                     TRUMAN\n                         They put you in the women's cell.\n\n                                     PERRY\n                         Among other indignities.\n\n               Perry's voice is oddly high, whispery -- special words are \n               precisely enunciated.\n\n                                     TRUMAN\n                         Well... she's a good cook.\n\n                                     PERRY\n                         She's scared of me.\n\n                                     TRUMAN\n                         I think so am I. A little bit.\n\n                                     PERRY\n                         Are you?\n                              (a moment, then:)\n                         You have any aspirin? My legs --\n\n               Dorothy's in the doorway.\n\n                                     DOROTHY\n                         Um. Truman? All set.\n\n               Truman looks at Dorothy, looks back at Perry.\n\n                                     TRUMAN\n                         I'm sorry.\n\n                                                                    CUT TO:\n\n               INT. COURTROOM - DAY\n\n               Judge ROLAND TATE, white-haired, imperious, bangs his gavel. \n               The packed crowd quiets down. Perry and Dick sit at the \n               defense table chewing JUICY FRUIT GUM. Next to them: their \n               aged court-appointed lawyer, Franklin Weeks (70).\n\n               Dick wears a SHIRT AND TIE. Perry wears jeans rolled up at \n               the cuff, his SHIRT OPEN at the collar. He draws on a piece \n               of paper with a STUBBY PENCIL -- a rather good picture of a \n               LARGE PARROT. Truman sits with Nelle, watching Perry --\n\n                                     TRUMAN\n                              (murmurs)\n                         His feet don't touch the floor.\n\n                                     JUDGE TATE\n                         In the matter of the State of Kansas \n                         v. Richard Eugene Hickock and Perry \n                         Edward Smith this Court has been \n                         informed by counsel -- Mr. Weeks -- \n                         that defendants wish to waive their \n                         right to Preliminary Hearing. Mr. \n                         Hickock, is that your wish?\n\n               Hickock looks at Weeks. Weeks nods. Hickock stands.\n\n                                     HICKOCK\n                              (unconvincing)\n                         Yessir. Yes.\n\n               Hickock sits. Truman whispers to Nelle --\n\n                                     TRUMAN\n                         Why are they doing that?\n\n                                     JUDGE TATE\n                         Mr. Smith.\n\n                                     PERRY\n                              (stands... then:)\n                         I ask that the waiver be effectuated.\n\n               Judge Tate looks at him for a moment --\n\n                                     JUDGE TATE\n                         So noted.\n                              (bangs gavel)\n                         We're adjourned.\n\n               Crowd gets up. Much talk. Truman watches Perry and Dick \n               through the forest of bodies. They are led away in handcuffs. \n               Franklin Weeks stands slowly, then begins gathering his things -- \n               he's old and it takes him ages to collect his papers. Truman \n               watches.\n\n                                                                    CUT TO:\n\n               EXT. SHERIFF'S RESIDENCE - AFTERNOON\n\n               Truman knocks. He holds a PIE. Dorothy answers.\n\n                                     DOROTHY\n                         Mr. Capote.\n\n                                     TRUMAN\n                              (offers pie)\n                         Madame Sanderson.\n\n                                     DOROTHY\n                         Is that for the two of us to share? \n                         Or for me to eat alone while you \n                         talk to our guest?\n\n               Truman is caught. He smiles.\n\n               INT. SHERIFF'S RESIDENCE, KITCHEN - AFTERNOON\n\n               Truman sits near the bars of the cell. Perry draws on a scrap \n               of paper at the small table. Dorothy watches from the door \n               to the living room. The BOOK Truman gave to Dorothy lies on \n               the floor next to Perry's meticulously made bed.\n\n                                     TRUMAN\n                         Was it your choice to waive the \n                         hearing?\n\n               Perry doesn't answer. Dorothy checks her watch, leaves. Truman \n               takes a bottle of BAYER ASPIRIN out of his pocket.\n\n                                     TRUMAN\n                         You still need some?\n                              (Perry doesn't move)\n                         Give me your hand.\n\n               Perry extends his hand through the bars. As Truman shakes \n               some aspirin into it --\n\n                                     PERRY\n                         I could kill you if you got too close.\n\n               Perry puts the aspirin in his mouth, CHEWS THEM, holds out \n               his hand for more. Truman gives him more, which Perry puts \n               in his pocket for later.\n\n                                     TRUMAN\n                         Would you like some water?\n\n               Perry shakes his head. Silence.\n\n                                     TRUMAN\n                         Mrs. Sanderson lent you my book --\n\n                                     PERRY\n                         He said we'd curry favor with the \n                         Judge if we waived our rights.\n\n                                     TRUMAN\n                         Who did?\n\n                                     PERRY\n                         The lawyer.\n\n                                     TRUMAN\n                         Okay.\n\n               Truman nods, not wanting to push this any further. Perry \n               picks up the book, holds it out through the bars.\n\n                                     PERRY\n                         Your picture's undignified. People \n                         recall first impressions.\n\n                                     TRUMAN\n                         What's been your first impression?\n\n                                     PERRY\n                         You want something.\n\n                                     TRUMAN\n                         From you?\n\n               Dorothy pokes her head in from the living room.\n\n                                     DOROTHY\n                         Truman. Walter's gonna be home soon.\n\n                                     TRUMAN\n                              (to Perry)\n                         I just want permission to talk.\n                              (then)\n                         Has anyone else visited?\n\n               Perry doesn't answer.\n\n                                     DOROTHY\n                         Truman --\n\n                                     TRUMAN\n                         Will you tell me if you need anything? \n                         I can have whatever you want sent \n                         from New York.\n                              (no answer)\n                         Will you do that?\n\n               On Perry, considering whether to trust this man.\n\n                                                                    CUT TO:\n\n               INT. NEW YORKER, WILLIAM SHAWN'S OFFICE - LATE AFTERNOON\n\n               Phone RINGS, WILLIAM SHAWN answers (50, New Yorker editor, \n               conservatively attired) at a desk looking onto 44th street.\n\n                                     SHAWN\n                         William Shawn.\n\n                                     TRUMAN (OVER PHONE)\n                         Gorgeous?\n\n                                     SHAWN\n                         Truman.\n\n               INTERCUT to Truman in a PHONE BOOTH outside the COURTHOUSE.\n\n               INT. COURTHOUSE PHONEBOOTH - DAY\n\n                                     TRUMAN\n                         I'm writing a book. It's too much \n                         for a single article -- this town, \n                         the killers most of all -- you will \n                         be stunned by Perry Smith --\n\n                                     SHAWN\n                         Why? What has he --\n\n                                     TRUMAN\n                         Not much yet, but I know. I can sense \n                         him. He's desperately lonely, \n                         frightened... I have questions -- \n                         are you ready?\n\n                                     SHAWN\n                         Would it matter --\n\n                                     TRUMAN\n                         How much more money can you send me? \n                         How quickly can you get Dick Avedon \n                         out here to take some pictures?\n\n               INTERCUT to WILLIAM SHAWN'S OFFICE. On Shawn -- he doesn't \n               know how to begin to respond.\n\n                                                                    CUT TO:\n\n               INT. HICKOCK'S JAIL CELL - DAY\n\n               Perry has been placed in an adjoining cell for the afternoon. \n               He COMBS his greased hair in a mirror. A camera FLASHES.\n\n               Nelle and Truman sit outside the cells. Franklin Weeks dozes \n               off to the side. RICHARD AVEDON -- small, dark, wiry, \n               flamboyant -- is snapping photos of a bare-chested Hickock \n               in the next cell, particularly his TATTOOS, while Hickock \n               chatters away.\n\n                                     HICKOCK\n                         Perry, honey. You look terrific...\n\n               Perry is embarrassed, glances over at Truman. FLASH.\n\n                                     HICKOCK\n                         Calm yourself down, sweetheart.\n\n               Perry glances at Nelle. She MOTIONS to him that his SHIRT is \n               buttoned wrong. Perry fixes it, looks back at her.\n\n               Hickock notices Truman gazing at his tattoos -- the one on \n               his CHEST: the word PEACE, with a cross radiating rays of \n               light.\n\n                                     HICKOCK\n                         Be patient, Capote. Maybe later \n                         they'll send you my skin.\n\n                                     TRUMAN\n                         I have the perfect place for it, \n                         over the hearth.\n\n               Hickock smiles. FLASH. Truman looks over at Perry, sitting \n               alone. Truman starts to remove his TIE.\n\n               PHOTOS, in quick succession: Of Hickock pulling up his sleeve \n               to reveal his tattoos. Of Perry combing his HAIR. FLASH. The \n               GRINNING CAT on Hickock's hand. FLASH. Perry looking directly \n               at the camera. FLASH.\n\n                                                                    CUT TO:\n\n               INT. COURTHOUSE - MORNING, ONE MONTH LATER\n\n               Series of shots in and around the courthouse:\n\n               TITLE UP:             \"One month later\"\n\n               An officer approaches down a long hallway. A janitor cleans \n               the basin of the water fountain. Spectators are drawn into \n               the courthouse. The officer opens the courtroom doors. A \n               crescendo of sounds.\n\n               INT. COURTROOM - DAY\n\n               Spectators take seats. The jury files back into the box. \n               Perry and Dick chew gum. Perry wears TRUMAN'S TIE, and draws \n               on a pad with a NEW SET OF COLORED PENCILS -- another PARROT, \n               quite beautiful, now YELLOW. Nelle and Truman sit together.\n\n                                     NELLE\n                         Where'd Perry get the art set?\n\n               Truman shrugs. Nelle raises her eyebrows. Judge Tate GAVELS \n               loudly, looks to the jury.\n\n                                     JUDGE TATE\n                         Members of the jury. Have you reached \n                         a verdict?\n\n                                     FOREMAN\n                              (stands)\n                         Yes sir.\n\n                                     JUDGE TATE\n                         Defendants rise.\n\n               Perry and Dick stand. Judge Tate turns back to the Foreman.\n\n                                     JUDGE TATE\n                         Perry Edward Smith and Richard Eugene \n                         Hickock stand accused of four counts \n                         of the crime of murder in the first \n                         degree. Have you reached a unanimous \n                         verdict?\n\n                                     FOREMAN\n                         We have, your honor.\n\n                                     JUDGE TATE\n                         What is your verdict?\n\n                                     FOREMAN\n                         Guilty. On all counts.\n\n                                     JUDGE TATE\n                         Have you unanimously reached a \n                         sentence.\n\n                                     FOREMAN\n                         We have, your honor.\n\n                                     JUDGE TATE\n                         What is the sentence?\n\n                                     FOREMAN\n                         Death.\n\n               Judge nods, the foreman sits. Judge turns to Perry and Dick.\n\n                                     JUDGE TATE\n                         Perry Edward Smith and Richard Eugene \n                         Hickock. You've been found guilty of \n                         four counts of murder in the first \n                         degree. You will be taken to the \n                         state penitentiary at Lansing. No \n                         later than midnight, May 13 of this \n                         year, nineteen hundred and sixty, \n                         each of you will be hanged by the \n                         neck until dead. So ordered.\n\n               He GAVELS. Perry and Dick are set upon by Sheriff's Deputies \n               and led out. Photographers crowd them. Dick turns to Perry.\n\n                                     HICKOCK\n                         Alright, partner. Least now we're \n                         not the only killers in Kansas.\n\n               Perry looks at him, utterly lost. FLASH.\n\n                                                                    CUT TO:\n\n               INT. WALKER HOTEL, NELLE'S ROOM - JUST BEFORE DAWN\n\n               Nelle sits at the window, smoking. Truman in the armchair, \n               holding a drink. They've been up all night. Their bags are \n               packed. Also -- a few packed boxes of written -- in yellow \n               notepads and many typed pages. Truman glances at his watch.\n\n                                     TRUMAN\n                         You think he slept at all?\n\n               Nelle looks over at him.\n\n                                     TRUMAN\n                         I need to see him before we go.\n\n                                                                    CUT TO:\n\n               INT. SHERIFF'S RESIDENCE - MORNING\n\n               Truman sits next to Perry's cell. Perry lies on the bed, \n               staring at the ceiling.\n\n                                     TRUMAN\n                         They're going to transfer you up to \n                         Lansing today. You'll have to make \n                         sure to put me on the visitor's list. \n                         Otherwise I can't see you.\n\n               No response.\n\n                                     TRUMAN\n                         Will you do that? I'm going to help \n                         find you a proper lawyer. You need a \n                         serious lawyer for an appeal.\n                              (no response)\n                         They took Dick last night. I need \n                         you to get him to do the same thing -- \n                         put me on the visitor's list. Will \n                         you do that, Perry?\n\n               Perry closes his eyes.\n\n                                     TRUMAN\n                         Perry.\n\n                                                                  FADE OUT.\n\n               INT. TRUMAN AND JACK'S HOUSE, LIVING ROOM - NIGHT\n\n               FADE UP ON the sounds of a HUGE PARTY in progress. We see a \n               home-made BANNER reading \"Return to Civilization!\" The CAMERA \n               follows NELLE as she walks through the crowd: Gays, straights, \n               smoke and noise. Society women, slender and beautiful; BEN \n               BARON pontificating to CHRISTOPHER ISHERWOOD.\n\n                                     BEN BARON\n                         Nelle. Kudos on \"Kill the Bird.\" Is \n                         that it?\n\n                                     NELLE\n                         Close enough. Thanks.\n\n               William Shawn talks to a MUCH TALLER WOMAN.\n\n                                     SHAWN\n                         He hasn't written a word yet, though \n                         he says it's the nonfiction book of \n                         the decade...\n\n               We HEAR Truman before we see him:\n\n                                     TRUMAN (O.S.)\n                         He's little, but terrifying --\n\n               We see Truman in the corner entertaining a small group. Jack \n               Dunphy stands off to the side. Nelle settles next to Jack.\n\n                                     TRUMAN\n                         He's as short as I am. And almost as \n                         pretty. I'd be with him right now \n                         but he's being given new \n                         accommodations --\n\n               Guests laugh.\n\n                                     TRUMAN\n                         Most people assume he's a monster. I \n                         don't see him that way. The book I'm \n                         writing will return him to the realm \n                         of humanity -- it's the book I was \n                         always meant to write...\n\n               Nelle and Jack stand back, watching.\n\n                                     JACK\n                         Watch out. This is the start of a \n                         great love affair.\n\n                                     NELLE\n                         Oh yes. Truman in love with Truman.\n\n               INT. LE PAVILLON RESTAURANT - DAY\n\n               Truman is being interviewed over lunch.\n\n                                     TRUMAN\n                         ...I was in Marilyn's apartment just \n                         last week. I had to break it to her \n                         that, of the four Matisses hanging \n                         on her wall, two were upside down.\n\n               The REPORTER laughs. A waiter passes. Truman taps his glass.\n\n                                     TRUMAN\n                         Another.\n                              (to reporter)\n                         To answer your question, I'm following \n                         \"Breakfast at Tiffany's\" by blazing \n                         a different path -- by inventing an \n                         entirely new kind of writing: the \n                         non-fiction novel.\n\n                                     REPORTER\n                         You have a subject?\n\n               Truman takes a last sip of his drink -- utterly serious now.\n\n                                     TRUMAN\n                         On the night of November 14, two men \n                         broke into a quite farmhouse in Kansas \n                         and murdered an entire family. Why \n                         did they do that? It's been suggested \n                         that this subject is tawdry -- it's \n                         not worthy of literature. I disagree. \n                         Two worlds exist in this country -- \n                         the quiet conservative life, and the \n                         life of those two men -- the \n                         underbelly, the criminally violent. \n                         Those worlds converged that bloody \n                         night. I spent the past three months \n                         interviewing everyone in Kansas \n                         touched by that violence. I spent \n                         hours talking to the killers -- and \n                         I'll spend more.\n                              (waiter brings his \n                              drink)\n                         Researching this work has changed my \n                         life, altered my point of view about \n                         almost everything. I think those who \n                         read it will be similarly affected.\n                              (he sips)\n                         Such a book can only be written by a \n                         journalist who has mastered the \n                         techniques of fiction --\n\n                                     REPORTER\n                         You're speaking of yourself.\n\n                                     TRUMAN\n                         You're really very clever.\n\n                                                                    CUT TO:\n\n               INT. TRUMAN AND JACK'S HOUSE, BEDROOM - DAY\n\n               Truman sits in bed, writing on a yellow LEGAL PAD, surrounded \n               by PILES of notes. He squints his eyes, concentrating. Jack \n               enters, delivers a CUP OF COFFEE. Truman doesn't notice.\n\n               INT. TRUMAN AND JACK'S HOUSE, BEDROOM - LATER\n\n               Truman is rifling through the boxes, looking for particular \n               notes. He can't find what he needs. The phone RINGS.\n\n                                                                    CUT TO:\n\n               EXT. STREET, BROOKLYN HEIGHTS - LATE AFTERNOON\n\n               Jack and Truman walk.\n\n                                     TRUMAN\n                         Perry's decided to appeal. He claims \n                         their attorney was incompetent -- \n                         that he never raised the issue of \n                         temporary insanity.\n\n                                     JACK\n                         So you find them a new lawyer.\n\n                                     TRUMAN\n                         They're facing execution in six weeks, \n                         Jack. They need someone to argue \n                         whether or not that's right.\n\n                                     JACK\n                         Okay.\n\n                                     TRUMAN\n                         I'd also like to see them alive, \n                         yes, thank you very much. I need to \n                         hear their story.\n\n               They walk in silence for a few moments.\n\n                                     TRUMAN\n                         If you met him you'd understand. \n                         It's as if no-one's ever asked him a \n                         single question about himself. He's \n                         so... damaged -- and strange -- \n                         unexplored...\n                              (then)\n                         I don't trust this Hickock fellow. \n                         Perry's the only person who can \n                         describe to me what happened that \n                         night. I need to hear him say it.\n\n                                     JACK\n                         Just be careful what you do to get \n                         what you want.\n\n                                     TRUMAN\n                         I'm finding them a lawyer.\n\n                                     JACK\n                         Truman. You're finding yourself a \n                         lawyer.\n\n                                                                    CUT TO:\n\n               INT. CAR, DRIVING, TWO-LANE KANSAS HIGHWAY - DAY\n\n               Truman drives alone, concentrating intently. He has to stretch \n               to see over the dashboard.\n\n               EXT. KANSAS STATE PENITENTIARY (KSP), LANSING - DAY\n\n               A turreted, Civil War-era fortress an hour's drive from Kansas \n               City. Truman pulls up to the GUARDHOUSE.\n\n               INT. KSP, WAITING ROOM/WARDEN'S OFFICE - DAY\n\n               Truman waits alone, looking at the lone decoration: a campaign \n               poster, showing a fat man in a suit grinning while holding a \n               shotgun. Across the bottom it reads: WALK TALL WITH KRUTCH. \n               A YOUNG PRISON GUARD sticks his head out of the office door.\n\n                                     YOUNG PRISON GUARD\n                         Warden Krutch will see you now.\n\n               INT. KSP, WARDEN'S OFFICE - DAY\n\n               Wood-paneled walls, government-issue desk. On the wall behind \n               the desk is a CHART -- a racial accounting of the current \n               inmate population. It reads: WHITE - 1405, COLORED - 360, \n               MEXICANS - 12, INDIANS - 6.\n\n               WARDEN MARSHALL KRUTCH is fat, coarse, sweaty even in winter. \n               And it's spring. He's running for Congress -- there are \n               \"KRUTCH FOR CONGRESS\" bumper stickers laying around the \n               office. He's enjoying a chance at a little publicity. The \n               YOUNG PRISON GUARD stands quietly by the wall.\n\n                                     KRUTCH\n                         We do well by our boys. Showers once \n                         a week. Feed em good. We'll be feeding \n                         Perry Smith in the infirmary soon if \n                         he don't eat. Get the food in through \n                         his arm.\n\n                                     TRUMAN\n                         What are you talking about?\n\n                                     KRUTCH\n                         Hasn't eaten in a month. But it's \n                         not his right to kill himself. It's \n                         the People's right. The People of \n                         this State. And that's who I work \n                         for, the People. You can write any \n                         of this down.\n\n                                     TRUMAN\n                         No one told me.\n\n                                     KRUTCH\n                         Yah. Won't eat.\n\n                                     TRUMAN\n                         When can I see him?\n\n                                     KRUTCH\n                              (checking desk calendar)\n                         How about you come back Thursday?\n\n                                     TRUMAN\n                         No. That's no good. I need to see \n                         them now, then whenever I want for \n                         as long as I want.\n\n                                     KRUTCH\n                         Not how we do things here.\n\n               Pause.\n\n                                     TRUMAN\n                         I see.\n\n               Truman glances at the campaign stickers, the young prison \n               guard, then back at Krutch.\n\n                                     TRUMAN\n                         I understand what a burden unlimited \n                         visitation might be -- on this \n                         institution, and on the People who \n                         pay for it. I want to be clear that \n                         I don't expect the citizens of \n                         Leavenworth County to have to shoulder \n                         that burden.\n\n               Truman reaches into his jacket, pulls from it an ENVELOPE \n               STUFFED with CASH. He lays it on the desk.\n\n                                     TRUMAN\n                         To be dispensed as you see fit.\n\n               Krutch is stone-faced as he regards the money. Finally:\n\n                                     KRUTCH\n                         I didn't know where to count your \n                         boy -- being half-Indian. I did him \n                         a favor though.\n                              (points to race chart)\n                         Counted him White.\n\n                                     TRUMAN\n                         You're a kind and generous man.\n\n                                                                    CUT TO:\n\n               INT. KSP, DEATH ROW - DAY\n\n               The second floor of a small building in the corner of the \n               prison complex. Decrepit. The one hall is lit by mesh-covered \n               BARE BULBS in the ceiling. Twelve cells -- six on each side. \n               Each is 7 by 10 feet, with one small, high WINDOW covered by \n               bars and wire. The YOUNG PRISON GUARD opens the heavy GATE \n               at the end of the hall and shows Truman in.\n\n               They walk down the row of cells. In one of them we notice \n               Lowell Lee Andrews (20, white, spectacled, ENORMOUSLY FAT) \n               peering at his own face 4 inches from a mirror.\n\n               Dick is leaning against the bars of his own cell. He smiles.\n\n                                     HICKOCK\n                         My hero.\n\n                                     TRUMAN\n                         Hello.\n\n                                     HICKOCK\n                         Thanks for your help with the lawyer.\n\n                                     TRUMAN\n                         That's fine.\n\n                                     HICKOCK\n                         You must be desperate for a story to \n                         come all the way out here.\n\n                                     YOUNG PRISON GUARD\n                         Mr. Capote. You're entitled to go \n                         in. You may, um, go in. If you wish.\n\n               Truman hesitates for a second.\n\n                                     HICKOCK\n                         You want to see Perry. Go ahead.\n\n                                     TRUMAN\n                         Thank you.\n\n               Truman walks to the next cell.\n\n                                     HICKOCK\n                         Ask me, he's just trying to prove \n                         the insanity defense.\n\n               Truman sees Perry, gaunt, lying on his cot, almost comatose. \n               Perry's rather striking drawing of a LARGE YELLOW PARROT \n               sits propped on his table. An UNEATEN LUNCH TRAY lies on the \n               floor -- a cockroach runs over it. Truman watches, disturbed.\n\n                                                                    CUT TO:\n\n               INT. SUPERMARKET - NIGHT\n\n               Camera follows Truman as he walks down an aisle with a small \n               WICKER BASKET. He stops, looks at a shelf.\n\n               INT. SUPERMARKET - NIGHT\n\n               Truman waits in the check-out line behind a MOM paying for \n               her groceries. Her SON (3) stands next to her legs, wearing \n               a little cowboy hat and cradling a TOY GUN to his chest. He \n               sucks his thumb. Truman and the boy look at each other.\n\n                                                                    CUT TO:\n\n               INT. KSP, DEATH ROW, PERRY'S CELL - DAY\n\n               Truman sits on the chair, his WICKER BASKET on the table. He \n               has spread out a cloth napkin. A GUARD watches from outside \n               the cell. Perry lies completely still on the cot. Truman \n               takes out jars of BONNET BABY FOOD, inspects the labels.\n\n                                     TRUMAN\n                              (to Perry)\n                         I don't care what your plans are for \n                         yourself...\n\n               He decides on the CUSTARD jar. He opens it, takes a plastic \n               BABY SPOON from the basket.\n\n                                     TRUMAN\n                         But you're gonna wake up enough to \n                         tell me what you did with my tie.\n\n               He spoons a bit into Perry's mouth. The GUARD walks away. \n               Truman leans close to Perry, whispers:\n\n                                     TRUMAN\n                         It's okay. It's Truman. It's your \n                         friend.\n\n               INT. KSP, DEATH ROW, PERRY'S CELL - LATER (LATE AFTERNOON)\n\n               Perry sleeps. Truman stands against the wall watching him. \n               He has cleaned up the basket of food. He walks over to Perry's \n               desk, sees two handwritten notebooks on it: THE PRIVATE DIARY \n               OF PERRY EDWARD SMITH and PERSONAL DICTIONARY. Next to them, \n               he sees a pencil SELF-PORTRAIT Perry drew. It's very good. \n               Truman touches it.\n\n               INT. KSP DEATH ROW, PERRY'S CELL - LATER (EVENING)\n\n               Perry sleeps. Truman sits on the chair watching, waiting. \n               Perry opens his eyes, looks at Truman.\n\n               INT. KSP, DEATH ROW, PERRY'S CELL - LATER (NIGHT)\n\n               Perry is sitting up a bit, Truman helps him sip a cup of \n               water. Perry lies back down. He's looking at Truman.\n\n                                     TRUMAN\n                         How'd you learn to draw like that?\n\n               Perry closes his eyes.\n\n                                                                    CUT TO:\n\n               INT. CAR, DRIVING - AFTERNOON (NEXT DAY)\n\n               Truman drives through the KANSAS STATE PENITENTIARY gate, \n               waves to the Guard.\n\n               INT. KSP, DEATH ROW, PERRY'S CELL - EVENING\n\n               Perry sits on the bed, cleaned up, wet hair neatly combed, \n               looking at a few OLD SNAPSHOTS he has saved in a handkerchief. \n               Truman sits in the chair across from him. Perry hands him a \n               photo of his mother. Perry speaks quietly.\n\n                                     PERRY\n                         Before she had us. Before she started \n                         drinking.\n\n                                     TRUMAN\n                         Who took care of you as a child?\n\n                                     PERRY\n                         Orphanage. Me and Linda.\n\n                                     TRUMAN\n                         That's your sister?\n\n               Perry nods. Truman waits for more. It doesn't come.\n\n                                     TRUMAN\n                         We're not so different as you might \n                         think. I was abandoned repeatedly as \n                         a child. My mama'd drag me along to \n                         some new town so she could take up \n                         with another man she'd met. Night \n                         after night she'd lock me in the \n                         hotel room -- Mama'd turn the latch \n                         and tell the staff not to let me out \n                         no matter what. I was terrified -- \n                         I'd scream my head off -- till finally \n                         I'd collapse on the carpet next to \n                         the door and fall asleep. After years \n                         of this she just left me with \n                         relatives in Alabama.\n\n                                     PERRY\n                         Who raised you up?\n\n                                     TRUMAN\n                         My Aunts.\n                              (Perry nods)\n                         That's when I met Nelle -- she lived \n                         next door.\n                              (looks again at the \n                              photo, hands it back)\n                         Your mother was Indian?\n\n                                     PERRY\n                         Cherokee.\n\n                                     TRUMAN\n                         Drinking was not a good thing for \n                         her.\n\n                                     PERRY\n                         No tolerance for it.\n\n                                     TRUMAN\n                         And your father?\n\n                                     PERRY\n                         No tolerance for him either.\n\n               Truman's laughs, surprised by the joke, though it's unclear \n               whether Perry meant it as one. He stares at Perry.\n\n                                     TRUMAN\n                         What I can't decide is if you \n                         understand how fascinating you are.\n\n               Perry doesn't respond, then --\n\n                                     PERRY\n                         I'm sorry about your tie. They took \n                         it away from me because we're all on \n                         suicide watch. It's why the lights \n                         stay on at night.\n\n                                     TRUMAN\n                         I hope we're past that now. You had \n                         me worried.\n\n                                     PERRY\n                         Okay.\n\n                                     TRUMAN\n                         I don't care about the tie. It's \n                         just a pity because it looked so \n                         good on you.\n\n               Perry leans in, motions toward Dick's cell, lowers his voice --\n\n                                     PERRY\n                         Be careful of Ricardo. I think he \n                         wants you all to himself.\n\n                                     TRUMAN\n                         Alright --\n\n                                     PERRY\n                         But he's naturally mendacious -- not \n                         to be trusted -- if he had a hundred \n                         dollars he'd steal a stick of chewing \n                         gum.\n\n                                     TRUMAN\n                         You wouldn't.\n\n               Perry shakes his head. Then, Truman nods toward Perry's \n               notebooks.\n\n                                     TRUMAN\n                         I want to take your notebooks with \n                         me -- I want to read them.\n\n               Perry hesitates.\n\n                                     TRUMAN\n                         If I leave here without understanding \n                         you, the world will always see you \n                         as a monster. I don't want that -- I \n                         don't see you that way.\n\n               A moment, then Perry reaches for the NOTEBOOKS, hands them \n               to Truman. Then he hands Truman the DRAWING he did of himself.\n\n                                     PERRY\n                         I tracked my father down in Alaska. \n                         I was 14. One day I said to him, \n                         \"Mom's dead.\" I could see it. A week \n                         later we got the news. She finally \n                         drunk herself to death.\n\n               Truman regards Perry. Then he looks at the drawing --\n\n                                     TRUMAN\n                         This is remarkable.\n\n                                     PERRY\n                         Sometimes you see a thing -- how it \n                         really is.\n\n               On Truman holding the drawing, looking at Perry.\n\n               EXT. KANSAS STATE PENITENTIARY PARKING LOT - NIGHT\n\n               Truman walks quickly to his car, holding Perry's DRAWING and \n               NOTEBOOKS. At the car, he looks back at the dark jailhouse.\n\n                                                                    CUT TO:\n\n               INT. HOTEL ROOM, KANSAS CITY - LATE NIGHT\n\n               Truman at the desk, PERRY'S TWO BOOKS next to a LEGAL PAD \n               already filled with notes. He's on the PHONE with Nelle, \n               paging through the PERSONAL DICTIONARY captivated by it.\n\n                                     TRUMAN\n                         He trusts me -- that's why he gave \n                         it to me. He's given me absolutely \n                         everything.\n                              (paging through Diary)\n                         You should see his drawings, Nelle, \n                         how good he is. He wants so badly to \n                         be taken seriously, to be held in \n                         some esteem.\n\n               INTERCUT with Nelle, in pajamas, sitting on the porch of her \n               home in Monroeville, smoking.\n\n               INT. NELLE'S LIVING ROOM - NIGHT\n\n                                     NELLE\n                         Do you?\n\n                                     TRUMAN\n                         Do I what?\n\n                                     NELLE\n                         Hold him in esteem?\n\n                                     TRUMAN\n                         Well... he's a gold mine. I mean \n                         he's told me his entire life, and \n                         now it's all here for me to write \n                         down -- All of the history I need. \n                         His entire life in this Diary. His \n                         dead mother. A brother and sister \n                         killed themselves.\n\n                                     NELLE\n                         You tell him your mama did the same \n                         thing?\n\n                                     TRUMAN\n                         I tell him everything. We've been \n                         talking our heads off the past month. \n                         Sometimes, when I think how good my \n                         book can be, I can hardly breathe.\n\n                                     NELLE\n                         Huh.\n\n                                     TRUMAN\n                              (finds what he wants)\n                         Here's what I wanted to read to you: \n                         \"If Called Upon to Make a Speech:\" -- \n                         this is exactly what I was talking \n                         about -- a speech just in case he's \n                         ever recognized for an achievement: \n                         \"If Called Upon to Make a Speech: I \n                         can't remember what I was going to \n                         say for the life of me. I don't think \n                         ever before have so many people been \n                         so directly responsible for my being \n                         so very, very glad. It's a wonderful \n                         moment and a rare one. Thank you!\"\n                              (beat)\n                         There's an exclamation point on the \n                         end of that thank you, in case you \n                         didn't catch it...\n                              (silence)\n                         Where'd you go?\n\n               We hear Nelle exhale her cigarette.\n\n                                     NELLE\n                         Christ. I guess it stopped being \n                         funny.\n\n                                     TRUMAN\n                         I never said it was.\n                              (turns a page)\n                         Listen to this...\n\n               EXT. KANSAS CITYSCAPE - VARIOUS (TWO WEEKS ELAPSE)\n\n               INT. DINER, DOWNTOWN KANSAS CITY - MORNING\n\n               Truman is eating breakfast with Alvin Dewey. A WAITRESS \n               refills their coffees.\n\n                                     DEWEY\n                              (to waitress)\n                         Thanks.\n\n               She leaves. An uncomfortable silence. Then:\n\n                                     DEWEY\n                         You're nothing if not hard-working.\n\n                                     TRUMAN\n                         You look good, healthy again.\n\n                                     DEWEY\n                         Not a chance.\n\n               Dewey taps a cigarette out of his pack.\n\n                                     TRUMAN\n                         I've decided on a title for my book. \n                         I think you'll like it -- very \n                         masculine. \"In Cold Blood.\"\n\n                                     DEWEY\n                              (lights the cigarette)\n                         That refers to the crime or the fact \n                         that you're still talking to the \n                         criminals?\n\n                                     TRUMAN\n                         The former, among other things.\n\n                                     DEWEY\n                         I see.\n\n               They eat for a moment. Then:\n\n                                     TRUMAN\n                         I've been wanting to ask if you'll \n                         let me look at your investigation \n                         notes.\n\n                                     DEWEY\n                         That lawyer you helped find for your \n                         friends got them a hearing at the \n                         Kansas Supreme Court --\n\n                                     TRUMAN\n                         I heard this morning.\n\n                                     DEWEY\n                         -- on the issue of inadequate counsel.\n\n                                     TRUMAN\n                         Alvin. Do you not want me to look at \n                         your notes? You are permitted to say \n                         no.\n\n                                     DEWEY\n                              (rises, takes out \n                              wallet)\n                         I'll tell you what: if those boys \n                         get off, I'm coming to Brooklyn to \n                         hunt you down.\n\n               Truman can't decide whether Dewey is kidding or not. Dewey \n               puts money on the table.\n\n                                     DEWEY\n                         I have to be in court at nine o'clock.\n\n               He walks away. Over his shoulder:\n\n                                     DEWEY\n                         Call Roy Church. He'll show you what \n                         you want to see.\n\n                                                                    CUT TO:\n\n               INT. KSP, DEATH ROW - DAY\n\n               Truman walks down the hall. He passes Dick's cell. Dick is \n               lying in bed. Dick rises and smiles widely at Truman.\n\n                                     HICKOCK\n                         Hey, hey...\n\n               Truman smiles, puts HIS FINGERS TO HIS LIPS, continues past. \n               He stops outside Perry's cell. Perry (looking MUCH HEALTHIER) \n               is drawing at his table -- a picture of the HUGE YELLOW PARROT \n               swooping down from the sky. Truman watches for a few moments, \n               then Perry looks at him.\n\n               INT. KSP, DEATH ROW, PERRY'S CELL - MOMENTS LATER\n\n               The Guard locks Truman inside with Perry.\n\n                                     PERRY\n                         Thank you.\n\n               Truman looks at the Guard -- he leaves.\n\n                                     TRUMAN\n                         It was as much for me as for anyone. \n                         I couldn't bear the thought of losing \n                         you so soon.\n\n                                     PERRY\n                         We're going to be able to use your \n                         book for our case. You'll write we \n                         never got to raise our insanity plea. \n                         You wrote how terrible the lawyer \n                         was?\n\n                                     TRUMAN\n                         I haven't written a word yet.\n\n               Beat.\n\n                                     PERRY\n                         What have you been doing?\n\n                                     TRUMAN\n                         Research. Waiting to talk to you.\n\n                                     PERRY\n                         All right.\n\n                                     TRUMAN\n                         I had hoped --\n\n                                     PERRY\n                         What are you calling it?\n\n                                     TRUMAN\n                         The book?\n                              (looks directly at \n                              him)\n                         I have no idea.\n\n               Pause.\n\n                                     TRUMAN\n                         If I'm going to write about you -- \n                         if I'm going to determine how to \n                         write about you -- you need to tell \n                         me about that night at the Clutter \n                         house.\n\n               Perry just looks at him.\n\n                                     TRUMAN\n                         Perry.\n\n               Perry shakes his head.\n\n                                     TRUMAN\n                         Why? Do you worry what I'll think?\n\n               Perry looks away. A long moment.\n\n                                     TRUMAN\n                         Is that it?\n\n               Silence. Then:\n\n                                     PERRY\n                         Dick says you know Elizabeth Taylor.\n\n                                     TRUMAN\n                         I know a lot of people.\n\n               Truman gives up for now. Sees the PICTURE OF THE YELLOW BIRD \n               on the desk.\n\n                                     TRUMAN\n                         What is that you keep drawing?\n\n                                     PERRY\n                         You must hate having to come to this \n                         place --\n\n                                     TRUMAN\n                         Perry, I have invitations to be in \n                         Morocco, Greece... I choose to be \n                         here. Those people have everything, \n                         all their prayers have been answered, \n                         yet they're more desperate than ever. \n                         I prefer to be here with you.\n\n                                     PERRY\n                              (looks at Truman; \n                              evenly)\n                         I was ten, I wet the bed, the nuns \n                         at the orphanage hated the smell. \n                         First month one of them found me \n                         shivering -- just trying to get \n                         through the night. The Sister pulled \n                         back the covers and shined her \n                         flashlight to see what I'd did. The \n                         sheets were wet. She hit me so many \n                         times with that flashlight she broke \n                         it.\n                              (he shrugs)\n                         That night I dreamed about the yellow \n                         bird. Tall. Yellow like the sun. It \n                         picked me up and it clawed the Nun's \n                         eyes and it lifted me into the sky.\n\n               They look at each other.\n\n               EXT. BAR, DOWNTOWN K.C. - NIGHT\n\n               Truman on the street outside the club at a PAY PHONE. He \n               talks with Jack in Brooklyn.\n\n                                     TRUMAN\n                         I'm just missing this one piece, \n                         Jack. Be patient with me.\n\n                                     JACK\n                         How long is that gonna take? Why \n                         don't you try leaving him alone for \n                         a while? Come to Spain. You can always \n                         visit him later.\n\n                                     TRUMAN\n                         I don't know.\n\n                                     JACK\n                         Well, I'm off. I've got my own writing \n                         to do.\n\n                                     TRUMAN\n                         Do it in Brooklyn. Wait for me.\n\n                                     JACK\n                         Too many people around.\n                              (beat)\n                         I'll leave the address on the kitchen \n                         table. Truman, what do you do there \n                         when you're not with him? -- It must \n                         be awful.\n\n               Truman's watching a YOUNG GUY standing outside the bar, \n               looking at him.\n\n                                     JACK\n                         Think about what I said. Join me \n                         when you can.\n\n                                     TRUMAN\n                         I will. I will. Bye.\n\n               Truman follows the YOUNG GUY into the bar.\n\n               INT. HOTEL ROOM, KANSAS CITY - LATE NIGHT\n\n               Truman sleeps. He OPENS HIS EYES in bed. Turns to the bedside \n               table to see the drawing of Perry looking at him.\n\n                                                                    CUT TO:\n\n               EXT. KANSAS CITY - DAWN\n\n               A young drifter stands alone on an empty street corner. He \n               checks a pay phone for a coin. It's empty.\n\n                                                                    CUT TO:\n\n               INT. KSP, DEATH ROW, PERRY'S CELL - DAY\n\n               Perry is lying on his cot reading an ADVENTURE MAGAZINE -- \n               something to do with finding buried treasure off the coast \n               of Mexico -- and sucking on the tip of his thumb. After a \n               moment he STARTLES and looks up.\n\n               Truman stands outside his cell. He holds a stack of books: \n               Perry's PERSONAL DICTIONARY and DIARY, and a new WEBSTER'S \n               DICTIONARY and THESAURUS.\n\n                                     PERRY\n                         I didn't see you. Jesus, you...\n                              (stands, tucks in \n                              shirt)\n                         Come in. Where's the guard?\n\n                                     TRUMAN\n                         I can't. I brought you some things, \n                         but I have to fly back East.\n\n                                     PERRY\n                         When?\n\n                                     TRUMAN\n                         An hour. I'm sorry.\n\n                                     PERRY\n                         You can't.\n\n                                     TRUMAN\n                         I'm sorry.\n\n                                     PERRY\n                         Who are you going there to see --\n\n                                     HICKOCK (O.S.)\n                              (from next cell)\n                         Capote, get it straight in your book -- \n                         we never intended on killing that \n                         family --\n\n                                     PERRY\n                         I told him that.\n\n                                     HICKOCK (O.S.)\n                         No premeditation --\n\n                                     PERRY\n                         I told him!\n\n               Perry searches the cell for something else to give to Truman \n               to keep him there. Then, he stops. He has nothing left to \n               give, and is unwilling to talk about that night at the \n               Clutters. He becomes very still. Truman speaks gently --\n\n                                     TRUMAN\n                         Your writings are magnificent. I \n                         hope these help you do more.\n\n               No response. Truman places the books on the floor just outside \n               Perry's cell -- Perry's writings in one stack and the new \n               dictionaries in another right next to it.\n\n                                     TRUMAN\n                         I have so much material -- from the \n                         trial, from our visits, your journals. \n                         I have to organize it all, and I \n                         have to start the process of writing.\n                              (no response)\n                         I'll visit soon. Perhaps this fall.\n                              (backing away)\n                         I miss you already. Write me every \n                         five minutes.\n\n               He turns and goes. We stay with Perry as Truman leaves. We \n               hear Dick speak to Truman.\n\n                                     HICKOCK (O.S.)\n                         Be good now.\n\n               Hear Truman's footsteps receding. Then, a long shot of the \n               hallway as the Guard lets Truman out the gate at the end of \n               the row. Silence.\n\n               INT. KSP, DEATH ROW, PERRY'S CELL\n\n               Perry looks down at the books sitting on the floor outside \n               his cell. He crouches, puts his hand through the bars and \n               touches the cover of the new dictionary. He's alone.\n\n                                                                  FADE OUT.\n\n               Over black -- the sound of a JET airplane -- loud, then \n               passing.\n\n               EXT. BEACH - DAY\n\n               FADE IN: BRIGHT WHITE SKY. Sounds of seagulls. Ocean, sand, \n               cottage houses in greenery set back from the beach.\n\n               EXT. RENTED COTTAGE HOUSE - DAY\n\n               The house Jack rented. Jack types on the upstairs deck. Truman \n               pulls up in an OLD TAXI. Jack looks out over the railing to \n               the street. Jack emerges on the FRONT PORCH as Truman walks \n               up the path with his bags. They look at each other. Then \n               Truman looks around at the incredible garden, the ocean in \n               the background, and starts to LAUGH.\n\n                                                                  FADE OUT.\n\n               Title up:              \"January, 1962\"\n\n               Sound of a MANUAL TYPEWRITER over black.\n\n               EXT. RENTED COTTAGE HOUSE - EARLY MORNING\n\n               FADE IN on the peaceful outside of the house. Sound of TYPING.\n\n               INT. RENTED COTTAGE HOUSE - EARLY MORNING\n\n               More typing. A PHONE rings. CAMERA tracks slowly through the \n               pretty, tiled living room, toward a DOOR at the far end.\n\n               INT. BEDROOM, RENTED COTTAGE HOUSE - EARLY MORNING\n\n               Truman at his DESK, surrounded by piles of filled YELLOW \n               PADS, NOTE CARDS, an open TRUNK of random notes. He is at \n               the MANUAL TYPEWRITER. The phone is on the floor, ringing. \n               He types. The phone rings. Exasperated, he picks up.\n\n                                     TRUMAN\n                         What.\n\n                                     SHAWN (OVER PHONE)\n                         Truman. I was supposed to be home \n                         for dinner with my wife three hours \n                         ago -- I have not been able to tear \n                         myself away from your book. It's \n                         that good. It's not good, it's \n                         astonishing. This first half is \n                         astonishing. If the second half lives \n                         up to this it, -- it -- how much is \n                         left to do?\n\n               INTERCUT with Shawn's OFFICE at the New Yorker, NIGHT. Shawn \n               has a stack of manuscript pages on his desk.\n\n               INT. NEW YORKER, WILLIAM SHAWN'S OFFICE\n\n                                     TRUMAN\n                         I'm already well into the third part, \n                         but I -- I can't finish that till I \n                         convince Perry to describe the night \n                         of the killings to me. I was planning \n                         to visit this fall, see --\n\n                                     SHAWN\n                         I think you need to talk to him now.\n\n                                     TRUMAN\n                         And we all need to see how this ends \n                         for the final part. I can't finish \n                         the book till I know what happens. \n                         If Perry and Dick are executed it's \n                         one thing -- and if not, well --\n\n                                     SHAWN\n                         Truman. You got your ending --\n\n                                     TRUMAN\n                         I really don't know --\n\n                                     SHAWN\n                         The Kansas court denied their appeal. \n                         It came over the wire on Friday. You \n                         need to talk to Perry now. He'll be \n                         dead by September. I'm sorry, I know \n                         how much you've come to care about \n                         him.\n\n               Truman is completely immobile.\n\n                                     SHAWN\n                         Truman?\n\n                                     TRUMAN\n                         Right. Yes. Right.\n\n                                     SHAWN\n                         I want to set up a reading for you \n                         in the fall, in New York. We'll build \n                         some interest, and we'll publish in \n                         the fall.\n\n               On Truman.\n\n                                                                    CUT TO:\n\n               INT. KITCHEN, RENTED COTTAGE HOUSE - MORNING\n\n               Truman at the stove watching his tea water heat up. Jack \n               enters with a HUGE BASKET of WINE and GROCERIES.\n\n                                     TRUMAN\n                         Plums. Thank god. We have nothing in \n                         the house.\n\n               He takes one from the basket. Jack starts to unpack food.\n\n                                     TRUMAN\n                         Why aren't you working?\n\n                                     JACK\n                         I knew you couldn't be depended on \n                         to stock the kitchen.\n\n               Truman looks at him blankly.\n\n                                     JACK\n                         What would we feed our famous guest?\n\n                                     TRUMAN\n                         Oh, Jesus. I completely forgot.\n\n               He helps Jack put away the groceries. Then:\n\n                                     JACK\n                              (utterly nonchalant)\n                         Plus -- I finished my novel yesterday.\n\n               Truman looks at Jack, smiles widely.\n\n                                                                    CUT TO:\n\n               EXT. BEACH - NIGHT\n\n               Truman, Jack and Nelle. A BONFIRE, a wind-up Victrola playing \n               Ella Fitzgerald, bottles of wine. Jack and Nelle dance. Truman \n               toasts Jack drunkenly.\n\n                                     TRUMAN\n                         My man, my hero, my talented... My \n                         man...\n\n                                     JACK\n                         You said that.\n\n                                     TRUMAN\n                         You are the hardest worker, the most \n                         unsung talent I know. As Nelle passes \n                         by on her way to London to sell her \n                         book which needs no selling, may a \n                         little of her success rub off on \n                         both of us.\n\n               Jack laughs.\n\n                                     JACK\n                         Here, here!\n\n               Nelle tries to smack Truman but can't catch him. The song \n               changes to a slow one. Jack and Truman dance sweetly together. \n               Nelle sits on the sand and watches.\n\n                                                                    CUT TO:\n\n               EXT. UPSTAIRS DECK, RENTED COTTAGE HOUSE - MORNING\n\n               Breakfast. Truman and Nelle are sitting -- Nelle has a small \n               envelope in her hand. Truman is obviously uncomfortable. As \n               Jack delivers a platter of omelettes to the table:\n\n                                     NELLE\n                              (to Truman)\n                         When was the last time you wrote \n                         back to him?\n\n                                     TRUMAN\n                         I don't know.\n\n                                     JACK\n                         What's this?\n\n                                     NELLE\n                         A letter for your boyfriend I was \n                         asked to deliver.\n\n                                     TRUMAN\n                         From Perry.\n\n                                     JACK\n                         Let's have it.\n\n               Jack sits. Nelle opens the letter, reads:\n\n                                     NELLE\n                         \"Dear Friend Truman. Where are you? \n                         Read this item in a medical \n                         dictionary: \"Death by hanging is \n                         caused by asphyxia, by fracture of \n                         the cervical vertebrae, by laceration \n                         of the trachea.\" Not too comforting \n                         as we lost our appeal. Missing you -- \n                         alone and desirous of your presence. \n                         Your amigo, Perry.\"\n\n               Pause.\n\n                                     TRUMAN\n                         Mr. Shawn told me about the court \n                         decision yesterday.\n\n                                     JACK\n                         I was wondering why you were in such \n                         a good mood. Surely, I thought, it's \n                         not because I finished my little \n                         book.\n\n                                     TRUMAN\n                         That's a terrible thing to say.\n\n               Jack looks out at the ocean.\n\n                                     TRUMAN\n                              (to no one in \n                              particular)\n                         I used to write him all the time. \n                         I've been so focused lately on the \n                         book.\n\n                                                                    CUT TO:\n\n               EXT. RENTED COTTAGE HOUSE - DAY\n\n               Truman and Nelle carry her bags down the front walk toward a \n               waiting TAXI.\n\n                                     TRUMAN\n                         Jack says I'm using Perry, but he \n                         also thinks I fell in love with him \n                         when I was in Kansas. How both of \n                         those things can be true is beyond \n                         me.\n\n                                     NELLE\n                         Did you? Fall in love with him.\n\n               Silence as they load the bags into the trunk.\n\n                                     NELLE\n                         Truman? --\n\n                                     TRUMAN\n                         I don't know how to answer that... \n                         It's as if Perry and I started life \n                         in the same house. One day he stood \n                         up and walked out the back door while \n                         I walked out the front. With some \n                         different choices, he's the man I \n                         might have become.\n\n                                     NELLE\n                         Are you kidding me?\n\n               Truman shrugs, doesn't answer. Nelle kisses him.\n\n                                     NELLE\n                         Be nice to Jack. Sometimes I think \n                         he's what I like about you best.\n\n                                     TRUMAN\n                              (smiles)\n                         I'll see you at the reading in New \n                         York.\n\n                                     NELLE\n                         The sixteenth.\n\n               Nelle gets in the taxi, then leans her head out the window.\n\n                                     NELLE\n                         Truman. Honestly. Are you going back \n                         to Kansas because you care about \n                         Perry or because you need information \n                         before he's killed?\n\n                                     TRUMAN\n                         Can't it be both?\n\n                                     NELLE\n                         No. I don't think it can be.\n\n               She drives away. Truman watches her go. He turns back up \n               toward the house, stops a moment to pick a FLOWER from the \n               bushes at the front gate.\n\n                                                                    CUT TO:\n\n               INT. KSP, DEATH ROW - DAY\n\n               A Guard walks down the corridor carrying a SINGLE FLOWER. He \n               delivers it to Perry, then walks off. Perry is confused. He \n               hears FOOTSTEPS approaching, but can't see who it is.\n\n                                     HICKOCK (O.S.)\n                         Hey, buddy. Thanks.\n\n               More footsteps. CAMERA on Perry as the footsteps finally \n               arrive outside his cell. He's shocked.\n\n               REVERSE onto Truman, looking tanned, healthy, very blond. He \n               holds a STACK OF BOOKS with a BOW on top. He smiles.\n\n                                                                    CUT TO:\n\n               INT. KSP, DEATH ROW - LATER THAT NIGHT\n\n               LONG SHOT of dimly lit corridor, light spilling out from \n               each cell. A ROW GUARD walks the hall. We hear voices \n               murmuring.\n\n               SIX MORE GUARDS arrive at the top of the stairs. The ROW \n               GUARD walks over, unlocks the GATE to let them in.\n\n               INT. KSP, DEATH ROW, PERRY'S CELL - NIGHT\n\n               Perry is looking at the cover of a BOOK -- \"WALDEN POND.\" \n               Other books sit next to Perry on the cot. Among them -- WILLA \n               CATHER's \"MY ANTONIA\", also \"GREAT EXPECTATIONS\" --\n\n                                     PERRY\n                         What was he in jail for?\n\n                                     TRUMAN\n                         They said it was not paying his taxes. \n                         But really for being an outsider -- \n                         refusing to go along.\n\n               Perry nods, looks at the other books.\n\n                                     TRUMAN\n                         You don't have to read any of these \n                         if you don't want to. But I thought \n                         you'd like something decent. You're \n                         much too smart for adventure \n                         magazines.\n\n               Through the bars of Perry's cell, we can see the SIX GUARDS \n               enter Lowell Lee Andrew's cell (diagonally across the \n               corridor). The ROW GUARD appears at Perry's cell.\n\n                                     ROW GUARD\n                         Lock-down while Lowell goes to \n                         solitary. Nobody in or out.\n                              (to Truman)\n                         You want in or out?\n\n               Truman looks at Perry, then back to the Guard.\n\n                                     TRUMAN\n                         In.\n\n               INT. KSP, DEATH ROW, LOWELL LEE ANDREW'S CELL - MOMENTS \n               LATER\n\n               The SIX GUARDS start to pack up Andrews cell while he sits \n               on the cot and watches.\n\n               INT. KSP, DEATH ROW, PERRY'S CELL - LATER\n\n               Perry and Truman talk very QUIETLY. (Throughout this scene, \n               we see in the background, across the corridor, the mostly \n               obscured cell of Andrews. We see his incredibly FAT LEG being \n               shackled, his belongings being packed in boxes.)\n\n                                     PERRY\n                         Everyone says he's a genius. I don't \n                         think he's a genius. He's rich and \n                         he went to college -- like any of us \n                         would've if we got the chance. He \n                         came home for Christmas and shot his \n                         parents --\n\n                                     TRUMAN\n                         -- in front of the television.\n\n                                     PERRY\n                         You remember the story --\n\n                                     TRUMAN\n                         They were watching Father Knows Best.\n\n               They look at each other and smile. Then:\n\n                                     PERRY\n                         I won't be sorry to see him go. Always \n                         correcting my grammar.\n\n               They watch Andrews being shackled in the background.\n\n                                     PERRY\n                         Now -- Dick and me -- we're next in \n                         line.\n\n               Truman regards Perry, who looks down.\n\n                                     TRUMAN\n                         I'm so sorry I've been away.\n\n                                     PERRY\n                         It was a long time.\n\n                                     TRUMAN\n                         I know.\n\n                                     PERRY\n                         I wish you could come next week, \n                         when they take him out to the Corner, \n                         but the whole prison shuts down.\n\n                                     TRUMAN\n                         I have to be in New York anyway.\n\n               Perry nods.\n\n                                     PERRY\n                         How's the book going?\n\n                                     TRUMAN\n                         Very slowly.\n\n                                     PERRY\n                         Will you show it to me?\n\n                                     TRUMAN\n                         I've hardly written anything.\n\n               One of the six guards CLANGS Andrews' cell bars with his \n               stick.\n\n                                     GUARD #1\n                         Ready.\n\n               The ROW GUARD opens the cell door. Andrews is led out, arms \n               and legs shackled, into the corridor.\n\n                                     HICKOCK\n                         Keep your head high, buddy.\n\n                                     ANDREWS\n                         Alright now.\n\n                                     HICKOCK\n                         ...or they won't be able to rope you \n                         under your fat fucking chin.\n\n               Andrews is led past Perry's cell. He looks in at Perry.\n\n                                     ANDREWS\n                         Next!\n\n               Andrews shuffles down the hall. Perry watches him go. On \n               Truman watching Perry. We hear the GATE slam shut.\n\n                                                                    CUT TO:\n\n               INT. THEATER - EVENING\n\n               Packed. Nelle stands with William Shawn, who receives well-\n               wishers. BEN BARON enters, seeing Nelle.\n\n                                     BEN BARON\n                              (loudly, over the \n                              hubbub)\n                         Hello Hollywood. That's quite a bundle \n                         you sold your book for.\n\n               Nelle is embarrassed, mostly for Baron, to have the issue of \n               money brought up publicly.\n\n                                     NELLE\n                         Well...\n\n               Baron moves past, Nelle smiles politely, whispers to Shawn.\n\n                                     NELLE\n                         What a gentleman.\n\n               INT. THEATER, BACKSTAGE ROOM - MOMENTS LATER\n\n               Truman sits alone. In the background, we can HEAR the noise \n               of the huge crowd gathering in the theater. Truman wears his \n               MOST STYLISH LITERARY OUTFIT: a gorgeous dark green Knize \n               SUIT over a black cashmere turtleneck sweater, and horn-rimmed \n               GLASSES (which we've never seen him wear before).\n\n               He's frozen with anticipation, nervousness. After several \n               moments a THEATER ASSISTANT opens the door.\n\n                                     YOUNG ASSISTANT\n                         Mr. Capote. Can I get you anything?\n\n                                     TRUMAN\n                         No.\n                              (clears his throat)\n                         Thank you.\n\n               The assistant leaves. We hear the crowd quiet down. Truman \n               rises slowly, walks through the door to the backstage area. \n               We hear William Shawn on stage.\n\n                                     SHAWN (O.S.)\n                         Welcome New Yorkers...\n\n               INT. WINGS/STAGE - NIGHT\n\n               Shawn pauses briefly for a laugh that doesn't come. Truman \n               continues walking toward the backstage curtains.\n\n                                     SHAWN (O.S.)\n                         Thank you for coming to the first \n                         public reading, the first offering \n                         of any kind, of Truman Capote's new \n                         work \"In Cold Blood.\" Our magazine --\n\n               Truman walks on stage. Loud applause. Shawn sees him, slinks \n               back to his seat. Truman walks over to the podium, takes in \n               the enormous crowd. Once it is completely quiet:\n\n                                     TRUMAN\n                         Hello. My name is Truman Capote.\n\n               People laugh and applaud loudly.\n\n                                                                    CUT TO:\n\n               INT. KSP, DEATH ROW, PERRY'S CELL - SAME TIME, NIGHT\n\n               Perry, eating dinner alone at his table, looks up. We HEAR a \n               LOUD ENGINE revving outside.\n\n               EXT. KSP, THE CORNER WAREHOUSE - SAME TIME\n\n               A FRONT-LOADER TRACTOR drives into the warehouse. A PRISON \n               POLICE CAR parks outside the warehouse. Guards get the \n               enormous Lowell Lee Andrews, shackled, from the back seat, \n               walk him inside.\n\n               INT. KSP, DEATH ROW, PERRY'S CELL - NIGHT\n\n               C/U on Perry, now standing on his chair and watching out the \n               tiny window.\n\n                                                                    CUT TO:\n\n               INT THEATER, NYC - NIGHT\n\n               Truman on stage reading.\n\n                                     TRUMAN\n                         Perry Smith's voice was both gentle \n                         and prim -- a voice that, though \n                         soft, manufactured each sound exactly -- \n                         ejected it like a smoke ring issuing \n                         from a parson's mouth.\n\n                                                                    CUT TO:\n\n               INT. KSP, DEATH ROW, PERRY'S CELL - SAME TIME\n\n               Perry watches through his window. From inside the warehouse \n               we hear the gallows TRAP DOOR spring and CLATTER. On Perry,\n\n                                                                    CUT TO:\n\n               INT. THEATER, NYC - SAME TIME\n\n               Truman reading. Utter silence except for his voice.\n\n                                     TRUMAN (V.O.)\n                         The village of Holcomb stands on the \n                         high wheat plains of western Kansas, \n                         a lonesome area that other Kansans \n                         call \"out there.\" Until one morning \n                         in mid-November 1959, few Americans -- \n                         in fact, few Kansans -- had ever \n                         heard of Holcomb. Like the waters of \n                         the [Arkansas] river, like the \n                         motorists on the highway... \n                         exceptional happenings had never \n                         stopped there.\n\n               EXT. KSP, DEATH ROW BUILDING - SAME TIME\n\n               We see the outside wall with Perry and Dick's faces peering \n               out through their tiny windows.\n\n               EXT. KSP, THE CORNER WAREHOUSE - NIGHT\n\n               The TRACTOR emerges through the warehouse doors. It carries \n               in its FRONT SHOVEL the enormous, dead BODY of ANDREWS covered \n               by a BLACK CLOTH.\n\n               INT. THEATER, NYC - SAME TIME\n\n               Truman reading. The audience completely still.\n\n                                     TRUMAN\n                         The four coffins, which quite filled \n                         the small, flower-crowded parlor, \n                         were to be sealed at the funeral \n                         services -- very understandably, for \n                         the effect... was disquieting. Nancy \n                         wore her dress of cherry-red velvet, \n                         her brother a bright plaid shirt; \n                         the parents were more sedately \n                         attired, Mr. Clutter in navy-blue \n                         flannel, his wife in navy-blue crepe; \n                         and -- and it was this especially \n                         that lent the scene an awful aura -- \n                         the head of each was completely \n                         encased in cotton, a swollen cocoon \n                         twice the size of an ordinary blown-\n                         up balloon, and the cotton, because \n                         it had been sprayed with a glossy \n                         substance, twinkled like Christmas-\n                         tree snow.\n\n                                                                    CUT TO:\n\n               EXT. KSP, THE CORNER WAREHOUSE - NIGHT\n\n               The TRACTOR rolls the body into the BED of a waiting PICK-UP \n               TRUCK.\n\n               EXT. KSP, DEATH ROW BUILDING - SAME TIME\n\n               Perry watches through his window.\n\n               INT. THEATER, NYC - SAME TIME\n\n               Truman reading. The audience transfixed.\n\n                                     TRUMAN\n                         Imagination, of course, can open any \n                         door -- turn the key and let terror \n                         walk right in. [One] Tuesday, at \n                         dawn, a carload of... strangers, \n                         ignorant of the local disaster -- \n                         were startled by what they saw as \n                         they crossed the prairies and passed \n                         through Holcomb: windows ablaze, \n                         almost every window in almost every \n                         house, and, in the brightly lit rooms, \n                         fully clothed people, even entire \n                         families, who had sat the whole night \n                         wide awake, watchful, listening. Of \n                         what were they frightened? \"It might \n                         happen again.\"\n\n               He closes his manuscript. Several moments of SILENCE, then \n               thunderous APPLAUSE.\n\n                                                                    CUT TO:\n\n               INT. THEATER, BACKSTAGE ROOM - NIGHT\n\n               Truman's dressing room. Packed with well-wishers drinking \n               from bottles of CHAMPAGNE, smoking, toasting, shouting to be \n               heard. Truman in the corner with Christopher Isherwood, BEN \n               BARON others, laughing. A LITERARY ENTHUSIAST approaches, \n               leans in.\n\n                                     LITERARY ENTHUSIAST\n                         Your portrait of those men was \n                         terrifying. Terrifying.\n\n                                     TRUMAN\n                         Thank you.\n\n               Truman and Isherwood watch him walk away.\n\n                                     ISHERWOOD\n                         Your hairpiece is terrifying.\n\n                                     TRUMAN\n                         I was going to say the same thing!\n\n               Truman laughs loudly. We SEE Nelle look over from across the \n               room at her friend having the time of his life.\n\n                                                                    CUT TO:\n\n               INT. NEW YORKER, WILLIAM SHAWN'S OFFICE - NEXT DAY\n\n               Truman is hung over but immensely gratified. He's with Shawn.\n\n                                     SHAWN\n                         Everyone was there.\n\n                                     TRUMAN\n                         Tennessee loved it.\n\n                                     SHAWN\n                         Of course he did.\n\n                                     TRUMAN\n                         Should we do more? I was terrified, \n                         but --\n\n                                     SHAWN\n                         No, Now we get to withhold while \n                         everyone else talks. Let them do the \n                         work.\n\n               Truman is barely able to suppress his excitement.\n\n                                     SHAWN\n                         This book is going to change \n                         everything. It'll change how people \n                         see you as a writer. It'll change \n                         how people write. You'll finish by \n                         October?\n\n                                     TRUMAN\n                         I think so. You know they're scheduled \n                         for next month?\n\n                                     SHAWN\n                         Hanging. Yes. I'll commit as many \n                         issues as it takes to publish. Three. \n                         As many as it takes.\n\n                                     TRUMAN\n                         I'm flying to Kansas tomorrow. I'll \n                         get Perry to talk --\n\n                                     SHAWN\n                         Honestly, what's he got to lose?\n\n               Truman smiles at the joke, then stops himself.\n\n                                     TRUMAN\n                         It really is too awful. \n                         Institutionalized sadism.\n\n               Shawn nods.\n\n                                     SHAWN\n                         You'll be able to finish now.\n\n                                     TRUMAN\n                         As strange as it may sound to you, \n                         I'm going to miss him.\n\n                                                                  FADE OUT.\n\n               Over black -- the sound of a JET airplane -- loud, then \n               passing.\n\n               INT. KSP, DEATH ROW, PERRY'S CELL - DAY\n\n               Truman, flushed, out of breath, stands outside Perry's cell. \n               He's just arrived. He holds a FOLDED-UP NEWSPAPER. Perry \n               sits at his table reading LEGAL DOCUMENTS.\n\n                                     TRUMAN\n                         When did you hear?\n\n               Perry looks up, mistaking Truman's state for shared \n               enthusiasm. He smiles widely.\n\n                                     PERRY\n                         Two days ago.\n\n               The Guard opens the cell for Truman. Perry holds up one of \n               the DOCUMENTS.\n\n                                     PERRY\n                         It's what we've been waiting for. A \n                         stay of execution to make a federal \n                         appeal.\n\n               Truman enters. Perry goes to him and hugs him tightly.\n\n                                     PERRY\n                         All thanks to you.\n\n               On Truman, shocked, being hugged.\n\n                                                                    CUT TO:\n\n               INT. KSP, DEATH ROW, PERRY'S CELL - LATER\n\n               Truman sits on the bed, his coat still on, watching Perry -- \n               hyped up, talking, walking around the cell.\n\n                                     PERRY\n                         Kansas's had it in for me for ten \n                         years -- in prison the first time, \n                         at that trial, here. They can't corner \n                         me now. Not till the U.S. Government \n                         says so --\n\n                                     TRUMAN\n                         Perry, sit down. For a minute.\n                              (Perry sits)\n                         I need you to talk to me...\n\n                                     PERRY\n                         We've got all the time in the world \n                         to talk. About everything. I've been \n                         thinking about Ricardo. You need to \n                         stop sending him those trashy books. \n                         I won't even mention the pornography.\n                              (getting up)\n                         I realize he might have trouble \n                         grasping the literature you gave me, \n                         but those books only exacerbate the \n                         problem -- only 'heighten' or \n                         'intensify' it. Maybe we should start \n                         him on a program...\n\n                                     TRUMAN\n                         Perry.\n\n                                     PERRY\n                         Give him the simple novels first --\n\n                                     TRUMAN\n                         Perry.\n\n               Perry stops.\n\n                                     TRUMAN\n                         I know what exacerbate means.\n\n                                     PERRY\n                         Okay. I thought in case...\n\n                                     TRUMAN\n                         There is not a word, or a sentence, \n                         or a concept, that you can illuminate \n                         for me. There is one singular reason \n                         that I keep coming here --\n\n                                     PERRY\n                         Truman --\n\n                                     TRUMAN\n                         ...November 14th, 1959. Three years \n                         ago. Three years. That's all I want \n                         to hear from you.\n\n               Pause.\n\n                                     PERRY\n                         I've asked you not to --\n\n                                     TRUMAN\n                              (stands up)\n                         This is ridiculous.\n                              (to the Guard)\n                         I'm ready.\n                              (to Perry)\n                         I have a plane to catch. I found \n                         your sister in Tacoma. Maybe she'll \n                         talk to me about something useful.\n\n                                     PERRY\n                         Don't go out there.\n\n               The Guard lets Truman out of the cell.\n\n                                     PERRY\n                         Please don't go out there.\n\n               The Guard shuts the door.\n\n                                     TRUMAN\n                         This is my work, Perry. I'm working. \n                         When you want to tell me what I need \n                         to hear, you let me know.\n\n               He walks off down the hall. The GATE slams shut.\n\n                                                                    CUT TO:\n\n               INT. PERRY'S SISTER'S HOUSE, KITCHEN - DAY\n\n               Cheaply built ranch house. LINDA MURCHAK (30) walks in the \n               kitchen back door, shuts it.\n\n                                     MRS. MURCHAK\n                         They'll play outside a while longer.\n\n               Mrs. Murchak looks like a female Perry, dark and small, \n               attractive and nervous. Through the window, we see THREE \n               LITTLE CHILDREN playing on a DECREPIT JUNGLE GYM in the yard. \n               Truman sits at the table, leafing through a PHOTO ALBUM.\n\n                                     MRS. MURCHAK\n                         I don't want them to see that.\n\n                                     TRUMAN\n                         They've never seen these pictures?\n\n                                     MRS. MURCHAK\n                              (shakes her head)\n                         Too many questions.\n\n               She joins Truman again at the table.\n\n               We see an OLD PHOTO of the SMITH FAMILY -- Linda at age 8, \n               Perry (5); their older sister, June; their brother Frank; \n               and the parents: Florence (American Indian) and John (Irish) -- \n               in front of their rundown truck on a desolate road.\n\n                                     MRS. MURCHAK\n                         June's dead. Frank shot himself. Now \n                         Perry's did what he did. I suppose \n                         I'm next. Some ruination will visit \n                         me.\n\n                                     TRUMAN\n                         I don't think life works that way.\n\n                                     MRS. MURCHAK\n                         It does in this family.\n\n               Truman turns the page. A PICTURE of Perry (3) and Linda \n               HOLDING HANDS and splashing in a big mud-puddle in the rain. \n               Linda is smiling at Perry, who is naked, laughing.\n\n                                     MRS. MURCHAK\n                         I used to love him. He was my little \n                         doll.\n\n               He turns the page. A PICTURE of Perry (6) and Linda sitting \n               on the back steps of a shack, poking with a stick at something \n               in the dirt. After a moment, she gets up, clears coffee cups.\n\n                                     MRS. MURCHAK\n                         He scares me now.\n\n                                     TRUMAN\n                         When was the last time you saw him?\n\n                                     MRS. MURCHAK\n                         Ten years.\n\n               She picks up the album to put it away.\n\n                                     TRUMAN\n                         Do you think I could borrow one of \n                         those pictures?\n\n                                     MRS. MURCHAK\n                              (hands it to him)\n                         Take the whole thing. I don't want'em \n                         anymore.\n                              (then)\n                         Just... Perry doesn't know where I \n                         live. He thinks we're still in \n                         Portland. Please don't tell him we're \n                         not.\n\n                                     TRUMAN\n                              (he already has)\n                         Alright.\n\n                                     MRS. MURCHAK\n                         Don't be taken in by my brother. \n                         He's got this sensitive side he'll \n                         show. You believe he's gentle, so \n                         easily hurt. But he'd just as soon \n                         kill you as shake your hand. I believe \n                         that.\n\n                                                                    CUT TO:\n\n               INT. KSP, DEATH ROW - NEXT DAY\n\n               Truman slows for a moment as he passes Hickock's cell.\n\n                                     TRUMAN\n                         Hello handsome.\n\n               Hickock just stares at him. Truman, unnerved, moves on to \n               Perry's cell.\n\n               INT. KSP, DEATH ROW, PERRY'S CELL - CONTINUOUS\n\n               Perry doing pushups. He sees Truman and stops. He stands. \n               The Row Guard approaches.\n\n                                     ROW GUARD\n                         You want to go in?\n\n               Truman regards Perry for a few moments, then:\n\n                                     TRUMAN\n                         Yes\n\n               The Guard unlocks the door. Perry STARTS TO MOVE toward it. \n               The Guard SLAMS it shut.\n\n                                     PERRY\n                         What's the name of your book?\n\n               No response. Perry can barely control his anger.\n\n                                     PERRY\n                         What's the name of your book?\n\n                                     TRUMAN\n                         I don't...\n\n                                     PERRY\n                         What's the name of your book?\n\n                                     TRUMAN\n                         I don't know what you're talking \n                         about.\n\n               Perry picks up a cut-out ARTICLE from the NY Times from his \n               desk. He reads.\n\n                                     PERRY\n                         \"Truman Capote read last night before \n                         a packed audience from his non-fiction \n                         book IN COLD BLOOD.\"\n\n               He looks at Truman.\n\n                                     PERRY\n                         More?\n                              (reads)\n                         \"The true-crime novel tells of killers \n                         Richard Hickock and Perry Smith, who \n                         brutally murdered a Kansas family \n                         three years ago.\"\n\n                                     TRUMAN\n                         Who sent that to you?\n\n               Perry doesn't answer.\n\n                                     TRUMAN\n                         Who sent that to you?\n\n                                     PERRY\n                         That's not your goddamn business.\n\n                                     TRUMAN\n                         It is my business, because it's not \n                         true. The organizers of the reading \n                         needed a title. They picked one -- a \n                         sensational one, I admit -- to attract \n                         a crowd.\n\n                                     PERRY\n                         They picked it.\n\n                                     TRUMAN\n                         Yes.\n\n                                     PERRY\n                         That's not your title.\n\n                                     TRUMAN\n                         I haven't chosen one yet.\n\n               Perry stares at him, not believing.\n\n                                     TRUMAN\n                         How could I choose --\n\n                                     PERRY\n                         You pretend to be my friend...\n\n                                     TRUMAN\n                         How could I choose a title when you \n                         still haven't told me what happened \n                         that night? How could I? I couldn't \n                         possibly.\n\n               Long pause. Truman reaches in his breast pocket and extracts \n               a PHOTO (the one of Perry and Linda splashing in the puddle.)\n\n                                     TRUMAN\n                         I have something from your sister.\n\n               He hands it through the bars to Perry. Perry takes it.\n\n                                     TRUMAN\n                         She misses you.\n\n               Perry looks at the photo. After a few moments, Truman turns \n               to the Guard.\n\n                                     TRUMAN\n                         It's alright. I'll go in.\n\n               The Guard unlocks the cell. Truman enters. The Guard locks \n               up, walks away. Perry is still looking at the PHOTO.\n\n                                     TRUMAN\n                         I'm sorry. I should have told you \n                         what they made me call the book.\n                              (touches Perry's arm)\n                         I couldn't pretend to be your friend. \n                         The truth is, I can't help wanting \n                         to be.\n                              (silence, then:)\n                         You don't have to tell me anything \n                         if you don't want to.\n\n               Perry looks at the photo of himself and his sister for a \n               long time.\n\n                                     PERRY\n                         Look at my belly.\n\n               Perry sits on the bed. Then, almost to himself:\n\n                                     PERRY\n                         There must be something wrong with \n                         us. To do what we did.\n\n               Truman waits him out, sitting on the chair. Finally, Perry \n               looks at him. When Perry speaks, it is quietly, completely \n               matter-of-fact.\n\n                                     PERRY\n                         We heard there was ten thousand \n                         dollars in that house. Once we'd \n                         tied up everybody and searched all \n                         over, I knew the guy who told us \n                         about it was wrong. There wasn't any \n                         money. But Dick wouldn't believe it. \n                         He went tearing through the house \n                         again, banging on the walls, looking \n                         for a safe. He said when he was done, \n                         he was going to come up to Nancy's \n                         room and have his way with her. I \n                         wouldn't allow it. I told him that. \n                         I sat with Nancy.\n\n                                                                    CUT TO:\n\n               INT. CLUTTER HOUSE, NANCY'S ROOM - FLASHBACK, NIGHT\n\n               Perry and Nancy. Perry sits quietly on the edge of Nancy's \n               bed. A SMALL BEDSIDE LAMP softly illuminates a portion of \n               the room. We hear Dick banging around downstairs.\n\n                                     PERRY (V.O.)\n                         It was nice in there.\n\n               The scene is almost sweet, until we see that Nancy's legs \n               and hands are TIED and her mouth is TAPED.\n\n               INT. KSP, DEATH ROW, PERRY'S CELL - NIGHT\n\n               Perry talking to Truman.\n\n                                     PERRY\n                         Dick came to get me and we turned \n                         out the lights and went down to the \n                         basement, where we had Mr. Clutter \n                         and the boy. Dick kept saying \"No \n                         witnesses.\" I figured if I just waited \n                         him out he'd give up and leave them \n                         tied up there. We'd drive all night, \n                         they'd never find us. Mr. Clutter's \n                         wrists were tied to a pipe over his \n                         head. He looked like he was hurt, so \n                         I cut him down.\n\n                                                                    CUT TO:\n\n               INT. CLUTTER HOUSE, BASEMENT - FLASHBACK, NIGHT\n\n               HERBERT CLUTTER is bound and taped, his hands tied to a PIPE \n               on the LOW CEILING. Perry CUTS the rope with a HUNTING KNIFE, \n               catches hold of Herb Clutter, lowers him onto a mattress box \n               on the floor.\n\n                                                                    CUT TO:\n\n               INT. KSP, DEATH ROW, PERRY'S CELL - NIGHT\n\n               Perry talking to Truman.\n\n                                     PERRY\n                         We put a box there on the floor so \n                         he'd be more comfortable. He asked \n                         if his wife and daughter were alright \n                         and I said they were fine, they were \n                         ready to go to sleep. I told him it \n                         wasn't long till morning when somebody \n                         would find them.\n                              (beat)\n                         He was looking at me. Just... looking \n                         at me. Looking at my eyes. Like he \n                         expects me to kill him -- expects me \n                         to be the kind of person who would \n                         kill him. I was thinking -- this \n                         nice man, he's scared of me. I was \n                         ashamed. I mean, I thought he was a \n                         kind man, a good... a gentleman. I \n                         thought so right up to the moment I \n                         cut his throat. I didn't realize \n                         what I'd did till I heard the sound.\n\n                                                                    CUT TO:\n\n               INT. CLUTTER HOUSE, BASEMENT - FLASHBACK, NIGHT\n\n               Herb Clutter gurgling on the floor.\n\n                                     PERRY (V.O.)\n                         Like some one drowning under water.\n\n                                                                    CUT TO:\n\n               INT. KSP, DEATH ROW, PERRY'S CELL - NIGHT\n\n               Perry and Truman. Silence, then:\n\n                                     PERRY\n                         I was staring at him, bleeding on \n                         the floor. I told Dick to finish him \n                         off, but he wouldn't do it. We \n                         couldn't leave Mr. Clutter like that, \n                         so I got the shotgun.\n\n                                                                    CUT TO:\n\n               INT. CLUTTER HOUSE, BASEMENT - FLASHBACK, NIGHT\n\n               Perry approaches with a SHOTGUN. He aims and SHOOTS him in \n               the face.\n\n               INT. CLUTTER HOUSE, ANOTHER PART OF THE BASEMENT - FLASHBACK \n               NIGHT\n\n               KENYON CLUTTER (15) is bound and gagged on an old sofa, a \n               pillow under his head. A flashlight illuminates his face. A \n               shotgun enters frame, FIRES. An enormous BURST of LIGHT.\n\n               INT. CLUTTER HOUSE, HERB AND BONNIE'S ROOM - FLASHBACK, \n               NIGHT\n\n               Bonnie Clutter (40's, small and thin) tied up on her bed. \n               Moonlight through the window.\n\n                                     PERRY (V.O.)\n                         We went to Mrs. Clutter's room.\n\n               The DOOR opens. Perry and Dick walk in with a flashlight. \n               Perry points the shotgun at Bonnie's face, FIRES. A BURST of \n               LIGHT.\n\n               INT. CLUTTER HOUSE, NANCY'S ROOM - FLASHBACK, NIGHT\n\n               Perry and Dick enter Nancy's room, shine the flashlight on \n               her face. She looks at Perry. She has been crying. After a \n               moment, she TURNS HER FACE to the wall, as if she knows what \n               is coming and doesn't want to watch it. Perry AIMS the shotgun \n               at the back of her head. The FLASHLIGHT switches OFF. The \n               shotgun FIRES. A BURST of LIGHT.\n\n                                                                    CUT TO:\n\n               INT. KSP, DEATH ROW, PERRY'S CELL - NIGHT\n\n               Perry and Truman. Perry still on the bed. Truman sits, not \n               moving, on the chair. Silence.\n\n                                     PERRY\n                         Then we drove off.\n\n               Silence. Perry looks at Truman.\n\n                                     PERRY\n                         What do you think of me now?\n\n               No answer. Then:\n\n                                     TRUMAN\n                         Added up, how much money did you get \n                         from the Clutters?\n\n               Perry thinks.\n\n                                     PERRY\n                         Between forty and fifty dollars.\n\n               Truman nods. They sit there for a long time.\n\n                                                                  FADE OUT:\n\n               INT. HOTEL ROOM, KANSAS CITY - DAWN, CONTINUOUS\n\n               FADE IN: Hands typing on a MANUAL TYPEWRITER.\n\n               Truman typing at the desk. He stops, removes the page from \n               the typewriter, places it on top of a SMALL STACK OF PAGES. \n               He sits back.\n\n                                                                    CUT TO:\n\n               INT. PLANE - DAY\n\n               Truman in his seat, sips a drink. He looks out the window.\n\n                                                                    CUT TO:\n\n               EXT. STREET, BROOKLYN HEIGHTS - LATE AFTERNOON\n\n               Truman walks with his TRAVEL BAG on his shoulder. He takes \n               out his KEYS and turns up the steps to his house.\n\n               INT. TRUMAN AND JACK'S HOUSE, FRONT HALL - CONTINUOUS\n\n               Truman opens the door.\n\n                                     TRUMAN\n                         Jack.\n\n               No answer. He walks down the hall to the BEDROOM.\n\n               INT. TRUMAN AND JACK'S HOUSE, BEDROOM - CONTINUOUS\n\n               Truman enters, drops his travel bag on the bed, zips it open, \n               removes a SMALL STACK OF TYPED PAGES. He walks to his desk.\n\n               On the desk, we see a HUGE STACK OF TYPED PAGES with a title \n               page on top which reads: IN COLD BLOOD. Truman lifts the \n               HUGE STACK, places the SMALL STACK under it. He smooths out \n               the pages, then steps back from it. He calls out:\n\n                                     TRUMAN\n                         Jack.\n\n               No answer. On Truman, standing in the middle of his room. He \n               has finished all that he can finish, and is lost as to what \n               to do next.\n\n                                                                  FADE OUT.\n\n               TITLE UP:          \"One Year Later\"\n\n               OVER BLACK WE HEAR THE FOLLOWING DIALOGUE COME UP SLOWLY:\n\n                                     TRUMAN (V.O.)\n                         ...I want to give it to you. The \n                         truth is, I'm desperate to be done \n                         with it...\n\n               FADE IN:\n\n               INT. TRUMAN AND JACK'S HOUSE, KITCHEN - DAY\n\n               Truman on the PHONE, in pajamas, looking in the FRIDGE.\n\n                                     TRUMAN\n                         Mr. Shawn, I... I've spent four years \n                         of my life on this book... They got \n                         a stay of execution yesterday... \n                         Another, yes....\n\n               He gets out a jar of BONNET BABY FOOD CUSTARD and starts to \n               eat it. Truman finds a bottle of J&B on the counter and pours \n               a shot in his custard.\n\n                                     TRUMAN\n                         Supreme Court....\n\n               He stirs the custard, eats it.\n\n                                     TRUMAN\n                         ...It's harrowing -- all I want is \n                         to write the ending and there's no \n                         fucking end in sight... No. No, I \n                         haven't been drinking again...\n\n               INT. TRUMAN AND JACK'S HOUSE, BEDROOM - LATER\n\n               Truman sits on the bed with a glass of bourbon, staring at \n               the television. An empty jar of BABY CUSTARD sits on the \n               bedside table.\n\n               INT. TRUMAN AND JACK'S HOUSE, BEDROOM - LATER\n\n               Truman on the bed, the television still on, another drink. \n               We hear a DOORBELL. We hear Jack walk down the hall, answer \n               the door, shut the door. Jack enters with a TELEGRAM.\n\n                                     JACK\n                         I don't know how you can eat that. \n                         Perhaps if you weren't drinking so \n                         much you wouldn't have to.\n\n               No response. Jack turns down the television, opens the \n               telegram.\n\n                                     JACK\n                              (reads)\n                         \"Dear friend Truman. Haven't heard \n                         from you in such a long while. Please \n                         help find new lawyer. If not, Dick \n                         will have to write Supreme Court \n                         brief himself. Our last appeal. What \n                         a pair of wretched creatures. Please \n                         help. Your amigo? Perry.\"\n\n               Pause. Jack looks at Truman.\n\n                                     JACK\n                         Your amigo.\n\n               Truman stares back. Finally, he turns back to the television.\n\n                                     TRUMAN\n                         Put it with the others.\n\n               Jack goes to the DESK and places the telegram on top of a \n               LARGE PILE OF TELEGRAMS, all from Perry -- all, we should \n               assume, unanswered.\n\n               Jack walks out. Truman sips his drink.\n\n               INT. TRUMAN AND JACK'S HOUSE, BEDROOM - LATER, EARLY EVENING\n\n               Truman at the desk, still in PAJAMAS, typing. Jack enters \n               wearing a TUXEDO, reads over Truman's shoulder. We see:\n\n               \"...unable to find laywer despite extensive search. So sorry. \n               All best, Truman.\"\n\n                                     JACK\n                         You tried?\n\n               Truman extracts the page from the typewriter, folds it, and \n               puts it in an envelope. He takes a sip of his BOURBON.\n\n                                     JACK\n                              (walking out)\n                         You need to get ready.\n\n                                                                    CUT TO:\n\n               INT. LIMOUSINE, MOVING - NIGHT\n\n               Truman and Jack are driven. Both wear TUXEDOS and OVERCOATS. \n               Truman drinks.\n\n               INT. LIMOUSINE, MOVING - NIGHT, LATER\n\n               Driving. Truman and Jack sit in silence, then:\n\n                                     JACK\n                         At least pretend for Nelle that you're \n                         having a good time tonight.\n\n               The limo turns a corner and we see an ENORMOUS CROWD in front \n               of a THEATER. On the marquee it says: \"Opening tonight - TO \n               KILL A MOCKINGBIRD\"\n\n               It is COLD. Truman and Jack's limo pulls up. An USHER opens \n               their DOOR.\n\n               EXT. MOVIE THEATER - MOMENTS LATER\n\n               Truman, obviously drunk, preens and poses on the red carpet \n               for the CAMERAS. Jack watches from the side.\n\n                                                                    CUT TO:\n\n               INT. SARDI'S RESTAURANT, OPENING PARTY - NIGHT\n\n               Huge party in progress. Nelle walks through the crowd. People \n               turn to her saying: \"Congratulations\"; \"Wonderful\". She finds \n               Truman sitting at the BAR, receiving a new drink.\n\n                                     TRUMAN\n                         Nelle.\n\n               She looks UNCOMFORTABLY DOLLED UP for the premiere of her \n               movie.\n\n                                     NELLE\n                         I thought I'd find you here.\n\n                                     TRUMAN\n                              (to the bartender)\n                         Please, another.\n\n               He hands Nelle his drink, receives another. After a moment:\n\n                                     NELLE\n                         How are you?\n\n                                     TRUMAN\n                         Terrible.\n\n               Beat.\n\n                                     NELLE\n                         I'm sorry to hear that.\n\n                                     TRUMAN\n                         Well. It's torture. Torture...\n                              (he drinks)\n                         ...what they're doing to me.\n\n                                     NELLE\n                         Uh-huh.\n\n                                     TRUMAN\n                         Now the Supreme Court. Can you believe \n                         it? If they win this appeal I will \n                         have a complete nervous breakdown. I \n                         may never recover. Just pray things \n                         turn my way.\n\n                                     NELLE\n                         It must be hard.\n\n                                     TRUMAN\n                         It's torture. They're torturing me.\n\n                                     NELLE\n                         I see.\n\n               Nelle regards him for a moment.\n\n                                     NELLE\n                         And how'd you like the movie, Truman.\n\n               She puts her drink down on the bar and walks away. Truman \n               turns back to the bartender, shrugs.\n\n                                     TRUMAN\n                         I frankly don't know what the fuss \n                         is about.\n\n               On Truman, alone at the bar.\n\n                                                                  FADE OUT.\n\n               EXT. STREET, OUTSIDE TRUMAN AND JACK'S HOUSE - EARLY MORNING\n\n               FADE UP on a PAPER BOY riding his BIKE down the street. New \n               buds are on the trees. It is SPRING. The BOY wears a NEW \n               YORK TIMES bag slung over his chest and is tossing copies of \n               the paper. One of them lands on Truman and Jack's stoop.\n\n               INT. TRUMAN AND JACK'S HOUSE, BEDROOM - MORNING\n\n               Phone RINGING. Truman asleep.\n\n               INT. TRUMAN AND JACK'S HOUSE, JACK'S TINY OFFICE - SAME TIME\n\n               Jack is writing, longhand, at his desk. PHONE is ringing. \n               Jack notices that his door is slightly ajar. He kicks it \n               shut. The ringing is much quieter. He keeps writing.\n\n               INT. TRUMAN AND JACK'S HOUSE, BEDROOM - SAME TIME\n\n               Truman asleep. PHONE ringing. He wakes up, groggy, answers.\n\n                                     TRUMAN\n                         Hello.\n\n                                     OPERATOR (OVER PHONE)\n                         Mr. Capote?\n\n                                     TRUMAN\n                         Yes?\n\n                                     OPERATOR\n                         I have a call from Mr. Perry Smith \n                         in the Kansas Correctional System. \n                         Will you accept charges?\n\n               Pause.\n\n                                     OPERATOR\n                         Mr. Truman Capote?\n\n                                     TRUMAN\n                         Yes.\n\n                                     OPERATOR\n                         Will you accept charges?\n\n                                     TRUMAN\n                         Oh.\n                              (no way out of this)\n                         Uh... Yes.\n\n                                     OPERATOR\n                         You'll accept charges?\n\n                                     TRUMAN\n                         Yes.\n\n                                     OPERATOR\n                         Mr. Smith, you're on the line.\n\n               Now Truman's awake. We hear a series of CLICKS, then:\n\n                                     PERRY (OVER PHONE)\n                         Hello.\n\n               Truman can't bring himself to speak.\n\n                                     PERRY\n                         Hello? I can't --\n                              (to someone)\n                         This doesn't seem --\n                              (we hear Perry clicking \n                              the cradle, then:)\n                         Operator, I don't think you put me --\n\n                                     TRUMAN\n                         I'm here.\n\n               Beat.\n\n                                     PERRY\n                         Truman.\n\n                                     TRUMAN\n                         Hello, Perry.\n\n                                     PERRY\n                         They let me make a couple phone calls \n                         before I go down to Holding... You \n                         heard the Supreme Court rejected the \n                         appeal.\n\n                                     TRUMAN\n                         I didn't... I hadn't heard that.\n\n                                     PERRY\n                         Yeah.\n\n               Pause.\n\n                                     TRUMAN\n                         I'm sorry.\n\n                                     PERRY\n                         Yeah. They let me make two phone \n                         calls.\n\n               Truman doesn't know what to say.\n\n                                     PERRY\n                         We've got a date set for the \n                         Warehouse, Dick and me. Two weeks \n                         and... Finito. April 14.\n\n               Beat.\n\n                                     PERRY\n                         Will you visit me? Truman. Will you \n                         come visit?\n\n                                     TRUMAN\n                         I don't know if I can. I'll try.\n                              (beat)\n                         I don't know if I can.\n\n               We hear over the line a GUARD in the background:\n\n                                     GUARD IN BACKGROUND (OVER PHONE)\n                         Time, Smith. Hang it up.\n\n                                     PERRY\n                         Please visit me, Truman. Just...\n\n                                     GUARD IN BACKGROUND (OVER PHONE)\n                         Time. Smith.\n\n               CLICK. Truman sits very still, the phone in his hand.\n\n                                                                    CUT TO:\n\n               INT. KSP, DEATH ROW - ONE WEEK LATER, NIGHT\n\n               Perry and Dick being shackled, their belongings packed into \n               boxes. One of the GUARDS in Perry's cell CLANGS the bars \n               with his STICK.\n\n                                     GUARD\n                         Ready.\n\n                                                                    CUT TO:\n\n               INT. KSP, CONFINEMENT CELL - ONE WEEK LATER, NIGHT\n\n               Perry lies alone on his cot. The DOOR opens, KRUTCH enters \n               with a GUARD.\n\n                                     KRUTCH\n                         Perry.\n\n               Perry sits up. Krutch sits on the one chair. The Guard stands \n               by the door, takes out a PAD and STUBBY PENCIL.\n\n                                     KRUTCH\n                         You're allowed three names of people \n                         you'd like to witness tomorrow. If \n                         there's anybody you want, tell me \n                         now.\n\n                                     PERRY\n                         Truman Capote.\n\n               Krutch nods to the Guard who writes the name down. Krutch \n               waits, then:\n\n                                     KRUTCH\n                         Anybody else?\n\n               Perry SHAKES HIS HEAD.\n\n               INT. TRUMAN AND JACK'S HOUSE, BEDROOM - LATE NIGHT\n\n               In a chair near the window, Truman sits awake in his pajamas, \n               unable to sleep, completely unable to decide what to do. He \n               watches Jack sleep. A long time -- then Truman walks to the \n               closet, gets out a travel bag, starts to pack.\n\n                                                                    CUT TO:\n\n               EXT. IDLEWILD AIRPORT, NEW YORK - DAY\n\n               A PLANE takes off.\n\n               INT. PLANE, FIRST CLASS SECTION - DAY\n\n               Truman sits next to William Shawn, who looks exhausted. The \n               STEWARDESS is approaching with the DRINKS CART. She collects \n               an empty BABY CUSTARD JAR from Truman's tray.\n\n                                     SHAWN\n                         You want anything?\n\n               Truman shakes his head.\n\n                                                                    CUT TO:\n\n               EXT. KANSAS STATE PENITENTIARY - DUSK\n\n               OUTSIDE LIGHTS switch on as it gets dark.\n\n               INT. KSP, CONFINEMENT CELL - NIGHT\n\n               Perry sits alone. The door opens and a Guard brings in his \n               LAST MEAL: three hot dogs, french fries, an ice cream sundae, \n               a strawberry soda. The Guard sets it down on the chair.\n\n                                     PERRY\n                         Thank you.\n                              (then)\n                         You sent the telegram to his hotel?\n\n                                     GUARD\n                         Hours ago.\n\n               Perry looks at the CLOCK on the wall: it's after 8pm.\n\n                                     PERRY\n                         May I make a phone call?\n\n                                                                    CUT TO:\n\n               INT. HOTEL ROOM, MUEHLEBACH HOTEL, KANSAS CITY - NIGHT\n\n               PHONE ringing. The CLOCK rads 8:55pm. Empty drinks glasses, \n               a custard jar. Truman lies curled in a fetal position on the \n               BED. Shawn walks the floor, exasperated.\n\n                                     SHAWN\n                         That's him again.\n\n               Truman is immobile. Phone still rings.\n\n                                     SHAWN\n                         We've never even met. It is utterly \n                         inappropriate for me to be talking \n                         to him.\n\n               Shawn gives up, PICKS UP the phone.\n\n                                     SHAWN\n                         Yes... I'm sorry, he's out, gone \n                         out... I'm not sure when...\n\n                                                                    CUT TO:\n\n               INT. KSP, HALLWAY - NIGHT\n\n               Krutch walks with a TELEGRAM PAGE in hand. A Guard follows. \n               They pass a WALL CLOCK: 9:40pm.\n\n               INT. KSP, CONFINEMENT CELL - NIGHT\n\n               Krutch and Guard enter Perry's cell. Perry hasn't touched \n               his meal.\n\n                                     KRUTCH\n                         You got a telex.\n\n               Perry nods. Krutch reads:\n\n                                     KRUTCH\n                         \"Perry. Unable to visit today because \n                         not permitted. Always your friend, \n                         Truman.\"\n                              (apologetically)\n                         That's it.\n\n                                     PERRY\n                         It's not true, is it?\n\n               Krutch hesitates a moment, then SHAKES his head.\n\n                                                                    CUT TO:\n\n               INT. NELLE'S KITCHEN, MONROEVILLE - MINUTES LATER\n\n               Nelle on the PHONE looking at a TELEGRAM. The kitchen CLOCK \n               reads 10:20pm. She waits a moment till the line is answered.\n\n                                     NELLE (ON PHONE)\n                         Mr. Shawn? It's Nelle... I just got \n                         this telegram, has he seen it?\n\n               INTERCUT with William Shawn on the phone in Truman's hotel \n               room. A TELEGRAM lies on the DESK. Truman lies on the bed.\n\n               INT. MUEHLEBACH HOTEL ROOM, KANSAS CITY - NIGHT\n\n                                     SHAWN (ON PHONE)\n                         He won't look at it.\n\n                                     NELLE\n                         Would you put him on please?\n\n                                     SHAWN\n                         He won't talk.\n\n                                     NELLE\n                              (calmly)\n                         Mr. Shawn, if you have to hold him \n                         down and put the phone on his ear, I \n                         need to speak to him.\n\n               Shawn, terrifically uncomfortable, walks over to Truman and \n               holds the phone out to him.\n\n                                     SHAWN\n                         It's Nelle.\n\n               A moment, then Truman takes the phone. On Truman's face. We \n               hear, through the receiver, Nelle:\n\n                                     NELLE (OVER PHONE)\n                         Truman.\n\n               Truman finally breathes out.\n\n                                                                    CUT TO:\n\n               INT. KSP, HOLDING CELL - SAME TIME\n\n               Perry is led, SHACKLED, into a holding cell on the ground \n               floor of the Death Row Building. Dick is already there, \n               seated, shackled. We HEAR PERRY'S VOICE:\n\n                                     PERRY (V.O.)\n                         \"Miss Nelle Harper Lee and Truman \n                         Capote: Sorry that Truman was unable \n                         to make it here at the prison for a \n                         brief word prior to necktie party...\n\n               The CLOCK reads 11:05pm. Through the WINDOW, we see activity \n               in the Gallows Warehouse across the yard.\n\n                                     PERRY (V.O.)\n                         ...Whatever his reason for not showing \n                         up, I want him to know that I cannot \n                         condemn him for it and understand...\n\n               Perry makes eye contact with the Guard, who CHEWS GUM. The \n               Guard checks through the SMALL WINDOW in the door, then \n               approaches Perry, places a STICK OF GUM in Perry's mouth. \n               Perry CHEWS.\n\n                                     PERRY (V.O.)\n                         ...Not much time left but want you \n                         both to know that I've been sincerely \n                         grateful for your friendship through \n                         the years and everything else...\n\n                                                                    CUT TO:\n\n               INT. MUEHLEBACH HOTEL ROOM, KANSAS CITY - NIGHT\n\n               Truman opens the door to the other part of the suite, where \n               William Shawn is waiting. Truman is fully dressed and ready. \n               Perry's VOICE:\n\n                                     PERRY (V.O.)\n                         ...I'm not very good at these \n                         things....\n\n               EXT. KANSAS STATE PENITENTIARY - NIGHT\n\n               TAXICAB pulls up to the prison gates. Perry's VOICE:\n\n                                     PERRY (V.O.)\n                         I have become extremely affectionate \n                         toward you both. But, harness time. \n                         Adios amigos. Your friend, Perry.\"\n\n               INT. KSP, WAITING ROOM OUTSIDE CELLS - NIGHT\n\n               Clock reads 11:35pm. Truman sits with Shawn. Truman is looking \n               at the TELEGRAM from Perry. He folds it, puts it in the breast \n               pocket of his jacket. Krutch approaches.\n\n                                     KRUTCH\n                         I didn't think I'd be seeing you \n                         again.\n                              (then)\n                         You can visit for a few minutes.\n\n               Truman stands, turns to Shawn, still seated.\n\n                                     SHAWN\n                         No.\n\n                                     TRUMAN\n                         Come with me.\n\n                                     SHAWN\n                         Truman. No.\n\n               Truman goes alone.\n\n               INT. KSP, HOLDING CELL - NIGHT\n\n               Perry, Dick, a Guard. Krutch lets Truman in.\n\n                                     KRUTCH\n                         Five minutes.\n\n               He exits, closes the door. Truman doesn't know what to say.\n\n                                     HICKOCK\n                              (without rancor)\n                         He returns. Long time.\n\n                                     TRUMAN\n                         I don't know what you must think of \n                         me.\n\n                                     HICKOCK\n                         You haven't been foremost on my mind \n                         lately. As you can imagine.\n\n               Dick looks at Perry and smiles. Perry chews his gum and smiles \n               back, then looks to Truman who seems upset.\n\n                                     PERRY\n                         You got the letter?\n\n                                     TRUMAN\n                         Yes.\n\n                                     PERRY\n                         It's true. I mean I understand why \n                         you didn't want to come. I wouldn't \n                         be here either if I didn't have to.\n\n                                     HICKOCK\n                         You got that right.\n\n               Silence.\n\n                                     PERRY\n                         You know Ricardo donated his eyes to \n                         science? Next week, some blind man \n                         will be seeing what Dick used to \n                         see.\n\n                                     HICKOCK\n                              (laughs)\n                         He'd be better off the way he was. \n                         What I've seen hasn't been so nice \n                         to look at -- but I guess it's better \n                         than nothing.\n                              (he shrugs, to Truman)\n                         They came around with a form.\n                              (beat)\n                         Hey. You'll be walking down the street \n                         one day in Denver, wherever -- and \n                         suddenly these eyes will be staring \n                         at you. Wouldn't that be something?\n\n                                     TRUMAN\n                              (quietly)\n                         It would be.\n\n               Krutch opens the door.\n\n                                     KRUTCH\n                         Time.\n\n               Truman looks at the clock: 11:50pm. Truman turns to Perry \n               and Dick. Perry stands.\n\n                                     PERRY\n                         You'll be watching?\n\n                                     TRUMAN\n                         I don't know. Do you want me to?\n\n                                     PERRY\n                         I'd like to have a friend there.\n\n                                     TRUMAN\n                         Okay. Then I will.\n\n               Truman looks down, starts to cry.\n\n                                     PERRY\n                         It's alright.\n\n                                     TRUMAN\n                         I did everything I could.\n\n                                     PERRY\n                         Okay.\n\n                                     TRUMAN\n                         I truly did.\n\n                                     PERRY\n                         I know.\n\n               Truman nods, wipes his eyes.\n\n                                     TRUMAN\n                         Goodbye, Perry.\n\n                                     PERRY\n                         You're not rid of me yet. I'll see \n                         you in a few minutes.\n\n               Truman goes. On Perry watching him leave.\n\n                                                                    CUT TO:\n\n               INT. CORNER WAREHOUSE - NIGHT\n\n               Huge. Dirt floor. Wooden gallows. TWENTY MEN stand around, \n               some smoking. Some are silent. Some whisper quietly.\n\n               Journalists. Also, Alvin Dewey and the KBI men: Church and \n               Nye. Krutch in front of the gallows with a CHAPLAIN. At the \n               foot of the gallows steps, the EXECUTIONER -- thin, older, a \n               too-large pin-striped suit and stained cowboy hat. Truman. \n               William Shawn.\n\n               HEADLIGHTS, then a PRISON CAR enters, stops. Dick is extracted \n               from the back seat. He stands, looks at the CROWD, then at \n               the GALLOWS. The Guards nudge him forward.\n\n               INT. KSP, HOLDING CELL - A FEW MINUTES LATER\n\n               CLOCK reads 12:05pm. Perry sits alone looking at his hands. \n               We HEAR A TRAP DOOR SPRING and CLATTER. Perry looks up.\n\n               INT. PRISON CAR - NIGHT\n\n               Light rain outside. Perry in the back seat being driven across \n               the yard. He looks out his window, sees a PICKUP TRUCK drive \n               out of the Corner Warehouse. On it: a BODY covered by a BLACK \n               CLOTH.\n\n               INT. CORNER WAREHOUSE - NIGHT\n\n               The PRISON CAR enters, stops. Perry is removed from the back \n               seat. He stands, looks at the assembled men, looks at Truman. \n               He's nudged forward. As he passes DEWEY, he extends his hand:\n\n                                     PERRY\n                         Nice to see you.\n\n               Dewey is caught off-guard so shakes his hand. Perry is led \n               to the base of the gallows.\n\n                                     KRUTCH\n                         Perry Edward Smith.\n                              (reads)\n                         \"For the crime of murder in the first \n                         degree, by order of the Court of \n                         Finney County and the Supreme Court \n                         of the sovereign State of Kansas, \n                         you are sentenced to hang until you \n                         die.\"\n                              (then)\n                         You can say something if you want.\n\n                                     PERRY\n                              (quietly, to Krutch)\n                         Is there anybody from the family \n                         here?\n\n                                     KRUTCH\n                         No.\n\n               Perry is disappointed by this information.\n\n                                     PERRY\n                         Well. Tell them...\n                              (he look out at \n                              everyone)\n                         I can't remember what I was going to \n                         say for the life of me...\n\n               He stops. Several moments.\n\n               Krutch can't tell if he's done. Finally, Krutch nods to the \n               Guard. Perry is led up the STEPS. The Chaplain follows.\n\n                                     CHAPLAIN\n                         Though I walk through the valley of \n                         the shadow of death, I will fear no \n                         evil, for thou art with me.\n\n               The Executioner puts the NOOSE around Perry's neck. Perry \n               chews his gum. Executioner opens a BLACK CLOTH SACK.\n\n               Perry looks at the Chaplain reading prayers, looks at the \n               crowd, at Truman.\n\n                                     CHAPLAIN\n                         Thy rod and thy staff, they comfort \n                         me.\n\n               The BLACK SACK goes over Perry's head. Truman watches. He \n               stands next to Alvin Dewey.\n\n                                     CHAPLAIN\n                         Thou preparest a table before me in \n                         the presence of mine enemies. Thou \n                         annointest my head with oil.\n\n               The Executioner pulls the handle, Perry drops.\n\n                                     CHAPLAIN\n                         My cup runneth over.\n\n               On Truman. Then a WIDE SHOT of the inside of the Warehouse: \n               twenty men watching Perry Smith hang, the Chaplain reading.\n\n                                                                  FADE OUT.\n\n               OVER BLACK:\n\n               The SOUND of a TELEPHONE RINGING, as heard through the \n               receiver. We HEAR the CLICK of the phone being PICKED UP, \n               then, after a moment, a VOICE:\n\n                                     NELLE\n                         Hello.\n\n               FADE UP:\n\n               INT. HOTEL ROOM, KANSAS CITY - EARLY MORNING\n\n               Truman sits on the edge of the bed in his WET OVERCOAT, as \n               if he'd walked in the rain.\n\n                                     TRUMAN\n                         Someday I'll tell you about it. For \n                         the moment, I'm too shattered.\n\n               Pause.\n\n                                     NELLE\n                         They're dead, Truman. You're alive.\n\n                                     TRUMAN\n                         It was a terrible experience and I \n                         will never get over it.\n                              (then)\n                         There wasn't anything I could have \n                         done to save them.\n\n               We hear Nelle light a cigarette.\n\n                                     NELLE\n                         Maybe not.\n\n               We hear her exhale slowly.\n\n                                     NELLE\n                         But the fact is, you didn't want to.\n\n               On Truman,\n\n                                                                  FADE OUT.\n\n               FADE IN: BRIGHT WHITE. AIRPLANE NOISE. COLORS RESOLVE INTO:\n\n               INT. FIRST CLASS SECTION, AIRPLANE - DAY\n\n               Truman, seated on the aisle, next to William Shawn. After a \n               long silence, he extracts from his leather briefcase a PACKAGE \n               wrapped in BROWN PAPER. Hands it to Truman.\n\n                                     SHAWN\n                         It came to the hotel this morning. I \n                         told them I'd give it to you.\n\n               The package says KANSAS STATE PENITENTIARY and is addressed \n               to Truman. Truman opens it.\n\n               He takes out PERRY'S NOTEBOOKS -- the DIARY and PERSONAL \n               DICTIONARY. He opens the Diary. Toward the end, he finds \n               Perry's final entry. He READS silently. We hear Perry's VOICE:\n\n                                     PERRY (V.O.)\n                         Did we not know we were to die, we \n                         would be children. By knowing it, we \n                         are given the opportunity to mature \n                         in spirit...\n\n               Truman turns the page. It's BLANK. He closes the Diary.\n\n               We CONTINUE to hear Perry's VOICE as Truman takes out a \n               SNAPSHOT -- the one of Perry (at age 3) and Linda splashing \n               in the puddle.\n\n                                     PERRY (V.O.)\n                         Some take that opportunity. I hope I \n                         have...\n\n               Truman takes out a PENCIL DRAWING Perry did of him. It's \n               very good, though Truman looks old and weary in it.\n\n                                     PERRY\n                         Life is only the father of wisdom. \n                         Death is the mother.\n\n               Truman finds, at the bottom of the package, his TIE. He takes \n               it out, clutches it.\n\n               Truman grasps for William Shawn's HAND, finds it, holds on \n               tightly. Shawn sits stoically, hoping no one will notice.\n\n               The CAMERA pulls back, up the aisle. Truman clutches the \n               tie, and holds on to Shawn's hand, for dear life.\n\n                                                             FADE TO BLACK.\n\n               TITLE UP: (each title fades up in succession)\n\n               In Cold Blood made Truman Capote the most famous writer in \n               America.\n\n               He never finished another book.\n\n               The epigraph he chose for his last published work reads: \n               \"More tears are shed over answered prayers than unanswered \n               ones. \"\n\n               He died in 1984 of complications due to alcoholism.\n\n  \n\n                                        THE END\n\n\n\n\n\nCapote\nWriters :   Dan Futterman\nGenres :   Crime  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "In 1959, the four dead bodies of the Clutter family are discovered on their Kansas farm. While reading The New York Times, Truman Capote (Philip Seymour Hoffman) is riveted by the story and calls The New Yorker magazine editor William Shawn (Bob Balaban) to tell him that he plans to document the tragedy.\nCapote travels to Kansas, inviting childhood friend Nelle Harper Lee (Catherine Keener) to come along. He intends to interview those involved with the Clutter family, with Lee as his go-between and facilitator. Alvin Dewey (Chris Cooper), the Kansas Bureau of Investigation's lead detective on the case, brushes him off, but Dewey's wife Marie (Amy Ryan) is a fan of Capote's writing and persuades her husband to invite Capote and Lee to their house for dinner.\nCapote's stories of movie sets and film stars captivate Marie. Over time, her husband warms up to Capote and allows him to view the photographs of the victims. The Deweys, Lee, and Capote are having dinner when the murder suspects, Perry Smith (Clifton Collins, Jr.) and Richard \"Dick\" Hickock (Mark Pellegrino), are caught. Flattery, bribery, and a keen insight into the human condition facilitate Capote's visits to the prison where the accused are held.\nCapote begins to form an attachment to Smith. He informs Shawn of his intent to expand the story into a full-length book. Following the trial and conviction, Capote gains continued access to the murderers by bribing Warden Marshall Krutch (Marshall Bell).\nCapote spends the following years regularly visiting Smith and learning about his life, excepting a year-long stint when he goes to Morocco and Spain to write the \"first three parts\" of the book, accompanied by his romantic partner Jack Dunphy (Bruce Greenwood).\nThe story of Smith's life, his remorseful manner, and his emotional sincerity impress Capote, who becomes emotionally attached to him despite the gruesome murders. Capote aids Smith and Hickock by obtaining expert legal counsel for them and initiating an appeal. Still he is frustrated, as Smith declines to relate exactly what happened on the night of the murders.\nThough initially an effort to provide proper representation and extend Capote's opportunity to speak with the killers, the appeals process drags on for several years. Without the court case being resolved, Capote feels he is stuck with a story without an ending, and he is unable to complete his book. Eventually he gets Smith to describe the killings and his thoughts at the time in great detail. He has what he was after from Smith, but in the process he sees a callousness and selfishness in his own actions.\nNow with everything in hand, Capote still must wait for the appeals process to conclude before he feels he can publish his work. In the course of time, Lee's best-selling novel To Kill a Mockingbird is turned into a movie, but Capote is unable to share in the joy of his friend's success, too caught up in drinking through his own misery.\nWith the last appeal rejected, Smith pleads for Capote to return before he is executed, but Capote cannot bring himself to do so. A telegram from Smith to Harper Lee ultimately compels Capote to return to Kansas. There he is an eyewitness as Smith and Hickock are executed.\nCapote talks to Lee about the horrifying experience and laments that he could not do anything to stop it. She replies, \"Maybe not. The fact is you didn't want to.\" The final scenes show Capote looking through photos from the case and at the writings and drawings given to him by Smith. An epilogue points out that In Cold Blood turned Capote into the most famous writer in America, also noting that he never finished another book."}