{"title": "Case 39", "full_text": "CASE 39\r\n\r\n\r\n\r\n                                    Written by\r\n\r\n                                    Ray Wright\r\n                         \r\n                         \r\n                         \r\n                         \r\n                                                            02/06/06\r\n\r\n\r\n          INSPIRED BY REAL EVENTS\r\n           1.\r\n                         \r\n                         \r\n          Pitch black. We hear FOOTSTEPS sneaking up an old wooden\r\n          staircase. Two people moving as one.\r\n                         \r\n          Topping the stairs, they creep down the hall to the closed\r\n          door that protects us. We can hear them behind it,\r\n          whispering, bickering insanely, one shushing the other.\r\n                         \r\n          The squeak of a door knob slowly turning. The faint click of\r\n          the latch. And the door inches open, throwing a razor-thin\r\n          shaft of light into the darkness where it illuminates a\r\n                         \r\n                         FRIGHTENED EYE\r\n                         \r\n          As a ten-year-old GIRL sits up in bed. Dead tired. Staring\r\n          at the two dark faces peering in at her.\r\n                         \r\n                          GIRL\r\n           I can see you...\r\n                         \r\n          And the door closes, leaving us once more in total darkness.\r\n          We can hear them bickering again as they shuffle away, their\r\n          footsteps descending the stairs, fading into the uneasy\r\n          silence of this old house...\r\n                         \r\n          INT. FIFTH GRADE CLASSROOM, LOS ANGELES - DAY\r\n                         \r\n          A young teacher (DARLA) chalks a lesson on a blackboard in a\r\n          sun-drenched Los Angeles classroom.\r\n                         \r\n                          DARLA\r\n           -- and we know from yesterday that the\r\n           base of a triangle times half the height\r\n           equals the area.\r\n                         \r\n          A girl in the back row raises her hand.\r\n                         \r\n                          DARLA\r\n           Yes, Mia?\r\n                         \r\n                          GIRL\r\n           Lucy's asleep again.\r\n                         \r\n          Darla puts down the chalk and comes up the aisle to where a\r\n          slight, fair-skinned girl in a thrift shop dress sleeps head\r\n          down on her desk. The girl from the opening scene. LUCY\r\n          SHERIDAN. Darla stands over her with obvious concern. Puts\r\n          a finger to her lips to quiet the giggles.\r\n                         \r\n                          DARLA\r\n           Let her sleep.\r\n                         \r\n          She draws the shade. It drops a shadowbox on the sleeping\r\n          girl.\r\n           2.\r\n                         \r\n                         \r\n          INT. COUNSELING ROOM, DEPARTMENT OF CHILD SERVICES, LOS\r\n          ANGELES - DAY\r\n                         \r\n          A former gang member sitting with his wife and troubled eight-\r\n          year-old son. The MARTINEZ FAMILY. A family in crisis.\r\n          Sitting opposite is an LA County social worker. Twenties.\r\n          Attractive but overworked. EMILY.\r\n                         \r\n                          GANG MEMBER\r\n           He would just go off, you know, start\r\n           tearin' the place down. You didn't even\r\n           know why he was doin' it half the time,\r\n           you just got out of his way...\r\n                         \r\n                          EMILY\r\n           And what you learned from your father now\r\n           Diego's learning from you...?\r\n                         \r\n          It's painful for him to hear that. He loves his son, quit\r\n          the streets for him. Overcome by emotion, he nods yes.\r\n                         \r\n                          EMILY\r\n           That really upsets you, doesn't it?\r\n                         \r\n          He wipes his eyes on his tattooed arm.\r\n                         \r\n                          GANG MEMBER\r\n           Yeah. Cuz I mean I don't want him to be\r\n           like me.\r\n                         \r\n          The boy looks at his father, has never seen him cry before.\r\n                         \r\n          INT. CORRIDOR - DAY\r\n                         \r\n          Outside the conference room, Emily musses the boy's hair.\r\n                         \r\n                          EMILY\r\n           A whole week without skipping school? Is\r\n           that true?\r\n                         \r\n          He smiles, nods. A glimpse of the boy he might have been.\r\n                         \r\n                          EMILY\r\n           That's the last time I make a bet with\r\n           you.\r\n           (to his parents)\r\n           See you guys next week.\r\n                         \r\n          The Martinez family heads down the hall, Diego lagging\r\n          behind. Emily watches with guarded optimism, knowing their\r\n          chances. Then turns to the NEXT FAMILY, welcoming the\r\n                         BELEAGUERED MOTHER:\r\n           3.\r\n                         \r\n                         \r\n                          EMILY\r\n           You cut your hair. It looks great.\r\n                         \r\n          INT. EMILY'S CUBICLE - DAY\r\n                         \r\n          The hurried opening and closing of files reveals PHOTOS of\r\n          abused children. Bruises. Cuts. Broken bones. Emily\r\n          trying to locate a single case amid the stacks and clutter on\r\n          her desk. An angry mother SCREAMING at her on the phone:\r\n                         \r\n                          EMILY\r\n           No one is trying to steal your child,\r\n           they found bruises and cigarette burns --\r\n           Mrs Lynch, I read the medical report --\r\n           well, if you feel you need legal\r\n           representation that's perfectly within\r\n           your rights...\r\n                         \r\n          A flurry of obscenities followed by a dial tone. Emily puts\r\n          the phone down. Sighs wearily.\r\n                         \r\n           WAYNE (O.S.)\r\n           One less Christmas card for Emily.\r\n                         \r\n          Her supervisor WAYNE, forties, gay, leaning in the doorway.\r\n                         \r\n                          WAYNE\r\n           How many active cases you have?\r\n                         \r\n                          EMILY\r\n           Thirty-eight.\r\n                         \r\n          He drops another file on her desk.\r\n                         \r\n                          EMILY\r\n           No, absolutely not, look at this, Wayne,\r\n           look, I'm buried --\r\n                         \r\n                          WAYNE\r\n           Sorry, Em, we all are.\r\n                         \r\n          He walks off. Emily shoves the new file onto the shelf above\r\n          her desk. Looks at it guiltily. Takes it down again.\r\n          Handwritten on the front: SHERIDAN, LUCY.\r\n                         \r\n          She opens it. A school portrait of ten-year-old Lucy clipped\r\n          to the preliminary report. The sad face draws Emily in.\r\n                         \r\n          EXT. WILSHIRE BLVD - DAY\r\n                         \r\n          An old VOLVO WAGON skirts rush hour traffic on Wilshire.\r\n          Faded red paint. Ski rack on the roof. An ancient\r\n          bumpersticker says Educate.\r\n           4.\r\n                         \r\n                         \r\n          INT. VOLVO WAGON - DAY\r\n                         \r\n          IPod jacked into the car stereo playing hip alternative\r\n          MUSIC, Emily leans on an elbow as she drives, not crazy about\r\n          L.A. but at ease with herself.\r\n                         \r\n          EXT. EMILY'S HOUSE - DAY\r\n                         \r\n          Emily's red Volvo wagon turns in the drive of a single-person\r\n          home she rents in a working-class neighborhood.\r\n                         \r\n          INT. EMILY'S HOUSE - DAY\r\n                         \r\n          Cozy. Her haven. Light colors offset dark hardwood floors.\r\n          Emily comes in, stack of files under her arm. Tired. Long\r\n          day. Drops the files in a chair. Sprinkles some food in a\r\n          fish tank. Referees through the glass.\r\n                         \r\n                          EMILY\r\n           Don't fight. Hey, that's his.\r\n                         \r\n          Turns on the tv. World news. Violence. People suffering.\r\n          Turns it off. Puts on some quiet music. Hits play on her\r\n          answering machine as she flops down barefoot on the sofa with\r\n          a magazine, peeling an orange, decompressing.\r\n                         \r\n           YOUNG WOMAN'S VOICE\r\n           Hey, it's Suze, missed you at yoga the\r\n           other day, give me a call.\r\n                         \r\n          BEEP.\r\n                         \r\n           YOUNG WOMAN'S VOICE #2\r\n           Hi, Em, Jackie, just checking in, hope\r\n           you're good.\r\n                         \r\n          BEEP. A charming male voice:\r\n                         \r\n                          DOUG'S VOICE\r\n           Exhausted, her career path questionable,\r\n           her faith in mankind shaken, she resisted\r\n           her tendency toward introspection and\r\n           went to have a drink with her friend\r\n           Doug.\r\n                         \r\n          BEEP. Emily gives a tired sigh. Faint smile under it.\r\n                         \r\n          INT. BAR - NIGHT\r\n                         \r\n          Noisy, trendy downtown bar. Professional type on a bar\r\n          stool. Thirties. Handsome. DOUG. He laughs when he sees\r\n          Emily.\r\n           5.\r\n                         \r\n                         \r\n                          DOUG\r\n           I am so in your head.\r\n                         \r\n          She gives him a kiss. Sits down beside him.\r\n                         \r\n                          EMILY\r\n           Be honest. The whole psychology thing,\r\n           it's just about scoring chicks, isn't it?\r\n                         \r\n                          DOUG\r\n           Regrettably, yes.\r\n                         \r\n          They share a laugh. He gestures to the bartender for another\r\n          beer.\r\n                         \r\n                          EMILY\r\n           You know what freaks me out?\r\n                         \r\n                          DOUG\r\n           That you have a four-year degree and make\r\n           seventeen grand a year after taxes?\r\n                         \r\n                          EMILY\r\n           I sit there talking to these families,\r\n           you know, like I'm some expert. My\r\n           family's a train wreck. I mean, I had\r\n           this moment today where I realized I\r\n           might be totally full of it.\r\n                         \r\n                          DOUG\r\n           Everybody's full of it. In the end\r\n           you're a number to call for people who\r\n           don't have anyone else. There's no way\r\n           that's bad.\r\n                         \r\n          Emily nods, appreciates that. Recognizes a girl going by in\r\n          the crowd. A friend from school. Well-dressed. Career-\r\n          oriented. The track Emily might be on if she weren't a\r\n          social worker.\r\n                         \r\n                          EMILY\r\n           Hey Becca...\r\n                         \r\n                          FRIEND\r\n                          (HUGGING HER)\r\n           Hey. So one of us is a major screwup, I\r\n           can't remember if I was supposed to call\r\n           you or the other way around...?\r\n                         \r\n                          EMILY\r\n           No, it's me, it's just been a crazy\r\n           couple weeks. You remember Doug.\r\n           6.\r\n                         \r\n                         \r\n                          FRIEND\r\n                          (HANDSHAKE)\r\n           Hi.\r\n           (then to Emily)\r\n           Listen, my ride's leaving, let's catch up\r\n           soon, okay?\r\n                         \r\n          Emily nods okay. The girl departs. Emily's beer arrives.\r\n          Doug hands it to her.\r\n                         \r\n                          DOUG\r\n           So anyway, I've done some soul searching\r\n           and I just want to say that if a full-on\r\n           relationship feels like too much right\r\n           now, I'd be willing to consider a purely\r\n           physical one.\r\n                         \r\n          Emily, sipping her beer, smiles.\r\n                         \r\n                          DOUG\r\n           Hey, you might actually enjoy yourself.\r\n                         \r\n                          EMILY\r\n           I'm sure I would, I just...\r\n                         \r\n          Hard to explain. Doug saves her the trouble.\r\n                         \r\n                          DOUG\r\n           I know, I know, the job, you get home you\r\n           don't have anything left.\r\n                         \r\n          Emily nods yeah, leans in closer, the friendly banter giving\r\n          way to a moment of real sincerity.\r\n                         \r\n                          EMILY\r\n           If it were anyone, it'd be you.\r\n                         \r\n          They exchange a look then Doug clinks his glass against hers.\r\n          And as they drink together after a long day, more than\r\n          friends, less than lovers...\r\n                         \r\n          INT. EMILY'S BEDROOM - NIGHT\r\n                         \r\n          Emily in glasses, reading the Sheridan file on her bed. The\r\n          preliminary report concerns her: \"Socially withdrawn. Lack\r\n          of appetite. Sleeping at school...\"\r\n                         \r\n          Her gaze returns to Lucy's photo. Sadly, under her breath:\r\n                         \r\n                          EMILY\r\n           What are they doing to you?\r\n           7.\r\n                         \r\n                         \r\n          EXT. SHERIDAN HOUSE - DAY\r\n                         \r\n          A dark, rundown family home on a once-prosperous cul de sac.\r\n          Emily pulls up. Gets out. Checks that she has the right\r\n          address. Halfway up the walk something stops her dead in her\r\n                         TRACKS -\r\n                         \r\n          A WOMAN'S FACE\r\n                         \r\n          staring at her through one of the lacy white curtains\r\n          upstairs. Ghostly pale. Gone as soon as she sees it. Emily\r\n          stands frozen for a moment. Walks on.\r\n                         \r\n          She reaches to knock on the door and it opens abruptly, the\r\n          security chain snapping taut. A woman's voice growls at her\r\n          from the darkness inside:\r\n                         \r\n                          WOMAN'S VOICE\r\n           What?\r\n                         \r\n                          EMILY\r\n           Emily Jennings. Child Services? We\r\n           spoke on the phone...?\r\n                         \r\n          Peering through the crack is the pallid, bony face from the\r\n          upstairs window. Lucy's mother. MARGARET SHERIDAN.\r\n                         \r\n                          MARGARET\r\n           You said the seventeenth.\r\n                         \r\n                          EMILY\r\n           Today is the seventeenth.\r\n                         \r\n                          MARGARET\r\n           Is not.\r\n                         \r\n                          EMILY\r\n           I'm sorry, but it is.\r\n                         \r\n                          MARGARET\r\n           Friday was the thirteenth.\r\n                         \r\n          Emily, rather amazed at the conversation she's having, takes\r\n          a newspaper from her bag. Indicates the date.\r\n                         \r\n                          EMILY\r\n           Friday was the fourteenth, that makes\r\n           today the seventeenth. Monday the\r\n           seventeenth. The date of our\r\n           appointment.\r\n                         \r\n          The door closes in Emily's face. What the hell? Then we\r\n          hear the chain unlock. It opens again.\r\n           8.\r\n                         \r\n          And we get our first good look at Lucy's mother. Gaunt.\r\n          Pale. Dark rings under her eyes. She steps aside, not\r\n          welcoming Emily in, merely allowing her to enter.\r\n                         \r\n          INT. SHERIDAN HOUSE - DAY\r\n                         \r\n          It's dark, the curtains drawn. Margaret twitches one open in\r\n          begrudging courtesy. The house is tidy but sad, steeped in a\r\n          kind of puritanical gloom. Lucy peers down through the\r\n          upstairs banister, anxious, unsure what's going on. Emily\r\n          sees her, smiles.\r\n                         \r\n                          EMILY\r\n           Come down, I'd like to meet you.\r\n                         \r\n          Lucy hesitates, sensing her mother's disapproval. Comes\r\n          slowly down the stairs. Emily shakes her hand.\r\n                         \r\n                          EMILY\r\n           My name's Emily. What's yours?\r\n                         \r\n                          LUCY\r\n           Lucy.\r\n                         \r\n                          EMILY\r\n           Pretty name. Pretty girl.\r\n                         \r\n          Lucy turns shyly away.\r\n                         \r\n                          EMILY\r\n                          (TO MARGARET)\r\n           Is there somewhere we can talk?\r\n                         \r\n          Margaret sighs and heads down the hall.\r\n                         \r\n          INT. LIVING ROOM, SHERIDAN HOUSE - DAY\r\n                         \r\n          Emily, file in hand, trying to project professionalism in an\r\n          arm chair that tilts to one side. Margaret and Lucy sitting\r\n          opposite on the sofa.\r\n                         \r\n                          EMILY\r\n           When do you expect your husband back?\r\n                         \r\n          Margaret shrugs.\r\n                         \r\n                          EMILY\r\n           Because we've found it's more beneficial\r\n           if the whole family participates.\r\n                         \r\n                          MARGARET\r\n           Well he's not home so...\r\n                         \r\n          Shrugs again.\r\n           9.\r\n                         \r\n                         \r\n                          EMILY\r\n           Do you have any way of contacting him?\r\n                         \r\n                          MARGARET\r\n           Not if I don't know where he is.\r\n                         \r\n          Just then we hear a POWER TOOL go on in the basement. Emily,\r\n          sensing the lie, indicates the floor.\r\n                         \r\n                          EMILY\r\n           Is that...?\r\n                         \r\n          Margaret averts her eyes.\r\n                         \r\n                          EMILY\r\n           Would you ask him to join us?\r\n                         \r\n                          MARGARET\r\n           He doesn't have anything to say.\r\n                         \r\n                          EMILY\r\n           Would you ask him?\r\n                         \r\n          Margaret weighs Emily's resolve, gives Lucy a cautionary\r\n          glance then exits. We hear her open a door and holler into\r\n          the basement over the noise of the power tool.\r\n                         \r\n           MARGARET (O.S.)\r\n           Edward! EDWARD!\r\n                         \r\n          The power tool stops.\r\n                         \r\n           MARGARET (O.S.)\r\n           That lady's here. From the state. She\r\n           wants to talk to you.\r\n                         \r\n          We hear an angry unintelligible reply.\r\n                         \r\n           MARGARET (O.S.)\r\n           I already told her, she wants to anyway.\r\n                         \r\n          We hear the power tool get thrown aside. FOOTSTEPS pounding\r\n          up the cellar stairs. Emily's and Lucy's faces reflect the\r\n          same simple fear. Their eyes meet.\r\n                         \r\n                          EMILY\r\n           It'll be okay.\r\n                         \r\n          Lucy not so sure. The FOOTSTEPS are upon them. EDWARD\r\n          SHERIDAN makes his entrance. A menacing man with a gaunt\r\n          face and dark deep-set eyes. Emily holds out her hand.\r\n           10.\r\n                         \r\n                         \r\n                          EMILY\r\n           Hi, I'm Emily --\r\n                         \r\n          Edward forgoes the handshake, his contempt obvious. Sits\r\n          beside Lucy on the sofa. Margaret sits on the other side.\r\n          Lucy tenses, trapped between them. Emily speaks with\r\n          kindness and composure. Hostile encounters part of the job.\r\n                         \r\n                          EMILY\r\n           I'm here today because Lucy's school is\r\n           concerned about changes they're seeing in\r\n           her academic performance. The kinds of\r\n           changes they're seeing are often\r\n           associated with family problems.\r\n                         \r\n          Edward leans over and whispers something caustic in\r\n          Margaret's ear.\r\n                         \r\n                          MARGARET\r\n           Eddie says we don't have family problems.\r\n                         \r\n                          EMILY\r\n           That's just it, many times a family won't\r\n           even know they're having problems until\r\n           it's too late. That's where we come in.\r\n           We help families communicate and learn\r\n           healthier ways of resolving conflict.\r\n                         \r\n          Edward whispers again in Margaret's ear.\r\n                         \r\n                          MARGARET\r\n           Eddie says we don't need your help.\r\n                         \r\n                          EMILY\r\n           Mr Sheridan, is there some reason you\r\n           won't speak to me directly?\r\n                         \r\n          Edward just stares at her.\r\n                         \r\n                          EMILY\r\n                          (TO MARGARET)\r\n           Is there some reason why your husband\r\n           won't speak to me directly?\r\n                         \r\n          Margaret nods, gives Edward a look as though for permission.\r\n                         \r\n                          MARGARET\r\n           Eddie doesn't like speakin' out of anger.\r\n                         \r\n          Emily does well to hide her fear. Refusing to be\r\n          intimidated, she engages Edward's stare. A battle of wills.\r\n          But his gaze has a murderous intensity she can't match. She\r\n          looks down, shuffling papers. Battle lost.\r\n           11.\r\n                         \r\n                         \r\n          INT. CHILD SERVICES - NIGHT\r\n                         \r\n          Emily follows Wayne along a row of cubicles after hours.\r\n          He's dropping files on desks. The new cases never stop.\r\n                         \r\n                          WAYNE\r\n           No laws against being weird, Em. Send it\r\n           over to CMC, we'll do a follow-up in a\r\n           month.\r\n                         \r\n                          EMILY\r\n           I didn't say weird, I said scary. The\r\n           guy sat there the entire time staring at\r\n           me, the mother is like his emotional\r\n           slave.\r\n                         \r\n          Wayne pauses in mock bewilderment.\r\n                         \r\n                          WAYNE\r\n           Wait, did you just fly to New York and\r\n           meet my parents?\r\n                         \r\n                          EMILY\r\n           Wayne, this girl's in trouble. I can\r\n           feel it.\r\n                         \r\n          Beneath Wayne's humor, a sober, hard-learned practicality.\r\n                         \r\n                          WAYNE\r\n           Wanna know what I can feel? The lawsuit\r\n           we're gonna get hit with if we violate\r\n           her parents' rights without any evidence\r\n           they've done something wrong.\r\n                         \r\n                          EMILY\r\n           Every time I talk to you you sound more\r\n           like a lawyer, you know that?\r\n                         \r\n                          WAYNE\r\n           Yeah, well, maybe because every time I\r\n           make an emotional decision I get called\r\n           by one. I'm sorry, you're gonna have to\r\n           let this one go.\r\n                         \r\n                          EMILY\r\n           You put these files in front of me and\r\n           you ask me to tell you what's going on.\r\n           Well, I'm telling you, there's something\r\n           going on and it's not something good.\r\n           I've done my job, I've told you, what you\r\n           do with it is yours.\r\n                         \r\n          She walks off. Wayne alone after hours with his conscience.\r\n           12.\r\n                         \r\n                         \r\n          INT. CORRIDOR, CHILD SERVICES - DAY\r\n                         \r\n          The elevator doors open with a DING and Edward and Margaret\r\n          Sheridan step out in their Sunday best. Benevolent faces.\r\n          Lucy between them, ribbon in her hair, brand new dress,\r\n          appearing coached as she eats an ice cream cone.\r\n                         \r\n          Emily, disgusted by the charade, trades looks with the\r\n          parents as they go past.\r\n                         \r\n          INT. PRIVATE CONFERENCE ROOM - DAY\r\n                         \r\n          Gazing fondly at Lucy, Edward directs his comments at Wayne,\r\n          who sits opposite the family with Emily.\r\n                         \r\n                          EDWARD\r\n           They really are God's miracles. Day she\r\n           was born was the happiest day of our\r\n           lives. We're not perfect parents, we\r\n           know that, but we figure if you let `em\r\n           know how much you love `em a lot of the\r\n           other stuff takes care of itself.\r\n                         \r\n          Wayne nods his agreement. Edward puts his arm around Lucy\r\n          for effect. Her eyes go to Emily. A silent plea for help.\r\n                         \r\n                          EMILY\r\n                          (HOSTILE)\r\n           Tell me, Mr Sheridan, since you've\r\n           suddenly acquired the power of speech,\r\n           doesn't it concern you a little that\r\n           Lucy's grades have gone from A's to D's\r\n           in three months?\r\n                         \r\n                          EDWARD\r\n           Course it does, she's our daughter.\r\n                         \r\n          With a glance Wayne cautions Emily about her tone of voice.\r\n                         \r\n                          EMILY\r\n           So you have no idea why she's falling\r\n           asleep at school every day? Why she's\r\n           not able to sleep at home?\r\n                         \r\n          Edward looks at Margaret, then Emily, affects bewilderment.\r\n                         \r\n                          EDWARD\r\n           Bad dreams?\r\n                         \r\n          INT. BREAK ROOM - DAY\r\n                         \r\n          Emily and Wayne in private conversation. She's pissed off.\r\n          The Sheridan family in the other room, preparing to leave.\r\n           13.\r\n                         \r\n                         \r\n                          EMILY\r\n           He's gonna be having bad dreams when he\r\n           gets hit with child endangerment.\r\n           (off Wayne's reluctance)\r\n           Don't tell me you're buying this daddy's\r\n           little girl routine?\r\n                         \r\n                          WAYNE\r\n           So they're overcompensating a little.\r\n                         \r\n                          EMILY\r\n           A little? Let me talk to her. Alone.\r\n           She wants to talk.\r\n                         \r\n                          WAYNE\r\n                          EM --\r\n                         \r\n                          EMILY\r\n           Five minutes. Talk to them about how\r\n           much they love kids.\r\n                         \r\n          She goes out the door.\r\n                         \r\n          INT. CORRIDOR - DAY\r\n                         \r\n          Emily walks with Lucy, looking for a way in.\r\n                         \r\n                          EMILY\r\n           I knew someone at school named Lucy, she\r\n           was a writer. Do you ever write? I do\r\n           sometimes, it helps me sort out how I'm\r\n           feeling.\r\n                         \r\n          Lucy doesn't take the bait. She stops for a drink at a water\r\n          fountain. Emily bends for a sip after. Misfires. As she\r\n          wipes her face, embarrassed:\r\n                         \r\n                          EMILY\r\n           Okay, I just shot like a gallon of water\r\n           up my nose. So much for establishing\r\n           trust.\r\n                         \r\n          Lucy smiles, for the first time. It's the opening Emily was\r\n          looking for. Maintaining that precious eye contact,\r\n                         DEEPENING IT:\r\n                         \r\n                          EMILY\r\n           What's happening to you? I can help.\r\n           Let me help.\r\n                         \r\n          Lucy looks away, eyes brimming with tears.\r\n           14.\r\n                         \r\n                         \r\n                          EMILY\r\n           What is it, sweetheart?\r\n                         \r\n                          LUCY\r\n           They hate me.\r\n                         \r\n          She lowers her head in shame, tears rolling down.\r\n                         \r\n                          EMILY\r\n           I'm sure they don't hate you.\r\n                         \r\n                          LUCY\r\n           They do. I hear them. They go in the\r\n           cellar and talk.\r\n                         \r\n                          EMILY\r\n           What do they talk about?\r\n                         \r\n                          LUCY\r\n           Sending me to hell.\r\n                         \r\n          Emily's mouth falls open.\r\n                         \r\n                          EMILY\r\n           You've heard them say that?\r\n                         \r\n          Lucy nods. As Emily registers this in quiet horror...\r\n                         \r\n          INT. CONFERENCE ROOM - DAY\r\n                         \r\n          A tape recorder is running. Emily and Wayne alone with Lucy.\r\n          She's hesitant to speak, naturally distrustful.\r\n                         \r\n                          EMILY\r\n           It's okay. You can tell him. He's on\r\n           our side.\r\n                         \r\n                          WAYNE\r\n           Did you hear your parents say they were\r\n           going to hurt you?\r\n                         \r\n          Nobody sees what Lucy sees at this moment. Edward glaring in\r\n          at her through the window. Lucy looks at Wayne, shakes her\r\n          head. Wayne looks at Emily, case closed.\r\n                         \r\n          INT. CORRIDOR - DAY\r\n                         \r\n          Emily watches in agony as the Sheridan family steps into the\r\n          elevator. Parent on each side, Lucy gives her one last\r\n          pleading look then the elevator doors close and she's gone.\r\n           15.\r\n                         \r\n                         \r\n          INT. WAYNE'S OFFICE - DAY\r\n                         \r\n          Emily and Wayne in the heat of an argument.\r\n                         \r\n                          EMILY\r\n           She doesn't trust anybody. You think I\r\n           made it up?\r\n                         \r\n                          WAYNE\r\n           I think you'd do just about anything you\r\n           had to do to help a child you thought was\r\n           at risk. Here are the facts, Emily.\r\n           They haven't laid a finger on her that we\r\n           can tell. And we have no proof they\r\n           intend to. Meanwhile on your desk right\r\n           now are thirty-plus cases of actionable\r\n           abuse. What about those?\r\n                         \r\n                          EMILY\r\n           I'm not giving up on her, Wayne.\r\n                         \r\n                          WAYNE\r\n           Yes, you are, you're leaving this alone.\r\n                         \r\n          A look that says he means it.\r\n                         \r\n                          EMILY\r\n           I hope you can live with a dead child on\r\n           your conscience.\r\n                         \r\n                          WAYNE\r\n                          (HURT)\r\n           That's a little unfair, don't you think?\r\n           I care about these kids as much as you\r\n           do, but we can't go around yanking them\r\n           out of their homes on a hunch. Parents,\r\n           even bad ones, have rights, that's how\r\n           the laws of this great land are written.\r\n                         \r\n          Emily gives a resigned nod, backing away from him, from the\r\n          job, all of it.\r\n                         \r\n                          EMILY\r\n           So that's it? We let kids get killed\r\n           until they rewrite the goddamn laws?\r\n                         \r\n          She exits before he can answer, doesn't want to hear it.\r\n                         \r\n          INT. DETECTIVE BARRON'S OFFICE, POLICE STATION - NIGHT\r\n                         \r\n          Detective MIKE BARRON. Veteran of the force. Man of quiet\r\n          faith.\r\n           16.\r\n                         \r\n          A well-built silver-haired family man who played fullback at\r\n          Brigham Young. He's doing paperwork. Smiles warmly as Emily\r\n          enters.\r\n                         \r\n                          BARRON\r\n           Was just thinking about you, got a nice\r\n           letter from Sandy Hutchinson...\r\n                         \r\n          She drops Lucy's file on his desk. Whatever Barron was going\r\n          to say is no longer relevant. Soberly, after a pause:\r\n                         \r\n                          BARRON\r\n           Well, it's sitting in front of me which\r\n           means our good friend Wayne thinks it\r\n           fails to meet the criteria for child\r\n           endangerment and has told you in no\r\n           uncertain terms to leave it alone...?\r\n                         \r\n                          EMILY\r\n           Surprise, surprise.\r\n                         \r\n          She starts to open the file. Barron stops her.\r\n                         \r\n                          BARRON\r\n           I can't, Emily. I'm sorry.\r\n                         \r\n                          EMILY\r\n           Mike, I'm desperate here.\r\n                         \r\n          Tense beat. The need for privacy now apparent, Barron gets\r\n          up and closes his door. Sits down at his desk again.\r\n                         \r\n                          BARRON\r\n           You know how dear to my heart the work\r\n           you do is, but the department doesn't pay\r\n           me to stakeout potential child abusers.\r\n           Last time almost cost me my job.\r\n                         \r\n                          EMILY\r\n           This girl heard her parents say they're\r\n           going to send her to hell.\r\n                         \r\n                          BARRON\r\n           Sickening as that is, you're a part of\r\n           the system that handles those situations,\r\n           I'm not.\r\n                         \r\n                          EMILY\r\n           The system is broken.\r\n                         \r\n                          BARRON\r\n           Maybe you just need to let it work.\r\n           17.\r\n                         \r\n                         \r\n                          EMILY\r\n           What? Jesus, I feel like I'm talking to\r\n           Wayne. You don't want to get involved,\r\n           fine, but don't bullshit me, I'm running\r\n           out of people I respect.\r\n                         \r\n                          BARRON\r\n           Okay. No bullshit. Give me evidence of\r\n           a crime, I'll be all over it. Till then\r\n           there's nothing I can do.\r\n                         \r\n                          CUT TO:\r\n                         \r\n          The blade of a circular saw SCREAMS through a pinewood board,\r\n          spitting sawdust...\r\n                         \r\n          A ten-pound hammer CRUSHES the head of a nail, sinking it,\r\n          CRUSHES another, CRUSHES another, the speed of the handiwork\r\n          conveying its urgency...\r\n                         \r\n          INT. SHERIDAN HOUSE - NIGHT\r\n                         \r\n          Lucy peering into the basement through an air vent in the\r\n          floor, vertical bands of light on her face. Edward hammering\r\n          down below. He steps aside and we see what he's making...\r\n                         \r\n          A HOMEMADE COFFIN\r\n                         \r\n          Sensing Lucy's stare, he glances up over his shoulder. And\r\n          Lucy ducks out of sight, breath held.\r\n                         \r\n          EXT. ELEMENTARY SCHOOL - DAY\r\n                         \r\n          Children waiting for the bus after school. Talking,\r\n          laughing. Lucy stands apart, tired and solemn. The bus\r\n          pulls up to the curb. As she goes to get on:\r\n                         \r\n           EMILY (O.S.)\r\n           Lucy.\r\n                         \r\n          She turns. Emily behind her.\r\n                         \r\n                          EMILY\r\n           I just wanted you to know I haven't\r\n           forgotten about you. I'm doing\r\n           everything I can.\r\n                         \r\n          Lucy hugs her, clinging for a moment.\r\n                         \r\n                          LUCY\r\n           If I disappear will you come look for me?\r\n           18.\r\n                         \r\n                         \r\n                          EMILY\r\n           You're not going to disappear.\r\n                         \r\n                          LUCY\r\n           If I do?\r\n                         \r\n          Emily holds her gaze, seeing the fear. Backing away, Lucy\r\n          indicates the bus.\r\n                         \r\n                          LUCY\r\n           I have to go. They get mad when I miss\r\n           the bus.\r\n                         \r\n          Lucy turns to go. Emily watches. Helpless.\r\n                         \r\n                          EMILY\r\n           Lucy, wait...\r\n                         \r\n          Takes her cell phone from her bag. Puts her number on speed\r\n          dial.\r\n                         \r\n                          EMILY\r\n           If anything happens, call me, okay? Just\r\n           press this. Don't let your parents know\r\n           you have it.\r\n                         \r\n          Tucks the cell phone in Lucy's coat pocket.\r\n                         \r\n                          EMILY\r\n           I'm gonna get you out of there, I\r\n           promise.\r\n                         \r\n          Lucy boards the bus. Waves to Emily from a back window as it\r\n          drives away. Emily waves back, heart in her throat. Might\r\n          be the last time she sees her alive.\r\n                         \r\n          INT. EMILY'S HOUSE - NIGHT\r\n                         \r\n          A sleepless night finds Emily slouched on her sofa, leaving a\r\n                         MESSAGE:\r\n                         \r\n                          ANSWERING MACHINE\r\n           Hey, this is Doug, here it comes -\r\n                         \r\n          BEEP.\r\n                         \r\n                          EMILY\r\n           It's me, thought you might be up, um,\r\n           anyway, call if you get this.\r\n                         \r\n          Hangs up. Clicks on the tv remote. Channel-surfs. World\r\n          news. Cooking show. Home shopping network.\r\n           19.\r\n                         \r\n          Hip-hop music video. Watches it for a moment. Gangster with\r\n          a mic. Scantily-clad girls shaking their asses.\r\n                         \r\n          The phone RINGS. Emily mutes the tv, picks up.\r\n                         \r\n                          EMILY\r\n           Too late, I met someone else...\r\n                         \r\n          A child's whisper.\r\n                         \r\n           LUCY (V.O.)\r\n           Emily...?\r\n                         \r\n                          EMILY\r\n           (concerned but calm)\r\n           Lucy? Are you okay?\r\n                         \r\n           LUCY (V.O.)\r\n           I'm scared...\r\n                         \r\n                          EMILY\r\n           Why? Why are you scared, honey?\r\n                         \r\n           LUCY (V.O.)\r\n           They're waiting to get me, I can hear\r\n           them... I'm sorry...\r\n                         \r\n                          EMILY\r\n           Why are you sorry?\r\n                         \r\n           LUCY (V.O.)\r\n           I'm falling asleep...\r\n                         \r\n                          EMILY\r\n           Okay, listen, I want you to go over and\r\n           open the window. Can you do that?\r\n           Lucy...?\r\n                         \r\n           LUCY (V.O.)\r\n           (softly; drifting off)\r\n           I'm sooorry...\r\n                         \r\n                          EMILY\r\n           Lucy, no, wake up!\r\n                         \r\n          INT. LUCY'S BEDROOM - NIGHT\r\n                         \r\n          The cell phone lying on the bed at Lucy's fingertips.\r\n                         \r\n                          EMILY\r\n                          (FROM PHONE)\r\n           Lucy...?!\r\n           20.\r\n                         \r\n                         \r\n          The illuminated screen casts an eerie glow on her SLEEPING\r\n          FACE.\r\n                         \r\n          INT. EMILY'S APARTMENT - NIGHT\r\n                         \r\n          Emily drops the phone. Moment of panic. Then a decision.\r\n          Throws a coat on over her bed clothes. Grabs the phone\r\n          again, dials a number in desperation.\r\n                         \r\n                          EMILY\r\n           Mike, it's Emily, listen, that girl I\r\n           told you about, I think she's in trouble -\r\n           - yeah, I know what you said, but --\r\n           Mike, you're not listening --\r\n                          (LOSES IT)\r\n           HELP ME!\r\n                         \r\n          EXT. EMILY'S CAR - NIGHT\r\n                         \r\n          Emily fumbles with her keys. Gets the right one in the door.\r\n          Opens it. Jumps in. Starts the engine. Peels off down the\r\n          road.\r\n                         \r\n          INT. LUCY'S BEDROOM - NIGHT\r\n                         \r\n          The cell phone turns itself off, plunging the room into total\r\n          darkness.\r\n                         \r\n          In BLACK, we hear FOOTSTEPS coming up the stairs. Down the\r\n          hall. Stopping at the door. The knob turning. The click of\r\n          the latch. The door opening. A shaft of light. Edward and\r\n          Margaret peering in with frenzied anticipation:\r\n                         \r\n          Lucy is asleep. The time has come.\r\n                         \r\n          INT. EMILY'S CAR - NIGHT\r\n                         \r\n          Emily red-lines the tachometer, doing ninety down the\r\n          freeway.\r\n                         \r\n          INT. STAIRWAY - NIGHT\r\n                         \r\n          Slowly, quietly, Edward descends the stairs with Lucy asleep\r\n          in his arms. Margaret in front of him, moving in tandem,\r\n          holding a roll of duct tape.\r\n                         \r\n          They reach the bottom. Margaret rushes ahead into the\r\n          kitchen.\r\n                         \r\n          INT. KITCHEN - NIGHT\r\n                         \r\n          Edward carries Lucy toward the OLD GAS OVEN where Margaret\r\n          waits, holding open the door.\r\n           21.\r\n                         \r\n                         \r\n          Delicately, cradling her head, Edward puts Lucy into the oven\r\n          without waking her. But as he lifts the door, one of the\r\n          metal hinges CREAKS.\r\n                         \r\n          Lucy jolts awake with a SCREAM. Kicks open the door before\r\n          Edward can shut it. With animal terror she thrashes her way\r\n          out onto the linoleum floor. Margaret throws a piece of duct\r\n          tape over her mouth, silencing her screams as Edward wrestles\r\n          her back into the oven. But she kicks open the door again\r\n          and the frantic struggle continues as...\r\n                         \r\n          EXT. SHERIDAN HOUSE - NIGHT\r\n                         \r\n          Emily's car lurches to a stop out front. As she jumps out,\r\n          Barron's pickup arrives. He joins her, a reluctant\r\n          accomplice.\r\n                         \r\n                          BARRON\r\n           What are we doing here?\r\n                         \r\n                          EMILY\r\n           Saving her life!\r\n                         \r\n          She goes up the walkway. Barron lagging a few steps behind,\r\n          eyeing the darkened house.\r\n                         \r\n                          BARRON\r\n           They're asleep.\r\n                         \r\n                          EMILY\r\n           They're not asleep.\r\n                         \r\n          Emily hears something inside the house.\r\n                         \r\n                          EMILY\r\n           Did you hear that?\r\n                         \r\n                          BARRON\r\n           I didn't hear anything.\r\n                         \r\n          Emily, trusting her gut, starts pounding on the door.\r\n                         \r\n                          EMILY\r\n           Leave her alone!\r\n                         \r\n          INT. KITCHEN - NIGHT\r\n                         \r\n          Hearing Emily, Edward and Margaret intensify their efforts,\r\n          jamming Lucy's legs inside the oven. The duct tape peels off\r\n          her mouth in the struggle and before the oven door slams shut\r\n          she belts out one last desperate SCREAM.\r\n           22.\r\n                         \r\n                         \r\n          EXT. SHERIDAN HOUSE - NIGHT\r\n                         \r\n          Clearly audible outside, it makes Barron jump.\r\n                         \r\n                          EMILY\r\n           Did you hear that?!\r\n                         \r\n          Barron pounds his big fist on the door.\r\n                         \r\n                          BARRON\r\n           Police, open up!\r\n                         \r\n                          EMILY\r\n           Break it down!\r\n                         \r\n          Barron rams his shoulder against the door, but it holds\r\n          solid.\r\n                         \r\n          INT. KITCHEN - NIGHT\r\n                         \r\n          We see Lucy's screaming face through the oven window as\r\n          Margaret cranks the temperature dial as high as it will go.\r\n                         \r\n          INT. GAS OVEN - NIGHT\r\n                         \r\n          From inside we see Edward and Margaret peering in as Lucy\r\n          claws at the glass with her fingernails. Coughing as the gas\r\n          fills the oven with a low hiss. We hear it ignite beneath\r\n          her with a faint poof. The first shimmering waves of heat\r\n          rising up, singeing her hair.\r\n                         \r\n          EXT. SHERIDAN HOUSE - NIGHT\r\n                         \r\n          Emily, hysterical, knowing they're too late:\r\n                         \r\n                          EMILY\r\n           BREAK IT DOWN!\r\n                         \r\n          INT. DOWNSTAIRS HALLWAY - NIGHT\r\n                         \r\n          The front door comes crashing down, kicked off its hinges by\r\n          Barron. Emily and he race in.\r\n                         \r\n                          EMILY\r\n           LUCY?!\r\n                         \r\n          They take off toward the kitchen at the end of the hall.\r\n                         \r\n          INT. KITCHEN - NIGHT\r\n                         \r\n          Emily and Barron rush in. Emily sees Lucy trapped inside the\r\n          oven. The sleeve of her pajamas catching fire.\r\n           23.\r\n                         \r\n                         \r\n                          EMILY\r\n           Oh my God...\r\n                         \r\n          Edward tries to fend Barron off. It's a mistake. Barron\r\n          unleashes a devastating blow that sends him recoiling into\r\n          the fridge so hard the back of his head leaves a visible dent\r\n          in the door.\r\n                         \r\n          Emily shoves Margaret aside and throws open the oven. Pulls\r\n          Lucy out onto the kitchen floor, swatting out her burning\r\n          pajamas with a dish towel.\r\n                         \r\n          Margaret grabs a steak knife and rushes at Emily, but Barron\r\n          has her covered. Backhands Margaret so hard it spins her\r\n          around fully before dropping her to the floor.\r\n                         \r\n                          BARRON\r\n           The hell's the matter with you people?!\r\n                         \r\n          Pajamas scorched, wild with terror, Lucy cries in great\r\n          heaving sobs in Emily's arms. Reduced to tears herself,\r\n          Emily keeps saying the same thing over and over.\r\n                         \r\n                          EMILY\r\n           I gotcha... I gotcha... I gotcha...\r\n                         \r\n          Shielding her from the sight of her parents: Margaret\r\n          sprawled on the linoleum weeping. Edward slouched against\r\n          the fridge, blood pouring down his shirt, his broken jaw\r\n          hanging open like a man thinking wow.\r\n                         \r\n          INT. COUNTY COURTROOM - DAY\r\n                         \r\n          Edward and Margaret holding hands at the defendant's table,\r\n          remorseless and defiant in their Sunday best. Among the many\r\n          spectators we find Emily and Mike Barron. The STATE\r\n          PROSECUTOR and PUBLIC DEFENDER addressing the JUDGE.\r\n                         \r\n                          STATE PROSECUTOR\r\n           Prosecution asks that you disallow an\r\n           insanity defense. This was an act\r\n           committed with premeditation, malice\r\n                          AFORETHOUGHT -\r\n                         \r\n                          PUBLIC DEFENDER\r\n           Your honor, the egregiousness of the\r\n           crime makes the competency question all\r\n           the more relevant.\r\n                         \r\n                          JUDGE\r\n           Yes. I hereby order the defendants\r\n           undergo psychiatric evaluation to\r\n           determine their mental fitness for trial.\r\n           24.\r\n                         \r\n                         \r\n          Emily rolls her eyes at Barron, some justice system.\r\n                         \r\n          EXT. COURTHOUSE PARKING LOT - DAY\r\n                         \r\n          Barron walks Emily to her car. She's outraged.\r\n                         \r\n                          EMILY\r\n           Steal a pizza, San Quentin, try killing\r\n           your kid, Freudian dream analysis.\r\n                         \r\n                          BARRON\r\n           Well, you're gonna hate me for saying\r\n           this, but my money's on crazy.\r\n                         \r\n                          EMILY\r\n           Did they or did they not know what they\r\n           were doing? That's the legal standard.\r\n           They knew, they knew damn well!\r\n                         \r\n                          BARRON\r\n           It's not that simple sometimes.\r\n                         \r\n                          EMILY\r\n           (stops on a dime)\r\n           Meaning what exactly?\r\n                         \r\n          Barron hesitates. He's crossing the line by telling her\r\n          this.\r\n                         \r\n                          BARRON\r\n           When we brought them in that night they\r\n           told Captain Lister... They think she's\r\n           evil, some kind of demon spirit, minion\r\n           of the devil or something.\r\n                         \r\n                          EMILY\r\n                          (LAUGHS)\r\n           Oh, that's great - what is this, late-\r\n           night cable?\r\n                         \r\n                          BARRON\r\n           No, but that might be the world they're\r\n           living in.\r\n                         \r\n          INT. CHILDREN'S HOSPITAL - DAY\r\n                         \r\n          Lucy in a hospital bed, dressings on her hand. Emily's\r\n          friend Doug sitting bedside. Child psychologist.\r\n                         \r\n                          DOUG\r\n           -- and what's the most important thing we\r\n           talked about that you have to remember?\r\n           25.\r\n                         \r\n                         \r\n                          LUCY\r\n           It's not my fault what happened.\r\n                         \r\n                          DOUG\r\n           That's right and you know what? It's\r\n           not.\r\n                         \r\n          Lucy nods, not entirely convinced. Doug gives her a pat,\r\n          crosses to the exit. At the door he runs into Emily. Shakes\r\n          his head, awed at what she did.\r\n                         \r\n                          DOUG\r\n           That is some seriously proactive social\r\n           work happenin' there. You all right?\r\n                         \r\n                          EMILY\r\n           Yeah, I'm okay. How's she doing?\r\n                         \r\n                          DOUG\r\n           Typical reaction, blames herself. We'll\r\n           get there. I'm gonna put her in a group\r\n           setting, see if I can get her to open up.\r\n                         \r\n                          EMILY\r\n           Group therapy for kids, what's that say\r\n           about the world?\r\n                         \r\n          He nods - no kidding, heads off. Emily comes over and sits\r\n          on Lucy's bed. Strokes her hair.\r\n                         \r\n                          EMILY\r\n           Good news. You get to leave here\r\n           tomorrow.\r\n                         \r\n                          LUCY\r\n           Doug said I might have to go to a state\r\n           home.\r\n                         \r\n                          EMILY\r\n           Only for a few days, till we find a\r\n           better place.\r\n                         \r\n                          LUCY\r\n           Why can't I live with you?\r\n                         \r\n                          EMILY\r\n           Oh, sweetheart. That would never be\r\n           allowed.\r\n                         \r\n                          LUCY\r\n           Why?\r\n           26.\r\n                         \r\n                         \r\n                          EMILY\r\n           It's complicated, there's a whole\r\n           process, I'm not even a foster parent...\r\n                         \r\n          Lucy gives a sad nod. Emily touches her arm.\r\n                         \r\n                          EMILY\r\n           I'm sorry.\r\n                         \r\n          EXT. STATE CHILDREN'S HOME - DAY\r\n                         \r\n          No frills, purely functional housing. Emily comes up the\r\n          steps with Lucy and knocks. The COORDINATOR answers. A kind\r\n          but beleagured-looking woman of fifty, who is surprised to\r\n          see them.\r\n                         \r\n                          COORDINATOR\r\n           They were supposed to call you. We don't\r\n           have any rooms.\r\n                         \r\n                          EMILY\r\n           Nothing?\r\n                         \r\n                          COORDINATOR\r\n           There was a mixup with the dates. Sorry.\r\n                         \r\n          Emily rolls her eyes. Lucy standing there holding a\r\n          suitcase.\r\n                         \r\n          INT. EMILY'S CAR - DAY\r\n                         \r\n          Through the windshield Lucy watches Emily on a pay phone\r\n          outside a convenience store. Her back is to us but you can\r\n          see she's arguing with someone, scratching addresses off a\r\n          typed list with a ballpoint.\r\n                         \r\n           TIME CUT TO:\r\n                         \r\n          Emily gets in and starts the car, putting on a smile.\r\n                         \r\n                          EMILY\r\n           Hey, are you hungry? Let's get some\r\n           lunch. What kind of food do you like?\r\n                         \r\n                          LUCY\r\n           There's nowhere for me to go is there?\r\n                         \r\n          Heartbreaking. Emily can't lie. She turns off the engine\r\n          and leans back with a sigh. Lucy's silence is a plea for\r\n          rescue.\r\n           27.\r\n                         \r\n                         \r\n                          EMILY\r\n           I can't, Lucy, it wouldn't work, I live\r\n           in this tiny house, I... I'm sorry, I'm\r\n           not mom material...\r\n                         \r\n                          LUCY\r\n           You don't have to be my mom. Just my\r\n           friend.\r\n                         \r\n          A ten-year-old girl stranded at a convenience store, suitcase\r\n          in her lap. Emily stares out the windshield, wrestling with\r\n          her conscience.\r\n                         \r\n          INT. CONFERENCE ROOM - DAY\r\n                         \r\n          At a round table, Emily addresses the CHILD WELFARE PANEL,\r\n          six grave-faced administrators. Wayne is here, offering\r\n          support.\r\n                         \r\n                          EMILY\r\n           I know what it feels like to be that age\r\n           and be unwanted. It's terrifying. She\r\n           needs to be with someone she trusts; she\r\n           trusts me. So much of our time is spent\r\n           negotiating red tape, I think if we just\r\n           look at the situation - this one\r\n           situation, this one child - it's clear\r\n           what's best for her.\r\n                         \r\n          The head of the panel is a bloated bureaucrat in a polka dot\r\n          blouse (NANCY).\r\n                         \r\n                          NANCY\r\n           This is highly irregular and I'll tell\r\n           you right now it makes me very\r\n           uncomfortable. But since, Wayne, you've\r\n           spoken so persuasively on Miss Jennings's\r\n           behalf...\r\n                         \r\n          INT. CORRIDOR OUTSIDE CONFERENCE ROOM - DAY\r\n                         \r\n          Emily comes out and nods yes to Lucy who waits with a\r\n          guardian. As they hug:\r\n                         \r\n           NANCY (V.O.)\r\n           ...I'm going to go against my better\r\n           judgement and approve this petition for\r\n           temporary custody.\r\n                         \r\n          INT. EMILY'S HOUSE - DAY\r\n                         \r\n          Emily walks Lucy through the house, showing her around,\r\n          tidying things self-consciously.\r\n           28.\r\n                         \r\n                         \r\n                          EMILY\r\n           I like to think of it as a glass-half-\r\n           full situation. Kitchen. Bathroom.\r\n           Fish. And here, is your room...\r\n                         \r\n          INT. LUCY'S BEDROOM - DAY\r\n                         \r\n          They stop in the doorway. A small office in which Emily has\r\n          made space for a bureau and a bed. Professional books and\r\n          backup case files pushed aside on a shelf.\r\n                         \r\n                          EMILY\r\n           Be okay?\r\n                         \r\n          Lucy nods yes.\r\n                         \r\n                          LUCY\r\n           Where's your family?\r\n                         \r\n                          EMILY\r\n           My family... well, I've met my dad twice\r\n           and my mom's not a part of my life\r\n           anymore.\r\n                         \r\n                          LUCY\r\n           Why?\r\n                         \r\n                          EMILY\r\n           (choosing her words)\r\n           Sometimes people have kids and then\r\n           decide they don't want to be parents.\r\n                         \r\n          Beneath the measured tone Emily's pain is revealed, raw and\r\n          untouchable, her entire life a rebellion against it. She\r\n          opens Lucy's suitcase on the bed. Pauses, remembering\r\n          something.\r\n                         \r\n                          EMILY\r\n           I'm glad you're here.\r\n                         \r\n          Lucy comes over to help unpack the clothes.\r\n                         \r\n           TIME CUT TO:\r\n                         \r\n          Lucy in bed, sipping a cup of tea as Emily brushes her hair.\r\n                         \r\n                          LUCY\r\n           What's this?\r\n                         \r\n                          EMILY\r\n           Chamomile, when I get stressed out it\r\n           helps me sleep.\r\n           29.\r\n                         \r\n                         \r\n          Lucy nods that it's good. Emily brushes her hair. A natural\r\n          bond between them.\r\n                         \r\n                          EMILY\r\n           None of this ever should have happened,\r\n           if I could make it go away I would.\r\n                         \r\n                          LUCY\r\n           You did.\r\n                         \r\n          Nice moment for Emily. A rare triumph. She tucks Lucy in.\r\n          Turns off the bedside light.\r\n                         \r\n                          EMILY\r\n           I'm right down the hall if you need me.\r\n                         \r\n          Lucy settles. Emily pauses at the door, looks back at the\r\n          lost child she's taken in, then closes the door halfway.\r\n                         \r\n          EXT. SHERIDAN HOUSE - DAY\r\n                         \r\n          Dark, abandoned. Emily's Volvo pulls up.\r\n                         \r\n          INT. EMILY'S CAR - DAY\r\n                         \r\n          She eyes the house. It haunts her, the memory of what\r\n          happened.\r\n                         \r\n          A SUDDEN KNOCK on the window makes her jump out of her seat.\r\n          The guy there gestures a friendly sorry, didn't mean to scare\r\n          you. White shirt and tie. A COURT CLERK.\r\n                         \r\n          EXT. SHERIDAN HOUSE - DAY\r\n                         \r\n          Emily signs a form as he unlocks the door, letting her in.\r\n                         \r\n                          EMILY\r\n           I have to grab some of her things, might\r\n           take me a minute.\r\n                         \r\n                          COURT CLERK\r\n           I trust ya, Em, make sure you lock it on\r\n           the way out.\r\n                         \r\n          INT. SHERIDAN HOUSE - DAY\r\n                         \r\n          Emily closes the door, glances around the dark interior.\r\n          Through a window she sees the Court Clerk drive off. She's\r\n          alone. It's quiet, eerily still.\r\n                         \r\n          She goes up the stairway. Slows, noticing something on the\r\n                         WALL -\r\n           30.\r\n                         \r\n                         \r\n          A FAINT SQUARE where a picture once was hung, the wallpaper a\r\n          half tone darker underneath. More SQUARES farther up. A few\r\n          nails still sticking out.\r\n                         \r\n          INT. LUCY'S BEDROOM, SHERIDAN HOUSE - DAY\r\n                         \r\n          Tattered lace curtains sway in a draft beside a bed with a\r\n          moth-eaten coverlet. Emily packs Lucy's spare clothes into a\r\n          dufflebag. Zips it and walks out.\r\n                         \r\n          INT. UPSTAIRS HALLWAY - DAY\r\n                         \r\n          Exiting Lucy's room, she notes the door to Edward and\r\n          Margaret's bedroom, at the far end of the hall, is slightly\r\n          AJAR. Succumbs to a natural curiosity.\r\n                         \r\n          INT. EDWARD AND MARGARET'S BEDROOM - DAY\r\n                         \r\n          The door pushes open, Emily peering in. A sad little master\r\n          bedroom with old floral printed wallpaper and water stains on\r\n          the ceiling.\r\n                         \r\n          She explores the room, inspecting various personal items -\r\n          aftershave, glasses, hair brush - looking for clues to their\r\n          madness.\r\n                         \r\n          An ALARM CLOCK with a cracked crystal face. She picks it up\r\n          and it GOES OFF in her hand. Gives her a scare. She puts it\r\n          down. Sees something out the bedroom window. Steps closer.\r\n          Parts the curtains.\r\n                         \r\n          In the backyard, by the garden shed, a long rectangular hole\r\n          has been dug. A SHALLOW GRAVE filling with leaves. Edward's\r\n          handiwork. Emily's seen enough, heads for the door.\r\n                         \r\n          But slows, noticing something odd as she comes back around\r\n          the bed -\r\n                         \r\n          A LONG DEEP SCRATCH\r\n                         \r\n          in the wooden floor, hidden under a long runner rug. Emily\r\n          peels back the rug and finds -\r\n                         \r\n          HUNDREDS OF LONG DEEP SCRATCHES\r\n                         \r\n          in the floorboards leading toward the door. Something - the\r\n          old oak bureau perhaps? - has been dragged repeatedly across\r\n          the room.\r\n                         \r\n          Emily comes over and looks behind the door and sees, on the\r\n          back of it, something even more bizarre -\r\n                         \r\n          TWO MASSIVE DEADBOLTS\r\n           31.\r\n                         \r\n                         \r\n          screwed hastily, crookedly, into the wood. She closes the\r\n          door. Slides-to the big heavy bolts -\r\n                         \r\n          CLUNK.\r\n                         \r\n          CLUNK.\r\n                         \r\n          Pauses. Looks again at the bureau. Slides it in front of\r\n          the door, a wheelless caster bracket leaving another long\r\n          scratch in the hardwood. And it's clear at this point what\r\n          the deadbolts and bureau add up to -\r\n                         \r\n                         A BARRICADE\r\n                         \r\n          Emily stares at it. Looks over at Edward and Margaret's bed,\r\n          imagining them here behind this door. Slides the bureau\r\n          aside. Opens the deadbolts. And as the door swings open she\r\n          is looking straight down the hall at\r\n                         \r\n                         LUCY'S BEDROOM\r\n                         \r\n          Emily stares, bewildered.\r\n                         \r\n          INT. GROUP THERAPY ROOM - DAY\r\n                         \r\n          ABUSED CHILDREN aged eight to thirteen sit in a circle of\r\n          folding chairs. Lucy among them. Diego. Doug facilitating.\r\n                         \r\n                          DOUG\r\n           Sometimes when our parents aren't getting\r\n           along it's better if they don't see each\r\n           other for a while, that's what a\r\n           `restraining order' does...\r\n                         \r\n          INT. CORRIDOR OUTSIDE GROUP THERAPY - DAY\r\n                         \r\n          Emily looks in, waiting with other parents. Lucy sees her in\r\n          the window and sneaks her a little wave. Emily smiles and\r\n          holds up a hand that says, hi, hon. It's clear from these\r\n          gestures how close they've gotten.\r\n                         \r\n           TIME CUT TO:\r\n                         \r\n          Emily and Doug walk together after session. Lucy talking to\r\n          other kids her age by the elevator.\r\n                         \r\n                          DOUG\r\n           She's starting to come out of her shell.\r\n           It's good, I just wish I thought it was\r\n           me making the difference.\r\n                         \r\n          Emily accepts the compliment.\r\n           32.\r\n                         \r\n                         \r\n                          EMILY\r\n           I went by the house. I think her mom and\r\n           dad were barricading themselves in their\r\n           room at night. How sick is that?\r\n                         \r\n                          DOUG\r\n           Hatred and fear are part of the same\r\n           pathology - oh, but I forgot, you don't\r\n           think they're crazy.\r\n                         \r\n                          EMILY\r\n           I'm coming around.\r\n                         \r\n          As they part ways...\r\n                         \r\n          INT. EMILY'S CAR - DAY\r\n                         \r\n          Emily pulls up in front of Lucy's school. Big moment for\r\n          Lucy. New clothes. New haircut. New life.\r\n                         \r\n                          EMILY\r\n           Okay?\r\n                         \r\n          Lucy nods, apprehensive, but she's ready to face it. Emily\r\n          hugs her.\r\n                         \r\n                          EMILY\r\n           This is your new beginning.\r\n                         \r\n          Lucy gets out. Pauses on the sidewalk.\r\n                         \r\n                          LUCY\r\n           I love you, Emily.\r\n                         \r\n          Emily, touched, smiles.\r\n                         \r\n                          EMILY\r\n           I love you, too.\r\n                         \r\n          Lucy goes up the walk. Emily watches her safely into the\r\n          building.\r\n                         \r\n          INT. CHILD SERVICES DEPARTMENT - DAY\r\n                         \r\n          Emily draws grim looks as she crosses the common area. A\r\n          pall hanging over the entire department. The first person\r\n          she walks past says:\r\n                         \r\n                          COWORKER\r\n           Wayne's looking for you.\r\n                         \r\n          The second person:\r\n           33.\r\n                         \r\n                         \r\n                          COWORKER #2\r\n           Wayne wants to --\r\n                         \r\n                          EMILY\r\n           Got it.\r\n                         \r\n          She comes past Wayne's office. Empty. A coworker points\r\n          over toward Emily's cubicle - he's there. She goes over.\r\n          Wayne's inside, grave-faced, looking for a file. He finds it\r\n          on the shelf. A photo of eight-year-old DIEGO clipped inside\r\n          the cover. The boy we met earlier.\r\n                         \r\n                          EMILY\r\n           What's up with Diego?\r\n                         \r\n          Wayne hesitates, wanting to spare her the bad news.\r\n                         \r\n                          WAYNE\r\n           Why don't we talk in my office.\r\n                         \r\n                          EMILY\r\n           Tell me what's going on.\r\n                         \r\n                          WAYNE\r\n           We don't know why yet, but... he killed\r\n           his mother and father last night.\r\n                         \r\n          Emily stands there, jaw on the floor.\r\n                         \r\n          EXT. MARTINEZ HOUSE - DAY\r\n                         \r\n          A police perimeter around a small house in a tough low-income\r\n          neighborhood. Cops and crime scene investigators on the\r\n          scene. Local news media broadcasting live. A couple of news\r\n          choppers hovering overhead.\r\n                         \r\n          Emily pulls up, jumps out of her car. Mike Barron waves off\r\n          the uniformed officer who moves to intercept her as she comes\r\n          up the walkway to the house.\r\n                         \r\n                          EMILY\r\n           What happened?\r\n                         \r\n                          BARRON\r\n           Sure you want to see this?\r\n                         \r\n          With an uncertain nod she follows him inside.\r\n                         \r\n          INT. MARTINEZ HOUSE - DAY\r\n                         \r\n          Emily and Mike Barron come along the uncarpeted hallway.\r\n           34.\r\n                         \r\n                         \r\n                          BARRON\r\n           Gets a tire iron from the garage, comes\r\n           back inside, locks all the doors and\r\n           windows, kills them in their sleep...\r\n                         \r\n          The master bedroom. A bloodbath.\r\n                         \r\n                          BARRON\r\n           Had to use dental records to identify the\r\n           bodies.\r\n                         \r\n          Emily looks around, aghast.\r\n                         \r\n                          EMILY\r\n           An eight-year-old did this? There's no\r\n           way.\r\n                         \r\n                          BARRON\r\n           I was there when they brought him in.\r\n           Took three guys my size to subdue him.\r\n           Kid was climbing the walls.\r\n                         \r\n          Barron turns to the window and - WHAM! - AN ATTACK DOG HITS\r\n          THE GLASS RIGHT IN FRONT OF HIS FACE. Barron recoils with a\r\n          yelp. Then, embarrassed, eyes the TRIO OF BATTLE-SCARRED PIT\r\n          BULLS prowling the chainlink-fenced backyard.\r\n                         \r\n                          BARRON\r\n           Just your average American family.\r\n                         \r\n          EXT. MARTINEZ HOUSE - DAY\r\n                         \r\n          Emily and Barron come down the steps.\r\n                         \r\n                          EMILY\r\n           Where is he now?\r\n                         \r\n                          BARRON\r\n           Juvie lockup. And, no, I'm not taking\r\n           you to see him.\r\n                         \r\n                          EMILY\r\n           You want to know what happened?\r\n                         \r\n                          BARRON\r\n           I know what happened.\r\n                         \r\n                          EMILY\r\n           I don't. I need to talk to him. Mike,\r\n           please, I care about this kid.\r\n           35.\r\n                         \r\n                         \r\n          INT. JUVENILE DETENTION CENTER - DAY\r\n                         \r\n          Diego Martinez sitting alone in a holding cell. Confused.\r\n          Scared. He sees Emily approaching and immediately breaks\r\n          down.\r\n                         \r\n                          EMILY\r\n           Diego...\r\n                         \r\n          Emily tells the cop at the cell door:\r\n                         \r\n                          EMILY\r\n           Let me in. He won't hurt me.\r\n                         \r\n          The cop looks at Mike Barron who nods it's okay. The cop\r\n          opens the cell. Emily enters. Diego looks up at her,\r\n          shuddering with emotion:\r\n                         \r\n                          DIEGO\r\n           Are they dead?\r\n                         \r\n          Emily, gutted, nods yes. Diego buries his face in Emily's\r\n          stomach and sobs.\r\n                         \r\n                          EMILY\r\n           What happened? Tell me what happened.\r\n                         \r\n                          DIEGO\r\n                          (SOBBING)\r\n           I killed my mum and dad...\r\n                         \r\n          Emily, devastated, trades looks with Barron through the bars.\r\n                         \r\n          EXT. VENICE PIER - DAY\r\n                         \r\n          Doug tenderly consoles Emily. Has his arms around her.\r\n          They're leaning against the railing, wind on their faces.\r\n                         \r\n                          DOUG\r\n           Every family you sit down with every day\r\n           of every week is a family in crisis.\r\n           Those are your odds. That's the job you\r\n           do. Trying to beat them.\r\n                         \r\n          Wipes away her tears. The hair from her face.\r\n                         \r\n                          DOUG\r\n           You're one person, Em. You can't save\r\n           the world.\r\n                          (THEN)\r\n           I know somebody you did save.\r\n           36.\r\n                         \r\n                         \r\n          Lucy on the beach below, walking barefoot at water's edge,\r\n          hem of her dress in her hands. Emily watches her and,\r\n          finding solace in it, leans into Doug's embrace and closes\r\n          her eyes.\r\n                         \r\n          EXT. BEACH - DAY\r\n                         \r\n          The plaintive cries of seagulls overhead as Emily and Lucy\r\n          walk along the surf at sundown, Emily barefoot now as well.\r\n                         \r\n                          LUCY\r\n           You okay?\r\n                         \r\n          Emily nods, putting on a brave face to spare Lucy.\r\n                         \r\n                          EMILY\r\n           It's just work. Don't worry.\r\n                         \r\n          Lucy nods okay. They walk on in silence for a moment.\r\n                         \r\n                          LUCY\r\n           Why do you do it if it makes you sad?\r\n                         \r\n                          EMILY\r\n           My job? I don't know, I guess... I guess\r\n           maybe I want to believe families can\r\n           work, so I can have my own someday, I\r\n           don't know - does that make sense?\r\n                         \r\n          Lucy nods, takes her hand. They walk off up the beach\r\n          together.\r\n                         \r\n          INT. EMILY'S HOUSE - DAY\r\n                         \r\n          Emily, days later, dressed for work, halves an omelet with a\r\n          spatula and slides the halves onto two plates.\r\n                         \r\n                          EMILY\r\n           (calls to other room)\r\n           Breakfast.\r\n                         \r\n          There's no answer. Emily goes to get her.\r\n                         \r\n          INT. LUCY'S ROOM - DAY\r\n                         \r\n          Stops in the doorway.\r\n                         \r\n                          EMILY\r\n           Honey, breakfa--\r\n                         \r\n          Sees Lucy hide something under her pillow. Emily comes over,\r\n          brow arched, playful.\r\n           37.\r\n                         \r\n                         \r\n                          EMILY\r\n           Come on, let me see...\r\n                         \r\n          Lucy guiltily eyes the floor. Emily lifts the pillow.\r\n          Underneath it is a photograph.\r\n                         \r\n          EMILY, AS A YOUNG GIRL, WITH HER MOTHER.\r\n                         \r\n          She looks at Lucy, then at the filing cabinet from which it\r\n          was taken. More surprised than upset.\r\n                         \r\n                          EMILY\r\n           You went through my things?\r\n                         \r\n                          LUCY\r\n           I'm sorry... I wanted to know what\r\n           happened to you.\r\n                         \r\n          Disarming sincerity. Emily's gaze falls to the photo. Quiet\r\n          moment. She sits down on the bed with it.\r\n                         \r\n                          LUCY\r\n           Is that your mom?\r\n                         \r\n          Emily nods, lost in the image. It's a photo that captures\r\n          her entire childhood. Emily and her mother sitting on the\r\n          steps of a house, together but apart, like a lost child that\r\n          sat down next to a pretty stranger who hasn't yet noticed\r\n          her. Emily's ten-year-old face shows the quiet sadness of\r\n          the disconnect. Reminds you of a child from her caseload.\r\n                         \r\n                          EMILY\r\n           She used to just leave, she'd just...\r\n                          (GESTURES `ADIOS')\r\n           ...and I never knew when she was coming\r\n           back, or if she was... I used to think it\r\n           was my fault and I would try so hard when\r\n           she got home to be good, do everything I\r\n           could think of, so she'd think I was\r\n           `special' and stay next time or take me\r\n           with her, but... it didn't matter, she'd\r\n           always go away again, that's how it was.\r\n                         \r\n          Emily fights her emotions and, practiced at the task, wins.\r\n          Lucy sits beside her on the bed. Understands her deeply.\r\n          Linked by their pasts.\r\n                         \r\n                          LUCY\r\n           Where was your dad?\r\n                         \r\n                          EMILY\r\n           Gone, he left before I was born. First\r\n           time I met him I was like thirteen.\r\n           38.\r\n                         \r\n                         \r\n                          LUCY\r\n           What'd you say to him?\r\n                         \r\n                          EMILY\r\n           Oh, I had all these things I was gonna\r\n           say. Angry things I'd thought of and\r\n           kind of memorized. And um.... And then I\r\n           met him and I wasn't angry, I was just\r\n           sad and I told him...\r\n           (pauses, raw emotion)\r\n           I said, I love you, even if you don't\r\n           love me.\r\n                         \r\n          Emily smiles a pained smile and then buries the memory.\r\n          Lucy, a portrait of contrition:\r\n                         \r\n                          LUCY\r\n           Are you mad at me?\r\n                         \r\n                          EMILY\r\n           No... No, I'm not mad at you.\r\n           (puts her arm around her)\r\n           But I need you not to do that again,\r\n           okay? Go through my private things\r\n           without asking?\r\n                         \r\n          Lucy nods okay. Emily moves on, with a loving touch:\r\n                         \r\n                          EMILY\r\n           Omelet's getting cold. Better hurry.\r\n                         \r\n          Lucy exits. Emily eyes the photo a moment longer then stands\r\n          and puts it away in the filing cabinet. She pauses, feeling\r\n          exposed, and turns the little key to lock the drawers.\r\n                         \r\n          INT. EMILY'S CUBICLE - DAY\r\n                         \r\n          Emily stops at her cubicle, registering a surprise. Wayne\r\n          handing her case files to three COWORKERS. Awkward moment\r\n          for everyone.\r\n                         \r\n                          WAYNE\r\n                          (SYMPATHETIC)\r\n           I need another set of eyes to go over\r\n           them, make sure we haven't missed\r\n           anything else.\r\n                         \r\n                          EMILY\r\n           You mean, to make sure I haven't missed\r\n           anything else?\r\n           39.\r\n                         \r\n                         \r\n                          WAYNE\r\n           It's just a legal thing. You'll have\r\n           them back tomorrow.\r\n                         \r\n          They exit. She goes in and stares at the BARE SHELF above\r\n          her desk. Her caseload gone. More than an insult.\r\n          Everything she cares about.\r\n                         \r\n          A pink phone message on her keyboard. She picks it up: Mike\r\n          Barron called. Important.\r\n                         \r\n          INT. COFFEE HOUSE - DAY\r\n                         \r\n          Newspaper headline: \"INSANITY DEFENSE FOR GLENDALE COUPLE\".\r\n          MUGSHOTS of Edward and Margaret below. The morning edition\r\n          folded on a table between Barron and Emily. They're drinking\r\n          coffee.\r\n                         \r\n                          BARRON\r\n           You watch, six months, their lawyer will\r\n           hire some expert to say they're rehabbed\r\n           and they'll sue for custody when they get\r\n           out.\r\n                         \r\n                          EMILY\r\n           She's not going back there, I'll take her\r\n           out of state before I let them near her\r\n           again.\r\n                         \r\n                          BARRON\r\n           I didn't hear you say that.\r\n                         \r\n          Emily knows she's misspoken, but lets it stand.\r\n                         \r\n                          EMILY\r\n           You wanted to talk about something?\r\n                         \r\n          Barron nods, sips his coffee, a bit uncomfortable.\r\n                         \r\n                          BARRON\r\n           We pulled the Martinezes' phone records.\r\n           They got a call that night before the\r\n           murders.\r\n                         \r\n                          EMILY\r\n           From who?\r\n                         \r\n                          BARRON\r\n                          (SOBER PAUSE)\r\n           Emily, the call came from your house.\r\n                         \r\n                          EMILY\r\n           What...?\r\n           40.\r\n                         \r\n                         \r\n                          BARRON\r\n           Look, I'm not accusing you of anything, I\r\n           just need to know what was said.\r\n                         \r\n                          EMILY\r\n           That's impossible. I might have called\r\n           the week before...?\r\n                         \r\n                          BARRON\r\n           I'm talking to you as a friend here, you\r\n           know that, right?\r\n                         \r\n                          EMILY\r\n           Did you not hear me? I'm telling you,\r\n           Mike, as a friend, I did not call that\r\n           family.\r\n                         \r\n                          BARRON\r\n           Then who did? Go find the guy who broke\r\n           in and just happened to dial the number\r\n           of a kid whose case you handle.\r\n                         \r\n          Emily starts to say something, but stops as a confounding\r\n          realization comes to her. And then to Barron.\r\n                         \r\n          INT. EMILY'S HOUSE - DAY\r\n                         \r\n          Lucy sits on the sofa studying a photo of Diego. Emily sits\r\n          beside her, her advocate. Barron opposite.\r\n                         \r\n                          LUCY\r\n           He's in my group...\r\n           (puts down photo)\r\n           ...why, did something happen?\r\n                         \r\n          Emily nods yes. Barron, gently, mindful of Lucy's age:\r\n                         \r\n                          BARRON\r\n           We're trying to figure out why. He got a\r\n           call Thursday night from this number.\r\n           I'm just wondering if he might have said\r\n           anything...\r\n                         \r\n                          LUCY\r\n           It wasn't me.\r\n                         \r\n                          BARRON\r\n           You didn't call him?\r\n                         \r\n          Lucy shakes her head. Barron nods okay, then, speaking to\r\n          her as a father might his own daughter:\r\n           41.\r\n                         \r\n                         \r\n                          BARRON\r\n           Lucy, it's hard sometimes to tell the\r\n           truth, but I know you will because you're\r\n           a good little girl.\r\n                         \r\n                          LUCY\r\n           I am telling the truth.\r\n                         \r\n                          EMILY\r\n           My backup files are in your room.\r\n           Diego's is in there. Maybe you got\r\n           curious and went through some, dialed a\r\n           number?\r\n                         \r\n                          LUCY\r\n           It wasn't me, I swear.\r\n                         \r\n          Complete innocence. Emily nods okay, wanting to believe, but\r\n          remembering the stolen photograph.\r\n                         \r\n                          BARRON\r\n           The call was at 2 am, are you ever up\r\n           that late?\r\n                         \r\n                          LUCY\r\n           I didn't call him.\r\n                         \r\n                          BARRON\r\n           Are you ever up that late?\r\n                         \r\n                          EMILY\r\n           Mike, she said no. Maybe someone made a\r\n           mistake.\r\n                         \r\n          Barron reads Emily's posture and disengages, stands to go.\r\n                         \r\n                          BARRON\r\n           Yeah, maybe so. Night, Lucy.\r\n                         \r\n          INT. FRONT DOOR, EMILY'S HOUSE - NIGHT\r\n                         \r\n          Exiting, Barron tells Emily as gently as possible:\r\n                         \r\n                          BARRON\r\n           She's lying.\r\n                         \r\n          And goes down the steps. Emily closes the door. Turns\r\n          around and there's Lucy. Uncomfortably close.\r\n                         \r\n                          LUCY\r\n           Do you believe me?\r\n           42.\r\n                         \r\n                         \r\n                          EMILY\r\n           I believe you.\r\n                         \r\n          Lucy hugs her and Emily hugs her back, but she's still\r\n          thinking about what Barron said.\r\n                         \r\n          INT. EMILY'S CUBICLE - DAY\r\n                         \r\n          A PHOTO of Emily and Diego tacked to the corkboard panel\r\n          beside her desk. Emily sits contemplating it. Her gaze goes\r\n          from the photo to the BARE SHELF above her desk. Her\r\n          caseload is still missing. This is bullshit.\r\n                         \r\n          INT. WAYNE'S OFFICE - DAY\r\n                         \r\n          Emily walks in, power pose.\r\n                         \r\n                          EMILY\r\n           Give me back my cases or fire me. Right\r\n           now.\r\n                         \r\n          Wayne, caught unprepared, eating a doughnut.\r\n                         \r\n          INT. EMILY'S OFFICE - DAY\r\n                         \r\n          Caseload restored, Emily is multi-tasking, opening mail,\r\n          sorting backlogged paperwork, talking on the phone:\r\n                         \r\n                          EMILY\r\n           I don't care if it's a hairline fracture,\r\n           he broke her arm, I don't want him back\r\n           in that house. He what? He found\r\n           Christ? When? That recently? Uh huh.\r\n           Well he should have found Him sooner.\r\n                         \r\n          Hangs up. Doug leans in the doorway, drops a manila envelope\r\n          in her in-box. And a computer printout.\r\n                         \r\n                          EMILY\r\n           What's up?\r\n                         \r\n                          DOUG\r\n           Copy of the Sheridans' psych evals for\r\n           the file. And the cognitive profile Lucy\r\n           did for me the other day.\r\n                         \r\n                          EMILY\r\n           (re: Lucy's profile)\r\n           How's it look?\r\n                         \r\n                          DOUG WINTERS\r\n           Normal.\r\n           43.\r\n                         \r\n                         \r\n          But his tone suggests otherwise.\r\n                         \r\n                          EMILY\r\n           Do I have to beg or are you gonna tell me\r\n           what's going on?\r\n                         \r\n                          DOUG\r\n           You have to beg.\r\n                          (SAME BREATH)\r\n           Coming from an environment like that,\r\n           testing this normal is a bit abnormal, if\r\n           that makes any sense.\r\n                         \r\n                          EMILY\r\n           She's `abnormally normal'?\r\n                         \r\n                          DOUG\r\n           I think she faked it, gave the answers\r\n           she thought she should.\r\n                         \r\n                          EMILY\r\n           Why would she do that?\r\n                         \r\n                          DOUG\r\n                          (SHRUGS)\r\n           She's ashamed of who she is. Ashamed of\r\n           how she feels. Afraid nobody would want\r\n           her if they saw the real her.\r\n           (off Emily's reaction)\r\n           It's no big deal, it just means I might\r\n           have to push her a little.\r\n                         \r\n                          EMILY\r\n           No, I know, I just... The Martinezes' got\r\n           a call Thursday night. From my house.\r\n                         \r\n                          DOUG\r\n           Did you ask her about it?\r\n                         \r\n                          EMILY\r\n           She said she didn't. Mike thinks she's\r\n           lying.\r\n                         \r\n                          DOUG\r\n           What do you think?\r\n                         \r\n                          EMILY\r\n           I don't know what to think.\r\n                         \r\n                          DOUG\r\n           Hmm. Bring her in after work, I'll do a\r\n           one-on-one. I wanted to talk to her\r\n           about this anyway.\r\n           44.\r\n                         \r\n                         \r\n          He departs. Emily, alone in her cubicle, scans the test\r\n          results with growing concern.\r\n                         \r\n          INT. JUVENILE DETENTION CELL - DAY\r\n                         \r\n          Diego eating macaroni and cheese from a jailhouse tray.\r\n          Emily sets a folded blanket on the bed as she sits down to\r\n          talk to him.\r\n                         \r\n                          EMILY\r\n           Got you an extra in case it gets cold.\r\n                         \r\n          Diego nods without looking up.\r\n                         \r\n                          EMILY\r\n           I need to ask you something... about the\r\n           night it happened... did you get a call,\r\n           really late?\r\n                         \r\n          Diego stops eating. Stares at his food. Shakes his head no -\r\n          warily, like someone might be listening.\r\n                         \r\n                          EMILY\r\n           You didn't?\r\n                         \r\n          He shakes his head no. Still staring at his food.\r\n                         \r\n                          EMILY\r\n           Diego, I know you did, they called from\r\n           my house.\r\n                         \r\n          Diego puts down his fork, his fear obvious now, his breathing\r\n          quick and shallow.\r\n                         \r\n                          EMILY\r\n           What's the matter? What's scaring you?\r\n                         \r\n          He looks at Emily, terrified, starts HYPERVENTILATING.\r\n                         \r\n                          EMILY\r\n           Oh God...\r\n                         \r\n          Emily tries to calm the panicked boy as he gasps for air, a\r\n          horrible WHEEZING sound in his throat.\r\n                         \r\n                          EMILY\r\n           It's okay... slow breaths... you'll be\r\n           okay...\r\n           (yelling down hall)\r\n           Can somebody help us down here?!\r\n           45.\r\n                         \r\n                         \r\n          INT. INFIRMARY, JUVENILE DETENTION CENTER - DAY\r\n                         \r\n          A little two-bed infirmary with unpainted cinder block walls.\r\n          Diego in bed on an IV drip. Emily talking to a NURSE by the\r\n          check-in desk.\r\n                         \r\n                          NURSE\r\n           He asked to see you before you left.\r\n                         \r\n          Emily comes over to Diego's bed. He holds her gaze in\r\n          silence, a secret he's afraid to tell. Emily speaks at a\r\n          whisper, as if to make the truth less frightening:\r\n                         \r\n                          EMILY\r\n           Who called you? Was it Lucy?\r\n                         \r\n          Diego's PULSE ACCELERATES on the EKG monitor. He gives a\r\n          trembling nod.\r\n                         \r\n                          EMILY\r\n           Did she say something to you? Something\r\n           that scared you?\r\n                         \r\n          Diego replies in Spanish, barely discernible, his throat raw:\r\n                         \r\n                          DIEGO\r\n           El dijo...\r\n                         \r\n                          EMILY\r\n           `El' dijo? What do you mean, `He said'?\r\n                         \r\n          Diego looks at her, confused, terrified. His RACING PULSE a\r\n          jagged green line above the bed.\r\n                         \r\n                          DIEGO\r\n           Era un hombre.\r\n                         \r\n          A chill goes through Emily.\r\n                         \r\n                          EMILY\r\n           It was a man?\r\n                         \r\n          Diego gives another trembling nod. Emily beside him, baffled\r\n          and a bit scared.\r\n                         \r\n          INT. CHILD SERVICES - NIGHT\r\n                         \r\n          After hours, the office is empty, half lit and eerily still.\r\n          Emily is photocopying at a work station, haunted by what\r\n          Diego said, the harsh upward light accentuating her tense\r\n          features.\r\n           46.\r\n                         \r\n                         \r\n          The CYCLICAL SQUEAKING NOISE we hear is Lucy, in Emily's\r\n          cubicle in the b.g., turning herself in circles on the office\r\n          chair. Something very creepy about the disappearance and\r\n          reappearance of that pale watchful face.\r\n                         \r\n          Finished, Emily walks back to her cubicle, thrown by the\r\n          sight of Lucy spinning in the chair, walking head-on into\r\n          that eerie intermittent gaze.\r\n                         \r\n                          LUCY\r\n           Do...\r\n                          (TURNS)\r\n           you...\r\n                          (TURNS)\r\n           like...\r\n                          (TURNS)\r\n           working...\r\n                          (TURNS)\r\n           here?\r\n                         \r\n          Emily, unnerved, enters the cubicle.\r\n                         \r\n                          EMILY\r\n           Well, photocopying isn't much fun.\r\n                         \r\n          Lucy stops turning, stares at her, sensing something.\r\n                         \r\n                          EMILY\r\n           What...?\r\n                         \r\n          Lucy just stares. Doug appears in the doorway.\r\n                         \r\n                          DOUG\r\n           Knock, knock. Sorry I'm late, guys.\r\n                          (TO LUCY)\r\n           Ready, kiddo?\r\n                         \r\n          Lucy nods and gets up from the chair.\r\n                         \r\n                          DOUG\r\n           Go ahead down, I'll be right there.\r\n                         \r\n          Lucy heads down the hall to the conference room.\r\n                         \r\n                          DOUG\r\n                          (TO EMILY)\r\n           You all right?\r\n                         \r\n                          EMILY\r\n           This is weird. Diego said it was Lucy\r\n           that called, but he called her a he, he\r\n           said it was a man.\r\n           47.\r\n                         \r\n                         \r\n          His face - what? Emily nods yes. Doug's brow arches then\r\n          furrows. He turns and heads down the hall.\r\n                         \r\n          INT. CONFERENCE ROOM - NIGHT\r\n                         \r\n          Doug sits opposite Lucy at the table, keeps it easygoing\r\n          despite what he's just been told.\r\n                         \r\n                          DOUG\r\n           So how's school?\r\n                         \r\n                          LUCY\r\n           Fine.\r\n                         \r\n                          DOUG\r\n           Any of your classmates giving you a hard\r\n           time?\r\n                         \r\n                          LUCY\r\n           No, they've been nice.\r\n                         \r\n                          DOUG\r\n           Sleeping okay?\r\n                         \r\n                          LUCY\r\n           That's not really what you want to talk\r\n           about, is it, Doug?\r\n                         \r\n          Awkward pause. Awkward smile.\r\n                         \r\n                          DOUG\r\n           You got me.\r\n                         \r\n          Opens his file. Takes out her cognitive assessment profile.\r\n          Lays it flat on the table.\r\n                         \r\n                          DOUG\r\n           Question 16a, are you afraid of the dark?\r\n           You answered `no'. Question 16b, are you\r\n           afraid of being alone? `No'. 16c, are\r\n           afraid of your parents? `No'. You\r\n           answered `no' to everything in that\r\n           section. I think some of those should\r\n           have been yesses. Everybody is afraid of\r\n           something. Working through our fears,\r\n           conquering them, is how we get better.\r\n           So I want you to tell me... What scares\r\n           you?\r\n                         \r\n          Lucy steeples her fingers and rests her chin on top, regards\r\n          Doug with a look of frank appraisal. It is the face of a\r\n          child, but behind those eyes there is a keen intelligence.\r\n           48.\r\n                         \r\n                         \r\n                          LUCY\r\n           I'll tell you what scares me if you tell\r\n           me what scares you.\r\n                         \r\n          Doug did not see this coming.\r\n                         \r\n                          DOUG\r\n           Fair enough. When I was twelve I was\r\n           climbing a tree and I accidentally put my\r\n           hand through a giant hornets' nest. They\r\n           didn't like it. I got stung over a\r\n           hundred times. They had to rush me to\r\n           the hospital. I've been afraid of\r\n           hornets ever since. Don't climb many\r\n           trees either.\r\n                          (SMILES)\r\n           Everybody has fears. Now, what scares\r\n           you?\r\n                         \r\n                          LUCY\r\n           Me.\r\n                         \r\n          Pause.\r\n                         \r\n                          DOUG\r\n           You scare yourself?\r\n                         \r\n                          LUCY\r\n           Sometimes.\r\n                         \r\n                          DOUG\r\n           Why, what about yourself scares you?\r\n                         \r\n                          LUCY\r\n           I have bad thoughts.\r\n                         \r\n                          DOUG\r\n           About what?\r\n                         \r\n                          LUCY\r\n           People.\r\n                         \r\n                          DOUG\r\n           People in general or certain people?\r\n                         \r\n                          LUCY\r\n           Certain people.\r\n                         \r\n                          DOUG\r\n           Like who?\r\n                         \r\n                          LUCY\r\n           You.\r\n           49.\r\n                         \r\n                         \r\n          Silence.\r\n                         \r\n                          DOUG\r\n           You have bad thoughts about me?\r\n                          (SHE NODS)\r\n           Why?\r\n                         \r\n                          LUCY\r\n                          (SHRUGS)\r\n           I just do.\r\n                         \r\n                          DOUG\r\n           Was there something I said or did that\r\n           upset you?\r\n                         \r\n                          LUCY\r\n           (shakes her head)\r\n           It's just the way you are...\r\n                         \r\n                          DOUG\r\n           How am I?\r\n                         \r\n                          LUCY\r\n           Facile.\r\n                         \r\n                          DOUG\r\n           Facile?\r\n           (she nods yes)\r\n           Do you even know what that means?\r\n                         \r\n                          LUCY\r\n           Easily comprehended. Often lacking\r\n           sincerity or depth. You're smug, too.\r\n           Want me to tell you what that means?\r\n                         \r\n          Dead silence. Doug skewered by a ten-year-old. A boyish\r\n          shyness emerges, a relic from his own youth.\r\n                         \r\n                          DOUG\r\n           Well, if, um, if I seemed `smug' or\r\n           `facile' I want to -\r\n                         \r\n                          LUCY\r\n                          (GIRLISH LAUGH)\r\n           Don't apologize.\r\n                         \r\n                          DOUG\r\n           Why?\r\n                         \r\n                          LUCY\r\n           You're a grown up, it's embarrassing.\r\n                          (THEN; DEADPAN)\r\n                          (MORE)\r\n           50.\r\n                         \r\n                          LUCY(CONT'D)\r\n           Should we talk about school now? My\r\n           grades are getting a lot better.\r\n                         \r\n          Doug just stares at her.\r\n                         \r\n          INT. HALLWAY, CHILD SERVICES DEPARTMENT - NIGHT\r\n                         \r\n          Waiting until Lucy is out of earshot down the hall, Doug\r\n          confers with Emily by the water cooler. He's sweating,\r\n          shaken by the encounter.\r\n                         \r\n                          DOUG\r\n           Talked to a lot of ten-year-olds, I don't\r\n           think I've ever felt like that before...\r\n                         \r\n                          EMILY\r\n           Like what?\r\n                         \r\n                          DOUG\r\n           Threatened.\r\n                          (THEN; BAFFLED)\r\n           I know a specialist, I'll call him in the\r\n           morning.\r\n                         \r\n                          EMILY\r\n           What do I do with her in the meantime?\r\n                         \r\n          Doug pauses, no idea, smiles an eerie smile.\r\n                         \r\n                          DOUG\r\n           Don't let her get in your head.\r\n                         \r\n          Exits. His paranoia feeding Emily's. In the hush she hears\r\n          that faint CYCLICAL SQUEAKING. Looks across the darkened\r\n          office to her cubicle where Lucy is turning circles in her\r\n          chair again.\r\n                         \r\n          That face. That face. That face.\r\n                         \r\n          INT. EMILY'S HOUSE - NIGHT\r\n                         \r\n          Tense dinner. Emily barely touching hers. Lucy, absently,\r\n          but with an almost surgical precision, is CUTTING PEAS IN\r\n          HALF ON HER PLATE AND EATING THEM ONE BY ONE OFF THE TIP OF\r\n          THE KNIFE. Weird. She stops, self-conscious, looks at Emily\r\n          across the table.\r\n                         \r\n                          LUCY\r\n           Are you mad at me?\r\n                         \r\n                          EMILY\r\n           No. Just tired.\r\n           51.\r\n                         \r\n                         \r\n                          LUCY\r\n           Want me to brush your hair?\r\n                         \r\n                          EMILY\r\n           That's okay.\r\n                         \r\n                          LUCY\r\n           Are you sure?\r\n                         \r\n                          EMILY\r\n           Some other time.\r\n                         \r\n                          LUCY\r\n                          (STANDS UP)\r\n           It will make you feel better. I'll get\r\n           the brush.\r\n                         \r\n                          EMILY\r\n           I said no, thank you.\r\n                         \r\n          Lucy stares at Emily for a moment then sits again. And it's\r\n          strange, her posture seems subtly different, stiffer, bonier,\r\n          as if all her muscles have drawn taut under her clothes. In\r\n          a voice at once innocent and menacing:\r\n                         \r\n                          LUCY\r\n           Doug said something, didn't he?\r\n                         \r\n                          EMILY\r\n           No. Doug? He says you're doing great.\r\n                         \r\n          Tense silence.\r\n                         \r\n                          LUCY\r\n           What did he tell you?\r\n                         \r\n                          EMILY\r\n           Nothing.\r\n                         \r\n          Lucy stares at her, seeing through the facade. Then, oddly\r\n          bright, taking a bite of food:\r\n                         \r\n                          LUCY\r\n           You're funny.\r\n                         \r\n          INT. LUCY'S BEDROOM - NIGHT\r\n                         \r\n          EMILY SILHOUETTED in the doorway, keeping her distance as she\r\n                         SAYS GOODNIGHT:\r\n                         \r\n                          EMILY\r\n           Get some rest.\r\n           52.\r\n                         \r\n                         \r\n          She starts to close the door.\r\n                         \r\n                          LUCY\r\n           You forgot to kiss me goodnight.\r\n                         \r\n          A tense pause then Emily walks over and kisses her on the\r\n          forehead.\r\n                         \r\n                          EMILY\r\n           Goodnight.\r\n                         \r\n          Lucy clutches her wrist as she turns to go.\r\n                         \r\n                          LUCY\r\n           I love you.\r\n                         \r\n          Emily, trapped, forces a tender smile.\r\n                         \r\n                          EMILY\r\n           I love you, too.\r\n                         \r\n          Lucy's EYES GLEAM in the darkness. She turns onto her side\r\n          for sleep, but those eyes don't shut even after Emily has\r\n          walked out and closed the door behind her.\r\n                         \r\n          INT. DOUG'S CONDO - NIGHT\r\n                         \r\n          Football highlights on a liquid plasma tv. Doug flipping\r\n          through a DSM IV diagnostic manual. The phone RINGS. He\r\n          picks up, distracted, scanning the DSM index.\r\n                         \r\n                          DOUG\r\n           Hello?\r\n                         \r\n          A strange INTERMITTENT STATIC BUZZ on the line.\r\n                         \r\n                          DOUG\r\n           Hello...?\r\n                         \r\n          BZZZZT. BZZZZT. BZZZZT. A telecommunications glitch.\r\n                         \r\n                          DOUG\r\n           Try again, sorry.\r\n                         \r\n          He hangs up. Finds the chapter he's looking for. ANTI-\r\n          SOCIAL PERSONALITY TYPE. But he hears it again now -\r\n                         \r\n          BZZZZZZZZT BZZZZZZZZZT - louder, deeper - and realizes, in\r\n          quiet terror, that it's coming from INSIDE HIS EAR.\r\n           53.\r\n                         \r\n                         \r\n          INT. DOUG'S BATHROOM - NIGHT\r\n                         \r\n          Doug opens the medicine cabinet and grabs a Q-tip. Wiggles\r\n          it around in his ear and when he takes it out there's a\r\n                         \r\n                         HORNET\r\n                         \r\n          sitting on the cottony tip, scissoring its wings.\r\n                         \r\n          Doug stares in disbelief. Mouth gaping.\r\n                         \r\n          He throws the Q-tip in the toilet. Hits the flush lever.\r\n          Watches the hornet spiral away. Gone.\r\n                         \r\n          Stares at the empty bowl. Did I just imagine that?\r\n                         \r\n          Shaken, he turns to the sink. Wedges his head under the tap\r\n          and runs water into his ear.\r\n                         \r\n          Straightens and looks at himself in the mirror, toweling his\r\n          face, trying to impose rational thought on the situation.\r\n          But as the water spills from his ear, down his neck, onto his\r\n          shirt, it brings with it -\r\n                         \r\n          TWO MORE LIVE HORNETS, half drowned.\r\n                         \r\n          With a yelp Doug swipes them from his shirt. Crushes them\r\n          underfoot. Terrified, but clinging to rational thought a\r\n          moment longer, he turns his head sideways to the mirror,\r\n          parts his hair, and sees -\r\n                         \r\n          ANOTHER HORNET crawl from the ear canal, followed by SIX OR\r\n          SEVEN MORE!\r\n                         \r\n                          DOUG\r\n           FUCK!\r\n                         \r\n          Rationality goes out the window. He flails at them with the\r\n          towel. Swats them dead. Picks them up and drops them in the\r\n          toilet. Studies the last one for a moment. Its little legs\r\n          twitching. Drops it in. Flushes.\r\n                         \r\n          A false respite. And a brief one. Because as the FLUSHING\r\n          NOISE FADES he can hear an ominous DEEP BUZZING SOUND RISING.\r\n                         \r\n          It's coming from behind him. He turns to have a look.\r\n          Nothing there. Bare wall.\r\n                         \r\n          But it's strange: the BUZZING IS STILL BEHIND HIM.\r\n                         \r\n          With dawning horror Doug turns and checks his back in the\r\n          mirror, sees\r\n           54.\r\n                         \r\n                         \r\n          HIS ENTIRE SHIRT BACK IS CRAWLING WITH HORNETS!\r\n                         \r\n          Whimpering like a child, he undoes the buttons of his shirt,\r\n          taking it off as delicately as possible. Slipping his arms\r\n          gently from the sleeves.\r\n                         \r\n          Holding it by the collar, he takes two quick steps and tosses\r\n          it in the shower. Slams the glass door, seals the crack with\r\n          towels. And watches the hornets fly around in the glass\r\n          enclosure, BUZZING FURIOUSLY, bouncing off the glass.\r\n                         \r\n          But as he backpedals he realizes the FURIOUS BUZZING is too\r\n          close, too loud and too deep, to be coming from the shower\r\n          over there. A sharp pain in his head confirms it. He GROANS\r\n          and brings a hand to his ear as something awful happens\r\n          inside.\r\n                         \r\n          The BUZZING in his right ear spreads to his left - LOUDER,\r\n          ANGRIER, its sources multiplying. Disoriented, he stumbles\r\n          backwards with an AGONIZING SCREAM. Catches sight of himself\r\n          in the mirror, the terror of the moment on his face. This\r\n          can't be happening.\r\n                         \r\n          And now the nightmare takes a devilish turn. Looking at\r\n          himself in the mirror, he sees -\r\n                         \r\n          HORNETS START CRAWLING FROM HIS NOSE. FROM BETWEEN HIS LIPS.\r\n          FROM UNDER HIS EYELIDS. THE BUZZING NOW UNBEARABLY LOUD. AN\r\n          ENTIRE SWARM RAGING INSIDE HIS SKULL, FIGHTING ITS WAY OUT!\r\n                         \r\n          Doug grabs his head in both hands and starts shaking it,\r\n          trying to shake away the madness inside. But the hornets\r\n          keep coming, COUGHED UP IN CLUMPS as he gasps for air.\r\n          They're all over him, stinging his tongue, his eyes.\r\n                         \r\n          He goes berserk and starts SMASHING HIS HEAD against the\r\n          wall, the door, the edge of the sink, anything he can find,\r\n          opening a deep gash in his forehead, smashing it harder and\r\n          harder because the BUZZING WON'T STOP, cracking his skull,\r\n          SCREAMING HYSTERICALLY, pitching his head violently forwards\r\n          and backwards like some demon-possessed heavy metal fanatic.\r\n                         \r\n          It's a grotesque display that ends on a sickening note when,\r\n          with one particularly violent head jerk, he snaps his own\r\n          neck - CRACK!!! He sinks to the floor, head askew,\r\n          astonished look on his face.\r\n                         \r\n          And there he sits, paralyzed, eyes locked on the tv in the\r\n          living room where football highlights play in silence. Fully\r\n          conscious as the hornets fight their way back into his ears,\r\n          nose, and mouth - a pilgrimage back to the mind that bore\r\n          them.\r\n           55.\r\n                         \r\n                         \r\n          INT. CORRIDOR OUTSIDE COUNSELING ROOM - DAY\r\n                         \r\n          Emily exits a counseling room. Says goodbye to a young\r\n                         FAMILY -\r\n                         \r\n                          EMILY\r\n           See you next week.\r\n                         \r\n          - and comes down the hall toward the common area. A coworker\r\n          stands from an adjacent cubicle. DENISE.\r\n                         \r\n                          DENISE\r\n           Seen Doug? He had an appointment with\r\n           one of my kids this morning, never showed\r\n           up.\r\n                         \r\n                          EMILY\r\n           Did you try calling him?\r\n                         \r\n                          DENISE\r\n           All I get is voicemail.\r\n                         \r\n          Emily dials Doug on a fax/phone by the Xerox machine. On the\r\n                         FIRST RING:\r\n                         \r\n                          ANSWERING MACHINE\r\n           Hey, this is Doug, here it comes -\r\n                         \r\n          BEEP. She hangs up. A dark thought sends her toward the\r\n          exit, calling back to Denise -\r\n                         \r\n                          EMILY\r\n           Cover my desk.\r\n                         \r\n          EXT. DOUG'S CONDO - DAY\r\n                         \r\n          Emily knocking on the door of his Marina Del Rey townhouse.\r\n                         \r\n                          EMILY\r\n           Doug, it's me, it's Emily...\r\n                         \r\n          No answer.\r\n                         \r\n          She comes down the steps to his car, walks past it and then\r\n          stops, noticing the window is open a crack. Slipping her\r\n          hand inside, stretching, she extends one finger just far\r\n          enough to push the button on the garage door remote clipped\r\n          to the sunvisor.\r\n                         \r\n          Up the drive, the door starts to open.\r\n           56.\r\n                         \r\n                         \r\n          INT. DOUG'S CONDO - DAY\r\n                         \r\n          A door in the first-floor hallway opens. Emily steps in.\r\n                         \r\n                          EMILY\r\n           Doug?\r\n                         \r\n          No answer. She comes up the stairs into the LIVING ROOM.\r\n          The tv is still on. Muted. Calls up the next flight of\r\n          stairs.\r\n                         \r\n                          EMILY\r\n           Doug, you here?\r\n                         \r\n          No reply. She goes up the stairs and down the hall and\r\n          checks the BEDROOM. Empty. The bed unmade. It's when she\r\n          turns from the room to go back downstairs that she sees him:\r\n                         \r\n          SLOUCHED DEAD AGAINST THE BATHROOM WALL, GUT BLOATED BY\r\n          DECOMPOSITION, FACE COVERED IN BLACKENED DAY-OLD BLOOD.\r\n                         \r\n                          EMILY\r\n           NOOOOO!!!!!\r\n                         \r\n          INT. COUNTY CORONER - DAY\r\n                         \r\n          With stoic grief Emily walks down the cold, fluorescently-lit\r\n          corridor, intercepts a CORONER as he exits the exam room.\r\n                         \r\n                          EMILY\r\n           Dr Johannsen?\r\n                         \r\n          He looks at her; pale, bespectacled, a bit standoffish.\r\n                         \r\n                          EMILY\r\n           You did the autopsy on Doug Winters?\r\n                         \r\n                          CORONER\r\n           (trying to remember)\r\n           Winters -- oh, right, Douglas.\r\n                         \r\n                          EMILY\r\n           How did he die?\r\n                         \r\n                          CORONER\r\n           Family?\r\n                         \r\n                          EMILY\r\n           Friend.\r\n           (preempting his reply)\r\n           I know the rules -- please, he meant a\r\n           lot to me.\r\n           57.\r\n                         \r\n                         \r\n          Her face the proof. He indicates his adjoining office. They\r\n          go in.\r\n                         \r\n          INT. CORONER'S OFFICE - DAY\r\n                         \r\n          He takes the autopsy report from a filing cabinet. Reviews\r\n          his findings.\r\n                         \r\n                          CORONER\r\n           Compression fracture of the third and\r\n           forth vertebrae. Severed his spinal\r\n           cord. Actual cause of death was...\r\n           suffocation.\r\n                         \r\n                          EMILY\r\n           You're saying he did that to himself?\r\n                         \r\n                          CORONER\r\n           It appears all his injuries were self-\r\n           inflicted, yes.\r\n                         \r\n                          EMILY\r\n           Oh come on. He looked like he'd been\r\n           beaten to death! Don't tell me he was\r\n           some - some suicidal...\r\n                          (BREAKING DOWN)\r\n           ...I knew him! He was my best friend!\r\n                         \r\n          She turns away crying.\r\n                         \r\n                          CORONER\r\n           Miss, I would never presume to know your\r\n           friend better than you. But the injuries\r\n           suggest he was trying to hurt himself.\r\n           Unfortunately, he succeeded. I am sorry.\r\n                         \r\n          Emily, composing herself, gives a quiet nod. She has no\r\n          quarrel with this man.\r\n                         \r\n                          EMILY\r\n           Have you ever seen this before, somebody\r\n           dying like this?\r\n                         \r\n          The coroner files the report, world weary.\r\n                         \r\n                          CORONER\r\n           Truly, I am shocked every day by the\r\n           violence people do to themselves.\r\n                         \r\n          INT. CEMETERY - DAY\r\n                         \r\n          DOUGLAS J. WINTERS etched in granite. A final prayer read\r\n          by a PRIEST as he is laid to rest.\r\n           58.\r\n                         \r\n          A breeze ruffles the clothes of the MOURNERS. Blows hair\r\n          across Emily's haunted face.\r\n                         \r\n          Lucy, at her side, sees her grief and reaches for her hand.\r\n          Instinctively, Emily retracts it. Lucy registers the slight,\r\n          the wider implications.\r\n                         \r\n          Emily watches the coffin descend. She weeps openly.\r\n                         \r\n          INT. EMILY'S CAR - DAY\r\n                         \r\n          Emily, red-eyed, driving home, sees something in her\r\n          peripheral vision that sends a chill through her.\r\n                         \r\n          Lucy, gazing quietly out the passenger-side window, is\r\n          SWINGING HER LEGS in that contented way children do. A small\r\n          but telling detail. Immediately HER LEGS STOP SWINGING,\r\n          sensing Emily's stare. And with her head still turned away:\r\n                         \r\n                          LUCY\r\n           You think it's my fault, don't you?\r\n                         \r\n          She turns to face Emily, who measures her words.\r\n                         \r\n                          EMILY\r\n           It was an accident. It was nobody's\r\n           fault.\r\n                         \r\n          Lucy holds her gaze. Then, as if to test her, reaches again\r\n          for Emily's hand. Trapped in the lie, Emily has to let her.\r\n          And as she drives on in that private hell, holding hands with\r\n          Lucy...\r\n                         \r\n          INT. MIKE BARRON'S OFFICE - DAY\r\n                         \r\n          Emily, an emotional wreck, confides in Barron.\r\n                         \r\n                          EMILY\r\n           He was scared. He came out of that room\r\n           with her, Mike, and he was scared. He\r\n           said she threatened him.\r\n                         \r\n                          BARRON\r\n           Listen. You're still in shock. Let's\r\n                          NOT --\r\n                         \r\n                          EMILY\r\n           Diego said it was a man on the phone.\r\n           You know who made that call. There was\r\n           no one else in the house.\r\n           (off his look)\r\n           You think I don't know how crazy this\r\n           sounds?!\r\n           59.\r\n                         \r\n                         \r\n                          BARRON\r\n           Look, I don't know, all I'm saying is a\r\n           kid in his state of mind maybe isn't the\r\n           most reliable witness.\r\n                         \r\n                          EMILY\r\n           Why is he in that state of mind? Why was\r\n           Doug? Pull my phone records. See if she\r\n           called him.\r\n                         \r\n                          BARRON\r\n           Emily. I already did. There were no\r\n           calls from your house.\r\n                         \r\n          Emily's argument collapses. She sits there for a moment,\r\n          vexed, her intellect telling her one thing, her gut another.\r\n          She gets up to go. Pauses at the door.\r\n                         \r\n                          EMILY\r\n           Her mother and father, their bedroom door\r\n           has these deadbolts on it, big ones, two\r\n           of `em... Something came through that\r\n           door and they didn't want it ever coming\r\n           through there again.\r\n                         \r\n          INT. EMILY'S CUBICLE - DAY\r\n                         \r\n          Emily digs through her in-box, spilling things on the floor.\r\n          Finds the manila envelope Doug gave her. Rips it open.\r\n          Dumps the contents into her hand.\r\n                         \r\n          A VIDEO TAPE\r\n                         \r\n          Typed on the label: Sheridan, Marg. & Ed., Prelim. Psych\r\n          Interviews.\r\n                         \r\n                          CUT TO:\r\n                         \r\n          ON A TELEVISION - Margaret Sheridan sits facing the camera,\r\n          responding to the questions of an unseen interviewer. Her\r\n          haunted face and frank tone make the interview chilling.\r\n                         \r\n                          INTERVIEWER\r\n           And by forcing your daughter into the\r\n           oven, can you tell me, what did you think\r\n           the outcome would be?\r\n                         \r\n                          MARGARET\r\n           You mean what were we doing it for?\r\n                         \r\n                          INTERVIEWER\r\n           Yes.\r\n           60.\r\n                         \r\n                         \r\n                          MARGARET\r\n           To kill her.\r\n                         \r\n                          INTERVIEWER\r\n           Why?\r\n                         \r\n                          MARGARET\r\n           God's will.\r\n                         \r\n          INT. CONFERENCE ROOM - DAY\r\n                         \r\n          Pulling back, we see Emily alone in a dimmed conference room\r\n          watching the tape.\r\n                         \r\n                          INTERVIEWER\r\n           And why was it God's will that you should\r\n           kill your daughter?\r\n                         \r\n          An eerie smile comes to Margaret's face.\r\n                         \r\n                          INTERVIEWER\r\n           Why is that funny, Margaret?\r\n                         \r\n                          MARGARET\r\n           `Cause she's not my daughter.\r\n                         \r\n                          INTERVIEWER\r\n           You're her mother...?\r\n                         \r\n                          MARGARET\r\n           I bore her, but she's not mine.\r\n                         \r\n                          INTERVIEWER\r\n           Help me understand. If you and Edward\r\n           are Lucy's biological parents, how can\r\n           she not be yours?\r\n                         \r\n                          MARGARET\r\n           `Cause she's not Of us.\r\n                         \r\n                          INTERVIEWER\r\n           Not Of you?\r\n                         \r\n          Margaret nods.\r\n                         \r\n                          INTERVIEWER\r\n           Who is she Of?\r\n                         \r\n                          MARGARET\r\n           Not who, what.\r\n                         \r\n                          INTERVIEWER\r\n           What is she Of?\r\n           61.\r\n                         \r\n                         \r\n                          MARGARET\r\n           Stop acting like you don't know what I'm\r\n           talking about.\r\n                         \r\n          Stares at him. Her eyes black and unblinking.\r\n                         \r\n                          INTERVIEWER\r\n           You think your daughter is the devil?\r\n                         \r\n                          MARGARET\r\n           Not him himself, Of him, working in his\r\n           name, in his honor.\r\n                         \r\n                          INTERVIEWER\r\n           Evil incarnate?\r\n                         \r\n                          MARGARET\r\n           I don't care what you call it.\r\n                         \r\n                          INTERVIEWER\r\n           And why do you think that?\r\n                         \r\n                          MARGARET\r\n           Not what I think it's what I know.\r\n                         \r\n                          INTERVIEWER\r\n           How do you know this? Could you give me\r\n           an example?\r\n                         \r\n          Margaret pauses. Seeming afraid for the first time. Some\r\n          secrets perhaps best left untold.\r\n                         \r\n                          MARGARET\r\n           She can make you see things. Visions.\r\n                         \r\n                          INTERVIEWER\r\n           Visions of what?\r\n                         \r\n                          MARGARET\r\n           Hell. Damnation. Whatever you're afraid\r\n           of.\r\n                         \r\n                          INTERVIEWER\r\n           I see. Any other `special abilities'?\r\n                         \r\n                          MARGARET\r\n           People die around her, is that a special\r\n           ability?\r\n                         \r\n                          INTERVIEWER\r\n           She kills people?\r\n           62.\r\n                         \r\n                         \r\n                          MARGARET\r\n           Not by her hand, they just die. I had\r\n           two brothers, Brent and Travis...\r\n                         \r\n          Margaret's voice falters. Overcome by grief, she dissolves\r\n          into tears. It's a side of her we've never seen. Human.\r\n                         \r\n                          MARGARET\r\n           ...and I mean they was healthy boys,\r\n           healthy as can be. Eddie, three sisters.\r\n           Soon as she was born they started dying.\r\n                         \r\n                          INTERVIEWER\r\n           You blame Lucy for their deaths?\r\n                         \r\n          Margaret nods yes, wiping her eyes. Embarrassed.\r\n          Unaccustomed to crying in front of strangers.\r\n                         \r\n                          INTERVIEWER\r\n           Why do you imagine you were spared?\r\n                         \r\n                          MARGARET\r\n           I guess she couldn't get rid of us till\r\n           she found somebody else. Now that she\r\n           has, I don't imagine we're long for this\r\n           world.\r\n                         \r\n          CLOSE UP ON MARGARET - face streaked with tears, her pain\r\n          deep and undeniable.\r\n                         \r\n                          CUT TO:\r\n                         \r\n          VIDEO OF EDWARD SHERIDAN in a violent rage. Pushing his\r\n          chair back from the interview table, he stands, screaming\r\n          through clenched teeth, his broken jaw wired shut:\r\n                         \r\n                          EDWARD\r\n           THE HELL DID I JUST SAY?!\r\n                         \r\n                          INTERVIEWER\r\n           Edward, please calm --\r\n                         \r\n                          EDWARD\r\n           YOU AND YOUR GODDAMN QUESTIONS! YOU\r\n           DON'T KNOW WHAT YOU'RE TALKING ABOUT!\r\n                         \r\n          A pair of orderlies rush in to restrain him. The CAMERA gets\r\n          knocked ajar in the struggle. The tape ends as they take\r\n          Edward screaming to the floor.\r\n                         \r\n                          EDWARD\r\n           IT'S NOT CHILD KILLING IF SHE'S NOT A\r\n           CHILD!\r\n           63.\r\n                         \r\n                         \r\n          And that's the interview. Emily stares at the BLANK BLUE\r\n          SCREEN, transfixed, lowers her gaze to the table.\r\n                         \r\n          There's a PHOTO tucked inside the psychiatric file. Edward\r\n          and Margaret in happier times - YOUNG BIBLE CAMP COUNSELORS\r\n          in T-shirts and hiking boots on a path through sunlit forest.\r\n          Sweet. Innocent. Emily's age. The year they met perhaps.\r\n                         \r\n          She holds it up to the newspaper mugshots for a before-and-\r\n          after comparison. The transformation of their faces is\r\n          shocking. Emily sits frozen by the realization: Edward and\r\n          Margaret Sheridan. Not criminals. Victims.\r\n                         \r\n          INT. STATE PSYCHIATRIC HOSPITAL - DAY\r\n                         \r\n          An old brick orphanage turned psychiatric hospital. Emily's\r\n          Volvo goes up the winding tree-lined drive.\r\n                         \r\n           CHIEF PSYCHIATRIST (V.O.)\r\n           Unfortunately Mrs Sheridan suffered a\r\n           rather severe psychotic episode last\r\n           night...\r\n                         \r\n          INT. STATE PSYCHIATRIC HOSPITAL - DAY\r\n                         \r\n          Emily and the CHIEF PSYCHIATRIST walk down a dark,\r\n          institutional corridor.\r\n                         \r\n                          CHIEF PSYCHIATRIST\r\n           ...Woke up screaming, absolutely\r\n           convinced she was on fire. She wasn't,\r\n           of course, they managed to sedate her.\r\n           But it's curious, she displays all the\r\n           symptoms of a burn patient. Except the\r\n           burns themselves...\r\n                         \r\n          Margaret's door. Emily peers through a little square of\r\n          reinforced glass. A padded cell. Margaret strapped to a\r\n          bed. Writhing in pain. Laboring to breathe. Eyes swimming.\r\n                         \r\n                          CHIEF PSYCHIATRIST\r\n           In no condition for visitors as you can\r\n           see. If you'd like, I could let you see\r\n           Mr Sheridan?\r\n                         \r\n          Emily hesitates, afraid of him.\r\n                         \r\n                          EMILY\r\n           Okay.\r\n                         \r\n          She casts a departing glance through the window and shudders\r\n          to see that Margaret's roaming eyes have locked on her in a\r\n          hollow stare.\r\n           64.\r\n                         \r\n                         \r\n          INT. VISITATION ROOM, PSYCH HOSPITAL - DAY\r\n                         \r\n          Restrained in a straitjacket, Edward is brought in by two\r\n          orderlies who seat him at a table opposite Emily and then\r\n          exit. Jaw wired, everything he says is spoken through\r\n          clenched teeth.\r\n                         \r\n                          EMILY\r\n           I know I'm probably the last person you\r\n           want to see right now, but you're...\r\n                         \r\n          His stare unnerves her. She stops and collects herself.\r\n                         \r\n                          EMILY\r\n           You're the only one I can talk to.\r\n           Lucy's been staying with me -\r\n                         \r\n                          EDWARD\r\n           Who died?\r\n                         \r\n          Emily falls silent. Her voice cracks with emotion.\r\n                         \r\n                          EMILY\r\n           A friend.\r\n                         \r\n          Edward nods yup. Regards her in silence. Emily speaks, or\r\n          tries to, just to fill that awful void.\r\n                         \r\n                          EMILY\r\n           I, ummm...\r\n                         \r\n                          EDWARD\r\n           You're scared.\r\n                         \r\n          Emily, skewered again, nods yes.\r\n                         \r\n                          EDWARD\r\n           You oughta be.\r\n                         \r\n          Dead silence. She meets his gaze. And there is eye contact,\r\n          true understanding.\r\n                         \r\n                          EDWARD\r\n           You judged us before you ever walked in\r\n           that house. Sat there in our living room\r\n           tellin' us about our problems, how to be\r\n           better parents - certain of everything\r\n           and dead wrong about all of it.\r\n                          (THEN)\r\n           Ask what you came to ask.\r\n                         \r\n          After a moment:\r\n           65.\r\n                         \r\n                         \r\n                          EMILY\r\n           What is she?\r\n                         \r\n          It's a question Edward has asked himself once or twice. He\r\n          leans back in his chair and folds his arms with an almost\r\n          casual air.\r\n                         \r\n                          EDWARD\r\n           Can tell you what she's not. She not a\r\n           daughter of mine. She's not a ten-year-\r\n           old having trouble in school. She's not\r\n           some innocent victim whose door you\r\n           busted down and life you saved. And\r\n           she's not going no place, lady, till\r\n           she's good and done with you.\r\n                         \r\n                          EMILY\r\n           Done with me how?\r\n                         \r\n                          EDWARD\r\n           However she wants. You think it's an\r\n           accident her ending up with you? She saw\r\n           you coming a mile away.\r\n                         \r\n                          EMILY\r\n           Why me? I don't have anything.\r\n                         \r\n                          EDWARD\r\n           You have that you're good. Kindness.\r\n           Decency. That's what she feeds on.\r\n           Bleeds ya dry, moves onto the next. We\r\n           were a big family, she went through us\r\n           like a wrecking ball. And you know,\r\n           every time something happened, every\r\n           time, we had an excuse for why it wasn't\r\n           her fault. Cuz it's easier to lie to\r\n           yourself than think bad things about your\r\n           baby girl. But finally we got to a point\r\n           where me and Maggy looked at each other -\r\n           (remembers so clearly)\r\n           - where we looked at each other and we\r\n           was out of lies, both of us. Most\r\n           terrifying moment of our lives. And\r\n           that's where you are now.\r\n                         \r\n          Emily silently registering this truth.\r\n                         \r\n                          EDWARD\r\n           I'll tell you this. She sees everything.\r\n           And what she doesn't see she just sort of\r\n           senses it, like when you call a friend\r\n           and they pick up before it rings?\r\n                          (MORE)\r\n           66.\r\n                         \r\n                          EDWARD(CONT'D)\r\n           Only time you got the upper hand is when\r\n           she's sleepin' but she almost never does.\r\n           We checked on her every night for three\r\n           months. Every twenty minutes, up and\r\n           down those stairs. First time she slept\r\n           was the night you kicked in my front\r\n           door.\r\n                         \r\n          After a moment:\r\n                         \r\n                          EMILY\r\n           What does she want?\r\n                         \r\n                          EDWARD\r\n           To know... what your idea of hell is...\r\n           and make you live there.\r\n                         \r\n          Emily sits in haunted silence. Edward's features soften.\r\n                         \r\n                          EDWARD\r\n           I'm not a hateful man. I look at you and\r\n           I wish I could tell you you're through\r\n           the worst of it. That it's gonna work\r\n           out for you in the end. I wish I could.\r\n                         \r\n                          EMILY\r\n           What should I do?\r\n                         \r\n          A pitying smile reveals Edward's wired teeth.\r\n                         \r\n                          EDWARD\r\n           How strong's your faith?\r\n                         \r\n          INT. CORRIDOR, CHILD WELFARE - DAY\r\n                         \r\n          NANCY, the bloated director from the custody panel, walking\r\n          briskly down a corridor. Emily calls to her from behind,\r\n          approaching.\r\n                         \r\n                          EMILY\r\n           Nancy...?\r\n                         \r\n                          NANCY\r\n           Emily, I heard about Doug. I'm so sorry.\r\n                         \r\n                          EMILY\r\n                          (NODS)\r\n           Do you have a minute?\r\n                         \r\n          Nancy glances at her watch, nods okay, a minute.\r\n                         \r\n          INT. CHILD WELFARE DIRECTOR'S OFFICE - DAY\r\n                         \r\n          Emily and Nancy enter the lavish office.\r\n           67.\r\n                         \r\n                         \r\n                          NANCY\r\n           How's it working out with the Sheridan\r\n           girl?\r\n                         \r\n                          EMILY\r\n           Actually, that's why I'm here. I\r\n           appreciate what you did for me, Nancy, I\r\n           really do, but I think it'd be best if\r\n           she was placed in foster care.\r\n                         \r\n                          NANCY\r\n           She is. You're it.\r\n                         \r\n                          EMILY\r\n           I know, but it's not working out.\r\n                         \r\n                          NANCY\r\n           Playing mommy isn't the laugh-a-minute\r\n           you were hoping, huh?\r\n                         \r\n                          EMILY\r\n           I suppose not.\r\n                         \r\n          Nancy nods, not entirely surprised.\r\n                         \r\n                          NANCY\r\n           Sorry, you petitioned for custody, you\r\n           got it. She's your responsibility.\r\n                         \r\n                          EMILY\r\n           Until when?\r\n                         \r\n                          NANCY\r\n           Till we find a suitable foster home.\r\n                         \r\n                          EMILY\r\n           How long is that going to take?\r\n                         \r\n                          NANCY\r\n           You're asking me questions you know the\r\n           answer to. Three to six weeks. Surely\r\n           you can manage that long.\r\n                         \r\n                          EMILY\r\n           I don't want her anymore. I'm done.\r\n           That's it.\r\n                         \r\n          Nancy grimaces. Scary lady.\r\n                         \r\n                          NANCY\r\n           Now you look. I put my reputation, quite\r\n           possibly my career, on the line for you.\r\n           Don't embarrass me. You make this work.\r\n           68.\r\n                         \r\n                         \r\n                          EMILY\r\n           How do I make it work if it's not\r\n           working?\r\n                         \r\n                          NANCY\r\n           However! Find a way!\r\n                         \r\n          INT. HARDWARE STORE - DAY\r\n                         \r\n          A CLERK stops in an aisle, hands Emily a DEADBOLT from a\r\n          shelf.\r\n                         \r\n                          HARDWARE CLERK\r\n           That what you're looking for?\r\n                         \r\n                          EMILY\r\n                          (NODS)\r\n           Thanks.\r\n                         \r\n          He walks off. Emily weighs the deadbolt in hand. Puts it\r\n          down and picks up the next larger size. Grabs a second one\r\n          just to be safe. A third for good measure.\r\n                         \r\n          INT. LUCY'S ROOM, EMILY'S HOUSE - DAY\r\n                         \r\n          With urgency Emily removes all her backup files from the\r\n          shelf in Lucy's room. Dropping them in banker's boxes.\r\n          Stops on Diego's. Eyes his photo. Drops it in. Grabs the\r\n          office phone, boxes it with the files.\r\n                         \r\n          INT. EMILY'S HOUSE - DAY\r\n                         \r\n          Emily unplugs the phone in the kitchen. Unplugs the one by\r\n          the sofa.\r\n                         \r\n          Opens the closet and tosses the phones inside with the\r\n          banker's boxes she put there. Closes the door. Locks it.\r\n          Hides the key.\r\n                         \r\n          Just then, a FLASHING RED LIGHT draws her gaze to the window -\r\n                         \r\n          A SCHOOL BUS\r\n                         \r\n          stopping at the end of the block. Emily crosses to the\r\n          window, watching as\r\n                         \r\n                         LUCY\r\n                         \r\n          gets off and comes up the sidewalk toward the house. Sensing\r\n          Emily's stare, she stops and meets it. Waves, testing the\r\n          waters. Emily waves back but it's a hollow gesture. Lucy's\r\n          smile fades, knowing this as she continues toward the house.\r\n           69.\r\n                         \r\n                         \r\n          In a sudden panic Emily goes into the kitchen, grabs one of\r\n          the knives. Eyes the blade, forced to contemplate the\r\n          unthinkable - its use as a weapon, self-defense.\r\n                         \r\n          She comes into the living room, holding it. Catches sight of\r\n          herself in the mirror. A jarring image:\r\n                         \r\n          Sweet Emily Jennings with a butcher's knife in her hand.\r\n                         \r\n          The sound of LUCY'S FOOTSTEPS on the front steps breaks the\r\n          spell.\r\n                         \r\n          Emily hides the knife behind the fish tank. No good, you can\r\n          see it through the glass.\r\n                         \r\n          We hear LUCY'S KEY IN THE LOCK.\r\n                         \r\n          Emily grabs the knife. It's in her hand as the door CLICKS\r\n          open, until the last second when she tosses it under a sofa\r\n          pillow.\r\n                         \r\n          Lucy enters. Shy. Innocent. A ten-year-old home from\r\n          school.\r\n                         \r\n                          LUCY\r\n           Hi.\r\n                         \r\n          Emily returns a plastic smile.\r\n                         \r\n                          EMILY\r\n           Hi.\r\n                         \r\n                          LUCY\r\n           You weren't there so I took the bus.\r\n                         \r\n                          EMILY\r\n           Sorry, work - lost track of time.\r\n                         \r\n                          LUCY\r\n           It's okay, I know how busy you are.\r\n                         \r\n          Emily watches unnerved as Lucy crosses to the sofa, to the\r\n          very pillow where she hid the butcher's knife, and sits down\r\n          to untie her shoes. The point of the knife is almost\r\n          touching her leg. If she moves at all, it will cut the skin.\r\n                         \r\n                          LUCY\r\n           Doesn't matter anyway, the bus stops\r\n           right at the end of the street. So I can\r\n           always get home, whether you're there or\r\n           not.\r\n           70.\r\n                         \r\n                         \r\n                          EMILY\r\n           Lucky.\r\n                         \r\n          Lucy nods then pauses and looks at the pillow, or appears to,\r\n          but she is actually looking at the end table.\r\n                         \r\n                          LUCY\r\n           Where's the phone?\r\n                         \r\n                          EMILY\r\n           Oh, it wasn't working...\r\n                         \r\n          Lucy nods oh. Finishes untying her shoes then gets up and\r\n          walks into the kitchen, checks the wall, turns to Emily.\r\n                         \r\n                          LUCY\r\n           Wow. That one, too.\r\n                         \r\n          Emily, caught in a lie, says nothing.\r\n                         \r\n                          LUCY\r\n           Can I have a shower? We had gym today...\r\n                         \r\n          Emily nods. Lucy heads into the bathroom. Pauses at the\r\n          door, back turned.\r\n                         \r\n                          LUCY\r\n           Are they being nice to her?\r\n                         \r\n                          EMILY\r\n           Who?\r\n                         \r\n                          LUCY\r\n           My mother.\r\n                         \r\n          She turns for Emily's reaction.\r\n                         \r\n                          EMILY\r\n           How - how would I know that?\r\n                         \r\n                          LUCY\r\n           I thought you said you were going to see\r\n           her.\r\n                         \r\n                          EMILY\r\n           I never said that.\r\n                         \r\n          Lucy frowns. A bewilderment that seems genuine.\r\n                         \r\n                          LUCY\r\n           Hm. I must have dreamt it.\r\n                         \r\n          Goes into the bathroom. Closes the door.\r\n           71.\r\n                         \r\n                         \r\n          INT. EMILY'S HOUSE - DAY\r\n                         \r\n          Ear pressed to the bathroom door, Emily listens to the\r\n          RUNNING WATER: Lucy taking a shower.\r\n                         \r\n          She goes to the closet, unlocks it. Grabs one of the phones.\r\n                         \r\n          INT. EMILY'S KITCHEN - DAY\r\n                         \r\n          It sounds like EMILY'S VOICE is coming from the fridge until\r\n          we sweep past it to see her crouching by a phone jack in the\r\n          corner. Whispering.\r\n                         \r\n                          EMILY\r\n           I don't care, Robin, anywhere. Just find\r\n           somewhere that will take her. Tonight.\r\n           I don't want this girl in my house.\r\n                         \r\n          Emily unplugs the phone. And just then hears a SOFT BREATH\r\n          behind her. Oh shit. Slowly turns.\r\n                         \r\n          LUCY IN A BATH ROBE BEHIND HER.\r\n                         \r\n          Hair dripping wet. A chilling stare. How much did she hear?\r\n          Lucy walks out. We hear her bedroom door close.\r\n                         \r\n          Emily crouched in the corner, holding the phone, terrified at\r\n          the thought of what's in store.\r\n                         \r\n          INT. EMILY'S BEDROOM - NIGHT\r\n                         \r\n          THE HEAD OF A TURNING SCREW - Emily installing a DEADBOLT on\r\n          her door in the middle of the night.\r\n                         \r\n          It's the third lock, the other two already in place. Hands\r\n          trembling, she lines up the last screw. It slips from her\r\n          fingers. ROLLS UNDER THE DOOR.\r\n                         \r\n          She cracks opens the door. Reaches to grab it and lets out a\r\n          SHRIEK, recoiling -\r\n                         \r\n                         FEET\r\n                         \r\n          standing just outside her door.\r\n                         \r\n          LUCY, IN PAJAMAS, HOLDING THE SCREW\r\n                         \r\n          She hands it back to Emily, making no overt acknowledgement\r\n          of it.\r\n                         \r\n                          LUCY\r\n           Good night.\r\n           72.\r\n                         \r\n                         \r\n          She walks down the hallway to her bedroom.\r\n                         \r\n          As soon as Lucy's door closes, Emily closes hers and goes\r\n          back to work, doublespeed. Winds that last screw into the\r\n          wood and then slides-to the heavy bolts.\r\n                         \r\n          CLUNK. CLUNK. CLUNK.\r\n                         \r\n          Scooting backwards, she sits against the bed, wide-eyed with\r\n          terror, screwdriver clutched in her fist like a stabbing\r\n          weapon.\r\n                         \r\n          EXT. OLD STONE CHURCH - DAY\r\n                         \r\n          A bell TOLLS in a steeple.\r\n                         \r\n          Down below, Emily is going against the tide, walking up the\r\n          steps past CHURCHGOERS who are coming down after morning\r\n          mass. Halfway up, she runs into Mike Barron and his wife and\r\n          son. It's awkward, more for her than him.\r\n                         \r\n                          BARRON\r\n           Emily...?\r\n                         \r\n                          EMILY\r\n           Mike.\r\n                         \r\n          EXT. CHURCH PARK - DAY\r\n                         \r\n          Sitting on a bench in a park that occupies the shadow of the\r\n          old stone church, Emily and Mike talk privately. His wife\r\n          pushing his young son on a playground swing.\r\n                         \r\n                          EMILY\r\n           `No such thing as a bad kid, only bad\r\n           parents.' I always believed that. It's\r\n           a lie. Her parents aren't crazy.\r\n                         \r\n                          BARRON\r\n           You wanna end up where they did keep\r\n           talking like this.\r\n           (off her look)\r\n           I'm not judging you. You're grieving for\r\n           Doug and you're still confused about what\r\n           Diego did.\r\n                         \r\n                          EMILY\r\n           Aren't you?\r\n                         \r\n                          BARRON\r\n           Diego grew up in a bad home, he saw\r\n           violence and he repeated it, that's the\r\n           cycle, you know that better than anyone.\r\n           73.\r\n                         \r\n                         \r\n                          EMILY\r\n           Why did she lie about calling him?\r\n                         \r\n                          BARRON\r\n           `Cause she's a liar, that doesn't mean\r\n           she made him do it. Look, let me tell\r\n           you what Lucy is. Lucy is a damaged\r\n           child, a deceitful child, a manipulative\r\n           child. But a damaged, deceitful,\r\n           manipulative child is not a demon. Ask\r\n           my brother-in-law, he's got a couple of\r\n           `em.\r\n                         \r\n          Barron stands from the bench.\r\n                         \r\n                          EMILY\r\n           Mike, you know I'm not crazy. Don't run\r\n           away from something just because it\r\n           scares you.\r\n                         \r\n          His concern edges toward sadness. He indicates the church.\r\n                         \r\n                          BARRON\r\n           I stopped you on the steps. I think\r\n           maybe you oughta go all the way in.\r\n                         \r\n          Walks off to rejoin his wife and son. Emily alone on a bench\r\n          in the shadow of a church.\r\n                         \r\n          INT. CORRIDOR OUTSIDE GROUP THERAPY - DAY\r\n                         \r\n          The circle of abused children. Lucy among them, a happy\r\n          participant. Nancy filling in for Doug.\r\n                         \r\n          It's EMILY'S POV - as she spies on Lucy through the window,\r\n          second-guessing herself for a moment.\r\n                         \r\n          Session over, Nancy dismisses the group with a smile and\r\n          theatrical applause.\r\n                         \r\n          Emily watches Lucy cross the room. At the coat rack, she\r\n          whispers something to another girl. The veil of Lucy's hair\r\n          partially obscures her profile, but through that veil Emily\r\n          sees something chilling. For a moment, a moment so fleeting\r\n          it might just be a trick of the eyes -\r\n                         \r\n          LUCY'S LIPS APPEAR THICKER, MORE MASCULINE, SPEAKING CAUSTIC\r\n          WORDS THAT HOLD THE OTHER GIRL CAPTIVE.\r\n                         \r\n          Emily draws a sharp inward breath. Lucy, feeling Emily's\r\n          stare now, turns to meet it. Her SWEET INNOCENT GIRL LIPS\r\n          widening into a smile.\r\n           74.\r\n                         \r\n                         \r\n          But Emily knows what she saw. She throws open the door and\r\n          rushes in.\r\n                         \r\n          INT. GROUP THERAPY ROOM - DAY\r\n                         \r\n          Grabs Lucy by the arm and yanks her bodily from the room.\r\n          This, to the amazement of Nancy, the other children -\r\n                         \r\n          INT. CORRIDOR OUTSIDE GROUP THERAPY - DAY\r\n                         \r\n          - and to the shock of the other PARENTS waiting outside.\r\n          Nancy comes after her in a fury. Runs her down. Erupts.\r\n                         \r\n                          NANCY\r\n           Who do you think you are barging in there\r\n           like that?!\r\n                         \r\n                          EMILY\r\n           I don't want her in group anymore, I\r\n           don't want her around the other kids.\r\n                         \r\n                          NANCY\r\n           Well that's not your decision, is it?!\r\n                         \r\n          Emily opens her mouth to reply, but Lucy beats her to the\r\n          punch.\r\n                         \r\n                          LUCY\r\n           It's okay, Nancy, Emily's been under a\r\n           lot of stress lately, but she's really\r\n           nice to me and I hope I can stay with her\r\n           a really long time.\r\n                         \r\n          Nancy, disarmed by the glowing praise, turns back to Emily.\r\n                         \r\n                          NANCY\r\n           We'll talk about this later.\r\n                         \r\n          Storms off.\r\n                         \r\n                          LUCY\r\n           See you next week, Nancy.\r\n                         \r\n          Nancy doesn't hear, busily reassuring parents, damage\r\n          control. Emily and Lucy arrive at the elevator. Emily hits\r\n          the button.\r\n                         \r\n                          EMILY\r\n           You're never going back there.\r\n                         \r\n                          LUCY\r\n           Why, Emily?\r\n           75.\r\n                         \r\n                         \r\n          Emily says nothing. Lucy keeps asking the same question, in\r\n          the exact same intonation, as Emily ignores her:\r\n                         \r\n                          LUCY\r\n           Why, Emily? Why, Emily? Why, Emily?\r\n                         \r\n          DING. The doors open.\r\n                         \r\n          INT. ELEVATOR - DAY\r\n                         \r\n          Emily and Lucy step in. The door closes. Lucy continuing\r\n          her verbal assault as they start to descend:\r\n                         \r\n                          LUCY\r\n           Why, Emily? Why, Emily?\r\n                         \r\n          Suddenly the ELEVATOR LURCHES TO A VIOLENT STOP. It buckles\r\n          Emily's knees. She is terrified, practically\r\n          hyperventilating.\r\n                         \r\n                          EMILY\r\n           W-w-what's happening - ?!\r\n                         \r\n          Lucy has gotten her attention.\r\n                         \r\n                          LUCY\r\n           Can I go back to group next week?\r\n                         \r\n                          EMILY\r\n           You're never going back there!\r\n                         \r\n          Lucy looks at her as one regards a small dumb animal. Then\r\n          looks up at the ceiling.\r\n                         \r\n                          LUCY\r\n           Are you sure?\r\n                         \r\n          Horror as Emily realizes what she's thinking. We hear the\r\n          first CABLE SNAP above them. In the CREAKING HUSH that\r\n                         FOLLOWS:\r\n                         \r\n                          EMILY\r\n           No...\r\n                         \r\n          The second CABLE SNAPS. The elevator goes into a HELLISH\r\n          FREE FALL.\r\n                         \r\n          The acceleration is dizzying.\r\n                         \r\n          Emily clutches the rail with both hands, SCREAMING as the\r\n          elevator goes cannonballing down the shaft. Lucy indifferent\r\n          as they plummet toward certain death.\r\n           76.\r\n                         \r\n                         \r\n          The floor indicator light races toward L, the car shuddering\r\n          violently, the noise deafening. It's a horrible way to die.\r\n                         \r\n          Emily closes her eyes in anticipation of impact. And in the\r\n          sudden BLACKNESS there's no noise at all. Just a soft,\r\n                         DISTINCT\r\n                         \r\n          DING.\r\n                         \r\n          A breathless pause then Emily opens her eyes. And sees the\r\n          elevator is no longer falling. Never was. The doors glide\r\n          open to the first floor lobby.\r\n                         \r\n          Lucy gives her a quiet look and strolls out. A businessman\r\n          steps into the elevator, watching bewildered as Emily\r\n          releases her white-knuckled grip on the railing and staggers\r\n          out, so badly shaken she can barely stand...\r\n                         \r\n          INT. EMILY'S HOUSE - NIGHT\r\n                         \r\n          Fish swim languidly in the tank. It's after midnight. We're\r\n          looking down the darkened hall at Emily's closed bedroom\r\n          door.\r\n                         \r\n          INT. EMILY'S BEDROOM - NIGHT\r\n                         \r\n          Emily, in a coat and shoes, packing a suitcase. Snaps it\r\n          quietly shut. Looks over at the barricaded door. Draws a\r\n          tense breath.\r\n                         \r\n          INT. HALLWAY - NIGHT\r\n                         \r\n          From down the hall we hear the DEADBOLTS SLIDE QUIETLY OPEN.\r\n                         \r\n          The door opens a crack.\r\n                         \r\n          EMILY'S TERRIFIED FACE peers out. Making sure the hall is\r\n          empty.\r\n                         \r\n          She steps out, suitcase in hand.\r\n                         \r\n          Tiptoes down the hall. Quietly as possible as she comes past\r\n          Lucy's door. It's open a crack. The room pitch black\r\n          inside. Emily steps closer, breath held. Peers in through\r\n          the little crack. Sees -\r\n                         \r\n          LUCY ASLEEP IN BED.\r\n                         \r\n          But suddenly her EYES SNAP OPEN. Her face horizontal on the\r\n          pillow.\r\n                         \r\n                          LUCY\r\n           I can see you.\r\n           77.\r\n                         \r\n                         \r\n          Emily backs away. Goes quickly to the front door.\r\n                         \r\n          INT. EMILY'S CAR - NIGHT\r\n                         \r\n          Emily throws the suitcase in the trunk. Slams it shut.\r\n          Comes around to the driver's side door. Jumps in. Closes\r\n          the door. And gets the scare of her life.\r\n                         \r\n          LUCY IS SITTING IN THE PASSENGER SEAT!\r\n                         \r\n          Emily recoils with a SCREAM, throwing her body against the\r\n          window behind her. Lucy sits there, silent, betrayed.\r\n                         \r\n          It's too much for Emily. She breaks down. Buries her face\r\n          in her hands and sobs.\r\n                         \r\n          Lucy, after a moment, takes a brush from Emily's bag and\r\n          starts lovingly brushing her hair.\r\n                         \r\n          Emily slowly lifts her head, resigning herself to this latest\r\n          horror. She sits zombie-like behind the wheel, tears\r\n          streaming as Lucy tugs gently at the snarls, playing mommy.\r\n                         \r\n                          LUCY\r\n           Don't be sad. This is your new\r\n           beginning.\r\n                         \r\n          INT. EMILY'S CUBICLE - DAY\r\n                         \r\n          Unopened mail and new case files piling up. Emily looks\r\n          terrible, phone to ear, getting SCREAMED at, sworn at,\r\n          interrupted every time she tries to speak.\r\n                         \r\n                          EMILY\r\n           Mrs Lynch, I told you - will you let -\r\n           that's not what I said - no, I did not -\r\n           you never sent me the - Mrs Lynch - will\r\n           you let me respond? - will you let me -\r\n           Mrs Lynch - will you let -\r\n                         \r\n          Emily can't take it anymore. She unloads.\r\n                         \r\n                          EMILY\r\n           SHUT THE FUCK UP YOU MISERABLE MISERABLE\r\n           WOMAN BEFORE I GET IN MY CAR AND COME\r\n           OVER THERE AND BEAT YOUR ASS LIKE YOU\r\n           BEAT YOUR SON! I HAVE YOUR ADDRESS!\r\n           THINK ABOUT THAT NEXT TIME YOU CALL AND\r\n           SWEAR AT ME! I KNOW WHERE YOU LIVE!\r\n                         \r\n          Slams the phone down. Sits there looking rather dazed.\r\n          Wayne arrives, dazed in a different way, having overheard.\r\n           78.\r\n                         \r\n                         \r\n                          WAYNE\r\n           Um, so, I notice you haven't taken any\r\n           personal days. Come on, you look like\r\n           crap, go home.\r\n                         \r\n          Emily levels a withering stare.\r\n                         \r\n                          EMILY\r\n           I don't want to go home.\r\n                         \r\n          EXT. LOS ANGELES APARTMENT BUILDING - DAY\r\n                         \r\n          Emily knocking on a door in an outside hallway. It opens.\r\n          It's the girl from the bar. BECCA. The friend. Not\r\n          expecting her.\r\n                         \r\n                          BECCA\r\n           Emily...\r\n                         \r\n          INT. BECCA'S APARTMENT - DAY\r\n                         \r\n          Emily, disheveled, five days without sleep, doing her best to\r\n          appear rational.\r\n                         \r\n                          EMILY\r\n           I know I haven't been a great friend\r\n           lately, but... do you think maybe I could\r\n           crash here for a couple of nights?\r\n                         \r\n                          BECCA\r\n           Sure, when?\r\n                         \r\n                          EMILY\r\n           Tonight and tomorrow.\r\n                         \r\n          Becca draws air through her teeth, pained by her predicament.\r\n                         \r\n                          BECCA\r\n           Em, any other weekend you know I'd say\r\n           yes, but I just met this guy and he's\r\n           coming over tonight like for the night\r\n           and it might be, you know, kinda weird.\r\n                         \r\n          Emily nods. And there's nothing more to be said.\r\n                         \r\n          INT. EMILY'S ROOM - NIGHT\r\n                         \r\n          Stormy night. Heavy rain. High winds. The trees, thrashing\r\n          outside the window, backlit by a streetlight, cast OMINOUS\r\n          SHADOWS on the walls of the bedroom.\r\n                         \r\n          Emily huddles in the corner, wrapped in a blanket, clutching\r\n          the screwdriver.\r\n           79.\r\n                         \r\n                         \r\n          There is a KNOCK on the bedroom door. Emily's EYES JERK WIDE\r\n          OPEN. She looks at the door, but doesn't answer.\r\n                         \r\n          After a moment, Lucy's voice, innocent, afraid -\r\n                         \r\n           LUCY (O.S.)\r\n           Emily...? Can I come in? I'm scared...\r\n                         \r\n          Emily says nothing. Heart racing. There's another KNOCK. A\r\n          little louder.\r\n                         \r\n           LUCY (O.S.)\r\n           Emily? Please? I know you're in there,\r\n           please...?\r\n                         \r\n          Emily says nothing. Lucy starts pounding on the door.\r\n                         \r\n           LUCY (O.S.)\r\n           Please, Emily...\r\n                         \r\n          SILENCE.\r\n                         \r\n          Emily listening, barely breathing. Is that it? Is she gone?\r\n                         \r\n          And then suddenly - WHAM! - WHAM! - WHAM! - the pounding\r\n          turns VIOLENT, practically shaking the door off its hinges.\r\n          Far too violent for a little girl.\r\n                         \r\n          Emily wedges herself into the corner, absolutely petrified.\r\n          There is something very strong and very angry on the other\r\n          side of that door, SHRIEKING in the voice of a child -\r\n                         \r\n           LUCY (O.S.)\r\n           LET ME IN!\r\n                         \r\n          WHAM - WHAM - WHAM - WHAM - WHAM - WHAM!\r\n                         \r\n           LUCY (O.S.)\r\n           LET ME IN!\r\n                         \r\n          WHAM - WHAM - WHAM - WHAM - WHAM - WHAM! The door getting\r\n          absolutely pummeled, looking like it might splinter from the\r\n          force. And it's so intense that it's almost surreal what\r\n          Emily is seeing. Lucy's voice eerily monotone, the words\r\n          coming inhumanly fast like some auctioneer from hell -\r\n                         \r\n           LUCY (O.S.)\r\n           Let me in, let me in, let me in, let me\r\n           in, let me in, let me in, let me in, let\r\n           me in, let me in, let me in...\r\n           80.\r\n                         \r\n                         \r\n          Relentless. Tormenting Emily. Until she can't take it\r\n          anymore. And she SCREAMS as loud as she can, half cursing,\r\n          half begging, the veins standing out in her neck -\r\n                         \r\n                          EMILY\r\n           LEAVE ME ALONE!!!\r\n                         \r\n          And the POUNDING STOPS DEAD. All we hear is the rain\r\n          drumming on the roof. And Emily's QUICK TERRIFIED BREATHS as\r\n          she stares at the door wondering what's next.\r\n                         \r\n          But there's nothing. Just the shadows dancing on the walls.\r\n          It appears the nightmare is over for now.\r\n                         \r\n          But not quite.\r\n                         \r\n          A sudden CLUNK in the closet makes her jump. Her head snaps\r\n          around - what was that? She just stares, unable to breathe\r\n          because whatever she just heard is INSIDE HER ROOM!\r\n                         \r\n          White-knuckled grip on that screwdriver, Emily stands up and\r\n          comes slowly over to the CLOSET DOOR.\r\n                         \r\n          Raises the screwdriver. Ready to stab.\r\n                         \r\n          Takes hold of the door handle.\r\n                         \r\n          Slowly turns it.\r\n                         \r\n          Opens the door.\r\n                         \r\n          PITCH BLACK inside.\r\n                         \r\n          A tense pause as she stares into that blackness, then reaches\r\n          a hand into the closet, feeling around for the pull-string.\r\n          Finds it. Gives it a tug. And there, right in front of her,\r\n          is a vision of unspeakable horror:\r\n                         \r\n                         MARGARET SHERIDAN\r\n                         \r\n          Twitching spasmodically in a hospital gown. HIDEOUSLY\r\n          BURNED.\r\n                         \r\n          She comes at Emily arms flailing, clumsy with rage and\r\n          dementia. Emily leaps aside and Margaret goes careening into\r\n          the furniture, howling and spinning like some crazed Whirling\r\n          Dervish.\r\n                         \r\n          Emily scrambles over the bed. Reaches the door. Fumbles at\r\n          the deadbolt. Here comes Margaret. At the last second Emily\r\n          gets the door open. Runs out.\r\n           81.\r\n                         \r\n                         \r\n          INT. HALLWAY - NIGHT\r\n                         \r\n          Tears a path down the dark hallway. Margaret right behind\r\n          her, hideous, reeling, hitting the walls with her flailing\r\n          arms.\r\n                         \r\n          Emily throws open the front door.\r\n                         \r\n          EXT. EMILY'S HOUSE - NIGHT\r\n                         \r\n          Dashes from the house into the abandoned street. Running in\r\n          the rain. Margaret comes crashing out of the house, chasing\r\n          her down the middle of the street.\r\n                         \r\n          Emily sees a city bus parked up ahead. Makes a run for it.\r\n                         \r\n          EXT. METRO BUS - NIGHT\r\n                         \r\n          A metro transit bus idling along the curb. The DRIVER with\r\n          his feet up between shifts, reading a porno mag. Emily comes\r\n          running up to the door. Pounds frantically on the glass.\r\n                         \r\n                          EMILY\r\n           Help me! Please!\r\n                         \r\n          The driver meets eyes with her through the door. Keeps\r\n          reading. Unimpressed. More pounding from Emily.\r\n                         \r\n                          EMILY\r\n           Let me on!\r\n                         \r\n          The driver points to the sign above the door: OUT OF SERVICE.\r\n          Keeps reading. Emily near hysterics at this point. Margaret\r\n          closing in fast.\r\n                         \r\n                          EMILY\r\n           She's coming! Please!\r\n                         \r\n          The driver sighs, weighing his obligations. Emily spins,\r\n          back to the door. Margaret nearly upon her, ten feet away,\r\n          five, four...\r\n                         \r\n          INT. METRO BUS - NIGHT\r\n                         \r\n          The driver opens the door. Emily dives backwards onto the\r\n          bus, the door snapping closed in front of her just as\r\n          Margaret lunges for her throat.\r\n                         \r\n                          EMILY\r\n           Drive!\r\n                         \r\n                          BUS DRIVER\r\n           There's nobody out there.\r\n           82.\r\n                         \r\n                         \r\n                          EMILY\r\n           DRIVE!\r\n                         \r\n                          BUS DRIVER\r\n           There - is - nobody - out - there!\r\n                         \r\n          It sinks in the second time. Emily scans the sidewalk, the\r\n          darkened streets outside the bus. Margaret is gone. Was\r\n          never there. The driver opens the door, nods to her - out.\r\n                         \r\n          EXT. METRO BUS - NIGHT\r\n                         \r\n          With a hydraulic HISS the bus releases its brakes and diesels\r\n          off down the empty street. Emily stands alone. Rain-soaked.\r\n          Shivering. Staring at her house down the block.\r\n                         \r\n          The SILHOUETTE OF A CHILD in the window.\r\n                         \r\n          INT. CHILD SERVICES DEPARTMENT - NIGHT\r\n                         \r\n          Wayne and his BOYFRIEND shake rain off an umbrella as they\r\n          cross the darkened office.\r\n                         \r\n                          BOYFRIEND\r\n           (re: the office space)\r\n           No, I like it. It's like those things\r\n           they put baby cows in to make veal -\r\n                         \r\n          The boyfriend slows as they go past a cubicle. Saw something\r\n          weird.\r\n                         \r\n                          WAYNE\r\n           What?\r\n                         \r\n          He points. Freaked. Wayne comes over, pokes his head in a\r\n          cubicle.\r\n                         \r\n                         EMILY\r\n                         \r\n          head down on her desk, rain-soaked, sleeping in her chair.\r\n                         \r\n                          WAYNE\r\n           Em...?\r\n                         \r\n          No reply. Wayne's face darkens. Is she dead? He comes\r\n          over, puts his hand on her shoulder.\r\n                         \r\n                          WAYNE\r\n           Emily...?\r\n                         \r\n          She awakens with a jolt. Expecting to see Margaret. She\r\n          looks terrible.\r\n           83.\r\n                         \r\n                         \r\n                          WAYNE\r\n           Jesus - are you okay?\r\n                         \r\n                          EMILY\r\n                          (HOARSE WHISPER)\r\n           I... I had some things to catch up on...\r\n                         \r\n          She fumbles unconvincingly at some loose paperwork.\r\n                         \r\n                          WAYNE\r\n           You look like shit, you need to see a\r\n           doctor.\r\n                         \r\n                          EMILY\r\n           I saw a doctor.\r\n                         \r\n                          WAYNE\r\n           What did they say?\r\n                         \r\n                          EMILY\r\n                          (LOSES IT)\r\n           They said mind your own fucking business!\r\n                         \r\n          Shocked by the outburst, by her general appearance, he walks\r\n          away, muttering to his boyfriend. Emily puts her head in her\r\n          hands, pressing down at her temples. Wayne steps into his\r\n          office in the b.g. and grabs something then they exit.\r\n                         \r\n          And the office is quiet again. Emily closes her eyes. Just\r\n          then, she hears -\r\n                         \r\n          A faint CYCLICAL SQUEAKING NOISE in the cubicle right next to\r\n          hers. Goes rigid. Recognizes the sound. Calls over the\r\n          partition without moving.\r\n                         \r\n                          EMILY\r\n           Wayne...?\r\n                         \r\n          No reply, but the SQUEAKING CONTINUES. Rising slowly from\r\n          her seat, scared as hell, she leans over her desk and peers\r\n          over the partition into the adjacent cubicle.\r\n                         \r\n          It's empty. But the OFFICE CHAIR IS TURNING as if someone\r\n          were just playing there.\r\n                         \r\n          Emily steps slowly back. And now hears the same CYCLICAL\r\n          SQUEAKING behind her. The opposite row. She spins.\r\n                         \r\n          EXT. CHILD SERVICES DEPARTMENT - NIGHT\r\n                         \r\n          Walks slowly from her cubicle. Comes along the row of\r\n          darkened cubicles, following the sound to its source. This\r\n          is the one. She looks in.\r\n           84.\r\n                         \r\n                         \r\n          Empty cubicle. TURNING CHAIR.\r\n                         \r\n          Emily backs away. Terrified. The chair winding slowly to a\r\n          stop.\r\n                         \r\n          Suddenly, behind her, at the far end of the office, a\r\n          different NOISE splits the silence. Emily turns and stares\r\n          toward the sound. The XEROX MACHINE. Someone is using it.\r\n                         \r\n                          EMILY\r\n           Hello...?\r\n                         \r\n          No answer.\r\n                         \r\n          Emily comes slowly down the aisle to the partitioned\r\n          workstation. A torturous walk set to the RHYTHMIC CADENCE of\r\n          the photocopier, the HARSH GREEN LIGHT SWEEPING ACROSS THE\r\n          CEILING ABOVE IT, again and again and again...\r\n                         \r\n          And then it stops, ejecting one final page as Emily enters\r\n          the workstation. And sees there's no one there.\r\n                         \r\n          She stares at the idle machine for a moment, then at the\r\n          STACK OF COPIES lying upsidedown in the tray. She comes\r\n          over, picks them up. Turns them over.\r\n                         \r\n          The first page is a photocopy of a PAIR OF HANDS PRESSED FLAT\r\n          AGAINST THE COPYING GLASS.\r\n                         \r\n          Emily stares, haunted. Tense breath. Continues through the\r\n          stack.\r\n                         \r\n          Successive pages show the same two hands, but leaning forward\r\n          into the inky blackness between them is a FACE, its features\r\n          resolving into murky focus as it approaches the glass. The\r\n          last page is a horrific image. A man screaming in such\r\n          terror that his face appears almost deformed.\r\n                         \r\n          It's DOUG. The night of his death. Like a snapshot from his\r\n          bathroom mirror.\r\n                         \r\n          Emily shudders, the stack of pages tumbling to the floor.\r\n          Runs out. And we see the photocopies, lying on the floor,\r\n          are totally BLANK...\r\n                         \r\n          INT. CORRIDOR, CHILD SERVICES BUILDING - NIGHT\r\n                         \r\n          Emily, leaving, rushes down a corridor toward the lobby.\r\n          Tense. Head on a swivel. Hears MORE SQUEAKING behind her.\r\n          Spins.\r\n                         \r\n          A NIGHT JANITOR WHEELING A MOP BUCKET\r\n           85.\r\n                         \r\n                         \r\n          She walks on. Turns the corner and RUNS INTO SOMEONE\r\n          UNEXPECTED. Jumps back with a SHRIEK before she realizes who\r\n          it is.\r\n                         \r\n                          EMILY\r\n           Robin...\r\n                         \r\n          A ponytailed woman in her mid-forties, the child placement\r\n          specialist Emily called from home.\r\n                         \r\n                          ROBIN\r\n           What are you doing here so late? I tried\r\n           calling you. I found someone to take\r\n           Lucy.\r\n                         \r\n                          EMILY\r\n                          (STUNNED RELIEF)\r\n           You did?\r\n                         \r\n                          ROBIN\r\n           Anaheim couple. They've helped us out\r\n           before.\r\n                         \r\n          She shows Emily a custody form with an attached photo:\r\n                         \r\n          A KIND HUSBAND AND WIFE WITH TWO YOUNG CHILDREN.\r\n                         \r\n          Emily's face darkens.\r\n                         \r\n                          EMILY\r\n           (under her breath)\r\n           Oh God...\r\n                         \r\n                          ROBIN\r\n           What's the matter?\r\n                         \r\n          Emily stares at the unsuspecting family. Lucy's next\r\n          victims. She fends off a wave of emotion as the full horror\r\n          of her predicament hits her. Then, matter-of-factly, facing\r\n          that fear head-on:\r\n                         \r\n                          EMILY\r\n           I can't. I'm keeping her.\r\n                         \r\n          As Emily walks off, ripping the custody form to shreds, Robin\r\n          utterly confused...\r\n                         \r\n          INT. STATE PSYCHIATRIC HOSPITAL - DAY\r\n                         \r\n          Emily sits opposite Edward Sheridan in the visiting room, an\r\n          odd sense of camaraderie between them.\r\n           86.\r\n                         \r\n                         \r\n                          EMILY\r\n           If I get rid of her, if I put her into\r\n           the system...\r\n                         \r\n                          EDWARD\r\n                          (NODS YUP)\r\n           She starts all over again somewhere else.\r\n           Can't let her stay, can't let her go.\r\n           That leaves you with one option.\r\n                         \r\n          Eye contact. Emily looks away, shakes her head.\r\n                         \r\n                          EMILY\r\n           I can't, Edward, I --\r\n                         \r\n                          EDWARD\r\n           You have to. You have to find the\r\n           strength. Don't you understand? That's\r\n           why she's doing this. To test you. Test\r\n           your faith.\r\n                         \r\n                          EMILY\r\n           I don't have any faith.\r\n                         \r\n                          EDWARD\r\n           How `bout anger. Got some of that?\r\n                         \r\n          Emily lowers her gaze to the table.\r\n                         \r\n                          EMILY\r\n           How... how do I...?\r\n                         \r\n                          EDWARD\r\n           Kill her? In her sleep, assuming you\r\n           can...\r\n                          (THEN; THINKING)\r\n           Tell you what I'd do different. Count\r\n           myself dead at the outset. Accept that\r\n           going in and use it to my advantage.\r\n           That's the one thing I don't think she'd\r\n           see coming, someone giving up their own\r\n           life to take hers.\r\n                         \r\n          As Emily registers this...\r\n                         \r\n          INT. EMILY'S HOUSE - NIGHT\r\n                         \r\n          Middle of the night, the living room is lit by the eerie glow\r\n          of the fish tank. The filter humming. The fish swimming\r\n          languidly. Suddenly they DISPERSE, spooked by something\r\n          outside the tank.\r\n           87.\r\n                         \r\n                         \r\n          INT. EMILY'S BEDROOM - NIGHT\r\n                         \r\n          The bureau has been pushed in front of the deadbolted door to\r\n          form a barricade. Emily lies in a fetal position on her bed,\r\n          exhausted but unable to sleep.\r\n                         \r\n          She tenses at the sound of a MUFFLED MALE VOICE in the other\r\n          room. Comes over to the door, trying to listen. Thinks she\r\n          recognizes it.\r\n                         \r\n                          EMILY\r\n           (calls through door)\r\n           Mike...?\r\n                         \r\n          No reply.\r\n                         \r\n          A moment of indecision then Emily tightens her grip on the\r\n          screwdriver and quietly slides open the deadbolts.\r\n                         \r\n          INT. HALLWAY - NIGHT\r\n                         \r\n          She comes slowly down the hall, following the VOICE to its\r\n          source, stops in the living room doorway, haunted...\r\n                         \r\n          INT. LIVING ROOM - NIGHT\r\n                         \r\n                         THE TELEVISION\r\n                         \r\n          Edward's psych interview playing to the empty room. He's\r\n          straightjacketed, sedated. Talking directly to the camera.\r\n                         \r\n                          EDWARD\r\n           Where is she now? Some family somewhere?\r\n                         \r\n                          INTERVIEWER\r\n           Why does that concern you, Edward?\r\n                         \r\n                          EDWARD\r\n           `Cause you have to warn them.\r\n                         \r\n          Emily turns off the tv. IMMEDIATELY IT SWITCHES ITSELF BACK\r\n          ON. Emily freezes, realizing the room is not empty.\r\n          Turning, she sees Lucy sitting in the shadows holding the\r\n          remote. Lucy mutes the sound and returns Emily's stare,\r\n          thoughtful, almost empathetic.\r\n                         \r\n                          LUCY\r\n           I like it here. I like you. You want me\r\n           to like you, don't you?\r\n                         \r\n          Emily nods. The room bathed in the tv's flickering blue\r\n          light. Lucy is quiet for a moment. Then, in her innocently\r\n          menacing voice, explains the rules:\r\n           88.\r\n                         \r\n                         \r\n                          LUCY\r\n           You have to do what I say. If I say I\r\n           want to go to group, you have to do it.\r\n           If I say I want a new dress, you have to\r\n           do it. If I say I want ice cream every\r\n           day after school, you have to do it.\r\n           Okay?\r\n                         \r\n          Emily gives a haunted nod, remembering:\r\n                         \r\n          A FLASHCUT of Lucy sitting between Edward and Margaret at the\r\n          Child Services meeting, new dress, ribbon in her hair,\r\n          licking her ice cream with a wicked little smile.\r\n                         \r\n          BACK TO SCENE\r\n                         \r\n          Lucy stares coldly at the television: Margaret speaking with\r\n          the sound off.\r\n                         \r\n                          LUCY\r\n           They did what I said for a while and then\r\n           they stopped and started with the\r\n           secrets. But they weren't really secrets\r\n           I guess...\r\n           (looks at Emily)\r\n           ...because I always knew what they were\r\n           thinking.\r\n                         \r\n          She holds Emily's gaze then looks back at the tv. Margaret's\r\n          image reflected in the pupils of her eerie unblinking eyes.\r\n                         \r\n          INT. MARGARET'S PADDED ROOM, PSYCH HOSPITAL - NIGHT\r\n                         \r\n          Margaret, straps unbuckled, sits on the bed beside a YOUNG\r\n          NURSE who checks her temperature. Done, the Nurse heads out.\r\n                         \r\n                          MARGARET\r\n           Don't leave me.\r\n                         \r\n          Terror in Margaret's voice.\r\n                         \r\n                          YOUNG NURSE\r\n           It's okay, Maggie. I'll check on you\r\n           later.\r\n                         \r\n          The Nurse exits. Locks the door.\r\n                         \r\n          CLICK-KA-THUNK. The sound of doom to Margaret.\r\n                         \r\n          She stands up, looking around, trembling at what's to come.\r\n          Her footsteps sound oddly HOLLOW, METALLIC on the floor.\r\n           89.\r\n                         \r\n                         \r\n          MARGARET'S POV - surveying the room, we see what Margaret's\r\n          hell looks like. It's not a room she's living in...\r\n                         \r\n          AN OLD OVEN\r\n                         \r\n          With dark scorched metal walls. A bolted-down bed to one\r\n          side, perfectly white, like a practical joke.\r\n                         \r\n          We can hear the low HISS of it filling with gas. The faint\r\n          POOF as it ignites beneath her. The first SHIMMERING WAVES\r\n          OF HEAT rising up, singeing her hair.\r\n                         \r\n          Margaret runs screaming to the door, claws at the pane of\r\n          glass like a madwoman. But there is no escape from the hell\r\n          of her own mind. The YOUNG NURSE'S FACE APPEARS there in the\r\n          window, shocked by Margaret's insane rantings.\r\n                         \r\n          INT. PSYCH HOSPITAL CAFETERIA - NIGHT\r\n                         \r\n          Edward, dinner tray in hand, going through the cafeteria line\r\n          with other INSTITUTIONAL PATIENTS.\r\n                         \r\n          He sits down at a table and starts eating, quiet, lost in his\r\n          thoughts. Takes another mouthful of food and suddenly stops\r\n          chewing, noticing something very strange:\r\n                         \r\n          A BALD, MORBIDLY OBESE INMATE SITTING DIRECTLY ACROSS THE\r\n          TABLE IS CUTTING PEAS IN HALF ON HIS PLATE, ABSENTLY, BUT\r\n          WITH AN ALMOST SURGICAL PRECISON, EATING THEM ONE BY ONE OFF\r\n          THE TIP OF HIS KNIFE!!\r\n                         \r\n          He lifts his gaze to Edward. Smiles a knowing, taunting\r\n          smile. Then his WIDE WET MOUTH speaks in a little girl's\r\n                         VOICE:\r\n                         \r\n                          LUCY'S VOICE\r\n           I'm happy you're getting the help you\r\n           need, daddy.\r\n                         \r\n          Edward goes berserk. Launches himself across the table at\r\n          the guy, stabbing him in the neck with his fork. Vicious\r\n          attack. Unprovoked as far as anyone else is concerned. A\r\n          guard rushes over. Edward turns on him, maniacal.\r\n                         \r\n          THE GUARD SHOOTS HIM DEAD.\r\n                         \r\n          As blood pools around Edward's body, some LUNATIC who\r\n          witnessed the event starts to applaud. Others join in. It's\r\n          the most excitement they've seen all year. And as the\r\n          applause spreads through the entire cafeteria...\r\n           90.\r\n                         \r\n                         \r\n          EXT. EMILY'S HOUSE - DAY\r\n                         \r\n          Emily comes down the steps, past the morning paper on the\r\n          walkway. Stops dead in her tracks. Stunned. Comes back and\r\n          picks it up.\r\n                         \r\n          A SMALL PHOTO OF EDWARD ON THE FRONT PAGE WITH A HEADLINE:\r\n          HOSPITAL PROBES DEATH.\r\n                         \r\n          At the bus stop at the end of the street, Lucy mingles\r\n          happily with other CHILDREN. She meets Emily's gaze down the\r\n          length of the sidewalk. Smiles and waves goodbye as she gets\r\n          on the school bus.\r\n                         \r\n          INT. BARRON'S OFFICE, POLICE STATION - DAY\r\n                         \r\n          Emily drops the newspaper on Barron's desk. The headline\r\n          about Edward speaks for itself.\r\n                         \r\n                          BARRON\r\n           I know...\r\n                         \r\n          It's a different Mike Barron than last we saw. Gone is the\r\n          quiet assurance. Whatever happened rocked him to the core.\r\n          He closes the door for privacy.\r\n                         \r\n                          BARRON\r\n           There's something I want you to hear.\r\n           Came in at two o'clock last night. You\r\n           might wanna sit.\r\n                         \r\n          Emily sits. Barron cues a voicemail message on his phone,\r\n          plays it over the speaker. After a BEEP we hear it. A\r\n          SINISTER MALE VOICE, guttural, taunting, the voice of a\r\n                         DEMON:\r\n                         \r\n           SINISTER MALE VOICE\r\n           (mocking his earlier line)\r\n           `It's hard sometimes to tell the truth,\r\n           but I know you will `cause you're a good\r\n           little girl...'\r\n                          (THEN; INTIMATE)\r\n           Twenty years in the trenches, can't make\r\n           Lieutenant? Hurts, doesn't it? Shakes\r\n           your faith sometimes. You know why they\r\n           keep passing you over? Do you, Michael?\r\n           `Cause you're soft. Soft, soft, soft...\r\n                         \r\n          DELIRIOUS LAUGHTER followed by a CLICK and a DIAL TONE.\r\n          Emily's mouth gapes. After a moment:\r\n           91.\r\n                         \r\n                         \r\n                          BARRON\r\n           You're right. She called Doug. Took me\r\n           an extra couple of days to get your cell\r\n           phone records. That's what she's been\r\n           using.\r\n                         \r\n          Grim pause. Emily digs through her bag. Reaches the bottom.\r\n          No cell phone. Staring into the bag, voice wavering with\r\n                         EMOTION:\r\n                         \r\n                          EMILY\r\n           She's taking me apart, Mike.\r\n                         \r\n          She loses it for a second. Barron sits in front of her on\r\n          the edge of the desk.\r\n                         \r\n                          BARRON\r\n           I'm gonna help you get to the bottom of\r\n           this.\r\n                         \r\n                          EMILY\r\n           (re: Edward's photo)\r\n           He told me I have to kill her.\r\n                         \r\n          Barron registers that in silence. Stuns her, and himself, by\r\n          what he says next.\r\n                         \r\n                          BARRON\r\n           I'll help you.\r\n                         \r\n          Emily looks at him. Disbelief.\r\n                         \r\n                          BARRON\r\n           Whatever it takes.\r\n                         \r\n          She hugs him. A godsend.\r\n                         \r\n                          BARRON\r\n           I'm gonna put Beth and Tim in a hotel.\r\n           Keep her at the house.\r\n                         \r\n          INT. DOCTOR'S OFFICE - DAY\r\n                         \r\n          Emily buttoning her shirt after an exam.\r\n                         \r\n                          DOCTOR\r\n           Physically you're fine. How's the\r\n           stress?\r\n                         \r\n                          EMILY\r\n           I'm not sleeping, I was hoping you could\r\n           give me something.\r\n           92.\r\n                         \r\n                         \r\n          The doctor writes on her prescription pad.\r\n                         \r\n                          DOCTOR\r\n           Take one of these, you'll sleep.\r\n                         \r\n          Emily watches the pen scribble.\r\n                         \r\n          INT. EMILY'S CAR - DAY\r\n                         \r\n          A prescription pill bottle on the passenger seat. Emily,\r\n          driving home, glances at it with apprehension.\r\n                         \r\n          EXT. HOTEL - NIGHT\r\n                         \r\n          A high-rise hotel in downtown Los Angeles.\r\n                         \r\n          INT. HOTEL ROOM - NIGHT\r\n                         \r\n          Barron, saying goodbye to his WIFE and SON, sets down the\r\n          overnight bags they've packed.\r\n                         \r\n                          BARRON'S WIFE\r\n           Why won't you tell me what's going on?\r\n                         \r\n                          BARRON\r\n           Because I can't.\r\n                         \r\n          Kisses her. Turns to his son.\r\n                         \r\n                          BARRON\r\n           Take care of your mom.\r\n                         \r\n          Musses the boy's hair and leaves.\r\n                         \r\n          INT. HOTEL CORRIDOR - NIGHT\r\n                         \r\n          Barron strides down the corridor, his face reflecting the\r\n          grim task ahead.\r\n                         \r\n          INT. HOTEL PARKING STRUCTURE - NIGHT\r\n                         \r\n          His footsteps echo in the parking structure as he walks along\r\n          a row of parked cars.\r\n                         \r\n          A faint JANGLING SOUND stops him dead in his tracks. He\r\n          turns and scans the garage behind him. It's quiet, eerily\r\n          still.\r\n                         \r\n          He continues onward, but hears the faint JANGLING SOUND again\r\n          a moment later. Spins, trying to place it. There it is\r\n          again. Closer this time. Something moving, hiding, behind\r\n          the rows of cars over there.\r\n           93.\r\n                         \r\n                         \r\n          He bends, trying to get a look under the cars. Can't see\r\n          anything. Unnerved, he moves on, clicks the button on his\r\n          keychain remote. The lights flash on his car fifty yards\r\n          away.\r\n                         \r\n          But as he continues toward it they reveal themselves,\r\n          trodding into view from between the cars, CHOKE-CHAIN COLLARS\r\n          JANGLING around their necks...\r\n                         \r\n          THREE PIT BULLS\r\n                         \r\n          Battle-scarred. Vicious. The dogs from Diego's house. They\r\n          sit down right in front of Barron's car. It's a surreal\r\n          moment, a trio of attack dogs sitting at quiet attention,\r\n          square-jawwed, black-eyed, the kinetic calm before a predator\r\n          strikes.\r\n                         \r\n          Barron draws his gun. Fires a warning shot over their heads.\r\n                         \r\n          BANG!\r\n                         \r\n          Deafeningly loud, it echoes through the garage like a\r\n          thunderclap. But the dogs don't move, just sit there\r\n          staring.\r\n                         \r\n          Barron lowers his gun. It's time to get the hell out of\r\n          here. He backpedals, making no sudden movements, gun still\r\n          trained on the dogs.\r\n                         \r\n          They watch him, eyes livening with excitement, one of their\r\n          back legs twitching in anticipation.\r\n                         \r\n          Barron quickens his step and that's their cue.\r\n                         \r\n          ALL AT ONCE, WITH EXPLOSIVE SPEED, THE DOGS SPRING INTO\r\n          MOTION, VICIOUS AND MUSCLED AND SMELLING BLOOD.\r\n                         \r\n          Barron fires an errant shot and takes off running. But he\r\n          can't match their pace, the deadly trio race along the row of\r\n          police cruisers, closing the gap with ease.\r\n                         \r\n          At the last second Barron jumps the partition. The pit bulls\r\n          crash skull-first into the concrete, but continue their\r\n          pursuit unfazed as Barron takes off up the adjoining ramp.\r\n                         \r\n          He jumps up onto the row of cars and runs across the hoods,\r\n          denting the metal. The dogs jump up behind him, relentless\r\n          in their pursuit.\r\n                         \r\n          Jaws snapping at his heels, Barron takes to the car roofs,\r\n          the pitbulls leaping from car to car behind him.\r\n           94.\r\n                         \r\n                         \r\n          He looks back just in time to see the dogs launch themselves.\r\n          They hit him at chest height, sinking teeth in his flesh.\r\n                         \r\n          Stumbling forward, struggling to keep their jaws from his\r\n          throat, Barron doesn't see what's coming. The last car. The\r\n          edge of the parking garage.\r\n                         \r\n          He's over the edge before he even understands, flailing his\r\n          arms for a handhold that doesn't exist. The ground, far\r\n          below, flies up at him in a rush of acceleration.\r\n                         \r\n          We hear a sickening THUD and find Barron lying face down on\r\n          the pavement below, blood pooling around him. Clinging to\r\n          life, he opens his eyes and sees the TRIO OF PIT BULLS\r\n          SITTING OBEDIENTLY BESIDE HIM, unharmed, watching.\r\n                         \r\n          But from a distance we see there is only Barron. Dying alone\r\n          between the parked cars. No dogs anywhere in sight.\r\n                         \r\n          INT. EMILY'S HOUSE - NIGHT\r\n                         \r\n          Emily opens the front door, peers in, trying not to make a\r\n          sound.\r\n                         \r\n                          EMILY\r\n           Lucy...?\r\n                         \r\n          No reply. She enters. Sees -\r\n                         \r\n          THE CLOSET DOOR IS OPEN.\r\n                         \r\n          She comes closer.\r\n                         \r\n          EMPTY BANKER BOXES strewn in the hall. SCATTERED PAGES.\r\n                         \r\n          At the far end, the light is on in Lucy's bedroom. The door\r\n          open a crack. A shaft of light spilling out into the\r\n          darkened hallway.\r\n                         \r\n          Emily comes down the hallway past SCATTERED FILE PAGES.\r\n          Preliminary reports. Medical records. Personality\r\n          profiles...\r\n                         \r\n          She opens the door to Lucy's room.\r\n                         \r\n          INT. LUCY'S BEDROOM - NIGHT\r\n                         \r\n          Freezes in the doorway, shocked by what lies before her.\r\n                         \r\n                          EMILY\r\n           Oh my God...\r\n           95.\r\n                         \r\n                         \r\n          Black eyes. Bloody noses. Bruises. Cuts. Burns. PHOTOS\r\n          OF ABUSED CHILDREN COVER THE ENTIRE FLOOR. A collage of\r\n          misery.\r\n                         \r\n          Lucy is nowhere to be seen. Emily comes in and starts\r\n          quickly picking them up.\r\n                         \r\n          Tucked between the file cabinet and the wall is a CORKBOARD.\r\n          Emily pulls it out. It's covered with PHOTOS FROM WORK.\r\n          COWORKERS. HER KIDS. Two of the photos are turned around.\r\n          She flips them over in rapid succession. Diego. Doug.\r\n                         \r\n          She rips all the photos from the board.\r\n                         \r\n          Photos bunched in her hands, she heads for the door, but\r\n          hears something that stops her in her tracks -\r\n                         \r\n          A strange INTERMITTENT BUZZING NOISE\r\n                         \r\n          It lasts two seconds and stops. She turns around, scans the\r\n          room. Puts down the stack of photos. There it is again:\r\n                         \r\n          BZZZZZZZZZZZT. BZZZZZZZZZZZZT.\r\n                         \r\n          Sounds like a housefly trapped against a window, but it's\r\n          bigger, angrier, and appears to be coming from the\r\n                         \r\n                         KNOTTED RUG\r\n                         \r\n          at the foot of Lucy's bed. Emily crosses to it. The BUZZING\r\n          STOPS. She bends. Takes hold of a corner. Peels it slowly\r\n          back to reveal\r\n                         \r\n                         BARE FLOOR\r\n                         \r\n          Weird. Nothing there.\r\n                         \r\n          BZZZZZZZZZZZZZT! BZZZZZZZZZZZZZZT!\r\n                         \r\n          Emily straightens, turns. It's coming from the\r\n                         \r\n                         BED\r\n                         \r\n          As she approaches it the BUZZING INTENSIFIES, louder, more\r\n          agitated.\r\n                         \r\n          Pauses as she gets there, terrified of what she might find,\r\n          the bed BUZZING FURIOUSLY FROM WITHIN. Something is trapped\r\n          under those blankets, waiting for release.\r\n                         \r\n          Emily extends a trembling hand, takes hold of the blankets\r\n          and, slowly, rigid with fear, peels them back to reveal\r\n           96.\r\n                         \r\n                         \r\n                         BARE MATTRESS\r\n                         \r\n          Impossible, because the BUZZING IS LOUDER THAN EVER.\r\n                         \r\n          With a tense swallow Emily realizes it's coming from lower,\r\n          deeper within the bed, between the mattress and the box\r\n          spring.\r\n                         \r\n          She slips her fingers into the crack.\r\n                         \r\n          And slowly lifts the mattress, the BUZZING GROWING\r\n          FRIGHTENINGLY LOUD as its source is exposed, something\r\n          hellish waiting for her as she cranes her neck and look to\r\n          see what lies below -\r\n                         \r\n          HER CELL PHONE\r\n                         \r\n          Vibrating. BZZZZZZZZZT. BZZZZZZZZZZT. On the viewscreen:\r\n          \"INCOMING CALL...\"\r\n                         \r\n          She picks it up. Stares at it vibrating in her hand.\r\n          Presses the TALK button. Brings it to her ear.\r\n                         \r\n          The LOW STATIC of an open line. Then, a RASPY MALE VOICE:\r\n                         \r\n           MALE VOICE ON PHONE\r\n           Emily...\r\n                         \r\n          Emily flinches.\r\n                         \r\n                          EMILY\r\n           Who is this...?\r\n                         \r\n           MALE VOICE ON PHONE\r\n           It's Wayne, Emily, I just got a call,\r\n           Mike's dead...\r\n                         \r\n          Emily, stunned, barely able to speak.\r\n                         \r\n                          EMILY\r\n           No... he's...\r\n                         \r\n           WAYNE (V.O.)\r\n           They don't know if he fell or what\r\n           happened...\r\n                         \r\n          Emily's phone hand drops to her side in shock. From down\r\n          there, we hear Wayne's voice:\r\n                         \r\n           WAYNE (V.O.)\r\n           Emily? Emily, are you okay...?\r\n                         \r\n          After a moment, she lifts it.\r\n           97.\r\n                         \r\n                         \r\n                          EMILY\r\n           I have to go.\r\n                         \r\n          Hangs up. On the brink of emotional collapse. Her only\r\n          confidante dead.\r\n                         \r\n          Just then she hears BREATHING from behind the open door.\r\n          Someone or something hiding in that dark corner over there.\r\n          She crosses to it. Pulls back the door and there sits\r\n                         \r\n                         LUCY\r\n                         \r\n          quiet, innocent, chin on her knees.\r\n                         \r\n                          EMILY\r\n           What did you do to him?\r\n                         \r\n          Lucy says nothing. Emily grabs her by the arm. Yanks her to\r\n          her feet.\r\n                         \r\n                          EMILY\r\n           WHAT DID YOU DO TO HIM?!\r\n                         \r\n          After a moment:\r\n                         \r\n                          LUCY\r\n           He did it to himself.\r\n                         \r\n          WHACK! Emily slaps her. Hard across the face. Knocks her\r\n          to the floor. Lucy sits up, lip split. Tastes the blood\r\n          with her tongue. Hint of a smile. The taste of victory.\r\n                         \r\n                          LUCY\r\n           Europa. Ganymede. Io. Callisto. The\r\n           moons of Jupiter. We got back our\r\n           astronomy tests today.\r\n                         \r\n          It's there on the floor. A++ Well done, Lucy!\r\n                         \r\n          There's a LOUD BEEP in the other room. Lucy gets up and\r\n          walks out. Emily watches as Lucy goes into the kitchen.\r\n          Takes a bag of popcorn from the microwave. Empties it into a\r\n          bowl. Sits down on the living room sofa and clicks on the tv\r\n          remote, watching it like nothing ever happened. Emily walks\r\n          over and pitches the tv onto the floor. The SCREEN SHATTERS.\r\n                         \r\n                          EMILY\r\n           Get out of my house.\r\n                         \r\n          Lucy, unimpressed, expressionless, takes another handful of\r\n          popcorn. Chews it. CRUNCH. CRUNCH. CRUNCH. Emily swats\r\n          the bowl from her hands.\r\n           98.\r\n                         \r\n                         \r\n                          EMILY\r\n           GET OUT!\r\n                         \r\n          Flicking bits of popcorn off herself, Lucy stands up from the\r\n          sofa. Her face catches the light from the hallway. Emily\r\n          shudders at the sight.\r\n                         \r\n          Lucy's features look altered somehow, sharpened. It's\r\n          subtle, but the overall effect is chilling. THE FACE OF A\r\n          LITTLE GIRL LAID OVER THE MUSCULATURE OF SOMETHING MORE\r\n          DEVIOUS AND WICKED.\r\n                         \r\n                          LUCY\r\n           Don't yell at me. My mom and dad used to\r\n           yell at me.\r\n                         \r\n          Emily backs away, mortified, takes off down the hall.\r\n                         \r\n          INT. EMILY'S BEDROOM - NIGHT\r\n                         \r\n          Rushes in. Slams the door. Bolts the deadbolts. CLUNK.\r\n          CLUNK. CLUNK. Moment of panic. Will they hold?\r\n                         \r\n          Slides her bureau in front of the door. Shoves her bed in\r\n          front of the bureau just to be sure.\r\n                         \r\n          In the silence we hear LUCY'S FOOTSTEPS coming down the hall\r\n          toward the door.\r\n                         \r\n          Closer, closer...\r\n                         \r\n          There's nothing else to block the door with. Emily backs\r\n          away, trembling as\r\n                         \r\n          LUCY'S FOOTSTEPS arrive at the door. A tense silence. Then:\r\n                         \r\n           LUCY (O.S.)\r\n           Emily... I'm sorry... I didn't mean to...\r\n                         \r\n          Emily grabs the screwdriver, clutches it in both hands.\r\n                         \r\n           LUCY (O.S.)\r\n           Can I come in so we can talk and work it\r\n           out?\r\n                         \r\n          There's a GENTLE KNOCK on the door. Emily flinches,\r\n          remembering last time.\r\n                         \r\n           LUCY (O.S.)\r\n           Emily...?\r\n                         \r\n                          EMILY\r\n           Stay away from me!\r\n           99.\r\n                         \r\n                         \r\n           LUCY (O.S.)\r\n           Don't be mad. I said I was sorry. I'll\r\n           brush your hair for you.\r\n                         \r\n                          EMILY\r\n           STAY AWAY FROM ME!!\r\n                         \r\n          Silence.\r\n                         \r\n                         THEN:\r\n                         \r\n          WHAM! The door shudders from a MAMMOTH IMPACT. Last time,\r\n          it shook the door, this time it shakes the entire wall.\r\n          Emily recoils, dropping the screwdriver.\r\n                         \r\n          WHAM! CRACKS APPEAR in the door as it bows from the\r\n          tremendous force.\r\n                         \r\n          WHAM!! CRACKS FAN OUT into the plaster around the doorframe.\r\n                         \r\n          WHAM!! Half the SCREWS HOLDING THE HINGES fly from the wall.\r\n                         \r\n          WHAM!! The DEADBOLTS BENDING from the ungodly pummeling.\r\n                         \r\n          WHAM!! The DEADBOLT SCREWS getting yanked from the wood.\r\n                         \r\n          Emily frozen in terror, watching. Whatever's out there is\r\n          coming in.\r\n                         \r\n          WHAM!! One of the DOOR HINGES rips clean from the wall.\r\n                         \r\n          WHAM!! The FIRST DEADBOLT comes flying off.\r\n                         \r\n          WHAM!! The SECOND DOOR HINGE gone.\r\n                         \r\n          WHAM!! ANOTHER DEADBOLT flies off.\r\n                         \r\n          WHAM!! The DOOR SPLITS down the center.\r\n                         \r\n          WHAM!! The THIRD DEADBOLT lands on the floor at Emily's feet\r\n          with a METAL THUD.\r\n                         \r\n          A breathless silence.\r\n                         \r\n          Then the DOOR RATTLES and drops loose from the frame with a\r\n          DEAD WOODEN CLUNK.\r\n                         \r\n          Nothing holding it in place now except the bureau and the\r\n          bed. And now they both start to SLIDE BACKWARDS as whatever\r\n          is on the other side starts pushing its way in.\r\n           100.\r\n                         \r\n                         \r\n          Emily topples a high bookcase against the door and pushes\r\n          back with every ounce of strength she can muster, but it's no\r\n          use. The bureau overturns, CRASHES to the floor. Emily's\r\n          bare feet slide backwards along with the bed.\r\n                         \r\n          And then they stop. The barricade sufficiently breached.\r\n                         \r\n          Emily, in her panic, makes a hasty decision. She hides under\r\n          the bed.\r\n                         \r\n          We HOLD LOW on the open door as LUCY'S FEET step into the\r\n          room, the feet of a child, but the BREATHING we hear sounds\r\n          emphysemic and the VOICE is unquestionably male - harsh,\r\n          guttural, taunting Emily as it comes for her:\r\n                         \r\n           SINISTER MALE VOICE\r\n           Emily...\r\n                         \r\n          Wide-eyed with terror under the bed, she watches those feet\r\n          pick their way over the shattered remnants of the barricade.\r\n                         \r\n           SINISTER MALE VOICE\r\n           Emily... We need to learn healthier ways\r\n           of resolving conflict, Emily.\r\n                         \r\n          The feet step gingerly past the overturned bureau.\r\n                         \r\n           SINISTER MALE VOICE\r\n           ...Most families don't even know they\r\n           have a problem...\r\n                         \r\n          The feet stop at the SCREWDRIVER.\r\n                         \r\n           SINISTER MALE VOICE\r\n           ...until it's too late.\r\n                         \r\n          A HAND reaches down and picks it up, a girl's hand, but the\r\n          fingers as they wrap tightly around the handle look strong\r\n          and sinewy.\r\n                         \r\n          The feet stand motionless for a moment then turn and come\r\n          toward the bed, stopping right in front of EMILY'S HORRIFIED\r\n          FACE.\r\n                         \r\n          A pause and then, still from Emily's POV, we see Lucy lower\r\n          herself onto her knees.\r\n                         \r\n          WHAM!! - with shocking force that hand IMPALES THE\r\n          SCREWDRIVER IN THE WOODEN FLOOR!\r\n                         \r\n          Another pause then both hands come into view, palms flat on\r\n          the hardwood, as she leans her head down.\r\n           101.\r\n                         \r\n                         \r\n          Emily recoiling in anticipation as the face comes into view -\r\n                         \r\n          LUCY'S INNOCENT FACE\r\n                         \r\n          A little girl. With a little girl voice to match.\r\n                         \r\n                          LUCY\r\n                          (PLAYING MOMMY)\r\n           What are you doing, you silly\r\n           pumpkinhead?\r\n                         \r\n          Emily, hyperventilating, stares in shock. Lucy reaches her\r\n          hand in. Emily backs away, wedges herself in the corner.\r\n                         \r\n                          LUCY\r\n                          (PLAYING MOMMY)\r\n           You don't want me to come under there and\r\n           get you, do you?\r\n                         \r\n          Emily, crying now, shakes her head. Lucy, almost\r\n          sympathetic, frowns.\r\n                         \r\n                          LUCY\r\n                          (PLAYING MOMMY)\r\n           I'm going to count to three. One...\r\n                         \r\n                          EMILY\r\n           No...\r\n                         \r\n                          LUCY\r\n                          (PLAYING MOMMY)\r\n           Two... Two and a half...\r\n                         \r\n                          EMILY\r\n           Please...\r\n                         \r\n                          LUCY\r\n                          (PLAYING MOMMY)\r\n           Two and three quarters... Three...\r\n                         \r\n          Lucy starts crawling under the bed.\r\n                         \r\n                          LUCY\r\n           Here I come.\r\n                         \r\n          Emily tries to go backwards, but there's nowhere for her to\r\n          go.\r\n                         \r\n          LUCY'S FACE SLIDING CLOSER LIKE THE HEAD OF A SNAKE.\r\n                         \r\n          Trapped, Emily screams.\r\n           102.\r\n                         \r\n                         \r\n                          EMILY\r\n           WHAT DO YOU WANT?!!\r\n                         \r\n          Lucy stops crawling. Folds her arms, sets her chin on them.\r\n          Comfortable here under the bed. Delighting in the question.\r\n                         \r\n                          LUCY\r\n           What you wanted from your mother. I want\r\n           you to love me.\r\n                         \r\n                          EMILY\r\n           Okay... okay, I will, I will, I promise.\r\n                         \r\n          Lucy weighs Emily's surrender for a moment. Then, oddly\r\n                         BRIGHT:\r\n                         \r\n                          LUCY\r\n           Come tuck me in.\r\n                         \r\n                          EMILY\r\n           Okay... I'll be right there.\r\n                         \r\n                          LUCY\r\n           You better come.\r\n                         \r\n          Lucy slithers out and we see her feet scamper from the room.\r\n          Emily puts her head down on the floor and cries, covering her\r\n          mouth with her hands so she won't make a sound.\r\n                         \r\n          INT. EMILY'S KITCHEN - NIGHT\r\n                         \r\n          A WHISTLING KETTLE on the stove.\r\n                         \r\n          Emily, still in tears, takes it from the burner. Dumps SIX\r\n          SLEEPING PILLS from the prescription bottle. Crushes them\r\n          with the blunt edge of a knife. Stirs them into a cup of\r\n          Chamomile tea.\r\n                         \r\n          She freezes at a NOISE behind her. Looks tensely over her\r\n          shoulder.\r\n                         \r\n          The fridge.\r\n                         \r\n          She adds sugar, continues stirring.\r\n                         \r\n          INT. HALLWAY - NIGHT\r\n                         \r\n          We follow the TEA CUP, in Emily's hand, as she comes\r\n          nervously down the hall to Lucy's room. We can see Lucy in\r\n          there, waiting for her in bed. Emily, playing the part,\r\n          dries her eyes and enters.\r\n           103.\r\n                         \r\n                         \r\n          INT. LUCY'S ROOM - NIGHT\r\n                         \r\n          Sits down on the bed, hands Lucy the tea.\r\n                         \r\n                          LUCY\r\n           Chamomile.\r\n                         \r\n          Emily nods. The face of a loving mother. Lucy brings the\r\n          cup to her lips, pauses.\r\n                         \r\n                          LUCY\r\n           Maybe you should have it, you look\r\n           stressed.\r\n                         \r\n                          EMILY\r\n           I'll have one later.\r\n                         \r\n          Lucy considers this, nods okay, takes a sip of tea. Emily\r\n          picks up a brush and brushes Lucy's hair.\r\n                         \r\n                          EMILY\r\n           Tomorrow's our new beginning.\r\n                         \r\n                          LUCY\r\n           I'll be good.\r\n                         \r\n                          EMILY\r\n           I know.\r\n                         \r\n          Lucy takes a few more sips and sets the tea cup on the\r\n          bedside table. Emily, tucking her in, gives the cup a\r\n          nervous glance. Did she drink enough?\r\n                         \r\n                          EMILY\r\n           Get some rest.\r\n                         \r\n                          LUCY\r\n           Say it.\r\n                         \r\n                          EMILY\r\n           I love you.\r\n                         \r\n                          LUCY\r\n           Forever and ever?\r\n                         \r\n                          EMILY\r\n           Forever and ever.\r\n                         \r\n          Emily kisses her on the forehead. Lucy looks up at her and\r\n          for a moment she's the little girl Emily met. Innocent,\r\n          angelic, closing her eyes for sleep. They flutter open one\r\n          last time.\r\n           104.\r\n                         \r\n                         \r\n                          LUCY\r\n           Where are you if I need you?\r\n                         \r\n                          EMILY\r\n           Right down the hall.\r\n                         \r\n          Lucy's eyes shut. Emily, brushing her hair, staring at the\r\n          HALF-FULL TEA CUP.\r\n                         \r\n          INT. HALLWAY - NIGHT\r\n                         \r\n          Lucy asleep in bed. Emily watches from the door, wary,\r\n          expecting Lucy's eyes to snap open any second.\r\n                         \r\n                          EMILY\r\n           Sweetheart...?\r\n                         \r\n          She doesn't move, dead to the world. Or is it a game? Emily\r\n          closes the door. Leans against the wall, shaking,\r\n          contemplating her next move.\r\n                         \r\n          Wedges a chair under the door handle. Time of the essence.\r\n                         \r\n          INT. EMILY'S GARAGE - NIGHT\r\n                         \r\n          Junk-filled. The door lifts to reveal Emily, silhouetted,\r\n          looking in. Amid the clutter is a lawnmower. Beside it, a\r\n          big can of GASOLINE.\r\n                         \r\n          INT. EMILY'S HOUSE - NIGHT\r\n                         \r\n          Emily stifling sobs as she douses the walls of the house.\r\n          The hallway, the bathroom, the kitchen, all of it.\r\n                         \r\n          TIP OF A MATCH strikes flint, ignites.\r\n                         \r\n          Emily stares at it for a long moment.\r\n                         \r\n          Lets it fall.\r\n                         \r\n          FLAMES SCURRY in a shimmering blue-gold sheet across the\r\n          floor. Climb the walls, the entire house ablaze in a matter\r\n          of seconds.\r\n                         \r\n          Emily sits and watches as the door to Lucy's bedroom is\r\n          engulfed. It's an image straight from hell: A YOUNG WOMAN\r\n          SITTING ON A SOFA IN A HOUSE OF FIRE.\r\n                         \r\n          The fish, frantic in their tank, catch Emily's eye. She goes\r\n          over and grabs the tank.\r\n           105.\r\n                         \r\n                         \r\n          EXT. EMILY'S HOUSE - NIGHT\r\n                         \r\n          Smoke swirling past her, she exits the house, locking the\r\n          front door behind her. She backs away and watches it burn,\r\n          holding her fish tank, the only thing she saved.\r\n                         \r\n           TIME CUT TO:\r\n                         \r\n          Billowing black smoke. The house fully engulfed as fire\r\n          engines arriving on the scene, sirens wailing. Emily\r\n          watching with neighbors on the sidewalk as the FIREFIGHTERS\r\n          uncoil their hoses.\r\n                         \r\n          The window to Lucy's bedroom is a bright red square, an\r\n          inferno. And as Emily stares at it, disbelieving what she's\r\n          done, the figure of a CHILD appears.\r\n                         \r\n                         LUCY\r\n                         \r\n          Her whole body ablaze. Horrific. She just stands there,\r\n          arms at her sides, burning.\r\n                         \r\n          Just now the FIRE MARSHALL crosses to the onlookers. Hollers\r\n          over the noise and commotion:\r\n                         \r\n                          FIRE MARSHALL\r\n           Everybody get out okay?!\r\n                         \r\n          Emily wavers, not sure what to say. The Fire Marshall sees\r\n          her indecision.\r\n                         \r\n                          FIRE MARSHALL\r\n           This your house?!\r\n           (she nods yes)\r\n           Anybody else inside?!\r\n           (off her hesitation)\r\n           Ma'am...?!\r\n                         \r\n          Emily opens her mouth to reply, but sees something behind her\r\n          that closes her throat.\r\n                         \r\n                         LUCY\r\n                         \r\n          standing on the sidewalk in her pajamas. Unscathed.\r\n                         \r\n                          FIRE MARSHALL\r\n           Anyone else inside?! Yes or no?!\r\n                         \r\n          Emily, in shock, shakes her head no. The Fire Marshall\r\n          rushes off, walkie-talkie squawking. Emily stands frozen as\r\n          Lucy comes through the crowd to her. More dismayed than\r\n          angry.\r\n           106.\r\n                         \r\n                         \r\n                          LUCY\r\n           That was mean.\r\n                         \r\n          She takes Emily's hand. Together they watch the house burn.\r\n          Firelight playing on their faces. The fish bouncing off the\r\n          glass in the tank at Emily's feet.\r\n                         \r\n          INT. EMILY'S CAR - NIGHT\r\n                         \r\n          The blue halflight before dawn. Emily and Lucy sit in the\r\n          Volvo, eyeing the scorched remains of the house. The\r\n          firecrew stowing equipment. Emily puts the car in drive.\r\n                         \r\n          INT. EMILY'S CAR - DAWN\r\n                         \r\n          The FISH FLOATING DEAD at the top of the tank in the back\r\n          seat as Emily drives down the freeway at daybreak. Lucy\r\n          gazing out dreamily at the sunrise.\r\n                         \r\n                          LUCY\r\n           Maybe we can find a hotel with a swimming\r\n           pool.\r\n                         \r\n          Emily says nothing. Lucy turns and looks at her, thoughtful,\r\n          almost empathetic. She draws up her knees and rests her chin\r\n          on top, levels an appraising stare at Emily like the one she\r\n          leveled at Doug.\r\n                         \r\n                          LUCY\r\n           It's sad, isn't it? How it gets passed\r\n           on. How people do to their own kids what\r\n           their parents did to them. That's why\r\n           you got the job...\r\n                         \r\n          Emily turns on the radio, full volume, trying to drown out\r\n          Lucy's voice. Lucy reaches over and turns it off. CLICK.\r\n                         \r\n                          LUCY\r\n           ...To prove to yourself you're not like\r\n           her, that you're not like your mother.\r\n           Because that scares you. Scares you more\r\n           than anything.\r\n                         \r\n          Lucy, in mock sentiment, puts her hand on Emily's.\r\n                         \r\n                          LUCY\r\n           I love you... even if you don't love me.\r\n                         \r\n          Emily looks at her, gutted. But defiant. Turning her gaze\r\n          forward, she tightens her grip on the wheel and calmly,\r\n          resolutely, JAMS THE GAS PEDAL TO THE FLOOR. The\r\n          acceleration pitches Lucy backwards into her seat. She sits\r\n          up, eyes wide, didn't see this coming. A suicide run.\r\n           107.\r\n                         \r\n                         \r\n                          LUCY\r\n           What are you doing? Slow down.\r\n                         \r\n          A tense smile from Lucy. The tables have turned.\r\n                         \r\n                          LUCY\r\n           Did you hear me?\r\n                         \r\n          Emily stares dead ahead, red-lining the tachometer. Lucy\r\n          flits her eyes skyward. IMMEDIATELY IT DARKENS AND STARTS TO\r\n          RAIN. Emily turns on the wipers, speeds on, unfazed.\r\n                         \r\n                          LUCY\r\n           I said slow down!\r\n                         \r\n          Emily ignores her, going eighty now, weaving through SLOWER\r\n          TRAFFIC THAT FLIES TOWARD THEM OUT OF THE GRAY HAZE. Lucy,\r\n          panicking, changes channels like a tv. Innocent child all of\r\n          a sudden.\r\n                         \r\n                          LUCY\r\n           Please, stop, Emily, I'll be good.\r\n                         \r\n          Emily ignores her, beyond apology. And Lucy's face sharpens.\r\n          She points down the road.\r\n                         \r\n                          LUCY\r\n           Look out!\r\n                         \r\n          Through the heavy rain we see -\r\n                         \r\n          A TRACTOR-TRAILER RIG CRASH THROUGH THE DIVIDING MEDIAN AND\r\n          JACKKNIFE, BARRELING AT THEM HEAD-ON!\r\n                         \r\n          Emily goes for the brake, but reconsiders, seeing the truck\r\n          for what it is: a test of faith. She welcomes it. Tightens\r\n          her grip on the wheel and goes full throttle again, right at\r\n          the truck. Lucy shrieks in terror.\r\n                         \r\n                          LUCY\r\n           What are you doing?!\r\n                         \r\n                          EMILY\r\n           It's not real.\r\n                         \r\n                          LUCY\r\n           Yes, it is!\r\n                         \r\n                          EMILY\r\n           Are you scared?!\r\n           108.\r\n                         \r\n                         \r\n          Pedal to the floor. Inviting the head-on collision. You can\r\n          see the BIG RIG DRIVER in the cab, wrestling frantically with\r\n          the steering wheel. Lucy bracing herself, screams -\r\n                         \r\n                          LUCY\r\n           STOP!\r\n                         \r\n          Emily clenches her teeth in anticipation of impact, of death.\r\n                         \r\n          THE CHROME GRILLWORK OF THE TRUCK RUSHES TOWARD THEM IN THAT\r\n          FINAL MOMENT, THE AIR HORN DEAFENINGLY LOUD!\r\n                         \r\n          But the impact never comes. In the blink of an eye the truck\r\n          is gone. Open road in front of them. It's not raining.\r\n          Never was. The wipers SQUEAKING on a dry windshield.\r\n                         \r\n          Lucy sits in silence, her bag of tricks empty. Emily,\r\n          triumphant, turns to her with a vindictive smile, the\r\n          speedometer hitting a hundred.\r\n                         \r\n                          EMILY\r\n           ARE YOU SCARED?!\r\n                         \r\n          She clutches Lucy's wrist.\r\n                         \r\n                          EMILY\r\n           I'M NOT!!\r\n                         \r\n          Emily jerks the car off the road, crashing through the\r\n          guardrail. Trees snapping in half across the hood as they go\r\n          careening through roadside woods and down a steep embankment\r\n                         TOWARD -\r\n                         \r\n          EXT. LOS ANGELES RESERVOIR - DAY\r\n                         \r\n          The car tears through a chainlink fence and leaps off the\r\n          high embankment into the water.\r\n                         \r\n          INT. EMILY'S VOLVO - DAY\r\n                         \r\n          Impacts and sinks with frightening speed. Water rushing in\r\n          from all sides. Emily shackles Lucy with her arms as the\r\n          water rises to cover their mouths.\r\n                         \r\n                         UNDERWATER\r\n                         \r\n          They stare wide-eyed at one another through the water. Hair\r\n          swirling around their faces as they sink to the bottom.\r\n                         \r\n          LUCY'S LIPS CURL INTO THAT CREEPY MANNISH SMILE.\r\n                         \r\n          As though she anticipated this. Or welcomes it. Or knows\r\n          something Emily does not. And now Emily sees what Lucy sees -\r\n           109.\r\n                         \r\n                         \r\n          A FIGURE SWIMMING DOWN TOWARD THEM THROUGH THE MURKY WATER.\r\n                         \r\n          A HAND pries open the door and wrestles Lucy from Emily's\r\n          grasp. Pulls her from the car, swimming to the surface with\r\n          her. Emily is left empty-handed, stunned, alone in her\r\n          watery grave.\r\n                         \r\n          SHE DROWNS IN STAGES, EACH ONE DIFFICULT TO WATCH, THE\r\n          INITIAL FRANTIC FLAILINGS, THE HOPELESS PANIC, THE SLOW\r\n          DAWNING OF ACCEPTANCE, THE MUSCLES LOOSENING, ARMS FLOATING\r\n          LIMP, EYES FIXED IN A BLANK STARE.\r\n                         \r\n          And just when her death seems certain, a HAND grabs her by\r\n          the shoulder and yanks her out the driver's side window...\r\n                         \r\n          EXT. BANK OF RESERVOIR - DAY\r\n                         \r\n          Ambulances. Patrol cars. Paramedics. Onshore, drying off\r\n          with a towel, talking to a uniformed officer is the PASSERBY\r\n          who saved Lucy's life.\r\n                         \r\n                          PASSERBY\r\n           Right through the guardrail, never\r\n           touched the brakes...\r\n                         \r\n          Emily goes by on a gurney, semi-conscious, oxygen mask over\r\n          her face. Paramedics checking her vitals.\r\n                         \r\n          Loaded into the ambulance, she meets the gaze of Lucy who is\r\n          being attended to by a female PARAMEDIC, who puts her arm\r\n          around Lucy in a maternal gesture, shielding her from the\r\n          sight of Emily as Emily did of the Sheridans.\r\n                         \r\n                          PARAMEDIC\r\n           Don't look at her, okay? Just don't even\r\n           look.\r\n                         \r\n          Lucy nods, the innocent victim. Clinging to her protector as\r\n          she watches the ambulance take Emily Jennings away.\r\n                         \r\n                          CUT TO:\r\n                         \r\n          A TELEVISION - NEWS FOOTAGE\r\n                         \r\n          of Lucy wrapped in a blanket sitting beside the female\r\n          paramedic in an ambulance. Shivering. Wet-hair clinging to\r\n          her face. Portrait of a child victim.\r\n                         \r\n                          NEWS REPORTER\r\n           A remarkable story of survival this\r\n           morning as a young girl is pulled from\r\n           the Los Angeles reservoir in an accident\r\n           police are calling suspicious...\r\n           110.\r\n                         \r\n                         \r\n          INSTITUTIONAL PATIENTS watching tv in the psych hospital rec\r\n          room. Slouched on the vinyl sofa, watching without\r\n          comprehension, heavily sedated, Margaret Sheridan.\r\n                         \r\n          INT. WINDOWLESS ROOM - DAY\r\n                         \r\n          Emily talking agitatedly to a MAN IN A SUIT who is writing\r\n          something and not paying attention to her. We only see her\r\n          face at first.\r\n                         \r\n                          EMILY\r\n           Where is she? Where'd they put her?\r\n           Foster care? Is she with a family? You\r\n           have to let me talk to them...\r\n                         \r\n          She snatches the pen from his hand.\r\n                         \r\n                          EMILY\r\n           Do you hear me?!\r\n                         \r\n          He looks at her, quietly takes back his pen.\r\n                         \r\n           MAN IN SUIT\r\n           I hear you.\r\n                         \r\n          Continues writing. There's a KNOCK on the door. A BAILIFF\r\n          pokes his head in.\r\n                         \r\n                          BAILIFF\r\n           Set.\r\n                         \r\n          Emily stands up from the chair she's been sitting in and we\r\n          see she's wearing an ORANGE LA COUNTY JAIL JUMPSUIT. The\r\n          man, her public defender, instructs her as they exit:\r\n                         \r\n           MAN IN SUIT\r\n           Let me do the talking in here.\r\n                         \r\n          EXT. PRIVATE WOODED ROAD - DAY\r\n                         \r\n          Lucy walks a private road through sunlit forest with a kind\r\n          RETIRED COUPLE. Temporary guardians who've taken her in for\r\n          the weekend.\r\n                         \r\n                          LUCY\r\n           Why can't I live with you?\r\n                         \r\n                          RETIRED WOMAN\r\n           Oh, darling, we're not foster parents, we\r\n           just help out when the system's full.\r\n           111.\r\n                         \r\n                         \r\n                          RETIRED MAN\r\n           They'll contact us, Lucy, when your\r\n           placement comes through.\r\n                         \r\n          The woman puts her arm around her as they walk on.\r\n                         \r\n                          RETIRED WOMAN\r\n           Some nice family that always wanted a\r\n           little girl.\r\n                         \r\n          Lucy smiles, shy, innocent, quietly taking in the scenery.\r\n                         \r\n          INT. FOSTER PLACEMENT SERVICES - NIGHT\r\n                         \r\n          Two women cross the office after hours, a pudgy middle-aged\r\n          FOSTER CARE SUPERVISOR and a younger CASEWORKER who is\r\n          leaving for the day. The office reminds you of Child\r\n          Services, another tier of the child welfare system.\r\n                         \r\n                          CASEWORKER\r\n           Going to the thing Saturday?\r\n                         \r\n                          SUPERVISOR\r\n           I don't know.\r\n                         \r\n                          CASEWORKER\r\n           Oh, you should. It'll be fun.\r\n                         \r\n                          SUPERVISOR\r\n           Maybe I will, I don't know. We'll see.\r\n                         \r\n                          CASEWORKER\r\n           Bye, Janey.\r\n                         \r\n                          SUPERVISOR\r\n           See you tomorrow.\r\n                         \r\n          The Caseworker exits. The Supervisor comes down the row of\r\n          cubicles dropping files on desks. Alone. After hours. A\r\n          thankless profession.\r\n                         \r\n          It lands on some random desk, amid the usual backlog of mail\r\n          and paperwork. A case file like all the others. The name\r\n          typed on the label:\r\n                         \r\n          SHERIDAN, LUCY.\r\n                         \r\n           FADE OUT.\r\n                          \r\n\r\n\n\n\n\nCase 39\nWriters :   Ray Wright\nGenres :   Horror  Mystery  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Emily Jenkins (Renée Zellweger) is a social worker living in Oregon, who is assigned to investigate the family of ten-year-old Lillith Sullivan (Jodelle Ferland), as her grades have declined and an emotional rift with her parents has emerged. Emily suspects that the parents have been mistreating Lillith. Emily's fears are confirmed when Lillith's parents try to kill her by gassing her in the oven at home. Emily saves Lillith with the help of Detective Mike Barron (Ian McShane). Lillith is originally sent to a children's home, but she begs Emily to look after her instead. With the agreement of the board, Emily is assigned to take care of Lillith until a suitable foster family comes along. In the meantime, Lillith's parents, Edward and Margaret (Callum Keith Rennie and Kerry O'Malley) are placed in a mental institution.\nNot too long after Lillith moves in, strange things begin to happen around Emily. Two weeks later, another of Emily's cases, a boy named Diego (Alexander Conti), suddenly murders his parents, and Barron informs Emily that somebody phoned Diego from her house the night before the crime. As she is suspected of involvement in the incident, Lillith undergoes a psychiatric evaluation by Emily's best friend, Douglas J. Ames (Bradley Cooper). During the session, however, Lillith turns the evaluation around, asking Douglas what his fears are and subtly threatening him. That night after receiving a strange phone call, Douglas is panicked by a mass of hornets coming out of his body in hysteria and kills himself in his bathroom.\nEmily gradually becomes fearful of Lillith, so she heads to the mental asylum for answers from Lillith's parents. They tell her that, far from being truly human, Lillith is actually a demon (like Lilith the Succubus) who feeds on emotion, and that they had tried to kill her in an attempt to save themselves. Lillith's father tells Emily that the only way to kill Lillith is to get her to sleep. Shortly after Emily leaves the asylum, Lillith's mother hallucinates being on fire, and her father is stabbed in the eye after attacking a fellow inmate through whom the voice of Lillith spoke. Barron initially thinks Emily should seek psychiatric help, but is later convinced when he receives a strange phone call in his home from Lillith. He arms himself to help Emily. However, he inadvertently shoots himself in the head with a shotgun, killing himself as a result, when Lilith makes him imagine he is being attacked by dogs.\nAfter realizing that her closest colleagues have been eliminated, and that the rest of her cases will be next, Emily serves Lillith tea spiked with sedative. While Lillith is asleep, Emily sets fire to her house, hoping to get rid of her. However, the girl apparently escapes unharmed (from this point on, the audience may wonder whether Lilith is really present or Emily is hallucinating her presence). A police officer escorts Emily and Lillith to a temporary place to sleep. As Emily is following the police cars, she suddenly takes a different route and drives her car at a high speed, hoping to bring fear to Lillith. Instead, Lillith forces Emily to relive her childhood memory of her mother driving fast in a rainstorm. Emily fights through the memory, telling herself that it is not real. The image fades, and Lillith appears scared by the fact that Emily was able to fight through her illusion.\nEmily drives the car off a pier. As the car sinks, Emily struggles to lock Lillith (now in her demonic true form) in the trunk. Emily then attempts to swim to the surface. However, the demon grabs Emily's foot to stop her swim away. Emily struggles and eventually breaks free as a trapped Lillith sinks to the bottom. Emily climbs atop the pier and tries to recover from the ordeal."}