{"title": "Cellular", "full_text": "CELLULAR\n              by\n         Larry Cohen\n\n\n\n\n\n\n         Revised by\n        Chris Morgan\n\n\n\n\n\n\n     Current Revisions by\nJ. Mackye Gruber & Eric Bress\n\n\n\n\n\n\n\n\n                                July 16, 2003\n\n\n\nTITLES OVER YELLOW BACKGROUND.\nWe PULL BACK to reveal we're looking at THE SUN. In the\ndistance lie the gorgeous San Gabriel Mountains and the\nDowntown Los Angeles skyline.\nIn ONE LONG TRACKING SHOT, we CRANE PAST some trees to reveal\nthe vast expansive homes scattered in the hills of Brentwood.\nHOMEOWNERS walk dogs, a PAPERBOY chucks papers fr9m a\ngleaming mountain bike... It's early in the morning, and the\nlandscapers haven't come with their leaf blowers yet.\nCONTINUE BOOMING DOWN to road level to face    the resplendent\nMartin residence. We STEADICAM down the fr    ont walk, able to\nadmire the manicured hedges and the black E   scalade in the\ndriveway, to the front door decorated with    a whimsical\nplacard that reads, \"The Martins\" -- and we    pass THROUGH THE\nKEYHOLE into the foyer.\n\nINT. JESSICA'S HOUSE - MORNING\nWe TRACK through the living room, passing framed photos of an\nathletic eleven year old boy, and we hear a WOMAN'S VOICE as\nshe comes down the stairs with a GOLDEN RETRIEVER at her\nside.\n\n                     WOMAN\n               (into phone)\n          Yes Donna, I'm out the door.\nWe TRACK over the Woman's shoulder and follow her into the\nkitchen, unable to see her face.\n\n                     WOMAN (CONT'D)\n          Just inform Kayleigh that\n          anesthesia is on the way to prep\n          the epidural and I'll be there as\n          soon as I can.\nStill looking over her shoulder, we watch her absently\nstraighten a PHOTOGRAPH of her son on the fridge as she\ntalks.\n\n                    WOMAN (CONT'D)\n          And promise her she's about to have\n          a woooonnderful labor.\nAs the woman pours herself a fresh cup of coffee, her\nHOUSEKEEPER enters the kitchen with a full laundry basket.\nThey give each other a silent wave.\n\n                    WOMAN (CONT'D)\n          Right, I'll see you in twenty.\nShe hangs up her cordless and takes a breath as we COME\nAROUND to finally REVEAL JESSICA MARTIN; slightly weary, but\nready for the day ahead.\n\n                     JESSICA\n          Buenas dias, Rosario.\n\n\n\n                      ROSARIO\n           Good morning Miss Jessica.\nJessica sees her answering machine blinking, hits PLAY.\nIn the background, a cheerful Rosario enters frame and heads\nfor the back door carrying the basket of laundry.\n\n                 MALE VOICE\n           (on machine)\n           Honey? Honey, wake up.   Pick up the-\nAnd as she brings the coffee cup to her lips--\nSLAMM!! The door EXPLODES open and a squad of FIVE GUNMEN\nstorm in, wearing SKI-MASKS. Everything is a whirlwind of\nquick cuts, noise and confusion.\nJessica's DOG starts to lunge at the men and -- thup! -- is\nstilled by a silenced pistol before its second bark.\nRosario runs for the ALARM SYSTEM --\n\n                     LEAD GUNMAN\n          Get away from there! Don't touch\n          that -- !!\n-- but as she reaches out for the PANIC BUTTON -- BLAM!!     He\nblows her away, too. The Gunman curses, then turns on\nJessica.\n\n                 LEAD GUNMAN (CONT'D)\n          (dire)\n          Where is he?\nJessica cringes.\n\n                     JESSICA\n          Where is who?\n\n                     LEAD GUNMAN\n          Wrong answer.\nThe bastard hauls back and -- WHAM I -- punches her in the\nface, knocking Jessica cold.\nThen he turns to his men.\n\n                     LEAD GUNMAN (CONT'D)\n          Search the house.\nAnd as the answering machine fills the silence:\n\n                CRAIG VO\n          (on machine)\n          -I'll call back later.\nThe LEAD GUNMAN spins around, and we PUSH INTO the blackness\nof his masked face.\n\n                                            MATCH CUT TO:\n\n\n\nEXT. KIDNAPPERS' SAFEHOUSE - DAY\nThe BLACKNESS of a BLACK VAN and ESCALADE passing below us.\nWe quickly CRANE DOWN to see the vehicles traveling through:\nAn IRON GATE at the edge of an aband9ned property. They\nbounce down a long lonely driveway lined with barren trees--\nANGLE ON: THE KIDNAPPERS' VAN as it arrives at its\ndestination; an isolated HOUSE in the Hills. The grass is\ndead. The trees are dead. It's the kind of place you could\nscream for a week and no one would hear a thing.\nAs the van stops--\n\n                                     WE PUSH INTO ITS DOORS:\n\nINT. DARKENED ATTIC - KIDNAPPERS' SAFEHOUSE\nA door CRASHES open. Light slices through the dark revealing\nthe dusty, skeletal interior. Jessica is hurled into the\nroom and falls to the floor. With bound hands, she\nfrantically pulls her blindfold off to see--\n\nTHE LEAD SKI-MASKED KIDNAPPER\nStanding in front of her.    Sturdier than the rest.   Solid.\nImposing.\n\n                     JESSICA\n          Wh... what do you want?\nUnsettlingly, the Kidnapper says nothing, staring at her.\nJessica tries to remain calm under his angry gaze...\nThen suddenly, the Kidnapper turns and exits the room.\nJessica breathes a sigh of relief...but it catches in her\nthroat as he returns ten seconds later -- with a BASEBALL BAT.\nGrim as death, he stalks toward her --\n\n                       JESSICA (CONT'D)\n          No, wait..\nAnd reaching.her, he hauls back and SWINGS --\n\n                     JESSICA (CONT'D)\n\n          NO!   PLEASE--//\nSMASH! The bat connects with a wooden beam an inch above\nJessica's head, OBLITERATING the ROTARY DIAL TELEPHONE that\nhung there.\nAs phone guts shower down on her, the Lead Kidnapper turns\nand stomps away, slamming the attic door shut and locking\nJessica in the darkness.\nOnly now that they're gone does Jessica allow her fear to\nshow through. Trembling, tears running down her face,\nJessica finally breaks down, pleading to the empty attic--\n\n\n\n                       JESSICA (CONT'D)\n            Wha... what the hell is happening?!\nThe attic's suffocating silence is the only answer she gets.\n\n                                            DISSOLVE TO:\n\nTHE OCEAN\nSkimming along the water.\nAnd we TILT UP to reveal the majestic beaches of Southern\nCalifornia, and at the center of it all, the SANTA MONICA\n\nPIER.\n\nEXT. SANTA MONICA PIER - MORNING - ESTABLISHING\nIt would be a typical day, except for that some PEOPLE are\npreparing for a \"HEAL THE BAY\" rally at the end of the pier.\nVENDORS set up, preparing for the daily grind ahead.\nBIKERS gather around a bad-ass HELLCAT G2 CONFEDERATE\nMOTORCYCLE and admire its cutting-edge design.\nHOT CHICKS in bikinis try on sunglasses at a stand.\nFISHERMEN crack beers while awaiting the next bite.\n\nINT. SANTA MONICA PIER - ARCADE - MORNING\n\nANGLE ON - ARCADE GAME SCREEN.\nThe screen displays a car-race arcade game. A computer\ngenerated hot-rod passes other racers at breakneck speed.\nPlaying the sit-down game, DAYTONA USA, is:\nRYAN ACKERMAN, early twenties, looks like he grew up on the\nbeach without so much as a pot to piss in. His lethal\nreflexes and bold recklessness, however, have made him a Jedi\nMaster of the game.\nRyan's score approaches the HIGH SCORE at the top of the\nscreen.\n\n                       RYAN\n            You recording this?\n\n                       CHAD (OS)\n            Yeah, sure...\nCHAD, his best bud, aims a BLUE TOOTH VIDEOSTREAMING\nCELLPHONE at some CUTE GIRLS instead. We can see their faces\non the tiny SCREEN of the cellphone.\nRyan's car gets caught behind a blue speedster, then passes\non the shoulder.\n\n\n\n                       RYAN\n            Move, bitch.\nHe gets an EXTENDED PLAY and the screen flashes \"NEW RECORD.\"\nNearby, a KID watching the game nods.\n\n                        KID\n            Nice.\nThe HIGH SCORE starts rising to match Ryan's score.\n\n                        RYAN\n            Get that?\nRyan turns around to see Chad has shoved the cellphone down\nthe front of his tattered shorts. And he's freeballing it.\n\n                       CHAD\n            Check it; Attack of the Bubblegum\n            Monster in Hi-Def videostream-\n\n                      RYAN\n            C'mon Chad, I gotta put my mouth on\n            that.\nHolding a cup of soda between his teeth, Chad pulls the\ncellphone out of his pants and hits \"SEND\".\n\n                        CHAD\n                 (through cup-holding\n                  teeth)\n            Sweet. It's going to my email\n            right now.\nS9me soda inadvertently SPILLS onto the cellphone and Chad\nwipes it dry on his pants.\n\n                       RYAN\n            Watch it dude, I gotta return that\n            thing in seven days.\n\n                       CHAD\n            They aren't giving you shit yet?\n\n                       RYAN\n            Nah, whenever I return it, I just\n            list off why the phone sucks and\n            they give me a new model. Figure\n            by the tenth time I'll have to go\n            somewhere else.\nRyan's car finally CRASHES in a wall of flames.       Game Over.\n\n                                            CUT TO:\n\nTHE OCEAN\nAs seen looking over the rail of the pier.      The tide is in,\nbut it's still a forty foot drop.\n\n\nRYAN stares over the railing like a death row inmate\ncontemplating his last meal.\n\n                      CHAD\n           Go already. No one's looking.\nHis left hand holds his WALLET.\n\n                 CHAD (CONT'D)\n           (re: wallet)\n           Need me to hold that?\nRyan sticks it in the pocket of his surfer shorts -- he zips\na zipper, tucks a Velcro flap. Pats his pocket proudly.\n\n                     RYAN\n          Waterproof.\nBut as soon as Ryan covertly CLIMBS ONTO THE RAIL, his left\nleg starts trembling like crazy.\n\n                     RYAN (CONT'D)\n          This is stupid. I could get\n          killed. Pick another dare.\nChad lowers the phone, irritated.\n\n                     CHAD\n          My ass. Not after you made me\n          march in the Gay Pride Parade\n          wearing a thong.\n\n                     RYAN\n          Screw it then. In one... Two...\n          Two and a half--\n\n                     CHAD\n          Whole numbers only, Rabbitfoot.\nRyan stares at the waves crashing below. His leg starts\nsnaking like crazy... And he chickens out, hopping back to\nthe deck.\n\n                    CHAD (CONT'D)\n          Just so you know, I'm emailing this\n          to every chick you ever met.\nBut suddenly Ryan's oblivious to the dare.   His eyes are\nglued to something else--\n\n                CHAD (CONT'D)\n          (speaking like HAL 900)\n          Transmitting pussy file now.\nCHLOE, early 20s, a head turner, confident, funny; she can\npull you in like a tractor beam. She and some CUTE FRIENDS\ncarry heavy cardboard boxes toward a table set up for the\n\"Heal The Bay\" rally.\nRyan walks over like he owns the place.\n\n\n\n                      RYAN\n           Got any more? I'm here to help.\n\n                      CHLOE\n           Thanks, but no, we got 'em all.\n\n                      RYAN\n           What's in 'em?\nChloe opens the box.    Hands him a \"Heal The Bay\" pamphlet.\n\n                      RYAN (CONT'D)\n           Cool, you're handing these out\n           during the concert?\n\n                     CHLOE\n          Yeah, wanna help?\nRyan tries to ignore his thundering heart.\n\n                       RYAN\n          Hell yeah.     I'm all about \"Heal the\n          Bay. \"\nHis eyes ricochet off the pamphlet in his hand.\n\n                     RYAN (CONT'D)\n          Me an Chad do the monthly cleanup\n          thing, of course...\nAn awesome wing-man, Chad appears over Chloe's shoulder,\npretending to read a pamphlet, but really holding it up so\nRyan can see it. Piece of cake, now.\n\n                     RYAN (CONT'D)\n          We've collected water samples with\n          the Stream Team, raised money on\n          the Promenade... I'm surprised I\n          haven't seen you.\nHe offers his hand.\n\n                       RYAN (CONT'D)\n          Ryan.\nShe takes it.\n\n                       CHLOE\n          Chloe.\nThe handshake lingers a second longer than necessary, and\nthey both smile at each other. Chad splits.\n\n                     CHLOE (CONT'D)\n          I can't tell if you're full of it.\nRyan stops posturing, gets real.\n\n                     RYAN\n          You ever go up to Santa Barbara?\n          My dad used to take me there all\n\n\n\n                      RYAN (CONT'D)\n           the time. Their pier is amazing,\n           clear water, huge crabs everywhere,\n           oysters right there on the rocks,\n           starfish... Hard to believe it's\n           the same ocean sometimes.\nHe's managed to win her back.\n\n                     CHLOE\n           Maybe you and I can take a break\n           later when Pat Benatar goes on.\n\n                      RYAN\n           Sounds like a plan.\nThere's a moment...     Then --\n\n                     CHLOE\n          Oh no -- I forgot. I still have to\n          pick up a box of T-shirts at the\n          Kinkos on Venice.\n\n                     RYAN\n           I'll do it for you... if you want.\n\n                    CHLOE\n          Seriously, you would?\n\n                       RYAN\n          Sure.     How much is the bill?\n\n                       CHLOE\n          Nothing.    It's been paid up front.\n\n                    RYAN\n          Do you promise not to go anywhere?\n\n                       CHLOE\n          Done.\nRyan makes a graceful exit.       Turns back.\n\n                     RYAN\n          Okay, I won't be long.\n\n                CHLOE\n          (laughing)\n          Bye.\nRyan grabs Chad, and as they walk out of earshot:\n\n                    RYAN\n          Dude, does Santa Barbara have a\n          harbor or a pier?\n\n                                                CUT TO:\n\nEXT. VENICE - DAY\nA short time later, Ryan cruises through a Venice\nneighborhood.\n\n\nRyan drives an early 70's Ford Bronco; clothes are strewn\nacross the backseat, and a box of \"Heal the Bay\" T-SHIRTS now\nsits on the shotgun seat.\nRyan reaches into the glove box and pulls out a toothbrush.\nHe sips warm soda from a bottle and begins brushing.\nChecking himself out in the mirror, he sniffs his pits, whoa,\nand grabs the cellphone.\n\n                      RYAN\n                (into phone)\n           Dex, wassup? You won't believe the\n           hotties I just met at the pier.\n           Smoking. You wanna meet them?\n           Yeah? Well don't get too excited\n           'cause I need my money.\nRyan stops at a red light.\n\n                      RYAN (CONT'D)\n           Bullshit, you're not going\n           anywhere,\n                (quickly adding)\n           I'm pulling up right now.\nSome AMBULANCES SPEED BY, SIRENS BLARING.   It's deafening.\nRyan lays on the horn.   When the light changes, Ryan peels\naway angrily.\n\n                    RYAN (CONT'D)\n              (covering his ear)\n          What? Yeah, you better be. And I\n          need your shower, I'm talkin' code\n          red stankage-\nThe CELLPHONE begins to CRACKLE with STATIC just as Ryan\ndrives under an OVERPASS.\nSuddenly --\nThe car ahead of him STOPS in the middle of the street. Ryan\nnotices too late and has to jam on the brakes. The car\nskids, he SCREAMS... and comes to a stop an inch before\nhitting the other car's bumper.\nHe lifts the phone receiver to his ear but the call is WASHED\n\nWITH STATIC.\n\n                RYAN (CONT'D)\n          (into phone)\n          Dex? You still there...?\nAnd as has happened to all of us, he loses the call.\n\n                    RYAN (CONT'D)\n          Damn.\n\nEXT. HIGHWAY OVERPASS - MOMENTS LATER                           10\nAs traffic resumes and Ryan clears the overpass--\n\n\nID                                                                   iu\n\n\n\n\n\n     SFX:   THE CELLPHONE RINGS.\n     Ryan picks up the phone.\n\n                           RYAN\n                Sorry, got cut off.      Hey -- what's\n                my Caller ID say?\n     But there's no voice on the other end, only shuffling sounds.\n\n                             RYAN (CONT'D)\n                Yo Dex...?\n\n                                                   MATCH CUT TO:\n\n11   INT. KIDNAPPERS' ATTIC                                          11\n\n     ECU - A TANGLE OF PHONE WIRES\n12   Their insulation picked off and spliced together. PAN ALONG 12\n     the attic floor, past the rubble of the shattered phone,\n     foll9wing the crudely repaired wires to JESSICA'S HANDS,\n     tapping the dialer wires together. She's trying so hard to\n     simulate a NUMERIC PULSE that she almost doesn't hear:\n\n                             RYAN (VO)\n                Hello...?\n     Jessica's hands go suddenly still, then -- WHOOM! -- her head\n     slams down INTO FRAME on top of the crushed earpiece, a\n     desperate hope filling her eyes.\n\n                                                   CUT BACK TO:\n\n13   INT. FORD BRONCO - CONTINUOUS                                   13\n     With still no answer, Ryan pulls the phone from his ear --\n\n                             RYAN\n                Whatever.    Signing off-\n     -- and is just about to hit END CALL when he hears a tiny\n     female voice on the other end.\n\n                            JESSICA (VO)\n                Wait!    Don't hang up!\n     Ryan puts the phone back to his ear.\n\n                             RYAN\n                Hello?\n\n                           JESSICA (VO)\n                There's not much time! I need you\n                to go to the police. My name is\n                Jessica Martin; I've been kidnapped!\n\n                           RYAN\n                     (not buying)\n                Oh really? Kidnapped, huh?\n\n\n13                                                                          j.j\n\n\n\n\n\n                             JESSICA (VO)\n                  Please. I know what you're\n                  thinking, but it's real! I'm in an\n                  attic somewhere. I think they're\n                  going to kill me! You need to-\n\n                             RYAN\n                  Awfully polite kidnappers to give\n                  you a phone...\n     Jessica's voice TREMBLES uncontrollably.        Desperate, fearful\n     and frustrated.\n\n                              JESSICA (VO)\n                  No!   You don't understand!\n     Suddenly, the cellphone BLIPS twice in Ryan's ear.          He pulls\n     it away and looks at its faceplate.\n\n14   INSERT SHOT - THE CELLPHONE                                            14\n     The LCD reads:     CALL WAITING.   ACCEPT?\n\n15   EXT. SURFACE STREETS - DAY                                             15\n\n                             RYAN\n                  If you were really in trouble, you\n                  would've called the cops, not me.\n                  Now I've got a real call on the\n                  other line--\n\n                                                    MATCH CUT TO:\n\n16   INT. ATTIC                                                             16\n     A WIDER SHOT so we see Jessica's bound hands. Her bruised\n     face. Whispering frantically into the DEMOLISHED TELEPHONE\n     she's JERI-RIGGING back together as she talks.\n\n                             JESSICA (VO)\n                  Goddamn it, listen to me! The\n                  phone I'm on...it's shattered!\n                  There's no dialer! I've been\n                  clicking wires together for hours\n                  trying to get someone, anyone, and\n                  you 're the only connection I was\n                  able to make!\n                       (important beat)\n                  If you hang up, I may not get\n                  anyone else.\n\n17   INTERCUT CALL - RYAN IN FORD BRONCO/JESSICA BOUND IN ATTIC             17\n     SFX: Ryan's call waiting BLIPS again.        He considers\n     everything Jessica has said, then:\n\n                            RYAN\n                  Hmm. Sucks to be you. Try crank\n                  yanking someone else. Late.\n\n\n\n17\n\n\n\n\n\n                               JESSICA\n                  Wait!     Don't hang up!    DON'T HANG UP!!\n     But -- CLICK!       Ryan flashes over to the next call.\n\n                               RYAN\n                  Dex?\n\n                                                      MATCH CUT TO:\n\n18   INT. TELEMARKET BULLPEN - DAY                                    18\n     A TELEMARKETER checks Ryan's name on a list, then glances at\n     the script.\n\n                            TELEMARKETER\n                 Hello, Mr. Ackerman. My name is\n                 Mark and I'd like to discuss with\n                 you the benefits of Mastercharge\n                 Credit Union's-\n\n                           RYAN (VO)\n                 Awesome, I can totally use a credit\n                 card. Tell me more.\n\n                               TELEMARKETER\n                 Absolutely.     We've lowered our APR-\n\n                           RYAN\n                 -Shucks, now's really not a good\n                 time, but why don't I get your\n                 number and get back to you later.\n\n                            TELEMARKETER\n                 Sure, it's 818...\n\n                           RYAN\n                 That's the office number?\n\n                              TELEMARKETER\n                 Yes.\n\n                            RYAN\n                 Why don't you give me your number\n                 instead. That way I can call you\n                 when you're having dinner with your\n                 family.\n     A beat.\n\n                            TELEMARKETER\n                 Sorry to have bothered you.\n     Click!    The Telemarketer hangs up.\n\n                            RYAN\n                 Damn skippy.\n     And that's when he notices the message flashing on the\n     phone's faceplate: CALL ON HOLD. Ryan clicks the FLASH\n     button to pick it up...and Jessica is still there.\n\n\n\nINTERCUT CALL - RYAN IN CAR/JESSICA IN ATTIC                    19\n\n                      JESSICA (VO)\n           --an you hear me?!\n\n                     RYAN\n           You still there? You're getting\n           kinda creepy, lady. See ya.\n\n                       JESSICA\n          No!    Don't! They're going to kill\n          me!    They're going to kill me!!\nA silent beat.   A calculated look in her eyes...\nRYAN pulls the phone from his ear and is about to hang\nup...when he hears the one sound that stops all men cold.\nOn the other end, Jessica begins to CRY.\n\n                    RYAN\n          Oh, it's like that, huh?     Nice with\n          the fake tears, lady...\n\n                      JESSICA\n          Please...   I just need help.\nBut Ryan won't be manipulated.\n\n                    RYAN\n          You need acting lessons. Now go take\n          your meds and bug someone else.\n\n                    JESSICA\n          These men!!!--\nJessica stops herself short, quieting the rising hysteria in\nher voice before it gives her away. She glances anxiously at\nthe attic door, then continues, more in control.\n\n                     JESSICA (CONT'D)\n          These men killed my housekeeper.\n          My dog. You have to help me.\nRyan bristles at being saddled with anything, much less this.\n\n                    RYAN\n          No, actually( I don't. Not with a\n          hot chick waiting for me at the\n          pier.\n\n                      JESSICA\n          Please...you're my only hope.\n               (beat)\n          What's your name?\nThat catches Ryan off-guard.   He stalls, not wanting to make\nthis personal.\n\n                     RYAN\n          Why, you writing a book--?\n\n\n19                                                                  x?\n\n\n\n\n\n                           JESSICA\n                --Please, just tell me your name!\n     Ryan glances around the street, his eyes falling on a stone\n     fountain outside a French Restaurant.\n\n                           RYAN\n                Uh...Johnny. Johnny Fountain.\n\n                           JESSICA\n                Johnny... What if it was your\n                mother who was calling for help?\n                How would you feel?\n\n                           RYAN\n                Well, I'd be damn impressed,\n                considering she's dead.\n\n                           JESSICA\n                Goddamn it, how difficult is it to\n                hand this phone off to the police?!\n                I'll pay you!\n\n                           RYAN\n               How much?\n\n                          JESSICA\n               Five thousand dollars.\n\n                          RYAN\n               Sure you will. I'm hanging up now.\n\n                          JESSICA\n               No, wait! WAIT!! Even if there's\n               a eighty percent chance I'm lying,\n               you nave a one in five chance to\n               make five grand f9r a lousy twenty\n               minutes of your life.\n                    (panics as Ryan is silent)\n               Haven't you ever bet on a horse or\n               bought a Lottery ticket? I'm\n               talking one-in-five odds, twenty\n               minutes.\n     Ryan slaps the radio off.\n\n                          RYAN\n               What do you want me to do?\n\n                                                CUT TO:\n\n20   INT. 15TH PRECINCT - STATION DESK - DAY                        20\n\n     SOMEONE'S POV.\n     In EXTREME SLOW-MOTION, chaos unfolds around us like a\n     nightmare --\n     OFFICERS manhandle a drunk toward the back, a HOOKER screams\n     at us with unholy rage, in the far corner, a JUNKIE spits on\n\n\n\n20                                                                     ^\n\n\n     an OFFICER'S FACE and there's a lethal race for disinfectant\n     through invisible soup.\n     Sounds are distant, eerily muffled.      A HIGH-PITCHED WHINE\n     lets us know we're in hell.\n     CLOSE UP:    BOB MOONEY'S EYES.    Concerned, but not panicked.\n     MOONEY'S POV. Still surreal, SLOW-MOTION, as an Officer with\n     a CREWCUT responds by spinning the Junkie's face into a wall,\n     legal but hard.\n     SFX:   A HEARTBEAT.    OURS.    FAST... And possibly IRREGULAR?\n     CLOSE UP - SLOW MOTION - The RIGHT THUMB presses into the\n\n     LEFT WRIST.\n     MOONEY'S EYES.      Watching.   Counting... Suddenly --\n     WHAM!! Back to reality when a YOUNG GANGBANGER is slammed\n     into the station desk by a ROOKIE.\n\n                            ROOKIE OFFICER\n                 Problem, Mooney. If I put this one\n                 in with the others, there's gonna\n                 be a bloodbath.\n\n                            GANGBANGER\n                 Put me in there! I'll waste all\n                 them pussies!\n     REVEAL SERGEANT BOB MOONEY -- a tough, fifty-something beat\n     cop who's fighting growing old every step of the way. He\n     rolls his eyes at the situation and takes a bite of PIZZA.\n\n                            MOONEY\n                 Come on Powell, put the Sharks with\n                 the Sharks, the Jets with the Jets\n                 and make room.\n     Rookie Powell suppresses his irritation and roughly yanks the\n     Gangbanger back over to the holding cells.\n     Mooney puts down the pizza, no appetite, and stares at the\n     news story playing on the TV mounted in the corner.\n\n21   ON THE TELEVISION                                                 21\n     a NEWS REPORTER is in the middle of a segment. Over him,\n     FOOTAGE rolls of six guilty-looking cops testifying in court;\n     being led away in handcuffs.\n\n                            NEWS REPORTER\n                 ...was somber when the indictments\n                 came down this afternoon in the\n                 23rd Precinct corruption scandal.\n                 Though the names of six police\n                 officers were read aloud, the\n                 District Attorney stated that this\n                 was merely the \"tip of the iceberg\"\n                 and that unfortunately many other\n                 arrests are likely to be coming as\n                 the investigations proceed.\n\n\n\n'2    BACK TO POLICE STATION                                      22\n     As DETECTIVE JACK TOMLIN passes Mooney, he nods toward the TV.\n\n                           DETECTIVE TOMLIN\n                Sucks for the fellas at the Two-\n                Three right now, huh?\n\n                          MOONEY\n                Dirty pricks deserve what they get.\n                Public hates us enough without this\n                shit.\n\n                      DETECTIVE TOMLIN\n                (leaving)\n                There's good men over there.\n     A FEMALE OFFICER passes Mooney and reaches for his box of\n     pizza.\n\n                          FEMALE OFFICER\n               Mooney? What are you doing?      You can't\n               be eating this crap.\n     Mooney plants his own firm grip on the box.\n\n                         MOONEY\n               Keep walking, Shelly.   Nothing to\n               see here.\n     A friendly tug of war.\n\n                          FEMALE OFFICER\n               You sure you wanna do that?     What\n               would your wife say?\n     That's it. Mooney snatches his lunch back and turns to\n     lecture this little girl.\n\n                          MOONEY\n               She'd say nothing, 'cause she's not\n               gonna know about it! Christ, Shel,\n               my old man had eleven heart\n               attacks. Eleven! I have one\n               little infarction and you guys\n               start treating me like an invalid!\n               I'm a grown man! Leave me alone,\n               will you?!\n\n                          FEMALE OFFICER\n                    (abashed)\n               I was merely referring to your\n               cottage-cheese ass.\n     Mooney sighs and lifts his pizza to his mouth when --\n     WHAMM! The station doors burst open and two dozen GANG\n     MEMBERS are bum-rushed into the room by a squad of COPS in\n     riot gear. The screaming is deafening.\n\n\n\n                                                               17.\n\n22                                                                   22\n\n\n\n\n\n                           MOONEY\n                I hate this place.\n\n                                               CUT TO:\n\n23   EXT. 15TH PRECINCT - CONTINUOUS                                 23\n     The Ford Bronco roars up; snags the handicapped spot. Ryan\n     hops out and limps theatrically the first few steps until\n     he's far enough away from the car to start running.\n\n                          RYAN\n                    (into phone)\n               I'm here.\n\n24   INT. 15TH PRECINCT - CONTINUOUS                                 24\n     Cops try to wrangle the dozens of shouting GANG MEMBERS who\n     cram the Station Desk, waiting to be booked.\n     Ryan takes a deep breath and shoves his way through the\n     mayhem to the extremely shorthanded Station Desk where:\n\n     MOONEY\n     is busy doing ten things at once. Signing release papers.\n     Booking a DRUNK whose wife-beater Tee is drenched in blood,\n     Etc.\n\n                         RYAN\n               Excuse me, officer --\n     But Mooney ignores him in favor of the three cops that\n     suddenly need arrest sheets signed.\n\n                         RYAN (CONT'D)\n               Hey, I've got an emergency here --\n     Just then, CREWCUT OFFICER shoulders his way through with a\n     cuffed CRACKHEAD TRANNIE in tow. The Trannie's wrists ache.\n\n                          CRACKHEAD TRANNIE\n               Loosen these, man, please?! Jus'\n               gimme a chance--\n\n                         CREWCUT OFFICER\n               Hey, Moon! Where do you want me to\n               put Whitney Houston?\n\n                          MOONEY\n               Christ, I've only got two hands here!\n               Stick him in the can, will ya?\n     Crewcut nods and moves off towards the bathroom.\n\n                          RYAN\n                    (shoving forward)\n               Come on, man! I've got some lady\n               on the phone here who says she's\n               been kidnapped!\n\n\n\n                                                                     18.\n\n24                                                                         24\n\n\n     Ryan holds up the phone.         Mooney looks around.\n\n                           MOONEY\n                Nice try, kid, but I got no time\n                for pranks.\n\n                           RYAN\n                Seriously, a lady was murdered!\n\n                          MOONEY\n                Which is it, a kidnapping or a\n                murder?\n\n                           RYAN\n                Take the phone and find out moron!\n     A COP snickers somewhere.\n\n                                                     MATCH CUT TO:\n\n25   INT. KIDNAPPERS' ATTIC                                                25\n     Jessica holds her breath. She stares apprehensively at the\n     attic door, praying for Mooney to just take the damn phone.\n\n                             JESSICA\n               Please. . .\n\n6    BACK TO POLICE STATION                                                26\n     Ryan looks sincere.     Mooney deliberates, then sighs.\n\n                           MOONEY\n               Okay.   Give it here.\n     Ryan thrusts the phone at him, happy to get rid of it.\n\n                          JESSICA (VO)\n                    (barely audible whisper)\n               Oh thank God! You've got to help\n               me. My name's Jessica Martin and\n               I've been kidnapped. This morning\n               five men broke into my home in\n               Brentwood and kidnapped--\n     Mooney strains to hear.     His eyes go wide and he quickly jots\n     notes on a pad.\n     Mooney's eyes shift as three TWEAKERS, wide eyed and sweating\n     profusely, are led inside by their ARRESTING OFFICERS.\n\n                             MOONEY\n               Ah shit.\n     Mooney holds out the phone.\n\n                          MOONEY (CONT'D)\n               Hurry kid, take this upstairs to\n               Robbery/Homicide and ask for\n               Detective Tomlin.\n\n\n\n                                                              19.\n\n26                                                                  26\n\n\n\n\n     Ryan reluctantly takes the phone back as more people converge\n     on the Station Desk.\n\n27   INT. KIDNAPPERS' ATTIC                                          27\n     Jessica hears the phone being shuffled around.\n\n                             RYAN (VO)\n                Where?\n\n                            JESSICA\n                Hello?    Officer? Hello?!\n\n28   BACK TO POLICE STATION                                          28\n     Mooney, recognizing an emergency when he hears one, ignores\n     the incoming CROWD him long enough to assist Ryan.\n\n                          MOONEY\n               Up the stairs, Tomlin!\n     Ryan turns away, and as he returns the cellphone to his ear,\n     he's startled to hear--\n\n                     JESSICA (VO)\n               (terrified)\n               Oh my God...\n\n                         RYAN\n               What? What is it?\n\n                                                   CUT TO:\n\n29   INT. KIDNAPPERS' ATTIC                                          29\n     Jessica hears:\n\n     SFX: FOOTSTEPS.     RIGHT OUTSIDE HER DOOR.\n\n                          RYAN (VO)\n               Lady, what's going on?!\n     Jessica drops the phone. Has just enough time to shove it\n     behind her before -- SLAM! -- the attic door swings open and\n     two of the masked kidnappers stride in. When they reach her,\n     they stand silently, trying to unnerve her.\n\n                         LEAD KIDNAPPER\n               Where's your husband?\n\n                            JESSICA\n               What?     I don't-\n     The masked leader SLAPS HER SHARPLY across the face! Jessica\n     wants to collapse to the ground, but remains sitting TO KEEP\n     THE PHONE HIDDEN behind her.\n     The Leader bends down and yells right in her face.\n\n\n\n                                                                     20.\n\n29                                                                         29\n\n\n\n\n\n                           LEAD KIDNAPPER\n                 Where is he!?\n\n                              JESSICA\n                 At work!     Why, what do you want--?\n      SLAP!!!   This one's even nastier than the first.\n\n                              LEAD KIDNAPPER\n\n                 NEGATIVE!    WHERE WOULD HE RUN?!\n\n                                                     MATCH CUT TO:\n\n30    RYAN - IN THE POLICE STATION STAIRWELL                               30\n      Phone to his ear. Wide-eyed. Hearing it all.         For the first\n      time, starting to believe Jessica's story.\n\n                              RYAN\n                 Oh shit...\n      Panicking, Ryan turns and walks, then jogs, then all-out runs\n      for the station stairwell.\n\n                                                     CUT BACK TO:\n\n 31   INT. KIDNAPPERS' ATTIC                                               31\n-v\n      The Lead Kidnapper stands ominously over the trembling\n      Jessica -- Oh God! Does he see the phone cord?\n\n                           JESSICA\n                 Please, he should be at work!\n                 That's all I know.\n      The Leader nods, then turns away. Jessica exhales with\n      relief that he didn't spot the phone. But her victory is\n      short-lived as:\n\n                              LEAD KIDNAPPER\n                You have a little boy, right? Ricky?\n                The Wyman School in Westwood?\n      Jessica gasps like a sledgehammer just hit her in the chest.\n\n                              JESSICA\n\n                NO! NO--.'.' STAY AWAY FROM MY SON!\n\n                LEAVE HIM ALONE!!\n      But -- the men silently head out the door -- SLAM!       The door\n      locks. Jessica scrambles back to the phone.\n\n                              JESSICA (CONT'D)\n                Johnny!!\n\n32    INTERCUT CALL - RYAN RUNNING UP STAIRWELL/JESSICA IN ATTIC           32\n\n\n\n                            RYAN\n                I know.    I'm trying to get help.\n\n\n\n                                                               21.\n\n32                                                                   32\n\n\n\n\n\n                            JESSICA\n                My son --\n     Suddenly, as Ryan reaches the first landing -- STATIC starts\n     breaking up the call.\n\n                     JESSICA (CONT'D)\n               (worried)\n               Oh my God! What's happening?!\n\n                         RYAN\n               It's just static. I'm running\n               upstairs to the detectives. Hold\n               on, I might lose you for a sec--\n\n                          JESSICA (VO)\n                    (realizing)\n               No, don't! Stop. You can't lose\n               me--\n\n                          RYAN\n                    (still running)\n               Wait, we're almost there.\n\n                         JESSICA\n                   (panics, losing her cool)\n               Stop! Johnny, goddamn it, stop!\n\n               STOP! IF YOU LOSE ME, I'M DEAD!!\n     Hearing her fearful tone, Ryan stops reluctantly.\n\n                         RYAN\n               Well, what the hell am I supposed\n               to do?!\n     Ryan looks at himself, standing on the stairs like an idiot.\n\n                           RYAN (CONT'D)\n               Jesus!   I'm almost there!\n     Ryan checks the SIGNAL STRENGTH INDICATOR on the phone.\n     There's only one bar left. Defiantly, Ryan takes a step\n     UP...and the bar DISAPPEARS. He quickly hops BACK DOWN.\n\n                          RYAN (CONT'D)\n               Crap!\n                    (shouts up stairs)\n\n               HELLO? DETECTIVE TOMLIN! WILL\n\n               SOMEONE GET TOMLIN FOR ME, PLEASE?!\n     There's no response.   Ryan can't believe this.\n\n                         RYAN (CONT'D)\n               You're shitting me.\n\n                          JESSICA\n               Johnny, what time is it?! Johnny!\n\n                          RYAN\n               (checking his watch)\n               Who? Oh -- one-twenty.\n\n               (MORE)\n\n\n\n                                                                   22.\n\n32                                                                       32\n\n                      RYAN (CONT'D)\n                (yells upstairs)\n\n                IS ANYONE UP THERE?!\n     Jessica calms herself, resolving to save her child's life.\n\n                          JESSICA\n                Johnny, listen to me. My son's\n                school lets out at 1:45.\n\n                          RYAN\n                Good, then if I get a cop--\n     Ryan exits the stairwell to find Mooney -- but Mooney's not\n     there anymore! There's some NEW GUY -- and he's SWAMPED!\n\n                         JESSICA\n                No. There's not enough time. You\n                have to pick him up before they--\n\n                          RYAN\n               Pick him up? Hell no, lady!     I\n               ain't goin' nowhere else--\n     Ryan tries to get the NEW GUY's attention, in a dream.\n\n                          JESSICA\n               Please please stop standing there!\n               He 's just a little boy!\n\n                          RYAN\n               But I'm in a police station!\n\n                          JESSICA\n               Go!\n     Ryan grunts in frustration.\n\n                                                   SMASH CUT TO:\n\n33   EXT. 15TH PRECINCT - MOMENTS LATER                                   33\n     ECU - THE FORD BRONCO'S TIRES -- Burning rubber...\n\n                                                   CUT TO:\n\n34   INT. KIDNAPPERS' SAFEHOUSE - GROUND FLOOR - LIVING ROOM             34\n     The furniture in this abandoned house is all covered with\n     sheets giving the entire place a creepy, haunted feel.\n     FOLLOW the LEAD KIDNAPPER as he descends a nearby stairwell\n     and pulls off his mask--\n\n     REVEAL GREER\n     Forties, salt and pepper hair.    He looks to his crew:\n\n     THE KIDNAPPERS\n\n\n\n                                                                 23.\n\n34                                                                     34\n\n\n\n\n     They're all trim. Athletic. In good shape. They're\n     UNMASKED, watching the TV with interest. The news on the\n     corruption scandal.\n     Greer snaps the TV off.     Checks his watch and nods grimly.\n\n                          GREEK\n               Go get the kid.\n     Instantly, a hulk of a man (DEASON) and an arrogant, red-\n     headed prick (ELLIS) stand and exit the house.\n     As Greer stalks away( BOOM DOWN the bar to REVEAL a telephone\n     sitting there, unnoticed by the men -- and on its face, the\n     LINE-IN-USE INDICATOR LIGHT is lit.\n     PUSH IN on the flashing orange light that threatens to give\n     Ryan and Jessica's call away. Closer and closer, until we\n     ENTER the phone and TRAVEL THROUGH THE WIRES to --\n\n35   A MATCHING LIGHT ON RYAN'S CELLPHONE                              35\n     As we PULL BACK we see that we're in the Ford Bronco, racing\n     through:\n\n36   EXT. CITY STREETS - DAY                                           36\n     Ryan guns the engine as Jessica panics on the other end of\n     the phone. We can hear her hyperventilating.\n\n\\\n\n\n\n                          JESSICA (VO)\n               Where are you now?!\n\n                          RYAN\n               I just got off the 405.\n\n                          JESSICA (VO)\n               You've got to go faster, Johnny!\n\n                          RYAN\n               You've gotta chill! You're\n               stressing the crap out of me!\n                   (looking around)\n               Where the hell is a cop hiding in a\n               speed trap when you need one?\n     Ryan takes a hard right, tires squealing.    Pushing it against\n     his better judgment.\n\n                          RYAN (CONT'D)\n               What do these guys want, anyway?\n\n                          JESSICA (VO)\n               How should I know?!\n\n                          RYAN\n               What do you do?\n\n                          JESSICA\n               I'm an obstetrician. They don't\n               want anything from me.\n\n\n\n                                                                  24.\n\n36                                                                      36\n\n\n     Ryan slaloms around other cars like a racecar driver.\n\n                          RYAN\n                So your husband's like, uber-rich?\n\n                          JESSICA (VO)\n                What--? No. He's an accountant.\n                I make more money than he does.\n\n                           RYAN\n                Could they've mistaken you for\n                someone else?\n\n                           JESSICA\n                No! I don't know.    None of this\n                makes any sense.\n     Jessica starts losing it completely, upsetting Ryan so much\n     that he takes the next corner too fast and -- SKKRRASH! --\n\n37   EXT. ROAD CONSTRUCTION - CONTINUOUS                                37\n     The BRONCO EXPLODES through an orange-and-white \"ROAD CLOSED\"\n\n     CONSTRUCTION BARRIER!\n     And dead ahead is a CONSTRUCTION CREW resurfacing the road!\n\n                          RYAN\n               Oh...SHIT!!\n     Ryan SLAMS on the brakes and SWERVES to avoid hitting a group\n     of workers -- and OBLITERATES THE BRONCO'S PASSENGER SIDE\n     MIRROR against another BARRIER --\n     Ryan cringes with every muscle!\n     And the mirror ricochets off the ground -- and smashes\n     through the windshield of a recently waxed Acura Legend!\n\n                     RYAN (CONT'D)\n               (smirking)\n               ...Ain't that a bitch.\n     As the heavily-muscled workers start running to beat the shit\n     out of him, Ryan floors the gas, sending a shower of wet\n     asphalt all over the cursing workers as he peels away,\n     CRASHING through a FINAL BARRIER.\n     More cautiously, Ryan rounds the next corner and --\n\n                         RYAN (CONT'D)\n               There's the school.\n     Ryan's right.   Just ahead, we see:\n\n38   EXT. THE WYMAN SCHOOL - DAY                                        38\n\n\n        private prep school for boys. Ryan pull: A private prep\n       it. Walks quickly toward the building.    school for\n                                                 boys. Ryan\n     pulls over and hops\n     out,\n\n\n\n\n\n                                                                  25.\n\n38                                                                      38\n\n\n\n\n\n                           RYAN\n                Okay, I'm here.\n\n                           JESSICA (VO)\n                How much time do we have?\n     Ryan checks his watch.     It reads:   \"1:40 PM\".   He enters.\n\n                          RYAN\n               Five minutes. What's your kid's name?\n\n                            JESSICA (VO)\n               Ricky.\n\n                          RYAN\n               Ricky what?\n\n                            JESSICA\n               Martin.\n\n                          RYAN\n               Ricky Martin? You named your kid\n               Ricky Martin?! Why didn't you\n               tattoo \"kick me\" on his ass while\n               you were at it?\n\n                         JESSICA\n               He was named before the singer ever-\n\n                            RYAN\n               Forget it.     What does he look like?\n\n                          JESSICA (VO)\n               He's eight years old. Blonde hair.\n               Green eyes. Small for his age.\n               He's wearing a light blue shirt and\n               dark blue pants--\n\n                         RYAN\n               They're all wearing blue shirts and\n               pants!\n     Ryan turns down a hallway and we see that he's right.      It's\n     filled with IDENTICALLY-UNIFORMED LITTLE BOYS.\n     As a TIMID BLONDE BOY passes in front of him, Ryan grabs him\n     and wheels him around.\n\n                         RYAN (CONT'D)\n               Ricky Martin?\n     The Boy's eyes get huge.     He tries to pull away.\n\n                          TIMID BOY\n               Don't touch me!\n\n                          RYAN\n               No, kid, it's okay!    I didn't mean\n               to--\n\n\n\n                                                                26.\n\n38                                                                    38\n\n\n\n\n\n                            TIMID BOY\n                Help!   Don't touch me!   Don't touch!!\n     Ryan quickly moves on... aware that other ADULTS are now\n     beginning to take notice of him.\n\n                          RYAN (INTO PHONE)\n                Does he have anything else? A\n                jacket? A backpack? What's his\n                lunch box look like?\n\n                           JESSICA (VO)\n                I don't remember.\n\n                           RYAN\n                You don't remember your own kid's\n                lunch box?!\n\n                          JESSICA\n               I don't pack it! Rosario, our\n               housekeeper does! Sometimes Craig,\n               but...\n     Jessica begins to sob, which causes Ryan to panic further.\n\n                          RYAN\n               Ricky Martin, where are you!?\n     None of the Stepford kids respond.\n\n                     JESSICA (VO)\n               (through tears)\n               I wish I could give you more.\n     Now Ryan's running.    He yells into a BATHROOM.\n\n                         RYAN\n               Ricky Martin?\n\n                         MALE VOICE (OS)\n               Can I help you, sir?\n     Ryan turns to see a MUSCULAR GYM TEACHER looming there.\n     Clearly, the guy thinks Ryan's peeping into the boys' room.\n\n                          RYAN\n               I'm looking for a little blond boy--\n                    (off his shocked look)\n               --No, no! Not like that!\n\n                          GYM TEACHER\n               Sir, come with me, please!\n     Ryan isn't going anywhere. And that's when the BELL RINGS.\n     Like a nightmare, HUNDREDS OF UNIFORMED LITTLE BOYS come\n     racing out of their classes.\n\n                            RYAN\n               Oh shit...\n\n\n\n                                                                27.\n\n38                                                                    38\n\n\n     As the boys stampede by, Ryan yanks the WHISTLE from around\n     the Gym Teacher's thick neck and starts blowing it like\n     crazy.\n\n                           GYM TEACHER\n\n               HEY--11\n\n                           RYAN\n\n               RICKY MARTIN! DOES ANYONE KNOW\n               WHERE RICKY MARTIN IS?1 I can't\n               believe I'm yelling this at an all-\n               boys school.\n     All hell is breaking loose. The kids ignore him. The huge\n     Gym Teacher races after him. Jessica yells in his ear.\n\n                          JESSICA (VO)\n               Was that the bell? Was that the\n               bell?!\n\n                            RYAN\n               Yes.    RICKY! RICKY MARTIN!!\n     Ryan wades through the sea of uniforms.\n\n                         JESSICA (VO)\n               He'11 go to the parents' pick-up\n               spot. Oh God, they're going to get\n               him!\n\n\"\\\n     Ryan turns around and starts bulling through.    The Gym\n     Teacher violently grabs his arm and yanks--\n\n                          GYM TEACHER\n               Where do you think you're going?\n     --causing the phone to fly out of Ryan's hand and --crack!--\n     hit the pavement.\n\n                           RYAN\n               No--!\n     Ryan tugs his arm free and races to the phone.   The LCD\n     display GLASS is cracked into a SPIDERWEB.\n\n                     RYAN (CONT'D)\n               (desperate into phone)\n               Jessica? You still there?!\n\n                           JESSICA (VO)\n               Yes?\n     Relieved, Ryan turns and races for the front of the school.\n\n                          RYAN\n               No one's gonna get your kid!    He's\n               not slow, is he?\n\n                           JESSICA (VO)\n               What--?   No!\n\n\n\n                                                                28.\n\n38                                                                    38\n\n\n\n\n\n                          RYAN\n               Then he won't go anywhere with\n               strangers.\n\n                          JESSICA (VO)\n               Unless they have our Escalade. Ricky'11\n               think it's Rosario and hop right in!\n     She's got a point. Ryan picks up the pace and arrives at the\n     pick-up spot. Scans the lot.\n\n                         RYAN\n               What color?\n\n                          JESSICA\n               Black!\n\n                     RYAN\n               (looks)\n               Of course it is.\n     PAN AROUND to see what Ryan sees -- three black Cadillac\n     Escalades.\n\n                         RYAN (CONT'D)\n               There's three of them.    What's your\n               plate?\n\n                          JESSICA (VO)\n               4..7..wait, no...3 -- Oh my God, I\n               don't remember!\n\n                         RYAN\n               Like you don't remember the lunch\n               box? Or anything else about your\n               kid--\n                    (stops, realizing)\n               Oh, man. This is a prank, isn't\n               it?\n\n                         JESSICA (VO)\n               No!\n\n                         RYAN\n               Bullshit! Oh, you're good lady.\n               Your friends too. Getting me to\n               scream out 'Ricky Martin' at a boys\n               school. Damn, you really nailed\n               me.\n\n                         JESSICA (VO)\n               No--\n\n\n               This is great, the police think I'm\n               a whack job. The school thinks I'm\n               some kind of perv child molester.\n               I'll probably get the Herpes from\n               the gym teacher's whistle --\n\n\n\n                                                              29.\n\n38                                                                   38\n\n\n\n\n\n                            JESSICA (VO)\n                No, Johnny, you have to listen to\n                me-- /.'\n     But Ryan's had enough.     He turns to leave --\n\n                          RYAN\n               I'm done being your entertainment for\n               the day. I'm going back to the pier\n               while I still have a chance --\n     -- and passes right by a blonde-haired, green-eyed, EIGHT-\n     YEAR-OLD BOY carrying a Lord of the Rings lunchbox. Ryan\n     hesitates and is about to stop the kid...but then decides\n     \"screw it\", and keeps on hoofing.\n     Ryan rounds a corner to leave -- and is confronted by the Gym\n     Teacher and a RENT-A-COP SECURITY GUARD.\n\n                          GYM TEACHER\n               Here he is! He's the one that's\n               been stalking the students.\n\n                            RYAN\n               Stalking?!     No, I can explain--\n     The Rent-a-Cop mumbles into his walkie.\n\n                          RENT-A-COP #1\n               Okay, we got him. We're at the\n               front of the school.\n                    (then, to Ryan)\n               Sir, come with us.\n\n                         RYAN\n                   (as they grab him)\n               Hey, HEY RENT-A-DUDE--!!    Hang on a\n               sec! This is a huuuge\n               misunderstanding--\n     A little RENT-A-COP CAR (think geeky, wanna-be cop car) pulls\n     up in the driveway below. The Security Guard starts forcibly\n     leading Ryan toward it, but as he gets close--\n\n                          JESSICA (VO)\n                    (interrupting)\n               Lord of the Rings! I forgot his\n               father bought him a Lord of the\n               Rings lunchbox last week!\n     Ryan's heart stops in his chest. He turns to see the Boy\n     with the Lord or the Rings lunchbox racing down the school\n     steps and up to one of the waiting Escalades.\n\n                         RYAN\n                   (struggling)\n\n               RICKY MARTIN!!\n     The Boy opens the car door...but turns as he hears his name\n     called. For the briefest moment, Ricky and Ryan lock eyes--\n\n\n\n\n\n                                                        [CONTINUED)\n\n\n\n                                                                    30.\n\n    38                                                                    38\n\n\n         --and that's when a HAND reaches out, snags his backpack and\n         YANKS Ricky into the dark of the car! Instantly, the door\n         slams shut and the Escalade begins to take off.\n         WHIP PAN to Ryan's shocked reaction. He's the only one who's\n         seen it. He tries to struggle free of the Guard.\n\n                                 RYAN (CONT'D)\n                    Oh shit!    You just see that?!\n         Losing control of Ryan, the Rent-a-Cop calls to his partner\n         in the car.\n\n                               RENT-A-COP #1\n                    Roy, some help over here!\n         Below, the Escalade is leaving the driveway.\n\n                              RYAN\n                        (struggling harder)\n                   Goddamn it, that little kid was\n                   just kidnapped!! Do something!!\n\n                                RENT-A-COP #1\n                   Roy--! !\n         The second Rent-a-Cop, hops out of his car and runs over, but\n         as he gets near -- Ryan breaks free!\n\n^\n\n                                RENT-A-COPS\n\n                   HEY--! !\n         They chase after him, but Ryan hops over the hood of the\n         idling RENT-A-COP CAR and throws himself into its driver's\n         seat.\n         Rent-a-Cop #1 reaches through the open window and grabs\n         Ryan's collar -- and is dragged twenty feet as Ryan throws\n         the little car in gear and burns away.\n\n39       INT. RENT-A-COP CAR - RACING DOWN A RESIDENTIAL STREET           39\n         Trying to catch the Escalade, a quarter-mile ahead. Ryan\n         feels completely conspicuous in the security car as he\n         slaloms through the streets of East Hollywood.\n\n                              JESSICA (VO)\n                   What's happening, Ryan?!\n\n                              RYAN\n                   Don't worry, I can fix this.\n\n                                JESSICA (VO)\n                   Oh my God.\n         There are three cars between Ryan and the Escalade.\n\n                             RYAN\n                   It's okay, I can see them ahead.\n\n\n\n                                                                    31.\n\n39                                                                        39\n\n\n\n                             JESSICA (VO)\n                  Don't lose them! If you follow them\n                  back here, you can tell the police\n                  where they're holding us!\n\n                              RYAN\n                  Okay.\n\n                                                    CUT TO:\n\n40    INT. THE KIDNAPPERS' ESCALADE                                       40\n     The mountainous Deason drives as Ellis sits shotgun. In the\n     back sits Jessica's son, RICKY; who eyes the two men\n     suspiciously. CCR plays on the RADIO.\n      Ellis, turns down the radio.       Faking sincerity, he turns to\n      face Ricky.\n\n                             ELLIS\n                       (gesturing to the radio)\n                  Do you want me to change the\n                  station to something else?\n     Ricky refuses to answer.        Ellis turns around, his fake smile\n     quickly vanishing.\n\n                              ELLIS (CONT'D)\n                  Yeah.   I like Creedence too.\n     He's about to turn the radio volume up when --\n\n                             RICKY\n                  Where's Rosario?\n\n                             ELLIS\n                  I told you, kid, she had a doctor's\n                  appointment, so your mother asked\n                  us to pick you up. Don't worry,\n                  you'll see your mommy in a few\n                  minutes.\n     Ricky nods... but we can tell by the look on his face that\n     he's not buying their story one bit.\n\n                                                    CUT BACK TO:\n\n41   EXT. RENT-A-COP CAR                                                  41\n     Cautiously, so as not to give himself away, Ryan PASSES one\n     commuter car. Then the next. Narrowing the gap between the\n     rent-a-cop car and the Escalade to one last auto.\n     It takes Ryan literally standing on the gas pedal to get up\n     enough speed to get around the final car. Now the Escalade\n     is dead ahead. Ryan begins gently closing the distance\n     between them, and is just starting to relax, when--\n\n     A CITY BUS\n     merges into traffic from a Bus Stop right ahead of him!\n\n\n\n                                                                  32.\n\n41                                                                        41\n\n\n\n\n\n                              RYAN\n\n                 SHIT!\n       Ryan SLAMS on his breaks and is forced to crawl along at a\n ainful 25 m.p.h.. Worse, he has his view of the Escalade\nglocked by the bus' titanic silver ass.\n\n                              JESSICA (VO)\n                Johnny!\n\n                             RYAN\n                Damn!     There's this stupid bus--\n      Ryan jags left and right, catching glimpses around the bus of\n      the Escalade still ahead.\n\n                      RYAN (CONT'D)\n                (taps his horn)\n                Come on!\n      But the bus doesn't pull over. Ryan tries flashing the\n      security car's CLEAR BUBBLE LIGHTS on the roof, but who the\n      hell would pull over for that? The bus sure doesn't.\n\n                             RYAN (CONT'D)\n                Jesus.'\n\n                           JESSICA (VO)\n                Can't you go around it?\n      There's an ungodly amount of opposing traffic--\n      But suddenly there's    a break in the  flow! Seizing the\n      moment, Ryan SLAM-SH   IFTS the rent-a -cop car's uni-cylinder\n      engine into gear and    starts to tear  around the bus -- but has\n      to SWERVE BACK as a    SPEEDING TRASH  TRUCK rounds a bend and\n      almost creams him!\n\n                           RYAN\n                Goddamn it!\n\n                             JESSICA (VO)\n                What?!    Did you lose him? !\n\n                           RYAN\n                No, I just almost got killed, is\n                all.\n\n                           JESSICA\n                Oh thank God!\n\n                           RYAN\n                Thank God?\n                     (irritated)\n                That's nice.\n     Just then, the bus signals that it's pulling over.\n\n                           RYAN (CONT'D)\n                Hey, here we go!\n\n\n\n                                                                 33.\n\n41                                                                     41\n\n\n     As the bus pulls aside, Ryan floors the wanna-be cop car\n     around it...but directly in front of him is a HOMELESS MAN,\n     dressed like a sheik, dragging his caravan of TWO COVERED\n\n     SHOPPING CARTS.\n\n                             RYAN (CONT'D)\n\n                SON- OF- A-- II\n     Ryan SLAMS on    the brakes, SWERVES HARD to avoid a collision --\n     and loses cont   rol of the car! The rent-a-cop car goes POWER\n     SLIDING across    oncoming traffic, HORNS BLARING AT HIM and\n     heads straight    for a the FLOOR TO CEILING WINDOW of a CAR\n\n     DEALERSHIP.\n\n42   INT. CAR DEALERSHIP                                               42\n     SMASH!!! The car goes through the window and RACES down the\n     center aisle. CAR SALESMEN and PATRONS are forced to dive\n     out of the way as the rent-a-cop car MOWS DOWN DISPLAYS and\n     everything else in its path.\n\n                                                 CUT TO:\n\n43   INT. THE KIDNAPPERS' ESCALADE                                     43\n     The mountainous Deason drives. In back, Ellis sits with\n     Jessica's son, RICKY, who eyes the two men suspiciously.\n     CREEDENCE CLEARWATER REVIVAL plays on the RADIO.\n\n                          ELLIS\n                    (to Deason)\n               Anyone following us?\n     Deason checks:\n\n     THE REARVIEW MIRROR\n     We see the bus about five car lengths behind, but the rent-a-\n     cop car is nowhere to be seen.\n     Deason flashes an evil grin.\n\n                            DEASON\n               Nan.\n\n                                                 CUT BACK TO:\n\n44   EXT. CAR DEALERSHIP                                               44\n     The rent-a-cop car exits the dealership, SMASHING through\n     another GLASS WINDOW!\n     Ryan quickly regains control of the car and steers it back on\n     the street. Only to find that the Escalade has disappeared!\n\n                          JESSICA (VO)\n               What's happening?! Are you okay?!\n\n                           RYAN\n\n               SHIT I\n\n\n\n                                                                34.\n\n44                                                                    44\n\n\n\n                            JESSICA (VO)\n                What?!    Yo u lost--\n\n                            RYAN\n                No, No!    just give me a second--\n     As Jessica goes off, Ryan tosses the phone down and focuses\n     on finding the Escalade. He floors the rent-a-cop car, engine\n     CLATTERING, to the intersection.\n     Ryan franticly searches in every direction, but the Escalade\n     is nowhere to be seen. He floors it.\n\n                            RYAN (CONT'D)\n                Jesus!    Where the hell did they go?\n     Dreading talking to Jessica, Ryan slowly picks up the\n     receiver.\n\n                         RYAN (CONT'D)\n               Jessica, I--\n\n                          JESSICA (VO)\n               You let them get away.\n     Ryan wants to snap at her, but guilt crushes it right out of\n     him. He knows she's right.\n\n                                                 DISSOLVE TO:\nj    INT. 15TH PRECINCT - LOCKER ROOM - DAY                           45\n     Mooney changes out of his blues, his ears glued to THREE COPS\n     in the corner, boasting about an arrest.\n\n                         COP ONE\n               -- so of course everyone's playing\n               dumb to what kind of drugs he's on.\n     The cops start to snicker; they've all heard that one before.\n\n                          COP ONE (CONT'D)\n               So I start searching the place.\n               I'm about to open a closet door\n               when a kid with a Mac 10 jumps out\n               of the bathroom. He shoots.\n               Misses me and hits one of the\n               E.M.T's. Fires again, but the gun\n               jams and BAM! Blows half his face\n               off. Had enough black tar heroin\n               in the closet to resurface the 405.\n     Mooney tries to join in on the conversation.\n\n                         MOONEY\n               It must've been around '84, when...\n     The Cops turn around, while grabbing their stuff.\n\n\n\n                                                                 35.\n\n45                                                                     45\n\n\n\n                          COP TWO\n               Sorry Moon, we're late for a\n               briefing.\n     Mooney waves them on, but looks disappointed for not being\n     able to join in.\n\n                         DEEP MALE VOICE (O.S.)\n               I'll bet in your day you had some\n               stories.\n     Mooney whips his head around to see DETECTIVE JACK TOMLIN.\n\n                          MOONEY\n               Hey Tomlin.\n\n                         DETECTIVE TOMLIN\n               Taking off?\n\n                           MOONEY\n                    (hardly thrilled)\n               My anniversary. You know, duty\n               calls; pricey dinner and then some\n               crap-ass play.\n                    (beat)\n               Hey, I sent some college kid down\n               to see you this morning. Had some\n               rap about a kidnapping --\n\n                         DETECTIVE TOMLIN\n               I haven't seen anyone, but I'll ask\n               around. Kidnapping, huh?\n\n                          MOONEY\n               I thought it was a prank at first,\n               but the kid was so worked up--\n\n                          DETECTIVE TOMLIN\n               Well, don't you get worked up.\n                    (slaps Mooney's chest)\n               If the kid comes back, page me, and\n               I'll be sure to see him.\n\n                          MOONEY\n                    (swallowing his pride)\n               Yeah. Okay, Jack. Thanks.\n     And as Tomlin walks off --\n\n                                              CUT TO:\n\n46   INT. RENT-A-COP CAR - CHUGGING THROUGH WEST L.A.                  46\n     Ryan lead-foots the gas. The speedometer climbs.   Forty.\n     Fifty. Sixty miles an hour.\n\n                         JESSICA (VO)\n               Look, Johnny, you've got to go back\n               to the cops--\n\n\n\n                                                                        36.\n\n46                                                                            46\n\n\n\n\n\n                            RYAN\n                 Are you high?! I just jacked a car!\n\n                            JESSICA (VO)\n                 Goddamn it, stop thinking about\n                 just yourself! You can explain\n                 everything to them later!\n\n     SUDDENLY -- SFX: RYAN'S PHONE BEGINS BEEPING.\n\n\n\n                              RYAN\n                 What now?\n     Ryan pulls the phone away from his ear and checks it out.\n\n     INSERT SHOT - CELLPHONE FACE PLATE\n     The BATTERY INDICATOR is flashing:         LOW BATT.   LOW BATT.\n\n                             RYAN (CONT'D)\n                 Great!   Now the battery's dying.\n\n                           JESSICA\n                Don't you have a charger?\n\n                           RYAN\n                It's in my car!      Hold on.\n     SFX:   BEEP-BEEP!    The battery indicator has lost another bar.\n     Ryan fumbles around in the armrest. Finds nothing. Opens\n     the glovebox and -- a snub-nosed .38 SPECIAL tumbles out.\n\n                              RYAN (CONT'D)\n                Jesus -- !\n\n                           JESSICA\n                What's going on? Did you find one?\n\n                           RYAN\n                     (staring at the gun)\n                Not exactly...\n     SFX:   BEEP-BEEP!!     Jessica starts growing afraid.\n\n                           JESSICA\n                Johnny, don't lose me!\n\n                          RYAN\n                Well what the hell do you expect me\n                to do?!\n     Just then, Ryan rounds a corner -- and sees traffic GRIDLOCKED\n     to a halt ahead. He tries to maneuver around it, but is\n     almost immediately boxed in.\n\n     SFX:   BEEP-BEEP-BEEP!\n\n                              JESSICA\n                Johnny--!\n\n\n\n                                                              37.\n\n46                                                                   46\n\n\n\n                            RYAN\n                 I know, Jessica!\n     The phone starts a STEADY BEEPING now, dying imminent. And\n     traffic isn't going anywhere. Ryan looks around desperately.\n     Nothing. No emergency lane. No shoulder. Just a long drop\n     down a HILL to a strip mall below--\n     STRIP MALL?! Ryan scans it and does a double-take on one of\n     the store's signs: \"VERIZON WIRELESS\".\n     Traffic inches forward. Now he sees an OFF-RAMP a quarter-\n     mile ahead -- but at this rate, it'll take forever to make it\n     there.\n\n     SFX:   BEEP-BEEP-BEEP...'.'\n     Ryan's got to do something.      Now.\n\n                            RYAN (CONT'D)\n                 You know that money you promised me?\n\n                            JESSICA (VO)\n                 Yes.\n\n                            RYAN\n                 I'm giving myself a raise.\n\n47   EXT. VERIZON MALL HILL - CONTINUOUS                             47\n     And with that, Ryan CRANKS the steering wheel hard right and\n     HITS THE GAS!   Despite other drivers' protests, the little\n     Rent-a-Cop vehicle blasts across the gridlock, TEARS through\n     the rusty GUARD RAIL and -- VROOOOM! -- flies off the side of\n     the hill!\n     Ryan lets out a frightened yell as he SAILS through the clear\n     blue sky.\n\n                          RYAN\n\n                HOOOOLLYYY SHIIII--\n     THUMP! The Rent-a-Cop car touches down on a steep downslope.\n     Ryan struggles to control the bucking automobile,\n     miraculously avoiding the minefield of ROCKS and TREE STUMPS.\n     He needs both hands for the job and holds the phone by its\n     antenna in his teeth.\n     There's so much noise, the only thing Jessica could possibly\n     hear is a CACOPHONY OF NOISE and Ryan HYPERVENTILATING.\n\n                           JESSICA (VO)\n                What's going on?!\n\n                           RYAN\n                     (with phone in teeth)\n                mmmrrmph mrm mrmph!\n     Ryan is bounced around like a corn kernel in a popper until\n     the car hits a jutting rock and -- WHOOOOM! -- goes up on two\n     wheels. It looks like it's going to roll but gravity brings\n\n\n\n                                                               38.\n\n47                                                                   47\n     it back down -- SLAMM! -- so hard that the phone goes flying\n     across the car!\n\n                             RYAN (CONT'D)\n                Shit!\n     Ryan scrabbles for the phone -- but gives it up when he\n     bounces over a rise and sees A BILLBOARD DEAD AHEAD!\n\n                             RYAN (CONT'D)\n\n                WHOAAAAAA!\n     Ryan whips the wheel and navigates the little car between the\n     billboard's concrete posts, but -- WHAM! -- obliterates the\n     rent-a-cop's BUBBLE LIGHTS on the billboard's lower edge.\n     Somehow, Ryan muscles the bucking econocar safely down the\n     rest of the hill and into the strip mall parking lot, where\n     it SKIDS OUT.\n\n                      RYAN (CONT'D)\n                (grabbing phone)\n                Jessica?! Can you hear me?!\n\n                             JESSICA (VO)\n                I'm here!\n     Ryan hops out and races inside--\n\n48   THE VERIZON WIRELESS STORE - CONTINUOUS                         48\n     And of course, they're having a sale and the place is packed.\n     Every SALESPERSON is beyond busy in the feeding frenzy.\n\n     SFX:   BEEP-BEEP-BEEP!!\n     Panicking, Ryan pushes his way to the front of the counter --\n\n                           IRATE CUSTOMERS\n                Hey, what do you think you're\n                doing? There's a line!\n     -- to the OVERLY-PERKY SALESMAN helping someone else.\n\n                           OVERLY-PERKY SALESMAN\n                ..and if you get the new Nokia\n                9200, you can switch out faceplates\n                to match your mood! And we have a\n                special today on tiger stripes...\n                Are you feeling fierce?\n     The salesman makes a playful paw swipe with his hand.\n\n                           EASILY-EXCITABLE CUSTOMER\n                Oh, how fun!\n\n                         RYAN\n                Excuse me--\n\n                           OVERLY-PERKY SALESMAN\n                I'm sorry, sir, I'm with a customer\n                now.\n\n                           (MORE)\n\n\n\n                                                                    39.\n\n48                                                                        48\n\n                             OVERLY-PERKY SALESMAN (CONT'D)\n                       (indicates a number\n                       dispenser)\n                  But if you take a number, someone\n                  will be with you shortly.\n       Ryan glances at the dispenser. A BIG YELLOW SMILEY FACE with\n       tickets ejected from the mouth. The next ticket it offers is\n       \"#97\"...and the Now-Serving Display on the wall reads \"#71\".\n\n       SFX:   BEEP-BEEP-BEEP!I\n       Just then, a BUSY SALESWOMAN walks by.     Ryan grabs her.\n\n                               RYAN\n                  Hey! Hey!      I've got an emergency\n                  here --\n\n                            BUSY SALESWOMAN\n                  Sorry, I'm on break--\n\n                             RYAN\n                  Damn it, will you listen to me?!\n                  I've got a life and death call on\n                  this phone and my battery's dying!\n                  Do you have a charger?\n\n                             BUSY SALESMAN\n                  Sure.\n                       (walks away)\n                  Take a number and one of the sales\n                  associates will grab you one when\n                  your turn comes up.\n\n_/ -\n\n\n\n                               RYAN\n                  Bu t-- !\n\n       SFX:   BEEP-BEEP-BEEP-BEEP!!!\n       Ryan breaks out in a cold sweat. Can't catch his breath. As\n       a SALESWOMAN rushes by, Ryan reaches for her.\n\n                               RYAN (CONT'D)\n                  Help, I --\n\n                             SALESWOMAN\n                  Take a number.\n       The room starts spinning around him. It's clear no one's\n       going to help him. Like the clap of doom, the NOW-SERVING\n       DISPLAY on the wall flips happily to \"#72\"\n\n       SFX:   BEEP-BEEP-BEEP-BEEP!!!\n\n\n       Frantic, Ryan glances at the phone. And just as the last\n       BATTERY BAR on the power indicator FLICKERS and DISAPPEARS --\n\n                             RYAN\n                  Aw, screw this...\n       -- Ryan pulls the rent-a-cop's big .38 SPECIAL from his\n       pocket and BLOWS THE SMILEY FACE DISPENSER TO DUST!\n\n\n\n                                                                   40.\n\n48                                                                       48\n\n\n     Instantly, people hit the dirt.\n\n                            RYAN (CONT'D)\n                Oh look! Now serving thirty eight\n                special!\n                     (beat)\n\n                NOW WHO'S GONNA GET ME THAT GODDAMN\n\n                CHARGER?\n\n                                                 CUT TO:\n\n49   EXT. POLICE STATION - PARKING BAY                                   49\n\n                                         \\\n\n\n\n\n     Mooney exits the mayhem of the s   tation and walks to a SQUAD\n     CAR. Gets in. As he pulls his      seatbelt on, something\n     CRINKLES in his breast pocket.     He pulls it out -- the SCRAP\n     OF PAPER where the scribbled the    words \"JESSICA MARTIN\" and\n     \"BRENTWOOD\" when Ryan handed him    the phone.\n     Mooney crumples the paper and is about to throw it away...but\n     stops himself. He stares at the words, then unable to let it\n     go, punches keys on the MOBILE DATA TERMINAL. A name and\n     address appear on the screen:\n\n     JESSICA KATE MARTIN.   327 ELMWOOD ESTATES, BRENTWOOD.\n\n\n     Mooney stares at the name. Then, after a moment, he sighs\n     and pulls a LA LAKERS cellphone from his coat. Dials.\n\n                         MOONEY\n               Hi, honey. Yeah, I'm gonna be a\n               few minutes late...\n     And as Mooney closes the door and starts up the engine--\n\n                                                 CUT TO:\n\n50   INT. JESSICA'S LIVING ROOM - DAY                                    50\n     We PAN PAST PHOTOGRAPHS of Jessica's family over to-\n     AN ANSWERING MACHINE RINGS... ANSWERS.    We hear Jessica's\n     outgoing message, then a BEEP and-\n\n                           MALE VOICE\n                    (over machine)\n               Jessica? Damn, where are you?\n                    (beat)\n               I called earlier and... Jess, I'm\n               in serious trouble. I can't explain\n               right now, but we're all in danger.\n               Please, just grab Ricky and meet me\n               in left field.\n     PAN UP to an ATTRACTIVE WOMAN listening to the machine.\n\n                                                CUT TO:\n\n\n\n                                                                 41.\n\n\n\n\n\n\n\n51   INT. RENT-A-COP CAR - RACING OFF THROUGH THE CITY                 51\n     Just as the phone literally dies -- Ryan rips a new CHARGER\n     from its packaging, slaps it into the phone and voila, it\n     begins CHARGING.\n\n                            RYAN\n                Whew!   That was so no bueno!\n\n                          JESSICA (VO)\n                You found a charger?\n\n                          RYAN\n               Among other things...\n     Ryan glances at piles of phone gear he's appropriated from\n     Verizon. EARBUD MIKES. MANUALS. RECEPTION BOOSTERS.\n\n52   INTERCUT CALL - RYAN IN CAR/JESSICA IN ATTIC                      52\n     Ryan fiddles with the now war-torn phone.\n\n                          JESSICA\n               Thank you for doing all this,\n               Johnny.\n\n                          RYAN\n               Yeah, look, about that...\n                    (awkward beat)\n               My-name isn't really Johnny\n               Fountain.\n\n                          JESSICA\n               Good, it sounded like a porn star\n               name.\n                    (then softly)\n               It's okay. I know. You don't have\n               to tell me --\n\n                          RYAN\n               It's Ryan. Ryan Ackerman. I'm a\n               bar-back. I'm twenty-two, and just\n               a little freaked out right now.\n     Jessica is moved with emotion by his honesty.\n\n                          JESSICA\n               Thank you, Ryan.\n     But before they can say any more, suddenly--\n\n     SFX: FEET ON THE STAIRS - COMING TOWARD THE ATTIC!\n     Jessica JUMPS with a start. Tries to push the PHONE GUTS\n     behind a beam with her foot as Greer enters -- but fails.\n     The receiver sits in front of the beam, EXPOSED!\n     Greer crosses the room and sits on a box next to Jessica.    He\n     stares at her for long, uncomfortable moments. Then:\n\n\n\n                                                                     42.\n\n52                                                                         52\n\n\n\n\n\n                           GREEK\n                Do you want to die here?\n     Jessica drains white -- Does he see the phone?!\n\n                                                    CUT BACK TO:\n\n53   RYAN - IN THE RENT-A-COP CAR                                          53\n     Slams on the brakes and skids up to the curb.      Covers the\n     mouthpiece.\n\n                           RYAN\n                Oh shit!\n\n54   BACK TO ATTIC                                                         54\n     Greer's question still hangs in the air.\n\n                           JESSICA\n               N-no...\n     Jessica scoots away, trying to draw Greer's eyes in another\n     direction from the phone that lies OUT IN THE OPEN.\n\n                          JESSICA (CONT'D)\n                ...but I am going to, aren't I?\n\n                          GREER\n               Up to you. Your husband left a\n               message asking you to meet him in\n               left field. Where's that?\n\n\n\n                           JESSICA\n               What?   I don't understand--?\n     Greer winds up and BAM! Hits Jessica in the stomach, knocking\n     the wind out of her and causing her to fall to the ground.\n\n                           GREER\n               --A base ball field !? Wh ich o ne\n               does he mean?!\n\n                           JESSICA\n                    (choking out the words)\n               I... I don't know what you want me\n               to say. I swear--\n\n                          GREER\n               Shut up!!! Which field?! He\n               wouldn't leave a message that\n               didn't make sense to you!\n     Greer tightens his fist and is about to hit Jessica again--\n\n                          JESSICA\n               Wait! The bleachers behind left\n               field at Dodger Stadium! That's\n               where we first met.\n\n\n\n                                                                 43.\n\n54                                                                     54\n\n\n      Greer stares at Jessica for a long uncomfortable moment,\n      searching her soul. She's lying.\n\n                             JESSICA (CONT'D)\n                  Please! Believe me. That has to\n                  be where he means. I swear to God.\n     Then he stands, looking away for just a moment -- but long\n     enough for Jessica to NUDGE the phone back behind the beam!\n\n                            GREER\n                  Working in my profession as long as\n                  I have, you begin to recognize the\n                  truth when you hear it.\n     Jessica, trembling, hangs on Greer's every word.\n\n                            GREER (CONT'D)\n                      (turning back)\n                  Go to the window, Jessica. There's\n                  something I want you to see.\n     Relieved at hiding the phone, Jessica gets up and moves to\n     the attic window -- and GASPS.\n\n55   JESSICA'S POV - THE YARD BELOW                                    55\n     Down in the yard below, Jessica's eleven-year-old son Ricky\n     stands uncomfortably in the middle of a basketball half-court\n     as one of the kidnappers (a severe-looking ex-con named\n     HODGES) stands nearby, watching.\n\n56   INT. ATTIC                                                        56\n     Jessica's knees nearly buckle.\n\n                             JESSICA\n                  Ricky!\n\n57   EXT. THE YARD BELOW                                               57\n     Hodges looks up and sees Jessica's face in the window.   Then\n     turns and tosses a basketball to Ricky.\n\n                             HODGES\n                  Shoot hoops.\n\n                              RICKY\n                  I..   I don't feel like it.\n\n                             HODGES\n                       (threatening)\n                  Shoot.\n     Nervously, Ricky begins to bounce the ball.\n\n58   INT. ATTIC                                                        58\n     Jessica sees her son start shooting the ball -- completely\n     oblivious to Hodges, who flicks open his coat, revealing\n     SILENCED PISTOL tucked into his waistband.\n\n\n\n                                                                    44.\n\n58                                                                        58\n\n\n\n\n\n                          GREEK\n               You have three seconds to tell me\n               where he really is or you're going\n               to a funeral.\n\n                                                    CUT TO:\n\n59   INT. THE RENT-A-COP CAR                                              59\n     Ryan's listening.     Helpless.   There's nothing he can do.\n\n                            RYAN\n               Oh Jesus!    Oh Jesus!!\n\n60   INT. ATTIC / EXT. SAFEHOUSE                                          60\n     Jessica drains ghost-white. On the verge of passing out.\n     Down below, Ricky shoots baskets, unaware of Hodges closing\n     his hand around his gun.\n\n                            GREER\n               One.. .\n\n                             JESSICA\n               Please!     Please, believe me!\n     Ricky plays innocently -- while Hodges now COCKS his pistol.\n\n                            GREER\n               Two.\n     Frantic, Jessica locks eyes with Hodges, silently pleading\n     for him not to do this. Hodges stares back with glacial ice.\n\n                         JESSICA\n                   (sobbing uncontrollably)\n               Please, he's just a child!\n\n                                                    CUT TO:\n\n61   INT. RENT-A-COP CAR                                                  61\n     Ryan is more frenzied than Jessica.\n\n                           RYAN\n                    (to himself)\n               Goddamn it, listen to her!     She\n               doesn't know!!\n\n62   INT. ATTIC / EXT. SAFEHOUSE                                          62\n     Ricky backs up to retrieve a high rebound. Jessica watches\n     in horror as Hodges begins to slowly DRAW HIS GUN.\n\n                            JESSICA\n               No...no.'    I swear that's all I\n               know!\n     Greer gives a sigh of disbelief --\n\n\n\n                                                                   45 .\n\n62                                                                        62\n\n\n\n\n\n                               GREEK\n                  Thre--\n\n                             JESSICA\n                  OKAY! ... okay...\n                       (breaking down)\n                  LAX Airport! There's a bar called\n                  Left Field. That's where we met.\n                  We were in college on our way to\n                  Mardi-gras.\n\n                                                   CUT TO:\n\n63     INT. RENT-A-COP CAR                                                63\n       Ryan's completely floored by Jessica's admission.     She knew\n       all along?\n\n64     INT. ATTIC - CONTINUOUS                                            64\n\n                           JESSICA\n                 Please God, I swear that's the\n                 truth. Don't kill my son!\n\n                            GREER\n                      (looking impressed)\n                 Most people don't get past two.\n       Greer signals, and:\n\n.-·>    EXT. SAFEHOUSE - DAY                                              65\n       Hodges tucks his gun away...just as Ricky turns around.     The\n       kid startles that Hodges was so close.\n\n                               HODGES\n                 Okay, kid.     Let's go.\n\n66     INT. ATTIC - CONTINUOUS                                            66\n       Jessica watches as her son is led away to the GUEST HOUSE\n       across the yard. Once he's inside and out of view, Jessica\n       collapses in a heap on the floor.\n       Greer is about to exit the attic -- when Jessica speaks.\n\n                            JESSICA\n                 You won't get away with this.\n                 When I didn't show up at the\n                 hospital, someone must have called\n                 the police--\n\n                           GREER\n                 The police are the last people on\n                 earth I'm worried about...\n       Greer pulls a Police Scanner out of his jacket and shows it\n       to Jessica.\n\n                                                   MATCH CUT TO:\n\n\n\n                                                                    46.\n\n\n\n\n\n\n\n^7    RYAN - SITTING IN THE RENT-A-COP CAR                                67\n      listening to the call with every fiber of his being.\n\n                            GREER (VO)\n                  We get one hit on the scanner about\n                  you, we'll be picking out family\n                  plots, comprende?\n      Suddenly, a HUMMER, with the BASS THUMPING at ear-shattering\n      decibels, pulls alongside Ryan's car. DMX.\n\n                             RAP TUNE\n\n                  \"SOME NIGGAS THAT YOU DON'T WANNA\n\n                  TRY, (MY NIGGAS) SOME NIGGAS JUST\n\n                  ABOUT DO OR DIE (MY NIGGAS) ...\"\n\n                                                 CUT TO:\n\n68    THE ATTIC                                                           68\n      Jessica hears it first. The pumping cacophony coming from\n      the phone behind the beam. It's subtle at first, but grows\n      increasingly louder. She closes her eyes, praying Greer\n      won't hear it--\n      But Greer does hear it. On the verge of leaving the room,\n      Greer stops. Cocks an ear. Instantly, Jessica tries to\n      cover it with her own voice.\n\n                             JESSICA\n                  Do you honestly expect me to\n                  believe we're going to walk away\n                  from this alive?\n      But Greer isn't listening to her. He strides back into the\n      room, listening to the noise under her voice.\n\n                             GREER\n                       (to Jessica)\n                  Shut up.\n\n69    RYAN - IN THE RENT-A-COP CAR                                        69\n      Oblivious of Jessica desperately trying to clue him in.\n\n                             JESSICA (VO)\n                  How can I SHUT UP? You threaten to\n                  kill my child and you expect me to\n                  act like a MUTE?! If this --\n      Suddenly, it hits Ryan like a punch to the face.     And he\n      scrambles, trying to cover the phone.\n\n                              RYAN\n                  Oh shit!   Where's mute?!\n\n~*0   INT. ATTIC - CONTINUOUS                                             70\n\n                            ESSICA\n                  ...your child, then--\n\n\n\n                                                                  47 .\n\n70                                                                       70\n\n\n\n\n     BLAMM!! -- Greer shoots a hole in the wall next to Jessica's\n     head. Afraid, she shuts her mouth... and prays.\n\n     BUT AT EXACTLY THE SAME MOMENT --\n\n71   INT. RENT A COP CAR - CONTINUOUS                                    71\n     Ryan finds the MUTE BUTTON.      Presses it and--\n\n72   INT. ATTIC - CONTINUOUS                                             72\n     Greer listens intently... and HEARS NOTHING but silence in\n     the still attic. Soon, he turns to leave. Only when he's\n     gone does Jessica's heart start beating again.\n\n                                                   CUT TO:\n\n73   INT. RENT A COP CAR                                                 73\n     The HUMMER finally pulls away.\n\n                             RAP TUNE\n\n                  \"(MY NIGGAS) IF THEY COULD (MY\n                  NIGGAS) they would (my niggas)...\n     As the thumping bass subsides, Ryan sighs with relief.\n\n                                                   CUT TO:\n                                                                              x - ·>\n\n\n\n 1   INT. KIDNAPPERS' SAFEHOUSE - HALLWAY OUTSIDE ATTIC                  74\n     Deason and Ellis wait for Greer, who enters, pulling off his\n     mask.\n\n                            ELLIS\n                  Well?\n\n                             GREER\n                  The Left Field sports bar at LAX.\n\n                             ELLIS\n                  Are you positive?\n     Greer ignores him.    Then turns to Deason.\n\n                             GREER\n                  Tell Hodges we move in ten.\n     Deason nods and moves off.\n\n                                                   CUT BACK TO:\n\n75   INT. ATTIC                                                          75\n     Jessica lies on the floor, sobbing into her knees.\n     Soft as an insect's buzz, we can hear Ryan calling to her on\n     the broken phone.\n\n\n\n                                                                 48.\n\n75                                                                     75\n\n\n\n\n\n                         RYAN (VO)\n               Jessica...? Answer me, goddamn it I\n     Soon, his voice pierces the suffocating gloom around her and\n     she crawls desperately over to it.\n\n                                                 MATCH CUT TO:\n\n76   INT. RENT-A-COP CAR - IDLING AT THE CURB                          76\n     Ryan's freaking out.\n\n                            JESSICA (VO)\n               I'm here.\n\n                         RYAN\n               You all right?!     I thought they--\n\n                            JESSICA (VO)\n               I'm okay.\n\n                         RYAN\n               What are you doing?    Why'd you lie\n               to them?\n\n77   INTERCUT PHONE CALL - RYAN IN RENT-A-COP CAR/JESSICA IN ATTIC77\n\n                          JESSICA\n                    (welling up with tears)\n               Do you think I like gambling with\n               my son's life?\n\n                         RYAN\n               I can't tell. You seem pretty good\n               at it --\n\n                         JESSICA\n               Don't you see, Ryan? Once they get\n               Craig, we're all gonna die.\n\n                          RYAN\n               You can't know that for sure.\n\n                          JESSICA\n               Be realistic. Does letting us live\n               benefit them in any way? No! The\n               only chance he's got is if you can\n               get to the airport and find him\n               before they do.\n\n                         RYAN\n               Wait, wait--!\n\n                          JESSICA\n               Ryan, please! There's no time!\n               Just get to the airport--\n\n                          RYAN\n               It's suicide. They'll kill me!\n\n\n\n                                                                 49.\n\n77                                                                     77\n\n\n\n\n\n                  J...      JESSICA\n                They won't! You're invisible to\n                them! They don't know who you are.\n                They don't know anything about you.\n                Please! You've got to try!\n\n                           RYAN\n                Lady, I've jacked two cars, been\n                accused of being a child molester,\n                obliterated a car dealership, and\n                busted three caps in a Verizon\n                store. -- Don't tell me I'm not\n                trying!\n     Jessica tries another tack.\n\n                          JESSICA\n               Look, I have no right to ask you\n               this Ryan, but you re my family's\n               only chance...and I am asking.\n     Something in the way she says that last sentence, a mixture\n     of strength and vulnerability, gets through to Ryan.\n     And against his own will, he's swayed.\n\n                          RYAN\n                    (gives in)\n               I'll get the phone to your husband,\n               but that's gotta be it, okay?!\n\n »               *\n\n\n\n\n     Ryan, heading toward the airport, floors the gas.\n\n                                               CUT TO:\n\n78   EXT. BRENTWOOD   NEIGHBORHOOD - DAY                               78\n     A PATROL CAR prowls down a quaint residential block. Comes\n     to a stop in the driveway of what we know to be Jessica\n     Martin's house. Mooney gets out. Knocks.\n     The door opens, revealing the ATTRACTIVE YOUNG WOMAN from\n     before.\n\n                         MOONEY\n               Ms. Martin?\n\n                          ATTRACTIVE WOMAN\n               Yes?\n\n                          MOONEY\n               Jessica Kate Martin?\n     The Woman nods. Mooney is plainly disillusioned by the\n     woman. Maybe his hunch was wrong...\n\n                          ATTRACTIVE WOMAN\n               Cam I help you, Officer...?\n     She scans Mooney's badge.\n\n\n\n                                                                   50.\n\n78                                                                       78\n\n\n\n\n\n                           MOONEY\n                Mooney.\n                     (shakes his head)\n                No. No, I guess not. Must've been\n                a prank. I m sorry to have\n                b9thered you, Ms. Martin. Have a\n                nice day.\n     The Woman smiles and nods, and Mooney walks off. When he\n     gets to his car, he CRUMPLES the paper with Jessica's name\n     and address, and shakes his head, chuckling at himself.\n     As Mooney drives off--\n\n     THE ATTRACTIVE WOMAN\n     walks back into the house and flips open her CELLPHONE. When\n     she finishes dialing, a familiar DEEP MALE VOICE answers.\n\n                            DEEP MALE VOICE (VO)\n                Hello?\n\n                          ATTRACTIVE WOMAN\n                It's Bayback. Remember the Fusco\n                brothers?\n     Silence.\n\n                           ATTRACTIVE WOMAN (CONT'D)\n                Well, I've got an itch that needs\n                scatching.\n\n                                                   MATCH CUT TO:\n\n79   INT. A ROOM - DAY                                                   79\n\n     ECU - THE MAN ON THE OTHER END OF THE CALL\n     Too close to make out who it is just yet--\n\n                          DEEP MALE VOICE\n                What's the problem?\n\n                          ATTRACTIVE WOMAN (VO)\n                We're in the middle of a shit\n                storm, and I need you to put a\n                leash put on an officer.\n\n                            DEEP MALE VOICE\n                Who?\n\n                          ATTRACTIVE WOMAN (VO)\n                An Officer Mooney from your\n                division. Know him?\n     Now, we start PULLING BACK, revealing the man's features.\n\n                          DEEP MALE VOICE\n                Mooney? He's a desk sergeant.      What\n                would you want with him?\n\n\n\n                                                              51.\n\n79                                                                  79\n\n\n\n\n\n                          ATTRACTIVE WOMAN (VO)\n               I had to do a B & E and he came\n               snooping around the house looking\n               for the owner.\n\n                          DEEP MALE VOICE\n               And what did you say?\n\n                         ATTRACTIVE WOMAN (VO)\n               That I was her, of course.\n     Continue PULLING BACK.   We can almost recognize him now...\n\n                         DEEP MALE VOICE\n               Did he believe you?\n\n                         ATTRACTIVE   WOMAN   (VO)\n               I think so. He said he thought\n               someone was pulling a prank on him.\n\n                          DEEP MALE VOICE\n               Mooney doing an investigation?\n               What's are you really up to?\n     The man swivels around in his chair and we see clearly it's--\n\n                          DETECTIVE TOMLIN\n               And no bullshit. Right now you're\n               entire department's hot, so if I'm\n               gonna get in the tub, I've got to\n               know how deep it is.\n\n                                                CUT TO:\n\n80   INT. RENT-A-COP CAR - BURNING DOWN SEPULVEDA BOULEVARD         80\n     Ryan drives like madman toward the airport, blowing through\n     lights. Jessica is frantic.\n\n                          JESSICA (VO)\n               Where are you now?!\n\n                          RYAN\n               I'll be at the airport in twenty\n               minu --\n\n                         JESSICA (VO)\n               Twenty minutes! Oh my God, Ryan,\n               you've got to drive faster! Please--\n\n                          RYAN\n                    (snapping)\n               Jessica, this car has a sewing\n               machine for an engine! I can't go\n               any faster!\n\n                           JESSICA\n               Sorry.   I just...\n\n\n\n                                                              52.\n\n\n\n\n\n\n\nSI   INTERCUT PHONE CALL - RYAN IN RENT-A-COP CAR/JESSICA IN ATTICS 1\n     Jessica's voice trails off as she catches a glimp se of\n     herself in an OLD MIRROR standing in the corner.  Bruised.\n     Clothes torn. Staring at her own cracked reflect  ion, she\n     breaks down, but silently this time, locked in he r own\n     personal hell.\n     For Ryan, the silence is deafening. Despite his frantic\n     driving, he feels her pain. And hates being unable to help.\n\n                          RYAN\n               Jessica... ?\n     There's an emotional beat, then--\n\n                          JESSICA\n               Do you think God will forgive me?\n\n                          RYAN\n               What do you mean--?\n\n                          JESSICA\n               For what I've done...   For giving\n               up Craig...\n     Ryan is moved by the emotion in her voice.\n\n                          RYAN\n               Jessica, they have your kid. You\n               had no choice.\n\n                          JESSICA\n               I don't know. I don't know...\n\n                         RYAN\n               1 know. I heard what they were\n               doing to you over there. You held\n               out for as long as you could.\n\n                          JESSICA\n                    (grim beat)\n               My son and I are going to die here,\n               Ryan. They already have us. But\n               maybe I could've saved Craig...\n     The truth of this has a profound effect on Ryan. And just\n     when Jessica is about to lose herself to despair --\n     Ryan finds a resolve within himself even he didn't know he\n     had.\n\n                          RYAN\n               Jessica, listen to me. I promise\n               you, I'm not going to let that\n               happen. I could care less about\n               your money. I'm risking my life\n               cause I know I'm gonna get you and\n               your family out of this. You hear\n               what I'm sayin'?\n\n\n\n                                                              53.\n\n81                                                                   81\n\n\n\n\n     There is a moment between them, two people connecting on a\n     human level...\n     But the moment is suddenly cut short as a STATICKY VOICE\n     start bleeding into their phone call -- some BRITISH ASSHOLE\n     having his own phone call.\n\n                           BRITISH ASSHOLE (VO)\n                -- Yeah, the show just bought me a\n                Cadillac XLR convertible. No, you\n                can't ride in it. Not until you do\n                something with that road kill you\n                call hair. And what's with your\n                makeup? Kabuki Theatre is not in\n                style --\n\n                           RYAN\n                     (interrupting)\n                Jessica? Are you still there?\n\n                             BRITISH ASSHOLE (VO)\n                Hey, hey?!    This is a private call!\n     Jessica's voice starts fading as the CROSSTALK gets worse.\n\n                     JESSICA (VO)\n               (washed in static)\n               I'm..ere, but y...reaking up!\n\n                          BRITISH ASSHOLE (VO)\n               Get off my line! Are you there?\n               Mom? I\n\n                          RYAN\n               Listen dude, this woman's in\n               serious --\n\n                          BRITISH ASSHOLE (VO)\n               --That's not my problem, lady.\n     Lady?! Suddenly, STATIC starts drowning out Ryan's side of\n     the call.\n\n                          RYAN\n                    (yelling over the static)\n               Jessica, don't hang up! You hear\n               me?! Whatever happens --\n\n                          BRITISH ASSHOLE (VO)\n               Look woman, tell your kidnapping\n               story to someone who gives a shit.\n     Ryan can't hear Jessica's side of the conversation; only the\n     British Asshole's, which comes in loud and clear.\n\n                             RYAN\n               Jessica?!     Jessica?!\n     As Ryan goes mental, a CAR PASSES HIM on the opp9site side of\n     the road -- a new Cadillac XLR convertible! Inside is an\n     appropriately asshole-ish looking guy. He could only be the\n     British Asshole.\n\n                                                       ,\n\n\n\n                                                                  54.\n\n81                                                                      81\n\n\n\n\n\n                           RYAN (CONT'D)\n                 Gotcha.\n     Ryan pulls a HARROWING 180 DEGREE TURN, barely missing an\n     oncoming car by inches.\n     He RACES up to the Cadillac, which has a VANITY PLATE that\n     reads, \"IDOL MKR.\" Ryan looks through the window at --\n\n                                                   CUT TO:\n\n82   INT. CADILLAC XLR CONVERTIBLE                                       82\n     The driver, who in a typical LA celebrity sighting, turns out\n     to be none other than SIMON COWELL, host of American Idol.\n     Simon continues his spittle-spraying rant -- at no one.      It\n     appears he's using the car's SPEAKERPHONE.\n\n                                                   CUT BACK TO:\n\n83   INT./ EXT. RENT-A-COP CAR - BURNING DOWN SEPULVEDA BLVD.           83\n     Ryan eyes Simon's mouth while hearing:\n\n                      SIMON COWELL (VO)\n                (over Ryan's cellphone)\n                Murdered your housekeeper? Don't\n                bullshit me; I work in the Industry\n                that invented it you stupid COW!\n     Ryan sees Simon Cowell MOUTH THE WORDS \"STUPID COW\" in synch\n     with the conversation. BINGO!\n     Ryan floors the Rent-a-cop car ahead of the Cadillac and\n     PULLS A 90 DEGREE turn at an intersection; cutting Cowell\n     off!\n     SCREEEECH! Cowell, trying to avoid a collision, SLAMS on the\n     brakes, causing the Cadillac to SKID twenty feet.\n     Ryan jumps out of the rent-a-cop car he's left in the middle\n     or the intersection and runs over to the Cadillac, banging on\n     the window with the .38 Special.\n     Cowell practically jumps out of his skin at the sight of the\n     gun and the kid with the crazy look in his eyes.\n\n                           SIMON COWELL (CONT'D)\n\n                BLOODY HELL!!\n\n                           RYAN\n                Give me that phone... or I shoot\n                your car!\n     Cowell is prepared to comply -- but suddenly behind them--\n\n     SFX:   HONK-HONK!!\n\n\n\n                                                              55 .\n\n83                                                                   83\n\n\n\n\n     -- Ryan notices a 10-TON SEMI heading straight for the Rent-a-\n     cop car too late. The DRIVER SLAMS his brakes, but --\n\n     KABLLAAAAMMM!\n\n84   THE RENT-A-COP CAR                                              84\n     EXPLODES into tiny pieces of junk as the semi PLOUGHS THROUGH\n     IT! Flaming debris rains down around Ryan, and he covers his\n     mouth, unable to believe his shitty luck.\n\n                           RYAN\n                Ain't that a bitch!\n     Ryan turns back to Simon Cowell.\n\n                           RYAN (CONT'D)\n                Out of the car! Now!\n     Cowell all but dives out.\n\n                          RYAN (CONT'D)\n               Where's your phone?!\n\n                           SIMON COWELL\n                It's on speaker!\n     Ryan turns to the car.    Calls out.\n\n                           RYAN\n               Jessica?\n\n                            JESSICA (VO)\n               Ryan?!    I'm here!\n     Her voice says she can't believe her ears.\n     Relieved, Ryan jumps in the Cadillac XLR and tosses his phone\n     on the passenger seat, next to a LAPTOP computer. Guns the\n     engine and STOMPS the gas.\n     As he passes the ruins of his rent-a-cop car, he slows just\n     enough to open the Cadillac's door and snatch up his bag of\n     Verizon goodies laying on the pavement -- then peels away.\n     Practically frothing at the mouth, Simon Cowell chases after\n     on foot, cursing as his beautiful new Cadillac disappears in\n     the distance --\n\n                           SIMON COWELL\n               Your career's over!    YOU HEAR ME?!\n\n               OVER!\n\n85   INT. CADILLAC XLR                                               85\n     As Jessica's voice RESOUNDS around him, he notices the\n     phone's controlled through the radio. He turns it up.\n\n                     JESSICA (VO)\n               (still shaken)\n               I thought they... I thought I was--\n\n\n\n                                                                     56.\n\n    85                                                                     85\n\n\n\n\n\n                               RYAN\n                    You're okay. It's okay now.\n\n                                                     DISSOLVE TO:\n\n    86   EXT. AIRPORT TERMINAL - ESTABLISHING                              86\n         Along with the million other cars, FIND the Cadillac\n         threading its way up to the main terminal.\n\n    87   INT. CADILLAC XLR - AIRPORT                                       87\n         Ryan tries to avoid eye contact with the TRAFFIC COP\n         assisting the flow of cars.\n\n                               RYAN (INTO PHONE)\n                    I'm here... Oh shit!\n         SCREEEECH! Ryan steps on the brakes, seeing something ahead.\n         WHIP PAN AROUND to see what Ryan's staring at. Just ahead,\n         JESSICA'S ESCALADE is pulling up to the curb.\n\n                               JESSICA (VO)\n                    What?\n\n                              RYAN\n                   Your car's here.\n         Ryan pulls along side the red curb and watches as four tough-\n         looking men exit the vehicle. We recognize them as Greer,\n         Deason, Ellis and Hodges.\n\n                              JESSICA (VO)\n                   Hurry, Ryan! Just find Craig!\n         Ryan hops out -- but stops when the car CALLS OUT TO HIM.\n\n                             JESSICA (CONT'D)\n                   Wait, Ryan! What about me--?!\n         Ryan searches the car and finds the HANDSET in the armrest.\n         As he grabs it and races after Greer into the airport, a\n         Traffic Cop comes up to the car.\n\n                              TRAFFIC COP\n\n                   HEY, YOU CAN'T PARK HERE!!\n         But it's too late.   Ryan's already gone.\n\n    88   INT. LAX AIRPORT - CONTINUOUS                                     88\n         Greer and his men stride through the airport like sharks\n         honing in on bleeding prey.\n         Soon, the Kidnappers break up into two groups: Greer and\n         Ellis heading for the DEPARTURE GATES; Deason and Hodges go\n         the other way towards the INFORMATION KIOSK.\n\n^\n         Ryan heads toward the --\n\n\n\n                                                             57.\n\n\n\n\n\n\n\nR9   INT. SECURITY CHECKPOINT - LAX                                  89\n     Greer, who waits in the LINE OF PASSENGERS waiting to pass\n     through airport's METAL DETECTORS. This is Ryan's chance.\n     He cuts through the line.\n\n                         RYAN\n               Oops. Excuse me. Pardon me. My\n               grandmother needs her walker...\n     Soon, he makes his way to the front, right behind Greer and\n     BUMPS into him. As he does, NOTICE --\n     ECU of Ryan slyly slipping the rent-a-cop's tiny .38 Special\n     into Greer's heavy motorcycle jacket.\n     Greer turns, glaring -- But no one's there.\n     Greer looks around, and there's a heart-stopping moment that\n     we're afraid he's going to notice Ryan, who now stands\n     innocently the next line over--\n     --but Greer's eyes pass right over him as he scans the crowd.\n     Ryan breathes a sigh of relief as Greer finally turns away to\n     walk through the metal detector and...\n\n     SFX:   BZZZZZZZTTH\n     ...sets off the alarm.\n\n                          DETECTOR OPERATOR\n               Excuse me, sir. Would you mind\n               emptying your pockets over here?\n     Confused, Greer does. He lays his wallet on the table, then\n     his keys... Then looks baffled as he pulls out -- the GUN 1\n\n                            DETECTOR OPERATOR (CONT'D)\n               Code red!     Code red!\n     The response she gets is stunning. SECURITY GUARDS jump out\n     of the woodwork with guns drawn. ALARMS go off. SECURITY\n     GATES start coming down. Travelers start SCREAMING and\n\n     PANICKING!\n\n                            SECURITY GUARDS\n\n               GET DOWN!    GET ON THE GROUND!!\n\n                            ELLIS\n                   (reaching for something)\n               Wait, this is a mistake--\n\n                             TENSE GUARD\n\n               HANDS/     HANDS!!\n     As one, the entire security force POUNCES on Greer and Ellis,\n     TACKLING them to the ground and IMMOBILIZING their limbs.\n\n\n\n                                                                58.\n\n89                                                                    89\n\n\n     And while that chaos is going on, Ryan slowly backs through\n     to the metal detector...and starts running for Left Field.\n\n                                                MATCH CUT TO:\n\n90   INT. LAX AIRPORT - METAL DETECTORS - CONTINUOUS                  90\n     GREER AND ELLIS are crushed under the dogpile of security.\n     Behind them, a door slams open and a formation of NATIONAL\n     GUARDSMEN race on-scene, showing just how seriously security\n     is taken in the wake of Sept. 11th.\n\n                                                CUT TO:\n\n91   INT. CONCOURSE - LAX                                             91\n     Ryan jogs down the concourse when--\n\n                          PUBLIC ADDRESS SYSTEM\n               Attention travelers. Due to a\n               security problem, all persons are\n               required to clear the terminal and\n               return immediately to the security\n               checkpoint at the entrance to\n               Concourse B...\n     At once, everyone begins filing out of the terminal. Ryan\n     looks like a salmon swimming upstream, the only figure moving\n     against the tide of people rushing to get out.\n\n                          JESSICA (VO)\n               \"Left Field\" is in Terminal C.\n\n                         RYAN\n               Listen to me! They're clearing the\n               terminal. Before your husband passes\n               me, what does he look like?\n\n                         JESSICA (VO)\n               He's thirty-eight. Six feet.     Trim\n               build. Thinning hair...\n\n                          RYAN\n                    (scanning the passengers)\n               That's not enough! What's he\n               wearing?\n\n                          JESSICA (VO)\n               I don't know! We have completely\n               different schedules. I was fast\n               aslee p--\n                    (thinking it through)\n               -- A suit... He wears glasses,\n               thick rims, like Buddy Holly or--\n     Bingo! The Buddy Holly glasses is what did it. Ryan sees a\n     man in the distance hurrying in his direction -- CRAIG.\n\n                            RYAN\n               Found him!\n\n\n\n                                                                      59.\n\n91                                                                          91\n\n\n        And just as Ryan bee-lines it towards Craig--\n\n                  VOICE (OS)\n        Excuse me, sir--\n        Ryan turns and finds a NATIONAL GUARDSMAN right behind him.\n\n                              NATIONAL GUARDSMAN\n                   You can't be here now. You have to\n                   leave the area.\n\n                               RYAN\n                  But --\n\n                               NATIONAL GUARDSMAN\n                  Now, sir.\n        And as Ryan is marched away he sees--\n\n                                                    CUT TO:\n\n92      GREER AND ELLIS                                                     92\n        Knees in their necks.    Hands covering their faces.\n\n                              GREER\n-- if you'd just listen to me! I\ncan explain! Someone reach into my\ncoat pocket! Goddamn it, reach\ninto my pocket!\n\n*'V\n         A YOUNG GUARDSMAN does -- and in a big reveal, we see that he\n         WITHDRAWS A BADGE. A Los Angeles policeman's badge...\n       Ryan's jaw drops.      He can't believe it -- they're cops?!\n\n                             YOUNG GUARDSMAN\n                  Hey, this one's on the job.\n\n                            RYAN\n                  Holy shit, Jessica, these guys are\n                  cops!\n\n                               JESSICA (VO)\n                  What?!\n       The Guardsman's SUPERIOR OFFICER examines it.      Is it real?\n\n                               SUPERIOR OFFICER\n                  Run it.\n                  (the Guardsman runs off;\n                  turns back to Greer)\n                  Is that your gun?\n\n                             GREER\n                       (hesitates)\n                  --yes. Yes. It's my piece.\n\n                            SUPERIOR OFFICER\n                  Well, you're supposed to declare it.\n\n\n\n                                                                  60.\n\n92                                                                      92\n\n\n\n\n\n                           GREEK\n                I know. We just got focused on a\n                rabbit we're here to nab.\n     Just then, the Young Guardsman returns.\n\n                          YOUNG GUARDSMAN\n                He's clean. Badge matches his I.D.\n\n                      SUPERIOR OFFICER\n                (grumbles)\n                Unhook 'em. Stand down security.\n\n                                                  MATCH CUT TO:\n\n93   INT. LAX AIRPORT - CONCOURSE - DAY                                 93\n     Ryan looks relieved when the airport's alarms SHUT OFF._ The\n     P.A. system cheerily thanks everyone for their cooperation\n     and, all around, security gates begin to rise.\n\n                          RYAN\n                    (noticing; to Guard)\n               Hey, can I go now? Can I go?!\n     The Guard nods, and Ryan takes off like a shot, racing back\n     towards the bar.\n     Ryan spots Craig Martin outside the Left Field sports bar.\n     Ryan grabs him by the elbow and starts hustling him through\n     the concourse.\n\n                         CRAIG\n               Hey, what the hell?!    Get your\n               hands off m--!!\n\n                         RYAN\n               Shut up and keep walking. If they\n               see us they'll kill us both.\n\n                          CRAIG\n               What--?\n\n                          RYAN\n               Your wife sent me.\n\n                          CRAIG\n               She did?   But how--?\n\n                          RYAN\n               Would you hurry your ass?! You\n               need to hide. They're here, and\n               they're looking for you. They\n               already have your family.\n     Craig looks at him, growing terrified.\n\n                          RYAN (CONT'D)\n               In here!\n\n\n\n                                                               61.\n\n93                                                                   93\n\n\n\n\n     Ryan pulls Craig into the MENS RESTROOM.\n\n                                                  CUT TO:\n\n94   INT. LAX RESTROOM                                               94\n\n                          CRAIG\n                I don't understand--\n\n                          RYAN\n               It's okay. She'll explain it to you.\n                   (into phone)\n               Okay, Jessica, I'm handing you over now.\n\n                                                 CUT TO:\n\n95   INTERCUT CALL - JESSICA IN ATTIC/ RYAN IN LAX MENS ROOM         95\n     Relief can be traced on Jessica's face.\n\n                         JESSICA\n                   (welling up)\n               Ryan, you've done so much.     I don't\n               know how to repay you...\n     An awkward, emotional pause falls between them.\n\n                          RYAN\n               Forget about the cash. Just get you\n               and y9ur son home safely and we'll\n               call it even.\n\n                           JESSICA\n               I will.   I promise.\n\n                          RYAN (VO)\n               I know you will.\n     RYAN hands the cellphone over to Craig.\n\n                          RYAN (CONT'D)\n               I'm gonna be outside this door.\n               Don't come out unless I get you.\n               Got it?\n\n                     CRAIG\n               (confused)\n               Okay.\n     Ryan walks out the restroom door as Craig puts the phone to\n     his ear. He sighs with relief -- it's finally over.\n\n                                                 CUT TO:\n\n96   INT. LAX AIRPORT - CONCOURSE - CONTINUOUS                       96\n     GREER and ELLIS stride toward the bar.\n\n\n\n                                                                  62.\n\n96                                                                      96\n\n\n\n                           ELLIS\n                     (sotto voce)\n                Nice move. What the hell you bring\n                a gun for?\n\n                            GREEK\n                I didn't.\n\n                         ELLIS\n                   (sounding nervous)\n               What do you mean?\n\n                          GREER\n               Just keep your eyes open!\n               Something weird is going on.\n     Greer stares daggers at everyone he passes.\n     Ellis Io9ks around before glancing down at a PHOTO COPY of a\n     California driver's license.\n\n                                                  CUT BACK TO:\n\n97   INT. LAX AIRPORT - OUTSIDE MEN'S ROOM - DAY                        97\n     Trying to act inconspicuous, Ryan guards the entrance to the\n     Men's Room. He's starts to check out a magazine rack at an\n     adjacent concession stand when he hears:\n\n                            CRAIG\n\n               HEY, RYAN?    RYAN!\n     Ryan turns. RACK FOCUS past Ryan to Craig standing fifty\n     feet back, holding the phone out.\n\n                         CRAIG (CONT'D)\n               This isn't my wife.\n\n     ECU ON RYAN'S FACE\n     As it sinks in.   Disbelief.    Anger.   Dread.\n\n                          CRAIG (CONT'D)\n               My wife's name is Patty. I'm not\n               Craig. I'm Paul. Paul Boyd.\n     In utter disbelief, Ryan turns back toward the gate -- and\n     sees Greer, Ellis, Hodges and Deason, cornering another MAN.\n     Tall. Lean. Thinning hair.\n     And wearing Buddy Holly glasses.    The real CRAIG MARTIN.\n\n                            RYAN\n               Shit!\n\n                                                  MATCH CUT TO:\n\n8    INT. LAX AIRPORT - CONCOURSE - CONTINUOUS                          98\n     Greer seizes Craig by the arm.\n\n\n\n                                                               63.\n\n98                                                                   98\n\n\n\n                              GREEK\n                 Make a scene and you'll never see\n                 your family again. Now who's here\n                 with you?\n     Craig's eyes swell with fear.\n\n                            CRAIG\n                 Who, what?... No one!   Nobody!\n\n                              GREER\n                 Answer me!\n     Greer looks around the crowded airport.\n\n                            CRAIG\n                 I'll forget I saw anything, just\n                 leave them alone!\n     Whatever.    Greer manhandles Craig toward the exit.\n\n                            GREER\n                 For your family's sake, you better\n                 not have done anything stupid.\n     RYAN snatches the phone from the bogus Craig Martin -- and\n     hauls ass through a sea of travelers, trying to catch up to --\n\n     GREER AND ELLIS\n\"x\n     who scan the crowd bulling their way through throngs of\n     people, leading Craig Martin between them.\n\n     BUT RYAN\n     Has more difficulty. Gets STALLED and SWEPT AWAY in the\n     crowd long enough for the kidnappers to make it outside--\n\n99   INT. ESCALADE - LOADING ZONE - CONTINUOUS                       99\n     To their car. Craig is forced into the ESCALADE between\n     Greer and Ellis.\n\n                            CRAIG\n                 You goddamn animals better not have\n                 hu rt --\n     Greer surprises him with a vicious ELBOW to the face.\n\n                              GREER\n                 Animals?\n     Ellis whips a burlap hood over Craig's head and they drive\n     off just as--\n\n                                                   CUT TO:\n\n\n\n64.\n\n\n\n                                                                     65.\n\n 102                                                                       102\n\n\n\n\n\n                               MARILYN\n                    Yes. He said you looked distracted\n                    when you left. He wants you to\n                    relax, Bob. He said they found\n                    that kid you were looking for and\n                    that you were right, it was all a\n                    prank. Nothing to worry about.\n\n                               MOONEY\n                    Yeah, I know.\n       She pulls him back down for another kiss.\n\n                               MARILYN\n                    What am I gonna do with you?\n\n                              MOONEY\n                    You're gonna dance with me all\n                    night long, until we're too pooped\n                    to pop... Well almost.\n       A giggle.    They kiss.\n\n                               MARILYN\n                    You'll never change.\n\n                               MOONEY\n                    Yes I will, after I shower.\n       They both share a laugh.\n\n                                MARILYN\n                    Lame ass.   Come on.\n       She pushes herself down the hallway and he follows.\n\n                                                     CUT TO:\n\n103    INT. JESSICA'S ESCALADE                                              103\n       As it pulls off the road onto the driveway of the kidnappers\n       safe house and parks. Craig still wears the hood as Greer\n       exits the car.\n\n                                GREER\n                    Get out!\n       As Craig reaches blindly for a door handle, Ellis opens the\n       door and shoves him out onto the driveway. Greer yanks him\n       up by his collar.\n\n                                 GREER (CONT'D)\n\n                    GET UP!    WALK!\n       With guns at his back, Craig is dragged inside the house.\n\n104    INT. ATTIC                                                          104\n                    p\n       The darkness is oppressive.       Craig is pushed inside and pulls\n       the hood off.\n\n\n\n                                                                  66.\n\n104                                                                     104\n\n\n\n\n\n                            CRAIG\n                 Goddamn it, what the hell are you\n                 people going to--\n\n                               JESSICA (OS)\n                 Craig?\n      Craig stops dead, hearing the voice. Scans the cobweb-filled\n      room, seeing nothing -- then from the depths of the shadows,\n      Jessica materializes looking haunted and lifeless as a ghost.\n\n                               CRAIG\n                Jessica?\n      Jessica races for the safety of Craig's arms, but just as\n      she's about to be embraced, Greer steps forward and YANKS\n      Jessica back by her hair. She squeals in pain.\n\n                              CRAIG (CONT'D)\n\n                HEY --/ /\n      Craig moves to object, but -- OOF! -- Deason sends him\n      gasping to the floor with a sledgehammer fist to the gut.\n\n                           JESSICA\n                No, don't hurt him!\n      Jessica struggles and, with an annoyed shove, Greer sends her\n      spilling into Craig. She hugs tightly against him.\n      When Craig gets his wind back, he comes to his knees and\n      manages to croak out--\n\n                              CRAIG\n                Ricky...?\n      Jessica nods gravely. He's here, too. Craig looks at his\n      wife's face, bruised and hurt, and tears rise in his eyes.\n\n                           CRAIG (CONT'D)\n                Oh, God, Jess... What have they\n                done to you?\n      But Jessica won't let this moment be about pity.\n\n                           JESSICA\n                Who are they, Craig?\n      Craig doesn't know what to say.\n\n                          JESSICA (CONT'D)\n                Tell them, Craig. Tell them they\n                have the wrong family. Tell them\n                they've made a mistake--\n      But something in his eyes disagrees.\n\n                              JESSICA (CONT'D)\n                What?!      What is it?\n\n\n\n                                                                     67.\n\n104                                                                        104\n\n\n               .u          CRAIG\n                 This isn't a mistake, Jess.\n      And that's all it takes for Jessica's world to shatter.\n      GREEK emerges from the shadows, startling them, and backhands\n      Craig's jaw with the butt of his gun.\n\n                            GREEK\n                 Where is the disc now?\n      Blood trickles from the corner of Craig's mouth.\n\n                           CRAIG\n                 You have to promise. If I give it\n                 to you... you'll let my family go.\n\n                            GREER\n                 I'll tell you what, you tell me\n                 where it is--\n                      (turns his gun on Jessica)\n                 --and I won't blow her brains all\n                 over you right now.\n      Greer traces the barrel of the gun down Jessica's cheek.\n      Craig looks utterly helpless.\n\n                           GREEK (CONT'D)\n                 Your call Craig. It's an eighty-five\n               ''cent bullet to me.\n\n.\"\n\n.*\n\n .\n      Greer lowers the gun to her neckline( pulls her shirt\n      lower... She pleads \"no\" at Craig with her eyes, but he\n      finally breaks.\n\n                          CRAIG\n                Okay. Enough, you win.      But if\n                anything-\n\n                           GREER\n                    (training gun on Craig)\n                Just shut up and talk.\n\n                                                     MATCH CUT TO:\n\n105   EXT. SURFACE STREETS - DAY                                           105\n      Ryan rides back into the city in a cab.\n      He listens some more, then covers the phone's mouthpiece and\n      taps the CABBIE on the shoulder.\n\n                           CRAIG (V.O.)\n                I dropped it down the mail chute at\n                work. It's gotta be in the\n                mailroom.\n\n                     JESSICA (VO)\n                (for Ryan's benefit,\n                weakly)\n                You hid it downtown?\n\n\n\n                                                                       68 .\n\n105                                                                           105\n\n\n\n\n\n                              RYAN\n                   Change of plans.      I need to get to\n                   downtown fast.\n\n                                                      MATCH BACK TO:\n\n106   INT. ATTIC                                                              106\n      Greer pulls Craig to his feet.\n\n                                 GREEK\n                   Get up.     We're going.\n\n                             CRAIG\n                   How will I know she's okay?\n\n                              HODGES\n                        (shoving him)\n                   Move!\n      When he gets near the door, Jessica is overcome with emotion\n      and races to her husband.\n\n                               JESSICA\n                   Wait!   WAIT!!\n      She brushes past Hodges and hugs on tight to her husband,\n      tears flowing from her eyes.\nv\n      Hodges goes to pull them apart, but Greer stops him.        He\n      knows this is going to be their last time together.\n\n                              CRAIG\n                   I love you.\n      Craig squeezes the good years of their marriage into a\n      strong, loving embrace. Jessica hugs him closer. Leans into\n      his ear to seemingly whisper her love in return -- but what\n      she actually whispers takes Craig by surprise.\n\n                              JESSICA\n                        (quickly; sotto voce)\n                   Pretend I'm telling you that I love\n                   you. There's an open phone line in\n                   here. You'll have help at the\n                   office, but if you give these men\n                   what they want, we're dead.\n      Jessica kisses her husband on the lips and withdraws, leaving\n      Craig with an utterly confused expression on his face. But\n      before his look can betray him--\n\n                                GREER\n                   Let's go.\n      --Greer and Hodges move forward, ushering Craig out of the\n      room. When the door locks behind them, Jessica once again\n      rushes to the phone.\n\n\n\n                                                                  69.\n\n106                                                                     106\n\n\n\n                           JESSICA\n                 Ryan?! They're going to Fegan\n                 Securities, 4th and Figuroa.\n\n                                                 MATCH CUT TO:\n\n107   EXT. 10 FREEWAY - DAY                                             107\n      Ryan, in the cab, weaves through cars.\n\n                           RYAN (INTO PHONE)\n                 I'm already on my--\n      Suddenly, the cab rounds a bend -- and grinds to a halt from\n      backed up traffic!\n\n                           RYAN (CONT'D)\n                You've gotta be kidding me!\n                     (to cabbie)\n                Can't you back it up?\n      The cabbie tries, but is hopelessly locked in by cars pulling\n      up behind him. Shrugs.\n      About a hundred yards up the road, Ryan sees the 4th\n      Street/Figuroa Exit. He's so close...\n\n                           RYAN (CONT'D)\n                Aw, screw this!\n      Ryan throws some bills at the driver, hops out the passenger\n      side and starts RUNNING.\n\n108   EXT. SURFACE STREETS - DAY                                        108\n      A short time later, Ryan( drenched in sweat, sees Craig's\n      office building in the distance --\n\n109   EXT. FEGAN SECURITIES, INC. BUILDING - ESTABLISHING           109\n      With an all cement exterior (and few windows), it's a\n      cellphone user's nightmare.\n\n110   EXT. SURFACE STREETS - DAY                                        110\n      As Ryan huffs and puffs toward the building, he sees a BIKE\n      MESSENGER bullshitting with a HOT DOG VENDOR. Ryan stops and\n      stares at the PACKAGE POUCH on the seat and a flashy red BIKE\n      HELMET hanging on the handlebars.\n      The helmet is futuristic, like something The Flash might\n      wear. Ryan eyes the Messenger, grabs the bike, hops on and\n      peddles for dear life toward Craig's building with the\n      Messenger hot on his heels.\n\n111   EXT. FEGAN SECURITIES, INC. BUILDING                              111\n      As Ryan arrives at the building, the Escalade pulls up in\n      front of him and Greer, Hodges and Ellis file into the\n      building.\n\n\n\n                                                               70.\nIll                                                                  111\n\n\n      Ryan skids to a stop.   Eyes the carrying pouch...\n\n*12    INT. FEGAN SECURITIES, INC. - LOBBY - DAY                      112\n      Ryan, carrying the carrying pouch and bike helmet, enters the\n      lobby. Greer and the others disappear into an ELEVATOR.\n      N9W inside, STATIC starts playing hell with their connection.\n      Fine in some areas, terrible in others.\n\n                           JESSICA (V.O.)\n                Wait, we --(bzzt!)--ve to think!\n                What --(bzzt!)--re we going to do?\n\n                            RYAN\n                 I have an idea...\n      Ryan fights his way through the tourists to the elevator bay.\n      Quickly scans the DIRECTORY. Among the long list of CPAs,\n      there's a MAILROOM on the 3rd floor.\n\n                                                   CUT TO:\n\n113   INT. MOONEY'S BEDROOM - DAY                                    113\n      Mooney (looking damn awkward in a suit and tie), lies on the\n      bed, watching the news.\n      In the background, Marilyn can be seen in the master\n      bathroom, sitting before the vanity mirror in her wheelchair.\n      She puts on makeup.\n\n                           MARILYN\n                In five minutes, I'll need you to\n                give me a hand.\n\n                           MOONEY\n                Whenever you're ready, hon.\n      Still wearing his holster, he shifts uncomfortably on the bed\n      as he watches the news.\n\n                          NEWS ANCHOR\n                ...and authorities are now asking\n                your help in identifying this man--\n      Mooney jolts upright as they display A FUZZY PHOTO OF RYAN\n      from the Verizon surveillance cameras.\n\n                           NEWS ANCHOR (CONT'D)\n                -- believed to be responsible for\n                today's bizarre string of crimes,\n                most notably the theft of an $80,000\n                Cadillac at gunpoint.\n\n                           MOONEY\n                What..?\n      Mooney watches as they continue to detail Ryan's \"wild crime\n      spree\", but gets the bigger picture, realizing that every\n      event --the Verizon store; searching for the Martin kid;\n\n\n\n                                                                  71.\n\n113                                                                     113\n      stealing the Cadillac -- centers around the cellphone call\n      Ryan tried to tell him about this morning.\n      Detective gears turning, Mooney reaches for the phone on the\n      bedside table. Dials 411.\n\n                           OPERATOR\n                 Thank you for using Pacbell. This\n                 is Claire, how may I help you?\n\n                            MOONEY\n                 I need the phone number for a\n                 residence. Jessica Martin in\n                 Brentwood.\n\n                           OPERATOR\n                 That number is (310) 555-8364.    For\n                 an extra seventy five cents-\n      Mooney hangs up, dials the number. The phone rings and\n      rings. Eventually, an answering machine picks up.\n\n                           JESSICA'S VOICE  (VO)\n                Hi, you've reached the hom  e of\n                Craig and Jessica Martin.   We can't\n                get to the phone right now  , but if\n                you leave your name and a   message--\n      Mooney listens intently -- and is troubled.\n\n                           MOONEY\n                     (to an oblivious Marilyn)\n                The woman at the house didn't have\n                an accent.\n      Marilyn smiles, realizing he's really talking to himself.\n      Mooney hangs up, thoughts racing. He reaches behind him, and\n      without looking he grabs his wallet and keys.\n      He then walks over to Marilyn and kisses the top of her head.\n      She knows him, and knows something's up.\n\n                           MOONEY (CONT'D)\n                I'm sorry honey( but I have to\n                check on something real quick.\n\n                          MARILYN\n                You've got to be kidding-\n\n                          MOONEY\n                Delay the reservation if you have\n                to; I'll be back in twenty minutes.\n      And Mooney's gone...\n\n                           MARILYN\n                Twenty minutes my foot.\n\n                                                  CUT TO:\n\n\n\n                                                               72.\n\n\n\n\n\n\n\nU4    INT. ELEVATOR - DAY                                             114\n      A few SECRETARIES get out on the second floor.\n      Alone with the others, Greer eyes the mysterious .38 Special.\n\n                            GREER\n                      (re: .38 Special)\n                 Keep your eyes open.\n\n                                                   CUT TO:\n\n115   INT. FEGAN SECURITIES, INC. - THIRD FLOOR - DAY                115\n      Dripping with sweat, Ryan shambles out of the stairwell, the\n      bike helmet now strapped to his head and the pouch over his\n      shoulder -- just as the ELEVATOR ARRIVES behind him!\n      As Greer, Hodges and Craig get out, Ryan turns and searches\n      for the mailroom that's supposed to be here! Where the hell\n      is-- Ah I He finds it and hustles into --\n\n116   INT. MAILROOM - CONTINUOUS                                     116\n      A wide COUNTER separates Ryan and a few BUSINESS MEN and\n      WOMEN from the MAIL CLERKS that busily work the other side.\n      Ryan leans against the wall, pretending to be an ordinary\n      bike messenger waiting for a package as Craig and the dirty\n      cops enter, brushing right past him.\n      Craig scans the faces of the other patrons as they enter,\n      desperately trying to figure out who is his secret ally. He\n      ignores Ryan completely, whose face is mostly hidden by the\n      tinted plastic VISOR attached to the helmet.\n      Craig notices an AGING SECURITY GUARD stationed in the area,\n      but knows better than to make any waves.\n\n                      MAILROOM SUPERVISOR\n                (recognizing Craig)\n                Anything I can help you with Mr.\n                Martin?\n\n                           CRAIG\n                Hey, Benny. This might sound\n                ridiculous, but I dropped a DVD\n                mailer into the chute this morning\n                and I forgot to put down an\n                address.\n\n                           MAILROOM SUPERVISOR\n                Happens all the time. Let me see\n                what's back there. Gimme a sec'.\n      The Supervisor disappears into the back room.\n      Greer and Hodges take a seat only a few feet away from Ryan.\n      The moment is uncomfortable...and gets infinitely worse as--\n\n\n\n                                                               73.\n\n116                                                                  116\n\n\n\n                          MAIL CLERK ,\n                Excuse me, sir? Sir? Sir?\n      Ryan turns, realizing with horror that another MAIL CLERK is\n      speaking to him.\n\n                           RYAN\n                Me?\n\n                          MAIL CLERK\n                You waiting for a package?\n      Now everyone's looking at Ryan.     Including Greer.\n\n                           RYAN\n                     (facing away)\n                Sure, uh... I'm supposed to pick\n                something up for Mr. Fountain over\n                at the Bonaventure.\n\n                           MAIL CLERK\n                From what department?\n\n                           RYAN\n                I'm not sure... They said it was a\n                contract, though, I know that, so\n                what would that be, Legal?\n\n                          MAIL CLERK\n                What's the tracking number?\n\n                           RYAN\n                     (patting himself down)\n                Uh... Right. Tracking number.\n      It's looking grim.   Thankfully, the Supervisor reappears.\n\n                           MAILROOM SUPERVISOR\n                Mr. Martin? I found a number of\n                things that could be what you're\n                looking for. Mind coming back to\n                take a look?\n      Hodges shoots Craig a look, \"go\".\n\n                           CRAIG\n                Sure.\n      The Supervisor leads Hodges and Craig away to the back room.\n      Unfortunately, Greer stays behind.\n\n                           RYAN\n                     (patting himself)\n                I might... Maybe it's on the\n                clipboard on my bike?\n      Ryan watches Greer out of the corner of his eye as Hodges and\n      Craig disappear inside the vault.\n\n\n\n                                                                 74.\n\n116                                                                    116\n\n\n\n\n\n                           RYAN (CONT'D)\n                 I, uh, may need to call somebody.\n\n                                                  CUT TO:\n\n117   INT. MAILROOM - BACK ROOM                                        117\n      There's an entire shelf that serves as a dead letter office.\n      One plastic bin is filled with reusable interoffice\n      envelopes, another bin is overflowing with small mailers,\n      computer disks, unlabeled video tapes, Etc...\n\n                           MAILROOM SUPERVISOR\n                Help yourself.\n      HODGES cautiously watches Craig shuffle through the mailers,\n      opening two or three before finding -- he turns one upside\n      down -- and a DVD case slides out!\n      A quick glance at the label, \"ADT Digital Surveillance'.\n      5/19/05 06:00 - 07:00\" confirms it's the disc.\n\n                           CRAIG\n                This is it.\n      Hodges seems uncomfortable with the Supervisor hovering over\n      his shoulder.\n\n                            HODGES\n                Let's go.\n\n                                                  BACK TO:\n\n118   INT. MAILROOM - CONTINUOUS                                       118\n      Ryan now sits by the window, cellphone pressed to his ear.\n      Feigning frustration.\n\n                          RYAN\n                You believe this? Everyone's got\n                their head up their ass over there.\n      The Mail Clerk ignores him almost as much as Greer wants to.\n      Greer opens his cellphone to make a call, but when the signal\n      is no good, he wanders outside the mailroom toward the window\n      at the end of the hall.\n\n                          MAIL CLERK\n                    (impatiently)\n                Sir? You think you could just go\n                outside and get your clipboard?\n      Just then, Hodges and Craig come marching out of the vault.\n\n                            MAIL CLERK (CONT'D)\n                Sir?\n      Ryan glances at Greer, momentarily distracted on the phone.\n      At Hodges, almost out of the bank. As he and Craig near the\n      door --\n\n\n\n                                                                  75.\n\n118                                                                     118\n\n\n\n\n      A moment where Craig finally locks eyes with Ryan -- and\n      suddenly realizes: This is the guy!\n      It's now or never.   Ryan has to do something.\n\n                           MAIL CLERK (CONT'D)\n                 Sir!?\n\n                            RYAN\n                      (to Clerk)\n                 Screw the package.\n      Ryan stands and, unable to find anything better, snatches a\n      metal HAND TRUCK sitting by the door, and as Hodges walks by--\n\n                           MAIL CLERK\n\n                 WHAT ARE YOU DOING--?!\n      -- swings it full-force into Hodges' face -- WHAMM!!   Hodges\n      drops like a slaughterhouse cow.\n      Instantly, employees hit the ground; scream; run for their\n      lives. Craig dives for the DVD case. The Security Guard has\n      come to life; drawing down on them.\n\n                           SECURITY GUARD\n\n                FREEZE!\n      Craig does.   But Ryan grabs him and moves, racing out of the\n      bank.\n\n'-\n\n·/\n\n \"\n\n                           RYAN\n\n                COME ON, LET'S GO!\n\n119   INT. HALLWAY - OUTSIDE MAILROOM - CONTINUOUS                      119\n      At the end of the hall, GREER sees Craig and Ryan running out\n      of the mailroom. Drops his phone, draws his gun --\n\n                           SECURITY GUARD (OS)\n\n                FREEZE!!\n      -- just as the Guard comes running out. His gun was fixed on\n      Ryan, but now that he sees Greer with a piece, he trains his\n      gun on him instead.\n\n                          SECURITY GUARD (CONT'D)\n\n                DROP YOUR WEAPON!\n      Ryan and Craig are struck in the middle of the crossfire.\n\n                           GREER\n                     (flashing his badge)\n\n                L.A.P.D.! I'M A COP!\n\n                           SECURITY GUARD\n\n                DROP IT NOW!!\n      The instant Ryan and Craig try to escape into a nearby\n      stairwell -- Greer turns his gun on the SECURITY GUARD --\n\n      BANG! BANG!\n\n\n\n                                                                     76.\n\n119                                                                        119\n\n\n      -The Security Guard drops and Greer aims his weapon at Craig\n      again!\n      BANG! -- Greer fires.\n      Craig, SHOT IN THE BACK, slams against Ryan with the impact.\n      They fall half-in/half-out of the stairwell. Craig weakly\n      shoves the DVD into Ryan's hands.\n\n                             CRAIG\n                 ..run...\n      But Ryan is overwhelmed.       His legs feel like a thousand\n      pounds of jelly.\n\n                           CRAIG (CONT'D)\n                 ..ruuuUUUUNNNNNN!!\n      As Craig slumps to the ground, Ryan stares in shock -- but\n      when Greer starts sending a hail of bullets toward them, he\n      DIVES into:\n\n120   INT. STAIRWELL - DAY                                                 120\n      He starts flying down the stairs...but when he sees four\n      BUILDING SECURITY GUARDS racing up from below--\n\n                             RYAN\n                Damn!\n      --he turns around and starts RUNNING UP instead.\n\n121   INT. MAILROOM - DAY                                                  121\n      Hodges gets to his feet. Stumbles out, holding his gushing,\n      broken nose. Yells at Greer, who's racing into the stairwell.\n\n                             HODGES\n                The kid!!\n\n                             GREER\n                No shit.\n\n122   INT. STAIRWELL - DAY                                                 122\n      With the Guards and Greer only a floor behind, Ryan thinks\n      fast and CHUCKS HIS BIKE HELMET down the corridor, ELBOWS the\n      In-Case-Of-Emergency Glass, setting off the FIRE ALARM -- and\n      starts running UP.\n      Seconds later, when they reach that level, one of the Guards\n      sees Ryan's helmet and the broken glass leading away.\n\n                             GUARD\n                     (racing down the hall)\n                This way!\n      The other Guards follow...but Greer isn't convinced.       On a\n      hunch, he turns and continues running UP also.\n      Peeking over the edge from the floor above--\n\n\n\n                                                                  77 .\n\n122                                                                      122\n\n\n\n      RYAN\n      Sees Greer and Hodges coming.     Big-ass guns out and ready.\n      Shit.'\n      THE ALARM BELLS SCREAM.     PEOPLE start filling the stairwell\n      on every floor.\n      Forcing his body to its very limits, Ryan bolts up the stairs\n      until he sees the ROOF EXIT on the next floor up. He shoves\n      open the nearest door and continues running up to the roof.\n      He slips out and silently closes the door behind him just as--\n\n123   INT. STAIRWELL - DAY                                               123\n      GREER and HODGES reach the floor beneath. See the door\n      swinging shut -- but neither fall for the bait. They runs up\n      toward the-\n\n124   EXT. ROOF - DAY                                                    124\n      Ryan's eyes SCAN the rooftop. Construction is in progress up\n      here; tarpapering. Huge ROLLS OF TARPAPER lie about,\n      PALATTES holding supplies covered with TARPS, an industrial\n\n      AIR CONDITIONER...\n      Ryan quickly shoves a 2\"x4\" under the doorknob to jam it.\n      Heart pounding, he races to the building's edge and looks\n      down. Nothing but a straight drop 60 feet down.\n      Footsteps are approaching! POUNDING on the door! Ryan darts\n      behind a tarp-covered mass of supplies just as --\n\n125   EXT. ROOF - DAY                                                    125\n      GREER shakes the 2\"x4\" loose.     He and Hodges explode out onto\n      the roof, looking for Ryan.\n      Greer encircles the huge air-conditioner while Hodges hunts\n      behind a large SATELLITE DISH. No Ryan.\n\n                           GREER\n                     (to Hodges)\n                Here.\n      Cop-instincts crackling, Greer stands on one side of the tarp-\n      covered stockpile and waits for Hodges to secure the other.\n      This is it; they signal go at each other and spring around --\n      But Ryan's nowhere to be found!\n\n                             GREER (CONT'D)\n                Dammit!\n      No, wait! Greer turns and sees a LARGE ALUMINUM CHUTE that\n      leads from the roof and elbows down toward a DUMPSTER on\n      ground level.\n\n\n\n                                                                      78.\n\n125                                                                         125\n\n\n\n\n      Greer peers down the chute for long seconds...but nothing can\n      be seen from this angle. It all falls to blackness.\n\n      THE ALARM STOPS.\n      Greer cocks his head in the sudden eerie silence. The only\n      sounds are INCOHERENT SCREAMS coming from the stairwell. He\n      eyes where the chute empties into the dumpster, thinks...\n\n      REVEAL --\n\n126   INT. METAL CHUTE - CONTINUOUS                                         126\n      RYAN, wedging himself against the sides of the chute, tries\n      to be as still as possible. Every slight movement makes the\n\n      ALUMINUM BUCKLE AND GROAN.\n      From his shirt pocket, Jessica's tiny desperate voice pleads.\n\n                             JESSICA (VO)\n                  Ryan... ? Ryan, please answer me I\n      But Ryan just sits there.    Afraid to move.     Terrified to\n      discuss Craig.\n\n127   EXT. ROOF - CONTINUOUS                                                127\n      Greer picks up a large roll of tarpaper and starts lugging it\n      toward the open mouth of the chute...\n\n.28   INT. METAL CHUTE - CONTINUOUS                                         128\n      Ryan holds his breath.    Trembling.   His leg threatening to\n      rabbit-foot again.\n      Straining to hear Greer, it's impossible not to hear:\n\n                             JESSICA\n                  You have to talk to me! Ryan,\n                  please you have to talk to me--.'\n      The sweat from his hands causes the tiniest SLIP -- and as he\n      catches himself, there is a soft metallic BOOOONG from the\n      stressed metal.\n      Unable to ignore her pleas any longer, Ryan carefully pulls\n      the cellphone from his pocket and presses it to his ear.\n      Desperate to console her, Ryan --\n      BANG!! The TARPAPER ROLL flies down the chute. Ryan looks\n      up to see it angrily launching itself right at him!\n      He has to let go of the walls to avoid being hit.      He presses\n      himself to one side but --\n      WHAM!! The bloodthirsty roll bashes his wrist -- and he DROPS\n\n      SIMON COWELL'S CELLPHONE!\n\n\n\n                                                                       79.\n\n128                                                                          128\n\n\n\n\n      Ryan reaches out, but the phone goes sliding down the chute!\n\n                                                     CUT TO:\n\n129   INT. ATTIC                                                             129\n      Jessica hears a loud SCRAAAAPE, CRASH and a wash of STATIC.\n\n                               JESSICA\n                   Ryan?!    OH MY GOD, RYAN?!   RYAN--?!\n\n130   INT. KIDNAPPERS' SAFEHOUSE - LIVING ROOM - SAME TIME                   130\n      The hulking Deason hears Jessica's PANICKED VOICE and stands\n      with a start. As he moves toward the attic, he notices a\n      small RED LIGHT FLASHING behind the bar. As he passes, he\n      checks it out and--\n\n                              DEASON\n\n                   WHAT THE--?!\n      WHIP PAN DOWN to what Deason sees: The red light is on one\n      of the house phones. The LINE-IN-USE INDICATOR.\n      And it's lit.\n      Shaking like a bear pissing pineapples, Deason rages away\n      toward the attic...\n\n                                                    CUT TO:\n\n131   INT. ATTIC - CONTINUOUS                                                131\n      Jessica is curling herself into a tiny sobbing ball on the\n      floor when -- WHAMM! -- the attic door crashes open. Jessica\n      jumps. Deason looms there. Sees the phone.\n\n                              DEASON\n\n                   YOU STUPID BITCH!\n      Jessica hurls the phone receiver away.\n\n                             DEASON (CONT'D)\n\n                   WHO HAVE YOU TOLD?! WHO HAVE YOU\n\n                   TOLD?!\n\n                              JESSICA\n\n                   NO, DON 'T H URT M E--\n      Deason roars up and grabs Jessica's neck with one hand.\n      HURLS her across the attic and into the OLD MIRROR,\n      shattering it in a million pieces around her.\n      Desperate for anything, Jessica PALMS a TINY SHARD as she\n      struggles to her feet. A two-inch chip.\n\n                             DEASON\n\n                   YOU AND YOUR KID ARE DEAD!\n      She lowers her arm, defeated, out of breath...        You win.\n\n\n\n                                                                         80.\n\n       131                                                                     131\n\n\n\n\n\n                                    JESSICA\n                        Don't hurt me, and I'll do\n                        anything... Anything.. .\n             There is a promise in what Jessica offers that Deason\n             responds to. His fist FLASHES toward her throat, making her\n             flinch. But rather than hitting her, he wraps his meaty\n             fingers around her throat, almost daring her to stop him.\n             Jessica trembles, but that is all, and just as Deason begins\n             to enjoy his work, Jessica JABS at his face, but he predicted\n             as much and easily moves to deflect it -- SNICKK! -- she\n             flicks her wrist up and SLICES the underside of his upper\n             arm.\n             Deason flinches a little bit, like a bee sting, then laughs\n             as he notices the tiny SHARD in her hand--\n\n                              DEASON\n                        (sarcastic)\n                        Oooh.\n             --but that's when he HEARS it. A DRIPPING SOUND. Deason\n             looks down at his arm and is confused to see his entire shirt\n             sleeve SOAKED IN BLOOD. It literally pours from his arm onto\n             the floor like a river.\n             Deason drains white; dizzy.      He looks at Jessica, confused.\n\n                                   JESSICA\n                        Brachial artery. Pumps up to 30\n                        liters of blood per minute...and\n                        there's only five liters in the\n                        human body.\n             Three seconds later, Deason crumbles...and Jessica leaves the\n             attic.\n\n                                                         BACK TO:\n\n 132         INT. TRASH CHUTE - DAY                                            132\n             RYAN'S still trapped. Sounds of approaching SIRENS in the\n             distance. Ryan listens for Greer; is he still there?\n             BANG!!   BANG!!   Two more heavy TARPAPER ROLLS come right at\n             him!\n             The first one he gets lucky with, but the second NAILS HIM\n             before bouncing furiously away and Ryan loses his grip\n             completely and slides out of control.\n\n 133         EXT. ROOF - DAY                                                   133\n             GREER watches amazed when Ryan actually tumbles out of the\n             ass-end of the metal chute into the dumpster. He drops the\n             next roll of tarpaper ready to go and reaches for his gun --\n\n--.\n\n  -,\n\n\n\n                                                         CUT TO:\n\n\n\n                                                                   81.\n\n\n\n\n\n-434    EXT. INSIDE DJUMPSTER - CONTINUOUS                               134\n       RYAN is in serious pain.    He frantically fishes through the\n       refuse to find:\n\n       SIMON COWELL'S CELLPHONE\n       Or rather, what's left of it:      A million shattered pieces\n       scattered everywhere.\n       Ryan sifts through the plastic debris as if he had secretly\n       hoped he could still use it. Yeah, right... He's barely able\n       to sit up when --\n\n       BLAM!! BLAM!! BLAM!!\n       He ducks back down as bullets ricochet off the steel\n       dumpster.\n       As SIRENS get louder, closer, Ryan's got to make his move --\n       he jumps out of the dumpster, landing on his ass on the\n       opposite side of Greer.\n\n       BLAMM-BLAMM-BLAMM!!\n\n\n       Bullets ricochet off the steel dumpster and Ryan summons his\n       courage -- and takes off limping!\n\n135    EXT. ROOF - CONTINUOUS                                            135\n       BLAMM-BLAMM-BLAMM!! Greer's pistol is ill equipped for long-\n       range shooting. The kid's too far away by now. He grabs his\n       walkie --\n\n                            GREER\n                      (into walkie)\n                 The kid's outside, headed toward\n                 the front of the building--\n\n                            HODGES\n                 -Gotta go, boss. The Guard's dead.\n       Hodges waits by the rooftop door, looking concerned\n       as COPS spill out around him onto the roof.\n\n\n\n                            COPS\n                 Who the hell's shooting up here?\n       Greer points to Ryan bolting around the corner.\n\n                           GREER\n                 Sonofabitch shot the poor bastard\n                 right in front of us!\n\n                                                   CUT TO:\n\n136    INT. KIDNAPPERS' SAFEHOUSE - DAY                                136\n       Jessica races across the dead brown lawn toward the guest\n       house/prison that holds her son. Getting her first good look\n\n\n\n                                                                  82.\n\n136                                                                     136\n      at the secluded premises she's on confirms that screaming\n      would do no good. She's on her own.\n      When she reaches the guest house, she's shocked to find a\n      HUGE LOCK on the front door. Frantic, she makes her way\n      around the structure to a BIG BAY WINDOW. Though it's\n      protected by SECURITY BARS, she can see Ricky through the\n      glass.\n      Jessica pounds on the glass, and Ricky turns.    When her son\n      sees her, he races to the bars.\n\n                              RICKY\n                   Mom!\n\n                               JESSICA\n                   Baby!   Are you okay?!\n\n                              RICKY\n                   I can't get out!\n      Jessica looks around for something to bend the bars with.\n      There's nothing.\n\n137   EXT. THE MARTIN HOUSE - LATE AFTERNOON                            137\n      A gold FORD TAURUS pulls up in front. The driver door opens\n      and Mooney gets out. Walks to the front door and KNOCKS.\n      But this time, there's no answer.\n      Mooney rings the bell. Still nothing. Suspicious, he checks\n      around the side...and sees the back door SWAYING in the wind.\n\n138   INT. MARTIN HOUSE - KITCHEN - DAY                                 138\n\n\n      Mooney's cop senses scream as he walks inside. A POLICE\n      SCANNER chatters in the background. The place is a shambles.\n      Someone's been looking for something. He then sees-\n      BLOOD STREAKS the floor. It leads from over by the telephone\n      to underneath the pantry door.\n\n                             MOONEY\n                       (calling into house)\n                   Hello? L.A.P.D. Anybody home?\n      No answer.    Drawing his gun, Mooney stalks carefully into--\n\n139   INT. MARTIN HOUSE - THE ENTRYWAY - DAY                            139\n\n\n      A SMALL STAIRCASE leads up to the second floor. As Mooney\n      starts up the steps, BOOM UP to the top to REVEAL:\n\n      THE IMPOSTER JESSICA MARTIN (BAYBACK)\n      Hiding in ambush at the top of the stairs, gun in hand. She\n      listens to Mooney's footsteps and when she thinks he's neared\n      the top -- she springs out, blasting away down the staircase!\n      But Mooney's not there.\n\n\n\n                                                                  83.\n\n139                                                                     139\n\n\n\n                            MOONEY\n                 Drop your gun, now.   I got you.\n      Now we see him. Still down in the entryway, behind some\n      cover, gun aimed and steady.\n\n                            MOONEY (CONT'D)\n                 I said drop it.'\n      Bayback relaxes -- then WHIRLS around, disappearing down the\n      hall! Mooney curses and quietly jogs up the stairs,\n      following her into--\n\n140   INT. SHADOWY CORRIDOR - CONTINUOUS                                140\n      A narrow hallway with multiple OPEN DOORWAYS on each side.\n      The Imposter Jessica could be hiding in any one of them...\n      Taking care not to give himself away, Mooney inches down the\n      hallway. And just when he's thinking that he may have\n      successfully created an element of surprise for himself--\n      SFX: SQUEEEEAK -- the floorboards of the old house groan\n      softly -- GIVING HIS POSITION AWAY!\n      Instantly Bayback swings out from a doorway right next to\n      Mooney, taps her gun to his chest pulls the tang--\n      But Mooney DIVES OUT OF THE WAY! BLAMM-BLAMM-BLAMM!!   Two\n      miss, but the third shot NAILS HIS SHOULDER!\n      OOF! Mooney lands hard. Blood spreading out under his white\n      dress shirt. He cocks his head... listening for the sound of-\n      BAYBACK EJECTS A MAGAZINE and is about to reload--\n      Mooney JUMPS UP, RETURNS FIRE -- slamming Bayback against the\n      wall with two .38 caliber slugs. She collapses to the floor.\n\n                            MOONEY\n                Damn it!   DAMN IT!!\n      Angry, the adrenaline drowning out the pain, Mooney turns to\n      the kidnapper laying in the hall, bleeding out. Kicks her\n      gun away and kneels.\n      But for the first time, Bayback isn't tough.   Just scared.\n\n                          BAYBACK\n                ..a-ambulance...\n\n                          MOONEY\n                Tell me where Jessica Martin is or\n                you bleed to death right here.\n\n                          BAYBACK\n                ..p-please..call.. I.. I'm a--\n      Fuck this, Mooney kicks her ribs.\n\n\n\n                                                                   84.\n\n 140                                                                     140\n\n\n\n                            MOONEY\n\n                  WHERE IS SHE?!\n       Bayback struggles for air, reaching for him--\n\n                            BAYBACK\n                  ...I'm a cop...\n       Bayback squeezes her eyes shut against a wave of pain -- and\n       DIES. Mooney stares at her. What did she say? Starts\n       patting her down.\n       And that's when he finds her BADGE.     L.A.P.D.   23rd Precinct.\n       She is a cop.\n\n                              MOONEY\n                 Oh shit...\n       Mooney grits his teeth against a fresh wave of pain and picks\n       up the phone, dials 911.\n\n                            MOONEY (CONT'D)\n                 Request emergency back up and medical\n                 units! Officers down at-\n\n                                                   CUT TO:\n\n 141   EXT. CITY STREETS - DAY                                           141\n\n·»\n\n -\n       Ryan wanders the streets. Checks his wallet -- a measly four\n       bucks. Despair overtakes him and he almost gets CRUSHED as a-\n       TOW TRUCK speeds by -- An old Hyundai mounts it like a hippo!\n       A lightbulb clicks on for Ryan.\n\n                              RYAN\n                 Ho - shit!\n       Ryan bolts to the nearest BUS STOP just as a BLUE LINE BUS\n       pulls up.\n\n                                                   CUT TO:\n\n142    EXT. KIDNAPPERS' SAFEHOUSE - DAY                                  142\n       Jessica SMASHES A REAR WINDOW with a long thick branch and\n       uses it to try to pry the bars apart. The limited leverage\n       won't enable her to bend them enough for Ricky to squeeze\n       through.\n\n                            RICKY\n                 Faster Mom!\n       And just then--\n\n       SFX: GRAVEL CRUNCHING IN THE DRIVEWAY\n       Jessica leans her head around the back corner of the\n       guesthouse -- and sees the Escalade pulling in!\n\n\n\n                                                                85.\n\n142                                                                   142\n\n\n\n\n\n                        JESSICA\n                  (to Ricky)\n                  Get down! Get down!\n       And Jessica DUCKS OUT OF VIEW just as the--\n\n143    EXT. KIDNAPPERS' SAFEHOUSE / INT. ESCALADE                     143\n       Pulls into the driveway.\n        Greer and his team are going over surveillance photos taken\n        from the cameras at the Fegan Securities Building. The\n  hotos are useless, though, as Ryan's face is obscured by his\nE helmet and visor.\n\n                            GREER\n                 These are the best pictures you\n                 could get of him?!\n\n                            ELLIS\n                 He was wearing a visor.\n       Greer glares at him -- no shit -- and throws the pictures .\n\n                            GREER\n                 Useless!\n       The car parks and Greer storms out, followed by Ellis and\n       Hodges. They head for the house, and the moment they enter --\n       Jessica reappears. But now she's STARING at something.\n       The Escalade.\n\n                            JESSICA\n                      (to son; through window)\n                 Baby, listen to me. I want you to\n                 get away from this window. I want\n                 you to go to the other side of the\n                 room as far away from the door as\n                 you can --\n\n                            RICKY\n                 No, don't leave me!     Don't leave\n                 me!!\n       The terror in his voice breaks Jessica's heart.\n\n                            JESSICA\n                 Honey, I'm getting you out of\n                 there!\n\n                            RICKY\n                 Where are you going?!\n\n                            JESSICA\n                 I'm only gonna be gone a second,\n                 and then we're gonna go home, but\n                 you have to do this first. It's\n                 gonna be loud, but don't be scared,\n                 okay? Now go find somewhere safe\n                 like I told you.\n\n\n\n                                                                  86.\n\n143                                                                     143\n\n\n\n\n      Ricky n9ds and runs off into another room of the house.      And\n      as Jessica rushes for the Escalade --\n\n                                                  CUT TO:\n\n144   EXT. JESSICA'S HOUSE - LATE AFTERNOON                              144\n\n\n      PARAMEDICS apply a bandage to Mooney's shoulder.      Mooney's\n      pretty shaken up.\n\n                           PARAMEDIC #1\n                You're lucky. Shot went clean\n                through. A few inches either\n                way...\n      Mooney watches other PARAMEDICS carry sheet-covered corpses\n      into awaiting ambulances. Flashbulbs POP from inside.\n      A sedan pulls up and Mooney's relieved to see Tomlin get out.\n\n                           DETECTIVE TOMLIN\n                What the hell, Moon? It's all over\n                the radio.\n\n                           MOONEY\n                Jack, she didn't identify herself.\n\n                          DETECTIVE TOMLIN\n                What are you saying?\n\n                           MOONEY\n                I shot a cop!\n                     (lowering his voice)\n                Dana Bayback. From the 23rd.     She\n                was one of the kidnappers.\n      Tomlin looks stunned by the revelation.\n\n                           DETECTIVE TOMLIN\n                Let me call the tw9~three. See\n                what the hell's going on.\n      Tomlin pulls out a cellphone.\n\n                          MOONEY\n                I hate to think more cops are\n                involved, but--\n\n                           DETECTIVE TOMLIN\n                Did she say anything about the\n                Martin woman?\n\n                          MOONEY\n                ...Never got the chance.\n      Detective Tomlin frowns.\n\n                                                 CUT TO:\n\n\n\n                                                                  87.\n\n\n\n\n\n\n\n145   EXT. POLICE. IMPOUND YARD - LATE AFTERNOON - ESTABLISHING         145\n      A GONZOLEZ TOW TRUCK drives up (like the one we saw at the\n      airport), and stops temporarily beside:\n      Simon Cowell, from the CADILLAC XLR incident, who stands at\n      the window, screaming at the JADED CASHIER.\n      His car idles just on the other side of an IMPOSING FENCE.\n\n                               SIMON COWELL\n                    Just give me my goddamned car!\n\n                               JADED CASHIER\n                    Don't take that tone of voice with\n                    me, sir. I've already told you, we\n                    do not release vehicles until all\n                    impound fees are paid.\n      In the E.G., NOTICE Ryan skulking closer, behind the GONZALEZ\n\n      AUTO TOW TRUCK.\n\n                          SIMON COWELL\n                But I didn't cause it to get\n                impounded! Can't you understand\n                that?! It was stolen from me!\n\n                           JADED CASHIER\n                Sir, do you want the car back or\n                not?\n      Noticing Cowell standing at the window, Ryan presses further\n      into the shadows, not wanting to be noticed.\n\n                              SIMON COWELL\n                Yes!     But I'm not paying for it!\n      The Cashier signals a GRUNGY YARD WORKER on the other side of\n      the fence.\n\n                           JADED CASHIER\n                Nevermind, Howie. Take 'er back.\n      Howie nods, and just as he's about to drive the Cadillac back\n      into the yard --\n\n                           SIMON COWELL\n                Wait, wait! All right you bloody\n                fascist, I'll pay. But if there's\n                even the slightest scratch on it...\n      Howie smiles, thought so, gets out and splits. As Cowell\n      angrily starts making out a check, the Cashier flicks the\n      switch to open the gate, and as it opens--\n      Ryan slips in. He sneaks behind the wheel of the idling\n      Cadillac. And the moment Cowell hands over his check --\n      VRRRROOOM!!    Ryan burns rubber out of there.\n\n\n\n                                                                  88.\n\n145                                                                     145\n\n\n\n                            SIMON COWELL (CONT'D)\n                 Hey, that's my car!\n       Cowell chases it -- and watches in horror as Ryan takes a\n       speed bump too fast and TEARS THE REAR BUMPER OFF THE\n\n       CADILLAC XLR CONVERTIBLE IN AN EXPLOSION OF SPARKS!\n\n                            SIMON COWELL (CONT'D)\n                 NOooooooo...!!\n\n146   EXT. SURFACE STREETS - LATE AFTERNOON                             146\n      As he zooms away, Ryan searches the passenger seat with his\n      free hand. He hunts through the car and finds -- HIS BLUE\n\n      TOOTH VIDEO CELL PHONE!\n\n                              RYAN\n                 Thank you!\n      As he flips it open, his eyes spot THE LAPTOP on the floor of\n      the passenger seat.\nRyan thinks, pulls out his SECURITY DVD and pops it in.\nAt first, the SCREEN is a mere wash of digital gobbledygook--\nAnd as Ryan grunts with frustration --\n--a Hi-Res QUICKTIME MOVIE suddenly fills the screen:\n\n47    ANGLE ON LAPTOP MONITOR - FOUR WAY SPLIT SCREEN                   147\n      The Fagen Securities Building parking lot. A police pursuit\n      in progress. Three Police Cars skillfully box in a BMW with\n      TWO HISPANIC YOUTHS, forcing it to come to a dead stop.\n      GREER and HODGES explode from their cars, guns drawn.\n      BAYBACK and ELLIS come from the back. DEASON appears, and he\n      and HODGES yank the teens out of the car, who struggle\n      frantically to avoid vicious baton blows. When one decks\n      Hodges and tries to run, ELLIS SHOOTS HIM in the back!\n\n      WE QUICKLY PAN TO ANOTHER ANGLE:\n      Inside the building, CRAIG gets up from his chair, hurries\n      into-\n\n      WE PAN DOWN TO ANOTHER ANGLE\n      As Craig enters frame inside the Security Office.   And\n      watches live-\n\n      ANOTHER ANGLE:\n      GREER wastes no time in SHOOTING the second man execution\n      style!\n\n\n\n                                                                   89.\n\n\n\n\n\n-148    IN THE CADILLAC XLR CONVERTIBLE                                  148\n       RYAN watches in horror. He PULLS OVER, too riveted to drive\n       and watch simultaneously. Finally understanding the\n       magnitude of this disc.\n\n149    ANOTHER ANGLE:                                                    149\n       And as BAYBACK drags a DEAD HISPANIC YOUTH out of the frame,\n       legs disappear off-screen in short bursts.\n\n       PAN DIAGONALLY TO ANOTHER ANGLE:\n       And more terrifying, GREER stops picking up shell casings,\n       turning his head ominously toward the CAMERA! Noticing us!\n       Greer motions to several others; DEASON and BAYBACK, who rush\n       OUT OF FRAME toward the front entrance.\n       ANGLE ONE: At the SIDE DOOR, ELLIS and HODGES start kicking\n       in the door with full force.\n       ANGLE TWO: GREER, outside, unholstering his GUN at the\n\n       DELIVERY ENTRANCE.\n\n                                                   BACK TO:\n\n150    EXT. SURFACE STREETS - AFTERNOON                                  150\n       RYAN glances at the cellphone in his hand -- gets an idea!\n\n                                                   CUT TO:\n151    ANGLE ONE: Ellis and Hodges finally kick open the door and 151\n       rush inside--\n       ANGLE THREE:     The COPS rush inside the building, consult the\n       Directory...\n       ANGLE FOUR:    Craig, panicked, reaches over to the DVD\n       Recorder --\n\n152    EXT. SURFACE STREETS - AFTERNOON                                  152\n       THE LAPTOP MONITOR -- ALL STATIC.    The recording has stopped.\n\n                            RYAN\n                 I'm so screwed.\n       As Ryan speeds away from the curb, he fingers his cellphone.\n\n       SERIES OF INTENSE SHOTS:\n\n153    INT. KIDNAPPERS' SAFEHOUSE - DAY                                  153\n       -- GREER walking up the safehouse stairs, step by step\n       nearing the attic that Jessica's supposed to still be in...\n\n\n\n                                                                  90.\n\n\n\n\n\nV\n\n 54   EXT. KIDNAPPERS' SAFEHOUSE - DAY                                  154\n      -- JESSICA quietly opening the door of the Escalade(\n      trying not to give herself away. She climbs in behind the\n      wheel, and says a silent prayer of thanks when she sees that\n      the keys are still dangling in the ignition.\n\n155   EXT. SURFACE STREETS - DAY                                        155\n      -- RYAN, in the speeding Cadillac XLR, selects LAST INCOMING\n      CALL on the cellphone. Holds his breath.\n\n156   INT. KIDNAPPERS' SAFEHOUSE - STAIRWELL LEADING TO ATTIC       156\n      As Greer reaches the first landing, the HOUSE PHONE starts\n      RINGING. Ignoring it, Greer continues on and is about to turn\n      the corner to the attic when --\n\n                           HODGES (OS)\n                Boss, you better take this.\n      Greer stops, a footstep away from seeing the open attic door.\n      From the bottom of the steps, Hodges tosses him a CORDLESS\n      PHONE. Greer puts it to his ear.\n\n                             GREER\n                What?\n\n                                                  MATCH CUT TO:\n\n.57   EXT. SURFACE STREETS - DAY                                        157\n      Ryan, inside the Cadillac XLR, growls into the cellphone.\n\n                          RYAN\n                Shut up and listen to me, asswipe.\n                I got what you want.\n\n                          MALE VOICE (VO)\n                Who is this?\n\n                           RYAN\n                You know who this is, shithead!\n\n                                                  CUT TO:\n\n158   INT. TELEMARKET BULL PEN - DAY/EXT. SURFACE STREETS           158\n      To our surprise, Ryan isn't talking to Greer...but to the\n      same TELEMARKETER that called him earlier.\n\n                           TELEMARKETER\n                Look, sir, we can take your name\n                off our list if you want, but you\n                don't have to get nasty--\n\n                             RYAN (VO)\n                What--?    Who is this?\n\n                              TELEMARKETER\n                Mark.     At Mastercharge Credit Union-\n\n\n\n                                                                     91.\n\n158                                                                        158\n\n\n\n\n\n                             RYAN (VO)\n *59             A frickin' telemarketer? But I                            159\n                 just hit \"Last Incoming Call\"--\n       Ryan suddenly puts it together.\n\n                            RYAN (VO) (CONT'D)\n                 You bastard.\n       The Telemarketer quickly hangs up before it gets ugly.\n\n                                                      CUT BACK TO:\n\n159    INT. KIDNAPPERS' SAFEHOUSE - JUST OUTSIDE ATTIC                     159\n       Greer listens intently to a call.   So who is on his end of\n       the phone? Tomlin.\n\n                            TOMLIN (VO)\n                 Look, Captain, we've got to do\n                 everything we can to protect this\n                 guy. I mean, shit, with all his\n                 years in he's owed a little.\n\n160    INTERCUT CALL - GREER JUST OUTSIDE ATTIC/                           160\n\n       TOMLIN STANDING NEXT TO MOONEY OUTSIDE JESSICA'S HOUSE\n\n                            GREER VO\n                 He's with you? How'd he find out?\n\n                            TOMLIN\n                 Said something about a kid who came\n                 into the station earlier--\n       Greer grimaces, putting it together.\n\n                            GREER\n                 Early twenties? Stumbled out of\n                 Brian Wilson's hamper?\n\n                             TOMLIN\n                 Yeah.   Something like that.\n\n                            GREER\n                 Tomlin. Take care of him.      No\n                 witnesses.\n       That's more than Tomlin bargained for.\n\n                            TOMLIN\n                 Are you sure that's necessary, sir?\n\n                            GREER\n                 You know once the shitstorm starts,\n                 there's nothing I can do to save\n                 you.\n\n                            TOMLIN\n                 Sure. That's what I thought.        I'll\n                 tell him.\n\n\n\n                                                                   92.\n\n  160                                                                    160\n\n\n\n\n        Tomlin hangs up with a calm FLICK.   The Paramedic finishes up\n        Mooney's bandage.\n\n                              PARAMEDIC #1\n                   Keep pressure on it until you get\n                   it stitched.\n\n                            MOONEY\n                  What's the word?\n\n                              TOMLIN\n                  Not g9od. I.A.'s not throwing out\n                  any lifelines with all that's going\n                  on.. .\n                        (re: Mooney's sh9ulder)\n                  Come on. You can write a statement\n                  while I take you to the hospital.\n\n                                                  CUT TO:\n\n  161   INT. KIDNAPPERS' SAFEHOUSE - STAIRWELL LEADING TO THE ATTIC 161\n        Greer slips the cordless into his jacket pocket, continuing\n        up the stairs. Hodges follows, staring expectantly.\n\n                              HODGES\n                  Well?   What'd he say?\n\n                             GREER\n                  You know a desk jockey named\n                  Mooney?\n\n                             HODGES\n\n                  -- HOLY SHIT!\n        Greer sees Hodges gaping up the stairwell. Following his\n        look, Greer turns...and sees the attic door WIDE OPEN!\n        Further in, he can make out Deason's bloody body and the\n        rigged-together phone...\n        In fact, the only thing Greer doesn't see is Jessica.\n\n                             GREER\n\n                  NO!\n        Greer turns and pounds down the stairs.\n\n                                                  BACK TO:\n\n 162    EXT. KIDNAPPERS' SAFEHOUSE - DAY                                 162\n\n        JESSICA - IN THE ESCALADE\n        She TWISTS the key and STOMPS the gas, sending the monster\n        SUV on a collision course with -- SMASHHH -- the guest house\n        window! The bay window SHATTERS and the security bar SNAP\n        LIKE TWIGS as the Escalade BULLDOZES through!\n\n--\n\n *,\n\n\n        Unable to open the door because of all the debris, Jessica\n        rolls down the window and yells to her son --\n\n\n\n                                                                   93.\n\n 162                                                                     162\n\n\n\n-^               -..           JESSICA\n                  Ricky!    Come on!\n       -- but he's frozen in fear at all the noise and dust.    He\n       shakes his head. No.\n\n                             JESSICA (CONT'D)\n                  Baby, please! It's okay now.\n                  We're gonna go home!\n                       (glances back nervously)\n                  Ricky, please!\n       Somehow, the kid digs deep and finds the courage to run to\n       the Escalade, where his mother scoops him up into the cab\n       just as--\n       The kitchen door bursts open and Greer's team spills out into\n       the yard. They spot her instantly.\n\n                            ELLIS\n                  Get out of the car!    Get out of the\n                  goddamned car!!\n       As they rush at her--\n\n163    EXT. KIDNAPPERS' SAFEHOUSE/INT. ESCALADE - CONTINUOUS             163\n       Jessica throws the big car in reverse and tries to back out --\n       but the Escalade's stuck! Caught by the debris, the wheels\n       just spin.\n\n                              JESSICA\n                 Come on!    COME ON!!\n       Jessica rocks the car forward, and back. Forward, and back.\n       And just as it finally comes loose -- KRRRAAASHHH!!\n       The window next to Jessica's head EXPLODES in a shower of\n       tempered glass, shocking us. Two arms snake in and wrap\n       around Jessica's neck. Greer.\n       But Jessica STOMPS ON THE GAS, hoping the big car will pull\n       her free.\n       It doesn't. As the Escalade surges away across the lawn,\n       Greer's vice-like grip holds, PULLING JESSICA OUT the broken\n       window and -- THUMP! -- to the guest house debris below.\n       As Jessica watches in horror:\n\n       THE DRIVERLESS ESCALADE\n       Careens down the driveway and crashes into a pillar.    Hodges\n       races over and yanks Ricky out.\n\n       GREER\n       Balls his fist in Jessica's hair and yanks her around hard.\n\n                            GREER\n\n                 WHO DID YOU TELL?!\n\n\n\n                                                                 94.\n\n163                                                                    163\n\n\n\n\n\n                            JESSICA\n                 Nobody!\n\n                            GREEK\n\n                 LYING BITCH! ! WHO WAS THAT KID IN\n\n                 THE MAIL ROOM?!\n      Jessica screams as he yanks her to her knees.\n\n                             RICKY\n                 Stop it!   Don't hurt her!!\n      Seething mad, Greer rips his gun from its holster and is\n      literally about to blow Jessica's brains out when--\n\n      SFX:   THE CORDLESS PHONE IN GREER'S POCKET STARTS RINGING!\n      The entire world stops. There's an awkward moment: Jessica\n      cowering, Greer recovering, the phone just ringing and\n      ringing... The telephone is the only sound in the world,\n      getting louder and louder with each ring until--\n      Greer answers it.\n\n                            GREER\n                 Bad timing, Tomlin.\n      But it isn't Tomlin on the phone this time.       It's--\n\n                           RYAN (VO)\n                 Feel like a trade?\n\n                                       INTERCUT PHONE CALL:\n\n164   EXT. RYAN IN CADILLAC / EXT. GREER OUTSIDE SAFEHOUSE             164\n      Greer snaps his fingers at Hodges, indicating it's Ryan.\n\n                           GREER\n                 The mysterious bike messenger.   How\n                 did you get this number?\n      In the Cadillac, PUSH IN on Ryan t9 show the CELLPHONE MANUAL\n      he picked up at the Verizon store in his hand.\n\n                           RYAN\n                Gotta love modern technology... My new\n                phone knows the numbers of the last\n                fifty incoming calls.\n\n                           GREER\n                What do you want?\n\n                           RYAN\n                Just the woman and her kid.\n\n                           GREER\n                Who are you? What's your name?\n\n\n\n                                                              95.\n\n164                                                                 164\n\n\n\n\n\n                           RYAN\n                My name is F you. I've got your\n                shit, pal, it doesn't work that\n                way.\n\n                           GREEK\n                Really?\n                     (turns to Ellis)\n                Go cut the kid's throat.\n      Though Ryan's eyes widen in panic, his voice remains cool.\n\n                             RYAN\n                Fine.     Your loss.   Nice talking to\n                you.\n      And Ryan hangs up. He waits nervously, sweating, staring at\n      the phone for the longest seconds of his life--\n\n                              RYAN (CONT'D)\n                Ring.     C'mon, damn it, ring!   RING!\n      Then it does. Ryan waits a couple rings, slowing his\n      speeding heart, then nonchalantly picks up.\n\n                          GREER\n                So, how do you want to do this?\n\n                          RYAN\n                Put on a big ass Ronald McDonald smile,\n                apologize to the kid and the woman and\n                bring 'em to the Santa Monica pier.\n\n                              GREER (VO)\n                No.     Somewhere quieter.\n\n                           RYAN\n                Dude, you're lucky I'm still\n                talkin' to your sorry ass. You do\n                as I say, exactly as I say, or I\n                hang up now and slap this bitch on\n                Nightline, you know what I'm\n                sayin'?\n      There's a long beat.\n\n                             GREER (VO)\n                Fine.    But you come alone.\n\n                             RYAN\n                Done.\n\n                           GREER (VO)\n                How will I recognize you?\n\n                           RYAN\n                You let me worry about that.\n                What's your cell number?\n\n                          GREER (VO)\n                (310) 555-8342. An hour then?\n\n\n\n                                                                   96.\n\n164                                                                      164\n\n\n\n\n\n                            RYAN\n                 I can hardly wait.\n      Ryan hangs up.    A scared, but satisfied smile...\n\n                                                   CUT TO:\n\n165   EXT. WAREHOUSE DISTRICT - DAY                                      165\n      MOONEY - In the sedan's shotgun seat, is trying to write his\n      statement. But with his bad shoulder, it's useless.\n      He winces in pain when the sedan jerks at a four-way stop.\n\n                      MOONEY\n                (to Tomlin)\n                Shouldn't we be on Pico?\n      To the right, some PEOPLE wait for a bus.      Tomlin turns left.\n\n                            TOMLIN\n                County will have a six hour wait.\n                Ten if they know you're a cop.\n      Mooney grunts his gratitude as Tomlin heads toward a\n      wasteland of warehouses. And just as any potential witnesses\n      vanish from sight --\n      Tomlin's cellphone RINGS!      He lowers the gun and answers the\n      call.\n\n                            TOMLIN (CONT'D)\n                Yeah?\n\n                          GREER (OS)\n                Is it taken care of?\n\n                            TOMLIN\n                Not yet.\n\n                            GREER (OS)\n                Good. We're making a trade with the\n                kid at the Santa Monica Pier. Your\n                boy can ID the kid for us. Bring him\n                down.\n\n                      TOMLIN\n                (relieved)\n                I'm on it.\n      Tomlin flips his phone closed and turns the car around.\n\n                            TOMLIN (CONT'D)\n                We caught a break with the kid. He's\n                been spotted on the pier. Think you\n                can hang on a little longer? Just\n                enough to ID the kid before we patch\n                you up?\n      Mooney clearly doesn't want to say \"no.\"     But it hurts.\n\n\n\n                                                               97 .\n\n165                                                                   165\n\n\n\n\n\n                           TOMLIN (CONT'D)\n                 Whaddaya say? Up to you.\n      Beat.\n\n                           MOONEY\n                 Let's solve the goddamn thing.\n\n                                                  CUT TO:\n\n166   THE OCEAN - SUNSET                                              166\n      An AERIAL SHOT at magic hour, tracking up the coast to the --\n\n167   EXT. SANTA MONICA PIER - SUNSET                                 167\n      Boats clog the water, and th9usands of SPECTATORS line the\n      shores of the Pacific, watching the HEAL THE BAY concert on\n      the pier.\n      With all the CHEERING, DANCING and DRINKING going on, it's\n      like Times Square on New Years Eve.\n\n168   EXT. THE BLUFF - CONTINUOUS                                     168\n      Ryan drives up in the Cadillac XLR and parks. A group of\n      COLLEGE FRIENDS stare enviously at the car as Ryan gets out.\n\n                           ENVIOUS COLLEGE KID\n                Lucky bastard...\n\n                           RYAN\n                You like it?\n                     (tosses him the keys)\n                Happy Birthday.\n      THUD. The Friends' jaws hit the ground. And as they run to\n      the Cadillac XLR, Ryan disappears into the crowd...\n\n169   THE KIDNAPPERS' BLACK VAN - SANTA MONICA PIER                   169\n      Creeps down the wooden bridge and stops at the bottom; the\n      base of the pier.\n      Inside, Hodges sits behind the wheel; Jessica and Ricky lay\n      bound and gagged in back.\n      Hodges lifts his Nextel and thumbs the button.\n\n                           HODGES\n                I'm in position.\n\n                                                  CUT TO:\n\n170   EXT. CAROUSEL ROOF                                              170\n      Greer and Ellis are on top of the CAROUSEL BUILDING. Ellis\n      lays on his belly with a POLICE SNIPER RIFLE and some fuzzy\n      PHOTOS of Ryan from the mailroom.\n\n\n\n                                                                   98.\n\n 170                                                                     170\n\n\n\n\n\n                               GREEK\n                  Copy.\n\n 171   POV - THROUGH ELLIS' SNIPER SCOPE                                 171\n       Excellent magnification. We skim the faces of the crowd,\n       hunting for Ryan and locates HODGES.\n\n                                                   CUT TO:\n\n 172   EXT. CAROUSEL ROOFTOP - OVERLOOKING THE PIER                      172\n       Greer is talking to Ellis, who's scanning the crowd ROCKING\n       to the concert --\n\n                           GREER\n                 Only take the kid out if it's\n                 clean. No guess work. The last\n                 thing we need's a stampede.\n       Greer paces anxiously -- when suddenly his Nextel RINGS.     He\n       answers it, though it's hard to hear over the music.\n\n                              GREER (CONT'D)\n                 You here?\n\n                              RYAN (VO)\n                 Yeah.\n\n·-\n\n\n       Greer nods to Ellis -- It's him.     Find him.\n\n                            GREER\n                 How do you want to do this?\n\n                            RYAN (VO)\n                 First show me that Jessica and the\n                 kid are okay.\n\n                            GREER\n                 Do you have the disc?\n\n                               RYAN (VO)\n                 Yes.     Where are they?\n\n                           GREER\n                 See the black van at the bottom of\n                 the bridge? Passenger side window.\n\n                             RYAN (VO)\n                 Hang on.\n                      (beat)\n                 Okay, got it.\n       Greer muffles the phone against his leg.     Whispers to Ellis:\n\n                            GREER\n                 He's within visual of the car.\n       Greer takes his police walkie and toggles it.\n\n*'\n\n *\n\n\n\n                                                               99.\n\n172                                                                  172\n\n\n\n\n\n                            GREEK (INTO WALKIE) (CONT'D)\n                 Hodges, show the woman. Lower the\n                 passenger side window only.\n\n                                                   CUT TO:\n\n173   EXT. KIDNAPPERS' VAN                                           173\n      The PASSENGER-SIDE TINTED WINDOW rolls down.\n      Hodges sits Jessica up, then her kid, displaying them for a\n      few seconds before powering the window back up.\n\n                                                   CUT TO:\n\n174   EXT. CAROUSEL ROOFTOP                                          174\n\n                           GREER (INTO PHONE)\n                 Did you see that?\n\n                             RYAN (VO)\n                 Yes.\n      Greer muffles the phone again.      Whispers to Ellis.\n\n                           GREER\n                He's around the passenger side.\n                Have you found him yet?\n\n                             ELLIS (VO)\n                No.\n                     (throws his photos)\n                I don't know what the hell he looks\n                like!\n\n                          GREER\n                He's the one on the cellphone, you\n                idiot 1\n\n175   POV - ELLIS - THROUGH HIS SNIPER SCOPE                         175\n      Everyone in the crowd is on a cellphone.\n\n                          ELLIS (VO)\n                Everyone's on a cellphone! I've\n                got like fifty possible targets\n                here!\n      Ellis' cross hairs flit from one person on a cell, to\n      another, to another...\n\n                                                  CUT TO:\n\n176   EXT. SANTA MONICA PIER                                         176\n      TOMLIN AND MOONEY move along the crowd, scanning the sea of\n      spectators for Ryan. Mooney moves more slowly behind Tomlin,\n      skin looking pale, sheened in sweat and laboring for breath\n      as they hike up the bridge.\n\n\n\n                                                                        100.\n\n\n\n\n\n     77   EXT. CAROUSEL ROOFTOP                                                177\n\n                                  GREER\n                     Your turn.    Now you show me\n                     something.\n\n                               RYAN (VO)\n                     No. Put them on the Ferris wheel.\n                     I want to see them safe first.\n\n                                GREER\n                     That wasn't part of the deal.\n\n                                RYAN (VO)\n                     Deal's changed.\n\n                                                        MATCH CUT TO:\n\n 178      EXT. SANTA MONICA PIER - BLUFF - NIGHT                               178\n          The top of the bluffs, overlooking the pier below.       Among the\n          crowd, some SKATE RATS scare the ELDERLY.\n\n                                  RYAN (VO)\n                    I've been thinking. Does me no\n                    good to hand over the DVD and then\n                    you and the funky bunch take us\n                    out.\n-x\n\n                               GREER (VO)\n                    I swore I wouldn't do that.\n\n                               RYAN\n                    Like you swore to protect and\n                    serve?\n          The reference brings Greer up short.       There's a moment, then:\n\n                               GREER\n                    You know a lot...\n\n                              RYAN\n                    And I'll forget a lot, too. But\n                    not until they're both out of\n                    danger.\n          Now PAN AROUND TO REVEAL Ryan among the crowd, wearing a\n          SURFING WINDBREAKER; HOODED with WATERPROOF POCKETS -- but\n          where's his cellphone?\n          Moving closer, we see Ryan's wearing the EARBUD MIKE from the\n          Verizon store. With the earbud concealed under the loose\n          hood, Ryan looks like anyone else just watching the show.\n\n                               RYAN (CONT'D)\n                    Your choice, man. The Martins or\n                    the DVD. Either way, I'm not\n                    hanging around any longer. You got\n                    five seconds, then I disconnect\n                    your ass.\n\n\n\n                                                                 101.\n\n178                                                                     178\n\n\n\n                            GREEK\n                 You sure you know what you're\n                 doing?\n\n                               RYAN\n                 One...     Two...\n      On the other end of the phone:\n\n179   EXT. CAROUSEL ROOFTOP - CONTINUOUS                                179\n      GREER wrestles with his better judgment--\n\n                              RYAN\n                 Three...    Four...\n      --but Ryan's got him by the balls.     Angrily, Greer lifts his\n      walkie.\n\n                           GREER\n                Okay! Okay.\n                     (into walkie)\n                Hodges, put 'em on the Ferris\n                wheel.\n\n                              HODGES (VO)\n                What? I\n\n                           GREER\n                Shut up and do it!\n\n                          RYAN\n                Not bad. Most people never get\n                past two.\n      Greer flinches as his own taunts are used against him.\n\n                           GREER\n                     (to Ellis)\n                Keep an eye on them. As soon as we\n                make the trade, take the woman and\n                her kid out.\n\n                                                  CUT TO:\n\n180   EXT. SANTA MONICA PIER - BLUFF - NIGHT                            180\n      RYAN watches from a distance as Hodges exits the van.\n\n                          GREER (VO)\n                Don't screw me kid, y9u won't live\n                long enough to enjoy it.\n\n                           RYAN\n                Oooh, I think I just pissed myself.\n      Ryan looks optimistic when Hodges gets out and opens the back\n      door. And just as he's on the brink of success--\n\n                              FEMALE VOICE (OS)\n\n                HEY--!\n\n\n\n                                                                   102.\n\n 180                                                                      180\n\n\n        A woman's HAND grabs the hood of Ryan's windbreaker and rips\n        it away from his face. Wheels him around. It's:\n\n                             CHLOE\n                  There you are! Where the hell were\n                  you! ?\n\n                               RYAN\n                  Chloe!    Get away from here!\n\n                            CHLOE\n                  Know how many hours I waited for\n                  you to bring back those stupid\n                  shirts?! What'd you do? Sell them\n                  on the Prominade yourself--?\n        But Ryan's got no time for this.\n\n                                 RYAN\n\n                  GO!    NOW!!\n\n181     EXT. SANTA MONICA PIER - NIGHT                                    181\n       A sickly-looking MOONEY glances at the commotion -- and sees\n       the hoodless Ryan.\n\n                             MOONEY\n                       (motioning to Tomlin)\n                  That's him! There he is!\n\n 12     EXT. SANTA MONICA PIER - BLUFF - NIGHT                            182\n       Ryan desperately tries to shoo Chloe away.\n\n                            RYAN\n                  It isn't safe to talk, get it? I --\n                  People are after me!\n\n                             CHLOE\n                      (shrugs free)\n                  What -- are you high?\n       Suddenly, Mooney steps up beside Ryan and grabs him.\n\n                        MOONEY\n                  (winded)\n                  I've been..looking for..you, kid--\n       But Ryan struggles, thinking Mooney is with the bad guys.\n       Mooney grabs him as he tries to make a break for it.\n\n                            RYAN\n                 Let go of me! Sonofabitch, let go!\n\n                                                   MATCH CUT TO:\n\n183    EXT. CAROUSEL ROOF - NIGHT                                         183\n-s\n       GREER's pissed.     Pacing on the roof, when:\n\n\n\n                                                                 103.\n\n183                                                                     183\n\n\n               t_             ELLIS\n                    I've got him!\n      Instantly, Greer jams the walkie to his face, and we--\n\n                                                CUT TO:\n\n184   INT. THE KIDNAPPERS' VAN - NIGHT                                  184\n      HODGES is about to let Jessica out of the van, when he hears--\n\n                          GREER (OVER WALKIE)\n                Hodges, do not let them go! Do you\n                hear me? Do not let them go!\n\n                                                BACK TO:\n\n185   EXT. SANTA MONICA PIER - NIGHT                                    185\n\n\n      RYAN struggles with Mooney. The crowd completely ignores\n      them in favor of the raucous concert.\n      In the heat of battle, Ryan's cellphone clatters by Chloe' s\n      feet.\n\n                          MOONEY\n                    (sweating profusely)\n                Jesus, kid, calm down!!\n      Trying to break Mooney's stronghold, Ryan SHOVES him\n      backwards, SLAMMING his injured shoulder into the PIER\n\n      RAILING.\n      Mooney SCREAMS out in pain and grabs his shoulder, releasing--\n      Ryan, who BREAKS AWAY and turns to see Mooney COLLAPSE to the\n      ground, holding his blood-soaked shoulder. Ryan looks over\n      to Chloe, whose face is a combination of shock and confusion.\n\n                           CHLOE\n                Oh my God--\n                     (checking Mooney)\n                Someone call 911!\n      A CROWD starts to gather when --\n      Ryan feels the barrel of a gun nudging his back.     Tomlin's\n      gun.\n\n                           TOMLIN\n                It's over kid.\n      Fuck! Ryan's got no choice but to slowly walk toward the end\n      of the pier.\n      MOONEY - From his prone position, he catches a glimpse of\n      Tomlin backing Ryan quietly into the crowd. Not trying to\n      help. Not calling for an ambulance. In that instant, Mooney\n      knows he's been betrayed. Tomlin's in on this.\n\n\n\n                                                                 104.\n\n185                                                                     185\n\n\n\n                              TOMLIN (CONT'D)\n                   For all the trouble you've caused,\n                   you'd better have that goddamned\n                   disc. Where is it?\n      Just then, Greer appears through the crowd ahead of him.\n      Like a nightmare, he closes in.\n      Ryan slowly slips his phone into a waterproof pocket in his\n      windbreaker and zips it up.\n\n                                RYAN\n                   Aw shit...\n      Ryan's world is spinning -- the NOISE, the CROWDS, the\n\n      TENSION...\n      He KICKS BACK hard into Tomlin's SHIN. It is enough for\n      Tomlin to release his grip and Ryan bolts.\n      Tomlin recovers and raises his GUN to get a bead on Ryan, but\n      it causes the crowd around him to PANIC.\n\n                              CROWD GOER (OS)\n                   Dude's gotta gun!\n      Ryan navigates through the fleeing crowd and turns to see\n      Greer and Tomlin quickly gaining ground.\n      He has to make a choice, either go over the railing, or deal\n      with Greer and Tomlin. Ryan decides on the ocean. He runs\n      to a MAN FISHING WITH HIS SON and uses their ice chest as a\n      step. Just as he JUMPS THE RAIL -- Tomlin gets off a SHOT!\n      SLIIIIIICEE!!! The bullet tears through Ryan's shoulder as\n      he spins headlong into the Pacific!\n      TOMLIN AND GREER run to the railing and see Ryan HIT the\n      CHOPPY WATER below.\n\n                              GREER\n                   Under the pier. Go! Go!\n\n186   UNDERWATER POV                                                    186\n      Ryan flails, panicking, exhaling all his air and sucking in\n      the dark water of the ocean --\n\n187   UNDERWATER                                                        187\n      Ryan is struggling. Bleeding. Sinking. Dying. His lungs\n      convulse, trying to breathe, burning like a thousand red-hot\n      needles are pushing their way through his chest.\n      The WAVES POUND against the thick pylons below the pier. Just\n      as Ryan comes up for air he's SLAMMED into a wooden pylon!\n      Ryan fights for his life as the surge churns him underwater,\n      BASHING him repeatedly against the pillars. It's not pretty.\n\n\n\n                                                                  105.\n\n 187                                                                     187\n\n\n       As he struggles toward the shore, he's constantly thrown back\n       and forth underwater like a rag doll.\n\n                                                    CUT TO:\n\n188    EXT. SANTA MONICA PIER - NIGHT                                    188\n       TOMLIN races down the pier towards the beach --\n       GREEK aims his weapon at the ocean, daring Ryan to surface.\n\n                                                    CUT TO:\n\n189    EXT. UNDER THE SANTA MONICA PIER - BEACH - NIGHT                  189\n       Ryan finally makes it to shore; coughing, retching. He crawls\n       up the sand, out of breath, blood trailing behind him.\n       He unzips the waterproof pocket of his shorts, pulling out\n       the cellphone, which thank God is actually dry. Ryan forces\n       himself into action; stumbling, exhausted into a --\n\n190    INT. STORAGE DORY - UNDER THE PIER - NIGHT                        190\n       The place is dark. Empty. An array of rowing shells covered\n       in ghostly, flapping tarps make the place look vaguely haunted.\n       This place is also filled with storage equipment, such as\n       buoys and safety netting used by the beach patrol.\n\n                                                    CUT TO:\n\n191    EXT. UNDER THE SANTA MONICA PIER - BEACH - NIGHT                  191\n       TOMLIN - racing through the sand under the pier. He spots\n       Ryan's bloody footprints and follows them toward the --\n\n192    INT. DORY - NIGHT                                                 192\n\n\n       RYAN - sees Tomlin coming.   Ryan's trapped like a rat -- and\n       dripping blood everywhere.\n       He looks for anything that'll save him, but finds only\n       useless boating tools (sanders, saws, box cutters, etc.)\n\n                           RYAN\n                     (to himself)\n                 Think! Think!\n\n193    EXT. SANTA MONICA PIER - NIGHT                                    193\n\n\n       Chloe hands Mooney a cup of water and frantically looks\n       around for the paramedics. Mooney starts rising to his feet.\n\n                            CHLOE\n                 You better lie still. The\n                 paramedics should be here shortly.\n       But Mooney's obstinate.   He rises despite her best efforts.\n\n\n\n                                                                 106.\n\n193                                                                     193\n\n\n\n\n\n                             MOONEY\n                  Just keep that ambulance close by.\n      And as he stumbles off--\n\n194   INT. THE DORY ENTRANCE - NIGHT                                     194\n      TOMLIN - By the time his eyes adjust to the dark, Ryan is\n      nowhere to be seen. TARPS undulate over jumbles of boxes and\n      equipment everywhere -- a hundred places to hide.\n      Alone, Tomlin stalks among the equipment.     Gun out.   Hunting\n      Ryan like a snake on the scent or prey.\n\n                            TOMLIN\n                 You're wounded kid, just give me\n                 what I came for, and I'll let you\n                 all go.\n      Police sirens in the distance grow louder.\n      Tomlin's offer goes unanswered.    That's when he notices the\n      BLOOD on the ground. Tomlin smiles, following Ryan's trail\n      to a PILE OF BLOOD-SMEARED TARPS -- where the trail ends!\n      It's obvious Ryan used these to staunch his wound. Shit!\n      He's gonna have to search this whole place--\n      Then, suddenly, Tomlin gets an idea. He pulls out his phone,\n      making sure it's concealed from view, and writes a TEXT\n      MESSAGE to--\nx95   EXT. SANTA MONICA PIER - NIGHT                                     195\n      Greer pulls out his ringing cell phone. On the text screen\n      it says, \"CALL HIM\". Greer flashes an wicked grin, and dials\n      the last number on his call log.\n\n                                                  CUT TO:\n\n196   INT. DORY - CONTINUOUS                                             196\n      Tomlin's ready to pounce.\n      SFX:   Nearby, Ryan's cellphone starts to RING, betraying him!\n      Instantly, Tomlin hones in on the noise -- coming from under\n      a bulky tarp along the far wall -- and EMPTIES HIS GUN at it!\n      The tarp shreds. Nothing could survive the assault.\n      Tomlin walks calmly across the room to stand before the tarp.\n\n                            TOMLIN\n                 Shoulda stayed at home this\n                 morning, kid.\n      And just then, Tomlin throws off the shredded tarp exposing--\n      Ryan's cellphone.   And nothing else.\n\n\n\n                                                              107 .\n\n196                                                                   196\n\n\n\n\n\n               ^_        RYAN (OS)\n                Funny. I was about to say the same\n                to you.\n\n                             TOMLIN\n                What the--\n      And in the instant Tomlin realizes he's been tricked, he\n      turns and--\n\n      WHAM!\n\n\n      RYAN HITS TOMLIN in the face with a 2x4, SMASHING his TEETH\n      and sending him backwards. Before Tomlin has time to\n      rec9ver, Ryan swings again. CRACK! -- And his KNEE CAP is\n      obliterated. Ryan, looking like a psychotic Babe Ruth, gives\n      Tomlin two more vicious WHACKS before grabbing his cellphone\n      and high-tailing it out of there.\n\n                                                CUT TO:\n\n197   INT. KIDNAPPERS' VAN - NIGHT                                    197\n      HODGES - has no luck on the walkie.\n\n                          HODGES\n                Tomlin? Anyone copy?\n      Jessica, cuffed from behind, covertly wriggles the handcuffs\n      under her ass toward her feet. Ricky, terrified, screams\n      \"no\" with his eyes. But she knows she's out of time.\n\n                                                CUT TO:\n\n198   EXT. SANTA MONICA BEACH - NIGHT                                 198\n      RYAN - losing blood, he does his best to move quickly through\n      the sand. He stumbles, but regains his footing as he makes\n      his way towards the STAIRS LEADING UP TO THE PIER.\n\n                                                CUT TO:\n\n199   EXT. CAROUSEL ROOF - NIGHT                                      199\n      ELLIS - still on the roof, scans the pier.\n\n200   POV - THROUGH ELLIS' SNIPER SCOPE                               200\n      Hodges locates Ryan emerging from the stairs.\n\n                            ELLIS\n                Got him.   He's in the parking lot.\n\n                                                CUT TO:\n\n201   INT. KIDNAPPERS' VAN - NIGHT                                    201\n      HODGES - listening intently to the walkie.\n\n\n\n                                                                    108.\n\n   201                                                                     201\n\n\n\n                               ELLIS (OS)\n                    I've got a clean shot.\n\n                              GREEK (OS)\n                    No! We don't have the DVD. Just\n                    hold his location. Hodges, parking\n                    lot now!\n         Just as Hodges reaches for the door handle -- Jessica wraps\n         her cuffs around his throat, throws her legs against the back\n         of his seat and pulls like her life depended on it.\n         Hodges chokes, flails, digs, and claws at the cuffs, but his\n         fingertips are no match for Jessica's muscular legs.\n\n                                 JESSICA\n                    Ricky run!    Find help!\n         Ricky's paralyzed with fear.\n\n                                 JESSICA (CONT'D)\n\n                   RUN!\n         Ricky bolts from the car.\n\n                                                         CUT TO:\n\n 202     EXT. SANTA MONICA PIER - BRIDGE - NIGHT                           202\n·**v,\n\n\n         POLICE CRUISERS race down the pier bridge, desperately trying\n         to avoid the fleeing crowd.\n\n                                                         CUT TO:\n\n 203     INT. KIDNAPPERS' VAN - NIGHT                                      203\n         JESSICA - finishes squeezing the last bit of life out of\n         Hodges.\n         She finally exits the van, but not before grabbing the WALKIE\n         TALKIE and GUN.\n\n                                                         BACK TO:\n\n 204     EXT. PARKING LOT - NIGHT                                          204\n         RYAN - sneaking his way through parked cars, heads in the\n         direction of the Police Cruisers on the bridge.\n\n                                                         CUT TO:\n\n 205     EXT. CAROUSEL - NIGHT                                             205\n         MOONEY - scanning the pier for Ryan, hears-\n\n                              ELLIS (OS)\n                   He's heading for the cops.       We\n                   should do it now.\n         Mooney looks to the roof of the carousel and sees Ellis.\n\n\n\n                                                                 10 9.\n\n205                                                                      205\n\n\n\n                            MOONEY\n                \"\"Freeze! Drop your weapon!\n      Ellis quickly swings his rifle and--\n      BAM! Mooney shoots Ellis in the head, causing him to slide\n      off the carousel roof.\n\n                                                  CUT BACK TO:\n\n206   EXT. PARKING LOT - NIGHT                                           206\n      RYAN - stopping in his tracks, looks in the direction of the\n      gun shot. He turns around only to find --\n      A PISTOL pointed right at his face -- Greer's pistol.\n      He PUSHES Ryan behind a SUV so as not to be seen by the cops.\n\n                           GREEK\n                No more bullshit!     Just give me the\n                goddamn disc!\n      Ryan slowly unzips his front jacket pocket and removes the\n\n      DVD.\n      Greer snatches it and SMASHES it to pieces. Fragments fall\n      through the cracks in the pier, to the ocean below.\n      Ryan, pale as ghost, knows he's seconds from meeting his\n      maker.\n\n                           GREER (CONT'D)\n                This is about to be the most\n                enjoyable part of an extremely\n                shitty day.\n      And just as he's about to pull the trigger --\n      BLAM!! Jessica fires a WARNING SHOT. Greer( startled, spins\n      around to see Jessica pointing Hodges' gun in his face.\n\n                           JESSICA\n                Tell me why I shouldn't kill you.\n      For the first time, Greer actually looks frightened.\n      Recognizing the homicidal look in her eyes, he SPUTTERS, but\n      nothing comes out.\n      Ryan, weak and pale with blood loss, looks up at his guardian\n      angel.\n\n                           RYAN\n                Jess... Jessica?     Don't.\n      Jessica trembles with rage, a tear falls.\n\n                           JESSICA\n                I... I have to.\n\n\n\n                                                                       110.\n\n     206                                                                      206\n\n\n\n\n\n                                    MOONEY (O.S.)\n                         Lower the weapon, Jessica.\n\n~---»£-\"·-'\n              Jessica looks behind her and sees Mooney, surrounded by EIGHT\n\n              POLICE OFFICERS.\n\n                                   MOONEY (CONT'D)\n                             (trying to reason with\n                             her)\n                         Ricky's safe. It's all going to be\n                         okay. Put it down.\n              Jessica slowly lowers the gun and looks into Ryan's face.\n\n                                    JESSICA\n                         Thank you for keeping your promise.\n              As the cops move in and drag Greer to his feet, Ryan calls\n              out to him.\n\n                                   RYAN\n                         Hey man, your shitty day is about\n                         to get a whole lot shittier.\n              Ryan flips open his phone and on the SCREEN plays the\n              SECURITY FOOTAGE of the murder in the parking lot. We see\n              that Ryan must've copied the DVD with his videophone.\n\n                                  RYAN (CONT'D)\n                        Ain't that a bitch?\n              And through the tears, Jessica manages a laugh. A small one.\n              But enough to let us know everything's going to be okay. And\n              as we PULL BACK on the scene--\n\n                                                        DISSOLVE TO:\n\n  207         INT. HOSPITAL DAYROOM - NIGHT                                   207\n              The ECU OF A TELEVISION SCREEN\n              showing an aerial shot of the Santa Monica Pier.\n              PULL OUT to reveal-\n              CHLOE AND RYAN, sitting in a hospital dayroom, engrossed in\n              the NEWS REPORT that plays in the far corner of the room.\n              Ryan's shoulder has now been BANDAGED, his arm's in a sling.\n\n                                   NEWS ANCHOR\n                        ...The Santa Monica Pier was the\n                        latest setting in the ongoing 23rd\n                        Precinct corruption scandal. Ryan\n                        Ackerman, a local resident, risked\n                        his life to save a family kidnapped\n                        by officers to cover up...\n              Chloe strokes Ryan's scalp with her fingers.\n\n\n\n                                                                   111.\n\n207                                                                   207\n\n\n\n\n\n                            CHLOE\n               \"\"\"How does it feel to be a hero?\n\n                            RYAN\n                      (re: his wounds)\n                 It hurts... But you're making it\n                 way better. I'm just glad it's\n                 over.\n\n                      CHLOE\n                (smiling)\n                Modesty can be sexy.\n\n                           RYAN\n                 And to think this was our first\n                 date.\n\n                           CHLOE\n                Next time, skip the shower.\n      In the background, Jessica and Ricky exit a hospital room and\n      join the two lovebirds.\n\n                           JESSICA\n                Craig's very weak, but the doctors\n                say it looks promising. He's\n                probably going to have to walk with\n                a cane, but that's the worst of\n                it... I'm just thankful.\n      Chloe senses that Jessica and Ryan might need a moment alone.\n\n                           CHLOE\n                Come on Ricky, let's get a hot\n                chocolate.\n      A small smile forms on Ricky's exhausted face. Chloe leads\n      Ricky down the hall.\n\n                          JESSICA\n                I can't believe I almost lost\n                everything that means... I don't\n                know how I can ever thank you.\n\n                           RYAN\n                I do.\n                     (weak smile)\n                Don't ever call me again.\n      A shared laugh, then as they turn to the television--\n\n      ECU OF SECURITY FOOTAGE OF THE PARKING LOT MURDER\n      A CELL PHONE RINGS on a nearby table. They turn to look at\n      it, neither one apparently having any idea to whom it might\n      belong...\n      But this time, as we PULL BACK on the scene, we realize no\n      one's going to answer it.\n\n                                                   CUT TO BLACK.\n\n\n\n\n\n\n\nCellular\nWriters :   Larry Cohen  Chris Morgan  J. Mackye Gruber  Eric Bress\nGenres :   Action  Crime  Drama  Mystery  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "The film opens with Jessica Martin (Kim Basinger), a high school biology teacher, talking to her son Ricky while dropping him to the school bus. After she returns home, assailants enter her home through the back door, kill her housemaid, kidnap her, and confine her in the attic of their safe house. Ethan Greer (Jason Statham), the gang leader, smashes the attic's telephone to prevent her from contacting anyone. She has no idea who the kidnappers are or what they want. She pieces together the wires of the broken phone and randomly makes a connection. She reaches the cell phone of Ryan (Chris Evans), who has just been dumped by his girlfriend, Chloe (Jessica Biel), for being irresponsible. He believes the call is a joke, but Jessica persuades him to go to the police. At the police station, Desk Sergeant Mooney (William H. Macy) tells him to go to the detectives on the fourth floor. He begins to lose the signal in the stairwell, so he turns back to avoid losing the connection. Meanwhile, Ethan returns to the safe house and asks Jessica about something she doesn't know. When Jessica tells him that she doesn't know, he tells her that he is going to get her son.\nOverhearing them, Ryan realizes how serious the situation is. After Ethan leaves, she tells Ryan to reach her son's school before they do. He is too late and her son is kidnapped. Ryan hijacks a security officer's car and gives chase. Because his cell phone battery is dying, he drives to a shop for a charger. After being repeatedly redirected from counter to counter, he uses a gun from the security vehicle to hold up the store and get the charger. Sergeant Mooney, meanwhile, decides to check on the kidnapping claim. He uses the Department of Motor Vehicles records to find Jessica's address, but when he comes to her house, a woman meets him, telling him that she is Jessica and everything is fine. Believing it to be a false alarm, he leaves. It is revealed that the woman is Dana Bayback (Valerie Cruz), an accomplice of the kidnappers. Ethan returns to the safe house and asks Jessica for the location of a place called \"The Left Field\", where her husband, Craig, was. He reveals that he has Ricky and threatens to kill him if Jessica does not tell him what \"The Left Field\" means. She tells him that \"The Left Field\" is a bar at the Los Angeles International Airport.\nAs Ethan leaves, she tells Ryan that they have gone to get her husband. A cross-connection between phone lines causes Ryan to grab a nearby lawyer's (Rick Hoffman) cell phone as well as his car after his own is destroyed. Jessica urges him to find her husband, and at the airport, he tries to stop the kidnappers by planting the gun under one of their jackets. The gun trips the alarm and security intervenes, but the kidnappers flash police badges and apprehend Craig. Ryan and Jessica realize that Ethan and his gang are police officers. After viewing a news report, Mooney identifies Ryan and calls Jessica's home. When he hears the voicemail greeting, he notices that Jessica's voice on the answering machine is different from that of the woman he met. Craig is brought into the attic and is forced to reveal the location of a videotape. He tells them that it is in a bank safe deposit box. Ethan and his friends, Dimitri (Eric Etebari) and Deason (Matt McColm), go with Craig while another kidnapper stands guard. Ryan also reaches the bank, and when the kidnappers retrieve the video camera, he grabs it and flees to the roof.\nHowever, he accidentally drops the cell phone off the roof, smashing it to pieces. He manages to escape in a taxi, and while watching the videotape learns that Craig accidentally shot footage of LAPD Detective Ethan, Mad Dog (Brendan Kelly), Dimitri, Bayback, Deason, and Jack Tanner (Noah Emmerich), a friend of Mooney, robbing and murdering drug dealers. Ryan steals the lawyer's car again from the impound lot and manages to retrieve his own cell phone. Mooney returns to the Martin residence, where Bayback shoots at him, injuring him. He retaliates and kills her but learns, to his dismay, that she was a cop. Back at the safe house, Mad Dog notices a light on one of the buttons on the phone, picks up the receiver and learns that Jessica has been trying to contact help. Angered, he heads upstairs and attacks her, but Jessica kills him by cutting his brachial artery, causing him to bleed to death in seconds. She attempts to escape with her son, but Ethan returns with Craig hostage and stops her. Before Ethan can do anything, Ryan uses his cell phone's memory to contact Ethan and makes a deal directly over the phone: the videotape in exchange for the Martin family.\nUpon learning of the meeting, Tanner convinces Mooney to go so that he can identify Ryan. The deal goes down at the Santa Monica Pier. Ryan tries to handle it his way in disguise, but his ex-girlfriend accidentally exposes him, after which Mooney is able to identify him as the young man who met him at the station earlier. While Tanner sends Dimitri to help Mooney get needed medical attention, he takes Ryan to Ethan. Ethan destroys the video recording and Tanner radios the order to kill the Martins, although Deason in the van suggests they wait until they get to the safe house. However, Mooney overhears the radio transmission. Ryan escapes, following a distraction by his friend Chad (Eric Christian Olsen); Mooney overpowers Dimitri and handcuffs him on the stairs. Tanner and Ethan confront Ryan in a boathouse, where Ryan knocks out Tanner, but Ethan beats him up until Mooney intervenes. After a brief chase, Ryan notices that Ethan has circled behind Mooney, and helps Mooney by calling Ethan's cell phone. The ring of the cell betrays Ethan's position, and Mooney promptly shoots him to death. As Ethan falls, he looks dumbfoundedly at Ryan, and then at Ryan's cell phone, the \"weapon\" that killed him.\nMeanwhile, Jessica manages to strangle Deason with her handcuff chain from the rear of their van, then frees her husband and son. But Deason was merely stunned, and aims his gun at them. Ryan intervenes and smashes him with the van doors until he is unconscious. While Ryan and Mooney are being treated by medics, Tanner is also exposed, because Ryan had copied the video recording onto his cell phone, and the Martin family is set free. Jessica finally gets to meet the man who has risked his life saving her and her family. Ryan jokingly requests that she never call him again."}