{"title": "Cherry Falls", "full_text": "CHERRY FALLS\n                   SCREENPLAY BY KEN SELDEN\n                         FIRST DRAFT\n\n\n\n\n\nFEBRUARY 14, 1998\n\nFADE IN:\n\nEXT.  TOWN - NIGHT\n\nThe hanging sign says 'Entering Cherry Falls, Ohio'\n\nWe see Cherry Falls - A small town in rural Northeastern Ohio. This is \nNorman Rockwell land, red barns on dirt roads, a square in the center of \ntown. But things are hidden here. The barns are locked, the shades are \ndrawn.\n\nDissolve to:\n\nEXT.  LOVER'S LANE \n\nA romantic turn-off used exclusively for parking. A river gushes by. \nCrickets chirp. The trees blow in the autumn wind. A single car sits on \nthe lonely road. The muffled sound of a young couple making out drifts \nthrough the streamed up windows.\n\nINT.  CAR\n\nA teenage boy's hand is under a teenage girl's shirt, gently massaging her \nbreast. He pulls his hand out from under her shirt and places it on her \nbare knee.\n\nAs he starts to slide his hand up her leg, she grabs his hand and gently \npulls it away. She places it back on her breast, sliding it under her \nshirt.\n\nWe pull back. STACY and ROD, two healthy sixteen year olds, are \npassionately making out in the proverbial back seat of a big American car.\n\nRod smiles seductively, kisses Stacy, and places his hand back on her \nknee. Once again, she stops him, this time just squeezing his hand \ntightly.\n\n                   STACY\n               No.\n\nHe doesn't give up easy. He playfully wrestles his hand free and slides it \nunder her skirt. She grabs his hand again.\n\n                   STACY\n               I said no.\n\n                   ROD\n               But you don't really\n               mean it.\n\nHe struggles to free his hand.\n\n                   STACY\n               Yes I do. Keep it in your\n               pants Rod.\n\nHe gives up, aggravated.\n\n                   ROD\n               Maybe it won't stay in.\n               \n                   STACY\n               Maybe you better just\n               drive me home.\n\nHe starts the car, glares at her for a second, then turns it off.\n\n                   ROD\n               Let me just ask you a serious\n               question first.\n\n                   STACY\n               What?\n\n                   ROD\n               Aren't you worried you\n               could die a virgin?\n\n                   STACY\n                 (sarcastically)\n                Yeah. I'm extremely worried\n               about that. It's right up\n               there with global warming.\n\n                   ROD\n               On our way home, a drunken\n               driver could hit us head on\n               and send us flying through\n               the windshield. Terminate\n               us instantly. We'd never \n               experience what it means to\n               make love.\n\n                  STACY\n               If sheep don't count.\n\n                  ROD\n               That wasn't me ...\n\n                  STACY\n               I know. I'm kidding you.\n               Chill out.\n\n                  ROD\n               Well I'm trying to be real\n               here and you're mocking me.\n\n                  STACY\n               (softening)\n              I'm sorry, but you're not\n              going to die a virgin Rod.\n\nEXT.  LOVER'S LANE\n\nThere is another car around the bend, hidden from sight. It's an old beat \nup Imperial from the late sixties. Someone is watching them. It's probably \na psychopath.\n\nINT.  ROD'S CAR\n\nRod leans in and starts kissing Stacy again.\n\n                   ROD(cont.)\n               I don't wanna take that chance.\n               I want my first time to be with you.\n\nShe kisses him back. He slides his hand under her skirt again.\n\n                   STACY\n               Stop it.\n\nHe doesn't.\n                   STACY\n               Rod!\n\n                   ROD\n                (exasperated)\n               You're being unfair.\n\n                   STACY\n               Unfair?!\n\n                   ROD\n               Yes. Unfair to me.\n\nHe begins to overpower her. This is quickly turning into date rape. SHE \nSTARTS TO FIGHT BACK BUT HE DOESN'T STOP. FINALLY, SHE SCRATCHES him \nsavagely across the face. This catches his attention. He jumps back, cut \nslightly, surprised.\n\nShe opens the car door and quickly escapes.\n\nEXT.  ROAD\n\nShe runs away from the car, down the road, very upset.\n\nINT.  CAR\n\nRod catches himself. He looks at his bloodied face in the rear view mirror \nand realizes what he's done.\n\nHe starts up the car.\n\nEXT.  ROAD\n\nStacy runs down the road alone, still very upset.\n\nINT.  CAR\n\nRod pulls up next to her and rolls down his window.\n\n                  ROD\n              Stacy! I'm sorry.\n\nEXT.  ROAD\n\nShe pays no attention to him.\n\n                  ROD\n              Please get back in the car, Stacy.\n\nShe turns and heads down a path into the dark woods, purposely going where \nhe can't follow.\n\nINT.  CAR\n\nRod, frustrated, hits the steering wheel and floors it.\n\nEXT.  ROAD\n\nAs Rod's car tears off, down the road, the other car that was parked at \nlover's lane drives up and pulls over, lights still off.\n\nEXT. WOODS\n\nStacy heads deeper into the woods. When she finally stops to catch her \nbreath and wipe away her tears, she hears someone approaching her. \nSuddenly, the footsteps stop. Stacy senses that someone is watching her.\n\n                  STACY\n                Rod?\n\nNo answer.\n\n                 STACY\n               Is that you Rod?\n\nStill no answer. A little frightened, she starts to walk again.  Again she \nhears the footsteps following her. She stops again. Whoever is out there \nstops too. She looks around in every direction.\n\n                 STACY\n               Come out Rod.\n               This SCREAM bull shit ain't\n               gonna work with me!\n\nNo answer. Even the birds have stopped chirping.\n\n                 STACY\n                (terrified)\n              Rod? You're freaking me\n              out. Game's over. I lose.\n              Come out and we'll fuck.\n\nShe hears the footsteps behind her and quickly turns around. She sees the \nsilhouette of someone standing a few feet away.\n\nThe wind picks up. Stacy realizes it isn't Rod. All she can see is that \nwhoever is there is carrying a small sledge hammer in one hand and a very \nlong, jagged, steel nail in the other.\n\n                  STACY\n               (in full panic)\n              NO!\n\nStacy starts to run. The killer starts after her.\n\nEXT.  STACY'S\n\nRod is sitting in his car in front of Stacy's house at the edge of the \nwoods, waiting for her to appear. He checks his watch.\n\nEXT.  WOODS\n\nStacy runs for the edge of the woods but she isn't quite fast enough to \nelude her pursuer.\n\n                  STACY\n              Help!\n\nThe killer catches Stacy from behind and savagely smashes her head against \na tree, cracking a branch. Stacy falls to the ground, dazed.\n\nINT.  CAR\n\nRod sits up in his seat, thinking he's heard something\n\nEXT.  WOODS\n\nStacy, half conscious, bleeding from the head, is dragged back deeper into \nthe woods.\n\nEXT.  STACY'S\n\nRod gets out of the car and cautiously moves to the edge of the dark \nwoods.\n\nEXT.  WOODS\n\nRod's POV - The woods are pitch black.\n\n                   ROD\n              Stacy?\n\n                  STACY(O.C.)\n            (struggling, in the distance)\n            ROD!\n\nEXT.  WOODS\n\nThe killer kicks Stacy in the side, instantly shutting her up. He gags her \nand ties her to a tree trunk. She struggles, but she's no match for the \nkiller.\n\nINT.  CAR\n\nRod grabs his flashlight from the glove compartment.\n\nEXT.  WOODS\n\nRod's flashlight beam frantically cuts through the woods.\n\nRod charges through the woods, desperately looking for any sign of Stacy.\n\nEXT.  WOODS\n\nStacy's right hand is raised above her head and placed, palm out, against \na tree trunk.\n\nEXT.  WOODS\n\nRod searches for Stacy, his flashlight jaggedly cutting the darkness.\n\nEXT.  WOODS\n\nThe huge nail, extremely sharp and jagged, is placed in the center of \nStacy's outstretched palm.\n\nThe hammer is pulled back, aimed at the head of the nail.\n\nEXT. WOODS\n\nRod stops and frantically looks around, knowing he's fighting a losing \nbattle.\n\n                  ROD\n             Stacy?!\n\nEXT.  WOODS\n\nThe hammer descends on the nail.\n\nStacy screams out in pain, even through the gag, as he hand is nailed to \nthe tree.\n\nEXT.  WOODS\n\nRod hears her muffled cry and runs toward the sound.\n\nStacy's left hand is now placed up against a different tree.\n\nAnother nail is readied.\n\nStacy tries to free her nailed hand but it's useless. She goes into shock.\n\nRod's flashlight continues to cut through the night. His feet trample \nfallen branches. Suddenly, he stops. He's found her.\n\nStacy is stretched out between two trees, gagged, one hand nailed to each \ntree. She almost looks crucified.\n\nRod, starts toward her, not sure what to do. He looks into Stacy's \nterrified eyes. She's looking behind him.\n\nRod quickly turns around but he's too late.\n\nA knife comes plunging down toward Rod's chest.\n\nStacy frantically tries to free herself but she only succeeds in ripping \nher palms on the nails.\n\nRod falls to his knees, blood streaming from his chest and mouth.\n\nStacy can't even react anymore, she's so horrified.\n\nThe killer's hand rips open Stacy's shirt and feels her soft ripe stomach.\n\nStacy looks down, terrified of what the killer has planned.\n\nA small but extremely sharp razor attached to the end of a pencil is \nplaced up against Stacy's bare stomach. The killer's hand grips it like \nit's an ordinary pencil.\n\nStacy's eyes grow abnormally wide as the carving starts. She's never \nexperienced such pain.\n\nBlood drips to the ground.\n\nDissolve to:\n\nEXT.  NIGHT SKY\n\nThe full moon looks down on the town.\n\nEXT.  CUL DE SAC\n\nAnother romantic turn off. A view from the top of a hill overlooking the \nsleepy town. A lonely car sits there, the sound of a teenage couple making \nout drifting through it's steamed up windows. It's almost a repeat of the \nfirst scene.\n\nINT.  CAR\n\nThe boy pulls his hand from under the girl's shirt and unsnaps her jeans. \nShe pushes his hand away but he puts it right back, wriggling a finger \ndown into her pants.\n\nJODY MARKEN, a pretty all-American sixteen year old girl, strong willed \nbut still innocent, stops kissing her boyfriend KENNY, trying to hold him \noff. Kenny is also sixteen. He's thin and a bit shaggy, but very cute \nnonetheless. His hair is shoulder length, his stare intense. He takes \nhimself seriously, all rebel.\n\n                  JODY\n              Cut it out.\n\n                  KENNY\n              Why?\n\n                  JODY\n              I was supposed to be home\n              fifteen minutes ago.\n\n                  KENNY\n              So? You're already late.\n              A few more minutes won't\n              matter.\n\nHe slides a second finger into her pants. She closes her legs, making his \nprobing much more difficult.\n\n                  JODY\n              I got to get home.\n\n                  KENNY\n              Fuck your curfew. Most\n              sixth graders can stay out\n              later than you.\n\nHe starts kissing her again.\n\n                  JODY\n              Kenny....\n\nShe pulls his hand out of her pants. He stares at her for a second, \ncompletely exasperated. He sits up and starts the car.\n\nEXT.   CUL DE SAC\n\nThe car squeals away.\n\nINT.   CAR\n\nJody and Kenny drive home, not talking.\n\nHe pulls up in front of her house.\n\n                  KENNY          \n            You know, maybe we ought to\n            start seeing other people.\n\n                  JODY\n            What?\n\n                  KENNY\n            Jody, we've been going out\n            for over a year. I love you\n            but I'm all out of patience.\n\nJody doesn't know what to say. She didn't expect this.\n\nEXT.  MARKEN HOUSE\n\nJody gets out of the car, very upset. Kenny takes off, not even waiting to \nsee if she gets inside safely, leaving her all alone on the dark street. A \ncar backfires in the distance. A nearby noise  startles her. Something's \nbehind the garbage cans. She heads quickly up the driveway, disappearing \nbehind the house.\n\nINT.  MARKEN'S HOUSE - BACK FOYER\n\nAll is quiet in the house. The back door opens. Jody tiptoes up back \nstaircase.\n\nINT.  MARKEN'S HOUSE\n\nJody appears on the second floor. It's a family house, politely decorated \nand immaculately clean. She quietly creeps down the hallway toward her \nroom. As she passes her parents' room, she looks down. She's relieved that \nno light is coming from under their door.\n\nINT.  JODY'S BEDROOM \n\nJody creeps into her bedroom and quietly shuts the door. She's made it. \nShe sits on the bed to catch her breath.\n\nSomething moves in the corner of her room. Jody jumps, scared.\nSomeone is sitting in her rocking chair.\n\n                 BRENT\n            It's almost ten o'clock.\n\n                 JODY\n            Daddy you scared me!\n\n                 BRENT\n            You're grounded Friday night!\n\n                 JODY\n            What? I WAS AT SANDY'S I JUST\n            LOST TRACK OF TIME.\n\nBRENT MARKEN gets up and heads to the door. He's a big man, 45 years old, \nwell built. He's dressed in a  tree-shirt and jeans.\n\n                 BRENT\n            Your curfew is 9:30 and you\n            know it, little miss.\n\n                 JODY\n            It won't happen again.\n\n                 BRENT\n            You said that two weeks ago.\n\n                 JODY\n           Dad ! Most of my friends can\n           stay out until 11 on school nights\n           and 1 on weekends!\n\n                 BRENT\n           They're not all the sheriff's daughter.\n           Goodnight.\n\nHe leaves. Jody is furious. She lies down on the bed to stew. She might at \nwell have stayed out. The phone in the hallway rings. She leaps up.\n\nINT.  HALLWAY\n\nJody runs up to the phone but waits for it to ring a second time before \npicking it up. She crosses her fingers, praying it's Kenny.\n\n                 JODY\n            Hello. (beat) One second.\n                (to her dad)\n            Hey Adolph, it's the station!\n\nBrent comes out and picks up the phone as Jody heads back to her room, \ndisappointed.\n\nINT.  BEDROOM\n\nJody flops on the bed.\n\n                 BRENT(O.C.)\n            Hello. (beat) What?\n\nINT.  HALLWAY\n\nBrent it shocked.\n\n                 BRENT\n            Where?\n\nMARGE MARKEN, Jody's mother, comes out of the bedroom, sensing something \nterrible has happened. Marge is a couple of years older than Brent. She's \na bit lifeless, a pretty woman who's whole life is her daughter and a \nbottle of Peachtree Schnapps.\n\n                 BRENT(CONT'D)\n            I'm on my way.\n\nINT.  JODY'S\n\nJody sits up on her bed, also sensing something big has happened.\n\nINT.  HALLWAY\n\nBrent buttons up his shirt.\n\n                  MARGE\n            What happened?\n\n                  BRENT\n            Two kids were found mutilated\n            in the woods. Lock the door\n            after me.\n\nBrent grabs his gun belt and heads down the stairs.\n\nJody appears. She and her mom share a concerned glance.\n\nCUT TO:\n\nEXT. STACY'S HOUSE\n\nBrent pulls up. A lot of official cars are already there.\n\nEXT. WOODS\n\nA trail of flares eerily light up the woods, leading to the crime scene.\n\nEXT.  WOODS\n\nThe murder sit. Police cameras flash. Stacy is still nailed to the tree. \nRod is dead on the ground below her in a puddle of his own blood.\n\nBrent walks up, immediately repulsed by the gruesome sight. His deputy, \nJACK WEBBER, sidles up next to him.\n\n                  DEPUTY\n           Her parents reported her missing about\n           an hour ago.\n\nA flash bulb momentarily lights up the scene. Brent pulls out his \nflashlight to better survey the carnage.\n\nHe starts on Rod, throat slit, chest gutted. He then moves to Stacy, \nlooking at one nailed hand, then the other.\n\n                  BRENT\n           What kind of a person wakes\n           up in the morning and says\n           to themselves, 'Think I'll nail\n           a sixteen year old girl to a tree today'?\n\n                  DEPUTY\n           The same type that decides to carve into\n           her stomach.\n\nBrent finally shines the flashlight beam on Stacy's stomach. Carved into \nher flesh is the word 'VIRGIN'.\n\nCUT TO:\n\nMONTAGE\n\nHigh school kids are getting ready for school.\n\nBody parts are being covered. Pants and stocking are pulled up over bare \nteenage legs.\n\nShirts and bras cover bare teenage chests.\n\nZippers are pulled tight. Buttons are buttoned.\n\nThe school bell rings and the kids arrive in cars, on bikes, walking.\n\nIT'S A TYPICAL small town American high school, somewhat repressed but \nalive. The news spreads quickly about the double killing as the crowd \nsplits into its various tribes: punk rockers, jocks, potheads, \ncheerleaders, nerds.\n\nThe killing is on everyone's mind.\n\nEXT.  SCHOOLYARD\n\nJody rides up on her bike and glances across the schoolyard as she locks \nit in the bike rack.\n\nJody's POV - Kenny is leaning against a tree, talking with a busty girl, \nSHARON.\n\nJody is upset to see Kenny flirting with someone else. As she starts \ntoward the front door of the school, a few other CLASSMATES run up to her. \nShe keeps glancing over at Kenny but he doesn't notice her.\n\n                  CLASSMATE 1\n                Jody!\n\n                  JODY\n                Hi.\n\n                  CLASSMATE 2\n                 Was Stacy raped?\n\n                  JODY\n                I dunno. My dad never came home\n                last night.\n\nJody's POV - Kenny takes Sharon's hand for a second.\n\n                  CLASSMATE 1(O.C.)\n                I bet she was. I heard someone\n               stuffed a tent spike up her ass.\n\n                  CLASSMATE 2(O.C.)\n                Gives new meaning to the idea\n                 of getting 'nailed'.\n\n                  CLASSMATE 1(O.C.)\n                Ha-ha. So funny. Sickfuck.\n\nJody doesn't respond. She stares at Kenny.\n\nJody's POV - Kenny walks into school with Sharon.\n\nCUT TO:\n\nINT.  HOMEROOM\n\nJody enters her homeroom, still upset.\n\nHer teacher LEONARD MARLISTON is lecturing the class. Leonard is twenty-\nfive and quite hip looking for a teacher. He has long somewhat stringy \nbrown hair. He is a bit thin and is dressed casually, almost in hippy \nattire. He wears wire-rim glasses and lace-up boots.\n\n                    MR. MARLISTON\n             No one understands what leads people\n             to do irrational things. We only\n             know that unpunished violence\n             festers, then explodes.\n\nJody sits down in the back.\n\n                      MARLISTON(CONT'D)\n             Witness the L.A. Riots. Years of\n             police brutality in forty-eight hours. Jody?\n\n                      JODY\n             Yes Mr. Marliston?\n\n                     MR. MARLISTON\n             Your dad's in the principal's office.\n             He wants to see you.\n\nINT.  HIGH SCHOOL PRINCIPAL'S OFFICE\n\nBrent is talking to TOM SISLER, the principal. Tom is a wiry, hard \nfeatured man in his mid-forties. They have known each other for a long \ntime but are not really friends. Brent knows Tom too well. Tom's a cynical \nbastard.\n\nTom is examining the photos taken at the crime scene.\n\n                     TOM\n              You aren't planning to tell these kids\n              that 'virgin' was tattooed into both Stacy\n              and Rod, are you?\n\n                    BRENT\n              No.\n\n                    TOM\n              Good.\n\n                    BRENT\n              But I am going to have to question\n              all of their past boyfriends and girlfriends.\n\n                    TOM\n              Fine, just don't mention the carving\n              This is going to be a tough enough day\n              as it is.\n\nThere's a knock at the door. Jody enters.\n\n                    BRENT\n              Hi honey.\n\n                    JODY\n              Hi Daddy. Hi Mr. Sisler.\n\n                    TOM\n              Hi Jody.\n\n                    BRENT\n              I just wanted to check that\n              you were okay?\n\n                   JODY\n              I'm fine. I've just never had\n              someone my age die before.\n              It's so weird.\n\n                   BRENT\n              How well did you know Stacy and\n              Rod?\n\n                   JODY\n              I've been in the same class\n              with Stacy for years but we\n              weren't tight or anything.\n\n                   BRENT\n              Had either of them broken\n              up with someone recently?\n              Hurt someone?\n\n                   JODY\n              No. Those two were together\n              before Kenny and I started\n              hanging out and that's over,\n              what, God a year now.\n\n                   BRENT\n              I want you to head right home\n              after school.\n\n                   JODY\n              I will. Is that all?\n\n                   TOM\n              Could you tell Mr. Marliston\n              we'd like to see him.\n\n                   JODY\n              SURE.\n\nShe leaves.\n\n                   BRENT\n              Why'd you send for Lenny Marliston?\n\n                   TOM\n              The kids adore him. They confide\n              in him. His patchouli reeking rear\n              might know if Stacy and Rod were\n              really virgins. Why didn't you\n              ask Jody that?\n\n                   BRENT\n              She's my daughter, Tom.\n\n                   TOM\n              So?\n\n                   BRENT\n              So you just don't point\n              blank ask your teenage daughter\n              about sex.\n\n                   TOM\n              Why not? You worried you might\n              find out how much she actually\n              knows?\n\nBrent gives Tom a 'keep your cynical shit off my daughter' look.\n\n                   LEONARD\n              You rang?\n\n                   TOM\n              Come in Leonard. Have you\n              met Brent Marken?\n\n                   LEONARD\n              No but I've always wanted to.\n\nHe shakes his hand firmly.\n\n                   BRENT\n              Nice to meet you too. My\n              daughter speaks highly of you.\n\nLeonard examines Brent's face carefully. Brent is a little taken aback by \nhis intensity.\n\n                   LEONARD\n              We have the same color eyes.\n\n                   BRENT\n              I guess we do.\n\nCUT TO:\n\nINT. CAFTERIA\n\nMARK SHALE, a seventeen year old, rail thin pothead is sitting at a table \nin the crowded cafeteria eating lunch. The place is a zoo. CINDY, a cute, \nmini-skirted brunette, and BEN,  a frizzy-haired, tattooed, pierced, punk-\nrocker, are sitting with him.\n\nJody is standing at the door with her best friend SANDY, looking for a \nplace to sit. Sandy is thin and a little underdeveloped for her age. She \nis wearing very little make-up, a baggy shirt and baggy jeans. Although \nshe looks much more tomboyish than Jody and a year or two younger, she is \nstill quite cute and curvy, just lacking a  bit in self-confidence when it \ncomes to boys. Sandy is staring at Mark.\n\n                   JODY\n             Go sit next to him.\n\n                   SANDY\n             Who?\n\n                   JODY\n             Mark Shale.\n\n                   SANDY\n             Why?\n\n                   JODY\n             Don't you want to talk to him?\n             You watch him eat everyday.\n\n                   SANDY\n             I don't watch him eat everyday.\n\n                   JODY\n             You stare at him non-stop,\n             like every lunch. Like this. Like\n             most people stare at car accidents.\n\nJody imitates Sandy.\n\n                   SANDY\n             The seat behind him is open. Come on,\n             I can eavesdrop too.\n\n                   JODY\n             You eventually have to talk to him.\n\n                   SANDY\n             Why? All my mom and dad ever do is\n             watch each other eat and they've been\n             married for twenty years.\n\nCindy sees Jody approaching and motions her over.\n\n                   CINDY\n             Jody!\n\nJody starts toward her table.\n\n                   SANDY\n              No! That's his table.\n\n                   JODY\n              You're going to look really\n              amoebic splitting off from me now.\n\nThe other three kids look up as Jody sits don.\n\nSandy has no choice but to sit down next to Mark. She immediately freezes \nup.\n\n                   CINDY\n              Did your dad question you\n              this morning?\n\n                   JODY\n              Just a little.\n\n                   BEN\n              Did he ask you if Stacy\n              and Rod has ever exchanged\n              bodily fluids?\n\n                   JODY\n              No. Why?\n\n                   CINDY\n              He asked Marliston.\n\n                   JODY\n              If they had ever gone all the way?\n\n                   BEN\n              Yeah. Chris BERRINGER WAS PARKED\n              OUTSIDE THE WINDOW.\n\n                  CINDY\n              I wonder why it's so important\n              to know if they fucked?\n\nSandy is completely frozen. Jody realizes it. Mark is paying no attention \nto her.\n\n                   BEN\n              What I don't understand is\n              why they asked Marliston if\n              Rod was a virgin. They could have\n              asked you Cindy.\n\n                  CINDY\n              I never fucked Rod.\n\n                  BEN\n              Exactly. Then he must be a virgin.\n\nJody nudges Sandy under the table, trying to prompt her to say something. \nSandy can only stare at Mark as he eats.\n\n                   CINDY(O.C.)\n              If I'm so all-used-up Ben,\n              why do you try to hook me\n              up non-stop?\n\n                  BEN(O.C.)\n              As fucking if.\n\nAcross the cafeteria, a sophomore ANNETTE storms in very upset. She \nconfronts DYLAN, her junior boyfriend.\n\n                  ANNETTE\n              You're a shitsucking liar!\n\n                  DYLAN\n                (taunting)\n              Better than being a 'cocksucking'\n              liar!\n\n                  ANNETTE\n              Shut your face!\n\nAnnette leaps on Dylan and starts violently scratching him. Mr. Marliston \nruns over and pulls her off. He drags Annette away.\n\n                  ANNETTE\n               He's been telling people....\n\n                   LEONARD\n              You can tell me all about it in\n              my office. Calm down. We're all\n              on edge today.\n\nHe guides her out.\n\nSandy gets up her nerve and makes eye contact with Mark.\n\n                   SANDY\n               What's up with that?\n\nMark opens a TWINKIE and starts to eat it.\n\n                   MARK\n               Dylan's been telling people\n               that Annette gave him a blow\n               job.\n\n                   SANDY\n               And she didn't?\n\nBen and Mark laugh.\n\n                   BEN\n                There's a better chance that he\n                got head from all five Spice Girls.\n\n                  SANDY\n                That's horrible.\n\nCindy laughs at Sandy. Sandy doesn't appreciate being laughed at.\n\n                  CINDY\n                I think it's funny.\n\n                  BEN\n               Me too. I'm going to start\n               telling people that I saw her drop\n                to her knees and latch on to his\n                unit vector.\n\nCindy laughs. The first meeting hasn't gone well for Sandy. Jody feels for \nher and jumps to her rescue.\n\n                   JODY\n                You wouldn't?\n\n                  BEN\n                I would if Dylan paid me.\n\nINT.  SCHOOL\n\nThe bell rings. It's the end of the day.\n\nEXT.  SCHOOL\n\nAll the kids charge out. Jody walks out with Sandy.\n\n                  SANDY\n               (flustered)\n              What am I supposed to say?\n              'Nice sweater Mark'? 'Did you\n              buy it at Eddie Bauer's?'\n\n                  JODY\n                (teasing a bit)\n              You could tell him you really\n              liked the way he chews with his\n              back molars.\n\n                 SANDY\n              You're so fucking lucky your\n              dad is the sheriff.\n\n                 JODY\n              You are 'sp fucking' wrong.\n\n                 SANDY\n              You get to be a little Chelsea\n              Clinton. Everyone wants to meet\n              you. Party with you. Have sex with you.\n\n                 JODY\n              But you can't do any of it.\n              So it sucks. I always have to\n              'set an example'.\n\nJody stops, noticing something.\n\nEXT.  PARKING LOT\n\nJody's POV - Kenny is walking to his car with Sharon.\n\nSandy sees how upset Jody is.\n\n                  SANDY\n               He's just trying to mess\n               with your head. Ignore\n               him.\n\n                   JODY\n               Does she fuck?\n\n                  SANDY\n               (trying to comfort)\n               I doubt it. Who'd want\n               to fuck her. She probably\n               reeks worse than the docks\n               down in those panties.\n\nDISSOLVE TO:\n\nEXT. STREET \n\nJody is slowly pedaling her bicycle next to Sandy.\n\n                   JODY\n                (frustrated)\n              Mr. Jenkins called on me in\n              class today. It was so embarrassing.\n              I was seriously spaced. I'd been thinking\n              about Kenny for over twenty minutes.\n              When I snapped out of it, I looked pathetic.\n              I was teared up. Everyone was staring at me.\n\n                  STACY\n             What did you say?\n\n                  JODY\n             That I was sorry. I'd drifted off.\n             That I'd been thinking about Stacy\n             and Rod.\n\n                  SANDY\n             Oh nice save.\n\n                  JODY\n             I was desperate. It was gross.\n\n                  SANDY\n             Kenny'll come running back.\n             This is just his way of pressuring\n             you.\n\n                  JODY\n             He says he loves me.\n\n                  SANDY\n             Personally I think he has a deep,\n             almost pathological desire to corrupt\n             you. But I suppose that's a type of love.\n             I certainly wish someone wanted to corrupt me.\n\n                  JODY\n                 (musing)\n            Maybe I should blister through a bottle of\n            Tequila and just fuck his brains out.\n\n                  SANDY\n            No!\n\n                  JODY\n            You're the one always saying 'Just do it'.\n\n                  SANDY\n            That was before he pulled this 'Dick me\n            or I dump you' shit. I say fuck his best\n            friend.\n\nJody laughs.\n\n                  JODY\n            I don't know what I'm so scared of.\n\n                  SANDY\n            Want to come in for awhile?\n            Log onto AOL, flirt with some married men,\n            head into a private S&M chat room . . .\n\n                  JODY\n            How do you know what to type back when\n            they start to cyber with you.\n\n                  SANDY\n            I keep a couple of my dad's porno books\n            hidden in my desk for emergency reference.\n\nJody laughs.\n\n                  JODY\n            I promised I'd go right home after school.\n\n                  SANDY\n            OK. increase the peace.\n\nSandy hip-hops up her driveway and into her house. Jody jumps on her bike \nand pedals off down the street.\n\nDissolve to:\n\nEXT. CHERRY FALLS - NIGHT\n\nNight has set again on the town. An OWL HOOTS. THE STREETS ARE QUIET.\n\nEXT.  STREET\n\nThe killer's car, the black IMPERIAL, lurks in the shadows of a suburban \nstreet. The killer is staking out a specific house.\n\nEXT.  ANNETTE'S HOUSE\n\nAnnette, the girl who flipped out in the cafeteria appears at the front \ndoor. Her MOTHER and FATHER are going out.\n\nThey kiss ANNETTE goodbye, get in their car and drive away. Annette heads \nback inside and double locks the door.\n\nEXT.  RESTAURANT\n\nAnnette's parents pull up in front of a restaurant and head inside.\n\nTHE KILLER'S IMPERIAL PULLS up across the street.\n\nINT.  RESTAURANT\n\nThe killer's car drives away.\n\nEXT.  ANNETTE'S\n\nA gloved finger pushes in the back doorbell.\n\nINT.  BACK HALLWAY\n\nAnnette opens the back door. It's chain locked. She peeks through the \nchain,\n\nEXT. HOUSE\n\nSomeone is standing there in the shadows.\n\n                  KILLER(O.C.)\n              HI. Annette?\n\nIt's a WOMAN'S VOICE.\n\nINTERCUT WITH:\n\nINT.  HOUSE\n\nAnnette has never seen this woman before. WE still don't see the killer's \nface.\n     \n                  ANNETTE\n                 (suspicious)\n             Yeah?\n\n                  KILLER(O.C.)\n            I'm Lisa Sherman. Dylan's\n            aunt. He asked me to come\n            talk to you.\n\n                  ANNETTE\n            Why?\n\n                  KILLER(O.C.)\n            He feels terrible about those things\n            he said to you in school.\n\n                 ANNETTE\n                 (really angry)\n           He should. Four guys hit on me today,\n           and not because they find me intellectually\n           stimulating.\n\n                 KILLER(O.C.)\n           I think I know how to restore your\n           reputation.\n\n                  ANNETTE\n                (excited)\n           You do?\n\n                  KILLER(O.C.)\n           Can I come in? I'll need to use the\n           phone.\n\nAnnette isn't sure what to do but this is too important to pass up.\n\n                  ANNETTE\n            Sure.\n\nAnnette unlocks the chain. The killer heads inside.\n\nTHE DOOR OMINOUSLY closes behind them.\n\nINT.  RESTAURANT\n\nWine is being poured into already half-filled glasses.\n\nAnnette's parents and the other couple are now a little tipsy, much looser \nthan when we saw them earlier. They are laughing, rubbing each other, \ngetting physical.\n\nThe other HUSBAND leans in and kisses Annette's' mother on the nose. \nAnnette's father is at first taken aback but then he responds by kissing \nthe other WIFE on the ear. They all laugh. It's getting fancy for Cherry \nFalls.\n\nINT.  HOUSE - DOWNSTAIRS HALLWAY\n\nANNETTE comes charging down the hallway, groggy, bleeding profusely from \nthe side of her head, terrified.\n\n                  ANNETTE\n               Help!\n\nINT.  RESTAURANT\n\nMore wine is poured. The two couples eye each other, giggling.\n\nINT.  BEDROOM\n\nAnnette charges into her bedroom and slams the door behind her, locking \nit. She quickly pulls her dresser in front of the door.\n\nThe door handle moves. The killer is on the other side.\n\nAnnette picks up the telephone. it's dead.\n\nThe killer kicks the door a couple of times.\n\nAnnette backs away from the door, all the way to the window. She grabs a \nsharp pen, holding it like it's a knife. The kicking stops, All is \nmomentarily quiet.\n\nSuddenly the killer's shadow appears in the window behind Annette. The \nwindow smashes an d Annette's neck is pulled towards the shards of glass \nthat remain in the broken window.\n\nAnnette struggles but she's not strong enough.\n\nINT.  RESTAURANT\n\nUnder the table, the other man puts his hand on Annette's mom's knee.\nAnnette's mom smiles at the man, drunk and interested.\n\nINT.  HOUSE\n\nThe killer lowers Annette's throat closer to the shard of glass.\n\nINT.  RESTAURANT\n\nAnnette's mom pushes the man's hand under her dress.\n\nINT.  HOUSE\n\nAnnette's throat touches the glass. She's all but lost.\n\nINT.  RESTAURANT\n\nAnnette's mom lets out a huge  laugh, knocking over her red win, soaking \nthe white tablecloth in red.\n\nINT.  HOUSE\n\nAnnette's eyes roll up into her head.\n\nAnnette, half alive is dragged out the window.\n\nOut come the hammer and nails.\n\nCUT TO:\n\nEXT.  HOUSE\n\nAnnette's parents pull into the driveway:\n\nThey are still giggling. It's been a great night. They are sauced.\n\nINT.  LIVING ROOM\n\nAnnette's parents come inside.\n\n                  MOTHER\n            Annette. We're home.\n\nShe notices a red spot on the carpet and leans over to inspect it.\n\nINT.  HALLWAY\n\nAnnette's mom starts down the hallway, noticing the trail of blood leading \nto Annette's door, realizing something is wrong.\n\n                   MOTHER\n               (concerned)\n             Annette?\n\nShe tugs at Annette's door.\n\nINT.  BEDROOM\n\nThe door is still barricaded.\n\nEXT.  CORRIDOR\n\nHer mother frantically tugs at the door. Her dad appears.\n\n                   MOTHER\n             Annette!!\n\nHer dad lifts his foot and starts kicking at the door.\n\nIt begins to splinter.\n\nINT.  BEDROOM\n\nThey break through. Annette's dad pushes the dresser out of the way and \nthey barge in.\n\nThe room seems to be empty except the window has been broken and blood's \nsplattered around it.\n\n                   MOTHER\n             Annette?\n\nShe notices the shade to the other window has been drawn and is flapping \noddly, caught on something.\n\nShe walks over, frightened, gathers her nerve, then pulls the shade up.\n\nAnnette has been nailed to the outside of the house, her dead eyes looking \nin.\n\n'VIRGIN' is carved deeply in her forehead.\n\nHer mother screams.\n\nCUT TO:\n\nEXT. HOUSE\n\nCOP Cars are everywhere.\n\nINT.  BEDROOM\n\nBrent is staring at the word 'VIRGIN', carved into Annette's forehead. \nHe's really worried, He's figured out that his town is under siege.\n\nINT.  LIVING ROOM\n\nAnnette's parents are downstairs, shocked. They hug each other, having \nnowhere else to turn.\n\nCUT TO:\n\nINT.  MARKEN LIVING ROOM\n\nBrent enters his own house. Marge is waiting for him.\n\n                  BRENT\n             Is Jody still awake?\n\n                  MARGE\n             She just turned off her light.\n\nBrent darts up the stairs.\n\nINT.  JODY'S BEDROOM \n\nJody is in bed. There's a soft knock on the door. She rolls over.\n\n                  JODY\n             Come in.\n\nBrent walks in and seats himself on the edge of the bed.\n\n                  BRENT\n             Hi honey.\n\n                 JODY\n             What's wrong?\n\n                  BRENT\n             I have a question to ask you.\n             A personal question.\n\nJody sits up, pulling the covers up over her breasts.\n\n                 JODY\n               (uncomfortable)\n             How personal?\n\nBrent takes a deep breath. He's really uncomfortable.\n\n                  BRENT\n             I need to know how far you\n             and Kenny went?\n\nJody is really uncomfortable with this question.\n\n                 JODY\n             What do you mean?\n\n                 BRENT\n               (gently probing)\n            Well, I assume you let him kiss you?\n\n                 JODY\n            Well yeah. Of course.\n            Everyone kisses.\n     \n                 BRENT\n            I'm not criticizing.\n                (very uncomfortable)_\n            Did you two get any further?\n\n                  JODY\n            A little.\n\n                 BRENT\n            How much further?\n\n                 JODY\n            Daddy! I DON'T THINK THIS IS\n            ANY OF YOUR BUSINESS!\n\n                 BRENT\n            I wouldn't ask if I didn't have\n            to.\n\n                 JODY\n            Not much further.\n\n                  BRENT\n            You never went, uh, all the way?\n\n                 JOY\n               (sighs)\n            No.\n\nBrent nods, worried. He's obviously upset.\n\n                 BRENT\n               (very worried)\n            Ok.\n\n                 JODY\n               (confused)\n            Daddy, are you upset that\n            I'm still a virgin?!\n\n                BRENT\n            No honey.\n\n                JODY\n            You are upset.\n\n                   BRENT\n            I'm not.\n\n                JODY\n               (upset)\n            I thought you'd be pleased.\n\n                BRENT\n            I am. I'm so very proud\n            of you. Go back to sleep.\n\nHe kisses her on the forehead and heads out. She is very confused.\n\nINT.  LIVING ROOM\n\nBrent comes down the stairs.\n\n                 MARGE\n             Well?\n\n                 BRENT\n             She's still a virgin.\n\n                 MARGE\n             Did you warn her?\n\n                 BRENT\n             No. Let her get at least\n             one more peacefully night's\n             sleep.\n\nEXT.  CHERRY FALLS\n\nIt's a new day. As the kids arrive at school, rumors are flying. Everyone \nis a little more on edge. The same tribes exist but kids are starting to \nglance and listen to kids from other tribes. The social structure is \nstarting to fray.\n\nINT.  PRINCIPAL'S OFFICE\n\nBrent is upset, confused.\n\n                   BRENT\n              If I'd gone public with this\n              yesterday Annette Michaels might\n              be alive today.\n\n                   TOM\n              Oh GOD Brent, is there anything\n              you don't feel guilty about?\n\n                   BRENT\n              is there anything you do?\n\n                    TOM\n             Focus on the present. You always\n             want to change the past. Let's figure\n             out what you are going to tell the parents\n             today, not what you should told them\n             yesterday.\n\n                   BRENT\n             I'm going to tell them everything I know.\n             I'm calling a town meeting for eight p.m.\n\n                   TOM\n             You tell these people someone is out there\n             killing virgins and we're going to have a     \n             goddamn fuckfest on our hands.\n\n                  BRENT\n             Better than a pile of dead teenagers.\n\nEXT.  TOWN HALL\n\nThe town bell rings in the steeple. It's eight o'clock.\n\nEXT.  MAIN STREET\n\nThe shops close down. All the townsfolk head toward the assembly hall.\n\nEXT.  SCHOOL\n\nThe parents arrive. They are all concerned. They've all heard rumors by \nnow. They hurry into the school, whispering to one another.\n\nINT.  AUDITORIUM\n\nThe parents are seated, whispering, buzzing. Brent walks up to the podium. \nHe's very nervous as he looks out at the crowd, realizing he's going to \nreally, really upset them. He takes a deep breath.\n\n                  BRENT\n            I think you all know why I CALLED THIS\n            Town meeting. In the last two days, three\n            of our children have been murdered and it\n            appears that we have now established a common\n            link between the killings.\n\nThe crowd grows still. Everyone is interested in this information.\nBrent pauses.\n\n                   FATHER 1\n             Well, what is it?\n\n                   BRENT\n             All three of the victims attended our\n             public high school and all three were or appear\n             to have been...um...virgins.\n\nThere is a ripple of confusion that runs through the auditorium.\n\n                   MOTHER 1\n             So?\n\n                   MOTHER 2\n                (very concerned)\n             You're almost positive that's\n             who this monster is targeting?\n\n                   MOTHER 1\n             Virgins?\n\n                   BRENT\n             We found the word 'virgin' written\n             at both crime scenes.\n\n                    FATHER 1\n             Why didn't you tell us this yesterday?\n\n                   BRENT\n             We didn't think this was a serial killer.\n             We thought it was an isolated incident.\n\nThis is all very upsetting to everyone.\n\n                   MOTHER 3\n             Are you close to an arrest?\n\n                   BRENT\n             I can't say we are.\n\n                   FATHER 2\n             What are we supposed to do?\n\n                   BRENT\n             What do you mean?\n\n                    MOTHER 2\n             What are we supposed to tell\n             our kids?\n\n                   FATHER 2\n             To go out and get laid if they\n             wanna feel safe?\n\n                   BRENT\n             I think that's' up to each and\n             everyone of you.\n\n                   FATHER 3\n            I can't lock my daughter in\n            the basement.\n\n                   FATHER 2\n            I wouldn't worry about it Victor.\n\nA few other parents laugh.\n\n                   FATHER 3\n            What's that supposed to mean?\n\n                   FATHER 2\n            Nothing.\n\n                   FATHER 3\n            What are you saying about my\n            daughter?\n\nFather 3 starts towards Father 2. Tempers are short.\n\n                   FATHER 2\n               (getting worried)\n            Calm down. I was joking.\n\nFather 3 pushes Father 2.\n\n                   FATHER 3\n            Hell of a time to be joking about\n            a thing like that you sick bastard!\n\nFather 3 swings at him. A fight ensues. Other parents start to jump in. \nTempers are short. Brent leaps down to break it up.\n\nEXT.  TOWN\n\nA match lights a long fuse.\n\nFire crackles along the ground toward a huge string of firecrackers and \nRoman candles. They ignite. The firecrackers explode as balls of fire \nshoot into the night sky. TEENAGERS howl.\n\nINT.  SANDY'S BEDROOM\n\nJody is talking on the phone to Sandy. Sandy's room is typical teenage \nroom, identical in feel to Jody's.\n\n                    SANDY\n               (really worried)\n            What are we going to do?\n\nINT.  JODY'S BEDROOM\n\nJody is lying on her bed.\n\n                    JODY\n            Sandy, you have to chill out,\n            at least two-thirds of the kids\n            in our class are still virgins.\n            He can't butcher all of us.\n     \n                    SANDY\n            There will be a lot fewer by\n            tomorrow night.\n\nEXT.  HOUSE\n\nThe killer's imperial pulls up across the street from Jody's.\n\nINT.  JODY'S\n\n                    JODY\n            Not that many.\n\n                     SANDY\n            You watch. There's going to be\n            a hymen holocaust tomorrow.\n            Maybe I'll finally talk to Mark\n            Shale.\n\n                    JODY\n            NO?!\n\nThere's a sound on the phone. Sandy's brother ANDY has picked it up.\n\n                   SANDY\n            Andy! I'm on the phone!\n\nINT.  DOWNSTAIRS AT SANDY'S\n\nANDY, Sandy's thirteen year old brother is on the line.\n\n                   ANDY(ON THE PHONE)\n             I just wanted to offer my\n             services to Jody.\n\n                   SANDY\n             Your services?\n\n                    ANDY\n             I'm willing to help save her life.\n             Jody, if you want to come over right\n             now. We could slip up into the attic for\n             a few minutes. There's an old mattress\n             up there...\n\n                   SANDY\n             MOM!\n\nAndy hangs up laughing.\n\nINT.  JODY'S\n\nJody chuckles but all of a sudden the line goes dead.\n\n                   JODY\n              Hello?\n\nJody tries to call back but the phone isn't working. This spooks her. The \ndoorbell rings downstairs. Now Jody is more than spooked. She's SCARED. \nShe goes to the window to see who it is.\n\nEXT.  HOUSE \n\nSomeone is standing in the shadows below. All Jody can make out is that \nit's a woman.\n\nINT.  STAIRS\n\nJody, dressed only in her nightshirt, cautiously heads downstairs to the \nback door.\n\nINT.  BACK HALLWAY\n\nJODY looks through the back door window.\n\nEXT.  BACK DOOR\n\nThere's someone in the shadows.\n\nJody opens the door a crack.\n\n                   JODY\n               Yes?\n\n                    KILLER(O.C.)\n               Are you Jody?\n\nOnce again, a woman's voice.\n\n                    JODY\n               Yeah.\n\n                    KILLER(O.C.)\n               I'm Kenny's Aunt Lisa.\n\n                   JODY\n               Kenny's aunt?\n\n                  KILLER(O.C.)\n               Yes. He asked me to come over\n               and talk to you.\n\nJody senses something is off.\n\n                   JODY\n               On what side of the family?\n\n                   KILLER(O.C.)\n               His mother's side.\n\n                    JODY\n                His mother's an only child.\n\nJody suddenly gets it and tries to slam the door closed but the killer is \ntoo fast, sliding a hand and foot in, pushing her way into the house.\n\nJody fights to push the door shut but she can't. The killer is stronger. \nThe killer's hand gropes for the lock latch.\n\nJody frantically looks around for a weapon and spots an electric \nscrewdriver sitting in the back pantry. She grabs for the screwdriver with \none hand as the killer pushes harder.\n\nJody drills the killer's elbow.\n\nThe killer screams and lets go. Jody slams the door shut, double locking \nit.\n\nINT.  FRONT HALLWAY\n\nJody runs to the front hall and double locks the front door.\n\nINT.  LIVING ROOM\n\nJody picks up a phone but it's dead downstairs too. She looks around.\n\nEXT.  HOUSE\n\nShe notices a shadow move across the back window. The killer hasn't left. \nThe killer seems to be following her.\n\nINT.  FRONT HALL CLOSET\n\nJody grabs a baseball bat from the front hall closet. The killer's shadow \nappears outside.\n\nINT.  KITCHEN \n\nJody runs into the kitchen, grabs a knife. The window above her breaks. \nThe killer is right outside.\n\nINT.  DINING ROOM\n\nJody runs into the dining room, not sure where to go. Suddenly the window \nbreaks there. The killer is stalking her from the outside.\n\nINT.  HOUSE - MONTAGE\n\nTHE HOUSE is under siege and Jody is trapped in it. She runs from room to \nroom, turning the lights out but windows break wherever she goes. It's \nterrifying.\n\nINT.  FOYER\n\nSuddenly there is a silence. Jody stops running. She realizes that the \nkiller must be climbing in somewhere. Jody isn't sure what to do.\n\nShe hears something in the family room.\n\nINT.  FAMILY ROOM\n\nJody enters. She sees the killer's shadow cross the window. She runs out.\n\nINT.  HALLWAY\n\nJody creeps through the dark house, unsure where to go.\n\nINT.  DEN\n\nJody creeps back into the den. The killer doesn't seem to be there either.\n\nThe window is broken. The curtains flap in the breeze. She moves toward \nit, wondering whether it's safe to climb out. She looks in the mirror.\n\nIn the mirror, Jody can see the killer's shoes peeking out from under the \ndrapes. The killer's in the room. The drapes start to move.\n\nJody turns around and swings the bat, hitting the killer squarely in the \nhead, sending her to the ground, pulling the drapes down.\n\nINT.  HOUSE\n\nJody tears for the front door.\n\nINT.  FRONT HALL\n\nJody's too nervous to unlock the front door.\n\nShe hears the killer coming so she tears up the stairs.\n\nINT.  STAIRCASE\n\nJody scampers up the staircase but she's not fast enough. The killer grabs \nher leg through the wooden slatted banister starts pulling her off the \nstaircase, breaking the wooden slats.\n\nJody grabs one of the jagged slats and rams the sharp end into the \nkiller's hand, freeing herself.\n\nINT.  STAIRS\n\nJody charges up the stairs and into the bathroom.\n\nINT.  BATHROOM\n\nJody closes the bathroom door and locks it.\n\nThe killer starts kicking it in.\n\nINT.  BATHROOM\n\nJody opens the small bathroom window to climb out on the roof.\n\nThe door starts to splinter.\n\nJody tries to wriggle her way out but it's tight.\n\nBehind her she hears the door splintering open.\n\nEXT.  ROOF\n\nJody squeezes through and grabs hold of the chimney, using it to pull \nherself out.\n\nINT.  BATHROOM\n\nThe killer's hand grabs Jody's leg just as Jody's pulling herself free. \nThe killer closes the window on Jody's leg, trapping it inside. Out comes \nthe razor.\n\nEXT.  ROOF\n\nJody fights for her freedom, tugging at the chimney, kicking and \nscreaming: All of a sudden she feels a surge of pain. She screams and \nkicks with all her might, freeing herself, her momentum sending her \nrolling down the roof. She rolls off the roof, barely grabbing hold of the \ngutter, hanging from it.\n\nThe gutter starts to break.\n\nAbove her she can hear the killer coming out onto the roof.\n\nThe killer's silhouette hovers above, ready to grab her.\n\nJody knows she has no choice.\n\nJody lets go of the gutter.\n\nEXT. BACKYARD\n\nJody falls twenty feet to the ground below.\n\n                  JODY\n              Help!\n\nJody smashes to the ground.\n\nEXT.  NEIGHBOR'S\n\nA neighbor hears the clatter and comes running out to see what's going on.\n\nEXT.  BACKYARD\n\nJody lies still on the ground.\n\nEXT.  ROOF\n\nThe killer, still in silhouette, looks down from the roof.\n\nEXT.  BACKYARD\n\nJody's neighbor runs over to help her.\n\nJody rolls over, still groggy.\n\nJody looks up to the roof.\n\nEXT.  ROOF\n\nTHE KILLER IS GONE.\n\nEXT.  BACKYARD\n\nJody looks back down at her bloody leg. There is a 'V' carved into it.\n\nCUT TO:\n\nEXT.  HOUSE\n\nLater that night. Police cars are lined up outside the house.\n\nINT.  HOUSE\n\nPolice are scouring the house. Jody is trying to sup some hot chocolate \nbut her hands are still shaking.\n\n                JODY\n            It was a she.\n\n                 BRENT\n            Are you sure?\n\n                JODY\n           She said she was Kenny's aunt Lisa.\n\nHer mom comes in with a bottle of cognac, ready to pour a little into \nJody's cup.\n\n                BRENT\n           What are you doing?\n\n                 MARGE\n           This will relax her.\n\n                 BRENT\n           She's underage.\n\nBrent motions towards the cops, his co-workers, who are scurrying around \nthe house. Mom gives Brent a dirty look and pours just a spot into Jody's \nglass. Sandy enters. She sees Jody and runs to her.\n\n                SANDY\n           Oh my god. ARE YOU OK?\n\nJody breaks into tears. They hug.\n\n                 JODY\n           Someone tried to kill me.\n\n                 SANDY\n           The phone just went dead.\n           I called the police and ran\n           right over as fast as I could.\n\nSandy is really terrified too.\n\nDissolve to:\n\nEXT.  CHERRY FALLS\n\nAnother morning in CHERRY FALLS. The town may look peaceful but it isn't.\n\nINT.  SANDY'S BATHROOM\n\nSandy is getting dressed in her usual manner but he hand is shaking. She's \nstill terrified. She looks at herself in the mirror and decides to make a \nchange.\n\nLipstick goes on. mascara and eyeliner follow.\n\nSandy examines herself in the mirror. She's all made-up. SHE USUALLY wears \na tenth as much.\n\nINT.  SANDY'S BEDROOM\n\nSandy slides into a slightly provocative dress. She looks much hotter than \nshe did when we first met her.\n\nINT.  STAIRCASE\n\nSandy starts down the stairs. She stops to check out where her mother is.\n\nINT.  KITCHEN\n\nSANDY'S MOTHER is making breakfast.\n\nINT.  STAIRCASE\n\nSandy hurries downstairs, grabs her coat and heads out the door, hoping \nher mom won't notice how she's dressed.\n\nHer mom hears her and catches a glimpse of her new outfit.\n\n                 MOTHER\n            You're wearing a skirt?\n\nSandy doesn't want to get into it. She charges right out the door.\n\n                 SANDY\n            Bye mom.\n\nEXT.  SANDY'S HOUSE\n\nSandy goes tearing up the street as her mother opens the door after her.\n                 MOTHER\n            SANDY?!\n\nNo way is Sandy turning around.\n\nEXT.  SCHOOL\n\nThe kids arrive at School. Everyone is freaked. The word spreads fast \nabout Jody's attack. Many of the kids, like Sandy, have worn a little \nextra make-up or a little tighter jeans. There's a sexual electricity \neverywhere mixed in with a lot of fear.\n\nThe normal tribes are disbanding. What are forming in their place are \nsexual tribes. Today, at the high school, sexual history bands kids \ntogether. Not aesthetics, popularity, or wealth. Punkers chat with nerds, \ncheerleaders with potheads.\n\nIn the parking lot, we see that Aunt Lisa's IMPERIAL is parked. The killer \nis close by.\n\nEXT.  FRONT OF SCHOOL\n\nSandy arrives at school. She looks around.\n\nShe spots Mark talking with Cindy and BEN. She gathers her confidence up, \nunbuttons her top button to reveal what cleavage she has, and starts \ntowards them.\n\nCindy is laughing at Ben.\n\n                 CINDY\n             I'm not fucking you.\n             Not for all your CDS.\n\n                  BEN\n             You want me to die? I thought\n             you and I were tight.\n\n                 CINDY\n             ARE YOU THE KILLER BEN?\n\n                 BEN\n             WOULD that impress you?\n             IS that what it takes to\n             impress the empress?\n\n                 CINDY\n             Your mind is just twisted enough.\n             I believe you'd do all this just to\n             get a dip or two.\n\nSandy walks up.\n                 SANDY\n             Hi Mark, Cindy, Ben.\n\n                  MARK\n             Hi Sandy.\n\nThey all stare at her for a second, noticing the change in her appearance.\n                 BEN\n             Did you want something?\n\nSandy freezes. She doesn't known what to say.\n\n                  SANDY\n               (almost frozen)\n            Yes.(beat) I was just curious\n            Mark, if you brought a Twinkie\n            today?\n\nBen and Cindy crack up. That was a really lame, stupid question.\n\n                 BEN\n              (sarcastically)\n            You wonder about that everyday Sandy?\n\n                 MARK\n            Shut up Ben.\n                 (to sandy)\n            Actually, my mom always\n            packs two.\n\n                  SANDY\n            You got a great mom.\n            I'm lucky to get a zucchini\n            stick.\n\n                  MARK\n            Did you want one?\n\n                  SANDY\n             (trying to cover)\n            Yeah I was talking about Twinkies\n            the other day and I realized I hadn't had one\n            in years. Then I remembered seeing you with\n            one.\n\n                   MARK\n            They're tasty.\n\nHe gets out the Twinkie and gives it to her. She unwraps it and takes a \nbite. Ben and Cindy watch, amazed and entertained.\n\n                 SANDY\n            Thanks.\n\nSandy gets  a little cream on her cheek and licks it away with her tongue, \na little embarrassed. The sight of her tongue turns Mark on.\n\n                 MARK\n            You can have both if you want.\n\n                 SANDY\n            No, you keep one.\n\nCindy laughs. The pairing up has started.\n\nCUT TO:\n\nINT.  POLICE STATION\n\nJody is sitting in the police station working with a SKETCH ARTIST.\n\n                  JODY\n           A little larger nose.\n\nThe artist makes a change.\n\n                 ARTIST\n           How's that?\n\nJody re-examines the picture. She's spooked.\n\n                  JODY\n           That's her.\n\nThe artist picks up the phone and dials.\n\n                  ARTIST\n           Brent, we got a sketch.\n\nBrent comes into the room and picks up the sketch, \n\nFOR THE FIRST TIME we see a picture of the killer. She looks about \neighteen years old and has her hair done in an old fashioned wave. She \nlooks like your average small town girl from the late sixties.\n\nBrent's face goes white when he sees who it is.\n\nJody notices this.\n               \n                  JODY\n             You know her?\n\n                  BRENT\n             It can't be.\n\n                  JODY\n             Who is she Daddy?\n\n                  BRENT\n             Never mind darling.\n             You go back to school.\n             I don't want you missing\n             anymore classes today.\n\nHe picks up the picture and heads quickly into his own office. Jody \nwatches through his window, sensing he's very, very upset.\n\nINT.  OFFICE\n\nBrent picks up the phone and quickly dials a number.\n\nINT.  MAIN ROOM\n\nJody has never seen her dad like this. She quietly picks up the phone and \nlistens in.\n\nHer dad is talking to the principal, Tom Sisler.\n\n                 BRENT\n           IT'S LISA SHERMAN. But she still\n           looks like we're eighteen.\n\n                  TOM\n              (on phone)\n            That's impossible.\n\n                  BRENT\n              (growing frantic)\n           I swear to God. It's her.\n           She told Jody she was Kenny's\n           'AUNT LISA'. I'm getting this\n           sickly feeling...\n\n                  TOM\n           Calm down Brent.\n\nINT.  OFFICE\n\nBrent looks out and sees that JODY is on the phone, eavesdropping.\n\n                  BRENT\n           I'll call you right back.\n\nINT.  MAIN ROOM\n\nJody, busted, hangs up.\n\nBrent comes storming out. HER FATHER is livid. SHE'S NEVER SEEN HIM SO \nANGRY AND UPTIGHT.\n\n                 BRENT\n            You were eavesdropping.\n\n                  JODY\n              (a little scared)\n            No I wasn't.\n\n                  BRENT\n           What did you hear?\n\n                  JODY\n           Nothing. I just picked up the phone\n           to say goodbye to you. You didn't say\n           goodbye.\n\n                  BRENT\n           Ok. Goodbye. Now get back to school.\n\nShe nods and heads out, freaked. Her father's never treated her this \nharshly before.\n\nEXT.  HIGH SCHOOL\n\nAs Jody approaches the high school, she's still on the edge, given the \nattack of the night before as well as he dad's reaction to the picture. \nShe hears a moan coming from behind some bushes. She stops and notices a \nGirl's shoe sticking out from under the bush. Worried it might be someone \nbadly hurt, she cautiously starts toward it. Suddenly a couple of more \nfeet pop out. Jody jumps back, frightened, but then realizes that it's \njust a  couple of her classmates having sex in the bushes.\n\nJody heads toward the main school entrance. She starts noticing a lot of \nkids are outside, a few more hidden from sight, having sex. Something's \nup. \n\nINT.  HIGH SCHOOL\n\nJody opens her locker. Sandy comes running up to her, very excited.\n\n                 SANDY\n            You ok?\n\n                 JODY\n           (noticing Sandy's attire)\n           FINE. Are you?\n\n                  SANDY\n           Hurricane Hormone. it's flattened the\n           whole school. Guess what?\n\n                  JODY\n           What?\n\n                  SANDY\n              (whispering)\n            Mark invited me to the party.\n\n                  JODY     \n             What party?\n\n                  SANDY\n           Shh. Ben's party. Tonight.\n           Haven't you heard?\n\n                 JODY\n           No.\n\nSandy notices that a teacher is nearby. Sandy pulls Jody into a stairwell.\n\nINT.  STAIRWELL\n\nJody is now really intrigued.\n\n                  SANDY\n              (whispering)\n           You can't tell your parents.\n\n                  JODY\n           Ok.\n\n                  SANDY\n           Especially not your dad.\n\n                  JODY\n           I won't.\n\n                  SANDY\n             (whispering)\n           It's like a pop your cherry party.\n           Everyone's saying it's 'Fuck or Die' time.\n\n                 JODY\n           You're thinking of sleeping with Mark\n           tonight?\n\n                  SANDY\n           Unless he makes a move during\n           seventh period.\n\n                  JODY\n           Didn't you have something a little\n           more romantic in mind for your first\n           time?\n\n                 SANDY\n             (very excited)\n           I kind of like the idea that we can all\n           lose it together, on the same night.\n           It'll be a lot less scary. You have to\n           go.\n\n                 JODY\n           Stag?\n\n                SANDY\n           Kenny'll want to go with you.\n           Cindy's holding a Q and A\n           session at the bleachers.\n           Come on.\n\n                JODY\n           I can't right now.\n\n                 SANDY\n           Jody, you have to go to the party.\n           For your own safety.\n\nSandy takes off.\n\nEXT.  BLEACHERS\n\nCindy is setting with a group of girls, the center of attention.\n\n                CINDY\n            You all are such hypocrites.\n            All year long you sit on your\n            judgmental little butts and \n            call me the slut from hell.\n            NOW YOU RUN TO ME, quaking in fear,\n            BEGGING for advice...\n\n                HYPOCRITE GIRL 1\n           Yeah. SO?\n\n                 HYPOCRITE GIRL 2\n           What were we supposed to call you\n           Cindy?\n\n                 GIRL 1\n           The slut from heaven?\n\n                GIRL 3\n            Just answer our questions please?\n\nSandy runs up.\n\n                CINDY\n               (loving the role)\n           What do you want to know?\n\n                 GIRL 3\n           What to do.\n\n                CINDY\n           You have to do everything\n           Boys are totally clueless when\n           it comes to sex.\n\nThis answer terrifies the audience.\n\n                 CINDY(cont'd)\n           It starts with them trying to\n           unhook our bras, fumbling around,\n           and never changes. Wait until they try\n           to put their dicks in you.\n\n                 GIRL 2\n           Please don't say they need our help\n           with that.\n\n                 CINDY\n           Always. Unless you want them to just\n           poke around endlessly.\n\nThe girls had no idea.\n\nINT.  CAR\n\nThree stoners are smoking a bowl in their car. They are not nearly as \ncollaborative or supportive of one another as the girls were.\n\n                BOY 1\n           Romeo here asked me if chicks has two\n           holes or three.\n\n                 BOY 2\n           I did not.\n\n                BOY 1\n           You did so.\n\n                 BOY 2\n           I was kidding.\n\n                BOY 3\n           Were not dude.\n\n                 BOY 1\n           I know it's a total bummer\n           that three kids are dead, but, I'm sorry,\n           this is kind of great.\n\n                 BOY 3\n           I'm way into this. This may be the best\n           of all possible worlds.\n\n                 BOY 2\n           No. The killer could be offing\n           chicks who haven't given head.\n\nThey all laugh again and nod, slapping hands, Beavis and Butt-head style.\n                BOY 2\n           Then I'd only have to worry about\n           one.\n\nThey all laugh again.\n\nEXT.  PARKING LOT\n\nTwo HOMELY GIRLS, one rail thin, the other slightly overweight, walk back \ntowards the school.\n\n                 HOMELY GIRL 1\n           We'll meet someone at the party.\n\n                 HOMELY GIRL 2\n           You don't know that.\n\n                 HOMELY GIRL 1\n           If we don't, we sit back and watch\n           everyone else camel.\n           That's got to be better than\n           hanging at your house.\n\n                 HOMELY GIRL 2\n           I'm not going.\n\nThey notice a group of kids huddled around a car.\n\n                  HOMELY GIRL 1\n           What's that?\n\nThey walk up.\n\n'VIRGIN' has been written in blood on one of the windshields.  A mutilated \nboy looks out of the driver's window of the car.  The girl's faces go \nwhite. IT'S ANOTHER BODY!\n\nMore and more kids gather around the murder site. The kids are all \nfreaked, giving each other the eye. No one wants to be next.\n\nAll of a sudden the body moves, screaming to the heavens, freaking all the \nkids out. The dead body leaps out of the car and runs away as other kids \nand teachers run over. Everyone heard the scream.\n\nHomely girl 2 whispers to her friend.\n\n                   HOMELY GIRL 2\n                (whispering)\n             Ok. Pick me up at seven.\n\nINT.  CORRIDOR\n\nChaos has taken over the school. Hardly anyone is still going to classes.\n\nKenny is standing in the hallway, looking for Jody. He knows her class \nschedule and that she'll be passing by.\n\nJody appears from her classroom. She starts toward Kenny, at first not \nnoticing him.\n\nJody looks up and she sees him. She stops. She knows what he's there to \ntalk to her about. He runs over to her.\n\n                   KENNY\n                (very concerned)\n           Are you O.K.?\n\n                    JODY\n           I'm fine.\n\n                    KENNY\n           I heard you got attacked.\n\n                   JODY\n           I did.\n\n                    KENNY\n           I was worried about you.\n           Did you hear about the bash?\n\n                    JODY\n           Yeah. I think it's really sick.\n\n                    KENNY\n           Why?\n\n                    JODY\n           Three of our classmates are dead.\n           That's not really the occasion\n           for a party.\n\n                   KENNY\n           Nobody wants to be the fourth.\n           Please go with me.\n\n                   JODY\n           Did Sharon say no?\n\n                    KENNY\n           You know I want to go with you.\n\n                    JODY\n           I'm so flattered but I can't.\n           I'm grounded.\n\n                    KENNY\n            Everyone's grounded. There's a\n           killer on the loose.\n\n                    JODY\n           No I'm really grounded.\n           When I got in late the other night,\n           my father was waiting up for me. \n\nHe grabs her passionately.\n\n                    KENNY\n           If you don't want to go with me just\n           say so. Say 'Kenny, I DON'T WANT TO MAKE\n           LOVE TO YOU' but don't use your dad as an\n           excuse. I'm so sick of it.\n\n                   JODY\n           I'm not using him as an excuse.\n\nOF COURSE SHE IS.\n\n                   KENNY\n           Yes you are. You always do.\n           It's why we broke up. You always\n           hide behind him.\n     \n                    JODY\n           I do not.\n\n                    KENNY\n           I feel like I NEED YOU DAD'S\n           permission just to kiss you.\n           Jody, it's time to assert yourself\n           To be a big girl. An individual.\n           I'm going to this party tonight.\n           Jimmy's my ride. Come over to my\n           house after school. We'll go together.\n\n                   JODY\n           I have to go home after school.\n           I have something really important\n           I have to ask my mom.\n\n                 KENNY\n           They're not picking me up until six.\n\n                 JODY\n           I'll think about it.\n\n                  KENNY\n           Yes!\n\nHe kisses her full throttle. She's into it. She smiles at him as he darts \noff. She's happy but scared. She's got her guy back, at least for the \nmoment.\n\nINT.  SCHOOL\n\nThe clock strikes three. The bell rings.\n\nEXT.  SCHOOL\n\nKids charge out, ready for a memorable evening.\n\nINT.  JODY'S HOUSE\n\nJody's mother is in the kitchen, preparing dinner, watching TV.\n\n                 REPORTER\n                (on TV)\n          A series of savage killings has turned\n          this small community of Cherry Falls, Ohio\n          inside out. In the last two days, three teenagers\n          have been killed, a fourth attacked. The killer\n          seems to be targeting high school virgins. Here's\n          our WWJB reporter Mike Stanton outside the local\n          high school with an up to the minute report.\n\nEXT.  HIGH SCHOOL\n\nMIKE STANTON turns around toward the high school to report on the day's \nevents but before he can get a word out a young GIRL who has recognized \nhim, walks up to him. Her GIRLFRIENDS giggle behind her.\n\n                 GIRL\n            Hi.\n\n                 MIKE\n            Hi, I'm Mike Stanton.\n\n                 GIRL\n            I know.\n\nShe grabs him and kisses him. He's shocked. She runs off giggling with her \nfriends. A boy walks through in the background and makes a lewd hip \nhumping gesture at the TV camera.\n\nINT.  KITCHEN\n\nJody's mom can't believe what she's seeing on the news.\n\nEXT.  HOUSE\n\nJody walks in the back door.\n\nINT.  KITCHEN\n\nHer mom flips off the TV AS Jody enters the kitchen.\n\n                  JODY\n              Hi mom.\n\n                   MARGE\n              Hi princess.\n\n                   JODY\n              Mom?\n\n                   MARGE\n              Yes?\n\n                  JODY\n             I need to ask you something.\n\n                   MARGE\n             You can ask me anything.\n\n                  JODY\n             Have you ever heard of someone\n             named Lisa Sherman?\n\nMom's cutting hand starts to shake. She pretends that she doesn't know who \nLisa Sherman is but she obviously does.\n\n                   MARGE\n             Lisa Sherman?\n\n                   JODY\n             Yeah. Who is she?\n\n                   MARGE\n             I don't know. Where did you\n             hear that name.\n\n                   JODY\n             I overheard daddy mentioning\n             her to someone. I he thinks she's the\n             killer.\n\n                  MARGE\n             What?\n     \n                  JODY\n             That's what he said.\n\n                  MARGE\n             Did he say anything else about her?\n\n                   JODY\n             No but he got really weird.\n             Like I've never seen him act.\n             REALLY angry and super uptight.\n\n                   MARGE\n                (lying)\n             I've never heard of her.\n             Maybe something else was on\n             his mind.\n\n                   JODY\n             No. I think she lived her a\n             long time ago. Like twenty-eight\n             years ago. When dad was eighteen.\n\n                  MARGE\n             Not that I know of.\n\nJody is suspicious. Jody thinks for a moment, then picks her coat back up.\n\n                  MARGE\n             Where are you going?\n\n                   JODY\n             The library. I'll be fine.\n\nJody heads out the door. Her mother goes to the window, very concerned and \nwatches her ride away. She picks up the phone.\n\nINT.  POLICE STATION - BRENT'S OFFICE\n\nBRENT is on the phone. His deputy is with him.\n\n                  BRENT\n           What's the address?\n           Thanks.\n\nHe hangs up the phone.\n\n                  DEPUTY\n           You found her?\n\n                  BRENT\n           There's a Lisa Shermer living just sixty\n           miles west of here. Over the Indiana border.\n           I'm going.\n\n                 DEPUTY\n           We need you here. I can bring her in.\n\n                 BRENT\n           No. I'll handle this.\n\nINT. STATION\n\nBrent and the deputy head into the main station area. Brent grabs his gun. \nThe DESK SERGEANT is on the phone.\n\n                 DESK SERGEANT\n           Sir, we're getting calls from other\n           towns. Boys throughout the country have\n           heard about what's going on here and they're\n           heading our way, apparently, looking for girls.\n\n                 BRENT\n           Put a squad car at every entrance to town.\n\nThe desk sergeant picks up another call.\n\n                  SERGEANT\n           Your wife's on line three.\n\n                 BRENT\n           I can't talk to her now.\n\n                  SERGEANT\n           There's a problem with Jody.\n\n                 BRENT\n           Tell her she has to handle it.\n\nHe heads outside.\n\nEXT.  POLICE STATION\n\nThe deputy walks Brent to his car.\n\n                 DEPUTY\n            As bizarre as it may sound,\n            seems someone is planning to\n            have a big party tonight.\n\n                 BRENT\n            No?\n\n                  DEPUTY\n           Should we close down any eruption?\n\n                 BRENT\n           Are you sure?\n\n                 DEPUTY\n           We're seeing all the signs in town.\n\n                 BRENT\n           I like the idea of all the kids in\n           one place. If it happens, just keep\n           a man outside until you hear from me.\n           I'll be back in a couple of hours.\n\nHe jumps in his car and speeds away.\n\nEXT.  LIBRARY\n\nThe gray old ivy-covered town library. Jody rides up and heads inside.\n\nINT.  LIBRARY\n\nJody enters the vast library. It's empty. Almost spooky. A seventy year \nold lady, MISS DUNLOP is behind the desk, robotically stamping the back \nflaps of books.\n\n                 MISS DUNLOP\n           Hi Jody. What can I DO for you?\n\n                  JODY\n           Hi Miss Dunlop. Where do you keep\n           the old town papers?\n\n                  MISS DUNLOP\n           They're all on microfiche.\n           What year are you looking for?\n\n                 JODY\n           Twenty eight years ago.\n\n                 MISS DUNLOP\n           Follow me.\n\nINT.  LIBRARY - UPSTAIRS\n\nThey head up the stairs and into the microfilm room.\n\n                 JODY\n           This place is empty.\n\n                MISS DUNLOP\n           Everyone's getting ready for the party.\n\n                 JODY\n           You heard about that?\n\n                MISS DUNLOP\n           Of course. NO ONE EVER SHUTS UP\n           IN THE LIBARY. Kids were whispering\n           about it all day.\n\n                JODY\n           Don't you think it's sick?\n\n                 MISS DUNLOP\n           Not at all. In fact, I thought\n           about going.\n\n                JODY\n           You Miss Dunlop?\n\nShe hands Jody the microfiche.\n\n                MISS DUNLOP\n           Unfortunately I qualify.\n           Think I'm too old?\n          \n                JODY\n              (lying)\n           No.\n\n               MISS DUNLOP\n           You're sweet. I really wish\n           someone had thrown a party          \n           like that when I was your age.           \n           My life might have been very\n           different.\n\nSHE SLOWLY HEADS DOWN THE STAIRS.\n\ncut to:\n\nINT.  LIBRARY - MICROFICHE ROOM\n\nThe newspaper headlines from 1970 pass by.\n\nJody is watching them flash by.\n\nShe slows down, then goes back. She's found what she's looking for.\n\nA picture of LISA SHERMAN. It's her yearbook picture. She looks eerily \nidentical to the picture that Jody drew. The headline reads 'High School \nSenior Attacked In park'.\n\nJody hears footsteps coming up the stairs. She looks up. The footsteps  \nstop.\n\nThe old library is still. She senses that someone is watching her.\n\n                  JODY\n             (a little scared)\n           Is that you Miss Dunlop?\n\nNo answer. She hears a bit of rustling from behind one of the shelves of \nbooks directly behind her.\n\nA book accidentally drops to the ground.\n\nShe realizes that someone is right there, watching her.\n\n                  JODY\n           Who's there?\n\nShe sees a pair of shoes behind the book shelf but she can't see the face. \nThe shoes start around the book shelf, toward her.\n\nJody leaps to her feet, ready to run. Her mom appears.\n\n                  JODY\n           Mom? You were spying on me.\n\nMom looks at the monitor, at the picture of Lisa Sherman's face.\n\n                  MARGE\n           I want you to come home with\n           me right now, Jody.\n\n                  JODY\n           Who is she?\n\n                 MARGE\n           She's nobody you should be concerned\n           with.\n\n                  JODY\n           Whoever tried to kill me\n           was made up to look exactly \n           like this picture of Lisa Sherman,\n           clothes and all. I think that\n           concerns me.\n\n                 MARGE\n           Don't make me order you.\n\nJody sits back down.\n\n                 JODY\n           You going to drag me out and me in my\n           room until I go to college?\n\nMarge sits down next to Jody and takes her hand.\n\n                 MARGE\n           If I have to. Please\n           let me protect you.\n\nJody is at a crossroads. Jody doesn't know what to do. Her mother hugs \nher, puts her arm around her, and almost lifts her out of her seat. She \nleads her down the stairs, away from the old newspaper.\n\nINT.  LIBRARY\n\nJody's mom leads her across the vast hallway. They come to the door \nleading out of the library. Jody stops and looks back. She sees the old \nspinster Miss Dunlop, stacking the books.\n\n                  JODY\n           Wait.\n     \n                  MARGE\n           What?\n\n                  JODY\n             (asserting herself)\n           I'm not leaving. I want to\n           know why you and dad are\n           so freaked out. Three of my\n           classmates are dead.\n\nMom doesn't like this at all.\n\nCUT TO:\n\nEXT.  LIBRARY\n\nA beautiful garden on the edge of the library. The autumn wind is blowing. \nThe leaves are at the height of foliage. Jody and her mom are seated on a  \ncarved stone bench.\n\n                  MARGE\n           Years ago, something horrible\n           happened in this town. When I\n           was still in high school. A girl\n           named Elizabeth Sherman was attacked by\n           four drunken seniors.\n\n                   JODY\n           Attacked how?\n\n                  MARGE\n           She was raped. At least that's\n           what she claimed.\n\n                  JODY\n           You didn't believe her?\n\n                  MARGE\n               (confessing)\n           No, I believed her. She was in\n           pretty bad shape. Inside and out.\n           But the boys were never formally\n           charged.\n\n                   JODY\n           Why not?\n\n                   MARGE\n           They were children of our leading\n           citizens, stars of the football team.\n           And she was  a loner. An angry girl\n           that no one really liked. She'd called\n           them 'queers'.\n\n                  JODY\n           People thought these guys had a\n           right to rape her because she called\n           them 'queers'?\n\n                  MARGE\n           They were proving to her they weren't.\n           They were very drunk. Things were different\n           back then. You think kids are sexually\n           bottled up today....\n\n                  JODY\n           And the police did nothing?\n\n                   MARGE\n           EVERYONE JUST KIND OF LOOKED THE OTHER WAY.\n\n                   JODY\n           How could you?\n\n                   MARGE\n            I don't know. We just did. I guess\n           I was kind of scared going against the gain.\n           Against the whole town.\n\n                   JODY\n          The word is Mob.\n\n                   MARGE\n           I've regretted it ever since.\n           Never run with the herd just because\n           they're the herd.\n\n                  JODY\n           Who were they?\n\nMarge freezes. She didn't want to be asked that.\n\n                   MARGE\n           Who?\n\n                   JODY\n           The men. Do any of them still\n           live around here?\n\n                  MARGE\n           Two men left town right after\n           it happened.\n\n                  JODY\n           You're not telling me something.\n\nMarge takes a deep breath, unsure what to say.\n\n                  MARGE\n            Mr. Sisler was one of them.\n\n                  JODY\n                (shocked)\n             The principal?\n\n                  MARGE\n            Yes.\n\n                  JODY\n            Who was the fourth?\n\nMarge is stricken. She looks down.\n\n                   MARGE\n            God. It's like everything that was\n            ever repressed in this town is suddenly\n            bubbling up through the ground.\n\nJody gets it.\n\n                  JODY\n            Dad?\n\nHer mother can't deny it any longer.\n\n                  JODY(CONT'D)\n              (horrified)\n           THAT'S why he called Mr. Sisler first.\n           He was one of them.\n\n                  MARGE\n           Not a day has gone by where your     \n             father has not torn himself to shreds\n           for what happened. We both have...\n\n                  JODY\n           NO!\n\nJody gets up.\n                  MARGE\n           He dedicated his life to law\n           enforcement after...\n\nJody runs off, very upset.\n\nEXT.  LIBRARY\n\nJody jumps on her bicycle and speeds off.\n\nEXT.  GARDEN\n\nMarge sits down and stares straight ahead, crushed.\n\nEXT.  INDIANA DIRT ROAD\n\nThe rusty old mailbox on the forgotten dirt road reads 'Lisa Sherman'\nBrent's police car turns into the driveway.\n\nINT.  CAR\n\nBrent pulls up to the house. he sits and stares for a moment.\n\nEXT.  LISA SHERMAN'S HOUSE\n\nIt's a dilapidated old house, uncared for, overgrown, a 'For Sale' sign \nstands crookedly in the front yard.\n\nBrent gets out of the car and heads to the front door, stepping over rusty \ntools and old auto parts.\n\nEXT.  FRONT DOOR\n\nBrent lifts his hand and is about to knock. He can't. He walks around in a \ncircle, composing himself, preparing himself to face Lisa Sherman after \nall these years. He draws the gun from his holster and knocks.\n\nNo one answers.\n\nHe knocks again.\n\nNo one answers, again.\n\nA WOMAN, THE CARETAKER, appears from the side of the house.\n\n                  CARETAKER\n                Hello?\n\n                  BRENT\n                I'm looking for Lisa Sherman.\n\n                  CARETAKER\n                She's not here.\n\n                  BRENT\n               You know where I can find her?\n\n                  CARETAKER\n               St. Michael's.\n\n                  BRENT\n               She works at a church?\n\n                  CARETAKER\n               She resides there. Out back.\n               She died a year and a half ago.\n\nBrent feels terribly guilty about what he did to Lisa Sherman, but also \nterribly relieved that he'll never have to face her. It's been a  long \ntime since he's confronted his hidden past. He puts his gun away.\n\n                   BRENT\n              Of what?\n\n                  CARETAKER\n              A bullet to the right cerebellum.\n\n                   BRENT\n              She was murdered?\n\n                  CARETAKER\n              No. She ate a pistol for lunch\n              one day.\n\nBrent can't help but feel responsible.\n\n                   BRENT\n              Can you describe her? How old\n              was she?\n\n                    CARETAKER\n              I never met the woman. I'm just taking\n              care of the place until they sell it.\n\n                   BRENT\n              Can you get inside?\n\n                   CARETAKER\n              I can.\n\n                   BRENT\n             I knew Lisa Sherman long ago.\n             It's extremely important that I\n             get inside and try to verify that it's the\n             same woman who lived here.\n\n                   CARETAKER\n             I don't give a fuck what your reasons\n             are. You pay me ten dollars, you can go inside\n             Otherwise, get a warrant.\n\nHe pulls out his wallet.\n\nCut to:\n\nEXT.  KENNY'S HOUSE\n\nJody rides up to Kenny's house.\n\nINT.  HOUSE\n\nKenny sees her from his bedroom window.\n\nINT.  FRONT HALLWAY\n\nKenny comes tearing downstairs.\n\nEXT.  FRONT DOOR\n\nKenny, opens the front door, very excited.\n\n                   KENNY\n               Jody!\n               (he kisses her)\n               Yes! You're here.\n\nJody wipes a tear from her eye. Kenny notices how upset she is.\n\n                  KENNT(CONT'D)\n              What's the matter?\n\nJody bursts into tears. She hugs him. He hugs her back and leads her \ninside.\n\nINT.  HOUSE\n\nAn old rundown house. The clutter smells. Whoever lived here had little to \nno self respect. Garbage is piled up in every corner, order is nowhere. \nBrent is repulsed by what he sees. he wasn't expecting such chaos. He \nknows he helped create this mess.\n\n                   BRENT\n             Is there a picture of her somewhere?\n\n                   CARETAKER\n             No pictures. No mirrors.\n             Was she a crazy woman when\n             you knew her?\n\n                    BRENT\n             (feeling very guilty)\n             No.\n\n                    CARETAKER\n             Couldn't tell she going to off\n             herself, huh?\n\n                    BRENT\n             No, you couldn't.\n\n                    CARETAKER\n            I've been in a lot of people's\n            houses and this one's the creepiest.\n\n                    BRENT\n            Really?\n\n                    CARETAKER\n            Yeah. You should check downstairs.\n\n                    BRENT\n            Why?\n\n                    CARETAKER\n           People always keep their secrets in their\n           attics or in their basements. All the \n           weirdness in this house took place in the\n           basement.\n\nThe woman flips on the basement light. There are several locks on the \ndoor. Brent is very scared of what he's going to find down there.\n\nINT.  BASEMENT\n\nBrent steps down into the basement.\n\nIt is a combination prison/bedroom. It looks like it hasn't been cleaned \nin years. Water drips for the ceiling. Rat traps are everywhere. Old \nbroken child's TOYS are stacked in one corner below some handcuffs which \nare bolted into the wall above a cot. The cot is small, the mattress \nrotted. Old shit lies dried on the floor piss stains line every wall.\n\nHuge nails and odd iron objects sit in one corner.\n\nBrent walks over to the dresser and looks in it. He pulls out a pair of \ngrown man's trousers. He examines them.\n\n                  CARETAKER\n           They look like they'd fit you.\n           Three bucks.\n\nBrent things for a moment then throws the pants down. He darts back up the \nstairs. The caretaker laughs.\n\nINT.  KENNY'S\n\nJody and Kenny are in Kenny's bedroom, sitting on his bed.\n\n                   KENNY\n            All our parents are weirdoes.\n            I think my dad is into hookers.\n            I know he lit cats on fire when\n            he was a kid.\n\n                   JODY\n              (all wound up)\n           My dad acts like he's Johnny Fucking\n           Perfect and he's really Johnny Fucking\n           Rapist.\n\n                   KENNY\n             (compassionately)\n           I think this is a big part of growing up.\n           It's losing your spiritual virginity.\n           It's when you finally discover that your\n           parents aren't anything they told you they\n           were. They're even bigger hypocrites than     \n           your friends.\n\n                   JODY\n           I can't believe I listened to one word of\n           his shit.\n\n                   KENNY\n           But if he'd been sent to jail,\n           there would be no Jody.\n\n                   JODY\n           So I should feel happy that he got\n           away with it?\n\n                   KENNY\n           I don't know. I kind of am.\n\nJody, still crying, stares at Kenny for a second then leans in and kisses \nhim with everything she's got, Ready for action.\n\n                   KENNY\n           Are you coming to the party?\n\n                   JODY\n           Let's just start a party right here,\n           right fucking now.\n\nJody quickly takes her own shirt off, rips off his, and pounces on him. \nHe's taken aback by her sudden aggressiveness. He has no idea how to \nrespond to it.\n\nINT.  TOWN HALL\n\nBrent comes storming out of the hall of records.\n\nINT.  PHONE BOOTH\n\nFrantic dialing. Brent is on the phone.\n\nINT.  PRINCIPAL'S OFFICE\n\nThe phone rings. The answering machine picks up.\n\n                   BRENT\n                (leaving a message)\n           Tom? Lisa Sherman is dead. But you'll\n           never believe what I found out. Meet\n           me at the Roadhouse on Route nine in a\n           half hour. We need to talk in private.\n\nAs Brent finishes his message the camera moves across the principal's \ndesk, first revealing a few blood drops on a piece of paper and then the \nkiller's hand, holding the razor. The killer has been listening to the \nmessage.\n\nTom, the principal, is sitting in the corner in  a large puddle of his own \nblood, tied to the radiator. He's barely alive. His tongue has been cut \nout, his foot cut off at the ankle and shoved into his mouth. One eye is \nmissing, the other one has been left in only so that Tom can look into the \nkiller's face as he's tortured.\n\nThe razor blade is lifted off the table.\n\nTom braces himself, gripping his hands, preparing for more pain.\n\nThe camera moves back to the phone as we hear Tom gag and then the killer \nwalking out of the room.\n\nINT.  KENNY'S\n\nJody is all over Kenny. He's really weirded out by her aggressiveness.  \nShe reaches for his crotch and finds that he's soft. She rolls over, \nembarrassed.\n\n                  JODY\n                (worried)\n            What's wrong? Am I doing something\n            wrong?\n\n                   KENNY\n            Just making me feel like a piece\n            of meat.\n\n                  JODY\n           I'm making you feel like meat?\n\n                  KENNY\n           Yeah.\n\nJody rolls over, a bit pissed off and very confused.\n\n                  JODY\n           You break up with me because\n           I won't fuck you.\n\n                  KENNY\n           That's not why we broke up.\n\n                  JODY\n           You flaunt some slut in my face.\n\n                  KENNY\n           Sharon's far from a slut.\n\n                   JODY\n           And when I finally agree to spread\n           my legs, you accuse me of treating\n           you like meat.\n\n                  KENNY\n           Jody, you're only doing this to\n           get back at your dad. It doesn't\n           have that much to do with me.\n\nShe gets up angry, and starts putting her clothes back on. That was the \nwrong note to play. The truth hurts.\n\n                  KENNY\n           Please don't go. Please.\n           Stay, We'll just talk. Then\n           go to the party.\n\n                  JODY\n           This party is sick.\n\nShe heads to the door.\n\n                  KENNY\n           Jody. Wait.\n\n                  JODY\n           What?\n\n                  KENNY\n           I'm scared. Three kids are\n           dead. I want to go to this\n           party.\n\n                  JODY\n           Then go to the party. Run\n           with the herd Kenny. Just\n           don't spew out all that 'be\n           an individual, assert yourself'\n           crap anymore.\n\nShe heads out, very upset.\n\nINT.  DRUG STORE\n\nINSERT- A condom slides across the counter. The register rings it up.\n\nA teenage boy is standing there buying the condom. The camera pulls back \nto reveal another teenage boy behind him, also holding a condom and then \nanother and another. All told, the store is completely jam packed with \nover a hundred boys, all standing in line, all buying condoms.\n\nCUT TO:\n\nINT.  BEDROOM\n\nSandy is getting ready to go to the party, making herself look as hot as \npossible, and she looks hot. There's a knock on the door. She's scared to \nanswer it, considering how she's dressed. Her dad comes in and sits on the \nbed. Sandy turns away from and buttons her top shirt button up.\n\n                    DAD\n              I know where you're going.\n\n                     SANDY\n                  (concerned)\n              \n              You do?\n\n                     DAD\n              Your brother told us.\n\n                    SANDY\n              Daddy....\n\n                    DAD\n             Shh. I'm not going to tell\n             you not to go.\n\n                    SANDY\n             You're not?\n\n                   DAD\n             No. I couldn't do that.\n             I have something for you.\n\nHe places something on her dresser, smiles at her, and leaves.\n\nShe looks at what he's left. It's a condom.\n\nCUT TO:\n\nEXT.  STREET\n\nCarloads of kids head toward Cherry Falls, howling out the windows, \nguzzling beer.\n\nEXT.   STREET\n\nPolice cars screech to a stop, barricading the entrances to town,\npreparing for the onslaught.\n\nINT.   CAR\n\nBrent is driving out of the Indiana town when he sees something out the \nwindow.\n\nEXT.   STREET\n\nIt's ST. MICHAELS church. Brent pulls over.\n\nEXT.   GRAVEYARD\n\nLisa Sherman's headstone. It's a modern one. Her picture is on it. It's \nthe same woman as the sketch artist drew.\n\nBrent stares at the headstone, alone in the cemetery, feeling ashamed.\n\n                  BRENT\n             Lisa, I'm so sorry.\n\nINT.  SANDY'S LIVING ROOM\n\nSandy appears at the top of the stairs, decked out, ready for the party. \nHer mom bursts into tears. Sandy heads toward the front door. her father \nwalks up to her and hugs her. Her brother Andy, smirks in the b.g.\n\nMom cries harder.\n\n                  ANDY\n             Just think of it like she's having\n             a flu shot. Purely preventive.\n\nCut to:\n\nINT.  HOUSE\n\nA kid raided his parent's liquor cabinet, pouring five different types of \nliquor into a pickle jar.\n\nANOTHER HOUSE\n\nAnother kid raids his parents weed stash, grabbing a handful of buds.\n\nA THIRD HOUSE\n\nA third kid raided his parents medicine cabinet. Lots of barbiturates in \nthis house.\n\nMONTAGE - OTHER HOUSES\n\nKids are climbing out their windows, climbing down trees and sheet ropes, \ntrying to get out, sometimes being chased and caught by their parents. One \nkid is locked in his room, another driven far from town. everyone's \ngrounded but everyone's going to the party any way.\n\nEXT.  WOODS\n\nKids from other towns park cars at the edge of town and try to sneak into \nCherry falls through the woods.\n\nPolice try and cut them off.\n\nEXT.   TOWN\n\nJody pedals quickly down the street. She's going nowhere. She starts to \ncry.\n\nEXT.   ROADHOUSE\n\nBrent pulls into the roadhouse to look for Tom Sisler. As he walks inside \nwe notice the killer's Imperial is parked there as well. Brent's in \ntrouble.\n\nINT.   CAR\n\nMark's car pulls up in front of the party house. Sandy squeezes his arm, \nexcited. Music blares from the house. They all hop out and head up to the \nbash.\n\nEXT.  HOUSE\n\nAll sorts of kids make their way across the front lawn. They are carrying \npillows, sheets, blankets, anything and everything that will make the wood \nfloors more comfortable.\n\nOne couple runs towards the front door howling.\n\nAnother boy pulls his obviously frightened girlfriend into the house, \nreassuring her that everything will be fine.\n\nLots of kids are milling around outside because two big football players \nand their dates are guarding the front door. There's a big sign that says \n\"Couples only\". Lots of hooking up is taking place on the front lawn.\n\nEXT.  NEIGHBOR'S YARD\n\nTwo computer nerds are hidden behind a tree, watching the other kids \narrive. They spot the two homely girls we saw earlier.\n\n                  NERD 1\n            There's Jan and Heather.\n            Let's grab them quick before\n            someone else does.\n\n                NERD 2\n            Ok.\n\n                NERD 1\n            Hide your laptop here.\n\n                 NERD 2\n            No.\n\n                NERD 1\n           You can't bring it.\n\n                NERD 2\n           I'm not leaving it here.\n\nNerd 2 heads toward the girls, taking his laptop. Nerd 1 follows, pissed \noff. They walk up near the homely girls and make eye contact. After \nseveral uncomfortable moments, someone shouts for an upper window.\n\n                GIRL IN WINDOW\n           Marisa! Find someone fast.\n           Floor space is almost gone.\n\nThis only heightens the uncomfortable ness outside. One of the homely \ngirls looks at the laptop.\n\n                 NERD 2\n            Ever play QUAKE?\n\n                 HOMELY GIRL 2\n           What's that?\n\n                 NERD 2\n           A computer game.\n\nThe four just gravitate toward each other, now 'coupled'. They enter the \nhouse next to each other, all four terrified, none even acknowledging yet \nthat they're all in danger.\n\nINT.  CAR\n\nBen and Cindy arrive.\n\n                 CINDY\n               (finalizing)\n            I get all your CDs.\n\n                  BEN\n            Not my imports.\n\n                 CINDY\n            Ok not your imports. All\n            your other CDS and your\n            K2 snowboard.\n\n                 BEN\n           That's an awful lot for ten\n           minutes of beasting?\n\n                 CINDY\n           Don't flatter yourself.\n           You'll be lucky to last\n           ten seconds with me Ben.\n\nShe kisses him passionately, and gets out of the car. He follows her, \nsmitten, like a puppy dog.\n\nINT.  HOUSE\n\nKids file through the house, creating floor space, moving furniture, \npiling it high.\n\nA keg of beer flows in the corner.\n\nRock n' Roll blares from all directions. Everyone's excited.\n\nCUT TO:\n\nEXT. STREET\n\nJody rides down the street, just pedaling fast, as fast as she can.\nShe's in her own world, very upset.\n\nA car comes toward the intersection on the other street but doesn't slow \ndown, knowing the light is about to change.\n\nA boy in a passing car whistles at Jody, waking her out of her stupor.  \nJody looks up just as the light turns red. She hits her brakes and skids \ninto the tail of the oncoming car. She glances off it and goes sliding off \nthe road, into a few garbage cans.\n\nThe car nicks another car and pulls over.\n\nAcross the street, we see that the Killer's IMPERIAL is stopped at the red \nlight.\n\nJody gets up, shaken. He knees and elbows are badly scratched.\n\nThe OWNER of the car comes running over to Jody.\n\n                 OWNER\n            Are you O.K.?\n\n                  JODY\n            I'm ok.\n\n                 CAR OWNER\n            Are you sure?\n\n                   JODY\n            Yes.\n\n                  LEONARD(O.C.)\n           You don't look OK.\n\nJody turns around. Her teacher Leonard Marliston is there. The killer's \nIMPERIAL is parked behind him. Jody wipes away the tears.\n\n                  JODY\n              (starting to cry)\n           I am.\n\n                LEONARD\n           My house is just a couple of blocks\n           away. Why don't you come on over and\n           clean those cuts up.\n\n                JODY\n           Ok. Should I put my bike in the back\n           of your car?\n\n                LEONARD\n           Can you just follow me?\n           The back is full?\n\n                 JODY\n           Sure.\n\nCUT TO:\n\nEXT.  PARTY HOUSE\n\nKids are still arriving from all over but there's no more room in the \nhouse so the party starts spilling out into the backyard.\n\nOne couple spreads out on the roof.\n\nA cop car has pulled up in front and the deputy is just keeping a watch on \nthe house.\n          \nEXT.  TOWN SQUARE\n\nKids are starting to gather and hook up in the town square. As the police \ntry to break up one gathering, another one starts.\n\nCUT TO:\n\nINT.  CAR\n\nLeonard drives down the road. He smiles into his rear view mirror.\n\nEXT.  STREET\n\nIn Leonard's rear view mirror we see Jody pedaling behind him.\n\nA couple of boys lean out of their cars and invite Jody to the go to the \nparty. Sirens scream out in the distance.\n\nEXT.  LEONARD'S HOUSE\n\nLeonard pulls into his driveway. Jody pulls in behind. She leans the bike \non the front porch and they head into the house.\n\n                  LEONARD\n            You aren't going to the party?\n\n                  JODY\n            You know about that too?\n\nINT.  LEONARD'S HOUSE\n\nMr. Leonard opens the door to his house. Jody walks in behind him.\n\n     \n                  LEONARD\n            of COURSE. You're not scared?\n\n                  JODY\n            Of course I'm scared.\n\n                  LEONARD\n            Then you should go.\n\n                  JODY\n            You think I should go to\n            the party, Mr. Marliston?\n\n                  LEONARD\n            I really do. For your own\n            safety.\n\nJody doesn't know what to make of this. It's not what she expected to hear \nfrom her teacher.\n\nLeonard goes into the kitchen. Jody sits on the couch and looks around. \nShe's immediately sensing that something is off about the place. It's \ncertainly not the way she imagined a teacher's house to look. It has all \nsorts of city plans, maps, and drawings on the walls. Years of Cherry \nFalls yearbooks and newspapers are stacked in piles.\n\nHe reappears with two beers and a pot filled with soapy water. He hands \nher a beer.\n\n                  JODY\n            I just feel so manipulated.\n            By everyone. My dad, my boyfriend,\n            and now some psychopath I don't\n            even know.\n\nSHE TAKES THE BEER, surprised he's giving her alcohol. He kneels down in \nfront of her and begins to clean the wound on her leg.\n\n                  LEONARD\n            We're all manipulated. From the moment\n            we're born. The event that fatalistically shaped\n            my life happened before I was even born.\n\n                  JODY\n            Really?\n\n                  LEONARD\n            Yes. We have no real freedom.\n            You of all people should understand\n            that. This may sting.\n\nJody is beginning to feel strange. There's something off kilter about this \nwhole encounter.\n\n                  JODY\n            Me? Why me?\n\n                  LEONARD\n             Because of your father.\n            The way what his sins shaped you.\n\nHe starts putting a disinfectant on her wound.\n\n                  JODY\n            What do you know about my father?\n\n                  LEONARD\n            He's a rapist. Like mine.\n\nShe grimaces. The disinfectant hurts.\n\n                  JODY\n                (a little scared)_\n            Your father raped someone?\n\n                  LEONARD\n            Lisa Sherman was my mother.\n            Do you know who that is?\n\n                   JODY\n            Yes.\n\n                  LEONARD\n           I was born nine months after she was\n           raped. One of the four men who raped\n           her is my father. I have no idea which one.\n\n                  JODY\n           You're the killed.\n\n                 LEONARD\n           Yes that's the whole point. This is\n           what I was put on this earth to do.\n           Rape the town that raped my mother.\n           Steal its pristine innocence like it\n           stole hers. I've planned this since I was\n           a very little boy. You have no real freedom\n           either. Your father has cast a shadow that\n           you've never eluded.\n\nJody gets up and starts backing away from him but he gets up quickly. He's \nnot letting her get away.\n\nJody bolts for the door but she doesn't have time to open it.\n\nLeonard grabs her and throws her across the room.\n\nJody smashes into a  table. He bends down to pick her up, but she pulls a \nbook case over on him, narrowly escaping.\n\nShe runs for the back door.\n\nINT.  BACK DOOR\n\nJody opens the back door and gets halfway out when Leonard runs up to her, \npulls her away from the door, and slugs her in the face, sending her \nsprawling to the ground. He picks her up and punches her a second time, \nbreaking her nose, knocking her half out. He picks her up by the waist and \ncarries her to the basement stairs.\n\nINT.  BASEMENT STAIRS\n\nLeonard throws Jody down into the dark basement. She tumbles down the \nstairs, hitting her head on the cold stone floor.\n\nHe comes charging down after her, closing the door behind them.\n\nCUT TO:\n\nINT.  PARTY HOUSE\n\nThe CD is now skipping. Kids are in every corner, bed , and closet, making \nout. Every square inch of the house is being taken as the party shifts \ninto higher gear. It's a sea of sheets and blankets rippling with bodies \nunder them. Giggles and moans are heard every second.\n\nINT.  A CLOSET\n\nSandy and Mark are gently kissing in the closet, still standing up. Mark \nstudies Sandy's face for a second, then slowly lifts her dress, sliding \nhis hand on to her thighs.\n\n                    MARK\n             You're so beautiful.\n\n                   SANDY\n            So are you.\n\n                   MARK\n            Now don't be nervous.\n\n                   SANDY\n            You're the one who's hand is shaking.\n\nMark smiles, embarrassed. They kiss. They're falling in love.\n\nECU - ELECTRONIC beeps come off a computer screen as a warrior armed with \na huge plasma gun fights his way into a dark cave, shooting plasma \neverywhere.\n\nThe nerds and the homely girls are in the corner playing the computer \ngame, ALL SCARED TO MAKE a move. People around them are shushing them as \nthey blow up monster. One guy finally has had it. H gets up, grabs the \nlaptop and tosses it out the window. NERD 2 IS PISSED OFF.\n\n                  NERD 2\n            Hey! That was a 3k machine.\n\n                  NERD 1\n            Told you to hide it.\n\nHomely girl 2 starts to laugh. It was kind of funny. Then they all start \nto laugh, even NERD 2. There's nothing left to do but laugh. Except kiss. \nAnd that they do.\n\nINT.  BEDROOM\n\nCindy and Ben are naked under a blanket in the corner.\n\n                  BEN\n             One more time.\n\n                  CINDY\n                (negotiating)\n             I get the imports.\n\n                  BEN\n             Ok!\n\nHe's all over her. She's into it too.\n\nINT.  BEDROOM\n\nSharon turns up the heat on Kenny, running her hands across his bare \nchest. Kenny breaks off the kiss, not really into it.\n\n                  SHARON\n             You ok?\n\n                  KENNY\n            Just thinking about something.\n\n                   SHARON\n            What?\n\n                  KENNY\n            There's going to be very few\n            virgins left in school on Monday.\n            It could be really dangerous for them\n            if the killer isn't caught.\n\n                 SHARON\n            I guess so. Luckily we won't have\n            that problem.\n\nShe kisses him again. He stops her again, buttons his shirt.\n\n                 SHARON\n            What are you doing?\n\n                 KENNY\n            I got to go.\n\n                 SHARON\n            What?\n\n                 KENNY\n            I'm worried about someone.\n\nHe puts his clothes on.\n\n                 SHARON\n             You can't just leave me here.\n\n                 BOY'S VOICE\n            Stay put Sharon. I'll hop on over\n            when I'm done here.\n\n                GIRL'S VOICE\n            You will not!\n\nOthers laugh. Kenny looks around.\n\n                 KENNY\n            Jody was right, this party IS sick.\n\nKenny buttons his shirt and heads out. Sharon is pissed.\n\nCUT TO:\n\nINT.  BASEMENT               \n\nAs Jody comes to, she finds herself gagged, tied to a chair in the dark \nbasement. She can't see much but she can hear the sounds of water dripping \nand a rat scurrying around. She tips her chair over and falls onto the \ncold floor. She tries to removes her gag by rubbing her head against the \nground.\n\nEXT.  LEONARD'S HOUSE\n\nLeonard goes to his station wagon and opens the back.\n\nINT.   CAR\n\nA body is hidden under a blanket. Leonard picks it up. It's too heavy.\n\nINT.   BASEMENT\n\nJody can't undo her gag but she notices a piece of glass under a dresser. \nShe turns herself around to grab for it.\n\nShe squeezes her hand under the dresser, reaching for the shard.\n\nThe door at the top of the stairs opens.\n\nLeonard appears in silhouette carrying the body wrapped in a blanket. He \nthrows it down the stairs and turns the lights on.\n\nThe basement is almost an exact replication of the basement in his \nmother's house. A cot in the same spot. The dresser as well. The Lisa \nSherman costume is neatly hung from big metal hooks.\n\nLeonard sits Jody back up.\n\nA little blood drips from Jody's closed hands. She has the shard.\n\nLeonard ties the other body to a chair facing Jody. He starts singing SLY \nAND THE FAMILY STONE.\n\n                  LEONARD\n                (singing)\n             'It's a family affair,\n             It's a family affair.'\n\nHe undoes the blanket revealing the battered but still breathing body of \nJody's dad. Brent's bleeding from the forehead, nose, and mouth. He's \nbadly beaten up.\n\nJody gags on her gag. Her dad looks her in the eye.\n\n                   LEONARD\n             Well, we may be family\n             One in four chance.\n\nLeonard picks up his razor and starts towards Jody.\n\n                   LEONARD\n             Sheriff Brent, you will be the\n             second of the four horsemen of\n             the apocalypse to die. But first you\n             will watch as I slice up your little\n             girl.\n\nBrent starts frantically shaking no, trying to escape as Leonard kneels in \nfront of Jody and runs his hands up under her dress, exposing her shaved, \nnubile leg. The 'V' is still fresh in her calf.\n\nLeonard starts to cut an 'I' next to it.\n\nJody's face grimaces in pain. Blood drips to the ground. Her leg starts to \nshake.          \n\n                    LEONARD\n           You're shaking too much.\n           If you don't stop shaking Jody,\n           I'll have to kill before I carve.\n           We wouldn't want that.\n\nJody concentrates on trying to show no pain, not to flinch. It's tough. \nHer father watches, \nhorrified.\n\nCut to:\n\nEXT.  STREET\n\nKenny runs down the street, heading toward Jody's house. He stops to catch \nhis breath for a second.\nHe notices something.\n\nEXT.  LEONARD'S\n\nJody's bicycle is still leaning against Leonard's porch.\n\nEXT.  STREET\n\nKenny crosses the street to Leonard's house and inspects the bicycle. It's \nhers.\n\nINT.  BASEMENT\n\nLeonard continues to work on Jody's bare leg, starting the 'R'. Jody and \nher father stare at each other, helplessly.\n\n                  LEONARD\n           My mother said, after you and your\n           three droogs raped her Brent, that people\n           in town refused to let her use their bathrooms.\n           Is that true? Did people really call her a slut\n           and tell her 'you can't shit here'? She used to\n           snarl that at me. That's all she really did, at least\n           in my direction, was snarl. When she looked at me, \n           she saw only you.\n\nJody gags in pain. Brent looks away.\n\n                   LEONARD\n            Open your eyes Brent. Watch. Or\n            will I cause her much more pain.\n\nBrent opens his eyes. More blood drips. Jody starts to lose consciousness, \nbarely able to stand it \nanymore. The doorbell rings. Leonard looks up, concerned.\n\nEXT.  HOUSE\n\nKenny rings it again. No one answers.\n\nHe walks over to the window and looks through a crack underneath the \ncurtains.\n\nINT.  HOUSE\n\nKenny's POV - Jody's coat and purse are still on the couch.\n\nEXT.  HOUSE\n\nKenny senses that something is really off. He rings again but no one \nanswers.  Worried, he pops the screen. It's breaking and entering time.\n\nINT.  LIVING ROOM\n\nKenny climbs into the living room and looks around.\n\n                    KENNY\n              Hello? Jody?\n\nINT.   BASEMENT\n\nLeonard hears Kenny. He can't ignore him any longer.\n\n                     LEONARD\n             Who the fuck is breaking into my house?\n\nLeonard checks Jody's and Brent's ropes are tight, then heads up the \nstairs. As soon as he disappears, Jody wriggles toward her father and \nstarts cutting his ropes with the shard of glass.\n\nINT.    HOUSE\n\nLeonard comes out of the basement and peers into the living room.\n\nINT.    LIVING ROOM\n\nLeonard sees Kenny opening Jody's purse, checking it out.\n\nLeonard keeps the razor hidden behind his back.\n\n                       LEONARD\n              My wallet's on the mantle\n              when you've finished your rifling,\n              Kenny.\n\nKenny looks up, startled.\n\n                       KENNY\n                   (nervously)\n              Oh, hey Mr. Marliston. W-What's Jody's\n              bike doing on your front porch?\n\n                       LEONARD\n             That all depends Kenny. Depends on why\n             the FUCK you've broken into your history\n             teacher's house?\n\n                      KENNY\n            Alright, Marliston, I know she's here.\n            \n                       LEONARD\n            What are you talking about? No one here\n            but us chickens.\n\nINT.  BASEMENT \n\nJody cuts through her dad's ropes. Her dad immediately takes Jody's gag \noff.\n\nINT.  LIVING ROOM\n\nKenny heads out the door.\n\n                      JODY(O.C.)\n             Help!\n\nKenny hears the cry and turns around.\n\n                      KENNY\n             That was Jody!\n\nLeonard says nothing. He just stares at Kenny.\n\n                      JODY(O.C.)\n             Somebody help!\n\nKenny heads toward the basement door to investigate. Brent starts kicking \non the other side of the locked door.\n\n                      KENNY\n              Jody?!\n\nLeonard moves towards Kenny with the razor. Kenny turns just in time.  He \ngrabs Leonard's arm as Leonard tries to slit his throat. They struggle.\n\nThe door lock starts to shake as Brent continues to kick the door open \nfrom the other side.\n\nLeonard picks up a  lamp with his free hand and smashes Kenny across the \nhead. Kenny falls to the ground.\n\nThe door pops open. Brent charges out. Leonard turns to him and slashes \nhim across the chest as Brent sprays red paint in Leonard's eyes. Leonard \nscreams, and lunges at Brent.\n\nBrent grabs Leonard. Using every ounce of energy he has, he throws Leonard \ndown the basement stairs.\n\nLeonard grabs Brent as he tumbles down the stairs. The two roll to the \nbottom, smashing their heads along the way. As they come to a stop, Brent \nsmashes his head hard on the floor. Leonard ends up on top of him. He \nraises the razor and slits Brent across the face.\n\n                    BRENT\n               Jody run!\n\nJody crawls up the stairs, dragging her bad leg.\n\nInstinctually, Brent hangs on to Leonard, as Leonard tries to get to Jody. \nLeonard slashes Brent across the face again.\n\n                      JODY\n               No!\n\n                      BRENT\n                   (dying)\n              Run!\n\nJody crawls to the top of the stairs.  Leonard does everything he can to \nget away from Brent but Brent hangs on.  Jody watches, horrified, at the \ntop of the stair. Kenny appears at the top of the stairs and pulls Jody \naway from the gruesome sight as Leonard continues to slash Brent's body \nopen. Brent rolls over, a bloody mess.\n\nINT.  TOP OF STAIRS\n\nKenny slams the door shut as Leonard charges up the stairs. Kenny holds \nthe door shut with all his might.\n\n                    JODY\n               My dad's down there!\n\n                     KENNY\n              He's dead! We've got to\n              get the fuck out of here!\n\nKenny pushes a dresser in front of it, trapping Leonard.\n\n                     JODY\n              I can't walk. I think he cut right\n              through a tendon.\n\nLeonard starts chopping through the door with an axe.\n\nKenny helps Jody out the front door.\n\nEXT.  HOUSE\n\nJody and Kenny limp out of the house. Kenny grabs Jody's bike.\n\n                     KENNY\n               Climb on.\n\nINT.  BACK PANTRY\n\nLeonard breaks through the door.\n\nINT.  KITCHEN\n\nLeonard runs into the kitchen and looks out the window.\n\nEXT.  HOUSE\n\nKenny and Jody are peddling away down the driveway.\n\nEXT.  BACK DOOR\n\nLeonard bursts out of the house and jumps into his car.\n\nINT.  CAR\n\nLeonard starts the car.\n\nEXT.  HOUSE\n\nThe car squeals out of the driveway, rims sparking wildly.\n\nEXT.  SUBURBAN STREET\n\nKenny frantically pedals the bike up the pristine suburban street. Jody \nhangs on for dear life.\n\n                  JODY\n             Go to the police station!\n\n                  KENNY\n             Deputy Webber's at the party.\n             It's only three blocks away.\n\nLeonard's car squeals around the corner behind them.\n\n                   JODY\n              Fuck! It's him.\n\nINT.  CAR\n\nLeonard steps on the gas.\n\nEXT.  STREET\n\nKenny peddles as fast as he can, going up onto the sidewalk but that \ndoesn't stop Leonard. He comes screeching up on the sidewalk right behind \nKenny, ready to run him over.\n\nKenny tears up onto a lawn, Leonard follows him, grass spewing up \neverywhere.\n\nKenny cuts hard between two trees and back onto the street. He heads onto \nthe other sidewalk. LEONARD remains in pursuit, knocking into several \ncars, flattening several fences, and mutilating a cat along the way.\n\nLeonard gains on them as they zigzag up and down the pristine street, \ndestroying it.\n\nLeonard pulls up right behind them. He hits the gas. Kenny has to turn \nhard to avoid getting hit.\n\nKenny can't hold the bike upright and it slides out from under them.\n\nEXT.  BACKYARD\n\nKenny and Jody tumble up someone's driveway, smashing into their fence.\n\nEXT.  STREET\n\nLeonard can't hold the car straight and it 360s across several lawns. \nFinally stopping, smashing into a parked car.\n\nEXT.   BACKYARD\n\nKenny helps Jody to her feet.\n\nBACK OF HOUSE\n\nThe GERMAN SHEPARD that lives in the house comes charging out of the dog \ndoor towards them, barking and snarling.\n\n                      KENNY\n                 Shit.\n\nKenny helps Jody over the fence, then leaps up on it just as the German \nShepard snaps at\nhim.\n\nHe jumps down on the other side, safe.\n\nThe German Shepard smells something else and tears away.\n\nEXT.  FRONT OF HOUSE\n\nLeonard gets out of his car and takes a step toward the house when the \nGerman Shepard comes charging out the open fence.  Leonard screams. The \ndog pounces on him, starts humping his leg. Leonard rolls his eyes. The \ndog thrusts away.\n\nCLOSE ON THE RAZOR. Leonard raises the razor, contemplates, then rolls his \neyes. He pushes the dog off of him.  It lets out a panted growl, almost \nlike it's saying 'going so soon lover boy?' Leonard hops back in his car, \nspeeds off down the street. The dog barks wildly up at the night sky. Talk \nabout being left with a hard-on.\n\nEXT.  PARTY HOUSE\n\nThe house is dark. The lights are all out.\n\nEXT.   ROAD\n\nThe deputy checks his watch. A policeman comes running up.\n\n                     POLICEMAN\n                 We just found another body.\n\n                     DEPUTY\n                Who's?\n\n                     POLICEMAN\n                Tom Sisler. He was murdered at school.\n                 Two kids went into his office to fuck and\n                they found him, with his tongue cut out and\n                his foot jammed into his mouth. Killer also\n                chopped off his pecker and stuffed it in his\n                pencil holder.\n\n                    DEPUTY\n                 Jesus. Any word from Brent?\n\n                     POLICEMAN\n               Nope. The switchboard is lightning up downtown.\n                Kids from other towns are starting to congregate\n                in the parks and at the high school. It's turning\n               into WOODSTOCK except there's no concert.\n\n                    DEPUTY\n               Call Brent on the horn. See where he is. What\n                he wants us to do. I'll head over to the school.\n\n                    POLICEMAN\n               Ok.\n\nThe deputy jumps into his car.\n\n                     DEPUTY\n                Don't leave this party until you\n                hear from me.\n\nThe policeman looks up at the house.\n\n                     POLICEMAN\n               But I shouldn't shut it down?\n\n                     DEPUTY\n               No. Hell, it's the quietest goddamn\n               party I've ever seen.\n\nEXT.  SUBURBAN STREET\n\nJody and Kenny climb over a fence into another backyard. Jody is limping \nbadly.\nKenny is helping her along.\n\n                     JODY\n               Thanks for coming back for me.\n\n                     KENNY\n               I love you.\n\nShe kisses him. He kisses her back.\n\nINT.   CAR\n\nLeonard has pulled over down the street from the party.\n\nEXT.   STREET\n\nKenny and Jody appear from a backyard, across the street from the party.\n\nINT.   POLICE CAR\n\nThe officer sits in his car, trying to call Brent.\n\n                      OFFICER\n                 Brent?\n                     (no answer)\n                 Come in Brent.\n\nThere's a knock at the car window. The officer looks up, startled.\n\nEXT.   CAR\n\nLeonard is looking in the window.\n\nINT.   CAR\n\nThe officer rolls down the window.\n\n                       OFFICER\n                 Jesus Christ had balls in his soup,\n                 Marliston, what'd you do, eat out a\n                 pizza or something? What the fuck \n                 happened to your face?\n\n                       LEONARD\n                 Hey, look, Elvis.\n\n                       OFFICER\n                 Where?\n\n                       LEONARD\n                 You really are a god damn rube.\n\nLeonard slashes the officer's throat open in one savage swoop. He slumps \nover the steering wheel, throat cut beyond repair, blood squirting \neverywhere.\n\n                       LEONARD\n                     (humming)\n                'Family affair. Oh yes it's a \n                 family affair'.\n\nEXT.  PARTY\n\nJody and Kenny limp up to the party. There are no police outside.\n\n                        JODY\n                 Where are the police?\n\nJody looks down the road, lets out a blood curdling scream. LEONARD is \nslowly limping towards the house, gore dripping razor in hands.\n     \n                        JODY\n                 Oh GOD IT'S HIM!\n\n                        KENNY\n                 Quick! In the house. He\n                 won't look for us in there.\n\nKenny and Jody limp toward the front door.\n\nINT.  PARTY HOUSE\n\nKenny and Jody limp through the front door. Couples are everywhere. \nThere's no room\nto even walk.\n\nThe party has reached it's 'climax'.\n\nWe see the faces of teenage boys and girls as they lose their virginity. \nThey run the gamut of emotions. Some are terrified, some are ecstatic. \nSome are concentrating as hard as they've ever concentrated, some are \nclosing their eyes, trying to fade out.\n\nWe see Sandy, Mark, Cindy, and Ben all having a blast. Sharon has managed \nto find a new partner and the nerds are riding the homely girls. It's \norgiastic.\n\nKenny and Jody can only marvel at it as they limp through the maze of \nbodies looking for a place to hide.\n\nKENNY GRABS  a sheet off the ground and carries Jody up the stairs.\n\nINT.  MASTER BEDROOM\n\nKenny carries Jody into the huge bedroom.\n\nA couple of kids look up as the door opens. There must be over a 100 \nteenagers in the room, adjoining bathroom, and closets. The room is just a \nsea of kids humping two deep, under blankets.\n\n                     KID ON FLOOR\n                 There's no room in here.\n     \n                     ANOTHER KID\n                 Yeah. Get lost we're packed.\n\nKenny pays no attention to them. He shoves his way into a corner,  pissing \noff everyone on the way, stepping on a few hands and other appendages. He \nputs Jody down and starts unbuttoning her shirt.\n\n                      JODY\n                    (whispering)\n                 What are you doing?\n\n                      KENNY\n                 Pretend we're just another couple.\n\nHe pulls her under the sheet.\n\nINT.  PARTY - DOWNSTAIRS\n\nLeonard comes in the front door, his razor in hand, the policeman's blood \nstill dripping from it. He looks around, wondering if they're here.\n\nNo one seems to notice Leonard as he hunts for Jody and Kenny, walking \nthrough the sea of bodies, dripping blood on the backs of a couple of \nkids. A serial killer at a fuckfest.  Leonard smiles at the sight of all \nthe teenagers copulating.\n\nINT.  MASTER BEDROOM\n\nKenny and Jody curl up next to each other. Kenny kisses her. She kisses \nhim back.\n\nThey're into each other. They can't keep their hands off each other. They \nstart to really make out.\n\nINT.   PARTY DOWNSTAIRS BEDROOM\n\nLeonard moves into one of the bedrooms. He switches the lights on.\n\nThe kids look up pissed off. There's not an inch of floor space.\n\n                     BOY\n                Hey! Turn that off.\n\n                     GIRL\n                Mr. Marliston?!\n\n                     LEONARD\n                Hi Samantha. Excuse me.\n\nHe steps over a thrusting hairy ass, surveys the room.  No Kenny. No Jody.\n\n                     GIRL\n                    (freaked)\n                What are you doing here?!\n\nThe girl breaks into orgasm before she can barely finish the sentence. \nLeonard\nflips the lights off and heads out of the room. Through out the entire \nproceedings, everyone was fucking like no one entered the room. \nHomeostasis remains stable.\n\nINT.  PARTY STAIRCASE\n\nLeonard heads up the stairs, still looking for Kenny and Jody. A couple of \nkids\non the staircase notice him. He almost trips on one. They start whispering \nto each other, freaked out that a teacher is there. More and more kids \nstart looking up The party has definitely been disturbed.\n\nINT.   MASTER BEDROOM\n\nJody hears the disturbance. She stops Kenny and listens.\n\nINT.   BEDROOM\n\nLeonard checks another bedroom. He flips the lights on. No Jody, no Kenny. \nHe leaves. More and more kids notice him.\n\nINT.   MASTER BEDROOM\n\nJody and Kenny know he's close. Leonard appears in the doorway.\n\n                      KENNY\n                    (whispering)\n                  It's him.\n\nLeonard accidentally steps on a boy's hand as he enters the room. The boy, \nJIMMY, is pissed off.  He looks up and realizes who it is.\n\n                      LEONARD\n                 Pay no attention to me.\n\n                      JIMMY\n                 What are you doing here?\n\n                      BOY ACROSS THE ROOM\n                 He's looking to get laid.\n\n                      JIMMY'S GIRLFRIEND\n                Mr. Marliston?\n\nShe grabs her clothes, embarrassed. Jimmy gets up. He's very drunk. Kenny \nand Jody peek out from under their sheet.\n\n                       JIMMY\n                 You fucked me up!\n\n                       LEONARD\n                 What?\n\n                       JIMMY\n                 You gave me a 'D'.\n\n                       LEONARD\n                 I'm sure you should have failed.\n\n                       JIMMY\n                 I was grounded for two fucking\n                 months because of you!\n\nJody knows her friend is in danger.\n\n                       JODY\n                 Jimmy leave him alone! He's\n                 imbalanced.\n\nLeonard sees Jody. He starts toward her but Jimmy stupidly jumps in his \nway.\n\n                      LEONARD\n                 Please get out of my way\n                 or I'll have to hurt you.\n\n                      JIMMY\n                 I knew you were a pervert.\n                 Always wearing those fucking doofy     \n                 glasses, and driving a station wagon.\n\n                      JODY\n                 He's dangerous Jimmy!\n\n                      JIMMY\n                 So am I! I'm gonna rip your cock off\n                  Marliston!\n\n                      LEONARD\n                 Touché'\n\nLeonard winds back, slashes at Jimmy, lopping off his dick. Blood flies \nup, splatters across Jimmy's face. Jimmy screams. Leonard slashes open his \nneck. Blood splatters everywhere, on kid's backs, faces, butts.\n\nHis girlfriend screams as Jimmy falls to the ground, dying.\n\nLeonard begins to panic. So do the kids. Leonard sees Jody across the room \nand starts toward her as the other kids in the room rise to their feet and \nstampede the fuck out of dodge like a herd of frightened elephants.\n\nINT.  DIFFERENT BEDROOM\n\nKids in other rooms hear the commotion and break their embraces.\n\n                    BOY(O.C.)\n                Run! Mr. Marliston's here!\n                And he's horny!\n\nPanic sweeps through the whole party. Everyone wants out.\n\nINT.  BEDROOM\n\nLeonard can't get to Jody because too many kids are trying to get out the \nbedroom door, pushing toward it, sweeping him up in their flow. It has \nturned quickly into chaos with a teenage logjam at the door.\n\nLeonard keeps his eyes pinned on Jody across the room, through the bodies. \nHe can't make headway so he raises the razor to slash way to her. Jody \nsees him raise the razor.\n\n                     JODY\n                 No!\n\nLeonard starts slashing his way toward Jody. He slashes a girl across the \nstomach, a boy across the face, a  girl across the breasts. It's a \nbloodbath, everyone's screaming.\n\nKIDS' bodies fall to the ground, tripping people, creating even more \nchaos.\n\nLeonard loses his balance and is pushed to the ground as kids stampede \nover him.\n\nINT.  MASTER BEDROOM\n\nJody and Kenny try to make it to the door.\n\nLeonard tries to get up but he can't. He starts crawling toward Jody, \nslashing the legs of a couple of kids who are in his way, sending them to \nthe ground. One kid does a back flip through a glass coffee table, \nexploding it, sending a shard of glass out his throat. Blood sprays across \nthe ceiling like a lawn sprinkler.\n\nThrough the sea of legs, Leonard sees Jody's leg, the 'VIR' still freshly \ncarved. He slashes his way towards Jody.\n\nEXT.   HOUSE\n\nHalf naked kids come streaming out of the house, it's a bizarre sight. \nSome of them stop and scream, noticing the deputy (his body has been hung \nupside down from a telephone pole, and disemboweled). The house is almost \nbursting as kids climb out the windows and appear from the back.\n\nINT.   STAIRWELL\n\nToo many kids are trying to get out at one. The staircase and all the \nhallways start totally backed up but all the kids keep pushing forward. \nSomething's got to give.\n\nINT.   BEDROOM\n\nLeonard keeps crawling toward Jody, getting closer and closer. He \nscrunches over Jimmy's severed penis, staining his khakis with gore.\n\n                      LEONARD\n                 Come on! These are eighty dollar\n                 INDEPENDENT khakis! Limited Edition!     \n                 God damn it!\n\nINT.   STAIRWELL\n\nThe pushing continues. There's nowhere to go. A boy gets pushed over the \nbalcony, falling to the ground below.\n\nINT.   BEDROOM\n\nLeonard is just a few feet from Jody's leg.\n\nJody and Kenny push closer to the door.\n\nLeonard reaches for Jody's leg. He can't quite grab it.\n\nKenny and Jody reach the door. They're almost out. Leonard lungs and grabs\nJody's leg.\n\nJody screams out in pain, falls into the crowd.\n\n                      JODY\n                   Kenny!\n\nKenny tries to grab for her but he can't reach her. The force of the mob \npushes him out the door, through the vortex.\n\nINT.  UPSTAIRS\n\nKids jam the staircase. There's too many trying to get down at once. \nEveryone's\nstill pushing. The kids on the staircase can't keep their position and \nstart falling forward, pushing harder.\n\nINT.  BEDROOM\n\nLeonard keeps hold of Jody's leg and pulls her toward him.\n\nEXT.  BALCONEY\n\nKenny tries to get back to Jody but there's no way he can make headway \nback into that room.\n\n                       KENNY\n                    Jody?!\n\nThe staircase is now jammed with people, starts to buckle.\n\nThe banister breaks. Kids start falling off the balcony and staircase, \nonto kids below, CRACKING SKULLS, breaking bones.\n\nINT.   DOWNSTAIRS\n\nLamps smash to the ground. Tables are trampled. Basically, the entire \ninside of the house is destroyed in the stampede which puts something out \nof fucking JUMANJI to shame.\n\nINT.   BEDROOM\n\nLeonard gets hold of Jody's waist and pulls her towards him, razor ready.\n\nINT.   UPSTAIRS CORRIDOR\n\nEveryone gives one final push out. Kenny is swept on to the staircase. It \ncan't take the pressure and finally cracks.\n\nKids tumble on top of each other falling to the floor below as the \nstaircase splinters. Hurt kids are everywhere as more and more get pushed \nover the edge. It's a disaster. Broken boned teenagers litter the floor \nlike it were a battlefield.\n\nKenny manages to grab hold of the second floor as kids fall past him.\n\nThe whole house begins to buckle.\n\nINT.   BEDROOM\n\nThe room empties as the kids push out. Leonard pulls Jody up next to him \nand puts the razor to her neck. He draws the first spot of blood.\n\n                      JODY\n                Please! You wouldn't kill your\n                sister, would you?\n\n                     LEONARD\n                You think you're my sister?\n\nINT.   STAIRCASE\n\nKenny manages to pull himself back up to the second floor.\n\nINT.   BEDROOM\n\nJody turns to look at LEONARD as Kenny appears in the doorway.\n\n                      JODY\n                 We have the same color eyes.\n\nHe looks into her eyes.\n\n                      LEONARD\n                 You're right. We do.\n\nLeonard stares at Jody for a moment, relaxing his grip, giving Kenny just \nthe break he needs to dive for Leonard's arm, surprising him, knocking him \nover. They struggle for the razor but Leonard overpowers him and grabs it, \ncutting his own hand. He turns and slices Kenny down the side, cutting him \ndeep.\n\nKenny fights off the pain and leaps on Leonard's back, grabbing his arm \naround the neck.\n\nLeonard stands up and twirls around, trying to knock Kenny off his back, \nsmashing him into walls.\n\nKenny screams in pain, but doesn't let go, pulling at Leonard's face and \nthroat.\n\nLeonard spins faster.\n\nJODY struggles to her feet, holding her neck, still losing a little blood. \nKenny's grips start to slip as Leonard reaches back, to slice him across \nthe face and neck.\n\nLEONARD, backs up towards the window, slips over a dildo. He screams, \nloses his grip on Kenny, goes crashing out the second story window.\n\nEXT.  HOUSE\n\nLeonard crashes to the ground below, landing on his back on the front \nsteps.\n\nINT.  BEDROOM\n\nJody looks out after him. He looks up to her. Their eyes meet.\n\nEXT.  HOUSE\n\nKIDS start circling Leonard.\n\nLeonard gets to his knees, still holding the razor. They start taunting \nhim.\n\n                    BOY 1\n                It's the freak!\n\nThe kids inch closer to Leonard.\n          \n                    GIRL 1\n                He's still got the blade!\n\nOne kid kicks him. Leonard slashes at the kid, but misses. Another boy \nkicks the knife out of his hands. A third picks it up.\n\n                    BOY 3\n                Come on! It's fuck him up time!\n\nOne boy kicks Leonard in the face. Another kicks him in the ribs, another \nin the balls. Leonard tries to fight back for a second but slowly they all \ndescend on him, taking turns kicking and beating the ever living shit out \nof him. It's a feeding frenzy.  He disappears under the angry mob of \nteenagers.\n\nINT.  BEDROOM\n\nJody helps Kenny to his feet.\n\n                     KENNY\n                Come on. Lets get out of here.\n\nEXT.  FRONT YARD\n\nPolice cars screech to a stop out front. The kids are all disappearing off \ndown the street.\n\nJODY AND KENNY emerge out the front door, look down at LEONARD, barely \nalive, lying at bloody mess at the base of the steps.\n     \n                      LEONARD\n                J-Jody. P-please help me.\n                Please.\n\nLeonard spits up blood. Jody squeals. Kenny covers her eyes.\n\nCLOSE on the BALCONY overhead. The railing breaks off and the balcony \ncomes crashing down, falling on Leonard, killing him. Jody embraces Kenny \ntightly.\n\n                      KENNY\n                It's all over now.\n\ndissolve to:\n\nEXT.  AVON LAKE CEMETERY\n\nCemetery- Brent's coffin is in a grave. People are leaving the funeral.\n\nJody is with her Mom. They are the last ones there. They watch as the \nworkers start to throw dirt on the coffin.\n\nJody takes her mom's hand in her own. They're close again.\n\nDissolve to:\n\nINT.  JODY'S BEDROOM -  A MONTH LATER\n\nIt's night. Jody is asleep.\n\nEXT.  BEDROOM\n\nSomeone is in the shadows outside, climbing up to her bedroom window.\n\nINT.  BEDROOM\n\nIntruder's POV - Through the window, Jody is sound asleep in her bed, \nvulnerable.\n\nThe window opens. Someone steps in and moves quietly over to the edge of \nthe bed. She wakes, startled. She looks up. IT'S KENNY.\n\n                     KENNY\n                  (smiling)\n               I'm all out of patience.\n\nHe climbs in her bed and takes her. She lets him. She's into it.\n\nA pair of eyes peer through the slates of Jody's closet door. Someone is \nhidden in her closet.\n\nKILLER'S POV - Jody and Kenny are now in the middle of making love for the \nfirst time. It's getting hot.\n\n                     JODY\n               Oh God, this is the way it\n               should be.\n\nThe closet door opens. The real LISA SHERMAN is there. Maybe she wasn't \ndead after all!\n\nShe starts toward Jody, raising a huge butcher knife over her head.\n\nJody sees her and screams.\n\nThe knife comes down toward the center of Kenny's back.\n\nHis face contorts as the knife enters his body. Jody screams as he coughs \nup blood all over her breasts.\n\nHe looks helplessly at Jody, dying as the knife comes down again.\n\nBut now it's her father who's doing the stabbing!\n\nINT.  JODY'S BEDROOM \n\nJody wakes up from her dream, startled and shaken. She looks next to \nherself in bed. Kenny is lying there asleep, smiling, probably dreaming of \nher. The window is open. He must have climbed in.\n\nThere is a little red spot on the sheet next to her.\n\nShe cuddles up next to him as the sun starts to rise outside.\n\nDissolve to:\n\nEXT.  CHERRY FALLS\n\nThe entrance to the town. The hanging sign reads 'Entering Cherry Falls, \nOhio'.\n\nThe beautiful town is now peaceful again. The crickets are chirping, the \nrobins begin cooing. Suddenly a window comes up and the hanging sign \nbegins to sway back and forth, almost on its own.\n\nCUT TO BLACK\n\nTHE END\n\n\n\n\nCherry Falls\nWriters :   Ken Selden\nGenres :   Horror  Thriller  Comedy  Mystery\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "In the woods outside of Cherry Falls, Virginia, a teenage couple, Rod Harper (Jesse Bradford) and Stacy Twelfmann (Bre Blair) are getting romantic in a car when a black-haired female appears and murders them both. Meanwhile, in town, teenager Jody Marken (Brittany Murphy), the daughter of the local sheriff, is with her boyfriend, Kenny (Gabriel Mann), who thinks it is time to go \"see other people.\" Jody goes back home to find her father, Brent (Michael Biehn), upset that she is out past her curfew. Brent and his deputies begin to investigate the murders the next day. They see that the killer carved the word \"virgin\" into both victims. At school, Brent sees English teacher Mr. Marliston (Jay Mohr), who urges him to divulge more details of the murder to students and the town so as to eliminate the possibility of secrets.\nAnnette Duwald, also a virgin, is killed in the same fashion of the last night's events. Concerned for the town's safety, Brent holds a meeting at the high school to tell parents the nature of the crimes. No students are invited, but Jody and her friend Timmy, who stayed after school, witness the meeting. Timmy asks to borrow Jody's cell phone, and goes into the stairwell to make a call. Jody goes downstairs to find him, and discovers his dead body in a locker room. She is confronted by the killer who attacks her, but she manages to escape. At the police station, Jody describes the killer to an officer, who draws a composite. Brent confides with an old friend, Tom Sisler, (the current high school principal) that the suspect looks like \"Lora Lee Sherman.\" The two are both visibly nervous, and Jody listens in on their conversation.\nLater at school, Jody and Kenny reconcile, and later Jody learns from her mother about the tale of Lora Lee. Twenty-five years ago, Lora Lee was a high school loner. She claimed that four popular boys at school, including Brent and the high school principal, raped her one night. Her cries fell on deaf ears and she left the city for the rural outskirts, where she was rarely seen or heard from again. After Jody discovers the truth, disappointed with the hypocrisy of her parents, she visits Kenny at his house. They talk, and Jody being upset with her parents, tries to pressure sex on Kenny. He refuses, pushing her away.\nAfter catching new of the killer's targeting of virgins, the high school students in town congregate at an abandoned hunting lodge to indulge in a mass orgy. Brent goes to the school to meet Sisler only to find the principal dead in his office with the words \"virgin not\" carved into his forehead. Before Brent can react he is knocked out by the killer. Jody, who has refused to attend the orgy with Kenny, is out riding her bike when she cycles by Mr. Marliston's house and witnesses him dragging a heavy trunk inside. Suspicious, Jody sneaks into the house and opens the trunk. She recoils as she finds the beaten and bloody body of her unconscious father inside, before she too is knocked unconscious. At the orgy, Kenny is about to have sex with a girl when he has second thoughts and leaves to find Jody. He drives around trying to find her but is puzzled to see her bicycle outside of Marliston's house.\nDownstairs in his house, Marliston puts on a wig and makeup to \"become\" Lora Lee Sherman. Marliston reveals that he is Lora Lee Sherman's illegitimate son, and asks Brent to retell the story of what happened that night 25 years ago. Brent reveals that the four boys, including himself, did indeed rape Lora Lee. Marliston says his mother became an abusive \"psycho\" after the rape and that one of the rapists is his father; there is an implication that Brent is in fact Marliston's biological father. By frightening virgins, Marliston anticipated a large high school orgy, which would thereby rob all the wealthy parents of their precious children's virginity.\nKenny enters the house and frees Jody as Brent fights with Marliston, who manages to brutally kill him. Jody and Kenny flee to the orgy with Marliston in furious pursuit, killing a deputy en route. He bursts inside wielding an axe and mass panic erupts. After wildly stabbing panicking students and then trying to escape, Marliston fights both Jody and Kenny, with Kenny being severely wounded during the melee. Eventually, Marliston is pushed off a balcony by Jody and impaled on fence posts. At first he seems to be dead, before reviving briefly only to be promptly shot dead by Deputy Mina, who unloads two pistols into him. The next day, Jody and her mother head away from the police station. As they leave, Jody sees someone resembling Lora Lee Sherman disappear behind a moving bus. The film ends with a shot of the waterfalls outside town turning red."}