{"title": "Color of Night", "full_text": "Color of Night\nWriters :   Billy Ray  Matthew Chapman\nGenres :   Mystery  Romance  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Dr. Bill Capa (Willis), a New York City psychologist, falls into a deep depression after an unstable patient commits suicide in front of him by jumping from his office window. The sight of the bloody body of his patient clad in a bright green dress causes Capa to suffer from psychosomatic color blindness, taking away his ability to see the color red.\nTo restart his life, Capa travels to Los Angeles to stay with a friend, fellow therapist and best-selling author Dr. Bob Moore (Bakula), who invites him to sit in on a group therapy session. But one night Moore is violently murdered in the office and Capa is plunged into the mystery of his friend's death.\nMoore would gather his patients every Monday for a discussion of their problems. Police detective Lt. Hector Martinez (Blades) considers them, and possibly Capa, suspects in the murder. Capa continues to live in Moore's house and begins an affair with Rose (March), a mysterious girl who comes and goes. He takes over Moore's therapy group and learns of their pasts and obsessions:\nClark (Brad Dourif) suffers from severe obsessive compulsive disorder and insists on cleanliness and counting things. He also has a violent temper, and months earlier beat up his wife.\nSondra (Lesley Ann Warren) is a nymphomaniac and kleptomaniac. She stabbed her father with a knife and fork and her husband died of unnatural causes.\nBuck (Lance Henriksen) is a suicidal ex-cop. The murder of his wife and daughter remains unsolved.\nCasey (Kevin J. O'Connor), the arrogant son of a wealthy man, paints sado-masochist works of art. He once burned down his father's house.\nRichie is a transgender 16-year-old who wishes to transition to female. Richie also has social anxiety disorder, a stutter and a history of drug use.\nOne of these patients is violently murdered. Capa also becomes the target of several attempts on his life. He discovers that all but one of his patients have been romantically involved with Rose.\nThis leads to a twist ending: \"Richie\" is really Rose, and the murders have been committed by her deranged brother Dale (Andrew Lowery). They once had an actual brother named Richie who was molested by a child psychiatrist named Niedelmeyer. Richie committed suicide and, unable to cope with the loss, Dale forced Rose to play the part of their brother. Dale — who was also one of Niedelmeyer's victims — began abusing Rose until she actually became \"Richie\". When \"Richie\" was arrested for drug possession, \"he\" was forced into therapy. Rose soon started to re-emerge and, under another personality, \"Bonnie\", started relationships with other members of the group. Dale proceeded to kill them, fearing that they would soon link Rose to \"Richie\".\nCapa confronts them and is overpowered by Dale, who is about to kill him with a nail gun but is instead killed by Rose. Deeply traumatized, she then tries to commit suicide. Capa is able to stop her, bookending the story with two suicide attempts — one at the beginning, resulting in Capa's loss of color vision, and one at the end, thwarted and resulting in his regaining it."}