{"title": "Copycat", "full_text": "<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>Copycat\n\n\n\nCOPYCAT\n\nthird draft by\nFrank Pierson\n\nParticipating writers:\nAnn Biderman\nJay Presson Allen\n\n\n\n\n\tINT. LECTURE HALL BERKELEY - DAY\n\n\tThe hall is full.  On the stage, DR. HELEN HUDSON is\n\tspeaking.  HELEN is a forensic psychologist.  Behind her is\n\ta projected diagram: PREDISPOSITION, DISSOCIATION, TRAUMA,\n\tFANTASY, VIOLENT FANTASY, FACILITATORS, MURDER, and\n\tTRAUMA-REINFORCEMENT which she can point to with a laser\n\tpointing device.  We see her from a considerable\n\tdistance... the back of the balcony.  Her voice is crisp and\n\tassured.\n\n\t\t\t\tHELEN\n\t\tOur society creates these socially\n\t\tand psychically disenfranchised\n\t\tmen, and their revenge on society\n\t\tis terrible.  They are hard to\n\t\tcatch.  They are \"the nice guy next\n\t\tdoor,\" their employers -- if they\n\t\twork at all -- find them quiet and\n\t\tuncomplaining.  Early abuse and\n\t\trejection have taught them\n\t\tpassivity.  Only in their violent\n\t\tfantasies do they feel alive.  What\n\t\tthey seek in their frenzied\n\t\tassaults on their victims is relief\n\t\tfrom passivity.  For these men, ten\n\t\tminutes relief is worth far more\n\t\tthan the life of another human\n\t\tbeing.  Torture, the pain they\n\t\tinflict, the screams of the victim,\n\t\tare all part of the ritual that\n\t\tgives them a brief respite from\n\t\ttheir own psychic pain.  And then\n\t\tthe depression, the forgetting, the\n\t\tfeeling of sadness and despair\n\t\tbegins the cycle all over again.\n\t\tLike addicts seeking their drug,\n\t\tAlbert DeSalvo, Bianchi and Buono,\n\t\tBerkowitz, Dahmer, Bundy -- they\n\t\tseek out their next victim.\n\n\tDuring the second half of this speech, the eye of the camera\n\thas moved slowly forward until it settles just behind the\n\tbalcony railing.\n\n\tCLOSEUP: HELEN\n\n\t\t\t\tHELEN\n\t\tThe cycle is endless until they are\n\t\tcaught.  And they are caught by\n\t\tchance -- they run a red light, and\n\t\ta body is in the trunk.  A leaking\t\n\t\tpipe brings a plumber to a basement\n\t\twhere they is the smell of death.\n\n\tHer eyes have come to rest on the spot of the camera eye in\n\tthe balcony... Her voice chokes off.  She stares.\n\n\tHELEN'S POV:\n\n\tSitting in the front row of the balcony, a YOUNG RED-HEADED\n\tMAN (DARYLL LEE CULLUM) leans forward, resting his tattooed\n\tarms on the railing.  He smiles intimately at HELEN.\n\n\tHELEN cuts her eyes to the left.  She sees:\n\n\tBackstage, an overweight COP in plain clothes.  Instantly\n\talert to HELEN'S alarm, he jumps up, comes within an inch of\n\texposing his presence to the audience.  A SECOND COP, in the\n\twings on the other side of the stage, also springs to\n\tattention.  FIRST COP'S eyes follow HELEN'S...\n\n\tTheir POV:  THE BALCONY - YOUNG RED-HEADED MAN is no longer\n\tthere.\n\n\tHELEN  Can she believe her eyes?  Resumes:\n\n\t\t\t\tHELEN\n\t\tAt any time, right now, as you\n\t\tlisten, the FBI estimates there are\n\t\t30 to 35 serial killers stalking\n\t\ttheir victims.  The serial killer is\n\t\ta plaque that must be addressed not\n\t\tonly by the law, but by science.\n\t\tFlorida spent eight million dollars\n\t\tto execute Ted Bundy.  It would\n\t\thave been better spent building a\n\t\tforensic penal facility devoted to\n\t\tresearch.\n\n\tOnce again her eyes fix on the balcony to reassure herself\n\tthat the smiling man is not there...\n\n\t\t\t\tHELEN\n\t\tConfined for life, without parole,\n\t\tand subjected to scientific study,\n\t\tthese men's lives might finally, in\n\t\tsome small measure, educate and\n\t\tthereby protect society.  Thank\n\t\tyou.\n\n\tApplause as Helen warily checks for the TWO COPS.  They are\n\tcarefully casing the crowd.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\n\tLATER:\n\n\tThe crowd is breaking up.  FIRST COP walks HELEN to the\n\tladies' room.  People reach to shake Helen's hand; she copes \n\tas well as she can with her fear.  THEY LEAVE THE STAGE\n\tTHROUGH A DOOR OPENING TO A CORRIDOR LEADING BACK TO\n\tDRESSING ROOMS AND A LADIES' ROOM...\n\n\t\t\t\t\t\t\t\tCUT TO:\n\n\tINT. LADIES' ROOM - DAY\n\n\tTHE COP, clearly embarrassed, pokes his head in and looks\n\taround.  Under one stall he sees a woman's HIGH HEELS.  He\n\thastily ducks back into HALL and signals an okay to Helen.\n\tBefore the door behind her closes, we see the COP prepare to\n\tstand guard outside.  HELEN walks past the stall with the\n\thigh heels to a stall several doors down.\n\n\tCLOSE UP HIGH HEELS:\n\n\tAnd a tattoo that the cop missed seeing on one of the\n\tankles.  The shoes are kicked off.  The feet disappear from\n\tview as\n\n\tHELEN, a few stalls away, methodically places toilet paper\n\taround the seat before raising her skirt.  A faint noise\n\tmakes her freeze.  Her hand reaches for the door.  She is\n\tjust able to unlock it, but no more, before a NOISE COMES\n\tDOWN FROM THE NEXT STALL.\n\n\tLike a lariat it falls over HELEN'S head and is violently\n\tyanked tight.  She kicks at the stall door.\n\n\tCORRIDOR: COP, leaning against outside door smoking, hears\n\tthe clang of metal as the stall door bangs open. He\n\treacts...\n\n\tINT. LADIES ROOM - CONTINUED\n\n\tThe RED-HEADED MAN is struggling to secure the rope around a\n\thook inside his own stall.  KNOCKING (o.s.)\n\n\t\t\t\tCOP (o.s.)\n\t\tDoctor Hudson?  Are you okay in\n\t\tthere?\n\n\tThe MAN lets slip a little slack.\n\n\tHELEN'S fingers, thrusting between the rope and her neck,\n\tget just enough air for HELEN to let out a strangled little\n\tscream.\n\n\tCORRIDOR: COP, not certain what to do about the ambiguous\n\tsounds from inside.  Women stands nearby, inhibiting him for\n\ta split second from going in the Ladies' Room door.  Now\n\tthere is more SOUND from inside...\n\n\tINT. LADIES ROOM - CONTINUOUS\n\n\tCOP steps into the room, gun down.  Over the COP'S shoulder\n\twe see HELEN hanging in open booth, her hand fluttering at\n\ther throat.  She has one slippery shoeless foot on the\n\ttoilet seat.\n\n\tCOP takes a couple of steps forward.  Behind COP'S back we\n\tsee a broom closet door opening.\n\n\tHELEN'S POV: CLOSE UP: The COP, taken from behind.  In a\n\tsecond, his throat is slit.  In a gush of  blood, he falls,\n\this gun still in his hand.\n\n\tRED-HEADED MAN standing over the fallen COP, smiling at\n\tHELEN.\n\n\tCOP'S BODY IS TWITCHING, JERKING.  The violent contractions\n\tin his fingers cause the gun to go off... ONE... TWO SHOTS,\n\tthe sound reverberating against the tile walls.\n\n\tSTAGE AREA\n\n\tThe audience and SECOND COP react to the gunshots.\n\tHELEN, her eyes bulging, struggling against the rope.\n\n\t\t\t\t\t\t\t\tSLAM CUT:\n\n\tINT. HELEN'S APT - SAN FRANCISCO - NIGHT\n\n\tAs HELEN, in bed, bolts up from the nightmare, her hands try\n\tdesperately to pull the dream rope from her neck.  She is now\n\tpale, her hair is dirty, there are deep circles under her\n\teyes.  This is a woman in the throes of a breakdown.\n\n\t\t\t\tHELEN\n\t\tAndy!  Andy!\n\n\tShe races through this LOFT APARTMENT (THE WALLS ARE EIGHT\n\tFEET UNDER A TWELVE-FOOT CEILING) to study opening off a\n\thall.  She looks in, gasping for breathing...\n\n\tINT. STUDY - CONTINUOUS\n\n\tThe room is neat -- nobody there.  (We will later see that it\n\tis used on and off by her computer, Andy.)\n\n\tHELEN whimpers in frustration; she is alone.  SHE TALKS TO\n\tHERSELF as she turns back and moves past a LIVING ROOM,\n\twhere she turns on lights and the TV flicks on, (COURT TV.)\n\tThe sound comes up, loud... She moves on... trying to calm\n\therself with the sound of her own voice...\n\n\t\t\t\tHELEN\n\t\tIt is October twelfth, 1994 in the\n\t\tcity of San Francisco, California,\n\t\tU.S.A., the strongest, richest,\n\t\tmost stable and happiest country in\n\t\tthe world.  That is the sole place\n\t\tof life in the universe.  Under\n\t\tGod.\n\n\tCLOSE: XANAX BOTTLE.  Two pills are shaken out into a palm,\n\tothers scattering from the nervous haste...\n\n\tCLOSE: HELEN  Watching herself in BATHROOM mirror as she\n\ttosses down the pills, gulps water.  She regards her haggard\n\treflection with a certain detachment...\n\n\t\t\t\tHELEN\n\t\tGood God.  What happened to you?\n\n\tShe barks a rueful laugh... we are seeing a woman will\n\therself from near-hysteria to relative calm...\n\n\t\t\t\t\t\t\t\tCUT TO:\n\n\tHALL  As she exits the bathroom.  And moves into her OFFICE.\n\tShe pours herself a brandy and stands before two computers.\n\tOf the side-by-side computer screens, one is blank.  The\n\tother shows a chess setup.  Flashing on the bottom of the\n\tscreen comes a command.\n\n\t\t\t\tCHESSMASTER\n\t\t'It's almost seven.  Make a goddam\n\t\tmove.'\n\n\tShe studies the chess set-up for a moment, then makes a\n\tmove.  She has not even hit the Keyboard of the other\n\tcomputer before CHESSMASTER sends another message.\n\n\t\t\t\tCHESSMASTER\n\t\t'Lousy move.  Not really into this\n\t\tgame, Helen.  Let's drop it.  I've\n\t\tgot a feeling about you.  Let's\n\t\tmeet.  Like a date.'\n\n\tHELEN types the following to CHESSMASTER.\n\n\t\t\t\tHELEN\n\t\t'I'm a terrible date.  I'd mess up your\n\t\tlife.'\n\n\t\t\t\tCHESSMASTER\n\t\t'Another romantic dream gone all to\n\t\thell.'\n\n\t\t\t\tHELEN\n\t\t'Maybe it's better to just dream\n\t\ton; avoid the disappointments of\n\t\tlife.  Come on, move.'\n\n\tShe pushes a button on the remote, and we see the window\n\tcurtains open.  BRIGHT SUNLIGHT STREAMS IN!  We see that the\n\tT-shirt HELEN wears says \"Shrinks 'R' Us.\"  She crosses to\n\tthe window with her glass of cognac, looks out.\n\n\tVIEW:\n\n\tA sweeping view of the bay, and across to Marin County.  The\n\tmorning sun is dispelling the last of the night's fog.\n\tHELEN opens window, puts a hand outside, trying to feel the\n\tair, the freedom.  Feeling quite restored from the dream\n\thorror of the night...\n\n\tO.S., THE PHONE RINGS.  HELEN.  A FRISSON.\n\n\tCLOSE: PHONE  Her hand comes into FRAME and picks up the\n\thandset and carries CAMERA TO CLOSEUP HELEN.\n\n\t\t\t\tHELEN\n\t\t\t(carefully)\n\t\tYes?\n\t\t\t(listens)\n\t\tYou son-of-a-bitch!  Son of\n\t\ta bitch...\n\n\tStiff with fear and rage, she slams down phone.\n\n\t\t\t\tHELEN\n\t\tYou filthy... son of a bitch!\n\n\tOn the computer screen behind her the Chessmaster makes his\n\tmove: the computer speaks in its tiny computer voice:\n\n\t\t\t\tCOMPUTER\n\t\t\t(filter)\n\t\tYou Queen is in check.\n\t\tProtect your Queen.\n\n\tOVER CREDITS:\n\n\tHOME MOVIE of a young woman dressed in a seat suit.  It is\n\tmorning, and she is jogging on a park path.  Her hair is in\n\ta long braid.  She is sweating, breathing heavily, clearly\n\tnear the end of a satisfactory run.\n\n\tTHE FILM REVERSES, THE FILM STARTS UP AGAIN IN EXTREMELY\n\tSLOW MOTION.  WE ARE NOW AWARE THERE IS ANOTHER POINT OF VIEW\n\tAT WORK HERE.\n\n\tNOW THE FRAME FREEZES AT A POINT WHERE IT MAKES THE JOGGER'S\n\tOPEN-MOUTHED DEEP BREATHING LOOK LIKE\n\n\tA SCREAM!\n\n\tEND TITLE AND CREDITS:\n\n\tINT. RIFLE RANGE - DAY\n\n\tMUZZLE OF SEMI AUTOMATIC PISTOL BLASTS NINE SHOTS ALMOST\n\tDIRECTLY INTO CAMERA.  A BEAT OF SILENCE...\n\n\tTHE TARGET: it is a silhouette of a man's head and torso;\n\tcentered in the right side of the upper chest, near the\n\tshoulder, is a small red circle.  Still SMOKING, THE HOLES\n\tFROM THE BULLETS are scattered all over the chest, and none\n\tin the circle.\n\n\t\t\t\tM.J. (V.O.)\n\t\tMy third grade teacher at the\n\t\tconvent shot better than that.\n\n\tTHE SHOOTER, RUBEN GOETZ, AND PARTNER M.J.\n\n\t\t\t\tRUBEN\n\t\tYeah, but she had divine guidance.\n\n\tWe now take in the shooter, RUBEN, and his companion M.J.\n\tHALLORAN.  M.J. is a small, deceptively vulnerable looking\n\tyoung woman.  She is neat, buttoned down, crisp.  M.J.\n\tappears to be about twenty-five.  She is, in fact,\n\tthirty-four and a homicide inspector with the rank of\n\tsergeant.  She is usually dressed in slacks and a loose\n\tsweater or an oversize jacket that helps make her appear\n\teven smaller and younger than she is.\n\n\tRUBEN GOETZ is also in homicide, about twenty-six and junior\n\tin authority to M.J.  RUBEN is good-looking, good-humored\n\tand laid back.  He has a cellular phone attached to his\n\tbelt.\n\n\tM.J. PULLS THE LINE THAT DOLLIES THE TARGET BACK TO THEM,\n\tAND RUBEN REPLACES IT WITH ANOTHER AS THEY TALK.\n\n\t\t\t\tM.J.\n\t\tI'd feel a whole lot safer with\n\t\tSister Loretta for my backup.  Look\n\t\tat this guy: you shredded him!\n\n\t\t\t\tRUBEN\n\t\tWell, he's dead, he can't hurt me\n\t\tnow.\n\n\tThe target is rigged; they pull the line that dollies it back \n\tto shooting position.\n\n\t\t\t\tM.J.\n\t\tIt's sloppy shooting.  It's in\n\t\tcharacter, Ruben, but unnecessary.\n\t\tAnd bad for your career.\n\n\tRUBEN LETS OFF THREE QUICK SHOTS: they cluster nearer the\n\tcircle.  M.J. looks at him in surprise.\n\n\t\t\t\tRUBEN\n\t\tI've been practicing.  Now can I\n\t\tkiss your tummy?\n\n\tM.J. hides her smile as she prepares her weapon for her turn.\n\n\t\t\t\tM.J.\n\t\tPerp's holding a hostage, the\n\t\tshoulder on his gun hand is gonna\n\t\tbe exposed.\n\n\tSOUND: A CELLULAR PHONE (ON RUBENS' BELT).  M.J. holds her\n\tfire.\n\n\t\t\t\tM.J.\n\t\tAnswer it.\n\n\t\t\t\tRUBEN\n\t\tI'm sure she thinks it is.  Aren't\n\t\tyou at least interested in which\n\t\tone it is?\n\n\tShe's lost her concentration lowered the gun; now as he\n\tanswers, she raises her gun and aims...\n\n\t\t\t\tRUBEN\n\t\t\t(into phone)\n\t\tI'm here, where are you?...\n\t\tHeeeeyyy!  What a surprise!  No.  On\n\t\tduty, have to call you back... You,\n\t\ttoo, you too.  My God, you made my\n\t\tday.\n\n\tHe hits the \"end\" button...\n\n\t\t\t\tM.J.\n\t\tYou hit the brachial nerve...\n\n\tSHE FIRES!  The shots make a perfect heart around the circle,\n\tinside his looser pattern.  ONE FINAL SHOT STRIKES EXACTLY\n\tIN THE MIDDLE!\n\n\t\t\t\tM.J.\n\t\tYou're good enough you'll never\n\t\thave to kill anyone.  I joined the\n\t\tcops to save lives, not waste them.\n\n\t\t\t\tRUBEN\n\t\tYou know, M.J., when I watch you\n\t\tshoot, I realize I've got a little\n\t\tproblem with my stance... could you\n\t\tjust move over here and critique my\n\t\tlegs?\n\n\tHe slaps his thigh where he indicates the trouble might be.\n\tShe is unloading her weapon...\n\n\t\t\t\tM.J.\n\t\tThe problem is between your legs.\n\t\tYou told your shrink about that?\n\n\tShe is unloading and cleaning up.  Ruben doing the same...\n\n\t\t\t\tRUBEN\n\t\tI tell my shrink about you,\n\t\tSergeant.  I tell him you're the\n\t\ttop cop of my dreams.\n\n\tRuben has been gathering up his box of doughnuts, from which\n\the has nibbled during the preceding... he drops them, picks\n\tone up off the floor and sticks it in his mouth...\n\n\t\t\t\tM.J.\n\t\t\t(putting away her\n\t\t\t gear)\n\t\tDon't take that mess in the car.\n\n\tThey're on the move; as they go away from us...\n\n\t\t\t\tRUBEN\n\t\tHe's in love with you already...\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tEXT. CRIME SCENE - DAY\n\n\tThey pull up in front of an apartment building in the\n\tPacific Heights section.  Patrol cars flank the street, the\n\tthick yellow ticker tape \"POLICE CRIME SCENE DO NOT CROSS\"\n\tis already up.  M.J. double parks beside a blue-and-white.\n\tA couple of cars from the media are already there.  SUSAN\n\tSCHIFFER a bulldog of a woman, and her camera crew, waylay\n\tM.J. and Ruben as they cross the sidewalk...\n\n\t\t\t\tM.J.\n\t\tOh, Christ, the Mouth is already\n\t\there.\n\n\tShe is, with a cameraman with a haircut and smile that speak\n\tof a life of orthodontics and dreams of TV anchorship.\n\n\t\t\t\tRUBEN\n\t\tHey.  And there's the Haircut right\n\t\tbehind.  If she stops short he's\n\t\tgonna be there feet up her ass...\n\n\t\t\t\tSUSAN\n\t\t\t(on camera)\n\t\tInspector, can you...\n\n\t\t\t\tM.J.\n\t\tI just got here myself, Susan.\n\n\t\t\t\tSUSAN\n\t\t...confirm this third murder adds\n\t\tup to a pattern?  Do we have a\n\t\tserial killer on the loose in the\n\t\tcity?\n\n\t\t\t\tM.J.\n\t\tI just got here.  Talk to you\n\t\tlater...\n\n\t\t\t\tM.J.\n\t\t\t(as they escape behind the\n\t\t\t barrier tape)\n\t\tWhat the hell does she want to do,\n\t\tscare everybody to death?\n\n\t\t\t\tRUBEN\n\t\tThat's her job... Jesus, Quinn is\n\t\there already.\n\n\tQUINN, a splenetic Irishman, a politician, Chief of Homicide\n\tstands at the top of the steps leading to the front door.\n\tAs they climb up toward him...\n\n\t\t\t\tQUINN\n\t\tI been waiting... I have to do\n\t\teverything myself.  Photo, crime\n\t\ttech, the Coroner are already\n\t\tinside.  The Landlady calls it in;\n\t\ttenant is not answering when\n\t\tcalled, she sticks her head in,\n\t\tsees the body, uses the deceased's\n\t\ttelephone to call 911.  Otherwise\n\t\tnothing disturbed.  It's all yours,\n\t\tkid.  I'll take care of the Mouth\n\t\tand the Haircut.\n\n\tM.J. and Ruben enter...\n\n\tINT. APARTMENT HOUSE - HALL - DAY\n\n\tFour uniformed cops stand in the hall securing the premises;\n\tat the back one cop stands by a stunned and tearful woman\n\tchain-smoking (the Landlady).\n\n\t\t\t\tM.J.\n\t\t\t(to cop)\n\t\tThat the Landlady?\n\t\t\t(to Ruben)\n\t\tYou wanna talk to her, Ruben?\n\t\t\t(back to cops)\n\t\tWho was first on the scene?\n\n\tMike answers her question by answering to Ruben!\n\n\t\t\t\tMIKE\n\t\tI was.\n\n\t\t\t\tM.J.\n\t\t\t(forcefully)\n\t\tI'm over here?  What's your name,\n\t\tOfficer?\n\n\t\t\t\tMIKE\n\t\tMichael Johnson.\n\n\t\t\t\tM.J.\n\t\tYou touch anything, Mike?  Pick up\n\t\tanything?  Use the doorknob?  I\n\t\tdon't want to find your prints on\n\t\tanything later and you tell me you\n\t\tforgot to tell me.\n\n\t\t\t\tMIKE\n\t\tNo.  I didn't.\n\n\tShe glances at him, at the SLIGHTLY OLD INFLECTION ON THE \"I\n\tDIDN'T.\"  But moves on, as Ruben goes to the Landlady...\n\n\tINT. BATHROOM - DAY\n\n\tThe same YOUNG WOMAN we saw jogging, is now dead.  Hair\n\tstill in a long braid.  She wears only a blouse, open and\n\tpushed back.  She is on her back in the bathtub, with one\n\tleg dangling over the side of the tub.  The effect is\n\tslightly posed, but casual, relaxed.\n\n\tBending over her is DOC, the Coroner, WITHDRAWING A HUGE\n\tMEAT THERMOMETER FROM HER SIDE.\n\n\tM.J. APPEARS IN THE BACK OF THE SHOT taking in the scene.\n\tForeground, Doc reads the thermometer.  The photographer is\n\tfinishing up his shots.  The room is crowded.  Two Coroner's\n\tmen wait in the doorway, a stretcher standing on end between\n\tthem; M.J. has to pass between them to come down to the\n\tbody.  THROUGHOUT WE FOCUS ON M.J.'S FACE; HER REACTION TO\n\tTHE SCENE, RATHER THAN DWELLING ON THE SCENE ITSELF.  \n\t\n\tON M.J.:\n\t\n\t\t\t\tDOC (V.O.)\n\t\tLiver and rigor are telling me\n\t\tabout eight hours.  I'm gonna take\n\t\ther out now if it's alright.\n\n\t\t\t\tM.J.\n\t\tI'm seeing ligature marks on her\n\t\tneck here, petechial hemorrhages in\n\t\ther eyes.  Strangled.\n\n\t\t\t\tDOC\n\t\tYou got it.  Same as the other two.\n\n\tTHE TELEPHONE RINGS.\n\n\t\t\t\tCOP (V.O.)\n\t\tTell whoever she can't come to the\n\t\tphone, she's all tied up.\n\n\tNobody laughs...\n\n\t\t\t\tM.J.\n\t\tThat's real old material, get a new\n\t\twriter...\n\n\tShe picks up the phone after the second ring, holding\n\tit in tissue someone hands her...\n\n\t\t\t\tM.J.\n\t\tHello?\n\n\t\t\t\tPHONE VOICE\n\t\t\t(extremely cheerful)\n\t\tHello!  This is Geena Martinez, how\n\t\tare you this morning?\n\n\t\t\t\tM.J.\n\t\tWhat is this about, Ms Martinez?\n\n\t\t\t\tPHONE VOICE\n\t\tI'm conducting a telephone survey\n\t\tto determine whether you're\n\t\tsatisfied with your insurance on\n\t\tyour personal valuables...\n\n\tM.J. gently hangs up the phone.  She has been looking at the\n\tDead Woman... They pick up where they left off.\n\n\t\t\t\tDOC\n\t\tHe used something soft, like a\n\t\tstocking or a bathrobe tie.\n\n\t\t\t\tM.J.\n\t\tAnybody find it?\n\n\tNo answer as the Coroner's men crowd in beside M.J. to begin\n\tlifting the body out of the tub.  M.J. takes one last look\n\tinto the dead woman's eyes...\n\n\t\t\t\tM.J.\n\t\tCover her up, please.\n\n\tINT. HALLWAY - DAY\n\n\tRuben still talking to the Landlady and taking notes.  M.J.\n\tapproaches Mike... takes him aside...\n\n\t\t\t\tM.J.\n\t\tMike.  Why don't you tell me what's\n\t\tbothering you?\n\n\tMike is acutely uncomfortable.\n\n\t\t\t\tM.J.\n\t\tWhatever it is, I'm gonna find out\n\t\tand sooner is a hell of lot better\n\t\tthan later.\n\n\t\t\t\tMIKE\n\t\tWell, there's something missing in\n\t\tthere.  There was something around\n\t\ther neck when I came in there, but\n\t\tit's gone now.\n\n\t\t\t\tM.J.\n\t\tWho came in after you?\n\n\t\t\t\tMIKE\n\t\tLieutenant  Quinn.\n\n\tShe seems relieved.  Brightly:\n\n\t\t\t\tM.J.\n\t\tWell, it's all right, then, Mike.\n\t\tThanks.\n\n\tEXT. CRIME SCENE - DAY\n\n\tIn the door, M.J. appears, looking out thoughtfully over the\n\tscene; Ruben appears behind her.  The photographer is coming\n\tout...\n\n\t\t\t\tM.J.\n\t\t\t(to Photographer)\n\t\tGet me good faces on the crowd\n\t\there.  Get a couple of harness bulls\n\t\tto grab anybody who starts to\n\t\trun...\n\n\t\t\t\tPHOTOGRAPHER\n\t\tDon't tell your Grandmother how to\n\t\tsuck eggs.  I only been doing this\n\t\twork since your junior prom,\n\t\tdarling...\n\n\tBut M.J. is already on to other things.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. HELEN'S OUTSIDE HALLWAY - DAY\n\n\tCLOSE ON A FOLDED NEWSPAPER THAT LIES ON THE FLOOR FIVE OR\n\tFIX FEET FROM THE DOOR TO HELEN'S APARTMENT.  HOLD DOOR IN\n\tB.G.\n\n\tThe door opens and Helen looks out, wasted from cognac and\n\tXanax.  She looks for the newspaper and sees it with a look\n\tof despair.\n\n\tHELEN'S POV\n\n\tThe newspaper lies there, out of reach.\n\n\tHELEN\n\n\tAs she stretches out her foot toward the paper, can't reach\n\tit.\n\n\tPOV.  As she moves out into the hall her agoraphobia\n\tmanifests itself: DISTORTED VISION THAT MAKES THE HALL\n\tSTRETCH AND THE WALLS TAKE ON EXAGGERATED PERSPECTIVE;\n\tSICKENING -- VERTIGO!  The newspaper seems further away.\n\n\tHELEN  She drops to her knees and tries to lean out further\n\tinto the hall...\n\n\tPOV.  The floor seems to melt and roll in waves toward her.\n\tThe newspaper melts like a Dali watch.\n\n\tHELEN sweats.  She lies flat on her stomach and crawls toward\n\tthe newspaper... and with a supreme effort grabs it and\n\tsquirms back inside.\n\n\tINT. APARTMENT - DAY\n\n\tAs she slams the door shut on the hall, and sits gasping for\n\tbreath.  After a moment she can bring herself to look at the\n\tnewspaper... INSERT:\n\n\tPOLICE BAFFLED IN DEATHS OF THE WOMEN\n\n\t\t\t\tHELEN (V.O.)\n\t\tDamn fools!\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. QUINN'S OFFICE - DAY\n\n\tQUINN is watching a portable TV screen with profound distrust.\n\tOnscreen is SUSAN SCHIFFER.\n\n\t\t\t\tSUSAN\n\t\t... continues to stonewall the\n\t\tpublic.  Now...\n\n\tThere is a knock, but before QUINN can respond, M.J. enters.\n\n\t\t\t\tM.J.\n\t\tYou messed with the scene.\n\n\t\t\t\tQUINN\n\t\tShut up.\n\n\tHe and M.J. both listen to SUSAN.\n\n\t\t\t\tSUSAN\n\t\t... third Bay Area woman has been\n\t\tstrangled, but the police continue\n\t\tto deny that this is the work of\n\t\tone killer.  Lt. Thomas Quinn\n\t\tdeclares that the murders will be\n\t\ttreated as unrelated crimes, unless\n\t\tnew evidence...\n\n\tM.J. TURNS OFF THE TV, FACES QUINN...\n\n\t\t\t\tM.J.\n\t\tYou messed with the evidence.\n\n\t\t\t\tQUINN\n\t\tI tagged the goddamned stocking.\n\t\tIt ain't lost.  We're sequestering\n\t\tthat evidence.  That's the trap some\n\t\tson of a bitch is going to fall\n\t\tinto...\n\n\t\t\t\tM.J.\n\t\tAm I in charge of this thing?  Or\n\t\tnot.\n\n\t\t\t\tQUINN\n\t\tI said you were...\n\n\t\t\t\tNH\n\t\tThen I decided what evidence we\n\t\tchoose to sequester.\n\n\t\t\t\tQUINN\n\t\t\t(a beat here)\n\t\tOkay.  What do you want to\n\t\tsequester?\n\n\t\t\t\tM.J.\n\t\tThe stocking around the neck.\n\n\tA long moment of looking at each other.  Then...\n\n\t\t\t\tQUINN\n\t\tYou didn't say serial killer and I\n\t\tdidn't say serial killer.\n\n\t\t\t\tM.J.\n\t\tRight.\n\n\t\t\t\tQUINN\n\t\t\t(not satisfied she\n\t\t\t really means it)\n\t\tThis is the anniversary of the\n\t\tsummer of love and your city\n\t\tfathers have declared a Festival of\n\t\tLove.  The Mayor and Chamber of\n\t\tCommerce don't want TV announcing\n\t\tkillers on the loose.\n\n\t\t\t\tM.J.\n\t\tRight.\n\n\tAnd she starts to go...\n\n\t\t\t\tQUINN\n\t\tWe're gonna have a bunch of clapped\n\t\tout old hippies blissing on the\n\t\tGrateful Dead!  Sleeping in the\n\t\tpark, smoking dope and sticking\n\t\ttulips up their ass.\n\n\t\t\t\tM.J.\n\t\t\t(exiting)\n\t\tGood.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. SQUAD ROOM - DAY\n\n\tThis large room is very busy, many officers at work.  Known\n\tsexual offenders have been rounded up.  False confessors add\n\tto the crowd.  Detectives who are not dealing with these\n\tpeople are making and taking calls.  At this desk, a tall\n\tintense looking Detective, NICCOLETTI, interrogates a false\n\tconfessor, a man who looks like a businessman...\n\n\t\t\t\tNIKKO\n\t\tHarvey, I don't want you in here no\n\t\tmore, making false statements...\n\n\t\t\t\tCONFESSOR\n\t\tThey are not false.  We pay for\n\t\tcity government like this, you\n\t\tdon't even care about the truth?!\n\t\tI killed her in the bathtub.\n\n\t\t\t\tNIKKO\n\t\tWhy?\n\n\t\t\t\tCONFESSOR\n\t\tBecause she was dirty, a dirty\n\t\tgirl!\n\n\t\t\t\tNIKKO\n\t\tHow?  How did you do it, Harvey?\n\n\t\t\t\tHARVEY\n\t\tWith a knife?\n\n\t\t\t\tNIKKO\n\t\tGood guess, but not good enough.\n\t\tGet the fuck outta here...\n\n\tHe has stood as M.J. passes coming from Quinn's office.  He\n\tfalls into stride with her through the crowded scene... He\n\tis sweaty and sniffs his armpits as a matter of general\n\thygiene checkup...\n\n\t\t\t\tNIKKO\n\t\tWhat am I wasting my time with this\n\t\tshit for?\n\n\t\t\t\tM.J.\n\t\tBecause it's your job, that's all.\n\n\t\t\t\tNIKKO\n\t\tNot what I meant; why me?\n\n\t\t\t\tM.J.\n\t\t\t(cutting)\n\t\tMaybe it's something you did in\n\t\tthis life, Nikko...\n\n\tIt has the flavor of a spoiled intimacy, an unfinished\n\targument... He pantomimes she got him with a poison dart.\n\n\t\t\t\tNIKKO\n\t\tGot me.  That really hurt!  You...\n\n\tRuben joins them; Nikko stifles and turns away...\n\n\t\t\t\tM.J.\n\t\t\t(to Ruben)\n\t\tGet Mercer to run the medical,\n\t\tdental, legal bills, laundry and\n\t\tdry cleaning receipts, extermin-\n\t\tators, mailmen, grocery and\n\t\tdrugstore deliveries, handymen,\n\t\tplumbers...\n\n\t\t\t\tRUBEN\n\t\tIt's mostly done, they got nobody\n\t\tin common, the three of them... No\n\t\tmutual friends -- the Landlady says\n\t\tnobody was ever there, she never\n\t\tsaw her with anybody.\n\n\tThey are approaching PACHULSKI'S desk.  PACHULSKI is on\n\tphone.  Pachulski is looking at M.J., grinning...\n\n\t\t\t\tPACHULSKI\n\t\t\t(into phone)\n\t\tYes, ma'am, I know.  You can't talk\n\t\ther right now... because she's \n\t\tbusy, she's all tied up.\n\t\t\t(sotto to M.J.)\n\t\tDeep Throat's back.\n\n\tHe hits the speaker phone...\n\n\t\t\t\tFEMALE PHONE VOICE\n\t\tThis is the third one.  You've got\n\t\ta serial killer here.  When are you\n\t\tgoing to start warning people?\n\n\t\t\t\tPACHULSKI\n\t\t\t(whispering)\n\t\tFourteen calls from this broad.\n\t\tAnd she ain't stupid.\n\n\tM.J. signals for GIGI to trace the call.  Takes the phone,\n\tswitches off the speaker...\n\n\t\t\t\tM.J.\n\t\tWho is this?\n\n\tINT. HELEN'S OFFICE - DAY\n\n\tHELEN on phone\n\n\t\t\t\tHELEN\n\t\tWho is this?\n\n\t\t\t\tM.J.\n\t\tInspector Halloran, Homicide.  I'm\n\t\tin charge here.\n\n\t\t\t\tPACHULSKI\n\t\t\t(amused)\n\t\tAsk her about the moon bike.\n\n\t\t\t\tM.J.\n\t\tI'm really interested in your\n\t\tideas.  The moon bike.  What is\n\t\tthat?\n\n\t\t\t\tHELEN\n\t\tWhat is wrong with you people?\n\t\tThe first two, I thought he might\n\t\tbe on a lunar cycle because they\n\t\twere 28 days apart, but obviously\n\t\tnot.  This new one is only two\n\t\tweeks.\n\n\tPachulski is delighted at the joke he's played on M.J., M.J.\n\tnot so much... Gigi signals they're getting it.\n\n\t\t\t\tHELEN (cont'd)\n\t\tYou want to joke about moonbikes?!\n\n\t\t\t\tM.J.\n\t\tNo, ma'am.  This is no joke.  And\n\t\tneither is tying up telephone lines\n\t\tto police with crank calls while\n\t\tpeople in trouble are trying to get\n\t\tthrough for help.\n\n\t\t\t\tHELEN\n\t\tYou're calling me a crank?\n\n\t\t\t\tM.J.\n\t\tDo you have any evidence to report,\n\t\tma'am?  Do you know any of the\n\t\tvictims...\n\n\t\t\t\tHELEN\n\t\tI think this is number three...\n\n\t\t\t\tM.J.\n\t\t\t(over her)\n\t\tThat's an opinion, not evidence...\n\n\tGigi hands her a slip of paper... M.J. reads it... glares\n\tat Pachulski who is still laughing.  M.J. knows the name on\n\tthe slip of paper...\n\n\t\t\t\tM.J.\n\t\t\t(covers the phone)\n\t\tHelen Hudson.  Get Ruben back\n\t\there?\n\n\tAs she turns back to the phone...\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. HELEN'S LIVING ROOM - DAY\n\n\tHELEN, now wearing slippers and shorts with the same T-shirts\n\tshe slept in, is standing behind the living room curtains\n\tlooking down at the street.  She hears a code knock, then a\n\tkey turns in the lock.  She moves to greet ANDY her\n\tassistant and friend.  ANDY is laden down with groceries and\n\tmail.  HELEN immediately reaches a hand up to touch his\n\tface...\n\n\t\t\t\tHELEN\n\t\tWhere were you?  Don't tell me.\n\t\tIt's just under seventy, right?  The\n\t\tsun is strong but the air is dry\n\t\tand fresh...\n\n\t\t\t\tANDY\n\t\tWould you please get your hands off\n\t\tmy face, Tallulah?  What happened\n\t\tto the newspaper?\n\n\tHe withdraws a popsicle from the bag, offers it to her.\n\tWhen she rejects it, he takes it for himself.\n\n\t\t\t\tHELEN\n\t\tI got it myself... I couldn't wait.\n\n\t\t\t\tANDY\n\t\tWell!  Aren't we the daring one?\n\t\tWhat's morbid and ghastly enough in\n\t\tthe news to make Doctor Helen set\n\t\tfoot outside her door?  The antenna\n\t\tis gone off her car again.  I had\n\t\tno music, all the way to the\n\t\tmarket.  Let me find a garage for\n\t\tit?\n\n\tThey're in the kitchen area; Andy unpacking stuff...\n\texpensive goodies...\n\n\t\t\t\tHELEN\n\t\tI've told you:  I can't afford to\n\t\tgarage it.\n\n\t\t\t\tANDY\n\t\tAre you kidding?  You buy enough\n\t\tgourmet junk every week... most of\n\t\twhich rots... to garage a fleet of\n\t\tstretch limos.\n\n\t\t\t\tHELEN\n\t\tI had the dream again.\n\t\t\t(beat)\n\t\tAnd I got another call.  This time\n\t\the spoke.  He said \"You and me, you\n\t\tand me.\"\n\n\t\t\t\tANDY\n\t\tA little heavy breathing is what\n\t\tmost of us yearn for.  Forget it.\n\n\t\t\t\tHELEN\n\t\tHe whispered, but it was him!  I\n\t\tknow it was him!\n\n\tAndy now stops to address this seriously...\n\n\t\t\t\tANDY\n\t\tHe can't phone you unless the\n\t\twarden gets an okay from you.  Did\n\t\tyou give him an approval?\n\n\t\t\t\tHELEN\n\t\tAndy?  When a three-year-old says\n\t\tthere's a monster under the bed,\n\t\tyou don't say 'forget it'.  You\n\t\tlook under the bad.\n\t\t\t(beat)\n\t\tI'm three years old.  Call the\n\t\tprison.\n\n\tHer fear is so palpable, she is so nakedly vulnerable it\n\tbreaks his heart.  He puts his arms around her.\n\n\t\t\t\tHELEN\n\t\tOh God.  I'm really crazy.\n\n\t\t\t\tANDY\n\t\tWhen was the last time you washed\n\t\tyour hair?\n\n\t\t\t\tHELEN\n\t\t\t(shaky, but trying)\n\t\tMonsieur Andy, disapproves of my\n\t\tcoiffure?\n\n\t\t\t\tANDY\n\t\tMonsieur Andy can smell your\n\t\tcoiffure.  And guess what else?\n\n\tHe pats her thighs... she walks to the window as he talks...\n\n\t\t\t\tANDY\n\t\tCellulite.  What do you say I\n\t\tblindfold you and take you to the\n\t\tgym.  Aerobics with housewives...\n\n\tHELEN AT WINDOW\n\n\t\t\t\tHELEN\n\t\tAndy?\n\n\tAndy has heard this tone before:  panic attack alert.\n\n\t\t\t\tANDY\n\t\tHere we go again.\n\n\tANGLE AT WINDOW TO INCLUDE THEIR POV OF STREET\n\n\tIn a parked car a man is reading a newspaper that hides his\n\tface.  Behind him is parked a slightly beat up red Saab.\n\n\t\t\t\tHELEN\n\t\tYou parked right behind him.  The\n\t\tone I noticed earlier.  I didn't\n\t\tsay anything, I thought he'd leave.\n\t\tJust take a look.\n\n\t\t\t\tANDY\n\t\tOh my God!  Help!  HE'S READING A\n\t\tNEWSPAPER!\n\n\t\t\t\tHELEN\n\t\tBut earlier, he was staring up\n\t\there.  Please, Andy.\n\n\t\t\t\tANDY\n\t\tOkay.  You win.  'Dirty Harry'\n\t\tcoming up.\n\n\tANDY leaves the apartment.\n\n\tEXT. FRONT DOOR OF HELEN'S BUILDING - DAY\n\n\tThe heavy old industrial door is pushed slightly open, ANDY\n\tpeers out, sees:\n\n\tANDY crosses behind the car and then sneaks back, coming\n\tup to Driver's side window, surprising the Driver.\n\tTHE NEWSPAPER DROPS:  IT'S RUBEN.\n\n\t\t\t\tANDY\n\t\tExcuse me, but would you mind\n\t\texplaining why you're watching the\n\t\tlady upstairs?\n\n\t\t\t\tRUBEN\n\t\tNone of your fucking business.\n\n\tUsurping RUBEN'S aggressive attitude, ANDY leans his face\n\tclose to RUBEN'S window.\n\n\t\t\t\tANDY\n\t\tListen, asshole, I've got a gun...\n\n\tRUBEN grabs ANDY by the collar and yanks his head inside the\n\tcar.  With the other hand he pulls his gun and pushes it up\n\tANDY'S nose.\n\n\t\t\t\tRUBEN\n\t\tI hate this...\n\n\t\t\t\tANDY\n\t\tOnly kidding!\n\n\tRUBEN pushes the 'up' button on the window, capturing ANDY'S\n\thead in a deadlock.  Then he opens the door, gets out, slams\n\tdoor, forcing the squawking ANDY into a helpless frisk\n\tposition.  We HEAR HELEN scream, (O.S.).  Ignoring this,\n\tRUBEN begins to frisk ANDY.\n\n\tM.J. APPROACHING IN HER OWN CAR, SEES THE ACTION, BRAKES\n\tFAST AND GETS OUT.\n\n\tHELEN at window, shouting.\n\n\t\t\t\tHELEN\n\t\tI'm calling the police!\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. HELEN'S LIVING ROOM - DAY\n\n\tAndy enters, followed by Ruben and M.J., who holds up her\n\tbadge to Helen.\n\n\t\t\t\tM.J.\n\t\tInvestigators Halloran and Goetz.  I\n\t\tapologize for Goetz, he's a\n\t\tfirehouse dog.\n\n\t\t\t\tANDY\n\t\t\t(trying to defuse)\n\t\tI'm okay.  I really kind of enjoyed\n\t\tit.\n\n\tUncomfortable silence for a beat as they try to take in\n\twhat's happening, who's who and what's what.  Helen is\n\tconfused, fighting back fear...\n\n\t\t\t\tM.J.\n\t\t\t(trying to communicate\n\t\t\t here)\n\t\tRing the gong, he goes.  Poor\n\t\timpulse control.\n\n\t\t\t\tHELEN\n\t\tIs he out?\n\n\t\t\t\tM.J.\n\t\tWho?\n\n\t\t\t\tHELEN\n\t\t\t(to Andy)\n\t\tIf he's not out, why are they here?\n\n\t\t\t\tM.J.\n\t\tBecause of your phone calls.\n\n\t\t\t\tHELEN\n\t\tWhat calls?  I haven't made any\n\t\tcalls.\n\n\t\t\t\tANDY\n\t\t\t(to distract)\n\t\tAre you staying long?  Shall I shut\n\t\tthe door?  Make your coffee?  Make\n\t\tthe beds?\n\n\t\t\t\tM.J.\n\t\t\t(to Helen)\n\t\tYou talked to me.  Do you remember?\n\n\tThe two women measure each other, Helen struggling to\n\tcontrol herself.  A beat.\n\n\t\t\t\tHELEN\n\t\tYou were the one that talked about\n\t\tmoonbikes and called me a crank?\n\t\tOh God, I am!\n\t\t\t(to Andy)\n\t\tMake them some coffee.\n\t\t\t(to M.J.)\n\t\tHalloran, is it?  Investigator\n\t\tGoetz?  I had a crank call myself--\n\t\the said...\n\t\t\t(a moment of real\n\t\t\t fear)\n\t\tI thought it might be Daryll Lee\n\t\tCullum.  I thought he might be out\n\t\tof prison.\n\n\t\t\t\tRUBEN\n\t\tDaryll Lee Cullum?  I don't think\n\t\tso.  If he's escaped we'd have the\n\t\tNational Guard, cops'd be crawling\n\t\tthrough sewers.  You'd have a guard\n\t\ton your front door.\n\n\t\t\t\tM.J.\n\t\t\t(looking around)\n\t\tI want to tell you it's a great\n\t\thonor to meet you and talk to you.\n\n\t\t\t\tHELEN\n\t\tYou don't admire me.  No police\n\t\tadmire me.  I got one of you\n\t\tkilled.  Why don't you say right\n\t\tout what you're here for?\n\n\t\t\t\tM.J.\n\t\tYou called us, Doctor Hudson.\n\n\t\t\t\tHELEN\n\t\tYes, I did.  Poor impulse control.\n\t\tThe accounts of the firs two\n\t\tmurders made it so clear they were\n\t\tthe work of the same man, but you\n\t\tkept announcing they were\n\t\tunrelated.  You'll never catch him\n\t\tthat way.\n\n\tM.J. regards her for a moment...\n\n\t\t\t\tM.J.\n\t\t\t(to Andy)\n\t\tSugar and cream for Goetz; I take\n\t\tmine black.\n\t\t\t(beat)\n\t\tYou're absolutely correct.  The\n\t\tpoliticians don't want panic\n\t\theadlines spoiling the Festival of\n\t\tLove.\n\n\t\t\t\tHELEN\n\t\tWell, let's thank God you and\n\t\tInspector Goetz are on the case,\n\t\tthen.\n\n\t\t\t\tM.J.\n\t\tWould you want to work with us on\n\t\tthis?\n\n\t\t\t\tHELEN\n\t\tOh, my God, no!  I'm a clinical\n\t\thysteric, with panic syndrome, and\n\t\tanxiety neurosis, agoraphobic, I'm\n\t\tafraid of everything, real and\n\t\timaginary.  I never leave this\n\t\tapartment now.  Nobody ever comes\n\t\there.  I just wanted to get your\n\t\tattention.  I write and I used to\n\t\tlecture on these crimes, but... I'm\n\t\tnot competent.\n\n\t\t\t\tM.J.\n\t\tI think you are.  I really admire\n\t\teverything you've done; it would be\n\t\tan honor to work with you, and we\n\t\tneed all the help we can get,\n\t\tespecially yours.\n\n\t\t\t\tHELEN\n\t\tInspector Halloran, that is so much\n\t\tbullshit, you don't like or admire\n\t\tme, but the beautiful part is I\n\t\tdon't give a fuck.  That's the\n\t\tupside of having a breakdown.\n\n\t\t\t\tM.J.\n\t\tWell, it's a hell of an apartment\n\t\tyou got here.  I'm living one step\n\t\taway from the projects, myself, but\n\t\tI get to go to work every day,\n\t\twading in blood and guts.  I guess\n\t\tthe books you wrote about these\n\t\tsons of bitches paid off pretty\n\t\tgood.\n\n\t\t\t\tHELEN\n\t\tWill you go.  Andy, make them go.\n\n\t\t\t\tM.J.\n\t\tYou can't go out lecturing?  Tough\n\t\tshit.  Women are dying.  Where can\n\t\tI lay this stuff out?\n\n\tShe dumps files of photos, etc., out on Helen's cocktail\n\ttable.\n\n\t\t\t\tHELEN\n\t\tI don't want this.  What are they?\n\n\t\t\t\tRUBEN\n\t\tYou called us, Doctor, if you don't\n\t\twant to look at them here, how\n\t\tabout downtown.  I'll drive you\n\t\tdown...\n\n\tShe pushes the pictures off onto the floor, tries to get up\n\tto leave the room.  M.J. and Ruben are both appalled at the\n\tforce of what is happening: an all-out panic attack...\n\n\tAndy races t o the kitchen; Ruben tries to help but Helen\n\tfights him off viciously, gasping for air... Andy races\n\tback in with a PLASTIC BAG HE PULLS OVER HELEN'S HEAD AND\n\tFACE...  She hyperventilates into the bag...\n\n\tTHE PLASTIC BAG BALLOONS OUT AND BACK IN HELEN'S FACE until\n\tshe faints.  Andy deals with it like an everyday event,\n\ttreating her very gently...\n\n\t\t\t\tANDY\n\t\t\t(to Ruben)\n\t\tNow look what you did.\n\n\t\t\t\tRUBEN\n\t\tWhat did I do?\n\n\t\t\t\tANDY\n\t\tYou threatened to drive her\n\t\tdowntown.  She has agoraphobia.\n\n\t\t\t\tRUBEN\n\t\tFear of what...\n\n\t\t\t\tANDY\n\t\tOpen space.  She hasn't been out of\n\t\tthis apartment in three years.  I\n\t\tdidn't used to think it was real...\n\n\tHe's making her comfortable.\n\n\t\t\t\tM.J.\n\t\tWe'll get the paramedics...\n\n\t\t\t\tANDY\n\t\tOh, God, uniforms, more stress.\n\t\tLet her sleep.  It's a self-limiting:\n\t\tshe hyperventilates till she passes\n\t\tout, then her breathing goes back\n\t\tto normal, and she wakes up singing\n\t\tlike a lark.\n\t\t\t(rocking the\n\t\t\t unconscious Helen)\n\t\tWe know, don't we, Princess?\n\t\t\t(to them)\n\t\tGive her a couple of hours.  I know\n\t\tabout this.\n\n\tM.J. starts to gather up the pictures and files.  She is\n\tangry and disgusted.\n\n\t\t\t\tM.J.\n\t\tTell her we're sorry we bothered\n\t\ther.\n\n\t\t\t\tANDY\n\t\tHey, no.  Leave those here.  If you\n\t\treally want her help.  I mean if\n\t\tyou really do, leave them.  Let her\n\t\tsee them.  I'll see they're safe...\n\n\tM.J. takes in the scene; the now soundly sleeping Helen;\n\tAndy sitting over her protectively, the files and photos\n\tstrewn around.  Makes a decision...\n\n\t\t\t\tM.J.\n\t\tTell her to ask for me...\n\n\tShe's handing Andy her card...\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tEXT. HELEN'S APARTMENT HOUSE - DAY\n\n\tM.J. AND RUBEN come out in the street...  CAMERA IN A HIGH\n\tANGLE LOOKING DOWN ON THEM...\n\n\t\t\t\tM.J.\n\t\tSnotty neurotic bitch...\n\n\t\t\t\tRUBEN\n\t\t\t(amused)\n\t\tClassy madonna.\n\n\t\t\t\tM.J.\n\t\tSure.  She likes you, Rube.  She\n\t\tlikes the way you move.  She sure\n\t\tas hell isn't in love with me.\n\n\t\t\t\tRUBEN\n\t\tYou came in there with this\n\t\tattitude...\n\n\t\t\t\tM.J.\n\t\t\t(over him)\n\t\tOrder Chinese for us and meet me\n\t\tthe library?  Anything but beef.\n\n\tShe jumps in her car, still steaming, leaving Ruben to move\n\tto his car.  AS HE MOVES CAMERA FOLLOWS, BECOMING A WIDER\n\tANGLE TO INCLUDE FACADE OF HELEN'S APARTMENT.\n\n\tWe can SEE ANDY, SITTING WHERE WE LEFT HIM, HOLDING HELEN IN\n\tHIS ARMS.  SHE SLEEPS PEACEFULLY.  DISTANTLY WE HEAR THE\n\tPHONE RING.  ANDY SHOWS IMPATIENCE, THEN CAREFULLY\n\tDISENGAGES FROM HELEN SO AS NOT TO DISTURB HER SLEEP.\n\n\tHE MOVES ACROSS THE ROOM UNTIL HE IS OUT OF FRAME.  THE SHOT\n\tHOLDS ON HELEN FOR A BEAT.  PHONE RINGS.\n\n\tTHEN THE CAMERA PANS LEFT (OUR FIRST CLUE THIS IS ANOTHER\n\tPOINT OF VIEW) ACROSS TO A SECOND WINDOW WHERE IT CATCHES\n\tANDY MOVING UNTIL WE AGAIN DISAPPEARS BEHIND THE BUILDING\n\tWALL AND THE CAMERA PANS SMOOTHLY TO THE THIRD WINDOW, WHERE\n\tANDY ENTERS.  WE SEE HIM PICK UP THE PHONE AND SPEAK INTO\n\tIT.  HE SEEMS IMPATIENT.\n\n\tTHEN CAMERA PANS DOWN TO A CELLULAR PHONE, F.G. AND FOCUS\n\tRACKS TO E.C.U. AS A FINGER PUSHES THE \"END\" BUTTON.\n\n\tCLOSE: ANDY\n\n\tPutting down the phone.  Irritated...\n\n\t\t\t\tANDY\n\t\tShit...\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. POLICE LIBRARY - DAY\n\n\tCLOSE: AN ATTORNEY IN COURT\n\n\t\t\t\tATTORNEY\n\t\t... it was your feeling after\n\t\tcareful evaluation that he was a\n\t\tsexual sadist who satisfied at\n\t\tleast four out of ten criteria in\n\t\tthe DMS III?\n\n\tSHOW M.J. and Ruben watching videotapes, and eating Chinese\n\ttakeout.  HELEN is being interrogated by the ATTORNEY for\n\tDaryll Lee Cullum.  Helen sure of herself to the point of\n\tarrogance, which is her undoing...\n\n\t\t\t\tHELEN\n\t\tYes.  Without question.\n\n\t\t\t\tATTORNEY\n\t\tWithout question?  He only scored\n\t\t40 percent, four out of ten\n\t\tcriteria?  Couldn't another expert\n\t\tsay he flunked the sexual sadist\n\t\ttest?  What curve are you marking\n\t\ton, Doctor?\n\n\t\t\t\tHELEN\n\t\tThe test criteria are only part of\n\t\twhat we look at in evaluating\n\t\tsubjects.\n\n\t\t\t\tATTORNEY\n\t\tOnly part.  What else?  What did\n\t\tyou think of his claim that he tied\n\t\tthis girl to the tree and set fire\n\t\tto her because Joan of Arc told him\n\t\tto do it.\n\n\t\t\t\tHELEN\n\t\tHe was lying.\n\n\t\t\t\tATTORNEY\n\t\t'Lying.  He was lying.'  I asked\n\t\tyou what you thought, not what he\n\t\tdid.\n\n\t\t\t\tHELEN\n\t\tI thought he was lying.\n\n\t\t\t\tATTORNEY\n\t\tYou said, first, he was lying.  How\n\t\tdo you know that, Doctor?\n\n\t\t\t\tHELEN\n\t\tBecause people who are suffering\n\t\tfrom aural hallucinations hear\n\t\tvoices in both ears.  Daryll Lee\n\t\ttold me that Joan of Arc always\n\t\tappeared beside him on his left\n\t\tside and spoke softly in his left\n\t\tear.\n\n\tMurmur of subdued laughter in court.\n\n\t\t\t\tHELEN\n\t\t\t(emboldened)\n\t\tHe took pains to hide his actions\n\t\tbecause he knew they were morally\n\t\twrong.  He was not acting on mad\n\t\timpulse.  He was sane and acting\n\t\tout a pattern he carefully followed\n\t\tevery time.\n\n\t\t\t\tATTORNEY\n\t\t\t(playing causal)\n\t\tWhat pattern was that?\n\n\t\t\t\tHELEN\n\t\tThe same as the first time...\n\n\tShe catches herself.  The D.A. has leapt to his feet, but now\n\ttries to sit down as though nothing was happening, but\n\tHelen, the Attorney and the D.A. all are clearly disturbed\n\tby the line this questioning is taking.\n\n\t\t\t\tATTORNEY\n\t\tThe first what?\n\t\t\t(as she hesitates)\n\t\tYour Honor, she's got this far, I\n\t\tthink she should finish.  I don't\n\t\tthink this jury should be left\n\t\twondering where the rest of her\n\t\tstatement would lead.\n\n\t\t\t\tJUDGE\n\t\tI agree, Doctor.\n\n\t\t\t\tHELEN\n\t\tThe first two murders.\n\n\t\t\t\tATTORNEY\n\t\tWhat first two murders.  We don't\n\t\tknow about them here, do we?\n\n\t\t\t\tHELEN\n\t\t\t(giving up)\n\t\tHe told me he had done two others\n\t\tjust like it.\n\n\t\t\t\tATTORNEY\n\t\tWhen was that?\n\n\t\t\t\tHELEN\n\t\tWhen he was seventeen.\n\n\t\t\t\tATTORNEY\n\t\tAnd you believed him when he told\n\t\tyou he had done that.\n\n\t\t\t\tHELEN\n\t\tYes.  I believed him.\n\n\tThe D.A. is rushing to the bench to argue with the Judge.\n\n\t\t\t\tJUDGE (V.O.)\n\t\tYes, I'll accept a call for a\n\t\tmistrial.  Evidence of that other\n\t\tcrime when the defendant was a\n\t\tjuvenile is inadmissible and never\n\t\tshould have been heard by this\n\t\tjury...\n\n\tFREEZE FRAMES.\n\n\tNOW WE SEE M.J. AND RUBEN LOOKING AT HELEN on the TV screen,\n\tTHINKING...\n\n\tTHE DOOR OPENS AND QUINN ENTERS.\n\n\t\t\t\tQUINN\n\t\tThere was no sperm.\n\n\t\t\t\tM.J.\n\t\tThe same as the firs two.\n\t\tDefinitely a serial.\n\n\t\t\t\tQUINN\n\t\t\t(seeing HELEN on\n\t\t\t video)\n\t\tWhat are you looking at that for?\n\t\tHelen Hudson.  Work the clues.\n\n\t\t\t\tM.J.\n\t\tWhat clues?  I'm going to work\n\t\tHelen Hudson.\n\n\t\t\t\tQUINN\n\t\tWould you step outside, Sergeant?\n\n\tM.J. leaves a cautiously silent RUBEN.  Once the door shuts,\n\the turns tape back to 'play.'\n\n\tEXT. OUTSIDE DOOR TO LIBRARY - DAY\n\n\t\t\t\tQUINN\n\t\tI'm telling you.  Don't you ever\n\t\taddress me publicly in that tone.\n\t\tYou'll work what and who I tell you\n\t\tto work.\n\n\t\t\t\tM.J.\n\t\tAnybody in this department ever\n\t\tworked a serial killer case?  She's\n\t\tthe expert.  I need help.\n\n\t\t\t\tQUINN\n\t\tHow about I put Nikko on it?\n\n\t\t\t\tM.J.\n\t\tThat's always your privilege, sir.\n\n\tQUINN snorts, starts on his way, then turns back.\n\n\t\t\t\tQUINN\n\t\tSergeant?\n\n\t\t\t\tM.J.\n\t\tYessir.\n\n\t\t\t\tQUINN\n\t\tYou ever reflect how this big\n\t\texplosion in dead women coincides\n\t\twith the flowering of women's lib?\n\n\t\t\t\tM.J.\n\t\tYessir.  I have reflected on that,\n\t\tsir.  Which explains my gushing\n\t\tdeference to you, sir.\n\n\tQUINN is somehow cheered by this little exchange.\n\n\t\t\t\tQUINN\n\t\tNikko's looking better by the\n\t\tminute, Inspector.\n\n\tHe stomps off.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. HELEN'S LIVING ROOM - DAY\n\n\tHELEN on couch, ANDY is massaging her neck.\n\n\t\t\t\tHELEN\n\t\tOh, God.  I must have looked\n\t\thorrible.\n\n\t\t\t\tANDY\n\t\tNo, dear.  You're at your best with\n\t\ta bag in front of your face.\n\n\t\t\t\tHELEN\n\t\tI want to die.\n\n\t\t\t\tANDY\n\t\tI wouldn't.  He'll be back.  If you\n\t\twant him.  The cute brutal type\n\t\twith handcuffs.  Very sexy.\n\n\tHELEN grins, and ANDY starts to tickle her, she laughs.\n\n\t\t\t\tANDY\n\t\tYou thought he was cute too, didn't\n\t\tyou?  Admit... admit...\n\n\tHELEN now laughing a little too hard.  Suddenly the laughter\n\tchanges to tears.\n\n\t\t\t\tANDY\n\t\tWhat?  What'd I do?\n\n\t\t\t\tHELEN\n\t\tReminded me that I used to be\n\t\tattractive.  That men used to want\n\t\tme...\n\n\t\t\t\tANDY\n\t\tYou slut!  No sexy young cop for\n\t\tyou unless you shampoo your hair.\n\n\tShe clings desperately to him.  He rocks her as he would a\n\tsmall child.\n\n\t\t\t\tANDY\n\t\tWhen are you going to call them?\n\n\t\t\t\tHELEN\n\t\t\t(big beat)\n\t\tAbout what?\n\n\tANDY PRODUCES THE FILE M.J. LEFT WITH HIM.  Helen looks at\n\tit.  Andy watches her...\n\n\t\t\t\tHELEN\n\t\tI can't, Andy.\n\n\t\t\t\tANDY\n\t\tThen, why don't you just die.  I'm\n\t\tgoing.  They'll find your body\n\t\tyears later, the old recluse lady,\n\t\tshe ate cat food, ten years of the\n\t\tNew York Times, unread, piled on\n\t\ttop of the unread mail, the TV\n\t\tstill on.  Make up your mind.  Live\n\t\tor die.\n\t\t\t(beat)\n\t\tI'll get coffee.\n\n\tHe exits.  After a moment fighting her fears, Helen reaches\n\tfor the file.  She opens it and looks at the first picture.\n\tTHE PHONE RINGS.  She freezes... Panic hangs in the air...\n\tAndy answers the phone in the kitchen...\n\n\t\t\t\tANDY (O.S.)\n\t\tYes?  Inspector Halloran, she's\n\t\tgoing through the material now.\n\t\t\t(beat)\n\t\tShe'll call you... No, she'll be\n\t\talright, I'll sleep over on the\n\t\tcouch in case.  But now, I told\n\t\tyou, singing like a lark.\n\n\tHangs up.  After a moment Helen bends to her work...\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. POLICE LIBRARY - NIGHT\n\n\tM.J. scanning microfilm newspaper & magazine clips.\n\n\t'COOL KILLER CULLUM'\n\tCONS COPS IN ESCAPE FROM CUSTODY\n\n\tSlew police bodyguard in attack on expert witness\n\n\tM.J. hears NIKKO entering, looks up, gives him a half-smile,\n\treturns her attention to the microfilm.\n\n\t\t\t\tNIKKO\n\t\tWorking late.\n\t\t\t(no response)\n\t\tYou're a damn fool.\n\n\t\t\t\tM.J.\n\t\t\t(preoccupied)\n\t\tOh, I know.\n\n\t\"ANOTHER ATTACK!\"\n\t\"HUDSON VICTIM OF BLOODY ATTACK.  BODYGUARD SLAIN!\"\n\n\t\t\t\tNIKKO\n\t\tYou're almost ten years older than\n\t\the is.\n\n\tM.J. turns off the microfilm.  The last headline is retained\n\ton screen:\n\n\t\"ESCAPE KILLER CLAIMS NEW VICTIM\"\n\n\t\t\t\tNIKKO\n\t\tIt's none of my business anymore...\n\n\t\t\t\tM.J.\n\t\tYou got that right, Nikko, it's\n\t\tnone of your business.\n\n\t\t\t\tNIKKO\n\t\tYou're shitting ion your career.  You\n\t\toutrank hi...\n\n\tM.J. looks at him at last with wry amusement: he's jealous \n\tof Ruben?\n\t\n\t\t\t\tM.J.\n\t\tWell, you outranked me, Nikko.\n\n\t\t\t\tNIKKO\n\t\tYeah.  And you used that. Used me\n\n\t\t\t\tM.J.\n\t\tDon't put yourself down like that.\n\t\tI never used you.  I worked my way\n\t\tup like a marine grunt!\n\n\t\t\t\tNIKKO\n\t\tYeah, you did that too.  You earned\n\t\twhat you got; don't shit on it,\n\t\tthat's all I'm saying.\n\n\t\t\t\tM.J.\n\t\t\t(maddeningly)\n\t\tGod, you're cute when you're mad.\n\n\tThe door opens and RUBEN enters, instantly takes in the\n\tscene:  M.J. sitting in front of a stalled machine, NIKKO,\n\tlooming over her.  After an awkward beat, NIKKO heads for\n\tthe door.  Ignoring RUBEN, he barks at M.J.\n\n\t\t\t\tNIKKO\n\t\tThink about it.\n\n\tRUBEN regards M.J., who busies herself examining the other\n\ttapes.\n\n\t\t\t\tRUBEN\n\t\tWhat's wrong with him?\n\n\t\t\t\tM.J.\n\t\tHe's just mad he let me keep the\n\t\tespresso machine.  We heard from\n\t\tDoctor Hudson?\n\n\t\t\t\tRUBEN\n\t\tNada.  Lemme make the call.\n\n\t\t\t\tM.J.\n\t\tHonest to God, Ruben!\n\n\t\t\t\tRUBEN\n\t\tI like women like that!\n\n\t\t\t\tM.J.\n\t\tTell it to your shrink.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tEXT. SAN FRANCISCO RESIDENTIAL AREA - LATE DAY\n\n\tIN THE UNMISTAKABLE STYLE OF THE CAMERA EYE WE HAVE SEEN\n\tSHOOTING HELEN'S PLACE, IN THE PARK, ETC.:  A YOUNG\n\tRED-HEADED WOMAN, wearing shorts and an open-necked shirt,\n\tkneels on the grass, weeding a lush flowerbed.  The CAMERA\n\tSWISHHPANS TO the back door of the house as a man comes out\n\tbalancing a tray with drinks.  The woman gives the man a\n\tdazzling smile, removes her gardening glove and takes a\n\tglass.  Her husband bends down, gives her a little kiss.\n\tShe beams.  FREEZE FRAME.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. HELEN'S LIVING ROOM - LATE DAY\n\n\tCLOSE UP:  early crime scene photos.\n\n\tWE SEE FOR THE FIRST TIME THE FIRST TWO MURDER VICTIMS, SO\n\tWE SEE THE PATTERN HELEN DESCRIBES AND ANALYZES.\n\n\t\t\t\tHELEN (V.O.)\n\t\tThe way he's posed the bodies...\n\t\the's flaunting his power to do\n\t\twhatever he wants to her.  This\n\t\tman... He probably seems perfectly\n\t\tnormal.  These murders are organized\n\t\tand planned.\n\n\tWE ARE NOW SEEING THE ROOM:  M.J. AND RUBEN, HELEN AT A TABLE\n\tIN HER OFFICE LAYING OUT THE PICTURES.  Helen picks out one\n\tpicture from the rest...\n\n\t\t\t\tHELEN\n\t\tExcept for this one.  You put that\n\t\tone in to test me.\n\n\tM.J. nods, pleased with HELEN>\n\n\tINSERT: THE PICTURE.  The victim's body is covered with\n\tbruises.  But, unlike the others, her face has been covered.\n\n\t\t\t\tHELEN (V.O.)\n\t\tIs it an ongoing case?\n\n\tBACK TO SCENE...\n\n\t\t\t\tM.J.\n\t\t\t(nods)\n\t\tFor months... last October.\n\n\t\t\t\tHELEN\n\t\tIt was a lover or a husband.\n\t\tSomeone close.  Somebody who knew\n\t\ther and cared about her.\n\n\t\t\t\tM.J.\n\t\t\t(glancing at Ruben)\n\t\tHow do you know that?\n\n\t\t\t\tHELEN\n\t\tHe felt remorse.  He covered her.\n\n\tHELEN arranges and rearranges photos like tarot cards.\n\n\t\t\t\tHELEN\n\t\tThe bodies have been carefully\n\t\tarranged... different positions,\n\t\tbut somehow the same.  The\n\t\tpositions are brutal... yet\n\t\tquite... artful.  It's like... a\n\t\tsignature.  He's proud of his\n\t\taccomplishments.  There are early\n\t\tPicassos and late Picassos, but you\n\t\talways recognize the hand.  He\n\t\twants us to recognize his hand.\n\t\tI've seen this hand before... what\n\t\tare you hiding?\n\n\t\t\t\tM.J.\n\t\t\t(taken aback)\n\t\tNothing.\n\n\t\t\t\tHELEN\n\t\tWhere are the stockings he\n\t\tstrangled them with?\n\n\t\t\t\tM.J.\n\t\tHow did you know they were\n\t\tstockings?\n\n\t\t\t\tHELEN\n\t\t\t(sarcastic)\n\t\tI sent Andy out on murder missions.\n\t\tFor God's sake -- it's the Boston\n\t\tStrangler, Alber deSalvo.  He used\n\t\ttheir own stockings to strangle\n\t\tthem.  Tied in a bow-knot.\n\n\tShe gets down a file from her bookcase and flops it open to\n\tpictures of deSalvo's victims:  they are identical...\n\n\t\t\t\tHELEN\n\t\tSomebody is imitating his m.o.\n\t\tLook for a plumber or carpenter or\n\t\thandyman; that's how deSalvo got in\n\t\tthe door and caught them off guard.\n\n\t\t\t\tRUBEN\n\t\tThe Boston Strangler, when was\n\t\tthat...?\n\n\t\t\t\tHELEN\n\t\tIn the sixties.  He's dead --\n\t\tstabbed to death in prison.\n\n\t\t\t\tM.J.\n\t\tWhy imitate a dead serial killer?\n\n\t\t\t\tHELEN\n\t\tIf you knew why, you might know\n\t\twhere to look for him.\n\t\tI don't envy you this; he's not\n\t\tdone -- he's going to do them faster\n\t\tand faster to keep the adrenaline\n\t\trush.  Now, I've done what you \n\t\tasked me.\n\n\t\t\t\tM.J.\n\t\tWork with me.\n\n\t\t\t\tANDY (O.S.)\n\t\tIt's good for you.\n\n\tThey are startled by his appearance!  A little unsettling.\n\n\t\t\t\tANDY\n\t\tIt's good medicine.\n\n\t\t\t\tRUBEN\n\t\tA little homeopathic cure for the\n\t\twillies.\n\n\t\t\t\tHELEN\n\t\t\t(exhausted)\n\t\tNone of you know anything about it.\n\t\tNow go.  And Andy, if you persist\n\t\tin playing doctor, leave, with\n\t\tthem.\n\n\t\t\t\tANDY\n\t\tI'm the only friend you've got,\n\t\tdarling, and I don't intend to stop\n\t\tdoing what I think is good for us.\n\n\t\t\t\tHELEN\n\t\tGet out!  All of you!\n\n\tAndy helps M.J. and Ruben scoop up the files...\n\n\t\t\t\tRUBEN\n\t\tYou said you don't give a fuck and\n\t\tthat's the beauty of a breakdown?\n\t\tThis doesn't look like not giving a\n\t\tfuck, you know that?\n\n\t\t\t\tM.J.\n\t\tLet's get out of here...\n\n\tINT. HALL - CONTINUOUS\n\n\tAs they leave, Andy is still at the door...\n\n\t\t\t\tHELEN (V.O.)\n\t\t\t(small voice)\n\t\tAndy!  Please.  Don't you go!\n\n\tINT. QUINN'S OFFICE - NIGHT\n\n\t\t\t\tQUINN\n\t\tAw, Jesus.  The Mouth gets a load\n\t\tof this and we got major headlines\n\t\taround the world.  deSalvo redux.\n\t\tThe matter, you think they don't\n\t\tteach Latin in Catholic schools?\n\n\t\t\t\tM.J.\n\t\tDon't swear at me because we got\n\t\tproblems.  I'm just giving you the\n\t\tnews.  I went to a Catholic school;\n\t\tI'll tell you what they teach.  On\n\t\tthe knuckles they teach.\n\n\t\t\t\tQUINN\n\t\tWho've I got to beat up except the\n\t\tmessenger?  Does this give us\n\t\tanything to go on?\n\n\t\t\t\tM.J.\n\t\tI'm checking out anybody who lives\n\t\tlike DeSalvo.  Records of arrests\n\t\tfor rape, especially by a man\n\t\twearing green.  Checking out\n\t\tpsychiatric hospitals for his\n\t\tpersonality profile.  Cross check-\n\t\ting names from arrests for sexual\n\t\toffenses, public fondling.  If\n\t\tthey've got a German wife.  We can\n\t\tkeep cops working on this kind of\n\t\tjunk for years, and this guy's\n\t\tgoing to hit again, soon.\n\n\t\t\t\tQUINN\n\t\t\t(morose)\n\t\tI know.  Get out here.\n\n\t\t\t\tM.J.\n\t\tSo.  Do we tell the media and hope\n\t\tfor somebody to come forward with\n\t\tinformation?\n\n\t\t\t\tQUINN\n\t\tOr for some new nutcase to copycat\n\t\tthe copycat.\n\n\t\t\t\tRUBEN\n\t\tWhat I love, the big fight, some\n\t\tgirl, she drops the quarter on her\n\t\tboyfriend so the bastard spends the\n\t\tnight in custody, just to teach him\n\t\ta lesson.  We'll get a shitload of\n\t\tthose.\n\n\t\t\t\tQUINN\n\t\tAnother country heard from.\n\t\t\t(deciding)\n\t\tNo.  We're keeping it quiet, don't\n\t\tgive the bastard the attention he's\n\t\tmaybe begging for.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. HELEN'S APARTMENT - NIGHT\n\n\tHELEN sits at side-by-side computers.  The chess game is\n\tagain in progress.\n\n\tHELEN makes a move.  Pleased with herself, she smiles,\n\ttypes, \"I'm creaming you.\"\n\n\tSuddenly over HELEN'S shoulder, the other screen becomes\n\tactive, we see 'Message for Helen Hudson.'\n\n\tEngrossed in her own chess game, she does not notice the\n\tscreen until, tense from sitting too long, with waiting for\n\tCHESSMASTER'S move, HELEN begins to stretch her neck and\n\ttoll her head.  Now, out of the corner of her eye, she sees\n\tthe other screen.  Quickly, she clicks on this, and the\n\tscreen prints out 'A GAME FOR DR. HUDSON PLEASE RUN THIS\n\t\"TOMORROW.AVI\" FILE ON YOUR PLAYER.'\n\n\tHELEN TYPES 'WIN' AND WINDOWS SCREEN COMES UP.  WITH THE\n\tMOUSE SHE CLICKS ON THE AVI PLAYER ICON, TYPES IN\n\t\"TOMORROW.AVI\" AND HITS ENTER.\n\n\tA PICTURE APPEARS: IT IS THE FACE OF THE WOMAN IN THE\n\tBATHTUB.  IT CHANGES AFTER A TENTH OF A SECOND MORPHING\n\tTHROUGH A COLLAGE OF IMAGES OF TWO WOMEN.  A hand emerges\n\tfrom a breast of the other.  Two heads.  One, properly on\n\tits own neck, the other emerging from between two legs.\n\tHands, feet, breasts, hair of two bodies mixed mischievously\n\tinto one FINAL IMAGE OF A SECOND WOMAN ALIVE AND SMILING\n\tECSTATICALLY AT THE CAMERA.  Both women wear their hair in\n\tlong braids.\n\n\tINTERCUT WITH HELEN: APPALLED.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tANDY LIES WITH TV ON, NAKED, GIVING HIMSELF A PEDICURE.  HE\n\tHAS EARPHONES TO MUFFLE THE TV SOUND.  From the dark spaces\n\tof the loft there\n\n\tECHOES A SCREAM OF SHEER TERROR FROM HELEN!  After a beat from he\n\trealizes, tears off the earphones and bolts into the\n\tdarkness...\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tEXT. HELEN'S APARTMENT HOUSE - NIGHT\n\n\tPOLICE CARS DRAW UP IN FRONT, DOUBLE PARKING.  M.J. and Ruben\n\tjump out and walk, fast, toward the building... (Shot from\n\tsame high angle -- the secret watcher's POV -- from which we\n\tsaw M.J. and Ruben leave after their first visit.)\n\n\tINT. HELEN'S HALLWAY\n\n\tAS HER DOOR IS OPENED, by Andy.  Ruben and M.J. enter...\n\n\t\t\t\tANDY\n\t\tShe's in the office...\n\n\tINT. HELEN'S OFFICE\n\n\tThe computer glow, the unfinished chess game still up, and\n\tthe RED-HEADED WOMAN'S joyful face on the other.  HELEN SITS\n\tIN A CHAIR WITH HER BACK TO THE SCREEN, ROCKING BACK AND\n\tFORTH, suppressing her fear by sheer will.  M.J. and Ruben\n\tenter with Andy...  they look at the face on the computer\n\tscreen... (this is the only light in the room).\n\n\t\t\t\tHELEN\n\t\tThat's the face of the next one\n\t\the'll kill.\n\n\tShe hasn't looked at them or the computer... SHE ROCKS...\n\n\t\t\t\tM.J.\n\t\tHow do you know that?\n\n\t\t\t\tHELEN\n\t\t\t(can't look at it)\n\t\tLook at the bottom of the screen.\n\t\tYou see the icon with the arrow\n\t\tpointing left?  Click on that...\n\t\ttwice.\n\n\tRUBEN (FROM A MISSPENT YOUTH IN VIDEO ARCADES) expertly\n\tmaneuvers the mouse and clicks on the icon as instructed.\n\tNOW THE ANIMATED COLLAGE PLAYS BACKWARD!  IN TENTH OF A\n\tSECOND STEPS WE SEE THE IMAGE OF THE RED-HEADED WOMAN MERGE\n\tBACKWARD THROUGH THE DISTORTED IMAGES AND BECOME\n\n\tTHE DEAD WOMAN IN THE BATHTUB.\n\n\tM.J. AND RUBEN REACTING, LIGHTED BY THE GLOW FROM THE SCREEN.\n\n\t\t\t\tM.J.\n\t\tHow did you do that?\n\n\t\t\t\tHELEN\n\t\tThat computer's wired into\n\t\tINTERNET.\n\n\t\t\t\tRUBEN\n\t\tHe's hacked into her Internet\n\t\taddress.  He's a hacker.\n\n\t\t\t\tHELEN\n\t\t\t(rocking, rocking)\n\t\tHe can get into my computer any\n\t\ttime he likes!  This is exactly the\n\t\tkind of thing I didn't want to have\n\t\thappen.\n\n\t\t\t\tM.J.\n\t\tCan you make a copy we can show on\n\t\tour computers?\n\n\t\t\t\tHELEN\n\t\tIt's too big a file to copy to a\n\t\tdisk.\n\n\t\t\t\tRUBEN\n\t\tYou got a tape backup, yeah, here\n\t\tlemme copy it on tape...\n\n\t\t\t\tM.J.\n\t\tWhy would he send this to Helen\n\t\tHudson...\n\n\t\t\t\tHELEN\n\t\tIt's a game they like to play.\n\t\tBerkowitz -- \"Son of Sam\" -- hung\n\t\taround the crime scene, talking to\n\t\tthe cops.  This one's probably\n\t\twatching you, laughing at you.\n\n\t\t\t\tRUBEN\n\t\tLet me get a little action started\n\t\there.\n\n\tM.J. nods to him to get along... He calls on his cellular\n\tphone while simultaneously working the computer...\n\n\t\t\t\tM.J.\n\t\tI'm going to put a guard on your\n\t\tdoor.\n\n\t\t\t\tHELEN\n\t\tOne officer already got killed\n\t\ttrying to protect me.  Please, just\n\t\ttake it all away.  Leave me alone.\n\n\t\t\t\tM.J.\n\t\tHe won't.\n\n\t\t\t\tRUBEN\n\t\tLook at this...\n\n\tTHE COMPUTER SCREEN HAS A LEGEND ON IT:\n\tNOW YOU SEE ME...\n\n\tAs they watch, it is replaced by:\n\n\tNOW YOU DON'T...\n\n\tAND THEN IT FADES TO BLACK...  Helen goes to the machine and\n\tmaneuvers with mouse and keyboard.\n\n\t\t\t\tHELEN\n\t\tIt's gone.  The file's not here.\n\t\t\t(to Ruben)\n\t\tWhat did you do?\n\n\t\t\t\tRUBEN\n\t\tI just started it copying to tape,\n\t\tbut the tape never ran.  It just\n\t\tdid that...\n\n\t\t\t\tHELEN\n\t\t\t(respect)\n\t\tHe's brilliant.  This one is\n\t\tbrilliant.\n\n\t\t\t\tM.J.\n\t\tWe'll show that to...\n\n\t\t\t\tHELEN\n\t\tShow what?  It's gone.  He wrote a\n\t\tself destruct virus into the code,\n\t\tso it would only play until we try\n\t\tto copy it.  Then it erased itself.\n\t\tGone...\n\t\t\t(beat)\n\t\tDo you remember what you saw?\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. POLICE HQ CORRIDOR - DAY\n\n\tM.J., RUBEN, QUINN, MAYBE OTHERS OF HIS STAFF STRIDE\n\tPURPOSEFULLY DOWN THE CORRIDOR, CAMERA MOVING WITH THEM...\n\tFor a moment we won't know who Quinn is talking about...\n\n\t\t\t\tQUINN\n\t\tHe's on the phone calling me like an\n\t\tinsurance salesman soliciting my\n\t\tbusiness, for Christ's sake.  I\n\t\tdidn't tell him the three most\n\t\tover-rated things in life are young\n\t\tpussy, regular exercise and the\n\t\tF.B.I.\n\n\t\t\t\tM.J.\n\t\tOh, maaaaan?!\n\n\t\t\t\tQUINN\n\t\tWhat?  I talk like a cop, this is\n\t\tthe way I talk.  I can't believe\n\t\tthis guy.  Saks.  He's a Deputy\n\t\tAssistant Director of the F.B.I.\n\t\t\"Let me help you!\"\n\n\t\t\t\tM.J.\n\t\tWe could use a little help.\n\n\t\t\t\tQUINN\n\t\tWith the F.B.I. there's no such\n\t\tthing as a little help.  They bury\n\t\tyou with help.  Explain to me about\n\t\tthis virus, no don't tell me about\n\t\tthe virus.  Thing is, you saw it,\n\t\tthe pictures.\n\n\tThey pass through a door into a ROOM where the homicide team\n\tsit waiting... M.J. goes right into a briefing...\n\n\t\t\t\tM.J.\n\t\tWe saw it.  The unknown target is\n\t\tkneeling, she's gardening.  Red\n\t\thair, high cheekbones, mid-\n\t\tthirties, height I don't know,\n\t\tshe's not overweight, she's\n\t\tzofting... She's in front of a\n\t\thouse that looks like...\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tEXT. MARINA HOUSE - LATE DAY\n\n\tAs she is speaking, her description becomes V.O. as we SEE\n\tpolice cars and an ambulance drawn up IN FRONT OF THE HOUSE\n\tSHE IS DESCRIBING...\n\n\t\t\t\tM.J. (V.O.)\n\t\t... the Marina area, there was\n\t\tearthquake damage repair on the\n\t\thouse it looked like, a little\n\t\tgarden.  The light was late\n\t\tafternoon.  Say about cocktail\n\t\thour.  He was bringing out drinks,\n\t\tmargaritas by the look.  So we got\n\t\ta house facing west, on the east\n\t\tside of the street.  Full sun, so\n\t\tthere's no high trees or buildings,\n\t\tresidential both sides.\n\n\tSUSAN SCHIFFER and her crew arrive, leaping out of their van\n\twith their equipment, a makeup woman ADJUSTING SUSAN'S\n\tMAKEUP AND HAIR RIGHT THERE IN THE STREET...\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. MARINA HOUSE - DAY\n\n\tM.J. and Ruben, Quinn, etc., trying to calm and/or question\n\tthe HUSBAND, who is in shock.  He is the man we saw bringing\n\tdrinks.\n\n\t\t\t\tHUSBAND\n\t\tStupid goddam s-stupid p-poker\n\t\tgame!  Always have to s-stay until\n\t\tPhil makes a c...comeback.  Am I\n\t\tstuttering?\n\n\tThe husband's voice follows QUINN and others as another COP\n\tleads them toward the back of house.\n\n\tDOOR TO BEDROOM.  QUINN AND RUBEN have stopped just inside\n\tdoor.  M.J. forced to peer around them.\n\n\tM.J.'S POV: On the bed, the RED-HEADED WOMAN'S body is\n\tpropped up against the headboard, her knees up, her head\n\tfallen onto a shoulder: her pajama top has been ripped open\n\tand pushed up.  Knotted around her neck is a pink scarf tied\n\tin a huge bow under her chin.  On her feet, secured between\n\ther toes, is a commercial flyer advertising the Festival of\n\tLove.  It is brightly printed with red hearts.  It has been\n\thand-lettered:\n\n\tHELL IN THE FESTIVAL OF LOVE\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tEXT. FESTIVAL OF LOVE IN GOLDEN STATE PARK - NIGHT\n\n\tCAMCORDER capturing the audience of a ROCK CONCERT in full\n\tblast, in GOLDEN GATE PARK.  The audience, mostly young,\n\tsome in 70's costume, sit and loll around on blankets.  Most\n\tseem to have some variety of refreshment... liquid or rolled.\n\tThe CAMERA records the unsteady progress of a lovely YOUNG\n\tGIRL, weaving her way through the blankets and the bodies.\n\tShe suddenly becomes aware of the camera being aimed at her.\n\tShe stops, strikes a comically seductive pose and gives a\n\tbig, gorgeous smile.  FREEZE FRAME.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. HELEN'S APARTMENT - NIGHT\n\n\tANDY answers the door.  M.J. and Ruben...\n\n\t\t\t\tANDY\n\t\tShe just got to sleep.  Do you have\n\t\tto tell her about it now?\n\n\t\t\t\tM.J.\n\t\tTell her about what?\n\n\t\t\t\tANDY\n\t\t\t(mock admiration)\n\t\tGaahhd!  What a cop!  You busted\n\t\tme!\n\t\t\t(real)\n\t\tThe new one, in the Marina.\n\t\t\t(to their reaction)\n\t\tShe has a police radio scanner.\n\t\tIt's always on.  She turns it off,\n\t\tand then she has to turn it on\n\t\tagain.  She's obsessed.  She can't\n\t\tnot listen to it, but she can't\n\t\tlisten to it, so she makes me\n\t\tlisten to it.\n\n\tHELEN APPEARS IN WHATEVER SHE SLEEPS IN.\n\n\t\t\t\tHELEN\n\t\tI am not going to look at any more\n\t\tpictures.  They're like a disease.\n\t\tThey get into my head.  I can't get\n\t\tthem out.\n\n\t\t\t\tM.J.\n\t\tI don't look at pictures.  I look\n\t\tat the real thing.  I don't feel\n\t\tinfected.\n\n\t\t\t\tHELEN\n\t\tMaybe that's why you can't catch\n\t\thim.  I know what she looks like --\n\t\tthe red-headed woman in my\n\t\tcomputer.\n\n\t\t\t\tM.J.\n\t\tI just came from her... here's what\n\t\tyou haven't seen.\n\n\tM.J. takes out a picture of the dead RED-HEADED WOMAN.  Her\n\tmanner is that of cop with a witness.\n\n\t\t\t\tM.J. (cont'd)\n\t\tA forgery of the Mary Sullivan\n\t\tmurder scene, he's done it perfect.\n\t\tExcept for the sign.\n\n\t\t\t\tHELEN\n\t\t\t(looking at photo)\n\t\tShe probably let him in the door\n\t\twithout a thought.  Where are their\n\t\tmothers?!  Where are the mothers\n\t\tthat are supposed to teach them to\n\t\tbe wary and to tough and not afraid\n\t\tto fight?\n\n\t\t\t\tM.J.\n\t\tLook at the sign.  'Hell'?  In the\n\t\tFestival of Love?  You make any\n\t\tsense in that?\n\n\tHELEN stares at the picture.\n\n\t\t\t\tM.J. (cont'd)\n\t\tFor 'Hell', read 'Helen'.  He's\n\t\ttalking to you.\n\n\t\t\t\tHELEN\n\t\tIt's anybody connected to author-\n\t\tity.  They write, they even knock\n\t\ton your door.  They're fans.  It\n\t\tthrills them to flirt with getting\n\t\tcaught.\n\n\t\t\t\tM.J.\n\t\tNobody knows you have anything to\n\t\tdo with this case; nothing has been\n\t\ton TV or the news... Why would he\n\t\twant to get in your computer?\n\n\t\t\t\tHELEN\n\t\tBecause I'm his damned pin-up girl!\n\t\tHis, all of them!  They know me.\n\t\tThey're in prisons with libraries,\n\t\tthey collect clippings, I'm their\n\t\tworthy opponent.  You keep my name\n\t\tout of this.\n\n\t\t\t\tRUBEN\n\t\tAbsolutely.\n\n\t\t\t\tM.J.\n\t\tMy promise.\n\n\tAndy, who has ducked out, now reappears, dressed for a date.\n\n\t\t\t\tANDY\n\t\tThe moon is up, my night to howl.\n\t\tWill you be okay?\n\n\t\t\t\tHELEN\n\t\tOh, God, I forget.  Yes.  Yes.  You\n\t\tgo.  Poor thing, you ought to get\n\t\tout.\n\n\t\t\t\tANDY\n\t\t\t(to M.J.)\n\t\tLook out for her.  She's tougher\n\t\tthan you think.\n\n\tHe goes...\n\n\t\t\t\tHELEN\n\t\tI know 'Halloran.'  What's the rest\n\t\tof it?\n\n\t\t\t\tRUBEN\n\t\tMaryJane.  We call her M.J.\n\n\t\t\t\tHELEN\n\t\tMaryJane.  You think that logic and\n\t\tpolice procedure, order and science\n\t\tand method will hold back the\n\t\thorrors of a world gone mad and the\n\t\tsickness of the night.  I did once.\n\t\tBut you know how he'll get caught?\n\t\tHe'll have an accident, or some cop\n\t\twill get lucky.  You can't catch\n\t\thim by being intelligent and\n\t\tworking hard.  Or the worst:  there\n\t\tare dozens of women slaughtered in\n\t\tthe most horrible way, month after\n\t\tmonth.  The news stories grow more\n\t\tgrotesque and bizarre and in the\n\t\tcity people lock their doors and\n\t\twindows, and hurry home before\n\t\tdark.  And then, one day, there are\n\t\tno more.  What happened?  Did he\n\t\tjust stop?  Get tired and disgusted\n\t\tand decide not to kill any more?\n\t\tDid he kill himself?  Did he die in\n\t\tan auto accident?  Or a fight.  Or\n\t\tget sick and die?  It's like the\n\t\tmurderer walked off the edge of the\n\t\tearth.  And you never know.  But\n\t\tyou keep asking yourself -- when you\n\t\tread about a new murder -- is he\n\t\tback?\n\n\tM.J. stands.  She has noted Ruben's reaction to Helen's\n\tstory.  There is an edge of sarcasm in her voice...\n\n\t\t\t\tM.J.\n\t\tThat's amazing.  A whole new book,\n\t\tthought up in a minute.  Very good.\n\t\t\t(beat)\n\t\tAll I know how t do is get up,\n\t\ttake a shower, and go to work.\n\t\tHope, if he does another I'll nail\n\t\tthe son of bitch, and they'll spell\n\t\tmy name right in the newspaper.\n\t\tWhere is Andy going?\n\n\t\t\t\tHELEN\n\t\tHe's going home.  He slept over\n\t\tbecause I was a little anxious...\n\n\t\t\t\tM.J.\n\t\tI want a guard on you.  I'm worried\n\t\tabout leaving you alone.\n\n\t\t\t\tRUBEN\n\t\t\t(to M.J.)\n\t\tWe're through for the night, aren't\n\t\twe?  You go on.  Get some sleep.\n\t\tI'll stay until we can get a man\n\t\tout here and maybe catch a cab\n\t\thome.\n\n\t\t\t\tHELEN\n\t\tThat would be much appreciated.\n\t\tThanks.\n\n\t\t\t\tM.J.\n\t\t\t(to Helen)\n\t\tSomewhere down the line we're doing\n\t\tto find a connection between him\n\t\tand you.  I want you to worry that\n\t\tidea like a loose tooth.\n\n\tThree voices chime self-conscious 'Good-nights.'\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tEXT. HELEN'S BUILDING - NIGHT\n\n\tTHE SILENT WATCHER'S POV through the eye of the\n\tCAMCORDER, we catch M.J. exit HELEN'S building.  She stops\n\tmomentarily on the sidewalk to look up at Helen's window...\n\tThe drapes swing open.  RUBEN CAN BE SEEN DOING SOMETHING AT\n\tTHE WINDOWS... The Camcorder zooms to a close-up of M.J.\n\tShe gets into her car and speeds off.\n\n\tINT. HELEN'S BEDROOM - CONTINUOUS\n\n\tRuben is checking the windows...\n\n\t\t\t\tRUBEN\n\t\tYou ought to get some decent locks\n\t\ton these.  A six-year-old could get\n\t\tin here.  Much less a motivated\n\t\tman.\n\n\tAt the phrase 'motivated man', HELEN looks at him boldly in the\n\teye.\n  \t\t\t\tHELEN\n\t\tYou and MaryJane aren't lovers.\n\n\t\t\t\tRUBEN\n\t\tNot yet.\n\n\tHELEN laughs.  So does RUBEN.  Her boldness, her laughter,\n\tattracts him.  His honesty attracts HELEN.  He feels the\n\theat.\n\n\t\t\t\tHELEN\n\t\tAre you always so bold?\n\n\t\t\t\tRUBEN\n\t\tNo.  I'm shy and I'm selective.\n\n\tHis grin says he'd select her anytime...\n\n\t\t\t\tRUBEN\n\t\tThe problem for me is... you're in\n\t\tthe witness category.\n\t\t\t(beat -- Jack\n\t\t\t Nicholson)\n\t\tKnow what I mean?\n\n\t\t\t\tHELEN\n\t\tWell.  Another time, then.\n\t\t\t(beat)\n\t\tI'll be all right.  He's not going\n\t\tto attack me; what I' m rally\n\t\tafraid of is all in my own head,\n\t\tRuben.\n\n\tThey smile ruefully at one another, and without further\n\tconversation, leave the bedroom.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. HELEN'S FRONT DOOR - NIGHT\n\n\tRUBEN is outside the door.  HELEN just inside.\n\n\t\t\t\tRUBEN\n\t\tThey'll have a guard here tomorrow.\n\t\tI know you have the idea, but it'll\n\t\tmake me feel a lot better.\n\n\tShe smiles, and RUBEN turns, walks away.  She stays in the\n\tdoorway watching his retreat.  About ten feet away, he\n\tsuddenly stops.\n\n\t\t\t\tRUBEN\n\t\tHey!\n\n\tHe turns around, she is still in the doorway.  He reaches\n\tfor his wallet, withdraws a card, holds it up to her.\n\n\t\t\t\tRUBEN\n\t\tThe number for my cellular.\n\n\t\t\t\tRUBEN\n\t\tDon't hesitate.  Anytime.  Night or\n\t\tday.  I mean that.\n\n\tHe hods card out to her.  HELEN, holding onto the door\n\tframe, doesn't move.  RUBEN continues to extend his hand\n\twith the card in it.  It is a charged moment.  She is frozen\n\tin the doorway; RUBEN refuses to make a move towards her.\n\tHELEN summons all her nerve and lets go of the door frame,\n\tdetermined not to have any further mortification this night,\n\tshe takes one shaky step out into the hallway to meet him.\n\tThen a second step and a third.\n\n\tHer hand touches the card, takes it.\n\n\tShe turns her head to gauge the distance she must retreat.\n\tWhat she sees is that the door's Sureclose device has\n\tquietly and efficiently closed.  The door is locked.\n\tFrantic, she turns back toward RUBEN.\n\n\tHER POV:\n\n\tRUBEN, now seems a vast distance away from her.  He is just\n\tturning down the stairs and is gone... The hallway first\n\tnarrows, squeezing her in, then expands.  She is lost in the\n\tmiles and miles of space between the two walls.\n\n\t\t\t\tHELEN\n\t\tOh, God!  Help me!\n\n\tRUBEN reappears, races toward her...\n\n\t\t\t\tRUBEN\n\t\tTell me what to do!\n\n\t\t\t\tHELEN\n\t\tI'm falling!  I'm going to fall!\n\n\tShe starts to pass out, to sink to her knees, but RUBEN\n\tcatches her, puts her up against the wall, handling her like\n\ta suspect.  He puts one hand on the back of her neck,\n\tspreads her legs, gets her in frisk position.  Somehow, this\n\tis comforting to her, but she is still in full-blown\n\tpanic...\n\n\t\t\t\tHELEN\n\t\t...falling... FALLING!\n\n\tHe pressed his body up against hers, his weight anchoring\n\ther against the feeling of free-fall.\n\n\t\t\t\tRUBEN\n\t\tI'm right here.  I won't let you\n\t\tfall.\n\n\tHe still has a hand on the back of her neck.  Suddenly, the\n\tproximity effects him, makes him want to kiss her neck.  She\n\tbegins to hyperventilate.\n\n\t\t\t\tHELEN\n\t\tDon't let go... I can't breathe...\n\t\tI'll die!\n\n\t\t\t\tRUBEN\n\t\tShhh.  It's okay.  Just breathe.\n\t\tI'll fix it...\n\n\tRUBEN takes out his gun...\n\n\t\t\t\tRUBEN\n\t\tPut your hands over your ears.\n\n\tRUBEN shoots off the lock.  Then he picks HELEN up and\n\tcarries her back into her apartment.\n\n\tINT. HELEN'S LIVING ROOM - CONTINUOUS\n\n\tRUBEN enters and puts HELEN down on the couch, pulls a throw\n\tup over her.  He sees her Xanax bottle on a table, hands it\n\tto her.  She takes out three as he pours her some seltzer\n\twater, then watches her take the pills.  After which he\n\ttakes the bottle and pockets it.\n\n\t\t\t\tHELEN\n\t\tThe lock...\n\n\t\t\t\tRUBEN\n\t\tI'll get a locksmith.\n\n\t\t\t\tHELEN\n\t\tWill you stay?  Please?  I'm afraid\n\t\tto sleep... I don't want...him...in\n\t\tmy head...\n\n\tRUBEN pulls a big chair up beside the sofa.  As her eyes\n\tclose, RUBEN comforts her.  TV features the antics of a\n\tnervous little prairie dog family.  He looks back at HELEN.\n\n\tCLOSE UP HELEN:\n\n\tWe hear a faint but impatient voice call:\n\n\t\t\t\tV.O.\n\t\tPeter... Peter...\n\n\t\t\t\t\t\t\tCROSS FADE TO:\n\n\tINT. BEDROOM (DALY CITY) - NIGHT\n\n\tDim light.  The room is unattractive, over-furnished but not\n\tcomfortably.  A WOMAN is sitting propped up in a double bed.\n\tShe is in her mid-thirties, but drained and pale, she looks\n\tolder.  A chronic invalid.  By her side is a NASTY LITTLE\n\tDOG, with ribbon bows in its fur.  Near the bed is a TV and\n\tvideo, on which a movie's final credits are running.\n\n\tTHE WOMAN IS IMPATIENTLY PUSHING AN INTERCOM BUTTON\n\n\tPETER enters.  Younger than the woman, rather good-looking.\n\tBoyish and nondescript except for a patch of white skin near\n\this hairline.  AN OLD SCAR.  He goes straight to TV and puts\n\tthe tape on 'eject.'\n\n\t\t\t\tWOMAN\n\t\tPut in the Kevin Costner.\n\n\t\t\t\tPETER\n\t\tWhy don't we save it for later?\n\t\tIt's almost time for Letterman.\n\n\t\t\t\tWOMAN\n\t\tYou know I don't like to watch talk\n\t\tshows by myself.  Where're you?\n\n\tHe inserts the video she wants and pushes 'play.'  Then he\n\tapproaches the bed, leans over his wife and gently pushes a\n\tlock of hair back from the forehead.\n\n\tShe ignores him, staring at the screen.  The NASTY LITTLE\n\tDOG BARES ITS TEETH AND SNAPS AT HIM.\n\n\t\t\t\tWOMAN\n\t\tSee, now you've annoyed her.  You\n\t\tknow she doesn't like you to touch\n\t\tme.\n\t\t\t(to dog)\n\t\tDoes she, widdle wee fing!  Wuhve\n\t\tyou so much!\n\t\t\t(to Peter)\n\t\tDid you feed her?\n\n\t\t\t\tPETER\n\t\tYes, I fed her.  If she says she's\n\t\thungry, she's lying to you.  Again.\n\n\t\t\t\tWOMAN\n\t\tShe doesn't lie!  You sure you fed\n\t\ther?\n\n\t\t\t\tPETER\n\t\tShe lies all the time.  Why would I\n\t\tsay I fed her if I didn't?\n\n\t\t\t\tWOMAN\n\t\tThat's what I don't know.  Why\n\t\twould you lie?  That's the\n\t\tproblem... I can't understand why\n\t\tanyone would lie.\n\n\tHe leaves.  As he goes we can hear the Woman still talking\n\tto her dog over the TV soundtrack.\n\n\t\t\t\tWOMAN (cont'd)\n\t\tYou wouldn't lie to Mummy, would\n\t\tyou?  Just to get Dad in trouble?\n\t\tSuch a naughty widdle dog...\n\n\tHER VOICE FADES AWAY AS WE FOLLOW HIM down the stairs into a\n\tsmall, ill-lit and dreary living room, into a messy kitchen,\n\tthen through a door leading to the basement.  He locks the\n\tbasement door behind him.\n\n\tTHE BASEMENT is brightly lighted, full of high tech, gadgets\n\tand computers.  As he approaches the bottom stair, we see a\n\tsmall TV/video set attached to a wall.  On its screen,\n\tfreeze-framed and silent, is a video of a PRETTY GIRL at an\n\toutdoor rock concert, smiling seductively.\n\n\tPETER puts on a WHITE LAB COAT and then reaches over\n\tsomething to turn the video back on.\n\n\tThe CAMERA PANS DOWN to what he has leaned across.  It is\n\tthe YOUNG GIRL from the concert.  She is strapped onto a\n\ttable, her mouth taped shut.  A plastic bag covers her head,\n\tbut not tightly.  She is semiconscious.  She is being\n\tasphyxiated by slow degrees.\n\n\tPETER looks at her, gently pushes the bag up far enough to\n\trepeat the tender gesture with her damp hair that he made\n\ttoward his wife.  He whispers:\n\n\t\t\t\tPETER\n\t\tDidn't I promise I'd come right\n\t\tback?\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tEXT. HILLSIDE - DAWN\n\n\tALL NIGHT FESTIVAL REVELLERS dance across the skyline, of\n\tglorious misty green hills, hand in hand.  The Camera moves\n\tdown, across verdant meadows, until we arrive at the bottom\n\tof the nearest hill which slopes finally to a highway.  A\n\tfew festival up-all-night REVELERS, looking down at a new\n\tCRIME SCENE, where three blue-and-whites are parked, plus a\n\tnumber of unmarked cars.\n\n\tRUBEN ARRIVES IN A TAXI.\n\n\tAs he moves past the ever-present SUSAN we THREAD THROUGH\n\tTHE SCENE TO FIND M.J.  M.J. takes one look at RUBEN'S\n\tstubble, his yesterday's slept-in clothes, and she turns\n\taway.  Before RUBEN can catch up with her, NIKKO approaches.\n\n\t\t\t\tRUBEN\n\t\tUp all night with a sick friend.\n\n\tNIKKO'S face is tight with anger.\n\n\t\t\t\tNIKKO\n\t\tYou dumb son of a bitch!  You don't\n\t\teven know how to treat a woman.\n\n\t\t\t\tRUBEN\n\t\tWho?  M.J.?  Hey, Nikko, explain to\n\t\tme why she gave you the boot...\n\n\tHe moves to M.J. who stands beside the dead BODY OF THE\n\tWOMAN WE LAST SAW STRAPPED TO A TABLE.  The plastic bag is\n\tnow tied tight around her neck.  She has been posed beneath\n\ta sign that says \"NO DUMPING\".  The usual technicians,\n\tphotographers, Doc, the Coroner, etc.\n\n\t\t\t\tRUBEN\n\t\tIs Niccoletti assigned here?\n\n\t\t\t\tM.J.\n\t\t\t(angry about it)\n\t\tQuinn decided we should form a task\n\t\tforce -- they're all one case, now.\n\t\tHe wants all the senior detectives\n\t\ton it...\n\t\t\t(to Doc)\n\t\tShe wasn't killed here.\n\n\t\t\t\tDOC\n\t\tNot likely.\n\n\tM.J. is kneeling, inspecting everything here; Ruben kneels\n\tbeside her... to Ruben...\n\n\t\t\t\tM.J.\n\t\tTell me what you see.\n\n\tHe inspects the dead girl's fingernails.\n\n\t\t\t\tRUBEN\n\t\tShe didn't fight back, no hair or\n\t\tskin under her fingernails.  I'm\n\t\tnot seeing any bruises or\n\t\tcontusions...\n\n\t\t\t\tM.J.\n\t\tWhat about her arms?\n\n\t\t\t\tRUBEN\n\t\tNeedle marks, fresh, here.  look at\n\t\tthis...\n\n\tNikko appears, looming over her...\n\n\t\t\t\tNIKKO\n\t\tProbably so stoned she never knew\n\t\twhat got her.  Like Goetz's sick\n\t\tfriend.  Right Goetz?\n\n\tThey ignore him.  M.J. stands...\n\n\t\t\t\tRUBEN\n\t\tShe's blue as hell.  No marks on her\n\t\tneck.  Asphyxiated?  not the same --\n\t\tno ligature marks.  Outdoors...\n\n\t\t\t\tM.J.\n\t\tLook at her legs.\n\n\t\t\t\tRUBEN\n\t\tSpread out like she was sexually\n\t\tassaulted here.\n\n\t\t\t\tDOC\n\t\tAfter she was dead.\n\n\t\t\t\tRUBEN\n\t\tShe was dragged up here from the\n\t\troad, you can see the tracks.  She\n\t\twas already dead or unconscious.\n\t\tLet's get plaster casts on any --\n\t\tall footprints.\n\n\t\t\t\tM.J.\n\t\tIf this is just the dump site,\n\t\twhere did he do the job?  Where did\n\t\the pick her up?\n\n\t\t\t\tNIKKO\n\t\tDoped up kids all over town.  Park\n\t\twas full of them last night.  Very\n\t\teasy pickin'.  Goetz's type.\n\n\tRuben hits him, Nikko reflexively throws a punch that grazes\n\tRuben.  Everybody stops in astonishment.  M.J. steps between\n\tthem.  Ready to get physical herself; they settle...\n\n\t\t\t\tM.J.\n\t\tWhat the hell are you doing?  The\n\t\tMouth and the Haircut are right\n\t\tdown there, thank God they didn't\n\t\tsee that.\n\n\tDown below, Susan and the Haircut are interviewing Festival-\n\tof-Lovers.\n\n\t\t\t\tM.J.\n\t\tNiccoletti, they're on the wrong\n\t\tside of the tape, you want to push\n\t\tthem back?  Now.\n\n\tNikko trots off to Susan and the Haircut.  M.J. gestures for\n\tRUBEN, now on his feet and dabbing at a split lip, to follow\n\ther back to the cars.  As they move more slowly down the\n\thillside to their cars...\n\n\t\t\t\tM.J.\n\t\tRuben, my God, I ought to put you\n\t\ton report.\n\n\t\t\t\tRUBEN\n\t\tYou're right.  I can't stand that\n\t\tbastard.  Sorry.\n\t\t\t(getting back to\n\t\t\t work)\n\t\tThis is something new.  Not the\n\t\tsame guy, that's for sure.\n\n\t\t\t\tM.J.\n\t\tYeah, everything's different.\n\n\tBut she seems unhappy... to techs standing by:\n\n\t\t\t\tM.J.\n\t\tGet the pictures, and casts of\n\t\tfootprints.\n\n\t\t\t\tRUBEN\n\t\tLook at him, grandstanding...\n\n\tNikko is talking to Susan Schiff...\n\n\t\t\t\tM.J.\n\t\tThat's all we need...\n\n\tShe strides toward them...\n\n\t\t\t\tM.J.\n\t\tDetective Niccoletti?\n\n\t\t\t\tSUSAN\n\t\tWhat's this about the Boston\n\t\tStrangler, M.J.?\n\n\tM.J. looks at Nikko.  He should know better.  She's also\n\tthinking: is this a good thing to have the media announce at\n\tthis point -- or not?\n\n\t\t\t\tM.J.\n\t\tHey, Susan -- I'm sorry, you're on\n\t\tthe wrong side of the tape.  We're\n\t\tstill trying to find any footprints\n\t\tor tire marks and we don't want to\n\t\tchew up the ground, okay?  I'll\n\t\ttalk to you later.\n\t\t\t(to Nikko)\n\t\tYou, too.\n\n\tShe's got Susan outside the tape...\n\n\t\t\t\tSUSAN\n\t\tInspector, will you confirm\n\t\tsomebody is copying the Boston\n\t\tStrangler?  This is the fourth, is\n\t\tthat correct?\n\n\t\t\t\tM.J.\n\t\tWe're going to review all the\n\t\tevidence carefully before making\n\t\tany statement...\n\n\tShe is getting into her car; Ruben jumps in on the other\n\tside.  Susan races for her silver Audi...\n\n\t\t\t\tM.J.\n\t\tRuben, put the light on...\n\n\tFrom outside the car as they drive away we see Ruben's arm\n\tclap the magnetic flasher on the top of their unmarked car.\n\n\tM.J. switches it on... A CHASE ENSUES.  SUSAN has a faster\n\tcar, but M.J. is a better driver.  Stomach dropping hills,\n\ttrolley cars, the corkscrew turns of Lombard Street, all the\n\tfamiliar San Francisco chase scenes.\n\n\t\t\t\tM.J.\n\t\tNow listen up, Ruben.  You never,\n\t\tnever, never mess with somebody\n\t\tinside the case!\n\n\t\t\t\tRUBEN\n\t\tExcuse me?  Excuse me?!  What do\n\t\tyou...\n\n\t\t\t\tM.J.\n\t\tYou damn well better start working\n\t\ton that impulse control.  A woman\n\t\twho is implicated in this case?\n\t\tSomeone who's practically a piece\n\t\tof evidence?\n\n\t\t\t\tRUBEN\n\t\tIt's against your rules that I try\n\t\tto help a witness who's scared\n\t\tshitless?  Who's...\n\n\t\t\t\tM.J.\n\t\tThe woman's unstable.  You could\n\t\twind up with a harassment charge.\n\t\tAnything.  You're like some horny\n\t\tlittle teenager.\n\n\tM.J. takes another two-wheel corner.  In the rear view\n\tmirror, M.J. watches SUSAN lose control of her car as she\n\ttries to make a tight turn, M.J. smiles in contempt.\n\n\t\t\t\tM.J.\n\t\tAnybody who's ever watched TV knows\n\t\tabout that corner.\n\n\tHaving lost SUSAN, M.J. slows down to a normal speed.\n\n\t\t\t\tM.J.\n\t\tEverybody could see you -- unshaved,\n\t\tsame clothes from yesterday,\n\t\treeking of sex.\n\n\tRUBEN'S eye-brows lift.  She peels into the HQ parking lot\n\tand jumps out.\n\n\t\t\t\tM.J.\n\t\t\t(going away)\n\t\tPark the car.  Call the lab.  Get\n\t\tDoc to lean on the coroner for a\n\t\treally fast prelim on the sperm.\n\n\tRUBEN gets out of the car to cross to the driver's side...\n\n\t\t\t\tM.J. (O.S.)\n\t\tWhen you get it, call me.\n\n\tRUBEN look after her, a smile of delight on his face.\n\n\t\t\t\tRUBEN\n\t\tShe loves me.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. QUINN'S OFFICE - DAY\n\n\tQUINN, NICCOLETTI.\n\n\t\t\t\tQUINN\n\t\tI know; the kid hit you first.  He\n\t\talready told me.\n\n\t\t\t\tNIKKO\n\t\tHe's not treating her right...\n\n\t\t\t\tQUINN\n\t\tShe left you, Nikko.  She's not\n\t\tyour responsibility.  She takes\n\t\tvery good care of herself.  If she\n\t\twants to romance the kid, it ain't\n\t\tyour business.  Your business is to\n\t\tsnap out of it.\n\n\t\t\t\tNIKKO\n\t\tWe were together six years, sir!\n\n\t\t\t\tQUINN\n\t\tDon't give me six years!  You never\n\t\tdivorced Patty, did you?  So what'd\n\t\tyou expect from M.J.?\n\n\t\t\t\tNIKKO\n\t\tShe knows I'm Catholic!  She never\n\t\tmentioned divorce!  Not once!\n\n\t\t\t\tQUINN\n\t\tThen you shoulda known she wasn't\n\t\tbuying.  She was just long-term\n\t\tleasing' you.\n\t\t\t(beat)\n\t\tAh, Nickie.  Except for that rare\n\t\ttwenty-second twitch, there ain't\n\t\tnothin' about sex I don't hate.\n\t\tBut of course, I'm Irish.\n\t\t\t(beat)\n\t\tPlus I got real problems.  I'm\n\t\tworried I might have to put you in\n\t\tover M.J.  There's something going on\n\t\there, the Commissioner is targeting\n\t\ther now, I can't leave a woman in\n\t\tthat position.  But the thing is,\n\t\thow can I move you in, if you go on\n\t\tacting like a teenage asshole?\n\n\t\t\t\tNIKKO\n\t\tI don't want the job.  Don't do\n\t\tthat to her.  She's worked too\n\t\tdamned hard for it.\n\n\t\t\t\tQUINN\n\t\tWhat's going down with the sting in\n\t\tChinatown?  That gonna be off your\n\t\tplate in a week or what?\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. TASK FORCE ROOM - DAY\n\n\tA ROOM IN THE BASEMENT OF THE POLICE HQ IS BEING SET UP TO\n\tHOUSE A NEW TASK FORCE, WITH CATERER'S TABLE FOR TEMP\n\tDESKS.  Bulletin boards with notices and pictures; telephone\n\ttechs are still installing phones, cops are learning\n\tunfamiliar computer menus, etc.  M.J. IS EXAMINING HUGE\n\tBLOWUPS OF ONLOOKERS AT CRIME SCENES PINNED UP ON A WALL,\n\tWITH A MAGNIFYING LENS.\n\n\t\t\t\tQUINN (V.O.)\n\t\tSergeant...\n\n\tShe walks away BECKONS, BECKONS, COME ON, WALK AFTER ME!  He\n\twalks out of a door and they stand on the steps...\n\n\tEXT. STEPS POLICE HQ - DAY\n\n\tA couple of Cops, maybe male and female, are smoking there.\n\tQuinn gives them a look that sends them scuttling inside,\n\tflipping their butts into the shrubbery.  Quinn sighs and\n\tdigs out a cigarette.  The looks between them tell the story\n\tof his trying to give it up and not being able to, etc.\n\n\t\t\t\tQUINN\n\t\tSo what have we got?\n\n\t\t\t\tM.J.\n\t\tIt's not the same guy.  It should be\n\t\ta self-solver.  No bow around the\n\t\tneck, left and body outdoors,\n\t\tcompletely different.  The others\n\t\twere housewives, secretaries, he\n\t\ttalked his way inside, killed them\n\t\tin their own living room or bed- or\n\t\tbathroom.  This one didn't have a\n\t\thusband or a boyfriend, no family,\n\t\ttemp waitress, 3 arrests for\n\t\tmisdemeanor dope offenses, DUI,\n\t\tasphyxiation probably from a\n\t\tplastic bag over her head.  Sexually\n\t\tassaulted.  The others weren't\n\t\tmolested that way.  We're waiting\n\t\tfor the sperm tests...\n\n\t\t\t\tQUINN\n\t\tChrist.  How old are you?  You sure\n\t\tyou want to be in this line of\n\t\twork?\n\n\t\t\t\tM.J.\n\t\tYou're damn right I do.\n\n\t\t\t\tQUINN\n\t\tOkay, now what about your sidekick\n\t\tpunching my favorite detective?\n\t\tWhat the hell is going on?  You got\n\t\tno discipline in your operation.\n\n\t\t\t\tM.J.\n\t\tI'm sorry it had to come to your\n\t\tattention.  I am dealing with it.\n\n\tShe starts to go...\n\n\t\t\t\tQUINN\n\t\tWhere you going?\n\n\t\t\t\tM.J.\n\t\tHelen Hudson...\n\n\t\t\t\tQUINN\n\t\tWhat the hell you need her for?\n\n\t\t\t\tM.J.\n\t\tBecause I think I'm wrong.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. HELEN'S APARTMENT - DAY\n\n\tCLOSE: XANAX BOTTLE.  SHAKING HANDS DUMP OUT PILLS.  FOUR.\n\tSIX.  TWO, PUT BACK.  ONE MORE, PUT BACK.\n\n\tHELEN: RAVAGED.  WATCHING HERSELF IN MIRROR AS SHE GULPS THE\n\tREMAINING PILLS.\n\n\tDOOR BELL RINGS O.S.\n\n\t\t\t\tHELEN\n\t\tI'm not seeing anybody.\n\n\tWe HEAR muffled voices -- ANDY and M.J.  HELEN, as she\n\trealizes Andy is letting M.J. in, goes to the bathroom door\n\tand tries to slam and lock it: Andy beats her to it,\n\tblocking with his foot in the door.\n\n\t\t\t\tHELEN\n\t\tYou're fired.\n\n\t\t\t\tANDY\n\t\tI know.  Do come and meet your\n\t\tguest.\n\n\tM.J. appears.  Taking in Helen's condition -- due to a wild\n\tnight with Ruben?  Helen moves from the bathroom down the\n\thall to her office, as...\n\n\t\t\t\tM.J.\n\t\tWe've got another one.\n\n\t\t\t\tHELEN\n\t\tThat's no surprise.\n\n\t\t\t\tM.J.\n\t\tBut it's a different m.o.\n\n\t\t\t\tHELEN\n\t\tThen what do you need me for?\n\n\t\t\t\tM.J.\n\t\tShe was killed somewhere else and\n\tdumped outdoors in an empty lot.\n\t\tWhere it says \"no dumping.\"  Her\n\t\tlegs pulled apart in a kind of\n\t\tsexual pose.   It's all different\n\t\tbut it seems so -- the same.\n\t\tArtificial and posed... Something's\n\t\twrong with it.\n\n\t\t\t\tHELEN\n\t\tYou're saying it's the same man,\n\t\tbut he's changed his style?  That\n\t\tdoesn't happen.  These men are\n\t\trobotic; the murder is like a\n\t\tritual.  The method itself is part\n\t\tof the pleasure...\n\n\tThey've turned into the office.  Something is wrong...\n\n\t\t\t\tM.J.\n\t\tWho turned off the Internet\n\t\tcomputer...\n\n\t\t\t\tHELEN\n\t\tI turned it off.  It's like an open\n\t\twindow he can climb right in...\n\n\t\t\t\tM.J.\n\t\tHe comes in the window, we maybe\n\t\tgrab him.  Where's the on-switch?\n\n\t\t\t\tHELEN\n\t\tHave you got a warrant?  Get the\n\t\thell out o here!  This is the\n\t\tonly space I have left in the\n\t\tworld!  Why can't you leave me out\n\t\tof it?\n\n\t\t\t\tM.J.\n\t\tHelen -- the killer directly\n\t\tcontacted you.  His interest in you\n\t\tis intense.  I'm worried about you.\n\t\tI don't want to lose you.  I know\n\t\tthis stirs up every monster under\n\t\tthe bed, but this is the only\n\t\tdirect contact we have with him.\n\t\tThe only chance we have to trap\n\t\thim.\n\t\t\t(beat)\n\t\tSo, you can turn Internet back on,\n\t\tor I do, and we put somebody here\n\t\ton a 24 hour shift and you can\n\t\tkick, scream and hyperventilate.\n\n\t\t\t\tHELEN\n\t\tThat little Winona Ryder manner...\n\t\tyou're more convincing as Clint\n\t\tEastwood.\n\n\t\t\t\tM.J.\n\t\tClint is putting a guard on you.\n\t\tBut if you swear to leave the\n\t\tcomputer on, Winona will assign him\n\t\tto the hall outside.\n\n\tHELEN has to laugh.  The laugh turns to a hacking cough.\n\n\t\t\t\tANDY\n\t\tShe's smoking again.\n\n\tAndy leaves.  Helen sits, and with the care of someone\n\thandling a rattlesnake, turns the computer on.  Meanwhile...\n\n\tTHE PHONE RINGS.\n\n\t\t\t\tHELEN\n\t\tHello?... Oh...\n\t\t\t(a beat)\n\t\t...yes, she's right here.\n\n\tHELEN hangs the phone to M.J.  The air is a little more\n\tcharged... Helen goes back to the computer.\n\n\t\t\t\tHELEN\n\t\tRuben.\n\n\t\t\t\tM.J.\n\t\tHello, Ruben...\n\t\t\t(listens, nods)\n\t\tSo that's that...\n\n\t\t\t\tHELEN\n\t\tPlease thank Inspector Goetz for\n\t\ttaking care of me last night.\n\n\tM.J. delivers the message straight-faced.\n\n\t\t\t\tM.J.\n\t\tRuben, Dr. Hudson wants me to\n\t\tthank you for taking care of her\n\t\tlast night.\n\t\t\t(hangs up)\n\t\tLab report on the new one.  At\n\t\tleast two guys penetrated her.\n\t\tThere were two kinds of sperm.  The\n\t\tpoor thing.  What it must have been\n\t\tlike.\n\n\tHelen has come alert...\n\n\t\t\t\tHELEN\n\t\tShe was near a sign that said \"No\n\t\tDumping?\"  Two kinds of sperm --\n\t\tthe lab said one was a secretor and\n\t\tthe other was not?\n\n\tM.J. mumbles a surprised yes.  Helen is at computer.\n\n\t\t\t\tHELEN\n\t\tThere were needle marks.  But no\n\t\tdrugs in her blood.\n\n\t\t\t\tM.J.\n\t\tSo far nothing they test for comes\n\t\tup positive.\n\n\tHelen has a Window type screen: she clicks icons...\n\n\t\t\t\tHELEN\n\t\tIs that it?\n\n\t\t\t\tM.J.\n\t\t\t(stunned)\n\t\tThat's exactly... I could have\n\t\ttaken that same picture, this\n\t\tmorning.\n\n\tA RATHER GRAINY PICTURE OF A DEAD GIRL SPREAD OUT IN A\n\tSUGGESTIVE POSE IN AN EMPTY FIELD.  A SIGN RIGHT BY HER SAYS\n\t\"NO DUMPING.\"\n\n\t\t\t\tHELEN\n\t\tHe's switched from DeSalvo to the\n\t\tHillside Strangler.  The Strangler\n\t\twas two men, that's why there are\n\t\ttwo kinds of sperm.  His idea of a\n\t\tjoke, very witty our boy.\n\n\t\t\t\tM.J.\n\t\tThat's not consistent... You said\n\t\tthey never changed their style,\n\t\tthey're robots...\n\n\t\t\t\tHELEN\n\t\tConsistency is the hobgoblin of\n\t\tlittle minds.  Tell them to test\n\t\tfor the chemicals found in Windex.\n\t\tThat's a product for cleaning\n\t\twith...\n\n\t\t\t\tM.J.\n\t\tI know Windex, for God's sake, I\n\t\tclean my own windows...\n\n\t\t\t\tHELEN\n\t\tIt's what Bianchi and Buono\n\t\tinjected into one of their victims.\n\n\t\t\t\tM.J.\n\t\t\t(sensing something\n\t\t\t appalling)\n\t\tInjected Windex!  Why would he\n\t\tswitch to a new m.o.?\n\n\t\t\t\tHELEN\n\t\tAh, if you knew that, you'd be half\n\t\tway to nailing him.  Serial killing\n\t\tis irrational and rigid and \n\t\tcompulsive.  This guy has a plan\n\t\tall thought out, flexible and\n\t\tcomplex.  He's playing a game with\n\t\tus.  Who will he imitate next?\n\t\tMaybe he's doing all the serial\n\t\tkillers in history, the great\n\t\tinnovators, the murderers' hall of\n\t\tfame.  Just to prove he's better\n\t\tthan all of them.  They got caught;\n\t\the didn't.\n\n\t\t\t\tM.J.\n\t\tHe'll get caught.  If he has a plan\n\t\tthat'll be what trips him up...\n\n\t\t\t\tHELEN\n\t\tWho's going to catch him?  You?\n\t\t\t(beat)\n\t\tAnd if you do, there'll be another\n\t\tone.  And one after that.\n\n\t\t\t\tM.J.\n\t\t\t(gently, surprised)\n\t\tYou're afraid of him.\n\n\t\t\t\tHELEN\n\t\tThis one, yes.  I was always\n\t\tcurious about these twisted little \n\t\tsouls, but this is the first one\n\t\tI've felt personally terrified of.\n\t\tHe's something new and unheard of.\n\t\tI don't know what he wants.\n\n\t\t\t\tM.J.\n\t\t\t(beat)\n\t\tI'm giving you Clint outside.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. PETER'S BEDROOM - NIGHT\n\n\tThe room is empty, the messy unmade bed has covers thrown\n\tback.  Nasty Little Dog is sprawled asleep on it.  The TV is\n\ton: SUSAN SCHIFFER'S broadcast... Over SUSAN'S shoulder, big\n\tand bold, the legend:\n\n\t'KOPYCAT KILLER?'\n\n\t\t\t\tSUSAN\n\t\t...to mimic the M.O. of the Boston\n\t\tStrangler.  The police here are\n\t\trumored to be consulting Dr. Helen\n\t\tHudson.\n\n\tO.S.  A TOILET FLUSHES, and Peter's WIFE emerges wearing a\n\tnightgown.  She shuffles back to the bed, and as she sits\n\tpicks up the remote...\n\n\t\t\t\tSUSAN (ON TV)\n\t\tIt was backstage at the McClusky\n\t\tAuditorium on the Berkeley campus\n\t\tthat Dr. Hudson's police bodyguard\n\t\twas killed.  Daryll Lee Cullum,\n\t\tthat...\n\n\tShe zaps the remote and a program hyping the Summer of Love\n\tcomes on...\n\n\tINT. PETER'S BEDROOM - NIGHT\n\n\tWe see on HIS computer screen a picture of HELEN scanned\n\tfrom some newspaper or magazine.  PETER is building a morph:\n\tbeside Helen on screen is another image -- of the RED-HEADED\n\twoman.  He is placing marks on one picture, on the exact\n\tcorner of Helen's left eyes.  As he does so, a red dot\n\tappears near the corner of the left eye of the Red-headed\n\twoman.  Both pictures are dappled with similar dots.  It\n\tlooks very odd, as though someone had stuck Post-its all\n\tover the images.  Around him, as he works are other pictures:\n\tASPHYXIATED GIRL taken while she was strapped to the table.\n\tOf the sign \"NO DUMPING.\"  M.J. leaving Helen's!  HE ALSO HAS\n\tA TINY TV ON, AND TURNS TO SEE AS:\n\n\t\t\t\tSUSAN (ON TV)\n\t\t... convicted serial killer had\n\t\tescaped police custody during a\n\t\tcourt hearing, in a scandal that\n\t\trocked the police and forced the\n\t\tresignation of four State\n\t\tCorrection officers...\n\n\tINT. DEATH ROW CELL - NIGHT\n\n\tDARYLL LEE lies smoking and watching a tiny TV of his own.\n\n\t\t\t\tSUSAN (ON TV)\n\t\t...Cullum attacked Doctor Hudson in\n\t\tapparent revenge for her testimony\n\t\tagainst him.  Doctor Hudson did not\n\t\treturn our phone calls, today.  Our\n\t\tsources tell us that if police\n\t\thomicide detectives fail to move\n\t\tfaster in their investigation the\n\t\tFBI will be called...\n\n\tINT. TASK FORCE ROOM - NIGHT\n\n\tM.J. striding, tight-lipped through the room to her\n\tworkstation where she takes the phone from Ruben...\n\n\t\t\t\tM.J.\n\t\tHalloran.\n\n\tINTERCUT:\n\n\t\t\t\tHELEN\n\t\tYou betrayed me!  Now every\n\t\tpsychopath in the city knows I'm\n\t\tback in business... You lied to me!\n\n\t\t\t\tM.J.\n\t\tI did not; the Mouth -- that's what\n\t\twe call Susan Schiffer -- got it on\n\t\ther own.\n\n\t\t\t\tHELEN\n\t\tWhy should I trust you?\n\n\t\t\t\tM.J.\n\t\tBecause I'm all you've got.\n\n\tRUBEN HAS BEEN GIVEN NEWS: BIG PROBLEMS.  MEN AND WOMEN ARE\n\tGETTING UP, PUTTING ON HOLSTERS, ETC., MOVING OUT...\n\n\t\t\t\tHELEN\n\t\tHow could you...\n\n\t\t\t\tM.J.\n\t\t\t(out of patience)\n\t\tI like the real smart Helen Hudson\n\t\ta lot, I'm Goddamned sick and \n\t\ttired of the hysterical little\n\t\tgirl, Helen.  You asked your way in\n\t\t-- I don't forget that.  You've got\n\t\ta nickname around here -- \"Deep\n\t\tThroat\" from all the phone calls, I\n\t\twonder if you know that.  Go take a\n\t\txanax, I've got to got to work.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. HELEN'S BEDROOM - NIGHT\n\n\tHELEN, her police scanner sounding distant tinny cries in\n\tthe night:  Helen holding the phone, digesting that...\n\n\t\t\t\tSCANNER (VARIOUS VOICES)\n\t\t987...  Carol Meany, call your\n\t\thome?  We have...  don't step on\n\t\tme, damn it!  Go to channel 8...\n\t\tCode Red -- Homicide at 16th Avenue\n\t\tand Horgan, woman dead in car.  Can\n\t\twe have homicide?  All units go to\n\t\tchannel 5.  Leave channel 3 clear\n\t\tfor homicide... etc.\n\n\tEXT. HELEN'S STREET - NIGHT\n\n\tA MAN parks a car.  He gets out.  He is dressed entirely in\n\tblack.  Glancing around to be sure he is not observed, the\n\tMAN moves to cars, banging them hard with his hand until he\n\tSETS OFF A CAR ALARM.  He trots silently to HELEN'S side of\n\tthe street and merges into the dark side of her building.\n\tTHE ALARM GOES INFURIATINGLY ON.  A light comes on in an\n\tupstairs window...\n\n\tINT. HELEN'S HALLWAY - NIGHT\n\n\tBURT, the cop on guard, marginally irritated by the car\n\talarm, looks up briefly, then returns to his magazine.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tEXT. RICHMOND DISTRICT - NIGHT\n\n\tCAR WHERE A WOMAN HAS BEEN SHOT DEAD.  KLIEG LIGHTS PAINT\n\tHER FEATURES A BLEAK WHITE ON BLACK.  M.J. and RUBEN work\n\tthe scene along with the CRIME TECH CREW.\n\n\tOne of the TECH GUYS holds up a bullet.\n\n\t\t\t\tTECH GUY\n\t\tPulled this out of the door, it's\n\t\tbigger than a .38; it's a .44 or 9\n\t\tmillimeter.\n\n\tCLOSE: M.J. is crawling along the floor, looking at\n\teverything she can find -- gum wrappers, hobby pins, loose\n\tchange, etc.  She lifts her head and finds the car radio and\n\ttape player right in her face.\n\n\t\t\t\tM.J.\n\t\tWas this on?  When you found the\n\t\tcar was the tape player on or off.\n\n\t\t\t\tCOP (V.O.)\n\t\tIt was on, auto-reverse, over and\n\t\tover.\n\n\tM.J. has rubber gloves on.  She switches on ignition and the\n\ttape player starts:  ABBA.  A phone rings...\n\n\tON RUBEN standing beside the car; he answers his phone...\n\n\t\t\t\tRUBEN\n\t\tYeah?... I can't talk now...\n\t\tWhat?... No.  There's no sexual\n\t\tassault, it's a drive-by, a woman\n\t\tin a car, it's not him.\n\t\t\t(mouths to M.J.)\n\t\tHelen.\n\n\tM.J. still pissed at the earlier phone call, turns away,\n\tdismissively...\n\n\t\t\t\tHELEN (V.O.)\n\t\tIt's a woman shot in a car?\n\n\t\t\t\tRUBEN\n\t\tYes.  I have to go...\n\n\t\t\t\tHELEN\n\t\tShe on the passenger side?\n\n\t\t\t\tM.J.\n\t\t\t(shouting to be\n\t\t\t heard)\n\t\tHelen, hang up, let Ruben get on\n\t\twith his work...\n\n\t\t\t\tHELEN\n\t\tWhat's that music.  It's Abba.  I\n\t\tcan hear it.  It's Abba.\n\n\t\t\t\tRUBEN\n\t\tWhat's Abba?\n\n\t\t\t\tM.J.\n\t\tBunch of Swedish women.  You're too\n\t\tyoung.\n\n\tDread clouds HELEN'S face.  She is calling up databases,\n\tscreens scrolling across her computer monitor.\n\n\t\t\t\tHELEN\n\t\tDon't hang up!\n\n\t\t\t\tRUBEN\n\t\tWhat?...\n\n\t\t\t\tHELEN\n\t\tListen to me.  Is there a gas\n\t\tstation nearby?\n\n\tRUBEN look around, sees a gas station across the street and\n\tfurther down the block...\n\n\t\t\t\tRUBEN\n\t\tYes.\n\n\t\t\t\tHELEN\n\t\tIs there a phone booth there?\n\n\t\t\t\tRUBEN\n\t\tThey all have one...\n\n\t\t\t\tHELEN\n\t\tGo and look for a note.\n\n\tRUBEN hands the phone over to M.J.\n\n\t\t\t\tRUBEN\n\t\tShe wants me to check the phone\n\t\tbooth for a note.\n\n\t\t\t\tM.J.\n\t\tHelen... excuse me, we...\n\n\tON HELEN'S SCREEN IS THE FACE OF BERKOWITZ... SHE CALLS UP\n\tADDITIONAL FRAMES SHOWING SCENES OF HIS CRIMES.\n\n\t\t\t\tHELEN\n\t\tShe was listening to Abba in her\n\t\tparked car when she was shot with a\n\t\tBulldog .44.\n\n\tM.J. reacts:  the scene of what Helen is saying hits her\n\thard.  This is repeating the pattern of yet another\n\tkiller...\n\n\t\t\t\tM.J.\n\t\tTony!\n\n\tThe techie who pulled the bullet out of the door turns...\n\n\t\t\t\tM.J.\n\t\tLet me see the slug outta the door!\n\n\tHe pulls a baggie out his pocket and hands it to her...\n\n\tRUBEN RUNNING across to the gas station.  He's alone now,\n\tthe blazing lights of the crime scene recede.\n\n\tEXT. HELEN'S BUILDING - NIGHT\n\n\tA small annoyed crowd has gathered around the are whose\n\talarm is still shrieking.\n\n\tINT. HELEN'S HALLWAY - NIGHT\n\n\tBURT finally gets up, goes to window, sees situation,\n\tdecides to go and fix it.\n\n\tEXT. CRIME SCENE - NIGHT\n\n\tM.J. still on phone to HELEN.  She's just got the bullet out\n\tof the baggie; Tony stands watching.\n\n\t\t\t\tM.J.\n\t\tWhat's that siren?\n\n\t\t\t\tHELEN (V.O.)\n\t\tOne of those goddamned car alarms.\n\t\tWhat's going...\n\n\t\t\t\tM.J.\n\t\tRuben's gone to look... It's banged\n\t\tup but it looks like a .44.  It's\n\t\tSon of Sam.  Is it Son of Sam?\n\n\t\t\t\tHELEN\n\t\tLook in the crowd.  He liked to\n\t\thang around and watch the cops at\n\t\twork...\n\n\tEXT. SHELL STATION - NIGHT\n\n\tClosed.  RUBEN at the phone booth.\n\n\tA note lies on the shelf, handwritten in felt-tip pen.  He\n\tputs on a rubber glove, picks note up by one corner.\n\n\tCRIME SCENE:\n\n\tRUBEN has taken phone back from M.J.  He is reading the note\n\tto HELEN.  M.J., agitated, stands by.\n\n\t\t\t\tRUBEN\n\t\t\"Police: let me haunt you with\n\t\tthese words:  I'll be back.\"\n\n\tM.J. notices that there is writing on the other side of the\n\tnote.  She forces RUBEN'S gloved hand to turn note over.\n\n\t\t\t\tRUBEN\n\t\tHold on a minute, Helen...\n\n\tBy this time M.J. has seen that this part is addressed to\n\tHELEN.  M.J. takes phone from RUBEN, forcing herself to\n\tsound casual.\n\n\t\t\t\tM.J.\n\t\tHelen, Ruben's going to drop by.\n\t\tHe's got some questions.\n\n\tShe hangs up, RUBEN is already on his way.  M.J. calls a\n\tnumber...\n\n\t\t\t\tM.J.\n\t\tAnswer me!!...\n\n\tEXT. HELEN'S APARTMENT - NIGHT\n\n\tThe beeper on Burt's belt is beeping, but his head is under\n\tthe hood of the car where the car alarm is blaring.  He\n\tcan't hear the beeper...  \n\n\tBACK TO CRIME SCENE:\n\n\tM.J. ends the call, yells to another Detective.\n\n\t\t\t\tM.J.\n\t\tI need a unit at 19809 Lorenda\n\t\tDrive.  Tell them to approach code\n\t\t2 and wait for instruction.  Find\n\t\tthe goddamn officer supposed to be\n\t\ton security.  Ruben's on his way.\n\t\tHe'll go in alone.\n\n\tSHE TURNS AND SEES:\n\n\tBEHIND YELLOW CRIME SCENE TAPE THE NIGHT IS FULL OF THRILL\n\tSEEKERS AND CURIOUS.  WHICH OF THEM MIGHT BE THE KILLER?\n\tTHE GUY IN THE BACK OF THE CROWD WHO FOR NO APPARENT REASON\n\tSUDDENLY BEGINS TO RACE ALONG BEHIND THE ONLOOKERS?  THE MEN\n\tWHO DUCKS TO TIE HIS SHOE WHEN A PHOTOGRAPHER SHOOTS A\n\tPICTURE?\n\n\tINT. FRONT DOOR OF HELEN'S APARTMENT - NIGHT\n\n\tThe horn blares across the street, (O.S.).  No one notices\n\tthe MAN at HELEN'S door, swiftly fiddling the lock with a\n\tring full of burglars' keys and picks.\n\n\tINT. HELEN'S BATHROOM - NIGHT\n\n\tHELEN is putting on makeup (Ruben is coming).  A small but\n\talarming noise at the front of the loft.  She listens\n\tcarefully, and moves to the door looking down the hall\n\ttoward the front door.  It is OPEN\"  Burt is not there!\n\n\tShe hesitates a moment, then turns off the lights and\n\tsprints for the front door, to escape.\n\n\tINT. LIVING ROOM\n\n\tTHE MAN IS PULLING A BALACLAVA UP OVER HIS FACE.  AS HE HEARS\n\tHER HE STEPS TO THE...\n\n\tINSERT: TELEPHONE\n\n\tA HAND IN A FINE LEATHER BLACK GLOVE LIFTS THE RECEIVER OFF\n\tTHE HOOK.\n\n\tHELEN RUNS DOWN THE HALL AND REACHES THE FRONT DOOR.  SHE\n\tRUNS RIGHT OUT INTO THE HALL A FEW STEPS BEFORE RECOILING:\n\n\tHER POV.  THE WALLS AND FLOOR WEAVING AND CONTRACTING...\n\tAGORAPHOBIA HAS HIT.\n\n\tHELEN FALLS.  SHE SCRAMBLES IN TERROR BACK TO THE \"SAFETY\"\n\tOF HER WALL, NOW A CAVE OF DARKNESS.\n\n\tSHE FALLS ON THE FLOOR OF THE HALL, GASPING FOR BREATH.\n\n\tLIVING ROOM.  THE MAN MOVES ACROSS THE ROOM TOWARD THE\n\tHALL.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tRUBEN:  taking the hills fast.\n\n\tTHE MAN: STEPS OUT INTO THE HALL.\n\n\tHELEN:  SHE HAS RUN BACK THE LENGTH OF THE HALL TO HER\n\tOFFICE.  SHE IS JUST VANISHING AS THE MAN STEPS TO WHERE HE\n\tCAN SEE HER.\n\n\tTHE MAN STARTS TO FOLLOW, NOT FAST, BUT WITH TERRIFYING\n\tSURENESS...\n\n\tTHE POLICE SCANNER SUDDENLY COMES UP LOUD.  HE HESITATES.\n\n\tHELEN:  HER REMOTE CONTROLS IN HAND SWITCHES ON TV SETS,\n\tLAMPS, ETC.\n\n\tTHE MAN:  HE STARTS TO MOVE AGAIN, TOWARD WHERE HE BELIEVES\n\tSHE IS.  HE IS PASSING A WINDOW, WHEN THE CURTAINS SUDDENLY\n\tDRAW, RIGHT BESIDE HIM.  HE PAUSES AGAIN, LOOKS DOWN AND WE\n\tAND HE/WE SEE THE STREET SCENE: BURT AND NEIGHBORS TRYING TO\n\tSILENCE THE CAR ALARM.  THEN HE STARTS TO MOVE AGAIN.\n\n\tTHE CURTAINS CLOSE.\n\n\tHIGH ANGLE OVER THE MAZE OF THE APARTMENT WALLS.  WE CAN SEE\n\tTHE MAN MOVING ALONG THE HALLWAY AGAIN -- TOWARD ANDY'S DEN,\n\tAND DIRECTLY TOWARD WHERE WE LAST SAW HELEN.\n\n\tSUDDENLY, FOREGROUND, HELEN'S HEAD POPS UP, HUGE!  SHE IS\n\tWRESTLING HERSELF UP OVER THE WALL TOWARD CAMERA, INTO\n\tANOTHER ROOM OUT OF HIS PATH.  WE PAN WITH HER AS SHE WIGGLES\n\tHERSELF OVER THE TOP OF THE WALL AND UNTIL SHE FALLS INTO\n\tFURNITURE, MAKING A HUGE NOISE.\n\n\tMAN STOPS, TRYING TO LOCATE DIRECTION.  HE DECIDES.  LEAPS\n\tWITH CATLIKE GRACE ONTO A PIECE OF FURNITURE AND FROM THERE\n\tONTO THE TOP OF THE WALL!\n\n\tNOW HE STANDS ON THE PARTITION, LOOKING AROUND AT THE\n\tGROUNDPLAN (AS IT WERE) OF THIS APARTMENT MAZE FROM A HIGH\n\tANGLE POV.\n\n\tHELEN:  SHE CROUCHES IN HIDING.  IN DEEP FOCUS, BEYOND HER,\n\tAND HIGH ABOVE HER, WE SEE THE MAN SILHOUETTED AS HE BEGINS\n\tTO WALK ALONG LIKE A CAT ON A GARDEN WALL, ABLE TO SEE ON\n\tBOTH SIDES INTO WHATEVER ROOMS HE IS PASSING.\n\n\tHE DROPS OFF THE WALL FOR A MOMENT INTO HER BEDROOM.\n\tINTERCUT MAN AND HELEN.  HE LOOKS FOR HER, PRODS THE BED\n\tCOVERS.\n\n\tTHEN LEAPS BACK UP TO THE TOP OF THE WALL.\n\n\tSHE TAKES A VASE AND THROWS IT OVER THE WALL INTO THE\n\tADJACENT ROOM.  THE MAN'S FIGURE DOESN'T EVEN SLOW, HE'S\n\tALREADY FIGURED IT OUT:  HE LEAPS CLEAR ACROSS AN OPENING\n\tONTO THE WALL THAT LEADS DIRECTLY TO HER.\n\n\tSHE HITS THE REMOTE:  THE CURTAINS SWEEP OPEN, AND MORE LIGHT\n\tCOMES IN NOW FROM THE STREET.\n\n\tCLOSE, THE MAN: HIS FACE TURNS TO THE LIGHT: FROM THIS HIGH\n\tANGLE WE AND WE SEE DOWN INTO THE STREET, WHERE\n\n\tRUBEN'S CAR SCREECHES TO A STOP.  RUBEN charges into the\n\tbuilding.\n\n\tBURT, COMING AWAKE, FOLLOWS RUBEN up the stairs three at a\n\ttime.\n\n\tHALLWAY AND APARTMENT DOOR:  THE MAN COMES RACING OUT AND\n\tTURNS TOWARD THE STAIRS, JUST AS RUBEN REACHES HELEN'S\n\tFLOOR.  THE MAN TRIES TO DO A 180, BUT RUBEN THROWS A BODY\n\tBLOCK AND THE MAN FALLS BACK INSIDE THE APARTMENT.\n\n\tLIGHT FROM HALL GIVES US OUR FIRST LOOK AS RUBEN TEARS THE\n\tBALACLAVA OFF HIS FACE.  He is a middle-aged Afro-Asian with\n\ta knife-scarred face.\n\n\t\t\t\tMAN\n\t\tI can explain!\n\n\t\t\t\tRUBEN\n\t\tThe fuck you can!\n\t\t\t(shouts)\n\t\tHelen!  Are you okay?  HELEN!\n\n\tThen he sees her.  In shock, she stares down at the MAN.\n\n\t\t\t\tRUBEN\n\t\tDid this animal touch you?\n\n\tShe shakes her head, turns and runs out of the room, as\n\tRUBEN catches sight of BURT.\n\n\t\t\t\tRUBEN\n\t\tTurn on a light and call in the\n\t\tunit.  NOW!\n\n\tBURT rushes to okay.  RUBEN FRISKS THE MAN.\n\n\t\t\t\tMAN\n\t\tNo gun!\n\n\t\t\t\tRUBEN\n\t\tBullshit's gonna get your balls\n\t\tstomped on!  What's your name?\n\n\t\t\t\tMAN\n\t\tChow.  Conrad Chow.\n\n\tThe improbability of this name makes RUBEN deliver an angry\n\tkick to the man's side.\n\n\t\t\t\tMAN\n\t\tSwear to God!  Conrad Chow.  Never\n\t\tcarry a gun.\n\n\t\t\t\tBURT\n\t\tBackup's here...\n\n\t\t\t\tRUBEN\n\t\t\t(to Burt)\n\t\tThen you get your ass outta here, I\n\t\tdon't wanta see you again...\n\n\t\t\t\tCONRAD\n\t\tI brought a present for the lady,\n\t\tthere.  I'm looking for her, to give\n\t\ther the present...\n\n\t\t\t\tRUBEN\n\t\tYou break into her apartment to\n\t\tdeliver a gift?  Where is it?\n\n\t\t\t\tCONRAD\n\t\tThe door was open, swear to God,\n\t\tI'm just looking for her when you\n\t\tcome charging up the stairs...\n\n\t\t\t\tRUBEN\n\t\tWhere is it?\n\n\t\t\t\tCONRAD\n\t\tI'm trying to tell you.  It's on the\n\t\tlady's pillow...\n\n\tRuben shoves Conrad into Backup Cop's hands.\n\n\tINT. BEDROOM - CONTINUOUS\n\n\tRuben comes running in, sees a parcel lying on pillow... \n\tscoops it up, and rips it open.  It's a book.  He returns\n\tto Conrad, who is now surrounded by police.  Ruben holds the\n\tbook up like a question.\n\n\t\t\t\tCONRAD\n\t\tDaryll Lee Cullum, he wrote that\n\t\tbook, he wanted the lady to have\n\t\tit.  They won't let him send it to\n\t\ther, so I'm getting out, he asks me\n\t\tto deliver it in person, he says,\n\t\tput it on her pillow.  It has all\n\t\tabout how he tried to kill her.\n\n\t\t\t\tRUBEN\n\t\tHe told you she was loaded, any-\n\t\tthing you could steal you could\n\t\tkeep, Conrad?  You bought yourself\n\t\ta return ticket to Quentin,\n\t\tbreaking and entering.\n\n\t\t\t\tCONRAD\n\t\tThe door was already open...\n\n\t\t\t\tRUBEN\n\t\tWe know...\n\t\t\t(to a cop)\n\t\tSend the book to evidence...\n\n\t\t\t\tCONRAD\n\t\tShe's supposed to have it.\n\n\t\t\t\tRUBEN\n\t\tShe don't want it.\n\n\tINT. HELEN'S BATHROOM - NIGHT\n\n\tHELEN is sitting on the floor, her knees pulled up to her\n\tchest.\n\n\t\t\t\tRUBEN (V.O.)\n\t\tHelen?  Open the door.  The guy's\n\t\tnothing.  A burglar.\n\n\tShe sits there, says nothing.\n\n\t\t\t\tRUBEN (V.O.)\n\t\tOpen the door.  Please.\n\n\t\t\t\tHELEN\n\t\tWhy don't you shoot off the lock?\n\n\tShe starts to laugh.  The sound is awful.  After a moment,\n\tshe gets up on wobbly legs and opens the door.  RUBEN takes\n\ther to the sink, sort of sits her down on it.  Wets a\n\twashcloth, goes to sponge off her face.  She is trembling.\n\n\t\t\t\tHELEN\n\t\tHe was in my apartment!\n\n\t\t\t\tRUBEN\n\t\tI know, baby.  I know.\n\n\tWithout warning, in some sort of manic phase of a freak-out,\n\tshe breaks away from him, ricochets through bedroom, down\n\tthe hallway, RUBEN follows, tries to put his arms around\n\ther.\n\n\t\t\t\tRUBEN\n\t\tIt's okay... you're safe with me!\n\n\tHe pulls her down into a chair with him, his arms tight\n\taround her, holding her still.  He smoothes her hair, rubs\n\ther neck, pets her like a frightened and resistant cat.\n\n\t\t\t\tRUBEN\n\t\tWhen I was a little kid, and I'd be\n\t\tin a state, my father would hold me\n\t\ton his lap, until all the fight\n\t\twould go out of me...\n\n\tShe breaks free and whacks him across his nose.\n\n\t\t\t\tHELEN\n\t\tYou think you're my Daddy?\n\n\tThere is something so perverse about this, so erotic, that\n\tRUBEN kisses her.  She goes limp, kisses him back, then\n\tshe's suddenly sobbing.  His nose is bleeding, but she's\n\tsmiling.  Something between them has finally connected.\n\tBeen agreed upon.\n\n\t\t\t\tRUBEN\n\t\tHelen...honey, you know I gotta go.\n\n\tHe digs out his sneaky gun from whenever he keeps it.\n\n\t\t\t\tRUBEN\n\t\tYou know how to use this?\n\n\t\t\t\tHELEN\n\t\tThey taught me at the FBI.  I was\n\t\tvery good at it.  It scared me... I\n\t\tliked it.\n\n\t\t\t\tRUBEN\n\t\tYou take it, hang on to it, it'll\n\t\tmake you feel safer.  Stay put.\n\n\t\t\t\tHELEN\n\t\tWhat else?\n\n\tHe goes.\n\n\tA SONG BEGINS, PRELAPPING THE FOLLOWING SCENES:  \"MURDER BY\n\tNUMBERS\" BY THE POLICE...\n\n\t\t\"Once that you've decided on a killing\n\t\tFirst you make a stone of your heart\n\t\tAnd if you find that your hands are still willing\n\t\tYou can turn murder into an art...\"\n\n\tHELEN OPENS THE WEAPON, SEEMINGLY COMPETENT ENOUGH TO HANDLE\n\tIT WELL, AND EMPTIES OUT THE BULLETS.  SHE LOCKS IT UP AND\n\tHEAVES A SIGH OF RELIEF.\n\n\tTHE SONG CONTINUES...\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tEXT. POLICE STATION - DAY\n\n\tTHE FBI ARRIVES.  High angle, looking down: three identical\n\tcars draw in front, park with military precision: all four\n\tdoors on the all three cars open at the same time and\n\tidentically dressed men, in suits, get out, slam the doors\n\tin sync., and march toward the front steps to HQ, ignoring a\n\tcouple of bemused cops smoking on the sidewalk...\n\n\tINT. POLICE HQ - CONTINUOUS\n\n\tAs the parade of FBI, led by their Commander SAKS, walk down\n\tthe corridor from the front door, toward CAMERA, performing\n\ta smart right angle turn, and (CAMERA PANNING TO FOLLOW)\n\tcontinue away from CAMERA down another corridor.  Through\n\tthe glass partitions and in the halls they pass cops who\n\tpretend they aren't looking at them: no eye contact between\n\tcops and FBI.  The cops are at ease; bellies slop over\n\tbelts; neatly pressed blouses strain over breasts; sweat\n\tstains; shirtsleeves.  The marching men wouldn't sweat.\n\n\tQUINN emerges from his office and sees them arriving.  He\n\tgets his jacket off a hook on the back of the door, signals\n\ta few top officers to follow.  He looks resigned...\n\n\tINT. TASK FORCE ROOM - DAY (LATER)\n\n\tM.J., RUBEN, NIKKO, and a number of other officers are being\n\taddressed by SAKS, an FBI agent.  At the back are three more\n\tFBI AGENTS, suited and tied.  QUINN stands off to one side.\n\tTHE SONG IS JUST ENDING, ON A CD PLAYER IN THE ROOM.  A\n\tprojector beams up a copy of the note RUBEN found in the\n\tphone booth.\n\n\t\tDr. Hudson:  Don't lose your head.\n\t\t\"Once that you've decided on a killing\n\t\tFirst you make a stone of your heart\n\t\tAnd if you find that your hands are still willing\n\t\tYou can turn murder into an art.\n\t\tWell, if you have a taste for this experience\n\t\tYou're flushed with your very first success\n\t\tThen you must try a twosome or a threesome\n\t\tBefore your conscience bothers you much less.\n\t\tThen you can join the ranks of the illustrious\n\t\tIn history's great dark hall of fame\n\t\tAll of our greatest killers were industrious\n\t\tAt least the ones that we all know by name.\"\n\n\tSAKS speaks...\n\n\t\t\t\tSAKS\n\t\tHello.  I am (research title)\n\t\tMeryhew Saks.  The song is called\n\t\t\"Murder By Numbers.\"  The\n\t\tperformers are a group called The\n\t\tPolice.  Adam here...\n                ... from Behavioral Science is\n\t\tworking out exactly what this\n\t\tperpetrator is trying to telegraph\n\t\tin the note.  This is an extremely\n\t\tcomplex case, and we have a lot of\n\t\tfancy theories floating around.\n\t\tWe're not ruling out the possib-\n\t\tility of three Copycat serial\n\t\tkillers.  We have Quantico working\n\t\ton graphology, the Washington lap\n\t\tis cloning DNA from the secretor.\n\t\tIt's our feeling that the best lead\n\t\twe have is the two sperm samples in\n\t\tone of the victims.  We have a team\n\t\tsweeping sperm banks.  Now I want\n\t\tto say a few word to you local\n\t\tpeople.  Your Commissioner asked\n\t\tfor our assistance.  The Bureau\n\t\tdoes not send us in on these cases\n\t\tto lord it over the local police.\n\t\tWe couldn't catch up on what you\n\t\tpeople know if we had a year.  We\n\t\thave nation-wide resources and hard\n\t\tstate of the art forensic science;\n\t\tyou have the local savvy.  Together\n\t\twe can be unbeatable.  Which one is\n\t\tInspector Halloran?\n\n\t\t\t\tM.J.\n\t\tOver here.\n\n\tSAKS approaches M.J., guides her away from the others.\n\tTWO SHOT:  Saks is unctuous and insincere, self-confident.\n\n\t\t\t\tSAKS\n\t\tWe don't see too many lady homicide\n\t\tdetectives.  You have my respect.\n\t\tHave you discussed the note with\n\t\tDr. Hudson?\n\n\t\t\t\tM.J.\n\t\tSomeone broke into her place last\n\t\tnight.  It wasn't connected to our\n\t\tcase, but it shook her up pretty\n\t\tbad so I haven't...\n\n\tQUINN joins them, SAKS gives him a nod.\n\n\t\t\t\tSAKS\n\t\tI was just about to advise the\n\t\tInspector here not to show Dr.\n\t\tHudson the note.\n\n\t\t\t\tM.J.\n\t\tSir, Doctor Hudson and I see a\n\t\tpattern develop...\n\n\t\t\t\tSAKS\n\t\t\t(riding over her)\n\t\tWe know Helen.  She's not exactly a\n\t\tcredible collaborator.  Especially\n\t\tlate in the day...\n\n\t\t\t\tM.J.\n\t\tShe takes tranquilizers her doctor\n\t\tprescribes.\n\n\t\t\t\tSAKS\n\t\tWho prescribes the brandy?\n\n\tM.J.'S look makes SAKS smile.  QUINN is called to the phone.\n\n\t\t\t\tM.J.\n\t\tHow come you're so up on Dr.\n\t\tHudson?\n\n\t\t\t\tSAKS\n\t\tShe is a writer, writing best\n\t\tselling books about serial killing.\n\t\tGiving lectures she's well-paid\n\t\tfor.  Her interests are not the\n\t\tinterests of law enforcement.\n\n\t\t\t\tM.J.\n\t\tOkay.\n\n\t\t\t\tSAKS\n\t\tWe've put a tap on Dr. Hudson's\n\t\tphone.  I know you won't mention\n\t\tit.\n\n\tSo much for any trusting relationship, right?  QUINN has\n\tarrived, addresses SAKS.\n\n\t\t\t\tQUINN\n\t\tSorry to interrupt.  I need a word\n\t\twith my officer...\n\n\tHe turns to M.J.  Diplomatically, SAKS moves away.\n\n\t\t\t\tQUINN\n\t\tM.J., I'm going to have to borrow\n\t\tRuben.  The alien-smuggling thing\n\t\tin Chinatown is going down tomorrow\n\t\tnight and Jack's kid got hit by a\n\t\tcar.  I gotta give Ruben to Nikko.\n\n\t\t\t\tM.J.\n\t\tWhat does this mean?  Now we got\n\t\tthe FBI, my team is expendable?\n\t\tI'm working my ass off, is anybody\n\t\tlistening?  Why Ruben, anyway?  He\n\t\tand Nikko don't even get on\n\t\ttogether...\n\n\t\t\t\tQUINN\n\t\tTeach both of them a lesson in\n\t\tcooperation and self-discipline.\n\n\t\t\t\tM.J.\n\t\tIf this is a first step in kicking\n\t\tme off the case, just tell me, to\n\t\tmy face, sir, don't waste time\n\t\tbeing diplomatic.\n\n\t\t\t\tQUINN\n\t\tJust, I need results.  And -- I am\n\t\tshort-handed.  Who else am I gonna\n\t\tgive him?\n\n\t\t\t\tM.J.\n\t\t\t(looking at Saks)\n\t\tGive him thatpompous son of a\n\t\tbitch.\n\n\tShe turns and leaves, brushing past Saks as she goes... Gigi\n\tmeets her...\n\n\t\t\t\tGIGI\n\t\tLab called.  They got a result on\n\t\tthe drug test you requested...?\n\n\tIt takes a moment to remember what it was...\n\n\t\t\t\tGIGI\n\t\tThey said it was Windex?\n\n\tIf there was any residual doubt about what's happening, it's\n\tgone now.  She starts after Quinn, sees he is in spirited\n\tdialogue with SAKS and decides to wait.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. HELEN'S LIVING ROOM - DAY\n\n\tHELEN and M.J.  Helen unfolds a xerox copy of the note, that\n\tM.J. has just given her.\n\n\t\t\t\tHELEN\n\t\t...\"I'll be back...\"\n\n\tAs she looks at the back of the note... she looks up into\n\tM.J.'S face.\n\n\t\t\t\tM.J.\n\t\tYeah.  Addressed to you.  \"Don't\n\t\tlose your head.\"\n\n\tHelen puts down the note.  She is holding herself together\n\tby main will power... doesn't want to face that note...\n\n\t\t\t\tHELEN\n\t\tThey put  Merry Saks on it?!\n\n\t\t\t\tM.J.\n\t\tHe said to send you his regards and \n\t\tto tell you that the Bureau holds\n\t\tyou in the highest esteem.\n\n\t\t\t\tHELEN\n\t\tWhat I can't believe is that in an\n\t\tearlier life I slept with him!\n\t\tChrist!  Any God that loved his\n\t\tpeople would give women a rewind on\n\t\ttheir life and an erase button.\n\t\t\t(looks at M.J.)\n\t\tJust give me a minute here.  The\n\t\tletter is addressed to me...\n\t\t\t(she's breathing\n\t\t\t fast, controls it)\n\t\tYou don't feel fear, do you?\n\t\tYou're young.  You feel like you'll\n\t\tlive forever.  How wonderful.\n\n\t\t\t\tM.J.\n\t\tI put my ass on the line, giving\n\t\tyou that.\n\n\t\t\t\tHELEN\n\t\tThey weren't going to show it to\n\t\tme?!  The arrogance!  It's my life!\n\n\t\t\t\tM.J.\n\t\tIt's also the major piece of\n\t\tevidence, and it makes you a key\n\t\tpart of his plan.  You can't run\n\t\taway from it anymore.\n\t\t\t(beat)\n\t\tLook at the order he's doing\n\tthem... He did three as the Boston\n\t\tStrangler just to tell us a copycat\n\t\tserial killer was at work.  Then he\n\t\tdid one like the Hillside Strang-\n\t\tler.  And then one as Son of Sam.\n\t\tTo lead us on -- to where and what\n\t\tend?  And he's doing more than that\n\t\t-- he's imitating each killer's\n\t\tmethod as closely as he can -- in\n\t\tdetails.  Injecting Windex.  Using\n\t\t.44.  Playing Abba.\n\n\t\t\t\tHELEN\n\t\tIt's not chronological: Son of Sam\n\t\twas before Hillside.\n\n\tShe begins to read.\n\n\t\t\t\tM.J.\n\t\tIt's clear he thinks he knows me.\n\t\tHe lives a fantasy.  'Helen, don't\n\t\tlose your head.'  Is that a threat?\n\t\tDoes he want to cut off my head?\n\t\tDahmer cut off heads.  Who else?\n\t\tKemper.  Did Gacy?  Rivkind?  I\n\t\tthink Rivkind did.\n\n\tShe puts the note down on the table, smoothes it out.  She\n\tcloses her eyes for a moment.  We begin to see certain\n\tfiltered images.  As they come, we INTERCUT them.\n\n\t\t\t\tHELEN\n\t\tHe attacks what he feels he can't\n\t\thave.  What he feels excluded\n\t\tfrom...\n\n\tEXT. UNIVERSITY CAMPUS - DAY\n\n\tLush, pastoral green.  We see PETER sitting by himself.  He\n\twears a WHITE LAB COAT, like one we saw hanging in his\n\tbasement.\n\n\tHIS POV:  of students on the green, playing Frisbee,\n\tstudying together, picnicking.  Women sunbathe, their straps\n\tpulled down on their shoulders, their tops rolled up to\n\texpose their midriffs.\n\n\t\t\t\tHELEN (V.O.)\n\t\t'First you make a stone of your\n\t\theart.'... Oh yes!  He doesn't\n\t\tsuffer.  That's past.  Now it's our\n\t\tturn.\n\n\tOne of the sunbathing girls sits up and looks round, then\n\ttakes her top off entirely.\n\n\t\t\t\tHELEN (V.O.)\n\t\tKemper said in order to have the\n\t\texperience he wanted with them, he\n\t\tneeded to evict them from their\n\t\tbodies.  By making the body a\n\t\tcompletely passive object, he\n\t\treleases himself from passivity.\n\n\tCLOSE:  HELEN, DEEP IN THOUGHT...\n\n\t\t\t\tHELEN\n\t\tBut the relief he feels is only\n\t\ttemporary.  '...Before your\n\t\tconscience bothers you much\n\t\tless...'  But the tension always\n\t\tcomes back.\n\t\t\t(she now picks out\n\t\t\t the words:)\n\t\t'You can join the ranks of the\n\t\tillustrious...'  He wants to be\n\t\tlike them.  The best.  To become\n\t\tthe best.  But, he has his own\n\t\tdesires, his own compulsions apart\n\t\tfrom theirs.'  His own horrors...\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tFLASHBACK: PETER'S CHILDHOOD HOME - DAY\n\n\tAn incremental flash of a SMALL BOY standing by his bed\n\twhich he has wet.  His pajamas are soaked.  His powerful\n\tMOTHER grabs him by the hair and drags him with her.\n\n\t\t\t\tHELEN (V.O.)\n\t\tSome horrors that are all his\n\t\town...\n\n\tThe SMALL BOY is flung into an under-stairs closet where\n\tfirewood and stacked papers are kept.  The door is slammed\n\thard.  He gropes around in the darkness, finds a big box of\n\tmatches, lights one.  Then, angrily, he sets fire to a pile\n\tof newspapers.  They start to burn.  We see, but do not,\n\thear, his screams for help.\n\n\t\t\t\tHELEN (V.O.)\n\t\tHe needs to prove they don't\n\t\tcontrol him, that he's the one in\n\t\tcontrol.  But the feeling of power\n\t\tnever lasts.  He can control his\n\t\tvictims, but he can't control\n\t\tanything else... his place in the\n\t\tworld.  He want s to be recognized.\n\t\tHe puts messages in my computer; he\n\t\tsends me a letter...\n\n\tINT. HELEN'S APARTMENT - DAY\n\n\tShe picks out the lines... \"then you must try a twosome or a\n\tthreesome.\"\n\n\t\t\t\tHELEN\n\t\tOf course he wants to do a\n\t\tthreesome!  Only Bundy did three in\n\t\tone day.  Is Bundy next?  But Bundy\n\t\tshould be last... the grand finale.\n\t\tWhat about Kemper and Ramirez?\n\t\tGacy, Dahmer, Williams?  Rivkind?\n\t\tWho else is on his list?  In what\n\t\torder?\n\n\tEXT. CITY STREET - DAY\n\n\tPETER in his car.  Ahead, he see TWO GIRLS at a bus stop.\n\tWe see PETER take a long bladed-knife and carefully conceal\n\tit under his right thigh.  The TWO GIRLS are wearing\n\tbackpacks.  'FESTIVAL OF LOVE' stickers decorate the bags.\n\tPETER pulls his nondescript sedan up to them and says\n\tsomething.  They giggle, shake their heads.  He laughs,\n\tholds up his hands to level of his shoulders in a 'Not\n\tguilty!' gesture, then makes a peace sign.  The girls giggle\n\tagain, but do not get in.\n\n\tPETER drives off.\n\n\tINT. HELEN'S APARTMENT - DAY\n\n\t\t\t\tHELEN\n\t\t'...great dark hall of fame... all\n\t\tour greatest killers...'  His\n\t\tgreatest heroes?  He wants to be\n\t\tfamous.  When they're caught and\n\t\tpeople like me write about them, we\n\t\tgive them a kind of immortality.\n\t\tThey get thousands of letters.\n\t\tRamirez kills eight women and gets\n\t\ta hundred marriage proposals a\n\t\tmonth.  They're like film stars.\n\n\t\t\t\tM.J.\n\t\tThey get fan letters...\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. PRISON - DAY WARDEN FELIX MENDOZA IN HIS OFFICE\n\n\t\t\t\tFELIX\n\t\tWe keep records of any threatening\n\t\tor illegal correspondence, like\n\t\trelatives of victims who might want\n\t\tto send the condemned man some\n\t\tstrychnine cookies.  So it's only a\n\t\tpartial list, but you're still\n\t\tlooking at about forty pages...\n\n\tMONTAGE OF PICTURE AND SOUND:  WE BEGIN TO SEE MOVING LISTS\n\tOF NAMES -- LIKE SCHINDLER'S LIST -- SUPERIMPOSED OVER THE\n\tSHORT SNIPPETS OF SCENES... A WATERFALL OF NAMES...\n\n\tINT. HELEN'S OFFICE\n\n\tINSERT FAX MACHINE:  LISTS OF NAMES BEING EXCRETED.\n\n\t\t\t\tHELEN (V.O.)\n\t\tWould you fax those pages to me?\n\n\tINT. TASK FORCE ROOM - DAY\n\n\tM.J. on the phone.  On the desk in front of her, is a list\n\tof killers, complementary to HELEN'S.\n\n\t\t\t\tM.J.\n\t\tThank you for your help, Warden\n\t\tHillyer.  As soon as you can.\n\n\tShe hangs up as GIGI puts a long fax sheet of names on\n\tM.J's desk.\n\n\t\t\t\tGIGI\n\t\tHot off the fax.  Mr. Rivkind's\n\t\tfans.\n\n\tM.J. doesn't look at the Rivkind list, just crosses his name\n\toff the killer list and picks up the phone, dials, waits.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. HELEN'S OFFICE - LATE AFTERNOON\n\n\tCLOSE:  FAX OF A LIST OF NAMES AND ADDRESSES IS SCANNED BY A\n\tSCANNER; UNIQUE SOUND OF SCANNER AND FLASHING LIGHTS.\n\tANOTHER PAGE IS SCANNED IN.\n\n\tCOMPUTER SCREEN: CALERA WORDSCAN: SAME PAGE APPEARS AND IS\n\tREAD BY COMPUTER (A FILM OF COLOR MOVES OVER THE PAGE\n\tSHOWING AREA SCANNED.)  PAGE THEN REAPPEARS WITH ERRORS\n\tMARKED BY COLOR;\n\n\tON SCREEN THE NAMES AND ADDRESSES SCROLL BY -- THERE ARE\n\tHUNDREDS, MAYBE THOUSANDS OF NAMES... IMPOSSIBLE TO READ AND\n\tCOMPARE...\n\n\tA COMPUTER SCREEN MIXES WITH THIS: -- BOOLEAN SEARCH TERMS\n\tBEING TYPED IN, MEANING \"LOOKING FOR LAST NAMES, IGNORING CASE,\n\tOCCURRING ON MORE THAN ONE LIST, AND/OR MORE THAN ONCE,\n\tCOUNT NUMBER OF HITS.\"\n\n\tTHE COMPUTER SCREEN SCROLLS NAMES FASTER AND FASTER, EVERY\n\tONCE IN WHILE HALTING A SPLIT SECOND ON A NAME, AND\n\tRESUMING.  SUPERIMPOSED IS A FLASHING LEGEND:\n\n\tPLEASE WAIT.  DO NOT TOUCH KEYS OR SEARCH DATA WILL BE LOST.\n\n\t\t\t\tHELEN (V.O.)\n\t\tIf we keep going and work till\n\t\tmidnight...\n\n\t\t\t\tANDY (O.S.)\n\t\tSorry, Luv.  I've got a date.\n\n\t\t\t\tHELEN (O.S.)\n\t\tYou've got a date right here, Andy.\n\t\tThis has got to...\n\n\tWE NOW SEE ANDY is feeding the scanner, he has a thick sheaf\n\tof faxed lists...\n\n\t\t\t\tANDY\n\t\tIt's almost six.  And guess what?\n\t\tHall likes me bathed and shaved.\n\n\t\t\t\tHELEN\n\t\tStop acting like a silly little\n\t\tfag!\n\n\tHis eyebrows arch, but his smile stays in place.\n\n\t\t\t\tANDY\n\t\tMy life to live, darling, try to\n\t\tremember what it was like way, way\n\t\tback when you were young and sexy\n\t\tand alive.\n\n\tHe gets up and walks toward the door.\n\n\t\t\t\tHELEN\n\t\tYou bastard!\n\n\t\t\t\tANDY\n\t\tBut alive!\n\n\tTHE DOOR SLAMS (O.S.)  HELEN angrily hits the keys:\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tTHE ENDLESS LIST FLOWS LIKE MUDDY WATER ACROSS THE SCREEN...\n\n\tHELEN -- HER FACE REFLECTS THE SCROLL OF NAMES (AS THOUGH\n\tTHEY WERE PROJECTED ON HER FACE IN REVERSE.)  SHE IS TOTALLY\n\tFOCUSSED, BUT NERVOUS; SHE LIGHTS A CIGARETTE AS\n\n\tCAMERA DOLLIES IN CLOSER AND CLOSER TO HER EYES AND THEN TO\n\tONE EYE ONLY UNTIL THE EYE, THE IRIS AND FINALLY THE PUPIL\n\tFILL THE SCREEN:  IN THEM IS REFLECTED THOSE NAMES POURING\n\tPAST IN THEIR THOUSANDS, UNTIL WE HEAR A GASP.  A KEYSTROKE\n\tOFFSTAGE, AND THE NAMES STOP: ANOTHER KEYSTROKE AND ONE NAME\n\tAMONG THEM ALL SUDDENLY FREEZES IN HER PUPIL:\n\n\tPETER KURTEN\n\n\t\t\t\tHELEN (V.O.)\n\t\tThe dirty bastard!  More games!\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. HELEN'S APARTMENT - DAY\n\n\tM.J. is entering at front door, let in by a new Guard FRED.\n\n\t\t\t\tHELEN (O.S.)\n\t\tIt's not a real name: it's the name\n\t\tof a mass murderer in Germany in\n\t\tthe 1930s.  They called him the\n\t\tMonster of Dusseldorf.\n\n\tM.J. is turning into the Office; she carries a portfolio of\n\tlists of her own.\n\n\t\t\t\tHELEN\n\t\tLet's speed up the game plan...\n\t\tcall all the living serials to ask\n\t\tif they've had contact with a Peter\n\t\tKurten.  We could use some help on\n\t\tthe phones...\n\n\t\t\t\tM.J.\n\t\tThey're not talking to me.  Saks\n\t\tlooks right through me.  I ask him\n\t\tfor some bodies, for the phones --\n\t\the's so encouraging: \"you make that\n\t\tyour little job.\"  Condescending\n\t\tbastard.\n\t\t\t(careful)\n\t\tHelen, on your lists to call is San\n\t\tQuentin.  Daryll Lee Cullum?\n\n\t\t\t\tHELEN\n\t\t\t(beat)\n\t\tYou do that one, I don't want it...\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. SAN QUENTIN WARDENS' OFFICE\n\n\t\t\t\tMITCHELL\n\t\tSergeant Halloran is it?  I've\n\t\tgot a list of Daryll Lee's\n\t\tcorrespondents.  There is a\n\t\tPeter Kurten among them.\n\t\tDaryll Lee claims he has\n\t\tinformation about Kurten, but\n\t\the'll only talk to Dr. Hudson\n\t\tpersonally.  Nobody else.  The\n\t\tcreep's been studying his\n\t\tamendments.  My guess is he\n\t\tdoesn't have zip.  Just\n\t\tangling for a chance to ask if\n\t\ther bra size is still the\n\t\tsame.  We get this shit all\n\t\tthe time, but it's her call.\n\n\t\t\t\tM.J.\n\t\tThanks, Warden.\n\t\t\t(determined)\n\t\tShe'll talk to him.\n\n\tINT. HELEN'S OFFICE - NIGHT\n\n\tHELEN, M.J.  They are waiting, Helen tense, smoking,\n\tatmosphere charged...\n\n\t\t\t\tM.J.\n\t\tDo those things really help?\n\n\tLike she really wished they might, so she could have one.\n\tHelen looks at her cigarette as though she'd never seen one\n\tbefore... grinds it out...\n\n\t\t\t\tHELEN\n\t\tNot a damn bit...\n\n\tAnd unconsciously lights another during following...\n\tPHONE RINGS.  M.J. PICKS IT UP, LISTENS, HANDS IT TO HELEN...\n\tGestures encouragement; fist in victory gesture...\n\n\t\t\t\t\t\t\tINTERCUT TO:\n\n\tINT.  PENITENTIARY INTERVIEW ROOM\n\n\tDARYLL LEE CULLUM is on the phone, a Warden is attendance,\n\tbut not on the phone line.  On this rare contact with the\n\toutside world HE IS MANIC...\n\n\t\t\t\tDARYLL LEE\n\t\tHey, Doc!  How you doing?\n\n\tShe turns on speakerphone.\n\n\t\t\t\tHELEN\n\t\tHello, Daryll Lee.\n\n\t\t\t\tDARYLL\n\t\tYou read my book which as you know,\n\t\thit the stands a couple of weeks\n\t\tago.  You read it yet.\n\n\t\t\t\tHELEN\n\t\tWhat book?\n\n\t\t\t\tDARYLL\n\t\t\t(indignant)\n\t\tI sent it by private courier, he\n\t\tdidn't give it to you?  That son of\n\t\ta gun...!\n\n\tHelen looks at M.J., who indicates 'tell you later.'\n\n\t\t\t\tHELEN\n\t\tI'll look for it, Daryll Lee.\n\n\t\t\t\tDARYLL\n\t\tBet you never figured I'd follow in\n\t\tyour footsteps.  It's real well-\n\t\twritten.  You should read it --\n\t\tyou're in it.\n\n\t\t\t\tHELEN\n\t\tI will.  I'll call you, Daryll, and\n\t\ttalk to you about it after I've\n\t\tread it.  Right now I have a\n\t\tquestion... Peter Kurten.\n\n\t\t\t\tDARYLL\n\t\tKurten!  Is he bothering you?  I\n\t\ttold that son I'd send him what he\n\t\twanted if he leave you alone.\n\n\t\t\t\tHELEN\n\t\tAh ha.  What did he want?\n\n\t\t\t\tDARYLL\n\t\tSomething personal.  Is he bothering\n\t\tyou?\n\n\t\t\t\tHELEN\n\t\tI don't know.  I'd like to know\n\t\twhere he is.\n\n\t\t\t\tDARYLL\n\t\tListen, you want my advice?  Steer\n\t\tclear.  He's writing me he's gonna\n\t\tfinish 'my unfinished symphony.'\n\t\tHe's gonna give me $550 for some of\n\t\tmy cum, he says he's in a position\n\t\tto see that I will be immortal if\n\t\the has some of my spunk.  I'm\n\t\toffended.  Right away I smell\n\t\tfreak.  Writin' about him and me\n\t\tand you bein' joined and he's gonna\n\t\tfinish my symphony?  I didn't care\n\t\tfor his drift.  I sent some liquid\n\t\tsoap in a sandwich baggie with a\n\t\tmessage from Jesus to mend his\n\t\tways.  You hear I found Jesus?  And\n\t\twhat's funny is, now I don't mind\n\t\tbein' inside.  If I was out, even\n\t\tBorn Again, I'd probably get\n\t\trestless again.  It's maybe better\n\t\tI stay here, what do you think?\n\n\t\t\t\tHELEN\n\t\tI think whatever is best for you,\n\t\tDaryll.  And maybe you're right,\n\t\tthat's the place.\n\n\t\t\t\tDARYLL\n\t\tYou come and visit.\n\n\t\t\t\tHELEN\n\t\tWhere did you send the message to\n\t\tPeter Kurten?\n\n\t\t\t\tDARYLL\n\t\tDamn!  I gave that to Conrad, too!\n\t\tThat guy!  I told Conrad deliver to\n\t\tKurten and keep the 500 bucks in\n\t\treturn for getting my book to you.\n\n\tAt this mention of Conrad, M.J. leaps to another phone...\n\n\t\t\t\tHELEN\n\t\tHow was Conrad supposed to find\n\t\tKurten?\n\n\t\t\t\tDARYLL\n\t\tConrad has the phone number.\n\t\tConrad, where is he?\n\n\t\t\t\tHELEN\n\t\t\t(from M.J.'s pantomime)\n\t\tIn jail.\n\n\t\t\t\tDARYLL\n\t\tThat Klutz.  They send him back\n\t\there, I'll kick his ass good.\n\n\t\t\t\tDARYLL LEE\n\t\tHelen, how is life, you okay?  Come\n\t\tsee me, talk to me.  I think about\n\t\tyou, worry about you all the time.\n\t\tI am so glad Jesus didn't let me\n\t\tkill you.  You know -- you're\n\t\tblessed by Jesus.  That's why you\n\t\tneed to come talk to me, because\n\t\tJesus kept you alive for a reason,\n\t\tand I was his sacred instrument...\n\t\tIn the moment Satan was in my heart\n\t\traising my hand to kill you, Jesus\n\t\ttook my hand to spare you.  I am\n\t\tboth death and life to you...\n\n\tHelen hangs up.  M.J. has already left...\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. SQUAD ROOM - NIGHT\n\n\tPandemonium: the Chinatown raid has been carried off and\n\tNIKKO AND RUBEN and a dozen other cops are booking a group\n\tof Chinese gangsters of all ages, and a group of frightened\n\tand confused Chinese illegal aliens.  TOTAL UPROAR.\n\n\tTHROUGH IT, WE MOVE WITH M.J.  SHE PASSES RUBEN WHO IS\n\tGRABBING A CHINESE KID STRUNG OUT ON SOMETHING, OUT OF A\n\tLINE OF SUSPECTS... HE ASIDES:\n\n\t\t\t\tM.J.\n\t\tI brought back a gin-seng popper\n\t\tfor you.  Guaranteed all-night\n\t\torgasms.\n\n\t\t\t\tM.J.\n\t\tSave it for Helen.\n\n\t\t\t\tRUBEN\n\t\t\t(enough already!)\n\t\tWait a minute, wait a goddamn\n\t\tminute...\n\n\tHe manhandles the KID INTO DOCILITY WHILE...\n\n\t\t\t\tRUBEN\n\t\tThe woman was in shock.  She was\n\t\ttotally out on ranks.  I stayed\n\t\tbecause I didn't want her to wake\n\t\tup alone in a place where she'd\n\t\tjust been under attack.\n\t\t\t(to the Kid who is\n\t\t\t restless)\n\t\tStop that, you son of a bitch!\n\t\t\t(back to her)\n\t\tThe place wasn't secure.  I was\n\t\tdoing my goddamn job!  And, for the\n\t\tsecond time, I slept in her living\n\t\troom.\n\n\t\t\t\tM.J.\n\t\tDon't try to lie, Ruben.  You don't\n\t\thave the face for it.  I need you\n\t\tto help interrogate the burglar in\n\t\tHudson's place...\n\n\t\t\t\tRUBEN\n\t\tTalk to Nikko...!\n\n\tSHE MOVES ON TO FIND NIKKO\n\n\tNIKKO sites at his desk, processing the papers for the sullen\n\tYOUNG THUG who is handcuffed to a chain next to NIKKO'S\n\tdesk.  Nikko  unholsters his gun... he shoves it into his\n\tdesk drawer...\n\n\t\t\t\tNIKKO\n\t\tYou speak English?\n\t\t\t(Chinese)\n\t\tYou need an interpreter?\n\n\tQUINN, walking past the ILLEGALS, speaks to GIGI.\n\n\t\t\t\tQUINN\n\t\tI didn't want the Illigals, I wanted\n\t\tjust the bastards dumping them in\n\t\tthe harbor.  What's keeping those\n\t\tbums at Immigration?  Nightmare in\n\t\there...\n\n\tM.J. STANDS OVER NIKKO\n\n\t\t\t\tM.J.\n\t\tI gotta have Ruben, and a...\n\n\tHARROWING SCREAM!!!  ILLEGAL WOMAN IS SCREAMING --\n\tPANDEMONIUM AMONG THE DETAINEES.  COPS RUSH TO CONTROL THE\n\tPROBLEM.\n\n\t\t\t\tNIKKO\n\t\tOutta your mind?  Look at this...\n\n\t\t\t\tM.J.\n\t\t\t(to Quinn)\n\t\tLieutenant...?\n\n\tJust at that moment the kid Ruben was booking goes totally\n\tbananas; M.J. goes to his assistance, wrestling this wild\n\tkid.\n\n\tNIKKO starts from his chair, looking for the key to the\n\tdrawer, but is isn't there... he goes to help Ruben get the\n\tkid under control.  Quinn steps in...\n\n\t\t\t\tM.J.\n\t\tThe prowler in Hudson's apartment\n\t\tturns out to have a meeting with a\n\t\tsuspect...\n\n\t\t\t\tQUINN\n\t\t\t(amazed)\n\t\tYou got a suspect...\n\n\tTHEY MOVE BACK TO NIKKO'S DESK.\n\n\t\t\t\tQUINN\n\t\tHow'd you get in on the deal?\n\n\t\t\t\tM.J.\n\t\tI'm gonna drop charges on the\n\t\tbreak-and-enter at Hudson's...\n\n\t\t\t\tQUINN\n\t\tYou have no authority to make a\n\t\tdeal like that.  That' s for the\n\t\tD.A...\n\n\t\t\t\tM.J.\n\t\tOr the F.B.I.?\n\n\t\t\t\tQUINN\n\t\tSaks.  If he knew you did that!\n\t\tThey're all asking me, 'what is she\n\t\tdoing,' as it is.\n\n\t\t\t\tM.J.\n\t\tGive me Ruben back...\n\n\t\t\t\tQUINN\n\t\tNikko?\n\n\t\t\t\tNIKKO\n\t\tWe get through this shit, let 'em\n\t\tall go.\n\n\tNIKKO has stood and moved the handcuffed THUG toward the\n\tdoor to jail cells.  M.J. checks her time, (WALL CLOCKS HELP\n\tUS HERE:  8:47)\n\n\t\t\t\tM.J.\n\t\tI'll talk to Conrad myself.  I'll\n\t\tbe in the jail when you wind this\n\t\tup...\n\n\t\t\t\tRUBEN\n\t\tI gotta get something to eat, I\n\t\thaven't eaten all day.\n\n\tM.J. goes... RUBEN can't find a desk to work at, and\n\tcommandeers Nikko's.  He slams the KID into NIKKO'S chair\n\tand cuffs him.  KID starts to rattle his chairs, spew\n\tChinese epithets, then bends over the desk and, with his\n\tteeth picks up some paper, tries to shake it to shreds.\n\n\tRUBEN yanks the papers out of the KID'S mouth, pulls the\n\tKID'S chair from the side to the front of the desk, shoves\n\tthe KID into place facing away from the desk, so that he\n\tcan't do any more damage.  Then RUBEN can't figure out where\n\the can work.  At the next desk, where he has been working,\n\tMAC rises.\n\n\t\t\t\tMAC\n\t\tHere... I'm finished...\n\n\t\t\t\tRUBEN\n\t\t\t(to Kid)\n\t\tI'm going to the coffee machine.\n\t\tHold the fort.\n\n\tHe moves off, the KID'S eyes move calculatingly around the\n\troom.  He twists against the cuffs, trying anything to get\n\tfree, and discovers he can pull out the desk drawer.\n\n\tCLOSE UP:  The KID'S FREE HAND rifling through the drawer\n\tbehind his back, finding the gun.  PULL BACK to show the\n\tKID.  He is as Ruben positioned him, his back pressed\n\tagainst the desk.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. CITY JAIL CELL - DAY\n\n\tCONRAD is brought in by a Guard.  Lightly shacked.  M.J.\n\tstands.  Conrad sits.\n\n\t\t\t\tCONRAD\n\t\tWho are you?\n\n\t\t\t\tM.J.\n\t\tInspector Halloran.  Homicide.\n\t\tYou were supposed to contact a\n\t\tPeter Kurten?\n\n\t\t\t\tCONRAD\n\t\t\t(cagey)\n\t\tI was?  How you spell that?\n\n\t\t\t\tM.J.\n\t\tCut the crap.  You got a sheet the\n\t\tlength of my arm...\n\n\t\t\t\tCONRAD\n\t\t\t(interrupting)\n\t\tI never hurt nobody...\n\n\t\t\t\tM.J.\n\t\tShut up -- I'm talking.  You got\n\t\tfelony breaking and entering,\n\t\tburglary, felonious...\n\n\t\t\t\tCONRAD\n\t\t\t(interrupting)\n\t\tI never carried a gun!\n\n\tShe slaps him hard!  He is shocked.\n\n\t\t\t\tM.J.\n\t\tYou don't listen very good.  This\n\t\tbreak in -- I can call it a felony --\n\t\tthree strikes, and you got about\n\t\tsixteen strikes already, and you're\n\t\tin jail for the rest of your life,\n\t\tno parole.  Or I could see it gets\n\t\tforgotten.\n\n\t\t\t\tCONRAD\n\t\tYou get me out first.\n\n\t\t\t\tM.J.\n\t\tDoesn't work that way.  You had your\n\t\tchance, now fuck yourself...\n\n\tShe's walking to the door... Conrad holds out just one more\n\tbeat to see if she's bluffing... her hand is on the door\n\tknob...\n\n\t\t\t\tCONRAD\n\t\tTell me what you want me to say.\n\t\tAnything.\n\n\t\t\t\tM.J.\n\t\tYou were going to make a delivery\n\t\tto Peter Kurten for Daryll Lee\n\t\tCullum.  I want Kurten's phone\n\t\tnumber.\n\n\t\t\t\tCONRAD\n\t\tI don't have it...\n\n\tM.J. starts to open the door...\n\n\t\t\t\tCONRAD\n\t\tWait... wait... I already called\n\t\thim, I threw it away.\n\n\t\t\t\tM.J.\n\t\tYou already made the delivery?\n\n\t\t\t\tCONRAD\n\t\tNo, that's still in my jacket I was\n\t\twearing.  We were supposed to meet\n\t\ton the docks, that number 47 wharf,\n\t\t10 o'clock Friday.  He's gonna hand\n\t\tme 500 bucks.\n\n\t\t\t\tM.J.\n\t\tWhat Friday?\n\n\t\t\t\tCONRAD\n\t\tWhat day is this?  In jail you lose\n\t\ttrack.  This week.  Friday.\n\n\tM.J. is already on her way...\n\n\t\t\t\tCONRAD\n\t\tDon't forget me, please.  I told\n\t\tyou what you wanted -- don't forget\n\t\tme.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tEXT. WATERFRONT - NIGHT\n\n\tDESERTED.  A LONG SHADOW OF A MAN STRETCHES OUT ACROSS THE\n\tDOCK.  IT IS PETER, WALKING LEISURELY FROM THE WATERFRONT\n\tDRIVE TOWARD THE HUGE WATERHOUSE AT THE END OF THE DOCK.  HE\n\tSTEPS INTO THE DEEP SHADOWS AND SEEMS TO VANISH.\n\n\tCLOSE:  PETER.  HE CHECKS HIS WATCH AND TURNS TO WATCH THE\n\tDOCK AND THE SHORE.  HE CAN SEE AND NOT BE SEEN.  HE IS \n\tENTIRELY ALONE NOW.\n\n\tINT. SQUAD ROOM - NIGHT\n\n\tRUBEN takes coffee and doughnuts out of a box, then leans\n\tover the KID who seems to have calmed down.  He uncuffs him\n\tfrom the chair.\n\n\t\t\t\tRUBEN\n\t\tBehave.  You refuse my hospitality,\n\t\tI'm putting you to bed.\n\n\tHe pushes the coffee toward the Kid, who WHIPS NIKKO'S GUN\n\tOUT FROM UNDER THE DESK, where it was hidden, and lays it up\n\tunder Ruben's ear.  KID moves behind RUBEN and puts a skinny\n\tarm around RUBEN'S neck, pulling him upright.  RUBEN still\n\tclutching the doughnut box.  It takes a moment for the\n\tothers to SEE.  Then the room is absolutely motionless.\n\n\t\t\t\tNIKKO\n\t\tTake it easy, Kid.  Nobody's gonna\n\t\tdo anything.  Just let the gun\n\t\tdown, so it don't go off...\n\n\tA CHINESE DETECTIVE REPEATS THE SAME IDEA IN CHINESE...\n\n\t\t\t\tKID\n\t\t\t(screams)\n\t\tNobody comes through the door...\n\n\tBehind the KID, as he backs through the door, across the\n\tcorridor we LOOK STRAIGHT DOWN A CORRIDOR TO WHERE M.J. IS\n\tCOMING ALMOST AT A RUN -- SHE SEES what is happening.\n\n\tThe KID doesn't see her, yet, as he is backing away from the\n\tothers... M.J. DRAWS HER GUN AND STANDS IN FIRING POSITION.\n\n\tIF SHE FIRES FROM HERE RUBEN IS DIRECTLY BEHIND THE KID, AND\n\tOTHER OFFICERS, IN THE LINE THE BULLET WOULD TAKE ARE STILL\n\tSCRAMBLING OUT OF HER LINE... SHE CAN'T FIRE.\n\n\t\t\t\tM.J.\n\t\tHey, you...\n\n\tThe KID turns, sees her, exposing his shoulder to her... SHE\n\tFIRES AND HITS THE KID.\n\n\tHE IS THROWN TO THE FLOOR AND TWISTED AROUND BY THE IMPACT,\n\tLANDING BEHIND RUBEN SO SHE CAN'T MAKE A SECOND SHOT.\n\n\tRUBEN GOES FOR HIS OWN GUN, BUT THE KID'S GUN THAT FELL FROM\n\tHIS HAND IS RIGHT BY HIM STILL.  THE KID GRABS IT AND FIRES\n\tBEFORE RUBEN HAS HIS GUN ALL THE WAY OUT OF HIS HOLSTER.  THE\n\tKID SHOOTS RUBEN IN THE THROAT AT AN ANGLE THAT TAKES THE\n\tBULLET STRAIGHT INTO HIS BRAIN.\n\n\tTHEN THE KID THROWS THE GUN AWAY, AND STANDS, HIS HANDS UP\n\tIN SURRENDER, A GRIN ON HIS FACE.  THIS ENTIRE ACTION HAS\n\tTAKEN ABOUT SIX SECONDS.  THE KID GOES DOWN, FLATTENED BY\n\tBODIES OF THE COPS WHO HAVE RUSHED HIM.\n\n\t\t\t\tKID\n\t\tI'm a juvenile!  I'm a juvenile!\n\n\tM.J. RUSHES TO RUBEN.\n\n\tEXT. WATERFRONT - NIGHT\n\n\tPETER, STANDING AS BEFORE.  CHECKS HIS WATCH, LIGHTS A\n\tCIGARETTE.\n\n\tINT. SQUAD ROOM - NIGHT (LATER)\n\n\tThe KID has been taken away.  PARAMEDICS are removing\n\tRUBEN'S body.  M.J. stands frozen as RUBEN'S stretcher is\n\tcarried out of the room.  Her hand holds the doughnut box.\n\n\tFinally, M.J. blinks, her head turns as if she can't imagine\n\twhat to do, where to go.  Then, suddenly conscious of the\n\tdoughnut box, she clutches it tight against her chest.\n\n\tCLOSE:  M.J.\n\n\tShe abruptly remembers: the rendezvous with Peter Kurten!\n\n\t\t\t\tM.J.\n\t\tGigi!  Dock 47.  I need a couple\n\t\tunits to drag the area...\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tEXT. WATERFRONT - NIGHT\n\n\tWIDE FULL SHOT:  DEEP SHADOWS AND HIGHLIGHTS.  IN THE BLACK\n\tCAVERN OF THE DOCK, FOOTSTEPS BEGIN TO ECHO, THEN OUT OF\n\tSHADOW INTO LIGHT COMES\n\n\tPETER.  HE WALKS AWAY INTO THE NIGHT.  FAR FAR AWAY SIRENS\n\tBEGIN TO SOUND -- THEY'LL BE TOO LATE.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. INTERVIEW ROOM - NIGHT\n\n\tNIKKO sits, numb.  If possible, NIKKO is more devastated than\n\tM.J.  She speaks to NIKKO, but does not look at him.\n\n\t\t\t\tM.J.\n\t\tQuinn will be here any minute.  What\n\t\tare you going to say?\n\n\t\t\t\tNIKKO\n\t\tChrist.  I didn't lock the fucking\n\t\tdrawer!  You spend twenty years\n\t\tthinking some perp's gonna whack\n\t\tyou... you'll crash your car... but\n\t\twhat happens is, you fuck\n\t\tyourself...\n\t\t\t(a chocked laugh)\n\t\tYou can't imagine how many times I\n\t\tsaw you two... your head together,\n\t\tI wish him dead.  Every time...\n\t\tWant to hear something weird?  I\n\t\tfeel like I'd give my life to bring\n\t\thim back.\n\n\t\t\t\tM.J.\n\t\tYou're in terrible trouble, Nikko.\n\n\t\t\t\tNIKKO\n\t\tWho gives a fuck?  In all the years\n\t\tI never seen you cry.\n\t\t\t(beat)\n\t\tYou loved him.\n\n\tM.J. looks away.\n\n\t\t\t\tM.J.\n\t\tWho gives a fuck?\n\n\tQUINN enters to find his two senior officers in tears.  Pays\n\tno attention to Conrad.\n\n\t\t\t\tQUINN\n\t\tNikko.  My office?  M.J., I wanna\n\t\tsee you later.\n\n\tNikko stands, and he and Quinn exit.  M.J. SITS STARING INTO\n\tHER MISERY.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. GAY NIGHTCLUB - NIGHT\n\n\tVery crowded with a generally young clientele.  Big dance\n\tscene.  A number of men wear 70's costume... an occasional\n\tbit of drag.\n\n\tANDY and HAL dancing... ANDY with great abandon.  HAL seems\n\tto need a break.  He leads a good-naturedly protesting ANDY\n\tback to their table.  They find a stranger sitting there.\n\n\tIT IS PETER.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. QUINN'S OFFICE - NIGHT\n\n\tM.J. ENTERS AND CROSSES TO HIS DESK.\n\n\tOn his desk lie a badge and a gun -- Nikko's.  M.J. is\n\tlooking at them as\n\n\t\t\t\tQUINN\n\t\t\t(nothing her look)\n\t\tHe's on temp leave with pay.  I\n\t\ttalked the Commissioner out of no\n\t\tpay.\n\n\tM.J. pulls her badge out and puts it down in front of Quinn.\n\n\t\t\t\tM.J.\n\t\tYou want mine, too?  You take his,\n\t\tyou take mine.  I'm the one fucked\n\t\tit up...\n\n\t\t\t\tQUINN\n\t\tSo I'm maybe gonna lose three good\n\t\tcops?  You fucked up on this\n\t\toccasion, but don't be so hard on\n\t\tyourself.  There's something I want\n\t\tyou to think about.  The book says\n\t\tif you use your gun, use it to\n\t\tkill, that's what it's meant to do.\n\t\tYou tried to pick this punk off\n\t\twith fancy shooting, to keep him\n\t\talive.  To what end?  You're not\n\t\twilling to kill, you can't be a\n\t\tcop.  Go get drunk.  I am.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. HELEN'S OFFICE - NIGHT\n\n\tHelen is lying wide awake.  THE PHONE RINGS.  HER ANSWERING\n\tMACHINE -- SHE CAN HEAR IT CLEARLY IN THIS LOFT APARTMENT...\n\n\t\t\t\tANDY (V.O.)\n\t\tIf yo dialed carefully you've\n\t\treached your dream number.  Now,\n\t\tyou know what to do.\n\t\t\t(beep)\n\n\t\"THE POLICE\" SINGING \"YMCA\" IS HEARD!\n\n\tINT. NIGHTCLUB PAYPHONE NEAR THE  MEN'S ROOM\n\n\tPETER IS THERE ON A PAYPHONE:  HE NOW HOLDS UP A WALKMAN\n\tTAPE RECORDER TO THE MOUTHPIECE... PRESSES A BUTTON...\n\n\tINT. HELEN'S BEDROOM\n\n\tHELEN'S OWN VOICE IS HEARD.  ECHOING THROUGH THE LOFT SPACE\n\tFROM THE OFFICE.  \"YMCA\" HEARD IN B.G.  Helen leaps out of\n\tbed and runs down the hall, as:\n\n\t\t\t\tHELEN (V.O.)\n\t\t... their compulsion is less about\n\t\tsex than it is about control.\n\t\tPower.  Action.  Release from\n\t\tpassivity.  Albert DeSalvo, Bianchi\n\t\tand Buono, Berkowitz, Dahmer...\n\tDahmer killed his first victim\n\t\tbecause the boy just wanted to go\n\t\thome.  Bundy said he wanted to\n\t\tmaster life.  And death...\n\n\tShe has reached the machine: she picks up the phone...\n\n\t\t\t\tHELEN\n\t\tPeter Kurten!\n\n\tINT. CLUB PAYPHONE - NIGHT\n\n\tPETER HANGS UP THE PHONE, SLIPS THE TAPE RECORDER IN HIS\n\tPOCKET AND TAKES A FEW STEPS TO THE MAIN FLOOR OF THE\n\tNIGHTCLUB.  OVER HIS SHOULDER WE CAN SEE: ANDY AND HAL\n\tDANCING.  Andy is wearing a bright and distinctive jacket.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. HELEN'S APARTMENT - NIGHT\n\n\tA new guard, FRED, is letting M.J. in.  FOR THE FIRST TIME,\n\tHELEN IS GLAD TO SEE HER.  As M.J. walks down toward her...\n\n\t\t\t\tHELEN\n\t\tYou were right!  He knew me!  He\n\t\twent to my lectures.  He recorded\n\t\tthem!  Listen to this...\n\n\tShe is too full of her own shock to wonder why M.J. is here\n\tat this hour and to notice the state M.J. is in... she has\n\tturned back to the answering machine and hits the play\n\tbutton, M.J. standing beside her... She also has the text of\n\tthe lecture on her computer screen:\n\n\t\t\t\tANSWERING MACHINE\n\t\t...Action.  Release from passivity.\n\t\tAlbert DeSalvo, Bianchi and Buono,\n\t\tBerkowitz, Dahmer... Dahmer killed\n\t\this first victim because the boy\n\t\tjust wanted to go home.  Bundy said\n\t\the wanted to master life.  And\n\t\tdeath...\n\n\tAND THE MUSIC FROM THE NIGHTCLUB BLARING IN THE B.G.\n\tHelen has turned and now sees M.J.'s condition.  SHE STOPS\n\tTHE TAPE...\n\n\t\t\t\tHELEN\n\t\tWhat happened to you?!\n\n\t\t\t\tM.J.\n\t\tRuben's dead.   So stupid, a cop\n\t\tthing, a crazy kid and a buncha\n\t\tdumb mistakes... I'm sorry...\n\t\tbecause you and he...\n\n\tTears start again, just running down, no sobs, but she can't\n\twill them away.  She brushes at them angrily...\n\n\t\t\t\tM.J.\n\t\tI just thought it was so --\n\t\tunprofessional.  Of you both!\n\n\t\t\t\tHELEN\n\t\tHe felt sorry for me.  It was so\n\t\tnice to flirt.  He was a darling\n\t\tman.\n\n\t\t\t\tM.J.\n\t\tA man?  I thought he was a boy.\n\t\t\t(bursting out)\n\t\tThis last Christmas was the\n\t\thappiest Christmas I had in the\n\t\tlast ten years... you know why?  It\n\t\twas the first Christmas in six\n\t\tyears I was not in love.  Son of a\n\t\tbitch married men!  Who cares about\n\t\tmarriage, the bed just gets crowded\n\t\tand noisy?!\n\n\t\t\t\tHELEN\n\t\tYou're exhausted.  Let me get you a\n\t\tbrandy.\n\n\t\t\t\tM.J.\n\t\tWhere's the john?  Let me clean up\n\t\tthis mess, and get back to work.\n\n\tHelen has stepped to her brandy decanter; M.J., too dejected\n\tto move, sits, staring now at the only thing to stare at: the\n\tcomputer screen.\n\n\t\t\t\tHELEN (O.S.)\n\t\tWho's the married man?\n\n\t\t\t\tM.J.\n\t\tWhat does it matter?  This guy, you\n\t\tchecked your course records, who\n\t\tsigned up?\n\n\tHelen returns with the brandy.  M.J. holds it, doesn't drink,\n\tjust stares at the computer screen, emotionally dead...\n\n\t\t\t\tHELEN\n\t\tThe University computer is down for\n\t\tmaintenance, but I've been going\n\t\tthrough my own notes...\n\n\t\t\t\tM.J.\n\t\t\t(her voice is dead)\n\t\tLook.  There's the order:  you\n\t\twrote it:  DeSalvo, Bianchi &\n\t\tBuono, Berkowitz and Dahmer.  It's\n\t\tgoing to be Dahmer next.  Which\n\t\tmeans he'll kill a man.\n\n\tWith an effort of will M.J. moves to the phone, putting the\n\tbrandy down.\n\n\t\t\t\tHELEN\n\t\tYes.  Dahmer!  And after that...\n\n\t\t\t\tM.J.\n\t\t\t(dialing)\n\t\tBundy.  That's the last one in your\n\t\tspeech...\n\n\t\t\t\tHELEN\n\t\tMaybe you should...\n\n\t\t\t\tM.J.\n\t\tI'm working on it!  It's what I do.\n\t\t\t(into phone)\n\t\tQuinn...Halloran.  I'll wait.\n\t\t\t(to Helen)\n\t\tWhere's Andy, can we get some\n\t\tcoffee in here?\n\n\t\t\t\tHELEN\n\t\t\t(she's going through\n\t\t\t records)\n\t\tOut.  Where does he go?  Nowhere.\n\t\tWhat does he do?  Nothing.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tEXT. BAYSIDE RESTAURANT - BELVEDERE OR SAUSALITO - DAY\n\n\tA BRIGHT LOVELY DAY, PEOPLE DINING AND DRINKING IN THE SUN,\n\ton a deck that faces the Bay and San Francisco's towers\n\tbeyond.  Young people, drinks in hand, dressed to go to a\n\tsummer wedding, mingle and laugh and chatter.  A young woman\n\tstands leaning back against the wooden rail, her back to the\n\tBaby.  A young man faces her, talking, laughing.  HE LEANS\n\tCLOSE TO WHISPER IN HER EAR AND SHE LEANS BACK, DRAWING HIM\n\tCLOSER TO HER -- SEXY!  AS HE WHISPERS HE CAN SEE OVER HER\n\tSHOULDER INTO THE WATER BELOW.\n\n\tREVERSE, CLOSE: YOUNG MAN -- His face registering horror at\n\twhat he sees: he stops speaking, and the GIRL turns to look\n\tdown to see what is it he's looking at, and begins to\n\tSCREAM...\n\n\tTHEIR POV.\n\n\tBelow, floating in the water is ANDY, wearing his bright\n\tjacket, except it's not all of Andy.  HIS HEAD IS MISSING.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tREVERSE: (TIME HAS PASSED).  FROM WHAT WOULD BE ANDY'S POV\n\t-- FACES LOOKING DOWN.  M.J., QUINN, SAKS AND CORONER'S\n\tMEN...\n\n\tTHEIR POV.  NOW RUBBER BOATS HAVE BEEN TIED IN A RING\n\tAROUND THE BODY.  DOC IS DOING HIS WORK, PREPARATORY TO\n\tLIFTING THE BODY OUT OF THE WATER...\n\n\tHE PULLS A WALLET OUT OF THE POCKET AND HOLDS IT UP TO THE\n\tPEOPLE ABOVE.\n\n\tM.J. TAKES IT.  BEGINS TO LOOK THROUGH IT.  SHE IS NUMB WITH\n\tEXHAUSTION AND SORROW.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\n\tINT. HELEN'S APARTMENT - DAY\n\n\tHer teeth chattering, HELEN tries to talk.\n\n\t\t\t\tHELEN\n\t\tI am not going to talk about it.\n\t\tHow do you know it was Andy if the\n\t\thead was gone?  Where is the head?\n\t\tAre you looking for it?  Oh, God,\n\t\twhy him?  Because of me.  I can't\n\t\ttalk about it.  I write about\n\t\tthings like this, stuff it all in\n\t\tbooks and bury it in libraries.\n\t\tThis is the first person close to\n\t\tme who's ever died.  And it's\n\t\tbecause of me.  This monster killed\n\t\thim because I loved him.\n\n\t\t\t\tM.J.\n\t\tI've got to go.  I've got to go.\n\n\tM.J. hands HELEN her bottle of Xanax.\n\n\t\t\t\tM.J.\n\t\tHow many do you need to sleep.\n\t\tReally sheep?\n\n\t\t\t\tHELEN\n\t\tW-We had a fight.  I called him...\n\t\tcalled him a name...\n\n\t\t\t\tM.J.\n\t\tChrist, Helen.  The first time,\n\t\twe're ahead of the son of a bitch!\n\t\tI can't leave you like this -- and\n\t\tthere's no time.  Knock yourself\n\t\tout.\n\n\tOffers the Xanax again.  Helen looks at the bottle...\n\n\t\t\t\tHELEN\n\t\t\t(beat)\n\t\tRight.  Well.  He's going to do\n\t\tBundy.  Bundy faked injuries, wore\n\t\ta plaster cast, or walked on\n\t\tcrutches, and asked college girls\n\t\tfor help -- carrying his books,\n\t\tpushing his car...\n\n\tM.J. starts for the door... Helen has turned to her\n\tcomputer and types... meanwhile we are HEARING.\n\n\t\t\t\tM.J. (V.O.)\n\t\tLike the others -- he'll pick the\n\t\tmost extravagant murder -- Bundy's\n\t\tthree murders in one night at a...\n\n\tAnd we SEE Helen's message on the computer screen...\n\n\tPETER KURTEN, PLEASE CONTACT INTERNET HUDSONHEL@UNIVOLD.COM.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. TASK FORCE - DAY\n\n\tM.J. IS MOVING FROM DESK TO DESK... ISSUING INSTRUCTIONS, in\n\tcontinuous segue from above...\n\n\t\t\t\tM.J.\n\t\t...Chi Omega sorority house.  Find\n\t\tout how many Chi Omegas there are\n\t\ton college campuses this area.\n\n\t\t\t\tDETECTIVE\n\t\tHow far out?\n\n\t\t\t\tM.J.\n\t\tHundred mile radius.\n\n\tTo the next...\n\n\t\t\t\tM.J.\n\t\tWhat are the FBI doing?\n\n\t\t\t\tDETECTIVE 2\n\t\tThey were combing Fertility\n\t\tclinics.\n\n\t\t\t\tM.J.\n\t\tYou want to get onto the DMV, we\n\t\twant records on all gold or yellow\n\t\tcolored VW bugs, any year.  I want\n\t\tan in-person check on every\n\t\tregistered owner.  If it's rental --\n\t\tcheck rental first -- get names and\n\t\tlocation of who is driving one now.\n\n\tNext station.  QUINN has appeared and is listening.\n\n\t\t\t\tM.J.\n\t\tAlert Campus Security on college\n\t\tcampuses, all of them.  They should\n\t\twarn all female students with long\n\t\tstraight dark hair parted exactly\n\t\tin the middle -- I'm serious! -- to\n\t\tavoid any strange male contacts and\n\t\treport any man with an apparent\n\t\thandicap who tries to get them to\n\t\tcarry groceries or books, or push\n\t\this car...\n\n\tSAKS has appeared and stands by Quinn: they both stare at\n\ther and she becomes more and more self conscious and aware\n\tof how impossible this is...\n\n\t\t\t\tM.J.\n\t\t\t(to them)\n\t\tThat was Bundy.  He killed forty of\n\t\tthem, identical, long hair, parted\n\t\tin the middle, alike as Barbie\n\t\tdolls.\n\t\t\t(breaks off)\n\t\t...this is hopeless.  Let's try to\n\t\tget time for a police spokesman to\n\t\tappear on college radio and TV\n\t\thookups and broadcast a warning?\n\n\t\t\t\tQUINN\n\t\t\"Spokesperson.\"\n\n\t\t\t\tSAKS\n\t\tWhat about auto body and paint\n\t\tshops; any recent VW bug repainted\n\t\tto gold or yellow?\n\n\tM.J. is mildly surprised at help from this source.\n\n\t\t\t\tM.J.\n\t\tYou or us gonna do it?\n\n\tQUINN AND SAKS TURN TO EACH OTHER: TURF WAR.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tFERTILITY CLINIC - DAY\n\n\tNITROGEN FOG swirls as a Stainless steel tubule is lifted\n\tout its bath of liquid nitrogen, with a long pair of tongs.\n\tCAMERA FOLLOWS TO REVEAL PETER FOLEY, in white lab coat.\n\tThrough a glass partition, he SEES two unmistakable FBI men\n\tenter and begin talking to the receptionist in an outside\n\toffice.  HE CONTINUES ABOUT HIS WORK.  CAMERA STAYS ON THE\n\tFBI MEN AND RECEPTIONIST.  CUT BACK TO WHERE PETER WAS\n\tWORKING.  THERE IS ONLY A PAIR OF RUBBER GLOVES AND LAB COAT\n\tLYING ON THE WORK SPACE.  A BACK DOOR IS CLOSING...\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. HELEN'S BEDROOM \n\n\tHELEN'S BED IS EMPTY, COVERS THROWN BACK.  A GLORIOUS\n\tMORNING.  THE TV'S LEAP INTO LIFE.  WE HEAR OVER: HORRIBLY\n\tCHEERFUL VOICE:\n\n\t\t\t\tTV (V.O.)\n\t\tWelcome to weekend gridlock on the\n\t\tFreeways!  Everybody heading for\n\t\tthe mountains and or the sea,\n\t\t\t(sings)\n\t\t\"by the sea, by the sea, by the\n\t\tbeautiful sea,\" and my-oh-my what a\n\t\tmess!  On 101 south of Burlington,\n\t\twe have a big rig over the side,\n\t\tblocking the on-ramp...\"\n\t\t\t(etc., blah, blah)\n\n\tINT. HELEN'S OFFICE - CURTAINS DRAWN - STILL NIGHT HERE...\n\n\tHelen at her computer... which says\n\n\tBACK ON LINE -- SORRY FOR THE DELAY.\n\n\tTHESE ARE CONFIDENTIAL UNIVERSITY RECORDS\n\tREQUIRING APPROVED AUTHORIZATION\n\tPLEASE TYPE YOUR PASSWORD:\n\n\tHelen types -- 'xxxx xxxx' appears on screen.  Then a\n\tmessage:\n\n\tDOCTOR HELEN HUDSON, YOUR ACCESS LEVEL IS THERE.\n\n\t\t\t\tHELEN\n\t\tAny student name registered in\n\t\tCrime-Psych 137 matched to titles\n\t\tof term papers with any mention of\n\t\t'Peter Kurten.'\n\n\tWhat she types on SCREEN is the text for a Boolean search\n\tfor such items (research needed).  She waits for a second.\n\n\tSEARCH COMPLETED\tSTUDENT NAMES:\t342\n\t\t\t\tCRIME-PSYCH 137\t 11\n\t\t\t\tTERM PAPERS\t\t736\n\t\t\t\tPETER KURTEN\t\t   1\n\n\tMATCHING ALL CRITERIA: PETER FOLEY\n\n\t'PETER FOLEY, DOCTORAL CANDIDATE, 1991 TERM PAPER,\n\t'PSYCHOPATHOLOGY OF SERIAL KILLER PETER KURTEN AS A SYMPTOM\n\tOF SOCIAL UPHEAVAL AND POLITICAL VIOLENCE IN GERMANY CIRCA\n\t1936,' UNPUBLISHED.\n\n\t\t\t\tHELEN\n\t\tPeter Foley.  Good God.  You poor\n\t\tsad little bore.  I failed you, is\n\t\tthis what...?\n\n\tSOUND:  HER FRONT DOOR OPENS.  She starts, turns.  Feet\n\tmoving toward her, but quietly, cautiously.  As the\n\tfootsteps turn into the hall.  She stands, reaching for\n\tanything to defend herself with: a paperknife.  She moves to\n\tthe door, raising the knife... footsteps closer... A man\n\tturns into the office, and she launches herself, only\n\tstopping the stab of the knife at the last split second...\n\n\tANDY.  She SCREAMS!\n\n\t\t\t\tANDY\n\t\tStop screaming!\n\n\tShe screams again.  Then smothers him with kisses and\n\thugs...\n\n\t\t\t\tANDY\n\t\tFor God's sake, stop -- my head!  I\n\t\thave the Iraqi mother of all hang-\n\t\tovers.  Very quiet in the hospital\n\t\tzone, please.\n\n\tShe clings to him.\n\n\t\t\t\tHELEN\n\t\tWhere have you been?  What happened\n\t\tto your wallet?\n\n\t\t\t\tANDY\n\t\tHal has it.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. SQUAD ROOM - NIGHT\n\n\tSAKS is sitting on edge of a desk.  M.J. is standing, and\n\tQUINN is sitting almost knee-to-knee with ANDY.\n\n\t\t\t\tANDY\n\t\t...then he gave me a popper and I\n\t\tstarted to feel really wild... all\n\t\tover the dance floor.  Then\n\t\tsuddenly I was just s o stoned.  And\n\t\tsick?  I had to race for the\n\t\tjohn... horribly sick.  Over and\n\t\tover and over.  I was in there a\n\t\tvery long time.  And when I came\n\t\tout they were gone.  So was my\n\t\tjacket which I'd tossed to Hal when\n\t\tI was dancing.  Hal was my...\n\t\tCould I have a glass of water?\n\n\tAn FBI man intrudes... with a printout of a driver's\n\tlicense.  He shows to Andy...\n\n\t\t\t\tFBI\n\t\tMister Saks.  We gotta Peter Foley,\n\t\tmedical technician in a fertility\n\t\tclinic in Oakland.  We got a home\n\t\taddress in Daly City.\n\n\t\t\t\tANDY\n\t\t\t(looking at license)\n\t\tThat's him.\n\n\t\t\t\tSAKS\n\t\tGot him!\n\n\tTHE FBI AND THE COPS ALL RISE AND ARE ON THEIR WAY OUT.\n\n\t\t\t\tQUINN\n\t\tI called our SWAT Commander...\n\t\t\t(to Saks)\n\t\tHe's ours now... You come watch\n\t\tour boys in action...\n\n\tAnd walks away...\n\n\t\t\t\tSAKS\n\t\t\t(under his breath)\n\t\tWell, thank you, too.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tEXT. OLD FRAME HOUSE, DALY CITY - NIGHT\n\n\tSWAT TEAM SURROUNDING THE HOUSE, WITH GREAT QUIET AND EFFORT\n\tTO CONCEAL THE OPERATION.  QUINN in command over a SWAT\n\tCOMMANDER -- JENSEN.  There are ambulances, a fire truck,\n\tsearch lights.  SWAT TEAM, AND FBI all wear bulky flack\n\tjackets, with yellow ID stencilled on the back.  Quinn sees\n\tM.J., huddled in her old oversize jacket, gestures M.J.\n\tshould have a flack jacket like theirs.  She taps her chest,\n\twhere she has a bullet-proof vest under her shirt.\n\n\tTHE HOUSE:  VARIOUS SHOTS, SILHOUETTED FIGURES MOVING TO\n\tVANTAGE POINTS FOR THE ASSAULT.\n\n\tON A VIEW INCLUDING A CELLAR WINDOW: LIGHT INSIDE.  AS\n\tCROUCHED SWAT MAN RUNS BY WE SEE: PETER INSIDE, PASSING BY,\n\tGLANCE OUT...\n\n\tINT. PETER'S BASEMENT\n\n\tPETER HESITATES, LOOKING OUT.  HE FLICKS OFF LIGHTS.  MOVES\n\tPURPOSEFULLY OUT OF FRAME... WE HEAR A MOAN (O.S.).\n\n\tA HAND GASPS THE HANDLE OF WHAT LOOKS LIKE A GUN; AS IT IS\n\tBROUGHT UP INTO A WIDER VIEW IT HAS A LONG BARREL WHICH\n\tSUDDENLY SHOOTS FLAME: A PROPANE BARBECUE LIGHTER...\n\n\tEXT. HOUSE\n\n\tTHEY ARE ALMOST READY FOR THE FIRST MOVE; THREE SWAT MEN BY\n\tTHE DOOR.  ANOTHER TWO PREPARING TO MOVE FORWARD AND\n\tANNOUNCE THEMSELVES.\n\n\t\t\t\tSWAT COMM\n\t\t\t(on bullhorn)\n\t\tPeter Foley, we are the police.\n\t\tWill you please come to your front\n\t\tdoor, and come out with your hands\n\t\tabove your head...(etc.)\n\n\tINSIDE A SMOKE ALARM BEGINS TO GO.  LIGHT FLICKERS IN CELLAR\n\tWINDOWS.\n\n\tSWAT MEN AT THE DOOR: THEY SMASH THE LOCK AND CHARGE IN.  M.J.\n\tAND OTHER DETECTIVES WITH THEM.\n\n\tINT. HOUSE\n\n\tA dozen men pour into the house from front and back,\n\tconverging in the dimly lit living room.  SMOKE OBSCURES\n\tEVERYTHING.  The dining room and kitchen are empty.  M.J.\n\tFOLLOWS CONTINGENT THAT RACES UPSTAIRS.  OTHERS FAN OUT\n\tTHROUGH THE WHOLE STRUCTURE.  FIREMEN COME BEHIND LOOKING\n\tFOR THE FIRE.\n\n\tINT. PETER'S BEDROOM - NIGHT\n\n\tSMOKE IS THINNER HERE.  The room lighted only by the\n\tglowing TV screen.  The WIFE still in bed, shot through the\n\thead.  Others crowd in, kicking in closet and bathroom\n\tdoors.  M.J. IS BY THE  BED JUST TURNING TO START ABACK\n\tDOWNSTAIRS LOOKING FOR PETER.\n\n\tSWAT MAN emerges from the bathroom with the body of NASTY\n\tLITTLE DOG, holding it by the tail:\n\n\tTHEN THE FIRE DEPARTMENT'S WARNING SIRES SHRIEK:  THEY MEAN\n\tEVERYBODY OUT... FIREMEN CHARGE FOR EXITS...\n\n\tAS THEY CHARGE THROUGH DOWNSTAIRS...\n\n\tM.J. CAN SEE TWO FIREMEN AT THE BASEMENT DOOR.  SMOKE BILLOWS\n\tFROM UNDER IT.  BEHIND IT WE HEAR SCREAMING.  THE FIREMEN\n\tSMASH THE DOOR, DROPPING TO THE FLOOR AS THEY DO...\n\n\tM.J'S POV: BLACK SMOKE BILLOWS OUT ACROSS THE CEILING\n\tTHEN EXPLODES INTO WHITE HOT FLAME.  SHE HAS STEPPED FORWARD\n\tSO SHE CAN SEE OVER THE FIREMEN DOWN INTO THE BASEMENT: IN\n\tTHE SUDDEN FLARE SHE SEES A MAN, WITH TIN-RIMMED GLASSES AND\n\tBLACK LEATHER CLOTHING ENTIRELY ENGULFED IN FLAME RUNNING UP\n\tTHE BASEMENT STAIRS; BEHIND HIM THE BASEMENT IS BURNING.\n\n\tINT. BASEMENT\n\n\tLOW ANGLE LOOKING UP STAIRS: FLAME ALL AROUND -- PETER'S \n\tPHOTO COLLAGES ON THE BULLETIN BOARD BURNING.  THE MAN \n\tRUNNING UP THE STAIRS ALMOST MAKES IT TO THE TOP BEFORE\n\tHE FALLS BACK DOWN INTO THE CAMERA.  AT THE TOP, WE SEE M.J.\n\tAND THE FIREMEN'S APPALLED FACES.  THE SCREAMING DIES OFF...\n\n\tEXT. HOUSE\n\n\tFLAME NOW ENGULFING THE BASEMENT AND GROUND FLOOR: FIREMEN\n\tAND M.J. RACING OUT COUGHING AND CHOKING.\n\n\tTHEN: A HUGE HOT FLOOM OF AN EXPLOSION: FLAMES THREATEN TO\n\tCONSUME THE ENTIRE HOUSE.  FIREMEN SWARM BACK TO KNOCK DOWN\n\tFLAME FROM OUTSIDE.\n\n\tM.J., QUINN, ETC., WATCHING THE EVIDENCE GO UP IN SMOKE.\n\tTHEIR FACES LIGHTED BY THE FLAME.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. HELEN'S OFFICE - NIGHT\n\n\tShe has now changed into a pair of sweat pants and a\n\tT-shirt.  SUSAN SCHIFFER IS ON TV: WITH SHOTS OF THE FIRE\n\tBEING SNUFFED OUT.\n\n\t\t\t\tSUSAN\n\t\tI am here with Lieutenant Quinn of\n\t\tthe Homicide Division and (title)\n\t\tSaks of the FBI.  Can you tell us\n\t\twhat happened here, tonight?\n\n\tDuring the following we move to PETER'S HOUSE where Quinn\n\tand Saks are being interviewed.\n\n\t\t\t\tQUINN\n\t\tSusan, the San Francisco Police\n\t\tDepartment, assisted by the FBI,\n\t\tdeveloped evidence that the serial\n\t\tkiller, referred to as the Copycat\n\t\tkiller was an individual who\n\t\tresided at this address.  Upon\n\t\tbeing asked to step out of the\n\t\thouse to be interviewed, the\n\t\tsuspect set fire to the house\n\t\tpossibly to destroy evidence of his\n\t\twife's murder.  We found her dead\n\t\tof gunshot wounds in an upstairs\n\t\tbedroom.  He himself died in the\n\t\tfire.\n\t\t\t(to shouted\n\t\t\t questions)\n\t\tNo, we'll wait until we've located\n\t\tany relatives who should be\n\t\tnotified.  Witnesses saw the\n\t\tindividual burn to death, they were\n\t\tunable to reach him in time to save\n\t\thim.  We're glad, as the entire\n\t\tcity must be glad, this reign of\n\t\tterror is ended.  No, no more at\n\t\tthis time.  Thank you...\n\n\tEND OF HELEN STARING STONILY AT THE SCREEN:  SHE DOESN'T\n\tBELIEVE IT FOR A MOMENT.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. TASK FORCE ROOM - NIGHT\n\n\tM.J., wearily enters.  Others quietly entering, slipping out\n\tcoats, talking and drinking at some distance.  M.J. takes\n\toff her shoulder holster and gun and puts them down on her\n\tworkspace.  NIKKO is at little distance cleaning out his\n\tdesk.  He comes down to her as she sits...\n\n\t\t\t\tNIKKO (V.O.)\n\t\tI heard. Good police work.\n\n\t\t\t\tM.J.\n\t\tJust horseshit luck.\n\n\t\t\t\tNIKKO\n\t\tDon't ever forget how good you are.\n\n\tHe is standing behind her and leans over to almost touch her\n\thair with his lips...\n\n\t\t\t\tNIKKO\n\t\tI love you.\n\n\tHe goes.  M.J. twists in misery and fury... Her phone is\n\tringing on another line; she punches it...\n\n\t\t\t\tNJ\n\t\tHalloran.\n\n\t\t\t\tHELEN\n\t\tI don't believe it.\n\n\t\t\t\tM.J.\n\t\tHelen.\n\t\t\t(beat)\n\t\tI saw him die.  I saw him burning on\n\t\tthe basement stairs, he never\n\t\treached the top.\n\n\t\t\t\tHELEN\n\t\tThey never kill themselves.  How do\n\t\tyou know it was him.  You never met\n\t\thim.  You never even saw a\n\t\tphotograph...\n\n\t\t\t\tM.J.\n\t\tHelen -- let go.  You've got to let\n\t\tgo.\n\n\t\t\t\tHELEN\n\t\tHe hasn't done Bundy.  He's done\n\t\tevery one of the others, hasn't he?\n\t\tIf there are three dead Chi Omega\n\t\tcollege girls tomorrow, how will\n\t\tyou feel?  Go there.  See if there\n\t\tcould be any way for him to escape.\n\n\t\t\t\tM.J.\n\t\tThis has been the worst 48 hours of\n\t\tmy life.  I'm going home.  I'm going\n\t\tto try to get drunk.\n\n\t\t\t\tHELEN\n\t\tIf there's a one percent possibil-\n\t\tity, can you live with yourself\n\t\twhen he kills again?\n\n\t\t\t\tM.J.\n\t\tOh, shut up, and don't be so damn\n\t\tself righteous.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. M.J'S CAR - NIGHT\n\n\tM.J. is now almost dead with fatigue.  She barely misses\n\thitting another car.  She drives on until she is forced to\n\tstop at a traffic light.  All during this:\n\n\t\t\t\tRADIO NEWS\n\t\t...You're on the air, who's\n\t\tthis...Ron, that's not my right\n\t\tname... that's okay, Ron. What are\n\t\tyou afraid of?... I don't want\n\t\tanybody to know my name, because\n\t\tI'm a friend of Peter Foley?  I \n\t\tknow him from the gay community?  He\n\t\twas cruising the night...\n\n\tM.J. switches stations, channel surfing... bits of music,\n\tRush Limbaugh, back to Ron droning on.\n\n\t\t\t\tRADIO NEWS\n\t\t...that I resent the tone of the\n\t\tPolice and their attitude?  That\n\t\tthis is just some weird queer\n\t\tevent, just because they couldn't\n\t\tstop this guy until he did himself,\n\t\tif you even believe that...\n\n\tM.J. turns off the radio... when light turns green,\n\tinstead of moving ahead, she just sits for a moment.  Then,\n\tfurious with HELEN, with everything, she swears and wheels\n\tthe car into a tight illegal u-turn.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tEXT. NIGHT BERKELEY CAMPUS - NIGHT\n\n\tIt is extra time, which means party time or those who've\n\tfinished and solitary and group study time for the rest.\n\tAnd there are celebrants of the Festival of Love, who were\n\tbeing born about the time of the original event.  TRACKING\n\tSHOT TO ESTABLISH THIS SCENE, MOVING, SEARCHING ALONG THE\n\tAVENUES, PASSING KNOTS OF STUDENTS AND PARTY-GOES... WE\n\tHAVE SEEN A PEACEFUL CAMPUS, QUIETLY CELEBRATING.  AND WE\n\tHAVE DRAWN UP BEFORE CHI OMEGA.  THERE IS NO PLACE TO PARK.\n\tM.J., WHOSE POV THIS HAS BEEN LOOKS AT HER WATCH.\n\tDECIDES: FUCK IT, THIS IS CRAZY AND IS ABOUT TO DRIVE AWAY,\n\tSHIFTING INTO GEAR WHEN SHE SPOTS:\n\n\tPOV.  A GOLD COLORED VW BUG\n\n\tIt is parked under a tree some distance across a parking lot\n\tjammed with student cars.  It is partly in shadow, so she\n\tcould easily have missed it.  She jumps out of the car and\n\tmoves fast up the steps through students, drinking, kissing,\n\tstudying, arguing...\n\n\tINT. CHI OMEGA - NIGHT\n\n\tMAIN MEETING ROOM.  Full of people milling about.  Music is\n\tplaying.  SEES THE BACK OF A TALL MAN ON CRUTCHES TALKING TO\n\tA COED.  HE HAS A LOAD OF BOOKS SHE TAKES FROM HIM; SHE IS\n\tLAUGHING.  M.J. moving fast toward them, she runs into a\n\tgirl, spilling the girls' drink on her blouse...\n\n\t\t\t\tGIRL\n\t\tGoddamn it!  This is brand new!\n\t\tWhere're you going?\n\n\tAs M.J. continues to move the Girl grabs her...\n\n\t\t\t\tGIRL\n\t\tNo, you don't spill all over\n\t\tsomebody and just walk away, you\n\t\tdamn well pay the cleaning bill...\n\n\t\t\t\tM.J.\n\t\tPolice business -- take your heads\n\t\toff.\n\n\t\t\t\tGIRL\n\t\tBullshit!\n\n\tM.J. holds up the badge...\n\n\t\t\t\tM.J.\n\t\tDon't make me pull the gun...\n\n\tShe jerks away, almost knocking the Girl down.  The Girl is\n\tyelling, beginning to attract attention.  As M.J. turns back\n\tto SEE.\n\n\tPETER AND THE COED are just moving off, the Coed holding his\n\tbooks, he hobbling on the crutches.  M.J. runs through the\n\tcrowd toward him, and those who notice are pissed... she is\n\tgetting close when, just as he and the coed would pass from\n\tsight behind a wall, PETER looks around, straight at M.J..\n\n\tIT ISN'T PETER AT ALL.\n\n\tM.J. LOOKING AROUND, MOVES TO STAIRS TO SECOND FLOOR...\n\n\tM.J. EMERGING FROM STAIRS INTO THE CORRIDOR -- SHE RUNS DOWN\n\tTHIS CORRIDOR OF ROOMS, PUSHING OPEN ANY THAT ARE SHUT.\n\n\tA SCARED COUPLE MAKING LOVE CONFRONT HER GUN.  SHE\n\tREHOLSTERS IT AND RACES DOWN THE HALLWAY...\n\n\tOVER THE PARTY NOISE AND MUSIC WE HEAR A SCREAM.  M.J. RACES\n\tDOWN CORRIDORS, TRYING TO FIND THE SOURCE.  ANOTHER SCREAM.\n\tIT SEEMS TO COME FROM BEHIND A CLOSED DOOR.  M.J. KICKS IT\n\tOPEN, BURSTING IN:\n\n\tINT. ROOM\n\n\tA BUNCH OF STONED STUDENTS PASSING A JOINT: ON A TV PLAYER\n\tIS THE IMAGE OF JAMIE LEE CURTIS IN AN EARLY SHOCKER: THEY\n\tARE PLAYING AT WHO CAN OUT-SCREAM JAMIE LEE CURTIS.\n\n\tWHEN JAMIE LEE CURTIS SCREAMS --\n\n\tTHEY ALL SCREAM BACK!  AND BURST INTO HOWLS OF LAUGHTER.  THE\n\tSIGHT OF M.J. WITH HER GUN OUT ONLY MAKES THEM HOWL LOUDER.\n\n\t\t\t\tSTUDENT\n\t\tSwallow the joint!  It's Barney\n\t\tPhyfe -- in drag!\n\n\tTHEN ALTOGETHER THEY SCREAM AT HER!  AND HOWL WITH LAUGHTER.\n\n\tTHE HALL. \n\n\tM.J. walks out of the room and down the corridor.\n\n\tEXT. CHI OMEGA FRONT STEPS\n\n\tSHE LOOKS OUT ACROSS THE PARKING LOT: THE GOLD VW BUG IS \n\tGONE.\n\n\tSHE WALKS TO HER CAR, RELIEVED.  THE WHOLE THING SEEMS LIKE\n\tA NIGHTMARE FROM WHICH SHE HAS NOW AWAKENED.\n\n\tINT. M.J'S CAR\n\n\tAS SHE OPENS THE DOOR, REACHES IN AND GRABS HER PHONE.  SHE\n\tACTIVATES PHONE, WHEN SHE IS BLINDSIDED BY PETER WHO SLAMS\n\tHER INTO THE CAR, FACE DOWN ACROSS THE FRONT SEAT.  HE \n\tDISARMS HER, TWISTS HER INTO THE PASSENGER SEAT...\n\n\tTHERE ARE STUDENTS AT SOME DISTANCE, BUT SHE CAN'T MAKE\n\tHERSELF BE HEARD.  SHE IS GROGGY FROM THE BLOW SHE'S TAKEN.\n\tHE HANDCUFFS HER TO THE CAR, FIND HER KEYS, AND BEGINS TO\n\tDRIVE AWAY... PETER'S HAIR IS NOW BRIGHT RED -- LIKE DARYLL\n\tLEE CULLUM'S.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\n\tINT. HELEN'S APARTMENT - NIGHT\n\n\tHelen lies wide awake in the dark.  PHONE RINGS.\n\n\tINT. TASK FORCE ROOM - NIGHT\n\n\tINSERT: TAPE RECORDER ATTACHED TO PHONE.  IT STARTS TO TURN.\n\tAT THE FAR END OF THE ROOM AN FBI DETECTIVE IS POURING HIMSELF\n\tSOME COFFEE.  HE WOULDN'T BE ABLE TO HEAR WHAT WE HEAR:\n\n\t\t\t\tHELEN (V.O.)\n\t\t\t(thinking it's M.J.)\n\t\tWhere are you?\n\n\t\t\t\tPETER (V.O.)\n\t\tHi.  It's your worst student, Peter\n\t\tFoley -- how do you grade me now,\n\t\tDoctor?\n\n\tHELEN ON PHONE\n\n\t\t\t\tHELEN\n\t\t\t(beat)\n\t\tWho was the man in the basement?\n\n\t\t\t\tPETER\n\t\tYou like that action?  Didn't that\n\t\tcop on TV look solemn?  The guy in\n\t\tthe basement doesn't matter,\n\t\tanyway, just another lonely heart.\n\n\t\t\t\tHELEN\n\t\tWhere are you, Peter?\n\n\t\t\t\tPETER\n\t\tYou thought I was going to do Ted\n\t\tBundy next, so you sent your\n\t\tpartner...\n\n\tHelen gasps with the implications of that...\n\n\t\t\t\tPETER\n\t\tWhat was that?  What am I hearing?\n\t\tThe sound of an epiphany, a sudden\n\t\tblinding insight?\n\n\t\t\t\tHELEN\n\t\tIt's Daryll Lee Cullum, isn't it?\n\n\t\t\t\tPETER\n\t\tMm-hmm.  I can't get to you.  You\n\t\thave to come to me.\n\n\t\t\t\tHELEN\n\t\tYou know I can't do that.\n\n\t\t\t\tPETER\n\t\tOh, I think you will.\n\n\tPeter rips duct tape off M.J.'s mouth...\n\n\t\t\t\tM.J.\n\t\t\t(yelling)\n\t\tCall the police!  Now!  Call Qui...\n\n\tPeter punches M.J. who is handculled in her car; they are\n\tparked in front of the Lecture Hall.\n\n\t\t\t\tHELEN\n\t\tFor God's sake Peter, leave her out\n\t\tof it.  You don't want her, you\n\t\twant me.\n\n\t\t\t\tPETER\n\t\tI need her; she's a cop.  I have to\n\t\tkill a cop, and then...\n\n\t\t\t\tHELEN\n\t\tYou've been perfect.  Don't spoil\n\t\tthe symmetry -- you have to have a\n\t\tmale cop.\n\n\t\t\t\tPETER\n\t\tI don't care -- she's a cop.  That's\n\t\tthe important thing.  Cop-ness, not\n\t\tsex-ness.  It won't be perfect, but\n\t\tit'll be good.\n\n\t\t\t\tM.J.\n\t\t\t(yells)\n\t\tCall Quinn and Saks.\n\n\t\t\t\tPETER\n\t\tI'm tired.  I want it to end\n\t\ttonight, don't you?\n\n\t\t\t\tHELEN\n\t\tYes.  I do.  I want it to end now.\n\t\tLet her go.  I'll come -- just let\n\t\ther go.  She's not important.\n\n\t\t\t\tPETER\n\t\tYou know where.\n\n\t\t\t\tHELEN\n\t\tWhere it began -- McCluskey\n\t\tAuditorium.\n\n\tHe hangs up.\n\n\tINSERT: TAPE MONITOR.  WE HEAR HELEN HANGING UP.  A SMALL\n\tCOMPUTER CHIP VOICE IS HEARD.  THE FBI MAN IS MEASURING\n\tSUGAR INTO HIS COFFEE AT THE OTHER END OF THE ROOM.  HE CAN'T\n\tHEAR:\n\n\t\t\t\tCOMPUTER VOICE\n\t\tTime Zero-hundred and twenty -- two\n\t\tminutes and sixteen seconds June\n\t\ttwelve 1994 Helen Hudson 415 320\n\t\t1854 Court order Alpha Bravo\n\t\t9765910...\n\n\tBATHROOM DRAWER\n\n\tIt is pulled open: metallic sounds of  bullets rolling on the\n\twooden drawer: her hand bats away the usual bathroom drawer\n\tgarbage and pull Ruben's gun out; HER TREMBLING FINGERS\n\tRELOAD IT.\n\n\tEXT. HELEN'S OUTSIDE HALL - NIGHT\n\n\tHelen wearing loose coat, jeans and sneakers opens the door.\n\tFRED snaps out of a sound sleep.\n\n\t\t\t\tHELEN\n\t\tIt's all over, Fred.  They got the\n\t\tguy.  You go home to your own bed\n\t\tnow.\n\n\t\t\t\tFRED\n\t\tI got to have that from my\n\t\tsuperior.  One guy fired off this\n\t\tjob already.\n\n\t\t\t\tHELEN\n\t\tCall in.  Use my phone.  They'll\n\t\ttell you -- it's all over.\n\n\tFRED GOES.  HELEN STEPS RESOLUTELY INTO THE HALL, FOR\n\tREASSURANCE BRACES HERSELF WITH A HAND ON THE WALL.\n\n\tTHE HALLWAY (HER POV).  IT SEEMS MILES LONG.  SOUND: HER\n\tFRONT DOOR CLICKING SHUT -- THE SAME ESSENTIAL EVENT AS SO\n\tLONG AGO WHEN RUBEN HAD TO SHOOT OFF THE DOOR LOCK...\n\n\tHELEN LOOKS BACK AT THE DOOR.  BRIDGES BURNED.  TURNS BACK.\n\n\tHER HAND ON WALL: AS SHE MOVES A TENTATIVE STEP HER HAND\n\tPRESSES HEAVILY, SLIDING ALONG THE WALL.  THEN HER HAND\n\tMOVES A LITTLE FASTER, AND FASTER.\n\n\tHER POV.  THE HALL SEEMS MORE NORMAL.  MOVING SHOT PICKS UP\n\tSPEED...\n\n\tHER HAND NOW BRUSHES THE WALL WITH ONLY FINGERTIPS.\n\n\tHELEN MOVES WITH MORE AND MORE CONFIDENCE: HER AGORAPHOBIA\n\tIS GONE... HER HAND DROPS TO HER SIDE...\n\n\tEXT. HER BUILDING - NIGHT\n\n\tThe door opens and Helen appears in it.  She confronts the\n\tstreet and the night... One more threshold to cross...\n\n\tSTREET: HER OLD SAAB IS PARKED.  THE ANTENNA IS GONE, AND\n\tIT'S COVERED WITH CITY GRIME.  The night seems to roar; the\n\tlights blur and flare.  A truck comes past too fast, \n\tstirring up dust and buffeting her with wind.\n\n\tHELEN steeling herself and running the few steps to her car.\n\n\tINT. CAR as she slides into the driver's seat, slamming the\n\tdoor and locking it.  She drives off into the night.\n\n\tEXT. MULUSKEY AUDITORIUM -  NIGHT\n\n\tA broad view through shadowy trees shows it's lighted\n\tfacade.  Parked in front of is M.J.'s car.  SUDDENLY FROM\n\tBEHIND THE TREES, SAKS STEPS OUT IN FRONT, BLOCKING THE WAY!\n\n\tREVERSE:  HELEN'S CAR IS COMING UP THE STREET TOWARDS US.\n\tSAKS (AND NOW WE SEE OTHER SWAT TYPES IN THE SHADOWS, HIDDEN\n\tFROM THE VIEW OF THE AUDITORIUM) STANDS IN THE STREET\n\tFLAGGING HER DOWN --\n\n\tSHE STOPS, PUTTING DOWN WINDOW.  SAKS RESTS HIS HAND ON THE\n\tDOOR... He shoves no sign of recognizing her...\n\n\t\t\t\tSAKS\n\t\tMa'am, please get out of your\n\t\tvehicle...\n\n\t\t\t\tHELEN\n\t\tMerry, how... oh, Christ, of\n\t\tcourse, you had my phone tapped.\n\n\t\t\t\tSAKS\n\t\tJust get out of your vehicle...\n\n\t\t\t\tHELEN\n\t\tHe's got Sergeant Halloran in\n\t\tthere.  He'll kill her the minute\n\t\the sees or hears your people...\n\n\t\t\t\tSAKS\n\t\tYou've been very useful, Doctor, we\n\t\tappreciate all you've done, and now\n\t\tthe professional will take over...\n\n\t\t\t\tHELEN\n\t\tHe wants me, he doesn't care about\n\t\ther.  Let me...\n\n\tSAKS HAS THE DOOR OPEN AND IS REACHING TO PULL HER FROM THE\n\tDRIVER'S SEAT... HELEN SUCKS IN HER BREATH AND JAMS ON THE\n\tGAS.  SAKS IS ALMOST DRAGGED AWAY WITH HER, SPUN AROUND AND\n\tFALLING ON THE PAVEMENT.  SHE SLAMS THE DOOR AS SHE SPEEDS\n\tTOWARD THE AUDITORIUM...\n\n\tSAKS, CURSING, LEAPS TO HIS FEET; A SWAT TYPE AIMS HIS GUN\n\tAFTER HELEN, BUT SAKS PUTS HIS HAND ON THE WEAPON STOPPING\n\tHIM FROM SHOOTING.\n\n\tNEW ANGLE: Helen's Saab speeds out of the tree shadowed\n\tstreet into the bright plaza in front of the auditorium, and\n\tbrakes behind M.J.'s car.\n\n\tCLOSE: HELEN.  Sudden silence when she kills the car engine.\n\tShe gets out of the car.  As she walks even her sneakers\n\tmake an echo from the silent stone facade... She walks up\n\tthe wide stairs...\n\n\tINT. AUDITORIUM - NIGHT\n\n\tThe huge doors creak open and Helen enters.  She stands,\n\tlistening: light streams in from the exterior through tall\n\twindows, otherwise it's all back shadows, weird enough\n\twithout the distorted vision, the vertigo that momentarily\n\treturns...\n\n\tHelen wills herself to move into the deep space before her.\n\tShe stands listening: we HEAR the creaks and tiny snaps of a\n\tbuilding cooling in the night air.  Or is the movement of\n\tPeter somewhere in the room?\n\n\tShe whirls to face a distance sound that echoes in the\n\tauditorium...\n\n\tCLOSE: HELEN staring, trying to SEE.  NOTHING.\n\n\tTHEN:\n\n\tPETER IS STARING BACK.  HIS FACE BECOMES DARYLL LEE.  THE\n\tVISION SNAPS.\n\n\tHELEN: SHE TURNS AND WALKS PAST THE ROSTRUM OF THE STAGE TO\n\tA DOOR UPSTAGE LEFT... OPENING INTO A LONG AND DARK\n\tCORRIDOR.  SHE GROPES FOR LIGHT SWITCHES, CAN'T FIND OUT ANY.\n\tTHE CORRIDOR LEADS TO THE LADIES' ROOM ON THE RIGHT.  AS SHE\n\tWALKS DOWN THE HALLWAY, IT BEGINS TO RESEMBLE TO HER THE\n\tSAME WALK SHE TOOK AT THE BEGINNING: AND SUDDENLY AT THE\n\tDOOR TO THE LADIES' ROOM SHE SEEMS TO SEE THE FAT COP.  SHE\n\tSHAKES HER HEAD AND THE VISION IS GONE.\n\n\tREPLACED BY INT. LADIES' ROOM.  THE COP IS NOW HELD FROM\n\tBEHIND BY DARYLL LEE - SMILING AT HELEN.  IN REVERSE, WE SEE\n\tFOR THE FIRST TIME THAT HELEN HAS THE ROPE WELL AWAY FROM\n\tHER NECK.  WE REALIZE SHE HAS AMPLE TIME TO WARN THE COP,\n\tBUT SHE IS PARALYZED, FASCINATED BY WHAT IS HAPPENING IN\n\tTERRIBLE SLOW MOTION INTERCUTS BETWEEN DARYLL LEE GRINNING\n\tAT HER, HELEN'S HELPLESS HORROR, THE COP'S APPEALING LOOK TO\n\tHER AND BACK TO DARYLL LEE AS (BELOW THE FRAME) HE SLITS THE\n\tCOP'S THROAT AND LETS HIM FALL TO THE FLOOR.\n\n\tHELEN (FLASHBACK) AT LAST BEGINS TO SCREAM!\n\n\tCLOSE: HELEN (PRESENT) RECOVERING.  (SHE HASN'T SCREAMED AT\n\tALL.)  SHE PULLS RUBEN'S GUN FROM HER POCKET AND SHOVES OPEN\n\tTHE DOOR INTO THE LADIES' ROOM.\n\n\tAS THE DOOR OPENS.  THE LIGHTS ARE ON: IT IS BRILLIANT,\n\tBLINDING IN HERE.  SHE STEPS IN.  THERE IS A SOUND THAT\n\tDRAWS HER ROUND, HER GUN COMING UP: BACK OF THE DOOR IS THE\n\tBROOM CLOSET... SHE FIRES TWO ROUNDS INTO THE CLOSET DOOR.\n\tIT SPRINGS OPEN AND MOPS AND PAILS FALL THUNDEROUSLY OUT\n\tONTO THE TILE FLOOR.\n\n\tSHE WHIRLS TO COVER HER BACK; FACES THE STALLS.\n\n\tEXT. SAKS' ROADBLOCK - NIGHT\n\n\tTHEY REACT TO ECHOES OF THE GUNFIRE.\n\n\t\t\t\tSWAT\n\t\tOh, man?!  Let us in there.\n\n\t\t\t\tSAKS\n\t\tGo.  Go.  Go!\n\n\tMen begin moving cautiously out of the trees and shadows\n\ttoward the Auditorium...\n\n\tINT. LADIES' ROOM\n\n\tHELEN MOVES ALONG THE STALLS PUSHING DOORS OPEN.  UNTIL SHE\n\tSHOVES ONE OPEN AND SEES:\n\n\tM.J. IS HANGING BY A NOOSE, DANGLING THE SAME WAY HELEN DID\n\tIN THE OPENING SEQUENCE.  SHE IS ALIVE, HOLDING THE NOOSE\n\tFROM HER NECK BY ONE HAND...\n\n\tHELEN STARTS TO RUSH TO HER ASSISTANCE, WHEN THE LIGHTS GO\n\tOUT.  PETER TAKES HER FROM BEHIND, SWIFTLY DISARMING HER,\n\tREGARDING THE GUN WITH AMAZEMENT.\n\n\t\t\t\tPETER\n\t\tYou cheated!  You said you'd come\n\t\tdie with me.\n\n\tWITHOUT PAUSE HE PUMPS TWO BULLETS INTO M.J. WHERE SHE\n\tHANGS.  HER BODY JUMPS FROM THE IMPACT OF THE BULLETS, HER\n\tHEAD FLIES BACK AND SHE SLUMPS, THE NOOSE TIGHTENS; THE DOOR\n\tOF THE STALL SWINGS SLOWLY SHUT, AS PETER TURNS ON HELEN,\n\tWHERE SHE LIES ON THE FLOOR, HORROR-STRUCK.\n\n\tEXT. AUDITORIUM - NIGHT\n\n\tWITH EFFICIENCY AND CAUTION FBI SWAT TYPES MOVE TOWARD THE\n\tAUDITORIUM.  A GRAPPLING HOOK IS THROWN HIGH OVER THE ROOF;\n\tTHEY PREPARE FOR AN ASSAULT.  A HELICOPTER SWOOPS IN, BATHING\n\tTHE SCENE IN ITS BRILLIANT LIGHT...\n\n\tINT. AUDITORIUM STAGE - NIGHT\n\n\tPETER HAS HELEN ON THE STAGE WHERE CHAIRS ARE RANDOMLY\n\tSCATTERED AND PUSHED HER TO A SEAT FACING HIM, ALMOST KNEE\n\tTO KNEE... HELEN WILL USE HER PSYCHOLOGICAL WILES TO TRY TO\n\tTAKE AWAY PETER'S CONTROL OF THE SITUATION... PETER LOOKS UP\n\tAT THE SOUND... HE IS PROUD AND THRILLED.\n\n\t\t\t\tPETER\n\t\tListen to them!  We'll be on all\n\t\tthree channels.\n\n\t\t\t\tHELEN\n\t\tKill me, Peter, do it, now.\n\n\t\t\t\tPETER\n\t\tNo.  Not yet.\n\n\t\t\t\tHELEN\n\t\tDo it.  If that's what all this\n\t\tcarnage is about, then do it.  Have\n\t\tenough guts to do it.\n\n\t\t\t\tPETER\n\t\tDon't talk to me about courage.  I\n\t\tknow death, what it's like to kill.\n\t\tYou're not a killer -- you watched\n\t\tDaryll Lee kill that cop and you\n\t\tdidn't make a peep, because you\n\t\twere paralyzed with fear.  You\n\t\tchocked.  I know something else about\n\t\tyou.\n\n\tPeter is jerking about with amphetamine energy; he pops a\n\tpill into his mouth and swallows...\n\n\t\t\t\tPETER\n\t\tYou want one?  No?  There was\n\t\tsomething in you that was\n\t\tfascinated, that wanted to see what\n\tit was like for a man to die.\n\t\tEverybody feels it.  Like every\n\t\tperson who slows to see a bad\n\t\taccident, or runs to see a fire.\n\t\tThat's true.  I see it in you...\n\t\tyou're the same as me.\n\n\tTHERE IS NOISE OUTSIDE... LIKE SOMEONE BREAKING IN.\n\n\t\t\t\tPETER\n\t\tOh, no.\n\n\tHE GRABS HER, AND SHE MOVES WITH HIM, WITHOUT RESISTANCE, AS\n\tHE TURNS OUT THE LIGHTS INSIDE.\n\n\tFLOODLIGHTS SUDDENLY ILLUMINATE THE FACADE OUTSIDE,\n\tINCREASING THE BRILLIANCE OF THE LIGHT STREAMING IN AND\n\tDARKENING THE SHADOWS FURTHER.  GERMAN EXPRESSIONISM.\n\n\tHe leads her back to the stage... he pushes her into a chair\n\tfacing him... He looks into her face and smiles...\n\n\t\t\t\tPETER\n\t\tWe'll keep talking.  Until they get\n\t\there.  Then...\n\t\t\t(smiles)\n\n\t\t\t\tHELEN\n\t\tI have no life anymore.  I ruined\n\t\tyour life, make me pay for it.\n\n\t\t\t\tPETER\n\t\tWhy did you do that?  Didn't you\n\t\thave any idea how hard it was for\n\t\tme, to get that far?  I worshipped\n\t\tyou.  You inspired me.  I thought\n\t\tyou could understand me the way you\n\t\tunderstood the others.  I knew that\n\t\tabout you -- the ones you admired\n\t\twere the great murderers; they\n\t\tfascinated you.\n\n\t\t\t\tHELEN\n\t\tThat's not who I admire -- I admire\n\t\tpeople who are good at what they\n\t\tdo, great artists, writers,\n\t\tthinkers...\n\n\t\t\t\tPETER\n\t\tI don't have the talent for any of\n\t\tthose things.  All I have a talent\n\t\tfor is death.  And I am one of a\n\t\tkind.  What do you think of your\n\t\tstudent now?  I have made you\n\t\tfamous, I am your creation and your\n\t\tmonument.\n\n\tBEHIND HIM A SHADOWY FIGURE DARTS FROM HIDING SPOT TO A\n\tVANTAGE POINT: WE CAN'T MAKE OUT THE FIGURE... HELEN SEES\n\tBUT PETER DOES NOT.\n\n\t\t\t\tHELEN\n\t\tIf you let me, I can make you more\n\t\tfamous than any of them.\n\n\t\t\t\tPETER\n\t\tOh, please.  I know what's coming,\n\t\tnow.  \"Let me help you...\"\n\n\t\t\t\tHELEN\n\t\tDo anything you want to me.  I give\n\t\tmyself to you.  Only put the knife\n\t\tdown.  Isn't this what you always\n\t\twanted?  I know it's what we all\n\t\twant, to love and to loved.  I\n\t\tcould love you.  You could work\n\t\ttogether in some safe place, learn\n\t\tto really understand you, help you,\n\t\tgive you some peace of mind, some\n\t\thappiness...\n\n\t\t\t\tPETER\n\t\tBack in the driver's seat again,\n\t\tDoctor?  That old dream -- study us\n\t\tto see what makes us sick.  So you\n\t\tcan find a cure -- they'd name it\n\t\tafter you?  Death is the only cure\n\t\tfor people like me.\n\n\tHe leans toward her with the knife.  This might be the\n\tmoment.  His gun lies on the floor beside him.\n\n\tHER EYES HAVE FLICKED TO THE SHADOW BEHIND HIM; HE SEES IT\n\tAND STOOPS TO PICK UP THE GUN AND FIRES INTO THE SHADOWS,\n\tTWO OR THREE QUICK ROUNDS.  HE TURNS BACK TO HELEN, DROPPING\n\tTHE GUN TO REACH FOR THE KNIFE.\n\n\tHELEN HEAD BUTTS HIM WITH ASTONISHING STRENGTH, KNOCKING HIM\n\tBACKWARD.  SHE STANDS... HE COMES UP WITH GUN... AND AIMS AT\n\tHER...\n\n\tBEHIND HIM M.J. STEPS OUT OF THE SHADOWS HAVING NOW A CLEAN\n\tSHOT.\n\n\tHELEN DOESN'T GIVE A CLUE, JUST LOOKS INTO PETER'S EYES AS\n\tM.J. AND PETER IN SLOW MOTION DETAILS AS SHE LINES UP HER\n\tSHOT: SHE COULD KILL HIM OR GO FOR THE EXPOSED SHOULDER.\n\n\t\t\t\tHELEN\n\t\tDo it.  For God's sake, now...\n\n\tM.J. FIRES.\n\n\tPETER IS SPUN AWAY FROM HELEN BY THE IMPACT, STANDS THERE,\n\tSHAKING WITH THE SHOCK OF THE HIT... HE STARES AT HER.\n\n\t\t\t\tPETER\n\t\t\t(surprised, like a\n\t\t\t child)\n\t\tYou hurt me!\n\n\tM.J. HOLDS HER GUN ON HIM, READY TO SHOOT AGAIN, BUT HE JUST\n\tGOES DOWN ON ONE KNEE, HIS BODY VIOLENTLY SHUDDERING... AS:\n\n\tTHERE IS A HUGE SOUND OF BREAKING GLASS AND THEN AN ENORMOUS\n\tEXPLOSION THAT THROWS THEM TO THE GROUND.\n\n\tTHE BIG FRONT DOORS ARE BLASTED OPEN, AND THE FLAK VESTED\n\tSWAT TEAM SWARMS THROUGH... SMOKE FROM THE CONCUSSION\n\tGRENADE SWIRLS IN THE CHIAROSCURO OF FLOODLIGHTS AND\n\tSHADOWS.\n\n\tOUT OF THE SMOKE COME SKI-MASKED SWAT MEN...\n\n\t\t\t\tM.J. & HELEN\n\t\tNo!!\n\n\tPETER TURNS TO THE SWAT TEAM, OFFERING HIMSELF, AS THE WOMEN\n\tSCREAM TO THE SWAT MEN'S WOUNDED AND HARMLESS...\n\n\tA PATTERN OF RED DOTS FROM LASER BEAM SIGHTS ON THE SWAT\n\tTEAM RIFLES DAPPLE PETER'S HEAD AND TORSO.\n\n\tSWAT TEAM\n\n\tLIKE A FIRING SQUAD THE TEAM FIRES.\n\n\tPETER'S BODY FLIES THROUGH THE AIR FROM THE IMPACT AND\n\tSLIDES SPRAWLING ACROSS THE STAGE TO A STOP.\n\n\t\t\t\t\t\t\tCUT TO:\n\n\tINT. AUDITORIUM - LATER\n\n\tM.J. SITS AS PARAMEDIC GENTLY PULL OFF HER SHIRT AND THE\n\tBULLET PROOF VEST THAT SAVED HER LIFE.\n\n\t\t\t\tM.J.\n\t\tJesus that hurts.  You think the\n\t\trib is busted?\n\n\t\t\t\tPARAMEDIC\n\t\tThat looks like just a bad bruise.\n\t\tI'll tape it up if you want to...\n\n\t\t\t\tM.J.\n\t\tI'll take some Tylenol and codeine,\n\t\tinstead, how about a lot of number\n\t\tsix?\n\n\tThe medic turns to his medicine bag.  Cops swarm around\n\tthem.  Helen sits down next to M.J.  M.J. begins to put on\n\ther shirt, wincing at the movement.  Helen helps her.\n\n\t\t\t\tM.J.\n\t\t\t(it hurts)\n\t\tOh, God.\n\n\tSAKS AND QUINN EMERGE THROUGH THE CHIAROSCURO OF SMOKE AND\n\tLIGHT AND SHADOW.  When M.J. sees him she takes out her gun\n\tand hands it to him.  It is what he expects, but she\n\tmisunderstands -- she is offering it to him as her\n\tresignation from the cops.  He takes it only as a part of\n\tofficer related shooting routine.  SHE LOOKS INTO HIS FACE\n\tAS HE SMELLS THE MUZZLE, KNOWS SHE FIRES IT, APPROVED.\n\n\t\t\t\tQUINN\n\t\tI'll take it, kid.  You take two\n\t\tweeks paid leave.  Don't waste a\n\t\tsecond thinking about that shitbag.\n\t\tThen come back.  You're a cop, M.J.\n\n\tHe nods to Helen...\n\n\t\t\t\tQUINN (cont'd)\n\t\tGet the civilians outta here.\n\n\t\t\t\tM.J.\n\t\tShe's in no shape to give her\n\t\tstatement tonight...\n\n\t\t\t\tQUINN\n\t\tNo, she can come in tomorrow...\n\t\tgonna want to know a lot of\n\t\tthings...\n\n\tB.G. the cops have pulled PETER'S BODY BY THE FEET, LETTING\n\tHIM BUMPITY BUMPITY BUMPITY DOWN THE STEPS from the stage\n\tand lifted him onto a gurney.  The body is wheeled past\n\tthem, as...\n\n\t\t\t\tHELEN\n\t\tThe only one who could tell you\n\t\twhat you really need to know is\n\t\tdead.\n\n\t\t\t\tQUINN\n\t\tYeah, it's a thought...\n\n\tOf no importance to him, he turns away...\n\n\tINT. AUDITORIUM - NIGHT\n\n\tIn the LOBBY area between the auditorium proper and the big\n\texterior doors (now the worse for wear from the concussion\n\tgrenades).  Outside, through the glass we SEE a media circus\n\tunder the BRIGHT LIGHTS put up for the assault.  M.J. and\n\tHELEN SQUINT AGAINST THE LIGHT, AND TURN...\n\n\tTHE AUDITORIUM (POV).\n\n\tThe cops and technicians are working away; at one side is a\n\tsmall door -- easy escape.  They run toward it...\n\n\tEXT. MCCLUSKEY AUDITORIUM - NIGHT\n\n\tIt is dark where they step out into the night.  Around the\n\tcorner of the building we see the light from the MEDIA\n\tCIRCUS.  THEN HELEN STEPS OFF DOWN INTO THE DARK CAMPUS.\n\tM.J. LOOKS AT HER: REALIZING: HELEN IS NO LONGER AFRAID.\n\tSHE CATCHES UP TO HER.  HOLD ON THEIR BACKS AS THEY WALK\n\tAWAY...\n\n\t\t\t\tM.J.\n\t\tYou could use a long hot bath, you\n\t\tknow that?  You better get somebody\n\t\tto drive you home.\n\n\t\t\t\tHELEN\n\t\tWhy can't I drive home?  I will.\n\t\tYou.  Look at you.  You need a ride\n\t\thome.  And you don't even know it.\n\n\t\t\t\tM.J.\n\t\t\t(beat)\n\t\tWell, thanks.\n\n\tThe two women continue down toward Helen's car, just outside\n\tthe circle of media.  CAMERA RISES AND RISES TO A HIGH FULL\n\tSHOT.\n\n\tTHE MOUTH AND THE HAIRCUT spot them and race toward them.\n\n\t\t\t\tSUSAN\n\t\tHey!  Halloran!  What's the story\n\t\there?\n\n\tOn the two women getting in the car...\n\n\t\t\t\tHELEN\n\t\tIf she has to ask, she's never\n\t\tgonna know.\n\n\tHIGH FULLSHOT OF THE CAMPUS AS THEY DRIVE AWAY INTO THE\n\tNIGHT.\n\n\t\t\t\tTHE END\n\n\n\n\n\n\nCopycat\nWriters :   Frank Pierson  Ann Biderman  Jay Presson Allen\nGenres :   Crime  Horror  Mystery  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "After giving a guest lecture on criminal psychology at a local university, Dr Helen Hudson (Weaver), a respected field expert on serial killers, is cornered in a lavatory by one of her previous subjects, Daryll Lee Cullum (Harry Connick, Jr.), who kills a police officer and brutally attacks her. Helen becomes severely agoraphobic as a result, sealing herself inside an expensive hi-tech apartment, conducting her entire life from behind a computer screen and assisted by a friend, Andy (John Rothman).\nWhen a new series of murders spreads fear and panic across her home city of San Francisco, Inspector M.J. Monahan (Hunter) and her partner Reuben Goetz (Dermot Mulroney) solicit Helen's expertise. Initially reluctant, Helen soon finds herself drawn into the warped perpetrator's game of wits.\nAs the murders continue Helen realizes that the elusive assailant draws inspiration from notorious serial killers, including Albert DeSalvo, The Hillside Strangler, David Berkowitz, Jeffrey Dahmer, and Ted Bundy. When the murderer begins contacting and even stalking Helen, she and M.J. realize that he is after them, and they enlist the aid of Cullum, who tells them what he knows about the killer. Helen soon realizes that the Copycat Killer has been following the list of serial killers in the same order as she had presented them in her lecture at the university on the night of her attack, and the two work to figure out where and when he will strike next. Unfortunately, Reuben is later killed in an unrelated shooting incident at the police station, leaving only M.J. to continue the search for the serial killer.\nAfter Andy is killed in a manner reminiscent of Jeffrey Dahmer, M.J. deduces the killer to be Peter Foley (William McNamara). After leading a failed attempt to catch Foley at his house, M.J. discovers that he has kidnapped Helen and taken her back to the scene of Daryll Lee's attempt at killing her—the restroom of the lecture hall. Once she gets there, M.J. finds Helen bound and gagged in the same manner that Cullum did before, but she is ambushed and shot by Foley, rendering her unconscious. As Foley prepares to kill M.J., Helen desperately attempts to save her by ruining Foley's carefully replicated crime scene the only way she can—by attempting to hang herself. Foley panics and cuts Helen down, and Helen is able to get away and escape to the building's roof. Her agoraphobia kicks in again, and Helen finds herself cornered. Accepting her fate, she turns to face Foley. However, just as he is about to kill her, M.J. shoots him in the brachial nerve, giving him one last chance to surrender. When he pulls his gun back on her, however, she shoots him dead.\nSome time later, Daryll Lee writes a letter to another serial killer, instructing him on how to kill Helen, revealing that he had been aiding Foley all along."}