{"title": "Coraline", "full_text": "CORALINE\n\n\n\n                                 Written by\n\n                                Henry Selick\n\n\n\n                            Based on the novel by\n\n                                Neil Gaiman\n\n\n\n          \n\n          HEAD CREDIT SEQUENCE MYSTERIOUS SEWING ROOM - NIGHT,\n\n          \n          A HAUNTING LULLABY plays against a black, star-pricked\n          sky when something appears in the distance. A BUTTON-EYED\n          DOLL floats towards CAMERA, through the open window of a\n          small sewing room where it lands in a pair of WAITING\n          HANDS, hands that are made of SEWING NEEDLES.\n\n          \n          The doll - which resembles a YOUNG BLACK GIRL in old-\n          fashioned clothes, hair fixed with ribbons and braids -\n          is placed on a sewing table. An elaborate sewing kit is\n          opened, and, in flickering green light, the NEEDLE-HANDS\n          go to work. The doll's old clothes are cut away; button-\n          eyes torn off; hair pulled out. The doll's stuffing is\n          removed and then the empty cloth body is pulled inside\n          out, turning from NUT BROWN to PALE PINK.\n\n          \n          Sawdust is poured in the NEW DOLL's mouth; facial\n          features added; blue yarn hair punched in; and then a\n          fresh pair of shiny black button eyes is selected from a\n          button drawer.\n\n          \n          The transformed doll, in a LITTLE YELLOW RAINCOAT, its\n          new button eyes affixed, is released out the window and\n\n          BACK INTO THE NIGHT.\n\n          \n\n          LAST HEAD CREDIT APPEARS, THEN FADES.\n\n          \n\n          \n\n          EXT PINK PALACE, ASHLAND OREGON - DAY\n\n          \n          WIDE ANGLE on a rambling old Queen Anne-style house with\n          tacked-on outside stairs. It's late winter, the sky a\n          damp, grey sponge. A SIGN in the foreground reads \"Pink\n          Palace, Apartment for Rent\".\n\n          \n          MR. BOBINSKY - a seven-foot-tall blue-skinned man -\n          performs calisthenics on the rooftop, counting in\n          Russian.\n\n          \n\n                                 MR. BOBINSKY\n                    Dras, dva, tri, chetyri.\n                    Dras, dva, tri, chetyri.\n                    Dras, dva, tri ...\n\n          \n\n          \n          A BEEPING SOUND begins and he pauses. A tired MOVING VAN\n          backs into frame and up the muddy driveway. A VW BEETLE -\n          suitcases roped to its top - recklessly passes the truck\n          and disappears around the side of the house. Bobinsky\n          shakes his fist angrily after the car and shouts:\n\n          \n\n                                   MR. BOBINSKY (CONT'D)\n                    Mer-sa-vich!\n\n          \n          He marches away indignantly. One of the MOVERS, unseen in\n          the truck, speaks to his companion.\n\n          \n\n                                 MOVER 2 (O.C.)\n                    We're here. Time to muscle up.\n\n          \n\n          \n          ANGLE ON moving truck's REAR DOORS as they're wrenched\n          open by two men - MOVER 1, tall and bear-shaped, and\n          MOVER 2, built like a brick top - to reveal a lot of\n          BOXES and BEAT-UP FURNITURE.\n\n          \n          They haul out the LOADING RAMP towards CAMERA.\n\n          \n          NEW ANGLE, EXTERIOR STAIRS to BASEMENT FLAT. APRIL SPINK,\n          a rotund little old English lady with bad legs, surveys\n          the MOVERS as they pass by her chair-lift with boxes and\n          furniture. The old gal can't wait to tell her flat mate\n          below about the young, strapping men.\n\n          \n\n                                 MOVER 2 (CONT'D)\n\n                           (EFFORTS)\n                    Got it? Almost there, just a few more.\n                    Come on, now, LIFT.\n\n          \n          ANGLE ON FRONT PORCH. The job finished, Mover 2 heads\n          down the front steps while Mover 1 waits for a signature\n          from the unseen-but-for-his-hands new tenant. Papers\n          signed, a tip of a single, grubby dollar bill is placed\n          in the outstretched hand of the disappointed mover, and\n          the door is shut.\n\n          \n\n          \n\n          EXT HOUSE, REAR VIEW - SAME\n\n          \n          ANGLE from BACK YARD. Hiding behind shrubs, WE SHARE the\n          POV of a MYSTERIOUS SPY. With a CLICK, a close-up lens is\n          rotated into place to better see the movers quietly pack\n          into the truck and drive away. A MANGY BLACK CAT walks\n          right in front of the lens and looks at us with concern.\n          OFF-SCREEN, a door bangs open. WE FOLLOW the cat as it\n          races up a tree and out a branch towards the BACK PORCH\n          to investigate.\n\n          \n          CORALINE JONES, 11, steps onto the porch in a YELLOW\n          RAINCOAT with a shoulder bag. WE - SPY'S POV - CLICK to a\n          CLOSE-UP to find this new tenant has BLUE HAIR and a\n          skeptical face.\n\n          \n          NEW ANGLE, non-spy reverse, on Coraline as she glances\n          furtively over her shoulder, then hops down the steps and\n          moves diagonally away from the house.\n\n          \n          NEW Angle, SPY POV. We watch Coraline head towards the\n          WOODY SHRUB we've hidden ourselves in. We DUCK DOWN.\n\n          \n          ANGLE on Coraline, non-spy, shrub by garden gate. She\n          reaches into the shrub and breaks off a FORKED BRANCH.\n          She removes the stick's red leaves, aims it like a\n          DOWSING ROD and heads into the garden.\n\n          \n          CAM PUSH IN to shrub as the SPY RISES UP, wearing a three-\n          eyed SKELETON MASK on his head and SKELETON GLOVES on his\n          hands. The black cat hops into frame, glances at the spy\n          and follows the girl.\n\n          \n\n          \n\n          MONTAGE VARIOUS EXT - SAME\n\n          \n\n          AFISH POND IN GARDEN - SAME\n\n          \n          Coraline explores the drained, crumbling pond. She finds\n          an old TURTLE SHELL in the muck and holds it up. After\n          rapping on it to make sure it's empty, she puts the shell\n          into her shoulder bag.\n\n          \n          ANGLE ON CAROLINE, SPY POV. WE PUSH ASIDE dead vines from\n          the railing of the GARDEN BRIDGE for a better look.\n          Coraline aims her forked stick once more then follows it\n          up from the pond and out the BACK GATE. A gust of WIND\n          blows DEAD LEAVES into a swirling eddy WE TRACK high up\n          into the air.\n\n          \n\n                                                       DISSOLVE TO:\n\n          \n\n          \n\n          ROCKY PATH HIGH ABOVE HOUSE - LITTLE LATER\n\n          \n          SPY POV on sky, now dark with GATHERING STORM. Hidden\n          behind a NATURAL WALL OF STONES, WE TILT DOWN to view\n          Coraline crossing frame on a STEEP HILLSIDE path. She\n          steps on an old RAILROAD TIE, and her foot SINKS into the\n          rotted wood, stopping her.\n\n          \n          WE LEAN OUT for a better view, and DISLODGE some stones\n          that roll down past her. WE DUCK as she jerks her head\n          our way.\n\n          \n          NEW ANGLE, non-spy. Unnerved, Coraline calls out.\n\n          \n\n                                 CORALINE\n                    Hello?...   Who's there?\n\n          \n          She throws a rock over the wall of stones, HITS THE\n          UNSEEN SPY, causing a CRY OF PAIN. ANIMAL? HUMAN? Freaked\n          out, she GASPS, runs up the trail.\n\n          \n          NEW ANGLE, SPY POV. We rise up to watch and the black cat\n          hops onto the stone wall.\n\n          \n\n          \n\n          EXT. OVERGROWN ORCHARD - CONT.\n\n\n          \n          Coraline races down past an OLD TRACTOR and into an\n          ORCHARD. WIND begins to blow.\n\n          \n          NEW ANGLE as we move beside Coraline through the old\n          apple trees, where she nearly trips on the tongue of a\n          harvest cart.\n\n          \n          DOWN ANGLE ON on Coraline as she BACKS INTO a circle of\n          TOADSTOOLS in front of a STUMP. BREATHING HARD, she looks\n          out for her pursuer.\n\n          \n          NEW ANGLE. The black cat shoots past Coraline in the tall\n          grass. She can't see him but she knows something is\n          there. Already behind her now, the cat LEAPS onto the\n          stump with a loud, warning MEROWWW!\n\n          \n          STARTLED, Coraline YELLS and whips around. She's both\n          angry and relieved when she sees it's just some cat.\n\n          \n\n                                 CORALINE\n                    You scared me to death, you mangy thing!\n\n          \n          Cat GLARES at her with BLUE OPAL EYES, makes a low growl\n          as she stands. She exhales.\n\n          \n\n                                 CORALINE (CONT'D)\n                    I'm just looking for an old well. Know\n                    it?\n\n          \n          Cat BLINKS EYES slowly.\n\n          \n\n                                 CORALINE(CONT'D)\n                    Not talking, huh?\n\n          \n          The wind picks up. She grasps the forks of her stick,\n          closes her eyes, and, tracing a figure eight above her,\n\n          SAYS:\n\n          \n\n                                 CORALINE (CONT'D)\n                    Magic dowser, magic dowser: show... me...\n                    the well!\n\n          \n          ANGLE ON CORALINE FROM HIGH BLUFF. The SPY moves into\n          frame, astride some kind of MOTOR-BIKE. He presses a\n          button on the handlebars and BLASTS a loud AIR HORN.\n          STARTLED, Coraline SPINS around.\n\n          \n          UP ANGLE ON SPY. As LIGHTNING FLASHES and THUNDER ROLLS,\n          Coraline sees him for the first time. With his turret-\n          lensed SKULL MASK and SKELETON GLOVES and black FIREMAN'S\n          COAT flapping in the wind, he looks like a PSYCHO KILLER!\n\n          \n\n                                 CORALINE (CONT'D)\n                           (freaked out)\n\n                    AHHHHH!\n\n          \n          He REVS his motor, pops a wheelie, then SWOOPS DOWN the\n          bluff towards her. She HOLLERS IN FEAR, then tries to\n          WHACK HIM with her forked stick.\n\n          \n\n                                 CORALINE (CONT'D)\n\n                    GET AWAY FROM ME--\n\n          \n          He SNATCHES it from her as he passes, KNOCKING HER to the\n          ground. He SIDE-SKIDS his bike, hops off and JUMPS UP\n          onto the stump. Looking TEN FEET TALL from the ground,\n          THUNDER AND LIGHTNING at a peak, the Spy turns his THREE-\n          EYED TURRET LENS and studies her like a predatory alien.\n\n          \n          And then, the thunder and lightning just FADE OUT and\n          this psycho-killer, three-eyed spy pulls off his mask and\n          Coraline GASPS -- he's just a short kid in a costume.\n\n          \n          Shoulders hunched, neck bent, the Spy - real name WYBIE\n          LOVAT - aged 12 - examines Coraline's forked stick, aims\n          it around.\n\n          \n\n                                 WYBIE\n\n                           (OBLIVIOUS)\n                    Hoo! Let me guess, you're from Texas or\n                    Utah; someplace dried out and barren,\n                    right? I heard about water-witching\n                    before but it doesn't make sense; I mean,\n                    it's just an ordinary branch.\n\n          \n          Coraline, SNATCHES it from his GLOVED HANDS.\n\n          \n\n                                 CORALINE\n\n                           (ENRAGED)\n\n                    IT'S A DOWSING ROD!\n\n          \n          Coraline smacks Wybie.\n\n          \n\n                                   WYBIE\n                    Ow!\n\n          \n\n                                 CORALINE\n                    And I DON'T LIKE BEING STALKED, not by\n\n                    PSYCHO-NERDS OR THEIR CATS!\n\n          \n          He crouches, nervous, to scratch the cat behind his ears.\n\n          \n\n                                 WYBIE\n                    He's not really my cat; he's kinda feral\n                    ­ you know, wild? Of course, I do feed\n                    him every night and sometimes he'll come\n                    in my window `n bring me little dead\n                    things.\n\n          \n          The cat PURRS like a diesel.\n\n          \n\n                                 CORALINE\n\n                           (TOUGH)\n                    Look, I'm from Pontiac.\n\n          \n\n                                 WYBIE\n                    Huh?\n\n          \n\n                                 CORALINE\n                    MICHIGAN? And if I'm a \"water witch\",\n\n                    THEN--\n                           (points stick, stomps foot)\n                    --where's the secret WELL?\n\n          \n\n                                 WYBIE\n                    You stomp too hard and you'll fall in it!\n\n          \n          Coraline reacts, hops out of the springy circle. The boy\n          scrapes at the ground, revealing a CIRCULAR COVERING\n          made of WOODEN PLANKS. He wedges a fallen branch under\n          one side, and, using a rock for the fulcrum, pries up the\n          covering.\n\n          \n\n                                 WYBIE (CONT'D)\n                    See? Supposed to be so deep if you fell\n                    to the bottom and looked up, you'd see a\n                    sky full of stars in the middle of the\n                    day.\n\n          \n\n                                 CORALINE\n\n                           (SOFTENS)\n                    Huh.\n\n          \n          Her frown RELAXES and the black cat tilts his head,\n          noticing her change in tone. He steps off the branch, and\n          the well cover thumps in place.\n\n          \n\n                                 WYBIE\n                    Surprised she let you move in...\n\n          \n          Jerks his head toward the pink house in distance.\n\n          \n\n                                 WYBIE (CONT'D)\n                    ... my Gramma. She owns the \"Pink Palace\"\n                           (indicates house in distance)\n                    Won't rent to people with kids.\n\n          \n\n                                 CORALINE\n                    What do you mean?\n\n          \n\n                                 WYBIE\n                           (suddenly worried)\n                    Uh... I'm not supposed to talk about it.\n\n          \n          Changing the subject, he lifts a gloved hand to shake.\n\n          \n\n                                 WYBIE (CONT'D)\n                    I'm Wybie, Wybie Lovat.\n\n          \n\n                                   CORALINE\n\n                             (SKEPTICAL)\n                    Wybie?\n\n          \n\n                                 WYBIE\n                    Short for Wyborne. Not my idea, of\n                    course. What'd you get saddled with?\n\n          \n\n                                 CORALINE\n                    I wasn't saddled with anything. It's\n                    Coraline.\n\n          \n\n                                 WYBIE\n                    Caroline what?\n\n          \n\n                                 CORALINE\n                    Coraline. Coraline Jones.\n\n          \n\n                                 WYBIE\n                           (confused, not hearing it)\n                    Hmmm... It's not real scientific, but I\n                    heard an ordinary name, like Caroline --\n\n          \n          Her face goes as DARK as the rain clouds above.\n\n          \n\n                                 WYBIE (CONT'D)\n                    -- can lead people to have ordinary\n                    expectations about a person--\n\n          \n\n                                 WYBIE'S GRANDMOTHER (O.C.)\n                           (calling from afar)\n                    Wyborne!\n\n          \n\n                                 CORALINE\n                    I think I heard someone calling you,\n                    Wyborne.\n\n          \n\n                                 WYBIE\n                    What? I didn't hear anything--\n\n          \n\n                                 CORALINE\n                    Oh, I definitely heard someone, Why-were-\n                    you-born.\n\n          \n          A distant dinner bell clangs.\n\n          \n\n                                  WYBIE'S GRANDMOTHER (O.C.)\n                    Wyborne!\n\n          \n\n                                 WYBIE\n                           (under his breath, nervous)\n                    Grandma!\n\n          \n          He holds up his hands in surrender, nodding with eyes\n          closed, forcing some laughs.\n\n          \n\n                                 WYBIE (CONT'D)\n                    Heh. Well, great to meet a Michigan\n                    water witch.\n\n          \n          He picks up his bike, wheels it around, then holds up his\n          gloved hands.\n\n          \n\n                                 WYBIE (CONT'D)\n                    But I'd wear gloves next time.\n\n          \n\n                                  CORALINE\n\n                            (SKEPTICAL)\n                    Why?\n\n          \n          He points to her dowsing rod, nods.\n\n          \n\n                                 WYBIE (CONT'D)\n                    `Cause that dowsing rod of yours? Uh,\n                    it's poison oak.\n\n          \n\n                                  CORALINE\n                    Ehh!!\n\n          \n          Coraline drops the stick as he zooms away and wipes her\n          hands on her clothes.\n\n          \n          The cat merows at her, shaking his head with a pitying\n          look, then trots away after Wybie. She STICKS OUT HER\n          TONGUE at him.\n\n          \n          She looks down at the COVERING to the well. Coraline\n          finds a PEBBLE and drops it through A SMALL KNOT-HOLE.\n          Ear at the knot-hole, she counts until there's a watery\n          \"plop\" far below. FAT RAINDROPS start to fall around her.\n\n          \n\n                                                 ROTATE DISSOLVE TO:\n\n          \n\n          INT. KITCHEN - NEXT MORNING\n\n\n          \n          It's POURING out. Coraline looks out a window at the DEAD-\n          LOOKING GARDEN, and places PACKETS OF SEEDS - pumpkins,\n          squash, snap dragons, bleeding hearts - on the sill.\n          She's developed a REDDISH RASH - poison oak - on one\n          hand.\n\n          \n          The main floor kitchen, like most   things in the Pink\n          Palace, is barely maintained, and   looks worn and faded.\n          Coraline's MOTHER, MEL JONES, 40,   bangs away at her\n          laptop on the table, MOVING BOXES   stacked nearby. She's\n          plain-looking and tired and wears   a NECK-BRACE.\n\n          \n\n                                 CORALINE\n                    I almost fell down a well yesterday, Mom.\n\n          \n\n                                 MEL\n                           (not listening)\n                    Uh huh.\n\n          \n\n                                 CORALINE\n                    I would have died.\n\n          \n\n                                 MEL\n                           (continues typing)\n                    That's nice.\n\n          \n          Coraline scratches the rash on her hand, changes subject.\n\n          \n\n                                 CORALINE\n                    Hmmm. So can I go out? I think it's\n                    perfect weather for gardening.\n\n          \n\n                                 MEL\n                    No, Coraline. Rain makes mud. Mud makes a\n                    mess.\n\n          \n          Coraline turns to her.\n\n          \n\n                                 CORALINE\n                    But Mom, I want stuff growing when my\n                    friends come to visit. Isn't that why we\n                    moved here?\n\n          \n\n                                 MEL\n                    Something like that. But then we had the\n                    accident.\n\n          \n\n                                 CORALINE\n                    Wasn't my fault you hit that truck.\n\n          \n\n                                 MEL\n                    I never said it was.\n\n          \n\n                                 CORALINE\n\n                           (MUTTERS)\n                    I can't believe it -- you and Dad get\n                    paid to write about plants and you hate\n                    dirt.\n\n          \n          Mel stops typing, loses her patience.\n\n          \n\n                                 MEL\n                    Coraline, I don't have time for you right\n                    now. And you still have unpacking to do.\n                    Lots of unpacking.\n\n          \n\n                                 CORALINE\n                    That sounds exciting.\n\n          \n          Mel remembers something.\n\n          \n                                 Mel (CONT'D)\n                    Oh - some kid left this on the front\n                    porch.\n\n          \n          Coraline walks over and is handed a NEWSPAPER-WRAPPED\n          PACKAGE. Attached note reads:\n\n          \n\n                                 WYBIE (V.O.)\n                    Hey Jonesy, look what I found in Gramma's\n                    trunk. Look familiar? Wybie.\n\n          \n          She rips open the package and finds the BUTTON-EYED, BLUE-\n          HAIRED, YELLOW RAINCOAT-WEARING DOLL from the head\n          credits - it's a litte Coraline!\n\n          \n\n                                 CORALINE\n                           (to herself)\n                    Huh... a little me? That's weird.\n\n          \n          She crumples the note, both annoyed and charmed.\n\n          \n\n                                 MEL\n                    What's his name, anyway?\n\n          \n\n                                 CORALINE\n                    Wybie. And I'm way too old for dolls.\n\n          \n          But Coraline takes it with her and leaves the room.\n\n          \n\n          INT. STUDY - SAME\n\n\n          \n          CHARLIE Jones, 40, goose-necked and gangly with thinning\n          dark hair, HUNT-AND-PECKS at his ancient computer,\n          surrounded by boxes of GARDENING MAGAZINES and empty\n          coffee cups. Coraline, with doll, opens the SQUEAKY DOOR.\n          He doesn't turn.\n\n          \n\n                                 CORALINE\n                    Hey Dad, how's the writing going?... Dad?\n\n          \n          He ignores her reflection in his computer screen as he\n          types away, green letters on black. She CLEARS HER\n\n          THROAT.\n\n          \n\n                                 CHARLIE\n                    Hello, Coraline...\n                           (notices doll's reflection)\n                    And... Coraline doll?...\n\n          \n\n                                 CORALINE\n                    D'you know where the garden tools are?\n\n          \n          He hears rain outside.\n\n          \n\n                                 CHARLIE\n                    It's pouring out there, isn't it.\n\n          \n\n                                 CORALINE\n                    Humph, it's just raining.\n\n          \n\n                                 CHARLIE\n                    What'd the boss say?\n\n          \n\n                                 CORALINE\n\n                           (MOCKING)\n                    \"Don't even think about going out,\n                    Coraline Jones.\"\n\n          \n\n                                 CHARLIE\n                    Then you won't need the tools.\n\n          \n          Coraline GROANS, stamps her feet. Charlie just taps\n          harder on the keys. Pouting, she makes the door squeak,\n          opening and shutting it till he can't take any more. He\n          spins around.\n\n          \n\n                                 CHARLIE (CONT'D)\n                    Uhhh, you know, this house is a hundred\n                    and fifty years old.\n\n          \n\n                                   CORALINE\n                    So?\n\n          \n\n                                 CHARLIE\n                    So explore it!\n\n          \n          He grabs a pen and pad, holds it out.\n\n          \n\n                                 CHARLIE (CONT'D)\n                    Go out and ... count all the doors and\n                    windows and write that down. List\n                    everything blue!\n\n                           (BEGGING)\n                    Just let me work.\n\n          \n          She rolls her eyes, takes paper and pen and leaves.\n\n          \n\n          \n\n          MONTAGE, VARIOUS - SAME\n\n          \n\n          HALLWAY NEAR STAIRS\n\n          \n          Coraline, with doll, jumps on BUMP in carpet that moves\n          with each jump.\n\n          \n\n          LAUNDRY ROOM/WINTER GARDEN\n\n          \n          She wipes off the misted glass so she and the doll can\n          see out, then writes in her pad: 7 leaky windows. A drop\n          of water lands on the pad, smearing the ink. She adds\n          really between 7 and leaky windows.\n\n          \n\n          HALLWAY NEAR STAIRS\n\n          \n          Coraline thumps the carpet bump again and pounds up the\n          stairs.\n\n          \n\n          PARENT'S ROOM/BATHROOM\n\n          \n          A FRAMED PHOTO sits in the foreground on a beside table.\n          It shows a younger, happier Coraline with her parents by\n          the BEAR FOUNTAIN at the Detroit Zoo. RACK FOCUS to\n          bedroom door as it swings into the room, with Coraline\n          hanging on it. She drops to the ground and, doll and pad\n          in hand, decides to check out the bathroom.\n\n          \n          When she pulls aside the mildewed shower curtain she\n          finds a hundred skittering SILVERFISH BUGS.\n\n          \n\n                                    CORALINE\n                    Ewww!\n\n          \n          Disgusted, she jumps into the tub and smashes as many as\n          she can.\n\n          \n          She turns on the faucet to wash her hands, only to get\n          soaked with rusty water from the shower head.\n\n          \n\n                                    CORALINE (CONT'D)\n                    Ahh!!\n\n          \n          She shakes out her hair.\n\n          \n\n          HALLWAY NEAR STAIRS\n\n          \n          Coraline pounds down the stairs, spots the carpet bump\n          again in the hallway and jumps on it. A closet door\n          opens, a light on inside, and she goes to investigate.\n\n          \n\n          WATER HEATER CLOSET\n\n          \n          ANGLE OVER water heater on Coraline. She jots down one\n          rusty water heater in her pad. As she leaves, she flicks\n          off the light switch, not noticing a note taped beside it\n          that says: Do not turn off!\n\n          \n\n          \n\n          INT. STUDY - SAME\n\n\n          \n          Lights flicker and then Charlie's computer dies. He\n          hollers.\n\n          \n\n                                 CHARLIE\n                    No, no, no, no, no; GAAAA--!\n\n          \n\n          \n\n          INT. HALLWAY - SAME\n\n\n          \n\n                                    CHARLIE (O.S.)\n\n                    --AAAAAAA!\n\n          \n          Coraline reacts with guilty alarm, runs back to the\n          closet and --\n\n          \n\n          \n\n          INT. CLOSET - SAME\n\n\n          \n          -- spots the Do not turn off note. She flips the light\n          switch back on and gets out of there.\n\n          \n\n          \n\n          INT. LIVING ROOM - SAME\n\n\n          \n          The room is faded and cold with bare windows looking out\n          on rain and gray. The floor is strewn with moving boxes,\n          a few pieces of furniture, Charlie's old Nordic Track. A\n          few garden tools lean against one wall; a cardboard\n          mattress box leans against a corner wall.\n\n          \n          Coraline enters, counting windows and doors to note in\n          her pad. She sets the doll on a low table beside an open\n          moving box and smiles.\n\n          \n          The box is filled with her mom's collection of\n          SNOWGLOBES. She takes out her favorite - the BEAR\n          FOUNTAIN AT THE DETROIT ZOO - and shakes it. She studies\n          the globe and sighs with homesickness. She sets it\n          carefully on the FIREPLACE MANTEL, then unwraps the rest\n          of the snowglobes and places them beside it.\n\n          \n          Over the mantel hangs a PAINTING of a CRYING BOY IN BLUE -\n          a scoop of ice cream melting on his shirt, his hand\n          holding an EMPTY CONE. Coraline takes up pad and pen and\n          adds to her list, muttering aloud.\n\n          \n\n                                 CORALINE\n                    One boring blue boy in a painfully boring\n                    painting ... four incredibly boring\n                    windows ... and no... more... doors...\n\n          \n          She turns to grab the doll off the table by the snow\n          globe box. It's gone.\n\n          \n\n                                 CORALINE (CONT'D)\n                    All right, little me, where are you\n                    hiding?\n\n          \n          Scanning the room, she spots the doll LOOKING OUT FROM\n          BEHIND THE MATTRESS BOX leaned against the corner wall.\n          Perplexed, she walks over and kneels down to grab the\n          doll when she notices SOMETHING ON THE WALL behind the\n          box.\n\n          \n          She shoves the box aside, and discovers the outline of a\n          SMALL DOOR that's been wallpapered over.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Huh?\n\n          \n          Intensely curious, she calls to the kitchen.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Hey Mom...\n\n          \n\n          \n\n          INT. KITCHEN - CONTINUOUS\n\n\n          \n          Mom, typing away, ignores her.\n\n          \n\n                                 CORALINE (O.S.)\n                    Where does this door go?\n\n          \n\n                                 MEL\n                    I'm really, really busy!\n\n          \n\n          INT LIVING ROOM - CONTINUOUS\n\n          \n          Coraline tries to open it but there's no handle.\n\n          \n\n                                 CORALINE\n                    I think it's locked.\n\n          \n\n                                    MEL (O.S.)\n\n          \n\n          \n\n          INT. KITCHEN - CONTINUOUS\n\n\n          \n\n                                 CORALINE (O.S.)\n                    Pleeeeeeeeease!\n\n          \n          Mel gets up, really annoyed. Big sigh.\n\n          \n\n                                    MEL\n                    Uhhh...\n\n          \n\n          \n\n          INT. LIVING ROOM - SAME\n\n\n          \n          She walks over to Coraline, looks at the outline of the\n          door in the ratty old wallpaper.\n\n          \n\n                                  MEL\n                    Will you stop pestering me if I do this\n                    for you?\n\n          \n          Coraline nods her head quickly, PANTING like a dog.\n\n          \n\n                                    MEL (CONT'D)\n                    Fine.\n\n          \n          She heads back to the kitchen.\n\n          \n\n          \n\n          INT KITCHEN - CONTINUOUS\n\n          \n          Mel pulls open a drawer, pushes a bunch of loose brass\n          and nickel keys aside to find a small, sharp black key.\n          Holds it up.\n\n          \n\n          \n\n          INT LIVING ROOM - CONTINUOUS\n\n          \n          Mel cuts the wallpaper around the door and sticks the key\n          in the lock. Coraline looks on, giddy with anticipation,\n          the doll at her side. Mel turns the key, unlocks the\n          door, and pulls it open to reveal ... an UNBROKEN BRICK\n          WALL. Coraline is totally disappointed.\n\n          \n\n                                 CORALINE\n                    Bricks? I don't get it.\n\n          \n          Coraline scratches her wrist rash with annoyance.\n\n          \n\n                                 MEL\n                    They must have closed this off when they\n                    divided up the house.\n\n          \n          Mel gets up to leave.\n\n          \n\n                                 CORALINE\n                    You're kidding? And why is the door so\n                    small?\n\n          \n          Mel leaving room, turns back, and loses it.\n\n          \n\n                                 MEL\n                    We made a deal. ZIP IT!\n\n          \n          She exits. Coraline makes annoyed sound.\n\n          \n\n                                 CORALINE\n                    You didn't lock it.\n\n          \n\n                                  MEL (O.S.)\n                    AaaaaH!!!\n\n          \n          Coraline pushes the little door shut, her head lowered.\n\n          \n\n          \n\n          EXT. HOUSE - NIGHT\n\n\n          \n          WIDE ANGLE ON HOUSE. Pouring rain. We hear Charlie\n          singing a song about Coraline, badly.\n\n          \n\n                                 CHARLIE (O.S.)\n                    Oh, my twitchy witchy girl,\n\n          \n\n          \n\n          INT. KITCHEN - SAME\n\n\n          \n          CHARLIE, using OVEN MITT to protect his hand, takes a\n          BURNED-UP CASSEROLE DISH from the oven while mom closes\n          up her LAPTOP. Coraline sits at the table with her doll.\n\n          \n\n                                 CHARLIE\n                    I think you are so nice,\n                    I give you bowls of porridge\n                    And I give you bowls of ice --\n\n          \n          CHARLIE sets the dish on the table.\n\n          \n\n                                 CHARLIE\n                           (really bad note)\n                    -- cream!\n\n          \n          Coraline pushes it away, disgusted.\n\n          \n\n                                 CORALINE\n                    Why don't you ever cook, Mom?\n\n          \n\n                                 MEL\n                    Coraline, we've been through this before:\n                    your Dad cooks, I clean, and you stay out\n                    of the way.\n\n          \n          Coraline HUFFS.\n\n          \n\n                                 MEL (CONT'D)\n                    I swear I'll go food shopping soon as we\n                    finish the catalog.\n                           (indicates Coraline's plate)\n                    Try some of the chard, you need a\n                    vegetable.\n\n          \n\n                                 CORALINE\n                    Looks more like slime to me.\n\n          \n\n                                  CHARLIE\n                    Well, it's slime or bedtime fusspot --\n                    now what's it going to be?\n\n          \n          Coraline looks to her doll, cradles its head.\n\n          \n\n                                 CORALINE\n                    Think they're trying to poison me?\n\n          \n          She makes the doll's head nod \"yes.\" Coraline rolls her\n          eyes, looks up to the heavens and --\n\n          \n\n          \n\n          INT. CORALINE'S BEDROOM - SAME\n\n\n          \n          -- falls back, washed and dressed for bed, on her pillow.\n          Still raining out. Coraline puts the doll on the chair\n          beside her, then scratches at her wrist. ORIGAMI\n          DRAGONFLIES are strung between the tall, thin bed posts;\n          the TURTLE SHELL she found in the garden sits up on a\n          box, her NIGHT LAMP that projects stars and moons is\n          warming up on the bedside table. Despite her efforts at\n          decorating, Coraline's new bedroom feels small and cold,\n          cracked and faded.\n\n          \n          Coraline reaches for a framed PHOTO that rests on a toy\n          PRAYING MANTIS by her night lamp.\n\n          \n          It's her TWO BEST FRIENDS from home, posing in the snow\n          by her old school's marquee, its letters rearranged to\n          spell \"CORALINE, GOOD BYE!\" She touches her friends'\n          faces with her fingertips.\n\n          \n\n                                 CORALINE\n                    Don't forget about me, guys. Okay?\n\n          \n          She puts back the photo, hits the light switch over her\n          bed and, looking over at the doll, sighs.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Good-night...little me.\n\n          \n          Her breathing slows and, with the doll WATCHING HER, she\n          starts to fall asleep.\n\n          \n\n          \n\n          INT. CORALINE'S BEDROOM - DREAMTIME\n\n\n          \n          --SURREAL MIST SWIRLS out her window. MOONS AND STARS\n          SLOWLY MOVE across the walls.\n\n          \n          SOMETHING in the room goes t-t-t-t-t-t. Coraline sits up,\n          awake. SOMETHING CHITTERS under her bed. She leans over\n          her bedside, head first, peering underneath when a ghost-\n          pale KANGAROO MOUSE JUMPS OUT and bounds out the door.\n\n          \n\n          \n\n          INT. HALL - SAME\n\n\n          \n          She gives chase, down the upper hall, down the stairs,\n          snaps on the lower hall light, sees it hop into the\n          living room.\n\n          \n\n          \n\n          INT. LIVING ROOM - CONTINUOUS\n\n\n          \n          Coraline enters. The mouse edges out from beneath the\n          sofa, then hops frantically toward the SMALL DOOR behind\n          the wallpaper! Coraline runs and dives, but the door is\n          open a crack, and the mouse escapes.\n\n          \n          Coraline grabs the door's edge and pulls it open. Instead\n          of a brick wall, there is a DARK, EXPANDING TUNNEL, with\n          the hopping mouse heading towards a bluish light at the\n          far end.\n\n          \n\n                                 CORALINE\n                    Whoa...\n\n          \n          She catches her breath, pulls the door wider and CRAWLS\n\n          THROUGH.\n\n          \n\n          INT. PASSAGEWAY - CONTINUOUS\n\n\n          \n          Coraline MOVES FORWARD, towards the light ahead.\n\n          \n\n          \n\n          INT. OTHER LIVING ROOM ­ CONTINUOUS\n\n\n          \n          Coraline steps out through the same little door, into\n          what looks like the EXACT SAME LIVING ROOM she just left,\n          only something is different -- it feels deeper, more\n          dimensional.\n\n          \n\n                                 CORALINE\n                    Huh?\n\n          \n          She looks around, notices the painting over the\n          fireplace: the crying blue boy is now SMILING, his shirt\n          clean and his ice cream back on his cone.\n\n          \n          From across the hall, warm light comes from the kitchen\n          and the smell of delicious food wafts towards her nose.\n\n          \n\n                                 CORALINE (CONT'D)\n                    MMMMM, something smells good.\n\n          \n\n          \n\n          INT. OTHER KITCHEN - NIGHT\n\n\n          \n          Coraline enters to see her mother cooking at the stove,\n          wearing an apron and ROOSTER-HEAD OVEN MITTS. The light\n          and colors are much warmer and the details more perfect\n          in this kitchen. Other Mother is facing away from\n          Coraline as she works.\n\n          \n\n                                 CORALINE\n                    Mom?! What are you doing here in the\n                    middle of the night?\n\n          \n          Her mother turns from the stove to greet her and Coraline\n          is DUMBSTRUCK: she's got BUTTONS FOR EYES! She beams with\n          happiness at Coraline's arrival.\n\n          \n\n                                 OTHER MOTHER\n                    You're just in time for supper, dear!\n\n          \n\n                                 CORALINE\n                    You're not my mother.\n\n          \n\n                                 CORALINE (CONT'D)\n                    My mother doesn't have b-b-buh...\n\n          \n          Coraline points to her own eye.\n\n          \n\n                                 OTHER MOTHER\n                    B-b-b-buttons? Do you like them?\n\n          \n          She taps one with her nail.\n\n          \n\n                                 OTHER MOTHER (CONT'D)\n                    I'm your Other Mother, silly. Now go tell\n                    your Other Father that supper's ready.\n\n          \n          She opens the oven door and the intoxicating perfume of\n          great cooking fills the air. Coraline breathes it in,\n          suddenly VERY HUNGRY.\n\n          \n\n                                 OTHER MOTHER (CONT'D)\n                    Well, go on. He's in his study.\n\n          \n\n          \n\n          INT. OTHER HALLWAY - SAME\n\n\n          \n          Coraline goes down the hall and opens the study door.\n\n          \n\n          \n\n          INT. OTHER STUDY - CONTINUOUS\n\n\n          \n          She sees the back of a man like her father, only with\n          more hair. Instead of tapping away at his computer,\n          though, he's picking notes on a BABY GRAND PIANO.\n\n          \n\n                                 CORALINE\n                    Hello?\n\n          \n          He turns around. He, too, has SHINY BUTTON EYES. He seems\n          happier and a little more handsome than real Dad, and\n          wears an IRIDESCENT ROBE over POLKA DOT PAJAMAS, with\n          ORANGE MONKEY SLIPPERS on his feet. He smiles broadly.\n\n          \n\n                                 OTHER FATHER\n                    Hello, Coraline. Want to hear my new\n                    song?\n\n          \n\n                                 CORALINE\n                    My father can't play piano.\n\n          \n\n                                 OTHER FATHER\n                    No need to ... this piano plays ME!\n\n          \n          DR. SEUSS GLOVES ­ connected with rods and pulleys ­ POP\n          OUT of the piano's front and ONTO HIS HANDS. His hands\n          RAISE UP ­ then DROP DOWN to play pounding STRIDE PIANO\n          as Other Father SINGS out.\n\n          \n\n                                 OTHER FATHER (CONT'D)\n                    Making up a song about Coraline.\n                    She's a peach, she's a doll, she's a pal\n                    of mine.\n                    She's as cute as a button in the eyes of\n                    everyone who ever laid their eyes on Cor-\n                    a-line.\n\n          \n          Coraline is amazed as his hands fly.\n\n          \n\n                                 OTHER FATHER (CONT'D)\n                    When she comes around exploring\n                    Mom and I will never ever make it boring\n                    our eyes will be on Coraline.\n\n          \n          Anxious, she taps his shoulder to stop him.\n\n          \n\n                                 CORALINE\n                    I, uh ­ sorry ­ but she said to tell you\n                    the food's ready.\n\n          \n\n                                 OTHER FATHER\n                    Mmmmm! Who's starving? Raise your hand.\n\n          \n          He sticks his hand up, still in a glove, and his other\n          gloved hand slaps his face. She LAUGHS, then covers her\n          mouth.\n\n          \n\n          \n\n          INT. OTHER DINING ROOM - SAME\n\n\n          \n          Other Mother sets down a HUGE, ROASTED CHICKEN near\n          Coraline on a table spread with CANDLES, fine CHINA and\n          SILVER and a PINEAPPLE CENTERPIECE. FIGURE EIGHT MODEL\n          TRAIN TRACKS circle twin LAZY SUSANS covered in dishes of\n          POTATOES, SWEET PEAS, ROLLS, and CORN. The Other Father\n          seals this Norman Rockwell moment by making PRAYER HANDS\n          and a solemn face.\n\n          \n\n                                 OTHER FATHER\n                    We give our thanks and ask to bless,\n                    Our Mother's golden chicken breast!\n\n          \n          He laughs with glee then a STARTING BELL rings and it's\n          time to eat. Other Father really digs in while Coraline\n          tries some chicken.\n\n          \n\n                                 CORALINE\n                    Mmmm, this chicken is good.\n\n          \n\n                                 OTHER MOTHER\n                    Hungry, aren't you.\n\n          \n\n                                 CORALINE\n                           (nodding, mouth full)\n                    D'you have any gravy?\n\n          \n\n                                 OTHER MOTHER\n                    Well, here comes the gravy train! Choo-\n                    choo!\n\n          \n          Other Mother GIGGLES as a MODEL TRAIN circles round the\n          track, pulling a GRAVY BOAT CAR and blowing its whistle.\n          The train goes in one side of the centerpiece and comes\n          out the other, slowing till the gravy boat lines up with\n          Coraline's plate, where it POURS GRAVY on her potatoes.\n\n          \n\n                                 OTHER MOTHER\n                    Another roll, sweet peas? Corn on the\n                    cob?\n\n          \n          Other Mother looks on approvingly, not touching any food\n          herself.\n\n          \n\n                                 CORALINE\n                           (mouth full)\n                    I'm real thirsty.\n\n          \n\n                                 OTHER MOTHER\n                    Of course! Any requests?\n\n          \n          A beautiful CHANDELIER DRINK DISPENSER descends.\n\n          \n\n                                 CORALINE\n                    Mango milk shake?\n\n          \n          The dispenser SPINS, stops and fills her glass while\n          Other Mother presents dessert: a cake with candles that\n          POP UP and LIGHT THEMSELVES while the words \"WELCOME\n          HOME!\" write themselves in icing. Coraline is taken\n          aback.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Home?\n\n          \n          Her Other Parents squeeze each other's hands warmly.\n\n          \n\n                                 OTHER MOTHER\n                    We've been waiting for you, Coraline.\n\n          \n\n                                 CORALINE\n                    For me?\n\n          \n\n                                 OTHER FATHER\n                    Yep. Wasn't the same here without you,\n                    kiddo.\n\n          \n          Coraline remains a little unsure.\n\n          \n\n                                 CORALINE\n                    I didn't know I had an Other Mother.\n\n          \n\n                                 OTHER MOTHER\n                    Of course you do. Everyone does.\n\n          \n          She smiles at Coraline, her button eyes gleaming.\n\n          \n\n                                 CORALINE\n                    Really?\n\n          \n\n                                 OTHER MOTHER\n                    Uh huh, and soon as you're through\n                    eating, I thought we'd play a game.\n\n          \n          She taps her fingers a little too excitedly on the table.\n\n          \n\n                                 CORALINE\n\n                           (SKEPTICAL)\n                    You mean like, hide and seek?\n\n          \n\n                                 OTHER MOTHER\n                    Perfect! Hide and seek in the rain.\n\n          \n\n                                 CORALINE\n                    What rain?\n\n          \n          THUNDER, LIGHTNING, then RAIN appears outside the window.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Huh, what about the mud?\n\n          \n\n                                 OTHER FATHER\n                    We love mud here!\n\n          \n          Other Mother rises, walks towards Coraline.\n\n          \n\n                                 OTHER MOTHER\n                    Mud facials, mud baths, mud pies -- it's\n                    great for poison oak.\n\n          \n          The takes Coraline's rashy hand, but Coraline pulls it\n          away.\n\n          \n\n                                 CORALINE\n\n                           (SUSPICIOUS)\n                    How'd you know I--\n\n          \n          Coraline adjusts her tone.\n\n          \n\n                                 CORALINE (CONT'D)\n                    I, I'd love to play, but ... I better get\n                    home to my other mother.\n\n          \n\n                                 OTHER MOTHER\n                    But I'm your other mother.\n\n          \n\n                                 CORALINE\n\n                           (BEFUDDLED)\n                    I mean my other other mother. Mom number\n                    one?\n\n                           (YAWNS)\n                    I think I should get to bed.\n\n          \n\n                                 OTHER MOTHER\n                    Of course, sweetheart, it's all made up.\n\n          \n\n                                 CORALINE\n                           (shakes head)\n                    But ...\n\n          \n          Other Father steps in beside her.\n\n          \n\n                                 OTHER FATHER\n                    Come along, sleepyhead.\n\n          \n          They lead her from the table towards the stairs to her\n          bedroom.\n\n          \n\n          \n\n          INT. CORALINE'S OTHER BEDROOM - SAME\n\n\n          \n          In this world, Coraline's bedroom is a dream come true:\n          it is filled with rich color and light; there's a fire in\n          the fireplace, a sheer, lacy canopy over her now\n          beautiful bed. And her favorite toys are alive!\n\n          \n\n                                 CORALINE\n                    Wow.\n\n          \n          Her ORIGAMI DRAGONFLIES FLUTTER towards her.\n\n          \n\n                                 DRAGONFLIES\n                    Hello Coraline, hello, hello!\n\n          \n          Her BLUE SQUID greets her with a WAVE of its tentacle.\n\n          \n\n                                 TOY SQUID\n                    What's shakin', baby?\n\n          \n\n                                 CORALINE\n                    Hello.\n\n          \n          The TURTLE SHELL she'd found CIRCLES HER FEET on clothes\n          pin legs, making PANTING SOUNDS. She laughs, then hears\n          two voices from beside her bed.\n\n          \n\n                                 PHOTO FRIEND 1 (O.C.)\n\n                           (MICHIGAN-SPEAK)\n                    Hey, how zit goin', yuper!\n\n          \n\n                                 PHOTO FRIEND 2 (O.C.)\n\n                           (MICHIGAN-SPEAK)\n                    Where's your swampers and tuke?\n\n          \n          She jumps onto the bed, grabs the photo of her best\n          friends from home, now ALIVE IN THE PHOTO.\n\n          \n\n                                 CORALINE\n                    Kripes a-mighty, how are my best trolls?\n                    I can't wait till summer. You're both\n                    comin', right?\n\n          \n\n                                 PHOTO FRIEND 1\n                    We're already here, Coraline --\n\n          \n\n          \n\n                                 PHOTO FRIEND 2\n\n          \n                    -- gone to Or-e-gine!\n\n          \n          Coraline grins hugely, then, exhausted, she yawns,\n          stretching out her arms.\n\n          \n          The Other Mother, in the bedside chair, takes her hand\n          and applies some SOOTHING BLACK MUD to Coraline's poison\n          oak rash.\n\n          \n\n                                 CORALINE\n                    Oh, the mud...\n\n          \n          The Other Mother gently tucks her in then she and the\n          Other Father smile at Coraline as she drifts off to\n          sleep.\n\n          \n\n                  OTHER MOTHER                  OTHER FATHER\n          See you soon ...              See you soon ...\n\n          \n\n                                                      PULL BACK MATCH\n\n                                                            DISSOLVE:\n\n          \n\n          \n\n          INT. CORALINE'S REAL BEDROOM - MORNING\n\n\n          \n          Coraline awakens. She looks around expecting bright\n          colors, a magic dragonfly. But it's just her NORMAL ROOM:\n          moving boxes; cracks in the ceiling -- nothing's changed.\n\n          \n          She notices the BUTTON-EYED DOLL on the chair where she\n          left it, where the Other Mother was sitting. She picks it\n          up, absentmindedly goes to scratch her wrist. She stops,\n          noticing that the rash on her wrist IS GONE.\n\n          \n\n                                 CORALINE\n\n                           (GASPING)\n                    It's gone, my poison oak, it's gone!...\n\n          \n\n          \n\n          INT. LIVING ROOM - SAME\n\n\n          \n          Coraline goes to the little door, still ajar. She peeks\n          behind and finds the WALL OF SOLID BRICKS. Yes, it was\n          only a dream.\n\n          \n\n                                 CORALINE\n\n                           (SOFTLY)\n                    Huh?\n\n          \n          She shakes her head and pushes the door shut. The kettle\n          blows from the kitchen.\n\n          \n\n          \n\n          KITCHEN - DAY, GROUND FOG OUT WINDOWS\n\n          \n          Breakfast. Mel and Charlie finish their \"Go Lean\n          Breakfast Twigs\" and mugs of instant coffee. Preoccupied\n          with their work, they half-listen as Coraline recounts\n          her dream, her breakfast untouched. FOG lies outside the\n          windows.\n\n          \n\n                                 CORALINE\n                    It was incredibly real, Mom! Only you\n                    weren't really you; you were my other\n                    mother.\n\n          \n\n                                 MEL\n\n                           (DISAPPROVING)\n                    Buttons for eyes, huh?\n                           (indicates untouched food)\n                    Coraline, you only dreamed you ate all\n                    that chicken. Take your multi-vitamin, at\n                    least.\n\n          \n\n                                 CORALINE\n                    You were in the dream too, Dad. You had\n                    wild-looking pajamas and orange monkey\n                    slippers.\n\n          \n\n                                 CHARLIE\n                           (pretend offense)\n                    Orange? My monkey slippers are blue.\n\n          \n          He stands, put his dishes in the sink. Whispers over his\n\n          SHOULDER:\n\n          \n\n                                 CHARLIE (CONT'D)\n\n                           (OPTIONAL)\n                    Pssst. Can you get me some of that magic\n                    mud you were talking about?\n\n          \n          She points to her rash-free wrists. He nods.\n\n          \n\n                                 CHARLIE (CONT'D)\n                    Because I have a terrible case of\n                    writer's rash. On my---.\n\n          \n          Mel CLEARS HER THROAT, interrupting.\n\n          \n\n                                 MEL\n                    If the real Charlie Jones wants his pages\n                    edited, he'd better wrap them up ASAP.\n\n          \n          He crisply salutes her, turns on his heel, and marches\n          out the door. Mel gets up to clear the table with\n          Coraline.\n\n          \n\n                                 MEL (CONT'D)\n                    Coraline, why don't you go visit\n                    downstairs? I bet those \"actresses\" would\n                    love to hear your dream.\n\n          \n\n                                 CORALINE\n                    Miss Spink and Forcible? But you said\n                    they're dingbats.\n\n          \n\n                                    MEL\n\n                           (NODS)\n                    Uh huh.\n\n          \n          Coraline sighs, gets up to go.\n\n          \n\n          \n\n          EXT. HOUSE, FRONT PORCH - MORNING\n\n\n          \n          It's drizzling and a WHITE FOG has lowered over the house\n          and grounds. Coraline ­ yellow rain poncho, garden SHEARS\n          in hand ­ opens the front door. Stepping out onto the\n          porch, she TRIPS on a big bundle of mail. Annoyed, she\n          picks it up, starts leafing through the envelopes.\n\n          \n\n                                 CORALINE\n                    Bo-bin-sky...Bo-bin-sky....Bo-bin-sky...\n\n          \n          Smells something bad, sniffs the envelopes.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Ohh, Poo-eeeee!\n\n          \n          She goes down the front steps and finds a sign that reads\n          \"Bobinsky there\" with an arrow that points up long,\n          winding outside stairs. With an \"oh well\" shrug, she goes\n          up.\n\n          \n\n          \n\n          EXT. HOUSE, BOBINSKY'S - CONTINUOUS\n\n\n          \n          At the top, she knocks on the door, a little anxious.\n\n          \n\n                                  CORALINE\n                    H-hello?...\n\n          \n          She knocks again.\n\n          \n\n                                 CORALINE (CONT'D)\n                    I think our mail got mixed up.    Should I\n                    leave it outside or...\n\n          \n          The door swings open. Curious, Coraline peeks inside:\n          it's dark and cramped with something boiling on the stove\n          and a caged chicken.\n\n          \n\n                                  CORALINE (CONT'D)\n                    Hmmm...\n\n          \n          Suddenly a HUGE BLUE MAN swings down behind her and\n\n          SCOLDS:\n\n          \n\n                                  MR. BOBINSKY\n\n                    SEE-KRET...\n\n          \n          She whips around to find MR. Bobinsky - upside down,\n          reaching right at her face! She ducks and he reaches past\n          her to his actual target - his door knob - and pulls it\n          shut.\n          The Russian giant, dressed in a sleeveless T-shirt and\n          shorts, pulls a RAW BEET from his pants. He's not happy.\n\n          \n\n                                 MR. BOBINSKY (CONT'D)\n\n                           (SCOWLING)\n                    Famous Jumping Mouse Circus not ready,\n                    little girl!\n\n          \n\n                                 CORALINE\n\n                           (CONFUSED)\n                    Circus?... Oh, uh, I brought this for\n                    you.\n\n          \n          She holds out his mail. Bobinsky takes it, smelling the\n          stinky envelopes deeply. Nods approvingly.\n\n          \n\n                                 MR. BOBINSKY\n\n                           (SNIFFS)\n                    Mmmm... Noviseer.\n\n          \n\n                                 CORALINE\n                    Huh?\n\n          \n\n                                 MR. BOBINSKY\n                    New \"cheese\" samples.\n\n          \n          He swings down like a spider monkey and stands beside her\n          on the balcony. Coraline backs away.\n\n          \n\n                                 MR. BOBINSKY (CONT'D)\n                    Very clever, using this \"mix up\" to sneak\n                    my home and peek at meeshkas\n\n          \n\n                                 CORALINE\n                    Meeshkas?\n\n          \n\n                                 MR. BOBINSKY\n                    The Mice!\n\n          \n\n                                 CORALINE\n                    Oh, sorry. I'm Coraline Jones.\n\n          \n\n                                  MR. BOBINSKY\n\n                           (BOWS)\n                    And I am the Amazing Bobinsky! But you\n                    can call me Mr. B, because amazing I\n                    already know that I am.\n\n          \n          He smells his mail again, makes pleased sound, then seems\n          to fall off the side of the third story porch! Coraline\n          rushes over, looks down. He cartwheels in from the porch\n          railing behind her.\n\n          \n\n                                 MR. BOBINSKY\n                    Ha! You see, Caroline, the problem is my\n                    new songs go oompah oompah. But the\n                    jumping mice play only toodle toot, like\n                    that. Is nice, but not so much amazing?\n                    So now--\n                           (indicates smelly mail)\n                    --I switch to stronger cheese, and soon ­\n\n                    VATCH OUT!\n\n          \n          He opens his door, crouches low and turns. He hands her a\n          beet.\n\n          \n\n                                 MR. BOBINSKY (CONT'D)\n                    Here, have beet. Make you strong.\n                           (salutes her )\n                    Daas vee DAAN ya, Caroline.\n\n          \n          He scuttles inside and slams the door shut. Coraline\n          mutters.\n\n          \n\n                                  CORALINE\n                    Cor-a-line.\n\n          \n          Looking at the beet, she makes a disgusted sound and\n          tosses it away, then heads down the stairs.\n\n          \n\n          \n\n          EXT HOUSE, SOUTH SIDE YARD - CONTINUOUS\n\n          \n          When she gets to the bottom, she starts towards the back,\n          gardening shears out.\n\n          \n\n                                 CORALINE\n                           (to herself)\n                    Oompah oompah, toodle toot, toodle toot.\n\n          \n\n                                 MR. BOBINSKY (O.C.)\n\n                    EHHH! CAROLINE: PA-DAZH-DI'-- WAIT!!\n\n          \n          She looks up.\n\n          \n\n                                  CORALINE\n                    No!!!\n\n          \n          Bobinsky LEAPS all the way to the ground, landing beside\n          her, out of breath.\n\n          \n\n                                 MR. BOBINSKY\n                    The mice...asked me to give you message.\n\n          \n\n                                 CORALINE\n                    The...jumping mice?\n\n          \n          Mr. B nods gravely. He leans down, so close his moustache\n          touches her ear, and whispers, his voice DEAD-SERIOUS.\n\n          \n\n                                 MR. BOBINSKY\n                    They are saying: do not go through leetle\n                    door. Do you know such a thing?\n\n          \n          Coraline is startled.\n\n          \n\n                                 CORALINE\n                    The one behind the wall paper? But...\n                    it's all bricked up.\n\n          \n          The old man shrugs, straightens.\n\n          \n\n                                 MR. BOBINSKY\n                    Bah. So sorry, is nothing. Sometimes the\n                    mice are leetle...\n\n          \n          He points to his head and rotates his finger.\n\n          \n\n                                 MR. BOBINSKY (CONT'D)\n                    ...mixed up, hmmm? They even get your\n                    name wrong, you know. They call you\n                    Coraline instead of Caroline, not\n                    Caroline at all.\n\n          \n          He starts back up the stairs.\n\n          \n\n                                 MR. BOBINSKY (CONT'D)\n                    Maybe I work them too hard...\n\n          \n          Coraline stares after him.\n\n          \n\n          \n\n          EXT. HOUSE - MOMENTS LATER\n\n\n          \n          SHEARS IN HAND, Coraline approaches the family VW, where\n          one PINK SUITCASE remains tied to the roof. She snips it\n          free and takes out her special HAT, a black Japanese\n          schoolboy's cap.\n\n          \n\n          \n\n          EXT. HOUSE, STAIRWELL DOWNSTAIRS FLAT ­ SAME\n\n\n          \n          Coraline climbs down the steps to the basement flat. At\n          the door, she tries the comedy/tragedy door knocker and\n          waits. Nothing. She glances down at the doormat - it\n          reads \"No whistling in the house.\"\n\n          \n          She peers through the door glass. A YAPPING DOG suddenly\n          LEAPS UP inside, startling her, and a moment after, MISS\n          SPINK ­ wearing some sort of house robe ­ opens the door\n          and three SCOTTIE DOGS ­ HAMISH, JOCK, AND ANGUS ­ shoot\n          out and surround Coraline. Spink tries to quiet them\n          down.\n\n          \n\n                                 MISS SPINK\n\n                           (HARSH)\n                    Oh cease your infernal yapping!\n                           (to Coraline, sweetly)\n                    How nice to see you, Caroline. Would you\n                    like to come in? We're playing cards.\n\n          \n\n                                 CORALINE\n                    Still Coraline, Miss Spink.\n\n          \n\n                                 MISS SPINK\n                           (over shoulder)\n                    Miriam, put the kettle on!\n\n          \n\n          \n\n          INT. MISSES SPINK & FORCIBLE'S FLAT - SAME\n\n\n          \n          Miss Spink leads Coraline into the living area, as MISS\n          FORCIBLE, taller and sporting a platinum wig and a very\n          large bosom, prepares tea in the kitchen to the side. The\n          dogs race ahead and jump onto the sofa. Coraline scans\n          the walls to see framed POSTERS from the \"Shakespeare\"\n          the ladies used to perform like King Leer and Julius\n          Seize Her. Miss Forcible peers out her, half-blind\n          without her glasses.\n\n          \n\n                                 MISS FORCIBLE\n                    April, I think you're being followed.\n\n          \n\n                                 MISS SPINK\n                    It's the new neighbor, Miriam - Caroline?\n                    She'll be having the Oolong tea.\n\n          \n\n                                 MISS FORCIBLE\n                    No, no, no, no. I'm sure she'd prefer\n                    Jasmine.\n\n          \n\n                                  MISS SPINK\n                    No, Oolong.\n\n          \n\n                                 MISS FORCIBLE\n                    Ah, Jasmine it is, then.\n\n          \n          Forcible grabs a handful of tea, puts it in the pot and\n          pours boiling water in.\n\n          \n\n                                 MISS SPINK\n                    Come on, boys!\n\n          \n          The dogs leap off the sofa and, as Coraline takes their\n          place, she looks to the side and sees a towering bookcase\n          filled with STUFFED SCOTTY DOGS IN KNITTED SWEATERS WITH\n\n          ANGEL WINGS.\n\n          \n\n                                 CORALINE\n\n                           (ALARMED)\n                    Are those dogs .... real?\n\n          \n\n                                 MISS SPINK\n\n                           (SIGHS)\n                    Our sweet, departed angels. Couldn't bear\n                    to part with them ... so we had them\n                    stuffed.\n\n                           (CONTINUES)\n\n                                 (MORE)\n\n          \n\n                                 MISS SPINK (CONT'D)\n                    Now, there's Hamish the third, the\n                    fourth, the eighth, the ninth. Angus the\n                    second, the fifth, the..\n\n          \n          Miss Forcible arrives with a tea tray and urges Coraline\n          to take a candy as Spink goes on and on.\n\n          \n\n                                 MISS FORCIBLE\n                    Oh go on, have one ­ it's hand-pulled\n                    taffy from Brighton ­ best in the world.\n\n          \n          Coraline reaches for a pink and green one. But the taffy\n          is so old and sticky, her fingers get stuck. Then her\n          other hand gets stuck, trying to get the first hand out.\n\n          \n\n                                 MISS SPINK (O.C.)\n                    ...seventh, the third, the ninth, yes,\n                    the fourthI'm right; and Jock Junior,\n                    Jock senior, Jock the third, the\n                    fourth...\n\n          \n          Coraline, using her feet, finally un-sticks the candy\n          bowl which FLIES UP and sticks to the ceiling.\n\n          \n\n                                 MISS SPINK (CONT'D)\n                    ...oh, and that's Jock's 2nd cousin,\n                    twice removed.\n\n          \n          She turns to Coraline, about to sip her tea. Spink\n          indicates cup.\n\n          \n\n                                 MISS SPINK (CONT'D)\n                    I'll read them, if you like.\n\n          \n\n                                 CORALINE\n                    Read what?\n\n          \n\n                                 MISS SPINK\n                    Oh, your tea leaves, dear. They'll tell\n                    me your future. Drink up then, go on.\n\n          \n          Coraline gulps down the bitter brew.\n\n          \n\n                                 MISS SPINK (CONT'D)\n                    No, not all of it, not all of it. That's\n                    right, now hand it over.\n\n          \n          Coraline passes her the cup. Spink puts a saucer on top\n          and swirls it three times, removes the saucer and peers\n          in at the abstract leaf pattern. She purses her lips.\n\n          \n\n                                 MISS SPINK (CONT'D)\n                    Oh... Caroline, Caroline, Caroline; you\n                    are in terrible danger.\n\n          \n          Miss Forcible snorts.\n\n          \n\n                                 MISS FORCIBLE\n                    Oh, give me that cup, April, your eyes\n                    are going.\n\n          \n\n                                 MISS SPINK\n                    My eyes! You're blind as a bat!\n\n          \n          Spink passes the cup to Forcible, who adjusts thick\n          glasses and peers closely into it.\n\n          \n\n                                 MISS FORCIBLE\n                    Oh, now, ummm... not to worry, child,\n                    it's good news: there's a tall, handsome\n                    beast in your future.\n\n          \n\n                                   CORALINE\n                    A what?\n\n          \n\n                                 MISS SPINK\n                    Miriam, oh really, you're holding it\n                    wrong.\n\n          \n          Spink forcibly rotates the cup.\n\n          \n\n                                   MISS SPINK (CONT'D)\n                    See? Danger!\n\n          \n          Coraline wants more information.\n\n          \n\n                                 CORALINE\n                    What do you see?\n\n          \n          The ladies, heads side by side, gaze into the cup. We see\n          a SPIKY CLAW formed from the leaves.\n\n          \n\n                                 MISS SPINK\n\n                           (OMINOUS)\n                    I see a very peculiar hand...\n\n          \n          Forcible rotates the cup back again. Upside down, the\n          claw hand looks like a GIRAFFE.\n\n          \n\n                                 MISS FORCIBLE\n                    I see a giraffe.\n\n          \n\n                                 MISS SPINK\n                    Giraffes don't just fall from the sky,\n                    Miriam.\n\n          \n          The stuck candy dish suddenly CRASHES to the floor.\n\n          \n\n                                  MISS SPINK (CONT'D)\n                    Oh!\n\n          \n\n                                  MISS FORCIBLE\n                    Oh, lord!\n\n          \n          Coraline asks in a practical voice:\n\n          \n\n                                 CORALINE\n                    Well, what should I do?\n\n          \n\n                                 MISS SPINK\n                    Never wear green in your dressing room.\n\n          \n\n                                 MISS FORCIBLE\n                    Acquire a very tall step ladder.\n\n          \n\n                                 MISS SPINK\n                    And be very, very careful. Now, was there\n                    something you came to tell us?\n\n          \n          Coraline thinks it over, then shakes her head.\n\n          \n\n                                 CORALINE\n                    No, I guess not. Thanks for the tea,\n                    though.\n\n          \n          She gets up and leaves, the dogs immediately return to\n          their sofa.\n\n          \n\n                                  MISS FORCIBLE\n                    Toodle-oo.\n\n          \n\n                                  MISS SPINK\n                    Cheery-bye.\n\n          \n          The ladies resume their card game with Miss Spink turning\n          to the dogs.\n\n          \n\n                                 MISS SPINK (CONT'D)\n                    Do you have any nice Queens for mummy?\n\n          \n\n          \n\n          EXT. HOUSE, TOP OF BASEMENT FLAT STAIRS - SAME\n\n\n          \n          Coraline climbs the stairs up to ground level, intrigued\n          by her fortune.\n\n          \n\n                                 CORALINE\n                           (to herself)\n                    Danger?\n\n          \n          Behind her, a PERISCOPE RISES from the WAIST-DEEP FOG.\n          Coraline just catches it in her peripheral view.\n\n          \n          She frowns but doesn't let on she's aware of it. She\n          walks ahead nonchalantly, the periscope following her,\n          then suddenly turns and GRABS it, PULLING UP WYBIE, then\n          PUNCHES him in the arm.\n\n          \n\n                                 WYBIE\n                    Owwwwwwww!\n\n          \n\n                                 CORALINE\n                    Great, the village stalker.\n\n          \n\n                                 WYBIE\n                    Ow. I - I wasn't stalking you. We're\n                    hunting banana slugs.\n\n          \n          Wybie takes some SALAD TONGS from a tool belt, snaps\n          them.\n\n          \n\n                                 CORALINE\n                    What d'ya mean, \"we?\"\n\n          \n          There's a soft meowing from under his coat. He opens it\n          up and the BLACK CAT EMERGES and climbs onto his\n          shoulders.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Ha! Your cat's not wild, he's a wuss-\n                    puss!\n\n          \n          Cat glares at her angrily.\n\n          \n\n                                 WYBIE\n                    What? He hates to get his feet wet. Geez.\n\n          \n\n                                 CORALINE\n\n                           (MOCKING)\n                    Wuss-puss...\n\n          \n          Tired of her company, the cat jumps off Wybie, onto a\n          tree and up onto the roof of the house. Coraline softens.\n\n          \n\n                                 CORALINE (CONT'D)\n                    So... that doll. Did you make it look\n                    like me?\n\n          \n          Wybie, scanning under the ground fog for slugs, sticks\n          his head up for a moment.\n\n          \n\n                                 WYBIE\n                    Oh no; I found it that way. It's older\n                    than Gramma -- old as this house prob'ly.\n\n          \n          Coraline is highly skeptical. Wybie returns to his hunt.\n\n          \n\n                                 CORALINE\n                           (points to self)\n                    C'mom - blue hair, my swampers and\n                    raincoat?\n\n          \n          Wybie stands excitedly and presents a HUGE YELLOW-GREEN\n          SLUG to Coraline.\n\n          \n\n                                 WYBIE\n                    Dang, check out Slugzilla!\n\n          \n          She's not impressed.\n\n          \n\n                                 CORALINE\n\n                           (FRUSTRATED)\n                    You're just like them.\n\n          \n\n                                 WYBIE\n                    Huh?\n\n          \n          He looks from the slug to himself.\n\n          \n\n                                 CORALINE\n                    I meant my parents; they don't listen to\n                    me either.\n\n          \n          Wybie nods, not listening again, takes his camera --\n\n          \n\n                                 WYBIE\n                    Uh huh... You mind?\n\n          \n          -- hands it to her. She acts put-out, but frames a shot.\n          He signals he's ready and she fires off one auto-flash\n          shot after another as he strikes silly poses making SOUND\n          EFFECTS: horrified of the slug one moment; ready to eat\n          it the next; pretending it's something from his nose in\n          another. She can't help but GIGGLE.\n\n          \n\n                                 CORALINE\n                    Ew!\n\n          \n          Finished, Wybie tosses the slug back into the fog, and\n          takes the camera back. He lowers his head, thoughtful,\n          then glances up past Coraline at the house. He SIGHS and\n          speaks in a SAD TONE.\n\n          \n\n                                 WYBIE\n                    You know, I've never been inside the Pink\n                    Palace.\n\n          \n\n                                 CORALINE\n\n                           (SCEPTICAL)\n                    You're kidding.\n\n          \n\n                                 WYBIE\n                    Grandma would kill me. Thinks it's\n                    dangerous or something.\n\n          \n\n                                    CORALINE\n                    Dangerous?\n\n          \n\n                                 WYBIE\n                    Well... she had a twin sister.\n\n          \n\n                                    CORALINE\n                    So?\n\n          \n\n                                 WYBIE (O.C.).\n                    When they were kids, Grandma's sister\n                    disappeared.\n\n                           (ON CAMERA)\n                    She says she was stolen.\n\n          \n\n                                 CORALINE (O.S.)\n\n                           (SKEPTICAL)\n                    Stolen?\n\n          \n          ANGLE from roof, over CAT'S SHOULDER as dialog continues.\n          Cat senses something and turns -- it's Coraline's DOLL AT\n          THE WINDOW, looking like it's spying on things.\n\n          \n\n                                 CORALINE(CONT'D)\n                    Well, what do you think?\n\n          \n\n                                 WYBIE\n                    Uhhh, I-I don't know.\n\n          \n          BACK TO KIDS. Wybie, astride his electric bike now,\n          WHISTLES and the black cat jumps down from the roof, onto\n          his shoulders.\n\n          \n\n                                 WYBIE (CONT'D)\n                    Maybe she just ran away?\n\n          \n          We hear Wybie's agitated grandmother call out.\n\n          \n\n                                    WYBIE'S GRANDMOTHER (O.C.)\n                    Wyborne!\n\n          \n          Wybie turns away: he's said too much.\n\n          \n\n                                 WYBIE\n                    Look, I gotta go.\n\n          \n          He starts to pull away.\n\n          \n\n                                 CORALINE\n                    Wait a minute!\n\n          \n          And he's gone. PUSH IN on her pensive face.\n\n          \n\n          \n\n          INT CORALINE'S BEDROOM - NIGHT\n\n          \n          CU ON DOLL FACE, back in   the chair by the bed. Coraline\n          takes some yellow cheese   from her pocket and puts it by\n          the door: mice bait. She   lies down and her breathing\n          slows, the doll watching   her with a nearly IMPERCEPTIBLE\n          SMILE on its face.\n\n          \n\n          \n\n          INT CORALINE'S BEDROOM - LATER\n\n          \n          Coraline sleeping, lighting suggests another dream. SOME\n          THINGS go t-t-t-t-t-t. Coraline sits up, looks to her\n          door, and spots a COUPLE OF KANGAROO MICE stealing the\n          last bit of cheese.\n\n          \n\n          \n\n          INT. UPPER HALL - SAME\n\n\n          \n          She gives chase after the mice, hopping down the stairs\n          with the cheese.\n\n          \n\n          \n\n          INT. LIVING ROOM - SAME\n\n\n          \n          Coraline follows the kangaroo mice directly to the little\n          door, opened a crack, where they disappear.\n\n          \n          She pulls it open. Bricks are gone; tunnel revealed. She\n          doesn't hesitate this time to crawl through the door.\n\n          \n\n          \n\n          INT. OTHER KITCHEN - NIGHT\n\n\n          \n          Coraline enters Other Kitchen to find Other Mother\n          preparing a delicious breakfast. She looks PRETTIER\n          tonight; her black hair shining, lips REDDER. She stops\n          HUMMING A LULLABY to greet Coraline.\n\n          \n\n                                 OTHER MOTHER\n                    Welcome back, darling.\n\n          \n\n                                    CORALINE\n                    Hi.\n\n          \n          She is grating YELLOW CHEESE into scrambled eggs.\n\n          \n\n                                 OTHER MOTHER\n                    So thoughtful of you to send this nice\n                    cheddar, Coraline.\n\n          \n\n                                 CORALINE\n                    Cheddar?... Oh, the mice bait...\n\n          \n\n                                 OTHER MOTHER\n                    Would you go fetch your father?\n\n          \n          Beams at Coraline.\n\n          \n\n                                 OTHER MOTHER (CONT'D)\n                    Bet he's hungry as a pumpkin by now!\n\n          \n\n                                 CORALINE\n                    You mean my Other Father?\n\n          \n\n                                 OTHER MOTHER\n                    Your better father, dear.   He's out in\n                    the garden.\n\n          \n\n                                 CORALINE.\n                    But my parents don't have time to garden.\n\n          \n          Other Mother SHUSHES her and pops a strawberry in her\n          mouth.\n\n          \n\n                                 CORALINE\n                    Mmmmmm!\n\n          \n\n                                 OTHER MOTHER\n                    Go on...\n\n          \n          Coraline shrugs okay, starts for the door.\n\n          \n\n          \n\n          EXT STUDY DOOR TO BACK PORCH - CONTINUOUS\n\n          \n          Looking out, she sees the broken-down garden from the\n          real world, still grey and lifeless in the dim light.\n\n          \n\n          \n\n          EXT. OTHER GARDEN - SAME\n\n\n          \n          Coraline opens the gate to the garden. A large CRESCENT\n          MOON RISES, and THINGS START TO GROW.\n\n          \n          Two dead shrubs start to RISE, then BLOSSOM, then the\n          blossoms themselves are LIT UP by some GOLD AND AMBER\n\n          HUMMINGBIRDS.\n\n          \n          The hummingbirds circle around Coraline, light her\n          DRAGONFLY BARRETTE, then continue on, LIGHTING UP PITCHER\n          PLANTS that have grown up in a nearby flower bed. A\n          beautiful FROG POKES OUT of one blossom.\n\n          \n          The birds lead Coraline up steps past a stone wall where\n\n          BLEEDING HEART GROW, AND GLOW, AND BEAT.\n\n          \n          She spots the Other Father, riding a PRAYING MANTIS\n          TRACTOR on the hillside, planting SEEDS that instantly\n          grow into FLOWERING PLANTS.\n\n          \n\n                                    OTHER FATHER\n                    Hey!!!\n\n          \n\n                                 CORALINE\n                    I love your garden!\n\n          \n          He waves back, calling:\n\n          \n\n                                 OTHER FATHER\n                    Our garden, Coraline!\n\n          \n          A gang of SNAP DRAGONS goes at her, TICKLING Coraline\n          till she falls down. Her squeals of delight grow into\n\n          HYSTERICAL LAUGHTER.\n\n          \n\n                                 CORALINE\n\n                           (GIGGLING)\n                    Oh ah, stop! Stop tickling, ah!\n\n          \n          The Other Father hears this and looks over.\n\n          \n\n                                 OTHER FATHER\n                    Oops, daughter in distress!\n\n          \n          He guns the tractor full-speed over a little bridge,\n          grabbing a GOURD TRUMPET from a vine and blowing it.\n\n          \n          JACK-O-LANTERNS surface in the pond below and spout\n\n          STREAMS OF WATER.\n\n          \n          Arriving beside Coraline, he waggles his finger at the\n          naughty snapdragons.\n\n          \n\n                                 OTHER FATHER (CONT'D)\n                    Tickle no more, you dragon snappers!\n\n          \n          Then he deftly cuts a bouquet of them and presents it to\n          Coraline. She nods thanks.\n\n          \n\n                                 CORALINE\n                    Well, she says it's time for dinner ...\n                    breakfast ... food?\n\n          \n\n                                 OTHER FATHER\n                    Hop on, kiddo, I want to show you\n                    something!\n\n          \n          She does. The Other Father grabs the GEARSHIFT KNOB,\n          pulls it, and the mechanical mantis SPROUTS WINGS. They\n          RISE in the air. Looking down, she sees that the garden\n          is a PORTRAIT OF CORALINE.\n\n          \n\n                                 CORALINE\n                    I can't believe you did this!\n\n          \n\n                                 OTHER FATHER\n                    Mother said you'd like it! Boy she knows\n                    you like the back of her hand.\n\n          \n          He pulls a lever and they ZOOM out of frame.\n\n          \n\n          \n\n          INT. OTHER KITCHEN - SAME\n\n\n          \n          Coraline doesn't hold back this time. She stacks sausages\n          on eggs on top of waffles, rolls it up and stuffs it in\n          her mouth. The Other Mother FEEDS BITS OF SAUSAGE to the\n          HUNGRY SNAPDRAGONS bouquet now in a vase.\n\n          \n\n                                 CORALINE\n                    Mmmm...so good!\n\n          \n\n                                 OTHER FATHER\n                    I love dinner, breakfast food.\n\n          \n\n                                 OTHER MOTHER\n                    Coraline, Mr. Bobinsky has invited you to\n                    come see the Jumping Mice perform after\n                    dinner.\n\n          \n\n                                 CORALINE\n                    Really. That know-it-all Wybie said it\n                    was all in Mr. B's head, I knew he was\n                    wrong.\n\n          \n\n                                 OTHER FATHER\n                    Well, everything's right in this world,\n                    Kiddo.\n\n          \n          Coraline hurries to shovel in the rest of her meal, while\n          her Other Parents smile at one another.\n\n          \n\n                                 OTHER MOTHER\n                    Your father and I will clean up while you\n                    and your friend head upstairs.\n\n          \n\n                                 CORALINE\n                    My friend?\n\n          \n          There's a KNOCK at the door. Other Mother opens it to\n          reveal the OTHER WYBIE. He's cleaner, with better\n          posture, and cute button eyes.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Great... another Wybie. Hello, Why-were-\n                    you-born.\n\n          \n          The boy nods, button eyes shining.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Hello?\n\n          \n          He just makes a shy smile, doesn't answer. She's\n          confused.\n\n          \n\n                                 OTHER MOTHER\n                    I thought you'd like him more, if he\n                    spoke a little less.\n                           (shrugs, smiling)\n                    So I fixed him.\n\n          \n\n                                 CORALINE\n                    So he can't talk at all?\n\n          \n\n                                 OTHER MOTHER\n                    Nope.\n\n          \n          She looks Other Wybie over appreciatively.\n\n          \n\n                                 CORALINE\n                    Hmm, I like it.\n\n          \n\n                                 OTHER MOTHER\n\n                           (PROUDLY)\n                    Now run along, you two, and have fun.\n\n          \n          Coraline heads out the door with the mute boy.\n\n          \n\n          \n\n          EXT. OTHER ESTATE HOUSE - SAME\n\n\n          \n          The Other House ­ lit by amber spotlights looks MAGICAL\n          with ornate GINGERBREAD TRIM; glowing TOPIARY in the\n          yard. The kids come out the front door.\n\n          \n\n                                 CORALINE\n                    You're awful cheerful, considering you\n                    can't say anything.\n\n          \n          Other Wybie nods in agreement. Coraline and he start up\n          the stairs to Bobinsky's.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Uh...It didn't hurt, did it, when she...\n\n          \n          She points to her mouth. There's an awkward moment and\n          then he points past her, excitedly: a SMALL BLIMP is\n          flying towards Bobinsky's door.\n\n          \n          They run up the stairs and watch it slip through an\n          opening above his door. Coraline knocks and the door\n          suddenly SPINS, THROWING THEM INSIDE.\n\n          \n\n          \n\n          INT. OTHER MR. BOBINSKY'S FLAT - SAME\n\n\n          \n          They somersault to a stop and sit up. Down two rows of\n          SMALL CANNONS that face each, an amazing MINIATURE CIRCUS\n          has been set up, with a FERRIS WHEEL beside it.\n\n          \n\n                                 CORALINE\n                    Whoa... cool!\n\n          \n          Coraline goes right to the Ferris wheel where a\n          MECHANICAL CHICKEN eats dried corn on the cob, fires up\n          its belly, then POOPS OUT POPCORN into paper bags.\n\n          \n          Other Wybie stomps a firing button and COTTON CANDY\n          shoots out of a cannon. He catches the cone, then starts\n          firing off all the cannons. Coraline looks back to find\n          him covered in the cotton candy.\n\n          \n\n                                   CORALINE (CONT'D)\n                    Look at you!\n\n          \n          Spotlights come on in the big top, the entrance opens,\n          and a big voice is heard over loudspeakers.\n\n          \n\n                                 OTHER MR. BOBINSKY (O.S.)\n                    Lady and gentleman! For to tickle your\n                    eyes and ears and making hearts to thump,\n                    I ­ Sergei Alexander Bobinsky ­ am\n                    introducing...\n\n          \n          They race to the entrance, stoop down to crawl inside.\n\n          \n\n          \n\n          INT. MINIATURE BIG TOP - SAME\n\n\n          \n\n                                 OTHER MR. BOBINSKY (O.S.)\n                    ... my as-tound-ishing, stu-pen-dulous\n                    and AH-MAZING Jumping Mouse Circus!\n\n          \n          They sit between miniature grandstands and watch as the\n          little BLIMP, bathed in spotlights, enters through a\n          flap. It circles around, rising to the top of the tent,\n          then NOSE-DIVES towards the ground! It CRASHES in the\n          center of the circus ring, and OPENS LIKE A FLOWER from\n          which 50 JUMPING MICE spring up like Chinese acrobats to\n          spell out C O R A L I N E.\n\n          \n\n                                 CORALINE\n\n                           (DELIGHTED)\n                    My name!\n\n          \n          The jumping mice leap to the ground in formation,\n          BRANDISH TINY INSTRUMENTS, and DRUMMERS START POUNDING.\n          The DRUM MAJOR MOUSE parachutes down and whips out a\n          BATON. On his signal, the group launch into a WILD\n\n          RUSSIAN CIRCUS MARCH.\n\n          \n          Coraline, grinning, turns to the Other Wybie.\n\n          \n\n                                 CORALINE (CONT'D)\n                    It's wonderful, Wybie!\n\n          \n          The boy smiles and nods to the beat of the bass drums as\n          the hopping band marches in and out of ever changing\n          formations - PINWHEELS, X's, CIRCLES WITHIN CIRCLES.\n\n          \n          They hoppers begin to SPIRAL to the center of the circus\n          ring when the floor RISES UP from its center to form a\n          six-foot Tower of Babel, the mice HOPPING TO THE TOP. The\n          DRUM MAJOR balances on the tippy-top on a COLORFUL CIRCUS\n\n          BALL.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Wow!\n\n          \n          He RUNS the ball DOWN AND AROUND the spiral as the MICE\n          HOP OFF, and when he hits the ground, the TOWER DROPS\n          AWAY to reveal the OTHER MISTER BOBINSKY! He CRACKS A\n\n          WHIP.\n\n          \n          Coraline and Other Wybie STAND and CLAP. Other Bobinsky ­\n          in a RINGMASTER'S OUTFIT with a full length cape ­ bows\n          graciously, doffing his tall black hat. His moustache is\n          waxed, his eyes black buttons.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Yah! Whooo-oooh! That was great!\n\n          \n\n                                 OTHER MR. BOBINSKY\n                    Very very thank you, lady and gentleman.\n\n          \n          On cue, the entire jumping mice band DISAPPEARS INTO\n          OTHER MR. B'S SLEEVES while the drum major SWINGS UP from\n          the man's moustache and onto his head, where he's quickly\n          hidden by the tall black hat.\n\n          \n\n                                 CORALINE\n                    We loved it, Mr. B. It was ... so ... so--\n\n          \n\n                                 OTHER MR. BOBINSKY\n\n                           (COACHING)\n\n                    AHHHHHH---\n\n          \n\n                                 CORALINE\n                    A-mazing!\n\n          \n\n                                 OTHER MR. BOBINSKY\n                    You are very velcome anytime you like,\n                    you and also your good friend there.\n\n          \n          She happily turns to Other Wybie, beaming with joy.\n\n          \n\n                                 OTHER MR. BOBINSKY(CONT'D)\n                    Dosvedanya, Coraline.\n\n          \n          Bobinsky takes her hand to kiss it.\n\n          \n\n          \n\n          INT. CORALINE'S OTHER BEDROOM - SAME\n\n\n          \n          Other Mother kisses SLEEPING CORALINE'S forehead, sits\n          back in the bedside chair. Other Father, close by, pulls\n          a cotton candy cone off Other Wybie and munches it.\n          Coraline's Other Parents smile warmly, knowing something\n          secret that makes them glad.\n\n          \n\n                                                      PULL BACK MATCH\n\n                                                            DISSOLVE:\n\n          \n\n          \n\n          INT. CORALINE'S BEDROOM - DAY\n\n\n          \n          EARLY MORNING. Coraline once again wakes in own bed in\n          the real world, the little doll ­ left on the chair ­ now\n          clutched against her chest.\n\n          \n\n                                 CORALINE\n                    Ughhh.\n\n          \n          Her gaze moves from the doll to where she left the cheese\n          by the door. It's GONE. This is much too confusing.\n\n          \n\n          INT. LIVING ROOM - SAME\n\n\n          \n          Coraline tries the small door in the corner wall. It's\n          locked. What the heck?\n\n          \n\n          \n\n          EXT. SMALL OFFICE BUILDING IN TOWN - DAY\n\n\n          \n          --SQUEALING brakes, as the Jones' JEEP pulls up in front\n          of \"Northwest Garden\" headquarters. TOWNSFOLK in\n          SHAKESPEAREAN COSTUMES stand about, advertising a local\n          festival. Coraline is sharing her latest dream:\n\n          \n\n                                 CORALINE (V.O.).\n                    ... there were garden squash like balloon\n                    animals AND snap dragons.\n\n          \n          ON FAMILY: Coraline continues from back seat as her\n          father and mother review their work pages.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Oh, and upstairs I saw a real mouse\n                    circus, not pretend like the crazy man's\n                    in our house.\n\n          \n          Her parents, preoccupied, ignore her.\n\n          \n\n                                 CHARLIE\n                    You sure you won't come?\n\n          \n\n                                 MEL\n                           (indicates neck brace)\n                    Don't fret, Charlie, they'll love the new\n                    catalog. At least, they'll love my\n                    chapters.\n\n          \n          Gives her an \"aren't you funny\" look, opens door. Mel\n          looks back at Coraline.\n\n          \n\n                                 MEL (CONT'D)\n                    I did not call him crazy, Coraline.   He's\n                    drunk.\n\n          \n          She makes the hand-thumb bottle sign. Charlie leans in to\n          Coraline, pinches her nose.\n\n          \n\n                                 CHARLIE\n                    Well, I guess I'll see you around, you\n                    dizzy dreamer.\n\n          \n          Coraline cuts him off, embarrassed.\n\n          \n\n                                 CORALINE\n                    Da-ad! I'm not five anymore.\n\n          \n          Dad sighs, heads up the steps to his appointment as Mel\n          and Coraline drive off.\n\n          \n\n          \n\n          INT. UNIFORMS DEPARTMENT STORE - SAME\n\n\n          \n          PRESIDENT'S DAY SALE. Mel piles gray blouses, a navy\n          skirt, white socks onto the arms of a CLERK.\n\n          \n          Sitting alone on some stairs, Coraline sees a pair of\n          fancy GREEN AND ORANGE GLOVES.\n\n          \n          As she tries them on, a YOUNG RASCAL in costume with\n          sword BOUNCES PAST her down the stairs on a WHEELED STEP\n          STOOL - his FATHER in pursuit.\n\n          \n\n                                 YOUNG RASCAL\n                    My kingdom for a hooooooorse!!!!\n\n          \n          There's an off screen crash, then the step stool rolls\n          back to Coraline. She gets an idea.\n\n          \n          Mel is checking out school blouses, when Coraline rolls\n          past, first one direction, then the other, modeling the\n          colorful gloves. Without looking up, her mom tells her:\n\n          \n\n                                 MEL\n                    Put them back.\n\n          \n\n                                 CORALINE\n                    But Mom, the whole school's gonna wear\n                    boring gray clothes. No one will have\n                    these.\n\n          \n\n                                 MEL\n                    Put them back.\n\n          \n          Coraline mutters:\n\n          \n\n                                 CORALINE\n                    My other mother would get them.\n\n          \n\n                                 MEL\n                    Maybe she should buy all your clothes.\n\n          \n          Coraline scowls and stomps away to return the gloves.\n\n          \n\n          \n\n          INT. CAR - SAME\n\n\n          \n          Coraline and Mel are driving home, shopping bags in back.\n\n          \n\n                                 CORALINE\n                    So what do you think's in the other\n                    apartment?\n\n          \n\n                                 MEL\n                    I don't know. Not a family of Jones\n                    imposters.\n\n          \n\n                                 CORALINE\n                    Then why'd you lock the door?\n\n          \n\n                                 MEL\n                           (shorter than previous)\n                    Oh, I found some rat crap and... I\n                    thought you'd feel ... safer.\n\n          \n\n                                 CORALINE\n                    They're jumping-mice, Mom! And the dreams\n                    aren't dangerous; they're the most fun\n                    I've had since we've moved here.\n\n          \n\n                                 MEL\n                    Your school might be fun.\n\n          \n\n                                 CORALINE\n                    With those stupid uniforms?   Right.\n\n          \n\n                                 MEL\n                    Had to give it a try.\n\n          \n          They pull into their DRIVEWAY.\n\n          \n\n          \n\n          INT. KITCHEN - SAME\n\n\n          \n          Mel pulls out salsa, mustard, catsup, stale tortillas\n          from the fridge.\n\n          \n\n                                 MEL\n                    How do you feel about a mustard-ketchup-\n                    salsa wrap for lunch?\n\n          \n          Coraline, carrying in the bags from outside, makes a\n          face.\n\n          \n\n                                 CORALINE\n                    Are you kidding me?\n\n          \n\n                                 MEL\n                    Mmm... Had to go food shopping anyway.\n                    Dad's planning something special.\n\n          \n          Coraline squinches up her nose.\n\n          \n\n                                 CORALINE\n                    Gross-gusting.\n\n          \n\n                                 MEL\n\n                           (BRIGHTENS )\n                    You wanna come along? You can pick out\n                    something you like.\n\n          \n          Coraline plops down in a chair.\n\n          \n\n                                 CORALINE\n                    Oh, like the gloves?\n\n          \n          Mel reaches out and musses Coraline's hair. The girl\n          pulls away.\n\n          \n\n                                 MEL\n                    Look, Coraline... if things go well\n                    today, I promise I'll make it up.\n\n          \n\n                                 CORALINE\n                    That's what you always say.\n\n          \n          Mom rolls her eyes, shaking her head, and opens the door\n          to leave.\n\n          \n\n                                 MEL\n                    Won't be long.\n\n          \n          Shuts the door.\n\n          \n\n                                 CORALINE\n\n                           (MUTTERS)\n                    But I might be...\n\n          \n          She leaves.\n\n          \n\n          \n\n          INT. KITCHEN - SAME\n\n\n          \n          Coraline pulls open the key drawer, looking for the small\n          black key. Not there. She looks around, then spots it\n          hanging on a hook above a door. She stands on a chair and\n          snags it.\n\n          \n\n          \n\n          INT. LIVING ROOM - SAME\n\n\n          \n          Coraline stoops in front of the small door and pushes the\n          key into the keyhole and unlocks the door.\n\n          \n          She listens for her mother's car. Nothing. Grasping the\n          key between thumb and forefinger, she closes her eyes,\n          she pulls the door open.\n\n          \n          ANGLE ON CORALINE: A SOFT BREEZE MOVES her hair. She\n          knows before her eyes open that the BRICKS ARE GONE.\n\n          \n\n                                 CORALINE\n\n                           (TRIUMPHANT)\n                    I knew it was real!\n\n          \n          She opens her eyes, smiles, and CRAWLS FORWARD.\n\n          \n          ANGLE ON CORALINE THROUGH WINDOW. CAMERA PULLS BACK and\n          we FIND the BLACK CAT, perched on the wet window sill,\n          OBSERVING Coraline as she disappears into the tunnel.\n          With a look of concern, he exits frame.\n\n          \n\n          \n\n          INT. OTHER KITCHEN - NIGHT\n\n\n          \n          Lunch is ready and waiting for her: foot-long hotdogs\n          with relish; grilled cheese sandwiches with gherkins;\n          curly-fries; piles of coleslaw and potato salad; five\n          flavors of soda-pop. There's a NOTE attached to a GIFT-\n\n          WRAPPED BOX:\n\n          \n\n                                 OTHER MOTHER (V.O.)\n                    Dearest Coraline,\n\n                    M\n                     iss Spink and Miss Forcible have invited\n                    you downstairs after lunch. I hope you\n                    like the new outfit I made you! Love,\n                    Mother.\n\n          \n          Coraline tears open the box and finds a pair of beautiful\n          BLUE BOOTS, BLACK CORDUROY TROUSERS, and a METALLIC GREY\n\n          SWEATER WITH TWINKLING STARS.\n\n          \n          She holds up the sweater to her body, smiles, then puts\n          down the clothes and digs into lunch.\n\n          \n\n          \n\n          EXT. OTHER HOUSE - SAME\n\n\n          \n          Coraline, dressed in her FANCY NEW CLOTHES, steps onto\n          the FRONT PORCH and BURPS. It's always nighttime in this\n          world.\n\n          \n          A CAT MEEEROWS. Coraline looks up to see a BLACK CAT on\n          the porch roof above her.\n\n          \n          Coraline raises her brows, studies the animal a moment.\n\n          \n\n                                 CORALINE\n                    Hmmm... Wybie's got a cat like you at\n                    home. Not the quiet Wybie; the one that\n                    talks too much. You must be the Other\n                    Cat.\n\n          \n          The cat LEAPS down and lands on the railing by the\n          basement stairs. He shakes his head and SPEAKS!\n\n          \n\n                                 CAT\n                    No. I'm not the other anything. I'm me.\n\n          \n          He tips his head to one side, opal blue eyes glinting.\n          Coraline is surprised.\n\n          \n\n                                 CORALINE\n                    Um... I can see you don't have button\n                    eyes. But if you're the same cat, how can\n                    you talk?\n\n          \n          The cat shrugs from the tip of his tail to his whiskers.\n\n          \n\n                                  CAT\n                    I just can.\n\n          \n          He leaps smoothly from the railing and onto a large,\n\n          FALLEN TREE.\n\n          \n\n                                 CORALINE\n                    Cats don't talk at home.\n\n          \n\n                                  CAT\n                    No?\n\n          \n\n                                  CORALINE\n                    Nope.\n\n          \n          Climbs up the tree's upended roots, head held high and\n          proud.\n\n          \n\n                                 CAT\n\n                           (DRYLY)\n                    Well, you're clearly the expert on these\n                    things. After all, I'm just a big fat\n                    wuss puss.\n\n          \n\n                                 CORALINE\n                    Come back. Please? I... I'm sorry I\n                    called you that, I really am.\n\n          \n          Coraline forces herself to be polite.\n\n          \n\n                                 CORALINE (CONT'D)\n                    How'd you get here?\n\n          \n\n                                 CAT\n                    I've been coming here for a while.\n\n          \n          He DISAPPEARS behind one a thick root that sticks up,\n          then REAPPEARS from a large knot hole beside Coraline,\n          startling her.\n\n          \n\n                                 CAT (CONT'D)\n                    It's a game we play. She...\n                           (indicates house)\n                    ...hates cats and tries to keep me out.\n                    But she can't, of course.\n\n          \n          He pokes his HEAD DOWN into the knot hole, then POPS IT\n          UP out of ANOTHER KNOT-HOLE, ten feet away.\n\n          \n\n                                 CAT (CONT'D)\n                    I come and go as I please.\n\n          \n\n                                 CORALINE\n\n                           (SKEPTICAL)\n                    The Other Mother hates cats?\n\n          \n\n                                 CAT\n\n                           (CONTEMPTUOUS)\n                    Not like any \"mother\" I've ever known.\n\n          \n\n                                 CORALINE\n                    What do you mean? She's amazing!\n\n          \n          Cat climbs the tree's branches onto the roof.\n\n          \n\n                                 CAT\n                    You probably think this world is a dream\n                    come true. But you're wrong. The Other\n                    Wybie told me so.\n\n          \n\n                                 CORALINE\n                    That's nonsense. He can't talk.\n\n          \n          The cat looks at her, pitying her lack of intelligence.\n\n          \n\n                                 CAT\n                    Perhaps not to you. We cats, however,\n                    have far superior senses than humans and\n                    can see and smell, and --\n\n          \n          Suddenly, the cat drops into a crouch and freezes,\n          sensing something.\n\n          \n\n                                 CAT (CONT'D)\n\n                           (WHISPERING)\n                    Shhhh! I hear something! Right ...over...\n\n          \n          He SCRAMBLES across the roof and disappears around the\n          corner.\n\n          \n          Coraline shrugs, skeptical, and heads down to Spink and\n          Forcible's, their door now circled with CHASER LIGHTS.\n\n          \n\n          \n\n          INT. MISS SPINK AND FORCIBLE'S OTHER APARTMENT - SAME\n\n\n          \n          She pushes past elegant VELVET CURTAINS to discover an\n          enormous, darkened THEATER with dim rows of seats and a\n          high WOODEN STAGE.\n\n          \n          A FLASHLIGHT comes towards her, carried by a black\n          SCOTTIE DOG with button eyes. He looks up at her, sniffs,\n          then leads her down the aisle past rows and rows of\n          BUTTON-EYED SCOTTIES, to a front seat by the Other Wybie.\n          She squeezes his arm hello, he looks back warmly.\n\n          \n\n                                  CORALINE\n                    Hey, Wybie.\n\n          \n          Light flash, the audience quiets, then the curtains open\n          on a SEASIDE SETTING with ROTATING WAVES. OTHER MISS\n          SPINK rises up on stage left, in a MERMAID SUIT, large\n          WIG, BUTTON EYES, and UKULELE.\n\n          \n\n                                 CORALINE (CONT'D)\n\n                           (SHOCKED)\n                    She's practically naked!\n\n          \n          And Miss Spink sings.\n\n          \n\n                                 OTHER MISS SPINK\n                    I'm known as the siren of all seven seas\n                    The breaker of hearts by the bay.\n\n          \n          A flat cut-out ship manned by cut-out men rows in behind\n          her.\n\n          \n\n                                 OTHER MISS SPINK (CONT'D)\n                    So, if you go swimmin'\n                    With bow-legged women,\n                    I might steal your weak heart away.\n\n          \n          She bows her head and the audience of dogs THUMP their\n          tails.\n\n          \n          Spink is LOWERED through the stage floor, the SCENERY\n          CHANGES, and on the right, a huge SCALLOP SHELL RISES up\n          with the OTHER MISS FORCIBLE, clad in the bare minimum -\n          her homage to Botticelli's BIRTH OF VENUS. She's facing\n          the wrong way.\n\n          \n\n                                 CORALINE\n                           (whisper, to Wybie)\n                    Oh my God.\n\n          \n          A dog HOWLS, alerting the near-blind lady, who turns to\n          the audience and begins the next verse.\n\n          \n\n                                 OTHER MISS FORCIBLE\n                    A big-bottomed sea witch may bob through\n                    the waves,\n                    And hope to lead sailors astray,\n                    But a true ocean goddess,\n                    Must fill out her bodice,\n                           (indicates her ample bosom)\n                    To present an alluring display.\n\n          \n          The dogs thump and woof, Wybie and Coraline clap.\n\n          \n          Spink, furious at the greater reaction, gets back in the\n          competition. Rising up, she makes it clear just who she's\n          dissing.\n\n          \n\n                                 OTHER MISS SPINK\n                    Beware of old oysters, too large in the\n                    chest,\n                    Let's banish them from the buffet.\n\n          \n          But Forcible is up to the challenge - the scenery starts\n          to change faster and faster as the ladies rise up and\n          down, competing.\n\n          \n\n                                 OTHER MISS SPINK (CONT'D)\n                    I'm far more nutritious\n\n          \n\n                                 OTHER MISS FORCIBLE\n                    You smell like the fishes\n\n          \n\n                                 OTHER MISS SPINK\n                    Did I hear a banshee?\n\n          \n\n                                 OTHER MISS FORCIBLE\n                    You're sea-green with envy\n\n          \n\n                                 OTHER MISS SPINK\n                    This mermaid enchantress,\n\n          \n\n                                 OTHER MISS FORCIBLE\n                    No, I \"Birth of Venus!\"\n\n          \n          The set rigging can't take it anymore -- ropes snap,\n          sandbags swing, scenery starts to fall.\n\n          \n\n                                 OTHER MISS FORCIBLE\n\n                                 (CONT'D)\n                    Will send sailors swooning --oh--!\n\n          \n\n                                 OTHER MISS SPINK\n                    Will send sailors swooning --oh--!\n\n          \n\n          \n          With a crash, the old ladies TUMBLE DOWN IN A PILE.\n          Coraline winces. The audience HOWLS with laughter as the\n          curtains close on the disaster.\n\n          \n\n          \n          DRUM ROLL. A SCOTTIE DOG pushes a large BUCKET OF WATER,\n          labeled \"POOL\", onto center stage. Spotlights tilt up to\n          the top of very tall diving platforms WHERE THE OLD\n          LADIES NOW STAND. Coraline can't stand it.\n\n          \n\n                                 CORALINE\n\n                           (WHISPERS)\n                    I can't look!\n\n          \n\n                                 OTHER MISS SPINK\n                    Ready to break a leg, Miriam?\n\n          \n\n                                 OTHER MISS FORCIBLE\n                    Our lives for the theater, April!\n\n          \n          They begin to bounce on the diving boards. As they bounce\n          up, the two troupers unzip FAT SUIT DISGUISES from which\n          emerge their YOUNGER BEAUTIFUL SELVES which LEAP to catch\n          matching TRAPEZE BARS that swing into place.\n\n          \n          Coraline LAUGHS with relief and amazement, Other Wybie\n          pleased. Dogs WOOF, MUSIC BEGINS and the TWO BEAUTIES ­\n          eyes BRIGHT BUTTONS, SEXY BATHING SUITS striped pink and\n          green ­ SWING OUT over the stage.\n\n          \n\n                                 YOUNG FORCIBLE\n                    What a piece of work is man!\n                    How noble in reason!\n\n          \n          They FLY past each other on their trapezes, double up,\n          catch one another hand to ankle. We notice a LARGE PEARL\n          RING on Forcible's finger.\n\n          \n\n                                 YOUNG SPINK\n                    How infinite in faculty!\n                    In form and moving how express and\n                    admirable!\n\n          \n          In a SUDDEN change of direction, they SWING OUT over the\n          audience, trapeze bar LOWERING and PULL CORALINE INTO THE\n          AIR! She HOLLERS, terrified.\n\n          \n          They expertly TOSS HER one to the other, FLIPPING AND\n          SPINNING, as they continue their lines. Her SCREAMS\n          become CRIES OF EXHILARATION.\n\n          \n\n                                 YOUNG FORCIBLE\n                    In action like an angel!\n\n          \n\n                                 YOUNG SPINK\n                    In apprehension how like a god!\n\n          \n\n                                 CORALINE\n                    Ahhh!!!\n\n          \n\n                                 YOUNG FORCIBLE\n                    The beauty of the world!\n\n          \n\n                                 YOUNG SPINK\n                    The paragon of animals!\n\n          \n          Coraline swings face-to-face to the dogs in the royal box\n          seats where one licks her.\n\n          \n\n                                 CORALINE\n                    Yeah!!\n\n          \n          The acrobats TOSS CORALINE UP into the air and JACK-KNIFE\n          DIVE into the large bucket below. They rise up, unhurt,\n          just in time to catch Coraline. The THREE BOW to\n          THUNDEROUS THUMPING APPLAUSE and, as the camera pulls\n          back on the scene, Other Wybie throws her a rose!\n\n          \n\n          \n\n          EXT. OTHER ESTATE HOUSE - NIGHT\n\n\n          \n          Other Wybie escorts Coraline up the stone stairs from\n          Spink and Forcible's apartment. The Other Mother and\n          Other Father, a huge, full moon rising behind them, wait\n          at the top of the stairs.\n\n          \n\n                                 OTHER FATHER\n                    Hey there.\n\n          \n\n                                 OTHER MOTHER\n                    Was it wonderful, dear?\n\n          \n          Other Mother's hair looks absolutely beautiful and Other\n          Father dapper. Coraline shakes with excitement as they\n          walk toward the front porch. Other Wybie holds back,\n          loses his smile.\n\n          \n\n                                 CORALINE\n                    Oh yeah. They swooped down and pulled me\n                    right out of my seat ­ Spink and\n                    Forcible. Only they weren't old ladies,\n                    that was just a disguise. But then, I was\n                    flying through the air and... it was, it\n                    was magic.\n\n          \n          They walk up the front steps.\n\n          \n\n                                 OTHER MOTHER\n                    You do like it here, don't you, Coraline?\n\n          \n\n                                 CORALINE\n                           (nods, turns back)\n                    Uh-huh! Good night, Wybie.\n\n          \n          Other Father takes Coraline inside. Wybie, at the bottom\n          of the steps, looks GUILTY AND SAD. Other Mother glares\n          at him, makes a huge, false smile then points to him. He\n          just lowers his head.\n\n          \n\n          \n\n          INT. OTHER HALLWAY - CONTINUOUS\n\n\n          \n\n                                 OTHER MOTHER\n                    You could stay here forever... if you\n                    want to.\n\n          \n\n                                   CORALINE\n                    Really?\n\n          \n\n                                 OTHER FATHER\n                    Sure...we'll sing and play games, and\n                    Mother will cook your favorite meals.\n\n          \n          Other Mother rests her hand on Coraline's shoulder.\n\n          \n\n                                 OTHER MOTHER\n                    There's one tiny little thing we need to\n                    do.\n\n          \n\n                                   CORALINE\n                    What's that?\n\n          \n\n                                 OTHER FATHER\n                    Well, it's a surprise.\n\n          \n\n          \n\n          INT. OTHER DINING ROOM - CONTINUOUS\n\n\n          \n          Coraline is seated in her place. The Other Mother places\n          a SMALL BOX with a bow in front of her, and takes her\n          seat along with Other Father. Coraline excitedly removes\n          the lid.\n\n          \n\n                                 OTHER MOTHER\n                    For you ... our little doll.\n\n          \n          The \"surprise\" is a spool of BLACK THREAD, a SILVER\n          NEEDLE, and a pair of SHINY BLACK BUTTONS -- FOR\n\n          CORALINE'S EYES.\n\n          \n          Coraline GASPS. She looks up at her Other Parents, hoping\n          it's a bad joke.\n\n          \n\n                                 OTHER MOTHER (CONT'D)\n\n                           (SMILING)\n                    Black is traditional, but if you'd prefer\n                    pink or vermillion or chartreuse...\n\n          \n          Coraline sees their button eyes changing colors, growing\n          ever more panicked.\n\n          \n\n                                 OTHER MOTHER (CONT'D)\n                    ... though you might make me jealous.\n\n          \n\n                                 CORALINE\n\n                    NO WAY!\n\n          \n          She bats the box away, and her hands FLY to her face,\n          COVER her eyes.\n\n          \n\n                                 CORALINE (CONT'D)\n\n                    YOU'RE NOT SEWING BUTTONS IN MY EYES!\n\n          \n\n                                 OTHER MOTHER\n                    Oh, but we need a yes ... if you want to\n                    stay here.\n\n          \n          Other Father tests the needle on his finger.\n\n          \n\n                                 OTHER FATHER\n\n                           (ENTHUSIASTIC)\n                    So sharp you won't feel a thi-- Oww!\n\n          \n          Other Mother KICKS him under the table. Embarrassed, he\n          puts the needle back in the box.\n\n          \n\n                                 OTHER MOTHER\n                    There now; it's your decision, darling.\n                    We only want what's best for you.\n\n          \n          She walks over and puts her hand, now ICY COLD, on\n          Coraline's shoulder. Coraline PUSHES it away and STANDS\n\n          UP.\n\n          \n\n                                 CORALINE\n                    I'm... I'm going to bed! RIGHT NOW!\n\n          \n\n                                 OTHER MOTHER\n\n                           (WOUNDED)\n                    Bed?\n\n          \n\n                                 OTHER FATHER\n                    Before dinner?\n\n          \n          Coraline fights to control her quaking voice.\n\n          \n\n                                 CORALINE\n                    I'm really, really tired. Yeah...\n                           (fakes huge yawn)\n                    I just need to sleep on things.\n\n          \n          Other Mother stands, masking disappointment.\n\n          \n\n                                 OTHER MOTHER\n                    Well of course you do, darling... I'll be\n                    happy to tuck you in.\n\n          \n          Coraline backs away, urging them to stay where they are.\n\n          \n\n                                 CORALINE\n                           (palms out, forced smile)\n                    Oh, no thanks, uh, you-you've done so\n                    much already--\n\n          \n          She turns to leave and finds the Other Mother BLOCKING\n          THE DOORWAY. Other Father joins her.\n\n          \n\n                                 OTHER MOTHER\n                    You're welcome. And I ­\n                           (smiles to Other Father)\n                    we aren't worried at all, darling.\n\n                           (SOFTLY)\n                    Soon you'll see things our way.\n\n          \n          She lets go. She and the Other Father herd Coraline\n          across the hallway to the stairs.\n\n          \n\n          \n\n          INT. OTHER HALLWAY, STAIRS, UPPER HALL - CONTINUOUS\n\n\n          \n          Coraline carefully climbs the stairs, the Other Parents\n          watching. When they can no longer see her, she RACES up\n          the last steps and DASHES to her Other Bedroom.\n\n          \n\n          \n\n          INT. CORALINE'S OTHER BEDROOM - TWILIGHT\n\n\n          \n          Coraline shuts the door and is quickly surrounded by\n          fluttering DRAGONFLIES.\n\n          \n\n                                 MAGIC DRAGONFLY\n                    What's wrong, Coraline? Don't you want to\n                    play?\n\n          \n          She jumps up and CATCHES the paper creatures, opens the\n          TOY CHEST and tosses them in.\n\n          \n          The PLUSH BLUE SQUID greets her from the shelf, followed\n          by the TOY TANK GIRAFFE.\n\n          \n\n                                 TOY SQUID\n                    Yeah, I wanna hugga your face!\n\n          \n\n                                 TOY TANK GIRAFFE\n                    Get a grip, soldier.\n\n          \n          She GRABS them both and drops them in the toy chest.\n\n          \n          Her PHOTO FRIENDS - NOW WITH BLACK BUTTONS FOR EYES -\n          call out from the photo by her bed.\n\n          \n\n                                 PHOTO FRIENDS\n                    Hey!\n\n          \n\n                                 PHOTO FRIEND 1\n                    Where's yer buttons, yuper?\n\n          \n\n                                 PHOTO FRIEND 2\n                    You wanna stay, don'tcha?\n\n          \n          Coraline grabs them as well, drops them in the chest, and\n          SHUTS the lid. She barricades the door with a DRESSER and\n          CHAIRS and then the TOY CHEST.\n\n          \n\n                                 CORALINE\n                    I'm going home tonight, robots - and I\n                    won't be back.\n\n          \n          She sits on the bed, pulls off the blue boots then CLIMBS\n          UNDER THE COVERS, pulling them over her head and holding\n          tight. She HUGS herself to stop shaking, knowing she must\n          fall asleep in this bed to wake up in her real bed at\n          home. She closes her eyes and tells herself:\n\n          \n\n                                 CORALINE (CONT'D)\n                    Go to sleep, go to sleep, go to sleep, go\n                    to sleep!\n\n          \n          She tosses one way, then another. WE HEAR her voice\n\n          CONTINUE:\n\n          \n\n                                 CORALINE (V.O.) (CONT'D)\n                    Go to sleep, go to sleep...\n\n          \n          There are strange, backwards sounds, then the eerie\n          voices of Other Mother and Other Father.\n\n          \n\n                                 OTHER MOTHER (V.O.)\n                    There's just one tiny little thing we\n                    have to do.\n\n          \n\n                                 CORALINE\n                    Go to sleep, go to sleep, go to sleep...\n\n          \n\n                                 OTHER FATHER (V.O.)\n                    So sharp you won't feel a thing...\n\n          \n\n                                 CORALINE\n                    Go to sleep, go to sleep, go to sleep...\n\n          \n\n                                 OTHER MOTHER (V.O.)\n                    Soon you'll see things our way...\n\n          \n          Coraline fidgets and turns and turns again but sleep\n          finally wraps her and takes her to oblivion.\n\n          \n\n                                                        MATCH PULLBACK\n\n                                                             DISSOLVE:\n\n          \n\n          \n\n          INT. OTHER BEDROOM - LATER\n\n\n          \n          We see Coraline's room, BRIGHTLY LIT LIKE MORNING IN THE\n\n          REAL WORLD.\n\n          \n          ANGLE ON Coraline's face beneath the covers, as she's\n          WOKEN by the light. With a hopeful look, she calls out,\n          pulls back the covers:\n\n          \n\n                                 CORALINE\n                    Mom!... Dad!..\n\n          \n          Her smile turns to shock -- there's a BRIGHT, FULL MOON\n          in her window and it's STILL NIGHTTIME IN THE OTHER\n\n          WORLD.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Oh God, I'm still here?\n\n          \n\n          \n\n          INT. OTHER STAIRS, LOWER HALLWAY - SAME\n\n\n          \n          Coraline races downstairs to the Other Living Room where\n          the little door home must be! But the living room is\n          LOCKED TIGHT. She pulls at the handles, plants a foot and\n          tries with all her might! It's no use. She stops,\n          panting, then hears a piano note being hit over and over.\n\n          \n\n          \n\n          INT. OTHER FATHER'S STUDY - SAME\n\n\n          \n          Coraline opens the door and finds the Other Father\n          sitting at the piano, his back to her, hitting the note.\n          She speaks in her bravest voice.\n\n          \n\n                                 CORALINE\n                    Hey you! Where's the Other Mother?     I\n                    want to go home.\n\n          \n          The Other Father turns around. He looks ill; his hair\n          messed and his glasses askew. He speaks, his voice slowed-\n          down.\n\n          \n\n                                 OTHER FATHER\n                    All will be swell, soon as Mother's\n                    refreshed. Her strength is our strength.\n\n          \n          The WHITE-GLOVED HANDS POP OUT from the piano. One COVERS\n          HIS MOUTH, the other WAGS A FINGER in his face.\n\n          \n\n                                 OTHER FATHER (CONT'D)\n                    Mustn't talk when Mother's not here.\n\n          \n\n                                 CORALINE\n                    If you won't even talk to me, I'm gonna\n                    find the Other Wybie. He'll help me.\n\n          \n          She turns to go.\n\n          \n\n                                 OTHER FATHER\n                    No point; he pulled a long face...\n\n          \n          He PULLS DOWN the corners of his mouth impossibly far.\n\n          \n\n                                 OTHER FATHER (CONT'D)\n                    ...and Mother didn't like it.\n\n          \n          The PIANO HANDS pop out again, aggressively SHUT HIS\n          MOUTH and SPIN HIM away from Coraline. Frightened, she\n          runs to the door that leads outside, and pulls it open.\n\n          \n\n          \n\n          EXT. OTHER HOUSE - NIGHT, FULL MOON\n\n\n          \n          She runs out the back porch, towards the Other Garden.\n\n          \n\n          OTHER STEEP HILLSIDE TRAIL\n\n          \n          She crosses the trail, the Other House in the distance.\n\n          \n\n          ENTRANCE TO OTHER ORCHARD\n\n          \n          She runs down the path.\n\n          \n\n          OTHER ORCHARD\n\n          \n          Coraline runs past trees that are LUSH WITH GREEN LEAVES\n\n          AND RIPE RED FRUIT.\n\n          \n          She's panting hard, and has to slow to a fast walk. The\n          further she goes, the LESS TREE-LIKE the fruit trees\n          become.\n\n          \n          She hears the CAT MEROWWW. Surprised, she looks down.\n\n          \n\n                                 CAT\n                    And what do you think you're doing?\n\n          \n          The cat trots along by her feet. She blinks.\n\n          \n\n                                 CORALINE\n                    Well, I'm gettin' outta here. That's what\n                    I'M doing.\n\n          \n          The sky starts to BRIGHTEN and the apple trees become\n\n          WIRE-THIN SHAPES OF TREES.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Huh? Something's wrong. Shouldn't the\n                    old well be here?\n\n          \n          The remnants of the trees and the sky and the ground give\n          way to a PALE, EMPTY NOTHINGNESS. No ground or shadows.\n\n          \n\n                                 CAT\n                    Nothing out here ... it's the empty part\n                    of this world. She only made what she\n                    knew would impress you.\n\n          \n\n                                 CORALINE\n                    But why? Why does she want me?\n\n          \n          They walk over the horizon.\n\n          \n                                 CAT (cont'd)\n                    She wants something to love, I think.\n                    Something that isn't her... Or maybe\n                    she'd just love something to eat.\n\n          \n\n                                 CORALINE\n                    Eat? That's ridiculous, mothers don't eat\n                    daughters!\n\n          \n\n                                 CAT\n                    I don't know. How do you taste?\n\n          \n\n          OTHER HOUSE REAPPEARS\n\n          \n          A SHAPE RISES in front of them in the whiteness and\n          becomes the beautiful OTHER HOUSE. Coraline and the cat\n          slow, then the front yard and topiary, the sky, hills,\n          white gravel drive and the poplar trees behind them FILL\n\n          IN.\n\n          \n\n                                 CORALINE\n                    Huh? But how can you walk away from\n                    something and still come back to it?\n\n          \n          The cat curls its tail into a question mark, and tips its\n          head to one side.\n\n          \n\n                                 CAT\n                    Walk around the world.\n\n          \n\n                                   CORALINE\n                    Small world.\n\n          \n          Coraline shivers. The cat suddenly TENSES, focuses on a\n          shrub.\n\n          \n\n                                   CAT\n                    Hang on--\n\n          \n          He bounds towards the shrub and chases out a CUTE\n          KANGAROO MOUSE in uniform with a TINY TRUMPET. Before\n          Coraline can blink, he's PINNED IT DOWN.\n\n          \n\n                                 CORALINE\n                    Stop, he's one of the circus mice!\n\n          \n          With a SWIFT BLOW of its paw, the cat KNOCKS the mouse\n          into the air, and catches it in his mouth. He gives a\n          QUICK, KILLING BITE - CORALINE GASPS - and the mouse\n          TRANSFORMS into a BIG DEAD RAT. Coraline is stunned. He\n          drops the rat on the ground.\n\n          \n\n                                 CAT\n                    I don't like rats at the best of times,\n                    but this one was sounding an alarm.\n\n          \n          The cat picks the rat up and heads off. Slack-jawed,\n          Coraline speaks with admiration.\n\n          \n\n                                 CORALINE\n                    Gooooood kitty.\n\n          \n          Coraline looks to the house with a determined look.\n\n          \n          On the porch, she takes out a HEAVY CANE from the\n          UMBRELLA STAND and hits it into her hand.\n\n          \n\n          \n\n          INT. HOUSE,   OTHER HALLWAY - SAME\n\n\n          \n          Coraline, standing in front of the living room doors,\n          TESTS the cane in her hands, and peers down the hall for\n          danger. It's dead quiet -- no piano, no sounds of\n          anything.\n\n          \n          She JAMS the cane through the doors' handles, and PULLS\n          with all her might. One HANDLE AND LOCK BREAK and the\n          door swings open into the pitch black living room. The\n          hall light casts a narrow path directly to the Other\n          Little Door on the far wall, cracked open. She steps into\n          the room.\n\n          \n\n          \n\n          INT. OTHER LIVING ROOM - CONTINUOUS\n\n\n          \n          A huge ARMOIRE BUG suddenly crab-steps in her path,\n          blocking the little door, and all around her things start\n          to glow. The room has been TRANSFORMED into an amazing\n          BUG MUSEUM, with all sorts of glowing, living specimens\n          in the place of the old furniture and furnishings. The\n          radiators are now big caterpillars, the Nordic Track a\n          serving bug.\n\n          \n          The Other Mother speaks out, startling Coraline.\n\n          \n\n                                 OTHER MOTHER (O.S.)\n                    They say even the proudest --\n\n          \n          The sofa, now a LARGE BUG, turns in place to reveal her\n          sitting on it.\n\n          \n\n                                 OTHER MOTHER (CONT'D)\n                    --spirit can be broken ... with love.\n\n          \n          She's all smiles, button eyes shining, one hand held out\n          in a behold my handiwork gesture.\n\n          \n          A BUG CHAIR scoops up Coraline and brings her to the\n          Other Mother.\n\n          \n          The Other Mother takes a candy dish from the servant bug.\n\n          \n\n                                 OTHER MOTHER (CONT'D)\n                    Of course, chocolate never hurts. Like\n                    one?\n\n          \n          She extends a CANDY DISH filled LIVING CHOCOLATE BEETLES.\n\n          \n\n                                 OTHER MOTHER (CONT'D)\n                    They're Cocoa Beetles from Zanzibar.\n\n          \n          Coraline is disgusted. The Other Mother takes back the\n          dish and BITES OFF THE HEAD OF ONE. It's the first thing\n          she's eaten in the film.\n\n          \n\n                                 CORALINE\n                    I want to be with my real mom and dad. I\n                    want you to let me go.\n\n          \n          The Other Mother FROWNS, swallows. She speaks with a\n          FRIGHTENING STEELINESS in her voice.\n\n          \n\n                                 OTHER MOTHER\n                    Is that any way to talk to your mother?\n\n          \n          Coraline is mad, and feeling mad makes her brave.\n\n          \n\n                                 CORALINE\n                    You aren't my mother.\n\n          \n          The Other Mother STRAIGHTENS. Her button eyes, now DEAD,\n          stare into Coraline's.\n\n          \n\n                                 OTHER MOTHER\n                    Apologize at once, Coraline!\n\n          \n          Coraline stares right back, not blinking.\n\n          \n\n                                 CORALINE\n                    No.\n\n          \n\n                                 OTHER MOTHER\n\n                           (TENSELY)\n                    I'll give you to the count of three.\n                    One...\n\n          \n          Then she stands up, GROWING TALLER.\n\n          \n\n                                 OTHER MOTHER (CONT'D)\n                    ...two...\n\n          \n          She grows TALLER STILL and SCARIER like a super model on\n          steroids.\n\n          \n\n                                 TALL OTHER MOTHER\n\n                    ...THREE!\n\n          \n          This TALL OTHER MOTHER GRABS Coraline by her NOSE and\n          DRAGS her to the hallway.\n\n          \n\n                                 CORALINE\n                    Ow, what are you doing!\n\n          \n\n          \n\n          INT. OTHER HOUSE HALLWAY - CONTINUOUS\n\n\n          \n          She PULLS Coraline down the hallway to the mirror at the\n          end. Coraline flails at the Tall Other Mother with her\n          fists.\n\n          \n\n                                 CORALINE\n                    Ow, that hurts!\n\n          \n          Tall Other Mother SHOVES Coraline RIGHT THROUGH THE\n          MIRROR as if it was water!\n\n          \n\n          \n\n          INT. CLOSET-PRISON BEHIND THE MIRROR - CONTINUOUS\n\n\n          \n          Coraline HITS the ground hard. The Tall Other Mother,\n          head thrust through the mirror, stares down at her\n          angrily.\n\n          \n\n                                 TALL OTHER MOTHER\n                    You may come out when you've learned to\n                    be a loving daughter!\n\n          \n          She PULLS HER HEAD OUT and leaves Coraline in DARKNESS.\n\n          \n          Coraline pounds on the mirror-door, kicks it with her\n          blue boots. A SOB wells up in her throat.\n\n          \n          And then we hear a SOFT GHOSTLY MOAN.\n\n          \n          She turns. She can just make out a sagging iron bed. When\n          the voice speaks, there is a faint glow from beneath its\n          stained cover.\n\n          \n\n                                 CORALINE\n\n                           (FRIGHTENED)\n                    Who's there?\n\n          \n\n                                 TALL GIRL GHOST (O.S.)\n\n                           (WHISPERS)\n                    Hush! And shush! For the Beldam might be\n                    listening!\n\n          \n          Coraline steps towards the bed, the faint glow from under\n          the covers in sync with the words she hears.\n\n          \n\n                                 CORALINE\n\n                           (WHISPERS)\n                    You ... you mean the Other Mother? ...\n\n          \n          She gently pulls back the sheets.\n\n          \n          The DIMLY GLOWING GHOSTS of THREE CHILDREN, BUTTON EYES,\n          SIT UP: a SWEET GIRL GHOST, Coraline's size; a TALL GIRL\n          GHOST, emotional; a young BOY GHOST, very sad.\n\n          \n\n                                   CORALINE (CONT'D)\n                    Who are you?\n\n          \n\n                                 BOY GHOST\n\n                           (WISTFUL)\n                    Don't remember our names... But I `member\n                    my true mommy...\n\n          \n          The boy, dressed like Huck Finn, CONJURES up ghost\n          flowers.\n\n          \n          The strange-looking flowers wither and fade. He's so sad\n          that Coraline takes his cold hand and squeezes it.\n\n          \n\n                                 CORALINE\n                    Why are you all here?\n\n          \n\n                                  ALL GHOSTS\n                    The Beldam!\n\n          \n          The ghosts move about in a dance macabre, like ghostly\n          fish in water.\n\n          \n\n                                 SWEET GIRL GHOST\n                    She spied on our lives,\n                    through the little doll's eyes,\n\n          \n\n                                 BOY GHOST\n                    And saw that we weren't    happy.\n\n          \n\n                                 TALL GIRL GHOST\n                    So she lured us away,\n\n          \n\n                                 TALL GIRL GHOST (CONT'D)\n                    with treasures and treats,\n\n          \n\n                                 SWEET GIRL GHOST\n                    and games to play!\n\n          \n\n                                 BOY GHOST\n                    Gave all that we asked -\n\n          \n\n                                 SWEET GIRL GHOST\n                    yet we still wanted more -\n\n          \n\n                                 TALL GIRL GHOST\n                    So we let her sew the buttons.\n\n          \n\n                                 BOY GHOST\n                    She said that she loved us,\n\n          \n\n                                 TALL GIRL GHOST\n                    But she locked us here\n\n          \n\n                                 ALL GHOSTS\n                    And ate up our lives.\n\n          \n          The ghosts fall back into their bed and sink down.\n          Coraline is stunned. She thinks a little and then speaks,\n          trying to steady her voice.\n\n          \n\n                                 CORALINE\n                    Well, she can't keep me in the dark\n                    forever; not if she wants to win my life.\n                    Beating her is my only chance.\n\n          \n          A beat. Then the Sweet Girl asks in her sing-song way:\n\n          \n\n                                 SWEET GIRL GHOST\n                    Perhaps, if you do win your escape, you\n                    could find our eyes?\n\n          \n\n                                 CORALINE\n                    Has she taken those, too?\n\n          \n\n                                 SWEET GIRL GHOST\n                    Yes, miss. And hidden them.\n\n          \n\n                                 BOY GHOST\n                    Find our eyes, mistress, and our souls\n                    will be freed.\n\n          \n\n                                 CORALINE\n                    I ... I'll try.\n\n          \n          The ghosts PULSE with hope. Coraline sits down against\n          the mirror door, bounces her head against it. She's not\n          hopeless.\n\n          \n          Suddenly, HANDS REACH THROUGH THE MIRROR and PULL HER\n\n          OUT!\n\n          \n\n          \n\n          INT. OTHER HALLWAY - NIGHT\n\n\n          \n          C.U. of Coraline's FACE, eyes wild, as she TEARS at the\n          hands that hold her. She GRABS one and, FLIPS her MASKED\n          ATTACKER onto the ground. She pulls off his mask: it's\n          the OTHER WYBIE, his mouth stitched into a PAINFUL, EAR\n\n          TO EAR SMILE.\n\n          \n\n                                 CORALINE\n\n                           (PANTING)\n\n                    WYBIE?..\n\n          \n          Coraline sits him up.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Did she do this to you?\n\n          \n          She unstitches his painfully-huge grin.\n\n          \n\n                                 CORALINE (CONT'D)\n                    I hope that feels bet--\n\n          \n\n                                  OTHER WYBIE\n                    Shhh.\n\n          \n          He stops her with a finger to her lips, and points to the\n          Other Living Room, its door UNLOCKED AND OPEN. He grabs\n          her hand and PULLS her there.\n\n          \n\n          \n\n          INT. OTHER LIVING ROOM ­ CONTINUOUS\n\n\n          \n          It's dark, the bug furniture asleep. They run to the big\n          armoire bug that guards the little door and SHOVE IT out\n          of the way. It CRASHES to the floor. And from upstairs, a\n          voice calls out.\n\n          \n\n                                 TALL OTHER MOTHER (O.S.)\n                    Coraline? Is that you!\n\n          \n\n                                  CORALINE\n                    Let's go!\n\n          \n          She opens the little door. A COLD WIND blows from the\n          dark passageway, now filled with SPIDER WEBS and the\n          SHOES, COATS, AND HATS of other kids who tried to escape.\n\n          \n\n                                  TALL OTHER MOTHER (O.S.)\n                    Coraline...\n\n          \n          The tunnel MOVES at the sound of her voice. Coraline\n          takes Other Wybie's arm.\n\n          \n\n                                 CORALINE\n                    Come on. She'll hurt you again!\n\n          \n          He shakes his head no, then pulls off his glove to reveal\n          a HAND MADE OF SAWDUST. He blows his fingers away.\n\n          \n          HIGH HEELS CLICK from the stairs; she's ALMOST THERE!\n\n          \n\n                                 TALL OTHER MOTHER (O.S.)\n                    Coraline? How dare you disobey your\n                    mother!!\n\n          \n          Other Wybie shoves Coraline into the tunnel and shuts the\n          door.\n\n          \n\n          \n\n          INT. PASSAGEWAY ­ CONTINUOUS\n\n\n          \n          Hunched down, she moves as quickly as she can, tearing\n          through the sticky cobwebs.\n\n          \n\n                                 TALL OTHER MOTHER (O.S.)\n                           (calling after her)\n                    Coraline!\n\n          \n          Strands of web brush her face, stick to her hair; she\n          closes her eyes, hands out until she finally gets to the\n          little door at the other end. She DIVES, TUCKS, --\n\n          \n\n          \n\n          INT. REAL LIVING ROOM - CONTINUOUS TIME, BUT DAY HERE\n\n\n          \n          -- AND ROLLS OUT onto the REAL LIVING ROOM FLOOR.\n          Coraline SLAMS the door shut and turns the sharp little\n          key ­ still in the keyhole ­ to LOCK IT.\n\n          \n          She stands, covered in dust and cobwebs, and calls out\n          with joy and relief.\n\n          \n\n                                 CORALINE\n\n                    I'M HOME!\n\n          \n\n          \n\n          INT. HALLWAY, STAIRWAY, DAD'S STUDY - SAME\n\n\n          \n          She goes quickly through the apartment, happily calling:\n\n          \n\n                                 CORALINE\n                    Anybody here? Hello, hello, hello! Real\n                    Dad ... Real Mom!\n\n          \n\n          \n\n          INT. KITCHEN - SAME\n\n\n          \n\n                                 CORALINE\n                    Oh, Mom's groceries!\n\n          \n          There are bags of groceries on the table, as if her\n          mother had just gotten in. She pulls open a bag to peek\n          and FRUIT FLIES shoot out. The food is spoiled.\n\n          \n\n                                 CORALINE (CONT'D)\n\n                           (PUZZLED)\n                    Uhhh. That's disgusting.\n\n          \n          Door bell rings.\n\n          \n\n          \n\n          INT. HALLWAY - CONTINUOUS\n\n\n          \n          She runs excitedly to the door and flings it open.\n\n          \n\n                                 CORALINE\n                    I missed you guys so much-- You'll never--\n\n          \n\n          INT./EXT. FRONT DOOR - CONTINUOUS, RAIN\n\n\n          \n          But it's just Wybie, the real boy.\n\n          \n\n                                 CORALINE\n                    Oh... the Wybie that talks...\n\n          \n          He's waves, face down, awkward.\n\n          \n\n                                 WYBIE\n                    Huh? Ha ha ha....yeah... Um, so you know\n                    tha-that old doll I gave you?\n\n          \n          Coraline tenses, sharp breath.\n\n          \n\n                                 WYBIE (CONT'D)\n                    Um... my Gramma's real mad, says it was\n                    her sister's - the one that...\n                    disappeared?\n\n          \n          She reads him like a book.\n\n          \n\n                                 CORALINE\n\n                           (REALIZATION)\n                    You stole that doll, didn't you?\n\n          \n          Wybie answers quickly, guilty as heck.\n\n          \n\n                                 WYBIE.\n                    Well, i-it looked just like you. And I\n\n                    FIGURED--\n\n          \n          Coraline, rushing the words, tells him the truth.\n\n          \n\n                                 CORALINE\n                    It used to look like this pioneer girl;\n                    then Huck Finn junior; then it was this\n                    Little Rascals chick with all these\n                    ribbons, and braids, and....\n\n          \n          Her voice trails off. Coraline studies Wybie, then, snaps\n          her fingers.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Grandma's missing sister!\n\n          \n          He nods, one brow raising up.\n\n          \n\n                                 CORALINE (CONT'D)\n                    I think I just met her. C'mon!\n\n          \n          She pulls him inside and--\n\n          \n\n          INT HALLWAY - CONTINUOUS\n\n          \n          --drags him down the hall.\n\n          \n\n                                 WYBIE\n                    Uh, listen, I-I-I'm really not supposed\n\n                    TO--\n\n          \n\n          \n\n          INT. LIVING ROOM - CONTINUOUS\n\n\n          \n          Coraline WALKS HIM to the LITTLE DOOR in the corner wall\n          and points. Wybie looks around anxiously, fearful and\n          curious to be in his grandmother's old house.\n\n          \n\n                                 CORALINE\n                    She's in there.\n\n          \n          Reluctantly, he bends down and reaches for the key in the\n          lock.\n\n          \n\n                                 WYBIE\n                    C-can you ­ can you unlock it?\n\n          \n          She grabs his hand, stops him.\n\n          \n\n                                 CORALINE\n                    Not in a million years. But it wouldn't\n                    matter; she can't escape without her\n                    eyes. None of the ghosts can.\n\n          \n          Wybie stares at her, nodding his head as if he\n          understands her crazy story. He changes the subject, gets\n          back to his mission.\n\n          \n\n                                 WYBIE\n                    Huhhhhhh... So, uh, I really need to get\n                    that doll?\n\n          \n          Coraline snaps at him.\n\n          \n\n                                 CORALINE\n                    Great! I'd love to get rid of it!\n\n          \n          She exhales in a huff. Grabs his sleeve, leads him from\n          room.\n\n          \n\n          \n\n          INT. CORALINE'S BEDROOM - CONTINUOUS\n\n\n          \n          The doll's not on the bed, not on the chairs or moving\n          boxes.\n\n          \n\n                                 CORALINE\n                    Where are you hiding, you little\n                    monster?!\n\n          \n          Wybie nervously watches Coraline pull out her dresser\n          drawers, yank cushions off the window seat.\n\n          \n\n                                 WYBIE\n                    You and Gramma been talking?\n\n          \n\n                                 CORALINE\n                    The doll's her spy! It's how she watches\n                    you, finds out what's wrong with your\n                    life!\n\n          \n          Wybie, trapped like a deer-in-the-headlights, tries to\n          make sense of her remarks.\n\n          \n\n                                 WYBIE\n                    The doll...is my Gramma's...spy.\n\n          \n\n                                 CORALINE\n                    NO! - the Other Mother! She's got this\n                    whole world where everything's better -\n                    the food, the garden, the--\n                           (leans in on him)\n                    --neighbors.\n\n          \n          Holds her hands up.\n\n          \n\n                                 CORALINE (CONT'D)\n                    But it's all a trap!\n\n          \n          Wybie, eager to escape, cups hand to ear by the window.\n\n          \n\n                                 WYBIE\n                    Yeah... Uh, I think I heard someone\n                    calling me, Jonesy.\n\n          \n          Coraline sees right through him.\n\n          \n\n                                 CORALINE\n                    Don't believe me?... You can ask the cat!\n\n          \n          He moves around her towards the door, turns to leave.\n\n          \n\n                                 WYBIE\n                    The cat... I-I'll just tell Gramma that\n                    you couldn't find the doll-- OW!\n\n          \n          A blue boot - thrown by Coraline - HITS his arm. He turns\n          back as she takes off the second one.\n\n          \n\n                                 CORALINE\n                    You're not LISTENING TO ME!\n\n          \n\n                                 WYBIE\n                    That's ... cause ... you're CRAZY!\n\n          \n          He FLEES as the second boot flies past. Coraline GROWLS,\n          and gives chase.\n\n          \n\n          \n\n          INT UPPER STAIRWAY - CONTINUOUS\n\n          \n          She grabs her boots from the floor, and CHASES him down\n          the stairs in her socks.\n\n          \n\n          \n\n          EXT. FRONT DOOR/DRIVEWAY - CONTINUOUS, RAINING\n\n\n          \n          Door flies open and Wybie RUNS down the front steps to\n          his electric bike. Coraline RACES down after him.\n\n          \n\n                                  CORALINE\n                    You creep!\n\n          \n\n                                 WYBIE\n                           (calling over his shoulder)\n                    Crazy!!\n\n          \n          He RUNS his bike towards the FALLEN TREE, HOPS ON and\n          PEDALS LIKE MAD. As Coraline hurls a boot at him, he GUNS\n          the motor and escapes down a side path past the driveway.\n\n          \n\n                                 CORALINE\n                    Crazy?... You're the jerk-wad that gave\n                    me the doll!\n\n          \n          Out of breath, she turns away and notices her PARENTS'\n          CAR parked to the side.\n\n          \n\n                                  CORALINE (CONT'D)\n                    Mom!   Dad!\n\n          \n          Excited, she hops over the fallen tree and runs to the\n          car.\n\n          \n\n          \n\n          INT. JONES' CAR - SAME\n\n          Coraline, standing in the rain, excitedly looks through\n          the car's window. But the car is EMPTY. She spots her\n          mom's PHONE, then opens the door to grabs it and speed\n          dial a number.\n\n          \n\n                                 CORALINE\n                    Pick it up, Dad, pick it up.\n\n          \n\n                                  CHARLIE (V.O.)\n                    Hi!\n\n          \n\n                                  CORALINE\n                    Dad!   Whe-\n\n          \n\n                                 CHARLIE (V.O.)\n                    I'm digging in my garden right now, but\n                    leave a message and I'll get right back\n                    to you.\n\n          \n          She dejectedly looks at the phone, then snaps it shut.\n\n          \n\n                                 CORALINE\n                    Where have you gone?\n\n          \n\n          \n\n          INT. SPINK AND FORCIBLE'S LIVING ROOM - EVENING\n\n\n          \n          Miss Spink is knitting a SWEATER WITH WINGS for a worried-\n          looking ANGUS, one of the Scotties, who sits on her lap.\n\n          \n          Coraline sips tea, anxious, the other two DOGS beside\n          her.\n\n          \n\n                                 CORALINE\n                    Uh... don't you only make wings for the\n                    ... dead ones?\n\n          \n\n                                 MISS SPINK\n                    Just looking ahead dear... Angus hasn't\n                    been feeling very well of late.\n\n          \n\n                                 MISS FORCIBLE (O.S.)\n                    April? Aren't you getting ready?\n\n          \n\n                                 MISS SPINK\n                           (looks off camera)\n                    We've lost our ride, Miriam. Caroline\n                    says her parents have vanished, quite\n                    completely.\n\n          \n          ANGLE ON Miss Forcible, tightening her elaborate corset\n          behind a screen, using pulleys and hooks.\n\n          \n\n                                 MISS FORCIBLE\n                    What?! We've waited months for those\n                    tickets.\n\n          \n          One of the corset hooks FLIES UP and pulls off her wig.\n          She ignores it and comes over to address Spink.\n\n          \n\n                                 MISS SPINK\n                    I suppose we could walk!\n\n          \n\n                                 MISS FORCIBLE\n                    With your gamy legs? It's nearly two\n                    miles to the theater!\n\n          \n          Coraline CLEARS HER THROAT, frustrated.\n\n          \n\n                                 MISS SPINK\n                    Oh, oh yes ... your missing parents. We\n                    know just what you need. Miriam,\n                    get...that's right.\n\n          \n          Miss Forcible grabs another dish of old stuck-together\n          candy and puts it in front of Coraline.\n\n          \n\n                                 CORALINE\n                    How is hundred-year-old candy going to\n\n                    HELP--\n\n          \n          Miss Spink suddenly RAISES her KNITTING NEEDLES as if to\n          STAB CORALINE. Coraline yelps, hands up in defense. But\n          it's CANDIES she attacks, sending sticky chips flying,\n          making loud grunts as she stabs.\n\n          \n          She pulls a LARGE, THREE-SIDED CANDY WITH A HOLE IT from\n          the rubble and passes it to Coraline.\n\n          \n\n                                 MISS SPINK\n                    There you go, sweety.\n\n          \n          Coraline studies the odd candy.\n\n          \n\n                                 CORALINE\n                    What's it for?\n\n          \n          She holds it up, looks through its hole at the ladies.\n\n          \n\n                                 MISS SPINK\n                    Well,it might help. They're good for bad\n                    things, sometimes.\n\n          \n\n                                 MISS FORCIBLE\n                    No, they're good for lost things.\n\n          \n          They don't look any different.\n\n          \n\n                                 MISS SPINK\n                    It's bad things, Miriam.\n\n          \n\n                                 MISS FORCIBLE\n                    Lost things, April.\n\n          \n\n                                 MISS SPINK\n                    Bad.\n\n          \n\n                                  MISS FORCIBLE\n                    Lost.\n\n          \n\n                                  MISS SPINK\n                    Bad things!\n\n          \n\n                                  MISS FORCIBLE\n                    Lost.\n\n          \n\n                                  MISS SPINK\n                    Bad.\n\n          \n\n                                  MISS FORCIBLE\n                    Lost.\n\n          \n          Coraline can't take anymore. She gets up, takes the odd\n          piece of candy and leaves.\n\n          \n\n          \n\n          INT. PARENT'S BEDROOM - NIGHT\n\n\n          \n          Coraline, dressed for bed with her blanket over her\n          shoulder, walks into her parent's room, the PHOTO of her\n          and her parents at the Bear Fountain in the foreground.\n\n          \n          She pulls down the bed covers and builds COPIES of her\n          parents out of pillows. She fits an extra neck brace on\n          one pillow head and some reading glasses on the other.\n          Then Coraline lies down and pulls up the covers, very\n          sad.\n\n          \n\n                                 CORALINE\n                    Good-night, Mom. Good-night, Dad.\n\n          \n          She kisses them both and BEGINS TO CRY. CAM PUSHES IN.\n\n          \n\n                                                         DISSOLVE TO:\n\n          \n\n          \n\n          INT. PARENT'S BEDROOM - NIGHT, LATER\n\n\n          \n          Coraline, asleep. SOMETHING blurs past camera. One paw\n          and then two paws bat her nose. She opens her eyes to\n          find OPAL BLUE EYES staring at her. It's the BLACK CAT,\n          purring loudly.\n\n          \n\n                                 CORALINE\n                    Hello. How did you get in?\n\n          \n          The cat yawns, his eyes flash.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Do you know where Mom and Dad are?\n\n          \n          The cat blinks. Then he heads out the door.\n\n          \n\n          \n\n          INT. LOWER HALLWAY - CONTINUOUS\n\n\n          \n          She follows him, wrapped in her blanket, to the MIRROR at\n          the end of the hallway. The mirror starts to GLOW and\n          then an IMAGE FORMS within the glass. It's HER PARENTS!\n          They cling together, blue with cold, as snow falls.\n\n          \n\n                                 CORALINE\n\n                    MOM! DAD!!\n\n          \n          They look up and, with a desperate look, Mel BREATHES on\n          the inside mirror-glass to fog it. She writes H E L P U\n          S. ­ her fingertip squeaking on the glass like a SMALL,\n          SAD BIRD. Frost RISES UP, hiding the letters and then her\n          parents. The image fades.\n\n          \n          Coraline STRIKES AT THE MIRROR as hard as she can. GLASS\n          SHATTERS and she drops to the ground, shaking. The cat\n          nuzzles her..\n\n          \n\n                                 CORALINE (CONT'D)\n                    How did this happen?\n\n          \n\n          \n\n          INT. PARENT'S BEDROOM - SAME\n\n\n          \n          From under the bed, the cat drags out the BUTTON-EYED\n          DOLL, REMADE into HER MOTHER on one side, and HER FATHER\n          on the other!\n\n          \n\n                                 CORALINE\n                    She's taken them.\n\n          \n          Coraline, enraged, THROWS the doll. FIRE LIGHT comes up\n          on her face as the background DISSOLVES TO:\n\n          \n\n          \n\n          INT. LIVING ROOM, FRONT OF FIREPLACE - SAME\n\n\n          \n          CLOSE ON DOLL: BURNING in the FIREPLACE.\n\n          \n          Coraline and cat watch until the fire burns out. She\n          takes a breath and looks up at the mantel.\n\n          \n          ANGLE ON snowglobe, the one of the FOUNTAIN BEARS from\n          the Detroit Zoo. Coraline cradles it, remembering.\n\n          \n\n                                 CORALINE\n                    They're not coming back, are they ­ Mom\n                    and Dad. Not on their own.\n\n          \n          The cat blinks. She looks over at the locked little door\n          in the corner wall.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Only one thing to do.\n\n          \n\n                                                              CUT TO:\n\n          \n\n          \n\n          INT CORALINE'S BEDROOM   - CONTINUOUS\n\n          \n          Series of quick shots of Coraline getting ready to go.\n          Pulls her collecting bag from the closet, her puffy vest,\n          her boots; grabs a candle and garden shears, puts them in\n          the bag. She stands to go, taking her cap off the chair.\n          The ODD PIECE OF CANDY, the triangle green one with the\n          hole, drops to the floor. She hesitates a moment, then\n          sticks it in her bag.\n\n          \n\n          \n\n          INT. PASSAGEWAY - CONTINUOUS\n\n\n          \n          We hear the click of the door being unlocked. It opens to\n          reveal the cat, and - holding a lit candle - Coraline.\n          She leaves the key in the lock, like always, takes a\n          breath and crawls forward.\n\n          \n          The candle casts huge, flickering shadows along the wall.\n          The cat, his voice returned, SPEAKS to her.\n\n          \n\n                                 CAT\n                    You know, you're walking right into her\n                    trap.\n\n          \n\n                                 CORALINE\n                    I have to go back.\n\n          \n          With great feeling, she explains:\n\n          \n\n                                 CORALINE (CONT'D)\n                    They are my parents.\n\n          \n\n                                 CAT\n                    Challenge her then. She may not play\n                    fair but she won't refuse. She's got a\n                    thing for games.\n\n          \n          Coraline thinks about it, remembering.\n\n          \n\n                                   CORALINE\n                    Hmmm, okay.\n\n          \n          The door at the end of the tunnel clicks open, the candle\n          BLOWS OUT and the cat VANISHES IN THE DARK. Coraline\n          tenses when a voice calls out.\n\n          \n\n                                   MOTHER\n                    Coraline?\n\n          \n\n                                   CORALINE\n                    Mom?\n\n          \n          There, framed in the open door, back-lit in blue,\n          Coraline's REAL MOTHER, with neck brace and dressed in\n          her shopping clothes, calls.\n\n          \n\n                                 MOTHER\n                    Coraline, you came back for us!\n\n          \n\n                                   CORALINE\n\n                             (RELIEVED)\n\n                    MOM!\n\n          \n          She runs forward eagerly and--\n\n          \n\n          \n\n          INT. OTHER LIVING ROOM - NIGHT\n\n\n          \n          --out the Other Little Door, throwing her arms out to hug\n          her real Mom.\n\n          \n\n                                 MOTHER\n                    Darling!\n                           (voice shifting)\n                    Why would you run away from me?\n\n          \n          Coraline sees her mother's hand GROW as it wraps around\n          her. Alarmed, she PUSHES AWAY and sees the DECOY MOM grow\n          into the TALL OTHER MOTHER.\n\n          \n          The room LIGHTS UP with the glowing bug furniture and a\n          fireplace fire.\n\n          \n          Coraline tries her best to be brave.\n\n          \n\n                                 CORALINE\n                    Where are my parents?\n\n          \n          The Tall Other Mother's button eyes GLITTER.\n\n          \n\n                                 TALL OTHER MOTHER\n                    Gosh, I have no idea where your \"old\"\n                    parents are. Perhaps they've grown bored\n                    of you and run away to France?\n\n          \n          Her teeth gleam.\n\n          \n\n                                 CORALINE\n                    They weren't bored of me.   You stole\n                    them!\n\n          \n          Other Father, a FOOT SHORTER than before, his sagging\n          face a pale PUMPKIN color, his hair VINES, comes up\n          behind Coraline.\n\n          \n\n                                 TALL OTHER MOTHER\n                    Now, don't be difficult, Coraline. Have a\n                    seat, won't you?\n\n          \n          Other Father, GURGLING happily, herds Coraline onto the\n          walking bug chair.\n\n          \n          The Tall Other Mother, standing by the little door, turns\n          to it and CLAPS her hands.\n\n          \n          A moment later, a HUGE RAT skitters out of the tunnel -\n          FILLED AGAIN with spider webs and children's things -\n          carrying the KEY from the real world door.\n\n          \n          The Tall Other Mother takes the key, locks the door, and -\n          while the armoire bug assumes guard position - she\n\n          SWALLOWS THE KEY.\n\n          \n\n                                 CORALINE\n\n                           (OFFHAND)\n                    Why don't you have your own key?\n\n          \n\n                                 OTHER FATHER\n                    Only one key.\n\n          \n          The Other Mother PULLS A VINE growing from his ear,\n\n          SHUTTING HIS MOUTH.\n\n          \n\n                                 TALL OTHER MOTHER\n                    Shhh!\n\n                           (SUNNIER)\n                    The garden squash need tending, don't you\n                    think, pumpkin?\n\n          \n          She turns him around, her hands under his arms and drags\n          him out.\n\n          \n\n                                 OTHER FATHER\n                    Squish squash, pumpkin sauce...\n\n          \n          After a beat, Coraline hears the very faint SOUND OF A\n          FINGER ON GLASS, just like when her mother wrote HELP on\n          the mirror. Coraline jumps to her feet, looking around\n          the room for a sign of her real parents.\n\n          \n\n                                 CORALINE\n                           (loud whisper)\n                    Mom, Dad, where'd she hide you?\n\n          \n          A muffled screen door slams O.S. and the Tall Other\n          Mother calls to her from the kitchen.\n\n          \n\n                                 TALL OTHER MOTHER (O.S.)\n                    Breakfast-time!\n\n          \n          Coraline leaves frame.\n\n          \n\n          \n\n          INT. OTHER KITCHEN - NIGHT\n\n\n          \n          Coraline pauses in the doorway.\n\n          \n\n                                 CORALINE (V.O.)\n                           (to herself)\n                    Be strong, Coraline.\n\n          \n          She sits at the kitchen table in her regular place, her\n          back to the sink.\n\n          \n          Tall Other Mother, humming happily, prepares a mushroom\n          omelet and bacon. Fragrant cinnamon buns bake in the\n          oven.\n\n          \n          At the table's center, Coraline sees the box with her\n          BUTTON EYES with needle and thread. A bead of sweat rolls\n          down her forehead. As casually as she can, she asks:\n\n          \n\n                                 CORALINE (CONT'D)\n                           (anxious, trying to be cool)\n                    Why don't we play ... a game? I know you\n                    like them.\n\n          \n          The Tall Other Mother's button eyes FLASH.\n\n          \n\n                                 TALL OTHER MOTHER\n                    Everybody likes games.\n\n          \n\n                                    CORALINE\n\n                           (NODS)\n                    Uh huh.\n\n          \n          Bacon sizzles and spits on the stove.\n\n          \n\n                                 TALL OTHER MOTHER\n                    What kind of game would it be?\n\n          \n\n                                 CORALINE)\n                    An exploring game ... a finding things\n                    game.\n\n          \n          Other Mother tries to act disinterested, but her fingers\n          drum with excitement.\n\n          \n\n                                 OTHER MOTHER\n                    And what is it you'd be finding,\n                    Coraline?\n\n          \n          Coraline hesitates.\n\n          \n\n                                 CORALINE\n                    My real parents.\n\n          \n\n                                 TALL OTHER MOTHER\n\n                           (DISMISSIVE)\n                    Too easy.\n\n          \n          She folds the omelet over in the pan.\n\n          \n\n                                 CORALINE\n                    And, and the eyes of the ghost children.\n\n          \n          Tall Other Mother smiles: now it's getting interesting.\n\n          \n\n                                 TALL OTHER MOTHER\n                    Huh.\n\n          \n          The meal ready, she turns from the stove and takes the\n          food to Coraline.\n\n          \n\n                                 TALL OTHER MOTHER (CONT'D)\n                    What if you don't find them?\n\n          \n\n                                 CORALINE\n                    If I lose, I'll stay here with you\n                    forever and let you love me.\n                           (indicates button box)\n                    And I'll let you sew buttons into my\n                    eyes.\n\n          \n\n                                 TALL OTHER MOTHER\n                    Hmmm... And if you somehow win this game?\n\n          \n\n                                 CORALINE\n                    Then you let me go. You let everyone go ­\n                    my real father and mother, the dead\n                    children, everyone you've trapped here.\n\n          \n          The Tall Other Mother smiles a malicious not in a million\n          years smile.\n\n          \n\n                                 TALL OTHER MOTHER\n                    Deal.\n\n          \n          She holds out her hand. Coraline doesn't reach.\n\n          \n\n                                 CORALINE\n                    Not till you give me a clue.\n\n          \n          Tall Other Mother snorts, her smile sours. She slowly\n          circles Coraline, and speaks as if talking to a very\n          stupid child.\n\n          \n\n                                 TALL OTHER MOTHER\n                    Oh, right... In each of three wonders\n                    I've made just for you, a ghost's eye is\n                    lost in plain sight.\n\n          \n\n                                 CORALINE\n                    And for my parents?\n\n          \n          Tall Other Mother - standing behind her in front of the\n          sink - smiles wickedly and just starts TAPPING HER BUTTON\n          EYE with her finger nail. Coraline turns away from her.\n\n          \n\n                                 CORALINE (CONT'D)\n\n                           (SHRUGS)\n                    Fine. Don't tell me...\n\n          \n          Extending her hand, Coraline starts to turn back.\n\n          \n\n                                 CORALINE (CONT'D)\n                    ...it's a deal--\n\n          \n          But the Tall Other Mother HAS DISAPPEARED and the tapping\n          now is the FAUCET DRIPPING in the sink.\n\n          \n          Coraline EXHALES, walks to the sink, stares at the\n          dripping faucet.\n\n          \n\n                                 CORALINE (CONT'D)\n                    What does she mean \"wonders?\"\n\n          \n          Out the kitchen window, the FANTASTIC GARDEN LIGHTS UP,\n          answering her question. She FURROWS HER BROWS, thinks\n          this was too easy.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Hmmm.\n\n          \n\n                                                               CUT TO:\n\n          \n\n          \n\n          EXT. OTHER GARDEN - SAME\n\n\n          \n          Coraline walks through the gates. The bright magic of the\n          garden is DARKER NOW, with areas of black against areas\n          of glowing flowers.\n\n          \n          She passes the PITCHER PLANTS, and the one with the frog\n          suddenly SWALLOWS the animal.\n\n          \n          She goes up the steps past the BLEEDING HEARTS, which now\n          LEAK STICKY RED JUICE that runs down the wall.\n\n          \n          At the top, a few SNAPDRAGONS, feeble now, SNAP at her.\n          She KICKS them down. Behind her, a brick tree ring OPENS\n          like a monster's MOUTH and five HUGE, PALE SNAPDRAGONS\n          sneak towards her. They ATTACK, knock her to the ground,\n          spilling her bag.\n\n          \n\n                                 CORALINE\n                    No!!\n\n          \n          They GRAB CORALINE at her ankles, knees, hips, waist, and\n          shoulder, and start to ROLL HER UP TOWARDS THE STONE\n\n          MOUTH.\n\n          \n          Coraline is just able to GRAB her GARDEN SHEARS. She CUTS\n          OFF one mutant snapdragon's head, then another, until she\n          is free. The HEADLESS STEMS retreat into the rock mouth.\n\n          \n          Coraline, winded, goes to gather her spilled things when\n          a trio of HUMMINGBIRDS/WASP HYBRIDS SWOOP IN. They don't\n          attack her; instead they poke their long beaks into the\n          TRIANGLE CANDY WITH THE HOLE and LIFT OFF.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Stop!!\n\n          \n          Coraline chases them, but they're getting away. As she\n          crosses the little bridge, she takes off her cap and\n          FLINGS IT LIKE A FRISBEE at them. SCORE! They fall to the\n          ground, near the eyebrow shrubs, sawdust spilling out.\n          She picks up the triangle candy.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Why steal this?\n\n          \n          With a look of what does she have to lose, she holds it\n          up to her eye and GASPS.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Wow...\n\n          \n          EVERYTHING IS BLURRY GREY like a pencil drawing, all\n          color gone. She scans the garden, turning slowly. As she\n          turns back to where she started, she sees something,\n          right in front of her: a BURNING RED EMBER -- A GHOST'S\n\n          EYE!\n\n          \n\n                                 CORALINE (CONT'D)\n                    That must be it.\n\n          \n          She lowers the stone from her eye, to see that the\n          ghost's eye is the FADED STICK SHIFT KNOB from the\n          preying mantis tractor, which STANDS RIGHT IN FRONT OF\n          HER with the Other Father, a SQUAT PUMPKIN MAN, at its\n          controls, his own hands IMPRISONED IN THE MECHANICAL\n\n          PIANO HANDS.\n\n          \n          HEADLIGHTS GLARE and the tractor ROARS TO LIFE. The\n          mechanical hands FORCE Other Father to SHIFT GEARS, and\n          the tractor LURCHES at Coraline, its arms SLASHING. She\n          yells, backs away. Other Father calls in a garbled voice:\n\n          \n\n                                 OTHER FATHER\n                    Sorrry, so sorrry, Motherrr making meeee.\n\n          \n          Coraline backs onto the little bridge that spans the\n          fountains as the tractor moves in.\n\n          \n\n                                 OTHER FATHER (CONT'D)\n                    Don't waaaanno hurrrrrt you.\n\n          \n          The Other Father tries to steer the tractor away, but the\n          mechanical hands are stronger. It moves onto the bridge -\n          STUPIDLY SMASHING THROUGH THE PLANKS in front of it.\n          Halfway over, it lurches, then STARTS TO FALL THROUGH THE\n          HOLE IT HAS CREATED. The tractor hangs precariously for a\n          moment.\n\n          \n          Other Father KICKS away one mechanical hand, and with ONE\n          HAND FREE, manages to PULL OFF THE SHIFT KNOB.\n\n          \n\n                                 OTHER FATHER (CONT'D)\n                    Taaaake it!!!!!\n\n          \n          Coraline DIVES FORWARD and just GETS THE KNOB before the\n          tractor and Other Father fall away and SINK UNDER THE\n\n          WATER.\n\n          \n          Rippling out from Coraline like a gray wave, the entire\n\n          GARDEN BECOMES ASHEN AND DEAD.\n\n          \n          Coraline CATCHES HER BREATH, shaken. The ghost eye/gear\n          knob GLOWS RED, no magic candy necessary.\n\n          \n\n                                 BOY GHOST\n                    Bless you, miss, you found me! But\n                    there's two eyes still lost.\n\n          \n\n                                 CORALINE\n                    Don't worry, I'm getting the hang of it!\n\n          \n          Coraline looks past the greyed garden towards the Other\n          House. A LUNAR ECLIPSE has begun, the full moon a pale\n          acid green.\n\n          \n          Coraline looks concerned, then resolved, and then she\n          heads towards the house. A haunting version of Spink and\n          Forcible's show song starts to play...\n\n          \n\n          \n\n          EXT. OTHER HOUSE, STAIRWAY TO SPINK AND FORCIBLE'S - SAME\n\n\n          \n          CORALINE'S POV DOWN STAIRWAY: chaser lights circle the\n          door at half-speed. Haunting show song continues.\n\n          \n          REVERSE ON Coraline. She carefully descends towards CAM.\n\n          \n\n          \n\n          INT DOWNSTAIRS THEATRE - SAME\n\n          \n          WE SEE her flickering shadow and then Coraline appears\n          behind the entry curtains. She steps close, pulls the\n          curtain open. Song stops.\n\n          \n          POV ON THEATER, quiet and dark save for light coming\n          through entry curtains. She spots usher's FLASHLIGHT on\n          the ground.\n\n          \n          ON CORALINE - she picks it up, clicks it on, and STEPS\n          FORWARD. She sweeps the light beam around, apprehensive,\n          then HEARS SOMETHING overhead. She aims flashlight up and\n          startles a NEST OF BAT-DOGS - half Scotties/half bats.\n          One bares his teeth and GROWLS. She clicks off the light\n          and shivers.\n\n          \n          On stage, one spotlight and footlights FADE UP on a huge,\n          wrapped SALTWATER TAFFY. It hangs from ropes and\n          sandbags.\n\n          \n          She cautiously climbs up onto the stage. A HUMAN-SIZED\n          TAFFY THING - striped pale pink and green - can just be\n          seen through the wrapper. She holds her TRIANGLE CANDY-\n          WITH-HOLE to her eye. There is a BLUE-WHITE GLOW coming\n          from inside the wrapper.\n\n          \n          Coraline PUNCHES A HOLE through the paper, steels\n          herself, then reaches inside. She touches something\n          sticky and cold and inhuman. Clenching her teeth, she\n          grabs hold and pulls out two clasped-together COLD, TAFFY\n          HANDS - Young Spink and Forcible's.\n\n          \n          Her heart thumps. She PRIES the TAFFY HANDS open like\n          scallop shells until a large PEARL-on-a-ring is revealed.\n\n          \n\n                                 CORALINE\n\n                           (REALIZING)\n                    The pearl!\n\n          \n          The hands suddenly GRAB HER! She SCREAMS. Young Spink and\n          Forcible, twisted together into one taffy monster, THRUST\n\n          THEIR HEADS FROM THE BAG!\n\n          \n\n                                 TAFFY MONSTER\n                    Thief!! Give it back!\n\n          \n          Coraline PULLS AWAY, STRETCHING the candy arm out across\n          the stage! The taffy monster THRUSTS OUT another paired\n          arm, and starts DRAGGING ITSELF TOWARDS CORALINE, ropes\n          swaying on pulleys.\n\n          \n\n                                 TAFFY MONSTER (CONT'D)\n                           (in unison)\n                    You thief! Thief! Thief! Thief! Give it\n                    back! Thief! Give it back! Give it back!\n                    Thief! Stop thief! Thief! Stop!\n\n          \n          Coraline, desperate, gets an idea. She clicks on her\n          flashlight and aims it at the BAT-DOGS. They GROWL with\n          annoyance, OPEN their wings.\n\n          \n          The taffy monster is GETTING CLOSER! Coraline hurls the\n          flashlight at the bat-dogs and HITS THEM. Angered, they\n          TAKE WING TO ATTACK HER - just like she planned!\n\n          \n          Bat-dogs are closing on the left, the taffy monster on\n          the right! She waits to the very last second, and then\n\n          DIVES OUT OF THE WAY!\n\n          \n          BAT-DOGS AND TAFFY MONSTER COLLIDE! Coraline's hand is\n          released by the taffy hands, leaving her the PEARL. The\n          bat-dogs and taffy monster - stuck together and still-as-\n          stone - turn to dead, grey ash, as does the stage and\n          theater.\n\n          \n          The PEARL in Coraline's hand PULSES BLUE.\n\n          \n\n                                 TALL GIRL GHOST (V.O.)\n                    Hurry on, girl - her web is unwinding!\n\n          \n          Coraline nods, sticks the pearl in her bag, and looks up\n          towards the ceiling and beyond.\n\n          \n\n          \n\n          EXT. OTHER HOUSE/OTHER BOBINSKY'S BALCONY - SAME\n\n\n          \n          CORALINE'S MOVING POV, on lower ext stairs to UP ANGLE ON\n          BALCONY. We hear haunting circus music in the air.\n\n          \n          Other Mr. B's Russian flag, TORN in places, waves in the\n          air. The pale green moon is nearly HALF-ECLIPSED now with\n          what is clearly the SHADOW OF A HUGE, DARK, BUTTON.\n\n          \n          ANGLE ON CORALINE as she climbs the last flight of stairs\n          to Bobinsky's. She stops with a SHUDDER at the top. The\n          flag has been replaced with the EMPTY COAT OF OTHER WYBIE-\n          gloves, pants and sneakers pinned on - hanging like old\n          laundry.\n\n          \n\n                                   CORALINE\n                    Oh, Wybie...\n\n          \n          She takes a breath, leans out over the railing and\n          shouts.\n\n          \n\n                                 CORALINE (CONT'D)\n\n                    EVIL WITCH ... I'M NOT SCARED!\n\n          \n          The door behind her CREAKS open. Coraline shivers - she\n          is definitely scared.\n\n          \n\n          \n\n          INT. OTHER MR. B'S ATTIC FLAT - CONTINUOUS\n\n\n          \n          Coraline steps into the apartment and carefully shuts the\n          door. The cannons and Ferris wheel are dark and quiet;\n          the circus tent glows dimly. Pale green moonlight shines\n          in patches through holes in the roof. The corners and\n          edges of the room are very dark.\n\n          \n          OTHER BOBINSKY suddenly CRAWLS by the door behind her.\n          Coraline whips around, on guard. He LOOMS UP past the\n          cannons on her right, leaning towards her.\n\n          \n\n                                 OTHER MR. BOBINSKY\n                    Hello, ga-LOO-boo-shka.\n\n          \n          There are too many joints in his arms and legs.\n\n          \n\n                                 CORALINE\n                    I'm Coraline.\n\n          \n          His tall, crooked hat is pulled so low, and his collar so\n          high, that his face is completely hidden.\n\n          \n          He throws out his arm towards her and the CIRCUS BALL\n          from the mouse circus rolls from his sleeve to his hand.\n\n          \n\n                                 OTHER MR. BOBINSKY\n                    Is dis vhat you're looking for?\n\n          \n          She looks through the hole of the triangle candy and sees\n          an AMBER GLOW ­ the THIRD GHOST'S EYE!\n\n          \n\n                                   CORALINE\n                    Uh-huh.\n\n          \n          She grabs for it, but he's too quick. He back-bends to\n          all fours and SCUTTLES around her towards the back\n          shadows.\n\n          \n\n                                 OTHER MR. BOBINSKY\n                    You tink vinning game is goot ting?\n\n          \n          Coraline holds up the triangle candy, scans the room for\n          him. His voice sounds distorted now.\n\n          \n\n                                 OTHER MR. BOBINSKY (O.S.)\n\n                                 (CONT'D)\n                    You'll just go home and be bored and\n                    neglected...\n\n          \n          WE SEE him twine up a post behind Coraline, crawl out on\n          a beam...\n\n          \n\n                                 OTHER MR. BOBINSKY\n\n                                 (CONT'D)\n                    ...same as alvays.\n\n          \n          He SWINGS UPSIDE-DOWN from his ankles, his head stopping\n          right by Coraline's. She whips around, alarmed.\n\n          \n\n                                 OTHER MR. BOBINSKY\n\n                                 (CONT'D)\n                    Stay here vis us; vee vill listen to you\n                    and laugh vis you.\n\n          \n          He DROPS to the floor on his head, then SLITHERS into the\n          circus tent. Coraline does not want to follow him. But\n          she does.\n\n          \n\n          \n\n          INT. CIRCUS TENT - CONTINUOUS\n\n\n          \n          The Other Mr. B is perched on a pile of MOLDY CHEESES in\n          the center of the ring. He moves like all his bones are\n          broken.\n\n          \n\n                                 OTHER MR. BOBINSKY\n                    If you stay here, you can have vhatever\n                    you vant, vsig-DA - alvays.\n\n          \n          Coraline raises the triangle candy to her eye, sees the\n          AMBER GLOW coming from inside his hat.\n\n          \n\n                                 CORALINE\n                    You don't get it, do you?\n\n          \n          She moves closer.\n\n          \n\n                                 OTHER MR. BOBINSKY\n                    I don't understand.\n\n          \n          Small forms MOVE under the back of his coat.\n\n          \n\n                                 CORALINE\n                    Of course you don't understand. You're\n                    just a copy she made of the real Mr. B.\n\n          \n\n                                 OTHER MR. BOBINSKY\n                           (last breath)\n                    Not even that anymore.\n\n          \n          Coraline pulls off his hat. Instead of his head, a HUGE\n          PALE RAT SITS THERE - holding the circus ball. It barks\n          at her then DIVES DOWN the coat collar.\n\n          \n          RATS leap from COAT SLEEVES and PANT LEGS, Coraline pulls\n          back, HORRIFIED, as the clothes collapse, scanning around\n          for the circus ball.\n\n          \n          There's a rat bark behind her and she turns. The HUGE RAT\n          - balanced on a wheel of cheese, circus ball in paws -\n          TAUNTS HER, then RUNS THE CHEESE OUT THE DOOR! She GIVES\n\n          CHASE.\n\n          \n\n          \n\n          INT. OTHER MR. B'S FLAT - CONTINUOUS\n\n\n          \n          The OTHER RATS RACE behind the twin rows of cannons - the\n          cheese wheel rat rolls through them, heading towards the\n          door!\n\n          \n          Coraline CHARGES. The cannons, manned by rats, FIRE\n          COTTON CANDY at her. She's HIT in the side, her leg, her\n          ribs; she weaves and STUMBLES, the shots landing like\n          punches.\n\n          \n\n                                 CORALINE\n                    Ahhh! No!!\n\n          \n          A PET DOOR - perfectly shaped for the rat on the wheel -\n          appears in the front door as the rat approaches.\n\n          \n          Coraline looks up to see the PET DOOR OPEN and the CHEESE-\n\n          WHEEL RAT HEADING THROUGH IT TO THE OUTSIDE.\n\n          \n          Coraline takes her triangle candy stone and THROWS IT as\n          hard as she can AT THE RAT.\n\n          \n          The whistling candy FLIES through the pet door towards\n          the RAT, just outside.\n\n          \n\n          EXT. OTHER MR. B'S FLAT - CONTINUOUS\n\n\n          \n          The RAT DUCKS, the CANDY MISSES, and the cheese-wheel rat\n          ESCAPES down the stairs with the ball.\n\n          \n\n          INT. OTHER MR. B'S FLAT - CONTINUOUS\n\n\n          \n          Coraline, lurching forward, HOLLERS.\n\n          \n\n                                 CORALINE (CONT'D)\n\n                    NOOOO!\n\n          \n          Two waiting rats - tail tips tied - pull tails tight, and\n          TRIP her. She CRASHES THROUGH THE DOOR AND--.\n\n          \n\n          \n\n          EXT. OTHER HOUSE - CONTINUOUS\n\n\n          \n          --OUT onto the balcony which TEARS AWAY FROM THE HOUSE\n          with ATTACHED STAIRWAY.\n\n          \n\n                                 CORALINE\n                    Noooo!\n\n          \n          The whole rig, with Coraline on top, ROTATES as it\n          collapses, THROWING CORALINE toward the front of the\n          house when it HITS THE GROUND. She BLACKS OUT a moment.\n\n          \n          WHEEZING for breath, Coraline pushes up on hands and\n          knees and SCANS past the topiaries and poplars and white\n          gravel driveway, looking for the cheese-wheel rat and\n          circus ball. No cheese-wheel rat, no circus ball ghost\n          eye.\n\n          \n          Coraline, lit by a NARROWING BAND of pale green light,\n          turns to look at the moon. It's nearly covered now by the\n\n          DARK BUTTON SHADOW.\n\n          \n          Her HAND stings from a scrape. BLOOD trickles from her\n          knee. She feels nothing but COLD LOSS.\n\n          \n\n                                 CORALINE (CONT'D)\n\n                           (DEVASTATED)\n                    Oh God, I've lost the game; I've lost\n                    everything.\n\n          \n          She sobs, hugs knees and face to chest. The band of light\n          that illuminates her is narrowing to near-gone.\n\n          \n          In the foreground, the HEAD of the cheese-wheel rat -\n          CIRCUS BALL IN ITS TEETH - DROPS ON THE GROUND. Sawdust\n          leaks from its neck. Band of light STOPS NARROWING, the\n          eclipse paused.\n\n          \n          There's a familiar MEROWWW and Coraline looks up.\n\n          \n          Across from her on the front yard, sits the BLACK CAT,\n          licking his paws, rat's head and circus ball at his feet.\n\n          \n\n                                 CAT\n                    I think I mentioned that I don't like\n                    rats at the best of times.\n\n          \n          Coraline smiles, walks towards him.\n\n          \n\n                                 CORALINE\n                    I think you might have said something\n                    like that.\n\n          \n\n                                 CAT\n                    It looked like you needed this one,\n                    however.\n\n          \n          He bats the circus ball and it rolls to Coraline.\n\n          \n          She picks it up , sticks it in her bag. Around her, the\n\n          YARD, HOUSE, TREES, SHRUBS AND DRIVEWAY TURN ASHEN GRAY.\n\n          \n\n                                 CORALINE\n                    Thank you.\n\n          \n          Looks towards house.\n\n          \n\n                                 CORALINE (CONT'D)\n                    I'm heading inside. I still have to find\n                    my parents.\n\n          \n\n                                                              CUT TO:\n\n          \n          ANGLE ON MOON. The stalled eclipse STARTS AGAIN, and in\n          one beat, the last sliver of green moon is FULLY BLACKED\n          OUT. The EDGES of the button shadow start to FLAKE AWAY.\n\n          \n          ON CORALINE WITH CAT. A strange insect thrumming has\n          begun. What appear to be grey paint chips or bits of\n          paper are falling. Confused, she looks up to see:.\n\n          \n          The huge button shadow is EATEN TO NOTHING and then the\n          SKY around it IS EATEN AS WELL, revealing dirty white\n          light. The destruction TRAVELS from sky to the distant\n          hills, the sound of a million, invisible locusts growing\n          louder.\n\n          \n          UP ANGLE ON CAT AND CORALINE. The cat hisses. Deeply\n          alarmed, they look from one direction to another.\n\n          \n          POV out front yard. The destruction TRAVELS up the\n          driveway, PULLS APART the poplars, and then UNRAVELS the\n          topiary elephant and bird.\n\n          \n          DOWN ANGLE ON Coraline and cat, his TAIL TWITCHING. WE\n          PULL BACK to find they are at the center of a RAPIDLY\n\n          SHRINKING ISLAND!\n\n          \n          NEW ANGLE on Coraline and cat as ground beneath their\n          feet STARTS CRACKING, white light coming through. Cat\n          makes a fearful sound, afraid for the first time in the\n          movie!\n\n          \n          Coraline holds out her arms to the trembling animal, her\n          guardian angel.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Come on, quickly!\n\n          \n          The cat LEAPS and she catches him, then CARRIES HIM up\n          the DISINTEGRATING porch steps to the front door. She\n          gets through just in time, and SLAMS it shut!\n\n          \n\n          \n\n          INT. OTHER HOUSE HALLWAY - SAME\n\n\n          \n          It's dark and stable in here, with just some creaks and\n          intermittent vibrations. A poisonous green light spills\n          from the other living room.\n\n          \n          Coraline goes there, carrying the cat over her shoulder,\n          past wallpaper that PEELS UP as she passes, to the room\n          where she last heard the sound of her mother's finger on\n          glass.\n\n          \n\n          \n\n          INT. OTHER LIVING ROOM - SAME\n\n\n          \n          A poisonous GREEN FIRE - LIKE SLEEPY SEA SNAKES - BURNS\n          in the fireplace. The bug furniture looks grey now, their\n          lights flickering as if short-circuited; legs and wings\n          twitching uncontrollably.\n\n          \n          Coraline scans the walls, the ceiling, looking for a sign\n          of her parents.\n\n          \n          ANGLE ON CORALINE in foreground. She senses the Other\n          Mother behind her, a creature who is no sort of Mother at\n          all but a witch, a Beldam. She turns.\n\n          \n          The Beldam is hunched on the sofa - her face hidden.\n\n          \n\n                                 BELDAM\n                    So, you're back....\n\n          \n          Her voice sounds dry and tired. She turns her face\n          towards Coraline. It is a WHITE DEATH MASK, cracked and\n          peeling - her true face.\n\n          \n\n                                 BELDAM (CONT'D)\n                    And you brought vermin with you.\n\n          \n          Coraline shudders and steps back. The cat makes a fearful\n          sound and digs his claws into her shoulder.\n\n          \n\n                                 CORALINE\n                    No, I ... I brought a friend.\n\n          \n          The Beldam rises up 12 FEET TALL. She is WITHERED to the\n          bone; with plate-like shoulders and hips; her bustle now\n          an arachnid's tail section. Her true form.\n\n          \n          She reaches her long, sharp FINGERS MADE OF NEEDLES to\n          Coraline's face.\n\n          \n\n                                 BELDAM\n\n                           (FLATLY)\n                    You know I love you.\n\n          \n          Coraline works hard to not show how freaked out she is.\n\n          \n\n                                 CORALINE\n                    You, you have a very funny way of showing\n                    it.\n\n          \n          The Beldam smiles, turns away, then back, her hand\n          outstretched.\n\n          \n\n                                    BELDAM\n                    So?     Where are they - the ghost eyes?\n\n          \n          Coraline pulls out the three spheres from her bag and\n          starts to hand them over. But she catches herself.\n\n          \n\n                                   CORALINE\n                    Hold on.\n\n          \n          And pulls back.\n\n          \n\n                                 CORALINE (CONT'D)\n                    We aren't finished yet, are we?\n\n          \n          The Beldam looks daggers, then smiles sweetly.\n\n          \n\n                                 BELDAM\n                    No, I suppose not. After all, you still\n                    need to find your old parents, don't you?\n                    Too bad you won't have this.\n\n          \n          She produces the TRIANGLE CANDY that Coraline lost and\n          FLINGS it into the green fire. The Beldam laughs while\n          the MAGIC BURNS out of the candy with sparks and pops.\n\n          \n          ON CORALINE. The third ghost eye PULSES WITH AMBER LIGHT\n          in her hand. Coraline turns away, so the witch won't see.\n\n          \n\n                                 SWEET GIRL GHOST (O.S.)\n                    Be clever, miss; even if you win she'll\n                    never let you go!\n\n          \n          Coraline looks towards the locked little door behind the\n          armoire bug and understands: she's got to get the Beldam\n          to unlock it! She furrows her brow as an idea comes to\n          her then nods.\n\n          \n          She turns to the witch and in the most confident tone she\n          can muster, says:\n\n          \n\n                                 CORALINE\n                    I already know where you've hidden them.\n\n          \n          The Beldam turns from the fire, both concerned and\n          sceptical.\n\n          \n\n                                 BELDAM\n                    Well... produce them.\n\n          \n          Coraline points to the little door.\n\n          \n\n                                 CORALINE\n                    They're behind that door.\n\n          \n          The Beldam leans close, knowing Coraline is wrong, and\n          speaks very quietly.\n\n          \n\n                                 BELDAM\n                    Oh, they are, are they?\n\n          \n          A smile creeps onto her terrible face. And she STARTS\n          TOWARDS THE LITTLE DOOR, moving in an odd, laboring way,\n          as if she had four legs instead of two. She signals the\n          armoire bug to stand aside, her back to Coraline.\n\n          \n          Coraline hears the soft chirp of her mother's finger on\n          wet glass! Looks around, desperate - where is it coming\n          from?!\n\n          \n          The cat's ears twitch and focus, and then he SEES\n          SOMETHING on the mantel!. He whispers to Coraline --\n\n          \n\n                                 CAT\n                    There!\n\n          \n          -- and JUMPS to land beside the DETROIT ZOO SNOW-GLOBE -\n\n          OPAQUE WITH FROST.\n\n          \n          C.U. ON SNOW-GLOBE. With a SOFT-CHIRP, a section of glass\n          is WIPED CLEAR from inside by a TINY FOREARM - and we see\n          the tiny, cold figures that are CORALINE'S TRAPPED\n          PARENTS! Coraline's heart races. She purposely stays back\n          from them.\n\n          \n\n                                  CORALINE\n\n                            (WHISPERING)\n                    Mom.   Dad!\n\n          \n          ON BELDAM, by little door. Oblivious to Coraline's\n          discovery, she COUGHS up the KEY into her hand. She turns\n          to Coraline, expectantly.\n\n          \n\n                                  CORALINE (CONT'D)\n                    Go on.   Open it. They'll be there, all\n                    right.\n\n          \n          The Beldam stoops to push the key into the lock, turns\n          it, leaves the key in place.\n\n          \n          She grins at Coraline and speaks in a low, sing-song\n          voice.\n\n          \n\n                                 BELDAM\n                    You're wrong, Coraline!\n\n          \n          She opens the little door, revealing the empty, spider-\n          web tunnel.\n\n          \n          ON CORALINE, who glances from the open door to the cat -\n          obscured on the mantel - and back to the Beldam. She's\n          thinking very hard.\n\n          \n\n                                 BELDAM (CONT'D)\n\n                           (PITYING)\n                    They aren't there.\n\n          \n          She opens her hands: one holds box with Coraline's BLACK\n          BUTTON EYES, the other a THREADED NEEDLE. Triumphant, the\n          Beldam softly gloats:\n\n          \n\n                                 BELDAM (CONT'D)\n                    Now you're going to stay here forever.\n\n          \n          Coraline strikes a warrior's pose, and, summons all the\n          fury she can.\n\n          \n\n                                 CORALINE\n                    No ... I'm ...\n\n          \n          She GRABS THE CAT off the mantel and RAISES HIM OVER HER\n\n          HEAD.\n\n          \n\n                                  CORALINE (CONT'D)\n\n                    NOT!\n\n          \n          And she HURLS THE CAT at the Beldam. The YOWLING ANIMAL -\n          face shocked with surprise - SAILS through the air and\n          lands RIGHT ON THE ASTONISHED WITCH'S HEAD.\n\n          \n          FREAKED-OUT, the cat DIGS in his CLAWS AND BITES the\n          shrieking Beldam, who STAGGERS to one side of the little\n          door.\n\n          \n          Coraline GRABS the SNOW GLOBE with her parents inside,\n          stows it in her bag, and moves out to approach the door\n          from the other side.\n\n          \n          The Beldam FLAILS WILDLY at the cat. The cat HOWLS LIKE A\n          BANSHEE, RAISES HIS CLAWS, and - quick as you can - TWO\n\n          SHINY BLACK BUTTONS HIT THE FLOOR - THE BELDAM'S EYES!\n\n          \n          ANGLE ON CAT as he's thrown on armoire bug.\n\n          \n          ON BELDAM, hands covering her face.\n\n          \n\n                                  BELDAM\n\n                    NOOOOOOOOO!\n\n          \n          Her hands pull away to show EMPTY, FLAT SOCKETS and TORN\n\n          THREAD!\n\n          \n\n                                 BELDAM (CONT'D)\n                    You horrible cheating girl!\n\n          \n          She furiously STOMPS the floor which FLIES UP in a spiral\n          of floorboards that drive Coraline to the room's center.\n          A huge WEB TRAP LIES BENEATH THE FLOOR!\n\n          \n          The web trap STRETCHES DOWN into a FIFTY FOOT DEEP PIT.\n          There is nothing beyond but PALE NOTHINGNESS.\n\n          \n          The cat scrambles along the tops of falling furniture\n          straight to the little door and disappears into the\n          tunnel.\n\n          \n          Coraline falls the very bottom of the web.\n\n          \n          Fifty feet above, the Beldam LAUGHS MANIACALLY and LEAPS\n          DOWN like a huge, flying spider!\n\n          \n          Coraline manages to pull herself to the outside of the\n          trap JUST AS THE BELDAM LANDS.\n\n          \n          The witch - furious her prey has escaped - spins around,\n          grasping blindly.\n\n          \n\n                                 BELDAM (CONT'D)\n                    Noo!! Where are you? You selfish brat!!\n\n          \n          Coraline, nearing the top, looks up and spots the LITTLE\n          DOOR, still in the corner wall of the Other Living Room.\n          She goes to climb back inside the web, when her bag GETS\n          CAUGHT on a barb. She pulls and pulls until it breaks\n          free, sending a STRONG VIBRATION DOWN THE SPIRALING WEB\n\n          TO THE VERY SENSITIVE HAND OF THE BELDAM.\n\n          \n\n                                  BELDAM (CONT'D)\n                    Hahahaha...\n\n          \n          The Beldam smiles - she knows where her prey is now!\n\n          \n          Coraline makes it to the little door, but the BELDAM IS\n\n          COMING UP BEHIND HER VERY FAST!\n\n          \n\n                                 BELDAM (O.S.) (CONT'D)\n\n                    YOU ... DARE ...\n\n          \n\n          \n\n          INT. PASSAGEWAY - CONTINUOUS\n\n\n          \n          Coraline SCRAMBLES through the door, KEY IN HAND, and\n          grabs the door's handle. Before she can shut it, the\n\n          BELDAM'S HEAD THRUSTS INSIDE.\n\n          \n\n                                 BELDAM\n\n                    ... DISOBEY YOUR MOTHER??!!\n\n          \n          Coraline KICKS HER IN THE FACE, knocking her back. The\n          cat takes off down the tunnel.\n\n          \n          Coraline nearly shuts the door, when NEEDLE FINGERS GRAB\n          HOLD THROUGH THE CRACK. The door STARTS TO PULL OPEN!\n\n          \n\n                                 CORALINE\n\n                    PLEASE...SHUT!!\n\n          \n          The ghost children's FLUTTERY, DISMEMBERED HANDS FLY OUT\n          FROM HER BAG and GRAB HOLD OF CORALINE'S HANDS that grip\n          the door's handle. And her STRENGTH IS QUADRUPLED.\n\n          \n          The door STARTS TO SHUT. The Beldam SNATCHES DESPERATELY\n          at Coraline, reaching through the closing gap with one\n          thin claw. There's a final moment of resistance - the\n          Beldam's wire-thin wrist caught in the door - and then\n          SNAP! The DOOR SHUTS, and the Beldam's hand drops to the\n          ground!\n\n          \n          She SCREECHES like a metal rake on pavement!\n\n          \n          Coraline just manages to lock the door in the dark when\n          it is POUNDED from the other side, green light coming\n          through cracks! She takes off down the tunnel, stooped\n          down, as fast as she can.\n\n          \n          The pounding grows more insistent, green light flashing.\n\n          \n\n                                 BELDAM (O.S.)\n\n                    DON'T LEAVE ME! DON'T LEAVE ME!!! I'LL\n\n                    DIE WITHOUT YOU!!!!\n\n          \n          And then the tunnel behind coraline STARTS TO GROW\n          SHORTER, like a collapsing accordion and the pounding far\n          door with the blind, one-handed Beldam on the other side\n\n          STARTS TO CATCH UP TO HER!\n\n          \n          Ahead, DAYLIGHT APPEARS, and then the LITTLE DOOR TO THE\n\n          REAL WORLD!\n\n          \n\n          \n\n          INT. REAL LIVING ROOM - CONTINUOUS\n\n\n          \n          Coraline FLINGS HERSELF through the doorway, SHUTS AND\n          LOCKS THE DOOR and BRACES HERSELF AGAINST IT. A split-\n          second later, the OTHER WORLD DOOR CATCHES UP WITH A\n          CRASH! Coraline is THROWN BACK. But the real-world door\n          and lock, hold. It's over...\n\n          \n          Coraline lies on her back, as beat-up and tired as she's\n          ever been, GULPING in breaths of air till her heart slows\n          a little. The room is brightly lit by sunlight, the first\n          since she moved here, and the sky out the windows is blue\n          with white clouds.\n\n          \n          She smiles, remembering, and turns to her bag with the\n          ghost eyes and snow globe with her parents inside.\n\n          \n          She opens it up, and searches, shoving aside ghost eyes\n          and garden shears. But the snow globe is GONE!\n\n          \n          She gets on all fours, starts searching the floor. Her\n          hand hits a small PUDDLE by the fireplace, with tiny\n          bits of BLUE SNOW. A drip plops down, then another. She\n          looks up to the mantel and spots the MISSING SNOW GLOBE.\n          She stands up and finds that it's BROKEN OPEN, and\n          neither her parents or the fountain bears are inside.\n\n          \n          As the last of the snowy liquid drains from the globe,\n          Coraline's face clouds with confusion and fear: What does\n          this mean and where are her parents? Then her WONDERFULLY\n          REAL MOTHER calls to her.\n\n          \n\n                                 MEL (O.S.)\n                    Coraline? We're home!\n\n          \n          Her TRUE PARENTS enter the room from the hallway, a\n          dusting of snow on their shoulders and hair.\n\n          \n\n                                 CORALINE\n                    Mom! Dad! I missed you so much!\n\n          \n          Coraline runs to her parents and throws her arms around\n          them.\n\n          \n\n                                   MEL\n                    Missed us?\n\n          \n          C.U. ON CORALINE. Huh?\n\n          \n          Mel notices the broken snow globe.\n\n          \n\n                                 MEL (CONT'D)\n                    Oh no, you broke my favorite snow globe.\n\n          \n\n                                 CORALINE\n                    I didn't break it. It must've broke when\n                    you escaped.\n\n          \n          Mom spots her bloody knee.\n\n          \n\n                                 MEL\n                    And cut your knee.\n\n          \n          Charlie crouches low, clutching his briefcase.\n\n          \n\n                                 CHARLIE\n                    Coraline, I asked you to count all the\n                    windows, not put your knee through them.\n\n          \n\n                                   CORALINE\n\n                    BUT-\n\n          \n          Mel tells her.\n\n          \n\n                                 MEL\n                    Well, get yourself cleaned up,\n\n                           (WARMS)\n                    we're going out tonight.\n\n          \n\n                                 CHARLIE\n                    We gotta lot to celebrate!\n\n          \n          Coraline, confused, takes a stab.\n\n          \n\n                                 CORALINE\n                    You're talking about... your garden\n                    catalog?\n\n          \n\n                                 MEL\n                    Of course! What else?\n\n          \n          Her parents turn to leave the room.\n\n          \n\n                                 CORALINE\n                    But look at the snow on your clothes...?\n\n          \n          But the snow melts without a trace.\n\n          \n\n                                 MEL\n\n                           (CONFUSED)\n                    What's gotten into you, Coraline?\n\n          \n          Her parents walk off. Coraline shrugs her shoulders and\n          looks back to the broken snow globe on the mantel. She\n          cocks her head, deeply puzzled, then leaves the room.\n\n          \n\n                                                          DISSOLVE TO:\n\n          \n\n          \n\n          EXT HOUSE - NIGHT, SKY CLEAR\n\n          \n          The VW is parked out front, its interior light fading as\n          light in Coraline's bedroom window switches on. We HEAR\n          Charlie make a strangled sound.\n\n          \n\n          \n\n          INT. CORALINE'S BEDROOM - NIGHT FULL MOON RISING\n\n\n          \n          Coraline sits in bed -- pajamas washed and PATCHED,\n          wounds-dressed, hair shining. The KEY hangs from a string\n          around her neck. A gibbous moon shines in the clear night\n          sky.\n\n          \n          Charlie wrestles with a blue stuffed-toy squid like it's\n          an alien face-hugger then, FEIGNING DEATH, falls on the\n          bed. Coraline LAUGHS.\n\n          \n\n                                 CORALINE\n                    So, gonna order the tulips?\n\n          \n          He opens one eye, pretends he's never heard about this.\n\n          \n\n                                   CHARLIE\n                    What's that?\n\n          \n\n                                 CORALINE\n                    For the garden party!!\n\n          \n          He sits up and kids her, tickling her face with the\n          squid.\n\n          \n\n                                 CHARLIE\n                    I have no idea what you're talking about.\n\n          \n\n                                 CORALINE\n                    Dad!\n\n          \n          She turns to Mom, arranging things on a shelf.\n\n          \n\n                                 CORALINE (CONT'D)\n                    So, Mom. Invitations? Don't forget the\n                    invitations.\n\n          \n          Her mother nods, points up.\n\n          \n\n                                 MEL\n                    Even Bobinsky?\n\n          \n\n                                 CORALINE\n                    Mr. B's not drunk, Mom, he's\n                    just...eccentric.\n\n          \n          Charlie LAUGHS. He bends down to kiss her.\n\n          \n\n                                 CHARLIE\n                    Good night, Coraline.\n\n          \n          As he steps away, Mel slips a slim box under the covers\n          next to her daughter. She gives Coraline a \"told you so\"\n          look, and she and Charlie leave the room.\n\n          \n          Coraline sits up excitedly and opens the box - it's the\n          GREEN AND ORANGE GLOVES she'd wanted! She pulls one on to\n          admire when the BLACK CAT appears outside her window\n\n          \n\n                                 CORALINE\n                    Oh, hello again.\n\n          \n          She walks over to the window, opens it.\n\n          \n\n                                 CORALINE (CONT'D)\n                    You still mad?\n\n          \n          His expression says yes, he's still mad.\n\n          \n\n                                 CORALINE (CONT'D)\n                    I'm really sorry I threw you at her - the\n                    Other Mother? ­ it was all I could think\n                    of.\n\n          \n          The cat's angry expression softens. He rests his head on\n          her hand, licking her fingers and purrs.\n\n          \n          Coraline exhales with relief then picks him up and\n          carries him over to her bed.\n\n          \n          She grabs her collecting bag and takes out the large\n          PEARL, the CIRCUS BALL, and the GREY STICKSHIFT KNOB. She\n          holds them out to the cat.\n\n          \n\n                                 CORALINE (CONT'D)\n                    I think it's time, don't you? To set them\n                    free?\n\n          \n          The cat nods. She puts the ghost eyes under her pillow\n          and gently lays down, the cat lying beside her. The two\n          of them close their eyes, and in no time at all, they\n          doze off to sleep. WE SLOWLY TILT UP.\n\n          \n\n                                             MATCH MOVE DISSOLVE TO:\n\n          \n\n          \n\n          EXT. DREAMSCAPE - MAGIC TIME\n\n\n          \n          A MAGIC ART SKY animates subtly.\n\n          \n          CAM TILT DOWN ON Coraline, studying sky, her back to us.\n          From behind CAM, CHIMES sound and GOLD LIGHT begins to\n          shine on her. She turns toward us, shielding her eyes.\n\n          \n          Coraline's eyes adjust to the brightness to see the THREE\n          GHOST CHILDREN, now transformed into GOLDEN ANGELS; EYES\n          RESTORED, small fluttering WINGS ON THEIR BACKS.\n\n          \n\n                                 SWEET GIRL GHOST\n                    It's a fine, fine thing you did for us,\n                    miss.\n\n          \n\n                                 CORALINE\n                    Well, I'm glad it's finally over!\n\n          \n          A SHADOW crosses the faces of the three children. They\n          gather around Coraline and bow their heads.\n\n          \n\n                                 SWEET GIRL GHOST\n\n                           (SIGHS)\n                    It is over and done with ... for us.\n\n          \n          Silent beat.\n\n          \n\n                                 CORALINE\n                    What about...me?\n\n          \n          The tall girl ghost shifts uncomfortably, then BLURTS\n\n          OUT:\n\n          \n\n                                 TALL GIRL GHOST\n                    You're in terrible danger, girl!\n\n          \n          Coraline is stunned and gestures for an explanation.\n\n          \n\n                                  CORALINE\n                    But how?   I locked the door!?\n\n          \n\n                                 SWEET GIRL GHOST\n                    It's the key, miss, there's only one and\n                    the Beldam will find it.\n\n          \n          The KEY ON THE STRING around Coraline's neck floats out\n          in front of Coraline. She grabs it.\n\n          \n          The three ghost children all embrace Coraline tenderly.\n\n          \n\n                                 BOY GHOST\n\n                           (WHISPERS)\n                    Tain't all bad, miss. Thou art alive ...\n                    thou art still ... living...\n\n          \n          They begin to swirl around her, spinning faster and\n          faster. Coraline starts to turn and then she --\n\n          \n\n                                                               CUT TO:\n\n          \n\n          \n\n          INT. CORALINE'S BEDROOM - NIGHT\n\n\n          \n\n          -- ROLLS HERSELF AWAKE IN HER OWN BED. FAST PULL BACK\n          above her to find covers thrown off and the CAT awake by\n          her side.\n\n          \n          Coraline lifts up her pillow and GASPS - the GHOST EYES\n          ARE IN PIECES like hatched bird eggs. She takes out the\n          key on its string and explains to the cat, her voice\n\n          PANICKED:\n\n          \n\n                                 CORALINE\n                    I -- I've gotta hide this somewhere, s-\n                    somewhere she can never ...\n\n          \n          The cat doesn't like the sound of this. Coraline grabs\n          her blanket and heads to her door. But the cat leaps down\n          and blocks her way.\n\n          \n\n                                 CORALINE (CONT'D)\n                    Outta my way!\n\n          \n          She sidesteps the cat and leaves her room. The cat glares\n          after her\n\n          \n\n          INT. HOUSE STAIRWAY, LOWER HALL, LIVING ROOM - CONTINUOUS\n\n\n          \n          Coraline trots down the stairs and purposefully heads\n          down the hall. She passes the LIVING ROOM and exits\n          frame. CAMERA stays on living room, where, on the LITTLE\n          DOOR in the corner wall, SHADOWS and LIGHT start to MOVE.\n\n          WE ROCKET IN AND--\n\n          \n\n                                                         JUMP CUT TO:\n\n          \n\n          \n\n          INT. LIVING ROOM - CONTINUOUS\n\n\n          \n          The baseboard is PUSHED ASIDE. Through the narrow gap at\n          the door's bottom, the DISMEMBERED HAND OF THE BELDAM\n          CRAWLS OUT. It scrambles out of frame in the direction of\n          Coraline!\n\n          \n\n          \n\n          EXT ROCKY PATH HIGH ABOVE HOUSE - SAME\n\n          \n          Coraline moves briskly, the house below, GRIPPING THE KEY\n          that's tied round her neck. DARK, ROPEY CLOUDS reach like\n          fingers across the gibbous moon. Coraline sings her\n          father's nonsense song, her voice hardly trembling.\n\n          \n\n                                 CORALINE\n                    Oh.... my twitchy witchy girl,\n                    I think you are so nice ...\n\n          \n\n          \n\n          EXT. ORCHARD - SAME\n\n\n          \n          She moves down past the old fruit trees, now covered with\n          BRIGHT SPRING BLOSSOMS that fall gently like snow.\n\n          \n\n                                 CORALINE\n                    ... I give you bowls of porridge\n                    And I give you bowls of ice cream.\n\n          \n          LOW ANGLE ON Coraline, moving away. The BELDAM'S HAND\n          drops into frame and CREEP-CRAWLS after her.\n\n          \n\n                                 CORALINE (CONT'D)\n                    I give you lots of kisses,\n                    And I give you lots of hugs ...\n\n          \n\n          \n\n          EXT. WELL - SAME\n\n\n          \n          Coraline jams the SAME DEAD BRANCH Wybie used under the\n          well's cover, lining it up over the SAME FULCRUM ROCK.\n\n          \n\n                                 CORALINE\n                    ... But I never give you sandwiches\n                    With grease and worms and mung beans.\n\n          \n          Circling around behind the BIG STUMP, the HAND SCAMPERS\n          behind one rock to a bush to a tree, coming closer.\n\n          \n          Coraline manages to lever the well's cover off to one\n          side, leaving the WHOLE WELL OPEN. Huffing and sweating,\n          she wipes her brow, then takes the key string that's\n          around her neck.\n\n          \n          The hand, SEEING what is about to happen, RACES TOWARDS\n\n          HER!\n\n          \n          Coraline lifts string and key, not quite over her head.\n\n          \n          The hand JUMPS onto the big stump and SPRINGS through the\n          air to GRAB THE KEY and PULL CORALINE TO THE GROUND!\n\n          \n          Coraline makes a CHOKED SCREAM, her fingers caught\n          between the key string and her neck!\n\n          \n          The HAND wants to DRAG HER BACK TO THE HOUSE and the\n\n          LITTLE LOCKED DOOR THAT IS BREATHING WITH ANTICIPATION!\n\n          \n          A BLINDING HEADLIGHT hits HAND and CORALINE; an AIR HORN\n          SOUNDS; and WYBIE LOVAT - hollering a BATTLE CRY all his\n          own - comes SPEEDING DOWN THE BLUFF on his whining\n          electric bike!\n\n          \n\n                                  WYBIE\n\n                    YAHHHHH!!!!\n\n          \n          Wybie GUNS the throttle, and, leaning out, GRABS the\n          confused HAND with his slug tongs!\n\n          \n          He CIRCLES AROUND and HEADS TOWARDS THE WELL, readying to\n          throw the hand in. But the HAND GETS FREE, and GRABS his\n          handlebars.\n\n          \n          OUT OF CONTROL, Wybie's bike HITS A ROCK, and WYBIE AND\n          HAND ARE THROWN RIGHT DOWN THE WELL. HOLLERING, he just\n          manages to hang on with one hand! The Beldam's hand,\n          caught on Wybie's coattail, SCRAMBLES UP his body and\n          face and onto the well's edge where it STABS AT HIS\n          FINGERS to make him fall!\n\n          \n\n                                 WYBIE (CONT'D)\n\n                           (STRUGGLING)\n                    Get off!!\n\n          \n          Coraline, choking, rises to her feet. She grabs her\n          BLANKET and - in the still-blazing headlight of the\n          crashed bike - she RUNS UP and THROWS IT OVER THE HAND.\n          It fights like crazy as Coraline wrestles to control it.\n          The hand STABS THROUGH THE BLANKET and SHAKES IT OFF. It\n          crouches to attack her!\n\n          \n          And then WYBIE IS BACK, pumped with adrenaline, a BIG\n          ROCK raised over his head! He HURLS IT DOWN ON THE\n          LEAPING HAND! And it BREAKS into TWENTY LIFELESS NEEDLES.\n\n          \n          Wybie struggles to catch his breath. Coraline - breathing\n          hard - removes the key and string from around her sore\n          neck. She pulls up the corners of her blanket - with the\n          needles on it - around the rock, and ties it all together\n          with the string. The key is left attached.\n\n          \n          The two friends carry the heavy package to the well and\n          DROP IT DOWN THE HOLE. By the light of a stray moonbeam,\n          they watch and listen until it makes a muffled splash in\n          the dark water at the bottom. They slide the well cover\n          in place.\n\n          \n          Still catching his breath, Wybie stands, holding his\n          injured hand, its glove ripped by the Beldam's claw. He\n          looks over at Coraline as the scene brightens a little\n          with moonlight.\n\n          \n\n                                 WYBIE (CONT'D)\n                    I-I'm really sorry I didn't believe you\n                    about all this ... evil stuff, Coraline.\n\n          \n          Coraline, shoulders rising as she catches her breath,\n          stands and smiles: he called her by real name for the\n          first time.\n\n          \n\n                                 CORALINE\n                    Why did you change your mind?\n\n          \n          He walks over, and takes out an old B&W photo from his\n          jacket.\n\n          \n\n                                 WYBIE\n                    W-well, Gramma showed me this picture,\n                    after I called you crazy?\n\n          \n          He hands it to her.\n\n          \n          ANGLE ON PHOTO: two light-skinned black girls - dressed\n          in old-fashioned clothing - stand in front of the Pink\n          Palace, before it was divided into apartments. One looks\n          just like the sweet ghost girl, and holds the DOLL WITH\n          BUTTON EYES, which looks just like her.\n\n          \n\n                                 WYBIE (O.C.) (CONT'D)\n                    It's her and her sister, before she\n                    disappeared.\n\n          \n          ANGLE ON WYBIE AND CORALINE. Behind them, blossoms fall\n          like snow in the orchard.\n\n          \n\n                                 CORALINE\n                    The sweet ghost girl.\n\n          \n          Wybie's grandmother, loud and worried, calls from the\n          distance.\n\n          \n\n                                  WYBIE'S GRANDMOTHER (O.C.)\n                    Wyborne!   Come home!!\n\n          \n\n                                 WYBIE\n                           (re: his grandmother)\n                    Oh, man...what am I going to tell her?\n\n          \n          She looks up from the photo and smiles.\n\n          \n\n                                 CORALINE\n                    Just bring her by the house tomorrow.      We\n                    can tell her together.\n\n          \n\n                                 WYBIE\n                    We...we can??\n\n          \n\n                                 CORALINE\n                    You know, I'm glad you decided to stalk\n                    me.\n\n          \n          She gives Wybie a playful punch on the arm and LAUGHS.\n\n          \n\n                                 WYBIE\n                    Wasn't my idea.\n\n          \n          The BLACK CAT jumps up on the TREE STUMP and MEROWWS.\n          Coraline smiles.\n\n          \n          We TILT UP to the sky and see the last ropey clouds -\n          like two clawed hands - clear away from the bright\n          gibbous moon.\n\n          \n\n                                                          DISSOLVE TO:\n\n          \n\n          \n\n          EXT HOUSE, GARDEN - DAY\n\n          \n          One WHITE BALLOON floats against a blue sky with puffy,\n          white clouds. WE TILT DOWN past more balloons to a TABLE\n          OF REFRESHMENTS, set up by the front gates.\n\n          \n          Coraline picks up a TRAY OF DRINKS and heads out to her\n          hard-working GUESTS, all wearing garden gloves and\n          showing signs of having helped plant about TWO HUNDRED\n\n          RED TULIPS.\n\n          \n          SPINK AND FORCIBLE, along with their DOGS, are set up at\n          a table below the steps. Empty plant cartons are stacked\n          nearby along with some garden tools and empty bags of\n          peat moss.\n\n          \n\n                                    CORALINE\n                       Thanks for helping me, Miss Spink, Miss\n                       Forcible.\n\n          \n\n                                    MISS FORCIBLE\n                              (straining to see)\n                       Oh, look April - Pink Ladies!\n\n          \n\n                                    CORALINE\n                       Actually, it's just lemonade.\n\n          \n          Coraline hands them the beverages, then nods towards the\n          GREY DOG digging in the flowers.\n\n          \n\n                                    CORALINE (CONT'D)\n                       How's Angus doing?\n\n          \n          Miss Spink sighs.\n\n          \n\n                                    MISS SPINK\n                       Oh, much better, dear... But he can't\n                       duck his wings forever!\n\n          \n          Coraline heads up the steps to find her PARENTS dumping a\n          heavy bag of PEAT MOSS around the dead-looking tree in\n          the stone circle.\n\n          \n\n                                    CHARLIE\n                       Here comes a burp.\n\n          \n          Charlie BURPS.\n\n          \n\n                                    MEL\n\n                              (SCOLDING)\n                       Charlie!\n\n          \n\n                                    CHARLIE\n                       Oh, excu-say-moi, but that pizza was\n                       delicious.\n\n          \n          Mel SIGHS.\n\n          \n\n                                      CORALINE\n                       Cold drinks?\n\n          \n          Charlie nods, grabs them for Mel and Wybie.\n\n          \n\n                                 CHARLIE\n\n                           (HAPPILY)\n                    Oh yeah, great!\n\n          \n\n                                 MEL\n\n                           (SKEPTICAL)\n                    You were right, Coraline. I really hate\n                    dirt, but the tulips look nice.\n\n          \n\n                                   CORALINE\n                    Thanks, mom.\n\n          \n          Coraline, delighted, moves on.\n\n          \n          Coraline comes upon Bobinsky in the bottom of the drained\n          fish pond. He's stealthily PULLING just-planted tulips\n          from the dirt there, and putting BEETS in their place.\n\n          \n\n                                 MR. BOBINSKY (O.S.)\n                           (pulling beets)\n                    Ooo, dret nican...neit, neit...da, da, dat iz\n                    possible.\n\n          \n          Coraline CLEARS HER THROAT to get his attention.\n\n          \n\n                                 CORALINE\n                    How are the meeshkas, Mr. B?\n\n          \n          Surprised and looking very guilty, he tries to cover up\n          his activities. She smiles and hands him a drink.\n\n          \n\n                                 MR.   BOBINSKY\n\n                           (SMILES)\n                    Dey tell me that   you - are saviour,\n                    Caroline. And --   soon as dey are ready --\n                    dey vish to give   special tenks-you\n                    performance.\n\n          \n          He drains his glass of lemonade. A familiar voice is\n          heard approaching. Coraline turns and smiles.\n\n          \n\n                                 WYBIE'S GRANDMOTHER (O.C.)\n                    Wyborne, I know where I'm going--\n\n          \n          ANGLE ON Wybie and his GRANDMOTHER as they walk through\n          the garden gates\n\n          \n\n                                 WYBIE'S GRANDMOTHER\n\n                                 (CONT'D)\n                    --I grew up here.\n\n          \n          Coraline sees them and waves.\n\n          \n\n                                 CORALINE\n                    Welcome, Ms. Lovat!\n\n          \n          The old lady looks up and smiles.\n\n          \n\n                                  WYBIE'S GRANDMOTHER\n                    Oh, hello.\n\n          \n\n                                 CORALINE\n                    I'm Coraline Jones -- I've got so much to\n                    tell you!\n\n          \n\n                                  MEL (O.C.)\n                            (background dialog)\n                    Here.\n\n          \n\n                                 CHARLIE (O.C.)\n                           (background dialog)\n                    Thanks.\n\n          \n\n                                 MISS SPINK (O.C.)\n                           (background dialog)\n                    Ooo, do you want to pop a little gin in\n                    it dear?\n\n          \n\n                                 MISS FORCIBLE (O.C.)\n                           (background dialog)\n                    Of course!\n\n          \n          CAMERA PULLS UP from the GARDEN, FLIES OVER THE HOUSE and\n          BOOMS DOWN to the PINK PALACE APARTMENTS SIGN out front.\n          On top of the sign sits the black cat, who looks right\n          into camera, blinks, then walks behind the thin post that\n          holds the sign and DISAPPEARS.\n\n          \n\n                                   THE END\n\n\n\n\n\n\nCoraline\nWriters :   Henry Selick  Neil Gaiman\nGenres :   Animation  Adventure  Family  Fantasy\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Hands made of sewing needles re-make a doll to resemble an 11-year-old Coraline Jones. A little later, Coraline and her family move from Pontiac, Michigan to the Pink Palace Apartments in Ashland, Oregon, which is also occupied by retired actresses Ms. Spink and Forcible, and eccentric Russian acrobat Mr. Bobinsky, who claims to be training a mouse circus. Coraline's parents work for a garden catalog and are often too busy to pay attention to her.\nCoraline decides to explore their new home, meeting Wyborn \"Wybie\" Lovat, the grandson of the apartments' landlady, Mrs. Lovat. While exploring, she finds a small brick-sealed door. That night, Coraline follows a mouse through the door, where she discovers the bricks have been replaced by a long corridor. Coraline goes through it and finds herself in the Other World, which is a copy of her world and is inhabited by her \"Other Parents\", who look similar to her real parents, but have buttons for eyes. In the Other World, her parents are much more attentive and everything is more interesting and magical. Coraline falls asleep in the Other World, and awakens back home.\nCoraline goes to the Other World three times despite warnings from her neighbors and a cat that can talk in the Other World. The other copies include a copy of Mr. Bobinsky, who runs a real mouse circus, copies of a young Ms. Spink and Forcible, who perform a theater show, and a duplicate of Wybie that cannot talk. On the third visit, the Other Mother invites Coraline to stay in the Other World forever, on the condition that she has buttons sewn over her eyes. Horrified by this, Coraline rejects the offer. After she refuses to accept the Other Mother's love, Coraline is thrown through a mirror into a secret room. Inside she meets the ghosts of three children, who were tricked by the Other Mother (who they refer to as the \"Beldam,\" meaning a witch or a hag), into having buttons sewn into their eyes, thus trapping their souls. Coraline vows to free them by finding their stolen eyes. The Other Wybie helps her escape and stays behind, but when Coraline returns, her parents are nowhere to be found. After seeing her parents trapped in the mirror, Coraline discovers that the Other Mother has kidnapped them.\nCoraline ventures into the Other World with a seeing eye stone she received from the real Spink and Forcible to play a \"game\"; to find her parents and the eyes of the ghost children. If she loses, she will stay forever. Using the stone, Coraline manages to retrieve the ghost children's stolen eyes from the warped versions of the Other inhabitants. She confronts the Other Mother, who has decayed into an arachnoid witch with the same needle-hands that made the doll. One of the children warns her that Coraline will never be let go even if she wins. Coraline finds her real parents trapped in a snow globe and manages to trick the Other Mother and escape, blinding her and severing her hand. Coraline's parents return with no memory of being kidnapped.\nThe ghosts appear to Coraline in a dream to warn her that even though she had freed them, she is still in danger. They tell her that she must get rid of the key, or the Other Mother will find it. They also tell Coraline not to be sad, because she is still alive. As Coraline prepares to toss the key into the well, she is attacked by the Other Mother's severed clawed hand, but is saved by Wybie, who crushes it with a rock. With Wybie's help, Coraline throws the key and the pieces of the claw hand down the well. Mrs. Lovat's twin sister is revealed to be one of the three ghost children. The next day, Coraline hosts a garden party with her neighbors and meets Mrs. Lovat, and prepares to tell her about her adventures."}