{"title": "Crime Spree", "full_text": "CRIME SPREE\n\n               \n                                   Written by\n\n                \n                                   Brad Mirman\n            \n\n               \n                             First Draft, March 1996                \n\n                          FOR EDUCATIONAL PURPOSES ONLY\n\n\n               \n\n               FADE IN:\n\n               \n\n               INT. DARK ROOM - NIGHT\n\n               Pitch dark. We hear two men speaking FRENCH in hushed voices.\n               NOTE: All dialogue is in French until otherwise noted.\n\n                                       DANIEL\n                               (whispering)\n                          Turn on the flashlight.\n\n                                         JULIEN\n                          I'm trying.    It doesn't work.\n\n                                       DANIEL\n                          It has to work. You just bought it this\n                          afternoon.\n\n               A beat.\n\n                                       JULIEN\n                          Do they come with batteries?\n\n                                       DANIEL\n                          You didn't buy batteries?\n\n                                       JULIEN\n                          I thought they came with batteries.\n\n                                       DANIEL\n                          I can't believe you didn't check.\n\n                                       JULIEN\n                          I bought everything you put on the list.\n                          Gloves. Pen knives. Flashlight.\n                          Batteries were not on the list.\n\n                                       DANIEL\n                          Why should I have to put it on the list?\n                          It's like saying to buy a car with tires.\n\n               \n\n               EXT. HOUSE -- NIGHT\n\n               A wealthy neighborhood of Paris off the Champs Elysees. Large\n               homes line the secluded street. We see the silhouette of a man in\n               a Peugeot. We MOVE IN closer to see RAYMOND GAYET, 30's, waits\n               nervously.\n\n               \n\n               INT. DARK ROOM -- NIGHT\n\n               Dark. DANIEL FORAY lights his Zippo lighter. He is late 30's,\n               tall, handsome with eyes that seem to twinkle in the glow of the\n               flame. Beside him is JULIEN LABESSE, 30's, hyper. Daniel places\n               the LIGHTER on a small table and moves over to a PAINTING on the\n               wall. Daniel stops at one, removes a pen knife and starts to cut\n               the canvas from the frame.\n               Daniel rolls up the canvas.\n\n               \n\n                                                                          2.\n\n               \n\n                                          DANIEL\n                          Let's go.\n\n               Julien starts to pick up the ZIPPO.\n\n                                       DANIEL\n                          Be careful it's...\n\n               Too Late! Julien has already picked it up. It burns his hand ans\n               he flicks it away. It flies through the air and lands in the corner\n               of the room. The CURTAINS catch on fire.\n\n                                          DANIEL\n                          ... hot!\n\n               Julien panics! He grabs the canvas out of Daniel's hand and begins\n               beating the flames with it. Daniel looks at him with disbelief.\n               Julien flails his arms wildly as he beats back the flames. He\n               turns to Daniel pleased that his efforts have extinguished the\n               fire, but unaware that the canvas has now caught on fire. A beat.\n               Julien sees the flames and puts them out. Daniel just stares at\n               him. He opens the canvas. The painting is ruined.\n\n               \n\n               EXT. STREET -- NIGHT\n\n               A Mercedes parks in front of the Peugeot, boxing it in between it\n               and a car behind it. The DRIVER gets out and walks away.\n\n               \n\n               INT. HOUSE FOYER -- NIGHT\n\n               Daniel and Julien move through the darkness.\n\n                                       DANIEL\n                          Light your lighter. I can't see\n                          anything... and try not to burn down\n                          the house!\n\n               Julien remove a lighter and presses it. The entire room fills\n               with light. Julien stares at the flame amazed.\n\n                                          OLD MAN'S VOICE\n                          Don't move!\n\n               They turn to see an old man standing at the top of the stairs in\n               his bathrobe. He is frail, his face pasty white. He is holding a\n               very long, double-barrel shotgun.\n               Julien looks to Daniel with a 'what now' expression. The old man\n               slowly moves down the stairs. He loses his balance and falls down\n               the stairs, tumbling head over heals until he reaches the bottom.\n               Daniel and Julien stare at the old man who is sprawled out on the\n               floor, motionless.\n\n                                          JULIEN\n                          Is he dead?\n\n                                          DANIEL\n                          I don't know.     He looks dead.\n\n               \n\n                                                                            3.\n\n               \n\n                                       JULIEN\n                          He looked dead before he fell.\n\n               The old man groans, then opens his eyes.    He grabs his shotgun.\n               Daniel and Julien run to the door.\n\n               \n\n               EXT. HOUSE -- NIGHT\n\n               Daniel and Julien run towards the street.\n\n                                       DANIEL\n                          Start the car! Start the car!\n\n               Raymond starts the engine.   Daniel and Julien rush across the street\n               and get in the back seat.\n               Raymond tries to pull out but there are only a few inches between\n               the Mercedes in front and the car behind. Like a pinball stuck\n               between two bumpers the Peugeot jerks rapidly back and forth.\n\n               \n\n               INT. PEUGEOT -- CONTINUOUS\n\n               Daniel and Julien stare angrily ar Raymond.\n\n                                       JULIEN\n                          You didn't think to move the car before\n                          we came out!\n\n               Daniel looks out his window and sees...\n               DANIEL'S POV -- the old man runs out of his house with his shotgun\n               and heads towards the car.\n               Raymond is desperately trying to get the car free. They all slide\n               down as the old man fires. The windows on the left side of the\n               car shatter.\n\n                                       DANIEL\n                          Raymond, get us out of here!\n\n               Raymond pops up and returns to getting the car out as the old man\n               opens the breach of the shotgun to reload..\n               Raymond floors the Peugeot keeping his foot on the brake. The\n               engine revs. He turns the wheel to the left and releases the brake.\n               The Peugeot juts forward smashing into the rear of the Mercedes\n               and pushing in out into the street. Before the old man can take\n               aim the Peugeot is speeding down the street.\n\n               \n\n               INT. PEUGEOT -- MOVING -- NIGHT\n\n               Raymond bites his lip nervously as he drives.    Julien finds the\n               whole thing amusing. Daniel leans forward.\n\n                                       DANIEL\n                               (to Raymond)\n                          You know what makes a good get away\n                          driver?\n                                       (More)\n\n               \n\n                                                                          4.\n\n               \n                                       DANIEL (Cont'd)\n                               (controlled anger)\n                          Being able to get away!\n\n                                       RAYMOND\n                          You're always pointing out my negative\n                          qualities. My analyst says positive\n                          reinforcement is a much more productive\n                          way of relating with people.\n\n                                       JULIEN\n                          Fine. Raymond, we'd like to commend you\n                          on how well you fucked up tonight.\n\n               \n\n               EXT. STREET, PARIS -- DAY\n\n               A narrow street. Daniel carries the cardboard tube as he walks\n               with Julien and Raymond. They enter a WAREHOUSE.\n\n               \n\n               INT. BASTALDI'S OFFICE -- DAY\n\n               Two large desks are lined up face to face. One is empty. The\n               other is occupied by LAURANT BASTALDI, 40's, all business. Off to\n               the side is MARCEL BUROT, 40's. Daniel, Julien and Raymond enter.\n               As they approach the desk Daniel glances at Marcel who is staring\n               at him.\n\n                                        MARCEL\n                               (amused)\n                          I heard you almost got your ass blown\n                          off last night. Some thief. A regular\n                          black panther.\n\n               Marcel glances at Bastaldi to see if he appreciates his comments.\n\n                                        RAYMOND\n                          A Black Panther was a member of an African\n                          American militant group in the sixties,\n                          Marcel. I think you're referring to The\n                          Pink Panther.\n\n                                       MARCEL\n                          Pink panther, black panther. Who gives\n                          a shit? And I don't remember asking you\n                          a God Damn thing, you little turd.\n\n                                       RAYMOND\n                          There's no reason to be abusive. You're\n                          projecting your anger on me as a defense\n                          mechanism.\n\n                                       MARCEL\n                          What the hell is he talking about?\n\n                                       RAYMOND\n                          I'm talking about human beings\n                          communicating openly and honestly.\n\n               \n\n                                                                             5.\n\n               \n\n                                       MARCEL\n                          How about getting on your knees and\n                          communicating with my dick?\n\n                                       BASTALDI\n                          Shut up! Both of you!    You're giving me\n                          a fuckin' headache.\n\n               A beat. Raymond and Marcel stare at one another.     We HEAR a muffled\n               GROANING SOUND in the b.g.\n\n                                       DANIEL\n                          Where's your brother?\n\n                                       BASTALDI\n                          Vincent's in the States on business.\n                               (a beat; referring to\n                                the painting)\n                          That it?\n\n               Daniel lays the cardboard tube containing the painting on the desk.\n               Bastaldi removes the painting. To him it is not a work of art,\n               just a commodity to be sold. He opens his desk drawer, removes\n               several large stacks of money and hands them to Daniel.\n\n                                        BASTALDI\n                          Okay.   Now I've got something I want to --\n\n               We HEAR the groaning sound again. Bastaldi looks irritated. He\n               gets up and walks over to a closet. He opens to the doors to reveal\n               a man in his underwear, his wrists tied behind his back, his mouth\n               taped shut. A wire noose is around his neck forcing him to stand\n               on his tip toes to avoid hanging himself.\n\n                                       BASTALDI\n                          Do you mind? I'm trying to do some\n                          business here.\n\n               The man looks at Bastaldi through pleading eyes and mumbles\n               something.\n\n                                       BASTALDI\n                          One more sound out of you and I'm going\n                          to cut your fuckin' tongue out.\n\n               Bastaldi closes the door.   Daniel looks at him inquisitively.\n\n                                       BASTALDI\n                          You take someone in. Give them a steady\n                          job and how do they repay you? By\n                          claiming to misplace a shipment of your\n                          merchandise.\n\n                                       RAYMOND\n                          Maybe he did misplace it.\n\n                                       BASTALDI\n                          You misplace your car keys.   You misplace\n                          your cell phone.\n                                       (More)\n\n               \n\n                                                                            6.\n\n               \n                                       BASTALDI (Cont'd)\n                          You do not misplace one hundred and forty\n                          seven wide-screen TV's!\n\n                                       DANIEL\n                          Laurant, how long has he been in there?\n\n               Bastaldi looks puzzled.\n\n                                          BASTALDI\n                          I don't know.     What day is today?\n\n                                          JULIEN\n                          Thursday.\n\n                                        BASTALDI\n                          Is it Thursday already?    This week has\n                          just shot by.\n\n               Bastaldi thinks about something for a moment, then...\n\n                                       BASTALDI\n                          You and your crew speak English, don't\n                          you?\n\n               Daniel is still staring at the closet.\n\n                                       BASTALDI\n                          Hey Daniel! Hello?\n                               (snaps his fingers)\n                          Do you guys speak English?\n\n                                          DANIEL\n                          Uh, yeah.\n\n                                        BASTALDI\n                          Good.   I have a job for you in America.\n\n               Bastaldi tosses a photo of a middle-aged American couple.   He points\n               to a diamond necklace around the woman's neck.\n\n                                       BASTALDI\n                          The Taylors from Chicago. Very rich.\n                          An acquaintance of mine recently quit\n                          working for Mrs. Taylor as an assistant.\n                          She tells me they keep all their jewelry\n                          in a safe in their bedroom.\n\n                                       JULIEN\n                          It seems like a long way to go for a\n                          necklace.\n\n                                       DANIEL\n                          Besides, we don't know the city and--\n\n                                       MARCEL\n                               (overlapping)\n                          Mr. Bastaldi isn't asking you if you\n                          want to go.\n                                       (More)\n\n               \n\n                                                                               7.\n\n               \n                                       MARCEL (Cont'd)\n                          He's telling you you're going! And if\n                          he's telling you you're going to be going\n                          then you are going to go!\n\n                                       BASTALDI\n                          Thank you Marcel, for that... extremely\n                          redundant explanation.\n\n                                       DANIEL\n                          C'mon, Laurant, America?\n\n                                       BASTALDI\n                          The job is worth about two million euros.\n                          Pull this off and you and your crew could\n                          make some real money, Daniel. You leave\n                          tomorrow.\n\n               They know they don't have a choice.\n\n                                       JULIEN\n                          We're going to need to find someone who\n                          knows the city.\n\n                                       MARCEL\n                          I know someone.\n\n               \n\n               EXT. NOTRE DAME -- DAY\n\n               The plaza is filled with tourists. Moving through the crowd is\n               SAMI ZERHOUNI, Algerian, late 20's, a small time street hustler,\n               dressed in jeans and a \"I Love Paris\" tee-shirt. He passes a\n               MAN who is about to take a picture and lifts his wallet.\n               Sami moves on. He sees two overweight women standing at a\n               vendor's cart, holding a large wad of MONEY. The woman puts the\n               cash back in her purse, but does not zip it up.\n               Sami moves in behind her and slips his hand into the purse. She\n               zips the bag closed. Sami's face fills with pain as the zipper\n               catches the hair of his arm. The women walk towards the\n               cathedral. Sami has no choice but follow after them. He tries\n               to match their pace so he doesn't alert them of his presence.\n               The woman looks back and sees Sami's hand. She pulls her bag\n               away, ripping a section of hair off his arm, then swings the\n               bag, putting all of her weight behind it. It hits Sami squarely\n               in the face. He lands on his back with a thud. WALLETS and\n               BILLFOLDS fly out from every one of his pockets.\n               He staggers to his feet and starts to pick up the wallets when\n               he sees...\n\n               HIS POV -- ACROSS THE PLAZA:    of two police officers moving\n               towards him .\n               He knows he has no more time.    He takes off running, disappearing\n               into the crowd.\n\n               \n\n                                                                           8.\n\n               \n\n               INT. CAFE -- LATIN QUARTER -- DAY\n\n               Sami is at the bar. He sees Marcel enter and runs towards the\n               back. Standing in his way is one of Marcel's MEN. Sami turns\n               around as Marcel approaches and forces a smile.\n               NOTE:   All dialogue is now in English unless otherwise noted.\n\n                                        MARCEL\n                           Going somewhere?\n\n                                       SAMI\n                           Oh, Marcel! I thought you were somebody\n                           else. If I knew it was you I would have\n                           never run.\n\n               A long, awkward beat as Marcel just glares at him.\n\n                                        SAMI\n                           You're probably here for the money I owe\n                           you.\n                                (off Marcel's nod)\n                           I don't have it.\n               Marcel opens the door to the bathroom and pushes Sami inside.\n\n               \n\n               INT. BATHROOM -- CONTINUOUS -- DAY\n\n               Marcel closes the door.   He is face to face with Sami.\n\n                                        SAMI\n                           You know this is how rumors get started.\n\n               Marcel punches Sami in the stomach. He drops to his knees. A\n               beat. The door to the bathroom opens and the LARGE MAN peers\n               inside. He stares awkwardly at what he perceives as the beginning\n               of a sexual act.\n\n                                         SAMI\n                           Told you.\n\n               Marcel slams the door then grabs Sami by the ear and yanks him to\n               his feet.\n\n                                        MARCEL\n                           Today's your lucky day, Sami.\n\n                                        SAMI\n                                (breathlessly)\n                           Yeah, I can see that.\n\n                                        MARCEL\n                           Normally I'd be breaking your fingers\n                           right now, but I'm going to give you a\n                           chance to make enough to pay me back and\n                           have some extra for yourself. We have a\n                           group going to Chicago to do a job.\n                           You're going with them.\n\n               \n\n                                                                            9.\n\n               \n\n                                          SAMI\n                          Me?\n\n                                       MARCEL\n                          You lived there. You know the city.\n\n                                       SAMI\n                          I've still got a few legal problems back\n                          in the States.\n\n               Marcel glares at him.\n\n                                       SAMI\n                               (nervously)\n                          But I'd be... I'd be happy to go.\n\n               Marcel stares at him with hard expression.\n\n                                       MARCEL\n                          If you try to leave town I'll know. If\n                          you manage to leave town I'll find you...\n                          and the next time we meet in a bathroom\n                          I'll be cutting you up into little pieces.\n\n               He hands Sami a piece of paper.\n\n                                       MARCEL\n                          Be at this address at nine o'clock\n                          tomorrow morning.\n\n               \n\n               INT. CAFE -- MORNING\n\n               Daniel sits with Julien.    At the end of the bar Raymond is on the\n               pay phone.\n\n                                       RAYMOND\n                               (in French)\n                          Yes, Mama. Yes, I have my vitamins. I\n                          have everything. Of course I'm coming\n                          back. I'm not leaving you. I'm only\n                          going to be gone a few days. I'll call\n                          you when I get there. Okay? I've got\n                          to go now.\n                               (listens)\n                          Mama, I've got to go.\n                               (listens)\n                          No, I'm not yelling.\n\n               Sami enters and walks over to Daniel and Julien.\n\n                                         SAMI\n                          I'm Sami.    Marcel sent me.\n\n                                       JULIEN\n                          What is it you do, Sami?\n\n               \n\n                                                                         10.\n\n               \n\n                                       SAMI\n                          You know, a little of this, a little of\n                          that. I've boosted cars, stole radios,\n                          run a few scams. Right now I'm into\n                          pick-pocketing.\n\n                                        JULIEN\n                          I see.   A master criminal.\n\n                                       SAMI\n                          Hey, I was told to come here by Marcel.\n                          You guys don't want me, I'll be more\n                          than happy to leave.\n\n               The door opens. ZERO enters. No one knows his last name. He is\n               40's, blonde hair, leather jacket, black pants. Looks more like a\n               rock-star than a criminal. His eyes are flat and there is an\n               intensity about him that is unnerving. Zero casually nods to\n               Daniel. Zero stares at Sami as Daniel leads him over.\n\n                                        DANIEL\n                               (to Sami)\n                          This is Zero.\n\n                                       SAMI\n                          Hi. I'm one and this is two, three,\n                          four and five.\n\n               Sami laughs at his little joke. The others cringe. One look in\n               Zero's eyes tells Sami what everyone else already knows: This is\n               not someone to fuck with. Julien puts his arm around Sami and\n               leads him away from the others.\n\n                                       JULIEN\n                          Let me give you some advice. You don't\n                          want to piss him off because he'll kill\n                          you for the fun of it. What you want to\n                          do is keep your mouth shut and do what\n                          we tell you.\n\n                                       ZERO\n                               (in French)\n                          So, we are going to America?\n\n                                        DANIEL\n                          In English.   Sami doesn't speak French.\n\n                                       ZERO\n                          Where are you from?\n\n                                        SAMI\n                          Algeria.\n\n                                       ZERO\n                          And you don't speak French?\n\n               \n\n                                                                         11.\n\n               \n\n                                       SAMI\n                          Well, you know, not all Algerians speak\n                          French. It's a matter of what school\n                          you went too. Me I never really --\n\n                                       ZERO\n                               (overlapping)\n                          -- Zero isn't interested in your life\n                          story.\n                               (to Daniel)\n                          Who gets killed?\n\n                                       DANIEL\n                          Hopefully no one.\n\n                                       ZERO\n                               (confused)\n                          No one? Then why is Zero here?\n\n               Sami leans over to Raymond.\n\n                                       SAMI\n                          He speaks about himself in the third\n                          person?\n\n                                       RAYMOND\n                          Feel free to correct him if you want.\n\n                                       DANIEL\n                               (to Zero)\n                          I just want you there in case there's\n                          trouble.\n\n                                       ZERO\n                          And if there is, then Zero can kill\n                          someone?\n\n                                       DANIEL\n                          We'll see.\n\n               \n\n               EXT. CAFE -- DAY\n\n               Daniel and the others step out carrying their suitcases. The door\n               to a limousine opens and Marcel gets out. The scene is in FRENCH.\n\n                                       BASTALDI\n                               (to Daniel)\n                          I thought I would accompany you to the\n                          airport to say bon voyage... and tell\n                          you that Marcel will be going with you.\n\n                                       DANIEL\n                          What?\n\n                                       BASTALDI\n                          This is a considerable move up for you,\n                          Daniel. The temptation of having so\n                          much money might be too much for you.\n\n               \n\n                                                                         12.\n\n               \n\n                                       DANIEL\n                          You don't trust me?\n\n                                       BASTALDI\n                          I don't trust anyone. You don't get to\n                          the top of this game by trusting people...\n                          and after all, you are a thief. It's in\n                          your nature to steal. I'm just protecting\n                          my investment.\n\n               \n\n               INT. LIMO -- MOVING -- DAY\n\n               For many of them this is the first time they have ever been inside\n               a limo. Julien pours himself a drink. Sami plays around with the\n               air conditioner.\n\n               Zero turns on the radio and clicks through a few stations until he\n               comes to RENAUD singing \"Des que le vent souffera.\" He leans back\n               in his seat, bobbing his head to the music. Marcel doesn't like\n               it. He changes the station. We hear JOHNNY HALLYDAY singing, \"Que\n               je taime.\"\n\n                                       MARCEL\n                          That's better.\n\n               Zero doesn't like it. He pushes the button returning to the Renaud\n               song and stares at Marcel. Marcel, not to be outdone returns the\n               Hallyday song. Like two children they click the buttons of the\n               radio, switching back and forth between Renaud and Hallyday.\n               Bastaldi has had enough.\n\n                                        BASTALDI\n                          Stop it!   Both of you!\n\n               He turns off the radio. A long beat. Marcel, like a child who\n               has to have the last word starts singing to himself quietly, but\n               loud enough for Zero to hear.\n\n                                       MARCEL\n                               (singing)\n                          ... que je t'aime... que je...\n               Marcel sees Bastaldi glaring at him and stops.\n\n               \n\n               EXT. O'HARE AIRPORT -- MORNING\n\n               Daniel and the crew get into a mini-van taxi.\n\n               \n\n               EXT. CHICAGO DRIVING MONTAGE -- MORNING\n\n               Quick cuts of the familiar sights of the city. The Sears building.\n               Chicago board of trade building. Grant park. Then with each\n               successive cut the beauty of the city seems to fade until we are\n               in...\n\n               \n\n                                                                           13.\n\n               \n\n               EXT. STREET -- MORNING\n\n               An industrial section of the city. Empty streets. Run down\n               buildings. Graffiti filled walls and burnt out hulls of abandoned\n               cars line the street. The taxi driver leans out his window.\n\n                                       TAXI DRIVER\n                          Are you sure you guys have the right\n                          address? This ain't no tourist area.\n\n               Marcel looks at a piece of paper he is holding.\n\n                                        MARCEL\n                          Yes.   We are sure.\n\n               The taxi speeds off, leaving them standing on the sidewalk, their\n               bags in a pile. Suddenly, from out of nowhere three BLACK TOUGHS\n               appear and walk over. Daniel looks behind him and sees another\n               two approaching from the rear. Zero calmly sits down on one of\n               the suitcases.\n\n                                       SAMI\n                          Let me handle this.\n\n               LAMAR, 30's, the leader of the group steps forward.\n\n                                          SAMI\n                          Hey, brother.     What's happening, man?\n\n               Sami raises his hand as if to greet Lamar.\n\n                                       LAMAR\n                          Don't you brother me, motherfucker.\n\n               Sami looks like an idiot with his hand up in the air.   He casually\n               lowers it. Lamar looks over the group and grins.\n\n                                       LAMAR\n                          What's in the bags?\n\n                                       JULIEN\n                          Dirty underwear.\n\n               Lamar forces a laugh.\n\n                                       LAMAR\n                          Dirty underwear. That's a good one.\n                          Let me explain something to you. This\n                          is my street and you're gonna give me\n                          want I what or I'm gonna bust your heads\n                          open.\n\n               Raymond steps forward and places his hand on Lamar's arm.\n\n                                       RAYMOND\n                          Lamar, violence is never an answer to\n                          settling disputes. I can see you have a\n                          lot of anger... but this is not the way\n                          to get it out.\n\n               \n\n                                                                          14.\n\n               \n\n                                       LAMAR\n                          Get outta my face!\n\n               Lamar removes a knife. The others in his group bring out an\n               assortment of clubs, chains and pipes.\n\n                                       LAMAR\n                          Now, are you going to give me the\n                          suitcases? Or are we going to have to\n                          take them?\n\n               Zero is still sitting on one of the suitcases.\n\n                                       ZERO\n                          Va te faire foutre!\n\n                                       LAMAR\n                          What did he say?\n\n                                       DANIEL\n                          He said to go fuck yourself.\n\n                                       ZERO\n                          We are tired and bored with your bullshit.\n                          So, put that stupid little knife away\n                          before Zero shoves it up your ass.\n\n                                         LAMAR\n                          Who is Zero?\n\n                                         JULIEN\n                          He is.\n\n                                       LAMAR\n                               (to Julien)\n                          He speaks about himself in the third\n                          person?\n\n               Julien shrugs his shoulders.\n\n                                       LAMAR\n                          Maybe Zero would like to get off his ass\n                          and take my knife from me?\n\n                                       ZERO\n                          If you insist.\n\n               Zero stands up and raises his hand.   He is holding a .9mm Glock.\n               He aims it at Lamar's head.\n\n               Lamar's brave exterior quickly fades now that he is looking down\n               the barrel of the gun. The rest of his gang turns and runs away.\n               Zero aims the gun at his groin.\n\n                                       ZERO\n                          Leave now before Zero shoots off those\n                          little raisins you call balls.\n\n               Lamar runs away. Daniel and the others smile at Zero as they pick\n               up their bags and walk towards a building.\n\n               \n\n                                                                           15.\n\n               \n               Zero is left with Sami who stares at him with disbelief.\n\n                                       SAMI\n                          You put a loaded gun in your bag and\n                          brought it through customs? How stupid\n                          is that?\n\n                                       ZERO\n                          Zero did not put it in his bag.    He put\n                          it in yours.\n\n               Zero grins and walks away.\n\n               \n\n               EXT. WAREHOUSE -- MORNING\n\n               The crew stands at a door. Marcel knocks.     A peep-hole in the\n               door is opened and an eye looks them over.\n\n                                       MARCEL\n                          We are looking for Sophie.    Laurant send\n                          us.\n\n               The door is opened by SOPHIE (the girl in the photo on Bastaldi's\n               computer). She is late 20's, beautiful.\n\n                                          SAMI\n                               (softly)\n                          Ouh La La.\n\n               \n\n               INT. SOPHIE'S WAREHOUSE -- MORNING\n\n               An old building, the rooms are partitioned off by sheets hanging\n               from the ceiling. The main area is an artists workspace where\n               large abstract paintings lean against the wall.\n\n                                       SOPHIE\n                          I wasn't expecting this many of you.\n                          I've got a few sleeping bags you can\n                          use.\n\n                                          SAMI\n                          Thanks.\n\n               Of to the side, sitting on the couch is WAYNE, 20's, a burn-out\n               with long hair and a scraggly goatee. His face is buried in a\n               bong as he sucks in a lung full of marijuana. He watches a cartoon\n               show on the television.\n\n                                       SOPHIE\n                               (to all of them)\n                          This is Wayne. My roommate.\n\n               Raymond walks over to him.\n\n                                          RAYMOND\n                          I am Raymond.     Thank you for allowing us\n                          to stay here.\n\n               \n\n                                                                          16.\n\n               \n\n                                       WAYNE\n                          No problem, man.\n                               (offers him the bong)\n                          Hey, you wanna hit?\n\n                                          RAYMOND\n                          No thank you.\n\n               Raymond looks at the television and sees a cartoon show.\n\n                                       RAYMOND\n                          Oh, Pepe Le Pew. He is very funny and\n                          quite well known in France.\n\n                                       WAYNE\n                          Yeah, I dig him.\n\n                                       RAYMOND\n                          Although a cartoon I feel he shares a\n                          universal theme: We are all searching\n                          for love. No?\n\n               Wayne stares at him with a dead pan expression as he tries to\n               assemble a coherent thought.\n\n                                        WAYNE\n                          Whoa...   That's deep.\n\n                                       SOPHIE\n                          You guys hungry?\n\n               \n\n               INT. COFFEE SHOP -- AFTERNOON\n\n               Because of the hour the room is not crowded. Only a few PEOPLE\n               sit at the counter sipping coffee. A WAITRESS, 50's, bee hive\n               hair style, face covered in make up arrives at the table.\n\n                                       WAITRESS\n                          Ready to order?\n\n               Julien looks up at her.\n\n                                       JULIEN\n                          Could we see a wine list please?\n\n                                          WAITRESS\n                               (smirks)\n                          That's cute.\n\n                                       SOPHIE\n                          They don't have a wine list.\n\n                                       JULIEN\n                          Oh, then we will have the house wine.\n\n                                       WAITRESS\n                          Sure -- and would you like that before\n                          your escargot in white truffle sauce?\n\n               \n\n                                                                            17.\n\n               \n\n                                       JULIEN\n                          I did not order escargot.\n\n                                       SAMI\n                          They don't serve wine here.\n\n                                       JULIEN\n                          What kind of restaurant doesn't serve\n                          wine?\n\n                                         SAMI\n                          This kind.\n\n                                         JULIEN\n                          Okay.    I will have a beer.\n\n                                       WAITRESS\n                          I don't think he's grasping the concept.\n                          Iced tea, lemonade, coca cola, sprite or\n                          root beer.\n\n                                       JULIEN\n                               (to the others)\n                          C'est quoi root beer?\n\n                                       DANIEL\n                          He'll have a sprite.    We'll all have\n                          sprite.\n\n                                       WAITRESS\n                          Good. Now that we've gotten the beverage\n                          selection out of the way, dare we move\n                          on to the main course?\n\n                                         ZERO\n                          Idiot.\n\n               Zero grins as he puts a cigarette in his mouth.     The waitress pulls\n               it out of his mouth.\n\n                                       WAITRESS\n                          And no smoking.\n\n                                       ZERO\n                               (in French)\n                          No smoking? No drinking?       What kind of\n                          country is this?\n\n               \n\n                                                                         CUT TO:\n\n               \n\n               CLOSE ON MAN'S FACE.\n               VINNY, 40's, not the brightest bulb on the tree. His head snaps\n               back as someone punches him in the face. Blood flows from his\n               nose. We are in...\n\n               \n\n                                                                           18.\n\n               \n\n               EXT. ALLEY -- AFTERNOON\n\n               Two GANGSTERS stand on each side of Vinny. They are JOEY \"TWO\n               TONS\" 40's, could have a second career as a Sumo Wrestler. NICKY\n               \"THE RAKE\", 30's, thin a rail. They make a strange pair but they\n               both have one thing in common: They are stone cold killers.\n               Standing in front of the them is FRANKIE ZAMMITO, 30's, a wise\n               guy, tough as they come. He wears a well tailored suit, black\n               leather gloves and polished shoes.\n\n                                       VINNY\n                               (frightened)\n                          I'm sorry, Frankie.     Really.\n\n               Vinny gets off his knees and moves towards Zammito.\n\n                                       ZAMMITO\n                          You bleed on me, I'll kill ya.\n\n               Vinny takes a step back.\n\n                                        ZAMMITO\n                          What'd I tell you? Huh, Vinny? What'd\n                          I tell you when you came to me for money?\n                          Didn't I ask you not to do it? Did I\n                          not say that?\n                               (to Joey)\n                          What'd I say to him?\n\n                                       JOEY \"TWO TONS\"\n                          You said don't do it, boss.\n\n                                       ZAMMITO\n                          That's right. I said don't do it. Did\n                          you listen to me? No. You wanted the\n                          money. So, I lent you twenty large.\n                          Now it's been three weeks and you ain't\n                          paid a dime. What do you think that\n                          makes me look like on the street? I\n                          don't do something to you and everyone\n                          will think they can skate.\n\n                                          VINNY\n                          Frankie, I --\n\n                                       ZAMMITO\n                          -- Shut up! Don't you try to make me\n                          feel bad about this. You knew what would\n                          happen to you if you didn't pay. This\n                          is on your head, not mine.\n                               (to Joey and Nicky)\n                          Break his arm.\n\n               Vinny looks up at Zammito through pleading eyes.\n\n                                       VINNY\n                          Jesus, Frankie, I'm your brother!\n\n               \n\n                                                                          19.\n\n               \n\n                                       ZAMMITO\n                          That's why we're only breaking one arm.\n\n               \n\n               INT. COFFEE SHOP -- LATER -- AFTERNOON\n\n               The table is littered with plates.   Sophie has sketched out a\n               diagram of a house on her napkin.\n\n                                       SOPHIE\n                          There's an exterior alarm system. There's\n                          also another one in the hall that leads\n                          to the bedroom with a motion detector.\n                          The control panel is in the bedroom.\n\n                                       JULIEN\n                          I can handle the exterior alarm, but the\n                          one in the bedroom is a problem.\n\n                                       SAMI\n                          After the outside alarm is off we go in\n                          through the bedroom window.\n\n                                       DANIEL\n                               (impressed)\n                          Good. Zero and Julien will go in through\n                          the window and disable the motion\n                          detector. The rest of us will come in\n                          through the front door.\n\n                                       JULIEN\n                          What about transportation?\n\n                                       SOPHIE\n                          You can use my car.\n\n                                       DANIEL\n                          Not a good idea. Someone gets a license\n                          number and it all leads back to you.\n                          Raymond, you'll steal one.\n\n                                        RAYMOND\n                          No problem.\n\n                                       SAMI\n                          When do we go?\n\n                                        SOPHIE\n                          Tonight.\n\n                                        DANIEL\n                          Tonight?\n\n                                       SOPHIE\n                          I know they won't be home tonight.\n\n                                       SAMI\n                          You ever hear of jet lag?\n\n               \n\n                                                                         20.\n\n               \n\n                                           SOPHIE\n                          Take a nap.\n\n               \n\n               EXT. SOPHIE'S WAREHOUSE -- AFTERNOON\n\n               As they crew and Sophie approach the door we hear the muted roar\n               of loud MUSIC.\n\n               \n\n               INT. SOPHIE'S WAREHOUSE -- AFTERNOON\n\n               As the enter the music is even louder. The bass pounds through\n               the walls. Wayne seems oblivious to it as he sits on the couch\n               smoking a joint.\n\n                                       JULIEN\n                          What the hell is that?\n\n                                         WAYNE\n                          Neighbors.    They do this all the time.\n\n                                       SAMI\n                          I can't even hear myself think.\n\n                                       ZERO\n                          How are we supposed to sleep with this\n                          noise?\n\n                                       SOPHIE\n                          I've asked them a hundred times to keep\n                          in down. They don't listen.\n\n                                       RAYMOND\n                          I will talk to them.\n\n               Sophie and Wayne both find his offer amusing.\n\n                                           WAYNE\n                          Yeah.   Right.\n\n                                       SOPHIE\n                          Not a good idea.\n\n                                       RAYMOND\n                          It's just a matter of communication.\n\n               Raymond leaves.\n\n               \n\n               EXT. SIDE OF WAREHOUSE -- AFTERNOON\n\n               Raymond walks towards a door at the end of the building. The MUSIC\n               grows louder. He KNOCKS on the door and waits. It is opened by a\n               very large man... a biker type, leather jacket, full beard, several\n               long earrings hanging from his ear. He is holding a BEER BOTTLE.\n               Behind him are two other rough-looking men.\n\n               \n\n                                                                         21.\n\n               \n\n                                       RAYMOND\n                               (cheerfully; loudly\n                                over the music)\n                          Hello. My name is Raymond. I am visiting\n                          next door and I was wondering if you\n                          could make your music a little less loud.\n\n               The Biker takes a sip of his beer.\n\n                                       BIKER\n                          No.\n\n                                       RAYMOND\n                          But the music is very--\n\n               Before Raymond can finish his sentence the Biker pours his beer\n               over Raymond's head.\n\n                                       BIKER\n                          Fuck off!\n\n               He slams the door in Raymond's face.\n\n               \n\n               INT. SOPHIE'S WAREHOUSE -- MOMENTS LATER -- AFTERNOON\n\n               The music continues to pound through the walls. A soggy Raymond\n               steps into the room. He walks over to a chair and sits down, his\n               head hung down, embarrassed. Marcel is angered by this. He glances\n               over to Daniel who subtly nods to him. Marcel leaves the room.\n\n               \n\n               EXT. SIDE OF WAREHOUSE -- MOMENTS LATER -- AFTERNOON\n\n               Marcel walks purposefully along the side of the building. He\n               reaches into his jacket pocket and removes two black leather gloves.\n               He slips them on as he approaches the door, then knocks. A beat.\n               The Biker opens the door.\n\n                                       BIKER\n                          Listen asshole, I told you --\n\n               Marcel head butts him, slamming his forehead into the bridge of\n               his nose. The Biker clasps his hands over his bleeding nose.\n               Marcel grabs him by the hair and rapidly punches him in face several\n               times -- each punch backing the Biker into the room.\n\n               \n\n               INT. BIKER'S WAREHOUSE -- CONTINUOUS\n\n               On the last punch the Biker falls backwards crashing through a\n               large glass coffee table.\n\n               BIKER #2 moves in behind Marcel and throws a hard punch as Marcel\n               turns around. Marcel bends his head down, so that his attackers\n               fists slams into the hard crown of his skull.\n\n               BIKER #2 painfully grabs his broken knuckles. Marcel knees him\n               hard in the groin. BIKER #2 turns to his side and doubles over.\n               Marcel kicks the man into the back of his knee spinning him around\n               and down on his knees.\n\n               \n\n                                                                          22.\n\n               \n               In a fluid movement he elbows the man in the back of head . BIKER\n               #2 falls face forwards and is out cold.\n               Marcel turns to the third BIKER who is standing by the stereo. He\n               is smaller than the others and has seen enough. He quickly turns\n               off the power. DEAD QUIET.\n\n               \n\n               INT. SOPHIE'S WAREHOUSE -- MOMENTS LATER -- AFTERNOON\n\n               Marcel enters.   Wayne is on the couch with Raymond.\n\n                                       WAYNE\n                               (impressed)\n                          What'd you say to them?\n\n                                          MARCEL\n                               (dryly)\n                          Nothing.\n\n               \n\n               EXT. SOUTH SIDE SOCIAL CLUB -- AFTERNOON\n\n               A plain looking building in an old neighborhood of the city.\n\n               \n\n               INT. SOUTH SIDE SOCIAL CLUB - ZAMMITO'S OFFICE -- AFTERNOON\n\n               Zammito sits at his desk. Joey \"Two Tons\" and Nicky \"The Rake\"\n               sit on the couch. Bobby Beans balding, stocky enters.\n\n                                       ZAMMITO\n                          Hey, Bobby beans... How you doin'?\n\n               He walks up to Zammito and they kiss each other on the cheek.\n\n                                      BOBBY BEANS\n                          Good. I'm doing good. How you doin',\n                          Frankie?\n\n                                        ZAMMITO\n                          Good.   I'm good.\n\n                                       BOBBY BEANS\n                          Mr. Maranzano sends his warmest regards.\n\n                                       ZAMMITO\n                          When you return please extend my regards\n                          to Mr. Maranzano and his family.\n\n               Zammito motions for Bobby to sit down.\n\n                                       ZAMMITO\n                          Can I offer you something.    A drink?\n                          Coffee?\n\n                                          BOBBY BEANS\n                          No thank you.\n\n               \n\n                                                            23.\n\n               \n\n                            ZAMMITO\n               You sure? I just got a shipment of\n               espresso from Sicily. Special blend.\n               Can't find anything like it in the States.\n\n                             BOBBY BEANS\n               I'm good.   Really.\n\n                            ZAMMITO\n               Okay. I understand you're interested in\n               one of our properties?\n\n                            BOBBY BEANS\n               Yeah. That warehouse over on Merchant\n               Street. The volume on our import business\n               has risen dramatically. The proceeds\n               this quarter will be supernumerary due\n               to the --\n\n                            ZAMMITO\n                    (overlapping)\n               -- Super what?\n\n                            BOBBY BEANS\n               Supernumerary. It means better than\n               expected.\n\n                            ZAMMITO\n               Then why not just fuckin' say better\n               than expected? Everybody knows what\n               better than expected means.\n\n                            BOBBY BEANS\n               I'm taking a vocabulary course to enhance\n               my communication skills.\n\n                             ZAMMITO\n               Okay.   How much?\n\n                            BOBBY BEANS\n               I'm not here to negotiate.\n\n                            ZAMMITO\n               Why are you here?\n\n                            BOBBY BEANS\n               To tell you that we're interested in the\n               property.\n\n                            ZAMMITO\n               You told me that on the phone. What the\n               hell are you doing here? Showing off\n               your communication skills? Go back to\n               your people and tell them when they're\n               serious to put a number on the table.\n\n                            BOBBY BEANS\n               I will relay the particulars of our\n               conversation to Mr. Maranzano.\n\n               \n\n                                                                         24.\n\n               \n\n                                       ZAMMITO\n                          Yeah -- you do that.\n\n               Bobby Beans leaves.\n\n                                       ZAMMITO\n                          Jerk-wad!\n\n               Zammito looks over at Joey and Nicky.\n\n                                       ZAMMITO\n                          How's my brother?\n\n                                       NICKY \"THE RAKE\"\n                          He's over at St. James. They had to put\n                          two pins in his arm.\n\n                                       ZAMMITO\n                          I said a clean break.\n\n                                       JOEY \"TWO TONS\"\n                          Hey boss, it's not a science.\n\n                                       ZAMMITO\n                          Send some flowers. Something nice.\n                          Roses or carnations. And one of those\n                          get well soon cards.\n\n               Nicky gets up to carry out his instructions.\n\n                                       ZAMMITO\n                          Oh and uh, send a case of steaks over to\n                          his house. I don't want the kids to go\n                          hungry while he's recuperating.\n\n               \n\n               INT. SOPHIE'S WAREHOUSE -- LATER -- AFTERNOON\n\n               Julien and Zero are playing cards at the back of the room. Sami\n               sitting by himself sorting through a BLACK CANVAS BAG filled with\n               shoes. Sophie joins him. Sami pulls another pair of shoes out of\n               the canvas bag.\n\n                                       SOPHIE\n                          You like shoes?\n\n                                       SAMI\n                          No, I like the bag. It would be good\n                          for the job tonight.\n\n                                       SOPHIE\n                          It belongs to Vincent Bastaldi. He left\n                          it last time he was here. I'm sure he\n                          wouldn't mind if you used it.\n\n               Sami dumps the rest of the shoes out of the bag.\n\n                                       SOPHIE\n                          So, how did you get hooked up with these\n                          guys?\n\n               \n\n                                                                           25.\n\n               \n\n                                       SAMI\n                          Just lucky I guess. How'd you start\n                          working for the Bastaldi's?\n\n                                       SOPHIE\n                          The art world doesn't fully appreciate\n                          my talent yet. I needed some way to pay\n                          the rent. Laurant and Vincent pay well\n                          for information.\n\n                                       SAMI\n                          So you arranged to have the people you\n                          worked for robbed?\n\n                                       SOPHIE\n                          They're not nice people.\n\n               She sees a TATTOO on Sami's arm.    It's a heart with someone's faded\n               name.\n\n                                       SOPHIE\n                          I like your tattoo.\n\n               Sami is suddenly self-conscious of it.    She traces along the letters\n               with her finger.\n\n                                       SOPHIE\n                               (reading the name)\n                          Casandra. Old girlfriend?\n\n                                       SAMI\n                          Something like that.\n\n                                       SOPHIE\n                          Did she break your heart?\n\n                                       SAMI\n                          Something like that.\n\n                                          SOPHIE\n                          It looks old.     Did you get it a long\n                          time ago?\n\n                                       SAMI\n                          You ask a lot of questions.\n\n                                       SOPHIE\n                          That's how you get to know someone.       Did\n                          it hurt when you got it?\n\n                                       SAMI\n                          I don't remember.    I was drunk.\n\n                                       SOPHIE\n                          You got it in a bar?\n\n                                       SAMI\n                          No. I got it in prison. I went in for\n                          three years. When I came out she was\n                          married to my best friend. Happy?\n\n               \n\n                                                                           26.\n\n               \n\n                                        SOPHIE\n                          Sorry.   I didn't mean to pry.\n\n                                        SAMI\n                          It's okay.   It was a long time ago.\n\n                                       SOPHIE\n                          I've been thinking about getting tattoo.\n                          You know, a flower or something. On my\n                          ass.\n\n               Sami looks at her quizzically.\n\n                                       SAMI\n                          Who's gonna see it there?\n\n                                       SOPHIE\n                          The lucky ones.\n\n               She smiles flirtatiously and walks away.\n\n               \n\n               EXT. LIQUOR STORE -- EVENING\n\n               A car drives up. We can only see the outline of an old Chevy\n               Impala. Two men get out of the car, leaving the engine running as\n               they head for the liquor store.\n               Across the street Raymond is checking out a Buick LaSabre, but\n               stops when he sees the flashing alarm light on the dashboard. He\n               looks across the street and sees the Impala.\n\n               \n\n               INT. LIQUOR STORE -- EVENING\n\n               An OLD MAN is behind the counter.   Two masked men enter with guns\n               and rush up to the counter.\n\n                                       RAPHAEL\n                          Gimme the money!\n\n               The old man opens the cash register and hands him all the bills.\n\n                                       RAPHAEL\n                          Open the safe!\n\n                                       OLD MAN\n                          I don't have the combination.\n\n               Raphael pistol whips him with his gun and drags him half way over\n               the counter, then presses his gun to the old man's head.\n\n                                        OLD MAN\n                          I swear!   I don't have it!\n\n               Raphael pushes him to the floor.    He runs out of the store with\n               the others.\n\n               \n\n                                                                         27.\n\n               \n\n               EXT. LIQUOR STORE -- EVENING\n\n               They run out and remove their masks. RAPHAEL RUIZ, 20's, Latin,\n               tough, shaved head, neck covered with tattoos. HECTOR, Latin,\n               small, cubby, stops and stares at something with confusion.\n\n                                       HECTOR\n                          Hey, Vato, where's your car?\n\n               Raphael stops as he sees the street is empty.\n\n                                          RAPHAEL\n                          My car!\n\n               Hector has to grab Raphael who is too stunned to move and drag him\n               down the street.\n\n               \n\n               INT. SOPHIE'S WAREHOUSE -- EVENING\n\n               The crew gets ready. On the table a variety of gear is laid out.\n               Cells phones, electronic devices, all the tools of the trade.\n               Sami throws some items into the black canvas bag. A cell phone\n               rings. Julien answers it.\n\n                                          JULIEN\n                          It's Raymond.     He's outside with the\n                          car.\n\n               They grab their gear and head for the door. Sophie leans over and\n               kisses Sami on the cheek. He stares at her, half surprised, half\n               embarrassed.\n\n                                          SOPHIE\n                          For luck.\n\n               \n\n               EXT. STREET, SOPHIE'S WAREHOUSE -- NIGHT\n\n               The crew steps out to find Raymond in the IMPALA. We can see it\n               clearer now. It's a low rider car. Bright orange flames are\n               painted on the side, wire wheels and chrome exhaust pipes.\n\n                                       SAMI\n                          I'm glad you didn't get something flashy.\n\n                                          RAYMOND\n                          Watch this.\n\n               Raymond pushes a button and the hydraulics make the car bounce up\n               and down. Sami rolls his eyes as the others get into the car.\n               ACROSS THE STREET -- Lamar is standing in the shadows with one of\n               his friends, watching.\n\n               \n\n               INT. IMPALA -- MOVING -- EVENING\n\n               The six of them are crammed into the car as it moves down the\n               street. Julien studies a map.\n\n               \n\n                                                                               28.\n\n               \n\n               INT.   RAPHAEL'S HOUSE -- EVENING\n\n               Raphael sits on the couch. He can barely contain his anger. He\n               looks up slowly, his jaw clenched. Hector sits across from him\n               with a few other GANG BANGERS.\n\n                                        HECTOR\n                           Maybe you should call the police.\n\n                                        RAPHAEL\n                           Hey, idiot -- I've got stolen wheels and\n                           a stolen radio in the car.\n\n                                        HECTOR\n                           I just thought that--\n\n                                        RAPHAEL\n                                (overlapping)\n                           -- Don't think. Okay?        You're not good\n                           at it.\n\n               The other Gang Bangers laugh at Hector.\n\n                                        RAPHAEL\n                           Go do something -- get some beers for\n                           the guys.\n\n               Hector slinks out of the room.        Raphael's face hardens.\n\n                                        RAPHAEL\n                           When I find out who did this I'm going\n                           to mount their head on my dashboard!\n\n               \n\n               INT. ITALIAN RESTAURANT -- EVENING\n\n               A family operation. Checkerboard table clothes. Candles burning\n               in Chianti bottles. On the stereo VIC DAMONE sings \"Angela Mia\".\n               Zammito waits at a table. His cell phone rings.\n\n                                           ZAMMITO\n                                   (into phone)\n                           Yeah?\n\n                                        HALF TOOTH TONY (V.O.)\n                           Mr. B. wants to see you.\n\n                                       ZAMMITO\n                           Now? I've got a date with a drop dead\n                           major babe.\n\n                                        HALF TOOTH TONY (V.O.)\n                           I'll tell him that.\n\n               Zammito thinks it over.\n\n                                          ZAMMITO\n                           Okay.    I'm coming.\n\n               He walks over to the MARIO, the OWNER of the restaurant.\n\n               \n\n                                                                         29.\n\n               \n\n                                       ZAMMITO\n                          Mario, I gotta go. When my date arrives\n                          tell her I had an emergency.\n\n                                       MARIO\n                          Of course, Mr. Zammito.\n\n               \n\n               EXT. WRIGLEY FIELD STADIUM -- NIGHT\n\n               The Impala is stopped in the parking lot.\n\n                                       RAYMOND (V.O.)\n                          I think we went the wrong way.\n\n                                       SAMI (V.O.)\n                          Oh, you think?\n\n                                       MARCEL (V.O.)\n                          The map said to go left.\n\n                                       JULIEN (V.O.)\n                          Yeah and if you turned it around it would\n                          say to go right.\n\n                                          MARCEL (V.O.)\n                               (amused)\n                          Oh yeah.\n\n               \n\n               INT. BONANNO'S HOUSE, STUDY -- EVENING\n\n               Zammito enters to find ANGELO BONANNO, 60's, powerful, head of the\n               Chicago Mob. He is smoking a cigar with a glass of brandy.\n\n                                       BONANNO\n                          Frankie, come in. Good to see you.      You\n                          want something?\n\n                                       ZAMMITO\n                          No, I'm good, Angelo.\n\n               Bonanno motions to the couch.    Zammito sits down.\n\n                                       BONANNO\n                          I understand Bobby Beans came to see you\n                          today.\n\n                                       ZAMMITO\n                          Yeah. Seems Maranzano wants to talk\n                          about buying the Merchant Street\n                          warehouse.\n\n                                          BONANNO\n                          And?\n\n                                          ZAMMITO\n                          And nothing.     He's just feeling us out.\n\n               \n\n                                                                         30.\n\n               \n\n                                       BONANNO\n                          He's trying to get a foot hold in our\n                          territory.\n\n                                       ZAMMITO\n                          He sticks his toes in the water again,\n                          we'll cut 'em off.\n\n                                       BONANNO\n                          Business must be good if he can afford\n                          to buy up useless property.\n\n                                       ZAMMITO\n                          I heard this quarter his profits are\n                          gonna be supernumerary.\n\n               Bonanno stares at him.\n\n                                       BONANNO\n                          They're gonna be what?\n\n                                       ZAMMITO\n                          Supernumerary. It means better than\n                          expected.\n\n                                         BONANNO\n                          Good word.\n\n               Half Tooth Tony, 30's, built like a tank step into the room. He\n               has the face of a boxer, several of his teeth are chipped or broken.\n\n                                       HALF TOOTH TONY\n                          Mr. Bonanno, I just wanted to remind you\n                          that you have an appointment in ten\n                          minutes.\n\n               Half Tooth Tony leaves.\n\n                                       ZAMMITO\n                          Someone else coming?\n\n                                       BONANNO\n                          Nah, that's just Tony's way of telling\n                          me Judge Judy starts in ten minutes.\n                          You ever watch it?\n\n                                         ZAMMITO\n                          Uh, no --\n\n                                       BONANNO\n                          You should. You can learn a lot about\n                          the criminal justice system on a program\n                          like that. Very informative. Stay and\n                          watch it with me.\n\n                                       ZAMMITO\n                          You know, I'm kind of tired. I'm just\n                          gonna go home if it's all the same to\n                          you.\n\n               \n\n                                                                         31.\n\n               \n               Bonanno affectionately slaps Zammito's cheeks.\n\n                                        BONANNO\n                          Go.   Rest.\n\n               Bonanno takes a sip of his brandy, but his eyes stay on Zammito.\n\n                                        BONANNO\n                          Oh Frankie, what's this I hear about\n                          your brother?\n\n                                       ZAMMITO\n                          He missed three weeks.\n\n                                       BONANNO\n                          Your own brother? You couldn't send\n                          someone else to do it?\n\n                                       ZAMMITO\n                          I did. Joey \"Two Tons\" and Nicky \"The\n                          Rake\" did the deed.\n\n                                       BONANNO\n                          But you were there?\n\n                                       ZAMMITO\n                          Angelo, we live and die by the rules we\n                          make. We are men of honor, but honor\n                          without respect is a... horse-less\n                          carriage.\n\n               A long beat. Bonanno thinks about what he said, not sure what to\n               make of it, then...\n\n                                       BONANNO\n                          What the fuck does that mean?\n\n               \n\n               EXT. STREET -- NIGHT\n\n               The Impala is by the pumps. Sami leans out the window holding the\n               map as he speaks with the station attendant.\n\n               \n\n               EXT. RESIDENTIAL STREET -- NIGHT\n\n               An upscale neighborhood. Expensive homes line the wooded street.\n               The Impala stops and the crew gets out.\n\n                                       DANIEL\n                               (to Raymond)\n                          Park on the next street over.   We'll\n                          meet you when we're done.\n\n               \n\n               EXT. ZAMMITO'S HOUSE -- NIGHT\n\n               Julien attaches a device to the alarm panel. A series of numbers\n               flash by as the computer cracks the code. One by one, the numbers\n               stop until the entry code is displayed on the screen. He enters\n               the numbers on the alarm and nods to the others.\n\n               \n\n                                                                           32.\n\n               \n               Julien and Zero move around to the side of the house as Daniel,\n               Sami and Marcel wait in the shadows.\n\n               \n\n               EXT. ZAMMITO'S HOUSE, SIDE OF HOUSE -- NIGHT\n\n               Julien places a retractable ladder against the wall and climbs up.\n               He pries open the window and climbs in. Zero follows.\n\n               \n\n               INT. ZAMMITO'S HOUSE, BEDROOM -- NIGHT\n\n               Dark. Julien makes his way to the door and repeats the process\n               with another alarm panel. Zero sits on the corner of the bed and\n               waits patiently. Julien turns off the hall alarm and nods to Zero.\n               Zero speed dials a number on his cell phone.\n\n                                       ZERO\n                          We're in.\n\n               \n\n               EXT. ZAMMITO'S HOUSE -- NIGHT\n\n               Daniel uses a locksmith tool and quickly pries the lock out of the\n               door. They go inside.\n\n               \n\n               INT. ZAMMITO'S BEDROOM -- NIGHT\n\n               Julien and Zero wait for them. We hear a toilet flush. The door\n               to the bathroom opens and a man steps out. In an instant Julien\n               and Zero jump him. The others enter and quickly join in to subdue\n               the man.\n\n               \n\n               EXT. STREET -- NIGHT\n\n               Raymond waits in the Impala.    He can't resist using the hydraulics,\n               raising the car up and down.\n\n               \n\n               INT. ZAMMITO'S BEDROOM -- NIGHT\n\n               The lights are on. The room is an interior designers nightmare.\n               Clashing colors, zebra skin bedspread. We move along Daniel, Sami,\n               Marcel, Julien and Zero as they stare at something.\n               THEIR POV -- Tied to a chair, his mouth taped shut, is a very angry\n               Frankie Zammito. He yells, his voice muffled by the tape, but\n               it's not hard to understand what he's saying.\n\n                                       DANIEL\n                          So much for no one being home.\n\n               Julien goes to a bookcase and finds the safe.\n\n                                       JULIEN\n                          At least they got this right.\n\n               He removes his tools and goes to work. Sami stares at Zammito\n               with vague recognition, then turns to the others.\n\n               \n\n                                                                            33.\n\n               \n\n                                       SAMI\n                          We've got to be careful not to use our\n                          real names while we're in here.\n\n                                          DANIEL\n                          Good idea.\n\n                                       SAMI\n                          I'll be Elvis and you--\n\n                                       MARCEL\n                               (overlapping)\n                          -- I want to be Elvis.\n\n                                          SAMI\n                          It's my idea.\n\n                                       MARCEL\n                               (whining)\n                          C'mon, I look more like Elvis than you\n                          do.\n\n                                        SAMI\n                          Okay.   You can be Elvis.\n\n               Marcel smiles happily.\n\n                                       SAMI\n                          And the rest of us are...    John, Paul,\n                          George and Ringo.\n\n               Marcel sees an autographed baseball on the book shelf.\n\n                                       MARCEL\n                          Hey, Barry Bonds. The home run king.\n\n               Marcel tosses the ball into the black canvas bag.     Daniel stares\n               at him.\n\n                                       MARCEL\n                          It's for my nephew.\n\n               \n\n               INT. HOUSE ACROSS THE STREET -- NIGHT\n\n               A surveillance operation. Two FBI agents sit near the window.       A\n               small card table is littered with coffee cups. SPECIAL AGENT\n               AGENT HADLEY, 40's, a hardened field agent, picks up a pair of\n               binoculars and looks out the window.\n\n               HIS POV - THROUGH THE BINOCULARS:    of Zammito tied to the chair\n               and surrounded by the others.\n\n                                       AGENT HADLEY\n                          Looks like Zammito's being robbed.\n\n                                       FBI AGENT\n                          Should I call C.P.D.?\n\n               \n\n                                                                         34.\n\n               \n\n                                       AGENT HADLEY\n                          Yeah, but tell them not to move until\n                          these morons come out of the house.\n\n               \n\n               INT. ZAMMITO'S BEDROOM -- NIGHT\n\n               BLACK SCREEN. From inside the safe we see Julien open the door.\n               Daniel and Julien look inside. There are a several stacks of cash,\n               envelopes and a small cardboard box. Julien starts removing\n               everything and puts it into the bag canvas bag.\n\n                                       JULIEN\n                          Where are the jewels?   There aren't any\n                          jewels.\n\n               Marcel looks as surprised as they are.\n\n                                       MARCEL\n                          There has to be.\n\n                                       JULIEN\n                          I'm telling you I've pulled out everything\n                          in the safe. There aren't any jewels.\n\n                                       MARCEL\n                          There must be half a million dollars\n                          here though.\n\n                                       DANIEL\n                          Marcel, we came here for jewels, remember?\n               Sami moves closer to Zammito, studying his face. He moves over to\n               the dresser where there are several photographs of Zammito with\n               various famous people. Next to the photographs is a plaque that\n               reads: TO FRANCIS ZAMMITO...\n\n               We can see the color drain from Sami's face. He glances over at\n               Zammito whose eyes are locked on his. Sami grabs Daniel and Marcel\n               and pulls them aside.\n\n                                        SAMI\n                               (babbling nervously)\n                          We have a problem. Problem isn't the\n                          right word. Dilemma. No that really\n                          doesn't describe --\n                               (flatly)\n                          Do you know who that is?\n\n                                        MARCEL\n                          Mr. Taylor?\n\n                                       SAMI\n                          No, that's not Mr. Taylor.\n\n                                       DANIEL\n                               (sensing something\n                                bad is coming)\n                          It's not?\n\n               \n\n                                                                             35.\n\n               \n\n                                       SAMI\n                          That's Frankie Zammito.   The Under boss\n                          of the Chicago Mafia.\n\n                                       MARCEL\n                               (confused)\n                          Why would they want us to rob the Mafia?\n\n                                       SAMI\n                               (screaming)\n\n                          WE'RE IN THE WRONG HOUSE, YOU FUCKIN'\n\n                          IDIOT!\n\n               A beat. The three of them turn and look at Zammito. The\n               seriousness of the situation finally dawns on Marcel. He moves\n               over to Zammito and rips the tape off his mouth.\n\n                                       MARCEL\n                          Mr. Zammito, there seems to have been a\n                          big mistake here. May I use your phone?\n\n                                         ZAMMITO\n                          Feel free.\n\n               Marcel picks up the cordless phone and dials.\n\n               \n\n                                                                  QUICK CUT TO:\n\n               \n\n               INT. BASTALDI'S BEDROOM - EARLY MORNING\n\n               Bastaldi removes a sleep mask and answers the phone.\n\n                                         BASTALDI\n                          Hello?\n\n                                        MARCEL (V.O.)\n                               (in French)\n                          It's Elvis...\n\n                                         BASTALDI\n                          Who?\n\n                                       MARCEL (V.O.)\n                               (in French)\n                          It's me...\n\n                                         BASTALDI\n                          Marcel?\n\n               \n\n                                                                     CUT BACK TO:\n\n               \n\n               INT. ZAMMITO'S BEDROOM -- NIGHT\n\n               Marcel continues his conversation.\n\n                                         MARCEL\n                                 (in French)\n                          Yes.\n                                         (More)\n\n               \n\n                                                                       36.\n\n               \n                                       MARCEL (Cont'd)\n                          We went to the address we were given and\n                          had to tie up the owner of the house who\n                          turns out to be some Mafia guy.\n\n                                       BASTALDI (V.O.)\n                               (in French)\n                          You're there now?\n\n                                         MARCEL\n                          Oui.\n\n                                       BASTALDI\n                               (in French)\n                          You're calling me on your cell phone,\n                          right?\n\n                                         MARCEL\n                          No.\n\n                                       BASTALDI (V.O.)\n                               (in French)\n                          You're calling me on is phone?\n\n                                         MARCEL\n                          Oui.\n\n                                       BASTALDI (V.O.)\n                               (in French)\n                          My number's going to show up on his bill!\n\n                                       MARCEL\n                               (In French)\n                          Should I call you back?\n\n               We can hear Bastaldi sigh over the line.\n\n                                       BASTALDI (V.O.)\n                               (in French)\n                          You've already robbed the safe?\n\n                                         MARCEL\n                          Oui.\n\n                                       BASTALDI (V.O.)\n                               (in French)\n                          Take what you've got and get out of there.\n\n               Bastaldi hangs up.   The line goes dead.\n\n                                       ZAMMITO\n                          Walk out of here with nothing and I'll\n                          forget this ever happened.\n\n                                         SAMI\n                          Yeah. Right.     You're not a vendetta\n                          kind of guy.\n\n               \n\n                                                                            37.\n\n               \n\n                                       ZAMMITO\n                          I'll find you. No matter where you go\n                          I'll find you.\n\n                                       DANIEL\n                          You don't carry the same weight in France\n                          as you do here.\n\n               Marcel whispers into Daniel's ear.\n\n                                       MARCEL\n                          You think it's smart to tell him we're\n                          French?\n\n                                       DANIEL\n                          I think he's already figured that out.\n\n               Zero who has been standing quietly by the window sees something\n               across the street. A flash. Light reflecting off glass. He takes\n               a pair of night vision binoculars out of one of the bags and looks\n               out the window.\n               ZERO'S POV -- of Agent Hadley and the other FBI Agent watching\n               him.\n\n                                       ZERO\n                          We are being watched.\n               Daniel grabs the binoculars and looks.\n\n                                          DANIEL\n                          Cops?\n\n                                       ZAMMITO\n                          FBI. They've been there for months.\n                          Think I don't know. Morons.\n\n               Daniel closes the curtains. He tries to think. The crew huddles\n               together in the corner, speaking softly so Zammito can't hear them.\n\n                                       JULIEN\n                          What do we do?\n\n                                       MARCEL\n                          I was told to take what we have and go.\n\n                                        JULIEN\n                          Go where?   The police are outside.\n\n               Daniel looks at the others.\n\n                                       DANIEL\n                          If we do this we all have to agree.\n\n               Marcel and Zero nod.   Daniel looks to Julien who appears indecisive.\n\n                                          JULIEN\n                          I don't know.     Maybe if we did just leave --\n\n               \n\n                                                                          38.\n\n               \n\n                                       SAMI\n                          C'mon, get real, will you. You think\n                          he's just going to forget about this?\n                          These guys are all about respect. All\n                          about honor. He's coming after us, so\n                          we might as well take the money.\n\n               Julien nods.   Sami walks over and grabs the black canvas bag.\n\n                                       ZAMMITO\n                          You're all dead.\n\n               Zero grins then tapes his mouth closed again.\n\n               \n\n               EXT. BACK OF HOUSE -- NIGHT\n\n               The crew goes out the back door and climb over a fence.\n\n               \n\n               EXT. STREET -- NIGHT\n\n               The crew arrives to find Raymond still playing with the hydraulics\n               of the Impala. They get in.\n\n               \n\n               EXT. SOPHIE'S WAREHOUSE -- NIGHT\n\n               The Impala pulls into a driveway and goes to the rear of the\n               building, out of view from the street.\n\n               \n\n               EXT. SOPHIE'S FRONT DOOR -- NIGHT\n\n               The crew waits as the door is unlocked.   Wayne opens the door in a\n               stoned haze.\n\n               \n\n               INT. SOPHIE'S WAREHOUSE -- NIGHT\n\n               The crew places their equipment on the table.\n\n                                       SOPHIE (V.O.)\n                          Wayne, who is it?\n\n               She enters and appears surprised to see them.\n\n                                       SOPHIE\n                          I wasn't expecting you guys back so fast.\n                          How'd it go?\n\n               She quickly notices their angry expressions.\n\n                                       SAMI\n                          How'd it go? I don't know.     Daniel, how\n                          would you say it went?\n\n                                       DANIEL\n                          I would have to say... pretty fuckin'\n                          bad. You gave us the wrong address\n                          Sophie.\n\n               \n\n                                                                         39.\n\n               \n\n                                          SOPHIE\n                          No, I didn't.\n\n                                       JULIEN\n                          Bastaldi got the address from you, yes?\n\n                                          SOPHIE\n                          Yes.\n\n                                       JULIEN\n                          And he gave it to us.    145 Ridgeway Road.\n\n                                         SOPHIE\n                          No.    145 Ridgeroad Way.\n\n                                          DANIEL\n                          That moron.\n\n                                       MARCEL\n                          It was an honest mistake. Ridgeway...\n                          Ridgeroad... Ridgeway Road.\n\n                                       DANIEL\n                          Everyone get some sleep.    We're leaving\n                          in the morning.\n\n               \n\n               INT. SURVEILLANCE HOUSE -- NIGHT\n\n               Agent Hadley checks his watch.\n\n                                       AGENT HADLEY\n                          What the hell are they doing in there?\n\n                                       FBI AGENT\n                          Chicago P.D. says they can't hold the\n                          units here any longer. They want to\n                          know if they should go in?\n\n               Agent Hadley thinks a moment.\n\n                                          AGENT HADLEY\n                          Tell them no.     We'll advise if anything\n                          changes.\n\n               \n\n               INT. ZAMMITO'S BEDROOM -- NIGHT\n\n               Zammito is still tied to his chair.\n               HIS POV -- of the cordless phone of his bed.\n               He pushes with his feet, sliding the chair over to the bed, then\n               starts rocking back and forth until he tips over forward, his face\n               pressed against the mattress. Using his nose he turns on the phone\n               and presses a speed dial number.\n\n               \n\n                                                                          40.\n\n               \n\n               INT. JOEY TWO TONS BEDROOM -- NIGHT\n\n               Joey \"Two Tons\" is asleep in a sleeveless tee shirt. Next to him\n               is his wife, her hair in curlers, her eyes covered by a black sleep\n               mask. The phone rings. Joey answers it.\n\n                                         JOEY \"TWO TONS\"\n                          Yeah?\n\n               We hear Zammito's muffled cries for help. It almost sounds like\n               someone moaning during a sexual act. Joey is surprised at first,\n               then glances over at his wife to make sure she is asleep. He slides\n               his hand under the covers and closes his eyes.\n\n                                       JOEY \"TWO TONS\"\n                               (quietly)\n                          Hmmm.... Oh yeah... Uh huh\n\n               \n\n               INT. ZAMMITO'S BEDROOM -- CONTINUOUS\n\n               Zammito stops as he begins to realize what Joey is doing on the\n               other end of the line. He grimaces, then shouts louder.\n\n               \n\n               INT. JOEY TWO TONS BEDROOM -- CONTINUOUS\n\n               Joey is really going to town now as his hand moves slowly under\n               the covers. We hear a loud scream on the phone.\n\n                                       JOEY \"TWO TONS\"\n                          That's right baby, give it to papa Joey.\n\n               He is really deep into his fantasy world when...\n\n                                       JOEY \"TWO TONS\" WIFE\n                          Joey, who is that?\n\n               Joey sits up quickly.\n\n                                       JOEY \"TWO TONS\"\n                               (loudly; for his wife's\n                                sake)\n                          -- And don't call here again, you pervert.\n\n               He slams the phone down. A long beat. It rings again. This time\n               he checks his caller ID and sees that call is coming from Zammito's\n               house.\n\n                                         JOEY \"TWO TONS\"\n                          Yeah boss?\n\n               Again we hear the same muffled cries.\n\n                                         JOEY \"TWO TONS\"\n                          Boss?\n\n               \n\n               INT. BODY SHOP -- NIGHT\n\n               Raphael enters with Hector and two GANG-BANGERS.   The room is filled\n               with low rider cars.\n\n               \n\n                                                                            41.\n\n               \n               Working under the hood of a car is FELIX, 30's, sleazy. Raphael\n               walks over and slams the hood down, pinning Felix's upper body and\n               squishing his face between the hood and engine.\n\n                                       RAPHAEL\n                          Someone stole my car tonight!\n\n                                       FELIX\n                          C'mon Raphael, you don't think that I\n                          would steal your car?\n\n                                       RAPHAEL\n                          You run a chop shop for low riders.\n                          Yes, I think you'd steal my car.\n\n               Raphael lifts up the hood and slams it down on Felix again.\n\n                                       FELIX\n                          I swear I didn't. I wouldn't!\n\n                                       RAPHAEL\n                          And I should just believe--\n\n                                       HECTOR\n                               (overlapping; to Felix)\n                          -- you stole my cousin Enrique's car.\n\n                                       RAPHAEL\n                               (to Hector)\n                          Hector, don't interrupt me.\n\n                                       HECTOR\n                          He told Enrique he didn't know anything\n                          about his car.\n\n                                       RAPHAEL\n                          I don't give a shit about your cousin's\n                          car. We're here about my car. So, shut\n                          your mouth! You think you can do that?\n                          You think you can keep your big mouth\n                          shut?\n\n               Hector is embarrassed as Raphael once again berates him in front\n               of the others. Raphael picks up a pair of pliers of the workbench.\n               He clamps them down on the tip of Felix's nose and squeezes.\n               Felix's face fills with pain.\n\n                                       RAPHAEL\n                          If I find out you're lying. If I find\n                          out you know anything about this I'm\n                          going to come back and cut off your nose.\n\n               He gives the pliers one last squeeze, then releases Felix.\n\n                                       RAPHAEL\n                               (to the others)\n                          Vamos.\n\n               \n\n                                                                            42.\n\n               \n\n               INT. SURVEILLANCE HOUSE -- NIGHT\n\n               Agent Hadley sips a cup of warm coffee.     He looks very concerned.\n\n                                       FBI AGENT\n                          Sir, do you think we could have a hostage\n                          situation in there?\n\n               Agent Hadley is about to answer when he sees something.\n               HIS POV -- of a Lincoln Town Car pull up.    Joey \"Two Tons\" gets\n               out, goes to the front door and enters.\n\n                                       AGENT HADLEY\n                          Hold on a second. Joey \"Two Tons\" just\n                          pulled up.\n\n               \n\n               INT. ZAMMITO'S BEDROOM -- NIGHT\n\n               Joey enters to find Zammito tied to the chair, face down on the\n               bed.\n\n                                         JOEY \"TWO TONS\"\n                          Jesus, Boss!\n\n               \n\n               INT. ZAMMITO'S LIVING ROOM -- NIGHT\n\n               Zammito stands behind the bar pouring himself a large scotch.\n\n                                       ZAMMITO\n                          They were all French guys.\n\n                                         JOEY \"TWO TONS\"\n                          French guys?    You mean like from France?\n\n                                       ZAMMITO\n                               (with strained patience)\n                          Yeah, French guys from France.\n\n                                       JOEY \"TWO TONS\"\n                          What'd they take?\n\n                                         ZAMMITO\n                          Everything.\n\n                                         JOEY \"TWO TONS\"\n                          Everything?\n\n                                         ZAMMITO\n                          Everything.\n\n                                       JOEY \"TWO TONS\"\n                          Boy, you must be pissed.\n\n                                       ZAMMITO\n                          Well, you know, when five guys break\n                          into my house in the middle of the night,\n                          stick guns in my face, tie me up and\n                          steal from me... it does irritate me.\n\n               \n\n                                                                         43.\n\n               \n\n                                       JOEY \"TWO TONS\"\n                          Well, I must say you're handling it very\n                          well.\n\n                                       ZAMMITO\n                          You know why I'm handling it very well?\n                          Because you're going to get these guys\n                          for me.\n\n                                        JOEY \"TWO TONS\"\n                          Okay boss.   Where are they?\n\n                                       ZAMMITO\n                          If I knew where they were you wouldn't\n                          have to find them, would you?\n\n                                       JOEY \"TWO TONS\"\n                          You didn't say find them. You said,\n                          \"get them.\"\n\n                                       ZAMMITO\n                          Just find them!\n\n                                         JOEY \"TWO TONS\"\n                          Okay boss.\n\n               Zammito stares at Joey for a long beat, then...\n\n                                         ZAMMITO\n                          Papa Joey?\n\n               Joey looks away, embarrassed.\n\n               \n\n               INT. SOPHIE'S WAREHOUSE -- NIGHT\n\n               Sami can't sleep. He walks over to the table and sorts through\n               the canvas bag containing the contents of Zammito's safe. Inside\n               a small cardboard box he finds several cassette tapes. He removes\n               the box and walks to the stereo system on the floor, then inserts\n               a tape into the cassette deck. A moment later Sophie enters.\n\n                                         SOPHIE\n                          Can't sleep?\n\n                                         SAMI\n                          No.\n\n                                       SOPHIE\n                          I'm sorry things went so wrong today.\n\n                                       SAMI\n                          It's not your fault.\n\n               She notices the box of tapes.\n\n                                       SOPHIE\n                          What are you doing?\n\n               \n\n                                                                              44.\n\n               \n\n                                         SAMI\n                            I thought I'd listen to some of the tapes.\n                            See what's so important that a mob guy\n                            has to lock it away in his safe.\n\n                                         SOPHIE\n                            Sounds boring.\n\n                                         SAMI\n                            It's three in the morning.    Not much\n                            else to do.\n\n               She grins seductively, then leans in towards him.\n\n                                         SOPHIE\n                            I can think of something.\n               They kiss.\n\n               \n\n               INT. SOPHIE'S WAREHOUSE -- MORNING\n\n               Sami is asleep on the floor, curled up under several blankets. He\n               wakes up and looks to his side expecting to find Sophie. She is\n               not there. Sami looks around for her.\n               Wayne is sitting on the couch preparing his morning joint.\n\n                                         WAYNE\n                            She's not here, man.\n\n                                            SAMI\n                            Where is she?\n\n                                         WAYNE\n                            I think she went to do some laundry.\n                            Threw some stuff in a bag and left.\n\n               It takes a moment for Sami to connect the thoughts.\n\n                                            SAMI\n                            Bag?\n               Sami runs to the table.      The black canvas bag is gone.\n               CLOSE ON DANIEL:    Asleep.    Sami shakes him.   He opens his eyes.\n\n                                          SAMI\n                            Get up.   We've been ripped off!\n\n               \n\n               INT. SOPHIE'S WAREHOUSE -- MOMENTS LATER\n\n               Daniel and Sami are with the crew. They are not a happy bunch.\n               Wayne is smoking his joint, his eyes locked on the television.\n\n                                         JULIEN\n                            Oh, man... this is bullshit!    You can't\n                            trust anyone these days.\n\n               \n\n                                                                          45.\n\n               \n\n                                       RAYMOND\n                          She took everything!    Didn't even leave\n                          us cab fare.\n\n               A thought occurs to Sami.\n\n                                       SAMI\n                          Not everything.\n\n               He removes the tape he put in the cassette deck last night before\n               Sophie entered.\n\n                                       SAMI\n                          I was going to listen to it last night\n                          but I --\n\n               He realizes it may not be the time to tell them what happened.\n\n                                       SAMI\n                          -- feel asleep.\n\n               Wayne blurts out a sloppy laugh.\n\n                                       WAYNE\n                          No you didn't, dude. You were bangin'\n                          Sophie. I saw you guys going at it.\n\n                                       DANIEL\n                          You slept with her?\n\n                                       SAMI\n                          Well, actually I would say she slept\n                          with me.\n\n               Daniel stares at him angrily.\n\n                                       SAMI\n                          What's the big deal? It's not like I\n                          was on guard duty or something.\n\n                                       DANIEL\n                          You didn't think it was little suspicious\n                          that someone you only knew for a few\n                          hours wanted to sleep with you?\n\n                                        SAMI\n                          No.   Chicks dig me.\n\n               Daniel grabs the cassette and puts it in the player.   On the tape\n               we hear a phone ringing.\n\n                                        MAN'S VOICE\n                          Hello?\n\n                                       ZAMMITO'S VOICE\n                          It's me. I need an answer from you if\n                          I'm going to move.\n\n               \n\n                                                                         46.\n\n               \n\n                                       MAN'S VOICE\n                          We're not just talkin' about a 'piece of\n                          work' here. We're talking about a boss.\n\n               Sami is the first to realize what he is hearing.\n\n                                         SAMI\n                          Holy shit.\n\n                                         RAYMOND\n                          What?\n\n               Sami holds his hand signaling them to be quiet so he can hear the\n               rest.\n\n                                       ZAMMITO'S VOICE\n                          Bonanno's a dinosaur. Guy thinks he's\n                          fuckin' Vito Corleone or something. The\n                          old ways are gone. If we don't change\n                          now we're going to get pushed out. I\n                          need to know if I can count on your\n                          support?\n\n               A pause on the line.\n\n                                         MAN'S VOICE\n                          Yeah.\n\n               The line goes dead.    Sami leans back.\n\n                                       SAMI\n                          No wonder Zammito didn't want us to walk\n                          out with this stuff. He's planning on\n                          killing Bonanno and taking over the\n                          family.\n\n                                       JULIEN\n                          This wasn't the deal! The deal was to\n                          steal a necklace, not get in the middle\n                          of a Mafia war.\n\n                                       MARCEL\n                          The deal is whatever Mr. Bastaldi says\n                          it is.\n\n                                       DANIEL\n                          You know, if you could get your nose out\n                          of Bastaldi's ass for two seconds you\n                          might see what's going on around you.\n\n                                       JULIEN\n                          I knew this was a mistake! I knew it\n                          last night when you asked me to go along\n                          with this. I could hear that little\n                          voice in my head saying, \"don't do it!\n                          Don't you do it!\" Jesus, why don't I\n                          ever listen to myself?\n\n               \n\n                                                                         47.\n\n               \n\n                                       SAMI\n                          Yeah, but you did do it.   So let's deal\n                          with that.\n\n                                       MARCEL\n                          What are you guys so scared of? Zammito\n                          doesn't know who we are. We just get\n                          out of town and it's over.\n\n                                       ZERO\n                          Oh, you think it's that easy?\n\n                                        RAYMOND\n                          Yeah.   We just go home.\n\n                                        DANIEL\n                          We can't.\n\n                                       RAYMOND\n                          I agree with Marcel. I say we go to the\n                          airport and get on a plane.\n\n                                       SAMI\n                          They'll be waiting for us at the airport.\n\n                                       DANIEL\n                          You steal some money from a man he gets\n                          over it in time. But these tapes. He's\n                          never going to stop looking for us.\n\n                                       SAMI\n                          We have to find Sophie.\n\n                                       RAYMOND\n                          How are we going to do that?\n\n                                       WAYNE\n                          I know where she went.\n\n               They all look over at him as he takes a huge hit off his joint.\n\n                                       WAYNE\n                          I heard her talking on the phone. Bay\n                          View Motel. It's about five blocks from\n                          here.\n\n               \n\n               EXT. STREET -- MORNING\n\n               A beat up Ford Pinto sputters down the street, black smoke spewing\n               from the tail pipe.\n\n               \n\n               INT. PINTO -- MOVING -- MORNING\n\n               Raphael is at the wheel, his eyes scanning the street for his car.\n               In the passenger seat Hector sits calmly. They come to a red light\n               and stop.\n               RAPHAEL'S POV -- Across the street is low rider car.\n\n               \n\n                                                                             48.\n\n               \n               Raphael stares at it as he thinks about his own car.\n               ON HECTOR. We see the Impala pull up beside them.       Raymond is\n               driving. Daniel, Sami and Zero are with him.\n               Hector glances over and sees the Impala. Raymond smiles at him\n               and nods. Hector slowly nods back. He looks over at Raphael who\n               is still looking out the window.\n               The light turns green. The Impala turns right.     Raphael looks\n               over at a confused Hector.\n\n                                       RAPHAEL\n                          Tell me the truth Hector... do you think\n                          we'll find my car?\n\n                                         HECTOR\n                          Hard to say.\n\n               \n\n               EXT. BAY VIEW MOTEL -- MORNING\n\n               A motel like any other.   Sami stands outside the office with Daniel,\n               Raymond and Zero.\n\n                                       RAYMOND\n                          How do we know what room she's in?\n\n                                         SAMI\n                          Wait here.\n\n               \n\n               INT. OFFICE -- BAY VIEW MOTEL -- MORNING\n\n               Sami enters.   Behind the counter is the MOTEL CLERK, middle-aged,\n               balding.\n\n                                       SAMI\n                          Hi. Did a woman just check in? She's\n                          about five six. Pretty. Dark hair.\n\n                                       MOTEL CLERK\n                          I can't give out information on our\n                          guests.\n\n                                       SAMI\n                          C'mon man, I think she's having an affair.\n\n                                       MOTEL CLERK\n                          So are half the people in this place.    I\n                          can't help you, pal.\n\n               Sami nods and walks outside. Through the window we see him talking\n               with the others. A beat. Sami steps back inside with Zero.\n\n                                       MOTEL CLERK\n                          Look, I can't tell you --\n               Before he can finish the sentence Zero has his gun out and wedged\n               under the clerks jaw.\n\n               \n\n                                                                         49.\n\n               \n\n                                       MOTEL CLERK\n                          Room fourteen.\n\n                                          ZERO\n                          Thank you.\n\n               \n\n               EXT. MOTEL ROOM -- MORNING\n\n               Sami knocks. The others stand off to the side of the door. Sophie\n               opens the door and sees Sami. Before she can slam it he pushes it\n               open.\n\n               \n\n               INT. MOTEL ROOM -- MORNING\n\n               Sami pushes her onto the bed.\n\n                                       SAMI\n                          I really thought we had something special\n                          going. I can't tell you what a\n                          disappointment you've turned out to be.\n\n                                       SOPHIE\n                          After last night I could say the same\n                          for you.\n\n               Sami feigns a smile. Zero checks the bathroom to make sure she is\n               alone. He looks at Daniel and shake his head. Raymond finds the\n               black canvas bag on the dresser and checks the contents.\n\n                                       RAYMOND\n                          The money isn't here.\n\n                                       SAMI\n                          Where is it, Sophie?\n\n                                          SOPHIE\n                          I don't know.\n\n                                       DANIEL\n                          If you think because you're a women this\n                          can't go hard on you, think again.\n\n               She stares at them defiantly.\n\n                                       SAMI\n                          Who are you waiting for?\n\n                                       SOPHIE\n                          Stick around and find out.\n\n               \n\n               INT. MOTEL ROOM -- LATER -- MORNING\n\n               A knock on the door. Sami clamps his hand over Sophie's mouth\n               just in case she gets any stupid ideas. Daniel opens the door.\n               Agent Hadley steps in, stares at Daniel, then feels the barrel of\n               Zero's gun pressed against his head.\n\n               \n\n                                                                            50.\n\n               \n               Hadley steps into the room. Daniel closes the door. Zero searches\n               him. Finds a gun which he gives to Daniel, then a wallet. He\n               opens it and sees his FBI identification.\n\n                                          ZERO\n                          He's FBI.\n\n               Zero knowingly bends down and removes Hadley's backup gun which is\n               strapped to his ankle. He gives the gun to Sami.\n\n                                       RAYMOND\n                          What is she doing with an agent du FBI?\n\n               Sami looks at her -- at Hadley -- at the black canvas bag.    Slowly\n               it starts to come together in his mind.\n\n                                       SAMI\n                          We've been set up.\n\n               He stares at Sophie angrily.\n\n                                       SAMI\n                          We didn't go to the wrong house. We\n                          went to right one, didn't we Sophie?\n\n               Her expression gives away nothing.\n\n                                       SAMI\n                          They send us to Zammito's house. The\n                          FBI is right across the street watching\n                          the whole thing, but they don't move. A\n                          crime is going down and they don't move.\n                          Why?\n                               (beat)\n                          Because they were waiting for us to come\n                          out so they could arrest us.\n\n                                       ZERO\n                          What does arresting us get them?\n\n                                       SAMI\n                               (to Hadley)\n                          You wanna tell him?\n\n                                       AGENT HADLEY\n                          You're telling it fine.\n\n               Daniel motions to Zero.\n\n                                       DANIEL\n                          You see my friend over there? I nod to\n                          him and he's going to put a bullet in\n                          your knee.\n\n               Zero stares at Hadley, just waiting for Daniel to give him the go\n               ahead.\n\n                                          AGENT HADLEY\n                          You wouldn't.\n\n               \n\n                                                                         51.\n\n               \n               Daniel nods.   Zero aims his gun at Hadley's knee cap.\n\n                                       AGENT HADLEY\n                          That's going to make a lot of noise.\n                          Not much time for a conversation after\n                          you pull the trigger.\n\n               They know he's right.\n\n                                       SAMI\n                          He's got a point.\n\n               Sami lifts up a heavy brass lamp from the nightstand. He pulls\n               the electrical cord out of the base, then touches two wires\n               together. They spark. Before Hadley can say a word Sami touches\n               them to his hand. Hadley's body jerks violent as he screams.\n               Sami removes the wires. Hadley winces in pain from the burn mark\n               on his hand.\n\n                                       AGENT HADLEY\n                          Okay! Okay! We've been investigating\n                          Zammito for years, but we've never had\n                          enough evidence for a warrant to search\n                          his house. We got word through a snitch\n                          that Zammito was planning on taking\n                          Bonanno out.\n\n                                       DANIEL\n                          We know all this.\n\n                                       AGENT HADLEY\n                          You just don't take out a boss. You\n                          need permission from the other families\n                          to do something like that. Our informant\n                          told us that Zammito was talking with\n                          other bosses and recording their\n                          conversations in case they later claimed\n                          they weren't involved. Look at these\n                          tapes. The guy has recorded every\n                          conversation he's had for years.\n\n                                       DANIEL\n                          So we rob Zammito. You arrest us when\n                          we come out and the contents of the safe\n                          is now evidence which you can use against\n                          him.\n\n               Agent Hadley nods.\n\n                                       SAMI\n                               (to Sophie)\n                          What are you getting out of this?\n\n               There is no point in hiding anything now.\n\n                                      SOPHIE\n                          Money. It was supposed to simple.    In\n                          and out.\n                                      (More)\n\n               \n\n                                                                            52.\n\n               \n                                       SOPHIE (Cont'd)\n                          Zammito wasn't supposed to be there.\n\n               \n\n                                                                   QUICK CUT TO:\n\n               \n\n               INT. ITALIAN RESTAURANT -- LAST NIGHT (FLASHBACK)\n\n               We see Zammito walk over to Mario.\n\n                                       ZAMMITO\n                          Mario, I gotta go. When my date arrives\n                          will you explain to her I had an\n                          emergency.\n\n                                       MARIO\n                          Of course, Mr. Zammito.\n\n               Zammito leaves. Through the window we see Joey \"Two Tons\" open\n               the door to the car. Zammito and Joey get in and drive away. A\n               beat. A Taxi pulls up. The front door opens and Sophie enters,\n               all dressed up and beautiful. She walks up to Mario.\n\n                                         SOPHIE\n                          Hi.    I'm meeting Frankie Zammito --\n\n               \n\n                                                                    CUT BACK TO:\n\n               \n\n               INT. MOTEL ROOM -- CONTINUOUS\n\n               Sami stares at her with contempt.\n\n                                         SAMI\n                          Why?\n\n                                       SOPHIE\n                          Vincent Bastaldi is in jail.\n\n                                         DANIEL\n                          For what?\n\n                                        SOPHIE\n                          Laurant and Vincent were in business\n                          with Zammito.\n\n                                       DANIEL\n                          What kind of business?\n\n                                       SOPHIE\n                          Black market art. Zammito got to a few\n                          key security guards at the Metropolitan\n                          Museum. The Bastaldi's supplied the\n                          artists to make copies of famous works.\n                          They'd switch the paintings, send the\n                          originals to Paris and the Bastaldi's\n                          would sell them to private collectors.\n\n               \n\n                                                                      53.\n\n               \n\n                                        AGENT HADLEY\n                          We're talking Matisse, Renoir, Monet.\n                          We know for sure they replaced Van Gogh's\n                          \"Vase with twelve sunflowers\" last week\n                          with a copy. It was on loan from the\n                          London National Gallery and they're not\n                          going to be very happy when they find\n                          out about it.\n\n                                       SAMI\n                          So Bastaldi makes a deal with the Feds\n                          to trade up for his brother?\n\n                                       AGENT HADLEY\n                          Yeah. He delivers the goods on Zammito.\n                          If we got what we wanted we'd let his\n                          brother go providing he tells us where\n                          the Van Gogh and the other paintings\n                          are.\n\n                                       RAYMOND\n                          No one has mentioned the part of the\n                          plan about us getting caught and going\n                          to prison.\n\n                                       DANIEL\n                          We're leaving. Raymond get the bag.\n\n                                        AGENT HADLEY\n                          You walk out with that bag and you won't\n                          only have Zammito and his people after\n                          you. You'll have the entire United States\n                          justice department. How far do you think\n                          you'll get? I know who you are Mr. Foray?\n                          Mr. Zerhouni. Mr. Gayet.\n                                (looks at Zero)\n                          Mr...\n\n               Agent Hadley looks to Sophie.\n\n                                        SOPHIE\n                          Zero.   That's all I know.\n\n                                       AGENT HADLEY\n                          You'll never get out of the city.\n\n               They move to the door.\n\n               \n\n               EXT. BAY VIEW MOTEL -- MORNING\n\n               Daniel, Sami, Raymond and Zero walk to the Impala.\n\n                                       DANIEL\n                          Bastaldi's dead. He is fuckin' dead!\n\n                                       ZERO\n                          You want Zero to kill him?\n\n               \n\n                                                                         54.\n\n               \n\n                                       DANIEL\n                          I'm going to kill him myself!\n\n                                       ZERO\n                          What about the money?\n\n                                       SAMI\n                          It has to be at Sophie's. She didn't\n                          have time to go anywhere else before she\n                          came here.\n\n                                       ZERO\n                          We don't know that for sure.\n\n                                       DANIEL\n                          Forget the money! We've got bigger\n                          problems than the money right now.\n\n                                       RAYMOND\n                          She probably hid it at her place.    The\n                          six of us could find it in --\n\n                                       SAMI\n                               (overlapping)\n                          -- We don't have time to look for it.\n                          Hadley's first move is going to be to\n                          look for us there.\n\n               Daniel dials a number on his cell phone.\n\n                                       DANIEL\n                          We're moving. Pack up and be on the\n                          street in five minutes.\n\n               \n\n               INT. MOTEL ROOM -- MORNING\n\n               Agent Hadley steps out of the bathroom, a towel wrapped around the\n               burn on his hand.\n\n                                       AGENT HADLEY\n                          This is turning to shit. If word gets\n                          out of my involvement in this I'll go to\n                          prison.\n\n                                       SOPHIE\n                          Listen, we know their names. They don't\n                          know the city. You'll find them. You're\n                          the FBI.\n\n                                       AGENT HADLEY\n                          I can't bring the Bureau into this.    If\n                          I do the tapes become evidence.\n\n                                       SOPHIE\n                          They're supposed to be evidence.    That's\n                          why Bastaldi set this up.\n\n               \n\n                                                                           55.\n\n               \n\n                                       AGENT HADLEY\n                          Fuck Bastaldi and his brother. These\n                          tapes are gold. Do you have any idea\n                          what Zammito would pay to get them back?\n\n                                       SOPHIE\n                          I thought you wanted Zammito?\n\n                                       AGENT HADLEY\n                          What for? The minute I get him some\n                          other Gavone will take his place. I've\n                          been doing this for twenty years. When\n                          I retire it's not going to be to some\n                          trailer park in the suburbs.\n\n               She likes the idea.   Already she's thinking how she can work her\n               way into this.\n\n                                       AGENT HADLEY\n                          Too many people know about my involvement\n                          in this.\n\n                                       SOPHIE\n                          Then we just have to make sure everyone\n                          who knows can't say anything.\n\n               His jaw tightens.\n\n                                       AGENT HADLEY\n                          You're right about that.\n\n               Hadley is standing behind her. He lifts up the brass lamp with\n               his towel and swings down hard towards Sophie's head.\n\n               \n\n               EXT. STREET, SOPHIE'S WAREHOUSE -- MORNING\n\n               Marcel, Julien and Wayne are waiting as the Impala drives up.\n               Raymond hops out of the car.\n\n                                       RAYMOND\n                          I would like to thank you for your\n                          hospitality.\n                               (hands him a card)\n                          If you are ever in Paris here is my\n                          number.\n\n                                        WAYNE\n                          Cool.\n\n               Marcel grabs Raymond and leads him back to the car.    Daniel sees\n               Lamar standing across the street.\n\n                                       DANIEL\n                               (to the others)\n                          I'll be right back.\n               He gets out of the car and walks over to him.\n\n               \n\n                                                                       56.\n\n               \n\n                                       LAMAR\n                          What do you want now?\n\n                                        DANIEL\n                          Guns.   Can you get them?\n\n                                       LAMAR\n                          Man, I can get anything.\n\n                                       DANIEL\n                          Don't bullshit me.\n\n                                       LAMAR\n                          I ain't bullshittin'. I can get guns.\n                          I can get any kind of gun you want. But\n                          they ain't gonna help your sorry ass.\n                          You ain't been in town one day and already\n                          you got two of the toughest people in\n                          Chicago looking for you. How is that\n                          possible?\n\n                                       DANIEL\n                          I've got a way with people.\n\n                                       LAMAR\n                          I can see that. The man's car you stole.\n                          Raphael Ruiz. He's head of the 19th\n                          Street gang and one crazy motherfucker.\n                          And Frankie Zammito's got the word out\n                          he's looking for some French dudes.\n                          You're French ain't ya?\n\n                                       DANIEL\n                          I'm from Belgium.\n\n                                       LAMAR\n                          Yeah, I'd be from Belgium too if I was\n                          you. You know Zammito just put his own\n                          brother in the hospital? Broke his arm\n                          cause he was late on a debt. I mention\n                          this to illustrate the kind of people\n                          who are lookin' for you.\n\n                                       DANIEL\n                          Why haven't you turned us in?\n\n                                       LAMAR\n                          I ain't no rat.\n                               (beat)\n                          You got money, right?\n\n               Daniel nods.\n\n                                       LAMAR\n                          And, uh, I'm going to have to charge you\n                          a commission... kind of like a brokerage\n                          fee.\n\n               \n\n                                                                           57.\n\n               \n\n                                          DANIEL\n                          How much?\n\n                                       LAMAR\n                          A thousand dollars?\n\n                                          DANIEL\n                          Fine.\n\n               Daniel hands him his cell phone.\n\n                                       DANIEL\n                          Take this. I'll call you in a few hours.\n                          You tell me where we meet.\n\n               \n\n               INT. SOPHIE'S WAREHOUSE -- DAY\n\n               Wayne is on the couch watching TV. There is a loud knock on the\n               door. He opens the door to find Agent Hadley.\n\n                                          WAYNE\n                          Yeah?\n\n               Hadley pushes past Wayne and enters.\n\n                                       WAYNE\n                          Hey dude, what do you think you're doing?\n\n               Hadley flashes his badge.\n\n                                       WAYNE\n                          Uh... excuse me, but don't you need a\n                          warrant or something?\n\n                                        AGENT HADLEY\n                          Not today.   Where are your friends?\n\n                                       WAYNE\n                          They left about a half hour ago.\n\n                                       AGENT HADLEY\n                          Where did they go?\n\n                                          WAYNE\n                          I dunno.\n\n               Hadley punches Wayne in the face.    Wayne falls to the floor.\n\n                                       WAYNE\n                          Hey man, you can't do that!\n\n                                          AGENT HADLEY\n                          What?   This?\n\n               Agent Hadley kicks Wayne in the chest.\n\n                                          AGENT HADLEY\n                          Or this?\n\n               Agent Hadley kicks Wayne in the ribs.\n\n               \n\n                                                                          58.\n\n               \n\n                                         WAYNE\n                           Jesus.   What kind of FBI agent are you?\n\n                                        AGENT HADLEY\n                           I'm your worst fuckin' nightmare. Now,\n                           if you don't want me to keep on hurting\n                           you, it's important that I believe you\n                           and right now I don't. So tell me, where\n                           did they go?\n\n                                        WAYNE\n                           I swear man, I don't know. They packed\n                           up and left a half hour ago.\n                                (points to coffee\n                                 table)\n                           All I got is one of their phone numbers\n                           in Paris.\n\n               Hadley sees the phone number Raymond gave Wayne on the coffee table.\n               He puts it in his pocket and stares at Wayne, then just for the\n               hell of it gives him one last kick in the ribs.\n\n               \n\n               EXT. BAY VIEW MOTEL -- DAY\n\n               A MAID stops her cart in front of room fourteen.   She KNOCKS.\n\n                                           MAID\n                           Maid service.\n\n               No answer. She uses her key and steps into the room.   A beat.   We\n               hear a loud scream.\n\n               \n\n               EXT.   HOLIDAY HOTEL -- EVENING\n\n               A large building near the freeway.\n\n               \n\n               INT. HOLIDAY HOTEL SUITE -- EVENING\n\n               Raymond is on the phone.\n\n                                        RAYMOND\n                                (in French)\n                           I know Mama, but I couldn't call you\n                           yesterday we were very busy.\n                                (listens)\n                           No, nothing's more important than you.\n                                (listens)\n                           I don't know. I think I'm going to have\n                           to stay a few more days.\n\n               Daniel, Sami and Julien sit at a table. Marcel stares out the\n               window sadly. Zero is flipping through the television channels.\n\n                                        DANIEL\n                                (to Marcel)\n                           Did you know about Bastaldi's deal with\n                           Zammito?\n\n               \n\n                                                                      59.\n\n               \n\n                                         MARCEL\n                          No.\n\n                                         DANIEL\n                          You're sure?\n\n                                       MARCEL\n                          I think if he told me he was going to\n                          steal Van Gogh's \"Sunflowers in a vase\"\n                          I would remember it.\n\n                                       SAMI\n                               (correcting him)\n                          \"Vase with twelve Sunflowers.\"\n\n                                       MARCEL\n                          Whatever! He never told me about the\n                          Van Gogh or any of the other paintings.\n\n               Raymond hangs up the phone and joins the others.\n\n                                       SAMI\n                          It makes sense. I mean, do you really\n                          think he would come along if he knew we\n                          were being set up?\n\n                                       DANIEL\n                          I think he'd cut his dick off if Bastaldi\n                          told him to.\n\n                                       MARCEL\n                          Fuck you! You know I'd never go along\n                          with something like this.\n\n                                         DANIEL\n                          Do I?\n\n                                       MARCEL\n                          This ain't about that and you know it.\n                          This is about you never forgiving me for\n                          leaving the crew.\n\n                                       SAMI\n                               (surprised)\n                          You guys used to work together?\n\n                                       MARCEL\n                          Yeah and he can't stand it that I tried\n                          to do something to better myself.\n\n                                       DANIEL\n                               (in French)\n                          You call being Bastaldi's lap dog better?\n\n                                       MARCEL\n                               (in French)\n                          Better than spending my life crawling\n                          through windows in the middle of the\n                          night.\n\n               \n\n                                                                           60.\n\n               \n\n                                       SAMI\n                          All right, knock it off.\n\n                                       DANIEL\n                               (in French)\n                          All you are is a professional ass-kisser.\n\n                                        MARCEL\n                                (in French)\n                          I'm not a guy who is known for his\n                          patience and right now you're testing\n                          mine.\n\n                                       DANIEL\n                               (in French)\n                          What is that a threat? Are you fuckin'\n                          threatening me, Marcel?\n\n               They take a step towards each other.   Sami steps in between them.\n\n                                       SAMI\n                          I said knock it off! Now as far as I'm\n                          concerned you two girls can bitch slap\n                          yourselves silly when this is over, but\n                          right now we've got to figure out what's\n                          going on.\n\n                                       RAYMOND\n                          It's simple. Bastaldi's moving up.\n                          He's closing down his operation and this\n                          is his way of saying thanks to all of\n                          us.\n\n                                       JULIEN\n                          Well, I say the whole deal is off. In\n                          fact, if you ask me, there never was a\n                          deal because we were screwed from the\n                          start.\n\n               Zero turns to another channel. A news broadcast.     We see a mug\n               shot photo of SAMI on the screen.\n\n                                       ZERO\n                          Hey Sami, you're on TV.\n\n               Zero turns up the volume.\n\n                                       REPORTER\n                          ... Sami Zerhouni in connection with the\n                          murder of Sophie Nichols.\n\n               Sami is stunned.\n\n                                       SAMI\n                          What?\n\n                                       REPORTER\n                          Police have confirmed that Zerhouni was\n                          seen entering the woman's room by the\n                          Motel Manager.\n\n               \n\n                                                                          61.\n\n               \n\n               CLOSE ON TELEVISION\n               The Reporter continues her story.\n\n                                         REPORTER\n                            Zerhouni is also wanted by police for\n                            questioning regarding a robbery last\n                            night at the home of alleged Mafia member\n                            Frankie Zammito.\n\n               Pull back.   We are now in...\n\n               \n\n               INT. ZAMMITO'S BEDROOM -- CONTINUOUS\n\n               Zammito grimaces as the news of the robbery becomes public.\n\n                                         ZAMMITO\n                            Oh, shit!\n\n               \n\n               CLOSE ON TELEVISION\n               The Reporter continues.\n\n                                         REPORTER\n                            The other members of his gang are reported\n                            to be French nationals Daniel Foray,\n                            Marcel Burot, Julien Labesse...\n\n               Pull back again...\n\n               \n\n               INT. LAMAR'S APARTMENT -- CONTINUOUS\n\n               Lamar is sitting on the couch watching the news report with\n               amusement.\n\n                                         LAMAR\n                            Dumb crackers --\n\n               \n\n               CLOSE ON TELEVISION\n               The reporter finishes her story.\n\n                                         REPORTER\n                            ... Raymond Gayet and an unidentified\n                            man only known as Zero.\n\n               Pull back again...\n\n               \n\n               INT. AGENT HADLEY'S APARTMENT -- EVENING\n\n               Hadley grins as he watches the report.\n\n                                         AGENT HADLEY\n                            That should shake things up.\n\n               \n\n                                                                           62.\n\n               \n\n               CLOSE ON TELEVISION\n\n                                         REPORTER\n                          Up next.    A vacation get away on a budget --\n\n               We are back in....\n\n               \n\n               INT. HOLIDAY HOTEL SUITE -- EVENING\n\n               Sami turns off the television and looks to the others.\n\n                                         SAMI\n                          Hadley --\n\n                                         DANIEL\n                          Has to be.\n\n                                       JULIEN\n                               (freaking out)\n                          This is bad. This is really fuckin'\n                          bad. Am I the only one who sees how bad\n                          this is?\n\n                                       SAMI\n                          Hey, it's not your picture on the TV,\n                          it's mine. So, try to be cool.\n\n                                       JULIEN\n                          Don't tell me to be cool! We were\n                          supposed to be in and out. In and out!\n                          In the last twenty four hours we've\n                          managed to get the Mafia... the FBI...\n                          the Chicago Police Department and a group\n                          of Latin gang members after us. I haven't\n                          left out anyone, have I?\n                               (pretends to think\n                                about it)\n                          I don't think so, because we've already\n                          pissed off everyone in the fuckin' city!\n\n                                       SAMI\n                          We've got to get out of here.\n\n                                       JULIEN\n                          That's brilliant! Care to elaborate?\n\n               Sami gets into Julien's face.\n\n                                       SAMI\n                          You're not helping.\n\n                                       RAYMOND\n                          Julien, what you're doing right now is a\n                          very normal psychological reaction to\n                          stress. You're projecting your anger\n                          onto us.\n\n                                         JULIEN\n                          Oh, Jesus.    We're dead.\n\n               \n\n                                                                           63.\n\n               \n               Julien walks away.    Daniel picks up the phone and dials a number.\n\n               \n\n               INT. LAMAR'S APARTMENT -- SAME TIME\n\n               The cell phone Daniel gave him rings.      He answers it.\n\n                                          LAMAR\n                          Yeah?\n\n                                          DANIEL (V.O.)\n                          It's me.\n\n                                       LAMAR\n                          Hey you guys are becoming famous.      I was\n                          just watching the news and--\n\n                                       DANIEL (V.O.)\n                               (overlapping)\n                          -- Did you set it up?\n\n                                       LAMAR\n                          Yeah. All set. Tomorrow morning. Ten\n                          o'clock. Room 211. Barclay Hotel on\n                          River Street. Oh, and due to your recent\n                          notoriety and the heat that comes with\n                          it, I'm going to have to increase my\n                          brokerage fee to twenty five hundred.\n\n                                       DANIEL (V.O.)\n                          We had a deal.\n\n                                       LAMAR\n                          We had a deal before you and your friends\n                          became the new poster boys for crime.\n\n                                          DANIEL (V.O.)\n                          Fine.     Ten o'clock.\n\n               The line goes dead.    Lamar grins, happy with the money he's going\n               to make.\n\n               \n\n               INT. HOLIDAY HOTEL SUITE -- EVENING\n\n               The others are looking at Daniel.\n\n                                       DANIEL\n                          Sami, tomorrow you lift a wallet from\n                          someone who looks like one of us.\n\n                                          JULIEN\n                          What for?\n\n                                       DANIEL\n                          We need to rent a car and for that you\n                          need a credit card.\n\n                                       RAYMOND\n                          Why not just steal another one?\n\n               \n\n                                                                         64.\n\n               \n\n                                       DANIEL\n                          Too risky. We don't need to get pulled\n                          over because of a stolen car.\n\n                                       JULIEN\n                          Maybe I'm missing the obvious, but why\n                          aren't we leaving town? Any place has\n                          to be safer for us than Chicago.\n\n                                       SAMI\n                          It doesn't matter where we go. Between\n                          Zammito and the FBI they'll find us. We\n                          have to end this here.\n\n                                       ZERO\n                          And how do we do that?\n\n                                          SAMI\n                          I don't know.\n\n                                       JULIEN\n                          That's an excellent plan.     Very\n                          comforting.\n\n                                       DANIEL\n                          We'll think of something.\n\n               \n\n               EXT. BONANNO HOUSE -- MORNING\n\n               A Lincoln Town Car drives up. Zammito gets out with Joey \"Two\n               Tons\" and Nicky \"The Rake. They wait outside. Zammito enters.\n\n               \n\n               INT. BONANNO'S HOUSE, STUDY -- MORNING\n\n               Bonanno is behind his desk. Half Tooth Tony sits on the couch.\n               Zammito enters. Bonanno walks around his desk and hugs Zammito.\n\n                                       BONANNO\n                          Why didn't you tell me about this?\n\n                                       ZAMMITO\n                          You have enough to worry about, Angelo.\n                          You don't need my problems.\n\n               Bonanno places his hands on Zammito's cheeks and presses them\n               together.\n\n                                          BONANNO\n                          We're family.     An insult to you is an\n                          insult to me.\n\n               Bonanno releases him.\n\n                                       BONANNO\n                          They knew who you were when they broke\n                          in your house?\n\n                                          ZAMMITO\n                          Yes.\n\n               \n\n                                                                         65.\n\n               \n\n                                       BONANNO\n                          What is happening with the world? There\n                          was a time no civilian would touch a\n                          made man. Now every babbo in the world\n                          thinks he can get away with something.\n                          What did they take?\n\n                                       ZAMMITO\n                          Some cash. Jewelry. The other stuff I\n                          can replace, but there's a cardboard\n                          box... photos of my mother. They're the\n                          only ones I have of her.\n\n                                       BONANNO\n                          We're doing everything we can to find\n                          these people. Right Tony?\n\n                                       HALF TOOTH TONY\n                          We've reached out to everyone we know.\n\n                                       BONANNO\n                          If they're still stupid enough to be in\n                          this city, Tony will find them.\n\n               \n\n               EXT. BONANNO HOUSE -- MORNING\n\n               Zammito steps out onto the street. Joey \"Two Tons\" and Nicky \"The\n               Rake\" are pitching pennies against the wall. They start arguing\n               about something.\n\n                                       JOEY \"TWO TONS\"\n                          Frankie, come here a second.\n\n               Zammito walks over.\n\n                                       NICKY \"THE RAKE\"\n                          Who is closer to the wall, Joey or me?\n\n                                       ZAMMITO\n                               (impatiently)\n                          Get in the car.\n\n                                       NICKY \"THE RAKE\"\n                          Just tell me who's closer to the wall?\n\n               Zammito grabs him by the neck and smashes his face into the wall.\n\n                                        ZAMMITO\n                          You are!   Now get in the fuckin' car!\n\n               Both men walk to the car. Zammito starts after them, then stops.\n               He turns back, picks up the coins and puts them in his pocket.\n\n               \n\n               INT. HOLIDAY HOTEL -- LOBBY -- MORNING\n\n               Sami moves through a crowd of PEOPLE. He looks around until he\n               sees a man who looks remarkably similar to Raymond. Sami bumps\n               into him and lifts his wallet.\n\n               \n\n                                                                            66.\n\n               \n\n               INT. STEREO STORE -- MORNING\n\n               Marcel waits as a SALESPERSON brings over several boxes of\n               electronic equipment.\n\n               \n\n               EXT. LUGGAGE SHOP -- MORNING\n\n               Sami passes the shop. He stops. In the window is BLACK CANVAS\n               BAG that is identical to the one that they used on the job. He\n               goes into the store.\n\n               \n\n               EXT. BARCLAY HOTEL -- MORNING\n\n               An old building that has seen better days.   Daniel and Zero get\n               out of a Taxi and go inside.\n\n               \n\n               INT. HALLWAY -- BARCLAY HOTEL -- MORNING\n\n               Looks even worse on the inside. A dark corridor is lit by bare\n               light bulbs hanging from the ceiling. An old PROSTITUTE walks\n               past them, her smile signaling she is open for business. They\n               arrive at room 211 and knock. The door is opened by a very large\n               BLACK MAN. Behind him we can see Lamar with ELLWOOD, 20's, sun\n               glasses, his neck draped in gold chains.\n\n                                       BLACK GUY\n                               (very loud)\n                          I'm gonna have to search you.\n\n                                       DANIEL\n                          We'll save you the trouble.\n\n               Daniel pulls back his jacket to reveal the gun he took from Hadley\n               in his waistband.\n\n                                        BLACK GUY\n                               (loudly)\n                          You can't come in here with that.\n\n               Daniel looks past him to Ellwood.\n\n                                       DANIEL\n                          What's wrong with this guy?\n\n                                       ELLWOOD\n                          He's my cousin. He's deaf.\n\n               Daniel removes an envelope full of cash.\n\n                                        DANIEL\n                          We're here to buy, not steal. If you\n                          guys are straight there's not going to\n                          be a problem.\n\n               Ellwood stomps his foot several times on the floor.   The black guy\n               feels the vibration and turns around.\n\n                                         ELLWOOD\n                          Let them in.\n\n               \n\n                                                                          67.\n\n               \n               The black guy steps aside.   Daniel and Zero enter.\n\n               \n\n               INT. BARCLAY HOTEL ROOM -- MORNING\n\n               Ellwood is sitting on the bed behind several open suitcases\n               displaying a variety of weapons.\n\n                                       ELLWOOD\n                          What can I do you for?\n\n               Daniel looks over the merchandise.\n\n                                       DANIEL\n                          How much for the nines?\n\n                                       ELLWOOD\n                          A grand a piece.\n\n                                       DANIEL\n                          I'll need extra clips and ammo.\n\n               Daniel starts counting out the money. Ellwood points a .357 magnum\n               he's been holding behind the open suitcase at them.\n\n                                       LAMAR\n                          What the hell you doing, Ellwood?   I\n                          gave them my word.\n\n                                       ELLWOOD\n                          Zammito's offering twenty grand a head\n                          for these guys. You think I'm going to\n                          settle for four G's when I can make forty?\n                               (to Daniel)\n                          All right. Reach in easy and put the\n                          gun on the floor.\n\n               Daniel slowly grabs his gun and places it on the floor, then kicks\n               it under the bed.\n\n                                       ELLWOOD\n                          I said put it on the floor, not kick it\n                          under the bed.\n\n               Ellwood speaks to his cousin, speaking slowly and enunciating each\n               word so he can read his lips.\n\n                                       ELLWOOD\n                          Get that and add it to my inventory.\n\n               The black guy get on his hands and knees and starts looking for\n               the gun under the bed. As he does Daniel glances over at Zero\n               with a look. Ellwood aims his gun at Zero.\n\n                                       ELLWOOD\n                          I assume you're carrying too?\n\n               Zero opens his coat and reveals his .9mm.\n\n               \n\n                                                                         68.\n\n               \n\n                                       ELLWOOD\n                          Okay, put it on the floor... and do not\n                          kick it under the fuckin' bed.\n\n                                             ZERO\n                                  (flatly)\n                          No.\n\n               He stares at Ellwood calmly through dead, flat eyes.\n\n                                       ELLWOOD\n                          No? Did you just say no? Listen cowboy,\n                          if you're thinking about makin' a move,\n                          don't. Nobody is that fast.\n\n                                             ZERO\n                          Zero is.\n\n                                             ELLWOOD\n                          Who's Zero?\n\n                                             LAMAR\n                          He is.\n\n               Ellwood is confused. Daniel bolts to his left. Ellwood's eyes\n               leave Lamar for a moment -- it's a moment too long. In a blur of\n               movement Zero has his gun out and fires one shot into Ellwood's\n               forehead.\n\n               Ellwood slumps down on the bed, dead. The black guy who has heard\n               nothing continues searching under the bed. Zero casually picks up\n               the suitcase filled with guns and hands it to Daniel. They walk\n               out of the room. Lamar stands there, stunned, then quickly runs\n               after them.\n\n               A beat. The black guy pops up with Daniel's gun oblivious to what\n               has transpired in the room.\n\n                                             BLACK GUY\n                          Found it!\n\n               \n\n               EXT. BARCLAY HOTEL -- MORNING\n\n               Daniel pushes Lamar out the door. Zero steps out behind him. He\n               stares at Lamar for a long moment, then hands him the envelope.\n\n                                       DANIEL\n                          There's ten grand in here. It's yours.\n                          I'm going to call you again. There's\n                          one more thing I need you to do.\n\n                                             LAMAR\n                          What?\n\n                                       DANIEL\n                          I'll tell you when it's time.\n\n               In the background we hear the loud, agonizing scream from the black\n               guy as he finds Ellwood's body.\n\n               \n\n                                                                          69.\n\n               \n\n               INT. CAR RENTAL AGENCY -- DAY\n\n               Raymond and Julien approach the counter.   Raymond is nervous.\n\n                                       RAYMOND\n                               (in French)\n                          I am not comfortable with this.   I'm not\n                          a good liar.\n\n                                       JULIEN\n                               (in French)\n                          Relax. It will be fine.\n\n               They arrive at the counter. The RENTAL AGENT, a man in his 30's\n               looks up at them with a smile.\n\n                                       CAR RENTAL AGENT\n                          Hello.\n\n                                       RAYMOND\n                          Hello. I am Robert M. Carney from Dayton,\n                          Ohio and I would like to rent a car with\n                          my visa gold card.\n\n               Raymond smiles, a big, friendly, completely over exaggerated smile.\n               Julien looks at him and rolls his eyes. The Rental Agent walks\n               down to the end of the counter and dials a number on the phone.\n\n                                       CAR RENTAL AGENT\n                               (into phone)\n                          I got a couple French guys here trying\n                          to rent a car.\n                               (listens)\n                          Sure. I can stall them.\n\n               \n\n               INT. HOSPITAL ROOM -- DAY\n\n               Vinny is in bed, his arm in a cast and sling. His wife ANGIE,\n               30's, big hair, loud clothes. She sits on the bed feeding him.\n               His two kids, RICHIE, 8, and TOMMY 10, sit off to the side. Zammito\n               enters.\n\n                                       ZAMMITO\n                          Angie, how you doin'?\n\n               She kisses him. Vinny stares blankly at his brother. Zammito\n               takes a step back, looks her up and down. He lays on the charm.\n\n                                       ZAMMITO\n                          Hey, you're looking good. There's\n                          something different about you. You get\n                          a boob job or something?\n\n                                       ANGIE\n                          I've gained weight.\n\n                                       ZAMMITO\n                          Yeah, well, it suits you.\n\n               \n\n                                                                          70.\n\n               \n               Zammito moves over to the kids and offers a quick hello.\n\n                                         ZAMMITO\n                          Hey Tommy.\n\n                                         RICHIE\n                          I'm Richie.    He's Tommy.\n\n                                         ZAMMITO\n                          Whatever.\n\n               Zammito pulls out a roll of bills that could choke a horse and\n               peels one off.\n\n                                       ZAMMITO\n                          Angie, take the kids down to the gift\n                          shop and buy 'em something. I need a\n                          word with Vinny.\n\n               Angie looks at the money.\n\n                                        ANGIE\n                               (flatly)\n                          Gee, five bucks. What ever shall we\n                          buy?\n\n               She takes the kids and leaves.\n\n                                       ZAMMITO\n                          She seems pleasant enough.\n\n                                       VINNY\n                          She doesn't know. She thinks I fell\n                          down the stairs.\n\n                                         ZAMMITO\n                          That's good.    That's what a stand-up guy\n                          does.\n\n               Zammito sits on the edge of the bed.\n\n                                       ZAMMITO\n                          So, I just come by to see how you're\n                          doin'?\n\n                                       VINNY\n                          You broke my arm. How the hell do you\n                          think I'm doin'?\n\n                                       ZAMMITO\n                          Yeah. I mean besides that.    They treating\n                          you all right? Food okay?\n\n                                       VINNY\n                          Yeah. I'm going home today.    What do\n                          you want, Frankie?\n\n                                       ZAMMITO\n                          I don't want anything.\n                                       (More)\n\n               \n\n                                                                           71.\n\n               \n                                       ZAMMITO (Cont'd)\n                          I just wanted to say... that I may have...\n                          overreacted a little the other day.\n\n                                          VINNY\n                          A little?\n\n                                       ZAMMITO\n                          Yeah. I mean, you are my brother and...\n                          well I should have found another way of\n                          expressing my disappointment. So, I've\n                          decided to make it up to you.\n\n                                       VINNY\n                          You gonna forget about the money I owe\n                          you?\n\n                                       ZAMMITO\n                          What are you nuts? A debt is a debt. I\n                          was thinking I'd throw a little extra\n                          work your way. You know, you come down\n                          to the club, make espresso for the boys...\n                          wash their cars... run some errands...\n                          things like that.\n\n               Zammito's cell phone rings.\n\n                                          ZAMMITO\n                                  (into phone)\n                          Yeah?\n                               (his face hardens)\n                          I'm on my way.\n\n               Zammito hangs up.\n\n                                       ZAMMITO\n                          I got something I gotta do. I'm glad we\n                          had this talk. Heal. Get better. Let\n                          me know when you're ready to start.\n\n               Zammito leaves.    Vinny can only shake his head in bewilderment.\n\n               \n\n               EXT. TATTOO SHOP -- DAY\n\n               Several low-rider cars are parked on the street.    Raphael and Hector\n               are with several GANG MEMBERS.\n\n                                       GANG MEMBER\n                          I ain't seen it your car. Sorry man.\n                          Hey, you know who you should talk to is\n                          Freddy O.\n\n                                       RAPHAEL\n                          I thought he was in prison.\n\n                                       GANG MEMBER\n                          Got out last month. He's trying to go\n                          straight but he's still wired in.\n                                       (More)\n\n               \n\n                                                                         72.\n\n               \n                                       GANG MEMBER (Cont'd)\n                          He's working at some restaurant. I'll\n                          find out where and call you.\n\n               \n\n               INT. HOLIDAY HOTEL SUITE -- DAY\n\n               Sami is recording something on a tape deck Marcel bough. He sees\n               Marcel outside on the balcony and removes a piece of paper from\n               his pocket, then picks up the phone and dials.\n\n                                          AGENT HADLEY (V.O.)\n                          Agent Hadley.\n\n                                       SAMI\n                          Do you know who this is?\n\n                                        AGENT HADLEY (V.O.)\n                          Yeah.   I figured I'd be hearing from\n                          you.\n\n                                       SAMI\n                          If you ever want to get those tapes,\n                          meet me in one hour at Grant Park near\n                          the statue.\n\n               \n\n               INT. CAR RENTAL AGENCY -- DAY\n\n               The Rental Agent walks back over to Raymond and Julien.\n\n                                       CAR RENTAL AGENT\n                          I'm sorry about the wait. There was a\n                          problem with the equipment.\n\n                                       JULIEN\n                          Everything okay now?\n\n               The Rental Agent's eyes drift to a black Lincoln Town Car parked\n               across the street.\n\n                                       CAR RENTAL AGENT\n                          Everything's fine.\n\n               \n\n               EXT. STREET, ACROSS FROM CAR RENTAL AGENCY -- DAY\n\n               A Lincoln pulls up. Zammito gets out and walks over to three\n               WISEGUYS in another Town Car. One of the Wiseguys points to the\n               window of the rental agency. Zammito looks at Raymond and Julien.\n\n                                       ZAMMITO\n                          I don't know the little one, but the\n                          other guy is definitely one of them.\n                          Follow them and call me when you find\n                          out where they go.\n\n               Zammito walks back to his car and drives off.\n\n               \n\n                                                                          73.\n\n               \n\n               EXT. CAR RENTAL LOT -- DAY\n\n               An EMPLOYEE drives up in a CADILLAC DE VILLE.   He gets out and\n               Julien grabs the keys from him.\n\n                                       JULIEN\n                               (in French)\n                          I'll drive.\n\n                                       RAYMOND\n                               (in French)\n                          I'm the driver.\n\n                                       JULIEN\n                               (in French)\n                          I've never driven a Cadillac before.\n\n               Raymond nods and gets in the passenger seat.\n\n               \n\n               EXT. STREET -- DAY\n\n               The Cadillac moves down the street.   The Lincoln follows a few\n               cars behind them.\n\n               \n\n               INT. CADILLAC -- MOVING -- DAY\n\n               Julien drives the car.\n\n                                       JULIEN\n                               (in French)\n                          This is a car. I think this is the best\n                          American car I've ever driven.\n\n                                       RAYMOND\n                               (in French)\n                          This is the only American car you've\n                          ever driven.\n\n               \n\n               EXT. GRANT PARK -- DAY\n\n               Agent Hadley walks towards the statue wearing a pair of sun glasses.\n               As he approaches, Sami steps out.\n\n                                       SAMI\n                          You set me up, you piece of shit!\n\n               Hadley pushes him up against the statue and starts frisking him.\n\n                                       SAMI\n                          What are you doing?\n\n                                       AGENT HADLEY\n                          You think I'm going to talk to you until\n                          I know if you're wired.\n\n                                         SAMI\n                          Wired?    I ain't wired.\n\n               \n\n                                                                          74.\n\n               \n               Sami lifts up his shirt showing Hadley his bare chest.   He drops\n               his pants down to his ankles.\n\n                                          AGENT HADLEY\n                          Okay.   Okay.    I believe you.\n\n                                       SAMI\n                          You killed her!\n\n                                       AGENT HADLEY\n                          No. You killed her. Manager remembers\n                          you going into her room. Your\n                          fingerprints were found all over the\n                          place.\n\n                                        SAMI\n                          Bullshit! She was alive when we left\n                          her with you.\n\n                                       AGENT HADLEY\n                          You're fucked, Sami. You know it.   That's\n                          why you're here.\n\n                                       SAMI\n                          Look, I just want out of this nightmare.\n                          I don't know these guys. A few days ago\n                          I'm in Paris picking pockets and now I'm\n                          America's most wanted.\n\n                                       AGENT HADLEY\n                          Where are the tapes?\n\n                                       SAMI\n                          I can get them -- but what do I get if I\n                          do?\n\n                                          AGENT HADLEY\n                          A pass.\n\n                                       SAMI\n                          A pass? How you gonna give me a pass?\n                          A witness can put me at the crime scene.\n\n                                       AGENT HADLEY\n                          Witness' can be convinced they made a\n                          mistake. Without the murder weapon the\n                          D.A. won't have enough to prosecute you.\n\n                                       SAMI\n                          They don't have a murder weapon?\n\n                                       AGENT HADLEY\n                          No. I have it. The lamp? The one with\n                          your fingerprints and her blood on it?\n                               (holds up his burned\n                                hand)\n                          Remember?\n\n               \n\n                                                                            75.\n\n               \n               Sami is stunned, then his thoughts snap back to...\n\n               \n\n                                                                        CUT TO:\n\n               \n\n               INT. BAY VIEW MOTEL ROOM -- MORNING (FLASHBACK)\n\n               Sami picking up the brass lamp off the nightstand and leaving his\n               fingerprints all over it.\n\n               \n\n                                                                    CUT BACK TO:\n\n               \n\n               EXT. GRANT PARK -- DAY\n\n               Sami stares angrily at Hadley who appears to be enjoying his\n               frustration.\n\n                                       AGENT HADLEY\n                          Of course they could always get an\n                          anonymous tip. Find it in the dumpster\n                          behind the motel.\n\n               Sami stares at him a long moment.\n\n                                       SAMI\n                          You want the tapes for yourself.     You're\n                          going to sell them.\n\n                                       AGENT HADLEY\n                          I'm going to retire with a shit-load of\n                          money. Find me a small country that\n                          doesn't have an extradition treaty with\n                          the States and live the good life.\n\n                                       SAMI\n                          You didn't have to kill Sophie.\n\n                                         AGENT HADLEY\n                          Yes I did.    Lose ends are messy.\n\n                                       SAMI\n                          What about me? Aren't I a loose end?\n\n                                       AGENT HADLEY\n                          When this is over you can say whatever\n                          the hell you want. I'll be long gone.\n                          Besides, who's going to believe you?\n                          You're just a two-bit crook.\n\n                                       SAMI\n                          And you're a dirty cop. At least I don't\n                          pretend to be something different than\n                          what I am.\n\n               Hadley hands him a card.\n\n               \n\n                                                                           76.\n\n               \n\n                                       AGENT HADLEY\n                          When you've got the tapes call me on\n                          this number. We'll make the exchange\n                          and that'll be the end of it.\n\n               Hadley leaves.\n\n               \n\n               EXT. GRAND AVENUE -- DAY\n\n               Julien drives the Cadillac along the North River.   The Lincoln\n               keeps pace with them several cars behind.\n\n               \n\n               INT. CADILLAC -- MOVING -- DAY\n\n               Raymond clicks through a few Radio Stations.   Julien glances in\n               his rear view mirror.\n               HIS POV - IN THE MIRROR:   of the Lincoln several cars back.\n               Julien seems concerned.    He turns the steering wheel hard to the\n               right.\n\n               \n\n               EXT. GRAND AVENUE -- DAY\n\n               The Cadillac cuts across the right lane almost hitting a car and\n               turns onto another street. The Lincoln makes a sharp move to stay\n               up with it.\n\n               \n\n               INT. CADILLAC -- DAY\n\n               Raymond looks over at Julien.\n\n                                       JULIEN\n                               (in French)\n                          We're being followed.\n\n               Julien hits the gas.\n\n               \n\n               EXT. WELL STREET -- DAY\n\n               The Cadillac speeds down the street, weaving in and out of traffic.\n               The Lincoln does the same. The Cadillac reaches an intersection.\n               The traffic ahead of them is stopped for a red light. The Cadillac\n               veers onto the sidewalk. Pedestrians jump out of the way and the\n               car streaks down the pavement. Behind the Lincoln follows.\n\n               \n\n               EXT. OHIO STREET -- DAY\n\n               The Cadillac screeches around the corner, onto a ONE WAY STREET.\n\n               \n\n               INT. CADILLAC -- MOVING -- DAY\n\n               Julien concentrates as he weaves the car in and out of the on coming\n               traffic.\n\n               \n\n                                                                          77.\n\n               \n\n                                       RAYMOND\n                               (in French)\n                          I knew I should have driven.\n\n                                       JULIEN\n                               (in French)\n                          Stop talking. I'm trying to concentrate.\n\n               \n\n               EXT. STREET -- DAY\n\n               The oncoming traffic veers off. Cars collide. The Lincoln clips\n               a car, loses control for a moment, then continues after them. At\n               the corner the Cadillac turns onto another street and joins traffic\n               in the right direction.\n\n               \n\n               EXT. FRANKLIN STREET -- DAY\n\n               The Lincoln moves up along side the Cadillac. Two WISEGUYS lean\n               out the window with guns in their hands. The Cadillac veers away\n               just as they start shooting. Bullets riddle the car.\n\n               \n\n               INT. CADILLAC -- MOVING -- DAY\n\n               Raymond removes Hadley's backup gun. The Lincoln pulls up beside\n               them again. The sound of GUN FIRE fills the air as Raymond shoots\n               from the Cadillac. The rear passenger window of the Lincoln\n               shatters and Raymond fires. The Lincoln drops back.\n\n               \n\n               EXT. HUBBARD STREET -- DAY\n\n               The Cadillac turns the corner. The Lincoln follows. The traffic\n               is heavier here. The cars have to slow down. The Lincoln moves\n               beside them again. Raymond fires his last shot. His gun his now\n               empty. Several rounds of gun fire come from the Lincoln.\n\n               \n\n               INT. CADILLAC -- MOVING -- DAY\n\n               Raymond looks over to Julien.\n\n                                       RAYMOND\n                               (in French)\n                          What are we going to --\n               His voice trails off as he sees Julien. A bullet has glanced his\n               neck, not deep, but deep enough to sever an artery. Blood pours\n               down his neck and covers his shirt. His face is pale. He glances\n               at the wound in the rear view mirror.\n\n               \n\n               EXT. STREET -- DAY\n\n               Julien steers the caddy onto another street.   The towncar follows.\n\n               \n\n               INT. CADILLAC -- MOVING -- DAY\n\n               Julien looks at Raymond. He is paler now, his shirt completely\n               covered with blood. He strains to stay conscious.\n\n               \n\n                                                                           78.\n\n               \n\n                                       JULIEN\n                               (in French)\n                          When we get to the next corner jump out.\n\n                                       RAYMOND\n                               (in French)\n                          I'm not going to leave you.\n\n                                       JULIEN\n                               (in French)\n                          We both know I'm already dead.\n\n               Raymond knows he's right.   The car races into the next turn.\n\n                                        JULIEN\n                                (in French)\n                          Go!\n               Raymond opens the door.\n               He jumps out.\n\n               \n\n               INT. LINCOLN - DRIVER'S POV -- DAY\n\n               Of Raymond as he rolls towards the curb.    The Caddy skids around\n               the corner.\n\n               \n\n               EXT. STREET -- DAY\n\n               The Lincoln slams on it's brakes in the middle of an intersection.\n               Raymond is dazed from his fall. He gets up slowly, his pants torn\n               and sees..\n\n               \n\n               P.O.V. RAYMOND OF THE TOWNCAR -- DAY\n               The driver is reaching out the window with his gun to take aim and\n               is just about to shoot when...\n\n               \n\n               EXT. STREET -- DAY\n\n               Julien comes racing into the intersection full speed and smashes\n               into the Lincoln. The impact sends the Lincoln spinning around.\n               When it stops the driver's window is facing the front of the caddy.\n               The driver of the caddy takes aim and fires.   The bullet goes\n               through the windshield and kills Julien.\n               The driver looks over at the passenger just in time to see...\n\n               \n\n               P.O.V. A LARGE TRUCK -- DAY\n               Speeds through the intersection and smashes head on into the\n               Lincoln. It crumbles like a toy under the weight.\n\n               \n\n                                                                          79.\n\n               \n\n               EXT. STREET -- DAY\n\n               Raymond limps into the street oblivious to the oncoming traffic.\n               He stares sadly at Julien.\n\n               \n\n               INT. HOLIDAY HOTEL SUITE -- AFTERNOON\n\n               Zero and Marcel are checking over the guns. Daniel writes some\n               notes on a pad of paper. Sami appears nervous as he sits off to\n               the side.\n               The door opens. Raymond limps into the room. His face is dirty,\n               bruised, his pants torn, legs scraped. He stands there, staring\n               at them through empty eyes.\n               Daniel looks at the door expectantly.   He knows the answer before\n               he asks the question.\n\n                                         DANIEL\n                          Julien?\n               Raymond's face fills with sadness.   He shakes his.\n\n               \n\n               INT. HOLIDAY HOTEL SUITE-- LATER -- DUSK\n\n               There is a cold silence in the room. Daniel stares at the sliding\n               glass door, staring out over the city.\n\n                                       SAMI\n                          It's not your fault, Daniel.\n\n                                         DANIEL\n                          No?\n\n               He looks at them sadly.\n\n                                       DANIEL\n                          We had a chance to walk out of Zammito's\n                          house.\n\n                                       MARCEL\n                          We all agreed to it. You had no way of\n                          knowing Bastaldi was setting us up.\n\n                                       DANIEL\n                          I just want to live long enough to get\n                          back to Paris. Just long enough to kill\n                          Bastaldi.\n\n                                       SAMI\n                          I say we make him pay first. After that\n                          you can do whatever you want to him.\n\n                                       RAYMOND\n                          He's right. Do you have any idea what\n                          Van Gogh's \"Vase with twelve Sunflowers\"\n                          is worth?\n\n               \n\n                                                                         80.\n\n               \n\n                                        MARCEL\n                          No.   How much?\n\n                                          RAYMOND\n                          I don't know.     It's gotta be millions.\n\n                                       DANIEL\n                          We still have to get out of here.\n\n                                       MARCEL\n                          Maybe if we gave the tapes back --\n\n                                        ZERO\n                                (strongly)\n                          No.\n\n               Everyone looks to Zero.\n\n                                       ZERO\n                          They killed our friend. It's personal\n                          now. Besides, if we do that, then Julien\n                          died for nothing. The tapes are the\n                          key.\n\n                                       SAMI\n                          He's right. The tapes give us leverage\n                          with Bastaldi.\n\n               \n\n               INT. AGENT HADLEY'S APARTMENT -- EVENING\n\n               Agent Hadley sits on his couch, deep in thought. He glances at\n               the paper with Raymond's phone number on the coffee table. A beat.\n               He gets an idea. He picks up his phone and dials.\n\n                                       AGENT HADLEY\n                          Hello? Mrs. Gayet? Do you speak English?\n                               (listens)\n                          You do. Great.\n                               (listens)\n                          Oh, you taught Raymond English. You did\n                          a wonderful job. I'm sorry to call so\n                          late but I'm supposed to meet Raymond --\n                               (listens)\n                          No, I didn't know he was a difficult\n                          child. Mrs. Gayet, I'm calling because --\n                               (listens)\n                          No, I don't have any children of my own.\n                          I'm supposed to meet Raymond tonight at\n                          his hotel and I forgot what Hotel he is\n                          at. I wondering if you --\n                               (listens)\n                          The Holiday Hotel. Room 912. Thank you\n                          very much.\n\n               \n\n               EXT. HUBBARD STREET -- EVENING\n\n               Tow trucks and cleaning crews work around wreckage of the cars.\n               Only a few POLICE CARS are there.\n\n               \n\n                                                                          81.\n\n               \n               A UNIFORMED COP looks over and sees Joey \"Two Tons\" on the sidewalk.\n               Joey motions with his head to an alley.\n\n               \n\n               EXT. ALLEY -- EVENING\n\n               The Uniformed Cop enters the alley and joins Joey.\n\n                                       JOEY \"TWO TONS\"\n                          What'd you guys find?\n\n                                       UNIFORMED COP\n                          Dead bodies. The ones in the Lincoln\n                          are your... associates.\n\n                                       JOEY \"TWO TONS\"\n                          And the other car?\n\n                                       UNIFORMED COP\n                          Some French guy. At least that's what\n                          his passport said. You know Joey, I\n                          shouldn't be talking to you about this.\n\n                                       JOEY \"TWO TONS\"\n                          Are you forgetting who supplements your\n                          income?\n\n                                       UNIFORMED COP\n                          No. It's just that the French guy had a\n                          gunshot wound on his neck. So, this is\n                          a homicide. Are you guys involved in\n                          this?\n\n                                       JOEY \"TWO TONS\"\n                          Yeah. I'll come down and make a full\n                          confession later. Right now, tell me\n                          what else you found?\n\n                                         UNIFORMED COP\n                          A Wallet.    A hotel room card.    Some cash.\n\n               This sparks Joey's interest.\n\n                                          JOEY \"TWO TONS\"\n                          What hotel?\n\n                                       UNIFORMED COP\n                          The Holiday Hotel.\n\n                                       JOEY \"TWO TONS\"\n                          What room number?\n\n                                          UNIFORMED COP\n                          I don't know.     I didn't look.\n\n                                          JOEY \"TWO TONS\"\n                          Go look.\n\n               \n\n                                                                           82.\n\n               \n\n               INT. HOLIDAY HOTEL SUITE -- EVENING\n\n               The crew sits around a table trying to figure out how they can get\n               out of town.\n\n                                       DANIEL\n                          Okay. Airports, train stations, bus\n                          station are out. We know they're\n                          connected to the car rental agencies\n                          because that's where they picked up\n                          Raymond.\n\n                                       SAMI\n                          Even if we get out of town and go to\n                          another airport I'm sure the FBI and\n                          Chicago P.D. has alerted customs.\n\n                                       MARCEL\n                          How about Canada?\n\n                                       RAYMOND\n                          What are we going to do, take a taxi?\n\n               Sami opens a pack of cigarettes to find it's empty.\n\n                                       SAMI\n                          I'm going to get some cigarettes.\n\n               \n\n               INT. RESTAURANT -- EVENING\n\n               Because of the early hour the room is empty. Raphael and Hector\n               are with FREDDY O, 30's, hard-looking. He is wearing a bus boy\n               uniform as he sets the tables.\n\n                                       FREDDY O\n                          I can't believe someone would have the\n                          balls to rip off your ride.\n\n                                       RAPHAEL\n                          When I find them they won't have them\n                          for much longer.\n\n                                       FREDDY O\n                          I'll ask around. If they try to move it\n                          I can find out.\n\n                                          RAPHAEL\n                          Thanks.\n\n               Raphael and Hector exit.    We move with them through the door into...\n\n               \n\n               INT. HOLIDAY HOTEL LOBBY -- EVENING\n\n               Raphael and Hector head for the front door. The elevator doors\n               opens and Sami exits. They walk past each other as Sami heads\n               across the lobby and into the gift shop. As Raphael and Hector\n               walk out the front door Agent Hadley steps in walks past them. He\n               goes over to a WOMAN CLERK at the front desk.\n\n               \n\n                                                                          83.\n\n               \n\n                                       AGENT HADLEY\n                          I'd like to see the manager please.\n\n               She walks over to the HOTEL MANAGER and points to Agent Hadley.\n               The Manager walks over.\n\n                                       HOTEL MANAGER\n                          May I help you?\n\n               Agent Hadley shows him his badge.\n\n                                       AGENT HADLEY\n                          I'm looking for several French men who\n                          checked in within the last twenty four\n                          hours.\n\n                                       HOTEL MANAGER\n                          They checked in last night.\n\n                                       AGENT HADLEY\n                          I need you to take me to their room.\n\n               Agent Hadley follows the manager as they walks towards the elevators\n               and pass... Sami who pretends to read a magazine, covering his\n               face so Hadley will not see him. Sami walks quickly across the\n               lobby and passes...\n\n               Joey \"Two Tons\", Nicky \"The Rake\" and three other WISEGUYS enter\n               the hotel. Agent Hadley gets in an elevator with the Hotel Manager.\n               The doors close as the wiseguys approach.\n\n               The moment the doors close Sami bolts into the lobby and over to\n               the house phones. All of them are being used except one. A MAN\n               is just about to lift the receiver when Sami pushes him aside.\n\n                                        MAN\n                          Excuse me.   I was here first.\n\n               Sami ignores him as he waits for the hotel operator to answer.\n               The phone just rings and rings.\n               Behind him another elevator has arrived and the wiseguys enter.\n               Sami's frustration is growing as the phone continues to ring.    The\n               Man who Sami pushed away is still there.\n\n                                       MAN\n                          Hey buddy, you just can't push in here.\n\n                                        SAMI\n                          Go away.\n\n                                       MAN\n                          I most certainly will not go--\n\n               Sami quickly smacks him on the head with the receiver.   The man\n               slinks away.\n\n                                        OPERATOR'S VOICE\n                          Operator.\n\n               \n\n                                                                           84.\n\n               \n\n                                       SAMI\n                               (into phone)\n                          Room 912.\n\n               \n\n               INT. HOLIDAY HOTEL SUITE -- EVENING\n\n               The phone rings.\n\n                                       DANIEL\n                               (to Raymond)\n                          Get that, will you?\n\n                                       RAYMOND\n                          Why do I always have to answer the phone?\n\n                                       DANIEL\n                          Because you're the closest.\n\n                                       RAYMOND\n                          I'm not any closer than you are.\n\n               \n\n               INT. ELEVATOR -- EVENING\n\n               The wiseguys watch the floor indicator.\n\n               \n\n               INT. HOLIDAY HOTEL SUITE -- EVENING\n\n               The phone continues RINGING.\n\n                                       DANIEL\n                          Why is everything an argument with you?\n\n                                       RAYMOND\n                          I'm just setting my boundaries.\n\n               Daniel looks at Raymond and sighs, then gets up and lifts he\n               receiver.\n\n                                          DANIEL\n                          Hello?\n\n                                       SAMI (V.O.)\n                          Get out of the room! You've got company\n                          coming up. I'll meet you at the Chevy.\n\n               Daniel slams down the phone.    The others can see the urgency on\n               his face.\n\n                                       DANIEL\n                          Raymond, grab the tapes.    We're leaving!\n\n                                       RAYMOND\n                          Why do I have to pick up the tapes.\n\n                                          DANIEL\n                          Jesus!\n\n               Daniel grabs the canvas bag.\n\n               \n\n                                                                           85.\n\n               \n\n               INT. HOLIDAY HOTEL -- HALLWAY -- EVENING\n\n               The manager is about to open the door with his key.   Agent Hadley\n               takes it and removes a gun.\n\n                                         AGENT HADLEY\n                            You should go now.\n\n               The manager runs away. Agent Hadley inserts the key and opens the\n               door. His face fills with fear as he sees...\n               AGENT HADLEY'S POV -- Daniel, Marcel, Raymond and Zero are on the\n               other side, their guns pointed at Hadley's head.\n\n               \n\n               INT. HOLIDAY HOTEL SUITE - BATHROOM -- EVENING\n\n               Daniel uses Hadley's handcuffs and handcuffs him to a pipe under\n               the sink.\n\n               \n\n               INT. HOLIDAY HOTEL -- HALLWAY -- EVENING\n\n               Daniel, Raymond, Marcel and Zero step into the hall. The moment\n               they do the elevator doors at the end of the hall open. The\n               Wiseguys step out and see them.\n               The door to the room next to theirs opens and a LITTLE GIRL, 8,\n               dressed in a pink dress steps out.\n\n                                          LITTLE GIRL\n                                 (calling into her\n                                  room)\n                            C'mon, Mommy.\n\n               Everything seems to move in slow motion.\n               --   The Wiseguys go for their guns.\n               --   The crew goes for theirs.\n               --   The little girl is caught between both groups.\n               --   Marcel lunges forward, tackling the girl to ground.\n               --   The Wiseguys begin to shoot.\n               --   The hallway fills with gunfire.\n               --   Marcel pulls the little girl into her room.\n               --   Plaster explodes off the walls as bullets rip through them.\n               --   The Crew rushes back into their suite.\n\n               \n\n               INT. LITTLE GIRL'S ROOM -- EVENING\n\n               Marcel hands the frightened girl to her mother, then moves over to\n               the door that joins with the crews. He shoots the lock and moves\n               through the door.\n\n               \n\n               INT. HOLIDAY HOTEL SUITE -- EVENING\n\n               As Marcel steps through he sees the crew all aiming their guns at\n               him. Daniel gets an idea. As Zero holds off the Wiseguys from\n               the doorway, Daniel goes to the adjoining door on the other side\n               of the suite. He shoots off the lock.\n\n               \n\n                                                                          86.\n\n               \n\n                                       DANIEL\n                          Let's go!\n               The Crew moves through the door.\n\n               \n\n               INT. ADJOINING MOTEL ROOM -- EVENING\n\n               Empty. The crew runs across to the door. Because the room is\n               built at the intersection of two hallways the crew step out into a\n               corridor out of the Wiseguys line of sight.\n\n               \n\n               INT. HOLIDAY HOTEL -- BACK HALLWAY -- EVENING\n\n               The Crew exits and heads for the staircase.\n\n               \n\n               INT. HOLIDAY HOTEL -- FRONT HALLWAY -- CONTINUOUS\n\n               Silence. The Wiseguys move down the hall and stop outside the\n               door of the Crew's suite. A beat. They rush in.\n\n               \n\n               INT. HOLIDAY HOTEL SUITE -- CONTINUOUS\n\n               Empty. Nicky \"The Rake\" sees the open adjoining door and motions\n               for them to follow him.\n\n               \n\n               INT. HOLIDAY HOTEL -- BACK HALLWAY -- EVENING\n\n               The Wiseguys step out just as the Crew are going through the door\n               to the stairwell. The Wiseguys run after them. Joey \"Two Tons\"\n               lags behind.\n\n               \n\n               INT. STAIRWELL -- EVENING\n\n               The Crew runs down the stairs. Above them the Wiseguys follow.\n               Joey \"Two Tons\" is breathing heavily as he runs down the stairs.\n\n               \n\n               INT. UNDER GROUND PARKING LOT -- EVENING\n\n               The door flies open as the Crew runs across the lot.   Sami has\n               already started the Impala and is waiting for them.\n               A moment later the stairwell door opens and the Wiseguys run out,\n               guns blazing.\n\n               The Crew heads for the Impala, shooting behind them as they run.\n               Nicky \"The Rake\"\" shoots.\n\n               Zero is hit in the leg. He falls to the ground, then rolls on his\n               side behind a parked car. He fights through the pain, props himself\n               up and begins to shoot back.\n\n               Two Wiseguys step out to flank Zero. Zero takes aim and shoots\n               one. He lines up on the other Wiseguy and pulls the trigger again.\n               Click! His gun his empty.\n\n               \n\n                                                                             87.\n\n               \n               Daniel and Marcel run towards Zero, firing their guns as fast as\n               they can pull the trigger. Marcel takes aim and fires.\n               The Wiseguy's dive for cover as Marcel blazes away until his gun\n               is empty.\n\n               We hear tires screeching as the Impala backs up.\n               The Wiseguys shoot, blowing out the back window.     They move in on\n               Marcel and Zero.\n\n               Daniel runs forward with two guns firing at the wiseguys.     As he\n               nears Marcel he throws the extra gun to him.\n               SLOW MOTION :on the gun as it flies through the air.\n               SLOW MOTION: One of the WISEGUYS has almost circle around the car.\n               SLOW MOTION: on the gun has it flies through the air.\n               REAL TIME -- ON MARCEL: He looks to his left just as the gun\n               arrives. It hits him on the forehead and knocks him down.\n\n               Daniel fires a few SHOTS driving the Wiseguy back. He runs over\n               and with Marcel's help they grab Zero and help him to the car.\n               They dive into the back seat. The car screeches forward and races\n               out of the garage.\n\n               Silence. The staircase door opens and an exhausted Joey \"Two Tons\"\n               steps out, gasping for air.\n\n               \n\n               INT. IMPALA -- MOVING -- EVENING\n\n               Daniel attends to the wound on Zero's leg.\n\n                                       DANIEL\n                          The bullet went clean through.\n\n               Daniel stares at him.   A beat.     Zero grins, saying thank you.\n\n               \n\n               INT. COFFEE SHOP -- EVENING\n\n               A distraught Raphael sits across from Hector in a booth near the\n               window. Hector has almost finished eating. Raphael hasn't touched\n               his food. He pushes his plate away.\n\n                                         RAPHAEL\n                          I can't eat.\n\n               Raphael lowers his head sadly.      Hector looks out the window.\n               HIS POV -- of the Impala driving by -- rear window missing, bumper\n               about to fall off.\n               Hector watches it go by, then turns back.     Raphael looks up.\n\n                                       HECTOR\n                          So, can I have your fries?\n\n               \n\n                                                                            88.\n\n               \n\n               EXT. COZY COURT COTTAGES -- EVENING\n\n               A group of small bungalows built adjacent to the interstate.\n\n               \n\n               INT. COTTAGE -- EVENING\n\n               Small. Filled with cheap furniture. A small kitchenette is off\n               to the side of the room. Zero lays on the bed. Daniel uses his\n               belt as tourniquet to slow the bleeding. Raymond sits at the table\n               staring at the black canvas bag containing the cash and tapes.\n               Marcel is in the kitchenette.\n\n                                       DANIEL\n                               (to Zero)\n                          When we get back to Paris I'll take you\n                          dancing.\n\n               Zero smiles. Sami enters carrying a shopping bag.      He places it\n               on the counter.\n\n                                       DANIEL\n                          Bring me the scissors.\n\n                                       ZERO\n                          And the Vodka.\n\n               Sami removes the items from the bag. He opens the bottle and hands\n               it to Zero who quickly gulps down a few mouthfuls.\n\n                                       DANIEL\n                          Cut his pants up the leg to the groin.\n\n                                       ZERO\n                          And be careful when you get near the\n                          top. Zero has a very long one.\n\n               He winks at Sami.\n\n                                       SAMI\n                          What's he joking around for?    He's been\n                          shot.\n\n                                       DANIEL\n                          He's been shot a lot.    He's used to it.\n\n               Raymond cuts the pant leg away. Daniel walks over to Marcel who\n               is standing over the gas range. Over the flame is a tire wrench,\n               the metal tip glowing red hot. Sami opens the bag and removes\n               some white bread.\n\n                                       SAMI\n                          Anybody hungry?\n\n                                       DANIEL\n                          What'd you get?\n\n                                       SAMI\n                          Some bread and...\n\n               \n\n                                                                         89.\n\n               \n               He removes a can of cheese whiz and sprays the cheese onto the\n               bread.\n\n                                        SAMI\n                          Cheese.\n\n               All the French guys look at him as though he is from another planet.\n\n                                        DANIEL\n                          Cheese?   In a can?\n\n               Sami stuffs his mouth with a big bite.\n\n                                        SAMI\n                          It's good.\n\n                                       MARCEL\n                          God, I want to go home.\n\n                                       SAMI\n                          Hey, you know you can't this in France.\n\n                                        DANIEL\n                          Thank God.\n\n               Daniel uses a towel to pick up the tire wrench and walks over to\n               the bed. Sami and Raymond grimace as they think about what's about\n               to happen.\n\n                                       DANIEL\n                               (to Zero)\n                          Ready?\n\n               Zero nods. Daniel takes the bottle of Vodka and pours some over\n               the wound. Zero flinches. Daniel looks at Marcel, then releases\n               the belt. Blood flows from the wound. Marcel presses the hot\n               poker against the wound. Zero grunts, but does not scream. His\n               face contorts violently from the pain.\n\n               \n\n               INT. SOUTH SIDE SOCIAL CLUB -- EVENING\n\n               Zammito sits at a table in the back eating an assortment of pasta.\n               DEAN MARTIN \"Innamaraia\" plays on the stereo. EDDIE, 60's,\n               arthritic, finishes making an espresso. He starts carrying it\n               over to Zammito, moving incredibly slow, shuffling one foot in\n               front of the other. Zammito watches him with strained patience.\n               Joey \"Two Tons\" and Nicky \"The Rake\" enter. Their faces tell the\n               story.\n\n                                       ZAMMITO\n                          What happened?\n\n                                       NICKY \"THE RAKE\"\n                          They sort of got away.\n\n                                       ZAMMITO\n                          I see. Well, get back out on the street\n                          and find them before I \"sort of\" kill\n                          you.\n\n               \n\n                                                                              90.\n\n               \n\n                                       JOEY \"TWO TONS\"\n                          But we ain't had nothing to eat all day\n                          boss.\n\n                                       ZAMMITO\n                          Oh, I'm sorry.\n\n               Zammito scoops up a handful of pasta out of his plate and throws\n               it at him.\n\n                                          ZAMMITO\n                          Had enough?\n\n               Joey \"Two Tons\" looks down sheepishly, several pieces of pasta are\n               stuck to his face. Zammito walks over to him.\n\n                                       ZAMMITO\n                          Try to get this through that fat, stupid\n                          fuckin' head of yours. If Half Tooth\n                          Tony finds these guys before we do and\n                          Bonanno knows what was in my safe we are\n                          all dead.\n\n               They turn around and leave.       Zammito stares after them angrily.\n\n                                          ZAMMITO\n                          Cafones!\n\n               He looks over at Eddie who is only half way to the table.\n\n                                       ZAMMITO\n                          You gonna bring that over here today, or\n                          what?\n\n               \n\n               INT. COTTAGE -- MORNING\n\n               Zero is passed out, a half empty Vodka bottle on the nightstand.\n               The others have been up all night. Raymond is across the table\n               from Sami.\n\n                                       RAYMOND\n                          The new Beaujolais' come out in France\n                          next week. You like wine?\n\n                                       SAMI\n                          I'm more of a whiskey drinker myself.\n\n                                          RAYMOND\n\n                          J&B?\n\n                                          SAMI\n                          Glenmorangie.\n\n                                       RAYMOND\n                          Glenmorangie is very good.\n\n               Sami realizes that Raymond wants to talk about something...\n               anything... that will get his mind of the events that have lead\n               them here.\n\n               \n\n                                                                           91.\n\n               \n\n                                       SAMI\n                          But I'll have a glass of Beaujolais with\n                          you when we get back.\n\n               Raymond forces a weak smile. Daniel who has been watching them\n               grabs a few things off the table.\n\n                                       DANIEL\n                          I'll be back in an hour.\n\n               Daniel looks at Sami and motions for him to come outside.\n\n               \n\n               EXT. COTTAGE -- MORNING\n\n               Sami steps outside.   Daniel is staring at him.\n\n                                         SAMI\n                          What?\n\n                                       DANIEL\n                          Can I trust you, Sami?\n\n                                       SAMI\n                          Hey, who warned you that they were coming\n                          up to the room?\n\n                                       DANIEL\n                          If they had taken us by surprise they\n                          would have gotten the tapes back. That\n                          would have left us with nothing.\n\n                                       SAMI\n                          No, that would have left me with nothing\n                          because all of you would be dead.\n\n                                       DANIEL\n                          You haven't answered my question.\n\n                                       SAMI\n                          Does it really matter what I say?\n\n                                       DANIEL\n                          I'm leaving you with my friends. I'm\n                          trusting you to do the right thing today.\n\n                                         SAMI\n                          I will.\n\n                                         DANIEL\n                          You better.\n\n               \n\n               EXT. BONANNO'S HOUSE -- MORNING\n\n               Daniel walks up to the front door and rings the bell.   Half Tooth\n               Tony opens the door and looks him up and down.\n\n                                         HALF TOOTH TONY\n                          Yeah?\n\n               \n\n                                                                          92.\n\n               \n\n                                       DANIEL\n                          I would like to see Mr. Bonanno please.\n\n                                       HALF TOOTH TONY\n                          Who the hell are you?\n\n                                       DANIEL\n                          Tell him I'm the guy who robbed Frankie\n                          Zammito.\n\n               \n\n               INT. BONANNO'S FOYER -- MORNING\n\n               Half Tooth Tony searches Daniel. He finds a small cassette player,\n               glances at it and sticks it back in Daniel's pocket.\n\n                                       HALF TOOTH TONY\n                               (points to a door)\n                          In there.\n\n               \n\n               INT. BONANNO'S LIVING ROOM -- MORNING\n\n               Daniel enters. Half Tooth Tony stands behind him, his eyes locked\n               on Daniel's every move. Bonanno is sitting in an armchair.\n\n                                       BONANNO\n                          Either you are incredibly brave, or\n                          incredibly stupid. Which one is it?\n\n                                       DANIEL\n                          I guess we're going to find out.\n\n                                       BONANNO\n                          You rob an associate of mine... a friend\n                          and--\n\n                                       DANIEL\n                               (overlapping)\n                          Not such a good friend.   May I reach in\n                          my pocket?\n\n               Bonanno looks to Half Tooth Tony.\n\n                                        HALF TOOTH TONY\n                          He's clean.\n\n               Bonanno nods.   Daniel removes the cassette player and turns it on.\n\n                                       ZAMMITO'S VOICE\n                          Of course. I need an answer from you if\n                          I'm going to move.\n\n                                       MAN'S VOICE\n                          We're not just talkin' about a 'piece of\n                          work' here Frankie. We're talking about\n                          a boss.\n\n                                       ZAMMITO'S VOICE\n                          Bonanno's a dinosaur.\n                                       (More)\n\n               \n\n                                                                          93.\n\n               \n                                       ZAMMITO'S VOICE (Cont'd)\n                          Guy thinks he's fuckin' Vito Corleone or\n                          something. The old ways are gone. If\n                          we don't change now we're going to get\n                          pushed out. I need to know if I can\n                          count on your support?\n\n               Daniel turns off the tape.   Bonanno's anger is visible.\n\n                                       DANIEL\n                          I've got to tell you, Mr. Bonanno, This\n                          guy's an idiot. How he's lived this\n                          long is a mystery.\n\n                                       BONANNO\n                               (seething)\n                          I don't think it will be a mystery much\n                          longer.\n\n                                       DANIEL\n                          He's recorded every conversation he's\n                          had with you for years.\n\n                                       BONANNO\n                          I assume you want something?\n\n                                       DANIEL\n                          We've got a lot of people looking for\n                          us. We'd just like to go home.\n\n                                       BONANNO\n                          You want me to help you get out of the\n                          country?\n\n               Daniel nods.\n\n                                       BONANNO\n                          And for my help I would get what?\n\n                                       DANIEL\n                          Half the tapes.\n\n                                       BONANNO\n                          And the other half?\n\n                                       DANIEL\n                          I'll destroy them when we get back to\n                          Paris.\n\n                                       BONANNO\n                          I only have your word for that.\n\n                                       DANIEL\n                          I just want to get my people home. I\n                          know who you are and what you could do\n                          to me if I don't honor my word.\n\n                                       BONANNO\n                          Where are you staying?\n\n               \n\n                                                                             94.\n\n               \n               Daniel grins.   He isn't going to tell him.\n\n                                       BONANNO\n                          I only ask so I can call you when the\n                          arrangements are made.\n\n                                       DANIEL\n                          How about if I call you?\n\n               \n\n               INT. COTTAGE -- MORNING\n\n               Zero and Raymond are sleeping. We hear the shower running in the\n               bathroom. Sami is at the table. The black canvas bag containing\n               the tapes is on the table. Sami removes the identical canvas bag\n               he bought at the store from under the bed and places it on the\n               table. He takes the original and leaves.\n\n               \n\n               EXT. COZY COURTS -- MORNING\n\n               Sami removes the card Hadley gave him, takes out his cell phone\n               and dials. A taxi pulls up.\n\n                                         SAMI\n                          Same place.    One hour.\n\n               Sami gets in the taxi and it drives away.     A beat.   A moment later\n               another taxi pulls up. Daniel gets out.\n\n               \n\n               INT. COTTAGE -- MORNING\n\n               Daniel enters to find Zero and Raymond still sleeping. He looks\n               at the black canvas bag on the table. Marcel steps out of the\n               bathroom wrapped in a towel.\n\n               \n\n               EXT. GRANT PARK -- MORNING\n\n               Hadley is waiting by the statue holding a cardboard box.     Sami\n               walks towards him holding the black canvas bag.\n\n                                       SAMI\n                          What the fuck was all that about at the\n                          hotel last night? I thought we had a\n                          deal?\n\n                                       AGENT HADLEY\n                          Hey, you're not exactly the most\n                          trustworthy guy in the world. I took a\n                          shot. It didn't work. Did you bring\n                          the tapes?\n\n               Sami holds up the canvas bag.\n\n                                         SAMI\n                          The lamp?\n\n               Hadley opens the cardboard box to reveal the bloody lamp base.\n               Sami hands him the canvas bag.\n\n               \n\n                                                                             95.\n\n               \n\n                                       AGENT HADLEY\n                          Just a second. You must think I'm a\n                          real moron.\n\n               Hadley removes a small cassette player from his jacket.    He picks\n               a tape and inserts it into the player.\n\n                                       ZAMMITO'S VOICE\n                          I just came by to tell that \"piece of\n                          work\" you asked for on Johnny Wicks --\n                          It's done.\n\n                                        BONANNO'S VOICE\n                          Good.   How'd he go?\n\n                                       ZAMMITO'S VOICE\n                          Like the crying rat bastard that he was.\n\n               Hadley stops the tape.   He inserts another one.\n\n                                       ZAMMITO'S VOICE\n                          Angelo, we can't lean too hard on this\n                          guy. He's a congressman.\n\n                                       BONANNO'S VOICE\n                          I made Peter Dimiano a congressman. We\n                          pay him each month to look after our\n                          interests.\n\n               Hadley grins.   This is great stuff.   He looks up at Sami.\n\n                                       AGENT HADLEY\n                          Here you go, sport.\n\n               Sami grabs the box and leaves. Hadley starts whistling a tune and\n               walks off the other way. As he reaches the tree line Lamar pops\n               out with two of his friends. All of them have guns.\n\n                                       LAMAR\n                          I'll take the bag.\n\n                                       AGENT HADLEY\n                          You don't think I see through this?     You\n                          tell Sami he's dead.\n\n               One of Lamar's guys searches through Hadley's pockets, finds his\n               gun, then takes his wallet.\n\n                                       AGENT HADLEY\n                          You're making a big mistake.    I'm an FBI\n                          agent.\n\n               Hadley stares at Lamar defiantly. Lamar cocks the hammer back on\n               his gun and presses the barrel to Hadley's forehead. Hadley drops\n               the canvas bag.\n\n               Lamar picks up the canvas bag and runs away. Hadley stands there\n               fuming. Lamar runs towards the statue and disappears behind it.\n\n               ANGLE -- BEHIND THE STATUE\n\n               \n\n                                                                           96.\n\n               \n               Daniel is waiting, holding the other black canvas bag.   As Lamar\n               passes they quickly exchange bags.\n\n               From Hadley's point of view Lamar has merely run behind the statue\n               as he heads for the street. Lamar runs a few more steps, then\n               stumbles and falls... several cassette tapes spill out of it.\n               Lamar's buddies are already at the street.\n\n                                        LAMAR'S BUDDIES\n                          C'mon, man!   Let's get out of here.\n\n               Lamar gets up, looks at the bag, pretends to be panicked.   He runs\n               off leaving the bag laying on the grass.\n\n               ON HADLEY: He can't believe his luck. He runs over, picks up the\n               loose cassettes and puts them back in the bag, then leaves.\n\n               ON DANIEL: he peers out from behind the fountain, watching as\n               Hadley walks off in the other direction.\n\n               \n\n               EXT. STREET CORNER -- MORNING\n\n               Daniel arrives to find Sami and Lamar.\n\n                                       SAMI\n                          See, I told you that you could trust me.\n\n               Daniel grins and pats him on the back.\n\n                                       LAMAR\n                          Okay, we're square now, right?\n\n                                       DANIEL\n                          There's just one more thing I need you\n                          to do.\n\n               Lamar is about to protest when Daniel takes out a roll of bills.\n\n                                       LAMAR\n                          I'm listening.\n\n               \n\n               INT. TAXI -- MOVING -- DAY\n\n               Daniel and Sami sit in the back.   Daniel is on his cell phone.\n\n                                       DANIEL\n                               (into phone)\n                          Mr. Bonanno, I was wondering if you--\n                               (listens)\n                          That would be fine. Thank you.\n\n               \n\n               INT. FBI HEADQUARTERS -- DAY\n\n               Hadley enters with the black canvas bag.    The RECEPTIONIST hands\n               him a package.\n\n                                       RECEPTIONIST\n                          This came for you.\n\n               \n\n                                                                          97.\n\n               \n\n               INT. HADLEY'S OFFICE -- DAY\n\n               Hadley opens the package and finds a video cassette. Hadley pops\n               the cassette into the VCR. On the screen we see Sami speaking\n               into a video camera.\n\n                                       SAMI\n                          Since we're such good pals I thought I'd\n                          sneak you an advanced copy of my latest\n                          work. I call it, \"I am a scum-sucking\n                          FBI agent\".\n\n               On the television screen we see Hadley and Sami in the park on\n               their first meeting.\n\n                                       SAMI\n                          You want the tapes for yourself.     You're\n                          going to sell them.\n\n                                       AGENT HADLEY\n                          I'm going to retire with a shit-load of\n                          money. Find me a small country that\n                          doesn't have an extradition treaty with\n                          the States and live the good life.\n\n                                       SAMI\n                          You didn't have to kill Sophie.\n\n                                         AGENT HADLEY\n                          Yes I did.    Lose ends are messy.\n\n               The color drains from Hadley's face.   Sami reappears, talking into\n               the camera again.\n\n                                       SAMI\n                          It's a little arty I know, but it has\n                          great content, don't you think? You\n                          were so busy looking for a wire you\n                          probably didn't even think about a video\n                          camera. It was on the statue. Anyway,\n                          I've sent a copy of the whole tape to\n                          the Chicago P.D. and the FBI. They'll\n                          get it tomorrow. If I were you I'd take\n                          the day off.\n\n               The tape turns to static. Hadley tries to think. He takes the\n               VHS tape from the machine, then picks up his phone and starts to\n               dial a number. A beat. He thinks better of it, hangs up and uses\n               his cell phone.\n\n               \n\n               INT. SOUTH SIDE SOCIAL CLUB -- DAY\n\n               Eddie is on the phone.   Zammito is at his usual table.\n\n                                       EDDIE\n                          Hey boss, some guy named Hadley.     Says\n                          he's got some tapes you want?\n\n               Zammito springs out of his seat and grabs the phone.\n\n               \n\n                                                                          98.\n\n               \n\n                                         ZAMMITO\n                          Yeah?\n                               (listens)\n                          How much? Are you nuts?\n                               (listens)\n                          Okay. Okay. There's an old warehouse\n                          on Merchant Street...\n\n               \n\n               EXT. SOUTH SIDE SOCIAL CLUB -- DAY\n\n               Zammito and Joey \"Two Tons\" rush to the car carrying a briefcase.\n\n               \n\n               EXT. VINNY ZAMMITO'S HOUSE -- DAY\n\n               Raymond knocks on the door.   Vinny answers it, his arm in sling.\n\n                                         RAYMOND\n                          Mr. Zammito?\n\n                                         VINNY\n                          Uh huh.\n\n                                       RAYMOND\n                          I represent a person who wishes to remain\n                          anonymous, but is aware of your current\n                          financial problems with your brother.\n\n                                       VINNY\n                          I don't know what you're talking about.\n\n                                       RAYMOND\n                          I understand. The person who sent me\n                          wishes to help you.\n\n                                         VINNY\n                          How?\n\n                                       RAYMOND\n                          You see that car?\n\n               Vinny looks on the street and sees the Impala.\n\n                                         VINNY\n                          Yeah.\n\n                                       RAYMOND\n                          It's yours. A gift. A gift you could\n                          give to your brother... or anyone you\n                          owe money to as partial payment.\n\n                                         VINNY\n                          No shit?\n\n                                       RAYMOND\n                          The papers for the car will arrive\n                          tomorrow.\n\n               \n\n                                                                              99.\n\n               \n\n               EXT.   MERCHANT STREET WAREHOUSE -- DAY\n\n               An old building, dirty windows and peeling paint.       The main door\n               is open.\n\n               \n\n               INT. MERCHANT STREET WAREHOUSE -- DAY\n\n               Zammito and Joey \"Two Tons\" are standing next to Zammito's Lincoln.\n               Hadley parks ten yards away and gets out with the black canvas\n               bag.\n\n                                        ZAMMITO\n                           Those the tapes?\n\n               Hadley starts to place the canvas bag on the hood of Zammito's\n               car.\n\n                                        ZAMMITO\n                           Watch the paint.\n\n               Hadley opens the bag.     It is filled with cassette tapes.\n\n                                          AGENT HADLEY\n                           The money?\n\n               Zammito nods to Joey \"Two Tons\" who opens another briefcase filled\n               with cash.\n\n                                        ZAMMITO\n                           How'd you get these?\n\n                                          AGENT HADLEY\n                           I got 'em.    That's all you need to know.\n\n               Hadley starts to go.     Zammito motions him to stop.\n\n                                        ZAMMITO\n                           Just a second.\n\n               Zammito picks a tape and tosses it to Joey \"Two Tons.\" Who puts\n               the cassette into the cars cassette player. Suddenly we hear Wayne\n               Newton singing \"Danke Schoen.\"\n\n                                        WAYNE NEWTON'S VOICE\n                           Danke Schoen, darling Danke Schoen.\n                           Thank you for all the joy and pain...\n\n               Hadley's face turns white.     He produces an audible gulp as he looks\n               at Zammito weakly.\n\n               \n\n               EXT. MERCHANT STREET WAREHOUSE -- CONTINUOUS\n\n               The music continues as we hold on a wide shot of the building.\n\n                                        WAYNE NEWTON'S VOICE\n                           Pictures show, second balcony, was the\n                           place we'd meet...\n\n               Through the dirty windows we see several flashes as the air fills\n               with gunfire.\n\n               \n\n                                                                         100.\n\n               \n\n                                       WAYNE NEWTON'S VOICE\n                          ... second seat, go Dutch treat, you\n                          were so sweet...\n\n               Zammito's Lincoln pulls out of the warehouse and drives down the\n               street.\n\n               \n\n               INT. LINCOLN -- MOVING -- AFTERNOON\n\n               Music continues in the cassette deck.   Joey \"Two Tons\" drives.\n               Zammito sits in the passenger seat.\n\n                                       ZAMMITO\n                          Can you believe that guy?    What a moron.\n\n                                       JOEY \"TWO TONS\"\n                               (referring to cassette)\n                          Good song though.\n\n                                       ZAMMITO\n                          Great fuckin' song.\n\n               \n\n               EXT. PRIVATE AIRPORT -- AFTERNOON\n\n               Sami, Marcel and Raymond help Zero out of the taxi and towards a\n               small plane. Off to the side Bonanno is standing with Half Tooth\n               Tony. Daniel walks over to him.\n\n                                       BONANNO\n                          This plane will take you to Canada.\n                          From there you can fly back to Paris.\n\n                                         DANIEL\n                          Thank you.\n\n                                       BONANNO\n                          You have something for me?\n\n               Daniel hands him the cassette case with half the tapes. Bonanno\n               hands it to Half Tooth Tony who takes them into the car and listens\n               to a tape.\n\n                                       HALF TOOTH TONY\n                          They're good, boss.\n\n                                       BONANNO\n                          And the other half of the tapes?\n\n                                       DANIEL\n                          You have my word. I'll destroy them.\n\n               \n\n               EXT. SOUTH SIDE SOCIAL CLUB -- AFTERNOON\n\n               The Lincoln pulls up. Zammito and Joey \"Two Tons\" get out.   Vinny\n               is waiting beside the Impala.\n\n                                         ZAMMITO\n                          What's this?\n\n               \n\n                                                                           101.\n\n               \n\n                                           VINNY\n                          A car.\n\n                                       ZAMMITO\n                          Oh really? Thanks. I thought it was a\n                          sewing machine. What the hell is it\n                          doing here?\n\n                                           VINNY\n                          It's for you.\n\n                                       ZAMMITO\n                          For me? What am I going to do with a\n                          piece of shit like this?\n\n                                       VINNY\n                          I don't know. Sell it. It's gotta be\n                          worth something. Someone gave it to me.\n                          C'mon Frankie, I'm trying to make good\n                          here.\n\n                                           ZAMMITO\n                          Okay.    Okay.\n\n                                       VINNY\n                          I'll get you the papers tomorrow.\n\n               Vinny starts to walk away.\n\n                                        ZAMMITO\n                                (yelling after him)\n                          Hey, if you're well enough to be walking\n                          around you're well enough to start working\n                          here.\n\n               \n\n               EXT. MEXICAN RESTAURANT -- AFTERNOON\n\n               A gang hang out. Raphael is with several hard-looking gang-bangers.\n               Lamar arrives with two of his friends.\n\n                                           RAPHAEL\n                          You lost?\n\n                                       LAMAR\n                          Don't come off like a hard-on with me.\n                          I'm about to make you a very happy man.\n\n               \n\n               EXT. GANG HANGOUT -- AFTERNOON\n\n               Several Gang Bangers stand around their low rider cars. Sananta's\n               \"Oye Como Va\" plays loudly on one of the radios. Raphael talks\n               heatedly with several of the gang bangers.\n\n               \n\n               A SERIES OF QUICK CUTS\n               Music continues as several gang members check their guns.\n\n               \n\n                                                                         102.\n\n               \n\n               EXT. STREET -- AFTERNOON\n\n               The Santana song continues as several car loads of Gang Bangers\n               drive down the street.\n\n               \n\n               INT. SOUTH SIDE SOCIAL CLUB -- AFTERNOON\n\n               The air is thick with cigar smoke. Several GUMBAS hang around the\n               bar. Zammito is at his table with Joey \"Two Tons\" and Nicky \"The\n               Rake.\" DEAN MARTIN \"Return To me\" plays on the jukebox.\n               Outside we hear the sound of cars pulling up and screeching to a\n               stop. The door opens and Raphael and ten other very tough-looking\n               GANG MEMBERS step inside. The room falls silent, except for Dino\n               on the jukebox. Zammito stands up.\n\n                                         RAPHAEL\n                            Anybody know about that car outside?\n\n                                          ZAMMITO\n                            Yeah.   It's mine.\n\n                                          RAPHAEL\n                            No.   It's mine.\n\n                                         ZAMMITO\n                            The hell it is.\n\n                                         RAPHAEL\n                            I'm telling you that's my car!   And\n                            someone's gonna pay for it!\n\n                                         ZAMMITO\n                            And I'm tellin' you it ain't! Now, turn\n                            your taco-eating ass around and get the\n                            hell out of here.\n\n                                         RAPHAEL\n                            Fuck you, grease-ball!\n\n                                          ZAMMITO\n                            Fuck me?   Fuck you!\n\n               They are right on the edge of having a major disaster. The Dean\n               Martin song ends. Dead quiet. Each group watches the other to\n               see who's going to make the first move.\n               The jukebox selects another record. The needle scratches against\n               the vinyl intro. We hear the intro to JERRY VALE singing \"Amore\n               Scusami\".\n\n               \n\n               SERIES OF QUICK CUTS\n               --   Raphael's eyes burn into Zammito's\n               --   A Gang-Bangers eyes dart from side to side.\n               --   A Wiseguy bites his lip.\n               --   Nicky \"The Rake\" twitches his fingers nervously.\n               --   Sweat glistens on the forehead of Joey \"Two Tons\".\n\n               \n\n                                                                         103.\n\n               \n               At the bar Eddie reaches behind for something without looking. He\n               knocks over a bottle. It falls to the floor and breaks. The noise\n               is enough to push things over the edge.\n\n                                       JERRY VALE'S VOICE\n                          My love, forgive me...\n\n               Raphael goes for his gun.   All hell breaks loose! People dive for\n               cover as shots rings out.   In the close quarters it's like shooting\n               fish in a barrel.\n\n                                       JERRY VALE'S VOICE\n                          I didn't mean to have it end like this...\n\n               Eddie lifts a shotgun from behind the bar and blows away a gang\n               member. Another gang member kills him.\n               It's a massacre! Bodies drop like flies. The room is so thick\n               with smoke you can't see two feet in front of you. Finally it is\n               quiet.\n\n                                       JERRY VALE'S VOICE\n                          I didn't mean to have you fall in love,\n                          in love with me...\n\n               We move through the room, past the carnage. Smoke swirls, blood\n               covers the floor. Raphael is dead. Along with Joey \"Two Tons\"\n               and Nicky \"The Rake\" On the floor, Zammito is against the bar.\n               He sits up, amazed that he is untouched. He gets to his feet and\n               makes his way to the front door.\n\n               \n\n               EXT. SOUTH SIDE SOCIAL CLUB -- AFTERNOON\n\n               Music continues. Zammito staggers outside and into the street.\n               He laughs, a nervous laugh at his good fortune.\n\n                                       JERRY VALE'S VOICE\n                          My love, please kiss me...\n\n               Zammito turns around to see\n               ZAMMITO'S POV -- A Lincoln Town car speeding towards him. Through\n               the windshield he can see the smiling face of Half Tooth Tony.\n               The front of the car slams into Zammito, lifting him into the air.\n               He flips head over heals then smashes into the windshield and over\n               the car. He lays in the middle of the street, dead.\n               The Lincoln speeds off down the street.\n\n                                       JERRY VALE'S VOICE\n                          Arrivederci amore kiss me...\n\n               \n\n               INT. BONANNO'S HOUSE -- AFTERNOON\n\n               Music continues. Bonanno sits on his couch, eating a cannoli as\n               he watches Judge Judy on television..\n\n               \n\n                                                                          104.\n\n               \n\n                                       JERRY VALE'S VOICE\n                          Remember when we part...\n\n               \n\n               INT. MERCHANT STREET WAREHOUSE -- AFTERNOON\n\n               Music continues. Agent Hadley is leaning against his car, his\n               eyes open, a large bullet hole in his head.\n\n                                       JERRY VALE'S VOICE\n                          You'll have my heart...\n\n               \n\n               INT. SOPHIE'S WAREHOUSE -- AFTERNOON\n\n               Music continues. Wayne is sitting on the couch, an open package\n               on the coffee table. He smiles as he stares at the stacks of cash\n               the crew took from Zammito.\n\n               \n\n               INT. PLANE -- MOVING -- AFTERNOON\n\n               Music continues.    The crew sits quietly.\n\n                                       JERRY VALE'S VOICE\n                          I love you so...\n\n               \n\n               EXT. PLANE -- MOVING -- AFTERNOON\n\n               Jerry Vale continues singing as the plane glides through a clear\n               blue sky. Music fades.\n\n               \n\n                                                                  DISSOLVE TO:\n\n               \n\n               EXT. BASTALDI'S'S WAREHOUSE -- PARIS -- MORNING\n\n               Bastaldi steps outside into the crisp morning air.    He takes a few\n               steps, then stops.\n\n               BASTALDI POV -- across the street, standing side by side are Daniel,\n               Sami, Raymond, Marcel and Zero. They look like a ragged bunch,\n               tired, dirty. We PAN across the faces of each one of them as they\n               stare at Bastaldi.\n\n               A BUS goes by blocking Bastaldi's view of the boys.   When it passes\n               the crew it gone!\n\n               Bastaldi bites his lip nervously.    Bastaldi looks around, but there\n               is no sign of them.\n\n               \n\n               A DIFFERENT ANGLE\n               We can see the five of them crouched behind a parked car. Marcel\n               peers through the window at Bastaldi who is still trying to figure\n               out where they went. They are all amused with Bastaldi's\n               bewilderment.\n\n                                       RAYMOND\n                          What's he doing?\n\n               \n\n                                                                        105.\n\n               \n\n                                       MARCEL\n                          He's looking around for us.\n\n                                       ZERO\n                          Zero can't stay like this much longer.\n                          His leg is hurting.\n\n               Finally, Bastaldi turns around and goes back into his apartment.\n\n               \n\n               INT. BASTALDI'S WAREHOUSE -- DAY\n\n               Bastaldi is at his desk, nervously tapping his fingers on the\n               surface. The phone rings. He knows who is calling. He stares at\n               the phone for a long moment, then he slowly lifts the receiver.\n\n                                       BASTALDI\n                          Hello?\n\n                                       DANIEL (V.O.)\n                               (in French)\n                          It's Daniel.\n\n                                       BASTALDI\n                               (in French)\n                          Daniel. Listen I'm afraid there has\n                          been a big--\n\n                                       DANIEL (V.O.)\n                               (overlapping; in French)\n                          -- I've got the tapes. If you ever want\n                          to see your brother out of jail do exactly\n                          what I say. Bring one million euros to\n                          your boat at six o'clock.\n\n                                       BASTALDI\n                               (in French)\n                          A million! I don't have that kind of\n                          money.\n\n                                        DANIEL (V.O.)\n                               (in French)\n                          Don't bullshit me, Laurant!   I know about\n                          the Van Gogh.\n\n                                       BASTALDI\n                               (In French)\n                          I don't have it. That's why Vincent\n                          went to Chicago. They arrested him before\n                          he could bring it back.\n\n                                       DANIEL (V.O.)\n                               (in French)\n                          Well, you better get the money somehow.\n                          Six o'clock and come alone. If you don't\n                          we'll destroy the tapes.\n\n               The line goes dead.\n\n               \n\n                                                                          106.\n\n               \n\n               EXT. HOUSEBOAT -- AFTERNOON\n\n               Bastaldi drives up.    He gets out carrying a suitcase and nervously\n               walks to the boat.\n\n               \n\n               INT. HOUSEBOAT -- AFTERNOON\n\n               Bastaldi enters. No one appears to be there.    Bastaldi's cell\n               phone rings. He answers it.\n\n                                       DANIEL (V.O.)\n                               (in French)\n                          Go back on deck. There's a small rowboat\n                          in the water --\n\n               \n\n               EXT. OTHER SIDE OF RIVER -- CONTINUOUS\n\n               Daniel, Sami and Zero watch the houseboat.   Daniel continues his\n               conversation on the cell phone.\n\n                                       DANIEL\n                               (in French)\n                          Put the money in the rowboat and untie\n                          it. The current will carry it down river.\n                          When we see that the money is there I'll\n                          call back and tell you where the tapes\n                          are.\n\n               DANIEL'S POV: Bastaldi appears on deck. He puts the suitcase in\n               the rowboat and unties it. It drifts slowly into the current.\n\n               \n\n               EXT. DOWN RIVER -- AFTERNOON\n\n               The rowboat hugs the shore, moving slowly down the river. Marcel\n               is on the shore with Raymond. Raymond reaches out with a long\n               pole and pulls the boat to shore. Marcel opens the case. Inside\n               are several stacks of five hundred franc notes. Marcel looks to\n               Raymond with a grin and nods. Raymond opens his cell phone.\n\n               \n\n               EXT. OTHER SIDE OF RIVER -- CONTINUOUS\n\n               Daniel, Sami and Zero continue to watch the houseboat.   Sami's\n               cell phone rings. He answers it and listens.\n\n                                       RAYMOND (V.O.)\n                          We're in business.\n\n               Sami nods to Daniel.\n\n               \n\n               EXT. HOUSEBOAT -- AFTERNOON\n\n               Bastaldi's cell phone rings.   He answers it.\n\n                                       DANIEL (V.O.)\n                               (in French)\n                          Go down into the main cabin.   The tapes\n                          are in the wooden chest.\n\n               \n\n                                                                        107.\n\n               \n               The line goes dead.\n\n               \n\n               INT. HOUSEBOAT -- AFTERNOON\n\n               Bastaldi enters, looks around the room until he sees the wooden\n               chest. He walks over and opens it. Inside there are several\n               cassette tapes in the cardboard box.\n               Bastaldi grins and lifts the cardboard box out of the chest. He\n               hears a CLICK. He notices something is attached to the bottom of\n               the cardboard box. It's a long thin wire that has pulled the pin\n               on an electronic device.\n\n               \n\n               EXT. ACROSS THE RIVER -- CONTINUOUS\n\n               Daniel is now holding small, black device. A yellow light starts\n               flashing. He puts his finger on a red button.\n\n                                       DANIEL\n                          This is for Julien.\n\n               He presses the button.\n\n               \n\n               INT. HOUSEBOAT -- CONTINUOUS\n\n               A digital counter begins counting backwards. Bastaldi realizes\n               that the device is a BOMB. He stares at the numbers quickly speed\n               by 8... 7... 6... 5...\n\n                                        BASTALDI\n                          Oh, Merde!\n\n               \n\n               EXT. HOUSEBOAT -- FIVE SECONDS LATER\n\n               The houseboat explodes in a brilliant fireball, sending pieces of\n               wood and metal flying into the air. A thick plume of black smoke\n               swirls in the wind.\n\n               \n\n               EXT. ACROSS THE RIVER -- AFTERNOON\n\n               Daniel, Raymond, Sami, Raymond, Marcel and Zero watch the smoldering\n               wreckage. Their blank faces show no emotion -- just a sense that\n               justice has been done.\n\n                                       SAMI\n                          Did you have to use that much explosive?\n\n                                       DANIEL\n                          I promised Bonanno I'd destroy the tapes.\n\n               Raymond opens the suitcase and looks inside. As he peels through\n               the stacks of money we see that only the top bill of each stack is\n               real -- underneath them all is white paper, cut to the same size\n               as the bills. Everyone turns to Marcel.\n\n                                       DANIEL\n                          You didn't check it?\n\n               \n\n                                                                           108.\n\n               \n\n               EXT. BRIDGE -- AFTERNOON\n\n               The five of them walk across the bridge.\n\n                                       MARCEL\n                          I'm sorry! I was caught up in the\n                          excitement of the moment. I should have\n                          checked. I made a mistake. I suppose\n                          that none of you have ever made a mistake\n                          before?\n\n               No one answers him. Sami reaches inside the black canvas bag and\n               removes the autographed baseball Marcel took from Zammito.\n\n                                       SAMI\n                          This is great. After everything we've\n                          been through we've got eight hundred\n                          euros and an autographed baseball.\n\n                                       MARCEL\n                          The baseball is mine.\n\n                                       SAMI\n                          No! You can't have the baseball! You're\n                          not entitled to the fuckin' baseball!\n\n               Sami throws the baseball back in the canvas bag.\n\n                                       MARCEL\n                          I'm the one who took it.   It's my\n                          baseball!\n\n                                       ZERO\n                          If you say baseball one more time Zero\n                          will shoot you.\n\n                                       MARCEL\n                          Raymond, don't you think they're over\n                          reacting a little?\n\n                                       RAYMOND\n                          No. I think they have a right to express\n                          their anger with you in light of the\n                          fact that you're...\n                               (something in him\n                                snaps)\n\n                          A FUCKIN' MORON! HOW COULD YOU NOT CHECK\n\n                          THE MONEY, YOU GOD DAMN STUPID SHIT-HEAD!\n\n               Raymond's anger takes everyone by surprise.     Even Raymond is\n               surprised by his outburst.\n\n                                       MARCEL\n                          Fine. All of you want to be angry? Be\n                          angry... but I'm the one who took the\n                          ball and that makes it mine.\n\n                                          SAMI\n                          No.\n\n               \n\n                                                                          109.\n\n               \n\n                                       MARCEL\n                          Give it to me, Sami.\n\n                                        SAMI\n                          No!\n\n               Marcel tries to take the ball out of the bag. Sami pulls it away.\n               Marcel grabs the bag. Both of them tug on it. Marcel pulls hard\n               and the bag rips down the seam. The baseball falls out and rolls\n               off the bridge into the river.\n\n                                        SAMI\n                          Perfect.\n\n               Marcel stands there holding the inside liner of the bag.\n               Sami throws the canvas bag to the ground in frustration.\n               Something catches Daniel's attention.\n\n               DANIEL'S POV -- of the black canvas. The lining has been ripped\n               away. A light breeze blows lifting the underside of the black\n               canvas. There is a flash of color. Another gust of wind turns\n               the black canvas over. On the other side is Van Gogh's \"Vase with\n               twelve sunflowers\".\n\n               Daniel's jaw drops.   The others notice his stunned expression and\n               follow his stare.\n\n               THEIR POV -- of the priceless painting.\n               They stand there, too shocked to move at first, then rush forward.\n               They have almost reached the painting when a truck passes them.\n               The wind kicks up the painting, blowing it over the railing. They\n               reach out to grab it, but it is too far away. They stand there,\n               watching as it slowly floats down to the river below.\n\n               \n\n               EXT. BRIDGE -- WIDE SHOT -- AFTERNOON\n\n               They look at one an other, then without speaking a word they all\n               jump off the bridge. As they fall towards the water we...\n\n               \n\n                                                                  FREEZE FRAME\n\n               \n \n\n\n\n\nCrime Spree\nWriters :   Brad Mirman\nGenres :   Crime  Comedy\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "A woman, desperate to start a new life for herself and her two children, flees from her drug dealing husband only to end up living on the streets. Broke and bottomed out, she abandons her kids and embarks on a 24 crime spree in a frantic attempt to steal enough money to save herself and her children."}