{"title": "Dark City", "full_text": "\"Dark City\", early, by Alex Proyas\n\n\n\n   \n\n\n\n\n\n\n\n\n\n\n\n\n                              DARK CITY\n\n                                 by\n                             Alex Proyas\n\n\n\n\n\n\n\n                            REVISED DRAFT\n                         November 29th, 1992\n\n\n\n\n\n     DARKNESS\n\n     A LOW RUMBLE increases in volume.\n\n\n     FADE UP:\n\n     A BLACK-GLOVED HAND wraps around a bulky electrical lever,\n     thrusts FORWARD.\n\n     SNAP!  -  Electricity arcs through darkness.\n\n     O.S. sound of MACHINERY turning ON.\n\n     TITLES OVER\n\n     MONTAGE OF CLOCKS starting  -  various.  Second hands turn  -\n     TICKING gets louder.\n\n\n     INT.  BATHROOM  -  NIGHT\n\n     SHADOWS DANCE.  A bare bulb swings from the ceiling revealing:\n     clothes on a chair, puddles of water on the floor...\n\n     SLEEPING EYES in and out of darkness.  The eyes open.\n     Confusion.\n\n     WIDEN ANGLE ON JONATHAN WHITE  -  a man in his early thirties,\n     dark featured.\n\n     He sits up.  Water splashes.  He's in a tub of long cold water.\n     His neck aches like he's been sleeping forever.\n\n     He looks down into the murky water around him.  A feint\n     movement beneath the surface, something swimming  -  A SMALL\n     DARK SHAPE.  Startled, he leaps from the bath.\n\n     ANGLE  -  THE SWINGING LIGHT BULB.  The man's hand reaches up,\n     stops the light-bulb mid swing.\n\n     He steps to a circular window.  The glass is cracked, covered\n     in grime.  He wipes it, this only smears the dirt.\n\n     It's dark out there.\n\n\n     EXT.  BUILDING  -  NIGHT\n\n     ANGLE ON WHITE  -  from outside the window, through blurry\n     glass.\n\n     A RAPID FLYING P.O.V. PULLS BACK in silence.  The window is a\n     SPECK on the side of a vast grey tower.\n\n     BACK IN THE BATHROOM\n\n     White shivers, cold.  He stares down at the puddle he drips on\n     the floor.  He looks at his feet and legs, covered with\n     numerous SMALL BITES.  He dries the bloody wounds with a towel.\n\n     He picks up the clothes lying on the chair, puts them on.\n     Loose trousers with braces, a plain shirt, leathers shoes with\n     HOLES in both soles.  In his trouser pocket he finds a key  -\n     a room number on a plastic tag.\n\n     He hears splashing in the bath-tub.  He steps over, looks into\n     the murky water.  Suddenly a SMALL SILVER FISH leaps from the\n     water, lands at his feet, panting heavily and flapping about.\n\n     He leans down, picks the fish up, throws it back into the\n     water.\n\n     Like a blind man, he feels the walls, comes to a door in the\n     shadows.  He hears something on the other side, hesitates, hand\n     inches from the doorknob.  He leans down.\n\n     TIGHT ON HIS EYE\n\n     Blinking through the key-hole.\n\n     P.O.V. OF AN EMPTY ROOM  -  A glimpse of motion  -  the door\n     across the room (leading to a corridor?) is shutting.\n\n\n     INT.  HOTEL ROOM  -  NIGHT\n\n     WHITE pushes the door open, steps into the adjoining room.\n\n     No sign of life.  Cheap decorations.  He walks around\n     cautiously.  Turns lights on.  Then reconsiders.  Turns them off\n     again.  Disturbed, he studies his features in a wall mirror.\n\n     ANGLE ON OPEN BATHROOM DOOR  -  the fish has jumped from the tub\n     again and is flapping on the floor.\n\n     White steps back into the bathroom.  He picks up the fish again,\n     doesn't know what to do with it, so he puts it in his pocket.\n\n     BACK IN THE OTHER ROOM\n\n     He searches through things.  A grey overcoat in the closet.  He\n     goes through the pockets, finds a WALLET.  No I.D., just a\n     laundry bill, some money and a postcard from a sea-side town.\n\n     ANGLE ON A REVOLVER on the bed-side table.  He picks it up, his\n     grip tightens on the handle, his finger applies pressure to the\n     trigger and...\n\n     BANG!\n\n     The gun goes off.  A BULLET RICOCHETS wildly around the room,\n     bounces off the metal bed-head, smashes a vase, embeds itself\n     in the wall.\n\n     Startled, he holds the gun away from him like it might go off\n     again.  He examines it carefully now.  Opens the chamber.\n\n     TIGHT ON THE GUN  -  Five bullets left.\n\n     He turns the chamber carefully, shuts it, puts the gun in the\n     inside pocket of the coat.\n\n     He moves to the bed.  A RIPPED PHOTOGRAPH on the rug.  A\n     fragment of a woman's face, her left eye.  He lifts the\n     fragment up.  There's handwriting on the back, part of a note:\n\n               ...MEANS THE MOST TO ME.  LOVE YOU\n               FOREVER.  -  E...\n\n     The rest is missing.\n\n     He sits on the edge of the bed.  As he does this, he notices\n     something else on the floor.\n\n     HIS P.O.V.  -  follows a dark stain on the floorboards, to a\n     woman's bare foot behind the bed.  He stands abruptly, fumbles\n     across the bed to stare into a dark corner of the room.\n\n     In the shadows he can make out a woman's naked BODY lying in a\n     pool of blood.  Her eyes stare lifeless.\n\n     White stumbles back in horror, throws his hands across his\n     mouth.\n\n\n     INT.  HOTEL CORRIDOR  -  NIGHT\n\n     White stumbles from the room, leans against a wall for support.\n\n     Lights flicker.\n\n     At the end of the corridor, elevator doors open.  Light and\n     musak flood out.\n\n\n     INT.  LOBBY  -  NIGHT\n\n     White staggers from the elevator, moves past a deserted front\n     desk.  A VOICE from the back room:\n\n                         HOTEL MANAGER O.S.\n               Hey, you! You gotta message.\n\n     White stops, looks uncertainly towards a bead curtain.\n\n                         WHITE\n               What?\n\n                         MANAGER O.S.\n               Message in d'box!  You deaf?\n\n     White sees several nooks for messages and keys in front of him.\n     Reaching across the desk, he glances through the bead curtain\n     into the manager's office.  TELEVISION SOUNDS O.S.\n\n     HIS P.O.V.\n\n     Hard to see  -  the man sits in the chair, lit by the glow of\n     the T.V. set.  White grabs the note, looks at it.  A PHONE\n     NUMBER, also his room number, and what appears to be his name:\n     JONATHAN WHITE.  That's all.  White thrusts the message in his\n     pocket.\n\n                         MANAGER O.S.\n               Got my money?\n\n                         WHITE\n               What?  I...  How long have I been\n               here?\n\n                         MANAGER O.S.\n               Jeez, too damn long if you ask me!\n               What about the two weeks y'owe me...\n\n     Totally confused, White turns to leave, sees something.  Stops.\n\n     HIS P.O.V.  -  A painting on a wall (cheap print variety)  -\n     waves on a beach.  A breeze rustles the pages of a calender,\n     pinned beside the picture.\n   \n     TIGHT ON WHITE  -  MOVE IN on his ear.  O.S. SOUND  -  surf\n     crashes on shore.  A WOMAN'S VOICE WHISPERS:\n\n                         VOICE O.S.\n               What is your name...  What is your\n               name...\n\n     He backs away from the painting, looks about the lobby in panic\n     -  sees a sign:  TOILETS.  A painted hand points the way.\n\n                         MANAGER O.S.\n               Hey!\n\n                         WHITE (without turning)\n               I'll be back later.\n\n                         MANAGER O.S.\n               Yeah.  Well, y'better be.\n          \n     CAMERA REVEALS A FIGURE  -  watching from a shadowy corner of\n     the lobby.\n\n     As White runs out, the MYSTERY MAN picks up a pay-phone, dials.\n     Whispers into the receiver in a foreign language.\n\n\n     INT.  CORRIDOR  -  NIGHT\n\n     White pushes shakily through a red door, runs down a corridor.\n     Pipes steam and drip water.  He rounds a corner, slips, nearly\n     falls.\n\n\n     INT.  MEN'S ROOM  -  NIGHT\n\n     Puddles on the floor, stains on the walls.\n\n     White bursts through the door and into a cubicle.  He bends\n     over a toilet bowl and VOMITS.\n\n     ANOTHER ANGLE\n\n     He looks up, wipes his mouth on his sleeve.  A breeze tugs at\n     his stringy hair.  A tiny ventilation grill above the cistern\n     looks out at the street.\n\n     HIS P.O.V.  -  OUTSIDE\n\n     Sheets of newspaper blow past.  A full moon, surrounded by\n     blood red clouds, hangs above empty streets.\n\n\n     INT.  CINEMA  -  NIGHT\n\n     A WATCH  -  on a hairy wrist.  Seconds tick past.  Soft\n     flickering light.  VOICES O.S.\n\n     ANGLE ON FRANK BUMSTEAD  -  police inspector.  He looks down at\n     the watch.  Time to leave.  He STANDS, heads for an illuminated\n     exit sign.\n\n     Images flicker on a SCREEN.  The inspector rushes to the door,\n     runs into an USHER, who gasps.\n\n                         BUMSTEAD (to usher)\n               Gesundheit!\n\n     Bumstead quickly moves off.\n\n\n     INT.  CINEMA LOBBY\n\n     The INSPECTOR makes a call, licks the tip of a pencil,\n     scribbles in a notebook.  Behind thick glass, he argues\n     soundlessly into a phone.\n\n     BIG IN FOREGROUND  -  a popcorn machine rattles noisily.\n\n     INSIDE THE BOOTH\n\n     The inspector is upset, face strained.  A MALE VOICE chatters\n     quickly through the receiver.\n\n                         BUMSTEAD (cuts in)\n               ...but you told me the meeting was\n               ten-thirty.\n\n     A burst of chatter.\n\n                         BUMSTEAD\n               I know, sir, but I can't make it at\n               nine-thirty...  It's  -  um  -  well,\n               inconvenient...\n\n     A stream of chatter stops him.\n\n                         BUMSTEAD\n               Yes, sir...  I understand...  Yes...\n               But, I've done fine so far without an\n               assistant...\n\n     The inspector tries to interject as the VOICE cuts in again...\n\n                         BUMSTEAD\n               But...  But I...  I...\n                    (defeated)\n               Nine-thirty.  Yes.\n\n\n     INT.  MEN'S ROOM\n\n     We are underwater.  WHITE's FACE swims into view.  Bubbles spew\n     from the mouth,  the eyes stare in horror.\n\n     ANGLE ON MEN'S ROOM\n\n     White washes his face in a sink.  He looks up, wipes his face\n     dry with his coat.  He turns towards the door to leave.\n\n     There are TWO  -  identical.  He cannot remember which he came\n     through.  Takes a guess, opens one and steps into darkness.\n\n     He realizes he's picked the wrong door, tries to go back but\n     the door CLICKS behind him:  locked.\n\n\n     INT.  CONCRETE TUNNEL\n\n     Pitch black.  Trickling water.  A distant voice over a P.A.\n     system recites names, followed by numbers.  A LIGHT, far away.\n     White walks towards it.\n\n     He steps into a bare concrete area, a public phone hangs on a\n     blank wall.  He pulls a coin from his pocket, puts it in the\n     slot, dials the number on his message.  Ringing  -  no answer.\n\n     Suddenly White feels cold.\n\n                         VOICE O.S.\n               There you are.\n\n     Startled, White drops the phone and turns.  A figure moves\n     forward out of darkness:\n\n     ANGLE ON THE MYSTERY MAN from the hotel lobby.  The stranger\n     wears a long black coat, dark glasses, and has extremely pale\n     skin.  He is completely bald.  He studies White carefully.\n\n     White glances about nervously  -  walks back up the corridor,\n     his eyes pinned to the man.\n\n                         MYSTERY MAN\n               You are lost, yes?\n\n     White retreats faster.\n\n     A FLASH OF STEEL  -  a dagger appears by the stranger's side,\n     gripped in a black leather glove.  He moves forward, a grin on\n     his pale face.\n\n     White stops, backs against the wall.\n\n                         MYSTERY MAN\n               Co-operate.  Do not make this\n               difficult.\n\n     White panics  -  he's cornered.  He remembers the revolver.  He\n     pulls it from his coat and LEVELS it at the stranger, his hand\n     shakes terribly.\n\n     ON THE STRANGER continuing to advance.  Something about his\n     eyes makes White immobile, unable to think clearly.\n\n                         MYSTERY MAN\n               You will not shoot, yes.  There is a\n               place in your mind, a corner of\n               darkness...\n\n     THE GUN FIRES again and again.  Red splashes appear on the man.\n     His shoulder.  His leg.  His neck.  He walks forward, with\n     spastic jerks as bullets RIP into him.\n\n     A final shot POINT BLANK into the stranger's forehead.  A\n     stream of black liquid spouts from the hole.\n\n     Blue smoke clears.  The man stands motionless, his mouth hangs\n     open.  Then his eyes roll up, and he collapses to the ground.\n\n\n     INT.  MORGUE  -  NIGHT\n\n     CLICKING of new leather shoes, walking, striking tiles.\n     INSPECTOR BUMSTEAD strides down a silent corridor.  He reaches\n     into his pocket, removes a SURGICAL MASK, places it over his\n     nose and mouth.\n\n     WIDER ANGLE\n\n     Bumstead steps up to a bald man with a moustache standing at\n     the end of the corridor.  The man, who is dressed identically\n     to the inspector, is his superior:  CHIEF-INSPECTOR STROMBOLI.\n\n                         BUMSTEAD\n               Good evening, sir.\n\n                         STROMBOLI\n               Yes.  This way.\n\n     STROMBOLI leads the inspector into a tiled room containing\n     several COVERED BODIES.  The two men are greeted by a cheerful-\n     looking MORTICIAN.\n\n                         MORTICIAN\n               Welcome, gentlemen.  Youíre early.\n               Here for the examination, right?\n\n     Stromboli nods, then ignores the mortician and walks along the\n     row of corpses.  Bumstead follows.\n\n                         STROMBOLI\n               The handiwork of an extremely sick\n               individual.\n\n     He throws back covers to reveal horrible mutilations.\n\n                         STROMBOLI\n               Youíve read the reports.  Not much to\n               go on.  We know nothing about him,\n               except that he likes to cut them...\n               Always the same type of blade.\n               Forensics match in each case...\n               Anyway, it's all in the reports, read\n               them for yourself.\n\n     STROMBOLI shakes his head, turns away from the final body,\n     looks at the inspector.\n\n                         STROMBOLI\n               Why are you wearing that thing on\n               your face?\n\n                         BUMSTEAD\n               Germs, sir.  These places are full of\n               them.\n\n                         STROMBOLI\n               I see.\n                    (continues)\n               One thingís for sure, heís ambitious.\n               Youíll be a busy man from now on.\n\n                         MORTICIAN\n               You can say that again.\n\n     Stromboli looks annoyed at the smiling man.  The Mortician\n     becomes serious and goes back to his work.\n\n                         BUMSTEAD\n               What about Thompson, sir?  Wasnít\n               this his case?\n\n                         STROMBOLI\n               Thompson suffered a kind of severe\n               delusion or some damn thing.  Anyway\n               he isnít with us any longer.  The\n               case is yours.  Go through his files.\n               Take what you need.\n                    (less business-like)\n               By the way, howís your mother?\n\n                         BUMSTEAD\n               Sheís getting better, thanks.  She...\n\n                         STROMBOLI (cuts in)\n               Very good...\n\n     The chief-inspector turns, paces to the door briskly.\n\n                         STROMBOLI\n               Letís go, Bumstead.  So much to do\n               and so little time.\n\n\n     EXT.  BUILDING  -  NIGHT\n\n     A large faded BILLBOARD advertisement on a building facade.  A\n     portrait of a smiling woman clutching a product called, \"LUMP-\n     O\"  -  a cereal box carton.\n\n     THE CAMERA MOVES IN STEADILY, rises upwards, CLOSER on the\n     womanís face, finally enters a hole at the centre of her\n     PAINTED IRIS.\n\n\n     INT.  STAIR-WELL\n\n     A raftered room on the other side of the billboard.  CAMERA\n     TILTS TO a convoluted staircase  -  at the base, the SHADOW OF\n     A MAN runs.\n\n     FEET pace rapidly.  TILT UP TO REVEAL  -  WHITE.\n\n     CAMERA FOLLOWS as he tries to lose himself from possible\n     pursuers.  He steps through a low archway into a back alley,\n     rounds a corner.\n\n     A DEAD-END.  White stops, looks around, then up.  Heís breathing\n     heavily, trying to catch his breath.  He starts to shake.\n\n     ABOVE, the walls stretch into darkness.  An OPENING way up\n     there  -  he can see stars.  Something dark crosses the gap of\n     sky.  A RUSHING NOISE in the distance.  Wind starts to pick up.\n\n     Trash is being kicked up.  A sheet of NEWSPAPER wraps around\n     Whiteís leg.  He tries to kick it away repeatedly but it wonít\n     come off.  He bends down, grabs it to throw it away, but\n     something grabs his eye.\n\n     He stares at the page for a moment  -  then his LEGS SLIP from\n     under him and he falls to the ground.  He holds his head like\n     itís going to explode.  A whimper deep in his throat.  His body\n     is trembling violently.\n\n     PUSH IN TIGHT on the paper on the ground.  A front-page\n     headline:  MAN-HUNT CONTINUES FOR SERIAL KILLER!\n\n     White looks up  -  terrified.  The RUSHING NOISE O.S. again.\n\n     HIS P.O.V.\n\n     ON THE WALL facing him, a DOOR has appeared where moments\n     before there was nothing.  The door creaks open to reveal\n     ANOTHER DOOR WITHIN.  This one extends outwards on the end of a\n     lengthening wooden shaft.\n\n     White, stands quickly, thrusts the newspaper into a pocket.\n     Tries to side-step the ADVANCING DOOR but itís too late, he can\n     only open it and step through, to avoid getting pinned to the\n     wall.\n\n\n     INT.  HOTEL LOBBY  -  NIGHT\n\n     HAND-HELD P.O.V. THROUGH the swaying beads hanging in the back-\n     room doorway.  TWO FIGURES peer into the room.\n\n                         FIGURE 1\n               We are looking for Jonathan White.\n\n     THE HOTEL MANAGER looks up, moves forward into light:  a squat,\n     hunch-backed man with glasses.  He steps through the beads,\n     glares at the intruders.\n\n                         MANAGER\n               What for?\n\n     ON THE MEN  -  an uncanny resemblance to the one who tried to\n     kill White.  Black coats, glasses, pale skin.  Creepy.\n\n     A BLACK GLOVED HAND flashes forward, grips the managerís face\n     and doesnít let go.  The manager struggles, gulps for air.\n     Heís pushed back heavily against the wall.\n\n                         MAN 1\n               Which room is he in?\n\n     The leather glove SQUEEZES, blood trickles from the managerís\n     ears, through the fingers.\n\n\n     INT.  ROOM 43\n\n     ANOTHER (VERY SHORT) FIGURE is searching the room.  He hears\n     NOISES O.S. in the corridor, runs to the door, presses against\n     the wall.\n\n     ON THE MAN  -  FREDRICK  -  a stunted body, an oversized head,\n     thick limbs.  The rest of his features lost in shadow.\n\n     The door swings open, a shaft of light floods the dark room.\n\n     ON THE TWO MYSTERY MEN as they step in and look around.  They\n     search the room, knock stuff over.  One of the men kicks at the\n     womanís corpse in the corner.  Behind him, Fredrick, still\n     hiding near the door, slips into the corridor unnoticed.\n\n\n     EXT.  FLYING P.O.V.  -  NIGHT\n\n     A FLYING PERSPECTIVE past buildings.  An INSECT-LIKE BUZZING\n     O.S.  Way down BELOW, in a canyon of silent buildings, a LONE\n     FIGURE walks.\n\n\n     EXT.  DOWN ON THE STREET\n\n     A breeze pulls at WHITEís hair and coat.  He takes out the\n     wallet  -  a few dollars.\n\n     HIS P.O.V. AS HE WALKS\n\n     The city is DEAD.  Empty.  Desolate.  Buildings hang down out\n     of black.  Day-time was never invented.\n\n     As he puts the wallet back in his pocket, a BUSINESS CARD he\n     hadnít noticed, flutters to the ground.  He stops, picks it up.\n     In simple print:  DOCTOR D.P. SCHREBER M.D., a phone number.\n     Scribbled handwriting on the back says:  Thursday 0930.\n\n     ON WHITE  -  he glances across the street.\n\n     HIS P.O.V.  -  A cafe.  A broken NEON FISH buzzes above the\n     doorway.\n\n\n     INT.  CHINESE CAFE\n\n     He walks up rickety stairs, into a small room with five or six\n     tables.  Empty.  Dirty.  He sits and waits.\n\n     A CLOCK ticks on the wall  -  midnight.  White coughs, for\n     attention.\n\n     A NOISE from a doorway.  A SHADOW moves towards him, dragging\n     one foot as it walks.  A SMALL ASIAN WOMAN appears and limps to\n     his table.  She speaks very quickly IN CHINESE.  He does not\n     understand.\n\n     She points to a chalk board on the wall  -  a list of dishes\n     also in Chinese, only one in English  -  the last one.  At the\n     bottom.  In small print.  \"NOODLES\".\n\n                         WHITE (nods)\n               The noodles.  Iíll have some noodles.\n\n     The old woman rips a YELLOW TICKET from a pad, gives it to\n     White.  A number on it.  She points her crooked finger again\n     at a SPEAKER BOX above a small serving window in the wall.  A\n     greenish fluoro pulses from the room within.\n\n                         WOMAN\n               We call.\n\n     She leaves again.\n\n     White looks about the empty room.  Insects are zapped on an\n     illuminated DEVICE hanging on the wall.  An old air-conditioner\n     RATTLES noisily.\n\n     NOISES from the kitchen  -  voices argue in Chinese, a baby\n     cries.  Then SILENCE.\n\n     White removes the newspaper from his coat and spreads it on the\n     table.\n\n     He overcomes his fear, starts to read the article.  Leans\n     forward, hands trembling.  Without realising, he holds the\n     paper OVER A CANDLE burning on the table.  The paper CATCHES\n     FIRE, is engulfed.  He drops the flaming page on the table.  Now\n     the table-cloth starts to burn.\n\n     White is frantic.  On a nearby table he finds a pitcher of\n     water, and dumps this on the flames.  It kills the fire but\n     leaves a black hole in the table-cloth.  The paper is ash.\n\n     He moves to another table pretending nothing happened, fans the\n     smoke away.\n\n\n     INT.  POLICE STATION  -  NIGHT\n\n     BUMSTEAD is moving quickly.  He suddenly trips and falls to the\n     floor.  He curses under his breath, then looks up.\n\n     HIS P.O.V.\n\n     A door  -  THOMPSON:  DETECTIVE/INSPECTOR on the frosted glass.\n     Bumstead stands, pushes into the office.\n\n     INSIDE\n \n     A total mess  -  paperwork everywhere, dozens of used coffee\n     cups, rotting food in greasy paper bags.  Bumstead shakes his\n     head.\n\n                         BUMSTEAD\n               A real shame...\n\n     He starts to look around.\n\n     TIGHT ON FILING CABINET  -  a drawer is pulled open.\n     Thompsonís files are also a mess.  Bumstead continues to shake\n     his head.  He reaches for a file.  A loud SNAP!\n\n                         BUMSTEAD (screams)\n               YAAAAAAAAAH!\n\n     He recoils.  A mousetrap has snapped over his fingers.  He\n     pulls it off his hand, throws it to the floor, cursing.\n\n\n     INT.  CHINESE CAFE\n\n     White is still waiting for his food.\n\n     He leans down to scratch an itchy ankle, lifts his trouser leg\n     to examine the bites  -  worse, inflamed.  He uses a napkin to\n     wipe at the pus.\n\n     AERIAL PERSPECTIVE OF A FLY  -  circling the room, looking down\n     on White.\n\n     ON THE FLY  -  It lands on a plate of half eaten food on\n     another table.  The creature is some kind of SURVEILLANCE\n     DEVICE  -  half insect/half machine.  Itís spying on him.  MOVE\n     IN TIGHT as inbuilt camera lenses focus in its head.  It shits\n     on the food behind it.\n\n     White is oblivious to this.  Heís finished examining his leg,\n     is sitting quietly.  He yawns.  His head nods forward briefly.\n\n     A NOISE.  White looks up.\n\n     A TRAP-DOOR has opened in the ceiling.  Two feet in black\n     leather shoes descend from the hole.  A sea breeze blows\n     through the room.  The SOUND OF SURF, SEAGULLS CRYING.\n\n     ON Whiteís nose twitching.  He can smell the ocean.\n\n     The WALLPAPER COMES ALIVE  -  like a seething tangle of worms.\n\n     One by one, THREE MEN in black coats lower into the room,\n     floating on air.  They pull out knifes, step forward.\n\n     ON WHITE rigid with terror.\n\n     ON THE MEN  -  though their faces cannot be seen clearly in the\n     gloom, they too resemble the MAN who confronted White earlier.\n     They walk towards him slowly, holding knifes above their heads.\n     Ready to attack.  They lean over him, pause dramatically.\n\n                         MAN 1\n               Donít fall asleep.\n                    (chuckles softly)\n               Might never wake, yes.\n\n     This Man turns to the others.  They all smile, then turn back\n     to White.\n\n                         MEN (in unison)\n               Fifty-six.\n\n     ANOTHER VOICE has been speaking softly  -  now it is louder.\n     Repeating:\n\n                         VOICE\n               Fifty-six...  Fifty-six...\n\n     ANGLE  -  a chair falls to the floor.\n\n     White leaps up from the table, terrified, disoriented.  Just a\n     DREAM  -  he had dozed.\n\n     WIDEN ANGLE  -  The place is still empty.  White glances to the\n     serving window.  A DISH waits for him, framed in the glowing\n     fluoro square.  He gets it.  A bowl of soupy liquid with\n     noodles.  He sits down.\n\n     He is about to start eating  -  realizes he has a fork instead\n     of a spoon.  Picking up the bowl again, he heads to the\n     kitchen.\n\n\n     INT.  CORRIDOR\n\n     He takes a door beneath a set of wooden stairs and finds\n     himself in another corridor.  He looks about, unsure which\n     direction to go in.\n\n\n     INT.  SERIES OF ROOMS  -  LATER\n\n     White is lost, still holding the soup.\n\n     He moves through a number of RUSTED METAL DOORS that open and\n     shut automatically.  Each reveals another room or corridor.\n     Deserted spaces long forgotten  -  dusty, crumbling.\n\n     He feels the fish moving about in his pocket, pulls it out and\n     looks at it.\n\n     White holds the dying fish in one hand, the bowl of cold soup\n     in the other.  Disgusted, he puts the fish into the bowl.\n\n\n     INT.  CORRIDOR\n\n     A TICKING SOUND O.S.\n\n     White stops.  Looks up.  A large clock suspended from the\n     rafters.  A tug at his coat.\n\n     Standing beside him is FREDRICK  -  the little man from Whiteís\n     hotel room.\n\n                         FREDRICK (stutters)\n               Where have you been?  The doctorís\n               been worried about you.\n\n                         WHITE\n               What?  Who are you?\n\n     Fredrick looks nervously down the corridor.\n\n                         FREDRICK\n               Címon, letís go!  We donít have any\n               time.\n\n     The little man grabs Whiteís sleeve, starts to pull him along.\n\n                         WHITE\n               Hold it a minute.  Letís start at the\n               beginning, huh?\n\n     ANGLE ON  -  the top of a set of stairs in front of them.  Two\n     dark figures appear.\n\n     Fredrick looks up at them in horror.\n\n                         FRERICK\n               Shit!\n                    (looks at White)\n               Quick!  Run!\n\n     Both men run like crazy, White awkwardly holding the bowl of\n     soup.  They come to a junction, each takes a separate corridor.\n     Fredrick finds some stairs, climbs two at a time.\n\n     White climbs INTO FRAME, looks around, finds another corridor.\n     The little man is nowhere to be seen.  White reaches another\n     junction  -  several corridors branch off.             \n\n     HIS P.O.V. PANNING AROUND                   \n\n     Each passageway completely deserted.        \n\n                         WHITE\n               Shit.                                       \n\n     He keeps running.\n\n\n     INT.  HOTEL LOBBY\n\n     A PHOTO FLASH  -  illuminates the dead body of the hotel manager,\n     slumped in his own blood.\n\n     Bumstead leans INTO FRAME, examines the corpse.  He notices\n     several stab wounds in the manís abdomen.  Various cops search\n     the room.\n\n     One cop walks up to the Inspector.\n\n                         COP\n               We got another one upstairs\n\n                         BUMSTEAD (deadpan)\n               Great.\n\n\n     INT.  ROOM  -  NIGHT\n\n     A SMALL ROOM with arched windows that look over the city.\n     Fredrick is pulling a notebook and pen from under an upturned\n     table.\n\n     He scrawls rapidly, screws the message into a tight tube, then\n     puts it into a METAL CYLINDER he finds beneath the table also.\n\n     He glances out a window, notices A FIGURE standing beneath a\n     street-lamp below, looking up at him.  Startled, Fredrick darts\n     back into shadow, goes to a wall covered in about a dozen\n     vertical PIPES running up into the ceiling.\n\n     TIGHT ON ONE OF THE PIPES  -  he opens a small hatch and puts\n     the metal cylinder in it.  The cylinder is snatched from his\n     hand, sucked into the pipe with a rush of air.\n\n     WIDER\n\n     Fredrick steps back, a sigh of relief.  A shadow falls across\n     his back.  He turns.  He screams.\n\n     INT./EXT.  VARIOUS\n\n     TIGHT  -  rushing along lengths of rusted pipe, at blinding\n     speed.  The cylinder races around corners.  It clanks and\n     grinds.  HURTLES up the side of a building.  THEN PLUMMETS\n     underground.  Rushes through darkness.\n\n\n     EXT.  BRIDGE  -  NIGHT\n\n     THE CAMERA MOVES along a bridge-like structure.  An enclosed\n     corridor supported by rotting wooden pylons.  Under the bridge,\n     pipes spew sewage into stagnant water.\n\n     ANGLE ON WHITE WALKING  -  seen through a series of illuminated,\n     dirty, windows.  He occasionally glances into the bowl he holds\n     before him.\n\n     INSIDE\n\n     TIGHT ON the fish swimming weakly in the soup.\n\n     ANGLE ON WHITE  -  He stops, looks up at O.S. SOUND of\n     clattering metal.  A pipe runs the length of the corridor  -\n     the invisible clanging cylinder races away, into darkness.\n\n     Then the silence is shattered by a piercing series of SCREAMS\n     somewhere in the building.  White hurriedly moves towards the\n     source.\n\n     ANOTHER CORRIDOR\n\n     White rounds a corner, stops, notices a small rectangular HOLE\n     in a wall.  ANOTHER SCREAM, weaker now  -  He runs to the hole\n     in the wall and looks through.\n\n     HIS P.O.V.\n\n     A small, very ordered ROOM.  A fake fireplace bathes the room\n     in a warm glow.\n\n     White cranes his neck forward, stretches his head through the\n     hole.  He can see into an adjoining room to his right  -  two\n     dark figures stand over a man on the floor lying in a pool of\n     dark crimson.  The man looks up  -  itís Fredrick  -  just as\n     both dark figures stab him repeatedly with bloody daggers.  He\n     doesnít scream this time, just gags on blood running from his\n     mouth.\n\n     Suddenly a sliding door SLAMS onto the back of Whiteís neck,\n     traps his head in the hole.  He struggles, tries to free\n     himself.  Drops the bowl of soup.  It shatters on the hard\n     floor, makes a mess.\n\n     INSIDE THE BATHROOM  -  The killers look up at the smashing\n     noise.\n\n     BACK IN THE CORRIDOR  -  White pulls with all his strength.\n     The door gives and he stumbles backwards.  He is about to run\n     away but glances at the floor.\n\n     The fish is flapping about  -  still alive.\n\n\n     EXT.  STREET\n\n     White darts from a doorway, trips and falls.  He sprawls at the\n     base of sweeping stone steps.  He looks at a building towering\n     above him.  Chiselled in the facade, above the entrance:\n     LIBRARY.\n\n\n     INT.  POLICE STATION\n\n     A series of ply-wood SILHOUETTES race through frame.  Stop\n     suddenly, mechanically.  LOUD GUNSHOTS.  Chunks of ply-wood\n     blast away violently.\n\n     BUMSTEAD is practising his marksmanship.\n\n     A HAND  -  on his shoulder.  He whips around, startled.\n\n     ON MISS CRENSHAW  -  a young, stiff-looking woman.\n\n                         BUMSTEAD\n               Dammit!\n\n                         MISS CRENSHAW\n               Sorry, sir.\n\n                         BUMSTEAD\n               Donít ever sneak up on me like that!\n               Who are you?\n\n                         MISS CRENSHAW\n               Patricia Crenshaw.\n\n     She puts out her hand.\n\n                         MISS CRENSHAW\n               Iím your new assistant.\n\n                         BUMSTEAD\n               I didnít requisition a secretary.\n\n                         MISS CRENSHAW\n               The Chief-Inspector thought you might\n               need a hand.\n\n                         BUMSTEAD (uncertain)\n               Oh.\n\n     He takes her hand tentatively.  They shake.\n\n                         MISS CRENSHAW\n               Iíve taken the liberty and had\n               Inspector Thompsonís office searched,\n               as I believe you instructed.  All\n               clear now, sir.  They found several\n               more traps and things were filed\n               under pretty strange categories...\n               Poor man.\n\n                         BUMSTEAD\n               Good.\n\n                         MISS CRENSHAW\n               You wonít regret this, sir.\n\n                         BUMSTEAD\n               Fine.\n\n     Bumstead moves off.\n\n\n     INT.  LIBRARY\n\n     White steps into a vast, empty room, stops beneath a big sign\n     saying, SILENCE in formal letters.  The place seems abandoned,\n     then he notices a hint of movement.  Cigarette smoke snakes\n     into the air, a light, across the expanse of polished floor.\n\n     He walks up to an elderly female LIBRARIAN sitting behind a\n     desk, smoking, reading.  White looks somewhat distraught still.\n\n                         WHITE\n               Keep newspapers here, birth\n               certificates, records of deaths, that\n               kind of thing?\n\n     The librarian looks up from her book.\n\n                         LIBRARIAN\n               Which would you like first?\n\n                         WHITE\n               Okay.  Newspapers.\n\n     She takes her glasses off.  Her eyes are TINY, like pin-heads.\n     She studies White.\n\n                         LIBRARIAN\n               Are you alright?\n\n     He looks around  -  restrained panic.\n\n                         WHITE (looks at the woman)\n               Sure.  Iím fine.\n\n                         LIBRARIAN (nods)\n               Mmm-hmm.  Stairs at the end of the\n               hall.  Third floor.  Turn left.\n               Section C-7.  Row 35, near the\n               toilets.\n\n     She replaces her glasses, watches White rush away.\n\n                         LIBRARIAN\n               Donít mention it...\n\n     She blows her nose into a handkerchief.  The snort ECHOES\n     LOUDLY.\n\n\n     INT.  LIBRARY CORRIDOR\n\n     White rushes down a dark hall lined with bronze statues.  He\n     finds section C then walks between towering rows stacked with\n     old volumes.  Comes to number 7.\n\n     He follows an arrow past row after row  -  finally finds Row 34\n     but then it skips straight to letters again, A, B, C, etc.\n\n     No Row 35.\n\n     He stops and looks around  -  sure enough a door displays a\n     small sign:  TOILETS.\n\n     White is sweating profusely.  He now sits on a chair, takes off\n     his shoes, rubs his feet.  He pulls a book from a shelf behind\n     him, looks about, opens the book and tears several pages out,\n     folds them, stuffs them into his shoes to plug up the holes.\n\n     He gets up, tries to backtrack, comes across an elaborate\n     diagram of the library interior.  An arrow points to a section\n     near a wing labelled:  MAPS.  Near the arrow it says:  YOU ARE\n     HERE.\n\n     He keeps walking.\n\n     He finds the door to the maps wing but the door is locked, a\n     sign is nailed to it:  WE ARE REMODELLING.  WE APOLOGIZE FOR ANY\n     INCONVENIENCE.\n\n     White, annoyed now, tries to force his way in.  Puts his\n     shoulder to the door, pushes several times.  It CRUMBLES under\n     his weight  -  rotten.\n\n     He finds himself in a DUSTY ROOM.\n\n     HIS P.O.V.\n\n     A narrow room, filled with rows of bookshelves with stacks of\n     old newspapers.\n\n     TIGHT ON WHITE  -  he steps forward, pulls a folded newspaper\n     off the shelf.  The instant he picks it up, it crumbles to dust\n     in his hands.  He picks up another, and another, each in turn\n     breaking apart and dissolving to nothingness.\n\n\n     INT.  DARK CHAMBER  -  NIGHT\n\n     TWO SILHOUETTED FIGURES face each other across a polished black\n     table.  They speak in a foreign language.  A phone rings.\n     Figure 1 picks up the receiver and listens attentively.\n\n     Figure 2 is involved with various metal shapes he is trying to\n     lock together.  A complex puzzle.  He gets impatient with the\n     puzzle, dashes it to the floor.\n\n     Figure 1, on the phone, hangs up and writes something.  Hands\n     the note to Figure 2, who in turn drops it into A CHUTE.\n\n     CONTROL ROOM\n\n     The note falls from a slot in the wall before Figure 3 (in\n     shadow yet again).  He reads from the note over a silver\n     microphone, still in the unfamiliar tongue.\n\n     TIGHT ON A SPEAKER  -  his distorted voice.  A final mysterious\n     person  -  Figure 4  -  listens to the announcement.  He takes\n     a stick and moves a small cut-out figure of a man across a\n     board, away from a large grouping of similar cut-outs.  The\n     board resembles a planning table in a war-room.\n\n     A HIGH ANGLE as the CAMERA PULL BACKS on the grouping of cut\n     out figures.  More and more of them.  Ten.  Twenty.  A hundred.\n     A sinister army.\n\n\n     INT.  INTERSECTING STREET  -  NIGHT\n\n     White is in a phone booth.  He removes the note from his\n     pocket, dials.  No answer again.  He dials the OPERATOR.  A\n     muffled voice over the line.\n\n                         WHITE\n               Iím trying to reach nine zero eight\n               triple two.  I canít get through...\n                    (beat)\n               What?!...\n                    (angry)\n               Shit!\n\n     He reaches into his pocket, pulls out a coin, puts it into the\n     slot.  Heís sweating again.  He wipes his brow with a trembling\n     hand.\n\n                         WHITE\n               It is?...  Which area is that number\n               listed in?...  Is that near the\n               ocean?...  The ocean...  Never mind.\n               Have a Jonathan White listed?...\n               WHITE.  Seventeen?  All Johns?  I\n               see...  Never mind.\n\n     He hangs up, then removes the business card he found in his\n     wallet.  He is about to dial but decides otherwise.  He steps\n     into the street.\n\n     A HIGH ANGLE\n\n     White walks between tall buildings, towards a narrow street\n     that branches off into two separate routes.  He stops.  He\n     canít decide which branch to take  -  he steps to the left,\n     then steps back, takes a few steps to the right, reconsiders\n     again...\n\n\n     INT.  POLICE STATION/BUMSTEADíS OFFICE  -  NIGHT\n\n     TRACK ALONG  -  piles of towering files bursting at the seams\n     with paperwork  -  TO FIND Bumstead hunched over notes,\n     photographs and files.  His eyes are rimmed with red.  He\n     doesnít seem to be getting anywhere.\n\n                         CRENSHAW O.S.\n               Coffee?\n\n     He looks up.  The secretary stands in the doorway with another\n     big pile of paperwork.\n\n                         BUMSTEAD\n               What?  I donít drink coffee.  A cup\n               of tea would be good.  Milk and no\n               sugar.\n\n     Crenshaw puts the paperwork down on Bumsteadís already\n     overcrowded desk.\n\n                         CRENSHAW\n               Making progress?\n\n     He looks at her like she just slapped him.\n\n                         BUMSTEAD\n               These are the investigations of a\n               madman.  He has fabricated an entire\n               bizarre paranoid delusion with no\n               internal logic whatever.\n                    (without looking up)\n               This is a mess.  A horrible mess.\n                    (looks at her now)\n               Itís the second time now.\n\n     Miss Crenshaw looks concerned.\n\n                         BUMSTEAD\n               Look at this!\n\n     He holds up a sheet of white paper  -  a report.  The woman\n     steps over and looks at it.\n\n                         BUMSTEAD\n               You typed this report?\n\n                         MISS CRENSHAW\n               Yes, sir.  Anything wrong?\n\n                         BUMSTEAD\n               Wrong?  Look at this!\n\n     The woman bends down, adjusts her glasses, examines it.\n\n                         MISS CRENSHAW\n               It seems fine.\n\n                         BUMSTEAD\n               Fine?  Look here!\n\n     His finger points at the bottom of the page  -  a tiny,\n     INSIGNIFICANT ink smudge.\n\n                         BUMSTEAD\n               How can I submit this?\n\n                         MISS CRENSHAW\n               Iím sorry...\n\n                         BUMSTEAD\n               Do you wash your hands before you\n               type things?\n\n                         MISS CRENSHAW\n               Why, yes.\n\n                         BUMSTEAD\n               Well be more careful, please.\n\n     An embarrassed beat, then:\n\n     RI-I-I-ING!\n\n     Bumstead reaches for the phone but Crenshaw is on it first.\n\n                         CRENSHAW\n               Inspector Bumsteadís office...\n               Yes...  Yes...\n\n     She cups the receiver with her hand, looks at Bumstead.\n\n                         MISS CRENSHAW\n               Yes, sir.  The Chief-Inspector said\n               he would see you now.\n\n\n     INT.  POLICE STATION HALL-WAY\n\n     TRACKING SHOT towards a door:  CHIEF-INSPECTOR on the frosted\n     glass.  A hand reaches INTO FRAME, knocks twice.\n\n                         STROMBOLI O.S.\n               Enter!\n\n     INSIDE\n\n     Bumstead steps into the office  -  finds STROMBOLI wandering\n     about the room, distracted, searching for something...\n\n                         STROMBOLI\n               What is it?\n\n     He pulls the waste-basket up and empties the contents onto his\n     desk, sorts through it.\n\n                         BUMSTEAD\n               A formality.  I need to speak with\n               Thompson.  Officially I need your\n               written permission.\n\n     Stromboli is looking through his desk drawers now.\n\n                         STROMBOLI\n               Why do you want to speak to him?\n\n                         BUMSTEAD\n               A hunch.  He might be able to...\n\n                         STROMBOLI (from under desk)\n               Bumstead, donít be so paranoid.\n               Leave him alone  -  heís a sad case.\n\n                         BUMSTEAD\n               Itís extremely important to my\n               investigation...\n\n                         STROMBOLI\n               Iíll be the judge of that.  Anything\n               else?\n\n                         BUMSTEAD\n               Actually, I was wondering, sir, if\n               you could let me have a few uniforms,\n               to follow up for me...\n\n                         STROMBOLI O.S. (pokes head above desk)\n               Absolutely not.  Up to my ears in\n               cases right now  -  canít spare\n               anyone.\n\n     Stromboli becomes distracted again  -  stands up, looks behind\n     pictures hanging off the walls.  A big sign suspended above his\n     desk says, SO MUCH TO DO AND SO LITTLE TIME  -  his motto.\n\n                         BUMSTEAD\n               Lost something?\n\n                         STROMBOLI\n               What makes you think that!  If you\n               would learn to concentrate on facts,\n               not get so side-tracked  -  you might\n               get things done faster, Bumstead...\n\n     The door clicks shut.  Stromboli looks up  -  the inspector has\n     gone.\n\n\n     EXT.  PLAZA  -  NIGHT\n\n     White walks under stone archways.\n\n     Across an empty plaza is a sign above a door:   DRUGS OPEN 24\n     HOURS and in smaller print, recently added beneath:   SHAVE &\n     HAIRCUT $5.00.\n\n\n     INT.  DRUG STORE  -  NIGHT\n\n     White walks between bare, dusty shelves.  Only one shelf\n     carries products  -  BOX AFTER BOX OF \"LUMP-O\".  He moves up to\n     a small counter.  A man with thick glasses, dressed like a\n     BARBER, is seated there.\n\n                         WHITE\n               I need something to keep me awake.\n\n                         BARBER\n               Looks like you need a haircut to me.\n\n                         WHITE\n               Thanks.  Just some pills.\n\n                         BARBER\n               Only two bucks.  Shave as well...\n\n                         WHITE (annoyed now)\n               Your sign says you sell drugs  -\n               well, Iím here to buy some.  Okay?\n\n                         BARBER\n               Relax.  Sure!\n\n     He waves dramatically to a shelf above his head, with several\n     bottles of all sorts of different coloured capsules.\n\n                         BARBER\n               Tell you what  -  let me cut yer\n               hair, give ya watcha need half price.\n               Canít argue at that!\n\n                         WHITE (evenly)\n               I donít want a haircut.\n\n     LATER\n\n     CAMERA TRACKS OFF a clock on a wall  -  REVEALS WHITE in a\n     barber chair.  The BARBER gleefully works on WHITEís hair.  A\n     thin OLD GUY in a moth-eaten suit steps from behind a curtain,\n     smiles, playing a violin.  Heís passionate but bad.\n\n                         BARBER (talks fast)\n               Cut hair when I was in the navy,\n               yíknow  -  havenít lost the touch.\n               Bet youíre happy ëbout that.  Huh!\n\n                         WHITE\n               Sell maps?\n\n                         BARBER\n               What of?\n\n                         WHITE\n               The city.  I need to get to the\n               ocean.\n\n                         BARBER\n               Nope.  No maps.  Ocean, huh?  On\n               vacation?\n\n     White doesnít answer.  The old guy with the violin moves back\n     and forth behind White, smiling as he plays.\n\n                         BARBER\n               Grandpa thought customers might like\n               some mood music.\n\n                         WHITE (unconvinced)\n               Nice...\n\n                         BARBER\n               You still look familiar.  Itís\n               driving me nuts!  Sure I donít know\n               ya from somewhere?\n\n                         WHITE (nervous now)\n               Not me.\n\n     Barber looks out the front window as his hands busily trim\n     hair.\n\n                         BARBER\n               Mnunn.  Cold lately.\n                    (lathers up Whiteís\n                    face)\n               That night, couple weeks ago.  That\n               was real cold.  Remember that?\n\n                         WHITE\n               Not really...\n\n                         BARBER\n               Yeah, Iím like that.  Senility says\n               the wife.  But she sure canít\n               complain.  Heh.  The erector set still\n               works good.\n                    (points to head)\n               And this ainít no fucking rug!\n               Gíhead.  Feel it!  All mine!\n\n     Grandpa laughs and plays louder.\n\n                         GRANDPA\n               Yes! Feeeeel it!\n\n     PUSH IN ON WHITE  -  he smiles weakly.\n\n\n     INT.  DETAIL  -  NIGHT\n\n     A HAND scrawls cryptic diagrams into a notebook.\n\n     PULL OUT TO REVEAL\n\n     DOCTOR SCHREBER at his desk.  Heís bearded, with thick lensed\n     glasses.  He puts the phone down, sits quietly at his desk,\n     staring into space, lost in thought.\n\n     A LOUD RATTLING NOISE FILLS THE ROOM.  Schreber looks up.\n\n     HIS P.O.V.\n\n     A rusted pipe runs across the ceiling and down one wall.  He\n     steps across to the pipe on the wall, leans down, looks into an\n     open hatch at its base.\n\n     Without warning, out of the hatch pops the metal cylinder FROM\n     SEVERAL SCENES PREVIOUS and bounces off the doctor's head.\n\n     He curses, picks it up, opens it.  He plucks out the note and\n     reads FREDRICKís SCRAWLED MESSAGE:\n\n               DOCTOR, I DID AS YOU ASKED.  BUT\n               THINK I MADE STUPID MISTAKE.  HOPE\n               THINGS DONíT GET BACK TO YOU.  SORRY.\n               -  FREDRICK.\n\n     Schreber looks up  -  then PUNCHES HIS FIST into the desk\n     angrily.\n\n\n     INT.  EMPTY BUILDING\n\n     A P.O.V. MOVES DOWN halls made of wood slatting  -  the floors,\n     walls and ceilings are bare boards.  FOOTSTEPS O.S.\n\n     TIGHT ON  -  a manís shadow as it descends a wooden staircase.\n\n     REVEAL WHITE  -  He rummages in a paper bag as he walks.  Pulls\n     out two capsules, swallows them.  Now he pulls out a pack of\n     \"LUMP-O\", rips it open, eats ravenously.\n\n\n     EXT.  STREET  -  NIGHT\n\n     White steps out into a street, turns a corner, drops the empty\n     packet of cereal.  Now he sees TWO FIGURES APPROACH.  He hides\n     behind a wall before he is seen.  Suddenly a deafening RINGING\n     startles him.  He looks across a plaza.\n\n     HIS P.O.V.  -  A CHURCH.  A bell-tower, black against the sky.\n\n     White stares up into the night.\n\n\n     INT. CHURCH - NIGHT\n\n     White walks in, sits on A PEW, towards the back of the room,\n     glances over his shoulder.  He tries to blend in with the SMALL\n     GATHERING OF PEOPLE sitting silently around him.\n\n     A PRIEST  -  appears at the altar, cloaked in a blood-red robe,\n     followed by two altar boys also in red.  They move past a\n     statue of an insect-like creature, walk in circles chanting\n     softly, stop and stare at the congregation through eye-slits in\n     their hoods.  The priest begins his sermon.\n\n                         PRIEST\n               Beware!  The night is deadly.  There\n               is a criminal among us.\n\n     White looks forward.\n\n     TIGHT ON the priestís hand  -  It rises, points, moves over the\n     heads of the congregation, accusingly.  Suddenly the red finger\n     jabs towards an OLD WOMAN in the front row.\n\n                         PRIEST\n               It could be she!  The innocent across\n               the street!\n\n     All the congregation turn and stare at the woman.  Sheís\n     terrified.\n\n     The hand moves slowly now, across to a BEAUTIFUL JAPANESE WOMAN\n     several rows back.\n\n                         PRIEST\n               Or the temptress next door!\n\n     The priest pauses dramatically then:\n\n                         PRIEST\n               Or mister nervy stranger at the back!\n\n     Suddenly the finger is pointing at White. All the faces turn,\n     stare suspiciously at White.\n\n     ANGLE ON WHITE  -  frozen with fright.  Fortunately his face is\n     obscured by shadow and the priest lowers his hand, continues\n     the sermon.  The people look away.\n\n                         PRIEST\n               You are thinking it could be anyone?\n               And youíre right!  Why, it could even\n               be Mother!\n\n     White goes to leave.  As he stands he notices the DOORS of the\n     church open  -  two figures step in and move into the candle-\n     light.\n\n     MYSTERY MEN  -  Whiteís bizarre pursuers.  They look around.\n\n     White ducks down, crawls between pews, startling several of the\n     congregation.  He motions to them to keep quiet.  He runs into\n     the legs of the BEAUTIFUL WOMAN the priest pointed out.  She is\n     startled momentarily but looks down at him, smiles.\n\n                         PRIEST (continues sermon)\n               Evil stalks our streets.  It seeks to\n               hide in our hearts.  Have you not\n               evil within you now?\n\n     White sees a nearby CONFESSION BOX.  Staying low, he runs,\n     almost knocks over a large illuminated candle-holder, darts\n     inside.  The girl watches him.\n\n     A GAUNT-FACED WOMAN stands.  Hysterical.  She looks at the\n     priest.\n\n                         GAUNT WOMAN\n               He took my little boy!  Iíll rip out\n               his eyes!\n\n     INSIDE  -  White breaths relief.\n\n     HIS P.O.V.  -  carved on the dark stained wood in front of him\n     is a crucified insect.  A voice surprises him.  Another PRIEST,\n     OLDER.\n\n                         OLDER PRIEST\n               You have sinned?\n\n                         WHITE\n               NO.  Ah...\n\n     White watches the two Mystery Men walk past, through the ornate\n     wooden grill in front of his face.\n\n                         PRIEST\n               I am listening.\n\n                         WHITE (lying)\n               Thereís a...  woman.  I don't know\n               but I think I, ahh...\n\n                         PRIEST\n               You fornicated?\n\n     The Mystery Men look towards the box for a moment, towards\n     White, but keep walking.\n\n                         WHITE\n               No.  I, ah...\n\n                         PRIEST\n               You seem restless.\n\n     The Mystery Men seem to have gone.  White takes out the gun,\n     keeping it hidden from the priest.  Opens the chamber.\n\n     TIGHT ON THE GUN  -  Only ONE BULLET left.\n\n                         WHITE\n               Someoneís after me.\n\n                         PRIEST\n               Then we must call the police.\n\n                         WHITE\n               No.  I mean...  that isnít necessary.\n\n     The silhouette on the other side of the box leans forward.\n\n                         PRIEST\n               I see.  Then who is after you?  What\n               sins have you committed?\n\n                         WHITE\n               Just let me sit here for a moment?\n               Iíll go soon, and stop bothering you.\n\n     The priest suddenly stares incredulously at White.  His eyes\n     widen in horror.\n\n                         PRIEST\n               Youíre the murderer?\n                    (starts to yell)\n               Yes!  That must be it!  Donít kill\n               me!\n\n     White lunges, grabs his collar with one hand, slaps the other\n     over his mouth.  The old man stares at him, trembling\n     uncontrollably.\n\n                         WHITE\n               Shut up!  Listen.  Walk out quietly.\n                    (holds up gun)\n               Understand?\n\n     The priest nods stupidly.  White pushes him out of the\n     confession box, grabs his coat from behind, puts the gun to his\n     back.  Together they head for the doors.  Still no sign of the\n     Mystery Men.\n\n                         PRIEST\n               Donít kill me!\n\n                         WHITE\n               Shut up!\n\n                         PRIEST\n               Please...\n\n     White loses his temper, grabs the priest, shakes him violently.\n\n                         WHITE (not so quietly)\n               Iím not going to kill you, okay!\n\n     Faces turn.\n\n     The priest kicks White in the leg, bites his hand.  While White\n     is wincing in pain, the priest breaks away.\n\n                         PRIEST (shouting/pointing)\n               CRIMINAL!\n\n     People start to scream and run.  The GAUNT WOMAN points at\n     White.\n\n                         GAUNT WOMAN (screams insanely)\n               Itís him!  Rip out his eyes!\n\n     Frightened, White holds the gun out.  Everyone panics,\n     scatters.  People run for the exit.  Religious statues topple\n     and smash.  The gaunt woman is pushed screaming to the floor,\n     trampled by the crowd.\n\n     Amidst the chaos, the two MYSTERY MEN appear across the room,\n     see White, head towards him.  He turns and runs.\n\n     A STAIRCASE\n\n     White climbs narrow stairs rapidly.\n\n\n     INT.  BELL TOWER\n\n     White stops, nowhere left to go, just a long drop to the street\n     through a series of arched windows.  A low, raftered room,\n     three huge black BELLS.\n\n     Suddenly a groan of gears in the ceiling and the bells start to\n     swing, build momentum.\n\n     CLANG!  CLA-A-A-ANG!  A cacophony of noise.\n\n     White puts his hands over his ears in pain, then turns to the\n     stairs.\n\n     HIS P.O.V.\n\n     Through the swinging bells  -  the MYSTERY MEN climb the last\n     few steps on the other end of the dark room.  They advance\n     slowly, clutching daggers.\n\n     White raises his gun.  Aims.  Difficult to find his target  -\n     the approaching MEN are obscured by the bells.\n\n     White steps sideways, never taking his eyes off the Men.  They\n     follow him slowly, pivoting about the bells in the centre of\n     the tower, pursuers and pursued remaining a semi-circle apart.\n\n                         WHITE (shouts)\n               What do you want?  Tell me!\n\n     The Men stop.  So does White.  They separate, now approaching\n     him from OPPOSITE sides, moving around the bells.\n\n     White doesnít know who to point the gun at  -  he swings back\n     and forth, one to the other, faster and faster, as the Men\n     approach.\n\n     He lets them get uncomfortably close, then swings to his right,\n     thrusts the gun to one Manís forehead.  FIRES.  The Man steps\n     back, spouting liquid from the bullet hole, hits a low railing,\n     FALLS into the shaft at the centre of the tower.\n\n     The second Man SWINGS his dagger at White.\n\n     White falls backwards, dropping his gun clumsily.  The Man\n     advances, smiling  -  kicks the gun across the wooden floor.\n\n     White, clutching at straws, lifts his foot, kicks down hard on\n     a loose floorboard.  The board flies up, pivoting against\n     Whiteís heel, catches the Mystery Man with a CRACK under the\n     chin.\n\n     White runs at the off-balance Man, head-butts him in the\n     stomach.  The Man recoils, canít stop, steps off backwards into\n     space, PLUMMETS INTO DARKNESS towards the street below.\n\n     White relieved, turns, dusts himself, picks up his gun.  Looks\n     down at the floor.  Broken glass and capsules everywhere  -  he\n     dropped the bottle of pills during the scuffle.  Starts to pick\n     them up.\n\n     Behind him SOMETHING is rising.\n\n     The shadowy Mystery Man is LEVITATING HIMSELF back up to the\n     bell-tower.  He lands behind White, approaches, lifting his\n     dagger, closer and closer.\n\n     White glances around.\n\n     The Man lunges, pushing White towards the shaft beneath the\n     swinging bells.  White FALLS, dangles over dark space, the Man\n     stands above him.\n\n                         MYSTERY MAN (shouts)\n               Do not make us hurt you...\n\n     The bells are swinging very close to the Man.\n\n                         MYSTERY MAN\n               It will be inconvenient, yes...\n\n     Suddenly, to Whiteís amazement, the shiny black rim of a bell\n     clips the Manís head.  SLAMS it against a low wooden beam in\n     the ceiling.  A splash of black liquid.  The Man slumps to the\n     ground, his head crushed beyond recognition.\n\n     White pulls himself up  -  stands over the Manís body, trying\n     to decide what to do.  A MOVEMENT catches his eye.\n\n     TIGHT ON the collapsed Manís ear  -  something moves inside.  A\n     BLACK INSECT, half-dead, crawls out of his crushed head.\n\n     White revolted, SQUASHES the insect under his shoe.\n\n\n     EXT./INT.  VARIOUS  -  MONTAGE\n\n     RAPID MOVE ACROSS MYSTERY MEN screaming.  Faces contort with\n     pain.  INTERCUT WITH:\n\n     Electricity ARCING between electrodes.\n\n     A building against the sky.  The windows EXPLODE.  Glass blows\n     out, raining down on the street.\n\n     A concrete wall SPLITS OPEN.  Slime oozes through the crack.\n\n     An old man, walks on a deserted street, looks up at the sky.\n     One of the lenses of his spectacles CRACKS without warning.\n     A chair falls over in a dark room.\n\n     A woman under a hair-dryer gossips on a phone.  Suddenly the\n     phone emits a high-pitched shriek.  Her ear spouts blood and\n     she screams.\n\n     A small transistor radio emits a high frequency and short\n     circuits with a spark.\n\n\n     EXT.  BUILDING\n\n     TIGHT ON  -  a wristwatch spinning backwards rapidly  -\n     completely haywire.\n\n     INSPECTOR BUMSTEAD stands on a street corner staring blankly at\n     his watch.  Taps it several times, annoyed, then looks up at a\n     THREE STOREY BUILDING.  He holds a piece of paper in his other\n     hand  -  on it a number rapidly scrawled:  23.\n\n     HIS P.O.V.\n\n     The dilapidated building  -  arched windows only on the topmost\n     floor.  A faded number on the facade  -  also 23.  The windows\n     light up continuously with rapid bursts of white light.\n\n     INSIDE\n\n     The inspector climbs a staircase, enters a dark room.\n\n     TWO FIGURES move about.  Bumstead glances at a UNIFORMED MAN,\n     standing beside a fake fire, who acknowledges his arrival.\n\n     To the side, A POLICE PHOTOGRAPHER flashes something swinging\n     back and forth, hanging from the ceiling.  It looks like...\n     Fredrick.  Dead.  His arms and legs missing.  A pool of blood\n     beneath the mutilated torso.\n\n     Bumstead looks at the cop.\n\n                         BUMSTEAD\n               How long have you been here?\n\n                         COP\n               Maybe ten minutes...\n                    (looks at his watch)\n               Thatís strange.\n\n                         BUMSTEAD\n               Spinning backwards?\n\n     The cop is shaking his watch, tapping it with his finger.  He\n     looks up.  Bumstead indicates his own watch.\n\n                         COP\n               Yours too?\n\n     Bumstead nods.  He removes a notebook from his pocket, walks\n     about the room, glances at objects, makes notes.\n\n     Bumstead steps over to a small RECTANGULAR HOLE in the wall.\n     He examines it carefully, then bends down and puts his head\n     through.  On the other side is a corridor snaking off into\n     darkness.  Just beneath the hole, is a broken dish and a\n     puddle.  Lying half in the puddle is the business card of\n     Doctor D.P. Schreber M.D.\n\n     Without removing his head from the hole he shouts to the nearby\n     cop.\n\n                         BUMSTEAD\n               I want prints over here...\n\n     Suddenly the door has caught Bumsteadís head in it.  He\n     struggles.  The cop and the photographer run over to help.\n\n\n     EXT.  BUILDING  -  NIGHT\n\n     MOVE IN ON a doorway.  Above it a small illuminated red sign:\n\n     DOCTOR D.P. SCHREBER M.D.\n\n     REVERSE ANGLE ON WHITE\n\n     He stands on the street, under the sign, rummaging in his\n     wallet, obviously looking for the business card he doesnít have\n     anymore.\n\n\n     INT.  WAITING ROOM\n\n     A white room, bare.  Dirt stains the walls near the air-vents.\n     A NURSE is typing behind her desk.\n\n     A THUMPING fills the room.  The nurse stands, removes her shoe\n     and hits a pipe running along the wall several times.  The\n     noise stops.\n\n     The front door creaks open and White enters.  She watches him\n     step into the room.\n\n                         WHITE\n               I want to see the doctor.  It's\n               important.\n\n                         NURSE\n               What time was your appointment?\n\n                         WHITE (angry)\n               Look!  Tell him I'm here.  Now.\n\n     He's leaning across her desk threateningly.\n\n                         NURSE (scared/standing)\n               Yes, certainly...  Who should I say?\n\n                         WHITE\n               No idea.  Just get him...\n\n     Suddenly a door opens and DOCTOR SCHREBER, clutching a file of\n     papers, steps out.  He freezes, stares at White.  The papers\n     fall from his hands to the floor.\n\n\n     INT.  DARK CHAMBER  -  NIGHT\n\n     A group of DARK SILHOUETTES file into a concrete room.\n\n     The MYSTERY MEN have gathered.  Like the Men who pursue White,\n     they wear coats, leather gloves, dark glasses, and have near\n     white skin.\n\n     One MAN points to diagrams on a chalk board and speaks in the\n     peculiar foreign tongue.\n\n     TIGHT ON THE DIAGRAM  -  a path through the city.  A circle\n     marks the point where the red line ends  -  a cathedral.  The\n     Man goes into broken English  -  a guttural accent.\n\n                         MAN 1\n               It has failed.\n\n     ANOTHER MAN stands at the rear of the room.\n\n                         MAN 2\n               This is becoming dangerous, yes!\n\n     YET ANOTHER MAN starts to tremble violently, seized with some\n     kind of convulsion.  He froths at the mouth and throws his head\n     about.  A TALLER MAN standing beside him opens a silver box,\n     removes a small WRITHING WORM.  He places this on the tip of\n     the trembling Man's tongue, who swallows it and calms down.\n\n                         MAN 3\n               Let's get this over with.\n\n     ANOTHER MAN rises suddenly, pushes forcefully to the front of\n     the group.\n\n                         MAN 5\n               What about the dance-steps!  This is\n               my responsibility, we must resolve\n               this issue, yes?\n\n     THE MEN turn to face him.  He is out of line.  He becomes\n     irritated, as if to say something further, then pulls himself\n     short, sits down.\n\n                         MAN 5\n               Sorry.\n\n                         MAN 3\n               The situation has changed.\n                    (pacing the room)\n               This one is in possession of\n               knowledge...\n\n                         MAN 1 (cuts in)\n               ...to avoid influence, yes.\n\n                         MAN 4\n               A freak!\n\n                         MAN 1\n               Impossible!\n\n     RUMBLING NOISE O.S. attracts everyone's attention.  They all\n     look to a round portal high on a wall.  The noise is louder.\n     several figures on stilts run past outside the opening  -  then\n     the noise subsides.  The MYSTERY MEN go back to more important\n     things.\n\n                         MAN 3\n               It gets interesting, yes.\n\n                         MAN 2\n               Stop this!  It has gone too far!\n               Tell Mister Black!\n\n     Man 2 stares blankly into space, he makes a peculiar clicking\n     noise with his mouth, his eyes roll upwards.\n\n\n     INT.  DOCTOR'S OFFICE\n\n     THE CAMERA GLIDES down a corridor, towards a door  -  a sign\n     says, DOCTOR IS:  IN.\n\n     INSIDE\n\n     White sits in a leather chair across from an ornate wooden\n     desk.  THE DOCTOR paces up and down in front of glass jars\n     containing preserved specimens.  He stops, looks at White.\n\n                         SCHREBER\n               You remember nothing?  Who you are?\n               What you've done?\n\n                         WHITE\n               You know something about me?\n\n                         SCHREBER\n               Ah, that would be cheating, wouldn't\n               it?\n                    (smiles)\n               Is there nothing you remember?  Not\n               even a detail?   You must try.\n\n                         WHITE\n               You think I haven't been trying!\n                    (calms himself)\n               It's like there was never anything\n               there.\n                    (pauses)\n               Just water.\n\n                         SCHREBER\n               Water?\n\n                         WHITE\n               Waves...  A beach.  A woman\n               whispering.  That's all.\n                    (looks up, yawns)\n               I need to stay awake.  Do you have\n               any pills?\n\n     The doctor walks to a glass cabinet and removes a bottle, takes\n     out two green capsules.  Hands them to White.  Sits behind the\n     desk again.\n\n                         SCHREBER\n               What does she say?  The woman.\n\n                         WHITE\n               Asks my name.  Over and over.  Just\n               like a broken record.  Only thing is,\n               I can't answer.  I've no idea what my\n               name is.\n\n                         SCHREBER\n               Your name is John White.\n\n                         WHITE\n               That's what people keep telling me.\n\n     Te doctor walks to a small sink in the corner, returns, hands\n     White a glass of water.  White swallows the pills.\n\n                         SCHREBER  (indicates pills)\n               And what's this about?  Why?\n\n     White stands up, starts to pace nervously.\n\n                         SCHREBER\n               Bad dreams?\n\n                         WHITE\n               Yes.\n\n                         SCHREBER\n               Tell me about them...\n\n                         WHITE (interrupts)\n               Yeah well, why don't I ask some\n               questions for a change.\n\n                         SCHREBER\n               If you like.\n\n                         WHITE\n               You're supposed to be my doctor,\n               right?\n\n                         SCHREBER\n               That's right.  I am your doctor.\n\n     White is very agitated now, his voice is getting edgy.\n\n                         WHITE\n               Known me for long?\n\n                        SCHREBER\n               Well...\n\n                         WHITE (cuts in)\n               Am I a killer?\n\n                         SCHREBER\n               I cannot say...  You don't know the\n               answer to that?\n\n                         WHITE\n               I told you, I can't remember a thing!\n\n     White reaches across abruptly, GRABS the doctor.\n\n                         WHITE  (angry now  -  shouting)\n               Look, you know something about me,\n               out with it!  Let's end this\n               bullshit!  I want answers!\n\n     The doctor is obviously scared.\n\n                         SCHREBER\n               We won't get anywhere like this.\n               Please.  Let's take things in easy\n               steps...\n\n\n     INT.  BUMSTEAD'S APARTMENT/KITCHEN  -  NIGHT\n\n     TIGHT ON DRAWING PINS  -  Being pushed into a map.  A seeming\n     random pattern across the terrain of the city.  Each pin is\n     labelled:  VICTIM 1, VICTIM 2,...  etc.\n\n     WIDER ON BUMSTEAD\n\n     He's tired, like he hasn't slept.  He's looking at the map\n     stuck to a wall.  There's several neat piles of folders on the\n     kitchen table in front of him.  The kitchen itself is\n     incredibly neat  -  everything completely organized.\n\n     Bumstead shakes his head slowly, turns away from the board.\n     Picks up a cup of hot tea, pours milk into it from a small jar.\n\n     TIGHT ON THE TEA CUP  -  Cream SWIRLS into a rapidly dissolving\n     spiral.  Bumstead looks up.  Puts down the cup hurriedly, turns\n     back to the map.\n\n     With a thick pen he traces a line between each point marking\n     the location of the victims.  He steps back to examine his\n     handiwork.\n\n     A SPIRAL  -  moving outwards.  Beyond the last victim it\n     becomes a dotted line, following the same trajectory but with a\n     big question mark beside it.\n\n     Bumstead glances over to a blackboard with a list of names and\n     addresses on it.  He holds up the doctor's card and stares at\n     it.  He turns it over, notices an address on the back.\n\n\n     INT.  DOCTOR SCHREBER'S OFFICE  -  NIGHT\n\n     SCHREBER is showing WHITE a series of CHARTS.  The doctor seems\n     nervous about White's potential for further violence.\n\n                         SCHREBER\n               Put simply...  a penetration of the\n               left parieto-occipital area of the\n               cranium...  complicated by\n               inflammation that resulted in\n               adhesions of the brain to the\n               meninges.  Without going into\n               detail...  the formation of scar\n               tissue altered the configuration of\n               the lateral ventricles, producing\n               incipient atrophy of the medulla...\n\n                         WHITE (cuts in)\n               Look.  It was a simple question.  Can\n               someone kill and not remember it?\n\n                         SCHREBER (smiles)\n               I'm sorry.  I get carried away\n               sometimes.  Possible?  I'm...  ah,\n               afraid so.\n\n                         WHITE\n               Did she drown?  The woman you told me\n               about?\n\n                         SCHREBER\n               Not exactly.  She was found in a\n               canal, disembowelled.  Throat cut.\n               Blood drained.  The body wrapped in a\n               bed-sheet.\n\n     White shakes his head, looking blankly at the doctor.\n\n                         WHITE\n               Horrible...\n\n                         SCHREBER\n               You remember nothing, eh?\n                    (shakes his head)\n               Let me show you something.\n\n     Schreber turns, points to DOUBLE-DOORS.  He walks towards\n     these.  White follows.\n\n                         SCHREBER\n               Formation of memories is the most\n               important of brain functions.\n\n     THE DOORS ARE OPENED\n\n     They step into a room of living animal experiments.\n\n                         SCHREBER\n               We are little more than a sum of\n               memories.  From them we reference who\n               we are, where we're going.  Without a\n               past we are nothing.  This is why you\n               are so interesting.\n\n                         WHITE\n               I'm nothing then.\n\n                         SCHREBER\n               Anything but, my friend.\n\n     The two men look down on a monkey with the top of its head\n     missing, squirming in a mechanical device that restricts its\n     movements.\n\n                         SCHREBER\n               It feels no pain.\n\n     White turns and starts to pace away.  Schreber reluctantly\n     follows.\n\n                         WHITE\n               Can I get my life back?\n\n                         SCHREBER\n               Maybe.\n\n     Schreber points dramatically at a wooden structure containing\n     two rats.\n\n                         SCHREBER\n               We know of two kinds of memory.\n               Firstly, declarative memory.\n\n     The rats perform various activities involving mazes and\n     geometric symbols.  Schreber turns to look at White, eyebrow\n     raised.\n\n                         SCHREBER\n               And then there is procedural memory.\n\n     TIGHT ON HIS SLENDER FINGER  -  pointing to a machine also run\n     by rats.  The object is to make it through a guillotine device.\n     One rat is successful, the other is chopped neatly in two.\n\n                         SCHREBER\n               Follow?\n\n     White nods.\n\n                         SCHREBER\n               Research on simple animals can be...\n               useful.  To show us where memory\n               storing systems are located, for\n               example.  I am building an experiment\n               with hamsters next.\n                    (looks at nearby cage\n                    of hamsters)\n               Cute little things.\n\n     Schreber puts a hand on White's shoulder.\n\n                         SCHREBER\n               Listen to me talk!  You must be\n               hungry.\n\n     White nods again, extremely troubled.\n\n\n     INT.  HALL-WAY (DOCTOR'S RESIDENCE)\n\n     Schreber's office is an annex of his living quarters  -  a\n     maze-like series of rooms and halls.  White is led down a dark\n     hall by Schreber, clutching a candle.\n\n                         SCHREBER\n               Whole damn wing lost power.  Wiring's\n               old.  Keep meaning to get it fixed.\n               Here we are.\n\n     They've stopped outside a flaking door.\n\n\n     INT.  KITCHEN\n\n     A small eat-in kitchen.  Dirty and run-down.  White, sits at a\n     bench, as Schreber removes items from the refrigerator.  The\n     doctor holds up a large FROZEN fish.\n\n                         SCHREBER\n               Ah.  Beautiful!  Head and all!  Just\n               how I like 'em!\n\n     ANGLE ON FRYING PAN ON STOVE  -  The fish lands in it and starts\n     to sizzle furiously.\n\n     ANGLE ON WHITE\n\n                         WHITE\n               I'm sorry.  About before.\n\n                         SCHREBER\n               I don't blame you for getting angry.\n               You are in a frustrating situation.\n               You must be patient though.  Trust me\n               completely.  I'm here to help.\n\n     A set of swinging doors on the other side of the room open\n     slightly and THE NURSE looks in.\n\n                         NURSE (to Schreber)\n               I have to talk to you.\n\n                         SCHREBER\n               It can't wait?\n\n     She shakes her head, with a serious expression, then darts out\n     again.\n\n                         SCHREBER  (to White)\n               Excuse me.  Ah, make yourself at\n               home.\n\n     He leaves.\n\n     Alone, White looks around the bleak room.  He takes off his\n     coat and sits down again.  He removes the FISH.  The eye opens.\n     The creature looks up at him.  It breaths painfully.\n\n                         WHITE\n               Still kicking, huh?\n\n     He puts it back in his pocket.\n\n     The OTHER fish is spattering oil everywhere.  Smoke starts to\n     fill the room.  White, steps over and looks at the frying pan.\n     The fish is turning black.  He turns the heat down.\n\n     He notices a SMALL HOLE in the wall.  At eye height.  He steps\n     across, looks through.\n\n     TIGHT ON WHITE'S eye through the hole.\n\n     HIS P.O.V.\n\n     A dark room.  Shadows on the wall.  Something wet, some kind of\n     ANIMAL, moving in the darkness.  He can hear breathing and\n     whispering voices.\n\n     White's eyes start to blur, he rubs them.\n\n                         SCHREBER O.S.\n               How are things in here?\n\n     White spins, like he's caught doing something wrong.  The\n     Doctor walks across to the stove, prods the frying fish with a\n     fork.\n\n                         SCHREBER\n               Ah, nearly done.  So tell me about\n               your dreams.  I'm very interested.\n\n     White is having a hard time focusing.\n\n                         WHITE\n               Just the typical fabrications of a\n               distorted mind.  You know, chased by\n               mysterious men in black, that kind of\n               thing...\n\n     WHITE'S P.O.V.  -  ANGLE ON Schreber with his back turned, at\n     the stove.  THE IMAGE is blurring.\n\n                         SCHREBER\n               Ah, our friends in black...  they are\n               not just a figment of your\n               imagination you know, in fact none of\n               what you are experiencing is anything\n               but real.\n\n     Smoke rises thickly around the doctor.\n\n                         SCHREBER\n               I know everything about you.  You\n               have no choice but to trust me.\n\n     Flames are shooting up around Schreber from the frying pan.\n     His arms catch fire, and he suddenly spins around clutching\n     flaming daggers in both hands, his whole body engulfed in fire,\n     his face charred, black flesh hanging off his skull.\n\n                         SCHREBER\n               Scarey, isn't it?\n\n     White startles awake.\n\n     Schreber stands at the stove looking at White.  Everything is\n     normal.\n\n                         SCHREBER\n               Are you feeling alright?\n\n     White stands awkwardly, pulls his coat on.\n\n                         SCHREBER\n               What are you doing?\n\n                         WHITE\n               I have to go...\n\n                         SCHREBER\n               You can't go yet.  We've got so much\n               to talk about...\n\n     Suddenly White feels feint  -  leans against the wall to steady\n     himself.\n\n                         SCHREBER\n               You're tired.  You need to lie down.\n\n     ON WHITE  -  swaying.\n\n                         WHITE\n               Those pills...\n\n     HIS P.O.V.\n\n     The scene is distorted  -  like looking through water.  Things\n     start SPINNING.\n\n                         SCHREBER (echoic)\n               Yes.  A little something to help you\n               relax.  Harmless...\n\n     A tile floor RISES rapidly TOWARDS CAMERA.\n\n                                              CUT TO:\n\n     GREY LIMBO\n\n     Objects float underwater.  They rise upwards amidst bubbles,\n     break the surface.  A storm at sea  -  dismembered BODY PARTS\n     float all the way to the horizon.\n\n     TWO FOETUSES in separate jars are talking to each other through\n     the glass.\n\n                         FOETUS 1\n               This is madness.  If we're caught...\n\n                         FOETUS 2\n               Shut-up.  Help me with these\n               straps...\n\n\n     INT.  EXAMINATION ROOM\n\n     WHITE wakes strapped to an exantination table.  SCHREBER and the\n     NURSE loom above him.  The nurse hands Schreber a long, chrome\n     SYRINGE.  The doctor moves towards White.\n\n                         SCHREBER (holds syringe up)\n               Now you must relax, Anton.\n\n     A DOOR-BELL RINGS O.S. The nurse makes for the door.\n\n                         SCHREBER\n               Leave it!\n\n     He's tapping the side of the syringe, squirting out air\n     bubbles.  THE DOOR-BELL RINGS again  -  very insistent.\n     Schreber looks at the nurse, annoyed.\n\n                         SCHREBER\n               Damn!  Whoever it is  -  get rid of\n               them!\n\n     She heads to the door  -  turns back.\n\n                         NURSE\n               Keys.\n\n     Schreber puts the syringe down, fumbles in his pocket, pulls\n     out a huge collection of KEYS on a ring, walks to the nurse,\n     hands them to her.\n\n     White manages to wriggle a hand free from the leather strap\n     holding him.  The nurse leaves, the doctor shuts the door,\n     locks it.  He steps over to White.\n\n                         SCHREBER\n               I'm sorry I had to put you through\n               this, Anton.\n                    (lowers syringe to\n                    White's forehead)\n               There will be some pain, but things\n               will be easier this way.\n\n     White lashes out, PUNCHES the doctor in the face.  His glasses\n     go flying, and he falls to the floor, blinded, scrambling for\n     the spectacles.\n\n     A convenient scalpel cuts White from his remaining bonds.  He\n     undoes the last strap around his ankles as the doctor replaces\n     his glasses and leaps at him trying to drive the syringe INTO\n     WHITE'S FOREHEAD.\n\n     The struggle continues  -  each man tries to turn the syringe\n     on the other.  White pushes the doctor, who falls backwards.\n     Schreber leaps onto him, both fall against a tray of medical\n     instruments.\n\n     A loud THUMPING on the examination room door.  White is grabbed\n     from behind, pinned down with the syringe INCHES from his face.\n\n     A CRASH O.S.  Splintering wood.  The door bursts open.\n\n     A ROTUND SILHOUETTE  -  is revealed, clutching a police\n     special, flashing a badge.  A squeaky, over-excited, voice:\n\n                         BUMSTEAD\n               Hold it!\n\n     Schreber and White FREEZE in mid-struggle, look at the\n     inspector.  Behind him, the nurse appears in the hallway.\n\n                         BUMSTEAD\n               Police.  Nobody move.\n\n                         SCHREBER\n               He tried to kill me!\n\n                         BUMSTEAD\n               Shut up!  Everybody stay calm...\n\n     Bumstead steps into the light, shoves his gun in White's face,\n     handcuffs him.  Bumstead searches White, finds the revolver,\n     takes this.  Also takes his wallet.  He glances at the doctor,\n     who hides the syringe behind his back.\n\n                         BUMSTEAD (to Doctor)\n               You Schreber?\n\n     Schreber nods blankly.\n\n     Bumstead runs his hand over White's side pocket  -  feels\n     something.\n\n                         BUMSTEAD\n               What's that?\n\n     White says nothing.  The inspector opens the pocket and looks\n     in.\n\n                         BUMSTEAD (disgusted)\n               A fish, huh?\n\n\n     EXT.  CITY STREETS  -  NIGHT\n\n     An old-fashioned BLACK SEDAN drives over a rusty suspension\n     bridge.  Stone gargoyles look down at the lone vehicle.  It's\n     been raining.  Streets are empty.\n\n     INSIDE THE CAR\n\n     WHITE and the INSPECTOR drive silently.  Bumstead has appointed\n     his un-marked police vehicle with all the comforts of home.\n     Hot thermos.  Note pad holder, complete with light.  Coat\n     hanger.  Gun rack.  A system for everything.\n\n                         BUMSTEAD\n               Dammit!\n                    (glances at his\n                    watch)\n               I'm curious?  How many so far?\n\n     He shakes his watch, puts it to his ear.\n\n                         WHITE (confused)\n               What?  I...\n\n                         BUMSTEAD (counts on fingers)\n               Let's see, there's the little guy\n               with no arms or legs.  And the young\n               boy?\n\n                         WHITE (disturbed)\n               Young boy?\n\n     CLOSE ON WHITE  -  frightened now.\n\n                         BUMSTEAD\n               The six year old.  Sure, you\n               remember.\n\n     Bumstead pulls something from under the dashboard.  A SANDWICH,\n     carefully wrapped and prepared.  After glancing at his watch\n     again, he bites into it.\n\n                         BUMSTEAD (chewing)\n               Y'know, the kid you left in the meat\n               packing plant, cut into pieces.\n               Packed into brown paper parcels,\n               wrapped in twine, that kind of thing.\n\n     No answer.\n\n                         BUMSTEAD\n               You sure have demonstrated a great\n               deal of...  imagination.  The baby\n               was the best though.  Several cops\n               lost their lunch over that one.  Head\n               twisted off, spine pulled out,\n               yeech...\n\n                         WHITE (cuts in)\n               Stop it.  You're making me sick...\n\n                         BUMSTEAD\n               We count seven so far.  Anyone we\n               missed?\n\n     RADIO CRACKLE O.S.  -  A tinny voice cuts in.\n\n                         VOICE\n               Inspector Bumstead...  Inspector...\n\n     Bumstead picks up a microphone, speaks into it.\n\n                         BUMSTEAD\n               What is it, Crenshaw?\n\n                         CRENSHAW\n               Just reminding you...  your eight pee\n               em...\n\n                         BUMSTEAD\n               Dammit.\n                    (looks at watch)\n               Very efficient, as usual, Crenshaw.\n               Remind me to give you my watch.  It\n               needs fixing.\n\n                         CRENSHAW\n               Yes sir.\n\n     Bumstead replaces the microphone under the dashboard, takes a\n     SHARP CORNER as he finishes off the sandwich.\n\n                         WHITE\n               Where are we going?\n\n                         BUMSTEAD\n               Shut-up.\n\n     Burastead pulls out a small brush, cleans the fallen crumbs from\n     his trousers, keeping a hand on the wheel.\n\n     White is silent  -  his wounds continue to bother him.  He\n     leans down to scratch through his trousers.\n\n                         WHITE (quietly)\n               Shit!\n\n                         BUMSTEAD\n               Gesundheit!\n\n                         WHITE (looks up)\n               I didn't sneeze.\n\n\n     EXT.  HOSPITAL ENTRANCE  -  NIGHT\n\n     The INSPECTOR's car pulls up and stops.\n\n     INSIDE THE CAR\n\n                         WHITE\n               What are we doing here?\n\n     Bumstead grabs a bunch of flowers off the back seat.\n\n                         BUMSTEAD\n               Get out.\n\n\n     INT.  HOSPITAL  -  NIGHT\n\n     BUMSTEAD pushes the handcuffed WHITE through a swinging metal\n     door.  They enter a sterile air-conditioned room.  An\n     effeminate MALE NURSE sits behind a glassed-in counter.\n     Directly opposite is a small WAITING ROOM through a glass\n     panelled door.  Bumstead pushes White into this room.\n\n                         BUMSTEAD\n               Wait here.\n\n     The inspector shuts the door behind him.  White looks about the\n     blank room, takes a seat.  He can see Bumstead, through the\n     glass panel in the door, walk up to the male nurse opposite.\n\n     OUT IN THE CORRIDOR\n\n     The inspector talks to the male nurse through a tiny opening in\n     the window.\n\n                         BUMSTEAD\n               Bumstead.  I'm here to see my mother.\n\n     BACK TO WHITE\n\n     He cannot hear anything of what Bumstead is saying.  He sees\n     him take out his wallet and show his badge.  The male nurse is\n     concerned, looks over towards White, then opens a drawer, hands\n     Bumstead a KEY.  The inspector steps back to the waiting room\n     door and LOCKS IT from the outside.  He looks at White for a\n     moment, then walks away, along the corridor.\n\n\n     INT.  HOSPITAL ROOM\n\n     Bumstead enters darkness  -  pneumatic MACHINE NOISE fills the\n     gloom.  He walks quietly to his mother, encased in a metallic\n     contraption, something like an iron lung.\n\n                         BUMSTEAD (whisper)\n               Brought you these.\n\n     He places flowers on the bedside table.  His mother just stares\n     expressionless into space, in a coma.  He sits on a metal\n     chair, looks at the woman.  Her life-sustaining machines hiss\n     and breathe.\n\n\n     INT.  POLICE STATION\n\n     A FINGER presses down on the sticky surface of a page.  It\n     pulls away revealing an inky finger-print.\n\n     WIDER\n\n     White is standing in a bare room, in front of a finger-printing\n     machine.  He's alone.  A blast of electrical FEED-BACK.  White\n     looks up at a speaker mounted to the wall.\n\n                         MECHANICAL VOICE  (through speaker)\n               Move  -  forward.\n\n     White follows a painted line on the floor, stands against a\n     wall, in front of an old-fashioned camera.  A slot opens in the\n     wall behind him, mechanical arms spring forward, restrain him,\n     one arm holds a sign with a number in front of him.  A flash\n     goes off, the click of a shutter.\n\n                         MECHANICAL VOICE\n               Left  -  profile.\n\n     A claw lowers from the ceiling, grips White's head, turns it\n     abruptly  -  the camera fires.\n\n                         MECHANICAL VOICE\n               Right  -  profile.\n\n     The claw turns his head the other way.  The camera fires again.\n\n                         MECHANICAL VOICE\n               Move  -  forward.\n\n     Across the room A BUZZER SOUNDS, a red light flashes above a\n     door.  White is released by the mechanical hands, walks over,\n     opens the door and steps into darkness.\n\n     LIGHTS COME ON  -  extremely bright.  A room for line-ups  -\n     markings on the white wall behind White indicate varying\n     heights, a darkened window faces him.  He is obviously to be\n     identified by an unseen person.\n\n     A buzzer sounds again, a light indicates another door.\n\n                         VOICE\n               Move  -  forward.\n\n     White moves into another room.  A chair faces a large wheel\n     painted in a black and white spiral.  He sits down  -  the\n     wheel turns, faster and faster.\n\n                         VOICE\n               Watch  -  the  - wheel.\n\n     The wheel stops after several seconds.\n\n                         VOICE\n               Move  -  forward.\n\n     The next room is full of scientific equipment.\n\n                         VOICE\n               Stand  -  behind  -  the  -  screen.\n\n     White sees a metal-frame X-ray machine  -  he steps across to\n     it.  The screen lights up, filling the room with a green glow.\n     We can see the shape of his skeleton.  Where his pocket would\n     be, is the tiny skeleton of the fish.\n\n                         VOICE\n               Move  -  forward.\n\n     The next room is empty.\n\n                         VOICE\n               Face  -  the  - wall.\n\n     White turns.  As soon as he has done this hears a door open\n     behind him.  FOOTSTEPS approach.  Blows rain down on him, fists,\n     boots, clubs.  He slides to the floor.  The lights go out.\n\n\n     INT.  INTERROGATION ROOM\n\n     LIGHTS come on again.  White is dazed  -  in a chair, a bright\n     light in his face blinds him.\n\n                         VOICE\n               What's your name?\n\n                         WHITE  (squints into light)\n               I don't remember.\n\n                         VOICE\n               Oh, no?\n\n     White shakes his head slowly and looks at the floor.  The light\n     is angled away, pointed down towards A TABLE.  White can see\n     now.\n\n     HIS P.O.V.\n\n     A featureless room.  STROMBOLI stands over him, behind him is\n     BUMSTEAD and two shadowy guards.  Bumstead picks up an\n     envelope, removes a SERIES OF PHOTOS, hands these to Stromboli.\n\n                         STROMBOLI\n               John...\n\n     He throws the first shot down on the table in front of White.\n     A black and white police photo of a murder victim.\n\n                         STROMBOLI\n               ...Murderer.\n\n     Another photo goes down.  Another victim.  Another and another.\n     Each more grisly than the last.\n\n                         STROMBOLI\n               You'll sign a confession?\n\n     White nods.  He's looks utterly lost.\n\n     Bumstead steps across to a small speaker box on the wall near\n     the only door, presses a button.\n\n                         BUMSTEAD (into speaker)\n               Okay.\n\n     TWO GUARDS immediately step through the door, GRAB White by his\n     arms.  They carry him off.\n\n\n     INT.  PRISON CELL\n\n     White is woken by a UNIFORMED GUARD shining a light in his\n     eyes.\n\n                         GUARD\n               Visitor.\n\n\n     INT.  VISITING ROOM\n\n     White is led into an empty pale green room with a glass barrier\n     down the middle.  The guard tells him to sit and wait.\n\n     The door on the other side of the barrier opens with a squeak  -\n     DOCTOR SCHREBER steps in, looking frightened.\n\n                         WHITE  (to guard)\n               Keep him away:  He's insane.\n\n     The guard just smiles, looks at the doctor knowingly.\n\n                         SCHREBER\n               Please, stay calm.\n\n                         WHITE  (to guard)\n               This man wants to kill me.\n\n     The guard remains indifferent.\n\n                         SCHREBER  (to guard)\n               Just one of his many delusions  -\n               it's nothing.\n                    (a whisper to White)\n               Shut up!  Listen, damn you!  This is\n               a fortunate coincidence  -  we won't\n               get another chance like this.  Listen\n               to me.\n\n                         WHITE  (turns to Doctor)\n               What do you want?\n\n                         SCHREBER\n               You're innocent...\n                    (still a whisper)\n               You didn't kill anyone.\n\n                         WHITE  (sarcastic)\n               What am I doing in here then?\n\n                         SCHREBER\n               Listen to what I have to say.  Decide\n               for yourself.\n\n     AN ADJOINING ROOM\n\n     The dark silhouettes of BUMSTEAD and ANOTHER COP watch from\n     behind a two-way mirror.\n\n                         BUMSTEAD\n               What's he doing here?\n\n                         COP\n               Says he is the man's doctor...\n                    (taps side of his\n                    head)\n               You know...\n\n                         BUMSTEAD\n               I know it's his doctor...\n                    (into intercom)\n               I need the file on..\n                    (reads clip-board)\n               Daniel Paul Schreber M.D.\n\n                         MISS CRENSHAW'S VOICE O.S.\n               Schreber.  Yes.  Isn't that his\n               doctor?\n\n                         BUMSTEAD (evenly)\n               Yes.\n                    (beat)\n               And it's SCHREBER  -  with an 'h'.\n\n                         MISS CRENSHAW\n               Yes.  An \"h\".\n\n     The inspector looks up from the speaker.\n\n     HIS P.O.V.  -  THROUGH THE MIRROR, White seems to have calmed\n     down.\n\n     BACK IN THE VISITING ROOM\n\n                         SCHREBER\n               The men in black  -  they're the\n               killers.\n\n     White stands abruptly, pushes himself against the glass.\n\n                         WHITE\n               You're a liar!\n\n                         SCHREBER\n               No, it's the truth.\n\n                         WHITE\n               So you're telling me the truth this\n               time?  Is that it!\n\n     The doctor removes a SMALL SYRINGE from his black bag, places\n     it on the table in front of the glass, blocks it from the\n     guard's view.\n\n                         SCHREBER\n               If you would only take this, inject\n               it in your brain, everything would be\n               much clearer.\n\n                         WHITE\n               Not that again...\n\n                         SCHREBER\n               Everyone get's one  -  very much like\n               this...\n                    (points to syringe)\n               But this one's special.  It will help\n               you understand, everything...\n\n                         WHITE (cuts in)\n               I'm not injecting anything into my\n               brain.\n\n                         SCHREBER\n               Anton  -  I mean, John, there\n               has been an experiment, a dangerous\n               experiment.  I arranged it.  It was a\n               lie from the beginning.  It almost\n               worked, but things did not go as they\n               should have.  You have been left  -\n               blank.\n\n     Schreber waves frantically at the air surrounding him.\n\n                         SCHREBER\n               You can change this, all this.\n                    (points at syringe\n                    again)\n               But you must take it.\n\n     White stares blankly at him for a moment, then:\n\n                         WHITE\n               You've been working too hard.\n\n                         SCHREBER\n               Please!  Don't be foolish!  Time is\n               short.  Let me show you something.\n               Look at this syringe.\n\n                         WHITE\n               Why?\n\n                         SCHREBER\n               Don't ask stupid questions.  Look at\n               it.\n\n     White reluctantly does this.\n\n                         SCHREBER\n               Concentrate.  Imagine the syringe\n               rising.  Picture it floating above the\n               table.\n\n     TIGHT ON WHITE\n\n                         SCHREBER\n               Do it!\n\n     WHITE'S P.O.V.\n\n     The syringe starts to vibrate, actually RISES INTO THE AIR  -\n     floats stationary between White and Schreber.\n\n                         WHITE\n               It's a trick.\n\n                         SCHREBER\n               No it isn't.  You are doing it!  Now\n               raise it over the glass and...\n\n     Suddenly the syringe spins towards the doctor, IMPALES itself\n     in his shoulder.  He yelps, grabs it.\n\n                         WHITE\n               Oh, sorry...\n\n     The doctor pulls out the syringe, is about to say more when a\n     BUZZER SOUNDS.\n\n                         MECHANICAL VOICE\n               Your  -  time  -  is  -  up.\n\n     Schreber looks to where the voice came from  -  a speaker above\n     their heads.\n\n                         SCHREBER (looks at White)\n               I gave you your chance, now it's too\n               late.  They'll learn you are here\n               soon.  It's all over.\n\n\n     INT.  POLICE STATION CORRIDOR\n\n     DOCTOR SCHREBER paces towards the exit.  BUMSTEAD steps in\n     front of him.  The doctor is startled.\n\n                         BUMSTEAD\n               Doctor!  What brings you here?\n\n                         SCHREBER\n               Just visiting my patient.\n\n                         BUMSTEAD\n               Really?  And how is his state of\n               mind?\n\n                         SCHREBER\n               He's seriously disturbed...\n\n     The doctor is nervous, glancing about.\n\n                         BUMSTEAD\n               You seem a little edgy.  Everything\n               okay?\n\n                         SCHREBER\n               Yes, of course.  Everything's fine...\n\n     He tries to push past.  Bumstead grabs his arm.\n\n                         BUMSTEAD\n               To tell you the truth, I'm glad we've\n               run into each other like this.  Maybe\n               you can help me tidy some loose ends.\n\n                         SCHREBER\n               Loose ends?\n\n     SCHREBER looks like a trapped animal, when:\n\n                         VOICE O.S.\n               Bumstead!\n\n     Bumasead turns to look down the corridor.  He sees STROMBOLI\n     peaking out of his office door.\n\n                         STROMBOLI\n               I need to speak to you.  Immediately.\n\n     The door shuts again.  Bumstead turns back.  The doctor is GONE\n     -  the corridor empty.\n\n\n     INT.  HOLDING CELL\n\n     White is staring through a glass door at A COP.  A KETTLE\n     WHISTLES O.S.  The cop gets up and moves off.\n\n     White looks up.\n\n     HIS P.O.V.\n\n     A small WINDOW, high up on the wall.  Impossible to get to,\n     even if his hands weren't cuffed.  Nothing he can do  -  he\n     looks at a clock on a wall.\n\n     PUSH IN on the clock  -  TICKING GETS LOUDER.\n\n\n     INT.  POLICE STATION\n\n     BUMSTEAD enters STROMBOLI'S office.  A nervous CHIEF-INSPECTOR\n     is flanked by TWO STRANGE-LOOKING MEN in ill-fitting brown\n     suits.\n\n                         STROMBOLI\n               Bumstead, these...  er, gentlemen are\n               here to collect White.\n\n     Bumstead suspiciously eyes the two men, beside STROMBOLI'S\n     desk.\n\n                         BUMSTEAD  (to men)\n               Who are you?\n\n                         STROMBOLI (even more nervous)\n               Please, Bumstead.  Co-operate  -\n               it's easier.\n\n                         BUMSTEAD\n               This is highly irregular.  I have a\n               right to know.\n\n                         MAN 1\n               We are from a mental asylum.\n\n     He notices that this man's moustache is LOP-SIDED.  The other\n     man wears spectacles WITH NO LENSES in the frames, clutches an\n     un-lit pipe in his teeth.\n\n                         STROMBOLI\n               Yes.  That's right.  He's ill  -  he\n               needs expert help.\n\n                         BUMSTEAD\n               I see...\n\n                         MAN 1\n               Yes, Inspector.  Has he been\n               displaying any strange...  behaviour?\n\n                         BUMSTEAD\n               He's been a little angel...\n\n                         STROMBOLI\n               If you could show them to the holding\n               cell now.\n\n     SLOW MOVE IN on Bumstead's face.\n\n     IN THE CORRIDOR\n\n     Bumstead and the MYSTERY MEN walk towards the holding cell.\n     Bumstead glances up through the glass in the door before he\n     enters.  IT'S EMPTY.\n\n     He fumbles furiously for the key in his pocket  -  BURSTS into\n     the room.  White is gone.  But where?  Bumstead throws a look\n     back TO THE FRONT DESK.\n\n                         MAN 1\n               Where is he?\n\n     The cop is just returning, holding a cup of coffee.  He looks\n     at the inspector, sees the room is empty.  A nervous twitch\n     knocks the cup from the cop's hands.\n\n     TIGHT ON THE CUP  -  smashing on the floor.\n\n\n     INT.  SUBWAY STATION  -  NIGHT\n\n     Underground.  CONSTANT NOISE O.S. of trains arriving and\n     departing but none are seen.\n\n     CAMERA MOVES PAST broken tiles on a wall to REVEAL:  WHITE  -\n     sitting amidst rubbish on the ground, looking around, confused,\n     groggy from sleep.  He looks down at his hands, unsuccessfully\n     tries to free them from the cuffs.\n\n     MOVE IN TIGHT ON WHITE\n\n     He starts to cry.  He puts his head in his hands, his body\n     spasms with each sob.\n\n     SEVERAL ANGLES of the empty corridors of the subway.  White's\n     crying is heard  -  echoic.\n\n     BACK ON WHITE  -  A small feminine HAND touches his head.\n\n     Startled, he throws himself back, like he's about to be\n     attacked.\n\n     THE BEAUTIFUL JAPANESE WOMAN from the church looks down at him.\n\n\n     INT.  POLICE STATION\n\n     BUMSTEAD and the COP are getting grilled by STROMBOLI.\n\n                         BUMSTEAD\n               Yes, sir.  I'm sorry...  But I don't\n               understand how it was possible.  The\n               only window was twenty feet up a\n               vertical wall, he was cuffed...\n\n                         STROMBOLI\n                    (shouts at cringing\n                    COP)\n               How could you have been so stupid?\n \n                         COP\n               I'm sorry, sir.\n\n                         STROMBOLI\n               Alright, get out.\n\n     Bumstead gets up and leaves.\n\n                         STROMBOLI\n               You stay.\n\n     The cop hustles out, shuts the door.\n\n                         STROMBOLI\n               Bumstead, you're starting to annoy\n               me.  This case is very important to\n               me.  Just a little warning:  I've got\n               my eye on you inspector, remember\n               that.\n\n                         BUMSTEAD\n               Yes, sir.\n\n     He leaves.\n\n\n     INT.  APARTMENT BUILDING\n\n     White, awkwardly trying to hide his cuffed hands in his coat,\n     follows the JAPANESE WOMAN up a flight of dark stairs.  she\n     keeps looking back at him, smiling but SAYS NOTHING.\n\n\n     INT.  APARTMENT\n\n     White and the woman step into a run-down apartment.  She points\n     to a couch.  White looks uncomfortable.  She smiles again, then\n     turns on the radio.  MUSIC.\n\n     She steps into an adjoining bedroom, leaving White alone.  He\n     gets up and starts to tune the radio.  A babble of fragments of\n     voices and music, then:  A NEWS REPORT...\n\n                         NEWS READER O.S.\n               ...earlier this evening it was\n               reported a man fitting his\n               description had been apprehended.\n\n     White listens nervously.\n\n                         NEWS READER O.S.\n               ...and now for a message from LUMP-O\n               food products...\n\n     Across the room he can see the woman's bedroom door ajar.  He\n     crosses to the doorway and looks in.  The woman stands naked\n     against a deep red wall, her back turned.  She has an elaborate\n     TATTOO on her back  -  looks like an INSECT.  She puts on a\n     dressing gown and TURNS SUDDENLY.\n\n     White steps back before she notices him, he goes back to the\n     couch.\n\n     She steps from the doorway holding a BAR OF SOAP in her hand.\n     She sits down beside White and takes his hands, gently\n     lathering soap around the handcuffs, continuing to smile at\n     him.  White looks down.\n\n     His hands seem to have SHRUNK  -  they poke out of his sleeves\n     like tiny children's limbs.  The cuffs effortlessly slip off.\n\n     White looks at the woman, then back at his hands  -  NOTHING\n     STRANGE, they are normal size, but somehow the cuffs have been\n     removed.  He looks at the woman again, grateful.  He can't help\n     smiling.\n\n     HIS P.O.V.\n\n     Her eyes.  Her lips.  Her neck.  She leans forward, goes OUT OF\n     FOCUS.\n\n     ANOTHER ANGLE\n\n     She touches her tongue to his lips.  Kisses his face.  She\n     pushes him back on the couch and pulls her dressing gown open.\n     White does not respond  -  seems uncertain.  She sits upright,\n     astride his body, unbuckles his belt, opens his shirt, caresses\n     his chest.  She stops, her face in shadow.\n\n     Slowly, White lifts his hands to her breasts, touches them.\n     She starts to breath deeply.\n\n     OUT OF FOCUS  -  their bodies entangle, begin to move\n     rhythmically.  The CAMERA TRACKS SIDEWAYS, REVEALS a microphone\n     behind a chair, leads us to a mirror on a wall.  On the other\n     side of the one-way glass a reel-to-reel tape recorder is\n     picking up the SOUNDS OF HEAVY BREATHING.\n\n     OUTSIDE\n\n     The building the lovers are in SLOWLY RISES into the air, past\n     taller buildings and floats out over the city.  Its shadow\n     moves past empty plazas and across faces of grey towers.\n\n     INSIDE\n\n     White sleeps, as buildings move past outside the window.  He\n     opens his eyes, FORCES himself awake.  Looks across the dark\n     room.\n\n     The JAPANESE WOMAN stands naked at the window, clutching a\n     large red megaphone.  IN PERFECT ENGLISH she shouts down at the\n     streets drifting past.\n\n                         JAPANESE WOMAN\n               He's up here!  He raped me!  Hurry!\n               Before he kills again!\n\n     OUTSIDE\n\n     MYSTERY MEN stand on roof-tops, watching the building drift\n     past.\n\n     BACK IN THE ROOM\n\n     White runs to the window, GRABS the woman.  As they struggle,\n     the building is landing softly in another part of the city.\n\n     LONG SHADOWS move towards the entrance...\n\n     WHITE WAKES UP AGAIN  -  finds he is still on the couch.  NO\n     SIGN of the woman.  Then he notices her standing by the window\n     (minus megaphone).  The wind pulls at her black hair.  A\n     distant SIREN O.S.\n\n     He gets up, walks over, stands beside her, looks out at the\n     dark city.  She ignores him, goes back to the couch, turns on a\n     table-lamp, puts her hands before the lit bulb, casts animal\n     shadows on the wall.\n\n     White watches her.  He walks across and sits next to her.  She\n     points to herself.\n\n                         WOMAN  (a whisper)\n               Sachiko.\n\n     He nods slowly, looks at her.  She waits for him to respond\n     with his name.  He shrugs, remains silent.  Then he puts his\n     hands in the light, makes his own animal shadow.\n\n                         WHITE\n               That's me.  I'm a shadow.\n\n     She smiles at the shadows.\n\n                         WHITE\n               Do I look like a murderer to you?\n\n     She just keeps smiling, not understanding.  Kisses him. He\n     notices an old phone on a corner table, removes the note again\n     and rings the same number.  This time, after several rings the\n     call is answered.\n\n                         WOMAN'S VOICE O.S.\n               Yes?...  Who is this?...  Who's\n               there?...\n\n     White remains silent.  Sachiko stands and leaves the room.\n\n                         WOMAN'S VOICE O.S.\n               John?  Is that you?\n\n                         WHITE\n               Who is this?  What do you know about\n               me?\n\n     In the darkness of a doorway Sachiko hesitates momentarily.\n     She slides a hand into White's coat, removes the wallet.  She\n     takes out some cash, puts the wallet back, then she MOVES OFF.\n\n\n     EXT.  STREET  -  NIGHT\n\n     BUMSTEAD pulls up in his car.  Across the street is DOCTOR\n     SCHREBER'S surgery.\n\n     He is about to get out of the car, when the SURGERY DOOR OPENS\n     and A FIGURE steps into the street.  Bumstead watches the\n     shadowy man for a moment.  Then gets out and FOLLOWS, assuming\n     it is Schreber.\n\n     ALLEYWAY\n\n     Bumstead follows inconspicuously.  Without warning, the figure\n     stops and TURNS.  Bumstead backs into a doorway to hide.  He\n     gets a glimpse of the gaunt features of a MYSTERY MAN in the\n     dim light of the alley.\n\n     When Bumstead steps into the alley again there is no sign of\n     the Man  -  like he disappeared into thin air.  A SHADOW\n     crosses the wall beside Bumstead.  He spins, looking around\n     behind him.  Then he looks up into the air.\n\n     HIS P.O.V.\n\n     The shadow of a LEVITATING FIGURE crosses the face of a\n     building.\n\n\n     INT.  APARTMENT BUILDING PASSAGEWAY  -  NIGHT\n\n     SOUND OF A WOMAN SOBBING O.S.  A wet dog sits in a corner\n     gnawing a bone.  A crackly voice recites a list of names from a\n     small speaker-box mounted to a wall.  A TREMBLING FINGER\n     presses a door buzzer.\n\n     SACHIKO, opens the door and looks out.\n\n     ANGLE ON  -  A STRANGE WOMAN in the dark corridor adjusting her\n     hair nervously.  She pushes past the Japanese woman, into the\n     room.\n\n     INSIDE\n\n                         WOMAN\n               John.\n\n     WHITE stands inside the room, looking at the woman,\n     expressionless. The woman suddenly leaps forward, grabs him,\n     kisses him passionately.\n\n     White tries to push her away, but she takes his hand, pulls it\n     inside her dress, makes him touch her breasts.  He pushes\n     harder, she trips on a chair, falls to the floor.  She starts\n     to cry.\n\n\n     EXT.  APARTMENT BUILDING FACADE\n\n     The CAMERA MOVES past flaking bricks  -  to a window.  Behind\n     the glass WHITE and SACHIKO sit across from the WOMAN who\n     attacked White.  She is talking, though nothing can be heard,\n     drying her eyes with a handkerchief.\n\n     INSIDE\n\n     The strange woman looks at White intently between sobs.\n\n                         WOMAN\n               Please believe me.  It's me, John.\n               Your WIFE.  I wouldn't lie to you.\n               You told me I could come and see you\n               -  now you want to just send me away\n               again...\n\n     White looks AT THE FLOOR.\n\n     HIS P.O.V.  -  a crack in the floorboards  -  movement\n     underneath.\n\n                         WHITE\n               I thought it would make more sense.\n               I'm getting the pieces, but when I\n               put it together it feels like...\n               Like you're telling me about somebody\n               else's life...\n\n                         WIFE\n               It's the truth...  I need you.  I\n               know you're innocent.\n\n                         WHITE\n               How do you know I'm innocent?\n\n                         WIFE\n               Of course you are.  You couldn't do\n               those terrible things.  Come home with\n               me  -  maybe things will make sense\n               then...\n\n                         WHITE\n               I can't do that.  It's dangerous.\n               What about my parents?  Do you know\n               where I can find them?\n\n                         WIFE\n               They're dead, John.\n\n     He stands and walks to the window  -  looks out at the city.\n\n                         WIFE\n               You have an uncle.  You were very\n               close.\n\n     She fumbles in her handbag, pulls out a notebook, scribbles\n     something on a piece of paper, hands it to White.\n\n                         WIFE\n               This is where he lives. I'm sure he\n               would like to see you.\n\n                         WHITE (taking paper)\n               Thanks.\n\n                         WIFE (looks at him for a beat)\n               Don't you want me?   My body?\n               Remember how my skin feels?  Touch\n               it.  I...\n\n     She notices Sachiko  -  becomes self-conscious.  Sachiko\n     silently stands and leaves the room.  The wife puts her face in\n     her hands, overcome with tears.\n\n                         WHITE\n               What's your name?\n\n                         WIFE  (looks up  -  still sobbing)\n               Elizabeth.\n\n     White removes the torn fragment of the photograph he has in his\n     wallet, holds the black and white eye up to her face  -  it\n     matches.\n\n                         WHITE  (thoughtful)\n               Yes...\n\n     In the darkness of a doorway Sachiko watches the couple.  She\n     MOVES OFF.\n\n                         ELIZABETH\n               I want to help...\n\n                         WHITE\n               Alright.  Here...\n\n     He pulls the postcard from his wallet, holds it up so the woman\n     can see it.\n\n                         WHITE\n               Know this place?\n\n     She looks at the card.\n\n                         ELIZABETH  (stops crying)\n               Of course.  Your home town  -  where\n               you grew up...\n\n     White stands abruptly, startling the woman.  He glares down at\n     her intensely.\n\n                         WHITE\n               How do I get there?  Tell me.\n\n                         WIFE\n               That's easy.  You...\n\n     She trails off into silence.  Her hand, about to point in a\n     certain direction, freezes in mid-air.\n\n                         ELIZABETH\n               ...strange, I forgot.\n\n     White sits back down quietly.\n\n                         WHITE\n               Yes.  Very strange.\n\n\n     INT.  BATHROOM\n\n     Sachiko locks the door behind her and steps to the middle of\n     the room, lifts a small round rug off the tiled floor.\n\n     Underneath is a TRAP-DOOR.  Opening it, she climbs down a\n     hole.\n\n     UNDER THE FLOOR\n\n     In the semi-darkness she moves to a WOODEN BOX.  She cranks a\n     small metal handle on the box which makes the lid open.  Music\n     plays softly.\n\n     She looks into the yawning black mouth of the box.  A WORM-LIKE\n     apparition threads its way out of the hole, wraps about her\n     thigh.  She breaths deeply, shuts her eyes.\n\n\n     INT.  TENEMENT BUILDING CORRIDOR\n\n     LOW ANGLE TRACKING SHOT  -  feet walk along a tattered rug,\n     approach a door.  Bumstead's shoes, shiny as always.\n\n\n     INT.  TENEMENT ROOM\n\n     A KNOCK ON THE DOOR startles a huddled man in a blanket,\n     sitting before a small t.v. set.  This is THOMPSON  -  the\n     detective with mental problems.  He's unshaven, haunted.\n\n     Clutching a shotgun, he steps to the door, peeks through a spy-\n     hole.\n\n     HIS P.O.V.\n\n     Bumstead, back turned, glancing at his watch.\n\n     Thompson backs away, points his gun at the figure through the\n     door.\n\n                         THOMPSON\n               Go away!\n\n                         BUMSTEAD O.S.\n               Open up, Thompson.  It's me...\n\n     Thompson puts his eye to the door again.\n\n                         THOMPSON\n               Bumstead?\n\n     THROUGH THE SPY-HOLE LENS the inspector turns, looks at us, his\n     face DISTORTED, fish-like.  Thompson undoes four locks, opens\n     the door a crack, but leaves it chained.\n\n                         THOMPSON\n               Can't let you in...  sorry.\n\n                         BUMSTEAD\n               I'm on the serial killer case, need\n               to talk.\n\n                         THOMPSON\n               Not that.  Anything else.\n\n     Thompson wipes at the sweat on his forehead.\n\n                         BUMSTEAD\n               You don't look so well...  C'mon, let\n               me in Thompson.\n\n     Thompson stares at Bumstead, then silently unchains the door\n     and lets him through.\n\n                         THOMPSON\n               I can't talk about that.  As long as\n               you understand, that's all.\n\n     The room is very dark.  Bumstead is assailed by a wave of\n     putrid smells.  It's a mess  -  rotten food, overturned\n     furniture, dirty clothes.\n\n                         THOMPSON\n               Pull up some garbage  -  make\n               yourself at home.\n\n     Thompson smiles weakly.  They sit down, face each other in the\n     gloom.  A RAT scuttles past Thompson.  With lightning reflexes\n     he throws a shoe at it.  The rat runs under a table.  He looks\n     back at Bumstead, smiles, slightly insane.\n\n                         THOMPSON\n               They've taken my mind, my memories...\n\n                         BUMSTEAD\n               What?  Who has?\n\n                         THOMPSON\n               Is that your idea of a joke?  I don't\n               remember...\n                    (looks around)\n               Take my advice, Bumstead.  Get off\n               this case.  Now.\n\n                         BUMSTEAD\n               What is going on?\n\n                         THOMPSON (looks more frightened)\n               Wish I could tell you, Bumstead.\n               Strange business.  I...\n               AAAAAAAHHHHHHHH!\n\n     He screams horribly.  Stands, clutching his head.  Startled,\n     Bumstead falls backwards off his chair.  Thompson, still\n     clutching his head, runs and starts POUNDING HIS FACE against\n     the wall.\n\n                         THOMPSON\n               Get away!  Leave me alone!\n\n     Thompson's head is CHANGING  -  bloating.  It rapidly elongates\n     into a pink fleshy tube.\n\n     Thompson's head continues to grow -  his features are lost\n     beneath folds of skin.  His screaming is stifled.  Thompson\n     falls to the floor.  His head HUGE NOW  -  larger than his\n     body.  Small tendrils sprout from the main appendage.\n\n     Bumstead takes cover behind a sofa.\n\n     Then, as violently as the head began to transform, it stops.\n\n     Bumstead peaks over the sofa at the huge throbbing purple\n     growth sprouting from Thompson's collar.  At the top of the\n     growth an orifice opens.\n\n     An EXPLOSION of green bile spouts into the room  -  covers\n     everything in sight...\n\n     Then the head starts to shrink.  Thompson's features appear\n     again. It returns to normal size.  Thompson groans, sprawled on\n     the floor, clutching his head.\n\n     Bumstead looks on in horror.\n\n                         THOMPSON\n               It's  -  it's disgusting, I know...\n\n     Thompson's face is heavily bruised, covered in sweat.  His nose\n     starts to bleed  -  he wipes it on his sleeve.\n\n                         BUMSTEAD\n               Jesus!  We have to get you to a\n               doctor...\n\n                         THOMPSON\n               No...  No doctor...\n\n     Bumstead stands unsteadily.\n\n                         BUMSTEAD\n               But...  How long has this been\n               happening?\n\n                         THOMPSON\n               A few days...  a few weeks  -  dunno,\n               I can't remember.\n                    (stands slowly)\n               Worse thing is, I never know if it\n               will change back again...  Now,\n               please leave me alone.\n\n\n     INT.  APARTMENT  -  NIGHT\n\n     WHITE, ELIZABETH and SACHIKO sit around a small table, eating\n     quietly.\n\n     Without warning, Elizabeth starts to cry again.  White tries to\n     ignore her. Sachiko looks sadly at the wife, puts a hand on her\n     shoulder, gives her a handkerchief.  The woman quietens down.\n\n     They resume eating but in no time Elizabeth again bursts into\n     tears.  White looks at her now.\n\n                         ELIZABETH  (through sobs)\n               Sorry...\n\n     Sachiko leans across and puts her arm around Elizabeth, helps\n     her to her feet.  Elizabeth hangs onto the woman as she is led\n     from the room.  White can hear the sobbing still, as the women\n     move through to the bedroom.\n\n\n     INT.  BEDROOM\n\n     They sit on the edge of the bed  -  Sachiko holds Elizabeth's\n     hand, smiles at her.\n\n                         ELIZABETH (calmer now)\n               I'm sorry...  This is embarrassing  -\n               my husband doesn't know who I am...\n\n     With this, she starts to cry again.\n\n     Sachiko leans forward and tenderly kisses Elizabeth's lips.\n\n\n     INT.  DARK CHAMBER  -  NIGHT\n\n     TIGHT ON TWO MYSTERY MEN speaking in whispers.  The Men\n     continue talking as THE CAMERA RISES, through several levels of\n     concrete and machinery TO REVEAL:\n\n\n     EXT.  ROOF-TOP  -  NIGHT\n\n     OTHER MYSTERY MEN are rigging a wire to some kind of antenna\n     device.\n\n     BACK DOWN IN THE DARK CHAMBER\n\n     The group of MYSTERY MEN have gathered once again.  One\n     addresses them all.\n\n                         MYSTERY MAN\n               The line of junction between two\n               edges!\n\n                         MEN  (unison)\n               YES!\n\n                         MYSTERY MAN\n               We have located him.  Now is the\n               time, yes.\n\n     A switch is thrown.  Electricity sparks to life.  A hum is in\n     the air.\n\n                         MYSTERY MAN\n               Let the tuning commence!\n\n     The congregation of MEN place ELECTRODES to their foreheads in\n     a trance-like manner.  They chant, quietly at first, steadily\n     building in volume.  The MEN stand and MOVE RHYTHMICALLY to\n     some inner beat.\n\n     The CAMERA MOVES ACROSS to a diagram pinned on a board.  A\n     representation of a man's legs.  Trousers rolled up above the\n     knees, showing a number of bite-like wounds on the flesh.\n     Labels point out various parts of the legs in medical fashion\n     -  the legends are an unknown language.\n\n     ON THE ROOF\n\n     The antenna glows with a ghostly green light.  O.S. SCREAMS\n     RISE UP FROM THE STREET.\n\n\n     INT.  APARTMENT/KITCHEN  -  LATER\n\n     White downs a cup of black coffee, staring blankly out the\n     window.  O.S. distant screams.\n\n     He glances across to a wall, notices A FLY there  -  something\n     about it looks WRONG.\n\n     FLY'S P.O.V.\n\n     A distorted electronic image of White's FACE looming up.\n\n     At exactly that moment the FLY TAKES OFF, flies erratically\n     down the hall, around a turn and disappears.  White follows.\n\n     HALL-WAY\n\n     White moves quietly towards the bedroom door.\n\n     HIS P.O.V.\n\n     It is ajar, dark inside.  Movement.  The women are naked on the\n     bed.  The JAPANESE WOMAN has her eyes shut, head back in\n     ecstasy. The WIFE is bent over her, kissing her stomach.\n\n     ANGLE ON WHITE  -  watching through the crack in the door.  The\n     women are oblivious.\n\n     He moves away slowly, feeling strange.  His feet stop making\n     contact with the floor.  He grabs a table to steady himself.\n     The table-cloth comes away, things spill to the floor and\n     smash. He's FLOATING.\n\n     White desperately reaches out to grab something, holds the\n     light-fixture in the ceiling.  It breaks off in a cloud of\n     plaster.  Sparks briefly illuminate.  He falls heavily ONTO THE\n     CEILING  -  now the floor.  The apartment is upside down.\n\n     He stares up at furniture and objects.\n\n     THE BATHROOM\n\n     White steps into the room, eerily illuminated by a glowing\n     heater stuck to the floor.  Water is running  -  filling the\n     tub and overflowing, making a suspended puddle above White's\n     head.\n\n     White takes off his clothes and climbs the wall, towards the\n     floor.  It's difficult, but he reaches the tap, turns it off.\n     Pulls himself towards the tub.\n\n     Gravity becomes NORMAL AGAIN as he sinks in the warm water.\n     He's incredibly weak  -  floats limply in the bath.  Submerges\n     his face.  A distant throbbing O.S., like a huge machine heart\n     somewhere in the building.\n\n     He opens his eyes, still underwater, stares up at the ceiling.\n\n     HIS P.O.V.\n\n     A blurry DARK FIGURE moves into his vision.  It stares down at\n     him.\n\n     White rigid with fright, cannot focus on the figure through the\n     thin veil of water.  The FIGURE reaches out.  A GLOVED HAND\n     grabs White about the throat, holds him forcefully.  White\n     gulps for air, swallows water.  His eyes widen.  He tries to\n     stop the hand strangling him but can't.\n\n     Suddenly the hand pulls away.  The BLURRY FIGURE stumbles back\n     and ERUPTS into bloody explosion.  The body splits apart,\n     throwing internal organs through the room.\n\n     White awakens in the bathtub.  He looks about the room.  Empty.\n     Silent.  He gets out of the water, starts to dress.\n\n\n     EXT.  BUILDING\n\n     BUMSTEAD'S car pulls up.  He gets out, stained here and there\n     with bile.\n\n\n     INT.  APARTMENT\n\n     A HIGH ANGLE on the slain bodies of the JAPANESE WOMAN and\n     WHITE'S WIFE.  TWO COPS wander about the dark room, doing\n     stuff.  Bumstead walks up to the cop in charge.\n\n                         COP\n               All the same entry wounds.  It's\n               definitely him.\n                    (indicates Sachiko's\n                    corpse)\n               She lives...  lived here.  A\n               prostitute.\n\n                         BUMSTEAD\n               The other one?\n\n                         COP\n               His wife.\n\n                         BUMSTEAD\n               Jesus.  Small world.\n                    (looks around)\n               Where's the photographer?\n\n                         COP\n               No one available.\n\n     A third YOUNG COP steps up to the cop in charge, glancing at\n     the bile on Bumstead's suit.\n\n                         YOUNG COP\n               They won't come out.\n\n                         COP\n               We'll interrogate them anyway.\n\n     The cop leads Bumstead behind a WOODEN PARTITION.  A small area\n     neatly arranged  -  a double bed, various possessions.  Someone\n     obviously lives here.  The room is empty however.\n\n                         COP\n               This is the family of the victim  -\n               apparently they were in the apartment\n               when he committed...\n\n                         BUMSTEAD  (looks around empty room)\n               What are you talking about?\n\n                         COP\n               Oh, yes...\n\n     He walks to THE BED, bends over and lifts the bed-spread.  In\n     the shadows underneath, Bumstead can make out SEVERAL FACES.  A\n     man, an old woman, three or four children.\n\n                         COP\n               They don't speak English...\n\n                         BUMSTEAD\n               How will we interrogate them?\n\n                         COP\n               Well, sir...  I don't know exactly.\n\n     Under the bed, Bumstead can see a LITTLE GIRL.  He walks over\n     to her.  She puts a hand over her mouth, edges away.\n\n                         BUMSTEAD\n               It's alright.  I won't hurt you.\n\n     Without coming out from under the bed she hands the inspector a\n     crumpled paper.  He looks at it then glances over his shoulder.\n\n     HIS P.O.V.\n\n     The wooden room divider.  The CAMERA MOVES IN steadily, into a\n     crack running along the length of the divider  -  we can see\n     the room on the other side, with the cops moving about.\n\n     Bumstead looks back at the page he holds in his hands.\n\n     HIS P.O.V.\n\n     A child-like DRAWING.  Two men, stick figures, dressed in\n     black, with impossibly big knifes, slash at two screaming\n     women.\n\n     Unmistakable  -  MYSTERY MEN.\n\n\n     INT.  DARK CHAMBER  -  NIGHT\n\n     DOCTOR SCHREBER walks stiffly into the room and sits at the\n     head of a boardroom table.  He's cold, pulls his coat up about\n     his neck.  The long table is lined on both sides with immobile\n     MYSTERY MEN.\n\n     A DARK FIGURE walks into the room, steps up to the other end of\n     the table.  This is the enigmatic MISTER BLACK  -  only ever\n     seen hidden in shadow.\n\n                         MISTER BLACK  (addressing Men)\n               Gentlemen.\n                    (peers at Schreber)\n               Doctor.\n\n     He sits, dark and mysterious.\n\n                         MISTER BLACK\n               I have called this meeting for a\n               purpose, yes?\n                    (turns to Schreber)\n               It is clear to you we are  -\n               unhappy, yes?\n\n                         SCHREBER\n               Yes, of course.  I...\n\n                         MISTER BLACK\n               The tuning failed  -  when our agents\n               arrived he was gone.  He knows things\n               -  predicts things.  Explain to us,\n               Doctor.  Why is the situation this\n               way?  Yes?\n\n     Schreber seems distinctly uncomfortable.\n\n                         SCHREBER\n               I'm not certain I fully understand\n               myself...\n\n                         MISTER BLACK\n               No excuses, dearest Doctor!  Answers.\n               Yes?\n\n                         MYSTERY MEN  (chant in unison)\n               Answers!  Answers!\n\n                         MISTER BLACK\n               You said this would be containable!\n               Nothing works this time.  Why is this\n               so?\n\n                         MYSTERY MEN\n               Why!  Why!\n\n                         SCHREBER\n               I  -  ah  -  I...  it's a little cold\n               in here don't you think?\n\n                         MISTER BLACK\n               We must find him.  This is your\n               responsibility.\n\n                         SCHREBER (thinking fast)\n               Yes, of course...\n\n\n     INT.  INSPECTOR'S OFFICE\n\n     Bumstead once again scratches his head in front of a map.  The\n     little girl's drawing is pinned to his board.  His attention\n     wanders.  He notices a FLY CRAWLING across the wall in front of\n     his face.  He leans closer, studying it.\n\n     The intercom crackles to life.  The insect flies off.\n\n                         MISS CRENSHAW  (through intercom)\n               A call, sir.\n\n                         BUMSTEAD\n               Who is it?\n\n                         MISS CRENSHAW\n               Won't say.  Says he must talk to you.\n\n                         BUMSTEAD\n               Put it through...\n\n     A light flashes.  Bumstead picks up.\n\n                         BUMSTEAD\n               This is Bumstead.  Who is this?\n\n     He listens intently.\n\n\n     INT.  BUMSTEAD'S OFFICE\n\n     BUMSTEAD enters.  He looks nervous.  His SECRETARY sits at her\n     desk in an adjoining office, filing her nails.\n\n                         BUMSTEAD\n               I need everything on the Jonathan\n               White case.\n\n                         MISS CRENSHAW\n               Yes, sir.  Everything?\n\n                         BUMSTEAD\n               All the important stuff.  Wrap it up\n               for me.\n\n     The inspector turns to face her, a little manic. She is staring\n     at him.\n\n                         BUMSTEAD\n               Please  -  I'm in a hurry.\n\n                         MISS CRENSHAW (evenly)\n               Certainly.\n\n\n     EXT.  POLICE STATION\n\n     BUMSTEAD steps from the doorway and walks across to his car\n     briskly.\n\n\n     INT.  BATH-HOUSE\n\n     Bumstead moves down a long corridor full of people in towels\n     and swimming outfits, waiting silently.  They sit lined by a\n     wall, staring into space.\n\n     Bumstead walks into a larger tiled room, full of steam.  He\n     walks beside a heated pool  -  naked people swim about weakly\n     or sit on the edge washing themselves.  He steps up to A FULLY\n     DRESSED MAN, sitting silently on a bench.  It is WHITE.\n\n     A feint smile brushes across White's lips as he looks up at the\n     inspector.  He looks away, like he's forgotten something.\n     Stands, walks over to the pool, cups his hand, bends down,\n     scoops some water.\n\n     Bumstead sees White has picked up the LITTLE SILVER FISH.\n\n                         BUMSTEAD\n               Why give yourself up?\n\n                         WHITE\n               I  -  ah - couldn't think of\n               anything else to do.  I thought maybe\n               you know something...\n                    (beat)\n               I'm scared.\n\n                         BUMSTEAD\n               That was a pretty good escape act at\n               the station.  How did you do that?\n\n                         WHITE\n               I woke up in a subway.  I don't know\n               how I got there.\n\n                         BUMSTEAD  (not convinced)\n               Uh-huh.\n                    (pauses)\n               What are you scared of?\n\n                         WHITE\n               People...  after me.\n\n                         BUMSTEAD\n               Who?\n\n                         WHITE\n               I don't know who they are.\n\n                         BUMSTEAD\n               Why are they after you?\n\n                         WHITE\n               Don't know that either.\n\n                         BUMSTEAD\n               Don't know much, do you?\n\n\n     INT.  LABORATORY  -  NIGHT\n\n     Metal scraping.\n\n     PIANO ACCORDION MUSIC wafts on a breeze, someone breathing.\n\n     HIGH ANGLE  -  Down through an OPENING metal hatch.  A dim\n     laboratory IS REVEALED  -  a maze of scientific instruments.\n     Elongated shadows move about.\n\n     MYSTERY MEN are hunched over something.  Behind them a\n     diagrammatic chart of the evolution of the human brain.\n\n     MAN 1 bends across to a CONTROL PANEL, works a switch.  A small\n     speaker in a metal box crackles to life.  SOUND OF DISTANT\n     SURF.  A WOMAN'S VOICE:\n\n                         VOICE\n               What is your name...  What is your\n               name...\n\n     Wires lead from the metal box to a HUMAN BRAIN within a\n     metallic container.  Electricity arches across electrodes.\n\n     More sounds from the speaker:  WATER BUBBLING.  HIGH HEELS WALK\n     DOWN STAIRS.  BED-SPRINGS.  LOVERS MOAN PASSIONATELY.\n\n     MAN 2 steps forward and pulls a bloodied sheet from their\n     handiwork.\n\n     A PUPPET-LIKE CREATURE is revealed.  Small  -  two and half\n     feet tall.  The top of its head an open hatch containing the\n     BRAIN.  Wires lead to this.\n\n     TIGHT ON PUPPET'S EYES  -  They glance about the room. Its body\n     is a series of geometric shapes and polished surfaces.\n\n     MAN 1 shines a torch into the puppet's eyes.\n\n     INSIDE ITS HEAD\n\n     Gears turn, illuminated by the beam of the light.  The gears\n     part slowly to reveal a small writhing INSECT screwed to a\n     metal plate.\n\n     MAN 2 shows the puppet PHOTOGRAPHS:  WHITE as he looks\n     currently, shots of him as a teenager, a young boy, a baby.\n     Photos of what we realise are his parents, standing on a\n     seaside pier sirtiling and waving.  Where he went to school.  A\n     red push-bike he owned as a boy.  His first sweetheart.  Then a\n     photo of a young woman smiling  -  his WIFE.\n\n     MAN 3 holds up a small sea shell to the mechanical ear of the\n     puppet creature  -  MORE SOUNDS OF SURF...\n\n     A FIGURE clutching a wooden cane looks on from the shadows.\n     His pale hand fondles the ornate handle of his cane  -  a\n     carved silver insect.  It's MISTER BLACK.  Man 3 steps up to\n     him.\n\n                         MISTER BLACK\n               You have duplicated the personality,\n               yes.\n\n                         MAN 3\n               It is ready.  The Doctor was most\n               helpful.\n\n     Mister Black turns towards the OTHER MEN.\n\n                         MISTER BLACK\n               I hear a clock in my head, and I like\n               it!\n\n                         MEN  (respond in unison)\n               We hear clocks in our heads, and we\n               like it!\n\n                         MISTER BLACK\n               A world in our likeness!\n\n                         MEN\n               A world in our likeness!\n\n     The Men close the hatch in the top of the puppet's head.\n     SQUEAK...  CLUNK!  The puppet tests out its MANY WEAPONS, a\n     series of nasty-looking blades snap out of its small body, then\n     retract.\n\n\n     INT.  INSPECTOR'S APARTMENT\n\n     Bumstead leads White through the front door, into a SITTING\n     ROOM.  Everything is extremely neat and organized, plastic\n     coverings on all the furniture.  White steps towards a sofa.\n\n                         BUMSTEAD\n               Please.  Not that way.  If you could\n               just follow the covering  -  the\n               carpet gets stained and it's\n               impossible to clean.\n\n     White stops. Bumstead indicates a CLEAR PLASTIC MAT running\n     through the room.\n\n                         BUMSTEAD\n               Everything the department knows about\n               John White is in this.  Here.\n                    (hands file)\n               Excuse me for a moment.\n\n     White flips through it.  Details of White's history.\n\n     IN THE BEDROOM\n\n     Bumstead removes an empty suitcase from a closet.  Begins to\n     place neatly folded clothes within it.\n\n                         BUMSTEAD (calling to White)\n               Age thirty one.  Brown hair.  Green\n               eyes.  Five feet, ten and a half\n               inches tall.  Until recently worked\n               for a firm manufacturing scientific\n               equipment.  Wife's name  -  Elizabeth.\n               Father and mother  -  Harold and\n               Edith.  Both dead.  A history of\n               mental instability...  etcetera,\n               etcetera.\n\n     Bumstead walks back into the sitting room, packed bag in hand.\n     He looks at White leafing through the file.\n\n                         BUMSTEAD\n               That stuff helpful?\n\n                         WHITE  (disappointed)\n               I suppose...\n                    (looks up)\n               Why are you helping me?\n\n                         BUMSTEAD\n               You're case has been driving me\n               crazy.  You see, I pride myself on\n               being thorough.  There's too many\n               loose ends with your case.\n                    (a beat)\n               Thought it was best you were hidden\n               until we understand more about the\n               facts.  What do you know about these\n               men in black?\n\n     White looks up, pauses as if he didn't understand Bumstead,\n     then:\n\n                         WHITE\n               If you shoot them here...\n                    (points at his\n                    forehead)\n               you can kill them.  They're not\n               people  -  like us  -  got insects in\n               their heads...  Got any disinfectant?\n\n     The inspector is caught off-guard by the question.\n\n                         WHITE  (continues)\n               It's my legs.  Been bitten.  Giving\n               me trouble.\n\n     Bumstead walks silently to the bathroom, opens a medicine\n     cabinet.\n\n                         BUMSTEAD  (to himself)\n               Insects?\n\n     He returns clutching a small bottle and some cotton wool.\n\n                         BUMSTEAD\n               Here.\n                    (hands things to\n                    White)\n               Careful with your trousers.  That\n               stuff stains.\n\n     The inspector gives white back his revolver and his wallet.\n\n                         BUMSTEAD\n               Here.\n\n     Bumstead paces thoughtfully, careful to stay on the plastic\n     protective covering.  He turns, glares at White, who dabs his\n     legs with the cotton wool.\n\n                         BUMSTEAD\n               Any idea what part the Doctor plays\n               in this business?\n\n     White shakes head.\n\n                         BUMSTEAD\n               Let's try and find out, shall we.\n                    (points at White's\n                    shoe)\n               Lace is untied.\n\n     White looks down.  Bumstead doesn't lie.\n\n\n     INT.  DRUG STORE  -  NIGHT\n\n     The BARBER is shaving under the armpit of a client.  GRANDPA\n     snores in a corner, his feet buried under a pile of hair\n     clippings..\n\n     The BELL hanging above the door rings.  The door swings open.\n\n                         BARBER\n               He with you shortly, sir...\n\n     Several heads turn, THEN LOOK DOWN to see the PUPPET.  The\n     puppet wheels forward and stops.\n\n                         BARBER (not really looking)\n               Hello, sonny.  Cute outfit.  Mother\n               get it for you?\n\n     The puppet crosses the room threateningly.  TWO OTHER CLIENTS\n     look up startled from their newspapers and girly magazines.\n\n     ON THE PUPPET  -  it wheels up to the barber's leg and GRABS HIS\n     TROUSER with a mechanical claw.  The puppet holds out a PHOTO\n     OF White.\n\n                         PUPPET (incoherent obscenities)\n               EEEEEEEEK...  AHHHHHHH!...\n               SHHHHIIIITTTT!...  FUUUUCKER!!\n\n                         BARBER (looks down, scared now)\n               Huh?\n\n     He's grabbed and THROWN into a nearby chair.  The puppet leaps\n     onto the bench in front of him  -  he's frightened, so are the\n     customers.\n\n     Puppet wheels up and down on the bench in front of the\n     customers  -  stopping to glance at individuals in a threatening\n     manner, holding out the photo of white.\n\n     It leans forward, spinning its blades  -  HAIR FLIES.  Screams\n     o.s.\n\n     The PUPPET retracts its weapons  -  COVERED in blood.  It\n     wheels forward, through the door and into the street.\n\n     THE CAMERA PANS to reveal a scene of complete carnage.  Blood\n     covers the walls.  FOUR BODIES slumped about the room.  Each has\n     an outlandish hairstyle.\n\n\n     INT.  BUMSTEAD'S CAR\n\n     White looks at the inspector  -  street lights pass over his\n     features.  Bumstead stares at the road.\n\n                         BUMSTEAD\n               I didn't tell you the entire reason I\n               helped you.  It started with two\n               little girls.  Twins.  Used to play\n               with them when I was young.  Couldn't\n               remember for the life of me what they\n               looked like, then I understood why...\n\n     He looks at the dashboard, brushes away a small piece of lint.\n\n                         BUMSTEAD\n               They didn't have faces.\n\n                         WHITE\n               What?\n\n                         BUMSTEAD\n               That's right.  Just seamless flesh\n               across the front of their heads.  No\n               mistake.  I just hadn't remembered it\n               that way.  Up until then they had\n               been normal little girls in my\n               memory.\n                    (looks back at White)\n               That's not all.  Once I started\n               examining them, all sorts of things\n               about my life, had...\n               inconsistencies.  It was like a game.\n               I would think about a person or a\n               place, or an event.  Then I would\n               turn the lights off.  Sit down in a\n               comfortable chair...  And study each\n               detail of this subject.\n\n     He glances at White, then back to the road.\n\n                         BUMSTEAD\n               Everything was liquid beneath a thin\n               surface that had always seemed solid\n               to me...\n\n     Bumstead and White are quiet momentarily, then:\n\n                         BUMSTEAD\n               Is there anything you haven't told me\n               about this business?  Even the most\n               insignificant thing?\n\n                         WHITE (thinking)\n               No.  Nothing I can think of.\n               Except...\n\n                         BUMSTEAD\n               Go on.\n\n                         WHITE\n               Well.  The only thing I've been\n               certain of, all this time, is that I\n               need to get to the ocean.  The point\n               is no one seems to know how to get\n               there.\n\n                         BUMSTEAD\n               Why, that's ridiculous.  You just...\n\n     He trails off.  Shakes his head slowly.\n\n                         BUMSTEAD\n               We'll get to the bottom of this.  I\n               mean it.\n\n\n     INT.  SCHREBER'S SURGERY\n\n     The doctor is sitting at his desk, when the door bursts open\n     suddenly.  White and Bumstead move into the room and grab the\n     doctor before he can protest.\n\n                         BUMSTEAD\n               I met a friend of yours the other\n               night, doctor.  Tall fellow.  No\n               hair.  Rather pale skin...\n\n                         SCHREBER\n               I don't know what you're talking\n               about.\n\n                         BUMSTEAD\n               That's surprising.  He was leaving\n               your office at the time...\n\n                         SCHREBER\n               You are mistaken.\n\n                         WHITE\n               What are you hiding?\n\n                         SCHREBER\n               Nothing.  I don't know anything!\n\n     BUMSTEAD removes his revolver, sticks it in the doctor's face.\n\n                         SCHREBER\n               Please, they'll kill me...\n\n                         BUMSTEAD\n               I think it's time you introduced us\n               to your little friends.\n\n\n     EXT.  ALLEY  -  NIGHT\n\n     SCHREBER, BUMSTEAD AND WHITE sit in Bumstead's car in an\n     alleyway.\n\n     Schreber points to a SOLITARY METAL DOOR in a wall.\n\n                         SCHREBER\n               In there.\n\n                         BUMSTEAD\n               Just like that?\n\n     The threesome step from the car, keep close to a wall.\n\n     Schreber alone steps up to the door, leans down to a mat at the\n     foot of the door, lifts it and takes a KEY from underneath.  He\n     unlocks the door, opens it, puts the key back, goes inside.  He\n     waves the other men forward.\n\n     White and Bumstead step up to the door  -  Bumstead looks at the\n     mat  -  it says:  WELCOME on it.\n\n     A CORRIDOR\n\n     Through the door  -  AN ELEVATOR.  There is only a down button.\n     Schreber presses it, several seconds later the doors open.\n\n     They step inside.  The doors close, the lift descends.\n\n                         BUMSTEAD\n               What is this place?\n\n                         SCHREBER\n               You wouldn't believe me if I told\n               you, Inspector.  Have patience  -\n               you'll see for yourself.\n\n     When the doors open again the three men look out on a DARK\n     PASSAGEWAY.\n\n\n     EXT.  LIBRARY  -  NIGHT\n\n     The PUPPET wheels up to the sweeping set of stairs at the base\n     of the building.  It stops, WHEELS BUMP into the steps\n     repeatedly.  It looks down and shrieks with a string of\n     mechanical obscenities.\n\n\n     INT.  MYSTERY MEN'S UNDERWORLD\n\n     WHITE and BUMSTEAD follow SCHREBER down a corridor to what\n     appears to be an ancient crypt.  They enter a door  -  it has\n     something written on it in a strange language.\n\n     INSIDE IS A ROOM\n\n     They stumble around in the darkness, Schreber finds a light\n     switch, suddenly White STOPS dead in his tracks  -  Bumstead\n     turns to him.\n\n                         WHITE\n               Look.\n\n     White points to a wall featuring a line of brass hooks.  On\n     these hooks hang MYSTERY MEN coats -  that's not all.  Each hook\n     carries A FACE.\n\n     Bumstead and White step closer, look at the faces.  They seem to\n     be elaborate, very life-like MASKS.\n\n                         SCHREBER\n               Put them on.\n\n     White and the inspector look at each other, incredulous.\n\n     OUTSIDE  -  THE CORRIDOR\n\n     The door opens.  White, Bumstead and Schreber step out, wearing\n     poorly fitting masks and coats  -  DISGUISED AS MYSTERY MEN.\n\n     FURTHER ALONG THE CORRIDOR\n\n     The three men come across a small area with a raised platform,\n     between arches.  A number of OPEN CARTS roll past on tracks  -\n     the scene resembles some bizarre amusement-park ride.  The carts\n     are numbered on the side  -  all of them empty.\n\n                         SCHREBER\n               Get in.  Hurry.\n\n     White, Bumstead and Schreber hop aboard.  The cart takes them\n     into a DARK TUNNEL, deeper into the secret underworld of the\n     MYSTERY MEN.  They MOVE THROUGH a subterranean landscape of\n     unexplained contraptions and bones.\n\n                         WHITE\n                    (to Bumstead)\n               Where do you think this goes?\n\n                         BUMSTEAD\n               It sure isn't the fun-fair.\n\n     The cart finally comes to a stop in a cave.  Bumstead, White and\n     Schreber leap out and hide in a dark doorway, as a LONG LINE OF\n     MYSTERY MEN walk past them.\n\n                         SCHREBER\n               Follow me, and do exactly as I do.\n\n     They join the end of the line, falling into step.\n\n\n     INT.  DARK CHAMBER\n\n     The MEN, with WHITE, BUMSTEAD and SCHREBER in tow, enter and\n     sit in a number of rows of wooden chairs.  White and the\n     inspector do the same.\n\n     MORE MYSTERY MEN appear in circular portals high up on the\n     concrete walls.  ONE MAN faces the others at the front of the\n     room.\n\n                         MYSTERY MAN 1\n               Eleven past eleven  -  the Night of the\n               Eye.\n\n     The seated Men start to CHANT.\n\n                         MEN\n               NIGHT OF THE EYE!  NIGHT OF THE EYE!\n\n     A MAN in the front row stands.\n\n                         MAN 2\n               The Eye is too small for the head of\n               the pin!\n\n                         MAN 1\n               Yes!\n\n     ANOTHER MAN stands.  Next to the first, who sits again.\n\n                         MAN 3\n               What is it that floats on the water?\n               The Eye!\n\n                         MAN 1\n               Indeed!\n\n     So it goes around the room, each Man takes his turn announcing\n     part of the strange ritual.  It will be White, Bumstead and\n     Schreber's turn shortly.  White is worried, looks at the\n     others.\n\n                         WHITE (whisper)\n               What do we do?\n\n                         SCHREBER (hisses back)\n               Fake it!\n\n                         BUMSTEAD\n               What?\n\n     SCHREBER is next  -  he stands abruptly.\n\n                         SCHREBER\n               The eye.  Master of time and space!\n\n     Then it's Bumstead's turn.\n\n                         BUMSTEAD\n               The Eye  -  um  -  delicious with\n               horseradish on rye!\n\n     MAN 1 at the front seems confused for a moment  -  SEVERAL of\n     the others turn towards Bumstead.\n\n                         MAN 1 (uncertain)\n               Good.\n\n     The inspector sits back down  -  whispers to White without\n     looking at him.\n\n                         BUMSTEAD\n               Nothing to it...\n\n     White stands.  Hesitates.  Then:\n\n                         WHITE\n               Eye...  eye, captain!\n\n     White sits down, shaking his head, embarrassed.\n\n                         MAN 1\n               Um  -  yes...\n\n     THE MAN NEXT TO WHITE rises up  -  keeps rising, FLOATS IN THE\n     AIR above the Men's heads.\n\n                         MAN 4\n               My spine will bend for the Eye!\n\n     He turns sideways, still floating.\n\n\n     EXT.  ALLEY\n\n     BACK ABOVE GROUND, Bumstead, White and Schreber run from the\n     door at the end of the alley-way, tossing their masks away.\n\n                         BUMSTEAD\n               Was that for real down there?\n\n                         SCHREBER\n               I'm afraid so.\n\n     The inspector stops walking suddenly, grabs White, holds him\n     back.\n\n                         BUMSTEAD\n               What the hell is that?\n\n     At the end of the alley the PUPPET advances menacingly.\n     Schreber takes his chance and runs down an alley and\n     disappears.\n\n                         BUMSTEAD\n               Quick.  My car.\n\n     Fortunately BUMSTEAD'S CAR stands nearby.  The two men leap in,\n     start it up.  Bumstead guns towards the puppet standing in the\n     glare of the headlights.\n\n     The puppet's head opens, a TINY PROPELLER pops out, spins,\n     lifting the puppet into the air.  The car passes beneath it at\n     speed.  Screeches off into a street, races along between tall\n     buildings.\n\n     INSIDE THE CAR\n\n                         WHITE\n               What now?\n\n                         BUMSTEAD\n               This ocean business...  I know where\n               I can find a map.  I need to go back\n               to the station.  Where will you be?\n\n     White thinks for a moment, pulls the paper his wife gave him\n     from his pocket.\n\n                         WHITE\n               I'll go see an uncle of mine.\n                    (reading)\n               Five  -  one  -  eight  -  three  -  double\n               six  -  three...\n\n     Bumstead scribbles on the pad mounted to the dash, battles with\n     the wheel, driving at breakneck speed.\n\n                         BUMSTEAD\n               Good.\n                    (looks in rear\n                    mirror)\n               Uh-oh...\n\n     White turns and looks behind them.\n\n     HIS P.O.V.  -  HEADLIGHTS gaining on them.\n\n     ON THE PUPPET  -  sitting AT THE WHEEL of a stolen car, driving\n     like crazy.\n\n     BACK IN BUMSTEAD'S CAR\n\n     White takes out his gun  -  AIMS at the rapidly approaching\n     car.\n\n                         WHITE  (remembers)\n               It's empty.\n\n                         BUMSTEAD\n               Take mine.\n\n     Bumstead pulls a gun out of his coat.  They swap.\n\n     The puppet PULLS ALONGSIDE, a mechanical arm extends towards\n     Bumstead's front tire.  A SPINNING BLADE extends from the end\n     of the mechanical arm.\n\n                         PUPPET\n               ARRRRRRRRGGGHHHH!...  HA-HA-HA-HA-\n               HA!!\n\n     TIGHT ON THE BLADE heading for the spinning wheel.  White\n     fires.  Shells hit the PUPPET'S car, shattering windows.\n\n     THE BLADE cuts into the tire  -  it pops loudly, goes flat,\n     metal SPARKS off the road.\n\n     White is thrown forward, hits his head on the dash.  Bumstead\n     fights to keep control, SWERVES into the side of the other\n     vehicle, making it scrape a concrete wall, hits garbage cans\n     flying.\n\n     The PUPPET'S car falls behind  -  then swerves off into a side-\n     street and disappears.\n\n                         BUMSTEAD  (looks behind him)\n               Where did it go?\n\n                         WHITE  (looks back also)\n               Don't know.\n\n     Both look FORWARD AGAIN  -  to see the PUPPET'S CAR pull out in\n     front of them, BLOCKING THE WAY.  Bumstead's car is going too\n     fast.  Slams the brakes.\n\n     TIGHT ON PUPPET  -  Screaming with insane joy as Bumstead's car\n     approaches like a bullet.\n\n     INSIDE INSPECTOR'S CAR\n\n                         BUMSTEAD\n               Jump!\n\n     Bumstead rips the phone number from the pad.  The two men LEAP.\n\n     The car continues onwards.\n\n     CRASH!  KA-BOOM!\n\n     In the glow of the flaming wrecks, the two men pick themselves\n     up from different sides of the street.  Look at each other,\n     turn and head in OPPOSITE directions.\n\n     CAMERA MOVES IN on mangled metal  -  a MECHANICAL CLAW starts\n     to pull itself from the wreckage.\n\n\n     EXT.  STREET  -  NIGHT\n\n     White steps up to a SMALL DOOR in the side of a building.  A\n     sign above the door depicts an underwater scene, crammed with\n     fish, sea-weed, bubbles floating to the surface.  Dominating\n     everything is a GREEN MAN with scales  -  a KING NEPTUNE-type.\n\n     INSIDE\n\n     White stops in front of a ticket booth, beside a faded blue\n     curtain.  In the booth a TICKET SELLER is snoring with his mouth\n     hanging open, his head sagging. White knocks on the window.  The\n     man wakes with a start.\n\n                         TICKET SELLER\n               Yeah.  That's what I said!\n                    (looks at White  -\n                    rubs head)\n               What..?\n\n                         WHITE\n               I'm looking for this address.\n\n     The man squints at the card White holds up, nods groggily.\n\n                         TICKET SELLER\n               Upstairs.  Through there.\n\n     He thumbs the blue curtain.  Curls up, shuts his eyes again.\n\n     BEYOND THE CURTAIN\n\n     A dark room full of BUBBLING NOISES AND WATER DRIPPING  -  an\n     aquarium.\n\n     Several corridors meander between large glass panels that look\n     into illuminated tanks of sea creatures.\n\n     White moves past a shadowy doorway.  He can barely make out\n     STAIRS.\n\n\n     INT.  HALL-WAY\n\n     White moves cautiously in the darkness.  On a door a tiny\n     NAMEPLATE says:  K. WHITE.  The door is unlocked.  He opens it\n     and goes in.\n\n     INSIDE\n\n     An entrance hall of an apartment.  A large number of MOUNTED\n     FISH of all sizes line the hall.\n\n     PHOTOS on the wall  -  family portraits.  White examines these,\n     concentrates on one in particular  -  a young boy on a red push-\n     bike, in the background a sign with a faded image of a girl in\n     a bathing suit:  WELCOME TO BLUMBVILLE!  it says.\n\n     A strange WHIRRING NOISE O.S.  White hides behind a sofa.\n     Whatever is making the whirring noise moves past slowly.  White\n     cannot see what it is.\n\n                         VOICE O.S.\n               John?\n\n     White turns to see an OLD MAN in his pyjamas sitting in a\n     WHEELCHAIR.  The man pushes a lever on the side of the chair.  A\n     whir of electric motors.  The chair carries him out of the\n     shadows.  White steps from behind the sofa.\n\n                         MAN\n               Are you alright?  What are you doing\n               here?  Is this one of your jokes,\n               John?  It's been so long, I thought\n               you'd forgotten your uncle Karl?\n\n                         WHITE\n               Uncle...  Karl.\n\n\n     INT.  AIR-CONDITION DUCT\n\n     A P.O.V.  -  MOVING THROUGH a dark, claustrophobic pipe.\n     TWISTING around tight corners, DARTING down straight lengths of\n     ducting.  Dim light spills from wire grills spaced along the\n     walls.\n\n     WE TRAVEL up to one grill, at the end of a long stretch of\n     tunnel  -  stop, nowhere left to go. We can see through the gaps\n     in the wire, looking down into...\n\n     THE ROOM\n\n     White and uncle Karl are having a SLIDE-SHOW.  Shots of a recent\n     vacation  -  the uncle doing a series of mundane things.\n\n                         KARL (chuckling)\n               Not often I get a chance to show\n               these.\n\n     He changes the slide:  an image of him standing against a brick\n     wall.\n\n                         KARL\n               And this is me again about  -  um  -  I\n               would guess about twelve feet further\n               to the right of the last shot.  Now\n               just behind the wall is the hotel I\n               stayed at  -  sweet little place...\n\n     The PHONE RINGS.  Uncle Karl wheels over, picks up the receiver.\n\n                         KARL (talks down the line)\n               Hello...  Yes, he's here...\n                    (holds out the phone\n                    to White)\n               It's for you.\n\n     White concerned  -  takes the phone.\n\n                         WHITE\n               Yes?\n                    (he listens)\n               Oh, it's you...  Yes...  My uncle\n               apparently...  Just looking at some\n               memories...  You have?  That's good.\n\n                                              CUT TO:\n\n     INT.  POLICE STATION  -  NIGHT\n\n     Bumstead talks to White on the phone.  He stands in a dark\n     room, surrounded by charts and maps.\n\n                         BUMSTEAD\n               At first I thought there was no way\n               to get to the ocean...  The buildings\n               are a barrier, no windows, no doors\n               -  everything just, well, ends  -  only\n               thing would be drill a hole.  But\n               then, I saw it, one door, just one...\n               Inside a tenement building...\n\n     Bumstead is interrupted by a NOISE O.S.  He looks to a frosted\n     partition  -  dark figures walk past on the other side.  He\n     quickly sorts through SEVERAL MAPS, making as little noise as\n     he can.\n\n                         BUMSTEAD (whisper)\n               We can meet later  -  but first I\n               have to do something.  Look I got to\n               go...\n\n                                              CUT BACK TO:\n\n     White holds THE PHONE, listens to Bumstead on the other end.\n\n                         WHITE\n               Where can we meet?...  Alright.\n               Good...\n\n     As White hangs up he notices A DOOR behind a big old crockery\n     cupboard.  The cupboard has been pushed up against the wall,\n     hiding the door.\n\n     BACK IN THE POLICE STATION\n\n     BUMSTEAD quickly folds the map and shoves it into his pocket.\n     As he turns and runs from the room we NOTICE A DARK FIGURE\n     standing behind a shelf in the room.\n\n     IN UNCLE KARL'S APARTMENT\n\n     UNCLE KARL continues to change slides  -  the noise echoing\n     about the room.  White moves over and sits down next to him.\n\n                         KARL\n               Look!  This is a good one!\n\n                         WHITE\n               What is that door?\n\n                         KARL\n               Which one?\n\n                         WHITE\n               There.  Behind the cabinet.  Where\n               does it go?\n\n     The uncle watches the slides.\n\n                         KARL\n               Such a joker!  Like your father.\n\n                         WHITE\n               No.  Have a look.\n\n     He leads the old man over to the cabinet.\n\n                         WHITE\n               You see it?\n\n                         KARL\n               Yes.\n\n                         WHITE\n               Where does it lead?\n\n                         KARL\n               It must be a closet or something.\n\n     White pushes at the cabinet.  The old man helps.  They only\n     manage to push several inches  -  it is very heavy.  White\n     decides to just climb over it.  He squeezes through, opens the\n     door and climbs a set of dark stairs.  Uncle Karl watches.\n\n                         KARL\n               Don't trip over.  It's dark up there.\n\n\n     INT.  ATTIC  -  NIGHT\n\n     TIGHT ON a light switch  -  it is flipped.\n\n     AN ATTIC  -  full of books, boxes, discarded possessions.\n     White picks up a book and opens it  -  the pages have been\n     eaten out by a swarm of ROACHES.  He drops it in disgust as the\n     insects scurry over his hands.\n\n     In a small wooden box are several toys he examines with great\n     interest.  At the bottom of the box he finds a SMALL DOG-EARED\n     DRAWING BOOK.  On the cover is a colourful scrawl in child's\n     writing  -  a title:  ANSWERS  -  BY JONATHAN WHITE, AGE NINE.\n\n     White sits down and flips through the book in the dim light.\n     Page after page is filled with neat handwriting and drawings.\n     As he reads segments from the book he seems more and more\n     disturbed.  He flips through faster and faster.\n\n     HIS P.O.V.\n\n     Pages flip past, stopping occasionally.  Glimpses of DIAGRAMS.\n     The MYSTERY MEN and THEIR WORLD.  Cross-sections of the MYSTERY\n     MEN, the cavity in their head with the INSECTS INSIDE clearly\n     illustrated.  EVERYTHING.\n\n     PUSH IN CLOSE on White.  He looks up, STUNNED.\n\n\n     INT.  UNCLE KARL'S APARTMENT\n\n     White emerges from the attic, clutching the small book to his\n     chest, lost in thought.  He steps quietly into a hall-way  -\n     notices the old man putting THE PHONE back on its cradle.\n\n                         KARL\n               John, I didn't see you there.\n\n     A NOISE O.S. White and Uncle Karl turn.  A VENTILATION GRILL\n     falls off a wall, revealing a hole.  EYES shine from the\n     darkness.\n\n     THE PUPPET leaps from the hole.  Its blades unfolding,\n     spinning wildly before it hits the carpet.  It faces the two\n     men.\n\n                         KARL\n               What is that?\n\n                         WHITE (to Karl)\n               Get back!\n\n                         KARL\n               Filthy beast!  Shoo!  Go on!  Shoo!\n\n     He wheels forward, attempting to scare the puppet off.\n\n                         WHITE\n               No!\n\n     The puppet goes for Uncle Karl.  A whirr of metal, BLOOD\n     SPLASHES ACROSS WHITE and the walls.  Uncle Karl SCREAMS\n     horribly.\n\n     White grabs a chair  -  holds it above him.  The puppet turns\n     from the dead man in the wheelchair.  White lets it have it.\n     The chair CRASHES DOWN, splintering into pieces.\n\n     The puppet is dazed, but immediately recovers.  White has a\n     fire-poker now.  As the puppet advances, he swings, connecting\n     with the creature, hurtling it across the room, into a wall.\n     White runs out the door.\n\n     IN THE CORRIDOR\n\n     He leaps into a waiting elevator.  Pushes the top floor button.\n\n     THE ELEVATOR SHAFT  -  The elevator moves upwards.\n\n     INSIDE THE ELEVATOR\n\n     White looks through the circular window in the door.\n\n     HIS P.O.V.  -  Floor after floor SLIDES PAST  -  deserted.  He\n     looks at the floor indicator.  TIGHT ON NUMBERS lighting up:\n     86, 87, 88...\n\n     Then the elevator stops, the doors open, looking down a dark\n     corridor.  The PUPPET is at the end.  It turns to face him,\n     SUDDENLY RACES FORWARD, a horrible high-pitched shriek from its\n     mechanical voice box.\n\n     White STABS the buttons of the elevator frantically, the doors\n     won't close.  The puppet is upon him.  He JUMPS, straight up.\n     It goes under him, CRASHING INTO the back of the elevator.\n     White hits the down button one last time, and leaps out of the\n     compartment AS THE DOORS CLOSE.\n\n     A MECHANICAL extendible arm shoots out and grabs White around\n     the ankle. DRAGS him across floor.  THE PUPPET shrieks wildly\n     again, as...\n\n     ITS ARM  -  is JAMMED in the closing doors now.  Lift descends.\n     The puppet squeals.  The arm SNAPS OFF.\n\n     White stands, pulls dislocated arm off his ankle.  He can hear\n     the elevator descending.  Suddenly it STOPS  -  starts\n     returning to his floor.  White turns and runs again.\n\n     The lift doors BURST OPEN  -  the ENRAGED CREATURE emerges and\n     races after him.\n\n     He tears around a corner  -  finds himself in a dead-end.\n     Nowhere to go.  He can hear the puppet approaching along the\n     corridor.  Suddenly he notice A GRILL on a wall ABOVE HIS HEAD.\n     He pulls it off, climbs into an incredibly tight pipe.  Crawls\n     frantically.\n\n     He sees a LIGHT ahead.  An opening.  He kicks the grill off.  A\n     sudden gust of wind.\n\n     HIS P.O.V.\n\n     The pipe leads to the outside of the building  -  nowhere to go\n     except a hundred stories STRAIGHT DOWN.  He screams, almost\n     falls.  Turns to start crawling back.\n\n     Suddenly the end of the pipe fills with WHIRRING METAL BLADES.\n     The puppet has followed him in and is advancing.\n\n     No choice  -  he looks out the hole.  SEES A PIPE on the\n     outside of the building, running vertically near the opening.\n     It looks impossible but it's his only chance.\n\n     He climbs out, balancing himself on the lip of the opening,\n     REACHES for the pipe.  The puppet is almost upon him.  He\n     swings across, gets a HAND on the pipe.  He slips, DANGLES  -\n     holding on  -  one hand on the pipe, one on the edge of the hole.\n     The pipe is greasy, slippery, can't grip it.\n\n     SUDDENLY he hears a MECHANICAL CLICKING  -  TURNS to see the\n     puppet standing on the edge of the hole, inches from his hand.\n     A soft noise reverberates in its voice box  -  a mechanical\n     giggle?  A circular blade on one of its arms starts up, moves\n     down onto White's HAND.\n\n     TIGHT ON HIS EYES  -  sweat beads and runs down his forehead.\n\n     TIGHT ON THE BLADE  -  as it cuts into flesh.  BLOOD spatters\n     White's face as he grimaces with intense pain.  He can't hold\n     on.\n\n     HE FALLS, plummets through space.  Screaming.\n\n\n     INT.  HOSPITAL  -  NIGHT\n\n     A GROUP OF SURGEONS stand about BUMSTEAD'S MOTHER on her life-\n     support machinery.  The surgeons have face-masks on and are in\n     deep shadow.  The woman stares blankly, still in a coma.\n\n     IN THE RECEPTION AREA\n\n     BUMSTEAD looks up from his wristwatch.\n\n                         BUMSTEAD\n               I can't wait any longer...\n\n     He is standing in front of the MALE NURSE in the glassed-in\n     counter.\n\n                         NURSE\n               I'm sorry.  I told you, she is being\n               examined...\n\n     He turns and storms off down the corridor.  The NURSE stands,\n     shouting after him.\n\n                         NURSE\n               Mister Bumstead!\n\n     INSIDE MOTHER'S ROOM\n\n     One of the \"doctors\" leans down and grabs a handful of WIRES\n     leading out of a box beside the woman.\n\n                         SURGEON\n               We will teach the pig to meddle in\n               our affairs.  Yes.\n\n     He pulls the wires out in a burst of electrical sparks  -  ALL\n     THE MACHINES DIE.  The woman comes to life momentarily, starts\n     to claw at the glass shield in front of her face, like she is\n     suffocating.  The life drains from her weak body and she is\n     STILL.\n\n     ANGLE ON THE DOOR  -  it bursts open.  Bumstead is standing\n     there.  The masked surgeons are startled, they turn rapidly to\n     face him.\n\n                         BUMSTEAD (steps forward)\n               What is happening?\n\n                         SURGEON\n               Ah, Inspector Bumstead!  We are glad\n               you are here  -  I'm afraid we have\n               done all we can.  Yes.  Your Mother\n               has passed.  Yes.\n\n     Bumstead turns towards his mother.\n\n                         BUMSTEAD\n               But she was getting better...\n\n                         SURGEON\n               We are sorry.  The cancer  -  it was\n               fatal.\n\n     Bumstead turns to the men, confusion in his eyes.\n\n                         BUMSTEAD\n               She doesn't have cancer.\n\n     The men glance at each other for a moment, then back at the\n     inspector.\n\n                         SURGEON\n               We knew that.  Yes.\n                    (the other men nod)\n               Anyway  -  she is dead.\n\n     Bumstead leaps forward, RIPS OFF one of the surgeon's masks.\n\n     ANGLE ON THE MAN  -  He turns to look at Bumstead, pale skin,\n     staring eyes, a MYSTERY MAN.  TWO OTHER MEN grab him from\n     behind.\n\n                         BUMSTEAD (struggles)\n               I'll kill you all!\n\n     One of the Mystery Men steps up to the struggling inspector,\n     places the palm of his hand across Bumstead's eyes.\n\n                         MYSTERY MAN\n               You will obey us, yes.  In your mind\n               there is a dark space...\n\n     TIGHT ANGLE\n\n     Bumstead's hand reaches out, fumbles at a tray of surgical\n     implements, grabs a SCALPEL.\n\n     WIDER\n\n     He cuts into the hand of one of the Men holding him, SPINS AND\n     DRIVES the scalpel into the forehead of the Mystery Man\n     attempting to hypnotise him.\n\n     The other Men leap towards him.\n\n\n     EXT.  CANAL  -  NIGHT\n\n     TIGHT ON WHITE'S FACE\n\n     His eyes are shut tight.  He opens them, slowly LOOKS AROUND,\n     curious why he isn't dead.\n\n     WIDER ANGLE\n\n     White floats in MID-AIR, hovering ten feet or so above a dark\n     body of water.  He looks amazed.  Shuts his eyes, rubs them,\n     opens them again.  Still floating.\n\n     He clenches his fists and TENSES his body.  Slowly he starts to\n     MOVE FORWARD, hovering at an even height over the water.\n\n     WIDER STILL\n\n     SEVERAL ANGLES feature the figure of White levitating across\n     the harbour, past half-sunken buildings and rusted ships.\n\n     TIGHT ON WHITE  -  He comes to a stop.  Smiles in amazement.\n     Then he suddenly plummets into the water, like a trap-door has\n     opened beneath him.\n\n     ANGLE ON BUBBLES floating to the surface.  White's FACE rises\n     slowly out of the water.\n\n     WIDER  -  CITY SKYLINE\n\n     A SMALL OBJECT floats towards the ground at the end of a tiny\n     white parachute.\n\n     BACK ON WHITE\n\n     He swims across to a small boat, climbs aboard, pushes himself\n     silently through the still canals of the city.\n\n\n     EXT.  HARBOUR\n\n     Oil tankers move silently through inky water.\n\n     White paddles the boat to the bottom of A PIER, climbs a rotten\n     ladder.  He runs off into the shadows.\n\n     BACK IN THE WATER\n\n     The PUPPET cuts through the waves, pushed along by a rear\n     propeller.  It reaches the pier, climbs to the top.  The prop\n     retracts, and the creature wheels forward slowly, onto a\n     concrete surface.  It looks around  -  it knows White is there\n     somewhere.\n\n     PUPPET'S P.O.V.\n\n     A trail of WET FOOTPRINTS on the ground.  It follows them, is\n     led to a crane cabin.\n\n     INSIDE THE CRANE'S CABIN  -  is White, a lunatic grin on his\n     face, at the controls.\n\n     A NOISE O.S. startles the puppet.  It looks up.\n\n     PUPPET'S P.O.V.\n\n     Follows the crane up into the air.  The crane is swinging around\n     against the dark sky.  A HUGE METAL CONTAINER dangles, stops\n     above the puppet.\n\n     ON WHITE\n\n                         WHITE\n               Nice knowing you.\n\n     TIGHT ON WHITE'S HAND  -  It pulls a lever.\n\n     THE CONTAINER  -  Shakes and starts to fall.\n\n     THE PUPPET  -  Screams up at the plummeting container.\n\n     WIDER\n\n     The container crashes into the ground, crushing the creature.\n\n     Silence.  Dust floats in the air.\n\n\n     EXT.  STREET\n\n     BUMSTEAD's running.  He looks a mess, clutching a bleeding gash\n     in his side, cuts on his face, clothes torn  -  but he made it\n     out alive...\n\n                                              CUT TO:\n\n     EXT. ROOF-TOP\n\n     BUMSTEAD sits on the ground, leans against a wall, breathing\n     heavily  -  he's losing a lot of blood.\n\n     He waits.\n\n     A NOISE O.S. startles him  -  A FIGURE in the shadows across the\n     roof.\n\n                         BUMSTEAD\n               White?\n\n     It's too big to be White.  The man steps from the shadows.\n\n                         STROMBOLI (walking forward)\n               Hello, Bumstead.\n\n     He's holding a gun, levelled at the inspector.  Bumstead lies\n     bleeding, against the wall.  He points his own gun at the\n     advancing man and pulls the trigger.\n\n     CLICK!  CLICK!  CLICK!\n\n                         BUMSTEAD\n               Dammit.\n\n     Stromboli is upon him, grabs the empty gun, throws it away,\n     picks up the inspector, leans him against the wall.  Without\n     Stromboli holding him up, Bumstead would not be able to stand.\n\n                         STROMBOLI\n               Why do you always have to find things\n               out the hard way!  Couldn't you just\n               do your job, you idiot?  I told you,\n               didn't I?  These people are not\n               playing games, Bumstead.  They can do\n               anything they want, don't you\n               understand?\n\n                         BUMSTEAD (a hiss)\n               You're one of them.  You bastard...\n\n                         STROMBOLI (laughing)\n               In a way, we all are, inspector!\n               You.  Me.  Everybody!\n\n     Stromboli carries Bumstead towards the EDGE of the roof.  He\n     keeps laughing.\n\n                         STROMBOLI\n               Time for that early retirement,\n               Bumstead.  Didn't bring the gold watch\n               I'm afraid.\n\n                         BUMSTEAD (weakly)\n               No...  Please...\n\n     INSPECTOR'S P.O.V.\n\n     THE EDGE looms up  -  a long drop to the street.\n\n\n     EXT.  STREET\n\n     White paces nervously through empty streets.  He stops, to get\n     his bearings, then turns and runs into:\n\n     A SILHOUETTED FIGURE in a bizarre metal contraption on wheels.\n     A skeletal hand reaches out to White, grabs his arm.  An inhuman\n     moan.\n\n     Terrorised, White pulls back.\n\n                         FIGURE\n               Ahhh...  it hurts!...\n\n     The mechanized figure trundles forward, pins him to a wall.  A\n     streetlight reveals...\n\n     DOCTOR SCHREBER covered in blood, encased in a metal framework\n     covered in silver blades.\n\n                         WHITE\n               What happened to you?\n\n                         SCHREBER\n               I'm...  being...  punished.\n\n     The blades are connected to the wheels  -  they turn when he\n     moves forward, metal cuts into his flesh, slowly SKINNING HIM\n     ALIVE.  A torture machine.  Between screams of intense pain, the\n     doctor speaks.\n\n                         SCHREBER\n               I had to  -  ahhhh  -  find you...  I..\n               I...\n\n     The doctor shuts his eyes, a trickle of blood runs down his\n     face.\n                         WHITE\n               What is it?\n\n                         SCHREBER\n               We are...  living in their dreams...\n\n     Schreber turns and rolls off into the night, screaming  -  BLADES\n     SPIN furiously, peeling back flesh.  He glances at White one\n     last time.\n\n                         SCHREBER\n               Insect...  dreams...\n\n\n     EXT.  STREET\n\n     WHITE is running.  As he approaches the building he hears a\n     scream  -  looks up to see a figure PLUNGE OFF the roof.\n\n     He runs over.  Looks down at the twisted body.  THE INSPECTOR\n     moans  -  barely alive.  White kneels by his side.\n\n     BUMSTEAD'S hand moves across to an expanding POOL of red beside\n     him, traces an 'H' on the ground in the blood.\n\n                         WHITE (reading)\n               Aitch?\n\n     The inspector seems to be dying, then revives momentarily, puts\n     A MAP in white's hand, looks up at him:\n\n                         BUMSTEAD\n               Gesundheit!\n\n     His eyes roll up and he GOES LIMP.  White stares at the body,\n     then:\n\n                         WHITE\n               I didn't sneeze.\n\n\n     INT.  MORGUE  -  NIGHT\n\n     The MORTICIAN turns off the lights in the main hall and steps\n     into his office, sits down, pours himself a hot drink; turns on\n     the radio, opens his conic-book.\n\n     A NOISE O.S. disturbs him and he gets up, walks out of his\n     office, looks into the darkness.\n\n     HIS P.O.V. PANS around the empty morgue.  Nothing.  Decides to go\n     back to his office.  He turns and is startled by three MYSTERY\n     MEN obstructing his path.\n\n                         MAN 1\n               We are looking for the White victims.\n\n                         MORTICIAN\n               And who the hell are you?\n\n     The mortician catches a glimpse of the shiny dagger Man 1 is\n     clutching by his side.  He becomes very scared.\n\n                         MORTICIAN\n               Over there.  Numbers eight to twelve.\n\n     THREE MEN look over to where the mortician has pointed in\n     unison.  Man 1 looks back.\n\n                         MAN 1\n               Thank you.\n\n     A FLASH OF STEEL.  The mortician's throat SPOUTS blood.  He grabs\n     reflexively at the gash and falls back onto the floor, DEAD\n     before he hits the tiles.\n\n     The Mystery Men step to an adjoining chamber.  Man 2 puts down a\n     Box he is carrying, opens the lid.  A green glow oozes out.  The\n     other Men manipulate levers on a control panel on a nearby\n     wall.  Stainless steel doors open.  Body-length trays slide into\n     the dim light.  SHAPES covered in white sheets.\n\n     Man 2 with the box removes a GLASS SYRINGE, filled with a\n     glowing green liquid.  He steps TO THE BODIES and injects each\n     with the syringe, through the sheets.  When he has finished he\n     steps back, places the syringe back in the box.  The MEN leave\n     silently.\n\n     All is silent and still.\n\n     Then the shape beneath a sheet starts to SIT UP.  Then another,\n     and another.\n\n\n     INT.  CORRIDOR  -  NIGHT\n\n     WHITE is running again, clutching BUMSTEAD'S MAP.\n\n     CAMERA PULLS BACK AND UP\n\n     REVEALS the entire corridor.  KEEPS PULLING BACK  -  until the\n     view is impossibly wide  -  like a cross-section of the building\n     he's in, a doll's house with the roof taken off.  The TINY\n     FIGURE runs, amidst a dark network of surrounding rooms and\n     passages.\n\n     CONTINUE PULL BACK\n\n     White is no more than a SPECK  -  the hall-way stretches\n     ENDLESSLY in both directions, behind and in front of the moving\n     figure, through an infinite labyrinth.\n\n     WIDER STILL\n\n     We no longer make out the figure.  The x-rayed environment\n     resembles some intricate aerial map of the vast city  -  the\n     corridor an ever increasing SPIRAL.\n\n\n     INT.  ORNATE APARTMENT BUILDING  -  NIGHT\n\n     White reaches the top of a spiral flight of stairs.\n\n     HIS P.O.V.\n\n     APARTMENT 'H'  -  a rusted metal letter on the door.  White steps\n     forward.  He knocks once and the door creaks open, unlocked.\n\n     INSIDE\n\n     The rooms are empty, derelict, strewn with rubbish.  Mould grows\n     on the damp walls.  A door stands at the end of a long empty\n     room.  He can hear the muffled sounds of SURF, SEAGULLS.  White\n     starts to walk forward, smiling.  As he approaches the door he\n     begins to feel colder.\n\n     He opens the door and looks out.  A blast of SUNLIGHT  -  blue\n     ocean and sky.\n\n                         VOICE O.S.\n               John White...\n\n     White does not turn about, he takes a step forward, then\n     another  - and RUNS INTO THE SKY  - A PAINTED WALL. He glances up\n     at a small SPEAKER built into the wall  -  the SOURCE of the sea-\n     side SOUND EFFECTS.\n\n     He hears the click of the gun being cocked behind him.  Hopes\n     dashed, he turns.  ANGLE ON A MYSTERY MAN  -  a gun pointed at\n     White's stomach.\n\n                         MYSTERY MAN\n               There is nothing, Mister White.\n               Beyond the city.  Never has been.\n               Unfortunate.  Yes?\n\n     White is led into a pitch black room.\n\n     INSIDE\n\n     TIGHT ON WHITE'S FACE  -  In the darkness  -  he looks across to\n     the Mystery Man standing beside him.\n\n                         WHITE\n               How did you know where to find me?\n\n                         MYSTERY MAN\n               We knew you would turn up here\n               eventually...  Been waiting for you,\n               yes.  Hoped you wouldn't make a\n               nuisance of yourself on the way...\n\n     The Man motions with the gun for White to walk forward.  As soon\n     as White turns to do this, the Man slips from the room and\n     shuts the door, cutting off any existing light.\n\n     A NOISE O.S.  -  some kind of machine being turned on  -  lights\n     start to come up all over the room.\n\n     It's a normal, average-sized, living room.  All the furniture\n     has been removed and replaced with chairs, tables, podiums  -  an\n     arrangement resembling an IMPROVISED COURT of law.  In fact,\n     White realizes he is standing behind some kind of witness box.\n\n     The apartment is devoid of people, though almost immediately a\n     door opens to the side (looks like it would lead to the\n     kitchen) and a series of figures step through.  MYSTERY MEN.\n\n     All the MEN take up specific positions around the room, without\n     uttering a word, but don't sit.  One MYSTERY MAN opens a curtain\n     beneath an arched entrance  -  beyond it, within a very small\n     room, stand DOZENS OF PEOPLE, crammed shoulder to shoulder.  The\n     people stare at White silently  -  a bizarre gallery of\n     spectators.\n\n     An eerie silence falls on the room.\n\n     The kitchen door opens again.  White is shocked to see the\n     VICTIMS WALK INTO the room and adopt positions in what is\n     obviously the area for the jury.\n\n     The DISEMBOWELED CORPSE OF A WOMAN steps out of the shadows,\n     pushing a pram.  Her throat is cut, she is shrouded in a white\n     sheet.\n\n     Within the pram is the BABY clutching its own head, with spine\n     attached, under its arm.\n\n     Then the mutilated FREDRICK hops out, followed by the three\n     brown blood-stained paper parcels containing what is left of\n     the YOUNG BOY.\n\n     Finally, his WIFE and the JAPANESE WOMAN, still in passionate\n     embrace, take their positions.\n\n     Another door opens  -  a closet. Within stands the figure we have\n     only seen as a shadow  -  the elderly MYSTERY MAN with the cane.\n     MISTER BLACK slowly reaches above him and pulls at a chain\n     hanging from the ceiling  -  the light snaps on inside the\n     closet.  Somewhere, a long way off in the same building, a\n     toilet is heard flushing.\n\n     He is much older than the rest, carries himself with authority\n     as he hobbles across the room to a raised podium, supporting\n     his withered body on his cane.  Looks like he will play JUDGE.\n\n     Everyone in the room now sits.  Mister Black looks at White.\n\n     ANGLE ON WHITE  -  He starts to tremble, not so much from fear,\n     but cold.\n\n                         MISTER BLACK\n               Welcome.\n\n     White just looks at him, still clutching the small notebook\n     called:  ANSWERS.\n\n                         MISTER BLACK\n               John White, you are to be tried for\n               murder, yes.  You wish to confess to\n               these crimes now?\n\n     White is silent.  He leans over and scratches his legs through\n     the fabric of his trousers.  They itch like crazy.\n\n     Mister Black turns to the assembled people.\n\n                         MISTER BLACK\n               Very well.  The testimony of the\n               prosecutors.  Yes.\n\n     TWO MYSTERY MEN stand and step across to a wooden easel.  MAN 1\n     stands beside it, reveals a series of visuals, charts, etc.\n     drawn on stiff cardboard.  MAN 2 uses a pointer while he\n     describes the evidence to support their case.\n\n                         MYSTERY MAN 2\n               We will show that John White is\n               abnormal, a menace to society, a\n               dangerous sick individual, and that\n               the court should have no mercy in\n               finding him guilty and punishable to\n               the extreme for his crimes.\n\n     MAN 1 places a large black and white photo blow-up on the\n     easel.  It shows White at the door of the JAPANESE WOMAN'S\n     apartment, clutching a kitchen knife, covered in blood.\n\n                         MYSTERY MAN 1\n               Exhibit A shows the accused leaving\n               the scene of his most recent crime,\n               yes.  A photo taken by a remote camera\n               planted by one of our agents.\n\n     White watches in stunned silence.\n\n     A general murmur of agreement through the room as the point is\n     made.  Mister Black turns to the victims, nods his head slowly.\n\n                         MYSTERY MAN 2\n               Exhibit B...\n\n     MAN 1 removes a small tape recorder, hands it to MAN 2.\n\n                         MYSTERY MAN 2\n               Actual tape recording of accused\n               committing aforementioned crime, yes.\n\n     He turns a switch, the reels spin slowly.  A hush fills the\n     room.\n\n                         VOICE 1 (sounds like JAPANESE WOMAN)\n               No...  Please...\n\n     A scream.\n\n                         VOICE 2 (sounds like White)\n               Shut up!\n\n     Another scream.  A ripping sound.\n\n                         VOICE 3 (sounds like his WIFE)\n               John!  Don't...\n\n     Another scream.\n\n     White is standing up, involuntarily, he can't listen to this\n     any longer.\n\n                         WHITE (a squeak, almost inaudible)\n               Stop it!  This is a lie...\n\n     Mister Black turns to White.  The Men testifying stop the tape\n     and look at him also.\n\n                         MISTER BLACK\n               Something to say?  Ready to confess?\n\n     The Men in the audience turn and all stare at White, as do the\n     victims and the spectators in the adjoining room.\n\n                         WHITE (back to a whisper)\n               I didn't kill anyone.\n\n                         MISTER BLACK\n               Speak up.  Yes.\n\n                         WHITE (finds his voice)\n               It's lies.  Everything.\n\n     He grips the barrier before him.\n\n     A SHRIEK from the pram containing the BABY  -  it rocks violently\n     from side to side.\n\n     The DISEMBOWELED WOMAN rises from her chair.  She has difficulty\n     standing, her limbs stiff.  She looks at White, opens her mouth\n     to say something, but no sound comes out.  Instead a tiny RED\n     CRAB scuttles out, across her face, and falls to the ground.\n     She sits down.\n\n     White is stunned.\n\n                         MISTER BLACK\n               Bring the witnesses.\n\n     AN OLDER COUPLE are led out of the kitchen by a Mystery Man.\n     Shown to seats behind a podium.  The woman looks sadly at White.\n\n                         MISTER BLACK\n               You are the accused's parents?\n\n                         FATHER\n               That's right.\n\n                         MOTHER\n               Yes.\n\n                         WHITE\n               Wait a minute...\n\n                         MISTER SLACK\n               You had your turn!  Let them speak.\n\n                         WHITE (angry)\n               My parents are supposed to be dead!\n               You can't keep changing the damn\n               rules like this!  Why go through this\n               ridiculous set-up!  Why don't you\n               just kill me and be done with it!\n\n                         MISTER BLACK (smiles at parents)\n               Please, continue...\n\n                         WHITE\n               This is insane!\n\n     He looks over to the victims.\n\n                         WHITE\n               It was them, not me.\n                    (points at the\n                    Mystery Men)\n               They killed you.\n\n     Looks back at the Mystery Men.\n\n                         WHITE\n               You have invented all this.  History\n               is a lie, not just mine, everyone's  -\n               a fiction.  You are the authors.\n\n     His knuckles go white as he squeezes tighter on the barrier.\n\n                         MISTER BLACK\n               A fanciful idea, Mister White.\n\n                         WHITE\n               Everyone has a job  -  a function.  Each\n               one teaches you more about your\n               invention.  I'm what is called a\n               murderer.\n\n     The whole court listens in silence to White's testimony.\n\n                         WHITE\n               You've given everybody memories, but\n               I missed out.  The Doctor saw to that\n               -  played your own game.  And now...\n\n     WHITE looks at the MYSTERY MEN, then back at MISTER BLACK.\n\n                         WHITE\n               You're trying to get rid of me.\n\n     There is silence.  Whispers.  Faces staring.\n\n                         WHITE\n               Why do I threaten you?  You're scared\n               aren't you?\n\n     MISTER BLACK and the gathered MYSTERY MEN look speechless at\n     White.  Suddenly everyone bursts into spontaneous LAUGHTER, led\n     by Mister Black.\n\n     A terrible cackle fills the room  -  all the MYSTERY MEN laugh\n     hysterically, so do the mutilated victims.  The spectators in\n     the adjoining room remain silent.\n\n                         MISTER BLACK\n               Ah  -  a plot.  Now we have a plot!\n                    (chuckling)\n               Very inventive...\n\n     The older couple behind the podium look disturbed.\n\n                         MOTHER\n               Please, John, you're embarrassing\n               us...\n\n                         WHITE\n               Shut up!\n\n                         MISTER BLACK (chuckling still)\n               You have proof?  Evidence?  Yes?\n\n                         WHITE (holds up notebook)\n               It's all here!\n\n     Mister Black seems startled by the book, then pretends it's\n     nothing.\n\n                         MISTER BLACK\n               A book of delusions.  Anything else?\n\n                         WHITE\n               But I...\n\n                         MISTER BLACK\n               I see.\n                    (turns to the\n                    victims)\n               The verdict, yes...\n\n                         WHITE\n               Wait, this isn't fair...\n\n     The DISEMBOWELED WOMAN stands again.  This time she opens her\n     mouth, there is a bubbling noise, water runs out, then:\n\n                         DISEMBOWELED WOMAN (whisper)\n               Guil  -  ty...\n\n     White is agitated, fear in his face.  Mister Black stamps SOME\n     PAPERS before him repeatedly.\n\n     ON THE PAPERS  -  official-looking documents.  The stamp says:\n     GUILTY.\n\n     CLOSE on White's eyes.\n\n                         MISTER BLACK\n               Before I pronounce sentence...\n\n     Suddenly the papers on the bench in front of Mister Black BURST\n     INTO FLAMES.  Mister Black recoils, almost falling off his\n     chair, taken by surprise.  The Mystery Men all look at White, a\n     murmur of concern.\n\n     Mister Black looks up at White  -  angered.\n\n                         MISTER BLACK\n               How dare you use your tricks on me!\n\n     White, genuinely surprised, looks around.  Several Mystery Men\n     BACK AWAY from him, scared.\n\n                         WHITE\n               I didn't realise...\n\n                         MISTER BLACK\n               Shut up, freak!  Monster!  You are\n               insignificant.\n\n     He glares across the room, angrily.  An WOODEN CHAIR in a corner\n     starts to vibrate.\n\n     CLOSE on Mister Black's eyes.\n\n     The chair rises into the air  -  HURLS across the room at White.\n\n     Mister Black laughs as it crashes into the wall.  White ducks\n     just in time.\n\n     The gathered Mystery Men erupt into enthusiastic applause.\n\n     White regains his composure and tries some mind tricks of his\n     own.  He lifts a small table into the air, and makes it spin  -\n     a knife and fork dance back and forth on the surface, as several\n     plates (from a stack in the kitchen) hurl, firstly at the\n     spinning table, then go flying across the room, smashing near\n     Mister Black, making him dance back and forth comically.\n\n     This display is accompanied by a rousing rendition of a WALTZ\n     playing on a floating gramophone White has also activated with\n     his mind.\n\n     SEVERAL Mystery Men are TERRIFIED.  White is amazed at his own\n     performance.\n\n                         MISTER BLACK\n               You'll regret that.\n\n     Mister Black is furious, spluttering, spit flying from his\n     mouth.\n\n                         MISTER BLACK (shouts)\n               SHUT IT DOWN!\n\n     A Mystery Man by the window, picks up a phone and dials\n     furiously.  Everyone in the room remains silent  -  waiting.\n\n                         MAN ON PHONE\n               Yes, we have a problem here.  Shut it\n               down immediately.\n\n     White doesn't understand what is going on.  O.S. the SOUND of\n     machinery WINDING DOWN.\n\n     ANGLE ON a clock hanging on the wall.  ON the SECOND HAND.  It\n     suddenly STOPS.\n\n     All eyes are on Mister Black.\n\n                         MISTER BLACK\n               This has all gone too far.  Yes, much\n               too far.\n\n     Mister Black starts to SHAKE.  His eyes shut, clenches his\n     teeth, grips the insect on his cane, plants his feet firmly to\n     the floor.\n\n     Around the room WALLS CRACK, plaster rains down from the\n     ceiling...\n\n                                              CUT TO:\n\n     EXT.  CITY  -  NIGHT\n\n     All over the city things START TO FALL APART  -  a devastating\n     impact on the landscape.\n\n     MONTAGE\n\n     A street CRACKS OPEN.  Beneath the pavement are pulsating\n     intestine-like organs.  These burst open with pus...\n\n     A building vanishes...\n\n     A car on a street corner flies into the air...\n\n     A telephone box STARTS TO SPIN, faster and taster, digging\n     itself into the concrete.  Monstrous INSECT LEGS sprout from the\n     hole left behind...\n\n     Geysers of STEAMING BILE spurt into the night sky...\n\n     BLACK EXCREMENT forces up out of a sewer, runs down stone\n     steps...\n\n     THE CITY is coming apart...\n\n                                              CUT BACK TO:\n\n     INT.  APARTMENT H'\n\n     The room looks like an earthquake hit it  -  broken furniture and\n     gaping holes torn in the walls.\n\n     Several MYSTERY MEN huddle behind an upturned table, watching\n     WHITE and MISTER BLACK.  They face each other, both still\n     standing  - mental energies focused against each other in battle.\n\n     The fighting is taken its toll on both men.\n\n     A DAGGER hangs suspended in mid-air, slowly rotating to face\n     White with its shining silver blade.\n\n     Mister Black is clenching his rotting teeth, tightening bony\n     fists by his side.  Pushing every ounce of mental power at the\n     knife.\n\n     White, bleeding from a gash in his cheek, is straining his mind\n     against the knife.\n\n     The blade STARTS TO MOVE, ever so slowly at first, towards\n     White.  His body is shaking with his mental effort.  A bead of\n     sweat runs down his brow, dripping into his eye, blurring his\n     vision.\n\n     He is losing.\n\n\n     INT.  KITCHEN  -  NIGHT\n\n     We see an OUT OF FOCUS IMAGE.  A group of dark figures.  WHITE\n     regains consciousness, strapped to a kitchen table.  From his\n     perspective, in the immediate foreground, a figure speaks as he\n     removes a syringe from White's FOREHEAD.\n\n                         FIGURE\n               Good as new.  Yes.  Everything is\n               easier now.\n\n     His vision CLEARS, he can see.  It's MISTER BLACK.  Behind him a\n     SMALL CROWD who turn out to be MYSTERY MEN.\n\n     Mister Black suddenly pulls at his own face, removes the mask.\n\n     Underneath is a mess of PULSATING ORGANS AND INSECT PARTS.\n     This is what Mystery Men really look like.  He laughs, starts to\n     MOVE rhythmically  -  a strange dance-step.  The others join in,\n     as they too pull off masks.\n\n     Each Man reaches up to his left ear in unison.  They pull\n     squirming INSECTS out, hold them up to the light.  The insects\n     scream triumphantly.\n\n     White screams too.  And he can't stop.\n\n     Everything goes BLACK.  Then the sound of a key rattling in a\n     lock.  A door slowly creaks open...\n\n\n     INT.  SEASIDE HOTEL ROOM  -  DAY\n\n     A P.O.V. enters a small room.\n\n     Dappled SUNLIGHT through a tattered lace curtain. A clock ticks\n     on a wall.  A cough O.S. from the corridor.  A FAT MAN, talks as\n     he enters:\n\n                         FAT MAN\n               It's small but clean...\n                    (it isn't)\n               ...and the view's nice.\n                    (points to window)\n               Isn't it?\n\n     JOHN WHITE enters.  He is haggard, eyes rimmed with red.  He\n     still holds the small black NOTEBOOK, tight to his chest.  He\n     stands in the centre of the room, looks up.  Strangely, though\n     the room is very small, it extends upwards several stories  -\n     windows sit at various heights.\n\n     White walks to the lace curtain, opens it with shaking hands.\n\n     OUTSIDE\n\n     A narrow street and at the end, the ocean.  The sound of distant\n     surf, he can taste the salt spray.\n\n                         WHITE (without turning)\n               I'll take it.\n\n     The man behind him blows his nose loudly and turns to go,\n     shutting the door.  White puts the notebook down on a table near\n     the open window.\n\n     LATER\n\n     White has fallen asleep on the bed.\n\n     He wakes, troubled.  Stands and walks over to the sink next to\n     the bed.  He moves like he is underwater.  The sea-breeze tugs at\n     the curtain, draws him to the window.\n\n     HIS P.O.V.\n\n     Down the street to the small patch of sand between buildings.\n     TWO FIGURES  approach each other.\n\n     He pulls out his wallet and removes the torn photo of the\n     woman, places it against the pillow on the bed.  He sits on the\n     edge of the bed and lifts his trousers, looks at his legs\n     nothing out of the ordinary.\n\n     White is disturbed by a TINY MOVEMENT in his coat pocket.  He\n     reaches in and pulls out a small, EMACIATED FISH.\n\n     Disgusted, he drops the fish to the floor, looks at the\n     creature.  White raise his foot.  His heel comes down with a\n     sickening SQUISH.\n\n     THE CAMERA MOVES IN STEADILY towards the notebook near the\n     window.  As the SHOT TIGHTENS we can read the title on the\n     cover:  ANSWERS  -  BY JONATHAN WHITE, AGE NINE.\n\n     Now a sudden GUST OF WIND blows open the book.  The pages\n     flicker past.  Glimpses of happy things.  A child's drawings of\n     smiling people.  The sun shining down on a blue ocean full of\n     sailing boats.  Fields of colourful flowers.  Cute animals.\n\n\n     INT.  LONG CORRIDOR  -  DAY\n\n     SOUND OF SURF, distant, muffled.\n\n     CAMERA MOVES slowly towards a door.  The final door  -  no\n     others beyond this.  ECHOIC FOOTSTEPS.\n\n     TIGHT ON WHITE  -  His haggard face moves through darkness.  He\n     looks down at his walking feet.\n\n     HIS P.O.V.  -  White sees water, waves breaking, through the\n     cracks in the floorboards of the hallway.\n\n     ANOTHER ANGLE\n\n     The cracks around the closed door are illuminated, white-hot,\n     by the SUN outside.\n\n     ON HIS HAND  -  As he reaches towards the handle.\n\n     ON HIS FACE  -  As the door opens.  A sharp line of light cuts\n     across his features, as his eyes blink and water.  The wind\n     pulls at his messy hair.  SURF NOISE is louder now.\n\n     REVERSE ANGLE  -  WIDER  -  OUTSIDE looking through the door,\n     along a long wooden pier jutting out into a blue seascape.  At\n     the end of the pier stands the tiny figure of A WOMAN WITH RED\n     HAIR.  She looks out at the ocean, her back turned.\n\n     ANGLE LOOKS BACK at White standing in the open doorway, squints\n     into the sun.  Suddenly he looks relieved, almost happy for the\n     first time.  He steps OUT OF FRAME briskly  -  a weight gone\n     from his shoulders.  Everything is clear finally, he knows\n     exactly what to do.\n\n     A voice recites names over a P.A. system.\n\n     REVERSE ANGLE\n\n     A TRACKING SHOT follows White, moves down the pier toward the\n     woman.  As White steps up to her, she turns and smiles.\n\n                         WOMAN  (indicates the sea)\n               Beautiful.\n\n     White nods slowly.  He looks out of place in his crumpled suit.\n     He stares out at the ocean.  Seagulls fly over.  Sun reflects\n     off waves.\n\n                         WHITE\n               Yes...\n\n                         WOMAN\n               What's your name?\n\n     He looks at her.  Smiles.  Then, slowly, brings his hands to her\n     throat.\n\n                         WHITE\n               John...  White.\n\n\n     FADE TO BLACK\n\n     CREDITS\n         \n\n\n\n\n\n\n\n   \n\n\n\n\n\n\nDark City\nWriters :   Alex Proyas\nGenres :   Mystery  Sci-Fi  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "A group of hustlers take a man for $5000 in a poker game. When the man ends up killing himself, the heat is put on the gamblers in the game. The dead man's vengeful brother begins picking off the gamblers one by one."}