{"title": "Death to Smoochy", "full_text": "Death to Smoochy\nWriters :   Marty Kaplan\nGenres :   Comedy  Crime\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "\"Rainbow\" Randolph Smiley, a corrupt children's television host, is disgraced by an FBI sting for accepting bribes from parents who want to put their kids on his show. Randolph is replaced by the \"squeaky clean\" Sheldon Mopes and his character, Smoochy the Rhino. Mopes is uniquely sincere and thoroughly interested in providing quality child edutainment, and his show quickly becomes tremendously popular. Randolph finds himself unemployed and homeless, and turns to his former associate Marion \"Frank\" Stokes for help. Stokes refuses Randolph, telling him that he can't even be seen talking to him. In an effort to return to the spotlight, Randolph hatches several schemes to tarnish the reputation of Mopes in hopes of reclaiming his time slot.\nMeanwhile, Mopes quickly finds himself losing creative control over his show to his hardened producer Nora Wells and with the help of his new agent Burke Bennett, Mopes renegotiates his contract and is named executive producer. Irish mob boss Tommy Cotter approaches Mopes and asks him to create a spot on his show for her cousin Spinner Dunn, a former boxer whose numerous head injuries have left him with brain damage. Mopes reluctantly adds Spinner to the show, first as a cowbell-wielding game warden, and later on as Smoochy's cousin Moochy.\nMopes is horrified to learn that Burke has signed him up to star in a Smoochy ice show, as he fears that the event will exploit children. Burke and Merv Green, the head of the corrupt charity running the ice show, warn Mopes not to back out of the event but he does so anyway. Soon afterward, a disguised Randolph tricks Mopes into performing a Smoochy act at a neo-Nazi rally that is raided by the police. Smoochy is branded a racist and fired. However, when Randolph accidentally lets it slip to Nora that he set Mopes up, he is arrested. Smoochy's reputation and show are restored. After telling him that his show is back on the air, Nora kisses Mopes and has sex with him, starting a relationship.\nAfter getting his show and reputation back, Mopes decides to perform in an ice show after all. Rather than involve the corrupt charities, Mopes decides that half the proceeds of the ice show should go to the drug rehabilitation clinic where he used to work while the other half to child literacy enhancement programs. The children who attend the show will be given free souvenirs and healthy snacks. Burke and Merv Green retaliate by plotting to kill Mopes and hire a new host who will cooperate with their profit skimming. Green's men accidentally kill Spinner in his Moochy costume; Tommy Cotter and her men retaliate by killing them. Meanwhile, Randolph corners Mopes and Nora in their penthouse and threatens to kill them. They talk him down and discover that he is depressed and genuinely misses entertaining children. An empathetic Mopes offers to let Randolph stay in the penthouse until he recovers.\nBennett and Stokes decide to partner up after hearing of Green's death. They hire Buggy Ding Dong, a former kid show host who became a heroin addict, to assassinate Mopes during his ice show. Buggy steals a backstage pass to get inside, but before he can shoot Mopes he is confronted by Randolph. They struggle for the sniper rifle until Buggy falls to his death. After Mopes realizes that Burke and Stokes set him up, he chases Burke into an alley. Mopes pulls a gun and threatens to kill Burke, but Tommy and her men arrive and persuade him not to forfeit his high ideals. Tommy decides to take care of Burke and Stokes in her own way, Mopes and Nora share a kiss in Times Square and the movie ends with Smoochy and Randolph launching a new show together."}